{
  "id": "16605815",
  "url": "https://archiveofourown.org/works/16605815?view_full_work=true",
  "author": [
    "Oceanbreeze7"
  ],
  "title": "Three Guys Go to a Bar(and then they Beat You With It)",
  "rating": "Not Rated",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
  ],
  "relationships": [
    "Bakugou Katsuki & Class 1-A",
    "Aizawa Shouta | Eraserhead & Shinsou Hitoshi"
  ],
  "characters": [
    "Bakugou Katsuki",
    "Shinsou Hitoshi",
    "Shinsou Hitoshi's Mother",
    "Tokoyami Fumikage",
    "Aizawa Shouta | Eraserhead",
    "Class 1-A (My Hero Academia)"
  ],
  "additional_tags": [
    "BAMF Bakugou Katsuki",
    "BAMF Shinsou Hitoshi",
    "BAMF Tokoyami Fumikage",
    "This Is Why We Can't Have Nice Things",
    "Parental Aizawa Shouta | Eraserhead",
    "Mentor Aizawa Shouta | Eraserhead",
    "Shinsou Hitoshi is in Class 1-A",
    "Supportive Class 1-A (My Hero Academia)",
    "Minor Injuries",
    "Bakugou Katsuki Swears A Lot",
    "Shinsou Hitoshi Needs a Hug",
    "Implied/Referenced Child Abuse",
    "Nonbinary Shinsou Hitoshi",
    "Quirk Discrimination (My Hero Academia)",
    "Muzzles",
    "Illegal Quirk Restraints",
    "Protective Class 1-A (My Hero Academia)"
  ],
  "language": "English",
  "series": "",
  "published": "2018-11-12",
  "completed": "2020-02-01",
  "words": "22,473",
  "chapters": "5/5",
  "comments": "604",
  "kudos": "11,412",
  "bookmarks": "3,210",
  "hits": "104,692",
  "summary": "<p>“Well, it seems a bit funny…” Shinsou’s drawling voice trailed off, becoming slightly sharper by the word, “...that the three students with the most <i>villainous quirks</i> were set up for this.”<br>Tokoyami jerked upright. “You do not mean that-.”<br>“Oh he means it,” Bakugou growled out with narrowed eyes, “ pencil-ass set us up to play his goddamn villains because we’re good at it.”<br></p>\n<p>Or:<br>Aizawa assigned Tokoyami, Bakugou, and Shinsou to play as the villains in the end year exam against the rest of the class.<br>Aizawa accounted for Bakugou's rage, Shinsou's asshole tendencies, and Tokoyami's self-esteem.<br>Aizawa did <i>not</i> account for the pure, unholy wrath, of three very petty teenagers who like to make a point.</p>\n<p> </p>\n<p>\n<a href=\"https://tvtropes.org/pmwiki/pmwiki.php/FanFic/ThreeGuysGoToABarAndThenTheyBeatYouWithIt\" rel=\"nofollow\">Here's the TV Tropes page, because apparently chaos loves company</a>\n</p>\n<p>Shinsou has too much junk in his trunk, and by junk I mean uncontrollable daddy issues, mental trauma, and a fetish for bondage gear that turns out to actually not be bondage gear or fetish or <i>anything fun at all.</i></p>\n<p>Basically<br>More discussion, talking about how to actually go about this<br>Next chapter? The official fights come into play.</p>\n<p>Sorry it's been so long, life got away from me.<br>Enjoy!</p>\n<p>It's time to finally put those costumes to good use.</p>",
  "notes": "<p>Lets do this, I was born ready for some good old booty kicking.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>So, for some reason, I like making my children go through angst and trauma but in my defense, I'm <i>really really good at it </i></p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>\n<a href=\"https://discord.gg/SVrMbMS\" rel=\"nofollow\">Join the discord server to scream at me and I'll scream back!</a>\n</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>\n<a href=\"https://discord.gg/SVrMbMS\" rel=\"nofollow\">Join the discord server to scream at me and I'll scream back!</a>\n</p>\n<p>You know, I've been meaning to finish this forever.<br>Oops, my bad.<br>Come on everyone, enjoy. It's time for REVENGE.</p>\n<p>\n<a href=\"https://discord.gg/SVrMbMS\" rel=\"nofollow\">Join the discord server to scream at me and I'll scream back!</a>\n</p>",
  "text": "<p>They had expected the final to be something like the years before; where they would be paired up and assigned a Pro-hero to face, and ultimately get beaten by. They always managed to pull through, either with pure will, grit, or quick thinking, but they always expected to be facing someone far out of their league with severe handicaps.</p>\n<p>The end of the year was still far away, almost two months out. Some students hadn’t even thought of it yet (Kaminari and Ashido the prime examples), while other students were already piling together notecards and review guides, going over previous quizzes and tests for any small clue.</p>\n<p>The written tests were hard, but the practical exams were even harder.</p>\n<p>They had to be with how society was changing, with how villains and vigilantes roamed the streets and caused more chaos and disorder than normal. Everyone was under a close watch,waiting with held breaths for the moment someone would inevitably mess up.</p>\n<p>Mineta was first, expelled the instant the next report was filed against him for sexual harassment. The purple boy was there one day, then gone the next. His things were covered with a tarp and hauled out by a moving company the very next day.</p>\n<p>A week later, Shinsou moved in with spitting words and metaphorical hackles raised. The insomniac wasn’t exactly <em> welcome, </em>but everyone knew he was better than Mineta by leaps and bounds.</p>\n<p>(Very few people bothered Shinsou anyways, except Midoriya but that didn’t mean much.)</p>\n<p>Shinsou aggravatingly was intelligent, very intelligent. He was quickly combating the others for the top five ranking in the class, pulling out all the tricks to try and wrangle a few extra points. Iida was quickly stressed under the pressure, Bakugou settled for literally exploding on the boy.</p>\n<p>(Shinsou retreated after a few sharp barbs and guarded glances. Shinsou didn’t study in the main room again after that.)</p>\n<p>Oijiro didn’t take the new student adjustment well, which was surprising considering how calm the blonde normally was. Oijiro didn’t exactly <em> say </em>anything, but he did tense up and keep his conversations short whenever Shinsou slinked into the kitchen area to fish around for anything to eat. Shinsou could easily read the atmosphere, although he acted like he didn’t care. He also drank an obsessive amount of coffee which both felt simply wrong to Momo (and her ridiculous passion for tea).</p>\n<p>When they were paired for sparring, that’s where things really shifted. Oijiro was a good hand to hand partner, his tail offered a strong blunt force that could both attack and defend. Generally he swapped between multiple partners, offering advice and assistance to anyone who needed it. He was paired with Shinsou by Aizawa (who had dozed off almost instantly). Oijiro ended up fighting, twisting and kicking with more aggression than normal. Shinsou held his own for a while, but without using any sort of equipment or quirk, he couldn't hold out. The punches could be deflected, the kicks could be dodged. The tail broke two of his ribs and hairline fractured his forearm.</p>\n<p>The fight kept going until Shinsou was thrown violently across the ground, curling protectively over his side with his teeth bared and broken arm curled protectively near his chest. Shinsou looked ready to go again, face filled with an unsettling level of wrath that normally only graced Bakugou’s face.</p>\n<p>Oijiro paused for a moment, before he guiltily woke Aizawa.</p>\n<p>Aizawa made sure not to pair Shinsou with any of the heavy hitters from then on out.</p>\n<p> </p>\n<p>“Shinsou, Tokoyami, see me after class.” Aizawa sighed from his desk, looking ready to lean too far forward and collapse onto its surface like it was a pillow.</p>\n<p>Tokoyami instantly stiffened in alarm, Shinsou didn’t even turn his head to glance to where the teacher was sitting.</p>\n<p>The atmosphere in the room steadily returned to normal, nobody paying any mind to the interruption until class ended and people started to gather their things. Kirishima was already excitedly chattering about something, Kaminari gleefully joined in.</p>\n<p>“Oh, Bakugou, you too.” Aizawa called, opening one eye lazily. The blonde hair huffed and slammed himself back into his seat, Kirishima and Kaminari traded worried looks.</p>\n<p>It wasn’t common that Bakugou got called to wait after class; he normally only had to if he had broken the rules but those incidents were loud, and well known before any teacher intervention.</p>\n<p>“Yeah bro, ah, see you back at the dorms.” Kirishima awkwardly called with a small wave, slipping out the door and closing it behind him. The sounds of the hallway was muted noise, a low rumble in the unexpected quiet of the room. It was equally uncomfortable with how spread apart they were in their seats.</p>\n<p>“Alright,” Aizawa sighed, leaning back on his chair to wriggle out of his sleeping bag. Tokoyami felt his heart drop; Aizawa only left the sleeping bag when someone had failed a test, disappointed <em> him, </em>or he was preparing himself to thoroughly beat one of his students with blunt force trauma.</p>\n<p>“I’ve been...<em> forced </em> to talk with Principal Nedzu,” Aizawa continued bluntly, scratching one of his cheeks, “we’ve got a trial run, and by that I mean you can’t back out or I’m expelling you for making my life harder.” Oh no, they <em> were </em>going to be experiencing blunt force trauma. Bakugou clicked his tongue and slammed both of his thick boots on his desk. He leant so far back on his chair, it was a marvel he hadn't tipped over. He jerked his chin up, closed his eyes, and waited.</p>\n<p>Tokoyami peered out of the corner of his eye to see Shinsou looking just as calm in the unsettling way he always did. One arm rested on his desk to prop his chin up, the other was lazily twirling his pen without any care. Neither of Tokoyami’s classmates looked concerned; Tokoyami himself could feel anxious sweat prickle at the nape of his neck.</p>\n<p>“Alright, here’s the papers that I made someone else draft up,” Aizawa sighed, sliding a thick stack across his desk. Neither Shinsou, Bakugou, or Aizawa looked like they’d be getting up anytime soon. Tokoyami resisted the urge to gulp.</p>\n<p>The clock ticked on, the silence stretched further. Aizawa looked content to go back to sleep, Bakugou already <em> looked </em>asleep, and Shinsou was now twirling his pen so quickly Tokoyami imagined the purple haired teen had experience with fidget spinners.</p>\n<p>The pen was now a blur. If Shinsou could weaponize his boredom, Tokoyami feared for the world.</p>\n<p>Tokoyami lunged to his feet, his chair scraping loudly across the floor. Nobody reacted to the loud noise except Tokoyami’s own frantic heartbeat. Dark Shadow perked up, nudging against his consciousness curiously. Anxiety thrummed and Dark Shadow coo’ed gently to settle it once more. Tokoyami grabbed the papers, separating them by the three staples, and passed them out efficiently.</p>\n<p>Shinsou sighed and looked down at the packet that landed on his desk; the pen stopped <em> instantly. </em>Tokoyami feared for his life.</p>\n<p>“Wait,” Shinsou blurted sharply, Bakugou’s eyes flashed open although they stared straight ahead only. “Wait, Sensi are you <em> kidding me?” </em></p>\n<p>Bakugou’s eyes flickered downwards, reading the bolded title from where it was splayed sideways near his boots.</p>\n<p>“What.” Bakugou deadpanned flatly. It sounded like the two had changed personalities almost.</p>\n<p>Tokoyami spared a hesitant glance at his own sheet, feeling his heart throb painfully in his throat.</p>\n<p> </p>\n<p>\n<em> UA OPPOSITIONAL FINAL: Mandate-Requirements-Villainous-Opposition </em>\n</p>\n<p>Tokoyami blinked in confusion, flipping the page slowly.</p>\n<p>Shinsou by contrast was flipping through the entire (hefty) packet with a furious speed. Bakugou grabbed it all in one fist and waved it menacingly as he screeched at their teacher: <em> “What is this bullshit! I don’t give a fuck about your goddamn teacher crap-!” </em></p>\n<p>“If you <em> be quiet,” </em> Aizawa started with a frown, “I’ll <em> explain.” </em></p>\n<p>Bakugou slammed his feet on the ground and gritted his teeth together with enough force it sounded louder than Tokoyami’s beak clicking.</p>\n<p>“Now,” Aizawa ran one hand through his hair tiredly, “In the past our final exams generally composed of staff or Pro-Heros testing your abilities in combat. Since this entire <em> year </em>we’ve been doing that, it seemed more appropriate to alter the exam into a more real world applicable scenario.”</p>\n<p>Shinsou huffed loudly, “the exam that’s <em> months away?” </em></p>\n<p>Aizawa’s eyes flickered up with an expression able to make All Might cry. Shinsou didn’t blink. Tokoyami had never felt closer to death.</p>\n<p>“This is <em> bullshit.” </em> Bakugou cursed under his breath, skimming through the pages before he pointed at one section dramatically. “Here! You want <em> us </em>to be your goddamn villains! Why don’t you hire that dolphin freak again!”</p>\n<p>Aizawa’s face twitched slightly. “Gang Orca is busy. You brats aren’t. You do this or I’m kicking you out right now.”</p>\n<p>Shinsou huffed again, squinting at the paper. “Sensei, page nine. You’re <em> giving us </em>Ground Gamma?”</p>\n<p>Aizawa’s face didn’t shift. “Ground Gamma is officially closed for renovations to the public. You three are exempt from this, and are permitted access to all buildings and facilities inside. If you keep reading, you’ll see the contact information and proper request forms for equipment and device alterations within the grounds itself.”</p>\n<p>Tokoyami searched, his beak dropped.</p>\n<p>Bakugou exhaled in a quiet rush, startled and for one speechless over the permissions.</p>\n<p>“<em> Obviously,” </em> Aizawa started, pinching the bridge of his nose between two fingers, “you can’t do any changes that alter the blueprints of the ground itself. Anything within buildings, as well as the electronics are completely customizable given that your request is <em> reasonable. </em>You all are intelligent students, I’m trusting you to not fuck this up.”</p>\n<p>Tokoyami summoned his courage to speak up, “Aizawa-Sensei, how are we to be scored than?”</p>\n<p>Aizawa had the first spark of sadistic amusement in his eyes. Bakugou was starting to look interested.</p>\n<p>“You’ll be graded according to how you factor in the flaws of your opponents, and how you operate to overcome advantages.” Aizawa pulled out a copy of his own packet, flipping through before settling on a page past theirs, “It’s stated that you will be submitting to <em> me, </em>your organized roster for exam teams. Once I agree that each team is weighted fairly, you have until the final exam to provide a countermeasure plan that addresses each member of your opponent, as well as a Individual Analysis Report.”</p>\n<p>Shinsou gave a brisk nod like it wasn’t anything unusual. Bakugou didn’t seem phased, Tokoyami already felt overwhelmed.</p>\n<p>“You can detail on the map on the back of each of your packets what you plan to do to Ground Gamma as well as how you plan for the arena to be divided per team. You only get the blueprint there, so make copies for each submission. Your plans are all due the week before finals so I can check to see if anything planned is illegal or too dangerous for bodily harm. Considering the fact you all beat each other up every day and Midoriya breaks his bones <em> weekly, </em>I really don’t care how chaotic you make this.”</p>\n<p>Aizawa had the signature grin that spoke of danger. It was looking quite horrible. “You’ll be designating teams of three. There are seventeen students remaining, which means you are required to create five teams of three and one two pairing students. Since I value my life and I am <em> tired of you all, </em>I am mandating that in the group of two at least one of the partners must be either Todoroki or Midoriya.”</p>\n<p>Shinsou flicked through the pages, his frown deepening. Bakugou had an expression that was impossible to read, blank yet still imposing. Tokoyami couldn’t’ think of how to react to such a massive assignment.</p>\n<p>“Sir,” Shinsou spoke up in a lazy drawl, a quick glance at his face showed that the purple haired boy was anything but relaxed. “You said we’re the opposing group. It doesn’t say anywhere in this packet what in particular our assignment is. We’re...villains, but what crime are we committing. What is the scenario.”</p>\n<p>Aizawa grinned sharply, looking very very cruel. “A different one per team.”</p>\n<p> </p>\n<p>Shinsou was terrifying to approach. Bakugou was almost worse. Tokoyami felt very very out of place.</p>\n<p>“You okay?” Shoji asked him, eyes tracing the disaster waiting to happen. Midoriya was trying to settle it, holding his hands up to try and prevent a brawl from breaking out between a fuming Bakugou and a cool as ever, Todoroki.</p>\n<p>“Ah, yes.” Tokoyami assured him, wishing that his feathers would lie flat. “I was given an assignment by Aizawa-Sensei. I am afraid I cannot discuss it.”</p>\n<p>Shoji shrugged, “that’s fine. You seem stressed.”</p>\n<p>“I am.” Tokoyami confessed, beak clicking ever so slightly. “I am afraid that failure is not an option as well.”</p>\n<p>Bakugou shrieked, launched himself across the table with an explosion primed. Todoroki responded with a sharp wall of ice. Midoriya responded by screaming.</p>\n<p>Good god, why was <em> he </em>partnered with that volatile monster?</p>\n<p> </p>\n<p>It took a day before Tokoyami was targeted. In truth, he had wandered downstairs for something to eat and caught the eye of a specific purple haired individual.</p>\n<p>Shinsou sat on a throne of pillows, uncaring that he was being swallowed by blankets and pulse cushions. He looked like he had been lazily waiting.</p>\n<p>Tokoyami paused, glanced at the clock, then peered back.</p>\n<p>“I’ve been waiting.” Shinsou bluntly deadpanned, nodding to the chair across from him.</p>\n<p>“It’s four in the morning.” Tokoyami almost stuttered, “we have classes in three hours.”</p>\n<p>Shinsou blinked slowly. “I understand that may intimidate some people, but I fear nothing.”</p>\n<p>Tokoyami felt a metaphorical head perk up in interest.</p>\n<p>“All must fear something,” Tokoyami sagely confessed, walking closer to the throne room of threadbare blankets and decorative scratchy pillows. “The darkness reveals all.”</p>\n<p>Shinsou almost smiled. “You fool. I can’t see in the dark.”</p>\n<p>Tokoyami could almost hear the record scratch as his mind restarted.</p>\n<p>“So, since Blasty is off contemplating manslaughter,” Shinsou started, pulling out a notebook that looked brand new. The cover had green swirls all over it. “I’ve been trying to figure out what Sen-shit is making us do.”</p>\n<p>Tokoyami gaped, “you- you cannot just-.”</p>\n<p>“That man threw a raw fish at my face and it <em> hit me.” </em>Shinsou stated in a pleasantly calm voice. He smiled thinly, eyes black and bottomless. “I fear no god.”</p>\n<p>Tokoyami shivered.</p>\n<p>“So, your quirk has something to do with light, yeah?” Shinsou yawned. His mouth opened obscenely far, jaw popping ever so quietly. “Midoriya ranted about it I think before I learned how to ignore everything he says. I’ve been trying to chop the class up but I don't exactly know everyones quirks. I figure you know everyone better than Mr. Short fuse.”</p>\n<p>Tokoyami felt like he was the one who had been slapped by a fish instead.</p>\n<p>Shinsou opened his notebook, reversing it. He had scribbled out in dark pen a list of everyone's names and rudimentary information about their quirks. Some of the information was a bit more extensive than others. Oijiro simply had ‘<em> fuck kangaroo’ </em>written hastily next to it.</p>\n<p>“Right.” Tokoyami nodded slowly, “Ashido I believe can adjust the pH of her acid to become alkaline also. It is not only acidic.”</p>\n<p>Shinsou nodded slightly, ripping out a sheet of paper before he started to scrawl sloppily on his knee. Tokoyami tentatively picked up the notebook to squint at the other notes.</p>\n<p>“Are you attempting to determine which quirks create fire?”</p>\n<p>Shinsou hummed flatly before pointing at the notebook, “not really. If you know more write it down. I’m not failing after all my hard work because Blasty can’t stay up past his bedtime. Aoyama, frenchie. What do you know.”</p>\n<p>Tokoyami’s feathers puffed in a fluster. “He...his naval laser is...powerful however not entirely-.”</p>\n<p>“Does it make heat? Energy? Or just sparkly like a disco ball.”</p>\n<p>Tokoyami’s beak clicked. “...Energy I believe. It is enough to repel Dark Shadow.”</p>\n<p>Shinsou tilted his head slightly and scribbled something down with an inquisitive sound, “so we split up the fire, electricity and raw power. I’m sticking Todoroki with Hagakure, it’ll make him slow down a bit.”</p>\n<p>Tokoyami felt frazzled, “you plan to have Midoriya in a group of three?”</p>\n<p>“He has a hero complex,” Shinsou muttered defensively, “he’d spend the whole time chasing after his partners if we split him up instead of taking on the goal at hand.”</p>\n<p>Tokoyami nodded in thought, “I see. Who do you intend to partner him with?”</p>\n<p>Shinsou paused, then looked at Tokoyami. He wasn’t sure what the purple haired individual was looking for, but his eyes scanned all across his features. Across the curve of his beak, the comfortable flannel he was sleeping in, all the way down to the modest slippers over his feet.</p>\n<p>Shinsou nodded very slowly, still looking guarded but ever so slightly less tense. “Alright. I’m thinking of sticking Ashido and Koda with him. Ashido doesn’t plan I don’t think, and Koda is timid. Ground Gamma has a warehouse sector that has an underground labyrinth, small hallways and lots of corners. It should be easy enough to split them up, and scare them into messing up.”</p>\n<p>That...made an alarming amount of sense.</p>\n<p>“Sato and Shoji,” Tokoyami muttered unsure, “they rely on heavy strength but have recognizable weaknesses.”</p>\n<p>“They’re exposed.” Shinsou mused with a small frown, “...I don’t think any explosions would damage them, but they need something that works against them.”</p>\n<p>“Kirishima too.” Tokoyami interrupted, scribbling down on paper, “against a sort of...threat which requires careful coordination and balance.”</p>\n<p>Shinsou <em> grinned, </em>it was small and predatory. His eyes skimmed over his notebook again. He pulled out a folded piece of paper, uncurling it. Tokoyami recognized it as a full class roster.</p>\n<p>“Kaminari and Jiro.” Shinsou circled pointedly, “the moron is obsessed over her. They rely too much on electronics. I would put Aoyama in there but we need to spread out the energy users.”</p>\n<p>“If you put in Iida, that leaves Yaoyorozu with Asui and Aoyama.” Tokoyami warned him. Shinsou paused before he frowned heavily.</p>\n<p>“Asui is the blunt one, right?” Shinsou muttered before he crossed out her name, swapping it with Iida. “That’ll maybe work?”</p>\n<p>Tokoyami looked over the list again and nodded hesitantly. It seemed realistic, and it seemed like a decent plan of attack.</p>\n<p>“Great,” Shinsou stretched, snapping his neck and hands obnoxiously loud, “I’m sending it to Blasty. He’ll likely scream at us later.”</p>\n<p>Tokoyami watched as Shinsou took the list and copied it out efficiently, barely glancing at each name before spelling it properly. It was looking like a good plan overall.</p>\n<p> </p>\n<p>\n<em> Todoroki, Hagakure </em>\n</p>\n<p>\n<em> Yaoyarozu, Iida, Aoyama </em>\n</p>\n<p>\n<em> Sato, Shoji, Kirishima </em>\n</p>\n<p>\n<em> Ashido, Koda, Midoriya </em>\n</p>\n<p>\n<em> Kaminari, Jiro, Asui </em>\n</p>\n<p>\n<em> Sero, Oijiro, Uraraka </em>\n</p>\n<p>Everything seemed pretty well balanced. Shinsou liked it, so he sprawled himself out even further on his mound of pillows and blankets. A stuffed animal cat rolled off the edge like a dramatic reenactment of the Lion King.</p>\n<p>“I’m going to get a glass of water.” Tokoyami awkwardly broke the silence, “would you perhaps like one?”</p>\n<p>Shinsou didn’t blink. If Tokoyami had a flashlight, he wouldn’t be surprised if Shinsou’s eyes glowed. “No thanks, I like being salty.”</p>\n<p>Tokoyami didn’t know how to respond, so he grabbed his things and left.</p>\n<p> </p>\n<p>Bakugou slammed into the kitchen and smashed his palms against the counter-top. The counter, made to withstand explosions of all sorts, didn’t even tremble. Unfortunately, Tokoyami trembled hard enough he fell off his chair.</p>\n<p>“What the <em> fuck </em>is this, you Fuckmunches!” Bakugou hissed. Pinned under his left hand was the piece of paper with Shinsou’s handwriting.</p>\n<p>“Fuckmunch.” Shinsou repeated dryly from where he was pawing through snacks that were clearly not his, “clever.”</p>\n<p>Bakugou looked ready to pick up the chair Tokoyami fell from, and chuck it at the back of the purple haired head.</p>\n<p>“We came up with a list of possible arrangements.” Tokoyami rushed to sooth, feeling Dark Shadow perk up in preparation of halting any situation that occurred. “We felt that it was best to divide groups in such way.”</p>\n<p>Bakugou looked pissed, but there was something under it. “And you bitch trees did it <em> without me?” </em></p>\n<p>“Bitch trees,” Shinsou whispered to himself with almost a smirk, “calm your tits. You were sleeping.”</p>\n<p>A vessel throbbed in Bakugou’s temple.</p>\n<p>“It was late and we were tortured by the horizon of sleep.” Tokoyami soothed, “It ailed us and we found mutual comfort in misery.”</p>\n<p>Shinsou used his hip to close a nearby cupboard, peeling open a wrapper on some sort of protein bar that looked like the type Midoriya ate. Bakugou recognized it, before he huffed approvingly.</p>\n<p>“Translation,” Shinsou started casually, “quoth the raven, two insomniacs did your goddamn homework.”</p>\n<p>Bakugou started bristling almost immediately. “Well it’s not <em> my </em>fault you lazy fucks were up all night.”</p>\n<p>“Check the list.” Shinsou nodded, ignoring Bakugou’s barbs. “You got comments? Cool, let's move this somewhere private so Sensei doesn’t bring out the dead fish.”</p>\n<p>Bakugou blinked in agitation, “<em> dead fish? </em>What the fuck are you on-.”</p>\n<p>“Aizawa-Sensei threw a dead fish at him.” Tokoyami tried to remedy. “He floundered at the action and-.”</p>\n<p>“It was a <em> mackerel </em> you insensitive <em> fuck.” </em>Shinsou hissed.</p>\n<p>Bakugou choked out a strangled noise that may have been a laugh if not for the way he punched Shinsou in the neck.</p>\n<p>“I love the room,” Shinsou drawled bluntly, reclining back against the wall with his legs stretched out in front of him. “Very nice, really love the aesthetic. Reminds me of a catalogue.”</p>\n<p>“If you don’t stop talking I am going to grab your shoe and choke you with it.” Bakugou rumbled low in his throat, sprawled across his bed with a mound of textbooks aside him. “Then push you out the window.”</p>\n<p>“Oooh,” Shinsou muttered back absentmindedly, “defenestration. Original.”</p>\n<p>Bakugou huffed a small snort from his nose, and pointedly ignored Shinsou.</p>\n<p>Tokoyami wasn’t exactly sure why he was in the room. It felt like he was in the middle of two opposing forces, and at some point they would clash in the absolute worst way. Bakugou was chaos in a poorly restrained form, and Shinsou...was a dick.</p>\n<p>“May I be of any assistance, Bakugou?” Tokoyami offered unsure. Bakugou didn’t even glance up.</p>\n<p>“I dont write with quills, idiot.” Bakugou huffed out, scribbling furiously. Tokoyami felt at a loss. Shinsou looked ready to snicker, mouth quirking to the side in an expression that clearly was asking to be punched. The bags under his eyes colour coordinated with his hair.</p>\n<p>“Seriously, I love constructive criticism but there couldn’t have been <em> that many </em> flaws with my work.” Shinsou <em> pouted, </em>eyes nearly glowing from across the room. “But I mean if you just don’t like my handwriting, well, that’s being mean.”</p>\n<p>Bakugou looked at him in outright disgust. “Are you <em> naturally </em>this much of an asshole?”</p>\n<p>“Nah, refined skill. I don't have your natural talent.” Shinsou instantly responded, yawning to slump against the wall bored, “if you’re just going to sit there, I’m taking a nap.”</p>\n<p>Bakugou exhaled through his nose sharply. His palms snapped like carbonation in soft drinks except louder than bubble wrap.</p>\n<p>“Perhaps we should discuss our plans.” Tokoyami tried to soothe, already feeling tired. “It will do us no favours to not share our knowledge.”</p>\n<p>Bakugo twisted, forcing himself upright to slam a thick textbook closed. Shinsou opened one eye in dull interest, Tokoyami jumped at the sudding noise.</p>\n<p>“Look then, you bitches.” Bakugou hissed out, practically bristling at the attention, “I fixed all your goddamn shit. You put that goddamn scooter in with the creating bitch. We don’t need <em> two </em>people with high scores in a group.”</p>\n<p>Shinsou’s brows furrowed as he sat up to squint at the paper. “I <em> swear </em>I changed that.”</p>\n<p>“Well obviously you dopey eyed freak, you <em> didn’t.” </em></p>\n<p>Shinsou recoiled with a small offended expression.</p>\n<p>Bakugou’s writing was...<em> neat. </em>It looked nearly textbook if not for the small inflections on certain letters. It looked pristine and well written, even small scribbles in the margin were clearly legible.</p>\n<p>“That two faced bastard and that eyesore work because he won’t be freezing the damn joint.” Bakugou grunted towards where he cleanly wrote out:  <em> Group 1: Todoroki, Hagakure </em></p>\n<p>“Then split up the smart ones you <em> morons. </em> Keep them <em> apart.” </em></p>\n<p>Beyond that and a few minor changes, they were...nearly the same. Small details on the side for various ideas or blaring weaknesses and...Tokoyami was impressed, it was similar to Shinsou’s own ideas.</p>\n<p> </p>\n<p>\n<em> Group 2: Yaoyarozu, Uraraka, Aoyama </em>\n</p>\n<p>\n<em> Group 3: Sato, Shoji, Kirishima </em>\n</p>\n<p>\n<em> Group 4: Ashido, Koda, Midoriya </em>\n</p>\n<p>\n<em> Group 5: Kaminari, Jiro, Asui </em>\n</p>\n<p>\n<em> Group 6: Sero, Oijiro, Iida </em>\n</p>\n<p>Shinsou’s face twitched slightly as he looked over the list, then his expression blanked. His eyes flickered at Tokoyami who nodded at the list as well.</p>\n<p>Shinsou sat up, his lazy expression and demeanor shifted into something guarded and cautious. “So. You noticed it too?”</p>\n<p>Bakugou tensed slightly, his jaw locked.</p>\n<p>“...I do not understand.” Tokoyami mentioned  quietly, glancing quickly back and forth between the two.</p>\n<p>Shinsou looked tense although his face shifted into something loose and carefree. It actually resembled Aizawa’s a fair amount.</p>\n<p>“Well it seems a bit funny…” Shinsou’s drawling voice trailed off, becoming slightly sharper by the word, “...that the three students with the most <em> villainous quirks </em>were set up for this.”</p>\n<p>Tokoyami jerked upright. “You do not mean that-.”</p>\n<p>“Oh he means it,” Bakugou growled out with narrowed eyes, “ pencil-ass set us up to play his goddamn villains because we’re <em> good at it.” </em></p>\n<p>Tokoyami shook his head slowly, “no, I do not believe that our teacher would place us in such a predicament if he did not have our best interest in mind.”</p>\n<p>Shinsou barked out a single unsettling laugh. “I texted him and he sent me back a picture of a cat, <em> flipping me off. </em> That man is a goddamn <em> dick!” </em></p>\n<p>Bakugou barked out a laugh in response. “Join the fucking club, you purple tumbleweed. You going to help me fuck his shit up or do I have to plan how to wreck every single person in our goddamn class, <em> myself?” </em></p>\n<p>Shinsou cracked his neck and knuckles. “Bitch, I was born to prove dickheads wrong. You in, quoth the raven?”</p>\n<p>Tokoyami sighed, “we’re being graded on our performance….Nevermore.”</p>\n<p> </p>\n<p>Bakugou took his position of training seriously. So seriously, that in the next forced training assignment the blonde hair teen stomped over, nearly decked Jiro in the face to drag off her partner to his section. Shinsou gurgled when his airways cut off momentarily, his nails instantly curled to dig into Bakugou’s hand.</p>\n<p>“That’s weak as shit.” Bakugou sneered, “I have calluses, dumbshit.”</p>\n<p>Shinsou glared, bared his teeth like an alleycat, then grabbed Bakugou’s wrist with both hands and <em> twisted. </em></p>\n<p>It maybe wouldn’t do anything in a fight, but the forced tearing of his skin made Bakugou let go with a hissed breath. Shinsou skittered away, staying low to the ground although he looked thoroughly frazzled. The purple haired teen was a <em> menace </em>in areas where he could hide and jump around, but in an open area he wasn’t harder to fight than Racoon Eyes on a good day.</p>\n<p>“You fight like a back street hooker.” Bakugou spat out, keeping his arms lifted. They were fighting without equipment, although for some reason Shinsou had a decent mouthguard in place, wrapping around his teeth to keep them equal spaced. It made sense, Bakugou always wrapped his knuckles when sparring. If Shinsou’s quirk relied completely on his voice, than he’d have to protect his jaw to some level. It also explained the eyesore on his hero costume.</p>\n<p>“Come on!” Bakugou shouted, sending low blasts to the side for emphasis. The shock up his forearms was a familiar burn, sending a grin on his face. Shinsou did <em> not </em>look excited. It took almost the entire time allotted before Shinsou got a single hit in- although it was weak and didn’t do much. In comparison, Shinsou’s hair wasn’t nearly as wild as before. His eyes were wide, the dark rims under them nearly bright red with how bloodshot his eyes were. Nostrils panting for breath, and bruises already forming.</p>\n<p>“Alright, times up.” Aizawa announced from across the field with a tired wave. “Leave, get out of here. <em> I </em>am. If you get injured it’s not my problem. Bye.”</p>\n<p>On cue, everyone started getting ready to leave, Shinsou straightened slowly and reached up to fish out the thick guard that had been clogging his mouth. Bakugou did a second take the moment he noticed how <em> long </em>it was- it must have gone nearly all the way to the back of his throat, no wonder he couldn’t fucking breathe.</p>\n<p>“I can take a hit.” Shinsou croaked out, although his face didn’t waver. His eyes were dark. “Keep going.”</p>\n<p>Bakugou grinned. Shinsou inhaled shakily through his nose.</p>\n<p> </p>\n<p>Tokoyami opened his door and stepped inside his room, noticing instantly the sheafs of paper that had been thrown under. Some of them were carefully written on, the others were in bright bold shades of blue. It looked almost like marker.</p>\n<p>Tokoyami picked up the papers, sorting through them the best he could. It was the blueprints of Ground Gamma, copied in blank forms as well as a few copies already drawn over. Sectors marked out in Bakugou’s handwriting for areas to consider or investigate, Shinsou’s obnoxious marker drew out clear ambush points as well as pathways Tokoyami wouldn’t have noticed otherwise.</p>\n<p>“Right.” Tokoyami sighed, running one hand through his preened feathers. They would have to start working on customizing areas if they wanted to have everything ready to go by the time finals came around. There was a <em> lot </em>of work ahead of them.</p>\n<p><br>\n<br>\n<br>\n</p>\n<p>Ground Gamma was a confusing place, a labyrinth of pipes and warehouses that made a maze few people could navigate. It wasn’t too chaotic for them, but there was a strange surreal factor with how the entire ground was quiet.</p>\n<p>There weren’t any operational background noises that ran when the ground was running at full capacity. It felt empty and cold, large, but still empty.</p>\n<p>Shinsou on the other hand, <em> excelled. </em></p>\n<p>It was strange to watch, Tokoyami found himself with his jaw dropped on multiple occasions when the purple haired boy casually launched himself into the mess of piping, vanishing from sight almost immediately. Sometimes he’d grab a glimpse of him one to see him slip out of sight, then appear almost twenty feet higher. Bakugou wasn’t having any difficulty, using his explosions to lift him to vantage points he used to scour the location. One of the maps of the grounds was tucked into his waistband.</p>\n<p>“You coming?” Shinsou asked casually, leaning with his arms crossed on a <em> very narrow </em>shelf so high up it made Tokoyami dizzy. The brainwasher didn’t look disturbed at all.</p>\n<p>Dark Shadow helped him slowly make his way skywards, up to the top where Shinsou was already waiting with a notebook and a dozen glitter pens. Tokoyami was almost certain the glitter pens were to piss of Bakugou.</p>\n<p>“Alright great,” Shinsou squinted over to the left, tilting his head ever so slightly. “I’m mapping out this sector here, the one with all these stupid pipes. I’m thinking maybe like, trying to fill them with some sort of...acid. Or something dangerous.”</p>\n<p>Tokoyami caught on quickly enough. “For Shoji and Sato.”</p>\n<p>“Bingo,” Shinsou squatted, using his teeth to pull the cap off one bright green pen, “I’ll chat with support. I know them pretty well at this point. They bust a pipe, they lose.”</p>\n<p>Tokoyami shivered slightly from a breeze at the top of the building. “How do you plan to deal with the other groups?”</p>\n<p>Shinsou shrugged and began doodling what looked like a hedgehog in a wire trap. “Take a group, figure it out. You have beef with anyone?”</p>\n<p>Tokoyami didn’t but he didn’t think his other two group members would understand how to be nice to <em> everyone. </em></p>\n<p>“I can manage anything underground or with minimal lighting.” Tokoyami offered weakly. Somewhere in the distance, something exploded loudly.</p>\n<p>“Cool,” Shinsou nodded, tilting his head to add shading to the porcupine’s face. “Do you think Bomb squad over there would be up for a challenge.”</p>\n<p>“Oh no.”</p>\n<p>“Oh <em> yes.” </em></p>\n<p> </p>\n<p>“Alright,” Shinsou started loudly, kicking down Bakugou’s door to waltz in and spin, landing sprawled on the blonde’s back, “I got like, a couple swimming pools worth of gasoline, don’t ask me how it was a lot of flirting.”</p>\n<p>A pause.</p>\n<p>Shinsou peeked one eye open to stare at the two occupants in the room. “Oh hey, you’re the shark one. Kirishima right?”</p>\n<p>Kirishima balked, staring at the door (which was slowly starting to close on its rotation on its hinges) back towards the bed, then at the door again. “Uh...bro? When did you and...uh...Shinsa-.”</p>\n<p>“It’s Shinsou, you glorified porcupine.”</p>\n<p>Kirishima’s mouth snapped shut and he looked thoroughly overwhelmed.</p>\n<p>“We aren’t friends.” Bakugou gritted out from between clenched teeth. “And why the <em> fuck </em> should I care about <em> gasoline?” </em></p>\n<p>Shinsou closed his eyes with a huff, looking completely at ease on Bakugou’s bed. “Because I used your name to order it all. Sorry Blasty, teach may be coming in to chew you out soon.”</p>\n<p>Kirishima looked confused and very worried for Shinsou’s well being.</p>\n<p>“Right.” Bakugou gritted out slowly. “Did you at least get the goddamn tripwires or did you fuck that up too?”</p>\n<p>Shinsou grinned and said nothing.</p>\n<p>Kirishima made a small noise that could have been a whimper. “Uh...guys? Are you….going to uh...set a building on fire?”</p>\n<p>“Arson’s not my style.” Shinsou instantly responded dryly, “I’m more of the bank robbery bitch. I love me some diamond rings.”</p>\n<p>Bakugou sighed and rubbed the bridge of his nose. “Shitty hair, get out. I gotta deal with the backstreet hooker.”</p>\n<p>“Honey you haven’t seen me in thigh highs yet.” Shinsou <em> instantly </em>responded, which left Kirishima spluttering out nonsense in lack of words. He blushed up to his ears, even as Bakugou practically shoved the red head out of his room.</p>\n<p>“Huh,” Shinsou huffed blandly the moment the door shut, “so his flaw is masculinity and girls. Here I was expecting more fun.”</p>\n<p>“Anyone in that goddamn moron squad is easy pickings.” Bakugou sourly grumbled, reaching over to smack Shinsou off his bed. The teen yelped before he slid off, roughly hitting the floor. He made a small noise of pain.</p>\n<p>“You got the gasoline and the cameras and wires all set up?”</p>\n<p>“Of course I did? I’m not a poorly thought out character, oh <em> wait </em>.”</p>\n<p>“I don’t get any of your goddamn references and at this point in time I’m ready to just throw you over my banister.”</p>\n<p>Shinsou raised one hand, pointing with one finger although he didn’t look that concerned. “You already used that threat, strike out. You only get one repeat and excuse me for your stunted communication and creative abilities.”</p>\n<p>Bakugou spluttered and Shinsou grinned wide like a very pleased cat. “Your mother should have exposed you to creative poetry. Or maybe expressive artwork. You seem like someone to like splatter paint.”</p>\n<p>Bakugou spluttered further before he flushed angrily. “Fuck you I am fucking <em> amazing </em>at art!”</p>\n<p>Shinsou perked up in surprise, “no way? I take it back sparky, you have exactly one redeeming quality.”</p>\n<p>The following day, nobody asked as to why Shinsou had a developing bruise on the underside of his jaw..</p>\n<p> </p>\n<p>They met after class, Bakugou and Shinsou not bothering to get up as students filtered out. Tokoyami was struck by the eerie familiarity of the entire scene.</p>\n<p>Aizawa saw them staying and groaned quietly. Students left, the door closed and suddenly they were isolated from the rumbling of the hallways.</p>\n<p>“Please tell me you’ve at least started.” Aizawa sighed, looking resigned to whatever disaster they had designed.</p>\n<p>Bakugou bristled and scoffed angrily. “As if I’d let <em> these </em>extras slow me down!”</p>\n<p>“Ignore him,” Shinsou added in sympathetically, “he’s still getting over the teamwork component to this.”</p>\n<p>Aizawa stared, eyes flickering back from Bakugou to Shinsou in something like dawning realization. “This was a poor choice, wasn’t it.”</p>\n<p>Shinsou grinned, a wide expression that was uncanny.</p>\n<p>“We have questions, Aizawa-Sensei.” Tokoyami broke the awkward tense atmosphere in the room. “About our assignment.”</p>\n<p>Bakugou gave him an expression of <em> ‘are you an idiot? Why else would we be here?’ </em></p>\n<p>Tokoyami sunk in on himself slightly, fumbling to pull out the papers they all had copies of. “...Particularly the scenario.”</p>\n<p>Aizawa arched one eyebrow, and Tokoyami reached his threshold for social interaction.</p>\n<p>“These scenarios,” Shinsou started, sounding just as exhausted as normal. “You said a different scenario for every group. That means that we need to do completely different situations for everyone? Or just that the location needs to change.”</p>\n<p>“Preferably <em> different, </em>but considering-.”</p>\n<p>“We can do different!” Bakugou hissed out furiously, eyes flashing at the challenge. “This is <em> easy </em>work!”</p>\n<p>Shinsou looked vaguely amused, although his expression slipped partially when his phone began vibrating violently. He scrambled for it with a small noise, yanking it out to stare at the screen blankly for a few seconds. Tokoyami was about to ask if he was alright but Shinsou had already thrown all of his papers into his bag chaotically.</p>\n<p>“Sorry Teach,” Shinsou mumbled under his breath, scrambling to his feet in uncharacteristic haste, “I’ve gotta bolt. Mom’s getting back earlier so I gotta get home.”</p>\n<p>Bakugou’s jaw dropped, “Oi! We’re <em> in the middle of something!” </em></p>\n<p>Shinsou blew him a kiss and slipped out the door, shutting it quickly behind him. Tokoyami felt uncomfortable in the silence that was summoned.</p>\n<p>“I was not aware Shinsou returned home on weekends.” Tokoyami mentioned quietly. It was unusual, since most students resided in the dorms instead. Shinsou hadn’t gone home on the standard breaks before either.</p>\n<p>Aizawa sighed and looked even more tired. “Just...your different scenarios. Run them by me.”</p>\n<p>Tokoyami’s feathers fluffed in surprise, “but, Shinsou-.”</p>\n<p>“He’ll catch up.” Bakugou hissed furious still. “<em> Fine. </em>We’re planning on screwing with those extras and winning!”</p>\n<p>Aizawa looked to the sky and searched for strength.</p>\n<p>“Let’s break it down into the groups.” Aizawa started, squinting at his papers. “I don’t remember them so you’ll have to tell me.”</p>\n<p>Bakugou clicked his tongue then flipped open a notebook- pristine kanji that Tokoyami still didn’t comprehend. “First group is the goddamn eyesore and half an’ half.”</p>\n<p>Aizawa looked at Tokoyami, who helpfully translated.</p>\n<p>“First,” Bakugou’s grin looked vicious, “we’re going to <em> waste </em>that two faced bastard. Then we’ll win.”</p>\n<p>“Please tell me you actually have a plan.”</p>\n<p>Tokoyami cleared his throat and clicked his beak hesitantly, “ah, yes sir. We’ve decided to have a bomb threat for Group 1.”</p>\n<p>Aizawa squinted at the two of them. “...a bomb, for Todoroki.”</p>\n<p>Bakugou jutted out his jaw, and Aizawa nodded slowly but clearly didn’t approve.</p>\n<p>“...Who is in Group two. Actual names this time.”</p>\n<p>“Tch! I don’t know those losers names!”</p>\n<p>“Uh, sir? Group two has Yaoyarozu, Uraraka, and Aoyama.”</p>\n<p>Aizawa nodded and looked more contemplative for this one. “And what are you anticipating for this one?”</p>\n<p>Bakugou grinned ever so slightly, “Drug bust.”</p>\n<p>Aizawa’s mouth quirked downwards ever so slightly. “...right.”</p>\n<p>“Group three has Sato, Shoji, and Kirishima. We have determined it should be a chemical production facility and packaging plant for illegal materials.”</p>\n<p>“No trade-off of that drug shit,” Bakugou clarified sharply, “busting the operation itself.”</p>\n<p>Aizawa was looking simultaneously impressed and unsure of how things were going down.</p>\n<p>“Group four.”</p>\n<p>“Ashido, Koda, and Midoriya, sir. An underground search and rescue with villain presence.”</p>\n<p>Aizawa shook his head abruptly, “you aren’t allowed to bring in additional members for your rescue victims.”</p>\n<p>Bakugou <em> grinned, </em>“they don’t know that, do they?”</p>\n<p>“This was Shinsou’s idea, wasn’t it.”</p>\n<p>This was horrible.</p>\n<p>“Group five is Kaminari, Jiro, and Asui. We have planned a full frontal villain attack or incident. Group six is Sero, Ojiro, and Iida. We have planned that they need to take a fleeing villain into custody.”</p>\n<p>Aizawa looked <em> very </em> curious with that one. “You’re aiming for a mobility trial against <em> Iida?” </em></p>\n<p>“Oi! This is our exam too! Or did you forget that already!”</p>\n<p>Aizawa hummed lowly. “...Alright, I’ll sign off for this request. I need you all to sign one of your plans and once you have all your signatures, I’ll sign and give you permission for interacting with other faculty and using all resources provided. This includes custom villain costumes, and getting support gear.”</p>\n<p>Bakugou jolted in surprise, gaping in awe for a moment.</p>\n<p>Tokoyami composed himself faster, “we’re being given a <em> new outfit?” </em></p>\n<p>“Damage control!” Bakugou nearly screached, slamming his hands on his desk, “We’re villains, <em> eh? </em>That means I don’t have to follow hero guidelines right!”</p>\n<p>Aizawa rolled his eyes, “look brats, just sign and then go figure it out yourself. It’s not my problem.”</p>\n<p>“Shinsou went home!” Tokoyami realized quickly, “he won’t be back until Monday, the entire weekend we won’t be able to use our new abilities.”</p>\n<p>“<em> Fuck that!” </em>Bakugou roared, “what’s his goddamn address!”</p>\n<p>Aizawa stiffened. “You want to go to Shinsou’s house.”</p>\n<p>“Eh? Are you going <em> deaf </em>now too!”</p>\n<p>Tokoyami felt uncomfortable for a reason he couldn’t describe.</p>\n<p>Aizawa stared at them for a second before he very slowly nodded. “...You are to change out of uniform. This is not official UA business so you should not be wearing your uniform anyways. I will give you his address, and I can personally confirm it is correct. You <em> will </em> be back before nightfall, and you <em> will </em>take your phones with the enabled trackers.”</p>\n<p>Bakugou’s face sourced at the trackers, but he agreed with a small noise. Aizawa pulled out a scrap piece of paper and scribbled down an address Tokoyami didn’t recognize. He plugged it into his phone and the moment it popped up on the map, he showed his teacher who confirmed it was accurate.</p>\n<p>Tokoyami didn’t want to have to leave campus with Bakugou of all people, but sometimes sacrifices had to be made.</p>\n<p>Tokoyami always drew stares, he knew that. Thankfully the emergence of animalistic quirks was more common, but even then people tended to look at his feathers. He didn’t mind, it wasn’t as if he had anything to hide.</p>\n<p>Bakugou on the other hand looked <em> odd </em> in normal clothing. A normal shirt, baggy pants, completely ordinary. Somehow though, everything fit him far too well and in a way that instantly <em> worked. </em> Tokoyami never thought <em> Bakugou </em>would be someone who took care in his clothing, Aoyama perhaps, but not the loud obnoxious teen.</p>\n<p>The train was bumpy and long. Bakugou glared his way into getting a seat from one man who looked half his weight heavier. Tokoyami stuck to the windows, gazing outside as slowly the afternoon continued on.</p>\n<p>More and more people got off, less people got on. They were nearing the edge of the city and the point where people generally didn’t go. If Bakugou was worried, he didn’t show it. He had headphones in, eyes closed and relaxed. A bag on his side had the form they needed Shinsou to sign, as well as other meticulous notes that Aizawa told them they should consider. The support gear was weighing on their minds heavily.</p>\n<p>The train trudged along, more trash and garbage accumulated along the side of the tracks.</p>\n<p>“...Next stop is ours.” Tokoyami mentioned quietly. Bakugou opened one eye but made no other mention that he heard him.</p>\n<p>The train slid into a station that looked shady at best. They climbed off and through the station- half of the turntables were broken down and only a half dozen lights were functional. It was overall, very unsettling.</p>\n<p>“Where the hell now, birdface?” Bakugou grumbled, jamming his hands deep in his pocket. Tokoyami checked his phone, they had maybe a ten minute walk now.</p>\n<p>They kept walking, sticking to the busted sidewalk and hopped across the broken glass bottles. Tokoyami thought he spotted a pile of needles behind one trash can, and the hollow eyes of a stray cat.</p>\n<p>Tokoyami was now very thankful that if he was here with anyone, it was Bakugou.</p>\n<p>“Tch,” Bakugou clicked his tongue, scowling at a can in the middle of the sidewalk. He kicked it, denting the surface and sending it sailing into a pile of stinking trash. Something scrambled around at the contact, although Tokoyami didn’t look close enough to see what animal it was.</p>\n<p>“This place reeks.” Bakugou’s nose wrinkled, he stomped especially hard on another can, leaving it behind.</p>\n<p>It did smell, but the phone said they were nearly there.</p>\n<p>Tokoyami turned up one apartment complex, each door build into a set of stairs that ascended to the second floor. They climbed it, careful not to fall through where one of the steps was missing, and went to the tarnished third door.</p>\n<p>“...this is it.” Tokoyami finished lamely.</p>\n<p>Bakugou rolled his eyes then slammed his hand against the door in rapid progression. The door echoed with rapid thudding noises that quickly set Tokoyami’s heart scrambling. Bakugou shifted his weight and huffed impatiently.</p>\n<p>There was a pause before there was scuffling on the other side. Tokoyami hastily shoved his phone in his pocket, trying to look casual as he could in his jacket. Bakugou looked much more at ease.</p>\n<p>A clicking noise and a few other sliding sounds that sounded like locks. A pause, like whoever it was on the other side had paused.</p>\n<p>“Oi!” Bakugou shouted suddenly, “Open up! We’ve got questions!”</p>\n<p>“Bakugou!” Tokoyami hissed, suddenly aware about how much his tone sounded like the police. He imagined the police weren’t that welcome a sight down here.</p>\n<p>Somehow though, it <em> did </em>work. The door opened a gap, someone peered out at them with narrowed eyes and a gaunt face. “...who’re you?”</p>\n<p>They managed to hiss it with an amount of venom and distrust Tokoyami felt taken aback.</p>\n<p>“Oi, open the door, hag.” Bakugou sneered back with a scowl, “get your kid too we need to talk to him.”</p>\n<p>The lady frowned and looked at them contemplating. Her fingers were twitching on the doorway rapidly, frantic almost.</p>\n<p>“We won’t hurt you.” Tokoyami piped up.</p>\n<p>Both Bakugou <em> and </em>the woman glared at him, as if he had somehow offended them both.</p>\n<p>“Of <em> course </em>you wont.” She hissed out angrily, prickling up all over. She slammed the door, shifting more chains before it could open unhindered. Bakugou shouldered his way inside, Tokoyami following in quietly.</p>\n<p>It was...dirty. Dingy, second hand and weirdly cluttered in some spots. Newspapers stacked to the height of their shoulders. An unnecessarily large amount of pillows stacked on one small couch to the point it overflowed onto the floor. The counter tops were stained but had huge scratches like at some point the owner tried to clean with sandpaper.</p>\n<p>“Hitoshi!” She shrieked, not as venomous as at the door, but a tone that was a bit too high for most people to manage. “People want to talk at you!”</p>\n<p>Tokoyami blinked quickly, that was a strange way to phrase it.</p>\n<p>A moment passed, Bakugou leant against a clean spot on the wall. He looked impatient, Tokoyami felt paranoid that he would step in the wrong place and come face to face with some sort of vermin.</p>\n<p>“<em> Histoshi!” </em>she shouted again, although didn’t seem to care for any response, “get up here!”</p>\n<p>A pause, then movement from further within the house.</p>\n<p>“Oi,” Bakugou shouted down the hall, “get out here you purple haired oppossum!”</p>\n<p>Shinsou, wearing a very large black sweatshirt, ducked his head out of their line of sight. He came closer, dragging his feet. Very quietly.</p>\n<p>That was odd, normally Shinsou would have insulted or tried to rile one of them up.</p>\n<p>“What is it?” The woman barked at Tokoyami and Bakugou sourly. “Why are you here? He just got here. Why are you here?”</p>\n<p>She reminded Tokoyami of a parrot, rapidly speaking without really understanding her words.</p>\n<p>Bakugou frowned and stared at Shinsou. “Oi. Look at me. We’ve got a form for you to sign so we can get our shit.”</p>\n<p>Shinsou kept his head low, his purple hair an absolute <em> mess. </em></p>\n<p>“What is it? What form?” the woman- who must have been Shinsou’s mother, looked around quickly. “Are you in trouble again? Expelled again? What did you <em> do? </em>Trouble?”</p>\n<p>Shinsou shrugged, his shoulders rolling from under his sweatshirt. Then, he looked up.</p>\n<p>“What the <em> fuck!” </em> Bakugou hissed, stumbling back even though he already was leaning against the wall. Tokoyami <em> jumped, </em>his feathers ruffling.</p>\n<p>Shinsou looked between the two of them, eyes flat but very serious. His eye bags looked worse, his skin looked even more pale with the black contrast of the goddamn <em> muzzle. </em></p>\n<p>“Are you getting kicked out?” His mother hissed, frantically folding her fingers, “<em> again?   </em>Hitoshi! Sign the form! What did you do!”</p>\n<p>She didn’t seem to expect a response, which was chilling with what it meant.</p>\n<p>“It’s a school thing.” Bakugou blurted bluntly. “Our homeroom teacher needs him to come back. You know, stupid paperwork stuff.”</p>\n<p>“Oh,” the mother cocked her head back and forth, “he was supposed to, to come here.”</p>\n<p>“He did.” Bakugou bluntly beckoned to the house they were standing in. “Now he needs to do school shit.”</p>\n<p>“Oh,” The woman blinked quickly, still cocking her head. “Okay okay. Go.”</p>\n<p>Shinsou turned around and walked away- <em> quiet far too quiet- </em>then returned with a backpack he had left with. He ignored them and brushed past, out the door (which had five locks on further examination, and one of them didn’t even have a slot to activate it) to the outside world. Tokoyami followed, feeling chilled and horrified although Bakugou looked more pissed than anything.</p>\n<p>They left, walking down the pavement around the corner of the building towards the train station. They hadn’t said a single word until they walked into the run down train station Shinsou obviously used to take to school every day.</p>\n<p>Under one of the more functional lights Shinsou paused, setting his bag on the ground to unzip it and pull out a bottle of water. Tokoyami wondered how good the water was in this area, or if he simply drank at UA more than the normal person.</p>\n<p>“Alright, we’re here.” Bakugou spoke bluntly. Eyes shadowed and dark. “What the actual <em> fuck is this.” </em></p>\n<p>Shinsou glared at them slightly; he looked tired. He reached up, pulling on small little bolts that twisted in his grasp. Practiced movements loosened small bits, the metal supports pulled free and left small red indentations.</p>\n<p>“God.” Tokoyami breathed in horror as Shinsou casually unhooked what looked more like a <em> bridle </em>under closer examination from his mouth, pulling out the long metal gag that had been immobilizing his tongue. An excess of drool followed. Shinsou spat, hacking out large globules before he grabbed his water and swished it twice. It was a practiced routine.</p>\n<p>“Talk!” Bakugou snarled, although he looked unsettled by it.</p>\n<p>“Give me a second, you fuck.” Shinsou coughed, his voice hoarse. He rubbed the edges of his jaw with a frown, “why the <em> fuck </em>are you here?”</p>\n<p>“Aizawa-Sensei gave us a form we needed you to sign.” Tokoyami spoke although his voice was shaking, eyes locked on the metal and leather bridle on the floor of the grimy train station. “...Shinsou…”</p>\n<p>“<em> Don’t.” </em>Shinsou barked out sourly, “just...just fuck off, okay?”</p>\n<p>“No, don’t tell <em> us </em> to fuck off!” Bakugou hissed furiously, “you were fucking <em> muzzled.” </em></p>\n<p>Shinsou scoffed, “what, touch a sore spot?”</p>\n<p>Bakugou saw red. He snarled wordlessly; Dark Shadow lunged and managed to separate the two before anything escalated.</p>\n<p>“Enough!” Tokoyami shouted, trying to keep the two from lunging at each other again. “We’re heading back to UA and we are talking to Sensei about this!”</p>\n<p>“There’s nothing to talk about!” Shinsou snarled bitterly, “look, mental quirks do this, okay? We’re all fucked up, there’s a <em> reason </em>that people hate my guts!”</p>\n<p>Bakugou settled with a savage noise, “oh wow boo-hoo!”</p>\n<p>Shinsou looked ready to deck him in the face. “You’ve got <em> no idea </em> what it’s like you <em> prick. </em> You have no clue how much it fucking <em> sucks </em>to have my quirk!”</p>\n<p>“All I hear is you complaining you washed up magic show!”</p>\n<p>Shinsou flushed ugly, “You have <em> no right, </em> so <em> fuck off.” </em></p>\n<p>Shinsou grabbed the muzzle, shoved it in his bag and stormed off towards the train. He didn’t bother with a ticket, and instead sat on the edge of the tracks waiting for the next train coming through.</p>\n<p>Nobody said anything until they were walking back to UA.</p>\n<p> </p>\n<p>They stormed into the dorm rooms dramatically, scaring Mina and Momo who shrieked in cue in surprise. Aizawa looked up from where he had stolen the entire coffee table and one of the couches for his grading- he was prone to doing so due to the common questions students had over their homework.</p>\n<p>“Oi!” Bakugou <em> roared, </em>spinning and grabbing Shinsou’s bag the moment the purple haired teen was through the door.</p>\n<p>“No!” Shinsou <em> screamed, </em> the loudest anyone had ever heard him before, “you fucker! Give it <em> back!” </em></p>\n<p>Bakugou ignored him, and Tokoyami summoned Dark Shadow to restrain the brainwasher with his large claws.</p>\n<p>“No!” Shinsou screeched, thrashing in the grip. Bakugou ignored him, jerking the bag further away. “No! <em> Give it back you piece of talentless shit!’ </em></p>\n<p>Bakugou’s mouth moved and he <em> almost </em>responded. He glowered, then turned and stomped across towards Aizawa. Mina and Momo were watching in horrified confusion over the entire scene.</p>\n<p>“Oi.” Bakugou grumbled coldly, “you know about that shit?”</p>\n<p>Aizawa shuffled the papers and cleared a spot. “You’ll have to be more specific.”</p>\n<p>\n<em> “You over glorified firecracker! You disgusting washed up wannabee!” </em>\n</p>\n<p>Bakugou’s jaw ground together so hard Aizawa could hear his molars sliding. Bakugou jerked one thumb over his shoulder in the direction of the thrashing purple blur.</p>\n<p>Aizawa ached one eyebrow. “The only reason you don’t have detention right now, is because Tokoyami does not act without purpose. <em> Why, </em>are you holding my student ransom.”</p>\n<p>Bakugou’s face twitched. He slammed Shinsou’s backpack on the table unzipped it jerkily and yanked out a wad of metal and leather.</p>\n<p>It rattled a little on the coffee table, then stayed still.</p>\n<p>Momo inhaled sharply at the sight of it, leaning away with a disturbed expression.</p>\n<p>Aizawa though, that was something different.</p>\n<p>Aizawa reached down very slowly, and picked up the equipment. Once lifted and adjusted, it was very cleverly shaped in a human bridle. Antiquated really, they hadn’t been using bridles, muzzles, restraining devices and gear for quirks in decades.</p>\n<p>“This is an immobilization bridle.” Aizawa’s tone was smooth and cold. “This style is made for constant wear. It has barbs to secure into the mouth, but is free enough to allow the wearer to eat and drink without managing verbal words.”</p>\n<p>Shinsou was <em> thrashing </em>with horrible gasping noises, slumped against the ground under Dark Shadow’s strength.</p>\n<p>Aizawa rotated the bridle slightly, eyes locked on the metal and leather. “This is worn frequently. Interesting; these sorts of devices have been illegal since before I was born. Cruel treatment and sometimes constituted as torturous for some quirks.”</p>\n<p>Bakugo grunted lowly to draw attention. “He was wearing it. His mother is fucking <em> insane.” </em></p>\n<p>Mina was watching in horror. Momo looked green at the sight.</p>\n<p>Aizawa nodded very calmly. “Of course. Bakugou, if you would assist Tokoyami in moving Shinsou to his room, I have to inform Principal Nedzu over the circumstances. I’ll contact Recovery Girl as well.”</p>\n<p>Aizawa glanced to his side at Mina and Momo, who hurriedly promised they wouldn’t say anything.</p>\n<p>It didn’t matter much when Shinsou was still screaming bloody murder, looking heartbroken and furious in a way that was devastating to watch.</p>\n<p>“How could you!” Shinsou <em> screamed, </em>lashing out uncoordinated at Bakugou who easily dodged his punch, twisting his arm behind his back to pin him.</p>\n<p>“You ruined everything!” Shinsou screeched, voice cracking into something that sounded suspiciously like a sob, “<em> I was doing fine on my own!” </em></p>\n<p>Bakugou’s face twitched in the effort it took not to respond.</p>\n<p>He slowly dragged the shrieking student up the stairwell, ignoring the elevator. He climbed, biting his tongue so hard it nearly bled. Momo and Mina hurried up the steps ahead of them, shushing curious students and going so far as to shove Kaminari out of the way. Midoriya looked particularly stricken as Bakugou had to <em> haul </em>Shinsou across his back in a messy fireman carry that looked more like a fight than anything.</p>\n<p>“Get the fucking door!” Bakugou shouted, nearly tripping as Shinsou’s thrashing picked up. Tokoyami slid Dark Shadow under the door frame, manually unlocking the bolt to open the frame. Bakugou stomped in, and kicked the door shut behind him.</p>\n<p>Everyone's hearts were racing, breathing coming fast.</p>\n<p>“...dude.” Kirishima breathed, peeking at the scene timidly from the stairwell, “was that like, bloody murder or something?”</p>\n<p>“I’ve never heard Shinsou like that before.” Midoriya whispered, he was trembling. “Is...Is he <em> okay?” </em></p>\n<p>Tokoyami couldn’t say anything; even if he wanted to, he doubted he could speak through the guilt.</p>\n<p> </p>\n<p>Sunday afternoon, after an entire day of hiding in his room, Shinsou emerged.</p>\n<p>He had a scowl on his face that was asking for trouble. Students had seen Recovery Girl slip into his room quietly on Friday night, followed quickly by Aizawa, Principal Nedzu, and Midnight. The sight of everyone in a single tiny dorm was suspicious, but the fact Shinsou hadn’t screamed either made it worse.</p>\n<p>He emerged on Sunday, a beautiful social moth who was ready to kill small children and drink blood. He stomped into the kitchen, walked over to get a glass of water. Once he had it, he stomped into the living room over to where Bakugou was attempting to teach Kirishima and Kaminari calculus, and poured it all over Bakugou’s head.</p>\n<p>“That’s for your fucking hot head.” Shinsou deadpanned, crossing his arms as Bakugou very slowly wiped the water from his face.</p>\n<p>“What, the <em> fuck </em> is your problem.” Bakugou clipped out from clenched teeth. “Because you’re <em> making </em>a problem right now.”</p>\n<p>“Oh wow, I’m <em> so scared.” </em> Shinsou seethed, “congrats <em> asshole. </em> You made me a <em> fucking orphan.” </em></p>\n<p>“What.” Kirishima deadpanned, summarizing up everything quite nicely.</p>\n<p>“I- <em> what.” </em>Bakugou gaped in confusion, “but- your dad-.”</p>\n<p>“Is in fucking <em> prison you used enema. </em> Who do you think I got my quirk from? Fun fact! If you screw with someone's head too much <em> you give them schizophrenia. </em> So fucking <em> thanks.” </em></p>\n<p>Shinsou spun on his heel and stomped off, going so far as to smash the glass in the sink. It exploded in dozens of small pieces with a small noise.</p>\n<p>Kaminari looked at Bakugou in disgust. “<em> Dude.” </em></p>\n<p>“Look, it was for the better, okay?” Bakugou spat out defensively, “I’m not <em> that </em>much of a dick!”</p>\n<p>“Dude,” Kirishima added in uncomfortably, “we just saw you drag him into his room screaming. It looked <em> really </em>bad on you, man.”</p>\n<p>Bakugou huffed, “It’s not like I was asking for your opinion you extras. Oi! Finish the fucking homework!”</p>\n<p>\n<span>Class was tense and by that, Shinsou and Bakugou had a level of distance between the two. It was almost tangible with how Bakugou seemed a little more aggressive, and Shinsou seemed a little more cold.</span>\n</p>\n<p>\n<span>The few that had seen the incident started to spread rumors. That somehow something happened with Shinsou that involved a muzzle. Although quirk restraining devices were used when the occasion demanded (Bakugou during the medal ceremony his first year at the sports festival), those were made to be comfortable and not threatening at all. The muzzle that rumors described was something sharp and painful. Something illegal and outdated.</span>\n</p>\n<p>\n<span>Shinsou didn’t have many marks on his face other than a small scrape easily equatable to being punched. There was nothing to outright say that the rumors were true, but there was a veiled level of rage the purple haired teen failed to completely hide. A level of frustration that made his quirk use sloppy, but his moves twice as violent.</span>\n</p>\n<p>\n<span>Fighting against Momo was something unsettling to watch. Momo was a good fighter, but something about Shinsou’s reckless dirty fighting seemed to shake a few bolts loose. More often than not, it was Momo being thrown to the ground, it was Momo receiving a knee to the back, it was Momo reeling after a particularly hard punch.</span>\n</p>\n<p>\n<span>Momo managed a good kick; the majority of her strength training was located in her quads, and sent Shinsou </span>\n<em>\n<span>skidding </span>\n</em>\n<span>across the ground. She was looking much worse, but her last hit managed to make everyone watching wince.</span>\n</p>\n<p>\n<span>“Alright, that’s enough.” Aizawa broke them up, eyes on the slowly recovering boy on the ground. “Take a break everyone. Walk it off, you too Midoriya.”</span>\n</p>\n<p>\n<span>Shinsou slowly made his way to his knees, and from there he slowly made his way into a kneeling position. Aizawa went so far as to lower himself into a squat, looking at Shinsou with an obviously disappointed frown.</span>\n</p>\n<p>\n<span>“Stop it.” Shinsou growled out, tilting his face to the side to spit out a glob of spit. “I could go longer.”</span>\n</p>\n<p>\n<span>“Did toy break a rip?” Aizawa asked bluntly, “if you did, you’re out for a week </span>\n<em>\n<span>after </span>\n</em>\n<span>its healed. As punishment. Maybe you’ll learn not to throw yourself into fighting so idiotically.”</span>\n</p>\n<p>\n<span>Shinsou bared his teeth and stared at the dirty. Aizawa stood and sauntered back, overseeing the small group of bubbly teenagers chugging beverages.</span>\n</p>\n<p>\n<span>Tokoyami walked up, disliking the prone state of someone he’d tentatively call a friend. “Are you alright, Shinsou?”</span>\n</p>\n<p>\n<span>Shinsou sighed, breath shuddering so hard his shoulders shook. He waited a bit longer before slowly moving to stand.</span>\n</p>\n<p>\n<span>“I’m peachy.” he croaked out, shaking it off with a grimace. Tokoyami’s beak clicked slightly as he adjusted his jaw.</span>\n</p>\n<p>\n<span>“You looked wounded.” Tokoyami noted, feeling Dark Shadow slip out to support Shinsou’s side. “I can aid you to Recovery Girl.”</span>\n</p>\n<p>\n<span>“I’ve taken worse.” Shinsou wheezed out, taking a moment to catch his breath before he stumbled to his feet, using Dark Shadow for help. “It’s just a bruise. Hurts, but I’m fine.”</span>\n</p>\n<p>\n<span>Tokoyami’s feathers ruffled slightly. “I was not aware combat training was common in General Education.”’</span>\n</p>\n<p>\n<span>Shinsou rolled his shoulders and stretched. “It isn’t. Lots of...thugs, where I grew up.”</span>\n</p>\n<p>\n<span>Tokoyami resisted a shiver. He had seen the area, he could believe it.</span>\n</p>\n<p>\n<span>“Don’t worry, I didn’t get jumped much. Gained a reputation.” </span>\n</p>\n<p>\n<span>Tokoyami shifted slightly, “I suspect nothing pleasant.”</span>\n</p>\n<p>\n<span>Shinsou chuckled softly, “yeah. Something like that. You know how to nearly break someones arm and everyone gives you space.”</span>\n</p>\n<p>\n<span>Shinsou glanced over at the group of people mingling on the sides, “they don’t teach you to fight like that. Here its all structured, it’ a bit of a learning curve.”</span>\n</p>\n<p>\n<span>Tokoyami was suddenly struck by a wonderful idea.</span>\n</p>\n<p>\n<span>“Show me.” Tokoyami blurted before he could stop himself. “We’re supposed to be fighting like villains. Show me things they don’t teach us here.”</span>\n</p>\n<p>\n<span>Shinsou paused and his lip shifted into a slight frown. “...You want to fight scrappy. You aren’t going to get any points.”</span>\n</p>\n<p>\n<span>Tokoyami’s feathers fluffed slightly. “It would be wise to fully embrace our roles. This includes fighting in a style similar to villains.”</span>\n</p>\n<p>\n<span>Shinsou frowned but slowly shifted into a stance; it looked unbalanced and more ready to bolt than most of the postures they had learned. Despite that, Tokoyami could recognize some value to the way he had one hand close to his inside and the other outstretched.</span>\n</p>\n<p>\n<span>“I’m going to grab you in a grapple.” Shinsou warned carefully, “ then kick out your knees, and twist your wrist so it nearly breaks.”</span>\n</p>\n<p>\n<span>Tokoyami shivered and Dark Shadow croaked in surprise at the blunt explanation.</span>\n</p>\n<p>\n<span>“Ready?” Shinsou asked, eyes flat. </span>\n</p>\n<p>\n<span>Tokoyami nodded. Despite knowing what the other was going to do, it was surprising how quick he moved. There was no grace in it, only aggressive jerky movement. The grip on his arm was too tight, the kick to the back of his knees was sharp and pointed, the impact rattling all the way down. The knee to his back felt paralyzing, then he was on the ground and hurting. Learning under Aizawa was nothing like this, there was none of the careful fluidity of choreographed moves. Everything hurt and throbbed, Shinsou’s intent to actually hurt and leave someone debilitated due to pain.</span>\n</p>\n<p>\n<span>“This is a standard take-down.” Shinsou gritted, yanking Tokoyami’s arm further until the bone was groaning under the force of it, “right here, I can jump on my knees and bruise your kidneys. Break them if I’m lucky. If I wanted to seriously hurt you, I’d jump off and stomp with my heel on your side, or get a running start and smash into your spleen. You rupture that, you’re done.”</span>\n</p>\n<p>\n<span>Tokoyami’s eyes were watering, then Shinsou got up.</span>\n</p>\n<p>\n<span>His face was blank but he couldn’t disguise the worry. Tokoyami didn’t like the dirty fighting, the way it left him feeling strangely violated. It was unlike everything he had expected; not superior in skill or strength, but </span>\n<em>\n<span>surprising.</span>\n</em>\n</p>\n<p>\n<span>“Show me.” He croaked out, shaking his arm to try and get the nerves to stop buzzing.</span>\n</p>\n<p>\n<span>Shinsou still had that glazed reluctant expression. “Are you sure?”</span>\n</p>\n<p>\n<span>Tokoyami shook out his arm one more time. “If you want us to actually succeed with that plan of yours, we need to be better. From what I have observed, you have trained extensively with Aizawa-Sensei. Would he expect this sort of attack?”</span>\n</p>\n<p>\n<span>Shinsou barely had to think about his answer. “From me, absolutely.”</span>\n</p>\n<p>\n<span>Tokoyami used one hand to gesture to himself, “but not from me.”</span>\n</p>\n<p>\n<span>Shinsou still looked uncertain, even with Dark Shadow giving a helpful thumbs up.</span>\n</p>\n<p>\n<span>“I want to benefit from this just as much as you.” Tokoyami explained shortly, “and for this to work, we need to act in ways unlike how we normally do. We need to create completely new styles of combat.”</span>\n</p>\n<p>\n<span>“You want to fight like a shady drug dealing bodyguard.” Shinsou deadpanned with a grimace, “god, this is going to be ugly to watch. Okay, fine. First, you need to realize that skin can </span>\n<em>\n<span>tear. </span>\n</em>\n<span>Use that, if you can't break free, rip their skin-...”</span>\n</p>\n<p>\n<span> </span>\n</p>\n<p>\n<span>Tokoyami thought about it, he thought about it long and hard.</span>\n</p>\n<p>\n<span>They were going to be fighting in a way completely opposite of what they normally did. They needed to make villain outfits that emphasized their qualities, why would they go for something accessory wise compared to something functional.</span>\n</p>\n<p>\n<span>Tokoyami sighed and glanced over at his notebook.</span>\n</p>\n<p>\n<span>As much as he didn’t want to admit it, the stress of this assignment was starting to weigh on him. Impacting his sleep and his waking moments. More often than not, Dark Shadow had to comfort him when the stress of their situation rose too high. It was a challenge that Tokoyami found himself doubting often.</span>\n</p>\n<p>\n<span>He couldn’t quit, not when his allies depended on him. He worked with both Shinsou and Bakugou, somehow smoothing their rough edges into something calmer and less....aggressive.</span>\n</p>\n<p>\n<span>Without Bakugou, the aggressive force they needed to drive this forward wouldn’t be there. Without Tokoyami, they wouldn’t have a distance fighter to keep people away. Without Shinsou, they wouldn’t have an operator to move them in a seamless pattern. Without any of the others, everything would quickly fall apart. </span>\n</p>\n<p>\n<span>But everyone </span>\n<em>\n<span>knew </span>\n</em>\n<span>this, they knew their strengths and weaknesses. Everyone knew you had to respond to Shinsou to get people to react. Everyone knew that Shark Shadow was weak against light. Everyone knew that Bakugou had a temper and a quirk to match. They wouldn’t be able to surprise anyone if they acted the same way. Even with fighting different, they would still-.</span>\n</p>\n<p>\n<span>Dark Shadow  croaked and Tokoyami leapt to his feet, running down the hallway.</span>\n</p>\n<p>\n<span>His idea would have gone better with Shinsou, but during daylight hours finding him was harder than ever before. Bakugou had a very regular study schedule, which made him both easier to find, and worse to talk to.</span>\n</p>\n<p>\n<span>His door was closed, small burn marks near the handle. Tokoyami inhaled, and felt Dark Shadow comfort him with a heavy weight over his feathers. With a steady hand, he knocked twice.</span>\n</p>\n<p>\n<span>He could hear movement before the door opened, a blinking curious face of Sero.</span>\n</p>\n<p>\n<span>“Oh hey man!” Sero beamed, wide smile spreading across his face. “What’s up!”</span>\n</p>\n<p>\n<span>Behind him, explosions and screeches went off.</span>\n</p>\n<p>\n<span>“I have an inquiry for Bakugou.” Tokoyami spoke flatly, trying to make his voice as uninteresting as possible.</span>\n</p>\n<p>\n<span>Of course, he failed.</span>\n</p>\n<p>\n<span>“Oooo,” Mina giggled, her black eyes gleaming, “</span>\n<em>\n<span>another </span>\n</em>\n<span>suspicious visit? Blasty you aren’t cheating on us are you?”</span>\n</p>\n<p>\n<span>Bakugou loudly protested. The smell of ash and sickly sweet nitroglycerin filled the air.</span>\n</p>\n<p>\n<span>The room vacated only after more teasing prompts, pencils and highlighters chucked at the back of Kaminari’s head. In minutes, the room was quiet and the door was secured closed. Tokoyami didn’t like staying in Bakugou’s room.</span>\n</p>\n<p>\n<span>“Fine, what do you want.” Bakugou demanded bluntly, voice abrasive and rough but intelligent enough to recognize the situation.</span>\n</p>\n<p>\n<span>Tokoyami tried to not appear as hesitant as he felt. “I believe we have been approaching the situation wrong. For our final combat scenario.”</span>\n</p>\n<p>\n<span>Bakugou sat upright, instantly focused and on alert. His eyes narrowed into something like a challenge, something predatory as his eyes flickered across Tokoyami’s beak and crest. “Yeah? You think my strategy isn’t good enough, </span>\n<em>\n<span>pigeon?”</span>\n</em>\n</p>\n<p>\n<span>Dark Shadow shifted slightly, and Tokoyami’s beak clicked. “I believe, that we could have better results if we not only alter our style of attack, but our demeanor as well.”</span>\n</p>\n<p>\n<span>Bakugou’s jaw shifted, something popped. Then he tilted back on his chair so far the gears squeaked. “Our </span>\n<em>\n<span>demeanor?”</span>\n</em>\n</p>\n<p>\n<span>“Personality swap.” Tokoyami explained in a rush of air. “The traits that villains all have which causes them to be most imposing-.”</span>\n</p>\n<p>\n<span>“Relatable insanity.” Bakugou clipped out shortly, his expression locked into something difficult to read. “I </span>\n<em>\n<span>know, </span>\n</em>\n<span>you cockatoo. I’ve </span>\n<em>\n<span>met </span>\n</em>\n<span>villains, remember?”</span>\n</p>\n<p>\n<span>Tokoyami did remember, he remembered well in fact.</span>\n</p>\n<p>\n<span>“I believe if we alter our personality to specific styles very unlike ours, it may provide us an advantage.”</span>\n</p>\n<p>\n<span>Bakugou frowned from one side of his mouth, eyes flickering across Tokoyami’s face. “...you’re serious.”</span>\n</p>\n<p>\n<span>Of course he was. Did his friends often ridicule ideas that had merit.</span>\n</p>\n<p>\n<span>“...fine.” Bakugou clipped out, reaching from a phone that had been placed across the room. “I’m calling that shitty chia pet. He’ll get here soon.”</span>\n</p>\n<p>\n<span>Tokoyami startled, “Shinsou? You have his phone number?”</span>\n</p>\n<p>\n<span>Bakugou snorted under his breath. “Bastard didn’t </span>\n<em>\n<span>have </span>\n</em>\n<span>one. UA supplied one or some shit. I got his number from the teach. Although that dick is bigger than Present Mic’s hair, he knows this is important. He’ll get here.”</span>\n</p>\n<p>\n<span>The faith Bakugou had in his teammate was admirable. </span>\n</p>\n<p>\n<span>True enough, in twenty minutes the door opened and slammed shut. Shinsou stomped forward, glaring at nothing particular. He threw himself so forcefully onto Bakugou’s bed, one of his pillows slid to the floor.</span>\n</p>\n<p>\n<span>“Oi!”’ Bakugou roared with a vein pulsing, “watch it!”</span>\n</p>\n<p>\n<span>Shinsou lifted one hand and flipped him off.</span>\n</p>\n<p>\n<span>Bakugou wasn’t looking amused, so Tokoyami intervened.</span>\n</p>\n<p>\n<span>“Shinsou, running off what you aided me with yesterday.” Tokoyami cleared his throat and began, “I believe it would be beneficial if we altered our demeanor for our final scenario as well as attack patterns.”</span>\n</p>\n<p>\n<span>Shinsou peeked one eye up from the bed, glazed and exhausted. “Oh no, we’re roleplaying?”</span>\n</p>\n<p>\n<span>Bakugou snorted, although he very quickly hid it.</span>\n</p>\n<p>\n<span>“I believe if we alter our personas while in a combat situation, we can better press our advantage.”</span>\n</p>\n<p>\n<span>Shinsou sat up slowly and stretched. His joints rattled like he was made from toothpicks. “Great. Wonderful. Sparky I’m going to sleep in your bed-.”</span>\n</p>\n<p>\n<span>“Don’t you </span>\n<em>\n<span>fucking dare-.”</span>\n</em>\n</p>\n<p>\n<span>“- unless one of you actually tells me what we’re doing already.”</span>\n</p>\n<p>\n<span>Tokoyami felt Dark Shadow rustle on his shoulders. This would be the difficult part. “I do not have as much...experience, with both villains and scenarios to provide insight. It would be beneficial to discuss the more...unnerving traits of villains to try and mimic these.”</span>\n</p>\n<p>\n<span>Shinsou stared with wide eyes. “Damn, you bloody down mess around when you want to. Good god, okay err…”</span>\n</p>\n<p>\n<span>Bakugou grimaced and looked equally unsettled. </span>\n</p>\n<p>\n<span>Shinsou’s face cracked first and he stared pointedly in the corner.”...this is just for the grade, right. You don’t have any microphones or some shit in here for like, social services.”</span>\n</p>\n<p>\n<span>“The </span>\n<em>\n<span>fuck?” </span>\n</em>\n<span>Bakugou gaped, “no! For fucks sake, we just want to take those asshats </span>\n<em>\n<span>down!”</span>\n</em>\n</p>\n<p>\n<span>Shinsou ran a hand through his hair. It was looking more wild than normal. “Yeah yeah I know it just...okay fine. There was this one...person. I knew. Creepy as </span>\n<em>\n<span>fuck, </span>\n</em>\n<span>he would err...crawl. On the walls and shit.”</span>\n</p>\n<p>\n<span>Shinsou shivered and glanced at the few posters on Bakugou’s walls. “He wouldn’t make a noise at all. He was dead fucking silent and it was a thing of nightmares to have </span>\n<em>\n<span>that </span>\n</em>\n<span>in an ally with you.”</span>\n</p>\n<p>\n<span>Tokoyami felt himself shiver at the thought. Bakugou huffed quietly under his breath and closed his eyes, crossing his arms in a show off way.</span>\n</p>\n<p>\n<span>“Look, I </span>\n<em>\n<span>know </span>\n</em>\n<span>weird freaky villains.” He spat out sourly. “That handsy piece of shit, that burnt marshmallow, that slobbery chainsaw crossed with a golden retriever. So tell us what you’re </span>\n<em>\n<span>thinking, </span>\n</em>\n<span>you chicken nugget.”</span>\n</p>\n<p>\n<span>Shinsou snorted and didn’t look away from the wall. Tokoyami felt cold.</span>\n</p>\n<p>\n<span>“I suggest…” he started before trailing off weakly. “...We alternate our personalities into something we’re not. Something unexpected, or...enough to gain hesitation.”</span>\n</p>\n<p>\n<span>“You could do a creepy wall climber easy.” Shinsou muttered dismissively. “Actually, wait. Your beak, I’m assuming you can mimic sounds well because of your vocal chords. Can you click it? Loudly?”</span>\n</p>\n<p>\n<span>Tokoyami shifted his tongue before tapping the edges of his beak together.</span>\n</p>\n<p>\n<span>“No you idiot,” Bakugou rolled his eyes, “</span>\n<em>\n<span>click, </span>\n</em>\n<span>with your tongue.”</span>\n</p>\n<p>\n<span>Ah, that. Tokoyami used his tongue and with as much suction as he could, clicked. The sound was loud and precise, much clearer and sharp than others. </span>\n</p>\n<p>\n<span>“Sweet.” Shinsou muttered with his eyes gleaming. “Can you chatter. The most insane unsettling chatter you can do.”</span>\n</p>\n<p>\n<span>Tokoyami hesitantly started to click, alternating it with low whistles. It was a good thing he mimicked bird songs when he was younger, it was easy to bring that sort of muscle memory back to the forefront of his mind.</span>\n</p>\n<p>\n<span>Shinsou’s eyes looked bright in delight. “Oh that’s great nightmare fuel right there.”</span>\n</p>\n<p>\n<span>Bakugou huffed and reclined. “Great, so what about you, you furby.”</span>\n</p>\n<p>\n<span>Shinsou flinched in horror, “good </span>\n<em>\n<span>god.”</span>\n</em>\n</p>\n<p>\n<span>Tokoyami took over to fix the situation once again. “I think since we’re all used to you being...yourself. We should look into the opposite, either talking more, or minimal.”</span>\n</p>\n<p>\n<span>Shinsou </span>\n<em>\n<span>pouted </span>\n</em>\n<span>and played with his fingers, “I’ve got a knack for pissing off people. If you’re going to make me mute, that ruins my quirk.”</span>\n</p>\n<p>\n<span>Bakugou rolled his eyes and huffed, “then </span>\n<em>\n<span>don’t. </span>\n</em>\n<span>Talk about random shit, you moron. Chatter like a lunatic.”</span>\n</p>\n<p>\n<span>Shinsou spluttered wildly, falling off the bed with a loud thump. Bakugou, out of mercy, didn’t kick him.</span>\n</p>\n<p>\n<span>“Act like that weird mosquito bitch.” Bakugou sniffed with a small glimmer in his eye, “you could probably do it well.”</span>\n</p>\n<p>\n<span>“I don’t want to!” Shinsou wailed from the floor, “she looked </span>\n<em>\n<span>insane </span>\n</em>\n<span>on the internet.”</span>\n</p>\n<p>\n<span>Tokoyami was struck by the fact that right then and there, Shinsou had never actually met any of the league of villains. He had his own scuffles, but never from the </span>\n<em>\n<span>league.</span>\n</em>\n</p>\n<p>\n<span>“That’s the point.” Bakugou growled back, “</span>\n<em>\n<span>deal with it. </span>\n</em>\n<span>Don’t go crazy talking about boys and shit just talk about something else!”</span>\n</p>\n<p>\n<span>Tokoyami thought the conversation was done. Then, Shinsou from the floor very quietly piped up, “what if I do like talking about boys?”</span>\n</p>\n<p>\n<span>Oh, </span>\n<em>\n<span>oh.</span>\n</em>\n</p>\n<p>\n<span>“Uh.” Tokoyami floundered. Shinsou didn’t move from the floor. </span>\n<em>\n<span>Oh.</span>\n</em>\n</p>\n<p>\n<span>Bakugou snorted, a small noise as he rolled his eyes. “Then talk about boys. I don’t give a shit about what gets you going. Talk like a lunatic and ramble on about cats for all I care.”</span>\n</p>\n<p>\n<span>Shinsou slowly lifted himself to his elbows. “...I do like cats.”</span>\n</p>\n<p>\n<span>“I don’t care!” Bakugou snarled, pointing one hand at himself, “what about me you shit stains!”</span>\n</p>\n<p>\n<span>Tokoyami locked eyes with Shinsou, then looked back. “You need to be quiet.”</span>\n</p>\n<p>\n<span>Bakugou looked ready to explode, </span>\n<em>\n<span>“Eh?”</span>\n</em>\n</p>\n<p>\n<span>“You’re very loud, like your quirk.” Tokoyami explained quickly. “It is...very unsettling, when you are calm. If you were completely mute and expressionless, it may be the most effective out of all of us.”</span>\n</p>\n<p>\n<span>“I can do that.” Shinsou added in with a small twist to his mouth, “I mean, if you let me. I’ve been playing with subtle control, very minor things. I may be able to lock your face for you but not change your movements.”</span>\n</p>\n<p>\n<span>Bakugou looked like it was paining him. “...</span>\n<em>\n<span>Fine. </span>\n</em>\n<span>Let’s talk gear.”</span>\n</p>\n<p>\n<span>“For our super secret pow-wow or for our general scenarios?” Shinsou asked, rolling onto his back like a lethargic sprawled mess. He started fiddling with the bedskirt on Bakugou’s bed, making it messy and askew.</span>\n</p>\n<p>\n<span>“Stop that!” Bakugou snapped, kicking out with one shoe. Shinsou wriggled away, now occupying himself with a pencil that had rolled under the bed.</span>\n</p>\n<p>\n<span>“General costumes would be nice.” Tokoyami awkwardly confessed, “I can run the ideas to the support-.”</span>\n</p>\n<p>\n<span>“I’ve got that.” Shinsou assured, fiddling with the pencil intently. “I’m a real ladies man when I try. Or man’s man. Or man...person. Point is, I can get us our shit.”</span>\n</p>\n<p>\n<span>Bakugou’s face pinched. “I see why Pikachu likes you, do you ever </span>\n<em>\n<span>stop talking. </span>\n</em>\n<span>We need mics and headphones.”</span>\n</p>\n<p>\n<span>“Done and done.” Shinsou whistled irritatingly. “You know me, speakers are the only reason I’m even here. I’ve got models that clip in front of your mouth and one around your neck my feathered-friend, since most of your sound is from there anyways.”</span>\n</p>\n<p>\n<span>Tokoyami stared. It was easy to forget how intelligent Shinsou had to be to make it so far. </span>\n</p>\n<p>\n<span>“In </span>\n<em>\n<span>front </span>\n</em>\n<span>of our face?” Bakugou gaped, “you rotten eggplant! That’s obvious as fuck!”</span>\n</p>\n<p>\n<span>“Nah, you’re getting a bandanna.” Shinsou pointed at Bakugou, although he aimed more straight upwards from his spot on the floor. “It’ll look cool as hell. Help with smoke inhalation too from all our bombs. You’re big and obvious, sweetheart. We’re gonna slim you down to shape.”</span>\n</p>\n<p>\n<span>“I hate you.” Bakugou stated calmly. “I hate you so much, I want to burn you alive and dance on your ashes.”</span>\n</p>\n<p>\n<span>“Only if it’s the cha cha slide.” Shinsou went with it without pause. “You’re a big flashy hero ooh how amazing. Let’s get rid of all that and turn you into like, a super secret ninja warrior. All black with like, grenades and stuff. Chat about maybe fixing your gauntlets.”</span>\n</p>\n<p>\n<em>\n<span>“Fuck you,” </span>\n</em>\n<span>Bakugou hissed out, “My gauntlets are </span>\n<em>\n<span>fine. </span>\n</em>\n<span>I’ve already got more streamline ones! It’s almost same capacity but you shits already know I’m making bombs!”</span>\n</p>\n<p>\n<span>“Sweet.” Shinsou sighed in satisfaction. “I’ve always wanted to make a bomb. How much can you make? Like, a few grenades a day?”</span>\n</p>\n<p>\n<em>\n<span>“Fuck </span>\n</em>\n<span>no.” Bakugou huffed, “I don’t sweat like a goddamn horse! I can get one if that!”</span>\n</p>\n<p>\n<span>Shinsou frowned, Tokoyami interjected. “I believe that my hero outfit requires little modification. Perhaps sound nullifying equipment.”</span>\n</p>\n<p>\n<span>“Sounds good,” Shinsou assured him tiredly, “ditch the cloak, it would ruin you if you were hanging from a ceiling. You guys good with trackers too? I could get a layout of the grounds and pretty much track you, or maybe have you track us.”</span>\n</p>\n<p>\n<span>Bakugou scoffed, “yeah, and have someone stumble into it! Shit no, make it portable!”</span>\n</p>\n<p>\n<span>Shinsou’s eyes widened, “</span>\n<em>\n<span>watches. </span>\n</em>\n<span>You’re a </span>\n<em>\n<span>genius.”</span>\n</em>\n</p>\n<p>\n<span>Bakugou’s answering eye roll wasn’t too cocky. “Yeah, I </span>\n<em>\n<span>know.”</span>\n</em>\n</p>\n<p>\n<span> </span>\n</p>\n<p>\n<span>Shinsou dropped their large duffel bag on the floor of his room, chosen for the lack of furniture. It made sense now, why he never let anyone in his room before. His bed was drab and boring, the lamp looked like it was from a discount store and the rug on the floor had a stain. The bed had two plush stuffed animals, both cats. One still had a tag on it, the other looked nearly as new.</span>\n</p>\n<p>\n<span>“Alright,” Shinsou started, unzipping and pulling out an assortment of oddities, “these cost me a pretty penny. Had to sample my quirk for an </span>\n<em>\n<span>hour. </span>\n</em>\n<span>Here’s the gear, it’s a bit different with extra additions we didn’t think of.”</span>\n</p>\n<p>\n<span>Tokoyami pulled out his cloak, looking at the strange mottled fabric. It was like a cloak, but not. It was too short and looked like it was supposed to wrap around his torso. A shawl with a disorienting pattern; something like mechanical tiling. Ah, he understood. Dark Shadow would be enough to flatten over them and obscure them from sight. This would work as camouflage in lighting, the design able to mimic glass.</span>\n</p>\n<p>\n<span>“Clever.” Tokoyami noted, fishing for the microphone which would secure on the underside of his beak.</span>\n</p>\n<p>\n<span>“What the hell is this?” Bakugou squawked, pulling out the mask. It, much to Tokoyami’s amusement, had a sharp white tooth pattern along it which resembled Bakugou’s own sharp teeth a surprising amount. Once the blonde turned it around, Tokoyami could spot the impressive filtration unit woven into the material to keep the air clean.</span>\n</p>\n<p>\n<span>“Okay, but consider this.” Shinsou said, chewing on something he found in his room. “You walk out of the darkness with bombs going off around you wearing that. You’ll look like such a badass.”</span>\n</p>\n<p>\n<span>Bakugou stared at the mask and grunted. He accepted it, and pulled out the other modification gear.</span>\n</p>\n<p>\n<span>The more startling gear was Shinsou’s,looking like something rather form fitted. Shinsou generally stuck to baggy clothing so the chance to see him in something more snug was startling. Along the outer edges of his thighs there was a...slightly grey mesh. Thicker woven padding on the outer edges of his forearms- small serrations even.</span>\n</p>\n<p>\n<span>“Sweet,” Shinsou whistled under his breath, running his finger along the serrations. “God, what I would have done for Support tech </span>\n<em>\n<span>years </span>\n</em>\n<span>ago.”</span>\n</p>\n<p>\n<span>Knowing Shinsou’s fighting style, the serrations were likely for some sort of grip or ridiculous climbing he seemed so fond of. He too had a mask like Bakugou’s except, his was more snug and began just below his eyes instead of lower on his face. It tied up in the back, hugging his jaw. It looked like Shoji’s mask mixed with something vaguely mechanical, a small light flashing along the side when he pressed it.</span>\n</p>\n<p>\n<span>“Alright. Cool.” Shinsou yawned. Almost in sync, from inside the bag came two identical, </span>\n<em>\n<span>“Alright. Cool.”</span>\n</em>\n</p>\n<p>\n<span>Tokoyami stared at the bag, and Bakugou formed a very terrifying grin.</span>\n</p>\n<p>\n<span> </span>\n</p>\n<p>\n<span>Midnight stole them from class, escorting them into the teachers lounge before she dropped herself heavily in a spinning chair. It tilted back obscenely far, her pointed shoes becoming almost equal to the groins. Each student took a careful step back.</span>\n</p>\n<p>\n<span>“Alright boys.” Midnight drawled with a small twisted smirk twisting her lipstick. “I heard your request here from the baby Eraserhead. Big talk.”</span>\n</p>\n<p>\n<span>Tokoyami and Bakugou both looked at Shinsou, who was pointedly not looking at anyone.</span>\n</p>\n<p>\n<span>“Very big talk actually.” Midnight hummed, twirling one strand of her hair between her fingers. “I know what you’re doing, and I find it hilarious. If it wasn’t for Yamada’s big mouth, I’d tell him about it. Now, obviously I know you only told me so you can get this sort of scenario signed off, and don’t get me wrong I’m going to...but I want to make this </span>\n<em>\n<span>interesting.”</span>\n</em>\n</p>\n<p>\n<span>Midnight’s eyes darkened and she smiled like a shark. “I hope you don’t mind, but I think it would be </span>\n<em>\n<span>fascinating </span>\n</em>\n<span>to use the third year firewalls for this fun little test.”</span>\n</p>\n<p>\n<span>Everyone was sent home for the weekend, then assigned specific days of the week to return to the UA campus to take their final exam. It was different than last semester, it was different than all exams before.</span>\n</p>\n<p>\n<span>Their phones were programmed with a block that removed their ability to send messages to other with exception to their group partners. Obviously, the school could do nothing to inhibit people from actually meeting up, but it was very casually explained that any sort of behaviour would result in severe punishment.</span>\n</p>\n<p>\n<span>There were seven groups, all listed on the chalkboard in class so everyone was well aware which day they would be coming in for their exam. It was unique, because although exams normally took place all on one day, everyone seemed to have a different group going down on specific days. </span>\n</p>\n<p>\n<span>Sunday, Todoroki and Hagakure were assigned to show up on campus at 10 am, their final exam was simply listed as </span>\n<em>\n<span>Explosive Threat and Deactivation.</span>\n</em>\n</p>\n<p>\n<span>Monday had Yaoyorozu, Uraraka, and Aoyama on a </span>\n<em>\n<span>Drug Purchase and Trade-off.</span>\n</em>\n</p>\n<p>\n<span>Tuesday had Midoriya, Koda, and Ashido on an </span>\n<em>\n<span>Underground Search and Rescue</span>\n</em>\n</p>\n<p>\n<span>Wednesday was Sero, Ojiro, and Iida on </span>\n<em>\n<span>Evading Unfriendly Pursuit</span>\n</em>\n</p>\n<p>\n<span>Thursday had Sato, Shoji, and Kirishima on a </span>\n<em>\n<span>Drug Production and Operation</span>\n</em>\n</p>\n<p>\n<span>Friday had Kaminari, Jiro, and Asui on a </span>\n<em>\n<span>Villain Capture and Takedown</span>\n</em>\n</p>\n<p>\n<span>Saturday, the last day of exams, was Tokoyami, Bakugou, and Shinsou on a </span>\n<em>\n<span>Villain Hostage Situation.</span>\n</em>\n</p>\n<p>\n<span>The entire list was very...surprising.</span>\n</p>\n<p>\n<span>After completing your exam, you were permitted to visit and view the subsequent exams under the condition you had no contact prior. That meant that Todoroki and Hagakure had the opportunity to watch everyone's tests and how they performed. Bakugou, Shinsou, and Tokoyami were going in absolutely blind with the knowledge everyone had performed before them.</span>\n</p>\n<p>\n<span>It also seemed...odd. Some of the match ups. Why was Iida’s final exam around evading capture? He was </span>\n<em>\n<span>built </span>\n</em>\n<span>on speed.</span>\n</p>\n<p>\n<span>“This seems odd,” Asui grumbled, copying down the names and times of each exam, “I sure am excited to see how everyone does.”</span>\n</p>\n<p>\n<span>Shinsou very carefully, didn’t react.</span>\n</p>\n<p>\n<span> </span>\n</p>\n<p>\n<span>“Alright, let’s do this.” Shinsou stretched, lounging about in their mouse trap of a final exam. He was adjusting his costume, making sure that all of the microphones and headsets were operating. Since Shinsou’s quirk relied on verbal communication, he had taken the role of the coordinator under his wing. Trackers on their arms let them know where each ally was, but Shinsou was going to be the one slowly working every opponent into their web.</span>\n</p>\n<p>\n<span>His quirk had been the worst to deal with. Using brainwashing was nearly useless when your opponent knew how to avoid it.</span>\n</p>\n<p>\n<span>Then, he and Bakugou started experimenting with it.</span>\n</p>\n<p>\n<span>It was when he and Bakugou had been bloodied and bruised, eyes swollen so black it was hard to tell what was eye bags and what wasn’t. They had time to kill, not recovered enough to exchange blows but cognitively functioning to talk plans. Tokoyami was good, he was actually </span>\n<em>\n<span>very </span>\n</em>\n<span>good. He had the most versatile quirk, and Dark Shadow was extra because the sentient creature </span>\n<em>\n<span>understood. </span>\n</em>\n<span>Tokoyami had excellent deduction and judgement calls since he literally had two minds functioning at all times.</span>\n</p>\n<p>\n<span>Bakugou and Shinsou had to change techniques, practically change everything about them. Once they had bonded over the unique visceral hatred of being treated like an animal, and what an emotionally scarring afternoon that had been, they actually...worked. They worked </span>\n<em>\n<span>really really well.</span>\n</em>\n</p>\n<p>\n<span>Shinsou’s quirk relied on consent, it relied on an acceptance and a willing party inviting him in. Tokoyami came up with the idea, realizing that the verbal response was a form of oral permission. Oral consent allowed Shinsou to sneak his way in past the mental barriers, and through careful practice and more than a few nosebleeds, he figured out how to layer that level of control into subconscious jerky movements.</span>\n</p>\n<p>\n<span>Basically, Bakugou already was a terrifying threat to face down.</span>\n</p>\n<p>\n<span>But now?</span>\n</p>\n<p>\n<span>“I am so ready to blast Icy-Hot’s goddamn smirk off his face.” Bakugou </span>\n<em>\n<span>grinned, </span>\n</em>\n<span>and they descended into their building.</span>\n</p>\n<p>\n<span> </span>\n</p>\n<p>\n<span>Todoroki stretched, and shot a glance to the side. Hagakure was vibrating with excitement.</span>\n</p>\n<p>\n<span>“Let’s do our best!” She spoke, far too chipper for him to ever comprehend.</span>\n</p>\n<p>\n<span>“Right.” He agreed, rolling his shoulders and double checking each side was working properly.</span>\n</p>\n<p>\n<span>The gates opened, and the two carefully walked inside the quiet grounds.</span>\n</p>\n<p>\n<span>“Aizawa-Sensei said that our exam was a Bomb Threat!” Hagakure exclaimed, leaping up and down quietly to glance around. “I see the borders! That means we’re over on the south district!”</span>\n</p>\n<p>\n<span>Todoroki didn’t make a noise but instead started walking that way. They had their eyes peeled for any sort of opponent. They didn’t truly know what they were getting into.</span>\n</p>\n<p>\n<span>They had been supplied capture tape, and a list of requirements and limitations. No intentionally career ending injuries, no malicious acts of harm. Everything is within reason under the basis it was real life situation. Last minute decision making was all being counted towards them. Capture tape functioned on the standard level of restraining a single limb. Being knocked unconscious disqualified either party.</span>\n</p>\n<p>\n<span>That alone let Todoroki know that they were fighting </span>\n<em>\n<span>people, </span>\n</em>\n<span>not robots. The scenario was also...odd. A bomb threat implied explosives, which meant that he would be unable to use his left side safely until they understood the situation better.</span>\n</p>\n<p>\n<span>Hagakure was saying something, but then, something exploded.</span>\n</p>\n<p>\n<span>It wasn’t a big explosion, but it was still large enough that she reacted by tackling him to the ground.</span>\n</p>\n<p>\n<span>He landed with the wind knocked out of him, thankfully out of any harms way. The air smelled oily and thick, gasoline or something burning rancid. Small bits of plaster rained down on them.</span>\n</p>\n<p>\n<span>“They’re really going all out.” Hagakure spoke, shakily trying to lighten the mood. </span>\n</p>\n<p>\n<span>“They used some sort of combustible for it.” Todoroki sniffed the air, staying low and aware for any other movements, “they must have a source. That blast was far away from us, but timed too right.”</span>\n</p>\n<p>\n<span>“You think they’re trying to scare us?” Hagakure caught on fast, “or just letting us know what we’re working with?”</span>\n</p>\n<p>\n<span>Todoroki’s lip curled and as much as he hated the idea, only one thing made sense to him. “We’re too exposed. We need to get to cover, something that won't go down easy, and we can still move.”</span>\n</p>\n<p>\n<span>“There’s a nearby building. Heavy brick.” Hagakure pointed, a single glove directing him to a perfect place to take cover and figure out a plan. </span>\n</p>\n<p>\n<span>“Let’s go.”</span>\n</p>\n<p>\n<span> </span>\n</p>\n<p>\n<span>Shinsou grinned, one hand lifting to activate the speaker connection. “They fell for it, great job setting off the charge, Tokoyami.”</span>\n</p>\n<p>\n<span>A small chirp in response, a small bird nobody would have thought about unless they knew Tokoyami had now an affinity for bird calls.</span>\n</p>\n<p>\n<span>“Alright, they’re heading right into the building we planted. Tokoyami, take the path in the sewers we cleared out and come up from the basement. Bakugou, if you hit the charge the moment they get to the first floor landing, you’ll trap them in and then you’re set.”</span>\n</p>\n<p>\n<span>The speaker clicked ever so quietly before static cut in and a low rumbling voice of their resident pyrotechnician. “They still clueless, you tacky street performer?”</span>\n</p>\n<p>\n<span>Shinsou glanced to the side, squinting at the computer feed of the traffic cameras he had support link for him. “Yeah, they’re looking still all noble and determined. Tokoyami, you ready to scare them shitless and Bakugou you ready to smash them?”</span>\n</p>\n<p>\n<span>Tokoyami chattered like a bird, still careful since he was out on the street not far from Hagakure and Todoroki. </span>\n</p>\n<p>\n<span>Bakugou chuckled darkly, and Shinsou sat back to watch the show.</span>\n</p>\n<p>\n<span> </span>\n</p>\n<p>\n<span>The moment Todoroki managed to get inside the building and started up the stairs, something started burning. Gut reaction managed to spawn a wall of ice, barely shielding them as a wall of flame encapsulated the doorway they entered from and sent brick and wood collapsing with a groan.</span>\n</p>\n<p>\n<span>Hagakure screamed as his ice exploded, the stairwell collapsed and the two were sent blasting into drywall. It hurt, and somewhere through the cloud of dust he could see Hagakure’s body now visible from grime.  </span>\n</p>\n<p>\n<span>“Are you okay?” Todoroki coughed out, trying to get the air back into his lungs. Every sense was on high alert, something about the entire situation felt far too orchestrated. “This...this isn’t right.”</span>\n</p>\n<p>\n<span>“I know.” Hagakure wheezed back exhaustedly from the rubble. “I think...I think my wrist is sprained.”</span>\n</p>\n<p>\n<span>Todoroki grimaced, and slowly began getting to his feet. “Come on, we can’t stay here. They’ve planned for us, so they’re going to have some sort of-.”</span>\n</p>\n<p>\n<span>They both froze as they heard an ungodly noise of something scratching. A loud high pitched shrieking of metal scraping. Slowly increasing in noise until it became very apparent that it was right under them.</span>\n</p>\n<p>\n<span>“I thought this was a bomb situation.” Hagakure whispered, her voice shaken.</span>\n</p>\n<p>\n<span>It was, at least Todoroki thought as much.</span>\n</p>\n<p>\n<span>Something crunched loudly and sickeningly. A floorboard in front of them crumpled, and fell into the abyss of a basement below. They didn’t need to think to know that the basement would be a horrible location to go.</span>\n</p>\n<p>\n<span>“Move!” Todoroki bellowed, jumping to his feet. Already Hagakure was bolting, shaking off the dust as she ran. Each step towards the busted collapsed stairwell made her both more invisible, and the suspicious invisible creature chasing them get closer.</span>\n</p>\n<p>\n<span>Todoroki jumped, grabbing her one good wrist and with a sudden jolt of ice, propelled them upwards to the second floor landing. The ice was straight up, so whatever was chasing them would be unable to ascend as rapidly.</span>\n</p>\n<p>\n<span>“Okay,” Hagakure spoke, visibly shaken. “So we’re in a bomb situation, stuck on the second floor of a building, with an invisible monster chasing us.”</span>\n</p>\n<p>\n<span>“We only need to capture the bomb.” Todoroki tried to help the situation, mind scrambling over the stench of gasoline thick in the air. “They had time to prepare and know it was us. I can’t use my left side in here or we’ll fall through the ground.”</span>\n</p>\n<p>\n<span>“You can’t ice the whole building either because you can’t always see where I am.” Hagakure instantly understood. “Oh, this…”</span>\n</p>\n<p>\n<span>It wasn’t an ideal situation at all.</span>\n</p>\n<p>\n<span>Footsteps from up the hallway, in the only direction available for them.</span>\n</p>\n<p>\n<span>A single figure walked casually down the old faded carpet, approaching the dead end landing they were on.</span>\n</p>\n<p>\n<span>“Surprise, extras.” Bakugou Katsuki drawled, dressed in an alarming array of thick protective guarding, looking more like high end SWAT protective gear. His eyes though, were unhinged and his teeth were on display like a feral animal. “</span>\n<em>\n<span>I’m the fucking bomb.”</span>\n</em>\n</p>\n<p>\n<span> </span>\n</p>\n<p>\n<span>Things quickly became much much worse.</span>\n</p>\n<p>\n<span> </span>\n</p>\n<p>\n<span>The building, much to Hagakure and Todoroki’s exasperation, was clean until they broke a single plumbing pipe and realized the entire building was filled to the brim with gasoline.</span>\n</p>\n<p>\n<span>Bakugou may have theoretically been a bomb, but they were literally trapped inside a </span>\n<em>\n<span>bomb. </span>\n</em>\n<span>Todoroki couldn’t use his ice recklessly, lest he bust more walls and lead to even more gasoline spreading. With how often Bakugou sent off sparks mindlessly, all three of them would go up in flames. Todoroki had one scar to prove that he wasn’t fireproof; Bakugou was covered with high end protective gear that was likely flame retardant. Todoroki wasn’t sure if his father could burn through it, or even break it under his fist.</span>\n</p>\n<p>\n<span>Bakugou, without his flair for dramatics, was taking vicious delight in the newfound freedom of casually pummeling both of them through the walls, against the floor, and even chucking a brick against Todoroki’s collarbone so firmly he could have sworn it cracked.</span>\n</p>\n<p>\n<span>“This </span>\n<em>\n<span>sucks.” </span>\n</em>\n<span>Hagakure moaned, through the high pitched buzzing in one of Todoroki’s ears he couldn’t quite find her location. He couldn’t ice the entire floor without hurting his partner, and he couldn’t just layer ice on the walls to stop the gas or the weight would send them crashing down into the basement. And maybe set off another bomb.</span>\n</p>\n<p>\n<span>“I hate you.” Todoroki told the world exhausted, then slowly forced himself shakily to his knees.</span>\n</p>\n<p>\n<span>“Oh wow,” Bakugou taunted, curling his hands into a fist. There were thick plastic guards over the back of his hands- or maybe they were some sort of...ceramic, or fiberglass. Either way, they hurt on par with being smashed with a bar of rebar and Todoroki was getting very fed up. “Look at you. Stand still while I bash in your face so you’re goddamn symmetrical, you reject abstract painting.”</span>\n</p>\n<p>\n<span>“Rude,” Todoroki groaned out, feeling one of his teeth start to wiggle in his jaw, “I’m impressionism.”</span>\n</p>\n<p>\n<span>Bakugou blinked in surprise for a split second before he ignored it and casually threw him into a window frame.</span>\n</p>\n<p>\n<span>“Defenestration.” Todoroki choked out, “creative.”</span>\n</p>\n<p>\n<span>Then, he iced the floor.</span>\n</p>\n<p>\n<span>Bakugou made a noise of protest, something similar to a furious banshee. Hagakure wasn’t getting up, she had trained in stealth and wasn’t experienced with taking heavy hits from a fighter like Bakugou.</span>\n</p>\n<p>\n<span>“You’re dead for that!” Bakugou screeched, punching the ice over and over. Todoroki noticed, in complete and utter awe and respect for the support course, that the knuckle guards were starting to splinter the ice away.</span>\n</p>\n<p>\n<span>“This isn’t fair,” Todoroki sighed, stumbling exhausted to his feet. With a leaf from Bakugou’s book, he iced over the knuckles of his right hand. Once it seemed thick enough to his best guess, he wheeled back and punched.</span>\n</p>\n<p>\n<span>Bakugou’s head snapped to the side with an abstract clicking noise. More in surprise that it actually </span>\n<em>\n<span>worked, </span>\n</em>\n<span>Todoroki was very unaware of when two large black claws broke the flooring under his feet, and sent him crashing through not one, but </span>\n<em>\n<span>two </span>\n</em>\n<span>floors before smashing into concrete.</span>\n</p>\n<p>\n<span>(Todoroki and Hagakure failed their exam, but Bakugou lost a molar so it seemed pretty fair.)</span>\n</p>\n<p>\n<span> </span>\n</p>\n<p>\n<span>Monday started fair for Uraraka and Yaoyarozu. It was wonderful to have Aoyama with them, a distance fighter was good for watching their backs as they slowly broke into the manufacturing lab with various chemicals. Beakers were listed with names that Momo instantly recognized as dangerous fumes, although she wasn’t sure just how realistic they had made the final exam.</span>\n</p>\n<p>\n<span>The first issue they ran into, was how the entire manufacturing lab was made of incredibly tight narrow corridors with no windows. She wasn’t exactly sure what the purpose of the lab was, or why the building was so odd, but she was suddenly very aware of how bare it was.</span>\n</p>\n<p>\n<span>Uraraka was starting to get stressed by the lack of objects around. Each brick was cemented firmly together with bright white waterproofing. The ceiling was made with fluorescents so it creates a seamless corridor. Momo resorted to making a few smaller objects and a staff just to fend off a threat if it ever came. She even laid down </span>\n<em>\n<span>traps.</span>\n</em>\n</p>\n<p>\n<span>“This seems really creepy.” Uraraka shivered, peering around yet another corner with a shiver. “I feel like someone is watching us.”</span>\n</p>\n<p>\n<span>And on cue, the lights began to flicker, and then they died.</span>\n</p>\n<p>\n<span>“Oh,” Aoyama said something else in French. Momo made a noise that was partially scandalized and partially amazed, so Uraraka assumed it was something bad.</span>\n</p>\n<p>\n<span>Then, small clicking noises began. Small little tapping things, quiet and muffled somewhat.</span>\n</p>\n<p>\n<span>“Wait, I think it’s coming from above us.” Uraraka whispered, tapping her fingers together as she started to float. She clutched one end of Momo’s staff to keep her distance as she started listening to the ceiling tiles. “It’s in the wall!”</span>\n</p>\n<p>\n<span>“Wait,” Momo muttered, pulling out a flashlight from her chest. She winced at the effort, Aoyama catching Uraraka as she dropped from the ceiling.</span>\n</p>\n<p>\n<span>The flashlight flickered on, directly into the bright glowing eyes of a monster.</span>\n</p>\n<p>\n<span>“Eep!” Uraraka screamed, stumbling backwards. Aoyama reacted the fastest, firing off a single shot from his naval laser. The monster screamed, and drew back flailing, claws gouged the walls and the deflected laser burst through the crumbled concrete. Almost instantly, Momo recognized the smell.</span>\n</p>\n<p>\n<span>“Gas!” She screamed. Grabbing Aoyama with one hand, she pulled back and forced her partners to sprint towards the only open room they had found so far in the entire building- the one with the chemical jars.</span>\n</p>\n<p>\n<span>“That was Dark Shadow!” Uraraka screamed in surprise, “That was Tokoyami!”</span>\n</p>\n<p>\n<span>That was surprising, they were meant to combat on the last day. What if each group was supposed to partner up against another team? No,they hadn’t heard anything about it, and it would have been Todoroki who was pairing off against the last team- unless they had somehow been shuffled?</span>\n</p>\n<p>\n<span>At this rate, it could mean that they were fighting against </span>\n<em>\n<span>any </span>\n</em>\n<span>of their classmates- although whoever it was had certainly thought through the situation given the thick putrid stench of gasoline filling the hallway leisurely.</span>\n</p>\n<p>\n<span>The only open room wasn’t a better location from a strategic standpoint. Facing off against Dark Shadow required light- but almost all sources of light required a type of fire hazard. With gasoline and the jars of (likely other combustible mixtures), they couldn’t use Aoyama’s quirk at all. Uraraka couldn’t use her quirk in fear of smashing something explosive, which left Momo as the only source of offense.</span>\n</p>\n<p>\n<span>“I can fight.” Uraraka’s brow furrowed, her stance shifting as Momo carefully scanned the room around them with her flashlight. Aoyama stuck close, the cloth of his cape brushed against her exposed legs.</span>\n</p>\n<p>\n<span>“We’re supposed to stop drug production.” Momo muttered, a chilling sensation freezing her limbs. “This entire </span>\n<em>\n<span>place </span>\n</em>\n<span>is an...an explosive chemical lab.”</span>\n</p>\n<p>\n<span>“So we can’t break anything.” Urararaka grimaced.</span>\n</p>\n<p>\n<span>“I cannot use my quirk.” Aoyama vibrated slightly, shivering in anxious tension.</span>\n</p>\n<p>\n<span>Momo stiffened, she heard the softest noise right behind them-.</span>\n</p>\n<p>\n<span>“Damn straight.” Bakugou Katsuki grunted, leaning casually against one of the vats of explosive liquid casually, flickering a small handheld lighter on and off again- casually watching the flame flicker to plunge him into darkness and illumination over and over again.</span>\n</p>\n<p>\n<span>“Sure seems you’re fucked,” Bakugou spoke- </span>\n<em>\n<span>flick, </span>\n</em>\n<span>suddenly face illuminated in shades of orange and yellow. His grin sharp and eyes glowing with vicious glee, “since you all aren’t goddamn </span>\n<em>\n<span>explosion proof.”</span>\n</em>\n</p>\n<p>\n<span>“Oh.” Uraraka spoke in a soft whisper, softly saying the deadpan the team realized very quickly.</span>\n</p>\n<p>\n<span>“So,” Bakugou almost snickered, “ready to get </span>\n<em>\n<span>wrecked </span>\n</em>\n<span>you goddamn extras?”</span>\n</p>\n<p>\n<span>They were screwed.</span>\n</p>\n<p>\n<span> </span>\n</p>\n<p>\n<span>“This is strangely quite intriguing.” Tokoyami confessed, perching on a chair as he watched the screens. </span>\n</p>\n<p>\n<span>“Isn’t it fun?” Shinsou asked, tapping on a keyboard to shift the security camera view to another hallway. Currently, Ashido, Koda, and Midoriya were making their way very carefully through one of the basement hallways. The above ground area was far too dangerous to wade through (due to Kirishima’s human battering ram and Shinsou’s own fun indulgence) so they were very carefully crawling down and around the hallways.</span>\n</p>\n<p>\n<span>“Here, let's set off the fire alarm-...”</span>\n</p>\n<p>\n<span>The alarm nearest Midoriya started going off with a blinking strobe light and a piercing wail. Mina shrieked, setting loose a small stream of acid which melted the casing and stopped its wailing. The hallway now pulsed in flashes of light, unable to prevent the strobe.</span>\n</p>\n<p>\n<span>“Oh that’s nice.” Shinsou looked at it considering, “Dark Shadow want to go take down Mina? I don’t think Koda is going to last long without crying.”’</span>\n</p>\n<p>\n<span>In the distance, something exploded. Very quickly, the hallway sprinklers activated and spread out a thick dark sludge. It touched Mina’s acid, and promptly exploded.</span>\n</p>\n<p>\n<span>“Oh, </span>\n<em>\n<span>yes.” </span>\n</em>\n<span>Shinsou’s eyes nearly glowed in the dark. “Bakugou, come in.”</span>\n</p>\n<p>\n<em>\n<span>“I hear you, plum-shit.”</span>\n</em>\n</p>\n<p>\n<span>Shinsou rolled his eyes, Tokoyami adjusted uncomfortably. “Ashido’s acid and the sprinkler sludge makes explosions.”</span>\n</p>\n<p>\n<span>A pause, then Bakugou’s communication device just sent back pure maniacal laughter.</span>\n</p>\n<p>\n<span> </span>\n</p>\n<p>\n<span>Midoriya may have been able to deal with one explosion inducing maniac, but the moment Mina was stuck with only hand to hand contact in fear of blowing up her allies, and Koda was trapped underground without access to any sort of animals- well, he knew he was screwed.</span>\n</p>\n<p>\n<span>It was worse than the fake bomb test, because Mina was truthfully trying her best, but everytime she jumped startled more acid came out and more explosions and that </span>\n<em>\n<span>god awful </span>\n</em>\n<span>smell of overcooked pineapple- and Koda was hurling in the corner of the room.</span>\n</p>\n<p>\n<span>“I’m sorry!” Mina wailed, “I can’t help it!”</span>\n</p>\n<p>\n<span>Another sudden rupture of the lightbulb, sending them in pitch black. Mina gave a small </span>\n<em>\n<span>eep! </span>\n</em>\n<span>And more acid- which left Koda puking even more.</span>\n</p>\n<p>\n<span>“I’m sorry!” Mina wailed, Midoriya backtracked rapidly. </span>\n</p>\n<p>\n<span>“No! No it’s completely fine!” Midoriya squeaked, “let’s just try our hardest and-.”</span>\n</p>\n<p>\n<span>The door exploded inwards, barely missing Koda with how hard it impacted the far side. In stomped a familiar figure and Midoriya’s heart fell out.</span>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>Deku!” </span>\n</em>\n<span>Bakugou roared, a savage grin twisting on his face. His hands sparked with explosions- the fire alarm and sprinklers went off again-.</span>\n</p>\n<p>\n<span>Koda kept hurling. They weren’t going to win this.</span>\n</p>\n<p>\n<span> </span>\n</p>\n<p>\n<span>“Are you sure you know how to antagonize Iida?” Tokoyami asked, curiously spotting what looked like bronze rings sliding onto Shinsou’s knuckles.</span>\n</p>\n<p>\n<span>“Yep.” Shinsou said casually, flexing both hands casually as if he hadn’t just slid bronze knuckles on both hands. “He’s easy.”</span>\n</p>\n<p>\n<span>“He is?” Tokoyami asked, eyes watching the cameras as the group departed from the gates.</span>\n</p>\n<p>\n<span>“You just throw some sort of ambiguous philosophical problem at him and he completely melts.” Shinsou sighed, “like, how do dogs wear pants.”</span>\n</p>\n<p>\n<span>“The </span>\n<em>\n<span>fuck?” </span>\n</em>\n<span>Bakugou hissed.</span>\n</p>\n<p>\n<span>“Yeah, no worries. This team is completely mine. Well, except Sero. Go smack him silly.”</span>\n</p>\n<p>\n<span>Bakugou huffed, looking pissed at the idea of being bossed around. “</span>\n<em>\n<span>Fine. </span>\n</em>\n<span>Horse face is </span>\n<em>\n<span>mine.”</span>\n</em>\n</p>\n<p>\n<span>“Good.” Shinsou rolled his shoulders, “I’m gonna snatch Iida, and take my horse to the old town road, and beat the </span>\n<em>\n<span>shit </span>\n</em>\n<span>out of that monkey tailed </span>\n<em>\n<span>fucknugget.”</span>\n</em>\n</p>\n<p>\n<span> </span>\n</p>\n<p>\n<span>Ojiro spat blood. He may have known martial arts, but there is no way to defend yourself against a rabid animal riding a super fast student wielding bad puns and bronze knuckles.</span>\n</p>\n<p>\n<span>Ojiro got one good kick in. Shinsou grappled, grabbing his arm like one of those mob-men movies Hagakure liked to watch, and broke it.</span>\n</p>\n<p>\n<span> </span>\n</p>\n<p>\n<span>Shinsou took the stage for the next round.</span>\n</p>\n<p>\n<span>The idea was, that the Drug Operation Kirishima, Shoji, and Sato were trying to stop would be within tight confines. They would be forced to wiggle through tight pathways, leap over careful tubing and ventilation shafts, and not damage anything for the risk of spilling the unmarked chemicals everywhere.</span>\n</p>\n<p>\n<span>It was no coincidence that they were also the class’ most chaotic physically destructive group. Excluding Bakugou, they racked up the highest damages in property, although Shoji normally was pretty good with preventing unnecessary damage.</span>\n</p>\n<p>\n<span>Kirishima on the other hand, simply screamed as Shinsou stood on top of the tallest vat and used his capture scarf to swing both Kirishima and Sato around and around like the world's largest hammer throw.</span>\n</p>\n<p>\n<span>Shinsou at least seemed to be having fun, using both of the thick headed enemies to smash apart various vats and pipes that released gasoline and other flammables onto the floor. All Bakugou had to do was yawn, take a nap, and physically be present enough to cause the others to forfeit due to anxiety.</span>\n</p>\n<p> </p>\n<p>\n<span>Kaminari, Jiro, and Asui stood firm and ready to fight.</span>\n</p>\n<p>\n<span>Bakugou was almost getting tired, ready to deal with a pair of annoyances. Luckily, they had planned this interaction quite well.</span>\n</p>\n<p>\n<span>Dark Shadow clicked his beak ominously, eyeing Asui who gulped and hid her tongue a bit more. She was a well rounded fighter, but Dark Shadow and Tokoyami both had a </span>\n<em>\n<span>very </span>\n</em>\n<span>sharp beak.</span>\n</p>\n<p>\n<span>Kaminari was...well, he was </span>\n<em>\n<span>terrified </span>\n</em>\n<span>of Bakugou. And on record of never having won a fight in recorded history.</span>\n</p>\n<p>\n<span>Jiro turned up the amps on her legs, and Shinsou casually turned up his own microphone and speaker. </span>\n</p>\n<p>\n<span>“So,” Bakugou said, rolling his shoulders casually, “you extras ready to fucking die?”’</span>\n</p>\n<p>\n<span>“No.” Kaminari eeped, looking pale and very scared, “I’m really not.”</span>\n</p>\n<p>\n<span> </span>\n</p>\n<p>\n<span>“Your music is bad,” Shinsou said dramatically, “and you should </span>\n<em>\n<span>feel bad.”</span>\n</em>\n</p>\n<p>\n<span>Jiro’s jaw twitched, eyes watering in her efforts to not talk.</span>\n</p>\n<p>\n<span>“Queen is overrated and overplayed.” Shinsou said.</span>\n</p>\n<p>\n<span>A single tear welled in Jiro’s eye.</span>\n</p>\n<p>\n<span>“Cold water is better than milk, for dunking cookies.”</span>\n</p>\n<p>\n<span>“You </span>\n<em>\n<span>monster.” </span>\n</em>\n<span>Jiro whispered, and lost.</span>\n</p>\n<p>\n<span> </span>\n</p>\n<p>\n<span>Distantly, Aizawa rested his head on his desk in dismay. Both Midnight and Present Mic were trying not to cackle. Even All Might looked impressed, if not a bit dismayed.</span>\n</p>\n<p>\n<span>“We’re going to have to redo all of this,” Aizawa moaned into the table. “This was completely too well coordinated.”</span>\n</p>\n<p>\n<span>“You counted on their inability to hold them back, but you didn’t account for being petty and spiteful.” Midnight soothed him.</span>\n</p>\n<p>\n<span>Present Mic watched, trying </span>\n<em>\n<span>so hard </span>\n</em>\n<span>not to laugh, as Shinsou casually commanded Jiro to play horrible Salsa music to knock Asui unconscious.</span>\n</p>\n<p>\n<em>“I suggest…” he started before trailing off weakly. “...We alternate our personalities into something we’re not. Something unexpected, or...enough to gain hesitation.”</em>\n</p>\n<p>“Are you suckers ready?” Bakugou asked in the locker room. It felt strange- eerily quiet and somehow oppressive. Bakugou wanted to clench his jaw and bare his teeth and snarl at the rusting bleachers: <em>Here I am, the villain you demanded of me!</em></p>\n<p>Shinou scoffed quietly, the noise amplified by the desolation of the locker room. He looked so strange, dressed in snug clothing formed by multiple overlapping seams. Each crease of fabric lay perfectly, intentional in its array. Shinsou wasn’t muscular or fast, but muscle definition only defined his history and strengths. Thick cords in strange locations; kicking, punching, struggling.</p>\n<p>Shinsou’s armor looked like fluid plates, serrated scales slotted on his outer thighs and calves and forearms. No more dangerous than a defensive hedgehog. It reminded Tokoyami distantly of a pangolin, an Asian animal with long claws and timid heart.</p>\n<p>“Not going to lie, I’m a bit freaked,” Shinsou confessed. He breathed quickly, running one hand through his hair before he tugged his facial mask up high. Snug it rest across his cheekbones, custom made through silicone modeling to contour to the precise ridges of his cartilage and bone. Secured in place, Shinsou’s eyebags morphed into black fabric, all expression lost before it began.</p>\n<p>“I am as well,” said Tokoyami. He adjusted his collar, the microphone, and speaker resting tightly across his throat. His custom outfit, with dark shapeless silhouettes and reflective industrial camouflage, felt villainous to wear.</p>\n<p>“Oh stop being a chicken-shit,” Bakugou growled, tugging up his own mask. His at least better encapsulated his personality, embroidered with vivid white shark-tooth grins. A jack-o-lantern, or Kirishima’s worst snarl. Bakugou’s mask rested low, barely brushing the bottom of his nostrils and really only served to isolate his lips and effectively imply a gag. It felt unnatural to look at the normally explosive teeth and see such a restraint.</p>\n<p>“This is really fucking weird,” Shinsou blurted behind his cloth. On cue, the speakers behind both Tokoyami and Bakugou’s ear chirped near simultaneously: <em>This is really fucking weird.</em></p>\n<p>Bakugou rolled his eyes, the whites yellow compared to the stark embroidery. He said, “<em>Yeah well, this is the fucking finale, boys. This is fucking it!”</em></p>\n<p>Shinsou giggled again, a tad hysterical. His hair couldn’t stand up any worse with how often he ran his hands through it. “I can’t believe we’re doing this.”</p>\n<p><em>“Yes,” </em>Tokoyami said, shifting under his shawl. <em>“It…is odd.”</em></p>\n<p><em>“I’m so fucking ready for this,” </em>Bakugou growled. His eyes were wild, hands contorting and making muscle ripple out of his forearms. Bakugou could kill someone with one fist. And with his quirk.</p>\n<p>“You ready?” Shinsou asked Bakugou warily, “We’ve practiced a few times, but I want to make sure-.”</p>\n<p>Bakugou reached up and ripped down his mask, flashing white teeth, and his sneer. “We’ve been <em>over this! </em>Just fucking <em>do it!”</em></p>\n<p>“Fine!” Shinsou growled, concentrating on something just left of Bakugou’s words. He snared it, grabbing tight between both hands before slowly- he released. One by one, until only the smallest touch remained, a single nail pressing into skin-</p>\n<p>“Okay,” Shinsou breathed slowly and opened his eyes to see his work. He could feel it more than see it- his hands shifting and sculpting Bakugou’s expression into what he wanted.</p>\n<p>Bakugou’s face went slack, eyes dull and wrinkles smooth. His jaw dropped, breathing slow and calm. <em>Less, </em>and Shinsou withdrew one hair more.</p>\n<p>“That’s enough prune-douche,” Bakugou snarled in a disorienting juxtaposition of a monotone. Tokoyami shuddered visibly, averting his eyes as Bakugou’s expression remained flat and apathetic.</p>\n<p>Shinsou winced, pressing one hand to his forehead. The connection wobbled slightly, then steadied itself. It would take a while before Shinsou felt comfortable enough to stretch it, testing sudden withdrawing and rising over again.</p>\n<p>“All good, fuck-weasel?” Bakugou intoned like a zombie.</p>\n<p>“Fine, you’re just a goddamn headache,” Shinsou grunted. Bakugou made a truly disturbing bland laugh: <em>Hah.</em></p>\n<p>Tokoyami clicked his beak, unwilling to watch the grotesque experience.</p>\n<p>Shinsou tugged up his facemask, aligning it and the microphones into position, his watch came alive and began to configure itself with the map they all downloaded ahead of time. The trackers in each of their suits would show live-time location.</p>\n<p>“You’re ready to go?” Shinsou double-checked, making sure all of the reinforced ridges of his outfit were in proper orientation. If any of the metal inserts shifted wrong, a single kick would end up hurting <em>him.</em></p>\n<p><em>“Yes,” </em>Bakugou echoed eerily. <em>“My grenades are ready to fuck shit up.”</em></p>\n<p><em>“This is…incomparable,” </em>Tokoyami settled with another shiver. <em>“I have my projectiles ready.”</em></p>\n<p>“Right,” Shinsou exhaled warily. “The projectile trackers- we all know the drill. We’ve run through it like, nine times. You find him, you stick him, we bitch him.”</p>\n<p><em>“Yes.” </em>Bakugou intoned flatly. <em>“We will make him our bitch.”</em></p>\n<p>Tokoyami muttered something that could have been a prayer.</p>\n<p>The three of them sunk out into the zone, already aware of the situation. For equal fairness, the setting and environment had been modified so neither party had an advantage. As per their request, no additional aid was provided beyond that of third-year firewalls as Midnight gave permission for.</p>\n<p>Midnight signed off, the rest of the staff agreed, and along the high ceilings a dozen silent camera drones watched their movements.</p>\n<p>They sunk through the zone, quiet and breathing slowly. Hearts racing in their throats, pulsing in their arms.</p>\n<p><em>“Okay,” </em>Tokoyami said quietly. <em>“I am departing for cover.”</em></p>\n<p>“Good luck,” Shinsou offered, keeping an eye on his watch as Tokoyami’s signal spread further from their location. “Bakugou, we’ll head for higher ground and stay low.”</p>\n<p><em>“I know you idiot tuber,” </em>Bakugou said. It felt like a computer reading from typed font. A poor narrator, a machine. Shinsou felt his neck turn into goosebumps.</p>\n<p>They ascended as quickly as they could. Their dark form-fitting clothing wouldn’t disguise them well in the bright lights. Their only benefit would be the intense padding, protection, and hidden weapons.</p>\n<p>A buzzer echoed distantly, and a large door slid open.</p>\n<p>The final test had begun.</p>\n<p>Aizawa stared at the paper in sheer disbelief. It wasn’t forged- let alone nobody would be stupid enough to forge <em>this, </em>but it was…<em>ridiculous.</em></p>\n<p>“It looks like you have quite the students,” Midnight taunted, her grin wide and eyes bright. “If I didn’t know better, I’d think they’re holding a grudge!”</p>\n<p>Faculty challenges weren’t common, but they weren’t unheard of either. Often the third years, those on the cusp of graduation would succumb to their curiosity and file for challenging. A hero fight, the chance to test their full capabilities against a tried and true official. More a rookie spar, but often they turned sour first.</p>\n<p>This was different, because <em>yes </em>the paperwork was correct, but this was…<em>his students.</em></p>\n<p>“I can’t accept,” Aizawa said. “I’ll hurt them-.”</p>\n<p>“They were quite persuasive,” Midnight countered. “Principal Nedzu already signed off, I’m just here to tell you personally.”</p>\n<p>Aizawa rubbed his eyes and felt numb. “No, their exam is over. It just finished-.”</p>\n<p>“Ah, about that,” Midnight said. “This has been in the works and approved for months now. Before the exams, although I’m sure they’ll be pleased to know that you passed them anyways. Without this affecting that.”</p>\n<p>Aizawa hung his head into his hands. “Nemuri, I <em>can’t-.”</em></p>\n<p>“You’ll break those children,” she said. “Or you’ll break their confidence. Pick your fight, Shota. Knock out teeth or expel them, there’s no in-between. The moment you selected them based on quirk discrimination, you were drafting for this fight.”</p>\n<p>“I <em>didn’t </em>pick them!” Aizawa argued. “It was <em>assigned already. </em>I couldn’t manage any alternative exam which filled the requirements better, I didn’t have an argument-.”</p>\n<p>“Then you better figure out your gameplan, mister,” Nemuri clicked her tongue and shook her head. “I’m the proctor for it. You’re given third-year clearance.”</p>\n<p>Aizawa froze. “You’re kidding me. I’m given <em>third-year protocols? </em>Why on <em>earth </em>would I call in rescue teams- are you telling me there's victim actors arranged?”</p>\n<p>“No, none of those. But you do have the resources for calling in rescue teams or a perimeter. Just so you know how serious this is.”</p>\n<p>“I already <em>know,” </em>Aizawa said. “Remember, Bakugou, Tokoyami, and Shinsou aren’t your students. They’re <em>mine.”</em></p>\n<p>When the buzzer rang and Aizawa walked into the stadium, he wore his goggles and gear and prayed no student would be harmed beyond reason.</p>\n<p>On a rooftop, Shinsou braced himself against a rooftop and told his team, “I have a visual.”</p>\n<p>Aizawa cursed under his breath when he came across the distorted figure of something unimaginable.</p>\n<p>He had seen many horrible quirks in his life, some physical amalgamations of flesh and bones or sensory organs too distorted to ever work. He had seen horrible things, monstrous things. Tokoyami crawled towards him with six limbs and reversed bones howling a shrieking nose of something feral.</p>\n<p>(He thought he was fighting his children. Not this. Never this.)</p>\n<p>He had fought Todoroki and Yaomomo but he knew those students- here was nothing like then. Here Tokoyami scuttled around like a freakish animal, long claws tearing across cement and powerlines where they collapsed and danced across the ground like venomous snakes. Aizawa could do little to stop him- he could only dodge and evade and watch as this…<em>thing </em>hunted him.</p>\n<p>“Tokoyami!” He shouted, because <em>what happened? </em></p>\n<p>The <em>thing- </em>a mixture of Dark Shadow and his student, or perhaps the individuals warping one another into something else, howled and shrieked at him with rattling cries. The creaking of a door hinge, the tapping of cat claws across his kitchen floor. A collection of sounds with no humanity and Aizawa <em>moved.</em></p>\n<p>His eyes burned, and the shell receded enough to recognize that Dark Shadow <em>was </em>the manifestation- and still, Tokoyami flung forward wreathed in a shapeless dark mixture of fabric or skin or-.</p>\n<p>And he broke line of sight behind a breaking billboard and failed to emerge from the other side.</p>\n<p>Aizawa refused to break composure. He settled on a lamppost, crouched at the ready with his capture scarf prepared to whip. “Tokoyami.”</p>\n<p>Beyond the billboard crawled a creature unknown to man. The 6-legged spider walked with crushing care, to the monster Aizawa was the meat it was meeting. A simple matter of matter to be consumed just as fear and horror consumed him.</p>\n<p>It spoke to him in a chattering animal noise, a mimicry of his voice: <em>Tok-Oh-Ya-Meh?</em></p>\n<p>Aizawa whispered, “good God.”</p>\n<p>Tokoyami crawled towards him, a twitching black rippling thing twice the size of the usual boy.</p>\n<p><em>‘No, that isn’t him,’ </em>Aizawa concluded. <em>‘It has to be Shinsou’s doing.’</em></p>\n<p>A single firm hit was all required to remove the control, but with Dark Shadow’s cloaking, he’d have to be frighteningly close to make contact. In Tokoyami’s confusion, there would be enough of an opening to subdue him from the fight.</p>\n<p>Tokoyami made a horrible rattling noise, reptilian or…like something long extinct. One long hooked claw made of shadows extended, gripping and shredding metal as it descended down the front of the billboard. Aizawa steadied himself on his lamppost. If Tokoyami’s higher thinking had been suppressed (how had Shinsou <em>done that?</em>) then the boy would attack him in a clear obvious way. He had to activate Erasure timed, counter the child into the ground, and subdue him.</p>\n<p>“Easy…” Aizawa murmured quietly. He wasn’t called often to instances like this, where body modification quirks went wild. Let alone his student.</p>\n<p>(Something about this…bothered him, to his core.)</p>\n<p>Tokoyami (Dark Shadow?) opened its long hooked maw and <em>screamed.</em></p>\n<p>It jumped at him, long claws outstretched. Aizawa activated his eyes, lifted his arm into a firm counter and hurled Tokoyami into the ground.</p>\n<p>The boy scrambled at him, claws (hadn’t he removed his quirk?) tore against his shirt and scraped against his reinforced body armor. He counted four limbs, kicking and clawing against his throat and shirt and neck.</p>\n<p>Tokoyami was thrown to the ground, already scampering away behind a broken wall. Aizawa steadied himself for the counter attack-…</p>\n<p>…and it didn’t come.</p>\n<p><em>“The tracker was successful,” </em>Tokoyami reported in, sounding faint of breath and exhausted. Bakugou and Shinsou instantly looked at their watches, scouring the rough map until the glowing location of Aizawa appeared. One of the ten trackers had landed, hidden under each of Tokoyami’s claws (nail extensions applied like fake nails. Bakugou wheezed over the stupidity of it) and on the tip of each shoe. If this plan had failed, they would be well and truly screwed.</p>\n<p><em>“Glad to hear it, brave bird,” </em>Shinsou drawled although his genuine emotion was obvious. <em>“Take a breather but keep moving. I’ll keep you notified if he starts chasing.”</em></p>\n<p><em>“Thank you,” </em>Tokoyami said through heavy breathing. <em>“Where is the explosive storage compared to my location?”</em></p>\n<p><em>“One block north of you, you useless pigeon,” </em>Bakugou sounded like a GPS.</p>\n<p><em>“Ah,” </em>Tokoyami paused. <em>“Thank you, Bakugou.”</em></p>\n<p><em>“Go lay an egg,” </em>said Bakugou flatly.</p>\n<p>Aizawa didn’t move until a few minutes had passed. He spent a short while securing a perimeter, clearly unaware of the tracker that had been lodged somewhere in his reinforced body armor. With any luck, they would keep the element of surprise a while longer.</p>\n<p>\n<em>“Alright, he’s on the move. Heading east, towards the overlook for a vantage point. We’re staying low but keep going, when you get to the fuses let us know.”</em>\n</p>\n<p>\n<em>“Understood. I’m moving as quickly as I can.”</em>\n</p>\n<p><em>“Over and out,” </em>Shinsou said. He slumped down, laying as flat and silent as he could next to the equally silent Bakugou. They stared straight up, waving halfheartedly at the cameras watching their movements.</p>\n<p>Keeping an eye of Aizawa’s movements (uncomfortably close to their position) they watched Tokoyami get into the proper position. The pinch point would be directly between the two locations, hopefully where enough of the upper balconies could provide cover.</p>\n<p>They only had one shot at the plan, after all.</p>\n<p>\n<em>“I’m in position.”</em>\n</p>\n<p><em>“Good,” </em>Bakugou said plainly. <em>“Broadcast it, chickidork.”</em></p>\n<p>Over the communications, they could hear Tokoyami breathing before it cut off to silence. The microphones were muted, his speakers swapped for the alternative- Shinsou’s hero costume heavy speakers stashed with all the stored grenades. That, and the loud recording of Bakugou destroying a watermelon.</p>\n<p>Tokoyami couldn’t respond, but they could all hear the distant high pitched outrage of Bakugou’s pre-recorded screaming.</p>\n<p>\n<em>“Eh?? Get back here you fucking-.”</em>\n</p>\n<p>A grenade detonated once, and then the rest began in a series of loud violent explosions. The recorded speakers performed well, distorting slightly under the crash of nitroglycerine.</p>\n<p>Bakugou nudged him sharply, jamming a pointy elbow into Shinsou’s stomach. He nodded blank-faced at his wrist, where Aizawa’s signal was moving…fast. <em>Very </em>fast.</p>\n<p><em>‘It’s easy to forget he’s a pro,’ </em>Shinsou thought, wincing at the slow rate of Tokoyami’s escape as he manually connected his speakers back. Every second was valuable now.</p>\n<p>Aizawa was practically on top of Tokoyami when the speakers and mic came back online- it was pure luck that Shinsou could shout <em>“Stop moving!” </em>and the other boy heard.</p>\n<p>For a few horrifying seconds, Aizawa was <em>right on top </em>of Tokoyami, and then…he slowly moved on.</p>\n<p>Bakugou noticed the problem as well. <em>“Don’t move, featherfuck. We need to come to you and change the pinch point. Do not move.”</em></p>\n<p>Tokoyami didn’t respond. Shinsou scrambled to his feet, thankful for the heavy boots, and began to sprint.</p>\n<p>Bakugou’s lack of shouting was more uncomfortable than anything. They breathed in sync, keeping an eye on Aizawa and making sure they would be well out of eyesight. Once the man moved a bit further, more between them than on top of Tokoyami.</p>\n<p><em>“Let’s do this guys,” </em>Shinsou breathed as a confidence boost. <em>“Let’s get this bread.”</em></p>\n<p><em>“I can’t have bread,” </em>Tokoyami said in a strained whisper.</p>\n<p><em>“You two are fucking idiots,” </em>Bakugou said nearly pleasant.</p>\n<p>They all drew silent, they arrived at the plaza.</p>\n<p>The pinch point had been determined long in advance. A tiny open clearing with plenty of high walls on three sides. A few open balconies and railings in fake apartments. Of course, utilizing heights and vantage points was dangerous since Eraserhead was skilled with his capture weapon, but Tokoyami had practiced scaling vertical surfaces and Bakugou could fly. Shinsou was dangerous enough on the ground and…well, he still had his secret weapon.</p>\n<p>\n<em>“Tokoyami, I’m still linked with Blasty. If worst comes worst, are you alright for a shift?”</em>\n</p>\n<p>\n<em>“You have my consent.”</em>\n</p>\n<p><em>“You won’t need it,” </em>Bakugou said. <em>“I’ll fucking kill you all.”</em></p>\n<p>\n<em>“Have I mentioned I really hate this goddamn thing? Bakugou is freaking me the fuck out.”</em>\n</p>\n<p>\n<em>“Agreed. It will be effective against the enemy.”</em>\n</p>\n<p>Bakugou scoffed but it sounded like a breathy sigh. Shinsou hated this.</p>\n<p>They were in position, Shinsou sticking low to the ground under a shaded alcove as Bakugou scaled upwards to a middle platform as quickly as he could. Tokoyami was approaching from the opposite direction, Aizawa roughly only three buildings away from them. Closer than they wanted, but far enough for the plan.</p>\n<p>\n<em>“Alright, Bakugou, you ready to scream?”</em>\n</p>\n<p><em>“Fuck you,” </em>Bakugou said, which was a yes. Shinsou closed his eyes, dug his nails the slightest bit tighter, and felt his body move without physical reach. <em>Lift up. Lower the mask. Turn off the microphone.</em></p>\n<p>\n<em>Scream.</em>\n</p>\n<p>Bakugou’s yell was a horrific bloodcurdling noise, raspy and wailing that cut off the moment Shinsou <em>demanded it. </em>Then, he withdrew as quickly as he could and left Bakugou with full control beyond that of facial expression.</p>\n<p>\n<em>“My fucking voice, you shit-stained purple-.”</em>\n</p>\n<p><em>Stop. </em>Shinsou smiled as Bakugou’s voice cut off sharply. <em>“Oh dear, my bad. Won’t happen again.”</em></p>\n<p>\n<em>“Please remember the mission at hand. Eraserhead is within eyesight.”</em>\n</p>\n<p>\n<em>“Shit, thanks for the heads up. You’re going first then?”</em>\n</p>\n<p>\n<em>“Yes, Dark Shadow and I will perform more…uncoordinated.”</em>\n</p>\n<p><em>“Sorry in advance for the bruises,” </em>Shinsou said.</p>\n<p>Tokoyami emerged on the ground with disproportionate limbs and a shuddery style of walking. It had been a lesson in patience, trying to work with Dark Shadow to cloak itself in such a way to construct a shell. Tokoyami made a noise, loud and uninterrupted. At once, Eraserhead lifted his head in confusion, his need to ascertain what the <em>hell </em>had made it.</p>\n<p>Eraserhead knew it was Tokoyami- the creature, but something compelled him to make sure. He didn’t want to, but an unspoken sense of resignation forced his neck to turn.</p>\n<p>He saw the thing, heard its scraping claws and snapping beak, listened to the octave of its new whining. He saw it crawling and breaking concrete with its foremost legs. As it reared up and shrieked its many cries, its legged snapped outwards no more than a hands width.</p>\n<p>Aizawa leaped to the ground, handling his capture weapon like a lasso and Tokoyami the anguished beast uncomfortable in its shape.</p>\n<p>One hand raised, the other dropped low. Erasure burned bright like fire and Dark Shadow screamed as it melted away, Tokoyami rattling with his hooked beak and blank expression. Aizawa grimaced with what had to be done.</p>\n<p><em>“You’re doing good,” </em>Shinsou soothed, trying to inspire some sort of confidence in his teammate. <em>“Really great job. Rotate another 90 degrees, get his back to face the pink building, then we can move to the next stage. You’re doing fantastic.”</em></p>\n<p>Bakugou spoke low and flat and dull. <em>“Show your fucking teeth, you goddamn feathered velociraptor.”</em></p>\n<p>Tokoyami surged lower, tilting his head like a parrot, rattling deep and inhuman and <em>oh </em>the noises his beak could make. Inhuman and disjointed they sang like funeral bells.</p>\n<p>Aizawa grimaced, holding one hand low and outstretched. They turned, pacing slowly, herding the man into position. “Tokoyami…”</p>\n<p>\n<em>“Bakugou, go on and freak him the fuck out!” </em>\n</p>\n<p>Bakugou couldn’t smile, but he gave the impression of it with his sharp stiffened movements. He jumped off his balcony with a stumbling chaotic slouch, falling more than flying. The uncontrollable tightening of his muscles- it had taken a long while to achieve such a thing.</p>\n<p>“Bakugou-,” Aizawa paused, evaluating the situation quickly. He shifted into a battle stance, prepared to fight front and back where Tokoyami’s stuttering crawl grew back its legs and shell and Bakugou stood like a twisted marionette. Serrated teeth sewn into a smile, his face had no recognition or familiarity.</p>\n<p>“Bakugou, Tokoyami…” Aizawa said slowly, looking quickly between the two. His confusion was obvious, as was his slight stress.</p>\n<p><em>“Hah,” </em>Shinsou scoffed. <em>“Bastard doesn’t know what I can do. Bakugou, I’m going to twitch your limbs a bit, I’ll release if there’s anything fast.”</em></p>\n<p>Bakugou took one step on his free will, a careful acknowledgment that Shinsou utilized at once. From there, every movement consisted of contorted rotations, a possibility and lingering doubt that the joint would stay together. Bakugou moved with his head fixed on a sideways tilt, fingers wriggling like snakes under his skin.</p>\n<p>“God,” Aizawa muttered, activating Erasure on Bakugou. It did absolutely nothing.</p>\n<p>\n<em>“Hah, okay guys, I think it’s time to ramp up the party. Go for it.”</em>\n</p>\n<p>Tokoyami skittered back with a hiss as Bakugou stepped forward with all the terrifying demeanor of a horror film. His hands curved as if in pain, and he let sparks detonate.</p>\n<p>Aizawa’s face turned grim. “So you figured out how to use his quirk…”</p>\n<p>Bakugou clumsily attacked, overswinging and twitching away. It was demeaning, <em>embarrassing. </em>Shinsou knew the boy would only put up with so much before it was <em>his </em>turn to make a fool of himself.</p>\n<p>Bakugou took a strong hit to his stomach, his mask slipping down and revealing the emotionless blank face. Aizawa’s face shifted slightly, taken aback. Shinsou’s control was consensual, it wouldn’t slip under attack.</p>\n<p>\n<em>“Alright, I’m coming in now. Bakugou, drop!”</em>\n</p>\n<p>Bakugou would give him shit beyond the end of the world. Until then, Bakugou slumped with open eyes and went entirely limp. Aizawa staggered, overwhelmed and freaked.</p>\n<p>“Sensei!” Shinsou crooned with no voice modifier. It cracked like a goddamn prepubescent boy- Shinsou could <em>feel </em>Bakugou trying to laugh, <em>fuck him- </em>“Sensei…”</p>\n<p>Aizawa spun around, evaluated the situation where Shinsou swaggered about as if drunk (or incredibly exhausted), mumbling illegible things under his breath (his most recent grocery purchases, not like the man could hear him). He dragged his feet across the ground, the steel toe making a horrible scraping sound as if dragged. Shinsou crooned like Bakugou and Tokoyami made him practice off the internet videos of the creepy blood-drinking villain. “Sen-<em>sei.”</em></p>\n<p>“I don’t…” Aizawa trailed off, looking very alarmed, Tokoyami clicked his beak for emphasis.</p>\n<p>Shinsou took three steps forward, then swung his arm. Aizawa instantly countered, then hissed in pain as the metallic edges caught and tore clean through the man’s uniform and bit into his skin like barbed wire. Shinsou babbled going on and on about the most <em>ridiculous things </em>(“The sky is so loud all the drones- duh ronessss...wave hi sensei say hello say hello sen-<em>sei…</em>”).</p>\n<p>Another wide swing of his arm, better deflected, so this time Shinsou rammed his knee into Aizawa’s thigh and rammed his elbow into the man’s ribs hard enough to break.</p>\n<p>Things escalated, faster than they anticipated. Aizawa had never gone full out before, and it was clear he wasn’t now. The three of them, even with all their planning, had no chance against a pro. They were forced to rely on a few factors and skills, things they had carefully cultivated over the entire match.</p>\n<p>First, it seemed as if Tokoyami was, for better reason, inhibited of complex thought. Originally it seemed like Shinsou’s quirk had evolved further, now allowing others to operate while under his control.</p>\n<p>Second, it seemed as if Bakugou was fighting <em>against </em>Tokoyami, therefore, they were all fighting each other.</p>\n<p>Third, Shinsou was acting odd which implied when he controlled another, his <em>own </em>cognitive abilities declined.</p>\n<p>Fourth, Bakugou was motionless suggesting only one person could be controlled at a time.</p>\n<p>The wonderful part was that none of these factors were true.</p>\n<p>(<em>“Let’s give him fucking hell.”</em>)</p>\n<p>It all came down to a very simple thing that had taken months and months to learn and practice, something beyond any of their imagination until it <em>worked.</em></p>\n<p>Bakugou attacked forward, and due to his previous inactive state Shinsou let himself flop to the ground. He was dismissed, <em>ignored </em>due to a set of rules they falsified.</p>\n<p>Bakugou leaped forward with an explosion charging, Aizawa very cleanly avoided the strike and let it pass by his side.</p>\n<p>Tokoyami intercepted the two, Dark Shadow flashing in the small gap between Bakugou and Aizawa in a single well-choreographed movement.</p>\n<p>Aizawa’s eyesight now completely blocked, and Bakugou facing the entirely wrong way to provide an attack-</p>\n<p>Shinsou focused, <em>shift your arm, </em>Bakugou’s arm shifted, <em>rotate the wrist, </em>rotate the wrist, <em>aim at something I can see, </em>aim at something Shinsou can see.</p>\n<p>Remote control, not <em>controlling </em>Bakugou, but <em>working with him.</em></p>\n<p>Bakugou’s face contorted into a snarl, a violent wild expression of wordless delight. Shinsou felt sweat on his brow, the ringing migraine in his ears-.</p>\n<p>Eraserhead couldn’t deflect an impossible blow, after all.</p>\n<p>\n<em>Bang.</em>\n</p>\n<p>Aizawa assigned Tokoyami, Bakugou, and Shinsou to play as the villains in the end year exam against the rest of the class.<br>Aizawa accounted for Bakugou's rage, Shinsou's asshole tendencies, and Tokoyami's self-esteem.<br>Aizawa did <em>not</em> account for the pure, unholy wrath, of three very petty teenagers who like to make a point.</p>\n<p>(and who end up winning in the process.)</p>"
}