{
  "id": "16616795",
  "url": "https://archiveofourown.org/works/16616795?view_full_work=true",
  "author": [
    "blueh"
  ],
  "title": "once forgotten, twice removed",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
  ],
  "relationships": [
    "No Romantic Relationship(s)",
    "Class 1-A & Midoriya Izuku",
    "Midoriya Izuku & Todoroki Shouto",
    "Midoriya Izuku & Uraraka Ochako",
    "Midoriya Izuku & Yagi Toshinori | All Might",
    "Toogata Mirio & Shigaraki Tomura | Shimura Tenko",
    "Midoriya Izuku & Shigaraki Tomura | Shimura Tenko",
    "Midoriya Izuku & Sensei | All For One",
    "Midoriya Izuku & Toogata Mirio"
  ],
  "characters": [
    "Midoriya Izuku",
    "Todoroki Shouto",
    "Shigaraki Tomura | Shimura Tenko",
    "Toogata Mirio",
    "Tsukauchi Naomasa",
    "Yagi Toshinori | All Might",
    "Class 1-A (My Hero Academia)",
    "Aizawa Shouta | Eraserhead",
    "Uraraka Ochako",
    "Bakugou Katsuki",
    "Gran Torino (My Hero Academia)",
    "Iida Tenya"
  ],
  "additional_tags": [
    "Midoriya Izuku Has One for All Quirk",
    "Toogata Mirio Has One for All Quirk",
    "Class 1-A as Family (My Hero Academia)",
    "Villain Midoriya Izuku",
    "Pro Hero Midoriya Izuku",
    "Pro Hero Todoroki Shouto",
    "Pro Hero Uraraka Ochako",
    "Pro Hero Bakugou Katuski",
    "Dimension Travel",
    "AKA That Story Where Hero Izuku Meets Villain Izuku",
    "Alternate Universe - Mineta Minoru Doesn't Exist"
  ],
  "language": "English",
  "series": "",
  "published": "2018-11-14",
  "completed": "2018-12-16",
  "words": "42,301",
  "chapters": "6/6",
  "comments": "710",
  "kudos": "21,076",
  "bookmarks": "6,061",
  "hits": "267,985",
  "summary": "<p>“Yes,” All for One agreed. “This will be the final resting place of All Might.” </p>\n<p>“You,” Midoriya Izuku said and paused, thinking over the words. He sounded taken aback. “<i>You</i> want <i>me</i> to help fight All Might.”</p>\n<p> “Of course,” All for One nodded along. “I can offer you double of whatever my counterpart is paying you currently, along with anything your little heart could desire. Of course, you would get to help out drastically—\"</p>\n<p>“Did you happen to <i>check</i> what world you were pulling me out of when you did this?” Midoriya Izuku interrupted and it was said in such an incredulous tone that had the situation not been as critical as it was, All Might would have laughed. </p>\n<p>Also known as: number one hero Deku has been through a lot of things, but being thrust into an alternate reality where he’s All for One’s Successor is a first. He has to navigate this world when his alternate self is a villain who's dead-set on killing him and this version of class 1-A. All the while, his friends search desperately for a way to get him back.</p>\n<p>“Whatever we’re doing, we need to do it soon,” Kirishima said, drumming his fingers on the doorframe. “Everyone’s worried, man. Villains are taking advantage of his leave. We’re all working overtime just to keep the peace and it just… It just feels kinda empty without him.”</p>\n<p>Ochako put a hand on Kirishima’s shoulder. “I know. We have to be strong, though. Deku is counting on us. We’ll find him.”</p>\n<p>“I promise you,” Tenya said with as much conviction as the situation offered. “I <i>promise you</i> we’ll find him.”</p>\n<p>He wondered how they were going to react to Midoriya, but Midoriya was nowhere to be seen—Aizawa-sensei pulled him away two hours ago and he had yet to return.</p>\n<p>“Alright, this is gonna be SICK,” Kaminari said suddenly, throwing his bag over his shoulder. He threw open the dorm door and walked inside. Not two seconds later, the door opened again and Kaminari promptly rushed back out and down the steps, looking rather terrified. “Midorishi Izuku is in our dorm.”</p>\n<p>Ah, so that was where he went.</p>\n<p>“Todoroki! Wait up!” Izuku called. </p>\n<p>Todoroki stopped to glare at him. “What?” </p>\n<p>Izuku couldn’t help but compare this Todoroki to his Shouto. The mannerisms, the anger, the fear. All of it was so familiar, yet so different.</p>\n<p> Izuku offered a small, sad smile. “You are not your father. Your fire is not your father’s quirk. Who you are and what you do with your own quirk is up to you. That’s all I wanted to say.”</p>\n<p>“I’ve been getting at a lot lately. I like you better than my version too,” Izuku doesn’t bother to hide his smile. He can’t help but add on, “Though, you’re missing a couple of hands.”</p>\n<p>Tenko looked down at his two perfectly good hands. “I’m…what?”</p>\n<p>Izuku patted his shoulder and started walking off. “Don’t worry about it. It’s better this way.”</p>\n<p>“W-wait! What do you mean I’m missing a couple of hands?!”</p>",
  "notes": "<p>want to start out by saying this is a COMPLETE story, meaning I have it ALL written out. its 40K words and six chapters long. this story will NOT be abandoned (unless something were to delete my entire document) and will receive regular updates</p>\n<p>no relationships bc y write about kissing when u can write about punching things </p>\n<p>originally villain &amp; hero deku's name were the same but when u try to write a scene with characters of the same name it gets............Hard. it was too confusing to follow so i changed it. villain midoriya is called \"midorishi\" which just means green death</p>\n<p>anyways! welcome hope u like it. i really love the idea of somewhat canon izuku meeting fandom versions and this version just happened to be villain!deku</p>\n<p>as always <a href=\"https://blu-eh.tumblr.com\" rel=\"nofollow\">my tumblr</a>!</p>\n<p><a href=\"https://ficbook.net/readfic/8429633\" rel=\"nofollow\">Russian Translation!</a> </p>\n<p> <a href=\"https://www.instagram.com/p/B0YuL_OHkJD/\" rel=\"nofollow\">KICKS DOWN DOOR THIS FIC NOW HAS ! AMAZING ART! </a></p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>AMAZING ART of this fic by onegrumpyboi on instagram. check it out! https://www.instagram.com/p/B0YuL_OHkJD/</p>\n<p>follow my bnha blog for more bnha content:dekuish.tumblr.com</p>\n<p>(for those who don’t know: naomasa’s quirk, according to the wiki, is lie detection. pretty handy for a detective) </p>\n<p>sometimes ao3 deletes the space in between an italicized word and a normal word when copy &amp; pasting from a word document so i TRIED to go through &amp; fix it but i may or may not have caught everything. tenko says fuck a LOT so warning for that</p>\n<p>this is my least favorite chapter but isdhdgldsfkjgj whatever</p>\n<p>this was supposed to come out LAST TUESDAY but i had exams and then i drove 17 hours with two dogs to north carolina and i just never had time to upload it. in return i went and wrote the aizawa scene like 2 hours ago </p>\n<p>some of u caught it but YES the july attacks attacks is a reference to aloneintherain's set it all in bloom series which u can read here: https://archiveofourown.org/series/930909 (highly suggest u do its an amazing series). </p>\n<p>SPEAKING of july attacks.......</p>\n<p>aaaalllmost done. i keep forgetting to update this thing lmfao</p>\n<p>this is the shortest chapter!! only 3.5k words</p>\n<p>i have finals soon. i crave death</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">notes</a>.)\n</p>\n<p>THANK YOU ALL for sticking around! this story is officially done. hope u all liked it :^)</p>\n<p>as always <a href=\"https://blu-eh.tumblr.com\" rel=\"nofollow\">my tumblr</a>!</p>",
  "text": "<p>The battle raged around them.</p>\n<p>All Might was no stranger to death and even less of a stranger to villains, but watching as the fire curled and spread around Kamino was a devastating blow. The screams of those that were trapped in the rubble echoed around the once bright and cheerful city. Now, homes were reduced to ash and the buildings collapsing as heroes worked desperately against the clock. Bakugo had been rescued and his students ushered to safety, but at a price.</p>\n<p>Gran Torino stood by his side, watching the carnage with sad eyes. This battle had caused too much harm for too many people. Their resources were running out. They didn’t have much time left. If it continued to way that it currently was then—</p>\n<p>The wound that had decimated his body five years ago ached. He thought he was going to die then, too, but that was before he had passed on his quirk.</p>\n<p>That was before he lost the majority of his power.</p>\n<p>In the center of all the chaos All Might could only make out two figures. Against the ash and the smoke and the fire, they stood bright. They chattered, as if the city wasn’t burning, as if people weren’t dying. That without a face and that with a terrifying smile.</p>\n<p>All Might had a history with All for One. Midorishi Izuku, however, was a new player.</p>\n<p>He had first appeared at USJ to attack Aizawa’s students. He’d left his mark when he tore the building down with enormous destructive power. His ability to carry out a plan was horrifyingly fantastic. There had been injuries, but no one died that day.</p>\n<p>It was a very near thing.</p>\n<p>They didn’t know much about him. They knew he had a destructive quirk—or quirks, if his close relationship to All for One was anything to go by. He had green hair, he liked to carry around as many weapons as he could fit on his person. They knew that he was charismatic and well liked  within villain groups. They knew he was smart, they knew he was fast and they knew he was young. No older than All Might’s first year students in UA.</p>\n<p>Much too young to have that sort of smile. To have those sorts of eyes.</p>\n<p>All Might may have saved Shimura Tenko, but even he knew it was too late to save Midorishi Izuku. All for One corrupted everything he touched. That boy was no exception.</p>\n<p>All for One stepped forward. Midorishi stuck out his hand and said, “Let me, Sensei.”</p>\n<p>All for One gestured for Midorishi to walk forward. He does so with no hesitation, teeth bared in what resembled a grin. His loose fitting clothing covered in flecks of dirt and blood. His eyes glowed green in the evening light. He might have been two heads shorter than All for One, but his presence was still the same. These were people who thrived on the death and destruction of the innocent.</p>\n<p> “It would be easier for all of us if you just <em>die</em>, All Might,” Midorishi said. His tone was light and joking but his words were anything but.</p>\n<p>“If I die,” All Might said and paused. His body might be weak, but he was not done yet. Not while there are still people behind him and innocents to be saved. “If I die, then this city does as well.”</p>\n<p>“Yeah, that’s kind of the point,” Midorishi said. There’s a playful frown—almost a pout on his lips.</p>\n<p>“<em>THEN I WILL NOT LET THAT HAPPEN</em>!” All Might roared and he lunged forward. They clash with such force that it sent a shockwave through Kamino. People screamed and cried and begged as they and their homes were blown away by the sheer force of their power.</p>\n<p>All Might could only think of <em>pain</em>.  </p>\n<p>It attacked his body with devastating force. Creeping up his arm and spreading throughout his limbs. Everything <em>hurt</em>. He couldn’t breathe. For a moment, just a moment, All Might thought that this truly might be his last battle. He closed his eyes as he listened to Midorishi laugh and tried to think of better times.</p>\n<p>Helping thousands of people from the rubble, alive and well. Becoming the Symbol of Peace. Rescuing Tenko and watching as he bloomed into the young hero he was meant to be. Finding Mirio and passing on One for All after Nighteye recommended him. His students at UA, waiting for him to come back. His master’s smile. It was like a mantra in his head. Every person he had saved, every life he had changed, every opportunity they had to live. The peace that he had created.</p>\n<p>\n<em>“Your power, All Might? If it means that I can help more people, I would be honored. Please teach me!”</em>\n</p>\n<p>\n<em>“Uncle Toshinori? What was my grandma like?” </em>\n</p>\n<p>\n<em>“All Might-sensei! What are we learning today?!”</em>\n</p>\n<p>\n<em> “You saved him.” </em>\n</p>\n<p>\n<em>“You saved her.” </em>\n</p>\n<p><em>“You saved </em>me<em>.”</em></p>\n<p>All Might could not die.</p>\n<p>Somewhere out there was his successor. Somewhere out there, Mirio was waiting for him to return. Tenko was waiting for his return. His students were waiting for his return. Somewhere out there, he can hear the innocents calling for him. <em>You can do it! You can do it! </em>Even after they all saw his true form, they still believed in him.</p>\n<p>He may have loved his teacher, but he will not be like her.</p>\n<p>He funneled what was left of One for All into his fist and <em>pushed</em>. The familiar power bubbled inside of him, waiting for him to call it forward. His eyes snapped open and he threw his fist as hard as he could until he felt Midorishi’s own power give way. He surged forward and hit his target with a satisfying <em>crack!</em></p>\n<p>Midorishi was send halfway across the city, only landing a few feet from where All for One stood. Midoriya groaned, rolling to his side and promptly spitting out blood. He was no longer smiling, looking at All Might like one would look at a particularly annoying mosquito. All for One tutted but helped up his successor to his feet.</p>\n<p>“I hoped it wouldn’t come to this,” All for One said and sighed like it was such an inconvenience.</p>\n<p>“There are a lot of things that I had hoped for,” All Might replied in return, his voice a little wheezy.</p>\n<p>All Might tried to steady his breathing, clutching his shattered arm. He had very little One for All left. This battle had gone on for far too long. The only two people left were himself and Gran Torino, who stood faithfully in the rubble of the once great city.</p>\n<p> “I found a quirk, All Might.” All for One said and he placed a hand on Midorishi’s shoulder to steady him as the boy stumbled. “A quirk called <em>Universe</em>. It’s quite interesting really—a thousand universes, a billion worlds yet we seem to be connected to one in particular. A parallel dimension, you should say.”</p>\n<p>All Might glanced at Gran Torino, sharing the expression of growing horror. He did not like where this was going.</p>\n<p>“Imagine. Double the people, double the power.” All for One said and laughed. His hand sparked before lighting up in shades of gold and green. “Little Izuku has always been kind to a poor old soul like me. I’ve wanted to get him some help around here. Who better to help him out then himself?”</p>\n<p>All Might felt ice creep up his back. There was no way—that…that was impossible. He rushed forward, but it was already too late. He could only watch as the light in All for One’s hand glowed brighter and brighter until it was impossible to look at. Gran Torino tried to follow, but at that very moment, All for One simply raised his hands and let the power free.</p>\n<p>The explosion that rocked the area sent even a man like All Might stumbling back. He put his hands to cover his eyes as debris and dust were kicked up and blown around. Wind ripped at his baggy costume. He could hardly breathe, couldn’t see, and all he could hear was the ringing of his own ears.</p>\n<p>Except…that wasn’t quite right. There was something else there too—something faint. A voice in the wind. It was familiar in a way, but he couldn’t quite place it.</p>\n<p><em>Whatever you say All Might!</em> the voice said. It’s getting louder, All Might realized. It’s getting louder and it knew his name. <em>I’ll step up to this challenge! As long as you’re by my side, I can do anything. That’s how I feel, anyways.</em></p>\n<p><em>Symbol of peace? </em>A new voice said, whispering in his ear. All Might <em>knew</em> that voice. He listened to it every morning when Tenko greeted him. These, however, were not Tenko’s words.<em> Hah! In the end you’re just a tool for violence, made to keep us down. And violence only breeds more violence.</em></p>\n<p>The first voice came back, <em>A smiling, dependable, cool hero…That’s what I wanna be! That’s why I’m giving it everything. For everyone!</em></p>\n<p>His own voice reached his ears, whispering powerful words.<em> You’re next. </em></p>\n<p>The light and wind rushed back towards the center and exploded with a quick burst of light. The voices faded and All Might could only hear ringing the ringing in his ears as he coughed and rubbed his eyes. By the time the dust had settled, there was a large circle burned in the middle of the battlefield.</p>\n<p>Another Midorishi Izuku sat in the center of it all.</p>\n<p>All Might could only watch in horror as the newcomer staggered to his feet with a groan. This Midorishi did not look like the original—not only did he look older, but he was wearing a bright green track suit covering the entire length of his body. White gloves came up to his elbows and on his hips hung a red belt, each with a pouch on the side. Black support stockings came up to his knees. A silver mouthguard hung from his neck.</p>\n<p>If All Might didn’t know any better, he would have said it looked like a hero costume.</p>\n<p><em>This is your chance to take him out before he’s a threat</em>, a voice whispered in his ear. It made sense, to attack before the enemy can attack him. All Might stepped forward out of habit, but then stopped. Something in his gut told him to wait.</p>\n<p>This Midorishi Izuku blinked dust out of his eyes before turning to All Might. When he met this Midorishi Izuku’s eyes, he knew that something was off. Not necessarily <em>wrong</em>, but different. There was recognition in this one’s eyes, yet it not the kind that he was used to. There was no malice or contentment or anger. Just confusion.</p>\n<p>Eventually, the newcomer turned around, eyes taking in the scene around him. He stopped on Gran Torino for only a second before looking at all the buildings and the fire and the smoke. If anything, he almost seemed even more confused. When his eyes landed on All for One, he seemed to stop breathing. He didn’t notice his very own counterpart at All for One’s side.</p>\n<p> “All for One,” the new Midorishi Izuku breathed out. There was something about his tone and the way he said it. It wasn’t friendly. It almost sounded alarmed. Like he was seeing a long-dead ghost.</p>\n<p>If All for One still had a mouth, he would be grinning. “Welcome, Midorishi Izuku. I’m sure you have questions.”</p>\n<p>“My name is <em>Midoriya</em>,” the new Midorishi Izuku—no, Midoriya— said slowly, like he couldn’t quite believe he had to say that out loud. The alarm All Might previously saw on his face was gone, replaced by a steel gaze. His voice was tight. All Might, for the life of him, could not figure out why. “And I think that might be a bit up an understatement.”</p>\n<p>“I can explain, my child,” All Might did not miss the flinch from Midoriya Izuku when All for One spoke. “You’re from a parallel world. I brought you here with a quirk of mine, I’m sure you know. My precious Izuku here would like some help and I thought it was only fitting for a man like himself to help….himself.”</p>\n<p>“So now you’re here and you can help me kick All Might’s fucking ass,” Midorishi—the one that All Might had fought over and over and over—said in a crude sort of way.</p>\n<p>Midoriya glanced at his counterpart currently standing by All for One’s side as if noticing him for the first time. Midorishi bared his teeth in a grin while Midoriya edged backwards a little. All for One’s words did nothing to calm him as he glanced at the buildings all around (burning, still burning. All Might can only hope the heroes got all the civilians out in time). Midoriya caught All Might’s eyes, almost as if he were asking a silent question, before turning his attention back to All for One.</p>\n<p>He seemed more confused than All Might himself.</p>\n<p>“This is Kamino,” Midoriya said.</p>\n<p>“Yes,” All for One agreed. “This will be the final resting place of All Might.”</p>\n<p>“You,” Midoriya Izuku said and paused, thinking over the words. He sounded taken aback. “You want <em>me </em>to help fight All Might.”</p>\n<p> “Of course,” All for One nodded along. “I can offer you double of whatever my counterpart is paying you currently, along with anything your little heart could desire. Of course, you would get to help out drastically—\"</p>\n<p>“Did you happen to <em>check</em> what world you were pulling me out of when you did this?” Midoriya Izuku interrupted and it was said in such an incredulous tone that had the situation not been as critical as it was, All Might would have laughed.</p>\n<p>All for One waved him off. “Name your price after this, then. We’ll speak of it more.”</p>\n<p>Something nudged his side. All Might looked down to see Gran Torino, who gestured to the three locked in a conversation. Half of his mask was burned off and he was covered in cuts, but overall he still was able to fight. All Might was thankful for that, at least, because at the rate this was going All Might was going to have to be fighting <em>two</em> Midorishi or Midoriya (or <em>whatever they’re called—)</em> <em>and</em> All for One.</p>\n<p><em>Attack?</em> Gran Torino mouthed.  </p>\n<p>Yet, All Might did not.</p>\n<p>He didn’t know what was keeping him there, rooted to the spot. It might have been because his legs were so exhausted that if he took but a single step, he would collapse. Perhaps it was the fact that he could barely see straight, much less throw a punch in his current state. Perhaps, just perhaps, it was because something inside of him—One for All—seemed to be telling him to <em>wait just a little longer. Just wait. Just wait. Just wait—</em></p>\n<p>Heroes were starting to gather again. All Might could see them on the tops of the rubble, slowly coming forward. The jumped from rock to rock as carefully as they could. Police held their guns and barricades high as they slowly marched forward. All Might was able to spot Naomasa in the crowd, decked out in full protection gear.</p>\n<p>All for One noticed them too and turned to Midoriya Izuku. “It’s time.”</p>\n<p>Midoriya Izuku paused and then raised his head. There was a fire in there that All Might had never seen from Midorishi before. Power flared to life and Midoriya seemed to <em>glow</em> as streaks of green lighting littered his body. Fire leaked from his glowing eyes. The power that he put out was so strong that he cracked the very ground that he stood on.</p>\n<p>All Might<em> knew</em> that power.</p>\n<p>“I don’t know what I’m like in this world,” Midoriya met the gaze of his counterpart. “It seems like I’m pretty shitty, actually.”</p>\n<p>“My child—”</p>\n<p>“My name is Midoriya Izuku!” Midoriya shouted at the pair. His voice rang over the rubble of Kamino and all of the heroes paused to listen. All for One and Midorishi reeled back in surprise as the new Midoriya took a step forward. His expression burned in anger, the likes of which All Might had never seen. It wasn’t directed at him—no, it was directed only at the villains. “I am Deku, the successor of All Might and the current keeper of peace!”</p>\n<p>All Might sucked in a surprised breath of air. That was not the declaration he had expected, yet he knew as he looked at this man he could be nothing else. The power that was around him—One for All—his costume, his posture. From the moment he arrived here, All Might knew he had been different.</p>\n<p>Midoriya Izuku was a <em>hero</em>.</p>\n<p>Midorishi’s expression slowly changed into horror; the very horror that All Might had felt just minutes before. The type of horror that was felt when a costly mistake had been made. One that would not be so easily fixed. Midorishi glanced up at All for One who only sat there, stock still.</p>\n<p>All Might wished that he hadn’t destroyed All for One’s face because he would’ve <em>loved </em>to see the expression he was making right now.</p>\n<p>Midoriya—no, <em>Deku</em> raised his fist with a snarl. “All for One, you’ve been my enemy since the day I was born.”</p>\n<p>Deku let his punch fly.</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>The dust settled and the storm rolled back for now.</p>\n<p>The battle had been short. The moment that All for One recognized the power that Deku wielded, he warped Midorishi away despite the numerous protests sent his way. All for One stepped forward, seemingly ready to take on Deku himself. His hundreds of stolen quirks pumped through his veins and his arm inflated like a terrifying balloon.</p>\n<p>That was when All Might stepped to Deku’s aid.</p>\n<p>All for One was not a stupid man. He knew when he was overpowered and outclassed. With the hoard of heroes and police steadily getting closer, he knew he was running on borrowed time. Perhaps in another world, All for One could take on All Might himself, but having two users of One for All was too much, even for him.</p>\n<p>“This…not even I could foresee this outcome,” All for One rumbled. It almost sounded like a laugh. “To think that my own prodigy…”</p>\n<p>“I am not <em>anything</em> of yours,” Deku told him. </p>\n<p>All Might lunged at All for One, putting all his remaining power into the attack. He felt as the embers of One for All burst to live in a great explosion with the last shred of the fire he had tried to desperately to keep lit. He let his fist fly, feeling as the power flew down his arm all the way to the tips of his fingers.</p>\n<p>A great explosion rocked the city as his compressed air smashed into the rubble before him. There were shouts from behind him as the heroes worked to find their footing. Dust was kicked up into the air, covering the area in a thick smoke. It made it nearly impossible to see anything.</p>\n<p>All Might didn’t need to see in order to know that All for One was already long gone.  </p>\n<p><em>And,</em> All Might thought as he looks down at this hands. <em>One for All might be as well.</em></p>\n<p>The green light to his left side fades and All Might turned to look at his surprising ally. Deku looked up at him, meeting his gaze. There was worry and confusion in his oh so familiar eyes, yet, All Might had never seen anything as different. As All Might stared at this man, familiar yet unfamiliar, he couldn’t help but think of those whispered words.</p>\n<p>\n<em>You’re next.</em>\n</p>\n<p> </p>\n<p align=\"center\">\n<em> </em>\n</p>\n<p>Naomasa Tsukauchi had seen a lot of things in his successful career as a detective and a close friend of All Might’s, but this situation was beyond even him.</p>\n<p>He had seen the last of the battle. To most, the powerful blast was a simple strength enhancement quirk, but he knew better. He’d been friends with All Might a very, very long time and known <em>about</em> him for even longer. He’d seen that quirk before. He knew what it was.</p>\n<p>A strength enhancement quirk would have been easier.</p>\n<p>Police were already on the scene, guns pointed at the newcomer. The man—Midoriya—barley even blinked. He simply raised his hands in surrender.</p>\n<p>Yagi Toshinori was surrounded by people, in his true form, obviously uncomfortable. Now that one of his biggest secrets had been revealed…Naomasa felt for his friend. This wasn’t going to be easy for any of them. He walked forward just as the emergency services finished bandaging his arm. He paused almost ten feet away, waiting.</p>\n<p>“You’ll have to go to the hospital to get this treated, Mr. All Might,” the EMS personnel was saying.</p>\n<p>Yagi caught Naomasa’s gaze and stood up, despite the protests of EMS. He gave her a smile. “I will, just one second please.”</p>\n<p>It didn’t take All Might long to convince EMS to let him go (“No, I promise I won’t do anything.” and “I’m sure the detective just wants to talk—”). Naomasa watched him approach. Yagi gave him a tired smile that Naomasa didn’t hesitate to return. Thin lipped and not all there, but a smile nonetheless. His friend looked much other than he should have. </p>\n<p>“Yagi-san,” Naomasa sighed and looked around at the rubble that was once Kamino. He thought back to the last bit of the fight, of the green lightning. Of the sheer power that he saw displayed in the hands of someone that everyone thought was an enemy. “That was One for All, wasn’t it?”</p>\n<p>“Yes,” Yagi Toshinori breathed. “It was.”</p>\n<p>“This is a complicated situation indeed.”</p>\n<p>Yagi didn’t say anything in reply, opting to slowly sit down on the bits of debris that covered the ground. Naomasa helped him settle himself as they watched the heroes and police alike bustle around the field. Police sirens wailed and in the distance Naomasa heard the distinct sound of a helicopter’s blades heading closer.</p>\n<p>Yagi was staring at the wall of police in the middle. “He’s not our enemy.”</p>\n<p>“He hasn’t resisted yet,” Naomasa sighed and followed his gaze. Midoriya Izuku was being shoved into a police car, his entire body bound him an array of cuffs and binds. “It’s all just a precaution. We can’t rule out that this is one of All for One’s tricks.”</p>\n<p>“It’s not,” Yagi said. Naomasa already knew he was right.</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>Tenko had been through a lot of things in his life.</p>\n<p>It didn’t start out great, according to Gran. He didn’t remember much of his life <em>before</em>, so he supposed it didn’t really matter. All he knew is that his family was dead and All Might found him when he was four years old.</p>\n<p>He got a lot of pitying looks, but it was fine, really. You can’t mourn for someone you didn’t know.</p>\n<p>He’d had a lot of ups and downs. Being raised by Gran was always interesting. All Might would sometimes come visit on the weekends or crash during the week in between his hero shifts. He knew a lot of things he probably shouldn’t, but that was alright because Tenko was always good at keeping his mouth shut. It was an interesting way to be raised, for sure, and he had his fair share of teasing, but he wouldn’t have traded it for the world. Everything was going perfect.</p>\n<p>Until Mirio showed up.</p>\n<p>Tenko wanted to hate him, at first. He was twelve when Mirio first started intergrading himself into their life. All Might started spending more time with Mirio, a first-year at UA at the time, than he would spend with Tenko. Mirio talked fast, liked to eat ramen and would sometimes accidentally phase himself (and loose his clothes in the process) through the table. He liked to laugh, had funny hand gestures and made friends easily. He didn’t like bullies and was always there to lend a helping hand. Mirio declared Friday nights to be movie nights, cuddled up in their home and never really left.</p>\n<p>Mirio was a hard person to hate. Tenko knew why All Might passed One for All to him.</p>\n<p>Tenko thought that All Might couldn’t have possibly made a better choice.</p>\n<p>Secretly, Tenko thought it was good for All Might, too. The stress lines slowly disappeared from his face and he started eating more. He got out of the house besides during his hero sifts. In his true form, he would smile more often. He opened up to Gran when he had problems. When Tenko got accepted into U.A’s hero course, they celebrated. All Might started to bring Tenko things—a white cape, yellow gloves, a red and gold belt. For the longest time, Tenko never knew why.</p>\n<p>Then he learned about Nana Shimura. </p>\n<p>His grandmother, apparently. Tenko didn’t even know his own mother, much less his grandmother. Gran and All Might never seemed to want to talk about her. They only told him that he had her smile and that she was a great hero.</p>\n<p>Tenko, personally, thought All Might was better.</p>\n<p>Which was why he was worried when the livestream went out. Tenko was no stranger to All for One. He clearly remembered All Might’s battle just five years earlier. That had been scary, too.</p>\n<p>Huddled on the bench of the nearest police station, Tenko looked up at Mirio. “All Might… he’s going to be okay, isn’t he?”</p>\n<p>Mirio gave him as big of a smile as he could and a thumbs up. “Don’t worry about him, he’s strong!”</p>\n<p>“But still….” Tenko said as he looked at the blank computer screen. He’s tired and hungry but he needed something—anything—to know that All Might and Gran were okay. The officers bustled around the station, conveniently ignoring the two. Tenko could distantly hear Bakugo yelling in one of the locked rooms. Kirishima and Yaomomo were also somewhere around, but he couldn’t quite see them. “All for One is strong too. And the livestream—\"</p>\n<p>“Believe in him, Tenko,” Mirio interrupted then raised an eyebrow with an amused expression. Mirio had been through even more than Tenko had at this point, being a third year at UA and interning under Sir. “You’ve still got yourself to worry about! That stunt you pulled was really rash!”</p>\n<p>Tenko bit his lip and looked down. It was really, <em>really </em>stupid when they followed the tracker put on the Nomu. However…</p>\n<p>Bakugo—his classmate—had been kidnapped. Standing there and watching wasn’t an option. </p>\n<p>He was probably going to get in more trouble for that entire rescuing stunt but right now he couldn’t care about anything. His feet ached and his bones hurt. His favorite shirt had torn and he was fighting to keep himself awake. He doubted he could stand at this point.</p>\n<p>He never once regretted his actions.  </p>\n<p>“Kirishima asked for my help,” Tenko looked Mirio in the eye. “I couldn’t say no.”</p>\n<p>Mirio burst out laughing and slapped his back so hard he went tumbling. He got up, rubbing his back and sent Mirio a sour look. Mirio either didn’t notice or didn’t care. “You’ve got the heart of a hero! I’ve always liked that about you! It was still reckless!”</p>\n<p>“I’m sorry.”</p>\n<p>Mirio’s laughter calmed down. Tenko felt a weight on his shoulder and looked up to see Mirio looking at him with a small smile. “Just…ask me next time, okay?”</p>\n<p>Tenko stared at him, wide eyed. He couldn’t find his voice. Mirio was the best person in the world and nothing anyone said could ever change his mind. “Alright. Uh, thanks, Mirio.”</p>\n<p>“No problem,” Mirio’s expression smoothed out. “Go to sleep. I’ll wake you up if either of them call.”</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>“Heard you got your ass kicked by your counterpart,” was the first thing Midorishi heard when he walked into their new hideout (<em>stupid</em> heroes their <em>stupid</em> raid). He sent a venomous glare at Dabi who simply smirked and crossed his arms in return. “Wasn’t he supposed to be on our side?”</p>\n<p>“Shut <em>up</em>,” Midorishi snarled at him because he was sore and tired and he was <em>not</em> about to put up with Dabi’s bullshit. It was Dabi’s fault they lost that UA kid—Bakugo or whatever the fuck they called him.</p>\n<p>Toga Himiko bounded up to him, a bloody knife in one hand. “What’s he like? Huh? <em>Huh!?</em>”</p>\n<p>Midorishi bared his teeth in a snarl and pushed her out of his space. She was more annoying than a fly but good at her job. The personal space thing needed to be worked on, though. The rest of Vanguard Action Squad wandered around their new space, still reeling from their defeat.</p>\n<p>The bar that constituted as their new hideout was gross. The beams were cracking, there was mold on the left wall and all the barstools looked like they had been crushed with a Nomu. It was definitely worse than their last one but Kurogiri picked it out and Kurogiri had always been stingy about his bars. Midorishi didn’t understand it. Didn’t particularly care.</p>\n<p>“He’s fucking annoying,” Midorishi snapped, ignoring Kurogiri’s warning look. He didn’t need his stupid caretaker anyways. “A hero! A fucking hero! Of <em>all things</em>!”</p>\n<p>“Aww, I bet he’s cute,” Toga said like she didn’t have the fattest fucking target painted on her forehead. Midorishi glared daggers at her. “You should smile more, Midori.”</p>\n<p>Just as Midorishi was about to lunge at her (<em>I’ll show you a smile, you bitc</em>—), Sensei appeared.</p>\n<p>Midorishi skidded to a halt not two feet in front of him.</p>\n<p>He had known Sensei all his life. Sensei was the one to save him, to pick him up off the streets and call him <em>useful</em>.  Midorishi, who had been called useless all his life, felt like he could finally breathe again. Being quirkless wasn’t easy, even for a villain, but Sensei changed that. Through his kindness and his wisdom, he became bigger. Better. He tore down all those that abandoned him and burned those that tried to hurt him.</p>\n<p>Suddenly he was so much <em>more</em>.</p>\n<p>“<em>So</em>,” Dabi drawled because, really, it was <em>always</em> Dabi. He couldn’t ever seem to shut his mouth. “You’re the big, evil dude behind all of this.”</p>\n<p>Sensei doesn’t even glance in his direction. “Calm down, my child. This was not a loss.”</p>\n<p>Midorishi felt shame burn inside him. They were close, so close, but they messed up. <em>He</em> messed up. “He’s with the heroes.”</p>\n<p>“Yes,” Sensei agreed. “But as much as he is different, he is you.”</p>\n<p><em>He’s not,</em> Midorishi wanted to say, but didn’t.</p>\n<p>Instead he bit his lip, not understanding Sensei’s point. “And?”</p>\n<p>“How much chaos do you think that will bring?” Sensei playfully tipped his head to the side, sounding amused. If he still had a face, he would be smiling. “For a hero to come to a villains’ world… I doubt this will be easy for Midoriya Izuku either.”</p>\n<p>Naomasa was tired.</p>\n<p>With the destruction of Kamino, All Might’s retirement and Midoriya Izuku (if that even was his name) in custody, there was a lot on his plate. The civilians were already panicking. The loss of lives were staggering. The police force was spread thin, desperately trying to keep the masses calm. It’s only been a day since then, but Naomasa knew that the chaos was only going to get worse.</p>\n<p>He would have never thought a parallel world was possible. If you asked him a mere forty eight hours ago that they were connected to another world via quirk, he would have laughed, but quirks are strange things with even stranger powers. He watched the man so similar to the one that he had been hunting for months and found that there wasn’t much else he could believe. He saw what happened, he heard what was being said. Both All Might and Gran Torino agreed that this was not Midorishi Izuku.</p>\n<p>Naomasa could only stare at Midoriya Izuku through the double-screened glass of the interrogation room.</p>\n<p>He was different than Midorishi. His eyes were a brighter green, his hair a bit shorter. There was a distinct lack of scar that ran down the left side of his face, but it would have been impossible not to notice all the jagged scars that littered his arms. A particularly nasty one ran from his elbow to the tips of his fingers. He was calm, not once raising his voice. He smiled at the police despite their rough handling and, most importantly, didn’t make a single hostile move.</p>\n<p>If anything, Naomasa appreciated that.</p>\n<p>The police just finished fastening his arms and legs to the table. Four metals chains on each hand, three on each leg and a band wrapped around his chest to keep him tied to the chair. It would be impossible to move anything besides his head. For most people, the cuffs alone would be strong enough to keep him from moving or using his quirk.</p>\n<p>Unless his power was what he thought it was. Unless All Might was right.</p>\n<p>Hopefully those cuffs wouldn’t be needed.</p>\n<p>A knock sounded on the door. There was a crack as the door opened, echoing around the silent room. Naomasa didn’t even turn his head. One of the outside police officers peeked in and said “he’s ready for you,” as if he hadn’t been watching this entire time.</p>\n<p>Naomasa steeled his nerves, activated his quirk and walked through the door to the interrogation room.</p>\n<p>“Naomasa-san,” Midoriya Izuku said immediately upon him entering and offered a smile. Naomasa paused at the familiar way his name was said, momentarily taken aback. He pursed his lips. Midoriya seemed to take the hint, his face heating up. “S-sorry! That was inconsiderate. Would you prefer to be called Tsukauchi?”</p>\n<p><em>He’s not our enemy</em>, All Might had said. Naomasa couldn’t help but think back to when Midoriya had been striped on his belongings in which they found only his phone, certified support items in his belt and a <em>valid hero license</em>.</p>\n<p>“For now, yes.” Naomasa placed his case folder on the table and gracefully slid into his chair. Midoriya Izuku was watching his every move. It was strange, seeing this man. The man with the same face as a villain. “I’m sorry this took so long to set up. We’ll get down to business. I’m sure you’ve done this before.”</p>\n<p>“I’ve never on this side of the table,” Midoriya said and smiled nervously.</p>\n<p>Midoriya Izuku is…different. Not just physically.</p>\n<p>Naomasa opened his folder. “Name?”</p>\n<p>“Midoriya Izuku.”</p>\n<p>He didn’t detect a lie but even so… “Not Midorishi?”</p>\n<p>“No?” Midoriya said, coming out more as a question than as a statement. </p>\n<p>“Interesting. Age?”</p>\n<p>“Twenty-two.”</p>\n<p><em>Ah… here comes the fun part</em>, Naomasa thought. “Quirk?”</p>\n<p>Midoriya paused and relaxed in his seat. When Naomasa met his eyes, he could see <em>something </em>there. The tired understand of a man who knew too much. Who had seen too much. Midoriya gave him a thin smile. “Tsukauchi-san, you of all people know I can’t answer that.”</p>\n<p>It wasn’t a direct confession, not really, but even so Naomasa thought that it was probably better that way. There were very few people on this planet that knew about the history of One for All and even fewer who knew the name. It would not have been a smart move to say anything in a crowded police station where he was the number one subject of interest.</p>\n<p>Naomasa felt like laughing. He almost felt in over his head.</p>\n<p>“I plan for a lot of things ,” Naomasa told Midoriya and leaned back in his chair. Today was supposed to be easier than yesterday. “But this…”</p>\n<p>“To be fair, I didn’t quite plan for this either. I don’t really think it’s something you <em>can </em>plan for.” Midoriya was smiling again, but it was tired. “I have a question for you, if you don’t mind.”</p>\n<p>“That’s fine.” Normally he would say not but…this wasn’t a normal interrogation anyways.</p>\n<p>“Why am I here?”</p>\n<p>\n<em>That was the million dollar question, wasn’t it? </em>\n</p>\n<p>“Why or how?” Naomasa said instead.</p>\n<p>“Both, if you can.”</p>\n<p>Naomasa placed a hand on the folder. It was thin, much too thin to really be a case. Too little information, too many questions. He wished he had the answers to give Midoriya. Wished he had the answers to his own questions. “I was hoping <em>you </em>could tell <em>me </em>that.”</p>\n<p>“All for One…” Midoriya said and paused. He just sounded confused. “All for One wanted me to help fight All Might. He said he brought me over specifically. He implied that I was working under the All for One of my world.”</p>\n<p><em>Why was my counterpart right there next to him? </em>Midoriya seemed to be saying.</p>\n<p>If he truly was a hero in his world, this was probably confusing. To Naomasa, who had been on Midorishi’s case since the day he attacked USJ, things made a little more sense. All for One wouldn’t have known that the Midorishi of a parallel world was a hero. It was just a theory—a working theory. If he asked All Might, his friend would probably deny it. All for One was not one to make costly mistakes but Naomasa could think of no other reason to summon a <em>hero </em>to a <em>villain’s </em>world.</p>\n<p>“Well, you <em>are</em> a villain in this world,” Naomasa said, instead, because that’s about as much detail as he can give him at this point.</p>\n<p>Midoriya bit his lip, but didn’t seem all too surprised. It was like he was expecting it, having put those pieces together already. There was something in his eyes—something akin to regret and maybe even a bit of horror. A thousand questions asked and a thousand more unanswered.</p>\n<p>“H-how,” Midoriya’s voice cracked. “How many people have I hurt?”</p>\n<p>Oh. <em>Oh.</em></p>\n<p><em>He’s not our enemy</em>, All Might’s voice repeated in his mind like a mantra. He didn’t show it on his face. He’s not our enemy, <em>he’s not our enemy, not our enemy, not our enemy</em>—</p>\n<p>“You, specifically?” Naomasa said and tried to keep his voice even. “None that we know of. Your counterpart, however, has a body count about as high as you could imagine.”</p>\n<p>It probably wasn’t the best thing to say, but it was nothing but the truth. Naomasa had promised to always give the truth. Midorishi Izuku was a villain. A villain who had pillaged, destroyed and murdered thousands of lives.</p>\n<p>Midoriya fell silent and stared at the table.</p>\n<p>“Alright,” Naomasa said instead because he still had questions that needed answers if they were going to figure this case out. Midoriya seemed to have his eyes glued to the cuffs on his wrists. “Can you tell me what has happened in the twenty four hours leading up to the incident?”</p>\n<p>That snapped Midoriya out of it enough for him to stop and think about it. “It was supposed to be my day off. I was going to meet up with Todoroki Shouto for our weekly café run. I woke up, got ready. Ended up involved in a villain attack around noon anyways. I was late and Shouto came looking for me. I saw him on the street, about a hundred yards away from the café. I started walking over to him and suddenly I was in Kamino again, watching it be destroyed a second time.” </p>\n<p>No lie. The bit about knowing Endeavor’s kid was interesting, especially seeing how close they seem, however…</p>\n<p>“A second time,” Naomasa said. “As in, this has happened before?” </p>\n<p>“When I was fifteen. My first year of UA.” Midoriya slowly nodded. Naomasa filed the UA information away. He might end up having to make a call later. “We were at a summer camp. Villains attacked us. Shigaraki Tomura and the League took Kacchan.”</p>\n<p>“Kacchan?” Naomasa asked.</p>\n<p>“Bakugo Katsuki,” Midoriya answered. That was intriguing. It was impossible to forget the UA student who took the Sports Festival by storm not even a few months back. It was even harder to forget the boy who had, as of yesterday, been rescued after being kidnapped. It would've been impossible to not remember that name. That other one, however…</p>\n<p>“Shigaraki Tomura,” Naomasa paused to think it over. Shigaraki was something that, in all of his time as a detective, he’s never once heard. That’s not always a good thing. “I’ve never heard of him before.”</p>\n<p>“You probably wouldn’t. If All for One didn’t take him in, he’s probably long dead at this point.”</p>\n<p>“Interesting,” Naomasa said. He’ll have to look into that later. “Continue, please. I’m sorry for my interruption.”</p>\n<p>Midoriya continued to explain how he and a few of his classmates (using names that Naomasa recognized from UA’s Class 1-A) went to rescue Bakugo. They used a tracker that Yaoyorozu Momo had put on the back of a Nomu and disguised themselves. From there, they found a Nomu factory. That’s when the heroes attacked, All for One showed up, followed by Bakugo and the League of villains and, finally, All Might. Midoriya explained how they used their quirks to launch themselves over the battle field to rescue Kacchan so All Might could fight freely.</p>\n<p>“We weren’t there to fight,” Midoriya quickly said. “It wasn’t technically illegal because we didn’t use your quirks to—\"</p>\n<p>“You don’t have to defend yourself to me,” Naomasa said, amused. The same thing happened here, after all, just with a couple of different people.</p>\n<p>“R-right. Anyways, after Kamino and All Might’s subsequent retirement, we moved into the dorms.”</p>\n<p>“Would I be correct to assume that you were also attacked at USJ your first year?” Naomasa asked because if he was correct then, well, things were just slowly getting more and more complicated.</p>\n<p>“W—oh,” Midoriya looked confused still. “Yes, you would be correct to assume that.”</p>\n<p>Midoriya Izuku had yet to utter a single lie.</p>\n<p>Perhaps it would have been easier if he were lying the entire time.</p>\n<p>“It’s a parallel world,” Naomasa said. This was <em>much </em>more confusing that he originally thought. “Yet you seem to be ahead.”</p>\n<p>Midoriya sighed and slumped as much as he could in his restraints. “I was afraid you would say that.”</p>\n<p>“The parallel world or the issue about time?”</p>\n<p>“Both.”</p>\n<p>Midoriya continued to tell him his side of the story, obviously leaving out a few important details that Naomasa picked up on. For now, he let it slide. He didn’t want to secret of One for All the be heard here anyways. He had calls to make if he wanted a full story, without any unwanted ears listening in.  </p>\n<p>It took another hour of discussion for Naomasa to finally be satisfied enough the wrap up the interrogation (although it was much more similar to a discussion). He packed up his file, voice recorder and notes before heading to the door, thanking Midoriya in the process.</p>\n<p>“Naomasa-san,” Midoriya called right just as Naomasa put a hand on the doorknob. He stopped and turned to face Midoriya. Midoriya’s eyes burned with such fierce determination, the kind that Naomasa had only seen reflected in those of All Might. “I know I might be a villain in this world, but I am a hero in mine. I will do whatever it takes to help as many people as I can. If that means staying here until I defeat myself, then that is what I will do.”</p>\n<p>Naomasa had a lot to think about.</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p align=\"center\">\n<strong>All Might</strong>\n</p>\n<p>Yesterday, 5:56pm</p>\n<p>good luck with the raid!!!! sir has me on standby.</p>\n<p>Yesterday, 9:36pm</p>\n<p>all might, tenko was apparently involved!!!!! im going to pick him up from the police station.</p>\n<p>all might?</p>\n<p>Yesterday, 11:25pm</p>\n<p>all might, im watching the livestream. tenko is here with me. please be okay.</p>\n<p>Today, 8:23am</p>\n<p>all might please tell me you’re okay. tenko &amp; i are worried.</p>\n<p align=\"right\">Today 3:34 pm</p>\n<p align=\"right\">Mirio. Meet me at Yokohama Police Station. We have some things to talk about.</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>Midoriya Izuku was having a hell of a day.</p>\n<p>It was supposed to be his day off. Every Monday, he and Shouto have gone out to lunch together since the day they graduated. To anyone who asked, it was just two good friends catching up about their lives. To them, it was more of a small celebration each week for being alive. The fact that they were there. They were there and alive and still standing even after everything. A <em>congrats on not dying! </em>kind of deal.</p>\n<p>He’d already been running late—Shouto had texted him stating as such. He’d been hurrying down the streets, passing through the crowds with practice ease. He was only about a block away from the café when the convince store exploded right next to him. So, he was going to be even more late. Really, it wasn’t his fault—being a hero demanded that you were always on your toes, always ready to help even when it was supposed to be your day off—so when he saw the panicked civilians needing <em>someone</em>, he stepped in. He wrapped up that battle as fast as it had begun.</p>\n<p>Shouto, who must have heard the noise and had come running out, had just enough time to watch as Izuku tied the villains’ hands and walk over to him before, well, nothing. </p>\n<p>One moment he was in Musutafu about to get coffee and the next he was in Kamino with a long-dead ghost trying to get him to fight All Might.</p>\n<p><em>You attract trouble even when you’re doing nothing, </em>Tenya once said.</p>\n<p><em>I don’t, </em>Izuku had protested.</p>\n<p>He totally did. He owed an apology to Tenya after this mess sorted itself out.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>“All Might?” Naomasa  called from behind him. All Might startled, turning around. His old friend gave him a smile from where he had his head poked through one of the office doors. “A word, please.”</p>\n<p>All Might pursed his lips, but followed. He hasn’t heard much about the situation seeing as he was in the hospital for the last twenty-four hours (not that he was too injured—if the, ah, interruption hadn’t happened he’d be <em>much </em>worse off). By the time he’d been discharged to the time that he’d arrived at the police station, all he heard from Naomasa was the fact that Mirio might want to be here. That was it. Naomasa gave no information on All for One or Midorishi or Midoriya.</p>\n<p><em>Ah, well, that was probably going to change here soon,</em>All Might thought as he entered the small office area.</p>\n<p>The room was much more spacious than it appeared on the outside. There were cabinets lining the walls and a round, wooden table in the center of the room. Three people were already there; Aizawa, Nedzu and Midoriya (who was suspiciously lacking the cuffs that All Might had last seen him in). Midoriya offered a nervous smile, Nedzu waved and Aizawa did no more than glance at him before going back to his phone.</p>\n<p>It was a strange group of people, especially seeing how calm everyone seemed to be. In truth, a group like this should never have been able to coexist peacefully, yet here they all were in a crowded police station after one of the greatest tragedies on the last ten or so years.</p>\n<p>Midoriya, he could understand. After all, this entire situation revolved around him. However, it was truly unnerving to see Midoriya smile like that. All Might knew the sadistic grins and bitter smiles but never had he seen the boy with such a kind expression. He knew Midoriya and Midorishi were different, but seeing it for the first time <em>was </em>rather unsettling.</p>\n<p>Aizawa and Nedzu, however, were a mystery to All Might. UA and its teachers were not often involved in matters like this unless it directly involved one of their students. So seeing Class 1-A’s homeroom teacher and the principal crowded around the small, wooden table threw him for a loop.</p>\n<p>Naomasa saw his confusion. “They’re important, apparently.”</p>\n<p>“Important to <em>what</em>, exactly?”</p>\n<p>“Midoriya is from another world—a parallel world.” Naomasa explained. Nedzu watched him with rapt attention but didn’t appear to be surprised. The same could not be said for All Might, who startled, because even though All for One had said the same thing, that—that was…</p>\n<p>Naomasa shot him a look before he could interrupt. All Might shut his mouth and let his old friend continue. “In his time, he’s already faced All for One. We believe that he might have information that will be useful to us in the future.”</p>\n<p>It…made sense. More than anything else, really. This Midoriya wasn’t like his counterpart. He was older, calmer and not as, ah, <em>intense</em>. He didn’t share his counterpart’s ideals. He wasn’t a villain. He announced as such back on the battle field, only a day ago.</p>\n<p>\n<em>I am Deku, the successor of All Might and the current keeper of peace!</em>\n</p>\n<p>That reminded him…“Are you really the current Symbol of Peace?”</p>\n<p>Midoriya looked at him in the same way that Mirio or Tenko did. All Might was never quite sure what way that was. “I am.”</p>\n<p>Naomasa sat across from Midoriya and next to Aizawa. He guested at the empty seat next to him. All Might took the hint and sat down. Naomasa nodded towards Midoriya. “Why don’t we start from the beginning?”</p>\n<p>Midoriya slowly nodded, placing his hands on the table. He looked lost in thought. “When I was a kid, I wanted to be a hero. The type of hero that was kind and dependable. A—”</p>\n<p>“A smiling, dependable, cool hero,” All Might said under his breath. He knew those words, whispered in the heat of battle. He didn’t know how or why but <em>he knew those words</em>.</p>\n<p>He <em>also </em>didn’t really expect anyone to hear it but Midoiyra was looking at him with surprise. Aizawa glanced at him from the corner of his eye and shared a look with Nedzu. Naomasa was giving him that <em>look</em>; the look that said they were going to talk later. Ah, well, that was never good.</p>\n<p>“Pardon my interruption,” All Might said, instead, because the last thing he wanted to do was make it worse.</p>\n<p>Midoriya stared at him quietly for a little longer before turning back to Naomasa. He bit his lip, visibly hesitating, all the while glancing at Aizawa and Nedzu. \"I—\"</p>\n<p>“Everyone in this room knows about One for All,” Naomasa interrupted. “Or, in the case of Aizawa, was briefed about it before entering.”</p>\n<p>Midoriya breathed a sigh of relief. He looked at Nedzu who only smiled at him. “I didn’t know Nedzu knew about One for All.”</p>\n<p>“He’s known since the start,” Naomasa said.</p>\n<p> Midoriya smiled and rubbed the back of his head sheepishly. “I guess I should have figured that but Nedzu is sort of terrifying. And by <em>sort of</em>, I mean <em>very</em>. Uh, I’m sorry, that was rude! I didn’t mean—”</p>\n<p>“It’s quite alright,” Nedzu said happily. He’s  still smiling, like he always did, but there’s an edge to it. “I like think of that as a compliment.”</p>\n<p>The door slammed open and shut with equal force. No one in the room startled, but everyone turned to look. Mirio stood in the doorway, smile on his face. Seeing their looks, he waved enthusiastically to them all. Nedzu and Naomasa were the only two who waved back. Mirio rushed to the empty seat and sat down next to All Might. “<em>Heey</em>! I’m here! Sorry I’m late! Had to be briefed and all before I could come barding in here, I guess. <em>Whoooaa</em>, you really do look like Midorishi!”</p>\n<p>“Mirio-senpai?” Midoriya said. He seemed startled. Then, under his breath, he started to mutter, “Why would Mirio-senpai be here? He would be a third year at this time going off the ages that Nao—I mean, Tsukauchi-san gave me. He would be interning with Sir at this point. As far as I remember, Sir wasn’t involved in Kamino at all so why would he be here? Unless…but that wouldn’t make sense because he doesn’t know—<em>ohhhhhhhh</em>.”</p>\n<p>All Might watched on, stunned, as the boy seemed to work out his own problems through barley understandable mutterings. Nedzu tilted his head curiously while Aizawa just seemed bored. Mirio’s cheerful expression never visibly changed, but All Might could tell that he was tense. </p>\n<p>Naomasa just smiled. “Care to explain?”</p>\n<p>Midoriya blushed up to his roots. “Sir always wanted Mirio to be the ninth. I just pieced that together, is all.”</p>\n<p><em>I know that Mirio has One for All</em><em>in this world,</em>was what he tried to say.</p>\n<p>Naomasa came to the same conclusion. He offered another smile. “Since Mirio is here, why don’t we restart? This time, with One for All.”  </p>\n<p>“Alright. Uh, I already said I wanted to be a hero since I was little,” Midoriya said. “What I didn’t say was that I was born quirkless.”</p>\n<p>Oh, All Might knew where this was going.  </p>\n<p>“In a world where only twenty percent of the human population doesn’t have a quirk, it was hard. I took a lot of criticism but I never doubted myself. I just had to work harder than anyone else,” Midoriya took a deep breath. “When I was fourteen, I met All Might. He saved me from a villain. I, uh, may or may not of hitched a ride on his pant leg. I asked him if someone like me, quirkless, could become a hero. He said no. That was the first and last time that I considered that maybe I wasn’t cut out to be a hero.”</p>\n<p>Midoriya was staring at All Might again and he tried not to sweat. In reality, he probably would have said the same thing to a quirkless child however, Midoriya wasn’t just a quirkless child. His counterpart must have seen <em>something </em>in him to pass on One for All.</p>\n<p>All Might just wished he could see that as well.</p>\n<p>“Long story short, I rushed in to save a friend. All Might was impressed and offered me his quirk. I accepted. For the next ten months until the UA entrance exam, he trained me at Dagobah Beach in order to prepare my body to receive One for All.”</p>\n<p>Midoriya went on to explain about the entrance exam; how he got zero villain points, how he destroyed the zero pointer and got in on rescue points alone. Aizawa and Nedzu both looked minorly impressed. Midoriya explained how it had physical repercussions on his body (although he didn’t explain what those physical repercussions <em>were</em>, All Might had a good idea) and for the next few years, how he struggled to control his power. He mentioned the attack on USJ and how that was the first time he met Shigaraki Tomura, All for One’s successor in his world. The Sports Festival, meeting Gran Torino, what happened in Hosu with the Hero Killer, the attack on the summer camp, all the way up to Kamino.</p>\n<p>“We were put in the dorms after that,” Midoriya said. Then he spoke about the internship he took on with Sir Nighteye and the events leading up to the battle with the Eight Precepts as well as its after effects.</p>\n<p>All Might shared a glance with Mirio while they listened to Midoriya describing the battle. There was… a lot to think about. A lot that <em>needed </em>to be changed.</p>\n<p>Midoriya explained his second and third year in as equal detail. The situation only seemed to build up and get worse and worse. If this was their future… All Might had to change it. Too many things would go wrong, too many people would suffer. Midoriya paused when he neared the end of his third year and took a deep breath. “The July Attacks were our last big battle. Shigaraki and his league attacked. By the time we had any idea what was going on, Japan was under siege. UA was considered one of the last strongholds in Japan. We didn’t have much time left, so we staged a counterattack. We won, but it was a near thing. Afterwards, 3-A graduated with metals of honor for our participation and subsequent end of the war. We easily rose in the rankings, some of us opening up our own agencies right away. By the time I was twenty years old, we dominated the top twenty heroes. I was number five at the time. That was the first time I was officially called the Symbol of Peace. ”</p>\n<p>There was silence in the room. Everyone was too deep in thought to offer up any comments. Nedzu leaned back in his chair, took a sip of his tea and sighed. Aizawa was staring intently at a coffee stain on the table. Mirio had long lost his cheerful expression and was instead staring down at his hands. Naomasa’s notes were at least a mile long at this point and he didn’t seem to be stopping any time soon.</p>\n<p>“It seems,” Nedzu said, but his voice is quiet. “That there is much to think about.”</p>\n<p>“I truly am sorry for dumping this all on you. I would like to help, if at all possible,” Midoriya said genuinely. That was what he was—genuine. “Tsukauchi-san, I was wondering what was going to happen to my hero license?”  </p>\n<p>“We don’t really know whether to validate your hero license or not,” Naomasa said. “Because, technically, you did take the same hero test from the same people, it’s a bit of a….unique circumstance. For now, it would be better to just avoid conflict and not have to worry about it.”</p>\n<p>Midoriya nodded just as Aizawa looked up from his coffee stain. For the first time since he arrived, Aizawa spoke. “This… Shigaraki. How likely of a chance that All for One would bring him here, instead?”</p>\n<p>“Zero,” Midoriya responded before All Might even had time to <em>think </em>about the possibility. His voice was strangely flat. He noticed everyone staring at him and he flushed, sinking down into his seat. He wouldn’t meet any of their eyes. “It’s just… Shigaraki didn’t survive. During the July Attacks.”</p>\n<p>“I see,” said Aizawa.</p>\n<p>“And your world?” Midoriya said. All Might easily noticed how quick he was to change the topic. It wasn’t unnoticed by the others in the room. “Can you tell me about it?”</p>\n<p>“I don’t see why not,” Nedzu said and folded his paws. He was smiling again. “Our worlds are virtually the same except for some unexplainable reason, you and your counterpart switched professions. He is a villain, you are a hero.”</p>\n<p>Midoriya immediately started to mutter again, twisting his hands in his lap. All Might couldn’t understand a single word he was saying, but Nedzu seemed to be enjoying the entire thing if his widening smile was anything to go by. Mirio laughed a bit under his breath. Midoriya noticed them staring and broke off, waving his hands in front of him. “I’m sorry! It’s a bad habit, everyone tells me. I should stop and I’ve been trying but its—\"</p>\n<p>Mirio interrupted him, “I like you better than your counterpart!”  </p>\n<p>Midoriya stopped and stammered out, “Uh, thank you? I didn’t think that was hard to do.”</p>\n<p>“Now that that’s out of the way,” Naomasa said while finishing up writing. He flipped his book shut with an audible <em>snap! </em>“I think we should figure out where Midoriya here is going to be staying.”</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p align=\"center\">\n<strong>pro-hoes</strong>\n</p>\n<p align=\"center\">[with Iida Tenya, Mezo Shoji, Ashido Mina and 15+ others]</p>\n<p align=\"right\">Wednesday, 2:56 pm</p>\n<p align=\"right\">deku is MIA as of monday afternoon</p>\n<p><strong>jiro: </strong>excuse me WHAT</p>\n<p><strong>bakugo: </strong>DEKU IS FUCKING W H A T</p>\n<p><strong>tsuyu:</strong>is that why he hasnt been in the news recently? do you know what happened?</p>\n<p><strong>hagakure: </strong>oh my god what happened??</p>\n<p><strong>aoyama: </strong>tu te fous de ma gueule ?????????????????</p>\n<p><strong>ashido: </strong>uraraka are u ok?</p>\n<p align=\"right\">Wednesday, 2:58 pm</p>\n<p align=\"right\">im fine, its todoroki that’s taking the brunt of it</p>\n<p align=\"right\">he just. disappeared. we dont know anything</p>\n<p align=\"right\">we're working on it</p>\n<p align=\"right\"> </p>\n<p><strong>kaminari: </strong>yeah, if midoriya is anything hes strong</p>\n<p><strong>ojiro: </strong>we'll help. he’ll be ok</p>\n<p><strong>yaomomo: </strong>We’ll find him, Uraraka.</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>Todoroki Shouto had seen a lot of things in his life. Being a pro-hero definitely helped in that aspect. It wasn’t always a good thing.</p>\n<p>He’d seen his friends and classmates injured and beaten so black and blue that they could barely stand. He’d been in more than one hospital waiting room, watching as the staff ran back and forth. There had been times where he wasn’t sure they were going to make it. From his first year at UA to standing here now as number three in the hero rankings, he’d seen his friends in a lot of tough situations.</p>\n<p>He’d never seen one disappear right in front of his eyes.</p>\n<p>Only two stores down from the café they were supposed to meet at on an unsuspecting Monday afternoon, Shouto watched helplessly as his best friend disappeared in a gold and green light.</p>\n<p>Two days of vigorous, nonstop searching yielded absolutely <em>nothing</em>.</p>\n<p>Now, despite his desk being full of pictures, notes, news articles, anything and <em>everything</em>that could possibly help find him—Shouto still had nothing. He tried not to let it get it him, he really did. Izuku was strong. He’d always been strong.</p>\n<p>But he was <em>right there</em>—</p>\n<p>He thought of the smile on Izuku’s face right before he disappeared and failed to get rid of the guilt in his gut.</p>\n<p>Their shared agency—himself, Ochako, Izuku and Tenya— did its best to cope, with Tenya taking on the brunt of the work, but it was still hard. Kirishima and his agency, being the closest around (and also the ones called during the convince store burglary right before Izuku disappeared), were also informed. Kirishima helped where he could, offering supplies and extra heroes to expand the search. People were asking about Deku and why he had yet to make an appearance. After the July Attacks, Deku had been a constant presence in the hero world. A way of saying, <em>it’s okay because I am here!</em></p>\n<p>When a man like that disappeared, people started to notice.</p>\n<p>Their agency was stuck. They either had to find Izuku and find him <em>soon </em>or release the fact that the <em>Symbol of Peace</em>disappeared and they had <em>no idea where he was</em>.</p>\n<p>“Todoroki,” Ochako sighed from her position against his door. Kirishima and Tenya were hovering near her, looking like they wanted to enter his office but couldn’t bring themselves to. They both looked tired an exhausted. Shouto would hate to see what he, himself, looked like. He’d spent just as much time, if not more, on the search. “You can’t keep beating yourself up over this. We’ll find him.”</p>\n<p>He thought of the gold and green light. The smile right before he disappeared. He blinked and Izuku was gone.</p>\n<p>“He was right there,” Shouto said. “And suddenly he wasn’t.”</p>\n<p>“This absolutely wasn’t your fault,”  Tenya said in his no-nonsense voice.</p>\n<p><em>I was there and didn’t do anything</em>, Shouto wanted to say but kept his mouth shut. It didn’t help the guilt tearing at his chest. Izuku had saved him countless times. Izuku always had his back. Yet, he couldn’t save his friend the one time he needed saving.</p>\n<p>That was on Shouto. That was his fault.</p>\n<p>“Whatever we’re doing, we need to do it soon,” Kirishima said, drumming his fingers on the doorframe. “Everyone’s worried, man. Villains are taking advantage of his leave. We’re all working overtime just to keep the peace and it just… It just feels kinda empty without him.”</p>\n<p>Midoriya Izuku, the boy who showed up the first day of UA and a shaking mess and graduated as the savior of Japan. Countlessly risking life and limb just to offer them—<em>everyone </em>in the Class—the safety that they needed. He wedged his way into all of their hearts and never really left. </p>\n<p>Ochako put a hand on Kirishima’s shoulder. “I know. We have to be strong, though. Deku is counting on us. We’ll find him.”</p>\n<p>“I promise you,” Tenya said with as much conviction as the situation offered. “I <em>promise </em>you we’ll find him.”</p>\n<p align=\"center\"> </p>\n<p align=\"center\"> </p>\n<p>Midorishi Izuku was in a police station, staring at him.</p>\n<p>When Mirio and All Might had told Tenko they had <em>big news</em>, this was not what he was expecting.</p>\n<p>“Shigaraki Tomura,” Midorishi breathed out and looked like he was staring at a ghost. All Might, who had been standing right next to Midorishi <em>and letting him walk around like it was nothing</em>, looked at Midorishi in surprise.</p>\n<p>Tenko has been called a lot of weird things. Teen, Treeko, Tonsil, Tennie Weenie (five year olds were incredibly creative) but that was the first time he’d ever heard someone be so off. That someone being Midorishi <em>fucking </em>Izuku, the very person who nearly crushed Aizawa-sensei into dust, tried to stab Tsuyu and kidnapped Bakugo not even a week ago. Hell, Tenko had his face <em>smashed into a slab of concrete</em>and had the scar running down his cheekbone to prove it.</p>\n<p>Tenko felt like he should be offended.</p>\n<p>If you try to kill a person, at least learn their names.</p>\n<p>Instead, Tenko steeled his nerves, pointed to his chest and asked, “You mean me?” while trying not the think about the fact that he’s holding a conversation with All for One’s successor.  </p>\n<p>All Might was glancing between the two of them before saying, very slowly, “That’s Shimura Tenko.”</p>\n<p>“Shimura Tenko…” Midorishi Izuku paused before letting out a huff of hair. “Oh, you’ve <em>got to be kidding me</em>. What did Nedzu say, that they were virtually the same?!”</p>\n<p>“I didn’t know your Shigaraki was Tenko,” All Might, if anything, looked troubled. “I’ll have to tell Naomasa.”</p>\n<p>“I thought he would be dead,” Midorishi muttered. Normally, that statement would put anyone on edge, but the way Midorishi was looking at him was strange. He almost seemed…wary? Of <em>him</em>?</p>\n<p>\n<em>Seriously, what was going on?</em>\n</p>\n<p>“All Might, uh?” Tenko said and gestured to the number one problem right now. Midorishi Izuku, the leader of the League of Villains, was definitely standing in the lobby of a police station but not in handcuffs. And all the officers seemed to be ignoring him. And All Might wasn’t attacking him. “Isn’t that <em>Midorishi Izuku</em>? Big name villain? The one that, y’know, <em>smashed my face into concrete</em>?”</p>\n<p>“No. This is Midoriya Izuku. He’s different. Don’t worry about it, Tenko.”  All Might said which explained absolutely <em>nothing</em>. If seeing his look, All Might added, “Mirio and I will explain at Gran’s place later.”</p>\n<p>Tenko eyed this ‘Midoriya’, “Where’s he going?”</p>\n<p>“To UA.”</p>\n<p>“Okay…” Tenko said, trusting his somewhat of a father figure but not Midoriya (Midorishi? Midorishi’s long lost brother?). “<em>Why </em>is he going to UA?”</p>\n<p>“Tenko,” All Might warned. Okay, wow, he had a good stern dad face.</p>\n<p>Midoriya smiled at him. Like, actually, <em>truly </em>smiled at him. Without trying to smash him into the ground. “I’m sorry. This probably seems weird to you, Shimura.”</p>\n<p><em>He’s different, </em>All Might said. Yeah, no fucking kidding. This one <em>smiles</em>.</p>\n<p> “Tenko,” was the only intelligible thing that came out of his mouth in response.</p>\n<p>Midoriya looked confused. “Huh?”</p>\n<p>“My name,” Tenko said. “It’s Tenko.”</p>\n<p>From a young age, he saw the way that his name affected All Might and Gran. The moment someone else called him <em>Shimura</em>, they would both tense and have this far off look in his eyes. Tenko never knew what they were thinking about but he did know who they were thinking <em>of</em>.  </p>\n<p>Tenko didn’t want to be compared to is his long dead grandmother.  </p>\n<p>He <em>certainly </em>didn't want the successor (or only look alike?) of his grandmother’s killer calling him that.</p>\n<p>“Alright then, uh, Tenko,” Midoriya was staring at him with that <em>look </em>again. “I guess I’ll be seeing you around?”</p>\n<p>It came out as more of a question.</p>\n<p>Tenko shot a look at All Might who only gave him a tired smile in return. “I guess so?”</p>\n<p>All Might put a hand on Midoriya’s shoulder and lead him away. Very few even glanced in their direction. Tenko could only stare at their backs in horrified disbelief. That was…..well, weird would be an understatement. Midoriya Izuku was a strange person. The way Midoriya looked at him…he couldn’t quite get Midoriya’s expression out of his mind.</p>\n<p>Midoriya looked at him like he was a villain.</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>“You’re saying,” Tenko said slowly. “That Midoriya Izuku is from a parallel world. That he is a hero in his world. That he saves people. That he’s the <em>Symbol of Peace</em>.”</p>\n<p>His words echoed around Gran’s beaten down apartment. Crowded around the small kitchen table was All Might, Mirio and Gran himself (still covered in bandages and only recently discharged but otherwise alright). Mirio and All Might had just finished explaining what when down in the police precinct not four hours ago.</p>\n<p>He <em>may or may not </em>be a bit hysterical.</p>\n<p>“Yes,” All Might said.</p>\n<p>“Pardon my French but <em>what the fuck.” </em></p>\n<p>“Language,” Mirio chastised with a grin. Gran laughed. All Might looked like he was seconds away from calling it a night and going to bed.</p>\n<p>“A hero,” Tenko repeated. “<em>Him</em>?!”</p>\n<p>“He’s not like Midorishi,” All Might said and crossed his arms.</p>\n<p>“He also wields One for All,” Mirio added like that was supposed to make anything better.</p>\n<p>“He <em>WHAT?!” </em>Tenko leapt to his feet. All Might tried to get him to sit back down but Tenko’s head was spinning way too fast to even <em>think </em>right now. He looked accusingly at Gran. “Did you know about this?!”</p>\n<p>“I watched him use it, brat.”</p>\n<p>“Is no one else a little suspicious at All for One <em>happens </em>to summon a guy that wields One for All and calls himself a hero?! <em>At all</em>?!”</p>\n<p>Gran picked at his ear. “You’re so loud.”</p>\n<p>“Tenko, chill,” Mirio said. Even <em>Mirio</em>, god. “He’s really not like that!”</p>\n<p>Tenko whirled on him. “And how long have you known him?”</p>\n<p>“Tenko,” All Might said. Tenko turned and met his eyes. All Might offered him a small, tired smile. There was something in his eyes. Something that he wasn't saying but it was there all the same. “He’s not a villain. <em>Trust me</em>.”</p>\n<p>He did trust All Might. He just couldn’t bring himself to trust Midoriya Izuku.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p align=\"center\">\n<strong>ALL MIGHT vs. THE FACELESS MAN and the LEADER OF THE LEAGUE OF VILLIANS </strong>\n</p>\n<p align=\"center\">Posted: Sunday 7:56 pm</p>\n<p align=\"center\">By Azuma Hachiro</p>\n<p>As I’m sure everyone has heard, on Monday evening Kamino Ward, located in the city of Yokohama, was attacked. This was directly following a raid that focused on the League of Villains’ headquarters to rescue kidnapped first year UA student, Bakugo Katsuki. The destruction of Kamino and the subsequent loss of lives are taking its toll on all of Japan. The country is in mourning.</p>\n<p>As of right now, the only official details that we can give are: Bakugo Katsuki was safely rescued and uninjured. All Might is confirmed to have been discharged from the hospital.</p>\n<p>Before the livestream ended, a man without a face appeared alongside known leader of the League of Villains, Midorishi Izuku. When questioning detectives involved in the case, they refused to give a comment.</p>\n<p>For now, we wait and our questions go unanswered. Who is this faceless man? What caused the livestream to end? Will the heroes be able to stop the League of Villains?</p>\n<p>What are we going to do next?</p>\n<p> </p>\n<p> </p>\n<p>Out of the entirety of the case, Todoroki Shouto only had a single clue to go off of; a golden and green light.</p>\n<p>That was it.</p>\n<p>It was obviously quirk based. It couldn’t be anything else. So, for the last forty eight hours he scanned every quirk in the entire <em>history </em>of the registered database to find <em>something </em>similar to whatever he saw. To whatever made Izuku disappear.</p>\n<p>He didn’t find anything.</p>\n<p>So there he sat, computer open, curled up at his desk and feeling like the most useless person in the world. Scribbled notes and trashed papers lay around, abandoned but not forgotten. The names of everyone who might have a grudge, who might have a reason to do this (which was, admittedly, a lot considering Izuku <em>was </em>the Symbol of Peace). Quirk ideas, weird possibilities. Was it a hostage situation? Was it revenge? Who had the possibility, who had the power, to make Midoriya Izuku,<em> hero Deku</em>, disappear right before their eyes? </p>\n<p>\n<em>Izuku had been right there. </em>\n</p>\n<p>A knock sounded at his office door. He jerked up, sending papers flying to the floor. Shouto shook himself awake, glancing around the dark office space. A clock sat on his desk near the right corner. The time on it read 2:56 am.There was another, more insistent, knock at his door. He paused for only a second before stumbling to his feet. A piece of paper fluttered to the ground. He walked over to the door, hand on the handle but didn’t open it.</p>\n<p>\n<em>Who could that be…?</em>\n</p>\n<p>His first thought was Uraraka or Tenya but both of them had gone home long ago. Kirishima had an early morning shift today and said he wouldn’t be able to swing by until later. None of their sidekicks or workers would even think to try and interrupt him this early in the morning.</p>\n<p>Shouto opened the door. Naomasa stood there, pleasant smile on his face. A file was in his hands.</p>\n<p>“I figured I’d find you here.” Naomasa said.</p>\n<p>“It’s three in the morning,” Shouto replied because that was about all he <em>could </em>say. His mind wasn’t processing that Naomasa, who Shouto hadn’t seen for almost a month, suddenly arrived at his door at three on the morning.</p>\n<p>“I know. I would apologize but I figured you wouldn’t want me to wait,” Naomasa handed the file to Shouto, who quickly took it. Naomasa was never one to give out useless information. Shouto stared at the manila envelope with <em>Case B7-084576 </em>stamped on the cover.</p>\n<p>“Is this…?”</p>\n<p>“It’s a cold case,” Naomasa told him as Shouto fingered the edges of the file’s sides. “But it’s better than nothing.”</p>\n<p>They had a lead.</p>\n<p>Shouto clutched the file to his chest like it was a lifetime. He couldn’t even begin to express how much gratitude he was feeling to Naomasa. “<em>Thank you</em>. Thank you so much.”</p>\n<p>“Izuku has done so much for us. I’m only returning the favor,” Naomasa said and sighed. “His mom has been asking for updates on the case every two hours. It’s getting harder and harder to tell her that we don’t know. All Might is worried, too but he’s limited on how much he can help out. He’s trying not to show it, but I’ve known him a long time. I’ve never seen something get to him as much as Izuku’s disappearance. He loves Izuku like his own son. For All Might’s sake, <em>find him</em>.”</p>\n<p>Shouto thought of what Tenya said yesterday. The determination to find their missing friend. He looked at the file in his hands. Some of the guilt that was eating at him was finally starting to fade away, replaced by a new resolve. “Naomasa-san, I <em>promise </em><em>you </em>we’ll find him.”</p>\n<p>“The world needs its symbol,” Naomasa said with a smile. Then he turned on his heel and left.</p>\n<p>Shouto spent the next few hours poring over this case. Every little detail noted, every name and location memorized. He scribbled notes on the margins and highlighted every sentence. He didn’t even notice the time until the sun had risen and the city was starting to wake.</p>\n<p>The case wasn’t much. In fact, it was basically nothing.</p>\n<p>Ten years ago, ten different people were reported missing near Takoba. There was no order to the disappearances. Men, women, children were all victims. They didn’t know each other. Their families didn’t know who could possibly do it. There was only one witness who told of a green and gold light right before his family—a wife and child—disappeared. The suspect was male, tall, and wore a hood to protect his face.</p>\n<p>No one knew where the victims went. They were never found.</p>\n<p>Shouto could still use this. He had to.</p>\n<p>Japan burned as the sun set over the horizon.</p>\n<p>Ash blanketed the nation, covering the buildings in a thick smoke. Dust curled in his lungs and burned his eyes. The fire and setting sun cast an eerily red glow throughout the empty halls of UA. Screams (the screams of thousands of innocent people fighting for their lives) could be heard in the distance. Cries of different sorts—deep, guttural—echoed through the empty city. Nomu were not an uncommon thing to be heard.</p>\n<p>There Izuku sat, curled up the corner of his old classroom as Japan burned around him. The halls of UA had never been so empty, so without life. He remembered running down the very same halls with his friends, eagerly rushing to their next classes as they trained to become heroes. That seemed like such a long time ago.</p>\n<p>Izuku’s throat burned as he breathed in another lungful of ash.</p>\n<p>The sound of a single pair of footsteps bounced off the walls. Izuku pulled himself tighter into a ball and tried to focus on his breathing. His head throbbed and his arms burned. His arms were bandaged down to his fingers, but the ash had covered the one white bandages a dirty grey color.</p>\n<p>The footsteps stopped directly in front of him. Izuku didn’t need to look up to see who it was.</p>\n<p>“It’s time,” Shouto said.</p>\n<p>Izuku looked up. Shouto held out his hand. Izuku took it without hesitation and Shouto hoisted him up off the ground. No words were spoken as Shouto lead him through the empty halls of UA up to the roof.</p>\n<p>The rooftop was crowded, surrounded by various people in all shapes and sizes. Old, young, big, small. Mothers, fathers, children, civilians and heroes alike. Ochako was talking in hushed voices to a group of first years. Tenya was putting a splint on Koda’s leg. Shoji and Yaomomo were huddled in a group, discussing what looked like a strategy. Hagakure was covered in so many bandages that her outline was clearly visible. Aizawa was around a group of younger students (students that should’ve had their lives to learn to become a hero instead of being thrust into a battle their very first year) corralling them into a safe place. All Might was helping Recovery Girl tend to injuries.</p>\n<p>They were all tired. Knowing that the end to this chapter was coming and they had no idea who was going to live to see the next day.</p>\n<p>\n<em>Japan continued to burn. </em>\n</p>\n<p>It was Jiro who noticed him first. She sat up from her position on the floor, both hands wrapped and leg in a splint. She smiled, but Izuku would tell she was exhausted. “Glad to see you up, Midoriya.”</p>\n<p>Ojiro nodded at him, broken tail at his side. Tokoyami was asleep two feet away, bandage wrapped around half of his face. Kacchan glanced at him only for a moment before going back to bandaging a wound on Ashido’s side. All Might gave a thin-lipped smile in greeting. </p>\n<p>“Good to have you back on the field, Midoriya,” Kirishima called. The other greetings were lost to the background sounds.</p>\n<p>Ochako walked over and pulled him into a hug. When she pulled away, her smile was sad. “We don’t have much time.”</p>\n<p>“I know,” Izuku answered. He glanced at Shouto who gave him a nod of encouragement in return. Eyes turned, expectant gazes of all kinds. From his friends, his family and heroes alike. They were waiting—waiting for him.</p>\n<p>“Midoriya…” Yaomomo sounded tired. “What do we do?”</p>\n<p>There was a speck on the horizon. So small that it would normally be insignificant, but Izuku knew better. He heard the nomus’ roars even from here. The outline of an approaching army. They didn’t have a lot of time before Shigaraki Tomura and his league would be here. The thought of the thousands of innocent lives that would suffer (or end) should they succeeded steeled Izuku’s nerves.</p>\n<p>This was not a battle they could afford to lose.</p>\n<p>“Today this ends,” Izuku said and hoped his voice carried. All Might gave him a determined nod. “No matter what, we end this.”</p>\n<p>Sero put a hand on his elbow. “Shigaraki can’t beat us so easily.”</p>\n<p>“We have each other’s backs,” Tsuyu said, determined. “No matter what.”</p>\n<p>The silence overtook the roof. People basking in what was quite possibly their last few moments alive. Burning determination to protect and serve in order to create a better future. They shared each other’s thoughts, each other’s emotions until—</p>\n<p> “<em>ONE FOR ALL!</em>” a voice carried across the battlefield. The voice—the same voice that they first heard three years ago at USJ echoed around the empty buildings. A nomu responded to Shigaraki’s cry. The heroes tensed, the battle nearing its climax.  </p>\n<p>Japan was burning <em>and burning and burning</em>—</p>\n<p>Izuku woke with a start.</p>\n<p>Someone was shaking him awake.</p>\n<p>He jerked up, nearly falling off the couch in the old teacher’s lounge where he had been spending the night at. His breathing come out in harsh, ragged huffs. The room was dark but small strands of sunlight peaked out from the closed blinds. The dream—the <em>memory</em>—was still fresh on his mind.</p>\n<p>For a moment, Izuku was confused.</p>\n<p>Then, in a rush, everything came back. All for One and his quirk, the villain, Kamino. A parallel world where he was a villain. Izuku remembered the interrogation with Naomasa’s alternate-self, meeting All Might. Mirio wielding One for All. Shimura Tenko being alive. Offering to help set up UA before the students arrived.</p>\n<p>Someone placed a hand on his shoulder. When Izuku turned, he only saw Shigaraki<em>.</em></p>\n<p>He was on his feet in seconds. One for All rushed to his aid before he even had a chance to think. The familiar power rushing through his system as his lighting burst to life in an array of colorful sparks. Ready to protect from <em>him</em>, from that <em>man</em>, from his <em>enemy</em>—</p>\n<p>Seeing the fear in Shimura Tenko’s eyes made him realize his mistake.</p>\n<p>“I-I’m so sorry, oh my god, I—,” Izuku had rushed out, even as One for All faded.</p>\n<p>“No, it’s okay…” Tenko said, but he was shaking. He was <em>shaking</em>, looking up in fear. “I-I understand. I’m just…I’m gonna go….”</p>\n<p>Tenko rushed out of the room without another world. Izuku stood there, rattled. His mind was on overdrive trying to process the memory, trying to process Tenko. His thoughts all exploded at once, leaving Izuku lightheaded and dizzy. He slid to the floor, back propped up against the couch. His hands were shaking.</p>\n<p>\n<em>ONE FOR ALL! </em>\n</p>\n<p>Izuku couldn’t get Shigaraki Tomura’s voice out of his head.</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>Tenko didn’t tell Mirio what happened.</p>\n<p>Mirio already had a lot on his plate with his internship and training One for All. He didn’t need to know that Tenko tried not to piss his pants every time he saw Midoriya Izuku turn a corner. In hindsight, waking Midoriya up from what Tenko assumed was a nightmare was not the best idea. Especially since he was pretty convinced the nightmare had something to do about him. Or his counterpart, at least. It had been stupid. A dumb move. How would <em>he </em>react had it been <em>Midoriya </em>that woke him up from a nightmare?</p>\n<p>Not good.</p>\n<p>The sad part of it all is that he understood <em>why </em>Midoriya reacted like that. He understood Midoriya’s fear. He felt it every time he looked at Midoriya’s face. Midoriya and Midorishi looked terrifyingly similar. He could only assume Shigaraki and himself were the same.</p>\n<p>Midoriya avoided him the rest of the morning. Tenko avoided Midoriya the rest of the morning. It was childish and stupid—he should really work out his problems like an adult—but he couldn’t shake the fear whenever he thought of seeing Midoriya again. He couldn’t get the image of One for All’s power <em>almost </em>being used against him out of his mind.</p>\n<p>The combination of both of them avoiding their problems was probably the reason they ended up bumping into each other in the empty cafeteria. Karma was a <em>bitch</em>, after all.</p>\n<p>Across the cafeteria, Tenko could only watch in horror as Midoriya fucking Izuku walked in, carrying a rather large stack of books with ease and seemingly oblivious to his company. Tenko debated turning around and walking out (it wasn’t like Midoriya had seen him yet), but he steeled his nerves. He couldn’t avoid his problems forever.</p>\n<p>“It’s you,” Tenko said. Midoriya nearly dropped all his books in surprise.  </p>\n<p>“Oh, uh, Tenko.” Midoriya said. He sounded nervous as he placed the books on an empty table. Tenko watched him, half expecting to see One for All again. Midoriya approached him, rubbing his arms and not meeting his eyes. “I was looking for you earlier. I…I wanted to apologize.”</p>\n<p>“What?”</p>\n<p>“For this morning,” Midoriya elaborated. Tenko stared at him. “I’m not here to make excuses. I shouldn’t of reacted to way I did. I shouldn’t have used One for All like that. It was really unacceptable.”</p>\n<p>He sounded like Iida. If Tenko hadn’t been so surprised, he might have laughed.</p>\n<p>“No…I understand, really,” Tenko responded because he <em>did. </em>Midoriya looked at his face and saw Shigaraki. He looked at Midoriya’s face and saw Midorishi.“We’re kinda in the same position, after all.”</p>\n<p>The tension in the air faded just a little.</p>\n<p>Midoriya stared at him and then cracked a smile. “This is going to be hard, isn’t it?”</p>\n<p>Tenko grinned for the first time in almost two days. It wasn’t going to be easy, seeing the face of his number one enemy as a friend but…this was a start. “I’d like to consider the situation a mutual understanding.”</p>\n<p>Midoriya seemed amused. “A mutual understanding, huh?”   </p>\n<p>“HEEYY! Tenko!” a voice called out from the other side of the cafeteria. Tenko turned, only to see Present Mic in his civilian clothes heading towards him, waving enthusiastically.  “I thought I’d find you in here!”</p>\n<p>“Mic-sensei,” Tenko greeted.</p>\n<p>Present Mic arrived at their little group in seconds. He looked at Midoriya before whistling in surprise. “Ho-boy, that is still <em>super </em>weird.”</p>\n<p>Midoriya smiled at him. Present Mic visibly leaned back.  </p>\n<p>“You were asking for me?” Tenko asked to get his teacher’s attention back.</p>\n<p>“<em>YEAH</em>!” Present Mic said. He was so <em>loud. </em>Tenko tried not to cringe. Midoriya didn’t even flinch. “All Might said you and Mirio were helping out around UA. Thought I could use you to grade some papers and work with lesson plans.”</p>\n<p>Midoriya picked up the textbooks that he had set down earlier. He gave both of them a smile. “I’m going to go. Midnight-sensei wanted these as fast as possible. It was nice talking to you, Tenko.”</p>\n<p>Present Mic watched him leave. His smile was slowly falling off of his face. It seemed that Present Mic still didn’t forgive Midorishi for injuring Aizawa during USJ. He turned to Tenko, giving him a once-over like he was scanning for injuries. Tenko just blinked.</p>\n<p>“Was he bothering you?” Present Mic asked.</p>\n<p>“No,” Tenko said and stared at the place where Midoriya had left. Midoriya’s words were still fresh on his mind. “Actually, Mic-sensei, I think it’s the opposite.”</p>\n<p>Tenko thought of Midoriya’s smile. His apology. Their ability to hold a conversation despite being enemies. It wasn’t much—but it was a start. For both of them.</p>\n<p> </p>\n<p> </p>\n<p>“Midorishi,” a familiar voice called from behind Izuku. Izuku startled, almost dropping the papers he was supposed to be carrying to Present Mic. He turned, unsurprised, to see Aizawa watching him from his place leaning against the hallway wall.</p>\n<p>Aizawa was still as sneaky as ever, Izuku noted.</p>\n<p>“My name is Midoriya, Aizawa-sensei,” Izuku said because he <em>really </em>didn’t want to be associated with a villain’s name.</p>\n<p>“Doesn’t matter,” Aizawa said and beckoned him over.</p>\n<p>“It kind of matters,” Izuku muttered but turned around and approached his teacher anyways.</p>\n<p>Aizawa wouldn’t call him for no reason—especially not with the high tension in UA regarding his presence in general. He would’ve been stupid not to notice how all the teachers seemed to watch him closely. He knew it would take one mistake, one slip up or any reason to suspect him, and he would be gone. They wouldn’t endanger their students’ lives. Not with the league on the move. Not with Kamino happening less than four days ago.</p>\n<p>Aizawa…well, truthfully Izuku hadn’t seen his old teacher besides a few times in the hallway and that first time in the police station, but Aizawa was different. He didn’t have the same wary look in his eyes that everyone else seemed to have. He didn’t stalk Izuku like he was an actual villain. There weren’t any sideways glances, any avoiding him. Aizawa treated him like a student. A particularly unruly student, but a student nonetheless.</p>\n<p>It was almost nostalgic in a way.</p>\n<p>(Although Izuku didn’t know if it was because Aizawa truly believed him or if Aizawa thought that that he could easily be taken care of if he <em>was </em>a threat.)</p>\n<p>“Problem child,” Aziawa said instead and Izuku tried to hide his smile. “Come on.”</p>\n<p> Aizawa turned and started leading him down the hallway. Confused, Izuku jogged to catch up, the papers still clutched firmly in his hand. Mic wasn’t going to be happy that he was late—Mic was probably the most wary out of all the teachers—but Aizawa wasn’t giving him much of a choice.</p>\n<p>“Where are we going?” Izuku asked.</p>\n<p>“Gym,” came Aizawa’s curt reply. As for <em>why </em>they were going to the gym, Izuku could only guess. He didn’t dare ask out loud because he knew Aizawa wouldn’t give him a straight answer. He never really did.</p>\n<p>Aizawa lead him through the familiar halls of UA towards Gym Gamma in the middle of the campus. Izuku had walked this path enough times to know it by heart but it didn’t stop him from looking around at all of the campus amenities. He could distantly see the wall of Ground Beta towering above the forest trees.  Bird chirped and squirrels raced around the field, but despite that, the campus was quiet. There were no students and no teachers in sight. It was…eerie in a way.</p>\n<p>Izuku hadn’t been on campus after Kamino. He never realized how <em>empty </em>it had been. With the bustle of the students gone, the campus was silent. The last time it had been like this was, well, during the war. The only difference was the lack of <em>fire</em>.</p>\n<p>“We’re here. You can stop muttering,” Aizawa said just as Izuku almost ran face-first into the door of the gym. He hadn’t even noticed they’d gotten close. Aizawa was watching him from the corner of his eyes and Izuku tried not to blush. Bad habits die hard.</p>\n<p>“Why the gym?” Izuku asked as Aizawa swiped his ID card and opened the gym doors. Izuku followed him inside wordlessly.</p>\n<p>“You said you were a pro hero. One of my students,” Aizawa said. He tossed something at Izuku, who caught it with ease. Izuku unwrapped the object, only to find an old gym uniform (the kind that he had worn as a first year many years ago) in his hands. Izuku almost laughed. “I want to see that for myself.”</p>\n<p>Izuku fingered the material. It had been a long time since he’d been in one of these. He knew he still had his old gym uniform hanging up in his agency’s office, as a reminder, never to be worn again. “How?”</p>\n<p>“Spar,” Aizawa said simply. “If you truly are my student, I’ll know. Better start thinking of everything I taught you.”</p>\n<p>Aizawa had always been a fan of logical ruses. Izuku shouldn’t have been surprised that coming to UA was just going to be another test.</p>\n<p>Izuku quickly changed into the gym uniform. It was much easier to move in that his casual clothes, though nowhere near as breathable as his hero suit. Unfortunately, his hero suit was still with Naomasa and being used for the case, but, well, you couldn’t win ever battle. Izuku was just glad that is was his suit that they were keeping locked up and not Izuku <em>himself</em>.</p>\n<p>“Ready?” Aizawa asked after Izuku had come back out on the field, changed and ready to fight.</p>\n<p>“Ready,” Izuku said. Aizawa didn’t even give him a chance to say anything else, instead rushing at him with alarming speed. His quirk was activated, preventing Izuku from using his own. Izuku clenched his hand into a fist and smiled.</p>\n<p>\n<em>No good hero is a one trick pony. </em>\n</p>\n<p>If this is how Aizawa wanted to play, then Izuku would show him how much he’d learned. Aizawa had always taught them to never rely one hundred percent on their quirks. Beaten them black and blue until they understood. There was always the possibility of it getting taken away—a near constant threat that Izuku had faced over and over and over. Izuku might have used One for All to help him get stronger but he wasn’t known as the symbol of Peace <em>because </em>of One for All.</p>\n<p>So Izuku eased himself into a fighting stance and showed Aizawa just what they Symbol of Peace could do.</p>\n<p>Afterwards, when they were beaten and bloody and heading down to Recovery Girl’s office, Aizawa nodded at him. There was a gleam in his eyes—the same gleam that Izuku had seen when he did the ball toss on his first day and Aizawa had said that he had potential. “You’re not bad.”</p>\n<p>Izuku offered him a smile. “I had a good teacher.”</p>\n<p>“Cheeky.”  </p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>It had been exactly six days since the incident at Kamino Ward.</p>\n<p>The media storm had finally calmed down enough that statements were given. The dead were mourned, the community slowly started to piece itself back together. Kamino was still a giant pile of rubble, but little by little the debris were cleared and the city was ready to begin anew.</p>\n<p>Not a single one of those people knew about the real problem—Midoriya Izuku.</p>\n<p>In the week since Kamino, Tenko had basically been sleeping at UA. He and Mirio helped out where they could; writing lectures, grading papers, helping with lesson plans. They cleaned the halls, cleared the classrooms and watched as the dorms were built from nothing.</p>\n<p>Perhaps the most surprising thing was that Midoriya helped out, too.</p>\n<p>Tenko didn’t know what to think about Midoriya at first. Their first real encounter didn’t go so well—Tenko had only been trying to wake him up because Aizawa was asking for him. He never imagined that Midoriya would react like <em>that</em>. With One for All directed at him. The wild look in his eyes as he got into a instinctual fighting stance. Midoriya had been <em>afraid</em>.</p>\n<p>Afraid of <em>him</em>.</p>\n<p>Over the course of the week, Tenko had gotten to know Midoriya better. Midoriya was a hard worker and an honest person. Tenko appreciated that. At the beginning, he just couldn’t shake the fear that always seemed to take hold of him whenever he saw Midoriya’s face. Every time Tenko met his eyes, all he could see was Aizawa yelling at him to <em>run </em>before having his face smashed to the floor by the nomu’s claws and Midorishi laughing <em>and laughing and laughing</em>—</p>\n<p>That wasn’t fair to Midoriya. He was his own person.</p>\n<p>Whereas Midorishi bared his teeth in a grin, Midoriya offered kind smiles. He cried when he was stressed, muttered when he thought of stuff. He blushed when complimented and stuttered when nervous. He was an amazing fighter from what Tenko had caught glimpses of during the times when Aizawa would take him out to the field for a spar. He was light on his feet, a quick thinker and always ready to lend a hand. He was every bit as dedicated, as kind and as honest as the Symbol of Peace should be.</p>\n<p>Tenko wondered how his world was fairing after losing their symbol. </p>\n<p>(“I thought I would be home by now,” Midoriya had confessed to him one night, tired and anxious after a long day of working to get UA up and running again.</p>\n<p>“Do you miss it?”</p>\n<p>“Always.”)</p>\n<p>There were no current leads on how to get Midoriya home. So far all they knew is that if All for One brought him here, then All for One could send him back. There was just the tiny little problem that it was <em>All for One</em>. Obviously, that wasn’t going to happen any time soon. With the ongoing undercover police investigation, there were constantly officers wandering the halls of UA, hoping to find anything that could help the situation. Tsukauchi-san was a frequent visitor.</p>\n<p>Yet, despite the chaos that the last week had brought, the school was still eerily silent without all the students around.</p>\n<p>Ah, well, it was fine. They’d be coming back soon anyways.</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>Shimura Tenko was different.</p>\n<p>This should have been obvious the moment Izuku realized he was in a parallel world but separating someone that looked exactly like his old enemy has hard. He looked at Tenko and saw Shigaraki. He looked at Tenko and he was suddenly back at USJ, watching as Aizawa-sensei’s elbow was disintegrated. He looked at Tenko and he was back on the roof of UA huddled around his beaten and broken friends, watching as Japan burned.</p>\n<p>He looked at Tenko and saw every little thing that Shigaraki ever did to him.</p>\n<p>That wasn’t fair to Tenko. He was his own person.</p>\n<p>Izuku tried. He tried <em>so hard </em>to see them as different people. The first day hadn’t gone so well when Tenko tried to wake him up, but Izuku was determined to make it right. He wanted to see Tenko for the hero that he would become, not for the villain that his counterpart was.</p>\n<p>For the following week, Izuku did everything he could to amend his mistake. Mirio wasn’t around much to mediate, so this was a problem they were going to have to fix by themselves. It took a while—Izuku was struggling with his own problems and Tenko was still wary of him, but it improved little by little. By the end of the first day at UA, Tenko didn’t turn the opposite way when he saw Izuku in the halls. By the fourth, Tenko greeted him back enthusiastically. On the fifth, they held a rather animated conversation about the hero industry and, by the sixth day that Izuku had been transported to this alternate reality, Tenko laughed with him and he laughed with Tenko.</p>\n<p>They were still struggling, but they were getting better. Little by little.</p>\n<p>Now, with the dorms being completed and Monday fast approaching, Izuku worried. Making friends with Tenko had been just one of his many problems. He wondered what his friends were like in this alternate reality. Wondered how he was going to fair being trapped in a place where everyone thought he was a villain. Worried about his world. He wondered how people were taking his absence. He missed his <em>own </em>friends and <em>his </em>mom and <em>his </em>All Might and <em>his </em>job.  </p>\n<p>The first week came and went without any leads but Izuku was still absolutely determined to find his way home.</p>\n<p>If he had to defeat All for One <em>again </em>to do it, then so be it.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>The dorms loomed above Tenko.</p>\n<p>He had watched them be built for the last week but standing here, surrounded by the excited chattering of his classmates, was a different story. Summer camp and, subsequently, Kamino was still fresh on their minds, but the dorms were a new start. A better beginning.</p>\n<p>He glanced around. His classmates were spread around the outside courtyard, having just been scolded by Aizawa-sensei for the entire Kamino incident. It was harsh and probably deserved, but Tenko didn’t regret it. Out of the entire rescue group, Iida and Momo were the only ones we really seemed to be feeling any sort of remorse. Bakugo mostly looked pissed off, which wasn’t unusual for him.</p>\n<p>Speaking of Bakugo, he was currently surrounded by Kaminari, Ashido, Sero, Kirishima and, surprisingly, Jiro. Bakugo only had a light suitcase compared to Todoroki and Momo, who had about fifteen different bags piled around the two of them. Tenko wondered how, exactly, they were planning on decorating their dorm rooms. Around him, Uraraka was trying to rope Iida into a conversation while Asui was staring at him from her spot next to Aoyama. Shoji and Tokoyami seemed to be content in their self-imposed exile under the shade of a nearby oak tree. Ojiro, Sato and Kouda were talking (or signing, in Kouda’s case) to each other quietly. Tenko couldn’t exactly tell where Hagakure was, with her being invisible and all, but he assumed she was around somewhere.</p>\n<p>He wondered how they were going to react to Midoriya, but Midoriya was nowhere to be seen—Aizawa-sensei pulled him away two hours ago and he had yet to return.</p>\n<p>“Alright, this is gonna be <em>SICK</em>,” Kaminari said suddenly, throwing his bag over his shoulder. He threw open the dorm door and walked inside. Not two seconds later, the door opened again and Kaminari promptly rushed back out and down the steps, looking rather terrified. “Midorishi Izuku is in our dorm.”</p>\n<p>Ah, so that was where he went.</p>\n<p>“<em>WHAT</em>?!” most of the class shouted.</p>\n<p>“ISNT THE ENTIRE POINT OF THE DORMS TO <em>KEEP HIM OUT</em>?!” Kirishima cried.</p>\n<p>Bakugo grinned something fierce. Small explosions went off in his hands and he rushed up the steps to the dorm. If it had been any other person, Tenko would have worried but Bakugo was tough. Plus, he’d had the most experience with Midorishi out of all of them. Rescued from being kidnaped a week ago? No big deal to him, apparently. He was the only one who would <em>willingly </em>pick a fight with a super villain.</p>\n<p>“Bakugo, wait<em>, no</em>—” Ashido tried to stop him, but it was too late. Soon, the entire class rushed after him because they were <em>heroes </em>and that’s what heroes did. Tenko really shouldn’t laugh but…he followed the others inside. Asui is the only one that stopped to stare at him when he entered the dorm and couldn’t hide his smile.</p>\n<p>Yep, there was Midoriya, sitting on the couch next to Aizawa-sensei while his entire class gawked. Midoriya flashed them all a smile. Tenko swore he heard Tokoyami gasp.</p>\n<p>“Uh?” Hagakure said, her gloved hand pointing to Midoriya. “Aizawa-sensei?”</p>\n<p>“What?” Aizawa said and then downed his entire cup of coffee like it was a shot.</p>\n<p>Aizawa was definitely fucking with them.</p>\n<p>“Isn’t that, uh, Midorishi Izuku?”</p>\n<p>Aizawa raised a single eyebrow. He glanced at Midoriya, who shrugged, and then said, “No.”</p>\n<p>Tenko thought the assorted looks of confusion on his classmates’ faces were hilarious. Midoriya sure as hell <em>looked </em>like Midorishi. He was missing the scar on his face and the dirty villain clothes that he usually wore, but if Tenko didn’t know better, he would’ve said they were the same person.</p>\n<p>Aizawa took pity on them and explained, “This is Midoriya Izuku. He’s from a parallel world where he’s a hero and was in this class when he was a student at UA. He was brought here on accident by the villain that All Might fought in Kamino and is staying here until he figure out how to send him home.”</p>\n<p>“Isn’t that,” Sero paused as if looking for the right words. “A load of bullshit?”</p>\n<p>“No, it’s true,” Tenko stepped in. His class looked at him in surprise while Midoriya gave him a grateful look. “I’ve been with him for the past week. He’s not Midorishi.”</p>\n<p>Midoriya took over from there, “Sorry to barge in here, Aizawa-sensei wanted to introduce me since I’ll probably be around here for a while. For now, I’ll be staying at UA until a way to get me home is found.”</p>\n<p>“Where’d you get those scar on your arms?” Uraraka said and then clamped a hand over her mouth like she couldn’t believe she said that out loud.</p>\n<p>Midoriya didn’t seem to take offense. If anything, he looked rather abashed, rubbing the back of his head sheepishly. “I shattered my arms too many times.”</p>\n<p>Uraraka stared at him, eyes wide. No one else was much better, not having any idea how, exactly, to respond to the situation. Tenko was pretty sure if this kept up, someone was going to pass out.</p>\n<p>Aizawa stood up from the couch and stretched. “I’m going to sleep. Midoriya, your room is on the fourth floor to the left of mine. Don’t kill each other.”</p>\n<p>“Aizawa-sensei, it’s one in the afternoon,” Asui said. Aizawa continued to walk to the elevator, not bothering to respond to her.</p>\n<p>“Wait a second,” Midoriya said in alarm. “Aizawa-sensei, I thought I was sleeping in the main building?”</p>\n<p>“We’re still getting it ready,” Aizawa said and pressed the elevator button. The elevator opened with a <em>ding </em>and Aizawa stepped inside. “You used to live here right? It’s fine. The door is open.”</p>\n<p>Midoriya stared at Aizawa like he’d grown a second head. “What have I been sleeping in for the past week?”</p>\n<p>“Don’t worry about it,” Aizawa said just as the elevator door closed.</p>\n<p>Tenko stared at Midoriya who shot him a look of panic. If anything, Midoriya looked just as alarmed as the rest of the class. He glanced around the room, his eyes pausing on Bakugo and Todoroki. Tenko was pretty sure that Ashido was leaking acid from her fingers.  </p>\n<p>“Uh,” Midoriya said. “Hi.”</p>\n<p>It took all of five seconds for Bakugo to get over his shock and attack.</p>\n<p>Had it had been anyone else, Bakugo’s attack would’ve lead to a series of explosions to the face, but Midoriya was fast. He flung himself over the back of the couch, landing in a crouch. Bakugo catch himself and corrected his momentum, using it to launch another attack right where Midoriya stood. Midoriya dodged yet again, just as Bakugo left a nice charred mark in the middle of their new dorm floor. This continued for another good minute; Midoriya dodging and Bakugo attacking and destroying various new parts of the furniture. All the while, Midoriya never once used his quirk. He didn’t seem mad—or surprised, even. If anything, he looked resigned as he took explosion after explosion.</p>\n<p>“<em>Fight me</em>, you lying sack of shit!” Bakugo snapped. Midoriya used a pillow to muffle the next explosion. The pillow turned into a pile of ash.</p>\n<p>Tenko thought that <em>maybe </em>he should stop them, but one look at the intensity of the explosions Bakugo was giving off quickly changed his mind. He didn’t really feel like visiting Recovery Girl tonight.</p>\n<p>Besides, Midoriya seemed like he had it covered.</p>\n<p>Bakugo lashed out with a right hook. Instead of dodging it like he had the previous times, Midoriya caught the fist in his hand and sighed. “Kacchan, please <em>do not</em>.”</p>\n<p>“<em>KACCHAN</em>?!” Bakugo spat and yanked his hand free. He snarled, teeth showing like an animal. The explosions that sparked in his palms grew and Tenko just had enough time to think<em>, huh, </em><em>maybe they would be rebuilding the dorms </em>before Bakugo lashed out and—</p>\n<p>Nothing happened.</p>\n<p>Bakugo’s fist was not even two inches from Midoriya’s face yet there were no explosions, no fire. Bakugo tore his hands away and tried the same move again with the same result. He stared at his hands as if trying to light them but nothing seemed to be working.</p>\n<p>“What,” Bakugo said, glaring at Midoriya with as much malice as he could muster. “Did you <em>do</em>?!”</p>\n<p>Midoriya had long since stopped paying attention to Bakugo. He was staring somewhere behind Bakugo, near the elevators and—oh.</p>\n<p>“That was <em>me</em>, Bakugo,” Aizawa said. The entire class, who had been watching the skirmish like an interesting (albeit confusing) tennis match, turned to look at their teacher in surprise.</p>\n<p>Aizawa stood in the corridor of the dorms in nothing more than his pajamas, hair floating, eyes red and quirk activated. There was barley contained fury on his face and, for a moment, Tenko almost pitied Bakugo. “What part of <em>don’t kill each other </em>do you not understand?”</p>\n<p>It was going to be a long day. </p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>It was, officially, the morning before the first day of class since the incident at Kamino.</p>\n<p>The previous day had been chaos. Tenko’s class was still wary of Midoriya and Midoriya didn’t seem to know how to make the situation better. Bakugo couldn’t go within two meters of Midoriya without explosions lighting up his palms. Todoroki iced over his left side and hadn’t let it melt. Kaminari sparked whenever Midoriya rounded the corner. Aoyama fiddled nervously with his belt. Iida carried around his helmet. Jiro hadn’t taken off her amplifiers since yesterday afternoon.</p>\n<p>They expected an attack. </p>\n<p>Tenko tried his best to assure them, but he personally knew how hard it was. He had a week to talk to Midoriya, to make peace with him. A week of getting to know him, of having friendly conversations. A week getting to know that Midoriya Izuku was <em>not </em>Midorishi. His classmates didn’t have that time or luxury.</p>\n<p>So it really wasn’t a surprise when Ashido dropped her mug in shock as Midoriya stumbled down the dorm steps that morning before class started.</p>\n<p>Midoriya seemed to either not notice or not care as he made his way to the kitchen. Tenko’s classmates gave him all a wide berth. Sato moved from his position near the kitchen counter to sit at the table. Iida leaned a little closer to Uraraka. Bakugo aggressively downed his entire cup of coffee with a snarl on his face.</p>\n<p>Midoriya poured himself a bowl of cereal, seemingly in a daze. His hair wasn’t brushed and he was still in his pajamas. He blinked sleep out of his eyes.</p>\n<p> “I say he’s a good actor,” Kaminari said, loud enough so that everyone at the table could hear him but not loud enough for Midoriya to overhear. “A parallel dimension is bullshit.”  </p>\n<p>Kaminari looked over at Midoriya. The rest of the class turned to look as well.</p>\n<p>They had just enough time to watch him stumble over to the other side of the kitchen, slam his face into the wall and drop his cereal on the ground with a <em>clang. </em>The bowl broke on impact. Milk was starting to spread everywhere. Cheerios littered the dorm floor.Midoriya stared down at the broken bowl and food that lay waste on the ground and sighed. Tenko had seen heroes fighting villains with less defeated expressions than the one on Midoriya Izuku’s face at that very moment.</p>\n<p>Midoriya looked like he was about the cry.</p>\n<p>His classmates stared, unsure what to do.</p>\n<p>“Are—” Kirishima said but hesitated. He seemed to realize that he was speaking to <em>Midoriya </em>but grimaced and pushed on,  “—are you okay?”</p>\n<p>“I... am very stressed,” Midoriya said without looking up from his lost cereal.  The entire class just watched as Midoriya Izuku stared down at the shattered remains of his breakfast and tried not to cry.</p>\n<p>Kirishima turned to Kaminari. “I don’t think he’s acting, dude.”</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Izuku dropped his cereal.</p>\n<p>That was the start of his morning. Really, it was just the straw that broke the camel’s back. He’s been holding in a breakdown for the past week but then he <em>dropped his cereal </em>and suddenly he just wanted to curl up in a ball and just <em>stop</em>.</p>\n<p><em>Stressed </em>was an understatement.</p>\n<p>He missed his home, missed his friends. Missed walking into the dorm and not having the younger-versions of his friends stare up at him like he was a villain. He missed his agency, his city. Missed being able to walk down the street without having to cover up his entire face in fear that the police or another pro-hero would see his face and assume he was a villain. He missed being a hero. He missed his All Might, he missed his apartment, missed his mom.</p>\n<p>All of it just felt like <em>too much </em>yet not enough. A week in and he was no closer to going home than the moment that he was brought here.</p>\n<p>Stupid All for One and his stupid quirk.</p>\n<p>Aizawa was a help. Mostly it was just good to see a familiar face that didn’t treat him too differently. Aizawa never once treated him like he would snap. Aizawa didn’t hesitate to call him out when he found himself lost in thoughts. He was supposed to help Aizawa with his classes until he could return home—a way of repaying UA for housing him.</p>\n<p>He hoped that helping Aizawa with classes would ease his homesickness.</p>\n<p>It only made it worse.  </p>\n<p>The younger versions of his friends stared up at him in fear. Izuku couldn’t move an arm without one of them flinching or leaving the room. Yaomomo had been so surprised seeing him in the dorm hall last night that she popped a matryoshka doll right out of her stomach.</p>\n<p>It had calmed down since the morning. First period was better. Aizawa definitely helped alleviate some of the wariness of the class as well as being surrounded by several other pro-heroes on the UA payroll.</p>\n<p>But <em>better </em>didn’t always mean <em>fixed</em>.</p>\n<p>Yesterday had… not been good. If he was being honest, Izuku expected Kacchan to attack. He would have been more surprised if Kacchan <em>didn’t </em>try and hurt him in some way. Especially pre-hero teenager Kacchan who didn’t know how to manage his anger and liked to resort to using his quirk in situations that he <em>definitely should not use his quirk</em>. Uraraka stopped breathing whenever he entered the room and not in a good way. Iida was avoiding him. As for the rest of his classmates, their reactions had been surprising but understandable. Izuku had clung to the hope that he <em>wouldn’t </em>scare them in some way, but that hope was flushed away as soon as Kaminari had first rushed out of the dorms.</p>\n<p>Seeing Todoroki Shouto, though, was like a punch to the gut.</p>\n<p>He was just so <em>different. </em>Izuku could tell from the moment he first entered to dorm. This Todoroki was just as cold and indifferent as Izuku’s Shouto when he started his first year of UA, determined to get to the top without making friends. Determined not the use his abusive father’s quirk. He separated himself from the others, didn’t talk to anyone. He didn’t smile, didn’t crack a joke. His eyes were indifferent, unfeeling.</p>\n<p>He didn’t use his left side.</p>\n<p>Izuku thought of his Shouto—thought of the way he accidently froze his burger during their shift not four weeks ago. Thought of the time where they stood on the podium, graduating together after three long years. Thought of the rooftop of UA. Thought of their first time facing off at the Sports Festival all those years ago.</p>\n<p>\n<em>I thought you wanted to win? Dammit… So why are you trying to inspire me? Which one of us isn’t taking this seriously now? But I… want to be a hero too!</em>\n</p>\n<p>He wasn’t the only one who was different. Yaomomo was lacking the confidence she was known for. Uraraka wasn’t nearly as perceptive as his Ochako. Tenya was young and rough around the edges. He used his hands more than he probably should. All of them—Tsuyu, Tenko, Shoji, Kaminari, Kirishima, Ashido, Aoyama, Ojiro, Koda, Sato, Jiro, Sero, Tokoyami, Hagakure and even Kacchan. They were so <em>young</em>, only first-years at UA just experiencing hardship for the first time.</p>\n<p>They weren’t the people that he knew. Not yet.</p>\n<p>For the first time coming to this world, Izuku felt truly alone.</p>\n<p>Today was the first day of the new term, not that Izuku would be attending UA again. Aizawa was the one set to watch him so he, in turn, helped out where he could. Hero laws and ethics came easy to him. He’d taken far more math classes in his past years than he’d care to admit. He was fluent enough in English to deal with oversea hero negotiations.</p>\n<p>He never considered a job as a teacher but he could see why someone like Aizawa was drawn to it.</p>\n<p>Izuku still wasn’t fantastic at the whole ‘assistant teaching’ thing, but he was getting better. Perhaps this is what All Might felt like when he first took on a teaching job.</p>\n<p>(Izuku was determined not to teach like All Might.)</p>\n<p>The end of the day was fast approaching. Izuku was in homeroom, Aizawa having left for a meeting. Class 1-A was staring at him. He offered a small smile back. They were leery, but curious. Izuku could tell that being surrounded by the teachers of UA helped alleviate some of that lasting fear.</p>\n<p>It was a start.</p>\n<p>Ashido raised her hand. Izuku, not used to people asking to be called on, just stared at her. Ashido didn’t let that deter her and said, “What am I like?”</p>\n<p>Izuku half-expected it to be a question on hero laws, so he was thrown for a loop. “W-what?”</p>\n<p>“You know,” Ashido said and made a funny gesture with her hands. “The me from your world. What am I like?”</p>\n<p>Izuku looked at her and thought <em>young, innocent, bright eyed </em>but instead said, “Exactly the same but five inches taller.”</p>\n<p>“I grow? <em>Awesome</em>!”</p>\n<p>That was the start. Soon enough, the entire class was asking questions like <em>what am I like? </em>and <em>what changed? </em>and <em>how did we meet? </em>Midoriya slipped away from the podium so he could gather around the class. He missed this—the chaos that always seemed to surround his friends. He explained what he knew about them and their hero agencies. About their time at UA. About their friendship and battles and strengths. </p>\n<p>“My Tsuyu just expanded her agency in north Japan. It’s really cool! She’s helped a lot of people in the recent hurricane.”</p>\n<p>“Ocha—I mean, my Uraraka hit top ten six weeks ago because of her involvement in a villain attack that happened a while back. We threw a party to celebrate it. I’m really proud of her!”</p>\n<p>“Sato just opened up his own agency. I heard he was looking at taking on some of the UA kids after the first Sports Festival. There are some really awesome students this year.”</p>\n<p>The only ones who didn’t ask a single question were Tenko, who sat in the back and stared out the window, Todoroki, who looked like he would rather be anywhere but here and Kacchan, who glared at him with murderous intent.</p>\n<p>Izuku thought about what would’ve happened if he and Kacchan had been reversed—if Kacchan had been sent here instead of himself. Izuku thought of Kacchan’s explosive personality. Then thought of his alternate self. His <em>villain </em>alternate self.</p>\n<p>The problem would’ve been over before it even begun.</p>\n<p>He didn’t even realize he’d been staring at Kacchan until Kacchan slammed his hand on his desk. He snarled, small explosions lighting up his palms. “Why are you fucking <em>staring </em>at me, you creepy ass motherfucker?”</p>\n<p>Izuku rubbed the back of his head sheepishly. “Sorry, I was just thinking about my Kacchan. All for One should’ve brought him here instead.”</p>\n<p>A few snickered at the nickname. Kacchan glared at all of them. Todoroki didn’t even look up from his phone.</p>\n<p>“Why?” Kacchan’s lip curled. “So I could kick your ass?”</p>\n<p>“Kind of,” Izuku said which surprised Kacchan so much that he forgot to look angry.</p>\n<p>“Uh?” Hagakure said, confused. “Explain?”</p>\n<p>“If there’s anyone who would want to beat me up without consequences, it would be him,” Izuku said and meant it. “Then there would be one less villain in this world.”</p>\n<p>“That’s,” Kirishima said and paused. “That’s mildly worrying, dude.”</p>\n<p>Uraraka drummed her fingers on her desk, looking at Izuku with a strange expression. When he turned to look at her, she stopped. “Doesn’t it feel weird…speaking about yourself like that?”</p>\n<p>Izuku never once considered his counterpart to have any connection to him besides physical. Someone that hurt and killed for a living was no someone Izuku ever wanted to be associated with. Someone that worked under All for One was <em>definitely </em>not someone Izuku would want to be <em>anywhere near. </em></p>\n<p>“I like to think that myself and my counterpart are different people. Otherwise, it gets to me,” Izuku glanced at the clock in the classroom and almost fell out of his chair in alarm. He stood up, gathering his things. He was going to be late, if he stayed any longer. “Sorry, guys. I promised I would meet with All Might. I have to go.”</p>\n<p>As he rushed out of the classroom, he pretended not to notice when Sero slipped his phone from his pocket.</p>\n<p> </p>\n<p> </p>\n<p>When All Might called Izuku into his office, he half-expected to be scolded.</p>\n<p>He hurried down the halls, ignoring the looks of the students that passed him. He wore a hoodie over his head and a mask over his face. Being seen in 1-A was fine, they all knew, but walking around with the face of a villain in a hero school would only lead to trouble. As would announcing him to the entire school because then it would get out into the general public and…well, Izuku didn’t really want to think about that. It would be bad.</p>\n<p>He had no doubt that his counterpart would take advantage of that, if it were to happen.</p>\n<p>So he stayed a secret except to a handful of people and, in return, he got to wander the halls like a weirdo. It was fine, really. Wandering the halls of UA without being recognized was nostalgic. He remembered when he first came here so many years ago and his ambitions and dream. This place was his starting line, a place where he learned and grew into the person he was today.</p>\n<p>His feet took him straight to All Might’s office without having to think about it. He’d made the journey from Class 1-A to the office more times that he could remember. The large, wooden door was familiar and comforting. He knocked three times.</p>\n<p>“Come in!” a voice shouted from the inside.</p>\n<p>Izuku opened the door and stepped in. The door shut behind him while Izuku took off his facemask and lowered his hoodie. “All Might? You wanted to talk to me?”</p>\n<p>All Might smiled at him from his place on the couch. He gestured to the empty seat in front of him. Izuku took it without hesitation. “Yes. Sorry this took so long to set up. I meant to call you here when the students were still gone.”</p>\n<p>“I understand. These past few days have been a lot. How are you doing? Are your wounds okay?”</p>\n<p>All Might looked at him strangely, as if he didn’t except Izuku to worry. <em>Tough luck</em>. Izuku always worried about everything.</p>\n<p>All Might looked down at his bandaged arms. “I healed a while ago. You interrupted the fight before All for One could making any lasting injuries.”</p>\n<p>“That’s good,” Izuku said. That was better than what happened in his world. He won’t ever forget sitting in the waiting room, wondering if All Might would make it out alive. Waiting long hours in the hospital while All Might healed. That fight had been brutal. Even though it happened years ago, Izuku still remembered how drained they had all felt, both mentally and physically.</p>\n<p>He would never forget All Might’s words. <em>You’re next</em>.</p>\n<p>“At the police station,” All Might said and Izuku snapped his attention back to his kind-of-but-not-really mentor. “You called Tenko <em>Shigaraki</em>.”</p>\n<p>Ah. So that’s what this was about. Izuku bit his lip, twisting his hands nervously in his lap. “Oh. Uh, yeah.”</p>\n<p>All Might sighed. Izuku expected him to ask <em>how did this happen? </em>or <em>why is Tenko a villain</em>? Instead, he looked at Izuku with the eyes of a man who has seen too much and asked, “Why wasn’t I there for him?”</p>\n<p>That wasn’t what he’d been expecting.</p>\n<p>Izuku thought of how devastated his All Might had been when he found out the news. How he had hunted down any information that he could. How he had hesitated in the final battle, something that almost cost his life. His All Might regretted it enough, despite doing everything in his power to save everyone.</p>\n<p>Izuku, of all people, knew that sometimes that wasn’t possible.</p>\n<p>“I don’t know the whole story,” Izuku said. He launched into what he knew from Gran Torino and All Might. About how Shigaraki had been with All for One since a young age. How All for One <em>rescued </em>(which was a loose term) him. He took Shigaraki at his lowest point and built him up in All for One’s own image. Manipulation, lying. Taking broken people and making them <em>more</em>.</p>\n<p>“All for One has always been good at that,” Izuku said. “Turning people that felt useless into something he felt was useful. He knew who he was going after when he did it. That wasn’t random.”</p>\n<p>All Might sighed, leaning back in his seat. “I feel like I failed him.”</p>\n<p>“You didn’t,” Izuku said sharply. He tried to forget the haunted look in his mentor’s eyes after the July Attacks. The guilt was with him, even then. “And neither did my All Might. He once told me that my heart was too big, that I couldn’t save everyone. He said that if I focused on all the people that I couldn’t save, then it would destroy me. I like to think that he learned that from himself. All Might, you can’t save everyone and you can’t let it hurt you when you don’t. Shigaraki might have been too late to save, but there are still people out there that need you. People that are living and breathing and full of life. <em>Mirio </em>still needs you. <em>Tenko </em>still needs you. Your students and family and friends still need you.”</p>\n<p>There was silence in the room. Izuku clenched his fists so hard that his nails dug into his skin.</p>\n<p>All Might stared at him but there was a hint of a smile on his lips. He looked so, so tired but also strangely relived. “I know what he saw in you.”</p>\n<p>“What?”</p>\n<p>“My counterpart,” All Might said. This was the first time someone looked at him like that—warmth and kindness and friendliness. Izuku hadn’t realized how much he missed not being treated like a timebomb. “I know what he saw in you.”</p>\n<p>“You do?”</p>\n<p>“Yes. I’d like to think I see it too.”</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>“I got it!” Sero shouted the moment Midoriya left the room to meet with All Might. Tenko stared at the object; square and black and familiar.</p>\n<p>Midoriya Izuku’s phone was held up like a trophy.</p>\n<p>“You didn’t,” Hagakure said but she sounded more excited than angry.</p>\n<p>Iida, however, was not as excited. He tried to snatch the phone from Sero but Sero held it just out of his reach. “That is theft! You should return it immediately. UA students shouldn’t engage in such behavior. It’s a bad representation and you could be in a lot of trouble if you were to be caught!”</p>\n<p>They didn’t have much time to debate the ethics of stealing and attempting to look on someone’s personal device before Aizawa came to teach the last class of the day. The students quickly scurried to their seats and Sero inconspicuously pocketed the phone so no one else would see.</p>\n<p>Tenko had to admit, he was curious. Midoriya’s phone didn’t work, obviously, but it still had all his pictures and contacts from his world. He wondered what the Symbol of Peace kept on his phone. Yeah, stealing wasn’t great. In fact, it was <em>really </em>bad but Tenko’s curiosity far outweighed his guilt.</p>\n<p>Class passed agonizingly slowly.</p>\n<p>The moment Aizawa walked out of the room and the bell rung, half the class had already gathered around Sero’s desk. Todoroki and Bakugo didn’t move, but they also didn’t leave, either. Sero pulled out the phone like it was a winning lottery ticket and pressed the home button. To the surprise of almost everyone, it unlocked without a passcode. Sero locked the phone again right after.</p>\n<p>“I saw him use it earlier,” Sero explained. “When he went to check the time. He opened it. Didn’t have a passcode or anything.”</p>\n<p>“Isn’t that a little unsafe?” Ojiro asked.</p>\n<p>“Depends on what he has on it, I guess,” Sero said in return. Right as he was about to unlock the phone again, the door opened. Sero pocketed the phone immediately. </p>\n<p>Midoriya poked his head in not a moment later. “Did I leave my phone in here? I can’t seem to find it.”</p>\n<p>“Nope,” Sero said and tried for his best convincing smile.</p>\n<p>Midoriya eyed them all, crowded around a single table looking like a deer caught in headlights. Tenko thought they probably looked ridiculous. “I probably left it in All Might’s office then…What are you doing? Class is over.”</p>\n<p>“We’re doing a homework session,” Sero lied. “We don’t understand Present Mic’s assignment.”</p>\n<p>Midoriya looked at Sero in a way that made Tenko think that they were <em>so busted</em>, but to his surprise, Midoriya didn’t question them further.</p>\n<p>“Let me know if you find it, okay?” Midoriya said and then left the room without another word.</p>\n<p>Beside Tenko, Hagakure breathed a sigh of relief.</p>\n<p>Sero pulled out the phone again. They crowded around to look.</p>\n<p>“Isn’t this a violation de la vie privacy?” Aoyama asked.</p>\n<p>“Yeah,” Ashido said. “But he’s like a <em>mega </em>villain.”</p>\n<p>“<em>He’s </em>not a mega villain,” Tenko said in defense. “Midorishi is.”</p>\n<p>Even the slight comparison of the two made Tenko’s skin crawl. Midoriya and Midorishi weren’t comparable. Midoriya was kind and honest and helped out around UA whereas Midorishi broke people’s bones for fun and continuously put his teachers into the hospital.</p>\n<p>“Midoriya does not have the same darkness within his soul,” Tokoyami commented. Tenko found himself nodding even though he could only understand Tokoyami about fifty percent of the time.</p>\n<p>“Exactly,” Sero grinned like they all proved his point. “What was he like? He said he knows us and went to UA! How different is his world? I just want to know.”</p>\n<p>Sero pressed the home button. Instantly, his screen light up. His home screen was a picture of four people—Todoroki, Uraraka, Iida and Midoriya himself—all crowded around a building that Tenko didn’t recognize. They looked happy, with Uraraka smiling so big that her eyes were closed. She was giving Midoriya and Todoroki bunny ears. Midoriya was mid-laugh. Even Todoroki, who Tenko hadn’t seen use more than two emotions in his entire time at UA, was smiling. He looked at his friends like they had hung the stars in the sky. Iida had his arm wrapped around Uraraka’s shoulders, a proud smile on his face. Tenko had never seen his friend so relaxed before.</p>\n<p>Tenko didn’t think he’d ever seen Midoriya that happy, either. He wondered what he was like, surrounded by a group of friends rather than people who treated him like an almost-villain.  </p>\n<p>“Hey, Todoroki, you’re in his home screen,” Kirishima said. Todoroki looked up from his phone with a frown but walked over anyways. Tenko counted it as a silent victory that they even got Todoroki to come over in the first place.</p>\n<p>“Is Todoroki smiling?” Asui asked.</p>\n<p>“Scary,” someone said. Tenko couldn’t see who it was, too busy stifling his laugh. Todoroki didn’t respond, too busy staring at his alternate self on the phone screen.</p>\n<p>Sero clicked his photos and navigated to his favorites. There were hundreds there from a picture of Midoriya and that gen-ed kid (Shinso? Was that his name?) at a cat cafe to various pictures of the class, all laughing and seemingly having a good time. There were an assortment of pictures and videos from the Sports Festival. Pictures of the dorm, of an apartment that Tenko didn’t recognize. Pictures of All Might. Todoroki, Uraraka, Iida and Shinso seemed to be in the most pictures. Bakugo and Kirishima also made several appearances. There were, overall, at least several pictures of everyone in the class.</p>\n<p>Except for Tenko. He wasn’t really surprised but it didn’t stop the guilt from curling in his stomach.</p>\n<p>“Wow, Todoroki, you’re in a lot of these,” Uraraka commented. Tenko wondered how Midoriya got someone like <em>him </em>to open up, let alone become friends. </p>\n<p>Todoroki raised an eyebrow. “You and Iida are in more than I am.”</p>\n<p>Uraraka paused, thinking. “Yeah but you’re…..”</p>\n<p>“Not a cold-hearted asshole?” said Kaminari who had a death wish. Todoroki stared at him until he wilted back into his seat.</p>\n<p>“Hey, isn’t that the purple haired brainwashing kid from the Sports Festival?” Jiro asked, taking the phone from Sero and swiping back to the picture of Shinso. Tenko was <em>sure </em>that was his name, but he honestly didn’t remember much about him from their fight. That had been brutal.</p>\n<p>“Yeah, that’s him alright,” Bakugo snapped. Tenko was surprised that he even came over. Especially given that Tenko didn’t notice when he did. “What the fuck is that piece of shit doing here?”</p>\n<p>No one really had a response to that. Tenko didn’t know much about the guy past their battle at the Sports Festival (where Tenko lost) and his declaration of war beforehand. He only knew the guy was determined to be a hero. Maybe he succeeded?</p>\n<p>Sero flipped to Midoriya’s last text messages to see if there was an answer there. The first text message was from Todoroki, who was labeled “Shouto” in Midoriya’s phone. Tenko was not the only one surprised by that. Naturally, curiosity got the better of them and Sero clicked to read his last text messages.</p>\n<p align=\"center\">\n<strong>Shouto</strong>\n</p>\n<p>Last Monday, 12:34pm</p>\n<p>You're late.</p>\n<p align=\"right\">Last Monday, 12:37pm</p>\n<p align=\"right\">youve been late the last three times, shouto</p>\n<p align=\"right\"> </p>\n<p>Aren't you the one one who's always harping about us being on time?</p>\n<p align=\"right\">absolutely not thats tenya</p>\n<p align=\"right\">anyways im almost there!! just hold on !! ଘ(੭*ˊᵕˋ)੭*</p>\n<p>Last Monday, 12:42pm</p>\n<p>Please don't ever use that face again.</p>\n<p align=\"right\">(っºДº)っ</p>\n<p>Last Monday, 12:46pm</p>\n<p>Izuku.</p>\n<p align=\"right\">do whatever u want five peepee man</p>\n<p>I regret ever telling you that story.</p>\n<p>Hurry up. People are starting to stare.</p>\n<p> </p>\n<p>“They seem…close,” Yaomomo commented. Tenko huffed out a disbelieving laugh. He didn’t think <em>anyone </em>could be <em>close</em>to Todoroki, but this seemed to prove otherwise. Todoroki stared at the phone and if Tenko didn’t know any better, he would’ve said Todoroki was <em>curious</em>. He wondered what changed in Midoriya’s world. Why Midoriya’s Todoroki seemed to actually <em>show emotion</em>.</p>\n<p>“He called Todoroki Shouto, son of Endeavor and one of the few students to get in on recommendations, Five Peepee Man,” Hagakure said, dumbfounded.</p>\n<p>Tenko noticed Todoroki flinch. He didn’t stop to wonder why.</p>\n<p>Sero clicked on the next text message, from his mom. Tenko didn’t think their Midorishi even <em>had </em>a mom.</p>\n<p align=\"center\">\n<strong>Mom</strong>\n</p>\n<p>Last Monday, 9:38am</p>\n<p>I love you so much. I’m so proud of you. I’ll see you soon.</p>\n<p> </p>\n<p>Tenko bit his lip and tried not to feel bad. He knew that if he were the one to be sent away, he’d miss Mirio and Gran and All Might more than anything. He couldn’t even imagine himself in Midoriya’s position, isolated and alone in a world that hates him.</p>\n<p>Iida frowned at the phone. “I bet he misses all of them.”</p>\n<p>“I do.”</p>\n<p>Tenko whipped around so fast that he nearly fell out of his chair. Kirishima, however, wasn’t so lucky and went tumbling. The rest of the class stared in surprise as Midoriya Izuku leaned against the doorframe, arms crossed and a sad smile on his face. Sero gapped at him, trying to ask a question that wouldn’t come out.</p>\n<p>Midoriya only raised an eyebrow in amusement. “I’ve known all of you for over seven years. Sero, you're a terrible liar.”</p>\n<p>“Well, damn,” Sero said.</p>\n<p>“If you wanted to see my pictures, you could’ve just asked.”</p>\n<p>Sero handed over the phone, a little guilty. Midoriya took it and, instead of pocketing it and leaving like Tenko expected him to, opened his pictures again. He scrolled through some that Sero had overlooked earlier. He gave context, told stories of adventures and shenanigans. He seemed happy to share and the class asked as many questions as they could.</p>\n<p>“This is when Tenya, Ocha, Shouto and I opened our own hero agency,” Midoriya said and showed them the very same picture that was his home screen.</p>\n<p>There was a proud smile on his face, the very one that was echoed in the picture. He opened another picture of the entire class in graduation gear with medals around their necks. Some had bandages around their entire bodies. Midoriya himself was almost covered head to toe, but yet, they all looked incredibly joyous. Some even in tears, as they gathered around for their group shot.</p>\n<p>“This is when we graduated.”</p>\n<p>“They look happy,” Tenko found himself commenting.</p>\n<p>“We were,” Midoriya smiled. He then went through an assortment of other pictures. “This was third year Sports Festival. It was the first time I won. This was my 17<sup>th </sup>birthday. Everyone threw a surprise party in the dorms. This was first year Sports Festival. This was our first year Cultural Festival.”</p>\n<p>He flipped to a picture of the entire class gathered in a tiny apartment. All Might was carrying a cake around his students who were laughing and cheering as Uraraka held up her and Todoroki’s hands in victory. “This is the celebration when Ocha hit the top ten and Shouto got number three.”</p>\n<p>“Wait!” Ashido said and snatched the phone from Midoriya’s hands. She flipped to a picture that Midoriya had skipped over before handing it back. “What’s that?”</p>\n<p>“I have to admit,” Iida said. “I’m curious as well.”</p>\n<p>The photo wasn’t like the others. There were three people there—Uraraka, Iida and Midoriya. Their faces were covered in blood, sweat and ash. Dried tear tracks ran down both Midoriya and Uraraka’s face. Uraraka seemed to be supporting most of Midoriya’s weight. Iida’s hair was matted in grime. They looked like they went through hell.</p>\n<p>Yet, there were large, relived smiles on all of their faces.</p>\n<p>Behind them, the sun was rising and illuminating a smoke and ash covered land. It was something out of a horror movie; buildings were reduced to rubbed, fires were still flickering.</p>\n<p>They seemed to be on a roof. Tenko wasn’t exactly sure where. Uraraka, Iida and Midoriya weren’t alone. In the background, Todoroki could be seen helping Bakugo to his feet. Shoji was using crutches. Aoyama was laying on the floor. Tenko swore he looked dead. Asui was bandaging Sato’s bloody arm.</p>\n<p>“That…..that was directly after the war,” Midoriya said. He stared at the picture in his hands, hands clasped tight around the edges of the phone.</p>\n<p>“The war?” someone asked.</p>\n<p>Midoriya nodded, seemingly lost in thought. “During our last year at UA, we faced off Shigaraki Tomura and his army. We were at the center of the attack, of course, because we’ve been involved since the day they attacked USJ. The war…was hard. A lot of people died. But when the sun came up, we were still there.”</p>\n<p>Tenko tried not the cringe. His alternate-self seemed like a <em>really </em>terrible person.</p>\n<p>“Wow,” Ashido breathed.</p>\n<p>She was staring at the picture, almost in awe. The rest of the class fell silent. Even Bakugo didn’t say a word. He was too busy glaring himself and Todoroki in the background. Tenko would’ve loved to know what he was thinking.</p>\n<p>“…Why do you call Todoroki Shouto <em>five peepee man</em>?” Kaminari couldn’t hold his question in any longer.</p>\n<p>Todoroki glared at him. Tenko was mostly just surprised at the tone whiplash. After all, he also wondered what sort of thing Todoroki must have done to be called <em>five peepee man</em>.  </p>\n<p>Midoriya had to bit his fist to keep from laughing. Todoroki turned his glare to Midoriya. Midoriya, seeing everyone’s expressions, launched into his tale, “Well, you see, Shouto failed his provision exam due to some, uh, circumstances and was put in a remedial course with a few other people….”</p>\n<p>At the end of the day, Tenko found himself locked away in his dorm room, staring at his bare ceiling in thought. The first day had already been a whirlwind of surprises and emotions. He learned more that he thought he would—in hero class, about Midoriya. He almost wished he could see Midoriya’s world for himself. His friends and family, all of them seemed so <em>close</em>. When Tenko thought of all the people in 1-A, he could count the number of people he considered friends on one hand. The rest were just, well, classmates.</p>\n<p>It was different for Midoriya. Midoriya, who lit up when he go to talk about the very same people who Tenko could barely consider acquaintances. Who kept in contact with all of them well after graduation. He seemed close to all of them. To Midoriya, all of 1-A were all his friends.</p>\n<p>Tenko wondered why it wasn’t like that for them.</p>\n<p align=\"center\">\n<strong>NUMBER ONE HERO DEKU MIA?</strong>\n</p>\n<p>Over the last week and a half, hero Deku has made a surprising lack of appearances. Since the start of his debut during his third year of UA, Deku has been a constant presence in the hero industry. He rose to fame after the July Attacks, taking the lead and finally ending the League of Villain’s tyranny. He was one of the first to organize and contribute to clean up after the battle and was the representative of the notorious Class 1-A to calm the masses.</p>\n<p>Since then, he has been in the hearts of millions. He has made appearances every day for the last two years, which means it is easy to notice when he doesn’t show up. The last time his appearance was reported was last Monday, where he stopped a convince store robbery. He has yet to make an appearance since then. Fans and heroes alike are worried.</p>\n<p>“I really look up to him,” comments a second year in the UA heroics department. “He saved my life during the July Attacks. He was my reason to become a hero. I hope wherever he is, that he’s safe.”</p>\n<p>Reaching out to his agency revealed nothing. Heroes Uravity and Ingenium were not available to talk. Police currently are not giving out any information on Deku’s whereabouts. We reached out to his former classmates as well, but no one seems to have an answer.</p>\n<p>Is this the end for our Symbol of Peace?</p>\n<p> </p>\n<p>Comments: 245 (show less)</p>\n<p><strong>tinywee69: </strong>is any1 else like…..worried</p>\n<p><strong>dekuno1fan: </strong>this is hero deku were talking about guys. im sure hes just taking the week off and didn’t want villains to take advantage of that lol</p>\n<p><strong>uravititty</strong>: ahh man i miss deku!! i hope he turns up again soon!!</p>\n<p><strong>minuymu: </strong>deku disappeared before i could tell him that i would die for him</p>\n<p><strong>yaboyhero: </strong>multiple agencies &amp; the police won’t give information on deku’s health or whereabouts…that’s a little suspicious. i hope hes ok.</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>On the tenth day that Midoriya Izuku was missing, Bakugo burst into Shouto’s office.</p>\n<p>He slammed the door open with such force that it made a dent in the wall. The wind from the impact blew Shouto’s papers to the floor. Shouto tried not the be annoyed, he really did, but Bakugo has always been a pain in the ass and Shouto was <em>not </em>in the mood to deal with it.</p>\n<p>Besides, Izuku was more than half of Shouto’s voice of reason when it came to not pissing Bakugo off.</p>\n<p>Ochako rushed in moments later, looking out of breath. Kirishima and Tenya were both close behind. They, too, looked like they just ran a marathon.</p>\n<p><em>They probably chased Bakugo all the way up to the fifth floor of the building</em>, Shouto thought as he went to collect his case papers off the floor. Bakugo was glaring at him from the front of his office. He really didn't want to deal with this today. Kirishima was much better at dealing with Bakugo than he was. </p>\n<p>“Bakugo, you can’t just rush in here!” Ochako said sternly.</p>\n<p>Out of all the people in this room, Bakugo only listened to two of them. One, being Ochako who he’d been impressed with since the day she took him on during their first year Sports Festival, and Kirishima who had wedged himself into Bakugo’s life and never really left.</p>\n<p>Shouto, personally, couldn’t see <em>why</em> Kirishima would want to be friends with someone like Bakugo. Shouto could work with him on hero cases just fine; years of teamwork training and pure combat skilled helped with that. Any longer than that? No. Bakugo as a person, in Shouto’s humble opinion, was terrible. However, Ground Zero was number two hero for a reason.</p>\n<p>“I’m joining the fucking case, Icy Hot,” Bakugo snapped, ignoring both Ochako and Kirishima’s protests. He stood, in his hero outfit, tall and unwavering. His arms were crossed over his chest and there was a scowl on his face.</p>\n<p>Shouto raised an eyebrow, unimpressed. “Why?”</p>\n<p>Bakugo and Izuku’s relationship was…strange to say the least. Shouto didn’t understand it. What he <em>did </em>understand was that their relationship had improved drastically from when they were kids. Izuku once said that he saw Bakugo as something of a rival, even though Bakugo never had a chance at the number one spot.</p>\n<p>Not with his nasty personality, at least.</p>\n<p>Even so, the two didn’t really meet up outside of hero work and reunions. Kirishima was usually there to mediate those meetings as well. Shouto, for the life of him, couldn’t figure out why Bakugo was insistent enough to work on Izuku’s missing case that he flew in from his agency’s own city.</p>\n<p>Bakugo glowered at him. “I’m not about the be number one hero by <em>default</em>. You pulled that shit during the Sports Festival.”</p>\n<p>Ah.</p>\n<p>That would make much more sense than joining out of the goodness of his heart, yet, Shouto felt like something was off. Looking at Bakugo, Shouto could tell that there was more to it than that. Shouto has seen Bakugo competitive and angry. He'd seen Bakugo's drive firsthand during their first year when he refused to use his fire. He certainly was speaking the truth to some extent, but the look in his eyes…there was something more. Something that Bakugo wasn't saying. </p>\n<p>“That’s Bakugo’s way of saying <em>I’m really worried and I would like to help</em>,” Kirishima added on helpfully. Ochako snorted under her breath. Tenya looked like he was ready to kick all of them out of Shouto’s office.</p>\n<p>Shouto met Bakugo's eyes. The determination, the drive, the experience. All would help the case rather than hinder. Shouto found that he couldn’t say no.</p>\n<p>“Fine. This is all we have,” Shouto sighed.</p>\n<p>He slid the small case file that Naomasa had given him just days before over to Bakugo. Bakugo snatched it from the table and flipped it open. As he read the case file, his expression grew more and more incredulous. Had it been any other case, Shouto probably would've laughed. </p>\n<p>“You’re shitting me,” Bakugo said. He read the top of the paper with a scowl, looking over the witness reports. “This is a fucking <em>cold case</em>.”</p>\n<p>Shouto smiled bitterly, leaning back in his office chair. In his hand, Bakugo held the results of the countless hours that they had spent searching until they were too exhausted to continue. Just five little papers.</p>\n<p>“Welcome to the search, Ground Zero.”</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>“Hey! <em>Midoriya</em>!”</p>\n<p>Izuku whipped around at the sound of his name. Several of the students around him glanced at him curiously. Midoriya pulled his hoodie lower over his head, looking for the person that called him.</p>\n<p>When he spotted the alternate version of the blonde-haired senior that mentored him rushing over to him from the other side of the quad, he couldn’t help his surprise. “Mirio-senpai?”</p>\n<p>(<em>Yes</em>, it was weird calling someone younger than himself <em>senpai. </em>However, it was even more weird <em>not </em>calling Mirio senpai.)</p>\n<p>Mirio, apparently, thought the same thing as he rushed up to Midoriya with a grin. “That’s upper weird seeing your face and hearing you call me that! Tenko’s told me a lot about you but I haven’t really gotten to meet you other than the police station!”</p>\n<p>“O-oh! Right, uh,” Izuku fumbled over his words.</p>\n<p>People were starting to stare. Mirio seemed to notice and grabbed his arm, dragging him away. “Why don’t we go someplace private? I have a lotta questions to ask!”</p>\n<p>Izuku almost signed in relief. Someplace private, he could do. “Alright. I have an idea.”  </p>\n<p>Izuku lead Mirio away from the quad and back into the school. Mirio followed, surprisingly quiet. He seemed to be studying Izuku’s back as Izuku lead him through hordes of students until, finally, they arrived at a staircase towards the back of the building.</p>\n<p>Izuku spotted Mirio’s confused look and grinned. He walked underneath the staircase, looking for the small trigger…Ah, there it was.</p>\n<p>Izuku glanced around to make sure no one was close to them before pushing the trigger. A passage opened in the little tiny space behind the stairwell. Mirio gapped in surprise.</p>\n<p>“Come on,” Izuku said.</p>\n<p>The passage wasn’t long, but it was dark. As soon as Mirio and Izuku entered, the door slammed shut. Izuku took out his phone and turned on the flashlight, leading Mirio further into the tunnel. The tunnel was damp and cold, much like something you would expect out of a cheesy horror film.</p>\n<p>The last time Izuku had been in here, it had been filled with so much smoke that he could barely breathe. </p>\n<p>Mirio brushed his hands against the tunnel wall. “I’ve been here three years and I never knew about this place.”</p>\n<p>“You wouldn’t,” Izuku said. He remembered his own surprise when he was first in here. “It’s a transportation tunnel. We found it during the war. Well, more precisely, Nedzu <em>let </em>us find it during the war. UA is full of them, apparently.”</p>\n<p>Izuku could dimly see the door in front of them. It was old and worn, but it looked exactly the same as it did all those years ago. He pushed it open with some effort, letting the light shine in. He stepped outside, taking in the view of UA’s highest roof.</p>\n<p>The last time he’d been here, Japan had been on fire. Now, looking out at the vast expanse of his home, it was hard to even imagine. The distant chatter of the students, hundreds of feet below and they bustled from class to class. Izuku could see the train station, the office buildings. He could see homes and apartments full of people that were getting ready for their day. He could hear the train’s horn and the cars honking and the people laughing. Izuku couldn’t help but feel relieved. They <em>would </em>stop that future from happening.</p>\n<p>Japan didn’t have to burn for them to win.</p>\n<p>Mirio stood beside him. He was looking at students that bustled around, the train that just left the station. He almost looked wistful. He shot Izuku a joking grin. “We could have just gone to an empty office.”</p>\n<p>Izuku laughed. “This is cooler. And I figured, well, you should know. Just in case.”</p>\n<p>Mirio stared at him for a second before a somber smile took over his features. “Thank you.”</p>\n<p>They settle on the edge, feet dangling from the side. Hundreds of feet below, a group of students entered the building, laughing and screaming. Izuku watched them with a smile, thinking of his time here at the UA. A <em>lot </em>had changed since then.</p>\n<p>“So,” Mirio said, swinging his legs. “How’d you get One for All?”</p>\n<p>Izuku blinked in surprise. He, yeah, he should’ve guessed that was what Mirio wanted to talk about. He wouldn’t hesitate to admit that he had his own questions about it. How did One for All work with Mirio’s quirk? Did he combine the two or keep them separate? Does One for All allow for more control over his other quirk? Did the quirks cancel each other out? Did—</p>\n<p>Mirio cleared his throat. Izuku cut himself off with a blush. He hadn’t even realized he’d been muttering. “Sorry, I got distracted. I already told you about how I got One for All, during the interrogation.”</p>\n<p>“Yeah, but that was during an interrogation,” Mirio said brightly. “I want to hear it from you, personally. No police or mentors or teachers.”</p>\n<p>“Are you trying to spy on me?” Izuku asked, jokingly. Mirio grinned at him. He’d forgotten how much he missed talking to Mirio. Mirio was a bright, happy and honest person, someone that Izuku had always looked up to. It had been too long since he’d seen him. “I wasn’t supposed to, actually. In fact, Sir wanted you. He hated me at first.”</p>\n<p>Mirio laughed in surprise. “Sir did?!”</p>\n<p>“Yeah! I tried to intern with him...right around this time, actually. I’m assuming Tenko is going that route too?”</p>\n<p>“Yeah,” Mirio said. “Sir contacted him a little bit before Kamino. That’s weird that he hated you. He really loves Tenko.”</p>\n<p>“Tenko didn’t get One for All.”</p>\n<p>“Hmm. Alright, fair.”</p>\n<p>“To answer your question,” Izuku said and thought back to the first time he met All Might. That seemed like such a long time ago. “He saved me from a villain in middle school. I was quirkless at the time. I asked him if I could become a hero and he told me no. Later, Kacchan—uh, Bakugo Katsuki—was attacked by the very same villain that attacked me. All Might had used up his time already and I felt responsible. The heroes couldn’t do anything, but I rushed in anyways.”</p>\n<p>“You and Tenko are both so reckless,” Mirio said.</p>\n<p>“A lot of people tell me that,” Izuku said. “All Might offered me One for All directly afterwards. It felt like a dream come true. I’d always dreamed of being a hero. There were a lot of people that doubted me. All Might though….All Might always believe in me. Sometimes I feel like I could never live up to his expectations.”</p>\n<p>Mirio leaned back against his hands, looking up at the sky. There were birds circling above. Mirio looked like he were almost yearning to go up there, to be like those birds.</p>\n<p>“I think I know how you feel.”</p>\n<p> </p>\n<p> </p>\n<p>On Wednesday afternoon, Aizawa took all of 1-A and Izuku to Ground Beta.</p>\n<p>Izuku followed, a little uncertain. He’d spent the last week sparring against Aizawa in this very place to test where he was as a hero. The large, metal structures loomed above them. Class 1-A fiddled with their prototype hero outfits. Izuku, for the first time since he arrived, was decked out in his own. He tugged at his reinforced gloves when he noticed a few people in 1-A were staring at him. </p>\n<p> He knew was Aizawa was planning, but that didn’t mean he had to like it.</p>\n<p>Aizawa stopped them all about ten feet inside Ground Beta. He made the class get in a semi-circle before putting Izuku in the center of them. Not one to hate any time, Aizawa said, “Congrats. Today, you get to spar against a pro hero.”</p>\n<p>Izuku waved sheepishly. The class exploded.</p>\n<p>“Isn’t he the, uh, number ONE HERO?!” Kirishima said incredulously. Beside him, Ashido was staring at Izuku with wide eyes. Tenko looked hesitant. The others ranged anywhere from worried to excited to murderous (or, in Kacchan’s case, a weird mix of the last two).</p>\n<p> “Yes,” Aizawa said.</p>\n<p>“Um,” Hagakure said, sounding just the slightest bit panicked. Torodoki was eying him and Kacchan was grinning.</p>\n<p>“Think of it as a trade,” Izuku said, if only to calm them down a little. “I train you and you learn my fighting style. Since it’s a parallel world, my counterpart is bound to have similar styles. This could help you out in the future.”</p>\n<p>“You all have one hour,” Aizawa said. He held a stop watch in his hands. “Deku versus all of you. Time starts now.”</p>\n<p>He was rushed almost immediately by Kacchan and Todoroki. Kacchan went for his usual right hook and Izuku flipped him over his shoulder with ease. Kacchan spat in rage, flipping himself to his feet in the span of a second. Todoroki sent an entire ice wall at him. Izuku fired up One of All and blasted the wall into tiny little pieces with just a single finger.</p>\n<p>Izuku grinned and gave them all a two-finger salute. Then, he sprinted deeper into Ground Beta.</p>\n<p>“GET BACK HERE, <em>YOU FUCK</em>!” Kacchan hollered from behind. The rest of the class gave chase.</p>\n<p>It was only around thirty seconds into the exercise and Izuku could already tell that Todoroki didn't use his fire. At all. He’d known this for quite some time, but seeing his ice in action only cemented the fact in his mind. In fact, the Todoroki of this word reminded him of that kid he met his first year. The one that challenged him during their first Sports Festival. The one that was consumed by his hatred towards his father.  </p>\n<p>It made him sad.</p>\n<p>Shouto has been one of his best friends for years now. He’d been with him for almost everything—from the Hero Killer in Hosu to the end in the July Attacks. Izuku had watched him change (<em>helped</em> him change) into the person that he was today. The hero that offered his everything, that helped people without question. The type of hero who used <em>all </em>his power. The type of hero that Shouto had promised his mom that he would be.</p>\n<p>Another wall of ice cut Izuku off. He could’ve easily jumped over it, but stopped and waited. Todoroki, ahead of the rest of the class, cut him off. He looked down at Izuku with stone cold determination.</p>\n<p>“You can’t go on forever not using your fire,” Izuku called.</p>\n<p>Todoroki's eyes only became colder. He readied his fist for another ice attack. “What do <em>you</em> know?”</p>\n<p>“A lot more than you think I do, I bet,” Izuku said then promptly slammed Todoroki to the ground and out of the way. The rest of the class caught up in the few seconds that Izuku had exchanged with Todoroki. They surrounded him, pushing his back to the ice wall. Izuku spotted Aizawa watching carefully from one of the nearby buildings.</p>\n<p>Aizawa wanted him to teach them? Fine, he would teach them.  </p>\n<p>Kaminari sent a bold of lightning at him. Izuku dodged and immediately blocked an attack from Kacchan. The lightning hit almost ten feet from its original target. “Kaminari, instead of focusing on where the lighting is going, focus on how you want it to move! It’s the journey not the destination!”</p>\n<p>“The destination is kinda important!” Kaminari shouted back before sending another off-target lightning bolt.</p>\n<p>Kirishima lunged at him. Izuku caught his wrist, nailed him in the soft part of his stomach and sent him into Hagakure, who had been trying to sneak up behind him. “Kirishima, instead of focusing on hardening one part of your body, harden all of it! Hagakure, lighten your steps! I can still hear you!”</p>\n<p>Iida rushed at him, trying to knock him off balance. Izuku sent him tumbling into the dirt on top of Hagakure and Kirishima. They all groaned. “Iida, you need to be faster!”</p>\n<p>A noise came from behind him. Izuku barely had to turn to know how it was. He caught Kacchan’s fist before it could explode and held it tight. Kacchan snarled and struggled to get free. He sent Kacchan tumbling into the ground for a second time that day.</p>\n<p>Izuku grinned. “Kacchan, try not to be so predictable.”</p>\n<p>“<em>DON’T FUCKING CALL ME THAT!</em>” Kacchan hollered and steadied himself yet again.</p>\n<p>From there, it was only a matter of time before the rest of the class was out for the count. They were strong, they always had been, but Izuku had the advantage of One for All, his experience <em>and </em>knowing them all in the future. He knew all of their current moves, all of their habits, and all of the moves that they would come up with in the next few years. He’d worked with them as a team since they were all fifteen<em>. </em>Nothing they could do at this point would surprise him.</p>\n<p>It was, admittedly, a little unfair.</p>\n<p>At least, that’s what Izuku thought until he turned, only to see Tenko lunge at him. Izuku only saw bloodshot eyes and a man covered in hands reaching forward with five fingers. Izuku flinched so hard that he almost hit the ice wall, but quickly corrected himself. He sent a blast of air to knock Tenko off balance and quickly sent him to the dirt.</p>\n<p>Izuku tried to stop his ragged breathing. His heart was beating wildly. For a second, Izuku had only seen Shigaraki.   </p>\n<p>He pushed down his feelings and hid them with a smile. Tenko was not Shigaraki. He was not, he was not<em>, he was not—</em></p>\n<p>“Aizawa-sensei, <em>mon dieu</em>, this was a terrible idea,” Aoyama groaned from his place on the ground. He didn’t seem terribly inclined to get back on his feet. Aizawa looked like he was trying to fight a smile.  </p>\n<p><em>Aizawa is enjoying this too much</em>, Izuku thought.</p>\n<p>“He’s beating us by barely doing anything,” Jiro muttered, face full of dirt.</p>\n<p>Tsuyu picked herself off the ground and brushed dirt from his costume. She stared at Izuku critically. “It’s like he knows what we’re going to do.”</p>\n<p>“I do,” Izuku agreed. He ignored it when half the class groaned. “I’ve known you all for years. I know all your current and future moves. We've all sparred enough times that I know your styles as well.”</p>\n<p>“Then WHY are we doing this?!” Sero said, looking at Aizawa accusingly. A portion of his costume had ripped down the side. The rest of the class started picking themselves off the ground, preparing to attack once again.</p>\n<p>“You’re here to get better. Think of your advantages.” Izuku told them. He might have to help them here… “What’s one thing you have over me?”</p>\n<p>“<em>Skill</em>,” Kacchan snapped.</p>\n<p>Uraraka seemed to get it, though, and snapped her fingers in excitement. “Numbers!”</p>\n<p>Izuku fired up One for All. Only at fifty percent, but fifty percent would be more than enough here. “Right! What can you do with numbers?”</p>\n<p>The rest of the class seemed to catch on.</p>\n<p>Tokoyami said, “Teamwork.”</p>\n<p>Izuku grinned as he watched the class puzzle together a way to beat him. Maybe this is what Aizawa felt when teaching. Izuku couldn’t say he disliked it.</p>\n<p>“Then do it!”</p>\n<p> </p>\n<p> </p>\n<p>They didn’t win.</p>\n<p>It was to be expected, really. Izuku was <em>number one</em> for a reason and fighting against fifteen year old versions of his friends and his enemy...well, the fight wasn’t the hardest he’d had.</p>\n<p>The class was different. Not as in-tune as Izuku remembered being. Izuku remembered their teamwork being much more fluid than what Class 1-A showed him today. They had the experience, sure, but they weren't all there. They weren’t as close as he was with his friends.</p>\n<p>Izuku could see that with Todoroki and he could see that with Tenko, too.</p>\n<p>Really, Izuku excepted Tenko to be the most difficult. He rubbed the scars along his left arm, covering from his elbow down to his wrist. The skin was patchy and uneven from the skin grafts that had to be placed there. Izuku had always known Shigaraki as a savage fighter. Tenko was different. He had only directly approached once during the entire battle, in the beginning. After that, he seemed to stick with support. Offering help where he could. His quirk was dangerously effective at changing the landscape to suit him best, but Izuku noticed that he didn’t use his quirk very often. When he did, he hesitated.</p>\n<p>It was almost like he was <em>scared </em>of using his quirk.</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>The class ended. Izuku rushed after Todoroki without a second thought. He spotted him heading for the dorms, bag slung over his shoulder. He ignored anyone and everyone who approached him, quickly making his way through the crowd.</p>\n<p>“Todoroki! Wait up!” Izuku called.</p>\n<p>Todoroki only stopped to glare at him. “<em>What</em>?”</p>\n<p>Izuku couldn’t help but compare this Todoroki to his Shouto. The mannerisms, the anger, the fear. All of it was so familiar, yet so different.</p>\n<p>“You are not your father. Your fire is not your father’s quirk. Who you are and what you do with your own quirk is up to you,\" Izuku offered a small, sad smile. \"I know this won't mean much to you now, because you don't know me but I know <em>you</em>. And I know that right now it seems hard, but someday in the future everything will make a little more sense. That’s all I wanted to say.”</p>\n<p>Izuku turned on his heel and walked off, leaving Todoroki there, stunned.</p>\n<p align=\"center\">\n<strong>HERO DEKU confirmed MIA</strong>\n</p>\n<p>Number One Hero Midoriya Izuku “Deku” has been confirmed missing in action. His agency has reported that he has been missing since last Monday, however they insist that they are doing all they can to find him. No information about the case has been given to our reporters as of yet.</p>\n<p>“Deku is strong,” Hero Uravity comments. “We need to believe in him. He will be back.”</p>\n<p>“I cannot tell you any details as of yet,” Ingenium says. “But rest assured that the case is being thoroughly reviewed by our agency. Ground Zero and Red Riot have both offered their help. Deku will be found.”</p>\n<p>The police would not give any statements but they do issue a warning to all villains that might try and take advantage of the symbol of peace’s disappearance: <em>don’t</em>. Pro heroes have stated that they will up upping their presence until Deku has been found.</p>\n<p>For now, we will wait and hope that Deku comes back.</p>\n<p> </p>\n<p>Comments: 876 (show less)</p>\n<p><strong>hhghytly: </strong>i fucking CALLED IT</p>\n<p><strong>hhotthero!: </strong>DDDEEKKKKKUUUUUUUUUU</p>\n<p><strong>lazyretro: </strong>oh god, that’s so bad. does anyone remember the time all might retired? it was bad then, too.</p>\n<p><strong>no1mightfan: </strong>villains are definitely going to take advantage of this….</p>\n<p><strong>d-d-deku: </strong>hope deku’s ok!!</p>\n<p><strong>redriotttttt456</strong>: oOHHHOHONONOOOO NOT DEKU!!!</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p align=\"center\"> </p>\n<p>One of the first things Todoroki Shouto learned was that life didn’t always go as planned.</p>\n<p>It had been almost two weeks since they’ve seen Izuku. Eleven days without the Symbol of Peace.</p>\n<p>Despite Ground Zero’s help, they had hardly made any progress in the case. Finding an unfindable man was never easy. Now, with the media knowing that Deku was missing and the stress of wondering if his friend was even <em>alive</em>, Shouto hadn’t got much sleep. </p>\n<p>“It doesn’t make sense,” Shouto said, head in his arms. The papers beneath him did nothing to comfort him. Ochako let out a sigh from her place propped up on the desk. She kicked the side of Shouto’s chair absent mindedly. </p>\n<p>She’d known Izuku since the start. This was hurting her, too.</p>\n<p>“Shouto,” she said. He didn’t look up from his place in his arms. “<em>Someone </em>did this. We <em>are </em>going to find them.”</p>\n<p>He could feel the guilt swirling in his chest. He was there. He watched it happen. He should’ve stopped it. Izuku was right <em>there</em>—</p>\n<p>Izuku had been the <em>only one </em>there.</p>\n<p>“No one was there, Ochako. If it was a quirk then we have <em>nothing</em>. The villains were tied up. Their quirks have been identified. All the civilians were evacuated. There was <em>no one</em>.”</p>\n<p>Izuku was gone. They didn’t know why. They didn’t know if he was still alive. Was he hurt? Was he scared? Was he fighting for his freedom right that very second? <em>Was he still breathing</em>? Perhaps not knowing was worse than knowing. At least, then, there wouldn’t have been as many questions.</p>\n<p>Ochako tugged the case file out from under him. Shouto looked up. She handed him a single piece of paper with the headline <em>Witness Report</em>. “There’s a witness right?”</p>\n<p>“Naomasa-san already sent some officers last week. Reports say he didn’t know anything.”</p>\n<p>\"Well, don’t you think it’s time <em>we </em>paid him a visit?” </p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>Mirio cornered Izuku again in an empty hall on Thursday.</p>\n<p>“Can you teach me?” Mirio asked. Izuku nearly dropped the hero equipment that he’d been carrying to Aizawa. He stared at Mirio in confusion.</p>\n<p>“What?”</p>\n<p>“One for All,” Mirio elaborated. Izuku didn’t think he <em>needed </em>to be taught. “How you use it—it’s different from how I use it. Plus… I love All Might and all but….”</p>\n<p>“He’s not a great teacher,” Izuku finished. He felt a smile tug at the corner of his mouth as he thought of All Might’s <em>Teaching For Dummies</em> book that still sat on the bookshelf in his apartment. “Don’t worry, he gets better.”</p>\n<p>Mirio laughed. “I have a solid grasp on One for All but the way Tenko said you use it was interesting. I figured we could train together or something. Maybe not in any strange, dark passageways…”</p>\n<p>Izuku, who’d been wanting to see Mirio use One for All since he found out Mirio had it, jumped on this idea. “I think we can work something out.”</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p align=\"center\"> </p>\n<p align=\"center\">\n<strong>class 1-bae</strong>\n</p>\n<p>Friday, 5:12 am</p>\n<p><strong>kaminari: </strong>sos who has the answers to that english assignment and/or can help me Not Fail</p>\n<p align=\"right\">Friday, 5:35 am</p>\n<p align=\"right\">i do! :3</p>\n<p><strong>kiaminari: </strong>tenko ur an angel but please, for the love of god, never use that face again</p>\n<p align=\"right\">&gt;:3c</p>\n<p><strong>sero: </strong>dude that assignment is due in three hours. its five am.</p>\n<p><strong>kaminari: </strong>i was distracted by not evil Actual Hero™ midorishi izuku</p>\n<p><strong>sero: </strong>he’s been here for like five days the shock has worm off</p>\n<p><strong>ashido: </strong>worm</p>\n<p><strong>uraraka: </strong>worm</p>\n<p><strong>kirishima: </strong>oh, worm?</p>\n<p><strong>sero: </strong>WORN gd making one (1) mistake in this gc is like feeding urself to the sharks</p>\n<p><strong>iida: </strong>Present Mic-sensei handed out the assignment two weeks ago.</p>\n<p><strong>kaminari: </strong>listen my knowledge of english is limited to memes and like five (5) words and im fueled by the ability to ignore every assignment up until two hours before its due</p>\n<p><strong>jiro: </strong>how are u passing ur class</p>\n<p><strong>kaminari: </strong>bold of u to assume im passing any of my classes</p>\n<p><strong>bakugo: </strong>literally all of u shut the fuck up u crusty ass walnuts its like six in the god damn fucking morning and most of us are trying to SLEEP so if u don’t zippity zop ur fucking mouth im going to personally come to ur shitty dorm and KILL you</p>\n<p><strong>kaminari: </strong>bakubro the assignment is due in three hours honestly u could murder me at this point and i would say thank u</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>Friday was the first time Tenko approached him alone since UA’s classes had started back up.</p>\n<p>“I want to be a rescue hero,” Tenko said, backpack slung over his shoulders. He stared at Izuku with fiery determination. They were alone in the dorm lobby, everyone else either in their dorm rooms or out and about on a Friday evening. “My quirk is dangerous. My worst fear is using it on someone.”</p>\n<p>Izuku thought back to when he first started UA, when his quirk was uncontrollable. He would either break himself or break someone else. The ability to have that sort of crazy power was a lot to bear. He remembered seeing USJ for the first time. Remembered meeting Thirteen. The words that they gave to his class.</p>\n<p>Izuku did what he had to. He got better, got stronger, and learned control.</p>\n<p>Izuku absentmindedly rubbed his right arm—the very place Shigaraki touched him in their last battle. The skin grafts ran from his elbow down to his wrist, raised and scarred. Serving as a constant reminder.</p>\n<p>Tenko was not Shigaraki. Izuku knew that from the moment he looked at him.</p>\n<p> “My power is not something I ever took lightly,” Izuku said. He leaned against one of the dorm walls. Tenko watched him. “Thirteen once said that it takes one wrong move with an uncontrollable quirk for people to die but….our powers are not <em>meant </em>to inflict harm.”</p>\n<p>He looked at Tenko, gaze landing on the gloves that he always wore for a little too long. A destructive power did not mean a destructive <em>person</em>.</p>\n<p>Izuku continued, “I, personally, think it’s not about the quirk, but the person that wields it.”</p>\n<p>Tenko laughed but it sounded wet. He rubbed his eyes. Izuku had never been one to judge someone else’s tears. “I like you better than our version.”</p>\n<p>Izuku saw Tenko for who he really is; Shimura Tenko, hero in training. Someone that would <em>save </em>people in the future. A hero.</p>\n<p>“I’ve been getting at a lot lately. I like you better than my version too,” Izuku doesn’t bother to hide his smile. He can’t help but add on, “Though, you’re missing a couple of hands.”</p>\n<p>Tenko looked down at his two perfectly good hands. “I’m…what?”</p>\n<p>Izuku patted his shoulder and started walking off. “Don’t worry about it. It’s better this way.”</p>\n<p>“W-wait! What do you mean I’m <em>missing </em>a couple of hands?!”</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Tracking down the witness was easy.</p>\n<p>They knew very little about him but they <em>did </em>know that his name is Yokota Yoshiki and his quirk was <em>light, </em>which basically meant that he was a walking flashlight. He watched his wife and son disappear. He’d been placed in witness protection for the last six years and was only recently released. He currently lived Tohoku, Japan which was just a little over an hour away from Musutafu.</p>\n<p>Shouto shared a look with Ochako as they looked at the house that loomed above them. Out in the country side of Tohoku, the place didn’t look like anything special. It was hunkered away behind the rolling hills with a field stretched out behind it. The house itself was dark but it was clearly managed.</p>\n<p>Shouto walked up and knocked on the door without hesitation. There was a crash immediately from inside the house followed by the pounding of footsteps. The door was yanked open and a small man stood in the doorway.</p>\n<p>He was old, covered in scars. He smelled like cigarette smoke and whiskey. His wrinkles were so obvious that they dropped down over his eyes. His long, white hair was brained down his back. His eyes were glaring and there was a scowl on his face but the moment he saw Shouto and Ochako on his front porch, it changed to horrified surprise.</p>\n<p>“Hello,” Shouto said.</p>\n<p>The man tried to slam the door on his face.</p>\n<p>Uraraka stuck her foot in it before he could. She smiled, but there was an edge to it. “Yokota Yoshiki, my name is Uravity. This is Shouto. We’re heroes. We’d like to ask a few questions.”</p>\n<p>“Y-you,” the man sputtered.</p>\n<p>It was like he tried to sound angry, but couldn’t help his fear. He hesitated, but opened the door and let them inside. It wasn’t like he could exactly say <em>no </em>to the number three and number ten hero in the country.</p>\n<p>“Thank you,” Ochako chirped with a smile.</p>\n<p>The man stared at her with dread.</p>\n<p>He lead them into the living room. The shutters were pulled closed, leaving he room dark. While the outside of the house had been maintained, the same could not be said for the inside. Tables and chairs were flipped on their side. Wallpaper was peeling from the walls. There looked like there was a gunshot hole on the kitchen counter. Shouto took a seat on one of the moth-eaten couches. Ochako chose to stand and leaned against the wall next to him. Yokota watched them warily.</p>\n<p>“Why are you here?” Yokota’s voice sounded rough.</p>\n<p>“Eleven days ago, number one hero Deku disappeared.” Shouto said, keeping a straight face. “He disappeared in a gold and green light. The only thing we have is a cold case about a man who could make people disappear. You’re the only witness. We want you to tell us <em>exactly </em>what happened to you. Any details about this man that you could provide.”</p>\n<p>“I already told the police,” Yokota said.</p>\n<p>“We’d appreciate if you could tell us too. This is a big case, as you can imagine,” Shouto said evenly.</p>\n<p>Yokota flinched so hard he almost fell off his seat. He wrung his hands together and looked anywhere but where Shouto and Ochako sat. “I-it was ten years ago. My son had gotten involved in some really nasty stuff. Drug rings, Yakuza, the like. He made a deal with a man and it went sour. That man invaded our home later that night. He was huge but covered his face. I couldn’t see more than his outline. H-he made his hands glow and suddenly my wife was gone. M-my son tried to fight him off, but the man did the same thing. I-I ran for my life. I-I don’t know who he was, I don’t know why he came after us!”</p>\n<p>Yokota nervously scanned the building. From the way his hands twisted, from the way he looked like he wanted to be anywhere but here. Shouto had dealt with a lot of villains in his lifetime and while he was not Naomasa, he knew when someone was lying.</p>\n<p>And he knew Yokota wasn’t telling the full truth.</p>\n<p>Ochako caught it too. She crossed her arms over her chest. “That not true.”</p>\n<p>“It is! I swear, it’s the truth!”</p>\n<p>Shouto stood up from his seat. Izuku had been missing for eleven days. Eleven days and they still didn’t know if he was alive. He tried to control his expression but couldn’t help as he leaned dangerously forward, scowl on his face. “No, it’s not. <em>Tell us the truth</em>.”</p>\n<p>“I’ve been telling the truth for the last ten years!” Yokota snapped.</p>\n<p>“Your wife and son didn’t disappear because of your son, did they? <em>You </em>did something. <em>You </em>know something that you failed to tell anyone else,” Ochako said. “What <em>really </em>happened to your family, Yokota Yoshiki?”</p>\n<p>The man broke down in tears, waving his arms around frantically. “It was me! I’d gotten involved in the Yakuza! I caused them to disappeared! I’m so sorry, God, I’m sorry, I’m sorry. Just leave me alone please, just—\"</p>\n<p>Ochako slammed one of her boots on the floor and smiled dangerously. “Do you know what he did to his victims?”</p>\n<p>“N-no! I don’t! I’ve said enough if he found out….”</p>\n<p>“Where is this man now?” Shouto asked.</p>\n<p>“I-I don’t know!”</p>\n<p>There is was again—the nervous ticks, the glance in the other direction. That was a lie.</p>\n<p>Ochako leaned forward. Shouto suddenly was reminded exactly why she was one of the few people from Class 1-A that Bakugo respected. Shouto had forgotten how terrifying she could be when she put her mind to it. The look on her face was downright <em>deadly</em>. “I think you do. <em>Where. Is. He</em>?”</p>\n<p>They walked out of the house not ten minutes later, a location clutched firmly in Ochako’s hand.  </p>\n<p>(Afterwards, Shouto promptly called Naomasa and informed him of the entire situation. Their witness was not as innocent as they had previously thought.)</p>\n<p> </p>\n<p> </p>\n<p>Izuku walked into one of UA’s gyms, hero costume on and bag in hand.</p>\n<p>It was seven-thirty in the morning on a Saturday, so Izuku knew for a fact that most of the students wouldn’t be up. Besides, Izuku had reserved the gym especially for him and Mirio. No one else currently had access to it.</p>\n<p>To a surprise of absolutely no one, Mirio was already there, warming up. He was also in his hero costume complete with cape and everything. Izuku couldn’t help the smile on his face when he saw it. After what they dealt with during Izuku’s internship….it was good to have Mirio back.</p>\n<p>Mirio spotted him the moment he walked through the doors. He waved enthusiastically. “Hey! Hey! Hey! You ready for this?!”</p>\n<p>Izuku smiled and dumped his bag next to Mirio’s. He joined Mirio in stretching. “Of course.”</p>\n<p>After ten minutes of stretching, Mirio stood up and offered Izuku a hand. Izuku took it and Mirio hoisted him to his feet. Mirio glanced around at the training gym, hand scratching his hair. “So how do you want to do this? Just a good old fashion spar?”</p>\n<p>“That’s fine,” Izuku told him. “I let Aizawa know that we were probably going to be sparring. Nedzu knows as well.”</p>\n<p>Mirio laughed. “The principal is probably watching us right now.”</p>\n<p>“Probably,” Izuku agreed because he would be more surprised if Nedzu <em>wasn’t </em>watching them in some way.  He walked to the sparring field—mostly covered in dirt and rocks. Mirio walked to the other end just as Izuku readied his fists. “You ready?”</p>\n<p>“As always,” Mirio told him happily.</p>\n<p>“<em>Go</em>!” Izuku shouted and Mirio disappeared not a moment later. Izuku activated One for All without hesitation. Permeation was a powerful ability, but hard to control. If anyone could harness that and One for All, it would be Mirio.</p>\n<p>Izuku stood still, waiting. Any second now…</p>\n<p>Mirio shot out of the ground like a rocket, faster than Izuku could have dodged. If he hadn’t been paying attention to the angle that Mirio ended the ground, he would have been sent sprawling. Mirio landed not ten feet away, glowing in a bright, warm light. He sent a blast of compressed air the moment he touched the ground. Izuku barley had enough time to counter with his own.</p>\n<p>So <em>that </em>was the power of Mirio’s One for All.</p>\n<p>Mirio rushed at him, arm drawn. There were glowing red lines that wrapped around his arm, much like what happened to Izuku when he first started using One for All before Full Cowl. The punch that Mirio sent his way was strong enough that Izuku had to fight not to lose his footing. It uprooted the ground behind him sending dust covering the entire gym.</p>\n<p>It was at that moment that Izuku noticed something: Mirio fought like All Might.</p>\n<p>Izuku’s arm throbbed painfully after enduring Mirio’s punch. Without giving Mirio time to throw another one, Izuku slammed a foot into Mirio’s side to send him catering to the side. Mirio disappeared through the floor before Izuku could follow up.</p>\n<p>The fight lasted for some time. They traded blows, learning each other’s moves and skill. Izuku had the advantage of both knowledge of One for All and experience over Mirio, but Mirio got by on raw power and skill alone. There was a <em>reason </em>that Mirio was part of the Big Three during Izuku’s first year of UA. Mirio was a strong, smart and capable fighter. Using One for All just made him better.</p>\n<p>Yet, Izuku could still see some flaws; Mirio treated Permeation and One for All like separate quirks. He didn’t use them at the same time and when it did, it was only to give the other quirk a boost. None of his moves were an equal combination of the two quirks.</p>\n<p>Perhaps Izuku got lucky, being quirkless before One for All.</p>\n<p>Mirio flagged for a time out and Izuku immediately dropped One for All. He walked over to his bag, fishing out his water bottle. He was sore and covered in bruises and cuts, but he hadn’t broken a single bone. Had he still been a first year at UA, Recovery Girl would have been proud.</p>\n<p>Mirio slapped him on the back so hard he went stumbling. “You’re good with your quirk!”</p>\n<p>“Thanks,” Izuku said and laughed. “It wasn’t always like that. I used to shatter every bone in my body.”</p>\n<p>“You…what?” Mirio said incredulously.</p>\n<p>Izuku stared at Mirio. All Might once said that he never dealt with the problems that Izuku had, but for Mirio to also not go through that… “Don’t tell me you didn’t.”</p>\n<p>“I could always control One for All to some extent,” Mirio said.</p>\n<p>Izuku tried not to be jealous because was he really the <em>only </em>user who struggled with control?</p>\n<p>“It took me three years before I could use it at a hundred percent without shattering every bone in my body,” Izuku said and pinched the bridge of his nose.</p>\n<p><em>Why </em>was he surrounded by people who could naturally use a two hundred year old power like it was nothing? </p>\n<p>Mirio whistled. “That sounds rough. I don’t use One for All as much as I’d like. People start getting suspicious when I use them separately, y’know? Because they’re so different and I only got One for All during my first year.”</p>\n<p>Izuku hummed in agreement. The two lapse into silence, trying to recover from the last spar. Izuku thought of his Mirio. His natural, happy disposition and his ability to put people at ease. Why Sir liked him so much, why he would’ve been a great hero. Not for the first time, Izuku wondered what would’ve happened if his Mirio got One for All instead.</p>\n<p>Izuku didn’t think it would’ve been a bad decision.</p>\n<p>“You’re a good user, Mirio,” Izuku said instead.</p>\n<p>Mirio laughed out a thank you and said, in all sincerity, “You are too.”</p>\n<p> </p>\n<p> </p>\n<p>His name was Yasutake Takanori. His quirk was called <em>Universe</em>.</p>\n<p>“That’s an ominous quirk name,” Ochako commented as they walked down the dark streets of Hoshiko, a city two hours east of Tohoku.</p>\n<p>They were only minutes from the address that Yokota had <em>graciously </em>provided. Shouto thought it would’ve been smart for a witness in witness protection to be further away from the person he was being protected <em>from</em>, but their witness was not the smartest nor most innocent of men anyways.</p>\n<p>They were even able to convince him to give them a description: over eight feet talk, broad shoulders, wore nothing but trench coats, no hair and had a scar that ran down the length of the left side of his face. He had silver eyes. According to Yokota, he was quick to anger and very, <em>very </em>dangerous.</p>\n<p>It was a good thing that Shouto was <em>not </em>in a good mood. He could be damn dangerous if he wanted, too.</p>\n<p>Ochako had thrown a dirty hoodie and sweatpants over her hero costume. She left her helmet in the car and threw her hair into a messy ponytail. Shouto had taken off his costume entirely, opting to instead wear a hoodie and facemask to cover his hair and scar. He kept his belt with his first aid supplies and other assorted items hidden under his clothes.</p>\n<p>It would do no good to look like a hero here.</p>\n<p>A tracking device hooked up to a local police station was on Shouto’s left hand. The police were waiting for their signal. They had the entire area surrounded. It was just up to Ochako and Shouto to flush them all out.</p>\n<p>“Who are you?!” A voice shouted from behind them.</p>\n<p>There’s a man in the alleyway, sparks menacingly coming from his fingers. An electric type quirk. That was fine, they could deal with that.</p>\n<p>Shouto caught Ochako’s eye. Ochako winked, then pretended to cower, holding her hands up. “O-oh! We’re just travelers. I think we’re a little lost. We didn’t mean to bother you or anything uh, we’ll just be on our way—\"</p>\n<p>A hand grabbed Ochako’s arm and yanked her backward. Shouto felt a knife pressed at the back of his neck. Three men surrounded them, faces covered by ski masks.</p>\n<p>The one behind Shouto laughed. “Not so fast.”</p>\n<p>“Take them to the boss,” the first man with the electrical quirk said. Ochako pretended to cry out in alarm and offered a weak resistance to get free. The man holding her shook her harshly while the other two laughed. They dragged them down the alleyway.</p>\n<p>This plan was working out way too well.</p>\n<p>The men lead them through the twists and runs of the darkened alley until they arrived at a green door. It was hidden behind a dumpster with paint flaking off the sides and rust covering the door handle. The villains didn’t hesitate to open the door and throw them all in.</p>\n<p>The inside was completely different. It was covered in lush silks. Two black couches were on the side of the room, a bed on the other. There were people, at least ten, who ran around the room only to stop when they noticed the newcomers. A few backed up towards the bed. Whispering broke out throughout the entire room.</p>\n<p>Shouto and Ochako were thrown to the ground on their knees in front of a man. Shouto tried to look up at his face, but a hand at his neck forced him to look at the man’s shoes. A. Testoni black leather dress shoes. A luxury brand, known to be hand crafted and expensive. </p>\n<p>His father also liked the brand. That only made Shouto more annoyed.</p>\n<p>“What were you doing sneaking around our territory?” The man in front of his asked, voice deep and rumbling. Shouto didn’t say anything. The man nudged him with his shoes. Shouto had half a mind to spit on them. “Well?”</p>\n<p>“Looking for someone,” Shouto said instead because he didn’t think spitting on the man’s shoes was going to get him to talk.</p>\n<p>“Who the hell were you looking for, boy?” the man said. A few of his cronies laugh.</p>\n<p>Ochako snorted beside him but tried to turn it into a terrified squeak.</p>\n<p>A hand yanked Shouto higher to his knees. Another hand rested at the base of his neck. Two pairs of footsteps could be hear behind him, getting closer and closer until Shouto felt his hoodie being yanked off. Shouto looked up at the man that sat in front of him.</p>\n<p>All he saw were <em>sliver eyes </em>and Shouto promptly froze everyone to the floor. As an extra measure, he completely encapsulated their boss with the <em>silver eyes</em>— Yasutake Takanori, the very many they’d been looking for—entirely in ice. Shouts of surprise came from the men as they struggled to get free. Shouto stood up, helping Ochako to her feet. She yanked down her hoodie with a dangerous smile.</p>\n<p>“You,” Shouto said simply.</p>\n<p> “Y-you’re Todoroki Shouto, number three hero,” a man behind him whimpered.</p>\n<p>Shouto didn’t even turn around. “I am.”</p>\n<p>“A-and Uravity! What the hell are they doing here!?”</p>\n<p>Yasutake struggled to get free, his face set in a fierce glare. He couldn’t even more an inch. He spat at the crony that brought Ochako in here. “WHAT THE HELL DID YOU <em>DO</em>!?”</p>\n<p>“We didn’t know they were heroes!” the man cried out, desperately trying to free his feet.  </p>\n<p>“Alright, boys,” Ochako said. She cracked her knuckles. “This is how it’s gonna work. We’re going to ask some questions and you’re going to give us answers. Then, we’ll be on our merry way. Got it?”</p>\n<p>Yasutake nodded hesitantly.</p>\n<p>“<em>Where is Deku</em>?” Shouto said, edge to his voice.</p>\n<p>His fire was coming close to igniting. Ice had already spread to cover half of his hoodie. A few of the other people in the room flinched in fear.</p>\n<p>Yasutake didn’t meet his eyes. “I don’t know what you’re talking about.”</p>\n<p>“Yasutake Takanori. Quirk: Universe,” Shouto said. He’s read the case enough times to recite it from memory. “You were responsible for the disappearances of ten people ten years ago. Exactly twelve days ago, Deku disappeared in a gold and green light. The <em>exact </em>light that matches the description of you quirk. So I’m going to ask again; <em>where. is. Deku</em>?”</p>\n<p>“I’m not stupid enough to go after the fucking <em>Symbol of Peace</em>! Are you shitting me?!” The man shouted and struggled even more to break free. “Let me go!”</p>\n<p>Ochako narrowed her eyes and crossed her arms. “Not until you explain your quirk.”</p>\n<p>When the man hesitated, Shouto stepped forward. Fire flickered on his shoulder. Yasutake eyed it warily. “I’ve had a <em>very bad </em>two weeks. My best friend is missing. I haven’t slept in three days. A villain attacked our agency four days ago. I’m having to solve this <em>stupid case</em>. I’m having to work with Ground Zero <em>on </em>said case. The first lead we’ve gotten in almost two weeks and it’s <em>you </em>so you better start talking or I <em>will </em>make you.”</p>\n<p>Interrogation and threatening have never been Shouto’s strong point but he was tired and <em>done </em>and this was the <em>only thing </em>currently standing in the way of getting information about Izuku.</p>\n<p>“You think I’m gonna—” Yasutake stared to say. Shouto cut him off with a sharp piece of ice landing inches from his face. “Okay. I’ll talk.”</p>\n<p>“That wasn’t really hard, was it?” Ochako said with a smile. “Now, about your quirk, please.”</p>\n<p>“There are billions of worlds out there,” Yasutake started. He bit his lip but continued, “Our world is connected to one in particular. I don’t know why. This world is parallel to ours—things often happen in similar ways. The same people with the same quirks. I can send people there. But it wasn’t me that used <em>Universe </em>on Deku. That means my alternate self-used it. I <em>don’t know </em>why he used it to steal the <em>Symbol of Peace</em>! I hadn’t heard from him in a while. The last thing I heard was the he was in some deep shit with a man named <em>Sensei</em>.”</p>\n<p>That was a lot to unpack, but looking at the man, Shouto heard nothing but the truth. Truthfully, it sounded almost impossible, but if there was a chance that Izuku was there, still alive, then it was a chance that Shouto would take.</p>\n<p>Besides….the name Sensei was eerily familiar. There was only a single man who dared go by that name. Shouto shared a glance at Ochako who seemed to some to the same conclusion.</p>\n<p>\n<em>All for One. </em>\n</p>\n<p>Ochako turned back to Yasutake. “Give us an idea on why you’re alternate-self would use it.”</p>\n<p>“I-I don’t know!” the man shouted. Shouto narrowed his eyes because the man was <em>lying. </em>The fire on Shouto’s shoulder roared to life. Ochako stepped forward menacingly. Yasutake immediately backtracked, leaning as far away from the two as he could in his icy prison. “O-okay! Okay! Deku is a villain in their world! I never told other-me that he’s a hero here! But I really don’t know why he would steal Deku!”</p>\n<p>A villain…Deku as a villain. It was almost ridiculous to think about, but if the man was telling the truth and All for One was involved… Ochako stared wide-eyed at him and mouthed <em>All for One. </em>Shouto wished that he didn’t agree.</p>\n<p> “It’s not him,” Ochako said, quietly.</p>\n<p>“What?” Yasutake asked.</p>\n<p>“Your alternate-self. It’s not him that took Deku.”</p>\n<p>Shouto pressed the tracking device wrapped around his wrist. It immediately alerted to police to the signal. Within moments, this place would be swarmed with officers and taken down. Ochako walked behind the giant ice-cube of a man and placed five fingers on the cube. It started floating immediately and Ochako pushed him towards the door.  </p>\n<p>Yasutake flailed his head wildly. “H-hey! Where are we going?!”</p>\n<p>“You’re a villain. We’re heroes. Where do you think?” Ochako told him.</p>\n<p>“No-no! Let me go! I don’t want to go to jail!”</p>\n<p>“You should’ve thought about that before being a villain!” Ochako said happily, practically skipping while tugging the man along.</p>\n<p><em>The stress of the past few weeks was finally catching up to him, </em>Shouto thought as he watched Ochako head towards the police, her floating ice-man in tow. Yet, now they knew where he was. He knew why he was there. He still worried about Izuku being with All for One and likely his villain alternate-self, but Shouto knew Izuku. Izuku was strong.</p>\n<p>If anyone were to survive a world like it, it would be him.</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>Dabi leaned against the bar, carefully picking through Midorishi Izuku’s scattered papers.</p>\n<p>Most were illegible, written on napkins. A few were crunched up into balls and thrown on the floor. They all consisted of an assortment of words and numbers. Diagrams were messily scratched onto a few. Dabi was pretty sure he saw a crude drawing of a nomu. Ever since All for One showed his ugly mug, Midorishi had been obsessed with <em>whatever </em>he was doing. Threw himself into his words and never left.</p>\n<p>Dabi didn’t want to know what that was, but felt like he already knew. Midorishi was coming up with a plan.</p>\n<p>Speaking of Midorishi, he was still scribbling away, never once looking up. He was muttering things—<em>stupid hero, heroes, universe</em>—so it wasn’t hard to guess what was on his mind. Kurogiri was watching him with exasperation. The rest of the league stayed far, far away considering Midorishi had thrown Spinner through the wall not two days ago for accidentally throwing away one of the pieces written on a napkin. Fifteen years old and terrifyingly strong.</p>\n<p>Good thing Dabi didn’t particularly care. He was only here because Midorishi was the only thing that could alleviate his boredom.</p>\n<p>Midorishi suddenly crowed in delight, holding one of the many pieces of paper like it was a nugget of gold. “I’ve got it!”</p>\n<p>Dabi couldn’t read the words on the paper. He raised an unimpressed eyebrow. “And that is?”</p>\n<p>“A plan,” Midorishi said.</p>\n<p>He gathered his piles of papers and shoved them into the trash. Spinner stared, dumbstruck. Toga laughed. Kurogiri signed. Without another word, Midorishi walked towards the door with a wicked and terrifying grin.</p>\n<p>“Hey,” Dabi called, leaning against the bar. “Where are you going?”</p>\n<p>Midorishi grinned at him, eyes wide. There was blood on the side of his face. “To deliver a <em>message</em>.”</p>\n<p>It was a Sunday afternoon—almost two weeks since Izuku had been here—when everything went to hell.</p>\n<p>The dorm was bustling with activity, everyone rushing around to either complete their homework, play video games or catch up with friends. Tenko was currently murdering everyone at Mario Kart. Todoroki had been avoiding Izuku ever since he last spoke to him. Iida lead a five-person study group to figure out Present Mic’s newest assignment. Kaminari had tried to rope Izuku into helping them, but Izuku only took a sip of his drink and gave him a cheeky smile. He'd done his time during school and wasn't too keen on going back.</p>\n<p>It was strangely nostalgic, being in the dorms again.</p>\n<p>Yaomomo approached him not five minutes later while Izuku was watching as Tenko won his fifth Mario Kart game. Kacchan threw his controller at Tenko’s head and Uraraka had to hold Tenko back from lunging. Kirishima did the same to Kacchan.</p>\n<p>“We’re planning on doing a class trip to the mall. We have a few ingredients that we need for the next week if we’re going to cook,” Yaomomo said. Their conversation drew a few people over, probably wondering just what they were talking about. The Mario Kart game was put on hold (which was probably for the best anyways). “Want to come?”</p>\n<p>“I’m not part of the class?” Izuku said slowly. </p>\n<p>“But you stay here often enough that we figured you would be lonely if we all left,” Yaomomo said which was <em>true</em>, but she didn't need to say it. “It would be rude not to invite you.”</p>\n<p>“Besides, it’s better to have a hero with us if villains attack,” Sero said.</p>\n<p>At least he was honest, but that was<em> not</em> the most comforting thing to say. Especially knowing Class 1-A's luck. </p>\n<p>“I…do not have the best experiences at the mall,” Izuku said sheepishly, remembering the last couple of times his mall trips had ended up sour. Shigaraki and the League had never made mall trips fun for him.</p>\n<p>Tenko laughed in agreement, rubbing the back of his neck. “I understand how you feel.”</p>\n<p><em>He probably does</em>, Izuku thought and shuddered to think of what his counterpart did.  </p>\n<p> </p>\n<p> </p>\n<p>Izuku went to the mall.  </p>\n<p>In the end, he was no match for the combined persuasive power of 1-A. Sero’s point also rang true—if anyone wanted to start trouble, they would have to go through<em> him </em>first.</p>\n<p>At first, the mall was great. Even though Izuku ended up having to cover all of his face to prevent being confused for his nasty villain counterpart, he was glad to be out of UA. He hadn’t been able to leave in almost a week, with the other week spent in a police station. </p>\n<p>The mall was familiar and fun, the shops bright and colorful. It was a welcomed distraction to Izuku’s current situation. If he stopped for a moment, he could almost pretend that this was his world, with his friends and his home. Then, one of his much-to-young classmates would walk in front of him (or he's glance at Tenko) and the image would be ruined. He tried not to feel bitter about it, he really did, but the rock in his stomach only grew heavier as time went on. </p>\n<p>For the first hour, nothing remarkable happened. The class stuck together as they migrated from shop to shop, teasing and laughing. A couple people recognized them from the Sports Festival and asked for autographs. Izuku made himself scarce when that happened. Jiro ended up buying a kazoo on a dare. Uraraka bought some limited edition Thirteen merchandise (Izuku wished he could buy some too, but he didn’t have money and would’ve felt guilty asking. That didn’t stop him from staring enviously at Uraraka). Iida ended up dragging half the class into a sports’ wear store, and coming out with a variety of new shoes, leggings and training gear. All in all, everyone seemed to be enjoying themselves.</p>\n<p>Izuku should’ve known it wouldn’t last.</p>\n<p>It was Shoji who spotted him first and quickly alerted everyone else. Soon, the horde of first year UA students were chattering nervously as they stared at the other side of the mall because there, leaning up against a wall, was Midorishi Izuku.</p>\n<p>\"Oh, that's not good,\" Tenko said in an almost breathless whisper.</p>\n<p>Izuku thought that was probably the understatement of the century. </p>\n<p>To most people, he would be invisible—his spot was strategically picked so that the majority of people wouldn’t even be able to see his shadow. He wore nothing to hide his face. Midorishi kept his eyes firmly on the civilians in front of him, watching as each one passed. There was a knife strapped to his side. His face was so, so similar to Izuku’s own. He’d seen him once before during Kamino, but it was nothing like this.</p>\n<p>A scar ran down the length of Midorishi's face. Unlike Izuku's poofy, curly hair, his was cut shorter. His clothes were dark but so obviously stuffed to the brim with an assortment of weaponry. His eyes were just as green, but there was nothing there—they were the same eyes Izuku looked at when he saw Shigaraki Tomura. Dead, empty, gone. </p>\n<p>Why was he here? From what Izuku had heard about his counterpart, he was smart. He wouldn’t take risks at random. For him to come to a crowded mall of all places—it meant he wanted something.</p>\n<p>There was a pit starting to form in Izuku’s stomach.</p>\n<p>“I’m going to call the heroes,” Iida said and immediately pulled out his phone.</p>\n<p>It only took three rings before Midorishi slowly turned his head, like something out of a horror movie, and met Izuku’s own. There was a sadistic grin on his face. A little splotch of dried blood stood out on his right temple.</p>\n<p>“Run,” Izuku said because he<em> knew</em> that look. That was the look of someone who had a plan. 1-A hesitated, staring at him with wide eyes. Aizawa had just answered Iida’s call. Izuku turned to them, snapping, “<em>Run now!”</em></p>\n<p>Just as they were about to listen, a black mist appeared behind their feet. It crawled up their bodies and engulfing them in a matter of seconds. People in the mall were starting to scream and panic. Izuku desperately lunged to try to grab someone—anyone—but they all slipped through his fingers and disappeared into the warp gate.</p>\n<p>The black mist enveloped him and he had just enough time to think <em>oh fuck</em>, before he was falling.</p>\n<p>Izuku hit the steel ground hard enough for the <em>clang</em> to echo around. The impact knocked the wind out of him and white hot pain burst through his temple but Izuku didn’t have time to worry about that. Years of engraved hero instincts took over as he shook his head and flipped to his feet, surveying his position. </p>\n<p>He was in an empty warehouse-like place. The little light in there came from three broken windows that were near the top of the high ceilings. There were no doors or easy escape hatches that Izuku could see from where he was. A catwalk hung from the ceiling and various wooden boxes littered the room. It looked like it hadn’t been used in a long time. Around him, the rest of 1-A lay, groaning but alive. Their bags of newly bought items were scattered and broken, but it wasn't the time to worry about that. </p>\n<p>Izuku rushed over and grabbed the nearest student, Tenko, to his feet. “Is everyone okay?”</p>\n<p>\"What the <em>fuck</em>,\" Kirishima groaned into the floor.</p>\n<p>Beside him, Kacchan was already on his feet. Most of the rest of the class hadn't moved, save a few like Todoroki and Momo who were already looking around for escape routes. That was good—they needed all the help they could get at this point.</p>\n<p>There was a mixed set of replies but luckily no one seemed injured enough that they wouldn’t be able to move or fight. Izuku had a very bad feeling that Midorishi wasn’t quite done with them all yet.</p>\n<p>His feeling was proven true when the black mist—Kurogiri, <em>of course,</em> who else would it be?—appeared. Midorishi himself stepped through the portal with a grin.</p>\n<p>\"Hi,\" Midorishi said. \"Welcome to the party. Glad you all could come. Hope you don't mind, but I invited a few other guests.\" </p>\n<p>A screech sounded from inside the portal and a horrible feeling pooled in Izuku’s stomach. The sound rattled in his brain and Izuku fought to not cover his ears. Although he hadn't heard anything like that in years, those screeches were ones that he could never forget. A large, clawed black hand reached out as the creature crawled its way out of the swirling black portal. Its entire body was covered in an array of scars, its brain clearly on display for everyone to see. Its beak curved at the end and it carried a set of razor sharp teeth. It stood up, towering over everyone gathered in the warehouse and stumbled over to stand behind Midorishi. </p>\n<p>Four more Nomu crawled out in the same way.  </p>\n<p>This was <em>it</em>. Izuku was never visiting another mall in his <em>life</em>.</p>\n<p>The black portal finally took a familiar shape. Kurogiri’s golden eyes glowered at them all as the villain tugged at his suit. Izuku hadn’t seen Kurogiri since he was put in Tartarus and he didn’t partially want to become acquainted again so soon. Midorishi grinned and waved like this was a high school reunion.</p>\n<p>Beside Izuku, Tenko took a frightened step back. Kacchan had tiny explosions coming from his fingers.</p>\n<p> “So, Kurogiri, you're uninvited now. Thanks for the drop off,” Midorishi said, not once taking his eyes off of the group of UA students.</p>\n<p>Izuku felt One for All rattle beneath his skin but he waited—he had to plan this right. He couldn’t fight recklessly.</p>\n<p>Kurogiri hesitated for a moment, looking at Midorishi incredulously. Midorishi spun on his heel, his smile fading and snapped, “Didn’t you<em> hear me</em>? <em>Leave</em>. I don’t need you.”</p>\n<p>\"If this is how you want to play this game, then so be it,\" Kurogiri said. \"Dinner is at seven. Sensei still wants to meet you.\" </p>\n<p>\"Yeah, yeah, yeah. Whatever. This won't take long anyways,\" Midorishi said, uninterested. The Nomu stayed stock-still behind him. </p>\n<p>Izuku tensed up, expecting a trap but Kurogiri was gone not a second later. Midorishi cracked his knuckles and laughed. Izuku tried not to cringe as the sound echoed across the empty warehouse.</p>\n<p>Midorishi met Izuku’s eyes. “Glad you could join me! You’ve really been a real <em>pain</em> in our sides lately, y’know? So I figured, since it was my idea to send you here, I might as well kill you, right? Big ole <em>fuck you</em> to your world. What kinda world would it be without the League anyways? Maybe send a message to All Might as well. Class full of dead kids <em>isn’t</em> a fantastic morale booster, in my opinion.”</p>\n<p>Midorishi stepped forward, taking the knife from his hip and spinning it around in his fingers. He had this wild and crazy grin on his face, but Izuku knew that Midorishi was not a stupid person. He was young and rash but he was smart. Izuku knew that better than anyone. </p>\n<p>This wouldn't be an easy fight. Not with the Nomu and a class to protect.</p>\n<p>\"Nomu,\" Midorishi said. The creatures tensed at their name. \"Kill them.\" </p>\n<p>\n<em>We don’t really know whether to validate this hero license or not. For now, it would be better to just avoid conflict. </em>\n</p>\n<p><em>Sorry, Naomasa-san,</em> Izuku thought as he powered up One for All. </p>\n<p> </p>\n<p> </p>\n<p>It took the combined force of the police and heroes almost a day to set up.  </p>\n<p>Bringing Yasutake Takanori had been the easy part. The not-so easy part was convincing him to send a small group of heroes into the other world <em>and</em> bring them back. It was true that he had the control, but it was the trust issue that most everyone was worried about. Bringing everyone back safely would be the most important part. How were you supposed to trust a villain?</p>\n<p>That, thankfully, fell on Naomasa’s shoulders. Shouto had done his fair share of threatening. He didn’t particularly want to do any more.</p>\n<p>In the end, Naomasa managed to do it. Shouto wasn’t sure how, didn’t partially care, but he was thankful. They were <em>so close</em> to getting Izuku back. </p>\n<p>The plan is simple; send himself, Ochako and Bakugo (who stubbornly insisted that he was <em>not going to be left out</em>) to the parallel world. Find Izuku before the two hours is up. In order to send him back, since Yasutake was not the one who sent him there in the first place, one of the three there was sent there <em>had </em>to be touching Izuku. If they didn’t find him in enough time or didn't touch him as Yasutake warped them back, Izuku would stay in the alternate world.</p>\n<p>Shouto watched as Naomasa made the final preparations. His hero suit felt strangely heavy. Ochako stood beside him, also ready to go. Bakugo had been watching the entire setup since Shouto and Ochako had first brought the villain in. The rest of their class, having come for support, gathered around the three.</p>\n<p>Naomasa poked his head in the room. “We’re ready.”  </p>\n<p>“Finally,” Bakugo said. He was the first to follow Naomasa into the next room.</p>\n<p>Shouto and Ochako shared a look before Ochako shook her head in exasperation. Behind her, Kirishima laughed. Ashido shook her head in exasperation, but followed him out. The rest of the ex-class was not too far behind. </p>\n<p>\"Why is Bakugo coming again?\" Shouto muttered to Ochako. </p>\n<p>\"Because I didn't feel like arguing for hours,\" Ochako said, which, admittedly, was fair. </p>\n<p>The room Naomasa lead them too was <em>white</em>. It almost looked like a lab out of a scifi movie—if labs normally had villains chained to the center of the room. The walls almost sparkled, pristine, as Yasutake glared at them from the center of the room with as much fury as he could muster. Bakugo glared back with even more force.</p>\n<p>“You have two hours. Two hours until we bring you back,” Naomasa said. “Yasutake-san said that he could get you close to where Izuku is. You’ll have to find him from there. Remember—”</p>\n<p>“One of us has to touch the fucking nerd,” Bakugo snapped. “We got it.”</p>\n<p>“Right,” Naomasa said, not at all off-put but Bakugo’s attitude. He’d probably dealt with enough weird or frustrating situations not to be put off by it. Not to mention, he’s been supporting class 1-A since they were first years. “We don’t know much about this world. We do know that it’s parallel. We know that Midoriya’s counterpart is a villain and is working under their All for One. Be sure to be careful.”</p>\n<p>“Good luck,” Yaomomo said. Ochako gave her a hug.</p>\n<p>“Tell Midoriya that he needs to stop getting involved in this kinda stuff, man,” Kaminari said and laughed.</p>\n<p>“He’s been like this since the start,” Jiro said and she rolled her eyes. “I doubt he’ll be stopping any time soon.”</p>\n<p>“He does really get involved into the strangest things, doesn’t he?” Ojiro laughed, rubbing the back of his head.</p>\n<p>Tenya approached them. Shouto knew how badly he wanted to go as well, how much it hurt him having to stay behind. He was one of Izuku’s first friends and one of the one’s that Izuku trusted completely. However, someone had to say behind and look after the agency, especially if something went wrong. They couldn’t afford for all of them to go. Not when this world still needed them, too.</p>\n<p>“Stay safe,” Tenya said as he swept both Shouto and Ochako into a hug. \"And bring him home.\"</p>\n<p>“I won’t be coming back until I do,” Shouto promised.</p>\n<p>He met Tenya’s eyes and could only hope that Tenya could see the fierce determination that he felt. He would <em>not</em> stop until Izuku was home, safe. </p>\n<p>\"Don't worry about us,\" Ochako said. </p>\n<p>Tenya nodded and stepped back.</p>\n<p>“Send us to Deku,” Ochako told Yasutake.</p>\n<p>He looked like he was about to spit at her feet but one look from Naomasa had him freeze. Instead, the villain huffed and held out his hands. The tips of his fingers sparkled until a brilliant light weaved its way in an intricate pattern down his entire hand. Gold and green light swirled around, steadily getting brighter and brighter. The very same light that had send Izuku away two weeks ago. The pattern snaked its way from Yasutake to the floor and then crawled its way up Shouto's entire body. It tingled just for a second before fading entirely. </p>\n<p>Shouto was about to ask <em>is that it?</em> when the light exploded into a burst of color and blinded him. Shouts of alarm were heard all throughout the room and he tried to answer them, but nothing came out of his mouth. All he felt was burning and burning and <em>burning.</em></p>\n<p>Suddenly, he knew nothing.</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>“Don't leave a single one alive,” Midorishi said to the Nomu.</p>\n<p>The beasts didn’t hesitate to comply, each lumbering forward before launching themselves after the group with incredible speed. Izuku immediately blasted three of them away by a well-timed punch using One for All and fought off the other two using his shoot style.</p>\n<p>All the while, Midorishi watched with glee.</p>\n<p>“Get behind me!” Izuku ordered.</p>\n<p>Class 1-A complied, but they were all tense and ready for a fight. They’d done this once at UJS and another time during the summer camp but this…cut off from everyone, targeted specifically to be killed? This was going to get messy.</p>\n<p>“Iida, call the heroes!” Uraraka said in panic.</p>\n<p>“I can’t!” Iida was aggressively dialing his phone, but just like USJ, nothing was happening. </p>\n<p>“Oh no,” Midorishi said. His voice was almost like a purr. “Don’t think we forgot about our little mishap last time. You won’t be able to reach the heroes here.”</p>\n<p>That was great. <em>Fantastic</em>. This day was just getting better and better. </p>\n<p>For the next five minutes, Izuku did nothing but defend everyone from the Nomu. It wasn’t easy and he took more than a few blows and injuries. These Nomu were much like the one at USJ with their nullification powers. They were specifically designed to counter and nullify One for All. Plus, he couldn’t go all out, not with the 1-A behind him and Midorishi just waiting for an opening. It looked bad, and the battle probably should have been a slaughter but...</p>\n<p>Deku wasn’t the Symbol of Peace for no reason.</p>\n<p>So he defended everyone to the best of his abilities. He blocked attack after attack from the Nomu, sending them sprawling only for them to get back up. They nullified his power but Izuku only produced more. He would stop their attacks for as long as he needed to. Again and again <em>and again</em>—</p>\n<p>There was a flash on his right. Izuku didn’t have enough time to even turn before pain burst through his side and he was thrown off his feet. He flew ten yards before crashing into a stack of boxes. They shattered on impact, letting the splinters rain down on him. Izuku tried not to groan as he hoisted himself up to his feet. He had to get back to the students—</p>\n<p>Midorishi stood in the way, his left side glowing white. Izuku had no idea what type of quirk that was. Knowing All for One, Midorishi probably had several.</p>\n<p>“Hey, stop that,” Midorishi said. “I want to see the Nomu kill them. You’re in the way.”</p>\n<p>How could someone like <em>that</em> ever be <em>him</em>?</p>\n<p>The Nomu advanced, this time slowly. Izuku glanced desperately at the class and tried to rush around Midorishi, but he consistently stood in his way. Izuku had no choice but the fight his counterpart if he ever wanted everyone to get out of there alive.</p>\n<p>Midorishi must have seen the change in his expression because he laughed. The glow faded from his arm replaced with red sparks of lightning and looked eerily similar to Izuku’s own.</p>\n<p> Oh yep, he definitely had more than one quirk. Cool. Great. <em>Fantastic</em>.</p>\n<p>It was fine, he could still do this. He’d beaten All for One. He’d beaten Shigaraki Tomura. He’d stopped the league. If this villainous fifteen year old version of himself wanted to fight then <em>fine, </em>he would give him a damn fight.</p>\n<p>Izuku bared his teeth in a dangerous smile and raced to meet Midorishi when he attacked.</p>\n<p>The impact was enough to shake the entire warehouse. The wind was so strong that it almost tipped a Nomu off balance. Behind him, he would hear the class duck for cover even as the Nomu continued to advance. </p>\n<p>Midorishi didn’t give him any time to make sure everyone was alright, sending blast after blast of pure power. He switched quirks so fast that Izuku didn’t have time to learn what they did half the time. His villain version was <em>good. </em>It was obvious that he trained under All for One.</p>\n<p>But Izuku knew All for One. His quirks, his fighting style, his power.</p>\n<p>Izuku glanced behind him only to see a Nomu dangerously close to the class. Bakugo looked ready to launch himself at it, held back only by Kirishima. He paused in his battle, twisting midair to fling a blast in the direction of a nomu. It sent it off balance and into the side of the warehouse. Izuku took a hit from Midorishi but it was worth it if it meant keeping them safe.</p>\n<p>\"You're distracted,\" Midorishi said. </p>\n<p>\"Kinda hard not to be,\" Izuku replied. </p>\n<p>Izuku took another hit. His skidded to a stop a few feet away from the class, breathing heavily. Tenko watched him with horror in his eyes. He was pretty sure Hagakure was crying.</p>\n<p>They were only kids. They weren’t pros—not yet. USJ and the training camp were bad enough. They shouldn’t be in a battle like this yet. They shouldn’t have to experience this.</p>\n<p>“—We don’t have authorization for combat!” Iida said in a harsh whisper. He seemed to be arguing with someone in the class but Izuku didn’t dare turn to look. Not with Midorishi and his Nomu slowly advancing. At the rate this battle was going, the ending wasn’t going to be pretty.</p>\n<p>“Well, what are we going to do, die?!” Jiro snapped right back. Her ear jacks were already plugged into her amplifier.</p>\n<p>Izuku never thought he’d have to use his power on civilians, much less students and people that he considered friends. Now he knew how Aizawa felt when Izuku hd begged him to let them fight during the summer camp. </p>\n<p>“As pro hero Deku, I authorize you to use combat to defend yourself and escape!”</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>Midorishi and the remaining three Nomu cornered them.</p>\n<p>The other two were in an assortment of disarray. One was so badly burnt from different explosions that it was almost unrecognizable. Its head had been trapped in ice. The other had been attacked by a mixture of ten different quirks. They had both been so beaten that they stumbled to the ground and hadn’t once tried to get up. If anything, that only served to piss Midorishi off more.</p>\n<p> “Why can’t you just die?” Midorishi asked. Izuku only narrowed his eyes. One for All crackled around him dangerously but his arms ached from the forced output from such sheer power. He was the only thing that stood in the way of Midorishi and his Nomu. He wouldn’t let them get to everyone again.</p>\n<p>An explosion rocked the warehouse. </p>\n<p>It came from the back, out of sight from Izuku. He didn't dare look in the direction, eyes firmly on Midorishi. Uraraka squeaked in surprise. Iida tried to shield as many other students as he could despite the lack of debris. They all tensed up, ready for another villain. Midorishi seemed entirely unbothered as he glanced over his shoulder with a glare.</p>\n<p>“Nomu,” Midorishi said. The three remaining Nomu stood at attention, waiting for orders. Their huge heads turning to stare unblinkingly at the very man that commanded them. “You, on the right. Go make sure that wasn’t the heroes. That would be….unfortunate.”   </p>\n<p>Izuku sure hoped it was the heroes. He only let himself be a little relived that Midorishi didn't know what, exactly, that was either. </p>\n<p>\"So! We have time to kill, I guess,\" Midorishi said, leaning casually against the side of one of his Nomu. He met Izuku’s eyes and raised an eyebrow. “Why a hero?”</p>\n<p>“Why a villain?” Izuku challenged.</p>\n<p>“Because I’m strong,” Midorishi replied, immediately. “Yet you call yourself Deku.”</p>\n<p>“Someone once told me,” Izuku grinned. He thought of Ochako with her words years ago. He thought of how his name evolved into the person that he was today. He was <em>proud</em> to call himself Deku. He was <em>proud </em>of his name. “That my ‘Deku’ sounds like <em>you can do it</em>.”</p>\n<p>“It still means useless.”</p>\n<p>“Not to my world,” Izuku said. “Not to me.”</p>\n<p>That was the difference between the two of them. This Midorishi had let the word useless become who he was and everything he did. He tried to escape what he himself had created and, in turn, got lost along the way. Izuku wasn’t like that. His useless meant <em>useful</em>. His power meant <em>hero. </em>He fought for his family, his friends. For all the innocent people that <em>needed</em> him. He wasn’t going to let down his friends. He wouldn’t disappoint everyone who believed in him.</p>\n<p>\"Probably should've expected that. You hero types are always the same. Guess you'll always be a deku,\" Midorishi said.</p>\n<p>His left side exploded in the red lightning. It was <em>definitely</em> some sort of strength enchantment quirk—perhaps something to imitate One for All. Midorishi probably thought of it as a joke, to defeat someone with their own power. </p>\n<p>Midorishi noticed him looking and smiled in a cruel way. “Like it? Sensei gave it to me. Pretty similar to your quirk, isn’t it? I think it’s funny!”</p>\n<p>Izuku thought he had a pretty terrible sense of humor.</p>\n<p>Midorishi readied his fist. Izuku powered up One for All. He wouldn’t let this man hurt his friend. He wouldn’t let this man kill <em>any </em>of them.</p>\n<p>Just as Midorishi was about the attack, a hand tapped on his shoulder. Midorishi blinked in surprise while the lightning around him crackled out of existence. Confused, Midorishi turned.</p>\n<p>“Hey,” Todoroki Shouto said and coldcocked the bastard.</p>\n<p>There, standing in a blue and white jumper, was Shouto. An older, more experienced, more <em>familiar </em>Shouto. There was no doubt that this was Izuku’s Shouto—the very same one that he had grew up with, that he had fought with, they he had become best friends with. The one that always seemed to have his back after years and years of fights.</p>\n<p>\"<em>Shouto</em>,\" Izuku breathed. He felt like he could cry.</p>\n<p>“Is this a bad time?” Ochako stepped out of the shadows with a smile on her face.</p>\n<p>She, like Shouto, was dressed in her hero costume. The pink and blue colors were a welcomed sight as well as was the Nomu that floated several hundred feet above her, flailing around wildly.</p>\n<p>She met Izuku’s eyes and laughed, loud and relived and happy. Shouto smiled at him and gave a two-fingered wave.</p>\n<p>“You guys,” Izuku said and, yeah, he was definitely crying.</p>\n<p>Midorishi stumbled to his feet, eyes wide and crazed. He spat blood onto the ground. His body sparked with power. Shouto barley turned to look at him. Ochako rolled her eyes.</p>\n<p>Midorishi stumbled forward with a snarl. “You… how did you even get here?!”</p>\n<p>“It’s a parallel word, you fucking <em>dumbass</em>,” and, for the second time that night, Midorishi was sent to the ground.</p>\n<p>Izuku could honestly say he was surprised when he saw Kacchan—<em>his</em> Kacchan—standing over Midorishi and cracking his knuckles. There was a terrifying grin on his face but Izuku had never been more relived to see it.</p>\n<p>Ochako and Shouto immediately pulled him into a hug. Ochako was crying, but furiously wiped her tears away. Shouto held him like he was going to disappear again.</p>\n<p>\"Deku,\" his Kacchan said  as a way of greeting.</p>\n<p>\"Kacchan,\" Izuku said back, trying to keep his relived laughter at bay. </p>\n<p>Kacchan rolled his eyes and almost immediately lunged at Midorishi when he tried to attack again, a shit-eating grin firmly in place. Explosions sprang from his palm with vengeance.</p>\n<p>From there, the fight was entirely one sided for all the right reasons.</p>\n<p>Midorishi never stood a chance, even with the two reminding Nomu helping him out. Kacchan was a terrifying power when he wanted to be.</p>\n<p><em>But,</em> Izuku thought as he looked at the gleeful expression on Kacchan’s face as he pummeled Midorishi to the ground, <em>he might be enjoying this just a little too much.</em></p>\n<p>“I feel like I should be mildly terrified,” Izuku said to Shouto as he watched Kacchan blast the shit out of his counterpart.</p>\n<p>Shouto snorted. Behind him, the class (uninjured, thankfully) watched in amazement. Iida helped Tenko to his feet. Tsuyu and Uraraka were supporting each other’s weight. Kaminari was sitting on the floor, watching the fight like he couldn’t believe his eyes. The younger Kacchan was watching his counterpart with grudging respect.</p>\n<p>Ashido hesitantly approached, eyeing Ochako and Shouto, as she watched the fight happen in front of them. “So that’s what you meant when you said that your Bakugo would beat the shit out of you.”</p>\n<p>Shouto and Ochako glanced at her in surprise. It was almost like they hadn’t noticed the <em>entire class </em>that Izuku had been protecting. If he hadn’t been so tired and sore and <em>relived</em>, he probably would have laughed at their expressions.</p>\n<p>“Yeah…” Izuku said.</p>\n<p>He was just glad that Kacchan wasn’t after him this time.  </p>\n<p>“Believe it or not,” Ochako said. “He used to be worse.”</p>\n<p>Izuku remembered those time when Kacchan would ruin his stuff and make his desk explode. All the taunts, all the threats that he received. Ever since Kamino, Kacchan had calmed down considerably. They weren’t what Izuku would call friends—he doubted they’d ever get to that point—but they could work together when needed. Rivals was better than enemies. </p>\n<p>“Way worse,” Izuku agreed.</p>\n<p>Kacchan just blasted Midorishi across the warehouse. One of the remaining two Nomu were missing and Izuku had no doubt that his Kacchan had something to do with that.</p>\n<p>“Speaking of worse…” Shouto said and both he and Ochako jumped at the chance to scold him as if getting <em>sent to an alternate reality by All for One</em> was somehow <em>his fault</em>.</p>\n<p>“It’s not my fault!” Izuku said with a huff.</p>\n<p>“All you had to do,” Shouto said. \"Was walk across the street to a coffee shop. It was two blocks away. But no, instead you got sent <em>here</em> and we had to find you.\" </p>\n<p>Todoroki was staring at his alternate self like he couldn’t believe that was actually him. Everyone else didn’t seem to know how to approach this new, different Todoroki.</p>\n<p>Ochako grabbed his cheeks and pulled. Izuku tried to swat her away but she had a grip of steel. “I take my eyes off of you for a <em>day</em> and you disappear to an <em>alternate reality</em>. Seriously, why is it always <em>you</em>?!”</p>\n<p>“That’s what I want to know!” Izuku cried because if someone—godly force or otherwise—was doing this to him then he would like it if they stopped, <em>please</em>.</p>\n<p>Class 1-A watched on in the background. No one was quite sure what to make of the newcomers. Shouto was an intimidating presence but he was softer than his counterpart. Ochako had the confidence of a hero with years under her belt and the experience to match it. Both were nothing like what they were when they first arrived at UA all those years ago.</p>\n<p>The scolding trailed off and Ochako pulled him into another hug. Izuku didn’t hesitate the return it.</p>\n<p>“We missed you.”</p>\n<p>“Missed you guys, too,” Izuku said and damn, he was not going to cry <em>again. </em>It didn’t stop the bubbling relief in his chest because he would finally be able to go. “I just can’t believe you’re here. How did you even <em>get</em> here?”</p>\n<p>“It’s a parallel world, right?” Shouto said. “That means that there was the same quirk in our world. We just had to find it.”</p>\n<p>“We cracked a cold case,” Ochako told him.</p>\n<p>“And we cracked a cold case,” Shouto agreed, trying to hide his smile.</p>\n<p>Izuku was definitely going to ask for more details when he got back home but for now, Izuku was content to watch as Shouto scanned the class. His eyes landed on Tenko.</p>\n<p>Oops. Izuku forgot about that little detail. </p>\n<p>Ochako seemed to notice and visibly tensed up. Tenko looked like a deer in headlights. “An alternate reality, huh?”</p>\n<p>Izuku liked Tenko. Much more than he liked his counterpart. Tenko was a fun person to be around. He liked to play jokes with his friends, was good at Mario Kart and always offered a helping hand when needed. He tended to shut down when stressed. He snorted juice from his nose when he found things funny.</p>\n<p>Tenko wasn’t Shigaraki. He never would be.</p>\n<p> “His name is Shimura Tenko,” Izuku said carefully. It wasn’t hard to miss the surprised looks that his friends shot him. “He wants to be a hero. He’s a friend.”</p>\n<p>That alone wouldn’t convince Ochako and Shouto. It had taken him two weeks—two weeks of getting to know Tenko, of seeing his determination to become a hero. Shouto and Ochako did not have that time. Their untrusting expressions and closed off looks told him so. However, as wary as they were, they no longer looked like they were about to attack any second.</p>\n<p>Shigaraki has left his scars on them, too.</p>\n<p>Another explosion happened behind them. The screech of a Nomu could be heard, echoing through the warehouse. Shouto didn’t bother to look, too focused on examining every single one of the people that Izuku had spent the past week with. Shouto’s eyes fall onto his alternate self for a little too long.</p>\n<p>Izuku knew immediately that Shouto could tell that his alternate self <em>didn’t</em> use his left side. Todoroki could tell that Shouto <em>did</em> use his left side. Izuku couldn’t tell which side was more surprised. </p>\n<p>“I was working on it,” Izuku said, instead, when he caught Shouto’s look.</p>\n<p>Shouto nodded as tilted his head as his younger counterpart glared at him. </p>\n<p>Todoroki asked, \"Why?\" </p>\n<p>\"Someone once told me,\" Shouto said steadily and ignored the looks from the entire class, \"That it was my power. My abilities. Everyone else was giving it their all. It wouldn’t be fair to everyone if I didn’t give a hundred percent, right?\"</p>\n<p>Toodoroki’s eyes flickered over to Izuku. Understanding blossomed there, but Torodoki immediately closed off his expression and said, “I see.”</p>\n<p>Todoroki still had a long way to go. That’s okay, because he had his friends to help him out.</p>\n<p>Uraraka hesitantly approached, looking at Ochako with wide eyes. “Wow. This is me as a hero?”</p>\n<p>“Sure am!” Ochako said proudly. Then, she seemed to realize something and looked up at the Nomu that was still screeching at them a hundred feet above. “Speaking of…”</p>\n<p>Ochako pressed her fingers together and the Nomu promptly dropped from the sky. It hit the ground with a <em>thud, </em>not ten feet from where Kacchan and Midorishi were still fighting. Shouto froze it to the ground before it even had the chance to move. It cried out, struggling to escape its icy prison, but not even a Nomu could escape from something like that.</p>\n<p>“Watch it, Round Face!” his Kacchan snapped as he dodged the nomu. He flung Midorishi over his shoulder when the villain tried to take advantage of his distraction. Kacchan then nearly slipped on a piece of ice, cursing all the while. “Fucking <em>half and half</em>!”</p>\n<p>Midorishi sneered in their direction right before taking an explosion to the face, courtesy of Kacchan. Ochako caught sight of it and whistled, visibly learning back.</p>\n<p>“I just…I don’t get this,” she said. Shouto nodded in agreement. Izuku didn’t know what they were talking about.</p>\n<p>“Midoriya ‘<em>I have no self-preservation when it comes to anyone in danger’</em> Izuku,” Shouto said. Izuku nudged his side with a snort but Shouto paid him no mind. “As a villain.”</p>\n<p>“I’ve seen him break his arm to save a cat,” Ochako told 1-A like it was a story that everyone needed to hear.</p>\n<p>Izuku felt his face heat up when several of them, including younger Kacchan and Tenko, turned to look at him.</p>\n<p>“He does seem to break his arm over everything,” Shouto agreed which was a load of bullshit because Izuku hadn’t broken his arm in <em>months, thank you very much. </em></p>\n<p>“Guys,” Izuku tried.</p>\n<p>They didn’t listen. Ochako gave Shouto a weird look. “Yeah, but…a cat.”</p>\n<p>“To be fair, it was Hitoshi’s cat.”</p>\n<p>“Hitoshi’s cat hates him.”</p>\n<p>“She does.”  </p>\n<p> “Are we sure we’re talking about the same person?” Tsuyu asked.</p>\n<p>Ochako smiled at her, but Izuku <em>knew</em> that smile. Nothing good ever came from that smile. Unfortunately for Izuku, Ochako wasn’t the one that he needed to worry about.</p>\n<p>“Oh, definitely,” Shouto said. Izuku begged with his eyes for Shouto not to tell any more embarrassing stories, but Shouto didn’t even glance in his direction. “One time he accidentally made a baby cry and started crying himself.”</p>\n<p>Tsuyu is so surprised that she laughed. Tenko shot him a look and Izuku tried to hide his face. Todoroki was watching his counterpart like he couldn’t quite believe what he was like. The younger Kacchan snorted. Kaminari  and Kirishima laughed so hard that they had to sit on the floor.</p>\n<p>“Shouto, <em>please</em>,” Izuku begged because his friends were <em>awful. </em>He’d rather be beaten up by his alternate self than listen to Ochako and Shouto drag his good name through the mud.</p>\n<p>But, as much as Izuku was embarrassed, he couldn’t help but thank his friends silently.</p>\n<p>Shouto and Ochako were heroes. <em>Very</em> good heroes. They’d gone through hero training, they’d been in countless situations. They dedicated their lives to keeping people safe and calm, which was exactly what they were doing there. Keeping Everyone’s mind off of Midorishi Izuku and the attack that he had just tried to make. They knew what they were doing. Kacchan had the fighting part down. They just had to keep everyone from panicking until another hero (one from UA, Izuku hoped) arrived on the scene.</p>\n<p>So far, it was working.</p>\n<p>A door slammed open behind them. Light from the outside streamed in.</p>\n<p>Izuku sighed in relief when a familiar voice called out, “Is everyone okay in here?”</p>\n<p>“Aizawa-sensei!” most of the class called out, relived.</p>\n<p>At the sound of their voice, Aizawa quickly entered the warehouse. His students flocked to him and nearly tackled him to the ground from the force of their hug. Aizawa stumbled, huffing at them, but there was an undeniable amount of relief in his eyes when he saw they were all okay.</p>\n<p>“Over here,” Izuku called. Ochako waved at him.</p>\n<p>Aizawa took one look at the two newcomers and sighed. He walked over anyways.</p>\n<p>“What happened?” Aizawa asked.</p>\n<p>He still seemed to be checking over all his students to make sure they weren’t terribly injured. Izuku liked to think he did a pretty decent job defending all of them when he saw there were no more than a few bruises and some minor cuts.</p>\n<p>“Midorishi ambushed us at the mall,” Izuku told him. “Kurogiri warped us here. Midorishi and five Nomu tried to attack us. Shouto, Ochako and Kacchan showed up. They’re from my world.”</p>\n<p>“Good to see you again, Aizawa-sensei,” Ochako said.</p>\n<p>Shouto offered a wave. Aizawa looked at them and then pinched the bridge of his nose like he couldn’t believe there were <em>more of them. </em>  </p>\n<p>An explosion rocked the warehouse. In front of them, Midorishi and Kacchan were still locked in a battle. Midorishi had lost his remaining Nomu, having been burnt to a crisp not two feet from where he stood. Midorishi had long since lost his smile and was staring at Kacchan like he was the devil himself. Kacchan just bared his teeth in a grin (he was enjoying this way too much).</p>\n<p>Aizawa looked like he was about to step in but Shouto held out a hand.</p>\n<p>“He doesn’t need any help, if you were wondering,” Shouto said. He never took his eyes off the battle.</p>\n<p>“Bakugo has an awful personality but he’s number two for a reason,” Ochako agreed.</p>\n<p>“Number <em>TWO</em>?!” Younger Kacchan spat.</p>\n<p>Kirishima had to hold him back so that he didn’t lunge at Ochako.</p>\n<p>Ochako raised an eyebrow, unimpressed. “I dealt with this fit once, Bakugo. I’m not about to deal with it again.”</p>\n<p>Younger Kacchan spat at her in rage. The rest of the class, including her younger self, looked at her in surprise. It seemed that not many people were willing to talk to Kacchan like that. She saw their faces and laughed, proceeding to explain everything about what happened during the next few years of UA.</p>\n<p>The rest of the UA teachers arrived not five minutes later after Ochako had thoroughly trapped everyone in what Izuku was <em>sure </em>was another embarrassing story about his hero exploits. </p>\n<p>There was an initial rush of panic when they first arrived, unsure if the students were safe, but that faded when they saw the group watching Kacchan’s match like a football game. All Might and Present Mic came to a stop next to Aizawa, watching the entire beatdown with wide eyes. The rest of the teachers followed suit, not exactly sure what the make of the entire situation.</p>\n<p>Izuku must think it was a little crazy with Shouto and Ochako there, standing next to their counterparts. The five Nomu were in various stages of disarrangement. Midorishi <em>was</em> there, but with the amount of explosives and the blonde and black blur, he didn’t seem to be a problem.</p>\n<p>“Bakugo?” All Might asked.</p>\n<p>“Bakugo,” Aizawa agreed.</p>\n<p> </p>\n<p> </p>\n<p>At first, Tenko had thought the situation at the mall was only going from <em>bad</em> to <em>worse</em>.</p>\n<p>Kurogiri, the fucker, warped them all the what looked like an abandon warehouse (now wasn’t that just <em>cliché—</em>). Midorishi and his five Nomu were a terrifying sight to behold. When Midorishi attacked, Midoriya was immediately on the defensive, desperately fighting to keep them safe. Tenko couldn’t help but think this was like Kamino Ward all over again. Except, this time, they didn’t have any way to escape. Then, by some miracle, they were saved by people from Midoriya’s own world.</p>\n<p>Not just <em>any</em> people, either. Todoroki Shouto, Uraraka Ochako and Bakugo <em>fucking </em>Katsuki.</p>\n<p>As the tide changed and the battle raged on, Tenko couldn’t help but admire the three. They were so <em>different </em>from what he thought they would be like. Tenko had seen Midoriya’s pictures, he knew they were different, but knowing something and seeing something were two very different experiences.</p>\n<p>This Todoroki carried himself with a dignity that their Todoroki didn’t have yet. The calm, cool persona but without all the coldness. He was more approachable, more friendly. He joked and laughed and teased Midoriya.</p>\n<p>Midoriya’s Ochako was confident. She knew her abilities and used them to the fullest. She was strong and capable and let everyone know it by the way she carried herself, yet Tenko could still tell that she was every bit as kind and honest as the person he liked to call a friend.</p>\n<p>Tenko didn’t get to form much of an opinion about their Bakugo, seeing as he blasted off to go beat up Midorishi almost immediately but Tenko couldn’t help but be at least a <em>little </em>bit grateful that he was here. He couldn’t help but admire the strength as he held off a hero that almost killed Aizawa in USJ with apparent ease.</p>\n<p>The most surprising change wasn’t one of the newcomers; it was Midoriya himself. Tenko hadn’t noticed how reserved Midoriya was being until he saw him next to people that he was comfortable with. He laughed and joked and took their teasing in his stride. His expression was open and truly happy—a far cry from the smiles that he’d been giving the entire time he’d been suck in their world.</p>\n<p>Tenko was happy for him.</p>\n<p>Now, the battle was winding down. The teachers had arrived and Tenko could hear the distinct wail of police sirens on the distance. The man that had caused them all so much pain and suffering, from USJ all the way to Kamino Ward was finally defeated.</p>\n<p>It was over for Midorishi.  </p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>When All Might first got the news that the class had been attacked and were currently missing, he panicked. He begged Aizawa to take him and let him search even though his power was completely gone. Aizawa had agreed, if he stayed with the police.</p>\n<p>All Might had never felt so useless. Those few hours wondering if his students were even still alive were the worst of his life. hen, they’d gotten a call from Aizawa—he’d found them, they were safe, and All Might could finally breathe again.</p>\n<p>When he arrived at the scene, he could safely say that he was not the only one surprised by the outcome. His students were safe, of course, but they were not alone. Midoriya Izuku stood beside two newcomers—two very, very familiar newcomers.</p>\n<p>All Might was willing to bet that there was a third, based on the explosions and the yelling that were oh so familiar.</p>\n<p>Todoroki Shouto, Uraraka Ochako and Bakugo Katsuki were not three people All Might expected to see. At least, not as grownups.</p>\n<p>The battle winded down to a close with Bakugo standing victorious. The gathered police didn’t quite know what the make of the situation. All three of the newcomers showed their hero license although the debate over their validity was fresh on everyone’s mind. They took it in stride, not quite sure if they were valid but not willing to argue—and promptly tied the unconscious and beaten Midorishi as much as they could.</p>\n<p>With that, All for One was left without a successor.</p>\n<p>It wouldn’t stop him. Not for long. All Might knew that the most out of everyone but it would slow him down. Give them time for a counter attack. They would stop him before he ever got strong enough to search for another. With the combined might of UA, the knowledge that Midoriya had given them and the heroes from all around Japan, All Might was confident they would win.</p>\n<p>He looked at his students and hoped that they would never have to worry about that man again.</p>\n<p>The line of police was difficult to get through, but All Might managed. He approached where all of his students were gathered around, giving statements to the police. None of them seemed injured and for that, All Might was grateful, but they weren’t who he was looking for.</p>\n<p>He found Midoriya Izuku and the rest of the people from his world near the corner of the warehouse. They seemed locked in conversation and All Might almost didn’t want to interrupt, but some words needed to be spoken. As he approached, he started to hear snippets of their conversation.</p>\n<p>“—You can let go of me,” Midoriya was saying.</p>\n<p>The other Todoroki Shot has his hand firmly clamped on to Midoriya’s wrist. Midoriya seemed to be giving him an exasperated look as he struggled to free it.</p>\n<p>“No,” Todoroki said. “Naomasa said we <em>have</em> to be touching you if you want to be sent back with us.”</p>\n<p>The older Uraraka scratched the back of her head sheepishly. “We only had two hours to find you. We kinda got caught up in the chaos and lost track of time.”</p>\n<p>“And you’re a dumbass who would definitely get his ass stuck here a <em>second</em> time if halfie let you go,” Bakugo said.</p>\n<p>“No, no. I think I’m done with dimension hooping,” Midoriya said but still failed to free his wrist.</p>\n<p>Bakugo was the first to notice All Might, crossing his arms over his chest and raising his eyebrow. He was covered in a variety of bruises and cuts. One of his arms seemed to have taken the worst of it, with a large purple bruise spanning from his shoulder to his fingertips. One of his gauntlets was broken.</p>\n<p>Their Todoroki gave him a nod in greeting. Their Uraraka waved cheerfully. Midoriya turned around to face him with a smile on his face.  </p>\n<p>Looking at the four of them, standing together like the heroes they were, all All Might could say was, “Thank you.”</p>\n<p>Midoriya looked confused, like he didn’t understand what All Might was thanking them for. “What?”</p>\n<p>All Might glanced back at his students who crowded around each other and chatted in excitement. All Might was just glad they were still alive to do such a thing. “You protected them. For that, I thank you.”</p>\n<p>Midoriya blushed to the roots of his hair.</p>\n<p>Their Uraraka threw an arm around his shoulder with a smile and said, “He couldn’t be able to not help someone even if he tried.”</p>\n<p>“I know,” All Might said. “Your world is lucky to have him.”</p>\n<p>Midoriya sputtered out something incomprehensible with their Uraraka laughed. Todoroki nudged him, wrist still firmly clasped in his hands. Bakugo crossed his arms and rolled his eyes with a <em>tsk </em>sound.</p>\n<p>These were heroes—the ones that promised with their blood, sweat and tears to protect the innocent. The people who poured their life into their work and see it not as a job but as a <em>duty. </em> If his students came out to be half the heroes that these four were, All Might would consider himself satisfied.</p>\n<p>“All of you,” All Might said. He wished he could pour all of the gratitude he was feeling into words. Maybe then he would be able to properly thank all four of them. “Thank you all.”</p>\n<p>“I’m sorry that I couldn’t have helped more,” said Midoriya, who had helped the most out of all of them.</p>\n<p>All Might looked at Midorishi Izuku in custody, going to Tartarus to never escape again. He thought of all the information they’ve gained, all the plans that they received. All for One might still be free, but he had a devastating blow delivered to him tonight. It was only a matter of time before All for One was defeated as well.</p>\n<p>“My boy, you’ve done plenty.”</p>\n<p>Midoriya beamed at him. Their Uraraka elbowed him in the side playfully. Their Todoroki mothed something that looked suspiciously like <em>Dad Might </em>to Midoriya, who promptly stepped on his foot. The three laughed and joked and teased each other with Bakugo sitting on the sidelines looking resigned.</p>\n<p>They didn’t even notice when the bright light appeared on the corner of Todoroki’s face, quickly spreading down the side of his cheekbone.</p>\n<p>Just as All Might is about to say something (because being enveloped in light is <em>strange) </em>Bakugo stretched, cracking his fingers (which were already glowing) and said, “Fucking <em>finally</em>.”</p>\n<p>The light had taken over at least half of their bodies at this point. A gold and green swirl of colors spreading as fast as it could. Their Uraraka lunged and grabbed Midoriya’s shoulder, despite Todoroki never having once let go of his wrist. The light traveled from the tips of their fingers onto Midoriya who started to glow as well.</p>\n<p>“Time to go now, I guess,” Todoroki told All Might.</p>\n<p>The light had attracted more people and, by the time the light reached their toes, the entire class of 1-A was standing there and waving their goodbyes.</p>\n<p>“It’s been interesting,” Tsuyu said.</p>\n<p>Ashido laughed in agreement. Sato and Shoji offered small waves. Aoyama flashed the four of them a dazzling smile. Sero, Ojiro Iida, Uraraka, Koda, Tokoyami, Hagakure, Todoroki and Yaomomo all called out their own version of a goodbye.</p>\n<p>“Come visit us soon!” Kaminari shouted and was promptly whacked by Jiro.</p>\n<p>Kirishima helped him to his feet while Bakugo—the very Bakugo that All Might has been teaching—rolled his eyes.</p>\n<p>Tenko stood a little bit in front, bittersweet smile on his face. “Bye, Midoriya.”</p>\n<p>“You’re going to be a fantastic hero, Tenko,” Midoriya said. The green and gold light had almost covered his entire face. Pieces of the older Uraraka, Shouto and Bakugo were already chipping away into nothingness. “Tell Mirio I said goodbye.”  </p>\n<p>Tenko looked at his hands and back to Midoriya. His gloved fingers curled into a determined fist. “I will. Thank you.”</p>\n<p>Midoriya’s feet started flaking away, leaving nothing there. Bakugo was almost completely gone already, Uraraka a close second. She still had her hand clasped firmly on Midoriya’s shoulder. Todoroki hadn’t let go of Izuku’s wrist, despite being nothing more than a glowing torso at that point. The light grew brighter and brighter until All Might was forced to look away. He could only vaguely see Midoriya’s outline through his fingers until suddenly there was no more.</p>\n<p>Midoriya Izuku disappeared in a gold and green light.</p>\n<p> </p>\n<p> </p>\n<p>When Midoriya Izuku opened his eyes, he was surrounded by his friends.</p>\n<p>They took one look at him, awake and okay <em>and alive</em> before tackling him to the ground. Their laughing and cheers and joy echoed around the pristine white room as they all chattered excitedly. Izuku almost felt overwhelmed. His friends missed him just as much as he missed them.</p>\n<p>It takes a while, and with some prompting from Naomasa, but they eventually untangle themselves and let Midoriya stand. He laughed, relieved tears running down his face as he hugged all of them, making assurances that <em>yes, he was okay</em> and <em>yes he was still alive</em> and <em>yes he was never going to do something like that again</em>.</p>\n<p>Sero patted him on the back. “Midoriya, dude, don’t ever scare us like that again.”</p>\n<p>\"We kinda need you, dude,\" Kirishima agreed. </p>\n<p>Tenya pushed his way through the crowd. Izuku made out his broad shoulders before he shot off for a hug. Tenya caught him with a breathless laugh before putting him down and holding him at arm’s length. “I’m glad you’re back.”</p>\n<p>“Everyone…” Izuku said and there were definitely tears in his eyes. He was <em>so relived </em>to be back. There was a lot to say but…he was <em>safe</em>, he was <em>home</em>, he surrounded by his friends and family, and most, importantly… “Tenya, I owe you an apology. I really do get in trouble just by being there.”</p>\n<p>Tenya laughed and his friends pulled him into another hug. Their comfort and joy was contagious. Izuku couldn’t stop himself from smiling. The past few weeks had been a lot, both mentally and physically. He’d learned a lot of things about himself that he never knew. He learned from past mistakes and fixed ones for the future. His guilt, his grief, his laughter, his joy, his happiness. Yet, he felt most safe here, surrounded by friends.</p>\n<p>Midoriya Izuku was finally home.</p>"
}