{
  "id": "16729350",
  "url": "https://archiveofourown.org/works/16729350?view_full_work=true",
  "author": [
    "mollrach13"
  ],
  "title": "Allow One to 'See'",
  "rating": "Not Rated",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "Merlin (TV)"
  ],
  "relationships": [
    "Merlin & Arthur Pendragon (Merlin)",
    "Gwen & Merlin (Merlin)",
    "Gwaine & Merlin (Merlin)"
  ],
  "characters": [
    "Merlin (Merlin)",
    "Arthur Pendragon (Merlin)",
    "Gwen (Merlin)",
    "Gwaine (Merlin)",
    "Leon (Merlin)",
    "Elyan (Merlin)",
    "Percival (Merlin)",
    "Gaius (Merlin)",
    "Kilgharrah (Merlin)",
    "Iseldir (Merlin)"
  ],
  "additional_tags": [
    "Magic Revealed",
    "Alternate Universe - Canon Divergence",
    "Protective Arthur Pendragon (Merlin)",
    "Protective Gwaine",
    "Crystals",
    "Post-Season/Series 04",
    "Selfless Merlin",
    "smart merlin"
  ],
  "language": "English",
  "series": "",
  "published": "2018-11-24",
  "completed": "2018-12-12",
  "words": "28,398",
  "chapters": "6/6",
  "comments": "631",
  "kudos": "16,495",
  "bookmarks": "4,206",
  "hits": "132,176",
  "summary": "<p>When the King is attacked in his tent on patrol and falls into an unending sleep everyone is worried. What they don't know is that Arthur is fine. In fact he is standing right here next to them, watching them all fret over his prone body. To stave off the boredom whilst a cure is found Arthur takes to wandering the castle and soon discovered a hidden side of Camelot he never knew about. </p>\n<p>Or: Arthur's soul gets trapped outside his body and takes to following his servant around. He gets an interesting insight into Merlin, his servant's life and just how much Camelot needs the man.</p>",
  "notes": "<p>So I never post fics in parts. Mainly because I am worried that if it doesn't get a lot of response I'll get disheartened and never post the rest. And I hate not finishing things. </p>\n<p>Rest assured this is complete but there is quite a lot to this fic so I thought this one was best to *nervously* post it in parts. </p>\n<p>There will be six chapters in all and just under 30K word count. I'm posting chapter one and two together as chapter one is too small on its own. I will re-look over the other chapters and will be looking to post every 3-4 days wifi permitting. If you want the next chapter posting sooner... comment! Let me know. </p>\n<p>Here it goes...</p>\n<p>Thank you so much to everyone who commented :) I was going to post this next part tomorrow but I got it all checked and edited so I thought I would get it out early to you all!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>Still a few more parts to edit and post so let me know that you are all still enjoying it. I will hopefully be able to get the next part up before the weekend (but comments make me edit faster) ;)</p>\n<p>Thank you to everyone that has commented so far :) <br>Here Merlin has another run in with Lord Bodin, Arthur and Merlin go to see the Druids and figure out what has happened to Arthur.</p>\n<p>Thanks for those that continue to comment :)<br>So Arthur has now seen that Merlin is smart, that his Knights listen to him, that he can strategise and plan, that he puts all before Camelot... How about Arthur witnessing some BAMF!Merlin?</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">more notes</a>.)\n</p>\n<p>Only one planned part left :D <br>As always it is pretty much finished but I am not completely happy with the ending just yet so if you have any suggestions for what you want to see happen or anything like that feel free to send them over! Something might bash the last few paragraphs into shape.</p>\n<p>First of all - thank you to everyone who has commented. I am not able to respond to them all individually but know that I really appreciate them and they have helped me push through this final chapter.<br>Secondly - I am so sorry for the wait. Life got in the way but here is the final chapter.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">more notes</a>.)\n</p>\n<p>And that's it... for now. Arthur knows, Arthur is saved, Merlin knows Arthur knows and he is saved too. Now they can go back to Camelot, Arthur can lift the ban on magic and live happily ever after.<br>Although the story is complete as much as I had planned I am considering an epilogue... let me know if that is something you would want to see! Thanks for reading and I hope you enjoyed.</p>",
  "text": "<p>The last thing that Arthur clearly remembers is Merlin’s sulking face in his tent. </p>\n<p>OK, perhaps ‘sulking’ is too strong a word, considering the boy had likely been awake since before dawn. But there was really only so much moping that Arthur could handle. </p>\n<p>“What is wrong with you Merlin?” Arthur had barked when Merlin fumbled with his armour once again, letting a vambrace drop to the floor. </p>\n<p>“Nothing,” his servant had said with a shrug. “Just tired.”</p>\n<p>“Well go to bed and get untired. We’ve got another five days on this patrol and I don’t want to have to spend it with you moping.”</p>\n<p>Merlin had shot him a slightly wounded look and gone to his own bedroll outside beside the fire. Arthur had sighed loudly, lamenting his lot in life that he had to deal with such a sullen manservant, and gone to bed himself. </p>\n<p>The next thing he knew was pain. Pain like nothing he had ever felt before. Like his heart was being ripped from his chest. Then a blinding light. Then nothing. </p>\n<p>-</p>\n<p>When Arthur’s senses finally return he feels as if he is in a dream. His being feels light, like it could float away any moment. Testing each of his limbs in turn Arthur determines he isn’t gravely injured, he doesn’t feel any immediate pain but the ghost memory of that lancing agony in his chest has him move very gingerly. </p>\n<p>When he finally opens his eyes the most peculiar sight assaults him, and he is sure he is dreaming. </p>\n<p>He is laid on the floor of what looks to be his chambers, though he cannot say he has ever seen it quite from this angle. His vision is taken up with the legs and boots of various people and when he cranes his head upwards he sees the familiar figures of Gaius, Leon and Elyan with his arm in a sling, all gathered at the side of his bed. </p>\n<p>Arthur groans, pushing himself slowly to sitting. No one even glances down at him. </p>\n<p>“Oh, don’t mind me,” he grumbles, getting his feet beneath him. “I’m only the King of this god forsaken kingdom.”</p>\n<p>The change in height makes a strange ringing chime through his head and Arthur leans heavily against the bedpost, shaking his head to clear it. He still feels very strange. He must have been taken gravely ill on patrol for him to have been brought back to his chambers with no recollection of the journey. </p>\n<p>“What happened?” he asks groggily, mainly aimed at Gaius as the old man always seems to be the voice of reason in any room. </p>\n<p>Again, silence is all the response he gets. </p>\n<p>Then, when Arthur’s ears have finally stopped ringing, he glances down at the bed to see what the hell has caught everyone’s attention so raptly they ignore their sovereign… Only to be faced with the sight of himself, King Arthur, laid resplendent on the bed before him. </p>\n<p>-</p>\n<p>Arthur’s first reaction to seeing himself laid unconscious on the bed in front of him is not his proudest moment (he lets out a startled yelp, a little too high in octave for his own personal preference and stumbles backwards falling back down onto the floor again).</p>\n<p>His second reaction (once he had got back up) is to shout. Loudly. It does not take him very long to realise that no one can hear him. He then starts frantically waving his arms around in a manner more akin to a chicken than a King of the Realm. He isn’t sure whether he is happy or not that no one seems to be able to see him either. </p>\n<p>“How did this happen?” Guinevere asks once Gaius has finished his inspection. She is asking Gaius, but her eyes are flicking between Gaius and Merlin who is hovering at the edges of the room. </p>\n<p>“I don’t know Gwen,” Arthur’s servant responds, guilt dripping from each word. “I was asleep. The first thing I knew about it was the Knights yelling. When I woke up Elyan had already been hit, the attackers had gone and then…” he gestures down at Arthur’s prone body. </p>\n<p>“I heard chanting from the tent and went to investigate,” Elyan explains. “They were dressed plainly in black, no armour. One of the men had a crystal over the King. As soon as they saw me they ran.”</p>\n<p>“We were unable to catch them in the dark Your Highness,” Leon continues, addressing Guinevere. “Once we realised the King would not wake and Elyan was injured we made haste for Camelot.”</p>\n<p>“I am unsure what the issue is Gwen,” Gaius says solemnly, still looking down at Arthur’s body with a frown. “It appears as if the King is sleeping yet he will not wake.”</p>\n<p>“Gaius you have to fix this!” Arthur curses at the physician. Gaius doesn’t even blink. With a growl of frustration Arthur swings his arm at the nearby vase. His hand simply sails through it. With his lack of an outlet for his deafening anger Arthur actually roars. Conversation carries on around him. </p>\n<p>“I don’t think it wise that we make the king’s condition public knowledge your majesty,” Gaius is saying in the background. </p>\n<p>“He’s right,” Merlin mumbles, taking a step forward. “It is still too soon after Morgana’s reign and your wedding.”</p>\n<p>Leon nods. “The Lords are still wary after Morgana. Arthur had only just started to gain their confidence back. Finding out that he is asleep and we don’t know how to wake him could be just the thing a Lord needs to make an attempt on the throne.”</p>\n<p>“Or Morgana,” Merlin mutters ominously. The room quietens then, considering the implications of this whole situation and Arthur cannot find fault in what any of them are saying. </p>\n<p>“Well if you think that is best then that is what we shall do,” Guinevere says, a slight quiver of unease in her voice. </p>\n<p>Arthur steps forward towards his wife, to offer his comfort, but Merlin just walks right through his body and reaches Guinevere’s side before Arthur can even recover. Guinevere sinks into the servant’s embrace easily. </p>\n<p>“What will we tell court about Arthur?” Elyan asks the room. “They will have seen him brought back injured.”</p>\n<p>“Merely assigned bedrest by the court physician,” Gaius says. “It is a leg wound. Too much movement in healing can elongate the process.”</p>\n<p>“I will talk to the Lords,” Merlin offers. “Let them know that you are not to be disturbed.”</p>\n<p>The group disperses from the bedside, talking quietly amongst themselves and Arthur is drawn to his own body like a moth to the flame. It is a strange experience, he thinks, looking down at his own sleeping face. In fact, this is the first time he has ever looked at himself with his eyes shut. </p>\n<p>As Arthur always does in moments of great stress or upheaval he takes a minute to take stock of the situation.</p>\n<p>His body is here in the bed, sleeping. </p>\n<p>But Arthur is here, standing next to his bed, looking down at his closed eyelids. </p>\n<p>No one can hear him. No one can see him. He cannot touch anything. He cannot feel anything. It is almost like he does not exist. Yet clearly, he does. </p>\n<p>Arthur looks down at his body once more and heaves a great sigh. </p>\n<p>Arthur thinks that it says something about his life that this is not the strangest thing that has ever happened to him.</p>\n<p>The early morning sun is peaking between the heavy curtains of the royal chambers the next time Arthur hears the creak of the opening door. It is so quiet that it would not have woken him if he had been able to sleep at all, but apparently another torment of this ghost presence he seems to be stuck in is an inability to sleep at all. It doesn’t wake Guinevere who had fallen asleep late into the night propped in the chair beside his bed. </p>\n<p>Arthur looks away from his sleeping wife to the opening door and is not surprised to see Merlin edging silently into the space. His servant’s eyes go straight through Arthur to the body laid on the bed, something heavy and burdened in his eyes for just a second. </p>\n<p>It is gone quickly as Merlin’s gaze settles onto the sleeping Gwen and softens. The servant sighs and shakes his head in fond exasperation as he settles the tray of food on the dining table. He steps through the room silently, his feet sure and steady against the old timber floor treads. </p>\n<p>“You are never this quiet when coming to wake me in the morning,” Arthur grouses, crossing his arms over his chest. </p>\n<p>“Gwen,” Merlin whispers softly when he reaches her sleeping form. “Gwen,” he repeats, crouching down at her side. She snuffles daintily in her sleep fighting against the wakefulness Arthur can see permeating through her body. </p>\n<p>“You’d better wake up. The Cook is calling for you,” Merlin says with a teasing lilt to his voice. “She’s very angry. You’re late to serve breakfast. Quick Gwen!”</p>\n<p>“That is a terrible trick,” Gwen grumbles tiredly as her eyes peek open. Arthur watches her look down on the grinning Merlin and her face opens with a smile. </p>\n<p>“Sorry,” Merlin chuckles, sounding not sorry in the slightest. </p>\n<p>Gwen seems to agree with Arthur as she swats at Merlin’s arm with a lazy hand. He playfully dodges away and finally comes to Arthur’s bedside. </p>\n<p>“Nice to have your attention at last Merlin,” Arthur huffs watching Merlin watch his body as he stands to the side. It is a disconcerting notion. </p>\n<p>“And good morning to you too My Lord,” Merlin says warmly as he starts inspecting beneath Arthur’s eyelids. </p>\n<p>Arthur’s heart leaps into his mouth. “Merlin,” he starts breathlessly. “Did you hear me?”</p>\n<p>But Merlin ignores him in favour of prodding at his body’s neck with two fingers. </p>\n<p>“Is there no change?” Gwen asks. </p>\n<p>“No, not since last night.”</p>\n<p>Gwen seems to deflate into her chair at that. “I just wish he would wake.”</p>\n<p>“He will soon enough,” Merlin says with a smile. “Just as soon as we figure out what caused his slumber.”</p>\n<p>“He just looks so…. He is so still,” Gwen says leaning forward in her chair. “In the night I dreamed that he was just sleeping and that he would wake with a snore in the morning and demand his breakfast.”</p>\n<p>“Keep your voice down or he might hear and do just that!” Merlin says with laughter in his voice. “But I only brought one breakfast and it is for you. Come and eat.”</p>\n<p>Merlin chuckles along with Gwen and Arthur smiles sadly, watching the two old friends in the morning light. Merlin steps away from the bed then gesturing for Gwen to follow. When her only movement is to grab Arthur’s hand Merlin stills and comes back over to his friend. </p>\n<p>“How can you be so sure he is alright?” Gwen whispers quietly.</p>\n<p>“Because his body is truly sleeping,” Merlin explains. “Look.” With an expert hand Merlin gently peels back the eyelid of Arthur’s body. “His eyes react to light.” He presses his ear to Arthur’s chest. “His heart beats strong. How does his hand feel?”</p>\n<p>Gwen runs her fingers over Arthur’s lax ones. “Warm.”</p>\n<p>“So his blood runs well. His body is strong and alive and safe. He will wake and when he does he will have my head if you are not in the same way so please, come eat your breakfast?”</p>\n<p>With a huff and smile Guinevere stands then, letting Arthur’s hand slip through her grasp. Although Arthur had not been able to feel her touch he feels almost bereft now that it is gone and he is stood alone by his prone body. </p>\n<p>Guinevere and Merlin are chatting amicably over at the breakfast table but Arthur can’t seem to tear his eyes away from the image of himself laid out, seemingly asleep. So many times in the night he had tried to tie himself back to his body. He had shouted, he had screamed, he had tried jumping into the corpse before him. Nothing had worked. </p>\n<p>Frustration is bubbling up inside him again and he longs for the reassuring depth of his own compact body to be able to pick something up and throw it. Preferably at Merlin’s head. </p>\n<p>A knock at the chamber door derails his fancy and all three beings in the room turn to look at the closed door. </p>\n<p>Gwen looks back at Merlin with wide eyes. </p>\n<p>“I thought you gave the court instructions not to disturb us?” Arthur asks brusquely. Really Merlin had one job to do. </p>\n<p>“Don’t worry I’ll get rid of them,” Merlin mumbles unhappily.</p>\n<p> Arthur walks over to Merlin’s side so he is easily able to get a good view of the early morning visitor when Merlin opens it a fraction. </p>\n<p>“Lord Bodin,” Merlin greets the greying man in Arthur’s doorway. </p>\n<p>Arthur thanks his invisible appearance for the first time as he is able to let out the very heartfelt groan he normally has to curtail when this particular Lord comes knocking. It always seems to be at whatever hour of the day Lord Bodin chooses. As if his life’s mission is to keep Arthur in a perpetual state of uneasiness. </p>\n<p>“How can I help you at this hour of the morning?” The smile Merlin offers the early morning visitor is so bland and wooden that Arthur snorts. </p>\n<p>The Lord sniffs, holding his nose in the air. “I wish to speak with the King.”</p>\n<p>“The King is on bed rest, as you know,” Merlin explains slowly. “And the queen is still preparing for the day. Shall I pass on a message?”</p>\n<p>“When will the Queen be fit for a visitor?”</p>\n<p>“The Queen has a very busy morning planned I am afraid. She will be taking court this afternoon should you have a matter you want to discuss.”</p>\n<p>“Do you think I would be here if it could wait until court boy?” the Lord snaps. </p>\n<p>Arthur bristles at the Lord’s tone but Merlin simply stares back at the old man with a bland mask. </p>\n<p>“Don’t let him in Merlin,” Arthur hisses giving the Lord his most contemptuous glare. </p>\n<p>“Really Lord Bodin,” Merlin says. “I am happy to pass on any missives or messages you may have.”</p>\n<p>“It is an urgent matter,” Lord Bodin huffs, looking down his misshapen nose at Merlin. “One that I do not wish to discuss with a servant.”</p>\n<p>“Very well then. The Queen will see you at council.”</p>\n<p>And with that Merlin shuts the door in the Lord’s face. Arthur lets out a crow of laughter, clapping his hands in glee. “Yes Merlin. You don’t know how many times I have wished I could do that.”</p>\n<p>Merlin turns back to the table and see’s Gwen watching him with a pointed look. </p>\n<p>“What?” he asks innocently. </p>\n<p>“You know very well what,” Gwen says sternly but Arthur can see the twinkle of amusement in her eyes. “He is going to punish me for that in chambers later.”</p>\n<p>“He was going to be difficult anyway. Now I have given him a reason to be difficult and mutual ground for you to complain about me at length. Arthur does it all the time.”</p>\n<p>“He’s right I do,” Arthur points out. “It is a very successful distraction technique.”</p>\n<p>“So Arthur lets you be rude to the Lords he doesn’t like because he cannot be?” Gwen asks. “And then uses their dislike of you as a talking point. To distract them from what they really wanted to complain about?”</p>\n<p>“Exactly!”</p>\n<p>“I’ll never understand you two,” she chuckles with a shake of her head. </p>\n<p>The mood in the room darkens as Gwen and Merlin’s chuckles peter out. Arthur can see Gwen’s worried gaze darting back to the bed and his prone form. </p>\n<p>“Paperwork!” Merlin crows drawing both Gwen and Arthur’s gaze back to him. He shuffles off to the desk coming back with a thick stack of missives and correspondence. “Arthur normally goes through these at breakfast so he has time to think about what he wants to say at council.”</p>\n<p>“All of them?” Gwen asks weakly eyeing the thick stack of paper. </p>\n<p>“Well… no,” Merlin responds. “I read them all and prioritise them for him. What is going to definitely be brought up at council and what needs immediate attention first and then all the other stuff last. All the things that are not that important you can delegate to your Lords in chambers. Here, start with this one.” </p>\n<p>Merlin holds out a piece of paper. “An invite from Queen Annis?” Gwen asks sceptically. </p>\n<p>Merlin nods already reading through the rest of the papers. “Yes, the council will want you to go. To foster good relations or some other such rubbish. So you should decide if you want to go now. If you don’t then you have to come up with some pompous sounding reason why you can’t.”</p>\n<p>Arthur scoffs. “The reasons that I cannot attend every invitation, Merlin, are not pompous. I am a very busy man with a kingdom to run.”</p>\n<p>They both ignore him and go back to their reading, Merlin scanning the pages quickly and tucking papers to the back of the pile for perusal later. </p>\n<p>“This is one that will need your attention,” Merlin says with a frown as he eyes scan the in his hands paper back and forth quickly. “It seems as if Lord Ulcan is up to his old tricks again.”</p>\n<p>He hands the paper to Gwen to reads over the message carefully. Glancing over her shoulder Arthur manages to get a gist of the message and growls. </p>\n<p>“That man is a miser!” he calls into the ether. Naturally no one responds. Arthur shakes his head. “Just send Leon. Let him deal with the idiot.”</p>\n<p>“What should I do?” Gwen asks, looking at Merlin. </p>\n<p>“Well you are the queen,” Merlin explains. “You can do as you wish but if Arthur were here he would likely send Leon.”</p>\n<p>Arthur blinks in shock but recovers quickly. “So you’re not as much of an idiot as you pretend to be Merlin!”</p>\n<p>“Leon?” Gwen asks. </p>\n<p>“Leon’s father and Lord Ulcan served together for some time. Leon spent some years at his keep. If anyone is to be able to get him to see reason it would be Leon. Plus Arthur can’t stand the man. Calls him a miser.”</p>\n<p>Gwen nods. “Then I will do that then. Should I send a servant with a message or…”</p>\n<p>“No need for that,” Merlin responds breezily leaving the organised papers in two piles in front of Gwen. “I need to pop down to the training grounds anyway to check over Elyan’s shoulder. I can pass on your message.”</p>\n<p>“Thank you Merlin. Really I don’t know what we would do without you.”</p>\n<p>“I’m sure you would survive,” he says pressing a farewell kiss into the top of her head. “Gaius will be up later today to check on our patient. Did you want me to send anyone up to keep you company?”</p>\n<p>“No,” Gwen sighs looking down at the papers before her. “No I had better get myself ready and read this.”</p>\n<p>It takes a moment for Arthur to realise that Merlin is leaving. Arthur looks from Gwen back to the retreating form of Merlin and back again. As much as he loves his wife he thinks he might just go crazy if he were shut up in his room for another day. </p>\n<p>“Sorry my love,” he calls over to Gwen who has her head bent over her papers oblivious. “I’ll be back later!” </p>\n<p>Arthur manages to squeeze out of the door after Merlin before it falls close with a definitive thud. </p>\n<p>As soon as the door has closed behind them some of the bravado that Merlin had put up for Gwen’s sake diminishes and he sags briefly back against the closed chamber door. </p>\n<p>“I knew you were worried about me really,” Arthur says smugly though it dissolves quickly when Merlin sighs and pinches the bridge of his nose. Out of the bright sunlight royal chambers his servant looks paler than Arthur’s lifeless body back in the room. The bags under his eyes tell of a night spent not sleeping. And a night most likely spent pouring over books in Gaius’ chambers looking for a cure for their King. </p>\n<p>“Gaius will find a cure,” Arthur says in reassurance. “He always does. And I will be back annoying you soon enough. In the meantime don’t you have chores to do?”</p>\n<p>With a deep sigh Merlin opens his eyes and pushes purposefully away from the door and down the long corridor away from the royal chambers. With little else to occupy his day Arthur takes one look back at the closed door and follows. </p>\n<p>-</p>\n<p>The sound of metal on metal is reverberating from the armoury as Merlin and Arthur approach. Merlin pushes open the door without ceremony and the two young boys inside pause in fright. </p>\n<p>“Thomas. Grethin,” Merlin greets them kindly. They relax as soon as the recognise Merlin and lower the practice swords they had been swinging to their sides. “What are you two playing at?”</p>\n<p>“Not playing,” Thomas says with a sniff. “Practicing.”</p>\n<p>“For what?” Merlin asks. “Is there a high call for a swordsman in the stables?”</p>\n<p>Thomas colours and dips his head to hide his blush. </p>\n<p>“You don’t got to be high born to be a knight no more,” Grethin says sullenly. “I could do it if I wanted to.”</p>\n<p>“He’s got a point Merlin,” Arthur says just to be contrary and folds his arms against his chest. </p>\n<p>Merlin chuckles as he inspects Arthur’s collection of weaponry. “Perhaps not. But you do need a sense of duty. Tell me Grethin; where does your duty call for you to be this morning?”</p>\n<p>The boy hangs his head and mumbles something that Arthur doesn’t quite catch. </p>\n<p>“I thought as much,” Merlin says shrewdly. “So you had better get back to the bakery before your father has to serve the entire citadel on his own.”</p>\n<p> Grethin throws an angry look at Merlin and all but throws the practice sword at Thomas before he storms out. Thomas catches it cleanly with his spare hand and Arthur raises an impressed eyebrow. </p>\n<p>“Nice catch,” Arthur and Merlin say at the same time. Thomas grins shyly at the praise and quickly places the swords back where he found them. </p>\n<p>“Shirking their duty is something I expect from Grethin, but you Thomas? I know for a fact that Master Lewin needs your hand in the stables this morning.”</p>\n<p>Thomas shrugs but toes at the ground in guilt. “I don’t want to be a stable boy.”</p>\n<p>“Even a knight of Camelot will often have to do things that they may not look forward to or enjoy,“ Merlin says patiently. “Watch as an example…”</p>\n<p>Right on cue Leon wanders into the armoury. </p>\n<p>Thomas literally jumps where he stands coming to a stand tall and to attention. “Morning Sir Leon,” he calls politely.</p>\n<p>Leon gifts him a warm smile. “Ah morning Thomas. Merlin.”</p>\n<p>“Morning Leon,” Merlin greets with a smile. </p>\n<p>“Are you coming to watch training?”</p>\n<p>“I came to see you,” Merlin says as Leon passes. “The queen wanted me to ask you if you would consider making a trip to speak to Lord Ulcan.”</p>\n<p>It is only because Arthur knows Leon so well that he notices the grimace in his knight’s face and battens down a snigger. </p>\n<p>“Is he being… difficult again?” Leon asks. </p>\n<p>“He is forcing passing tradesman to pay a levy to cross the bridge even though Camelot already pay him for the allowance. Arthur and the council have spoken to him on multiple occasion’s but-“</p>\n<p>“You think I will have better luck with him as my father served under him.” </p>\n<p>Arthur smiles proudly at his first knight knowing that the man has already decided to go.</p>\n<p>“Thank you Leon,” he murmurs, knowing his knight’s dislike of the old Lord. Merlin seems to catch the agreement too as his shoulders sag on his exhale. </p>\n<p>“Thank you Leon,” he echoes. </p>\n<p>Leon opens his mouth to say more but his eyes catch on young Thomas still lingering in the corner. Merlin notices the knight’s reticence too and he claps a friendly hand to Leon’s arm. </p>\n<p>“Come, I will walk with you to the training ground.”</p>\n<p>Merlin steers Leon from the armoury with a pointed stare back at the young boy who quickly scrambles out the other door, back to the stables Arthur assumes. </p>\n<p>Arthur turns his head up to the sun, now shining down warmly onto the grounds surrounding the castle. He lets the memory of its warmth seep into him alongside the companionship of his two oldest friends. </p>\n<p>As his people bustle around him, busy with their days already, Arthur feels a sudden sense of peace with his invisibility for a moment. It has been a long time since he could walk anonymously among his people and simply be. </p>\n<p>“How is the King?” Leon’s voice pulls Arthur from his musing. </p>\n<p>“Same as yesterday. In perfect health but we just can’t wake him.”</p>\n<p>Leon takes that information for a moment before clapping Merlin on the shoulder. “Gaius will find a cure. He always does.”</p>\n<p>Merlin offers Leon a tight smile as they emerge onto the training ground. Arthur takes a moment to look around and watch his knights training and laughing without the knowledge that he is watching. It pleases him that most of the knights don’t seem like they are acting any differently than if Arthur were there in their midst. But when they notice Leon marching to the field they straighten to attention. </p>\n<p>Leon waits for a moment until he is sure he has every man’s attention before he shouts to the crowd. “King Arthur is still resting.” Arthur tries not to be put out by the chorus of whoops that follow that statement, led by Sir Gwaine of course. Leon quells the noise with a look. “This does not mean a morning off duty,” he informs the knights sternly. “We will train hard and show our King just why he picked us to protect Camelot.” </p>\n<p>That is met with a uniform shout of agreement from the knights who all draw off to their various disciplines to begin training. The last to peel off are his closest knights who all share a murmured word of instruction with Leon. </p>\n<p>“Elyan,” Merlin calls as the man starts to make his way over to the archery practice station. The knight looks over his shoulder and literally slumps when Merlin beckons him forward with a crooked finger and raised eyebrow. </p>\n<p>“You know I need to look at that shoulder.”</p>\n<p>“It’s fine Merlin. I promise,” Elyan says, flexing the unbandaged shoulder in evidence. </p>\n<p>“Who is the trained physician here, me or you?”</p>\n<p>At another raised eyebrow, scarily close to the one Gaius had tormented a young Arthur with, Elyan relents, coming to sit on the bench as Merlin gestures. With sure hands Merlin prods at the shoulder joint and carefully manipulates the arm back and forth within the joint, all with a frown of concentration on his face. </p>\n<p>“You almost look like you know what you are doing there Merlin,” Arthur teases from the side lines. </p>\n<p>“So what’s the verdict?” Elyan asks when Merlin lets go of his arm. “Will I live?”</p>\n<p>Merlin gives the Knight an unimpressed look. “Take it easy,” he instructs. “And I mean easy. Nothing heavy. But it will be best if you keep it mobile. You come see Gaius the moment anything feels wrong.”</p>\n<p>“Yes Sire,” Elyan says in jest, throwing in a mock bow as he leaves making Arthur laugh. Merlin simply rolls his eyes but smiles all the same. He stands from the bench and looks over the training ground for a moment, in much the same way Arthur had done just a moment ago. No one pays the servant of the King much mind as they continue their morning training. </p>\n<p>After a few moments Merlin’s eyes catch on something in the far corner of the training field. Following his eyesight Arthur looks over too and see’s the towering presence of one of his newest knights; Sir Kay. </p>\n<p>The tall man is whooping in delight and hefting one of the large wooden training staffs over his head in celebration. Down at his feet is Sir Percival struggling to his feet. Sir Kay doesn’t even seem to notice. Merlin’s eyes narrow. </p>\n<p>“You’ve noticed him too?” Arthur murmurs coming to stand shoulder to shoulder with Merlin as they watch the new knight parade. “I have my doubts about him but he comes from a prominent household and his brother was one of my best knights. I am sure with time and training he will be a fine knight.”</p>\n<p>Arthur and Merlin watch side by side as Percival finally manages to get to his feet and Sir Kay begins a dramatic re-enactment of how Percival fell to the ground. </p>\n<p>“So you’ve seen our new prat in training?” Gwaine’s voice materialises on Merlin’s other side. Merlin spares him a sideways glance, keeping his assessing gaze on Sir Kay. </p>\n<p>“He seems… boisterous.”</p>\n<p>Gwaine snorts. “He swans around like he’s the Gods gift to the knighthood.” </p>\n<p>“He comes from a high family,” Merlin says with a shrug. “And Arthur was close with his brother Rhegard. The least he can do is give him a trial.”</p>\n<p>Leon looks over at them then, eyes on Gwaine, and makes a series of complicated and frustrated hand gestures. Gwaine signs dramatically. </p>\n<p>“I had better get over there before Leon has a fit.”</p>\n<p>“I’d better get to work myself.”</p>\n<p>“Are you not watching us train?”</p>\n<p>Merlin harrumphs in laughter even as he walks away, back to the castle. “Not all of us get a day off just because Arthur is lazing in bed!”</p>\n<p>-</p>\n<p>Arthur had almost scoffed at that comment but as it nears the midday meal Arthur is worn out just from following Merlin around. </p>\n<p>They drop clothes off at the laundry, go to the market, the blacksmith, the cobblers, visit three of Gaius’s patients, drop in at the royal kennels (where Merlin panders over the young pups, feeds them cubes of bread and Arthur shouts at Merlin that he is ruining Arthur’s prize hunting hounds), check on the horses and manage to catch the end of the Knight’s training where Merlin checks on Elyan’s shoulder again. Eventually Merlin makes his way up the steep staircase to Gaius’ chambers, Arthur trudging along a few steps behind. </p>\n<p>Gaius is sat at his table eating a bowl of soup and reading from a large tome. He looks up as Merlin enters and offers the boy a small smile. </p>\n<p>“You look tired,” Gaius says in greeting. </p>\n<p>“Busy morning,” Merlin sighs, sinking onto the bench across from Gaius. “Anything?”</p>\n<p>“Not yet. I fear a trip to the library may be needed.”</p>\n<p>Merlin groans but nods. “I’ll go later today. Gwen needs lunch and then she has council. I can go after.”</p>\n<p>For a moment Gaius just watches Merlin whilst Merlin stares at something in the distance. His eyes flicker back and forth and Arthur can see he is thinking about something furiously. </p>\n<p>“Careful Merlin. You’ll strain something with all that thinking,” Arthur teases. </p>\n<p>Merlin takes a deep breath and shakes his head. “I should have been there.”</p>\n<p>Arthur rolls his eyes. “And done what exactly?” he says in exasperation. </p>\n<p>“You cannot blame yourself for this,” Gaius says calmly. “You cannot keep an eye on Arthur every moment of the day.”</p>\n<p>“But if I hadn’t been distracted I would have at least seen what happened instead of having to rely on sketchy reports from Knights who have no idea what they were witnessing. So we have to trawl through every book in Camelot looking for any reference to crystals or sleeping and just hope that we figure it out!”</p>\n<p>By the end of the tirade Merlin is standing and pacing back and forth. </p>\n<p>“You always do this,” Arthur growls in annoyance. “This isn’t your job. You clean my chambers and sort my clothes. Leave healing me to the court physician and leave protecting me to the knights!”</p>\n<p>“Distracted by sleeping?” Gaius asked archly. “Even you need to sleep Merlin. You will run yourself into the ground the rate you have been going since the Royal Wedding.” </p>\n<p>“I think you might be exaggerating a bit there Gaius,” Arthur buts in. Because yes, while Merlin has been very busy so is everyone else. And, yes OK that morning that Arthur had just witnessed was quite packed but it was just one morning. </p>\n<p>Merlin doesn’t respond and doesn’t retake his seat. If Arthur had been corporeal he would have grabbed the man’s arm and yanked him into sitting. Gaius seems to know well enough not to push as he goes back to his lunch. </p>\n<p>“I’ve got to go,” Merlin suddenly announces to the room, already turning toward the door. </p>\n<p>Both Arthur and Gaius start, the latter staring back and forth between a retreating Merlin and his untouched food. “You haven’t even eaten Merlin!”</p>\n<p>“Gwen will be waiting. I’ll see you later. Let me know if you find anything!”</p>\n<p>Before Gaius can respond Merlin whips from the room and Arthur has to break into a jog to catch up with him before the door closes. </p>\n<p>-</p>\n<p>Merlin spills through the door to Arthur’s chambers at a rush with a carefully balanced plate of food in one hand. </p>\n<p>“Sorry, sorry,” he mumbles hurrying forward to where Guinevere is already sat at the table. “Got stuck with Gaius for a bit.”</p>\n<p>Arthur see’s Guinevere’s face light up and she looks at Merlin hopefully. “Has he made progress?”</p>\n<p>“Not yet,” Merlin says with a shake of his head as he places the meal before the Queen. “But he still has some things to look into so don’t worry about that.”</p>\n<p>Gwen sighs and slumps in her chair. “I just feel so useless. I wish there were something I could do.”</p>\n<p>“There are many things you can do for him. One of those is making sure his kingdom doesn’t fall into disrepair while he takes his nap. So eat your meal then you can let your maid get you ready for council.”</p>\n<p>“You’ll come with me?” Gwen asks, looking up at the servant with wide eyes. </p>\n<p>Merlin smiles down on Guinevere, his eyes kind and warm. “Of course.”</p>\n<p>Arthur watches as Guinevere daintily eats her meal with one eye on Merlin who has retreated to Arthur’s desk. The curtains around Arthur’s bed have been drawn, likely to shield his sleeping body from any surprise guests. </p>\n<p>Merlin busies himself reading and organising papers on Arthur’s desk. Arthur doesn’t really pay him much mind, leaving Merlin in charge of organising his papers was a task Arthur gave up quite willingly and unconsciously. But a servant who can read is an oddity, Arthur feels no compunction against taking advantage of the one decent skill Merlin possesses. </p>\n<p>Merlin has collected a pile of papers together, most likely the records required for the council session, but on his way back to the table he stumbles and trips on something, probably his own feet, sending the papers scattering to the floor. He curses lightly and sets about picking up his own mess, all the while Arthur watches Guinevere eyeing him shrewdly. </p>\n<p>After a while Guinevere takes a long and forced sigh, pushing back from the dining table. </p>\n<p>“I really can’t eat another bite,” she says with a large huff. Arthur narrows his eyes at his wife. </p>\n<p>“Come on Gwen,” Merlin chides as he comes over to inspect her plate, juggling scrolls and papers in his arms. “You’ve hardly touched it. I can’t take it back to Cook like this.”</p>\n<p>“You have some,” Guinevere responds quickly, pushing her plate over to Merlin. “Please. You haven’t eaten yet today have you.”</p>\n<p>“No. he hasn’t,” Arthur says in realisation. To be honest he had been a little bit preoccupied with his whole ‘out of body situation’ to notice his servant’s eating habits. </p>\n<p>Merlin huffs affronted and gives Gwen a soft glare. “I’ve been rather busy.”</p>\n<p>“Please?” Gwen says, undeterred. “Arthur would kill me if he woke up from his nap and I have let his servant fall into a state of disrepair.”</p>\n<p>Merlin smiles warmly at her even while he rolls his eyes. He snatches up a sausage and bites it in half. “There. Happy?” </p>\n<p>But Guinevere isn’t. Arthur watches on in amusement as the Queen wheedles and cajoles Merlin into eating bits of her food between his chores. By the time Merlin is finished the plate is almost empty and Guinevere looks far too pleased with herself. </p>\n<p>-</p>\n<p>The council session goes as well as can be expected. Arthur is pleased to note that Guinevere is a lot more prepared than the Lord’s had expected and fends off their enquiries about Arthur’s wellbeing admirably. </p>\n<p>As they come to the closing of the meeting the Queen asks if any Lords have anything further they wish to discuss. This is simply a formality as the Lords will have submitted a proposal to the King and Queen before the council session for discussion. So it is highly understandable that Guinevere blinks in shock when Lord Bodin rises from the table. </p>\n<p>Arthur, who has become accustomed to the Lord’s surprises, gives into the concurrent urge he has around the man to roll his eyes. </p>\n<p>“I apologise for ambushing you with this in front of the council your majesty but I did try to speak with you earlier today.”</p>\n<p>“Blame it on Merlin. Blame it on Merlin,” Arthur hisses into his wife’s ear. But his wife, sweet as she is, simply straightens in her chair and offers the Lord a tight smile. </p>\n<p>“Well we are speaking now Lord Bodin,” Guinevere says with a smile. “What do you have to bring before the council?”</p>\n<p>Lord Bodin straightens his shoulders and turns to address the table. “The scourge of sorcery has attacked the kingdom again. This time at its very heart by attacking the King on his patrol. We have become too weak in dealing with these… creatures. It is time for our methods to be as harsh as theirs.”</p>\n<p>The table is silent for a moment as each Lord looks to another for guidance on how to respond. Even Arthur is momentarily flummoxed. Yes sorcery is illegal but they already execute magic users. What more did the man want? </p>\n<p>“We already execute all magic users,” Gaius speaks from his place at the table. “What else are you suggesting Lord Bodin?”</p>\n<p>“A curfew,” the man says with a decisive nod. “And mandatory checks of all castle chambers. Cease taking in refugees from the outer regions.”</p>\n<p>Guinevere frowns and leans forward in her chair. “And where are our people supposed to go if the crown will not offer them shelter?”</p>\n<p>“It isn’t out of heartlessness that I suggest these measures my lady. But these are towns blighted by Morgana. You cannot know if any are spies for her turned against us by the lure of power and magic!”</p>\n<p>“Bullshit,” Arthur mutters and smirks when he hears Merlin scoff quietly under his breath. </p>\n<p>“I appreciate your… passion Lord Bodin,” Guinevere says delicately. “I agree with your request for a curfew. An attempt was made on the life of the king. We should be vigilant. And we will post extra guards in the castle at night. I would like to take some time to consider your other proposals.”</p>\n<p>Lord Bodin looks disappointed but it only graces his face for a moment before it is replaced with a bland smile as he nods to the Queen. “Of course my lady.”</p>\n<p>“Sir Leon,” Gwen calls. Leon stands from his seat at the table. “Please organise for extra guards to be stationed in the castle at night. And Lord Geoffrey, please send the message to the people about the curfew. It will be in place from this evening.”</p>\n<p>The old man nods and Arthur looks around the table, pleased that his Lords seem to be ready to take his Queen’s orders. Perhaps after the tumultuous few years Camelot has endured they may finally <br>start to see a time of peace. </p>\n<p>Merlin gives a slight cough and Guinevere glances at him quickly before addressing the table. “If that is all?” There is a murmuring of agreement and nodding. “Very well, council dismissed.”</p>\n<p>Merlin sweeps Guinevere out of the council chambers so quickly that Arthur has to fight through the throng of dissipating Lords to catch up with them. As soon as the Queen’s bedchamber door shuts behind the trio Guinevere sags in relief. </p>\n<p>Merlin grins at her manically. “You did so well!”</p>\n<p>“Really?” Guinevere asks, relieved. “I was so nervous. I felt like I was shaking like a leaf.”</p>\n<p>“Well you didn’t show it. Arthur will be proud.”</p>\n<p>“Here, here Merlin,” Arthur agrees, giving his wife a smile. “You did wonderfully.”</p>\n<p>Gwen smiles, pleased at the praise, and retreats behind her screen to change out of her formal attire. By the time she emerges Merlin has done a decent job of tidying her own chambers and is stoking the fire. Guinevere takes a seat by the fire, a relieved sigh escaping her mouth as she sinks into the plush cushions. </p>\n<p>“Right,” Merlin mutters, pushing himself up onto his feet. “I will leave you to your afternoon. One of the maids will bring you dinner if that’s alright.”</p>\n<p>“Stay,” Guinevere murmurs, reaching out to grab Merlin’s wrist as he passes. “We could read and talk. I feel like we haven’t spent any time together since I became Queen.”</p>\n<p>Merlin smiles down at the Queen kindly. “I wish I could Gwen but I promised Gaius I would go to the library.”</p>\n<p>“I’ll go with you. I could watch you research like I used to. You always looked so cute concentrating.”</p>\n<p>“I’m not cute,” Merlin says with mock outrage. “And you are the queen now. You can’t just follow me around the castle because you’re bored.”</p>\n<p>Merlin extracts himself from Guinevere’s grasp and stokes the fire one last time before retreating. </p>\n<p>“When Arthur is well again I expect a picnic in the woods,” Guinevere calls after the servant. “I haven’t seen nearly enough of you since the wedding. No matter who I am married to you are still my closest friend.”</p>\n<p>Merlin smiles over his shoulder at the Queen. “And you are mine. No matter what idiot you married.”</p>\n<p>Guinevere snorts in laughter at the twinkle in Merlin’s eye and throws a small cushion in his direction. Merlin squawks dramatically as he dodges the projectile and Guinevere laughs. </p>\n<p>Arthur can do nothing but stand back and smile. </p>\n<p>-</p>\n<p>Merlin spends a few more minutes pottering about the chambers, exchanging a bit of court gossip with the Queen before he ducks out of the room. Arthur follows without really thinking about it. </p>\n<p>But when the sun starts dipping towards the outer wall Arthur wishes that he had stayed in the chambers and watched Gwen knit. </p>\n<p>“Have you found anything yet?” he asks petulantly. Merlin ignores him from his table in the library and scribbles something in his little notebook. Arthur huffs and looks back at the closed library door. In theory he could just walk through it. His hands and arms seem to move through solid objects well enough. Surely he could just walk through the solid surface if he wanted to but… Arthur cringes away from the thought. Even the idea of walking through a solid object makes him feel wary. It is a little too close to spell work for his tastes. </p>\n<p>Though when Merlin sighs and pulls another thick ancient tome over to him Arthur seriously considers it. </p>\n<p>The sound of the library door opening fills Arthur’s heart with hope of escape for a moment before he notices the meandering form of Lord Bodin sauntering over to where Merlin is sat. There is something in the Lord’s face that Arthur doesn’t like, especially when he looks at his servant. Arthur lets the library door swing shut and moves to stand at Merlin’s shoulder. </p>\n<p>As the Lord nears Merlin peers up at him from beneath his lashes but doesn’t speak. Even when the Lord comes to stand beside the book covered table Merlin, in flagrant disregard for all court etiquette, doesn’t stand or even acknowledge the Lord’s presence. </p>\n<p>Bodin’s nostrils flare. </p>\n<p>“Boy,” he barks. “What are you doing here?”</p>\n<p>Merlin looks up at him properly then, and then at the piles of texts littering the table. “Um…. Reading?” </p>\n<p>Under normal circumstances Arthur might have laughed but these aren’t normal circumstances. Arthur glances around but it appears as if the library is as deserted as it has been all afternoon. Arthur is all but useless and Lord Bodin’s face has turned a very interesting shade of red. </p>\n<p>“Don’t goad him Merlin,” Arthur hisses warily, not taking his eyes of the Lord. “Just get up and leave.”</p>\n<p>“Does the King enjoy your insolence boy?” Bodin asks, coming forward to lean imposingly over Merlin. </p>\n<p>With his typical lack in sense of self-preservation Merlin sighs and leans back in his chair. </p>\n<p>“Merlin,” Merlin states. </p>\n<p>Lord Bodin blinks and frowns. “Pardon?”</p>\n<p>“My name,” Merlin explains. “It’s Merlin. So you don’t keep having to call me ‘boy’. Something which I haven’t been in quite some years.”</p>\n<p>Lord Bodin lets out a low exhale, closer to a growl and Arthur automatically goes for the absent sword at his waist and takes a step forward. </p>\n<p>“Careful ‘boy’,” Bodin spits, leaning far into Merlin’s personal space. “You may be in the favour of the King and Queen but that won’t always protect you.”</p>\n<p>“That sounds awfully like you are threating my servant Lord Bodin,” Arthur growls. Merlin it seems shares none of the worry and concern that is clutching at Arthur’s chest. Instead he sends the Lord an amused smile. </p>\n<p>“Is that a threat Lord Bodin?”</p>\n<p>In swift movement Lord Bodin has reached forward and grabbed Merlin roughly by the arm. Arthur’s shout of alarm goes unacknowledged by either party as they stare coldly at each other. </p>\n<p>Lord Bodin’s malicious glare hardens as he spits down at Merlin. “That’s the difference between you lower classes and us. I have no need to threaten. If I want to hurt someone I simply do it.”</p>\n<p>A creak and a grumble sound from the far side of the library. Lord Bodin throws Merlin’s arm away from him harshly, making Merlin’s chair rock in place. In the blink of an eye the vicious Lord is gone and a bland mask is painted on his face. Then Lord Geoffrey comes out from the maze of towering books. </p>\n<p>“Ah Lord Bodin,” the old man greets politely. “Was there something I could help with?”</p>\n<p>“No no,” the Lord mumbles. “I was simply enquiring after the King with young… Merlin.”</p>\n<p>Lord Geoffrey nods. “Gaius informs me the King is quite well, just requires resting. Then he will be back with us all!” And he continues on his way, nose already returning to the book in his hands. </p>\n<p>The appearance of Geoffrey seems to have tempered Bodin’s anger a tad and when he looks back at Merlin the red hot fury in his eyes has gone. </p>\n<p>“Don’t stay here too long ‘Merlin’,” the Lord says coldly. “You wouldn’t want to be caught on the wrong side of the curfew.”</p>\n<p>Merlin offers the Lord a smile. “Thank you for your concern Lord Bodin. But that’s the difference between the upper classes and us… I can look after myself.”</p>\n<p>Arthur sees the muscle in Bodin’s jaw tick as he stares down at Merlin and for a moment Arthur thinks he is going to lean over the table and throttle his servant. But the Lord casts a look over to the maze of books that Geoffrey had just disappeared into and backs away, letting the Library door slam shut on his exit. </p>\n<p>As soon as the danger is passed Arthur sags in relief. And his relief quickly turns to anger. </p>\n<p>“Are you trying to get yourself killed?” he roars at his servant who has gone back to reading as if nothing has happened. “Honestly Merlin, there is cheeky and then there is downright suicidal. I’d better get back into my body soon or that man is going to have your head on a platter.”</p>\n<p>Merlin pays him no attention and flicks to a new page of his book. Arthur sags. This feeling of powerlessness and helplessness is not something that he is accustomed too. Now his whole future lays in the hands of his servant and he is helpless to do anything but watch. “Please Merlin,” he whispers. “Just get me back in my body.”</p>\n<p>Eventually the sun dips too low in the sky for Merlin to see what he is reading and the man huffs and slams the old book closed. Arthur watches with sinking disappointment as Merlin cradles his head in his hands at the table. </p>\n<p>“You didn’t find anything did you?” he asks his servant. But he already knows the answer. </p>\n<p>-</p>\n<p>Gaius is lent over Arthur’s body on his bed when he and Merlin return that evening. Guinevere is standing nervously close by and Merlin makes an immediate beeline for the Queen, resting a reassuring hand on her shoulder. </p>\n<p>After lots of prodding and manipulation of Arthur’s limbs Gaius steps back. </p>\n<p>“Anything?” Guinevere asks hopefully. </p>\n<p>“No My Lady,” Gaius says. “But we have not yet finished researching the manner of the Kings sleep. As soon as we know what has caused this I am confident that he will return to full health. For the moment he merely seems to be sleeping comfortably.”</p>\n<p>“I’ll be fine Guinevere,” Arthur whispers. He goes to put a hand on her shoulder on the other side of Merlin but it falls through her body. With a sigh Arthur continues. “Gaius will find something. Or maybe Merlin. You should have seen the number of books he trawled through in the library today. Something will come up soon.”</p>\n<p>“In fact,” Gaius was continuing, “I have a number of references that I need to look through tonight. I wondered if you would let Merlin have leave to assist me?”</p>\n<p>“Of course,” Guinevere says quickly. “I can get someone else to serve me dinner. Merlin should be where he can be most useful.”</p>\n<p>“Would you like me to send someone to keep you company?” Merlin asks, gazing at Guinevere’s worried face. </p>\n<p>“No I think I would like to be alone for a while.”</p>\n<p>Arthur’s heart aches with the need to comfort her. She looks so tired and worried and she shouldn’t. Arthur had promised to care for her and look after her and he has left her on her own to deal with it all. With a shared look Merlin and Gaius retreat from the room quietly. Arthur watches them leave but cannot seem to make himself leave his wife’s side. </p>\n<p>-</p>\n<p>When Merlin turns up later that night Guinevere has settled into a chair beside Arthur’s bed with a small book in hand, Arthur hovering nearby. </p>\n<p>Merlin just offers Guinevere a small smile and sets about quietly tidying the room. A peace settles into the bedchamber filled with the quiet scuffles of Merlin and the whispering rustle of paper as Guinevere turns a page. </p>\n<p>It is broken after a few minutes by a knock at the door. Guinevere and Arthur look up but Merlin just sends the Queen a smile and rushes to open it. </p>\n<p>“Who is it?” Guinevere asks cautiously. </p>\n<p>“This, is Sir Gwaine,” Merlin says with a flourish and opens the door wide enough to show Gwaine stood in the threshold. “I don’t know if you have met but he is one of Camelot’s fiercest knights.”</p>\n<p>“The most handsome too,” Gwaine says as he steps through the open door, sending a wink in the Queen’s direction. </p>\n<p>“There’s still debate about that,” Merlin says as he closes the door in Gwaine’s wake. </p>\n<p>Gwaine huffs and turns to Merlin with a frown. “Who else is even in contention?”</p>\n<p>“Well the Queen’s brother is nothing to sneer at. And there is Sir Humphries of course.”</p>\n<p>“Sir Humphries is balding and red faced!” Gwaine says, clearly affronted. </p>\n<p>Arthur just watches the back and forth between his servant and knight with an amused smile for a moment. You can always count on Merlin and Gwaine to provide you with the evening’s entertainment. </p>\n<p>“Alright, alright you two,” Guinevere chuckles after a while. The two of them stop their banter and look at their Queen. “Gwaine what do you need?”</p>\n<p>Merlin steps forward with a smile. “Sir Gwaine has gallantly volunteered to sit with our King for the evening so that you can get some sleep in an actual bed.”</p>\n<p>“Oh no,” Gwen says, shaking her head. “I couldn’t.”</p>\n<p>Merlin sighs and comes forward to clasp a warm hand to the Queen’s shoulder. “Gwen. It wasn’t a suggestion. You spent all last night in that chair. Go to your chambers and sleep properly. Whilst Arthur is napping you carry Camelot. You can’t do that on tired slumping shoulders.”</p>\n<p>Merlin and Guinevere just look at each other for a moment and Arthur can see the silent messages flowing between them in a way only possible with the oldest of friends. Whatever silent debate they are having Merlin obviously wins as Guinevere sighs and drops her shoulders, betraying her tiredness. </p>\n<p>“Ok. Ok I will retire to my chambers. Thank you Gwaine,” she says kindly. </p>\n<p>“Not at all My Queen,” Gwaine says with a smile. “Make sure you get some rest.”</p>\n<p>Merlin offers his hand to Guinevere who levers herself up and leans into his body as he escorts her across the room to her adjoining door. She looks back at Arthur’s body for a moment and Merlin gives her a little squeeze. “Go on Gwen,” he murmurs. “Go get some sleep.”</p>\n<p>She sighs and turns back towards her rooms. “I will. But you do too Merlin,” she says sternly, eyeing Merlin’s face. </p>\n<p>Arthur looks properly at his servant, copying his wife’s concerned stare. Guinevere has always coddled Merlin but even Arthur can see the man looks tired. </p>\n<p>Merlin sends Guinevere a bland smile, even as he ushers her closer to the door. </p>\n<p>“Of course. Goodnight Gwen.”</p>\n<p>Guinevere gives Arthur’s body one last look before she turns away into her own rooms. </p>\n<p>“Goodnight Guinevere,” Arthur calls out as the door to her chambers closes. </p>\n<p>“Are you actually going to go get some sleep?” Gwaine asks from behind. When Arthur turns he sees that the man has already taken up the Queen’s vacated seat and propped his booted feet up on the edge of Arthur’s royal bed. </p>\n<p>Merlin snorts. “What do you think? And get your feet off the bed. I’m the one that has to clean that you know.”</p>\n<p>Gwaine rolls his eyes but obliges, albeit reluctantly. In the background the tower bells tolls once. </p>\n<p>“That’s your cue to get back to your chambers,” Gwaine says. Merlin glances between the window and the mess of papers around the chamber and the untended fire in the grate. </p>\n<p>“Leave it,” Gwaine instructs. “I can tend my own fire. If the guards catch you out after curfew Arthur isn’t around to get you out of trouble.”</p>\n<p>Merlin sends him a grateful smile, already hurrying to the door. </p>\n<p>The hallways of the castle are dark now, but Merlin seems to traverse them with familiarity. Not often one to sneak around his castle at night it takes a moment for Arthur to realise that they are not heading towards Gaius’ chambers. Instead Merlin glances over his shoulder before pushing open the door of the Library. </p>\n<p>“What are you doing?” Arthur hisses as his servant moves deeper into the towers of books. “If the guards catch you in here past curfew you’ll be thrown in the cells!”</p>\n<p>Merlin moves silently through the racks layering a tower of books in his arms as he goes. He eventually settles down on the floor below the window, where the moonlight casts a blue light over the floor and opens the first book. </p>\n<p>Arthur loses track of how long they spend in the library, but he is sure that it is deep into the night by the time Merlin finally rises from the floor. He doesn’t make a sound but Arthur can see from the unhappy line of his shoulders that he has again found nothing of use. </p>\n<p>They only encounter three sets of guards on their journey back to Gaius’ chambers which Merlin dodges so deftly that Arthur is sure this is not the first time he has done this. It feels like the entire castle is asleep aside from Merlin and when they quietly enter Gaius’ chambers the old man is fast asleep on his little cot. </p>\n<p>Merlin takes a moment to clear up some of the debris of the day from Gaius’ table and puts away some vials and bowls before he finally retires himself. </p>\n<p>With a tired sigh Merlin drops his body ungracefully to sitting on the edge of his bed. The poor timber structure gives an ominous creek but holds together. </p>\n<p>As disappointed as Arthur is to still be a ghostly presence in his own castle he cannot deny that Merlin has done everything he can to rectify the situation today. In fact, if pressed, he might even admit that he is slightly proud of his little servant. Juggling chores, researching an ailment of a King, assisting the Queen and playing physician all in one day is no mean feat. </p>\n<p>“Would you go to sleep already Merlin,” Arthur grouses, taking up a perch on the edge of the desk. “You are making me tired just looking at you.” In fact his servant looks positively worn ragged slumped over on the bed with his head resting in his hands. The man has easily been awake for a full day and night and the dark shadows beneath his eyes that Guinevere had been eyeing worriedly hang heavy. </p>\n<p>Seeming to hear Arthur’s rebuke Merlin toes off his boots clumsily and shifts back onto the bed. </p>\n<p>Arthur just watches for a moment as Merlin lays back on the bed, fully clothed, above the covers and with eyes wide open in the candlelight. When a few breaths pass and Merlin seems no closer to moving Arthur huffs. </p>\n<p>“And you wonder why I call you useless Merlin. You can’t possibly go to sleep like that. At least dowse the candle-“</p>\n<p>But Arthur’s rant is cut off in a choke when Merlin’s eyes flare bright gold and the candle goes out instantly, plunging the room into darkness and hefting like a punch to Arthur’s stomach.</p>\n<p>Arthur might have thought that he had been mistaken. It could have simply been a trick of the light. A light breeze could have entered the chambers and blown out the candles. A strange flaring of the moon could have caught Merlin’s eyes, making them appear to glow… </p>\n<p>He may have thought that if not for the very next morning, when Merlin wakes just before the sun and warms his cleaning water with a gesture and a swirl of gold through his eyes. </p>\n<p>Arthur just stares as the water in the bowl goes from stale and cold to scented and steaming in just a few seconds. Merlin – his servant – his magical servant – just disrobes without a care and cleans himself quickly and efficiently in the magically hot water.</p>\n<p>The dispensing of the power - the very illegal magical power – is just so casual that Arthur is under no illusion that Merlin does this every day. It is that thought that unclogs Arthur’s throat. </p>\n<p>“Magic?!” he yells at his unresponsive servant. “Magic Merlin?! What type of complete idiot are you? Do you know what the guards would do to you if they got their hands on you? Do you have any idea what I am going to do the moment I can get my hands on you? Of all the ridiculous, hair brained things you have done over the years Merlin this has absolutely got to be at the top of the list -”</p>\n<p>Arthur’s yells follow Merlin all through the man getting dressed and continue as he descends into the main physician’s chamber. </p>\n<p>Gaius is already awake and dishing some thick creamy substance into two bowls as they enter. </p>\n<p>“- and you!” Arthur cries turning his glare onto the physician. “Did you have any idea about this? Do you know that your ward is practicing magic under the roof of my castle?!”</p>\n<p>Gaius ignores him and pushes a steaming bowl of gruel over the table towards Merlin as he drops onto the bench. </p>\n<p>“You came in late last night,” Gaius says, taking his own seat. “Is the Queen alright?”</p>\n<p>“Gwen’s… as ok as she can be,” Merlin sighs, running a hand through already dishevelled hair. “I left her with instructions to get some sleep.”</p>\n<p>“Instructions I see you did not follow yourself,” Gaius says with a lifted eyebrow. </p>\n<p>Merlin just snorts and shovels another spoonful of breakfast into his mouth. “I’ll sleep when Arthur’s back with us.”</p>\n<p>“Oh yes you will,” Arthur scoffs from where he stands over their breakfast table. “You can sleep all you want back in Ealdor because that is where you are going the minute I wake up. I allow you a lot of liberties Merlin but this…” Arthur sighs and turns away from the table. </p>\n<p>He can’t believe this. Of all of the people he knows. Of all the people he trusts he never thought that it would be Merlin who betrayed him. Who broke his laws and defiled his judgement. Just the thought rips at something deep in his stomach and he finds he has to swallow away a lump in his throat. </p>\n<p>“I’d better get to Gwen,” Merlin says behind him. That draws Arthur back to the moment with a panic. A sorcerer is about to go and serve his wife breakfast and she has no idea. </p>\n<p>“No you don’t!” Arthur cries charging after Merlin and out the door. </p>\n<p>Arthur shouts all the way from the physician chambers to the kitchen to the royal chambers. He tries grabbing Merlin, he tries standing in his way, he tries holding doors closed but every time Merlin just breezes through his body like he doesn’t exist. </p>\n<p>When they enter the Queen’s bedroom Guinevere is already up and dressed standing at her writing desk. She glances up as they enter and sends Merlin a large and kind smile. </p>\n<p>“Merlin, morning.”</p>\n<p>“Morning to you too My Queen,” Merlin says with a mock bow, placing her full plate of food on the table. She responds kindly and lets Merlin pull out her chair for her as she sits down. </p>\n<p>“Don’t fall for it Guinevere!” Arthur shouts, almost tearing his hair out in frustration. “He’s a sorcerer!” </p>\n<p>She ignores him and tucks into her food, chatting amicably with Merlin about the council session from the day before. When it comes to the topic of Lord Bodin Arthur notices the tightening of Merlin’s shoulders. </p>\n<p>“What do you think of Lord Bodin’s proposals?” Gwen asks after a few more mouthfuls of her porridge. </p>\n<p>“Oh I don’t know Gwen,” Merlin mumbles fussing over the fireplace. </p>\n<p>“Please?” Gwen says with wide eyes. “You give Arthur your council. I would be grateful for it too.”</p>\n<p>“He does not give me council,” Arthur says in a rage. “He bumbles out incoherencies and occasionally stumbles across something wise!”</p>\n<p>After a few moments pause Merlin looks up from his crouch by the mantle, fire poker in hand. “Perhaps the curfew is wise at this time. But the barring of refugees…” he sighs and shakes his head, “I don’t think that helps anyone. And I don’t believe that his sole motivation is the protection of the crown.”</p>\n<p>“And yours is sorcerer?” Arthur spits, unable to contain the rage bubbling in his chest. </p>\n<p>How could Merlin sit there, squatting in the filth of the fireplace and offer the Queen of Camelot advice on running the Kingdom? Who did the man think he was? That he could advise the Crown and duck behind their backs and deliberately go against their will and laws. </p>\n<p>How could he do that to Camelot? How could he do that to Guinevere… How could he do that to Arthur? </p>\n<p>Guinevere just nods in agreement with the traitor and mumbles; “Me neither.”</p>\n<p>The room descends into silence. Guinevere back to her breakfast, Merlin back to his cleaning, Arthur back to his raging. Eventually Merlin stands, brushing the fire dust from his breeches and bids Guinevere goodbye with a promise to see her in Arthur’s chambers for lunch. </p>\n<p>There is no way that Arthur is letting this magical servant out of his sight. Swift as his training has taught him to be Arthur slips out of the door and follows his servant into the hall. </p>\n<p>-</p>\n<p>Arthur watches Merlin all morning, giving his servant a level of attention that he has never offered the man before. He watches the man go through his daily routine once more but this time with a heavy knowledge of betrayal stinging the back of his mind. </p>\n<p>And Merlin is good, Arthur will give him that. Not once during the day does Arthur see his façade of bumbling servant slip. He is guilelessly smiling as the Cook berates him for pinching a fresh roll. He is warm and friendly with the castle laundress as he picks up Arthur’s clothing. He laughs and jokes along with the Knights on the training ground. </p>\n<p>But if you look close enough you can see it. Like how the pile of clothes Merlin nearly drops neatly slip back into his grasp. Like how the roll he is eating is re-warmed with a flash of his eyes. Like how Elyan’s shoulder is miraculously looser and less swollen after Merlin lays his hands on it. </p>\n<p>Eventually they make their way up to Arthur’s chambers after the midday meal and Arthur could not help but ask himself ‘why?’. </p>\n<p>Why would Merlin of all people be coerced into the dark evils of magic? Why would his idiot fool of a servant learn magics to simply heat his cleaning water and dowse a candle? And then the darkest of all questions: is Merlin in league with Morgana? Just the mere thought sends a shiver of fear and heartbreak up Arthur’s spine. It is true that the two of them had been close before Morgana turned, arguably closer than a Lady and a servant should be. Is it possible they were working together? That Merlin was taking Camelot down from within?</p>\n<p>Even after the magics Arthur has seen he refuses to believe this. Merlin has been there for every one of Morgana’s torments, has suffered along with Arthur and his people and has been instrumental in regaining Camelot and recapturing the throne. Arthur just cannot believe it… yet he has been fooled before…</p>\n<p>Merlin enters the chambers to find Guinevere and Gaius already there. </p>\n<p>Guinevere turns at the servant’s entrance, her eyes sorrowful and pleading. “Gaius hasn’t found a cure yet,” she says, her voice choking against tears. </p>\n<p>Arthur’s heart breaks at the pain in his wife’s voice and then doubles as watches a traitorous sorcerer wind his arm around the Queen’s shoulders and give it a reassuring squeeze. </p>\n<p>“Don’t give up hope yet Gwen, there is still a fair number of avenues Gaius has yet to try.”</p>\n<p>“Merlin is right My Lady,” Gaius says with an encouraging smile. “In fact, there is one source I would like to show you, for you to approve a try at treatment.”</p>\n<p>“Of course, Gaius, we trust you.”</p>\n<p>“I am afraid the tome is quite large My Lady. Quite unwieldy to carry. I wondered if you could accompany me to my chambers?”</p>\n<p>Guinevere looks down at Arthur’s sleeping body and then at Gaius’ waiting face, indecision clear in her face.</p>\n<p>“I’ll stay with Arthur,” Merlin says comfortingly, giving her shoulders another squeeze. “Make sure he doesn’t go running off into more trouble.”</p>\n<p>With a start Arthur realises exactly what they are doing, and a fissure of fear runs through him.<br>\nArthur rushes to Guinevere’s side, even as Gaius ushers her from the room. “Guinevere,” he pleads quietly, willing with everything that he has that she could just hear him. “Don’t trust them. They are magic users. They are tricking you. Please. Don’t leave my body alone with Merlin. Guinevere!”</p>\n<p>But it is no use. His wife doesn’t blink or react to his pleading and the chamber door shuts definitively behind her and Gaius. Leaving just Arthur, his body, and a known sorcerer alone in his room. </p>\n<p>Merlin makes his way over to Arthur’s sleeping form slowly, peering over his shoulder with every step. He stands for a moment, looking over the lifeless body on the bed, his hands on his hips, assessing. </p>\n<p>“It is always you isn’t it Arthur,” Merlin murmurs after a while. “If it isn’t Questing Beasts it’s dragons or bandits or enchanted bracelets. Are you just trying to make my job difficult?”</p>\n<p>Merlin places one hand gently against Arthur’s forehead and Arthur starts at the sensation that he can actually feel this touch; the only thing he has felt since he woke like this. His eyes widen, and he stumbles forward a few steps to better see his prone body. </p>\n<p>“Merlin, what are you doing?” he asks in wonder but then he looks up and sees Merlin’s eyes wide open and bright with molten gold. </p>\n<p>He gasps and startles backwards without much thought, tripping over Guinevere’s discarded chair and ending up on the floor. </p>\n<p>Arthur jumps back up as quickly as he can, raging forward to where his servant – his once true and faithful servant – is performing magic on his body. The violation sends shivers down his spine. </p>\n<p>“Stop this!” he roars at Merlin. “Stop this now!” </p>\n<p>But Merlin doesn’t hear him. With a dejected sigh Merlin removes his hand from Arthur’s brow and Arthur feels the heat retreat with it. </p>\n<p>“Alright, so that didn’t work,” Merlin mumbles, frowning in thought. “How about…” Merlin leans forward over Arthur’s body, placing both hands on Arthur’s chest. </p>\n<p>Arthur gasps as he feels the heat again, piercing through his ribs and reaching straight for his heart. Merlin’s eyes glow again and this time he whispers a few unintelligible words. Arthur has been attacked by enough sorcerers to understand them as words of the Old Religion. He has to grit his teeth against the renewed pain of betrayal. </p>\n<p>But again, the magic doesn’t seem to have done anything. Arthur still feels as normal as possible and his sleeping body looks just as peaceful as it has done since this sleep began. Merlin sighs in defeat sinking away from Arthur’s body to sit on the edge of the bed. </p>\n<p>“What was that supposed to achieve?” Arthur hisses ominously at his servant. “Is this sleep your doing? Were you looking to finish the job?!”</p>\n<p>But Merlin doesn’t respond. He just looks down at Arthur’s body, something of the heartbreak Arthur is feeling mirrored in his eyes. </p>\n<p>“Ok,” Merlin sighs. “One more try. Do try not to be difficult this time Arthur.”</p>\n<p>The servant stands, rolling his shoulders back and levelling his hands to hover above Arthur’s prone body. Then something builds. Arthur can feel it, like a thunder storm on the brink of breaking. Power courses through the room and when he looks up Merlin’s eyes are golden once more, brighter and more terrifying than ever before. </p>\n<p>The sound that escapes Merlin’s mouth is not much better; deep and growling and chilling. A gust of air appears from nowhere, gushing out into the room fluttering the curtains and bed coverings. Arthur is about to scream and yell but then he stops. He feels something. </p>\n<p>There is a tugging in his chest, right behind his rib cage. As if something is pulling him, drawing him back in. Arthur watches with awe as the eyes beneath his body’s eyelids begin to twitch. </p>\n<p>Merlin sees it too and his face explodes into a triumphant grin. “Yes Arthur,” he calls. “Come on, come back to us.”</p>\n<p>The tugging intensifies, and Arthur finds himself stumbling towards the bed, his gaze flicking back and forth between his awakening body and Merlin’s grimacing face. It is clear that whatever spell Merlin is performing is hard work. Sweat beads on his forehead, trickling down his face which is becoming an ever-deeper shade of red under the strain. </p>\n<p>“It’s working,” Arthur says in wonder, staring up at Merlin in astonishment. “Merlin, it’s working. Come on!” </p>\n<p>The pulling intensifies, reaching to a crescendo. Merlin growls, the tendons in his neck bulging from the strain. The power in the room crackles and builds and then there is an almighty snap. </p>\n<p>Arthur feels himself being thrown backwards with the strength of it and lands hard on the chamber ground. He struggles up, quickly, looking to see if it had worked. But when he sees Merlin leant, heaving in deep breaths over Arthur’s still body he knows it hasn’t. </p>\n<p>“Dammit!” Merlin curses, slapping a hand harshly against the bedpost in anger. Arthur startles at the display but Merlin quickly sags into the very picture of dejection. Running a hand through his sweat slick hair he looks down on Arthur’s body, an air of hopelessness about him that Arthur has never seen. </p>\n<p>“What-” Arthur tries to say but his voice sticks. “Did you just try to heal me?” </p>\n<p>Merlin doesn’t respond but the disappointment in his servant’s face is answer enough. </p>\n<p>“You did,” Arthur says in wonder. “You tried to use your magic to heal me.” </p>\n<p>And again, the question of ‘why?’ flitters to the front of Arthur’s mind. </p>\n<p>Magic is evil. Sorcery is a power that corrupts and twists a person’s soul. So why is Merlin – a proven magic user – trying to heal the King of Camelot? </p>\n<p>Gaius and Gwen return swiftly and after a few pleasantries the pair leave Guinevere to her evening. For once Arthur does not feel compelled to follow Merlin as he exits the chambers. Arthur lets the door shut behind Merlin’s back, his mind a conflicting mess of confusion, pain and betrayal. </p>\n<p>-</p>\n<p>Guinevere only spends a few candle marks in Arthur’s chambers, flicking between reading court documents and glancing at Arthur’s body every few moments. Arthur spends his time pondering his servant. </p>\n<p>The man has magic. He has broken Arthur’s laws and visibly flouts them. Yet… Merlin has always been loyal, almost to a fault; constantly throwing himself into harms way to protect Arthur and his Knights. And he just tried to heal Arthur. And judging by his devastation when he couldn’t, really wanted Arthur to recover. </p>\n<p>This merging of loyal friend with magic isn’t something that Arthur has any experience with. Everything his father had taught him tells him it isn’t possible. And yet… </p>\n<p>Guinevere leaves the chambers later that afternoon and takes a visit to the Castle Steward to discuss the castle supplies. Arthur follows behind dutifully, his mind elsewhere. </p>\n<p>As he thinks about it Merlin having magic does make a lot strange situations make more sense. Bandits that suddenly fall over, branches that conveniently drop onto axe wielding opponents, strange winds and earthquakes that take out Camelot’s enemies. Looking even further back Arthur is sure it must have been Merlin that conjured that wind in Ealdor. Or did he learn magics from his friend when they were both too young and too naïve to understand its evils? </p>\n<p>So caught up in his own thoughts is Arthur that it takes him a few corridors of walking before he realises he has lost Guinevere somewhere in their travels. He assumes she will have moved onto speaking with Geoffrey and Arthur could track her down, but he is overcome with a wave of tiredness. </p>\n<p>He turns, taking the familiar route back up to his own chambers. </p>\n<p>The door is thankfully open when he arrives, and his spirits naturally lift when he sees his Round Table Knights gathered around his dining table. They seem to be talking animatedly and a closer look at the table sees it littered with the guard rotas and patrol schedule. </p>\n<p>“We need to switch the position of these guards,” Leon is saying, pointing at an aerial map of the castle. “Gwaine you will need to take up the command of the night patrol next week to check the new arrangements.”</p>\n<p>“I was on night duty last week,” the Knight complains. “Plus, I played nurse maid to our resting king last night.” He nods his head over to the closed curtains around Arthur’s bed. “I need to sleep sometime.”</p>\n<p>“Well what do you suggest?”</p>\n<p>“You do it. When was the last time you took a night shift?”</p>\n<p>“I have to assist the Queen and organise the Knight’s training whilst Arthur is… unavailable.”</p>\n<p>“Guys, come on.” The voice comes from the corner of the room and Arthur notices Merlin for the first time, sat behind his desk with a quill in hand. “I’m trying to work here.”</p>\n<p>The knights spare him a small glance before they turn back to the table. </p>\n<p>“What about the patrol in the Northern Plains?” Percival asks. “It was due to leave in three days, but Arthur still hasn’t finalised the route he wants.”</p>\n<p>“I think we should take the route through the Darkling Woods, then up to the northern pass,” Elyan says, consulting a map of Camelot. </p>\n<p>“But that completely misses the main trade route between here and Mercia,” Gwaine argues. “We need to ensure its safety for travelling merchants.”</p>\n<p>Elyan huffs in annoyance. “But then the patrol would take over two weeks. We cannot spare that many men for that long.”</p>\n<p>“Then send fewer,” Gwaine says with a sharp tone. </p>\n<p>“That’s too dangerous. If Arthur were here-”</p>\n<p>“Well he’s not so can we just make a decision so I can go get some blasted sleep!”</p>\n<p>“Enough!” Merlin’s voice roars through the room. All the knights, and Arthur, start at the shout and turn to see the servant now stood behind the desk, staring at the crowd of Knights with blazing eyes. “Arthur has barely been gone two days and you are already cracking at the seams. You need to stop bickering and work together!”</p>\n<p>“Leon,” Merlin barks. “Your Queen has already given you a task that needs to be completed. It may not be your preferred duty, but it is important. You will leave to see Lord Ulcan at first light.” Leon opens his mouth as if to protest but before he can Merlin continues. “Elyan’s arm still needs to recover so for the time being he will take over the Knight’s training and act as the Queen’s council on matters of the army. Percival, pick heads or tails.”</p>\n<p>The knight blinks in confusion and shares a look with his fellow knights. “Um... what?” he asks timidly. </p>\n<p>Merlin has moved from behind the desk, holding a coin in hand. “I said pick; heads or tails.”</p>\n<p>“Tails.”</p>\n<p>Merlin flips the coin, expertly flicking it spiralling up onto the air and catching it again in hand. “Heads,” he calls. “So, Percival will take the night shift for this week and Gwaine will cover the day guards. Next week you switch. The new patrol routes can wait until either Elyan recovers, Leon returns or Arthur wakes, whichever comes first. Any questions?”</p>\n<p>Silence is all that responds the servant’s tirade. </p>\n<p>“Excellent,” he says with a sigh. “Now will you all, for the love of the Gods, go away so I can finish this speech?”</p>\n<p>Mumbles of “Yes Merlin” and “Sorry Merlin” echo through the space and with a scraping of papers and chairs the Knights disperse. </p>\n<p>As his Knights all wander off to follow their orders Arthur wants to rage and curse; who does Merlin – a traitor and magic user – think he is to direct Arthur’s knights? But a niggling thought at the back of Arthur’s mind presses forward; he cannot fault the orders. In fact, if he thinks about it, Arthur himself cannot think of a better way to solve their current staff shortages. </p>\n<p>He watches with a frown as Merlin goes back to the desk and sits down with a deep sigh. </p>\n<p>Surely a traitorous magic user would take the opportunity of his master being incapacitated and not being watched to… steal something? Plot something? Plant some magical artefact in the rooms? But no, Merlin simply pulls the scroll he had been working on back to him and picks back up his quill. </p>\n<p>Guinevere returns later in the afternoon and Merlin makes his excuses to leave. Arthur lets him go. He has enough to ponder as it is. </p>\n<p>-</p>\n<p>Deep in the silence of the night there is a creak. To others it may have been nothing and disregarded, but Arthur is a warrior. The sound is unnatural in the bedchamber and the hairs on the back of Arthur’s neck rise. </p>\n<p>On alert Arthur stands, slowly rotating to peer into every darkened corner of his room. His eyes stray back over Guinevere who is still fast asleep in her chair and is oblivious to change in the air. Then the creak sounds again from behind Arthur and he twirls quickly to see a boot and a leg, and then an arm, come through his bedchamber window. </p>\n<p>“Guinevere wake up!” he hisses to his sleeping wife as the full body of a man pulls himself through the window. “Please Guinevere wake up!”</p>\n<p>But he is useless. The man stands and orientates himself in the room for a moment before his face turns towards the bed. In the dark of the night Arthur cannot make out his features but he imagines that his eyes glint with triumph at the sight of a sleeping King and Queen, no guards in sight. </p>\n<p>A long dagger is pulled from the figures hip, glinting dangerously in the moonshine. </p>\n<p>“Stop!” Arthur shouts, standing uselessly between the intruder and his wife. “Guards!” he calls once more but knows in his heart that it is useless. He is going to be stuck here, invisible and impotent as his wife is murdered in her sleep. Where the hell are his guards?</p>\n<p>The figure takes a single step forward and then the door to the bedchamber swings open. Arthur almost sighs with relief until he notices the highly unimposing figure of his servant in the doorway. Merlin and the intruder stop and stare at each other for a fraction of a moment before the intruder rushes forward. </p>\n<p>Arthur watches in horror as Merlin’s eyes swirl a brilliant gold and he throws his hand out before him. The assailant makes a sound, as if he has been hit with an axe, and flies through the air hitting the stone wall with a crunch. The sound finally wakes Guinevere who shrieks and two guards storm into the room, closely followed by Percival. </p>\n<p>Arthur just stands in the centre of the mayhem, looking back and forth from the assassin and his magical traitor of a manservant… who has just saved his life. </p>\n<p>Merlin stands by Arthur’s bed, holding a trembling Guinevere in his arms. “Are you alright?” he asks in a whisper. </p>\n<p>“Yes,” she says nodding into Merlin’s chest. “Yes I am Ok... Arthur!”</p>\n<p>“He’s fine,” Merlin soothes quickly, pulling back so that Gwen can see Arthur’s intact sleeping body. </p>\n<p>“Who was that?”</p>\n<p>Percival is standing over the crumpled body and looks over at the pair. “I don’t know but his crest is the same as the man who attacked Arthur in the forest.”</p>\n<p>There is heavy silence in the room as everyone takes that in. Eventually someone calls for Gaius to check on Arthur’s body, just in case, and the guards carry the dead body of the assailant away. All the while Arthur just stands and stares and watches Merlin. </p>\n<p>“You saved me,” Arthur whispers. “Why…You’re a sorcerer. Sorcerers have the tendency to want me dead. But you just saved my life. Why?”</p>\n<p>Merlin ignores him, instead keeps his wide eyes firmly fixed on the still body on the bed as Gaius checks it over. Eventually the physician gives Arthur a good bill of health, other than the fact that he is still in an unending sleep. Guinevere rushes forward then, clasping Arthur’s hand in hers but Arthur lingers back as Gaius makes his way over to Merlin’s stoic form. </p>\n<p>Arthur does not miss the way that Merlin watches the crowd, waiting for everyone to be out of earshot before he speaks. </p>\n<p>“This is getting out of hand Gaius,” he hisses. </p>\n<p>Gaius sighs and looks back at the body of Arthur. “I agree. What are you planning to do?”</p>\n<p>Merlin sighs a deep and heartfelt breath and looks back at Arthur’s body. “Leave it with me.”</p>\n<p>“This is one of those times when you are going to do something I don’t want to know about,” Gaius says with a shrewd voice, eyeing his ward carefully. </p>\n<p>Merlin sends Gaius a ghost of his normal cheeky smile. “Let’s just play it safe and say yes.”</p>\n<p>“Fine,” Gaius sighs long suffering. “Just be careful”. </p>\n<p>-</p>\n<p>Once Arthur has been announced as unharmed the room is cleared for the Queen to try and get some more rest. The chamber door is left open and Percival instructs three guards to be present in the chamber at all times. </p>\n<p>Merlin, Arthur notices, is hanging at the back of the room, uncharacteristically silent as if he were trying to blend into the background. And sure enough, as soon as Percival heads back to the Keep to rouse a watch party Merlin slips out of the room in the Knight’s shadow. </p>\n<p>No one in the room seems to notice the silent disappearing act his servant is trying to pull but Arthur does. And he’ll be damned if he is going to let this confusing man out of his sight until he has the traitor figured out. </p>\n<p>When they get to the open corridor Percival heaves a breath and then sends Merlin a small smile. “It’s a good job you were there Merlin. I don’t want to think about what would have happened if you hadn’t been checking on the fire at that exact moment.”</p>\n<p>“Yeah,” Merlin chuckles, running a shaking hand through his hair. “Lucky right?”</p>\n<p>Arthur rolls his eyes as the absurdly terrible lie. Percival doesn’t seem to catch it however as he just clasps Merlin on the shoulder and bids him goodnight. </p>\n<p>Merlin watches the knight retreat and as soon as Percival is out of sight he moves. But instead of turning right and up to the staircase that leads to the physician’s chambers Merlin turns left and trots down the stone staircase that leads to the courtyard. </p>\n<p>“What are you doing now you idiot?” Arthur hisses behind him. The curfew is still in place and even though Merlin could give a credible reason for being out of his chambers at this hour he would still face spending the night in a cell for the trouble. </p>\n<p>When Merlin gets to the courtyard he sticks to the shadows, dipping in and out of the alley ways and crevices of the castle until they arrive at the East Gate. </p>\n<p>A pair of guards sit on a couple of crates by the gateway rolling a set of die against the stone floor between them. Arthur rolls his eyes. No wonder assassins are able to penetrate his castle when the guards are too busy gambling to guard the gates. </p>\n<p>Merlin pauses in an alleyway and peers at the guards. Arthur watches intently, interested to see what trick Merlin is planning to pull now. </p>\n<p>Merlin’s eyes dart about until they land on a trio of barrels stood outside one of the street’s stores. With a flash of gold in his eyes the barrels tip and start rolling down the cobbled walkway and Arthur cannot help but snort. Really, all that magical power and this is how Merlin chooses to distract his guards? It will never work. </p>\n<p>The sound draws the guard’s attention away from their game and the pair frown into the darkness. With a shared look they grab their spears and then Arthur looks on in amazement as his guards – the well respected and highly trained guards of Camelot – are outwitted by a pair of rolling barrels. </p>\n<p>Merlin takes his moment swiftly, darting out from his hiding place and out through the unguarded gateway without hesitation. </p>\n<p>“You did that with great confidence Merlin,” Arthur hisses as he follows his servant out into the night. “It is almost as if you have done this before.”</p>\n<p>Merlin looks back over his shoulder at the towering sight of Camelot Castle and turns, striding purposefully through the tall grass towards the forest. </p>\n<p>Then, as soon as they are hidden from sight Merlin breaks into a run. </p>\n<p>His long legs pick easily through the dense forest floor, yet he makes no sound, displaces no branches and passes through the forest like the ghost that Arthur is. Even in his ghostly state Arthur has to push with everything that he has to keep up. But Merlin just keeps going. </p>\n<p>They run directly through the thickness of the trees that surround Camelot, not adhering to any pathway that Arthur is aware of. As the moon is blotted out by the dense tree branches above Arthur loses all sense of direction and where they are. Forcing his burning legs even faster he pushes to keep up with Merlin lest he fall behind and get lost in his own forest. </p>\n<p>When Merlin finally comes to a stop it is at the edge of a huge grassy clearing. Arthur hurtles out of the tree line next to him, his breath coming out of him in sharp pants. </p>\n<p>“I have to admit that was impressive,” Arthur pants, eyeing Merlin’s calm and unruffled demeanour. “I knew you were purposefully noisy on hunts! You-“</p>\n<p>But whatever was on the tip of Arthur’s tongue promptly dissolves at the sight before him. A dragon. An honest to the gods, tall as the trees dragon sits in front of him in the clearing staring down at Merlin with large amber eyes. And Merlin, the idiot, is just staring back. </p>\n<p>Then the beast smiles, exposing a row of shiny white and very pointy teeth. </p>\n<p>Arthur reacts automatically and dives forward, trying to grab a hand around Merlin’s arm and drag him away. But his hand just falls through his servant’s body. </p>\n<p>Terror engulfs him as the snarling beast lowers his head towards Merlin. And then he blinks because the beast isn’t lowering his head to chomp Merlin’s body in half. He is lowering into a bow. </p>\n<p>Merlin returns it with a slight bow of his own and then smiles up at the creature. </p>\n<p>“Thank you for coming,” he says quietly into the night. </p>\n<p>“I will always answer your call Young Warlock. What need do you have of me tonight?”</p>\n<p>Arthur almost stumbles over backwards in shock as the beast speaks. He had always been taught that Dragons were beasts. But this one sitting before him speaking as eloquently as any Lord in Arthur’s council. </p>\n<p>“It’s Arthur,” Merlin says with a sigh. </p>\n<p>The Dragon rolls his eyes. “Isn’t it always?”</p>\n<p>“This time… he’s been enchanted but I don’t know how or by what.” Arthur hears an uncharacteristic thread of panic in Merlin’s voice. “A group of men infiltrated Arthur’s tent on patrol and chanted over him with a crystal. By the time they were fought off Arthur was asleep and nothing has been able to wake him.”</p>\n<p>“I see,” the Dragon murmured. “Have you tried to wake him?”</p>\n<p>“Of course I tried! But it is like there’s something baring me from his life-force. Have you heard of anything like this before?”</p>\n<p>Arthur watches as the Dragon’s face pulls into something frightfully similar to the human expression of contemplation. </p>\n<p>“The Druids often used crystals to promote healing and spiritual growth but these magical practices of men are foreign to me young Warlock. You would do better speaking with the Druids directly.” </p>\n<p>Merlin sags comically at that, letting out a heartfelt groan. “I was afraid you would say that.”</p>\n<p>“You are a strange creature Emrys,” the Dragon chuckles fondly. Arthur frowns at the name. It tickles something of a memory at the back of his mind but he cannot place it. “You have faced down many a deadly magical foe yet worry about facing a group of old men in tattered robes?” </p>\n<p>Merlin shifts and looks up at the dragon. “They look at me funny…”</p>\n<p>At that the Dragon lets out a hearty laugh making Arthur start with fear. The beast just shakes its huge head and looks down at Merlin once more. “They look at you with respect.”</p>\n<p>“No wonder it seems so foreign to me,” Merlin scoffs. The servant sighs and runs a hand through his hair, shoulders sagging as if the weight of the world rested on them. </p>\n<p>“You look tired young warlock,” the Dragon murmurs.</p>\n<p>“Why does everyone keep telling me that?” Merlin huffs with a scowl. </p>\n<p>“Maybe because you do,” Arthur and the Dragon speak at the same time. </p>\n<p>“Well, life was stressful enough trying to keep Arthur alive when he was a Prince,” Merlin says with a huff. “Now he’s King and he has a wife. That’s a whole extra person to worry about. Then Morgana tries to take over the kingdom... again. And now this. Is it any wonder I don’t look well rested?” </p>\n<p>Both Arthur and the Dragon watch Merlin as he paces slightly in the grass. </p>\n<p>Arthur just cannot process what is going on. One moment his servant is a bumbling idiotic fool, but a loyal subject and friend all the same. And within one blink of an eye he is not… or he is but he is more. He is fierce and slightly terrifying and talks to dragons and casts spells and saves Arthur’s life and protects Guinevere and breaks the law and lies and sneaks around and… And Arthur just wants to close his eyes and pretend this isn’t happening. </p>\n<p>“Stay here for the evening,” the Dragon says quietly. </p>\n<p>Merlin stills in his pacing and looks up at the beast. “But Arthur…”</p>\n<p>“Arthur is well protected by his knights and will survive without you for one night.”</p>\n<p>Merlin scoffs. “Yeah that’s the kind of thinking that got us into this mess to begin with.” But the man sighs and runs a hand through his hair, the tiredness in his bones showing for a brief moment. </p>\n<p>“Just until daybreak,” the Dragon says lowering himself down onto the ground. </p>\n<p>With one last look in the direction Arthur assumes Camelot is Merlin steps forward and lowers himself into the crease of the Dragon’s bent legs, just by his head. The Dragon curls himself around, his wing and body rounding in to make a little cocoon around Merlin’s body. The beast’s head rests down on the grass and Merlin reaches out a hand, resting it lightly on the great scaled skull. </p>\n<p>Something in Merlin’s body loosens for the first time in days. Arthur almost wants to laugh that it takes laying in the arms of a terrifying, mythical beast to make Merlin relax. </p>\n<p>Merlin wiggles in place, edging his body into a comfortable position, but he doesn’t close his eyes. Instead he stares straight up at the inkjet sky, twinkling with sporadic stars. </p>\n<p>“I keep thinking,” Merlin says quietly into the night, “that if he had known about my magic he never would have been in danger.”</p>\n<p>Arthur startles for a moment after realising that they are talking about him. He takes a step closer. </p>\n<p>“Perhaps,” the Dragon rumbles. “But there is little point living with ‘what-ifs’. If you wish to tell the young king then do so.”</p>\n<p>“But what if he hates me.”</p>\n<p>“One half cannot truly hate-“</p>\n<p>“-That which makes it whole,” Merlin scoffs with a roll of his eyes as if it is something he has heard time and again before. “I know. But you have obviously never had to deal with Arthur when he is in one of his moods.”</p>\n<p>“You think that he would kill you?”</p>\n<p>Merlin winces at that. Arthur does too. The bluntness of the statement strikes something deep within him that recoils. </p>\n<p>“No maybe not,” Merlin sighs. “But… he’ll be angry. He will be hurt that I have lied to him. When he feels like that he has the tendency to lash out. He may regret it later but…”</p>\n<p>Merlin leaves the sentence hanging there in the air and Arthur feels it settle around them. </p>\n<p>“I wouldn’t,” Arthur says, surprising himself by the vehemence with which he feels it. “I could never kill you Merlin. It would just be… wrong.”</p>\n<p>That sentiment hangs in front of Arthur for a moment, unheard by the Dragon and his servant in front of him. It feels like treason just to think it, but it is true. Merlin has lied to him yes. And that has hurt something within Arthur that he thought was untouchable. But… he cannot think of a single thing that he has seen in the past day that would deserve death. </p>\n<p>“Don’t worry about it tonight Merlin,” the Dragon rumbles deeply. “Sleep. I will wake you before sunrise.”</p>\n<p>It is just before dawn when Merlin startles awake from the crux of a nightmare. It isn’t his first of the night. Arthur has watched all these many hours as his servant tossed and squirmed in the cradle of his dragon, fighting demons and plagues in his sleep that Arthur knew nothing of. </p>\n<p>Each time his struggles became too fierce the dragon would lean in and breath over Merlin, a dusting of gold settling over Merlin’s body before it settled into a peaceful sleep once again… for a little while at least. </p>\n<p>Merlin leans forward, arms braced against his legs as he takes a deep breath to fight off the lingering panic. </p>\n<p>“Is that you awake young warlock?” the dragon grumbles, stretching his legs like a cat. </p>\n<p>“In a manner of speaking,” Merlin says, his voice threaded and weak. </p>\n<p>The dragon’s wings spread as the creature comes to waking too. “How long have you been having night terrors like that?” </p>\n<p>“How long have I lived somewhere that would execute me merely for existing?” </p>\n<p>The bitterness in Merlin’s tone is shocking to Arthur, who has never heard his servant anything other than cheeky and guileless or wise and helpful, but the dragon doesn’t comment. </p>\n<p>The creature and Merlin bid each other farewell and Merlin stands in the clearing, watching the disappearing wing span of the dragon before turning and running back into the woods. </p>\n<p>Arthur huffs, readies himself and tears after his servant into the thickness of trees. </p>\n<p>-</p>\n<p>They make it back into the castle before the sun finishes its ascent over the East wall. Merlin heads straight for Gaius’ chambers. He barrels through the main room, ignoring the physician working at his table and disappears into his own room, only to appear a moment later with a small satchel. </p>\n<p>Arthur feels slightly dizzy but Gaius is obviously used to Merlin’s erratic behaviour and just continues to grind his herbs. </p>\n<p>“Will you be able to make excuses to Gwen for me for the day?” Merlin asks at a rush, already heading towards the door. </p>\n<p>“Of course,” Gaius answers easily. “Where are you going?”</p>\n<p>Merlin takes a deep breath, his face falling in gravity. “The druids.”</p>\n<p>“You sound as if you are heading off to face a hoard,” Gaius says with a chuckle, returning to his pestle. </p>\n<p>Arthur cannot help but share the physician’s amusement. In the last day Arthur has seen Merlin face down an assassin, a Lord out for his head and a dragon. Yet it is the thought of a bunch of forest dwelling pacifists that seems to make Merlin feel some disquiet. </p>\n<p>They do not head straight for the forest as Arthur had expected. Merlin makes a few stops on his way, first to the kitchens with instructions for the Queen’s breakfast, then to the laundress to check on Guinevere’s clothes, to Leon to pass on a missive for Lord Ulcan and then to Elyan’s chambers to pass on a tincture and berate him for practicing with a Mace at yesterday’s training (Arthur doesn’t even try to hold back his laugh at the sullen face of his Knight as Merlin forces his arm back into the sling). </p>\n<p>The sun has fully risen as Merlin quickly trots down a rear servant’s passage towards the lower town. </p>\n<p>“Do you think that the Druids will be able to help?” Arthur cannot help but ask. He knows it is fruitless. He knows that Merlin cannot hear him. He knows that asking magic users for help shouldn’t be something he condones, but there is only so long that Arthur can just stand back and listen. </p>\n<p>Merlin is walking quickly through the narrow and little used walkways, he doesn’t notice a figure walking up behind them. Arthur does though. His many years training for war have his hackles raising at the sound of heavy footsteps behind them. He turns but barely has time to shout out a useless call of warning before the figure is upon Merlin. </p>\n<p>Merlin crashes harshly into the stone wall, dropping his satchel over the cobbled floors. Only the firm grip Lord Bodin has on Merlin’s tunic stops the boy from tumbling to the floor too. </p>\n<p>“You,” Lord Bodin sneers, pushing an arm roughly against Merlin’s throat. “You little worm. You are the reason the Queen rejected my proposal.”</p>\n<p>Merlin is scrabbling against the Lord’s grip, his face going red as Bodin pushes harder into his neck. Arthur shouts and hollers, attempting to grab at the Lord’s shoulders and yank him away but nothing works. </p>\n<p>“No,” Merlin wheezes. “She rejected it because it wasn’t what was best for her people.”</p>\n<p>That doesn’t seem to be what the Lord had wanted to hear and his face twists unpleasantly. “You’ve always been meddling. The King is too lenient with you. Servants like you need a firm hand to keep them in place.”</p>\n<p>Bodin punctuates this with pushing even harder against Merlin’s throat. </p>\n<p>“Do something you idiot!” Arthur shouts as he watches Merlin’s face reach an alarming shade of red but still Merlin doesn’t raise a hand and his eyes stay their normal deep blue. He lets out a pained choke, his hands grappling ineffectively at Bodin’s arm. </p>\n<p>With no warning the Lord lets go abruptly and Merlin collapses into a heap by his feet. </p>\n<p>“Take that as a warning ‘boy’,” the Lord spits, leaning down menacingly over Merlin’s panting form. “Stay out of my business.”</p>\n<p>With a final growl the Lord turns, striding back up the alleyway to the castle. </p>\n<p>Arthur is torn between chasing after the Lord who dare inflict punishment on one of his staff and staying by Merlin’s side. He looks down to see Merlin still sat on the floor, his hand massaging at his throat as he aims a dangerous glare at Bodin’s back. Arthur doesn’t like that look. It is a look that means Merlin is about to something foolish and brave and ridiculous. </p>\n<p>“That almost sounds like a threat Lord Bodin,” Merlin gasps at the Lord’s back just before he is out of earshot and Arthur groans. </p>\n<p>Just as expected Lord Bodin twirls back in anger, his glare once more on the servant he has left crumbled on the stone floor. </p>\n<p>“I see that warning requires a little more force,” the Lord growls, clenching his gloved fists by his side. </p>\n<p>Arthur moves instinctually between the advancing Lord and his servant knowing it will do no good. The Lord advances menacingly and Merlin doesn’t even try to get up off the floor. The Lord’s eyes hold nothing but contempt and Arthur has a moment of pure treasonous thought as he wills Merlin to do something, anything, to stop the Lord in his tracks. </p>\n<p>“What’s going on here?”</p>\n<p>Arthur never thought he would be glad to hear Sir Gwaine’s voice. He sags in relief as the tension in the air is broken and Gwaine marches purposefully down the alleyway. </p>\n<p>His clever eyes quickly take in Merlin on the floor and the Lord’s angry face and they harden. When neither Bodin nor Merlin make any move to talk the knight growls again. </p>\n<p>“I asked what is going on here!”</p>\n<p>“Nothing Sir Knight,” Lord Bodin simpers. “Young Merlin here just fell. I was simply offering him a helping hand.”</p>\n<p>Arthur snorts at the ridiculous lie and it seems that Gwaine doesn’t buy it either as his eyes narrow at the Lord. </p>\n<p>“Merlin?” he asks, his hand straying to his sword helm. </p>\n<p>Merlin looks between the Lord and Gwaine and swallows. “I’m fine Gwaine.” </p>\n<p>Gwaine stares at Merlin hard who looks back and shakes his head minutely. If Arthur were not watching Merlin carefully he never would have noticed it, but Gwaine does. The knight’s face closes off and he turns back to the Lord. </p>\n<p>“You heard the man, he’s fine. Best be getting back to the castle my Lord,” Gwaine says with the falsest possible smile. He has surreptitiously placed himself between Bodin and Merlin and Arthur (even knowing its futility) stands shoulder to shoulder with his Knight.</p>\n<p>Bodin sends one last look over Gwaine’s shoulder before he huffs and turns with a pompous flick of his cloak. </p>\n<p>Gwaine and Arthur stand guard until the Lord has disappeared from sight, when they turn Merlin has pulled himself up to standing and reattached his satchel to his back. </p>\n<p>“Are you truly alright?” Gwaine asks with a worried frown on his face. </p>\n<p>“I’ll live,” Merlin sighs, his hand going to his throat instinctively, adjusting his neckerchief to cover the worse of the red marks. Gwaine sees the marks and almost growls, staring in the direction the Lord vanished. </p>\n<p>“It isn’t worth the trouble it would cause Gwen,” Merlin says, placing a calming hand on Gwaine’s forearm. He stares coldly in the direction that Bodin has disappeared. “Just watch him will you?” he says with a nod. </p>\n<p>“Gladly,” Gwaine growls before taking in Merlin’s bag and direction of travel. “Where are you off?”</p>\n<p>“I… uh, I’ve got something to do… for Gaius,” Merlin stammers and Arthur has to roll his eyes that he ever bought his servant’s ridiculous lies. </p>\n<p>Gwaine looks at Merlin shrewdly and Arthur can see his knight knows there is more to the story, but he doesn’t push. Instead he sheathes his sword and gives the servant a knowing nod. </p>\n<p>“Well you had better hurry then.”</p>\n<p>Merlin has already rushed off, but Arthur is still close enough to Gwaine to hear him whisper to the retreating servant’s back. </p>\n<p>“Good luck Merlin. Bring our King home.” </p>\n<p>-</p>\n<p>Arthur is thankful that they only run a few leagues this time. Even so, when they slow to a walk Arthur is heaving in lungsful of breath whilst Merlin doesn’t seem effected at all. </p>\n<p>“Your stamina is impressive Merlin,” Arthur says between panting breaths. “Really. I should have you run the Knight’s endurance training. That would teach them to complain about my sprint trials.”</p>\n<p>Naturally Merlin ignores him and instead pays careful attention at the woods around them. He picks his way cautiously forward, seemingly choosing his footfall carefully. Arthur follows Merlin’s vigilant gait as they wind back and forth between the tall sinewy trees. </p>\n<p>“Who goes there?” a voice calls out from the trees. </p>\n<p>Arthur is sure he looked at that tree just a moment before and saw nothing. Yet now there stands a young man. His rough-hewn cloak is pulled tightly around his neck, but the hood is lowered, leaving his young ruddy face exposed. It is pulled into a face of feared determination and Arthur cannot help but admire the young man for that. </p>\n<p>“Hello,” Merlin says easily, sending the boy an awkward wave. “I mean no harm.”</p>\n<p>As Merlin walks gently forward the young man stares intently at his face. All of a sudden all fear and fright is wiped from his expression which quickly falls into amazement. </p>\n<p>“Emrys!” he cries in wonder. </p>\n<p>Arthur is left in astonishment as the Druid drops himself to his knees and actually bows down on the leaf strewn floor before Merlin. </p>\n<p>Merlin’s face doesn’t look much better than what Arthur imagines his looks like. In fact, his servant looks positively ashen as he stumbles forward to the kneeling boy. </p>\n<p>“Please don’t do that,” he says, reaching out a hand to bid the boy to rise. </p>\n<p>He does, albeit slowly, still staring at Merlin with wide eyes and a slightly lowered head. </p>\n<p>“Lord Emrys,” he says again in wonder. “What… how can I serve you?”</p>\n<p>This is the second time that Arthur has heard the name ‘Emrys’ directed at Merlin and still it catches on something in the dark recesses of his memory, but that isn’t what catches Arthur’s attention this time. </p>\n<p>“Lord?” Arthur says archly, raising an eyebrow at his blushing manservant. “More secrets Merlin? Really I’m shocked.”</p>\n<p>Obviously, Merlin ignores his scathe and watches the young boy with a pained expression. </p>\n<p>“I really just came to speak with Iseldir. Is he here?”</p>\n<p>“Yes, my lord,” the boy says with another bow. “I would be honoured to escort you.”</p>\n<p>“I’m not your Lord. Just… just call me Merlin.” The boy looks terrified at the mere thought and Arthur has to supress a chuckle. “And I wondered if it was possible to get into camp with as little fuss as possible?” Merlin asks hopefully. “It’s a… sensitive mission.”</p>\n<p>“Of course my-... I mean Merlin. Emrys. Sir.”</p>\n<p>The boy looks pained at himself for a moment before hurrying into the trees and gesturing for Merlin to follow. With a great sigh and a glance to the sky Merlin does. </p>\n<p>“Are all men of magic bumbling?” Arthur asks in amusement as they walk. He has watched the young man leading them almost walk into a tree twice in his efforts to look back over his shoulder at Merlin. “It’s a wonder my father didn’t have you all drowned.”</p>\n<p>They walk through the trees for just a short while before the foliage thins and opens into a small enclosed encampment. As with all Druid camps the area is modest, just a few tents occupy the clearing. Between them small fires, lines of washing and groups of people are scattered. </p>\n<p>Merlin stops just shy of the treeline, peering into the small camp with trepidation. </p>\n<p>“Right,” he sighs. “Just point me in the right direction and I can take it from here.”</p>\n<p>“Iseldir’s tent is the red one in the corner of the camp,” the young Druid says pointing out into the clearing. </p>\n<p>Merlin stares across the encampment with a look of unease that most knights reserve for a battlefield. Arthur cannot help but bark a laugh at his ridiculous servant. </p>\n<p>“It’s a Druid camp Merlin, not Serket’s nest. Get moving will you!”</p>\n<p>Almost as if he heard Arthur’s reprimand Merlin takes a deep breath, squares his shoulders, and steps out of the treeline. </p>\n<p>-</p>\n<p>Even as Merlin tries to keep his head down Arthur watches as the eyes of everyone they pass stick to his manservant. People all over the camp pause what they are doing and stare as Merlin makes his way swiftly over to the red tent in the corner. </p>\n<p>Apparently feeling the weight of all the eyes upon him Merlin hurries his steps, hunching his shoulders in even further. </p>\n<p>By the time they reach the tent an old, wizened man has already emerged from within, standing at the tent entrance with a kind smile on his face. </p>\n<p>“Emrys,” he greets with a small bow. “To what do we owe the pleasure?”</p>\n<p>“I came to request your assistance,” Merlin says quietly. “If I may?”</p>\n<p>“Of course, you may Emrys. We are here but to serve you.”</p>\n<p>With that the old man, which Arthur determines must be Iseldir, pulls open the flap of his tent and gestures for Merlin to enter. </p>\n<p>Inside the tent flap closes and the inner space is plunged into silence, almost as if by magic Arthur muses. He has never really had the opportunity to be openly nosey about a magic users home so he takes the opportunity to look around in interest for any evidence of sorcery. Only a few possessions littered around the space identify Iseldir as someone of import. Other than that the interior of the tent is very bare, even with its lived in feel. </p>\n<p>The druid elder sits down on a small log within the space, gesturing for Merlin to take the other. </p>\n<p>“It’s Arthur. The King,” Merlin starts with no preamble. “There was… an incident. I have reason to believe druidic magic was involved.”</p>\n<p>When Iseldir gestures for Merlin to expand he does, explaining to the Druid about the patrol and the chanting and the crystals. When he is done the elder is watching Merlin with a thoughtful frown. </p>\n<p>“There was an ancient druidic ritual,” Iseldir explains. Both Merlin and Arthur lean further forward in anticipation. “The druids would tie a soul to a crystal. The practice was said to enhance clarity and mindfulness. It was designed to strip away earthly ties and allow one to ‘see’. But as always with such things some sought to turn the practice into a weapon. They would use the power from another’s soul to increase their own power.”</p>\n<p>“And you think that is what has been done to Arthur?”</p>\n<p>“From what you explained yes. And the soul of the Once and Future King would offer the wielder quite a bit of power.”</p>\n<p>“So, Arthur’s soul…” Merlin says, worry evident in his tone. Arthur cannot help but share his servant’s concern; one’s soul being torn from their body does not sound like something you can come back from. </p>\n<p>“Do not fear Emrys,” Iseldir says kindly. “It is tied to this plane as long as his body is. They would have to destroy his body before his soul could be harvested.”</p>\n<p>“Which explains the assassin,” Arthur says to Merlin, seeing his face contort in thought. </p>\n<p>“But Emrys,” Iseldir continues, “the druids banned the practice of such rituals many decades ago. If this is truly what has befallen the King, it was not the act of a true druid.”</p>\n<p>“But someone aware of the ancient practices.”</p>\n<p>“Yes.”</p>\n<p>Merlin nods, seemingly processing the information he has been given so far. Iseldir sits back and leaves him to his silence for a minute. </p>\n<p>“And to reverse it?” he asks eventually. </p>\n<p>“The easy way?” At Merlin’s nod Iseldir sighs. “Simply crack the crystal. The soul will be freed and return to the body should it still be unharmed.”</p>\n<p>Merlin visibly sags in relief at the news, sending a grin in Iseldir’s direction. </p>\n<p>“Ok,” he murmurs almost to himself. “Now I just have to find the thing.”</p>\n<p>“Crystals with a soul tied to them hold immense magical power. Someone with such gifts as yourself should be able to scry for it easily.”</p>\n<p>“Right,” Merlin says, scratching the back of his neck nervously. “I’ll try that then. Thank you for your time.”</p>\n<p>He stands and Iseldir does with him. “It is my pleasure Emrys,” he says with a bow. “Won’t you stay for lunch? The camp would be thrilled to know you had come to visit.”</p>\n<p>“No, I really must go. Back to Arthur and my destiny and all,” Merlin says with an awkward wave of his hand. </p>\n<p>Iseldir pulls back the tent opening and gestures for Merlin to go ahead of him. Merlin ducks under the fabric only to come to a stuttering stop outside. Arthur huffs at his useless servant and manoeuvres around his still body to see a crowd of people outside the elder’s tent. </p>\n<p>It looks as if the entirety of the Druidic camp has congregated and all stare expectedly and with wonder at Merlin… Arthur’s useless servant. </p>\n<p>“They’ve just come to say hello Emrys,” Iseldir says kindly. “No need to look so nervous.”</p>\n<p>As Arthur looks back at Merlin he can see that the man’s face has paled by a few degrees. He can’t really blame him though. The stares of his people sometimes feel as they are weights. With every one of them he feels the burden of the kingdom and its future on his shoulders even more. Arthur still finds these shows of outward admiration from his people difficult to deal with and he has been training to deal with them since birth.</p>\n<p>Merlin has had no such training. But even as Arthur watches Merlin squares his shoulders and visibly swallows down his discomfort. He offers the gathered crowd a small smile and a nod of his head. </p>\n<p>From the depths of the crowd a small girl rushes forward. Her cherub face is streaked with dust beneath her thick mop of black curls, but she looks up at Merlin in happiness as she trips forward until she is stood at Merlin’s feet.</p>\n<p>She holds up a small pink flower to Merlin. </p>\n<p>“Is this for me?” Merlin asks kindly, kneeling before her to accept her gift. At the girl’s nod Merlin smiles and twirls the flower between his fingers. “Thank you. But I don’t really think it is my colour. I think it would look better on a beautiful girl like you.”</p>\n<p>Without a word Merlin leans forward and with a twist of his hand and a glow of his eyes transforms the single flower into a small garland. He places it on the girl’s head reverently as if it were a crown and leans back. </p>\n<p>“There,” he mutters, straightening it amongst her black curls. “Much better.”</p>\n<p>The girl beams and it is as if a damn has broken. Chatter breaks out amongst the druids and they all come forward, eager to place a hand on Merlin, shake his hand, touch his arm, offer him a word of greeting. </p>\n<p>Anyone who knew the man would be able to tell just how uncomfortable Merlin feels. Arthur takes great pleasure in watching his servant squirm under the attention that Arthur got used to at a young age. But there is no disguising the esteem in which Merlin is held amongst this crowd. </p>\n<p>The men are all eager to lean forward and engage the man in conversation, the children scamper excitedly around the camp, the elders watch the scene with pleased eyes. </p>\n<p>And the women… well the maidens in the group huddle in packs, watching Merlin from underneath their eyelashes and whispering fiercely to each other… just like the women of court. Arthur shudders in sympathy. But either Merlin is just as oblivious to the world as Arthur had always assumed or he purposefully ignores them. </p>\n<p>Even as he watches Arthur wonders who exactly Merlin is to these people. He doesn’t seem familiar with them to know the people personally, and not a single person within the group mentions Merlin’s real name. Instead the murmurs of ‘Emrys’ echo through the camp, leaving Arthur to ponder the name once more. </p>\n<p>Even for someone untrained in diplomacy Merlin handles the gaggle relatively well, accepts a few favours that are pushed his way and bids the camp a fond farewell before heading back to Camelot. </p>\n<p>-</p>\n<p>“So how exactly do you ‘scry’?” Arthur asks Merlin as they jog up the stone steps into the castle that afternoon. “Do you need a spell? How long will it take to find the crystal? Will I come back to my body straight away? How accurate is it?” </p>\n<p>Arthur does not pause in his questions all the way up to Gaius’ chambers. He cannot help it. Even when he believed magic to be the ultimate evil it had always been fascinating. He always wondered how it worked; how could you create something from nothing? Where did it come from? What made one sorcerer more powerful than another? </p>\n<p>Gaius greets Merlin with a wry smile and a query about how his trip to the druids was. Merlin blushes fiercely and mutters something under his breath before retreating to Gaius’ stores. Gaius chuckles under his breath and goes back to his reading, ignoring the racket Merlin is making in his store cupboard. </p>\n<p>Arthur rolls his eyes and leaves his servant to it. He has been witness to Merlin’s special form of chaotic organisation for enough years to know he doesn’t want to see what his servant is up to in that cupboard. Instead he looks over Gaius’ shoulder in interest wondering if the book he is reading is about magic or simply healing. </p>\n<p>Merlin’s huff breaks his concentration and the man drops a large bowl into the centre of the table. The heavy pot makes a loud thud that makes even Arthur start. </p>\n<p>“Merlin!” Arthur complains loudly but Gaius has a lot more experience dealing with Merlin than Arthur and simply raises an eyebrow in question. </p>\n<p>“Iseldir said to scry for the crystal,” Merlin explains. </p>\n<p>“Alright…” Gaius says obviously waiting for the rest of the explanation. </p>\n<p>Merlin shrugs. “I don’t know how.”</p>\n<p>Arthur groans dramatically and sends his servant a scathing look. “Merlin! Isn’t scrying in the sorcerer basic training? I should have known you would be as useless at this as you are everything else!”</p>\n<p>Gaius seems to communicate everything that Arthur has just said with another complicated move in his eyebrows. Merlin huffs. </p>\n<p>“What?” Merlin says, throwing his hands to the side. “When was I supposed to learn? I don’t know if you’ve noticed but there isn’t a great abdundance of magical training available in Camelot. Everything I do is instinctual.”</p>\n<p>“Fine,” Gaius sighs, longsuffering. “Fill the bowl with water. I’ll talk you through it.”</p>\n<p>From where Arthur is standing, watching the whole process in interest, there seems to be a lot less ceremony and smoke in scrying than he had witnessed in all other magics throughout his life. But he can hardly claim to be an expert. In fact, the process is so dull that Arthur zones out while Merlin waves a dangling stone back and forth over a map of Albion. </p>\n<p>Eventually Merlin’s triumphant cry interrupts his blank stupor. </p>\n<p>“You found it?” Arthur asks eagerly, quickly gathering over the map. </p>\n<p>Gaius and Merlin are already crowded over the map, staring at the point where the crystal has dropped onto the paper. </p>\n<p>“That is in Cendred’s kingdom,” Gaius says warily. </p>\n<p>Arthur shares the physician’s caution as he looks at where the crystal has fallen. It is by no means at the heart of the kingdom, but the apparent location of his trapped soul is a little too close to his enemy’s castle for Arthur’s liking. </p>\n<p>“Looks like it,” Merlin sighs. </p>\n<p>“How can we be sure that Cendred isn’t behind this?” Gaius asks, looking up at Merlin with trepidation. </p>\n<p>Merlin is just staring at the map with a grim determination in his face. “We can’t, but that is where Arthur’s soul is.” He straightens his shoulders and sends a forced manic grin at Gaius. “Looks like I am taking a trip to Merenora.”</p>\n<p>As he starts backing away from the table towards his rooms Arthur catches up with what Merlin had said. </p>\n<p>“You are not going on your own!” he exclaims, watching Merlin bound up the stairs to his room. </p>\n<p>“You cannot go alone Merlin,” Gaius calls out. </p>\n<p>“See even Gaius agrees with me!” Arthur huffs. </p>\n<p>“I’ll be fine Gaius,” Merlin’s muffled voice from his room calls out. “I need to leave now before it is too late.”</p>\n<p>“But you will have to travel through the Forest of Brecha and Ascetir,” Gaius argues, studying the map. “Not to mention that the crystal is likely to be guarded heavily.”</p>\n<p>“And I can fight better when there is no one there I have to hide from!” Merlin calls back. </p>\n<p>The entire situation is preposterous. A lone man, a servant, an untrained warrior none the less, cannot go into hostile territory on a mission to save the King. That is the entire point of the Knights! </p>\n<p>“Gaius you cannot just let him wander off into enemy territory alone!” Arthur shouts at the physician. </p>\n<p>But Gaius just sighs and goes back to his chair and book without further word. Merlin stumbles out of his room with his jacket on and a small pack hung over his shoulder. </p>\n<p>“I’ll be back as soon as I can!” he shouts as he rushes through the chambers. Gaius sends him an exasperated look but doesn’t move to stop him. </p>\n<p>“Gaius!” Arthur shouts. “He’s going to get himself killed!” </p>\n<p>But the physician doesn’t move from the table, he simply turns a page in his book and carries on reading.</p>\n<p>“At least take Gwaine,” Arthur is still arguing at a rush as he follows Merlin through the darkened castle. “He loves an excuse for an adventure. Or Percival! I’d even settle for you taking Guinevere at this point.”</p>\n<p>Of course, Merlin ignores him and distracts any passing guards with a highly unsubtle flaring of gold in his eyes. </p>\n<p>“You’re going to get caught!” Arthur hisses as Merlin causes a suit of armour to fall and darts past the preoccupied guard. </p>\n<p>They turn into the main corridor. Merlin is almost running now and Arthur is jogging to keep up with Merlin’s long strides. </p>\n<p>“Boy!” a harsh voice barks from behind them. Arthur lets out a heartfelt grown. </p>\n<p>“Go away Bodin!” Arthur growls walking shoulder to shoulder with his servant. </p>\n<p>The footsteps behind them quicken as Lord Bodin hurries determinedly toward them. Merlin doesn’t even pause. </p>\n<p>“Boy!” Lord Bodin calls again, rage filling his tone at being ignored. But still Merlin doesn’t stop. </p>\n<p>“Can’t you turn him into a toad or something?” Arthur asks as he jogs to keep up with Merlin. They turn into a smaller hallway with Bodin’s steps close on their heels. </p>\n<p>“Stop!” Lord Bodin calls again. </p>\n<p>“Just bugger off Bodin!” Arthur calls over his shoulder, keeping stride with his servant. “I will deal with you when I’m back.”</p>\n<p>Merlin turns into a small doorway into a space that is almost black with darkness. As soon as they are through the doorway Merlin ducks, hiding himself in the shadows in a move so quick Arthur has to double check his servant hasn’t simply disappeared. </p>\n<p>As Arthur stands there Bodin storms forward, his eyes darting about in the darkness for his prey. It isn’t until Bodin has stalked past Merlin’s hiding place that the servant slowly emerges from the shadows. </p>\n<p>“What can I help you with this time Bodin?” Merlin’s voice asks from the darkness. </p>\n<p>Arthur cannot blame the Lord when he visibly starts but he rallies himself quickly, pulling his shoulders back and plastering a smug look of arrogance on his aged face. </p>\n<p>“You are out after curfew. You will follow me down to the dungeons until the Queen wakes and passes judgement.”</p>\n<p>“That’s a kind offer My Lord but I am afraid I will have to decline. Perhaps another time.”</p>\n<p>Merlin turns his back to Bodin to leave and the Lord darts forward. Arthur has a flash back of the Lord’s attack on his servant earlier that day but before he can shout in warning the Lord trips over nothing and ends up on his back on the floor. Arthur cannot help but laugh. </p>\n<p>“Careful Bodin,” Merlin is saying over his shoulder. “It is dangerous wandering about the castle in the dark.”</p>\n<p>Bodin scrabbles inelegantly to his feet. “You will come back here or I will call for the guards!” </p>\n<p>Merlin swirls and Arthur takes a step back at the cold anger in his servant’s face. Even Lord Bodin staggers back a few steps. Looking at Merlin now there is no way you could ever mistake him for a mere servant. There is something harsh and otherworldly about him as he takes a step forward towards Bodin who sensibly takes a step backwards. </p>\n<p>“I do not have time for your particular brand of disapproval right now Lord Bodin. I have things to do. Stay here and do not follow me.” </p>\n<p>Merlin’s eyes swirl gold and the wooden door swings shut in the doorway. Arthur distantly hears the muffled thud of Bodin’s body hitting the door and his shouts for help as they disappear into the castle. </p>\n<p>-</p>\n<p>“Thomas,” Merlin greets as he rushes into the royal stables. The young boy Arthur remembers from his first morning in this state (was that really only 3 days ago? It feels like a lifetime ago for Arthur now) startles up from his sleeping at Merlin’s abrupt arrival. </p>\n<p>“I’m taking my horse,” Merlin calls as he throws a saddle over his mare. “I’ll be gone for a day or so. Send word to Gwaine for me would you?” </p>\n<p>Thomas barely has time to formulate a response before Merlin’s horse is saddled and he is swinging himself up onto her back. Before Arthur can even think of course of action Merlin is starting to ride away and Arthur just reacts. He runs forward, placing two hands on the back of the horse and jumps. He just about manages to secure himself on the back of the horse before Merlin breaks out into a gallop. </p>\n<p>-</p>\n<p>When the sun sets in earnest and the forest is plunged into darkness Arthur expects Merlin to stop. But they don’t. They ride all through the night, not pausing or letting up pace once. The horse should have tired but Arthur is quite sure that something of Merlin’s magic is keeping them going. </p>\n<p>As the sun rises it brings with it rain. Arthur cannot feel it but from his seat Arthur can see the rain dripping from the ends of Merlin’s sodden hair and can see it in the soaked fabric of the man’s jacket. But still they do not pause. </p>\n<p>Onwards they gallop through the rest of the day. They pass over the boarder at some point after midday, the only sign that they are now in Escetir is a small stone plinth marking the division between the two Kingdoms. </p>\n<p>They are in the Forest of Merenora before Merlin eases up his pace. They slow to a trot as they wind through the thickening trees. Again, they do not stick to any paths. Arthur assumes Merlin uses his magic to guide him as they continue forward. </p>\n<p>The stronghold is near invisible and very well placed amongst the thick trees and bordered by the tall stone face of a gorge on one side. It is clearly the ruins of an old castle or keep. Little remains of the stone structure other than a few internal walls and an impressive archway that spans from the stone face of the gorge overhead to a pillar. </p>\n<p>There at the entrance two mercenaries stand on guard dressed in the same simple black tunic that his assassin had been in. Arthur almost scoffs. If you want to keep your secret hiding place in a castle’s ruins secret don’t post two uniformed guards at the entrance. </p>\n<p>Arthur is sure Merlin is using some kind of magic to dampen their sound as the men don’t even turn at the crunching of the horse’s hooves in the leaves. As silent as the night Merlin slides from the saddle and creeps forward, crouching low amongst the bushes for cover. </p>\n<p>Both Merlin and Arthur survey the ground below them. The castle is slightly lower than their vantage point. That gives them the advantage, Arthur muses. </p>\n<p>“If you approach from that direction,” Arthur says pointing to the left where the bank they are on meets the gorge, “then you will have the advantage of the higher ground, and they won’t be able to outflank you. If you focus on disarming them first-”</p>\n<p>But Arthur doesn’t get to finish before Merlin has stood and marches purposefully and swiftly right at the two guards. </p>\n<p>The men see Merlin’s approach (how could they not) and draw their swords simultaneously but before either man can form a shout of warning for anyone inside the ruins their eyes roll back in their heads and they crumple to the ground like cut puppets. </p>\n<p>“Or that would do it,” Arthur murmurs in shock.</p>\n<p>Merlin pauses to look at the bodies as he passes. Arthur can clearly see the men’s moving chests, proving they are not in fact dead, merely sleeping. Before Arthur can berate Merlin for his naivety for leaving two armed men unharmed at their only exit Merlin reaches down and plucks the men’s swords from their pliant hands. With a whispered word the metal weapons disintegrate and blow away on the wind. </p>\n<p>Merlin brushes the ash from his hands and strides purposefully forward. Arthur can do little but follow. </p>\n<p>-</p>\n<p>Although the old castle is long gone the crumbling interior walls still rise tall to the sky around them. Between the gorge side and the surrounding trees, it casts a cool shadow over the interior of the ruins as Merlin and Arthur march forward. </p>\n<p>Arthur is starting to wonder if those two mercenaries at the entrance were the only protection to his precious soul. He has a few moments to feel ridiculously put out by that before Merlin stills. Reflexively Arthur does too, listening for what might have made Merlin pause. </p>\n<p>It is a few moments before Arthur can hear it too; the quiet murmuring of men talking. Merlin starts walking forward once more, even more cautious of his surroundings than he was before. </p>\n<p>He pauses, his eyes flicking between the men before him and their surroundings, almost like a warrior would before a fight Arthur muses, before he just steps blithely forward. </p>\n<p>“Merlin!” Arthur hisses, trying to grab at his servant’s arm but it is no use. </p>\n<p>The men notice Merlin as soon as he comes into the ruined courtyard. </p>\n<p>“Hello,” Merlin calls to the group, advancing with a sunny smile. The men in the courtyard jump to their weapons but don’t draw them. They look at Merlin with a bemused confusion that Arthur feels he can absolutely sympathise with. </p>\n<p>Arthur imagines how this might look to these trained warriors; a man, no armour or visible weapon, tattered clothing, no visible strength, calmly walking into a guarded castle and straight into their midst. They must think the man is a simpleton, or a distraction. </p>\n<p>Sure enough the men’s eyes flick from Merlin to the various entrances into the courtyard, searching within the darkness for an attack to come. Well let them think that, Arthur thinks. If they have one eye on their surroundings looking for an ambush it will be easier for Merlin to beat them. </p>\n<p>“Oh there is no one there,” Merlin says with a wave of his hand. “I’m here alone.”</p>\n<p>Arthur wants to hit his head against something hard. </p>\n<p>“What do you want boy?” the man in the centre barks, his hand tightening on his sword. </p>\n<p>“Why do people keep calling me that,” Merlin says with a huff, crossing his arms. “I am very clearly a grown man.” </p>\n<p>“He asked you a question,” says a man to the left, menacingly. </p>\n<p>“Oh. I thought that were obvious. I want the soul of Arthur Pendragon. I heard it was here.”</p>\n<p>A shocked pause stills the men in the courtyard as they look between each other. Surreptitiously, almost subconsciously, the man at the centre glances up and to the right; right up at a winding tower set at the corner of the ruins. Arthur almost crows with triumph. </p>\n<p>“Up in the tower then,” Merlin says with a nod, obviously also noticing the man’s slip. “I’ll go look there then.” </p>\n<p>He takes a step forward in the direction of the tower only to pause when a sword swings in his path. </p>\n<p>“You foolish boy,” the man sneers, advancing on Merlin menacingly. “I could take you apart with a single blow.”</p>\n<p>“I could take you apart with less than that.”</p>\n<p>The joke is one for Arthur’s ears alone who barks out a laugh remembering his first encounter with the plucky peasant in the lower town. Arthur remembers thinking that the young boy were brave, standing up to a prince like that, but absolutely foolhardy. Now with his new knowledge he looks upon that scrabbling fight in a new light, fond amusement colouring the memory and remembers all the inanimate objects that found their way into his way during that fight. He laughs again shaking his head; only Merlin. </p>\n<p>The mercenary lunges forward and Merlin’s eyes swirl gold. True to his word, without lifting a single finger he sends the brute of a man flying across the stone floor and into the solid wall. He hits it with a crunch falling uselessly to the floor. </p>\n<p>The rest of the men look from their fallen comrade back to the pale man in servant’s clothes now staring them with unshielded fury in his eyes. </p>\n<p>Almost as one the men drop their swords and scurry from sight, disappearing through the gaps in the stone walls and away into the night. </p>\n<p>“Well,” Arthur sighs looking at the backs of the retreating men, “that was slightly anti-climactic.”</p>\n<p>-</p>\n<p>The tower is one of the only remaining structures of the old fortress. It spirals up into the sky and towers above the tree tops. Arthur follows as Merlin rushes upwards, taking the spiralled staircase two or three steps at a time. </p>\n<p>The wooden door at the top of the tower is half open, emitting a glowing orange light of candles from within. Arthur opens his mouth to urge caution but Merlin charges through the door, heedless to any danger that may be within. </p>\n<p>The sudden entry makes the room's sole occupant startle and turn. He is small of stature and certainly not a knight or warrior. His dark blue robes are tattered and worn but bear the same crest as the men downstairs. At first look the man narrows his eyes and takes a confrontational step forward. But something of recognition appears in his eyes and he pales, backing up a few steps. </p>\n<p>“Emrys,” he whispers with a mixture of fear and awe. </p>\n<p>“So you know who I am?” Merlin asks taking a more cautious step into the circular room. “That will make this easier then. Who are you?” </p>\n<p>“Trayger my Lord.”</p>\n<p>“You must know, what a mistake you have made attempting to harm the Once and Future King.”</p>\n<p>Merlin walks forward like a hunter circling its prey; cautious but precise and determined. </p>\n<p>“My Lord, I didn’t mean to offend. I only wish to see the same thing you do. To see magic welcome and our people free once more.”</p>\n<p>Merlin huffs and Arthur cannot help but mirror his scepticism. A man who wants peace above all else does not send mercenaries to kill a King. He strives for peace with his every action. Just like Merlin does, Arthur muses as he watches his servant stalk forward towards the druid. </p>\n<p>“It is not your place to put such things in motion,” Merlin says. “It is Arthur who is destined to bring magic back to the land. Not you. Not your mercenaries.” </p>\n<p>Trayger’s bland face twists in anger. “My mercenaries are loyal men who fight for a cause worth dying for. Tell me, what do you fight for Emrys?”</p>\n<p>“I fight for Arthur. And for the kingdom he is building. And the future he will bring.”</p>\n<p>“I have seen nothing that convinces me this man is the prophesised king! Even now he still persecutes magic users. Magic is still punishable by death!”</p>\n<p>“And how many magic users has Arthur executed since his coronation?” Merlin spits. </p>\n<p>It takes Arthur a moment to realise that he has not executed any. There have only been two arrests for sorcery since he became King; one was a simple farmer who escaped the cells before Arthur could consider his judgement and one was a small child. Arthur could never condone the execution of a child, so the family were simply banished. </p>\n<p>Trayger simply glares back at Merlin but doesn’t answer. </p>\n<p>“Exactly,” Merlin says triumphantly. “He is a good man and a good king.”</p>\n<p>“Says you,” the man scoffs. </p>\n<p>“Yes. Says me. Now where is the King’s crystal?”</p>\n<p>Trayger stiffens. “I will not let you do this Emrys. We could be free. Don’t you want that?”</p>\n<p>“Of course I do. More than anything. But it will happen when the time is right. Now do not test me Trayger,” Merlin says, his voice dark and dangerous. “Give me back the King.” </p>\n<p>Merlin steps forward and Trayger lifts his hands hastily. A string of unintelligible words spring from the man’s lips and fire pours from his fingers, straight for Merlin. </p>\n<p>Fear tightens at Arthur’s heart but it is short lived. With barely a movement Merlin waves his hand and the fire dissipates into nothing. The look he sends Trayger is almost disappointed. </p>\n<p>“You will have to try harder than that if you want to best me with magic Trayger. Now where is Arthur?”</p>\n<p>“You fool!” Trayger spits sending another wave of magic in Merlin’s direction. Again the servant brushes it aside with careless ease. </p>\n<p>“This is a fight you cannot win. I don’t wish to hurt you. Tell me where Arthur is and I will let you walk from here unharmed.” </p>\n<p>Trayger shifts. It is just a small movement to the right but Arthur notices it, so does Merlin who narrows his eyes at the chest against the far wall, the one the man has just moved in front of. </p>\n<p>“Move,” Merlin growls. </p>\n<p>The man twists and Arthur sees it before Merlin does; the ruby hilt of a dagger being pulled from beneath his cloak. </p>\n<p>“Dagger!” Arthur calls in warning, but it is too late. When Merlin advances the man throws another spell, but it is clearly a distraction. His other hand darts forward, expertly reaching beneath Merlin’s outstretched arms and into his unprotected flank. </p>\n<p>The sound Merlin makes when the dagger hits is not something Arthur ever wishes to hear again. The servant’s eyes go wide and he chokes on air as the man withdraws the blade, eyes full of smug malice. </p>\n<p>Merlin’s hands automatically go to his side, clutching at the wound and swaying slightly on the spot. Arthur is at his side in an instant, his own hands flittering uselessly over Merlin’s clenched hands and the thick blood he can see leaking from between the thin fingers. </p>\n<p>“I am unimpressed Emrys,” Trayger says with smug satisfaction. “Your magic may be no match for mine but you are still a man. You can be bested by men’s weapons.” </p>\n<p>Trayger darts forward again, braver and more determined than he has been before, but just as he reaches Merlin and Arthur braces himself to witness the final blow Merlin twists. He grabs the man’s forearm and shoves forward. </p>\n<p>Arthur is frozen as he hears the tell-tale sound of flesh squelching but when Merlin staggers back the dagger is not embedded into his stomach as Arthur had feared but protruding from Trayger’s neck. </p>\n<p>The man drops to the floor with a clatter of limbs. Merlin takes a deep breath, then another one, then Arthur can do nothing but watch on in horror as the strength leaves Merlin’s legs and he too crumples to his knees. </p>\n<p>“Merlin!” Arthur cries, rushing forward hands outstretched. But there is nothing he can do. He’s a ghost. Pointless. Useless. </p>\n<p>His servant kneels in the centre of the room, his adversary beaten, his shoulder's bowed and breath heaving. Merlin presses a hand to his side, gasping at the pain the pressure brings. When he brings it away Arthur can see the thick dark red pattern of blood spreading across the man’s tunic. </p>\n<p>“Can you heal it?” Arthur asks frantically, thrown by the amount of blood. </p>\n<p>Merlin just grits his jaw and presses his hand more firmly against the wound. With a grunt he pushes himself to standing. His face is pale with pain, and no doubt blood loss too, as he starts limping slowly over to the corner of the room… in the opposite direction of the exit. </p>\n<p>“What are you doing!” Arthur shouts as he sees Merlin all but collapse at the side of the wooden chest in the corner. “Stop foraging and heal yourself!” </p>\n<p>With a flash of Merlin’s eyes the chest springs open and a brilliant white light escapes its confines. The crystal, Arthur realises with a jolt, Merlin’s found it. </p>\n<p>“Arthur,” his servant sighs in relief. He reaches a shaking hand into the depths of the chest and reverently cradles the glowing stone in his hand. “Thank the gods. Don’t worry you will be home soon. Gwen is waiting for you.”</p>\n<p>The reality of the situation dawns on Arthur all at once as he sees Merlin raise the crystal to his face. </p>\n<p>“Merlin. Don’t!” he barks at the man, kneeling down by the servant’s side. Blood is leaking with gusto from beneath Merlin’s clenched fingers and is already starting to pool on the floor by their knees. “That’s an order! You need to be seen to. That wound…”</p>\n<p>“It might take me a little while to get back myself,” Merlin is saying with a gasp. “I’m sure you will be up and complaining by the time I do.” </p>\n<p>“Merlin do not break that crystal!” Arthur is shouting now. He knows as soon as Merlin does Arthur will be torn from this place, sucked back into his body, and Merlin will be here, on his own, bleeding half to death. What if he gets back into his body and doesn’t remember? What if no one knows where Merlin is? What if Merlin cannot heal himself? </p>\n<p>“Put that thing down right now!” he tries once more but Merlin has never been one to follow orders he could clearly hear, let alone ones he cannot. </p>\n<p>With a grunt verging on a growl Merlin raises the crystal above his head. The last thing that Arthur remembers before a bright white light encompasses him is his last desperate shout to Merlin and the ringing sound of the crystal breaking.</p>\n<p>Arthur is dreaming, he is sure. There is a bright light, someone calls his name, and there is fear; not for himself but for someone else. There is something he needs to do, someone he needs to save. But he cannot see through the thick white light that encompasses him. </p>\n<p>He wakes sluggishly, groaning as he comes back to his aching body. His limbs feel heavy, as if he has laid in one position for too long. He groans again, shifting his legs and trying to lift his arms. </p>\n<p>“Arthur?” a voice gasps near his head. “Arthur!” it shouts again in excitement. Then there is a commotion next to his bed. Someone shouts for Gaius and there are more people calling his name. Really, can they not leave him alone to wake in his own time? He is the king for god’s sake. </p>\n<p>He slowly peels one eye open, blinking when he sees his wife’s worried face hovering above his own. </p>\n<p>“Arthur?” she asks again, a smile on her lips and tears in her eyes. </p>\n<p>“I think so,” Arthur grunts, trying to get his mind to catch up. </p>\n<p>Then she is squealing and throws herself forward, wrapping her arms around Arthur’s body. Arthur tries to react and manages to lift one arm weakly to give her a pat on the back. </p>\n<p>And then his mind clears, and he sits bolt upright in bed. </p>\n<p>“Merlin!” he gasps. “Where’s Merlin?” he asks his wife frantically, already trying to untangle himself from his bed clothes. </p>\n<p>“I… I don’t know,” Guinevere answers with a confused frown. “It’s late he is probably in bed. Arthur, please sit. You have been asleep for days.”</p>\n<p>“I can’t Guinevere. I need to find him. Get Gaius. And Leon.”</p>\n<p>“Arthur, Leon is not here. You have been unconscious for days! Please just rest!”</p>\n<p>“I can’t Guinevere. I will explain all later. Please. Just fetch Percival then. I need to get dressed.”</p>\n<p>She looks at him searchingly for a few moments before sighing in defeat. Gracing his hand with one last squeeze she rises and exits his bed chambers at a rush. </p>\n<p>Arthur is quite glad he is alone in his chambers for when he first tries to stand his legs give way beneath him, sending him tumbling to the ground. Apparently many days spent in a magical sleep do not do much for lower body strength. </p>\n<p>With a growl he pushes himself to standing, bracing himself on his bed post. He stays there for a moment, willing his legs to stop shaking and then pushes off for his wardrobe. </p>\n<p>By the time Guinevere has returned, Gaius and Percival in tow, Arthur is dressed and has his chainmail pulled over his head. </p>\n<p>“Sire!” Percival shouts in relief at seeing his sovereign up and standing. But there is no time for joyous reunions right now. </p>\n<p>“Percival,” Arthur says with a nod, tightening his sword belt with a harsh tug. “Ready a group of men. We ride for the Forest of Merenora immediately.” </p>\n<p>-</p>\n<p>When Arthur has managed to dress himself, choked down the food Guinevere had forced upon him and withstood inspection from Gaius he arrives in the courtyard to see Percival, Gwaine and Elyan already sat upon their horses waiting. </p>\n<p>Arthur’s knights ask no questions as they set out into the night at speed, Arthur at the head. Without Merlin’s magic to guide them Arthur is forced to stick to the paths and walkways, illuminated only by the moon yet still he and the knights ride on. </p>\n<p>With each beat of horse hoof against the earth Arthur relives those final moments in his mind. The druid pulling the dagger. The dagger sinking into Merlin’s side. Merlin’s grunt of pain. Merlin falling to the ground. Merlin’s blood-soaked fingers clenching at his side. His pale face, full of pain. The blood pooling on the floor. </p>\n<p>He tries to consider how much time a man would have loosing blood at that rate but has to stop himself when the answer he gets makes him tense so much his horse almost bucks him. Merlin will be fine, he convinces himself. The man is the luckiest idiot to ever grace the earth. He has survived this long in a kingdom that persecutes magic. He seems powerful. He will heal himself and will be sat at the entrance to the ruins waiting for Arthur when he arrives. </p>\n<p>As much as Arthur would wish to ride onwards they do not have Merlin’s magic on their side and eventually that party has to stop just shy of the Escetir boarder. </p>\n<p>They make camp in almost silence and Arthur wonders if his knights too feel the gapping hole of Merlin amongst their party. </p>\n<p>“Arthur,” Percival says into the night. Arthur starts from his stare into the fire to see his knight staring at him eagerly across the flames. “I have to ask you; do you know what happened to you? How are you healed? You’ve been asleep for days.”</p>\n<p>Arthur opens his mouth to respond. And then promptly closes it again. How does he even begin to start explaining the rollercoaster he has been on these past few days. How does he explain that the simple fool of his manservant has been the key and the cure to his illness? And that that same manservant is right at this moment bleeding to death in some castle ruins. And that he knows this because he has been a ghost, wandering the halls of Camelot ever since his fall. </p>\n<p>His thoughts are interrupted by a gentle thump and he looks up to see Elyan struggling with an armful of logs for the fire. </p>\n<p>“Elyan,” Arthur barks at the knight causing him to fumble the pile of logs even further. “I know for a fact Merlin told you to rest that shoulder. Put the logs down!”</p>\n<p>The knight does his bidding quickly but then he pauses, straightening up slowly. </p>\n<p>“How would you know that sire?” he asks slowly, staring at Arthur with a frown. </p>\n<p>“What do you mean?”</p>\n<p>“I mean I injured my shoulder after you had been attacked. When Merlin told me to take it easy you had already been unconscious a day.”</p>\n<p>The weight of the knights stares gets heavier as Elyan speaks and by the end Arthur can feel the impact of three sets of eyes on him. </p>\n<p>“I haven’t been… gone,” Arthur says, shifting in his seat as he considers the best way to explain. “I have been… around. But just not in a capacity that you all could see.”</p>\n<p>“What do you mean?” Percival asks, leaning forward. </p>\n<p>“My attackers separated my soul from my body and tied it to a crystal. My soul was free to roam the earth until its tie to my body was severed. Which thankfully it was not.”</p>\n<p>“So, you’ve been around, watching us this whole time?”</p>\n<p>“You know, that thing on your throne,” Gwaine says with a forced chuckle. “I was just kidding around.”</p>\n<p>Arthur rolls his eyes at his knight. “Believe it or not Sir Gwaine I have better things to do than watch your antics.”</p>\n<p>“But you had time to watch Merlin bandage my arm?” Elyan asks with a small frown. It isn’t accusatory, or critical but Arthur feels a slight embarrassment at the amount of time he spent following his servant around these past few days. </p>\n<p>“You’ve been watching him,” Gwaine says. It isn’t a question, so Arthur doesn’t answer. He stares his knight right back in the eyes and lets them give whatever answer the man is looking for. Gwaine’s eyes widen slightly in alarm and his grip tightens on the hilt of his sword. “What did you see?”</p>\n<p>Arthur considers his answer. It seems that Gwaine knows or at least suspects what it is that Arthur might have seen as he followed his servant around the castle. But Arthur has a strong feeling that the secret is not his to voice. Instead he matches his knight’s stare. </p>\n<p>“Enough,” he murmurs with a small shrug. </p>\n<p>“And now we are chasing him down into the night?” Gwaine asks darkly, his hand not leaving his sword. Arthur feels an irrational stab of betrayal. </p>\n<p>“The idiot saved my life… multiple times,” he huffs angrily. “I do not reward loyalty and sacrifice with death.”</p>\n<p>“Just making sure we are on the same page Princess,” Gwaine says, easing back. He still watches Arthur but his face breaks into grin. </p>\n<p>“What now?” Arthur grumps in annoyance. </p>\n<p>“Gods, I wish I knew what you had seen.” Gwaine shakes his head, still smiling at Arthur. “What was it like?”</p>\n<p>“It was…” Arthur tries to think of a way to describe the feats he has seen Merlin accomplish; the healing, dissolving metal into ash, taming a dragon, besting a group of trained mercenaries, the tenacious energy he dedicated to saving Arthur, to bringing him back. He finds he cannot. “It was impressive.”</p>\n<p>“I’m sorry,” Percival interrupts tentatively. “But what are you talking about?”</p>\n<p>Arthur starts, realising that the rest of his Knights are still there around the fireplace and looking between Arthur and Gwaine with confusion. </p>\n<p>“It is not my place to say. Just know that Merlin brought me back, and in doing so placed himself in grave danger. We will find him. We will save him. We will bring him home.”</p>\n<p>-</p>\n<p>The party comes to a skidding halt at the entrance to the ruins. Merlin’s horse is still tethered in the trees and any hope Arthur had that Merlin had already made his way back to Camelot vanishes. </p>\n<p>Arthur jumps from his horse, drawing his sword in one smooth movement. The ruins seem silent. Arthur pauses for a moment to listen but all seems quiet… a little too quiet. </p>\n<p>The two mercenaries Merlin incapacitated are gone which tickles uneasily at the back of Arthur’s mind, but he has no time for that now. He leads the men wordlessly into the ruins, retracing his and Merlin’s steps. </p>\n<p>When they entire the ruined courtyard Arthur feels Percival and Elyan pause at his back, staring down at the dead mercenary on the stone floor. </p>\n<p>“What happened here?” Elyan asks at a whisper but Arthur pays them no mind.</p>\n<p>“Sire?” Percival asks from the back but Arthur cannot pause. </p>\n<p>“This way,” he calls, his eyes on the crumbling tower. </p>\n<p>-</p>\n<p>Arthur dare not call out as he runs up the stone staircase to the tower. He tells himself it is to keep his approach stealth, but part of him realises it is fear of not hearing an answer that stills his tongue. </p>\n<p>The wooden door at the top is still wide open from where Merlin had charged in, full of fury, bravery and determination. Arthur finds he cannot mirror his servant’s stoicism. He slows to a walk as he approaches the door, fearing what he will find beyond it. </p>\n<p>He can see the stationary boot of Trayger’s dead body in the corner of the room but he pays the man no mind. It isn’t until he gets to the open doorway that he sees him. </p>\n<p>There, lying half propped up against the rough wooden wall is Merlin. </p>\n<p>Arthur’s breath catches in his throat on an inhale choking his lungs. His servant is just so still. Blood coats the side of his body thickly and his skin is as pale as moonlight. He lays slumped against the wall, his hands splayed on the ground as thickly covered in blood as his tunic. </p>\n<p>A sound behind Arthur is the only warning he gets before the body of Gwaine barrels past him, pushing him bodily from the doorway. The knight runs forward, sword discarded and skidding to his knees beside Merlin’s body. </p>\n<p>They are all talking now, his knights. They are asking questions. Elyan is inspecting Trayger’s dead body. Percival is standing guard at the door shouting over his shoulder. Gwaine is hovering over Merlin’s body. But Arthur cannot hear anything past the buzzing in his ears. </p>\n<p>Then Gwaine moves aside to look for the source of the blood and Arthur sees the steady rise and fall of Merlin’s chest. </p>\n<p>He barks out a relieved laugh. Only Merlin could be stabbed, left for dead and decide that it was a brilliant time and place to take a nap. In a spiteful act born of his fading terror Arthur kicks out a foot and jostles Merlin’s leg. </p>\n<p>“Merlin wake up!”</p>\n<p>“Argh!” a startled yell escapes Merlin’s lips as his eyes fly open. His wide blue eyes dart frantically around the room for a moment before they settle on the knight crouched before him. “Gwaine?” he asks groggily. </p>\n<p>“Merlin,” Gwaine exclaims on a sigh, his head dropping in relief for a moment. “You do know how to scare a man don’t you.”</p>\n<p>“Arthur!” Merlin cries with a smile when he spots Arthur. “You’re awake!” </p>\n<p>“It seems out princess was never really as absent as we imagined these past days. Apparently he’s been following us around the castle like a perverted ghost the entire time. He knew you were here and injured and insisted on staging a daring rescue. I was the obvious choice to accompany him and these guys didn’t want to miss out.”</p>\n<p>Throughout Gwaine’s babbling he had pulled Merlin to standing, dusting down his tunic in a surreptitious check for additional injuries. Arthur has no such desire to be that subtle.</p>\n<p>“Let me see the wound,” he orders coming forward. </p>\n<p>Merlin’s eyes go wide as Arthur approaches and he back up a few steps. </p>\n<p>“Arthur, its fine really. It was just a scratch.”</p>\n<p>Arthur snorts. It was not a mere scratch. He saw the wound. He can see the blood. The fact that his servant is still alive is a miracle. </p>\n<p>Not willing to take Merlin’s word for it Arthur reaches him and lifts the blood crusted tunic and pauses. Where a gaping wound should be there is a shallow cut. The pale skin around it is still covered in the remnants of the blood that had poured from it but it is old blood. The wound is small, half closed and shallow, almost as if it were inflicted many days ago. </p>\n<p>Arthur gapes at the scratch for a moment before staring back up at Merlin with wide eyes. His servant just offers an embarrassed smile and shrugs. </p>\n<p>“Told you it was just a scratch.” </p>\n<p>The fear and worry that had conquered Arthur’s every thought and breath for the last day suddenly manifests itself in anger. He drops the tunic and storms away. </p>\n<p>“Arthur!” he hears Merlin shout from behind him, but Arthur doesn’t stop. He leaves the tower, jogging down the spiral staircase. The sound of armour-clad bodies moving tell him that everyone has followed. </p>\n<p>Arthur knows his anger is uncalled for. And he knows it will be short lived. But so much as has happened to him in recent days. He just needs a moment alone in the trees to gather his thoughts and then he and Merlin will talk. At length. </p>\n<p>He has only just walked through the crumbling archway to the forest when he hears a frantic shout from behind him - “Arthur get down!” – and then a body is barrelling into him, sending him crashing heavily to the floor. </p>\n<p>The tell-tale whistle of arrows sound in the air and Arthur realises belatedly that Merlin is laying on top of him, shielding his body with his own in the clear open grassland. With a growl Arthur twists, getting his servant’s unarmoured body beneath his own and pulling them both quickly back behind the relative safety of the stone archway. </p>\n<p>“You idiot,” he growls to his servant, almost throwing him backwards away from the oncoming arrows. Merlin looks back with his typical unhappy frown that manages to tell Arthur that he is both ‘being a prat’ and that Merlin is not sorry for tackling his sovereign to the ground. </p>\n<p>Arthur huffs, turning away and peering around the stone into the forest beyond. The volley of arrows has stopped and an unnerving silence has descended on the clearing. There are perhaps only a few moments of silence before a cry sounds from within the trees and a hoard of men come hurtling forward, weapons of axes and swords held aloft. </p>\n<p>“I knew that was too easy,” Percival grouses even as he pulls his sword. The ringing of metal on metal tells Arthur that the rest of his knights have done the same. </p>\n<p>Arthur has one moment to ask the heavens why it is always him that ends up in these situations before he draws his sword from his belt. </p>\n<p>And then they charge. </p>\n<p>-</p>\n<p>There are too many. The small band of Camelot knights are outnumbered at least six to one. No amount of training and skill can overcome those odds. Even as they dispatch man after man still more pour from the tree line. </p>\n<p>Arthur ducks a messy blow from a mercenary and slices across his chest, easily ending his life. He turns scoping out the tide of the battle only to see his idiot servant stood in the middle of the fight not doing anything. </p>\n<p>“Merlin do something!”</p>\n<p>At the call of his name Merlin startles towards Arthur, his face merging into its usual frown of confusion. </p>\n<p>Arthur huffs and wiggles his hands at the mercenaries in a manner that clearly conveys ’use your magic’ but Merlin’s frown just deepens. </p>\n<p>“Merlin, did you or did you not miss the part when Gwaine explained I have been watching you for the past few days? I know your little secret. Now be useful for once in your life and do something!”</p>\n<p>Merlin pales, and staggers back. “What…”</p>\n<p>“Oh for gods sake,” Arthur growls, dispatching an advancing man with a swing of his sword. He turns back to his servant. “Magic Merlin. Your magic.”</p>\n<p>Arthur is slightly concerned by the pallor of Merlin’s skin now which has gone nearly snow white. The man looks back at Arthur, eyes wide, breathing quickening and minutely tremoring. On Merlin it takes Arthur a stupid amount of time to realise the emotion he is seeing. To be fair, Arthur muses to himself, he doesn’t think this is an emotion he has ever seen properly on his servant before. </p>\n<p>It is fear. </p>\n<p>That would be bad enough. But it is Arthur that Merlin is staring at in horror. It is Arthur he has just taken a stumbling step away from. It is fear of Arthur. </p>\n<p>And that just won’t do. </p>\n<p>Elyan pulls to Arthur’s right, taking on the advancing men giving Arthur the time to turn to his servant properly. He claps a hand to Merlin’s shoulder, feeling the tremble of fear in the man’s slight frame. Arthur gives it what he hopes is a comforting squeeze and looks right into Merlin’s eyes. </p>\n<p>“I saw you dispatch the mercenaries on our way here,” he says, his voice as gentle as he can make it amid a fight. “I saw you call a dragon. I saw you kill the assassin sent for me. Now sort this mess so we can get back to Camelot and go home!”</p>\n<p>He stares at his servant, eyes wide, honest and beseeching. Merlin just stares back with an air of incomprehension. Slowly the instinctive terror fades a little and Arthur feels Merlin’s shoulder straighten a little under his hand. </p>\n<p>“Well,” Merlin says, his voice croaky and his eyes suspiciously bright. “Why didn’t you say so?”</p>\n<p>Merlin gives Arthur one of his signature grins and Arthur cannot help but smile back. </p>\n<p>With a deep breath Merlin turns towards the hoards of mercenaries still in battle with Arthur’s knights. </p>\n<p>“Alright, stop!” </p>\n<p>Merlin’s voice cries out across the clearing, bright and sharp and unnaturally loud. The knights all start, their hands going to their ears against the loud sound and everyone… stops… right where they stand.</p>\n<p>Elyan is one of the first knights to recover from the ringing Arthur can still hear in his ears. The knight, eyes wide with wonder, takes a step closer to one of the stuck sell-swords, peering at where the mans leg disappears into the ground. It’s as if his limbs have been sucked down into the ground. </p>\n<p>The mercenary yells and swings his axe towards Elyan’s head. The knight starts, stumbling backward away from the sharp weapon. </p>\n<p>“Sorry!” Merlin calls and suddenly all the mercenary’s weapons explode into ash in their hands. </p>\n<p>Arthur turns to see the bright gold fading from Merlin’s eyes once more. When he notices Arthur’s gaze he hastily drops his arm and tucks it behind his back. Arthur shakes his head in exasperation. </p>\n<p>“You were so much better at this when you didn’t have an audience.”</p>\n<p>Merlin rolls his eyes. “Well I’m sorry sire if performing magics in front of the king of Camelot is a little disconcerting.”</p>\n<p>“I’ve watched you perform magics – very illegally I might add – for the past few days!”</p>\n<p>“I didn’t know you were there, did I?!”</p>\n<p>“No, you didn’t. And when we get back to Camelot we are having a long talk about law breaking, talking dragons and about the fact you seem to be some kind of druidic king!”</p>\n<p>Merlin winces and looks at Arthur sheepishly. “You saw that?”</p>\n<p>“Yes I did,” Arthur says with a huff. “Now I know who to send to the druids as my emissary when I lift the ban on magic.”</p>\n<p>“No,” Merlin moans dramatically which just makes Arthur grin in victory. </p>\n<p>“Oh yes Merlin,” he crows. “Who else is better to be the messenger between me and druids but the mighty Emrys?”</p>\n<p>“But they look at me funny!”</p>\n<p>Arthur can’t help it. </p>\n<p>His knights are looking at them both in a mixture of confusion and perplexation. The mercenaries around them are shouting and pulling at their legs trying to unstick them from the ground. And Merlin is standing there in the middle of it all, thick blood still drying on his tunic and his signature little scowl on his face. </p>\n<p>Laughter bubbles up in his throat and erupts from his mouth. He throws his head back letting the sound spill from his lips into the air. When he returns to himself the knights are all looking at him like he has lost his mind but he doesn’t care. He looks at Merlin, whose face hasn’t quite gained back its colour, and smiles. </p>\n<p>“You, my friend, have a lot of explaining to do.”</p>\n<p>Merlin’s face turns solemn and he gives Arthur a little nod. “I do.”</p>\n<p>Arthur nods at that admission. They both know they have a conversation to be had. They both know what could be at stake. But right now they have other things to think about. Arthur looks around at the mercenaries still stuck fast in the ground, all straining against their encased legs… </p>\n<p>“Are you going to leave them like that?” </p>\n<p>“Probably best for now,” Merlin says thoughtfully. “I can unstick them when we are well on our way back to Camelot.” Then Merlin blinks and turns his gaze to Arthur hesitantly. “I mean… am I going back to Camelot?”</p>\n<p>Gwaine has moved into Arthur’s eyesight, his hand resting purposefully on the hilt of his sword; his eyes dark in warning. It takes Arthur a moment to realise what Merlin is asking but when he does he huffs and rolls his eyes. </p>\n<p>“Merlin, I have spent the past few days watching you put yourself in harms way time and again to save me… to save Camelot. I came all the way out here to save you. I gave you permission to use your magic in battle. I just said I was planning to lift the ban. What do you think?”</p>\n<p>The smile that blooms on Merlin’s face then is worth a thousand rescue missions. It is worth the worry and pain Arthur has endured over this whole ordeal. And it is worth the mountain of paperwork that awaits him if he wishes to overturn decades of puritanical legislation. </p>\n<p>Arthur doesn’t say any of that of course. Instead he sends Merlin a fond smile, rolls his eyes and slings an arm over his servant’s shoulders. It's time to go home.</p>"
}