{
  "id": "1702220",
  "url": "https://archiveofourown.org/works/1702220?view_full_work=true",
  "author": [
    "thepsychicclam"
  ],
  "title": "This Might Be Irony",
  "rating": "Mature",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Teen Wolf (TV)"
  ],
  "relationships": [
    "Derek Hale/Stiles Stilinski"
  ],
  "characters": [
    "Scott McCall",
    "Kira Yukimura",
    "Isaac Lahey",
    "Lydia Martin",
    "Erica Reyes",
    "Vernon Boyd",
    "Cora Hale",
    "Laura Hale",
    "Jennifer Blake",
    "Kali (Teen Wolf)",
    "Ennis (Teen Wolf)",
    "Allison Argent",
    "Peter Hale"
  ],
  "additional_tags": [
    "Alternate Universe - High School",
    "Baseball Player Derek",
    "Bullying",
    "Recreational Drug Use",
    "Fights",
    "Pining",
    "Alive Laura Hale",
    "Stiles has a skateboard",
    "Oblivious Derek",
    "Frottage",
    "Blow Jobs",
    "First Time",
    "Jennifer is a mean girl",
    "Ennis is a bully",
    "Artist Stiles"
  ],
  "language": "English",
  "series": "",
  "published": "2014-05-28",
  "completed": null,
  "words": "38,340",
  "chapters": "1/1",
  "comments": "264",
  "kudos": "11,498",
  "bookmarks": "3,311",
  "hits": "194,129",
  "summary": "<p>Stiles and Derek have been close friends since the Hale siblings moved in next door after their parents' death. But Derek's in the popular group, he's a star baseball player, and he dates popular Pep Squad captain Jennifer Blake. Stiles doesn't have any of that, just his skateboard and a hopeless crush on Derek (oh yeah, and his Vote Lydia Martin Prom Queen button). As prom and the baseball state championship grow closer, Stiles and Derek start rekindling their friendship.</p>\n<p>And it all begins with two white boards.</p>",
  "notes": "<p>A Sterek campaign fic for hardticket, who prompted me to write a fic based on <a href=\"https://www.youtube.com/watch?v=VuNIsY6JdUw\" rel=\"nofollow\">Taylor Swift's \"You Belong To Me\" video</a>. Which, obviously, meant that I immediately <a href=\"https://www.youtube.com/watch?v=W1ysjtcMVOc\" rel=\"nofollow\">started listening to Butch Walker's cover</a> about ten million times. </p>\n<p>Thanks to Rebekah, Beth, and Christina for cheerleading and putting up with me whining and talking about this fic for the past few months. It never would have been finished without you three &lt;3</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p><a href=\"https://thepsychicclam.tumblr.com/\" rel=\"nofollow\">tumblr</a> if you'd like to come say hi :D</p>",
  "text": "<p>Stiles drags his eyes away from <i>The Scarlet Letter</i>, three chapters of which are due tomorrow, but he thinks if he reads one more sentence about Hester Prynne his eyes are going to fall out of his head. He rubs them wearily before glancing around the room for a distraction. He finds one right outside the window.</p>\n<p>In the house next door, in the room whose window is so close Stiles can almost reach out and touch it, he sees Derek pacing back and forth. His cell phone is glued to his ear, his hand running through his hair every few moments which causes it to stand up in a state of general disarray. Stiles frowns as he watches the scene, because it reflects two things he hates:</p>\n<p>1. Derek’s stupid hair looks so cute and touchable, which does nothing to help Stiles’ hopeless crush.<br>\n2. Derek’s fighting with his horrid girlfriend, Jennifer. </p>\n<p>Okay, so maybe <i>horrid</i> is a bit of a strong word, but it’s been programmed into him over the years. It’s not Stiles’ fault that Lydia Martin and Jennifer Blake are the two most popular girls in school, and naturally, bitter rivals for everything. And when it comes to choosing sides, Stiles is one thousand and twenty seven point four percent Team Lydia. And it’s not just because Stiles was in love with Lydia until last year when he realized he was actually interested in both cocks and vaginas, which really had nothing to do with Lydia. Lydia was actually pretty great through that whole teenage existential crisis thing. </p>\n<p>Lydia may act flighty and be terrifying, but Stiles knows she’s smarter than anyone else – including himself – with a heart of gold. If she liked you. And, to be fair, Lydia didn’t like many people. But neither did Stiles, so that was another point in her book.</p>\n<p>Jennifer Blake, though? Fake, mean, manipulative, and possibly evil. Stiles is betting witch, if things like witches existed. She hates Stiles’ guts, and not just because of Lydia. Stiles thinks it has something to do with him and Derek being friends, even though it’s not something they advertise at school. </p>\n<p>Sure, Stiles and Derek were like BFFs back when the Hale siblings moved in next door with crazy Uncle Peter after Derek’s parents died in a car accident. They spent Stiles’ summer between eighth and ninth grade riding bikes and playing baseball in the nearby park. But that was right before Stiles went to high school. That fall, Stiles started his freshman year with a scraped knee and a buzz cut. Derek entered his new school as a sophomore, and the popular crowd snapped Derek up real quick. That didn’t surprise Stiles; Derek had all the makings of a jock, and had gone all the way to the other side of puberty where he had lean muscle and sported a constant five o’clock shadow. Stiles was still uncoordinated, and all puberty had given him was pimples and a near constant boner. </p>\n<p>Derek didn’t completely drop Stiles and still hung out with him sometimes, when Derek wasn’t out with his popular friends in his shiny new Camaro. And by the time Stiles had gotten his old, beat up Jeep, cleared up his acne, grown out his hair, and realized he liked boys, Jennifer Blake had snapped up Derek. </p>\n<p>That just made Stiles hate her more. Not because she dated Derek – Stiles wasn’t stupid enough to think Derek was into guys or would be into him even if he was – but because Derek deserved better than someone so self-centered. </p>\n<p>But Stiles was the one home alone every Friday night and desperately single, so maybe he shouldn’t be so hard on Derek. At least Derek was getting some. Even if it was from Jennifer.</p>\n<p>Stiles sees Derek throw his hands up and yell something into the phone. Stiles pushes himself off the bed and walks over to the window. He bends down, grabs the worn white board he keeps beneath the window, and writes in large letters, <i>EVERYTHING OKAY?</i></p>\n<p>Stiles flips it around and holds it in front of the window. After a few moments, Derek catches sight of him. He comes closer to the window and reads the words. A wide smile breaks out across his face. He disappears for a moment as he bends down, reappearing a few seconds later holding a similar white board. Stiles watches as Derek cradles his cell phone between his ear and shoulder while scribbling a response. Using one hand, he flips it around.</p>\n<p>\n<i>Fight with Jen.</i>\n</p>\n<p><i>Anything I can do?</i> </p>\n<p>Derek shakes his head, and Stiles gives him a small, encouraging smile. Then, Derek writes, <i>So tired of drama.</i></p>\n<p><i>Sorry :(,</i> Stiles writes on his board. Derek nods, then turns away from the window and resumes his pacing with tense shoulders. Stiles watches him for a few moments, sighing.</p>\n<p>“No drama here,” Stiles says quietly to himself. “A drama free zone, that’s me.” </p>\n<p>Derek laughs at something Jennifer said, and Stiles drops back onto the bed, staring at the ceiling. He knows this unrequited crush thing was getting old; maybe when Derek graduates in a few months, it would get better. </p>\n<p>Stiles still has one final year of high school to be lame and single, though. </p>\n<p>*</p>\n<p>The April sun is hot, even if a cool breeze blows around them. Stiles is bent over his sketch pad, pencil scratching across the paper in attempt to get the curl of Allison’s hair just right. </p>\n<p>“That’s almost perfect,” Lydia says from behind him, where she’s lounging across the bleachers and reading a book in between idly watching the baseball team practice. “I think her eyes are off though.”</p>\n<p>“When did you become an art critic?” Stiles asks, turning his head from side to side as he concedes that Allison’s eyes aren’t quite right. He erases them.</p>\n<p>“Don’t be so sensitive,” Lydia says. “If you ever want to become an artist, you’re going to have to develop a thicker skin.”</p>\n<p>“I don’t want to be an artist,” Stiles says as he starts carefully sketching eyes from memory. “I just like to draw.”</p>\n<p>“Heads up!” someone calls a second after the crack of a bat connecting with a ball, and Stiles looks up just in time to see the baseball land a few feet down the bleachers. “Dammit, I was aiming for Stilinski,” Jackson yells.</p>\n<p>“Your aim sucks,” Stiles yells as he gets up and climbs over bleachers to grab the baseball. “Actually, all of you sucks, Jackson.”</p>\n<p>“I don’t suck,” Jackson says, “But there are parts of me that don’t mind getting sucked.”</p>\n<p>Danny rolls his eyes as the twins high five Jackson. Stiles glances over at Lydia, who either doesn’t hear the comment or chooses to ignore it. Not for the first time, Stiles wonders just why in the hell Lydia is with Jackson. Jackson walks further down the field as Stiles jogs down the bleachers with the ball in hand. Derek’s the one who comes to the fence.</p>\n<p>“Thanks,” Derek says with an easy smile. The brim of his cap shades his face, and he’s sweaty and dirty in his practice uniform. </p>\n<p>“I don’t know why you keep him on the team,” Stiles says as he hands Derek the ball. “When you go to state, you should leave him there.”</p>\n<p>Derek laughs. “Just ignore him. That’s what we do.”</p>\n<p>“Easy for you to say. He hasn’t been tormenting you since kindergarten.”</p>\n<p>“He has a mean fastball,” Derek says with a shrug. “It’s the only reason we keep him around.” He grins and jogs back onto the field. Scott sees Stiles by the fence from third base, and he waves enthusiastically. Stiles returns the wave before going back to his seat.</p>\n<p>“When are you going to get rid of your crush?” Lydia asks. “You deserve better.”</p>\n<p>“I know,” Stiles replies as he watches Derek hunching at second base, waiting for the next batter to swing. Stiles can’t help it; he can’t resist the way Derek looks in his baseball uniform. The way those pants cling to his thighs and ass should be illegal.</p>\n<p>Stiles sketches for the next hour while the team practices. He doesn’t stop until he hears heavy footsteps bounding up the bleachers accompanied by loud voices. Stiles looks up as Allison, Kira, and Cora make their way towards them, still dressed in their softball gear with duffle bags hanging on their shoulders.</p>\n<p>“Hey,” Allison greets as she takes the space beside Stiles, and Stiles hurriedly flips the sketchpad to a fresh sheet. “What?”</p>\n<p>“Nothing,” Stiles says. “Nothing to see here.”</p>\n<p>Allison smirks and says, “Whatever you say, Stiles.”</p>\n<p>“Don’t ruin the surprise of your graduation present, Allison. Enjoy the anticipation!” Stiles says. “How was practice?”</p>\n<p>“Harris is a slave-driver,” Cora complains, falling back against Stiles and resting her head on his thigh. She looks up at him. “He’s going to kill us.”</p>\n<p>“It’s not that bad,” Kira says. “We’ve never made it to regionals before. He’s a good coach.”</p>\n<p>“Too bad we lost,” Cora snipes. “Which doesn’t even save us from practice.”</p>\n<p>“We’ve still got that invitational,” Allison states.</p>\n<p>“Coach is just making sure we’re ready! Those teams are good. We’re lucky to have been invited,” Kira says.</p>\n<p>“Shut up,” Cora groans. “He doesn’t ride your ass like mine.” Stiles smiles as he listens to Cora and Kira argue about their coach, and Lydia and Allison talk softly behind him.</p>\n<p>Stiles is idly sketching Cora lying on him and Kira eating a granola bar beside her when he hears Lydia make an unpleasant sound behind him. He looks up to see the Pep Squad striding out onto the field, led by Jennifer.</p>\n<p>“I didn’t know <i>she</i> was going to be here,” Lydia says. “I thought I’d be spared her repugnant face today.” Jennifer and the rest of the team spend the next fifteen minutes practicing a new set up for the upcoming state championship, and Lydia mutters insults under her breath. </p>\n<p>When Derek comes to bat, Stiles, Cora, and Kira start clapping and yelling excitedly. Derek turns their way and squints into the sun, giving them a wave and a grin when he spots them.</p>\n<p>“Come on, Derek!” Stiles yells.</p>\n<p>“Go bro!” Cora screams. </p>\n<p>“You can do it!” Kira adds.</p>\n<p>As if on cue, Jennifer leads the Pep Squad into a cheer. Derek waves to her, and she blows him a kiss. Stiles rolls his eyes. When Derek swings, he hits the ball deep into the outfield, and then it sails over the fence. Stiles, Cora, and Kira jump to their feet, and even Allison and Lydia stand. They clap and make too much noise, and Derek turns and laughs at them. </p>\n<p>Then, Jennifer runs across the field and jumps into Derek’s arms and kisses him. Cora pretends to barf beside Stiles, and Stiles has to appreciate her. She probably hates Jennifer more than Stiles.</p>\n<p>*</p>\n<p>Stiles works three afternoons and Saturday mornings at the local record shop, Revolution, though everyone just calls it The Rev for short. He lucked into the job two years ago when Derek’s older sister Laura, who used to have Stiles’ job, graduated and convinced the owner to hire Stiles in her place. Stiles loves Laura, he really does.</p>\n<p>Stiles walks into the store and stuffs his hoodie into his bag, leaving him in his vintage The Cars t-shirt that the owner gave him. “If I see you in that fake Target music tee bullshit again, you’re fired,” he’d told Stiles as he shoved the t-shirt in Stiles’ hands, and Stiles had just nodded mutely. He really didn’t think anyone would care that much about a Beatles shirt gotten for $2 on the Target clearance rack, but apparently, some people cared very much.</p>\n<p>“Hey,” Stiles greets Erica and Isaac as he slides in behind the counter. They’re both college students at the local community college, and pretty much attached at the hip. They’ve sorta taken Stiles under their wing, which means they make fun of him and make him do all the shit jobs they don’t want to do.</p>\n<p>“You’re gonna love the new tracks I found this morning,” Erica says, hooking up her iPod. “The podcast my favorite blog runs was, ugh, I can’t even describe it.” Erica hits play as Isaac drags Stiles over to the boxes of new merchandise to start processing.</p>\n<p>Later, Erica is painting her nails and Isaac is playing an old Bush track on his guitar while Stiles trolls the music on Isaac’s laptop. “What are you doing?” Isaac asks after Stiles listens to the fifth random song in a row.</p>\n<p>“Making a mix CD,” Stiles says. </p>\n<p>“For Derek?” Isaac asks with a knowing smirk.</p>\n<p>Stiles feels his cheeks color. “Yeah.”</p>\n<p>“Any luck in that department?” Isaac asks, switching to a song that sounds suspiciously like the Beach Boys. </p>\n<p>“Dude, I’ve told you, it’s not like that. He’s got a girlfriend.”</p>\n<p>“Hasn’t stopped you yet,” Isaac says, strumming a few more chords. </p>\n<p>“If you want him, go for it,” Erica says, smacking her gum. “Girlfriends and boyfriends are ephemeral anyway. It doesn’t pay to get too attached. Life’s too short to get too wrapped up in relationships.”</p>\n<p>“You sound like some fucking hipster blog,” Stiles says, “Which honestly, just about sums you up.”</p>\n<p>“Don’t be bitter because you’re a teenage loser and I’m just naturally awesome.”</p>\n<p>Stiles rolls his eyes and goes back to iTunes.</p>\n<p>“You’ve been making him mix CDs as long as I’ve known you,” Isaac says.</p>\n<p>“And he makes me mixed CDs, too,” Stiles snaps. “It’s not like I’m just some pathetic asshole slipping love notes into his locker. He gave me a CD a month ago; it’s time I returned the favor.” Isaac makes a humming noise. “Fuck off, Isaac.”</p>\n<p>“Touchy.” Isaac stares at Stiles thoughtfully as he plays the melody of “Don’t Worry Baby.” </p>\n<p>First Lydia, now Isaac. Really, Stiles doesn’t know why everyone is suddenly so interested in his crush. His friendship with Derek is…well, it’s them. It’s always been like this.</p>\n<p>When Derek moved in next door to Stiles, he was a grumpy, sullen asshole. But, he’d just lost his parents to a car crash, so Stiles forgave a lot that summer. The first few weeks, Derek just growled and glared when Stiles came by to see if he wanted to do something, like ride their bikes into town to grab ice cream or to the park for some baseball because his dad had told him Peter said Derek liked baseball. Maybe Stiles shouldn’t have bothered the new kid with the dead parents so much, but Stiles knew what it was like to lose at least one parent; he was honestly just trying to help.</p>\n<p>Derek had barely looked at him until Stiles invited Derek to see a Dodgers game with him and his dad. Scott was supposed to go, but his dad had suddenly shown up, so Scott had to go spend the week in San Francisco with his douchebag dad, and Stiles had an extra Giants ticket. Derek looked reluctant, but Stiles had said, “It’s the Giants vs. the Dodgers. Dude, you can’t miss that! My dad said that your uncle said that the Dodgers were your <i>favorite</i>. And look, row four on the first base line. The sheriff’s department doesn’t play with their season pass tickets.” Stiles had waved the ticket in front of Derek’s eyes, and finally, Derek caved.</p>\n<p>He’d been silent in the backseat while Stiles and the sheriff tried to talk to him, but when they’d gotten to the field…man, Derek just <i>lit up</i>. Stiles had to stop himself from staring because Derek was like a totally different person, his face open and awed and <i>smiling.</i> Stiles thought in that moment that Derek should always smile, and he made it his personal mission to make sure that happened.</p>\n<p>After that, Derek agreed to go to the park and into town on bicycles with Stiles. Stiles invited Derek’s sisters, Cora and Laura, too. Even though Cora was the same age as Stiles, she was just angry and slammed doors and beat up neighborhood kids, while Laura, who was two years older than Derek, was awkward and stayed inside with a book and headphones on her head. </p>\n<p>So, for three months, it was just Stiles and Derek, and by the end of the summer, they were as close, if not closer, than him and Scott (mainly due to the fact that Scott had met one, Allison Argent, and had been lovesick all summer over the new girl in town. Well, that and the fact that he spent half the summer in San Francisco with his dad).</p>\n<p>In school they ran in completely different circles. Derek was the “popular group,” and Stiles was not. Stiles’ group started out with just him and Scott, but over the years it expanded to include Allison, Cora, and Kira. Lydia, for some reason, hung out with them sometimes even though she was also in the “popular group.” Sure, Derek waved to Stiles and smiled when they passed in the halls, but most people didn’t even realize they knew each other. Stiles was okay with this.</p>\n<p>Mainly because some weekends, Stiles and Derek still played baseball in the park, and sometimes at night they held conversations via white boards from their bedroom windows. And whenever Peter was being creepy (which was more often than not), Derek came over to Stiles’ house for dinner.</p>\n<p>Too bad most of that stopped when Derek got a girlfriend. </p>\n<p>Stiles sighs. He shouldn’t be surprised, really, because the same thing happened when Scott got a girlfriend. But the difference was that Allison got added to the Scott-and-Stiles show, whereas Derek just stayed Jennifer’s Boyfriend.</p>\n<p>After Stiles burns the CD, he takes the sharpies littering the counter and decorates the CD. He writes across the top <i> Stiles’ must-hear mix for Derek</i>.</p>\n<p>*</p>\n<p>Stiles doesn’t get home until after nine because Isaac makes him close, so he’s toeing off his shoes when he glances out of the window and sees Derek standing there with a whiteboard. Stiles gives him a small wave and steps closer to the window.</p>\n<p>\n<i>You’re home late.</i>\n</p>\n<p>Stiles smiles and grabs his own whiteboard to scribble a response. <i>Work. What’s up?</i> Stiles flips it around, and watches as Derek reads, his brows furrowing.</p>\n<p>\n<i>Nothing’s up. Why?</i>\n</p>\n<p>\n<i>We just haven’t done this much lately. Thought something might be wrong.</i>\n</p>\n<p>\n<i>Nothing wrong. Just saw your light, thought I’d say hi.</i>\n</p>\n<p>Stiles looks up then, at Derek standing in his window wearing a t-shirt and gym shorts, and suddenly missed this, missed Derek. Missed their easy friendship. Stiles smiles and writes, <i>I’m glad you did. How was your day?</i></p>\n<p>\n<i>Good. Hit another homer off Jackson. He was pissed, but Coach was ecstatic.</i>\n</p>\n<p>\n<i>AWESOME!!! :)</i>\n</p>\n<p>\n<i>How was work?</i>\n</p>\n<p><i>Fine. Erica let me listen to a new playlist, and I used Isaac’s laptop to burn you a new mix.</i> Stiles disappears for a moment then holds up the slim case. </p>\n<p>Derek grins and writes, <i>Really? Bring it over! We can listen to it for a bit.</i></p>\n<p>Stiles drops the whiteboard to the floor, grabs the CD, stuffs his feet back into his sneakers, and hurries next door. He knocks, and is greeted by Derek’s Uncle Peter. Who is wearing a white satin kimono.</p>\n<p>“Stiles!” Peter exclaims, wide grin on his face. Stiles knows logically Peter isn’t an <i>actual</i> creeper, but every time he sees Peter, he just gets creeper vibes. The man is…just weird. “I didn’t know you’d be visiting us tonight. Are you here for Derek or Cora?”</p>\n<p>Derek luckily jogs down the stairs at that moment. “Uncle Peter, he’s here to see me. I hope it’s okay he’s coming over so late?”</p>\n<p>Peter smiles at Derek and shakes his head. “Of course, Stiles is always welcome in our home. I’ll leave you two boys to it then.” Peter disappears into another room, leaving Stiles staring after him. </p>\n<p>“Come on,” Derek says, leading the way back upstairs. When they’re inside his room, Derek closes the door behind them. “Sorry about Peter for his…Peter-ness.”</p>\n<p>“Don’t worry about it,” Stiles says, flopping back onto Derek’s bed. “Honestly, nothing Peter does surprises me anymore, especially after the time he spent that month at the nudist colony. Though, I wasn’t expecting a kimono.”</p>\n<p>Derek rolls his eyes. “It’s some new thing he’s into. He’s dating this woman, and they’re trying to get balanced and do yoga and drink herbs or something. I don’t know. I just roll my eyes and ignore Peter most of the time.”</p>\n<p>“Probably a good plan.” Stiles grins and Derek sits on his desk chair. Stiles hands Derek the CD. “New mix for you. Way over due. You gave me yours like a month ago.”</p>\n<p>“No worries,” Derek smiles as he places the CD into his computer. “You’re just making sure you have great songs for me!”</p>\n<p>“Yeah, that’s it,” Stiles laughs. Stiles settles more comfortably on the bed as Derek pushes play. They spend a few minutes just listening to the song, Derek grabbing a baseball sitting on his desk and idly tossing it up into the air.</p>\n<p>“This CD is good,” Derek says a few minutes later, eyes trained on the ball.</p>\n<p>“You’ve only heard two songs.”</p>\n<p>“Two great songs.”</p>\n<p>Stiles shakes his head as he rolls his eyes. “You like anything.” </p>\n<p>Derek shrugs, not arguing. “Are you excited for prom?” he asks. “Got a date yet?”</p>\n<p>Stiles laughs, he all out genuinely laughs at the ludicrous question. Derek grips the ball in his fist after he catches it and straightens in the desk chair to look at Stiles. “That’s hilarious, Derek. Grade A quality comedy right there.”</p>\n<p>“What? It’s a legitimate question.”</p>\n<p>Stiles picks at the comforter. “You know I don’t have a prom date.”</p>\n<p>“Really?”</p>\n<p>Stiles cuts his eyes to Derek. “What world are you living in that I would have a prom date?”</p>\n<p>“But why wouldn’t you have a prom date?” Derek asks, and Stiles realizes he’s absolutely <i>serious</i>. Derek legitimately thinks Stiles should have a prom date.</p>\n<p>“Dude, what guy is going to like me?”</p>\n<p>Derek’s brow furrows as he scowls. “You’re an idiot,” he says. “Any guy who doesn’t want you is an even bigger idiot.”</p>\n<p>“Well, Beacon Hills is just full of eligible gay dudes for me to ask,” Stiles drawls. “Let’s see, there’s Danny and Ethan who, oh wait!, <i>are dating each other</i>. The only other guy remotely bisexual is Jared, and just, no. Not my type,” Stiles finishes, shaking his head adamantly.</p>\n<p>“Maybe Danny can set you up with someone,” Derek suggests helpfully. Stiles rolls his eyes. “Or maybe you can take Cora.”</p>\n<p>“Cora would break my arm just for asking.”</p>\n<p> “I just want you to be happy, Stiles.”</p>\n<p>Stiles huffs and pushes himself into a sitting position. “See, all you popular people are under the misconception that everyone needs to be <i>dating</i> to be happy. I’m perfectly happy, you know. Yeah, I get lonely sometimes, and I’d really like someone to play with my dingdong, but I don’t need a boyfriend to be happy. I have Scott, who’s the absolute best, and then the girls, which includes Lydia for some crazy reason. My theory is that Lydia only talks to me because all the rest of my friends are on the baseball or softball team, which makes them quasi-popular, and I’m just that annoying non-popular hanger-on who she puts up with so she doesn’t have to sit alone at practice while she waits on Jackson. Plus I dote on her, so she likes that, too.” Stiles takes a breath and looks at Derek seriously. “And I also have you.”</p>\n<p>Derek smiles, and that makes Stiles’ night.</p>\n<p>*</p>\n<p>Stiles is at work, alphabetizing the rockabilly section, when he hears the doorbell jingle. He’s surprised when he sees Derek and Boyd striding inside, wearing letterman jackets despite the warm day.</p>\n<p>“Hey,” Stiles greets. Derek smiles and approaches him, while Boyd steps nonchalantly towards a display as his eyes dart around the store. “Is he here to see Erica?”</p>\n<p>“Yep,” Derek says. They stand side by side as they watch Boyd drift closer and closer to the register, where Erica is flipping through a magazine and popping bubbles with her gum. “He’s been raving about her.”</p>\n<p>“Has he really?” Stiles asks, turning towards Derek as Boyd finally makes it to the counter.</p>\n<p>“Well, he’s mentioned her twice this week, and for him, that’s raving.” Derek glances at the records Stiles has in his hand. “What are you doing?”</p>\n<p>“Oh,” Stiles says, shoving them back into the rack. “Wasting time. These are the boring records. I can show you good records if you want to see good records.”</p>\n<p>Stiles and Derek are sitting on the floor looking through a new donation of vintage records when Derek says, “I have some good news.” Stiles glances up from where he’s already started separating and organizing the albums. “I’ve been talking to a few college recruiters.”</p>\n<p>“From where?”</p>\n<p>“One from UC Irvine, one from a Midwest school, and another from the east coast. They’re coming to watch me play in the state championship.”</p>\n<p>“Cool.”</p>\n<p> “If they like what they see, they might offer me a scholarship to play ball in college.”</p>\n<p>Stiles’ mouth drops open. “Derek, that’s amazing!” He slaps Derek on the shoulder. “Dude! That’s been your dream for, like, ever!”</p>\n<p>“I know,” Derek says, blushing and looking at his hands. “I haven’t told anyone about the recruiters yet.”</p>\n<p>“Wait, what?” Stiles asks. “Not even your sisters?” Derek shakes his head. “Why?”</p>\n<p>“Stiles, you were the first person I wanted to tell,” Derek says, looking at Stiles seriously. “The other schools called earlier this week, but UC Irvine called last night. I would have called you then, but your light was already off and I didn’t want to wake you.”</p>\n<p>“You wanted to tell me?” Stiles still can’t wrap his mind around it, that Derek hadn’t wanted to tell his girlfriend, or Boyd, or even his sisters, but <i>him</i>.</p>\n<p>Derek rolls his eyes. “Duh, you idiot. You’ve always been my biggest supporter with baseball, spending hours in the park practicing with me and encouraging me when I almost gave up. You’re probably the only reason anyone’s interested in me.”</p>\n<p>“I think your natural talent has something to do with it,” Stiles says, but his brain is reeling. Derek wanted to tell him, and Derek thought that about him. It’s true, Stiles had spent hours helping Derek practice. Stiles loves baseball almost as much as Derek, he just has no natural affinity for sports. But Derek hadn’t minded when Stiles tagged along and helped him play baseball, let the annoying uncoordinated kid practice alongside him. Stiles never knew he was actually helping Derek, or that Derek appreciated it or even noticed.</p>\n<p>“Still,” Derek says with a small smile. “I’m hoping that the guy from UC Irvine likes what he sees. That’s where I want to go.”</p>\n<p>“Why there? Is their team better?” Stiles asks.</p>\n<p>“All the teams are good,” Derek states, “but…I don’t want to leave my sisters, you know? After everything that’s happened, it just wouldn’t feel right being more than a few hours away.”</p>\n<p>“Makes sense,” Stiles says. “I have to say that selfishly, my vote is with the California school.”</p>\n<p>“Good to know I have your approval,” Derek jokes, pushing Stiles playfully. “Don’t tell anyone, not even Cora. I don’t want to jinx it, but I had to tell you.”</p>\n<p>“I swear,” Stiles promises.</p>\n<p>Long after Derek leaves, having to basically drag Boyd away from Erica, Stiles thinks about what Derek just told him. Even after the last few years, Derek and Stiles are still just as close, and Stiles thinks that, in the long run, being Derek’s best friend is enough.</p>\n<p>*</p>\n<p>“How did we get this shit duty?” Stiles asks Scott as he tapes another poster with Lydia’s smiling face onto a spot of blank wall. It’s after school, and somehow Lydia had convinced the two of them to hang her prom queen campaign posters for her. “We both know how I got roped into this,” Stiles says, because really, Lydia glaring at him while shoving a stack of posters into his arms and pointing to the wall was enough to get Stiles flailing in terror, “but how did she con you?”</p>\n<p>“Allison asked if I’d help out Lydia because she’s so stressed,” Scott explains as he staples a poster to a bulletin board.</p>\n<p>“Oh, <i>Allison</i> asked,” Stiles mocks, and Scott shoves him.</p>\n<p>“Shut up,” Scott mumbles. Stiles snickers. “Jackson said he got the party bus lined up for prom,” he explains as they turn and walk down a different hall. “You in, man?”</p>\n<p>“Ugh, why is everyone obsessed with prom?” Stiles groans dramatically.</p>\n<p>“Huh? Dude, it’s in a couple of weeks. It’s all Allison’s been talking about. She keeps showing me pictures of all these dresses and asking me which I like better,” Scott says with a sigh. “She’d look great in any of them, but she doesn’t think that’s an answer.”</p>\n<p>“I’m taking the Jeep,” Stiles says.</p>\n<p>“Stiles, you <i>have</i> to come in the party bus with us! There’s plenty of room, and like, <i>everyone</i> is gonna be there, the baseball team, Allison, and even Kira because she’s going with Greenburg, and Danny and Ethan, Derek…”</p>\n<p>“Hold up,” Stiles spins about, his arms flailing. “You mean to tell me that Lydia and Jennifer are going to be on the same bus, bitter rivals for prom queen?” Scott nods with a grin. “Yeah, cause <i>that</i> won’t be a disaster or anything.”</p>\n<p>“Derek’s part of the baseball team, of course he’s coming with us.”</p>\n<p>“Ten bucks, Jennifer charters her <i>own</i> limo with all her friends, and Derek ends up with her, Kali, Ennis, and even Aiden. Boyd might go with them, too, because where Derek is, Boyd is,” Stiles says. “Jennifer and Lydia will not ride in the same limo, I guarantee it.”</p>\n<p>Scott shrugs. “I don’t care. That’s all stupid girl stuff, like why does it matter who’s crowned prom queen? Everyone knows they’re the most popular.”</p>\n<p>Stiles shakes his head. “It’s a good thing Allison loves you and she’s not concerned with that kind of thing.”</p>\n<p>Scott gets that dopey grin on his face. “Yeah, that’s why Allison is the best.”</p>\n<p>“Those signs should be illegal,” Stiles hears from behind him. He turns around to see Kali walking down the hall, Ennis’ arm slung around her shoulders. Kali is dressed in her Pep Squad outfit, and Ennis in his baseball uniform. “No one wants to see Martin’s ugly face staring at them all day.”</p>\n<p>“Don’t be bitter because everyone knows Lydia’s gonna win,” Stiles says as he tapes up two posters side by side. “You don’t see Lydia going around fretting.”</p>\n<p>“Don’t talk to my girl like that, loser, or I’ll pummel you into the ground,” Ennis barks out.</p>\n<p>Stiles rolls his eyes as he walks further down the hall. “I’m shaking, really.”</p>\n<p>“You should be, Stalonzy,” Ennis shouts.</p>\n<p>“If I see Stalonzy, I’ll tell him to be terrified,” Stiles shouts as he rounds a corner.</p>\n<p>“You’re gonna get your ass kicked,” Scott points out. “Ennis won’t think twice about it.”</p>\n<p>Stiles shrugs. “He’s looking for Stalonzy, not Stilinski,” he jokes. “I’m safe.” Scott rolls his eyes and hangs another poster.</p>\n<p>*</p>\n<p>Stiles doesn’t always take his Jeep everywhere. The thing is great, god he loves her, but she’s a gas guzzler and sometimes Stiles likes to use his miniscule paychecks for things <i>other</i> than filling up the Jeep’s tank. So, he takes his skateboard just about everywhere. It’s about the only thing remotely sporty that Stiles doesn’t suck at.</p>\n<p>Friday night, Stiles skateboards into town and meets Erica and Isaac at the one dive bar that serves as a music venue. There’s some indie band playing that Stiles has never heard of, and Erica got them tickets. It’s an 18+ show, but the guy doesn’t even glance at Stiles when he catches sight of Erica and her low-cut top.</p>\n<p>“You’re welcome,” she breathes into Stiles’ ear as they enter. Stiles huffs out a laugh.</p>\n<p>Stiles feels kind of like a tool, standing in the middle of this bar holding a skateboard. However, most people are standing in pockets, involved in Really Important Conversations, while drinking or passing a joint between them, so Stiles thinks that no one is actually paying attention to him and his skateboard anyway.</p>\n<p>The opening band is surprisingly good. Stiles finds himself nodding along, and after their set, he goes and buys their CD. Isaac steals a table when a group of people go to the bathroom, so Stiles climbs onto one of the ridiculously tall stools and reads the liner notes on his new CD while he waits on the next band.</p>\n<p>“Boo.” Stiles jumps, and the CD case clatters across the table. Someone laughs to his right, and Stiles looks over to see Derek smirking. </p>\n<p>“You’re a fucking asshole,” Stiles snaps, embarrassed as he grabs his CD. “What are you even doing here?”</p>\n<p>Derek points to Boyd, who is now walking with Erica towards the outside waiting area. “He wanted a wingman.”</p>\n<p>“I thought you only used wingmen when you were trying to pick up chicks,” Stiles says. “I’m pretty sure Boyd’s already got Erica.”</p>\n<p>Derek shrugs. “He paid for my ticket, so free music.”</p>\n<p>“Where’s Jennifer?”</p>\n<p>Derek gives Stiles a scoffing laugh. “She said she wasn’t setting foot in this disgusting place.”</p>\n<p>“Oh, that’s too bad,” Stiles says sarcastically, and Derek frowns.</p>\n<p>“I don’t understand why you don’t like her. She’s great when you get to know her.”</p>\n<p>“I’ll take your word for it.” Derek’s frown deepens, and Stiles says, “I love this place. I’ve been sneaking into shows since I was 15.”</p>\n<p>“If I recall, you dragged me along into some of those shows,” Derek laughs. “I will never forget the time we got caught and they called your dad.”</p>\n<p>“Ohmigod,” Stiles groans, dropping his head onto the table. “That was awful. I was grounded for two weeks, and Peter didn’t do <i>anything</i> to you. He just laughed and said he was proud.”</p>\n<p>“That’s Peter for you.” Derek’s hand moves closer to Stiles’ face, and he picks up the CD and studies it. “New music for my CDs?”</p>\n<p>“Maybe,” Stiles grins from where his head’s still resting on the table. Derek grins back, and they kinda stay like that for a moment, just looking at each other and staring until Isaac clears his throat. Stiles shoots up and almost falls off his stool. He’d forgotten Isaac was even sitting there. “Derek, you remember Isaac,” Stiles says quickly, looking between the two of them. Isaac’s giving him a knowing look, and Stiles flicks him off.</p>\n<p>“Hey Derek, nice to see you again,” Isaac says. “Glad you could join us. Stiles talks about you all the time.”</p>\n<p>“He does?” Derek asks, looking at Stiles with a confused smile.</p>\n<p>Stiles feels his cheeks heat, and he shakes his head back and forth quickly. “I most certainly do not. Nope. Not more than I talk about everyone else, I probably talk about Scott the most, until the point that Isaac’s sick of hearing about him.”</p>\n<p>“No, I think you talk about Derek more,” Isaac says, just like the asshole he is.</p>\n<p>“That’s kinda awesome,” Derek says good-naturedly. “I hope it’s all good, though. Don’t want Stiles spreading vicious lies about me.”</p>\n<p>“Oh believe me, it’s good,” Isaac says, and Stiles really just wants to die right there on the spot.</p>\n<p>Stiles is thankfully saved by the house lights dimming, and he tries to nonchalantly kick Isaac under the table. He just ends up kicking the stool instead.</p>\n<p>The band is…awful, is a nice way of putting it. After two songs, Stiles is pretty sure his ears are bleeding. Derek doesn’t look like he feels any differently about the band, so Stiles leans over and yells, “Wanna get out of here?”</p>\n<p>Derek nods gratefully, and Stiles grabs his skateboard, punches Isaac in the arm, and walks out of the bar. Outside, the night air is cool, but it’s blissfully noise free.</p>\n<p>“That was horrid,” Stiles says, fingers in both of his ears in an attempt to stop the ringing. </p>\n<p>Derek’s on his phone, typing out a text. “I’m telling Boyd I’ll be out here when he’s ready. I gave him a ride.”</p>\n<p>“Cool.” Stiles steps onto the deserted street and drops his skateboard. He rolls down a few feet, then jumps into an intricate trick.</p>\n<p>“You don’t have to stick around,” Derek says from where he’s following behind him slowly. “I can find somewhere to hang out until Boyd’s done.”</p>\n<p>“It’s no problem,” Stiles says. “We haven’t hung out in awhile. Are you hungry? We can go grab some food or something.”</p>\n<p>“Yeah, that sounds cool.” </p>\n<p>Stiles slows until he rolling beside Derek as they turn the corner and go a block to the late night hamburger joint. They go inside, and Stiles glances at the huge burger brought to the table nearby. “Dude, I’m not <i>that</i> hungry.”</p>\n<p>“We can share,” Derek replies easily. </p>\n<p>“Really?”</p>\n<p>“Why not? I’ve already had dinner; I don’t need a huge burger on top of that.”</p>\n<p>They order a bacon cheeseburger and a large order of fries. Stiles feels a bit indulgent even as he glances at his half of burger. “This is bigger than my head.”</p>\n<p>“It’s not that big,” Derek says, taking a bite, seemingly unaffected by the monstrosity before them. “I’ve seen bigger.”</p>\n<p>Stiles is about to reply when he sees the corner of Derek’s eyes crinkle, and then he tosses a sugar packet at his head. “You’re such a jerk. I’ve seen bigger. Such a dork.”</p>\n<p>Derek’s laughing, and Stiles tries to resist, but Derek’s laugh is infectious. “This is the best burger I’ve ever tasted.”</p>\n<p>Stiles swallows and nods his head. “I definitely agree. These fries are pretty fantastic, too.”</p>\n<p>Derek grabs a handful and shoves them into his mouth, ends of the fries just sticking out of his mouth. “They’re great,” Derek mumbles through his food.</p>\n<p>“Charming. I can see why you’re so popular,” Stiles jokes, and Derek finishes eating and swallows. </p>\n<p>“That bothers you, doesn’t it?” Derek asks. “That I’m popular and you’re not.”</p>\n<p>“No.” Derek raises an eyebrow, and Stiles sighs. “It’s not that I care you’re popular,” he begins. “Like, I’m totally happy for your high school success. I’m not even that sad I’m not popular, if truth be told. Like I told you the other night, I’m happy. It’s just…” Stiles chews on his lip as he pushes fries around on the plate between them. “The people you hang out with aren’t very nice, you know? I mean, they basically hate my guts. And sometimes, I just…I’m sad that we don’t hang out more,” Stiles admits, lifting his eyes and meeting Derek’s. </p>\n<p>“I miss you, too,” Derek says sincerely, and Stiles feels his heart skip. “It’s just, you have your friends and I have my friends. I like McCall and stuff, but,” Derek shrugs. “High school kinda blows, you know?”</p>\n<p>Stiles snorts. “Preaching to the choir, dude.”</p>\n<p>“I know my friends are assholes,” Derek concedes. “Boyd’s great – “</p>\n<p>“Yeah, totally dig Boyd,” Stiles agrees, nodding his head.</p>\n<p>“But like Ennis, Aiden, Jackson? I know they’re jerks. But,” Derek shrugs. “What can I do? I’ve told them to leave you and McCall alone, which they’ve mostly listened to.”</p>\n<p>“Thanks,” Stiles bites out. It’s not directed towards Derek, it just kinda stings to know Derek had to take up for him. </p>\n<p>“Even Jennifer is…” Derek hesitates, choosing his words carefully. “She’s great, she really is,” he finally says, and when Stiles makes a face, Derek rolls his eyes. “I know you don’t see it, but she really is a wonderful girl. And fun, and beautiful, and smart. I know she can be catty, but…it’s high school, right?” Derek shrugs, and idly swirls his straw in his milkshake. “We’ve been fighting more,” he states quietly. “No one really knows, except Boyd and Kali, but…I don’t know. She says I don’t pay enough attention to her, that I’m way too obsessed with baseball, that we can’t go five minutes without me talking about baseball or something. And I’ve had to cancel dates with her because my grades are slipping because I’ve been focusing so much on baseball, but Stiles, it’s like, my life. There’s nothing I love more in this world than baseball, and Coach thinks I can go pro, and if I get these scholarships…” Derek looks up at Stiles, and there’s pain and frustration written across his face. “It’s my life, Stiles. I might actually make this happen, and she doesn’t even seem to care.”</p>\n<p>Stiles has to bite his tongue. There are so many things he <i>wants</i> to say. But the look on Derek’s face stops him. Derek deserves so much more than this.</p>\n<p>“I care,” Stiles says lamely, his voice barely a whisper. “I know how much this means to you.”</p>\n<p>Derek watches him a moment, then says, “I know you do.”</p>\n<p>They eat in silence for a few minutes, and then because Stiles can’t stand silence he says, “I’m sorry that you’re fighting with Jennifer.”</p>\n<p>“I thought you didn’t like her.”</p>\n<p>“I dislike you being unhappy more,” Stiles replies simply. The look on Derek’s face is unreadable, but before Stiles can try to figure it out, it’s gone and Derek is slurping the rest of his milkshake.</p>\n<p>When the waitress brings the check, Stiles reaches into his pants pocket to dig out his money, but Derek snatches the bill and pulls out a debit card. “My treat.”</p>\n<p>“Dude, seriously, I can pay for my half,” Stiles says, slapping a wad of cash on the table. </p>\n<p>Derek frowns. “Keep your money. Peter just puts money into our accounts, so I have plenty. I know you make shit at that job. The only reason Laura kept working there was because she liked being around the music all day.”</p>\n<p>“Are you sure?” Stiles asks.</p>\n<p>Derek waves him off, climbs out of the booth, and goes to the register to pay. Stiles feels something warm spreading through his chest. There’s something comforting about the ease with which they fall back into their usual routine, the easy way they walk down the street together, talking of nothing. But it makes Stiles yearn for things he can never have, so he shoves all that deep down inside and enjoys the sound of making Derek laugh.</p>\n<p>“You should give it a go,” Stiles says as they hang around on the side street near the bar. He slides the skateboard over to Derek with his foot. “You used to be pretty good.”</p>\n<p>“I haven’t been on a skateboard in like two years.”</p>\n<p>“Chicken.” </p>\n<p>“You did not just call me chicken.”</p>\n<p>“Oh, I think I did.” Stiles smirks and crosses his arms over his chest. “Too good for skateboards, I see how it is. Or maybe you’re just afraid of falling on your ass.”</p>\n<p>“Such a dick,” Derek mutters as he gets on the skateboard. He’s a little unsteady on his feet, but he pushes off and rolls past Stiles. He smirks and then flicks Stiles off…which upsets his balance. Derek’s arms windmill around, and Stiles watches as the skateboard shoots one way and Derek falls backward.</p>\n<p>“Derek!” Stiles yells, running over to where Derek’s splayed on his back on the pavement, and drops to his knees. “Derek! Can you hear me? Oh god, I’ve killed you. You’re dead. Derek!”</p>\n<p>“I fell,” Derek groans, “I didn’t break my ears. I’m not fucking deaf.”</p>\n<p>“Are you hurt?” Stiles asks, his hands hovering back and forth over Derek’s body, unsure what to do. “If you’ve like broken your back, I’m pretty sure you’re not supposed to move – OH GOD, YOU’RE MOVING!”</p>\n<p>“Still not deaf,” Derek says as he pushes himself into a sitting position. He rubs his shoulder and then his butt gingerly. “Fuck you. This is your fault.”</p>\n<p>“How is this my fault?” Stiles exclaims. “You’re the idiot who fell!”</p>\n<p>“I’m such an idiot,” Derek grunts as he pushes himself to his feet. “If I’d broken anything, I wouldn’t be able to play in the championship.”</p>\n<p>“Fuck,” Stiles exclaims, jumping to his feet. “I’m such a fucking unsupportive, insensitive idiot!” He stalks over to his skateboard. “Leave it up to me to ruin your chances at achieving your fucking dream with something as idiotic and juvenile as a skateboard accident.” Stiles yanks the skateboard off the ground, rights it, and starts rolling away.</p>\n<p>“Stiles, wait!” he hears from behind him, but he’s just <i>angry</i> at himself because he was supposed to think about this, he was supposed to be the one who always supported Derek. It’d been that way since he’d moved in next door to him. “Stiles!”</p>\n<p>Derek runs up beside him, and then runs up ahead. He spins around and starts jogging backwards. “Stop.” Stiles complies, but looks at the cracked asphalt instead of Derek. “Why are you upset?”</p>\n<p>“Better question is why aren’t you?”</p>\n<p>“Why would I be upset?” </p>\n<p>“Because I almost ruined your chances.”</p>\n<p>“Stiles, look at me.” He refuses, and Derek grabs his arm. “Hey, seriously, look at me.” Stiles lifts his eyes and Derek’s looking at him, and he’s miraculously not angry. “I’m fine. It wasn’t even that big of a deal, and I got on the skateboard fully aware of the risks. It’s not your fault.”</p>\n<p>Stiles frowns. “If you would’ve – “</p>\n<p>“Yeah, but I didn’t,” Derek says. “You don’t have to roll away, unless you want to.” Derek pauses and shuffles his feet awkwardly. “I’m actually having fun, and I’d like it if you continued to hang around until Boyd comes out.”</p>\n<p>“Really? You’re not tired of me yet?” Stiles asks.</p>\n<p>“I never get tired of you.” Derek smiles, and Stiles finds himself grinning despite the worry he feels.</p>\n<p>Stiles rolls back to their previous spot, and idly does tricks as he and Derek talk. “How’s your back?” Stiles asks after awhile.</p>\n<p>“It’s fine. I’m more embarrassed than anything. The only thing that’s bruised is my ego.”</p>\n<p>Stiles snorts and jumps off his skateboard and drops onto the low concrete wall beside Derek. “I think you could use a bruised ego once in awhile.” Derek shoves him.</p>\n<p>“Are you cold?” Derek asks when Stiles shivers. He’s playing Candy Crush on his phone, and now that he’s sitting here instead of riding his board, the cold night is starting to get to him. He shrugs. </p>\n<p>“It’s not that bad.” But his answer is accompanied by another shiver.</p>\n<p>“Here,” Derek says, shrugging out of his Letterman jacket and handing it to Stiles. </p>\n<p>Stiles looks at it, mouth agape. “No,” he finally says. “Seriously, it’s fine.”</p>\n<p>Derek rolls his eyes and pushes the jacket into Stiles’ hands. “Take it. You’re shivering; there are goose pimples all over your arms.”</p>\n<p>“But won’t you get cold?” Stiles asks stupidly. Derek shakes his head, and presses the jacket against Stiles again. Stiles can only resist so long. He takes the jacket and pulls it on. It’s still filled with the warmth from Derek’s body, and this time Stiles shivers from the shock of it against his cold skin. </p>\n<p>“See? Knew you were cold,” Derek says. Stiles wraps the jacket closer around him, discreetly lowers his chin to his chest and closes his eyes as he inhales. It smells like Derek’s cologne.</p>\n<p>“Thanks,” Stiles says quietly.</p>\n<p>“Welcome.”</p>\n<p>No matter what else happens, Stiles thinks, tonight was a good night.</p>\n<p>*</p>\n<p>Stiles rides with Derek when he gives Boyd a lift home after Boyd and Erica finally exit the club. Stiles gets home after midnight on a Friday night, because he spent all night with Derek. He feels almost cool.</p>\n<p>It’s not until he’s upstairs in his room and has kicked off his shoes that he realizes he’s still wearing Derek’s jacket. Stiles glances over at Derek’s window, but it’s dark.</p>\n<p>So, Stiles curls up in Derek’s jacket, and falls asleep warm and content.</p>\n<p>*</p>\n<p>“Why do you have a Letterman jacket?” Scott asks Stiles Monday morning at school. Stiles was going to give it back to Derek all weekend, but Derek was gone all Saturday, and Sunday Stiles hung out with his dad and worked on homework and didn’t really think about it until he saw it hanging on the back of his desk chair Sunday night. Derek obviously didn’t miss it, since he didn’t make an effort to retrieve it over the weekend. Stiles just decided to give it to Derek at school on Monday.</p>\n<p>“It’s Derek’s,” Stiles explains as he shoves it in his locker and retrieves his physics book.</p>\n<p>“Why do you have Derek’s jacket?” </p>\n<p>“He lent it to me on Friday night because I was cold.” Scott stops and just looks at Stiles. “What?” Stiles asks.</p>\n<p>“Isn’t that a little weird?” Scott asks. </p>\n<p>“How is it weird?”</p>\n<p>“He let you wear his jacket.” Stiles just shakes his head in incomprehension. “Dude, the only person I’ve ever let wear my jacket is Allison,” Scott points out.</p>\n<p>“I’ve worn it!” Stiles exclaims.</p>\n<p>“You don’t count.”</p>\n<p>“Thanks.”</p>\n<p>Scott huffs. “You know what I mean. You’re like my brother, so it’s not weird if you wear my jacket. And it was only that one time when you forgot your hoodie and we were at the lake with your dad. It wasn’t on a Friday night, and you didn’t keep it all weekend.”</p>\n<p>Stiles slams his locker shut. “It’s nothing.”</p>\n<p>“It’s weird.”</p>\n<p>“Scott, just…drop it,” Stiles sighs. The last thing he needs is Scott implying things that he doesn’t want to think about.</p>\n<p>Stiles tries to find a good time all day to give Derek back his jacket, but Stiles’ path never crosses Derek’s on a typical school day. So the jacket sits shoved in Stiles’ locker all day.</p>\n<p>After school, Stiles knows that Derek usually hangs out with Jennifer and some of the baseball team and their girlfriends before heading off to practice. Stiles has gone with Scott to practice enough to know that most afternoons, the popular senior crowd congregates at the end of the English hall. So, he doesn’t think anything about it when he takes the jacket down there.</p>\n<p>Derek’s back is to Stiles, his arm slung across Jennifer’s shoulders. Boyd, Ennis, Kali, and Aiden are all standing around him. Ennis sees him first.</p>\n<p>“I think you got lost, loser.”</p>\n<p>“How original,” Stiles drawls, rolling his eyes. “Bet it took you all day to think of that insult, didn’t it? Been saving it for awhile?”</p>\n<p>Ennis glares at him and starts to step forward, but Kali puts a hand on his arm. Derek and Jennifer turn around then; Derek grins at Stiles, even though he looks confused to see him, and Jennifer looks at him like he’s an unpleasant bug that smells. Stiles took a shower that morning; he knows he doesn’t smell.</p>\n<p>“What are you doing here?” Derek asks.</p>\n<p>“Stan, how nice to see you,” Jennifer says all saccharine and fake smiles.</p>\n<p>“It’s Stiles, actually, though I can see how you could get confused. Stiles is so hard to remember.”</p>\n<p>Jennifer narrows her eyes, and Derek heaves an aggrieved sigh. “Stiles,” he says in the tone Stiles has come to understand as his “Stiles-is-being-difficult-why-do-I-talk-to-him-again?” voice.</p>\n<p>“Here,” Stiles says, awkwardly handing Derek his jacket. This had seemed like such an easy thing to do: find Derek, return jacket, leave school. But this is just weird and maybe he should have taken it over and left it with Peter, because being alone with creepy Peter in a kimono is much less awkward than this.</p>\n<p>“Is that your <i>jacket</i>?” Jennifer exclaims. “What is he doing with your jacket?”</p>\n<p>“I leant it to him Friday night. I forgot.” Derek smiles. “Thanks.”</p>\n<p>Stiles returns the smile. “No problem.” He turns to go, but he’s stopped by someone much stronger than him, and then he’s being pushed back into the locker. Hard. Pain shoots through his shoulder, but it doesn’t sting as much as his ego.</p>\n<p>Ennis’ face is looming above his, and he’s staring down at Stiles menacingly. “Where you going, <i>Sti-les?</i> he asks, drawing out Stiles’ name until it’s two syllables. </p>\n<p>“Ennis,” Derek warns, voice low and deep.</p>\n<p>“Don’t worry, Hale, we’re just having a little chat with your friend. Ain’t that right, <i>Stiles?</i>” Ennis pins Stiles against the locker with a firm grip, and no matter how much he squirms, he gets nowhere. “Just getting to know your pal here, Hale. You’re like Mahealani, aren’t you, Stalonzy?”</p>\n<p>“Stilinski,” Stiles mutters, his heart pounding in his chest. He’s kind of scared, and majorly embarrassed. And a tiny (huge) part of him is hurt that Derek’s just <i>standing there</i>.</p>\n<p>“Oh, it’s funny that you think I care what your name actually is.”</p>\n<p>“Ennis, seriously, chill the fuck out,” Derek says.</p>\n<p>“You think Derek’s gonna keep you safe, don’t you? See,” Ennis leans closer and lowers his voice, “You’re just a waste of fucking space at this school. Just sharing the hallway with you right now makes me sick.” Ennis spits, a wad of mucus landing on Stiles’ jaw, and Stiles jerks at the impact. He feels the slime slide down his skin, revulsion and humiliation churning in his belly.</p>\n<p>Then Ennis is gone. Stiles watches as Derek puts himself between the two of them. “What the fuck is your fucking problem?” Derek yells, shoving Ennis. “Are you insane?”</p>\n<p>“Just because you have some hard on for the nerd doesn’t mean the rest of us do.” Ennis shoves Derek back, and Jennifer and Kali start talking in fast, high-pitched squeals, trying to calm the boys. Stiles just stands frozen on spot, watching the scene as a huge lugy clings to his chin.</p>\n<p>A hand circles his arm, and he recoils. But it’s just Boyd, leading him away from the group. He hands Stiles a napkin from his backpack. </p>\n<p>“Thanks,” Stiles says, wiping his face and feeling all around disgusting. Boyd nods, and there’s a deep frown on his face when he turns back to the group.</p>\n<p>Stiles takes what little dignity he has left and walks away. There are so many emotions rumbling violently inside of him, and he tries to keep himself in check. He’s not sure if tears or flying fists will come out.</p>\n<p>“Stiles!” </p>\n<p>Stiles doesn’t stop. The only thing he can do right now is keep walking forward, away from everything – and everyone – behind him.</p>\n<p>“Hey,” Derek says, falling into step beside Stiles. “I’m sorry about – “</p>\n<p>“Don’t,” Stiles bites out.</p>\n<p>“But I – “</p>\n<p>Stiles whips around and glares at Derek. Everything he was trying to hold back, all those violent emotions just explode inside of him. “Don’t you <i>dare</i> apologize or defend that piece of shit,” Stiles seethes. “I never thought – you were supposed to – just, no.” He shakes his head, tears gathering in his eyes from embarrassment, anger, and bitter bitter disappointment. “You were supposed to be my friend.”</p>\n<p>Derek’s face falls, and there is genuine pain and frustration on it, but it’s not enough. Not this time. “Stiles, I – “</p>\n<p>“Don’t.” Stiles turns and says, “Don’t waste your breath on a waste of space like me.”</p>\n<p>*</p>\n<p>Stiles usually spends Monday afternoons watching baseball practice with Lydia, but after what just happened, that <i>totally</i> wasn’t happening. Instead, he’s huddled beneath the bleachers beside the lacrosse field with his bookbag and skateboard, hiding from the world.</p>\n<p>His eyes had been damp for a few minutes, but then Stiles realized that some jock asshole like Ennis didn’t deserve his tears. However, he knew Derek was actually the cause, not Ennis. </p>\n<p>He didn’t know what he expected really. Sure, he and Derek had hung out Friday night, but Stiles knew that Ennis, Jennifer, and the rest were his <i>friends</i>. Stiles was just making something out of nothing.</p>\n<p>He’s picking at the grass and rolling his skateboard back and forth with his foot when someone ducks under the bleachers. It’s Scott, followed by Allison, Lydia, Kira, and Cora.</p>\n<p>“Dude, what are you doing under here?” Scott asks, dropping onto the grass beside Stiles in an unceremonious heap of limbs. </p>\n<p>“What are you doing?” Stiles asks, looking around at everyone. “How did you find me?”</p>\n<p>“It was Cora,” Kira says, smiling proudly at her. “After Derek broke a wooden bat and then threw an aluminum one across the field, Cora figured something was probably wrong.”</p>\n<p>“Destruction of property was my first clue,” Cora drawls. “Then there was your conspicuous absence.” She smirks slightly. “Though, Derek constantly looking into the bleachers with a scowl was another big fucking clue.”</p>\n<p>“Go away,” Stiles says, crossing his arms over his chest.</p>\n<p>“Stiles, I am <i>under bleachers</i>,” Lydia says, sitting on Kira’s cardigan like she’s afraid the grass will burn her if it touches her. “This is disgusting, and this dress cost more than your Jeep, so stop with the asshole act, and tell us what’s wrong.”</p>\n<p>Stiles deflects the question by turning to Scott. “Aren’t you supposed to be at practice?”</p>\n<p>Scott shrugs. “I blew it off.”</p>\n<p>“But…the championship.”</p>\n<p>Scott looks hurt at the idea that something like a baseball championship could possibly be more important than Stiles. It makes Stiles smile, despite the afternoon’s events. Actually, looking around at everyone sitting beneath the bleachers, Scott and Allison beside him, Cora and Kira sitting together off to the side, and Lydia sitting primly on the cardigan, he feels a bit of the knot in his chest loosen.</p>\n<p>“I don’t care about the championship,” Scott says. “I mean, I do, but the seniors are going to have the most play time, so no one is going to care about me.” He grins, and Stiles thinks Scott definitely gets the award for Best Best Friend Ever.</p>\n<p>“So, what did my brother do?” Cora huffs, looking somewhere between bored and pissed off. Which, Stiles admits, is Cora’s default mode.</p>\n<p>“Why do you assume this has anything to do with Derek?” Stiles asks.</p>\n<p>“Um, did you miss the part where he broke a bat?” Cora says, dropping her chin and looking at Stiles like he’s a Grade-A idiot.</p>\n<p>“Stiles honey, there’s only one person in this world who can make you crawl under the bleachers,” Lydia says, “and that person is Derek Hale.”</p>\n<p>Stiles feels his cheeks burn, and he looks away, out past the bleachers to the field. “I don’t know what you’re talking about.”</p>\n<p>“We’re talking about your massive crush on Derek,” Kira says. Everyone looks at her sharply. Her shoulders hunch, and she says, “Was it supposed to be a secret? Cause, like, I figured if I knew about it then it was common knowledge.”</p>\n<p>Stiles groans as he hits his head against the bleacher behind him again and again. “This is horrible. Today was hands down the worst day of my high school career. Ennis spit on me. <i>He fucking spit on me.</i> In the middle of the hall. With Derek, Jennifer, and Kali <i>right there</i>.”</p>\n<p>“I hate that guy,” Scott grumbles. </p>\n<p>“What did Derek do?” Cora asks, fuming. </p>\n<p>“He stepped in and shoved Ennis, but… “ Stiles shakes his head. “What did I expect him to do? Ennis is his friend.”</p>\n<p>“Fucking Derek,” Cora mutters as she gets up and bolts from underneath the bleachers.</p>\n<p>“Cora!” Stiles yells. “Shit.”</p>\n<p>“I’ll go get her,” Kira says, giving Stiles an encouraging smile before running after Cora. Stiles just leans against the warm metal and sighs. </p>\n<p>“Forget them,” Lydia states simply.</p>\n<p>“Easy for you to say,” Stiles replies. “You don’t have dried spit on your face.”</p>\n<p>Lydia grabs her bag and starts rummaging through it. “After I win prom queen, none of this will matter. I will take you to prom myself, Jackson be damned, if I have to,” she says. Stiles kinda balks at her as she finds whatever she’s looking for in her purse. “A-ha!” Lydia pulls out a package of makeup remover towelettes. “Here, wash your face.”</p>\n<p>“Thanks.” Stiles starts scrubbing his face as Scott stares angrily at Stiles’ chin. </p>\n<p>“Derek is a jerk,” Scott says. “He shouldn’t even be friends with that asshole in the first place.”</p>\n<p>Stiles frowns. “At least he stepped in.” He sighs. “Still doesn’t make me feel any better.”</p>\n<p>*</p>\n<p>Stiles ignores the five texts Derek sends that evening. He tries not to glance at the window every five minutes, but it’s hard. Once when he looks over, he sees Derek and Cora standing in his bedroom, arguing. From the way Cora left the bleachers earlier, Stiles is almost positive it’s because of him. Something about that gives him a twisted sort of satisfaction.</p>\n<p>At lunch the next day, Stiles is talking to Allison, Scott, and Kira when someone takes the seat on the other side of Kira. Stiles does a double take when he sees who it is: Boyd.</p>\n<p>“Tell Derek I’m not accepting messages via his best friend, but nice try,” Stiles says, rolling his eyes. </p>\n<p>“I’m not here for Derek,” Boyd says, pulling a brown paper lunch sack from his backpack on the floor. Stiles waits, but Boyd doesn’t say anything, just pulls out a PB&amp;J sandwich.</p>\n<p>“Then why are you sitting here?” Stiles asks, and Allison elbows him roughly in the side. He grunts, and adds, “Not that we’re not just thrilled to have you join us, and obviously we have the room, but…” Stiles twists in his seat to look over his shoulder, towards the center of the cafeteria where the popular people sit. He easily finds Derek and Jennifer, and Jackson and Lydia at the neighboring table. Boyd’s usual seat beside Derek was vacant.</p>\n<p>“I’d rather sit here,” Boyd says. He crunches on a handful of chips, and gives Stiles a close-lipped smile.</p>\n<p>Stiles isn’t sure what to think about Boyd switching lunch tables, but he likes Boyd so he doesn’t mind the company. Sometime during lunch, Stiles turns around and looks at Derek’s table again, and finds Derek looking at him. Their gazes hold for longer than they should, until Stiles finally tears his eyes away.</p>\n<p>*</p>\n<p>“This is angrier than what you usually listen to,” Erica says when she comes into the record shop, wearing a tight t-shirt, cut offs, and high topped sneakers. The pop of gum just finishes the look. “Usually it’s some pretentious hipster bullshit you got from some jerkoff blog.”</p>\n<p>“That’s ironic,” Stiles retorts. Erica flips him off as she comes behind the counter. </p>\n<p>“So, sunshine, what’s wrong today?” She leans her elbows on the counter, and Stiles gets distracted by her boobs resting on her arms. Erica’s just amused.</p>\n<p>“Nothing,” Stiles finally says. </p>\n<p>“Liar. Angry punk isn’t your style, so it’s some kind of high school angst-induced mood swing. Spill it, Stilinski. I’m here to listen, and despite popular opinion, I’m pretty good at that kind of stuff.”</p>\n<p>“I bet you are,” Stiles jokes, and Erica waggles her eyebrows. Stiles smiles despite himself, and rolls his eyes and says, “It’s just some stupid shit. Bullies, crushes, stuff like that, you know?”</p>\n<p>To Stiles’ surprise, Erica slings her arm around his shoulders, and suddenly Isaac is on his other side, and Stiles is pressed between them. She drops a kiss on Stiles’ cheek. “Look, first off, high school is stupid. Social hierarchies are fucking stupid, and anyone who adheres to them, or gets upset by them, are stupid.” She shoots him a baleful glance. “Yes, I’m talking about you right now.” She blows another bubble with her gum, and Stiles reaches forward to pop it. “Second, you are hot, in that nerd-geek sort of way. I’d totally do you, and so would Isaac.” Stiles’ mouth drops open as he looks from her to Isaac on his other side, and Isaac nods in confirmation. “And I know we’re both hot, so if some stupid high school prick doesn’t think your ass is totally worth tapping? He’s not worth your fucking time.”</p>\n<p>Stiles just stares back and forth between them, totally thrown. “That is oddly sweet,” he finally says.</p>\n<p>“Stop being such a moper,” Erica says. “Cause as much as I like The Runaways, you’re totally bringing me down.” </p>\n<p>Erica pops a bubble loudly in his face before going over to the record player and switching it for something with an electronic beat that she can dance around to as she sweeps. Stiles just watches her, shaking his head.</p>\n<p>“Hey,” Isaac says from beside him, and honestly, Stiles had forgotten that Isaac was still there. “It’s true you know.”</p>\n<p>“What is?” Stiles asks dumbly. </p>\n<p>Isaac heaves a sigh and rolls his eyes. “If you ever realize Derek Hale isn’t the only guy in the world, give me a call.” Isaac gives Stiles a smirk, and then he disappears into the back.</p>\n<p>And well, that was just not what Stiles had expected.</p>\n<p>*</p>\n<p>Friday night is Dad night since his dad has a rare evening off. His dad has just come home from his shift and is in the shower, and Stiles is working on some homework so he doesn’t have to worry about it the rest of the weekend when he hears something hit his window. He flails about in surprise and glances over to see Derek standing at his window, holding his whiteboard.</p>\n<p>Stiles frowns as he walks to the window. In Derek’s large scrawl he reads, <i>TALK TO ME.</i></p>\n<p>Stiles yanks his board from under the window and writes, <i>Nothing to talk about.</i> He flips it around and tries to look neutral. </p>\n<p>Derek’s eyebrows draw together and he wipes his words away with his forearm before writing again. <i>You’re mad at me. We need to talk. Please?</i></p>\n<p>\n<i> Nothing to be mad about. You don’t owe me anything.</i>\n</p>\n<p>Derek’s eyebrows are almost a unibrow as he reads Stiles’ words, and when Derek goes to write another message, Stiles drops the whiteboard to the floor and goes downstairs. </p>\n<p>Stiles is in the kitchen, chopping tomatoes for his awesome homemade, heart-healthy fajitas when he hears the doorbell ring. Stiles wipes tomato juice on his khakis and heads through the house. When he pulls the door open, he’s surprised to see Derek on the other side.</p>\n<p>“Before you slam the door in my face,” Derek says, putting his hand on the door to keep Stiles from slamming it in his face, “I know you’re mad, so don’t deny it, but Peter’s being a total creeper, wearing his kimono around again, burning incense, and the food he’s set out on the table is all raw, and I’m not talking sushi or a rare steak. And there’s this woman at the house, and I just don’t want to know.” Derek uncomfortably shifts from foot to foot, and Stiles sighs because he can’t just <i>refuse</i> to let Derek in his house to get away from Uncle Creepy, so he steps aside to let Derek in. </p>\n<p>After Stiles closes the door, Derek gives him a small smile. “Thanks.”</p>\n<p>“Whatever,” Stiles says. It’s not like it’s the first time Derek has come to his house to hide from creepy Peter. That first summer, Derek hid out at Stiles’ house multiple times a week. It was one of the reasons they became such good friends. But it’d been awhile since Derek had chosen Stiles’ place to hide out in. Knowing he’s being immature, he says sarcastically, “Though, being Friday night, I thought you’d be with Jennifer or one of your friends.”</p>\n<p>“Ah, yeah,” Derek says as he follows Stiles into the kitchen. “Well, see, Jen isn’t exactly happy with me right now.”</p>\n<p>“Why’s that?” Stiles asks, going back to his fajitas as Derek takes a stool. He hands Derek an onion to start chopping. Hey, he can be petty if he wants, right?</p>\n<p>“Stiles,” Derek starts, “I owe you an apology.”</p>\n<p>Stiles sighs and leans back against the counter, facing Derek. “I owe you one, too.”</p>\n<p>Derek’s brows draw together in confusion as he shakes his head. “No, you don’t. What Ennis did – “</p>\n<p>“Was not your fault,” Stiles interjects. “You don’t have to save me from bullies. You’re not my hero.”</p>\n<p>“I should have broken his nose.”</p>\n<p>Stiles huffs out a laugh. “Did Cora talk to you?”</p>\n<p>“Yes,” Derek admits, “But I didn’t need Cora to help me see that.”</p>\n<p>Stiles runs a hand through his hair and starts looking through the spice rack. “Look, I know that you’re friends with those guys, and I know that you know they’re jerks. And I know it’s just high school bullshit, and it’s not like we’re really friends anymore, so I can’t expect you to protect me – “</p>\n<p>“That’s not true,” Derek says. “We are friends.”</p>\n<p>“Not really, Derek,” Stiles says sadly. “We were best friends a couple of years ago, for one summer. And that’s cool, you know? I have Scott, and you have Boyd and the baseball team, and that’s just the way it is. Doesn’t mean we’re not still acquaintances or anything.”</p>\n<p>Derek looks troubled by all of this. His eyebrows are almost connected. “It shouldn’t be like this, though. And I shouldn’t have let Ennis walk out of school for treating you how he did.”</p>\n<p>“It is what it is, man,” Stiles replies. They look at each for a few moments, until Stiles nods and says, “So, are we done with stupid feelings shit now?”</p>\n<p>Derek looks visibly distraught. “Are we friends?”</p>\n<p>Stiles shrugs. “Yeah, nothing’s changed.” Stiles means it in all senses of the word; he knows that just because Derek is over here doesn’t mean that they’ve overturned the social hierarchy or anything. But Stiles just can’t be mad at Derek for long.</p>\n<p>When the sheriff comes down, he looks surprised to find Derek next to Stiles, pulling tortilla shells from the steamer. He smiles as he crosses the kitchen and claps Derek on the shoulder. “Hey, Derek. Long time no see. How are you doing?”</p>\n<p>“Well, sir,” Derek answers, waving his burning fingertips around.</p>\n<p>“How’s your family?” </p>\n<p>“They’re good.”</p>\n<p>The sheriff nods, and Stiles points to a stack of plates. “Dad, can you help set the table?”</p>\n<p>“No problem, kiddo.” </p>\n<p>The sheriff sets the table with the food Stiles and Derek had already prepared in bowls, and Stiles finishes sautéing the peppers and onions while Derek takes the tortillas and meat to the table. When they’re all seated, the sheriff surveys the food appreciatively.</p>\n<p>“This looks good, Stiles.” He stares at the steak in the bowl he’s holding suspiciously. “And you swear it’s good for me?”</p>\n<p>Stiles nods. “Yep. Healthy, but delicious.” Stiles glances at Derek. “He thinks that healthy eating means no taste. I keep telling him that’s what the internet’s for, tasty delicious recipes that will keep his heart from like imploding in his chest.”</p>\n<p>Derek laughs and the sheriff frowns. “I don’t understand half of what comes out of his mouth when he starts rambling about hydrogenated oils and good carbs and whatever else.” The sheriff scoops beans onto the tortilla. “I don’t know what I’m going to do when he goes to college.”</p>\n<p>“Da-ad,” Stiles mutters, feeling his cheeks heat. “Stop embarrassing me.”</p>\n<p>“It’s just Derek,” the sheriff says, like it was just yesterday that Derek was over everyday raiding their refrigerator. </p>\n<p>“At least it’s all cooked,” Derek says. “Better than my house.” Derek shudders, and Stiles laughs.</p>\n<p>“So,” the sheriff says halfway through the meal, “Stiles tells me that you’ve been talking to a few recruiters.”</p>\n<p>“He did?” Derek looks over at Stiles like that thought pleases him greatly before turning back to the sheriff. “It’s true. A few colleges out east and in the Midwest, a few here. I really want to go to UC Irvine, so I can stay close.”</p>\n<p>The sheriff nods his head. “Makes sense. I wish Stiles would contemplate staying a little closer to home.”</p>\n<p>“Dad, we’re not going through this again,” Stiles says. “I am going to apply everywhere, including California. So don’t get all upset yet. Save that for when I end up in New York.” Stiles gives his dad a wide smile.</p>\n<p>“I didn’t know you wanted to go away for school,” Derek says. “It’d be so weird if you were across the country.”</p>\n<p>Stiles shrugs. “Thought college might be a good time to do something different, live somewhere different for awhile.”</p>\n<p>“It’d kinda suck if you were so far away so I couldn’t see you at least some weekends,” Derek says. </p>\n<p>Stiles is surprised at Derek’s words, and he doesn’t miss the way his dad is looking between them, but he ignores it. He focuses on the fact that Derek would miss him.</p>\n<p>*</p>\n<p>After dinner, Derek helps Stiles and the sheriff clean up the dishes, then they all sit on the couch and watch Sportscenter. Derek and his dad get into a long discussion about this year’s baseball teams, and Stiles doesn’t care unless it’s his precious Mets, so he screws around on his phone while they talk. It feels comfortable, and Stiles is happy. He’s glad that Derek showed up and forced them to make up, because Stiles knows he is too damn stubborn to have done something like that. He would have let Derek graduate and go off to college without talking to him again. Because Stiles is an idiot. </p>\n<p>When the sheriff goes to bed, Stiles and Derek stay on the couch and idly watch some comedian. </p>\n<p>“Thanks for letting me come over,” Derek says after awhile. “I know you were angry at me.”</p>\n<p>“What gave you that idea?” Stiles jokes. </p>\n<p>Derek smiles, but then it quickly falls. “Jennifer’s mad at me.”</p>\n<p>“Why?”</p>\n<p>“Well, I basically told Ennis to go fuck himself. We haven’t spoken since, and Jennifer’s best friends with Kali, so…” Derek trails off and rubs his hands against his face. “It’s all so fucking stupid, Stiles. How is this my life?”</p>\n<p>“Oh, look, my ruby slippers are too tight,” Stiles says sarcastically.</p>\n<p>“Fuck you, Stiles.”</p>\n<p>“Derek, seriously? You’re popular, your girlfriend is hot, and you have everything going for you. Forget Ennis, and honestly, forget Jennifer if she’s going to be like that.”</p>\n<p>“Why is all this so complicated?” He slumps back against the couch. “We’re seniors; we’re supposed to be having fun.”</p>\n<p>“Then have fun.”</p>\n<p>“I guess.” Derek stands up and stretches, then yawns. “I should get going.”</p>\n<p>“Okay.”</p>\n<p>“Thanks for letting me crash dinner,” Derek says as Stiles walks him to the door. “I appreciate it.”</p>\n<p>“Door’s always open, man,” Stiles says as Derek steps onto the porch. </p>\n<p>Derek turns around and looks like he’s about to say something, but instead, he just smiles and then jogs off the porch.</p>\n<p>*</p>\n<p>The next morning, Stiles organizes CDs with Isaac. Isaac complains the whole time, but Stiles thinks it’s fun. Call him a weirdo, but he thinks that patterns, putting things into their correct places, things like that, theraputic. </p>\n<p>Halfway through his shift, his phone buzzes. It’s Derek.</p>\n<p>\n<i>Want to go to the park and help me practice?</i>\n</p>\n<p>Stiles tries to hide his smile as he taps out, <i>At work, but afterwards?</i></p>\n<p>\n<i>Meet you at the park. I’ll bring your glove.</i>\n</p>\n<p>Stiles grins full on as he goes back to the hard rock section.</p>\n<p>“Let me guess who you were texting,” Isaac says from two rows over.</p>\n<p>“Shut up, you’re just jelly you can’t have this hot bod,” Stiles retorts, running a hand down his torso.</p>\n<p>“Oh, so jealous,” Isaac rolls his eyes and throws a stuffed anime character at Stiles’ head. That starts a full on war, and by the time Erica returns from the back fifteen minutes later, the store’s floor is covered in plushies, calendars, and all sorts of other non-breakable merchandise.</p>\n<p>“I am so not cleaning this up,” Erica states. “You two just need to pop into the back room and jerk each other off and get it over with. This kindergarten crap is so lame.”</p>\n<p>Stiles feels himself blushing as he starts to clean up his mess. Because the thing is, it’s not like he hasn’t thought about dating Isaac or Erica. They’re both hot as hell, and Stiles likes them both a lot. And after Isaac had made that comment last time Stiles worked, Stiles definitely spent all night thinking about what it would be like dating him. Isaac is great, and hot, and funny, and had great taste in music (and scarves). But…Isaac isn’t Derek. And Stiles really wishes he could just let himself fall for someone as awesome as Isaac, but he just can’t while Derek is around.</p>\n<p>But it doesn’t make it any easier with Erica making suggestive comments around them. Because Stiles was still a seventeen year old boy, and his dick wasn’t blind. It was just fucking stupid, apparently.</p>\n<p>After Stiles’ shift, he drives straight to the park. He sees Derek’s Camaro parked at the ball field furthest away from everywhere else, the one down in the hole at the back of the park near the trees. It was Derek’s favorite place to practice. </p>\n<p>Stiles walks onto the field where Derek has a pitching machine set up. He stands to the side as it throws a pitch and Derek swings, the ball shooting into left field.</p>\n<p>“Nice.”</p>\n<p>“It’s shit,” Derek growls as he swings at the next pitch, sending it foul. Stiles watches as Derek hits the remaining balls, growing more and more frustrated with each subsequent ball until the last three are strikes.</p>\n<p>“You’re out!” Stiles yells.</p>\n<p>Derek pulls off his helmet and glares at Stiles as he throws it onto the ground. “Thanks Captain Obvious.”</p>\n<p>“Wow, great comeback, really.”</p>\n<p>Derek grips the bat like he’s really thinking about using Stiles’ head for practice, but Stiles walks forward anyway. </p>\n<p>“You’re in a <i>foul</i> mood.”</p>\n<p>It takes Derek a minute, but then he’s groaning and rolling his eyes. “You’re an idiot.”</p>\n<p>“You love having me around. Why else would you beg me to help you practice on a Saturday?”</p>\n<p>“I didn’t beg.”</p>\n<p>“You were pretty much on your knees, and – “ Stiles stops, because <i>ohmigod did he just say that?</i> And if Derek’s pink cheeks and wide eyes are any indication, then yes, he totally did. “Not that I meant, I mean, shit. Shutting up now.”</p>\n<p>Derek laughs quietly, and some of the tension and frustration leaves his body. Stiles counts that as a victory.</p>\n<p>“So, what do you need me to do?” Stiles asks, bending down to grab Derek’s old glove that he’d claimed as his own back during that summer back before Derek had friends and Stiles was just a lonely kid. He slips it on. It’s a little stiff, and Stiles flexes his fingers and pounds his fist against the palm a few times to loosen it. He’s helped Derek practice off and on over the last few years, mostly during the off season on weekends or when both boys were bored during the summers. But Stiles hasn’t put the glove on since early last summer, almost a year ago. It feels good to be wearing it again.</p>\n<p>“We’ll just do some pitching to warm up,” Derek explains, fitting his own glove to his hand and grabbing one of the many baseballs littering the ground. “Then you can help me with fielding.”</p>\n<p>They toss the ball back and forth, Stiles definitely out of practice. He makes himself feel better by believing that having Derek chase after his badly aimed pitches is good practice.</p>\n<p>After about fifteen minutes of this, Stiles is panting, and Derek is barely winded despite constantly running after Stiles’ wild pitches. “You need to exercise more,” Derek says as he tosses the ball back to Stiles. </p>\n<p>“I exercise,” Stiles says. “I skateboard all the time.” He tosses the ball again, and then immediately moves his arm around to dispel some of the growing ache. “But apparently I don’t use my arms enough, except for, you know, the obvious.” Stiles makes a fist and mimes jerking off. Derek rolls his eyes and throws the ball with extra force so that it stings Stiles’ hand when it connects. “Ouch!” Stiles exclaims, pulling his hand from the glove and shaking it out. “Fine, no more masturbatory humor.”</p>\n<p>“Focus,” Derek barks out as he jogs over to the sidelines and pulls off his glove. He shoves it under his arm before grabbing the bat. He walks over to Stiles and holds it out for him.</p>\n<p>Stiles eyes the bat warily. “What exactly am I supposed to do with that?”</p>\n<p>Derek rolls his eyes again and shoves the bat against Stiles’ chest. “I’m going to set up the pitching machine. Hit the balls so I can practice my fielding.”</p>\n<p>“This is a colossally bad idea,” Stiles points out. “I’m not so sure how I feel about having balls flying at my face.”</p>\n<p>“I figured you’d be okay with it,” Derek says as he starts jogging towards the pitching mound.</p>\n<p>It takes Stiles a moment, but then he’s shouting, “Derek Hale! Did you just make a gay joke to me?” Derek turns around and grins, and Stiles bursts out laughing. “And you criticized my jack off joke.” Derek looks so relaxed and happy, his face alight with laughter, that Stiles has trouble breathing for a moment. He doesn’t care what made Derek look like that; he should just look like that all the time. “Ass.”</p>\n<p>“Ready?” Derek calls. Stiles grips the bat in his hands, takes a deep breath, and nods. Derek hits a button on the machine and runs towards second base while refitting his glove.</p>\n<p>The moment the first ball shoots out of the machine, Stiles emits a high-pitched yelp and runs off to the side, out of the way of danger.</p>\n<p>“What the hell was that?” Derek yells, laughing.</p>\n<p>“I panicked!” Stiles is breathing hard, his heart pounding at his near death experience. “I know this face isn’t as perfect as yours, but I’d like to keep it in one piece. It’s all I got, dude.” Another ball pops out from the machine, and Stiles does a better job of hiding his scream. He’s pretty sure that one was going ten times faster and straight for him. “Are you trying to kill me?”</p>\n<p>“Stiles, please! This is important!” The look on Derek’s face is so earnest, so Stiles steels himself and steps back over to the mound after the next ball crashes against the back fence. His palms are sweaty and nerves have him a bit unsteady on his feet, but Derek does this all the time. So do like ten year olds. Nothing dangerous about a pitching machine, nope, no way.</p>\n<p>When the next ball shoots from the machine, Stiles swings the bat…and misses. He groans.</p>\n<p>“At least you’re still at home plate,” Derek calls out encouragingly. Stiles flicks him off.</p>\n<p>The next ball, Stiles actually connects with but sends it flying foul. The next one makes it onto the field, and Derek runs after it. “That was too wide left,” Stiles yells across the field as Derek heads towards third base. “I’m shit at baseball.”</p>\n<p>“It’s fine,” Derek smiles, finally approaching the ball as the next one shoots out. Startled, Stiles yelps again as it sails into the chain link, but the next one he sends into left field.</p>\n<p>They do this for over half an hour, until Stiles is hitting pretty regularly between left and center field and Derek is catching over half of the fly balls. After Stiles grounds the last ball towards short stop, he drops into the grass by home plate. Derek joins him a few moments later.</p>\n<p>“Sorry I’m terrible,” Stiles says as he offers Derek his Gatorade. </p>\n<p>“No, it helped a lot,” Derek assures him as he takes the bottle and upends it, chugging half of it down. Stiles watches the way his Adam’s apple bobs along his elongated throat, the sweat rolling down in rivulets that Stiles finds himself wanting to lick from Derek’s skin. He tears his eyes away and shakes his head. <i>Bad thoughts, Stiles. Bad thoughts.</i></p>\n<p>Derek hands the near empty bottle back to Stiles and says, “I’m going to practice batting again. You mind?”</p>\n<p>Stiles shakes his head enthusiastically. “Oh, definitely no complaint here. I’m just gonna crawl over there, out of the kill zone.”</p>\n<p>“So lame,” Derek says with a smile, pushing lightly at Stiles’ shoulder as he gets up. </p>\n<p>As Derek hits pitch after pitch, Stiles grabs his cell phone and texts Scott. <i>Dude. At park with Derek. He’s practicing, and I’m helping, except I suck. Think you can randomly show up and then offer to practice with him? I think he’s really worried about the championship.</i></p>\n<p>A few minutes later, a reply comes. <i>No prob. cu soon.</i></p>\n<p>Stiles is eating a bag of chips and watching Derek run sprints around the bases when Scott shows up with Allison. Stiles waves at him, and Allison walks over to Stiles while Scott makes for Derek.</p>\n<p>“McCall! What are you doing here?” Derek smiles as he and Scott do the special not-so-secret baseball handshake they all have. Scott tried to teach it to him once, but Stiles is way too uncoordinated for something like that. “Did Stiles call you?”</p>\n<p>“No, man. Allison and I were out on a date when we saw the cars,” Scott lies. Stiles is impressed it almost sounds like the truth. Especially since Scott is a terrible liar. “Thought I’d come see if you two were playing a game without me.”</p>\n<p>Scott and Derek talk about practicing while Stiles and Allison watch. It doesn’t take long for Scott to grab a bat and start grounding balls for Derek. “He’s much better at that than me,” Stiles says as he watches Scott make a rather impressive hit that sets up a good practice play for Derek.</p>\n<p>Allison hums in agreement. “Maybe,” she says, “But Scott’s not the one Derek called.”</p>\n<p>Stiles turns to her. “What does that mean?”</p>\n<p>“Seems like Derek cared more about the company than the skill of the player,” Allison responds.</p>\n<p>Stiles’ cheeks heat up as he watches Scott and Derek practicing, Derek getting a much better work out than when he was with Stiles. “I’m probably the only loser with nothing better to do,” Stiles mumbles. He hears Allison sigh beside him.</p>\n<p>A few minutes later, Stiles gets his skateboard from the Jeep and is setting up to do a kickflip on the field when he sees Allison on her cell phone. He guesses she got bored of watching Scott and Derek hit balls around (and honestly, Stiles never thought he’d ever think <i>that</i> phrase.) </p>\n<p>Stiles tries some ridiculously complicated board flip he saw on a Youtube vid, then ends up tangled in his own feet and sprawled on his ass. He’s glaring at Allison, who’s laughing at him, when he hears Cora yell, “You suck, Stiles.”</p>\n<p>Stiles lifts his head to see her and Kira walking towards him, and Jackson pulling his Porsche into a parking space with Lydia in the front seat. “What in the hell are you doing here?” Stiles looks over at Allison. “This is your doing, I can see Allison evil all over it.”</p>\n<p>Allison huffs. “I figured if Derek really wanted to practice, we should make it a real game.”</p>\n<p>“So you called the entire baseball and softball teams?” Stiles asks, leaning back, his palms flat against the grass. “Please say you didn’t call the entire baseball team.”</p>\n<p>Allison moves to get up, then leans closer to Stiles. “I may be evil, but not <i>that</i> evil.” She smiles, her dimples blinding Stiles. Pure evil, that one.</p>\n<p>Derek and Scott notice the gathering crowd, and jog over sweaty and dirty. Stiles wonders exactly how an unflattering uniform, a baseball cap, sweat, and dirt is just the recipe for The Hottest Thing Ever According To Stiles Stilinski. But Derek’s just standing there, holding his baseball cap and wiping sweat from his forehead with the back of his arm, his hair flat and damp with a hat line, and Stiles is nearly drooling on himself. Stiles’ eyes move over to Scott, who looks much the same. Nope, not all baseball players. Just Derek (and half of the MLB, if he’s honest. But mostly just Derek).</p>\n<p>When Boyd shows up with Erica in tow right after that, they start breaking into teams. Stiles looks at Lydia and Erica, who are both dressed in black workout pants and racerback tank tops. “Are you two going to betray me? Leave me on the bench all alone?”</p>\n<p>“Damn straight, Stilinski,” Erica says, pulling her hair back into a ponytail. Stiles snorts that she’s wearing red lipstick, and Lydia is in full makeup. “I’m not going to let everyone else have all the fun.” She runs off after Boyd, and Lydia gives him a small smile and a shrug before going after Jackson. </p>\n<p>Stiles grabs his skateboard and drags it behind him to the old metal bleachers. Scott steps up to the plate while Jackson stretches on the pitcher’s mound. Boyd, Erica, Lydia, and Kira are all spread out across the field. </p>\n<p>Stiles sighs and sets his chin in his hand. He knows that this is better for Derek, because this is <i>real</i> practice instead of that poor imitation that they were doing, but Stiles can’t help but feel the sting of disappointment. Before, he had Derek’s undivided attention; now, he’s sitting on the sidelines alone.</p>\n<p>As Jackson throws the first pitch, Derek looks around the park from where he’s standing behind the chain link fence near Scott. He spies Stiles on the bleachers. A frown forms on his face as he jogs over to the bleachers.</p>\n<p>“What in the hell are you doing all the way over here?” Derek asks, grumpy look on his face. </p>\n<p>“Um, watching?” Stiles replies.</p>\n<p>Derek rolls his eyes, the motion taking his whole head with it. “You’re a moron,” Derek says, grabbing Stiles’ arm and tugging him to his feet. “You’re on my team, dumbass.”</p>\n<p>“You want me on your team?” Stiles asks dumbly as he stumbles the few steps to the bottom of the bleachers. “But I’m horrible. You’re going to lose for sure.”</p>\n<p>Derek heaves an aggrieved sigh, and squeezes Stiles’ arm. “This isn’t about practice, not entirely. You called everyone here to help me – I know you did despite McCall’s insistence that you didn’t,” Derek adds when Stiles opens his mouth to protest. “We need you on our team to make it even.” When Stiles’ face falls, because of course that’s the reason, Derek leans closer and says, “I <i>want</i> you on my team, you idiot.”</p>\n<p>“I should say no just because you keep calling me names,” Stiles says, unable to hide his grin as he walks over to the bench next to the third base line. “Ass.”</p>\n<p>Derek bumps into Stiles’ shoulder with his own. “Lame.”</p>\n<p>*</p>\n<p>Stiles should stop thinking things were going to be any different between him and Derek at school. On Monday, he passes Derek in the hall, who just smiles and waves, but doesn’t stop as he walks down the hall with his arm around Jennifer’s shoulder, Jennifer talking as he listens.</p>\n<p>Boyd still sits with them at lunch, which Stiles admits is kinda weird, but Boyd is awesome, so he doesn’t complain. Stiles learns that Boyd is actually hilarious when he talks, and the longer he sits with them the more he starts to open up. Stiles isn’t sure if that’s Erica’s garrulous influence, his comfort for Stiles, Scott, Allison, Cora, and Kira, or something else. By the end of the week, Cora and Boyd are partners against Kira and Stiles at their newly established lunch time Spades tournament, and they are <i>vicious</i>. Boyd, man…Boyd is cut throat. But Cora’s hardly any different, and Stiles is pretty sure their newly formed friendship means the destruction of mankind, because Cora + Boyd? Terrifying.</p>\n<p>Despite what Derek had told him about fighting with Jennifer, Stiles sees Jennifer at Derek’s house twice that week, and Derek gets home at almost midnight every night Jennifer’s not there. It doesn’t take a genius to figure out what he’s been doing. </p>\n<p>Stiles spends the week reevaluating his feelings. Because, really? His pining crush is stupid. Derek is obviously only interested in Jennifer, and he and Derek are <i>just</i> friends. Stiles berates himself, because he <i>knows</i> that above all else, he wants Derek as a friend. Derek means too much to him for anything less. His stupid hormones could just get over themselves. Derek didn’t like him like that, end of story. He never would. They are friends, and Stiles had to be okay with what they had.</p>\n<p>*</p>\n<p>Thursday, Stiles sits at baseball practice with Lydia, working on his latest sketch. This one’s of Derek, his graduation gift that Stiles decided on the other day. Stiles is attempting to get Derek’s eyebrows just perfect when he hears footsteps on the bleachers. He glances up and sees Jennifer and Kali coming towards them.</p>\n<p>“Heads up,” Stiles calls to Lydia as he turns his sketchpad back to an unfinished drawing of Kira. </p>\n<p>“You’ve got to be kidding me,” Lydia mumbles as she glares at Jennifer.</p>\n<p>Jennifer approaches Stiles first. “Stan, I see you’re here. Again.”</p>\n<p>“Name’s still Stiles. I don’t understand what is so difficult about that.”</p>\n<p>Jennifer gives him a saccharine smile. “Doesn’t it get boring, sitting here practice after practice, watching your friends do things you’ll never do while you bury yourself in that sketchpad?” She smiles wider. “Or is it more personal than that? Deluding yourself that you have some strong friendship with him because you live next door to him, while staring at him, someone else’s boyfriend, who would never even look twice at you if even if he <i>did</i> swing that way?” Jennifer glances over her shoulder at Derek, hunched over in position at short stop. “It’s borderline stalking.”</p>\n<p>Evil witch, Stiles thinks. She has to be.</p>\n<p>“One day Derek is going to realize you’re a horrible person,” Stiles says. He ignores the sting of her words, the exact same things Stiles has told himself over and over. It just feels more real when it’s coming from her instead of his own head.</p>\n<p>Jennifer scoffs. “I’m not a horrible person,” she says. “I just don’t like pathetic losers lusting after my boyfriend. You do realize he just pities you, right?” She looks down at him condescendingly, and Stiles wants to both slap her and curl into a ball. “That’s the only reason he still talks to you.”</p>\n<p>“Wow Jennifer,” Lydia pipes up before Stiles can come up with a retort. “This looks an awful lot like a pathetic threatened girlfriend trying to intimidate the competition.” Lydia narrows her eyes and gives Jennifer an evil smile. “If Stiles is such a loser who Derek pities, why are you wasting your time?”</p>\n<p>“You better watch it, you ugly redheaded mathlete,” Kali growls.</p>\n<p>Lydia tuts a few times. “That would hurt if it came from someone who didn’t have nasty feet. Ever heard of a pedicure, Kali?”</p>\n<p>Kali starts to lunge for Lydia, but Jennifer grabs her arm. </p>\n<p>“You think you’re something Martin just because you’re nailing Jackson,” Jennifer spits. “No moderately popular eleventh grade slut is going to beat me for prom queen, no matter who you’re sleeping with.” With a flick of her hair, Jennifer and Kali storm down the bleachers.</p>\n<p>Stiles looks over at Lydia, who is shaking with rage. “Can you believe what that bitch said to me?”</p>\n<p>“I don’t think you’re a slut,” Stiles says, picking awkwardly at the cuff of his hoodie, “Even if your decision to have sex with Jackson is questionable.”</p>\n<p>Lydia turns and glares at Stiles. “Not that, Stiles! She said I was <i>moderately popular</i>!” Lydia huffs. “I’ll show her moderately popular. I may not be on the pep squad, but I am student body president, captain of the volleyball team, and a nationally ranking mathlete. That complacent grin will be wiped off her face when I win prom queen.”</p>\n<p>Stiles laughs, shaking his head. “You’re unbelievable.” Lydia just smiles at him, and Stiles laughs again and returns to his sketches.</p>\n<p>*</p>\n<p>On Tuesday night, Stiles sneaks into the dive bar to hear this indie band Erica let him listen to last week on some podcast. He orders a Coke from the bartender Danielle, who knows he’s underage. He’s always afraid Danielle is gonna rat him out, but instead, she just glares at him judgmentally and splashes half his $2 Coke onto the counter.</p>\n<p>The band is good, and Stiles is leaning against the wall in the back, bobbing his head along with the music when someone slips beside him. He’s surprised to see Isaac standing beside him.</p>\n<p>“Hey! Didn’t know you were gonna be here,” Stiles asks, looking around. “Where’s Erica?”</p>\n<p>Isaac shrugs. “Out with Boyd somewhere. I told her about this, and she said she might show up.” Stiles nods. Isaac’s nursing a beer, attained with his fake ID; he and Erica both have one. Isaac offers the bottle to Stiles, and Stiles shakes his head.</p>\n<p>Isaac laughs. “Figures.”</p>\n<p>“What?”</p>\n<p> “Sheriff’s son doesn’t want to break the law.” </p>\n<p>Stiles rolls his eyes. Sometimes he really hates being the sheriff’s son. “Dude, it’s a Tuesday night and I have a trig test tomorrow. Besides, it’d hardly be my first sip of alcohol.” Isaac shrugs and then turns back to the show. </p>\n<p>After the concert, Isaac and Stiles end up at the bar arguing music with Danielle, who glared a tad less judgmentally at Stiles when she realized his taste in music. By the time he and Isaac finally file out of the bar, it’s after midnight.</p>\n<p>“This was fun,” Isaac says. He’s standing so aloof on the sidewalk, hands stuffed in his pockets, scanning their surroundings boredly. Stiles doesn’t know how Isaac always looks so cool, with his scarves, old man sweaters, and t-shirts. </p>\n<p>“You should teach me how to be cool,” Stiles blurts. “You’re just so <i>cool</i>, you and Erica. Like, you just walk into a room and <i>cool</i> oozes from you like a disease.”</p>\n<p>Isaac lifts an eyebrow as he walks past his car in favor of walking with Stiles towards his house. “That sounds kinda gross.”</p>\n<p>Stiles groans in frustration. “You know what I mean. You with your stupid curls and scarves and stupid smirks. What I’d give for like, a tenth of your coolness.”</p>\n<p>Isaac is quiet, and the silence amplifies the situation between them. Stiles knows that Isaac is interested in dating him, and here they are, walking home together after spending the evening at a concert. He rubs a hand through his hair and over his face as he readjusts the grip on his skateboard. </p>\n<p>After a few minutes, Isaac asks, “Do you remember me when I was in school?”</p>\n<p>Stiles tries to pull up a picture. He knows Isaac and Erica graduated with Laura two years ago, but he didn’t know them then, just met them through The Rev. Stiles shakes his head.</p>\n<p>“I was a scrawny comic book geek who no one looked at twice. Did you know I asked out Lydia my senior year?” Stiles shakes his head; Lydia had never said she knew Isaac. “She said to come back when I drove something with more power than a bicycle chain.”</p>\n<p>“Ouch.”</p>\n<p>“My dad used to beat the hell out of me, I’d come to school all bruised and hide in the locker room when I played lacrosse,” Isaac explains. That stops Stiles because he had forgotten Isaac was on the lacrosse team. His face must show it, because Isaac smiles and says, “Don’t feel bad you don’t remember me. I had a good habit in those days of fading into the background.”</p>\n<p>“Why are you telling me all this?” Stiles asks, the heavy mood making him feel all weird. </p>\n<p>“I’m trying to make a point. I wasn’t cool in high school, not by a long shot. Neither was Erica.”</p>\n<p>“So what you’re saying is that puberty was a lot nicer to you two than it’s been to me?” Stiles jokes as they turn on his street.</p>\n<p>“I’m saying things change, people change.” Isaac shrugs. “High school isn’t the best years of your life.”</p>\n<p>“Thank god.” They’re quiet as they walk down Stiles’ street. When they get to Stiles’ house, the sheriff’s car isn’t in the driveway. His late shift is the only reason Stiles could stay out so late. His normal curfew is closer to eleven than one.</p>\n<p>Stiles looks over at Isaac, hands shoved into his pockets. Maybe, he thinks to himself as he looks at Isaac. Maybe one day things would be different and he could look at Isaac differently.</p>\n<p>“See you at work,” Isaac says with a wave as he starts to head back towards the bar.</p>\n<p>“Thanks for making sure I got home safely.”</p>\n<p>Isaac smiles and then turns around and walks away.</p>\n<p>Upstairs, Stiles toes off his shoes and nearly trips because he’s unsteady on his feet. His head is swimming with confusing thoughts, and he’s not quite sure he’s ready to make huge life changing decisions.</p>\n<p>A light flicks on in the room next door, and Stiles looks up to see Derek at the window, waving and smiling. “Universe, you fucking suck,” Stiles mumbles when his eyes rake over Derek’s worn Henley and plaid pj pants. “Suck so fucking much.”</p>\n<p>Derek lifts up the whiteboard. <i>Where have you been? It’s late!</i></p>\n<p>Stiles snorts as he grabs his own board. He scribbles a response. <i>You got in at midnight all last week.</i></p>\n<p>Derek lifts an eyebrow. <i>Were you watching for when I got home?</i></p>\n<p>\n<i>Like you were me tonight?</i>\n</p>\n<p>Derek laughs and shakes his head. <i>I just hope you had fun. I’m glad that you’re going out.</i></p>\n<p>\n<i>Wow, Derek, thanks for making me feel like a total loser.</i>\n</p>\n<p>Derek frowns. <i>NOT WHAT I MEANT!!!!!!!!!!</i></p>\n<p>\n<i>I know. Night.</i>\n</p>\n<p><i>I really didn’t mean that.</i> Stiles looks up to see Derek with his bottom lip jutting out, in full on puppy mode. He’s so fucking adorable, Stiles hates him a little.</p>\n<p>\n<i>Fine! But seriously, I’m gonna pass out now. Test tomorrow.</i>\n</p>\n<p>Derek waves and Stiles drops the white board to the floor.</p>\n<p>Definitely way too confusing for tonight.</p>\n<p>*</p>\n<p>Stiles is sitting on the grass near the sidewalk, skateboard beside him forgotten. He’s so engrossed in his book that he doesn’t hear the approaching footsteps.</p>\n<p>“You are gone,” Derek says, dropping onto the grass beside him. Stiles looks up, trying to refocus his eyes and brain as he makes the transition from page to real life. Derek tilts his head and reads the title when Stiles marks his page and closes it. “<i>Dune?</i> Is it any good?”</p>\n<p>“Freaking great,” Stiles responds. “I can’t seem to put it down.” He drops the book to the grass beside him without a thought. “What’s up?” Derek’s wearing a baseball cap, a t-shirt, and jeans cut off at the knee. He looks comfortable, but his smile doesn’t quite reach his eyes.</p>\n<p>Derek shrugs. “Saw you out here, thought I’d come bother you for a bit.”</p>\n<p>“You never bother me,” Stiles says. </p>\n<p>“I haven’t really talked to you in like a week. How’s it going?”</p>\n<p>“Same. Not much happens in the land o’ Stilinski.” Stiles drops back onto the grass, basking in the sun. “Ready for the championship?”</p>\n<p>“Fucking terrified,” Derek admits, mirroring his action. “I keep trying not to think too much about it. It’s next Friday…how is that even possible?”</p>\n<p>“You’ll knock ‘em dead,” Stiles says. “You’ll knock them all out of the park, and then one straight at Jackson’s head just for me.” Stiles grins, and Derek laughs. </p>\n<p>“I’ll try my best.” When he turns back to Stiles, there’s a light in his eyes that wasn’t there a moment before. Stiles curses whatever has been making Derek look so down, and just tries to do everything in his power to make Derek laugh.</p>\n<p>They talk for awhile before a small, expensive red convertible comes down the street. Stiles frowns. <i>Jennifer.</i> Stiles doesn’t miss the way that Derek’s mirth and relaxation is instantly gone, replaced by the rigid set of his shoulders.</p>\n<p>“Well, I guess I’ll see you around Stiles.”</p>\n<p>“Yeah, guess so.”</p>\n<p>Stiles watches as Derek walks over and opens the passenger side door. As soon as Derek’s seated, Jennifer pulls him into a passionate kiss, and Stiles has to hold his tongue from shouting something rude. When she wraps her arms around Derek’s shoulders, Jennifer glances at Stiles and smirks. </p>\n<p>Stiles just shakes his head. If Jennifer sees him as a threat, she’s got bigger problems than he does.</p>\n<p>*</p>\n<p>Stiles gets stuck closing with Isaac Friday night because Erica is on a date with Boyd. “She’s been telling me all about their dates,” Isaac tells Stiles as he sweeps. “I did not need to know that much detail about their sex life.”</p>\n<p>Stiles shudders. “Boyd’s my bro, but I have no desire to think about him and Erica…” </p>\n<p>“I know.” Isaac flips through the records, trying to choose. “What should we listen to as we close?” Stiles doesn’t have a preference, so Isaac puts on a Boston album while Stiles starts going through their nightly closing routine. They spend twenty minutes dancing around the store instead of working. Stiles turns the broom into a guitar and Isaac plays drums on the counter, and by the end of side A of the record, they’re laughing and having a good time.</p>\n<p>Stiles locks the door, and when he returns to the counter, Isaac doesn’t look like he’s ready to go.</p>\n<p>“Got any plans tonight?” Isaac asks. Stiles shakes his head. “I thought we could just hang for a bit.” Isaac pulls out a small bag of marijuana, and Stiles stares at it. He’s never smoked weed before, and he bites his lip uncertainly. “You don’t have to, it’s cool man. No pressure. You can just sit and chill if you want.”</p>\n<p>“No, it’s not that,” Stiles says, turning the overhead lights off as they walk into the back room. “Just, sheriff’s son here. No one’s ever offered me drugs before. I kinda have always wanted to see what the big deal was.” There’s an old sofa along the wall, and Stiles drops onto it as Isaac puts a record on the ancient record player. He hears the familiar scratch before notes come out. He can’t put his finger on it, but he knows the song from somewhere.</p>\n<p>Isaac sits beside Stiles, and Stiles watches him as he pulls an already rolled joint from the bag. “You sure about this?” Isaac asks. Stiles nods, and Isaac puts the end between his lips and lights the tip. After he takes a hit, he hands it to Stiles.</p>\n<p>Stiles takes it from Isaac hesitantly and puts it between his lips. He takes a tentative inhale, and immediately starts coughing. Isaac just laughs and hits him on the back. “You’ll get used to it. Easy now.”</p>\n<p>Stiles finally inhales without coughing, and after a few minutes, he starts to feel a lightness in his head and body. He just lays back against the couch, staring at the far wall, listening to the music. After a few songs, Stiles finds himself grinning. “<i>Summer Breeze</i>, this is Seals and Croft.”</p>\n<p>“Yep,” Isaac says, lounging on the couch beside Stiles.</p>\n<p>“This shit is so lame,” Stiles giggles, and now that he’s started, he can’t stop. “This is some bad FM shit right here.”</p>\n<p>“Don’t knock this record,” Isaac says. “It’s a perfect background for a good high.”</p>\n<p>Stiles giggles again, but he finds himself totally digging the music. Something about it is soothing and familiar. “This is the greatest album ever.”</p>\n<p>“Five seconds ago it was lame,” Isaac says.</p>\n<p>“Dude, that was like five minutes ago.”</p>\n<p>“Seriously, it was like thirty seconds.” </p>\n<p>Stiles lifts his head and digs in his pocket for his cell phone. They’ve only been sitting there for like fifteen minutes. “Dude, just…dude.” He giggles again.</p>\n<p>“You’re a fucking lightweight,” Isaac says, laughing.</p>\n<p>“How strong is this shit?” Stiles asks. “It’s like I’m in a time vortex. Like, time has stopped and we’re just floating in a loop of <i>Summer Breeze</i>.” Stiles starts singing along. He closes his eyes and lets the music roll over him, through his limbs until he’s filled with it. “This is the greatest song ever recorded.”</p>\n<p>“You’re so fucking high,” Isaac laughs.</p>\n<p>“My mom loved this album,” Stiles says. “She used to listen to Seals and Croft all the time.” He smiles, though it’s accompanied by a familiar ache. “I haven’t heard this song since she died. It’s like she’s right here with me, listening to the song and singing along.”</p>\n<p>“Deep shit, man.”</p>\n<p>They sit like that for a few more songs, and then Stiles rearranges himself so he can look at Isaac. “You’re attractive, you know that?”</p>\n<p>Isaac snorts. “Yes.”</p>\n<p>“Like, not all dudes can pull off scarves, but like, you make it <i>work</i>.”</p>\n<p>“You could probably wear scarves.”</p>\n<p>Stiles shakes his head. “Hoodies is about the extent of my fashion statement. Oh, that and plaid. I should totally have been a teenager in the 90s. Grunge and stuff.”</p>\n<p>Isaac snorts and pushes himself off the couch. “You make me wanna listen to Bush.”</p>\n<p>“Bush…good band,” Stiles says. “Gavin Rossdale is <i>hawt</i>, still hot as fuck. I’d do him.”</p>\n<p>“DILF?” Isaac asks. </p>\n<p>“Totally.” Stiles grins widely and laughs at nothing. Isaac puts on the vinyl version of <i>Sixteen Stone</i> and sits back down. </p>\n<p>“You wanna make out?” Isaac asks. Stiles just blinks at him hesitantly. “Look, I know you’ve still got a major hard-on for Derek, but I’m high, and I like kissing, and I like you. It doesn’t mean we have to fuck or date or anything. I just like kissing when I’m high.”</p>\n<p>Stiles nods. “Okay then.”</p>\n<p>Isaac scoots closer and cups the side of Stiles’ face, and Stiles watches from what feels like a million miles away as Isaac leans down and kisses him. His lips are soft and warm, and Stiles doesn’t exactly know what he’s feeling. His brain is fuzzy like cotton, and fuck, Isaac’s mouth feels good against his. He grabs the front of his sweater and tugs him against him, and Isaac’s body on his feels good, too. </p>\n<p>They kiss for a long time, just tongues and lips and a few hands sliding across chests and asses. It’s pleasant, and Stiles feels a contented warmth spreading through him. But something is missing. Not that Isaac isn’t hot as hell, or a fucking fantastic kisser…it’s just not who Stiles wants to be kissing. </p>\n<p>But Stiles is a seventeen year old boy, and this is the most action he’s gotten…ever. So he’s not going to call it off. For as much as he knows, this could be the last person he kisses until college, and he’s going to get his kiss on.</p>\n<p>So, Stiles repositions himself on his back, pulling Isaac on top of him. It’s not ideal, but it’ll do for now.</p>\n<p>*</p>\n<p>They kiss for over two hours. When they stop, Stiles’ lips are tingling and he’s half hard. Isaac just sits up, lights another joint, and goes on talking like they didn’t just spend the last two hours getting intimately acquainted with each other’s tonsils.</p>\n<p>“Want a ride home?” Isaac asks as they exit the store awhile later. Stiles looks down at his skateboard, still flying high. </p>\n<p>“Probably a good idea.” Stiles stops though, and looks at Isaac. “Should you be driving? Cause while I’m ironically high as fuck, still a sheriff’s kid here. Driving under the influence is a big no-no.”</p>\n<p>Isaac leads them over to his car. “I do this a lot more than you do,” Isaac says as he gets into the front seat and leans across to unlock Stiles’ door. “I’m not nearly as high as you.”</p>\n<p>They argue about upcoming movies on the short ride to Stiles’ house. Stiles’ dad is thankfully not home, so Isaac rolls to a stop at the curb. </p>\n<p>“This was fun,” Stiles says. “You’re a good kisser.”</p>\n<p>Isaac smiles. “So are you.” Stiles gets distracted when he sees Derek’s Camaro pull in next door. Isaac says, “Go, your boyfriend just got home.”</p>\n<p>“Not my boyfriend,” Stiles grumbles.</p>\n<p>Isaac laughs quietly and shakes his head. “See you later, Stiles.”</p>\n<p>Stiles gets out of the car, but has some trouble removing his skateboard from the backseat. As Isaac pulls away from the curb and Stiles starts towards the house, he catches sight of Derek crossing the yard to him.</p>\n<p>“Was that Isaac?” Derek asks, nodding towards the retreating car. Stiles nods. “Are you two a thing now?”</p>\n<p>Stiles shakes his head, but then starts giggling. For some reason, it’s the funniest thing ever that Derek asks if he and Isaac were a thing.</p>\n<p>Derek comes closer and peers at Stiles through narrowed eyes. “Are you high?” He leans closer and stares into Stiles’ eyes. “You so are!” </p>\n<p>Derek looks completely scandalized, so Stiles starts giggling anew and sways into Derek. “Ssh,” he whispers, though he doesn’t lower his voice. “Don’t tell my dad.” Once he’s leaning against Derek’s shoulder, he just stays there. His forehead is pressed against Derek’s clavicle and he’s just laughing. God, Derek smells good, he thinks. He tilts his face up and sniffs at Derek’s neck in between giggles. Stiles just laughs harder that he spent the evening with his face and tongue on Isaac’s neck, but here he is, wanting nothing more than to kiss and lick Derek’s neck instead. Or just snuggle. He’d be content to just snuggle Derek for the rest of his life.</p>\n<p>This might be irony, he thinks. </p>\n<p>“Stiles?” Derek asks. Derek’s voice rumbles beneath Stiles’ ear, a pleasant sound.</p>\n<p>“I made out with Isaac,” Stiles finally says, though he doesn’t move away from Derek. Derek is warm, and solid, and Stiles is pretty sure if he moves his legs will give out. Derek’s shoulder might just be the most comfortable place his head has ever laid.</p>\n<p>“Oh,” Derek says. “I didn’t expect that. Congrats. I told you you’d get a boyfriend.”</p>\n<p>Stiles slaps Derek’s chest, and then leaves his hand there. Although Derek’s chest is muscled, it just feels soft beneath Stiles’ touch. “Not my boyfriend.” He starts giggling again. “We just made out. People do that, apparently, without sex or dating and stuff.” Stiles shrugs. “Who knew?”</p>\n<p>“Yeah, I’ve done that.” </p>\n<p>Stiles pushes himself off of Derek and looks at him glassy-eyed. “Who did you casually make out with?”</p>\n<p>“Paige.”</p>\n<p>Stiles starts giggling again. “The girl from band who plays the cello?” He giggles some more. “She’s cute.”</p>\n<p>“Yeah, she is,” Derek says with a smile. </p>\n<p>“It was my first kiss, you know,” Stiles says, leaning back into Derek because Derek doesn’t seem to mind. Derek’s arm is around his waist, supporting him, his fingers resting lightly on his hip. </p>\n<p>“I didn’t know that.”</p>\n<p>Stiles nods and picks idly at the buttons on Derek’s Henley. “It was fun, kissing is awesome, you know?”</p>\n<p>“I do.”</p>\n<p>“It’s just,” Stiles sighs and closes his eyes. He inhales Derek, and knows in that moment there’s no one else. If there was no Derek Hale, then Isaac would probably be perfect. But of course, there will always be Derek Hale, and right now Derek is it for him. </p>\n<p>Being wrapped up in him isn’t helping matters, either. He never knew it would feel so perfect with Derek. It just throws what he did with Isaac in stark contrast. “Isaac’s cool, but there’s not much there. I just want,” <i>you</i>, he finishes in his head. Out loud, he says, “Something amazing.”</p>\n<p>“You deserve something amazing,” Derek says.</p>\n<p>“So do you,” Stiles murmurs, and Derek doesn’t disagree. A moment later, Stiles’ brain catches up with what his body is doing, all but cuddling with Derek, and he pushes away, shaking his head. He feels totally pathetic, hanging all over Derek like some lovesick teenager. He shouldn’t be acting like that, regardless of whether or not he actually is. “I’m so stupid,” Stiles mutters. “She was totally right, you probably just pity me.” Stiles takes an unsteady step away. “I’ve embarrassed myself enough. I’m going inside now.”</p>\n<p>“Stiles, wait, what?” Derek asks, following Stiles. He reaches out and grabs Stiles’ arm. “Who said I pitied you? What are you even talking about? You’re not making a lot of sense.”</p>\n<p>“Probably the weed.”</p>\n<p>Derek rolls his eyes. “Focus. I don’t pity you. Who said I did?”</p>\n<p>Stiles just stares at Derek, because that definitely was not supposed to come out. “Um…”</p>\n<p>“Fucking Jennifer,” Derek growls. </p>\n<p>“I didn’t say that.”</p>\n<p>“You didn’t have to.” Derek steps closer and looks at Stiles closely. “There’s nothing for me to pity about you. You’re awesome.” Stiles snorts and sways, ending up leaning against Derek again. He places his palm flat against Derek’s chest and lightly fingers the soft cotton of his shirt. “I’m serious. You’re smart, funny, and always there when I need you.”</p>\n<p>“I’m like a dog,” Stiles jokes as he relaxes into Derek again, his head drifting back to Derek’s shoulder. Derek punches his arm. “Ow! Fucker.”</p>\n<p>“Stop being such a fucking tool. I’m sick of your self-deprecation.”</p>\n<p>“Okay,” Stiles says, closing his eyes. He’s tired, and warm, and right now he’s completely happy curling against Derek. </p>\n<p>“Stiles, are you falling asleep?”</p>\n<p>“Nope,” Stiles murmurs.</p>\n<p>“Really? Come on,” Derek wraps his arm around Stiles’ waist again, this time tighter, and Stiles snuggles into him. Everything about this feels <i>right</i>and <i>perfect</i>, like Derek’s arms were made just for Stiles to fit into. </p>\n<p>“Keys?” Derek asks, and Stiles digs into his pocket to pull them out. Derek unlocks the door and leads Stiles upstairs to his bedroom. Stiles plops face first onto the bed, and he notices remotely that Derek is removing his shoes. </p>\n<p>“Thank you,” Stiles mumbles against the bed.</p>\n<p>“For what?” Derek asks softly.</p>\n<p>“For being you.”</p>\n<p>*</p>\n<p>Stiles wakes up Saturday morning before his alarm and just lies in bed. </p>\n<p>He got kissed last night. He made out last night, with Isaac. He has no longer <i>never been kissed</i>. Stiles Stilinski has been kissed and more kissed. His fingers go to his neck where Isaac had licked and kissed (but thankfully no hickey), but there’s no tingles, no butterflies in his stomach. He thinks about kissing Isaac again, but all that excites him is the <i>idea</i> of kissing, not the person.</p>\n<p>But Derek…Stiles thinks about what happened after Isaac dropped him off. Stiles closes his eyes and remembers the way it felt to lean against Derek’s body, draw comfort from his warmth; remembers the way it felt to have Derek’s arm around his waist. There’s a bit of mortification burning in his belly, but there’s an annoying voice behind him that keeps saying that Derek didn’t seem to mind. He ignores that voice, because that voice is stupid. </p>\n<p>At work, things are normal between him and Isaac. Isaac doesn’t treat him any differently, and doesn’t bring up what they did the night before. Stiles appreciates that, appreciates that he could have casual make out sessions without it meaning something. The last thing he wanted was another confusing relationship in his life.</p>\n<p>On Monday morning, Stiles tells Scott about Friday. “Why do you always have all the fun?” Scott asks. “I’ve never smoked pot to lame 70s music and gotten high and made out.”</p>\n<p>Stiles rolls his eyes. “Dude, you have sex on a regular basis. I am hardly having any more fun than you have.”</p>\n<p>“Still could have called,” Scott pouts. “I want us to get high and do cool stuff, like play video games and watch movies.”</p>\n<p>“And we will,” Stiles claps Scott on the shoulder. “What do you think college is for?”</p>\n<p>“I guess.”</p>\n<p>“Plus, remember that you have the state championship this weekend. You can’t be off your game.”</p>\n<p>Scott huffs. “We are so partying hard on Saturday night whether we win or lose.”</p>\n<p>“Dude, of course. There’s a bottle of tequila with our names on it.”</p>\n<p>Scott grins.</p>\n<p>*</p>\n<p>Monday night, Stiles looks up from his homework when a red laser point shoots across his book. He glances through his window and sees Derek at his bedroom window, holding a laser pointer and grinning. Stiles gets up and walks to the window. Derek holds up his board.<i>HEY</i></p>\n<p>Stiles smiles and responds, <i>HEY.</i></p>\n<p>\n<i>I have something for you. Come over?</i>\n</p>\n<p>Stiles nods, tells his dad he’s going over there, and then knocks on Derek’s front door. Peter opens the door, grinning widely.</p>\n<p>“Stiles, my favorite non-relative teenager,” Peter says, ushering Stiles in with a hand on his shoulder. “How glad I am to see you.”</p>\n<p>“Nice to, uh, see you too,” Stiles says awkwardly. </p>\n<p>“Derek didn’t tell me you’d be visiting,” Peter says, leading Stiles into the kitchen. “Though you are free to join us for dinner.” He points to a spread of raw vegetables and other unidentifiable foods on the table.</p>\n<p>“I’ve already eaten, but uh thanks,” Stiles smiles.</p>\n<p>Peter smiles and pauses to just look at Stiles. “I can’t tell you how glad I am that you and Derek have been spending more time together. He’s been kind of down lately, but he smiles more when he’s been with you.”</p>\n<p>Stiles just blinks, because what’s he supposed to do with <i>that?</i></p>\n<p>“You’re good for him,” Peter says, cocking his head to the side and eyeing Stiles like he knows <i>exactly</i> how Stiles feels about Derek. “You always have been.”</p>\n<p>“Uh,” Stiles says, because this conversation isn’t what he expected. But Derek comes down a moment later, dressed in basketball shorts and a wife beater.</p>\n<p>“There you are,” Derek says with a wide grin. “Is Peter trying to get you to eat his weird raw food?”</p>\n<p>“Derek, it’s healthy. It cleanses the body, and the mind,” Peter says, waving his hands from his head all the way to his legs. “Packaged food clogs your soul, and cooking drains the life from the food. Man was not intended to have fire, they were intended to fear fire and live off only what the earth gives them. The moment you cook food, it devitalizes it. You basically destroy through cooking.” He gives them both a placid smile, and Stiles looks at Derek. Derek’s just staring at Peter like he’s a weirdo.</p>\n<p>“Sure, Uncle Peter, whatever you say.”</p>\n<p>Peter shakes his head with a fond smile. “Ah, the blissful ignorance of youth! Go, enjoy yourselves while you are young.”</p>\n<p>Stiles follows Derek out of the kitchen and up to his bedroom. Stiles glances at Cora’s closed door when they walk by her room, loud rock music blaring from inside. Derek closes his door behind them, and gives Stiles an apologetic smile. Stiles just laughs. “He’s such a weirdo.”</p>\n<p>“Right?” Derek laughs, shaking his head. “I thought I was just being overly critical.”</p>\n<p>“No, dude’s seriously whack.” Stiles chuckles as he walks around the edge of Derek’s room, stopping in front of all his baseball trophies. They read things like MVP, Region Champ, Highest Home Run Average, and Most Sportsmanlike. Stiles reaches out and picks up the High School All-Star trophy from last year. “That game was incredible,” Stiles says quietly. “That double play you helped with, and those two home runs? That pitcher was such a smug asshole until you showed him.”</p>\n<p>“Best night of my life,” Derek grins. “That was the game, that was the game where I thought, ‘Hey, I might actually be able to do this.’ It was an amazing feeling.”</p>\n<p>“Just think,” Stiles says, carefully setting the trophy back on the shelf, “Soon you’ll have a state championship to add to this and a scholarship to boot. Before you know it, you’ll be playing for the minor leagues, unless you get drafted by the MLB straight out of college.”</p>\n<p>Derek smiles, staring at Stiles for a beat too long. “How do you have that much faith in me? My own family doesn’t even have that much faith in me.”</p>\n<p>Stiles shrugs. “Someone’s got to, because it’s true.”</p>\n<p>Derek goes over to his desk, and Stiles feels that familiar tingling he’s started to get around Derek in his lips and fingers. He sighs and sits on the bed. Derek hasn’t mentioned Stiles’ behavior the other night, and Stiles is glad because he was mortified enough that Derek witnessed it in the first place. He would have died if Derek would have mentioned it to him.</p>\n<p>“I made you something,” Derek says, grabbing an object from his desk. He hands it to Stiles. </p>\n<p><b>DEREK’S I’M SORRY MIX</b> is scrawled on a burned CD.</p>\n<p>Stiles looks up at Derek. “You don’t have anything to be sorry for.”</p>\n<p>“I still feel bad for the Ennis thing,” Derek says, sitting beside Stiles on the bed. “It should have been titled ‘Derek’s I’m-Sorry-And-Thank-You-For-Being-So-Awesome-and-Supportive-To-Me Mix,’ but that didn’t fit.” Stiles laughs, his face nearly breaking with his grin. “You deserve more than a CD, Stiles, but this is all I have.”</p>\n<p>“It’s perfect,” Stiles says as he stares down at Derek’s handwriting across the silver disc. </p>\n<p>*</p>\n<p>Stiles goes home and listens to the CD on repeat, puts it on his iPod and listens to it all day at school the next day. </p>\n<p>The songs aren’t new or hip, mostly classic stuff and songs they’ve listened to together for years, but Stiles can’t help but smile as each song switches to the next. Even the songs Stiles doesn’t like that much, or had thought were lame before this, have a different meaning.</p>\n<p>Derek’s made him numerous CDs over the last three years, but something about this one feels different. Stiles feels like maybe there’s some hidden message in the words, in the song choices.</p>\n<p>Stiles thinks he’s probably just crazy. But he keeps looking anyway.</p>\n<p>*</p>\n<p>Stiles isn’t surprised when he hears the knock on the door Tuesday night. It’s after ten p.m., and his dad is asleep in the recliner with an empty whiskey glass beside him. Stiles quietly walks through the house and opens the door.</p>\n<p>Derek’s standing on the porch, looking wrecked. His eyes are red and puffy, with dark circles underneath them. He looks like he hasn’t brushed his hair, and he might be wearing the same clothes from the night before. But none of this surprises Stiles, just like he wasn’t surprised when Derek missed school earlier today.</p>\n<p>Without a word, Stiles steps aside and lets Derek enter. Derek goes through the house, leaving Stiles behind to grab his dad’s bottle of whiskey. Stiles finds Derek outside the attic window, sitting on the roof. Stiles sits down beside him and hands him the bottle. Stiles doesn’t drink anything, just lets Derek take as many sips from it as he needs.</p>\n<p>The reason none of this surprises Stiles is because three years ago tonight, Derek’s parents were killed in a car crash. This has become their ritual, Derek showing up at Stiles’ door looking wrecked, and Stiles sitting on top of the roof with Derek well into the night.</p>\n<p>Stiles doesn’t know what Cora or Laura do on this night. He just knows that Derek misses school to drive out to the cemetery, and then he shows up at Stiles’ door. </p>\n<p>Derek doesn’t hold back the tears, and Stiles doesn’t say a word as Derek sobs beside him. Derek’s never tried to hide his grief on this night, is all smiles the day before and the day after, but this night is raw and vulnerable, the only thing swallowing the sounds of his sobs the silence and the stars. Stiles understands at least half of the pain Derek feels, faces the same thing on a fall day each year. And Stiles can’t help but think about his mother, to grieve for her as much as he grieves for Derek’s loss. Stiles doesn’t try to offer Derek any comfort, because if the last eight years has taught him anything, it’s that nothing can fill that void. You just have to deal with it your own way. Stiles’ way is through avoidance; this is Derek’s way.</p>\n<p>Derek’s sobs taper off after awhile and he just sits there quietly beside Stiles. Without looking at Derek, Stiles reaches out beside him and takes his hand.</p>\n<p>Derek turns his hand over and threads their fingers together and squeezes.</p>\n<p>*</p>\n<p>“Vote Lydia Martin for Prom Queen!” Stiles says as the people go past the table. He holds out the small bundle of lollipops tied with a red bow and a VOTE FOR LYDIA label.</p>\n<p>“More conviction!” Lydia snaps. “These people have to feel your enthusiasm.”</p>\n<p>“Dude, seriously?” Stiles asks. “I can’t get more convicted that this.”</p>\n<p>“Unless they put you in jail,” Scott says, then starts laughing at his own joke. Everyone at the table groans, including Allison. “What? I thought it was funny.”</p>\n<p>“Your jokes suck,” Stiles says before grabbing a handful of lollipops. “Vote for Lydia!” </p>\n<p>“Yo, freshman,” Cora barks out. A freshman boys turns to her, eyes wide in fear. “Vote Lydia for Prom Queen.” She hands the kid a bundle of candy. “Otherwise I’ll pummel you.”</p>\n<p>“Cora!” Lydia exclaims. She turns to the freshman and gives him a dazzling smile. “She’s just joking, of course. My friends, such tricksters.” Lydia shakes her hair with a laugh, then leans forward and kisses the freshman on the cheek. “Vote Lydia.”</p>\n<p>“Yes ma’am,” the boy says, nearly tripping over himself as he touches his cheek.</p>\n<p>“You’re an evil vixen,” Stiles says. “I’m terrified of you. You and Allison.”</p>\n<p>“Hey!” Cora exclaims, punching his arm hard. </p>\n<p>“Owwww,” Stiles groans, rubbing his arm. “I’m always terrified of you.” Cora smiles, obviously pleased. “What is it with you and Derek and punching me?”</p>\n<p>“Why did Derek punch you?”</p>\n<p>“He told me I was being self-deprecating or something on Friday night. Fucker left a bruise, too.”</p>\n<p>“I didn’t know you were with Derek Friday night,” Cora says. “He had a date with Jennifer.”</p>\n<p>“I thought you were with Isaac,” Scott asks.</p>\n<p>“You’re dating Isaac?” Kira asks. </p>\n<p>“No.”</p>\n<p>“You made out with him,” Scott says.</p>\n<p>“You did what?” Allison says, leaning across Scott and grabbing Stiles’ arm. Stiles yelps again.</p>\n<p>“Seriously, fragile teenage boy here.”</p>\n<p>“As interesting as Stiles’ sudden love life is,” Lydia interrupts, pointing to the people filing by during their lunch period. “Can we please focus? We can talk about who Stiles makes out and spends his time with <i>after</i> I’m crowned prom queen.”</p>\n<p>A few minutes later, Derek walks up to their table. Stiles is surprised when Derek walks up to him, not Cora. The entire table, including Lydia, all turn to stare at them. Stiles’ cheeks heat with embarrassment.</p>\n<p>“Hey Stiles,” Derek says. He smiles at Stiles for awhile, before turning to everyone else. “Hey!” He leans over and pops Cora on the head. “Hey loser.”</p>\n<p>“Shut up, loser,” Cora replies, slapping Derek’s hand away.</p>\n<p>Derek turns back to Stiles and just looks at him, so Stiles says, “Vote Lydia?” He hands Derek a bouquet of lollipops. Derek takes them with a laugh.</p>\n<p>“She has you campaigning, huh?” Derek asks, reading the label covered in pink glitter. </p>\n<p>“Oh yeah,” Stiles says. “I think I should have partial custody of her crown if she wins.”</p>\n<p>“In your dreams,” Lydia sing-songs as someone approaches the table. Derek watches her, shaking his head. </p>\n<p>“I guess there’s no use in trying to sway the other side’s vote, huh?” Stiles asks. </p>\n<p>Derek shrugs. “Who knows? Weirder things have happened.” Derek takes one of the lollipops from the bouquet and unwraps it before sticking it in his mouth. Stiles stares open-mouthed as Derek sucks on it until Kira elbows him in the ribs. </p>\n<p>“Did you want something?” Stiles blurts. Derek takes one of the remaining lollipops out of the bouquet and hands it to Stiles.</p>\n<p>“Peach is your favorite, right?”</p>\n<p>“Don’t I get one?” Cora looks between Stiles and Derek. “What’s my favorite flavor, Derek?” she asks as Stiles takes the proffered candy. </p>\n<p>Derek shrugs. “How am I supposed to know?” he asks around the candy still in his mouth. “Cherry?”</p>\n<p>Cora smirks. “Not since I was like six.” Derek just shrugs again and turns his attention back to Stiles.</p>\n<p>“Can you come to dinner tomorrow?” Derek asks.</p>\n<p>“Huh?”</p>\n<p>“I want you to come to dinner tomorrow, I have a surprise,” Derek smiles, but immediately turns to Cora and points his finger. “Don’t ruin it.” Cora puts her palms up in surrender.</p>\n<p>“Are we having a Peter’s Raw Special?”</p>\n<p>Derek shakes his head. “I think we’re getting take out.”</p>\n<p>“Sold.” </p>\n<p>Derek grins.</p>\n<p>“Hale, what in the hell do you think you’re doing?” Ennis yells from down the walkway. Stiles doesn’t miss the way Derek groans and squares his shoulders. “Fraternizing with the enemy!”</p>\n<p>“Wow, Ennis, I didn’t know you knew any words that big,” Stiles says. Ennis turns his death glare on Stiles, and Cora and someone else punch him under the table. </p>\n<p>“Did you say something, Stalonzy?”</p>\n<p>“I’ll ask him if he drops by if he did,” Stiles grins cheekily. Derek puts a hand on his face and shakes his head.</p>\n<p>Ennis makes a show of making a fist and being generally aggressively intimidating towards Stiles before turning to Derek. “Seriously, Jennifer’s gonna flip when she finds out you were at this table with these losers.”</p>\n<p>“One of those people you just called a loser is my sister,” Derek points out.</p>\n<p>“Oh, really?” Ennis’ eyes scan the table’s occupants and land on Cora. “Her, right? Yeah, she’s kinda hot.”</p>\n<p>“Not if you were the last man on earth,” Cora drawls. </p>\n<p>Ennis grabs his crotch and tugs. “You’d be lucky to be with a real man like this.”</p>\n<p>“Hey, that’s my sister!” Derek exclaims as Cora makes fake vomiting noises.</p>\n<p>“Probably a frigid bitch in bed anyway,” Ennis shrugs. Stiles watches as Cora’s eyes flash, and Kira puts a hand on her shoulder to keep her from launching herself across the table at Ennis. But Derek pushes him instead.</p>\n<p>“Seriously, what the fuck? That’s <i>my sister!</i>”</p>\n<p>“Chill, Hale!” Ennis says, pushing Derek back. “What has gotten into you lately? Jennifer’s right, you’re acting all weird.” Ennis gives the table and then Derek a final disdainful look. “Whatever. Not worth my time. You can circle jerk with these losers all day for all I care, Hale.”</p>\n<p>“I <i>hate</i> that guy,” Scott says to Ennis’ retreating back.</p>\n<p>“Derek, your friends are assholes,” Cora says.</p>\n<p>“I’m so sorry about what he said Cora,” Derek says, still staring after Ennis with a deep frown.</p>\n<p>“You think I give a fuck what that Neanderthal thinks of me?” Cora asks. “But you need better friends than those assholes.”</p>\n<p>Derek sighs. “Cora, we’re not going through this again.” He gives a final wave to the table. “See you.”</p>\n<p>After Derek’s gone, Stiles turns to Cora. “What does he mean, again?”</p>\n<p>“It’s nothing,” Cora mutters, watching as Derek walks away. Then, she turns to Stiles and glances at the sucker he’s still holding. “Peach, interesting.” Her smirk is back.</p>\n<p>“It’s nothing,” Stiles says, turning towards a group of approaching seniors. “Vote Lydia!”</p>\n<p>“Mmhmm,” he hears Cora hum behind him.</p>\n<p>*</p>\n<p>Stiles messes with his hair the entire walk next door, wondering if the t-shirt and jeans combo is okay. He really has no clue <i>why</i> he’s going to Derek’s for dinner, so he put on his nicest jeans and favorite t-shirt and figures that will be okay.</p>\n<p>Cora opens the door, all grin. “Oh no,” Stiles asks, taking a step back. “You didn’t bring me over here to kill me or something, did you? You look way too happy.”</p>\n<p>“Get in here,” Cora says, grabbing Stiles’ hand and yanking him inside. Stiles allows himself to be pulled into the living room. Where he sees Derek sitting on the couch, and Laura sitting in an armchair.</p>\n<p>“Laura!” Stiles exclaims, running across the room and jumping into her lap. She emits a soft <i>”oof!</i>” as Stiles hugs her. “You’re home!”</p>\n<p>“Stiles,” Laura protests and tries to push Stiles off of her, but Stiles just rearranges himself until he’s fitted into the space between Laura and the chair. She looks slightly uncomfortable, but they’ve been doing this for years. Laura is weird about personal space, doesn’t like people touching her too much, but Stiles has no concept of personal boundaries. Plus, she’s basically the sister he never had. It only takes about thirty seconds of a pinched face before Laura sighs and relaxes slightly. Stiles grins and kisses her on the cheek. She rubs at it like he’s got cooties. </p>\n<p>“I’ve missed you,” Stiles beams, then turns to Derek. “This was my surprise?”</p>\n<p>Derek nods. “I was going to tell you, but thought I’d surprise you instead.”</p>\n<p>Stiles snuggles closer to Laura, who pushes him away. “My own Laura-shaped surprise.”</p>\n<p>“Stiles, really,” Laura says. “Get a hold of yourself.”</p>\n<p>“You can’t blame me,” Stiles says, straightening up. “I haven’t seen you since Christmas. How’s school?”</p>\n<p>“Terrible,” Laura replies. </p>\n<p>“Why?” Stiles asks, concerned.</p>\n<p>“All these guys want to sleep with me,” Laura complains. “They keep asking me out, and some of them ask if I’m DTF. You know, down to fuck.”</p>\n<p>Stiles just blinks at her. “I fail to see how this is a problem.” From beside him, Cora slaps him across the back of the head. “Hey! What’s that for?” Cora stares at him pointedly, but Stiles is still completely lost, so he turns back to Laura and asks, “So, why’s this a problem?” Cora sighs behind him.</p>\n<p>“None of these guys care a thing about what I’m interested in or what I do,” Laura says. “They’re just interested in the way I look and want to get into my pants. Apparently, I’m considered a hot chick.”</p>\n<p>“Well, duh.” Cora slaps him again. “Ugh, seriously, Cora?”</p>\n<p>“I’m just not interested in any cock that comes my way,” Laura says.</p>\n<p>“I don’t think I need to be here during this conversation,” Derek groans, covering his face with his hands. Laura rolls her eyes and Stiles snorts.</p>\n<p>“I went on a few dates with some of those guys,” Laura says. “And it was all the same. I’d try to make conversation, talk about the latest book I was reading or something interesting I learned for a research paper I wrote, and they’d just stare at me like I wasn’t even speaking English. When I asked one guy what his favorite book was, he said he didn’t read, can you imagine? What do you talk or think about if you don’t <i>read</i>? And then another guy, he said <i>The DaVinci Code</i>!” Laura huffs. “Ridiculous. I find more pleasure from sitting in my dorm room on a Friday night than conversing with a bunch of idiots who think Dan Brown is great literature.”</p>\n<p>Stiles throws his head back and laughs. God, how he’s missed Laura. “You still could have slept with them anyway,” he finally says.</p>\n<p>“Not everybody wants sex.”</p>\n<p>“I disagree.”</p>\n<p>Cora says, “Me, too.” She shrugs. “But we’re a bunch of virgins.”</p>\n<p>“I’m a virgin, and I’m perfectly happy to wait until some guy mentally stimulates me before I hop into bed with him.”</p>\n<p>Stiles chuckles and elbows Laura lightly. “Mentally stimulates you.” Laura sighs and rolls her eyes.</p>\n<p>“Yeah, but you’re Laura and in a committed relationship with you books and headphones,” Cora says. “Some of us, like me, still have our V-card, but definitely not for a lack of trying.” Stiles nods sympathetically.</p>\n<p>“Whoa, whoa, wait,” Derek cuts in, “who have <i>you</i> been trying with?”</p>\n<p>Cora huffs and crosses her arms over her chest angrily. “None of your business.”</p>\n<p>“Oh, it is my business,” Derek says. “I swear, I will kick some guy’s ass if he’s been trying to get in your pants.”</p>\n<p>“Didn’t you hear a word I just said, Derek?” Cora snaps. “Virgin here! <i>No one</i> has been in my pants.” </p>\n<p>“Good,” Derek says in relief, and Cora flips him off.</p>\n<p>“Why are you the only one that gets to have sex?”</p>\n<p>“Yeah, Derek,” Laura asks, nudging Stiles in the side and grinning. “Seems like a huge misogynistic double standard that you can have sex with Jennifer, but Cora can’t have sex without you flipping out.” Stiles shakes with silent laughter. He forgot how hilarious it was to watch Cora and Laura gang up on their brother.</p>\n<p>“But, she’s my sister,” Derek grumbles. </p>\n<p>“Not your property,” Laura states.</p>\n<p>“Fine! Cora can have sex with whoever she wants, but the moment some guy breaks her heart or uses her, I’m going to fucking kill him.”</p>\n<p>Laura looks at Stiles and shrugs. “That’ll work for now, I guess.” Stiles laughs.</p>\n<p>But Cora just groans. “Just, butt out, Derek!” she yells, getting up from the couch and storming towards the door. Laura reaches out and grabs Cora’s arm. </p>\n<p>“Don’t storm off,” Laura says, refusing to let go when Cora tries to pull from her grip. “I never see you. You can be pissed off at Derek and the world another day.”</p>\n<p>Cora grunts but returns to the couch, kicking Derek as she passes. Stiles just laughs quietly.</p>\n<p>“So, in short, school is great, but the social aspect is disappointing,” Laura tells Stiles. </p>\n<p>Stiles nods sympathetically. “Yes, that sounds horrible. Except, you know, the whole everyone wanting to sleep with you part. That part sounds awesome.”</p>\n<p>Laura sighs and shakes her head.</p>\n<p>“Anyway, it’s nice to be home for the summer,” Laura says, smiling at her siblings. “Especially this week.”</p>\n<p>Stiles looks away awkwardly, letting the Hale’s have their moment. It shouldn’t have surprised Stiles that Laura came home this weekend, not with this week being the anniversary of their parents’ death. He almost feels like he shouldn’t be here, doesn’t know why he is.</p>\n<p>“I’m not looking forward to driving two hours to sit through a baseball game,” Laura says.</p>\n<p>“Hey!” Derek tosses a cushion at Laura’s head, but it hits Stiles instead. Derek laughs. “Oops!” </p>\n<p>“Ass,” Stiles laughs as he chucks the pillow at Derek, clipping the table lamp. Derek looks at the lamp with wide eyes and a smile, then back to Stiles.</p>\n<p>“It’s not you, Derek,” Laura says. “Baseball is just so boring. You’re the only thing that makes it remotely passable, but I’m bringing a book and my headphones for when you’re not playing.”</p>\n<p>“Laura, really?” Derek whines. She shrugs, and Stiles sticks his finger in Laura’s ear. She squeaks, and Stiles starts tickling her.</p>\n<p>“Stiles,” Laura squeals, “I’m going to kill you!” </p>\n<p>Cora pulls out her cell phone and starts snapping pictures. Then, she comes over and slaps both of them. “Stop, do a selfie with me.” She holds out the phone and Stiles presses his head against Laura’s and smiles.</p>\n<p>“Hey! What about me?” Derek exclaims.</p>\n<p>“Then get your ass over here!” Cora yells.</p>\n<p>Derek pushes Cora out of the way and squeezes against Stiles’ other side, basically sitting in Derek’s lap. Stiles turns his face as Cora hits the button, and Derek is already looking at him. Their faces are extremely close together, and Derek’s eyes dart down quickly and then back to Stiles’ eyes. Stiles swallows, and thinks he spies a blush creeping on Derek’s cheek when Cora slaps the back of his head.</p>\n<p>“Turn to the camera, goober.”</p>\n<p>“You’re a goober,” Stiles mutters, grinning widely. Derek tilts his head until he and Stiles are pressed crown to crown.</p>\n<p>Stiles misses Derek’s heavy weight the moment he moves off the chair. Cora fools around on her phone while Laura, Derek, and Stiles talk more about her semester at school. </p>\n<p>“Posted!” Cora announces a few minutes later. “Those are the best. I look particularly awesome. Stiles, you can see straight up your nose in one of them. And Laura looks cross-eyed.”</p>\n<p>“What?” Stiles exclaims. Laura sighs when Stiles rolls on top of her so he can dig his cell phone out of his pants. He opens Instagram, where there are five consecutive photos. One of Laura and Stiles talking together in the chair, a selfie of Cora, one of Derek on the other end of the couch with Stiles and Laura in the background, then the selfie of the four of them. The last photo, though, is another group selfie, but this one has Derek and Stiles looking at each other, and maybe Stiles is imagining it, but the look on Derek’s face isn’t that different than the one on Stiles’, and Stiles is looking at Derek like he hung the moon.</p>\n<p>Laura glances over his shoulder, where he’s staring at the picture of him and Derek. She makes a soft noise, and Stiles quickly scrolls up his feed.</p>\n<p>“You cannot see up my nose,” Stiles mutters, “Much.” </p>\n<p>A few minutes later, Derek’s phone rings, and he stands. “Hey Jen,” he says, stepping out of the room. </p>\n<p>“Queen Evil Witch calls, shocker,” Cora says, tapping away on her phone. “Ironic I post pictures on Instagram and she calls just moments later.”</p>\n<p>Laura turns to the door Derek just walked through with a frown. They can hear Derek’s raised voice from the dining room. “What’s up with them?” she asks.</p>\n<p>“They fight every night,” Cora responds without looking up from her phone. “He spends more time on the phone with her trying to placate her fragile, inflated ego than he does doing anything else.”</p>\n<p>“They’ve been spending every afternoon together, too,” Stiles says. Laura raises an eyebrow.</p>\n<p>“No, they haven’t,” Cora says.</p>\n<p>“Yes, he has; he’s been coming home late,” Stiles says.</p>\n<p>“How do you know that?” Laura asks. Stiles flushes.</p>\n<p>“Only some of those are with Jennifer. He’s been spending a lot of time with Boyd, Danny, and Jackson.”</p>\n<p>“Really?” Stiles asks. </p>\n<p>Cora nods, knowing look on her face. “Yep,” she says, popping her p. “Queen Evil Witch hasn’t been happy about that, either.”</p>\n<p>“Huh,” Stiles says, staring at his feet as he considers what this means. He’d been under the impression that Derek had been spending more time with Jennifer. <i>Doesn’t change anything,</i> a voice in his head whispers.</p>\n<p>When he looks up, he finds Laura studying him carefully. He rolls his eyes. “Shut up.”</p>\n<p>“Didn’t say a word.”</p>\n<p>Derek returns a few minutes later. Cora sets her cell phone on the side table and asks, “What did the witch have to say?”</p>\n<p>Derek glares at her. “She, um,” Derek hesitates, looking over at Stiles. “She asked me why I didn’t invite her over when my sister came home but I invited Stiles.”</p>\n<p>“A little jealous is she?” Cora asks gleefully. </p>\n<p>“Cora, can you not?” Derek snaps. “I do not feel like listening to your bullshit on top of everything else.”</p>\n<p>“Derek, is everything okay?” Laura asks.</p>\n<p>“Fine.” He huffs as he sits back on the couch, and crosses his arms grumpily. “Jennifer’s coming over.”</p>\n<p>Stiles groans as he pushes himself out of Laura’s chair and ignores the feeling in his chest. “That’s my cue to leave.”</p>\n<p>“Stiles –” Derek starts.</p>\n<p> Laura interrupts, “ But I want to order pizza and watch <i>Masterpiece Theater</i> with you. You’re my friend, Stiles. I say you get to stay, despite what she thinks.”</p>\n<p>Stiles laughs. “Soon, I promise. Can’t have all the fun tonight, can we?” He pulls Laura into a hug. “We’ll have all summer. We’ve barely made a dent in the Alistair Cooke years.”</p>\n<p>“You’re going to Derek’s game, right?” she asks.</p>\n<p>“I wouldn’t miss it for the world.” </p>\n<p>“Fine,” Laura says, falling back into the chair. She turns to Derek and points her finger. “But if Jennifer touches me, I’m going to slap her.”</p>\n<p>“You let Stiles touch you,” Derek says as he gets up to walk Stiles out.</p>\n<p>“Because if I didn’t, he’d touch me anyway,” Laura says. “Plus, Stiles is, well…Stiles.”</p>\n<p>“Bye, Laura,” Stiles says, and he pushes gently on Cora’s feet hanging over the edge of the couch as he passes. “Bye goober. See you tomorrow at lunch.”</p>\n<p>“Later.”</p>\n<p>Derek and Stiles walk to the door in silence. When they’re out on the porch, Derek’s eyebrows are knit together when he says, “You don’t have to leave, you know.”</p>\n<p>“I know.” Stiles gives him a small smile. “But she is your girlfriend.”</p>\n<p>Derek’s brows draw tighter. “But you’re…”</p>\n<p>“What, Derek? What am I?” Stiles asks. His chest aches, because there’s a role Jennifer plays in Derek’s life he will never play, and she will always come before him, at least for now. It’s a painful revelation, but it’s true.</p>\n<p>“You’re Stiles,” Derek says helplessly, and he looks so vulnerable in that moment that Stiles almost grabs him and kisses him right there. But instead, he jogs down the steps and over to his house.</p>\n<p>*</p>\n<p>Around eleven, Stiles is in bed watching Netflix when he sees Derek’s light come on. He gets up to close the curtains because watching Derek and Jennifer is <i>not</i> on his to-do list. But when he gets to the window, he finds Derek waiting on him. Stiles waves.</p>\n<p><i>You okay?</i> Stiles writes.</p>\n<p>\n<i>Nervous about tomorrow. Tell me I won’t play badly.</i>\n</p>\n<p>Stiles pulls his chair over to the window and writes, <i>You’ve never played badly a day in your life.</i></p>\n<p>Derek smiles. <i>My biggest fan,</i> he scribbles.</p>\n<p><i>I expect you to sign my rookie card for free.</i> After Derek reads that, Stiles erases it and writes, <i>I plan to retire on what I’ll make off selling it.</i></p>\n<p>Derek laughs. <i>You’d sell it?</i></p>\n<p>\n<i>Hell yeah!</i>\n</p>\n<p>Derek’s face falls as he writes, <i>I really am nervous.</i></p>\n<p>Stiles tosses the whiteboard to the floor beside him. He grabs his cell phone and dials Derek. Derek looks around in confusion when his phone starts ringing, and he crosses to his dresser. </p>\n<p>“Whiteboard too much for you?” Derek asks as he sits on the edge of his bed.</p>\n<p>“I had too much to say,” Stiles says. “You have no clue how hard it is for me to condense things for that thing. I never say even a tenth of what I want to say.”</p>\n<p>Derek grins. “You mean, I’ve been missing that much Stiles for the past few years?”</p>\n<p>“Consider yourself lucky,” Stiles jokes. “Do you remember the first night we used the boards?”</p>\n<p>Derek nods. “We’d been here a week. I wouldn’t talk to you, but you saw me through your window and tried to get my attention, but I ignored you. So, you stood at the window holding a big piece of paper that said hello for probably hours.”</p>\n<p>“It was more like fifteen minutes,” Stiles says with a chuckle.</p>\n<p>“I think it was hours,” Derek argues. He laughs, then sobers and says, “I can’t believe tomorrow is the day.”</p>\n<p>“You’re going to do great,” Stiles says. “I know you will.”</p>\n<p>“It’s so terrifying, to know that my future rests on one game. One mistake and – “</p>\n<p>“You can’t think like that,” Stiles says. “These recruiters aren’t just interested in you because of tomorrow’s game. You’ve impressed them so much so far. Tomorrow will just be the icing on the cake.”</p>\n<p>“Feels like so much more.” Derek picks at something below the windowsill Stiles can’t see, and Stiles just lets him have a few quiet moments. “I told Jennifer about the recruiters tonight.”</p>\n<p>“Oh? What did she say?” Stiles asks.</p>\n<p>Derek looks up, and even from this distance, Stiles can see the pain on his face. “She said not to let that get to me, because if we lose, she might lose prom queen.”</p>\n<p>Stiles has to bite his tongue. Derek doesn’t need to hear the things that Stiles wants to say right now. The game comes first.</p>\n<p>“Prom queen, even the school, doesn’t matter right now. The only thing that matters is <i>you</i>, Derek.” Stiles leans forward and puts his palm on the glass. “You can do this, Derek. You <i>will</i> do this.” Derek nods, and Stiles says, “Please believe it.”</p>\n<p>“I believe <i>you</i>.”</p>\n<p>*</p>\n<p>As soon as school is over, Stiles sprawls in the backseat of Allison’s car while Lydia takes the front seat for their two hour drive south for the championship game. The game starts at 7:05, so they should arrive in plenty of time for food before they head to the field. Laura is driving Cora and Kira behind them, and even Erica is coming to see Boyd play.</p>\n<p>They end up with tickets along the third base line, which is perfect since that gives them a great vantage point of both Scott and Derek. Stiles sits between Allison and Laura, and when the Beacon Hills Cyclones jog out onto the field, their whole group stands and starts shouting while holding signs. The sign Stiles is holding reads, <b>GO MCCALL AND HALE!!</b> along with their jersey numbers. Scott waves excitedly when he gets to his base, and Allison blows him a kiss. Derek, however, is completely focused on the game, and doesn’t even glance their way.</p>\n<p>Stiles smiles; this is exactly where Derek’s headspace needs to be, in the game and focused on his goal.</p>\n<p>Jennifer and her pep squad start doing a cheer, and the crowd claps enthusiastically as the announcer calls out the Beacon Hills players’ names. Stiles cheers for every single one – except for Ennis. Then Jackson steps onto the mound and throws the first pitch. It’s a strike.</p>\n<p>Beacon Hills plays one of their best games ever. The other team is obviously good, but the Cyclones dominate through the first four innings. Derek hits a home run and a double, and Stiles and Allison go crazy when Scott hits a single that allows the player on third to run home and score. Even Laura abandons her book and headphones during the last two innings in favor of watching the game.</p>\n<p>Derek hits another home run in the bottom of the sixth, and Stiles grins as he watches the ball soar deep into right field. It’s an amazing feeling, watching Derek circle the bases, his face stoic in concentration. But Stiles can tell, from the set of his shoulders, to the way his feet fall against the dirt, even through his serious baseball player face, Derek is <i>beaming</i>. It’s there in his eyes.</p>\n<p>Stiles can’t take his eyes off Derek, because he makes everything look so effortless out there. This is everything Derek was born to be, he knows it deep in his gut. Derek was made for the diamond, and he’s stunning out there. He belongs on that field.</p>\n<p>Beacon Hills wins 6-2.</p>\n<p>The team lifts Derek and Jackson on their shoulders, because of Derek’s two home runs and Jackson’s fantastic pitching.</p>\n<p>As they carry Derek off the field, Stiles smiles so wide his face hurts.</p>\n<p>*</p>\n<p>Stiles is playing video games when he gets a text message after 1 a.m. from Derek. He pauses his game and swipes his phone.</p>\n<p>\n<i>I’m at your back door.</i>\n</p>\n<p>Stiles scrunches his face in confusion as he goes downstairs and opens the door. Derek’s on the other side, still in his baseball uniform, sweaty and covered in dirt. His hair has a flat ring around it from his hat, and Derek’s grinning from ear to ear.</p>\n<p>“I DID IT!” Derek exclaims, lunging forward and picking Stiles up in a bear hug. “I was fucking awesome!”</p>\n<p>“Yes, you were!” Stiles laughs as Derek puts him down. “You were amazing.”</p>\n<p>Derek rubs a hand over his face. “I can’t believe that just happened. It’s just…I kept hearing your voice in my head, telling me I could do it, and I just pushed everything else out.” He laughs. “I just got home. But I had to see you and tell you and thank you.”</p>\n<p>“There’s nothing to thank me for,” Stiles says. “You’re the one who played the best freaking game ever.”</p>\n<p>“You’re the reason I played so well. Without you, it never would have happened,” Derek says. He reaches out and grabs Stiles’ arm, and squeezes. “You’ll never know how much that means to me.”</p>\n<p>Stiles nods, and Derek drops his hand. “I better go get some sleep, I just had to see you before I went to bed.”</p>\n<p>Stiles smiles as he watches Derek shaking with excitement in front of him, and doesn’t move off the back porch for a long time after Derek’s already returned to his own house.</p>\n<p>*</p>\n<p>The celebration party is at Jackson’s parent’s pool house. They’re out of town and gave him permission to host the party as long as no one got arrested. Stiles is really hoping the cops stay out of it, too, because he does not feel like hiding in bushes tonight or facing the wrath of his father.</p>\n<p>Stiles arrives with Scott and Allison. The party is already in full swing, generic pop music coming from the speakers and the whole place smelling like stale beer.</p>\n<p>“Shots?” Scott asks them as they maneuver through the throng of people.</p>\n<p>“Shots,” Stiles nods as some guy bumps into him and spills beer on his shoes. “Definitely need shots to get through tonight.”</p>\n<p>Scott finds a bottle of tequila in the kitchen and brings it along with three shot glasses onto the patio. He starts to set them up when Stiles feels a hand land on his shoulder. The other person spins him around, and he comes face to face with Ennis. </p>\n<p>“You’ve <i>got</i> to be fucking kidding me!” Stiles exclaims.</p>\n<p>Ennis pushes Stiles, and he stumbles back into the table, knocking over one of the shot glasses. “Why is it every time I turn around,” Ennis starts, leaning close into Stiles’ face, “I see your pathetic, ugly face?” Ennis’ eyes are red, and his breath reeks of alcohol. He pushes Stiles again, making Stiles’ back dig painfully into the edge of the table. “When are you going to realize that nobody fucking likes you, because you’re an annoying little shit?”</p>\n<p>Stiles musters up all his courage, because <i>fuck this asshole</i>, and spits in Ennis’ face. “I don’t care what you think.”</p>\n<p>Everyone around him gasps in shock. He hears the murmurs, <i>Did you see that? Did Stiles just spit on him?</i>, and feels a moment of triumph. Fuck you, Ennis, fuck you and all your bullying, Stiles thinks.</p>\n<p>But his moment of triumph is short-lived. Ennis’ face screws up in a rage, and he literally bares his teeth and growls. Stiles seriously rethinks his decision as Ennis grabs his t-shirt and punches him. And, <i>owowowowowow</i>. A fist to the eye? Fucking hurts.</p>\n<p>“Fight!” Stiles hears from somewhere beside him. Because Stiles has no shame, he has his hands raised over his face defensively, trying to ward off any further attack. His eye is already throbbing, and he’s pretty sure it’s swelling up because he’s having difficulty opening it. He knows that if he tried to retaliate, he’d probably just break his hand on Ennis’ face if he even connected with it in the first place.</p>\n<p>Through his fingers, Stiles sees Ennis rear back, and he braces for the next punch. But it never comes. Hesitantly, Stiles peeks out from behind his fingers and sees Derek standing between him and Ennis.</p>\n<p>“Hale, why am I not surprised?” Ennis flexes his fingers, and Stiles sees Derek’s posture shift. “Saving your little boyfriend again?”</p>\n<p>“Fuck off, Ennis,” Derek barks. “If you so much as look at Stiles again, I’ll break your fucking nose.”</p>\n<p>“Yeah, I’m so scared of you, Hale. I’ll just beat the shit out of both of you, and then you’ll match!” Ennis laughs, and Stiles’ eyes grow wide as Derek yells and runs at Ennis, kneeing him in the gut.</p>\n<p>The two boys start fighting furiously, and Stiles doesn’t know whether or not to jump in and try to pull Derek away from Ennis or to run away before one of them accidentally kills him. He’s saved from needing to choose when Boyd and the twins rush up and pull the two boys apart.</p>\n<p>Ennis’ face is bleeding in multiple places, and Derek’s got a busted lip and bloody nose. Ennis spits blood on the ground.</p>\n<p>“That’s it, Hale,” he says. “You don’t know what you just did. You don’t know who you’re messing with! You’ll be a nobody.”</p>\n<p>Derek snorts, but then grimaces. “You know what? Fuck you. You’re nothing but a piece of shit. There’s only a few weeks of school left. What the <i>fuck</i> do I care if you hate me? I should’ve broken your nose years ago.”</p>\n<p>With that, Derek spins around and walks away. </p>\n<p>When he passes Stiles, he reaches out and pulls Stiles along with him. Stiles wordlessly follows. When they get to the front of the guest house, Derek swears. Stiles just stares at him, open-mouthed. </p>\n<p>“You broke his nose,” Stiles finally murmurs as Derek lifts up his t-shirt and wipes his bleeding nose. “You broke Ennis’ nose for me.”</p>\n<p>“He deserved it, the fucking prick.” Derek steps towards Stiles and gingerly takes his chin in his hands. He tilts Stiles’ head and frowns. He touches the tender skin around Stiles’ eye gently. “You’re gonna have a black eye.”</p>\n<p>“Really?” Stiles sighs. “I feel like I should be happier about this, my first black eye and all.” Derek smiles, and despite the blood and the light bruising, he still makes Stiles’ insides warm. </p>\n<p>“Stiles, oh my god, are you okay?” Scott yells as he runs up to them with Allison. “Dude, Ennis is so fucking pissed, but Lydia made Jackson kick him out! And Derek, you’re like a rock star!” Then Scott turns to Stiles while Allison hands Derek a wad of tissue. “Man, are you okay?”</p>\n<p>“Fine,” Stiles sighs. “Just a bit of wounded pride. Oh, and a black eye.”</p>\n<p>“Really?” Scott grins. “That’s so awesome!”</p>\n<p>“Scott!” Allison exclaims. </p>\n<p>“It would be awesome if it didn’t hurt like a mother,” Stiles groans.</p>\n<p>“I need to get you home,” Derek says, staring at Stiles’ eye.</p>\n<p>“Dude, not to say anything against your awesome show of masculine dominance back there, but you look a little rougher than I do. At least I’m not bleeding.”</p>\n<p>Derek shrugs. “It’ll heal. I’ll barely be bruised in the morning. We need to get something cold on that eye.” He grimaces. “Your dad is going to be so pissed at me.”</p>\n<p>“Dude, my dad is going to be pissed at <i>me</i>,” Stiles groans.</p>\n<p>“I can take him home,” Scott offers.</p>\n<p>“Nah, enjoy the party,” Derek says with a smile. He holds out his hand, and he and Scott do their not-so-secret baseball handshake. </p>\n<p>Scott turns to Stiles. “But…tequila shots.”</p>\n<p>Stiles gives Scott a loose hug. “Soon, man. We’ve got all summer to lie around drunkenly and play video games.”</p>\n<p>Scott gives him a goofy grin. “Yeah.”</p>\n<p>Allison waves as she drags Scott back to the party, and Stiles walks behind Derek down the street to his car. Once they’re inside, Stiles lets out a shaky sigh. Derek immediately reaches out and covers his arm with his hand.</p>\n<p>“You’re safe,” Derek says quietly. “He’s not going to touch you again.”</p>\n<p>“I know,” Stiles says. </p>\n<p>“Stiles, I’m so sorry,” Derek says. “I should never have let things get this far out of control.”</p>\n<p>“Derek, it’s not your fault,” Stiles says with a smile, but it turns into a grimace because smiling freaking hurts. Derek extends his hand but then changes his mind and returns it to his leg. </p>\n<p>“Yeah, it is,” Derek says. “But I swear to you, it won’t happen again. I will break every single one of his fingers if he lays another hand on you.” Derek’s looking at Stiles so intently that he has to look away. This night is just too overwhelming.</p>\n<p>Derek has just put the key in the ignition when his cell phone starts ringing. Derek groans, pulls it out of his pocket, and looks at it. He drops it in the console without answering it.</p>\n<p>“It’s Jennifer.”</p>\n<p>“You’re not going to answer it?” Stiles asks.</p>\n<p>Derek shakes his head. “I know what she’s going to say. Something tells me I’ll be single and friendless by the morning.”</p>\n<p>“Not friendless,” Stiles says.</p>\n<p>Derek looks over at him as he cranks the car. “Not friendless.” He grins, his lip splitting anew. “You know, despite what just happened, last night was still the greatest night of my life.” Derek starts driving. “I just wish you hadn’t gotten hurt.”</p>\n<p>“It’ll heal, and the fight will be forgotten,” Stiles says. “Last night, you’ll have forever.” </p>\n<p>“Thanks,” Derek whispers a few moments later. </p>\n<p>Stiles nods. “It’s what I’m here for.”</p>\n<p>*</p>\n<p>School doesn’t change much, at least not for Stiles. But Derek, well. Jennifer breaks up with him, and all of her crew stops talking to him. Stiles expects Derek to start sitting with them at lunch because Cora and Boyd are at the table, but on Monday, Derek skips lunch altogether. And does the same thing for the next two days.</p>\n<p>At work on Wednesday afternoon, Isaac steps beside him with an armful of CDs. “Nice shiner.” </p>\n<p>“Yeah, I’m real street now,” Stiles replies sarcastically.</p>\n<p> “I heard about Derek,” he says. “The fight and the breakup.”</p>\n<p>“How?” Stiles asks. Isaac nods towards the front counter, where Erica is leafing through a magazine and blowing bubbles with her gum. “Of course she did.”</p>\n<p>“Be careful,” Isaac says.</p>\n<p>“What’s that supposed to mean?” Stiles asks defensively.</p>\n<p>“I know Derek’s broken up with his girlfriend, but that doesn’t mean he’s going to suddenly ask you out.”</p>\n<p>Stiles glares at Isaac. “You can mind your own business. What, are you jealous or something?”</p>\n<p>Isaac rolls his eyes. “No. Stiles, you’re my friend. And I’ve been there, holding out for the guy who breaks up with his girlfriend and expecting things to be different. I was stupid enough to think sloppy handjobs and me giving a guy a blowjob meant he’d suddenly want to be with me when he broke up with his girlfriend.”</p>\n<p>“Derek and I haven’t done anything like that,” Stiles mutters.</p>\n<p>“I know,” Isaac looks at Stiles in understanding. “I’m not saying Derek is like these guys. I’m just saying be careful, for your own sake. I don’t want you to get hurt anymore than you already have.”</p>\n<p>Stiles nods, and Isaac squeezes Stiles’ shoulder before he meanders to another section of the store. </p>\n<p>Despite his best efforts, Stiles can’t ignore Isaac’s words. And the most frustrating thing is that they’re things Stiles has already been thinking. Just because Derek broke up with Jennifer doesn’t mean he’s suddenly going to start liking guys, and even if he did, why would he want Stiles?</p>\n<p>Stiles is feeling pretty sorry for himself later. Someone enters the shop, but Stiles doesn’t look up from the CDs he’s reorganizing until someone approaches him.</p>\n<p>“Hey man,” Scott says. </p>\n<p>“Hey,” Stiles replies with a smile.</p>\n<p>“So, hear me out,” Scott starts with his hands out. “Tomorrow is the senior field trip to Funland, which means Allison is going.”</p>\n<p>“Yes, I know.”</p>\n<p>“Derek’s also going to be there, and Jackson.”</p>\n<p>Stiles sighs and shoots Scott an annoyed look. “Dude, I know who all the seniors are.”</p>\n<p>“Right,” Scott says with a grin. “Let’s skip school and meet them there!”</p>\n<p>“Really?”</p>\n<p>“Stiles, it’ll be great! Me and Allison, on roller coasters, sharing cotton candy, holding hands on the carousel,” Scott smiles dreamily. “She’s gonna graduate in a few weeks. I can’t let her do this without me.”</p>\n<p>“Great, let me tag along and be the third wheel to the Scott-and-Allison show like usual,” Stiles grumbles. It’s unfair, he knows, because he never really feels like the third wheel when he hangs out with them. He’s just in a general bad mood. The black eye hasn’t been helping. It’s just a constant aching reminder of everything.</p>\n<p>“Dude, no. Allison and I are going to be a disgustingly happy couple, so you probably don’t want to see that,” Scott says. “You need to go for Derek.”</p>\n<p>“Why would I go for Derek?” Stiles asks. “We haven’t talked since Saturday night.”</p>\n<p>“Allison said Cora said that Derek is really down about everything. It’s his senior field trip, but except for Boyd and Jackson and Danny, like everyone hates him because of Ennis.”</p>\n<p>“You just named like half the baseball team,” Stiles says. “I’m sure he’ll have plenty of people to hang with.”</p>\n<p>Scott shakes his head. “Lydia’s going to be with Jackson, Danny’s got Ethan, and Erica’s meeting Boyd.”</p>\n<p>Stiles twists around. “Yo, Erica?” She looks at him sharply from where she’s helping a customer. “You going to Boyd’s thing tomorrow?”</p>\n<p>“Yep,” she replies, then pops her gum.</p>\n<p>“See?” Scott says when Stiles turns back to him. “Come on, dude.”</p>\n<p>“Scott, my dad is hella pissed about the black eye,” Stiles says. “He wanted to arrest Ennis for assault or something. He’ll flip if I ditch.”</p>\n<p>“No he won’t,” Scott says, “Not if it’s to make Derek feel better. Your dad loves Derek. They’re like, baseball buddies.”</p>\n<p>“You know Derek and I aren’t actually a couple,” Stiles frowns. “Everyone’s getting paired off, won’t that be weird?”</p>\n<p>“Ohmigod, Stiles,” Scott groans. “Grow some balls! You’ve pined and moped over Derek for like ever, and now he’s single and needs a friend, and you’re going to crap out?” Scott grabs both of Stiles’ arms and shakes him slightly, looking into Stiles’ eyes sternly. “Come on, dude!”</p>\n<p>“Fine!” Stiles shouts. “I’ll go.”</p>\n<p>Scott grins. “Awesome. Lydia’ll pick us up in the morning.”</p>\n<p>“You’re a bad influence,” Stiles says, laughing.</p>\n<p>“You mean, awesome influence,” Scott replies, grinning widely as he exits the shop.</p>\n<p>*</p>\n<p>Funland is half an hour outside Beacon Hills. Lydia and Scott immediately leave Stiles when they enter the park, but Stiles doesn’t want to text Derek. He wants to surprise him. That sounded like such a good idea until Stiles realized just how big Funland actually was.</p>\n<p>Stiles wanders around aimlessly for awhile, trying to spot Derek. He catches sight of Jennifer, Kali, Ennis, and Aiden and promptly turns the corner, following a different path. Stiles’ phone buzzes, and he opens the text from Scott.</p>\n<p>\n<i>Derek spotted. Slushie stand, north end.</i>\n</p>\n<p>Stiles taps out a quick thanks to Scott before making his way towards the north part of the park. Luckily, Derek is still by the slushie stand, sitting alone at a table, playing a PSP. Stiles sneaks up on him, then stands behind him and puts his hands over Derek’s eyes. Derek tenses, and Stiles leans by his ear and whispers, “Guess who?”</p>\n<p>Derek immediately relaxes as he twists in his seat. Stiles drops his hands, and Derek smiles up at him, surprised but pleased to see him. “What are you doing here?”</p>\n<p>Stiles shrugs. “Scott and Lydia came, so I decided to tag along.” He bumps Derek’s shoulder lightly as he sits down. “Figured someone might like some company.”</p>\n<p>Derek keeps smiling at Stiles, looking at him like he’s amazed he’s there. “Thanks.”</p>\n<p>Stiles steals his slushie and takes a long sip from it. “You’re buying me a funnel cake later.”</p>\n<p>“Deal.”</p>\n<p>Stiles leans over and looks down at the screen on the PSP. “What are you playing?”</p>\n<p>“My baseball game,” Derek says, turning the game off. “Not important. So, what do you want to do?”</p>\n<p>“Dude, it’s your senior day,” Stiles says, standing up. “You choose.”</p>\n<p>“Well, I don’t like rollercoasters, so – “</p>\n<p>“So, that’s totally what we’re going to do,” Stiles declares, grabbing Derek’s arm and dragging him along.</p>\n<p>“Wait, no, Stiles, seriously, I hate heights.”</p>\n<p>“Derek, I’m aware of that,” Stiles says. “But this is a perfect time to do something that frightens you.”</p>\n<p>“I feel like I’ve been doing that already,” Derek mutters.</p>\n<p>“Then, you’re already in the habit!” Stiles grins. “I won’t make you get on the scariest rollercoaster. Just something mid-sized.”</p>\n<p>“Not the Goliath?” Derek asks.</p>\n<p>Stiles shakes his head. “I’m trying to push you to do something out of your comfort zone, not traumatize you.”</p>\n<p>Stiles leads them through the park, towards the line for the Scream Machine. Derek looks at it nervously, but swallows and squares his shoulders.</p>\n<p>When they’re seated in the car with the seatbelts on and bar secure, Derek starts to look unsure. “This is like the adult version of the kid coaster,” Stiles tells him.</p>\n<p>“Thanks, that makes me feel so much better. I’m terrified of a kid rollercoaster.”</p>\n<p>“It’s fun, I swear.”</p>\n<p>“If I die, I’m going to kill you,” Derek says. Stiles rolls his eyes. </p>\n<p>Derek yelps when the rollercoaster jerks to a start, and Stiles laughs at him. It’s kind of hilarious to see Derek, who is always so sure and confident and brave, reduced to terror over the lamest rollercoaster in the whole park. Derek is okay through the first hill, and the second, but by the third, when the drops get more dramatic and the coaster picks up speed, Derek starts screaming and reaches over to grab Stiles’ hand in a crushing grip. Stiles doesn’t let go.</p>\n<p>When the ride is finally over, Derek just sits there, staring straight ahead, still gripping Stiles’ hand. </p>\n<p>“You okay, big guy?” Stiles asks. He squeezes Derek’s hand.</p>\n<p>“That was terrifying,” Derek says, turning towards Stiles with wide eyes. He’s pale and clammy. Stiles just throws his head back and laughs.</p>\n<p>“Come on, scaredy cat,” Stiles tugs on his hand as he unhooks the bar and seat belts. “How about that funnel cake now?” Derek nods, but doesn’t let go of Stiles’ hand until they have completely exited the ride and are back on the ground.</p>\n<p>But they don’t get funnel cake yet. Stiles gets distracted by a guy making balloon animals, so he forces Derek to wait until the guy makes Derek one. Derek gets frustrated when Stiles won’t tell when what he requested, and when the guy hands Stiles the black balloon animal, Stiles hands it to Derek.</p>\n<p>“It looks like a dog,” Derek says, holding it carefully.</p>\n<p>“It’s a wolf,” Stiles says. “Because you love wolves.”</p>\n<p>Derek looks up at him in wonder. “You remember that?”</p>\n<p>Stiles nods. “Dude, I remember everything.” He taps the side of his forehead, and Derek looks back at the balloon with a soft smile on his face.</p>\n<p>They almost cross paths with Jennifer, but Derek steers them away because Stiles was paying more attention to the kid’s log train than where he was going.</p>\n<p>“Do you miss her?” Stiles asks as they walk down a shaded lane towards one of the water rides.</p>\n<p>Derek doesn’t answer right away. “You’d think I would, but I don’t,” he finally says. “I thought I’d be more shattered, because I thought I loved her and we were having sex, but…” Derek shakes his head. “It felt like a relief when she said it was over. Like I could relax now, instead of worrying about whether or not Jennifer would get mad at me.”</p>\n<p>“I’m still sorry,” Stiles says.</p>\n<p> “She’s really not a bad person,” Derek says. “I guess in some weird way I loved her, or maybe just cared about her, but I was never <i>in</i> love with her.”</p>\n<p>“How do you know the difference?” Stiles asks.</p>\n<p>Derek shrugs and looks at him. “You just do.” Stiles nods, and Derek says, “She deserves someone whose interests are more aligned with hers. Someone who can love her and be there for her like she needs.”</p>\n<p>“And that’s not you?”</p>\n<p>Derek looks at Stiles, and shakes his head. “No, not anymore.” Stiles blushes and looks down. “I’m not sure we were ever really on the same page.”</p>\n<p>“Why did you date her?”</p>\n<p>Derek answers simply, “I liked her.”</p>\n<p>Stiles convinces Derek to ride a few other rides, and they find Cora and Kira together on the haunted ride. “What are you doing here?” Derek asks.</p>\n<p>“Everyone else ditched,” Cora says, “Kira and I weren’t going to be the only losers left at school.”</p>\n<p>Stiles laughs, and Cora taps the balloon Derek’s still holding. “What’s that?”</p>\n<p>“A wolf,” Derek grins. “Stiles gave it to me.”</p>\n<p>“He did?” Cora asks, raising an eyebrow at Stiles. “That was nice.” </p>\n<p>Stiles glares at her, and says, “Hmm, fancy seeing you and Kira here today.” Cora blushes, but then she winks. </p>\n<p>Between the three of them, they convince Derek to ride a few of the less intense rides, but then Cora and Kira depart to ride the scary rollercoasters, and Stiles hangs back with Derek.</p>\n<p>“You can go with them,” Derek says. “I can stand at the bottom and watch.”</p>\n<p>“Nah, no fun if you’re not there screaming like a baby beside me,” Stiles says. Derek grunts unhappily. “Besides, you still owe me funnel cake.”</p>\n<p>Derek buys them a funnel cake, two hotdogs, and two sodas, and carries them to the table Stiles is sitting at. Stiles shakes his head when he sees the tray Derek sits down. “Dude, I said buy me a funnel cake, not lunch.”</p>\n<p>“Don’t worry about it,” Derek says. “You needed something more than funnel cake for lunch.”</p>\n<p>“How much was it? I’ll give you half.”</p>\n<p>“Nonsense,” Derek says, picking up his hotdog. “I wanted to get it.”</p>\n<p>Stiles wonders if Derek realizes just how much this feels like a date.</p>\n<p>After they demolish their hotdogs, they start in on the funnel cake. Stiles tears off pieces of it, not caring that he’s getting powdered sugar all over him. “So good,” Stiles moans around a mouthful.</p>\n<p>“It is pretty tasty,” Derek concedes, licking sugar from his fingers. Stiles tries not to stare, but it’s hard not to watch his pink tongue circling his fingers, then his lips surrounding them as he sucks. That should be disgusting, not insanely hot, Stiles thinks.</p>\n<p>“UC Irvine called,” Derek says a few moments later. “They wanna meet with me Saturday morning.”</p>\n<p>Stiles grins and slaps Derek on the arm, leaving remnants of powdered sugar. “Derek, that’s awesome!”</p>\n<p>“I have to drive down there tomorrow, after school so I’ll be ready for the interview early Saturday morning.”</p>\n<p>“Cool.”</p>\n<p>“Do you want to come with me?” Derek asks shyly. Stiles pauses, funnel cake halfway to his mouth. Derek wants him to go with him. On his college visit. Over night.</p>\n<p>“Why me?” he finally asks, dropping the uneaten piece of cake back onto the plate.</p>\n<p>“You’re the only one who gets it.”</p>\n<p>Stiles feels something burst in his chest. “Of course, I’ll come.” Derek’s smile lights up his whole face.</p>\n<p>After they finish the funnel cake, Stiles holds his belly and groans. “Too much sugar and grease, but so good.”</p>\n<p>Derek laughs. Then, he extends his hand and Stiles holds his breath as Derek drags his thumb along his cheek, then across his chin. His thumb lightly brushes Stiles’ lower lip. “You,” Derek pauses and clears his throat, “You had some sugar.”</p>\n<p>“Oh.”</p>\n<p>“Yeah.”</p>\n<p>Derek drops his hand and turns away, his cheeks pink. Stiles tingles all over.</p>\n<p>*</p>\n<p>After school the next day, Stiles and the sheriff walk next door, where Derek’s tossing his overnight bag in the trunk of his car. The sheriff asks Derek for a few more details while Stiles puts his bag next to Derek’s, then Stiles runs inside to pee before they get on the road. </p>\n<p>He’s grabbing a soda from the fridge when Cora comes up behind him. “You’re all he’s talked about for days, you know,” she says. Stiles spins around, flailing. Cora rolls her eyes. “Look, Stiles, I’ve been watching you two for awhile now. Derek doesn’t realize he has feelings for you, or if he does, he doesn’t realize what they mean.”</p>\n<p>“I don’t know what – “</p>\n<p>“Stiles, he broke a dude’s nose for you,” Cora says. “And he broke up with his girlfriend. Fuck, he remembers your favorite flavor of sucker. Derek’s been falling for you for awhile, he just doesn’t realize it, because my brother is an oblivious idiot.” She puts her hand on his shoulder. “Hurt him, and I’ll give you worse than a black eye.”</p>\n<p>“I’d never do anything to hurt Derek,” Stiles replies seriously.</p>\n<p>“I know,” Cora says. “Just be patient with him. He’ll figure it out eventually.”</p>\n<p>“What if you’re wrong?” Stiles asks. “Cora, I can’t get my hopes up.”</p>\n<p>“I’m not wrong.” She punches his arm lightly and then disappears upstairs.</p>\n<p>“I’m gonna give you a black eye if you’re wrong!” Stiles yells lamely up the stairs.</p>\n<p>“Why are you threatening my sister?” Derek asks, yanking the refrigerator door open and grabbing a bottle of water.</p>\n<p>Stiles covers it up awkwardly. “Just, you know, Cora…stuff.”</p>\n<p>Derek lifts a dubious eyebrow but doesn’t push it. Stiles breathes a sigh of relief as he follows Derek out to the car.</p>\n<p>Derek’s quiet on the way out of town, which Stiles can work with. He’s never had any problem filling pockets of silence, but the longer they drive, the further Derek draws away. Stiles wonders if it’s him, if Derek’s regretting asking him along, but deep down he knows that’s not it. He’s pretty sure it’s not even nerves from the upcoming interview – after Derek’s performance at the championship game, all the recruiters will be racing to have Derek on their team.</p>\n<p>Stiles turns and studies Derek as discreetly as possible, which means not discreetly at all. Derek doesn’t even notice, and if he does, he doesn’t care. He stares straight ahead and just drives. Stiles takes in the clenched muscles in his jaw, his rigid posture as he grips the steering wheel tightly. Stiles also draws his eyes over the dark stubble dusting Derek’s jaw, the way his biceps swell from beneath his t-shirt, the way his lashes flutter when he blinks.</p>\n<p>Stiles doesn’t like that Derek is hurting, especially over those assholes. But Stiles knows they were Derek’s friends, and Derek cared for Jennifer, even if none of them are nice people.</p>\n<p>Stiles grabs the cord and hooks up Derek’s iPod. He scans through Derek’s music, shaking his head in disbelief the entire time. “Seriously, dude, this is the saddest collection of music ever.”</p>\n<p>“Oh, sorry it’s not something straight out of Pitchfork’s top 100,” Derek says.</p>\n<p>Stiles looks over at him in pleased surprised. “Dropping Pitchfork like you’re some sort of music snob. Nice,” Stiles grins. </p>\n<p>“I do listen when you and Laura talk,” Derek says. “Sometimes.”</p>\n<p>“What is this?” he asks, naming off a few throwaway titles from recent pop charts. “Why the hell do you have those on your iPod?”</p>\n<p>“They’re good songs,” Derek says. “I run to them.”</p>\n<p>“Let me guess, Ye Olde Alpha Pack listens to this drivel.”</p>\n<p>“Yeah, all the time. I really couldn’t understand,” Derek shakes his head. “It’s good for a workout, but after awhile, all the songs sound exactly the same.”</p>\n<p>“Thank you!” Stiles exclaims. “At least they didn’t suck your soul out through their bad music! It’s all the same beat over and over again in different songs.”</p>\n<p>“That’s what I kept trying to tell them, but they didn’t listen,” Derek says. “They told me my music was for grandpas and sucked.”</p>\n<p>“While I think you might want to try something from this century,” Stiles says, scrolling until he finds a song he wants to hear, “I’ve always liked your taste.” Stiles hits play and turns up the volume. When Derek recognizes the song, he groans.</p>\n<p>“I hate this song.”</p>\n<p>“Dude, it’s on your iPod.”</p>\n<p>“You probably put it there,” Derek says.</p>\n<p>Stiles thinks, and shakes his head. “I don’t think I did.” He starts spelling <i>S-A-F-T….dance…</i> along with the song. “I think this is an appropriate song for the occasion,” Stiles says as he starts doing a dumb dance in the front seat. </p>\n<p>“You’re an idiot,” Derek says, but there’s a smile around his lips.</p>\n<p>“<i>We can dance if we want to,</i>” Stiles starts singing, “<i>We can leave your friends behind…</i>”</p>\n<p>“You’re so annoying,” Derek says, trying to keep a straight face. </p>\n<p>“Look, I’m cheering you up.” Stiles pokes Derek’s cheek where a smile is forming. <i>”We can go where we want to, A place where they will never find, and we can act like we come from out of this world, leave the real one far behind…</i>” Stiles grabs Derek’s hand, “Come on! <i>We can dance!</i>” Stiles starts doing a poor imitation of the robot to the electronic beeps in the song. Derek starts laughing.</p>\n<p>“Such an idiot,” he says fondly.</p>\n<p>“See?” Stiles says, still dancing in his seat. “It’s literally impossible to not be happy during ‘The Safety Dance,’ no matter how lame this song is.”</p>\n<p>“Fine, you made your point,” Derek says, visibly relaxing. “Can we please listen to something else?”</p>\n<p>“You don’t want to finish ‘The Safety Dance’?”</p>\n<p>“No.”</p>\n<p>Stiles continues scrolling through Derek’s iPod, until he comes to one of Derek’s favorite songs. He hits play, and as soon as the first notes float from the speakers, Derek smiles.</p>\n<p>“I love this song,” Derek says as Toto’s “Africa” plays. </p>\n<p>“I know,” Stiles says. Stiles knows this is one of Derek’s favorite songs, because it reminds him of his mother. Stiles knows it was one of Talia’s favorite songs, and she used to sing this to Derek when he was a kid. Stiles knows that one of Derek’s last memories of his mother is singing this song with her in the car on his way to school. Stiles knows just how much this song means to him.</p>\n<p>Derek softly sings the words, and Stiles smiles and sings along to the chorus despite the fact that he kinda hates this song. But Derek loves it so much, it’s actually hard to hate it in the moment.</p>\n<p>“<i>It’s gonna take a lot to drag me away from you</i>,” Stiles and Derek belt at the top of their lungs. “<i>There’s nothing that a hundred men or more could ever dooooo, I bless the rains down in Africa…I bless the rains down in Africaaaaaaaaa,”</i> Derek sings while Stiles sings along to the background in a falsetto, “<i>I bless the rains!</i>”</p>\n<p>After the song ends, Derek starts talking, and Stiles figures mission accomplished.</p>\n<p>*</p>\n<p>When Stiles enters the hotel room, he looks around, his eyes falling on the one double bed. He hadn’t thought about that, sharing a bed with Derek. Sure, he’s shared a bed with Derek before, but it was different. Cora, Laura, or Scott was always there, but now, it’s just them. And things are so different between them.</p>\n<p>Stiles just acts nonchalantly about it, dropping his bag on the floor before running and jumping on the bed. Derek shakes his head as he sets his back carefully against the wall. They bring take out Chinese back to the room, and eat it while watching <i>Epic Homes</i> because there’s nothing else on the television.</p>\n<p>Later, Derek is sitting in one of the chairs, watching a baseball game on television in his pajama pants and a wife beater. Stiles has changed into a t-shirt and boxers, and is leaning against the pillows propped against the headboard, finishing up the portrait of Allison. He needs to finish Allison’s gift so he can finish Derek’s, which he’s only about halfway through.</p>\n<p>“It’s going to be fine,” Stiles says without looking up from where he’s shading Allison’s eyes. Derek hasn’t spoken in almost two hours, and he’s drawing further and further in on himself. It has been so long since Stiles has spent long periods of time with Derek that he forgot how distant and quiet he could be when he’s not forcing himself to socialize at school.</p>\n<p>“What?”</p>\n<p>“The interview tomorrow,” Stiles supplies. </p>\n<p>“I’m not worried about that,” Derek says lowly.</p>\n<p>“You’re lying,” Stiles says without looking up from his pencil. “You only get like this when something really important is on your mind, and I doubt the Ennis and Jennifer stuff at school warrants this.”</p>\n<p>“It’s scary how well you can read me sometimes,” Derek says, running a hand over his hair. “You’re more perceptive than Laura or Cora.”</p>\n<p>“They know you, too,” Stiles says. “They just aren’t as pushy as I am.”</p>\n<p>“What if I say the wrong thing? Or mess up the interview?” Derek asks. “I’m not good with words or people.”</p>\n<p>“You’re better than you think,” Stiles says. “Look how popular you are. You didn’t get that way from being a sullen, quiet asshole.”</p>\n<p>“Not popular anymore,” Derek says. “It’s all an act anyway.”</p>\n<p>“I know,” Stiles says. “So, act tomorrow in the interview. Same principle.”</p>\n<p>Derek groans as he moves from the chair to the bed, dropping face first on the mattress. Stiles holds his pencil away from the page as he bounces a few times.</p>\n<p>“Thanks for putting up with me and listening to my whining,” Derek mumbles against the bedspread. Stiles reaches out and ruffles Derek’s hair. </p>\n<p>After a few minutes, Derek rolls onto his side and pushes himself up to look over Stiles’ shoulder. “It looks just like her,” Derek says, staring down at the portrait as he sits up straighter. Stiles moves the sketchpad over a bit so Derek can get a better angle. “It’s beautiful.”</p>\n<p>“It’s not much,” Stiles says.</p>\n<p>Derek reaches out and touches one of Allison’s curls, then her fingers pushing her hair behind her ear. “Stiles, the detail in this is amazing. I didn’t realize how good you were.” Derek drags his fingers across the lines, and Stiles just watches him. He’s leaning into Stiles’ space, so close that Derek’s shoulder is pressed against Stiles’ chest, and each of Stiles’ breaths cause Derek’s hair to gently flutter.</p>\n<p>Stiles opens his mouth to speak, but he finds he has no words. Derek looks up, and they’re so close, faces only a few inches apart. Stiles wants to make the words come out, to deflect this entire situation, but then Derek’s lips are on his, and Stiles melts against his mouth.</p>\n<p>Derek’s lips are soft and kind of chapped, and Derek’s fingers feel calloused and rough where they curl around the back of Stiles’ neck. Stiles’ head is buzzing, making him dizzy with emotion. The kiss is light, hesitant almost, just a gentle press that has Stiles afraid to move, to even breathe, in case Derek suddenly disappears. But Derek’s mouth hasn’t pulled away, in fact, Derek is pressing closer into Stiles and kissing him harder. <i>I’m being kissed ohmigod Derek is kissing me,</i> he thinks.</p>\n<p>But before Stiles can convince his body and brain to catch up, Derek pulls away and rests his forehead against Stiles’, breathing heavily with his eyes closed. Stiles feels every deep exhale against his lips, a light feathery sensation that sends chills all down his spine.</p>\n<p>“I’ve thought about doing that for awhile,” Derek whispers. “I never thought I’d actually do it.”</p>\n<p>Stiles has his hand pressed against Derek’s chest, flexing his fingers against his skin and barely registers what Derek’s saying. “Wait, what?” he finally catches on. He leans back and looks at Derek in shock. Derek’s face is open and vulnerable, like he’s scared Stiles is going to run away and reject him. “You thought about kissing me?”</p>\n<p>Derek nods. “Is that weird? Did I make things weird?”</p>\n<p>Stiles sucks in his lower lip, shaking his head adamantly. “Nope, no. Zero weirdness here.”</p>\n<p>Derek chuckles lightly, and he tightens his hand around Stiles’ neck before pulling him in for another kiss.</p>\n<p>Kissing Derek is <i>nothing</i> like kissing Isaac was. Both boys are good in their own right, but kissing Derek is possibly the greatest thing Stiles has ever done. Every nerve in his body is on fire, and he can barely think. And all from a kiss. This time, it doesn’t take long before Stiles has his arms wrapped around Derek’s shoulders with his hands raking through Derek’s hair. Stiles pulls away momentarily because he’s distracted by just how soft the strands feel underneath his fingertips, and he looks over Derek’s shoulder where his hand is brushing through Derek’s hair over and over. Derek kisses along Stiles’ cheek and chin before covering his mouth again.</p>\n<p>The moment Derek’s tongue slides inside Stiles’ mouth the first time, Stiles feels like his stomach is doing back flips. Derek’s tongue is warm and slightly squishy against his own, and he puts a bit of tentative pressure against it. Derek seems to like that, because he responds enthusiastically, his tongue moving deeper and more urgently inside Stiles’ mouth.</p>\n<p>Stiles grips the front of Derek’s t-shirt and tugs him down onto the bed, pulling Derek on top of him. As Stiles hits the mattress, Derek holds himself up on his arms, separating their lips. Stiles grips Derek’s shoulders and tries to pull him down again. “More kissy, don’t stop the kissing.”</p>\n<p>Derek smiles and trails his fingers across Stiles’ forehead. “You’re incredible, do you know that?”</p>\n<p>“Did you get hit in the head with a baseball?” Stiles asks. “Because that’s really the only explanation for your behavior.”</p>\n<p>Derek huffs in exasperation. “Why do you always criticize yourself?”</p>\n<p>Stiles shrugs. “Everyone else seems to.”</p>\n<p>Derek leans down and presses his lips right against Stiles’, and mumbles, “Everyone else is wrong.” Stiles wraps his arms around Derek tightly and hugs him close. </p>\n<p>They make out for over an hour. Stiles had fun the other night, but this…kissing Derek like this is unlike anything Stiles could have imagined. His entire body is tingling, his heart racing and his body thrumming with unspent energy. By the time they start to slow down, Stiles’ lips are sore and both boys are panting.</p>\n<p>“Wow,” Derek says, nuzzling into the crook of Stiles’ neck to lick and nip.</p>\n<p>“Really?” Stiles asks, hands drawing up and down Derek’s back.</p>\n<p>Derek bites down on his neck hard, and then soothes it with his tongue. “Yes.”</p>\n<p>They end up curled together, the television’s volume on low while they talk. Stiles is amazed that this feels no different than other late-night conversations they have had where they shared things easier said in the dark. Stiles remembers the night he told Derek he was bisexual and worried Derek would stop being his friend, and the night Derek told him he’d lost his virginity. It was on a night like this Stiles talked to Derek about his mother, and Derek talked about his parents. Lying and talking like this didn’t feel so different from nights up on Stiles’ roof, sprawled on Derek’s sofa, or lying on their backs in Derek’s backyard. </p>\n<p>Well, except for the whole Derek-having-his-arms-around-Stiles thing. That is new, but Stiles is okay with that. Especially if Derek continued to drag his nose along Stiles’ hairline and behind his ear.</p>\n<p>When Derek turns the television to some comedy show, Stiles feels himself drifting to sleep. “Am I losing you?” Derek whispers against Stiles’ ear.</p>\n<p>“Mmhmm,” Stiles mumbles, starting to roll off Derek. “I’ll go to my side, I promise.”</p>\n<p>Derek just tightens his arms around Stiles. “No. I like you right here,” he says.</p>\n<p>Stiles settles back against Derek’s chest, and angles his head to kiss the underside of Derek’s chin. “You’re going to do great tomorrow,” Stiles says. “No worrying.”</p>\n<p>“Good night, Stiles,” Derek says, running his hand soothingly along Stiles’ arm.</p>\n<p>*</p>\n<p> Stiles wakes to the sounds of Derek getting ready. He blinks awake and sees Derek combing his hair. A tray filled with breakfast food sits on the small table. Stiles sits up and reaches for the bagel already smeared with the Stiles-appropriate level of cream cheese. He takes a bite and hums contently.</p>\n<p>“There’s time for you to take a shower before we leave,” Derek says as he sits in the chair and starts eating his cereal. “I’ll put everything in the car and check out.”</p>\n<p>Stiles nods numbly. His brain is still asleep, and he needs caffeine. After his shower, they leave for UC Irvine. Derek looks very grown up and professional in his dress shirt and slacks, so different than in his usual t-shirt and gym shorts. But Stiles can’t help but think how handsome he looks, and how good the lavender shirt that Cora no doubt helped him pick out looks with his dark hair. Derek’s quiet, and Stiles is both half-asleep and nervous. It’s too early to think about what happened the night before now that they were outside the safety of the hotel room. </p>\n<p>“Good luck,” Stiles says, giving Derek’s shoulder a supportive squeeze as he sits in the car in front of the building. “Don’t forget, you’re awesome, and you’re an even more awesome baseball player.”</p>\n<p>Derek nods, gives Stiles a nervous smile, and then exits the car. Stiles watches as Derek crosses the street, self-consciously messing with his dress shirt and hair. Stiles’ heart is pounding in his chest with second-hand nerves. He knows what this interview means, what rides on this. </p>\n<p>It takes five minutes before Stiles is out of the car, walking down the street a few blocks to the coffee shop they passed. As he stands in line, he looks around at all the college students, with their books and coffees and general college coolness. He frowns as he watches a couple sipping drinks and sharing a muffin. What if Derek goes to college and doesn’t want anything to do with him? It’s happened before; Derek came to high school, and they drifted away for awhile. What if that happens again? What if the college-high school gap is too wide to cross?</p>\n<p>After Stiles receives his coffee, he returns slowly to the car and decides not to worry about that yet. He and Derek aren’t dating or anything else yet. They made out once. Stiles knows from experience that doesn’t mean anything.</p>\n<p>But this whole situation feels like it means everything.</p>\n<p>*</p>\n<p>Stiles has dozed off when Derek returns to the car. Stiles looks up at him groggily, and Derek’s beaming at him, his smile so wide it’s almost blinding. Stiles immediately sits up straight and grins, too.</p>\n<p>“They loved me!” Derek exclaims. “The coach said he was impressed with my game at the state championship, and that coupled with my overall performance means he wants me to play for them!”</p>\n<p>“Derek, that’s amazing!” Stiles exclaims, lunging forward and wrapping his arms around Derek’s shoulders. They pull apart awkwardly, Derek blushing and Stiles looking out the windshield as he returns to his seat. “So, does that mean you’ll be accepting their offer?”</p>\n<p>Derek nods. “They have to send me some paperwork in the mail to fill out, but I’m officially the new second baseman for UC Irvine!”</p>\n<p>Stiles feels so proud he thinks his heart might burst out of his chest.</p>\n<p>*</p>\n<p>They don’t talk about what happened on the way home, but it doesn’t feel weird. They talk comfortably the entire ride, and when they pull into Derek’s driveway, Laura and Cora come rushing out of the house screaming, “Did you get it?” and so Stiles is forgotten as Derek’s sisters scream and hug him in their excitement.</p>\n<p>At school on Monday morning, Stiles pulls Scott into his Jeep, giving an apologetic smile to Allison, Lydia, and Kira. </p>\n<p>“What’s up?” Scott asks. “Did something happen on your trip with Derek? Something happened, didn’t it? I can see it on your face.”</p>\n<p>“Oh god, really?” Stiles exclaims, yanking the rearview mirror towards him so he can check his face. He had made extra sure Derek hadn’t left any hickeys when he’d gotten home, but maybe he missed something.</p>\n<p>“Dude, something <i>did</i> happen! What? Are you two together?”</p>\n<p>Stiles shakes his head. “We kissed. Well, he kissed me.”</p>\n<p>Scott’s eyes grow really large, his mouth hanging open slightly. “Did you two do it?”</p>\n<p>Stiles looks at Scott like he can’t believe he just asked that question. “No, we didn’t <i>do it</i>.” He scoffs and shakes his head. “It’s not like that. I mean, I sure hope it gets like that soon because I need Derek to sex me up so much right now – “</p>\n<p>“TMI, dude,” Scott interjects.</p>\n<p>Stiles glares at him. “Oh, is that right Mr. ‘let me list every single one of Allison’s erogenous zones and describe in detail her perfect vagina.’ That’s not TMI? I never needed to know that much about Allison’s lady parts.”</p>\n<p>Scott blushes a deep red. “Shut up,” he mumbles. “And never tell Allison what you know.”</p>\n<p>“Dude, I’d like to keep my balls.”</p>\n<p>“So, you only kissed?” Scott asks.</p>\n<p>Stiles nods, and can’t help the smile that spreads across his face. “Yeah. And then we kinda cuddled and talked and watched TV.”</p>\n<p>“Wow, that’s major,” Scott says. “So, are you two a thing?”</p>\n<p>Stiles shrugs. “We haven’t talked since we got home Saturday morning.”</p>\n<p>Scott smiles in encouragement. “I’m sure everything will work out!” Stiles appreciates Scott’s support, because he’s not feeling so good himself.</p>\n<p>At lunch, Derek still doesn’t show up. Stiles turns to Boyd. “So.”</p>\n<p>“I’m not telling you where Derek is,” Boyd says. </p>\n<p>Stiles glares, offended. “I wasn’t going to ask about Derek.” Boyd just blinks at him. “I was going to ask about how you and Erica are. You know, making conversation and…stuff.”</p>\n<p>“You don’t care about me and Erica, so stop asking things that aren’t your business,” Boyd replies.</p>\n<p>“That stings Boyd. I thought we were friends,” Stiles says. “Are you taking her to prom?”</p>\n<p>“Yes.”</p>\n<p>Stiles smiles and says sarcastically, “I bet she’ll love that. She always talks about how stupid high school institutions like prom are.”</p>\n<p>Boyd’s expression doesn’t change and Cora snorts beside him, so Stiles glares at her too. “I’m not telling you either,” she says.</p>\n<p>Stiles looks between the two, frowning. “Are you two like in this together? It’s not like Derek’s on some super secret mission. Unless he suddenly became a spy without my knowledge.”</p>\n<p>“You two have to work out your own issues,” Boyd says, “and keep me out of them.”</p>\n<p>Stiles contemplates texting Derek, but he’s not sure what he would text. <i>Do you like me? Circle yes or no</i>? Or something else equally as lame? So, he decides against texting.</p>\n<p>Stiles finally sees Derek later that night, when he glimpses Derek’s light on. He goes over to the window and waves when Derek notices him. Stiles picks up the white board and writes on it.</p>\n<p>\n<i>Are we going to talk about it?</i>\n</p>\n<p>The look on Derek’s face is unreadable as he picks up his whiteboard and writes, <i>I’m so confused.</i></p>\n<p>Something in Stiles breaks, but he swallows it down, instead nodding and scribbling a response. </p>\n<p>\n<i>You know where to find me when you figure it out.</i>\n</p>\n<p>Then he closes his curtains.</p>\n<p>*</p>\n<p>They’re campaigning on Thursday afternoon, handing out fliers with Lydia’s smiling face on them to anyone who passes by.</p>\n<p>“Remember to vote Lydia Martin for prom queen tomorrow morning!” Stiles calls out as he hands fliers to two girls.</p>\n<p>“Can’t we just stuff the ballot box?” Cora says. “Or threaten people? It’s so much easier than this.”</p>\n<p>“Are you implying that the only way I can win is by stuffing a ballot box?” Lydia snaps. “Look, Cora. I don’t need your negative attitude. You can just leave if it’s inconveniencing you that much!” Lydia points with one hand, the other on her hip.</p>\n<p>“Whoa, don’t get your overpriced panties in a twist, Lydia,” Cora says. “Not what I meant, geez, calm down.”</p>\n<p>“The last thing I need is for my campaign team to lose hope on the eve of my election!” she screeches. “Jennifer has already had her pep squad doing little cheers around the school telling people to vote for her and not for me, and I have put a lot of time into this,” she continues, her voice increasing in volume with each word, “And I will not lose!” </p>\n<p>In that moment, Stiles is terrified of her. Lydia has this wild, crazy look in her eyes, and everyone at the table is kind of staring at her.</p>\n<p>Someone walks by, and like she has flipped a switch, Lydia smiles at the person and says, “Vote for the true Beacon Hills queen! Vote Lydia Martin!”</p>\n<p>“You’re scary,” Stiles mumbles as Lydia leans against the table. </p>\n<p>“This is just really stressful, Stiles,” Lydia says. “This would be so much easier if Jennifer was still going to prom alone.”</p>\n<p>“Who’d she find to take her?” Allison asks.</p>\n<p>“Who do you <i>think</i>?” Lydia huffs. “Derek.”</p>\n<p>“Wait, what?” Stiles asks at the same time Cora exclaims, “Derek?”</p>\n<p>Lydia hands out a few fliers as she explains, “Apparently, they were seen talking this morning, and by fifth period, everyone was saying that Derek’s taking Jennifer to prom.”</p>\n<p>Scott looks over at Stiles in confusion, and even Cora gives him a look that makes him wonder just how much she knows about what happened between him and Derek. Stiles laughs it off and says to Cora, “So, would you break my arm if I asked you to an anti-prom movie tomorrow night?”</p>\n<p>Cora gives Stiles an apologetic look. “Um, I’m actually going to prom.”</p>\n<p>“You’re going to prom?” Lydia exclaims. Cora nods. “With who?”</p>\n<p>Cora glances at Kira and blushes. Kira says, “With me.”</p>\n<p>Stiles grins, and Lydia looks between them in confusion. “Excuse me?”</p>\n<p>Kira grabs Cora’s hand and says, “We’re kind of dating.”</p>\n<p>Everyone congratulates them and starts asking them tons of questions, and while Stiles is happy for his friends, he can’t help but feel like his world is crumbling around him.</p>\n<p>*</p>\n<p>Stiles is somewhere between angry and understanding. The conversation he had with Isaac keeps replaying in his head. <i>Kissing doesn’t mean we have to date.</i> </p>\n<p>Just because he and Derek made out doesn’t mean Stiles should expect anything from Derek. People like Derek and Jennifer break up and get back together all the time. It really shouldn’t surprise Stiles.</p>\n<p>But Stiles is still hurting, his chest aching every time he thinks about it. He feels rejected, angry, and <i>so so stupid</i>. </p>\n<p>Thursday night, he opens his sketchpad and tears out the portrait he was drawing as Derek’s graduation gift. He almost rips it apart, but he looks at it and thinks about everything Derek means to him. Yes, he’s hurt and angry, but it’s Derek. If things are never going to be the same between them, then the last thing Stiles will do is give him a gift that reflects how much he means to Stiles.</p>\n<p>He starts to sketch.</p>\n<p>*</p>\n<p>Stiles votes for Lydia for prom queen during homeroom, and then spends the day sulking. No one notices during their pre-prom excitement, and Stiles is okay with that. He wants to feel sorry for himself in peace, thanks.</p>\n<p>Between fourth and fifth periods, he sees Derek and Jennifer talking in the hallway, and he turns around and walks the other way. That’s the last thing Stiles wants to deal with today.</p>\n<p>The moment he gets home from school, he opens the sketchpad back up and works on finishing Derek’s gift with single-minded determination. He wants it over and done with, because he doesn’t want to have to think about Derek in such a concentrated way for awhile. He finishes it around 9 p.m. and sits back to survey his work.</p>\n<p>It’s a portrait of Derek in his baseball uniform, at the moment just after swinging his bat and hitting the ball. Around the edges, Stiles has decorated it to look like a baseball card.</p>\n<p>At the bottom, in small script, Stiles writes:<br><i>Don’t forget that you are talented.</i><br>\nDon’t forget that you are an amazing baseball player.<br>\nDon’t ever forget that you can do it.<br>\n(and don’t forget about me)</p>\n<p>Satisfied, Stiles packages it up carefully and takes it next door. Laura answers the door wearing a pair of headphones, and looks at him in surprise.</p>\n<p>“Hey Stiles,” she says as she tugs the headphones off her head. “Derek and Cora are upstairs. We have pizza, if you’re hungry.”</p>\n<p>Stiles shakes his head. “I’m not staying. Just give this to Derek for me, okay? It’s his early graduation gift.”</p>\n<p>Laura takes it, then tilts her head. “You okay?”</p>\n<p>Stiles forces a smile. “I’m fine.” He waves. “See you later, Laura.”</p>\n<p>When Stiles is back in his room, he turns on his TV and falls asleep.</p>\n<p>*</p>\n<p>Stiles doesn’t go to prom. He makes sure that he is out of the house way before any prom limos and party buses would be coming by to pick up him or Derek. He knows that Scott wouldn’t go to prom without stopping by Stiles’ house just in case, and the last thing Stiles wants to see is Derek walking out of his house wearing his tux and carrying a corsage for Jennifer.</p>\n<p>Instead, he puts on the tuxedo t-shirt he picked up at a thrift store that he originally planned to wear to prom, and leaves on his skateboard. </p>\n<p>He skates around town aimlessly, avoiding all the streets where anyone from school might see him. He wants to be alone and try to keep his mind off the gut wrenching idea of Derek and Jennifer together, dancing and kissing and holding hands under twinkle lights.</p>\n<p>It doesn’t work, but it gives him something to do.</p>\n<p>He skates way into the evening, until the sun has sunk below the horizon. It’s helping to dispel the buzzing in his limbs, and to keep the near crushing weight of hurt and rejection at bay. </p>\n<p>Stiles doesn’t notice the car rolling to a stop beside him, doesn’t look up when it starts driving along with him.</p>\n<p>“Stiles.”</p>\n<p>Finally, he looks over, and loses his balance and nearly falls over when he sees Derek behind the wheel of his Camaro. Derek’s dressed in his tuxedo shirt and vest, the tie loose and the first few buttons unbuttoned. </p>\n<p>“Get in,” Derek grunts. He doesn’t look happy.</p>\n<p>“Shouldn’t you be at prom with <i>Jennifer</i>?” Stiles asks, not bothering to stop rolling along the sidewalk.</p>\n<p>“Stiles, please get in the car.”</p>\n<p>Stiles hops off his board and grabs it angrily. He shoves it in the backseat before dropping into the passenger’s seat. Derek quickly drives off.</p>\n<p>The car is silent as Derek drives. Stiles doesn’t know what he’s doing sitting there, what Derek could possibly want with him. Stiles would say he doesn’t know why he got in the car, but that would be a lie.</p>\n<p>Stiles’ leg is bouncing nervously, and he clamps his hand on his knee to try and still it. “Why aren’t you at prom?” Stiles tries again.</p>\n<p>“Because the one person I wanted to be with wasn’t there,” Derek replies.</p>\n<p>Stiles turns and stares at Derek, who looks straight ahead as he drives through the night. His mind is reeling, but his cynical self-preservation keeps him from getting too excited. Derek drives to the park, and Stiles watches in confusion as they drive through until Derek pulls the car next to a baseball field. Derek slams the car to a stop and gets out. </p>\n<p>When Stiles gets out of the car, Derek’s standing on the sidewalk, the glow from a nearby streetlight illuminating him softly. “I didn’t take Jennifer to prom because we were getting back together,” Derek starts. Stiles leans against the side of the car and waits. “I couldn’t let her go to prom alone, not when it meant so much to her. I had promised to be her date, so I called her and told her I’d still be her date if she hadn’t found a replacement, and we talked some things out. But we’re absolutely not back together.”</p>\n<p>“You’re not?” Stiles asks, something that feels a lot like hope bubbling in his chest. </p>\n<p>Derek shakes his head. “I told her there was someone else.”</p>\n<p>“Oh.” Stiles chews his lip, watching with a pounding heart as Derek steps closer and closer to him until he’s right in front of him.</p>\n<p>“See, there is this amazing guy who has been in front of my face the entire time, and I’ve just been too dense to realize it. This amazing guy who is my biggest supporter and always there, despite everything. Who is kind, amazing, smart, talented, and gorgeous. An amazing guy who for graduation made my very own baseball card.” </p>\n<p>Stiles flushes, a violent mix of emotions inside him. “The guy you’re describing doesn’t exist. He sounds too perfect.”</p>\n<p>“He’s perfect for me, and he’s standing right in front of me.” Derek reaches out and cups Stiles’ face. “Stiles, will go to prom with me?”</p>\n<p>Stiles giggles stupidly, but throws his arms around Derek, kissing him hard. Derek slides his arms around Stiles’ waist and holds him tightly. Stiles feels light-headed, like he’s floating on air and the only thing that’s keeping him grounded is Derek’s arms around him. </p>\n<p>“Not confused anymore?” Stiles asks when they part. </p>\n<p>Derek shakes his head with a smile. “I shouldn’t have been confused in the first place.”</p>\n<p>“Why?”</p>\n<p>“Because it’s you,” Derek says, dragging his knuckles down Stiles’ cheek. “Everything with you has always been so simple. This was simple, too. I just was too dumb to see it.”</p>\n<p>“You could have said something,” Stiles points out. “I’ve been miserable for like a week, thinking you thought it was a mistake.”</p>\n<p>“Nothing with you has ever been a mistake.”</p>\n<p>Stiles leans forward and kisses Derek. “Well, we’re here now, right where we belong. That’s what matters.”</p>\n<p>“You’re what matters,” Derek says quietly. “It may have taken me awhile to realize it, but you belong with me.” He kisses Stiles again.</p>\n<p>When Derek pulls away from him, Stiles whines in disappointment. Derek laughs and says, “I’m coming right back,” as he opens the driver’s side door, rolls down the windows, and turns on the radio. Then, he grabs Stiles’ hand and leads him into the parking space beside them. A soft melody floats from the car, and Derek asks, “Will you dance with me?”</p>\n<p>“Derek Hale, you are such a cheeseball,” Stiles says, but he’s smiling widely.</p>\n<p>“It’s my senior prom,” Derek says. “I want to dance with my boyfriend.”</p>\n<p>“Your boyfriend?” Stiles stares at him in shock, and Derek looks embarrassed. </p>\n<p>“Is that okay?”</p>\n<p>“Are you kidding me?” Stiles exclaims. “Derek, I love you, of course it’s okay.” Stiles stares at Derek wide-eyed when he realizes what he let slip. “I mean, I, well, you see –“</p>\n<p>Derek cuts him off with a kiss. “I love you, Stiles.” He looks at him seriously. “I am one hundred percent in love with you.”</p>\n<p>Stiles can’t handle all the emotions he feels inside, so he kisses him again. They fall into a slow dance, more just a shuffling from side to side as they cling to one another, Stiles’ head resting against Derek’s.</p>\n<p>After a few songs, Stiles says, “That was really nice what you did for Jennifer.” He kisses the side of Derek’s face. “You’re so kind; it’s one of the things I love about you.” Derek just kisses him in response. “Still could have told me, you know. Or talked to me.”</p>\n<p>“I told you I was confused,” Derek says.</p>\n<p>“Via a white board. That doesn’t count.”</p>\n<p>Derek sighs in aggravation. “I’m not confused anymore.”</p>\n<p>“Good,” Stiles grins, then kisses Derek. But as Derek slips his tongue into Stiles’ mouth, he gets distracted and pulls back. Derek looks irritated and tries to kiss him again. “Wait, who won prom queen?”</p>\n<p>Derek laughs. “Lydia.”</p>\n<p>Stiles throws his head back and laughs. “Good for her.” Derek spins him in a circle.</p>\n<p>They dance away most of the night.</p>\n<p>*</p>\n<p>Sunday, Stiles sleeps in past noon. He spends the afternoon with his dad, and the only thing the sheriff says when Stiles tells him that he and Derek are now boyfriends is, “No more spending the night with each other.” Stiles figures that’s fair.</p>\n<p>After his dad goes to work, Stiles is working on his research paper on <i>The Scarlet Letter</i>when he sees the red laser pointer skitter across his book. He twists around in his desk chair to see Derek standing at his window, holding his whiteboard.</p>\n<p>\n<i>What are you doing?</i>\n</p>\n<p>Stiles grins and writes on his whiteboard, <i>Paper. You could text you know.</i></p>\n<p>Derek frowns and shakes his head as he writes, <i>I like these things. We won’t get to use them much longer.</i></p>\n<p>\n<i>:( Don’t remind me.</i>\n</p>\n<p>\n<i>Can I come over?</i>\n</p>\n<p>Stiles grins. <i>Dad’s not home.</i></p>\n<p>Derek drops his whiteboard and rings his doorbell a minute later. As soon as Stiles has let Derek inside the house and has relocked the door, Derek is immediately on him, kissing him and sliding his hands beneath Stiles’ t-shirt.</p>\n<p>“Whoa, down boy,” Stiles finds himself saying. And honestly, he never thought he’d say those words. Especially to Derek. “Want to maybe wait until we get to my bedroom before you ravage me?”</p>\n<p>“Not really,” Derek murmurs from where he’s sucking gently on Stiles’ neck.</p>\n<p>“Stairs,” Stiles says, slithering out of Derek’s arms so he can ascend the stairs. Derek reaches out and grips him by the hips, holding on to him until they’re inside Stiles’ bedroom. Derek wraps himself around Stiles again and walks him backwards until Stiles’ legs bump against his bed. Then Stiles pulls Derek down to the bed with him.</p>\n<p>They start making out again, mouths hot and heavy as their hands start roaming. Stiles feels like he will never get used to this, to the weight of Derek’s body on his, the gentle scrape of Derek’s stubble against his face, the feel of Derek’s hot tongue. And when Derek slides his hands underneath Stiles’ shirt, he moans as it goes straight to his cock. And all Derek did was touch his side.</p>\n<p>Before long, they’ve both got their hands shoved under each other’s shirts, and Stiles shifts, and <i>oh</i>, that is Derek’s hard cock. Brushing up against his hard cock. He releases a muffled moan against Derek’s mouth and rolls his hips, and Derek rolls his in response. They start rutting against one another, Derek’s hard cock rubbing against his own. This, well, Stiles thinks, this is awesome. Derek is on top of him, hips moving in an uncoordinated rhythm to match Stiles’ as they kiss like they’re trying to suck each other’s face off, Derek’s hands sliding beneath his shirt and lightly thumbing his nipples.</p>\n<p>Each of Stiles’ limbs are tingling from the tips of his fingers and toes straight to his core. Something about this feels dirty, getting off from just this, just rubbing against each other until they come. Stiles wants to try everything with Derek, wants everything of Derek stuck inside all of him, but right now this is perfect.</p>\n<p>“I’m close,” Derek mumbles against where he’s mouthing at Stiles’ jaw. </p>\n<p>“Me too,” Stiles whispers.</p>\n<p>Derek reaches down between them and cups Stiles through his shorts and starts rubbing along his length, and the feel of Derek’s hand is so great and unexpected that Stiles arches off the bed and comes right then. Derek keeps rubbing him through his orgasm, dropping kisses all over his neck, jaw, and cheeks as Stiles falls back to the bed, Derek’s hand stroking him through aftershocks.</p>\n<p>“That was so fucking hot,” Derek says, kissing Stiles’ mouth as he starts rubbing himself off on Stiles’ thigh. Stiles can barely move, his entire body turned to jelly; he reaches down and tries to touch Derek like he touched him, but he doesn’t have the energy, so he just runs his hand around the globes of Derek’s ass. </p>\n<p>He feels it the moment Derek comes, his body tensing and Derek grunting through a soft moan. It is quite possibly the hottest sound Stiles has ever heard, and he wants to cause Derek to make it over and over again. Derek’s hips speed up, but then slow as he rides out his orgasm, and soon he kind of just collapses half on top of Stiles.</p>\n<p>Stiles runs his fingers through Derek’s hair lightly, reveling in the warmth and closeness. He just had sex, kinda. He just had an orgasm with the help of another person. And not just any person, but with Derek. Just because he and Derek didn’t do any below the belt touching, nothing was going to take away how awesome that was.</p>\n<p>“I hope that was okay,” Stiles says against Derek’s hair. He closes his eyes and inhales the scent of Derek’s shampoo, then kisses Derek’s forehead.</p>\n<p>“Of course it was,” Derek says. “Why wouldn’t it be?”</p>\n<p>Stiles shrugs. “You’re used to more than some dry humping, and – “</p>\n<p>“Hey,” Derek says, pushing himself onto his elbows. Stiles’ heart clenches in his chest. Derek’s hair is mussed, his cheeks pink, and his eyes bright. He looks blissed out and happy, and all Stiles can think is <i>I put that look there.</i> </p>\n<p>Derek says, “Don’t ever compare yourself to anyone else.” He leans forward and pecks Stiles on the lips. “What I did with her doesn’t even compare to this. So,” he pauses and stares at Stiles like he just can’t get enough of him, “don’t do it, okay? This is us. Something new, but completely comfortable. And dry humping with you was awesome.” He leans down and hovers just above Stiles’ mouth, “Because it was with you, and you’re so beautiful when you come.”</p>\n<p>Stiles blushes and looks away, and Derek forces him to look him in the eye as he kisses him.</p>\n<p>*</p>\n<p>Stiles and Derek don’t hide their new relationship from their friends, but they don’t exactly advertise it at school either. They don’t walk down the hallway holding hands, and they don’t act as anything more than friends. Derek only has two weeks until graduation, and after everything that’s happened, Stiles just wants to keep a low profile. </p>\n<p>Stiles spends a lot of time at the Hale’s cuddling with Derek on the couch while watching movies and playing video games with him, Cora, and Laura, and Derek comes over to his house for dinner a few nights. They mostly fool around when the sheriff is at work, because the one time they rubbed off against one another in Derek’s bedroom, Laura and Cora made suggestive comments the rest of the night. </p>\n<p>At school, Derek sits between Stiles and Boyd at lunch, and takes over Stiles’ spot as Kira’s Spades partner. Lydia wears her prom queen crown to school the Monday after prom, but after that, no one really talks about prom queen anymore. It’s all about graduation.</p>\n<p>The last week of school, Stiles is at his locker between classes when Derek runs up to him, nearly vibrating with excitement.</p>\n<p>“What is it?” Stiles asks, slamming his locker shut.</p>\n<p>Derek just smiles at him, so happy he can barely form words. “<i>Baseball America</i> named me their High School Player of the Year!” Derek exclaims. </p>\n<p>“Oh shit!” Stiles yells as his heart nearly bursts with pride. He knows this is one of the highest honors a high school baseball player could receive, and most of the former recipients have gone on to have major league careers. This is a huge deal. </p>\n<p>Stiles doesn’t know what to say, so he screams in excitement. They’re starting to draw a crowd with their outburst, but Derek ignores that as he lifts Stiles up and twirls him around excitedly. When he lowers him back to the floor, he doesn’t let go as he kisses Stiles deeply. A few people catcall, a few make rude comments, but Stiles tunes it all out.</p>\n<p>Stiles is so happy, he’s pretty sure none of this is real.</p>\n<p>He just keeps reminding himself that it is.</p>\n<p>*</p>\n<p>\n<b>Epilogue</b>\n</p>\n<p>Stiles keeps looking out the window every five minutes. Derek said he would be home at 4:00, and it is already 4:05, and Derek is <i>not home yet.</i></p>\n<p>Stiles is totally not the clingy, crazy boyfriend. Actually, he’s learned over the last few months he’s a pretty chill boyfriend. Things he always thought would make him jealous or crazy don’t bother him with Derek. Maybe that’s because of the way Derek looks at him. Stiles still melts every time Derek looks at him with those eyes of his.</p>\n<p>But Derek has been at baseball camp for six <i>long</i> weeks. And he moves to college in a few weeks, so every minute Derek isn’t home is one he loses with him.</p>\n<p>Finally, around 4:30, Derek’s Camaro pulls in the driveway. Stiles is immediately out of the door and running across their yards. Derek’s barely out of the car before Stiles jumps on him, wrapping his arms and legs around Derek and kissing him.</p>\n<p>“Mmm, hello to you, too,” Derek mumbles against Stiles’ mouth, holding him tightly as he kisses him. The kiss is uncoordinated and desperate, but he hasn’t kissed Derek in six weeks, okay? He has needs.</p>\n<p>“You could at least let him get in the driveway before you climbed him like a tree,” Cora drawls as she comes walking down the front steps.</p>\n<p>“Do you two know the meaning of discretion?” Laura asks. Stiles lets go of Derek long enough to flick her off.</p>\n<p>“Now, girls, leave your brother alone. They’re cute,” Peter says. And that’s Stiles’ cue to let go of Derek and maybe start breathing again.</p>\n<p>“I missed you,” Derek says, kissing Stiles’ temple as he walks around to the trunk of his car.</p>\n<p>After Derek greets his family and they all go out to dinner (Peter’s treat), Stiles and Derek sneak over to Stiles’ house so they can finally be alone. They kiss all the way up the stairs, Derek holding Stiles up each time he stumbles on the steps. When they’re finally in Stiles’ bedroom, they quickly strip off their shirts and fall onto the bed.</p>\n<p>“You’re so fit now,” Stiles says, straddling Derek’s lap and running his hands along newly formed muscles and lines. “You’ve been getting the perfect body, and I’ve been sitting around with Scott eating Cheetos and playing video games.”</p>\n<p>“I don’t see anything wrong with your body.” Derek lifts up and licks a line along Stiles’ sternum, then starts lapping at one of his nipples. Stiles allows his eyes to drift shut as he focuses on Derek’s tongue against him after being without it for so long.</p>\n<p>“I’m glad you can have visitors at college,” Stiles says breathlessly, “because this whole not seeing you thing sucked. I can’t go through it again.”</p>\n<p>“We talked every night,” Derek says, moving on to Stiles’ other nipple. “And video chatted.”</p>\n<p>“Not the same, dude.”</p>\n<p>Derek hooks an arm around Stiles’ waist and flips them so Stiles is on his back. He gives Stiles a feral grin before kissing his way down Stiles’ torso. Stiles’ belly quivers with anticipation, all his blood and thoughts going straight to his cock. </p>\n<p>Derek dips his tongue inside Stiles’ bellybutton in teasing little motions, then drags his tongue along the trail of hair disappearing beneath the waist of Stiles’ pants. Stiles watches through heavy-lidded eyes, his entire body tense as Derek looks up at him through his lashes.</p>\n<p>“You’re killing me,” Stiles says, voice low and breathy. Derek kisses the dip of Stiles’ hip as he unbuttons his pants, then hooks his thumbs underneath the band of his underwear to pull them off. Stiles is both excited and nervous; before Derek left for summer baseball camp, they had moved from just frottage to handjobs and naked rubbing. But blowjobs were something completely new.</p>\n<p>Stiles watches as Derek studies Stiles’ cock with interest, his hand wrapped around the base. Stiles knows this is one of their shared firsts, and Stiles likes those the best, the things that he and Derek can experience together. </p>\n<p>Derek slides his lips over the head of Stiles’ cock, and Stiles moans at the sensation. It feels nothing like the other things they’ve done, the warmth of Derek’s mouth around his shaft quite possibly the best feeling in the world. Stiles can’t help but reach out and slide his fingers into Derek’s hair, holding him as Derek bobs his head. Each movement is shallow, Derek unable to take Stiles’ full length just yet, but Stiles doesn’t care. He knows they have plenty of time to practice, and right now he’s not sure he could even handle it.</p>\n<p>“Derek,” Stiles moans, his hand tightening as Derek grows more confident. He sucks Stiles harder, his tongue swirling around the crown of Stiles’ cock with every upward thrust. “I’m going to come,” he warns, but Derek just curls his free hand around Stiles’ hip and increases his efforts.</p>\n<p>The sensations build as Stiles gets closer and closer, the pleasure pooling low in his belly until he emits a choked moan and comes in Derek’s mouth. Derek swallows most of it, only a bit spilling over and down his chin. Stiles almost comes again on the spot as he watches a thin line of come dribbling from his mouth.</p>\n<p>He drops back onto the bed, panting heavily as Derek crawls up beside him, wiping his mouth with one of their discarded shirts. Stiles reaches up and pulls him down into a kiss, unable to believe that he’s tasting his own come on Derek’s lips.</p>\n<p>“Please tell me you didn’t practice that at baseball camp,” Stiles says, and Derek punches him in the arm. “Ow! That’s no way to treat your sexed out boyfriend.”</p>\n<p>“How dare you even imply something like that,” Derek grumps, his eyebrows drawn and unhappy. </p>\n<p>“Was it weird?” Stiles asks. He always asks Derek questions like this, making him compare his experience with women and men. Usually Derek just grunts at him and gets irritated that Stiles is making him compare. It’s no different tonight.</p>\n<p>“It tasted better than I imagined,” Derek says, his tongue darting out to lick at his lips. “I kinda loved it.”</p>\n<p>“I did, too,” Stiles says. “So, please, feel free to suck my dick anytime you want.”</p>\n<p>Derek rolls his eyes and starts back in on attacking Stiles’ mouth.</p>\n<p>Later, after Derek has gone back home, Stiles sees his light on and walks to the window. Derek sees him and smiles. </p>\n<p>Stiles picks up the whiteboard and writes, <i>I’m glad you’re home.</i></p>\n<p>Derek responds, <i>I’m glad I’m home, too.</i></p>\n<p>-fin</p>"
}