{
  "id": "17045498",
  "url": "https://archiveofourown.org/works/17045498?view_full_work=true",
  "author": [
    "teaandtumblr"
  ],
  "title": "Second Lap Around The Block",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
  ],
  "relationships": [
    "Dabi/Hawks (My Hero Academia)",
    "Aizawa Shouta | Eraserhead/Yamada Hizashi | Present Mic"
  ],
  "characters": [
    "Dabi (My Hero Academia)",
    "Todoroki Touya",
    "Hawks (My Hero Academia)",
    "Aizawa Shouta | Eraserhead",
    "Yamada Hizashi | Present Mic",
    "Tsukauchi Naomasa",
    "Tamakawa Sansa",
    "Yagi Toshinori | All Might",
    "Shuuzenji Chiyo | Recovery Girl",
    "Todoroki Enji | Endeavor",
    "Todoroki Rei",
    "Midoriya Izuku",
    "Todoroki Shouto",
    "Todoroki Fuyumi",
    "Todoroki Natsuo"
  ],
  "additional_tags": [
    "Age Regression/De-Aging",
    "quirk hijinks",
    "Todoroki Enji | Endeavor's Bad Parenting",
    "Dabi is Todoroki Touya",
    "Fluff and Angst",
    "Implied/Referenced Child Abuse"
  ],
  "language": "English",
  "series": "",
  "published": "2018-12-18",
  "completed": "2019-03-02",
  "words": "19,632",
  "chapters": "7/7",
  "comments": "1,776",
  "kudos": "22,468",
  "bookmarks": "4,202",
  "hits": "196,019",
  "summary": "<p>\n<em>“No.”</em>\n</p>\n<p>\n<em>It’s a fair response.</em>\n</p>\n<p>\n<em>“And you found him because…?”</em>\n</p>\n<p>\n<em>An even better response. Hawks isn’t in the mood to answer it though. “I heard a cry; I was first on scene.”</em>\n</p>\n<p>\n<em>Naomasa nods and everyone else buys the tale. They’re all looking at one thing only. Specifically, the A-Rank villain known as Dabi who is, for all intents and purposes, currently five years old.</em>\n</p>\n<p> </p>\n<p>aka, Dabi is turned into a child and suddenly turns a lot more talkative, leading to some (possibly unwanted) revelations.</p>",
  "notes": "<p>I was torn between writing a fic about Dabi and writing a kid fic before deciding, \"why don't we have both?\" :)))</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">more notes</a>.)\n</p>\n<p>There we are! Hope you enjoyed this little fic :))) I've also left this unfinished in case people would like to see more. If so, who would you like to see? .xx Dan</p>\n<p>so a lot of people wanted more so here we go! Touya finally gets to meet his mother :)))</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>Thanks again for reading and commenting! .xx Dan</p>\n<p>now let's see who turned up!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>Next time: Todoroki bro hang day ! :)) .xx Dan</p>\n<p>it's time to see what the Todoroki bros have been up to!!! Also, you may notice a relationship tag up the top now but it's not going to come into play too much, but it'll be brought up next chapter :))</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">more notes</a>.)\n</p>\n<p>Next time: Hotwings reunite~! .xx Dan</p>\n<p>not dead, just been playing Kingdom Hearts III.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">more notes</a>.)\n</p>\n<p>well...things just got a bit more complicated. .xx Dan</p>\n<p>so we've somehow ended up with only one chapter left but that's just the way it goes, I guess. XD Hope you like this chapter!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">more notes</a>.)\n</p>\n<p>...uh oh. ;) .xx Dan</p>\n<p>welcome to the finale! Let's do this people!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_7_endnotes\">more notes</a>.)\n</p>\n<p>Happy ending! Thank you everyone who joined me on this journey; it's been fun! .xx Dan</p>",
  "text": "<p><br>\n<br>\n</p>\n<p>\n<span>***</span>\n</p>\n<p> </p>\n<p>\n<span>“No.”</span>\n</p>\n<p>\n<span>It’s a fair response.</span>\n</p>\n<p>\n<span>“And you found him because…?”</span>\n</p>\n<p>\n<span>An even better response. Hawks isn’t in the mood to answer it though; nor does he have one that won’t compromise the state of his mission so instead he shrugs and says, “I heard a cry; I was first on scene.”</span>\n</p>\n<p>\n<span>Naomasa nods and everyone else buys the tale - which is relief because how Hawks was going to explain trudging through back alleys with a <em>villain</em>, he doesn’t know. There’s a mixed bunch of people in the room - Naomasa, Sansa, Toshinori, Aizawa, Yamada - but they’re all looking at one thing only. Specifically, the A-Rank villain known as Dabi who is, for all intents and purposes, currently five years old.</span>\n</p>\n<p>\n<span>Hawks is supposed to not know what it happened but he does. A simple accident, a young girl with a quirk she couldn’t control, and suddenly they’re here.</span>\n</p>\n<p>\n<span>Here could be worse, Hawks reasons. At least, at five years of age, Dabi hasn’t tried to murder him yet. Well, to be honest, that probably comes down to the fact that once the quirk had taken effect, Dabi had seemingly lost all memory up until that point and his mental age seems to have regressed as well. He’d come with Hawks only after he’d flashed his hero license and was confident they were going to the police. He’d fallen asleep on the way over which leads them to where they are now: Dabi asleep on Detective Naomasa’s office couch.</span>\n</p>\n<p>\n<span>The change is startling, Hawks knows. He can see it on everyone’s faces too. The scars are gone, and with it the accompanying staples. Dabi’s tiny for his age, barely reaching even <em>Hawks</em>’ waist. There are no piercings on his face but perhaps his most defining feature is his red hair. It’s such a difference from the usual black.</span>\n</p>\n<p>\n<span>“What are we going to do with him?” Toshinori asks, coming to crouch beside the sofa and watching Dabi as he sleeps on.</span>\n</p>\n<p>\n<span>“We’ll have to question him, of course,” Naomasa sighs, running a hand through his hair. “But besides from that…” His gaze flicks to Aizawa. “You have experience with this sort of-”</span>\n</p>\n<p>\n<span>“<em>No</em>.” Aizawa’s voice is painfully firm. “This isn’t like Shinsou or Eri. This is a villain.”</span>\n</p>\n<p>\n<span>“He’s a <em>child</em>,” Naomasa stresses.</span>\n</p>\n<p>\n<span>“He tried to kill my husband!” Yamada screeches.</span>\n</p>\n<p>\n<span>Dabi flinches in his sleep, a frightened whimper escaping and despite his talk, Aizawa’s hand is the first to land on his shoulder, shushing the boy and coaxing him back to sleep. Dabi settles with a deep exhale, slipping under once more.</span>\n</p>\n<p>\n<span>“I can’t,” Aizawa says quietly and Hawks knows that’s that even without having to look at Naomasa’s face.</span>\n</p>\n<p>\n<span>“I could try,” Toshinori offers. “Although I’ll admit to having never cared for a child before.”</span>\n</p>\n<p>\n<span>“Who’s to say you even have to?” Hawks asks, giving one of his wings a shake as it starts to itch. “This quirk could wear off any second. You’re almost better off keeping him here.”</span>\n</p>\n<p>\n<span>“He’s right,” Sansa agrees, gaze watchful.</span>\n</p>\n<p>\n<span>No one gets to say anymore there though because it seems Aizawa wasn’t as successful as they’d thought. Dabi stirs and slowly opens his eyes. He blinks at being surrounded before scrambling up. He nearly falls off the couch, Yamada supporting him with a hand.</span>\n</p>\n<p>\n<span>“Easy there, little listener. You’re alright, you’re with the police.”</span>\n</p>\n<p>\n<span>Naomasa hands over his badge, Dabi rolling it over in his tiny hands before giving it back. His voice, when he speaks, is so, so quiet. It’s barely above a whisper and Hawks feels his heart break because somehow he can tell that this is his regular volume. “Am I going home now? Did you call my mother?”</span>\n</p>\n<p>\n<span>“Not yet,” Naomasa says gently, taking a seat on the coffee table as Toshinori backs away.</span>\n</p>\n<p>\n<span>To their shock, Dabi’s eyes fly to the window before widening. “I have to go!” he says suddenly, trying to get to his feet only to be sat back down by Aizawa. “P-please! I have to go!”</span>\n</p>\n<p>\n<span>“Go where?” Aizawa drawls.</span>\n</p>\n<p>\n<span>“Home,” he stammers, squirming harder. “If I’m not home before dark then Mother will get in trouble and Father will...will…” Dabi can’t seem to continue, dissolving into tears.</span>\n</p>\n<p>\n<span>Aizawa hisses and all his words are suddenly out the window. He’s rounding the couch faster than even Hawks could, drawing Dabi to his chest and smoothing his hair down. “It’s fine kid. They know, okay? They know you’re here.”</span>\n</p>\n<p>\n<span>Dabi pauses, pulling away with a sniff. “Father too?” Aizawa nods, Dabi shying away. “Was he...angry?”</span>\n</p>\n<p>\n<span>There’s a pause before Naomasa answers. “He...understood.”</span>\n</p>\n<p>\n<span>Dabi’s expression flattens. “Father doesn’t…” He then stares at his lap glumly. “Of course; you’re the police. Father <em>can’t</em> be angry at you.”</span>\n</p>\n<p>\n<span>“Wherever your father is, I’m sure he isn’t angry,” Toshinori tries.</span>\n</p>\n<p>\n<span>Dabi snorts, and it’s the first time Hawks sees him looking like his future self. “Father’s <em>always</em> angry,” he spits. “That’s why he hits us. That’s why he hurts Mother. That’s why she cries all the time.”</span>\n</p>\n<p>\n<span>Hawks winces, as do a few others in the room. Naomasa suddenly has a pen and paper in his hands, leaning forward ever so slightly. “What’s your father’s name?”</span>\n</p>\n<p>\n<span>“Naomasa,” Aizawa warns quietly. “Don’t. You can’t stop this.”</span>\n</p>\n<p>\n<span>The detective swears but Hawks knows Aizawa’s right. All of this happened a long time ago. They can’t stop it now. Dabi looks between them in confusion but he never answers the question. Interesting. Hawks gives him a nudge but Dabi shakes his head furiously. Somehow though, the switch has been flipped and from that point on, Dabi won’t talk to them at all. Clearly he’s more terrified of his father than he is of them.</span>\n</p>\n<p>\n<span>“I hate this,” Aizawa says once they’ve left the room and Dabi is alone with Sansa, drawing with some pencils they found in a storeroom. “I don’t want…”</span>\n</p>\n<p>\n<span>Yamada pulls him into his arms. “You don’t want to feel sorry for him. I get it Shouta.”</span>\n</p>\n<p>\n<span>“Life gets rough for the kid,” Hawks sighs, peering in the window. “I mean, I don’t feel like I’m looking at a villain right now.”</span>\n</p>\n<p>\n<span>“No one is born a villain,” Toshinori says, and there’s something painful in there that Hawks doesn’t understand. “They’re made them by circumstances. I only wish we could stop those circumstances sooner. Not just for Dabi, but for all villains.”</span>\n</p>\n<p>\n<span>“You’ve been the number one hero for too long,” Aizawa grouses, removing himself from Yamada’s embrace. “You can’t save everyone.”</span>\n</p>\n<p>\n<span>Toshinori glares at him but Naomasa comes between them, shaking his head. “This is no place for such an argument. And really, you two shouldn’t be having it at all. You’re adults and heroes for your own reasons. Keep it that way.”</span>\n</p>\n<p>\n<span>Toshinori looks suitably scolded, Aizawa merely defensive. Before anything else can be said though, Sansa is gesturing through the window silently and that’s enough to grab their attention. It’s for good reason too because Dabi has since shifted and is leaning over the table to draw. Which gives them a wonderful view of his back...and the plethora of bruises that cover it. He may have been changed into clothes roughly his size, but shirts ride up and what was hidden underneath this one is enough to make Hawks’ stomach turn.</span>\n</p>\n<p>\n<span>“I didn’t do that to him on the way over,” is the first thing he says.</span>\n</p>\n<p>\n<span>“I’m sure not,” Naomasa murmurs even as Toshinori goes pale and Aizawa’s jaw clenches.</span>\n</p>\n<p>\n<span>“If his <em>father</em> did that to him,” Aizawa hisses, Yamada placing a hand on his arm even as he’s on the phone. Hawks wonders who he’s calling but Yamada answers that himself soon enough.</span>\n</p>\n<p>\n<span>“Recovery Girl’s on her way. If nothing else, she can make him feel a little better.”</span>\n</p>\n<p>\n<span>There’s nothing they can do except wait for Chiyo to arrive. She bustles her way in a good half an hour later. Dabi has since grown bored of drawing but is still locked in the detective’s office - not that he knows it. He’s taken to asking Sansa about his quirk or at least, the cat related aspects of it. The first thing Chiyo does is dismiss Sansa before ushering Dabi back onto the sofa he’d occupied previously. Dabi’s apprehensive, that much is obvious, but it’s obvious Chiyo has done this before.</span>\n</p>\n<p>\n<span>“I’ve been asked to check over you,” she says, placing a hand on his knee. “My name’s Chiyo. My quirk can heal people.”</span>\n</p>\n<p>\n<span>Dabi’s interest is gained there, feet swinging. “Can you heal everything?”</span>\n</p>\n<p>\n<span>“Most things,” Chiyo replies with a hum, going through the whole rigmarole of checking his reflexes and shining lights in his eyes. “And what about you? Do you have a quirk?”</span>\n</p>\n<p>\n<span>Dabi freezes. Chiyo doesn’t push him though and eventually he whispers, “I have one. I don’t use it though. It hurts people. I don’t want to hurt people.”</span>\n</p>\n<p>\n<span>Chiyo frowns, as do Aizawa and Naomasa. “Quirks don’t hurt people unless we want them to,” she scolds. “And if you don’t use it, how will you learn to control it?”</span>\n</p>\n<p>\n<span>“If I don’t use it, I don’t need to control it,” Dabi argues back, though his shoulders are hunched over, showing how unconfident he really is.</span>\n</p>\n<p>\n<span>“I see,” is all Chiyo says. “I can’t help but notice your shoulders look stiff. Does your back hurt?”</span>\n</p>\n<p>\n<span>Dabi reels back, shaking his head furiously. One look from Chiyo has him wilting though. With great, <em>great</em> reluctance he turns around, lifting his shirt. Hawks’ stomach drops to the floor and Aizawa swears. Because Dabi looks <em>terrible</em>. His skin is mottled because of how extensive the marks are and, with a shiver, Hawks notes how similar he looks to his adult state.</span>\n</p>\n<p>\n<span>“This looks bad,” Chiyo tuts, looking but not touching. “Can you tell me what happened?”</span>\n</p>\n<p>\n<span>“It’s nothing,” Dabi murmurs, tugging his shirt back down and wrapping his arms around his chest vulnerably. “It’s just training. I...Father says I have a good quirk. That I...I can be better than All Might and I...I need to train. It’s just training,” he repeats hoarsely. “Training to be the best.”</span>\n</p>\n<p>\n<span>There’s a sob from his left, Hawks’ eyes flying over to see Toshinori hiding his face in a hand as his shoulders shake. “That isn’t…” he chokes on his next words. “I...That isn’t what being the number one hero is about. To do that...to your <em>child</em>…”</span>\n</p>\n<p>\n<span>The once Symbol of Peace breaks down further, Naomasa sighing and rubbing his back soothingly. “This isn’t your fault,” he murmurs but all Toshinori does is shake his head. Hawks agrees.</span>\n</p>\n<p>\n<span>Their attention is ripped away though when Chiyo flips open a file, tapping at something at the top. “Oh dear, look at this. They didn’t even write your name down! How silly.”</span>\n</p>\n<p>\n<span>Dabi giggles there. The villain <em>fucking giggles</em>.</span>\n</p>\n<p>\n<span>But then the weight of that sentence slams into them all. Because no one knows Dabi’s identity. They hadn’t, in all honesty, even <em>thought</em> to ask. If Hawks had to guess, it’s because they all simply assumed Dabi was Dabi. They hadn’t thought to look at that deeper level.</span>\n</p>\n<p>\n<span>“Touya,” Dabi supplies - or Touya, Hawks supposes, although that feels wrong.</span>\n</p>\n<p>\n<span>“Touya,” Chiyo parrots, writing that down. “What a lovely name.”</span>\n</p>\n<p>\n<span>Dabi blushes and dammit, villains aren’t meant to be cute, even in child form! Hawks pushes that thought aside even as Naomasa is hastily scribbling down the name. He knows that before the day is out, Dabi’s real identity will be known by everyone in the hero community.</span>\n</p>\n<p>\n<span>“And here?” Chiyo asks, indicating a different empty box; Touya’s family name, if Hawks had to guess. </span>\n</p>\n<p>\n<span>Dabi leans over to see better, all too chipper when he answers. “Todoroki!”</span>\n</p>\n<p>\n<span>The whole room stills. It’s like the air gets sucked out of the office. Hawks thinks every inch of body heat has left him. Toshinori is paler than Hawks has ever seen, while Aizawa looks ready to murder. Even Recovery Girl looks thrown, so much so that Dabi’s head cocks to the side, all five-year-old innocence.</span>\n</p>\n<p>\n<span>“Do you want me to write it?” he asks, all politeness. “I can!” </span>\n</p>\n<p>\n<span>He takes the pen and writes the kanji and even as slow and wobbling as he is, Hawks knows what Dabi’s writing. He isn’t lying. Todoroki Touya, aka Dabi. It’s at this point Chiyo regains her wits even if Dabi seems bored now, comfortable enough around her to climb all over the couch. Complimenting him, it seems, did wonders.</span>\n</p>\n<p>\n<span>“Can you tell me who’s in your family?” Chiyo asks, just to dig the hole deeper, to confirm what they already know.</span>\n</p>\n<p>\n<span>Dabi shrugs and nods all at the same time. “There’s Father and Mother. Father has a fire quirk and I don’t like him. Mother has an ice quirk but she’s nice.” He grins there before bouncing up and down a few times. “And there’s Fuyumi; she’s three, I’m five! And Natsuo too but he’s only a baby. I don’t know his quirk yet. But we don’t have the perfect quirk,” Dabi babbles on. “Father says even though I’m strong, I can’t really beat All Might so Mother has to have more babies.”</span>\n</p>\n<p>\n<span>Toshinori drops into a chair then and Hawks would have thought he’d fainted if not for the fact that his eyes are very much open and tears are streaming down his cheeks.</span>\n</p>\n<p>\n<span>“And so he makes Shouto,” Aizawa growls, Yamada grabbing him before he can punch something. “Like his wife and children are nothing more than mere <em>tools</em>.”</span>\n</p>\n<p>\n<span>Hawks can’t wrap his head around the concept itself. Even as more and more of Dabi’s traits and frivolous throw away lines start to fall into place, Hawks still struggles to believe it because it’s <em>Endeavour</em>. And Endeavour is everything he’s ever wanted to be but he can’t be if he’s like <em>this</em>. </span>\n</p>\n<p>\n<span>Naomasa stopped writing long ago. He looks like he doesn’t know what to do. Hawks doesn’t blame him.</span>\n</p>\n<p>\n<span>“-nd here, I’m on a rainbow,” Dabi is explaining to Chiyo, pointing at his drawing like he hasn’t just potentially torn the station and the current hero rankings apart.</span>\n</p>\n<p>\n<span>“And where are you going?” Chiyo prods, barely holding herself together from what Hawks can tell.</span>\n</p>\n<p>\n<span>“Away,” is all Dabi says, Hawks swearing.</span>\n</p>\n<p>\n<span>Chiyo ruffles his hair, handing him some gummies. “Well, you seem alright to me now Touya. I’ll show the detective back in, alright?”</span>\n</p>\n<p>\n<span>Dabi shrugs, unconcerned. Chiyo makes it as far as the door before turning around, asking one last question. “When you grow up young Touya, what do you want to be? What do you want to do?”</span>\n</p>\n<p>\n<span>“What do I want to do?” Dabi repeats. He frowns for a moment before grinning and it looks so, so wrong. “When I grow up, I’m going to kill my father.”</span>\n</p>\n<p> </p>\n<p>\n<span>***</span>\n</p>\n<p><br>\n<br>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>***</span>\n</p>\n<p> </p>\n<p>\n<span>“I’ll take him.”</span>\n</p>\n<p>\n<span>Everyone whips around even as Yamada is stammering incomprehensibly. “Sh-Shouta, you can’t! He’s-”</span>\n</p>\n<p>\n<span>“A villain?” Aizawa asks before shaking his head, eyes turning to the room Dabi is in, pushing a toy truck across the coffee table. “Naomasa was right. This is a <em>child</em>. A scared one.”</span>\n</p>\n<p>\n<span>“Aizawa,” Naomasa warns. “We don’t know when this quirk will wear off. It’s safest to keep him here. It’s what’s best.”</span>\n</p>\n<p>\n<span>“My quick can stop his,” he returns quickly enough. “And do you honestly believe that? Do you think you should keep a five-year-old here? Would you put him in a cell?”</span>\n</p>\n<p>\n<span>“Aizawa, that’s enough,” Toshinori says but Naomasa stops him with a hand, sighing.</span>\n</p>\n<p>\n<span>“No, he’s right. What we’re dealing with now is not Dabi, but <em>Touya</em>. The real best thing for him would be to return him to his family but…” Naomasa cringes. “With what he’s said, I <em>can’t</em>. In no way can I justify putting him into that situation.”</span>\n</p>\n<p>\n<span>The agreements are unanimous and Hawks has to make an excuse just so he can leave the room. The thoughts whirling through his head are too much and it feels like Dabi’s presence is looming over him. “I’ll head back to where I found him and see if there were any cameras nearby. The more we know about this quirk, the better.”</span>\n</p>\n<p>\n<span>Naomasa nods thankfully and Hawks takes his leave. Naomasa then shoots Toshinori a look and he reluctantly bids farewell as well. Everyone in the room knows his shoulders are weighed down with more than just pain and age old weariness now. This afternoon has taken its toll on the once Symbol of Peace. Some ugly things have come out and everyone has their own way of dealing. Whether it’s good or not is another question all together.</span>\n</p>\n<p>\n<span>“Are you sure?” Naomasa asks, one last time.</span>\n</p>\n<p>\n<span>Aizawa glances at Yamada who gives a helpless shrug before nodding. “We’re sure.”</span>\n</p>\n<p> </p>\n<p>\n<span>***</span>\n</p>\n<p> </p>\n<p>\n<span>If Aizawa had had any second guesses about Touya not being a real five-year-old, they’re dashed the moment Naomasa takes Touya aside and explains to him the truth of his situation. He can’t understand it - he’s actually twenty-four? He doesn’t live at home? He can’t see his family? It’s too much for a child and while he comes with Aizawa and Yamada, he cries all the way to their apartment. Not great heaving sobs but quiet sniffles, like he knows crying won’t get him any results but he’s too upset to hold it in. Aizawa pities him, scooping the kid up as soon as they park and tucking him into his neck.</span>\n</p>\n<p>\n<span>“Come on, let’s get inside.”</span>\n</p>\n<p>\n<span>Touya nods but a whimper still escapes. “I want Mother.”</span>\n</p>\n<p>\n<span>It’s all he’s asked for and it’s the one thing that’s impossible. Aizawa doesn’t know the details but he knows one simple truth: Todoroki Rei lives in the mental ward of a hospital. Touya absolutely cannot stay with her.</span>\n</p>\n<p>\n<span>Dinner is a quiet affair. Yamada tries to lighten the mood and while he gets a smile or two, he never gets a laugh. Touya showers when told to and comes back in an old shirt they’d found; it comes past his knees for how short he is. Aizawa bundles him up and tucks him into what was once Shinsou’s bed. He leaves the door open a crack and tells Touya to find them if he needs anything. Touya hesitates before catching his sleeve, eyes brimming with tears once more.</span>\n</p>\n<p>\n<span>“I was good,” he whispers, wiping his eyes with his spare hand. “I ate all my dinner and even the vegetables. I wasn’t loud and I didn’t make a mess. I was <em>good</em>,” he repeats brokenly. “Can I...Can I see Mother now? Am I not in trouble anymore?”</span>\n</p>\n<p>\n<span>Yamada swears from where he’s eavesdropping and Aizawa is dropping into a crouch at the same moment, brushing Touya’s hair back. “You aren’t in trouble kid. You never were. This is just...a quirk.”</span>\n</p>\n<p>\n<span>He doesn’t understand. “But…”</span>\n</p>\n<p>\n<span>Aizawa knows he’s going to regret this but it can’t hurt. “Sleep tonight and we’ll see your mother in the morning, alright?”</span>\n</p>\n<p>\n<span>Touya’s eyes widen before he nods quickly. He scrubs his face messily and then burrows under the blankets. He isn’t asleep by any means but there’s nothing more Aizawa can do. He murmurs a quiet goodnight before leaving the room. Yamada smiles at him weakly and Aizawa just drops onto the sofa. He’d forgotten how hard this was.</span>\n</p>\n<p>\n<span>He goes to sleep a couple of hours later to the sound of hiccuping sobs coming from the bedroom down the hall. </span>\n</p>\n<p> </p>\n<p>\n<span>***</span>\n</p>\n<p> </p>\n<p>\n<span>The morning goes a little better. Touya is a tad more talkative and smiles a little more but he’s also antsy. He wants to go, that much is obvious. Aizawa has to pull him up multiple times and warn him that he’s not staying with his mother, just visiting. Touya nods but Aizawa knows he doesn’t believe him. This afternoon is not going to be fun; not at all. </span>\n</p>\n<p>\n<span>But that’s later’s problem and Aizawa is now walking through the hospital corridors looking for Todoroki Rei’s room. Touya is silent at his side, overwhelmed by the hustle and bustle going on around them. He’s back in the clothes he’d worn yesterday, freshly washed and crisp. He’s on his absolute best behaviour and Aizawa cannot even fathom how this sweet child becomes everything Dabi is. Unfortunately, Touya can’t give him any answers. He, if anything, would only be <em>more</em> clueless.</span>\n</p>\n<p>\n<span>Rapping on the door labelled ‘<em>Todoroki</em>’, Aizawa’s met with a call to enter. Touya perks up, recognising the voice. He wrenches open the door before Aizawa can ask him to wait.</span>\n</p>\n<p>\n<span>“Mother!”</span>\n</p>\n<p>\n<span>The precise moment he does so is the precise moment Aizawa realises he should have done more research. Even as he’s reaching for Touya to haul him back, Todoroki Rei is screaming, lashing out and only missing Touya because Aizawa grabs him.</span>\n</p>\n<p>\n<span>“M-Mother?” Touya asks, shaking violently.</span>\n</p>\n<p>\n<span>“You’re not...you’re…” Rei is deathly pale and shaking almost as severely. “Take him away,” she begs.</span>\n</p>\n<p>\n<span>Aizawa scoops Touya up with a nod, grunting as the boy flails in his arms. “Touya, stop.”</span>\n</p>\n<p>\n<span>“No, but Mother!” Touya wails, trying to scramble over his shoulder. “Mother <em>please</em>, it’s me! Mother, it’s <em>Touya</em>! <em>Mother</em>!”</span>\n</p>\n<p>\n<span>Aizawa shushes him quite sternly as the elevator opens and Touya does but probably only because he’s sobbing into his shoulder. Aizawa sighs, chest heavy with guilt. “I’m sorry,” he murmurs, rubbing Touya’s back. “I didn’t know she would do that.”</span>\n</p>\n<p>\n<span>“What did I do?” Touya sobs. “Is it because I didn’t come home? You <em>said</em> you told Father!”</span>\n</p>\n<p>\n<span>“This isn’t because of that,” Aizawa grunts but Touya just kicks him petulantly.</span>\n</p>\n<p>\n<span>The elevator deposits them on the ground floor and Aizawa is fully intending to leave when he hears his name being called. Oh god, he recognises that voice. Turning around, Aizawa thinks the situation can’t get any worse until he sees that the owner of the voice is not alone. It’s worse. Because there, standing barely three feet away, are Midoriya Izuku and Toshinori. Of course they are.</span>\n</p>\n<p>\n<span>“Mr. Aizawa?” Izuku questions, stepping closer to get a look at the boy in his arms. “Oh, hello. Are you alright?”</span>\n</p>\n<p>\n<span>Touya eyes up Midoriya for a moment before shaking his head. Midoriya grimaces before peering up at Aizawa curiously. Aizawa knows what that look’s asking but he ignores it, preferring to turn the tables. “What are you doing here Midoriya?”</span>\n</p>\n<p>\n<span>“Ah, I’m seeing a physical therapist!” he pipes up brightly, holding out his mangled hand. “There’s still some stiffness so I’m working to get full movement back!”</span>\n</p>\n<p>\n<span>Aizawa gives a satisfied nod before lifting his gaze. “And you?”</span>\n</p>\n<p>\n<span>Toshinori spreads his hands helplessly. “I’m afraid I’m a rather frequent visitor around these parts. But luckily I had young Midoriya join me today!”</span>\n</p>\n<p>\n<span>Midoriya beams like Toshinori’s just hung the stars for him, Aizawa mentally rolling his eyes. But then he gets caught because he’s out of questions to hide behind, Midoriya hesitantly smiling at Touya again. “And this is...?”</span>\n</p>\n<p>\n<span>Aizawa could not answer but with Midoriya, that would probably only make it worse. Instead he levels the student with a glare. “Midoriya, what I’m about to tell you <em>cannot</em> leave this hospital, do you understand?”</span>\n</p>\n<p>\n<span>Midoriya’s expression turns frightfully serious, something Aizawa has rarely seen him do. “I understand.”</span>\n</p>\n<p>\n<span>Aizawa eyes him up before nodding, coaxing Touya’s head up. “This is Todoroki Touya. Yesterday he was hit by a quirk that de-aged him some nineteen years.”</span>\n</p>\n<p>\n<span>Midoriya’s eyes widen. “Todoroki’s...older brother?”</span>\n</p>\n<p>\n<span>Touya blinks, frowning. “Todo-...you know Natsuo?”</span>\n</p>\n<p>\n<span>“Natsuo?” Midoriya repeats, shaking his head. “No, I-...” Midoriya hastily cuts off, a hand clapping over his mouth. The damage is already done though.</span>\n</p>\n<p>\n<span>Aizawa draws Touya up to eye level. “Midoriya here goes to class with your little brother, Shouto. You haven’t met him yet.”</span>\n</p>\n<p>\n<span>“Sh...Shouto…” Touya murmurs, rolling the name over his tongue. “He...is he littler than Natsuo?”</span>\n</p>\n<p>\n<span>“Yes.”</span>\n</p>\n<p>\n<span>“I have a photo!” Midoriya offers, fossicking through his pocket until he finds his phone. He then goes frightfully still, breath catching. “You’re...Aizawa, how old is Touya?”</span>\n</p>\n<p>\n<span>“I’m five!” Touya cuts in before Aizawa can, folding his arms and pouting, clearly offended Midoriya thought he didn’t know.</span>\n</p>\n<p>\n<span>If anything, Midoriya goes <em>paler</em>. Over his head, Aizawa and Toshinori exchange looks. “<em>Midoriya</em>.” Aizawa’s voice is painfully stern and makes the boy cower. “What?”</span>\n</p>\n<p>\n<span>Midoriya shakes his head quickly. “Todoroki wouldn’t want me to say.”</span>\n</p>\n<p>\n<span>Aizawa raises an eyebrow coolly. “I got an earful from Touya yesterday. If I find you’re keeping something potentially dangerous a secret, you’ll be in trouble with someone far more frightening than Todoroki.”</span>\n</p>\n<p>\n<span>Midoriya squeaks and Toshinori tries to defend him but Aizawa won’t have it. Eventually Midoriya folds, hands wringing together nervously. “Uh...that is...Todoroki said when he was five, his, uh...his mother…” Midoriya gestures loosely at where Aizawa knows Todoroki’s scar is. “Because he...he looked like…”</span>\n</p>\n<p>\n<span>Aizawa holds up a hand there, not wanting Touya to hear too many gruesome details. Besides, it’s not like he and Toshinori don’t know what Midoriya was going to say anyway:</span>\n</p>\n<p>\n<em>\n<span>Todoroki Rei burnt Shouto for looking like Endeavour.</span>\n</em>\n</p>\n<p>\n<span>Looking at the boy in his arms, Aizawa swears. Touya, if anything, looks <em>more</em> like Enji. It’s no wonder she panicked upon seeing him.</span>\n</p>\n<p>\n<span>“Young Midoriya, why didn’t you tell anyone?” Toshinori asks gently.</span>\n</p>\n<p>\n<span>Midoriya shrugs. “I...Why didn’t Todoroki?”</span>\n</p>\n<p>\n<span>Aizawa lets it slide, waving Toshinori away. It still hasn’t solved the problem of what he’s going to do with Touya now. He may have swapped to snivelling but Aizawa’s sure he’s just minutes away from another bout of tears. Midoriya seems to realise this, awkwardly holding out a hand. “There are some beautiful gardens here Touya, with animals made of trees. Would you like to see?”</span>\n</p>\n<p>\n<span>Touya hesitates, leaning forward only to snap back and hide against Aizawa’s chest somewhat. “Are you...a hero?”</span>\n</p>\n<p>\n<span>Midoriya blinks twice before nodding, reaching into his wallet and pulling out his provisional hero license and handing it over. “I’m going to be a hero just like All Might!”</span>\n</p>\n<p>\n<span>Toshinori abruptly hacks into his hand but Touya doesn’t notice, just smiles the tiniest bit. “Yeah, he seems nice,” he whispers, handing the license back and pushing at Aizawa to indicate he wants down.</span>\n</p>\n<p>\n<span>Aizawa does so and Midoriya takes Touya’s hand, leading him out the southern door of reception. Aizawa follows, Toshinori on his heels. The gardens prove to be a good distraction and Midoriya is a surprisingly good babysitter. For all his jittering and incessant ramblings, he’s actually calm and soft around Touya. It’s like he’s found Touya’s volume level and is keeping them on the same page. According to Toshinori, he’s exactly like Midoriya Inko. Aizawa doesn’t question how he knows that and let’s the old hero go and join his protege. </span>\n</p>\n<p>\n<span>“Excuse me?”</span>\n</p>\n<p>\n<span>Aizawa turns at the voice, having to beat down the surprise he feels. “I’m sorry for the trouble we caused earlier.”</span>\n</p>\n<p>\n<span>Todoroki Rei shakes her head. “That...I’m afraid that was on me.” She steps to Aizawa’s side, glancing down at where Midoriya and Touya are. “I...When you left, you called him Touya. Was I mistaken?”</span>\n</p>\n<p>\n<span>Aizawa shakes his head. “He was hit with a quirk yesterday. He has no memories from any time after age five.”</span>\n</p>\n<p>\n<span>Rei’s eyes widen. “He...he said he was five?” Aizawa nods. “Oh. Then he...Natsuo would have just been born. He doesn’t know Shouto yet, or...or why I’m here.”</span>\n</p>\n<p>\n<span>“No,” Aizawa agrees. “And I apologise for bringing him to see you without warning. Had I known his presence would have been upsetting, we wouldn’t have come.”</span>\n</p>\n<p>\n<span>Rei shakes her head. “I...panicked. He reminded me so much of Shouto, of their father, and it took me back. All I could hear was Shouto crying. But…” Her hands clench into fists. “This is <em>Touya</em>. Am I...am I allowed to see him?”</span>\n</p>\n<p>\n<span>Aizawa grimaces. “Is that best for him?”</span>\n</p>\n<p>\n<span>Rei hesitates before nodding. “Yes. He needs me to tell him I’m sorry.” With that, she cups her hands around her mouth. “Touya!”</span>\n</p>\n<p>\n<span>Touya’s head snaps up from where he’s crawling through Midoriya’s legs. His face then splits into a grin and he sprints over the lawn. Rei crouches down and Touya crashes into her chest, hands fisted in her dress. She’s already crying, scooping him up and hugging him fiercely. “My Touya, my little light.”</span>\n</p>\n<p>\n<span>Touya hugs back just as tightly, kissing her cheek. “Are you okay now Mother?”</span>\n</p>\n<p>\n<span>Rei deliberates on that before shaking her head, taking Touya’s face in her hands. “Right now, I’m not very well. Sometimes...things that shouldn’t scare me do.”</span>\n</p>\n<p>\n<span>Touya frowns. “Like me shouting?”</span>\n</p>\n<p>\n<span>Rei taps his nose. “Well, we don’t run and shout indoors do we?”</span>\n</p>\n<p>\n<span>Touya flushes, burying his face in Rei’s neck. She laughs softly, fingers combing through his hair. “But that’s why I’m living here Touya, so the doctor’s can help me get better.”</span>\n</p>\n<p>\n<span>Touya doesn’t answer that and Rei takes it, just continuing to play with his hair. She looks up and smiles, offering a small wave. “Hello Midoriya.”</span>\n</p>\n<p>\n<span>Midoriya smiles right back. “Hi Mrs. Rei. Sorry for not coming to see you, I was on my way out when I ran into Mr. Aizawa.”</span>\n</p>\n<p>\n<span>She waves him off. “And how is Shouto?”</span>\n</p>\n<p>\n<span>“He’s coming up this evening,” Midoriya replies, “So I’d better not answer! He’ll get cross.”</span>\n</p>\n<p>\n<span>Rei looks scandalised in a teasing way. “With you Midoriya? Never.”</span>\n</p>\n<p>\n<span>Midoriya goes bright red and Toshinori decides to have pity on him. He announces they’re leaving and they do just that, leaving Aizawa alone with Rei. There’s a space between them but he never goes far enough away that he can’t get to Touya within a second if things go south. Although, they don’t look like they will. With just a few strokes to the cheek, Touya is asleep in Rei’s arms, so much the opposite of what a villain should be.</span>\n</p>\n<p>\n<span>“He doesn’t visit, you know,” Rei murmurs.</span>\n</p>\n<p>\n<span>Aizawa isn’t surprised. Dabi would never make it through the front door. “When was the last time you saw him?” he asks instead.</span>\n</p>\n<p>\n<span>Rei bows her head in shame. “Ten years ago. He was...The last time I saw Touya, he was worrying over his high school applications. I never knew what he chose.”</span>\n</p>\n<p>\n<span>Aizawa feels a tad bit of anger there. Had no one thought to write? Had Rei never thought to ask? Or had they not been allowed? </span>\n</p>\n<p>\n<span>“Do you know?”</span>\n</p>\n<p>\n<span>“I don’t,” he says honestly. “I don’t know anything about your son.” At her despondent face, he scrounges around for something, anything. “He dyes his hair,” Aizawa manages to offer. “It’s black now.”</span>\n</p>\n<p>\n<span>Rei’s smile is watery. “He was always talking of doing that. I never thought he would.” She tucks Touya closer, thumbing his cheek tenderly. “I...Enji was always so hard on Shouto - because of his quirk, because of his potential. I spent a lot of time with Shouto because of it. I...Touya had to basically raise his siblings but…” Her bottom lip trembles. “I would never say this aloud to anyone else but...Touya was my favourite. He was the softest, the gentlest. He was so <em>kind</em>.”</span>\n</p>\n<p>\n<span>Aizawa is making sure to look anywhere but at Rei. Because as sweet as it is, her precious, ‘kind’ boy ends up becoming someone who has over twenty deaths in their ledger. He’s tried to kill his father, he’s tried to kill Aizawa, he kidnapped Bakugou. Aizawa knows he taunted Shouto - to his <em>face</em> nonetheless - and he’s a part of one of the most ruthless crime organisations in Japan. Somewhere along the line, Touya changes into Dabi and Aizawa doesn’t have the heart to tell this frail woman that.</span>\n</p>\n<p>\n<span>Looking at the time, Aizawa sighs. “I’m afraid I have to go.”</span>\n</p>\n<p>\n<span>Rei wilts but nods. She goes to wake Touya but then seems to think better of it. “If I say goodbye, he’ll only be more upset.”</span>\n</p>\n<p>\n<span>Aizawa knows it’s true. He’s extending his arms to take the child when,</span>\n</p>\n<p>\n<span>“Mother?”</span>\n</p>\n<p>\n<span>...fuck.</span>\n</p>\n<p> </p>\n<p>\n<span>***</span>\n</p>\n<p><br>\n<br>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>***</span>\n</p>\n<p> </p>\n<p>\n<span>“Mother?”</span>\n</p>\n<p>\n<span>Aizawa is positive he recognises the voice before Todoroki Rei does; that in itself says enough. Approaching them with a bewildered look on his face is Todoroki Shouto. He must have finished his errands earlier than Midoriya had said. Unfortunate; Aizawa was hoping to get away before he arrived. But he hasn’t which means he now has to deal with...this. To be honest, he isn’t sure what to make of this. Neither of the Todorokis seem to either.</span>\n</p>\n<p>\n<span>Aizawa then squints at Shouto, rolling his eyes at the odd look on his face and really? He thought this boy was <em>smart</em>.</span>\n</p>\n<p>\n<span>“Todoroki, you’re not an older brother; drop the look.”</span>\n</p>\n<p>\n<span>Rei jerks up but Shouto very quickly looks to the side, awkwardly clearing his throat. Aizawa rolls his eyes, taking that moment to scoop Touya up. He glances at Rei but she merely gestures him towards Shouto, Aizawa sighing.</span>\n</p>\n<p>\n<span>“Todoroki, this is Touya. As you can see, he was influenced by a quirk.”</span>\n</p>\n<p>\n<span>Todoroki freezes for a moment before turning slowly, eyes a tad wider than normal. He cautiously approaches. “I don’t...I don’t remember him.”</span>\n</p>\n<p>\n<span>Rei bites back a sob there, Aizawa scowling. One day, very soon, he’s going to find out exactly what Todoroki Enji did to this family. “That makes you equal then,” is what he says. “Because Touya doesn’t remember you either.”</span>\n</p>\n<p>\n<span>Todoroki blinks before nodding. “Ah, the quirk erased his memory?”</span>\n</p>\n<p>\n<span>“That’s right.” He turns to Rei and bows shortly. “Thank you for having us; I’ll be heading off now.”</span>\n</p>\n<p>\n<span>She shakes her head. “I should be the one thanking you.”</span>\n</p>\n<p>\n<span>Aizawa makes it barely a metre before a voice calls after him. “Wait!” Todoroki is standing between the two, swaying uncertainly until Rei gives him an encouraging nudge. “I’d like to come with you.”</span>\n</p>\n<p>\n<span>Aizawa mulls that over, eventually nodding. “Alright, but on the terms you also contact your brother and sister.”</span>\n</p>\n<p>\n<span>He doesn’t say that there are things he needs to tell them - not in front of Rei - but Todoroki nods anyway. They head to Aizawa’s car, Aizawa ushering Todoroki into the back seat before lying Touya next to him. He stirs but doesn’t wake, both of them sighing in relief. As Aizawa slides into the front seat he adds, </span>\n</p>\n<p>\n<span>“Don’t be surprised if he cries. As far as he knows, he still lives at home. This is all confusing for him.”</span>\n</p>\n<p>\n<span>Todoroki is silent for a long time. “...it would be.”</span>\n</p>\n<p>\n<span>Aizawa doesn’t know what to say to that and so doesn’t say anything. The only time Todoroki speaks is to ask for his address, which Aizawa passes on. Todoroki fiddles with his phone and Aizawa can only assume he’s messaging his siblings. He then pockets the device and lets his gaze drop to Touya. He seems afraid to touch; he would only be <em>more</em> so if he knew who Touya grew up to be. Aizawa’s still wrapping his head around it himself; that this small, quiet, and supposedly kind boy turns into something much worse.</span>\n</p>\n<p>\n<span>It’s as they’re making the second to last turn that Touya stirs. He blearily calls for his mother but when he gets no response, Touya shoots straight up. He sees Aizawa before he sees Todoroki and the tears are already coming before Todoroki, blessedly, cuts in.</span>\n</p>\n<p>\n<span>“...hello.”</span>\n</p>\n<p>\n<span>Maybe not so blessedly then.</span>\n</p>\n<p>\n<span>Touya whips around, scrambling away all while stammering for a hero license. For someone who becomes a villain, he seems particularly obsessed with making sure everyone who interacts with him is a hero. Todoroki passes his over, Touya scrunching his face up at it before brightening.</span>\n</p>\n<p>\n<span>“Hey, this is my name!” he chirps, pointing at their family kanji. Todoroki nods, Touya peering up at him before clapping his hands. “Midomiya called you Sho-...Shou-...Shouto!”</span>\n</p>\n<p>\n<span>“Midoriya,” Todoroki corrects absently. He then holds out a hand, Touya shaking it. “Todoroki Shouto.”</span>\n</p>\n<p>\n<span>“Todoroki Touya,” Touya whispers, suddenly all shy again. Aizawa parks the car and Touya scrambles over Todoroki’s lap to get to the door. When Todoroki tries to pull him up, Touya pokes his tongue out. “I’m the biggest brother! I go first.”</span>\n</p>\n<p>\n<span>Todoroki raises an eyebrow. “I’m sixteen right now. Which makes me bigger than you.”</span>\n</p>\n<p>\n<span>“Well I’m really sixteen and a half!” Touya crows. “And a grandfather!”</span>\n</p>\n<p>\n<span>He is no such thing but it makes Todoroki hesitate long enough for Touya to open the door and slide to the ground. Aizawa is already waiting, ready to stop him from running into the carpark. Todoroki follows them up to Aizawa’s apartment, the three of them toeing off their shoes before padding down the hall. Yamada already has lunch on the table. He sees Todoroki and adds an extra plate. Todoroki glances between them suspiciously and Aizawa starts to wonder if this kid is a member of the tin-foil hat brigade.</span>\n</p>\n<p>\n<span>“So,” Yamada says as they’re all seated. “How was it?”</span>\n</p>\n<p>\n<span>Touya clams up and Yamada gives Aizawa a look that clearly says ‘that bad huh?’. “It was fine,” Aizawa answers, waving a hand.</span>\n</p>\n<p>\n<span>“Mother’s sick,” Touya finally mumbles, slumping lower in his chair as he picks at his rice. “So she has to stay at the hospital.”</span>\n</p>\n<p>\n<span>Todoroki’s jaw tightens there and right, there’s obviously more to that then.</span>\n</p>\n<p>\n<span>Touya abandons his food and turns to Todoroki instead. “You’re sick too, right?”</span>\n</p>\n<p>\n<span>Todoroki frowns. “No?”</span>\n</p>\n<p>\n<span>“You <em>are</em>,” Touya insists, climbing up on his chair and turning Todoroki’s face in his hands, jabbing a finger at his scar. Everyone freezes. “You have a sore here. If you pick at it, it won’t get better.”</span>\n</p>\n<p>\n<span>Luckily, Todoroki simply nods. “I see. I’ll do that. Now sit down,” he adds in a murmur.</span>\n</p>\n<p>\n<span>Touya does so but not without grumbling. “I’m still the bigges-”</span>\n</p>\n<p>\n<span>His sentence is abruptly cut off as his arm flings out and knocks his cup over. Aizawa doesn’t think it’s a big deal until Touya suddenly pushes his chair back as quickly as he can. For a moment Aizawa thinks he doesn’t want to get wet but the truth is much worse, as evidenced by Touya backing into the nearest wall and crossing his arms in front of his face, clearly terrified that he’s going to be struck. Aizawa’s hands curl into fists. A <em>five-year-old</em> thinks he’s going to be <em>punished</em> for knocking over a <em>glass of water</em>.</span>\n</p>\n<p>\n<span>“I’m sorry, I’m sorry!” Touya shrieks as Yamada rounds the table.</span>\n</p>\n<p>\n<span>“Hey, hey,” the hero calls, kneeling down and slowly, gently places a hand on Touya’s shoulder. “It’s okay little listener. It was just an accident. We can clean it up, alright?”</span>\n</p>\n<p>\n<span>Touya peeps through his fingers hesitantly. “I...I’m sorry.”</span>\n</p>\n<p>\n<span>“You said that,” Yamada teases. “And I said it’s fine. So come help me?”</span>\n</p>\n<p>\n<span>Still Touya hesitates.</span>\n</p>\n<p>\n<span>Yamada sighs, lowering Touya’s arms and guiding his chin up, tone serious. “Hey Touya, listen. You spill that water, we’ll get you another. You spill that one, we’ll get you another. You spill that one...well, I’ll ask you to be more careful but we’ll still get you another, alright?”</span>\n</p>\n<p>\n<span>Touya doesn’t nod or show any signs of agreement but he meekly heads back to the table, stopping beside the water that’s dripped onto the floor. Yamada understands, pulling off two pieces of paper towel and handing one over. Together the mess takes them less than a minute to clean up and Aizawa catches the look Yamada gives him over Touya’s head. Aizawa nods, surreptitiously glancing at Todoroki. He’s remaining very quiet and finding his lunch a little too interesting. God, this family really is a mess. </span>\n</p>\n<p>\n<span>Yamada looks at him again but Aizawa gives the slightest shake of his head. Yes, they need to address this but he’ll do it later. Do it when there’s not a five-year-old present. There are some things Touya doesn’t need to know. He doesn’t need to hear how bad things get.</span>\n</p>\n<p>\n<span>After lunch is quieter. Aizawa steers Touya towards the toybox in the living room and sends Todoroki after him. Touya scrounges through it before pulling out some blocks. The two brothers play together quietly while Aizawa washes the dishes and Yamada dries them. It’s as they’re finishing up that Todoroki approaches.</span>\n</p>\n<p>\n<span>“Fuyumi and Natsuo are five minutes away,” he relays, phone in hand. </span>\n</p>\n<p>\n<span>Aizawa gives a grunt of acknowledgement before heading to where Touya is. Touya is immersed in building what he says is a castle but Aizawa coaxes him away, biting back a smile as Touya squirms on the couch, clearly eager to get back to his game. It’s obvious he knows he has to behave though. </span>\n</p>\n<p>\n<span>“Touya,” he says, slowly and clearly, enough so to have the boy stiffen. “Some people are going to come here and visit you. You know them but...They’re going to look different to how you remember.”</span>\n</p>\n<p>\n<span>Touya hunkers down, nodding silently.</span>\n</p>\n<p>\n<span>Aizawa frowns. “Touya?”</span>\n</p>\n<p>\n<span>Touya’s hands fist in his pants. “Is...is Father mad at me?”</span>\n</p>\n<p>\n<span>Aizawa has to refrain from hitting something. Instead, he ducks down so he’s meeting Touya’s gaze. “He’s not coming. But your brother and sister are.”</span>\n</p>\n<p>\n<span>Touya’s mouth drops open. “Fuyumi and Natsuo are coming here?” At Aizawa’s nod, he looks to Shouto, frowning. “Are they big? Bigger than me? Are they even bigger than Shouto? Do they know that I’m still the biggest? I’m five, remember!”</span>\n</p>\n<p>\n<span>Yamada laughs loudly and even Shouto chuckles. “I’ll be sure to tell them,” Aizawa assures.</span>\n</p>\n<p>\n<span>At that moment, the doorbell rings. Aizawa makes a warning sound when Touya goes to stand and so he remains seated on the couch. He’s bouncing up and down excitedly though. Todoroki goes for the door and Aizawa can hear his siblings asking questions but Todoroki is poor with his answers - as always - and has explained literally nothing by the time they reach the living room. The two Todorokis spot Touya almost immediately, Fuyumi frowning in confusion while Natsuo all but knocks Aizawa aside in his attempt to reach his brother.</span>\n</p>\n<p>\n<span>“T-Touya?”</span>\n</p>\n<p>\n<span>Fuyumi makes an incredulous noise but Touya nods even as his head cocks to the side. He cautiously reaches out, hand resting on Natsuo’s cheek. “Natsuo?”</span>\n</p>\n<p>\n<span>That’s all it takes, Natsuo crushing his brother in his arms. Aizawa wonders how long it’s been since they’ve seen each other. Somewhere behind him his phone starts to ring but Yamada lets him know he’s got it, which is good because Aizawa is a little busy right now. Fuyumi slowly comes over too, sinking to her knees and running trembling fingers through Touya’s hair. “Is it...is it really you?”</span>\n</p>\n<p>\n<span>“It is,” Aizawa says for him. “As you can guess, this is the effect of a quirk. He doesn’t remember anything.”</span>\n</p>\n<p>\n<span>Natsuo stares at him incredulously before pushing Touya away and holding him by the shoulders. “You don’t...Touya, how old am I?”</span>\n</p>\n<p>\n<span>Touya gestures with his hands; apparently Natsuo is the size of a loaf of bread. Natsuo breathes out shakily. It’s clear he doesn’t know what to say. Touya fills the silence for him, fisting his hands on his hips. “I know you’re big,” he says as sternly as a small child can, “But I am the biggest, okay? You have to do what I say because I’m older.”</span>\n</p>\n<p>\n<span>Natsuo laughs loudly, hands falling away to clutch at his sides. Fuyumi giggles too, drawing Touya close and hugging him tightly. “Of course,” she whispers. “You’ll always be our big brother Touya.” </span>\n</p>\n<p>\n<span>“Mother knows,” Todoroki says, taking a seat next to Touya. </span>\n</p>\n<p>\n<span>This makes his siblings look up. Natsuo glances at Aizawa in confusion, to which he nods. “He wanted to see her. He’s five; there’s a lot he doesn’t know.”</span>\n</p>\n<p>\n<span>Natsuo understands immediately, taking Touya back from Fuyumi and starting to tussle with him. Touya giggles and squeals, seemingly somehow at ease with this “stranger” who claims to be his brother. Maybe he can sense the connection; Aizawa doesn’t know - he’s an only child himself. Family bonds are strange that way. Fuyumi is watching them while chewing on her bottom lip. Eventually she says,</span>\n</p>\n<p>\n<span>“And Father? How soon will he be coming to collect him?”</span>\n</p>\n<p>\n<span>“<em>Fuyumi!</em>” Natsuo hisses but she glares back at him.</span>\n</p>\n<p>\n<span>“<em>What?</em> It’s his son!”</span>\n</p>\n<p>\n<span>“Touya won’t be going home.” Aizawa’s voice is like a knife and makes all the Todorokis freeze, even Touya. His consequent glare is enough to make Fuyumi’s mouth snap shut. “Touya gave us some...eye-opening insights yesterday. In the interest of safety, we’re keeping him away from Endeavour.”</span>\n</p>\n<p>\n<span>There’s also the fact that Touya is, in fact, Dabi and may attack on sight the moment this quirk wears off but it’s not the <em>main</em> reason. </span>\n</p>\n<p>\n<span>“...what did he say?” Todoroki asks after several long minutes of silence.</span>\n</p>\n<p>\n<span>“Enough,” is all Aizawa replies, reaching out and ruffling Touya’s hair; the boy is watching everything with wide eyes. “Don’t worry; you’re not in trouble.” </span>\n</p>\n<p>\n<span>Touya hesitates before nodding. Aizawa then excuses himself and tells them to enjoy the time they have together. The Todorokis do so but there’s an air of...something hanging over them now. And maybe, maybe there always was.</span>\n</p>\n<p> </p>\n<p>\n<span>***</span>\n</p>\n<p> </p>\n<p>\n<span>The four Todoroki children spend the afternoon in Aizawa and Yamada’s living room. They rotate between playing games, watching tv, and digging through the - admittedly small - toybox. In Aizawa’s defence, Shinsou is sixteen now and so doesn’t play with toys and Eri only comes over when her minders at UA have rostered days off. But they make do.</span>\n</p>\n<p>\n<span>Aizawa leaves them alone, retreating to the bedroom he shares with his husband. Yamada passes on the call he’d taken earlier - information from Hawks - and then they settle into their usual Sunday routine of making lesson plans and grading papers. The occasional word is exchanged and Yamada bops along to the music in his head. The only reason the silence is broken is because there’s a knock at their door. Both teachers look up, Natsuo standing there.</span>\n</p>\n<p>\n<span>“Touya fell asleep. Fuyumi put him to bed.”</span>\n</p>\n<p>\n<span>He doesn’t say anything more but his tone says more than enough: we want answers.</span>\n</p>\n<p>\n<span>Unfortunately, Aizawa doesn’t have a lot to give them. Nevertheless, he needs to talk to them anyway so this is the perfect opportunity. Touya is asleep and Rei is not around. Endeavour is also, thankfully, nowhere near them. If Aizawa is going to have this conversation with anyone in the Todoroki clan, it’s going to be these three. And so he ushers them all onto the couch. It’s a tight squeeze but they manage to fit. Aizawa sits himself on the coffee table in front of them, Yamada bringing his marking to the dining table but making no move to be an active part of whatever this is going to turn into. </span>\n</p>\n<p>\n<span>Perhaps naturally it’s Fuyumi who speaks first. “I don’t know what Touya told you but I can assure you, Father is trying to change. He...I think it would do him good to see this.”</span>\n</p>\n<p>\n<span>Todoroki’s face is perfectly blank while Natsuo looks away with a disgruntled pout. It’s clear he disagrees.</span>\n</p>\n<p>\n<span>“Maybe I <em>would</em> agree with you,” Aizawa says slowly. “Except I don’t, because I have first hand evidence of what’s happened to Touya at your father’s hands. I cannot see behind closed doors and I am not going to willingly endanger a child. Is that clear?”</span>\n</p>\n<p>\n<span>Fuyumi squirms uncomfortably but Todoroki finally nods. “I agree.”</span>\n</p>\n<p>\n<span>Natsuo’s shoulders slump with relief even as Fuyumi looks at her little brother in betrayal. Aizawa holds up a hand to stem all further arguments. “But, there’s a more pressing reason. And I want all of you to listen very carefully to what I’m about to say.”</span>\n</p>\n<p>\n<span>In that instant, it’s possible to hear a pin drop. </span>\n</p>\n<p>\n<span>“The reason Touya was brought to me, brought to the custody of the police, was because he was being pursued by the hero Hawks prior to this quirk mishap.” He lets that sink in for a moment; after all, the implications are clear. “Most of us know Touya under a different name, namely the villain Dabi.”</span>\n</p>\n<p>\n<span>Todoroki jerks in his seat. His head whips around to the room where his brother sleeps, jaw clenching. Fuyumi is muttering her disbelief under her breath while Natsuo’s hands shake on his knees.</span>\n</p>\n<p>\n<span>“Of <em>course</em> he is,” Natsuo spits, shocking Aizawa somewhat. “It’s...it would make sense. Why...why Dabi appeared after the Noumu had...It was <em>personal</em>.”</span>\n</p>\n<p>\n<span>Aizawa nods. “That’s what we think as well.”</span>\n</p>\n<p>\n<span>“It’s not true!” Fuyumi cries. “Touya is...he’s…”</span>\n</p>\n<p>\n<span>“Fuyumi, where is Touya right now?” Todoroki’s voice is calm, Fuyumi shattering. </span>\n</p>\n<p>\n<span>“I don’t...I don’t know! He ran away,” she insists, almost pleading to Aizawa. “He had an argument with Father and ran away but that’s all! He never...he isn’t...he isn’t <em>that</em> man!”</span>\n</p>\n<p>\n<span>“Our eyewitnesses say he is,” Yamada cuts in, firmly but also gently. “We know this is hard for you all to understand but this is why we can’t send Touya home. We don’t know what Endeavour’s reaction to him would be and we don’t know how Touya would react to him should he change back. This quirk isn’t permanent.”</span>\n</p>\n<p>\n<span>More silence.</span>\n</p>\n<p>\n<span>“He hated Father.” It’s Natsuo, again, and Aizawa’s starting to think he has the most sense out of all of them. “Touya was...he was the one with the strongest quirk. Our father trained him every day for years, pushed him and pushed him.” Natsuo’s voice breaks but he continues. “But no matter what, Touya was never good enough. But he did everything he could. And then…” He sends an apologetic look sideways. “Then Shouto was born and his quirk was perfect. It was everything our father wanted. And just like that, Touya was thrown away. I think…” He trails off but Aizawa nods.</span>\n</p>\n<p>\n<span>“He hated what he went through but being pushed aside hurt more.”</span>\n</p>\n<p>\n<span>Natsuo’s head bows sadly. “I think that’s when he started to change. I...Father <em>broke</em> him. And...and we never tried to put the pieces back.”</span>\n</p>\n<p>\n<span>“You were a <em>child</em>,” Aizawa tells him severely. “Fixing him was <em>never</em> your job. I’m sure you were busy with your own problems. What happened to Touya is between him and his father.”</span>\n</p>\n<p>\n<span>“He missed Mother, after she went away,” Fuyumi hesitantly adds, hands twisting together in her lap fretfully. “He would always check on her and take care of her. And she...I remember, sometimes, our mother would come visit him at night just to watch him sleep. I think she knew he was hurting but he never said. He never talked to us.”</span>\n</p>\n<p>\n<span>Through all of this, Todoroki looks more and more uncomfortable. At Aizawa’s piercing gaze, he looks away. “I…” Todoroki shrugs. “I was separated from my siblings. I don’t know Touya.”</span>\n</p>\n<p>\n<span>There’s a loud <em>bang</em> from the kitchen as Yamada throws his chair back and storms away, bedroom door slamming behind him. Aizawa understands. He sets them all with a very serious stare. “I hope you all know this going to come out in the wash. This behaviour is unacceptable of a hero.”</span>\n</p>\n<p>\n<span>For once, he only gets meek nods. Good. Maybe the horror of what their family life truly is is starting to sink in. </span>\n</p>\n<p>\n<span>He gets up, gesturing to the door. “Now, I think it’s time you leave. According to information Hawks was able to find today, Touya will remain young one day for each year he now is. This is day two; we have three more.”</span>\n</p>\n<p>\n<span>“Will he keep his memories of...this?” Fuyumi asks as she collects her bag.</span>\n</p>\n<p>\n<span>Aizawa shakes his head. “No, he won’t. But apparently his emotions do.”</span>\n</p>\n<p>\n<span>Natsuo frowns. “Does that...So if we plant the right emotion in him now, when he’s young, it might say him when he returns to...Dabi?”</span>\n</p>\n<p>\n<span>“Perhaps,” is all Aizawa says. He doesn’t make promises he can’t keep.</span>\n</p>\n<p>\n<span>Todoroki and Fuyumi leave, Natsuo waving them on before turning to Aizawa. “I know you’re Shouto’s teacher so you have school tomorrow. I don’t have any classes on Monday. I...I’m going to have Touya for the day.” He gains confidence somewhere along the line and it comes out as a fact more than a request. “He’s my brother and despite what you said, I know I failed him. For one day, I want him to be <em>normal</em>. There’s a winter festival on too; he deserves this.”</span>\n</p>\n<p>\n<span>Aizawa mulls it over before eventually nodding. “But only because we know he’ll remain his current age.”</span>\n</p>\n<p>\n<span>“Understood,” Natsuo says. “I’ll see you tomorrow morning.”</span>\n</p>\n<p>\n<span>He takes his leave then and Aizawa doesn’t bother to wave, just slams the door shut. He needs to start getting paid for this.</span>\n</p>\n<p> </p>\n<p>\n<span>***</span>\n</p>\n<p><br>\n<br>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>***</span>\n</p>\n<p> </p>\n<p>\n<span>It’s barely past six the next morning when Natsuo arrives. Aizawa blearily lets him in, Natsuo wincing in sympathy at the coffee mug in his hand. Yamada is still asleep, as is Touya, and Natsuo seems to understand that. He keeps his voice down as he follows Aizawa to the kitchen before dumping a rather large bag on the dining table. He looks a little sheepish but still indicates for Aizawa to take it.</span>\n</p>\n<p>\n<span>“I stopped by the shops on the way home last night,” Natsuo explains as Aizawa finds himself looking at a variety of clothes and a couple of toys. “I know it’s only three more days but I don’t want you to have to spend any money on my brother.”</span>\n</p>\n<p>\n<span>Aizawa murmurs out a thanks. So far they’ve made do with an old shirt for sleeping and lost property items from the police station for during the day but yes, Touya could probably use something actually his size and something that doesn’t have to be washed every night. The toys are useful too, small and unobtrusive and no loud sounds. Natsuo must have noticed their lack of age appropriate things yesterday.</span>\n</p>\n<p>\n<span>“I take it you can handle it from here?” Aizawa asks as he hears Yamada get up in the other room.</span>\n</p>\n<p>\n<span>Natsuo nods resolutely and Aizawa leaves him to it. He passes over the spare apartment key, as well as his phone number. If anything goes wrong, he’s to be called immediately. Natsuo assures him that’s not going to happen. </span>\n</p>\n<p>\n<span>A good half an hour later, Aizawa and Yamada are gone and Natsuo is left alone in their apartment. He finds it a little unnerving but eventually decides to pop on the tv and check his university emails. He does that until tiny feet patter into the room. Turning around, he comes face to face with Touya. Touya stares at him for the longest moment before smiling. He trots over and giggles when he’s lifted up, burrowing into Natsuo’s chest.</span>\n</p>\n<p>\n<span>“Hey Touya,” Natsuo murmurs, squeezing him tightly.</span>\n</p>\n<p>\n<span>Touya mumbles back a greeting of his own and then pushes himself away. It’s still shocking to Natsuo just how <em>small</em> he is. Yes, he knew he’d always been taller than Touya but seeing it from an adult perspective...he almost wonders if Touya is ill. He knows certain nutritional deficiencies and even stress can stunt a child’s growth. Although Natsuo hates to admit it, he wouldn’t be surprised if the latter is actually true. Touya’s just so <em>tiny</em>, especially compared to the rest of them.</span>\n</p>\n<p>\n<span>But that isn’t here or there and there’s nothing Natsuo can do about it now. No, instead he sets Touya down and brings over the bag. Touya looks stunned that all these things are for him and it pulls at Natsuo’s heart. He watches as Touya goes from toy to toy, face lighting up at each one. What makes Natsuo laugh is Touya’s utter fascination with a stuffed alpaca he’d bought on a whim. The thing gets tucked under his arm and never leaves.</span>\n</p>\n<p>\n<span>Touya eventually senses his gaze, shying away. “...thank you.”</span>\n</p>\n<p>\n<span>“Touya…” Natsuo’s heart breaks again. “You don’t have to thank me. Now come on, let’s go explore!”</span>\n</p>\n<p>\n<span>Touya’s head whips up and something in Natsuo’s smile must be infectious because he mirrors it. Natsuo helps him into some clothes, so, so relieved when the shoes fit because he’d <em>really</em> had to guess there and as much as he loves his brother, he doesn’t think his arms could take carrying him all day. Touya’s pride probably couldn’t take it either. </span>\n</p>\n<p>\n<span>“Where are we going?” Touya asks as they walk to the station, alpaca still under his arm - Natsuo hadn’t been able to convince him to leave it at the apartment.</span>\n</p>\n<p>\n<span>Natsuo holds up a folder guiltily. “I have to drop this assignment off at university but after that, there’s a winter festival on a few suburbs over. I thought we could go there.”</span>\n</p>\n<p>\n<span>Touya nods excitedly, Natsuo fumbling at the station when he realises he has to buy Touya a train pass before leading him to the platform. It’s busy but not too crowded. It’s enough so though that Touya presses to his side and fists a hand in his jacket. Natsuo keeps a firm hand on his back as well, just in case. </span>\n</p>\n<p>\n<span>The trip to his campus is almost instinctual at this point and Natsuo makes his way to his professor’s office, Touya on his heels. He’d admittedly forgotten to hand this assignment in but hopefully he’ll make a good enough impression that he won’t be marked down. If nothing else, he can surely play up the High End incident for some sympathy votes in his corner. He raps on the door and is called in. He hesitates before bringing Touya in too. It may not be allowed but Natsuo isn’t going to leave him alone. Professor Tanaka raises an eyebrow. </span>\n</p>\n<p>\n<span>“Is this a university or a kindergarten Mr. Todoroki?”</span>\n</p>\n<p>\n<span>Touya bows deeply before Natsuo can speak. “I’m sorry sir. I was hit by a quirk and Natsuo...my big brother is taking care of me.”</span>\n</p>\n<p>\n<span>Professor Tanaka looks a tad taken aback. “I’m sure that’s not your fault. Please sit, I need to speak with your brother.”</span>\n</p>\n<p>\n<span>He indicates a chair in the corner of the room and Touya sits in it. Natsuo passes over his phone and opens it to a simple game app, turning the volume all the way down. With Touya taken care of, he hands over his assignment and discovers, to his surprise, that his “personal circumstances” - i.e. High End - have been taken up with the university board and if he’d like to take a semester off, they’ll allow it. Natsuo quickly shoots it down though, apologising for this assignments tardiness but assuring him it will be the first and <em>only</em> one. Professor Tanaka hums but takes his word for it, giving him the syllabus for the next unit and pointing out some key areas. </span>\n</p>\n<p>\n<span>Before Natsuo knows it, nearly an hour has passed. He looks apologetically at Touya upon realising but he is still diligently sitting, phone now discarded but swinging his legs contentedly enough, hands folded in his lap. Professor Tanaka cracks a smile. “Your brother is impeccably well behaved.”</span>\n</p>\n<p>\n<span>Natsuo tries not to cringe. “He is. Touya’s a wonderful brother.”</span>\n</p>\n<p>\n<span>The boy’s ears burn red but Professor Tanaka waves him over. The teacher takes the lid off a jar that looks like a plant and offers Touya what Natsuo sees are lollies. Touya eyes him up before taking a step back, head shaking. “Natsuo did the schoolwork,” he offers as explanation.</span>\n</p>\n<p>\n<span>“Hmm, but he handed it in late.”</span>\n</p>\n<p>\n<span>Touya still refuses. “I didn’t do anything,” he whispers. “I just sat down.”</span>\n</p>\n<p>\n<span>Professor Tanaka frowns and Natsuo very much avoids eye contact. It gets him a sigh. “Well, how about you both have one?”</span>\n</p>\n<p>\n<span>That, it seems, is enough to win Touya over. He finally takes one of the wrapped sweets, passing it to Natsuo before taking his own. Natsuo awkwardly waves goodbye and they head back to the station, this time bound for the festival. His lolly is popped in his mouth before he realises Touya’s is still clenched in his fist.</span>\n</p>\n<p>\n<span>“Do you want me to open it for you?” he asks.</span>\n</p>\n<p>\n<span>“I didn’t do anything,” Touya repeats and it suddenly hits Natsuo that this may be the first time Touya has ever been praised. His eyes tear up and his fists clench. Before he can think twice, his hands are grabbing Touya’s shoulders and he’s forcing their eyes to meet.</span>\n</p>\n<p>\n<span>“You got this because you did everything <em>right</em>. You could have left, could have asked to go outside, could have spoken the whole time, could have complained but you didn’t. You were <em>good</em> Touya.” Natsuo grabs his hand. “This is a <em>reward</em> Touya; a reward for doing something good. My teacher and I were both proud of you.”</span>\n</p>\n<p>\n<span>Touya blinks at him in incomprehension. Natsuo doubts their father’s ever told Touya he was proud of him. Touya frowns at the lolly. “I...I wasn’t a failure?”</span>\n</p>\n<p>\n<span>Natsuo’s jaw clenches. “You never were and you never will be, do you understand?”</span>\n</p>\n<p>\n<span>“But my quirk is-”</span>\n</p>\n<p>\n<span>“This isn’t about your quirk!” Natsuo shouts, Touya jumping. “This is about <em>you</em> Touya, about who you are. <em>You</em> are a good person. You are not a failure. Do you understand?”</span>\n</p>\n<p>\n<span>He says it so firmly this time, it’s almost a demand. Still, Touya finally nods. Natsuo nods back, hefting him up and setting him on his hip. Touya doesn’t protest, just snuggles into his neck. A few streets later though,</span>\n</p>\n<p>\n<span>“...thank you.”</span>\n</p>\n<p> </p>\n<p>\n<span>***</span>\n</p>\n<p> </p>\n<p>\n<span>The festival, Natsuo finds, is much better. Touya is enthralled by the colourful stalls and the aromas of various foods. His eyes are wide with wonder and Natsuo hesitates before snapping a few photos on his phone. It’s his brother. He’s allowed to do that, right? </span>\n</p>\n<p>\n<span>They share a plate of takoyaki and Natsuo shouts Touya a taiyaki. They try their hand at goldfish scooping and while Natsuo is utterly hopeless, Touya does surprisingly well. He’s quick to hand the goldfish back though, explaining they don’t have anywhere to keep them. They purchase a pair of kitsune masks and Natsuo helps Touya arrange his in his hair before scooping him up. The stalls are busier now and Touya’s steps are slowing. Natsuo isn’t surprised; they’ve been out for hours.</span>\n</p>\n<p>\n<span>“Natsuo?” Touya murmurs, hands fiddling with Natsuo’s collar. “Thank you for bringing me here.”</span>\n</p>\n<p>\n<span>Natsuo smiles, leaning down to press their foreheads together and then brushing their noses. Touya giggles, squealing when Natsuo kisses his cheek. “I love you Touya.”</span>\n</p>\n<p>\n<span>Touya squeaks and hides in his neck and Natsuo goes to tease him again when he hears the voice that makes them both freeze.</span>\n</p>\n<p>\n<span>“<em>Natsuo</em>.”</span>\n</p>\n<p>\n<span>Touya fiercely scrabbles in his arms but Natsuo pins him to his chest, forcefully keeping his head turned away. He’s going to keep Touya as far away from this conversation as possible. If he has his way, their father is never going to recognise Touya. Natsuo tucks the boy into his shoulder and rounds on Endeavour. He’s in his hero outfit and, right, Natsuo should have expected that. An event like this, of course there would be heightened hero surveillance. His father barely spares him a look though, eyes raking over the boy in his arms.</span>\n</p>\n<p>\n<span>“What is that?” he demands.</span>\n</p>\n<p>\n<span>Natsuo’s teeth grind. “It’s a child,” he spits back.</span>\n</p>\n<p>\n<span>“Whose?”</span>\n</p>\n<p>\n<span>That takes him a little aback but then Natsuo realises it <em>could</em> be possible for Touya to be his. Yes, he’d have to have been young but hey, Natsuo never claims to have been a saint. “It doesn’t matter,” is what he says instead.</span>\n</p>\n<p>\n<span>Endeavour marches closer, Touya flinching at the heat that comes with him. “<em>Natsuo</em>.”</span>\n</p>\n<p>\n<span>“Don’t ‘Natsuo’ me Father. I’m here to enjoy myself and how I choose to do so isn’t any of your business.”</span>\n</p>\n<p>\n<span>He sees the instant his father snaps, the venom spewing behind his tongue but before Endeavour can start to yell, Touya wrenches himself free and finally faces him. “Stop!” he cries.</span>\n</p>\n<p>\n<span>Endeavour blinks, hand pausing before his eyes narrow. “You.”</span>\n</p>\n<p>\n<span>Touya shrinks down, Natsuo pulling him back. But when Endeavour makes to grab him, everything comes to a head. Touya claws his way out of Natsuo’s grip, somehow managing to push him aside for all that he’s five-years-old and then activating his own quirk. Flames erupt between them and the crowd around them start screaming. Natsuo yanks Touya to his chest, hissing at him to stop while Endeavour calms the crowd by, apparently, shouting at them. Touya’s flames splutter and die out as his tears start but Natsuo doesn’t even get a chance to talk to him before they’re being marched away. </span>\n</p>\n<p>\n<span>“Where are we going?” Natsuo demands but their father just scoffs.</span>\n</p>\n<p>\n<span>“He can’t control his quirk. He needs to be isolated.”</span>\n</p>\n<p>\n<span>“He’s <em>five</em>!” Natsuo counters, for all the good it does.</span>\n</p>\n<p>\n<span>“Don’t make excuses for him! Shouto was never so useless.”</span>\n</p>\n<p>\n<span>Touya whimpers and if Natsuo could weasel himself free, he would. But he can’t, not without making a scene. Eventually they reach a demountable. It’s been set up for the heroes for when they’re on break, Natsuo realises. He’s mercilessly shoved inside, stumbling a little and making Touya cling to him tighter. </span>\n</p>\n<p>\n<span>“How long has this-” Endeavour gestures loosely at Touya, “-been a thing?”</span>\n</p>\n<p>\n<span>To be smart, Natsuo shoots back, “Twenty-four years.”</span>\n</p>\n<p>\n<span>His father is less than impressed. “As his father, I should have been the first one informed. Where is he being kept?”</span>\n</p>\n<p>\n<span>“If you were a decent father maybe you would have been,” Natsuo says coldly. “But apparently Touya dobbed on you and so now no one in their right mind is letting you anywhere <em>near</em> him.”</span>\n</p>\n<p>\n<span>Endeavour’s eyes narrow. Maybe Natsuo should have kept that to himself. Touya shrinks down further. “I didn’t!” he insists, shaking his head in fear. “I didn’t say anything! I told them it was training!”</span>\n</p>\n<p>\n<span>Natsuo hisses. He glares at his father. “How dare you make him say that.”</span>\n</p>\n<p>\n<span>“I didn’t make him say anything,” is the retort but Natsuo isn’t standing for it.</span>\n</p>\n<p>\n<span>“You did, you just don’t want to admit it.” He meets Endeavour’s gaze. “I will never tell you where Touya is.”</span>\n</p>\n<p>\n<span>It seems redundant because Touya is <em>right there</em> but Endeavour sees the second layer; Natsuo knows where Touya is at his current age. There’s a sense of inarticulate rage and some part of Natsuo fills with pride, knowing he’s pissed his father off this much. It says a very specific something when he isn’t even surprised when a backhanded slap comes his way.</span>\n</p>\n<p>\n<span>What does surprise him though is that it never makes contact. Once more, his brother is there. Touya’s flames are so much hotter than Natsuo remembers and there’s something in his eyes he’s never seen before, something that makes him very much realise: yes, his brother can kill. </span>\n</p>\n<p>\n<span>Endeavour’s throwing up a wall of flames himself even as Natsuo is wrapping himself around Touya. He can’t create ice like Shouto can but he can lower the temperature of things he touches. And so he bundles Touya up and lowers his temperature down, down, down, until his quirk fizzles out and he wracks with cold. Natsuo whispers apologies into his ear even as Touya glares at their father. The flame hero glares back. Before they can inevitably be punished though, a call comes through on Endeavour’s walkie talkie. </span>\n</p>\n<p>\n<em>\n<span>Suspicious activity on the left hand perimeter. All heroes report.</span>\n</em>\n</p>\n<p>\n<span>Endeavour points a finger at them. “Stay here,” he orders.</span>\n</p>\n<p>\n<span>Needless to say, the second he leaves, Natsuo takes Touya and runs.</span>\n</p>\n<p> </p>\n<p>\n<span>***</span>\n</p>\n<p> </p>\n<p>\n<span>Aizawa walks up to his apartment with dread clawing at his throat. Hawks is on his heels and that, he thinks, says enough. While he’d given Natsuo his number, he never thought he’d actually use it. But he had and Aizawa is now having to skip out early from his classes to deal with the aftermath of what sounds like a horrible day. Hawks has been sent along at Tsukauchi’s request and Aizawa really doesn’t know if he’s helping or hindering. For one, he can’t be quiet for more than a minute. Is sixty seconds really <em>that</em> long?</span>\n</p>\n<p>\n<span>Pushing open the apartment door, Aizawa will admit though that this is beyond what he imagined. Because there is Touya, standing on the back of the couch so he’s eye height with Natsuo and downright <em>screaming</em> at him. </span>\n</p>\n<p>\n<span>“Touya, <em>please</em>,” Natsuo is trying but Touya just lets out a wordless shout.</span>\n</p>\n<p>\n<span>“<em>No!</em>” he screams when Natsuo attempts to take his hand. “Don’t touch me! I’m going to kill him! I’m going to kill him!”</span>\n</p>\n<p>\n<span>Flames lash out then and Aizawa’s quirk is activating before he knows it. His capture weapon whips out too. “<em>Stand down Dabi.</em>”</span>\n</p>\n<p>\n<span>Silence fills the room and Aizawa realises he’s gone overboard, momentarily forgotten just how old Touya is, but it doesn’t matter because Touya simply sobs. His shoulders slump and he sobs and sobs. Natsuo goes to pick him up but Touya jerks away. Aizawa lets his capture weapon drop, carefully approaching.</span>\n</p>\n<p>\n<span>“Touya?”</span>\n</p>\n<p>\n<span>“Attacking” him seems to have undone everything because Touya looks at him with hurt eyes before sprinting past. Natsuo shouts in alarm and Aizawa whirls around, thinking he’s gone for the front door but no, Touya has flung himself into Hawks’ legs, wailing until Hawks crouches down and awkwardly pats his back. “Uh...it’s fine kid.”</span>\n</p>\n<p>\n<span>“No it’s not!” Touya cries, balled fists thumping against Hawks’ chest. “He tried to hit Natsuo and...and...Father can’t...he’s only allowed to hit <em>me!</em>”</span>\n</p>\n<p>\n<span>Hawks chokes on his inhale, swearing before his wings subconsciously come to wrap around Touya, pulling him in close. Aizawa’s jaw clenches so hard his teeth grind. He gives Hawks a look.</span>\n</p>\n<p>\n<span>“Take him and go. I need to talk with Natsuo. <em>Alone</em>.”</span>\n</p>\n<p> </p>\n<p>\n<span>***</span>\n</p>\n<p><br>\n<br>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>***</span>\n</p>\n<p> </p>\n<p>\n<span>Hawks won’t lie; he isn’t comfortable. Not in any way, shape, or form. Aizawa has essentially kicked him out of his apartment and left him with a disgruntled five-year-old. Hawks is...not a kid person. Yes, he can wave at them on the street, pose for pictures, and give autographs, but he can’t interact with them for extended periods of time. He isn’t <em>that</em> kind of person.</span>\n</p>\n<p>\n<span>Apparently though, he has to be because Touya is still sniffling and if Hawks returns the kid even <em>more</em> upset, Aizawa will most likely skin him. Call him vain, but Hawks rather likes his skin.</span>\n</p>\n<p>\n<span>And so he looks around and spots a small park down from Aizawa’s apartment block. He takes Touya’s hand and gives it an experimental tug. Touya doesn’t even try to fight, just blindly lets himself be pulled along. It causes Hawks to stumble because he’d been expecting resistance of some sort. After all, this is Dabi. But it clearly isn’t because <em>Touya</em> is meek and quiet and lets Hawks manhandle him to the top of the jungle gym. Hawks sits next to him, an arm awkwardly wrapped around Touya’s shoulders.</span>\n</p>\n<p>\n<span>“You okay?”</span>\n</p>\n<p>\n<span>It seems like a stupid thing to ask but again, Hawks is out of his depths here. Touya, bless him, simply wipes his nose and nods.</span>\n</p>\n<p>\n<span>“You sure? It’s okay not to be.”</span>\n</p>\n<p>\n<span>“No it’s not,” Touya mumbles, curling further into himself and Hawks’ heart aches. How could Endeavour to this to anyone, let alone his own <em>child</em>?</span>\n</p>\n<p>\n<span>“Well,” he says slowly, “It’s okay when you’re with me, how about that?”</span>\n</p>\n<p>\n<span>Touya blinks up at him once, twice, and then bursts into tears. Hawks swears, waving his hands madly but Touya stops him by wrapping his arms around his waist. “I wanna go home!” he wails. “It’s not okay and I want to go home!”</span>\n</p>\n<p>\n<span>“Buddy…” Hawks sighs. “Trust me, I would if I could.”</span>\n</p>\n<p>\n<span>But really no, he wouldn’t. He knows what awaits Touya when he returns to his warped version of “normal”. Touya sniffles a few more times, tucking himself into Hawks’ chest. “You...your name is Hawks, right?”</span>\n</p>\n<p>\n<span>“Yep,” he confirms, shifting his wings out to their full wingspan, hinting at the name’s origin.</span>\n</p>\n<p>\n<span>Touya stares in wonder before dropping his gaze. “Do you work with my father?” A nod, to which Touya cringes. “Do you...like him?”</span>\n</p>\n<p>\n<span>Hawks mulls on that. “...I’m starting not to.”</span>\n</p>\n<p>\n<span>Touya’s head whips up, frowning. “Why? He’s really strong!”</span>\n</p>\n<p>\n<span>“And?” Hawks asks, shrugging. “Lots of people are strong Dabi. But being a hero isn’t about being strong. It’s about saving people. Helping them. And I think,” he adds, more to himself than the boy in front of him, “that you can’t do the things Endeavour does and claim to be a hero.” </span>\n</p>\n<p>\n<span>Hawks is expecting maybe a ‘thank you’, possibly a lecture - with kids you can never tell - but what he isn’t expecting is for Touya to bluntly demand, “Who’s Dabi?”</span>\n</p>\n<p>\n<span>Hawks must be a terrible double agent - he wonders how he fooled Dabi at all - because he jerks back far too quickly to be anything natural. He gives an awkward chuckle, scratching at his cheek. “Dabi? Never heard that name...”</span>\n</p>\n<p>\n<span>Touya looks less than impressed, folding his arms sternly. “You just called me it.” And shit, he did. “And so did Aizawa. My name is Touya!”</span>\n</p>\n<p>\n<span>He pouts and Hawks can’t help but laugh, ruffling his hair. It also gives him time to come up with an explanation. “Ah, Dabi is another guy we know. Kind of looks like you and has a fire quirk too, only, uh, his hair is black.”</span>\n</p>\n<p>\n<span>That’ll work, right? This kid’s only five. They fall for things like that, don’t they?</span>\n</p>\n<p>\n<span>“Is he angry?” Touya asks. “Because Aizawa called that when I was being mad.”</span>\n</p>\n<p>\n<span>“Yeah, a little. But, deep down, I think he’s more hurt than anything. And so,” Hawks says, meeting Touya’s gaze directly. “I want to help him.”</span>\n</p>\n<p>\n<span>He’s never been brave enough to say it to his face but he’s brave enough now. There’s always been something about Dabi that rubbed Hawks the wrong way. He thinks now he knows what it is. That unsaid, unconscious cry for help. As though inside, all this time, Dabi has been screaming.</span>\n</p>\n<p>\n<span>They sit in silence for awhile before Touya rocks forward. “We should go,” he offers as an explanation. “The sun is starting to go down. You always have to be home by dark.”</span>\n</p>\n<p>\n<span>“You’re right,” Hawks agrees, jumping a little when Touya’s hand slides into his. He quickly grips back though, leading the way home.</span>\n</p>\n<p>\n<span>“Hawks,” Touya says as they approach the door. “If you see Dabi again, can you tell him I hope he feels better soon?”</span>\n</p>\n<p>\n<span>Hawks goes to nod before an idea pops into his head. He pulls out his phone, crouching down to Touya’s level and opening the camera, swapping it to video mode. “Here; tell him yourself.”</span>\n</p>\n<p> </p>\n<p>\n<span>***</span>\n</p>\n<p> </p>\n<p>\n<span>Aizawa’s conversation with Natsuo goes about as well as he’d predicted. Natsuo, unlike Fuyumi, has absolutely no intentions of covering for his father and was more than happy to repeat the events of that day to a recorder. He’d also gone back as far as he could remember at Aizawa’s suggestion and his list was long and detailed. Aizawa’s learnt more about Todoroki Enji in one afternoon than he ever wanted to. Also, he’s starting to find himself wishing that that Noumu had taken him out. He’s starting to think it’s a shame Miruko interrupted Dabi.</span>\n</p>\n<p>\n<span>Aizawa then shakes those thoughts away. Those are the sorts of thoughts that lead to vigilante justice and threaten the tenuous hold heroes have on society. He can’t afford to start greying the waters. </span>\n</p>\n<p>\n<span>Hawks brings Touya back seconds behind Yamada arriving. While Yamada greets Touya, Hawks pulls Aizawa aside and Aizawa cringes when he hears the slip up they’ve both made. Luckily Hawks’ cover is good enough to protect them. He thanks the other hero for the heads up and gets a two-fingered salute in response. Hawks goes to leave then but Touya catches the movement, flinging himself out of Yamada’s arms to grasp his shoulder. There’s shouting as both heroes nearly drop the boy but eventually Touya is bundled up in Hawks’ arms.</span>\n</p>\n<p>\n<span>“What kid?”</span>\n</p>\n<p>\n<span>Touya doesn’t say anything, just fists his hands in Hawks’ jacket and hides his face. Aizawa sighs.</span>\n</p>\n<p>\n<span>“Touya, Hawks has to go.”</span>\n</p>\n<p>\n<span>“Want him to stay,” is the despondent mumble, Hawks flushing.</span>\n</p>\n<p>\n<span>Aizawa lays a hand on Touya’s back, trying to ignore the way he flinches. “Hawks has patrol.”</span>\n</p>\n<p>\n<span>Touya reluctantly lifts his head. “Hawks has hero work?”</span>\n</p>\n<p>\n<span>“Yeah,” Hawks says, offering a ‘what-can-you-do’ smile.</span>\n</p>\n<p>\n<span>Touya accepts that, sliding to the floor and shuffling his way to Aizawa’s side. He won’t look at any of them though and Aizawa knows he’s fighting back tears. He rubs the boy’s back soothingly, running a few calculations before pinching the bridge of his nose. “Are you working tomorrow Hawks?”</span>\n</p>\n<p>\n<span>Hawks frowns. “No, I-...No. No, no, no!”</span>\n</p>\n<p>\n<span>Aizawa just grins. “Perfect. I think it’s your turn with Touya. I’ll have him at your apartment by 7.”</span>\n</p>\n<p>\n<span>“I am not a single dad and you’re not my wife!” Hawks cries, stomping a foot petulantly. “This isn’t a custody battle!”</span>\n</p>\n<p>\n<span>“No, but Touya seems to like you. Plus, you’re young.”</span>\n</p>\n<p>\n<span>Hawks squints at him. “I’m not <em>five</em>. But fine!” he sighs, hands flinging into the air dramatically. “I’ll take my turn.”</span>\n</p>\n<p>\n<span>With that, he turns and storms out. Touya cringes when the door slams. “You shouldn’t have said that. Now he’s mad. I can look after myself, I promise! I don’t want to make Hawks angry.”</span>\n</p>\n<p>\n<span>Aizawa should have seen that coming. Luckily, Yamada’s onto it. “He’s not mad, little listener. He just likes to make a fuss. He’s all squawk and no bite.”</span>\n</p>\n<p>\n<span>Touya giggles. “That’s because birds don’t have teeth!”</span>\n</p>\n<p>\n<span>Yamada taps his chin in thought theatrically. “Do you think Hawks has teeth?”</span>\n</p>\n<p>\n<span>Aizawa sees the moment Touya’s mind screeches to a halt. It looks like all systems have gone offline as he struggles over this problem. “You can ask him tomorrow,” Aizawa cuts in before the boy has a full existential crisis. Instead, he shifts down, taking Touya’s shoulders into his. “For now, I need to tell you I’m sorry.”</span>\n</p>\n<p>\n<span>Touya cocks his head to the side in confusion. “For what?”</span>\n</p>\n<p>\n<span>Aizawa can’t believe he even as to answer that; it should be obvious. “First of all, for shouting at you. Secondly, for using my quirk on you without permission. And thirdly, for ensnaring you with this.” He holds up his capture weapon.</span>\n</p>\n<p>\n<span>Touya just shakes his head. “No, it was my fault. I was shouting. And I...I used my quirk. I’m not allowed to.” He chews his bottom lip before straightening, eyes hard when they lock with Aizawa’s. “You can punish me; it’s okay. I deserve it.”</span>\n</p>\n<p>\n<span>Aizawa doesn’t think, just crushes the boy in his arms. “Don’t you <em>ever</em> say that!” he growls, hands shaking even as they hug Touya fiercely. “You are a <em>child</em>! You make mistakes and you have emotions. You did nothing wrong. <em>I</em> did. I am the adult here; I know how to behave and I didn’t.” He holds Touya at arm’s length. “Todoroki Touya, I’m sorry.”</span>\n</p>\n<p>\n<span>Touya breaks down there and for the first time, Aizawa thinks it’s for the right reasons.</span>\n</p>\n<p> </p>\n<p>\n<span>***</span>\n</p>\n<p> </p>\n<p>\n<span>Touya arrives at Hawks’ door bang on seven and quite snappily dressed for a glorified toddler. It’s cute and all but Hawks has been held up at work and didn’t get home until three. He can’t deal with this. </span>\n</p>\n<p>\n<span>He nods at Yamada and drags Touya into the apartment. He helps him out of his shoes and then hauls him to his bedroom, flopping down and spreading a wing over his charge. This way, he’ll know if he moves, even in his sleep. Touya stares at him with wide eyes, confused more than scared.</span>\n</p>\n<p>\n<span>“Hawks?”</span>\n</p>\n<p>\n<span>He groans. “Sorry kid but I’m wiped. Can you sleep?”</span>\n</p>\n<p>\n<span>“I can try?”</span>\n</p>\n<p>\n<span>Hawks pats his back in thanks and lets his eyes fall shut. He knows he’s being unfair but he just can’t right now, he physically <em>can’t</em>. And if Touya is well behaved enough to not disturb him? Hawks is going to shamelessly take advantage of that. </span>\n</p>\n<p>\n<span>It works too because the next thing Hawks knows, he’s being awoken by his phone ringing and a quick glance at it tells him it’s passed eleven. His eyes fly - fly, ha ha - to Touya but he is actually asleep, a fistful of feathers in his tiny hand. Hawks can’t help but smile even as he answers his phone, though he balks at the caller ID somewhat: </span>\n</p>\n<p>\n<em>\n<span>All Might</span>\n</em>\n</p>\n<p>\n<span>“Hello?” he answers with a frown.</span>\n</p>\n<p>\n<em>\n<span>“Uh...Hawks. Yes, it’s me. I, uh-“</span>\n</em>\n</p>\n<p>\n<span>For someone that was so confident as All Might, Toshinori...isn’t. Hawks groans, running a hand through his hair.</span>\n</p>\n<p>\n<span>“Toshinori, what d’ya need?”</span>\n</p>\n<p>\n<em>\n<span>“...for you to let me in?”</span>\n</em>\n</p>\n<p>\n<span>A beat.</span>\n</p>\n<p>\n<span>“What?!”</span>\n</p>\n<p>\n<span>Touya is jerked out of sleep but he isn’t given room to think, Hawks scooping him up as he bolts for his front door. He’s confident the boy’s still mostly asleep when he comes face to face with the once Symbol of Peace. Hawks stares at him dumbly for the longest time before blankly stepping out of the doorway. Toshinori apologises as he enters, shaking his phone as he does so.</span>\n</p>\n<p>\n<span>“Detective Naomasa <em>did</em> message you. I, uh...in light of yesterday’s events, Touya is always to be in the company of two people.”</span>\n</p>\n<p>\n<span>It makes sense but Hawks still isn’t impressed. He just wanted a day off. “Yeah, I was asleep,” he replies offhandedly. “But come in, make yourself at home.”</span>\n</p>\n<p>\n<span>Not that he has much of a ‘home’. It’s a small apartment and it hasn’t been cleaned in the better part of two weeks. His gaming console has wires trailing all over the living room and there are piles of...god, he doesn’t even <em>know</em>, everywhere. Hawks gives Toshinori an awkward grin and, to his relief, Toshinori returns it.</span>\n</p>\n<p>\n<span>“I know the feeling,” he adds in a hushed whisper, relieving Hawks of Touya. “I’ll mind him, if you’d like some time to wake up proper.”</span>\n</p>\n<p>\n<span>Hawks nods wearily, sends Touya a reassuring smile when he looks uncertain, then lumbers back to his bedroom. He has what as to be the fastest shower ever, changes into something slightly presentable, and returns to the main room to start on lunch. His stomach is growling and Touya’s is probably too.</span>\n</p>\n<p>\n<span>“Did he sleep with you?” Toshinori asks as he fumbles with the tv, Touya jabbing buttons on the game controller. “He’ll be up all night.”</span>\n</p>\n<p>\n<span>“Good,” Hawks replies and he means it. He flicks the tv on with a feather, ignoring Toshinori’s embarrassed spluttering. “Dabs, Mario’s already in.”</span>\n</p>\n<p>\n<span>The second the words are out of his mouth, ice pours through his veins. He doesn’t need Toshinori to know he sucks Dabi’s dick on the reg’ and certainly doesn’t need him to know that said villain has come to his apartment and they’ve actually hung out, like friends. The last thing Hawks needs is for Toshinori to know he has given Dabi an <em>affectionate nickname</em>.</span>\n</p>\n<p>\n<span>“Dabs?” Toshinori repeats, frowning.</span>\n</p>\n<p>\n<span>“It’s someone Hawks knows,” Touya pipes up, loading the game with ease and clambering onto the couch. “He’s angry and needs help. Sometimes I get angry too,” he tacks on, blinking up at Toshinori innocently. “Have you ever got angry?”</span>\n</p>\n<p>\n<span>That, luckily, is apparently enough to distract Toshinori, Hawks letting out a <em>whoosh</em> of air. He slaps lunch together and goes to join them on the couch when Touya cuts Toshinori off and he does so brilliantly.</span>\n</p>\n<p>\n<span>“I don’t like you.”</span>\n</p>\n<p>\n<span>Hawks freezes in place while Toshinori’s jaw drops open. Touya has the decency to blush and he squirms uncomfortably but he doesn’t take it back.</span>\n</p>\n<p>\n<span>“Have I done something to upset you?” Toshinori pries gently.</span>\n</p>\n<p>\n<span>Touya frowns, forehead scrunching together. “I don’t...I don’t know,” he admits, a hand clutching at his chest. “But I...in here, I don’t like you. Are we...when I’m big, are we friends?” </span>\n</p>\n<p>\n<span>Toshinori hesitates before his shoulders drop. “No, I wouldn’t say so.”</span>\n</p>\n<p>\n<span>“Must be why,” Touya chirps, grinning again. He waves at Hawks, the hero feeling dread all over again. “Hawks is my friend. When I’m big! I know because he makes me happy!”</span>\n</p>\n<p>\n<span>“Uh uh,” Hawks cuts in before Toshinori can look suspicious. “Good thinking kid, but you like Aizawa too and, sorry to say, you’re not friends right now.”</span>\n</p>\n<p>\n<span>Touya pauses. “Oh.”</span>\n</p>\n<p>\n<span>“It’s an interesting theory though,” Toshinori muses, rubbing his chin thoughtfully. “Some part of Touya’s memories must hang on. Or, his emotional connections at least.”</span>\n</p>\n<p>\n<span>“Maybe,” Hawks says in a tone he hopes is doubtful. “If so, it’s got a few loose connections.” It doesn’t, and that’s terrifying. He plops down next to Touya, hoisting him into his lap. “But you’re my friend now, aren’t you?”</span>\n</p>\n<p>\n<span>Touya nods excitedly, taking a piece of his toast and munching away happily enough. It’s endearing but Hawks has to look away. He can’t put endearing with Dabi. He doesn’t want to imagine Dabi as this...this child. That’s a turn-off if ever he’s seen one. He prefers his men older, thank you very much.</span>\n</p>\n<p>\n<span>Before he can get trapped in his head, Hawks passes a second controller to Toshinori. “Wanna play?”</span>\n</p>\n<p>\n<span>“I...Oh, well, I don’t…”</span>\n</p>\n<p>\n<span>“Toshinori, he’s <em>five</em>.”</span>\n</p>\n<p>\n<span>There’s something challenging in the way Hawks says it and Toshinori seems to pick up on it. His expression instantly changes and Hawks chuckles under his breath. “Take it away Touya!”</span>\n</p>\n<p> </p>\n<p>\n<span>***</span>\n</p>\n<p> </p>\n<p>\n<span>By the time Hawks returns Touya to Aizawa, it’s fast approaching midnight. The kid is asleep, head resting on his shoulder and arms wrapped round the base of his wings. Aizawa looks mildly disgruntled at the late hour but doesn’t say anything, just lets Hawks put Touya into bed, clothes and all. Touya stirs ever so slightly but is soon fast asleep.</span>\n</p>\n<p>\n<span>“Endeavour didn’t bother you?”</span>\n</p>\n<p>\n<span>“Please. He wouldn’t trust me with a kid as far as I could throw one. I was probably the <em>last</em> guy on his radar.”</span>\n</p>\n<p>\n<span>“Good.”</span>\n</p>\n<p>\n<span>Hawks hears the tension there, matching it when he turns around. “Aizawa, this is all going to go to shit tomorrow.”</span>\n</p>\n<p>\n<span>Aizawa’s eyes narrow. “Then make sure it doesn’t.”</span>\n</p>\n<p>\n<span>Hawks snorts. “Not my job. Take it up with the Todorokis.”</span>\n</p>\n<p>\n<span>It’s Aizawa’s turn to snort. “I wouldn’t let him anywhere near them. Well, some of them.”</span>\n</p>\n<p>\n<span>“Yeah, so...what do we do?”</span>\n</p>\n<p>\n<span>Aizawa is silent. And somehow, that’s worse.</span>\n</p>\n<p> </p>\n<p>\n<span>***</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“Ah, Tsukauchi, thank you for picking up...yes, I know it’s late...I </span></em>will<em> sleep, I just...the security footage Hawks found regarding when he found Dabi, do you have it?...No, I didn’t think so...Yes, put Sansa onto it. I think we’re missing something.”\n</em>\n</p>\n<p> </p>\n<p>\n<span>***</span>\n</p>\n<p><br>\n<br>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>***</span>\n</p>\n<p> </p>\n<p>\n<span>Aizawa wakes up on the dawn of D-Day with trepidation already filling his bones. Yesterday went well, he knows that, and he knows that Touya is probably going to wake up in the best mood he’s been in since this whole debacle started but none of that matters because it’s all going to end the same way:</span>\n</p>\n<p>\n<span>Todoroki Touya turning back into Dabi.</span>\n</p>\n<p>\n<span>And that in itself is going to have horrible consequences. Even if Aizawa knows what Todoroki Enji has done to Touya, it doesn’t excuse everything. Hell, it doesn’t excuse <em>ninety-percent</em> of it. There’s then the fact that Touya - or Dabi, he supposes - won’t remember any of this and will attack them on sight. Aizawa doesn’t blame him. If their situations were reversed, he’d do the same. Actually, he’ll probably end up doing so anyway because he’ll need to shut Dabi down the second he turns back. </span>\n</p>\n<p>\n<span>Which is probably why Aizawa messages Naomasa and tells him he’ll be in later with Touya; best to have him turn back at the station then try to wrestle him there and potentially lose him. He also contacts Nedzu but the principal has long since been made aware and has relieved not only him, but Yamada and Toshinori as well. Apparently this is a all-hands-on-deck scenario. </span>\n</p>\n<p>\n<span>Sighing, Aizawa flops onto the couch, head lolling over the back. He’s ready for bed already.</span>\n</p>\n<p>\n<span>He doesn’t get the chance though, not when footsteps stop just shy of the couch. “Morning Touya,” he greets lazily.</span>\n</p>\n<p>\n<span>“Hi,” Touya whispers, skirting around him and settling in on the floor with a colouring book Natsuo had bought him. His alpaca is, once again, stuffed under his arm.</span>\n</p>\n<p>\n<span>“You ready for today?” Aizawa asks, swearing when he’s met with confusion and right - they hadn’t told the kid.</span>\n</p>\n<p>\n<span>“What’s today?”</span>\n</p>\n<p>\n<span>Aizawa can’t lie; it wouldn’t help any of them. He nudges Touya’s knee with his foot. “This quirk wears off today.”</span>\n</p>\n<p>\n<span>Touya’s eyes widen. “I...I’m going to be a big boy?”</span>\n</p>\n<p>\n<span>Aizawa huffs unbidden. “Yeah, you are.”</span>\n</p>\n<p>\n<span>Touya looks disgustingly proud, smiling the widest perhaps Aizawa has seen. He manages a fake one in return but it’s enough, Touya returning to his colouring. Yamada takes that as his moment to arrive, still in his pyjamas and hair pulled into a loose braid, strands having escaped sometime during the night and flying every which way. Aizawa accepts the kiss to the cheek before going to start breakfast. Yamada flops down beside Touya and reaches up to ruffle his hair. </span>\n</p>\n<p>\n<span>“I’m gonna miss ya kid,” he murmurs. </span>\n</p>\n<p>\n<span>Touya shoves him off. “Well I won’t,” he sniffs. “<em>I</em> get to go home. <em>I</em> get to see Mother!”</span>\n</p>\n<p>\n<span>Yamada freezes there, Aizawa’s eyes closing in despair because that isn’t...that’s not what’s going to happen. It isn’t anywhere <em>close</em>. Today will end with Touya in a jail cell. Yamada just lets his hand drop, staring at the ceiling resolutely. “I guess so.”</span>\n</p>\n<p>\n<span>Not long after Aizawa calls them to breakfast. And as Touya happily munches away, eating foods Aizawa now knows are his favourites, Aizawa only feels worse and worse. He’s leading a lamb to the slaughter.</span>\n</p>\n<p>\n<span>And, worst of all, he’s supposed to be okay with it.</span>\n</p>\n<p> </p>\n<p>\n<span>***</span>\n</p>\n<p> </p>\n<p>\n<span>They arrive at the station just after midday. Toshinori is already there, having been in meetings with Naomasa all morning. Aizawa doesn’t know what the pair talk about, but he knows they’re often together. There’s things they know that he doesn’t and, as time progresses, Aizawa is starting to think more and more that one of those things involves Midoriya. He doesn’t have any proof, but he’s going to get answers sooner or later.</span>\n</p>\n<p>\n<span>Who is, however, most notably missing is any member of the Todoroki clan. Naomasa must see the question on his face, smiling.</span>\n</p>\n<p>\n<span>“Natsuo will be here within the hour, Fuyumi a little afterwards. There should be time, before the quirk wears off.”</span>\n</p>\n<p>\n<span>Touya bounces on his toes excitedly, all too happy when Naomasa asks if he would like to say hello to Sansa again. The officer is standing only a few feet away but just enough so, Aizawa notices, to be out of earshot. Ah. So there’s something there. Something regarding Touya that Naomasa doesn’t want him to hear. It doesn’t take a genius to guess what that something might entail. </span>\n</p>\n<p>\n<span>“When you say before the quirk wears off, how do you know?” Yamada asks before Aizawa can get a word in. “Even if it’s an exact thing, we don’t know when Dabi was hit, only when Hawks found him.” </span>\n</p>\n<p>\n<span>Toshinori shifts there, Aizawa’s eyes narrowing. “<em>What?</em>”</span>\n</p>\n<p>\n<span>Toshinori jumps, hands wringing together but it’s Naomasa who saves him, placing a hand on those trembling ones and shaking his head. “Don’t. It’s thanks to Toshinori we have this lead at all.”</span>\n</p>\n<p>\n<span>Aizawa frowns as Naomasa passes his phone over, a video playing on the screen. “This is the security footage of when Dabi was…” He doesn’t say ‘attacked’ because it doesn’t fit, just shrugs.</span>\n</p>\n<p>\n<span>“This is the <em>recovered</em> footage,” Naomasa corrects, Aizawa locking up while Yamada bunches in closer.</span>\n</p>\n<p>\n<span>“Someone got something to hide?” Yamada questions aloud, squinting the same moment Aizawa nearly drops the device.</span>\n</p>\n<p>\n<span>Because he <em>can’t</em> hide. There’s no way to, not with his quirk’s mutation being what it is. And so, very obviously, there is Hawks, striding along at Dabi’s side as though he belongs there, grinning up at the villain and getting an exasperated look in return. Aizawa’s hands shake in fury as Hawks’ hand slides into Dabi’s, smile just as wide but softer somehow. He has to hand the phone back entirely when Dabi backs him into a wall and kisses him soundly. </span>\n</p>\n<p>\n<span>“Shouta…”</span>\n</p>\n<p>\n<span>Aizawa brushes his husband’s arm off his shoulder, teeth grinding. “So <em>this</em> is how High End came about.”</span>\n</p>\n<p>\n<span>“We’re not sure,” Naomasa cuts in, gently but firmly. “If you’ll recall, Hawks looked just as surprised as us to find out Dabi was actually Todoroki Touya.”</span>\n</p>\n<p>\n<span>“He idolises Endeavour,” Yamada says, tapping his chin thoughtfully. “The revelation probably threw him; knowing Endeavour did...that.”</span>\n</p>\n<p>\n<span>“It doesn’t change the facts,” Aizawa counters stonily. “We now know which side he’s on.”</span>\n</p>\n<p>\n<span>A hand curls around his, Aizawa snarling, already knowing who it is. “We actually don’t,” Toshinori whispers. “I made some calls, used my position. The commission was very...unforthcoming regarding this.”</span>\n</p>\n<p>\n<span>“You think it’s a job,” Yamada surmises.</span>\n</p>\n<p>\n<span>Toshinori nods. “I think...Hawks is in a delicate situation right now.”</span>\n</p>\n<p>\n<span>Aizawa snorts. “Commission or not, I’m sure he’s gone above and beyond in some aspects.”</span>\n</p>\n<p>\n<span>He doesn’t need to specify which areas and Toshinori goes red to the tips of his ears. Naomasa also coughs awkwardly while Yamada simply looks ill. They don’t get to dwell on it though - although it <em>does</em> explain Hawks’ absence - because at that moment the doors to the police station open. The doors opening isn’t what gets their attention, but rather the heat wave that follows it and Aizawa already knows that what means, eyes flying to Touya. Touya, to his credit, already knows as well. He swallows thickly and gets to his feet, head bowed. It’s a submissive pose if Aizawa has ever seen one. </span>\n</p>\n<p>\n<span>Aizawa understands but that doesn’t make it okay, taking two steps closer to the boy even as Endeavour glares at him. Aizawa wonders how he even found them. Who did he pressure? Who finally caved?</span>\n</p>\n<p>\n<span>“Ah, Enji!” Toshinori greets grandly and Aizawa is, for once, grateful for his overzealousness. “It’s good to see-”</span>\n</p>\n<p>\n<span>“<em>You, quiet.</em>”</span>\n</p>\n<p>\n<span>The tone is deathly cold and Aizawa does a double take as Toshinori pales. He pulls himself back up seconds later but it’s already too late, he’s already shown that fatal weakness. Endeavour eyes them all up as though they’re nothing more than minor inconveniences.</span>\n</p>\n<p>\n<span>“I’ll be taking my son.”</span>\n</p>\n<p>\n<span>It’s a statement.</span>\n</p>\n<p>\n<span>“I’m afraid I can’t allow that,” Naomasa intervenes. “Touya is currently part of a police investigation.”</span>\n</p>\n<p>\n<span>“Is he facing charges?” Endeavour sneers, knowing the answer. He nods when Naomasa doesn’t answer. “Then he comes with me.”</span>\n</p>\n<p>\n<span>“Enji,” Toshinori tries again and Aizawa has to admit, credit where credit’s due. “This is a...delicate time. This quirk will wear off soon and it would be safer for Touya to be here when it happened than-”</span>\n</p>\n<p>\n<span>“<em>Toshinori</em>.” Said man’s jaw snaps shut. “Are you insinuating I can’t control my own child?”</span>\n</p>\n<p>\n<span>Unfortunately, it’s the exact opposite. He <em>can</em> control Touya and that, ironically, is what they’re all trying to prevent. Because they’ve seen Endeavour’s method of ‘control’ and <em>no one</em> deserves to go through that.</span>\n</p>\n<p>\n<span>Aizawa’s tempted to let Endeavour take him purely so Touya can light him on fire sometime very soon but he’s pretty sure that’s frowned upon. Also, it creates all sorts of hassles on their end, especially considering none of them have actually filed that they have an <em>actual live villain</em> in their midst that they’re all protecting and, even worse, sending on outings. Aizawa doubts the press would be impressed to discover they’d had a villain in custody for five days and they let him play video games and go for ice-cream. And so, he has to step in. </span>\n</p>\n<p>\n<span>“Naomasa has already said no,” he drawls. “As a police officer, his jurisdiction goes above yours.”</span>\n</p>\n<p>\n<span>And it does, in the law system. However, Endeavour seems to know the system as well as Aizawa does.</span>\n</p>\n<p>\n<span>“When acting as a hero, yes,” Endeavour says all too smugly. “As a father, no. Touya, <em>now</em>.”</span>\n</p>\n<p>\n<span>Before any of them can push back, Aizawa feels a hand grasp his own momentarily. The next second Touya is at Endeavour’s side, turning to them and bowing shortly. “I’m sorry, for the trouble I’ve caused.”</span>\n</p>\n<p>\n<span>“As you should be,” Endeavour snaps down at him, Touya flinching. His hand, when it lands on his son’s shoulders, looks near painful. “We’re leaving.”</span>\n</p>\n<p>\n<span>“...yes sir.”</span>\n</p>\n<p>\n<span>Toshinori makes an aborted motion but he doesn’t have to finish it because as Endeavour has contacts, clearly Hawks does too. Aizawa feels his emotions conflict at the sight of the winged hero but he barely spares them a glance, feigning obliviousness as he bumps into Endeavour and then smiles widely.</span>\n</p>\n<p>\n<span>“Hey, hey, imagine seeing you here!” he crows, arms spreading wide. “And who’s this? You never said you had a kid smaller than Shouto!”</span>\n</p>\n<p>\n<span>“I <em>don’t</em>,” Endeavour grinds out, trying to push past only to fail. “This is my eldest.”</span>\n</p>\n<p>\n<span>Hawks looks at Endeavour like he’s an idiot. “Uh...kinda short, don’t you think?”</span>\n</p>\n<p>\n<span>Bets are off, Aizawa likes him again. Touya giggles and Hawks flinches when Endeavour’s fingers dig into his shoulder sharply, warning clear. “This is a quirk, obviously. I’m taking him home.”</span>\n</p>\n<p>\n<span>“Oh cool,” Hawks sings, falling in step like it’s second nature. “I’ll come with! You never talk about your family. Now I get to see it in person.”</span>\n</p>\n<p>\n<span>Endeavour glares at him but Hawks just smiles back serenely. “<em>You</em> are not invited,” Endeavour spits.</span>\n</p>\n<p>\n<span>“Don’t be like that,” Hawks whines, and they’re dangerously close to leaving the station now. Realistically, letting Touya go so long as Hawks is by his side is better than letting him leave alone but it’s far from ideal. Because, again, they might not get Dabi back, not if Hawks turns a blind eye. “Besides, can’t see you as a kid person anyway. And he’s, what, three?”</span>\n</p>\n<p>\n<span>“I’m five!” Touya protests and it’s innocent enough but it creates the crack; one pressure too many. Endeavour backhands him and Aizawa can tell it’s a warning - and isn’t that just sick in itself? - but it’s already too much. Aizawa had always known Hawks was fast but he’s never seen him in action until just now. Before he can so much as <em>blink</em>, before Endeavour can pull his hand back, before Touya can cry, Hawks is behind them, said boy in his arms. One wing is flared out, the other curled around Touya protectively, and his eyes are burning. </span>\n</p>\n<p>\n<span>“<em>Don’t touch him.</em>”</span>\n</p>\n<p>\n<span>Aizawa’s eyes widen ever so slightly. This isn’t a job to Hawks, he suddenly realises. He isn’t stringing Dabi along. No, there’s feelings there and they’re coming through like beacons now. </span>\n</p>\n<p>\n<span>Endeavour blinks at him in confusion. “That’s...Hawks, return my son.”</span>\n</p>\n<p>\n<span>Hawks doesn’t so much as bat an eyelid. “Sorry Enji-” Aizawa takes satisfaction in how the hero reels there, “-but I won’t let Touya get hurt by you again.”</span>\n</p>\n<p>\n<span>There’s a beat and then suddenly the weight of that sentence seems to hit. There are implications there. Implications that one, Hawks knows what Endeavour’s done behind closed doors and two, he knows Touya because Endeavour hasn’t disclosed Touya’s name to him yet. </span>\n</p>\n<p>\n<span>“So you were in on it,” Endeavour realises, eyes narrowing.</span>\n</p>\n<p>\n<span>Hawks doesn’t answer him, just lifts Touya’s chin with a hand. “Hey, you good?”</span>\n</p>\n<p>\n<span>Touya goes to nod before seemingly remembering something. He then shakes his head and bursts into tears. Hawks tightens his grip, tucks Touya further into his chest. He sends a pleading look at Aizawa and Toshinori and of course, they’re trying to keep Touya <em>away</em> from things that upset him, that overload his emotions.</span>\n</p>\n<p>\n<span>“I can leave,” he murmurs, so low only Aizawa can hear it. “I can do that before Endeavour can catch me.”</span>\n</p>\n<p>\n<span>Aizawa peers down at him. “But would you return him?”</span>\n</p>\n<p>\n<span>He points at Touya by way of explanation and Hawks’ cocks his head in confusion before suddenly all the blood drains from his face. He stumbles back a step, swallowing thickly, but in the exchange they’ve forgotten the most volatile person in the room. And just like that, Endeavour’s hand is wrapped around Hawks’ arm, yanking him forward. There’s the smell of burning, Hawks whimpering as some feathers are obviously caught in the crossfire but it doesn’t make Endeavour relent. </span>\n</p>\n<p>\n<span>“My son, Hawks.”</span>\n</p>\n<p>\n<span>Blue.</span>\n</p>\n<p>\n<span>That’s the only colour Aizawa can see.</span>\n</p>\n<p>\n<span>And heat. All he can feel is heat.</span>\n</p>\n<p>\n<span>His vision clears and Aizawa can only dread what he sees:</span>\n</p>\n<p>\n<span>Todoroki Touya, aka Dabi, standing tall at over six feet, glaring at his father with murder in his eyes while Hawks nurses a burnt wing behind him. Endeavour looks shell shocked.</span>\n</p>\n<p>\n<span>“<em>You</em>.”</span>\n</p>\n<p>\n<span>Dabi spares a look over his shoulder at Hawks. He then let his head loll forward, flames wrapping up his arms.</span>\n</p>\n<p>\n<span>“Payback time.”</span>\n</p>\n<p> </p>\n<p>\n<span>***</span>\n</p>\n<p><br>\n<br>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>***</span>\n</p>\n<p> </p>\n<p>\n<span>So many things happen in that next instant, Aizawa isn’t sure he can catalogue them all. Dabi moves at the same time Hawks does, one going to attack, the other going to block. Endeavour is calling flames to his hand the same second Toshinori - <em>Toshinori</em>, god dammit! - jumps in front of him. Natsuo takes that moment to arrive and it’s just a mess all around. Aizawa barely has time to activate his quirk and render Dabi useless before the two Todorokis collide.</span>\n</p>\n<p>\n<span>“<em>Stop it!</em>” Hawks hisses. “This isn’t the time!”</span>\n</p>\n<p>\n<span>Dabi’s eyes narrow at him before flicking to Aizawa. “Let me go.”</span>\n</p>\n<p>\n<span>It’s a command but Aizawa won’t fall for it. Toshinori is pleading with Endeavour on the other side and perhaps the one thing that makes everyone pause, gives them a second to breathe, is Endeavour knocking Toshinori aside only for Toshinori to somehow summon from deep inside of him enough remnants of his quirk to become All Might. The change startles everyone; All Might may be gone but his form is as intimidating as it always was. </span>\n</p>\n<p>\n<span>“<em>Enough</em>.”</span>\n</p>\n<p>\n<span>He doesn’t shout the words but they boom all the same. </span>\n</p>\n<p>\n<span>Dabi seems about to dismiss him when Hawks says that one word that tilts the whole situation:</span>\n</p>\n<p>\n<span>“Touya.”</span>\n</p>\n<p>\n<span>It’s like the air leaves the police station. Dabi whips around to Hawks, eyes wide with what Aizawa can only describe as panic. He’s paler than ever and Natsuo takes that moment to cross the room and wrap a hand around Dabi’s wrist. It’s obvious he knows and Dabi reels at that too. </span>\n</p>\n<p>\n<span>The whole exchange takes place in less than five seconds and Aizawa needs it to because he’s reaching his limit and Toshinori clearly is too. He then says something he hopes he won’t regret.</span>\n</p>\n<p>\n<span>“Hawks, get them out of here.”</span>\n</p>\n<p>\n<span>Hawks, to his credit, doesn’t second guess him at all. He and the two Todorokis are gone seconds later and Endeavour shouts in rage just as Toshinori stumbles back and ends up hacking into his hand as Naomasa supports him. Aizawa doesn’t blink when Endeavour rounds on him.</span>\n</p>\n<p>\n<span>“You let him escape.”</span>\n</p>\n<p>\n<span>“I would have thought,” he drawls, “That you’d be more concerned about why your son openly tried to kill you. It’s interesting...what could have driven him to do that.”</span>\n</p>\n<p>\n<span>Endeavour’s eyes flash. “You know <em>nothing</em>.”</span>\n</p>\n<p>\n<span>Aizawa scoffs, arms folding. “I know surprisingly a lot. If I were you, I’d let this go. At least, for now.”</span>\n</p>\n<p>\n<span>He doesn’t think he will, but something in his expression must be enough because Endeavour <em>actually</em> backs down. He’s then storming to the door, phone in hand, and Aizawa has no doubt who he’s ringing. Hopefully, Natsuo will be smart enough not to answer.</span>\n</p>\n<p> </p>\n<p>\n<span>***</span>\n</p>\n<p> </p>\n<p>\n<span>They land in a deserted park what is probably only minutes later. Natsuo goes to pull Touya into a hug but the hero Hawks stops him. He’s about to protest when Touya abruptly pushes himself away and is violently ill into the rubbish bin closest. His motion sickness suddenly comes back to Natsuo but it also makes him frown a little because it seems as though Hawks knew about it. And how does Hawks, the number two hero, know that his brother, a high ranked villain, suffers from motion sickness? Something doesn’t add up.</span>\n</p>\n<p>\n<span>Still, once Touya composes himself, Natsuo passes over a bottle of water, huffing when it’s snatched from his grip. “Not even a thank you?”</span>\n</p>\n<p>\n<span>His tone is teasing enough but Touya - or maybe it’s Dabi - just sneers at him. The difference from two days ago is startling. “Why should I?”</span>\n</p>\n<p>\n<span>Hawks groans. “Civility guys, come on.”</span>\n</p>\n<p>\n<span>All that does though is get Touya’s attention to turn to him and Natsuo yelps when his brother suddenly has a fistful of Hawks’ collar and is yanking him off the ground. “And what was that stunt? Changing sides?”</span>\n</p>\n<p>\n<span>Hawks merely rolls his eyes. “We were in a police station; my hands were tied. Anyway, don’t you wanna know how you got there?”</span>\n</p>\n<p>\n<span>There’s too much to unpack there but Natsuo is only concerned with how Touya suddenly looks uncertain, thrown. “I…”</span>\n</p>\n<p>\n<span>Natsuo shuffles forward, tentatively holding out his phone. It’s open to a photo he’d taken at the festival; one of him and Touya. Touya barely spares the photograph a second of his time before doing a hilarious double take. The phone is snatched up and Natsuo can see him zooming in and scrolling through his camera roll. Luckily he has nothing incriminating on there.</span>\n</p>\n<p>\n<span>When he’s done, Touya turns straight to Hawks and yeah, that hurts a bit. “What is this?” he demands. </span>\n</p>\n<p>\n<span>“A quirk,” Hawks supplies with a shrug, grinning breezily when Touya snarls at him. “You make an adorable toddler.”</span>\n</p>\n<p>\n<span>“Stop teasing him,” Natsuo says quietly, trying again at laying a hand on Touya’s arm. Touya flinches but doesn’t move away, even if his jaw is clenched so hard Natsuo is surprised his teeth don’t shatter. “You were five-years-old again. Your memories were gone too. It was...odd.”</span>\n</p>\n<p>\n<span>“How long?”</span>\n</p>\n<p>\n<span>“Five days.”</span>\n</p>\n<p>\n<span>Touya stiffens. “And you, what, <em>kept</em> me?”</span>\n</p>\n<p>\n<span>“You’re a <em>villain</em>,” Hawks cuts in, tone icy. “We didn’t have a choice. Plus, you were <em>five</em>. Who lets a five-year-old roam the streets?”</span>\n</p>\n<p>\n<span>“You weren’t locked up,” Natsuo placates. </span>\n</p>\n<p>\n<span>Touya snorts in derision. “I’m sure. Because you’d all just let a villain walk around.”</span>\n</p>\n<p>\n<span>Natsuo wants to hit him. Hawks actually does, though it’s nothing more than a light punch to the stomach. “Pretty sure your brother just showed you pictures of you, you know, outside.”</span>\n</p>\n<p>\n<span>The third time is, apparently, the charm because it’s the time that finally makes Touya snap. “What do you mean, brother?”</span>\n</p>\n<p>\n<span>It’s the wrong thing to say, to both of him. Natsuo’s expression flattens while Hawks bristles in anger and this time it’s <em>Hawks</em> dragging Touya down. “You’ve got some nerve Todoroki Touya, making me risk everything for you and your little gang when <em>you</em> were the one holding every card to your chest. You already fucked up with High End, and now I know it was personal. I’d really rethink my strategy if I were you.”</span>\n</p>\n<p>\n<span>“Easy birdi-”</span>\n</p>\n<p>\n<span>Touya doesn’t get to finish, Hawks doing something Natsuo isn’t fast enough to catch and slamming his brother into the ground. “<em>You</em> talk to him,” he snaps at Natsuo before marching away, shoulders hunched over in what suspiciously looks like hurt.</span>\n</p>\n<p>\n<span>Natsuo looks back around just in time to see Touya look guilty. The look’s gone as soon as it appears but it’s enough, the pieces sliding together. He sighs. “So you and Hawks, huh?”</span>\n</p>\n<p>\n<span>Touya stares down at him like he’s the scum of the earth. “So pretentious, Todoroki Natsuo.”</span>\n</p>\n<p>\n<span>He doesn’t hit him, he doesn’t, but Natsuo’s hand stops just shy of his cheek, shoulders shaking as he tries not to sob. “Stop it, just stop it,” he begs. “You’re not...Touya, <em>please</em>. I know, okay? I know you had it so much worse than the rest of us and I know I didn’t do enough and I should have. I <em>know</em> I failed you as a brother! I looked for you Touya, looked everywhere but you were just gone. So don’t pretend you don’t know me now! You’re better than that!”</span>\n</p>\n<p>\n<span>Touya takes a subconscious step back. He has that look on his face that says he wasn’t aware he was actually passable at anything, let alone above the bottom line. </span>\n</p>\n<p>\n<span>“I’m not-”</span>\n</p>\n<p>\n<span>“None of us are,” Natsuo snaps. “We’re all not what we used to be. How <em>could</em> we be? But you don’t have to make it worse!”</span>\n</p>\n<p>\n<span>Touya flinches and Natsuo takes that as good enough. He embraces Touya and this time, he isn’t pushed back. The hug isn’t returned by any means but it’s more than Natsuo expected. He lets go sooner than he’d like but his smile remains a little longer. When it’s time to talk though, Natsuo steps away. He nods in Hawks’ direction. </span>\n</p>\n<p>\n<span>“They,” - meaning the heroes, “-refused to let Father near you. They’ve been hiding you, keeping you safe. I think Hawks risked a lot.”</span>\n</p>\n<p>\n<span>Touya stuffs his hands into his pockets. “I didn’t ask him too.”</span>\n</p>\n<p>\n<span>Natsuo smiles sadly. “Sometimes, you don’t have to.”</span>\n</p>\n<p>\n<span>Touya doesn’t reply, just stalks over to where Hawks is. Hawks looks unimpressed and honestly, Natsuo doesn’t blame him. As the pair start talking, Natsuo fiddles with his phone. He’s unsurprised at the amount of missed calls that stare back at him, all from the same person. He keeps his phone on ‘do not disturb’ and flicks a text Shouto’s way to tell him to steer clear too. He gets a thumbs up back almost straight away which makes it clear their father’s obviously been harrassing Shouto too. Typical. </span>\n</p>\n<p>\n<span>Natsuo looks up at a noise up ahead, which turns out to be Hawks knocking Touya’s hand away with a wing. Touya looks indignant while the hero looks betrayed and that’s <em>worse</em> than him being angry in Natsuo’s mind. Anger is easy to soothe. Broken trust? That’s near impossible to repair. </span>\n</p>\n<p>\n<span>The pair come back over, Hawks looking anywhere but at Touya. “I’m supposed to be on duty,” he mumbles. “And, I mean, I’ll probably lose my job over this but I’m leaving him with you. You do what you think is best.”</span>\n</p>\n<p>\n<span>Natsuo’s mouth drops open, Touya’s too, but then Hawks is gone. All that’s left of him is a message appearing on Natsuo’s phone and how did Hawks even get his number? </span>\n</p>\n<p>\n<span>Either way, he stomps on Touya’s foot, scowling. “You need to fix that.”</span>\n</p>\n<p> </p>\n<p>\n<span>***</span>\n</p>\n<p> </p>\n<p>\n<span>Aizawa admits he is stunned hours later when there’s a knock at his door and on the other side stands both Todoroki Natsuo and Touya. Dabi has a hoodie pulled over his face to obscure his appearance and he doesn’t look ready to murder any of them. He’s oddly quiet as Natsuo speaks for them. </span>\n</p>\n<p>\n<span>“I...I didn’t know where to take him,” he admits. “I know Touya’s done a lot of wrong things but if I took him to the police they’d-”</span>\n</p>\n<p>\n<span>“Kid, murdering people isn’t doing a “wrong thing”,” Hizashi cuts in severely, Natsuo slumping.</span>\n</p>\n<p>\n<span>“I know,” he whispers hoarsely.</span>\n</p>\n<p>\n<span>Dabi is still silent and Aizawa groans, waving a hand. “In.”</span>\n</p>\n<p>\n<span>Hizashi starts to protest but Aizawa just shakes his head. He also calls Naomasa and does so in front of Dabi so he knows where the lines are drawn. The villain glares at him the whole time but there’s something off about him. He knows, then, what’s happened to him. And he’s scared. Scared, because he doesn’t know what he’s said or what he’s confessed to. Dabi’s eyes then land on the array of children’s toys he and Hizashi haven’t gotten around to cleaning yet and he stops dead in his tracks.</span>\n</p>\n<p>\n<span>Then:</span>\n</p>\n<p>\n<span>“I need to go.”</span>\n</p>\n<p>\n<span>Aizawa’s capture weapon activates then, as well as his quirk. “<em>Don’t</em> test me,” he growls.</span>\n</p>\n<p>\n<span>“Touya,” Natsuo murmurs, or probably pleads.</span>\n</p>\n<p>\n<span>Dabi relents but he looks even more unhappy than before. His hands shake in a way Aizawa recognises from years on the job: he’s itching for a smoke. Nerves will do that to you. </span>\n</p>\n<p>\n<span>They awkwardly loiter in the living room until Naomasa arrives. Natsuo has tried to coerce Dabi into conversation but has been pushed away every time. Hizashi won’t talk to anyone except Aizawa and Aizawa isn’t particularly in the mood to talk. Even by bringing Dabi here, Natsuo has shown his brother too much. Aizawa’s already contemplating where he and his husband should move to next, now that their home is compromised. </span>\n</p>\n<p>\n<span>Naomasa gets let in and does what no one else has been able to do: make them sit. Dabi balks but Natsuo sends him a warning look that even Aizawa is willing to admit is good. </span>\n</p>\n<p>\n<span>“He came to you?” Naomasa asks, as surprised as Aizawa was some thirty minutes ago.</span>\n</p>\n<p>\n<span>“<em>He</em> can hear you,” Dabi snaps, brow pinched and by god does he look like Shouto in that instant; petulant and prideful. </span>\n</p>\n<p>\n<span>“You’re on thin ice; don’t test me,” Aizawa warns. </span>\n</p>\n<p>\n<span>Dabi folds his arms angrily and pointedly looks away, Natsuo rolling his eyes next to him.</span>\n</p>\n<p>\n<span>“Where’s our father?” he asks, knee bouncing. “Did he…”</span>\n</p>\n<p>\n<span>“I wasn’t followed, if that’s what you’re asking,” Naomasa assures. “After he stormed out, he hasn’t been sighted. Hawks is out looking now; to give us a location update if nothing else.”</span>\n</p>\n<p>\n<span>“How likely is it that this will end up in the news?” Aizawa says, because it needs to be said.</span>\n</p>\n<p>\n<span>“Unlikely,” Naomasa replies, though he winces. “With the information and evidence we’ve compiled, it won’t look good on Endeavour. But it also doesn’t look good on us. What we did was wrong, even if for the right reasons.”</span>\n</p>\n<p>\n<span>Dabi sucks in a sharp breath there and then quickly pretends he didn’t. Right. He’s probably not used to people defending him. </span>\n</p>\n<p>\n<span>“Our hands are tied. There’s only one option available to us right now.”</span>\n</p>\n<p>\n<span>Dabi makes to bolt even as Aizawa is ensnaring him once again. He’s not an idiot. He knows what the option is: bring him in.</span>\n</p>\n<p>\n<span>“You can’t!” Natsuo protests, yanking his brother down and fiercely telling him off. “It’s not...it wasn’t…”</span>\n</p>\n<p>\n<span>“Someone has to go jail Natsuo,” Naomasa tells him gently. “And, unfortunately, your brother’s choices have put him there.”</span>\n</p>\n<p>\n<span>“But Father-”</span>\n</p>\n<p>\n<span>“Didn’t make him kill people.”</span>\n</p>\n<p>\n<span>“No. What he did was <em>worse</em>.”</span>\n</p>\n<p>\n<span>Natsuo breaks down there and Aizawa feels his heart break. This isn’t fair. This isn’t fair on any of them but Naomasa is right. They can’t hide this. They can’t let Dabi escape. Even Dabi seems to know; of course he knows - it’s why he’s fighting so much. </span>\n</p>\n<p>\n<span>“We can try for a lesser sentence due to psychological damage,” Naomasa tries but Natsuo just shakes his head. Surprisingly, Dabi is too. Although, he explains that a second later,</span>\n</p>\n<p>\n<span>“I make my own choices.”</span>\n</p>\n<p>\n<span>Aizawa calls bullshit, Natsuo does literally. “Please. Everything you’ve done, everything you’re doing, is because of him. Even if you don’t think so.”</span>\n</p>\n<p>\n<span>Dabi looks away. They’re all lost in thought until Natsuo passes his phone over. “Also, Hawks sent me this. He says it’s for you.”</span>\n</p>\n<p>\n<span>Dabi frowns but takes the phone. He makes an involuntary noise at whatever’s on the screen but Aizawa doesn’t even as to ask before Dabi is fumbling for the volume switch and watching with rapt attention. Aizawa recognises the voice within seconds: Touya.</span>\n</p>\n<p>\n<em>\n<span>“So, he’ll see me?”</span>\n</em>\n</p>\n<p>\n<em>\n<span>“Yeah.”</span>\n</em>\n<span> And there’s Hawks.</span>\n</p>\n<p>\n<em>\n<span>“Well, okay! Um...hi Dabi! You don’t know me but I’m Touya. Hawks says you’re mad a lot but also really sad. I’m sad too and sometimes mad. I’m sorry bad things happened to you. They happened to me too; they still do...But it’s okay because happy things happen too. I saw my mother yesterday - that made me happy!”</span>\n</em>\n</p>\n<p>\n<span>Aizawa sees it, the crack in Dabi’s composure there.</span>\n</p>\n<p>\n<em>\n<span>“So you can find something happy too. Hawks says he’s your friend so that’s something to be happy about! Um...I have to go but if you ever need to talk, I’m here. I’m always happy to help!”</span>\n</em>\n</p>\n<p>\n<span>Dabi snaps.</span>\n</p>\n<p>\n<span>He drops the phone and sobs into his hands, great, heaving ones that shake his whole body. Natsuo is immediately at his side, wrapping his arms around him and shushing him. He’s crying as well and it’s all so wrong. The Todorokis cry in silence for a long time before Hizashi speaks up.</span>\n</p>\n<p>\n<span>“We could kill him.”</span>\n</p>\n<p>\n<span>Aizawa’s head snaps up, even as Natsuo’s whirling around and Dabi’s hackles are rising.</span>\n</p>\n<p>\n<span>“Whoa, not like that!” Hizashi says, hands flailing. “I mean, look, Shouta and I are going to have to move anyway. If Dabi came here and attacked us and died in the ensuing fight…”</span>\n</p>\n<p>\n<span>Nobody moves for a long time. Nobody even breathes.</span>\n</p>\n<p>\n<span>“No,” Aizawa eventually says. “We can’t.”</span>\n</p>\n<p>\n<span>“Unless he promises,” Naomasa cuts in, rounding past him and coming to crouch in front of Dabi. “You come with us; you get a fake identity, we change your appearance. You leave the League, you jump when we say jump, you report when I say and you leave nothing out. <em>But</em>, you get your family back. And Endeavour will never know.”</span>\n</p>\n<p>\n<span>Dabi holds his gaze for the longest time. “On one condition.”</span>\n</p>\n<p> </p>\n<p>\n<span>***</span>\n</p>\n<p> </p>\n<p>\n<span>There’s a tape, somewhere in a landfill station on the edge of Tokyo. It once held footage of Hawks and the villain Dabi in a...compromising situation. It’s been miraculously wiped clean now. No one knows it exists. It’s been there nearly four months. </span>\n</p>\n<p>\n<span>Which is good, seeing as how Hawks has had a new boyfriend for the past five weeks. Shizuka Shinsei seems nice enough; he’s tall, has brown hair and bright grey eyes. If he has a quirk, he doesn’t use it. He’s met Endeavour but doesn’t care for him, though he’s made friends with both Todoroki Fuyumi and Natsuo. He’s even gone with the youngest Todoroki to visit his mother sometimes.</span>\n</p>\n<p>\n<span>It’s a strange world, it would seem.</span>\n</p>\n<p> </p>\n<p>\n<span>***</span>\n</p>\n<p><br>\n<br>\n</p>"
}