{
  "id": "1720415",
  "url": "https://archiveofourown.org/works/1720415?view_full_work=true",
  "author": [
    "Mynuet"
  ],
  "title": "Hale Construction",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Teen Wolf (TV)"
  ],
  "relationships": [
    "Derek Hale/Stiles Stilinski"
  ],
  "characters": [
    "Derek Hale",
    "Stiles Stilinski",
    "Sheriff Stilinski"
  ],
  "additional_tags": [
    "Stiles Takes Care Of Derek",
    "Derek Takes Care Of Stiles",
    "Awesome Sheriff Stilinski",
    "Fluff"
  ],
  "language": "English",
  "series": "",
  "published": "2014-05-31",
  "completed": null,
  "words": "8,342",
  "chapters": "1/1",
  "comments": "293",
  "kudos": "11,668",
  "bookmarks": "2,862",
  "hits": "112,406",
  "summary": "<p>Derek gets a business and a home. Stiles gets his own Batman. The sheriff gets hash browns. The Stilinski household is expanded without anyone quite talking about it.</p>",
  "notes": "",
  "text": "<p>\"So, no, seriously, wasn't your family rich?\" Stiles yawned around the question, staring up at the ceiling of his darkened bedroom. \"You should be able to crash at, like, the Ritz. Or at least the Beacon Hills version, which would probably be that hotel with all the conventions. Something much better than my room.\"</p>\n<p>Derek glanced over at him and shrugged as best he could while wrapped in a sleeping bag on the floor. \"I don't have any money.\" Not that that was the reason he was staying with Stiles, but neither of them were acknowledging that. Stiles felt safer when someone was on guard to make sure he didn't hurt anybody, and Derek was the one most consistently available; it also helped that Derek never bothered with telling Stiles that he was okay.</p>\n<p>\"That doesn't make any sense, dude. Was it all stuffed in the couch cushions of stately Hale manor?\" There's a brief silence, nowhere near long enough for Derek to answer, before Stiles was sitting up and looking anxious. \"I'm so sorry, that was-- That was really not cool, I know, I just sometimes think of things and, okay, you're basically Batman but that doesn't--\"</p>\n<p>\"It's okay,\" Derek said, pulling the sleeping bag higher. \"Just shut up and go to sleep.\"</p>\n<p>Stiles did lay back down, but it was only about thirty seconds before he muttered, \"Kate kinda did smile way too much.\"</p>\n<p>It was entirely down to the incredibly late hour, and possibly being too tired to think, that Derek murmured, \"She wore too much makeup, too.\"</p>\n<p>The silence was much longer this time, long enough that Derek had almost fallen asleep by the time Stiles murmured, \"You actually referenced the Joker. I am both terrified and aroused.\"</p>\n<p>\"You should be asleep,\" Derek grumbled, turning over and burying his face in his pillow. </p>\n<p>\"Sure, sure,\" Stiles said on another yawn. \"G'night, Bruce.\"</p>\n<p>Weeks went by and they didn't talk about money again, or about the fact that Stiles was having fewer nightmares but Derek was still there. They were in a holding pattern, Stiles and his dad and Derek, each of them reluctant to break the fragile peace of all of them existing under the same roof and, if not okay, at least starting to feel like it might be possible to get there. The phrase 'just bring your things over and stop pretending you're not always here' had been said, along with 'if you're still here after another month, we're going to talk about rent,' and that was about it.</p>\n<p>The lack of talking or acknowledgement went on until a tree branch came down on the roof of the Stilinski house and the homeowner's insurance wasn't enough to cover the cost of having someone come and fix it, no matter how many contractors Stiles called for an estimate. Two days of seeing a shitty blue tarp on the roof, along with a forecast of more rain, was enough for Derek to sigh and say, \"Come on.\"</p>\n<p>\"Huh? Come where? To do what?\" Stiles kept asking questions the entire time he was getting his keys and following Derek to the Jeep, following turn by turn directions because... Well, maybe Derek found the questions and speculations amusing. </p>\n<p>Right up until Stiles realized they'd come through the back parking lot of Home Depot, where a group of mostly illegal immigrants gathered every day in the hopes of being hired under the table, and said nervously, \"Dude, my dad's the sheriff. We can't hire anyone illegal - he's still got to get reelected.\"</p>\n<p>\"I'm doing the work,\" Derek said, looking at the sky instead of anywhere near Stiles or waiting laborers. \"And you shouldn't act like you're better than them just because they don't have papers.\"</p>\n<p>\"Hey, dude, that is <i>not</i> what was going on and if you don't know that, I'm... I thought you knew me at least a little better than that.\"</p>\n<p>He did, and the vague shame he felt at saying otherwise kept him quiet as they pulled up to the front entrance and through about half of the trip through the store before the silence from Stiles bothered him enough to say, \"That's how I made money, when Laura and I were on the run. Most people...\"</p>\n<p>\"I've read it can be dehumanizing,\" Stiles said, fiddling with a can of sealant foam. \"Señor Cass showed us this paper one of his students had written about the whole thing that, like, looked at all the aspects of it, including why anyone would do it.\"</p>\n<p>Derek took the can from him before he could cover them both in expanding orange foam. \"It's how I knew what to do, when we were running.\"</p>\n<p>\"You read th-- oh my God, you totally wrote that paper. Why was I stuck helping Isaac with his essays when he came back to school? He's the worst student ever, and... and that's why you never told anyone you were a term paper god, you sneaky bastard. You just counted on Scott deploying the puppy eyes to sucker me in, didn't you?\"</p>\n<p>Ducking his head down to hide his smile, Derek started walking again, letting Stiles follow with the cart. He'd never liked school very much, but Señor Cass had always been cool, and Derek had felt a kind of kinship when he had talked about his transition to the class so they'd understand why he was no longer Señora. It was weird to think that there were humans who also grew up having to hide who they really were, and the respect he'd had for the teacher had made him work extra hard in his class. </p>\n<p>Stiles kept on talking - which, really, should be the title of his autobiography if he ever wrote one - but he didn't seem to require that Derek contribute all that much, so it was okay. He responded when he felt like it, and it usually sent Stiles either into an in-depth exploration of what he'd said or out on a related tangent that made it clear he'd thought about Derek's response. It was almost nice, soothing in a way, which was what had lulled Derek into enough complacency that he hadn't noticed Stiles following him onto the roof until he was already off the ladder and picking up a hammer.</p>\n<p>\"No,\" Derek said firmly. \"Bad Stiles. No hammer.\"</p>\n<p>\"I should have gotten the nail gun,\" Stiles said sulkily, and several nightmares ran through Derek's mind at once. \"It's my roof, I should be doing something.\"</p>\n<p>Shaking his head, Derek said, \"Hand me things when I ask for them and try not to bleed.\"</p>\n<p>\"I can do that,\" Stiles said. \"I've been practicing the no bleeding thing. No injuries for the past thirteen days.\"</p>\n<p>Derek paused as he laid out the materials, thinking. \"Didn't I see you with toilet paper on your face since then?\"</p>\n<p>\"Hey, shaving nicks do not count as injuries,\" Stiles said. \"They just don't.\"</p>\n<p>\"You were still bleeding,\" Derek pointed out, laying out the steps in his mind and starting the process of turning a hole back into a part of the roof. \"We're going to have to just replace the whole thing within a year or two. It'll get too expensive to keep patching.\"</p>\n<p>The silence stretched out long enough that Derek noticed and looked up, eyebrows raised in question. Stiles cleared his throat and said, \"No, yeah, I'll let Dad know and start shifting the budget around for the money.\"</p>\n<p>Derek nodded and went back to getting his materials laid out before getting started. \"It still counts. The bleeding.\"</p>\n<p>\"Oh, like you would know, you haven't shaved since I met you.\" Derek grunted and it was enough of a response to get Stiles started again, going through the history of shaving and cultural attitudes towards facial hair in various societies and time periods, with the occasional detour into wondering whether facial hair patterns in wolf form had special significance.</p>\n<p>At one point, Stiles went quiet again and disappeared down the ladder only to come back with a backpack on. \"Needed both hands for the ladder,\" he said sheepishly, pulling out a water bottle and handing it over.</p>\n<p>\"Smart,\" Derek said, downing about half of it before pouring some over his head to cool off. </p>\n<p>\"That's me, the smart one,\" Stiles said. \"At least I'm not the Ringo.\"</p>\n<p>Derek finished his drink before saying, \"Well, it's not like you could be the quiet one.\"</p>\n<p>\"You've got the eyebrows to be George Harrison,\" Stiles said around a bite of his sandwich. \"But, seriously, how come you ever had to sell yourself behind hardware stores if you were super rich?\"</p>\n<p>Less than a second later, Stiles turned bright red and said, \"Selling your services! I mean, uh, crap, I wasn't saying you were whoring yourself out, not that I think that sex workers are beneath me, basic dignity of the human condition and--\"</p>\n<p>\"I've never had sex for money,\" Derek said. \"And it's not like we could use our credit cards when we were running for our lives. We needed cash.\"</p>\n<p>\"Oh.\" Stiles thought about it for a minute and then said, \"So who paid for your uncle's hospital bills?\"</p>\n<p>Stretching uncomfortably, Derek said, \"Uncle Jerry. We'd send him some money when we could, but I haven't been able to figure out yet how to repay him for it.\"</p>\n<p>\"You have another uncle? Is he...\" Stiles scrunched his face up, exposing his teeth, and swiped a hand through the air. Derek just waited, and Stiles burst out with, \"A werewolf! Is your mysterious, previously unheard of uncle another werewolf?\"</p>\n<p>\"No. He's not even really related,\" Derek said. \"He was my mom's friend from when she was a kid, and he was at the house every Friday to talk about the finances with her, so he always stayed for dinner.\"</p>\n<p>Slapping his shoulder, Stiles said, \"So, he's got your money. Just--\"</p>\n<p>\"It's complicated,\" Derek said. \"Things got tied up legally and it's still all tied up. He's been working on it.\"</p>\n<p>\"Probate's a bitch. My mom's estate took a while to settle because some weird cousin from Poland kept filing briefs to demand random things he insisted that she had to have had.\" Stiles took another bite from his sandwich and said, \"Like we'd even <i>heard</i> of samovars.\"</p>\n<p>Derek nodded, deliberately not thinking of the antique silver one that had been in his mother's study. \"I like working with my hands. It's good.\"</p>\n<p>\"You've got good hands.\" Stiles sounded so distracted that Derek didn't think he had any idea what he'd just said, let alone meant anything by it. Still, he looked at his own hands before shrugging it off and going back to work. </p>\n<p>He didn't think much about it when Stiles decamped again, although the day dragged without company. The Jeep left and came back, and he could hear the murmur of Stiles on the phone a few times, but he was too busy to really listen closely. That was probably where he went wrong, since by the time he wrapped up for the day, pleasantly exhausted and looking forward to dinner, there was a sign in the front yard that read 'Hale Construction' and had an unfamiliar number printed just below it.</p>\n<p>\"Isn't it great?\" Stiles was beaming as he handed Derek several pieces of paper. \"A few of the neighbors had repairs they needed done, and I made appointments for you to give them estimates. Since the storm there's been a backup, and you can't get a much better reference in this town than the sheriff.\"</p>\n<p>Pinching the bridge of his nose, Derek said, \"Is this because I wouldn't pay for your food yesterday?\"</p>\n<p>\"No, but that's a good example of why you need this.\" Holding up the slips of paper, Stiles said, \"Come on, it'll be good for you. Lots of work with your hands, you can get some money in your pocket, and I get some alone time. It's win-win!\"</p>\n<p>\"You're doing all the talking,\" Derek said, too tired to fight a battle he knew he would lose. Besides, he really could use the money. \"And the math. I'll tell you the materials I'll need, you figure out how much they cost and how much to charge.\"</p>\n<p>Stiles pumped a fist in the air, wiggling in a weird sort of touchdown dance. \"Ha! My ideas are the best ideas.\"</p>\n<p>\"Any brilliant ideas about dinner?\" Derek asked as he went into the house to have a quick shower before the sheriff came home. The man had been incredibly accepting of Derek's presence, but Derek still tried to stay out of sight as much as possible, not wanting to remind the sheriff that he was there to guard his son, even if it was mostly from his own anxieties.</p>\n<p>\"Pizza,\" Stiles yelled out, as if Derek wouldn't have heard him anyway even though they were now in different rooms. \"Meat lovers with extra cheese.\"</p>\n<p>\"I thought we were eating healthy,\" Derek called as he dumped out his pockets into the drawer under the sink that had been designated as his. \"Isn't that why we all had to go to a salad bar yesterday?\"</p>\n<p>There was a pause, and finally Stiles came back with, \"It evens out! We'll have salad again tomorrow!\"</p>\n<p>Derek shook his head and wondered once again whether it was worth it to try to make sense of Stiles. </p>\n<p>***</p>\n<p>It was easy enough to fall into a routine. Too easy, because he didn't really notice that all his clothes had appeared in the spare room's closet. He did notice when his bed from the loft appeared in the spare room, but after a long day and a hot shower, he just about had enough brainpower to be grateful he didn't have to get dressed before he crawled into it. The sheets smelled like the laundry detergent that Stiles used for all their clothes.</p>\n<p>There wasn't time to talk in the morning, because there was rain in the forecast for the afternoon and the Hendersons would probably prefer their roof be finished by then. That evening there was a pileup on the freeway that kept the sheriff out until well into the night, and somehow or other he was fully moved in to the Stilinski house without anyone having talked to him about it. It seemed easiest to just keep on not mentioning it, especially since he didn't really have anywhere else to go.</p>\n<p>He worked, he came home and showered, he hung out with one or both Stilinskis, he slept, and then he did it again. He paid for dinner most nights from the cash in his pockets, always plentiful since that's how most of his customers paid. If it ever did run short, he just pulled some out of his bathroom drawer, or the one in his nightstand that he started using when the one in the bathroom filled up. It would probably have been better to actually do something with it - count it if nothing else - but it was too easy to just forget about it and just relax into the satisfaction of having worked hard enough to be peacefully tired.</p>\n<p>It was distinctly possible he never would've gotten around to dealing with the money, except one day he was having a mild argument with the sheriff about who should pay for the materials for some repairs the house needed. The sheriff had followed him upstairs to continue the argument and, since he was there, Derek opened the top drawer of his dresser to pull out some cash in the hopes of proving his point. \"See? I can pay, easily. It's literally the least you can let me do, since you won't let me pay rent.\"</p>\n<p>Scratching the back of his head, John said, \"I guess this explains why Mrs. Atkins asked if you had lost her check.\"</p>\n<p>\"Does she need it back?\" Derek started digging through the pile, pulling out the checks he could find amidst the cash and invoices and receipts. </p>\n<p>\"Son...\" Derek flinched at the hand that landed on his shoulder, held still by the dueling urges to lean into it and run away. John held the clasp for just a brief moment, letting go with a brief shake. \"Get a bank account. And figure out how to pay taxes, would you? Whittemore's making noises again about getting someone to run against me, and if a member of my household is painted as a tax fraud, it won't help.\"</p>\n<p>\"I'm a member of your household?\" Derek hadn't thought about it that way - might have prevented himself from thinking that on occasion - and it made him feel warm inside and guilty at the same time.</p>\n<p>Rolling his eyes, John said, \"You have your own room. I think that's kind of obvious.\"</p>\n<p>\"Oh.\" Holding out some cash, Derek said, \"Does that mean you'll let me pay rent?\"</p>\n<p>\"I'm not your landlord, kid.\" John clapped him on the shoulder again, giving him another brief shake. As he left, he said over his shoulder, \"You can pay for your own stuff, and maybe start a college fund so you can go back. The house is paid for anyway.\"</p>\n<p>Derek nodded, his hands shaking as he sank down to sit on the bed. He had no idea why; it was completely ridiculous to feel weak after a perfectly normal conversation. </p>\n<p>***</p>\n<p>Getting a bank account was as simple as walking into a branch and handing them the stack of checks to deposit, although it took a bit of wrangling to get Stiles to go in and get added to the account so he'd have access, too. He'd finally gone, but since he'd mentioned being overloaded with school and lacrosse and college applications in the course of avoiding it, Derek was determined to figure out his taxes on his own. It had taken more than a week of working late into the night, but he'd finally figured out that he needed to file taxes for his business quarterly, and he'd felt a tremendous sense of satisfaction as he sent off the completed forms along with a check for the exact amount (rounded up to the nearest dollar). </p>\n<p>The rage he felt when he got a notice back that he owed at least ten times as much as he'd made was incandescent. \"What do you mean, I failed to report income? I reported every single penny!\"</p>\n<p>\"Sir, I really can't go into any further detail without confirming your identity,\" the woman on the other end of the line said. </p>\n<p>Trying to rein in his temper, he took a deep breath and then let it out. \"I gave you my name and my Social Security number, what else do you need?\"</p>\n<p>\"The amount of your Adjusted Gross Income from last year,\" she said, sounding a bit wary. \"It would be line 37 on form 1040.\"</p>\n<p>\"I didn't file taxes last year,\" Derek said through his teeth. \"I've never filed taxes. I can't give you any income out for previous years, because I didn't have any.\"</p>\n<p>Snippily, she said, \"Derek Hale did.\"</p>\n<p>The abrupt lack of sound let him know she'd hung up on him, and he wound up to throw the phone into the wall before he felt hands around his arm and stopped. \"Hey, big guy. Hope that wasn't a customer.\"</p>\n<p>\"IRS.\" Derek jammed the phone in his pocket as soon as Stiles let go, then scrubbed his hands over his face. </p>\n<p>\"Ohhh, yeah, we should totally file taxes,\" Stiles said. \"Want to get started? I can pull up the forms in a sec.\"</p>\n<p>Running a hand through his hair, Derek said, \"I already filed, they're just saying I owe them an insane amount of money and demanding I tell them what it says on taxes from last year that I never filed!\"</p>\n<p>\"Oh, you... Huh. Guess you didn't need me for that, either.\" Stiles dredged up a smile, but the hurt beneath it was obvious. \"I guess I'll just... get out of your way.\"</p>\n<p>\"You've probably got a million applications to deal with,\" Derek said with a nod, trying to figure out what had just happened to get Stiles looking that way.</p>\n<p>Stiles shook his head. \"All done. Once I figured out how to work around the whole lycanthropy issue, I had plenty of material for personal statements.\"</p>\n<p>It was incredibly tempting. He'd pretty much gotten the hang of invoices and estimates, especially since Stiles had set up a spreadsheet template which let him just put in the materials needed and hours of labor and it spit out both his cost and the amount to charge. \"I don't want to interfere with you catching up on school.\"</p>\n<p>\"Dude. The home and hospital lady brought over all my work for the rest of the semester. I'm actually a couple of months ahead.\" Stiles paused, the cocky smile fading as he looked away. \"But, you know, if it's private or whatever, I mean, it's not like you need to make excuses, I can totally respect that.\"</p>\n<p>\"We have a joint checking account and you do my laundry,\" Derek said, rolling his eyes. \"Why would I care if you know about my taxes?\"</p>\n<p>Ducking his head, Stiles said, \"I don't know. You didn't tell me about them before.\"</p>\n<p>\"Because you're busy,\" Derek said in exasperation. \"You didn't even have time to go to the bank, why would I dump this all on you?\"</p>\n<p>Stiles froze for a moment, then said, \"Um, yeah. I was busy. And now I'm not, so maybe you could stop leaving me out so much?\"</p>\n<p>With a sigh, Derek shoved the notice he'd gotten into Stiles's hands. \"Have at it. I've got work to get to.\"</p>\n<p>\"Of course you do.\" Stiles beamed, which seemed like a weird reaction to being handed paperwork. \"Trust me, I'll take care of all this.\"</p>\n<p>Derek looked at him for just a second too long, then shook his head and grabbed his toolbelt. Trying to understand Stiles was just not something he could manage without a lot more time to devote to the subject.</p>\n<p>By the time he got home that night, all he wanted was to crawl into bed, but he was filthy. He stumbled up the stairs and smelled chamomile and lavender, which meant Stiles was in the bathtub and he'd have to wait for the shower. Maybe he really should take John up on the offer of converting the unfinished basement into an apartment; if nothing else, it would give him his own bathroom instead of having to share with Stiles. Knocking on the door, he said, \"You going to be long?\"</p>\n<p>The door burst open immediately with a waft of steam, but Stiles was fully dressed. \"Dude, is my timing perfect or what? Your bath is ready.\"</p>\n<p>Looking at him sidelong, Derek said, \"I don't take baths.\"</p>\n<p>\"You do today.\" Edging out of the bathroom around him, Stiles added, \"Get under the bubbles so I can bring you some food without it being weird.\"</p>\n<p>\"How is any of this not weird?\" He was talking to himself before the sentence was over, and Derek finally just shrugged and stripped his clothes off, using a washcloth at the sink to get the worst of the dirt and sweat off before he lowered himself into the water. It wasn't until he was sitting in the tub that it occurred to him he could've just drained the tub and had a shower like he'd originally intended, but by then Stiles was tapping at the door and it just wasn't worth it. </p>\n<p>Stiles came in when he called, carrying a tray and keeping his eyes on the ceiling. \"It's not much, but you're always super tired when you get home after a demo, so.\"</p>\n<p>Reaching for the plate, Derek said, \"Do I want to know what all this is about?\"</p>\n<p>Stiles flicked his eyes down for a moment and then back up at the ceiling. \"Not yet. I need to check a few more things first, be really sure.\"</p>\n<p>\"Okay.\" Derek looked at the plate, cold cuts and cheese on multi-grain crackers, with berries arranged around them. \"Just to be clear - no one's dying, right?\"</p>\n<p>\"The fact that that's not even a joke is a sad commentary on our lives, dude.\" Stiles filched one of the slices of strawberry from the plate and then licked the juice off his finger and thumb. Derek averted his eyes. \"But, no, no death. Although I may have to administer a beatdown if what I think is true is actually, you know, true.\"</p>\n<p>Derek let his eyes roam over Stiles. While he'd filled out, his shoulders broad and muscle visible on his arms, he'd never be what anyone would describe as a bruiser. Stiles was flushing and meeting his eyes by the time he looked back up at his face. \"Shut up, I could totally take you. In a fight, I mean. And now I'm leaving.\"</p>\n<p>It was hard not to laugh as the door slammed behind him, but Derek made the effort. For all that he tried desperately not to show it, Stiles got hurt deeply by the slightest hint that people doubted him. And, really, if Stiles decided someone needed to be hurt, he'd find a way to do it, even if it wouldn't be just by using his fists. Stiles actively targeting someone would be terrifying, because he'd find a way to make it hurt more and for far longer than just physical pain.</p>\n<p>Which was another thing he would never tell Stiles, because he would get quiet and think it was because of being possessed, and Derek wasn't good enough with his words to explain that Stiles had always been that way, that it was something good. Stiles always knew what to do, always had a plan, and the fact that he'd been possessed by a nogitsune and had come out still able to laugh and make jokes… </p>\n<p>Even in his own mind he couldn't get his thoughts organized enough to explain Stiles. It was better to just avoid talking about things that would hurt him, so he wouldn't have to try to think about it.</p>\n<p>***</p>\n<p>It took three days of Stiles being conspicuously nice to break Derek. \"No, I don't want pancakes, or bacon, or hash browns,\" he said, pushing Stiles away from the stove.</p>\n<p>\"Speak for yourself,\" John said, casting a longing glance at the frying pan. \"He hasn't allowed hash browns in this house for years.\"</p>\n<p>\"They're empty carbs swimming in fat,\" Stiles said reprovingly. \"Werewolves might not have to worry about nutrition, but we puny humans need to just say no to diabetes.\"</p>\n<p>Crossing his arms in front of his chest, Derek said, \"What's wrong?\"</p>\n<p>Stiles looked at him guiltily and turned back to the stove. \"Nothing's wrong! Can't a guy just make his friend some breakfast?\"</p>\n<p>\"Not when a week ago you whined that you'd put a bagel to toast for yourself and it was cruel for me to steal the fruits of your labor,\" Derek said. \"And not when you attempted to make dinner last night, and packed me a lunch yesterday, and bought me a new pair of insoles and a portable fan.\"</p>\n<p>John's eyebrows rose to his hairline. \"He's either about to declare eternal love or tell you you've been cursed. Either way, I'm going to the diner to get some hash browns while you two figure it out.\"</p>\n<p>Choking on his coffee, Derek struggled to come up with an answer. The best he could do was croak, \"Not like that.\"</p>\n<p>\"Just tell me when it's safe to come home,\" John said as he shrugged on his jacket and left. From outside, Derek could hear, \"And keep your clothes on, both of you!\" </p>\n<p>Stiles was still at the stove, his mouth open and his face crimson. Several tense seconds ticked by, and Derek's heart started racing as he thought about what John had said and how Stiles was reacting. Was that it? Was Stiles really… interested? </p>\n<p>Was he?</p>\n<p>Derek felt his own cheeks heating up as he opened his mouth to say something and couldn't think of a single word. He wasn't entirely sure he knew how to speak English at the moment, let alone any of the other languages he'd picked up over the years. \"Stiles…\"</p>\n<p>\"Your Uncle Jerry's been stealing from you for years,\" Stiles blurted out. \"Probate was over in a month. He's been spending your money ever since.\"</p>\n<p>He kept talking, laying out details of what he'd found out, but Derek was frozen in place. His thoughts were racing between the pain of yet another betrayal and sneering at himself for what he'd thought Stiles might say, and realizing he'd hoped for something he shouldn't. </p>\n<p>\"Derek, I'm sorry,\" Stiles said. \"I'm so, so sorry, you don't even know. I didn't want to tell you until I knew for sure, and it's... I'm sorry.\"</p>\n<p>\"No,\" Derek said, then cleared his throat to clear up the hoarseness. \"No, it's better to know.\"</p>\n<p>Stiles sat down heavily, clasping his hands so tightly that his fingers were turning white. \"I got all the information legitimately, but that means that he's going to be prosecuted. Dave's been awesome about keeping a lid on it, but being lead on a case like this would go a long way towards getting him into a sheriff position in another district.\"</p>\n<p>\"That's… that's fine,\" Derek said. \"Your dad has an elected position, it wouldn't be good if you got arrested for beating up an accountant.\"</p>\n<p>\"Okay, now I know you're freaked out,\" Stiles said. \"That was an actual joke. An in-joke, even. Do you have a fever?\"</p>\n<p>Shaking his head, Derek said, \"You're nowhere near as funny as you think you are.\"</p>\n<p>\"Yeah, well, what can I tell you,\" Stiles said. \"Sarcasm is my coping mechanism of choice.\"</p>\n<p>\"I'd noticed.\" For lack of anything better to do, Derek went to the stove and turned the heat back on under the frying pan. \"Dave, he's that new deputy, the one you said has pretty eyes?\"</p>\n<p>Stiles handed him the package of bacon and hopped up to sit on the counter. \"No, Parrish is still too new for me to trust him with something big. Dave used to watch me back when he was a rookie - it's his kid I was babysitting last week.\"</p>\n<p>\"I still can't believe people leave you with their kids,\" Derek said as he started cooking. \"And that you've never forgotten one at the store or anything.\"</p>\n<p>\"Hey, I'll have you know, I'm Red Cross certified and everything! I've been babysitting since I was twelve and I've always had repeat customers, thank you very much.\" </p>\n<p>Nodding, Derek said, \"And how many of those work for your dad?\"</p>\n<p>\"That's not the point,\" Stiles said. \"Besides, it's returning the favor for the same deputies that used to babysit me, at least the ones who… who've had kids.\"</p>\n<p>Glossing over the reminder of how many people Stiles had lost, Derek said, \"So are you going to be a nanny or an accountant when you're working your way through college?\"</p>\n<p>\"Stripper.\" Luckily, Stiles was too busy laughing to notice Derek burned himself when he sent the pan skidding in shock. \"There's apparently a market for skinny pale dudes. I've even got a name picked out - Twinktacular.\"</p>\n<p>\"Your shoulders are too broad to really be a twink,\" Derek said, hiding his burned arm as it healed and he focused on the bacon like it was going to save his life. \"They're always short, too.\"</p>\n<p>Stiles took long enough to respond that Derek looked up, only to see Stiles staring at him. Shrugging, Derek said, \"What? I can't know things?\"</p>\n<p>\"I, um, I need to call Dave,\" Stiles said, jumping down and scurrying out of the room. \"You, uh, just, um, don't burn the bacon, okay?\"</p>\n<p>\"Not all of us like our food still oinking,\" Derek said to his back as Stiles fled the room. He wondered if it was because of what they'd been talking about, but Stiles had been the one to bring it up.</p>\n<p>Grimacing as his inner Stiles-voice pointed out that unintended pun, Derek firmly told himself to stop thinking things like that, forever. And possibly to figure out when he'd developed an inner Stiles-voice and whether he could get rid of it.</p>\n<p>***</p>\n<p>Jerry's arrest and trial happened while Derek was busy working on people's houses. John had sat him down to explain everything and then gotten exasperated when he found out that it had all been down to Stiles investigating, but he couldn't exactly cover up how proud he was. Derek was proud, too, although he was even more happy to be able to escape from having the full conversation about it. </p>\n<p>A window replaced, another roof, installing a water heater, those were the things he paid attention to. Arraignment, plea bargains, additional charges of corruption, those were something far away and unimportant. Stiles kept trying to feed him, although he didn't run any more baths or talk about anything even remotely sexual. Things were normal. He could handle normal.</p>\n<p>And then things were abruptly abnormal, because he actually looked at one of the papers Stiles had him sign and it had a number so large that Derek wasn't sure if maybe one of the commas was supposed to be a decimal point. \"Is that number right?\"</p>\n<p>\"Uh, yeah,\" Stiles said. \"Remember how you're Batman? Turns out your parents owned half of Beacon Hills. That train station? Abandoned because your dad was the main funder of the light rail initiative. That mall that's half built outside of town? One of Peter's pet projects. This is your Gotham, dude.\"</p>\n<p>Derek looked back down at the paper and blinked. \"I knew we were comfortable, but my mom and dad always told us we had to work for what we got. We had to do chores to get our allowance!\"</p>\n<p>\"Dude, your allowance was a hundred bucks a week. No amount of dishes and taking out the garbage earns that,\" Stiles said. \"But it makes you even more badass for figuring out how to live on the cash you could make as a day laborer.\"</p>\n<p>\"Laura did that,\" he said, flipping through the papers. \"She was the one who handled the money, always. I just gave it to her. Stiles, what the fuck am I going to do with this much money?\"</p>\n<p>Tapping a pen against the signature line, Stiles said, \"Don't even think about stuffing it all in a drawer, our house would explode.\"</p>\n<p>The joke helped settle Derek down a little, and he smiled. \"I could build a really big drawer. Or buy a bigger house.\"</p>\n<p>\"Oh.\" Stiles looked up and away, then dredged up a smile. \"Yeah, I can't wait to see what you do for a bachelor pad now that your options aren't limited to abandoned or condemned.\"</p>\n<p>It felt like the bottom dropped out of Derek's stomach. \"Are you kicking me out?\" </p>\n<p>\"What? No! Dude, my dad would kill me,\" Stiles said. \"You are totally his favorite.\"</p>\n<p>It wasn't enough to make him completely calm, but at least it helped a little. \"Your father would burn down the entire world to keep you safe and happy.\"</p>\n<p>\"Yeah,\" Stiles said, looking down at his hands. Then, so softly Derek almost didn't hear it, he mumbled, \"He shouldn't have to.\"</p>\n<p>Reassuring Stiles never worked, but sometimes distraction did. \"I'm surprised you're not campaigning for a new gaming system.\"</p>\n<p>\"Please, I think much bigger than that,\" Stiles said, not completely back to normal but at least recovering. \"I'm working on the powerpoint to explain why you should buy me a college education.\"</p>\n<p>He could do that. The thought of it made him sit back and look at the figures again. Hell, he could buy a college. \"Yeah. For Scott and Isaac, too.\"</p>\n<p>\"Let me be the one that tells Scott,\" Stiles said. \"Otherwise he'll get weird about it.\"</p>\n<p>Shrugging, Derek said, \"I'll just tell his mom.\"</p>\n<p>\"Ooooh, sneaky. Didn't know you had it in you.\" Stiles started flipping pages again, pausing only for Derek to sign before flipping again. \"Cora said hi and that you need to call her, by the way.\"</p>\n<p>\"I just talked to her last week,\" Derek said, signing his name again.</p>\n<p>With a snort, Stiles said, \"Try a month ago, hotshot. It's okay, though. She understands about your whole avoiding thing.\"</p>\n<p>\"Is she… With all this money?\" Derek didn't really know what he was asking.</p>\n<p>Luckily, Stiles did. \"It's half hers, so she's already bought the estancia where your Uncle Julio's family works. Worked. She pretty much just told me to stick the rest of it in a bank or go to Vegas with it.\"</p>\n<p>\"You can't go to Vegas, you're not eighteen yet.\" Derek's signature was starting to lose all resemblance to actual letters.</p>\n<p>\"Dude, almost! We should totally go to Vegas for my birthday, it'd be awesome.\" </p>\n<p>Leaning back, Derek said, \"What money are you going to gamble?\"</p>\n<p>\"Well, it's not like I'm going to need my college fund, sooo…\" He laughed and ducked as Derek swatted the back of his head. \"Okay, fine, just some of my babysitting money. The college fund can go into the stock market; I got a good return on the ones I picked for Finstock's class.\"</p>\n<p>\"Good,\" Derek said. \"You can figure out what to do with all this.\" </p>\n<p>Stiles stared at him and at the papers being shoved back across the table at him. \"What.\"</p>\n<p>Grinning, Derek stretched out and said, \"You're my financial manager. Manage.\"</p>\n<p>\"I said that about your business! This is, like, to the tenth power!\"</p>\n<p>\"It's all a matter of scale,\" Derek said piously.</p>\n<p>Stiles's eyes narrowed. \"This is about how you and Dad were trying to talk me out of being a cop, isn't it?\"</p>\n<p>\"No, although forensic accountants are still in law enforcement, so it wouldn't--\"</p>\n<p>\"It wouldn't be even a little bit what I want to do with my life,\" Stiles said sharply. \"You and Dad are just going to have to deal with the fact that I'm going to be a cop, whether it's here or whether I move somewhere without anyone trying to nag me out of it.\"</p>\n<p>It wasn't a new argument, and Derek said, \"Just a hobby, then. My mom and dad both had regular jobs, but she still kept up with what Un-- with the finances.\"</p>\n<p>\"I'll think about it,\" Stiles said, gathering the papers and tapping them against the table to straighten them. \"In the meantime, think about whether there's anything you want to do now that you basically have infinite money.\"</p>\n<p>Derek shrugged helplessly. He hadn't even been spending the money he was making from his construction business; the thought of having considerably more was just not making sense in his head.</p>\n<p>Clapping him on the shoulder as he stood, Stiles said, \"Think about it. I'm going to go fax these to the lawyer and then hang with Scott for a while.\"</p>\n<p>***</p>\n<p>He did think about it, off and on. Most of his work didn't require his full attention, and it was peaceful enough to contemplate what he might want to do. Laura would've gone shopping, and his mom would've told him to invest in the community. His dad would've shrugged and told him to do whatever made him happy, and he didn't know or care to think about what Peter would say. Stiles had very carefully not mentioned it, but Derek had gathered that Peter had simply claimed his money from Jerry and not bothered about telling him or Cora anything about the rest.</p>\n<p>It wasn't until he was driving by Home Depot that it occurred to him there was something he could do, and he called his client for the day to cancel before turning the truck he'd bought back towards home. Scott's dirtbike was in the driveway alongside the Jeep and Derek didn't think he could stand dealing with the bitchface Scott had been wearing since Derek had talked to Melissa and arranged to pay off her house along with the college thing. Even calling it reparations for Peter biting him without permission hadn't done anything to fix the sourness.</p>\n<p>His room was harder to sneak into than Stiles's, but after leaving the truck parked a street away, he still managed. He was contemplating sneaking downstairs for a snack when he heard Stiles laugh and froze. Genuine happiness from Stiles was still rare enough that he'd rather use the electric drill on his own teeth than interfere with anything that could make him so carefree.</p>\n<p>If he also sat down on his bed to eavesdrop, well, it wasn't as if he could help hearing what they were saying, and it was Scott's fault if he couldn't tell Derek was there.</p>\n<p>Instead of listening for potential threats, Scott was whining. \"Dude! I was serious!\"</p>\n<p>\"Yeah, I know, that's what makes it funny,\" Stiles said. \"Monday you were on Skype with Isaac. Tuesday you were at work, Wednesday we hung out, Thursday work, Friday with Kira, Saturday work and then Kira, Sunday with your mom, Monday with Isaac again, and now it's Tuesday and you're supposed to go to work later.\"</p>\n<p>\"You used to go hang out there with me, though!\" Seriously? Just how codependent were these two?</p>\n<p>He could picture Stiles rolling his eyes. \"I used to ride my bike to school and share juice boxes, too.\"</p>\n<p>\"Just because Derek--\"</p>\n<p>\"Uh, no.\" Stiles sounded a little pissed, although Derek would've liked to hear the end of the sentence. \"My not going to your work has nothing to do with Derek and everything to do with your boss creeping me out.\"</p>\n<p>Huh. He hadn't realized anyone else felt that way about Deaton. Just one more thing we have in common, said his inner Stiles-voice.</p>\n<p>\"I'm not saying you can't like him,\" the real Stiles was saying. \"Just that, you know, he creeps me out. It's a feeling I'm entitled to have, and anyway the cats make me sneeze.\"</p>\n<p>\"You just never spend any time with me any more, you're always with Derek.\" Seriously, he sounded like Cora had… when she was three.</p>\n<p>Thoughtfully, Stiles said, \"Okay, you're right, we should spend more time together. How about Friday we go play laser tag?\"</p>\n<p>\"That's great, Kira loves laser tag!\"</p>\n<p>\"Yeah, I'm pretty sure Derek likes it too, it'll be awesome.\" After a moment Stiles said, \"See my point yet? How about Monday, then? Derek will be watching football with my dad, so he wouldn't be around.\"</p>\n<p>\"You know that's the only time Isaac has off from his training.\" Scott's sulkiness was coming through loud and clear, and Derek had to stifle a laugh. The urge was wiped clean away when Scott continued, \"It's just, you're supposed to be my brother, not Derek's!\"</p>\n<p>Stiles sounded exasperated as he said, \"Dude. Derek is not even remotely my brother.\"</p>\n<p>He wasn't quite sure why that made him feel better while also making his stomach churn, but Scott was talking again. \"He lives in your house, you always hang out with him, and your dad's practically adopted him! It's just like with me and Isaac.\"</p>\n<p>\"Okay, first of all, your little jealous thing? Yeah, think about what you just said and ponder that, just for like two seconds.\" Stiles barely gave him that long, and Derek heard soft footfalls that let him know Stiles was pacing now, probably waving his arms in the air as he made his points. \"Secondly, Isaac totally wants to bone you. Which, actually, makes the relationship an even better parallel, since I want to have so much sex with Derek, and he has no clue whatsoever. He'd probably go with your brother theory.\"</p>\n<p>Not even a little bit. He'd had a brother; what he felt for Stiles was nothing like it.</p>\n<p>\"Isaac doesn't--\" Scott seemed to be having trouble processing. \"But your dad--\"</p>\n<p>The squeak of the springs let him know that Stiles had flopped onto the bed, facedown judging by the way his voice was muffled. \"We already talked about it. He said not to pressure Derek, and to make sure that if I went for it that Derek understood he's still family either way.\"</p>\n<p>\"Ew, dude, that's--\"</p>\n<p>\"He meant that Derek's still welcome even if he's not his son-in-law.\" Derek couldn't help but feel warm at the realization that his welcome had to be completely genuine if the Stilinskis had decided he was family while he wasn't there to hear. \"It might not just be the two of us anymore, but you're still my best friend, dumbass.\"</p>\n<p>The sounds of a brief scuffle ended in Scott yelping that he was going to be late and tearing through the house. Derek waited until the noise had died down before he knocked on Stiles's bedroom door, smiling at the shriek and thump as Stiles fell off his computer chair.</p>\n<p>\"Was that an invitation to come in?\"</p>\n<p>Stiles flung the door open, his face red. \"When did you get home?\"</p>\n<p>\"I thought about some things I want to do,\" Derek said, brushing past Stiles to sit on the edge of the bed. \"I'd need your help, though.\"</p>\n<p>\"Yeah, okay, lay it on me,\" Stiles said, flexing his hands together until his knuckles cracked. \"Should I take notes?\"</p>\n<p>Shrugging, Derek said, \"If you want to.\"</p>\n<p>With a nod, Stiles flipped through one of his notebooks to find a blank page, then got a pen from the drawer and looked at him expectantly. \"What's first?\"</p>\n<p>\"I want to set up Hale Construction so that I can hire the day laborers legally,\" Derek said. \"Help them with citizenship or whatever they need so they don't have to work all day for the cost of dinner at Applebee's.\"</p>\n<p>\"You…\" Stiles swallowed hard, but nodded and started writing instead of saying anything else.</p>\n<p>Derek watched him scribbling and said, \"Señor Cass said his transition was hard, so maybe something to help people like him, especially teenagers.\"</p>\n<p>\"Transgender youth, got it,\" Stiles said. \"I'll do some research and figure out where to throw your money most effectively.\"</p>\n<p>Derek looked at his hands and said, \"Fund some research for epilepsy, maybe, in Erica's name. And something to help find missing children in Boyd's.\"</p>\n<p>There was silence from Stiles, and when Derek looked up it was to see him scrubbing roughly at his eyes with the back of his hand. It gave Derek the courage to keep going. \"Families that have been hurt by hunters. I don't know how we could reach them, but we weren't the only ones.\"</p>\n<p>\"I have some contacts,\" Stiles said hoarsely. \"We can make it happen, I know we can.\"</p>\n<p>Taking a deep breath, Derek said, \"The last one might be kind of hard.\"</p>\n<p>\"Dude, we're in this together. We'll figure it out,\" Stiles said, leaning forward and looking at him intently.</p>\n<p>\"I want to go out on a date with you,\" Derek said. \"I want to take you out to dinner and maybe kiss you goodnight, and I want to keep you even if you don't like it.\"</p>\n<p>Wide-eyed, Stiles said, \"Come again?\"</p>\n<p>\"You're too important, I can't lose you,\" Derek said, looking at Stiles steadily. \"And I don't know what I want, except that I keep thinking about your lips and I can hear you inside my head, and I just don't know if I can be without you anymore.\"</p>\n<p>Stiles shook his head, making Derek's heart plummet, and then held up his hands. \"Help me count. Derek, help me count.\"</p>\n<p>Jesus, he'd scared Stiles into a panic attack. Quickly, Derek pulled him into his lap and started rocking him back and forth, holding out his own hands and counting steadily from one to ten. \"It's okay, Stiles. It's okay. It's not a nightmare, I promise. I'm sorry, I'm so sorry, just breathe.\"</p>\n<p>\"Fuckin' A,\" Stiles gasped, his control creeping back. \"Dream. Best dream.\"</p>\n<p>\"Real,\" Derek said firmly.</p>\n<p>That startled a small laugh and Stiles said, \"Okay, Katniss. If you say so.\"</p>\n<p>\"Why am I the girl here?\" </p>\n<p>\"Because I can't shoot a bow, you sexist.\" Stiles's breathing was almost back to normal, his color coming back. </p>\n<p>Keeping his arms around Stiles, Derek said, \"You can't bake, either.\"</p>\n<p>\"Shut up, my cookies are amazing.\" Stiles prevented a response by bringing his lips to gently meet Derek's.</p>\n<p>Even soft and almost chaste, the kiss made Derek feel as if he'd been in the sun too long, his skin so sensitive that the brush of Stiles's breath was enough to make him shiver. Stiles pulled back to look at him, his eyes shining, and Derek kissed him again, feeling shy and clumsy and overwhelmed.</p>\n<p>His eyes fluttered open when Stiles touched his cheek, although he hadn't really been aware of closing them. \"You okay?\" It was a whisper, as gentle as his touch, and it made Derek's heart thump to hear it.</p>\n<p>\"Better than okay,\" he whispered back, reaching up to cup a hand around Stiles's cheek. \"I'm with you, and you're amazing.\"</p>\n<p>\"You're a sap,\" Stiles said, but then he closed his eyes and leaned into Derek's touch. \"Such a sap. I don't know what to do with that.\"</p>\n<p>Brushing his lips over the shell of Stiles's ear, Derek murmured, \"Your cookies are just okay.\"</p>\n<p>The shiver that ran through Stiles was pretty gratifying, as was the way he practically moaned, \"You asshole.\"</p>\n<p>\"You like it.\" Derek kissed Stiles on the chin, on his nose, along his cheekbones and jawline, and maybe there really was some magic when he finally indulged himself by licking into his mouth and kissing him more deeply. \"You like me.\"</p>\n<p>\"I do, I like you so much,\" Stiles groaned as Derek kissed his neck. \"Oh, God, but you know it's not for your money, right?\"</p>\n<p>Huffing out a laugh, Derek said, \"It's because I'm Batman.\"</p>\n<p>Stiles reared back and tackled him onto the bed. Derek had no regrets.</p>"
}