{
  "id": "1727840",
  "url": "https://archiveofourown.org/works/1727840?view_full_work=true",
  "author": [
    "hetrez"
  ],
  "title": "But We Can Try",
  "rating": "General Audiences",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Captain America (Movies)",
    "Marvel Cinematic Universe"
  ],
  "relationships": [
    "James \"Bucky\" Barnes/Steve Rogers"
  ],
  "characters": [
    "Steve Rogers",
    "James \"Bucky\" Barnes",
    "Sam Wilson (Marvel)",
    "Natasha Romanov",
    "Tony Stark",
    "Jarvis (Iron Man movies)",
    "Clint Barton"
  ],
  "additional_tags": [
    "Families of Choice",
    "First Kiss",
    "Sweet"
  ],
  "language": "English",
  "series": "",
  "published": "2014-06-02",
  "completed": null,
  "words": "10,567",
  "chapters": "1/1",
  "comments": "261",
  "kudos": "10,800",
  "bookmarks": "2,745",
  "hits": "120,068",
  "summary": "<p>Bucky said, \"These are love letters, Rogers. You've been drawing me love letters.\"</p>",
  "notes": "<p>Thanks to Clumsygyrl, Laura Kaye, Sternel, Eleanor Lavish for looking this over and talking with me about this. Thanks to the ladies of the SA email list for cheering me on and supporting me as I hashed this out.</p>\n<p>There is a tiny potential spoiler for the season finale of Agents of SHIELD.</p>\n<p>Title comes from <a href=\"http://krisdelmhorst.com/music/strange-conversation/\" rel=\"nofollow\">Galuppi Baldassare</a> by Kris Delmhorst, which I listened to almost constantly as I wrote the first part of this story. The lyrics go:<br><i>And the minor third so bitter, the six chord like a sigh,</i><br><i>suspension, solution, asking must we die, must we die must we die?</i><br><i>And the seventh says well fellas, life might not last, but we can try…</i></p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>I accidentally put in a slight crossover with The Mindy Project. Kudos to you if you can spot it.</p>\n<p>Translations for Bucky and Soraya's Spanish:<br>Bucky: Soraya, how are your children?<br>Soraya: Kiddo, they are trouble, but I love them.<br>Bucky: That's always the way. This is my trouble, Steve.</p>",
  "text": "<p>Steve went for an evening run from Midtown to the George Washington Bridge, and when he came back the apartment was dark and empty. He stopped in the doorway, one hand on the frame, his foot still lifted off the ground. In the months since he and Bucky had come to live in the tower, Bucky had mostly spent his evenings in. He would disappear on missions, or during the day, but evenings were the time that he and Steve spent together. Steve would draw or read a book, and Bucky would tear through the internet as if he could absorb everything that had happened in the last seventy years in one go.</p>\n<p>But not tonight, it seemed. \"JARVIS?\" Steve called.</p>\n<p>\"Mr Barnes is on the common floor with Ms Romanov and Mr Barton,\" JARVIS said.</p>\n<p>Steve let out a breath and dropped his hand off the doorframe. It had been a year since Bucky had come back, but sometimes Steve was still afraid it was a dream. \"Thanks, I --\"</p>\n<p>JARVIS said, \"They ask that you bring a bottle of wine, sir.\"</p>\n<p>Steve frowned. \"Excuse me?\"</p>\n<p>\"Perhaps two,\" JARVIS said.</p>\n<p>The elevator opened on the common floor to soft yellow lighting and the sound of laughter somewhere close. Steve heard Clint say, \"Wait, wait, there's still glass everywhere,\" and Natasha's low chuckle. He followed the sound into the kitchen, where he saw Clint with a towel and Bucky with a dust pan, the two of them crouched on the floor while Natasha perched on the countertop and watched them. They were all red in the face, and Natasha's hair -- shorter and curly again-- stuck up a little like she'd been yanking on it.</p>\n<p>She turned to look at him and widened her eyes. \"Oh, noooo,\" she said, monotone. \"Grandpa's come to scold us.\"</p>\n<p>\"Aw, no,\" Clint said, and giggled. He turned to look at Steve. \"Not bedtime already.\"</p>\n<p>\"Yeah, yeah,\" Steve said, walking into the kitchen. \"Those jokes just don't get old.\"</p>\n<p>Bucky snorted. \"Old,\" he said.</p>\n<p>Steve stared at him. He looked younger, somehow, with his long hair pulled up high at the back of his head, with a grin he hadn't worn since 1942. Steve didn't have a response, so he lifted the box of wine bottles he'd brought. \"JARVIS said you wanted these?\"</p>\n<p>\"Yes,\" Natasha said, and moved like she wanted to leap off the counter.</p>\n<p>\"Hey, hey, hey,\" Clint said. \"Not while there's still glass on the floor.\"</p>\n<p>Bucky swept his metal hand across the floor, and then dusted after it with the little dust broom. \"There,\" he said. \"All gone.\"</p>\n<p>Natasha gathered her legs under her and leapt across the kitchen, landing on a dining room chair near where Steve stood in the doorway. He reached to steady her, and she gave him that 'oh, please' look that make him warm with embarrassment and affection. Of course she had landed perfectly.</p>\n<p>\"What's going on?\" he asked, as Natasha relieved him of the wine.</p>\n<p>Clint gave one last swipe with the dish towel, and then tossed it behind him across the length of the kitchen and into the sink. \"Bucky tried to open a bottle of wine with a shoe,\" he said. His face squished up, and he laughed again.</p>\n<p>\"You remember,\" Bucky said. \"That fancy villa in Salzburg? Morita saw the wine cellar and nearly cried.\"</p>\n<p>Steve nodded, feeling the joy of shared memory as a warm weight in his throat. \"And then he nearly cried again when we couldn't find any corkscrews.\"</p>\n<p>\"And Dernier took his shoe off --\"</p>\n<p>\"And opened six bottles,\" Steve said. \"But where did the broken glass come from?\"</p>\n<p>Bucky went red and turned his face away. Clint hooted. \"This asshole,\" Clint said, \"thinks he's Inspector Gadget. Go go gadget <i>shoe</i>, or whatever.\"</p>\n<p>Steve shook his head. \"What,\" he said.</p>\n<p>Natasha said, \"He tried to open a bottle using his metal hand instead.\"</p>\n<p>Clint said, \"It was amazing. I think JARVIS caught it on tape.\"</p>\n<p>Natasha said, \"Glass went everywhere. Tony's roomba-bot freaked out and we had to send it to the cupboard.\" She huffed out a breath that might have been a giggle.</p>\n<p>Steve looked at all of them with dawning comprehension. \"Are you all <i>high</i>?\" he asked.</p>\n<p>\"No!\" Clint said. \"Yes.\"</p>\n<p>\"Just a little,\" Natasha said. Her ears were red. \"It's safe here.\"</p>\n<p>\"I know it is,\" Steve said, and she nodded.</p>\n<p>Bucky said, \"I didn't have a little. I had a <i>lot</i>.\"</p>\n<p>Clint leaned back against a cabinet and said, \"So I'm visiting Bruce, right, all 'Welcome back to the Tower, glad you're here to stay this time.' And he's all research, therapy dog, papers, Tony, blah, blah, and then he pulls out, I shit you not, an entire fucking <i>briefcase</i> full of weed. It was the most beautiful thing I've ever seen.\"</p>\n<p>\"Therapy dog?\" Steve asked. The rest was too much.</p>\n<p>Bucky said, \"His name is Shaggy.\"</p>\n<p>Natasha snorted. \"Shaggy!\"</p>\n<p>Bucky said, \"I like Bruce. It was good to meet him. And the dog.\"</p>\n<p>Steve looked at Bucky, at the ease of his body and the slight smile on his face. Some of his hair was coming out of its tie, and it fell over his eyes and made him look so young. Steve cleared his throat and said, \"I'll just,\" he pointed behind him. \"Have fun. Don't drive anywhere.\"</p>\n<p>Natasha frowned at him, a slight pucker between her eyebrows. \"You know you can stay,\" she said.</p>\n<p>Steve felt as if he were balanced on a wire, most days, trying to keep his balance and walk toward Bucky all at the same time. He always felt shaky when he saw that Bucky was all right without him. Full of happiness, but shaky just the same.</p>\n<p>\"Nah,\" he said, and smiled. \"Grandpas always bring the party down.\" He turned and walked away before they could say anything else.</p>\n<p>Bucky found him hours later, curled up on the large cushy chair he had gotten at something called the Brooklyn Flea. It had huge orange flowers on it, and the fabric was scratchy, and he had clocked more hours in that chair than almost anywhere else in his new apartment. When Bucky got there, Steve was staring out the window at the lights of New York, his sketchbook closed on his lap.</p>\n<p>Bucky cleared his throat.</p>\n<p>Steve didn't turn. \"You seemed like you were having fun,\" he said, and then winced at himself.</p>\n<p>\"Yeah,\" Bucky said. \"I was.\"</p>\n<p>\"Can you get drunk from wine, anymore?\" Steve asked.</p>\n<p>Bucky said, \"If I want to get really pissed, I need Bacardi 151 or something. It's gotta really melt your face off. Wine is just nice, you know?\"</p>\n<p>\"Yeah,\" Steve said, but he didn't know. The last time he drank was in a bombed-out pub in London, the night after Bucky died.</p>\n<p>\"Steve,\" Bucky said, \"Listen.\" He stopped.</p>\n<p>Steve waited, and when nothing came he turned to look at Bucky. Bucky's face was pinched tight again, his body held fighting-ready. \"What?\" he asked. \"Is everything okay?\" Maybe the come down had been bad. Maybe he'd fought with Clint and Natasha. Maybe, maybe.</p>\n<p>\"Listen, you have to. You have to stop looking at me like I'm breaking your heart, okay?\"</p>\n<p>Steve gaped. \"What -- Bucky, that's not --\" He couldn't get his thoughts in order. How could Bucky think --? Had Steve done something?</p>\n<p>\"Is it, was it the arm?\" Bucky jutted his chin forward. \"Because I, I don't want to get rid of it. It's important to me.\"</p>\n<p>\"Bucky, of <i>course</i> it's important --\"</p>\n<p>Bucky said, \"Just. Please stop. You've been doing it since I came back, and I think,\" he stopped, and took a deep breath. \"I think maybe I needed you to do that. Or I liked it. Or it helped, or something. But now. I need, just. Would you stop?\"</p>\n<p>\"I --\" Steve said. He opened and closed his mouth. He'd been making Bucky feel like this for a whole <i>year</i>. It didn't matter that he hadn't meant to. \"Yeah, okay,\" he said. \"I can stop.\" He didn't know how to say anything else, all that he had been thinking. It all started with, <i>I'm so glad you came back</i>, and none of it felt right to say out loud, right now. \"I'm sorry.\"</p>\n<p>\"Nah, pal.\" Bucky shook his head, and then put a hand to the side of his face. \"Jesus, I think I'm still high.\"</p>\n<p>Steve stood up, holding the sketchbook, and took a step toward him. \"Are you okay?\"</p>\n<p>Bucky smiled. It was his new-century smile, the one with sad edges. \"I smoked my weight in reefer and then lectured you about my coming back from the dead. I'm fine.\"</p>\n<p>\"Bucky,\" Steve took another step toward him.</p>\n<p>\"I just need water,\" Bucky said, and disappeared into the kitchen. A minute later, Steve heard the door to Bucky's bedroom open and shut.</p>\n<p>Steve looked down at the book in his hands. He opened it to the last page, where he had sketched out Clint and Bucky and Natasha in the common area kitchen. In the picture, Bucky had lifted both arms to the ceiling like he was cheering, while pieces of glass rained down around him, sparkling in the light. His metal arm also glinted in the light, each joint and plate drawn out in detail. He had the young, sweet smile on his face, the one from earlier.</p>\n<p>Steve didn't let himself think. He tore the picture out of his book and scribbled, \"I like your arm,\" on the bottom of it. Then he went and left it on the kitchen table. Bucky was sure to find it in the morning.</p>\n<p>-----</p>\n<p>A couple days later they got into a dust-up at an old Hydra outpost, and one of the hostiles stomped on Bucky's arm. After they finished up and mopped up, Bucky sat in the back of Tony's private jet, poking at his forearm.</p>\n<p>Steve came and sat down next to him. \"Anything broken?\" he asked. He'd been tiptoeing around the apartment since he left out the drawing, trying not to look heartbroken, never heartbroken, when instead he was -- he didn't know the words for all the new things he felt, in this century. But Bucky hadn't said anything, and Steve felt safe doing this, at least.</p>\n<p>Bucky's head snapped up, and he pulled his arm closer to his body, as if he were trying to hide it. Steve didn't have a lot of practice keeping his expression clear when he wanted to lecture someone, but he tried. He raised his eyebrows and waited.</p>\n<p>After a minute, Bucky shook his head and looked back down at his arm. His shoulders dropped and relaxed. \"We'll find out,\" he said. Bucky ran a nail underneath one of the plates, sliding until there was a faint click. The plates on his forearm lifted and fanned out with little whirring sounds. Inside, his arm looked like one of those steampunk computers Darcy was obsessed with, a marriage of gears and electricity. Bucky curled his metal fingers and stared at the gears. Steve watched him, fascinated.</p>\n<p>\"I think,\" Bucky said. \"Hmm.\" And then he reached down into the side pocket of the seat and came up with a red and gold screwdriver. \"Trust Stark,\" he said, glancing at Steve and smiling a sly little smile.</p>\n<p>Steve had to smile back. \"He's very dedicated to the color scheme,\" he said.</p>\n<p>Bucky's smile got wider, and then faded as he looked back down at his arm. He squinted and tapped his screwdriver against the metal plating. It made a hollow <i>pank pank</i> sound. \"I think it's all right,\" he said. \"Just…\" he tapped something inside the arm with his screwdriver, <i>clonk</i>, and then moved his hand and tapped something else, <i>tink</i>. He twisted his face up, and angled the screwdriver so that it jammed sideways into the covered part of his forearm. Steve had a moment of visceral, cringing horror to see the screwdriver inside Bucky's arm. It didn't matter that it was metal, it was Bucky's. Bucky didn't seem to notice Steve's flinch, though. He was busy poking around and tapping thing. <i>Tak tak</i>, went his arm. \"No, I'll need Stark to take a look at it,\" he said, and closed his arm back up.</p>\n<p>Steve stared. \"Aren't you going to --\" he made a twisty-screwdriver motion, and Bucky frowned.</p>\n<p>\"No,\" Bucky said. \"Why would I?\"</p>\n<p>Steve opened his mouth, and then closed it.</p>\n<p>Later, after he had showered and eaten, he drew Bucky from memory. Bucky sitting with his arm out, frowning in concentration. Bucky holding the screwdriver, his grip delicate but sure. Bucky's arm, the plates spread, made from precise machinery and brilliant minds, open and vulnerable. Steve drew himself sitting next to Bucky, chin in his hand, watching, rapt.</p>\n<p>He held the picture after he was finished. One time was ignorable, but two was a pattern. Did he want this to be a pattern? He wasn't sure. He just knew he wanted Bucky to be happy. <i>Maybe</i>, he thought. <i>Maybe, maybe</i>.</p>\n<p>-----</p>\n<p>Steve found himself watching more, and more closely, in the week that followed. It had been months, but he felt new in some strange way, like he understood all over again what a gift Bucky was.</p>\n<p>He saw Bucky and Sam on the tower rooftop, Bucky gesturing at something with his left hand, Sam looking at him and smiling, calm, safe. That was new -- Sam had come to live with them four, maybe five months ago, and had stopped being visibly wary of Bucky only recently. Steve drew them, and left the picture out on the kitchen table.</p>\n<p>During a fight the next day, the chest plate of Tony's armor got dented, so that the suit wouldn't close properly and he couldn't fly. Bucky said, \"Uh, I could . . .\" and wiggled his metal fingers. Tony stood behind him, still half in the suit, and directed him in a series of tiny, focused, hammering blows, banging out the dent with care. Steve drew that one and left it on the table.</p>\n<p>He drew a picture of Bucky, shirtless, standing at their kitchen sink and washing blood off his arm. That one made him feel strange, though, so he kept it.</p>\n<p>-----</p>\n<p>\"Okay, I get it,\" Bucky said, coming into the kitchen one morning while Steve was making eggs. \"My arm is fine, everything is fine. You can stop now.\"</p>\n<p>Steve glanced at him and then back to the eggs. \"Stop what?\" he asked, holding himself still.</p>\n<p>\"Don't play dumb, it looks awful on you.\" Bucky scrubbed a hand through his hair. \"You can stop with the pictures, Rogers. I get what you're trying to say.\"</p>\n<p>Steve turned off the burner on the stove, and went to get the salt out of the spice cupboard. Sometimes Bucky said things easiest when you weren't looking at him. \"What am I trying to say, then?\"</p>\n<p>Bucky was quiet for a long time. Steve grabbed garlic powder, too, and then just fished around in the cupboard, knocking jars together. \"You forgive me,\" Bucky finally said. \"For not being him.\"</p>\n<p>Steve turned and stared at him. \"<i>Excuse</i> me?\" he asked, sudden anger pounding in his chest. He didn't know who he was angry at, possibly himself. Definitely Hydra.</p>\n<p>Bucky looked away. \"I can't imagine it's been easy --\"</p>\n<p>\"There is <i>nothing</i> for me to forgive,\" Steve said. \"Is that what you've been thinking this whole time? That I, what, that I resented you?\" All that time Bucky had spent gaining the trust of their team, healing himself, fighting alongside them, living with Steve again.</p>\n<p>Bucky didn't move. \"Look, it's obvious you're not getting him back, and you could have kicked me out when you realized, but you didn't. That means a lot. You mean a--\" he stopped, and took a breath. \"Anyway, just. Stop with the pictures. I know what I look like already.\" He flashed a smile at Steve, a shadow of his old 1940s grin, and then walked out of the kitchen.</p>\n<p>Steve wished, with sudden fierceness, that Pierce was still alive, so he could bust his shield through the man's head.</p>\n<p>-----</p>\n<p>The next time Steve and Sam were out on a run, Steve waited until they hit the halfway mark and stopped for a rest. Then he asked, \"Does Bucky seem a little…\"</p>\n<p>Sam wiped his sweaty forehead. \"Bucky's 'a little' a lot of things, man. You're going to have to be more specific.\"</p>\n<p>Steve looked around, trying to gather his thoughts. They were on East 23rd, surrounded by carts of flower sellers and people going about their business. Some days he still didn't feel so good about being in the world again, even though he had Bucky and all his other friends. But today it felt good to be outside, surrounded by people, in the warm spring air. It gave him the push he needed to speak. \"He told me he thinks I resent him for, I don't even know. Being different. Being changed by everything that happened.\"</p>\n<p>Sam smiled, and then full-on grinned. \"Way to go, Barnes,\" he said. \"You did it.\"</p>\n<p>Steve's eyebrows went up. \"What are you talking about? Why is this a good thing?\" Sam had never smiled at people who got mad at him before.</p>\n<p>\"I've been telling that boy to use his words for months now. I feel like I'm back in Miss Wallenstein's kindergarten class sometimes.\" Sam shook his head, still grinning. \"I wonder what finally did it for him.\"</p>\n<p>\"A pound of marijuana, apparently,\" Steve said, feeling disgruntled.</p>\n<p>Sam gave a weird yelping laugh that Steve had never heard before, and clutched at his chest. \"Oh my god,\" he said, gripping the front of his shirt. \"Oh, that's beautiful.\"</p>\n<p>\"Yeah, it was a moment,\" Steve said, while Sam gasped for breath and pounded his knee. \"Can we talk about why he thought I hated his arm and his,\" Steve waved a hand, \"everything else?\"</p>\n<p>Sam's smile morphed lightening-fast into A Look. \"You can. With Bucky. Like a person with healthy communication skills.\"</p>\n<p>And Steve got it, he did, but -- \"Just. What did I do wrong?\" That was what he kept coming back to. How had he not realized? How had he made Bucky think --</p>\n<p>\"Aw, no, man,\" Sam said. He ran a hand over his face and sighed. \"You didn't do anything, okay. I think he's just trying to make sense of things, you know? It hasn't been that long since he got himself back.\"</p>\n<p>\"And the way he makes sense of things is by thinking -- no, you're right, I should talk to him,\" Steve said. And if he Bucky wouldn't listen, he'd, he didn't even know. He'd sky-write it or something. He'd go on that Jon Stewart show Tony was always making them watch, and talk about how Bucky was his hero.</p>\n<p>Sam smiled at him, the quiet smile he gave to his clients at the VA, the one Steve had trusted the moment he saw it. He said, \"That's all you can do, man.\" He patted Steve's shoulder, and then bent down to stretch.</p>\n<p>Steve looked around, at the plastic buckets of flowers and the pedestrians and the new buildings and the old ones. He was alive and Bucky was alive. They had a team, and friends. The sun was shining and cab drivers were yelling at each other. He could do this. He turned back to Sam and asked, \"Hey, whatever happened with that nurse you met. Tamra?\"</p>\n<p>Sam shook his head. \"She's got something complicated with a coworker. I didn't want to get in the middle of that.\"</p>\n<p>\"I'm sorry,\" Steve said. \"She doesn't know what she's missing.\"</p>\n<p>Sam made a twisted-up face at him. \"And how do you know what she's missing?\"</p>\n<p>Steve said, \"Easy. I've seen you run.\"</p>\n<p>Sam grinned at him. \"Oh, is that how --\"</p>\n<p>But Steve didn't hear the rest, because he took off running. Sam yelled and started after him.</p>\n<p>When they got back to the tower, Bucky wasn't in their apartment. Steve sat down with his sketchbook and drew a cartoon parade down Madison Avenue. All of the Avengers were on the sidewalk, cheering and throwing confetti, while Bucky walked down the street in full Winter Soldier gear. Steve spent a long time on his uniform and his hair and his arm and his expression, all the ways he looked different from before. At the bottom he wrote, \"I like who you are right now.\"</p>\n<p>He left it for Bucky on the kitchen table, the way he had left all the others. Talking and sky-writing could come later.</p>\n<p>-----</p>\n<p>Steve looked up from his book as the sunset painted the sky pink and gold, when the door to their apartment opened and Bucky's footsteps echoed in the entryway. He kept himself still and calm on his puffy armchair, trying not to fuss and fidget. The book had been interesting until Bucky arrived, but now Bucky was the only interesting thing in the apartment.</p>\n<p>The footsteps went right into the kitchen, and then stopped. Steve held his breath. There was a banging sound from the kitchen, as if a metal fist had hit the doorframe, and then Bucky marched into the living room and right up to where Steve was sitting on the couch. He glared. \"I cannot fucking believe you,\" he said.</p>\n<p>Steve leaned back, and raised an eyebrow. \"You don't like cartoons? I know the linework is a little --\"</p>\n<p>\"Not the linework, not the --\" he grabbed a fistful of hair and closed his eyes. Steve waited. \"It's not nice to mess with me like this,\" Bucky said finally. \"Okay?\"</p>\n<p>\"Bucky, I'm not <i>messing</i> with you,\" Steve said. \"I don't know where this all came from. A week ago we were fine, you seemed like you were\" <i>home, healed, whole,</i> he thought. \"Fine.\"</p>\n<p>\"I was fine. I'm grateful, you have no idea.\" Bucky waved his hand around in a circle. \"All of this, it's amazing. Your team, the work, this place. I just had to open my big mouth.\"</p>\n<p>Steve realized, with sudden impatience, that he didn't want to be sitting for this conversation. He stood up, and got up as close as he thought Bucky would let him. It was almost close enough for him to reach out and put a hand on Bucky's shoulder. He said, \"Our team.\"</p>\n<p>\"Huh?\" Bucky tipped his head back, looking at Steve through narrowed eyes.</p>\n<p>\"They're our team, not just mine,\" Steve said.</p>\n<p>\"Nah, that's --\"</p>\n<p>\"You have a weekly date at the range with Clint.\"</p>\n<p>\"Okay, but --\"</p>\n<p>\"You and Natasha have a book club where you argue about classic Russian literature.\"</p>\n<p>Bucky's face lightened, and he quirked a tiny smile. \"Yeah,\" he said. \"I like that.\"</p>\n<p>\"You're teaching Sam hand-to-hand. He says you're a great teacher.\" Steve started counting on his fingers. \"You and Tony sit around listening to that godawful music together. You've charmed Pepper and Jane. This is your home, too, you know.\"</p>\n<p>Bucky looked away, his jaw working. It took a long time, but finally he said, \"They didn't know me before. They don't know what I lost. You do.\"</p>\n<p>Steve opened his mouth, and then closed it.</p>\n<p>Bucky glanced at him and gave him a pained smile. \"Still think we should be talking about our feelings?\"</p>\n<p>\"Yes,\" Steve said, a moment too slow. Bucky was already out of the living room. \"Bucky,\" he called. \"Bucky!\" He heard the door to Bucky's bedroom slam shut.</p>\n<p>Steve scrubbed a hand over his face. He put his book back on the shelf, taking care to line the corners up with the other books. He turned on the lamp at the far side of the living room. He went to the kitchen to get a glass of water, and saw that the picture was gone. Bucky had taken it with him.</p>\n<p>Steve put his hand flat on the table where the picture had been. He felt hope grow.</p>\n<p>-----</p>\n<p>The next day Steve left the tower and walked around New York. The city had recovered from the Chitauri invasion, although it still had scars. There were memorial plaques on the new sidewalk along 42nd, leading up to Grand Central. Some office buildings had been torn down, but others had stayed standing. They had bites taken out of them, by Hulk or the flying whale or the other Chitauri.</p>\n<p>Steve had been down in DC for most of the repair work. He'd been in DC when Hurricane Sandy swept through the construction sites, tearing out the tentative new frames of buildings and flooding the unpatched holes. He'd watched the news, seen people band together to rig up a public telephone or hand-wound flashlights. He'd seen people help each other find lost loved ones after the fight and after the hurricane. He had watched it all from the television in his apartment, alone. And then he'd let Sam in, and Bucky had come back, and he'd trusted Natasha, and now he was back in the world.</p>\n<p>He walked until dark, all over, from Mt Vernon to Sheepshead Bay, and then he went back home.</p>\n<p>Bucky was there, cooking pasta, wearing an Iron Man shirt and humming tunelessly. He turned when Steve came into the kitchen, and raised his eyebrows. \"You look like something good happened.\"</p>\n<p>Steve thought, <i>you and Sam and Natasha happened</i>. He said, \"It just feels good to be alive today.\"</p>\n<p>Bucky's face softened. \"I know the feeling, pal,\" he said.</p>\n<p>-----</p>\n<p>Half the time their intel came from a woman named Skye, whom Maria seemed to trust as much as she trusted anyone. Tony adored Skye because she wouldn't take his sass, he couldn't trace her video feed, and she always had theme music for their trips. This time it was Aretha Franklin.</p>\n<p>\"If you want a do right all day's woman,\" Tony crooned, sounding like the rusty hinge on an old gate, \"You gotta be a do right all night man. JARVIS, what's the connection this time?\"</p>\n<p>JARVIS said, \"We are traveling to Svalbard, sir, which at this time of year only has three hours of darkness every night. We are approaching the time of the midnight sun.\"</p>\n<p>Tony said, \"Oh, I like that, that's very poetic. This kid is clever. Have we tried to hire her yet?\"</p>\n<p>\"Several times, sir,\" JARVIS said.</p>\n<p>Steve looked around the jet at the others. Natasha and Clint were back to back on the floor, napping with their weapons across their laps. Sam was reading a book on self compassion. Bucky was tying his hair up. He had a tie in his mouth and he was smoothing his hair back from his forehead with his metal arm, a look of concentration on his face. He caught Steve watching and quirked his eyebrows, smiling a little. \"Can I help you?\" he asked around the tie.</p>\n<p>Steve shook his head. \"Nothing, just.\" He felt like poking today, and he wasn't sure why. \"Do you ever think of going out dancing again?\"</p>\n<p>Bucky frowned. He let go of his hair so it fell back around his face, and took the tie out of his mouth. \"Steve,\" he said.</p>\n<p>Steve barreled on. \"Natasha told me about this goth club,\" he said. \"I thought you might, I thought we could go.\"</p>\n<p>Bucky's frown had changed to a confused little V between his eyebrows. He looked at Steve, eyes moving over Steve's face and uniform, and then seemed to shake himself. \"A goth club, huh? I'm surprised you know what those are.\"</p>\n<p>\"Natasha,\" Steve said, by way of explanation.</p>\n<p>\"Natasha,\" Bucky agreed. He relaxed back into his seat. \"What makes you think I'd like it. Is it the hair?\"</p>\n<p>Steve didn't smile, but he wanted to. \"Really it's all the black you wear,\" he said, as if he were confiding something.</p>\n<p>Bucky grinned. \"You don't like it?\" He held his arms out, one silvery-shiny and the other matte black. Everything from the buckles on his jacket to the boots on his feet looked secret and dangerous.</p>\n<p>\"I do,\" Steve said, and Bucky's expression changed.</p>\n<p>\"Hey,\" Bucky said, and then the music changed to loud guitars and moaning Scotsmen. </p>\n<p>\"And I would walk five hundred miles,\" they sang over the loudspeakers, \"And I would walk five hundred more.\"</p>\n<p>Tony said, \"JARVIS, tell me that isn't literal.\"</p>\n<p>\"I'm afraid I cannot tell you that, sir,\" JARVIS said.</p>\n<p>Tony groaned. \"Goddamn tacky assholes,\" he said.</p>\n<p>Natasha said, \"You love tacky.\"</p>\n<p>\"Not when I have to <i>walk</i>,\" Tony said.</p>\n<p>They marched, and then they fought. Bucky had tied his hair up on the march, but some of it came out of the tie while he was shooting, falling into his face. Steve noticed it, like he noticed Sam's flight pattern and Natasha's sure, swift movements and Clint's perfect aim. He noticed Bucky's serrated knife, a near match to the one he'd used to fight Steve in downtown DC last year. Bucky flipped it to slash across a man's face, the thin slice distracting the man from Bucky's gun. Steve noticed the way Bucky stood, solid as a wall, and the strength in his arms as he fought. A Hydra goon came at him from the left, and he slammed his shield into the man's face, and then shook himself and concentrated on the fight.</p>\n<p>On the plane right back, everyone sat around eating ham and cheese pastries and patching each other up. Tony poked through the information they had found in the secret bunker under Sassen-Bünsow Land National Park. He said, \"JARVIS, send a copy of this to Pepper and a copy to Skye, would you?\"</p>\n<p>\"Already done, sir,\" JARVIS said. \"I've taken the liberty of performing an X-ray scan, and I see that your first metatarsal is fractured.\"</p>\n<p>\"Huh, that's never happened before,\" Tony said. \"Ice?\"</p>\n<p>\"Ice,\" JARVIS agreed. \"And then a doctor when we get back.\"</p>\n<p>\"Do I have to?\" Tony asked.</p>\n<p>\"Yes,\" everyone else said, in almost perfect unison.</p>\n<p>When they got to the tower, Steve cleaned himself and cleaned his uniform, and then went to his room and pulled out his sketchbook. He drew Bucky on the jet, one hand buried in his own dark hair, the other smoothing wayward strands back from his face. Bucky's eyes were open, his gaze focused out the window at the deep blue sky. Steve hesitated, and then wrote, \"I like your hair,\" at the bottom of the picture.</p>\n<p>He sat with it for a minute, but there was still an itching feeling under his skin, buzzing through his palms. He got his pencils back out and started on a new page.</p>\n<p>He drew Bucky in the middle of fighting. Action scenes had always been harder for him, but he tried to capture Bucky's brutality and power, how beautiful it was. Bucky didn't fight the way he used to, not the scrapping fistfights of their youth or the hard-edged, fearful battles from the war. Now Bucky fought like a force of nature, like he would never die. He fought, and Steve didn't have the words for it. Steve drew Bucky's serrated knife flipping in midair as Bucky leaned forward with his gun, face intent. On the bottom he wrote, \"I like the way you fight.\"</p>\n<p>He drew Bucky sitting in a circle with the other Avengers, holding his ham and cheese pastry in his metal hand, smiling at Sam while Sam cleaned ash off his wings and scowled in concentration. At the bottom of the picture, Steve wrote, \"I like that you choose to fight for a good reason, every time. I like that you choose to fight with me.\"</p>\n<p>He laid all three out in front of him on the bedspread. Put on paper like that, it was almost too vulnerable. He picked them up to throw them away, and then remembered Bucky saying, 'They don't know what I lost. You do.' He couldn't throw them away, not if Bucky still thought like that.</p>\n<p>But he couldn't give them to Bucky, either. It was too much. He put the pictures in his bedside table, instead. Then he went out to the living room to have his evening time with Bucky.</p>\n<p>-----</p>\n<p>That night Steve was woken by the sound of screams. He rushed down the hall and into Bucky's room before he was completely awake. It was that half-sleepiness that had him opening the bedroom door so hard it slammed back against the wall, a sure mistake. At the sound, Bucky shot upright in the bed, pulled out a gun, and fired it at Steve's face. Steve dodged just in time.</p>\n<p>\"Bucky, it's me!\" Steve yelled, from out in the hallway. \"You had a nightmare. It's me, you're safe, you can put the gun down.\"</p>\n<p>\"Steve?\" Bucky said, sounding lost.</p>\n<p>\"I'm going to come in now,\" Steve said, \"Can I come in?\"</p>\n<p>Steve heard the small click of the gun safety catch being toggled, and a rustle as Bucky shoved it back under his pillow. Bucky said, \"Tony's gonna be mad.\"</p>\n<p>Steve peeked around the doorway, and saw Bucky slumped on the bed, head down, staring at his open palms.</p>\n<p>\"Nah,\" Steve said, stepping fully into the doorway. \"He likes fixing stuff. I think he'd be bored if we didn't do this every --\" he stopped.</p>\n<p>\"Every week, you mean to say. If we didn't do this <i>every fucking week</i>.\"</p>\n<p>Steve didn't say anything. It happened slightly less than once a week, but only slightly.</p>\n<p>\"I'm sorry,\" Bucky said.</p>\n<p>Steve said, \"I'm coming in.\"</p>\n<p>Bucky didn't protest. Steve walked over and sat on the edge of the bed, close enough to put his arm around Bucky if that was what was needed. Some nights, early on, Bucky had cried after he woke up from these nightmares. Some nights he had stared at the wall without speaking. Tonight seemed like a good night, as these things went. Bucky was talking, and he wasn't crying, and he wasn't kicking Steve out. Steve reached a hand out, tentative, and placed it on Bucky's shoulder. Bucky sagged into the touch.</p>\n<p>Talking didn't work on nights like these, so Steve didn't try to talk. He nudged Bucky over, careful to keep his movements slow. Bucky crept over to the other side of the bed, sitting back against the headboard, and wrapped himself in the comforter until only his shoulders and head were visible. Steve sat next to him and leaned over until their shoulders were touching. They both slept shirtless, and the heat of Bucky's flesh and blood shoulder was a shock after the cool, air-conditioned air of their tower apartment. Steve closed his eyes and matched his inhales and exhales with Bucky's.</p>\n<p>Steve remembered winter evenings when they were kids, Steve with a cold and Bucky hiding his sniffles because he was the healthy one, see, one of them had to be strong so you don't have to worry, Stevie, I'll take care of you and your mom, I've got everything taken care of. And then later, when they were older, and Steve wanted to give Bucky a new pair of suspenders or a trip to Coney Island as a thank-you for everything, Bucky would just brush it off with his grin and his shrug, come on, Rogers, what do you take me for?</p>\n<p>It was different now, in this new century. He leaned his head on Bucky's shoulder, exposing the side of his neck, and he felt Bucky tense and then nearly melt against him. Bucky looked over, and blew a breath into Steve's face, making Steve's forehead itch. Steve bonked his knuckles against Bucky's leg. They jostled for a minute without really moving, and then settled. Steve fell asleep like that.</p>\n<p>In the morning, when he woke, the other side of the bed was empty. Steve went back to his room, feeling frantic with <i>something</i>. He drew a picture of the two of them, propped against each other, covered in blankets, fast asleep. At the bottom he wrote, \"I like that you let me help you.\" He kept that one in a pile with the others.</p>\n<p>-----</p>\n<p>Something about the pictures made him brave. The next morning, Bucky wouldn't look at Steve when he came into the kitchen to get coffee, and Steve thought he should be careful, quiet, like all the other times, but instead he asked, \"Where do you go during the day?\"</p>\n<p>Bucky froze, one hand on the coffee pot, and then turned and stared at him.</p>\n<p>Steve felt shy all of a sudden. \"I mean, you don't have to tell me. You deserve privacy, I just thought --\"</p>\n<p>\"Put your shoes on,\" Bucky said. Steve didn't understand for a second. \"And bring a jacket.\"</p>\n<p>\"Okay, I'll just, okay,\" Steve said, and scrambled to get his sneakers.</p>\n<p>Bucky took him through Central Park toward the Bethesda Fountain. When Steve realized where they were going, he hesitated, remembering the last time he had been there, the look in Loki's eyes. But Bucky kept walking past the stone circle where Thor and Loki had disappeared, down to the little courtyard near the fountain, and over to a withered old man selling hot dogs.</p>\n<p>\"Marco,\" Bucky said, \"I want you to meet my friend, Steve. Steve, this is Marco. He has the best hot dogs in Manhattan.\"</p>\n<p>Marco grinned at them, his wrinkly face looking like a walnut under his 'I &lt;3 New York' baseball cap. \"Nah, son,\" he said, but he seemed to glow with the praise. \"I'm glad you finally brought your friend around.\"</p>\n<p>\"Well, he's housebroken now,\" Bucky said. \"I figure I can take him out in public and he won't make too much of a mess.\"</p>\n<p>Steve, feeling happiness like a bubble of warmth in his belly, didn't say anything. Bucky frowned at him, but then something in Steve's face made his frown melt into a sappy little smile.</p>\n<p>Marco started preparing a couple of brats for them. \"It's good to meet you, Steve,\" he said. \"You want pickle relish?\"</p>\n<p>After that, Bucky took him to a pizza place on Broadway in the West 70s, near one of those huge fancy grocery stores that still made him uncomfortable. \"Fairway has the best chocolate,\" Bucky said, as they wandered past rows of fruit and impatient people with shopping baskets. \"You know those big slabs I get? They're from here.\"</p>\n<p>\"Yeah, about that,\" Steve said, watching the rush of people and the shelves upon shelves of foodstuffs. \"You know I've seen you eat cold franks out of a can. You're not gonna impress me no matter how much fancy chocolate you bring home.\"</p>\n<p>Bucky grinned at him sideways, and kept walking.</p>\n<p>At the pizza place, the young woman behind the counter looked up from her smartphone and grinned. \"Bucky!\" she said.</p>\n<p>\"Hey, Sadie,\" he said. \"How's the studying.\"</p>\n<p>\"I have no idea, because I'm not doing it.\"</p>\n<p>Bucky said, \"Sadie, this is my friend Steve. Steve, this is Sadie. She's going to be the best doctor in the world.\"</p>\n<p>Sadie smiled at Steve, looking dazzled by him the way people sometimes did, and then she turned to Bucky and scowled. \"You mean I'm going to fail the MCATs and fail out of college and end up living in a box on the sidewalk.\"</p>\n<p>Steve laughed.</p>\n<p>\"That's actually not what I mean at all,\" Bucky said.</p>\n<p>The way Bucky talked wasn't much like when they were younger, and it wasn't the Winter Soldier, and it wasn't careful Bucky from the Tower, or dangerous Bucky during their fights. This was something built out of all of those things.</p>\n<p>Bucky took Steve to a woman selling tamales on 137th near the subway. \"Soraya, ¿cómo están tus hijos?\" he asked. Steve felt amazed, as he always did when Bucky spoke another language.</p>\n<p>She gave him a sweet smile. \"Mijo, son problemas, pero me encantan.\"</p>\n<p>Bucky shrugged. \"Eso es siempre lo que sucede. Este es mi problema, Steve. Steve, this is Soraya. Best tamales in Manhattan.\"</p>\n<p>Soraya blushed, and waved a hand at him. \"You are trouble, too,\" she said.</p>\n<p>Bucky took Steve up and down the length of Manhattan, into shops and up to sidewalk stalls. Everywhere he went, people knew him. Everywhere he went, he remembered their lives, and he admired them, and he introduced Steve like he was showing Steve off. After the fifth place they visited, though, Steve started to feel a little blue. After the seventh, he started to feel ashamed. After the tenth, he had to beg off and go home to his quiet apartment high above Manhattan, where he didn't interact with anyone and he was still the man out of time, where his best friend had overcome ten times what Steve had ever gone through and was putting down roots, finding friends, making connections, living again.</p>\n<p>Steve was, in some ways, a creature of habit, so while he stewed he got out his pencils and his sketchbook. He drew Bucky surrounded by people, Marco and Sadie and Soraya and the others, all of them smiling and laughing. He drew a line down the middle of the paper and then sketched himself, sitting alone on his squashy chair, looking out the window at the sky. He didn't write anything on that one.</p>\n<p>-----</p>\n<p>Steve went to Sam's floor and knocked on the apartment door. He saw that he'd left graphite on the spotless white of the door, and tried to smudge it out with his shirtsleeve. He was still wiping at it when the door opened and he almost bonked Clint in the face.</p>\n<p>\"Uh, hi?\" Clint said.</p>\n<p>\"Hi,\" Steve said. \"Um, I.\"</p>\n<p>\"Is that Steve?\" Sam called from inside the apartment. \"Come in here, man!\"</p>\n<p>Steve came in and saw Natasha and Sam sitting on the couch eating popcorn and watching something animated. Clint walked past him and flopped down on the couch, sprawling into Natasha's space. She lifted the bowl of popcorn while he tipped over and put his head in her lap, and then rested it on the side of his face.</p>\n<p>Steve stared, feeling wrong-footed and confused.</p>\n<p>Sam grinned at him. \"Come sit. Ralph is teaching Vanellope to drive.\"</p>\n<p>Steve sat down on a beautiful plush blue armchair next to the couch, and turned his face to the television screen, but he couldn't pay attention. What else were the people in his life doing, while he went on walks by himself and sat in his apartment reading, alone? He hadn't even known they were all friends. He hadn't known anything, it felt like.</p>\n<p>\"Do you do this often?\" he asked. They all looked comfortable together, like they were a family, not just a team.</p>\n<p>Sam turned to look at him, eyes narrowed, assessing. \"Couple times,\" he said. \"You want I should invite you next time?\"</p>\n<p>\"I,\" Steve said. He thought about Natasha, who worked to find herself after exposing her history to the world. About Sam, offering support to veterans when he had experienced so much tragedy himself. About Bucky, who tried and tried and reached out and tried. Steve could try, too. \"Yeah, that would be nice.\"</p>\n<p>After the movie was over, Steve lingered while Natasha and Clint let themselves out. He ran his fingers over the velvety nap of the chair cover. He tried to think of how to talk to Sam, about any of it.</p>\n<p>Sam beat him to it, though. \"You look like a man who needs a hobby.\"</p>\n<p>Steve smiled. \"The second time we met, you asked me what I wanted to do. What made me happy. I told you I didn't know.\"</p>\n<p>Sam turned on the couch, facing him. \"And then you had a mission, and then we were rehabilitating that mission, and the last couple months we've all been settling into this giant superhero frat house. It never seemed like the right time to bring it up again.\"</p>\n<p>\"And now?\" Steve asked.</p>\n<p>Sam looked at him, and Steve almost wanted to hide from his clear gaze. Almost, because Sam was the kindest man Steve knew, and he wouldn't laugh at Steve, no matter what he saw. \"Now,\" he said. \"What do you want?\"</p>\n<p>Steve took a breath, and said, \"I want to be in the world. I want to,\" he thought of that long-ago day on the Mall, and the easy connection he'd felt with Sam. He had been so lonely. He was still lonely. \"I want to reach out.\" He shook his head, frustrated with language. \"I don't want to be by myself while everyone else is watching movies together. But I don't know how.\"</p>\n<p>Sam watched him, expression gentle. He asked, \"Were you like this before the war?\"</p>\n<p>Steve said, \"I went to a lot of diners on my own,\" he said. \"And since then it's gotten worse.\" He ducked his head, feeling raw. Licked his lips. Ran a hand through his hair.</p>\n<p>\"Well,\" Sam said, and laid a hand on his shoulder. \"You're not on your own now.\"</p>\n<p>\"I know,\" Steve said, because Sam had to know how much Steve valued him, how grateful Steve was. \"I haven't been for a while. It just feels like,\" he stopped.</p>\n<p>\"I know,\" Sam said.</p>\n<p>Later he went to his room and found the picture of Bucky with all of his friends. He erased some of the sketch on his empty side of the picture, and drew thought bubbles coming from drawing-Steve's head. One bubble had a tiny image Steve with a therapy dog. Another bubble had a small image of Steve and Sam out in front of the Y, wearing shirts that said, 'Volunteer'. Sam had helped him brainstorm, and he was full to the brim with ideas. He felt, for the first time since he'd jumped out Howard's plane over German-occupied territory, that he could choose anything.</p>\n<p>On the bottom of the picture, he wrote, \"You get me out in the world. You make me want to be out in the world.\"</p>\n<p>-----</p>\n<p>Bucky came back when Steve was thinking about making dinner. He was carrying a grocery bag from Fairway that had tufts of leafy carrot greens poking out of the top. He smiled at Steve, looking tentative, and said, \"I thought I'd make something.\"</p>\n<p>Steve watched him chop vegetables and saute chicken, content to be silent. The day had been so full already, but Bucky showing Steve all his people, and the conversation with Sam, and the thoughts in his head. He watched Bucky's hands and felt something in his belly settle, calming down.</p>\n<p>Steve said, \"I liked meeting your friends today.\"</p>\n<p>Bucky laughed softly, barely a huff of breath. He looks embarrassed by the depth of his happiness. \"Yeah, they're great. They thought the world of you.\"</p>\n<p>\"Nah,\" Steve said, \"they were just amazed anybody else could put up with you.\"</p>\n<p>Bucky set a large stockpot on the stove, and poured flour and oil into it. He grabbed shrimp and sausage and chicken stock and laid them out in a neat line on the counter.</p>\n<p>Steve asked, \"Did Nigella teach you that?\"</p>\n<p>\"Nigella is a genius, but no,\" Bucky said. His shoulders tensed, just a little. \"I had a mission in New Orleans in '77.\"</p>\n<p>\"As a chef?\" Steve asked.</p>\n<p>Bucky flashed him a minnow-quick smile. \"No, bozo. I saw someone --\" he took a breath. \"I was in a nest for going on thirteen hours, just watching this house. And I saw a woman in the kitchen, making gumbo. After I woke up, last year, cooking was one of the things I did to -- well, anyway, I guess you know that,\" he said, rubbing the back of his neck. \"The woman I watched used filé powder, but I tried a bunch of different kinds and I like roux better.\"</p>\n<p>\"Bucky,\" Steve said, and watched Bucky's shoulders come up to crowd his ears. Steve thought about all the months that Bucky had been on his own, after he had woken up from the Winter Soldier programming. He had never asked what they were like, and Bucky had never said. \"Thank you.\"</p>\n<p>Bucky frowned. \"For what?\"</p>\n<p>\"For dinner,\" Steve said. <i>For telling me</i>.</p>\n<p>Bucky's shoulders came down, and he went back to cooking. He set a smaller pot on to boil, and got out spices that he mixed together in a little bowl, dipping a fingertip in to taste the blend. When the roux was ready, he dumped in the stock and vegetables and covered the pot, and dumped rice into the boiling water. The whole thing was the perfect dance of action and timing and taste and smell. It reminded Steve of watching Bucky fight. Bucky had that same sureness, the same economy of motion. The same beauty.</p>\n<p>Steve hummed in thought, and then asked, \"You want to spar with me?\"</p>\n<p>Bucky's tasting spoon clattered against the rim of the stockpot. \"No,\" he said.</p>\n<p>Steve tried not to feel hurt. \"Okay,\" he said. <i>Stupid, stupid</i>, he told himself. <i>This is why you didn't ask before</i>.</p>\n<p>Bucky turned to him. \"Why would you want to?\"</p>\n<p>\"It doesn't matter,\" Steve said. \"You said no, I said okay.\"</p>\n<p>\"The hell it doesn't matter,\" Bucky said, his voice getting louder. \"Why do you have to push all the time, Rogers? We were having a good evening, things were good.\"</p>\n<p>\"Look, forget it,\" Steve said. \"I'm sorry. I shouldn't have asked.\" He stood up, pushing his stool back from the kitchen island.</p>\n<p>\"Just tell me why,\" Bucky said.</p>\n<p>\"Because I love watching you fight,\" Steve said. Bucky stared at him, wide-eyed. \"I love it. It makes me feel,\" he stopped, and shook his head. \"And I get tired, sometimes, of having to be careful with everyone so I don't hurt them. And you're my friend. But you said no, and I said okay.\"</p>\n<p>\"Okay,\" Bucky said. His eyes were still wide.</p>\n<p>\"Fine, good, we agree then. I'm going to --\"</p>\n<p>\"No, I mean okay, we can spar.\"</p>\n<p>\"Really?\" Steve asked.</p>\n<p>\"You want me to change my mind?\"</p>\n<p>\"No!\" Steve said, feeling off-balance and desperate, although he didn't know for what.</p>\n<p>Bucky pressed his lips together, with that look he got when he was trying not to laugh at Steve. \"Okay, so let me finish this, and after we eat we can go to the gym.\"</p>\n<p>\"Tonight?\" Steve asked.</p>\n<p>\"Sure, tonight,\" Bucky said. \"You got anywhere else to be?\"</p>\n<p>\"I guess not,\" Steve said.</p>\n<p>Bucky went back to his soup, tasting the broth and checking on the rice. Steve tried to settle back into himself, but his skin was humming. He watched Bucky's hands again, and to calm himself he planned out the next picture he would draw. He thought about drawing Bucky surrounded by piles of okra, garlic, onion, and pepper, of shrimp and sausage and chicken. He thought of drawing Bucky in motion, moving from the cutting board to the stockpot, or maybe testing the broth. He thought about drawing the quiet, secret smile on Bucky's face. At the bottom he would write, \"I like your cooking.\"</p>\n<p>-----</p>\n<p>The gumbo was delicious, or Steve assumed it was. He was fidgeting nearly out of his skin and couldn't quite pay attention to the way it tasted. After his second bowl, Bucky said, \"Stop it, you're making my soul cry.\"</p>\n<p>Steve put the ladle back in the stockpot. \"Sorry,\" he said. \"It's just --\"</p>\n<p>\"I know what it's just,\" Bucky said, but he was smiling. \"Let's get this over with. Then maybe I can get you to actually appreciate good cooking.\"</p>\n<p>\"If we ever had any of that around here,\" Steve said, \"I'm sure I would appreciate it.\"</p>\n<p>\"Shut it,\" Bucky said, and they went to get their exercise clothes.</p>\n<p>Tony had a gym that took up one entire floor of the tower, with a climbing wall, a boxing ring, sparring mats, and an archery range. Steve had a favorite sparring mat -- the one near the wall of windows overlooking the city -- and he headed over there as soon as they entered the gym. He started to stretch.</p>\n<p>Bucky asked, \"Your shield, my arm and my knife?\"</p>\n<p>Steve turned and saw Bucky holding up the nasty-looking serrated knife he used on missions, and felt a jolt of something in his belly. \"Sure,\" he said.</p>\n<p>The word was like a switch being flipped. Bucky was still Bucky, but with the shape and presence of the Winter Soldier laid overtop. He stalked toward the sparring mat, knife at his side. Steve had a brief second to think how impressive it was before Bucky was in front of him and everything was fists and movement and breath and the animal need to survive, to win.</p>\n<p>Steve had learned some things since they last fought on the street in the middle of DC, amid the wreckage of Steve's life with SHIELD. He found ways to use Bucky's momentum, that churning unstoppable Winter Soldier drive, to throw him just the slightest bit off balance, get just an inch outside his field of vision. It made Steve want to laugh, in the middle of dodging a punch to the throat with Bucky's metal hand, that he could push and push himself to the limit and not hurt anyone, or scare anyone, or scare himself. It had been a long time.</p>\n<p>I love this, Steve thought, as Bucky's knife passed a millimeter away from his ear. He leapt and kicked out at Bucky's chest, and Bucky turned so his foot just missed, grabbing Steve's ankle and slamming him down on the mat. Steve landed on his back, all the air leaving his lungs, and when he tried to roll Bucky was there with his knees on either side of Steve's hips, knife held to Steve's throat.</p>\n<p>Steve lay there, breathing hard, coming back to himself. There was a fine sheen of sweat on the back of his neck and his upper lip, and he felt like he'd run for miles. He felt amazing.</p>\n<p>Bucky stared at him, expressionless, still lost in the Winter Soldier. \"To first blood?\" he asked, voice flat.</p>\n<p>Steve tried to nod, but Bucky's knife wouldn't let him. \"If you like.\"</p>\n<p>Bucky frowned. \"If I like,\" he said, sounding vague and far away. He drew the knife lightly, slowly down Steve's neck, along his chest and over his belly. Steve's whole body lit up and he arched into it, making a surprised, eager sound, everything in him going <i>yes yes yes</i> and <i>please</i>. He gasped, and stared.</p>\n<p>Bucky stopped, the tip of his knife resting just at the waistband of Steve's sweats, and watched Steve, eyes going wide, breath coming faster. Steve felt like the air between them was filled with electricity.</p>\n<p>\"Bucky,\" he said. His dick was hard. He wanted Bucky to run the knife all over his body. He wanted to fight again.</p>\n<p>The sound seemed to shock Bucky, and he leapt off of Steve and ran across the gym before Steve knew what was happening. He was out the door before Steve could get up and follow.</p>\n<p>Steve lay back on the mat, feeling the zing of sensation everywhere that Bucky had touched, feeling his own desire. That was strange and new and uncomfortable. It was wonderful.</p>\n<p>-----</p>\n<p>Steve found Bucky in the kitchen, ladling gumbo into tupperware. His movements were sloppy, angry. When he hear Steve's footsteps on the kitchen tile he froze, one hand over the stockpot. \"I don't want to talk about it,\" he said.</p>\n<p>Steve, whose erection had thankfully gone away between the gym and their apartment, said, \"All right.\" He waited.</p>\n<p>Bucky filled another tupperware container, his ladle clanking against the side of the pot. After a minute, he said, \"Now you gotta admit I came back wrong.\"</p>\n<p>Steve felt like he'd been hit. \"What?\"</p>\n<p>Bucky turned, and Steve flinched at the look on his face. He wasn't angry, he was terrified. \"We were <i>never</i> like that. We tried it, remember? Thirteen, helping a friend out? It was gross.\"</p>\n<p>Steve did remember. He remembered watching other men and thinking, <i>maybe</i>. He remembered lying next to Bucky on Bucky's thin mattress, Bucky's sisters sleeping in the other room, and frantically trying to forget that it was <i>Bucky's</i> hand on his dick, because he was afraid he might never have sex with anyone if it wasn't this one time. He'd gone soft, and so had Bucky, and that had been the end of it.</p>\n<p>But now, oh, now. For a second Steve couldn't breathe, couldn't think, for remembering how good it felt.</p>\n<p>When Steve didn't say anything, Bucky shook his head. \"You remember, I know you do. So it has to be me, there has to be something wrong with me now.\" </p>\n<p>\"And what about me?\" Steve asked. \"I was there. I felt the same thing you did. There isn't anything wrong with you that isn't wrong with me, too.\"</p>\n<p>Bucky's expression went dangerous. \"Yeah, what <i>about</i> you? You spent all those months looking at me like I was the worst thing that ever happened to you, and now this.\"</p>\n<p>Steve shook his head, trying to knock the words out of it. His chest hurt. All this misery Bucky had inside of him, and Steve hadn't been able to help. He was never able to help. \"You're wrong,\" he said. \"I spent months looking at you and thinking, 'What can I do to deserve this? What can I do to make him smile?' Bucky, you are the best thing that has ever happened to me. Every time. I'm sorry I couldn't show you.\"</p>\n<p>\"Not this time, I'm not,\" Bucky said.</p>\n<p>\"Look,\" Steve said, taking a step forward. Bucky jerked back, bumping into the stove, and Steve stopped. \"Look, if you don't want this, that's fine, we can, I don't know. We'll figure something out. I'll still be your friend, if you want. But I,\" he swallowed. \"I just want you to be happy.\"</p>\n<p>Bucky stared at him. \"If I…?\" He bared his teeth. \"When will you fucking get it? I've told you and told you. <i>I'm not him</i>.\"</p>\n<p>And Steve felt angry, suddenly, furious at everything that had broken the both of them, angry that Bucky refused to listen no matter how many times he tried to say it. \"Damn right you're not. And you know what? I'm glad. If I have to be stuck here, if I had to lose <i>everything</i>, my whole world, and die, and come back. I'm glad it's you here with me, not him.\"</p>\n<p>Bucky shook his head. \"You can't, you can't say that.\"</p>\n<p>\"I loved him,\" Steve said. \"He was my brother. He was a part of me. But I am over the moon for you. You have to listen to me, Bucky. We still fit.\" And that was it. That was the drawings, and the fighting, and the evenings in their living room, Bucky's cooking and Steve's running, their nightmares. They still fit, after everything. \"It's different, of course it is. But I promise you,\" he stopped.</p>\n<p>\"What,\" Bucky asked. \"What do you promise?\" He didn't look scared anymore, but Steve couldn't read him.</p>\n<p>\"Anything,\" he said.</p>\n<p>Bucky looked at him and didn't move.</p>\n<p>Steve wanted to hide, all of a sudden. He felt himself go red. \"I mean. I'm not. I don't think I'm doing so well. Maybe you don't want -- you've got friends, now, and I'm --\"</p>\n<p>\"Hey,\" Bucky said, voice soft. \"Hey, be quiet for a minute and let me think.\"</p>\n<p>Steve looked down at his feet. He heard Bucky moving closer, coming around the kitchen island, walking slow like he didn't want to spook anybody. Steve didn't look up when he saw Bucky's feet step into his field of view, just stood there. \"You're not doing so well, huh?\" Bucky asked.</p>\n<p>\"No,\" Steve said. \"I'm not.\"</p>\n<p>\"You're over the moon for me.\" Bucky's voice was still soft.</p>\n<p>\"Yeah,\" Steve told Bucky's feet.</p>\n<p>\"You promised me anything.\"</p>\n<p>\"Yes.\" It was easy to say.</p>\n<p>\"You said you wanted me to be happy,\" Bucky said.</p>\n<p>\"Yes.\"</p>\n<p>\"Ask me what I want.\"</p>\n<p>Steve's head shot up. Bucky was smiling, the gentle sad smile that belonged to the 21st century. He was so beautiful it was almost a surprise. Steve asked, \"What do you want?\" His heart began to pound.</p>\n<p>Bucky put a hand on the side of his neck, and kissed him.</p>\n<p>-----</p>\n<p>Later, after five minutes of sweet, closed-mouth kisses and twenty minutes of hungry biting kisses, after they almost knocked over the freestanding shelf where Bucky kept his fancy copper pots, Bucky pulled back with a regretful look on his face and went to put away the rest of the gumbo. Steve, drunk on touch and the beauty of this new thing, stood close by him while he stuck the tupperware containers in the refrigerator and set the pot in the sink to soak. He pressed against Bucky's back as Bucky scrubbed the cutting board and the ladle. He pushed Bucky's hair away and kissed along the back of Bucky's neck.</p>\n<p>\"Stop that,\" Bucky said. \"A man'll get ideas.\"</p>\n<p>\"What kind of ideas would those be?\" Steve asked, breathing in the smell of Bucky's skin, rubbing his nose behind Bucky's ear.</p>\n<p>\"Keep doing that and find out,\" Bucky said.</p>\n<p>Steve sucked in a breath. \"I want to show you something first.\"</p>\n<p>Steve went to his bedroom and took the small stack of drawings out of his bedside table drawer. He carried them back to the kitchen. Bucky was leaning back against the counter, a dish towel over his shoulder, arms cross. He looked halfway between happy and anxious.</p>\n<p>When he saw the paper in Steve's hands, Bucky's expression changed to exasperated. \"Did you draw more pictures of my arm?\" he asked. \"We could be busy necking, and instead you want to show me pictures of my arm?\"</p>\n<p>\"I -- kind of,\" Steve said. \"Just look at them.\" He pushed the stack at Bucky, who took it, and then retreated to the living room to tuck himself into his squooshy chair.</p>\n<p>The living room was dark and he could see out the giant window Tony had built, over the lights of the city, west toward New Jersey. It was soothing to sit there, and he sank into the softness of the chair and waited for Bucky to come in and talk to him. Maybe it would go wrong. Maybe Bucky would get upset again, or laugh, or say, \"So what?\" But Steve hoped. And he wanted Bucky to know these small, fragile places inside him, before they went any further together.</p>\n<p>Instead, Bucky came into the living room and walked up to the chair, and then folded himself into Steve's lap. His knees were on either side of Steve's thighs and they were facing each other, close as could be. Bucky's face was shadowed, but Steve could tell he was smiling. </p>\n<p>Bucky said, \"These are love letters, Rogers. You've been drawing me love letters.\"</p>\n<p>Steve opened his mouth, and then shut it. \"I guess I have,\" he said, after a minute.</p>\n<p>\"And? What do you want? I already kissed you.\" Bucky's smile grew wider. \"I already know what a goofball you are.\"</p>\n<p>For a second, Steve didn't want to answer. It felt like the last secret he had. Then Bucky huffed at him and bumped their legs together, and the secret wasn't nearly as important as Bucky was. \"I want you to believe me,\" he said.</p>\n<p>Bucky said, \"I'll try my best,\" and leaned in for a kiss.</p>"
}