{
  "id": "17387771",
  "url": "https://archiveofourown.org/works/17387771?view_full_work=true",
  "author": [
    "fatal (cumrich)",
    "jonghyunslisterine"
  ],
  "title": "i glow pink in the night",
  "rating": "Explicit",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "방탄소년단 | Bangtan Boys | BTS"
  ],
  "relationships": [
    "Jeon Jungkook/Park Jimin"
  ],
  "characters": [
    "Park Jimin (BTS)",
    "Jeon Jungkook",
    "Kim Namjoon | RM",
    "Kim Taehyung | V"
  ],
  "additional_tags": [
    "Alternate Universe - College/University",
    "Childhood Friends",
    "Friends to Lovers",
    "Fluff",
    "Smut",
    "Porn With Plot",
    "Mutual Pining",
    "Confessions",
    "Unresolved Sexual Tension",
    "Marking",
    "Making Out",
    "Pool Sex",
    "Semi-Public Sex",
    "Blow Jobs",
    "Oral Sex",
    "Dirty Talk",
    "Anal Fingering",
    "Fingerfucking",
    "Teasing",
    "Felching",
    "Snowballing",
    "Come Eating",
    "Anal Sex",
    "Barebacking",
    "Rimming",
    "Multiple Orgasms",
    "Overstimulation",
    "Dry Orgasm",
    "Park Jimin Is A Cockslut",
    "Jeon Jungkook Is a Public Safety Concern",
    "Minor Kim Taehyung | V/Min Yoongi | Suga"
  ],
  "language": "English",
  "series": "",
  "published": "2019-01-12",
  "completed": null,
  "words": "19,064",
  "chapters": "1/1",
  "comments": "189",
  "kudos": "12,692",
  "bookmarks": "3,778",
  "hits": "253,185",
  "summary": "<p>jimin expects his summer to go by like any other: he hangs out with his friends, lazes around, and enjoys the heat. too bad he didn’t factor in jeon jungkook.</p>",
  "notes": "<p>\n<b>DO NOT REPOST OR TRANSLATE</b>\n</p>\n<p> </p>\n<p>title from mitski's pink in the night!</p>\n<p>here's to the first of many cumlisterine projects to come &gt;:)</p>",
  "text": "<p>Life, Jimin thinks, is a bitch.</p>\n<p> </p>\n<p>One moment you’re a young, confident gay, and the next you’re spilling the contents of your beer all over yourself because you’ve walked right into the couch while gawking at your best friend’s younger brother. You know, the one you thought was really cute but in the he’s-like-a-younger-brother-to-me-too way.</p>\n<p> </p>\n<p>“This is tragic even for you,” Taehyung says, staring at Jimin but offering no help. Not that Jimin would know how to take it. His brain’s short-circuiting at the sight of Jungkook. A minute ago, he was a functioning member of society, and now he’s potentially forgotten his own name.</p>\n<p> </p>\n<p>“What the fuck.”</p>\n<p> </p>\n<p>Taehyung follows his line of vision and gives a low whistle. “You’re staring like you’ve never seen abs before.”</p>\n<p> </p>\n<p>“He has a fucking <em>sixteen</em> pack or something! What fucking alternate timeline are we <em>in</em>?”</p>\n<p> </p>\n<p>Jimin’s shirt is soaked through with beer, but he can’t muster up the attention span to care. He’s just gaping.</p>\n<p> </p>\n<p>Jungkook’s...nothing like what Jimin remembers. He’d only seen him last summer, when everyone had come home and they’d hung out in usual summer custom. Jimin remembers him as kind of gangly, a kid still trying to fill out of his body, and <em>boy</em> has he filled it out.</p>\n<p> </p>\n<p>He has <em>tattoos</em> now. And possibly the hottest body Jimin has ever seen in his life.</p>\n<p> </p>\n<p>“Do you need me to get you a bib and wipe your drool? This is really not your best look.”</p>\n<p> </p>\n<p>“Oh my god, shut up,” Jimin snaps, glaring at Taehyung. He’s thankful he’s not staring at Jungkook anymore, but his eyes kind of just drift right back. It’s a lot to take in. Jungkook had surpassed Jimin height-wise in high school but somehow, with all the added muscle, he looks even taller. He almost can’t believe his eyes.</p>\n<p> </p>\n<p>Jimin can make out every line of Jungkook’s abs, his shoulders broader than Jimin remembers. He’s thicker everywhere; the fleeting thought of being crushed between his thighs passes through Jimin’s mind before being replaced by the sheer size of Jungkook’s biceps. His right forearm is covered in ink, and despite Jimin’s contacts, he can’t quite make out what the tattoo is. He’s even got little black gauges and a gold nose piercing.</p>\n<p> </p>\n<p>Jimin’s mouth has gone dry.</p>\n<p> </p>\n<p>It’s not like Jimin hasn’t seen a big, buff guy before. He goes to the gym, he’s seen plenty, and some of them are even bigger than Jungkook. But for some reason, he can’t wrap his head around Jungkook’s sudden transformation. There’s almost this disconnect, like Jungkook wasn’t supposed to get all big and buff and look so grown up.</p>\n<p> </p>\n<p>“If you’re done creaming your pants, Joonie-hyung is headed over so maybe, I dunno, stop checking out his little brother,” Taehyung informs him, his mildly amused look transforming into a full-on smile as Namjoon approaches them.</p>\n<p> </p>\n<p>Jimin scowls at Taehyung but it’s easily ignored, and he turns his attention to Namjoon, who’s finally wandered down from his room. He quirks an eyebrow at the mess on Jimin’s shirt, reaching to hug Taehyung.</p>\n<p> </p>\n<p>“You guys made it!” Namjoon grins, arm draping over Taehyung’s shoulders.</p>\n<p> </p>\n<p>“Shouldn’t we be saying that to you? Why’ve you been holed up in your room?” Jimin asks, giving Namjoon a quick side hug.</p>\n<p> </p>\n<p>“Mum called,” Namjoon explains, glancing across his living room. He waves Jungkook over. “She doesn’t know about this party.”</p>\n<p> </p>\n<p>“Of course not,” Taehyung laughs, giving Jimin a look that he’s too late interpreting because before Jimin knows it, Jeon Jungkook is standing next to him, a happy grin on his too-handsome face. Jimin can feel the heat in his cheeks as he tries not to stare.</p>\n<p> </p>\n<p>“Hey guys,” Jungkook smiles, brows raising in concern as he takes in Jimin’s soaked shirt. Great. Now Jungkook would remember him as the loser with beer spilled all over himself. “You okay, Jiminie-hyung?”</p>\n<p> </p>\n<p>“He’ll be fine,” Taehyung answers in Jimin’s stead, waving a hand dismissively over at him. Jimin narrows his eyes at his best friend, a little mortified as he realises that his shirt is starting to cling to his abdomen. “But, wow, look at you, huh.”</p>\n<p> </p>\n<p>“Jungkookie’s a muscle pig now,” Namjoon laughs, reaching out to ruffle Jungkook’s carefully tousled hair. Jungkook scowls at his brother, slapping his hand away and ends up standing even closer to Jimin. This close, Jimin can see the sheen of sweat beginning to build up against Jungkook’s skin from the heat. His eyes try to find somewhere to look except he can’t because <em>holy shit</em>, Jungkook has his nipples pierced.</p>\n<p> </p>\n<p>Jimin almost groans out loud.</p>\n<p> </p>\n<p>“Hyung, come on,” Jungkook whines, attempting to fix whatever he thinks Namjoon has ruined.</p>\n<p> </p>\n<p>“Yeah, yeah,” Namjoon says with a roll of his eyes. “You’re too cool for me now, huh? Just because you can bench press — ”</p>\n<p> </p>\n<p>“You weren’t complaining when I was lugging the Library of Alexandria from your room down to the basement.”</p>\n<p> </p>\n<p>Namjoon has the decency to fluster a little at Jungkook’s quip. “Where did the Jungkook who followed me around everywhere go?”</p>\n<p> </p>\n<p>“Welcome to old age, hyung,” Jimin grins, reminded of his own little brother at Jungkook’s sass. “We’re not cool enough for our brothers now.”</p>\n<p> </p>\n<p>“They grow up so fast,” Taehyung sighs, a hand to his chest. He wipes some imaginary tears from his eyes, and Jungkook only scowls at that, rolling his eyes at their antics.</p>\n<p> </p>\n<p>“I’m only two years younger than you,” he retorts, but it lands on deaf ears, Namjoon laughing as he reaches forward to pinch Jungkook’s cheek. His hand gets swatted away before it makes contact, Jungkook’s eyes narrowed in defense.</p>\n<p> </p>\n<p>“Aw, stop picking on him,” Jimin says, coming to Jungkook’s defense despite the way his breath lodges in his throat when Jungkook smiles at him directly. He looks away immediately, pulling at his shirt so it stops sticking to his skin.</p>\n<p> </p>\n<p>“Lemme go get you a new shirt?” Namjoon offers, pointing at Jimin’s situation, but before he can make it one step away, Jungkook’s butting in.</p>\n<p> </p>\n<p>“I can get it!” he interrupts, already bounding off toward the stairs. Jimin’s eyes widen at the tiger tattoo he sees etched along Jungkook’s back, the vibrant colours bringing the tiger to life. He’d managed to make out the black and white snake wrapped around Jungkook’s forearm when he’d come over, pretty flowers hiding its winding body amongst them.</p>\n<p> </p>\n<p>There’s a loud yell from one of the other rooms and Namjoon’s head whips in the direction like an antelope's before he’s excusing himself to go see what the commotion is about. Jimin very purposefully ignores the smirk Taehyung gives him, eyebrows waggling suggestively.</p>\n<p> </p>\n<p>“So,” he drawls, leaning in closer to Jimin. “Got yourself a little crush there, huh, Jiminie.”</p>\n<p> </p>\n<p>“Fuck off,” Jimin mutters, shoving Taehyung roughly as he heads over to the stairs, Taehyung’s laughter following him.</p>\n<p> </p>\n<p>Jimin hardly makes it two steps up the stairs before Jungkook’s bounding down, a white t-shirt in hand. He’s still decidedly shirtless himself, and Jimin has to avert his attention to the beige paint along the staircase wall so he doesn’t hone in on Jungkook’s nipple piercings.</p>\n<p> </p>\n<p>“Oh, hyung,” Jungkook starts, pausing where he’s standing. “I was gonna come get you. Thought maybe you’d wanna change upstairs.”</p>\n<p> </p>\n<p>Jimin swallows and offers Jungkook the best smile he can muster. “That’s a good idea, Jungkookie.”</p>\n<p> </p>\n<p>Jungkook’s smile tinges pink at the nickname, but he’s turning back toward his room. Jimin follows him up the stairs, all the doors closed to ward off any wayward partygoers.</p>\n<p> </p>\n<p>Jimin pulls at his shirt again, grimacing at the stickiness. He’d have to wash off the beer before changing into the t-shirt. Jungkook leads him to his room, the music downstairs slowly fading with each step forward. For some reason, Jimin feels like his heart is going to burst out of his chest.</p>\n<p> </p>\n<p>He’s been to Jungkook’s room a handful of times, but growing up Jungkook had been shy and a little broody, wanting to be left alone when he disappeared into his room. Jimin remembers the room being fairly neat; he was always a little embarrassed that someone two years younger than him had a cleaner room than his own.</p>\n<p> </p>\n<p>Jungkook pauses in the middle of his room. Jimin’s eyes are fixed to the tattoo on his back, his head whipping in the other direction when Jungkook turns to look at him. He stares very hard at the TV Jungkook’s set up in the corner of his room, PS4 and XBox hooked up to it.</p>\n<p> </p>\n<p>“You can give me the, uh, dirty shirt, hyung. I’ll run it through the wash for you.”</p>\n<p> </p>\n<p>Jimin’s eyes widen, and he shakes his head. “Oh my god, no, it’s okay Jungkook! You don’t — ”</p>\n<p> </p>\n<p>“I don’t mind,” Jungkook interrupts, smiling. He holds the t-shirt out to him, and Jimin doesn’t miss the onceover he gives him, smile turning a little smug. “You should be more careful, hyung. Isn’t this your favourite shirt?”</p>\n<p> </p>\n<p>“It’s just beer,” Jimin grumbles, snatching the t-shirt out of Jungkook’s hand. Jimin huffs as he turns down the hallway, heading to the bathroom. His cheeks burn, a little shocked that Jungkook knew he was wearing his favorite shirt.</p>\n<p> </p>\n<p>He spends a good five minutes in the bathroom wiping beer off of himself, his soiled shirt laid down on the counter. Jungkook’s t-shirt is too big on him, and it makes something squirm in his gut, unable to look himself in the eye. He hurries out of the bathroom, door swinging open, and nearly yelps.</p>\n<p> </p>\n<p>“Fuck!” Jimin hisses, hand clutching his chest. “You scared me.” He’d expected Jungkook to have wandered back down but instead finds him loitering outside of the bathroom.</p>\n<p> </p>\n<p>Jungkook laughs, reaching for the shirt in Jimin’s hand. He smiles, doe eyes sharpening into something that makes Jimin’s mouth run dry.</p>\n<p> </p>\n<p>“Jungkook — ” Jimin starts, trying to take the shirt back, but it’s pointless. Jungkook’s already walking toward the stairs with it in hand.</p>\n<p> </p>\n<p>“Cute,” Jungkook says, looking back over his shoulder at Jimin, eyes scanning Jimin up and down. Then he disappears down the stairs, and a horribly satisfying heat blooms in Jimin’s cheeks.</p>\n<p> </p>\n<p align=\"center\">☀</p>\n<p> </p>\n<p>Of the countless ways to start the morning, falling on his ass because Kim Taehyung’s a bed hog has to be Jimin’s least favorite.</p>\n<p> </p>\n<p>He wakes up with a groan and a thump, bringing half the blanket with him. Taehyung mumbles sleepily and snatches the blanket back, sending Jimin rolling onto his front. He lies there for a long moment, contemplating his existence, before he finally pushes himself to his feet. Yawning, Jimin stretches until his back cracks and rubs his eyes.</p>\n<p> </p>\n<p>He could probably get to the kitchen with his eyes closed, he’s been here so many times, and that’s pretty much what he does. In between yawns and scratching his tummy, he stumbles toward the kitchen with his eyes drooping. He could have slept at least another two hours if it weren’t for his useless best friend.</p>\n<p> </p>\n<p>He’s so out of focus that he doesn’t realise the kitchen isn’t empty until he walks right into something very solid and very warm.</p>\n<p> </p>\n<p>Jimin squeaks, eyes flying open as he stumbles back. There are arms around his waist before he can fall — big, strong arms — and a quiet laugh to accompany them. It’s Jungkook in all his bare-chested, tatted glory, and Jimin’s heart goes <em>boom, boom</em> then stutters to a complete stop. As if he hadn’t admired him enough the day before, Jimin finds himself admiring him again, the V of his hips and strong planes of his chest and his <em>biceps</em> —</p>\n<p> </p>\n<p>“You’re up early,” Jungkook says.</p>\n<p> </p>\n<p>“Um — ” Jimin starts, blushing all the way to his ears. He can’t form a coherent answer and it’s all Jungkook’s fault. Catching someone is usually followed by letting them go afterward, but here Jungkook is, his arms still wrapped firmly around Jimin’s waist. There isn’t a lot of space between them; Jimin can feel the heat of his body acutely. “I, uh — ”</p>\n<p> </p>\n<p>“Everyone else still asleep?”</p>\n<p> </p>\n<p>Not trusting himself to speak, Jimin nods.</p>\n<p> </p>\n<p>“You looking for breakfast?”</p>\n<p> </p>\n<p>Jimin wonders if he keeps asking questions precisely because Jimin seems to be incapable of answering them. Jungkook stares down at him, waiting, his eyes sparkling with amusement. So he thinks this is <em>funny</em>. Jimin huffs, suddenly annoyed. “Just wanted some water.”</p>\n<p> </p>\n<p>Jungkook finally lets him go, and Jimin can breathe again. He pulls two glasses from a cabinet, and Jimin admires the way the muscles of his back shift when he reaches up, admires his tiger tattoo that moves with him. Jungkook fills the glasses with water from the fridge and opens the door, squinting inside. The gold of his nose piercing glints in the light, and Jimin finds himself admiring it, too.</p>\n<p> </p>\n<p>“You sure you don’t want breakfast? We’ve got some stuff in here.”</p>\n<p> </p>\n<p>“I’m okay, thanks.”</p>\n<p> </p>\n<p>Jungkook shrugs and hands him his water. Their fingers brush when Jimin takes it. He leans against the counter opposite Jimin and sips on his own.</p>\n<p> </p>\n<p>“Aren’t you gonna put on a shirt?” Jimin blurts, then mentally smacks himself on the head.</p>\n<p> </p>\n<p>A grin spreads across Jungkook’s face.</p>\n<p> </p>\n<p>“I mean, it’s kinda cold, aren’t you cold — ”</p>\n<p> </p>\n<p>“It’s not really that cold. Anyway, if I’m cold, you probably are too.” He glances pointedly down at Jimin’s tiny sleep shorts.</p>\n<p> </p>\n<p>Jimin crosses his legs self-consciously. “Not cold,” he mutters.</p>\n<p> </p>\n<p>“So how have you been?” Jungkook asks, peering at him with genuine curiosity. “We haven’t talked in a while. How’s school?”</p>\n<p> </p>\n<p>“Stressful,” Jimin sighs. “Too much work. But I guess it’ll be worth it eventually. What about you?”</p>\n<p> </p>\n<p>“You know, same old. Things are the same as always.”</p>\n<p> </p>\n<p>Jimin eyes him up and down. “Not really the same.”</p>\n<p> </p>\n<p>“Not all the same.” Jungkook smiles and shrugs in acknowledgement. “I missed you, Jiminie-hyung.”</p>\n<p> </p>\n<p>Jimin finds himself blushing at the admission, at how easily it’s given. He’d always been closer to Namjoon growing up, but he’d doted on Jungkook, loved how cute and shy he always was and how he tried to hide it behind aloofness. Jungkook was a good kid. <em>Is</em> a good kid, though Jimin isn’t sure how to fit this new Jungkook in with the one he’s always known.</p>\n<p> </p>\n<p>Jungkook doesn’t seem to be worried about an answer. He moves and suddenly he’s coming right toward Jimin, eyes fixed on him and Jimin freezes, his stomach doing flip-flops that make him woozy —</p>\n<p> </p>\n<p>Jungkook leans past him to grab something. His chest brushes Jimin’s, and Jimin gets an eyeful of the tendons in his neck and his smooth collarbones. He swallows harshly.</p>\n<p> </p>\n<p>“Morning,” comes Taehyung’s sleepy voice.</p>\n<p> </p>\n<p>Jungkook pulls away. He’s holding a napkin, and Jimin bristles. He’s only drinking water, he didn’t need to do all that for a damn napkin.</p>\n<p> </p>\n<p>“‘M hungry,” Taehyung slurs. “Can you guys stop flirting and get me some breakfast?”</p>\n<p> </p>\n<p>“Flirting,” Jimin splutters, but Jungkook just rolls his eyes. “We weren’t — ”</p>\n<p> </p>\n<p>“Yeah, yeah.” Taehyung waves him off, clearly unconcerned. He runs a hand through his bedhead and only proceeds to mess it up further. “Breakfast, Jungkookie.”</p>\n<p> </p>\n<p>“Get it yourself,” Jungkook grumbles. “Like you don’t always raid the fridge anyway.”</p>\n<p> </p>\n<p>“Yah, you brat,” Taehyung complains, but he still moves for the fridge.</p>\n<p> </p>\n<p>“I’m going back to sleep,” Jimin huffs, marching out of the kitchen. He’s still flustered. “Taehyung, you’re not allowed in the bed anymore!” he calls over his shoulder.</p>\n<p> </p>\n<p>“Try and stop me!” Taehyung shouts back, and Jimin hears Jungkook laugh before he turns the corner into the hallway and drowns them out.</p>\n<p> </p>\n<p align=\"center\">☀</p>\n<p> </p>\n<p>“I think we’re being too loud,” Jimin giggles into his coffee, glancing away from the girl sitting two tables down with her textbook out. She’d been staring at them a second ago.</p>\n<p> </p>\n<p>“Anyone who looks is just jealous that we’re having so much fun,” Taehyung says sagely. He takes a haughty sip of his coffee for emphasis. It’s barely even coffee, just some milky concoction with too much syrup because Taehyung has picky taste buds.</p>\n<p> </p>\n<p>“Jimin-ah,” Namjoon wheedles, “Can I have a bite of your cake? Please?”</p>\n<p> </p>\n<p>Jimin sighs and pushes his plate across the table, Namjoon’s dimples making an instant appearance. “I told you to get a slice.”</p>\n<p> </p>\n<p>“I know,” he mumbles through a bite.</p>\n<p> </p>\n<p>“I said you’d want some, what did I say?”</p>\n<p> </p>\n<p>“You said I’d want one,” he acknowledges, chastised. Then he takes another bite.</p>\n<p> </p>\n<p>“Nobody ever listens to me,” Jimin says.</p>\n<p> </p>\n<p>“Okay, Mom, we get it,” Taehyung grins. He nudges him, smile turning wicked. “Or should I say, <em>Mommy</em>?”</p>\n<p> </p>\n<p>“Yah!” Jimin shrieks, elbowing him in the ribs. Taehyung chokes on his coffee, spluttering, and Namjoon bursts into laughter. The girl two tables down glares at them.</p>\n<p> </p>\n<p>Namjoon sobers. “Maybe we should go back to my place.”</p>\n<p> </p>\n<p>His place. Namjoon’s place which Jimin has frequented a multitude of times since he was a kid. Namjoon’s place which also happens to contain a now very grown-up Jungkook. Jimin blushes bright red on instinct, burying his face in his coffee mug in the vain hope that no one will notice.</p>\n<p> </p>\n<p>“Oh, good idea,” Taehyung says. “Only if we get to binge anime on your big ass TV.”</p>\n<p> </p>\n<p>“We are <em>not</em> watching anime,” Namjoon groans.</p>\n<p> </p>\n<p>“Fine,” Taehyung sniffs. “I’ll just make Jungkook watch with me. Is he home?”</p>\n<p> </p>\n<p>“He should be.”</p>\n<p> </p>\n<p>Jimin makes some kind of unintentional noise into his mug that has them both looking over at him. He peeks at them over the rim. “I don’t feel like moving. Let’s stay here.”</p>\n<p> </p>\n<p>Namjoon tilts his head and Taehyung narrows his eyes. “I dunno, we’re being kind of annoying,” Namjoon says.</p>\n<p> </p>\n<p>“Just because Taehyung can’t stop kinkshaming me in public — ”</p>\n<p> </p>\n<p>“I’m not shaming you, I’m just <em>saying</em> — ”</p>\n<p> </p>\n<p>“What’s wrong with my place?” Namjoon says, lips twisting in confusion.</p>\n<p> </p>\n<p>“There’s nothing wrong with your place,” Jimin assures quickly.</p>\n<p> </p>\n<p>Taehyung stares at him for half a minute before a metaphorical light bulb goes off over his head. Then a sly grin spreads across his face. “Oh, I get it.”</p>\n<p> </p>\n<p>“No, you don’t,” Jimin hisses, turning a murderous glare on Taehyung that he’s impervious to. He just keeps on grinning.</p>\n<p> </p>\n<p>“Get what?” Namjoon says, glancing between them.</p>\n<p> </p>\n<p>“Jimin doesn’t want to go to your place — ”</p>\n<p> </p>\n<p>“Kim Taehyung, you better shut your damn mouth.”</p>\n<p> </p>\n<p>“ — because he’s got a big, fat crush on Jungkookie.”</p>\n<p> </p>\n<p>Namjoon blinks, then his eyes widen in understanding, mouth shaping an <em>oh</em>.</p>\n<p> </p>\n<p>“I do not have a fucking crush on Jungkook,” Jimin seethes, wrapping an arm around Taehyung’s neck and yanking him in to destroy his neatly-set hairstyle.</p>\n<p> </p>\n<p>Taehyung doesn’t seem to mind, giggling as he squirms in his chokehold. “You wanna suck his soul out through his dick, admit it.”</p>\n<p> </p>\n<p>Namjoon’s face melts into disgust. “Hey, that’s my little brother you’re talking about. Can it.”</p>\n<p> </p>\n<p>Jimin shoves Taehyung away and slouches in his seat, crossing his arms over his chest. “Yeah, Taehyung, can it.”</p>\n<p> </p>\n<p>Namjoon’s sharp attention turns immediately to Jimin. “You really have a crush on him?”</p>\n<p> </p>\n<p>Jimin looks away, lips twisting. “I don’t know,” he mumbles honestly, and he really doesn’t know what to do with the way his heart goes wild every time he so much as thinks about Jungkook.</p>\n<p> </p>\n<p>Chin in hand, Namjoon hums in interest. There’s something calculating about the look in Namjoon’s eyes that Jimin doesn’t like. “Makes sense,” he finally says. “He’s always been your favourite.”</p>\n<p> </p>\n<p>“Hey,” Taehyung complains. “I’m supposed to be his favourite.”</p>\n<p> </p>\n<p>“Look, we all want to be Jiminie’s favourite, but it’s pretty clear that spot belongs to Jungkookie.”</p>\n<p> </p>\n<p>Jimin grumbles, even if he knows that’s a little bit true. “Can we move on from this topic of conversation now?”</p>\n<p> </p>\n<p>Namjoon reaches across the table to pet Jimin’s hair a little patronizingly. “Poor Jiminie,” he coos. “So we’re going back to my place then.”</p>\n<p> </p>\n<p>Jimin drops his head onto the table.</p>\n<p> </p>\n<p align=\"center\">☀</p>\n<p> </p>\n<p>Jimin’s staring down at his scruffed-up sneakers when the door swings open. He smiles, glancing up, expecting to see Namjoon. Instead, he’s met with a decidedly bare chest and two big, doe eyes, the corners crinkling up as Jimin’s smile is returned.</p>\n<p> </p>\n<p>“Jimin-ssi,” Jungkook greets, leaning against the door jam, biceps flexing as he crosses his arms over his chest. Jimin’s brain goes offline.</p>\n<p> </p>\n<p>“Uh,” he offers intelligently, blinking several times. His brain seems to take its time getting back online. “Jungkook.”</p>\n<p> </p>\n<p>Jungkook laughs, the sound bright and happy, and it makes something hot twist in Jimin’s belly, heat rising to his cheeks. “That’s my name.”</p>\n<p> </p>\n<p>Jimin flushes, head ducking as he gathers his wits. “Uh, I — Namjoon-hyung’s not home? We were supposed to hang out.”</p>\n<p> </p>\n<p>Jungkook shakes his head, straightening up, arms falling back down to his sides. Jimin does his best not to stare at his perfectly sculpted pecs or the metal bars pierced through his nipples. “Hyung left a little while ago with Tae-hyung.”</p>\n<p> </p>\n<p>“Oh.” Jimin deflates, shoulders drooping, head ducking. He hadn’t even been late, having left his house with plenty of time to make it over to Namjoon’s.</p>\n<p> </p>\n<p>“You wanna come inside, hyung?”</p>\n<p> </p>\n<p>Jungkook’s voice has an edge of concern laced through it as he shuffles a little closer. It forces Jimin to look back up and he’s about to take a step back, not wanting to bother Jungkook — especially not with all his confusing feelings already in the array — when Jungkook’s hand wraps around his wrist. His skin is warm and smooth, hand larger than Jimin’s own.</p>\n<p> </p>\n<p>“I don’t — ”</p>\n<p> </p>\n<p>“Come on hyung, we haven’t hung out in a while,” Jungkook smiles, already pulling Jimin into the house. Jimin lets himself be tugged inside, slipping his shoes off with Jungkook’s hand still wrapped around his wrist. It’s like Jungkook thinks he’s going to run off. And maybe he’s not wrong.</p>\n<p> </p>\n<p>Jimin’s heart is beating so fast he thinks it’s going to burst out of his chest.</p>\n<p> </p>\n<p>“A-are you sure?” Jimin finally asks, biting on his bottom lip, but Jungkook’s guiding him toward the living room, a smile spread over his features. He’s handsome in a way Jimin’s always known him to be — doe eyes, prominent nose, sharp jaw — but he’s grown into his features, has a maturity to his face he didn’t have even a year ago.</p>\n<p> </p>\n<p>Jimin swallows, tries his best not to think about how Jungkook still hasn’t let him go. <em>You really have a crush on him?</em> Namjoon’s words echo through his head.</p>\n<p> </p>\n<p>Did he? Was that what this was? Somehow it felt wrong in as much as it felt right, Jimin’s belly flip-flopping.</p>\n<p> </p>\n<p>“I was gonna marathon <em>FMA</em>, you in?” Jungkook asks, looking over his shoulder. He’s got a little setup in front of the TV, junk food of every variety waiting for him.</p>\n<p> </p>\n<p>“The original or <em>Brotherhood</em>?” Jimin asks as he settles down onto the couch next to Jungkook, careful to leave space between them. He’s finally let go of Jimin’s wrist and Jimin ignores the pang of loss, the way his skin feels emptied.</p>\n<p> </p>\n<p>“The original. I haven’t rewatched it since high school,” Jungkook says, grabbing his laptop to start playing the anime.</p>\n<p> </p>\n<p>“Good to know you’re still a weeb,” Jimin grins cheekily, laughing when Jungkook only rolls his eyes at him, a smile tugging at the corners of his lips.</p>\n<p> </p>\n<p>“Takes one to know one.”</p>\n<p> </p>\n<p>“Hey,” Jimin whines, reaching out to smack at Jungkook’s shoulder. He flushes a second later, avoiding the way Jungkook’s grin grows bigger.</p>\n<p> </p>\n<p>Jimin’s phone vibrates in his pocket and he digs it out, a text from Taehyung lighting up the screen: <em>enjoy ur date</em></p>\n<p> </p>\n<p>His eyes widen and he immediately turns the screen off, shooting a quick glance at Jungkook but he’s busy stuffing his face with shrimp crackers, the intro to <em>Fullmetal Alchemist</em> playing on the big screen TV.</p>\n<p> </p>\n<p>Jimin’s hand grips his phone a little tighter, a sudden burst of annoyance rushing through him. So they’d left on purpose? Those assholes!</p>\n<p> </p>\n<p>He sneaks a look over at Jungkook, cheeks heating and how is he supposed to focus on anything when Jungkook’s just sitting there, <em>shirtless</em>.</p>\n<p> </p>\n<p>“Do you have some kinda vendetta against clothes?” Jimin asks eventually, tired of trying to fight his own blush. What was so flustering about seeing Jungkook shirtless anyways? He huffs to himself, dutifully ignoring Jungkook.</p>\n<p> </p>\n<p>“It’s hot,” Jungkook counters, shoulders shrugging, but he’s smirking knowingly. Jimin rolls his eyes, arms crossing over this chest. Somehow they’ve ended up sitting closer on the couch, Jungkook slouching low in his seat.</p>\n<p> </p>\n<p>For as long as Jimin can remember, he’s known Namjoon and Jungkook. He’s lucky, having the kind of friendships he has. There’s a comfort in familiarity that you can’t find in anything else. And perhaps that’s what this is. That Jungkook’s transformation was somehow jarring to everything Jimin has always known about Jungkook. He’s always spoiled Jungkook, always coddled and annoyed him because that was really the only way to show Jungkook his love, his affection. Jungkook’s shyness had always been endearing.</p>\n<p> </p>\n<p>He’s seen Jungkook grow up, but then Jungkook’s seen him grow up, too.</p>\n<p> </p>\n<p>Jimin doesn’t know what to with that realisation.</p>\n<p> </p>\n<p>“Hyung, the remote — ”</p>\n<p> </p>\n<p>Jimin’s about to reach for it and hand it to Jungkook but he never gets the chance, heart lodging in his throat as Jungkook leans over him, the heat from his skin sinking into Jimin. They’re so close, Jungkook’s weight settles against Jimin’s chest. He grabs the remote teetering on the edge of the armrest by Jimin, grinning as he pulls back.</p>\n<p> </p>\n<p>Jimin sucks in a shuddering breath, eyes narrowing. That was <em>definitely</em> not necessary.</p>\n<p> </p>\n<p>He doesn’t know how to recover, wondering what it was about Jungkook that left him so completely unravelled. Normally, Jimin was the one leaving guys tongue-tied and flustered.</p>\n<p> </p>\n<p>Jimin tugs on the bottoms of his shorts, the material having risen up to expose most of his thigh. He doesn’t miss the way Jungkook glances over at him, heat sinking into his belly as his chest tightens.</p>\n<p> </p>\n<p>“Did — did Joonie-hyung say when they were gonna head back?”</p>\n<p> </p>\n<p>Jungkook shrugs a shoulder, “Never asked.” His voice sounds a little tight.</p>\n<p> </p>\n<p>“Are you sure,” Jimin starts, licking his lips. “Are you sure you wanna hang out with me?”</p>\n<p> </p>\n<p>He’s not even sure why he’s asking since Jungkook had been the one to pull Jimin inside but Jimin’s good at panicking over things and ruining them for himself. Also, maybe he’s looking for a reason to leave, everything feeling like just a little too much.</p>\n<p> </p>\n<p>“Why wouldn’t I want to hang out with you?” Jungkook asks, brows knit together in confusion. He pulls himself up, body angled toward Jimin.</p>\n<p> </p>\n<p>“I dunno,” Jimin mumbles, staring down at his hands in his lap. “Sorry, I...”</p>\n<p> </p>\n<p>“I, um, love hanging out with you.” Jungkook’s cheeks are tinged pink as he says the words, shoulder brushing against Jimin’s as he shuffles a little closer. “I really mean it, you know. I missed you, hyung.”</p>\n<p> </p>\n<p>Jimin’s mouth goes dry and he gives Jungkook a jerky nod, suddenly afraid of what might come out of his own mouth. His fingers twist into his t-shirt and he looks over at Jungkook, well aware of the heat in his cheeks.</p>\n<p> </p>\n<p>“I missed you, too.”</p>\n<p> </p>\n<p>And he had. He’d missed how easy it always was to come back home and fall into the summer groove with his friends and with Jungkook.</p>\n<p> </p>\n<p>“Let’s make ramen,” Jimin suggests, standing up, a little startled by the fond look Jungkook’s sending his way. “I’m hungry.”</p>\n<p> </p>\n<p>“Sit,” Jungkook instructs, grabbing Jimin’s wrist again and tugging him down. “I’ll make it.”</p>\n<p> </p>\n<p>“I can — ”</p>\n<p> </p>\n<p>“Hyung, I’ll make it. I know how you like it.”</p>\n<p> </p>\n<p>“Oh, really? You know how I like it?”</p>\n<p> </p>\n<p>Jungkook grins at him as he heads toward the kitchen. “I’ve always known.”</p>\n<p> </p>\n<p>Jimin watches him disappear, eyes roaming over the ink painted onto his back, a simmering warmth flooding his chest. Maybe it was a crush. Maybe it had always been a crush.</p>\n<p> </p>\n<p align=\"center\">☀</p>\n<p> </p>\n<p>Jimin had thought that after hanging out with Jungkook solo for an entire afternoon, seeing him again would be a little easier.</p>\n<p> </p>\n<p>But apparently his ridiculous heart has something else to say about the matter.</p>\n<p> </p>\n<p>He’s out walking Shiro because his brother’s a lazy ass and didn’t want to wake up, but Shiro had been whining pitifully by the door. Jimin loves Shiro, so he doesn’t mind taking over some of his responsibilities but he’s beginning to think Jihyun’s just taking advantage of him.</p>\n<p> </p>\n<p>So he’s out walking, minding his own business, whistling in the cool morning air when he sees someone jog down the sidewalk toward him. His eyes zero in on the guy’s chiseled abdomen, his sculpted pecs, the top of a skull tattoo peeking over his shorts and —</p>\n<p> </p>\n<p>Fuck. Jimin knows that tattoo.</p>\n<p> </p>\n<p>“Hyung,” Jungkook calls, pulling his headphones out to drape them over his neck. He lifts his hand in a wave and Jimin very pointedly doesn’t look at the sweat collecting between Jungkook’s tiddies, glistening in the sun.</p>\n<p> </p>\n<p>Except, well, he can’t not stare and Jimin thinks he’s going to <em>die</em> if he doesn’t get to suck Jungkook’s dick.</p>\n<p> </p>\n<p>“Hey,” Jimin says, waving back, hoping his voice doesn’t actually sound as squeaky as he thinks it does. Shiro barks, straining at the leash, and Jimin reins him in.</p>\n<p> </p>\n<p>Jungkook slows down as he nears, eyeing Shiro with delight, his eyes wide and happy. “Hey, buddy,” he coos, dropping to a crouch and holding his hand out for Shiro to sniff.</p>\n<p> </p>\n<p>Shiro is notorious for hating strangers. He’d even taken a while to grow comfortable around Jimin, especially since Jimin was always back and forth for university. Shiro takes the guard dog nature of Jindos to the next level; they have to put him outside every time they have guests. Jimin’s about to warn Jungkook to back off when Shiro nuzzles his face into Jungkook’s palm and Jimin’s left gaping.</p>\n<p> </p>\n<p>“You’re so pretty,” Jungkook coos. “What a good boy.”</p>\n<p> </p>\n<p>Jimin coughs past the sudden something in his throat, his face hot. “At least you have an excuse today.”</p>\n<p> </p>\n<p>Jungkook peers up at him curiously. “For what?”</p>\n<p> </p>\n<p>“For not wearing a shirt,” Jimin grumbles, and Jungkook grins.</p>\n<p> </p>\n<p>“I always have an excuse. It’s summer.” He drops onto his ass to play with Shiro properly, stretching his legs out. His shorts ride up his thick thighs and Jimin pretends his mouth doesn’t water up. Jimin’s never noticed before, but he has another tattoo on the top of his shoulder — a list of dates. “What’s his name?”</p>\n<p> </p>\n<p>“Shiro.”</p>\n<p> </p>\n<p>“Don’t tell me you named your dog after <em>Voltron</em>,” Jungkook says in disbelief.</p>\n<p> </p>\n<p>“I didn’t!” Jimin exclaims, holding his palms out in defense.</p>\n<p> </p>\n<p>Jungkook peers at him with narrowed eyes, as if gauging whether he’s telling the truth or not. Then he nods. “When did you get a dog?” He pats Shiro’s side affectionately. He’s got his phone in a strap around his bicep, and it tightens with the movement. Jimin licks his lips.</p>\n<p> </p>\n<p>“He’s Jihyun’s. I’m just walking him today.”</p>\n<p> </p>\n<p>Shiro plops down onto his belly, resting his head on Jungkook’s lap and Jungkook laughs in delight, scratching Shiro’s head. “I love him.”</p>\n<p> </p>\n<p>“I think he loves you, too,” Jimin says, settling down next to them with his legs crossed. The sidewalk’s wide enough that he isn’t worried about blocking anyone’s way.</p>\n<p> </p>\n<p>Jungkook glances up, something intense about his gaze. “Think so?” he asks, and somehow Jimin feels like he’s talking about something else.</p>\n<p> </p>\n<p>Jimin blushes a little harder, glancing down at Shiro. “He’s usually pretty aggressive around strangers. We have to warn people before they come over.”</p>\n<p> </p>\n<p>“I’m surprised you can even walk him,” Jungkook says, sly glint in his eyes, “considering he’s about as big as you.”</p>\n<p> </p>\n<p>“Hey!” Jimin shrieks, swatting at Jungkook’s arm. Jungkook just laughs, leaning out of his reach. “He’s not that big and I’m not that small.”</p>\n<p> </p>\n<p>“He’s pretty big and you’re pretty small.”</p>\n<p> </p>\n<p>“<em>Jungkook</em>.”</p>\n<p> </p>\n<p>“It’s okay, it’s cute,” Jungkook grins, and Jimin’s heart nearly bursts. “I always thought you were more of a cat person since you’re a kitten.”</p>\n<p> </p>\n<p>“I am a kitten!” Jimin blurts, then his eyes widen in horror. “I mean — A-a cat person!”</p>\n<p> </p>\n<p>Jungkook bursts into laughter, and Jimin buries his face in his hands, mortification seeping through his body.</p>\n<p> </p>\n<p>“Oh my god,” Jimin groans. “You’re the worst.”</p>\n<p> </p>\n<p>“You said it.”</p>\n<p> </p>\n<p>“You said it first!”</p>\n<p> </p>\n<p>“Was I wrong?” Jungkook’s still laughing as he reaches out to pry Jimin’s hands away from his face, grip gentle around his wrists.</p>\n<p> </p>\n<p>“I hate you.”</p>\n<p> </p>\n<p>“No, you don’t.” Jungkook lets go of his hands and taps his nose lightly with a finger. Jimin’s eyes widen all over again, his stomach twisting into knots, and he swats Jungkook’s hand out of the way.</p>\n<p> </p>\n<p>“Anyway,” Jimin splutters. “When’d you get that tattoo?”</p>\n<p> </p>\n<p>Jungkook raises an eyebrow. “Which one?”</p>\n<p> </p>\n<p>He really wants to know about all of them, but Jimin doesn’t know how much he’s ready to divulge during a random meeting on the sidewalk. “The one on your shoulder. The dates?”</p>\n<p> </p>\n<p>“Oh, that. They’re my family’s birth dates. I got them done like two years ago. My first tattoo.”</p>\n<p> </p>\n<p>Jimin softens, his traitorous heart doing happy little flips in his chest. “That’s so sweet.”</p>\n<p> </p>\n<p>He rubs the back of his head a little shyly, and Jimin’s heart swells, ready to burst. He hasn’t seen much of Jungkook’s old shyness yet, but here he is, the same Jungkook he’s always known. The same sweet, endearing Jungkook who loves his family and friends more than anything.</p>\n<p> </p>\n<p>Shiro whines, nosing against Jungkook’s hand for attention, and Jimin starts in sudden realisation. His heart won’t stop flip-flopping.</p>\n<p> </p>\n<p>He’s fucked.</p>\n<p> </p>\n<p align=\"center\">☀</p>\n<p> </p>\n<p>“<em>Ugh!</em>” Jimin groans, falling face first into his bed, arms curled into himself.</p>\n<p> </p>\n<p>A second later he’s screaming into his pillow, legs kicking out as his brain helpfully flashes the selfie Jungkook posted to his Instagram this morning. He’d been shirtless because apparently that’s how Jungkook spent all his time now and <em>wet</em>, his caption something about how he’d gone for a swim that morning.</p>\n<p> </p>\n<p>“What the fuck is he so hot for!” Jimin exclaims, half the words muffled into his pillow.</p>\n<p> </p>\n<p>Taehyung shoves him over to make space for himself, rolling his eyes. “Can you two just, like, jump each other already and spare me?”</p>\n<p> </p>\n<p>“Uh, how many months did I listen to you telling me about how you wanted to, and I quote, feel Yoongi-hyung’s spent dick twitching down your throat?”</p>\n<p> </p>\n<p>Taehyung lets out a shriek of mortification, shoving at Jimin hard enough that he nearly topples right off the bed. Jimin can’t stop laughing, cheeks hurting and eyes wet, as he looks at how Taehyung’s gone redder than a tomato.</p>\n<p> </p>\n<p>“I was drunk when I sent that text!”</p>\n<p> </p>\n<p>“Guess drunk you thinks exclusively with his dick,” Jimin snorts, lying on his side as he stares up at Taehyung. He sighs, grabbing his phone back from Taehyung’s hand to stare longingly at Jungkook’s selfie again. “If he told me to jump, I’d ask how high daddy.”</p>\n<p> </p>\n<p>“Wow, this is serious huh?” Taehyung asks, patting Jimin’s head.</p>\n<p> </p>\n<p>“I want him to blow my back out. I want him fuck me so hard, he rearranges my guts. I want — ”</p>\n<p> </p>\n<p>“Okay, slow down, you fucking hoe,” Taehyung interrupts, nose wrinkling up. “I get it, you want to fuck Jungkook.”</p>\n<p> </p>\n<p>“This is the worst summer of my life.”</p>\n<p> </p>\n<p>“Didn’t you spend a summer at math camp?”</p>\n<p> </p>\n<p>“I love math,” Jimin grumbles, but Taehyung makes a good point. That had been a particularly awful summer mostly because mosquitoes love Jimin and he did not love mosquitoes.</p>\n<p> </p>\n<p>“You disgust me.”</p>\n<p> </p>\n<p>“Fuck off.”</p>\n<p> </p>\n<p>They sit there in silence, Jimin going through Jungkook’s thirst trap of an Instagram and Taehyung shaking his head like he knows Jimin’s a lost cause. And he is, he is one hundred and ten percent a lost cause. Ever since he accepted that, yes, he had a Crush<b>TM</b> on Jungkook, his feelings have actually gotten more impossible to deal with.</p>\n<p> </p>\n<p>Taehyung flops down onto the bed next to him, pulling Jimin’s arm over so he can scroll through Jungkook’s Instagram with him. There aren’t a ton of posts, but there are enough that Jimin easily has a spank bank’s worth of material.</p>\n<p> </p>\n<p>“You think he has his dick pierced, too?” Taehyung asks nonchalantly, finger hovering over a post Jungkook’s made to show off his forearm tattoo.</p>\n<p> </p>\n<p>Jimin has spent too many nights pouring over all of Jungkook’s body modification posts, perhaps a little obsessively, but hasn’t quite let his mind drift off to dick piercings. “You seem rather invested in Jungkook’s hotness for someone who’s taken.”</p>\n<p> </p>\n<p>“I have eyes, you know.”</p>\n<p> </p>\n<p>“You’re thinking about Yoongi with his dick pierced, aren’t you?”</p>\n<p> </p>\n<p>“I will neither confirm nor deny this.”</p>\n<p> </p>\n<p>“Ugh,” Jimin groans, shoving at Taehyung. He lets his phone fall onto his chest and sighs, staring up at his bedroom ceiling. “I’m doomed.”</p>\n<p> </p>\n<p>“There, there. You’ll get to gargle his nut sauce eventually.”</p>\n<p> </p>\n<p>“I hate you.”</p>\n<p> </p>\n<p align=\"center\">☀</p>\n<p> </p>\n<p>Jimin’s contemplating if he can get away with jumping onto Jungkook’s back and demanding to be piggy-backed home when Jungkook falls back in step with him, cutting that fantasy short.</p>\n<p> </p>\n<p>“You okay?” Jungkook asks, hands stuffed into the pockets of his shorts. For the first time since Jimin’s seen him all summer, Jungkook’s actually wearing a shirt. He frowns at it, hand reaching out to tug on the material.</p>\n<p> </p>\n<p>“I’m fine,” Jimin giggles, buzzed from the soju he’d knocked back at the bar. Taehyung had dragged them all out to celebrate because his boyfriend had made it into town for a week. Yoongi is small and a little terrifying but mostly just smitten with Taehyung.</p>\n<p> </p>\n<p>“You sure?” Jungkook quirks up an eyebrow at him, and Jimin feels like he’s bubbling with happiness, giggling even more.</p>\n<p> </p>\n<p>“I can handle my alcohol, you know,” Jimin tells him matter of factly, proud of himself, his arm draping over Jungkook’s shoulders. It’s a bit of a strain but it lets him settle his head on Jungkook’s shoulder easily, humming to himself.</p>\n<p> </p>\n<p>“Is that right?” Jungkook grins, arm winding around Jimin’s waist. He blushes as Jungkook squeezes him into his side, heartbeat pounding against his ears. Suddenly, Jungkook’s face is too close and Jimin can see the little mole under Jungkook’s mouth. “You’re all flushed.”</p>\n<p> </p>\n<p>“No, I’m not!” Jimin insists even if he can feel the heat radiating off of his face.</p>\n<p> </p>\n<p>“God, you’re cute,” Jungkook murmurs and Jimin’s heart swoops right down to his belly, nearly tripping over his own feet. Jungkook steadies him, laughing, arm secure around Jimin. “You sure you’re okay, Jimin-<em>ssi</em>?”</p>\n<p> </p>\n<p>“<em>Stop</em>,” he whines, trying to squirm away but Jungkook holds him tight, and Jimin steadfastly ignores how it makes something hot coil in his belly. He tells himself he’s not allowed to think about how hot it would be if Jungkook pinned him down, but he’s drunk and his mind has other ideas.</p>\n<p> </p>\n<p>“I’m not even doing anything,” Jungkook smirks even as Jimin whines, letting more of his weight settle against Jungkook.</p>\n<p> </p>\n<p>“You’re being very unfair,” Jimin tells him, hand fisting into his t-shirt.</p>\n<p> </p>\n<p>“Really?” Jungkook asks, eyebrow quirking. “How?”</p>\n<p> </p>\n<p>“You know <em>how</em>,” Jimin accuses, eyes narrowing at Jungkook as he bursts out laughing. God, Jimin wants to kiss him so bad.</p>\n<p> </p>\n<p>It sobers him up, the way Jungkook laughs, Jimin’s heart feeling ready to burst through his chest. Had Jungkook always looked at him like that? Eyes sparkling, his undivided attention fixed solely on Jimin.</p>\n<p> </p>\n<p>Jimin lets go of Jungkook’s t-shirt, pulling away a little. The stud in Jungkook’s nose glitters in the moonlight, catching his attention.</p>\n<p> </p>\n<p>“When did you, um, get your nose pierced?” Jimin asks, the alcohol loosening him up enough to actually reach over and boop Jungkook’s nose. He laughs at Jimin’s childishness, grin widening as his nose crinkles up.</p>\n<p> </p>\n<p>“Why? You like it?” Jungkook teases, arm still wrapped firmly around Jimin’s waist.</p>\n<p> </p>\n<p>Jimin only nods, not trusting himself to say anything.</p>\n<p> </p>\n<p>“Got it after Christmas. My grandparents gave me enough money for it and a tattoo,” Jungkook explains, his hand drifting a little lower along Jimin’s side. “Although, they were probably hoping I’d use the money for something else.”</p>\n<p> </p>\n<p>Jimin’s eyes widen in acknowledgement, mouth a little dry. “Which tattoo?”</p>\n<p> </p>\n<p>Jungkook grabs Jimin’s hand and guides it down to his hip rather slowly, dragging it over the hard planes of his abdomen, eyes dark with something Jimin doesn’t want to name. “This one.”</p>\n<p> </p>\n<p>Jimin’s mouth goes dry and he actually trips, body twisted around by Jungkook.</p>\n<p> </p>\n<p>“Hyung, careful!” Jungkook catches him easily, righting him up, and it’s then that Jimin notices the loud yelling coming from up the street.</p>\n<p> </p>\n<p>His face is aflame, and he refuses to look at Jungkook so he stares in the direction of the noise. His heart sinks immediately. The hand Jungkook has resting on his hip stills, and Jimin knows he’s seen him, too.</p>\n<p> </p>\n<p>Kiyong.</p>\n<p> </p>\n<p>Jimin turns away quickly, wishes he could just disappear into nothingness. He feels nauseous, anxiety spiking. This isn’t how he wanted his night to end. He doesn’t <em>want</em> to see his shitty, cheating ex.</p>\n<p> </p>\n<p>“You know, hyung, you’d look really pretty with your nose pierced,” Jungkook says, his tone light. Jimin finally looks up at him, a little startled. Jungkook had seen him right? He furrows his brows in confusion and Jungkook traces a thumb over them, smiling at Jimin softly. “You ever thought about it?”</p>\n<p> </p>\n<p>“I — ”</p>\n<p> </p>\n<p>The noise his ex and his ex’s friends are making only gets louder and Jimin sucks in a big breath, eyes squeezing shut, shaking his head. Jungkook’s moving, Jimin can feel him as he shifts to Jimin’s left.</p>\n<p> </p>\n<p>“It doesn’t hurt,” Jungkook tells him, hand finding Jimin’s. Their fingers lace together, Jimin squeezing for dear life. He looks at Jungkook before glancing up ahead. Taehyung’s already slowed down, gaze settled on Jimin. He waves him off and then Jungkook’s gently pulling him along, blocking Jimin’s line of sight. He can’t see Kiyong.</p>\n<p> </p>\n<p>“It feels like a pinch and then it’s over.” Jungkook keeps talking, catching them up to everyone else. Namjoon smiles at him reassuringly and Jimin’s fine. He has his friends around him and it’s been four years. Jimin’s moved on.</p>\n<p> </p>\n<p>He’s fine.</p>\n<p> </p>\n<p>Jungkook squeezes his hand, smiling at Jimin so sweetly that Jimin feels breathless. He feels so lucky he thinks he might actually cry.</p>\n<p> </p>\n<p>They walk past Kiyong without incident, and it almost seems like he didn’t even notice Jimin or his friends. He’s not sure if he’s grateful for it or upset, that Kiyong really thought so little of him.</p>\n<p> </p>\n<p>“I’m — I’m gonna head home,” Jimin says quietly once they’re a good distance away from Kiyong and his friends. He doesn’t want to look at anyone, already pulling away from Jungkook.</p>\n<p> </p>\n<p>But he doesn’t let go.</p>\n<p> </p>\n<p>Jimin’s head snaps up at him and Jungkook looks determined, a stubborn set to his eyes. “I’ll walk you.”</p>\n<p> </p>\n<p>“You don’t — ”</p>\n<p> </p>\n<p>“Let him,” Taehyung says, already pulling Jimin into a hug. He rocks them back and forth, Jimin thankful of his presence. “It’s okay, Jimin-ah.”</p>\n<p> </p>\n<p>“Love you, Taetae,” Jimin mumbles, feeling bad for dampening everyone’s mood. Yoongi ruffles his hair and smiles at him when Taehyung finally lets go.</p>\n<p> </p>\n<p>“Love you, too, Jiminie,” Taehyung smiles, pinching Jimin’s cheeks. He swats Taehyung’s hands away, offering up a watery smile.</p>\n<p> </p>\n<p>“Don’t get home too late,” Namjoon says to Jungkook before giving Jimin a hug, too. “And you make sure you drink lots of water before bed.” He gives Jimin this stern look that pulls a genuine smile out of Jimin before he’s nodding.</p>\n<p> </p>\n<p>“Okay. Goodnight everyone,” Jimin says softly, Jungkook guiding him up a side street to head off toward Jimin’s house. They walk in silence, street lamps lighting their path, hands held together. Jimin tries his best not to think about Kiyong, about how he’d been Jimin’s first boyfriend and first kiss. His first love.</p>\n<p> </p>\n<p>It still makes him angry sometimes. Upset that all his memories with Kiyong would always reek of how he’d broken Jimin’s heart.</p>\n<p> </p>\n<p>He doesn’t know when they reach his house, Jungkook leading them up the steps to his door before looking back at him. He smiles and Jimin can’t help it, reaching forward to hug him, face burying into Jungkook’s chest.</p>\n<p> </p>\n<p>Jungkook smells like laundry detergent and orange blossoms.</p>\n<p> </p>\n<p>Jimin knows he should let go but he doesn’t want to and Jungkook just holds him, arms wrapped tight around him.</p>\n<p> </p>\n<p>“Thank you Jungkook,” Jimin whispers eventually, heart heavy in his chest. “You’re really the best.”</p>\n<p> </p>\n<p>Jungkook laughs, the feeling rumbling through Jimin as he gives him one last squeeze for the night. He brushes Jimin’s hair out of his eyes, smiling. “Nah, you’re definitely bester.”</p>\n<p> </p>\n<p>Jimin rolls his eyes, shoving weakly at Jungkook’s shoulder, flushing a little. “Text me when you get home, okay?”</p>\n<p> </p>\n<p>“Okay,” Jungkook promises and then he leans forward and presses a kiss to Jimin’s forehead, smiling softly at him. Jimin’s breath catches in his throat. “I’ll, um, see you soon.”</p>\n<p> </p>\n<p>Jimin just nods, doesn’t trust himself to speak. Jungkook makes it to the little gate at the front of Jimin’s house before he looks back, waving at him. “Go inside, hyung.”</p>\n<p> </p>\n<p>“‘Kay,” Jimin agrees, opening his front door. “Night Jungkookie.”</p>\n<p> </p>\n<p>“Night!”</p>\n<p> </p>\n<p align=\"center\">☀</p>\n<p> </p>\n<p>Predictably, Jimin wakes up with a hangover, but his misery extends beyond the brutal headache and dry mouth. Even though it had gone better than he could have hoped, seeing Kiyong has shaken him up. He feels a little lost as he shuffles to the kitchen for water, shivering even though it isn’t cold. His house is empty — his parents are out at work, and Jihyun’s off on a weekend trip with friends. Somehow the emptiness makes everything worse.</p>\n<p> </p>\n<p>He slumps on the couch in front of the TV that he doesn’t bother turning on. He should make himself some breakfast, brew a cup of coffee, take some aspirin. But Jimin just sits there, the hollowness in his chest too difficult to chase away.</p>\n<p> </p>\n<p>The doorbell rings.</p>\n<p> </p>\n<p>He winces, rubbing his temples, then frowns. He isn’t expecting anyone. Yanking a blanket off the couch and tugging it over his shoulders, he heads to open the door.</p>\n<p> </p>\n<p>It’s Jungkook.</p>\n<p> </p>\n<p>He’s standing there with a grocery bag that looks full to the brim in sweats and a white t-shirt, hair loose and unstyled. A smile brightens his face at the sight of Jimin. He holds up the bag. “Brought hangover goods.”</p>\n<p> </p>\n<p>At the risk of being dramatic, Jimin thinks he might cry. He swallows past the lump in his throat and steps aside so Jungkook can come in. “You didn’t have to do all that,” he mumbles, and Jungkook throws him a smile over his shoulder.</p>\n<p> </p>\n<p>“You haven’t seen my haul yet. What if it isn’t even that great?”</p>\n<p> </p>\n<p>He’s been to Jimin’s house before, so he makes himself comfortable on the couch, removing what looks like a container of soup from the bag. It’s followed by snacks, a few DVDs, and a bag of ground coffee. Jimin stands there watching him, the damn lump still lodged in his throat.</p>\n<p> </p>\n<p>“‘Course it’s great,” Jimin says. “Everything you do is great.”</p>\n<p> </p>\n<p>Jungkook looks up at him and laughs like he thinks Jimin’s just being silly. But Jimin means it. “Come sit.” He pats the couch next to him like it’s his house, not Jimin’s. Jimin shuffles over and sits down, their shoulders brushing. The warmth of Jungkook’s body next to his drives some of the emptiness away.</p>\n<p> </p>\n<p>“Did you really bring a whole bag of coffee?”</p>\n<p> </p>\n<p>“What, I didn’t know if you had any.”</p>\n<p> </p>\n<p>“You don’t even like coffee.”</p>\n<p> </p>\n<p>“You remember that?”</p>\n<p> </p>\n<p>“What do you mean remember?” Jimin scoffs, shoving at him. “I know everything about you, Jeon Jungkook.”</p>\n<p> </p>\n<p>“Yeah?” Jungkook murmurs, his gaze soft as it settles on Jimin. “I have changed, you know.”</p>\n<p> </p>\n<p>“No, you haven’t,” Jimin says, because he’s realised it’s mostly true. He’s confident, sure of himself in a way that he wasn’t before but he’s still the same old Jungkook. Sweet and sometimes shy and full of love.</p>\n<p> </p>\n<p>Jimin thinks what’s really changed is his place in Jungkook’s life. He’d always showered Jungkook with affection in a way that probably overwhelmed him. Jimin hadn’t ever been sure if Jungkook saw him as anything other than his annoying hyung, but it’s different now. Jungkook gives affection back like it’s nothing, seeks Jimin out without prompting. Jimin doesn’t have to wonder if Jungkook enjoys his company anymore. It’s obvious that he does.</p>\n<p> </p>\n<p>“You do have a coffee maker, right?” Jungkook says, as if he hadn’t thought of it before.</p>\n<p> </p>\n<p>Jimin smiles. “I do. Come on.”</p>\n<p> </p>\n<p>“No, I got it. You have some soup.”</p>\n<p> </p>\n<p>When Jimin tries to get up anyway, Jungkook presses him back into the couch with his hands on his shoulders. “Stay,” he says firmly, and Jimin stays.</p>\n<p> </p>\n<p>Hangover soup never tastes that great, but Jimin drinks it all anyway as he listens to Jungkook bustle around the kitchen. Brewing coffee doesn’t take that long, but quite a few minutes pass without the smell drifting into the living room and Jimin starts to wonder.</p>\n<p> </p>\n<p>“Jungkookie?” he calls, setting the empty container of soup on the table.</p>\n<p> </p>\n<p>“Yeah?” Jungkook calls back.</p>\n<p> </p>\n<p>“Do you know what you’re doing?”</p>\n<p> </p>\n<p>Silence. Then a shameful, “No.”</p>\n<p> </p>\n<p>Jimin bursts into laughter, running his hands over his face. He stands up and joins Jungkook in the kitchen where he’s staring at the coffee machine like it’s some alien technology. “Move,” he orders, bumping Jungkook aside with his hip. Jungkook watches him set up the machine, shame-faced. “Do you want some?” Jimin teases.</p>\n<p> </p>\n<p>Jungkook glares at him. He tugs open Jimin’s fridge and pours himself a glass of milk instead. Jimin snickers.</p>\n<p> </p>\n<p>When the coffee’s done, they return to the living room, and Jungkook puts on one of the movies. Jimin’s already feeling leagues better. He tucks himself back into his blanket and sips on his coffee. Jungkook returns to sit next to him; it’s a big couch, but he stays right by Jimin’s side.</p>\n<p> </p>\n<p>“How are you feeling?” Jungkook asks, and Jimin can tell by the seriousness of his tone that he’s talking about Kiyong.</p>\n<p> </p>\n<p>“Better,” Jimin murmurs, taking the leap and leaning into Jungkook’s side, “now that you’re here.”</p>\n<p> </p>\n<p>Jungkook slips his arm around Jimin’s waist easily, like it was meant to be there and Jimin rests his head on his shoulder. He pulls Jungkook’s hand into his lap, playing with his fingers.</p>\n<p> </p>\n<p>“Thank you, Jungkookie.”</p>\n<p> </p>\n<p>Jungkook presses his cheek against Jimin’s head. “Sure thing, hyung.”</p>\n<p> </p>\n<p>The movie’s on but Jimin doesn’t really want to pay attention. He runs a light finger along the tattoo on Jungkook’s forearm, the snake hidden among the flowers. He watches goosebumps erupt on Jungkook’s skin. “I like this one,” he says. “It’s pretty.”</p>\n<p> </p>\n<p>“Yeah?” Jungkook shifts his arm so Jimin can see it better. “You don’t have any tats, do you?”</p>\n<p> </p>\n<p>Jimin shakes his head. “I want one, I just haven’t gotten around to it yet.”</p>\n<p> </p>\n<p>“I’ll go with you.”</p>\n<p> </p>\n<p>Jimin glances up at him, and Jungkook looks perfectly genuine. “Really?”</p>\n<p> </p>\n<p>“I’ll hold your hand while you cry.”</p>\n<p> </p>\n<p>“Hey!” Jimin shrieks, elbowing him. “Who says I’m gonna cry?”</p>\n<p> </p>\n<p>“We’ll just have to see, won’t we?”</p>\n<p> </p>\n<p>Jimin huffs, nuzzling back into his side. “Whatever.”</p>\n<p> </p>\n<p>A throaty meow announces Moya’s arrival; she slinks around the couch, nose in the air, probably wondering who’s over. Jimin’s willing to bet she’s already spent five minutes sniffing Jungkook’s shoes by the door before making her way to them.</p>\n<p> </p>\n<p>“Moya,” Jungkook calls, delighted, pulling away from Jimin to reach for her instead.</p>\n<p> </p>\n<p>“Hey,” Jimin grumbles, missing Jungkook’s warmth already.</p>\n<p> </p>\n<p>Moya sniffs his fingers for a good minute before she decides to leap onto the couch and settle in Jungkook’s lap. He pets her happily, and Jimin glares at them both, feeling forgotten. Jungkook feels his gaze and looks over, a grin splitting his cheeks.</p>\n<p> </p>\n<p>“What, kitten’s not getting enough attention?”</p>\n<p> </p>\n<p>Jimin blushes all the way to his chest, mortified. “<em>Jungkook</em>, oh my god.”</p>\n<p> </p>\n<p>“Don’t worry, I have two hands.” He leaves one on Moya’s back and puts the other on Jimin’s hair, petting him too. “Better, kitten?”</p>\n<p> </p>\n<p>“Oh my god, shut up.” Jimin’s pretty sure he’s going to burst into flames with how hard he’s blushing. The worst part is he <em>likes</em> the way Jungkook says that. And he can’t help leaning into Jungkook’s touch.</p>\n<p> </p>\n<p>“See, told you you were just like a cat,” Jungkook says. “My calico cat.” He glances pointedly at Moya’s patched fur.</p>\n<p> </p>\n<p>“I hate you,” Jimin whines, burying his face in Jungkook’s shoulder, which he supposes is counterintuitive.</p>\n<p> </p>\n<p>“No, you don’t.”</p>\n<p> </p>\n<p>Jimin sighs, and his voice comes muffled against Jungkook’s shirt. “No, I don’t.”</p>\n<p> </p>\n<p align=\"center\">☀</p>\n<p> </p>\n<p>“This is the worst day of my life.”</p>\n<p> </p>\n<p>Jimin’s announcement comes from his upside-down vantage point as he hangs off Taehyung’s bed. He’s kind of hoping all the blood rushing to his head will knock some sense into him. Currently, his brain’s a muddled mess of <em>Jungkook Jungkook Jungkook</em> and frankly, he’s tired of it.</p>\n<p> </p>\n<p>“I can objectively tell you right now that that’s not true,” Namjoon says. Jimin feels him kick his foot.</p>\n<p> </p>\n<p>“What do you know?” Jimin groans, flailing his arms above his head. He’s starting to think all the blood rushing to his head is actually having the opposite effect. Now he’s even <em>more</em> stressed about Jungkook.</p>\n<p> </p>\n<p>“Can you sit up before you pass out?” Taehyung mutters, grabbing Jimin’s ankle and yanking. He only succeeds at knocking Jimin’s head against the bed. “And maybe tell us why you’re in a bad mood when you were having so much fun at the party.”</p>\n<p> </p>\n<p>“Ow,” Jimin whines, rubbing his head and finally sitting up. “That hurt.”</p>\n<p> </p>\n<p>Taehyung just stares at him, impervious to his pouting after all these years. “It’s because of Jungkook,” he guesses, and Jimin sighs, burying his face in his hands.</p>\n<p> </p>\n<p>It feels silly, like he shouldn’t be upset. Like it isn’t his place to be upset. But he’s upset, and he doesn’t know what to do about it — not that there’s anything he <em>can</em> do about it. Feelings, unfortunately, don’t answer to your brain.</p>\n<p> </p>\n<p>“What happened with Jungkook?” Namjoon asks, confused. He and Yoongi had been holed up in a corner of the party, locked in some intense discussion that no one had dared to interrupt. Taehyung had been a little pouty that he didn’t have Yoongi’s attention all to himself, but mostly he was used to it — everyone knew the two of them were impossible to stop once they got started.</p>\n<p> </p>\n<p>“It’s nothing,” Jimin mumbles. “He was just flirting with someone.”</p>\n<p> </p>\n<p>Namjoon looks dubious. “Jungkook? Really?”</p>\n<p> </p>\n<p>“Just because he was talking to a girl — ” Taehyung starts, exasperated, but Jimin cuts him off.</p>\n<p> </p>\n<p>“He wasn’t <em>just</em> talking to a girl. He also had his hand on her waist and their faces were like two inches away from each other — ”</p>\n<p> </p>\n<p>“Surprise, parties are fucking loud and you can’t hear shit — ”</p>\n<p> </p>\n<p>Jimin snatches the pillow next to Namjoon and lobs it in Taehyung’s direction. “Stop invalidating my feelings.”</p>\n<p> </p>\n<p>“I’m not invalidating your feelings, you dramatic hoe. I’m only saying maybe don’t jump to conclusions.”</p>\n<p> </p>\n<p>“I just really like him,” Jimin whines, face-planting onto the bed, his legs bent awkwardly beneath him. “I don’t know what to do with myself.”</p>\n<p> </p>\n<p>He feels a hand on the back of his head, stroking his hair gently. It must be Namjoon because Taehyung’s being a bitch, and he never pets Jimin when he’s being a bitch. “This is serious, huh?” Namjoon says.</p>\n<p> </p>\n<p>Jimin straightens again, frowning. He crawls over to Namjoon and drapes himself over his back. “Hey hyung, it doesn’t bother you, does it?”</p>\n<p> </p>\n<p>“Why would it bother me?”</p>\n<p> </p>\n<p>“He’s your little brother. I don’t wanna make you uncomfortable.”</p>\n<p> </p>\n<p>Namjoon snorts. “Just quit flirting in front of me and we’re good.”</p>\n<p> </p>\n<p>“Hyung, I’m being serious.”</p>\n<p> </p>\n<p>Namjoon reaches back to pat Jimin’s ass. “Me too, Jiminie. I don’t mind. This has kind of been a long time coming.”</p>\n<p> </p>\n<p>“I think you guys are the ones being dramatic. It’s not like we’ve been <em>pining</em> over each other for years or something.”</p>\n<p> </p>\n<p>“Haven’t you?” Taehyung snickers, and Jimin glares at him in lieu of throwing the other pillow, but only because Namjoon’s sitting on it.</p>\n<p> </p>\n<p>“Anyway,” Namjoon says pointedly. “If you like him this much, you should really think about talking to him.”</p>\n<p> </p>\n<p>Jimin slides off Namjoon and sighs. “You always have to be the mature one.”</p>\n<p> </p>\n<p>“You’re just a dramatic hoe, like I said,” Taehyung says.</p>\n<p> </p>\n<p>“You have no room to talk, Kim Taehyung. You and Yoongi-hyung took fucking forever to start dating.”</p>\n<p> </p>\n<p>“He has a point,” Namjoon agrees.</p>\n<p> </p>\n<p>“This isn’t about me,” Taehyung complains. “This is about Jimin and his lovestruck ass.”</p>\n<p> </p>\n<p>“Lovestruck,” Jimin laments. “I really am lovestruck. Can you believe it?”</p>\n<p> </p>\n<p>Namjoon and Taehyung glance at each other. “Yes,” they intone, and Jimin faceplants onto the bed again.</p>\n<p> </p>\n<p align=\"center\">☀</p>\n<p> </p>\n<p>Jimin’s dangling his feet in the shallow end of the pool, water sparkling prettily in the nighttime darkness. The water sloshes around his calves as Jimin sits there, mind fixated on Jungkook. It had a tendency of doing that lately.</p>\n<p> </p>\n<p>Jimin had ended up at Namjoon and Jungkook’s house after Taehyung had not-so-subtly told him he wanted to spend Yoongi’s last day in town with him. Alone.</p>\n<p> </p>\n<p>He didn’t have a secret third wheeling kink and he hadn’t felt like lazing around at home by himself, so he’d come over unannounced and the three of them had spent the evening hanging out. It had been a good night, even if by the end of the first hour, Namjoon had had enough of Jimin and Jungkook’s flirting.</p>\n<p> </p>\n<p>He felt bad, but not bad enough, the image of the girl Jungkook had been flirting with a couple nights ago still playing behind his eyes.</p>\n<p> </p>\n<p>Jimin finds it a little hard to believe how much has changed in a month, at least in regards to his feelings toward Jungkook. He’d spent all evening practically glued to Jungkook’s side, enjoying the way Jungkook smiled at him and how his arm felt wrapped around Jimin’s shoulders. He’d almost forgotten about all his angst until Jungkook had started texting someone, a giant grin on his face the entire time.</p>\n<p> </p>\n<p>He sighs, pouting.</p>\n<p> </p>\n<p>“What’re you doing out here?” Jungkook’s voice travels down to him from the sliding doors at the back of the house and Jimin jumps a little.</p>\n<p> </p>\n<p>He hadn’t been able sleep after their hangout-session-turned-sleepover so he’d ended up outside by the pool, always content near any kind of body of water. Jimin glances back, watches Jungkook walk over to him carefully, shirtless. Always shirtless.</p>\n<p> </p>\n<p>Jimin appreciates the sight, his shorts hanging low on his hips. He smiles when Jungkook stops next to him, staring down at Jimin. From this angle, all Jimin’s brain can do is think dirty thoughts, like how easy it’d be for him to crawl onto his knees and tug Jungkook’s shorts down. He doesn’t let his mind wander further, whipping his head away, cheeks flushing.</p>\n<p> </p>\n<p>“Couldn’t sleep,” he answers, kicking at the water with his feet.</p>\n<p> </p>\n<p>Jungkook hums in understanding, settling down next to Jimin. Their shoulders and arms press against one another or a fleeting moment, heat radiating off of their skin. Jungkook draws his knees to his chest, arms wrapping around his legs.</p>\n<p> </p>\n<p>“What about you?” Jimin asks, looking over at Jungkook.</p>\n<p> </p>\n<p>“Wanted some water.”</p>\n<p> </p>\n<p>“Mm.”</p>\n<p> </p>\n<p>“What’re you thinking about?” Jungkook asks, neck craning up to look at the sky. The stars are out, night sky clear of clouds.</p>\n<p> </p>\n<p>Jimin can’t say what he’s <em>really</em> thinking about, the possibilities swimming through his mind. Jungkook looks impossibly handsome in profile, Jimin’s heartbeat loud in his ears. “Nothing.”</p>\n<p> </p>\n<p>Jungkook laughs, head falling to rest on his arms, his eyes crinkling up as he smiles. “Really? Nothing? I didn’t know your head was that empty, hyung.”</p>\n<p> </p>\n<p>“Excuse me?!” Jimin shrieks, shoving at him.</p>\n<p> </p>\n<p>Jungkook’s laughing as he returns the shove, pushing a little more forcefully. Jimin nearly loses his balance, steadying himself on a hand before retaliating. “Yah!”</p>\n<p> </p>\n<p>Jimin shoves Jungkook hard enough that he topples right over into the water, the splash of his body penetrating the water soaking Jimin thoroughly even as he shrieks with laughter. Jungkook’s breaking the surface, gasping for air as Jimin giggles, falling back.</p>\n<p> </p>\n<p>“Oh my god,” Jimin gasps, curled up into himself as he laughs, arms pulled to his chest. “That’s what you get for teasing me!”</p>\n<p> </p>\n<p>Jungkook’s pushing his hair back out of his eyes, biceps flexing as he floats in the water, grinning. “Oh, is that how you want to play?”</p>\n<p> </p>\n<p>Jimin’s eyes widen, immediately pulling away from the edge of the pool, faster than Jungkook can get to him. Jungkook just misses grabbing Jimin’s ankle, Jimin laughing at Jungkook’s frustrated growl, his eyes narrowed as he rests against the edge of the pool, arms holding his weight up. He sticks his tongue out, giggling and very delighted with himself.</p>\n<p> </p>\n<p>“Fine,” Jungkook grumbles, pushing away from the edge and backstroking further into the pool.</p>\n<p> </p>\n<p>“Still don’t like losing, huh?”</p>\n<p> </p>\n<p>“Who likes losing?” Jungkook tosses back, halfway down the length of the pool. Jimin deems it safe enough to shuffle back over, still careful to keep his legs pulled up toward his body.</p>\n<p> </p>\n<p>“Aw, don’t get upset <em>baby</em>,” Jimin taunts, snickering when Jungkook stills in the water to look over at him. For a split second he looks like he’s going to yank Jimin into the water, kicking and screaming if he has to, and then the expression melts off his face and he smiles.</p>\n<p> </p>\n<p>“Baby huh?” Jungkook grins, swimming back toward him. He comes slowly, Jimin’s eyes narrowed in suspicion. “Am I your baby, hyung?”</p>\n<p> </p>\n<p>Jimin’s heart nearly leaps out of his chest at the question, eyes widening at the cheeky grin on Jungkook’s face. “N-no!” he sputters, heat blooming across his face. “That’s not — ”</p>\n<p> </p>\n<p>Jungkook’s laughing, already back in Jimin’s personal space. He swims right up to the edge and settles next to Jimin, smirking confidently up at him. Jimin wants to wipe the smug look right off his face but he’s so flustered, he doesn’t have any kind of comeback.</p>\n<p> </p>\n<p>“You suck.”</p>\n<p> </p>\n<p>“I can do more than just suck,” Jungkook tells him, eyebrows waggling, and Jimin’s left gaping at him, hot blush creeping all the way down his neck and all the way up to his ears.</p>\n<p> </p>\n<p>Before Jimin can let out the scandalized <em>Jungkook</em> sitting on the tip of his tongue, Jungkook’s grabbed him by the arm, lightning fast, and yanked him into the pool. He falls in face first, breaking through the water until he’s sinking in.</p>\n<p> </p>\n<p>He’s caught completely off guard, flailing as he attempts to get back to the surface, gasping for air. Jungkook’s laughter rings through the quiet of the night, contagious and bright, and Jimin’s shock is replaced with laughter.</p>\n<p> </p>\n<p>“You got me wet!” he whines, splashing water in Jungkook’s direction as he pouts. “I hate you.”</p>\n<p> </p>\n<p>“You keep saying that,” Jungkook says, swimming close enough to Jimin that he can grab him by the t-shirt and pull him in close. Jimin pushes away immediately, attempting to get away but Jungkook is relentless, swimming closer.</p>\n<p> </p>\n<p>Jimin’s back hits the side of the pool, heart lodging in his throat as Jungkook closes the gap entirely, arms caging him in. He tries to swallow, hands settled on Jungkook’s bare chest, eyes dropping down to his neck.</p>\n<p> </p>\n<p>It’s a bad decision. Droplets of water trail down Jungkook’s skin enticingly and Jimin’s mouth goes dry, eyes fixing on Jungkook’s sharp clavicles, belly twisting itself into knots.</p>\n<p> </p>\n<p>“You really hate me?” Jungkook whispers, body pressed against Jimin’s. If he wanted to, Jimin could duck under Jungkook’s arm and swim away but he can’t move, heartbeat thudding against his chest so hard, Jimin can’t hear himself think.</p>\n<p> </p>\n<p>He shakes his head, daring to look up at Jungkook and immediately regretting it, knowing he won’t be able to look away. <em>Shit</em>.</p>\n<p> </p>\n<p>Jungkook is looking at him with such an intensity that Jimin forgets to breathe, his face inching closer. His body feels electric, like he might burst at any second and still Jungkook inches closer, his hands smoothing down Jimin’s sides to settle on his waist.</p>\n<p> </p>\n<p>“You’re so pretty, hyung,” Jungkook murmurs, their bodies floating in the water. Jimin’s fingers dig into Jungkook’s shoulder, butterflies swarming together in his belly. Jungkook leans in that little bit more, nose brushing against Jimin’s, and Jimin’s entire world skitters to a stop, breath caught in his throat.</p>\n<p> </p>\n<p>Jungkook keeps his eyes locked with Jimin’s, heat curling in Jimin’s belly like a serpent, tighter and tighter, and yet somehow, it still feels like he’s the one about to be devoured. The hands on his waist travel higher, palms smoothing over Jimin’s bare skin and there’s no way Jungkook can’t feel how hard his heart is beating.</p>\n<p> </p>\n<p>Patience may be a virtue, but Jimin’s run out of it.</p>\n<p> </p>\n<p>He closes the gap, shuddering when his lips press against Jungkook’s, eyes slipping shut. Jimin’s arms wrap around Jungkook, their bodies are flush together, head tilting to the side as Jungkook’s mouth presses against his harder. Jimin lets himself suck on Jungkook’s bottom lip, licking at the seam of his mouth.</p>\n<p> </p>\n<p>What he’s not expecting is the way Jungkook grabs him, hands gripping him by the thighs and hefting him up, Jimin’s legs wrapping around his waist automatically. He gasps, mouth parting and Jungkook’s tongue slides against Jimin’s own, a hot flash rushing through him as his body pulses with want.</p>\n<p> </p>\n<p><em>Fuck</em>.</p>\n<p> </p>\n<p>Jimin whines into the kiss, feels like Jungkook’s drawn the breath right out of his lungs, his mind hazy.</p>\n<p> </p>\n<p>It only serves to rile Jungkook up, the kiss hungrier, messier, his tongue licking into Jimin’s mouth as if he might disappear, his fingers digging into Jimin’s thighs harder in his desperation. He’s laid in bed all week, imagining what it would be like to kiss Jungkook, to taste him, but the giddy rush of happiness isn’t something he could have anticipated, something he could have fathomed.</p>\n<p> </p>\n<p>Jimin can hardly breathe, but he doesn’t want to pull away, hands fisting into Jungkook’s wet hair as he licks and tastes Jungkook’s mouth, moaning when Jungkook sucks on his bottom lip. A whimper escapes him when Jungkook nips against the flesh, the bite soothed by Jungkook’s tongue.</p>\n<p> </p>\n<p>“Jimin,” Jungkook breathes, tongue slipping back into Jimin’s mouth, his nose digging into Jimin’s cheek as they kiss. “Hyung.”</p>\n<p> </p>\n<p>Jimin’s fingers curl tighter in Jungkook’s hair and it must hurt but Jungkook doesn’t complain, kisses becoming less urgent as he pulls back, leisurely tracing the tip of his tongue along Jimin’s cupid’s bow and his upper lip.</p>\n<p> </p>\n<p>“Can you — ”</p>\n<p> </p>\n<p>“Can I...?” Jungkook asks, kisses Jimin again and again and <em>again</em>. It leaves Jimin’s mind a mess, emotions bubbling together until it feels like he’s going to spill over.</p>\n<p> </p>\n<p>“Jungkook,” Jimin gasps, nails digging into his shoulders as he finally manages to put some distance between them. He can’t feel his face, heat radiating off of his cheeks, and Jungkook’s looking at him like he’s the center of his entire world.</p>\n<p> </p>\n<p>Jimin doesn’t even know what he’s trying to say, just that his head is a mess and he needs, he needs —</p>\n<p> </p>\n<p>Jungkook’s cupping Jimin’s face in his hands, leaning back in for a kiss, sweeter, and Jimin’s heart is leaping out of his chest, eyes slipping shut.</p>\n<p> </p>\n<p>“Is this okay?” Jungkook’s voice is so quiet, Jimin almost misses the question.</p>\n<p> </p>\n<p>He nods, placing his hands over Jungkook’s, and the growing immensity of the moment quells as he locks eyes with Jungkook. He can’t remember kissing anyone and ever feeling so grounded.</p>\n<p> </p>\n<p>“God,” Jungkook whispers, smiling softly, his voice reverent, hands squeezing Jimin’s cheeks. “I just wanna eat you up.”</p>\n<p> </p>\n<p>“<em>Jungkook</em>.” Jimin shoves at Jungkook’s shoulder lightly, feels his face heat up more than he even thought possible, eyes flickering down. He swallows, the party from a couple days ago swimming to the forefront of his mind.</p>\n<p> </p>\n<p>Suddenly, the giddiness simmers down, Jimin’s heart sinking. Jungkook tilts his chin up, curious eyes taking Jimin in. He leans in, their foreheads meeting, bodies bobbing in the water. He feels almost silly, letting his desires and feelings get ahead of him.</p>\n<p> </p>\n<p>“Hyung?” Jungkook asks, tilting Jimin’s head a little higher, their lips almost meeting again.</p>\n<p> </p>\n<p>“W-wait!” Jimin exclaims, palm pressing insistently against Jungkook’s chest. His eyes meet Jungkook’s, a look of concern meeting his. “Is this — I mean,” he sucks in a big breath, Jungkook’s hands settling against his sides. Jimin chews on his bottom lip, not wanting to sound desperate. “This isn’t just a hookup, right?”</p>\n<p> </p>\n<p>“You really think that’s all I want?” Jungkook asks, voice a little tight, brows furrowed together. “To hook up?”</p>\n<p> </p>\n<p>Jimin swallows, droplets of water trailing down his skin. And it’s not that he doubts Jungkook, but that he can never get his brain to stop obsessing over his own undesirability. If Jimin had been enough, Kiyong never would have —</p>\n<p> </p>\n<p>“I’m sorry,” he says quietly, unable to look Jungkook in the eyes. “I can — I’ll go home.”</p>\n<p> </p>\n<p>Jungkook’s frown deepens, adding distance between them. “Is...is that what you want? To go home?”</p>\n<p> </p>\n<p>It isn’t.</p>\n<p> </p>\n<p>But Jimin’s mind is racing, images of the girl from the party flashing before his eyes. He remembers walking in on Kiyong and Soohee, will never forget it. Remembers their looks of shock, the way his heart had dropped out of his chest.</p>\n<p> </p>\n<p>Jungkook’s staring at him, waiting for a response and Jimin wants this, whatever this is. He doesn’t want to ruin it before it even begins. Jimin wants to be brave, he wants to take the risk, wants to trust Jungkook because Jungkook’s never given him reason not to.</p>\n<p> </p>\n<p>“I, uh, t-the girl...” He licks his lips, daring to look up at Jungkook, who only looks confused.</p>\n<p> </p>\n<p>“What girl?”</p>\n<p> </p>\n<p>“Um, at the party. You were with a girl. You looked like you were — ”</p>\n<p> </p>\n<p>“Jimin,” Jungkook interrupts him, his voice coloured with disbelief and amusement. “Hyung, she’s my friend. Chungha-noona’s the reason I even — God, this is — Hyung you’re so <em>cute</em>.”</p>\n<p> </p>\n<p>“What?” Jimin asks, not at all following Jungkook’s train of thought.</p>\n<p> </p>\n<p>“For someone who was top of his class, you’re really clueless, hyung,” Jungkook smiles, pulling Jimin into a hug. He’s too stunned to say anything, arms wrapping around Jungkook’s wet torso automatically. He can hear Jungkook’s heartbeat, head pressed to his chest, and it’s going as fast as Jimin’s.</p>\n<p> </p>\n<p>“Being top of my class doesn’t mean I can read your mind, you brat,” Jimin grumbles, smacking him in the side. Jungkook only laughs, squeezing Jimin tighter. Then he’s lifting Jimin up, pulling a yelp out of him, and Jimin finds himself sitting on the edge of the pool, Jungkook grinning up at him as he floats between his legs.</p>\n<p> </p>\n<p>“Chungha-noona is my friend. I’m not, uh, interested in girls,” Jungkook explains to him, taking one of Jimin’s hands in his own, his other arm coming to rest on Jimin’s thigh. “Do you know how long I’ve liked you, hyung?”</p>\n<p> </p>\n<p>Jimin’s eyes widen, managing a shake of his head.</p>\n<p> </p>\n<p>“For as long as I can remember,” Jungkook confesses, “and I’d kinda given up hope that you’d ever like me back, that you’d stop seeing me as some kid. Chungha-noona’s the one who told me to stop moping and go for it. So — so no, this isn’t a hookup.”</p>\n<p> </p>\n<p><em>Oh</em>.</p>\n<p> </p>\n<p>Jungkook’s looking up at him so earnestly that Jimin’s chest tightens, lungs squeezing the air out of him. He thinks his heart might burst. “I do like you,” Jimin says softly, cupping Jungkook’s face in his hands. “A lot.”</p>\n<p> </p>\n<p>Jungkook’s smile is blinding, spreading across his face until his nose crinkles up in delight and then he’s surging forward to kiss Jimin, hand curling around the back of Jimin’s neck. Jimin draws him in, hands dragging him closer as he wraps his arms around Jungkook, mouth parting as Jungkook licks filthily in, tongue swiping against the sensitive roof of his mouth.</p>\n<p> </p>\n<p>Jimin’s cock twitches, a whine escaping him, and he feels helpless to Jungkook’s intensity, overwhelmed but longing for more.</p>\n<p> </p>\n<p>“Never thought I’d hear you say that,” Jungkook breathes out, kisses Jimin between the words slipping out of his mouth. He moans when Jimin sucks on his tongue, returning Jungkook’s fervor.</p>\n<p> </p>\n<p>Jungkook’s mouth leaves his and Jimin whines, chasing him as he pulls away, but Jungkook just laughs and holds him in place. His lips find Jimin’s neck, the touch soft before he sucks a mark under Jimin’s jaw that makes Jimin’s toes curl.</p>\n<p> </p>\n<p>“Shit,” Jimin breathes, but Jungkook isn’t done yet.</p>\n<p> </p>\n<p>He fists a hand in Jimin’s hair and pulls his head back, baring Jimin’s neck for him, his lips dragging down his throat. He works Jimin’s skin between his lips, sucking hard, and Jimin moans, arching into him. His tongue laves over the tender spot, and Jimin winds his arms tighter around Jungkook, spine tingling.</p>\n<p> </p>\n<p>Jungkook pulls back just enough to look at the product of his kisses, running a light finger over the marks. “Pretty,” he murmurs, and Jimin flushes red.</p>\n<p> </p>\n<p>“I’m not gonna be able to go anywhere,” Jimin whines. “It’s summer, I can’t even wear a scarf — ”</p>\n<p> </p>\n<p>Jungkook’s mouth finds his neck again and Jimin’s words break off into a whimper, his lashes fluttering. “Good,” he says, and Jimin can feel his lips move against his skin.</p>\n<p> </p>\n<p>Jungkook’s pulling at his shirt, the wet material clinging to Jimin’s skin and it’s a relief to take it off, even if it leaves him half-naked. He shivers under Jungkook’s gaze, heart hammering against his ribs, as he leans forward and kisses Jimin’s bare skin. He leaves gentle kisses  against Jimin’s collarbones, a contrast to how he’d ravaged Jimin’s neck.</p>\n<p> </p>\n<p>Jungkook’s mouth travels lower, tongue laving over Jimin’s hardened nipples. He bites against one of them, Jimin arching away from the touch even as a jolt of desire throbs all the way down to his cock.</p>\n<p> </p>\n<p>He’s half hard, knows Jungkook could probably see the outline of his cock against his shorts if he looked down. For all of Jimin’s growing distress over how hot Jungkook is, he doesn’t want to rush into anything if that’s not what Jungkook wants.</p>\n<p> </p>\n<p>But Jungkook proves him wrong, keeps proving him wrong, pushing Jimin’s worries aside when his hand palms over Jimin’s cock, pulling a strangled moan out of him. “You get hard for me, kitten?”</p>\n<p> </p>\n<p>Jimin’s cheeks heat up at the question, eyes narrowing. “Who else would — ”</p>\n<p> </p>\n<p>Jungkook laughs at his embarrassment, reaching up to kiss him. “You’re so cute when you’re flustered,” he murmurs, his other hand trailing down Jimin’s back until his fingers dip into the waistband of his shorts. He squeezes Jimin’s ass, kisses him harder, enjoying the way Jimin goes pliant. “Come on, kitten. Tell me.”</p>\n<p> </p>\n<p>Jimin’s hands cling to Jungkook’s shoulders, simultaneously wanting to shove him away and pull him in closer. “Tell you what?” he breathes out when Jungkook pulls back enough to let him answer.</p>\n<p> </p>\n<p>“Tell me how bad you want this,” Jungkook says, leaves a trail of kisses along Jimin’s jaw until he’s biting down on a lobe, sucking it into his hot mouth. It makes Jimin’s cock throb, a keening moan filling the air. “Don’t be shy.”</p>\n<p> </p>\n<p>“I’m not being shy,” Jimin retorts, nails digging into Jungkook’s skin, arousal a spreading fire as it sparks down his spine, heat simmering in his belly. “You’re just…”</p>\n<p> </p>\n<p>“I’m just...?” Jungkook encourages, kisses the skin just behind Jimin’s ear. It sends a shiver running through him, Jimin curling into himself.</p>\n<p> </p>\n<p>“Shameless,” he breathes as Jungkook nips at his skin, sucking a mark so far up on his neck, it’ll be impossible for Jimin to cover it up. He whines at the realization, his hand falling on top of Jungkook’s where it’s resting on his thigh. Jimin guides it to his neglected cock, grinding into Jungkook’s palm, moaning when Jungkook’s tongue laves at the mark he’s sucked into Jimin’s skin, kissing it open-mouthed.</p>\n<p> </p>\n<p>“Someone’s impatient,” Jungkook smirks, eyebrow cocked as he pulls away from Jimin’s neck, tugging Jimin’s shorts down. He slips Jimin’s cock out, hard and leaking, as it curves upwards to Jimin’s stomach.</p>\n<p> </p>\n<p>“Whose fault is that?” Jimin bites back, but his hips stutter up when Jungkook wraps a hand around his cock, his whole body thrumming with anticipation, skin flushed as he looks down at Jungkook.</p>\n<p> </p>\n<p>“I hope it’s mine,” Jungkook grins, kissing Jimin just under his chin. “Even your cock is cute, kitten.”</p>\n<p> </p>\n<p>“H-hey!” Jimin whines but it feels so good to have Jungkook’s hand around his length, Jimin can’t hold onto his annoyance.</p>\n<p> </p>\n<p>“Cute kitten with a cute cock,” Jungkook smiles up at him before his head dips forward, and Jimin’s whole body clenches as Jungkook’s lips touch his cock. He kisses the tip, tongue flat as he licks the underside of the head, mouth wet and hot, and Jimin moans louder than he has all night when Jungkook wraps his lips completely around the head, sucking.</p>\n<p> </p>\n<p>It’s like his brain is short circuiting, Jungkook sinking further and further down, a hand coming to cover his mouth, embarrassed by the sounds he’s making. Jungkook hums around his cock, sinking all the way down to his pelvis, Jimin’s cock hitting the back of his throat. Jimin’s hand fists into his hair, voice cracking as he moans.</p>\n<p> </p>\n<p>As Jungkook pulls back, he lets his tongue drag along the underside of his cock, Jimin’s lungs tightening at the sensation. It feels so good, Jimin’s head is going blank, nearly forgetting that they’re sitting out by the Jeon family pool where any of the neighbours could see them.</p>\n<p> </p>\n<p>“Jungkook,” he whines, tugging on Jungkook’s hair. He thinks he’s only managed to sit up this long because Jungkook’s got one of his hands digging into Jimin’s ass, the other pulling his shorts down lower. “J-Jungkook, we’re — ”</p>\n<p> </p>\n<p>Jungkook pulls back enough just to suck on the head of Jimin’s cock insistently, the tip of his tongue dragging along the bottom of his cockhead. It sends tingles down his spine, cock throbbing.</p>\n<p> </p>\n<p>“Someone could s-see,” Jimin whimpers, eyes squeezing shut when Jungkook’s hand fondles his balls as he lazily swirls his tongue around Jimin’s cockhead.</p>\n<p> </p>\n<p>“So?” Jungkook asks with a pop, lips red and swollen, and Jimin’s so close to just collapsing backwards, breath shuddering through his chest. He licks up the length of Jimin’s cock before sucking it back into his mouth, head bobbing as he blows Jimin.</p>\n<p> </p>\n<p>“So we shou — <em>Oh</em>,” Jimin moans, Jungkook swallowing around the head of his cock as he takes his cock all the way down. The pressure is almost too much, Jimin’s hand tightening in Jungkook’s hair.</p>\n<p> </p>\n<p>Jungkook’s pulling off again, spit dribbling down his chin as he heaves, looking up at Jimin. “We should let them see,” Jungkook says darkly, a look in his eyes that makes Jimin’s belly twist into itself. He’s so <em>fucked</em>. “Let them see what a slutty little kitten I have.”</p>\n<p> </p>\n<p>Jimin’s cock twitches in Jungkook’s hold at his words, an embarrassed whine slipping out, and Jungkook’s smile sharpens, smug, kissing Jimin sloppily as his hand works over Jimin’s length. “You like that, kitten? Like it when I call you that?”</p>\n<p> </p>\n<p>Jimin can barely form a coherent thought, face on fire, but he nods mutely, liking the burn of shame that runs through him, how it makes his cock throb with need.</p>\n<p> </p>\n<p>“Mm, what a pretty kitten,” Jungkook murmurs, kissing Jimin sweetly before he pulls back, his hand still working up and down on Jimin’s cock, pace agonisingly slow. “So well behaved.”</p>\n<p> </p>\n<p>“Jungkook,” Jimin pleads, his shorts tugged down even lower, ass meeting the cool edge of the pool. Jungkook gets Jimin completely naked, his shorts and underwear both ending up floating on the pool’s surface before Jungkook’s leaning back down to swallow his cock into his mouth.</p>\n<p> </p>\n<p>Jungkook sets a steady pace, nudges Jimin’s legs wider apart to give himself more room, pushing Jimin down in the process. Jimin finds himself half in the grass and half on the concrete surrounding the pool’s perimeter, chest heaving as Jungkook sucks him off.</p>\n<p> </p>\n<p>“Please,” Jimin whines, hands curling into Jungkook’s thick hair, wanting to look down at Jungkook but unable to keep his eyes open. “Wanna come, Jungkook.”</p>\n<p> </p>\n<p>Jungkook only hums around him, taking Jimin’s entire length down his throat again. His hand massages Jimin’s balls, a finger rubbing against his hole as he continues to suck, not even deterred when Jimin’s hips buck upwards. Jungkook lets his mouth fall open as Jimin thrusts up into the wet heat of his mouth, a garbled moan leaving him as his fists tighten in Jungkook’s hair.</p>\n<p> </p>\n<p>It’s not until Jungkook’s pinning his hips down, Jimin’s cock hitting the back of his throat that Jimin feels himself teetering on the edge, sucking in breath after breath. “I’m — Jungkook — C-close!”</p>\n<p> </p>\n<p>Jungkook pulls off Jimin’s cock just long enough to suck in a breath. “Come on, baby,” he rasps, sinking back down on Jimin’s length. This time when he swallows around the head of his cock, Jimin can’t hold it off, crying out Jungkook’s name as he spills down his throat, back leaving the ground. Jungkook keeps sucking, head bobbing as he swallows down Jimin’s cum.</p>\n<p> </p>\n<p>Jimin collapses back down, his hold on Jungkook’s hair loosening as he blinks through the pleasure coursing through him, Jungkook’s attention focused on sucking on the tip. His hand works over Jimin’s length, milking him dry.</p>\n<p> </p>\n<p>Jungkook finally pulls off his cock when Jimin’s hip twitch upwards, the sensation too much as he hisses. He licks it clean and Jimin whines, catching Jungkook’s attention. But Jungkook doesn’t move, sucking a bruising mark against Jimin’s hipbone before kissing it sweetly, crawling up his body, their eyes meeting.</p>\n<p> </p>\n<p>“Thought you didn’t want anyone to see,” Jungkook teases, hovering over Jimin as he attempts to catch his breath, body still pulsing with pleasure. “Pretty sure all the neighbors heard that, Jiminie.”</p>\n<p> </p>\n<p>“Don’t care,” Jimin mumbles out, trying his best to keep his eyes open, to take in the brilliance of Jungkook’s smile.</p>\n<p> </p>\n<p>“And why’s that?”</p>\n<p> </p>\n<p>“Cause,” Jimin says, licking his lips, reaching for Jungkook to draw him closer. “I’m your slutty little kitten.”</p>\n<p> </p>\n<p>“Fuck,” Jungkook curses, closing the distance between them to capture Jimin’s mouth in a searing kiss. They makeout as Jimin lies there, both of them drying off in the cool summer air, the heavy length of Jungkook’s cock pressing against his hip, a hot weight. He wants to return the favour but he also wants Jungkook to fuck him, mind unable to make a decision. “Should have known you’d have a filthy mouth.”</p>\n<p> </p>\n<p>Jimin pouts at that, flushing. “Like you’re any better.”</p>\n<p> </p>\n<p>Jungkook grins, Jimin can feel it against his own mouth, their tongues brushing against one another. “Mmm, you caught me.” He trails a hand down Jimin’s side, gripping him by the hip. “I’d fuck you right here but — ”</p>\n<p> </p>\n<p>“But what?” Jimin interrupts, the high from his orgasm having waned a little, his alertness back. “Want you to fuck me.”</p>\n<p> </p>\n<p>“Lube, hyung,” Jungkook reminds, snickering, sitting back up as he stares down at Jimin’s prone body. He pushes himself up to his elbows, lips pursed together. Jungkook laughs, leaning in for a quick kiss. “Definitely a slutty little kitten, so impatient.”</p>\n<p> </p>\n<p>He picks Jimin up easily, Jimin squeaking as he finds himself in Jungkook’s arms, his hands cupping Jimin’s ass. Jimin stares at Jungkook’s swollen mouth, lips pink and shiny, kissing him as Jungkook carries him toward the house. “You’re,” Jimin breathes, “really good at that.”</p>\n<p> </p>\n<p>“Good at what?”</p>\n<p> </p>\n<p>“Giving head.”</p>\n<p> </p>\n<p>Jungkook smirks, sliding the back door open and stepping into the cool, darkness of the house. “Wait until I fuck you.”</p>\n<p> </p>\n<p>Jimin groans as his head drops to Jungkook’s shoulder, heat already pooling in his belly. Jungkook holds him tight, fingers gripping him by the thighs as he carries Jimin toward the stairs. Jimin finds his attention diverted to sucking hickies against Jungkook’s neck, eager to return all the marks Jungkook’s littered all over him.</p>\n<p> </p>\n<p>“Wait!” Jimin exclaim, startling with a realization.”Namjoon — ”</p>\n<p> </p>\n<p>“Hyung’s in the basement. He won’t hear anything.”</p>\n<p> </p>\n<p>“But I’m loud.”</p>\n<p> </p>\n<p>“I noticed,” Jungkook whispers into his ear, forcing Jimin to squirm away. He glares as Jungkook laughs, a kiss pressed to his cheek. “It’s hot.”</p>\n<p> </p>\n<p>He flushes at that, refusing to let Jungkook distract him. “What if your parents — ”</p>\n<p> </p>\n<p>“They’re not coming home for another week,” Jungkook says, ignoring all of Jimin’s panic. “Stop worrying.”</p>\n<p> </p>\n<p>He doesn’t even realise they’ve made it up the stairs, Jungkook carrying Jimin into his room. The light flickers on, Jungkook’s bed neatly made. Jungkook walks them over to his bed, dropping Jimin down onto the mattress. Jimin can feel the heat radiate off of his skin as Jungkook looks at him, his pupils blown with want, eyes dark and hungry.</p>\n<p> </p>\n<p>They’re both still wet but neither of them seem to care.</p>\n<p> </p>\n<p>“Always dreamt about this,” Jungkook tells him, knee settling on the bed as he leans down, and Jimin’s breath catches in his throat, feels like a sheep about to be devoured by a wolf. “Having you spread out on my bed, begging to be fucked, begging for my cock.”</p>\n<p> </p>\n<p>“What else?” Jimin asks, letting Jungkook smooth his hands up his torso until they’re pushing his arms up, Jimin’s wrists pinned to the bed where Jungkook holds them down. His biceps flex as he holds him, Jimin’s cock throbbing between his legs, ass clenching around nothing.</p>\n<p> </p>\n<p>“Dreamt about how tight you’d feel, how your pretty hole would swallow my cock up,” Jungkook continues, rolling his hips down against Jimin’s. He bites his lip, eyes slipping shut as Jungkook’s mouth dips down to his ear. “How you’d feel clenching around me, how you’d take me, how you were made for me.”</p>\n<p> </p>\n<p>Jimin whines, fingers curling into fists, Jungkook’s hips grinding down harder against him and he’s never hated a pair of shorts more in his life.</p>\n<p> </p>\n<p>“Show me,” Jimin rasps out, “show me hard you wanna fuck me.”</p>\n<p> </p>\n<p>“You got such a pretty little body, kitten,” Jungkook whispers, voice rumbling in Jimin’s ear. His hands drag down to Jimin’s hips, drawing back, and Jimin misses the friction immediately. His eyes fix on the skull tattoo now sitting on the horizon of Jungkook’s shorts, Jungkook’s happy trail peeking out. “You sure you can take me?”</p>\n<p> </p>\n<p>“Make me take it,” Jimin challenges, locking eyes with Jungkook. “If you think I can’t, make me.”</p>\n<p> </p>\n<p>Jungkook swears under his breath, standing up as he looks at Jimin. “You’re really something else, baby.”</p>\n<p> </p>\n<p>He moves to the bedside table, pulling out a bottle of lube. The drawer’s left open as Jungkook chucks his own shorts, leaving him naked for Jimin’s viewing pleasure. He groans at the sight of his cock, mouth already watering and Jungkook smirks, back between Jimin’s legs.</p>\n<p> </p>\n<p>Jungkook pours the lube over his fingers, warming it up as he taps Jimin’s legs to get him to lift them up. It leaves Jimin completely on display, something hot squirming in his belly as Jungkook’s gaze drags over him, hungry.</p>\n<p> </p>\n<p>Jimin isn’t expecting him to pour the lube directly over his hole, ass clenching as the cold liquid sends a shiver up his spine. Jungkook pushes one finger in slowly, an eyebrow cocking when he meets little resistance. Jimin’s cheeks colour but he’s not ashamed; after all, he’d come thinking about Jungkook fucking him, three fingers deep inside himself.</p>\n<p> </p>\n<p>“You don’t have to prep me,” Jimin tells him, legs spreading further apart as Jungkook slips in a second finger next to the first easily.</p>\n<p> </p>\n<p>“Who said I’m prepping you?”</p>\n<p> </p>\n<p>“Then why — ”</p>\n<p> </p>\n<p>“Cause I wanna make you come,” Jungkook says, thrusting a third finger into Jimin without warning. The stretch is pleasant, Jungkook’s fingers feeling better than Jimin’s own ever have. “Wanna hear you, make you beg,” Jungkook continues, fucking into Jimin’s hole. “Wanna feel how tight you get around my fingers when I make you come.”</p>\n<p> </p>\n<p>“But I, I already came,” Jimin sighs breathily, Jungkook’s fingers finding his prostate. He rubs at it persistently, electricity running up Jimin’s spine as he gasps, jolting upward on the bed, head falling back.</p>\n<p> </p>\n<p>“Not enough,” Jungkook replies, holding Jimin down with a hand on his hip as he pushes a fourth finger in. Jimin takes it because he can, because he likes the burn, mouth hanging open in a silent moan. “Wanna make you come again,” Jungkook adds, leaning down to kiss Jimin’s belly, teeth scraping the sensitive skin. “And again,” he bites into the flesh, “and again. Want you so fucked out, you can’t even remember your own name.”</p>\n<p> </p>\n<p>“Jungkook,” Jimin whines, fingers fisting into his sheets. “S-stop teasing.”</p>\n<p> </p>\n<p>“How am I teasing?” Jungkook asks, fingers rubbing mercilessly against Jimin’s prostate. “You have to earn it, have to show me how bad you want it.”</p>\n<p> </p>\n<p>“<em>Jungkook</em>.” Jimin’s near tears, little cries muffled when he bites his own lip, hand reaching for his cock. Jungkook swats it away immediately, kissing his teeth in disappointment. “Please, Jungkookie. Want — want it.”</p>\n<p> </p>\n<p>“Want what?” Jungkook asks, unfazed by Jimin’s pleading.</p>\n<p> </p>\n<p>“W-want,” Jimin starts, teary eyes finding Jungkook’s. “Want you to fuck me.”</p>\n<p> </p>\n<p>“But I am fucking you.”</p>\n<p> </p>\n<p>Jimin lets out a frustrated sound, desperation breaking through the last shreds of his pride. “Please, p-please Jungkook. Want — want your cock, wanna,” Jungkook’s fingers fuck him harder and Jimin nearly comes, stopped only by the hand Jungkook has wrapped around his cock. He cries, gasping as Jungkook loosens the ring he’s formed around Jimin’s cock, four fingers fucking into Jimin hard. “<em>Oh</em>, Jun — Jungkook — ah — ”</p>\n<p> </p>\n<p>“What else do you want, Jimin-ah?”</p>\n<p> </p>\n<p>Jimin can barely form the words, teetering on the edge of his orgasm. “Wanna feel — feel you inside. Pl — Please Jungkookie,” he begs, tears trickling down his cheeks .</p>\n<p> </p>\n<p>“What a greedy kitten,” Jungkook murmurs, rubbing against Jimin’s prostate without pause. The hand wrapped around Jimin’s cock travels up Jimin’s length, focusing on the cockhead and then Jungkook’s rubbing at his sensitive head as he fucks into Jimin and it’s all <em>too</em> much.</p>\n<p> </p>\n<p>“Jun — <em>Jun</em> — ”</p>\n<p> </p>\n<p>The hand on his cock is smeared in Jimin’s precum, Jungkook’s hand squelching every time his fingers fuck into Jimin’s hole, pleasure building and building and then Jimin’s arching off the bed, orgasm crashing through him. For a split second, Jimin’s mind goes completely blank, eyes blinking as pleasure courses through him, Jungkook milking Jimin’s cock until he’s going soft in his hold. He whines at the oversensitivity, hissing when Jungkook sucks on the tip of his cock.</p>\n<p> </p>\n<p>Jungkook’s mouth licks at the trail of cum that Jimin’s splattered all over himself, his fingers still in Jimin’s hole. He doesn’t fuck into Jimin, just leaves Jimin feeling full, makes it all the way up to Jimin’s mouth, kissing him with Jimin’s own cum still in his mouth.</p>\n<p> </p>\n<p>The bitter taste spills over Jimin’s tongue, his moans devoured by Jungkook as he kisses him, open-mouthed. Cum and spit push back and forth between their mouths until Jungkook is squeezing at Jimin’s neck, Jimin swallowing everything down eagerly.</p>\n<p> </p>\n<p>“Good boy,” Jungkook praises, sucking on Jimin’s tongue before he’s sitting up. “So pretty when you come, baby.” He pulls his fingers out of Jimin’s ass, their eyes never leaving each other and Jimin’s already so fucked out but he whines at the loss, already wanting something better to fill him up. “Still want my cock, kitten?”</p>\n<p> </p>\n<p>Any filter Jimin had on his mouth is gone, the words tumbling out in a rush. “Please Jungkookie, want it — Wanna feel how big it is, want you to fuck me stupid. Please, please, been — been thinking about it all month.”</p>\n<p> </p>\n<p>“All month, huh?” Jungkook asks, leaning toward his bedside table again. He rummages through the top drawer, pulling out a condom and Jimin’s frowns at it. “Come on, kitten, tell me all the nasty things you thought about.”</p>\n<p> </p>\n<p>Blushing, Jimin looks back at Jungkook, stares at his pierced nipples and his perfectly sculpted abs, mouth watering. “Just want — want you to fuck me, Jungkookie.”</p>\n<p> </p>\n<p>“Did you get off thinking about me?” Jungkook asks. Jimin nods his head, licking his lips.</p>\n<p> </p>\n<p>“Thought about how hard you’d fuck me, how — how b-big you’d feel inside.”</p>\n<p> </p>\n<p>“You that hungry for cock, kitten?” Jungkook smirks, tearing the condom open. “Got myself a cockslut.”</p>\n<p> </p>\n<p>“No,” Jimin complains, forcing himself to reach up and grab the condom from Jungkook.</p>\n<p> </p>\n<p>“Hyung?” Jungkook asks, brows furrowed together. “I need to — ”</p>\n<p> </p>\n<p>“Don’t wear it,” Jimin insists, already tossing it aside. “Come inside, wanna feel it.”</p>\n<p> </p>\n<p>“<em>Fucking</em> — ” Jungkook has to squeeze his eyes shut before he’s able to look at Jimin again, disbelief and arousal burning in his gaze.</p>\n<p> </p>\n<p>“Thought about that, too. Your cum inside me, hot and — ”</p>\n<p> </p>\n<p>Jungkook kisses him so hard their teeth clatter, Jimin’s hands clambering to grab ahold of him. His legs are pushed up, knees to his chest as Jungkook fits between his thighs and Jimin thinks he’s in for more teasing but Jungkook slams into him in one go, knocks the breath right out of him.</p>\n<p> </p>\n<p>“You like that, baby?” Jungkook groans, grinding into Jimin’s tight heat and Jimin’s incapable of words, mind utterly blank, mouth hung open. He’d thought four fingers were a lot but Jungkook’s cock feels bigger, leaving Jimin so full he’s breathless.</p>\n<p> </p>\n<p>“Fuck, you feel so good baby, so fucking tight,” Jungkook growls into his ear, finally pulling back enough to fuck right back into him, his thrust just as hard as the first time. “Gonna fuck you so good.”</p>\n<p> </p>\n<p>Jimin only whines, clinging to Jungkook, his face buried in his shoulder. It feels like he can’t get a good enough grip, jostled forward everytime Jungkook thrusts into him, Jimin bent in near half. Jungkook grabs him by the ass, angling his body so he can fuck into Jimin even deeper and it has Jimin seeing stars, body already oversensitive.</p>\n<p> </p>\n<p>“Come on baby, tell me how much you like my cock,” Jungkook says, voice rough and gravelly, still bent over Jimin. “You like how I’m fucking you open?”</p>\n<p> </p>\n<p>“Uh — hic — Uh-huh,” Jimin answers, feels a little like his mind’s floating off. Jungkook only fucks into him harder, has Jimin clawing at his back, arching off the bed as his cock rubs against his prostate. Jimin’s not even sure how he’s gotten hard again, but his cock is trapped between their abdomens, leaking precum.</p>\n<p> </p>\n<p>“Yeah, you’re gonna take it, aren’t you? My fucking slut,” Jungkook bites out, the words burning through Jimin because he did love taking it, loved being used like this.</p>\n<p> </p>\n<p>Jimin squeezes around Jungkook’s cock, enjoys the way Jungkook’s hips stutter, and he slows down, fucks into Jimin slower, dragging his length back in and out. It drives Jimin mad, the burn of pleasure ebbing away. He bites into Jungkook’s shoulder, sucking against the mark before Jungkook’s sitting up, wet hair looking even wetter from sweat.</p>\n<p> </p>\n<p>Jimin’s lucid enough to take in how fucking hot he looks, the way his skin glistens, cheeks flushed. He can’t stop staring at the shine of his nose stud or the bars that pierce through his nipples. Just looking at Jungkook makes Jimin want to squirm.</p>\n<p> </p>\n<p>“Look at you,” Jungkook breathes, grinding into Jimin’s heat. “Fucking made to be fucked, aren’t you kitten?”</p>\n<p> </p>\n<p>“Mmm,” Jimin hums, eyes half-lidded as he nods. “L-love getting fucked.”</p>\n<p> </p>\n<p>“Such a greedy little slut,” Jungkook accuses, eyes narrowed, “swallowing my cock up. Bet you couldn’t live without it.”</p>\n<p> </p>\n<p>Jimin’s voice stutters out of him, eyes wet with tears once again. “Ah — love, love your cock, Jungkookie. Feels — feels so good. S-so full.”</p>\n<p> </p>\n<p>Jungkook picks up the pace after that, fucking into Jimin sharp and fast, Jimin’s moans falling out of him in sync with the sound of Jungkook’s balls slapping his ass, the obscene squelch of his cock pushing into Jimin turning him on even more. “Ah, ah, ah!”</p>\n<p> </p>\n<p>He’s not sure when Jungkook leans forward again, mouth seeking his as they kiss. Jungkook’s palms slide over the length of his arms, finding Jimin’s hands. Their fingers lace together, Jimin’s legs wrapped around Jungkook’s waist as he pounds into him. The bed smacks against the wall on a particularly hard thrust, Jimin’s eyes rolling into the back of his head as he gets fucked, moaning out loudly as his cock drools precum.</p>\n<p> </p>\n<p>“Jun — Jungkookie,” he slurs, whining pathetically, their tongues brushing against each other. It's not even a kiss anymore, just the two of them sharing the same breath, Jungkook groaning with every thrust forward.</p>\n<p> </p>\n<p>“Fucking made to take cock, kitten,” he hisses, leaves open mouthed kisses along Jimin's jaw. “So fucking good for me, feels — feels so good being inside you.”</p>\n<p> </p>\n<p>“Want you — Want you to u-use me,” Jimin pants out, eyes squeezing shut as Jungkook pulls back up, his hands back on Jimin's hips. His cock slips out of Jimin as he adjusts them, gets Jimin's legs wrapped around himself as he pushes back in. Jimin sighs, happy to be full again.</p>\n<p> </p>\n<p>“What a good slut, offering yourself up,” Jungkook smirks, hands firmly wrapped around Jimin’s waist as he drills into him. And Jimin isn’t going to last, can’t hold it off, cock bouncing as Jungkook hammers into his abused hole.</p>\n<p> </p>\n<p>“Gonna — gonna c-come,” Jimin cries out, pleasure building higher and higher and Jungkook just keeps fucking him, the pace of his thrusts brutal, too much.</p>\n<p> </p>\n<p>“Come on then, kitten.”</p>\n<p> </p>\n<p>Jimin sobs as he comes, bodily arching off the bed, head tossed back. His balls tighten up as he spills a pathetic dribble of cum over himself, ass clenching around Jungkook so tight, Jungkook’s thrusts halt momentarily as he swears out loud. Jimin forgets where he is, body curled upwards, hands fisted in the bedsheets and still, Jungkook fucks him.</p>\n<p> </p>\n<p>“Shit shit shit.” Jungkook’s gripping Jimin so tight, he knows he’ll have bruises to show for it, relishing the thought. He’s fucked right through his orgasm, Jungkook’s last few thrusts erratic as he slams into Jimin, the oversensitivity leaving Jimin crying.</p>\n<p> </p>\n<p>“Come, come inside, Kookie,” Jimin manages, words barely coming out. “Want your cu — <em>oh!</em>” He has to catch his breath, body still strung up as Jungkook thrusts in one last time, grinding into him and then he feels it, hot cum spilling inside him.</p>\n<p> </p>\n<p>Jimin groans in tandem with Jungkook as he falls forward, hips twitching as he fucks himself through his orgasm, cock throbbing inside Jimin. He rocks his body forward gently, cum filling Jimin up and he wishes he could keep it there forever, arms wrapping around Jungkook.</p>\n<p> </p>\n<p>The touch has Jungkook falling forward, his weight slumping on top of Jimin as he grunts.</p>\n<p> </p>\n<p>“Fuck,” he groans, mouth finding Jimin’s neck, kissing him as he lies there, fucked out. “Wow.”</p>\n<p> </p>\n<p>Jimin laughs, happy to have made Jungkook feel so good but he’s just as tired, eyes already feeling heavy and Jungkook’s weight starting to feel heavier and heavier.</p>\n<p> </p>\n<p>“Wish I could be inside you forever,” Jungkook mumbles, still resting on top of Jimin, and Jimin makes a hum of agreement, still too fucked out to make any sense. He doesn’t want Jungkook to pull out either, grunting as Jungkook shifts, kissing Jimin’s neck again as he gets up. Jimin can barely keep his eyes open as he watches Jungkook sit up between his legs, fingers brushing against his rim as he looks down.</p>\n<p> </p>\n<p>He finally pulls out, slow enough that Jimin can feel every inch drag out of him. His ass clenches around nothing, legs falling down onto the bed and he misses the feeling of fullness, mouth twisted into a pout as he whines.</p>\n<p> </p>\n<p>“God,” Jungkook breathes, “you’re so beautiful.”</p>\n<p> </p>\n<p>“<em>Stop</em>.” Jimin hides his face by turning onto his side in an attempt to hide his face in the pillow, suddenly shy under Jungkook’s gaze. He hates how his heart races at the compliment.</p>\n<p> </p>\n<p>“What? I’m only telling you the truth.” Jungkook doesn’t wait for Jimin to respond, leaning down to pull him into a chaste kiss. “I’ll be right back.”</p>\n<p> </p>\n<p>“Where’re you going?”</p>\n<p> </p>\n<p>“Gotta get my kitten cleaned up,” Jungkook smiles, rolling off the bed. Jimin watches him leave, curling into a ball on Jungkook’s bed as he waits for him. It hits him then, that they’d just fucked on Jungkook’s childhood bed. Jimin’s face flushes at the thought.</p>\n<p> </p>\n<p>Jungkook isn’t gone for long, but Jimin grows impatient anyway, fidgeting and peeking over for his return. He emerges with a damp washcloth and climbs back onto the bed, jostling Jimin as the weight shifts. Jimin stares up at him as he leans in and carefully wipes the cum from his chest and stomach, his touch gentle.</p>\n<p> </p>\n<p>“On your tummy, baby.”</p>\n<p> </p>\n<p>Jimin turns over, embarrassed to be baring his ass for Jungkook despite everything they’ve just done. He can feel the cum oozing out of his ass, knows Jungkook will see it. He feels Jungkook’s hands warm on his ass, spreading his cheeks, and he whimpers, still a little sensitive. He turns his head back so he can look at him and finds Jungkook staring at his hole, washcloth forgotten on the bed beside them, creating a damp spot on the sheets.</p>\n<p> </p>\n<p>“What are you looking at?” Jimin whines.</p>\n<p> </p>\n<p>“At your pretty little hole,” Jungkook answers, thumb rubbing over the abused skin. “It’s all swollen and puffy.”</p>\n<p> </p>\n<p>Jimin doesn’t think he can flush any harder but he does, attempts to bring his legs closer together as he hides his face in the pillow. “<em>Jungkook</em>.”</p>\n<p> </p>\n<p>Jungkook only hums and then Jimin yelps, feels Jungkook push his thumb into Jimin’s hole followed by something wetter and hotter until it sinks in that Jungkook’s got his tongue inside of him.</p>\n<p> </p>\n<p>“Fuck,” he hisses, obediently pushing his leg up when Jungkook nudges it, tongue digging in deeper. Jimin can’t believe he’s eating his own cum out of Jimin’s ass but then, he can’t believe a lot of the shit Jungkook can do. He moans when Jungkook pulls back enough to lick over his hole, allowing Jimin to rub his ass back in Jungkook’s face.</p>\n<p> </p>\n<p>An especially loud whine escapes him when he feels Jungkook’s nose drag over his rim as he kisses Jimin’s taint, nudging it back up Jimin’s crack as his mouth returns to Jimin’s hole. He licks it, sucking against it as Jimin moans into his pillow, hardly believing that his cock was getting hard <em>again</em>.</p>\n<p> </p>\n<p>When Jungkook pushes his ass cheeks apart to dig deeper, nose pushing into his ass as his tongue dives further into Jimin’s hole, he jerks upward, overwhelmed by the feeling. Jungkook’s tongue is so soft inside him, his thumb hooking into his rim to spread him open wider. Jimin feels the cum dribble out of him, groaning as Jungkook fucks his tongue into him.</p>\n<p> </p>\n<p>He ruts against the bed as Jungkook eats him out, a steady back and forth as Jimin meets Jungkook halfway. His cock rubs against Jungkook’s bedsheets, raw and oversensitive but he almost enjoys the edge of pain, how it feels like too much.</p>\n<p> </p>\n<p>“Jungkookie,” he slurs out, hands fisted in the sheets. Jungkook only hums, squeezing Jimin’s ass so hard it hurts. “Jungkookie, ah — please — ”</p>\n<p> </p>\n<p>Jimin’s not even sure if he wants to come but he wants something, feels almost stupid with how overloaded his brain is, body thrumming with pleasure. Jimin thinks he might be drooling, barely registering Jungkook’s finger slipping in as he seems to suck on Jimin’s hole, swallowing down the cum in Jimin’s ass.</p>\n<p> </p>\n<p>“‘S too much,” Jimin cries, words garbled together but Jungkook doesn’t stop, his finger pressing into Jimin’s prostate and it is too much, Jimin arching off the bed as he comes. He’s blindsided, body trembling as his orgasm tears through him.</p>\n<p> </p>\n<p>For a split second, Jimin can’t remember anything, panting into his pillow as the orgasm wracks through him, painful. He comes completely dry, wiped out as he lies there overwhelmed. Jungkook licks at his holes a couple more times before he’s kissing Jimin’s ass, hands squeezing the fat so hard his fingers dig right in. It makes Jimin shiver.</p>\n<p> </p>\n<p>“You were,” Jimin starts, slowly coming back to, blinking his eyes open. He’s curled up into himself, cock twitching uselessly between his legs.</p>\n<p> </p>\n<p>“I was...?”</p>\n<p> </p>\n<p>“You were supposed to clean me up,” Jimin accuses, but he can’t even muster up the fake annoyance.</p>\n<p> </p>\n<p>“But I did clean you up,” Jungkook grins, his chin a mess of cum and spit. Jimin thinks his cock would spring up at the sight if it had any life left in it.</p>\n<p> </p>\n<p>“Ugh, do you ever stop?”</p>\n<p> </p>\n<p>“Nope.”</p>\n<p> </p>\n<p>Jimin rolls his eyes and even that feels like an effort.</p>\n<p> </p>\n<p>“I always wanted to do that,” Jungkook tells him, absolutely shameless. He grabs the wet cloth to wipe his face clean before finally cleaning Jimin up, touch light as he wipes at Jimin’s sensitive hole and then all the way to his balls. When Jungkook’s done, he manages to roll Jimin onto his back, grinning at him.</p>\n<p> </p>\n<p>Jimin licks his lips, pawing at him, wanting a kiss, and Jungkook comes readily, licking into Jimin’s willing mouth. He hums into their kiss, Jungkook settling down next to him on the bed, pulling Jimin in by the hip. Somehow, Jungkook manages to get the blanket over the both of them, never breaking away from Jimin once.</p>\n<p> </p>\n<p>“No one’s ever,” Jimin says a little breathless as he breaks their kiss to press a palm to Jungkook’s chest. Jungkook’s hand strokes up and down his side, cupping Jimin’s ass when he feels like it. He averts his eyes from Jungkook’s out of embarrassment. “No one’s ever done that before.”</p>\n<p> </p>\n<p>“No one’s ever eaten your ass out?” Jungkook asks incredulously. “You’re lying, right?”</p>\n<p> </p>\n<p>“Why would I lie about that?” Jimin smacks him in the chest, flustered despite how fucked out he feels. Four orgasms may be his limit.</p>\n<p> </p>\n<p>“That’s not right.”</p>\n<p> </p>\n<p>“What?”</p>\n<p> </p>\n<p>“I’ve literally been <em>dreaming</em> about eating your ass out since I was like 15 and learned what porn is,” Jungkook exclaims, voice rising in pitch. Then he turns bodily toward Jimin with a determined look. “Don’t worry, baby, I’ll make up for all the missed years.”</p>\n<p> </p>\n<p>“Shut. <em>Up</em>.” Jimin shrieks, hands coming to cover his face, mortified despite being touched by Jungkook’s earnestness. “You’re so stupid!”</p>\n<p> </p>\n<p>“I’m just — ”</p>\n<p> </p>\n<p>“Shut up shut up shut up!” Jimin curls into a ball, head hiding in his arms as Jungkook laughs, tugging him into his arms for cuddles. He ignores how Jungkook smooths a hand over his ass, a kiss pressed to the crown of his head.</p>\n<p> </p>\n<p>“You’re being awfully shy for someone who was begging for my cock earlier,” Jungkook teases, yelping and pulling back when Jimin flicks one of his nipple piercings in retaliation.</p>\n<p> </p>\n<p>“Ass,” Jimin scowls.</p>\n<p> </p>\n<p>“I am what I eat.”</p>\n<p> </p>\n<p>Jimin glares at him harder, but Jungkook only grins toothily, leaning in and giving him a kiss.</p>\n<p> </p>\n<p>“You’re so cute, kitten.”</p>\n<p> </p>\n<p>“I hate you,” Jimin grumbles, allowing Jungkook to pull him in closer. He ends up with his head cushioned on Jungkook’s chest, curled up into his side.</p>\n<p> </p>\n<p>“No, you don’t.”</p>\n<p> </p>\n<p>Jimin sighs. “No, I don’t.”</p>\n<p> </p>\n<p align=\"center\">☀</p>\n<p> </p>\n<p>Jimin wakes up feeling uncomfortably warm, but he doesn’t mind.</p>\n<p> </p>\n<p>He blinks slowly, fingers wiggling as awareness returns to his body, his eyes sticky and his limbs stiff. His head is still pillowed on Jungkook’s chest, his arms around Jimin’s waist in an almost vise-like grip as if he can’t bear to let Jimin go even in his sleep. Jungkook’s steady breath stirs Jimin’s hair, and their legs are tangled together under the sheets. Jimin sighs, tucking himself closer, eyes drifting shut again.</p>\n<p> </p>\n<p>Jungkook’s skin is warm against Jimin’s cheek, and he tilts his head up to press a soft kiss to his collarbone. He almost can’t believe it, that after all that pining he’s here, lying in bed with Jungkook’s arms around him.</p>\n<p> </p>\n<p>As Jungkook stirs, he mumbles something sleepily, and Jimin smiles into his skin. He trails more kisses up his neck, along his jaw, and Jungkook’s arm tightens around his back. Jimin’s pressing a kiss to his cheek when Jungkook turns his head, catching his lips with his and kissing him slow and thorough.</p>\n<p> </p>\n<p>“Morning,” he mumbles against Jimin’s mouth, eyes fluttering open.</p>\n<p> </p>\n<p>“Hi,” Jimin says, nuzzling into his neck, suddenly shy.</p>\n<p> </p>\n<p>Jungkook’s fingers thread through his hair, thumb rubbing little circles into his skull. His voice is still throaty from sleep. “Did you rest well?”</p>\n<p> </p>\n<p>“What do you think?” Jimin mutters a little wryly.</p>\n<p> </p>\n<p>“Mm, you did come four times.”</p>\n<p> </p>\n<p>“I slept like a rock. I probably <em>snored</em>.”</p>\n<p> </p>\n<p>Jungkook snickers. “That good, huh?”</p>\n<p> </p>\n<p>“Good?” Jimin pulls back to look at him, Jungkook’s eyes soft and warm. “You’re the best fuck I’ve ever had.”</p>\n<p> </p>\n<p>The grin that spreads across Jungkook’s face is unbearably smug. “Oh, yeah?”</p>\n<p> </p>\n<p>Jimin huffs, even though he’d known what he was bringing upon himself by admitting it. He buries his face back in Jungkook’s chest. “You already knew.”</p>\n<p> </p>\n<p>“The way you were begging for my cock really gave it away — ”</p>\n<p> </p>\n<p>Jimin shrieks, shoving at him, but Jungkook grabs him before he can scoot away. He yanks him in, laughing into his hair.</p>\n<p> </p>\n<p>“Where are you running off to, hmm?”</p>\n<p> </p>\n<p>“Let go of me, you jerk!”</p>\n<p> </p>\n<p>“What did I do, huh?” Jungkook croons, kissing his nose. “I’m only stating facts.”</p>\n<p> </p>\n<p>“Whatever,” Jimin huffs, letting Jungkook fuss over him, pressing kisses over his face and stroking his sides. “But really. Thank you for taking such good care of me.”</p>\n<p> </p>\n<p>He scoots up to kiss Jungkook’s cheek, and Jungkook smiles into it. “I wanna be the best for you,” he says, and Jimin flushes. He rests his head on the pillow next to Jungkook’s so that they’re facing each other, just a few inches between their noses. Jungkook reaches out to trace his thumb over Jimin’s lips.</p>\n<p> </p>\n<p>“Did you mean it?” Jimin murmurs. “When you said you’d liked me for a while?”</p>\n<p> </p>\n<p>“For a while?” Jungkook snorts. “I’ve had a crush on you forever.”</p>\n<p> </p>\n<p>“Really?” Jimin breathes, eyes wide.</p>\n<p> </p>\n<p>“I’ve only ever had eyes for you. Didn’t think I was that subtle about it either.”</p>\n<p> </p>\n<p>“Are you kidding me? All you ever did was call me annoying — ”</p>\n<p> </p>\n<p>“Well, you were pretty annoying.”</p>\n<p> </p>\n<p>Jimin smacks his shoulder. “I was <em>not</em>. I just wanted to spend time with you.”</p>\n<p> </p>\n<p>“Yeah, and being around you made me want to rip my hair out because all I could think about was how much I wanted to kiss you.”</p>\n<p> </p>\n<p>“Oh my god. Are you serious?”</p>\n<p> </p>\n<p>“You were basically my gay awakening.”</p>\n<p> </p>\n<p>“Oh my god,” Jimin whines, covering his face with his hands. “I can’t believe this. I really had no idea.”</p>\n<p> </p>\n<p>“And you only started noticing me because I got abs.”</p>\n<p> </p>\n<p>He has a teasing note in his voice, so he can’t be all that serious, but Jimin sobers instantly. He pushes himself up and over so he can press Jungkook into the bed, hovering above him with a frown. “That’s not true.”</p>\n<p> </p>\n<p>Jungkook smiles, brushing Jimin’s hair from his forehead. “I know.”</p>\n<p> </p>\n<p>“I really like you, Jungkookie. I always have, I just — ” He pauses, struggling to find the right words. “I just wasn’t sure where I stood with you. And you were Joonie’s little brother, you know.”</p>\n<p> </p>\n<p>“I know,” Jungkook repeats, his voice soft. “I get it. I was kind of afraid you’d just see me as a little brother forever.”</p>\n<p> </p>\n<p>Jimin pours out all the things he can’t find words for into a kiss, cupping Jungkook’s face in his hands. He doesn’t pull back until he’s breathless and even then, he doesn’t let go of Jungkook’s face. “Are we — you said this wasn’t a hookup. Does that mean — ”</p>\n<p> </p>\n<p>“ — that we’re dating? That’s kind of what I’m hoping for.”</p>\n<p> </p>\n<p>“Yes,” Jimin breathes, settling down beside him again. He traces the dates on Jungkook’s shoulder, smiling to himself. “I want that.”</p>\n<p> </p>\n<p>“Then it’s official.”</p>\n<p> </p>\n<p>Jimin’s heart feels full to burst. “We’ll have to do long distance; that’s not gonna be easy, you know.”</p>\n<p> </p>\n<p>“I’m not worried,” he says easily. “We can make it work. That’s what Chungha-noona’s thinking about, too, with Sejeong.”</p>\n<p> </p>\n<p>He winces a little in embarrassment at the reminder of Chungha. “They’re dating?”</p>\n<p> </p>\n<p>“She texted me last night — she finally scored a date with her. That’s what we were talking about at the party, actually. She was trying to figure out how to approach her.” Jungkook smiles down at him, eyes bright and happy.</p>\n<p> </p>\n<p>“Oh.”</p>\n<p> </p>\n<p>“We were doing a trade-off,” he says. “I gave her advice on Sejeong-noona and she gave me advice on you.”</p>\n<p> </p>\n<p>Jimin snorts. “What kind of advice?”</p>\n<p> </p>\n<p>His lips curve into a sly grin. “Keep my shirt off.”</p>\n<p> </p>\n<p>“You’re kidding!” Jimin shrieks, rising back up to stare at Jungkook incredulously.</p>\n<p> </p>\n<p>“Nope. And it worked, didn’t it? Every time you were around me you looked like your eyes were about to pop out of your head.”</p>\n<p> </p>\n<p>“You’re unbelievable!” Jimin shoves at him again, flailing around in mortification. Jungkook’s laughing so hard, the reverberations run through Jimin. “You were doing that on purpose?”</p>\n<p> </p>\n<p>“Sometimes it just happened,” he allows soberly.</p>\n<p> </p>\n<p>“Oh my god, you’re the worst.”</p>\n<p> </p>\n<p>Jungkook shifts, pressing Jimin into the bed, hands on his sides. There’s a playful glint in his eyes. “Is that what you really think?”</p>\n<p> </p>\n<p>“What if it is?” Jimin challenges, and Jungkook’s eyes narrow. He surges in to kiss him and Jimin arches up to meet it, rendered breathless by Jungkook’s vigor. Jungkook, Jimin was learning, kissed just as well as he did everything else. When he pulls away, Jimin’s gasping, back hitting the bed again.</p>\n<p> </p>\n<p>“Is it?” Jungkook says, and Jimin shakes his head, flushed red. “You love me.”</p>\n<p> </p>\n<p>“I love you,” Jimin whispers, and Jungkook’s eyes widen and Jimin’s heart stutters.</p>\n<p> </p>\n<p>“I love you, too,” Jungkook says, and there’s wonder in his words and in the way he’s looking down at Jimin. His fingers touch Jimin’s cheek delicately, like he’s something precious. When he speaks, it’s with awe in his voice. “You’re the prettiest boy I’ve ever seen.”</p>\n<p> </p>\n<p>Jimin blushes like a tomato and pushes him away. “Shut up, you’re so cheesy.”</p>\n<p> </p>\n<p>“You’re saying that like you didn’t just blush all the way to your nipples.”</p>\n<p> </p>\n<p>“I did not — ”</p>\n<p> </p>\n<p>“I can see it.”</p>\n<p> </p>\n<p>“<em>Jungkook</em> — ”</p>\n<p> </p>\n<p>There’s a knock on the door. “Yah, Jungkook-ah, you up?”</p>\n<p> </p>\n<p>It’s Namjoon. Jimin and Jungkook exchange a wide-eyed glance. “Fuck,” Jimin breathes. “Now we gotta tell hyung.”</p>\n<p> </p>"
}