{
  "id": "1741619",
  "url": "https://archiveofourown.org/works/1741619?view_full_work=true",
  "author": [
    "northerntrash"
  ],
  "title": "Call You Home",
  "rating": "Not Rated",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "The Hobbit - All Media Types"
  ],
  "relationships": [
    "Bilbo Baggins/Thorin Oakenshield"
  ],
  "characters": [
    "Bilbo Baggins",
    "Thorin Oakenshield",
    "Gandalf",
    "Thorin's Company"
  ],
  "additional_tags": [
    "Hobbit Culture",
    "in which it is hobbits that have a secret language and hidden names",
    "and the dwarves can't quite contain their curiosity",
    "Thorin's making puppy-eyes at the Burglar again",
    "utterly pointless fluff piece if i'm being honest",
    "Alternate Universe - Everyone Lives/Nobody Dies"
  ],
  "language": "English",
  "series": "",
  "published": "2014-06-04",
  "completed": null,
  "words": "11,997",
  "chapters": "1/1",
  "comments": "253",
  "kudos": "15,212",
  "bookmarks": "3,164",
  "hits": "131,002",
  "summary": "<p>In which the Company are entirely too nosy about matters that are supposed to be a secret, and Bilbo learns that being concerned about propriety is overrated when you could be making friends instead.</p>",
  "notes": "<p>I wrote this about a couple of months ago: there are a few things I don't like about it but I lack the commitment to properly fix it. One day I shall return and make it better, but today is not that day. Forgive any glaring spelling errors, I lack the focus to check for them properly at the moment.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Let me know what you think. Find me on <a href=\"https://northerntrash.tumblr.com\" rel=\"nofollow\"> tumblr! </a></p>",
  "text": "<p>It was Gandalf that let the secret out.</p>\n<p>He shouldn’t have been surprised.</p>\n<p>It was <em>always</em> bloody Gandalf.</p>\n<p>“Bilbo, you’ve not signed with your full name.”</p>\n<p>Why the damnable wizard was reading his contract – how he had even prised it from Balin’s highly fastidious and efficient hands – was a mystery to the Hobbit, as was why Gandalf felt the need to bring up a topic that was not only entirely irrelevant, but was <em>highly improper. </em></p>\n<p>Bilbo, who had frozen at the wizard’s words at the edge of camp, firewood in his arms, tried quickly to move as if he had not been thrown by this unexpected turn of events. He liked to think that he had a rather impressive glare on his face, but knew that in reality he probably looked no more intimidating than an irate rabbit.</p>\n<p>Unfortunately, journeying in the company of Thorin Oakenshield had made him realise that whilst his own unimpressed expressions might have done for chastising the wayward fauntlings of the Shire, they left very little to be desired out here in the Big Bad World.</p>\n<p>More’s the pity.</p>\n<p>He shook himself, trying to stroll nonchalantly to where Gloin was trying to light a fire.</p>\n<p>“What on earth are you talking about, Gandalf?”</p>\n<p>He tried to shoot him a glance that conveyed just how much he would not like this particular topic to be brought up – <em>shut up shut up shut up</em> – but the wizard was not to be deterred, and raised an eyebrow at him from across the long, looping piece of parchment. Honestly, how it had even survived the arduous trek across field and mountain, through Goblin Kingdom and eagle’s flight, was a mystery.</p>\n<p>Bilbo watched it warily, a strange feeling curling tight across his chest – they had come so far since the morning he had scrawled his signature on there, and he barely felt like the same Hobbit that had set out with a full set of brass buttons and little understanding of what he was getting himself into.</p>\n<p>It left him with an uncomfortable sense of displacement.</p>\n<p>“You know exactly what I am talking about, Bilbo.”</p>\n<p>Unfortunately, any hopes that he might have had about playing down this <em>entirely improper </em>conversation were dashed as Nori, looking between the two, quirked an elaborately braided eyebrow that Dori had only just finished repairing. Bilbo, catching sight of the expression, felt his heart sink. Nori was like a dog with a bone when it came to information that he was not privy to – the only one of the Company worse would have been –</p>\n<p>“What’s all this, Mister Boggins?”</p>\n<p>\n<em>Damn. </em>\n</p>\n<p>Kili’s voice, loud and predictably excitable, drew the attention of the entire camp, except for Oin, either too deaf or busy to hear, who was still busy sewing up their esteemed leader after the rather unfortunate incident with the warg and the orcs.</p>\n<p>It was annoying that Thorin had still managed to look dignified whilst being used as a chew toy.</p>\n<p>He dropped the firewood in what he hoped was a rather decisive matter.</p>\n<p>“It’s nothing.”</p>\n<p>Gandalf made a hum that was quite clearly not an agreement, and rolled up the contract again.</p>\n<p>“If Bilbo thinks it is nothing, then it is <em>quite clearly </em>nothing of interest.”</p>\n<p>His tone of voice, of course, implied the opposite.</p>\n<p>Damn that wizard. He was never leaving his home again. If he could ever get back to it, that is. Hmmm. He tried not to eye the mountain range behind them, wondering if it would be easier to get back across it alone.</p>\n<p>Fili caught his eye as he searched for a possible escape route, and grinned at him.</p>\n<p>“Come on, Bilbo. What’s this big secret you and Gandalf are keeping?”</p>\n<p>“<em>Nothing,</em>” Bilbo tried to emphasise, though he should have realised by now the futility of this entire conversation, and run away. Perhaps into the forest, if the mountains were not possible, never to come back. He was sure that the Orcs wouldn’t be particularly interested in his name when they caught him.</p>\n<p>“Apparently the Halfling,” Nori drawled, “Has another name.”</p>\n<p>He said it loudly enough for the whole camp to hear, and now all of the dwarves were exchanging looks, impossible to read. Dori paused in his fussing of Ori’s hair: Dwalin even stopped sharpening his axes. Once again, the only person who did not react was Oin, but as he was currently stitching up a particularly vicious gash on Thorin’s chest, that was probably a good thing.</p>\n<p>Bilbo could feel the tips of his ears growing red.</p>\n<p>“I assure you, my name is Bilbo Baggins, just as it says on that contract. Why on earth do you have it anyway, Gandalf?”</p>\n<p>“Yes,” came the deep and unimpressed voice of their leader, though the edge of it was tempered a little by his obvious exhaustion. Bilbo tried not to start at the sound of it. “Why indeed?”</p>\n<p>Gandalf slid the rolled up parchment into his sleeve, letting it disappear into the mysterious and unknown quantity that was a wizard’s clothing. Who knew what else he kept up there? Possibly several of those moths he occasionally spoke to: almost certainly something dangerous. Bilbo certainly did not want to investigate further, and so let the vanishing of his contract go without comment.</p>\n<p>He folded his arms instead, trying not to look as vulnerable as he currently felt.</p>\n<p>“Balin gave me them before you all left Rivendell,” Gandalf replied calmly. “He seemed to be under the impression that something of such importance should be kept in a safer place than his pack, and since that now lies within a Goblin hide in the depths of a mountain, I rather think he was correct.”</p>\n<p>It was testament to Thorin’s level of pain that his only response was an unimpressed grunt. Bilbo couldn’t quite spare concern for him: at the moment, he was just glad that the problem of his name had been passed over.</p>\n<p>He started to feed the wood into the fire, and prayed that his blush would soon fade from the back of his neck.</p>\n<p>Although the sight of Thorin’s naked back was certainly not helping matters.</p>\n<p> </p>\n<p>--</p>\n<p> </p>\n<p>It had been a long time since anyone had brought up his inner-name with him.</p>\n<p>The last time he could recall had been during his mother’s slow illness, that had eventually taken her life. His parents had been understandably upset by his Naming, and the subject had remained the constant Oliphaunt in the room in the few months since.</p>\n<p>No one ever wanted to talk to him about it.</p>\n<p>His mother had clutched at his hand from her bed, bringing it up to her mouth to press a kiss against his palm.</p>\n<p>“My love, I feel as if we failed you.”</p>\n<p>He had shaken his head, trying to smile. Her skin had been cool to the touch, the wasting sickness leaving her drawn and pale.</p>\n<p>“That is not true: this has always felt like home to me.”</p>\n<p>“And yet…”</p>\n<p>She had trailed off, her exhaustion taking her back into the deep, exhausted sleep that was claiming most of her time these days.</p>\n<p>It was highly improper to discuss your inner-name with another without good cause, and once his mother had passed away there was no one else who had ever asked, though he was well aware that it had remained a topic of intense gossip around Hobbiton. He was an oddity, a strange bachelor in a smial meant for a family: kindly to his friends and family and a favourite with the younglings of the Shire who didn’t know better, but certainly <em>peculiar</em>.</p>\n<p>He had not expected the issue of his inner-name to ever actually crop up on his travels: indeed, he tried rarely to think about it, irritation at his own only bubbling up when he was at the Naming days and weddings of his family and friends, those being the only two times it was proper to announce your name aloud to a gathered crowd – he remembered being quite scandalised when, as a younger Hobbit, he had overheard his father whispering his mother’s to her in front of the fire, in the middle of their smial, where <em>anyone </em>might have overheard.</p>\n<p>Good friends, he knew, sometimes exchanged their names as an act of trust, and it was traditional to gift your name to someone who had done you a great service. He knew that Olo Danderfluff, for example, had given his to Daisy Brambleburr when he had been distracted by a bumblebee in his ear and had sliced through his thigh with his scythe, and she, passing by in the lane by the field, had stemmed the bleeding and kept him calm until the doctor arrived. Without her quick thinking he may have died of blood loss, and it was considered quite acceptable that he had chosen to give her his name in thanks.</p>\n<p>However, no situation like that had ever presented itself to him, and most of his friends had grown a little more distant following his own Naming.</p>\n<p>Perhaps it would be spoken again, in the privacy of your marriage bed, but unfortunately Bilbo’s name had been enough to ensure that he would never learn that intimacy. It was really all a formality, at any rate, as everyone <em>knew </em>each other’s inner-names, in that way that Hobbits of the Shire knew everything of each other’s business.</p>\n<p>He understood why his had worried his parents, and it bothered him still that the two of them went to their graves believing him to be unhappy.</p>\n<p>Because he hadn’t been: he had come to terms with the fact that his name set him aside from others, and that he would never know the joys of sharing it with another. If he sometimes padded the halls of the only home he had known, wondering at what he would never have, then that was no-one’s business, and no one was there to see. If sometimes his dreams were filled with thoughts of places outside the Shire, far to the east, places he might let the wind take him if ever he were to lift his feet from Hobbiton, then that was just for him to know.</p>\n<p>He had his friends, and his books, and the children who loved his stories and his games. He had a full pantry, and a warm hearth, and good pipe-weed to smoke. He was <em>fine </em>with that.</p>\n<p>Really.</p>\n<p>And most days he even believed himself.</p>\n<p>The thought of it now, an unwelcome reminder of the real reason he had run out of his door on this ridiculous quest, had him lying awake that night, staring into the embers of the fire from across the camp. Gandalf sat, awake, smoking his pipe, the glow-and-fade of the bowl as he inhaled and exhaled a silent comfort in the darkness.</p>\n<p>The sleep murmurs and heavy breathing of the Company were strangely soothing, but the conversation from earlier nagged at his mind. It made him deeply uncomfortable that his new found friends knew of it: it had been quite pleasant to get away from the stigma that he had carried since he had come of age.</p>\n<p>What if the Company responded the same way that the other Hobbits of the Shire had done to his name, if they knew?</p>\n<p>He rolled on to his front, burying his face in the cloak that he was using for his pillow. It smelt of the wind, and rain, and the outside world.</p>\n<p>Nothing at all like Bag End, but still comforting, in an entirely different way.</p>\n<p>It smelt <em>exciting. </em></p>\n<p>They would forget about it, he decided, closing his eyes. It was just a passing comment, and he could quickly brush it off as a joke or a boring oddity of the Shire, and they could go on with their adventure without it ever having to be brought up again.</p>\n<p>Things wouldn’t change.</p>\n<p>Balin would still tell him stories. Nori would keep teaching him how to throw a knife and he and Ori would talk about poetry.</p>\n<p>Gloin would still share all the joys of his family life to him, Bofur would keep showing him the figurines he whittled as they sit around the campfire, and Dori would continue to fuss and brew him tea from the fine bags of leaves that he kept stitched to the lining of his coat.</p>\n<p>He would still have flowers passed to him as they travelled by Bifur, with a grunt of khuzdul he didn’t understand, and Bombur would still ruffle his hair when he found mushrooms that could be added to dinner.</p>\n<p>If he scraped his ankle against a rock that didn’t have any impact against the strong leather of the others’ boots, Oin would still slip him a healing salve in the evenings. Dwalin would still roll his eyes and take his little sword to sharpen, angling in such a way that Bilbo could watch and learn without having to offer to teach.</p>\n<p>Fili would still laugh in that particular wicked way whenever Bilbo did or said something amusing, and Kili would still pick him up around the middle and spin him around to stop him complaining.</p>\n<p>And Thorin… well. Thorin would still look at him with that strange, evaluative stare, or perhaps even smile, as he had done a few times since the Carrock.</p>\n<p>He tossed and turned, worrying at his lip with his teeth, remembering his mother’s tears after his Naming, and the way that the lass he had been courting started returning his flowers, untouched.</p>\n<p>The memories, though old now, still stung at him. They had an edge that should have been dulled with time, but a life of loneliness had kept them bitter-sharp.</p>\n<p>It took him a long time to get to sleep, that night.</p>\n<p> </p>\n<p>--</p>\n<p> </p>\n<p>Unfortunately, it seemed that it had not been forgotten for good. Only a couple of days later, as they were resting in the house of the rather startling shape-shifter Beorn (and honestly, if only the folks back in the Shire could see this place and it’s serving animals, they wouldn’t know what to think!) that the conversation rose again.</p>\n<p>Gandalf, thankfully, was not the instigator of it this time: if he had been, Bilbo was not sure that he wouldn’t have brained him over the head with one of the over-sized flagons that they were currently drinking from.</p>\n<p>They were all in good spirits: for the first time since Rivendell they had good food (though Bilbo suspected that the Dwarves would continue to moan at the lack of meat given half the chance), warmth and security, and it had lifted their spirits exponentially. Bilbo was sure he had not seen them all in such a good mood since they had raided his pantry the night they had arrived in the Shire.</p>\n<p>Dwalin was singing, his rich baritone surprisingly smooth, in their own tongue. Bilbo didn’t understand the words, but there was something comforting about the sound. Some of the other dwarves were humming along, singing odd snatches of the words, a pleasant background of melodic noise that settled his frayed nerves and darting mind.</p>\n<p>Bilbo caught Thorin’s eyes, dark and unreadable, and immediately busied himself with food instead of holding that impossible stare. The rest of the Company had long since finished eating, but a Hobbit’s appetite took much more to satisfy, and he was more than willing to fill his stomach whilst he was able.</p>\n<p>The fire roared in the hearth, the wind an audible presence outside, and the large hall began to feel almost cosy, despite its obscene proportions. The Hobbit had found himself sat opposite Nori at the table, and he was currently too distracted with honey-cakes and avoiding the gaze of their leader to notice his expression of interest.</p>\n<p>Perhaps he should pay less attention to his food in the future: had he, he might have been able to escape.</p>\n<p>“So tell me, Burglar, what is this mysterious name you have?”</p>\n<p>He almost choked on his mead.</p>\n<p>From further down the table, he was <em>convinced </em>he could hear Gandalf chuckle.</p>\n<p>The bastard.</p>\n<p>“It is not mysterious, merely private, thank you.” His voice was clipped, and possibly a little rude, but the topic was unpleasant, and he felt defensive.</p>\n<p>Unfortunately, this only seemed to spur Nori on.</p>\n<p>“Is it customary of Hobbits, to keep a second name a secret from your friends?”</p>\n<p>Bilbo tried and failed to hide his frown. Friends? He supposed that they were, now, but it was the first time that any of the Company had spoken such a thing out loud, and now he was beginning to feel the creeping shadows of guilt. Something twisted inside him at the thought that he might be offending them, this strange little band that had welcomed him as one of their own, albeit unwillingly and after some time.</p>\n<p>It was not their fault, surely, that they didn’t understand the ways of the Shire, or the <em>rudeness</em> of asking straightforwardly about an inner-name. He sighed to himself, staring into his mead, wondering what he could say on the matter without doing anything that would make his dear parents turn in their graves at the impropriety.</p>\n<p>He completely missed the fact that the rest of the Company, overhearing the conversation, had started to quiet, not-so-subtly listening in to what he thought was a private conversation.</p>\n<p>Bilbo ran a hand through his hair.</p>\n<p>“It is a matter of tradition, rather than a secret. It is only said in front of a group twice in your life, and only told to those closest to you. All Hobbits have one, and it… it is not done, really, to talk about it. Please do not take it as a slight.”</p>\n<p>Kili was rather offended by this. “Are we not close to you, Mr Boggins?”</p>\n<p>Bilbo wondered if this was what a rabbit, caught in the inevitable line of fire of a master archer, felt like. Looking around the room, he realised that not only had Dwalin stopped singing, but that Ori had already started making notes. Kili looked nothing short of devastated at the admission: really now, no one should be able to slay Orcs mercilessly <em>and </em>be able to stare at a body quite so pitifully.</p>\n<p>He wrung his hands.</p>\n<p>“Not at all, not at all- it’s just-”</p>\n<p>“If Master Baggins does not feel willing to share his name with our Company, then it is none of our concern.”</p>\n<p>That shut everyone up, including Bilbo. Thorin’s voice had a natural ability to cut through conversation and dampen it when he chose to, as he had done now. Ori slowly put away his notebook, and Nori turned his attention back to his flagon, frowning a little.</p>\n<p>Balin began to hum again, and soon several others joined in, until another song echoed around the room.</p>\n<p>Only Kili kept staring at him, but soon his brother’s whispered words in his ear drew him back into a close and quiet conversation between the two of them.</p>\n<p>Bilbo would have felt better that the attention had gone from him again, had it not been for the edge of coldness to Thorin’s voice. It had been absent since their meeting with the Orcs in the Misty Mountains, and Bilbo could not work out if it had returned out of irritation, which would have been regrettable, or hurt, which would have been far, far worse.</p>\n<p> </p>\n<p>--</p>\n<p> </p>\n<p>“I bet it’s an <em>Elf </em>name.”</p>\n<p>Fili scoffed. “Hobbits wouldn’t find that anywhere near as insulting as we would, you idiot.”</p>\n<p>Kili’s eyes widened.</p>\n<p>“How could they not?”</p>\n<p>Quite unable to answer this, the older brother clicked his tongue and decided to change the subject, unwilling to admit that he didn’t know. <em>“I</em> bet it is a flower name.”</p>\n<p>Kili crowed with laughter. “Bilbo Daisy Baggins.”</p>\n<p>“Primrose.”</p>\n<p>“<em>Rosie.</em>”</p>\n<p>“Those are all girl’s names, you know, and not at all offensive by Shire-reckoning.”</p>\n<p>Bilbo was trying very hard not to be irritated by the almost constant barrage of guesses about his name. No one had spoken to him directly about it since, but several times since they had entered this accursed wood he had come across other members of the Company discussing it, deliberately within his earshot. Despite Thorin’s words, it seemed that they had taken offence to the fact that, in their eyes, their resident Hobbit did not trust them enough to give them his true name.</p>\n<p>Fili and Kili’s jokes would normally have caused him to snap at them, but their laughter cut through the darkness of the trees, and he found himself loathe to put a stop to it, despite the permanent ache that constant discussion of the subject had created in his chest.</p>\n<p>“Look, even if I did tell it to you, it’s not like you would understand it.”</p>\n<p>Ori’s eyes were wide from across the camp they had set for the night. “What do you mean, Mister Baggins?”</p>\n<p>Bilbo poked at the ground with a stick, shrugging.</p>\n<p>“It’s in our own tongue, which is a highly guarded secret. So unless any of you have been undercover in the Shire for the last decade, which I highly doubt you would have gotten away with given your beards, you wouldn’t understand the meaning, anyway.”</p>\n<p>The Company were looking at each other in surprise. Well, that is what Bilbo thought they were doing, anyway: it was difficult to tell in the gloom of Mirkwood. It was Balin that spoke, in the end, his words careful as if he thought Bilbo to be a deer in the forest, likely to sprint away at any unexpected movement or sound.</p>\n<p>“I was not aware that Hobbits had any language of their own.”</p>\n<p>Bilbo tried to stop himself from rolling his eyes, then remembered that no one could see him and did so anyway.</p>\n<p>“Of course we do. Why wouldn’t we?”</p>\n<p>“Well… no one has ever mentioned it.”</p>\n<p>“That would be the nature of a secret, yes.”</p>\n<p>Ori was scribbling in his notebook, although it was doubtful that he could actually see his own words. Once again, Bilbo found himself the focus of all of the Company’s attention.</p>\n<p>“What is it like?”</p>\n<p>“Is it like Elvish, or like our own tongue?”</p>\n<p>“Or something more similar to the tongues of man?”</p>\n<p>Bilbo rubbed a thumb across his lower lip, wishing for his pipe, though he was long out of leaf. Would it be so wrong to talk about their language here, so far from home? This was the most cheerful he had seen most of the Company since they had entered this damnable wood, and he had no desire to remind everyone of their grim surroundings. And really, what harm could it do?</p>\n<p>“It is nothing like any of those, as different from Elvish and Dwarvish as they are from each other.”</p>\n<p>Ori looked like someone had given him a decade’s worth of Yule gifts in one go.</p>\n<p>“Could you teach me?”</p>\n<p>That was perhaps one step too far: as far as he knew, no one had ever taught an Outsider their tongue before… though the longer he spent outside of the Shire, the less he was remembering why that was. </p>\n<p>He paused before he answered, suddenly unsure at the sliding importance of propriety within his own mind.</p>\n<p>“Perhaps, one day.”</p>\n<p>Ori seemed surprised at this, and Bilbo felt a little guilty that he had been expecting an outright rejection. He supposed that he had been rather standoffish when it came to discussing his own culture, though much of that was just due to his discomfort at the subject of his name.</p>\n<p>“Then… could we hear some?”</p>\n<p>Balin was staring intently at him, waiting to see how he would answer Ori’s question. Fili and Kili had stopped their roughhousing to listen to the conversation, and even Gloin was tucking the locket holding pictures of his wife and son back into his clothing. He swallowed. Well, why not?</p>\n<p>Their language was not commonly used for conversation anymore. Instead, it was a tongue reserved for special occasions, for Blessings and wishes of luck – it took him a moment to think of something to say, and in the end came up with the New Moon Blessing. The syllables sounded strange in his current company, where once they would have seemed normal.</p>\n<p>Ori was still scribbling.</p>\n<p>“What did that mean?” asked Dori.</p>\n<p>Bilbo rubbed the back of his head.</p>\n<p>“It is the Blessing we say whenever the moon wanes and disappears, wishing for its light to return. It just a saying.”</p>\n<p>Dwalin snorted.</p>\n<p>“Sounded Elvish to me, lad.”</p>\n<p>Kili shook his head. “Didn’t. I don’t know what it sounded like, but it wasn’t that. Bilbo, could you <em>say </em>your name to us? Does it count as telling us if we don’t understand what it means?”</p>\n<p>Honestly, the persistence of these boys.</p>\n<p>“Kili, I’ve never told <em>anyone </em>my name before. I’m not going to do it simply to appease your curiosity, as much as you might want me to.”</p>\n<p>Fili frowned.</p>\n<p>“Why is that, Bilbo?”</p>\n<p>He shuffled uncomfortably.</p>\n<p>“My name is… unfortunate, by Hobbit standards. It is why I have never married and live alone.”</p>\n<p>There was silence. No one seemed willing to meet his eyes: Ori had even stopped scribbling. When it became clear that no one quite knew what to say, he cleared his throat and made to retreat to his bedroll. It was only as he was lying down that the conversation resumed, quieter and more subdued that before, the group slipping into khuzdul.</p>\n<p>It was quite obvious that they were talking about him, and he squeezed his eyes shut.</p>\n<p>There was a shuffle as Dwalin and Gloin stood up to take watch, and Thorin and Bofur came to sit by the fire. They had been sat on the outskirts of their camp, but not too far away that they would have missed the conversation.</p>\n<p>Bofur sighed.</p>\n<p>“Is the lad alright?”</p>\n<p>There was a murmur from the others.</p>\n<p>“Perhaps next time, you might think before you pry into matters that do not concern you.”</p>\n<p>Thorin’s comment was unexpected, but the tone was concerned, and lit something warm in Bilbo’s chest.</p>\n<p> </p>\n<p>--</p>\n<p> </p>\n<p>No one brought up the awkward conversation, but their priorities soon shifted as they found themselves captured twice over, first by spiders and then imprisoned in the cool, dry cells of Mirkwood’s kingdom. Bilbo quickly found his Company again, disguised by the curious little ring he’d found, but soon realised that there was little for him to do except for fret and run messages between cells.</p>\n<p>There was no way out, no way to escape, and precious little any of them could do about it.</p>\n<p>The ring kept him hidden- and hadn’t his Company reacted to his find in equal parts glee and concern when he had been forced to tell them all how he was keeping out of sight for so long! It was certainly proving useful now, and for the first time on this quest he felt as if he were finally proving his worth to them all.</p>\n<p>He smuggled extra food to each dwarf in turn, listened in on both the guards and- when he was feeling particularly daring- the Elf-King’s court, passing on the scraps of information he picked up to Thorin whenever he passed his cell, separated from the rest of the Company.</p>\n<p>Though most of what he had overheard was useless, he still found himself returning to Thorin’s cell more than any other. He told himself it was because it was set apart from the others, who at least could yell at each other through the bars, and Thorin was likely missing conversation.</p>\n<p>He knew, in reality, it was nothing to do with that.</p>\n<p>“Perhaps we should change your title to spy, rather than burglar, Master Baggins.”</p>\n<p>All Bilbo could do was smile wanly through the bars. Wearing the ring for such long periods of time was starting to wear him down, he thought- the world seemed strangely listless whenever he wore it, exhausting him in a way that was neither mental nor physical, but a little of both. Though he would never criticise it for its usefulness, he wished more than anything that he could find a way out, if only so he could go a day without wearing it. A decent meal and a full night’s sleep wouldn’t go amiss, either.</p>\n<p>Thorin watched him, frowning.</p>\n<p>“You are exhausting yourself.”</p>\n<p>Bilbo shrugged, a little offended at the tone, which seemed to imply a weakness on his part.</p>\n<p>“I will rest when we have escaped.”</p>\n<p>“You will not find a way out if you are too tired to think.”</p>\n<p>Bilbo wondered, not for the first time, if a Hobbit could be prosecuted under the laws of the Dwarfs. Perhaps he should ask Balin. If not, he would quite happily consider regicide.</p>\n<p>Instead, he gritted his teeth.</p>\n<p>“I would have thought I had proved myself to you by now, Master Oakenshield.”</p>\n<p>There was a long pause between them.</p>\n<p>“They will be bringing around the evening meal soon.”</p>\n<p>“Indeed. I will leave you to dwell on our escape, seeing as I am apparently unfit to do so.”</p>\n<p>Thorin sighed, and it was a defeated sound, one that Bilbo found oddly discomforting coming from him.</p>\n<p>“I did not mean it like that.”</p>\n<p>“Indeed.”</p>\n<p>Bilbo made to put his ring back on- the Company had all expressed uneasiness at speaking to him when invisible, though it was only with Thorin, whose cell was much deeper in the prison where only the guards who brought meals on schedule appeared, that he actually removed it. But before he could he was startled into stillness by the unexpected brush of fingertips against his cheek.</p>\n<p>Thorin could only reach so far through the bars, but he had done so anyway, and now they found themselves staring at each other, silently.</p>\n<p>The touch was warm, and the first that Bilbo had had in days. That was the excuse he gave himself for leaning into it slightly.</p>\n<p>“I meant that you could slip in the door when they come in, and rest until the next meal.”</p>\n<p>Bilbo stared back at him. It was a foolish risk.</p>\n<p>He didn’t have time to answer before the sound of light footfalls and the jangle of keys came from around the corner. Thorin retreated to the back of the room as Bilbo slipped the ring on. The Elf that opened the door to retrieve Thorin’s bowl and to check the room for any signs of trouble or escape- apparently the Elves were not daft enough to forget that Dwarves were notoriously good miners- didn’t even feel him slip inside after him.</p>\n<p>It was only as the key locked them both in and the footfalls disappeared that he dared to look at Thorin.</p>\n<p>To his surprise, Thorin’s eyes were almost wild as he stared around him, dark with some strange, unnamed shadow.</p>\n<p>“Bilbo?”</p>\n<p>With a start, he realised that that was the first time Thorin had ever called him by his name, and was a little ashamed of the heat that flickered in his chest at the sound of it. Thorin’s voice was hesitant, almost afraid, and Bilbo remembered that he had not given him an answer.</p>\n<p>“I’m here.”</p>\n<p>He slipped his ring off, and barely had time to breathe in relief as Thorin’s hands were back on his face, turning it with a surprising gentleness as if checking for some injury he had not been able to see through the barred window.</p>\n<p>The tips of his ears, he knew, were already turning red.</p>\n<p>It had seemed that he had passed muster, because Thorin let go of his face and took a step back, though his eyes still raked up and down his body, making sure.</p>\n<p>“Sleep, Master Baggins. You need it.”</p>\n<p>He allowed himself to be lead towards the narrow bunk, already missing the sound of his name in Thorin’s voice. He let himself be pushed down, and though the mattress was thin it felt like heaven after weeks of sleeping on the ground and curled up in corners in the prisons.</p>\n<p>“Let me know if anyone comes?”</p>\n<p>Thorin nodded.</p>\n<p>“I will wake you, Burglar, should the need arise.”</p>\n<p>He felt sleep begin to take him almost as soon as he lay down, Thorin’s hand a point of warmth on his shoulder, as if the Dwarf did not trust him not to disappear and run.</p>\n<p>His voice was muffled by his exhaustion.</p>\n<p>“Bilbo. You called me that before. My name is Bilbo.”</p>\n<p>He almost missed the strange, choked off laugh that came in reply, and almost missed the strange, soft sound of Thorin’s voice, rolling through the thick veil of exhaustion.</p>\n<p>“No, it isn’t.”</p>\n<p>He wasn’t sure if he imagined the hand that skimmed lightly through his hair.</p>\n<p> </p>\n<p> </p>\n<p>--</p>\n<p> </p>\n<p>The sleep, it seemed, had paid off. The next day inspiration had struck, and that afternoon, as the guards dozed, he had his Company had arrived in Laketown. Even he had to admit that the rescue could have been better, but he had done the best that he could, and though the Company were damp and tired- and Fili still smelt faintly of apples- he was filled with relief that they were <em>here</em>.</p>\n<p>Their entry into Laketown had been met with mixed responses, but the Master had given them a small house to stay in. It lacked the size of Rivendell and the comforts of Beorn’s, but Bilbo felt hard pressed to compare it with their previous hosts- it was a roof and a bed, and no one was locking them in, which was a damned improvement.</p>\n<p>Though small, the house was well equipped, and Bombur had busied himself in the kitchen as the rest of the Company waited in turn to use the bath and change into the assortment of clothing that had been delivered to them. It had been a great relief to sink into warm water and rid himself of the accumulated filth of weeks of hard living, wonderful to fill his stomach with a hot dinner, and even better to find pouches of pipeweed and pipes in the various items the Master had had delivered to them.</p>\n<p>He sniffed the weed apprehensively as he made his way out onto the wooden balcony overlooking the lake, wanting to feel the dying sunlight on his face. It smelt muskier than he was used to, perhaps a little bitter, but any port in a storm.</p>\n<p>He sat on the edge, feet dangling over, the smoke curling around his face in a pleasantly familiar sensation, and wondered.</p>\n<p>The sense of relief at pulling the various members of the Company out of their respective barrels had been like a punch to the gut. It was perhaps only now that he was realising the depth of feeling he had for their motley crew- though strange and unseemly, ill-mannered by his reckoning, it seemed that he had, for the first time in his life, found a group of people that he belonged to.</p>\n<p>It made his thoughts on them before seem uncharitable, and unkind.</p>\n<p>He watched the sun set over the lake, and thought to himself.</p>\n<p>Here, far from the rolling hills of the land he had been raised in, he had found friends that he loved enough, in his own way, to call family.</p>\n<p>And with that realisation came an urge, one that he had never felt before, to share.</p>\n<p>Finishing his pipe, he got back to his feet and wandered back in, finding the rest of the Company all washed, sat before the great roaring fire as the night bore in. Their hair, gleaming and damp still, reflected the warm firelight as they sat around in small groups. Dori was braiding the intricate patterns into Nori’s hair, and Dwalin, to his great surprise, was gently working the tangles out the back of Balin’s silver mane, where he could not reach. Kili, sat closer to the fire, was finishing braiding Fili’s moustache, capping them with the silver beads that Bilbo was now so used to seeing.</p>\n<p>He wandered closer to the fire, warming his feet and wondering aloud.</p>\n<p>“Are the braids a custom, for your people?”</p>\n<p>Balin nodded, smiling gently, looking almost as if he were dozing as his brother continued to brush his hair.</p>\n<p>“Indeed. We are given our first as we come of age, and though some are for vanity, most have meanings.”</p>\n<p>Bilbo nodded.</p>\n<p>“It seems that all races have customs for their coming of age, then.”</p>\n<p>Ori brightened.</p>\n<p>“Might you tell us something of Hobbit customs, Master Baggins?”</p>\n<p>Bilbo tapped his chin, smiling to himself.</p>\n<p>“If you like.”</p>\n<p>Ori seemed to remember himself, and their previous conversations, and frowned, clearly worried that he might offend their Burglar again.</p>\n<p>“It need not be about names, Master Baggins. And you need not at all, in fact. I-”</p>\n<p>“Peace, Ori.” Bilbo’s smile was not pained. “I will speak of names, if you like, for they are the main custom that Hobbits have that none others do, it seems.”</p>\n<p>He paused, not noticing the worried glances that the group were all giving each other. Instead, he wondered only how to begin.</p>\n<p>“Hobbits are all given their inner name on their coming of age. It is divined from the leaves of the first cup of tea they brew as an adult-” he shot a glare at Dwalin, who had snorted at that admission. “It may seem odd to you, but tea is <em>very important </em>to us, I’ll have you know. Though it will never be spoken aloud to a group again until their wedding, we all know most of our friend’s and family’s names, having heard them at the coming of age- it is a big occasion, you see, and always a big party.”</p>\n<p>Bilbo paused, and knocked the bowl of his pipe into the fire, emptying the remains.</p>\n<p>“The name you are given is more than just a name. It is a reading of your future, and the life that you are destined to live. Some have names relating to the Hobbit that they will love- my father’s, for example, mentioned the sowing of the flower that my mother was named for. That is the most common kind of inner-name, and it is considered a great blessing when both partners’ names reflect each other. My own parents’ did.”</p>\n<p>He settled himself down at the far end of a wooden bench, not looking at any dwarf in particular but knowing that all eyes were on him, shifting a little under the focused attention.</p>\n<p>“The other common kind of name is to do with your home, or the home that you will find your happiness in. That might involve the name of the smial, the first wildflowers that appear on top of it, something like that.”</p>\n<p>Balin, out of the corner of his eyes, noted the tight fists that Thorin’s hands had formed at his sides.</p>\n<p>“There are other kinds of names, of course, and some more cryptic than others, but there has never been a name more ill-thought of than mine, as far as I am aware. It refers to my home, which is fine in itself, but…”</p>\n<p>He trailed off. He had come back inside with every intention of telling the Company more about himself. He had never wanted to divulge his name to any friend before, knowing that it would only be looked down on with pity. But now he did, more than anything, and he found that the words caught in his throat.</p>\n<p>He shook himself.</p>\n<p>“My name… it’s difficult to translate.” He frowned as he tried to think of the best way to phrase it, and came up blank. “It means that I would never have a home in the Shire, at any rate.”</p>\n<p>Nobody said anything, and for a moment Bilbo thought that he heard his mother’s laughter coming from the street below, before realising it was just the sound of a passer-by.</p>\n<p>The silence continued, and he examined the bowl of his pipe, not wanting to look up to see their expressions. He spoke more to break the hush than anything else.</p>\n<p>“It is why I never married, why I lived alone. Shire-folk value home more than anything else, you see.”</p>\n<p>He shook his head, finding a small smile come unbidden to his face.</p>\n<p>After all these years, he had finally said it, and to his great surprise, it did not hurt as much as he had thought. In fact, the ache of it seemed almost to recede, as if he had let go of some burden that he had not realised that he had been carrying; it was relief that struck him first, and then a strange, wistful peacefulness.</p>\n<p>“That is also why I have never told anyone my name, because Hobbit’s are a little… I suppose, superstitious about bad-luck names. Friends I had before my name-day drifted away: the lass I was courting turned me down immediately. But…” He laughed, softly, more to himself than to anyone else. “Somehow I feel that I can speak of it now. Isn’t that strange?”</p>\n<p>There was a long, strained silence, and then with a startled cry Kili threw himself at the Hobbit, throwing his arms around his middle, kneeling on the floor by the bench. The young Dwarf pressed his face into his chest as his arms tightened around Bilbo.</p>\n<p>“Mister Boggins, that’s <em>awful.</em>”</p>\n<p>Bilbo put his pipe down, and patted the Dwarf gently on the head.</p>\n<p>“Really, Kili. It’s alright.”</p>\n<p>And he smiled, because for the first time, it really <em>was.</em></p>\n<p> </p>\n<p>--</p>\n<p> </p>\n<p>Thorin was staring at him.</p>\n<p>It had been happening more and more often since their first evening in Laketown, and though that in itself did not particularly concern him- he was quite used to odd looks from the men of this floating town- it was starting to get a little awkward how often their eyes <em>met. </em></p>\n<p>Honestly, before now he hadn’t realised just how often he found himself staring in turn at Thorin.</p>\n<p>They sat around the fireplace for the last time, the curling smoke from several pipes in the air. They were leaving in the morning, Durin’s Day rapidly approaching, and Bilbo couldn’t help but wonder whether the next fire he saw would be from a celebratory campfire or from a dragon’s mouth.</p>\n<p>But the dread in his chest was being offset by the pleasant rumble of Dwalin’s singing and the comforting clatter of Ori’s knitting needles. Fili was a warm presence on the bench next to him, and Bofur was whistling quietly as he sculpted something from a scrap piece of kindling. The low murmur of voices was a warm backdrop to his pleasant mood; the presence of the Company wrapped around him like a familiar blanket, holding him close within their group.</p>\n<p>It was really quite lovely.</p>\n<p>Even if Thorin was staring at him.</p>\n<p>He brushed his hair back from his eyes, frowning a little at the length of it. Fili noticed and laughed, nudging him in the side.</p>\n<p>“You should braid your hair back, Bilbo. Anyone would think you are pony, the way you keep tossing your head.”</p>\n<p>There was a rumble of laughter from around the room, and Bilbo grinned in return. Once teasing like that would have made him flush in embarrassment, but it seemed that his travels had thickened his skin somewhat.</p>\n<p>“I would if I knew how, but it is not a habit shared by Hobbits, I am afraid.”</p>\n<p>Kili, from where he lay sprawled on the floor, grinned up at him.</p>\n<p>“One of us can do it for you, if you like?”</p>\n<p>There was a sudden weight to the room, and Bilbo rubbed the back of his head.</p>\n<p>“Ah… I thought that was something only family could do?”</p>\n<p>Kili shrugged, still draped across the rug, looking for all the world like a contented cat.</p>\n<p>“You shared your name with us, I think we can share our braids with you.”</p>\n<p>There was a long moment of silence before the entire group broke out in low murmurs of agreement, and from the corner of his eye Bilbo saw Balin grinning, as if he were in on some private joke that no one else understood.</p>\n<p>“Well… I guess then, if it really is alright? I mean, if one of you wouldn’t mind doing it?”</p>\n<p>Dwalin coughed, Bombur started humming, and for some reason everyone looked a little smug. Bilbo looked around them, his eyes narrowing. Kili was grinning fit to burst, and Dori was smiling contentedly into his cup of tea. Ori had reached for the journal in which he was chronicling their quest, and was writing furiously.</p>\n<p>“What? What did I miss?”</p>\n<p>To his surprise, it was Dwalin that answered.</p>\n<p>“Offerin’ to braid another’s hair is a sign of comradeship in our kind, lad. Accepting means accepting that in turn.”</p>\n<p>There was silence, and Bilbo still felt a little confused by the reaction. Surely the Dwarves understood that he considered them as close as kin? But he felt as if there was still some unspoken message that was flying above his head: he tried to catch the eye of any of his friends, but they all seemed to turn away, looking around them or even up at the ceiling to avoid his gaze.</p>\n<p>It was with a sigh that Thorin finally joined the group, pushing himself up from the wall against which he had been leaning. He strode around the back of the bench on which Bilbo was sitting, his face unreadable.</p>\n<p>“Very well.”</p>\n<p>Bilbo had to suppress a startled noise when Thorin came right behind him, his body so close to the back of Bilbo’s that he could feel the physical warmth of him.</p>\n<p>“Ah… are you sure it is okay?”</p>\n<p>He didn’t quite dare turn to look at Thorin, but the deep rumble of his voice rolled over him, pitched low.</p>\n<p>“You gave us your name, we can give you our braids.”</p>\n<p>He said no more, but then his fingertips were pushing his hair back from Bilbo’s forehead, hot against his skin, and the wayward curls that had been bothering him for weeks now were being gently pulled and intertwined.</p>\n<p>Bilbo’s neck was prickling with warmth, and his eyes slipped shut almost of their own accord for a moment even as a partially created braid fell apart. Thorin cursed quietly behind him, and strove to pick up the strands again.</p>\n<p>“Sorry, my mother always said my hair was a pain to look after.”</p>\n<p>Balin smiled gently at him before heaving himself to his feet.</p>\n<p>“We’re not so used to curly hair, lad, that’s all. Thorin’ll figure it out.”</p>\n<p>He took his leave of them, as did several others; he leant back a little, relaxing into the soothing touch, and by the time Bilbo had opened his eyes again there was just Kili, flat on his back but watching them out of the corner of his eye, and Fili, still at his side. Bilbo rubbed half heatedly at the prickle up and down his arms, the fine hairs standing on end, only for them to intensify as Thorin bent closer, his breath ghosting over his ear.</p>\n<p>His shudder must have been visible, because suddenly Kili was grinning wickedly up at his brother, and Fili was shifting besides him.</p>\n<p>“Come on, Kee, I think it is time for us to get some sleep. Early start tomorrow.”</p>\n<p>Kili let Fili pull him to his feet, whispering something into his ear as they left the room. It was noticeably quiet, now, and the feeling of Thorin’s fingers running through his hair was almost too much. There was a cool weight against the skin behind his ear, and it took him a moment to realise that it was a bead. Which meant that his braid was finished, and yet Thorin’s hands were still tracing gentle patterns against his scalp.</p>\n<p>A finger traced the curve of his ear, and he took in a deep breath, trying to hide the flush of heat that he was sure was painted across his neck and face.</p>\n<p>He was a little afraid to speak.</p>\n<p>Fingers were running down the curve of his neck now, dipping into shallow groove of his collarbone, ghosting along the line of his jaw, and against his will he felt his head fall back, against the back of the bench. Thorin’s face, above him, was unreadable.</p>\n<p>The lamps had burnt low: flickering shadows from the firelight played across the strong planes of his face, and Bilbo had to physically fist his hands to stop from reaching up to touch in return.  </p>\n<p>Thorin’s fingertips were still tracing a restless journey, and as one brushed across the sensitive lobe of his ear he couldn’t help but bite his lower lip, slowly releasing it as Thorin drew in a ragged breath and drew suddenly away, taking a step back.</p>\n<p>Bilbo felt suddenly cold without the dwarf’s hands against his face and neck. “The east wind calls you home,” he said, a little breathlessly.</p>\n<p>Thorin frowned, confused.</p>\n<p>“I never actually told you my name. That’s what it means, or as best as I can translate it.”</p>\n<p>Thorin was staring at him, his expression unreadable.</p>\n<p>Bilbo found himself growing more and more flustered, and he wrung his hands.</p>\n<p>“You… you said I gave you your name, so you would give me your braids. But I didn’t. I hadn’t.”</p>\n<p>He bit the inside of his mouth to stop himself from speaking any more.</p>\n<p>Thorin nodded, and Bilbo felt oddly bereft as he took another step away.</p>\n<p>“Thank you.”</p>\n<p>It was a quiet reply, almost imperceptible as the logs in the fire let out a crack, but there was a warmth to it that drew Bilbo’s mouth up into a smile even as Thorin slipped out of the door.</p>\n<p> </p>\n<p>--</p>\n<p> </p>\n<p>The dragon had been alive.</p>\n<p>Of course it had. Of course it bloody well had been, because it was <em>Bilbo Baggins </em>who had been sent in, and really Gandalf shouldn’t have picked the unluckiest Hobbit in the Shire for a quest like this and expected it to have gone any other way. And then, when the dragon had been killed, and the armies had closed in around the mountain, he came to the conclusion that if he was going to be bad luck, he might as well be bad luck that <em>achieved </em>something, particularly if that something was saving the lives of the Company that he had opened up to, that had become, in their own way, his family.</p>\n<p>Because there were a lot of things that he could deal with. He had coped with loneliness, and the bitter realisation that he would never find a person to share his life with (even if, recently, he had started to wonder about that). He had lived through the loss of his parents, the only family he had ever really known, and he had come to terms with the fact that he himself would never be a parent in turn.</p>\n<p>But he could not deal with them dying for a pile of shiny coins and a foolish King’s blindness.</p>\n<p>So he’d taken the Arkenstone, and things had escalated, and now he was terrified, and all the bad luck of his past felt somewhat inconsequential, because Balin had found him in the Laketown camp, his face lined and grave.</p>\n<p>At first Bilbo had been convinced that he was being given his marching orders, something he had expected to happen, though not quite so soon, but then Balin had wrapped him up in an embrace close enough that Bilbo had been able to feel the tremors running through the old dwarf.</p>\n<p>“He’s asking for you, lad. Hurry.”</p>\n<p>He was getting too many odd looks as they walked through the camp, but he couldn’t quite bring himself to care. The royal tent was obvious not just from the banners flying above it, but for the fact that the Company were all huddled around the entrance, several of them bearing gashes or bandages, but none of them looking too worse for wear.</p>\n<p> </p>\n<p>He barely registered the smiles and pats as he passed them by.</p>\n<p>Balin hesitated before pulling back the opening.</p>\n<p>“We don’t know if they’ll make it through the night.”</p>\n<p>Fili and Kili’s bunks had been pushed next to each other, both of them covered to the neck in thick furs. They had turned to face each other in sleep, and Bilbo fought a pain in his chest when he noticed that one of Kili’s hands was holding tight to one of the braids of Fili’s moustache.</p>\n<p>And this, this was what he had been trying to avoid, and yet it had happened anyway. He had been able to cope with the feel of cold hands around his throat, bitter words echoing around him as he was cast out from the mountain, as much as it had hurt; the sight of Kili, clutching his brother’s braid as if it was the only thing that kept him here, was too much.</p>\n<p>He felt his face crumple, and had to work to keep his emotions under check.</p>\n<p>“Master Baggins.”</p>\n<p>He tore his eyes away from the two, and turned to the other occupant of the tent, a little wary. Though he had taken Balin’s word that Thorin did not intend him any harm, he could not help but approach the bunk cautiously.</p>\n<p>“Master Oakenshield.”</p>\n<p>Thorin winced, and Bilbo was not sure if it was because of his cold tone or the numerous wounds that littered his body, covered by bandages and furs.</p>\n<p>“Bilbo.”</p>\n<p>They regarded each other for a moment, as too wild animals who came across each other unexpectedly might, before Bilbo’s shoulders sagged, and slipped into a stool at Thorin’s bedside. He was too tired for this.</p>\n<p>Thorin’s mouth twisted, though whether it was supposed to be in a frown or a smile Bilbo could not tell.</p>\n<p>“Why were you on the battlefield?”</p>\n<p>Bilbo’s eyes widened. He had kept his ring on for much of the battle, using the stealth it gave to his advantage; no one had even realised he was there until afterwards, when he had stumbled back into the camp. He had not realised that Thorin had known, and he shifted uncomfortably.</p>\n<p>“I could not have left you. You all.”</p>\n<p>Thorin nodded, wincing again, and Bilbo felt something heavy in his throat. There was a weight pressing down on his chest, hot and painful. It hurt to breathe, and he suddenly realised that this is what it would feel like, every day, if Thorin and his nephews did not make it through the night. It was with sudden clarity that he understood that the pain might fade over time, the tide of grief recede, but it would never truly leave him. The loss of any member of his strange, ersatz family would leave a chasm in him that he would never quite be able to fill.</p>\n<p>This was no name for recriminations or rage; not if there may not be another chance.</p>\n<p> He reached out, gently taking Thorin’s hand, fisted against the furs, in both of his.</p>\n<p>Thorin stared at him, something in his eyes seeming to break at the touch.</p>\n<p>“I would take back every word I have said against you.”</p>\n<p>His eyes were burning with honesty and something dark, painful. It was so different to the glaze that Bilbo had been confronted with in the mountain, in the wake of the lure of the gold, and he nodded.</p>\n<p>“I know.”</p>\n<p>“I do not expect your forgiveness for my actions, but-”</p>\n<p>“I’m sorry, too. Not for what I did, but that the situation came to it. That I couldn’t think of a better way.”</p>\n<p>Thorin thumb brushed across his knuckles.</p>\n<p>Bilbo smiled. It was a weak, poor excuse of one, but he tried none the less.</p>\n<p>“You should try and sleep.”</p>\n<p>Their fingers laced together, Thorin’s a little cool, but Bilbo hardly noticed them. The Dwarf’s eyes were on his face, as intense as they had ever been, as if they were trying to commit it’s every detail to memory; it was with a violent shudder hat Bilbo understood that that was exactly what he was trying to do. Thorin didn’t believe he’d see him again.</p>\n<p>He felt a shiver across his shoulders, as if the ghost of Thorin’s fingertips, from that last night in Laketown, were still tracing across his throat. He had thought often of Thorin’s hands on his neck, for both good and for bad, but now that he was sat here with him the resentment seemed to ebb away.</p>\n<p>“I don’t want to.”</p>\n<p>Thorin’s voice sounded little like his normal tone, stripped of its dignity and strength. He stared up at Bilbo, desperation clinging to the curve of his mouth, and Bilbo felt his heart break a little.</p>\n<p>He raised a hand from where both still lay, wrapped around Thorin’s, and stroked the dark hair, laced with silver, back from his forehead. The movement pulled at the gash on his own ribcage, still untreated, making him wince, but it was worth it to see the slight smile that it brought to Thorin’s face.</p>\n<p>“Everything will still be here when you wake.”</p>\n<p>Thorin nodded, slowly, and swallowed.</p>\n<p>Bilbo continued to stroke his hair, his touch gentle.</p>\n<p>“Can I get you anything? Water? More furs?”</p>\n<p>There was a slight snuffling noise from the other side of the tent, and one of its other occupants made a low, keening noise, like a child trying to escape a bad dream. Bilbo’s eyes flickered back to Thorin’s, whose head had turned, staring as best he could at his nephews from his prone position.</p>\n<p>There was such love, and such grief in his eyes, that when he turned back to Bilbo, his voice pleading, Bilbo thought he might cry.</p>\n<p>“Perhaps… perhaps you might sing.”</p>\n<p>He looked down at Thorin, and the confusion must have been evident on his face, for Thorin looked a little uncomfortable, his eyes staring up at the canvas roof above them.</p>\n<p>“My sister used to sing, Master Baggins. Bilbo.”</p>\n<p>The hesitation over his name made him smile a little, bitterly, and he nodded his response. There were many songs he could have sung, but for the first time in years he longed for the soft sibilance of his own tongue, words sung by his parents in good times. They were not supposed to be shared with outsiders, he knew, but even though he still wasn’t entirely sure if he had forgiven Thorin, his heart still ached for him, and that was enough.</p>\n<p>He sang of green hills, and gentle rainfall, and spring flowers, loud enough so his Company outside could hear him as well, until Fili and Kili had stopped stirring and Thorin’s eyes had closed, his breath evening out.</p>\n<p>Bilbo brought Thorin’s hand up, and pressed a kiss to his palm, before resting it over his chest and leaving.</p>\n<p>He slumped to the cold earth with his friends, nodding his thanks as Bofur passed him a blanket. Dwalin shuffled closer to him, ruffling his hair, and Dori moved to be a warm presence at his side. The Company slowly shifted around him, though the Hobbit did not notice; they moved into place, surrounding him, like the planets surrounding their sun.</p>\n<p>“It was a beautiful song, lad.”</p>\n<p>He cast a wan smile up at Balin.</p>\n<p>“It was one my mother sang to me, when I couldn’t sleep.”</p>\n<p>Dwalin cleared his throat.</p>\n<p>“More I listen to your tongue, the more it doesn’t sound like elvish.”</p>\n<p>Bilbo nodded. From anyone else that might have been a lacklustre response, but he could see the pain in Dwalin’s eyes, and he understood the compliment.</p>\n<p>Bombur shuffled away at one point and returned with a pot that he hung over the fire, and made them food. Bilbo didn’t taste a mouthful of it, just kept his eye on the sky and tried to ignore the bustle of medics going in and out of the tent.</p>\n<p>He slumped against the bench at his back, ignoring the cold that was seeping into him from the ground he was sat on, and let his head rest after a while against Dwalin’s knee, which stilled in its frustrated shaking and rested for him. After a while Bofur leant over and balanced his hat- a little grimy and worn now, but surprisingly soft- on top of Bilbo’s own filthy curls.  </p>\n<p>The Hobbit watched the sun set in the west, over the distant haze of forest and mountain, and felt the easterly wind blow against his face until sleep finally took him.</p>\n<p> </p>\n<p>--</p>\n<p> </p>\n<p>“Bilbo!”</p>\n<p>He started awake, unsure for a moment of where he was. It had been several days since he had seen Thorin after the battle, and since then the medics had allowed no one in, their only words of assurance being that the King and his heirs still lived. Despite this, or perhaps because of it, the Company had kept a solid vigil around the opening of the tent, only leaving when it was necessary to collect rations or to consult with Dain on the plans for Erebor, though most of them were not needed for either.</p>\n<p>He had had little sleep since then, dozing off for odd hours at a time here and there, and it had been several days since he had been anything close to what he could describe as warm. Despite this, he felt no motivation to move, even though Dain had set up a tent for the honoured members of the Company close by.</p>\n<p>He wasn’t the only one. He was pretty sure none of the Company had chosen to sleep in it until the all-clear had come the day before about Fili and Kili: though none of them had been allowed to see them, they had been assured that the nephews of the King were awake, and would live. Of the King there had been no word, other than that he lived still.</p>\n<p>He struggled up from the cocoon of blankets he had fallen asleep in, blinking blearily.</p>\n<p>“Dwalin?”</p>\n<p>The dwarf grinned down at him, grabbing him under the arms and hoisting him to his feet. Bilbo would have protested at the treatment, but Dwalin replied before he could.</p>\n<p>“He’s awake!”</p>\n<p>The members of the Company were all grinning, exhausted but exhilarated, and Oin nodded towards the tent.</p>\n<p>Bilbo started towards it, pausing when no one else made a move. He looked around them all curiously.</p>\n<p>“Aren’t you-”</p>\n<p>Balin shook his head.</p>\n<p>“We’ll be in soon, lad.”</p>\n<p>He would have pressed him, curious, but his need to see Thorin and his nephews alive and well came first, and he almost stumbled through the tent flap in his urgency. His eyes were drawn first to the pushed together bunks in front of him, and his shoulders sagged in relief. Fili lay propped up against the pillows, pale but awake, grinning at him despite the swathe of bandages around his torso and the gauze that covered one cheek. Kili was asleep, bundled around his brother, his face resting against Fili’s chest. The sight was adorable, and much less painful than the last time he had looked upon them.</p>\n<p>“Bilbo, how are you?”</p>\n<p>“Better,” he replied honestly, “To see you both looking so well.”</p>\n<p>One of the medics, piling used bandages up in a bowl, snorted.</p>\n<p>“It was touch and go, for a while. They won’t be leaving their beds for a while yet if Master Oin has anything to say about it.”</p>\n<p>Fili rolled his eyes at Bilbo as she left, leaving the tent empty but for the three occupants and their hobbit. He threw his head back in an exaggerated yawn.</p>\n<p>“I think I am going to try and get some more sleep. You’ll come back later, and talk?”</p>\n<p>Bilbo nodded.</p>\n<p>“Of course. I don’t want to tire you.”</p>\n<p>Fili smiled, and despite his pallor, there was still the trace of his usual twinkle about his eyes.</p>\n<p>“And perhaps sing for us again?”</p>\n<p>He flushed. “I had not realised you were awake.”</p>\n<p>Fili shook his head, still grinning. “Drifting in and out. It was… soothing.”</p>\n<p>From across the tent, someone cleared their throat, and Fili’s grin grew even wider as Bilbo turned.</p>\n<p>“Well, goodnight, Bilbo.”</p>\n<p>Thorin and Bilbo stared at each other from across the tent, once more at an impasse: it was startlingly similar to the last conversation they had had, recalled Bilbo with a wry smile, and so he decided once more to respond in a similar vein. With an audible exhale he threw himself down on the stool by the King’s beside once more.</p>\n<p>He smiled at him, and it was a fond look despite himself.</p>\n<p>“I told you everything would still be here when you woke.”</p>\n<p>Bilbo felt an embarrassed heat across the back of his neck as Thorin’s gaze seemed to trace across his face, taking in the shadows under his eyes and the wan colour of his cheeks.</p>\n<p>Thorin shook his head slowly.</p>\n<p>“It wasn’t.”</p>\n<p>His voice was hoarse, but then, he had not had a chance to use it much in the past few days. Bilbo raised an eyebrow, unsure of what Thorin meant, and the Dwarf looked down at his hands, clenching and unclenching thoughtlessly in the heavy furs that still covered him.</p>\n<p>“You weren’t here.”</p>\n<p>Bilbo’s mouth opened, but no words came out; Thorin stared down at the furs on his bed furiously, as if the words had come unbidden and without permission from him.</p>\n<p>“I… I was right outside. The healers wouldn’t let me in.”</p>\n<p>Thorin looked up at him, something sparking in his eyes.</p>\n<p>“You would have come in?”</p>\n<p>And what was left between them, now the journey was over and Erebor retaken? There was space enough for anger and resentment, but in that moment, Bilbo wanted only honesty.</p>\n<p>“If they had let me,” he replied, “I would not have left your side.”</p>\n<p>He smiled, and for the first time in days felt as if he truly meant it.</p>\n<p>The medic returned then, his burden of used bandages replaced with fresh ones and a jug of warm water, and they sat in silence as each of the nearly stitched wounds that covered Thorin’s body was uncovered, cleaned, inspected and re-wrapped, a lengthy and methodical process. The sight of them filled Bilbo with a growing sense of fear and wonder; but half of these, and he would have been dead. He was unsure if it was Dwarven resilience or Thorin’s own brand of stubbornness that had kept him alive, but he rather suspected that it was a combination of both.</p>\n<p>Once the medic had left again the silence felt a little awkward, and it was Thorin who eventually broke it, glancing across at Bilbo as if he feared the other might leave.</p>\n<p>“Would you have ever left the Shire, had we not come along?”</p>\n<p>Bilbo thought about it for a long while, before shaking his head. His hand found Thorin’s once more without him quite meaning for it to, but he was loathe to let go.</p>\n<p>“It was the only place I had ever known; I believe I would have remained there for the rest of my days without a push out the door.” He paused, for a heartbeat. “I’m glad I did leave, though.”</p>\n<p>Thorin’s thumb was stroking across his palm now, the light scrape of his skin sending the hairs on Bilbo’s nape on end.</p>\n<p>“Will you…” he cleared his throat, and looked away. “Will you return there?”</p>\n<p>Bilbo cocked his head to one side, eyes following the line from Thorin’s furrowed brow to mouth, turned downwards.</p>\n<p>“Perhaps, one day, to collect some things. But certainly not soon.”</p>\n<p>Hope, Bilbo decided. That emotion flickering in the depths of Thorin’s eyes; he finally had a name for it. It was hope.</p>\n<p>“No?”</p>\n<p>Bilbo reached out, and tucked a strand of hair behind Thorin’s ear.</p>\n<p>“Well, apparently my home was always going to lie to the east. Perhaps I might see if I can make it here, now that I’ve come all this way.”</p>\n<p>Thorin’s smile, in return, was <em>blinding. </em></p>\n<p> </p>\n<p>--</p>\n<p> </p>\n<p>It had not always been easy; in fact, for the most part, it had been hard.</p>\n<p>But that, Bilbo Baggins reflected as he watched the sun set over the far and distant shade of mountains to the west, was part of the journey. No true adventure ever came without a little hardship along the way, but the bustle of the rebuilding of Erebor, the laughter of those finally able to come home again, the sight of Thorin enthroned where he had always belonged… these were the things that had made every step of this adventure worthwhile.</p>\n<p>“Just those?” Thorin replied, as Bilbo informed him of this, and the hobbit smiled.</p>\n<p>“Perhaps not just those,” he admitted.</p>\n<p>Thorin’s gaze was warm, and Bilbo half-turned to him. Large hands settled around his face with an unfathomable gentleness, as if still unsure if he would break; the cool press of Thorin’s rings against his cheeks a familiar feeling as he tilted his chin upwards.</p>\n<p>“And what else, Master Hobbit, made leaving your life so worthwhile?”</p>\n<p>Thorin’s voice was pitched low,</p>\n<p>Bilbo frowned at him, teasingly.</p>\n<p>“It is hard to remember,” he said, feigning ignorance, “When people insist on calling me such ridiculous titles, rather than my name.”</p>\n<p>Thorin’s voice was rich and warm, and Bilbo’s frown soon melted off his face at the sight of it.</p>\n<p>The dwarf leaned closer to him, his voice but a whisper on the private terrace, and murmured the soft syllables of his inner-name into his ear; once, twice, and then a third time, delighting in the sound and the deep flush it always brought to Bilbo’s throat.</p>\n<p>“I never should have taught you that,” Bilbo muttered, “You use my name entirely to your advantage.”</p>\n<p>Thorin deigned not to answer, and kissed him instead.</p>\n<p>It was an entirely welcome distraction.</p>\n<p>They remained that way for quite some time as the sun slowly set, their bodies pressed close together and the evening slowly chilling around them. When Thorin eventually pulled back it was with a regretful look, though he paused as he drew away to nuzzle his nose against the soft braids that Bilbo wore.</p>\n<p>“You still haven’t told me,” he said, his voice almost a caress against Bilbo’s hair, “What makes it worthwhile?”</p>\n<p>Bilbo, a little flustered, pressed just a little closer to Thorin’s chest.</p>\n<p>“Family,” he replied, and hid his smile against the warm fur of Thorin’s coat. “And perhaps you.”</p>\n<p>He could feel Thorin’s laugh through his body, and he smiled in turn at the sound and feel of it.</p>\n<p>“Only perhaps? Then I am not trying hard enough.”</p>\n<p>Bilbo rather thought he’d earned another kiss for that, and so was quick to deliver, pressing their bodies flush together in the failing light, Thorin’s arms wrapped around him now; before too long the breeze, which was shifting distinctly to <em>cool </em>now, pressed for an early retreat.</p>\n<p>“Come inside,” Thorin urged. “The fires will be lit.”</p>\n<p>Bilbo nodded, and began to follow him through the doors that would lead to the King’s Chamber – and not just the King’s, he thought, but his as well. Before he quite went inside, though, he turned back to the sun once more, almost gone behind the distant mountains, and smiled into the breeze. It had come from the far west, he thought, that wind; over the rolling pastures of the green Shire and to the great reclaimed kingdom of Erebor, dancing ever eastward on its journey.</p>\n<p>Just like him, he thought.</p>\n<p>“Bilbo? Are you coming?”</p>\n<p>They were right, he thought absently, when they had said he would never find his place in the Shire. He turned his back to the lands that stretched out the west, and followed his King back to their rooms.</p>\n<p>The east wind had called him home.</p>\n<p> </p>"
}