{
  "id": "1783486",
  "url": "https://archiveofourown.org/works/1783486?view_full_work=true",
  "author": [
    "Prairie_Grass"
  ],
  "title": "Lap Magnet",
  "rating": "Explicit",
  "archive_warnings": [
    "Underage"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Teen Wolf (TV)"
  ],
  "relationships": [
    "Derek Hale/Stiles Stilinski"
  ],
  "characters": [
    "Derek Hale",
    "Stiles Stilinski",
    "Sheriff Stilinski",
    "Scott McCall",
    "Isaac Lahey",
    "Erica Reyes",
    "Jackson Whittemore",
    "Allison Argent",
    "Peter Hale"
  ],
  "additional_tags": [
    "Dubious Consent",
    "Mating Bond",
    "Somnophilia",
    "Knotting",
    "Loss of Virginity",
    "characters who are unaware of their actions",
    "five times fic",
    "Sort Of",
    "Post Season 2",
    "ish",
    "Minor Isaac Lahey/Scott McCall",
    "the sheriff is a canny dude",
    "and trolling everyone",
    "BAMF Stiles",
    "Accidental Bonding",
    "Self-Lubrication",
    "(but no mpreg)"
  ],
  "language": "English",
  "series": "",
  "published": "2014-06-14",
  "completed": null,
  "words": "30,765",
  "chapters": "1/1",
  "comments": "594",
  "kudos": "25,512",
  "bookmarks": "7,876",
  "hits": "570,248",
  "summary": "<p>Wherein an ill-advised floral arrangement leads to a whole new definition of obliviousness, accidental mate-bonds, and far more sex and tropes than one fic really needs.</p>\n<p>or </p>\n<p>Five times Derek and Stiles didn’t notice how close they were (literally) and then a whole bunch of times when they did...</p>",
  "notes": "<p>So… someone somewhere jokingly asked for a fic where Stiles is magnetised to Derek’s lap.</p>\n<p>I thought, HA, FUNNY PROMPT, I can write a little joke fic about that. (LITTLE. LITTLE WAS THE WORD I WAS GOING FOR.)</p>\n<p>Anyway, this is a giant tropey soup. Also set in that magical post Season 2-ish Canon-What-Canon land where everyone was still alive and nothing was wrong with the world, my plant-knowledge is totally invented, and there’s a hint of bad-friend Scott - which is not a reflection of my feelings towards Scott, but of where I feel Stiles was at at that point in the show. </p>\n<p>This fic owes a great deal to astolat’s fic <a href=\"https://archiveofourown.org/works/164460\" rel=\"nofollow\">Kings Queens and Jokers, Too</a></p>\n<p>Beta'd by the magical grimdarkfandango! Thanks for wading through this, presh!</p>\n<p>Additional warnings explanations: While in a general sense the sex in this is consensual (if you don’t mind the whole mate bond stuff), the language of the first sex scene is at times fairly coercive <strong>[Edit to add:</strong> and Derek pushes past several 'no' signals from Stiles before he gets to 'yes' signals. As such, while Stiles' reluctance is more due to magical shenanigans rather than no-to-sex, the scene can read as verging on the rape/non-consent side of things], so please feel free to avoid the fic or the scene if it’ll be a problem. There is also some pretty dubious somnophilia (consent wise) which then becomes consented sex. Finally, the underage element of this fic is discussed quite openly and there are a few instances where it’s fetishised slightly. If you’d like further explanation of any of the warnings feel free to message me. :)</p>\n<p>Edit edit: If you want to translate this fic, you are welcome to so long as you post the translated version to the Archive and nowhere else, and give me full credit and a link so I can share it! Thanks!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>",
  "text": "<p align=\"center\"> </p>\n<p>The first time it happened, they didn't even notice.</p>\n<p>Stiles had gone over to Derek's place to give him a loft-warming gift – definitely not to scope the place out to confirm if Derek had finally started living like a person instead of some kind of troglodyte<a name=\"_GoBack\" rel=\"nofollow\" id=\"_GoBack\"></a> – he even had a gift and a card that said <em>'Congratulations on having furniture!'</em> Unfortunately, looking at the massive hole in one wall, and seeing the part of town the loft was in, Stiles suspected that there wasn't anyone Derek was paying rent to, so he was still failing on the 'squatting' part of being a functioning member of society, but Derek's bed had<em> throw pillows</em> – so he was definitely moving up in the world.</p>\n<p>He'd found Derek with an opened Wifi router box, technology strewn around him and a completely lost expression.</p>\n<p>Stiles had laughed for several, perfect minutes before he offered to help.</p>\n<p>“Peter and Isaac said we had to get internet,” Derek said defensively. “I've never needed it.” He handed the instruction manual over as if it were soaked in wolfsbane.</p>\n<p>Stiles rolled his eyes and tossed the manual to one side. “Yes you have, you just let yourself in through my bedroom window and glare at me until I do it for you. That's not the same thing as 'not needing' the internet. Besides, for all your attempts to be a yeti, you're at least half-human, and no one should have to live without the internet; the mere concept hurts my soul.”</p>\n<p>Derek moved around the place restlessly while Stiles hooked everything up, peeking over Stiles' shoulder more than once, but seemingly managing to hold himself back from asking 'are we there yet?' Which Stiles appreciated, even if he would have understood the comedic value.</p>\n<p>It was kind of weird. Stiles hadn't actually had that many chances to hang out with Derek that didn't involve life-threatening experiences, or Scott yelling. Or both.</p>\n<p>Derek made a strange noise behind him, and Stiles turned.</p>\n<p>“What is this?”</p>\n<p>“It's a vase,” Stiles said around the network-cable held between his teeth.</p>\n<p>“I can see that. Why is it in my house?”</p>\n<p>Stiles spat out the cable. “My Mom always said a house wasn't a home without flowers, so I figured it would make a good house-warming gift.”</p>\n<p>Derek gave Stiles a flat look. “I'm a werewolf, Stiles,” he said, as if that meant anything at all, and precluded him from things like joy or happiness.</p>\n<p>Stiles nodded and plugged the cord in, sitting back in satisfaction as the appropriate lights twinkled at him. He got up and went over to where Derek was staring at the offending vase. He picked it up and went through to the kitchen, sitting it in the middle of the counter.</p>\n<p>“I know. And I also know you wouldn't be able to handle the smell of normal cut flowers, which is why I went up to the Preserve and picked some grasses and ferns, and some non-stinky flowers. This one here Deaton said promotes calmness, and when combined with the birch bark here, it encourages peace and safety.” He jiggled the plants so they'd look less like a bunch of random plants shoved into a Pottery-Barn vase he'd got for ten bucks.</p>\n<p>(Okay so, there wasn't anything he could do about them looking like that, but he hoped his Mom might appreciate that he'd at least tried to cut the lengths into a vaguely attractive shape.)</p>\n<p>“You picked plants for me from the Preserve.” Derek's voice broke Stiles out of his thoughts.</p>\n<p>“Hmm? Oh, yeah, from up around your old house and stuff. I thought it might appeal your inner forest-creature or whatever.” He shrugged.</p>\n<p>Derek came through to stand next to Stiles, the heat of his body warming Stiles’ skin. He stared at the plants for a long moment until Stiles started to wonder if the guy was thinking about setting them on fire, then he winced at his own thoughts. Suddenly Derek bent over, his face close to the plants, and breathed in long and deep. His eyes fluttered closed.</p>\n<p>Stiles felt kind of strange all over.</p>\n<p>When Derek straightened he had a slightly glazed look in his eyes, he swayed, and Stiles shot a hand out to steady him.</p>\n<p>“Whoa there, Derek. I did not know that forest plants were like weed to an Alpha. If I had, I would have just got you a tea-cosy.”</p>\n<p>Derek blinked and shook his head, his eyes clearing. “No, it's fine, there's just a lot of scents you don't get in the city.” He looked at Stiles, his expression back to its usual glower. “Thank you,” he said.</p>\n<p>Stiles' eyebrows shot up. “Wow dude, I don't know whether to be impressed I even got a thanks, or worried if that's the tone you always use for being nice to people. No wonder everyone's always trying to kill you.”</p>\n<p>Derek scowled.</p>\n<p>Stiles rubbed his thumb absently where it was resting against the warm skin of Derek's arm. “So anyway, your internet should be working now, so you can watch porn, or Homeward Bound or whatever good little werewolves do to fill their time these days.”</p>\n<p>Derek huffed out a sigh, the warm air passing over the skin of Stiles' throat. “Why would I need the internet for that anyway? The video store is only three blocks away.”</p>\n<p>Stiles gaped at him. “I'm sorry, what? You still go to the<em> video store</em>?”</p>\n<p>Derek shrugged. “What else would I do?”</p>\n<p>Stiles would have headdesked, but his closest option would have been Derek's shoulder, so he just groaned and went to get Derek's laptop. “Okay, you – order me some damn pizza and then sit yourself down, I am going to introduce you to things called 'torrents' and show you how not to get porn-induced viruses because I have a bad feeling that this could all go south if I let you navigate the world wide web without some basic training.” On the way he noticed the coating of bark and moss on his hands, and he absently wiped them off on the ass of his pants as he went.</p>\n<p>So then, naturally, they had to start watching the entire Marvel reboot. And if they ended up sitting close on the couch, there wasn't really anything strange about that. And if maybe by the end of The Incredible Hulk Derek's arm had snuck around Stiles' waist, well, Stiles had been hogging the popcorn and it was the only way he could get to the bowl – so that was understandable. And if by the start of Thor Stiles had one thigh thrown over Derek's legs, well, Stiles moved around a lot sometimes and it was more comfortable there. And if half-way through Captain America Derek had wanted to stretch his legs out, and Stiles was too settled with his head on Derek's shoulder to move to the other end of the couch, so they ended up stretched out along the couch with Stiles resting between Derek's legs, his face on Derek's chest well... it was late, they were practically drunk with super-villains and tiredness, so they couldn't be blamed for not noticing.</p>\n<p>And if Stiles had fallen asleep during The Avengers, it was only because he'd already seen it 13 times, and not because of how warm and safe he felt, breathing in the smell of Derek's skin and feeling his arm cinched firmly around Stiles' body.</p>\n<p>He certainly couldn't have been blamed for not noticing.</p>\n<p>And it definitely wasn't his fault.</p>\n<p><br>\n</p>\n<p>~--~</p>\n<p><br>\n</p>\n<p>(It totally was his fault.)</p>\n<p><br>\n</p>\n<p>~--~</p>\n<p><br>\n</p>\n<p>The second time should have been blindingly obvious simply because it was so drastically out of character.</p>\n<p>Derek had just dropped Isaac off at the vet clinic where he was still insisting on helping out despite not getting paid in anything but cryptic sayings from a vet-come-occasional-magic-user. Derek was still trying to figure out if he was doing it for a) kittens, b) trying to get into Scott’s good books, or c) trying to get into Scott’s pants. He suspected it might be a combination of all three.</p>\n<p>It was late afternoon and the skies had well and truly opened, pouring down in sheets of heavy rain. It was only chance that he saw a familiar, if bedraggled, set of shoulders out amongst it. He pulled up beside the figure and put down his window.</p>\n<p>“You’re bringing in a whole new definition of pathetic right now, Stiles.”</p>\n<p>Stiles bent down, blinking raindrops off his eyelashes. “I really appreciate that you stopped just to tell me that, asshole.”</p>\n<p>Derek grinned. “Just performing a civil service.”</p>\n<p>“I’m glad that you’ve become so community minded.”</p>\n<p>Derek was tempted to drive off, if simply for the entertainment of seeing the outrage on Stiles’ face, but he leant over and popped the door open instead. “Come on, get in.”</p>\n<p>Stiles’ jaw dropped. “Are you serious? I’m soaked. I have literally seen you make Jackson ride in the trunk, and he was bleeding to death.”</p>\n<p>Derek shrugged, he was feeling surprisingly chilled out today. He had all week in fact, and Stiles’ drenched little face was making him sad. “It was only a flesh wound, and water comes out easier than blood.” Stiles kept gaping at him and he rolled his eyes. “Are you going to take up the offer or are you enjoying the melodrama of being soaked to the bone? Because I can go.”</p>\n<p>Stiles quickly scrabbled at the door and then threw his body into the passenger seat. “No no! I’m good, no melodrama required here. Warmth and dryness are both great concepts in my book.”</p>\n<p>Derek frowned at where the water from Stiles’ clothes was pouring in little rivulets into the footwell, before his attention was captured away by Stiles’ shaking.</p>\n<p>“Stiles! You’re freezing, how long were you out there for?”</p>\n<p>Stiles shrugged, his teeth chattering as he tried to warm his hands on the air conditioning. “My car’s in the shop and Scott was supposed to give me a ride home, but I guess he forgot and left without me? I could have called my Dad but I didn’t really want to bother him after…” he made a vaguely magic/werewolf/teen-angst encompassing gesture, “...everything lately. So I figured I would walk home. That was about an hour ago? I guess?” He paused. “It wasn’t raining then.”</p>\n<p>Derek snorted. “Clearly.” With a sigh, he pulled his jacket off and offered it to Stiles. “Here.”</p>\n<p>Stiles stared down at the jacket, accepting it gingerly. “Are you kidding me? I thought this thing was like, mystically attached or something. Like a selkie skin.”</p>\n<p>Derek rolled his eyes and started the car. “I’m not going to be trapped in human form forever if you take my jacket, Stiles. And even if I was it would probably be worth it to not have to deal with the snotty, ceaselessly complaining ball of annoyance that is you with a cold.”</p>\n<p>Stiles beamed overly-brightly at him. “You’re such a nice guy, Derek.”</p>\n<p>Derek couldn’t help but laugh, he reached over and smushed Stiles’ wet hair down into his eyes. Stiles made a squawking noise, but Derek ignored him, letting his hand slip around the back of Stiles’ neck and rest there, heating Stiles’ blood up simply with his presence.</p>\n<p>It was only after he was accepting his damp jacket back from Stiles that he let himself think about the tarp and spare blanket he’d started stashing in his trunk for exactly situations such as those (although he’d been planning more for blood or magical substances at the time than rain water). But it really wouldn’t be hard to dry out the seats, and he kind of owed Stiles at least a jacket loan for setting up his internet, right?</p>\n<p>And putting the jacket to his face and dragging in the smell of it, well that was just a normal werewolfy thing to do. Nothing weird to notice at all.</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>(Let’s be real, the Camaro was sacred. Everyone in the Pack knew that. Rain, blood or near-death-experience inclusive.)</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>The third time they didn't notice was in the context of life-and-death adrenaline, so it was completely understandable. (Never mind that the majority of their interactions were during life-and-death situations, that was not the point.)</p>\n<p>The point was, Stiles had been attacked by a Velociraptor.</p>\n<p>“It wasn't a Velociraptor, Stiles.”</p>\n<p>“Say that to the guy who wasn't running away from them for over two hours in the woods. I've seen Jurassic Park like twenty times, dude, I know Velociraptor hunting packs when I see one.”</p>\n<p>Derek awkwardly managed to unlock his front door from where his hand was caught below Stiles' knees. (Yes, Derek was holding him in a bridal carry, but Stiles had been running from Velociraptor hunting packs for two hours, okay? His legs were done.)</p>\n<p>“They were harpies. Deaton said so himself.” Derek set Stiles down on the couch while he went for the first aid kit. Stiles wasn't sure whether to be glad the guy had one, or bummed out that the humans in the pack – himself most definitely included – got hurt enough that Mr Perfect Healing Abs had started to stock one.</p>\n<p>“Look, all I'm saying is – what came first, the ancient Greeks or dinosaurs? Maybe there were still some raptors still hanging around?”</p>\n<p>Derek emerged from the bathroom – halfway through an eye-roll. “The harpies had wings. With feathers.”</p>\n<p>“Are you seriously that far behind on the dinosaurs-with-feathers theory!?” Stiles started to throw his arms up in frustration, but the 'got cut-up by Velociraptors/harpies' part made itself known again and he paled and dropped his head forward against the couch-back to breathe a little.</p>\n<p>Derek was beside him instantly, and he placed a warm hand on the back of Stiles' neck. “Come on, let me get your shirt off. You fell enough times that that cut will be full of dirt.”</p>\n<p>Stiles groaned but let Derek pull him gently away from the back of the couch, and didn't resist when Derek snipped his t-shirt away then sat down and manhandled Stiles into his lap, facing Derek, so he could get at the slice running across his chest and up over his left shoulder.</p>\n<p>Stiles tried to keep still while Derek carefully bathed the wound with antiseptic and carefully pulled out pieces of dirt and leaves, but it was hard, he was still swinging between adrenaline and crashing, and the tweaking jabs of pain as Derek worked weren't making it any easier.</p>\n<p>“Besides,” Stiles rambled, mostly to distract himself, “harpies are supposed to attack unfaithful men, aren't they? I haven't unfaithfulled anyone! I am Fred the Faithful! I'm so faithful they should name a town after me! Faithtown of Stilesonia!”</p>\n<p>Adrenaline was not very good for his brain-chemistry, alright?</p>\n<p>“...Or at least that's what they<em> would</em> do, if I was<em> even in a relationship at all</em>, which I'm not!”</p>\n<p>Derek gave him a strange look. “Well, obviously you are, or they wouldn't have come after you like that.”</p>\n<p>Stiles rested his hand against Derek's shoulder to give himself better balance and glared back. “Um, I think I would know if I was in a relationship,<em> Derek</em>. It's not my fault that witch's magic necklace was clearly wrong.”</p>\n<p>Both of Derek's eyebrows shot up. “And which witch was that, exactly?”</p>\n<p>Derek's face was moving towards furious too quickly for Stiles to risk sniggering at Derek's words. “Um, the one I met at the bookstore...?” Stiles winced.</p>\n<p>“And what<em> exactly</em> did you and this witch do, Stiles?” Derek growled.</p>\n<p>“We just talked! That's it!”</p>\n<p>Derek looked about as convinced as a Scott did the day Stiles’ tried to feed him Brussels sprouts. (He’d cooked them in butter and everything! They were delicious, okay?)</p>\n<p>“Look, I met her in the rare books section, it was pretty obvious that she was a witch, but she seemed nice, man, what was I supposed to do – ask her if she occasionally summoned ancient creatures to wreak violent vengeance?”</p>\n<p>“Maybe that would have been better than whatever you<em> clearly</em> did to piss her off? Or better yet, you could have just<em> not</em> talked to someone who even you knew had mystical powers?”</p>\n<p>“How many times do I have to repeat that I didn't<em> do anything</em>?”</p>\n<p>Derek broke eye contact and started threading a needle with more grouch than Stiles would have thought was possible.</p>\n<p>\n<em>Derek's super-powers include fast-healing, super-strength and imbuing ordinary tasks with man-pain or rage.</em>\n</p>\n<p>Stiles' breath started to come faster as Derek tied off the thread.<em> Rage buttering toast. Man-pain going to the post-office. Grumpy making the bed.</em></p>\n<p>Derek's hand gently gripped Stiles' cheek and tipped his face up to meet his eyes. “You're going to be fine, Stiles.”</p>\n<p>“Shouldn't we get Melissa to do this part?”</p>\n<p>“It's only a few stitches, most of the wound will heal by itself. I know how to do this.”</p>\n<p>Derek's fingers smoothed along Stiles' cheekbone, and Stiles closed his eyes and let his breath out in a sigh.</p>\n<p>“So you must have done something for the witch to target you. I mean, I understand as well as anyone that most people want murder you after knowing you for more than five minutes, but harpies are fairly specific,” Derek said, pressing the needle to Stiles' skin.</p>\n<p>Stiles knew that Derek was just trying to distract him, and he appreciated a good sassing, so he kept talking, refraining from pointing out to the werewolf that when humans get stitches, they usually have this thing called anesthetic... If he pointed that out then Derek would probably go get Melissa after all, and for some reason now Stiles couldn't quite bear the idea of getting up.</p>\n<p>“Like I said. We just talked. She seemed nice and we had a lot of similar books we were looking for, and I thought maybe we could do some sort of trade on what we each had at home, so we went for a coffee...”</p>\n<p>Derek snorted.</p>\n<p>“What?” Stiles looked down at Derek's bent head.</p>\n<p>“No, keep going,” Derek replied.</p>\n<p>Stiles glared at the top of his head for a few more seconds for good measure, then went back to his story.</p>\n<p>“Anyway... we talked for a bit, and we got on really well—”</p>\n<p>“Was she pretty?” Derek interrupted.</p>\n<p>Stiles glanced down, startled. “Yeah, I mean, I usually go for red-heads, but she was rocking the exotic, smoky, dark-haired look.”</p>\n<p>Derek pulled the thread sharply and Stiles couldn't help but let out a yelp. Derek looked instantly contrite. “Sorry,” he said, and eased the thread.</p>\n<p>“Well that was pretty much the gist of it,” Stiles carried on. “Then I had to go, she asked if we could catch up again, and I said sure.”</p>\n<p>Derek let out a small growl, but Stiles kept going, determined to finish the story.</p>\n<p>“And then the weird bit was she was all, 'Are you with someone else right now?' and I said 'No' and then her necklace turned red and she looked really angry and stormed off and it totally wasn't my fault! I didn't even do anything!”</p>\n<p>Derek tied off the last stitch and cut the thread and put the needle to one side. He moved his hands to rest firmly on Stiles' ass.</p>\n<p>“Well are you?” he asked, gently kneading the flesh beneath his hands.</p>\n<p>Stiles sighed, grateful for the massage outside of the pain-zone that was his upper body.</p>\n<p>“Am I what?”</p>\n<p>“With someone?”</p>\n<p>“No!” He shifted further back into those warm hands. “Don't you think the pack would be the first to know if someone got all up on this?”</p>\n<p>Derek's mouth tweaked into half a smile, which Stiles always counted as a ten-points victory.</p>\n<p>“Alright, I believe you,” Derek said. “There really must have been something wrong with her necklace.” He twisted Stiles around in his lap and leant over to grab his laptop off the table. “Now, find the rest of my pack for me.”</p>\n<p>So Stiles spent the next few hours checking up on the safety of the rest of the pack via the facebook group they'd created (after the last cellphone-destroying incident), with Derek reading over his shoulder, adding occasional sass and rubbing comforting hands up and down Stiles' back while he waited for the Tylenol to kick in.</p>\n<p>And okay sure maybe, that time, they really should have noticed something was up. But Derek's hands were warm, and Stiles was tired, adrenaline finally spent and pain digging into his thoughts, so why would he move?</p>\n<p>So it was totally the fault of the pain and the adrenaline.</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>(Pain, adrenaline and ass-massage. Yeah, right.)</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>The fourth time was barely a time at all, save for it was a stupid-hot day, and Derek was driving past the park when he saw Stiles contemplating an popsicle stand. Popsicles suddenly seemed like an inspired choice, so he pulled over and wandered in the teenager’s direction.</p>\n<p>Stiles raised his hand in a half-wave. “Hey! It's daylight and you're outside! And you're sans leather jacket!”</p>\n<p>“It's hot.” Derek glowered at him. “And I had to return a library book.”</p>\n<p>“You have a library membership?!”</p>\n<p>It was slightly concerning how startled Stiles was by that. “Yes Stiles, it's this place where you go to borrow books without buying them. They're made of paper. You might not know what that is, but they'll probably cover it in history class some time.”</p>\n<p>“Oh my god Derek, please, not only are you secretly a massive dork, you're also pretending you're a thousand years old, I can't handle this much exposure to the person behind the eyebrows.”</p>\n<p>“Since when am I a dork for using the library?” Derek said, affronted.</p>\n<p>Stiles shook his head. “No, no, don't even try, the mystery is gone. Without any shadows to hide in – he's just a man.”</p>\n<p>Derek gave Stiles a narrow look. He never knew if the things Stiles said made sense to other more... socialized people, or if Stiles was just walking to the beat of his own drum. “I've seen you plenty of times during the day.”</p>\n<p>Stiles sighed forlornly, as if Derek was just being deliberately obtuse. Derek would admit secretly that there were times that he did that on purpose just to watch Stiles get riled up, but this wasn’t one of them.</p>\n<p>“You just clearly don’t understand what it means to maintain an aura of mystique. Here you are, in 90 degree heat, standing around in a t-shirt,<em> chinos</em>, and<em> flip flops</em>!”</p>\n<p>Derek looked down at himself. “Half of the people in this park are wearing the same thing as me, Stiles. <em>You’re </em>wearing the same thing as me.”</p>\n<p>“Yes but you’re <em>Derek Hale</em>. You’re the Alpha! You have a reputation to uphold!”</p>\n<p>“With who? The seething but miniscule mystical underbelly of small-town America?”</p>\n<p>Stiles gave Derek a suspicious look, like he wasn’t sure if that was a joke or not. Derek just gave him a totally blank face in response. Sometimes the amusement factor of getting under Stiles’ skin was worth the annoyance of all the… rest of him.</p>\n<p>Derek turned away to peruse the selection of popsicles. “What would you like?” he asked.</p>\n<p>Stiles was muttering something under his breath about baseball caps. Derek flicked Stiles' nose. “Hey,” he said as Stiles’ eye darted over to meet his. “What flavor do you want?”</p>\n<p>“Oh, uh, mango.”</p>\n<p>Then for some reason, Derek was buying them both popsicles, and they went for a walk in the park together (Derek was pretty sure there was a reason for it at the time). Then maybe they hung out in a secluded area next to the duck-pond for a bit. And maybe Derek gathered Stiles up to lean against the barrier with Derek behind him, arms bracketing Stiles’ body even though it was far too hot for physical contact. And maybe Derek's popsicle dripped on the back of Stiles' neck and instead of just wiping it off Derek leant down and licked the skin clean. And maybe Stiles just laughed instead of elbowing him or sniping at him... And then maybe Derek spent a little while just licking at the back of Stiles' neck and ears, low rumbling noises slipping out of his throat, one arm firm around Stiles' waist. And maybe Derek’s pants got a little tight, and Stiles started smelling deliciously <em>ripe </em>and he tipped his head forward and let Derek have all the access he wanted.</p>\n<p>And maybe when Derek got home later that day he should have showered the sweat and the heat of Stiles off his skin. Maybe he shouldn't have fallen onto his bed and just jacked himself lazily for ages, thinking about nothing much at all...</p>\n<p>But it was so hot, Derek barely remembers that day, so maybe none of that happened at all...</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>(It did.)</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>The fifth time was really Scott's fault.</p>\n<p>Stiles was still healing from his encounter with the Velocirharpies, and doing his best to make sure his Dad didn't a) see it, b) flip out, and/or c) assume he'd joined some sort of scarification cult. (Because there was going to be a scar, but for some reason he didn't mind too much. It didn't remind him of running scared for his life through the dark, it reminded him of red eyes and flashing teeth rescuing him, of warm kind hands and a soft gentle voice...)</p>\n<p><em>'Project: Don't let the Sheriff see serious wound'</em> had involved being kind to the cut and encouraging it to heal as fast as possible, which was pretty well against Stiles' nature, but he was hanging in there.</p>\n<p>So when Stiles got a text saying Scott had organized a 'pack night' where they all were going bowling, Stiles was pissed enough to consider texting back<em> 'I'm rage-quitting our friendship.'</em></p>\n<p>He managed not to (just), and just sent<em> 'can't'</em> and sat stewing for a while. He'd barely seen Scott this summer, between Scott working so much and his evolving relationship with the pack. Sure, Stiles was part of the pack too (or he was pretty sure he was – he didn't think Derek would let him wander into his house unannounced if he wasn't,) but there was some stuff that was automatically 'no humans allowed.' Not only that, but Scott was spending more and more time with Isaac, which at first had been under the banner of 'The guy just lost his whole family, he needs some friends,' but Stiles was starting to suspect was something more along the lines of, 'the guy has amazing lips, I think they need some friends.' Which hey, Stiles could understand appreciating that Isaac was absurdly beautiful, but Scott needed to work on balancing his friend-to-significant-other time ratio or Stiles was gonna stop putting up with it and ship out.</p>\n<p>He kicked the coffee-table. Meanwhile, his Dad was out, like he always was these days. Too many unsolved murders in Beacon Hills, and too many lies at home.</p>\n<p>\n<em>Great, it's going to be Morose!Stiles night tonight.</em>\n</p>\n<p>The doorbell broke him out of his thoughts, and he bounded to the door. Half-hoping it was Scott, come to apologize for being an unthinking dork-brain.</p>\n<p>Instead he opened the door to Derek, one hand in his back pocket, the other holding a shopping bag.</p>\n<p>“Hey... I figured you probably wouldn't be able to go bowling, and I'm no good at it so... I've never seen a werewolf film before,” he held up the bag, “and I brought snacks?”</p>\n<p>“You have no idea how much I love you right now,” Stiles said, dragging Derek in by the bag, feeling a weird frisson of joy at seeing the other man. Derek looked a mix of embarrassed and pleased at Stiles' reaction.</p>\n<p>“Is it okay to be here? We can go back to mine if your Dad—”</p>\n<p>“Nah, my Dad is out all night,” Stiles said, waving a hand dismissively. “And can you please explain to me how you have never seen a werewolf movie in your life, you<em> heathen</em>.”</p>\n<p>Derek dumped the bag on the coffee table and settled down on the couch as if it were his own. He shrugged. “We never had a TV when I was growing up. We went to the movies some of the time, like for Star Wars and stuff, but I never bothered for any of the werewolf ones. They were too stupid.”</p>\n<p>Stiles opened his mouth to reply then narrowed his eyes. “Wait, which Star Wars?”</p>\n<p>Derek rolled his eyes. “The digital re-master of the original series, dumbass. I'm not<em> ancient</em>.”</p>\n<p>Stiles sighed in relief. “Just so long as you didn't waste precious movie watching time on Episodes I-III, then we're okay.”</p>\n<p>Derek just shook his head and pointed to the computer. “Stiles, just come and do your Google-Judo and let's watch some movies.”</p>\n<p>“Google-Fu, Derek, god!”</p>\n<p>But Stiles spied the small uptick of Derek's lips, and pointed an accusing finger at him. “You did that on purpose!”</p>\n<p>Derek was openly smirking at him now, his eyes warm with laughter. It made Stiles' breath a little short. “Look Stiles, are you going to come over here and choose me a movie or am I going to have to start with Twilight?”</p>\n<p>“I'm coming! Jeez!”</p>\n<p>That night Stiles started out on the floor. A perfectly reasonable location. He needed to be able to reach the computer. If he was sitting between Derek's legs, head against his knee, one arm twisted around his leg, and one of Derek's hands in his hair... well... Derek was just helping him not fall over.</p>\n<p>Right?</p>\n<p>Later on Derek pulled him up into his lap, settling Stiles in close to his body. They'd just started Underworld and Kate Beckinsale was about to do her epic jump, so Stiles can be excused for being so transfixed he didn't notice.</p>\n<p>The scene where The Guy From Felicity first started to transform into a werewolf always kinda turned Stiles on. Seeing him lose control in the back of a squad car... knowing he was about to change from vulnerable human to vicious killer... even thinking of him weak and at the mercy of the other werewolves... he wasn't sure what it was, but between that and Derek's thumb sliding back and forward on Stiles' inseam, he was rock-hard two thirds of the way through the movie. At some point Derek took him by the hips and started pressing him back against himself, just small little twists of his hips, and it had Stiles pressing his hand hard against his own dick.</p>\n<p>Somewhere in between Selene being a babe in a catsuit (i.e. the whole movie) and her slicing Bill Nighy's face in half with an anime-style flourish (i.e. the end), Derek started to place small kisses and bites along Stiles' neck, and it was enough to have Stiles tip his head back with a groan and press his ass hard against Derek's hard length.</p>\n<p>Derek let out a growl and sunk his teeth into Stiles' neck, just short of breaking the skin, a bite for holding. Stiles went limp. He didn't know why, but all the movement impulses in his brain just shorted out. Derek let out an approving rumble, teeth still latched into Stiles' flesh, opened Stiles' pants and got his hand on his cock. Stiles whimpered, eager, but could only lie there as Derek jacked him with one hand, using the other to grind Stiles back against his own increasingly rapid thrusts.</p>\n<p>It shouldn't have been as hot as it was, and the sound of gunfire was coming from the screen, but all Stiles could think about was how much he wanted Derek's come on his skin, how he wanted Derek everywhere and inside of him, and he maybe said as much aloud because Derek made a noise halfway between a whimper and a snarl, his hand tightening on Stiles' cock, and that was enough, caught in Derek's implacable hold, Stiles' orgasm hit him like a punch. He came into Derek's hand and Derek's teeth sunk in the tiniest fraction more, a ripple of pain shooting through Stiles as Derek came too, still caught in his jeans and his cock shoved ruthlessly into the curve of Stiles' ass.</p>\n<p>It took a while for them both to come down. Not helped by Derek lifting his come-soaked hand to Stiles' mouth and making him lick it clean. That almost had them both going again, but they got distracted by the finale of the movie, and eventually Derek meandered to the bathroom to clean up while Stiles tried to pick which would be the best True Blood episodes to show him.</p>\n<p>Derek left somewhere around 3am, when they were both too spaced out to continue.</p>\n<p>Stiles trudged up the stairs and shucked off his jeans, he was kinda sticky, and so were his pants, but he couldn't quite think why.</p>\n<p>He detoured for a late night-night shower, tossing his jeans into the laundry basket on the way.</p>\n<p>In the shower he lazily palmed his cock, too tired to get off, the other hand pressing into a hot ache on the back of his neck. After he nearly fell asleep in the stall he hastily turned off the water and toweled off before falling into bed.</p>\n<p>As he slept he dreamed of a wolf, hot breath against the back of his neck, and an inexorable pressure in his ass that just goes deeper, and deeper.</p>\n<p>At that point – they really should have noticed. At that point, there was no excuse.</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>(They didn't.)</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>The conversation Stiles had with his father really should have been a dead giveaway, but in his defence, he was sleep deprived and his father was literally a professional interrogator. Plus there were waffles.</p>\n<p>No one can be blamed for anything when there are waffles.</p>\n<p>He rolled out of bed the day after his and Derek’s movie marathon some time well before midday, which he never would have done if it hadn’t been for the smells wafting up the stairs.</p>\n<p>“You had a late one then?” his father asked when Stiles stumbled into the kitchen.</p>\n<p>“Uh,” Stiles grunted as he slid into a chair and slumped face-first into the table. “Last week of holidays. Must enjoy lack of responsibility. Sleep later.”</p>\n<p>“I see,” his father said. “Well, I thought I might break the mould by summoning you before noon. I’m on doubles for the rest of the week and this might be our last chance to eat together before you’re back at school.” His smirk was audible in his voice. “You don’t mind, do you?”</p>\n<p>“Waffles,” Stiles muttered into the wood of the table.</p>\n<p>“That’s what I thought.”</p>\n<p>Stiles’ eyes slid shut as he listened to the sound of his father puttering around the kitchen, the scent of waffles like a soft olfactory cushion of floury, eggy goodness.</p>\n<p>“I found a leather jacket in the lounge this morning,” the Sheriff said casually, putting maple-syrup next to Stiles.</p>\n<p>“Ugh, Derek must have left it,” Stiles muttered sleepily.</p>\n<p>There was a pause where only the rattling of kitchen implements filled the air. The sound of a waffle-filled plate being slid in front of Stiles’ nose was enough to get him to open his eyes.</p>\n<p>“Derek Hale?” his father asked, his voice mild.</p>\n<p>“Mmm yeah,” Stiles replied, reaching for the syrup.</p>\n<p>“What were you boys up to?” The Sheriff put the syrup into Stiles’ palm, “Here.”</p>\n<p>“Movie marathon.” Stiles said as he dumped about ten pounds of maple onto his waffles. “Can you believe he’s never once seen an episode of True Blood<em> or</em> any of the Underworld series?”</p>\n<p>“Appalling.”</p>\n<p>“That’s what I said.”</p>\n<p>“At least put some fruit on there, Stiles,” his father said, handing him a banana. “Have you two been hanging out a lot lately?”</p>\n<p>“I guess,” Stiles shrugged as he haphazardly sliced the banana onto his food. “Scott’s been busy this summer.”</p>\n<p>“Oh. And what does Derek do to keep busy?”</p>\n<p>Stiles snorted. “Besides babysitting wayward teenagers?” He was busy shoving delicious simple-carbohydrates into his face, so he didn’t pay any mind to his father’s eyebrows shooting up.</p>\n<p>“...Besides that, yes.”</p>\n<p>“Well,” he swallowed. His thought process stumbling along something like:<em> maple good. Waffles good. Dad good for making waffles.</em> “I’ve seen a couple college prospectuses around his loft. I think maybe he was doing an architecture degree before the whole Laura thing.”</p>\n<p>“So you think he’ll be going back... soon?”</p>\n<p>“Nah, I mean,” Stiles yawned, “it’s not like he can just leave Beacon Hills. Maybe he’s gonna do it online.” He hadn’t really put that much thought into it, to be honest, but now he wondered if Derek ever thought about just leaving them and all their drama. Could Alphas leave? They definitely had territory, but was that mobile or permanently fixed in one place?</p>\n<p>He should ask. Whether Derek would answer – or even knew, for that matter – was a different question, but Stiles felt like they were getting on better these days. He was probably less likely to get a door to the face if he asked a strange question.</p>\n<p>“Well,” his dad paused. “Perhaps... you should ask him to have dinner with us some time.”</p>\n<p>Stiles shoved the last few bites of his breakfast into his mouth, wondering if Derek was up already. He’d been pretty wiped at the end of last night, but then, surely werewolf stamina was good for something? If he left now he could maybe niggle some answers out of him before everyone else turned up for the afternoon pack meeting. “Yeah thanks, Dad, that’d be nice.”</p>\n<p>His dad let out a large sigh. “Sure thing, son.”</p>\n<p>Stiles patted the Sheriff on the shoulder as he headed out of the kitchen. “Thanks for the waffles. Make sure you use the low-sugar syrup. I gotta go.”</p>\n<p>“The low-sugar syrup tastes like ass,” the Sheriff grumbled.</p>\n<p>“It tastes like health and wellbeing!” Stiles shouted back from halfway up the stairs. Once in his room, he threw on some clothes acceptable for the outside world and bounced back down the stairs, grabbing Derek’s jacket as he headed for the door. “I’ll catch you later, Dad!” he called.</p>\n<p>He barely caught his father’s low, “Yes, yes you will,” just as he was slamming the door shut behind him.</p>\n<p>...Blame it on the waffles.</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>(The waffles would like everyone to know that they were barely involved.)</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>Derek yawned down at the pan of scrambled eggs.</p>\n<p>“You were out late last night,” Peter said, standing closer than necessary behind him. It was a habit that Derek was still hoping to break his Uncle out of. He grunted in reply and sprinkled cheese into the pan.</p>\n<p>He heard footsteps thumping towards the front door. “Isaac!” he called, “Breakfast first.”</p>\n<p>Teenagers, he was learning, were a lot like wolves. They might snarl at you for it, but they’re happier with some rules and discipline.</p>\n<p>...Even thinking that made him simultaneously very sorry for what he put his parents through, and to want to punch himself in the face. <em>The joys of being not that much older than the people you’re supposed to be taking care of.</em></p>\n<p>Isaac poked his head into the kitchen.</p>\n<p>“Eggs,” Derek said. Which was obviously enough to be convincing, because Isaac slid into one of the kitchen chairs.</p>\n<p>“I didn’t hear you come in until after three,” Peter continued.</p>\n<p>Derek shrugged. Not replying tended to be one of the better ways to get Peter to go away.</p>\n<p>Isaac perked up though. “Yeah, why weren’t you at bowling? It meant the teams were uneven.”</p>\n<p>“Stiles couldn’t go,” Derek replied, dishing up for both of them and sitting down to eat.</p>\n<p>Isaac made a <em>‘and this is relevant how?’</em> gesture.</p>\n<p>“So I went over and watched movies with him instead.”</p>\n<p>Isaac frowned, and Peter’s eyebrows shot up. “You’ve been hanging out with Stiles a lot lately.”</p>\n<p>Derek just chewed his eggs and gave Peter a passive face. Eventually the older man rolled his eyes and gave up, leaving the other two alone.</p>\n<p>Isaac kept shooting Derek odd little looks throughout breakfast, but Derek couldn’t really figure out why. Movies were fun, and movies with Stiles were even more fun.</p>\n<p>It was all perfectly reasonable, really.</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>(And Derek would know, clearly, being a paragon of reason in the best of times…)</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>Stiles was grateful to Scott for noticing. He really was. Who knows what might have happened if he hadn’t.</p>\n<p>(Well, Stiles had a pretty good idea of what would have happened, actually.)</p>\n<p>But it was definitely for the best. Mostly.</p>\n<p>Stiles had given up on pestering Derek and was in the kitchen throwing snacks into bowls while the rest of the pack trickled in for their meeting.</p>\n<p>“I want cheetos!” Erica called. “And candy!”</p>\n<p>“You’ll get what you’re given, Reyes!” Stiles yelled back. He considered the bag of cheetos in his hand.<em> Hide it to spite her, or serve them so I can eat them? Decisions decisions.</em></p>\n<p>Derek came down the hall, still towelling his hair dry from the shower. He wrapped his arm around Stiles’ waist and Stiles tipped his face up so they could press their lips together. “I want cheetos too,” Derek murmured against Stiles’ mouth.</p>\n<p>“How will you keep your girlish figure if you go around eating junk like that?” Stiles asked.</p>\n<p>“Zumba.”</p>\n<p>Stiles snorted and shoved Derek away. “Go, take the food to your wolfy spawn.”</p>\n<p>“I did not give birth to any of them.”</p>\n<p>“No, you just thought it would be a good idea to give them superpowers.”</p>\n<p>Derek made a face.</p>\n<p>“See,” Stiles said, pointing a carrot-stick at him, “that's the face of a man questioning his decisions.”</p>\n<p>Derek huffed and looked through the doorway to where Erica and Scott were rough-housing on the floor.<em> At least someone moved the coffee table out of the way</em>, Stiles thought. It was probably Lydia.<em> Lydia gets extra brownies.</em></p>\n<p>“I was high on new Alpha powers at the time?” Derek said, a questioning lilt in his tone.</p>\n<p>Stiles just shooed him out of the kitchen. “So feed them before they start gnawing on each others' appendages.”</p>\n<p>Stiles finished slicing the carrots (his one attempt at supplying food with actual nutritional value) while Derek settled the rest of the pack. It filled him with a kind of warmth, if he was to be totally honest. To have them all in their den— Uh, in Derek's home. It was good to know they were all healthy and safe.</p>\n<p>“Stilinski, are you coming?” Jackson called.</p>\n<p>“I'm coming, I'm coming! Start! The pack meeting is officially convened.”</p>\n<p>“Does anyone have anything of note to report?” Lydia asked.</p>\n<p>“Still no sign of the witch that tried to maul Stiles' face off,” Erica said, “which is weird because someone should at least have picked up her scent.”</p>\n<p>Allison nodded, looking gloomy. “We haven't been able to establish if she's a Beacon Hills resident or if she's from out of town. The bookstore had security cameras, but none of the recordings seemed to pick up her face.”</p>\n<p>“It probably means she was wearing a glamour,” Derek said, “which means Stiles' description won't be any use, either.” The frustration in his tone was audible all the way from the kitchen.</p>\n<p>“If she's still here, we'll find her,” Allison said, her tone soothing, “and if she's gone then she's probably not a threat anymore.”</p>\n<p>Derek must have nodded, because Lydia said, “Any other items?”<br>\n</p>\n<p>“I have one, actually,” Scott said. Stiles hurried to finish his chopping. They didn't usually have anything major to talk about, but Stiles still suspected Lydia actually took minutes.</p>\n<p>“Scott?” Derek asked.</p>\n<p>“So, it might be nothing. It's probably nothing...”</p>\n<p>Derek's growl echoed how Stiles felt about that sort of lead-in, too.</p>\n<p>“Deaton just said that I should tell you guys that he saw an Emissary from another pack in town yesterday.”</p>\n<p>“What?” Stiles squawked, rushing to poke his head out through the doorway. “Isn't that kind of a big deal?”</p>\n<p>Scott looked back at Stiles. “Deaton said not necessarily, that sometimes Emissaries being in a place doesn't always mean a pack will follow.”</p>\n<p>Derek frowned. “Deaton's right. Part of the role of an Emissary is to move around, to cross territory borders without creating pack rivalries.”</p>\n<p>“But not always, right?” Allison asked. “Sometimes they come to see if a pack is weak or vulnerable.”</p>\n<p>Derek hunched his shoulders, but nodded. “Sometimes.”</p>\n<p>“So what does that mean for us?” Isaac asked.</p>\n<p>This time Peter spoke up from where he was sulking on the stairs. (Stiles’ had a theory that the guy found it easier to snark from a dramatic location.)</p>\n<p>“The fact that they haven't contacted Derek tells us they're not here to parley. So either they're just passing through, or they're here to cause trouble.”</p>\n<p>“Or they don't know who Derek is,” Lydia cut in. Everyone glanced at her and she shrugged. “What? Do werewolves have some sort of information super-highway? Because I haven't come across it yet, and if the only news they have access to is what's been reported in the human media, all they'd likely know is there's probably a new Alpha in Beacon Hills. Everything else would just be rumours, right?”</p>\n<p>Derek glanced at Scott and Allison. “That depends on how much information Deaton or Allison's father have passed on.”</p>\n<p>“Deaton wouldn't spill, would he?” Stiles asked, grabbing the plate of carrots and finally heading through to where the others all sat. \"I mean, he's your Emissary, right?”</p>\n<p>Peter made a sort of half-laugh sound, and Derek shook his head. “Deaton was my mother's Emissary, he's not mine.”</p>\n<p>“Well then who is?” Stiles asked. Derek gave him a look, but didn't say anything.</p>\n<p>“Once again Stilinski is wildly derailing us from the point, which is – what should we be doing?” Jackson said.</p>\n<p>The V of Derek's brows drew together severely. It was what Stiles liked to think of as his, 'trying to be a responsible Alpha who makes good decisions' face. Stiles liked that face, it made him want to pat Derek on the head and give him a cookie. “At this point?” Derek said, “Nothing, as Deaton said, they might just pass through. Keep your eyes open, try to move around in pairs, and stay in public places.”</p>\n<p>Stiles put his plate down on the table and moved towards Derek. “Translation: if the alley looks like somewhere you could get shanked in the dark, avoid.” Derek opened his arms to Stiles, who sank into his lap and nuzzled the side of his face, Derek shuffled Stiles into a more comfortable spot and slung an arm around his middle.</p>\n<p>There was a sharp pause in conversation. Stiles didn't pay it any mind at first, enjoying the feeling of Derek's stubble against his skin.</p>\n<p>“Um...Stiles? Derek?” Scott said slowly. “What are you guys doing?”</p>\n<p>“Huh?” Stiles turned to face the others, there was a ring of various looks of surprise pointed in Stiles and Derek's direction. “Doing?”</p>\n<p>Even Jackson was sitting up from his normal slouch. “Exiting the painfully virginal zone, apparently... And somehow straight into the disgusting couple-y phase practically overnight. I don't know whether to congratulate you or vomit, Stilinski,” he said with a look of distaste.</p>\n<p>“What— no!” Scott said, glaring at Jackson. “Stiles hasn't— he's still—” he turned back to Stiles, his expression pleading, “you would tell me if you had, right?”</p>\n<p>Stiles blinked, utterly confused. “Had what?”</p>\n<p>“Had sex!”</p>\n<p>Stiles blanched, his face heating. “Yes Scott,” he hissed, “I would tell you, you butthead! Though why you need to bring that up<em> right this minute</em> I have no idea!” He glanced around the rest of the group, who were looking a mixture of appalled and embarrassed. (Except for Boyd, who just looked mildly surprised, but Stiles chose to interpret that as his version of appalled and embarrassed.)</p>\n<p>“Then when did you guys...” Scott made a weird gesture at Stiles and Derek, “...you know.”</p>\n<p>Stiles' eyebrows lifted. “No Scott, I don't know, I can't say I understand what—” he repeated the gesture, “means.”</p>\n<p>“When did you get together!?” Scott said helplessly.</p>\n<p>Stiles gaped, he wondered if Scott had taken any blows to the head recently. “We're not together!”</p>\n<p>Erica snorted. “I don't know where you come from, but that looks pretty together from where I'm sitting.”</p>\n<p>Stiles flung his arms up and glanced back at Derek, who was frowning his, 'why have I surrounded myself with nonsensical teenagers' face. Stiles wasn't such a fan of this face, but it was one he'd seen a lot of. “Derek, they're all possessed or something! Can you please assure the pack that we have not somehow suddenly become boyfriends?” Stiles felt his face flaming at the words. Yes, he sometimes gave thought to the fact that Derek had a great ass and had turned stubble into a magical art-form, but that didn't mean he was in love with the dude or anything. Nor did he really appreciate Scott putting him on the spot in front of everyone.</p>\n<p>“We're not together,” Derek said. “Why would you think that?”</p>\n<p>It was Scott's turn to gape. “Look at you!”</p>\n<p>Stiles looked down at himself, he was just wearing a t-shirt and jeans like always, he didn't see what the issue was. “I don't get it,” he said, looking up at Derek, “do you get it?”</p>\n<p>Scott looked as though he was about to burst a gasket, but then Peter spoke up. “Wait Scott,” he stepped up from where he had been lounging and came closer.</p>\n<p>“Stiles,” Peter said, “where are you sitting?”</p>\n<p>“On the couch?”</p>\n<p>“<em>Just</em> on the couch?”</p>\n<p>“Where else would I be?” he said helplessly.</p>\n<p>Scott made a strangled noise, but Peter waved a hand to hush him.</p>\n<p>“Derek, what about you? Is there anything unusual about how you're sitting, compared to last week?”</p>\n<p>Derek's arm tightened around Stiles' middle. “No.”</p>\n<p>Lydia sat forward suddenly, and the rest of the pack was looking far more serious than they had before.</p>\n<p>“What—” Scott started.</p>\n<p>“Shh!” Allison said.</p>\n<p>“Stiles... can you tell me where you're sitting in relation to Derek?”</p>\n<p>Stiles frowned. That was such a weird question. “Be...side... him...?” For some reason though, it was hard to form an answer.</p>\n<p>“Really? Can you put your hand on Derek's arm?”</p>\n<p>Stiles did, wondering where this was going.</p>\n<p>“Derek, can you feel Stiles' hand?”</p>\n<p>Derek nodded.</p>\n<p>Peter was close now, and he had a strange light in his eyes. “Stiles, I want you to look down at your hand, and Derek I want you to think about Stiles' hand. You're doing that? Now I need you to answer this even if it's difficult, alright?”</p>\n<p>The rest of the pack was totally silent.</p>\n<p>“Where is your hand, Stiles?”</p>\n<p>“It's on Derek's arm.”</p>\n<p>“And where is Derek's arm?”</p>\n<p>Stiles was sweating, and his thoughts were skittering around in his head, making it hard to follow his train of thought. But as he stared down at Derek's arm, his eyes strayed from looking at each individual strand of hair, and took in the rest of the scene. “Around... around me...”</p>\n<p>“That's right. And Derek, can you feel that your arm is around Stiles?”</p>\n<p>There was a grunt behind Stiles, and eventually Derek said, “Yeah.”</p>\n<p>“And where does that mean you're sitting, Stiles?”</p>\n<p>“I...” Stiles hesitated and let his eyes move from where Derek's arm encircled his waist and up to his shoulder, Stiles twisted a little, meeting Derek's confused face. “...I'm sitting in his lap.”</p>\n<p>Derek met Stiles' eyes, dawning shock starting to split over his expression. “I'm sitting in his lap,” Stiles repeated, mostly to himself.</p>\n<p>They both moved at the same time, Stiles leaping back and up even as Derek shoved him away. “<em>Why was I sitting in your lap!</em>” Stiles cried, pointing, as if he could blame Derek's lap for magnetically pulling Stiles' ass into its clutches.</p>\n<p>“That's what<em> I</em> wanted to know!” Scott said.</p>\n<p>“I don't know!” Derek said, “Why were you!?”</p>\n<p>Peter sat on the coffee table, watch them both curiously. “What I'm interested in, is how long this has been going on.”</p>\n<p>Erica muttered, “And how have we missed the photo opportunities?”</p>\n<p>“How long?” Stiles rubbed his hands over his face. How had he not<em> noticed</em>? How many times had he—</p>\n<p>“Oh my god!” Stiles yelled, mentally reviewing the day. It was still hard to focus on any one thing but it came back in hot little jabs. “I came over early! We<em> made out</em> on the couch!”</p>\n<p>Jackson moved off the couch as if he'd been bitten.</p>\n<p>Derek was shaking his head. “No, that's not right, we couldn't have—”</p>\n<p>“We did! And then we—” Stiles' face flamed, and Derek paled. Stiles hadn't got messy, but that was only because of where Derek's mouth had been. Derek had spilled everywhere.</p>\n<p>“No,” Derek said.</p>\n<p>“You took a shower!” Stiles yelled.</p>\n<p>“Oh my word, that is more than I needed to know,” Allison muttered, fanning herself.</p>\n<p>Derek looked as though he might be sick. His gaze locked on where his towel was still casually draped over the back of one of the couches.</p>\n<p>“You remember too,” Stiles said defensively, folding his arms across his body.</p>\n<p>Derek got up abruptly, walking a few paces away, his back to the group.</p>\n<p>“Well Derek? Do you remember too?” Peter asked.</p>\n<p>“...Yes,” Derek growled.</p>\n<p>“How did this happen!?” Stiles cried.</p>\n<p>“The fact that neither of you seemed aware or in control of your actions seems extremely telling. Derek, were you aware of what you were doing?” Peter said.</p>\n<p>Derek's shoulders hunched and he turned around. “No, Peter. Stiles is<em> sixteen</em>. Unlike some people I don't think that screwing around with underage kids is acceptable behavior. Of course I wasn't aware!”</p>\n<p>Stiles swallowed down the hurt feeling in the back of his throat, not that he<em> wanted</em> Derek to be with him, but the idea of someone finding him attractive ever might have been a nice one to entertain for more than about half a second. Peter just smiled benignly.</p>\n<p>“Can either of you remember when this apparently involuntary little tête-à-tête started to occur?”</p>\n<p>Derek snarled, but Stiles started to run his mind over the last few days. It was hard. He had to figure out when there were strange little absences where he couldn't quite remember what he'd been doing with his body, and try and work from the edges-in. He flushed as he sorted through the memories.<em> Damn it</em>, he'd had more sexual experiences in the last few days than he'd had in his whole life, and he could barely remember them.<em> And</em> they'd been with a<em> dude</em>. He wasn't exactly... opposed to the thought, but he'd been in love with Lydia (or at least had thought he was) for so long that he hadn't really explored the idea of being an equal-opportunity member of society.</p>\n<p>“I think maybe... about a week? Since the harpies?” Stiles said, unsure.</p>\n<p>“Do you think the witch cursed you as well?” Isaac said.</p>\n<p>“No,” Derek's voice was rough, “It was before then.”</p>\n<p>Stiles looked at him, curious.</p>\n<p>Derek met Stiles' look. “The Marvel night. After you gave me the—” he gestured at the vase, the plants all dried out now, but still arranged nicely, as if Derek had wanted to keep them there.</p>\n<p>Stiles rubbed Derek's wrist-bone comfortingly.</p>\n<p>“Um, guys,” Scott said. Stiles looked over at him. “You're doing it again.”</p>\n<p>Stiles looked down to where his hand was loosely circling Derek's wrist, and to how Derek was standing close, his body angled intimately into Stiles' personal space. “Oh my gosh!” Stiles dropped Derek's hand and backed up a few steps. He couldn't even remember moving towards Derek.</p>\n<p>Derek was rubbing at his own wrist as if he'd been burned.</p>\n<p>“I think it's time to take them to Deaton,” Peter said.</p>\n<p> </p>\n<p>“And you say that neither of you are even aware of your own urges in time to prevent them?”</p>\n<p>Deaton was really much calmer than the situation called for.<em> Like usual.</em> Scott was still looking vaguely ill, and Peter just looked like he was trying not to laugh.<em> Also like usual</em>. Everyone else had gone home,<em> thank god.</em> Stiles didn't need his entire social group to be witness to his epic humiliation (any more than they already had).</p>\n<p>“No,” Derek said, “I don't even know I'm moving. Neither of us seem to notice anything is out of the ordinary until someone else points it out.”</p>\n<p>Deaton sighed and gave Stiles a Significant Look. “Do you want the good news or the bad news?”</p>\n<p>Peter snorted, and Scott just looked like someone had kicked his puppy.</p>\n<p>“Why are you looking at me like it's my fault!” Stiles said. “How could this possibly be my fault?”</p>\n<p>“When is it not your fault?” Derek muttered.</p>\n<p>Stiles' eyebrows just about hit the ceiling. “Um, excuse me? How about barely<em> ever</em>, Mr Guilt-Wallower-Everything-Bad-Is-Because-Of-My-Poor-Decision-Making? Next time I feel the need to punish myself for things out of my control by living in the ruined house my family died in for half a year, maybe we can talk, okay?”</p>\n<p>“The good news is you haven't been cursed by an outsider,” Deaton said as if neither of them had spoken.</p>\n<p>Derek grimaced. “The bad news?”</p>\n<p>“The bad news is, while Stiles meant well by delivering you some forest-plants for your new home, he may have inadvertently caused you both to engage in a Mating bond.”</p>\n<p>“What!” Derek yelled, even as Stiles thunked his head down on the examination table. It really was his fault. He should never try to be helpful or nice. It clearly wasn't healthy.</p>\n<p>“But a mating bond has to be consented to! And it's not possible with humans!”</p>\n<p>Stiles tried to block out the desperate tone in Derek's voice.</p>\n<p>“Unfortunately, while Stiles' thoughtful choices of plants do bring about calmness, peace and safety as he described, when combined they can cause a weakening of social mores, a dulling of reactiveness, and calmness so strong it's almost a kind of forgetfulness. Essentially how that reacted in your situation, is that both of you acted on a mutual attraction which you otherwise might have ignored or never even realized, and, operating on instinct alone, you activated the mating sequence without even being aware – something which Derek at least would have seen the signs of and prevented if he had been in charge of his facilities.”</p>\n<p>“But you don't just—” Stiles looked up to see the confused and desperate look on Derek's face, “You can't just accidentally, bond with someone... there's a series of steps.” Derek looked over at Peter for confirmation, but Peter was just looking thoughtful.</p>\n<p>“Indeed there are,” Deaton said, “and usually they are framed in important ceremony, but each boils down to significant gestures that can be interpreted in different ways. For example there is usually a traditional hunt and offering of a kill from the Alpha to the mate, but it could be done simply by presenting food of any kind.”</p>\n<p>“What are the steps?” Stiles asked, half weary, half curious despite himself.</p>\n<p>Deaton met his look. “As I say, the steps are normally fairly elaborate in the context of the formal binding ceremony, but what they boil down to are six simple steps. Offering of food, exchange of blood, healing or caring for hurts, defense in face of danger, the mating bite, and finally...” he lifted an eyebrow, “sex, or specifically, sex beneath the full moon.”</p>\n<p>Scott made a gurgling noise.</p>\n<p>“We haven't done that!” Stiles said.</p>\n<p>“Indeed not, the full moon isn't for another two weeks. The ceremony is one which typically takes weeks, if not months. The Alpha is meant to 'court' their mate, who accepts them gradually over time as they prove themselves worthy.”</p>\n<p>Stiles felt his face heat, and across the room Derek didn't look much better.</p>\n<p>“Courting? Mates?” Stiles asked. “This is all sounding far too Regency Novel for my liking.”</p>\n<p>“So how many of them have you done?” Scott asked. “Is it still reversible if they haven't done them all?”</p>\n<p>“Yes, depending on their progress, it is theoretically possible to prevent the bond from completing.” Deaton said. “Stiles, Derek, it's important you figure out which of the steps you have passed.”</p>\n<p>“Okay okay.” Stiles thought about it. Offering of food, yeah they'd done that, Derek had given him that popsicle, and he'd brought snacks over the previous night.<em> Who knew that candy and chips are the new diamonds when it comes to securing a wolf-bride!</em> Exchange of blood, easy, Derek and Stiles had both been covered in their own when Derek had carried Stiles home from the harpy incident, and hey, that covered defense in face of danger and caring for hurts, too.</p>\n<p>“Four...?” Stiles said tentatively, looking over at Derek.</p>\n<p>Derek shook his head, his face red. “Five,” he croaked.</p>\n<p>Peter whistled, and Scott's eyes flashed gold and he growled at Derek. “Five? You bit him?”</p>\n<p>Stiles' hand flew to the still aching spot on the back of his neck. He hadn't had a chance to look at it before he'd thrown a shirt on this morning. He'd in his half-brain way just assumed it was a fairly vicious hickey. Not a— a<em> mating bite</em>!</p>\n<p>“Am I going to turn?” he said faintly.</p>\n<p>Derek's own eyes flashed red and he snarled back at Scott. “It's not like a normal bite. It won't turn him. The mating bite is only for mating, that's why it's to the neck, in possession, or the wrist, in supplication. No other bites go there.”</p>\n<p>Stiles felt sweet relief at the words for a moment before they sunk in and he whipped his head around to glare at Peter. “You!” he seethed.</p>\n<p>Peter just raised his hands. “Hey, you can't blame a guy for trying, and I would have been classy about it, unlike my nephew here apparently.”</p>\n<p>Derek frowned at them, eyes still red. “What—” He didn't get to finish before Scott was interrupting. “So what does that mean, can we still stop the bond?”</p>\n<p>Deaton frowned. “Technically it is still possible. In theory so long as they don't complete the final step, the bond will not seal. Because you have bitten Stiles, Derek, you will have to consummate it beneath this coming full moon, or the exchange will reset back to zero.”</p>\n<p>Scott looked relieved. Stiles felt... mostly relieved?</p>\n<p>“That's great,” Scott said. “So they just need to avoid each other for the next two weeks and it'll all be fine!”</p>\n<p>Deaton shook his head. “It won't be that easy. Both of their bodies are hard-wiring themselves to need each other. Ignoring the call, especially on the full moon, will be extremely difficult.”</p>\n<p>Scott frowned. “What if we stuck Derek behind mountain ash and someone stayed home to keep an eye on Stiles, shouldn't that keep them apart?”</p>\n<p>“I suppose...” Deaton looked uncertain.</p>\n<p>Derek spoke up, “But that is what I don't understand. A mate changes... physically. A human shouldn't be able to do that. I've only heard of other wolves or shifters becoming a mate.”</p>\n<p>Deaton nodded. “Usually you'd be correct. But Stiles is not strictly human. He carries a spark.”</p>\n<p>Peter looked at Stiles sharply. Stiles glared back.</p>\n<p>“In general a spark is not very useful. Simply a channel for magic to flow, but shape-shifting is just another kind of magic. Stiles' spark is more than enough for your energy as an Alpha, Derek, to flow into him and change him.”</p>\n<p>“What kind of 'physical changes' are we talking about here?” Stiles asked with some alarm.</p>\n<p>Derek looked at him and opened his mouth, but then shut it and looked away, his face red.</p>\n<p>“It's probably best you don't worry about it, Stiles,” Peter said soothingly. “Besides, since you both are going to avoid each other from here on out, I doubt it will come up.”</p>\n<p>“They might be right...” Deaton said slowly. “Best not to worry, Stiles.” He turned away to get some supplies from his cabinet, looking suspiciously uncomfortable. Stiles narrowed his eyes.<em> Just great. Mysterious 'physical changes' which even the</em> vet<em> is too creeped out to talk about.</em></p>\n<p>Deaton came back with several wooden boxes. “Now, you both look like you've had an exhausting day. I can give you some herbs which will counteract the original problem of Stiles' floral gift, so you'll at least be aware of your actions again. Remember though, the mating bond is nearly complete, and you will both have to work hard to control your instincts to be together. You will both have to exercise considerable willpower, understand?”</p>\n<p>Derek and Stiles both nodded.</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>(Really though, someone should have pointed out at that point that neither of them was the poster-child for self-control...)</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>Stiles watched the ceiling-fan spin. He smacked his dry, cracked lips and tipped his head to the side to stare listlessly at the glass of water on his side-table. Condensation was forming on the side of the glass, droplets sliding down inch by slow inch.</p>\n<p>He was officially losing his mind. Tomorrow was the first day of school but right now Stiles didn’t like his chances of making it. Every bone in his body ached, and the last time his Dad had checked his temperature he’d even offered to take the day off to make sure he didn’t die or something. It was real encouraging.</p>\n<p>“Stupid Derek and his stupid sex bite.”</p>\n<p>It had only been a day since they’d found out what was wrong. One day since Derek and Stiles had promised to avoid each other so that they didn’t end up werewolf-married.</p>\n<p>Stiles made a face and crept a hand up the bedspread, he was only about half the distance to the glass of water before he gave up, his muscles trembling and exhausted.</p>\n<p>There was no way he was going to survive the next two weeks to the full-moon. He’d be a dried up husk by then.</p>\n<p>He let out a slow, pained breath. This sucked. It sucked because he felt awful, and it sucked because despite feeling like he'd been put through a meat-grinder, he was still kinda horny and couldn't stop thinking about Derek's dick.</p>\n<p>He glanced down to where his cock was tenting his boxers. Okay so, maybe not so much 'kinda' horny as 'raging unstoppable boner' horny. And 'unstoppable' was definitely the key word here. He'd discovered, to his considerable displeasure, that the longer he went without seeing Derek, the harder it was to actually get off. He had all the eager equipment in the world, but no release.</p>\n<p>Basically this was just the most fun day ever.</p>\n<p>He glanced forlornly at the water-glass. This just wasn't fair. He was essentially dying in a metaphysical desert right now, and why? Some sort of 'residual subconscious attraction'?</p>\n<p>Did appreciating someone having a fine ass now cross you over into 'available for mating' territory? Surely then at least 70% of Beacon Hills would be casting 'take me now' vibes at Derek. Sure Stiles and Derek had been spending more time together this summer, and maybe they'd crossed over into something resembling 'friends' territory, but the guy was what, 23? 24? Just the<em> look</em> on the Sheriff’s face if he found out that very-adult hands had been in Stiles' very-underage pants gave Stiles chills.</p>\n<p>It also made Stiles' cock jerk in said pants. He glared down at it. “You are a bad influence, and no one is listening to your opinion on this matter.”</p>\n<p>\n<em>Great job, Stiles, now you're talking to your dick.</em>\n</p>\n<p>He let his head fall back on the pillow. “Traitor,” he added, for good measure, because if you're sex-cursed and dying, you might as well embrace the conversations with your genitalia.</p>\n<p>Meanwhile, on top of being about a thousand years too old for a Sheriff's kid to date, Derek was kind of an asshole, and a dude to boot. Okay, maybe Stiles was a bit of an asshole too, (see: suggesting he could leave Derek to die because it would solve their problems. He did feel kinda guilty about that one now. And he was at least 80% joking at the time.)</p>\n<p>The dude thing...</p>\n<p>Stiles groaned and mushed his face into his pillow. Had he maybe once or twice thought about guys that way? Admittedly Jackson had extremely distracting cheekbones, but he was also an awful, awful non-human being, so Stiles also wanted to punch him a lot, so the urges were hard to sort out. Danny? Well... everyone liked Danny, right? He had a great smirk, and great teeth, and great skin. But was that just 'I want to be like you' appreciation or 'I want to stroke you' appreciation?</p>\n<p>Even Stiles thought he was sad right now. Although it did bring his embarrassingly-long obsession with Justin Timberlake into a different light.</p>\n<p>So maybe it was at least possible that Stiles was a teeny tiny bit maybe possibly on-certain-angles attracted to Derek. As for Deaton's 'mutual' comment...</p>\n<p>Stiles swallowed, his throat clicking with dryness. His hand was still about a foot too far from the water-glass. Maybe he really was going to die.</p>\n<p>But then the glass was lifted, and it came to his lips, where he desperately sucked down a few mouthfuls before it moved back to his side-table.</p>\n<p>“Great, the hallucinations have started.”</p>\n<p>\"You're dehydrated, not delirious. You can have more water in a minute.\"</p>\n<p>Stiles whipped his head around. Derek was sitting next to him on the bed. His eyes were bloodshot and he looked paler than usual, but he didn't look as much like death incarnate as Stiles was feeling.</p>\n<p>\"You're here. You're not supposed to be here. You or your magical dick.\"</p>\n<p>Derek scowled. \"Scott said you were sick. He couldn't get over here so I thought I would check on you.\"</p>\n<p>\"You couldn't send someone who isn't under a non-consent spell?\"</p>\n<p>\"Deaton said we should be able to control the pull. And if you were really that sick, there's nothing that Scott or the others could do to help you.”</p>\n<p>Stiles would have edged away if he could, you know,<em> move</em>, but instead he just gave Derek his best severe look. “But you and your penis can, right? I see what you're up to, Hale.”</p>\n<p>Derek growled. “No, Stiles! Could you stop talking about my dick? I talked to Deaton about it and he said that physical contact, any physical contact, will ease the...” he trailed off, the tips of his ears flushing.</p>\n<p>“Constant burning desire to fuck?” Stiles finished for him helpfully.</p>\n<p>Derek shot him a glare. “Yes,” he grit out.</p>\n<p>“Well that's definitely something I could have done with knowing before spending several hours in gradually increasing agony.”</p>\n<p>Derek shrugged uncomfortably. “Mating bonds don't usually happen with humans. No one really knows how it will react with you. How deep it will go.”</p>\n<p>Stiles couldn't help but snort. “I think we can all agree that it's already gone more than 'deep' enough.”</p>\n<p>Derek rolled his eyes.</p>\n<p>“So, Sourwolf, what level of physical contact are we talking about? Are we going to be holding hands and skipping through the marigolds together for the next two weeks? Do I need to remind anyone that I have school tomorrow? While the hilarity of seeing your leather-clad and scowling self stuffed into a desk beside me would almost be worth the hassle, I'm pretty sure there's some school policy about creepy adults hanging around touching the students inappropriately.”</p>\n<p>“Thank you Stiles, but no, I didn't need a reminder that you are a child. That is a glaringly obvious reality.”</p>\n<p>Stiles gave Derek a smarmy grin. “I like to think of it as appreciating my youth.”</p>\n<p>Derek grumbled under his breath, “I'll appreciate your youth.”</p>\n<p>“I bet you will,” Stiles said.</p>\n<p>Derek blushed, and Stiles did a mental fist-pump, but then he realized that he'd just accidentally flirted, and he blushed himself.</p>\n<p>“I won't need to come to school with you. If we...” Derek got even redder, and Stiles couldn't help but be a little fascinated. He'd always thought Derek would be totally suave when it came to this sort of thing. But then again, for all his outward impression, Derek was pretty much the opposite of suave once you got to know him, so Stiles wasn't sure why he was still holding on to that illusion. “...If we have close contact all night,” Derek finished.</p>\n<p>Stiles lifted his eyebrows, trying to parse out what that was supposed to translate to in normal-speak. “You're referring to cuddling, aren't you?”</p>\n<p>Derek sighed and looked away.</p>\n<p>Stiles struggled up further in bed. “You're totally referring to cuddling. You want to snuggle me all night!” He made a face. “You want to snuggle me all night?”</p>\n<p>Derek closed his eyes as if he were praying for patience. “No Stiles, I don't<em> want</em> to, but seeing as you are so sick, I don't see that I've got much choice.”</p>\n<p>Stiles closed his mouth.</p>\n<p>“Don't give me that look,” Derek said. “You don't want me here either.”</p>\n<p><em> Right?</em> He felt pretty happy that Derek was here right now, but he wasn't sure if that was related to how much fun it was to tease him, or because he had some funky magic going on in his brain that was telling him that Derek should be his husbando or something. Or maybe it was just relief that someone was giving him water.<em> It's not like anyone else bothered.</em></p>\n<p>“Wait, when you say snuggle all night—”</p>\n<p>“I did not use that phrase.”</p>\n<p>“—do you mean<em> here?</em>”</p>\n<p>Derek lifted his eyebrows. “You would rather coming to my apartment? To my bed?”</p>\n<p>Stiles opened his mouth, but didn't say anything. He feared whatever came out would be too close to what his dick thought about that, and it was already established that his dick was a traitorous traitor who was not to be consulted on any matters ever.</p>\n<p>Derek continued, “My apartment where Peter and Isaac both live?”</p>\n<p>“Ah. Point.”</p>\n<p>Derek looked smug.</p>\n<p>“Except not point,” Stiles said, “because the alternative is you being<em> here</em> in<em> my</em> bed, in the same house as my<em> Dad, the Sheriff</em>.”</p>\n<p>“I'll hear if he comes home. Besides, he's working most nights, isn't he?”</p>\n<p>Stiles sighed in defeat. Derek handed him the water glass, and Stiles already felt better enough that he was able to hold it himself. Victory! He looked down the bed and saw that Derek had his knee pressed up against the side of Stiles' leg.<em> Darn</em>, that kind of proved Derek's theory correct.<em> I guess I have a snuggle-filled future.</em></p>\n<p>Was it so bad that the thought didn't exactly horrify him?</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>(Bad, no. Telling, absolutely.)</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>Derek woke slowly, which was unusual in itself. Most nights tended to end with either him tearing himself out of a nightmare, or an instant transition between asleep and awake. This time, he slid slowly up out of the clinging murk of his dreams and let out a long breath.</p>\n<p>He was warm. And something smelled good. Really good.</p>\n<p>There was a shift next to him and a small noise. Derek opened his eyes as he realized his arms were wrapped around a warm body.</p>\n<p>\n<em>Stiles. Mate.</em>\n</p>\n<p>No. No, he wasn't going to be that guy. He wasn't going to be like<em> her.</em> Even if Stiles smelled like a mixture of sun-warmed hay and the woods after hard rain. Even if he smelled<em> ready</em> and lush and inviting.</p>\n<p>\n<em>Dammit!</em>\n</p>\n<p>Derek shifted his hips forward, his hardness pressing into the swell of Stiles' backside.</p>\n<p>“Um, Derek?”</p>\n<p>Derek's arms tightened involuntarily, he hadn't realized that Stiles was awake, but now that he was.<em> Damn.</em> He could smell Stiles' hardness. Could feel the tension radiating through his lithe form.</p>\n<p>“Relax dude,” Stiles said. “Awkward boners are to be expected at this point.” His tone was tight despite the casual phrasing.</p>\n<p>Derek pulled his hips back, possibly a little slower than he might have. “Sorry,” Derek said.</p>\n<p>“No apology necessary.”</p>\n<p>Derek wondered if Stiles knew how much his body was singing to Derek. How his hips twitched back a fraction after Derek's, how closely he was pressed against the rest of Derek's body, even after Derek had relaxed his hold. How his temperature was elevated, his skin covered in a fine sheen of sweat that made Derek just want to...</p>\n<p>He lowered his mouth to Stiles' shoulder, where his t-shirt was loosely gaping, revealing pale skin marked with tiny dark moles.</p>\n<p>“Derek?” Stiles' voice was squeaky. It made Derek think of<em> prey</em> and he felt his lips stretch into a satisfied grin around the mouthful of flesh he was holding gently between his teeth. Derek dug his teeth in harder, and Stiles' scent spiked with the scent of submission. Derek had to close his eyes to stop himself from simply throwing himself over Stiles then and there and fucking right into him.</p>\n<p>“Wh— What are you doing?”</p>\n<p>He had to at least prepare him first. Maybe... maybe Derek could stop himself, could stop himself before he... But if he couldn't he mustn’t hurt Stiles. Not his first time.</p>\n<p><em>His first time</em>. Derek had been mentally tiptoeing around the thought. But now it came on with a vengeance, stiffening his cock even more in his shorts. Stiles had never done anything with anyone before. No one except Derek. It made his wolf beg to howl with delight.</p>\n<p>Derek moved the arm he had wrapped around Stiles' middle, slipping his hand beneath Stiles' t-shirt. “You're hard,” he said as he indulged his desire to run his fingers over Stiles' skin.</p>\n<p>Stiles sucked in a sharp breath, his abs tightening beneath Derek's fingers. “I think you're missing the bro-code law of awkward boners, dude. You know, the part where everyone involved pretends it's not happening?”</p>\n<p>“Are we bros?” Derek asked, lowering his mouth to the side of Stiles' neck.</p>\n<p>“We could be? If you stopped ravishing me or whatever it is you're doing?” Stiles voice was high.</p>\n<p>“Do you want me to?” Derek stilled the movements of his hand and pulled his lips a fraction away from Stiles' neck. If Stiles told him to stop, he would. He<em> somehow</em> would find the will from<em> somewhere</em> and get up and leave. Stiles let out a whine.</p>\n<p>“You're a bad person, you know that?”</p>\n<p>“Yes,” Derek agreed readily enough.</p>\n<p>Stiles twisted his body around so he faced Derek, his pupils were dilated dark with arousal, but his expression was annoyed. “You're not, you know.”</p>\n<p>“What?” Derek asked, surprised by the fierceness in Stiles' tone.</p>\n<p>“A bad person. You're not. You make stupid calls sometimes and you're impressively bad with people, but you're not a bad guy. The only person I've ever seen who comes close to you for trying to help and protect others is Scott, and even he only does it when he's not fixated on something else. So don't you try that 'I'm a waste of space' bullshit on me. And no, I don't want you to stop. I would actually kinda like it if you helped me with this.” And he thrust his boner up against Derek's.</p>\n<p>Derek fell out of the shock Stiles' words had caught him up in and right back into the heady rush of<em> mateclaimbitetakefuck</em> that had been crawling up his spine since the moment he woke up, and he leant down to catch Stiles' mouth up into a kiss, thrusting his tongue into Stiles' mouth just like he wanted to do to the rest of his body. The message was probably clear, because Stiles whimpered, his body going lax in Derek's hold, his arrogance melting into a happy, eager passivity, his mouth wet and easy beneath Derek's.</p>\n<p>It made Derek want to howl and prance, to show off his sweetly submissive mate. He knew it was partly the mating bond that was making them play this dance of bitch and stud, but knowing it didn't make the desire to crow over Stiles' willingness any less.</p>\n<p>“Lube, do you have any?”</p>\n<p>Stiles groaned. “Fuck. Yes.” He twisted, reaching into the back of his bedside drawer and tossing the tube to the bed beside Derek's hand before diving back in to another kiss. Derek accepted it readily even as he started easing Stiles' boxers down his ass.</p>\n<p>“Derek. We're not... we're just—?”</p>\n<p>Derek kissed Stiles firmly. “I just want to get my fingers inside you.”</p>\n<p>Stiles whined and his hips bucked. “I... okay, yeah.”</p>\n<p>Derek indulged himself by running his hands over Stiles' pert little ass, squeezing the flesh firmly. Stiles panted against the skin of Derek's shoulder where his mouth was exploring, staying away from the curve of Derek's neck, likely knowing how much it would put Derek on edge. Derek let out a satisfied breath and squeezed some lube onto his fingers and started circling Stiles' hole with one finger, getting him used to the touch and the cold.</p>\n<p>“Derek?”</p>\n<p>Derek used his other hand to tip Stiles' face up into another kiss, biting sharply down on his lip even as he slid one finger firmly inside.</p>\n<p>Stiles yelped. “Did you just use the 'bite the virgin' trick on me?”</p>\n<p>Derek smirked, gently starting to ease his finger back and forth. “Still a virgin, aren't you?”</p>\n<p>Stiles' eyes managed to display their usual rapid mix of emotions even when they were darkened with lust. “Am I?”</p>\n<p>“As far as I'm concerned,” Derek said, edging a second finger in alongside the first, “you're a virgin until you get my cock inside you.”</p>\n<p>Stiles flushed, his hips twitching as Derek's fingers worked themselves deeper. “Is that what you're going to do?” he asked.</p>\n<p>Derek indulged himself in a deep thrust with his fingers. “Do you want me to?”</p>\n<p>Stiles stared at him, mouth open and red and wet. The silence held for a few beats until Derek crooked his fingers, Stiles' hips jumped and he broke Derek's gaze and turned his face away, hiding in Derek's shoulder even as he moved his body in time with the fingers pressing into him and scissoring apart.</p>\n<p>“Is that good, Stiles?” Derek asked, watching as the flush on Stiles' cheeks spread down his body, heating his throat and chest. Derek wondered if the still-visible wound on the back of Stiles' neck hurt with the added blood-flow. The warm clutch of Stiles' body around his fingers made Derek's cock leak where it was still trapped inside his briefs, and he gently pressed a third finger against Stiles, edging the tip just past his tight little ring. “Have you ever done this to yourself?” Derek asked. “Waited until your father was asleep and filled yourself up on your own fingers? Smothering the noises you made into your pillows?”</p>\n<p>Stiles whined, then nodded. Derek growled at the thought, wishing he could have seen it, Stiles flushed and open and humping his own cock into the sheets. He pressed his third finger slowly into Stiles' body, feeling the warm slick muscles give beneath his insistence. He slid them deep, and teased and pressed at Stiles' prostate.</p>\n<p>“Was it good?” Derek said. “Could you get your fingers in as much as you wanted?”</p>\n<p>“No,” Stiles whimpered, his lips rubbing against Derek's skin, “the... the angle. I couldn't get deep enough.”</p>\n<p>Derek couldn't help but thrust his hips up against Stiles' at the thought. “Did you buy a dildo so that you could fill yourself up?”</p>\n<p>Stiles mouthed at Derek's shoulder, wet and loose, as if he didn't have the coherence to shape his lips into a bite or a kiss. “No,” he said, his voice shaky, “I couldn't figure out how to— to get one without Dad knowing.”</p>\n<p>Derek groaned, his fingers stilling and his cock aching. “So you've never been satisfied? Never got it how you needed it?”</p>\n<p>Stiles' high-pitched whine was answer enough, and Derek couldn't help it, he pulled his fingers free and rolled Stiles over, slipping his own underwear off in the process.</p>\n<p>“Derek?”</p>\n<p>“Fuck, Stiles, I just need to feel you.” Derek pressed his cock up between Stiles' cheeks, groaning and pulling them apart so he could see where his pre-come was tagging Stiles' skin. “Fuck, you’re so good,” Derek groaned.</p>\n<p>“<em>Derek.”</em></p>\n<p>“Do you like that, having my scent on you?” Derek hastily coated his cock in lube so that he could thrust smoothly between Stiles' cheeks.<em> Dammit</em>, Stiles' color was high, his whole body covered in the sheen of sweat... He still smelled so<em> innocent,</em> even as he was rutting himself against the bed sheets.</p>\n<p>Derek wanted to<em> ruin him</em>. Some part of his brain still registered that Stiles was just a teenager. A kid. And one who hadn't even really consented to this, but the rest of Derek just did. not. care. He wanted to mark up that skin, fuck Stiles' constantly-open mouth until he cried, bend him over every available surface until getting fucked by Derek was just second nature to him. Until he didn't feel right without Derek's come, warm and wet, inside him.</p>\n<p>Derek groaned. “Shit. I can smell how hard your cock is, Stiles. I haven't even put my hand on you and you are dripping into the mattress, aren't you?”</p>\n<p>Stiles moaned, his forehead rubbing against the sheets in a hazy nod.</p>\n<p>Derek thrust hard, squeezing Stiles' cheeks tight around his cock. “Tell me.”</p>\n<p>“I... I don't—” Stiles stuttered, his flush darkening across his face.</p>\n<p>Derek leant in, pressing his front along Stiles' sweat-slick back, mouthing at the shell of Stiles' ear. “Go on, baby. Tell me what's making you so hard.”</p>\n<p>“You, you asshole.” Stiles snapped. “You and your massive fucking dick, and your mouth, and your precome on my skin and god fucking dammit I want you to fuck me so bad.”</p>\n<p>It was Derek's turn to whine. His next thrust caught against the stretched-out rim of Stiles' ass, the little mouth of it greedily clinging to Derek's cock. Derek paused, pressing in slightly.</p>\n<p>“Derek! You can't!”</p>\n<p>“Just a little,” Derek said. “Just the tip.”</p>\n<p>Stiles was panting, his mouth hanging open and his eyes heavily lidded. “Just the tip?” he said.</p>\n<p>“Promise.”</p>\n<p>“Oka—”</p>\n<p>But Derek was already pressing in. He bit his lip and fought not to just slam his whole length inside. Instead he increased the pressure bit by bit until his cockhead popped past Stiles' virgin-tight rim, settling just inside Stiles' body.</p>\n<p>Stiles let out an inhuman noise even as Derek's wolf growled out its satisfaction.</p>\n<p>“Fuck, yeah, Stiles, that's just right.”</p>\n<p>Stiles whined and his hand scrabbled back in the sheets, searching. Derek leant forward to link his fingers with Stiles'.</p>\n<p>“Doesn't that feel good? To have me inside?”</p>\n<p>Stiles was too incoherent to reply, (for once,) but his hips twitched at Derek's words, sinking him back a tiny amount further on Derek's cock.</p>\n<p>Derek's eyes fluttered shut for a second but he opened them again immediately, not wanting to miss an instant of Stiles stretched out, flushed, ass in the air and Derek's cock sunk just within his tight little pucker.</p>\n<p>If Derek was a better person, he would have stopped there, but (despite Stiles' clearly uninformed opinion on the matter) he really, really wasn't a nice guy. A kind of madness had settled over him, so instead he leant in to Stiles' ear and started whispering.</p>\n<p>“You know, I could jerk off like this, my hand just outside your body. When I came I would spill all up inside you. Mark you on the inside.” Stiles' hips twitched again, and it was a good thing Stiles was facing away from him, or he might have objected to the grin which spread over Derek's face. “Do you like how thick it is? How much it stretches you? I bet you do. I bet you've been dreaming every night of someone pinning you down and filling you up. Something about you just screams that you want a hard cock inside you. I bet you'd like one in your mouth just as much. Would love to suck it so deep you gagged. Would do it over and over.”</p>\n<p>Stiles was letting out these pitiful little moans that made Derek want to rut and claim. But he held himself perfectly still by sheer bloody-minded tenacity, keeping up a stream of dirty talk that had Stiles writhing and twitching his hips, the movements slowly but surely settling Derek's cock deeper within his body.</p>\n<p>It didn't take long before Derek was almost fully sheathed in Stiles' wet, grasping heat.</p>\n<p>“That's it. Just a little bit more, baby,” Derek crooned. “Only a little left. You know you want me as deep as you can get it.”</p>\n<p>Stiles cork-screwed his hips, settling the last half-inch so that his ass was flush with Derek's skin. His hand tightened convulsively within Derek's.</p>\n<p>“Yeah. Fuck, that's perfect. You're perfect. Doesn't that feel good, Stiles?”</p>\n<p>“Yes.” Stiles whispered into the sheets.</p>\n<p>Derek groaned. “Don't worry. I'm going to take care of you. I promise. I'm going to fill you up just like you need. That's what you want, isn't it?”</p>\n<p>The burst of salt-tang in the air told Derek that tears had sprung from Stiles' eyes. His voice shook when he said, “Yes. Please. I want it all.”</p>\n<p>Derek let himself close his eyes for a moment, resting his head in the center of Stiles' back. In this moment, nothing seemed more perfect than those words.</p>\n<p>He slowly, so slowly, not wanting to startle Stiles, started to slide his cock back, then in again. Gently, his rhythm building as Stiles' ass started to give beneath the pressure of Derek's body.</p>\n<p>“Is that good?” Derek said.</p>\n<p>“Yeah.”</p>\n<p>“You like getting fucked, Stiles?”</p>\n<p>Stiles' clenched around him, and Derek shuddered, shoving his claws into the bed-spread to distract him from pounding into Stiles as hard as he could.</p>\n<p>“What do you think, asshole? You want a medal or something back there?” Stiles' voice shook, despite the sharpness of his words.</p>\n<p>Derek grinned and pushed his dick in hard, making sure to fuck across Stiles' prostate in the process. Stiles whimpered and his elbows gave out, dumping him so he was face-first into the bed, his ass high in Derek's grip.</p>\n<p>“I don't think a medal will be necessary,” Derek said.</p>\n<p>“Well then maybe do you want to think about fucking me a bit harder so that I can come some time this century?”</p>\n<p>Derek laughed. “Yeah Stiles, I can fuck you harder.”</p>\n<p>Stiles let out a sigh of pure satisfaction as Derek started to pick up the pace, and Derek had to admit, even though Stiles was a total brat, the sound was music to his ears. Fucking him felt like fucking into liquid gold. He was so<em> hot</em> and<em> tight.</em> His skin was so soft, so pale. Only broken by his scattering of moles and the mark of Derek's own teeth on the back of his neck.</p>\n<p>Derek shifted so that he could lean back, grabbing Stiles' ass between both of his hands and starting to pound in desperately. This was<em> his</em> human. He wore his mark.</p>\n<p>Derek didn't realize at first that that low possessive growl was coming from him. Stiles twisted his head to the side so he could look back at Derek, his mouth open and panting with every thrust.</p>\n<p>“You like that, don't you, Sourwolf? Fuck, I don't think I've ever seen you look so satisfied as this, fucking me full.”</p>\n<p>Stiles' eyes were still sharp and assessing, even when he was being pounded into the mattress, and something about that that just made Derek crazy, made his hips thrust faster just so he could hear Stiles' pants turn into little 'ah ah ah's of helpless noise. He bent down, getting his face close to Stiles'.</p>\n<p>“Are you going to come on my cock?” Derek asked, meeting Stiles' eyes, feeling the way Stiles was undulating back, trying to get more of Derek inside him with every thrust. “I'm going to come soon and fill you with my claim.” Derek's voice shook at the thought. “I bet you'll come without even me touching your dick. You want it that badly.”</p>\n<p>Stiles broke their gaze, his eyes fluttering shut and his hips moving faster, he let out a guttural noise. “Yes. Yes I want— I want—”</p>\n<p>Derek snarled, sitting back again and fucking into Stiles probably faster than he should, faster than he ever had with a human. But this wasn't any human, this was his<em> mate</em>, this was his claimed, his offering, and his mate was begging, his mate needed—</p>\n<p>Derek, somewhere in the haze of<em> mateheatfuckwantclaimStiles</em>, felt something twitch, something swell, but it was too late to think because he was coming. Shoving in as deep as he could get, pulling Stiles up hard against his chest and coming so hard he thought he might black out.</p>\n<p>It took a while before the noises Stiles was making coalesced into language. “Derek! Derek you mutant asshole! What the fuck is your dick doing!”</p>\n<p>“What?” Derek said blearily. He could barely focus, his dick still pulsing inside Stiles.</p>\n<p>“It... it hurts! It's huge!”</p>\n<p>Derek rocked his hips gently, only to find he was firmly wedged inside Stiles.</p>\n<p>“I've knotted you,” Derek said, shocked.</p>\n<p>“Are you fucking<em> kidding me</em>!?” Stiles had a noticeable amount of hysteria in his voice, but that was probably understandable, considering. “I didn't think werewolves could do that!”</p>\n<p>“Only with mates,” Derek said, but he was distracted by the fact that Stiles' still very hard and weeping cock was standing to attention, pressing up against Stiles' belly. “You didn't come.”</p>\n<p>“Ah, yeah numbnuts! I was getting really close there when someone decided to shove a baseball up my ass without asking.”</p>\n<p>Derek rocked his hips again, it was difficult to get the angle right to move without tugging on Stiles' hole, but after a few tries he figured out a kind of grinding motion.</p>\n<p>“Derek, no, stop. It hurts, what are you—?”</p>\n<p>“Shh,” Derek said, “It'll get better soon.”</p>\n<p>“No Derek, I don't want—” but Stiles was already being cut off by his own moan as Derek's movements pressed his knot against Stiles' prostate.</p>\n<p>“That's it,” Derek said. Stiles' flush was spreading again, and now his hips were rocking too. Derek noticed that his little belly was getting rounder as they moved. “Fuck,” he said, pressing his hand to the slight curve. “You see that Stiles? Look at how full you are. I've filled up your belly.”</p>\n<p>Stiles let out a high-pitched whine and he came, no hand on his cock, just Derek's length inside him and his knot spitting him. Streaks of his come spilled all over himself, from his chin all the way down his chest.</p>\n<p>“Fuck, yeah, Stiles. You're perfect. Look at you.”</p>\n<p>Stiles slumped back against him, limp. Derek put his arms around him to stop him from slipping sideways. Stiles was so out of it he looked like he was almost unconscious, so Derek carefully laid them both down on the mattress on their sides, Derek's cock still deep inside Stiles and pulsing.</p>\n<p>“You're not... pulling out?” Stiles asked, his voice a sleepy blur.</p>\n<p>“I can't for a while. I have to wait for the knot to go down.”</p>\n<p>“But—”</p>\n<p>“Shh Stiles. Best if you can just learn to sleep with it inside.”</p>\n<p>“Mmm okay,” Stiles said, but he was already basically asleep.</p>\n<p>Derek looked down, Stiles was covered in his own come and it would be long-dry before Derek could get up for a washcloth.</p>\n<p>He dropped his hand down, scooped up some of the mess and brought it to his mouth to lick clean.</p>\n<p>Sometimes there were benefits to being part wolf.</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>(The validity of Derek's opinion on that particular matter was still under review.)</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>When Derek woke up again, this time it was because of the sun splashing onto the bed through the open curtains. Stiles was curled up in his arms, dark lashes resting on his cheeks, smelling of contentment and of claim.</p>\n<p>Derek had to shut his eyes and breathe through his mouth for a moment. Not that it helped, the scent in the room was so thick it just felt like it coated the inside of his mouth. Derek wanted to bite down on it. He looked down to where the bed was filthy with where his come had leaked out of Stiles in the night.<em> Fuck</em>. He'd never come like that before. Never knotted anyone. Never even talked about it much other than one embarrassing conversation with his Dad and several probably-misinformed giggled conversations with his cousins and sisters. He'd had no idea it would feel so...<em> right</em>. So like rutting until the world came to a stop. So like... sewing himself into someone else's flesh.</p>\n<p>He pulled his hips back so he could check on Stiles' ass, and felt like his brain nearly short-circuited when he saw that his mostly soft dick was still half-inside Stiles.</p>\n<p>…Now at this point, he really should have pulled away, woken the<em> teenage boy</em> who he had taken the virginity of (under slightly shady circumstances, as well), checked to make sure he wasn't hurt and then left him alone no matter what for the next two weeks. That would have been the adult and sane response to the situation he was in.</p>\n<p>But Derek wasn't always very good at making adult decisions, particularly when his wolf was so keen on deciding for him, so instead he pumped the part of his cock he could reach until it stiffened and then he shoved himself back into Stiles' body.</p>\n<p>Stiles made a soft little sleepy sound, and if he could have Derek would have come right there and then. He was still so<em> wet</em> and soft inside. Still stretched from their activities hours earlier. Derek pumped his hips a few times. They'd have to be quick, Stiles' alarm would be going off soon. He licked his own hand, reached down and circled Stiles' cock. He was pretty sure he could make Stiles happy to be woken earlier than usual. Between the pumping of his dick and his hand around Stiles, it wasn't long before the kid's scent was flushing with want, and his hips were jerking unsteadily along with Derek's movements. Derek smiled and leant down, gently but firmly slipping his teeth into the bite-mark low on Stiles' neck.</p>\n<p>Stiles jerked awake. “Fuck!”</p>\n<p>Derek carefully removed his teeth long enough to say, “Shh. You'll wake your dad,” before delicately biting down again.</p>\n<p>“I'll wake my— Derek, what are you<em> doing</em>,” Stiles hissed.</p>\n<p>Derek didn't dignify that with a response, he just fucked harder into Stiles' ass. It didn't take much before Stiles' protests died down into moans and whimpers, and it wasn't long at all before he was shaking and coming all over Derek's fist. Derek sunk his teeth in harder, and Stiles' hips shifted back in submission. Derek growled and thrust once, twice more and came, holding his knot back from forming with sheer bloody mindedness.</p>\n<p>They both lay there, catching their breath. Derek licking occasionally at the mark on Stiles' neck.</p>\n<p>“Derek, are you<em> completely insane</em>!?” Stiles hissed, pulling away and rolling over, his eyes snapping with emotion.</p>\n<p>Derek mused on the question. It did seem fair, considering the circumstances. “Possibly.”</p>\n<p>Stiles rolled his eyes. “Oh, I'm so glad you agree. Wasn't it only two days ago that you were all like, 'I'm too good to sleep with a teenager'?”</p>\n<p>Derek frowned. “I didn't say it like that.”</p>\n<p>“Not the point. Fail,” Stiles jabbed him in the chest with a finger, “complete and total fail.”</p>\n<p>Derek grabbed Stiles' finger and flattened his hand against his own chest. “What, so that was all on me? You had nothing to do with it?”</p>\n<p>“I'm sixteen! I always want sex! I can't be held accountable.”</p>\n<p>“Yeah well you're my mate, or at least my body thinks you’re going to be. I always want to have sex with you.”</p>\n<p>“I know you don't want me to end up being your werewolf-magic husband,” Stiles said.</p>\n<p>Derek narrowed his eyes. “What's your point?”</p>\n<p>“Well one of us is going to have to be better at being responsible, because otherwise that looks like where we're going to end up!”</p>\n<p>Derek looked down, Stiles' fingers had started rubbing against Derek's nipple, and Derek's own hand had snuck down to Stiles' ass, his thumb brushing back and forth across the curve of Stiles' cheek.</p>\n<p>There was a long pause. Derek kept telling himself to get up<em>, Just get up and go and leave this annoying, bright, brat of a kid to keep living his teenage life without some screw-up like me messing everything up more than it already was</em>.</p>\n<p>He didn't move.</p>\n<p>“Although...” Stiles voice had taken on a slightly more calculating tone. Derek met his eyes nervously.</p>\n<p>“What.”</p>\n<p>“Deaton said that the final claim was sex under the full moon, right?”</p>\n<p>“Yes...”</p>\n<p>“So... even though we just had sex that doesn't mean the bond is sealed yet.”</p>\n<p>Derek had to flex his fingertips so they didn't dig in at the thought of having a permanent claim on this boy. “That's right.”</p>\n<p>“So in theory a few rounds of sex between now and full moon won't cause any permanent damage.”</p>\n<p>Derek stared. Stiles' pleased look started to fade into one of uncertainty. “Or we could... not?”</p>\n<p>“You need to have a shower before school,” Derek said. Stiles' face fell.</p>\n<p>“Want me to come too and blow you?” Derek finished.</p>\n<p>Stiles lit up.</p>\n<p>Maybe if Derek fucked Stiles enough he could get him out of his system and be over touching him by the moon.</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>(Anyone could tell Derek how stupid that was. Seriously, anyone.)</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>“If we can get the scent we'd be able to track them throughout town, but without that we have no way of knowing where they are or what they're doing.”</p>\n<p>Stiles tried to refocus on Peter's words.</p>\n<p>“Do we really need to worry about this? I mean, why would an Emissary alone be a threat to Derek anyway?”</p>\n<p>Stiles couldn't help it, his eyes tracked over to where Derek was on the other side of the room. He was too far away, in Stiles' opinion. Stiles had managed to get through a slightly-sore school day with only their night time (and morning-time...) activities to stave off any mate-hunger or whatever, but now that they were back in the same room Stiles was feeling rising irritation about Derek being way over on the not-beside-Stiles part of the apartment. Scott had practically frog-marched Stiles into the room when they'd arrived, one eye on Derek, and even now was hovering next to Stiles, one hand on his arm as if he might stop Stiles from launching himself across the room at Derek. Which of course was totally ridiculous, even if Derek was standing with his arms folded grouchily, showing his muscles off in the best way possible.</p>\n<p>Although, naked muscles were even better. Stiles would know.</p>\n<p>He had to bite his lip to keep from laughing hysterically.<em> I actually tapped that. I am de-virginified. I am lacking in purity. I did the horizontal tango. I am the sex machine.</em></p>\n<p>Well, maybe that last one was not actually verified. It wasn't like Derek could provide an objective opinion right now.</p>\n<p>Stiles frowned. In fact, neither of them were particularly objective. The sex was pretty amazing though, irrespective of whether he'd have initiated it on his own without the whole magic interference issue. Still, having lost his virginity to one of the hottest human beings he'd ever had the fortune of meeting was not the worst possible outcome. In fact, after the blowjob he'd received this morning, he could very happily (if non-objectively) say that it was a pretty freaking awesome outcome.</p>\n<p>Derek looked up at Stiles, his nostrils flaring.</p>\n<p>Stiles licked his lips. He wondered if Derek would mind running Stiles through some of those moves. Stiles was about 90% sure he'd like giving blowjobs. He’d maybe thought about it, once or twice… in a theoretical sense. Point being though, if he had limited-time-only access to sex in the next two weeks, he should probably look at it as an opportunity to learn a few skills so that one day when he was having real sex with people who actually wanted him then he wouldn't be such a flailing n00b.</p>\n<p>“It's just one human lady, right?” Erica said, dropping down next to Stiles on the couch and flinging one leg over his lap. “Even I could take her.”</p>\n<p>Next thing he knew, there was a snarl, Erica went tumbling over the back of the couch and Stiles found himself tightly held in Derek's embrace.</p>\n<p>“Uhh,” Stiles said.</p>\n<p>“Derek, what the hell!” Scott yelled. Erica was picking herself up off the floor, shaking her head. Derek growled low in her direction.</p>\n<p>“Woah, big guy,” Stiles said, patting Derek's chest nervously. “I think we need to dial it back by about a million, here.”</p>\n<p>Derek put a clawed hand around the back of Stiles' neck, pressing hard on the bite-mark there. “Mine,” he said.</p>\n<p>Stiles' eyes fluttered closed for a moment, before he managed to re-enable his glare. “Yes well, I think that's very well established at this point. That doesn't mean you need to go tossing people across the room,” Stiles said.</p>\n<p>“Exactly! What the hell was that? I wasn't anywhere near Princess Stilinski's ass! You can keep that all to yourself,” Erica said.</p>\n<p>Stiles grimaced. “Thanks for that, Erica.”</p>\n<p>“Derek is going to be a lot more protective of Stiles until the Moon,” Peter said, (rather unnecessarily in Stiles' view). “He's not going to want anyone touching Stiles who could interfere with the bond.”</p>\n<p>“Can we interfere? Other than keeping them separated?” Lydia asked.</p>\n<p>“None of you can. But try telling him that,” Peter said.</p>\n<p>Derek growled again, tucking Stiles in closer to his body, one hand snaking down to cover Stiles' ass.</p>\n<p>“Stiles!” Scott said, just in time to stop Stiles from sinking into that embrace.</p>\n<p>He jerked away from Derek – not that he got very far. “Right. Um, I think me and the cave-beast here need to have a little conversation. We'll be right back.”</p>\n<p>“What! I'm not leaving you alone with him, Stiles!” Scott said. “What if he...” his voice lowered to a stage whisper – as if every single person in the WHOLE ROOM couldn't still hear him. “What if he tries to kiss you or something?”</p>\n<p>Stiles couldn't help it. He laughed. “I really don't think that's gonna be an issue, buddy. I promise, we'll be right back.”</p>\n<p>Scott narrowed his eyes. “Fine. But if you're not out in two minutes I'm coming in after you.”</p>\n<p>Stiles rolled his eyes, leading Derek into the bathroom, shutting the door and turning on the sink tap so the others couldn't listen in. He only just had this done when Derek plastered himself all over Stiles' back.</p>\n<p>“I don't want them touching you,” Derek said.</p>\n<p>“Yeah thanks, I got that message. But Erica and I, hell, everyone in that room – we're just friends. No one else is getting their hands on my junk but you, okay?”</p>\n<p>“I can still smell myself in you. Just faintly but,” he pushed Stiles against the sink and tugged down his jeans to just below his ass, and shoved his face in between Stiles' cheeks.</p>\n<p>“FUCK!” Stiles cried, and he heard Scott's “Two minutes!” from the next room.</p>\n<p>Derek's breath was hot on Stiles' asshole, but he didn't make contact, just breathed. “Here. I can still smell it. Just enough to know you're mine.”</p>\n<p>“Shit,” Stiles said, and for a moment he ached so bad to have Derek's mouth on him that if Derek touched him, he might just say damn the consequences and deal with the never-ending shame of his entire friend group knowing he got banged in a bathroom by Derek Hale.</p>\n<p>“One minute, Stiles! And don't think I won't send Lydia in there!”</p>\n<p>Dammit. Okay, not worth it. He turned before he could lose his willpower and grabbed Derek by the hair, yanking him up into an open-mouthed kiss.</p>\n<p>“That's right, Hale,” he muttered into Derek’s mouth, “you've got your claim all over this ass, and you're welcome to reiterate it as required—” Derek's eyes flashed red and Stiles had to tug his hair sharply to stop him from diving back in, “—<em>later.</em> For now we are trying to have a pack meeting, and your jelly is driving the puppies, not to mention the rest of us up the wall.”</p>\n<p>“Tonight,” Derek said.</p>\n<p>“What?”</p>\n<p>“Tonight, I wanna fuck you again tonight.”</p>\n<p>Stiles' eyes fluttered closed. Okay, yeah, that was kinda sooner and...<em> more</em> than he had in mind, but now that Derek brought it up...</p>\n<p>“I wanna push you down on the bed you've had since you were a kid, I wanna put my mouth all over you, but especially on your hole. I wanna kiss it and fuck it with my tongue until you're screaming for my cock, and then I want to give it to you, and knot you and make you come again and again until you cry.”</p>\n<p>...Stiles could only whimper. Then he stumbled, scrabbling his pants back into place and shoving Derek away as Scott threw the bathroom door open. “I'm doing this for your own good, Stiles,” Scott said.</p>\n<p>Stiles had never wanted more to punch his best friend in the face.</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>(Needless to say, despite Scottervention, Derek still got what he wanted that night.)</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>The thing that’s annoying about fucking teenagers, (other than the <em>totally, completely illegal and immoral</em> part) was that teenagers had <em>parents</em>. And when you happened to be having sex with Stiles Stilinski, they also have <em>highly suspicious and clever</em> parents. Or parent, as the case may be.</p>\n<p>One was enough.</p>\n<p>“Mr Hale.”</p>\n<p>Derek felt chills crawl down his spine at the Sheriff’s sharp, bright tone from where it came from behind him in the supermarket. He tried to keep his face blank as he turned around.</p>\n<p>“Sheriff,” Derek acknowledged.</p>\n<p>“It’s nice to see you out and about,” Stilinski said, the <em>‘and not committing crimes’ </em>part was heavily implied.</p>\n<p>Derek wasn’t really sure how best to respond to that, so he just said, “Thank you, sir.”</p>\n<p>“You’ve been back in Beacon Hills for almost a year now. You must be settling in.”</p>\n<p>“I think so. It’s a change of pace, but it’s home.”</p>\n<p>“Enough time to get to know people.”</p>\n<p>Derek had a bad feeling about where this was heading. “A few.”</p>\n<p>“Seems I’ve heard your name mentioned a few times lately. By my son.”</p>\n<p>Derek gritted his teeth and tried not to imagine strangling Stiles.</p>\n<p>“Remind me, it’s been a while since I’ve seen your file,” the Sheriff paused slightly, “how old are you again, Derek?”</p>\n<p>“23, sir.”</p>\n<p>“Oh? So you’ve got a good six or seven years on most of the people in your acquaintance.”</p>\n<p>Derek coughed. He wished he could point out that he had plenty of friends his own age… in New York. “You know, sir, just trying to keep them out of trouble.”</p>\n<p>The Sheriff’s eyes narrowed. “And exactly what kind of trouble are you suggesting that my son might be in, Derek?”</p>\n<p>“When is Stiles ever not getting into some kind of trouble?” Derek hedged.</p>\n<p>The Sheriff’s mouth twitched at that. “Fair.” He looked Derek up and down, as if visually trying to sum up Derek’s level of criminality. Derek was suddenly grateful he’d pulled on a sweater with thumb-holes and ditched the leather jacket today due to the heat. “You know, son, if you’ve got an eye out for Stiles’ safety like you say you do, I’d sure like to get to know you better. Perhaps you should come over for dinner some time.”</p>\n<p>Derek honestly wasn’t sure if he’d just made things better for himself or worse.</p>\n<p>“I’m home the next few nights,” the Sheriff said, with an extremely pointed look.</p>\n<p>“I uh, I’m busy for the next week or so, Sheriff, but perhaps after that?” Derek tried. At least after then he could honestly look the guy in the eye and say, <em>‘No, I’m not fucking your son.’</em></p>\n<p>“Next week then, I’ll get Stiles to find an evening which works.”</p>\n<p>“Great…”<br>\n</p>\n<p>The Sheriff clapped him hard on the shoulder and made his way down the aisle. “Excellent talking with you, Derek.”</p>\n<p>Derek let out a breath. “Yeah, great.”</p>\n<p><em>Note to self: stay </em>out<em> of the Sheriff’s son’s bedroom at night.</em></p>\n<p>Not a mental note he’d ever thought he’d have to make.</p>\n<p> </p>\n<p>~--~</p>\n<p>(Nor was it one he had much hope of sticking to, really.)</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>Stiles had been squirming in his seat all morning. School was hard. Concentrating was hard, and he was kind of the master of dealing with difficulty concentrating, so he should know.</p>\n<p>It was only another week until the full moon, and he’d been having a hell of a lot of sex, but it had been two whole days since he'd last seen Derek. Two days since Derek had fucked him open with his mouth, before knotting him in his bed, his Dad asleep two doors down the hall. (Yes, they were both acting like stupid teenagers, but hey, magical excuses and everything, right?)</p>\n<p>Plus, turns out being knotted was like, the best thing ever. Who knew? Well okay – the internet seemed to have figured that one out… Although how they'd come up with it without the benefit of an Alpha werewolf to introduce the idea, Stiles didn't really want to know.</p>\n<p>They'd texted a few times since then. Mostly banal shit like,</p>\n<p>\n<em>Hey you have a phone, who knew.</em>\n</p>\n<p>\n<em>Apparently whoever gave you my number.</em>\n</p>\n<p>Derek hadn't even done the 'Who is this?' thing, which either meant he already had Stiles' number, or he'd just figured it out from the tone. Either option gave Stiles a weird thrill.</p>\n<p>And,</p>\n<p>\n<em>Werewolf opinion: What do you think is worse – unwashed people with 'haven't brushed my teeth in four-days' horse-breath, or people who drench themselves in deodorant?</em>\n</p>\n<p>\n<em>I'd take a horse over a chemical-dipped human any day.</em>\n</p>\n<p>\n<em>Does that mean you're into furries?</em>\n</p>\n<p>\n<em>...If anyone ever asks me about my internet-search history, I'm blaming you.</em>\n</p>\n<p>Stiles had nearly got detention from Harris for laughing at that one.</p>\n<p>\n<em>Hey, don't judge furries, I mean, how far from that is what you do to me?</em>\n</p>\n<p>\n<em>I don't wear a costume when I'm fucking you, Stiles.</em>\n</p>\n<p>\n<em>Okay sure but, what if you were in Beta form when we were together? All I'm saying is it's a fine line.</em>\n</p>\n<p>\n<em>I've never done that!</em>\n</p>\n<p>\n<em>Yeah but would you like to? How about the full Alpha shift? Does it make you hot to think of me taking your wolf-dick?</em>\n</p>\n<p>There had been a really long pause before Derek replied.</p>\n<p>\n<em>Dammit, Stiles!</em>\n</p>\n<p>Okay so maybe some of the time it wasn't mundane. Maybe sometimes it was very thinly veiled flirting (or not veiled at all), but Stiles just couldn't help it! He'd never had someone want him like Derek did. Any maybe that was because of some stupid magic gone awry, but there were moments when Stiles just couldn't resist throwing something out there and seeing how Derek would react. He'd never had a good filter at the best of times, and this was<em> hardly</em> the best of times!</p>\n<p>He shifted in his seat, stared down at his haphazard notes detailing the history of sugar, and tried not to check his phone for the ten millionth time that morning.</p>\n<p>Not that Derek was any better than him. Just yesterday Stiles had been doing his homework when Derek had derailed their texting from the trials of being a Stormtrooper into the merits of school uniforms. Needless to say there was kink material enough there that Stiles had been googling local costume stores by the end of the conversation.</p>\n<p>In light of that, he definitely knew better than to creep his hand over to his phone and tap out a quick text to Derek in the middle of class.</p>\n<p>\n<em>Apparently refined sugar revolutionized the world.</em>\n</p>\n<p>It only took a few minutes for a reply to come through.</p>\n<p>\n<em>Is that so?</em>\n</p>\n<p>\n<em>It's all in the jam, Derek. Jam sandwiches. Makes miners mine faster.</em>\n</p>\n<p>\n<em>And makes for hyperactive teenagers.</em>\n</p>\n<p>Stiles ignored that to reply with,<em> And helps to make great pie.</em> He glanced up at the clock – only ten minutes before the lunch bell.<em> Can you cook?</em></p>\n<p>Stiles rattled his pen in his free hand, intrigued. He'd already noticed that Derek shed syllables the more there was a story he didn't want to tell.</p>\n<p>\n<em>Will you make me pie?</em>\n</p>\n<p>\n<em>...What's your favorite?</em>\n</p>\n<p>Stiles blushed a little as he typed in honestly,<em> Cherry</em>.</p>\n<p>There was a delay before his phone pinged again.</p>\n<p>\n<em>Oh? You want me to make you a cherry pie Stiles? I have a great recipe.</em>\n</p>\n<p>Stiles gnawed on his bottom lip and sunk further down in his chair – grateful that his History teacher tended to lecture facing the board.</p>\n<p>He'd also noticed that Derek got more chatty when he was up to something.</p>\n<p>\n<em>Sounds delicious.</em>\n</p>\n<p>\n<em>It is. It's so good your mouth would water just at the smell. I know what you're like with sweets. You'd be gagging for it in no time.</em>\n</p>\n<p>Stiles made a strangled noise that he covered by faking a cough.</p>\n<p>\n<em>I'd probably have to sit on you to keep you from scoffing the lot and making yourself sick. I'd have to pin your hands under your body and feed it to you off a spoon. It's best with thick cream.</em>\n</p>\n<p>Stiles smacked his knee on the bottom of his desk. A couple of students glared but most of them ignored him, well-used to his flailing by now.</p>\n<p>\n<em>Hey asshole, I'm in class here!</em>\n</p>\n<p>\n<em>I'm aware.</em>\n</p>\n<p>Stiles thudded his head down onto his desk. He knew he shouldn't, he knew it was the worst of bad ideas, but he just watched in mild horror as his thumbs tapped out,<em> I get out for lunch in</em> <em>five minutes.</em></p>\n<p>It felt like an eternity before his phone lit up again...</p>\n<p>\n<em>Be in the carpark in ten.</em>\n</p>\n<p>Stiles let his breath out in a rush, his hand tightening on the phone.<em> Dammit!</em> He just had to wait ten minutes. Then he would go and talk to Derek and they would set some ground rules, something like <em>'No sexting!</em>' and <em>‘less sex in general, in fact, we’re trying not to make a habit of this!’</em></p>\n<p>He covertly adjusted his hard-on in his pants.</p>\n<p>Talk. Yes. Boundaries. He was a responsible not-quite-adult and he was in control of his dick!</p>\n<p>Eight minutes later he was in the car park, watching the Camaro slide into a spot right at the back of the lot near the tree-line, mostly hidden from the school by some jock's massive SUV.</p>\n<p>Stiles muttered to himself as he marched across the space. “Self control, Stiles! No making out! Sexting bad! Self control!”</p>\n<p>As he rounded the last row of cars the passenger door of the car popped open invitingly. Even from several meters away he somehow caught Derek's scent. It made something hot rip through his gut, but he tried his best to ignore it. He couldn't see Derek through the tinted windows but he glared towards the car for good measure. “You are a bad influence, Hale! All I was doing was talking about sugar!” he said as he swung the door open wider.</p>\n<p>A hand shot out and pulled him in, he was disorientated for a second before he realized Derek was on the passenger side, seat already pushed back and settling Stiles into his lap, reeling him in for a filthy kiss.</p>\n<p>Stiles made a startled noise which quickly changed to a happy one when Derek's tongue slipped deep into his mouth, wet and hot, while his fingers dug into Stiles' ass and ground him against his hard cock. Stiles let himself be distracted against Derek's body for a few long moments, reveling in the taste of him, wanting to drink him down, before he reluctantly tore himself away.</p>\n<p>“No. You. Bad Derek!” He shook a finger at him. “What are you doing? This does not fit with the no-sex plan!”</p>\n<p>Derek narrowed his eyes at him. “When did we have a no-sex plan?” He slipped his fingers just below Stiles' belt.</p>\n<p>Want sizzled through Stiles, and he tightened his thighs where they were bracketing Derek's hips, but he shook his head.</p>\n<p>“In a general, I’m at school and this is very illegal kind of way?” He really needed Derek to stop nuzzling under his ear, because that was doing funny things to him and Stiles really could only be so responsible when there was a mouth in one of his favorite places.</p>\n<p>“I don't care. I need to be in you.”</p>\n<p>Stiles whined and dropped his head to Derek's shoulder. His thoughts were getting kind of fuzzy, and there was a slick feeling like a hot knife sliding through butter running through him that was making him sweat. He pressed his nose into the bare skin of Derek's neck. It smelled so good. He just wanted to rub himself on Derek all day. He didn't care about anything else. He didn't really care about school, the law, or the stupid spell and what it was doing to him, Derek smelt like freshly baked bread and sweat and coffee all at once. He licked at the skin, and he felt a strange warm wetness seep out of him.</p>\n<p>Derek stiffened.</p>\n<p>“Mmm what?” Stiles asked, licking some more, quickly starting to forget why there was a reason he shouldn't be doing this.</p>\n<p>“Stiles, you're—” He sat up, shoving one hand further down Stiles' pants to press a finger against Stiles' asshole. The finger sunk in the first inch with barely any resistance, the skin there already slick.</p>\n<p>Stiles paused and managed to pull away from Derek's neck. “That's not normal.”</p>\n<p>Derek groaned and bucked up against him, his finger sinking in as deep as it could go in one smooth movement. “Fuck, Stiles, you're wet for me.” He started scrabbling at the button to Stiles' jeans.</p>\n<p>Derek's finger felt so good inside, easing an emptiness Stiles realized had been hovering on the edge of his awareness all day, it was hard to focus on the fact that he had somehow magically self-lubed his own butt. That was not the way is parts worked.</p>\n<p>“Derek, what the hell is going on?”</p>\n<p>Derek's finger was restlessly moving inside of him, even as he awkwardly dragged Stiles' jeans off – Stiles shifting for him as he waited for Derek's answer.<br>\n</p>\n<p>“Your body is changing for me. For the mating moon,” Derek said. He unzipped his own jeans and pulled his cock out. The sight of it made Stiles' mouth water but he was distracted as Derek growled and captured Stiles' lips in a fast, hungry kiss. Derek released him and withdrew his finger, moving Stiles closer on his lap. “Come here, I need to get inside.”</p>\n<p>That managed to marginally pull Stiles out of his daze. “Wait, what, we're not going to fuck here! We're in the middle of the parking lot, Derek, at<em> school</em>. Hello? We'll get arrested!”</p>\n<p>Derek just grinned at Stiles, lifting him up and positioning him over the head of his cock. “We're at the back. No one will see.”</p>\n<p>Derek's cock felt so good against Stiles' skin, and he was so wet, he just let himself sink a little, the head pushing easily past his rim, then a little more, and then it only took a moment for Stiles to slide himself down the rest of the way, sheathing Derek's cock deep inside himself.</p>\n<p>Both of them let out happy groans at the feeling. Stiles still had a vague idea that he'd been trying to stop this from happening, but whatever that was was now fully lost in the rush of need to have Derek fucking him, to have Derek's knot and his come.</p>\n<p>“Derek, I need— please just—” Stiles lost his words in a haze as he started moving on Derek's cock.</p>\n<p>Derek groaned and put his arms around Stiles, helping Stiles' move himself up and down on his length. “It's okay. I've got you Stiles,” he said, his voice hoarse, “I'm gonna fill you up with my seed. I'm gonna knot you until you can't move, until you can't breathe without feeling me pressing up inside you.”</p>\n<p>“Yes, fuck.” That was what Stiles wanted, it was all he wanted. Derek let Stiles have control of a few more thrusts before he shifted, grasping Stiles by the hips and taking his whole weight so that he could power up into Stiles while slamming him down at the same time.</p>\n<p>Each thrust felt like a punch, vibrating through every inch of Stiles' body, making him lose his mind more and more. It was like Derek was pushing everything else out of him, making room so there was nothing but Stiles and Derek inside. Nothing, not the world, not any other person, nothing but each of them, panting and clutching at each other, pressing messy open-mouthed kisses together as Derek fucked ruthlessly fast into Stiles.</p>\n<p>“Derek,” Stiles whined, and dropped his head forward, wrapping his arms around Derek's shoulders as he felt Derek start to swell. He felt so hot and dizzy and all he wanted was Derek's come. “Please, I need you.”</p>\n<p>Derek's hands tightened on Stiles' ass, his thrusts already ragged and joltingly deep. “That's right, I'm gonna come for you, you're so good for me Stiles.”</p>\n<p>Stiles let out a desperate whimper, and Derek snarled and dug his teeth into Stiles' neck below his ear, shuddering, shoving his cock up hard and coming inside Stiles, his knot quickly swelling, stretching Stiles to his limit even as he flooded Stiles' body.</p>\n<p>Stiles' whole body tightened, locking up as he helplessly ground himself on Derek's hard heat, the knot an aching pressure against his prostate, and he felt himself tip over the edge, coming against Derek's still-clothed chest with a feeling like falling weightlessly into darkness.</p>\n<p> </p>\n<p>It was some time later when Stiles blearily opened his eyes to the sound of muffled voices.</p>\n<p>“Wha—?” he croaked.</p>\n<p>“Shh,” Derek said softly. “You don't want them to hear.”</p>\n<p>That made Stiles jerk himself up, but Derek's grip around him stopped him from hurting either of them by pulling too hard on where they were still joined by their unmentionables.</p>\n<p>“Stiles!” Derek hissed.</p>\n<p>Stiles bit back a sound, but he couldn't stop the curious twist of his hips which confirmed that yes, Derek was still knotted inside of him; yes, it still felt amazing, and yes, he could still feel the strange warm wetness that meant he was full of Derek's come.</p>\n<p>Needless to say this thoughts were momentarily derailed, but then he heard the voices again and, horrified, he looked over to where two freshman girls were walking past, only a few yards from where the car was parked.</p>\n<p>He ducked down against Derek's chest. “Derek! They'll see!”</p>\n<p>Derek stroked a lazily possessive hand up and down Stiles' back. “Tinted windows, Stiles. So long as you manage to keep it down, they won't even know we're here.”</p>\n<p>Derek shifted his hips, pressing his gradually shrinking knot against Stiles' prostate. Stiles moaned softly and tucked his face in against Derek's neck.</p>\n<p>“I can't believe I let you knot me in the middle of the day, in a car,<em> while still at school,”</em> he grumbled.</p>\n<p>“Your fault.”</p>\n<p>Stiles nearly headbutted Derek he looked up so fast. “How is this in<em> any way</em> my fault?” he hissed.</p>\n<p>Derek shrugged, looking far too satisfied for someone who was<em> clearly in the wrong</em>. “You start talking about cherry pie, I won't be held accountable,” he said.</p>\n<p>“I— what— cherry<em> is</em> my favorite, Derek, I was just answering your question!”</p>\n<p>Derek lifted an eyebrow. “So you're telling me that when you wrote that, you weren't thinking about how last week you were a virgin? That it was me that popped your cherry in your childhood bed only a few nights ago?” He pushed his hips up in a slow gentle grind. “That this is the only cock that has ever been inside you?”</p>\n<p>“Okay so,” Stiles let his own hips swivel down to meet Derek's movements, “maybe the thought crossed my mind. But that's victim blaming!”</p>\n<p>Derek's smug expression faltered and he hesitated. “Do you... did you really not want—” He looked uncertain.</p>\n<p>Stiles heart clenched. He had his suspicions about the whole Kate Argent thing and he really didn't want to make this any worse for Derek when the whole magic pheromones thing wore off and he realized that he'd been trying to mate with a sixteen-year-old. He slid his thumb along Derek's cheekbone and moved his hips again. “No way dude. I was fully on board for the sex part of the ride. You didn't make me do anything.”</p>\n<p>Derek looked vastly relieved for a spare moment before he hid the expression away and shoved his hips up again. “Good.”</p>\n<p>Stiles tried to ignore the fact that he was getting hard again so that he could finish their conversation (i.e. prove himself right). “That doesn't change the fact that you were clearly the instigator, Derek, and I thought it was pretty obvious that this should be a no-instigation zone.”</p>\n<p>“Mmm,” Derek said, pulling Stiles' shirt up and doing an effortless little half-crunch so that he could mouth at Stiles' nipple. “Can't help it. Think about you all the time.” Stiles whimpered at the hot fizz of sensation, grabbing Derek's head and pressing it closer to his chest. “Think about feeding you pie and then making you suck down my cock.”</p>\n<p>Stiles shuddered, his whole body clamping down on Derek's knot.</p>\n<p>“Yeah,” Derek growled, he put a hand to Stiles' abdomen where it was usually swollen with come after they fucked. Right now it was almost flat. “You feel that?”</p>\n<p>“What?” Stiles wasn't really operating using all brain-cells. “Did you come less?”</p>\n<p>Derek shook his head, that satisfied look back in full force. “No, it went down while you slept. It wasn't leaking though. Which means your body was absorbing it.”</p>\n<p>Stiles blinked slowly. Nope, that still didn't make sense. “What,” he said, somewhere between confused, annoyed and alarmed.</p>\n<p>Derek's eyes flashed red and his nails lengthened into claws. “It means your body is changing, it's absorbing my come so it can use the magic in it to make you into my mate.”</p>\n<p>“Bodies don't do that, Derek,” Stiles said flatly.</p>\n<p>Derek quirked an eyebrow. He didn't even have to say '<em>Hello, I'm a werewolf,'</em> for Stiles to feel kind of stupid. “Okay fine, maybe they do if you have magic Alpha come, which, gross by the way – I don't want to be thinking about the absorption processes inside my butt – but that just shows that maybe we need to cut this out, Derek. If my body is already like, <em>'accepting your penis as lord'</em> or whatever, then Deaton was right and this will be irreversible by the big night.”</p>\n<p>Stiles pulled Derek up from where he had started mouthing at Stiles' collarbone, his hips still moving in a gentle grind into Stiles. “The full moon is only a week away,” Stiles said.</p>\n<p>Derek's eyes were already dark with lust, and it made Stiles' heart beat a little more rapidly. The werewolf must have heard it because his lips quirked up into a smirk. “Or it just means I need to knot you again so that you're nice and full when you go back to class.”</p>\n<p>Stiles felt himself flush with heat at the thought. Of being pinned on Derek's cock while he waited for Derek's knot to decrease, only to have to let Derek pound him until he got hard enough to lock them together again. His own cock twitched at the thought of all of his classmates sitting in inside, oblivious to Stiles getting fucked in a Camaro in the parking lot.</p>\n<p>He whimpered, “I have a free period after lunch.”</p>\n<p> </p>\n<p>Later, Stiles sent a text that read:<em> All the things I never thought I'd do in high school, sneaking into the showers so that my friends with super-senses wouldn't be able to smell all the come in my ass was not one of them.</em></p>\n<p>Derek's reply fortunately came after he was no longer in a public place:<em> I'll get you a butt-plug so that you can keep my come inside. They won't be able to smell it then.</em></p>\n<p>So all in all, it wasn't Stiles' fault that lunch-break sex became a thing. Or that even thinking about the Camaro gave him thoughts about hungry mouths and eager hands. And really, sure sitting around all day feeling Derek's come gradually sink into him was kinda weird, and probably counter-productive for the whole 'don't become werewolf-married' thing, but it eased the desperate need to be with him all the time, and it helped him concentrate on his school work, so really it was the most responsible choice.</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>(Yeah. Responsible. Having car-sex with an adult on school grounds was one of his more ‘responsible’ moments.)</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>Possibly everything would have been fine. No really, there was a real chance that their plan for <em>‘some sex then no special magic sex’</em> might have worked, but then Derek went and<em> complicated</em> things.</p>\n<p>They were lying in Derek's bed, naked. Isaac and Peter were thankfully out for the day. Stiles had discovered that he really enjoyed the whole post-sex naked times. It was a surprisingly sexy time. Like, you've had the sex, so you<em> know</em> the other person finds you hot enough to bone, and you get to lie around and luxuriate in your sweaty, sticky victorious hotness. It was good for the ego. Derek was lying with his head on Stiles' stomach, stroking the skin there.</p>\n<p>“I really don't want to know what's going through your head when you do that,” Stiles said.</p>\n<p>Derek looked up at him, his eyes were red and he had an insufferably smug look on his face. Stiles rolled his eyes. “If you start singing 'This Land is My Land,' I am going to punch you in the face.”</p>\n<p>Derek raised an eyebrow.</p>\n<p>“Okay fine,” Stiles said, “you would never do that, but I can tell that's what you're thinking.”</p>\n<p>Derek just shrugged, still looking unnecessarily pleased with himself. Stiles reached down to stroke his thumb across one of those impressive eyebrows and Derek’s eyes slipped shut.</p>\n<p>“Hey, I been meaning to ask you about this; do werewolves have permanently set territory, or does it move with you wherever you go?”</p>\n<p>Derek opened his eyes, they were back to their normal color. “It's a bit of both. Alphas can carve out new territory when they move, but it takes a long time. I guess it’s a bit like… your energy soaks into a place. In the same way – you can leave a place and it will still be your territory. It takes just as long, if not longer, for a place to lose its memory of you.”</p>\n<p>“That sounds confusing.”</p>\n<p>Derek paused, he looked kind of uncertain. “I can show you, if you want?”</p>\n<p>Stiles looked up from where he'd been tracing the curve of Derek's ear with his finger. “What? Really?”</p>\n<p>Stiles drove them both out to the Preserve, (Stiles had vetoed the Camaro – he didn't want to deal with getting a boner after just coming three times on Derek's knot that morning.<em> Three times.</em> The thing was like God's gift to the universe). Derek gave him instructions until they were deeper into the preserve than Stiles would normally go - where the open woods started to give way to solid, impenetrable forest. After that they parked and walked until they came to a line of trees that were big, healthy and thick with foliage.</p>\n<p>Derek took a deep breath. Stiles hadn't really noticed before (probably because usually when they were out here they were running for their lives) but Derek looked different here. More relaxed, like he could breathe properly.</p>\n<p>“So what are we doing? Are you going to pee on some trees? Is this going to be like a weird pack-bonding moment?”</p>\n<p>Derek looked pained. “You know Stiles, it's moments like this that make me question whether you are actually a twelve year old.”</p>\n<p>Stiles snorted. “Heh, that would make you even more of a creeper than you already are.”</p>\n<p>Derek scowled. “Do you want me to show you or not?”</p>\n<p>“No no! I do! I'm sorry, I'll shut up.”</p>\n<p>Derek's eye-roll expressed pretty clearly how much he believed that statement. “Look, just give me your hand.”</p>\n<p>Stiles did, and for a moment he could have sworn he felt Derek's fingers tremble around his, but then he was pressing Stiles' hand into the tree bark. “Now close your eyes,” Derek said.</p>\n<p>Stiles shut them, and tried not to think too hard about how close Derek was, or what sex in the woods would be like. (Sixteen! He was always thinking about it, okay?)</p>\n<p>“I want you to try and imagine your energy flowing out of you, like a thread, into me, and then back into the tree, okay?”</p>\n<p>“Is this like a yoga thing?” Stiles said.</p>\n<p>“Shut up, Stiles, and do as I say. Breathe in, let the air circle in your stomach, move back up your body, down your arm, into me, circle, then back out into the tree. Can you do that? Just focus.”</p>\n<p>Stiles tried to concentrate. This was a little like the breathing exercises he'd had to practice when he was having panic attacks. He breathed. Imagined his energy was like a golden thread, moving up and into Derek, joining a red thread and then moving into the tree.</p>\n<p>“That's good,” Derek said, his voice sounded kind of funny. “Now let the tree show you how it's energy reaches down into the earth, how it connects with the next and the next. How it's connected to the whole forest. Let it show you where the touch of the wolf spreads through the land.”</p>\n<p>And<em> fuck.</em> Stiles felt something like a kick to the gut. Like the breath got sucked out of him as his energy got pulled out into this enormous<em> web</em>, the links clicking together further and further out, the murmur of the woods as his mind moved through it like lightning. It was all connected. And through it all that red thread touched everything. The land throbbing with a gentle beat that was Derek, was Pack. The center of the town was full of whispers of energy of something<em> people-ish</em> that he could barely touch but –<em> there</em> a pop of yellow hot-heat that was Erica, and then there, Isaac, Jackson, Boyd. A rush of the familiar as he touched Scott, a slightly stronger whisper that was Allison, something strange that he thought was Lydia, even stranger when he found Peter. They were all there, the land connected to them and they connected to the land. He could even feel the edges – where the land continued on outwards but the lines defined with Alpha-red stopped. It was so<em> big</em>. Even at the outskirts of Derek's territory it was like the lines were pulsing with something, too weak to continue outwards but<em> ready</em>, eager to expand they just needed something, some—</p>\n<p>“Stiles!”</p>\n<p>Stiles opened his eyes. They weren't even touching the tree anymore. They were just standing, holding hands. “I can feel everything,” Stiles said, breathless. “I’m totally like evil!Willow right now.”</p>\n<p>Even Derek's eyes were wide. “I know. I can feel you. But you need to pull back. You need to come back in.”</p>\n<p>“Why? I think I can—”</p>\n<p>“No!” Derek's hands tightened sharply on Stiles'. “No, Stiles, you don't know how dangerous this can be, just pull back, slowly, gently. Gather your energy back into yourself. Let go of the land.”</p>\n<p>Stiles hesitated, unsure why he didn't want to pull away from that awesome web of energy.</p>\n<p>“Please Stiles, do it for me,” Derek's eyes were intense, worried. It was that fear that made Stiles start to let go, to pull back until it was just him and Derek alone in the woods. He felt like he was almost vibrating. Like he'd been hit by lightning and still had a static charge running through his whole body.</p>\n<p>“What was that?” Stiles gasped.</p>\n<p>“I'm sorry, I didn't think you would be able to sense the whole thing. I just wanted to show you the border… It's my territory.”</p>\n<p>“It's so big.”</p>\n<p>Derek nodded. “My family have been here in some form for hundreds of years. Our connection to the land has never been broken, so the territory is bigger than most. That's what I was trying to explain. Even when... Even when Laura and I went away, this was still our territory. The land still recognized Laura as the Alpha.”</p>\n<p>“And now you. Is that why you bit Erica and the others? Because you didn't want to lose the land?”</p>\n<p>Derek made a face. “Partly… When you're an Alpha, the need for a pack is almost uncontrollable. It's like a madness. That's why Peter was so obsessed with Scott. I knew I needed to establish a pack quickly, because if I couldn't find people who were willing, I'd just end up biting someone at random.”</p>\n<p>“And we all know how well that turns out.”</p>\n<p>Derek nodded. “Yeah. But it is also partly about the land. The only way to grow a territory this large is through time, a healthy pack, or through killing the Alpha it belongs to. I wanted to make sure if I died somehow, there would be others here of my pack who would inherit the land.”</p>\n<p>“Wait, killing the Alpha? Doesn't that make you kind of vulnerable? Like, some jerkoff Alpha with no territory might want to shortcut the system, so he comes in here and rips your head off and suddenly boom – he has this whole territory for himself?”</p>\n<p>Derek gave him a strange smile. “In some ways. An Alpha and their pack are much stronger on their own territory though. You'd have to be pretty desperate or pretty cocky to try and take one on on their own land.”</p>\n<p>“So basically you're saying you'd smash their face in if they tried.”</p>\n<p>“That's the idea.” Something in Derek's face was a little off. A little hopeful and sad at the same time? It was hard to tell, Derek wasn't exactly the poster-boy for 'expressive.'</p>\n<p>“Check out my Alpha mate,” Stiles said, attempting to lighten the mood. “So mighty and with great big territory. All other wolves better keep their paws clear or he'll rip their heads off.”</p>\n<p>Derek's eyes flashed. “I'll rip your head off, soon.”</p>\n<p>Stiles laughed. Around them the sounds of the woods were rich with life, and Stiles couldn't help but feel a swell of affection for this weird little town. “Why did you show me this, anyway?” he asked.</p>\n<p>Derek shrugged. “You love this sort of stuff, right? I thought you'd find it interesting.”</p>\n<p>Stiles paused. He wasn't expecting Derek's reason to be that he was being <em>thoughtful </em>and well,<em> nice.</em> “I... yeah I do. I did... Thank you.” Stiles blushed. Which was stupid because there was no good reason for Stiles to be blushing over a thoughtful gesture when Derek's dick had been in his ass only a few hours ago.</p>\n<p>“Besides,” Derek said, turning to head back for the car, “It's your pack too.”</p>\n<p>Stiles decided it was the residual forest-magic that had his heart feeling like it was being squeezed in his chest.</p>\n<p>But it was clearly, very obviously Derek's fault that everything got messed up even more.</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>(Except then Stiles made it worse.)</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>To be fair, it was complete chance that he found the photo.</p>\n<p>A few weeks before, Derek had leant Stiles some old books which apparently had been in a part of the Hale house not too damaged by the fire. Most of them were pretty obscure, (if they were even in English,) but there was one which he'd been slowly crawling through because it had some information on Pack law and diplomacy. He'd been innocently flipping the page when he'd come across a photo, which had obviously once been used as a bookmark. It was tired around the edges, a little torn and the color faded in a line across the top where at some point in its life it had poked out the top of the book.</p>\n<p>The shot wasn't particularly artistic, but it had obviously captured a moment in ordinary life. It was facing the Hale house; instead of burnt-out and collapsing, it was white and gracious. On the porch Talia Hale sat with a baby in her arms, talking with another woman. There were two children at their feet, probably around five, a boy and a girl. There was a man pushing a laughing toddler on a tyre-swing; with a start, Stiles realized the man was Peter. A girl in her mid-teens, presumably Laura, was sun-bathing on the lawn, and in the corner of the shot Derek could just be seen curled over a book under a tree. The windows of the house were open, and there was the faintest impression of movement in the kitchen.</p>\n<p>Stiles' fingers trembled as he brushed over the photo. It was like finding a sin amongst the pages. A broken dream and a long-faded memory.</p>\n<p>What he should have done was just give the photo to Derek, but instead he thought of Derek's words of the day before.<em> 'It's your pack, too.'</em> These people had been Derek's pack, and they didn't deserve to be grieved and forgotten. They deserved to be remembered.</p>\n<p>When Derek next came over, Stiles was jittery and distracted. Derek had pulled Stiles on top of him and they had been lazily making out, but Stiles' mood must have showed through because Derek pulled away with a frown. “What's up?”</p>\n<p>Stiles got up. “I um... I found something and I. Maybe it was stupid.” It was<em> totally</em> stupid. What if Derek got really upset? What if he (rightly) pointed out that his family, his grieving, was none of Stiles' business?</p>\n<p>“Stiles!”</p>\n<p>Stiles looked up from where he'd been wringing his hands. Derek made a 'give it' motion. “Whatever it is, hand it over.”</p>\n<p>Stiles bit his lip and pulled it out from under the bed. The package was large. He resigned himself to his fate and handed it to Derek.</p>\n<p>Derek carefully opened the package with a frown.<em> I bet he was one of those kids who tried to save the wrapping paper at Christmas.</em> He slowly revealed the object within.</p>\n<p>It was a plain white frame. Inside, the image had been carefully restored, enlarged and reprinted. The restorer had fixed the colors so that the photo looked like a fresh summer afternoon again, the marks of the tears were totally invisible, and the quality had been boosted to clean off the graininess.</p>\n<p>There was a long pause, and Stiles sweated nervously.<em> Ugh, this was so stupid!</em></p>\n<p>“…How?” Derek's voice was rough, interrupting Stiles’ internal panic.</p>\n<p>“I… I found it. In one of your books. It... the original photo was in pretty bad shape so I took it to a restoration place and well... there you go.” Stiles went to hand over the original, now encased in a simple glass frame, but Derek caught his wrist in a painfully tight grip. Stiles flinched, half-expecting a vicious snarl or slap of words.</p>\n<p>“Stiles.” When Stiles looked up, Derek's face was devoid of anger. He was pale but his eyes were shining with both sadness and joy. Stiles' breath caught in his throat. “This is... this is a gift. Thank you.”</p>\n<p>Derek leant over and kissed him.</p>\n<p>For a moment, Stiles was pretty sure his heart stopped.</p>\n<p>As Derek pulled away and went back to staring at the photo, Stiles had enough sense to think,<em> Shit. Everything just got much worse.</em></p>\n<p> </p>\n<p>\n<em>~--~</em>\n</p>\n<p> </p>\n<p>(There comes a point, where who is to blame is a moot point.)</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>Derek stood at his loft windows, looking over the wretched town that for some twisted cosmic reason meant ‘home’ to him.</p>\n<p>His feelings for Beacon Hills were eerily comparable to his feelings for Stiles lately, actually. Whenever he was away from Beacon Hills, he felt wrong, as if there was something on his to-do list that he’d forgotten about. A vague urgency to be elsewhere. And whenever he returned to the town… a kind of peace came over him that made all of the anger, hurt and frustration he experienced there seem somehow… worth it.</p>\n<p>Except, as it turned out, coming back to Beacon Hills had been one of the most disastrous decisions that he and Laura had ever made.</p>\n<p>He wondered if he would feel the same way about Stiles after tomorrow’s Moon.</p>\n<p>The picture Stiles had given him caught the corner of his vision, mounted on the wall now next to various pictures the group of teens had taken in the last year… Stiles and Scott shoving popcorn down each others’ shirts at the movies; Jackson scowling while Lydia and Erica painted his toenails (his ‘<em>sorry I tried to kill you a bunch of times</em>’ penance); Isaac, Erica and Boyd smiling at the camera - dressed as Storm Troopers for Halloween, and several other colourful moments in the life of their ragtag little group.</p>\n<p>Derek sighed. Even though coming back to Beacon Hills had been a fatal ending for Laura, Derek couldn’t deny that coming back had meant he had gained something which he hadn’t really had for years — a Pack. He wandered over and thumbed the edge of one the prints. He’d framed each of them in a large white box-frame. Stiles had laughed at him at the time and called him out on being deliberately pretentious. Derek smiled, he had to admit Stiles got his sense of humor more often than the others. More often than anyone, really.</p>\n<p>Stiles had also framed the picture of Derek’s family in the exact same style. Somehow he also seemed to understand that that for all of Derek’s poking fun, he also liked to give these moments in time the respect they deserved.</p>\n<p>Derek scowled and picked up his phone, he’d planned to avoid Stiles tonight, just to be safe. He really had.</p>\n<p>But if his life had taught him anything, it was that sometimes you had to grasp the good moments while you had the chance. They didn’t tend to last.</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>How do you spend your last day of happiness?</p>\n<p>(Okay, maybe that was kind of melodramatic, even for him, but the emotions he was experiencing were pretty melodramatic all on their own, so he was allowing himself a little leeway.)</p>\n<p>One thing was for sure, tomorrow was going to require a lot of ice cream. Stiles glared at the selection in the supermarket, as if it was the ice cream's fault that tomorrow was the full moon and Stiles was going to get his heart broken into a thousand pieces.</p>\n<p>Stupid heart.</p>\n<p>His phone buzzed and he took it out to read a text from Derek,<em> Is your Dad home tonight?</em></p>\n<p>He really should just tell Derek to stay away. But this was his last night to spend with him. And maybe it felt a little more like taking advantage now that Stiles was pretty sure he was at least 60 percent in love with the guy, but Stiles' feelings weren't going to change the outcome of this particular shitstorm in any way, so he was damn well going to take the last chance he had to feel like there was a universe where he could actually get what he wanted for a change.</p>\n<p>\n<em>Not until late. You should come over.</em>\n</p>\n<p>\n<em>Be there at seven.</em>\n</p>\n<p>“A boy as cute as you should not be frowning over a text like that on a Saturday afternoon.”</p>\n<p>Stiles started, he hadn't even noticed the woman standing next to him in front of the freezers.</p>\n<p>She laughed. “Sorry, was that kind of creepy? I don't mean to be a nosy supermarket text-reader, I just noticed you looked pretty down.”</p>\n<p>She was gorgeous, totally the type of girl Stiles would normally be panting after, if a little too old for him. Long golden-red hair trailing down her back, bright eyes and glossy lips. It was totally pathetic that Stiles was so gone for Derek that he didn't even feel a twinge, looking at her.</p>\n<p>“Yeah well, someone's got to keep the pity-party food industry in business, right?”</p>\n<p>“Boyfriend not treating you right?”</p>\n<p>Stiles snorted. “I am not his boyfriend.”</p>\n<p>The woman tipped her head to the side, the lights making her eyes glint. “What are you then?”</p>\n<p>Stiles laughed, the sound scraping at his nerves. He gave up on choosing a flavor and just grabbed something at random. “I'm not his anything.”</p>\n<p>The woman's eyes followed him as he left, but he was too wrapped up in his own misery to care how rude he was being. He had a few hours to get his emotions under control before he had to face Derek, and he wasn't going to waste them on mooning in the supermarket. He was a strong-willed dude and he was going to keep his shit together, damn it!</p>\n<p>...By the time Derek was slipping in his open window, he was less sure.</p>\n<p>“Hey,” Derek said, hovering near the window, as if he hadn't spent half of the last two weeks in Stiles' bed.</p>\n<p>Stiles fiddled with the corner of his laptop. “So... last night of magical sex huh? Literally<em> and</em> figuratively.”</p>\n<p>Derek's frown only deepened.</p>\n<p>“What are you and the pack going to do tomorrow night?”</p>\n<p>“Just a run through the Preserve. Don't leave the house.”</p>\n<p>Stiles rolled his eyes. “Yeah, I got the memo, thanks. You don't need to worry about me ruining your special wolfy times with my mate pheromones or whatever.”</p>\n<p>“Stiles—”</p>\n<p>“No, you know what? This is my last chance to have amazing sex with you before neither of us even wants it any more, so enough talking.” Stiles' heart was pounding, so he tossed aside his laptop, grabbed Derek by the shirt and pulled him into a kiss before he could figure out what part of that sentence was a lie.</p>\n<p>Derek made a muffled noise of surprise, but he lined up his mouth with Stiles' readily enough and let himself be pulled back onto the bed. Once there though, he firmly refused to let Stiles' plan of balls-to-the-wall fucking take place, as he infuriatingly slowed their kisses, tenderly stroked his hands up Stiles' body to remove their clothes, and started kissing his way down Stiles' body, as if he was trying to commit every part of Stiles' skin to memory.</p>\n<p>“This isn't exactly what I had planned here, dude,” Stiles said, trying not to buck upwards as Derek mouthed along his hipbone.</p>\n<p>“Too bad,” Derek said, looking up at Stiles, a strange look in his eyes. “I'm gonna fuck you however I like, and you're going to love it.” With that he slipped his mouth all the way down over Stiles' cock.</p>\n<p>Stiles let out a strangled cry and shoved his fist into his mouth, but even the blowjob Derek slowed down to a crawl, slowly pulling off Stiles' cock and switching to slow, wet licks and the occasional suckle on the head of Stiles' dick. Every time Stiles started to think of bitching Derek out for it, he would do something filthy and amazing like sucking Stiles' balls into his mouth, or ducking down to lick a long stripe over Stiles' asshole. By the time Derek moved back up to Stiles' face, Stiles was leaking everywhere, from both his dick and his hole, crying, aching for Derek to fill him up.</p>\n<p>“Shh,” Derek said, catching Stiles' lips into a kiss, swallowing up his hitching sobs. (So much for toughing out this whole experience. At least Stiles could say with certainty that this was most definitely Derek's fault.) “I've got you,” Derek murmured as he lined himself up and pushed his cock inside.</p>\n<p>Stiles cried out, and it brought Derek's mouth back to his.</p>\n<p>They'd never fucked like this, face to face and intimate in the dark, the near-full moon their only light.</p>\n<p>“I hate you,” Stiles said, wrapping his legs around Derek and pulling him deeper into a kiss, uncaring of his heartbeat revealing the lie.</p>\n<p>Derek just made a low sound and started pumping his hips, slow and smooth, his length driving into Stiles over and over, splitting and filling him at once.</p>\n<p>Stiles was absurdly grateful for Derek's mouth on his, wet and slick and hungry, keeping Stiles from blurting out stupid things like,<em> 'Don't leave me'</em> or<em> 'I need you'</em> or something even worse.</p>\n<p>It didn’t take long for Stiles to be climbing towards the edge of orgasm. His body still craved Derek’s touch, even when his heart was a huge mess.</p>\n<p>“Fuck. Stiles— you—” Derek groaned and shoved in hard, his knot pressing past Stiles’ rim and swelling up rapidly. Stiles held tight to Derek and trembled, the pressure ramping up and up until it had him falling into his own orgasm, spilling between their bodies pressed close.</p>\n<p>They both lay there in silence, panting into each other’s skin. Derek pulled Stiles in close and then rolled them so that Stiles was splayed across Derek’s chest. Stiles whimpered, the knot tugging at him.</p>\n<p>“Okay?” Derek asked, his voice soft.</p>\n<p>“Yeah,” Stiles said, burying his face in the curve of Derek’s neck.</p>\n<p>They didn’t say any more. The soft sounds of the street filtered in the window, gentle rustles of trees and the occasional hum of a passing car. Derek’s scent filled Stiles’ lungs. He just wanted to bury himself in it and never move.</p>\n<p>Unlike usual, Stiles didn’t fall asleep on Derek’s knot, and it was long minutes of silence before it started to shrink. Stiles bit his lip and pulled off gently. Derek made a small noise of protest, his hands making an aborted move towards Stiles.</p>\n<p>“Not that I ever thought I would be kicking a hot piece of ass like yours out of my bed, but you should probably go,” Stiles said, in a half-hearted attempt to lighten the heavy atmosphere.</p>\n<p>Derek rolled out of the bed, pulling on his jeans without even cleaning himself up. Stiles winced. At the window, Derek turned back, frowning. “I want to keep you,” he said.</p>\n<p>Stiles felt like something froze inside him, then snapped into a million pieces. He turned away. “No, you don’t.”</p>\n<p>After a pause, Stiles heard the shuffle and thud of Derek leaving. He drew in a shaky breath and dragged himself out of the bed and into the shower, grateful for the water which masked his totally-not-even-falling tears. He felt old, like his bones had aged inside his body.</p>\n<p>A few hours later his Dad knocked on his bedroom door gently and came in. “Saw your light on. What are you still doing up, kiddo?”</p>\n<p>Stiles clutched his pillow tighter to his chest. “Couldn’t sleep.”</p>\n<p>The Sheriff came over and sat next to Stiles on the bed, rubbing a hand down Stiles’ spine. “What’s got you all twisted up? Is this a Lydia thing?”</p>\n<p>Stiles laughed. “No, not Lydia.”</p>\n<p>“…Some other girl?”</p>\n<p>Stiles huffed out a breath. “Some other boy.”</p>\n<p>The Sheriff paused. “…Oh?”</p>\n<p>“Oh,” said Stiles stubbornly.</p>\n<p>“And you and this boy…?”</p>\n<p>Stiles dug his thumb into the ridges of his bedspread. “We hooked up. It wasn’t an emotions thing. It’s over now.”</p>\n<p>“Did you want it to be an emotions thing?”</p>\n<p>Stiles fisted his hand in the bed sheets. “Not at first.”</p>\n<p>“And now?”</p>\n<p>Now Stiles had just spent the last few hours trying not to cry into his pillow over an emotionally stunted, too-old alpha werewolf who almost became his husband because of an ill-chosen floral arrangement. 'Now' was an all-around shitty place to be.</p>\n<p>After a few moments of no response from Stiles, his dad patted his shoulder. “I’ll tell you what, Stiles. In my experience, there’s no such thing as ‘no emotions’ in a relationship, no matter how brief. Two people don’t always want the same thing, but there are always emotions involved and you should never be ashamed of your feelings. If you like this guy, you should let him know. If he’s not interested then that’s his decision, but don’t keep things bottled up. You might be surprised what you find if you talk something out.”</p>\n<p>Stiles tucked his hand around his dad's and squeezed it tight. “Thanks, Dad.”</p>\n<p>“That’s okay kiddo.” He got up. “Now get some sleep. Just because it’s the weekend doesn’t mean you should become completely nocturnal.”</p>\n<p>“Okay.”</p>\n<p>As his dad headed for the door, he paused. “And if this ‘boy’ just happens to be called Derek Hale, you let him know that he and I need to have a serious conversation about this strange thing called the ‘Age of Consent.’”</p>\n<p>Stiles groaned and pulled his pillow over his head. “Sleeping now!”</p>\n<p>The Sheriff huffed and flicked out the light.</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>It was D-day. Full moon night. Evening of the un-bonding. Day of shit.</p>\n<p>Stiles glared at the book he was attempting to use as a distraction method. It was doing a poor job and should probably re-think its career choices as a tool of attention-grabbing.</p>\n<p>Okay so, it wasn't fair to blame the book. Even he could acknowledge that. Stiles placed it down and slumped until his chin was resting next to it on the desk-top. This day could go die in fire, as far as he was concerned. (Although he wasn't sure if he was actually allowed to use that phrase considering the people of his acquaintance. Even when it was just in his own head. Probably for the best that this mate-bond thing didn't come with a side of telepathy. Derek would likely have ended up even more traumatized than he already was.)</p>\n<p>Stiles couldn't help but hope that come moonrise, or moon set, or whenever it was that the mate-bond would break, that it would turn out the whole gone-on-Derek thing he was dealing with right now would totally end up being gone-on-Derek's-dick, not gone on his stupid little smirk, or the way he would fold his arms and<em> radiate</em> smugness, or the way he fiercely protected his Pack – even when it was blindingly obvious he had no idea what he was doing. He hoped that he would instantly stop thinking it was adorable that Derek wanted himself and Scott to be wolf-brothers or whatever. That he totally freaked whenever Erica had a seizure. That he carefully wrote in Isaac's birthday and school dates on their calendar so that he wouldn't forget something important. That he couldn't bring himself to throw Peter out of his pack – even though the dude was<em> clearly evil</em> – because he was the last thing he had left of his family. Stiles was really hoping that all of those things would just stop being important to him.</p>\n<p>...He didn't really believe though that fate would be that kind.</p>\n<p>His best case scenario right now was that once his body had stopped clamoring for a near-constant Derek-dicking (and really, it was kind of out of control; every cell in his body seemed to be reminding him – loudly – that the only place he should be tonight was on his mate's cock), that somehow he'd be able to turn all of that love-shit around into mostly-platonic-love, and he and Derek might be able to salvage some kind of friendship out of this mess.</p>\n<p>He sighed and pulled himself back up in his chair, attempting to re-focus on the chapter on Emissaries which probably would have been fascinating under other circumstances.</p>\n<p>\n<em>The Emissary serves as a link. A link between humanity and the wolf, between magic and the mundane, and between a pack and their land. Without the Emissary to enable the energy to flow between these things, the link is unstable, fragile. An Alpha may stand watch over a mighty territory, but without the Emissary to ground them, they cannot call upon the land to protect them in turn.</em>\n</p>\n<p>Stiles stopped, frowning. Didn't that mean that what Derek had said the other day, about another Alpha not being able to take him on in his own territory... didn't apply? If he couldn't call on the land, then wasn't he vulnerable?</p>\n<p>\n<em>In turn, there are times when the Emissary can act not as a channel through which to allow power to flow into a pack, but as a conduit for the power of a pack to move outwards. When a pack is at its peak, it can send its power to the Emissary to stand on its behalf. The act is rare, as an Emissary still bears the vulnerability of humanity; however humanity itself can be a weapon when used in tandem with certain tools against a wolf.</em>\n</p>\n<p>Stiles' stopped. His breath caught in his throat. Something… something about that was <em>wrong</em>, something about that was setting off alarm bells all through his mind. He ran his fingers across the page. 'Certain tools' was obviously short-hand for things such as wolfsbane and mountain ash. And the<em> 'power of the pack to move outwards...</em>' did that mean the Emissary would themselves have the power of a whole pack? He bit his lip, looking out into the moonlit night.<em> Shit.</em> It struck him. When else was a pack at its peak but on the full moon?</p>\n<p>He looked down to the text.</p>\n<p>\n<em>In these times the only thing which can assure another pack protection, is their own Emissary.</em>\n</p>\n<p>He dropped the book with a frustrated cry. Derek didn't<em> have</em> an Emissary. And now it was the full moon and they<em> knew</em> they had a foreign pack's representative loose in the town. What if they figured out Derek was vulnerable and used this weird pack-channelling thing to hurt him?</p>\n<p>What if they killed him?</p>\n<p>Stiles pushed away from his desk, pacing agitatedly. How could Derek be so<em> stupid</em> as to go without an Emissary when it made him this open to attack? Maybe there wasn't an Emissary hotline or anything, but surely he could have been doing something to try and get one!</p>\n<p>As he paced, memories suddenly started flitting through his mind.</p>\n<p>\n<em>“If Deaton's not your Emissary, then who is?”</em>\n</p>\n<p>Derek hadn't replied, but the look on his face was both sad and a little hopeful.</p>\n<p>Derek teaching Stiles how to see his territory... how to link with the land.<em> “Why did you show me this?”</em></p>\n<p>\n<em>“It's your pack, too.”</em>\n</p>\n<p>Deaton teaching him about the properties of the flora and fauna of the forest. About how to draw a mountain ash line and how to pull wolfsbane poisoning from a wound. Derek giving him books which taught about the ancient magic belonging to werewolves. Not Lydia or Allison, not even Scott.</p>\n<p>“It's me.”</p>\n<p>The words felt like anvils, spilling out of his mouth and crashing to the floor.</p>\n<p><em>Fuck</em>, it was so obvious when he thought about it. Of course he was Derek's Emissary. Or at least he was heading in that direction.</p>\n<p>If he hadn't had the chance to get to know Derek better in the last few weeks, he would probably have thought Derek was trying to manipulate Stiles by not telling him about it, but in reality, he probably just thought Stiles had enough to deal with at the moment. He was giving Stiles the time to decide for himself if that was something he wanted.</p>\n<p>...And now he was out there, alone in the woods with no one to protect him from a potentially rogue super-killer-Emissary.</p>\n<p>Stiles was halfway to the door when the rest of his brain kicked in and he remembered that oh hey – there actually was a good reason that Stiles wasn't out with the pack tonight.</p>\n<p>He chewed on a nail, eyeing the door. Choices choices.</p>\n<p>“Maybe he doesn't even need my help,” Stiles said hopefully. “Maybe that Emissary just wafted in and out of town and I'm making a big deal out of nothing.”</p>\n<p>But it didn't feel like nothing...</p>\n<p>Another memory surfaced, quick like a fish in a river, but it was enough to make Stiles go cold.</p>\n<p>\n<em>“So who is this guy? You his boyfriend?”</em>\n</p>\n<p>A quick, bitter laugh.<em> “Derek? I'm not his anything.”</em></p>\n<p>A keen glitter of something in a stranger's eye. Something hungry.</p>\n<p>Holy hell in a handbasket. Stiles was a fucking idiot.</p>\n<p>He grabbed his phone, his jacket, and he was out the door.</p>\n<p>Maybe going out there meant that he would end up permanently attached to a werewolf, but if he didn't go, Stiles was about 99.9% sure Derek would end up permanently dead.</p>\n<p>He just hoped that for Derek, the latter was the worse of the two options.</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>Derek felt like a beast. Becoming an Alpha had changed him, made him harder, angrier, hornier, less forgiving of challenge, desperate for a healthy pack, for a defensible territory. All of that had been hard to adjust to, but until he’d had a mate he hadn’t felt the full effect of just how<em> different</em> being an Alpha could be.</p>\n<p>He breathed out heavily between his fangs. His betas were drifting just out of reach... as if they knew he was on the verge of lashing out at anything that moved. He was just grateful they’d all got their shift under control, because tonight, he sure didn’t. His skin prickled, his eyes flashed, he felt like his bones were aching to expand, and every single atom of his body was screaming at him to go to Stiles.</p>\n<p>He dug his toes into the earth, let the feel of it sink outwards. He wouldn’t go. He wouldn’t rape a teenager, no matter how much Stiles begged for it, he hadn’t chosen it. He wouldn’t go to him. He would stay in the woods where he and his kind belonged. Leave the human safe in his house of wood and stone, in his own forest of asphalt and electricity. The press of people on all sides and no room to breathe. He would leave him. And by the time the Moon set, he would have no mate.</p>\n<p>“No wonder this place is like the Hilton of territories. These woods are massive. Lucky for me you people leave a trail a mile wide.”</p>\n<p>Derek snarled, his Pack echoing as he whirled on the invader who had somehow managed to silently, scentlessly approach them. It was a woman, long golden-red hair, hip-cocked and an unpleasant smirk.</p>\n<p>“Who?” Derek demanded, his claws lengthening.</p>\n<p>The woman took her hands out of her pockets. Each one was covered in a glove-like arrangement of silver, giving her human hands long, metal claws tipped with dark wood. Derek’s stomach twisted. He’d seen these before. Only a picture, Rowan-tipped silver claws. They were the mark of—</p>\n<p>“The Emissary of the Reykjavik Pack. And you…<em> boy</em>, are a little baby Alpha, all Mommy’s territory, and no Emissary to help you defend it.”</p>\n<p>Erica snarled, but a sign from Derek held her back. The others were only seeing one woman, but Derek knew better than to jump in to this fight. Those claws had been buried in many were’s chests. He bit down on his urge to roar his defiance into the woman’s face, and asked, “What do you want?”</p>\n<p>She smiled, big and wide. “What does any wolf want, Derek? Territory. And right now, my eye is on yours.”</p>\n<p>“You’re no wolf.”</p>\n<p>“No, but my master is, and he likes the sound of a Californian base. Not too far from the beach, plenty of city life close by. You know how it is.”</p>\n<p>“This land has been in my family for generations,” Derek growled.</p>\n<p>“Yes well, your family is dead, Derek.”</p>\n<p>Derek sucked in a long breath, and managed not to try to tear the woman’s eyes out.</p>\n<p>“So what exactly do you think you’re going to do?” he asked.</p>\n<p>“I’m going to kill you all.”</p>\n<p>This time the whole Pack growled, and he felt them gather up close behind him.</p>\n<p>“On my land? Your Pack might be strong, but you would be an idiot to try.”</p>\n<p>“Your land? Without an Emissary you can barely call it that.”</p>\n<p>Derek hid his flinch, and thought of the happy smiling boy, far away in his home. He hoped it wouldn’t break him to lose all of his friends in one fell swoop. He hoped even more that there was some chance this woman didn’t hold her Pack’s ability to tell a lie.</p>\n<p>“Who says we don’t have an Emissary?”</p>\n<p>The woman laughed. “Oh? Then where are they?”</p>\n<p>“Right. Here.”</p>\n<p>Derek felt his whole body turn to ice. His brain was clearly playing tricks on him. Why the hell would Stiles be here when this was the last place on earth he would want to be tonight?</p>\n<p>And yet there he was, standing out of breath and angry on the edge of the clearing.</p>\n<p>Derek could feel the ragged edge of the mating bond pulling at him. It was like having someone shouting constantly in one ear. Only his fear for his pack kept the urge anywhere close to controllable.</p>\n<p>“You? You said it yourself, Derek's nothing to you.”</p>\n<p>Derek felt like someone had shoved a knife into his heart. Of course, there was no good reason to be disappointed. It's not like Stiles should feel any different.</p>\n<p>“I<em> said</em> Derek wasn't my boyfriend. What you choose to infer from that is your problem, lady.”</p>\n<p>“What is he then? A friend of a friend? A booty call? You can't be an Emissary with a pathetic claim like that.”</p>\n<p>Stiles' eyes flashed with anger and he snarled. “No. Derek is<em> mine</em>. This Pack and this land is mine. And if you think you can lay a<em> finger</em> on <em>my </em>Alpha on<em> my</em> territory, you have not done enough research on exactly what the Hale Pack is capable of.”</p>\n<p>Then it was as if Stiles reached down into the earth, and the whole forest lit up with power. The rest of the Pack let out howls as the link between human, wolf and land was forged, leaping from one wolf to the next until Stiles' power hit Derek like a freight train. He was strong. Strong and fierce and he felt like gold and laughter and fresh Spring growth. Derek had to struggle not to just give in to the sensation and revel in the joy of the Pack and the land finally connecting as one.</p>\n<p>The Reykjavik Emissary hissed in anger, flexing her claws and taking a step towards Derek. “You're all just<em> children</em>. You have no idea what it means to be a true Wolf Pack. You have no idea what real power is.”</p>\n<p>Derek braced himself, but Stiles' voice was cold at his shoulder. Derek hadn't even seen him move. “If you touch him. I will rip you to pieces.”</p>\n<p>The woman hesitated. She was still close enough that one swipe of her claws could tear out Derek's throat. Right now Derek was pretty sure he would win if she tried, but that wasn't how things were done.</p>\n<p>Stiles spoke again, his words heavy and bore an echo that sounded like the voices of those that had come before. “I am the Emissary of the Hale pack, and I banish you from this territory.”</p>\n<p>Derek closed his eyes, a smile spreading across his face. He'd never been more proud.</p>\n<p>When he opened his eyes the woman's skin was smoking, a look of horror spreading over her face. She turned and started to run.</p>\n<p>Derek waved to his pack. “Make sure she doesn't stop until she's off our land.” The other wolves burst after her, yipping and snarling at her heels.</p>\n<p>There was a long moment of silence where Derek reveled in finally having a properly functional pack, then Stiles let out a burst of air. “I can't believe that actually worked.”</p>\n<p>Derek snorted. Typical. “You didn't know it would?”</p>\n<p>“Dude I had no freaking clue what I was doing. I only figured out I was supposed to be your Emissary like, five minutes ago.”</p>\n<p>Derek laughed. This was his life now. Surrounded by teenagers who for all their genius, were still just teenagers.</p>\n<p>It was only then, as he sucked in a relieved gasp of air, that Stiles’ scent hit him like a bullet.</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>Stiles saw it the second the bond-call hit Derek. His pupils expanded and he took a half-step towards Stiles before he stopped himself. Stiles felt a rush of want fill him life fire. He wanted Derek in him <em>now</em>.</p>\n<p>“I'm sorry,” Derek said, “I can't control it. Not when...\"</p>\n<p>\"Don't be. Sorry, I mean. It's my fault.\"</p>\n<p>\"No—\"</p>\n<p>\"I couldn't let her kill you.\"</p>\n<p>\"—I already wanted you.\"</p>\n<p>\"What?\"</p>\n<p>\"Before.\" Derek's gaze was heavy, and it was clear he was fighting back his wolf. \"I'd thought about it—\" his eyes flashed and he looked away, getting himself under control before he said, \"You're just so young.\"</p>\n<p>Stiles had to fight back the instinctual <em>'not THAT young</em>', even he knew it wasn't really appropriate when talking about life commitments to werewolves nearly 10 years older than him.</p>\n<p>\"And by 'thought about it' you mean...?\"</p>\n<p>Derek snarls. \"Holding you down and fucking you until you cried?\" He passed a hand over his eyes, sighing. \"And also just... Being together.\"</p>\n<p>Stiles let out a slightly hysterical laugh. \"Don't lie, you were dreaming about holding hands and long walks on the beach, weren't you. You just want to snuggle on the couch and pick out matching dinnerware.\"</p>\n<p>\"I said I'd thought about it, Stiles, not that I was pining into my pillow every night.\"</p>\n<p>\"I hadn't,\" Stiles said, the words popping out before he could think.</p>\n<p>Something flashed across Derek's face, and he clenched his fists.</p>\n<p>\"I hadn't even thought about guys really... before.\"</p>\n<p>Derek's voice was ragged. \"I don't think I can let you run.\"</p>\n<p>\"No I... I don't want to.\" He laughed. \"I couldn't even if I did.\" His knees were trembling and his whole body was overheated, begging to be taken. \"I mean, I think I wanted it, I just hadn't actually thought about it.\" He meets Derek's gaze. \"I liked being with you. A lot. I was always coming up with excuses to see you.\"</p>\n<p>\"I know.\"</p>\n<p>Stiles closed his eyes, breathed in the sound of the forest. He knew this was a bad idea, but he didn't regret coming out tonight, he didn't regret the last two weeks spent in Derek's arms, and he sure as hell didn't regret that of anyone, it was Derek.</p>\n<p>The last of his control snapped.</p>\n<p>\"Derek?\"</p>\n<p>\"Stiles?\"</p>\n<p>He opens his eyes. \"Claim me. If you can,\" and then he turned and ran.</p>\n<p>He could hear the roar of his Alpha behind him, but for once in his life he was fleet and sure-footed. He had claimed the land tonight just as much as Derek was about to claim him. The forest seemed to light up for him, footholds as easy to find as breathing, sparking energy flowing through him, air filling his lungs with silk as he nimbly slid between the trees.</p>\n<p>There was a crash of a furious werewolf close behind him, and Stiles laughed for the sheer fear and thrill of it. He shrugged off his hoodie even as he ran and tossed it as hard as he could off to the side, darting in the opposite direction. It only took a few moments before a seething howl went up into the night. Stiles’ t-shirt, his belt, his pants and then finally his underwear went in the same way, only serving to aggravate the wolf behind him further.</p>\n<p>“If you can’t catch me you can’t have me, Derek!” Stiles yelled out, half-wild.</p>\n<p>There was a moment’s silence where Stiles tried to figure out from which direction Derek was following, when suddenly vice-like arms wrapped around Stiles’ body, and a fanged mouth whispered in his ear, “You can’t escape me in my own woods, Stiles.” Derek’s tongue ran up the shell of Stiles’ ear, “Especially when you’re not actually trying to get away.”</p>\n<p>Stiles arched back into the wolf, feeling that Derek had shed his own clothes much the same as Stiles, his cock rode up hard and thick between Stiles’ buttcheeks.</p>\n<p>“Who do you belong to, Stiles?”</p>\n<p>There was only one possible answer. “You.”</p>\n<p>Derek roared, the sound reverberating through the woods before he sunk his teeth deep into Stiles’ neck, at the same time his cock driving forward and, aided by the slick which was dripping from Stiles’ hole, drove deep within Stiles’ body.</p>\n<p>Stiles screamed, but it was a scream of sensation overload rather than pain. Every nerve in his body burned. Derek shoved them both to the ground, somehow staying buried in Stiles as he did so, teeth and cock, quickly beginning a punishing rhythm which sent a flash of vicious heat through Stiles with every inward stroke. He felt like he was dying from how good it was. He never wanted it to end but he might explode if it wasn’t over soon. Again and again Derek drove into his body, their skin slicking with sweat and their bodies heating up beneath the piercing light of the full moon. Stiles felt owned, every single part of his body belonged to Derek and he <em>loved it</em>. Their bodies were making wet, meaty sounds as Derek pounded in and in and in and Stiles was coming apart, he was going to shatter but it was okay because Derek had him, Derek was holding him down and he was—</p>\n<p>“DEREK!”</p>\n<p> </p>\n<p>When Stiles came back to earth, it was like each piece started from where Derek’s mouth was connected to him and worked its way outward. Like Stiles was being re-made, somewhere in between Derek’s teeth and his cock - buried deep and knotted in hard. Derek was making soft little whimpers as his cock pulsed heavily inside Stiles, his tips twitching gently as he emptied himself into the body of his mate.</p>\n<p>Stiles groaned. “I may never move again.”</p>\n<p>Derek huffed grouchily and slowly extracted his teeth, licking carefully at the wound. It said a lot for the magic of endorphins that that didn’t even hurt at all.</p>\n<p>“I have this sudden vision that my future is going to involve a lot of turtlenecks…”</p>\n<p>There was a snort behind him, and Derek spoke, his voice hoarse, “You really do know how to ruin every moment, don’t you.”</p>\n<p>“Oh I’m sorry,” Stiles squirmed, trying to find an angle that didn’t have Derek’s cock pushing right up against that spot that said <em>sexsexeverythingissex</em>. “Were you having a moment? Thinking about binding your boy under the light of the Mother Moon?”</p>\n<p>Derek growled and shoved his cock back in hard against that spot. Stiles yelped and went limp. “Exactly,” Derek said.</p>\n<p>Stiles felt a hand close around his, and he opened his eyes to meet Derek’s, twisted so that his face was next to Stiles’. “Stiles… I know you didn’t ask for this but… for what it’s worth… I love you.”</p>\n<p>Stiles smiled and shut his eyes again, pulling the hand up against his chest. “Right back ‘atcha, big guy.”</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Later:</p>\n<p>“For the record, you are the one going back to find our clothes.”</p>\n<p>“Me? It was your idea to toss them though an entire forest!”</p>\n<p>“I blame the moon magic. It seemed like a good idea at the time. Besides, I’m the one getting a metric-tonne of come pumped into his ass, so I don’t have to go looking for stuff.”</p>\n<p>“You’re not going to be able to use that excuse to get out of everything from now on.”</p>\n<p>“Yeah? Try me.”</p>\n<p>“Besides, you’re my mate now. What do you need clothes for anyway?”</p>\n<p>“...The fact that you think that’s an acceptable response says so much about you.”</p>\n<p>And okay, maybe this wasn’t going to be a fate worse than death after all.</p>\n<p> </p>\n<p>~--~</p>\n<p> </p>\n<p>(It really wasn’t.)</p>\n<p> </p>\n<p> </p>\n<p>END.</p>\n<p><br>\n</p>\n<p>People should come hang out with me on my tumblrrr if you be in the mood for some overly-enthusiastic yelling, butts, kittens and Sailor Moon. <a href=\"https://prairie-grass.tumblr.com/\" rel=\"nofollow\">Prairie_Grass</a> </p>"
}