{
  "id": "1797448",
  "url": "https://archiveofourown.org/works/1797448?view_full_work=true",
  "author": [
    "triedunture"
  ],
  "title": "Good Boy",
  "rating": "Explicit",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Captain America (Movies)",
    "Marvel Cinematic Universe"
  ],
  "relationships": [
    "James \"Bucky\" Barnes/Steve Rogers"
  ],
  "characters": [
    "James \"Bucky\" Barnes",
    "Steve Rogers",
    "Sam Wilson (Marvel)",
    "Tony Stark",
    "Pepper Potts"
  ],
  "additional_tags": [
    "Collars",
    "Dom/sub Play",
    "Multiple Orgasms",
    "Exhibitionism",
    "Body Worship",
    "Master/Pet",
    "Petplay",
    "Hair-pulling",
    "Hair Kink",
    "Bathing/Washing",
    "Praise Kink",
    "Kink Negotiation"
  ],
  "language": "English",
  "series": "",
  "published": "2014-06-16",
  "completed": null,
  "words": "13,473",
  "chapters": "1/1",
  "comments": "375",
  "kudos": "17,546",
  "bookmarks": "3,791",
  "hits": "282,137",
  "summary": "<p>Bucky is still adjusting to life with the Avengers, and Steve is willing to do whatever it takes to make him feel comfortable. Increasingly, though, what seems to make him comfortable is strangely intimate.</p>\n<p>Surprise, Steve! You're a gentle dom and Bucky wants to be your pretty pet!</p>",
  "notes": "<p>Thanks to <a href=\"https://bewaretheides315.tumblr.com/\" rel=\"nofollow\">BTI</a> for fixing my writing. Thanks to <a href=\"https://brokentoyinlalaland.tumblr.com/\" rel=\"nofollow\">brokentoy</a> for ruining my brain.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>Thanks for reading. I hope you enjoyed this.</p>\n<p>You can find me <a href=\"https://twitter.com/triedunture\" rel=\"nofollow\">@triedunture</a> on Twitter.</p>",
  "text": "<p>Steve's slouched on the couch at an odd angle, sketchpad propped on his knee. The floor he'd been assigned at Stark Tower is beautiful—he'd never complain about it—but it had been designed for dramatic effect and practical defense. Tony had not, in fact, planned the living area with natural light in mind. Oh, Steve could have asked Jarvis to adjust the environmentally invincible ceiling lights, sure. But he's always been partial to sunlight, and no matter how long he lives in the 21st century, he knows he'll always miss the way his old flop in Brooklyn looked when the afternoon sun filtered through the curtains. </p>\n<p>He's drawing it now—that flop—as best as he can remember it. The shadow of the fire escape, the graceful bulk of the radiator, a chipped mug left on the rickety table: Steve has a memory for details. He hesitates to add the final one, but in the end he can't stop himself. Bucky appears in curves and lines and shadows at the edge of the picture, Bucky as he used to be, hair short and pushed back with one hand, unselfconscious of the viewer.</p>\n<p>Steve stares at the drawing and suppresses a sigh. Sam's told him about the virtues of patience, but after the better part of a century, it feels like he's holding his breath for a moment that he'll never get back.</p>\n<p>He's so lost in thought he doesn't notice Bucky's presence until he's right there, sitting on the floor at the base of the sofa, fiddling with the joints of his metal fingers. They whir and whine as he flexes them, speaking more than he does these days.</p>\n<p>\"Hey. You're up,\" Steve says. He flips the sketchpad closed before contorting himself into a more normal position. Bucky doesn't need to see the drawing; no sense making him feel more guilty. \"Want some breakfast?\"</p>\n<p>Bucky shakes his head, tips it back against the cushion to look Steve in the eye. \"No. You can keep drawing,\" he says. His voice is rough with disuse. He hasn't spoken since Tuesday, not that Steve's counting.</p>\n<p>(Steve is very much counting.)</p>\n<p>They stay like that, Steve seated on the sofa and Bucky on the floor, until the sunlight slants upwards to noon. It isn't a concerning silence between them; for once, Bucky's not staring into the invisible distance blankly. He's just quiet and companionable at Steve's feet, examining his fingernails, scratching his belly. After the first hour, he dozes, head tilted back onto the cushion. When he wakes, Steve flips the page of his sketchpad to hide the drawing of him in repose, long lashes making shadows on his cheeks. </p>\n<p>This repeats in the downtime Steve has between missions with the Avengers. Quiet mornings spent without words, Steve drawing, Bucky sitting at his feet.</p>\n<p>It seems so innocuous, Steve doesn't question it.</p>\n<p>Then there's an afternoon where, after their lazy routine, Steve coaxes Bucky into making the trek down to the basement gym. \"To burn off that restless energy,\" he says, but Bucky just shrugs. </p>\n<p>\"If you say so.\" It's his go-to response. </p>\n<p>(Tony has been hounding Steve for more data on Bucky: his strengths and weaknesses, his abilities, the limits of his power. \"Don't you want to know what those fuckers did to him?\" Tony had asked once. </p>\n<p>\"I know enough,\" Steve had snapped. \"He'll tell us when he's ready.\" </p>\n<p>\"Cap.\" Tony had grimaced. \"He may not remember.\" </p>\n<p>Tony's right; he does need to know what Bucky is capable of these days, if only to protect him from taking on too much. A quick workout is a good compromise. This way it's just him and Bucky in the room, no machines, no scans.)</p>\n<p>The weights are set up for Clint, which makes Bucky scoff and add a hundred more pounds. He goes through the motions of those exercises with little effort. Superhuman strength, then. Definitely more than he used to have. Steve leads him over to the chin-up bar, but Bucky takes one look at it and folds his left arm—the robotic one—behind his back, grasping the bar with just his right hand.</p>\n<p>\"You sure?\" Steve asks as he watches him adjust his grip.</p>\n<p>\"Guess we'll see,\" Bucky murmurs. </p>\n<p>He does two sets, sweat pouring down his face. Steve stands close by, ready to do his duty as a spotter if need be. At the end of the last set, Bucky nearly stumbles to his knees as soon as his feet touch the ground, chest heaving, neck flushed. His long hair—which had been pulled back into a knot for the occasion—is coming undone, damp strands hanging in his face.</p>\n<p>It's clear now; the majority of his upper body strength comes from his prosthesis. Steve pats Bucky on his sweaty, shuddering shoulder and says, \"That's enough of that. Let's—\"</p>\n<p>\"No,\" Bucky gasps out. He reaches up for the bar, left arm tucked into the small of his back. \"I can do one more.\"</p>\n<p>\"You don't have anything to prove here,\" Steve says.</p>\n<p>\"Tell me I can do this,\" Bucky pants. Wild, glassy eyes gaze at Steve. There's something in that look that gives Steve pause, something unfamiliar. \"Please.\"</p>\n<p>Well. Sam <i>is</i> always talking about positive reinforcement. \"Okay.\" Steve removes his hand. \"Okay, you've got this. Come on, Buck.\"</p>\n<p>Bucky groans through every rep. His muscles and tendons stand out in stark relief under his skin. Steve swallows down his concern and keeps up the chatter. If Bucky needs to do this, Steve will see it's done.</p>\n<p>\"Four more, almost there. Good, Buck. Come on. There it is, three to go.\" </p>\n<p>By the time Bucky's finished, his arm is quivering with the strain. He sits on a nearby weight bench, head tipped back, eyes closed, trying to catch his breath. </p>\n<p>When he opens his eyes and looks at Steve, Steve knows just what to say for once. </p>\n<p>\"You going to dawdle there all day, or are you ready for some more?\"</p>\n<p>Bucky grins like a feral animal and follows him to the next set of weights. The pace is brutal, but the exercise seems to do Bucky a world of good. There's a light in his eyes that Steve had almost lost hope of ever finding again, and that's worth a few aching muscles, he figures.</p>\n<p>\"I'm impressed,\" Steve tells him when they've completed an entire circuit of the gym. \"Seriously, Buck. Good work. Hit the showers.\"</p>\n<p>Bucky wobbles upright from the rowing machine and gives a half-assed salute. He heads toward the locker room while Steve picks up their discarded equipment and tidies it away. Bucky's strong, he thinks, even without the arm. He could be a real asset to the team, if that's what he wants. Steve's not sure what Bucky wants; he rarely talks about anything, least of all the future.</p>\n<p>About twenty minutes goes by and still no Bucky. Steve busies himself with his Starkphone, but can't help himself from checking the time. Finally, in a fit of worry, he heads into the locker room himself. </p>\n<p>\"Buck?\" he calls. His voice echoes off the tile. He can hear running water, feel the heat of steam. He rounds the corner to find Bucky standing naked under the shower spray, metallic arm against the wall as if that's all that's holding him up. </p>\n<p>\"Hey, you're not drowning in here, are you?\" Steve's joke falls flat, even to his ears. </p>\n<p>Bucky turns his head to look over his shoulder. His long wet hair slithers along his skin. \"Sorry,\" he says. \"Lost track of the time, I guess.\" His right hand reaches for the soap dispenser and takes a handful. </p>\n<p>\"You haven't even washed yet?\" Steve can't help the scandalized note that creeps into his voice. All those gallons of water…. \"You feeling okay?\"</p>\n<p>\"Yeah. Just—\" Bucky slathers the soap onto his chest with a sigh. \"Never mind. I'll be out in a minute.\"</p>\n<p>Steve leaves him to it, but hovers in the locker area until Bucky emerges, dressed in clean clothes but still wet. His hair hangs loose, soaking his shirt.</p>\n<p>\"Aw, Buck, you didn't even dry your hair. Come here, you mook.\" Steve takes the damp towel from Bucky's hands and rubs it over his head. </p>\n<p>Bucky stands there, head bowed a little to allow it, and says, \"How would I survive without you?\" in that old Brooklyn drawl of his.</p>\n<p>\"Shut up,\" Steve answers, but what he's thinking is <i>you almost didn't</i>. </p>\n<p>Later, he sends a message to Tony. The next day, the Winter Soldier is officially invited to participate in team missions. \"They serious?\" he asks Steve when he receives the e-mail.</p>\n<p>\"If you are,\" he says. Bucky nods, and that's that.</p>\n<p>The quiet mornings take a strange turn. </p>\n<p>Steve still sits on the sofa with his pencils and paper, and Bucky still sits on the floor. But now Bucky's hand will rest atop Steve's bare foot, or his head will lean against Steve's leg. Touch is a good thing, Steve reminds himself. Touch means Bucky is comfortable. So he allows this little intimacy. Whatever Bucky needs.</p>\n<p>One particular morning, Steve looks up from his drawing and realizes that Bucky's dozing again, this time slumped against Steve's leg, cheek slack against his calf. He smiles at the sight for an indulgent moment before sticking his pencil behind his ear and reaching down to thread his fingers in Bucky's hair.</p>\n<p>\"Hey,\" he says, \"you're going to give yourself a crick in your neck.\"</p>\n<p>Bucky makes a sleepy noise somewhere between a snuffle and a sigh and presses his nose into Steve's leg. It's bare skin on skin, since Steve's wearing his workout shorts. Goosebumps rise.</p>\n<p>\"Come on.\" Steve tugs gently on his hair, trying to get Bucky's attention. \"Get up.\"</p>\n<p>Instead, he gets a low moan. </p>\n<p>\"Uh,\" Steve says. \"Buck?\"</p>\n<p>\"I like it down here,\" Bucky mumbles against Steve's kneecap. He arches into Steve's touch like he's been starved for it. \"But keep doing that. 's nice.\"</p>\n<p>\"This?\" Steve combs his fingers through the long, soft strands of Bucky's hair. </p>\n<p>\"Yeah.\" It's a whisper. \"Please.\"</p>\n<p>Steve keeps it up as requested. It's strangely meditative, playing with Bucky's hair like this. It reminds him of the winters they used to spend in Brooklyn, bundled up together for warmth next to the radiator, rubbing each other's palms to keep the cold at bay. He wants to ask Buck if he remembers the old place, the blizzards they weathered there, but he's afraid of pressuring Bucky into recalling too much too soon. His fingers pause in Bucky's hair, suddenly stricken with the idea that he may never remember their shared past. He may never remember how Steve had loved him--quietly and hopelessly--if he had ever known at all.</p>\n<p>Bucky's head butts against his leg, jerking him from his thoughts. \"God, don't stop now,\" Bucky says, his wrecked voice cracking. </p>\n<p>\"You all right?\" Steve asks. \"What's the matter?\"</p>\n<p>\"Nothing,\" Bucky whispers. His head is tipped downward, his hair falling like a curtain so Steve can't see his face. \"I'm fine.\"</p>\n<p>\"Yeah? Because you're acting like you're a cat and I'm the scratching post.\" He chuckles, but Bucky doesn't join in. He only shifts against his leg and says, \"Would that be so bad?\" His hand comes to rest, soft and tentative, on Steve's ankle.</p>\n<p>Steve clears his throat. \"No. No, I guess not.\" His hand starts its cycle of petting again, and Bucky relaxes. </p>\n<p>It's strange, touching him like this. His fingers tangle aimlessly, combing forward and back. Bucky's breathing evens out to a low hum. He'd be purring if he could, Steve's pretty sure of it. The idea brings a smile to his lips. </p>\n<p>And then Bucky's hand comes up to touch his. With his hair brushed back like this, Bucky's face is visible and Steve can see that his eyes are closed. Before he can ask if Bucky's tired of having his hair played with, he gets his answer: Bucky guides his hand down to his jaw, his cheek. It's a caress, and it's intimate, and it's not something that happens between friends. Steve's lips part, but he doesn't take his hand away. He can't. Then Bucky guides them down to his neck, where his pulse is fluttering wildly. </p>\n<p>Their joined hands cup Bucky's throat: a deliberate, desperate squeeze of Bucky's fingers on Steve's. </p>\n<p>Steve's breath catches. \"What—?\" he chokes out.</p>\n<p>\"Please,\" comes the hiss. His throat bobs under Steve's hand. \"Please.\" </p>\n<p>There is something in the human brain that stops working at moments like this. Steve is no exception, for all his scientific enhancements. All he can think of is how pliant Bucky is like this. How fragile. How sweetly he's asking— </p>\n<p>And then his mind catches up, and he realizes he's a few pounds of pressure from cutting off his best friend's air supply. </p>\n<p>Steve stands so abruptly, Bucky nearly topples over. He's left blinking up at Steve, his face a work of hurt. </p>\n<p>\"Sorry,\" Steve says. \"I— Sorry, I almost forgot, I have a training session booked.\" It's a lie, a terrible one, and Bucky's face shutters at its utterance. </p>\n<p>He doesn't say a word as Steve escapes.</p>\n<p>Steve knows he shouldn't go to Sam about this. For one thing, it's a private matter. Something between him and Buck. Whatever it is. For another, Sam has put up with his share of Steve's confusion since Bucky resurfaced, and it's not fair to keep dumping on him. </p>\n<p>But he has to go somewhere that isn't the penthouse he shares with Bucky. So he goes downstairs to the gym and ends up running into Sam anyway. He's already there, beating up a punching bag in the corner, sending it swinging.</p>\n<p>\"Hey Cap,\" he says when he sees Steve's face, \"you look like you just saw a ghost.\"</p>\n<p>\"I'm fine,\" Steve says, which is another lie. Sam knows it, but just raises his eyebrows and tosses his roll of tape at Steve, who catches it and wraps his knuckles in silence. </p>\n<p>Sam holds the bag for him for about an hour, letting him whale on it until its seams threaten to split. \"Want to talk about it now?\" Sam asks from his defensive position behind the bag. </p>\n<p>\"No.\" Another three-jab combo.</p>\n<p>\"You sleeping?\"</p>\n<p>An uppercut. \"Yeah.\"</p>\n<p>\"So it's Barnes?\"</p>\n<p>One last punch, dead center, hard enough to force Sam back a step. Steve sighs, averting his gaze so he doesn't have to see Sam's reproachful look. \"You don't need to be my sounding board for every little thing,\" he says. </p>\n<p>\"I know that.\" Sam retrieves a water bottle from the ground and throws it to him. \"But I've carried the guy through the air and let me tell you something: he's not little.\" </p>\n<p>Steve snorts, hiding his smile with gulps of water. </p>\n<p>\"So come on. Spill,\" Sam says. He perches on a weight bench, gets comfortable.</p>\n<p>Steve sighs. How is he supposed to explain something he barely understands? He chucks the water bottle into the recycler, takes his time unwrapping his hands while he considers how to start. Finally he says, \"I think Bucky expects to be punished for what he did as the Winter Soldier.\"</p>\n<p>Sam nods, thoughtful. \"And what makes you say that?\"</p>\n<p>\"He just asked me to hurt him,\" Steve says. He keeps his eyes on the tape job, so he can only imagine the contortions Sam's face is going through. </p>\n<p>The tone of his voice when he responds says it all, high-pitched and startled. \"What did he say, exactly?\"</p>\n<p>\"It's not what he said, it's what he did,\" Steve says, and describes, as best he can, how the usual lazy quiet had turned into his hand on Bucky's throat. \"I don't know what to do,\" Steve concludes, throwing his used tape away in the trash can. \"I think— Jesus, what if Hydra hurt him that way? What if he's so used to it, he—\" Steve can't think of that, cannot fathom the seventy years of pain Bucky has endured, so he presses the heels of his hands to his hot eyes to keep the thoughts at bay.</p>\n<p>\"Okay, cowboy. And, we're breathing now. Remember breathing? Come on.\" Sam's hand is a comforting weight on his back, rubbing in small circles. \"I know you're freaking out, but to be honest? What you're describing? Does not sound like the kind of treatment our boy got from those Nazi assholes.\"</p>\n<p>Steve looks up from his hands, blinking at Sam. \"What do you mean?\" </p>\n<p>\"I can guarantee you no one was braiding Bucky's hair at some Hydra facility, or giving him cuddles in between missions.\" </p>\n<p>Steve's brow furrows in confusion. \"Maybe not, but still. This can't be healthy.\"</p>\n<p>\"What's healthy anyway?\" Sam shrugs. \"Look, I can't tell you what recovery is supposed to look like. It's different for everyone. Sometimes it's messy and it's weird, but hey. At least this isn't a drinking problem.\"</p>\n<p>Steve growls, \"That's not funny.\"</p>\n<p>\"Not supposed to be,\" Sam shoots back. \"You need to talk to Bucky about this, man. Whatever he's looking for, there's a reason. Start there.\"</p>\n<p>Guilt eats into Steve's heart as he remembers the look on Bucky's face as Steve fled the scene. He groans into his palms. \"You're right. We need to talk.\" His hands scrub over his tired face as he thinks about the quiet, sensual moments where he'd combed through Bucky's hair with his fingers. He'd seemed to enjoy it so much; just how much and in what way, however…. \"So do you think this is about sex?\" he asks Sam.</p>\n<p>\"Whoa. Way above my pay grade,\" Sam says, gesturing <i>no</i> with both hands. \"You'll have to hash that out for yourselves, gramps.\"</p>\n<p>Steve smiles, ducks his head, accepts Sam's pat on the back with good grace.</p>\n<p>\"Just remember,\" Sam warns, \"be patient.\" </p>\n<p>He sends Steve back upstairs with a head full of questions and a stutter in his heart.</p>\n<p>For some reason Steve thinks maybe Bucky will be exactly where he left him on the floor by the couch, as if they had just pressed a pause button and could pick up right where they stopped. But of course that's not the way things work; Bucky's not in the family room or the kitchen. The bathroom's open, and he's not in there. Steve knocks on Bucky's bedroom door as a last resort, but the answer comes from down the hall, from Steve's room. </p>\n<p>\"In here,\" Bucky calls.</p>\n<p>Steve opens the door hesitantly, expecting a bedful of things he's not quite ready to deal with. He should've known better. Bucky is sitting at the foot of his bed, still dressed in Steve's hand-me-down jeans and an old SHIELD tee, hands hanging limp between his knees, head bowed. He looks up at the creak of the door hinges. </p>\n<p>\"Hey,\" Steve says.</p>\n<p>\"Hey,\" Bucky answers. He looks pale and twitchy, almost as bad as he looked when he first arrived in New York five months ago. His right hand comes up to scratch the back of his head. \"Listen, I wanted to tell you I'm sorry about—\" He pauses, his hand drops. \"Let's forget it.\" His jaw is jumping from being clenched so tight, and Steve's chest constricts in sympathy.</p>\n<p>\"I can't just let this go,\" he says, then curses himself at Bucky's flinch. \"No, I mean—\" He crosses the room and drops to one knee in front of this man, this impossibility who has followed him from the brink of death. He reaches out and takes his hands in his. \"Buck, you need to tell me what the hell is going on here.\"</p>\n<p>\"Nothing.\" His eyes, for the brief moment they meet Steve's, are as wild as they'd been on that Helicarrier. \"Nothing's going on.\"</p>\n<p>\"Don't bullshit me,\" Steve snaps, and Bucky flinches again, his hand pulling out of Steve's grip. \"Buck, come on.\"</p>\n<p>\"I don't know, okay?\" Bucky says. \"I don't— Aren't any words for it. How am I supposed to tell you when I can't—\" His voice is rising rapidly, frantic, and Steve reaches out again, can't leave him alone in this. He pulls Bucky to him, his hands in his long hair, letting him mash his face into Steve's shoulder. </p>\n<p>\"It's okay, it's going to be okay.\" </p>\n<p>(Steve does not know if it's going to be okay, but it's not exactly a lie.)</p>\n<p>\"I'm here. I've got you.\" </p>\n<p>(That much is true. He prays it will keep.)</p>\n<p>\"Please just talk to me. Tell me about what happened today,\" he says.</p>\n<p>\"Why?\" Bucky mumbles against his neck. \"Can't we leave it alone?\" </p>\n<p>Steve shakes his head. \"I have to know what you need here, Buck. How else am I supposed to take care of you?\" The words are out of his mouth before he thinks of how they might sound. Bucky Barnes, perpetually cocky and going off half-cocked, has never needed to be coddled. Steve doesn't mean to be insulting, but it's already said. </p>\n<p>And Bucky's already leaning back to stare at him, mouth open. But not in anger. Just in shock. \"Y-you….\" He swallows. \"Would take care of me?\"</p>\n<p>\"Yeah, 'course.\" Steve reaches up and tucks a strand of hair behind his ear, careful and slow. \"If that's what you want. Is it?\"</p>\n<p>Bucky nods, eyes wide. \"Yes.\"</p>\n<p>Steve rises a little and slides onto the mattress alongside Bucky. He gets the feeling they need to be on equal ground for this.</p>\n<p>\"I thought, after everything you've been through,\" he says quietly, \"you'd want to be, you know. Independent. In control.\"</p>\n<p>Bucky's brow crinkles. \"Steve, don't you get it?\" He spreads his arms wide. \"I've been in control ever since you brought me here.\" His arms fall back to his sides like leaden weights. \"I'm constantly keeping myself in line. Every second, I got to make sure I say the right thing, do the right thing, shoot the right person, take the right steps. Because if I don't, I—\" He shakes his head helplessly.</p>\n<p>\"What?\" Steve presses. \"What do you think will happen if you make a mistake?\"</p>\n<p>A dry laugh passes those lips, which are then caught between sharp white teeth. Bucky's throat works overtime. He looks around the room as if the answers to Steve's questions are somewhere in the corners. </p>\n<p>\"Everyone will see I don't belong here,\" he finally says. \"Or worse, they won't, and I'll have to make myself leave.\" </p>\n<p>\"Buck,\" Steve says softly. He feels like a jackass; he's the one who encouraged Bucky to train with the team, to take missions, to get back in the field. He thought it would help to surround Bucky with purpose and camaraderie. But he'd been wrong. \"I'm sorry, I shouldn't have pushed you before you were ready.\" </p>\n<p>\"No, that's not the issue,\" Bucky huffs in frustration. \"I want to be an active agent. I need to be useful. But sometimes I need—\" And here his mouth clamps shut and his left hand covers it with its metallic palm. His eyes close and his head shakes side to side.</p>\n<p>Steve wishes that sentence could end in <i>you</i>, but he knows that's not what this is about. \"It's about giving up control,\" he says slowly, \"so you don't have to be so careful for a little while.\" </p>\n<p>Bucky's hand falls to his lap. He nods gratefully. </p>\n<p>\"And you trust me with this?\"</p>\n<p>Bucky's head tilts as he stares at Steve. \"Who else?\" he asks.</p>\n<p>Steve hides his rising flush by coughing into his fist. \"Okay. All right. So what is it you want me to do?\"</p>\n<p>Bucky fidgets under Steve's gaze, his fingers dismantling the hem of his borrowed tee shirt. He doesn't answer, just shrugs one shoulder. </p>\n<p>Steve tries again. \"Earlier you wanted me to, um, touch your hair. You liked that, right?\"</p>\n<p>Bucky's eyes meet his. \"You know I did.\"</p>\n<p>\"Yeah. But what did you like about it?\"</p>\n<p>Another shrug. \"Felt nice.\"</p>\n<p>\"It felt...what, comforting?\" </p>\n<p>\"Some.\"</p>\n<p>\"What else?\"</p>\n<p>Bucky's mouth twitches before he answers, \"Like I must've done something good to deserve it.\" </p>\n<p>Steve remembers the morning in the gym, when Bucky had worked his overtaxed muscles to the breaking point. He'd asked for Steve's encouragement and had gotten it. And then, later, in the locker room— </p>\n<p>\"Is that why you stayed in the showers so long that one time?\" Steve asks. \"Were you...hoping you'd earned something else?\"</p>\n<p>Bucky ducks his head. \"I liked it when you dried me off,\" is all he says.</p>\n<p>\"But what you really wanted was to be washed,\" Steve blurts out.</p>\n<p>A small sigh escapes Bucky's parted lips. \"That would've been nice.\"</p>\n<p>It's really difficult not to imagine soaping up that body in front of him, tending to its aches and sore spots, pressing up against it under a steady stream of warm water. It's really very difficult. Impossible, actually. Steve may have super strength, but he's still only human. </p>\n<p>He shakes his head to clear it. \"Okay,\" he breathes. \"This all sounds pretty simple. But earlier, when you took my hand—\" Bucky's fidgeting again. \"—and you put it around your neck, what was that about?\"</p>\n<p>\"I don't know,\" Bucky says. \"Don't you ever want someone to just...be the boss of you for a while?\"</p>\n<p>No, Steve has never wanted that. But he can't say that to Bucky, not when his eyes are pleading with Steve to understand. \"I don't want to hurt you,\" he says instead. </p>\n<p>\"Then I don't want you to either.\" Like it's as simple as what <i>Steve</i> wants. Oh Lord, if only. </p>\n<p>\"So, what, it was a test?\" Steve asks.</p>\n<p>\"No, I don't need to test you.\" Bucky stretches his fingertips, barely brushing Steve's kneecap. \"I trust you.\" </p>\n<p>\"With your life?\"</p>\n<p>Bucky doesn't drop his gaze, doesn't look away. \"With my life.\"</p>\n<p>Steve doesn't know whether to smile or sob. Bucky doesn't even remember the old days, everything they went through together in the war. He only knows snippets and snatches and what he's experienced with Steve here in this time. And somehow that's enough? How can it be enough? </p>\n<p>Bucky's hand finally finds his, holding it tight. \"So there you have it,\" he tells Steve. \"That's everything. Take it or leave it, I guess.\" He tries to grin, a cracked mirror smirk that falls within a moment. \"Just tell me which it is, because I'm following your lead here.\" </p>\n<p>Steve still isn't sure exactly what's happening between them, friendship or comfort or more, but he knows what his answer is regardless. \"Of course I'll take it,\" he says, squeezing Bucky's hand, his heart fighting against his ribs. \"But what if I take you somewhere you don't want to go?\"</p>\n<p>Bucky thinks about that for a minute, his free fingertips tapping at his lips. \"Then I'll yell 'Jersey,'\" he says.</p>\n<p>\"Jersey?\"</p>\n<p>Bucky smirks. \"As in, a place I really don't want to go.\" </p>\n<p>Steve gives him a pained look. \"Come on, don't pick on Jersey. Sam has family there. They have good schools.\"</p>\n<p>Bucky's eyebrows dance, delighted. \"If you won't even let me choose the word, maybe you're more cut out for this bossing around thing than you think.\" </p>\n<p>\"Jersey it is,\" Steve says with a good-natured roll of his eyes. </p>\n<p>The moment isn't so heavy anymore, and it shows on Bucky: his shoulders go back, his spine gets straighter, his whole face is more open and lovely. \"So it's settled,\" he says.</p>\n<p>\"Yeah.\" Steve doesn't let go of his hand. \"We'll just— Little by little, all right? Blind leading the blind.\" He smiles, and Bucky allows his mouth to come somewhere in the vicinity of a grin, and they're okay. They're good. </p>\n<p>But then Steve remembers they're sitting on his bed and it's getting late. And he's still not clear on whether this is about sex or not. As far as he can tell, Bucky just wants to be alternately told what to do and treated gently. He'd ask Buck to give him some guidance here, but that would defeat the purpose of taking charge himself. </p>\n<p>Bucky is watching his face closely, as if hoping for some sign of what happens next. So Steve purses his lips and comes up with his best tactical solution. </p>\n<p>\"Tell you what: you can stay here tonight. In my room.\" He keeps an eye on Bucky's pupils, choosing his next words slowly. \"On the floor.\" </p>\n<p>Black overtakes ice blue in a heartbeat. An automatic reaction. \"That sounds good,\" he breathes. </p>\n<p>\"I can get you some pillows—\" Steve starts. </p>\n<p>\"No!\" Bucky's hand clutches his. \"I mean, I'll be fine. They're too soft, you know?\" He gives a helpless shrug, and Steve tells his heart to please quit hurting. </p>\n<p>\"I know,\" he says, and he means it. \"So you'll be on the floor. Close, where I can keep an eye on you. And if you can make it through the night without getting up and pacing around—\" He's heard the footsteps down the hall at all hours, back and forth, back and forth. \"—then maybe we can talk about a reward.\" This is a small, doable task: something to start Bucky off easy. And, if he's honest, something Steve can handle, something that echoes their nights spent on the ground in France.</p>\n<p>\"A reward?\" Bucky drawls, but the nonchalance is feigned. He licks his lips like he can taste it. \"Like what?\"</p>\n<p>\"We'll see. Let's get through the night first,\" Steve says. </p>\n<p>When they bed down, Bucky takes the floor next to the bed, stretching out on his side and pillowing his head on his left arm. It doesn't look comfortable to Steve, but who's he to judge? He curls up on the edge of the mattress and looks down at Bucky with his head propped in his hand. </p>\n<p>\"You'll be okay down there?\" he asks.</p>\n<p>\"More than okay.\" Bucky looks up at him, his eyes shining in the dark with what might be unshed tears, or maybe just gratitude. \"Thanks for this. I knew I could count on you. Just like always.\" </p>\n<p>Steve wants to ask him what he means by that, but Bucky's already closing his eyes and breathing deep. Steve feels the tiredness he's been keeping at bay sweep over him, and he falls asleep too. But not before he reaches down and rests a hand lightly in Bucky's soft hair. </p>\n<p>They both sleep better than they have in weeks. </p>\n<p>In the morning, Steve makes buttered toast for breakfast and feeds it to Buck with his own hands, bite by bite: a little treat for a job well-done. At first it feels silly, sitting there at the kitchen table, feeding a grown man his food, but Buck wolfs it down so gratefully and gazes at Steve with such adoration that he can't find it in himself to care. </p>\n<p>It's not something they do every day, this stuff. Some days are too busy, and some days Bucky doesn't need it. But every so often, Steve will catch him ducking his head, scratching at his elbow, almost vibrating out of his skin, and that's how Steve knows it's time to take care of him. </p>\n<p>Bucky's favorite place is still at Steve's feet at times like these. Steve gets it, he thinks: sitting down low, being forced to look up at Steve, in the perfect position to have his hair stroked. Steve scratches his scalp, talks to him in a low, gentle voice.</p>\n<p>\"You're doing so good,\" he says. \"I'm proud of you.\"</p>\n<p>\"Yeah?\" Bucky's head lolls against Steve's knee, giving him access to the other ear. \"You are?\" His voice is honey-slow, like he's dreaming. Who knows, maybe he is.</p>\n<p>\"'Course I am. So proud,\" Steve says. He almost tells him he's Steve's good boy, but that's a little too possessive for where they're at. The last thing Steve wants is to scare him.</p>\n<p>Then there are days when Bucky needs a firmer hand. These are the days when they're all on edge, a mission gone sideways or a media frenzy blown up, when Bucky's stalking the halls of the Tower like a caged animal, snarling at anyone who gets too close. </p>\n<p>\"Hey!\" Steve stops him with a hand to his chest after he'd spat some nasty curses at Ms. Potts, who's just doing her best in a bad situation. \"You need to stand down. Now.\"</p>\n<p>Bucky's nostrils flare, and for a moment Steve wonders if they've got a real fight on their hands. But Bucky backs off, lets Steve take him by the arm and drag him to the elevator, which takes them to their penthouse. Privacy is essential; Steve knows that much. They don't do this in front of the others. It's theirs. </p>\n<p>\"What the hell was that?\" he asks when they're alone. </p>\n<p>Bucky doesn't answer, just paces the long length of the sunken living room and back. He makes a low groaning sound, his head in his hands. He keeps moving and doesn't stop until Steve grabs him by the shoulders. </p>\n<p>\"Come with me.\" Bucky follows him to his bedroom as directed. </p>\n<p>Steve steers him toward the bed, which Bucky balks at for a moment; too soft, too pristine with its white sheets. Steve knows the aversion well. But today is different, and Bucky will just have to deal. </p>\n<p>\"Quit it. Lie down.\" </p>\n<p>Bucky stands stockstill, shoulders tight under Steve's hands for a long moment. But eventually, he does as ordered. Steve crawls on top of the sheets next to him and stretches out, maneuvers them onto their sides, fits them together with Bucky's back to his chest. They're still in uniform, layers of leather and Starktech armor making them clumsy. </p>\n<p>But that's not important. What's important is how Steve wraps his arms around Bucky's chest, wraps his legs around Bucky's legs, and pins him in place. It's not a painful hold, but it's tight, and Bucky struggles at first.</p>\n<p>\"You can fight me all you want,\" Steve hisses in his ear, \"but we're going to stay here until you calm down. Understand?\"</p>\n<p>\"No,\" Bucky growls. Whether that's in answer to Steve's question or the situation in general is not clear. He jerks in Steve's grasp, but not enough to break free. Surely his left arm would make that possible if he really wanted to, so Steve can only guess that he doesn't want to.</p>\n<p>Steve squeezes tighter. \"Shhh, listen to me. Listen. It's okay.\" </p>\n<p>They're rocking back and forth now, Bucky shuddering against him. \"No,\" he sobs out. \"No, no.\"</p>\n<p>\"Where we going, Buck? You still here with me, or are you the next state over?\" Steve asks. His lips are so close to Bucky's ear, he doesn't need to do more than whisper. </p>\n<p>Bucky goes still and immobile at that. \"'m here,\" he promises. \"I— I'm with you.\" His voice breaks. \"Steve—\"</p>\n<p>Steve shushes him again. Rests his chin on the crown of Bucky's head and squeezes his eyes shut. \"Not going to hurt you. We're just going to stay here. Take as long as you need.\" </p>\n<p>\"I'm sorry,\" Bucky says, a sob.</p>\n<p>\"I know.\"</p>\n<p>\"I messed up.\"</p>\n<p>\"And the world didn't end. And I'm still here.\"</p>\n<p>\"Yeah. Guess you are.\" Bucky lays there in his arms for a few minutes, his breathing evening out from its rough edges. \"Steve?\" he asks.</p>\n<p>\"Hm?\"</p>\n<p>\"Can you…? Tighter?\" </p>\n<p>Steve bites his lip and fights the urge to press a kiss to the top of Bucky's head. \"I don't want to crack any ribs.\"</p>\n<p>\"You won't. I'll be fine. Just a little tighter,\" Bucky pleads. </p>\n<p>He rarely asks for anything, mostly just allows Steve to do what he feels is best at any given moment. So Steve gives him this, a bit more constriction around his chest, holding him impossibly closer. \"Good?\" he asks.</p>\n<p>\"Good,\" Bucky sighs. </p>\n<p>According to the alarm clock on Steve's nightstand, they stay like that for almost two hours. Bucky goes from shaking to rigid in his arms before he finally goes limp. Steve relaxes his grip a little, even starts to pull away until he hears Bucky's soft snores. </p>\n<p>Sleeping. Of course. Steve feels pretty wrung-out himself, would sleep for about twelve hours if he could. He considers it, thinks how nice it would be to fall asleep here next to Bucky. As close as they've become with this whole thing, they still haven't shared a bed. It just feels like a step too far. Only a heel would take advantage of someone as vulnerable as Bucky is right now, Steve figures. </p>\n<p>So he slips out of bed. Folds the coverlet over Bucky's sleeping form. Putters around, changes into his civvies, gets a glass of water and places it on the nightstand in case Bucky wakes up with dry mouth. Answers a few messages from teammates, fires off a text to Pepper apologizing for the scene earlier. He's exhausted, but it seems like there's a million things that need his attention and the only one that matters is sleeping in his bed.</p>\n<p>He curls up on the couch and watches the skyscraper lights twinkle through the plate glass window, and he listens for the even breathing from down the hall that tells him Bucky's okay. That's where he falls asleep. </p>\n<p>He wakes up to the clink of a plate on the coffee table. His eye cracks open to find Bucky standing there, awkward in Steve's borrowed sweatpants. The plate is piled high with eggs and bacon. </p>\n<p>\"Didn't mean to kick you out of your bunk last night,\" Bucky says, scratching a hand through his shaggy hair. </p>\n<p>\"I don't mind,\" Steve says. He levers himself upright and picks up the plate, digs in with the provided fork. He can't remember the last time Bucky cooked for him. 1939, probably. The eggs are scrambled and the bacon is almost black, just the way he likes it. \"This is good, Buck. Thanks.\"</p>\n<p>Bucky shrugs, still standing in front of Steve with his arms crossed over his bare chest. \"Least I could do,\" he says. </p>\n<p>Steve looks up. \"You going to stand there and watch me eat?\"</p>\n<p>Bucky twitches a little, his arms jerking, throat working. Steve sighs and pats the floor next to his feet. It's with a thankful, relieved look that Bucky takes his customary place. </p>\n<p>\"Thought maybe you'd want a break after what happened,\" he says as he nuzzles carefully against Steve's kneecap. </p>\n<p>\"'s fine,\" Steve says around a mouthful of eggs. \"Not your fault you're mostly cat.\"</p>\n<p>\"A cat, huh? You used to call me a pit bull.\" His nose bumps along the ridges of Steve's knee down the smoothness of his tibia. \"Threatened to strap a muzzle on me all the time.\" </p>\n<p>Steve stops in mid-chew and looks down at his oldest friend. \"I haven't said that to you since we were kids,\" he says slowly.</p>\n<p>\"Yeah. I know.\" Bucky yawns. \"Never did follow through. You were all talk at that age.\"</p>\n<p>Steve hastens to put his plate back on the coffee table, clattering as he goes. \"You remember that?\"</p>\n<p>A shrug. \"Sure. Some of it's all fuzzy and out of order, but—\"</p>\n<p>\"Do you—?\" Steve swallows. \"Do you remember the old place?\"</p>\n<p>\"Our apartment on Clark Street?\" Bucky asks, as cool as can be. \"Yeah, I remember. What a dump. Radiator always busted, windows always sticking.\"</p>\n<p>Steve reaches down very carefully, very gently, and grasps Bucky's head in his hands; tips it back until he's looking right up at Steve; strokes his thumbs down his temples, fingertips cradling his chin. He tries to say something that won't end in tears but he can't seem to get the words out. </p>\n<p>\"Hey.\" Bucky blinks up at him. \"I know hearing me talk about the old days must be awful. I'll stop now, okay? Sorry I mentioned it.\"</p>\n<p>\"No,\" Steve chokes out. \"I'm not upset with you. I just— I thought you'd forgotten that stuff for good.\" </p>\n<p>\"So you're…?\" Bucky's right hand lifts and trembles against Steve's hot cheek. \"You're not angry?\"</p>\n<p>He shakes his head. \"I'm happy. And proud of you.\" Steve dares to press a kiss to Bucky's forehead and watches Bucky's eyes close at the touch of his lips. \"It's been hard, thinking I was the only one left who remembered. You don't have to bury those memories around me, Buck. It helps to know I'm not alone.\"</p>\n<p>\"But.\" Bucky peers up at him, brow furrowed. \"You know I'm not that person anymore. That kid you ran with back then, I'm not him.\" </p>\n<p>\"Yeah, I know. It's all right. I'm not the same either.\" Steve shrugs, giving his broad shoulders a chagrinned look as they move. \"Pretty literally, and otherwise.\"</p>\n<p>Bucky rests his cheek against the side of Steve's thigh, and even though it hurts Steve's neck just to look at him, he doesn't nag him to change position. \"Want to hear the other bits and pieces I remember?\" he asks quietly. </p>\n<p>\"I do. Tell me,\" Steve says, and he combs his fingers through Buck's hair while he talks about the old butcher shop and the soda fountain and the weekend dances and the teachers who smacked their knuckles until their handwriting was legible. </p>\n<p>It's the best morning Steve's had in a long time.</p>\n<p>They keep going like that: friends and teammates sharing a living space and a life, sometimes doing these things that seem to give Bucky relief. Most of the time it's quiet and gentle; sometimes Bucky acts up just to see what tactic Steve will take. </p>\n<p>\"Why are you being such a brat?\" he snaps one day when Buck won't listen to a word he says.</p>\n<p>\"What are you going to do? Toss me in bed and cuddle me into submission?\" Bucky shoots back. His eyes gleam in challenge. </p>\n<p>Steve bites his lip and takes a deep breath. He doesn't appreciate being mocked, especially when that instance took all of his self-control to handle. \"Hands and knees,\" he says in an even tone. </p>\n<p>They're alone, of course, and in the living room. And Bucky is rolling his eyes at Steve's order. \"Yeah, right.\"</p>\n<p>\"I said,\" Steve's hand goes to his right shoulder and uses just enough pressure to force him downward, \"hands. And. Knees.\" </p>\n<p>Down Bucky goes, mouth hanging open in shock. Steve steels himself, nods at the far wall. </p>\n<p>\"Go sit in the corner. Don't move until I say so.\" </p>\n<p>Bucky seems to be working up to saying something, but then thinks better of it before crawling away, slow and careful. He gives Steve one last glance—an impressed one, if Steve's any judge—before sitting back on his haunches and facing the wall.</p>\n<p>Steve takes stock of the picture he makes there and tries to get his breathing under control. Where the hell had that come from, he wonders. And why would Bucky go along with it? </p>\n<p>He must like it. The same way Steve likes it. </p>\n<p>He draws a palm down his tired face and sighs. This is getting complicated. </p>\n<p>After forty-five minutes, Bucky still hasn't moved from his place in the corner, and Steve can't take it anymore. He levers himself off the sofa, where he'd been watching the motionless proceedings, and pads over to him.</p>\n<p>\"Come on.\" He offers a hand. \"Get up.\"</p>\n<p>Bucky allows himself to be pulled to his feet, glassy, spaced-out eyes meeting Steve's. He doesn't say a word. They just stand there, waiting hand in hand. </p>\n<p>Finally, Steve says, \"You've been very well-behaved.\"</p>\n<p>No jokes, no acerbic comments. Bucky just tips his shaggy head in acknowledgement. Steve gives him what he wants and cards his fingers into his hair. </p>\n<p>\"Do you want to be washed now?\" he asks quietly.</p>\n<p>Bucky nods, leaning into Steve's touch even when Steve's hand cups his cheek. His eyes slip closed. \"Please.\"</p>\n<p>\"Go start the shower. I'll be there in a second.\"</p>\n<p>Bucky goes, a little wobbly on legs that must be numb from the long wait. Steve watches him leave. And then proceeds to have a private little crisis. </p>\n<p>This is such a bad idea. He's supposed to be good at ideas. Why would he implement such a <i>bad</i> one? He won't be able to control himself while scrubbing down Bucky, and Bucky's in a place where he might not be able to say no. </p>\n<p>He takes out his phone and almost calls—who? Tony? Nat? Sam? Who the hell would be able to give him advice for this? And what would he even say? <i>Hey, you know how Bucky seems to be adjusting pretty well so far? Do you think it has anything to do with how I treat him like a dog every so often?</i> </p>\n<p>Because that's what this is, isn't it? Bucky is his pet, and Steve owns him. Jesus, he can't treat Buck like an animal. That's what <i>they</i> did, and Steve hates them with everything he is. </p>\n<p>\"Get it together, Rogers,\" he whispers to himself, pacing the floor with his hands laced on top of his head. He can hear the water running in the bathroom down the hall. Bucky's waiting for him. Steve can't just leave him there; that would be the coward's way out. </p>\n<p>Okay. One last little favor, for Bucky's sake. And then Steve can sit him down and explain that this has gone too far. He's kept himself in check since they were boys. He can do it for ten more minutes.</p>\n<p>When he opens the bathroom door, he's greeted by a billowing cloud of steam. Stark had designed a ridiculously sumptuous shower area to complement the rest of the place: open and spacious, no door or curtain to speak of, with about five showerheads pointing in all different directions. Bucky's got every option running full blast. </p>\n<p>Oh, Bucky. He's standing there naked under the spray with his back to the door, head tipped back to let the water rush over his face. He doesn't acknowledge Steve, even though Steve makes plenty of noise to alert him to his presence. </p>\n<p>Steve considers leaving his clothes on for this, but that would make it even more awkward. He's seen Bucky in the buff before: as kids, as roommates before the war, when they served together. His whole life has been a series of sharing close quarters with this man.</p>\n<p>Maybe that's where he went wrong. </p>\n<p>Steve shucks off his clothes and folds them neatly on the bathroom counter, all the while keeping an eye on Bucky. Bucky doesn't move, not even when Steve joins him under the spray and reaches past his arm to grab the bar of soap. </p>\n<p>He can do this. He can even make sure Bucky enjoys it. He just has to keep himself from getting too close.</p>\n<p>\"Raise your arms,\" he says. It comes out in a whisper. Bucky obeys, arms coming to a perfect T. Steve clears his throat and starts washing his body, starting at the tips of his right fingers and working his way over. To fill the silence, he tries for more praise, the kind that he knows Bucky likes to hear: \"You did good today. A little rocky, but you got over it. That's what matters. You're always able to do the right thing in the end. You're a good man. And I'm proud of you.\" </p>\n<p>\"Steve—\" Bucky twists a little, but Steve stops him with a firm hand to his hip. </p>\n<p>\"Stay where you are. Let me do this,\" he says, gentling his grip. </p>\n<p>Bucky faces forward again, and Steve washes his back. It's broad and strong, covered in scars. Steve ignores them. They don't matter. Whoever gave them to Bucky can't hurt him anymore. </p>\n<p>\"I know you don't think of yourself as good,\" he says as he continues to work. \"You've done too many bad things, right? Well, I know you. And I'm telling you, James B. Barnes from Brooklyn never thought of himself as one of the good guys neither. You still got that kicking around in your head. Some things never change.\"</p>\n<p>He makes his way to where Bucky's left arm joins the flesh of his side, runs the soap over the fissure with care. Bucky gives a sharp intake of breath, but doesn't move away. Steve waits.</p>\n<p>\"You somewhere in the Garden State, Buck?\" he asks.</p>\n<p>\"Nah.\" He says it slow and warm. \"I'm so far away from there, Steve, I may as well be on another planet.\" His arms return to his sides. </p>\n<p>\"Good. That's good. Thank you for telling me.\" He resumes his washing, aware that it's his goodbye to this intimacy they've shared. His hands say their final farewell to Bucky's shoulders, the small of his back, his legs and stomach, the expanse of his heaving chest. All the while, Steve ensures he's not too close, because if he presses up against Bucky now, his secret's out. His cock is hard enough to drive nails at this point; it's embarrassing. So he stays behind Bucky and takes care when reaching around him. </p>\n<p>\"All clean,\" he says, and Bucky immediately protests, \"What about my hair?\"</p>\n<p>Steve suppresses a sigh. \"Hand me the shampoo.\" </p>\n<p>Bucky does so with an eagerness that breaks Steve's heart. He catches the bottle Bucky lobs over his shoulder, gets a big handful. It doesn't smell like much of anything but the manufactured cleanliness that all shampoo seems to have these days. Steve likes it because it's cheap, and Bucky uses it because it's there.</p>\n<p>\"Is this why you won't cut your hair?\" he asks as he kneads his soapy hands through Bucky's locks. \"You like primping it too much?\" </p>\n<p>\"Something like that,\" Bucky says, but it tapers off into a moan. \"God, your hands.\"</p>\n<p>Steve flushes. It's hot under the water, and the way Bucky's spine is arching in front of him isn't helping his condition. His fingers scrape at Bucky's scalp, massaging gently while Bucky groans his appreciation loud and clear. </p>\n<p>\"Wondered when you'd let me have this,\" he breathes. It echoes off the tile, and Steve doesn't have a comeback, so he says nothing. He just tips Bucky's head forward to let the water wash away the suds.</p>\n<p>\"Want me to do you next?\" Bucky's suggestion is overly casual in such a calculated way that Steve wants to scream. \"You know, you wash my back, blah blah blah.\"</p>\n<p>\"I showered this morning,\" Steve says, clipped.</p>\n<p>\"So did I. Doesn't mean you can't—\" Bucky hisses in pleasure as Steve's fingers find the spot on the back of his skull just above his nape. His whole frame shivers with it. \"Christ, yes,\" he sighs. And goes limp, falling back into the harbor of Steve's hips, his head resting back on Steve's shoulder.</p>\n<p>\"Don't—\" Steve starts.</p>\n<p>\"Please,\" Bucky begs. He rubs up against Steve, sliding the crack of his ass along his cock. \"Please, I've been good.\"</p>\n<p>Steve can see down the length of Bucky's body, past his chest and stomach to his own rock hard erection, bobbing in the air. He shuts his eyes and counts to three. \"No.\" </p>\n<p>(It doesn't sound like a command.)</p>\n<p>\"But—\"</p>\n<p>\"I said no.\"</p>\n<p>(Better that time.)</p>\n<p>Bucky turns his head. His lips brush Steve's neck. \"Okay,\" he says. Then, more certain. \"I get it.\" And with the grace of a cat, he pivots around and drops to his knees. </p>\n<p>This is <i>not</i> what Steve meant when he said no. But he's frozen in place, looking down at the picture Buck makes with his wet hair plastered down, grinning up at Steve like he knows a secret. </p>\n<p>\"I got to earn it, don't I?\" he purrs. He leans up, sticks out the tip of his pink tongue, and gives the head of Steve's cock a delicate little lick. </p>\n<p>Steve's legs nearly give out. He plants a hand on the marble wall to maintain his balance. \"Get up,\" he growls. </p>\n<p>\"Don't you want me to take care of you for once?\" Bucky asks, voice sugary sweet. Tiny kitten licks dance along Steve's shaft. \"Please. Let me work for it.\"</p>\n<p>That hot mouth descends and before Steve knows what's happening, he feels Bucky's nose nuzzling along the seam of his balls. He grabs a handful of that wet hair and yanks him back. \"Jersey!\" he shouts.</p>\n<p>It's like someone's flipped a switch. Bucky's face falls from its cocky smirk to something horribly gutted. \"What? What did I do?\" </p>\n<p>\"Nothing, just— Get up.\" Steve grabs him by the wrists and hauls him to his feet. </p>\n<p>\"Are you okay?\" Bucky looks him over for evidence of—who knows?—injury, probably. \"Why'd you stop?\"</p>\n<p>Steve shuts off the water and walks shakily out of the shower area, grabbing a towel from a stack by the door. He's never felt more naked in his life; he wraps it around his hips with halting motions. It gives him a good excuse to not look at Bucky while he comes up with a response.</p>\n<p>\"This stuff is supposed to be about you, not me,\" he finally says. \"Someone needs to draw the line somewhere.\"</p>\n<p>\"About...me?\" Bucky's voice sounds so lost. \"I thought it was about <i>us</i>. Don't you get a kick out of it too?\"</p>\n<p>Steve stares at the wall and wills his erection down. \"That's not the point.\"</p>\n<p>\"Well, then what is?\"</p>\n<p>\"The point is, you deserve better.\" Steve whirls around and looks at Bucky, waterlogged and dripping on the tile floor. \"You shouldn't be treated like something sub-human. That's not good for you. Especially not right now.\"</p>\n<p>Bucky stares at him as he struggles to stand. \"Fuck you,\" he says quietly. \"You don't get to tell me what I need.\"</p>\n<p>\"Buck—\"</p>\n<p>\"No, you're not giving orders anymore. You said the word, so now you have to listen to what I have to say.\" Bucky's voice grows in volume and speed. His fists ball at his sides. \"I didn't think you'd get caught up with how this looks on the surface. Sure, maybe to someone on the outside who doesn't know a fucking thing about me, this is pretty messed up. But what they did to me—\"</p>\n<p>\"You don't have to—\" Steve tries.</p>\n<p>\"<i>What they did to me</i>,\" Bucky shouts over him, \"was nothing like this. They ripped into my brain. They forced me to do those terrible fucking things. They hurt me whether I obeyed or not. What does any of that have to do with us?\"</p>\n<p>\"Because I'm taking advantage of you!\" Steve bites out, unable to keep it back any longer. \"Because it's not fair for me to use you like this!\"</p>\n<p>Bucky looks at him. Shakes his head. \"Always such a goddamn martyr,\" he says. </p>\n<p>A faded memory in Steve's mind: two boys in a filthy alley, one tending to the other's busted knuckles. <i>Stupid martyr.</i> He blinks back tears.</p>\n<p>\"Don't call me that,\" Steve says quietly.</p>\n<p>\"If the shoe fits,\" Bucky growls. He's pacing the shower floor now, wet hair and limp penis swinging. \"You don't want to take care of me anymore? Fine. But don't pretend you're doing me a favor, because you're not.\" </p>\n<p>\"Bucky,\" Steve sighs, \"it's not that I don't want to take care of you. It's just—\" He holds the towel tighter around his waist. \"It's not easy when I feel the way I do and you don't feel the same.\"</p>\n<p>Bucky's lips part, and his eyes bore into Steve's. Then, as quick as that look came, it's gone, shuttered away behind a scowl. \"You never even asked me how I felt, asshole,\" he says, and stalks naked and wet past Steve and out of the bathroom.</p>\n<p>Steve doesn't follow him, just stays there in the empty, damp room. Somewhere down the hall a door slams. He covers his eyes with his palm and curses himself.</p>\n<p>The next few days are hard. Bucky was always great at holding grudges, and it seems he's retained that skill even after all this time. Steve walks into a room; Bucky walks out. Steve tries to say something harmless about the weather or the team schedule; Bucky just grunts. Steve reaches out to touch his arm once. </p>\n<p>He doesn't try again. </p>\n<p>\"You sleeping?\" Sam asks him during a sparring match.</p>\n<p>\"Nope,\" Steve says. </p>\n<p>\"Want to talk about it?\" </p>\n<p>Steve just gives him a look. It's not fair to blame Sam, but if Steve hadn't followed his stupid advice, he wouldn't be in this mess. And he wouldn't have lost his best friend. Everything would have just gone on like always.</p>\n<p>(And Bucky would have been miserable, a little voice in his head says. Steve hates that voice, and anyway, Bucky seems pretty miserable now.)</p>\n<p>What he needs is a gesture, something that says <i>I was wrong, I should have listened to you, and I can do better if you give me a chance</i>. Because once he puts aside his guilt and his ego—he sees that Bucky was right. No one can tell him how he should be dealing with everything, not even Steve. And if they both like it and agree to respect each other, what's the harm? </p>\n<p>(He does wonder how Bucky feels, if what they've got is love. Though what is love anyway but a bunch of different ways for people to say <i>I'm with you</i>? It doesn't matter what kind they're dealing with; it doesn't change the fact that Steve would do anything for him. Even getting over himself.)</p>\n<p>That's how Steve ends up at Bucky's bedroom door one night with a gift. It's wrapped in plain white paper, about the size of a shoebox, and it's the only thing Steve could think of when he thought about apologizing to Bucky. </p>\n<p>He knocks. There's no answer. He tries the handle but it's locked. He considers using his security override to let himself in, but this is about trust and boundaries. And right now he has to do a whole lot of respecting of Bucky's. </p>\n<p>He ducks his head closer to the shut door. \"Hey Buck? I know you're in there. It's still pretty early. You asleep?\" </p>\n<p>Silence is the only answer.</p>\n<p>\"I have something for you. I'll leave it out here. I just wanted to say how sorry I am about what happened last week. I was a jerk. So….\" He places the box on the floor and straightens with a sigh. \"Hope you like it. If not, that's fine too. We'll—we can talk about it later.\" His forehead presses against the cool wood of the door. \"I miss you. I miss my friend. I'm here. If you need me.\" </p>\n<p>Steve gives the door one last soft touch with his fingertips before retreating. He goes to his own room, lays on his bed still fully clothed, and stares sleepless at the ceiling, straining to hear any movement down the hall. But of course he hears nothing.</p>\n<p>(Bucky is a professional.)</p>\n<p>He doesn't hear anything until his door opens and Bucky is standing there with the box in his hands. He's dressed for bed, or maybe a workout: no shirt, a too-large pair of Steve's old sweatpants riding low on his hips. His eyes are wide and unblinking. Steve sits up in bed, careful not to move too fast.</p>\n<p>\"Hey,\" he says.</p>\n<p>\"You mean it?\" Bucky reaches into the box and pulls out the collar. It's made of thick black leather, chased with intricate whorls and topped with a little silver bell. There's a paper tag on the buckle that says <i>Be Mine</i> in Steve's loopy cursive. \"Do you <i>really</i> mean it?\" Bucky asks again.</p>\n<p>\"Yeah,\" Steve says, \"I do.\"</p>\n<p>Bucky hitches the box under his arm and pulls out the matching leash. He shakes his head. \"Where did you even find this stuff?\"</p>\n<p>A shrug. \"There's a store downtown. It's kind of their speciality.\" </p>\n<p>A wild eyebrow rises. \"Captain America walked into a blue shop and asked to see their leather selection?\" he asks.</p>\n<p>\"I wore a hat.\" Steve grins. \"Besides, it's a free country.\"</p>\n<p>Bucky cracks a smile too, laughs along while weighing the collar again in his hand. Steve watches him; it's been too many days since he's seen Buck happy. </p>\n<p>\"So you like it?\" he asks, still tentative. </p>\n<p>Bucky fiddles with the collar's bell. A light jangle fills the room. \"I do.\" He looks up, his face pale and drawn. \"You still haven't asked me how I really feel.\" </p>\n<p>\"I know.\" Steve leans forward, rests his crossed arms on his knees. </p>\n<p>\"I just—\"</p>\n<p>\"You don't have to,\" Steve says. \"I understand. There's no words for it.\"</p>\n<p>Bucky looks like he's on the verge of tears for a moment. \"Thanks,\" he says, then ducks his head. \"Will you…?\" He holds out the collar in a silent question.</p>\n<p>\"Yeah. Come here.\" Steve holds out a hand.</p>\n<p>Bucky knee-walks onto the bed and gives Steve the collar, then stretches out his neck for him, chin tipped forward. His eyes meet Steve's. There's nothing there but total trust, and it makes Steve swell with pride to see it. </p>\n<p>He undoes the buckle and loops the collar around Bucky's neck. The skin of Bucky's throat is warm and trembles under his fingertips. Steve takes his time, centering the silver bell just right, testing the fit by sliding his forefinger under the leather. By the time Steve finally buckles it shut, Bucky's eyes are closed and his mouth has fallen open. </p>\n<p>\"Too tight?\" he asks, ready to unbuckle it again. </p>\n<p>Bucky makes a little whine of protest. \"Just right,\" he says. He sits back, kneeling in front of Steve, and the bell makes its quiet music. Bucky's hand comes up to paw at his new collar, fingers exploring the supple leather and cool silver fastenings. \"How does it look?\" he asks, eyes still shut.</p>\n<p>\"It looks okay,\" Steve says playfully.</p>\n<p>Bucky's eyes slit open to glare at him. \"Just okay?\"</p>\n<p>\"Yeah.\" Steve rolls closer as the bed squeaks with his movements. \"You, on the other hand, you're beautiful.\"</p>\n<p>Bucky Barnes does not blush, but he comes close in that moment. \"Quit it.\"</p>\n<p>\"No can do. You're mine now, and that means I get to be sweet on you whenever I want,\" Steve says. He reaches out, cups Bucky's cheek in his left hand, digs his right hand deep into his wild hair. Bucky sighs and goes boneless in Steve's hold. He might even be panting; his hot breath brushes by Steve's wrist in small puffs. </p>\n<p>\"You going to be sweet on me tonight?\" Bucky asks. His eyelids droop, dreamlike, and his voice has slowed to a crawl. He's perfect like this, when he's in the frame of mind that would allow for anything.</p>\n<p>\"Maybe.\" Steve presses a kiss to his forehead. \"Is that what you want? You're not tired?\"</p>\n<p>Bucky gives a little laugh, nuzzling into Steve's open palm. \"You couldn't pay me to sleep right now.\"</p>\n<p>\"Fair enough.\" Steve leans in again, kisses him on the mouth this time. It occurs to him that, for all they've done together, this is their first real kiss. He savors it, drawing out little sighs from Bucky's throat as he holds him in place. He stays there even when Steve's hands leave to grope along the surface of the bedsheets for the leash, still coiled in its box. When Steve clicks it into place on his collar, his shoulders slump in something like relief. </p>\n<p>\"Let me get those clothes off you,\" Steve offers with a soft pat to Bucky's flank, and Bucky lays back to allow him room to tug the sweatpants off his hips. \"Not wearing anything underneath?\" Steve smiles. \"Someone was hopeful.\" </p>\n<p>\"Yeah,\" Bucky pants. His cock, already hard, bobs against his belly, painting it slick with dribbling fluid. \"I almost—\" He bites down hard on his lower lip and looks at the wall. </p>\n<p>\"Almost what?\" Steve encourages. One of his big hands wraps around that hard cock, gives it a squeeze hello. Bucky jerks on the bed, but a sharp tug of the leash—wrapped around Steve's knuckles—calms him down. </p>\n<p>\"I almost came to your door wearing nothing but your present,\" Bucky gasps out, \"but I wanted you to put it on me, so I didn't.\" </p>\n<p>\"You did the right thing. You did good,\" Steve croons, leaning over him to steal another kiss. \"Would you like a little tag for your collar? 'If found please return to Steve Rogers,' maybe?\" He slots himself on top of Bucky, face to face, hand still working on his dick. His jeans scrape and rub against Bucky's bare skin, and his shirt rucks up to his stomach with all the grinding. There's something filthy about Bucky being stripped bare while he's still in his clothes.</p>\n<p>\"Oh, yes.\" Bucky's writhing under him now, practically pinned by his weight.</p>\n<p>Steve nips at his chin, his ear. \"You'd love it if everyone could know, huh? You want the world to see who you belong to.\" </p>\n<p>\"Yes,\" Bucky hisses out between clenched teeth. </p>\n<p>Steve climbs off him in an eyeblink. Bucky freezes, bereft and confused, staring up at him. He's quite a picture, splayed out naked with the lead dangling from his collar. Steve picks it up and gives it another tug. \"Then let's go. I have an idea.\"</p>\n<p>(For once, he's pretty sure this is a good one.)</p>\n<p>The thing is, he could be leading Bucky anywhere. He could drag him downstairs on his leash and parade him in front of the other Avengers, or a gaggle of news cameras, or the sea of pedestrians on 5th Ave. But Bucky doesn't hesitate. He merely climbs off the bed, falls to his hands and knees, and follows Steve out of the bedroom. He crawls, strangely graceful even in these bizarre circumstances. Steve walks backward and pulls the leash along, making encouraging little clicks with his tongue as they go. </p>\n<p>\"That's my boy,\" he says softly. \"That's my gorgeous boy.\"</p>\n<p>The smirk Bucky sends his way should really be illegal. There's nothing quite like those big, beautiful eyes looking up at Steve like he hung the moon <i>and</i> will make a tasty snack later. </p>\n<p>Steve leads him down the hall and into the living room. The big picture window that makes up one whole wall is alive with the twinkling lights of the nighttime city. Steve halts their progress there. </p>\n<p>\"Stand up.\"</p>\n<p>Bucky does so, cock hanging heavy between his legs. </p>\n<p>\"Hands on the glass.\" </p>\n<p>Not even a moment's pause. Bucky places his palms flat on the window, his legs spread wide like he's submitting to an inspection. </p>\n<p>(Which he is, in a way.)</p>\n<p>Steve puts a hand to the small of his back and presses him forward. \"Closer,\" he says, pushing until Bucky is flush up against the window, cheek resting on the glass. \"Now look out there,\" Steve says. He tracks Bucky's eyes carefully as he steps in behind him, looping the slack of the leash around his fist. \"What do you see?\"</p>\n<p>\"New York,\" Bucky whispers. </p>\n<p>Steve hums in acknowledgement. There's a skyscraper across the street from the Tower. It's all offices, and even though it's way past normal business hours, some squares of light are still there, acting as the beacons of some very dedicated employees. Steve's finger taps on the glass an inch away from Bucky's nose, pointing out one such person. \"Look at her,\" he says, and Bucky looks. There's a woman in one of the corner offices, typing away at her laptop. She's far away, so it's hard to make out any details, but Steve can see that her dark hair swept up in a big bun on the top of her head and her suit is a deep violet. </p>\n<p>His lips hug the curve of Bucky's ear. \"Think she might notice you if she looked up from her work?\" He rattles the leash to let Bucky know he expects an answer.</p>\n<p>He sighs out, \"Maybe.\" </p>\n<p>Steve kisses the back of his neck: a reward for an honest response. \"What do you think she'd do if she looked out her window and saw you pressed up against the glass like this, spread out and ready for me?\" </p>\n<p>Bucky whimpers. \"She—she'd watch us.\" </p>\n<p>\"Mmm. Think she'd enjoy it?\" Steve's teeth graze his nape to ground him. </p>\n<p>\"Don't care,\" Bucky moans. \"I only care about what you enjoy.\"</p>\n<p>Steve's grin spreads across the back of Bucky's neck, just above his collar. He lets him feel it. \"Oh, you're so good. You're the best.\" He pulls on the leash to guide Bucky's head around and kisses him thoroughly. He has to; it's got to last him for a while. </p>\n<p>When the kiss breaks off, he takes a step back. \"Stay where you are. Keep looking out the window. Don't move. I'll be back,\" he says. He lets the leash slip out of his hand as he walks away. He doesn't look back to see if Bucky is following his orders. He knows he is.</p>\n<p>It only takes a minute to find the little bottle of lube he keeps hidden in his nightstand, but he stays there in his bedroom for much longer. The anticipation is going to be good for Bucky. Any discomfort will be replaced by the euphoria of relief.</p>\n<p>And if it gives Steve some time to strangle the base of his dick to keep himself from coming in his pants, well, so much the better.</p>\n<p>He returns to the living room to find Bucky where he left him as directed, but with one exception: his hips are most definitely moving. He's practically humping the window pane, wet cock making a streaky mess of the glass. Steve watches him in profile for a solid minute, hands on his hips, until he clears his throat loudly. </p>\n<p>Bucky's hips still. He glances over at Steve with a sheepish shrug. </p>\n<p>\"I told you not to move,\" Steve reminds him. He pads up behind him on bare feet. \"Oh Buck, what am I going to do with you?\"</p>\n<p>\"Literally anything you want?\" Bucky fires back. Then, \"Ouch!\" when Steve's palm smacks him on the ass. </p>\n<p>\"That's right, you smug son of a bitch.\" Steve grins. \"Anything I want. Come here.\" He grabs Bucky's hips and pulls them away from the window until he's bent over, hands still planted on the glass. The leash swings freely from his neck until Steve catches it and unclips it from the collar. Bucky makes a noise of protest, which earns him another slap on his rear. \"Calm down. It'll be back, just be patient.\" </p>\n<p>Steve retrieves the lubricant from the back pocket of his jeans and stuffs the leash there in its stead. \"Here's what's going to happen,\" he says in a low, meditative drawl. \"We're going to get you ready with my fingers. If you can get through this without making a sound—\" </p>\n<p>Bucky's head whips around, his mouth already open in protest. </p>\n<p>\"—starting <i>now</i>—\" Steve adds. Bucky's mouth snaps shut. Steve raises his eyebrows in approval. \"—then maybe you can have my cock. Understand?\"</p>\n<p>Bucky looks to be on the verge of biting the hand that feeds him, but he gives Steve a silent nod. </p>\n<p>The lube is cool and wet in his hand, and he makes sure to slick up his fingers with plenty before sticking it back in his pocket. \"Here's the other rule.\" He drops his soaked thumb down to the cleft of Bucky's beautifully presented ass and rubs there, circling his hole, getting it as wet as he can. \"You get to do all the work.\" </p>\n<p>Bucky shoots another look over his shoulder, his brow knitted in question. Steve gives him a smile. His forefinger teases the very edge of Bucky's hole, and Bucky shudders, but makes no sound. </p>\n<p>\"I'm going to keep my hand here,\" Steve says, \"and if you want it, you're going to have to work yourself onto it.\" </p>\n<p>Ice blue eyes widen, then narrow in determination. Bucky faces forward again and takes a deep breath. His hips ease back slowly as he fucks himself onto Steve's finger. A long exhale escapes his nose, but he doesn't say a word or whimper. Forward, back, forward, back, each time a little easier, a little slicker. The lube squelches filthily as he speeds up. Steve stares down at the perfect sweetheart curve of his ass as it swallows his finger again and again. </p>\n<p>\"Another one,\" he breathes, adding his middle finger to the first. Bucky nearly stutters to a halt at the intrusion, but he breathes through it and keeps going. The only sound in the room is their breathing and the slap of flesh on flesh. Steve brings his free hand to rake along Bucky's spine, worshipping the expanse of his back. \"You're doing so good,\" he says. \"Can you take one more?\"</p>\n<p>It's a trick, but Bucky doesn't fall for it. He just nods silently, his head dropping low between his shoulders, legs shaking. Steve gives him three fingers. Bucky takes them and fucks himself in perfect, silent abandon.</p>\n<p>\"Almost done, Buck.\" Steve glances up, notices that the corner office across the street is dark and empty now. Bucky doesn't seem to care that their audience is gone. He's blazing hot to Steve's touch and dripping with sweat. Steve twists his fingers just a little, and Bucky muffles a groan. It's endearing, how much he wants to please Steve. \"Okay, you can make all the noise you want now. Good job.\" </p>\n<p>His fingers slip free just as a loud gasp falls from Bucky's lips, like he was holding in his breath. \"Please please please,\" he chants in time to his still-rocking hips. </p>\n<p>Steve shushes him and takes out the leash. \"You did all that work for me, now I'm going to take care of the rest for you. Does that sound good?\"</p>\n<p>\"God, yes,\" Bucky whispers. His forehead is pressed up against the glass, his right arm shaking like a leaf while his left holds up all his weight. Steve reaches over the span of his bare back and takes hold of his wrists. Brings them down to the base of Bucky's spine. And wraps the soft leather of the leash around them, binding them together behind Bucky's back. </p>\n<p>\"I know you can break it,\" he whispers. \"Don't.\"</p>\n<p>\"I promise,\" Bucky agrees, nodding furiously. </p>\n<p>It takes a little careful maneuvering: undoing his fly one-handed, juggling the lube. Finally Steve's got his cock out and slicked up, pressed against Bucky's pinked hole. One arm is wrapped around Bucky's middle, and his other hand is tangled into a D-ring on the back of Bucky's collar. The position forces Bucky's back to bow into a U, still bent over, unbalanced on his toes. The only thing keeping him up is Steve's strength, and if the blissed-out look on his face in the window's reflection is any indication, he has no problem with that.</p>\n<p>\"Ready?\" Steve asks. </p>\n<p>Bucky meets his gaze in the mirrored image and nods. Steve slides home. </p>\n<p>They are perfect like this. Steve can barely hang on to his wits, it's so perfect. He fucks into Bucky, relishing the noise their skin makes when they smack together, the helpless moan that leaves Bucky's mouth. Steve falls into a rhythm, and Bucky? He can't do anything but go along for the ride. He's pulled back onto Steve's cock again and again, and still he whimpers for more. Steve obliges as best he can, digging both hands into Bucky's long hair, pulling it back into a tail, and using that as a leash.</p>\n<p>Bucky howls. </p>\n<p>Steve comes first. But that's all part of his plan: the first joyous pulse of orgasm rips through him, sending his hips rocketing forward into Bucky. He pulls Bucky's hair harder, and in the window's reflection, he can see the shocked O of Bucky's mouth. </p>\n<p>\"Your come,\" Bucky whispers. \"I feel it in me.\"</p>\n<p>\"Yeah.\" Steve's hands gentle in Bucky's hair, allowing his head to fall back down. He catches him around the waist to keep him more or less on his feet. \"We're just going to stay here for awhile, okay?\" </p>\n<p>\"Please, I haven't—\" Steve watches the reflection: Bucky's erection is hard and dripping, leaving spots pattered on the floor. \"I need you. Please.\" </p>\n<p>\"Shhh, we're going to stay like this,\" Steve says, blanketing over him to kiss his over-heated shoulder, his neck, his ear. His cock is still inside. It's still throbbing. \"Patience,\" he says, and it's a reminder for them both.</p>\n<p>Bucky squirms on his dick as it softens. A trickle of fluid escapes and runs down the inside of his leg. \"Oh my god,\" he sighs, \"so much come.\"</p>\n<p>\"There'll be more if you behave,\" Steve promises. \"I just need a minute.\" </p>\n<p>Bucky looks over his shoulder with wide eyes. \"You can fuck me again?\"</p>\n<p>Steve covers his grin with another kiss. \"Perks of the serum,\" he says. He unknots the leash, letting it slither to the floor. \"If you're good to go another round, that is.\" </p>\n<p>\"Fuck yes.\" Bucky twists around, touches his face with his newly freed hand and kisses him hungrily.</p>\n<p>Steve breaks free with a bite to Bucky's lower lip. He's hard again, filling up Bucky a second time. \"Reach back, put your arms around my neck.\" </p>\n<p>Bucky does as ordered, his whole torso curving into a beautiful shape as he holds onto Steve. It deserves a minute's admiration, a quick caress, and then Steve takes hold of one sticky thigh and lifts it into the air. He fucks up into Bucky, and it's easy, so easy with the amount of lube and come inside him. He's so wet, even his cock, which is spurting more fluid with every thrust. Steve is very thankful for the window at this moment, which shows him a perfect reflection of Bucky's face and body contorted in pleasure.</p>\n<p>\"Look at you,\" Steve murmurs, reaching around to thumb at his cockhead. \"You're a mess. You look amazing.\" He gives Bucky's balls a gentle squeeze before raising his hand to rest on Bucky's collar. \"Look in the window, Buck,\" he hisses into his ear. \"Tell me what you see.\"</p>\n<p>Bucky's eyes flutter open to stare at their reflections. He's panting for air, little desperate noises escaping him every time Steve grazes his prostate. He watches them move in the window and says, broken and awed, \"You taking care of me.\" </p>\n<p>\"Yeah.\" Steve breathes in the scent of their sweat and his come, kisses Bucky's throat. His hand closes around the supple leather of the collar, not choking. Just holding. His other hand hitches Bucky's leg higher, and Bucky cries out. He's so deep inside him. He's right there. \"Come for me,\" he says, \"now.\"</p>\n<p>Bucky does. He comes untouched, his cock twitching in mid-air, drooling long white strands that pool into puddles at their feet. Steve follows him soon after, pumping into his body with a shudder that wracks them both. </p>\n<p>Breathing is a thing Steve can do much better these days, but he still seems to have a lot of catching up to do. His hand falls from Bucky's throat to his waist, and Bucky goes limp, his arms falling to his sides. Steve chuckles, holding him upright. </p>\n<p>\"You doing okay?\" he asks.</p>\n<p>Bucky's head lolls back against his shoulder. \"I— Yeah. God, yeah.\"</p>\n<p>Looks like Steve's in charge for a little while longer, at least until Bucky gets his brain working again. \"Come on, I've got you.\" He adjusts his hold, letting his softening cock slip out of Bucky with a rush of fresh come. Bucky moans at the sensation. Steve just puts an arm behind his knees and lifts him bridal style, heedless of the mess. </p>\n<p>\"Don't need to be carried,\" Bucky mumbles. \"I can walk.\" </p>\n<p>\"Humor me.\" Steve drops a peck on his slack cheek. They end up back in Steve's bedroom; he's still feeling a little possessive, wants to wrap Buck up in sheets that smell of him. And he likes the look of Buck all laid out on his bed, sticky with come, collar still jangling at his flushed throat. </p>\n<p>Steve gets a damp cloth and wipes him clean. Bucky's nearly asleep by the time he's through, eyes mere slits, breath coming slow and easy.</p>\n<p>\"Such a good pet,\" Steve tells him in a soft voice. He combs his fingers through Bucky's sweaty hair, gently working out a tangle. \"You're my beautiful sweetheart, you know that?\"</p>\n<p>\"Yeah, 'm yours,\" Bucky says through a yawn. \"'m I sleeping in here?\"</p>\n<p>\"If you like.\"</p>\n<p>\"In the bed?\" He cracks open one hopeful eye and looks up at Steve. \"With you?\"</p>\n<p>Steve smiles, shimmies out of his open jeans, shucks off his damp tee shirt. He curls around Bucky, holding him firm against his chest. Bucky's sigh is quiet and happy. </p>\n<p>\"Yeah, Buck.\" He kisses his neck twice, above the collar, then below. \"Here with me.\"</p>"
}