{
  "id": "18010994",
  "url": "https://archiveofourown.org/works/18010994?view_full_work=true",
  "author": [
    "Jazzfordshire"
  ],
  "title": "but then, my homework was never quite like this",
  "rating": "Mature",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "F/F"
  ],
  "fandoms": [
    "Supergirl (TV 2015)"
  ],
  "relationships": [
    "Kara Danvers/Lena Luthor"
  ],
  "characters": [
    "Kara Danvers",
    "Lena Luthor",
    "Alex Danvers",
    "Samantha \"Sam\" Arias",
    "Eve Tessmacher"
  ],
  "additional_tags": [
    "Mutual Pining",
    "Friends to Lovers",
    "science teachers who chaperone clubs together and have sizzling sexual tension",
    "they are BOTH teachers here",
    "this is not teacher student i cannot stress this enough",
    "so much pining you'll think you're in a forest in Vermont",
    "Alternate Universe",
    "there is some SMUT in here so be prepared"
  ],
  "language": "English",
  "series": "",
  "published": "2019-03-05",
  "completed": "2019-04-16",
  "words": "41,138",
  "chapters": "4/4",
  "comments": "1,135",
  "kudos": "12,084",
  "bookmarks": "2,021",
  "hits": "167,335",
  "summary": "<p>“Wait, when you say ‘you’ll be teaching’, you mean…both of us?” Kara asks, sounding more than a little apprehensive. “Lena and I will be teaching it together?”</p>\n<p>Lena’s own apprehension is so high that she’s fairly sure she’s seconds away from hyperventilation, but she’s surprising even herself with how well she’s hiding it.</p>\n<p>“Astute observation, Miss Danvers. It’s clear to anyone in the room that you two have…magnetism.” Cat sounds matter-of-fact, but the casual way she states that other people - both students and coworkers - have noticed how she and Kara interact makes Lena want to sink into the floor and disappear.</p>\n<p>OR</p>\n<p>Kara and Lena are teachers, thirst is abundant, and communication is hard.</p>",
  "notes": "<p>Y'all have Cassie to thank (@mooosicaldreamz) for this one, she gave me the idea and then poked at me until I fucking wrote it so god bless her</p>\n<p>ENJOY THE THIRST</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Choo choo, here comes the tension traaaaaain</p>\n<p>I'm sick as hell and feel like I'm dying so please validate me with comments thanks love you</p>\n<p>:D :D :D</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>&gt;:D &gt;:D &gt;:D</p>\n<p>This is it! The last chapter! TAKE A SIP, BABES</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">more notes</a>.)\n</p>\n<p>What a ride. The response to this has been wild, I hope the ending lived up to everyone's hopes and dreams!</p>\n<p>Hit me up on tumblr @jazzfordshire!</p>",
  "text": "<p>\n<em>High school is more exhausting than Eve expected.</em>\n</p>\n<p>\n<em>It’s not like Eve has been outright hazed or anything – in fact, people seem to be largely ignoring her, too focused on getting through the day themselves. But it’s tiring, constantly trying to act normal and make friends, and she’s absolutely ready for it to be over. </em>\n</p>\n<p>\n<em>Thankfully, she’s made a friend – a pretty girl named Ruby, who saw the tiny rainbow sticker on her binder and smiled in 2<sup>nd</sup> period. There’s even a few people who are <strong>out</strong> in 11<sup>th</sup> and 12<sup>th</sup> grade. Maybe this school won’t be so bad, she reasons. It’s certainly better than 8<sup>th</sup> grade so far – the halls are clean, and the food is better. </em>\n</p>\n<p>\n<em>The second-last class of the day is one she’s been dreading – combined Chem and Physics. Two horrible subjects and way too much math - she’s just going to grit her teeth, take some notes, and try to get through it. But that all goes out the window as she almost trips over her own feet when she sees the teacher. </em>\n</p>\n<p>\n<em>The woman in question has dark hair and pale skin, and she’s dressed to the nines in a crisp blue dress, a tight bun, and sharp heels, rocking up slightly on her toes to write something on the whiteboard. She hasn’t even turned around, but it’s clear by the distracting shape of her hips that this is going to be a long, tortuous semester if it’s going to be spent pretending that she doesn’t now immediately have a huge crush on her teacher. </em>\n</p>\n<p>\n<em>She’s about to try to steal a seat near the back when she spots a second woman who is also definitely not a student – tall and lean, with her hair half-up and half-down in blonde curls. She leans against the lab table at the front in slacks and a tweed blazer, one button conspicuously done up wrong on her shirt. Judging by her age and the whiteboard marker in her hand, she’s a teacher too.</em>\n</p>\n<p>\n<em>Two teachers. Two hot teachers. Two hot teachers who keep stealing glances at each other, giving Eve a strange feeling in her chest.</em>\n</p>\n<p>\n<em>Yeah…definitely sitting at the back.</em>\n</p>\n<p>\n<em>She’s just settling in when she sees her new friend come through the door and grab a seat, turning around to call her over. </em>\n</p>\n<p>\n<em>“Eve, over here! We can sit together!” </em>\n</p>\n<p>\n<em>Oh no.</em>\n</p>\n<p>\n<em>It’s at the front. Ruby wants to sit at the <strong>front</strong>. She has no choice but to follow, slumping into the seat beside her friend and trying not to stare at either of the women at the front of the room. She focuses on to board instead – it reads “Miss Luthor” in tidy writing on the left, and “Miss Danvers” in messier writing on the right. She can guess which is which. </em>\n</p>\n<p><em>Previously, she'd thought that a 'Miss Danvers' taught Bio. </em> <em>She had actually enjoyed that class – the teacher she had thought was Miss Danvers was funny, and nice, with short auburn hair and a pretty smile. She was easy to listen to even when she was talking about amino acids. <strong>This</strong> is clearly a different person. </em></p>\n<p>\n<em>Soon, the blonde teacher clears up the confusion by reaching up with a grin and adding an extra line underneath her name – “The Younger”. </em>\n</p>\n<p>\n<em>Right. Two different teachers with the same name. </em>\n</p>\n<p><em>W</em> <em>hy are there so many hot teachers at this school?</em></p>\n<p>\n<em>When the bell finally rings and everyone has settled, the two women share a look and a smile before Miss Danvers moves forward, clapping her hands and rubbing them together.</em>\n</p>\n<p>\n<em>“Alright, everyone. Who’s ready to get to learning?”</em>\n</p>\n<p> </p>\n<p> </p>\n<p>“Lena! Wait up!”</p>\n<p>Lena rolls her eyes, her clicking heels keeping the same even pace as she hears the telltale <em>clomp</em> of those familiar scuffed Oxfords jogging on the linoleum behind her.</p>\n<p>“And why would I do that?” Lena asks, opening her purse and pretending to rifle through it, if only to have something to do with her hands as the footsteps get closer. Finally she produces a manila folder that she absolutely doesn’t need, flipping through it with what she hopes is very convincing feigned interest.</p>\n<p>“Because we’re going to the same place?” Finally the footsteps catch up with her, and Lena fights against the reliable swoop her stomach does as Kara Danvers falls into step, slightly breathless and grinning. “Cat’s office, right? I saw you were CC’d on the email.”</p>\n<p>Lena sighs, conceding the point. She had also noticed Kara’s name in the email, and she’d been hoping to get to Cat’s office first so that she could settle herself for the irritating effect Kara’s presence always seems to have on her.</p>\n<p>“I suppose I can’t get rid of you now, can I?” she says, her tone intentionally light, and Kara laughs. Her blue eyes crinkle at the corners, and she runs a hand through her messy blonde curls, and there’s a twist in Lena’s gut that has nothing to do with the nerves she’s feeling about being called into her boss’ office before the school year has even started.</p>\n<p>Kara has had this effect – this sweet, heart -pounding, infuriating, <em>distracting</em> effect – ever since the day Lena started this job, fresh from university and full of nerves about teaching physics to high school students. Lena had been in her small office and about to work herself into a full-blown panic attack when someone sporting an incredibly messy bun had poked their head in, looking concerned.</p>\n<p> </p>\n<p>\n<em>“Are you okay?” the strange, disheveled woman asks, stepping inside the almost-empty office and putting a gentle hand on Lena’s shoulder. “I heard someone hyperventilating in here and I had a flashback to my first day.” The woman seems to be about Lena’s age, and she looks like a cross between a hippie and a fortune-teller – the messy hair is paired with solid-framed glasses, a bulky handmade wool sweater, a beanie, and a brightly-coloured woven blanket draped around her shoulders. There’s a pencil stuck in her bun, and her eyes are kind.</em>\n</p>\n<p>\n<em>Lena reacts immediately, furiously wiping her eyes and trying to even out her breathing. </em>\n</p>\n<p>\n<em>“I’m fine. Just nerves,” she says tersely, and the woman nods in understanding.</em>\n</p>\n<p>\n<em>“Do you need some water or anything?”</em>\n</p>\n<p>\n<em>“No. Thank you.” Lena waits a few moments for the woman to leave, but she seems content to keep leaning against Lena’s desk, rubbing small, calm circles on Lena's back. Against her instincts, Lena starts to find it the tiniest bit soothing. </em>\n</p>\n<p>\n<em>So, of course, she shrugs the hand off.</em>\n</p>\n<p>\n<em>“What are you wearing?” Lena blurts out in a horrific attempt to draw attention away from the move, and the woman looks slightly startled. Embarrassed at her outburst, Lena hastily adds, “I mean – is that considered work appropriate? I feel a bit overdressed.”</em>\n</p>\n<p>\n<em>The woman laughs easily, shaking her head. “No, I don’t wear this when the students are here. But this wing of the school is always freezing cold. Don’t tell Miss Grant, but I think the janitor forgets to turn the A/C off here in the fall.”</em>\n</p>\n<p>\n<em>“Why wouldn’t I tell Miss Grant?”</em>\n</p>\n<p>\n<em>“Well, I wouldn’t want the janitor to lose her job!” the woman says as if it’s the obvious answer, and Lena blinks, unsure how to handle the unbridled optimism.</em>\n</p>\n<p>\n<em>“I’m Kara, by the way,” she continues, holding a warm hand out to shake. Lena accepts it, feeling Kara’s fingers fold firmly over hers. Her gut pulls in a way that, while alarming, definitely distracts her from her nerves. Now that they’re standing so close it’s clear that Kara is as attractive as she is eclectic – her eyes are bright behind her thick frames, her smile clear and genuine. Her jawline is as strong as her hands, and kindness seems to radiate from her.</em>\n</p>\n<p>\n<em>“Lena,” she answers, still too overwhelmed to do anything but blink into Kara’s well-proportioned face.</em>\n</p>\n<p>\n<em>“It’s nice to meet you, Lena,” Kara says quietly, with a smile that seems private. Like it’s just for them. It burrows straight into Lena’s chest, and she’s opening her mouth to find some lame reply just to keep Kara from leaving when Kara finally stands, rubbing her hands together. </em>\n</p>\n<p>\n<em>“Well, if you’re sure you’re okay, I’m going to go get ready. My classroom is just next door if you need anything!” Kara points at a door Lena hadn’t noticed before on the far wall. “The door has no lock, so I might come visit sometimes.”</em>\n</p>\n<p>\n<em>And with that, Kara is gone as suddenly as she appeared, and Lena hardly has time to get herself worked up over nerves again before her first batch of students is pouring in and she jumps in headfirst. </em>\n</p>\n<p>\n<em>Later when Lena enters the staff room to see the person she now knows, after some investigation, is chemistry teacher Kara Danvers waving at her from a nearby table, she has to do a double-take. Kara has lost her bulky sweater and is now in a fitted but comfortable-looking blazer, her hair in a much tidier ponytail, and Lena starts to get the first inklings of the feelings that will later be as familiar as her own reflection.</em>\n</p>\n<p> </p>\n<p>Kara had seemed to take that first interaction as an indication that Lena needed a <em>friend</em>, and she’s been steadily battering Lena’s defenses ever since.</p>\n<p>Now, with Kara strolling into her classroom through their adjoining door on a daily basis, it’s difficult to ignore the way her heart flutters at Kara's presence. Even when the reason she’s strolling in is because there’s a huge smoking scorch mark on her pants or she’s bleeding from the hand, and <em>‘the nurse’s office is too far, Lena. I just need a band-aid!’</em></p>\n<p>Instead, Lena just patches up whatever small injury Kara has managed to inflict on herself that day, and does everything in her power to <em>never</em> be alone with her.</p>\n<p>Usually when the halls are bustling with students and there’s classes to teach and crowds to blend into, that isn’t a difficult task. But now, with the only sound in the building being the blend of their echoing steps, there’s nowhere for Lena to run.</p>\n<p>And with Kara looking like <em>that</em>, with her bright smile and her shirt tucked into her tight khakis and her hair loose and curly, Lena can’t be held responsible for her actions.</p>\n<p>“So…” Kara ventures, nudging Lena gently with her shoulder. “How was your summer?”</p>\n<p>“Fine,” Lena grinds out, finally putting the folder back in her bag. At Kara’s expectant look, Lena sighs. “I planned new lessons for this year, made some new strategies to make your students switch over to Physics, my brother told me I was wasting my potential and tried to get me to work for the family company. You know, the usual.”</p>\n<p>Kara snorts, shaking her head. “Firstly, good luck with that – chemistry is king, and you know it. And secondly, your brother’s a dummy.”</p>\n<p>“My brother is a genius,” Lena corrects, and Kara just grins.</p>\n<p>“Well, he’s not as smart as you, which means he’s a dummy.”</p>\n<p>At Kara’s goofy smile, Lena can’t help but crack one of her own. “So, everyone less intelligent than me is a dummy?”</p>\n<p>“Exactly.”</p>\n<p>The word is delivered with complete seriousness, and Lena laughs, shaking her head.</p>\n<p>“You’re so strange.”</p>\n<p>“And you’re not wasting your potential,” Kara fires back, the ever-present, infuriating kindness in her gaze making Lena almost ready to believe her. “The kids love you! You’re inspiring young girls to like science.”</p>\n<p>“<em>I’m</em> inspiring them?” Lena scoffs, falling back on her usual tactic when it comes to talking about her feelings – deflection. “Half of your classes end the year completely in love with you.”</p>\n<p>“And you think your classes don’t have crushes on <em>you</em>, Miss Perfect Bone Structure?”</p>\n<p>“What -?” Lena chokes, but before she can finish the question, they’ve arrived at Cat’s already-open office door. Cat’s voice rings out from inside and Lena straightens, frantically trying to push back all the thoughts that arose inside her traitorous brain with Kara’s unexpected compliment.</p>\n<p>“If you’re finished with your flirty banter, feel free to come in.”</p>\n<p>Feeling her face heat up at Cat’s perpetual bluntness, Lena hurries past Kara and takes a seat in one of the chairs in front of Cat’s desk. Kara follows, and Lena isn’t sure if it’s a comfort or a curse that Kara looks exactly as red as Lena feels.</p>\n<p>“I’m going to keep this brief, ladies,” Cat says as soon as they’ve settled into their seats. Lena crosses her legs primly, straightening her posture in preparation for whatever Cat has deemed important enough to call a meeting – in her focus, she entirely misses the way Kara’s eyes follow the movement of her calves.</p>\n<p>“Our school leads the entire state in number of students going into STEM fields, especially girls. I would like to capitalize on that success,” Cat announces matter-of-factly, and Lena blinks owlishly at her.</p>\n<p>“What do we have to do with that?” Lena asks, feeling like she’s missing something.</p>\n<p>Cat rolls her eyes. “Why do you think we have so many girls going into STEM, Miss Luthor?” she asks, a challenging eyebrow raised. Lena shrugs, offering the easiest explanation.</p>\n<p>“Because we have so many science and mathematics classes available?”</p>\n<p>Cat shakes her head, her fingers lacing together in a steeple in front of her face. “You can throw as many science classes at high school students as you want, but you can’t make them enjoy it. The reason we have such a high concentration of graduates going into science and engineering programs is because of their <em>teachers</em>.”</p>\n<p>“Miss Grant –“ Lena starts, but Cat holds up a hand, clearly not finished with her tirade. It takes every scrap of willpower Lena has not to look over at Kara, whose smug, knowing gaze is boring into the side of her head.</p>\n<p>“We have some of the country’s finest teachers at this establishment, Miss Luthor, and you two are among the most universally beloved by our students. For god’s sake, you two chaperone half the clubs in the department.”</p>\n<p>It’s true – she and Kara are the teacher chaperones for the science club, the Mathletes, and strangely enough, the chess club. It’s not strange for Lena, of course, as a well-established chess prodigy – there’s no point being modest, when she swept every competition in the western hemisphere before the age of 16 – but Kara is notoriously terrible at it. When Lena pokes at her for losing almost every match, even to the rookie players who joined only recently, she just grins and claims that she’s <em>here to learn, Lena.</em></p>\n<p>“This year we’re going to be starting a new pilot program – a combination class aimed at our incoming 9<sup>th</sup> grade students. An introduction to the sciences that most students find intimidating. You’ll be teaching it,” Cat continues, and finally Kara’s eyes leave Lena’s face, and she seems to clue in on her intent.</p>\n<p>“Wait, when you say<em> ‘you’ll be teaching’, </em>you mean…both of us?” Kara asks, sounding more than a little apprehensive. “Together?”</p>\n<p>Lena’s own apprehension is so high that she’s fairly sure she’s seconds away from hyperventilation, but she’s surprising even herself with how well she’s hiding it.</p>\n<p>“Astute observation, Miss Danvers. Yes, you’ll both be teaching it. It’s clear to anyone in the room with you that the two of you work well together. You have…magnetism.” Cat sounds matter-of-fact, but the casual way she states that other people - Both students and teachers - have noticed how she and Kara interact makes Lena want to sink into the floor and disappear.</p>\n<p>“Will Alex be involved too?” Kara asks, seeming much less bothered by the observation.</p>\n<p>It’s rare for siblings to teach at the same school, but Lena has always admired the working relationship that Kara and her sister have managed to maintain. She likes Alex – the older Danvers consistently gloats whenever a student transfers from Lena’s physics to her own biology classes, but there’s always an undercurrent of respect between them.</p>\n<p>“I think that three instructors might be overkill, and biology has no issues with enrollment. No, it’ll be just you two. Kara is perfectly capable of teaching chemistry, and you can handle physics.” Cat’s tone says that there’s very little room for argument, and Lena accepts her fate with a curt nod.</p>\n<p>“Right. I’ve created a base curriculum, but I expect the two of you to fine-tune it together to tailor it to your teaching styles before the school year starts,” Cat says, already handing over two binders. Kara takes hers with interest, immediately flipping through to the Chem section, and Lena tries to figure out how the hell she’s going to survive the semester.</p>\n<p>They’re dismissed not long after, Cat waving them off while already dialing into another phone meeting. Lena is left standing in the hallway with Kara, trying desperately to re-calibrate after the events of the last 15 minutes.</p>\n<p>“So…we’re gonna be pretty close this year, huh?”</p>\n<p>Kara’s voice is like a thunderclap in Lena’s brain. Her head whips around to look at Kara in alarm, and something on her face must <em>scream</em> discomfort because Kara immediately backpedals, holding her hands up.</p>\n<p>“I mean, we’re going to be working together a lot! With the new class, and our classrooms being – and we’re going to have to plan, and –“</p>\n<p>Lena snaps out of her daze, waving off the worried explanation and taking a deep, measured breath. “Right. It’s fine, Kara. I know what you meant.”</p>\n<p>“So, do you maybe want to go hang out in my office? To go over lesson plans?”</p>\n<p>What Lena really wants to do is curl up on her couch with a glass of wine – maybe something stronger – and watch a mindless documentary until she passes out from sheer emotional exhaustion. But Kara looks so nervous and earnest and <em>attractive</em> with her wide blue eyes and her lip caught between her teeth, and Lena is nothing if not weak.</p>\n<p>She nods, and Kara’s smile is almost enough to make her forget that she shouldn’t be happy about this.</p>\n<p>Kara, for her part, seems to be genuinely excited about this new development. She has Cat’s binder open again, and she has all the confidence that Lena doesn’t feel.</p>\n<p>“I think this is going to be really great!”</p>\n<p> </p>\n<p> </p>\n<p>“This is going to be <em>terrible</em>, Alex.”</p>\n<p>Kara throws her shopping bags into Alex’s backseat, flopping into the passenger seat and buckling up. The car engine revs and Alex, ever the big sister, only laughs at Kara’s anguish as they pull out of the mall parking lot.</p>\n<p>“It’s going to be <em>fine</em>.”</p>\n<p>“How? <em>How</em> is it going to be fine? I have enough trouble not staring at her 24/7 normally. Now I have to watch her teach and somehow keep it together?” Kara lets her head hit the seat, groaning. “She’s <em>amazing</em>.”</p>\n<p>Alex rolls her eyes, but it does nothing to sway Kara’s opinion. Lena Luthor is, without a doubt, the most fascinating person Kara has ever met. She’s thought so since the day they met, when Lena was almost hyperventilating in her new office and Kara happened to be walking by. She had initially just wanted to comfort whoever was having such a bad day, but when she saw that the person in question was possibly the most beautiful woman that’s ever graced the halls of National City Prep…she might have put a little bit of extra effort in.</p>\n<p>She’s only human.</p>\n<p>Little did she know, Lena is also kind and funny and caring and undeniably <em>soft</em> under that aloof shell, and she was basically screwed from day one.</p>\n<p>“Isn’t this, like, the best possible outcome? You’ve had a thing for Lena ever since her first day,” Alex says, swatting Kara’s hand away from the cupholder. “Hey! <em>My</em> latte. Hands off.”</p>\n<p>Kara huffs, crossing her arms after her sneaky pilfering is intercepted. “Yeah, exactly, Alex. I have a thing for her. I’ve <em>always</em> had a thing for her, but nothing can happen. I thought I’d be fine, but then we started planning lessons and she’s so smart and I now have to spend every day watching her lecture in those dresses and those <em>heels</em> and –“</p>\n<p>“What do you mean, nothing can happen?” Alex interrupts, frowning and waving a hand. “Why not?”</p>\n<p>“She’s a coworker!” Kara says, but Alex only scoffs.</p>\n<p>“So? That didn’t stop James and Winn, last year. Or James and Lucy, the year before. Come to think of it, James needs to calm his ass down.”</p>\n<p>Kara purses her lips. “Yeah, but Lena is different. She deserves better.”</p>\n<p>“Better than what?”</p>\n<p>“Better than <em>me,</em>” Kara finally admits, her voice raising slightly. “Lena is…she’s a genius. She could change the world, Alex. She’s probably <em>going</em> to. Her brother wants her to go work for LuthorCorp, instead of teaching. And, being with someone like me…I’d just bring her down.”</p>\n<p>The thoughts spill from her mouth like spontaneous word-vomit, thoughts she’s had ever since she snuck into the back of Lena’s third-period Robotics class and watched her in her real element. Robotics is by no means a common elective in high schools but Lena fought hard to be allowed to offer it - and the moment Kara saw the way she captured her students’ interest by flawlessly programming a robotic arm to use ASL, Kara knew that Lena was destined to do amazing things.</p>\n<p>Alex is quiet for a few moments after her outburst, and Kara chews on a thumbnail, staring at the passing trees outside the window.</p>\n<p>“Wow, Kara. I didn’t know you felt that strongly,” Alex says softly, taking her eyes off the road for a moment to look at Kara in concern.</p>\n<p>“Yeah,” Kara sighs, rubbing her face. “And besides, I don’t even think she likes women. She never talks about dating.”</p>\n<p>Alex snorts, and Kara glances at her sharply.</p>\n<p>“What?”</p>\n<p>“Nothing, kiddo. I just think Lena probably leans towards women more than you think,” Alex says vaguely, and Kara’s eyes narrow.</p>\n<p>“Based on what?”</p>\n<p>“Intuition,” Alex answers cryptically, shrugging.</p>\n<p>“That’s not helpful.”</p>\n<p>“Did I say I was here to help?”</p>\n<p>Kara rolls her eyes, continuing on with her previous train of thought. “Whatever. So, like I said, this year is going to be torture.”</p>\n<p>“Well,” Alex says finally, patting Kara on the leg sympathetically, “You said you were thinking about leaving at the end of this year anyways, right? Maybe this is the push you need to finally try out journalism.”</p>\n<p>“Maybe,” Kara says quietly, and thankfully Alex takes the cue. The rest of their drive is quiet, and Kara can focus on how the hell she’s going to survive the semester.</p>\n<p> </p>\n<p> </p>\n<p>Their first class together is...an experience.</p>\n<p>It’s hard, usually, to get a class full of fresh-faced 9<sup>th</sup> graders to care about a mandatory science credit. But with the two of them working together, a rhythmic give-and-take, they don’t provide an opportunity for the students to check out. It’s so much easier to keep everyone engaged with Lena there, being her beautiful and firm self, while Kara can lighten the mood and get their affection.</p>\n<p>A few of the kids are even smiling when they leave, including the blonde girl in the front row who looked like she was about to have a heart attack when the period started. The girl – Eve, Kara remembers from taking attendance – spares a last lingering glance at Lena as she slips out the door, and Kara chuckles knowingly.</p>\n<p>\n<em>Another student falls victim to the Luthor effect.</em>\n</p>\n<p>Not that Kara is immune either, in all fairness, she concedes as her eyes are drawn to Lena’s hips in that blue dress.</p>\n<p> “That didn’t go so badly, right?” Kara grins, throwing her marker into the air and catching it again. “I think they liked us together.”</p>\n<p>There’s only 5 minutes between periods, meaning that Kara should probably be going back to her own classroom to prepare for her next class, but as per usual she’s finding it difficult to stop her conversation with the brunette.</p>\n<p>“Well, they certainly seemed to find it amusing that your shirt has been mis-buttoned for the last 50 minutes.”</p>\n<p>Kara looks down, stomach sinking with the dawning realization that Lena is right – her second button is in the third button-hole, meaning her whole shirt is slightly crooked.</p>\n<p>“And you didn’t <em>tell me?” </em>Kara groans, looking down at herself despondently. It’s not a huge deal, really – her shirt is tucked in anyways, so it’s almost not noticeable – but it is a pain in the ass and she’s already brainstorming on how to get Lena back for the prank.</p>\n<p>Lena snorts, hiding her grin behind her hand. “And miss out on seeing your face right now? Absolutely not.”</p>\n<p>Kara sighs, shaking her head playfully in Lena’s direction and pulling her shirt away from her waistband. “You know what, I am totally going to Cat after this and telling her you’re creating a hostile work environment.”</p>\n<p>She makes sure to actually look down at what her fingers are doing as she quickly unbuttons her shirt and buttons it back up <em>properly </em>this time – and she only raises her head back up in alarm when she hears a small, choked noise. She looks up to see Lena’s back is now to her, dark hair twirling as she spins on her heel. With alarming gusto, she picks up the eraser on the table and starts to clean the whiteboard with what Kara can only describe as a manic precision.</p>\n<p>Weird.</p>\n<p>Thankfully, Kara is finished with her buttoning when the 2-minute bell rings, and the first of Lena’s senior Astronomy students start to file in. Some of them grin and wave, knowing Kara from years previous or from one of the clubs she chaperones, and Kara waves happily back and asks a few about their summer while Lena seems hell-bent on ensuring there isn’t a single speck of marker left on the board.</p>\n<p>Finally the period bell rings, and right on time a student pokes their head through the conjoining door from Kara’s classroom. When she sees Kara leaning against the lab table and Lena finally turning back around with slightly reddened cheeks, she grins in a way that Kara notices is just <em>slightly</em> too knowing.</p>\n<p>“It’s 2:30, Miss Danvers.”</p>\n<p>“Oh, shoot!” Kara exclaims, straightening up. She tosses the marker to Lena, who barely catches it - the plastic bounces between her shaky hands until she finally pins it to her abdomen.</p>\n<p>“Gotta go! Geology don’t teach itself.” Kara jogs over to the adjoining door, turning around and shooting finger guns at Lena with a wink as she backs through it. “See ya tomorrow, partner.”</p>\n<p>Lena’s students titter, and a few of the familiar mathletes sitting in the back noticeably lean over to each other and start to whisper. Lena, seeming to have recovered from her frantic board-cleaning, shakes her head at the cheesy joke. She claps her hands, and immediately a hush falls on the class. The door stays open just long enough for Kara to hear her put on her teacher-voice – the one that never fails to make shivers run up Kara’s spine.</p>\n<p>“Okay, everyone, settle down. Today we’re doing an intro to celestial mechanics, and trust me – it is going to need <em>all</em> of your attention.”</p>\n<p>The door swings closed after that, muffling Lena’s stern voice, and Kara rubs her hands together, trying to shove the brunette out of her mind – at least, for long enough to teach her last class of the day.</p>\n<p>“Alright. Who wants to learn about rocks?”</p>\n<p> </p>\n<p> </p>\n<p>Three weeks into her shared teaching experience, Lena is managing better than she thought she would.</p>\n<p>Cat was right in her assessment, it seems – she and Kara do work well together, their banter and slightly different teaching styles seeming to keep the freshmen more engaged than they would be normally. The combination of Lena’s high standards and no-nonsense attitude with Kara’s goofy charm and daily chemistry puns (today, the board reads ‘<em>think like a pro-ton: always stay positive!’</em>) seems to be a hit.</p>\n<p>The class has abnormally high grades so far, and 4 students have even successfully joined the mathletes, a club that’s usually known for being notoriously difficult for 9<sup>th</sup> graders to handle. And, with the exception of what she’s pretty sure was a minor heart attack when Kara <em>unbuttoned her goddamn shirt</em> in the middle of their classroom on day one, the instances of her making an idiot of herself over her attraction to the younger Danvers have been less and less common.</p>\n<p>Of the many differences between their teaching styles, one thing they seem to have thankfully found common ground on is a love for hands-on experimentation as a learning tool. Kara is known for her often-dangerous but always entertaining chemistry labs, and Lena loves any project that can show students the actual real-world applications of physics. It helps them visualize what all the theory can actually be used for, and often they stay more engaged with the content afterwards. Kara has even recently been finding and emailing new physics experiments to Lena, with excited commentary on how they could work them into the curriculum – and in return, Lena has been playing Safety Officer for Kara’s chemistry labs, moving paper away from Bunsen burners and reminding Kara when she has and has <em>not</em> rolled up her sleeves.</p>\n<p>Lena really should have known that eventually, with Kara in the room, one of their experiments was bound to go awry.</p>\n<p>“Lena, stay there! I’m gonna record it!” Kara yells, already sprinting across the field with her phone in her hand. Lena chuckles at her enthusiasm and stays where she is, next to the impressively-sized bottle-rocket the class has managed to construct to demonstrate Newton’s third law of motion. If all goes well, the pressure of the air being pumped into the half-full bottle should propel it into the sky, and the students have a bet going with Kara about how far it will go. She’s not sure what the ultimate prize is, but there’s a jar of calculations (and, she knows, a few guesses) on her desk just waiting to be sorted through.</p>\n<p>Just as Lena hoped, the class seem buzzed about being outside – they drew names to see who would get to pump the rocket, and the student in question is practically vibrating with excitement. A few students are kneeled next to the thing, still decorating it – “KARLENA 1” is written in bubble letters on the side, surrounded by a rainbow of star-shaped stickers. Lena had resisted the title, the first-name portmanteau hitting a little too close to home, but the students had been so insistent that she eventually caved.</p>\n<p>“Okay, ready!” Kara’s distant voice calls – she’s squatting on the grass, her camera angled towards the sky to get the best view of the rocket going up. Shooting her a thumbs-up, Lena turns to Ruby and smiles.</p>\n<p>“Miss Danvers is ready, so it looks like it’s time to launch.”</p>\n<p>Nodding vigorously, Ruby grabs the pump handle and starts to work it. Just as Lena explained in class yesterday, it gets harder and harder to move it as more air fills the small space.</p>\n<p>“So you guys can see, it’s getting more difficult for Ruby to pump. Why is that?”</p>\n<p>Ruby continues in her struggle, and another keen student – Ruby’s friend Eve Tessmacher, Lena remembers – raises her hand.</p>\n<p>“Because it’s reaching absolute pressure?” Eve says, slightly timid, and Lena nods in approval.</p>\n<p>“Exactly – fantastic, Eve,” Lena says warmly, and Eve’s cheeks go pink at the praise. A slight hissing is coming from the bottle now, and Lena knows it’s only a matter of seconds.</p>\n<p>“Okay, everyone, pay attention –“</p>\n<p>Before she can finish, the rocket flies into the air with a loud <em>pop, </em>and the class erupts into a wall of noise. Trailing water in its wake, it arcs over the soccer field and starts to spin, finally starting its descent about halfway between the crowd of students and Kara.</p>\n<p><em>She picked a pretty good spot</em>, Lena thinks absently as the rocket gets closer and closer to Kara and the students yell in excitement.</p>\n<p><em>She should probably move</em>, Lena notes with growing concern as the rocket plummets. It’s falling at an alarming pace now, and Kara doesn’t seem to be moving – she’s looking at her phone screen, grinning as it flies towards her –</p>\n<p>\n<em>Oh, fuck.</em>\n</p>\n<p>Just as Lena realizes what’s about to happen, there’s a sickening crack as the carefully-crafted experiment collides with Kara’s face, and she hits the ground with a thud.</p>\n<p>\n<em>“Kara!”</em>\n</p>\n<p>Lena is running before Kara even hits the ground, all sense of propriety forgotten as she sprints across the grass in heels.</p>\n<p>“Kara, fuck, <em>Kara</em>, are you okay –“ Kara’s glasses lie broken on the dirt beside her, and Lena scoops a hand under her neck to lift her into a sitting position.</p>\n<p>“Crap, crap, <em>crap</em> –“ Kara mutters thickly. She slowly sits up with Lena’s help, a hand held over her face, and a wave of nausea rolls through Lena when the hand comes away covered in blood. Kara’s whole face is stained with it from the nose down, and her eyes are hazy and unfocused, staring somewhere in the vicinity of Lena’s chest.</p>\n<p>“Kara? Kara, look at me.” But Kara’s gaze stays where it is, and Lena snaps her fingers, panic rising in her gut. “Hey, hey! <em>Kara</em>! Look at me.”</p>\n<p>Finally, Kara’s eyes slide up to Lena’s, and Lena carefully holds three fingers in front of her face.</p>\n<p>“How many fingers am I holding up?”</p>\n<p>There are a few moments of silence, and then Kara grins, the blood making it look slightly macabre.</p>\n<p>“Enough,” she says dazedly, and Lena is fairly sure that her entire body blushes as the students start to gather around them, breathing heavily.</p>\n<p>“Jesus <em>Christ</em>, Kara…” she mutters, feeling uncomfortably hot, and thankfully the kids are mostly talking amongst themselves rather than listening to Kara’s probably-concussed rambling.</p>\n<p>“Is she okay?”</p>\n<p>“Holy <em>crap</em>, that’s a lot of blood –“</p>\n<p>“Did you see Miss Luthor run? I <em>told</em> you guys –“</p>\n<p>“Do you think her nose is broken?”</p>\n<p>Kara’s eyes go unfocused again, a cute little frown on her face, and it’s all just a little bit too much with Kara still bleeding and a large bruise forming on her cheekbone. Feeling overwhelmed, Lena snaps.</p>\n<p>“Everyone, go back to class and wait there until the period is over. I’m taking Miss Danvers to the nurse.”</p>\n<p>Her tone brokers no argument, and slowly the students start to file back towards the school building. When she’s sure the attention is off the two of them, she puts a steadying arm under Kara’s and lets her weight fall on it.</p>\n<p>“Can you walk?” Lena murmurs, and Kara nods enthusiastically. Together they stand, taking a large, hopeful step forward –</p>\n<p>And then Kara pitches sideways, almost landing face-first in the dirt.</p>\n<p>“<em>Shit</em>,” Lena mutters under her breath, trying desperately to pull Kara back up. “You know I appreciate your muscles, but why do you have to be so damn <em>heavy</em> –“</p>\n<p>“Do you need help, Miss Luthor?”</p>\n<p>Eve Tessmacher is standing nearby, looking nervous but earnest, and Lena sighs in defeat.</p>\n<p>“Yes, please.”</p>\n<p>Together they manage to haul Kara back up, and the three of them make their slow, tottering way back to the school building behind the rest of the class.</p>\n<p>“Is Miss Danvers going to be okay?” Eve asks. She sounds anxious, and Lena hurries to reassure her.</p>\n<p>“I’m sure she’ll be fine. I think it’s just a concussion. And…maybe a broken nose,” she admits, still rueing the day she agreed to do this experiment. Bottle rockets, with Kara Danvers? Of course someone got hurt. And of <em>course</em>, it was Kara.</p>\n<p>“You seemed really worried.”</p>\n<p>Lena swallows hard, trying not to flinch at the observation. She made a scene earlier, running to Kara like that, and she’s honestly a little bit glad that Kara is too concussed to remember it. “I’d be worried if any of you got hit with a bottle rocket.”</p>\n<p>“Okay,” Eve says, but she doesn’t sound convinced. It doesn’t help that Kara chooses that exact moment to stand perfectly upright, practically wrenching Lena’s shoulder as she does.</p>\n<p>“Ow, Jesus –“ Lena hisses, and Kara looks down at her with a look of awe on her face.</p>\n<p>“Lena!”</p>\n<p>“…Kara?” Lena answers cautiously, hovering close just in case Kara falls over again.</p>\n<p>Kara blinks down at her owlishly, still covered in drying blood. “I got hit in the face with a rocket!”</p>\n<p>“Yes…you did.”</p>\n<p>Kara’s face breaks out into a grin, and she throws a fist in the air. “That was totally <em>awesome</em>!”</p>\n<p>At Kara’s shout, the students still scattered across the field start looking back at their little huddled group. Laughing at Kara’s still-raised fist, some of them yell back.</p>\n<p>“It <em>was</em> awesome, Miss Danvers!”</p>\n<p>“Hell yeah!”</p>\n<p>“Language, Miss Arias!” Lena scolds, and in the distance Ruby winces, looking abashed.</p>\n<p>But Kara is far past caring about language – her hand is still in the air, and she calls back to them. “Yeah! LONG LIVE KARLENA ONE!”</p>\n<p>Lena is slightly alarmed at how delighted their class looks by that sentence.</p>\n<p>Shaking it off, Lena slings Kara’s arm over hers again. “Come on. Let’s get you looked at.”</p>\n<p>She thanks whatever deity is listening that Kara goes quiet after that, letting Lena and Eve carry her to the nurse’s office unimpeded. Eve takes her leave once Kara is settled on the little cot, and Lena perches stiffly on the wooden chair beside the bed while the nurse pages for Alex.</p>\n<p>“You’re staying?” Kara asks in a small voice, and Lena nods, crossing her legs.</p>\n<p>“Until your sister comes to get you.”</p>\n<p>Kara smiles absently, her head lolling from one side to the other. “Am I going home?”</p>\n<p>“I assume you’re going to the hospital,” Lena replies, and Kara frowns, a sweet little crinkle forming between her brows that Lena wants to smooth away with her thumb. Her hand twitching with the urge, but she clenches it into a fist. Even if Kara isn’t going to remember it, she refuses to humiliate herself for the second time today.</p>\n<p>“Can’t you come with me?” Kara asks, and Lena has to bite at the inside of her cheek to keep from smiling at the way Kara is looking at her with wide, trusting eyes.</p>\n<p>“I have to go teach my last class,” she says softly, and Kara’s resulting pout is almost cute enough for Lena to forgive her for getting hit in the face to begin with.</p>\n<p>She gets a few moments to compose herself when the nurse bustles back in, a bowl of soapy water in hand. While she cleans Kara’s bloody face and checks her fairly obvious concussion symptoms, Lena glances at the doorway. <em>Where the hell is Alex? </em></p>\n<p>Clearly, she’s going to have to keep Kara occupied for a little bit longer. Unfortunately the task gets all that much harder when the nurse leaves again, leaving Kara with her hair down, her glasses off, and staring directly at Lena with an unnervingly focused gaze.</p>\n<p>Her eyes are piercing, and her skin is just a little bit red from the wet cloth, and <em>oh my god, she looks so cute. </em><em>Why does she look so cute concussed?</em></p>\n<p>Finally, after at least a full minute of uninterrupted staring that Lena does her best to ignore, she sighs.</p>\n<p>“<em>What</em>, Kara?”</p>\n<p>Kara smiles, looking more coherent than she has since the rocket made contact with her face.</p>\n<p>“Just glad you’re here. You’re so smart. And you’re so…floaty. And…<em>beautiful</em>.”</p>\n<p>Lena’s stomach drops in a way she can’t completely convince herself is unpleasant. <em>Beautiful. She thinks I’m –</em></p>\n<p>Lena nearly jumps out of her skin when the door opens, and Alex Danvers charges through it like she’s on a mission.</p>\n<p>“Kara, what the <em>hell</em> did you do now?”</p>\n<p>Taking the opportunity she’s being offered, Lena stands abruptly, excusing herself and letting Kara’s sister grill her on the circumstances of her injury. She slips out the door unnoticed, drying her sweaty palms on her skirt while she power-walks down the empty hallway.</p>\n<p>So much for things going well so far.</p>\n<p> </p>\n<p> </p>\n<p>“My head hurts.”</p>\n<p>Kara moves the ice pack to the other side of her forehead, squinting at the too-bright sunlight coming through the window. Behind her Alex opens and closes a cupboard, and the noise of it makes her flinch.</p>\n<p>“It would hurt less if you went and had a nap in your nice, dark bedroom like I told you to.”</p>\n<p>“It’s lonely in there,” Kara complains, and Alex sighs, pinching the bridge of her nose.</p>\n<p>“I promised I’d take care of you, but I did not sign up for an endless pit of whining. Go to sleep.”</p>\n<p>Kara pouts silently, her eyes now closed against the light. She hears Alex pour herself a drink and sit on the other part of the sectional near her feet, and the rustle of a book opening. But there are thoughts that have been swirling in her scrambled brain all day, and before Alex has even turned to a new page, Kara has opened her mouth again.</p>\n<p>“Do you think Lena will call?”</p>\n<p>Alex huffs, pointedly putting the book and her mug down. Kara, fully aware of how pathetic her voice sounds, squeezes her eyes shut again.</p>\n<p>“Why would Lena call you?”</p>\n<p>“I don’t know,” Kara grumbles, turning onto her side and hugging a nearby decorative pillow. “To see if I’m okay?”</p>\n<p>“Does she even have your number?”</p>\n<p>“Of course she has my number. We teach a class together,” Kara says grumpily.</p>\n<p>“Has she called you before?” Alex asks, and Kara hates how logical her arguments are. She knows that Lena has no real reason to call her. But that doesn’t stop her from looking hopefully at her phone every few minutes.</p>\n<p>“Well…no. But she could text.”</p>\n<p>“Kara…” Alex’s voice has a thread of pity in it, and Kara groans, pulling the pillow over her face.</p>\n<p>“I know, I <em>know</em>. Just let me wallow, okay? I’m concussed.”</p>\n<p>Alex pats her ankle consolingly, and while she picks her book up again Kara closes her eyes and tries to sleep. But her mind continues on, running in circles around the same few thoughts she’s been obsessing over since she came to on the grass of the soccer field covered in blood.</p>\n<p>She had been dazed, certainly, and there are gaps in her memory – for example, she doesn’t remember most of the walk from the field to the nurses’ office – but she wasn’t completely incognisant that day. She remembers hearing Lena’s voice scream her name, and the warmth of her presence at her side. She remembers the tenderness with which Lena touched her forehead, the way she blushed at Kara’s (stupid, <em>inappropriate</em>, god, she needs to apologize for that somehow) joke.</p>\n<p>She remembers Lena admitting that she appreciates her muscles.</p>\n<p>Flexing absently, Kara makes a plan to kick up her gym time once her headache goes away. Which, based on how difficult sleep is turning out to be, probably won’t be for a while.</p>\n<p>Huffing dramatically, Kara turns over again and stares at the ceiling.</p>\n<p>“Distract me.”</p>\n<p>“With what?” Alex doesn’t even look up at her this time, instead taking a long sip of the steaming mug she’s been letting cool. She’s clearly trying to ignore her. Smiling deviously, Kara puts on a practiced tone of nonchalance when she answers.</p>\n<p>“Well, how about you tell me all about that cute PTA mom you were flirting with on Tuesday?”</p>\n<p>Exactly as Kara hoped, Alex chokes on her drink, spraying some of it across the coffee table.</p>\n<p>“I wasn’t – <em>flirting</em> –“ Alex coughs, her face red from more than just the hot water that’s now dribbling out of her nose. “She just – her daughter is in my freshman class, and she wants to be a parent chaperone for our class trips. That’s all!”</p>\n<p>“Mhm. Okay. Tell that to your face,” Kara says, disbelief in every inch of her voice. Alex flicks spilled tea at her, and she flinches at the droplets. “Hey! I’m <em>concussed</em>!”</p>\n<p>“I was <em>not</em> flirting,” Alex maintains, but Kara knows her sister, and she knows what she saw. She tuned in only at the end of Alex’s conversation with Ruby Arias’ mother when she met Alex to get a ride home, but judging by the dreamy way Alex waved goodbye, there was more than a little flirting happening before she got there.</p>\n<p>And, not that it means anything, but she doesn’t recall seeing a ring on Ms. Arias’ finger.</p>\n<p>Her face must betray her thoughts, because Alex smacks Kara’s calf with her book, pointing a threatening finger. “Hey, I could just leave you here alone. Unlike you right now, I’m allowed to operate a motor vehicle.”</p>\n<p>Kara groans, poking at her with a socked foot. “You wouldn’t!”</p>\n<p>“I would. Don’t test me. Now, go to <em>sleep</em>.”</p>\n<p>Finally she does, lulled by the soft noises of turning pages and Alex’s always-comforting presence – but her dreams are filled with bottle rockets and concerned green eyes, soft hands touching her cheek and her name, shouted in a familiar voice.</p>\n<p>It takes a few days for her headache to really ease, but thankfully by Monday she’s feeling well enough to go back to work again. And just in time, too – parent-teacher conference night is something she’d prefer not to miss, even with a huge purple bruise across her cheekbone.</p>\n<p>Her students seem happy to see her. According to her Chem 3 students, the substitute teacher Ms. Smythe had been ‘boring and mean’ – but no class seems happier than her freshman Integrated Sciences class with Lena. Cat hadn’t bothered to get a sub for her, instead letting Lena take the lead for the few days she was off, so it doesn’t make much sense that they missed her the most; but she comes back to 21 ecstatic students, a cake with a crashed rocket on it, and Lena looking quietly relieved at her presence.</p>\n<p>Even though the cake is her favourite flavour (how they know she loves chocolate cake with raspberry buttercream she has no idea. Maybe they asked Alex), Lena’s smile when she walks through their adjoining door is still the best part of her day.</p>\n<p>At least, it is until the conferences later on.</p>\n<p>Of course, her interviews go well – she doesn’t really have any problem students, and all the parents she meets seem perfectly nice. And slightly later, when she and Lena are doing joint interviews for their shared class, it’s great to hear the positive feedback that the freshmen’s parents have for them, about how their teaching has made their kids interested in science for the first time.</p>\n<p>But the best part of it isn’t seeing her students or meeting their parents or the praise – it’s the way that Lena touches her arm as the night is winding down, how she leads her into a quiet hallway off the gymnasium where all the little stations are set up and raises a gentle hand to the bruise on her cheek.</p>\n<p>“It looks worse than it feels,” Kara jokes quietly, and Lena smiles softly, her fingers trailing over the warm skin. Instinctively Kara moves her face towards them, and as if she’s only just realized exactly what she’s doing, Lena pulls her hand away quickly, clenching it at her side.</p>\n<p>“It looks pretty bad.”</p>\n<p>Kara shrugs, leaning against the wall on her left. “The worst of it was when I was still all bloody. Thankfully, my nose didn’t break.”</p>\n<p>“I still feel a little guilty that it was my experiment that got you hurt,” Lena admits, and Kara shakes her head.</p>\n<p>“It wasn’t your fault I was looking at my phone and not the object hurtling towards my face,” she deadpans, and Lena chuckles, moving closer and leaning as well. She ducks her head, a curtain of black hair obscuring part of her face.</p>\n<p>“I thought about calling you. To see how you were feeling.”</p>\n<p>Kara’s heart leaps into her throat.</p>\n<p>\n<em>Vindication! Take that, Alex -</em>\n</p>\n<p>“Why didn’t you?” is what she says instead, in a much more measured tone. Lena looks back up, and suddenly she realizes exactly how close they’re standing – their chests are almost touching, and she’s close enough that she can smell Lena’s perfume, something light and floral and probably expensive. Lena’s eyes are wide and so, <em>so</em> green, and when she exhales shakily Kara can feel the warm breath wash over her skin.</p>\n<p>“I…“ Lena whispers, her eyes flickering down –</p>\n<p>One of the gym doors opens with a slam, several couples and a few kids spilling out and heading towards the doors to the parking lot down the hall, and Lena jumps back as if she’s been electrocuted. Tucking her hair behind her ear with a shaky smile, she side-steps around Kara and heads towards the now-open door, heels clicking rapidly.</p>\n<p>“Lena –“ Kara calls, frowning at the interruption, but Lena slips through the crowd and back into the gym easily, and Kara is left standing alone in the hallway.</p>\n<p>The moment stays with her for the rest of the night, even though Lena seems determined to avoid her afterwards. It preoccupies her through the rest of her parent meetings, and it’s distracting enough that she doesn’t even gather the energy to tease Alex about the fact that she’s spent 45 minutes leaning against her table and clearly flirting with Ruby’s mom.</p>\n<p>She does, however, give an encouraging smile and a thumbs-up to Ruby herself, who is standing nearby with a mischievous look of dawning realization on her face.</p>\n<p> </p>\n<p> </p>\n<p>The early October breezes are carrying a chill now, crisp leaves skittering across the pavement under her feet when Lena makes the quick walk from her car. She gathers her coat around herself, shivering absently as the wind picks up, and behind her she hears what she’s been hearing almost every morning since September – Kara’s shoes hitting the pavement at a quick jog until she gets to Lena’s side, her sunny smile making Lena’s day a tiny bit brighter.</p>\n<p>“Morning, Lena!”</p>\n<p>As usual, Lena lets Kara grab the door and hold it open for her, and at this point she can almost pinpoint the exact moment when Kara will say -</p>\n<p>“Ladies first!”</p>\n<p>Smiling to herself, Lena steps through the door like she always does, and Kara falls into step behind her.</p>\n<p>“Good morning, Kara,” she says finally, and Kara grins, her long legs catching up to Lena’s pace.</p>\n<p>“How’s your day so far?”</p>\n<p>Lena takes a sip from her travel mug, the hot coffee brightening her day even more. “It’s barely started, but so far, it’s acceptable.”</p>\n<p>When they reach the science hallway Kara follows her into her classroom and sets her leather messenger bag on the floor, another frequent feature of Lena’s morning, and Lena sets her coffee down on the lab table before shucking out of her jacket, hanging it on the hook near her office door.</p>\n<p>“Lena!” Kara sounds surprised, and Lena turns around, expecting something out of the ordinary.</p>\n<p>“What?”</p>\n<p>Kara takes her own coat off, laying it on the desk, and reveals the outfit underneath. She’s wearing –</p>\n<p>Jeans. <em>Tight</em> jeans.</p>\n<p>Tight skinny jeans, a comfortable-looking long sleeved shirt, and sneakers. She looks slightly ruffled and soft and <em>oh, god</em>. She should have remembered.</p>\n<p>“It’s Casual Day! Did you forget?”</p>\n<p>Lena turns around and heads to her office, needing a few moments to not be looking at Kara Danvers in <em>jeans</em>. Unfortunately Kara follows her, and her respite is short-lived. Kara perches on the edge of her desk, and Lena is forced to continue the conversation as if she isn’t completely overwhelmed by the miles and <em>miles</em> of fitted denim in her field of vision.</p>\n<p>“I’m already wearing <em>pants</em>, Kara,” she says, gesturing to her tailored dress pants and silk shirt and trying for levity. Kara looks downright scandalized.</p>\n<p>“You’re wearing – is that <em>casual</em> for you?”</p>\n<p>It’s not, of course. Lena enjoys comfortable clothes as much as the next person – she has sweatpants and tank tops at home, flannels and soft shirts – but the thought of wearing them to work makes her feel uncomfortably exposed. Her clothes are a part of her armour, her usual pencil skirts and blouses and heels giving her a sense of control over her day, and wearing pants – even tailored dress pants – actually is a bit outside of her usual comfort zone. She smooths the pressed fabric with a clammy hand.</p>\n<p>“It’s casual enough,” Lena insists, but Kara shakes her head.</p>\n<p>“It truly isn’t,” Kara says firmly, and she disappears towards her own classroom. Lena takes a deep breath, trying to organize her thoughts, but before she can even begin Kara is coming back with a bundle in her hand. It’s gray, and soft-looking, and she shoves it into Lena’s hands with an expectant look. “Here.”</p>\n<p>The bundle droops when Kara grabs it, the fabric unfurling and almost touching the ground.</p>\n<p>“What’s this?”</p>\n<p>“It’s a sweater, genius,” Kara grins, and Lena holds it out in front of her, looking it over. In blue print it reads “National City University” with a school crest.</p>\n<p>Kara wants her to wear her school sweater.</p>\n<p>“Okay,” Lena drawls, thankful that she sounds much more casual than she feels, “What are you expecting me to <em>do</em> with it?”</p>\n<p>“It’s casual day, Lena!” Kara is already leaving, the door swinging shut behind her as the bustle of students entering the school starts to infiltrate the room. Lena brings the sweater up to her face, inhaling deeply – it smells like clean detergent and something else, something she recognizes but can’t place. A Kara-smell – probably what Kara’s apartment smells like. The thought makes her stomach swoop.</p>\n<p>Against her better judgement, Lena puts it on.</p>\n<p>Of course, the difference is noted immediately. As her Junior Physics 2 students file in, all dressed in their own casual clothes, someone makes the astute observation that her clothes are out of the ordinary.</p>\n<p>“NCU? Didn’t you go to MIT, Miss Luthor?”</p>\n<p>Lena’s two framed degrees on the wall behind her desk confirm the statement, so she nods, artfully deflecting.</p>\n<p>“I did, yes. Apparently Miss Danvers thought my ‘casual Friday’ wasn’t going hard enough.” The droll comment garners a laugh from the class, and with the comment squared away, Lena gets started on her planned lesson in Kinematics.</p>\n<p>She’s halfway through explaining non-uniform motion when there’s a swell of loud laughter from next door. Her students are jarred from their own note-taking by the sound, and Lena sighs, knowing what’s coming next.</p>\n<p>As if on cue, the door between their classes opens and Kara strolls in, her entire left sleeve missing to the elbow and smoking slightly at the edges. Kara herself seems alarmingly calm, smiling and waving at some of the familiar students.</p>\n<p>\n<em>Oh, Jesus -</em>\n</p>\n<p>Immediately Lena rushes towards her, rolling the sleeve up to Kara’s bicep and checking the skin of her forearm for damage. Shockingly, she seems fine, except for a few small red patches where the arm hair has been burnt off.</p>\n<p>“Kara, what on <em>earth</em> –“ she says, almost disbelieving that Kara could manage burning her entire sleeve with so little damage to her skin. Kara waves her off, her singed sleeve sliding  back down her arm with the movement.</p>\n<p>“Oh, it’s fine! We were working on lab safety and combustion today, and –“</p>\n<p><em>“Lab safety?”</em> Lena says incredulously, a brow neatly arched, looking pointedly at Kara’s still-smoking shirt.</p>\n<p>“Yes!” Kara says, as if Lena is the one not making sense. “And clearly, the students have now seen what <em>not</em> to do, so mission accomplished, right guys?” Kara addresses Lena’s class, winking, and they giggle as Lena rolls her eyes. If she weren’t so preoccupied with checking Kara for burns, she might have noticed the way some of them exchange knowing looks, whispering and grinning.</p>\n<p>Kara, for her part, seems unperturbed by the whole situation. She rolls her half-sleeve back down when Lena has satisfied herself that there’s no serious injuries, and she starts hunting around behind Lena’s bench.</p>\n<p>“Anyways, Lena, did I leave my blazer in here?”</p>\n<p>Inwardly, as Kara jokes about her clumsiness and digs through Lena’s cupboards, Lena curses the day her traitorous brain decided to latch onto Kara Danvers.</p>\n<p>When Halloween rolls around at National City Prep, Lena can usually be counted upon to be the only teacher not in the spooky holiday spirit.</p>\n<p>She’s never liked Halloween – the pressure to wear tacky costumes and go to parties and eat candy never called to her – so she usually only allows the most basic decoration in her classroom, and she certainly never dresses up.</p>\n<p>This year, with Kara ‘spirit day’ Danvers involved, she should have known that things would change. Now, instead of going home promptly at 3:15, she’s helping James’ art club hang orange and black streamers and pumpkin decals all over the school.</p>\n<p>“Lena, how many times – ask someone to stabilize your ladder! You could fall!” Kara says frustratedly, dropping her own armful of decorations to rush over and grab the base of Lena’s ladder. “You can’t expect the students to do stuff safely if you’re running up and down like crazy!”</p>\n<p>“I want to get this <em>done</em>, Kara,” Lena says pointedly, putting another piece of tape on the black cat cut-out she’s holding and slapping it haphazardly onto the wall. “It’s 4:30.”</p>\n<p>”Come on! This is for the students!” Kara says, winking and handing Lena another decal. With one foot on the base of Lena’s ladder and an arm flexing as she reaches up with a handful of decorations, Kara looks unfairly attractive, and Lena is suddenly grateful for the stabilization because she feels a little bit dizzy.</p>\n<p>“So, are you finally going to dress up this year?” Kara asks, while Lena busies herself adding tape to a line of streamers. “You could be…I don’t know, Oscar the Grouch?”</p>\n<p>“Hey!” Lena protests, throwing a ball of ripped streamer in Kara’s direction and scowling. “I’m not <em>grouchy</em>, I’m just –“</p>\n<p>“Grouchy,” Kara deadpans, and Lena has to laugh.</p>\n<p>“Grown-up,” she counters, and Kara scoffs, waving her off.</p>\n<p>“You can be grown up and still love holidays!”</p>\n<p>Lena just shakes her head, hanging a paper witch riding a broom from the drop ceiling.</p>\n<p>“As a matter of fact, I am dressing up this year,” Lena hints, grinning when Kara’s eyes widen in excitement.</p>\n<p>“Really? What’s your costume?” Kara asks as Lena finally descends the ladder, deeming her patch of wall adequately decorated.</p>\n<p>“It’s a secret.”</p>\n<p>Kara groans as Lena dismounts, dusting off her hands. “Oh, come on, Lena!”</p>\n<p>“You’ll find out on Thursday,” Lena says, and to her intense relief, just a moment later James announces that everyone can go home.</p>\n<p>Usually, Lena avoids dressing up. She’s more the type to slap something on last-minute, something low-effort and easily taken off. But this year, she really has found the perfect thing.</p>\n<p>When Thursday finally dawns, she straightens her glasses as she looks over herself in the mirror, adjusting the strap of her leather messenger bag and smiling with satisfaction. Her hair is half-up and curled, she’s wearing men’s shoes with chinos and a tweed blazer, and the nametag sticker on her chest reads “The Younger”.</p>\n<p>Their students are going to eat it up, and Lena can’t wait to see the look on Kara’s face.</p>\n<p>The hallways are full of vibrant costumes when Lena arrives, so much so that nobody seems to notice her understated one. In fact, nobody seems to recognize her. Even students she’s taught for years barely give her a second glance, and when she gets to her office she looks down at her own outfit with a grin.</p>\n<p>Go big or go home, right?</p>\n<p>She and Kara had promised a Halloween-themed class for today, and she gets to work on setting up all the components of their little experiments while the students start to filter in. Just as she suspected, they love her costume. Most of them compliment her on it, laughing at the various elements and at Lena’s brief Kara impression – leaning back against the desk and throwing a marker in the air before pointing it at the front row and drawling <em>‘I make bad chemistry puns, but only…periodically.’</em></p>\n<p>“Miss Danvers is gonna flip!” Ruby giggles, elbowing Eve and pointing at Lena’s outfit. Eve just blushes crimson, staring resolutely down at her desk.</p>\n<p>Lena is actually starting to get a little bit concerned about where Kara could be when she finally bursts in the door, throwing her bag onto the lab table.</p>\n<p>“Sorry I’m late, everyone. This skirt is a real pain, I <em>hate</em> it, I don’t know how some of you guys wear it all day –“</p>\n<p>Lena looks up from writing the day’s experiments on the whiteboard at the sound of Kara’s voice, and if she’d still been holding her coffee mug, it would likely be in several pieces on the floor by now.</p>\n<p>Kara is, inexplicably, wearing a school uniform.</p>\n<p>White shirt, knee socks, tartan skirt, the whole nine yards – upon being faced with the section of bare skin between Kara’s mid-shin and lower thigh Lena’s brain does a hard reboot, and the few seconds that it takes to shove it back into the recesses of her mind where it belongs she struggles to form any kind of reaction that isn’t nonverbal questioning noises.</p>\n<p>Kara looks distinctly out of place in the outfit, the skirt not suiting her at all, and she's still wearing her Oxford shoes; but it still takes Lena a solid few moments to recalibrate. Kara is wearing it as a joke, the girlish clothes as much a costume to her as Alex’s polyester hot dog outfit, and the sight of it on anyone else probably wouldn’t phase Lena at all. But the fact remains that Lena has never seen this much of Kara’s revealed skin before. And she’s never going to be able to <em>unsee</em> it. </p>\n<p>Thankfully Kara is distracted for a few moments by the class’ reaction to her costume, and Lena takes a shaky sip of water and collects herself as much as she can.</p>\n<p>“Lena!” Kara says finally, looking her up and down and laughing with delight. “Oh my god, you’re <em>me</em>!”</p>\n<p>Lena tries to school the shakiness out of her voice when she replies. “I figured the best way to get into the spirit of Halloween was to dress up as the holiday’s biggest supporter, right?”</p>\n<p>“It’s <em>amazing</em>! Where did you get the glasses?” Kara asks, her eyes glued to the accessory on Lena’s face. Lena touches the thick frames self-consciously.</p>\n<p>“They’re mine, actually.”</p>\n<p>Kara blinks slowly. “You…wear glasses?” Her voice sounds a little faraway, somewhat dreamy, and Lena’s stomach swoops at the sound.</p>\n<p>“Usually I wear contacts.”</p>\n<p>Kara nods absently, still staring, and Lena feels a tiny glow of pride.</p>\n<p>Maybe she should wear them more often.</p>\n<p>It’s then that they both seem to remember their audience – 24 9<sup>th</sup> grade students, all watching them with rapt attention. Kara clears her throat, blushing slightly and grabbing a marker, throwing it up and catching it.</p>\n<p>“Hey, you know who made huge strides in the field of Halloween-related science? Frank-<em>Einstein</em>!”</p>\n<p>The entire class erupts into laughter that the joke definitely didn’t warrant and Lena joins them, impressed at how spot-on her impression turned out to be.</p>\n<p>Lena tries to teach the class without being distracted by Kara’s legs. She really does. There’s no reason for her to be all worked up by a glimpse of knee and ankle like some sort of Victorian pearl-clutcher. But she’s genuinely never seen Kara in anything but pants before, and the change is strange and distracting. Every few minutes Kara walks by to help someone with their experiment, and all Lena can see is <em>skin</em>. It’s absolutely maddening, and she’s never felt more relieved for their joint class to be over as she is when Kara finally goes back to her own room.</p>\n<p>By lunchtime Kara has changed into uniform pants, claiming that ‘<em>the joke isn’t worth wearing a dumb skirt all day’</em>, and it’s annoyingly even <em>more</em> attractive.</p>\n<p> </p>\n<p> </p>\n<p>By mid-November, Kara is starting to get used to the rhythm of working with Lena and shoving her attraction into the back of her mind.</p>\n<p>She’ll admit, there was a blip around Halloween. Seeing Lena in her clothes threw her for a loop, and the image of it is still burned into her mind, resurfacing at inopportune times. Especially the glasses, which Lena has now taken to wearing more often.</p>\n<p>But she has it under <em>control</em>, and her friendship with Lena persists.</p>\n<p>Their success in shared teaching also persists, due in part to Kara suggesting bi-weekly work nights where they brainstorm and plan the next few weeks of lessons and experiments. One of these now-routine sessions ends up falling on the final day before the Thanksgiving weekend - but this time, Lena offers to let her leave after only an hour and a half.</p>\n<p>“Leave? We’ve only figured out my half! We still have to do yours,” Kara argues, but Lena brushes her off.</p>\n<p>“Honestly, Kara, you can go home. I’m going to be doing absolutely nothing this weekend, so I can work on it by myself.”</p>\n<p>Kara frowns. “Nothing? Don’t you spend time with family on Thanksgiving?”</p>\n<p>“I have dinner with my mother and brother,” Lena says vaguely, waving a hand. “But that’s only a few hours on Saturday, and I try to get out of there as fast as I can.”</p>\n<p>The blasé way that she shrugs off what seems like a deep-seated hurt tugs at Kara’s heart. She leans back in her chair, fully intending on not leaving until Lena does.</p>\n<p>“Do you not get along with your mom and brother?”</p>\n<p>Lena shrugs. “Lex and I used to get along, until he became a puppet for my mother. And Lillian…Lillian has never approved of my choices.” The way Lena says it hints at more, and Kara presses on gently, sensing an opportunity to learn a little more about the enigma that is Lena Luthor.</p>\n<p>“What do you mean?”</p>\n<p>“Well…” Lena sighs, rubbing her eyes. She looks tired, suddenly, and a little bit resigned. “For example…when I was a child, I wanted to work for NASA. I even had a little ‘women of NASA’ book, which of course my mother threw out as soon as I went to boarding school. When I was 7, it was my dream. But my parents thought that it wasn’t good enough for me. That I would be wasting my potential.”</p>\n<p>Kara gapes at her, trying not to lose her shit entirely as she processes what Lena said.</p>\n<p>“They thought that…<em>NASA</em>…was <em>wasting your potential</em>?” Kara finally says, the sentence not seeming real even as it leaves her mouth.</p>\n<p>Lena smiles tiredly. “They don’t like the idea of technological innovation and advancement being in the hands of the government.”</p>\n<p>Understanding dawns, and Kara feels the slight irritation she’s always felt towards LuthorCorp grow even deeper in reaction to Lena’s pain. “So, they wanted you to be making leaps and bounds in science…but only for <em>their</em> company.”</p>\n<p>“More or less. You should hear what my mother tells me every Thanksgiving now that I’m a teacher. Talk about wasting potential,” Lena sighs, taking a sip of tea. “Thanksgiving in our house has always been a quiet table catered by the Luthor kitchen staff, where my mother points out every wonderful thing Lex has done this year, and how terrible I look by comparison.”</p>\n<p>Lena looks sad, like something heavy sits on her shoulders, and Kara feels suddenly guilty for dragging the subject out into the light. She tries for levity, hoping that a joke will lighten her mood.</p>\n<p>“Well, any occasion where pie is served can’t be completely awful, right?” Kara says, and Lena shrugs noncommittally.</p>\n<p>“My mother doesn’t do desserts.”</p>\n<p>\n<em>“What?!”</em>\n</p>\n<p>Imagining Lena, sitting in some huge, cold dining room and being unfairly criticized by her family with <em>no pie in sight</em>, is almost more than Kara can stand. They part that night an hour later, when Lena absolutely insists that Kara go prepare for Eliza and Alex to come over tomorrow, but Kara is plagued the whole way home.</p>\n<p>All through her own family weekend she can’t stop thinking about it, about Lena being left sad and lonely, spending the rest of the holiday alone and probably working. Alex notices almost right away, poking her with a foot every time she sinks too far into those thoughts, but even the turkey and stuffing isn’t quite enough to distract her.</p>\n<p>She wishes that she had thought to invite Lena to dinner. Her family would have embraced her, even Alex, and shown her what a holiday weekend is supposed to be like. But instead, she does what she knows would cheer her up if the situation was reversed, and what she never thought she’d do – she sacrifices her favourite Thanksgiving dessert.</p>\n<p>On Tuesday morning, Kara leaves a container with her two slices of chocolate pecan pie and a note on Lena’s desk. In the neatest writing she could muster, the note reads <em>‘I’m thankful for YOU! =)’. </em>At the last minute, she draws a heart on the sticky note, and she leaves it before she can second-guess herself.</p>\n<p>Lena doesn’t mention the gift, but by the time Kara swings by at lunch the pie is gone, and on Wednesday morning the empty, now-cleaned Tupperware is sitting neatly on Kara’s desk.</p>\n<p>Their relationship continues as normal after that, or so it seems. They keep teaching, keep laughing and working together, keep staying in their cozy classroom long into the night every 2 weeks even when it only takes them 2 hours to really finish the work that needs to be done. It’s <em>nice</em>, and manageable - and even when she feels like her heart is overflowing because she’s looking at Lena at 9pm on a Tuesday, all rumpled and soft with her hair finger-combed and her glasses sliding down her nose, she thinks she can handle it. Lena is unattainable, absolutely meant for better things, and Kara is content to adore her from afar. A lonely parishioner just happy to be in Lena’s orbit.</p>\n<p>It’s handled, and it’s fine.</p>\n<p>Until it isn’t.</p>\n<p> </p>\n<p> </p>\n<p>Lena’s will finally breaks in December.</p>\n<p>It’s a completely innocuous moment, too. Her resistance to Kara’s charm held up through months of psychological torture – Kara practically stripping on day 1 of their shared class, that moment at parent-teacher night where she could almost feel feather-light lips on hers, Kara turning up to school in a skirt and somehow probing into the intimate details of Lena’s past and leaving pie on her desk that she <em>knows</em> is Kara’s favourite. Days and weeks and months of fastidious self-control, and it’s broken by a moment so commonplace that Lena hardly realizes it’s happening until it’s too late.</p>\n<p>Their usual bi-weekly work sessions have gotten more frequent lately, their lesson planning expanding to include grading papers and marking quizzes together, doing test experiments (just to prevent further bottle-rocket incidents, of course) and creating new project ideas. It’s time that Lena treasures, one of the only times she finds that she can be fully herself around another person, and Lena curses herself for putting that on the line.</p>\n<p>On this particular December night, she and Kara are at the school later than usual - it’s dark outside, the wind whistling past the windows, and their classroom is cozy and warm, dimly half-lit by the white Christmas lights Kara strung up over the whiteboard last week. </p>\n<p>Kara does look particularly good today, if that can be considered an explanation for Lena’s temporary lapse in judgement – she’s in tight pants and a vest that accentuates her shoulders, with her hair in a tight bun that’s gotten looser as the night wore on. The shirt is slightly unbuttoned, and Lena has spent most of the night trying to avert her eyes from the patch of skin it reveals. Lena herself has taken off her shoes and rubbed off her lipstick for the day, sitting cross-legged on her desk chair with her hair in a messy bun. She’s not feeling sexy, or confident – she’s not feeling much about herself one way or the other, at that particular moment. She’s just existing, with Kara nearby being beautiful and untouchable as usual.</p>\n<p>“You know,” Kara says casually, taking a sip of lukewarm hot chocolate, “I think their marks on the chem section of the test are better than the physics.”</p>\n<p>“That’s because physics is more difficult,” Lena fires back without looking up from the test she’s marking. It’s Eve Tessmacher, and when Lena tallies her grade she’s happy to see she’s earned a 96. She scribbles an ‘A+’ in the top corner, and on second thought, she adds a smiley face for encouragement.</p>\n<p>She ignores how she can feel Kara’s influence in the decision. </p>\n<p>“We should really suggest that Eve joins the mathletes before the competition next month,” Lena mutters, putting Eve’s test aside and picking up another. “She’s got the highest mark in the class.”</p>\n<p>“Good idea. Clearly we reeled her in with chemistry, since it’s the superior science,” Kara says with faux-smugness, and Lena groans, finally looking up from her marking.</p>\n<p>“There’s a reason that Einstein was a physicist and not a <em>chemist</em>, Kara.”</p>\n<p>“Maybe it’s because he wasn’t smart enough for chemistry.”</p>\n<p>“Oh my god, shut <em>up</em> –“ Lena laughs, throwing her pen in Kara’s direction. She means for it to be a playful way to make a point, but the pen ends up sailing through the air with devastating accuracy, and it hits Kara’s forehead with a hollow <em>smack</em>.</p>\n<p>“Hey!” Kara exclaims, looking as shocked as Lena feels that the pen hit its mark. There’s a crooked line of ink across her skin, and Lena is all set to apologize and offer Kara a paper towel to clean it off when a rubber eraser bounces off her head, landing on the desk in front of her.</p>\n<p>All it takes is a glance at Kara’s outstretched hand and challenging grin, and within moments it’s an all-out war.</p>\n<p>Balled-up paper and pieces of chalk fly between them, landing with clatters all over the floor and desks and Lena loses track of her usual buttoned-up dignity, lost in a fit of giggles and Kara Danvers’ mischievous smile. Kara is nimble, but Lena is determined, and after a few rounds of merciless combat, she manages to hit Kara square in the face with a large painted sponge model of Venus.</p>\n<p>Kara, not one to concede defeat, just laughs breathlessly and pins Lena to the lab counter.</p>\n<p>As abruptly as it began, their fight ends with their hips flush and their faces inches apart, winded and suddenly still.</p>\n<p>There’s a throb deep inside Lena, in the pocket of her hipbones, a deep pull that threads up to her chest and makes her breathing short. Kara smells so good, and her eyes are zeroed in on Lena’s lips, and this feels suddenly inevitable – the crackling tension that’s existed between them for years reaching its capacity, and slowly, inexorably spilling over.</p>\n<p>Kara’s face is close now, so close that she can feel her warm breath and it smells like peppermint hot chocolate and it feels like she’s going against every single instinct in her body to deny this – the wall she has built up around her desire is cracking, and with Kara pressed hot and wanting to her, there’s nothing she can do to stop it.</p>\n<p>She lurches forward, their lips connect, and a crack becomes a canyon.</p>\n<p>It’s a moment that Lena has only ever let herself think about at her weakest, when she’s had one too many glasses of wine or she’s feeling the occasional aching loneliness that her empty apartment can sometimes bring. In her idle daydreams, Kara’s lips are soft. She kisses deeply, holding Lena like she’s something precious, like she’s deserving of gentle treatment and devotion. Her hands usually cup Lena’s face, and her kisses trail down Lena’s body with a similar tenderness.</p>\n<p>In reality, Kara’s lips are even softer than Lena imagined – but her kisses are not.</p>\n<p>Kara kisses like the world is going to end. After a moment of surprised hesitation at the bold move, her hands go to Lena’s hips and she presses in with a kind of force that Lena didn’t know she was capable of. The lab table digs into her lower back, but she couldn’t care less because Kara’s tongue is in her mouth and she’s pulling Lena’s leg up until it wraps around her waist and slipping her own thigh into the space and <em>pressing</em> until Lena whimpers, her hands fisted helplessly in the collar of that crisp blue shirt.</p>\n<p>Lena thought she would be timid – but Kara Danvers kisses with the intensity of the sun, hot and focused, and Lena melts under the attention.</p>\n<p>Her hands unclench from Kara’s collar and slip under it, spreading over hot skin, and Kara bites down on her lower lip with a groan.</p>\n<p>“Lena –“ Kara whispers against her lips, and it sounds like desperation, like reverence, like something close to what Lena has been feeling all these months has been concentrated into a single word breathed into her own mouth by Kara, and it would be so easy to surrender, so easy to just spread herself open inside and out and let her in –</p>\n<p>Down the hall a door slams open, and the sounds of a mini radio and a push-broom break the silence of the building. It’s like a spell is broken - they spring apart violently, panting and blushing like teenagers. Lena’s foot hits the floor, and her hair is somehow down again, the elastic lying on the floor under a nearby desk.</p>\n<p>There’s a few thick moments between them where Lena feels suspended, stuck in the moment before a freefall – until, almost simultaneously, they break eye contact and start gathering their things in silence. There’s a tremor in Lena’s hands as she blindly shoves folders into her bag, and she’s grabbing her coat and out the door before Kara has even gathered all of her papers from the desk. In what feels like a heartbeat she’s sitting in her car, her forehead leaning on the cold steering wheel, taking deep and measured breaths.</p>\n<p>\n<em>Oh, god. Oh god, oh god, oh <strong>god</strong> -</em>\n</p>\n<p>She knows that she’s made a mistake. A <em>huge</em> mistake, and one that she’s probably going to spend the next year trying to clean up. But <em>god</em>, for a moment, when Kara was pressed to her with that startling passion, Lena could almost entertain the idea of something more.</p>\n<p>Almost.</p>\n<p>The night is sleepless, and Lena spends every moment of it dreading the dawn. She has absolutely no idea how she’s going to manage seeing Kara this morning – she’s almost relieved when Kara’s car isn’t in the parking lot as she pulls in, knowing that she’ll at least be safe until she can reach the comfort of her office.</p>\n<p>She has two full periods before she has to see Kara today, and by the time the adjoining door opens and the blonde appears looking almost as tired as Lena feels, she’s so on-edge that she’s concerned she might give herself a heart condition.</p>\n<p>“Good morning, Kara,” Lena says quietly, her entire body taut with suspense as she prepares to either fight or fly. But Kara, after only a moment’s hesitation, just smiles.</p>\n<p>“Good morning, Lena.”</p>\n<p>And that’s that.</p>\n<p>There’s no uncomfortable discussion, no moment where she has to break Kara’s heart by telling her a relationship is a bad idea. Just a moment of adjustment, and it’s like nothing ever happened.</p>\n<p>There are a few moments of tension throughout the day – Kara brushed a little too closely by Lena during class, and she thought that her heart might beat right out of her chest – but for the most part, things are back to normal. Kara is there bright and early to hold the door for her the next morning like usual, her sunny smile back in place, and after a week or two Lena starts to think that maybe the whole thing was just a fever dream.</p>\n<p>Well, until Kara does something simple like stretch her arms over her head or bite her lip as she writes on the board, and Lena is transported back to being pinned to the lab desk she’s leaning on with Kara’s tongue in her mouth.</p>\n<p>Needless to say, the month of December is a stressful one.</p>\n<p>It doesn’t help that, a week before Christmas break, she strides into her classroom to find it decorated floor-to-ceiling exclusively in mistletoe.</p>\n<p>James Olsen, she knows, is in charge of the decorating committee – but this particular trick seems beyond him. Lena suspects that Alex is behind it, and it a few of their students seem far too smug and unsurprised at the décor when they enter the room. She’s sure that bribery was involved.</p>\n<p>She tries to work through it. Making a fuss would only make things worse, and the best thing to do is act completely unbothered. But unfortunately, Lena is pretty sure that the blush doesn’t leave her face all day, because all she can think about is the fact that they <em>have</em> kissed. They kissed right there, under that exact sprig of mistletoe, and it’s been two weeks but she can still feel Kara’s lips, can still feel the arousal that zips all the way to her toes at the way Kara’s strong hands pulled her thigh up until it hooked around –</p>\n<p>“Miss Luthor?”</p>\n<p>She startles violently out of her thoughts to see 16 faces staring up at her with concern. One student has his hand up, and she can tell from the look on the other students’ faces that it’s been a while – the class is a work period to prepare for mid-term exams in January, but she still shouldn’t be <em>daydreaming</em>.</p>\n<p>“I’m sorry, Andrew. What do you need?”</p>\n<p>When Christmas break finally arrives, it’s a relief that feels bone-deep. She needs the time away – away from Kara, away from this mistletoe-festooned hell, away from being faced every single day with the reminder of her own bad decision.</p>\n<p>She’s all packed and ready to leave when she pauses at the door, looking towards Kara’s classroom.</p>\n<p>They won’t see each other for two weeks, she reasons. She should probably say goodbye, and wish her happy holidays. As a friend.</p>\n<p>When she eases the door open, Kara is in her office, packing up her things – a small menorah, a few folders and binders, some small gifts from students. She’s lit by a desk lamp, her loose hair taking on a golden glow. There’s no reason to linger, but Lena can’t help herself – she stands in the doorway for a few moments before Kara notices her, just soaking her up.</p>\n<p>Kara startles when she turns around to see Lena standing silently in the entrance to her classroom, but the shock quickly turns into a genuine smile, and she steps out of her office and towards Lena.</p>\n<p>“Lena! I thought you’d left already?”</p>\n<p>“I’m about to. I just wanted to wish you happy holidays.”</p>\n<p>Kara grins, ushering her over, and Lena sets her coat down on a table as Kara leans against the wall next to the whiteboard. There’s a small wrapped gift on the front lab table, and Kara gestures to it.</p>\n<p>“I was going to just leave this in your office for after the break, but since you’re here…”</p>\n<p>“Oh!” Lena says, thrown off guard. “I didn’t get you anything?“</p>\n<p>“No, no, it’s okay! It’s just a tiny thing, but I really wanted you to have it.”</p>\n<p>It’s wrapped beautifully, and Kara shifts a little apprehensively as Lena carefully peels back the paper and tape and reveals –</p>\n<p>A ‘women of NASA’ Lego set.</p>\n<p>Little plastic figures of Margaret Hamilton, Nancy Roman, and Sally Ride are featured on the box, which proudly boasts ‘231 pieces!’ underneath the ‘10+’ age recommendation. It’s something she doesn’t need, a child’s toy with too much significance – but Kara <em>remembered</em>. She remembered Lena's stupid little childhood story, and she cared enough to buy it for her.</p>\n<p>Lena looks from the gift, to Kara’s slightly nervous face, and slowly puts it on the desk beside her. It’s like she’s barely controlling her actions – something has taken hold of her, made her feel like a creature possessed.</p>\n<p>Kara looks confused.</p>\n<p>“Do – do you like it?” Kara asks quietly, and Lena swallows hard. “I know it’s silly, but I saw it and I thought of you –“</p>\n<p>But Lena is already striding forward, grabbing her by her lapels, and crashing their lips together for the second time.</p>\n<p>Kara takes a few beats to respond, her hands frozen in the air on either side of Lena’s face, but when she finally seems to realize what’s happening she’s immediately lithe. She grabs Lena by the hips, lifting her fully and slamming her against the whiteboard hard enough that the breath whooshes out of her – she should feel alarmed, or annoyed at being manhandled, but all she feels is pure, liquid heat pooling between her legs as Kara grinds her hips forward.</p>\n<p>And their kisses are <em>just</em> as good as Lena remembers – just as sensual, Kara’s tongue hot in her mouth and her teeth digging into Lena’s lip with the <em>exact</em> right amount of pressure. She drags her short nails down the back of Kara’s neck, and her hips cant forwards. Lena’s dress has ridden up so far that she’s almost entirely exposed and, god help her, she’s arching into the pressure, she’s spreading her legs in her place of work and if Kara decides to slip a hand down, there’s absolutely no way Lena is going to stop her –</p>\n<p>Outside, a shrill, wailing police siren whizzes by and continues down the road, completely unaware of the moment that breaks apart in its wake. Again the spell is broken, and like polarized magnets they spring apart.</p>\n<p>This time, it’s much less easy to ignore what her body is telling her. Screaming at her, really. Kara’s hair is mussed and Lena’s lipstick is smeared over half her face, her glasses askew. She looks debauched and dazed, and Lena is pretty sure she looks the same way, with her hair messy and her skirt sitting just below her waist.</p>\n<p>“I –“ Kara starts, her voice hoarse and soft. “Lena –“</p>\n<p>“Happy holidays, Kara,” Lena blurts, grabbing her gift and running for her life.</p>\n<p>She leaves her coat behind along with Kara, blinking at her retreating form, but she absolutely cannot go back – she practically runs to her car, shivering but somehow still feeling molten. There’s still a fullness between her thighs, and they glide together with slickness every time she takes a step.</p>\n<p>She isn’t entirely sure how she gets home, but finally she’s dropping her keys onto the kitchen counter and stepping out of her shoes, uncharacteristically leaving them in the hallway. She flicks the light on in her bathroom and she’s alarmed at the sight of herself – she looks worse than she thought, with crimson stained over her mouth and neck and a small hickey forming just under her jaw.</p>\n<p>She cleans it off slowly and methodically, then steps out of her dress, groaning when she realizes that there’s whiteboard marker dragged all over the back. There’s probably a Lena-shaped smudge in the writing on Kara’s board, and she’s going to have to go back tomorrow and erase the whole thing to get rid of the evidence.</p>\n<p>And get her coat. <em>Christ</em>.</p>\n<p>But she can curse her own lack of willpower tomorrow. Right now she feels like she’s run a marathon, and she sinks into bed without so much as heating up leftovers for dinner. Her dreams are plagued by blonde hair and soft lips, strong hands pinning her to the sheets and hips grinding, <em>grinding</em> –</p>\n<p>She wakes up sweaty and exhausted, aching in the worst way, and she resigns herself to a long, cold shower before she sneaks back into Kara’s classroom to wipe away all evidence of her second ill-advised decision.</p>\n<p> </p>\n<p> </p>\n<p>Lena Luthor is the single most confusing person Kara has ever met.</p>\n<p>The last month has been, without question, both the best and worst of Kara’s life. She’s spent it exhilarated and terrified in equal measure – full of the memory of Lena’s lips, and unsure how to handle the situation.</p>\n<p>Their first kiss had been electric. It came out of nowhere, a moment of silliness morphing into Lena with her hands on Kara’s skin and her thighs parted, and Kara wishes she could know where things would have gone had they not been interrupted. And their second kiss was somehow even better – Lena initiated it, and the little noises she made as her hips were moving into Kara’s before they were interrupted <em>again</em> has been seared into her brain for a week.</p>\n<p>And now, even with two mind-numbing, life-changing kisses between them, not a word has been spoken about it.</p>\n<p>It’s partially her fault, she knows. There had been a moment, the day after their first kiss, where Kara had considered asking Lena to sit down and talk it through. But Lena had looked so worried, so wide-eyed and uncharacteristically terrified, that Kara taken in to the easier option. She stayed quiet, and tried to move on.</p>\n<p>And then it happened again.</p>\n<p>Normally, Kara is all about healthy communication. But the smaller, more base part of her brain, the part that remembers tasting Lena’s perfume on her neck and the part that’s hoping it might happen again, is resisting. Trying to talk about whatever strange, nebulous magnetism is between them will lead to the undeniable fact that Lena doesn’t want a relationship, that she’s eventually going places that Kara in her inferior intelligence can’t follow, and as bad as it is, she wants to live in this little fantasy a while longer. One where Lena looks at her with thinly-veiled desire, and they exist in a strange limbo between <em>friend</em> and <em>something</em> <em>more</em>.</p>\n<p>Unfortunately, their second kiss happened the day before Winter Break, and now Kara has another full week of wanting desperately to see Lena, while being too nervous to reach out first. She <em>misses</em> her, with a sharp desire she’s never really felt before. Her only distraction is Alex, but Alex wants to work on their spring curriculums, and working on anything school-related just makes the missing even worse.</p>\n<p>“I can’t decide on a final project for my journalism class.”</p>\n<p>Alex doesn’t look up from her laptop, her fingers flying over the keys. “Just make them create a newspaper. Wasn’t that what you were planning to do?”</p>\n<p>“Well, yeah, but…I want it to be really good,” Kara counters, her own word document stubbornly blank.</p>\n<p>“A newspaper <em>is</em> a good idea.”</p>\n<p>“No, like, <em>really</em> good,” Kara argues. “I’m lucky that Cat even let me offer this class – I need to prove that it’s a good idea.”</p>\n<p>“Kara, your students love you. They’ll give you great feedback no matter what.”</p>\n<p>Alex is right, she knows. She closes the doc with a huff, trying to find something else for her brain to focus on besides the memory of how Lena’s red lipstick looked smudged all over her face.</p>\n<p>“Fine, fine,” she mutters, scrolling through her work folder. “I need to work on my semester 2 introductory chem lecture, too – I’m sure I can make it as good as Lena’s.”</p>\n<p>“Shouldn’t you be working on that <em>with</em> Lena?” Alex asks distractedly, and Kara is grateful that her sister’s eyes are glued to the screen because her sudden blush is impossible to hide.</p>\n<p>“I – well, we can work on things by ourselves. We don’t <em>have</em> to be together –“ she stammers, and to her horror, Alex looks up with a suspicious expression at the nervousness in her voice.</p>\n<p>“Yeah, but you’ve used it as an excuse to hang out with her all semester. What’s going on?”</p>\n<p>“Nothing!” Kara insists, but her voice has gone all high-pitched like it always does when she’s trying to lie, and Alex knows it. “It’s just – it’s the holidays, and I don’t want to bother –“</p>\n<p>“Luthor doesn’t <em>do</em> holidays. Even I know that,” Alex says, and Kara feels a bit like a rabbit cornered by a bloodhound. Alex has caught the scent of her lie, and she won’t stop until Kara spills.</p>\n<p>“I just – we – I don’t want it to be –“ Kara grasps at straws, until finally Alex rolls her eyes.</p>\n<p>“Kara, just spit it out!”</p>\n<p>“We kissed.”</p>\n<p>It slips out surprisingly easily, in the end. As if she’s just been waiting to tell Alex, to tell <em>someone</em>. It feels like a weight is lifted, even with Alex looking at her like she’s just revealed her intention to quit teaching and start a new career as a mime.</p>\n<p>Honestly, there are moments when she’d seriously consider running away to the circus. This being one of them.</p>\n<p>Alex blinks at her for a few seconds, each one compounding Kara’s anxiety. “I’m sorry, you <em>what</em>?”</p>\n<p>“In our classroom. Twice.”</p>\n<p>The more Kara tells, the more she <em>wants</em> to tell. Although, she’s not sure Alex would appreciate knowing the intimate details. Alex, for her part, is still working on processing the information.</p>\n<p>“So…” Alex says slowly, her brow furrowed, “You’re telling me that you kissed Lena Luthor, <em>twice</em>, and you’re not at her apartment <em>right now?”</em></p>\n<p>“That’s exactly what I’m telling you,” Kara sighs, abandoning her laptop and flopping back on the couch. “Both times, she just sort of – disappeared, afterwards.” <em>‘Ran away’</em> is probably a more accurate description, but Alex doesn’t have to know that.</p>\n<p>“Well, shit,” Alex mutters, rubbing her forehead. “I strung your classes in mistletoe as a <em>joke</em>, I didn’t think –“</p>\n<p>“That was <em>you</em>?” Kara exclaims, sitting abruptly upright. “Lena was spaced out all day because of that!”</p>\n<p>“Of course it was me, doofus,” Alex says with a dismissive hand wave. “Have you talked to her about all of this?”</p>\n<p>“No,” Kara says sheepishly, and Alex smacks her on the shoulder.</p>\n<p>“Kara!”</p>\n<p>Kara leans away from the flying hands, her own raised in surrender. “I don’t want to jinx it!”</p>\n<p>“<em>What</em>?” Alex says incredulously, and Kara sighs, trying to explain her thought process.</p>\n<p>“If we talk about it, it might…stop,” Kara admits quietly. “And I don’t want it to stop.”</p>\n<p>“Oh, <em>Kara</em>,” Alex sighs, pity evident in her voice. Kara shrugs it off.</p>\n<p>“It’s fine. It probably won’t happen again anyways, because she’s way out of my league. She’s a beautiful genius, and – and it was probably just a spur of the moment thing.”</p>\n<p>“<em>Two</em> spur of the moment things,” Alex reminds her, quite unhelpfully. Kara glares at her, but from the amused look on Alex’s face, it’s likely that her authority is compromised by the holiday-themed snowflake footie pajamas she’s wearing.</p>\n<p>“Look, I’m not going to force you to do anything, but I am going to beg you to remove your head from your ass and talk to her.”</p>\n<p>“And I’m going to ignore you,” Kara replies, already putting in headphones and turning Spotify to full volume.</p>\n<p>“Fair enough, but you know I’m right,” Alex yells, and Kara can hear it even through the ABBA being played at an ear-shattering decibel.</p>\n<p>Alex is right, as always. Kara should do the difficult thing – she should talk to Lena, and put this whole thing to bed one way or the other. But, not today.</p>\n<p>And, apparently, not any day in January either. The holidays come and go, and their school routine goes on unchanged. Kara keeps bracing herself for another encounter every time they end up alone in the classroom, but so far there’s nothing to suggest that Lena even <em>remembers</em> the first two kisses, let alone wants to do it again. She treats Kara the same way she always has – with friendship tempered by distance, occasional moments of softness swiftly covered with deflection.</p>\n<p>The only indication that Kara didn’t make the whole thing up in her head is the way she catches Lena looking at her sometimes, when she wears something short-sleeved or particularly tight. She’s sure that it’s only surface-level, not the deep yearning that she feels whenever Lena is in the room – the idea that Lena could want anything beyond the physical with her when she’s clearly meant to change the world is ludicrous - but it’s <em>something</em>, and she clings to it.</p>\n<p>It all almost feels normal by the time the Mathletes go to their mid-year competition in Gotham. She and Lena, being the only chaperones, spend days making last-minute preparations. They arrange buses and room assignments, inform restaurants about food allergies and verify emergency contact information, and she hardly has time to think about anything besides hoping the weekend goes smoothly.</p>\n<p>So, naturally, the weekend does not go smoothly.</p>\n<p>It has nothing to do with the students – the Mathletes tend to be a tame bunch, all too fond of herself and Lena to get into too much trouble. Eve Tessmacher made a great addition to the team, and everyone accepts their room assignments happily.</p>\n<p>With all the time they spent on rooms for the students, she really should have double-checked her own accommodations.</p>\n<p>While Lena wrangles the students into groups to go up in the elevator and get settled into their rooms, Kara frowns at the piece of paper in her hand. Two keycards are tucked into the little pocket underneath a room number, and two names are listed under <em>‘occupant(s)</em>’: herself, and Lena.</p>\n<p>Both. On one sheet.</p>\n<p>With a growing sense of dread, she turns back to the front desk attendant.</p>\n<p>“Excuse me?” she asks quietly, glancing behind her to make sure Lena is still occupied. “I think there’s been a mistake. Myself and my co-worker were only given one room. I was under the impression –“</p>\n<p>The attendant at least has the grace to look apologetic. “I’m <em>so</em> sorry, ma’am, but that was the booking I was given. 8 rooms, 7 for students and one for the chaperones.”</p>\n<p>\n<em>Oh, god.</em>\n</p>\n<p>There are about a thousand things she’d rather do than break the news to Lena that they’re sharing a room. If only to postpone her sentence, she ducks into the stairwell nearby and calls Cat.</p>\n<p>“Miss Danvers, I gave you my cell phone <em>in case of emergencies</em>. I sincerely hope that some horrific tragedy hasn’t struck your bus full of students, because otherwise –“</p>\n<p>Painfully aware that she only has a minute or two before Lena realizes she’s gone, Kara interrupts her boss nervously.</p>\n<p>“I have a question about room assignments, Miss Grant.”</p>\n<p>Cat sighs, and Kara has the sneaking feeling that the call is going to be futile. “I thought this might come up. There’s a conference at your hotel this weekend, and one room was all that could be booked for you. I trust you can handle sharing a room for one night?”</p>\n<p>She seems far too pleased with herself, and no matter how much Kara politely protests, the answer is the same – she and Lena are bunking together. And, because fate is a cruel and uncaring bastard, the door swings open after a very tense elevator ride to reveal a single Queen bed.</p>\n<p>After a moment of hesitation Lena strides into the room, her back ramrod straight, and sets her things on the desk.</p>\n<p>“Lena…” Kara says hesitantly, “I’m sure I can go to another hotel. Or, sleep on the floor or something –“</p>\n<p>Lena laughs humourlessly, the sound clashing with her white-knuckle grip on the handle of her overnight bag.</p>\n<p>“I’m a grown woman, Kara. I can handle sharing a bed with another adult.”</p>\n<p>Kara swallows, her mouth feeling oddly dry at the abrupt shut-down.</p>\n<p>Despite Lena’s insistence that the accommodations aren’t a problem, she seems to be determined to put off going to bed for as long as possible. She leaves the room for almost a full hour to get ice, and when she gets back it takes her much longer than it should to get changed in the bathroom.</p>\n<p>Kara sits on the bed while she waits, drumming her fingers on her knees and feeling slightly self-conscious about her Cookie Monster flannel pajama pants.</p>\n<p>When Lena finally emerges in cotton shorts and a grey MIT t-shirt, Kara’s hands clench into fists involuntarily as she fights to smother the strangled noise that tries to fight its way up her throat.</p>\n<p><em>Just co-workers sharing a bed</em>, she chants silently. <em>Don’t be weird about it, don’t look at her thighs, this is just two co-workers sharing a bed</em> –</p>\n<p>“I didn’t realize we’d be –“ Lena gestures self-consciously at her outfit, pulling the hem of her shorts down to cover more of her legs. But all it does is reveal a sliver of her stomach at the base of her shirt, and Kara has never felt like a bigger creep in her life for how desperately she wants to run her tongue along it.</p>\n<p>The bed dips as Lena slips under the covers, and side by side they both stare up at the ceiling by the light of the bedside lamp. The silence is thick, broken occasionally by bouts of laughter from the students in neighboring rooms, and Kara can feel her pounding heartbeat in every part of her body.</p>\n<p>And yet strangely, nothing happens.</p>\n<p>It seems <em>different</em> here, more intimate somehow in a way that Kara isn’t equipped to handle. In their dimly lit classroom, the outside world seeming far away, it’s easy to throw logic out the window and succumb to desire – but here, in a soft bed, in a well-lit hotel room surrounded by their students, it would feel too deep. Too <em>real</em>.</p>\n<p>No matter how badly she wants to roll over and feel exactly how soft Lena’s skin is.</p>\n<p>So instead Kara switches off the lamp and they lie together, both completely still and not daring to touch. She knows she’s not sleeping, and she knows that Lena’s not sleeping, and she knows that Lena knows neither of them are sleeping, but she can’t bring herself to make a move.</p>\n<p>Alex’s voice echoes in her head – <em>get your head out of your ass and</em> <em>talk to her</em> – but she can’t.</p>\n<p>It’s too risky.</p>\n<p>It’s almost dawn when she finally drifts to sleep. She mostly dozes, in and out of a deeper sleep, and it feels like only a few minutes later when she jerks awake to the sound of 10 sets of fists banging on the door.</p>\n<p>“Miss Danvers! Miss Luthor!”</p>\n<p>“It’s time for breakfast!”</p>\n<p>“Do you think they’re still sleeping? They could be –“</p>\n<p>“<em>Shhh</em>!”</p>\n<p>She cracks her eyes open, groaning at the sunlight filtering through the inadequate curtains. Her neck is stiff, and her legs are tangled in something – something heavy, something that’s also weighing down her torso and breathing little puffs of hot air into her neck –</p>\n<p>Lena is on top of her. Somehow, during their 2 hours of sleeping, they both seem to have migrated to the middle of the bed and fully into each other’s space, and somehow Lena hasn’t even stirred yet despite the increasing volume of the teenagers outside. Her chest feels tight, and it’s not because Lena’s entire torso is pressing it into the mattress.</p>\n<p>Desperate to not have this conversation, Kara slips out from underneath Lena’s weight as quickly as she can and darts out of bed. She hears Lena make an adorable disgruntled noise at being disturbed, but she’s already opening the door a crack and peeking out at the 14 Mathletes standing in the hallway in their pajamas.</p>\n<p>“How about you guys go get dressed, and Miss Luthor and I will be out in 5 minutes?” she whispers, trying to keep the plea out of her voice.</p>\n<p>The kids disperse, giggling. Kara closes the door behind them and leans her forehead on it. Behind her the bathroom door squeaks, and Kara only sees a flash of grey cotton and messy black hair before it closes with a snap.</p>\n<p>\n<em>Time to face the day.</em>\n</p>\n<p>Despite both of their teachers running on empty, their team wins.</p>\n<p>The trophy is cheap plastic and probably came from the dollar store, but it’s theirs. The bus ride back to National City is full of laughter and recounting Eve’s badass last-minute answer that clinched the final round, and by the time the bus pulls into the school parking lot and the students start to scatter into their parents cars, Kara has almost forgotten the fact that she’s barely slept in 36 hours.</p>\n<p>She’s not sure if it’s the lack of sleep or just the happiness of the trip back, but Kara feels mischievous. She holds the trophy up to the evening light, and it glints off the gold plastic and shines on Lena’s smile.</p>\n<p>“You know…” Kara says conspiratorially, “The janitors don’t lock the doors until 7. Wanna put this bad boy in our classroom?”</p>\n<p>She’s not sure why she suggests it. The halls will be empty, their empty classroom devoid of prying eyes, and the closer they get to it the more a familiar feeling of inevitability creeps in. She turns on her office light but leaves the harsh fluorescents off, and together they pull a table up and stand on it to set the trophy on a small ledge above the whiteboard. When Kara jumps back down, dusting off her hands, she lands so close to Lena that the shorter woman stumbles a little, leaning back against the table.</p>\n<p>This is dangerous ground. They’re entering the rapids, and Kara doesn’t have so much as a life jacket. But then Lena’s hands land gently on Kara’s chest, her eyes dragging up to meet Kara’s, and drowning doesn’t seem so bad.</p>\n<p>She doesn’t know who leans in first this time, but the next thing she’s aware of is having Lena pinned to a surface in their classroom for the third time, and it rockets from zero to a 100 in seconds.</p>\n<p>Without hesitation she lifts Lena onto the desk and her legs wrap around Kara’s waist, her nails digging into the back of Kara’s neck. It’s almost frenzied, as if Lena is trying to purge the desire from her system, and Kara is just clinging on for the ride. She can feel the heat radiating off her through several layers of clothing, and the tiny, desperate noises she’s making are more frequent than she remembers, and she has no idea why she keeps resisting this when it feels so good, so <em>natural</em>.</p>\n<p>Kara is still stunned that this is even possible – that Lena is attracted to her in any capacity, let alone enough to want to kiss her – but she doesn’t let herself think about it for too long, smothers the voice that whispers in her head. <em>She’s too good for you. </em></p>\n<p>\n<em>She’s too good for everyone.</em>\n</p>\n<p>But Kara is too far gone now to stop. Her face is buried in Lena’s neck, breathing in the fragrance that haunts her on a daily basis, and Lena’s trembling hand grasps her own and slides it down. Down, down, down, until it’s brushing her inner thighs and she can feel a damp patch of fabric and Lena is whimpering her name -</p>\n<p>The harsh trill of Kara’s cell phone has never in her life been so unwelcome.</p>\n<p>Before Kara can even open her eyes, Lena’s back is disappearing through the door towards the parking lot, and Kara’s arms are hanging in the air around nothing. The only thing left of Lena is the imprint of her lipstick and the ghost of her perfume.</p>\n<p><em>Again</em>.</p>\n<p>“Fuck,” Kara whispers, raising a shaking hand to her red-stained, tingling lips and remembering where it almost was. Who it was almost inside.</p>\n<p>“<em>Fuck</em>.”</p>\n<p>Every single year, without fail, Lena wishes that she could justify calling in sick on February 14th.</p>\n<p>The entire school is festooned in pink and red decorations, and passing what seems like 100 teenage couples sucking face and exchanging stuffed animals and candy is enough to make her want to hole up in her apartment for a week. The holiday is saccharine, and cliché, and cheesy, and for the life of her she cannot stop thinking about Kara Danvers.</p>\n<p>She lost control, a few weeks ago. The Mathletes winning, and the long bus ride, and spending the entire night mere inches away from Kara in a hotel bed – all of it had compounded until she lost her head. At least, that’s what she’s been telling herself. That night, when she’d been dragging Kara’s hand towards her panties in the middle of her workplace, she hadn’t been thinking about justifications. She’d just been thinking about how <em>incredible</em> Kara’s hand was going to feel on her –</p>\n<p>Anyways.</p>\n<p>They haven’t spoken about it since, and it is <em>not</em> happening again, no matter how many heated looks she catches Kara giving her when she’s trying to talk about the fundamentals of electricity.</p>\n<p>So, Valentine’s Day vexes her. She has her joint class with Kara in the afternoon instead of the morning, at least, which gives her a little bit more time to prepare herself before Kara marches in and hands her a cheap piece of folded paper featuring Bugs Bunny asking her to ‘Be Mine’, but her heart still flutters traitorously when Kara winks.</p>\n<p>Kara asked specifically to take charge of the class today and Lena had surrendered the reins happily at the time, just glad to not have to think up some silly way to link the holiday with Physics. But now, it means she has to spend most of the class time watching Kara talk about how chemistry affects love, and it digs into her in a surprising way.</p>\n<p>Kara’s lecture is barely even romantic. She’s talking about brain chemistry, about serotonin and dopamine and norepinephrine, how rushes of chemicals to the brain during infatuation cause physical symptoms like racing hearts and sweaty palms. She’s essentially telling the class that what they feel is nothing more than biological reactions, scientifically explainable, and yet here Lena is with a racing heart and sweaty palms being swept away by Kara’s easy charisma.</p>\n<p>It doesn’t help that every time Kara mentions words like <em>euphoria</em> and <em>pleasure</em>, her eyes flick up to meet Lena’s, and the dopamine does its job. She’s practically swooning, memories of their last kiss and exactly how capable of <em>pleasure</em> Kara can be is making her throb with repressed want.</p>\n<p>She hates Valentine’s Day.</p>\n<p>Kara decides to top the class off with a small experiment – showing the students how to create exothermic reactions (<em>‘like how two people meeting can spark in an instant!’</em>) using glycerine and potassium permanganate. She draws a heart with an arrow through it on a flame-proof slab, tilting it up so the class can see, adds drops of glycerine strategically until it starts to smoke, and then sprays it with a slight misting of water.</p>\n<p>Lena had disapproved of the water. It makes the reaction a little unstable, and Kara’s experiments are prone to danger as it is. But Kara insisted that it speeds the reaction up, and Lena had ceded to her expertise.</p>\n<p>She should know by now never to give in to Kara’s ideas.</p>\n<p>The black powder flames out into the shape of a heart, exactly as Kara planned – for exactly 5 seconds. After that it starts to warp and sputter, and the flame spreads across the flameproof board and onto the lab table as Kara jumps back and swears, grabbing the fire extinguisher.</p>\n<p>And when Kara has sprayed the mangled heart into submission, her shirt covered in tiny smoking black powder spots and her hair in disarray but a happy grin on her face, Lena’s idiotic brain keeps pumping those useless chemicals until her heart feels tight at how ridiculously <em>cute</em> it all is.</p>\n<p>The rest of the day is spent in complete and utter distraction.</p>\n<p>It’s the least productive day she’s had in a long time, even including the days after each of their unplanned, irresponsible kisses. She spends it wishing that the day could just be over, and she could go home and curl up with an overflowing glass of wine and just <em>relax</em>.</p>\n<p>So, when a group of other single teachers invite her to go out with them for a ‘Fuck Valentine’s Day’ drink, Lena initially says no.</p>\n<p>Winn badgers her about it as she tries to pack her things to go home, insisting that it’s going to be a blast and that Kara, Alex, and himself will all be there, but Lena denies him again and again until Kara strolls through their adjoining door. Her hair is down, and she’s changed her fire-shirt for a simple black tank top (her gym shirt is all she had to change into, she insists), and when she leans against the now-cleaned lab table her shoulders flex a little.</p>\n<p>Well. One drink can’t hurt.</p>\n<p>She has three. She reassures herself with the fact that she doesn’t actually get drunk – she barely gets tipsy. But Kara sticks close to her all night, and the bar seems to exclusively play songs with deep bass lines that make her want to tap into her college instincts, to climb into the taller woman’s lap and <em>grind</em>.</p>\n<p>But she’s an <em>adult</em>, and as an adult she instead sticks to pretending she can’t hear anything Kara says over the music so that they have to lean absurdly close in order to carry on a conversation.</p>\n<p>“You know, I’ve always wanted to see you with your hair down,” Kara says lowly into Lena’s ear, and Lena has to suppress the full-body shudder that results from Kara’s warm breath and the honey-sweetness of her tone. She distracts herself by taking a sip of her almost-empty drink, letting an ice cube melt on her tongue. The coldness gives her something else to focus on.</p>\n<p>“I wear my hair down sometimes,” Lena edges, and Kara laughs, the sound rippling down Lena’s spine.</p>\n<p>“You know what I mean. Like – chill. Drinking, going out with friends.”</p>\n<p>Lena chuckles, stirring the ice in her glass with the little red bar straw. “This isn’t exactly my scene. I’m more of a ‘curl up at home with a good book’ kind of girl.”</p>\n<p>“So am I, but sometimes you need to <em>let loose</em>,” Kara murmurs, still so close to Lena’s face, and the timbre of her voice dips on the last two words in a way that makes Lena’s entire lower body melt like a popsicle.</p>\n<p>“Maybe I just needed someone to show me how,” Lena replies without thinking, and she hates that she can hear how breathy her own voice sounds.</p>\n<p>Kara’s pupils visibly dilate, and Lena feels a creeping sense of inevitability.</p>\n<p>\n<em>I shouldn’t have said that.</em>\n</p>\n<p>The night passes too quickly. She surprises herself by having a genuinely good time, and the hint of tipsiness helps her continue to forget her boundaries around Kara - so, when Kara suggests they share a cab home, Lena agrees with almost no resistance.</p>\n<p>It shouldn’t be a surprise that Lena is half in her lap and fully in her mouth before they get to the first address.</p>\n<p>Kara’s lips are just as good as she remembers, just as soft, just as sweet, and their position means she can indulge her earlier instinct and grind herself down into the blonde’s lap all too easily. The pressure makes her groan, and Kara breathes hotly into her mouth, biting down on Lena’s lip.</p>\n<p>“Are you gonna run away this time?” Kara murmurs, and Lena can admit that she does feel the urge to wrench open the car door and tuck-and-roll into the street at the reminder. But she doesn’t – she just silences Kara the only way she knows how.</p>\n<p>If the rest of the night has passed in a blur, now it seems to move in slow motion. She can feel every inch of Kara’s body, can catalog the exact feeling of her tongue, how she tastes like beer and smells like leather and light cologne and her jaw feels strong and warm under Lena’s fingers. She can feel the very limited amount of time in which she could still back out of this and salvage her self-control slipping away, and then it’s gone, lost to two strong hands gripping her waist and pulling her closer.</p>\n<p>It’s because she’s been drinking, Lena reasons, knowing full well that neither of them have had alcohol in their system for several hours.</p>\n<p>That’s why she pulls Kara out of the cab, why she slides her cold hands under Kara’s shirt until she hisses and giggles when she’s trying to open her apartment door. It’s why she willingly steps into Kara’s house, and why she doesn’t think to protest when she’s being pulled up the stairs and pushed through the hall until Kara has her pinned to the inside of the bedroom door.</p>\n<p>It has to be. Nothing but the influence of alcohol could make her strip like her clothes are on fire, or spread herself out naked on Kara’s bed, or pull Kara down to feel warm skin slide against her own from head to toe. And when Kara makes her way down Lena’s body, Lena spreads her legs and fists a hand in Kara’s hair to guide her because she’s obviously very, very drunk.</p>\n<p>The fact that she’s only had 3 watered-down rum and cokes and all were almost 4 hours ago is inconsequential.</p>\n<p>The first touch of Kara’s tongue makes quick work of any plans Lena might have had to leave after one orgasm. She’s so close already, embarrassingly close for having only been naked for under a minute, but it feels like she’s been stuck in suspended foreplay for months now and she’s <em>finally</em> about to cross the finish line.</p>\n<p>She wants to slow down, wants to enjoy this and imprint it in her memory since it’s never going to happen again, but Kara is enthusiastic and determined and <em>skilled</em> and mere seconds later her body finally gives in to what it’s craved since their first kiss. Since before. Coming in Kara’s mouth while those strong arms are wrapped around her thighs to hold her down is everything she’s been craving, and the <em>relief</em> it brings is enough to make her eyes water.</p>\n<p>Kara’s face is slick when she starts to kiss her way back up again, and it leaves wet trails over Lena’s hipbone, over her belly. She halts when she reaches Lena’s chest, seeming perfectly happy to take up residence there and enjoy herself.</p>\n<p>Lena isn’t usually one for multiples. But Kara is hovering over her, biceps flexing with her own weight and her warm tongue tracing idly around Lena’s nipples purely because she seems to <em>want to</em>, and it’s like she never came at all. More desperate than she’d admit for this night not to end, Lena does the only thing she can. She fists a hand in Kara’s hair and drags her up for a kiss, whispering her next words into Kara’s mouth.</p>\n<p>“Again.”</p>\n<p>It’s a one-time, spur of the moment night, Lena thinks two orgasms later, as Kara comes helplessly on her fingers for the first time.</p>\n<p>It’s never going to happen again, after this. She’s never going to feel the way Kara bears down on her hand, never going to hear the way she cries out Lena’s name just before she peaks and whispers it as she comes back down. At first Kara reacts to Lena’s touch like a person who isn’t used to being taken care of, slightly skittish and unsure, but after the third time Kara tries to turn things around and instead Lena just insistently goes down on her again, she seems to relax into it.</p>\n<p>It’s a snap decision, one she didn’t have time to think about, she maintains even after round 4, when Kara is struggling into the harness and Lena is lying on her back, fingers dancing over her own clit as she waits for it with her legs spread shamelessly.</p>\n<p>She feels molten. Absolutely <em>brazen</em>. She’s come four times, made Kara come three more, and still she’s so desperate for it that she can’t even wait 30 seconds for Kara to get the damn harness on – she needs the relief of pressure and friction, and watching Kara’s muscles flex as she twists and tightens is absolutely getting her there.</p>\n<p>At the wet sounds that result from Lena rubbing herself with zero finesse and an embarrassing amount of wetness, Kara’s head snaps up, and immediately she abandons the last few steps of tightening and slipping the toy through the ring to drop to her knees and knock Lena’s hand out of the way. She buries her face in Lena’s cunt with a desperate sound, and Lena shouts her approval to the ceiling.</p>\n<p>Kara’s clear desperation for her is driving her to new heights, and it feels so fucking <em>good</em> but god, she wants the thing hanging loosely between Kara’s legs. She wants the fullness and the driving force of Kara’s hips, so finally she winds a hand into her hair and tugs. Hard.</p>\n<p>Kara doesn’t budge, just groaning at the sensation and doubling her efforts.</p>\n<p>“Kara –“ Lena chokes, her whole body arching like a bow as she pulls harder. “I want it, <em>I want</em> <em>it</em>, please, god, I want you inside me, <em>please</em> –“</p>\n<p>Finally Kara pulls away with a pained groan, her face shiny and flushed. She tightens the last few buckles and secures the toy, and then she’s hovering over her and Lena is practically climbing her in the attempt to just fucking <em>get her inside, already</em> –</p>\n<p>The fervor that sweeps over her when Kara finally eases herself in to the hilt is unparalleled. There’s a fire somewhere inside her, and Kara has just thrown gasoline on it – and then she has the audacity to start a <em>slow rhythm</em>, to rock their hips together at a trot instead of the full-tilt gallop that Lena <em>needs</em>. It’s so much but it’s not enough, and finally Lena grasps at Kara’s hips herself, slamming them forward and gasping at the electric shock it sends through her nervous system.</p>\n<p>Kara grunts into Lena’s neck, her hips moving slightly faster, but it’s <em>still not fast enough -</em></p>\n<p>“Kara,” Lena rasps, digging her blunt nails into muscular shoulderblades and biting down on Kara’s earlobe, “Fuck me like you <em>mean it.</em>”</p>\n<p>And Kara <em>delivers</em>.</p>\n<p>With a strangled noise she hitches Lena’s legs up until they lock over her back, adjusts her leverage on the bed, and starts a savage, pounding rhythm that Lena <em>knows</em> she’s going to feel tomorrow. She can hear the headboard hitting the wall at an embarrassing volume but she’s well past caring, too busy clinging to Kara’s shoulders and begging for more.</p>\n<p>“Fuck, yes – god, Kara, just like that, <em>just like that, yes</em> –“</p>\n<p>Kara reacts to the praise with a whine and speeds up even more, to an almost inhuman pace, and Lena couldn’t stop the avalanche if she tried.</p>\n<p>When she comes, it’s with a shout that could wake the entire neighborhood, and Kara lets out a tiny, overwhelmed groan that makes her think that maybe the feeling is mutual.</p>\n<p>By the time Kara is collapsing on top of her, Lena’s legs wrapped around her hips and her back quivering and sweaty, covered in Lena’s claw marks, she’s run out of excuses. She just musters all of her acrobatic ability and flips them over without losing that fullness for an instant, settling on top of Kara and planting a hand on her chest. And for once, she lets herself be in the moment, where Kara’s resulting delighted grin and firm grip on her hips absolutely lights her on fire.</p>\n<p>Kara’s alarm clock reads 3:43am when Lena finally slips out of bed, feeling sweaty and bruised and absolutely, mind-numbingly sated.</p>\n<p>Kara fell asleep with the harness still on, the toy discarded on the floor and with Lena on her chest listening to her slowing heartbeat, and Lena worries for her circulation from the tight straps but not enough to wake her up and risk having possibly the most horrific conversation imaginable. Instead she gathers her scattered clothes and dresses as silently as she can, pausing in the doorway to take a mental snapshot of the scene.</p>\n<p>The room is a disaster that reflects the passion of the night. Clothes are thrown over various pieces of furniture and the comforter is in a pile on the floor, and in the middle of it all Kara is sprawled out over half the messy bed, her hair tangled and her face smooth and even in sleep. As Lena watches she reaches a hand out over the sheets and, when she feels no warm body, her placid features shift into a frown.</p>\n<p>Lena takes that as her cue to leave. She only gets 3 hours of sleep, but they’re deep and unbroken, and she feels surprisingly rested when she gets to work. She’s almost cheerful until she hears Kara moving around in her office next door, and she remembers that she’s going to have to talk to her like a functional human being.</p>\n<p>When Kara strolls into the classroom looking far hotter than she has any right to, in chinos and a dark red turtleneck, Lena isn’t prepared.</p>\n<p>Her hair is down, which is rare for when she’s teaching labs, and Lena feels her face get hot when she realizes that the entire ensemble is probably to cover up the fact that Lena left a kaleidoscope of bruises all over her neck last night. She can remember exactly what Kara’s skin tasted like under her teeth, and she has to take several deep breaths through her nose to gain a sense of normalcy again.</p>\n<p>“Good morning, Kara,” she finally says, and she’s proud of how even her voice sounds. Kara flushes slightly, but her grin is genuine when she replies.</p>\n<p>“Morning, Lena.”</p>\n<p>The way her name rolls off Kara’s tongue sends Lena into a tailspin – she can still hear the way Kara said it last night, the way she groaned it when Lena’s tongue was swirling over her clit, the way she whimpered it when Lena was riding her, the way it was whispered in near-reverence into Lena’s neck as Kara’s hips slammed into her own, building her up to yet another peak – <em>Lena, god, <strong>Lena</strong></em> –</p>\n<p>“Lena?” Kara’s real, concerned face swims back into focus and Lena jerks away, smoothing her shaking hands down her skirt. “Are you okay?”</p>\n<p>“I’m fine. Just a little sore, today.”</p>\n<p>She doesn’t even know why it slips out. She <em>is</em> sore, and tired – last night’s borderline-acrobatic sex is the closest thing she’s had to a workout in years – but immediately Kara turns pink, and Lena can tell she’s trying not to smile. A moment of understanding passes between them, a moment where Lena knows <em>exactly</em> what Kara is thinking about.</p>\n<p>“Yeah…me too,” Kara says, her voice low and rich. It makes Lena shiver.</p>\n<p><em>No</em>. No more shivers, no more swooping stomach. Last night happened, she can’t take that back, but now Lena has the whole thing out of her system, and she’s going to move on with her life.</p>\n<p>“But it…it won’t happen again,” Lena manages to answer, and the effect is instantaneous. Kara’s face falls slightly, but she nods, clearly understanding the meaning.</p>\n<p>“Right. Yeah, of course.”</p>\n<p>Lena can <em>feel</em> the disappointment that the statement brings. Kara looks like she almost wants to protest, but Lena turns away. She only has so much willpower, and rejecting Kara twice is more than she can take. Kara deserves someone who won’t hurt her just by being herself. Someone better.</p>\n<p>This is the right decision. For both of them.</p>\n<p>They move on from the topic quickly as students start to filter in, and the rest of the class is almost normal. At least, it’s almost this strange normal that she and Kara have settled into in the last few months. They teach their class with only a few shared glances, Lena pretends she isn’t thinking about how Kara looks when she’s driving into her with 7 inches, and one period later Kara is strolling back into Lena’s classroom because she spilled hydrochloric acid on her pants. She ends up having to borrow a pair of Lena’s slacks, which are both far too short and several sizes too big in the hips, and have to be held up by a belt.</p>\n<p>She looks ridiculous, like a child playing dress-up, but the sight of Kara in her clothes somehow still makes Lena feel a little bit hysterical.</p>\n<p>Three days. Lena lasts three days after their night together – three days of acting normal at work and bringing herself to orgasm after guilty, toe-curling orgasm at home, reliving their moments together as she fucks herself. It’s infuriating, how easily she breaks her own promises to herself – promises that she’ll forget the whole thing, that she can move past this infatuation, that this is the <em>last time. </em>But, Lena is weak.</p>\n<p>And finally, on day number four, she goes to Kara’s apartment.</p>\n<p>It’s a ridiculous idea. It’s a school night, and she’s just spent the last hour working herself up to a peak that wouldn’t come. Kara’s hands haunt her. Her mouth, her tireless hips – Lena’s body is craving something she can’t achieve herself, plagued by the memories of the hardest and most satisfying fuck she’s ever had, and after she’s brought almost to tears by her third almost-climax evading her she throws on the nearest clothes and breaks several speed limits driving to the address that she unintentionally memorized when Kara rattled it off to the cab driver.</p>\n<p>She notices things this time around that she didn’t that first night. The door she hammers on is a duplex townhouse, cute and well taken care of. It has several flowerpots on the windowsill and a brightly-painted mailbox next to it. Lena stands on a doormat that features cartoon lemons saying ‘<em>squeeze the day!</em>’, and when the door swings open, Kara looks genuinely stunned to see her there.</p>\n<p>“<em>Lena</em>?” Kara says, opening the door a little wider and revealing her comfy at-home clothes. “What are you -”</p>\n<p>But it’s too much for Lena to resist. Kara looks so fucking <em>sexy </em>in her low-slung joggers and tank top, her hair slightly wet and smelling so strongly of her familiar shampoo, and Lena has been unbearably, incurably <em>horny</em> for 3 straight days, and she truly does not have the patience for pleasantries right now.</p>\n<p>She crashes into the blonde like a comet, pushing Kara into the hallway and pushing her tongue into Kara’s mouth and pushing, pushing, <em>pushing </em>until they both hit the closest wall with a <em>thud</em>.</p>\n<p>And then, she stops pushing.</p>\n<p>She pulls back, instead. Pulls away from Kara’s lips - Kara chases them, eyes still closed, but Lena stops her with a hand on the chest. Blue eyes ease open, then, looking down at her in surprise and wonder. They’re still sharing air, heavy and latent with something unknown, and Lena breathes her next words against Kara’s mouth.</p>\n<p>“Do you want this?”</p>\n<p>There’s a moment of quiet - one where Lena’s heart feels like it’s on the edge of a cliff, a still breeze away from plummeting, and she isn’t sure whether she wants to stay or fall.</p>\n<p>Kara’s answer is to bend slightly, lift Lena under the thighs, and slam her into the adjacent wall. Kisses turn hot and deep, an almost frantic meeting of lips and tongues and teeth, and finally, <em>finally</em>, Lena’s three-day itch is scratched.</p>\n<p>Thoroughly. Four times.</p>\n<p>For the second time in a week she gathers her clothes in the dim light of Kara’s bedside lamp, and she can only find one sock and her panties are god only knows where but the silence in the room as Kara watches her with an unreadable expression is too thick, and the instinct to run drives her to leave the house without even putting on her shoes.</p>\n<p>She drives home barefoot, trying to sort through the tangle of emotions in her chest, and to her surprise the most prominent thread seems to <em>not</em> be shame or regret. Those old friends still make themselves known, of course, but they’re drowned out by something else - an undercurrent of intense <em>relief</em>.</p>\n<p>She leaves the wine bottle where it is when she gets home, and she wakes up feeling more refreshed than she has in years.</p>\n<p>And that’s how it is, for a while. They teach together during the day, their friendly relationship almost untouched; and at night, when Lena is feeling weak, she drives to Kara’s apartment – making sure to park a few streets away – and gives in to her guilty pleasure. But always at her behest, and always at Kara’s place.</p>\n<p>They’ve established a routine. Lena texts Kara first:</p>\n<p>\n<strong>[11:47pm]: <em>Are you home?</em></strong>\n</p>\n<p>And Kara replies like clockwork, never more than 3 minutes later.</p>\n<p>\n<strong>Kara Danvers [11:49pm]: <em>I can be</em></strong>\n</p>\n<p>They still don’t talk, before or afterwards. Lena shows up, Kara pins her against something, they spend several hours with their mouths otherwise engaged, and Lena leaves without saying a word. They’re always back to normal by the next morning – although, they both take to investing in more scarves and turtlenecks after Lena had to surreptitiously point out that a mark she left on Kara’s chest was showing through the opening of her shirt.</p>\n<p>The making out in random classrooms has stopped, for the most part, because Lena knows now that kissing Kara will inevitably lead to things that she would rather die than be caught doing at school. It’s dysfunctional and probably unhealthy, but right now it’s the only thing keeping Lena sane, and she’s accepted that it’s going to keep happening. She just needs to keep her boundaries up.</p>\n<p>As long as she can do that, as long as this whole thing doesn’t go too far, Kara won’t be hurt when it inevitably has to end. When she discovers that Lena isn’t good for her. That she isn’t good for anyone. Not romantically, anyways.</p>\n<p><em>It’s fine</em>, she reassures herself like a mantra as she feels an acute physical reaction rising inside her just from watching Kara bend to grab her lunch from the staff room fridge. <em>This is fine.</em></p>\n<p>\n<em>I’m fine.</em>\n</p>\n<p>But there are definitely times when she feels she is <em>not fine</em>, and she’s infinitely grateful when her best friend texts her in the middle of the week to announce that she’s finally on the West Coast again. When Jess knocks on her door with two bottles of wine and her always-present lightning wit, Lena fully relaxes for what feels like the first time in weeks.</p>\n<p>Jess is an outsider in this situation. She doesn’t know Kara, doesn’t know their coworkers or students, and she doesn’t put up with Lena’s shit – and Lena needs a neutral ear to process the shitstorm that her life has become.</p>\n<p>“Okay,” Jess says, as she tops off both of their glasses and uncorks another bottle. “So, you’re sleeping with this woman.”</p>\n<p>“Yes,” Lena replies, swirling the wine in her glass despondently.</p>\n<p>“Who you work with,” Jess continues, as she tallies up the information Lena has told her.</p>\n<p>“Yes.”</p>\n<p>“And she’s super hot, yes?”</p>\n<p>“Unbearably,” Lena groans into her glass.</p>\n<p>“And amazing in bed?” Jess asks nonchalantly, and Lena sighs, irritated.</p>\n<p>“<em>Jess</em>.”</p>\n<p>But Jess just throws her hands up in surrender. “I need a clear picture! Look, just tell me how many.”</p>\n<p>“How many what?” Lena edges, getting an idea of what Jess is asking but unwilling to give up the answer.</p>\n<p>“How many times does she make you come!”</p>\n<p>“Jesus <em>Christ</em>, Jess –“ Lena hisses, gesturing for her to quiet down even though it’s just the two of them in Lena’s living room. But Jess won’t give it up, crossing her arms and looking expectant.</p>\n<p>“Do you want my advice or not?”</p>\n<p>Lena sighs again, picking at her thumbnail. It’s not like she’s ashamed of sex, in any form – and she trusts Jess, implicitly. It’s just that, with Kara, it feels different. More private, somehow, like revealing any details will ruin this rhythm they have, this secretive routine.</p>\n<p>“I – it depends on –“ she says haltingly, and Jess pokes her in the side, making her squirm.</p>\n<p>“Come on, Lena, I’ve been single for 7 months. Give me the goods.”</p>\n<p>“5, on average,” Lena finally mutters, begrudgingly. “Usually more.”</p>\n<p>Jess looks at her evenly for a few moments, taking a slow, ponderous sip of her wine. Then she carefully sets the glass down, shifts forward on the couch, and smacks Lena on the side of the head.</p>\n<p>“Ow! What the hell –“</p>\n<p>“And you aren’t dating this woman <em>why</em>?” Jess yells, and before Lena can prepare for it she smacks her again.</p>\n<p>“I –“</p>\n<p>“5 on average? <em>On average?</em> Usually <em>more</em>?”</p>\n<p>Lena deflects the third smack, but Jess keeps up the tirade.</p>\n<p>“Why are you not locking this woman <em>down</em>?”</p>\n<p>“I can’t!” Lena finally manages to say, and Jess is surprised enough to stop with the hitting.</p>\n<p>“<em>Why</em>?”</p>\n<p>“She’s amazing, Jess!” Lena says, willing Jess to understand, but frustratingly her best friend just seems more exasperated.</p>\n<p>“<em>Exactly</em>, so why –“</p>\n<p>“She’s too good! Okay?” Lena finally yells, and after a few seconds of Jess staring at her like she’s grown a second head, she quiets her voice. “She’s…she’s sweet, and kind, and…and funny, and intelligent. She’s the most giving, selfless person I’ve ever met. And I won’t subject her to the psychological torture of being involved with a Luthor. She deserves better.”</p>\n<p>“Lena…” Jess says softly, and the irritation is replaced by pity. A deep, long-suffering pity that Lena hates even more than she hates herself for inspiring it.</p>\n<p>“We don’t have healthy relationships,” Lena says, matter-of-factly. “We have business transactions, and minions. We just take, and take, and leave our partners empty and broken. I won’t do that to Kara.”</p>\n<p>“That’s your family. That’s not you. Besides, I’m not a minion, am I?” Jess tries to interject, but Lena shakes her head, finishing off her wine.</p>\n<p>“You don’t count. It’s just…it’s better this way. She won’t get attached. It’s just physical. Friends with benefits.”</p>\n<p>Jess sighs heavily, and it’s a testament to how long they’ve known each other that she knows further argument is futile.</p>\n<p>“You can’t keep her at arm’s length forever.”</p>\n<p>“I know,” Lena agrees. “And when I can’t, I’ll cut it off. No hard feelings.”</p>\n<p>Jess looks doubtful, but Lena is at least confident in her ability to cut off relationships. If there’s one thing she can do, it’s clean break-ups. Leaving before anyone gets invested.</p>\n<p>She seals herself in this mental bubble, and determinedly ignores the tiny voice in her head that sounds a lot like Jess.</p>\n<p>The one whispering that it’s already too late.</p>\n<p> </p>\n<p> </p>\n<p>Kara is having sex with Lena Luthor.</p>\n<p>The sentence, the truth behind it, the memories of what Lena allows her to do on more nights of the week than either of them will admit – it still makes her head spin a little bit. She should have seen it coming, really, after all those kisses, but somehow she never really expected it to actually <em>happen</em>. It’s like assuming that one day you could be having sex with the Pope. It’s technically possible, in a world of infinite variables, but so ridiculously unlikely that you’d never truly entertain the idea.</p>\n<p>Not that having sex with Lena is anything like – okay, so it’s not the best metaphor. But in Kara’s defense, she hasn’t exactly been getting much sleep lately, what with Lena keeping her up until 2am on most nights as well as having to keep up with work (with Lena) and chaperoning extracurriculars (with Lena). It’s all Lena, all the time. Lena helping her not to melt the Bunsen burner during chem labs, Lena in soft clothes and no makeup after hours while they plan their classes, Lena naked on all fours with Kara slamming her into the mattress.</p>\n<p>Not that Kara is complaining. She has no idea why Lena has decided that Kara is worth her attention, but she’s happy to reap the benefits for as long as she can – and since the benefits include having the most beautiful woman she’s ever met in various naked positions in her bed more often than not, she does everything she can not to disturb the fragile balance they’ve struck.</p>\n<p>It should be easy. Clearly Lena wants no attachments, not so much as a conversation acknowledging what they’re doing, and Kara can do that. She’s had casual relationships before - prefers them, in fact – and this should be no different. But it <em>is</em>.</p>\n<p>She feels a longing when Lena silently slips back into her clothes and disappears every night, a sort of yearning that she’s not used to. She wants Lena to stay. She wants to fall asleep together, to wake up together, to lie in bed after they’ve spent the night exhausting each other and just <em>talk</em>. She wants more of those little moments she sometimes manages to wrangle when they’re alone - to learn about Lena’s past, hear her thoughts and opinions on absolutely everything. And, ideally, she’d like to do it naked.</p>\n<p>But she’s too intent on keeping Lena close in the only way she knows how, the only way she feels comfortable, and Lena doesn’t seem to want to change their dynamic either. </p>\n<p>There are strict unspoken rules, silently agreed upon by both of them. No acknowledgement of the arrangement, no talking outside of the heat of the moment, no more kissing unless it’s in a bed, no sleepovers, things stay professional at school. During business hours, their relationship hasn’t changed – outside them, Lena continues to give Kara the best sex of her life.</p>\n<p>It’s a confusing dichotomy. It’s necessary, to keep things casual, but it’s difficult to separate the desire to pin Lena to the nearest surface just because they’re at work, especially when Lena strolls into the classroom near the end of the month in a crisp white shirt, fitted vest, and a pencil skirt. Her hair is down, her lipstick is crimson, and Kara wants nothing more than to pull her into the office and rip her nylons in desperation, let those stilettos dig into her back as she gets on her knees on the linoleum.</p>\n<p>It’s hard to resist, but she manages to stick to just meeting Lena’s heated stares, and she gets to give in to her impulses a few hours later when Lena sends her their usual text message and knocks on her door 20 minutes later. Kara strips her down to her bra and nylons, and Lena graciously (and eagerly) lets her rip them down the middle and soothe the day’s frustrations with several rounds of enthusiastic oral.</p>\n<p>So, it’s good. More than good, it’s amazing, as long as Kara keeps her walls up, and follows their rules.</p>\n<p>This makes what happens in early March even more confusing.</p>\n<p>Logically, Kara can understand the sequence of events. The gym teacher, J’onn, breaks his ankle in a small car accident and a temporary sub is hired. The sub, Mike Elis, is a smug jock with no sense of boundaries. He hits on Kara in the lunchroom for 4 days straight. Lena also eats in the lunchroom. Lena noticeably stops eating every time it happens.</p>\n<p>These are the facts. But Kara isn’t quite sure how they line up.</p>\n<p>Lena has been pretty clear about her boundaries, and Kara couldn’t possibly be interested in Mike when she has someone like <em>Lena</em>, in whatever capacity she’s allowed to have her. The idea that she might be <em>jealous</em> is so far from Kara’s mind that it seems absurd. But nothing else can explain why, after a lunch period where Mike touches her shoulder and lower back a few too many times, Lena comes barrelling into her office after hours and suddenly Kara is the one being pressed to the wall, Lena’s mouth hot on hers.</p>\n<p>It’s been weeks since they’ve done this – this classroom dance, this venting of sexual tension via unexpected kisses. Kara half expects Lena to pull away and disappear. But instead, Lena pulls back and says something that takes a sledgehammer to the walls that Kara has been able to hastily throw up around her heart.</p>\n<p>“Come back to my place?”</p>\n<p>Kara hesitates, her hands gripping the material of Lena’s skirt.</p>\n<p>This is new. It’s a deviance from the routine – Lena has never outright <em>asked </em>her to hook up before. It’s always vague hints, the same veiled text messages, and they pretend it never happened until the next time. And they have absolutely <em>never</em> gone to Lena’s place. It’s always Kara’s apartment, and Lena doesn’t even park in her driveway.</p>\n<p>Now, Lena is looking at her with a slightly wild expression, and part of Kara feels like there’s going to be no turning back if she says yes.</p>\n<p>She gives her answer with another deep kiss, punctuating it with a bite to her lower lip.</p>\n<p>“I’ll drive.”</p>\n<p>Kara has never had a more dangerous drive in her life. Lena spends it nipping at her jaw, licking the shell of her ear, sliding a hand over her hip to wedge between her thighs and <em>press</em> – it’s heated and almost possessive, and it probably signals that this nebulous thing between them is a little bit unhealthy, but god, it makes her feel <em>wanted</em>.</p>\n<p>Lena’s place turns out to be a house, a cute two-storey in a slightly upscale part of town. Kara wants to look at every detail, but Lena is practically flying out of the car and tugging on her hand insistently as they hurry up the path, and Kara gets the message.</p>\n<p>The moment the door closes behind her, Kara is pressing forward, shucking her own coat and working on Lena’s. She takes note that the house is immaculately clean except for a slightly ajar door at the end of the hallway where Kara can see messy stacks of books and paper spilling from a cluttered desk.</p>\n<p>But Lena pushes her through a different door, already shirtless and ripping insistently at Kara’s buttons, and the state of Lena’s house leaves her mind entirely.</p>\n<p>It’s frantic, at first. Lena seems desperate to get them both naked, and their messy kisses reflect it. But it starts to slow, and Kara isn’t sure who starts the process but eventually they’re spread out on Lena’s bed, so much bigger than Kara’s standard double mattress, and for the first time she’s removing Lena’s bra with steady hands rather than practically ripping it off in haste.</p>\n<p>Usually Lena is insistent, pushing Kara to where she’s needed if she dawdles too long with foreplay, whispering heated instructions and pleas until Kara gives her what she needs. But this time she’s languid, and she lets Kara spend long, luxurious minutes exploring her body in a way she hasn’t had time for previously. Kara sucks at her earlobes, at the freckle on her throat, at her nipples and the soft skin of her ribs. It feels decadent, and the hand that Lena has threaded through her hair doesn’t push for once but just rests there, scratching gently at her scalp and occasionally tugging in a way that Lena has clearly noticed Kara likes.</p>\n<p>When Kara finally slips her fingers between Lena’s spread thighs, she’s so wet that the sound of it is louder than their combined breathing, louder than the breathy whine Lena lets out at the gentle touch. She starts with three fingers instead of working up to it and Lena seems grateful, but even their usual pace is different today.</p>\n<p>It’s slow, and measured, and borderline <em>loving</em>. Kara takes care of Lena, guiding her to peak after peak with a sure hand, and after the fourth time Lena is shaking, nonverbal and clingy. Her face is buried in Kara’s neck, and each stuttered breath seems laden with something more than arousal.</p>\n<p>“You can let go, Lena,” Kara murmurs, kissing every inch of skin she can reach as Lena clings to her shoulders and whimpers. “I’m here. I’m right here.”</p>\n<p>When Lena comes with a sob and Kara feels warm tears that aren’t her own wetting the side of her face where their skin touches, she doesn’t comment. Instead she just lets Lena ride it out, and her heart cracks wide open for this woman that, she can now admit, she’s been in love with for years.</p>\n<p>For a few moments, they just lie together, their bodies cooling and Kara’s fingers still buried. Kara starts to slip out, but Lena grabs at her wrist almost desperately, her eyes still squeezed shut and her teeth clamped down on her lip. She doesn’t say a word, but the meaning is clear.</p>\n<p>It means, <em>stay</em>.</p>\n<p>So Kara does. She stays inside Lena, laying gentle, comforting kisses over her neck and collarbone, her jaw, her hair. It’s a moment of closeness that she never thought she’d experience, and she honestly wishes it would never end – that she could just stay here, as close to Lena as humanly possible, until the world ends.</p>\n<p>But soon enough Lena shifts in the way that Kara has learned means she’s done for now, and she finally eases herself out, resisting her usual urge to slip her fingers into her mouth. The moment seems too heavy for it. Lena wipes the tears away furiously as soon as Kara pulls away, her jaw tight and flexing while she catches her breath and collects herself, and Kara settles down beside her.</p>\n<p>Averting her eyes to allow Lena some privacy, Kara lets her eyes wander around Lena’s room. It seems to be a clash between order and chaos – the furniture is all matching, pristine and black against the white walls, but most of the surfaces are covered in coffee mugs and books of some description. Her clothes are organized in the closet by colour and style, but they also lie haphazardly around the laundry basket and draped over a chair in the corner, as if Lena couldn’t choose what to wear this morning and didn’t bother to put them away.</p>\n<p>It’s all very endearing, and the canyon in her heart gets deeper.</p>\n<p>At this point in the night, Lena would usually get up and start to gather her things. But they’re at Lena’s house, and she can tell that the unfamiliar terrain is throwing the brunette off.</p>\n<p>It’s throwing Kara off, too. This whole <em>night</em> has thrown her off. Lena’s seeming jealousy, the softness of an act that Kara would usually call fucking but this time seemed like something else, and the tears that came at the end.</p>\n<p>For the very first time, Kara breaks the silence that usually follows their couplings and speaks softly while Lena is still breathing hard next to her.</p>\n<p>“I’m not seeing anyone else, you know.”</p>\n<p>She almost expected Lena to flinch when she opened her mouth. Her own voice sounds as loud as a gunshot in the familiar silence, but Lena seems to be expecting it.</p>\n<p>“Why would I care about that?” The shaky, emotionally charged tone of Lena’s voice says otherwise, and Kara shrugs.</p>\n<p>“I dunno. Just…making conversation.”</p>\n<p>Lena lets out a weary chuckle, tracing a nail over her own belly until a white line appears in its wake, a tiny scratch over the unmarred skin. “Since when do we <em>make conversation</em> when we do this?”</p>\n<p>It’s innocuous, but that little sentence – the acknowledgement that <em>something </em>is happening here, that <em>this is a thing that they do</em> – seems to shatter the fragile bubble that’s surrounded them for the last few weeks. Kara laughs, smoothing her sweaty hair away from her face, and Lena sighs, but she’s smiling.</p>\n<p>It’s the first time Kara has felt light after sleeping with Lena. Usually she goes home feeling heavy, full of bottled feelings and a little bit weary of the eggshells they walk on - this is new, and Kara is relieved at the change.</p>\n<p>“Fair point,” Kara acknowledges, and for a moment it seems almost like one of their classroom debates. “But now that we’ve started, why stop?”</p>\n<p>“A hundred reasons,” Lena whispers. They’re talking about more than this conversation, now, and they both know it.</p>\n<p>“And yet, here we are.”</p>\n<p>“Here we are,” Lena concedes. She stares at the ceiling, and Kara stares at her, and she can <em>tell</em> that Lena knows where her gaze is focused. But she seems determined to ignore it, staring resolutely up, and finally Kara sighs and starts to swing her legs out of bed.</p>\n<p>“Where are you going?” Lena’s voice calls from behind her, and Kara turns to see her propped on an elbow and looking right at her.</p>\n<p>“I – uh, I was going to…go home?” Kara offers, pointing at her pants, in a crumpled pile next to Lena’s left shoe.</p>\n<p>“You’ve only come twice,” Lena says, and there’s an air of apology around it. What she feels apologetic for Kara has no idea, but it’s better than the silence, and she laughs.</p>\n<p>“I figured you wanted me to go?”</p>\n<p>Lena rolls her eyes, crooking a finger at her. She looks disheveled and ravaged and beautiful, and Kara is climbing back into bed before she can think about it too hard.</p>\n<p>It’s strange. Three times Kara tries to leave, and three times she’s beckoned back to bed for another round or two – it’s as if Lena doesn’t <em>want</em> her to go. But she can’t want her to stay over. Right?</p>\n<p>It’s nearly 4 when Kara finally manages to get fully dressed. She has to dig around under Lena’s dresser for her keys, which seem to have flown from her pocket at some point, and when she pokes her head back up her eyes catch on something that rests on the surface.</p>\n<p>One ‘women of NASA’ Lego set, assembled.</p>\n<p>It’s the gift Kara got her for the holidays. Lena actually took the time to put it together, putting the little scientist figurines next to their respective machines and displaying it in her bedroom. There’s no other knickknacks in the room, besides books. But Lena keeps this here.</p>\n<p>It’s a display of care that Kara didn’t expect.</p>\n<p>Lena doesn’t seem to have noticed Kara’s moment of contemplation, too busy rooting around under her bed and pulling out a fallen pillow to prop under her back. She flops onto it, already pulling her hair into a messy bun. The blanket rests just under her bellybutton, and there’s a mark forming on her breast that’s shaped exactly like Kara’s mouth, and her entire body aches in the sweetest way at the sight of it.</p>\n<p>“What?” Lena asks when she’s finally settled, raising a brow. Kara just shakes her head, a warm feeling blooming in her chest.</p>\n<p>“Nothing. See you tomorrow, Lena.”</p>\n<p>She leaves with a small, secret happiness, and the next day her favourite tea is sitting on her desk after first period with a faint lipstick stain on the lip. Kara takes a sip of it, lining her mouth up to the mark and smiling.</p>\n<p>This thing with Lena can’t last forever, sure. Lena has places to go, amazing things to do in the future.</p>\n<p>But right now, can’t she just be happy?</p>\n<p> </p>\n<p> </p>\n<p>Things have escalated very quickly.</p>\n<p>Everything had been under control, for a while. There were rules, however unspoken, and Lena could compartmentalize her life – more specifically, her relationship with Kara - into two distinct sections that must never touch. Now they’re definitely touching, and Lena doesn’t know how to make it stop.</p>\n<p>It all started going downhill when that stupid pube-bearded gym substitute showed up.</p>\n<p>Lena isn’t jealous. She’s <em>not</em>. There’s no reason for her to be – she and Kara aren’t dating, and Kara doesn’t seem interested in the guy anyways. But every time he put his hand on her lower back with that smarmy smile it made something deep and unpleasant crawl up her spine, and in some kind of fit of insanity, she invited Kara back to her place. And they <em>spoke</em>. And now, everything is different.</p>\n<p>Now, they’re talking during their trysts. They sometimes even cuddle afterwards, and every so often, it’s Kara who texts Lena asking to come over. They still haven’t defined anything, haven’t made any attempt to clarify things, but nevertheless their arrangement is starting to leech into other parts of Lena’s life like water crawling its way up a piece of fabric.</p>\n<p>Like now. Kara had been so excited to suggest a class field trip to the Smithsonian, and in her defense, the kids are loving it – but as soon as the planning gets underway Lena is transported back to that night in January, when she kept herself up until the early hours in fear of what her sleeping body might do and then, lo and behold, she woke up to Kara jarring her in her attempt to extract herself from the sloth-like cuddle Lena trapped her in.</p>\n<p>Now that they’re actually sleeping together, her self-control is even worse.</p>\n<p>They get separate rooms this time, at least. There’s no clerical mistake, and their rooms are across the hall from each other, with a few rooms between theirs and the students. But even with their separate rooms Lena ends up in Kara’s anyways, ass in the air and face pressed into the pillows to muffle her moans.</p>\n<p>It’s dangerous, to do this when the kids they’re chaperoning are in rooms just down the hall. It’s unprofessional and very, very risky. But Kara looked incredible in her fitted black top and pants today, her hair in a crisp bun as she guided their group around the Air and Space Museum, and Lena has been thinking about unraveling it since they stepped off the bus this morning.</p>\n<p>Kneeled behind Lena with her hair half-out of its bun and most of her clothes tangled in the hotel sheets, her fingers driving in with devastating precision until Lena has to bite the pillow as she comes, Kara certainly looks unraveled.</p>\n<p>She also seems determined not to stop until Lena has properly forgotten all the reasons this was a bad idea. When Kara finally collapses beside her, breathing hard, Lena stretches out on her belly and feels every muscle and joint in her lower body stretch and pop in a way that’s almost as satisfying as the multiple orgasms.</p>\n<p>Despite having been inside her not 30 seconds ago, Kara’s eyes still track the slow movement over Lena’s body as she stretches with interest, her own abs still flexing with exertion on every exhale.</p>\n<p>Lena snorts.</p>\n<p>“You cannot <em>possibly</em> want to go again.”</p>\n<p>“With you? Pretty much always,” Kara replies easily, and the raw honestly hiding behind the joking statement makes Lena’s breath catch. Suddenly, eye contact with Kara seems unspeakably intimate.</p>\n<p>Instead she flips over, looking up at the ceiling and focusing on how her body feels – still buzzing with the aftereffects of 4 orgasms, her fingers and thigh sticky with Kara’s release. She lets herself feel content for a few moments with Kara’s comforting presence next to her.</p>\n<p>“Lena?”</p>\n<p>The contentment starts to drain away at the hesitant tone in Kara’s voice. She’s clearly about to ask something important. Something that Lena would prefer not to talk about at all, let alone in a hotel room where they have to whisper because their students are down the hall.</p>\n<p>“Mmm?” Lena hums, trying to sound noncommittal.</p>\n<p>“Is this – are we…are you good?”</p>\n<p>The question is strangely worded enough that Lena tears her eyes away from the plaster swirls on the roof to look at Kara quizzically.</p>\n<p>“What?”</p>\n<p>Kara clears her throat, reaching up to where her glasses usually sit and looking flustered when they aren’t there for her to fiddle with. Her hand goes instead to Lena’s stomach, using a soft fingertip to play connect-the-dots with the smattering of freckles and moles across her torso.</p>\n<p>“I mean – what we’re doing. Are you…okay with it?” Kara finally clarifies, and Lena shifts with sudden unease. Kara’s hand stops immediately, interpreting her movement as discomfort, and Lena finds herself missing the contact.</p>\n<p>They’ve been existing in a way that works, however strangely. Sure, she might have cried during sex a few weeks ago, but that was an anomaly. A complete outlier, borne of having a bad day and <em>nothing else</em>. Why do they have to <em>talk</em> about it?</p>\n<p>“Why do you ask?” Lena edges, and Kara’s answer shifts her perspective slightly.</p>\n<p>“I just…I want to make sure you’re happy. With all of this, with how we…do this. We haven’t really talked about it – and that’s fine! But you deserve to be happy.”</p>\n<p>Lena’s throat feels thick. Kara, ever-considerate Kara, wants to make sure that <em>Lena</em> is happy. Lena has been blatantly using her for months, calling her whenever the craving for Kara’s touch gets too strong and then refusing to acknowledge it even in private, and Kara is worried about whether Lena is <em>happy</em>.</p>\n<p>“Of course I am,” Lena says, the lie feeling sticky in her throat. Kara nods, but the bright smile Lena is used to seeing seems a little dim.</p>\n<p>“Okay, good! Me too.”</p>\n<p>After the strange, stilted, but definitely open acknowledgement that they are in fact in some sort of entanglement, the floodgates seem to open and their old rules are forgotten at an alarming rate.</p>\n<p>First, Kara pecks her on the lips as she’s leaving Lena’s apartment in the early morning, a gesture of affection that Lena thinks about for days afterwards. It leads to more casual kisses, until Lena has to forcefully stop herself from kissing Kara between classes at work.</p>\n<p>The next to be abandoned is the sleeping-over rule. For the duration of their relationship thus far, Lena considered sleeping over to be possibly the highest on the list of things <em>not</em> to do – but, when Kara falls asleep in her bed after a particularly intense night, Lena doesn’t wake her up. Instead she curls into her side, letting herself enjoy the warmth (just for one night). And, afterwards, it becomes a habit. Over the course of a few weeks, Lena becomes almost as familiar with waking up in Kara’s bed as she is with her own.</p>\n<p>And then, of course, staying over means Lena accumulating a few necessary things at Kara’s house – a toothbrush, a change of clothes, a phone charger (who uses android?). Kara’s favourite CDs somehow end up in Lena’s car, and they now eat together so often that Alex starts squinting at them with suspicion in her eyes when Kara picks a cherry tomato from Lena’s salad in the work lunchroom, eating it willingly, and Lena doesn’t even glance up from her book. It’s a gradual climb, a slow boil into a kind of simple intimacy that Lena would have run screaming from a few months ago.</p>\n<p>She might run screaming still.</p>\n<p>Especially when, in April, one of her planning sessions with Kara is interrupted by her phone lighting up with a familiar contact number. She excuses herself and steps into the hallway, steeling herself as she answers the call.</p>\n<p>“Hey, kiddo.”</p>\n<p>Her brother’s greeting is always the same, and Lena tries to temper the affection that follows it almost automatically.</p>\n<p>“Lex. To what do I owe the pleasure? Has it already been 6 months since you told me I was wasting my potential?”</p>\n<p>Lex sighs, and Lena can tell he was hoping for a friendlier greeting. “You know I have to keep trying to change your mind. You’re not meant to be a high school teacher, Lena.”</p>\n<p>“I <em>like</em> being a high school teacher.”</p>\n<p>“You also like actually applying your genius,” Lex says, and Lena can’t deny the truth of it. “Mom will never admit it, but you’re smarter than me. You know you are.”</p>\n<p>“I’ve always known that,” Lena says, her irritation softening, and Lex laughs before he takes on a more serious tone.</p>\n<p>“Do you remember that research you did when you interned here in grad school?” he asks, and Lena thinks back. “On nanotechnology?”</p>\n<p>“Of course. My project with Jack.” Jack had been a great partner – charismatic and smart, and ridiculously good at programming. Lena had always felt like their work went unfinished, but her internship had ended, and soon after that she got her job here.</p>\n<p>“I dug it out again a few months ago,” Lex says, and Lena can hear the pride in his voice. Not for himself, but for her. “It turns out you were just a few steps away from a breakthrough.”</p>\n<p>“…what?” Lena whispers.</p>\n<p>“We used your research to make a major step in cancer treatment, Lena. Even when you’re not here, you’re making an impact. Imagine what you could do if you <em>were</em>.”</p>\n<p>Lena is stunned.</p>\n<p>Her research. <em>Her research</em> was used to do something truly incredible. She left the family business to feel like she had her own life, some kind of control, and she got it in this job where she feels like she makes a small difference in the lives of her students – but that need to <em>help</em> never left her. She knows, without a doubt, that she’s the most competent scientist that LuthorCorp could possibly hire, and the knowledge sits heavy in her gut.</p>\n<p>She could <em>help</em>. She could change, make a difference, make an imprint on the world.</p>\n<p>“Look, I know you didn’t want to answer to me, or to mom,” Lex continues, sensing her hesitation. “But mom is taking a step back to focus on other things, and if you come work with me, I want you to be my CFO.”</p>\n<p>Lena reels back a little at that. This is, by far, the most that Lex has ever offered her. Usually he calls to tell her to take on R&amp;D jobs, to work in the lab where the science happens, but CFO? Second in command, with most of the powers that Lex himself has? She could steer the company in new directions.</p>\n<p>“I want to make a move, make a new branch in National City. You wouldn’t even have to relocate, or work with me. You could oversee it, and then run it,” Lex says, and his voice gets a little quieter. “And besides, I don’t want to keep doing this forever. I want to be able to pass the company down to someone I can trust, someday soon.”</p>\n<p>Lena shakes her head, not fully believing what he tells her. “This is insane. You’re handing me a Fortune 500 company.”</p>\n<p>“You know you can do it as well as I do. Better, even.”</p>\n<p>She knows he’s right. But, it would mean leaving here, where she’s been so happy. It would mean work would become her life. It would mean less time for the blonde woman waiting for her in her classroom.</p>\n<p>She’s never seen a CEO with a healthy relationship. Lex himself is one of the loneliest people she knows, even if he won’t admit it.</p>\n<p>“I’ll…I’ll think about it,” she says finally, and Lex lets her go with that promise.</p>\n<p>When she steps back into the classroom Kara is in the middle of an air guitar solo, singing along to the tiny radio she keeps in her office in an adorably goofy moment of imagination, and she grins at Lena’s arched brow. Affection rolls through Lena, tinged with apprehension from the phone conversation.</p>\n<p>“Hey!” Kara says, dropping her air guitar. “Anything important?”</p>\n<p>After a pause, Lena shakes her head and sits back down, putting her socked feet back in Kara’s lap.</p>\n<p>“No. Not really.”</p>\n<p>The lie stays in the back of her head for days afterwards.</p>\n<p>The Mathletes finals creep up unexpectedly fast. After Lex’s offer, it feels like the end of the year is rushing up to meet her far too quickly, and all Lena wants is more time. More time with Kara, more time to savour what might end up being her last year being a teacher. More time to make her decision.</p>\n<p>The competition is in National City this year, so the trip is at least not an overnight one. They just need to bus the students to and from the conference centre in the city, and manage to get lunch for everyone. Lena feels almost as nervous as the team, sitting in the first row next to Kara – while their students solve equations and word problems, she squeezes Kara’s hand in a death grip, cheering them on under her breath.</p>\n<p>The score is tied up by the last round, and Lena is pretty sure she and Kara have both lost all circulation to their hands. The question the announcer puts up on the projector is a trick one – the answer is almost a riddle, and she can see the students on both sides struggling with it. When the team from Star City hits their buzzer, she can hear Kara hold her breath.</p>\n<p>But, they’re <em>wrong</em>. The opposing team says the wrong answer, and it’s all Lena can do not to yell the right one out – but she trusts the kids, trusts that she and Kara taught them enough to figure it out.</p>\n<p>When Eve Tessmacher tentatively hits her buzzer and says the correct answer in a shaky voice, and the announcer claps his hands and says that they have a winner, Lena is up and out of her seat in a heartbeat. Kara is next to her, jumping up and down and whistling, and she herself is yelling, and the students are all stampeding off the stage to meet them in a big group hug.</p>\n<p>They probably look absolutely ridiculous, making such a fuss about a trophy for a high school math competition, but she doesn’t care.</p>\n<p>Eve is the hero of the day on the bus ride home. They all recount those final moments a hundred times, Kara dramatizing the story with sound effects, and finally, with a bright red face, Eve admits that she did a pretty good job.</p>\n<p>The arrival back at the school feels almost like deja-vu. The students get into their parents cars, the bus drives away, and she and Kara are left standing together in the parking lot, a big plastic trophy between them.</p>\n<p>“We can put this up next week. Yeah?” Kara says, holding the trophy up, and Lena’s body reacts viscerally to the reminder of what happened last time. Their heated kiss, Lena running away, driving off in separate cars and trying not to take care of the problem herself. This time, she’s free to go home with Kara. In fact, she has to, because she drove in with her this morning.</p>\n<p>There’s something shocking in that revelation.</p>\n<p>It’s alarming that she never considered it before, but – she and Kara <em>carpooled</em>. Her car is at Kara’s, parked in the driveway. She spent the night last night and they got dressed together this morning and she brushed her teeth in Kara’s bathroom and drank coffee in Kara’s kitchen, and they drove to work together. Like a couple.</p>\n<p>It’s almost more startling that the idea makes her sort of…happy.</p>\n<p>As if she can sense Lena’s thoughts, Kara grins and holds out a hand, nodding her head towards her car on the other side of the lot. With almost no hesitation, Lena takes it.</p>\n<p>Lena has never experienced this many different kinds of sex with a single person. When they first came together, it was fast and frantic – a venting of steam, ripping of clothes and hard, fast rhythms that sated her shameful cravings. And it’s still like that, sometimes – there are still days when they’re so desperate for each other that Lena’s shaky hands rip the buttons of Kara’s shirts, when they can’t even take the time to get fully naked before they’re inside each other.</p>\n<p>But slowly, something else developed. Now there are days when it’s soft, and slow, where their couplings almost line up with how Lena thought sex with Kara Danvers would be. Where Kara unravels her so carefully and with such reverence that she feels like something precious. Where she can take full, luxurious minutes to run her lips and tongue over every inch of Kara’s taut stomach, her inner thighs, every fold and ridge of her centre.</p>\n<p>And now, a new evolution.</p>\n<p>Their kisses start as soon as they’ve unlocked Kara’s door, but they’re soft and easy, unpressured. Full of smiles, of playful nips and breathless laughter. Kara tickles her slightly when she pulls off Lena’s shirt, and Lena pokes at her stomach in retaliation. Kara gets tangled in her own pants, and instead of just waiting for her to <em>get over to the bed already</em>, Lena laughs at her, and throws a pair of balled-up socks at her torso.</p>\n<p>“Get over here, doofus,” Lena grins, and Kara wiggles and hops until she can flop on the bed, giggling. Lena detangles her, removing the pants with a look that reads<em> ‘was that so hard?’,</em> and Kara grins and strokes the side of her face affectionately as Lena kisses down her stomach.</p>\n<p>It all feels easy, and light, nothing like the heaviness that Lena always associated with sex before this. It’s <em>fun</em> - even when, in the process of coming, Kara digs her heel into Lena’s back in a way that makes her grunt in discomfort. She smacks Kara’s thigh, grinning despite the cramp.</p>\n<p>“<em>Jesus</em>, Kara! This is sex, not a shiatsu massage.”</p>\n<p>“I’m sorry, I was really into it! I can’t help that you make me come so hard,” Kara fires back, and Lena blushes as she brushes her off.</p>\n<p>“Weirdo.”</p>\n<p>Kara’s answer is to pull Lena back up and flip them both, easing herself down between Lena’s thighs and wiggling her eyebrows suggestively.</p>\n<p>“You love it.”</p>\n<p>Lena has never laughed during sex. Sex is serious, an occasional indulgence to release tension. Joking while Kara’s mouth is on her clit is something she never would have considered possible. Something she never thought she’d be comfortable enough to do with anyone.</p>\n<p>But, here they are. The feeling that sparks in her when Kara nips playfully at her inner thigh, grinning up as she licks teasingly, is something else entirely.</p>\n<p>It’s something she’s never felt before.</p>\n<p>She’s still recovering from her second orgasm when Kara pops her head back up, wiping at her mouth and chin.</p>\n<p>“I’m <em>never</em> going to get tired of doing that,” Kara says dreamily, almost to herself, as she slips her fingers into her mouth with a satisfied noise.</p>\n<p>\n<em>I’ll never get tired of it, either.</em>\n</p>\n<p>The thought is startling, but the more she thinks about it, the truer it seems. The idea that, if she were to keep sleeping with Kara for the rest of her life, she’d be perfectly happy. She’d even be happy just spending time together, waking up together, falling asleep in her arms.</p>\n<p>\n<em>Oh, god. </em>\n</p>\n<p>It’s not just casual, anymore. Lena might be out of touch with her feelings, but she’s not an idiot.</p>\n<p>This brand-new knowledge sits heavy in her chest as Kara flops down next to her, pulling her close and kissing her jaw.</p>\n<p>“You’re the best, you know that?” Kara mumbles into her hair, already dozing, and Lena wants to squirm away from the praise. But with Kara warm and heavy next to her, sleep overtakes her alarmingly quickly, overriding her anxious brain.</p>\n<p>Her last thought before succumbing is one she’s been tossing around for a while, but seems especially apt now.</p>\n<p>\n<em>She deserves more than what I can give her. </em>\n</p>\n<p> </p>\n<p> </p>\n<p>May comes and goes in a whirlwind of days and nights spent tangled with Kara in one way or another, trying desperately to distance herself from the growing knowledge that she’s in too deep, and before Lena knows it, it’s prom season.</p>\n<p>It’s a time that, in previous years, Lena hardly thought about at all. It’s always sad that the year is inching closer to its end and she’s going to have to say goodbye to some of her favourite senior students as they go off to college, but prom itself isn’t a factor in her life.</p>\n<p>But, of course, it’s a factor in Kara’s.</p>\n<p>“Are you chaperoning prom this year?” Kara asks absent-mindedly, naked and sweaty in Lena’s bed for the fourth time in a week. Lena stops abruptly in her attempt to trace her own name in looping cursive over Kara’s abs with a fingernail.</p>\n<p>“Have I <em>ever</em> chaperoned prom?” Lena snorts, and she feels Kara’s chest rumble with a laugh. “It sounds like a nightmare. I didn’t even go to my own.”</p>\n<p>“<em>What</em>?” Kara asks, almost dislodging Lena completely when she props herself up on her elbows. “Why not?”</p>\n<p>“I graduated high school when I was 15. I was finished college and on to grad school before I was 20. I didn’t exactly have time,” Lena says drily, and Kara squints down at her. Lena isn’t sure if it’s because she’s concerned, or just because she isn’t wearing her glasses. Either way, it’s cute.</p>\n<p>“…you were 15?”</p>\n<p>“I was turning 16,” Lena counters. Kara just shakes her head.</p>\n<p>“You <em>have</em> to go to prom.”</p>\n<p>“Well, unless you have a time machine…” Lena drawls, but Kara won’t be deterred.</p>\n<p>“Come chaperone with me! It’ll be fun, we can dance and drink spiked punch and get a hotel room and everything. The whole experience.”</p>\n<p>“You’d let them spike the punch?” Lena asks, still trying to fully process what Kara is asking. “Isn’t the point of a chaperone to stop that sort of thing?”</p>\n<p>“And ruin their good time? As long as they don’t hurt anyone, I don’t think there’s any harm,” Kara says with a wave. Lena laughs quietly. Typical Kara – she’s still the exact same woman she was all those years ago when she comforted a panic-ridden Lena on her first day. The one who couldn’t imagine telling on the janitor for forgetting to turn off the air conditioning, in case they got in trouble. The thought fills her with affection.</p>\n<p>“And, a hotel room?” Lena says, watching Kara get more and more excited about the idea.</p>\n<p>“Yeah! It’s a thing, you know. Everyone wants to lose their virginity in a nice hotel room at prom,” Kara says with a wink, and Lena gasps, poking her in the chest.</p>\n<p>“Oh my god, Kara, please tell me you didn’t.”</p>\n<p>“No!” Kara says, giggling and batting her hand away. “No, I was a lot older when I…you know. Not until college.”</p>\n<p>“So you want to…what, recreate the experience?” Lena says doubtfully, but Kara doesn’t seem at all affected by her skepticism.</p>\n<p>“It could be fun!”</p>\n<p>Lena wants to say no. She <em>means</em> to say no. But the puppy-dog eyes of Kara Danvers are impossible to resist, and like clockwork three days later she’s dress shopping while Kara texts her their hotel reservation.</p>\n<p>So much for that Luthor spine of steel.</p>\n<p>She feels unnecessarily nervous, getting herself ready for a dance she didn’t really want to go to in the first place. The dress she bought isn’t formal – it’s black, and it shows a lot more shoulder than her regular work dresses, but she made sure to avoid looking like she’s trying too hard – and she’s going simple with her hairdo, but when Kara rings her doorbell just as she’s finishing up her makeup, she can’t help the butterflies in her stomach.</p>\n<p>The butterflies become a swarm when she opens the door.</p>\n<p>Firstly, Kara is in a tailored suit. The fabric is deep red, with a crisp white shirt and a matching tie, and it’s tight on every part of her body all the way to her polished dress shoes. Her hair is down in perfect waves, and her face is bare and handsome. She’s wearing lip balm and nothing else, and Lena wants to mix it with her own lipstick.</p>\n<p>The effect is devastating. But Lena is gratified, at least, that she seems to be having the same impact on Kara. Her eyes haven’t left Lena’s chest since the door opened, and it takes Lena clearing her throat for the line of sight to break.</p>\n<p>“You look…<em>wow</em>. You look incredible, Lena,” Kara says, her voice hushed. A blush colours her cheeks, as if she realizes exactly how affected she sounded.</p>\n<p>“Likewise,” Lena manages to say, and she’s proud of how she kept the squeak out of her voice that usually accompanies feeling this breathless.</p>\n<p>Kara is moving nervously from foot to foot, and she’s holding her hands behind her back in a curious way. When Lena tries to look around to see what it is, she shifts with a grin. “No peeking!”</p>\n<p>“Well, come inside and show me what it is, then.”</p>\n<p>Kara steps in, twisting so that Lena can’t see the surprise.</p>\n<p>“Kara, honestly, whatever it is, just <em>show</em> me –“ Lena huffs, and with a roll of her eyes Kara finally thrusts the thing forwards.</p>\n<p>It’s a tiny flower arrangement – in deep red, just like Kara’s suit – attached to a bracelet.</p>\n<p>A corsage.</p>\n<p>“I know this isn’t exactly the same – you can’t dance with all your friends or get wasted at the afterparty. But I wanted to try to make up for you missing prom,” Kara says, and her hands shake almost imperceptibly as she offers the tiny gift with so much meaning.</p>\n<p>Against her will, Lena’s eyes start to water. She swallows hard against them, willing them not to ruin her makeup, and takes the offering.</p>\n<p> “It’s…it’s perfect,” she manages to say, her voice cracking only the slightest bit. “Thank you, Kara.”</p>\n<p>“Here, let me –“ Kara gently slips the bracelet over her wrist until it fits snugly, and then her hands rest with Lena’s, playing with her fingers.</p>\n<p>“I’m glad you like it,” Kara whispers, and all the hopeless love Lena has ever had for her rushes forward, and she does the only thing she can do to deflect – she leans up on her toes, and kisses her. She can feel Kara smile into the kiss, and when Lena pulls away, her gloss has a crimson tint.</p>\n<p>She swipes her thumb across Kara’s lower lip, wiping at the stain and reveling in the way Kara’s eyes widen. </p>\n<p>“Let’s get out of here, hm? We have a dance to get to.”</p>\n<p>The dance itself is exactly what Lena thought it would be. A huge hall full of teenagers getting rowdy, drinking punch that definitely has at least a 12 ounce bottle of smuggled rum in it, and dancing borderline inappropriately. But Kara is there, in <em>that suit</em>, being her usual self and dancing like a goof just to make her laugh, and against her better judgement she’s actually having a good time by the end.</p>\n<p>The whole thing is starting to wind down when Kara throws her a wild card.</p>\n<p>Something soft and slow comes on the speakers, and as the students start to pair off, Kara holds out a hand. Lena looks down at it, brow arched, and Kara laughs, her palm still outstretched.</p>\n<p>“May I have this dance?”</p>\n<p>A spike of fear pulses through her, almost instinctively. Kara wants to dance, <em>here</em>, in front of ¼ of the student body and several of their coworkers. It’s a terrible idea.</p>\n<p>But when she takes a surreptitious glance around, they aren’t the only teachers having fun. Winn is being spun by James in the middle of the dance floor to the students’ delight, and Alex is off in a corner swaying and laughing with a woman Lena recognizes as Ruby Arias’ mother.</p>\n<p>Briefly, she wonders why Ms. Arias is chaperoning, when her daughter is only a freshman.</p>\n<p>But, there are more important things to consider – such as, Kara with one foot on the dance floor and a hand outstretched.</p>\n<p>It’s fine. Nobody will suspect anything if they have a normal, friendly dance. And, she has to admit, she wouldn’t hate being held in Kara’s arms in that tight suit she’s wearing. So, she lets Kara pull her onto the dance floor. Despite keeping a respectable distance between their bodies, Lena still feels a flare of heat where Kara’s hand rests on her waist.</p>\n<p>“I’m glad you decided to be my prom date,” Kara whispers cheekily.</p>\n<p>“Shh!” Lena hisses, glancing around, but she can’t hide her smile.</p>\n<p>“Are you having a good time?”</p>\n<p>“Surprisingly, yes,” Lena admits, adjusting her grip on Kara’s hand so it doesn’t look quite so intimate. “You’ve shown me the benefits of school dances. They aren’t <em>all</em> bad.”</p>\n<p>Kara laughs, and slowly Lena starts to forget about everyone who could be watching. The song reaches a crescendo, and she’s getting lost in Kara’s eyes, and god <em>damn</em> it if she doesn’t feel like the 17-year-old infatuated girl at prom that she never got to be.</p>\n<p>She is in <em>so</em> deep.</p>\n<p>And when the dance is finally over, the decorations cleaned up and the students all shuttled off to their afterparties, Kara pulls a hotel keycard out of her wallet.</p>\n<p>It’s nothing fancy, the place Kara brings her to. It’s a basic, moderate Marriott on the other side of town, booked in the hopes that they won’t run into any students – but there’s champagne waiting for them when Lena opens the door to their room and Kara grins, expertly popping the cork and pouring them foaming glasses.</p>\n<p>When they’re empty, Lena feeling a little more relaxed, Kara takes the flute from her hand gently and sets them both on the table next to the open bottle.</p>\n<p>“Don’t worry,” Kara whispers with a wink as she pulls Lena closer by the hips. “’I’ll be gentle.”</p>\n<p>“God, shut <em>up</em>, you dork –“</p>\n<p>But, true to her word, it <em>is</em> gentle. It’s gentle, and slow, and heartfelt. Every second of it.</p>\n<p>It’s almost alarming, how quickly and easily she melts into Kara. The second their lips touch, her response is almost Pavlovian – she feels hot and alive and ready, already pushing Kara’s jacket from her shoulders and running her hands over the soft fabric of her shirt.</p>\n<p>“Someone’s impatient,” Kara murmurs, and the low timbre of her voice makes Lena shiver. And, to her embarrassment, Kara <em>definitely</em> feels it. She grins into the kiss, sliding her hands over Lena’s dress and toying with the zipper between her shoulderblades.</p>\n<p>“And you’re being a tease,” Lena says with a raised brow, fumbling with Kara’s buttons as the blonde just grins at her knowingly. “Isn’t it <em>my</em> prom night?”</p>\n<p>Kara concedes the point begrudgingly.</p>\n<p>She slips out of her suit quickly after that. Lena is almost relieved, until Kara decides to spend whole decadent minutes getting Lena’s dress off, unhooking her bra, teasing her over her underwear. True to form she guides Lena to the edge and keeps her there, answering Lena’s pleas for relief with hushed assurances that she’ll get there. <em>Just be patient.</em></p>\n<p>And, as she’s been doing for months even when she couldn’t admit it, Lena gives herself over with no hesitation.</p>\n<p>Kara is true to her word, finally pushing Lena over into an orgasm that makes her body arch fully off the bed, and despite her best efforts she can’t stop a few tears from spilling over at the reverence on Kara’s face as she guides her through. Lena manages to turn the tables once, or twice, encouraging Kara to ride her thigh or let her slip her fingers between them, but soon enough the blonde’s attention is fully focused on her again.</p>\n<p>And again.</p>\n<p>When Kara finally stops for a break, grabbing them both a glass of water, Lena is pretty sure her voice is already hoarse. She drains the water in a few seconds, suddenly realizing how parched she is.</p>\n<p>“Thanks,” Lena rasps as Kara takes the empty glass back, setting it on the bedside table next to the bottle of champagne. After a moment of consideration, Kara grabs the bottle and takes a swig from it, grinning as the bubbles tickle her mouth.</p>\n<p>“Want some?” Kara asks, holding it out to Lena, and Lena has a moment of intense self-awareness. She’s spread out in bed in a mid-range hotel room, naked and half-sated next to a gorgeous woman, drinking champagne directly out of the bottle after prom. If her mother could see her now, so uncaring of everything she was told to value growing up, she’d have a heart attack.</p>\n<p>It’s with a savage sort of satisfaction that Lena accepts the bottle and takes a long, happy drink.</p>\n<p>“See, I knew you knew how to have fun,” Kara winks, taking the champagne back. Lena pokes at her shoulder in offense, making her choke a little on the mouthful as she laughs.</p>\n<p>“What made you think I <em>didn’t</em>?” Lena challenges, and Kara snorts.</p>\n<p>“Are you kidding? Miss “I hate holidays, I didn’t go to my own prom, no Kara you can’t do that experiment –“</p>\n<p>“I stop you from blowing your lab up <em>one time</em> and you think I’m the fun police,“ Lena grumbles.</p>\n<p>Kara laughs, nudging her with a shoulder. “I’m just saying, you come off as very…serious. I’m glad I know you better than that, now.”</p>\n<p>The reminder that Kara <em>knows</em> her, probably better than anyone in the world besides Jess, makes Lena’s breath catch in her throat. Unsure how to change the subject, Lena grabs the bottle back from Kara and takes another long drink, and before Kara can keep talking, she silences her with a kiss.</p>\n<p>Thankfully, the conversation gets lighter after that. They pass the bottle back and forth, laughing and trading kisses between, until it’s over half empty and Kara sets it back on the bedside table. She stands up again, and while Lena misses her warmth, she can’t deny that she’s enjoying the visual of Kara in all her glory in the glow of the lamps.</p>\n<p>“Hey, I almost forgot! Speaking of <em>fun</em>,” Kara says, leaning down to grab her duffel bag from the floor and rooting through it.</p>\n<p>“Should I be worried?” Lena asks, propping herself up on an elbow, and Kara’s response is to pull something out of the bag with a grin – something intimately familiar now, a mess of black straps and blue silicone that makes Lena’s heart rate kick up a notch.</p>\n<p>“Fuck,” Lena breathes, as Kara steps into the harness and starts to buckle. “This is <em>much</em> better than high school.”</p>\n<p>Kara is laughing when she crawls onto the bed, and Lena hooks a leg around her waist to pull her closer.</p>\n<p>“I should hope this is better than high school, <em>Miss Luthor</em>,” Kara teases, dragging the silicone against Lena’s centre, and Lena’s hips jump as she grabs a fistful of blonde hair, pulling her close enough to kiss.</p>\n<p>“Shut up and fuck me, Danvers.”</p>\n<p>For all her teasing, Kara knows when to follow a command. It’s only a few minutes later that Lena is communicating only in high-pitched whines, her body winding tighter and tighter under Kara’s attention. The hotel bed has a solid headboard, no convenient slats for her to grab while Kara fucks her, and in her desperation for something to wrap her hands around, she ends up grasping at the bedside table.</p>\n<p>Of course, she forgot about the bottle they left there.</p>\n<p>She can see it rocking back and forth at the same rate as her body. She knows, intellectually, that she should let go. But her hand doesn’t seem to be listening to her brain, and before she can relinquish her hold, the champagne tips, hitting the table and splashing over the wood. The movement of it, in time with their hips, means that more gushes out with every thrust, and it spills all over the sheets and splashes onto Lena’s torso and Kara’s back but neither of them is stopping – Kara just lifts Lena’s legs up to wrap around her waist, and goes harder.</p>\n<p>There’s something painfully erotic about it. Kara doesn’t seem to care that she’s covered in spilled champagne – she just licks it off of Lena’s chest, lets it drip down her neck and dampen her hair. Their kisses taste like it, and Lena smells champagne and sweat and Kara as the blonde murmurs encouragements in her ear.</p>\n<p>“You’re so good, you’re so <em>beautiful</em>, I want you to come <em>so</em> badly, baby, I want –“</p>\n<p>But Lena is already coming, her toes curling over Kara’s back as her brain echoes with Kara’s voice calling her <em>baby</em>.</p>\n<p>It’s indescribable. Kara has always made her come harder than anyone else, but somehow the affectionate pet name that she’d always told herself she hated paired with the praise and the overall feeling of <em>closeness</em> washes over Lena like a tsunami, lighting up every nerve ending until she’d clinging to Kara’s strong shoulders for dear life.</p>\n<p>“God, Kara,” she gasps, trying to catch her breath as Kara’s hips slow down to a gentle rocking motion. “<em>Fuck</em>.”</p>\n<p>“Can you take more?” Kara asks breathlessly, almost desperately, and Lena still marvels at the way her body fires back up at such a simple question.</p>\n<p>“Always,” she breathes into Kara’s mouth, and Kara’s grin lights up Lena’s chest almost as much as it does her lower body.</p>\n<p>Determined to distract herself from the dangerously powerful feelings Kara is evoking, Lena pushes herself up on shaky arms until Kara is upright and she’s straddling her lap, the toy still inside her - and slowly, <em>slowly,</em> she starts to ride.</p>\n<p>In the end, the move just makes it <em>worse</em>.</p>\n<p>From this position, all Lena has to focus on is Kara. A droplet of champagne slides slowly down Kara’s temple, and Lena can see the microscopic bubbles in it and every fleck of hazel and grey in Kara’s blue eyes, trained so intently on her face. Her hair is messy and one side is a little wet, and Lena’s lipstick is smeared across Kara’s bow lips. She’s sweaty and focused, completely absorbed in the moment, and she’s never been more beautiful.</p>\n<p>It’s unhurried, the pace they set together. It’s not the frantic, desperate rhythm she usually sets with this toy, or even the more relaxed but still passionate one from just a few minutes ago. This speed is languid, almost decadent – the toy shifts inside her so slowly that she can feel every slick inch of it stretching her open at this new angle, and Kara’s hands are solid on her hip and the centre of her back, splayed out in a hold that’s both steadying and possessive. She has no idea how Kara is holding them both up – thighs of steel and absolutely spectacular core strength, clearly, Lena thinks with a shiver – but Kara hardly seems to notice the weight.</p>\n<p>The eye contact is too much, all of a sudden.</p>\n<p>Lena closes her eyes instead, tipping her head back and trying to focus on her body. The stretch and pressure, the slide of their sweaty skin together, the hardness of Kara’s stomach against her own softer one, Kara’s lips and teeth dragging over her chest and up to her throat. It all feels good, excruciatingly good, and she can feel herself getting close surprisingly quickly considering the slowness.</p>\n<p>“I love this freckle,” Kara whispers, biting down on the middle of Lena’s throat, and she feels herself clench around the length inside her at the mixture of pain and pleasure.</p>\n<p>“I –“ Lena gasps, twitching again when Kara bites harder. She’s choking on something, a very specific and forbidden phrase that wants to escape, and she has to bite down hard on her lip to keep herself from saying it.</p>\n<p>She <em>can’t</em>.</p>\n<p>But it isn’t the physical sensations that make her come, in the end. When she finally tips over the edge, it’s Kara’s voice in her ear that makes the difference, and as she comes down from the high of her fifth orgasm, she knows. As hard as she’s tried to ignore them, she <em>knows</em> in her heart that these feelings aren’t going away. They’re getting stronger every day, with every little thing Kara does. With every soft touch of lips along her jaw, every slow thrust, every moment of heart-stopping eye contact.</p>\n<p>She needs to cut this off.</p>\n<p>Kara can’t get too attached to her, not with her future. Kara deserves better, a normal life, kids and a dog and a partner who isn’t going to be working 100-hour weeks for the foreseeable future. Someone who isn’t emotionally scarred, liable to run at the slightest provocation. Someone who can give her what she needs.</p>\n<p>Someone who isn’t Lena.</p>\n<p>Finally exhausted, Kara flops back onto the sheets, her sweaty chest heaving with exertion, and immediately Lena dismounts and rolls until her head is pillowed there. She doesn’t care that every heavy breath almost dislodges her head – something in her is screaming for this closeness, and Kara is her usual perfect self. She wraps an arm around Lena’s shoulder, pulls her in close and tight, and kisses the top of her head.</p>\n<p>“Happy prom, Lena,” Kara murmurs into her hair, and Lena squeezes her eyes shut, hoping against hope that this feeling of inevitability will be gone by morning.</p>\n<p>It isn’t. When Lena opens her eyes a few hours later, it’s to Kara gazing at her like she’s some kind of treasure, followed by an avalanche of guilt.</p>\n<p>“Morning,” Kara grins, her voice a little raspy from sleep and the night’s activities, and something unacceptable rises in Lena’s chest to greet it.</p>\n<p>“I was just going to get us some breakfast. Black coffee and a croissant, right? Maybe some fruit?”</p>\n<p>As Kara grabs for the phone, grinning and golden in the morning light and so <em>painfully</em> handsome, Lena knows with startling clarity that she’s taking the job Lex offered. Within seconds of waking, she’s reminded of what she knew beyond a shadow of a doubt last night.</p>\n<p>This is perfect. Last night, this morning, Kara, <em>everything</em>.</p>\n<p>It’s perfect…and she can’t have it.</p>\n<p>“I’m actually not very hungry,” Lena finally says, and Kara puts the phone down with a slight frown.</p>\n<p>“Oh, okay. Well, we can go for breakfast later, if you want. Or I can make pancakes at my place,” Kara suggests, and Lena hates how tempting those options are. She’d love nothing more than to do what she’s been doing for months – put the bad thoughts away, and just enjoy the moment.</p>\n<p>But she can’t. Not anymore.</p>\n<p>“Pretty good night, huh?” Kara says when she’s settled in bed again, grinning, and Lena smiles sadly.</p>\n<p>“Pretty good night.”</p>\n<p>\n<em>Now or never.</em>\n</p>\n<p>Taking a deep breath, Lena averts her eyes to the ceiling, and speaks her mind. “I don’t think I’ll have this much fun working for LuthorCorp.”</p>\n<p>Kara seems to pause, a little confused crinkle between her brows.</p>\n<p>“LuthorCorp?” Kara asks, and Lena swallows the little voice inside her that’s telling her not to do this.</p>\n<p>“I’m going to work with my brother. Starting this summer.”</p>\n<p>Kara frowns, propping herself up on an elbow. “But, you’ll be coming back? In September?”</p>\n<p>And here comes the difficult part.</p>\n<p>“…no,” Lena says hesitantly. “I’m…leaving for good. He’s making me CFO.”</p>\n<p>She’s met with silence. She isn’t quite brave enough to look Kara in the face, so she can’t see her expression, but she can feel Kara’s eyes boring into the side of her head.</p>\n<p>“I thought you loved teaching?” Kara asks in a small, hurt voice that Lena can’t help but react to. She reaches out to grab Kara’s hand, pulling it to her chest like a lifeline.</p>\n<p>“I do! But there’s so much I could be <em>doing</em>, there. Not just for a group of students, but for the whole world. My research from grad school was used to treat cancer, Kara. If that was then, can you imagine what I could do in the future?”</p>\n<p>She hadn’t meant to spill every thought she has on the subject, but it’s the only way she can think of to lessen the pain. Maybe, if she can make Kara understand why this can’t work, <em>maybe</em> –</p>\n<p>“Wow,” Kara says quietly. She doesn’t sound surprised, really – she sounds resigned. Like she’d been expecting this, and is only sad that it had to happen so soon. “That’s…that’s amazing, Lena. I’m really proud of you.”</p>\n<p>“It’s going to be hard,” Lena admits, not meeting Kara’s eyes. She’s squeezing Kara’s hand so hard that they’re probably both losing circulation. “Leaving…everything. But I think I need to do this.”</p>\n<p>She knows she could mention that her new position is still in National City. She’s likely not even going to move apartments, at least for a while. But it feels somehow like she’d be giving Kara false hope. Hope that they could work out, when Lena knows they can’t. They <em>shouldn’t</em>. That Kara can do so much better.</p>\n<p>“I’m happy for you.”</p>\n<p>Kara doesn’t sound happy. She sounds horribly, painfully sad. But behind the sadness there’s acceptance, however begrudging, and it cements her decision. This is for the best. Kara will move on.</p>\n<p>Hopefully, Lena can too. Someday.</p>\n<p>Lena emerges from the bathroom a few minutes later to an empty bed, and even though true to form there was no discussion of the subject, Lena knows in her heart that it’s over, now. Their strange, complicated, <em>wonderful</em> time together is done. Again, she tells herself that this is the right decision. Even as she crawls back into the still-messy bed and pulls Kara’s pillow to her face, trying not to cry.</p>\n<p>She is not successful.</p>\n<p> </p>\n<p> </p>\n<p>Kara’s drive home from the hotel seems abnormally long. But, that could be because it’s 8 in the morning and her vision is blurred with tears.</p>\n<p>Lena is leaving.</p>\n<p>She knew this was coming, intellectually. She’s always known Lena was destined for better things. But she didn’t expect it so <em>soon</em>. She was thrown off guard when Lena told her, the high from having such a good night immediately doused by the news, and she’s still reeling. Lena is probably going to end up in Metropolis at L-Corp headquarters, on the other side of the country. She’s probably never going to see her again, outside of reading about her achievements in magazines.</p>\n<p>The thought makes her unbearably sad.</p>\n<p>She probably shouldn’t have left like this, spiriting off while Lena was in the bathroom with zero warning. But she couldn’t deal with lying in that bed, the bed where just a few hours ago she had been so sure that she couldn’t possibly be happier, knowing that it could never happen again. That it’s over. It was too much. And now, she’s driving home and her skin still smells like champagne and Lena’s perfume, and her stupid heart is ripped wide open.</p>\n<p>She’s not at all surprised when her instincts take her to Alex’s apartment instead of her own.</p>\n<p>She lets herself in like she always does, and unsurprisingly, Alex is asleep. Kara drops her coat on the couch and flops down on it, intending to try to nap before she wakes up, but when she wiggles into the cushions, there’s something poking into her back.</p>\n<p>Reaching around to pull it out, it turns out to be a bra. Lacy, and revealing, and so very far from what Kara knows to be Alex’s usual style. And, now that she’s paying attention, there’s a dress abandoned on the hallway floor that she knows for certain Alex would never wear.</p>\n<p>It looks familiar, actually.</p>\n<p>\n<em>Oh, no.</em>\n</p>\n<p>“Alex?” she calls tentatively, standing up, and from Alex’s bedroom she can hear the <em>thump</em> of something hitting the floor, and the telltale sounds of her sister swearing.</p>\n<p>“Jesus shitting <em>fuck</em> – Kara?”</p>\n<p>Another voice is audible, a softer voice, and Kara’s theory is confirmed even though she can't hear the words being said.</p>\n<p>“I am <em>so sorry</em> –“ Kara says, mortified, grabbing her jacket and trying to stuff her arms into it before realizing she has it backwards. “I had no idea –“</p>\n<p>Alex finally emerges in shorts and a NC Prep Volleyball hoodie, her hair in disarray, and shuts the bedroom door quickly as Kara is still trying to figure her coat out.</p>\n<p>“What the <em>hell</em>, Kara?” Alex hisses, crossing her arms grumpily. \"You couldn't call first?\"</p>\n<p>Kara finally gets her coat on, and slowly she backs up towards the front door, snatching her shoes up from the rack. “I’m sorry, I’m <em>so</em> sorry, oh god –“</p>\n<p>“Why are you <em>here</em> at 8 in the morning?” Alex asks, following Kara’s whirlwind path, and Kara waves her off as she stuffs her feet back into her shoes.</p>\n<p>“It’s – nothing, I’ll just go –“</p>\n<p>“Kara, it’s fine,” Alex says, Kara’s panic seeming to make her soften a little. “Just spit it out.”</p>\n<p>Kara feels her eyes well up, her lip quivering a bit despite her best efforts, and Alex sighs.</p>\n<p>“It’s Lena, isn’t it?”</p>\n<p>Kara nods, and Alex puts a hand on her shoulder just as Sam Arias emerges from the hallway, dressed in jeans (where did she get jeans when they came here from a formal dance? Unless, she keeps clothes here?). She looks sleepy, but she’s smiling in a sympathetic way.</p>\n<p>“I’ll just go,” she says quietly to both of them. “I need to pick Ruby up from her sleepover in a few hours anyways.”</p>\n<p>She turns to Alex, and her smile is immediately more affectionate. “I’ll see you later?”</p>\n<p>Alex nods, and they kiss in a way that’s far too familiar for a hookup, and Kara thinks that maybe, Alex has been keeping some things from her too.</p>\n<p>“We’re going to talk about that, later,” Kara says as the door closes behind Sam, and Alex rolls her eyes.</p>\n<p>“One crisis at a time.”</p>\n<p>By the time Kara finishes explaining everything, this whole crazy year with Lena up until the conversation they had a few hours ago, the sun is fully up and Alex has made them each two cups of strong coffee.</p>\n<p>“Jesus, Kara,” Alex says, rubbing her face. “I had no idea it had gotten so far.”</p>\n<p>“Neither did I, really. Until it did.”</p>\n<p>“So, she’s leaving.”</p>\n<p>“She's leaving,” Kara sighs. “To be a CFO. I always knew she’d do amazing things.”</p>\n<p>“Yeah.” Alex says, and there’s begrudging agreement in her voice. “So…is there a reason you can’t keep dating her?”</p>\n<p>“We weren’t dating to begin with,” Kara says tiredly. She swirls the dregs of her coffee in the bottom of her mug, as if the specks of coffee bean will reveal the answers she craves. “It was casual. We both knew that. And besides, LuthorCorp is in Metropolis. She’s going to have to go halfway across the country.”</p>\n<p>“Yikes,” Alex says, grimacing. “Yeah, that’s fair.”</p>\n<p>“I don’t know how I’m going to keep teaching, in that classroom, without Lena.”</p>\n<p>Alex nods, looking thoughtful. “Well, maybe it’s time.”</p>\n<p>“Time?”</p>\n<p>“Time for you to take that science journalism job Clark offered you,” Alex says, and she nudges Kara with a foot when she rolls her eyes. “Look, if staying here is just going to remind you of Lena, maybe now is the time for you to start fresh, You can always come back to teaching if you don’t like it. You know Cat Grant will hire you back in a heartbeat.”</p>\n<p>It’s the same advice that Alex gave her at the beginning of the year, when she refused to take it because the idea of leaving the school when Lena was still there was ludicrous. Now, it seems like maybe it’s just what she needs.</p>\n<p>“I’ll call Clark.”</p>\n<p>After prom night, their usual texting stops. Lena doesn’t show up at Kara’s place in the middle of the night even once, and Kara somehow resists the temptation to get in her car and drive to Lena’s apartment herself. By day, they still work together – their usual back-and-forth is tempered by occasional moments of melancholy, but she’s fairly sure the students don’t notice, as wrapped up in exam prep as they are. But their after-hours relationship is nonexistent. They do their marking separately, and Lena seems to arrive at school so early that Kara doesn’t even get to open the door for her anymore.</p>\n<p>Lena’s stuff is still at Kara’s apartment, and she has no idea what to do with all of it. It just sits in a drawer, out of sight but not out of mind, and Kara is caught in an endless cycle, torn between wanting to move on and wanting to go back in time. So, she does the only thing she can think to do.</p>\n<p>She picks up the phone, and she calls her cousin.</p>\n<p> </p>\n<p> </p>\n<p>Lena didn’t realize how much she had gotten used to waking up with Kara until it’s no longer an option.</p>\n<p>She’s slept alone for so long – her whole life, essentially, since she’s never been one to sleep over with her occasional hookups – that she figured it would be simple to go back to. Sharing a bed with Kara was a mistake to begin with, and things are now back to the way they should be. The way they’ve always been.</p>\n<p>But a week and a half after prom, when she wakes up after yet another night spent tossing and turning to an empty bed and an empty heart, she genuinely wonders if this will ever feel normal again.</p>\n<p>She passes the two boxes of Kara’s belongings that have accumulated at her apartment over the last 5 months – <em>god, has it really been 5 months?</em> – and pushes down the predictable wave of melancholy that crashes over her as her eyes brush over a jumble of clothes and movies, CDs, and the fuzzy socks Kara always insisted on wearing because Lena keeps her house too cold. Kara always fell asleep wearing them and then ended up slipping them off during the night when she got too hot, and in the morning, Lena would find them at the foot of the bed or tangled in the blankets, despite her near-everyday warnings that she’d light them all on fire if she found another sock on her floor. Instead, she had taken to waking Kara up by throwing the socks at her face, and Kara would just laugh and pull her back into bed, starting the day with kisses and laughter.</p>\n<p>Lena’s heart seizes painfully at the memory, her eyes burning with tears she won’t let fall, and she rubs at the sore spot in her chest forlornly.</p>\n<p>Kara wasn’t her girlfriend. They were never more than friends with benefits, a convenient outlet of sexual frustration and occasional affection. That’s what she’s been telling herself all year. Lena has no right to be so fucking <em>sad</em>. And yet here she is, tearing up like a war widow over a box of everything that she hasn’t had the heart to return yet.</p>\n<p>Well, not <em>everything</em>. There is something Kara left behind that isn’t in the box – Kara’s NCU sweatshirt, the soft one that she lent Lena back in October for Casual Day. Lena took it home intending to wash and return it, but it was so comfortable and smelled like Kara, and eventually Kara had found it in Lena’s pyjama drawer and told her she could keep it.</p>\n<p>Lena knows she should give it back – it would make it easier to let go if she gets rid of everything – but instead she shrugs off her shoulders as she chooses her outfit for the day, laying it carefully on her pillow.</p>\n<p>Sleeping in her ex…<em>something’s</em> sweater when she was the one who chose to break it off is pitiful, she knows, but it’s the only thing that brings her any comfort lately.</p>\n<p>School is hell, for Lena. Day in and day out she has to spend over an hour in a room with Kara pretending the very sight of her, her strong shoulders under those button-ups and her deft hands and her sweet, bright eyes and that smile that makes her melt, doesn’t make her want to abandon her plans and just tell Kara how she feels. And it’s made worse by the way she can tell Kara is staring back when Lena isn’t looking – that puppydog gaze, the clear indication that Lena’s feelings are returned. She’s sure that, if she asked, Kara would date her in a second.</p>\n<p>But she can’t be that selfish. Kara deserves more than she can give.</p>\n<p>It’s what she’s been telling herself for weeks, and it’s starting to ring a little hollow.</p>\n<p>So instead the weeks march on, Lena feeling her lack of sleep more and more every day. It gets to the point that, about two weeks before exams are due to begin, she arrives outside Cat’s office for a science department meeting a full 25 minutes early without realizing, and runs square into Alex Danvers. It’s clear that Alex is waiting too, and their eyes have already locked before she realizes the situation she’s trapped herself in.</p>\n<p>Alex gestures at the seat next to her in the hallway, her expression neutral, and Lena sits gingerly, her back stiff and straight.</p>\n<p>For a few minutes, Lena thinks that maybe, just <em>maybe</em>, Alex doesn’t want to talk either. They sit in silence, only interrupted by occasional classroom noise spilling out as a student or two opens a door to go to the bathroom, and Lena has almost relaxed into her chair when Alex breaks the quiet.</p>\n<p>“So. LuthorCorp, huh?”</p>\n<p>Lena’s back stiffens again the moment Alex speaks, and she swallows thickly. It feels like something is stuck there, heavy with the knowledge that Alex probably knows <em>everything</em>.</p>\n<p>“Yes,” she says quietly, and Alex nods.</p>\n<p>“Congratulations,” Alex replies, and she sounds serious, but genuine. There’s no malice in her tone. Either Alex has magically become fond of Lena overnight, or Kara didn’t make Lena the bad guy.</p>\n<p>Typical Kara, still being perfect even after Lena broke both of their hearts.</p>\n<p>Lena’s reply comes out as a hoarse whisper.</p>\n<p>“Thank you.”</p>\n<p>The blessed silence returns, and Lena could swear that the hands of the clock move in slow motion. She’d do just about anything to be able to politely excuse herself from this situation, and the feeling grows tenfold when Alex speaks up again.</p>\n<p>“Kara’s leaving too, you know.”</p>\n<p>Lena can’t help it. Her head jerks towards Alex, her hair whipping her own face in her surprise.</p>\n<p>“<em>What</em>?”</p>\n<p>“Yeah. To work for the Tribune,” Alex says, her nonchalance just a little bit too even to be real. “I guess her cousin had an in for her there as a junior reporter. Science Division.”</p>\n<p>Kara had talked about her interest in reporting, before. She minored in journalism, so she told Lena, and she’s always been interested in finding ways to bring science to more people – it’s why she loves teaching, and being a journalist with a wide platform seemed like a logical step. But Lena hadn’t considered that Kara would ever actually leave the school, where she gets to teach with her sister and make such a difference for the kids.</p>\n<p>Lena clears her throat, trying to sort through her conflicting thoughts.</p>\n<p>“Good for her.”</p>\n<p>“Yeah, it’s a good opportunity,” Alex continues, and now her tone is definitely too careful for Lena’s liking. “Clark has been telling her to do it for years now – honestly, I think half the reason it took her so long to leave is because of you.”</p>\n<p>The weight that’s been constricting Lena’s chest for this whole conversation slams down to her stomach.</p>\n<p>“Excuse me?” Lena says, knowing how uncontrolled her voice is and <em>hating</em> it. But Alex just nods, unafraid to look Lena in the eye. She doesn’t look angry, really, but Lena can practically see the older woman’s steel spine when it comes to her sister.</p>\n<p>“She’s been in love with you since day one, Luthor. You can’t tell me you didn’t know that. Especially not this year. I’ve seen you two together.”</p>\n<p>It’s all a little too much. They’re in the middle of an open hallway during work hours, before a meeting with their boss <em>and</em> Kara, and it feels like Alex has just shone a hot spotlight on her. Lena feels too seen, too <em>known</em>, like Alex’s stern words and knowing gaze are flaying her, leaving her open to the knowledge she’s had for months but hasn’t let herself think too hard about, let alone fully admit.</p>\n<p>She and Kara were always more than friends. More than a fling, more than casual.</p>\n<p>She’s in love with Kara Danvers. And Kara loves her, too.</p>\n<p>Lena’s mouth opens and closes again, words just not forming from her chaotic thoughts, and Alex continues to carry the conversation by herself.</p>\n<p>“She’s still crazy about you. Even after everything. So much so that she can’t stand being here without you, apparently.”</p>\n<p>“I didn’t –“ Lena starts, her voice cracking uncomfortably. She clears her throat, starting again and willing her own weakness to go back into the box she usually hides it in. “I didn’t mean to hurt her. I thought…I could handle it.”</p>\n<p>Alex nods, and her understanding is even more confusing than the fact that she seems to want to have this conversation with Lena in the first place. And then, she asks the question Lena has been dreading.</p>\n<p>“Why are you really leaving?”</p>\n<p>Immediately, Lena spits out the answer she’s been giving to everyone who asks. The easy answer.</p>\n<p>“I’m going to work for –“</p>\n<p>But Alex cuts her off, waving an impatient hand over her half-assed explanation. “No. Cut the bullshit, Lena. I know you’re leaving for work, to make a difference and what have you. But your brother has been asking you to do this for years, and you only decided to say yes now. Why?”</p>\n<p>“I'm –“ Lena chokes, feeling increasingly claustrophobic in the empty hallway. But Alex looks at her with an expectation tempered by a strange sort of understanding, and Lena finally voices the truth she’s been hiding from everyone but Jess.</p>\n<p>“I’m scared.”</p>\n<p>Alex doesn’t look surprised by the admission at all. At her nod, Lena feels even more admissions coming up like word vomit.</p>\n<p>“I don’t know how to do this. How to be…”</p>\n<p>Alex’s face is as soft as Lena has ever seen it, and Lena suddenly understands why Kara loves her sister so much.</p>\n<p>“I don’t know how to be in love,” she finally whispers, cursing her eyes for daring to betray her by watering in such a public place.</p>\n<p>“You’ve never been in love?” Alex asks, and Lena shakes her head vehemently.</p>\n<p>“Not the healthy kind. I can’t do that to Kara, I can’t subject her to whatever kind of twisted relationship I’m capable of. She’s too good.”</p>\n<p>“Lena,” Alex says, with the kind of patience only a big sister can have, “As far as I can tell…you’ve been in a relationship all year. And you’ve been in love for longer.”</p>\n<p>Lena swallows, feeling the truth of the words settle in her gut. All those times they added new dimensions to their entanglement, all those times Lena put it out of her head – Alex is right. She’s been denying it, but she was in too deep before they even kissed.</p>\n<p>“And while I’m sure you both messed up at times, she still loves you,” Alex finishes with quiet confidence.</p>\n<p>“Alex…”</p>\n<p>“Look, I can’t tell you what to do. All I wanted to say, was…whatever you choose, I hope it makes you happy. Truly.”</p>\n<p>Before Lena can try to find an answer to that, the familiar sound of Kara’s heavy footfalls echoes down the hallway as the blonde turns the corner, shoving papers into her messenger bag. She looks up from her work, and when she sees Lena her expression brightens and darkens again in a split second. But Lena sees it, and she feels the same light being forced into dimness in her own chest.</p>\n<p>Maybe she has some things to think about.</p>\n<p> </p>\n<p> </p>\n<p>Every day following prom, Kara truly wishes she was braver.</p>\n<p>The days before the school year ends, and Lena leaves for good, seem to dwindle too fast. Every time she sees Lena she wants to pull her aside, to tell her how she feels and put everything out on the table, but fear stops her every time. Fear of <em>what</em>, she isn’t sure, but it curls in her gut and keeps her from bringing the subject up, no matter how badly she wants to.</p>\n<p>So she lives like this, in this endless cycle of confusion and sadness, for weeks after Lena announced her intention to leave. Kara announces her own departure at a science department meeting with herself, Lena, and Alex, turning the meeting into a session of Cat asking if there was anything she could do to keep both of them, but Lena seems so resolute – both in her plan to quit, and in looking anywhere but at Kara – that Kara knows it’s over.</p>\n<p>This is happening, and she needs to just accept it.</p>\n<p>It feels like a startling break in the routine when, after the annual end-of-year staff meeting, Cat asks Kara to stay behind. Alone.</p>\n<p>Cat’s office seems like the only space in the school untouched by end-of-year mania. Every office and classroom in the school is a little messier than usual, perhaps inspired by the stress of students and teachers compounded into a few short weeks, but Cat’s office is as spotless as ever. It’s glowing orange with the setting sun, and as Kara takes a seat again, the principal spins her chair around to pin Kara with a piercing look.</p>\n<p>If she ever decided to leave the school, Kara thinks, Cat Grant would make an absolutely terrifying businesswoman.</p>\n<p>“So. Miss Luthor is leaving.”</p>\n<p>She was expecting this to be the topic of conversation, given their shared class and the letter of resignation Kara submitted a few days ago, but Kara still feels like she’s been gut-punched.</p>\n<p>“Yes,” she says quietly, and Cat continues.</p>\n<p>“As are you.”</p>\n<p>“Yes.”</p>\n<p>“At the same time.”</p>\n<p>Kara swallows, fidgeting with her glasses and wishing she could just leave without being considered rude. “Miss Grant, if you’re upset that I didn’t give enough notice –“</p>\n<p>“You gave four months, it’s more than adequate,” Cat says, waving her off. “No, I called you here because both you and Miss Luthor are leaving at the end of the school year, ostensibly free from the constraints of inter-workplace dating, and yet you’re still dancing around each other like a couple of teenagers.”</p>\n<p>Kara’s stomach drops out completely.</p>\n<p>She’s still in the ‘complete and total shock’ stage when Cat bulldozes on, uncaring of Kara’s state of anxiety.</p>\n<p>“Now, I don’t normally make a habit out of dabbling in the lives of my employees. I find it exhausting, and usually uninteresting. But you two have had eyes for each other since the second Miss Luthor stepped foot in my school, and quite frankly, your new mopey ‘woe is me’ cycle is getting to be too much.”</p>\n<p>Kara finally snaps out of her stupor, shaking her head and laughing a bit disbelievingly.</p>\n<p>“Miss Grant, I don’t think you understand –“</p>\n<p>“That you’ve been sleeping together for most of the year?”</p>\n<p>Kara stares at her, mouth agape. Cat just stares at her, an eyebrow quirked in a way that reminds her painfully of Lena.</p>\n<p>\n<em>How does she know?</em>\n</p>\n<p>“You’re not as subtle as you think you are, Miss Danvers,” Cat says, as if she can read Kara’s mind.</p>\n<p>\n<em>Maybe she can. Maybe that’s how she found out. Maybe she’s actually some kind of mind-reading alien and she runs this school as a cover.</em>\n</p>\n<p>She’s brought back to the ground from her panic-spiral by Cat talking again, her tone brokering no argument.</p>\n<p>“Now, I’m going to offer something I don’t give out very often – advice. A connection like yours doesn’t come around every day. Whatever your damages are, whatever inadequacies you think you have, I can guarantee that Lena doesn’t care, just as you don’t care about hers.”</p>\n<p>It’s true. Kara doesn’t care about whatever Lena thinks she lacks. She wants her, no matter what. Exactly as she is. But it just doesn’t seem <em>possible</em> for Lena to feel the same way.</p>\n<p>“The way I see it, the two of you have about two weeks to get your act together – and one of you needs to take the first step,” Cat says, and Kara balks at the idea.</p>\n<p>“Miss Grant, she doesn’t feel that way about me. And even if she did –“</p>\n<p>“Kara,” Cat interrupts, and Kara is startled into silence by the uncharacteristic use of her first name. Cat never uses <em>anyone’s</em> first name. “I am not asking for your perspective. I am telling you…to jump.”</p>\n<p>“Jump?” Kara echoes, brow furrowed.</p>\n<p>“<em>Jump</em>.”</p>\n<p>Cat’s gaze is suddenly intense, and it feels more serious than it was before. Like Cat is genuinely invested in this. In Kara’s happiness, with Lena.</p>\n<p>Kara considers it, this strange advice her soon-to-be-ex boss is offering. <em>Jump</em>. Take a leap of faith.</p>\n<p>A leap of faith that could go horribly.</p>\n<p>“But what if –“ Kara starts, but Cat rolls her eyes, cutting Kara off with a wave.</p>\n<p>“I’ve offered my advice, and you can take it or not. Now, get out of here and go home. Think about it.”</p>\n<p>Kara goes, and true to Cat’s command, she thinks about it for the entirety of the final two weeks of school.</p>\n<p>They pass in a flash, or so it feels to Kara. It seems like the blink of an eye before exams are over and the Mathletes are having an after-school end-of-year party to say goodbye. It’s a yearly affair, usually to bid farewell to the students who are graduating, but this year it has extra meaning - the students were all devastated when Lena announced that she wouldn’t be coming back next year, and it was even worse when, a week later, Kara announced her intent to leave as well.</p>\n<p>While Lena hadn’t looked surprised, she did look almost as heartbroken by the news as their students. But, as per usual, she and Kara hadn’t talked about it. Lena had just excused herself from the meeting as soon as it was over, and Kara hadn’t seen her until their shared class the next day.</p>\n<p>The party is as sad as it is celebratory, the younger students upset that both their friends and their favourite teachers are leaving, and Lena spends most of it engaged in conversation with them, giving promises of reference letters for college and very obviously trying to avoid talking to Kara. And Kara, true to form, hovers close by and agonizes over breaking the pattern.</p>\n<p>There’s something final about the gathering that makes Kara feel…different. The fear is still there, the anxiety that’s kept her from speaking to Lena for weeks now, but it’s being pushed down by something else – the conversation she had with Cat is still ringing in her ears, the older woman’s words echoing through her head every time she looks at Lena.</p>\n<p>\n<em>Jump, Miss Danvers.</em>\n</p>\n<p>And besides that, with this party comes the deep, crushing knowledge that this very well may be the last time she sees Lena in person. The last time she can see her smile for real, the last time she can look into those green eyes and tell her how incredible she is.</p>\n<p>This is it. She has nothing to lose, now.</p>\n<p>\n<em>What am I waiting for?</em>\n</p>\n<p>Gathering her wits, Kara eases herself into the tail end of Lena’s conversation with Eve and Ruby and plucks at her sleeve gently.</p>\n<p>“Can I talk to you?”</p>\n<p>Eve and Ruby exchange a look that’s a little too knowing for Kara’s comfort, but Lena nods after only a moment’s hesitation, and Kara leads her to a quiet corner of their classroom.</p>\n<p>“Lena, I know we never agreed on anything. This was all…casual, and impermanent, and I was okay with that,” Kara starts as soon as they’re alone, wringing her hands nervously. “But…I’m <em>really</em> going to miss you.”</p>\n<p>Lena’s ramrod-straight spine softens a little, and she actually meets Kara’s eyes for the first time, looking almost as sad as Kara feels.</p>\n<p>“I’m going to miss you, too,” Lena says, so quietly that it’s almost a whisper. “If it counts for anything, I’m sorry for how things ended.”</p>\n<p>“Me, too,” Kara sighs, barely resisting the temptation to pull Lena into a hug to ease the pain she can see on her face.</p>\n<p>It’s quiet, for a moment. Both of them look away from each other, unable to keep up such intense eye contact for long, and instead stand together observing their students. It’s Kara who finally breaks the silence, still not quite brave enough to look Lena in the eyes as she speaks.</p>\n<p>“I don’t really see why we couldn’t just keep going as we were. For a little while longer.”</p>\n<p>Lena’s answer is not what she expected.</p>\n<p>“I think you know why.”</p>\n<p>Something kindles in Kara’s chest at the words. Something hopeful. <em>You know why</em>. But, it can’t be the reason she thinks.</p>\n<p>Can it?</p>\n<p>“I…I don’t…” Kara stutters, trying to catch her mouth up to her brain. “Wait, what do you mean?”</p>\n<p>“I think how we feel is pretty obvious,” Lena mutters, as if the knowledge of it is irritating in some way. But it’s not irritating to Kara. It’s <em>wonderful</em>. It’s setting off firecrackers in her chest. <em>How we feel.</em></p>\n<p>Lena has feelings for her.</p>\n<p>“I didn’t know you felt…<em>anything</em>,” Kara says, her voice noticeably trembling. “You never said –“</p>\n<p>Lena sighs, rubbing the bridge of her nose. “How could I not, Kara?”</p>\n<p>Kara huffs, throwing her arms up before remembering they’re supposed to be covert. She folds them tightly, but it doesn’t stop her from talking. “Well then why – I don’t understand. Why not try? Lena, I’m crazy about you, I always have been –“</p>\n<p>“Because you deserve better!”</p>\n<p>Lena’s outburst is unexpected, and loud. Several of the students look their way, and Lena flushes bright red, her jaw clenched and nostrils flaring.</p>\n<p>This is not a conversation to have in front of teenagers. Still reeling from the impact of Lena’s words, Kara pulls on Lena’s arm gently until they’re both out in the empty hallway, closing the door behind them. Only then does she let out her reaction.</p>\n<p>“<em>What</em>?”</p>\n<p>Lena sighs, rubbing her arms in a way that signals that she’s deeply uncomfortable, but this isn’t the moment for Kara to ease up. She’s close to something, here, and she can’t leave – she can’t let Lena go – until she knows what it is.</p>\n<p>“I’m not capable of the kind of things you deserve, Kara,” Lena finally says, her voice heavy. “Affection, and honesty. A real, healthy relationship. I spent this whole year – I was – <em>using</em> you, giving you whiplash just because I couldn’t repress my stupid urges, and it wasn’t fair to you but I kept doing it because I’m selfish and –“</p>\n<p>Lena is on a rant, now, so determined in her self-loathing that Kara can hardly get a word in edgewise, as much as she tries.</p>\n<p>“Lena, you didn’t <em>use</em> me,” Klara insists incredulously. “If anything I was using <em>you</em>, I’ve loved you for years and I jumped at the first chance to have sex with you and I didn’t even ask <em>questions</em> –“</p>\n<p>But Lena seems not to hear her.</p>\n<p>“And now, I’m going to be working all hours of the day getting this new National City branch of LuthorCorp started, and god knows if I can’t manage a normal relationship with a teacher’s schedule I can’t handle it as a CFO –“</p>\n<p>Whatever Lena says afterwards is important, Kara is sure, but her mind snags on that last part. National City branch of LuthorCorp. <em>National City</em>.</p>\n<p>“Wait, repeat that?” Kara asks, blinking owlishly, and Lena repeats herself.</p>\n<p>“I said, I’m not capable –“</p>\n<p>“No, the other thing,” Kara interrupts again, waving that self-doubt away. “You’re still going to be here?”</p>\n<p>“Yes,” Lena says, frowning. “But, that’s not the point –“</p>\n<p>Like the power was just turned on in her brain, Kara sees this entire year in a new light.</p>\n<p>Lena didn’t break things off because she doesn’t care, or because she’s leaving the city to move across the country – she did it because she thinks that she can’t be what Kara wants.</p>\n<p>But all Kara wants is <em>Lena</em>.</p>\n<p>With an intensity she didn’t know she had, Kara takes both of Lena’s hands in hers and holds them to her chest, and just like Cat suggested, she jumps.</p>\n<p>“Lena, I have been nuts about you since the second I saw you in your office 3 years ago. I’ve spent the last year taking whatever you felt capable of giving, because I was selfish and I didn’t want to give up being close to you – but I always thought you were going to leave, that you deserved better than me. And here you were, apparently thinking that I deserve better than you.”</p>\n<p>It feels like a new kind of release, finally getting all of this off her chest. She thought that it would be scary, would be embarrassing, but it just feels like relief. And through her whole speech Lena blinks at her, wide-eyed, her fingers flexing and unflexing against the skin of Kara’s sternum.</p>\n<p>“There <em>isn’t</em> any better than you,” Kara continues, her voice hushed and focused. This is a make-or-break moment, and she can’t mess it up. “I want <em>you</em>. Don’t you think that maybe, we could stop deciding what each other <em>deserves</em> and actually find happiness…together?”</p>\n<p>Lena bites her lip, and Kara can see her resolve wavering.</p>\n<p>“Look…I’ve thought about this too,” Lena admits quietly, and Kara feels like she could fly even at such a tiny admission, filled with so much doubt. “But I’d be so bad for you. I’d break you, Kara.”</p>\n<p>“I’m pretty strong,” Kara says, and Lena huffs out a little laugh. It feels so good to see her laugh again, to make her laugh again, that Kara just knows she can do this. She can fight for this.</p>\n<p>“It’s going to be difficult. <em>I’m</em> difficult. I’ve never done this before, with someone as important as you.”</p>\n<p>Kara glows with the compliment – <em>someone as important as you</em>. Knowing she’s important to Lena, important enough to risk doing something she’s scared of, is enough to solidify her resolve.</p>\n<p>“You’re worth it.”</p>\n<p>Their faces are drifting closer together, Lena smiling even through her half-hearted protests, and Kara knows, then. She knows that this is <em>happening</em>. Lena has feelings for her, and they’re doing this.</p>\n<p>They’re really doing this.</p>\n<p>“I’ve been so hot and cold to you this year,” Lena murmurs, her breath tickling Kara’s lips. “Why do you even want me?”</p>\n<p>Kara leans in, cupping Lena’s jaw with soft hands.</p>\n<p>“You’re Lena Luthor.”</p>\n<p>Over the past year, Kara has kissed Lena what feels like hundreds of times, in a hundred wildly different situations. Each and every one felt life-changing, in their own way. But this kiss, tinged with the knowledge that this isn’t just temporary, that her feelings aren’t just inconvenient but that they’re appreciated, that they’re <em>returned</em>, is the best of them all. It’s their softest one yet, just a gentle meeting of lips with the barest hint of tongue, and it makes Kara’s chest feel like it’s going to overflow.</p>\n<p>It’s perfect. Absolutely perfect. <em>Nothing</em> could ruin this moment.</p>\n<p>Nothing except for a single, high-pitched squeal somewhere to her left.</p>\n<p>About a split second before the commotion starts, Kara remembers where they are. Spotting movement out of the corner of her eye, she’s made suddenly aware that their classroom door has a very large window.</p>\n<p>“Oh no,” she whispers, and Lena has just enough time to shoot her a questioning look before the door swings open and 14 voices start to yell in a cacophony.</p>\n<p>“Oh my <em>god</em> –“</p>\n<p>“They’re kissing!”</p>\n<p>“I <em>knew</em> it! Eve, I told you, I <em>told</em> you they were –“</p>\n<p>“Are you guys gonna get married?!”</p>\n<p>Kara just laughs, kissing Lena’s forehead. It’s a little embarrassing, that they were apparently so much less subtle than she thought, but it’s nice having their little group be almost as excited as she is. Right now, she can just be happy thinking about the future. Their future, together.</p>\n<p>Lena’s fingers lace with hers, and Kara answers the most pertinent question.</p>\n<p>“Yes. We are definitely going to get married.”</p>\n<p>\n<em>“What?!”</em>\n</p>\n<p> </p>\n<p> </p>\n<p>\n<em>Eve gets the invitation in an envelope even larger and shinier than the one MIT had sent in the spring, when her stellar reference letters and top grades had gotten her as close to a full ride scholarship as is possible when you don’t play a sport. The large silver ‘L’ embossed onto the envelope is imposing, and so is its contents: a rare summer internship in the Applied Sciences Division at LuthorCorp’s National City branch, under the supervision of Lena Luthor herself. </em>\n</p>\n<p>\n<em>The ink of the signature is even a little smudged. Eve doesn’t want to assume that Miss Luthor will be anything but perfectly professional with her, but she’s oddly choked up by it. </em>\n</p>\n<p>\n<em>When she strides into the marble-floored glass skyscraper for her first day, she tries her best not to get her hopes up high. “Under the supervision of Lena Luthor” could mean anything – she might not even see Miss Luthor at all. Often high-up executives do this sort of thing through intermediaries. She just has to work hard, and maybe –</em>\n</p>\n<p>\n<em>“Can I help you?” the woman at the front desk says, looking up at her expectantly, and Eve jumps.</em>\n</p>\n<p>\n<em>“Oh! Yes. Um, Eve Tessmacher? I’m here for the internship program?”</em>\n</p>\n<p>\n<em>The woman looks down at her computer screen, typing something quick as lightning, and then she looks back up at Eve with a smile. </em>\n</p>\n<p>\n<em>“Of course, Miss Tessmacher. Miss Luthor has been expecting you.” </em>\n</p>\n<p>\n<em>“She – she has?” Eve asks, her entire morning thrown off by this information. </em>\n</p>\n<p>\n<em>“Of course! You’ll be working down in the lab this summer, but Miss Luthor requested your presence in her office before you start. It’s on the top floor, you can’t miss it.”</em>\n</p>\n<p>\n<em>Eve is almost hyperventilating by the time she steps out of the elevator on the top floor of the building. There’s a small waiting room and a hallway, a desk with an assistant sitting behind it, and a huge door made of what looks like metal with a plaque reading <strong>“Lena Luthor: CEO”.</strong></em>\n</p>\n<p>\n<em>Eve is about to tentatively ask the woman behind the desk where on earth she’s supposed to be going when the office door opens, and Miss Luthor herself walks out holding a tablet. She doesn’t even look up from whatever she’s typing before she starts talking, and her assistant immediately starts taking notes.</em>\n</p>\n<p>\n<em>“Jess, tell R&amp;D to move forward on the new water filtration systems. Make it priority number one. And push my 10 ‘o’clock to tomorrow, Kara is stopping by –“</em>\n</p>\n<p>\n<em>For a second, she has to catch her breath. Miss Luthor is just as beautiful as she was when Eve first saw her, as a scared 14 year old who thought she hated math. She hasn’t seen her former teacher in 3 years, and she’d honestly thought her baby gay crush had faded a little, but it all comes roaring back with Miss Luthor’s soft hair and bright eyes and that <strong>dress</strong> –</em>\n</p>\n<p>\n<em>“Eve!”</em>\n</p>\n<p>\n<em>Eve is startled violently from her ogling, and it makes her nerves settle a little to see that Miss Luthor seems genuinely happy to see her.</em>\n</p>\n<p>\n<em>“I was hoping they’d send you up here like I asked. It’s wonderful to see you!” Before Eve can properly prepare for it, she’s being enveloped in a warm hug, and it’s only her body going on autopilot that lets her return it without freezing up. </em>\n</p>\n<p>\n<em>“It’s – it’s good to see you too, Miss Luthor!” she squeaks, embarrassed at how high her own voice is. </em>\n</p>\n<p>\n<em>“Oh, please, you’re not my student anymore, Eve. You can call me Lena.”</em>\n</p>\n<p>\n<em>“Oh! Right. Um, Lena. Thank you so much for letting me into this program, it’s such a great opportunity –“ </em>\n</p>\n<p>\n<em>But Lena just waves her off, her smile reaching her eyes. She’s so animated, so enthusiastic in a way that was fairly rare to see when she was Eve’s teacher. </em>\n</p>\n<p>\n<em>“Eve, your grades speak for themselves. We’d be mad not to accept you. They don’t let just anyone into MIT - I should know.” Lena says with a wink, and Eve can’t help the blush that creeps up her neck.</em>\n</p>\n<p>\n<em>She’s wanted to go to MIT ever since she saw the framed degree in Lena’s classroom freshman year, and it was the encouragement of her two favourite science teachers that had convinced her to focus on her studies and work hard to get accepted. So, the acknowledgement that Miss Luthor paid enough attention to know that Eve was going to her alma mater makes her glow a little bit.</em>\n</p>\n<p>\n<em>“Right,” Eve says, clearing her throat. “Well, I’m really excited to work with you. I mean, not <strong>with</strong> you, <strong>for</strong> you. I mean, I assume you won’t actually be there most of the time, you have such important things to do –“</em>\n</p>\n<p>\n<em>“Oh, I spend a lot of time down in the lab,” Lena says, and Eve has to smother the small and excited explosion that happens in her chest. “You’ll be seeing plenty of me.”</em>\n</p>\n<p>\n<em>Before Eve can reply the elevator doors slide open, and through them strides the second person Eve was hoping against hope she’d get to see this summer. </em>\n</p>\n<p>\n<em>Miss Danvers hasn’t changed a bit. She’s still tall and a tiny bit disheveled, wearing a button-up shirt and slacks, and she’s rummaging in her messenger bag. It’s almost like 3 years haven’t passed at all and Eve is seeing her walk into that classroom again, throwing her bag under the desk and starting the day’s new experiment. </em>\n</p>\n<p>\n<em>“Eve!” She cries as soon as she looks up, and if Eve had been wrong about her still-active crush on Lena, she was <strong>really</strong> wrong about her crush on Miss Danvers. It’s also still alive and well. </em>\n</p>\n<p>\n<em>“Lena mentioned you’d be starting today!” Kara says, wrapping Eve in another hug and then drawing back, holding Eve by the shoulders and looking her over like some kind of proud aunt. “Look at you, already going to college. Where did the time go?”</em>\n</p>\n<p>\n<em>They talked about her.</em>\n</p>\n<p>\n<em>“I’m going to MIT,” Eve says a little breathlessly, as Kara moves past her. “Just like Miss Luthor. I mean, Lena.”</em>\n</p>\n<p>\n<em>“That’s awesome, Eve!” Kara says, leaning in to give Lena a quick peck. “Hey, love. Sorry I’m late, I had to swing by the museum for a quote.” </em>\n</p>\n<p>\n<em>“It’s all right, darling.” Lena’s voice is soft and affectionate in a way that Eve never heard it when they worked at NC Prep, at least not in public. There’s open love in her gaze, and it makes Eve feel warm.</em>\n</p>\n<p>\n<em>She feels even warmer when her eyes zero in on Lena’s hand, which has come up to wipe the red lipstick stain from Kara’s face – specifically, her left ring finger, where sits the biggest rock Eve has ever seen. A quick perusal of Kara’s hand reveals that she has a ring too – a flat silver band lined with diamonds, glittering in the florescent light.</em>\n</p>\n<p>\n<em>When she connects the dots, she can’t stop herself from speaking.</em>\n</p>\n<p>\n<em>“Oh my god, you’re engaged!”</em>\n</p>\n<p>\n<em>Kara laughs, grabbing Lena’s hand and kissing her knuckles next to the ring. “We are. I told you guys I was going to marry her, didn’t I?”</em>\n</p>\n<p>\n<em>Of course Eve remembers. The Mathletes end-of-year party her freshman year, when she looked out the little glass panel in the classroom door and saw the two teachers that the entire student body had been speculating about – and she had secretly been crushing on – locked in a passionate kiss. It was the single most affirming moment of Eve’s life, knowing that what she felt for girls wasn’t wrong or weird. The two people she looked up to most were just like her. </em>\n</p>\n<p>\n<em>Even three years later, her entire graduating class still used to read Miss Danvers’ articles in the Tribune and look up interviews with Miss Luthor, trying to figure out if they were still together.</em>\n</p>\n<p>\n<em>“You did, I remember! I just – oh, gosh, this is so exciting!” Eve trills, unable to contain her happiness. “After you two left we never stopped talking about you, we were so hoping you were still – and now – you’re getting married!” </em>\n</p>\n<p>\n<em>“You all still talked about us?” Lena asks, looking deeply touched.</em>\n</p>\n<p>\n<em>“Of course we did! You were so important to so many of us,” Eve says. She swallows, building up her courage to tell them something that she’s actually proud of herself for. “I…I actually started a GSA because of you. After I came out.”</em>\n</p>\n<p>\n<em>Kara’s hand goes to her heart, and she looks genuinely close to tears. “Oh! Oh, that’s so great! I’m so happy, oh my gosh, come here –“ </em>\n</p>\n<p>\n<em>Eve manages to laugh as she gets her third hug of the day, and Lena chuckles, putting a hand on Eve’s shoulder.</em>\n</p>\n<p>\n<em>“That is wonderful, Eve. I’m proud of you.” </em>\n</p>\n<p>\n<em>Just those four words, from her former teacher and hero’s mouth, are almost enough to make Eve cry. </em>\n</p>\n<p><strong> <em>I’m proud of you. </em> </strong> <em>Even her own parents hadn’t said that when she got accepted to school – they had just stressed about the cost, and when Eve told them she’d gotten the scholarship, they complained that MIT was too far away to be able to visit. When Eve had broken the news about getting an internship with the most prestigious tech company in the country, they had only asked how she planned to get there every day. </em></p>\n<p>\n<em>But Miss Luthor and Miss Danvers are proud of her. Miss Luthor wants her here, working at L-Corp. For the first time since she got that acceptance letter from her dream school, Eve actually feels the weight of her achievement. </em>\n</p>\n<p>\n<em>Lena, thankfully, seems to sense it, and she leads Eve away from Kara’s hug and towards the elevators.</em>\n</p>\n<p>\n<em>“Now, if you’re done smothering my star intern, I’m going to show her to the labs. I’ll be back up in a bit, and we can go to the cake tasting, okay?”</em>\n</p>\n<p>\n<em>Kara waves excitedly as they get onto the elevator, and Lena smiles at her genuinely as she presses the button for the basement level, and as Eve hears the words <strong>my star intern</strong> echo around her head, she knows with absolute certainty that this is going to be the best summer of her life. </em>\n</p>"
}