{
  "id": "18197501",
  "url": "https://archiveofourown.org/works/18197501?view_full_work=true",
  "author": [
    "aloneintherain"
  ],
  "title": "familiar (but this time i've had some practice)",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "How to Train Your Dragon (Movies)"
  ],
  "relationships": [
    "Hiccup Horrendous Haddock III/Astrid Hofferson"
  ],
  "characters": [
    "Hiccup Horrendous Haddock III",
    "Astrid Hofferson",
    "Fishlegs Ingerman",
    "Snotlout Jorgenson",
    "Ruffnut Thorston",
    "Tuffnut Thorston",
    "Stoick the Vast"
  ],
  "additional_tags": [
    "reverse de-aging?",
    "Friendship",
    "Self-Esteem Issues",
    "parenting issues",
    "mentions of past bullying",
    "Hurt/Comfort",
    "POV Outsider",
    "Time Travel",
    "A surprising amount of fluff",
    "because everything i write gets schmoopy somehow"
  ],
  "language": "English",
  "series": "",
  "published": "2019-03-22",
  "completed": null,
  "words": "13,140",
  "chapters": "1/1",
  "comments": "287",
  "kudos": "15,364",
  "bookmarks": "3,629",
  "hits": "103,350",
  "summary": "<p>Every decade, three teenagers are dragged from the future and placed in their younger bodies to give predictions that will set the tone for the next ten years on Berk.</p>\n<p>But how are three dragon riders supposed to give prophecy to a village full of dragon-hating vikings?</p>\n<p>(Time travel AU)</p>",
  "notes": "<p>I started this back in 2015. After a bit of encouragement on tumblr, I decided to take it out, dust it off, and double the word-count. So while it has been edited (by myself, not by a beta), the writing quality might be a little dubious in places. Bare with me.</p>\n<p>The original Berk where this fic is set is pre-HTTYD, whereas the future kids are pre-HTTYD 2 ages. For reference:<br>- Currently the kids are 14yo (while they’re 15yo in HTTYD)<br>- Their future selves are 19yo (while they’re 20yo in HTTYD 2)<br>Hope that makes sense!</p>\n<p>Title is from  <a href=\"https://www.youtube.com/watch?v=OQx7NCpxQ4A\" rel=\"nofollow\">Familiar from Steven Universe</a>.</p>\n<p>Warnings for self-esteem issues and Berk’s questionable behaviour towards Hiccup pre-Toothless. If there’s anything I missed, please let me know.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p> <a href=\"https://captainkirkk.tumblr.com/\" rel=\"nofollow\">My tumblr.</a></p>",
  "text": "<p>Once a decade, a comet would pass over Berk. The following morning, the village woke to find one of their own changed, their child-minds replaced by their adult counterparts. The future self contained in the present body.</p>\n<p>Last time the comet had come, Hiccup had been four years old. The trio of villagers that the comet selected—adolescents, as tradition dictated—wore forced laughter and worried glances. Their predictions came like a death sentence for the village.</p>\n<p>The dragons, the seers had said, would become more aggressive. They told Berk to arm themselves. To prepare for a war.</p>\n<p>Hiccup was fourteen now, almost fifteen. Gothi had predicted that the comet would pass over Berk in the coming week, and all eyes had turned to the teenagers of Berk in anticipation. Teenagers always were the ones chosen to be seers, the ones caught in the liminal space between childhood and adulthood.</p>\n<p>An undercurrent of anxiety simmered through the village. The last seers brought dark predictions, ones that came true (though that was unsurprising; the seer’s predictions always did). What if these seers talked about even darker times to come? Berk was barely surviving as it was…</p>\n<p>The parents of teenagers were especially anxious. It was a great honour to have a child become a seer, an ever greater honour to become one yourself. Stoick snuck Hiccup hopeful glance. He was, no doubt, hoping that his son would bring him some kind of pride.</p>\n<p>Part of Hiccup hoped it <em>was</em> him, though he was terrified at the prospect.</p>\n<p>The village had all but given up on Hiccup, but maybe, <em>maybe</em>, he could become a seer, a child of the gods. Maybe Hiccup’s future self could wow the people of Berk, tell stories about his great adventures, how he’d risen from battles victorious, bathed in dragon blood.</p>\n<p>But. What if he never changed? What if the comet brought future Hiccup to the present, and the man was just as awkward and weak, and lived in a Berk controlled by Chief Snotlout?</p>\n<p>Just like all of Berk, Hiccup hoped that, whoever the comet brought back from the future, they didn’t squash what little hope he had left.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p align=\"center\"> </p>\n<p align=\"center\">Day One</p>\n<p> </p>\n<p>At the very end of the week, just when people were beginning to panic, the comet came. It passed overhead during the darkest parts of twilight, when all but the moon were asleep.</p>\n<p>Morning arrived. People stumbled out of their homes, roused by the excitement sweeping through the village.</p>\n<p><em>The comet came in the night,</em> villagers said to one another. <em>The First Seer is here! The First Seer has arrived.</em></p>\n<p>They moved toward the Great Hall, murmuring and pushing each other, eager to see who the gods had chosen. Who was it? What predictions would they bring?</p>\n<p>The seer’s father was shouting, standing on a table with his dazed son at his side.</p>\n<p>“My boy!” Spitelout said, waving his hands in the air. “A seer!”</p>\n<p>Everyone crowded Snotlout. The boy shook his head at them, eyes wide. He looked around, confused, as though Berk was unfamiliar to him. He kept glancing down at himself and tugging at his clothes, like he had woken up in a stranger’s body.</p>\n<p>“Tell them, Snotlout,” Spitelout urged. “Give them their predictions.”</p>\n<p>Spitelout, chest puffed out in pride, pushed Snotlout forward. He looked at his son expectedly. Snotlout stared out at the sea of faces, expression blank.</p>\n<p>“Erm,” Snotlout said dumbly. “Well. I win the Thawfest Games this year?”</p>\n<p>Spitelout beamed. “Yes, well, not that great of prediction, is it? You win every year! How about something else?”</p>\n<p>“Erm.” Snotlout gazed out at them, silent, before finally admitting, “I’d rather not.”</p>\n<p>“What?” Spitelout snapped, as the crowd began to protest. “Why not?”</p>\n<p>“The boy has the right,” Stoick called, pushing his way through the crowd to the front. “He’s the First Seer. He doesn’t have to say anything right now.”</p>\n<p>As tradition dictated, the predictions did not officially start until all three seers had arrived. Berk had never really followed this tradition, as the entire village had always been too eager to find out their fates. Strangely, Snotlout seemed steadfast in this, determined to uphold tradition.</p>\n<p>“No predictions?” Spitelout asked, aghast.</p>\n<p>Snotlout shook his head, no, and refused to tell them much of anything.</p>\n<p>This does not stop Spitelout from boasting about his son, the First Seer, all morning. Stoick put up with Spitelout’s boasting with resigned grace.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Snotlout followed his feet through the village. Berk was so different—currently set up to defend from dragons rather than house them—but it was still his home, where he grew up, and he found everything easily. The smithy, his home, the docks.</p>\n<p>His friends.</p>\n<p>“Ay, Snot-man!”</p>\n<p>Tuffnut’s wave was eager, but Snotlout cringed. He hadn’t heard that name spoken so seriously in a long time. He was used to hearing it from Astrid or Hiccup in a teasing tone, even Fishlegs when the man was feeling especially sarcastic, but certainly not as a serious nickname.</p>\n<p>The teenagers stood about in a loose semi-circle, eyeing Snotlout critically. Snotlout stared back, awash with nostalgia.</p>\n<p>Tuffnut without dreads. Astrid with her old choppy fringe. Fishlegs without Meatlug underfoot. It almost hurt to look at them.</p>\n<p>Snotlout approached them, hoping his casual tone belayed none of his nervousness. “Tuff, Ruff. Astrid. Fish. What’s up?”</p>\n<p>They blinked at him, and Snotlout pushed down the instinct to run away, get away from the utter wrongness that was these baby-faced versions of friends.</p>\n<p>These were not his friends, not the ones he knew, and yet they still <em>were</em>. They were kids, dumber and less experienced, but they were still the people Snotlout trusted with his life. Sort of, anyway.</p>\n<p>“Snotlout,” Astrid said. Beside her, Fishlegs silently mouthed the word ‘Fish?’ to himself, confused at the casual nickname from a boy who antagonised him so often. “Thought you’d still be in the Great Hall.”</p>\n<p>“Yeah,” Tuffnut agreed. “Since you’re this big seer now or whatever. Weird.”</p>\n<p>Ruffnut latched onto his arm. “What’s the future like? How cool are we?”</p>\n<p>“Um,” Snotlout said.</p>\n<p>Maybe the comet had picked the wrong person. He wasn’t the person for this job. Hiccup? Yes. But Snotlout? He was stumbling through this, trying desperately to give away as little about the future as possible.</p>\n<p>“How old are we, Snotlout?” Fishlegs asked. “How old are you right now? Mentally, that is.”</p>\n<p>Finally, something Snotlout could answer. He let a cocksure grin spread over his face, replacing the anxiety.</p>\n<p>“Nineteen. Almost twenty.” He felt a rush of pride when they made little sounds of awe. “I know, right?”</p>\n<p>“Adulthood,” Fishlegs said, amazed. “What’s it like?”</p>\n<p>“Awesome. Freedom, a tonne of awesome responsibilities, a whole village looking to us for guidance! Awesome.”</p>\n<p>“Guidance?” Astrid asked, and Snotlout bit his tongue.</p>\n<p>“In fighting dragons,” he lied. “You know. Since we’re the dragon killing masters.”</p>\n<p>“Uh huh,” Astrid said, over the sounds of the twins jumping into the air and shouting.</p>\n<p>“Well, then,” Snotlout said quickly. Fishlegs looked ready to unleash a barrage of questions, whereas looked like she was about to start drilling him for answers. With a mace. Time to make a hasty escape.</p>\n<p>“I’m going to find Hiccup,” he said. “He must be tiny right now, right? That’s crazy. How old you guys anyway? Fifteen?”</p>\n<p>“Fourteen,” Astrid corrected, eyes narrowing even further.</p>\n<p>The twins faltered. They stared at him. Even several villagers, who were hovering too-near to him (especially after the orders Stoick had issued the adults, to stay away from Snotlout, to respect tradition and not ask him pressing questions) seemed confused.</p>\n<p>“What’d you want Hiccup for?” Ruffnut said.</p>\n<p>“Tiny right now?” Fishlegs quoted. Snotlout silently cursed the boy’s perceptiveness, cursed the same intelligence that would later become vital to the village. “Does that mean… he’s not tiny anymore?”</p>\n<p>Snotlout laughed loudly and stepped backward, away from them and their searching gazes.</p>\n<p>“Something like that,” Snotlout said. “Growth spurts happen to the best of us.” Except him. Dammit. “Anyway, I’m going to go find baby Hiccup. See you around.”</p>\n<p>Snotlout turned tail and ran. He could faintly hear Fishlegs express sympathy for Hiccup for how eager Snotlout seemed to be to seek him out.</p>\n<p>“Don’t hurt the twerp too bad!” Tuffnut called after him. “Or do. We don’t care.”</p>\n<p>The twins descended into loud, guffawing laughter. He knew fourteen year old Snotlout would have been laughing alongside them, and wished, not for the first time, that he wasn’t the First Seer.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Snotlout paused halfway to the chief’s house. Would Hiccup be there? Or would he be somewhere else? Didn’t he like spending time in the forest? Or was that just because of Toothless?</p>\n<p>“Ah, Snotlout!”</p>\n<p>His father. Oh, no.</p>\n<p>“Dad,” Snotlout said simply.</p>\n<p>Spitelout smiled and threw an arm around Snotlout’s shoulder, trying to guide his son closer to the Great Hall. It was harder than usual, with his son’s confident stance, his squared shoulders.</p>\n<p>“Come and tell stories with everyone. You can talk about your future accomplishments. How many dragons have you killed, aye? A lot, I bet!”</p>\n<p>“No thanks,” Snotlout said, before quickly explaining, “Leave that to the celebration in two nights time, right? After the other seers arrive? More people, better atmosphere.”</p>\n<p>Spitelout laughed, but didn’t let go. He tugged Snotlout towards the Great Hall again. “But I’m sure you have lots of stories. You can start by telling them now.”</p>\n<p>Snotlout frowned. This version of his father still thought Snotlout had a shot at becoming chief. He hadn’t been mellowed out by the years. This Spitelout still thought his son would bend to his every order.</p>\n<p>“No, dad.”</p>\n<p>“No?”</p>\n<p>“No. I want to wait, do things traditionally.”</p>\n<p>“Why—?”</p>\n<p>“I just do, alright?”</p>\n<p>Spitelout scowled at his son, and it felt, in that moment, like the clashing of two swords. Spitelout didn’t like being told what to do, hated his own will being challenged. But Snotlout wasn’t a child anymore. He wouldn’t be moved.</p>\n<p>“Alright,” Spitelout agreed, finally. “Okay. We’ll wait.”</p>\n<p>Snotlout exhaled, and let his lips curl into a smile. Their relationship still had miles to go, but this was one victory won. One little milestone.</p>\n<p>Spitelout father offered his own small smile, looking almost proud at his son’s will. “I’ll see you at lunch?”</p>\n<p>“See you at lunch.”</p>\n<p>Snotlout nodded and ran down the street, before halting halfway up the dirt path. He looked back and called:</p>\n<p>“Er, dad? You wouldn’t know where Hiccup is, would you?”</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Hiccup was in the forge, just as Spitelout had promised.</p>\n<p>He was alone, viciously hammering a sword, sharpening it with a heady kind of focus, an apron tied around his waist.</p>\n<p>It’s like a moment out of time—<em>was</em> a moment out of time. Hiccup was tiny again. His unbraided hair wasn’t windswept. There was no Toothless curled near the fire, watching Hiccup with adoration.</p>\n<p>“I’m surprised you can pick that hammer up,” Snotlout said. It was habit, at this point, to tease Hiccup. Where his adult cousin would pull a face and laugh, invite him in and ask after his wellbeing, this Hiccup scowled deeply.</p>\n<p>“Snotlout. What do you want?”</p>\n<p><em>Tink!</em> His hammering turned violent, the bulky handle now held in a white-knuckled grip, beating down on the metal as though it had done him great misfortune.</p>\n<p>“Just here to see you,” Snotlout said honestly.</p>\n<p>Hiccup stopped. He squinted at Snotlout. “Why…?”</p>\n<p>“Well—look at you! You’re so small! Fourteen again. Gods.”</p>\n<p>“Keen eye,” Hiccup said drily. “Really. Are you going to observe anything else, then? Tell me anything else I already know?”</p>\n<p>Snotlout blinked. “Huh?”</p>\n<p>Hiccup huffed and dropped the hammer. He hiked a pile of metal swords into his arms, carrying the bundle over to his workbench, where he let it fall with a clatter.</p>\n<p>“Shouldn’t you be off telling epic tales, oh great child of the heavens?”</p>\n<p>“Well …”</p>\n<p>Hiccup stopped, his back to Snotlout. His shoulders were hunched. It made him seem smaller than he already was. Snotlout was used to a taller Hiccup, a more confident Hiccup. Not this tiny bundle of bones and self-depreciation.</p>\n<p>But the sarcasm, the way the kid talked with huge gesturing and low derision—that was all too familiar.</p>\n<p>“Or are you here to talk about <em>my</em> future?” Hiccup sounded bitter, less joking, a vicious bite undercutting his words. “Tell me how big of a failure am I.”</p>\n<p>Snotlout jerked back. “No. Hiccup. You’re e definitely not a failure in my time.”</p>\n<p>“Oh, so I’ve been carried off by dragons then?”</p>\n<p>Snotlout snorted at that, shaking his head. If only the kid knew.</p>\n<p>“Killed by the twins?” Hiccup continued. “Dropped down the well? Drowned?”</p>\n<p>Hiccup listed off potential deaths without pause for breath, completely casual but only partially joking. That last one stole Snotlout’s breath, if only for the near truth of it; his cousin had almost been claimed by the water once, several months after the battle with the Red Death.</p>\n<p>They had all been exploring the other side of Berk, behind the mountains, when Hiccup had fallen behind them, unable to keep pace on his still-new leg. Their dragons were several fields away, rolling in the long grass.</p>\n<p>Hiccup had stumbled, slipped on uneven ground, and tumbled into the black lake. They had heard the splash, and turned and laughed at Hiccup’s clumsiness, his overdramatic flailing in the water.</p>\n<p>Then, after several long minutes, they had released that Hiccup wasn’t joking. When he slipped beneath the surface, heavy metal prosthetic weighing him down, he didn’t come back up.</p>\n<p>Snotlout remembered it keenly: Astrid’s shout of realisation, breathy, like she’d been punched in the stomach, before she threw herself bodily in after Hiccup. How pale Hiccup had been after Astrid dragged him out, his lips stained blue. How limp he had been, skin cold to the touch. How much water he’d thrown up after Astrid had thumped on his chest.</p>\n<p>“No,” Snotlout said, too late.</p>\n<p>Hiccup squinted at him. “No? Not even a bit of maiming? You sure all my limbs are accounted for?”</p>\n<p>Snotlout turned, coughed awkwardly into his palm, and pretended to ignore Hiccup. He looked over Gobber’s workbench, inspected some of the tools left out. The forge was so strange like this. Pre-dragons. Everything here was designed to kill or capture, not save or support.</p>\n<p>The fire crackled. Hiccup grumbled to himself and got back to work. The tinkering of metal returned.</p>\n<p>Neither was sure what to say to the other. Dialogue hadn’t been this tense between them in years, and it had certainly never been this strained, with one of them small and fourteen, the other nineteen and unsure.</p>\n<p>“So, did you want something?” Hiccup asked after the longest of silences.</p>\n<p>Snotlout wanted to do something vaguely supportive. It was very obvious that Hiccup didn’t like him, and Snotlout wanted to rectify that. At least reassure him that they weren’t still at odds in the future. Hint at the friendship they would come to share. “I just… wanted to see you, I guess? You’re, um. Not the same, like this, and I thought it’d be cool to come see you. The Hiccup I know is …”</p>\n<p>Annnd there he went, sounding like an idiot again. He really was related to Hiccup “word-vomit” Haddock.</p>\n<p>“I’m not the Hiccup you know,” Hiccup cut in. “I’m this Hiccup. However your Hiccup messed up? That’s not my fault. Whatever he did is his problem, or won’t be mine for another however many years. So just—go, will you?” Hiccup gestured towards the exit. His face was all squished up. Pained.</p>\n<p>“What?” Snotlout said.</p>\n<p>“I don’t want to hear about your successes like the rest of the village,” Hiccup said. “I don’t want to hear about anything I become, or fail to become, and I definitely don’t want to know about all the ways in which I’ve managed to piss you off, or get in your way, or screw the village over. So please, Snotlout, for once in your life, will you please just let me be?”</p>\n<p>Hiccup panted, worn out by his speech, though his voice had remained level this entire time.</p>\n<p>“Hiccup,” Snotlout began.</p>\n<p>Hiccup stabbed a finger at the door, and when he shouted, his pubescent voice cracked in a way Snotlout would normally have teased him for. “<em>Go</em>.”</p>\n<p>Snotlout went.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Snotlout hid for the rest of the day. It was no small feat, dodging the hoards of villagers. Some respected Stoick’s orders and stayed silent when he was around. Just stared. Like Snotlout was a stranger. Others completely disregarded their chief’s wishes and bombarded him with questions.</p>\n<p>Snotlout wanted to stick Hookfang on the lot of them.</p>\n<p>(He tried not to think about his Nightmare, because that knowledge—that Hookfang was out there somewhere, possibly under the control of the Red Death—left him feeling cut open. It was far worse than when his dragon left for Dragon Island. At least then Snotlout knew Hookfang would be safe.)</p>\n<p>After a brief, awkward lunch with his dad, he disappeared into the forest.</p>\n<p>The forest, at least, was unchanged. It was comforting. Snotlout explored Berk’s abandoned places for the remainder day.</p>\n<p>He came across wild dragons in the forest. Mostly terrors. A lone gronckle. Snotlout’s taming abilities were nothing like Hiccup’s, but he had picked up lots of things over the years. He imitated his cousin, letting his posture go slack and non-threatening, and was able to calm them and soothe them with light petting, before he moved on.</p>\n<p>He only headed back to Berk when the sun dipped and stars began to poke through the clouds. He was greeted as he headed to the Great Hall. People thumped him on the back as he passed—though the action only left him feeling awkward, like some sort of fraud. Tuffnut shouted something at about his future virginity (or hopeful lack thereof).</p>\n<p>Snotlout ignored them all.</p>\n<p>At dinner, Snotlout sat at the Head Table. It was strange not to see a table set out near the chief, where their friends always sat at feasts, Hiccup perched at the head with Toothless curled around his chair.</p>\n<p>He spotted the young versions of his friends at a table towards the back. Ruff and Tuff had turned on each other, almost spilling their food with their fighting. Snotlout had forgotten how bad they could be, hopped up on hormones with productive outlet to funnel their energy in.</p>\n<p>Fishlegs, on the other side of the table, was hunched over a book, trying to appear invisible. And Astrid was staring back at Snotlout.</p>\n<p>Out of the four of them, the change in Astrid was the most obvious. She lacked the calm steadiness she carried around as an adult. She held herself differently, too, ready to launch into a fight at any moment. And the Hiccup-shaped shadow at her side was as even more glaring in its absence.</p>\n<p>Snotlout wrenched his gaze away from the smaller, volatile versions of his friends. He had to scan the Great Hall twice before he spotted Hiccup.</p>\n<p>Towards the back, half-shrouded in darkness, was Hiccup. Eating alone. Stoick either hadn’t noticed or didn’t mind that his son was by himself on the fringes of the village. Maybe this was normal. Snotlout remembered seeing Hiccup eating alone on occasion, though he never really paid him attention unless he came close enough to strike or tease; and he remembered actively stopping Hiccup from sitting with the other teenagers more than once.</p>\n<p>A thought struck him then: he could go up to that shadowy apparition on the outskirts of the feast and join him.</p>\n<p>If this was his Hiccup—gangly, one-legged Hiccup—he would already be halfway across the Hall, determined to figure out what was wrong with his cousin. Or else he would be jogging off to find the others and ask for backup, because whatever had happened that forced Hiccup into seclusion, without either Toothless or Astrid by his side, must have been <em>bad</em>.</p>\n<p>But this wasn’t his Hiccup. The others weren’t here to consult. This Hiccup probably wouldn’t welcome his company or the attention it would bring. And Snotlout wasn’t brave enough to cross the Great Hall and sit across from that sallow-faced apparition. He didn’t have the words or courage this Hiccup needed. Not on his own.</p>\n<p>Tomorrow, the Second Seer would join him. And the day after that, the last seer, the Third, would arrive. Snotlout wouldn’t be on his own. Even if it ended up being one of the twins, Snotlout would be grateful to have someone he recognised by his side, someone who knew the bliss that came with soaring through the air astride a dragon, someone else who shuddered at the sight of a Killing Ring that was still used for killing, and who knew how insane it was that Hiccup was sitting by himself at dinner without Toothless or Astrid, without a ring of friends and villagers full of questions and concerns for their future chief.</p>\n<p>Maybe Hiccup would become the Second Seer. Snotlout hoped so. Hiccup would know what to do.</p>\n<p>But until then, until Snotlout had someone familiar by his side, he kept his head down.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p align=\"center\">Day Two</p>\n<p> </p>\n<p> </p>\n<p>Hiccup, always an early rising, woke when it was still dark. He bolted up immediately and patted himself down.</p>\n<p>Same body. Same hands. The same ordinary Hiccup.</p>\n<p>He dressed slowly, shoulders slumped, and trudged down stairs. He hoped his father wasn’t awake.</p>\n<p>Per Hiccup’s luck, he was.</p>\n<p>Stoick’s hands were clasped nervously together. He stared up at Hiccup, expectant, a small little smile starting to unfurl under his beard.</p>\n<p>“Son…?”</p>\n<p>“Just me, dad,” Hiccup said, kicking the wood stairs with his boot, eyes downcast. “Sorry to disappoint.”</p>\n<p>Stoick visibly deflated.</p>\n<p>“Ah,” he said gruffly. “Well, that’s alright. Always tomorrow, then, aye?”</p>\n<p>The chief turned away, and Hiccup clenched his fists tightly. He knew somehow that tomorrow would only bring more disappointment.</p>\n<p>Stoick couldn’t continue to live like this, in complete denial about who Hiccup was. He couldn’t keep hoping that one day, he’d wake up and miraculously have the son he’s always wanted. That’s just. That’s not going to happen.</p>\n<p>“Dad,” Hiccup started. “I don’t think I’m going to be a seer.”</p>\n<p>Stoick laughed, dismissive, as he tugged on his fur chieftain cloak. “Now, Hiccup—“</p>\n<p>“I’m serious, Dad.” That silenced him. He stared at Hiccup solemnly. “Two-thirds of the seers have been chosen by now. I’m not going to be one of them.”</p>\n<p>“Why do you think that?” Stoick said, voice strangely quiet in their big house.</p>\n<p>“Why would I be?” Hiccup laughed, and it came out sadder than he meant. Stoick thankfully ignored it. “The stars don’t want me, dad. You have to face it—I’m just not cut out to be something as important as a seer. I’m, you know, me. I’m not meant to give the legendary and life-changing predictions you want.”</p>\n<p>Stoick seemed to be full of regret, too. He opened his mouth to say something, to rebuke Hiccup’s claim, but closed it. He did not argue with Hiccup’s assessment of himself.</p>\n<p>Stoick nodded, a small, almost subconscious tilt of his head, and left Hiccup alone in the empty house. The chief had the next seer to find.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>The air was crisp and clear, the horizon painted with the soft pinks and purples of the rising day, and the village beneath began to awake. Slowly, at first, and then all at once as people rushed from their homes and bounded up to the Great Hall.</p>\n<p>Snotlout was dragged out of bed against his will. He had thought this whole ‘seer’ business might be a nice break from being awaken at crazy early times by dragon riders itching to train. Apparently, he had thought wrong.</p>\n<p>The crowd within the Great Hall grew increasingly impatient as the Second Seer failed to immediately present themselves.</p>\n<p>Spitelout rested a hand on Snotlout’s shoulder, tying the young future-seer to him.</p>\n<p>“Well, then, Snotlout,” Spitelout said. “Tell us some predictions while we wait.”</p>\n<p>“I’ve already said no,” Snotlout reminded him. The crowd was not deterred. They shouted requests up at him.</p>\n<p>Snotlout would not cower in front of these people. He was a battle-hardened warrior, an experienced dragon rider.</p>\n<p>But with his father glaring down at him, a sea of eager faces staring up at him, and a head still foggy with sleep, Snotlout felt poorly equipped to fend them off. He felt like he really was fourteen year old again, small and out of his depth.</p>\n<p>“Well,” Snotlout began. “There’s, um, there’s.”</p>\n<p>“That’s it, son,” Spitelout urged.</p>\n<p>“Well, um. There’s… There’s Hiccup.” The words came unbidden from Snotlout’s mouth, and he was not free to stop them. “Hiccup ends up—”</p>\n<p>The door burst open with a resounding <em>bang!</em></p>\n<p>“Snotlout, you had better stop talking right now or<em> so help me Odin.”</em></p>\n<p>The crowd fell silent for the first time that morning. All heads turned towards the door.</p>\n<p>In the threshold of the Great Hall, chest heaving as she panted roughly, stood Astrid Hofferson.</p>\n<p>Snotlout’s stiff shoulders sagged in relief. This was not the same Astrid he saw yesterday. This Astrid had the same fire in her eyes, only brighter and more controlled, and she held herself firmer, with more surety, more mellowed confidence. A warrior used to being recognised and listened to.</p>\n<p>Finally, someone familiar.</p>\n<p>“You’re the Second Seer?” Snotlout asked.</p>\n<p>Astrid nodded as she tried to smooth down her horrendous bed-head. “I am.”</p>\n<p>The crowd erupted into shouts once again. They grabbed hold of her, physically dragging her through the masses and pushing her toward Snotlout, her fellow seer. Astrid’s mother was shrieking with joy, the battle strengthened women looking like a child as she jumped and pointed and said, “That’s my girl! That’s my Astrid!”</p>\n<p>“I am a seer,” she repeated, looking more annoyed than prideful. She was beginning to realise what Snotlout had already realised; being a seer was a gruelling job. They were amongst dragon-killing vikings who wanted to know about their future —the future that harbouring and protecting and loving dragons. They wouldn’t accept that.</p>\n<p>“What are we going to do, Astrid?” Snotlout hissed. “They won’t belief us, but we have to tell them <em>something</em> eventually.”</p>\n<p>“We can’t!” Astrid hissed back in the same frustrated whisper. “We’d ruin everything. If we prematurely caused”—she glanced nervously around, saw that there are dozens of eyes trained carefully on them, and lowered her voice further—“the … the peace, then Hiccup will never shoot and meet you-know-who.”</p>\n<p>“I know who?” Snotlout asked.</p>\n<p>Astrid whacked him around the head. “Who do you think!”</p>\n<p>“Oh,” Snotlout said. “Toothle—<em>mmph!”</em></p>\n<p>Astrid’s glare was as firm as ever, her hand clasped tight over Snotlout’s mouth.</p>\n<p>“What did I just say? We can’t say anything important.”</p>\n<p>“What’s going on?” Spitelout demanded, peering at them. “You two are seers, yet you’re refusing to do what you were brought here to do. Give us predictions, bring honour to your families.”</p>\n<p>Snotlout and Astrid exchanged glances.</p>\n<p>This moment was happening simultaneously for Berk and for the nineteen year olds, the timeline looped in on itself, and so they couldn’t even look back on their memories for assistant on how to handle this. They were on their own.</p>\n<p>“Mmmfph,” Snotlout said behind Astrid’s firm hand. The blonde didn’t know what he was saying, but she nodded along solemnly neither-the-less. Spitelout’s gaze hardened.</p>\n<p>And then the chief entered the Great Hall.</p>\n<p>Snotlout went lax under Astrid’s hand. Stoick was on their side at least—and he would continue to be on their side until he found out the seers’ predictions were infested with dragons.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>They escaped after that, Astrid dragging Snotlout out by the arm, and ducked and rolled until they were out of sight.</p>\n<p>With the majority of Berk’s residents at the Great Hall, the village was mostly deserted. Still, Astrid mouth hung over and she stared at everything with disbelief.</p>\n<p>“I know,” Snotlout said.</p>\n<p>“We’re seers,” Astrid said. “We’re currently fourteen years old. Oh gods.”</p>\n<p>Snotlout saw how small she looked with her old clothing and her old hairstyle, her face still lined with baby fat, but she was still her nineteen year old self. There was something in her eyes, something that was older and more mature, hinting at the change she had undergone overnight.</p>\n<p>Astrid stared down at herself, inspecting her torso and arms and small hands. Snotlout had already done that yesterday. He’d spent an hour staring into a lake deep into the forest, marvelling at his reflection.</p>\n<p>“Seers,” Astrid murmured to herself. “<em>Seers</em>. And at the worst possible time.”</p>\n<p><em>It is the small things,</em> Snotlout thought, <em>that are the strangest.</em></p>\n<p>Hiccup was one giant glaring difference. The boy’s height, his stance, his lack of confidence. But strangely enough, it was Hiccup’s footsteps that unnerved Snotlout the most. Two flesh steps, like his own. <em>No step, clink.</em></p>\n<p>This Hiccup had all four limbs and far less scars than his older counterpart. But this Hiccup lacked the most important part of himself: Toothless.</p>\n<p>Snotlout kept expecting the dragon to pop out from around a corner, or pounce down from the rafters and surprise Hiccup. He turned and expected to see Hookfang lazing about in the sun, Terrors running around the rafters, Meatug following Fishlegs around.</p>\n<p>But he never did.</p>\n<p>And that scared him more than he would ever say.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>They headed to the chief’s house next. They explained to Stoick how they wanted to wait until tomorrow night’s feast to make their predictions. Stoick, though he looked worried, agreed, and left to go soothe the rest of the disgruntled village.</p>\n<p>The door shut behind him. Snotlout and Astrid traded looks.</p>\n<p>“Want to go look at Hiccup’s room?” Snotlout asked.</p>\n<p>“Oh, absolutely,” Astrid said.</p>\n<p>They raced up the stairs. The room they found was not that dissimilar from their Hiccup’s bedroom, but there was enough differences to be unsettling.</p>\n<p>Toothless’s bed was missing, and so was the big Berk flag Hiccup had spread along the wall, above his bed. An dragon killing axe hung suspended from the left wall. Below it, Hiccup’s chest was full of weapons of his own design, ones with tiny catapult’s and sharp blades. Astrid had always known that chest to be full of dragon riding equipment.</p>\n<p>A desk was wedged into the corner. Astrid made her way over to it. “Snotlout, look at this.”</p>\n<p>Snotlout stumbled over and peered over her shoulder. “Is that us?!”</p>\n<p>Hiccup had drawn them all before. Sometimes, when he was injured or just exhausted, he would lounge against Toothless and watch the group, journal and stick of charcoal in hand. He would draw them in motion, training or flying dragons, eating and chatting in the Great Hall.</p>\n<p>But this drawing was different. It was sloppy, drawn by someone younger and less skilled. And the subjects were not Hiccup’s friends. Not yet.</p>\n<p>The Snotlout in the picture had broader shoulders than the fourteen year old reality, and was baring his teeth and an axe at a Monstrous Nightmare. The twins stood at his flank, holding dual swords. They looked half-feral. Fishlegs cut a hulking figure, much broader and muscled than in reality, a small axe in hand. Astrid stood at the front near Snotlout. Her eyes were cold and hard, lit by the fire of the Monstrous Nightmare. Her hair blew behind her, her battle axe arched mid-swing.</p>\n<p>“We look … cool?” Snotlout said.</p>\n<p>“We look scary,” Astrid corrected. “Dangerous. Kind of inaccurate, too. Hiccup drew us like we were strangers.”</p>\n<p>“Well. We kind of are strangers at this point. To him, anyway.”</p>\n<p>They stood in that strange, almost-familiar room, looking, wondering.</p>\n<p>“We should probably …” Snotlout said, gesturing toward the door.</p>\n<p>“Right, yeah.” Astrid followed him out gladly.</p>\n<p>They turned, and there, in the doorway, was fourteen year old Hiccup.</p>\n<p>“What are you doing in my room?” he asked, eyes narrowed.</p>\n<p>“Seeing how much it’s changed,” Astrid said honestly. “Sorry, we should’ve asked your permission first.”<br>\n“Yeah, you should have.” Hiccup tried to square his shoulders, tried to look intimidating and angry as he puffed out his chest like a bird with ruffled feathers. It had no effect on the larger teenagers. “It’s disrespectful to go through someone’s things.”</p>\n<p>Snotlout took a step forward, but he stopped when Hiccup flinched back, the way one might jump away from a wounded dragon. Astrid’s arm grabbed his wrist to stop him from moving any closer to Hiccup and scaring him.</p>\n<p>“You’re right,” Astrid said. “We’re sorry.”</p>\n<p>Hiccup nodded.“Good. Glad we, uh. Glad we—we that sorted out.”</p>\n<p>It was amazing, seeing Hiccup like this. Their Hiccup was a fishbone too, but he was also tall and lean and sure. This Hiccup was short, shorter even than fourteen year old Snotlout, and he curled in on himself, shoulders hunching and feet shuffling, making him appear even smaller.</p>\n<p>“Um,” Hiccup said awkwardly. “Is there something that you … wanted? My dad went into town if you’re looking for him. I’m sure there’s a bunch of important, future-y things you two have to discuss, like the position of the—the stars or whatever—”</p>\n<p>Astrid and Snotlout shook out of their reverie, blinking to focus on the Hiccup that was in front of them, not the man the boy would become.</p>\n<p>“No,” Astrid said. “That’s not necessary. We’ll go.”</p>\n<p>They headed down the stairs, Hiccup trailing after them. Making sure they left.</p>\n<p>There were still uncountable traces of their Hiccup in this boy—countless freckles, charcoal smudged fingers, the same curiosity in bright green eyes.</p>\n<p>He was still Hiccup.</p>\n<p>“Bye, Hiccup,” Astrid said, voice dropping to something achingly fond.</p>\n<p>Hiccup blinked down at her. “Um. Bye?”</p>\n<p>Snotlout chuckled and reached out his hand as he passed, ruffling his auburn hair.</p>\n<p>Hiccup froze. It was almost comical, seeing this tiny, wide-eyed Hiccup beneath a tuft of large, messed up hair.</p>\n<p>“See you around, squirt,” Snotlout said, not unkindly.</p>\n<p>Hiccup was still staring when the door closed behind them.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Snotlout led Astrid into the forest, and they spent most of the day out there, going over how different everything was, taking strength in one another’s presence. They didn’t spend this much time together one-one-one usually, but here, stuck years in the past, they took solace in having someone else who understood how strange everything was, how much better they would become.</p>\n<p>At dinner, Astrid and Snotlout were ushered toward the head table. They let Berk cheer them, and smiled tightly through their well-wishes about the Third Seer, but didn’t touch their food. After everyone had begun to settle back down again and the attention strayed from them, Astrid picked up her plate and stood.</p>\n<p>Stoick looked up from his conversation with Gobber. “Astrid, is something the matter?”</p>\n<p>“Everything is fine. I just want to sit with my—my best friend for a while. Catch up.”</p>\n<p>Astrid nodded goodbye to the chief and his advisors and left, weaving through the densely-packed tables. Snotlout snatched up his plate and followed her.</p>\n<p>“Your <em>best friend?”</em> Snotlout jeered.</p>\n<p>“Shut up,” Astrid hissed back. “I’m not about to let him sit by himself when I’m right here. I don’t care what anyone else thinks.”</p>\n<p>They bypassed the table the twins and Fishlegs had sat at last night. It was empty. Tonight, Fishlegs and the twins were seated with their families.</p>\n<p>Hiccup was at the same table, though. His head was in a book. Her jerked back when Astrid plate landed next to his.</p>\n<p>“Is this seat taken?” she asked, and sat down beside him without waiting for an answer. Snotlout dropped into the bench across from them.</p>\n<p>“What are you two doing here?” Hiccup asked suspiciously, hiding his book under the table. “Shouldn’t you be at the head table?”</p>\n<p><em>“Shouldn’t you?”</em> Astrid wanted to ask. <em>“As the chief’s only son, as the future chief of Berk, shouldn’t you sit there every night?”</em> But she kept those words tucked behind her teeth.</p>\n<p>“It got boring,” Astrid said instead. “I’d rather be over here.”</p>\n<p>Snotlout nodded. Hiccup blinked, and said, “What?”</p>\n<p>“Is that all you’re eating?” Astrid poked at the sad chunk of bread and skinless chicken on Hiccup’s plate. She scooped up a portion of her own stew and dumped it onto Hiccup’s plate, carefully away from the bread and chicken, because she knew he couldn’t stand his food touching.</p>\n<p>“What?” Hiccup said again.</p>\n<p>“This is why it took so long for you to grow, dude,” Snotlout said, shaking his head. He pushed the bread and chicken aside so he could deposit a portion of potatoes from his plate to Hiccup’s without contaminating the food groups.</p>\n<p>Astrid stabbed her fork in Hiccup’s direction. “Eat.”</p>\n<p>When Hiccup just stared dumbly at her, Snotlout snickered. “Your Hiccup is much more obedient.”</p>\n<p>Astrid made a face. “Not really. My Hiccup just knows that it’s easier to give in when I insist he eat and sleep. That’s not an argument he ever wins.”</p>\n<p>Hiccup didn’t pick up his fork. He was too busy looking at her with big eyes. “Your …”</p>\n<p>“Just eat it, kid,” Snotlout said. “She is a lot stronger than you right now and I wouldn’t put it past her to use that to her advantage.”</p>\n<p>Astrid kicked Snotlout under the table. He yelped.</p>\n<p>Hiccup looked down at his plate distrustfully. “Did you do something to the food?”</p>\n<p>“Of course not,” Astrid said, glaring at Snotlout out of the corner of her eye.</p>\n<p>“Then why are you over here talking to me?” Hiccup looked over their shoulders. Astrid followed his gaze. Half a dozen tables quickly went back to what they were doing, striking up too-loud conversations with the person closest to them.</p>\n<p>“I’m here,” Astrid said, turning away from the rest of the village, who didn’t matter to her nearly as much as the boy version of her Hiccup sat beside her, “because I want to be. I want to get to know this past version of you.”</p>\n<p>“Okaaay,” Hiccup said. “Is <em>that</em> the joke, then? Because it’s not a very good one. I’ve heard better.”</p>\n<p>“No, that’s not …” Astrid laid her hands on Hiccup’s shoulders. She hoped he could see the truth in her gaze. He was always been good at reading body language, looking past the exterior and seeing the soul within. It was what made him such a good dragon tamer. It was part of what will make him a good chief, when Stoick finally managed to convince him to take the mantle.</p>\n<p>“Hiccup,” she said, “I’m here because I want to get know you better than I already do. I want to know this version of you that doesn’t remember the past five years of shared adventures. I’m here because you’re my favourite person, even this young version of you. And if there’s one place I want to be, it’s always going to be by your side.”</p>\n<p>Hiccup’s eyes were locked with hers. Could read the open truth behind her pupils. Astrid felt like he was reaching into her, the way he crouched in front of wild dragons and touched their soul using little more than eye contact and hand gestures.</p>\n<p>And then his face flooded with colour. His shoulders trembled a little beneath her hands, and that was familiar, too. She wondered how familiar he found her. Fourteen-year-old Hiccup didn’t know her very well, but they had all grown up together, and there must have been parts of her that he found familiar and bizarrely alien.</p>\n<p>Hiccup let out a shaky breath. “Okay.”</p>\n<p>They ate dinner together. Every time Hiccup slowed, Snotlout and Astrid jostled him and encouraged him to keep going.</p>\n<p>It reminded her of the early days, when Berk was just getting used to dragons and dragons were just getting used to Berk. Back then, Hiccup would eat like a bird. She had struggled to get Hiccup to eat more than the child portions he always served himself, but Hiccup was still a distant thing to her. An island she hadn’t learned how to sail to yet.</p>\n<p>Hiccup managed two-thirds of his dinner, while Snotlout and Astrid talked at him. Meaningless things, about the villagers around them and their counterparts five years in the future. Hiccup opened up slowly, like a flower-bud unfurling under gentle sunlight. He sounded more and more like their Hiccup the longer they sat there.</p>\n<p>“Dad keeps looking this way,” Snotlout said, cutting through Astrid’s story about the time the twins almost burnt down the forge, carefully leaving out Barch and Blech’s role.</p>\n<p>“Do you think he’s going to come over here?” Astrid asked.</p>\n<p>Snotlout groaned, sinking down in his seat. “I hope not. He keeps dropping hints about giving a speech—I <em>hate</em> speeches.”</p>\n<p>Hiccup perches up. “Really? I thought you would've loved …” <em>Being the centre of attention.</em></p>\n<p>“I’m no good at speeches, not like yo—uh, another person I know. I prefer action.” Snotlout made a sweeping signal in the air. Hiccup might have interpreted the gesture as Snotlout leading a fleet of ships onward, but Astrid recognised it as the guiding hand of a dragon-riding.</p>\n<p>“Your dad’s talking to Stoick,” Astrid said. “About us, probably. I think they’re going to try and talk to us soon, before the end of the feast.”</p>\n<p>“You guys should go, then,” Hiccup said, more subdued than he had been since Astrid and Snotlout had dropped onto his table.</p>\n<p>“Yeah, we should,” Snotlout said, pushing his plate away. “Think you can climb, dude? You’re a lot smaller, but right now you have two—”</p>\n<p>“Friends,” Astrid cut in loudly, glaring at Snotlout. “Right now you have two <em>friends</em> to help. Come on, lets go.”</p>\n<p>Hiccup glanced back and forth between them when they stood. “Go where?”</p>\n<p>“Away from here, at least,” Snotlout said. Spitelout stood up at the head table, and Snotlout yelped and made a dash for the door before his father could call him back.</p>\n<p>Astrid pulled Hiccup to his feet. She grabbed his hand to steady him when he stumbled.</p>\n<p>“Come on!” she called. She didn’t let go of his hand as they ran after Snotlout, their sweaty, adolescent fingers intertwined the whole way out of the Hall and up Berk’s green hill.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Snotlout and Astrid scaled the forge easily. Hiccup struggled below them, but once Astrid held out a hand and directed him on where the best footholds were, he managed to climb up and join them on the roof.</p>\n<p>“It’s weird,” Snotlout said, laying on the flat side of the forge’s roof. “It’s so empty. Normally we’d be fighting for space, but …”</p>\n<p>Astrid’s hand snaked around Hiccup’s shoulders. They picked their way across the roof, Astrid helping to steady him and keep him away from weaknesses in wood beneath their feet. She touched him so easily. Like they had done this—pressed side-to-side, walking together, Astrid escorting him like Hiccup was missing half his limbs and needed to be half-carried—dozens of times before.</p>\n<p>“Who else would come up here?” Hiccup said. “The twins?”</p>\n<p>They sat beside Snotlout. The Hall was a bright beacon on the other side of Berk. The village was quiet and still around them. Hiccup’s gaze was pulled upward, towards the stars, but the two seers keep glancing around Berk, taking in its strangeness.</p>\n<p>When they didn’t answer, Hiccup asked, “Does Berk change that much in the future? I know you don’t want to say, but with the way you’ve been acting, I can’t help but wonder …”</p>\n<p>The First and Second Seer had vowed not to give premonitions until they were joined by the Third. But up there, there was just Hiccup, wedged between the two of them, and the open rooftops, empty in a way they apparently wouldn’t be in the future.</p>\n<p>“Yes,” Astrid said. “It changes. For the better.”</p>\n<p>“You’ll going to like it,” Snotlout promised.</p>\n<p>“And I change?” Hiccup asked. “For the better?”</p>\n<p>Astrid and Snotlout considered this.</p>\n<p>“It’s more like,” Astrid began, “you help invoke that change. The good change.”</p>\n<p>“Astrid,” Snotlout warned.</p>\n<p>“I’m not saying more than that, okay? But we have to tell him something. He deserves that much.”</p>\n<p>Snotlout didn’t argue that. Hiccup stared hard at the bright Hall, far across the black village. He stashed the words in his chest, somewhere hidden, where he could pull them out again and again to examine, to feel comfort at their presence.</p>\n<p>\n<em>You invoke change. Good change.</em>\n</p>\n<p>What could Hiccup possibly do to change the future so drastically that, five years into the future, Astrid and Snotlout barely recognise Berk?</p>\n<p>Astrid put an arm around Hiccup’s shoulder. He startled under the touch. She pulled her arm away, and stared deeply at his face, trying to read the expression fixed there. He stared back. The person he saw was different to the Astrid he knew—but not a total stranger, either.</p>\n<p>Carefully, he leaned against her. Her arm resettled around him, and her hair brushed against his cheek. He felt warm at the tickle of her fringe, the spiky press of her skirt against his leg.</p>\n<p>They stayed up there for a long time, until eventually, Hiccup’s eyes started to close and their limbs became stiff with inactivity. Then they climbed down and parted ways.</p>\n<p>“Can I spend tomorrow with you?” Hiccup asked, and then immediately regretted. They would probably be busy with the Third Seer tomorrow.</p>\n<p>Snotlout snorted and ruffled his hair so fiercely that Hiccup almost toppled over. Astrid smiled at him, and said, “Of course. We’ll see you at breakfast, Hiccup.”</p>\n<p>Hiccup waved goodbye and set out for his house at the top of Berk. The entire walk home, all he could think about was getting to sit with his friends during breakfast tomorrow. He had never sat with friends during meals before today, but he found that he rather liked the idea of it.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p align=\"center\">Day Three</p>\n<p> </p>\n<p>When Hiccup woke, he knew something was wrong immediately. The room was silent, when normally it would be filled with Toothless’s rumbly snores, or the groan of wood as he jumped around, ready for to go flying. There was an emptiness on the other side of the room where Toothless’s bed should be.</p>\n<p>Hiccup lurked out of bed and tripped over his feet. His <em>feet</em>.</p>\n<p>“Oh, no,” Hiccup said, staring down at his tiny hands, his old green tunic, his two whole legs. “Oh, <em>no</em>.”</p>\n<p>This wasn’t good. This was a long jog and a ten day boat ride away from good.</p>\n<p>Hiccup tumbled down the stairs, almost braining himself on the steps, landing in a twisted heap at the bottom. Walking with two legs was hard, especially when he was panicked and looking for his dragon. He wouldn’t find his dragon, he knew that, but his brain wouldn’t accept that Toothless wasn’t in Berk, playing with neighbouring dragons, waiting for Hiccup to come and get him.</p>\n<p>Stoick was pulling his boots on by the door. He looked up from his laces, something like hope in his eyes. It faded when he saw Hiccup’s twisted-up form at the foot of the stairs.</p>\n<p>“Morning, son,” he said briskly. “I’m going out to find the Third Seer. You should hurry to the Great Hall if you’re hungry; it’ll be filling up with vikings very soon.”</p>\n<p>There was not as much grey peppering Stoick’s beard. And there was something heavy about him. Hiccup knew how much his dad had changed after dragons had become a part of Berk, but he hadn’t realised how many of those changes were physical.</p>\n<p>Hiccup hadn’t realised how happy his Stoick was—or rather, he hadn’t really seen how <em>unhappy</em> Stoick had been in the past.</p>\n<p>This version of Stoick is serious. His face, his whole body, was weighed down with dread. A general watching enemy ships bob on the horizon, waiting for them to inevitably come to shore, knowing he couldn’t fight the invasion off.</p>\n<p>Hiccup picked himself up. He concentrated on making the five steps to the door without tripping, and then he crouched in front of Stoick. He was so small at this age. Even seated, Stoick was almost eye-level with him. But Hiccup wanted to be lower than Stoick, right now. He wanted to make sure he had eye-contact with his father. That he was listening.</p>\n<p>“Dad,” Hiccup said, “it’s going to be okay. Berk makes it. We all make it.”</p>\n<p>“Hiccup,” Stoick said. “Hiccup, wait.”</p>\n<p>Hiccup managed a smile, small and strained as it was. “It’s weird seeing you like this. You’re happier in my time.”</p>\n<p>Stoick pulled him into a tight hug. Hiccup laughed against Stoick’s ear, and then groaned when the arms tightened. He really was small growing up. Short with bird-bones, thin and hollow. Made to fly.</p>\n<p>“Dad. You’re kind of—choking me.”</p>\n<p>Stoick pulled away. His eyes roamed Hiccup’s face. For what, Hiccup wasn’t sure. Seers retained their present bodies, which was probably for the best. Hiccup wasn’t sure he wanted everyone to know he had lost his leg. Lost limbs weren’t special to vikings, but if Berk knew about his missing leg, then inevitably, Hiccup would know. Fourteen-year-old Hiccup wouldn’t take the news well.</p>\n<p>“I knew you could do it,” Stoick said, beaming. He looked more like the Stoick Hiccup knew, like this. “My son, the Third Seer.”</p>\n<p>“Who are the other seers?” His memory of the past was vague, slipping through his fingers when he tries to close in on certain details. The time-stream was in flux. Even though, to Hiccup, the past had already happened, in this moment, it remained uncertain.</p>\n<p>Being a seer was an honour, but it was also incredibly dangerous. One wrong move, and a seer could undo their self and their immediate past.</p>\n<p>“Snotlout and Astrid,” Stoick said, “though they refused to say anything without you there. Made quite a few people angry, but it’s within the bounds of tradition. But now that you’re here, we will finally have our predictions!”</p>\n<p>Hiccup’s relief that Ruffnut and Tuffnut weren’t seers evaporated. Predictions. Predictions about the future.</p>\n<p>How could Hiccup tell a village full of dragon-hating vikings about their especially dragon-filled future without starting a riot?</p>\n<p>Hiccup picked himself off the floor. “Right. I’m going to find Snotlout and Astrid, then. We need to have a, uh. seers meeting. We’ll meet everyone in the Great Hall at lunchtime.”</p>\n<p>Stoick didn’t say anything. Hiccup was busy hunting for his shoes—shoes, plural!—and almost missed the contemplative look that crossed Stoick’s face.</p>\n<p>“You’re different,” Stoick said.</p>\n<p>“Well, I am nineteen,” Hiccup said, hopping on one foot to pull on his boots. “I’m an adult now, dad.”</p>\n<p>“And …” Stoick licked his lips, hesitant. “Hiccup, are you well?”</p>\n<p>“I haven’t been carried off by any dragons, if that’s what you’re asking.” Technically, Hiccup had been snatched by wild dragons before, and every other day a Night Fury picked him up by the back of his shirt, the way a mother cat might carry a misbehaving kitten. But he had never been taken the way Stoick—<em>this</em> Stoick—might imagine.</p>\n<p>“What are you doing?” Stoick prompted. “Still working in Gobber’s shop?”</p>\n<p>“On and off,” Hiccup said, shrugging. Mostly off. It felt like every time he turned around, there was someone who wanted his help, and he was still busy mapping the Archipelago.</p>\n<p>“Are you … are you training to become—”</p>\n<p>“I need to go find the others!” Before Stoick could finish that sentence, Hiccup had his boots laced and the door open. “Bye, Dad, love you!</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>He found Astrid down by the Killing Ring, staring off into the distance with an unreadable expression.</p>\n<p>He wondered if Stormfly had been captured yet. Was Hookfang, Meatlug, Barf and Belch caged here, alone and afraid, not realising their future-companions were somewhere in the village?</p>\n<p>“Penny for your thoughts?” Hiccup asked.</p>\n<p>Astrid jumped. She whirled around, hand instinctively reaching up for where her axe would normally be, but she paused when she saw Hiccup. He cocked an eyebrow at her.</p>\n<p>She squinted at him. “Hiccup.”</p>\n<p>“Astrid,” he replied. “I’m surprised you’re out here. I would have thought Berk would be going crazy by now. It’s the third morning, isn’t it? And—oh gods, Snotlout was probably insufferable. He either made a big show of telling lies or he realised he couldn’t say anything and panicked—”</p>\n<p>Astrid swooped down and dragged him into a hug. She was taller than him, now, and so much stronger. Her enthusiasm lifted his feet clear off the ground.</p>\n<p>“It’s you!” She dropped him back down and he laughed, swaying into her. They were standing close together. Much closer than they ever dared at fourteen, at fifteen, at a very flustered sixteen. “You’re so scrawny. You know, I had forgotten how little you were.”</p>\n<p>“I’m still kind of scrawny at nineteen,” Hiccup said. “Weird being shorter than you, though.”</p>\n<p>Astrid grinned. She looked like she was enjoying their height difference just as much as she had the first time around. Both she and Snotlout were going to have a great time teasing him about it, even if they both knew that, when they returned to their nineteen year old bodies, he would be the tallest of them all once again.</p>\n<p>They found Snotlout tip-toeing out of his house. He jumped when he turned and saw them standing there with twin smirks.</p>\n<p>“Morning, Snotlout,” Hiccup said.</p>\n<p>“Hiccup?” Snotlout tripped in his haste to get to them. He clapped Hiccup around the shoulders, peering intently at his cousin. “It is you, isn’t it?”</p>\n<p>“Miss me?”</p>\n<p>“Yes,” Snotlout said without hesitating. “Mini-you was so weird. He didn’t want to talk to me or even be around me—it was like he thought the whole world was against him.”</p>\n<p>Hiccup stepped out of Snotlout’s arms, not meeting his eyes. “Well, it kind of felt like that when I was a kid. You weren’t exactly nice to me, remember?”</p>\n<p>Normally, whenever he brought up their past, Ruffnut and Tuffnut would snicker, and Fishlegs would ring his hands, and Snotlout would laugh briefly about how easy Hiccup had been to overpower them, before lamenting how annoying it was that Hiccup went and showed them all up. Out of all of them, it was only Astrid that wouldn’t flinch from his stare. Who would say without words,<em> I’m sorry,</em> and, <em>You deserved to be treated better than that</em>, with just the weight of her gaze.</p>\n<p>This time, though, all the energy went out of Snotlout. “Yeah. We were awful and you were just a dweeby little kid.”</p>\n<p>“Wow, thanks,” Hiccup said sarcastically.</p>\n<p>Snotlout fidgeted. He looked like he was gearing up to say something else, but Berk was waking up around them. They needed to be gone before they were ambushed.</p>\n<p>“Come on,” Hiccup said, “we need to talk. Somewhere away from here.”</p>\n<p>Hiccup headed towards the forrest, and Astrid and Snotlout fell into step behind him without questioning it, without thinking about it, because it was muscle memory to follow when Hiccup leads.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>They walked deep into the forest. Hiccup thought about taking them all the way to the Cove, but it felt wrong to go there before he had even met Toothless. The place should belong to them, first.</p>\n<p>They stopped in a shadowed grove. Hiccup collapsed onto a fallen tree trunk. He was used to a body hardened from wrestling dragons, fighting, running around Berk—not this pubescent toothpick that got winded after a brisk uphill jog.</p>\n<p>Astrid leaned against his trunk, her arm going over his shoulder to brace herself. Snotlout sat down on the other side of the clearing, facing them.</p>\n<p>“What are we going to tell everyone?” Snotlout said. “They’re desperate for predictions. Astrid and I had to hide from everyone to stop them from trying to get information out of us.”</p>\n<p>“What have you told them?” Hiccup asked.</p>\n<p>“Not much. Little stuff, like how I would win Thawfest Games this year, but nothing big. Nothing to settle them.”</p>\n<p>“We can’t tell them that we make peace with dragons,” Astrid said. “We saw how well that went the first time around. They didn’t come to terms with that until they saw all of us riding dragons. Until Hiccup took down the queen.”</p>\n<p>Snotlout lit up, but Hiccup cut him down, “No, Snotlout, we can’t show them where the nest is. And we definitely can’t show them that we can ride dragons. My dad saw me with Toothless—not even flying him, just touching him gently, trying to defend him, and I got disowned.”</p>\n<p>Snotlout’s face dropped. Astrid’s arm tightened around his shoulder. <em>They had forgotten that I was disowned,</em> Hiccup thinks. They had forgotten that, before they fought the queen, all of Berk had thrown Hiccup aside.</p>\n<p>Hiccup hadn’t forgotten. In the months following the queen’s death, Berk had warmed up to him, but it had been a slow process. There were still days and weeks were he felt as voiceless and small as he had always been. Where he had looked at Stoick and wondered that, if he hadn’t killed the queen, if Stoick would have ever taken him back.</p>\n<p>“Hiccup,” Snotlout began, hands knotted in his lap, “the way everyone here has been treating you …”</p>\n<p>“It’s not right,” Astrid said.</p>\n<p>Snotlout shook his head. The last time he looked at Hiccup like this, so open and hurt, was after Hiccup had told him about how his prosthetic really functioned on a day-to-day basis, and Snotlout realised that Hiccup had been hurting, consistently, daily, and none of them had known.</p>\n<p>“I knew we were kind of mean to you when you were younger,” Snotlout said, “but I always thought you just brushed it off, you know? Like it didn’t matter. I thought it was just—kids being kids. And then you had Toothless and everyone in Berk thought you were special, and you could do things no one else could, and you were Berk’s pride and joy …”</p>\n<p>They had forgotten about how things used to be, before Toothless. That was okay. Hiccup didn’t like thinking about it either.</p>\n<p>“I’m sorry,” Astrid said. “I’m sorry everyone treated you like that—that I did, too.”</p>\n<p>Hiccup smiled at her. “You weren’t so bad.”</p>\n<p>“I wasn’t exactly <em>nice</em>, and I never stopped anyone else from treating you bad, either. I should have realised. I should have done something.”</p>\n<p>“Astrid, it’s in the past,” Hiccup said, even though it was happening right then, where they are. Time was a complicated beast.</p>\n<p>Astrid took his hand and squeezed. All the breath went out of his lungs.</p>\n<p>Snotlout let them have a quiet moment together for a few minutes, and then he groaned and kicked his legs out. Leaves spun in the air around his boots.</p>\n<p>“Stop with the google-y eyes. Can we focus on what we’re going to say to the hoard of dragon-hating vikings out there?”</p>\n<p>Hiccup cleared his throat. “Right. I have some ideas about that, actually …”</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>The Hiccup that walked out of the forrest flanked by Astrid and Snotlout was a very different Hiccup than the one Stoick knew. It was strange, he thought. He had seen seers come and go. But the difference between the current self and the future self, trapped inside an adolescent body, had never been so obvious as it was with Hiccup.</p>\n<p>“Well, I’ll be damned,” Gobber said.</p>\n<p>Gobber could see the change in Hiccup, too—walking toward them with his shoulders squared and his balance suddenly corrected, like he had been taking lessons on staying upright. He was talking quietly to the two by his side. He ran a hand through his hair, messing it up, and said something wry out of the corner of his mouth. Astrid burst out laughing. Snotlout scowled and gently thumped Hiccup in the arm. Hiccup smirked back.</p>\n<p>With those long fingers running through his dark fringe, a dry smile and a graceful gait—Stoick could easily see little bits of Valka standing out in their son. It was the easy confidence. The unique brand of humour, the compassion, the way he walked like the rest of the world couldn’t touch him. It was Valka.</p>\n<p>Was he seeing things? Hiccup hadn’t changed physically. Maybe Stoick was overthinking this.</p>\n<p>Maybe Hiccup had always looked like this, like Valka recasted in the delicate bones of a boy. Maybe, these days, Stoick just hadn’t been looking very closely. He had been so busy …</p>\n<p>“He looks like you,” Gobber said.</p>\n<p>Stoick looked at him sharply. “What?”</p>\n<p>Gobber shrugged, watching as Hiccup smiled amicably and dealt with every person that came up to with questions and demands. He didn’t flounder when they asked for predictions, like Astrid and Snotlout had the day before. The First and Second Seers seemed different, too, now that Hiccup stood between them. Less skittish. More mature.</p>\n<p>“The confident way he walks,” Gobber said, “and the way he deals with his friends, with Berk—he reminds me of you as a lad, Stoick.”</p>\n<p>“No,” Stoick said. The sun turned Hiccup’s hair a deep auburn, a fire burning beneath the dark brown, but he still didn’t see himself.</p>\n<p>“Well, sure,” Gobber said, “it’s not an exact match. He’s about a third of the size you were at that age, and he’s a lot more introverted. He’s his own person. He’s—”</p>\n<p>“Hiccup,” Stoick finished. What they were seeing was a more concentrated version of his son. A man who had come through the other side of adolescence surer and happier than he had ever been before.</p>\n<p>When the kids met them, Gobber thumped Hiccup gently with the blunt side of his hook. “Look at you then, lad. Still working in my shop?”</p>\n<p>“When I can find the time,” Hiccup teased.</p>\n<p>“What’s got you so busy, then?”</p>\n<p>“Oh, you know,” Hiccup said. “This and that.”</p>\n<p>“We have our own place away from Berk,” Snotlout blurted. “We built huts and look-outs and we fight off any enemies that wonder too close. It’s so cool, even if Hiccup is kind of a nag sometimes.”</p>\n<p>“A nag?” Hiccup said, more tired than bothered by the insult.</p>\n<p>“Oh, yes, how dare he try and keep his people safe,” Astrid said. This was clearly an old argument. “If Ruff and Tuff were left to their own devices, the whole island would’ve burnt down by now.”</p>\n<p>“With us on it,” Hiccup agreed.</p>\n<p>“Wait,” Stoick said. “You kids don’t live on Berk?”</p>\n<p>They exchanged glances. Snotlout looked sheepish under Hiccup and Astrid’s glares. “I’ve been here by myself for like three days! I’ve wanted to say stuff for ages, but I waited until you guys both got here, didn’t I?”</p>\n<p>“We used to live elsewhere,” Hiccup said to Stoick. “We don’t spend as much time there anymore. It was good for us, I think. We were able to build some independence outside of Berk. But now we mostly treat it as an out-post, a stop over on longer journeys. We have duties on Berk.”</p>\n<p>“Duties,” Gobber echoed, a strange look on his face. “Duties like …”</p>\n<p>“Stoick!” Spitelout barrelled through the crowd of vikings hovering on the fringe in their periphery, watching their conversation with baited breath. “It’s been hours. What’s going on?”</p>\n<p>“Are you kids ready?” Stoick asked the seers.</p>\n<p>“Yeah,” Hiccup answered for them. “We’re ready.”</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Hiccup stood on the raised stone dais with all the ease of foundling chief. He had stood in this position dozens of time before, and this could be seen in this natural stance, the way he automatically projected his voice to be heard even at the very back of the Great Hall, and the way he spoke, unwavering and certain.</p>\n<p>“There are things we cannot tell you,” Hiccup said, standing in front of Astrid and Snotlout, flanked by his two friends, his advisors. “I know you want to hear everything about your immediate future, but as seers, we know that it’s not safe. Trust us. We want to preserve this future as best as we can.</p>\n<p>“We can tell you this: Berk is happy, and healthy, and flourishing in our future.” A surge of elated murmurs swept through the crowd. It was not the outcry Astrid was expecting at this announcement. But then, the way Hiccup looked right now, the energy he exuded—no one would want to interrupt his speech. “There are no more dragon raids. Our crops are doing well. Our sheep graze fearlessly. And we are pulling in more fish than ever—over double our usual amount.”</p>\n<p>Snotlout snorted on Hiccup’s other side. They knew the only reason Berk drew in so much fish was because they had to feed so many dragons.</p>\n<p>“I know you’re anxious to know how the dragon raids were stopped,” Hiccup went on, “but we can’t give exact details. We can say that it wasn’t easy. It took a great deal of courage and fortitude from everyone. And the months that followed the end of the raids were ones of great challenge and change, but change for the better.</p>\n<p>“Keep your hearts and minds open. Don’t stay routed in old traditions. Adapt to a new and brighter future when one is presented to you. And have faith in the new generation. We promise to look after Berk. We promise we’ll make you all proud.”</p>\n<p>Hiccup stepped back into line with Snotlout and Astrid, and only then does the cheer that Astrid was expecting rip through Berk. It shakes the tables with its volume.</p>\n<p>Hiccup gave a vague speech, but a rousing one. This was the news Berk desperately wanted to hear. They wanted details, concrete answers, of course, but beyond that, all they wanted to hear was that they were going to be okay.</p>\n<p>And Hiccup had given that to them.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>After they answered as many questions as they safely could, they ducked out of the Great Hall.</p>\n<p>Spitelout caught them on the way out and roped Snotlout into a training session. Hiccup suggested one-on-one sparring with tradition swords and axes, rather than anything involving dragons. When Spitelout agreed, Snotlout shot Hiccup a thankful look. They had been training together for years, and had all built up their proficiency with weapons.</p>\n<p>Otherwise, Spitelout might have taken him down to the Killing Ring to practise with real dragons. And Snotlout could have come face-to-face with Hookfang—a captured, feral Hookfang that didn’t recognise him.</p>\n<p>Astrid and Hiccup hid themselves away in his room, going through his old journals. Hiccup was embarrassed by the old sketches. Horrified by the dragon-killing devices. Mortified by the detailed portraits of Astrid’s high cheeks and blue eyes, her long hair lit by the sun, her strong lunge with an axe.</p>\n<p>“Ah, babe,” she said, flipping through picture after picture of a young Astrid in a journal Hiccup had found hidden under his bed, “you had a crush on me? That’s so embarrassing.”</p>\n<p>“Astrid, we’re dating.”</p>\n<p>She smirked. “Still.”</p>\n<p>They talked, briefly, about the other sketches of their young friends. Hiccup couldn’t understand how he had ever drawn them like that, angry and dangerous, all the little details muddled. Astrid had seen the distress in Hiccup’s face, and had changed the subject.</p>\n<p>They leaned together at the foot of the bed and talked about the rest of Berk—how strange it is to see Berk dragon-less and so beaten down after years of worsening dragon raids, how strange everyone looked.</p>\n<p>Astrid laced their fingers together as they talked. There was a moment where they both looked up at the same time and their eyes caught, and they leaned in instinctively, before jerking away.</p>\n<p>“This is <em>so weird,”</em> Hiccup said.</p>\n<p>“We’re babies,” Astrid said, horrified. “We can’t make out when we look like babies.”</p>\n<p>“Agreed,” Hiccup said, and got up to see if he could find anymore of his old journals.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>When Stoick went looking for Astrid and Hiccup, he wasn’t expecting to find them sat together at the foot of the bed, almost cuddled into each other’s sides, going over Hiccup’s sketches and notes. They didn’t jerk away, when the door opened. It seemed like they didn’t think they ere doing anything odd, didn’t find anything about the way they are half on top of each other strange.</p>\n<p>They blinked up at him, slow and easy, like cats bathing in a patch of sunlight.</p>\n<p>Stoick cleared his throat. “I was just checking to see if you two were alright.”</p>\n<p>“We’re okay,” Hiccup said. “Although, while you’re there, I have some thoughts about an irrigation system and the paddocks where Berk keeps its cattle at night—”</p>\n<p>Hiccup untangled himself from Astrid and led Stoick to his desk. Hiccup had tried to show him invention designs before, but they were always so strange, dangerous and far-flung, often outside of Stoick’s understanding, and he hadn’t listened often. He was a busy man. And Hiccup’s inventions had no place on Berk.</p>\n<p>Except, now Hiccup was drawing up ideas with practised ease, and they seemed—effortlessly useful. Almost genius in their simplicity.</p>\n<p>Hiccup explained everything expertly. Even his characteristic fits-and-starts flowed together. Stoick could almost see Hiccup’s train of thought, snaking and branching as problems were considered, discarded, solutions brought quickly into being.</p>\n<p>Astrid leant on the other side of the desk. She did not interject, just watched the charcoal move in Hiccup’s spindly fingers. She nodded periodically as Hiccup talked.</p>\n<p>They had done this before, Stoick thought. Everything from the way they curled sat together on the floor, to the way Hiccup expressed ideas that would change the way Berk lived, to the way Astrid placed herself at Hiccup’s side, silently supportive—this was all a practised routine, thoughtless in its familiarity.</p>\n<p>Who had these kids become in the past five years?</p>\n<p>Hiccup paused. “Dad? Are you listening?”</p>\n<p>Stoick laid a hand on Hiccup’s shoulders, his broad palm dwarfing his small son. “I’m listening. Go on.”</p>\n<p><em>I’m proud of you,</em> Stoick almost said, but stopped himself.</p>\n<p>Stoick hadn’t expressed that sentiment to Hiccup in a long time. What had changed that he felt he could easily say that to his more confident Hiccup, from which a leader clearly shone through, but had trouble saying it to his unsure fourteen year old?</p>\n<p>It was a question he couldn’t bring himself to ask.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>That night, at the final feast, Hiccup took his seat at the head table without having to be prompted. But he cast anxious glances down the table, past Astrid and Snotlout, at where they normally sat. Their table wasn’t there. And the rest of the people that filled it were far off, on the other side of the Great Hall.</p>\n<p>After Stoick gave a speech to Berk, and they cheered their seers once more, Astrid stood up.</p>\n<p>“Again?” Stoick asked, more amused than angry.</p>\n<p>“Yes, sir,” she said, turning on her heel. Snotlout hurried to follow.</p>\n<p>“See you later, dad,” Hiccup said, and then, to the larger group, “And I’ll see everyone else in five years time.”</p>\n<p>Hiccup followed after Astrid with both of their plates. He found Snotlout and Astrid beside Fishlegs, on the other side of the twins. Hiccup eyed the space beside Tuffnut, and decided to sit at the head of the table, his legs bumping with Astrid’s.</p>\n<p>“I hate sitting with all those old people,” Snotlout said, prodding his stew with his fork. Astrid jabbed him with the blunt end of her knife. He batted her away. “What? You didn’t have to sit next to my dad. Or spend half the day with him. Gods.”</p>\n<p>Their young friends were silent. They were staring at them like they thought the seers were going to explode; Ruffnut and Tuffnut looked at them with rapturous anticipation, eager for the chaos, unlike Fishlegs, who leant away from them, tightly clutching his plate.</p>\n<p>“Tough crowd,” Snotlout mumbled under his breath.</p>\n<p>Ruffnut broke the sudden silence. She braced her elbows on the tables and asked loudly, “So why <em>are</em> you over here?”</p>\n<p>“We’re here because you’re our friends,” Hiccup said.</p>\n<p>Ruffnut squinted at him. “Friends?”</p>\n<p>Hiccup shrugged. “We all got really close these past few years. We’ve done a lot of amazing things together. And now you’re all my—well. You’re my best friends.”</p>\n<p>“Huh,” Ruffnut says. “Okay.” And then she went back to her food.</p>\n<p>“Wait. Amazing things?” Tuffnut wasn’t so easily placated. “What kind of amazing things? Do we kill dragons together? Am I a fearsome dragon-slaying warrior?”</p>\n<p>Snotlout watched Tuffnut stand in his seat and begin to flex and preen, and then he turned to Astrid and hiccup with horror. “Did I used to be …?”</p>\n<p>“Yes,” Astrid said. “Just like that.”</p>\n<p>“Worse, even,” Hiccup said. Snotlout groaned and hid his face in his hands.</p>\n<p>“Are you sure?” Fishlegs asked hesitantly. When they turned to look at him, he gulped and shrunk in on himself at the attention. “I mean—you said we became close after we ‘did amazing things’ but what if we mess that up or aren’t that amazing? Will that change the future?”</p>\n<p>“Fish,” Hiccup said, voice going soft, his hand reaching out to rest on top of Fishleg’s, “you guys are my best friends, not because of your fighting abilities, but because we’ve rescued each other over and over together. Because we make an amazing time. Because I know you’ll always have my back, whether that’s out there, against people who want to hurt us, or at Berk, dealing with domestic issues, or just … when we’re spending time together like this.”</p>\n<p>Fishleg’s eyes shimmered. He stared at Hiccup like he could see that future, see the years expanding out in front of him, and could hardly breathe for how beautiful it was.</p>\n<p>“Gross,” Ruffnut said, shattering the moment. “Tell us more about dragons. Do we see any really scary ones?”</p>\n<p>Astrid and Hiccup tried to describe a few of the larger dragons they had encountered, without revealing that they were usually trying to <em>help</em> the dragon, rather than fight it.</p>\n<p>Fishlegs still looked dazed. He caught Snotlout watching him with amusement, and asked, “It’s not just a phase we’re going through, is it? Like a temporary alliance or something?”</p>\n<p>Snotlout snorted. He adopted a smug grin, the closest he had come to bragging after becoming the First Seer. “Temporary? Nah. This, right here, is going to last long into the future.”</p>\n<p>Snotlout jerked his thumb over his shoulder, pointing at the head table where Stoick and his closest advisors were seated. Where the next Chief of Berk and his generation of advisors would sit one day.</p>\n<p>Fishleg gaped. “B-But then—so Hiccup really does become—”</p>\n<p>“One day, when he finally gets his head out of the clouds,” Snotlout said, though he made a face, part-exasperated, part-fond at the idea of his cousin circling ceaselessly around the inevitably of becoming chief.</p>\n<p>“I have no idea what you’re talking about,” Hiccup said primly.</p>\n<p>Astrid’s smile turned teasing. “So Stoick hasn’t been dragging you around Berk to give you lessons on how to run the place? And he hasn’t been hinting at how nice retirement sounds?”</p>\n<p>Hiccup stared at his bowl, as though he would find answers in the vegetables floating in his soap. At his prolonged and pained silence, Astrid and Snotlout started sniggering.</p>\n<p>Tuffnut, distracted, turned to talk to his sister and knocked his broth into Hiccup’s lap. He yelped at the heat, and Astrid half-rose out of her seat. Tuffnut shied away. He had little experience with a protective Astrid, but his instincts told him to get away.</p>\n<p>Hiccup pulled her back into her seat. “It’s okay. He didn’t mean it.”</p>\n<p>He stripped off his vest and tried to drain some of the broth from his trousers. Snotlout laughed at the sight. Astrid responded by catapulting a pea at him. It splattered messily against his cheek.</p>\n<p>The twins decided that this was a great idea, and joined in, launching food at Snotlout. When the food fight escalated, Fishlegs and Hiccup crawled under the table for cover.</p>\n<p>“This isn’t fair,” Hiccup griped, ringing gravy from his hair. “I’m a foot shorter than I should be and half as strong. And if I had Toothless to partner up with, I would’ve won this fight easily.”</p>\n<p>Fishlegs pulled chicken skin off his cheek. “Who’s Toothless?”</p>\n<p>Hiccup huffed. “You’ll find out eventually.”</p>\n<p>Astrid leapt over the table gracefully. Snotlout dived after her and sent cutlery toppling over the sides of the table. Fishlegs and Hiccup shuffled closer to one another to avoid the debris.</p>\n<p>“Are you sure they’re adults?” Fishlegs asked.</p>\n<p>“I’m sure,” Hiccup said, still put out at not being able to destroy his friends at a food fight. “Though you can’t always tell from the way we act.”</p>\n<p>They could see Stoick eying their group from the head table. The Great Hall was always rowdy, with fights and dances breaking out during every other meal. But the chief would put a stop to the fight if it got too out of hand.</p>\n<p>“Hey, Hiccup?” Fishlegs said in a small voice.</p>\n<p>“Yeah?”</p>\n<p>“I’m really looking forward to being someone’s best friend.”</p>\n<p>Hiccu looked away from the tangle of legs that was the twins and Snotlout. Fishlegs had his knees pulled to his chest, hugging himself.</p>\n<p>He was fourteen years old, Hiccup remembered. Just a kid.</p>\n<p>Hiccup put an arm around the young version of his friend, though the size difference between them at this age was laughable, and squeezed.</p>\n<p>“I know you might feel lonely now,” Hiccup began, “and I know the future might seem scary, but it’s going to be okay. It’s going to be <em>great</em>. Not right away—everything will go back to how it was for a while, but eventually …”</p>\n<p>In that moment, Hiccup wished the seers worked in reverse, and this Fishlegs was sitting next to nineteen year old Hiccup in his grown body, staring out at the dragons nestled between their riders. So Fishlegs could see Berk in all its glory. So he could see the fathomless love in Meatlug’s eyes when she looked at him.</p>\n<p>“Eventually,” Hiccup forged on, “there will come a time where I need you all to trust me, even if it seems insane. I need you guys to believe in me on the day that no one else does. Can you do that?”</p>\n<p>Fishlegs nodded, resolute, some of his adult self shining through. “Okay. I can do that.”</p>\n<p>No one else heard this prediction, the final one the seers of their generation would give, lost under the raucous celebrations of the evening. Everyone was too busy laughing at the speculate their friends made, Snotlout and Astrid trying valiantly to dodge the twins attacks, proving that nineteen years old wasn’t that old at all.</p>\n<p>Berk would have to go back to weeks of constant raids tomorrow, but tonight, they could appreciate the hope the seers brought them. They could drink freely knowing that one day, years into the future, they would finally be happy and free.</p>\n<p> </p>"
}