{
  "id": "18905302",
  "url": "https://archiveofourown.org/works/18905302?view_full_work=true",
  "author": [
    "aayaptre"
  ],
  "title": "and the universe shifts (ATUS)",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "Hermitcraft",
    "Minecraft (Video Game)"
  ],
  "relationships": [],
  "characters": [
    "Grian",
    "Mumbo Jumbo",
    "Iskall",
    "Scar - Character",
    "Joe Hills",
    "Cubfan",
    "Stress - Character",
    "False - Character",
    "Cleo",
    "Xisuma",
    "Basically Every Hermit",
    "Doc"
  ],
  "additional_tags": [
    "Evo AU",
    "Angst",
    "Minor Violence",
    "Grian has a bad time The Fanfic",
    "Hurt/Comfort"
  ],
  "language": "English",
  "series": "Part 1 of ATUS Works",
  "published": "2019-05-21",
  "completed": "2019-07-21",
  "words": "37,691",
  "chapters": "18/18",
  "comments": "968",
  "kudos": "9,029",
  "bookmarks": "1,134",
  "hits": "175,384",
  "summary": "<p>\"They were playing a game, they called it a game, it was one he couldn’t win. He played anyway.\"</p>\n<p>-----</p>\n<p>Grian's been running for a long time, and knowing him, he's going to be caught eventually.</p>",
  "notes": "<p>(Hermitcraft Evo AU! you don't need to have watched Grian's Evolution Series to understand it, however you might get more out of in the long run :3c)</p>\n<p>You can also find me on tumblr as ayapcraft! come yell at me about hermitcraft blease</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">notes</a>.)\n</p>\n<p>AAAAAA CHAPTER ONE!! this will most probably be pretty long over all so i hope yall are ready for that ghdfghdsg, hope you enjoyed it!!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>Chapter two! things are starting to speed up now, also writing hermit interactions are fun! hope i got them to sound right lmao.</p>\n<p>Hope you enjoyed!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">notes</a>.)\n</p>\n<p>ooo we gettin there gamers</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">notes</a>.)\n</p>\n<p>i gotta. stop updating at 1am oops lol</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">notes</a>.)\n</p>\n<p>sorry this chapters a bit shorter! the next one should make up for the length sdfgfhfg<br>hope you enjoyed! :D</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_8_endnotes\">notes</a>.)\n</p>\n<p>HEY I'M BACK!! ive still got a couple assessments to do but i should be more free now so &gt;:3c ALSO this chapter was meant to have more in it but it got long so im splitting it into two! hope you enjoyed! :D</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_10_endnotes\">notes</a>.)\n</p>\n<p>whats this??? a chapter with no angst in it???? incredible.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_11_endnotes\">notes</a>.)\n</p>\n<p>welp. the fluff couldn't last forever.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_13_endnotes\">notes</a>.)\n</p>\n<p>its been a week but im back babeyyyy</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_14_endnotes\">notes</a>.)\n</p>\n<p>@ the people that guessed joe would still have magic, i see u and good job dsgfasdfsdfg</p>\n<p>TW in the bottom notes for something in this chapter!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_15_endnotes\">more notes</a>.)\n</p>\n<p>TW: a non-discriptive death of an animal, if you'd like to skip the scene stop reading at \"Grian smiled slightly, ruffling his own wings back at it.\" and begin reading again at \"For a moment all Grian could hear was his own shuddering breaths\"</p>\n<p>TW for some minor violence in this chapter</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_16_endnotes\">more notes</a>.)\n</p>\n<p>oh boy</p>\n<p>TW in the end notes</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_17_endnotes\">more notes</a>.)\n</p>\n<p>TW: violence and references to blood and death</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_18_endnotes\">notes</a>.)\n</p>\n<p>welp! we're at the end folks! it's been an incredible couple weeks writing this and I almost can't believe it's over. I want to thank all of you so much for making the past month so amazing, I never could've guessed that my self-indulgent fic would ever get this popular, but here we are!! lmao</p>\n<p>but for real, thank you guys so much, for all the comments, and the fanart, and animations, and just. everything, you all have my heart and I love u forever &lt;3</p>\n<p>the au doesn't end here tho!! I'm going to make some one-shots about and so on so if ur interested in that hang around maybe sdgffasdfsdfgsd</p>\n<p>my hc tumblr is @ayapcraft! go yell at me over there gamers</p>",
  "text": "<p>\n<em>He ran through the hallways, barely breathing as he tried to make as little noise as possible. </em>\n</p>\n<p>\n<em>He came to a corner and peered around it, his back to the wall. Everything was quiet, the kind of quite that made your ears hurt.</em>\n</p>\n<p><em>They were playing a game, they </em>called<em> it a game, it was one he couldn’t win. He played anyway.</em></p>\n<p>\n<em>Taking a deep breath, he sprinted around the corner, running on unsteady feet. His eyes darted around towards possible escapes or advantage points he could lie to himself about using later. Later in the game, the game he wouldn’t win.</em>\n</p>\n<p><em>He came to the end of another seemingly never-ending hallway only to find a dead end. He turned around to look back the way he came, he had paused for too long and needed to go go </em>go <strong>now</strong>—</p>\n<p>\n<em>Claw like hands gripped at the base of his neck and his breath left him in a second.</em>\n</p>\n<p>\n<em> <strong>\"Found you.\"</strong> </em>\n</p>\n<p> </p>\n<p> </p>\n<p>Grian fell out of his bed with a shuddering gasp, his body trembling as he tried to regain his foggy mind and unsteady breaths. He blinked sporadically, darting his eyes around the room by habit, looking for a danger that wouldn’t be there, it <em>couldn’t</em> be there. Finally calming down enough to move a little, he sat up against the side of his bed, the cooling glow of his base grounding him as he listened to the ocean just outside his doorstep.</p>\n<p>\n<em>‘That was… Weird.’ </em>\n</p>\n<p>Grian put a hand to his face, rubbing at his eyes as he thought about what he’d just woke up from. He had a dream about the Watchers. When he had first escaped them, he wouldn’t have batted an eye at this sort of thing, but it had been months now, he was starting to go days without even thinking about them let alone having them in his dreams. Knowing how the Universe seemed to have fun messing with him he supposed this wasn’t too much of a surprise. ‘<em>Plus,’ </em>he rationalized, ‘<em>it was just a dream, they can’t get to me here.’</em> Grian laid back down, feeling the cold concrete beneath his head as he tried to relax. Closing his eyes, he felt the pull of the Universe faintly around him, connecting everything to each other. Every player could feel it, even if only slightly, and it tended to make Grian smile on normal occasions, the idea that everything had a purpose and place in the world regardless of what it was.</p>\n<p>This time however the Universe felt… disjointed. Not in a bad way, almost if it was preparing something, something big. Grian felt his stomach drop out from under him as he realized what this was.</p>\n<p>This was an Update.</p>\n<p>Occasionally, when the Watchers would get bored with their games and tricks, they would plead with the Universe for a change. The Universe would oblige, but in return, they were tasked with guiding players into their new worlds. They would guide them however they wanted to and would often make it difficult, but it was the only way for players to access the updates.</p>\n<p>Grian stared at his ceiling as his mind raced. The Watchers didn’t know about Hermitcraft, Grian had made sure of that, but that also meant that the Hermits didn’t know about the Watchers. Which now left the question,</p>\n<p>\n<em>How were the Hermits going to get to the Update?</em>\n</p>\n<p> </p>\n<p> </p>\n<p>By the morning the rest of the Hermits had felt the same disjointedness, coming to the same conclusion Grian had, that the universe was preparing for a change. Life, for the most part, stayed the same, construction on the Hermits various projects continued, but no one could deny the buzz in the air. An update was an exciting thing, new items and blocks and <em>mobs</em>, it wasn’t much of a surprise that it was a hot topic. Grian tired to keep up with the excitement of it all but found himself falling short, preoccupied with concern over how everything would play out. His natural optimism was calling for him to just relax and assume everything would turn out fine, but when it came to the Watchers he knew better to indulge in that way of thinking.</p>\n<p>A week passed, and the Universe finally fell back into place. Unable to contain themselves, the Hermits ventured out to explore the new chunks of their world. However, what they found instead was a wall.</p>\n<p>A simple transparent wall reaching far below bedrock up past the height limit, trapping them in. They could <em>see </em>the world beyond it, taunting them. At first, they all tried different ways to get past it, Mumbo using a possibly unnecessary amount of Redstone to try and push sections out of the way, while Impulse reworked his Ghast canon to aim it directly at the thing. Despite their efforts, nothing worked, and eventually, the Hermits dispersed back to their bases with nothing but a few more holes in the ground to show for it.</p>\n<p>Grian honestly felt a little bad about not telling the others that he knew how to take the barrier down. He had seen them many times before, they were normally the result of not finding the Update portals in time. Watchers would often leave the barriers up to entertain themselves, laughing at how the players would scramble around trying to destroy it or find the portal the Watchers had left them, Grian never understood what was so amusing about it.</p>\n<p>Grian flew throughout the shopping district lazily, haphazardly following his elytra course as he thought about what to do. He needed to find a way to break down the wall himself with whatever power he had left <em>without</em> drawing attention to himself. His first thought was to try and tear it down late at night when he was alone but decided against it. His lack of practice meant that the spell he’d need to use would end up taking hours to cast and he couldn’t risk being caught. Grian spent the next few days in his base thinking, and it ultimately took flying over Mumbo’s base to finally think of something that might actually work. It would take a little preparation, but it was the best he had, and the other Hermits were starting to get restless.</p>\n<p>Later that night Grian flew out of his base towards Iskall’s home. He knew Iskall would be working on Sahara that night, so it was the perfect place to conduct the first part of his idea, but he’d still need to work quickly. Landing on the icy terrain he swiftly scoped out an area to start building on and set to work. Falling back into the routine of creating a building like this was concerningly easy, at points, Grian found himself subconsciously reaching for blocks he didn’t even have access to. Shaking himself out of his haze he worked faster. Finishing the building itself he made his way inside, placing a few signs before stepping out of the building to look it over. It was a simple tower, made of obsidian and sandstone that clashed harshly with the ice and water surrounding it. It wasn’t too tall, and nothing compared to the ones he had had to make in the past, but it would serve its purpose. Grian took off back to his base, hoping that this would work the way he needed it to.</p>\n<p>To Grian’s relief, Iskall had called several other hermits to his base once he discovered the tower. Once he arrived he feigned innocents, trailing behind his friends as they all went inside. The inside of the tower was empty apart from two signs, having a date and coordinates written on them. It was easy enough to find the coordinates, leading the Hermits to the edge of the barrier several thousand blocks out. At first, they had tried to figure out who had built the tower, but after no one fessed up the group simply resorted to helping Iskall take down the tower and to wait for the day to arrive.</p>\n<p>With the date rapidly approaching, the hermits organised what they would do when the time came, deciding that the simplest option was for all of them to meet up at the border and just… see what happens. Xisuma created a portal for easier access to the location, however, Grian said he’d be making his own way there, the others rolled their eyes at the idea, but they didn’t question it.</p>\n<p>Now that most of the pieces had fallen into place, all Grian had left to do was wait. which proved to be easy than he thought, the days passing by him as he built his flying machine and prepared for the journey ahead. He still couldn’t help but feel nervous, he hadn’t had to use this kind of magic in months, and there was still the possibility of it not even working in the first place. However, Grian refused to let those thoughts get to him, it was too late to back out now, and this might be his only chance to break the barrier himself.</p>\n<p> </p>\n<p> </p>\n<p>The day had finally come.</p>\n<p>Grian saw the other hermits off as they entered the Nether portal, waving them goodbye before he made his way back to his own mode of transport. He got into the flying machine and just sat there for a moment, preparing himself up for the long journey ahead of him. He’d need to use the next few hours to concentrate on the spell and make sure he had enough magic to cast it, so with one final wave to his base, he flicked the machine on and closed his eyes.</p>\n<p>When Grian heard the other hermits’ voices from below him, it caught him off guard, he snapped his eyes open to see the barrier in front of him approaching slowly. The last few hours had definitely helped, the air felt almost electric, he could feel more magic surrounding him now than he had in months,</p>\n<p>But he had no idea if it was going to be enough.</p>\n<p>Panic squeezed suddenly at his heart, he attempted to not let it show on his face as he watched some of his friends fly around him. He could hear himself say something about ramming into the barrier. He thinks it was meant to be a joke.</p>\n<p>He shoved his shaking hands into the sleeves of his jumper and clenched his eyes shut, he reached out almost desperately for something, <em>anything</em>. Feeling magic swell around him he opened his eyes to see the barrier only a few blocks ahead now.</p>\n<p>In one more frantic grasp for help, he pulled against the universe with wild abandoned and yanked at anything it had to offer him<em>, </em>digging his fingernails into the palms of his hands he braced for impact. He had no idea why he thought this would work <em>why did he try to—</em></p>\n<p>Grian felt something… <em>snap</em>,</p>\n<p>A rush of magic crashed into him, almost knocking him forward. He felt the hairs on his arms stand up as he tried to control this power he didn’t even realise still existed, and for horrifying a moment he was reminded of what it was like to be a Watcher. Gritting his teeth, he focused towards the barrier in front of him, finally releasing the energy towards it, feeling it spread and crackle across its surface before it finally fell.</p>\n<p>Grian could faintly hear the other Hermits cheering around and below him, glancing up as they flew off ahead into the new world. He took a moment to sit back and catch his breath, suddenly finding himself incredibly tired. Curiously, he reached out again to see if he could feel the magic that had been coursing through him seconds ago, but there was nothing, whatever magic he had left had been used to destroy the barrier, and even then, it barley scarped by. At that moment though Grian found that he didn’t really care, the wall had come down and his friends were already ages ahead of him. Shaking off his drowsiness with a small grin, he turned the flying machine off and took off after them.</p>\n<p> </p>\n<p> </p>\n<p>\n<em>Someone ran down a hallway. </em>\n</p>\n<p>\n<em>Crashing into a door and forcing it open, they looked up at the person inside, who frowned at the intrusion.</em>\n</p>\n<p>\n<em>“What are you doing here? I thought I told you I wasn’t to be disturbed—”</em>\n</p>\n<p>\n<strong>“We found him.”</strong>\n</p>\n<p>\n<em>Silence rang throughout the room as the two figures looked at each other for a moment.</em>\n</p>\n<p>\n<em>“Are you sure?”</em>\n</p>\n<p>\n<em>“Absolutely, no random player would be able to harness enough magic to take down a barrier all by themselves.”</em>\n</p>\n<p>\n<em>“Where was he hiding?”</em>\n</p>\n<p>\n<em>“That’s the thing, it’s a completely random world. Nothing special about it. He had it blocked from our vision this whole time with some sort of shield, but somethings finally broken it.”</em>\n</p>\n<p>\n<em>The creature grinned, their smile too large and teeth too sharp,</em>\n</p>\n<p><em>“Well, I guess we’ll just have to go see what we’ve been missing out on, won't we?”  </em> <strong> </strong></p>\n<p>The update was messy, to say the least.</p>\n<p> </p>\n<p>At first, everything seemed fine, after a few minutes of looking the hermits were able to find a nice little village to set themselves up in and villages to room with, laughing at how ridiculous they looked with player heads on. Grian could feel himself relaxing, watching the commotion around him as the others built their houses and talked amongst themselves. Maybe everything <em>was</em> going to turn out fine, if anything he was proud of himself for being able to give this to his friends, even if they didn’t know he was the one to take down the barrier.</p>\n<p>Then the lighting started… glitching.</p>\n<p>The hermits that hadn’t migrated to the village noticed it first, placed torches and glowstone no longer giving off any light despite being lit, it could be fixed by placing a new light source but eventually, those ones would die out too. Anyone looking at it for too long would get a headache trying to work it out. The new pillagers were also an issue, spawning at an almost uncontrollable rate. It was like every time a raid finished a new one would start on the opposite side of town, making Hermitville feel more like a war zone than a home away from home.</p>\n<p>Grian watched as Doc and False finished off the last few invaders from the top of his house, cheering as False struck the final blow and ended the raid. He jumped down as they walked over, both clearly worn out from the fight.</p>\n<p>“You could have come and helped us out you know.” Doc huffed, dropping onto the steps of Grian’s house.</p>\n<p>Grian laughed, handing him some pork, “I don’t know man, I wouldn’t want to show you up with my amazing fighting skills. Plus, I threw a trident at some point.”</p>\n<p>“Oh, you mean one you hit me with?”</p>\n<p>“Yeah! That one!”</p>\n<p>False sighed, rolling her aching shoulder as she unequipped her sword, “I don’t get why they’re showing up so often, it doesn’t feel right. I’m normally down for a good fight now and then, but this is ridiculous.”</p>\n<p>Grian nodded in agreement, handing her some water that she gulped down quickly. The trio sat in silence for a moment, enjoying the quiet around them. The peace didn’t last long though, the sound of fighting suddenly breaking through the air from the other side of the village. False groaned loudly as she took her sword back out and gave Grian the now empty water container,</p>\n<p>“You’ve got to be kidding me! Are these raids ever going to end?” She started sprinting down the path towards the sound of battle, Doc following quickly behind her. Grian called out after them,</p>\n<p>“Do you want help?”</p>\n<p>“Nah, don’t worry about it, dude! We’ve got this!” Doc shouted back, turning the corner and leaving Grian alone on the now-empty Sahara street.</p>\n<p>Grian quickly took the sky, not wanting to get caught in the middle of the fight. Watching the world speed past around him, his thoughts couldn’t help but drift to how weird everything had been the last few days. Nothing like this had ever happened before, nothing on this scale at least. The Universe was still trying to reconnect itself after such a massive change, so it wasn’t a surprise that a few things still didn’t work quite well yet, but this was on a completely different level. Hermitcraft didn’t just feel disconnected from the update, it felt <em>detached. </em>Grian grimaced, shaking the thought out of his head, he’d just have to trust that the Universe would put itself back together eventually.</p>\n<p> </p>\n<p>He’d only landed in his base for a few seconds before he heard his communicator go off. Pulling it up he looked at the message,</p>\n<p><strong>GoodTimesWithScar:</strong> <em>Hey Sherlock, come solve a case for me?</em></p>\n<p>Grian grinned, quickly grabbing his detective gear before flying out of his base again towards the shopping district. Landing in front of 221G he saw Scar leaning against the front of the building, smiling up at him from beneath his hat. Grian cleared his throat, popping up the collar of his coat as he addressed his friend in his attempt at a professional tone,</p>\n<p>“I knew you were going to message me.”</p>\n<p>“Oh, I’d expect no less from the incredible Sherlock Grian.” Scar chuckled, leaning away from the wall to walk towards the ‘detective’.</p>\n<p>Grian, trying to keep up his professional character and failing, gestured towards the door, “How about we talk inside my office?”</p>\n<p>Once the two men were inside Grian sat behind his desk, leaning back into his chair as he peered at Scar.</p>\n<p>“So, Mr Goodtime, what’ve you got for me?”</p>\n<p>“Well,” Scar began, “It started when I was scoping out areas to try out the new crossbows I had made, I’m thinking about making some kind of store so I wanted to see what I could do with them-”</p>\n<p>“Right yes, Concorp’s going to start selling weapons, hurry it up, I’m very busy.” Grian interrupted, rolling his eyes.</p>\n<p>Scar let out a laugh, “Oh I’m sure you are. Anyway, to make a long story short, I found something I think might interest you.”</p>\n<p>Grian cocked his head, leaning forward to rest his arms on the desk in front of him, “And what might that be?”</p>\n<p>Scar tilted back, gesturing his head towards the window. “Come with me and I’ll show you.”</p>\n<p>“Ahh, keeping it a mystery, are you? Well, consider me intrigued. Lead the way!” Grian stood from behind the desk, flinging the back of his coat dramatically as he did so. Scar turned towards the back of the room before hesitating for a moment.</p>\n<p>“How do you… how do you actually get out of here?”</p>\n<p> </p>\n<p>One broken window later, the duo stood out the front of a cave entrance. Venturing forward, Scar lead them both down a series of tunnels, placing and breaking torches as they went in an attempt to fix the lighting somewhat. After a few minutes of this, they reached a large opening, the ceiling stretching far above them, chests and shulker boxes dotting the area randomly.</p>\n<p>“Scar if all you’ve brought me to see is a cave, I’m going to charge you extra.”</p>\n<p>Scar huffed, “No- it’s just in the next room, trust me, this is worth your time.”</p>\n<p>Scar continued to the other side of the cave, Grian following close behind. The next room was dark, despite the torches, which was nothing new at this point.</p>\n<p>“Give me a sec, I’ll light this place back up.” Scar walked ahead into the dark, leaving Grian at the entrance. Squinting his eyes, he tried to look into the room, barely able to see his own hands in front of him. Scar placed a torch down, and Grian could finally see what was on the other side of the room.</p>\n<p> </p>\n<p>His heart stopped.</p>\n<p> </p>\n<p>“Weird right? At first, I thought it was just someone’s broken Nether portal but the fact that there’s bedrock everywhere makes me think it’s not that simple.”</p>\n<p> </p>\n<p>Grian couldn’t breathe. He couldn’t take his eyes off the symbol in front of him, it was like something had blacked out everything else in the room, in <em>existence,</em> and all that was left was him and <em>the Watchers portal sitting right in front of him</em> <em>how was it <strong>there—</strong></em></p>\n<p>“Grian?” He flinched away from the sudden hand on his shoulder, Scar’s concern cutting through his panic, “You alright?”</p>\n<p>“I’m- no, yeah no I’m fine, sorry, uh-” Grian stuttered, shaking his head, calming himself down the best he could. “Sorry, the… the bedrock kind of caught me off guard, I guess.”</p>\n<p>Grian grimaced slightly at the awful excuse. Scar seemed to accept it however, walking back over to the portal (Grian couldn’t help but feel uneasy as he did so, despite the fact that the portal was obviously inactive).</p>\n<p>Oblivious to Grian’s tension, Scar looked around the area, pointing at the bedrock on the walls and floor.</p>\n<p>“Once I found this place I didn’t know what to make of it, cause we’re still way above bedrock level you know? My first thought that it was some kind of update glitch, but it looks too man-made for that to really make sense.” Scar turned back to face Grian, “Any ideas on what it could be?”</p>\n<p>Grian blinked. Oh right, the detective thing. It felt kind of out of place now, but he still attempted to keep up the Sherlock act, if not to stop Scar from suspecting anything was wrong then to keep himself from spirally into the panic he could feel still bubbling just below the surface.</p>\n<p>“Well,” Grian began, hiding his trembling hands behind his back, “You’re definitely right about this looking man-made. The way the bedrocks been placed doesn’t look anything like how it naturally spawns, plus the obsidian itself is a dead giveaway. Apart from that though we still don’t know who could’ve done this, and how.” Grian paced around the room, stopping in front of Scar. “This is definitely something worth looking into.”</p>\n<p>Scar grinned, “So you’ll take the case?”</p>\n<p>“Of course! This mystery is in good hands, if I could figure out you were the Jangler, I can definitely figure out who’s learned to break and use bedrock.”</p>\n<p>Scar snorted, raising an eyebrow at him as he walked towards the entrance, “Sure, sure. Well thanks for coming to look at it regardless, I’m gonna be honest finding this thing all by myself was kinda freaky at first, it feels... ominous or something for some reason.”</p>\n<p>Grian glanced behind him at the portal as he followed Scar out of the room, “Yeah… I guess I can see what you mean.”</p>\n<p> </p>\n<p> </p>\n<p>Grian tripped as he landed back in his base, not bothering to stand up he tore his scarf off his neck, trying to control his breathing. All his fear broke through to the front of his mind at once now that he was alone, he felt like he was drowning in his own thoughts.</p>\n<p>How was there a Watcher portal in Hermitcraft? How on earth did they even find him?<em> When did this even happen?</em></p>\n<p>He reached out to try and feel the shield he had up around the world but felt… nothing. Clenching his eyes shut he tried again, but no matter where he looked, there was nothing there. The magic separating the two worlds had completely disappeared. He thought back desperately, trying to figure out what could’ve caused this-</p>\n<p> </p>\n<p>Oh.</p>\n<p>\n<em>Oh.</em>\n</p>\n<p>The update wall.</p>\n<p>That wave of magic he felt.</p>\n<p>\n<em>He had used the protection spell to take it down.</em>\n</p>\n<p> </p>\n<p>Grian almost laughed at the fact that he had unknowingly used one barriers magic to take down another, but instead, he pushed the palms of his hands into his watery eyes, sighing heavily. There was no way to put the shield back up now, that magic was gone with the barrier and the Watchers were already here. He’d finally been caught.</p>\n<p>Now all he could do was wait to see what they’d do.</p>\n<p>\n<em>Swords clashed together, flinging sparks into the dense, blazing air of the battlefield. Hundreds of bodies laid dead or unconscious, trampled on by others that would surely join them soon in a desperate attempt to gain ground. It was hard to see who was even on what side, not that it mattered in the end, no one would come out of this fight with any kind of glory.</em>\n</p>\n<p>\n<em>Grian watched the chaos unfold from a hill, head rested on his hand and heart heavy in his chest. </em>\n</p>\n<p>\n<em>“It’s almost beautiful in a way, isn’t it?”</em>\n</p>\n<p>\n<em>Grian grimaced, turning his head away from the Watcher next to him. Even sitting their form dwarfed him in comparison.</em>\n</p>\n<p>\n<em>“Which side do you think will win?” The Watcher continued lightly, their attempt to start conversation falling flat as Grian remained silent, blankly watching the fight rage on in front of him.</em>\n</p>\n<p>\n<em>After a moment the Watcher sighed, disappointment heavy in their tone. They stretched, arms reaching out unnaturally far in front of them before they got to their feet, wings ruffling slightly at the movement. They looked down at Grian, his skin crawled as he felt their stare on the back of his head.</em>\n</p>\n<p>\n<em>“I don’t understand why you brought me here.” Grian huffed, snapping his head up towards the looming figure standing over him. The Watcher didn’t react to the angry tone, they simply smiled, almost sympathetically. Mouth stretched too wide over their teeth for it to look anything but unsettling.</em>\n</p>\n<p>\n<em>“To prove a point.” The Watcher soothed, crouching back down next to Grian, fast enough to make him flinch back. </em>\n</p>\n<p>\n<em>“Why do you think they’re fighting?”</em>\n</p>\n<p>\n<em>Grian frowned, eyes flickering over the war-torn ground still rampant in front of him suspiciously.</em>\n</p>\n<p>\n<em>“I… I don’t know.”</em>\n</p>\n<p>\n<em>“Neither do they,” the Watcher chuckled, sickly sweet and nauseating, “they’ve forgotten what it is that started the feud, simply fighting for the sake of it, the sake of a cause they’ve put all their reliance into despite gaining nothing but death and destruction in return.”</em>\n</p>\n<p>\n<em>Grian resisted the urge to roll his eyes and the flowery language, “What does that have to do with anything?”</em>\n</p>\n<p>\n<em>The Watcher was silent for a moment, despite the mask Grian could tell he was being observed intently.</em>\n</p>\n<p>\n<em>“When this world began, the players that inhabited it cared for each other. They helped one another in times of need, they shared what they had for the good of everyone. Then, they started fighting, arguing over small insignificant things. They let it spiral, corrupting them and their world until it swallowed them whole, and now, they will continue to fight until they wipe themselves out. Rather dying than try and regain the peace they once had.</em>\n</p>\n<p>\n<em>We have not interfered with this world. We did not ‘manipulate’ them, nor push them in any direction, instead, we watched them destroy themselves without us.”</em>\n</p>\n<p>\n<em>The Watcher touched Grian’s cheek gently, turning him to face them before continuing,</em>\n</p>\n<p>\n<em>“This is what happens without us, Grian. Without us, players would tear this universe to shreds with their greed, and their anger, and their vengeance. One day, when you understand why we do what we do, you’ll thank us for saving you from the inevitable destruction your world would have fallen into.”</em>\n</p>\n<p> </p>\n<p>\n<em> </em>\n</p>\n<p>Grian opened his eyes slowly.</p>\n<p> </p>\n<p>He didn’t panic, not this time. He’d gotten used to the Watchers haunting his dreams now, finding the portal a few days ago had increased them ten-fold. He sighed, touching his face, he could still almost feel the Watchers hand on his cheek. Sitting up in his bed he glanced around himself, he was in his village house, still messy and under construction. His villager roommate stood on the other side of the room watching him, Grian wasn’t sure if he had even slept.</p>\n<p>Silently he rose out of bed, stretching the best he could in the cramped space before walking to the door. He ducked under the doorway and walked outside. He rubbed his arms, shivering slightly at the chill in the air, it was still early, the sun only just rising over the horizon, a slight fog rolling through the village. Grian stood outside his door for a second just enjoying the quiet morning around him, he wasn’t sure if any if the others were awake yet, if they were even in the village in the first place.</p>\n<p>“Hey dude!”</p>\n<p>Well. That answered that. The peaceful moment was broken by his Swedish neighbour walking over to him, a grin too wide on his face for how early it was.</p>\n<p>Grian smiled back, “Hey man.”</p>\n<p>“Mumbo and I were going to head over to Sahara for a bit and see if we could work on the interior, I think he’s already over there if you’d like to come.” Iskall offered, grinning invitingly.</p>\n<p>Grian wanted to say yes, he almost did.</p>\n<p>“I’m really sorry dude,” Grian sighed, sheepishly, “I’ve got a ton of other stuff I need to get done today and I don’t have any time.”</p>\n<p>Iskall’s grin fell slightly, “You sure? It’s been a while since the Architech’s have all been in the same place at once…”</p>\n<p>“Nah, I trust you guys not to ruin anything too much.” Grian reassured, punching his friends’ shoulder playfully. Iskall laughed, breaking the tension in the air,</p>\n<p>“I wouldn’t speak too soon dude; it’s going to be your own fault if you hate what we come up with.”</p>\n<p>“I’m sure you guys won't mess it up too horribly.”</p>\n<p>Before Iskall could reply, his communicator buzzed. He took it out of his pocket to check it,</p>\n<p>“I’ve gotta get going, Mumbo has no idea what to build without one of us being there.”</p>\n<p>Grian snorted, waving his friend off as he walked towards the portal. Once Iskall was out of sight Grian’s face fell, his arms coming up to wrap around himself in some kind of comfort.</p>\n<p>\n<em>He needed to leave Hermitcraft.</em>\n</p>\n<p>Now that the Watchers had found him, he needed to get out as fast as he could. He couldn’t let the others get caught up in his mess more than they already had and he’d never forgive himself if any of them got hurt because of it. The best thing he could do, he justified, was cut to himself off from everyone. Not completely, but just enough that when he’d leave, they wouldn’t miss him that much. Grian could feel himself getting choked up at the idea, he didn’t want to leave this world, he didn’t want to leave his friends and his life he’d made here but, once again, he didn’t get a choice.</p>\n<p><em>‘History’s repeating itself.’</em> He thought bitterly as he walked back inside his house. He felt the same wave of grief he always did wash over him as he thought of his old world, of Evolution. He shook his head, trying to get rid of the thought, he couldn’t let himself spiral down that line of thinking now. He needed to get to work. He walked to the corner of the room, breaking a block in the floor to reveal a ladder leading down into the darkness, he climbed down it into a room far under the surface. The stone room was large and empty, the only thing in it being some chests near the ladder.</p>\n<p>If Grian wanted to escape, he’d need to find a way to get his magic back. The last of it had died with the Update, and this room was a way for him to try and get as much of it back as he could without the fear of being caught. In theory. If any other hermit found it, he could just brush it off as some kind of continuation of his house. Grian walked to the middle of the room, closing his eyes and holding his hand out in front of him. He reached out around himself, trying to feel for any kind of energy that might still be lingering in the world. After a few minutes of nothing he huffed and opened his eyes, trying to relax. Grian took a few deep breaths and closed his eyes again, feeling the universe around him, feeling its connection to everything and everyone, even stronger now with his protection spell broken. He held onto that feeling, clinging to it and following its path, feeling it swell around him—</p>\n<p>\n<em>Woosh</em>\n</p>\n<p>Grian’s eyes flew open, looking at his hand, now alight with purple flame. The glow of it illuminated him. It was small, just fitting in the palm of his hand, and it flickered and died out in a few seconds, leaving Grian suddenly exhausted, but he smiled anyway.</p>\n<p>He still had a chance.</p>\n<p>Grian had been in his underground room for a few hours before his communicator went off,</p>\n<p> </p>\n<p><strong>Joehillssays: </strong> <em>hey y'all, I hate to interrupt all the incredibly important work everyone’s doing at this very moment, but we have a bit of a large building situation where I currently am.</em></p>\n<p><strong>Joehillssays: </strong> <em>So, you should all probably get over here quickly.</em></p>\n<p><strong>Joehillssays: </strong> <em>Please.</em></p>\n<p> </p>\n<p>Joe posted his coordinates, and Grian weighed up whether he should go or not. He’d been underground for a good part of the day and had made a lot of progress, plus Joe seemed to think whatever he was talking about was urgent enough that every hermit needed to be there. Grian wrote back a quick <em>I’m on my way </em>before he climbed back up his ladder.</p>\n<p>Grian saw what Joe had been talking about long before he landed, a majority of the other hermits already there. It was an enormous structure, hundreds of blocks high and hundreds of blocks wide, obsidian and bedrock decorated its exterior. It was a beautiful building, intricately detailed with sandstone stairs and slabs and just about every other block possible. Two stone statues stood at its door, tall and regal in appearance, the wings on their backs stretched outwards towards the sky, casting a shadow onto the players gawking up at them.</p>\n<p>“Who… who built this?” Cleo muttered, walking closer to the door, neck strained up as she took in as much of the building as she could.</p>\n<p>“See that’s the thing,” Joe stated, “I was here no more than ten minutes ago gettin’ sand, right? I went to go put it away but when I came back this thing had just erupted itself from the ground.”</p>\n<p>Cubs brow furrowed and he looked at the man standing next to him, “How’s that possible?”</p>\n<p>“No idea, all I know is I’ve gotta go somewhere else to get sand now.”</p>\n<p>“This is bedrock,” Cleo interrupted, drawing the rest of the groups' attention back over to her, “How’s it got bedrock up here? We aren’t even underground.”  </p>\n<p>Scars eyes lit up in realization, he looked over at Grian, “Do you think this was made by the same person that made that weird portal thing?”</p>\n<p>“Weird portal thing?” Doc’s eyes shifted between Grian and Scar, confused.</p>\n<p>“I can show it to you later if you want, I found it in a cave somewhere. It had a bunch of bedrock around it even though we were nowhere near the right level.”</p>\n<p>“So, are we going inside?” False asked, looking at one of the statues uneasily.</p>\n<p>the door creaked, interrupting the group before anyone could respond. They snapped their heads back to the door, catching a glimpse of Cleo before it shut behind her.</p>\n<p>“Guess so.” Doc chuckled.</p>\n<p> </p>\n<p>The first room they walked into was thin. It was only a few blocks wide and the wall ahead of them was blank, a series of pressure plates spread out before it. Cleo was already standing on one of the plates, looking at the others expectantly.</p>\n<p>The other hermits stood on the plates, one for each of them. When the last of them stepped on, pistons could be heard activating from the other side of the wall, slowly opening it till it was gone completely. The space was exceedingly larger now, having opened up to reveal a hallway. It was <em>long</em>, long enough that they could barely see the end from where they stood, the inside was decorated just as intricately as the outside, beautiful chandeliers made of obsidian and end rods draped down from the ceiling, reaching down towards the ground like stalactites. the most amazing features, however, were the stained-glass windows, they lined the walls of the hallway, shining colourful light onto every surface in the room.</p>\n<p>The building was breath-taking, Grian could admit that, but that didn’t stop his stomach from lurching at the sight of it. This had the Watchers written all over it, he could tell that from the moment he spotted it on his flight over, and the level of detail they had gone to for this was not a good sign. <em>Nothing</em> about this was a good sign. Xisuma was the first to start walking, moving slowly towards a chest placed a few blocks in front of them. He opened it and took out a book, seemingly the only thing inside. He flipped through a couple of pages before looking at the front cover, frowning.</p>\n<p>“What is it?” Ren walked towards him; the others followed behind, still taking in everything around them. X held up the book,</p>\n<p>“I’m not sure, I can read the inside fine but whatever’s written on the front is… weird.”</p>\n<p>“Oh!” Joe exclaimed, “That’s Galactic! Give me a second, I’ll see if I can read it.”</p>\n<p>Xisuma gave him the book, Joe read over the cover for a second intently,</p>\n<p>“It says, <em>The Watchers</em>”</p>\n<p>“That sounds a bit creepy.” Iskall laughed nervously, his brow furrowed. He edged away from the book a little, “Is someone watching us?”</p>\n<p>“Seems to be what the book is suggesting,” Joe replied, he’d opened the book to the first page, “It’s not that long, and some of it’s written in rhyme-- Was this book made for me or something?”</p>\n<p>The others laughed at that. Scar walked over to Grian, nudging him a little,</p>\n<p>“Hey, do you reckon the symbol on the front of the book looks like that portal?”</p>\n<p>Grian swallowed, he hoped he didn’t look too out of it. This felt like a nightmare, a complete and total nightmare.</p>\n<p>“I mean, I guess?” he said in a dismissing tone, pretending to look at the front cover carefully.</p>\n<p>“We’ll have to see if we can get a better look at the book later, might be useful evidence.” Scar decided. Grian nodded his head absentmindedly.</p>\n<p>“These windows are incredible!” Stress awed, walking further down the hallway, “Looks like they tell a story or somethin’.”</p>\n<p>The rest of the group looked back up at the windows. Stress was right, the windows stretching across the room had illustrations in them, screenshots of a story documented beautify in the glass. They started to walk further down the hallway, trying to piece together the tale. Cleo broke the silence first,</p>\n<p>“What it about?” She asked Joe, leaning over his shoulder to look at the book he was still flipping through. Joe pushed his glasses back up his nose, looking away from the book at the girl next to him.</p>\n<p>“Well, from what I’ve gathered, it’s the history of these… Watcher creatures, something about how they were born out of the universes need to learn about itself… here, I’ll read you some of it,” He cleared his throat before reading from the page,</p>\n<p>“…<em>the Watchers looked over and cared for their Worlds, guiding players through hard times and rewarding them with gifts when they were deserving. They treated the players fairly; however, they would intervene when necessary to maintain peace. The players looking to them as Gods, worshipping them and thanking them for their divine help.”</em></p>\n<p>Cleo scrunched her nose, watching as Joe flipped through a few more pages, “That’s a bit egotistical, ain’t it?”</p>\n<p>Grian looked away, trying not to laugh. If the Watchers were trying to gain the Hermits trust they were doing a lousy job so far. He continued to trail at the back of the group, looking at the decor around him, the architect side of him was honestly having a good time looking at all the design that went into everything. The Watchers knew how to make a good building, he’d give them that.</p>\n<p> </p>\n<p>Grian’s almost peaceful mood was shattered a second later. His face dropped, and he paused in front of the window that caught his eye.</p>\n<p>The window was made up of different colours of purple glass, depicting three people. Two taller ones standing on either side of the window framing it, obviously Watchers from the wings and attire, a third smaller one stood between them, almost half the height of the other two. They were dressed the same as the others, but the robe was too large for their body, falling around their feet like a puddle.</p>\n<p>It was him.</p>\n<p>It was so obviously him that for a moment he panicked that the others would notice, but that was irrational, <em>he </em>knew that it was him, but to anyone else, it would just look like some kind of… smaller Watcher. Or something. That’s what he told himself anyway. Mumbo glanced around and noticed Grian’s absence in the group, looking behind him to see where he went. He looked up at the window Grian was staring at, walking back over to it, the other Hermits noticing and following behind curiously.</p>\n<p>“That one looks like a family portrait or something.” Mumbo squinted up at it, “Actually, I think there’s something written up there, won’t be a second.”</p>\n<p>Mumbo flew up to the window, he hovered there for a moment reading out the inscription written in the stone below it,</p>\n<p>“It says, <em>The Saved One.</em>” Mumbo flew back down to the group, “No idea what that means.”</p>\n<p>“I think I saw something about that in here actually,” Joe started flipping through the book again, “Aha! Here we go,</p>\n<p><em>… The Watchers, taken with the player and his world, decided mercifully to save him from the destruction it would fall into. They gave him one final task; defeat the Enderdragon. The player succeeded and was ascended from his world to become a Watcher.” </em>Joe frowned slightly as he read further,</p>\n<p>“<em>After some time, the player became unsatisfied with this. He believed himself better than the Watchers, cursing them out for their actions and interference within the worlds. He fled, trapping himself in a random world and baring the Watchers from entering, dooming the players that inhabited it from the Watchers guidance as a result.”</em></p>\n<p>Grian saw red.</p>\n<p>He followed the group as they moved on, the others curiously listening to more of the writing in the book Joe was reading from, but Grian couldn’t hear any of that now. He tried to keep his face neutral but on the inside, he was <em>seething.</em> His hands balled into fists, hard enough that if he had cared in the moment, he’d be worried he’d break skin. How <em>dare </em>they insinuate that he was some kind of villain in any of this, that he was the one at fault for <em>their </em>actions. None of the other hermits noticed Grian’s sudden foul mood, and if they did, they were too taken with Joes reading to really sense it properly.</p>\n<p> </p>\n<p>Before long they reached the end of the hallway. The corridor opened up to a circular room, a large statue of a watcher standing in the middle, a fountain surrounding it. It held a staff in its hand, glass of all different colours coming from the end of it like lightning, spreading to the top of the ceiling in a magnificent display. Around the corners of the room were chests, each labelled with the name of one of the hermits, the group quickly split off to go find their own chest. Grian dragged himself towards the chest with his name on it, the sound of his friend’s excitement at the gifts they’d been given surrounding him.</p>\n<p>He opened the chest only to close it again a second later, eyes wide and head whipping around to see if anyone else had seen what was inside. The others were too caught up in their own chests to notice, so he opened it again slowly. The chest was empty apart from one item, a white mask. It covered the top half of a face, the bottom edges on each side coming down to point towards the ground, a Watchers symbol painted on the forehead.</p>\n<p>It was his mask, the one he left behind when he escaped. He quickly shoved it away in his inventory, telling himself he’d deal with it later, when he was alone. Grian walked back towards the entrance of the room where the others had gathered, all of them talking and bantering amongst themselves, Grian wished he could join in on their enthusiasm. Mumbo turned to him once he walked over,</p>\n<p>“So, what was in your chest?”</p>\n<p>“Oh, yeah, it was a bunch of… fireworks.” Grian lied, smiling at his friend.</p>\n<p>Mumbo nodded, “This whole thing is still really weird, if you’d have come to me yesterday and told me all of this stuff about ‘Watchers’ or whatever I would’ve thought you’d gone mad but now… I don’t know. I guess I’ve got to believe it.”</p>\n<p>“Well, you don’t need to believe anything really. For all we know this could just be some kind extremely elaborate prank.” Grian countered, avoiding Mumbo’s eyes, looking away down the hallway they’d just walked down.</p>\n<p>Mumbo snorted, “Right, yeah, what am I thinking, obviously this is all just to make us looks like fools and is totally worth the effort it would take to pull off this well.”</p>\n<p>Before Grian could reply, Doc called out over the rest of the group,</p>\n<p>“Alright, last one to the other end of the hallway loses!”</p>\n<p>The other hermits called after him, scrambling to take off, Iskall flying straight into the side of a wall in his haste causing Cleo to laugh so hard she couldn’t take off all together. Grian grinned, his troubles momentarily forgotten as he pushed Mumbo out of the way to take off after his friends, Mumbo yelling at him as he took off a moment later.</p>\n<p> </p>\n<p>Xisuma held back, grabbing Joes' arm before he could go anywhere,</p>\n<p>“Hey, do you think I could have that book? I wanted to look it over a bit.”</p>\n<p>Joe blinked, “Only if you promise to be the last one to the end of the corridor now that you’ve kept me behind.”</p>\n<p>Xisuma smirked “Sure.”</p>\n<p>Joe handed him the book, turning back around to chase after the others. X looked at the book in his hands suspiciously. Something didn’t feel… right about all this, there were so many questions still left unanswered. Why was this the first time any of them had heard about these ‘Watchers’? How had they built this building so quickly and without anyone noticing? <em>Were they dangerous?</em> He gripped the book tighter in his hands, face now determined. He was going to get answers.</p>\n<p>Somehow.</p>\n<p>Grian tried to catch his breath, putting his hands on his knees as he bent forward to support himself and also not throw up. His jumper had been discarded and thrown into a corner of the room ages ago, leaving him in a white undershirt that now clung to him. Magic zapped around him, crawling up his arms and snaking around his fingers like lightning, just itching to be released. He wiped at the sweat that dripped down his forehead with a shaky hand and took a deep breath before righting himself.</p>\n<p>If Grian wasn’t desperate before, he was teetering on the edge of it now. Ever since the temple they found in the desert, the Watchers had been popping up more and more frequently, making little challenges for the hermits and showering them with gifts. They were acting way more generous that Grian had ever seen them act before, but the most annoying part to Grian, however, was the fact that they hadn’t… done anything yet. Not to say he wasn’t <em>happy </em>his huge and possibly life-and-or-friendship-ruining secret hadn’t been exposed to the masses, it was more the fact that he didn’t understand why they hadn’t exposed it. He’d always assumed that if they ever found him, they’d drag him back kicking and screaming or just… kill him, but neither of those things had happened yet and it was making Grian <em>extremely paranoid. </em></p>\n<p>The builder collapsed into one of the corners of the room, leaning on a chest and half chewing on a golden carrot. He was exhausted, spending the last three days down in his secret room trying to re-teach himself how to do magic had really taken it out of him. He tried to think of the last time he hadn’t been so tired, the last time he’d actually worked on any of his projects, the last time he’d even been back to his <em>base.</em> He’d been so busy trying to find a way out of Hermitcraft that he’d put everything else on hold. Well, almost everything, he still worked on his village house and talked with whatever hermit happened to strike up a conversation with him, but aside from that, he’d almost completely cut himself off from the world.</p>\n<p>He hated it, he hated hearing about all the fun and exciting things his friends were doing without him, and he hated the disappointed look in their eyes when he’d pass on whatever outing they’d ask him to come on. Grian told himself that it was for the best, if they were able to get by without him now there wouldn’t be any problems when he left for good. They’d be <em>safe</em>, and he wouldn’t be putting them in danger anymore. He pushed himself back to his feet newly determined, opening the chest next to him to put his food away, his hand stopping mid-air as he looked inside. It was mostly empty apart from some food and water, the only thing that looked out of place was his mask that he’d thrown inside days prior. He hesitantly grabbed it, running his thumb along the side as he turned it over in his hands.</p>\n<p>The Watchers took their masks very seriously. When he’d asked about why they wore them so long ago, they’d told him about how the eyes were the doors to a person’s soul or something, that they could see into the player's souls, but the players were unable and unworthy to see into theirs. It sounded like a load of rubbish when he’d first heard it and it sounded like a load of rubbish now. Holding it again after so long was strange and it felt foreign in his hands, he knew why they’d given it to him. It was a message, it was them telling him he wouldn’t escape them, telling him he’d always be a part of them.</p>\n<p>‘<em>Screw that.’</em></p>\n<p>He threw the mask back in the chest and slammed it shut, casting it out of his mind. He wasn’t going to let them get to him and he refused to play their games anymore. He let the magic flow back into his body, and with a reinvigorated purpose, he continued on.</p>\n<p> </p>\n<p> </p>\n<p>Xisuma chewed on the end of a pencil, helmet discarded next to him for the moment as he looked over the pages sporadically thrown around the top of his bed. In the time he hadn’t been working on the church or dealing with some kind of update issue, He’d been going over that book from the temple, trying to make sense of it the best he could. He’d tried to transcribe some of the more important sounding passages on random sheets of paper, but it had quickly gotten a little out of control.</p>\n<p>He doubted he’d even care about something like this all that much normally, weirder stuff had happened around here, but something about <em>this</em> just didn’t seem… right. It felt too unnerving, almost threatening in a way. He wasn’t sure what it was, but his gut was telling him not to trust it at face value. X rubbed his eyes, trying to concentrate on the page in his hand. He jumped when he heard a knock at the door to his right.</p>\n<p>Doc stood in the doorway, a grin on his face, probably because he made X jump, “Hey dude.”</p>\n<p>‘Hey,” X sighed, his heart still beating fast in his chest, “what’s up?”</p>\n<p>Doc strolled inside, idly looking around the empty room, “Oh, nothing really, I got bored and you and Grian are the only other people in town right now, so I wanted to come bother one of you.”</p>\n<p>He sat down on the edge of the bed and picked up one of the sheets of paper. He glossed over the words scribbled on it, eyebrow raising, “What’s this?”</p>\n<p>“It’s just bits and pieces from that book we found the temple, I’m trying to get as much out of it as I can.”</p>\n<p>Doc looked at him confused, sitting further back on the bed and leaning on the wall behind him, “Why?”</p>\n<p>X’s mouth drew up into a line and he ran a hand through his hair, “I don’t trust it. The Watchers, I mean, there’s so much we still don’t know. Where’d they come from? Why are we only just hearing about them?” He grabbed at some paper next to him, shoving it into Doc’s hand, “Look, it says here that they’re responsible for getting players through updates, yeah? So where were they before this update?”</p>\n<p>“There was that tower that showed up at Iskall’s base, wasn’t that them?”</p>\n<p>X’s shook his head, “No, I don’t reckon that was them. If you compare that tower to the other Watcher buildings they’ve made around the place, there’s no connection. They don’t look the same in the slightest.”</p>\n<p>Doc looked at him tautly, “I think you might be looking a bit too much into this man.”</p>\n<p>X huffed, leaning back on the bed, “I know, I know. I just don’t know what to make of it.”</p>\n<p>“Well, I don’t think these Watchers are that bad, they haven’t done anything wrong so far, right?”</p>\n<p>“Yeah. Yeah, I guess you’re right,” X muttered, “I just can’t help it, I don’t want to let my guard down and have something bad happen, you know?”</p>\n<p>Doc nodded understandingly. A comfortable silence lay over the room for a few moments.</p>\n<p>“Whelp,” Doc announced, patting X’s knee as he pushed himself off the bed, “I’m going to go find something else to do.”</p>\n<p>“You gonna go bother Grian now?”</p>\n<p>Doc barked out a laugh, “I don’t think I could do that even if I wanted to.”</p>\n<p>X furrowed his brow, looking at his friend confused, “What do you mean?”</p>\n<p>“You haven’t noticed?” Doc raised his eyebrow, “No one’s been able to get Grian to do anything for days now, if you’re lucky he’ll have a conversation with you for a few minutes before he goes back inside his house.”</p>\n<p>X looked out the window at Grian’s house on the other side of the road, “Really? Why?”</p>\n<p>Doc just shrugged, “No one really knows, we’ve tried to ask him, but he just says he’s ‘busy’. He won't even show anyone what he’s working on.”</p>\n<p>X felt a bit guilty at that, had his friend really been acting so strange and he just hadn’t noticed?</p>\n<p>“I’ll try talking to him, he might just be weirded out by everything that’s happened recently…” He muttered, looking back at his friend standing in the doorway.</p>\n<p>“Good luck, he won't even talk to Mumbo properly.” Doc countered, “Regardless, I’ll get out of your hair now. Have fun looking over all those pages, man!”</p>\n<p>The man walked the rest of the way out of the house and turned the corner, leaving X alone. X frowned once he left, looking back out the window. Now that he thought about it more, he really hadn’t seen Grian around much since the update, and even then, he’d been acting a bit more closed off. <em>‘Grian had been acting out of character at the temple too,’ </em>his frown deepened at the thought, ‘<em>a building like that should’ve excited him, right?’ </em></p>\n<p>He shook his head, laughing a little under his breath. Doc was right, he was getting way too caught up in the mystery of all this. X gathered up the papers and shoved them into the book, putting it away in a shulker box next to his bed for another day. Maybe he should give the Watchers the benefit of the doubt? He didn’t know, and at that moment he didn’t care that much. He stood out of his bed, walking towards the door to go distract himself with something for a few hours.</p>\n<p>Someone knocked on Grian’s door as he climbed up the ladder into his main room. He walked over and answered it, finding Iskall and Mumbo at his doorstep dressed in their golfing attire. Iskall grinned brightly,</p>\n<p>“We’re going golfing!”</p>\n<p>Grian blinked.</p>\n<p>“Okay. have fun,” Grian attempted to close the door, unable to when Iskall stopped it with his foot. Grian opened it again, brows furrowed. Iskall’s smile didn’t waver,</p>\n<p>“Grian. <em>We’re going golfing.” </em></p>\n<p>Grian looked over Iskall’s shoulder at Mumbo, his fellow Architech also smiling at him, though his smile looked a little more forced.</p>\n<p>“I…” Grian began, eyes flickering between them, “I’m… busy?”</p>\n<p>An awkward silence fell over the trio. Mumbo’s smile edged on anxious,</p>\n<p>“Please Grian?” he pleaded quietly; his eyes slightly desperate.</p>\n<p>Grian chewed on the inside of his lip, looking between his friends for a few more seconds. He sighed, leaning on the door frame,</p>\n<p>“Give me a sec, I’ll go get changed.”</p>\n<p>Mumbo’s eyes lit up with relief, his shoulders relaxing as the tension left him. Iskall clapped his hands together,</p>\n<p>“Great! We’ll just be out here when you’re ready.”</p>\n<p>Grian shut the door properly now that there wasn’t a foot in the way and rested his forehead on the back of it for a moment. His head was a mess, he wanted to go, he <em>really </em>did, but he felt… bad about it for some reason. Maybe it was because it’d gotten to the point where his friends had to literally confront him at his doorstep to make him interact with them? He wasn’t sure. Regardless of his feelings, he got changed, pulling his golfing clothes out of a chest and putting them on. Iskall and Mumbo were talking quietly to each other when he opened the door again. They smiled when they saw him, properly this time, and all three walked towards the Nether portal.</p>\n<p> </p>\n<p>The walk towards the Concorp Country Club was quiet, Grian hanging back behind the other two while they talked to each other. Mumbo was not so subtlety glancing back at Grian every few minutes. Grian pretended not to notice. Once they actually got to the golf course and set up, Grian felt his mood improve slightly, he watched his two friends argue over who was going to go first, electing to ignore them and stepping into the water on the first hole to take his shot.</p>\n<p>“Hey losers,” Grian interrupted, drawing their attention over to him, “See ya!”</p>\n<p>“You bastar-”</p>\n<p> Iskall’s comment was cut off as Grian teleported, landing on the green. He giggled to himself and looked over at the red flag, waving in the breeze a few blocks away. Maybe today was going to be fun after all.</p>\n<p> </p>\n<p>The trio had made it through a few holes, Mumbo surprisingly in the lead and not shutting up about it. Mumbo and Grian stood on the green of Hole 8, watching Iskall take his first shot from the ledge above them. They watched him aim his trident in the air, squinting as he drew his arm back--</p>\n<p>“Iskall! BEHIND YOU!” Grian shouted.</p>\n<p>Iskall had no time to react as the Creeper that crept up behind him exploded, killing him instantly.</p>\n<p>Grian burst into laughter, wrapping his arms around his middle as he keeled forward, Mumbo put his head in his hands,</p>\n<p>“it’s happened again, I cannot <em>believe</em> it happened again.” He muttered, giggling slightly as he listened to Grian lose it beside him. Grian took a few more seconds to stop laughing, wiping tears from his eyes as he tried to calm down,</p>\n<p>“O-Oh my god, my stomach,” He gasped, out of breath, “That-that’s a penalty, right?”</p>\n<p>“Of course it is! Now we have to wait 10 minutes for him to get back here!” Mumbo groaned, sitting down on the grass under him.</p>\n<p>Both their communicators went off,</p>\n<p><strong>Iskall85:</strong> <em>bloody creepers!!!</em></p>\n<p><strong>Iskall85:</strong> <em>LOL</em></p>\n<p>Grian grinned slightly as he sat next to his friend, crossing his legs.</p>\n<p>“Should we go grab his stuff?” Grian asked, squinting up at the mountain above them.</p>\n<p>“I’m not going up there” Mumbo scoffed, typing a message back to Iskall to tell him to hurry up.</p>\n<p>“Neither am I.”</p>\n<p>The two were silent for a moment.</p>\n<p>“I’ve really missed you; you know.”</p>\n<p>Grian’s brows knitted together, he turned his head to look at the moustached man next to him,</p>\n<p>“What do you mean?”</p>\n<p>Mumbo looked at the ground, a small, almost sad smile on his face as he fiddled with the grass in front of him,</p>\n<p>“Well it's just, this is the first time we’ve hung out together in ages. It’s just felt like something was missing with you not around, you know? No one’s been able to get you to come out of your house for ages and I honestly wasn’t sure if you were even going to come today. I’m glad you did though, it’s been fun so far.”</p>\n<p>Mumbo paused, thinking about his next words carefully. He looked up at Grian, his eyes full of concern and voice soft,</p>\n<p>“You know if there is something… wrong, you can come talk to me, right? Or Iskall, or anyone. We all care about you a lot Grian, and we’ve been trying to give you space but, its been hard watching you try and lock yourself away like this.”</p>\n<p>\n<em>Oh.</em>\n</p>\n<p>Grian tried to swallow down the sudden wave of emotions climbing up his throat. He looked away from Mumbo, eyes wide and jaw clenched. He didn’t know what he had expected his friend to say, but it wasn’t that. A silence fell between them and Grian realized he should probably respond,</p>\n<p>Mumbo… I--“</p>\n<p>“DID NEITHER OF YOU COME AND GRAB MY STUFF? <em>ARE YOU FOR REAL?</em>”</p>\n<p>Grian was cut off by an angry shout above them, their Swedish friend having finally made his way back. Mumbo sighed, getting back to his feet, he held out his hand and Grian took it, pulling himself up to his feet as well.</p>\n<p>“Sorry man! Neither of us wanted to go back up the mountain!” Grian yelled back up at him, Iskall continued to shout something at them, but the words were lost to the wind.</p>\n<p>“Hey,” Mumbo turned back to Grian, “Just… think about what I said, yeah?”</p>\n<p>Grian’s smile strained slightly, “Yeah. Yeah, I’ll let you know if there’s something wrong.”</p>\n<p>Mumbo continued to look at his friend for a second. He looked like he wanted to say more, but eventually turned away to look back up at their other friend still getting ready to take his shot.</p>\n<p>“Okay, Iskall! This time, what you’re going to want to do is not die!”</p>\n<p> </p>\n<p>Mumbo managed to keep his lead up until he accidentally threw his ender pearl in the opposite direction of the flag, adding seven points to his score and making the other two Architech’s poke fun at him for the remainder of the round. Once the game was over and everyone added up their scores, Grian was announced the winner.</p>\n<p>“Oh yeah!” Grian cheered, writing his score on the leader board, “King of golf!”</p>\n<p>“King of luck maybe,” Iskall interrupted, putting his tridents and flags into a chest, “You only won because Mumbo started seeing things at the last hole.”</p>\n<p>“There was a flag!” Mumbo insisted desperately, “I swear I saw a flag.”</p>\n<p>Grian put his hand on Mumbo’s shoulder, “Don’t worry Mumbo,<em> I</em> believe you.” He said in faux sympathy. Mumbo shoved his hand away,</p>\n<p>“Oh, piss off.” He chuckled, Grian giggling as he turned to finish putting his items away.</p>\n<p>The walk back to the Nether Hub was exceptionally livelier than the walk there had been, all three players bantering and laughing amongst themselves. By the time they had made their way back to Hermitville, the sun was setting, casting a golden hue over the peaceful town. The three stood in the middle of Sahara street outside Grian’s house,</p>\n<p>“Today was really fun,” Iskall announced, “We should do this more often.”</p>\n<p>“Oh definitely.” Mumbo nodded, turning to look at Grian.</p>\n<p>“Yeah,” the builder replied, “Yeah, totally.”</p>\n<p>The three said their goodbyes and parted ways, Grian watched them walk away with a small smile on his face.</p>\n<p> </p>\n<p>\n<em>I’m going to miss them.</em>\n</p>\n<p>The thought startled him, his smile falling in an instant. He’d completely forgotten about that, he’d forgotten about everything today, too caught up in his friend’s company to even consider his current situation. His mouth drew into a line, thinking back to what Mumbo had said to him earlier,</p>\n<p>\n<em>‘if there is something… wrong, you know can come talk to me, right?’</em>\n</p>\n<p>Could he? Could he really talk to him about… any of this? Grian shook his head, turning towards his front door. No, he… he couldn’t, not about this. He cared about his friends, trusted them, and if it had been anything else he would’ve gone to them in an instant for help but… but this was different. He got to his front door, hand pausing over the handle when he heard muffled voices coming from inside.</p>\n<p>\n<em>‘… we have to talk… listen to…’</em>\n</p>\n<p>\n<em>‘he isn’t… we can’t know…’</em>\n</p>\n<p>Grian frowned, opening the door to confront whoever was inside his house. Xisuma and Doc stood in the middle of the room, both looking startled by Grian’s entry.</p>\n<p>“What’s going…”</p>\n<p>Grian’s accusation trailed off and his hand slipped from the door when he saw what Doc was holding.</p>\n<p>“Grian, we need to talk.” Doc said, Grian’s mask held tight in his fist.</p>\n<p>It was quiet enough that if you dropped a pin, you’d hear the impact. Grian stood frozen by the door, ears ringing and unable to take his eyes off the mask in Doc’s hands. He felt like he’d been punched in the gut. Xisuma’s eyes shifted from Grian to the mask, flickering between the two hesitantly.</p>\n<p>“I- I don’t…” Grian croaked, finally finding his voice, “Why are you- How do you have that?”</p>\n<p>“I think the better question is how do <em>you </em>have it, Grian?” Doc challenged, taking a step towards the man before X grabbed his arm,</p>\n<p>“Doc, don’t,” X hissed, turning back to the man by the door, “Grian, please, we just want to talk.”</p>\n<p>He held his hands out in front of him, like he was trying to calm down a scared animal.</p>\n<p>“Talk- talk about what? I don’t,” Grian stuttered, “Why are you <em>here? </em>Why are you in my house?” Grian’s voice raised as he spoke, shock wearing off and leaving room for panic to take its place. X looked guilty for a second, lowering his arms a little,</p>\n<p>“Listen, ok we just- we came over ‘cause we’re worried about you, everyone is, and we didn’t realize you weren’t home, so we came inside and saw the ladder in the corner and--”</p>\n<p>Grian stopped listening, whipping his head to the corner of the room where the ladder now stuck out of the floor. His eyes widened, eyebrows drawing together in confusion,</p>\n<p>\n<em>What?</em>\n</p>\n<p>He’d replaced the floor; he was sure of it. He’d double-checked it before he left that morning, he wouldn’t just leave it open like that.</p>\n<p> </p>\n<p>\n<em>Oh, those<strong> bastards.</strong></em>\n</p>\n<p> </p>\n<p>Grian felt anger crawl up his throat as he realized what had happened, this was the Watchers, it had to be, they must have re-broken the floor after he left. That’s all they had to do, no big reveal of Grian’s lies and follies, no song and dance or big show for all his friends to watch and learn the truth, in the end all it took was just one broken block and two people in the right place at the wrong time for Grian’s world to start cracking and falling around him. Grian flinched back out of his thoughts, X grabbing his shoulder gently,</p>\n<p>“Grian, are you alright?”</p>\n<p>Before Grian could respond he noticed Doc looking down at the mask in his hand, raising it towards his face curiously--</p>\n<p>“No! don’t, don’t put it on!”</p>\n<p>Doc pulled it back away from his face quickly as Grian pushed past X to rush over, trying to grab it out of his hand. Doc raised it above his head and out of Grian’s reach before he could, looking down at the man in surprise,</p>\n<p>“Why? What is it?”</p>\n<p>Grian attempted to grab the mask, cursing his height as it remained out of reach,</p>\n<p>“It's--” Grian stuttered and looked Doc in the eyes, shrinking down under the intensity of his stare, “It’s nothing.” he choked out, taking a step back when Doc’s eyes narrowed into a glare,</p>\n<p>“Oh, cut the bullshit dude,” Doc scoffed, eyebrows turned down and shoulders tense, “You really expect us to believe this is nothing?”</p>\n<p>“I’d expect my friends to respect my privacy and not break into my house!” Grian snapped back, anger clouding his mind.</p>\n<p>“It’s not like you gave us a choice! You won’t <em>talk </em>to anybody!”</p>\n<p> “Guys, come on, don’t--” X tried to interrupt, voice strained, the other two too caught up in their argument to listen,</p>\n<p>“This doesn’t concern any of you, you can’t get involved-”</p>\n<p>“Oh! So <em>you</em> get to decide what we get involved in?” Doc scoffed, continuing to hold the mask above himself.</p>\n<p>“About this, yes! I’m just trying to protect you!” Grian shot back, trembling, the anger clouding his mind thickened with panic as he lashed out.</p>\n<p>“Protect us? From what, Grian?” Doc badgered, “The Watchers? Is this related to them? Is that why it’s got that symbol on it?” Doc gestured to the mask in his hand.</p>\n<p>“It’s—I don’t, I--” Grian stuttered, he looked away from Doc and wrapped his arms around himself,</p>\n<p>“Doc, stop--” X pleaded,</p>\n<p>\n<em>“Why don’t you trust us?”</em>\n</p>\n<p>“<strong>DOC!</strong>”</p>\n<p>The shout snapped Doc out of it, he looked over at X, startled. Grian took the chance to grab Doc’s arm, yanking it down and pulling the mask from his hand. Before the other two could do anything, he dashed for the door, yanking it open and taking off without a second thought. X and Doc stood still for a second in shock before they raced after him, Grian already ages away by the time they’re outside.</p>\n<p>“What’s going on?”</p>\n<p>Mumbo stood behind the two, concern evident on his face as he watched Grian get smaller and smaller in the distance.</p>\n<p>We uh,” X muttered, face going pale, “We might have messed up.”</p>\n<p> </p>\n<p>Grian didn’t know where he was going, he didn’t care, he just kept flying. He couldn’t think straight, thoughts flying past his like the wind, he was going so fast that he had to squint his eyes against it. He was such an <em>idiot</em>, why did he leave it in a chest? Why did he leave it in a chest for <em>anyone to just come and find? </em>He felt his eyes well up, using his rockets even faster now, almost as if he could run away from his feelings that threatened to drown him. Grian was so overwhelmed that it took him a second to realise that he wasn’t even flying anymore, he was falling. Eyes widening, he tried to use another rocket, only then realising he’d run out, he felt his stomach drop as he plummeted into the ocean below him, hitting the water like a brick and having the air knocked out of him. His ears rung as he tried to figure out which way was up, eventually kicking his way to the surface. He looked around him, noticing that he was only a little ways off from his base, and started swimming in the direction of it, mask still clenched in his hand.</p>\n<p>He dragged himself onto the ring surrounding the main build, collapsing for a moment and trying to regain his breath. He hauled himself up a second later, hurrying inside. He was still running on adrenaline, thoughts darting around his head a mile a minute,</p>\n<p>\n<em>‘I can’t stay here’</em>\n</p>\n<p>This would be the first place the others would look, he couldn’t face them right now, not yet, he was still too overwhelmed, he needed to think- he <em>just</em>-</p>\n<p>Squeezing his eyes shut he took a deep breath in and out. he tried to think rationally, tried to think of a place he could go for a little bit to get away from… everything.</p>\n<p> </p>\n<p>Mumbo flew around frantically, looking for his friend. He still didn’t really know what was going on, or what had happened, just that X had asked him to go find Grian and to make sure he was safe. That really didn’t sit well with Mumbo, the idea that Grian wasn’t safe in some way, but X’s eyes looked desperate under his helmet and Doc looked guilty beyond all belief, so he obliged without a second thought. Racing over the shopping district towards Grian’s base, he tried to think of where he could be, he didn’t expect the hermit to <em>be</em> at his base, but it wouldn’t hurt to check. Landing inside the tower he started his search, he flew up around the upper levels and down below, finding nothing. He stood on the ring outside and rubbed his face, sighing. Grian wasn’t here, and if he ever was, he’d left before Mumbo had arrived. The Redstoner looked out at the water, waves crashing into the side of the tower,</p>\n<p>‘<em>Where else could he be?’</em></p>\n<p>His eyebrows rose as he thought of something, it was a stretch, but… he might be there. Walking over to the edge of the building he jumped into the water, swimming around towards Grian’s first base.</p>\n<p>Reaching the pirate ship, Mumbo swam around it, noticing something red through the foggy glass.</p>\n<p>‘<em>Oh, thank goodness’ </em>he thought in relief, quickly making his way over to the front of the bottle and swimming inside. He shook the water out of his hair, looking to the back of the ship at his friend. It was quiet, the water surrounding them silencing any outside noise, and Mumbo suddenly found himself nervous. Grian was facing away from him, curled into himself on the top of the ships roof, the redstoner swallowed his nerves and stepped towards him lightly, he was sure the builder had noticed him, but just in case he hadn’t he cleared his throat, trying to alert him. When Grian didn’t respond he walked a little closer, climbing up to the same level as him.</p>\n<p>“Grian?” he prompted quietly, still Grian made no sign of acknowledgment. Mumbo was only a few blocks away from him now, he rubbed his hands together anxiously.</p>\n<p>“You shouldn’t be here.” Grian whispered, so quiet that Mumbo almost didn’t catch it. Mumbo took a quiet breath, relieved that he was at least now getting a response.</p>\n<p>“What do you mean?” He asked, Grian didn’t respond this time, instead he curled up on himself more. Mumbo continued,</p>\n<p>“Grian, I… I don’t know what’s going on in your head, or what’s happened to make you think you can’t talk to us but… please, <em>please </em>tell me what’s going on? Whatever it is, you don’t have to face it on your own, you have so many people that care about you and want you to be safe and <em>happy</em> and--”</p>\n<p>“Stop, please just--” Grian forced out, putting his head in his hands. “I don’t- I don’t deserve this, I-”</p>\n<p>“You do! Grian you…” Mumbo trailed off; brows furrowed in concern over his friends’ words. Silence stretched over the ship for a few seconds,</p>\n<p>“I’ve been lying to you all.” Grian muttered, voice hollow, “I’ve been lying to you all and I’m putting you in danger.” Mumbo’s heartbeat sped up, <em>he’s finally talking,</em></p>\n<p>“What do you mean?” He replied, urging him on.</p>\n<p>Grian turned to look at him, Mumbo was taken aback slightly at the expression on his face. His eyes were damp and face stony, dark bags under his eyes. <em>How long had they been there? </em>Mumbo thought to himself guiltily, His thought was cut off when Grian spoke again.</p>\n<p>“I’m a Watcher.”</p>\n<p>Mumbo blinked. Grian looked straight into his eyes, not backing down despite the way his hands shook. He was… what?</p>\n<p>“What… are you--”</p>\n<p>“I came to your world by accident. I put up a shield to block the others off from finding me, but I broke it and now they have.” Grian’s voice was neutral as he spoke.</p>\n<p>Mumbo didn’t know how to respond; he didn’t understand what Grian was trying to say. Despite this, he still needed to comfort his friend,</p>\n<p>“Grian I don’t… I don’t know what you’re talking about but, I’m sure whatever’s happening can’t be dealt with alone--”</p>\n<p>Mumbo was cut off again, Grian huffing in frustration as he got to his feet, turning to look at Mumbo properly,</p>\n<p>“No, you don’t understand! None of you were meant to find out! none of you were meant to get involved! This doesn’t involve any of you and it never should of! I should’ve never come here, I…” Grian trembled as his voice faltered, “I should’ve known this wasn’t going to work, but I was <em>stupid.</em>”</p>\n<p>Mumbo’s jaw clenched as he listened to his friend ramble on. He thought about his next words carefully,</p>\n<p>“Well… Lucky for you Grian, we’re all a little bit stupid around here.”</p>\n<p>Grian blurted out a startled laugh at his friend’s words, which slowly turned into a giggle, Mumbo chucked lightly after him, shoulders loosening a slightly. Grian’s laughter trickled to a stop, the builder sniffling as turned to look out the glass of the bottle for a moment. Before Mumbo could do anything, the builder held out his hand in front of him, palm facing the sky.</p>\n<p>Mumbo looked at him, confused slightly, “What-”</p>\n<p>Grian’s hand ignited, a purple flame rolling around it until it covered it comply, popping and crackling up his wrist. Embers flew off it, twitching around in the air before dying out. Mumbo’s eyes widened and he took a step back automatically. Grian swallowed, suddenly looking nervous,</p>\n<p>“I’m… I’m not like the rest of you, and… I know-I understand if this is too strange or--”</p>\n<p> </p>\n<p>“It’s beautiful.”</p>\n<p>Grian’s eyes widened almost comedically large. Mumbo came closer, eyes full of amazement at the spectacle before him. He touched Grian’s fingertips lightly with his own, intrigued to find that the flame didn’t burn, it almost… buzzed, his fingertips tingled at the feeling. Mumbo’s curiosity was interrupted by a shuddering breath in front of him, the man shot his head up to look at Grian, who now had tears running down his cheeks, still looking at him like a deer in the headlights. Mumbo snatched his hand away, embarrassed,</p>\n<p>“I- sorry I shouldn’t’ve-”</p>\n<p> Mumbo’s rambling was cut off by Grian’s arms wrapping around him, holding him tight as he extinguished the flame in his hand. Mumbo was caught off guard, but in the next second, he had his arms around his friend, hugging him close to his chest as Grian let out all the feelings he’d been trying to deal with on his own for so long. Mumbo stroked his hand through the builder's hair gently, trying to comfort him.</p>\n<p>“Thank you.” Grian sobbed, not even attempting to quell the emotions finally breaking through to the surface.</p>\n<p>“Any time.”</p>\n<p>The two stood there for a while, just holding each other. After a few minutes, Grian pulled away, looking tired and worn out, but as if the weight of the world had been lifted off his shoulders. Mumbo still had so many questions, but taking one look at Grian quelled them for another day, the man in front of him looked like he was going to drop at any moment.</p>\n<p>“Sorry for getting your suit all gross.” Grian mumbled, rubbing his eyes.</p>\n<p>Mumbo looked down, noticing the wet patch from where Grian had been crying into him.</p>\n<p>“Oh, don’t worry about that. I can just wash it.”</p>\n<p> “I got snot on you.” Grian grimaced.</p>\n<p>“Which can also be washed off,” Mumbo rolled his eyes teasingly, “Honestly, we have to swim out of here, it’ll be gone by the time we reach the surface.”</p>\n<p>Grian hummed in response, too tired for conversation. Mumbo noticed, deciding that it was probably time to head back. He told Grian as such and the duo walked back over to the entrance. Grian stopped the redstoner before he could swim out of the bottle,</p>\n<p>“I don’t have any fireworks left.\"</p>\n<p>Mumbo handed him some wordlessly, both of them leaving the base and swimming to the surface. It was getting dark, the sun having just set over the horizon, but it still casted enough light that they could see the mainland. Mumbo turned in the water to look at his friend,</p>\n<p>“Are you going to be able to make it to Hermitville?”</p>\n<p>Normally something like that would’ve been met with a sarcastic reply, some kind of witty comment for Mumbo to bounce off of into banter, but now Grian simply nodded his head. He looked out of it to the point where Mumbo considered just swimming back to his own base and crashing there with Grian for the night. He didn’t get the chance to suggest this however, as Grian (seemingly realizing he would actually have to move to get somewhere) took off into the sky, gliding slowly over to the shopping district, Mumbo followed him, keeping close to make sure he wouldn’t fall. The two landed in front of a portal, Grian’s landing being a little shakier than his friend next to him. he steadied himself, walking into the portal after Mumbo. The walk back to Hermitville was quiet, but it wasn’t awkward, both men taking comfort in the silence of the night around them, content to getting lost in their thoughts.</p>\n<p>He tried not to show it, but Mumbo was still trying to make sense of what had happened. He knew what the Watchers were, kind of, so Grian saying that he <em>was</em> a Watcher didn’t… make sense. He was a… what’d the book call them? A player, like the rest of them, or at least Mumbo had thought so. He stole a glance at the person in question strolling along beside him, <em>he certainly doesn’t look like the figures in the windows, </em>he thought to himself, looking back at the pathway. Still, he couldn’t deny what he’d seen in the glass bottle. It was magic, it had to be, he couldn’t think of anything else that could create a flame like that, let alone one that <em>felt</em> like that. He touched the tips of his fingers with his thumb slightly, remembering the feeling. Mumbo felt his communicator go off, snapping him out of his thoughts,</p>\n<p><strong>XisumaVoid: </strong> <em>have you found him?</em></p>\n<p><em>Oh, right,</em> he frowned slightly. He’d completely forgotten about X and Doc, <em>they’re probably worried sick.</em> He sent back a quick confirmation, saying that they were almost back at the village, before turning his communicator off and putting it away.</p>\n<p> </p>\n<p>It was completely dark once they got back to Hermitville, the glow of torches and lanterns around them illuminating the sleeping town. Mumbo spotted Xisuma sitting on Grian’s doorstep, he had his head rested on the palm of his hand, biting his fingernails. Once he noticed the other two approach he got to his feet, a look of relief washing over him. Mumbo looked over at Grian, who seemed to look more tired by the second,</p>\n<p>“You should probably get to bed, you look knackered.”</p>\n<p>Grian nodded lazily, shuffling past X into his house, shutting the door behind him. X looked back over to Mumbo, concern obvious on his face,</p>\n<p>“Is he alright?”</p>\n<p>Mumbo sighed, running a hand through his hair,</p>\n<p>“Yeah, yeah he’s okay. He ended up flying back to his starter base,” Mumbo frowned, “What even was that? What’d you guys do?”</p>\n<p>X grimaced guiltily, he sat back down on the steps of the house and put his head in his hands,</p>\n<p>“I don’t know, it was just- we’d come over to try and see if we could talk to him, but he wasn’t home. I don’t know why we started snooping around but we did, and we ended up going down into his basement? I think that’s what it is, it's like an empty room way underground. All that was in there was a chest and it had this, mask in it. It looked like one of the masks from the windows in that chapel in the desert? With the symbol on it. We were trying to figure out what to do when he got home.”</p>\n<p>Mumbo sat down next to him, listening intently.</p>\n<p>“He looked really startled that we were in there, I tried to get him to talk to us but… it kind of just went downhill.”</p>\n<p>X leaned back, resting his head on the door and looking up at the sky. He fidgeted with his hands subconsciously,</p>\n<p>“Doc started getting mad, and then Grian got angry, and it just spiralled from there. Doc feels awful about it; says he doesn’t know what came over him.”</p>\n<p>Mumbo hummed. He considered whether he should tell X about what Grian had shown him at the base, eventually deciding against it. It wasn’t his secret to tell. He’d make sure Grian told the others about it in the morning, however. Mumbo looked back over at X, even with the helmet on he could tell how exhausted he was.</p>\n<p>“You should go get some rest too, its been a long day for everyone I think.”</p>\n<p>X nodded, pushing himself to his feet. He turned to look at Mumbo for a moment,</p>\n<p>“Thanks for going to get him, I don’t think he would’ve liked either me or Doc going after him.”</p>\n<p>“No worries.” Mumbo smiled softly, watching his friend walk off back in the direction of his house. Mumbo stood from the steps as well, frowning slightly as he looked at the house behind him.</p>\n<p>\n<em>‘I’ve been lying to you all and I’m putting you in danger.’</em>\n</p>\n<p>What had Grian meant by that? The redstoner walked back over to his own house, the thought playing on repeat in his head until he got into bed, finally falling asleep.</p>\n<p> </p>\n<p>Grian woke up exhausted, he sat up in his bed and rubbed his tired eyes, disorientated. In the next moment however the memory of last night rushed up to greet him, his eyes going wide as he remembered what had happened.</p>\n<p>\n<em>Oh. </em>\n</p>\n<p>\n<em>Shit.</em>\n</p>\n<p>He’d told Mumbo. He’d told him about being a Watcher, and his magic, <em>why did he do that—</em></p>\n<p>Grian’s anxiety was cut off by a knock on his door, half tempting him to try and run again. He fought against the instinct, shuffling over to open it. Mumbo stood outside, looking slightly surprised that the door had opened.</p>\n<p>“Oh! Hey.” He smiled.</p>\n<p>“Hey.” Grian croaked, clearing his throat, “Sorry, I just woke up.”</p>\n<p>“Oh, no that’s fine.”</p>\n<p>The two stood there for a moment awkwardly.</p>\n<p>“Can I come in, please?”</p>\n<p>Grian blinked out of his daze, still very much half asleep,</p>\n<p>“Oh! Right, yeah sure, come in.”</p>\n<p>He moved out of the way, making room for his friend to walk inside. Mumbo did, walking to the bed and sitting on the edge of it. The silence from before picked back up, and Grian didn’t know what to say.</p>\n<p>“Would you believe me if I told you everything that happened last night was a prank?”</p>\n<p>Mumbo raised an eyebrow at his friend.</p>\n<p>Grian sighed, “Right. Couldn’t hurt to try.”</p>\n<p>Mumbo patted the bed next to him, beckoning him to come over. Grian reluctantly did, sitting next to his friend. He stared down at his hands in his lap, refusing to make eye contact.</p>\n<p>“So,” Mumbo began after a moment, “You’re… a Watcher?”</p>\n<p>Grian felt his throat close up. Oh boy, ok, they were doing this now. He swallowed down his anxiousness and continued to stare down at his hands, encouraging himself to say something.</p>\n<p>“I… yes. Kind of.” Grian breathed.</p>\n<p>“Kind of?” Mumbo prompted. He tried to keep a calm tone to his voice, not wanting to freak Grian out with his questions. This was obviously something he was having a hard time talking about.</p>\n<p>Mumbo’s eyes widened as he realized something,</p>\n<p>“You’re the ‘Saved One’, aren’t you? The one from the window.”</p>\n<p>Grian gave his friend a sad half-smile, “Yeah, that’d be me.”</p>\n<p>Mumbo rested back against the wall, processing this new information. The two of them sat in silence for a minute, it was later in the morning, the sounds of birds and people trickling through the windows and under the door. Mumbo turned his eyes to his friend, who was still looking down at his hands.</p>\n<p>“You’re going to have to tell them.”</p>\n<p>Grian bit his lip, “…I know,” He hesitated.</p>\n<p>“Hey,” Mumbo shifted forward and put his hand on Grian’s shoulder, “It’s going to be alright. Even if we don’t understand it completely, we all care about you, you know? We want you to be able to trust us with stuff like this.”</p>\n<p>Grian put his head on Mumbo’s shoulder silently. He didn’t know what to think. He knew, deep down, that his friends cared about him, he had no reason to think otherwise, but that’s what scared him. The more they cared about him, the more they’d be willing to risk for him, the more chance there was for the Watchers to use that against him, use it to hurt them. There was also now the issue of him leaving. He was still going to, he had to, but if the others knew that…</p>\n<p> </p>\n<p>There was another knock at the door. Grian got up to answer it, finding a very nervous and very guilty looking Doc on the other side.</p>\n<p>“Hey man…” Doc rubbed the back of his head.</p>\n<p>Grian blinked, a little startled to see Doc again so soon after last night.</p>\n<p>“I wanted to just come over and apologize for being a dick yesterday, I really don’t know what came over me. I should not have yelled at you like that.” Doc looked him in the eyes, an awkward smile plastered on his face.</p>\n<p>Grian smiled back at him, “It’s alright, I wasn’t exactly being very honest with any of you… I understand why you were angry,” Grian fiddled with the door, swinging it back and forth slightly “Sorry for yelling back at you.”</p>\n<p>“So… we’re good?” Doc confirmed, pointing a finger gun in Grian's direction.</p>\n<p>Grian chuckled, “Yeah, we’re good.”</p>\n<p>Doc looked relieved, breathing out and relaxing his shoulders, “Great! Great, ok, well. I’ll see you around.” Doc nodded, giving Grian a little wave before turning on his feet and half jogging down the road. Grian watched him go for a second before he shut the door, looking back to Mumbo who was still sitting on his bed.</p>\n<p>“Everything alright now?”</p>\n<p>“Yeah, I think so.”</p>\n<p>Grian leant back against the door, suddenly feeling… confident? He wasn’t sure what it was, but he felt sure of himself. Grian looked at his moustached friend, determined.</p>\n<p>“I’m… I’m going to tell the others. Today. Right now, actually.” Grian decided.</p>\n<p>Mumbo’s brows raised, “Right now as in… <em>right</em> now?”</p>\n<p>Grian nodded his head quickly, walking over to a chest and grabbing his Elytra.</p>\n<p>“Yeah, yeah it’s got to be now, otherwise I don’t think I ever will.”</p>\n<p>The longer Grian sat at the table in Sahara’s meeting room, the more he started regretting this.</p>\n<p> </p>\n<p>The only reason he hadn’t called it off already was because Mumbo was sitting right beside him at the head of the table, the two had made extra chairs for the other hermits that would be arriving soon, Mumbo’s chair being pushed up against Grian’s in an attempt to make enough space. Neither of them said anything, and Grian was tapping his fingers on the table anxiously. He’d picked the Sahara meeting room for this because it was the first place he could think of that would be able to fit everyone, and he’d sent a message asking everyone to come over as soon as him and Mumbo had finished setting up. He didn’t think twice about any of this, actively refusing too. He knew if he did, he’d start panicking and nothing would ever come of it.</p>\n<p>“Hey?” Grian and Mumbo turned to look behind themselves, Iskall stood at the doorway awkwardly, “What’s going on?”</p>\n<p>“There’s uh- there’s somethings I’ve got to tell everyone so… I needed to get everyone in one place.” Grian muttered, almost unable to look his friend in the face. Iskall’s confused eyes moved to Mumbo,</p>\n<p>“We’re waiting for everyone else to get here before anything,” the redstoner explained, he gestured to the table before him, “You can come sit and wait with us if you’d like.”</p>\n<p>Iskall took a seat to Grian's left, he still looked confused and slightly worried, but he set aside his questions for when the others would arrive.</p>\n<p>The others started to trickle in slowly, eventually filling the meeting room. TFC was the last one to enter, nodding at Grian as he sat down at the end of the table. A thick silence blanketed the room, no one was really sure what this was about. Grian broke the silence, clearing his throat,</p>\n<p>“So, I’m sure you’re all probably wondering why I asked you to come here.”</p>\n<p>“If this is some kind of stunt to get us to shop at Sahara, then Concorp wants no part in it.”</p>\n<p>A few of the other hermits giggled, the tension in the room lessening a little at Cubs joke, Grian forced out a laugh with them, trying to relax.</p>\n<p>“Uh, no-no this doesn’t… have anything to do with Sahara, I just- this was the easiest place to get everyone, so…” Grian trailed off, the room going quiet again as the others drew their attention back to the builder.</p>\n<p>“If it’s not Sahara related… what is it?” Ren tilted his head, leaning on the table in front of him.</p>\n<p>Grian felt cold suddenly, his stomach dropping,</p>\n<p>“Well, the last few weeks, I’ve been… acting strange, and I know you’ve all noticed by now, so I’m sorry if I was worrying anyone but… there is a reason why I was keeping to myself.”</p>\n<p>The hermits looked at him keenly, no one saying anything as they waited for Grian to continue. Grian suddenly became very aware of how many eyes were actually on him in that moment, his own eyes fluttering around everyone’s faces as he realized, <em>yes, you’re actually about to do this</em>. He took a breath, trying to force himself to calm down, but he could feel his hands start to shake under the table. He clenched his teeth subconsciously, trying to clear his head, he needed to calm down<em>, he couldn’t think—</em></p>\n<p>Mumbo grabbed his wrist under the table, grounding him. Grian glanced at the man next to him and Mumbo looked back, a reassuring smile on his face. Grian took a less shaky breath, he needed to get it out, just rip it off like a Band-Aid.</p>\n<p> </p>\n<p>“I’m a Watcher.” He forced out in a breath. He looked down at the table, drawing into himself. The others looked at each other, confused.</p>\n<p>“Wait, I’m not following,” Scar admitted, looking at the man, “What’re you talking about?”</p>\n<p>Grian swallowed, using the hand Mumbo wasn’t holding to rub his arm,</p>\n<p>“It’s… it’s a long story but… a long time ago, I used to live in another world. We called it Evolution, Evo for short, and… the Watchers looked over it. Two of them did, anyway. They were horrible, they treated us like we were… toys or something, they messed with our lives and changing things whenever they wanted. I tried to stand up to them, I didn’t let them get to me as much as I could but… that only made them more interested in me. During one of the world’s updates they just… took me, stole me away from everything I everyone knew, and I couldn’t do anything to stop them.” Grian could feel his eyes dampen at the memory, but he tried to push it aside, if he stopped talking now, he’d lose his nerve.</p>\n<p>“The Watchers told me they’d <em>saved me,</em> tried to convince me what they did was a good thing and that I should be grateful that they <em>saw potential in me</em>. I… there was nothing I could do so I just… tried to believe them. They gave me magic, and wings and everything. I was still treated like I was beneath them but… I don’t know.”</p>\n<p>“You have magic?” Iskall asked softly.</p>\n<p>Grian looked at him for a moment before lifting his hand in front of him, pointing it towards a pencil that sat near the middle of the table. His hand lit up, purple light crackling around his fingertips as the pencil glowed the same colour, lifting into the air a few inches. The hermits gawked at it, watching as it hovered there for a few moments before the light went out and it landed back on the table.</p>\n<p>“Holy shit…” Cleo muttered, leaning back in her chair, her eyes wide in astonishment.</p>\n<p> </p>\n<p>“How… <em>Why</em> have you never told us this before?” Xisuma furrowed his brows, looking at Grian bewildered.</p>\n<p><em>This is it, </em>Grian thought to himself, <em>this is where I need to make them understand.</em> He straightened up in his chair, pulling his hand away from Mumbo to clasp them in front of himself.</p>\n<p>“I never told any of you because if I did, it would’ve put you all in danger. I’m only telling you about all of this now because I… I don’t have any other choice.” Grian took a deep breath, thinking about his next words carefully, “When I was still with the Watchers, I was able to go visit Evo. I wasn’t allowed to interact with anyone or anything, not that I could anyway, but I was still able to see everyone. I used to spend all my time there and… and the Watchers didn’t like that.</p>\n<p>“They destroyed it. They destroyed everyone and everything in that world and I… I couldn’t do anything to stop them. They said they did it because I was <em>too attached to mortality, </em>and <em>I needed to let that part of me go.</em> They killed everything I cared about because I wasn’t acting how they wanted me to.”</p>\n<p>Grian kept his voice steady as he spoke, the other hermits looking at him in shock as they tried to process what they were hearing. Grian kept going,</p>\n<p>“I escaped them, after that. Used all my magic to run to a random world and seal it off so they wouldn’t be able to find me, that world being… this one. I had no idea there would be anyone else here and if I had I… I wouldn’t’ve stayed.</p>\n<p>I was the one that took the update barrier down, but when I did, the protection spell I had cast got used up accidentally and… now they’ve found me.”</p>\n<p>Grian looked at the others, desperation in his eyes.</p>\n<p>“I <em>can’t</em> let them hurt anyone else, and I can’t go back there, with them. So… I’m going to leave, find a new world that doesn’t have anyone else in it and stay there. I’ve been practising using my magic again and once I’m strong enough, I’ll create a portal and go and… none of you will have to get involved any more than you have already. You’ll all be safe”</p>\n<p>Grian held his breath, hoping that he’d gotten through to them, that they understood why he had to do what he had to do.</p>\n<p> </p>\n<p>“No.”</p>\n<p> </p>\n<p>Grian whipped his head around to Mumbo, who was looking at him sternly, his eyebrows drawn down, “Grian you can’t just… leave.”</p>\n<p>“Mumbo’s right,” Iskall agreed, “You shouldn’t give up this quickly.”</p>\n<p>Grian shook his head, “This isn’t me ‘giving up’, this is me trying to keep you all safe.”</p>\n<p>“Well, maybe…” Joe started, a thoughtful expression on his face, “Maybe you can focus on keepin’ us safe, and we’ll focus on keepin’ you safe.”</p>\n<p>False nodded, “Exactly. Plus, Grian, who’s to say those Watchers won't just go after you again once you leave?”</p>\n<p>“I… it wouldn’t- it wouldn’t matter, they’d be away from… you all, they…” Grian stammered looked around the table in disbelief. He couldn’t believe what he was hearing, he had expected them to not want him to leave but… for some reason hearing it out loud was different.</p>\n<p>“Grian,” Mumbo drew the builder’s attention back to him, a serious look in his eyes, “Does any part of this plan secure your own safety, or are you just trying to sacrifice yourself for us?”</p>\n<p>Grian swallowed thickly, not knowing how to answer. He hadn’t… really thought about it. All his faith in his plan came from the need to just, keep everyone else safe--<em>alive. </em>Thinking it over, he realized until now he hadn’t even really thought about what he’d do once he’d leave Hermitcraft.</p>\n<p>“If worse comes to worst, if absolutely nothing else has worked and we’re at our last option, we’ll let you try this idea,” Xisuma decided. Mumbo looked like he wanted to object, but X continued to talk before he could say anything, “Grian, you don’t have to deal with this on your own. You’re not going to, this is our world as well, and we’re not going to sit back and just let it get hurt.”</p>\n<p>Grian lent back into his chair, feeling defeated. This isn’t how he wanted this to go, this wasn’t how it was <em>meant </em>to go, but despite this… he felt better. Knowing that his friends finally knew about everything felt good. It was the first time in a long time, not since Evo at least, that he truly felt… <em>free</em>.</p>\n<p>“…Alright.” he sighed, smiling unconfidently, “I… I trust you guys.”</p>\n<p>Grian couldn't exactly blame the others for treating him a bit like glass now. It’s not like they were doing it on purpose, at least Grian didn’t think they were, but he couldn’t help but feel… weird when he saw it happen. It's just the little things, like when they sometimes stop talking and change the subject when he walks over, or how they’ve stopped teasing him back when he tries to start some banter. It's coming from a good place, he knows they’re just trying to make him happy but…</p>\n<p>Grian huffed, sitting on top of his house. The very top of his house. He looked down far below him, the rest of the town looked small from up there, the competition between himself and the other members of Sahara Street (minus Stress) had given him a pretty good vantage point to see how the rest of the town was coming along, and he had to admit it, it looked pretty cool. Despite the different types of builds, what with Mumbo’s apartment of house and the smaller Sahara just up the road, everything managed to mesh together nicely. Grian took off, gliding slowly to the ground as he let his mind wander, he needed to find a way to get the others to relax a little around him.</p>\n<p>He landed outside his house and walked inside, standing in the front room for a moment as he thought. His eyes glanced to the hole in the floor by habit, he hadn’t bothered closing it up now that everyone knew. He still hadn’t really gotten used to it yet if he was honest, the first couple times another hermit had mentioned his magic to him he’d felt himself get anxious automatically before remembering. He walked over to his mess of a storage system, if he could even call it that, and started rummaging around it half-heartedly, he opened his inventory to put away whatever junk may have been lying around it. His eyes stopped when he saw his mask, still sitting there from days prior. He hadn’t had a chance to put it away somewhere, the busyness of the last few days having kept him preoccupied. He grabbed it and held it in his hands for a moment, to think everything that’d happened was because of one little mask. He opened his enderchest, shoving it away and out of his sight before going back to his mess of chests and shulker boxes.</p>\n<p>He really needed to get some kind of storage system, not that he knew what he was actually looking for, if anything-</p>\n<p>He stopped, looking down into the shulker box he’d just opened. He grinned, eyes devious and sparkling,</p>\n<p>He knows what he’s going to do.</p>\n<p> </p>\n<p>Scar, all in all, was having a good day. He sat on top of the newly made observatory at the edge of Sweet Berry, looking over the layout of the rest of the town, Jellie laid next to him, fully content to stay there and soak up the sunlight. Scar smiled lovingly at her, scratching behind her ear gently, overall it seemed crashing a rocket-ship into a house and being arrested wasn’t the worst way to spend your time.</p>\n<p>The sound of clucking broke him out of his good mood and he turned his head, looking behind himself at the baby chicken that was now sitting with them on the roof. Scar blinked, his mind trying to catch up with whatever this was as he stared at the baby chicken. Jellie turned to look at the intruding bird as well, confused as to why she’d suddenly stopped getting pet. Before Scar could do anything, more clucking from in front of him caught his attention, and he spun his head around to see what looked to be around thirty baby chickens now wandering around on the ground.</p>\n<p>Thoroughly confused, he picked up Jellie and jumped down, trying his best to not land on any of the little birds as he did so. Did these just spawn all at once…? No, no that didn’t make sense. He only realized what this was when he heard giggling from behind the wall of the observatory, sighing deeply, he turned to face the culprit,</p>\n<p>Only to get an egg to the chest.</p>\n<p>“Wh- <em>Grian!” </em></p>\n<p>The feathered man's giggles became a cackle as he took off, throwing more eggs as he went,</p>\n<p>“I don’t know a Grian, sorry!” The man laughed, flying away from the now chicken occupied town. Scar stood there dumbfounded. This… this was the absolute last thing he had been expecting today. But despite the chickens and eggy mess now running down his shirt, he couldn’t help but chuckle, it was nice seeing Gr-… <em>Poultry Man, </em>out and about again. A flock of chickens ran past him, clucking about in panic as Jellie chased them around.</p>\n<p>Grian was still laughing to himself when he got home. He walked inside and put the chicken mask back into storage, content with the day’s mischief. The day was still young, however, and only minutes after, Grian’s communicator went off.</p>\n<p> </p>\n<p><strong>MumboJumbo:</strong> <em>hey, Iskall and I are doing some final touches to stuff at Sahara if you want to come over :)</em></p>\n<p>Grian grinned, not even giving it a second thought as he typed out a yes, walking back his door.</p>\n<p> </p>\n<p>Iskall and Mumbo were in the front area when he arrived, looking over the ordering system. Both lit up when they saw him, waving him over. The three spent the next hour or so goofing around, Grian messing with the Redstone and totally not breaking it while the other two followed him around, totally not fixing the totally not broken Redstone. Eventually, the trio found themselves outside, Iskall and Grian talking quietly on the ground while Mumbo stood up above them, finally fixing the window that he’d been meaning to for so long. He glanced down behind himself, watching Grian laugh at something Iskall had said. He smiled, glad that the builder was finally opening up again, the contrast between Grian now to Grian even just a few days ago, when he was holding the weight of his secret all on his own, was incredible. Mumbo was so caught up in his thoughts that he wasn’t paying attention, and one second he was standing on the window ledge,</p>\n<p>And the next he was falling.</p>\n<p>No time to think about the fact that he didn’t even have an elytra on, he squeezed his eyes shut, bracing for the impact that would definitely send him back to his bed. Except instead of the hard-concrete ground, Mumbo felt himself lurch to a stop in the air, turning his stomach and making him feel slightly sick, but ultimately unharmed. He slowly opened his eyes, looking around himself. He was hovering above the ground about a foot in the air, a purple glow surrounded him from head to toe. He shifted his eyes over to his friends, Iskall stood frozen in shock, and Grian had his hands out, both glowing and sparking with purple magic. The three stood there for a moment before Grian dropped his arms, the magic in his hands and around Mumbo dissipating. Mumbo landed on the ground, still looking at Grian with wide eyes.</p>\n<p> </p>\n<p>Grian started to look nervous at the silence, but before he could say anything Iskall shouted behind him,</p>\n<p>“Grian! Dude that was incredible!” Iskall ran up to the builder, throwing a hand around his shoulder as he grinned like an excited puppy. Grian looked startled for a moment before relaxing, looking away from his enthusiastic friend a little sheepishly,</p>\n<p>“I didn’t- I didn’t really do it on purpose, I just saw him fall and, reacted.” Grian looked over to Mumbo, who was now lying on his back, trying to regain his breath and slow down his racing heart a little. Grian detached himself from Iskall, walking over to the redstoner to look down at him. He crossed his arms,</p>\n<p>“So. Why were you not wearing an Elytra, you absolute <em>spoon.</em>”</p>\n<p>Mumbo had his arm over his face, not looking at Grian,</p>\n<p>“…Because I’m an absolute spoon?” he mumbled.</p>\n<p>Grian snorted, holding his hand out to help the man to his feet. Mumbo sighed as he stood, rubbing his head.</p>\n<p>“It broke before I’d even gotten here, and I’d completely forgotten about it. I have another one at home, but I don’t even know if it’s worth getting now.”</p>\n<p>Without a word Grian took off his elytra, handing it to his friend,</p>\n<p>“Here, you can use mine to go grab it if you want.”</p>\n<p>Mumbo looked surprised, grabbing the elytra thankfully. He thanked his friend, putting it on before jogging over to the entrance,</p>\n<p>“Won’t be a tic!”</p>\n<p>Mumbo disappeared around the corner, the sound of fireworks going off as he went. Grian’s attention was drawn back to his other friend who grabbed his shoulders, spinning him around to look at him dead in the eyes,</p>\n<p>“Grian. Grian I have an idea.”</p>\n<p> </p>\n<p>Mumbo flew back towards Sahara a few minutes later, his own elytra strapped to his back and Grian's stored safely away in his inventory. He ducked under the ribbon wrapped around the entrance and wandered inside, looking for the other Architech’s. What he saw instead was Grian staring straight up at the sky, his hands alight with magic, Mumbo’s brow furrows as he walked over.</p>\n<p>“What’s going on?”</p>\n<p>Grian looked towards him, his hands extinguishing as he waved.</p>\n<p>“Oh! Nothing much, Iskall had a really good idea.” He said pleasantly, the hint of mischief in his eyes making Mumbo nervous. Before Mumbo could ask what that ‘really good’ idea was, both of them looked up as an excited shout rang out throughout the sky. Mumbo’s eyes went wide as he watched Iskall fall towards the ground, gaining speed ridiculously fast.</p>\n<p>“Grian!--”</p>\n<p>Mumbo’s worried shout was cut off as Grian raised his hands back up, his magic catching light as he grabbed Iskall with it and nothing short of flung him around Sahara’s courtyard. Iskall laughed maniacally as he flew around in the air, much faster than any elytra could ever go, Grian laughing along with him as he moved his friend up and down and around.</p>\n<p>Mumbo simply watched, gobsmacked. This could not be safe, nothing about this could be safe in the slightest. He looked over to Grian to say as such, but his words caught in his throat when he saw Grian’s expression, the spark of mischief had grown into ablaze, a shit-eating grin now clear on his face as he looked at Mumbo straight in his eyes.</p>\n<p>“Grian. Don’t.” Mumbo warned, taking a step backwards.</p>\n<p>If possible Grian’s grin grew wider, he slowed down Iskall in the air slightly as he focused on Mumbo.</p>\n<p>“Grian. <em>Grian DON’T, <strong>GRIAN--” </strong></em></p>\n<p>The Redstoner’s pleas were ignored as he was flung into the air, stomach dropping as he was flown around in a circle with Iskall, who was now laughing so hard that he was silent, doubled over in Grian’s magic. Grian was laughing up at the two of them from the ground, taking way too much pleasure in sending his friends tumbling through the air.</p>\n<p>“Grian! Put me down!” Mumbo yelped, he tried to right himself as Grian hung him upside down, his tie flopping into his face and his jacket ruffled.</p>\n<p>Iskall tried to catch his breath, “B-But dude! No- look you-you don’t even need to use an elytra now!” The man wheezed, setting himself off into another fit of laughter with his own joke. Mumbo rolled his eyes, his stomach lurching again as Grian righted him, setting both of them back down on the ground. Mumbo lent over, resting his hands on his thighs as he tried to catch his breath.</p>\n<p>“Oh, this- this is the <em>worst</em>! You have way too many options to mess with everyone now!” Mumbo laughed, exasperated.</p>\n<p> </p>\n<p>Grian giggled softly, rubbing his eyes as he tried to not show the fatigue that rolled over him in waves. The builder watched the other two laugh, a feeling of pride blossoming in his chest. If you had told him a week prior that he’d be using his magic like this he would’ve never believed you, but now… now his magic felt like something good, something that didn’t have to be used for destruction.</p>\n<p>Something that he finally had control over.</p>\n<p>Sahara was finally going to open. After months of building, and Redstoning, and end busting for shulker boxes, they were finally ready. Grian almost couldn’t believe it, the thought that this giant project that’d taken up most of their time was finally coming to a close. He was excited, every Architech was, but now left the question: what were they going to do for the opening? They knew they wanted some kind of event but, they weren’t sure what. In the end, none of them even got to think about it, False setting up her tent and queue along with Ren parking his camper van right out the front of the shop made it pretty clear what was going to happen. The trio spent the next few days preparing for the grand opening, deciding that it would be held that weekend, which gave them time to work on any last-minute things that might rear their heads, along with giving Grian time to hand out invitations.</p>\n<p>Well, hand out invitations if you consider flying past your friends at top speed while throwing paper and eggs labelled <em>come to Sahara’s Grand Opening Saturday! </em>‘handing out’. It got the job done regardless, and Grian was having fun throwing things at people. He was passing over a forest near the medieval district when he saw the Watcher Obelisk, its obsidian walls creating a jarring contrast to the greenery below. He wasn’t planning on stopping, but he found himself flying towards the opening near the top of the tower regardless, landing on the upper level. It was dark inside, despite the large opening he had just flown through, the obsidian soaking up the light from and creating an eerie atmosphere. Grian looked around, the floor was made of stone slabs, the entrance to a spiral staircase going down to his left. A Watcher symbol was engraved into the ground using bedrock, the sign of a real Watchers power having been used to create the structure.</p>\n<p>Grian knew what would be in this building, creating hundreds of these kind of ruins the mystery after a while. There’d be some kind of dumb riddle or poem on the first floor, then chests with rewards on the next, maybe a dungeon or maze underneath everything. Real spooky.</p>\n<p>Realizing that he’d get nothing out of actually being here, Grian went to take off again, stopping when he heard something downstairs. Curious, he walked down the staircase, finding Stress at the bottom kneeling in front of a chest. Grian watched her rummage around in it for a moment before she closed it, turning around and jumping when she saw Grian standing there.</p>\n<p> </p>\n<p>“Blimey, when’d you get here?” She breathed, standing upright.</p>\n<p>Grian shrugged, “About a minute ago, flew in from upstairs.”</p>\n<p>“Right, right.” Stress nodded, looking around the room casually. Her eyes turned upward, “Anythin’ interestin’ up there then?”</p>\n<p>Grian shook his head, “Nah, it’s empty, there’s probably something under the tower if you haven’t looked yet though.”</p>\n<p>“Ya reckon?” She replied, sitting on the chest she’d just been looking through.</p>\n<p>“Yeah well, when you build enough of these things, they start getting a bit predictable.”</p>\n<p>Stress’s eyes widened in realization at his words, she leant back on the chest and nodded her head slowly, “Right… right, yeah I didn’t even think… you’d probably know these things inside and out, huh?”</p>\n<p>Grian nodded lazily, she wasn’t wrong. The Watchers very rarely went off the book when it came to structures, sure puzzles and clues and challenges got changed around often, but the buildings they were held in weren’t. Grian had found it annoying at first, wanting to experiment with different blocks and designs, but after a while he was grateful for it, being able to build without actually thinking about the building he was making. Stress was quiet, looking away from the builder almost guiltily.</p>\n<p>Ah.</p>\n<p>He hadn’t meant to make this awkward.</p>\n<p>“It’s good you guys are still coming to these things, honestly. Not a good idea to get on the Watcher’s bad side.” He chuckled, rubbing the back of his head. Stress hummed, unconvinced,</p>\n<p>“Still. Don’t feel right takin’ stuff from people who’ve hurt you.” She muttered.</p>\n<p>Grian blinked, taken aback. This wasn’t the direction he was expecting this conversation to go. Before Stress could get another chance to speak, Grian grabbed a handful of invitations from his inventory, throwing them down at her from his spot at the top of the staircase. She watched a little dumbfounded as they fluttered to the ground, creating a mess of paper on the floor in front of her. Grian looked at her for a moment before grinning,</p>\n<p>“See you on the weekend!”</p>\n<p>And with that, he turned on his heels, jumping back up the stairs and taking off without a second thought.</p>\n<p> </p>\n<p>The weekend arrived sooner than any of them could’ve expected. The rest of the hermits were quick to save their spot in the line, pitching tents outside the building, or in Concorp's case, pitching a whole mini canteen to sell food and drink to the waiters in line. Grian found that funny along with a little ridiculous, but if it got Cub and Scar to show up then he wasn’t going to complain. The plan was to open the store on Sunday but have everyone over for some kind of camp out the Saturday night, and as much as it was for Sahara, it was also just a way for everyone to hang out together, which is something they all desperately needed. Grian couldn’t even remember the last time he’d seen everyone in the same place, well, apart from the other day when he’d told them all about the Watchers, but this was exceptionally more fun.</p>\n<p>The sun was setting, casting a golden hue over the hermits as they started to get ready for the night ahead. Mumbo and Iskall were setting up a campfire while Ren and Doc stood near Ren’s camper-van, chatting about something quietly. The rest of the hermits were either setting up their tents or still arriving, the area filling up quickly. It all felt very homey, no one was worried about anything, simply enjoying each other’s company as the sun set. At some point, someone started playing music, and the night began.</p>\n<p>Grian sat near the campfire, warming himself up against the cold night. Jellie sat in his lap, soaking up the heat with him. He pet her absentmindedly, giggling when he saw Scar pouting in his direction, mouthing ‘<em>traitor’</em> at Jellie from the Concorp canteen Cub wouldn’t let him leave. Across from him, Iskall was telling Cleo about how Grian had used his magic to save Mumbo the other day, going on about how cool it was when he’d gotten to fly around in it.</p>\n<p> </p>\n<p>Grian suddenly felt overwhelmed. He wasn’t sure… why, but one moment he was perfectly content with sitting around with his friends and the next… the light quickly became too bright and music too loud. He stood up, putting Jellie down gently as he walked away from the commotion. He ducked under the red ribbon over Sahara’s entrance, trying not to draw attention to himself as he slipped away from the party. He walked to the courtyard, taking comfort in the dull glow of the touches and faded music from behind him. He breathed deeply, the cold night air wrapping around him. He sat on the edge of the water feature, running his hand thought the water as he let his mind drift.</p>\n<p>“You doin’ alright there?”</p>\n<p>Grian turned to look at Joe who was looking at him with a small smile, arms wrapped around himself against the cold, his shirt not doing much to keep out the chill.</p>\n<p>Grian nodded a little, “Yeah, I’m alright. I think everything just… got a bit too much.”</p>\n<p>Joe hummed in reply, he gestured next to Grian, “Mind if I join ya’?”</p>\n<p>“Oh, sure, go ahead.”</p>\n<p>Joe sat across from the builder, crossing his legs as he looked down into the water next to them. They sat in content silence, listening distantly to the others outside, the music muffled.</p>\n<p>“It was nice for you boys to set up this shindig, always nice to see…” Joe trailed off as he thought about how to finish that sentence, his normal rhythmic patterns failing him in the moment. Grian cocked his head at him, shooting him a confused looked. Joe huffed after a moment, shifting his glasses slightly as he rubbed his eyes.</p>\n<p>“Are you okay?” Grian asked quietly, leaning forward.</p>\n<p>Joe sighed, “I’m alright, just not on my A-game today, been real tired recently.”</p>\n<p>“Tired?” Grian prompted.</p>\n<p>“I’m not sure what it is, really. I keep having these dreams, nightmares I suppose, but I always forget them before I wake up.” Joe smiled at his friend, noticing the worried expression on his face, “It’s nothing bad, just means I’m yawnin’ a little more thought out the day.”</p>\n<p>Joe cleared his throat, “At any rate, I came over to cheer you up, not the other way around.”</p>\n<p>Grian let out a small laugh, looking back into the water next to him.</p>\n<p>“I’m alright, it’s just…” Grian stopped, curling into himself subconsciously, “I’ve been thinking about my old world a lot, I guess.” He mumbled.</p>\n<p>Joe nodded compassionately, remaining silent as he waited for Grian to continue.</p>\n<p>The builder took a breath, trying to ignore the way his eyes stung at the thought of Evo, “I think… just seeing everyone together like this reminded me of them.”</p>\n<p>“Did you all get together a lot, then?” Joe asked softly.</p>\n<p>“Yeah. We’d always go after the next Watcher portal together, so none of us would get left behind. Sometimes we’d go in groups to check out buildings or clues but that was normally just me and…” Grian trailed off, eyes unfocused as he looked at the water, “…me and Taurtis.”</p>\n<p>Grian shook his head, rubbing his eyes as he snapped himself out of his memories, “Sorry, I don’t- I’m being a little ridiculous-”</p>\n<p>“Nothing ridiculous about grief, Grian.”</p>\n<p>Grian felt like the air had been knocked out of his chest, he blinked as Joe’s words sank into him, Grief was a heavy word, and it felt wrong on his tongue as he played it over in his head. He’d been trying to avoid thinking about Evo the almost year he’d been on Hermitcraft, so maybe… he hadn’t really gotten a chance to properly get over what had happened. He wiped his eyes again, not wanting to get more emotional than he already was.</p>\n<p>“We- we should go back before… anyone else gets worried.” Grian deflected, getting to his feet hurriedly. Joe followed, grabbing Grian's jumper before he could run off.</p>\n<p>“Grian… it’s alright to be upset, you know? What happened to you… you didn’t deserve that.”</p>\n<p><em>Neither did they, </em>the builder thought to himself bitterly. He gave Joe a smile,</p>\n<p>“I know, I’ll- I’ll be alright. Thanks for coming to check on me.”</p>\n<p>“Always.”</p>\n<p> </p>\n<p>The two walked back over to the entrance, ducking under the ribbon to see the party raging on just as much as when they left. False called over when she spotted them,</p>\n<p>“Oi! I’m first in line, better not be giving Joe a look around before it’s even open.”</p>\n<p>Grian snorted, his mood lightening a little as he walked further into the crowd. The night was still young, and he wasn’t going to let his head stop him from enjoying it anymore.</p>\n<p> </p>\n<p> </p>\n<p>Grian knew he was dreaming from the moment he opened his eyes.</p>\n<p> </p>\n<p>He looked around himself, not sure where he was meant to be. Every direction was black, it looked like it stretched on forever, kind of like his infinity rooms. Maybe it did. He picked a direction and started walking, not wanting to stay in the same place for too long.</p>\n<p>“<em>Hello, Diamond.”</em></p>\n<p>Grian froze, throat closing up at the sound of <em>that voice. </em>He tried to swallow down his fear, not wanting to give them the satisfaction of seeing him afraid. He turned to face them, standing his ground.</p>\n<p>“Braid.”</p>\n<p>The Watcher loomed over him a few feet away, their braided hair flowing slightly as if they were underwater, they grinned at the name,</p>\n<p><em>“It’s so lovely to hear your voice,” </em>The Watcher laughed lightly, walking towards him, <em>“After you abandoned us, I thought I was to never hear it again.”</em></p>\n<p>Grian clenched his hand at the word abandoned, keeping his face devoid of emotion.</p>\n<p>“What are you doing here?” He deadpanned, unable to stop himself from glaring at the figure in front of him.</p>\n<p><em>“Straight to the point, I see.” </em>They lent down, looking at Grian almost lovingly. It made him feel sick.</p>\n<p>\n<em>“I suppose you already know that you have to come home, don’t you?”</em>\n</p>\n<p>“I am home.” He bit back. The Watcher didn’t react to the anger, humming almost lovingly as they touched his cheek. Grian fought back the urge to flinch away.</p>\n<p>\n<em>“Your friends are all very funny. I see why you’d want to stay, I really do, but you don’t belong here, Diamond. We’re not mad at you for running off, if that’s what you’re worried about, we just want you back safe.” </em>\n</p>\n<p>Grian hated himself for the sudden guilt in the pit of his stomach. They knew what they were doing, they knew how to manipulate him, they knew how to make him feel like he was somehow in the wrong. He wouldn’t let them get to him anymore.</p>\n<p>“I’m not going back with you. Ever.”</p>\n<p>The Watcher stood back up, their large stature intimidating.</p>\n<p>\n<em>“Please don’t make this hard, Diamond. We just want what’s best for you.”</em>\n</p>\n<p><em>Liar, </em>Grian wanted to scream, they didn’t care about ‘what was best’ for him, they just wanted him as… as some sort of prize, something they could toy with and fond over like a <em>pet.</em></p>\n<p><em>“Plus,” </em>The Watcher continued, <em>“You’ve already damaged this world enough as it is by yourself.”</em></p>\n<p>Grian’s brows furrowed, he looked at the Watcher suspiciously.</p>\n<p>“What are you talking about?”</p>\n<p>The Watcher paused, looking at him almost pityingly, <em>“Oh dear, you really don’t know?</em></p>\n<p>\n<em>“Do you think this update was so glitchy for any other worlds? Why do you think there were so many issues? Why do you think those issues were only fixed when we showed up?</em>\n</p>\n<p>\n<em>“If we hadn’t come when we did, who knows what could’ve happened to this world. For all we know, it could’ve destroyed itself from the inside. You did your best, really, but trying to take down a barrier all by yourself was reckless.</em>\n</p>\n<p> </p>\n<p><em>“You could’ve gotten everyone</em> <em>in </em>this<em> world killed, too.”</em></p>\n<p> </p>\n<p>The Watcher spoke casually, as if they hadn’t just shattered Grian’s world around him. <em>He</em> caused all those issues? He could’ve… he…</p>\n<p>“No, you’re… you’re lying.” Grian accused weakly, looking away from the Watcher still standing over him.</p>\n<p><em>“You know I’m not lying.” </em>They reached out a hand again, tilting Grian's chin up to face them, <em>“Come back with us, and this will never happen again.”</em></p>\n<p>Grian swallowed, a part of him wanting to just back down, give in and go back to that hell so he wouldn’t hurt anyone anymore.</p>\n<p>“I will <em>never</em> go back to you.” He croaked out, hands trembling with how tightly he clenched them. The Watcher continued to look at him, expression hidden behind the mask, and for a moment Grian was worried he might be attacked.</p>\n<p>He wasn’t, instead, he was met with a disappointed sigh, and the Watcher let go of his face as they took a step back.</p>\n<p>\n<em>“Fine. If you want to do this the hard way, we’ll do this the hard way.”</em>\n</p>\n<p>They reached under their cloak, <em>“Just remember, Grian,”</em></p>\n<p>Grian felt himself go cold at his real name, but that feeling was nothing compared to the way his heart stopped when he saw what the Watcher held in their hand,</p>\n<p> </p>\n<p><em>“Whatever happens next is on you.” </em>They finished, holding a pair of broken, blue and red checkered headphones up to his face.</p>\n<p> </p>\n<p> </p>\n<p>Joe Hills gasped awake, sweat running down his head as he got his bearings. He was in Cleo’s tent; the zombie girl having offered a spot to him to spend the night. He calmed down his breathing, trying to remember what he’d been dreaming about.</p>\n<p>\n<em>…Something about… fire? Something had been on fire…</em>\n</p>\n<p>The man sighed, grabbing his glasses as he made his way over to the entrance of the tent, trying not to wake his friend as he did so. Unzipping the flap and walking outside, he took a breath, the sun was only just coming over the horizon and he was very obviously the only one awake. It was still chilly out, the damp grass around him swaying softly in the early morning breeze. He closed his eyes, letting himself enjoy the morning.</p>\n<p> </p>\n<p>Then time stopped for a moment,</p>\n<p>And Joe Hills was gone.</p>\n<p>\n<em>…Grian…</em>\n</p>\n<p>\n<em>Grian… Grian?</em>\n</p>\n<p>\n<em>Grian!</em>\n</p>\n<p>Grian woke with a start, flinching away from the hand on his shoulder by habit. He looked around, trying to remember where he was. Blinking away the sleep from his eyes, he looked up at Mumbo, who was crouching down over him, his expression worried. Grian breathed deeply, pushing himself up on his sleeping bag.</p>\n<p>“Are you alright?” Mumbo whispered, not wanting to wake the still sleeping Swede on the other side of the tent. Grian nodded, rubbing his eyes.</p>\n<p>“I’m… fine, yeah, I’m okay. Just had a weird dream.” He yawned, the adrenaline leaving him and tiredness taking its place. Mumbo frowned, his worried expression deepening,</p>\n<p>“What was it about?”</p>\n<p>“… A Watcher… a Watcher visited me.” Mumbo’s eyes went wide,</p>\n<p>“You mean like, a real Watcher?” he asked, sitting down properly. Grian went to reply but was cut off by a shout from outside. Mumbo and Grian looked at each other for a moment before rushing to the entrance. Mumbo unzipped the tent, Grian following close behind,</p>\n<p> </p>\n<p>He almost fell back into the tent when he saw what was outside.</p>\n<p>Cleo stood at the entrance to her tent, having been the one who yelled, and Grian could understand why. The area in front of Sahara had been destroyed. Luckily all the tents had been on the far side of the building out of harm's way, but that seemed to be the only thing not touched. Obsidian and sandstone decorated the area and Sahara’s front looked almost… decayed, the concrete crumbled, and vines and moss decorated it at random. The only thing that looked purposely placed was a portal, it stood on a platform a few blocks in the air, cobblestone steps leading up to it. Two statues stood to either side, like the ones from the chapel, but these ones looked almost… angry. Disappointed. Bedrock decorated the platform and area surrounding it, and the Watcher symbol that stood at the portal made it very clear where this had all come from.</p>\n<p>Mumbo and Grian could only stand there and stare at the scene in front of them in shock.</p>\n<p>“What… What <em>happened?” </em>Iskall remarked stepping out of the tent. The rest of the Hermits started to wander outside, having also been woken up by the commotion going on. After a moment of shock, they began to walk around a little, trying to figure out what was happening. Grian felt his heart in his throat as he walked over to the portal, a million thoughts rushing around in his head but none of them coherent enough to understand, and maybe that was a good thing. Now up the stairs, he noticed a series of signs placed in front of the portal, a poem,</p>\n<p> </p>\n<p>\n<em>“A little birdy flies from his cage,</em>\n</p>\n<p>\n<em>He flutters and flitters about in a rage,</em>\n</p>\n<p>\n<em>Unable to guide him, he leaves with no trace,</em>\n</p>\n<p>\n<em>So, another little birdy must now take his place.”</em>\n</p>\n<p> </p>\n<p>Grian furrowed his eyebrows, reading over the poem again. He felt a shiver run through him, whipping around to look at his fellow hermits scattered though out the area below.</p>\n<p>\n<em>Another little birdy must now take his place...</em>\n</p>\n<p>He didn’t like that. He didn’t like any of this, and if what he thought the poem was implying was true…</p>\n<p>“Guy’s, has anyone seen Joe?” Cleo called out, stepping out from her tent again, “I thought he was in ‘ere but…” She stopped, frowning as she looked down at the grass. She lent down and picked something up, Grian couldn’t tell what it was from where he was standing, but as he made his way towards her, he felt his stomach drop out from under him.</p>\n<p>It was Joe’s glasses.</p>\n<p>The other hermits gathered around her, still half asleep and confused. No one had seen Joe, at least not since last night, and Joe wouldn’t just leave his glasses on the ground. Cleo turned them over in her hand, one of the lenses were broken from where she had stepped on them by accident. she grimaced, feeling awful about it,</p>\n<p> </p>\n<p>“Grian, you have to calm down.”</p>\n<p> </p>\n<p>The hermit’s attention was suddenly drawn back in front of them, Mumbo stood with his hand out, facing Grian. The builder in question was shaking, staring at the glasses in Cleo’s hand, his breathing shallow and eyes unfocused. Magic crackled around him, whipping in the air like it would attack anything that got close. Mumbo ignored the threatening image and took a small step forward,</p>\n<p>“Grian, breathe.”</p>\n<p>Grian inhaled shakily and Mumbo took another step, close enough now that he was able to grab Grian’s shoulders lightly, trying to ground him. The builder took a few more breaths, slowly coming back to himself. His magic dissipated as he got control of it, no longer overwhelmed, and he leant into his friend, energy suddenly drained. Mumbo kept him upright, looking down at his friend concerned,</p>\n<p>“…They took Joe.” Grian slurred.</p>\n<p>Mumbo furrowed his brows, glancing over at the rest of the group who looked just as confused,</p>\n<p>“What do you mean?”</p>\n<p>Grian sniffled and rubbed his eyes, looking down at the ground, “The Watchers they… one of them visited me in a dream last night and… they told me to go back with them but I said no and now they’ve taken Joe and <em>this is my fault I’m so sorry--”</em></p>\n<p>“Hey, Hey it’s okay.” Mumbo reassured gently, trying to stop him from spiralling into another panic.</p>\n<p>“Why would they have taken Joe?” Cub glanced up at the portal in front of them for a moment before looking back Grian, who was trying to calm himself down again.</p>\n<p>“I don’t know, I don’t-- he said… something about having nightmares he couldn’t remember last night? It might be because of that?”</p>\n<p>“Whatever the reason is,” Cleo interrupted, clutching the glasses in her hand tightly, “We have to go get him back.” The other’s nodded in agreement. Grian pulled away from Mumbo, taking a step towards the group,</p>\n<p>“No. No, none of you can go in there.” He insisted, looking at them frantically. Cleo stared at Grian in shock before frowning, taking a step towards him defiantly,</p>\n<p>“<em>What</em>? We have to! We can’t just let them have Joe.” She argued.</p>\n<p>“I know! I know we can’t but if any of you go in there you might get hurt--”</p>\n<p>“That doesn’t matter!”</p>\n<p>“Yes, it does! If you go in there you could die!”</p>\n<p>“So? We’d just come back and try again!”</p>\n<p>“Not if you’re killed by a Watcher! If a Watcher kills you, that’s it. Game over, no respawn, you’re gone for good.” A silence fell over the group as they took in the information. Grian put his head in his hands, rubbing his eyes, “I can’t let them kill any more of my friends.”</p>\n<p>Cleo stopped, staring at Grian in shock. “Grian…” she started, suddenly feeling bad for yelling at him. She sighed, walking the rest of the way up to the builder, “I know where you’re coming from, and I understand that you’re scared but… We need to go. All of us. Think about it, if only you went, that’d be exactly what they’d want, wouldn’t it? To get you alone? Please Grian, trust us to be able to help you.”</p>\n<p>Grian looked at the ground in silence for a moment. He signed, deeply, wrapping his arms around himself, “…Alright.” he looked at the zombie girl defeated, “We… we need to think of a plan.”</p>\n<p> </p>\n<p> </p>\n<p>The Hermits dispersed, going their separate ways for the time being to prepare themselves for the journey ahead of them. Most of them went back to their bases to collect armour and weapons and at around midday, they all regrouped outside the portal. Before any of them could say anything, Grian gathered them around to a table he had set up, on which sat an array of what looked like purple bracelets.</p>\n<p>“Before anything,” Grian began, “You’re all going to put these on.”</p>\n<p>The Hermits did, slipping them around their wrists. Once they were on, they could feel a wave of magic pulse through them, their arms tingling where the bracelets touched their skin.</p>\n<p>“What are these?” False asked, fiddling with the band.</p>\n<p>“They’re going to help us hide from the Watchers while we’re in there,” Grian explained, “They’re all enchanted with a smaller version of the protection spell I used to hide Hermitcraft, they’ll still be able to see you physically, but they won't be able to sense you’re there otherwise.”</p>\n<p>The others nodded at the explanation. Grian sighed lightly,</p>\n<p>‘<em>At this point, we need all the protection we can get.’</em> He thought to himself. Grian continued,</p>\n<p>“Okay, so, that portal leads to the Watcher’s domain. They live in the End, but it’s not just any version of the End, it’s <em>the End, </em>the original, every other version of the End is just a copy of theirs. I have no idea where that portal is going to put us, but I have a good idea of where Joe will be when we get there, so when we go through, stick by me. Stay in a pair, don’t wander off and If you see anything, say something,” Grian sighed, looking tense as he spoke, “We get in, we get Joe, we get out.”</p>\n<p>The others nodded determinedly, holding their swords and bows and whatever other weapons they had with them in their hands.</p>\n<p>“This is so totally a trap.” Iskall grimaced, looking at the portal above them.</p>\n<p>“Of course it is, but we don’t exactly have any other choice.” Cleo replied, walking ahead of the group and up the stairs. The rest of them followed close behind her, Grian moving through them to stand at the front. He breathed deeply,</p>\n<p> </p>\n<p>“Here we go then.”</p>\n<p> </p>\n<p> </p>\n<p>It was dark on the other side of the portal. Grian blinked, looking around himself to make sure everyone else had made it through safely. They had, and were now looking at the world around them. Grian was right, it looked like any other End world they’d seen, the only difference being the large castles and towers stretching up around them. They looked as if they spanned on for miles, made up of mostly obsidian, the dark blocks making them as threatening as they were tall.</p>\n<p>They couldn’t stand there and gawk at them for long, however. Grian urged them forward, walking quickly in the direction of one of the buildings. They stayed grouped close together, keeping alert for any danger that might jump out at them.</p>\n<p> </p>\n<p>“Where are we going?” Doc asked quietly, walking up next to Grian. The builder glanced in his direction for a moment,</p>\n<p>“We’re going to Braid and Crown’s territory, Watchers are very defensive about their space and if this was all just to get me here, I’d say that’s probably where they’ve got Joe.”</p>\n<p>“Braid and Crown?”</p>\n<p>Grian looked embarrassed for a moment, “Oh right-- they’re the Watchers that took me from my old world, I got tired of calling them ‘Watcher one and two’ so I… I gave them nicknames.”</p>\n<p>Doc nodded, remaining silent. After a minute or so of walking, they reached another castle, it didn’t look different from any other building around them, but Grian stopped in front of it. He reached out a hand, pushing the door open and walking inside, the rest of them following behind.</p>\n<p>The door opened up to a large entrance room. A stone staircase stood in front of them, going up to another floor, a purple stained-glass chandelier reached down from the ceiling, and despite the end rods lining the walls, it was still dark inside. The Hermits stood there for a moment, thinking over where to start.</p>\n<p>“Maybe we should just pick a direction and walk?” False suggested. Grian nodded in agreement, darting his eyes around quickly as he thought about the best place to look first.</p>\n<p>“Right-- okay. Let’s start over here then.” He walked towards the staircase, leading the group through another doorway and into a corridor. Grian shuddered slightly at the sight of it, too many memories of him running down halls identical to this played in his mind. He tried to block them out, he couldn’t get distracted.</p>\n<p> </p>\n<p>Walking to the end of the hallway they turned a corner, and Grian quickly stumbled back behind the wall, keeping the others from walking around it. They looked at him panicked, raising their weapons. He held a finger out at them, telling them to wait for a moment. He peered around the corner again, looking through the doorway and into the large, open ballroom that stood on the other side.</p>\n<p>“What is it? What’s over there?” Scar whispered, looking slightly frantic.</p>\n<p>Grian squinted, there was someone on the other side of the room, but they were too far away and looking the opposite direction… his eyes widened as he realized,</p>\n<p>“It’s Joe.”</p>\n<p>The others untensed, relief spreading thought the group. Cleo looked around the corner, and before Grian could do anything, she darted around it, making a B line towards her friend.</p>\n<p>“Cleo <em>wait--”</em></p>\n<p>“Joe! are you alright?”</p>\n<p> </p>\n<p>Joe turned his head towards her, and she stopped.</p>\n<p> </p>\n<p>Grian’s magic surrounded Cleo, pulling her away from Joe a millisecond before another wave of magic hit the spot she had been standing in. She stumbled over, not prepared for the sudden shift. The rest of the hermits rushed around the corner at the commotion, standing wide-eyed at the scene in front of them.</p>\n<p>Joe hovered a few centimetres off the ground, purple magic wrapping itself around him like bolts of lightning, enough that he almost looked like he was glowing. A mask, a <em>Watcher mask,</em> was strapped to his face, his hair flowing around it like he was underwater. He grinned, a voice that almost wasn’t his spoke,</p>\n<p> </p>\n<p>\n<strong> <em>“Ỳ̰͓o͖͞ͅuͤ͐͜ ̇ͣ͞  n͈̭̭ḛ̗́v̤̥͟eͭ̾͜r͖̎̃   ̷̞ͤs̝͟͠ho͍͓ͮư̪͐ld͕̀̀   ̸͍ͯh̨̬͟a͓̺̐v̲͢e̔̍ͅ ͇̝͉  cͧ̂ͮȍ̟̙m̡ͦ̀e̡̻͙   ̘́͋h͈ͤ͒ȅ̤͉ṟ̓͝ë͖̲.”</em> </strong>\n</p>\n<p>When you’re faced with a dangerous situation, it’s natural to go into a flight or fight response, it’s the brain's first way of making sure you don’t die instantaneously. Grian, despite his magic, was not a very good fighter, so that option was out straight away. However, ask anyone that knows him, and they’ll tell you he’s definitely an above-average flier.</p>\n<p>So, no one should really be surprised that his first instinct when faced with the sudden and threatening visual of his friend hovering in front of him (who had just tried to kill his <em>other </em>friend), was to grab the other hermits with his magic, turn around, slam the door, and haul ass in the other direction. The others realized they were suddenly sprinting down the hallway after a few seconds of being yanked along, finding their footing under them and actually running down the hall.</p>\n<p>“Grian what- Grian we can't just leave him, <em>wait</em>!--” Cleo spluttered, still trying to process what the hell was going on, everything had happened so fast--</p>\n<p>“Trust me, we’re not leaving him!” Grian interrupted, the panic in his voice thick. He hit himself mentally, <em>how was he so stupid? </em>Did he really just expect Joe to be sitting around somewhere completely fine? His self-deprecating thoughts were cut off by an explosion behind them, and he didn’t need to look to know that Joe was probably now hot on their trail.</p>\n<p>“Where- where are we going? Grian, <em>what do we do?”</em> Iskall yelped, trying to keep up with the group.</p>\n<p>“We’re going to the courtyard, it’s an open space, less dangerous-- for us and him,” Grian rushed around a corner, almost running into the wall in his haste, “We need to get that mask off him, quickly!”</p>\n<p> </p>\n<p>They made it to the courtyard. It was a large open space, the ground was made of endstone, endstone brick laying out pathways to other entrances in the surrounding walls. A large stone statue of a Watcher sat in the middle of the field, its wings were made of purple glass, unfurled and large. End rods decorated the four walls, lighting the area against the darkness of the End. The hermits ran to the statue, fumbling around it till they were hidden on the other side.</p>\n<p>“We don’t have a lot of time so I’m going to try and explain as quickly as I can,” Grian started, breathing heavily as he tried to catch his breath, “We need to get that mask of him. If we don’t, it’s going to kill him, the mask- the masks are used to control magic in a way, heighten it, that much magic flowing into a player who’s never experienced it before will destroy them.”</p>\n<p>“But I don’t- why is he attacking us?” Mumbo gasped, also trying to regain his breath.</p>\n<p>Grian glanced around the side of the statue, trying to see if Joe had made it to them yet, “He’s- I think the Watchers have done something to the mask, made it… brainwash him, or something, like the mask is in control. I don’t know, I’ve never seen anything like this before—”</p>\n<p> </p>\n<p>\n<em> <strong> \"It's not very polite to run from your friends, you know.\"</strong> </em>\n</p>\n<p> </p>\n<p>The group jumped back in surprise at Joe’s sudden appearance behind them. Grian scurried in front of the others, creating a barrier just in time to counter a bolt of magic he’d thrown at them. The others scuffled backwards, weapons raised but still hesitant, they needed to protect themselves but… but they didn’t want to hurt Joe.</p>\n<p>“Joe, you’ve gotta snap outta it!” Cleo pleaded, a tight grip on the trident in her trembling hand.</p>\n<p>The man simply smiled, tilting his head a little, <em><strong>\"Snap out of what?\"</strong></em></p>\n<p>He raised his hand again, another bolt of magic shooting towards the group. Grian blocked it with his shield but stumbled back against the impact, straining to keep the barrier intact. He looked back at his friends, his eyes desperate and slightly guilty as Joe walked closer, a continuous beam of magic assaulting the shield,</p>\n<p>“I know you don’t want to hurt him but <em>please, please-- we need to get that mask off!”</em></p>\n<p> </p>\n<p>Maybe it was the desperation in Grian’s voice, or maybe it was the fact that the shield he was trying to keep up was starting to crack apart, but something made Doc suddenly kick into gear, not thinking twice before rushing around the side of the barrier and throwing a trident in Joe’s direction. It didn’t hit him, whizzing past his arm and landing on the ground a few feet away, but it was enough to blow Joe’s arm back and stop the attack for a moment. Grian reacted instantly, lowing the barrier and grabbing Joe with his magic, throwing him back into the wall. Hard. Hard enough that the wall crumbled a little at the impact, throwing dust into the air.</p>\n<p>Grian stumbled a little, leaning forward on himself as he tried to make his head stop spinning,</p>\n<p>“I can’t keep him back with magic forever, we—we need to think of something, <em>fast</em>.”</p>\n<p>“We need to move, if we’re not in one group it’s harder to go after us all at once.” False stated, eye’s hardening as she prepared herself for the fight.</p>\n<p>The others nodded, dispersing out a little from their huddle they’d found themselves in, spreading out over that part of the courtyard. Laughter drew their attention back over to Joe, who’d recovered from the impact and gotten back to his feet,</p>\n<p><strong><em>“Now this is more exciting!” </em></strong>He walked towards the hermits, stopping to pick up the trident Doc had thrown at him. It lit up as soon as he touched it, glowing purple and sparking, <strong><em>“Thanks for the free weapon, Doc.”</em></strong></p>\n<p> </p>\n<p>“Think of something, I’ll distract ‘em.”</p>\n<p>False drew her sword suddenly, rushing towards the man that was advancing towards them. She swung at him, sword clashing against the trident he used to counter her. She stepped back for a second before swinging again, the two moving around each other like some kind of dance. Grian watched in a panic, hands raised in case something went wrong and he needed to pull False out of there.</p>\n<p>The others stood in shock for a moment before glancing at each other, minds racing to think of something, <em>anything--</em></p>\n<p>“Okay-- okay I think I’ve got an idea.” Xisuma’s voice crackled through the speakers of his helmet, beckoning the others over to him hurriedly.</p>\n<p> </p>\n<p>Despite the new powers Joe now had, it hadn’t done anything to improve his actual combat skills, and False soon had him on the ropes. The man yelled in frustration, his magic crackling around him furiously as he pushed her away from him, False unable to stop herself as she went flying back towards the group. She cried out as she landed on her shoulder, Stress quick to rush over to help her to her feet.</p>\n<p>“You alright, love?”</p>\n<p>“Yeah… yeah, I’m good,” False gritted out, rubbing the shoulder she landed on, the ache quickly spreading along her arm, god she hoped she hadn’t broken anything, “You lot thought of a plan yet?”</p>\n<p>“X’s got somethin’, you still up to fight?” Stress asked, continuing as False nodded at her, “You and Wels’ gotta get behind ‘em, can’t let him see you tho, alright?”</p>\n<p>Now that False has been thrown away from him, Joe continued forward towards the others, the trident still sparking with magic in his hand.</p>\n<p>“Joe!” He turned to look at where the noise had come from, spotting Cleo standing in front of the Watcher statue to his left, “You’ve gotta stop, please, you know us! We’re your friends!”</p>\n<p>He grinned at her plea, something drawing him to her over everyone else. He darted over, moving almost too fast for the others to see and reached his arm out, grabbing the zombie girl’s throat and forcing her back into the statue behind her. He laughed at her shock, not being prepared for him to reach her so fast,</p>\n<p><strong><em>“Oh, of course I know you, Cleo,” </em></strong>He jeered, raising the trident in his other hand towards her,</p>\n<p> </p>\n<p>\n<strong> <em>“I also know that corpses should stay in the ground.”</em> </strong>\n</p>\n<p> </p>\n<p>And at that, the fear in Cleo’s eyes turned to determination.</p>\n<p>“SCAR, NOW!”</p>\n<p>Joe had no time to react as Scar jumped out from behind the other side of the statue, firing his crossbow at him. The fireworks exploded, sparks and colours and noise throwing him off Cleo, catching him by surprise.</p>\n<p> </p>\n<p>Then three things happened at once.</p>\n<p>False and Wels grabbed Joe’s arms, keeping him in place.</p>\n<p>Cleo darted forwards, grabbing Joe’s mask.</p>\n<p>And time stopped for a moment.</p>\n<p>But the others didn’t know about that last one, so for all intents and purposes, we’ll just pretend only the first two happened.</p>\n<p> </p>\n<p>Cleo <em>s c r e a m e d.</em></p>\n<p> </p>\n<p>Purple magic crawled through the skin of her fingers, and then her hands, and then her forearms like veins spreading out from where she touched the mask, pain like she had never felt before stabbed at her and she saw white for a moment. But she didn’t let go of the mask, continuing to pull it, she needed to get it off her friend <em>now, this was their chance <strong>she needed to save him but god it h u r t—</strong></em></p>\n<p>And then, it was off. Cleo fell backwards, the statue behind her the only thing keeping her upright. She dropped the mask on the ground, stomping on it and breaking it in two. Wels and False held Joe up as he slumped forwards in their arms, going limp, the world around them was quiet, almost too quiet compared to how loud it had just been. Cleo looked up at her friend shakily, stumbling over on unsteady feet.</p>\n<p>“…Joe?” she murmured, reaching out towards him with a trembling hand, and for a horrifying moment, she thought she couldn’t see him breathing-</p>\n<p> </p>\n<p>“…Cleo…?” Joe’s voice was small, small enough that she almost didn’t hear it, but she did, and the sound made her burst into tears.</p>\n<p>“…Howdy, Joe.” She chuckled; voice thick with relief and tears she didn’t try to wipe away. The gentle moment was ruined however when Grian called out over the courtyard,</p>\n<p>“We need to get out of here, now!”</p>\n<p> The calm that had settled over the others dissipated. They weren’t out of the woods yet, and with the amount of commotion they had made it was very likely the owners of the castle knew were they were, despite the bracelets.</p>\n<p>Cleo tried to pick up the now fully unconscious Joe, yelping at the sudden pain that shot up her arms when she tried to put weight on them. False grabbed him from her quickly, holding him bridle style as she looked at Cleo worryingly. She had no time to ask if she was alright however, as the rest of the group starting rushing towards one of the gates of the courtyard. They caught up with them, following behind Grian as he led them out of the castle and towards the portal.</p>\n<p> </p>\n<p>Mumbo didn’t trust how easy they had gotten away.</p>\n<p>He watched as his friends ran into the portal, Grian standing a little in front of it, making sure the others got in safely before he would go in himself. Mumbo was the last to run towards it, but he skid to a stop just before he went thought, something feeling off. He turned to look at Grian, and whatever he was going to say vanished before he could open his mouth.</p>\n<p>Grian stared back at him, eye’s swimming with what he could only describe as anguish, his body trembled and tears ran down his face. He looked at his friend and smiled painfully,</p>\n<p>“I’m sorry I put you all thought this.” He sobbed, and Mumbo realized what was happening, his heart jumped into his throat and eyes went wide,</p>\n<p>“Grian no, GRIAN, <strong><em>WAIT--\"</em> </strong></p>\n<p>Mumbo tried desperately to run towards his him, but Grian’s magic surrounded him, and all he could do was watch his friend as he was thrown backwards into the portal.</p>\n<p> </p>\n<p>And then all he could do was watch at the portal closed, Grian still on the other side.</p>\n<p>Grian watched the portal’s magic flicker and die out in front of him, his friend’s yell still ringing in his ears.</p>\n<p>He didn’t react to the sound of someone landing behind him. He didn’t react to the hand on his own, pulling him slowly away from the dead portal (away from his friends, his family, <em>his home-</em>). The world was moving in a blur, like he wasn’t really there, like he was dreaming. He’d like this all to be a dream, he’d like to imagine waking up in his house, he’d like to imagine walking outside to see his friends all alive and safe and not in danger. He’d like a lot of things.</p>\n<p> </p>\n<p>\n<em>“We’re not angry with you.”</em>\n</p>\n<p>Crown’s voice snapped him out of his haze slightly, and he realized they were now outside his room, in the castle. He looked up at them, feeling like a child that had just been caught doing something wrong.</p>\n<p>“<em>In fact, we’re both very proud of you, Diamond.” </em>Crown smiled softly, crouching down to his level, “<em>What you did must have been a very hard decision to make, but it was the right one. Now that this little adventure is over, I hope you understand your place here, with us.” </em></p>\n<p>Crown stood back up and opened the door, gesturing for Grian to walk inside. He did, Crown following close behind. The room was the same as it had been when he’d left, the obsidian walls stretched high above them, end rods draped from the ceiling (like Stress’s castle-- (<em>don’t think about it--)), </em>little trinkets and items were scattered around the room and walls, gifts from Crown and Braid to make him happy, or so they had told him, a large glass door was closed on the wall opposite them, leading out to a balcony.</p>\n<p><em>“I think Braid wants an apology for what you said to them in your dream, but I’m sure they’ll forgive you.” </em>Crown chuckled to themself, stepping around to face Grian.</p>\n<p>\n<em>“I’ll leave you alone to readjust in a moment, however, there is one thing I need to do first.”</em>\n</p>\n<p>Grian’s eyes went wide as they pulled his mask from beneath their cloak. He said nothing, forcing his panic down with gritted teeth. Crown didn’t notice his panic, or simply chose to ignore it,</p>\n<p>\n<em>“This might feel a little overwhelming, but it’ll be alright.”</em>\n</p>\n<p> </p>\n<p>And with no further warning, Crown pushed the mask onto Grian’s face. Grian felt it instantly, the magic flowing through him and around him, like it was trying to drown him. He clenched his fists, trying to control it before it swallowed him whole. And then it settled, falling into place like it never left. Grian took a moment to breathe before he opened his eyes, looking through the mask was always a strange feeling, he knew it was solid, it felt solid on his face, and from the outside you’d assume there would be no way to see anything through it, yet it didn’t block his vision in the slightest, if only giving everything a slightly purple hue.</p>\n<p>Grian felt something shift on his back, and his eyebrows raised as he noticed his wings folding around his shoulders, almost as if they’d never been gone in the first place. He reached out and touched them lightly, feeling the feathers between his fingers. Crown hummed in approval, smiling down him,</p>\n<p><em>“Well, I’ll leave you alone for now, if you need anything, be sure to come find us, dear.” </em>They said simply, walking over to the door. They paused in the doorway for a moment, looking back over their shoulder,</p>\n<p> </p>\n<p>“<em>Welcome home, Grian.”</em></p>\n<p> </p>\n<p>Crown shut the door behind them, and Grian could hear their footsteps retreating down the hall. He stood there, now alone in his room, his surroundings not quite catching up to him. Everything felt hazy around the edges, like it wasn’t quite there. He walked over to his bed, ready to just fall into it and pretend he was somewhere else, when he noticed the clothes laid out on the covers. A purple jumper, like the one he was wearing, some jeans and a purple cloak. He picked up the cloak hesitantly, looking down at the symbol engraved into the pin on the front.</p>\n<p>He ignored his sob as he took a breath, clutching the fabric in his hands tight.</p>\n<p> </p>\n<p> </p>\n<p>Iskall didn’t know where he was going.</p>\n<p>It’d been a few days since Grian had left, and everyone was still in shock over it. Despite the signs, no one had really seen it coming, they’d really thought they had been getting through to him but… apparently not. Iskall sighed, wandering through the desolate shopping district aimlessly, the world felt like a ghost town, everyone seemingly shutting themselves away, whether on purpose or not he wasn’t sure. His train of thought was derailed by a frustrated sounding shout near Sahara. Curious, he walked over. The front of Sahara was still in ruin, no one having the time or want to try and fix it. Iskall frowned when he saw the source of the shouting, being a dishevelled looking Mumbo who had seemed to take to kicking the side of the Watcher portal and swearing at it. Iskall cleared his throat, trying to get the man’s attention.</p>\n<p>Mumbo turned to look at his friend, and Iskall’s frown deepened at the sign of him. His hair was a mess, unbrushed and dirty, his clothes were in a similar state, his coat having been discarded and undershirt stained with Redstone. He looked exhausted.</p>\n<p> </p>\n<p>“Oh… Hey.” The man greeted, looking down at Iskall from the platform.</p>\n<p>“…Hey.” Iskall replied slowly, watching the man walk down to him, “What… what’re you doing?”</p>\n<p>Mumbo blinked, furrowing his eyebrows a little, “I’m trying to restart the portal, and I know what you’re going to say-” he put his hand up in front of him like he was expecting Iskall to interrupt him,</p>\n<p>“-But listen, I know the flint and steel didn’t do anything but-”</p>\n<p>“Bro-” Iskall tried to interject, but Mumbo continued to talk over him.</p>\n<p>“-What if we use something that also had some kind of magic property to it? Like… like an enchantment table? Or-”</p>\n<p>“Dude.”</p>\n<p>“-Maybe a beacon? If we light it below the portal and have the beam shoot into it-”</p>\n<p>“Mumbo--\"</p>\n<p>“-I mean, even Redstone has to have some kind of magic in it-”</p>\n<p>\n<em>“Mumbo. It’s not going to work.”</em>\n</p>\n<p> </p>\n<p>The Redstoner stopped rambling, looking at Iskall a little startled. Iskall continued while he had his attention,</p>\n<p>“I know you’re worried, we all are, and we’re all trying to think of something to get him back, but… this isn’t the way to do it. When’s the last time you slept? Or ate?”</p>\n<p>Iskall paused for a moment,</p>\n<p>“…Grian wouldn’t want you to run yourself into the ground for him, dude.”</p>\n<p>Mumbo looked at him blankly, a silence fell over the duo as Iskall waited for a response. Then Mumbo sniffled, rubbing his eyes furiously as he teared up. Iskall’s stomach dropped with his face, and he took a step towards his friend,</p>\n<p>“Hey, I’m sorry-”</p>\n<p>“No, no you’re right.” Mumbo croaked, sitting on the steps behind him and putting his head in his hands.</p>\n<p>“He was right there. He was right there and I couldn’t stop him. I couldn’t do anything.” His voice broke as he finished talking and Iskall hurried over, sitting next to his friend to put an arm around him.</p>\n<p>“It’s not your fault, it’s no one’s fault, none of us would’ve been able to stop him.” He rubbed Mumbo’s back, trying to comfort the man the best he could. Mumbo took a deep breath, taking his hands away from his face, which was now red and splotchy from the tears.</p>\n<p>“I know, but it’s just- it’s so frustrating, if I had noticed sooner I could’ve… talked him out of it, or-”</p>\n<p>“I don’t think any of us could’ve talked him out of it, man.”</p>\n<p>Mumbo sighed, staring ahead at nothing in particular.</p>\n<p>“We are going to get him back though,” Iskall reassured, smiling softly, “We’re going to think of something.”</p>\n<p>Mumbo glanced over, face unsure, “Are we? Even if we can get the portal open…</p>\n<p> </p>\n<p>“Who’s to say he’ll even come back with us?”</p>\n<p> </p>\n<p> </p>\n<p>Cleo walked through the hallways of Stress’s castle towards the bedroom. Due to the fact that neither Joe or Cleo had a very secure place for Joe to rest and recover, Stress had kindly offered them to stay with her for the time being. Joe had tried to refuse at first out of politeness, but Cleo had shut that down quickly. She held two bowls of soup in her hands, having had the idea to possibly eat lunch with her friend if he was awake, he’d been in and out of unconscious the first few days, but now he was more awake than not, which Cleo took as a good sign. She grinned as she turned the corner into the bedroom, seeing Joe awake. He was writing something in a book, stopping and putting it down next to him once he noticed her arrival.</p>\n<p>“Howdy, Cleo.” He nodded, smiling as he sat further upright in the bed, taking the soup from her thankfully.</p>\n<p>“Hey.” She replied, sitting to face him on the foot of the bed, “You feelin’ any better, then?”</p>\n<p>The man sighed, looking down at the soup in his lap, “Sorta, the scars don’t ache as much right now…” he mumbled, reaching up to touch his face lightly. The purple lines stretched under his eyes and across his nose, where the mask had touched his face. Cleo grimaced slightly at the sight, thinking of her own scars running up her arms.</p>\n<p>“That’s good. Mine’ve stopped hurting for the most part.” She replied, taking a sip of her soup. They sat quietly for a moment, enjoying each other’s company. Cleo glanced at the book sitting next to her friend,</p>\n<p> </p>\n<p>“…Are you still having those nightmares?” She asked softly.</p>\n<p>Joe took a moment to respond before nodding,</p>\n<p>“They’re not as frequent as they were before but, yeah.” He frowned slightly, biting the inside of his cheek, “I… I think I know what they are now.”</p>\n<p>Cleo raised an eyebrow, leaning forward.</p>\n<p>“I think… I think it was Grian’s old world.”</p>\n<p>The zombie girl’s brow furrowed, and she looked at Joe confused,</p>\n<p>“Why’d ya reckon that then?”</p>\n<p>Joe frowned, trying to find the right words, “It’s a little hard to explain… when I had that mask on, it was kinda like I had taken a back seat in my own head, right? Like the magic was piloting me around and tellin’ me what do, but I was still aware of everythin’ that was going on. Kinda.”</p>\n<p>Cleo nodded, continuing to eat her soup,</p>\n<p>“When I had that nightmare again, it was almost the same feeling. It was the same dream but this time I knew what was goin’ on, like, I knew where I was in the dream despite me not recognizin’ anything.”</p>\n<p>Joe finished talking, eating some of his soup.</p>\n<p>“And… you just knew you were in Grian’s old world?” Cleo asked, trying to make sense of it in her head.</p>\n<p>“Yep.”</p>\n<p>“That is strange…”</p>\n<p> </p>\n<p>Joe hummed in agreement, and the two fell back into silence. After a moment Joe looked over to Cleo, an unsure expression on his face,</p>\n<p>“I did… wanna tell you something, actually.” He muttered, avoiding eye contact. Cleo nodded her head, gesturing for him to continue. He took a breath before continuing,</p>\n<p>“I just. I wanted to say sorry, for everything I did…”</p>\n<p>“You stop right there, Joe Hills.” Cleo interrupted abruptly, putting her food down beside her to look at her friend dead in the eye,</p>\n<p>“You have absolutely nothing to apologize for.”</p>\n<p> </p>\n<p>“But I do, Cleo!” Joe blurted out suddenly, as if he’d been holding it in for the whole conversation, “I have got so much to apologize for. I’ve gotta say sorry to False for throwing her across the room, I’ve gotta apologize to you for what I’ve done to your arms, I’ve gotta apologise to everyone for <em>trying to kill them,” </em>His worlds grew more frantic as he spoke, and Cleo was a little taken aback at the sudden outburst,</p>\n<p>“And I <em>would </em>say sorry to Grian, but cause of me he’s not here!”</p>\n<p>“Joe, stop it,” Cleo said firmly, moving down the bed to sit closer to her friend. She grabbed his hands in her own, “Oi, Look at me.”</p>\n<p>Joe reluctantly did, his face still grimacing, eyes swimming with guilt.</p>\n<p>“You did nothing wrong. And I know where you’re coming from, yeah? But you said it yourself, you didn’t have any control over your actions. You were a victim in this as much as everyone else was. Those Watchers coulda taken any one of us and it wouldn’t’ve been that person’s fault either. You know who’s fault it is? Those things that forced you to do all that in the first place.”</p>\n<p>Cleo’s face softened slightly as she spoke, “Do you blame me for not wakin’ up when you got taken? Do you blame Grian for bringing all this with ‘em in the first place?”</p>\n<p>Joe sighed, looking away from her, “No, course I don’t.”</p>\n<p>“Exactly,” Cleo nodded firmly, “So don’t go throwing yourself under the bus when you got no reason to.”</p>\n<p> </p>\n<p>“I doubt there’s ever a good reason to throw yourself under a bus. Unless maybe you’re hiding from something.” Joe mused, a small smile cracking onto his face.</p>\n<p>Cleo laughed, “Why would ya first option be <em>under</em> the bus? Why not inside it?”</p>\n<p>“Maybe the bus is locked and you’re in a rush, and you’ve gotta hush cause you’ve had a brush with something dangerous.”</p>\n<p>Cleo laughed harder this time, leaning back on the bed. Joe chuckled with her; troubles momentarily forgotten. As their laughter died down Cleo got to her feet, picking up the empty bowls,</p>\n<p>“I’ll be back in a bit, gotta put these back.”</p>\n<p>Joe nodded, face falling a little, “I think… I just wish I didn’t feel so useless right now…”</p>\n<p>Cleo sighed, a small, sympathetic smile on her face, “I’m with you on that one.”</p>\n<p>She went to turn around, only to stumble slightly on the side of the carpet, falling backward with a yelp,</p>\n<p> </p>\n<p>And then she wasn’t falling.</p>\n<p>Cleo stared at Joe with wide eyes, and Joe stared right back at her, his hands held out towards her instinctively when she had fallen. Except Joe’s hands were glowing, the same purple colour as the magic surrounding her. And then in the next moment, the magic was gone, and Cleo landed on the ground, eyes still wide and unbelieving. They two sat in silence for a moment,</p>\n<p>“We... we need to get the others. <strong>Now.</strong>”</p>\n<p>The sky was grey, the same as it had been for the last week. Overcast and cloudy, fog seemingly everywhere, and it fit the mood that hung over the hermits like a blanket, almost like the world itself was mourning with them. Maybe mourning isn’t the right word, but it sure was what it looked like, to Mumbo at least. After his chat with Iskall, he’d spend a majority of his time near his farms, just trying to keep himself occupied. Building and fixing his machines, sometimes breaking them on purpose just so he’d have something to do, something to distract himself. He almost ignored his communicator when it went off, but curiosity got the best of him, and whatever hesitance he had was gone when he saw the message.</p>\n<p><strong>ZombieCleo:</strong> <em>u guys need to come to stress’s castle now, its ‘bout grian</em></p>\n<p>Without a second thought, he took to the sky in the direction of Stress’s base.</p>\n<p> </p>\n<p>He was one of the first there thanks to an overuse of fireworks, spotting Cleo and Joe on top of the castle, Stress standing nearby. He landed, a little wobbly in his haste, in front of them,</p>\n<p>“What’s going on?”</p>\n<p>“Give it a minute, gotta wait for the others,” Cleo replied, looking off into the horizon. They arrived soon enough, all just as interested as Mumbo to know what was going on.</p>\n<p>Cleo wasted no time, holding a bowl out in front of her,</p>\n<p>“Watch.”</p>\n<p>She gave a small nod to Joe before dropping it. Joe reached out towards it and it stopped mid-air, a purple glow that the others knew by then to be magic surrounding it, the glow flickering a few times before disappearing, letting the bowl fall to the ground. The group stared at it in shock for a moment, Mumbo speaking up to say what everyone was thinking,</p>\n<p>“You have magic.” He breathed, “How, how do you have magic?”</p>\n<p>“The mask,” Joe answered, pushing his broken glassed up his nose slightly, “I think it’s remnants of the magic the mask was feedin’ me. When Cleo took the mask off it’s like it got severed somehow, I don’t know if it’s temporary or not but for now, it’s here.”</p>\n<p>“Oh!” Iskall gasped, drawing the others attention to him, “You could open the portal!”</p>\n<p>The other hermits’ eyes went wide at the realization, Mumbo taking a step towards the castle’s edge, rocket in hand.</p>\n<p>“What’re we all still doing here then? Let’s go.”</p>\n<p> </p>\n<p>“Hey, hold on a second,” Doc objected, “We can’t go rushing into this without a plan. Plus, we don’t have Grian with us this time, we’re going in completely blind.”</p>\n<p>“Well, not completely blind,” Ren shrugged, “We know where he’s going to be.”</p>\n<p>“Yes, but we also know what else is going to be there with him. We didn’t even see a Watcher last time and we still got our butts kicked.”</p>\n<p>Joe looked at the ground, frowning slightly. Doc sighed, looking between Mumbo and Ren.</p>\n<p>“Look, even with a plan, last time we lost someone. We’ve got a chance to get him back and we can’t waste it by rushing into that place again. We need to think of something more… thought-out.”</p>\n<p>The others nodded, despite how much Mumbo wanted to run over to the portal now, Doc was right. they couldn’t rush into this, especially seeing how this might be their only chance.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Grian could feel Braid approach more than hear them, recognizing their magic in the hall outside. He tried to ignore it, hoping that they’d just walk past his door, but Grian wasn’t really getting what he wanted recently, so it wasn’t a surprise when they stopped outside his door and opened it, not even bothering to knock. He was lying on his bed facing away from them, having not really bothered to move much outside of eating whatever food Crown would give him, not really seeing the point to. It wasn’t as if he was trying to be difficult, or maybe he was, he didn’t know. Or care. He didn’t bother looking at Braid as they sat down on the side of his bed. It’d been a few days since he’d last seen them, having had to go “apologize” to them for his “rude behaviour”, and he was a little miffed at being in their presence again.</p>\n<p>“<em>I have something for you,” </em>Braid announced, tapping Grian’s shoulder lightly from where he lay under the covers of his bed. After a moment he rolled over, looking at Braid through his mask, not bothering to hide his glare that they couldn’t see. The Watcher held out their hand lightly, palm facing the ground, then they whistled a simple tune, continuing to face Grian as the little song finished. A silence fell between them and Grian furrowed his brows, confused as to what was going on-</p>\n<p>Something moved out of the corner of his eye, and he sat up in bed as he watched a bird fly through the doorway of his room, landing on Braids outstretched hand. It was beautiful, different than any other kind of bird he’d ever seen, its black feathers shining in the dim light, and Grian could see purple feathers under its wings when it shifted on its perch. Braid whistled the tune again, and the bird mimicked it, bobbing its head from side to side like it was dancing.</p>\n<p><em>“Would you like to hold him?” </em>Braid asked, holding the bird towards Grian. He hesitated for a moment, eyeing the bird and Braid wearily before slowly holding his hand out, watching the bird jump from Braid’s hand to his. It cocked its head at him, looking at his wings folded up behind him, ruffling its own a few times. Grian smiled slightly, ruffling his own wings back at it.</p>\n<p> </p>\n<p>Then the bird burst into a purple flame.</p>\n<p> </p>\n<p>Grian shrieked as he threw the bird away from himself, pulling his legs towards him and pushing himself further up the bed. he gaped in a kind of confused horror as it flapped around on the bed for a moment, as if it was trying to put itself out, and then just like that it was gone, the fire swallowing it whole. For a moment all Grian could hear was his own shuddering breaths, still trying to process what had just happened, then a loud cackle broke through the air, Braid doubling over themself as they laughed, Grian watched as they did, his heart beating loud and fast in his chest. They quieted down, their laughter slowing into a giggle as they turned back to look at Grian, seeing the look on his face and pouting dramatically,</p>\n<p>“<em>Oh, Diamond, what’s with that face? It was a harmless joke is all!”</em></p>\n<p> </p>\n<p>“Harmless?” Grian choked out, voice trembling slightly, “You just- you <em>killed--”</em></p>\n<p><em>“Oh please! It was just a bird! Millions of them exist, Diamond, if you want an actual bird you can go get one yourself!” </em>Braid sighed, as if they were disappointed in Grian’s reaction to their… joke. They stood up and faced Grian, their looming figure made even more prominent as Grian craned his neck up to look at them.</p>\n<p>“<em>It’s been days, Diamond. Crown might have more patience with you than I but even they are growing tired of this. We have given you time to adjust, but that time has run out, so, smarten up. Realize that this is your life, and that you are a Watcher, and that you need to start acting like one. When you’re ready to do that, maybe you will stop wallowing in your own despair so pathetically.”</em></p>\n<p>Grian watched shell shocked as Braid turned on their heels and stormed out of the room, slamming the door behind them. Grian flinched at the noise. He blinked at the now empty room, staring at the door for a few moments before slowly turning his gaze back to the bed, where the bird had been a minute prior. Any evidence of the bird ever existing was gone, either burnt with the flame or… the bird might not have been real at all, all a trick from Braid to get under his skin. He’d like to believe so, that he hadn’t just seen… he took his mask off for a second, rubbing his eyes as he grimaced at the thought, the birds last few moments playing over in his head.</p>\n<p> </p>\n<p>He’d let his guard down, that had been his first mistake. He’d let himself get carried away with believing that Braid might’ve been doing something out of the goodness of their heart, he couldn’t do that again, or something bigger than a bird might get hurt.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>It’d taken a few days, but the hermits had what they thought was the best plan they could come up with, they’d pushed the time as far as they could, the worry that Joe’s magic might leave him at any point hanging over their heads like a cloud. Their biggest advantage, they realized, was the bracelets Grian had made for them, with them on the Watchers wouldn’t be able to sense their presence in The End, giving them the element of surprise. (Ren snorted, “More like the element of not dying as fast-- ow!” Ren rubbed his arm where Stress had smacked him, cringing away from the look she was giving him). The sky was clear on the day they met up outside the portal, a change from the overcast and gloom of the days prior, it almost didn’t fit the atmosphere of the meetup, every hermit armed to the teeth, despite the feeling of unease and fear that sat in each of their stomachs.</p>\n<p>They went over the plan one more time. It was less one distinct idea and more a series of… what-ifs. In truth they had no idea how any of this would go, so their best course of action was to try and find a solution to any kind of outcome, what do if a Watcher found them, what to do if Grian wasn’t going to come back with them, what to do if one of them got taken or injured. A lot of these plans, much to Mumbo’s annoyance, ended with “Run back to the portal as fast as you can, Grian or no”, but he understood why, all he could do was hope it didn’t come to that, and if it did, that Joe would be able to open the portal again.</p>\n<p> </p>\n<p>“Is everyone ready then?” Xisuma called out from near the portal, Joe standing anxiously next to him, the man rubbed his hands together subconsciously, trying to calm his nerves. The others nodded, ready as they’d ever be, and walked up the stairs towards them.</p>\n<p>“Whenever you’re ready, Joe.” X smiled at his friend, Joe tried to smile back, turning into more of a grimace as he walked closer to the deactivated portal.</p>\n<p>He kneeled in front of it, trying to calm his breathing and thoughts, focusing on the feeling inside of himself, the feeling he felt when he’d caught Cleo. He put his hands on the bottom of the portal, leaning into it. He could feel the feeling inside of him swell, like waves crashing onto a beach just before a storm, growing higher and higher as the air around him felt more electric and his hands sparked to life, crawling up and around his arms and body—</p>\n<p> </p>\n<p>\n<em>-a person attacking him with a sword and not stopping he threw them and they crumpled to the ground-</em>\n</p>\n<p> </p>\n<p>He gasped at the memory, eyes opening and breath speeding up as he tried to keep focus on the task at hand, he couldn’t mess this up he needed this to work-</p>\n<p> </p>\n<p>\n<em>-he had his hand on someone neck he was going to kill them he couldn’t stop it <strong>he couldn’t stop it he couldn’t STOP IT-</strong></em>\n</p>\n<p> </p>\n<p>“You’ve got this, Joe!”</p>\n<p>He didn’t know who’s voice it was, from behind him, but he clung onto the noise, repeating it over in his head as he tried to push out the memories. The magic was almost overwhelming now, but still not enough, like something was blocking a dam, holding him back, with gritted teeth he pushed against it harder, letting out a yell as he felt it yield, and for a moment all he saw was white.</p>\n<p>Joe was thrown backward, sparks shooting from the spot he had been focusing on as the portal flickered awake, basking them in a purple glow. Cleo rushed over to Joe, who was out cold, lifting him into her lap as the others half ran to them half ran to the portal, suddenly not sure whether to go or stay and see if their friend was alright. Cleo looked at them desperately,</p>\n<p>“Hurry up then! I’ll stay and make sure he’s alright, you lot need to go, now!” She grabbed the bracelet from her wrist, thrusting it into Iskall’s hands, “I’m not going to need it, maybe you guys will, I’ll keep watch from this side! Go get that idiot!”</p>\n<p>Cleo watched as they nodded, running into the portal. As the last of them entered, the world around her was suddenly quiet, only the faint hum of the portal and her friends breathing breaking the silence. She held him tighter, looking at the portal with anxious eyes,</p>\n<p> </p>\n<p>\n<em>Please let them be alright. Please.</em>\n</p>\n<p>The Hermits knew where they were going this time, not needing Grian’s guidance to navigate the almost maze of towers and castles around them. They found the right castle easy enough, making their way into the building quietly, again confronted by its cold, dark atmosphere. The group had two options now, either split up to try and cover more ground and find Grian faster or stay in one group to lessen the chance of confronting a Watcher alone. In the end, they decided it was probably safer to stick together, and with that, they began their journey deeper into the castle. They walked up the stairs and into the hallway they had gone through the last time they were there, none of them had any idea where a good place to start would be, so following in their own footsteps seemed like a good idea, at least they’d know what to expect at first that way.</p>\n<p>They peered around the corner at the end of the hallway, looking at the large, dark wooden door in front of them. Mumbo edged closer to it, grabbing the handle and opening it slightly, just enough to look inside. From what he could see it was empty, but just as he was about to open it more, he stopped.</p>\n<p>A Watcher stood on the other side of the room, looking out a window with it's back facing the door. Mumbo felt frozen, it hadn’t noticed them as far as he could tell, so as slow as he could he shut the door again, turning to face the others,</p>\n<p> </p>\n<p>“There’s a Watcher in there.” He whispered, gesturing with his hands to move away from the door. They did, slowly walking backwards, trying to make as little noise as possible. Walking backwards, however, was probably not the best idea, because when you accidentally drop a sword onto the stone ground after being run into, it makes quite a loud noise, loud enough to make everyone around you stop and flinch. Ren was quick to crouch down and pick up his dropped sword, he held his breath with the others as they stood there frozen for a moment, wide eyes looking between each other. A few seconds passed, an agonizing quiet blanketing the group as they waited to see if anything would happen, and when nothing did, they continued walking away from the door-</p>\n<p> </p>\n<p>“<em>Now isn’t this interesting?”</em></p>\n<p> </p>\n<p>The door had been flung open, and standing in the doorway was the Watcher. It was smiling down at them, the smile almost too large for its face, its expression was hidden by the mask, but that didn’t make it any less intimidating. The Hermits were frozen for a moment, and before they could try and escape the familiar glow of magic surrounded them, and suddenly they were standing in the ballroom, the door to their left swinging shut.</p>\n<p> </p>\n<p>Iskall tried to keep his breathing quiet as he sprinted down the hallway. He had been far enough at the back of the group that the Watcher hadn’t seemed to notice him slip away, and as guilty as he felt leaving his friends there, he needed to find Grian, he was the only one that stood a chance against the Watcher, and if he didn’t find him soon- if he didn’t-</p>\n<p>Iskall pushed the thought out of his head, he couldn’t think about that, not now. He ran around another corner into another hallway, skidding to a stop outside a door. He reached for the handle, hand pausing over it, for all he knew there could be another Watcher behind this door as well, or two, or a hundred, and he was all on his own. He took a deep breath, he couldn’t hesitate, the longer he took finding his friend the more dangerous it became for all of them, he grabbed the handle and pushed the door open slightly, looking inside.</p>\n<p>The inside looked like some kind of bedroom, and his eyes were drawn to the bed near the wall, spotting something lying in the sheets, facing away from the door. The purple wings almost made him close the door there and then, not wanting to be caught, but something made him stop. He squinted at the figure, they looked very small compared to the Watcher he had seen in the ballroom…</p>\n<p>Iskall almost laughed in relief as he realized that it was Grian, opening the door fully and shutting it behind him,</p>\n<p> </p>\n<p>“Grian!”</p>\n<p>The man in question shot up in his bed, whipping his head around to look at his friend, Iskall’s heart skipping a beat at the sight of the mask, his fear lessening slightly as Grian pulled the mask off his face, staring at him in shock. He stumbled out of bed, moving around it to stand in the middle of the room. Iskall took a step towards him, and Grian took a step back, eyebrows furrowing, his hand lit up for a moment, and Iskall glanced down at it,</p>\n<p>“Uh… Grian?”</p>\n<p>Grian continued to look at him, and after a moment the magic in his hand died down, and his eyebrows raised,</p>\n<p>“You… you’re actually here, how- what? <em>How?” </em>Grian stuttered, taking a few steps towards him, “Iskall, how the fuck are you <em>here?” </em></p>\n<p>“I know you’re confused and possibly angry but I don’t have any time to explain, we need to get to the others, one of the Watchers found us and-”</p>\n<p>“<em>What?!” </em>Grian shouted, wings twitching slightly. He sighed, loud and panicked, “Where? Where are they?”</p>\n<p>“The ballroom, I—”</p>\n<p>Iskall was cut off by Grian rushing past him, grabbing his hand as he opened the door and pulled him along down the hall. They both reached the room quickly, and Grian swore as he tried to pull it open, the door not bugging. He took a few steps back, lifting his hand towards it and, with no further warning, shot at it with his magic. It exploded open, wood flying outwards into the ballroom and sending smoke into the air. The duo ran into the room, pausing at the scene in front of them.</p>\n<p> </p>\n<p>Braid had Stress by the hair, lifting her off the ground slightly as she struggled against them, the other Hermits unable to move past the magic keeping them in place, powerless to stop it. Braid grinned at her pained expression, a staff held in their other hand, it was white, glowing bright enough with magic that it was difficult to look at. The end of it was pointed under Stress’s chin, tilting her head up towards Braid.</p>\n<p>Grian felt the world almost slow down, a million thoughts rushing around his head as he stared at them, and before he could think twice, he raised his hand out, firing his magic at Braid. It hit their arm, and they dropped Stress in shock, Stress yelping as she fell to the ground. Iskall dashed towards her, helping her to her feet and away from the Watcher. Braid stared at their arm for a moment, the skin where they had been hit charred and smoking slightly, and Grian felt his heart jump into his throat as they started laughing.</p>\n<p> </p>\n<p>“<em>Oh! Has our little Diamond grown a spine?” </em>They giggled, turning to face Grian properly, their movements jumpy and almost… inhuman as they moved towards him, “<em>Do you want to dance, Diamond? We are in a ballroom after all! Come on!”</em></p>\n<p>Grian trembled as he stood his ground, his hands lighting up as he prepared himself for a fight, he didn’t get a chance to do anything, however, as Braid grabbed him with their own magic and threw him into the wall opposite them, Grian crying out at the impact. The other Hermits yelled out to him, still unable to move despite how hard they struggled against the magic. Grian’s ears were ringing as he pushed himself to his feet, the world around him spinning as he stumbled away from the wall. Braid walked towards him, summoning another staff and throwing it at him, Grian blocking it with a shield only just in time.</p>\n<p>Braid sighed dramatically, “<em>You’re not even trying! This is why we had to kill your friends the first time, Diamond!” </em>They grabbed Grian again with their magic, lifting him into the air slightly before slamming him into the ground, the floor denting slightly at the impact.</p>\n<p><em>“You can’t even summon a weapon, </em>and<em> you continue to hold back even when your life is being threatened!” </em>Braid stopped walking towards him, smile growing larger as they looked over at the immobilized Hermits scattered around the room,</p>\n<p>“<em>Maybe it’s not your life that needs to be threatened.”</em></p>\n<p> </p>\n<p>Faster than the eye could see, Braid teleported over to the nearest Hermit.</p>\n<p> </p>\n<p>That Hermit being Mumbo.</p>\n<p> </p>\n<p>And for a moment he and Grian made eye contact, Grian unsteadily lifting himself off the floor.</p>\n<p> </p>\n<p>Then Mumbo squeezed his eyes shut, tensing up as Braid raised their staff towards him.</p>\n<p> </p>\n<p> </p>\n<p>Mumbo hesitantly opened his eyes after a moment, the air around him shifting as he felt something move in front of him.</p>\n<p>Grian stood between him and Braid, wings spread out behind him like some kind of barrier. He had a staff in his hands, one end going straight through Braid's chest. They choked on their breath, purple liquid running down the end of the staff and dripping on the floor. Grian pushed the staff further into their chest, hands shaking and eyes stony, and Braid coughed wetly, the purple substance (blood?) splattered onto his face. Braid staggered to their knees, one hand holding the weapon in their chest for support. The two were level with each other now, and Braid laughed lightly,</p>\n<p> </p>\n<p>“<em>…Full of… surprises… aren’t you, Diamond?”</em> They slurred, leaning forward towards Grian, “<em>I’ve got a… surprise for you too… wanna hear it?”</em></p>\n<p> </p>\n<p>\n<em>“It’s not over yet.”</em>\n</p>\n<p> </p>\n<p>And with that, Braid went still, slumping forward onto the ground as Grian pulled the staff out of their chest. The room was quiet, everyone star stuck as Braid’s body began to glow, purple particles flying into the sky as their body disappeared, until all that was left was a mask and a pool of blood. Grian looked at it for a moment before taking a step towards it, stamping on it with his foot, and breaking it in two.</p>\n<p>The Hermits, finding that they could move again, slowly walked towards their friend.</p>\n<p>“Are you alright, Grian?” Mumbo asked softly, reaching out towards him.</p>\n<p>There was no time to answer, as a loud, mournful wail rang out through the castle. The group glanced around the room, startled, and Grian swore quietly as he turned to face them.</p>\n<p>“Get behind me, <em>now.” </em>He shouted, stumbling further away from the broken doorway, the panic in his eyes quickly prompting the others to do as he said, forming a group behind him. Grian grabbed his mask from his inventory and put it on, his staff in hand and magic zapping around him. Mumbo had seen him use magic before, enough now that it didn’t even phase him, but this…</p>\n<p>Grian looked <em>dangerous.</em></p>\n<p>But as scary as he looked, Mumbo could see his knuckles go white as he clung to the staff.</p>\n<p> </p>\n<p>He was scared, God he was so scared, but he couldn’t let that show, not now. He needed to keep his friends safe, his stupid, stupid friends that should’ve never come back for him. His thoughts were cut off by Crown, who teleported into the room across from them. They only stood there for a moment before spotting the broken mask on the ground, letting out another cry as they ran towards it. They knelt in front of it, grabbing one of the broken pieces in their trembling hand. Their breathing was ragged, thick with anger and sorrow, nothing like the calm and collected Crown Grian knew.</p>\n<p>They looked up at him from across the floor, and he didn’t need to see their eyes to go cold at their stare.</p>\n<p> </p>\n<p>\n<em>\n<strong>“̰͉̚ Y̩͓͋o̢̝͔u̴͓̒.̓ͫ ”͑̇͘</strong>\n</em>\n</p>\n<p>“<em>You… <strong>BRAT!</strong>” </em></p>\n<p>Grian’s stomach lurched as he was thrown off his feet towards Crown, their hands gripping around his throat once he was close enough. He tried to gasp for air as their grip tightened, their sharp claws digging into his neck with no restraint. He grabbed their hand instinctively, trying to pull it off him, and when that didn’t work, he lifted his legs, using the momentum to kick at Crown with as much force as possible. He landed a good kick to their chest, startling them enough that he was able to pull himself out of their grasp and into the air, trying to gasp for breath through his now bruising neck. He didn’t have long, however, Crown throwing themself into the sky after him as soon as they steadied themself, Grian darting out of their way just in time. He tried to fly over to the other side of the room, however flying with an elytra was very different than flying with actual wings, and he hadn’t had a chance to relearn how to use them, Crown, on the other hand, had been using their wings their whole life, so catching up to Grian wasn’t all that hard.</p>\n<p> </p>\n<p>Grian had no time to react as he felt Crown grab his wings, yelping as he was yanked backward. He struggled in their grip for a moment before he was falling, still tight in the Watchers grasp, and all he could do was tense as he was forced face-first into the ground, Crown landing harshly on his back. The wind was knocked out of him, he tried to take a breath as his head spun, Crowns voice splitting through the haze only just,</p>\n<p>“<em>I don’t think you quite realize what you’ve done.” </em>They spat, leaning in close to his ear. He tried to push himself off the ground but was stopped by Crowns weight, gasping as a hand on his head forced his face back into the ground, their knee digging into his back painfully.</p>\n<p>\n<em>“Because of your actions, I’ve got to punish you. An eye for an eye, don’t you think, Grian? One of your pathetic, puny, insignificant friends in exchange for what you’ve just taken from me? And this time, I’m going to make you w a t c h--”</em>\n</p>\n<p>Crown flinched slightly as an arrow landed in their arm. They looked at it for a moment before pulling it out and snapping it in their hand, looking over at whoever had just fired at them. Grian’s head was yanked around in the same direction, Crown forcing him to look over at his friends.</p>\n<p>False stood with her arm outstretched, bow tight in her hand.</p>\n<p>Crown brought their face down to Grian’s again, “<em>Look at that, we have a volunteer.”</em></p>\n<p> </p>\n<p>Crown threw his head back into the hard ground, Grian groaning at the impact, his ears ringing. The Watcher stood, their hand not even moving as they grabbed the other hermits with their magic, forcing all but False to their knees. False tried to stand her ground, shoving her feet into the floor as she was dragged towards the Watcher. Crown stood tall before her, smiling down at her as they summoned a staff in their hand, holding it up to her cheek. False’s eyes watered at its light, turning away from it as Crown dragged it across her face lightly, the slightest touch leaving a cut on her cheek. Crown chuckled at the sight of it,</p>\n<p>“<em>Oh, the Queen of hearts and body parts looks to be a little afraid! Where’s the brave face of yours?”</em></p>\n<p>False laughed lightly, looking up at Crown through squinted eyes, “You know, for a group that calls themselves ‘Watchers’, you lot really aren’t all that observant.”</p>\n<p>Crown’s eyebrows furrowed behind their mask, their confusion cut off by a stabbing pain in their back, and they let go of False as they turned to look behind them. There stood Impulse, sword in hand, the end of it lodged firmly in Crown’s back. The Watcher cried out in annoyance, throwing both False and Impulse away from them.</p>\n<p>“<em>How did you--”</em></p>\n<p>“Come on,” Crown was cut off by Ren, who was looking at them with a slight glint in his eyes, “You do know enderpearls exist, right? Were you so caught up in your little fight with Grian that you didn’t notice there were less people over here? Might want to get your eyes checked, dude.” The other hermits laughed slightly at Ren’s remark, still pinned to the ground.</p>\n<p>Crown growled, shoulders tensing and hand lighting up as they looked at Ren, “<em>And you should get that tongue of yours looked at, or perhaps I should just remove it all together--\"</em></p>\n<p> </p>\n<p>Crown was cut off again, this time by being thrown through a window to their right. The rest of the hermits stared at the hole in the glass a little shocked, and finding that they could again move, they got to their feet. Grian was also on his feet, barely, standing in the middle of the room holding most of his weight against the staff planted firmly into the ground. He was breathing heavily, and he definitely looked worse for wear, his jumper ripped and face bruised and bloody.</p>\n<p>“…Nothing I say… is going to make you all go home… is it?” he mummed between breaths, his expression hidden by his mask but still recognizably defeated.</p>\n<p>“Nope,” Doc replied, his grin bright and unapologetic.</p>\n<p>Grian sighed, painfully, “…Right.” he stumbled slightly closer, still using the staff as a crutch.</p>\n<p>“They’re going to be back here any second now, and they’re not going to hold back. Don’t get close, if you’re able to, you won't be able to kill them but that doesn’t mean you can't hurt them. Just… I need an opening to get them unguarded.”</p>\n<p>The other hermits nodded, spreading out over the ballroom. Grian shut his eyes, letting himself feel for the magic surrounding him. It was more powerful now, maybe because of the adrenaline, or maybe because he was currently running on magic and pure will alone at this point, whatever it was, he was grateful for it. He summoned another staff, gripping it tight his hand just before he felt a surge of magic to the side of him, calling out for the others to get away from the wall a second before it exploded inwards. Crown flew in through the hole, magic dancing around their body like lightning, their head scanning around the room until they found Grian, darting towards him with a screech, all sense of self seemingly lost in the moment as they threw themself at him with wild abandoned. Grian summoned a shield, stumbling back behind it as he tried to keep it intact.</p>\n<p> </p>\n<p>Crown’s attention was drawn away from Grian by a series of fireworks shot into their back (their back, Grian realized, that still had Impulse’s sword in it), and without thinking twice, Crown whipped around, rushing towards Scar who stood on the other side of the room, his crossbow still pointed towards them. Scar stood frozen in place for a moment, mind stuttering at the image of 7-or-so foot tall, animalistic creature rushing towards him. He stood frozen for long enough that Cub panicked, looking between his friend and the Watcher for a moment before deciding that he needed to do something.</p>\n<p>That something, apparently, being to get between the two, and punch the Watcher as hard as be could. Which was pretty damn hard. Crown stumbled back, their mask thrown from their face at the impact, and the Hermits stood in shock at their face.</p>\n<p>Dozens of eyes stared back at them, each differing in size and having no real symmetry to them. The lack of a mask truly made them look otherworldly, along with the tattered and tangled hair and magic still zapping around them, it was an image of something unhinged.</p>\n<p> </p>\n<p>It was exactly what Grian needed.</p>\n<p> </p>\n<p>As quickly as he could, he ran up behind Crown, crying out as he stabbed them through the back with his staff. Crown screamed, trying to turn around but unable to as Grian grabbed at the other staff in his hand, stabbing that one through their chest as well. Crown choked for a moment, stumbling backwards and onto the ground, laying on their side, barely keeping themself upright with their hands.</p>\n<p>The room grew quiet, the hermits shuffling further behind Grian, the man looking down through his mask at Crown. Neither said anything for a moment, the only sound between them being their laboured breathing. then Crown laughed, wet with blood that tricked down their chin and into the growing puddle of purple beneath them,</p>\n<p>“<em>…Never thought you had it in you… Diamond…” </em>They chuckled weakly; their lidded eyes pinned solely to Grian. Grian’s were still hidden by his mask, his visible face blank as he looked down at the Watcher.</p>\n<p>“<em>Maybe we’re… more alike than you thought--”</em></p>\n<p>“I’m nothing like you.” Grian interrupted, voice croaky and dry. Crown hummed thoughtfully, sinking further to the ground as their strength drained from them.</p>\n<p>“<em>Whatever you want to tell yourself…”</em></p>\n<p>There was a moment of silence, and Grian thought about his next words carefully.</p>\n<p>“Why did… out of everyone in Evo…” He stuttered slightly, hands clenching weakly, “Why’d you take me?”</p>\n<p>Crown was quiet for a moment, looking at the floor as they thought about their answer.</p>\n<p> </p>\n<p>“<em>You were… different… everyone else we had ever come across… had eventually yielded to our power; our presence. You… you didn’t,” </em>they were quiet for another moment,<em> “I suppose… We wanted to know… what would break you.”</em></p>\n<p>“…Guess you’ll never find out.”</p>\n<p> </p>\n<p>Crown didn’t respond, their body already fading away, leaving nothing but the mask. Grian shuffled towards it, not having the energy in him to break it himself, he summoned one last staff, lifting it in front of him and ramming it through the middle of the mask, breaking it two.</p>\n<p> </p>\n<p>Mumbo watched his friend stand there for a moment, leaning on the staff heavily. He was about to call out to him-</p>\n<p>And then Grian was falling.</p>\n<p>Mumbo’s eyes widened, rushing forward toward him. He didn’t make it in time to catch him, kneeling down beside Grian who was trying to keep himself off the ground.</p>\n<p>“Are you- are you alright?”</p>\n<p>Mumbo’s worried question was cut off by distant noises from outside, and Grian swore quietly, taking the mask off his face. Mumbo flinched at the sight of him, without the mask obscuring his face he could really see the damage Crown had done,</p>\n<p>“What’s going on now?” Xisuma asked, looking out the hole in the wall.</p>\n<p>“Other Watchers… now that Braid and Crown are gone, this territory’s up for grabs… and we do not want to be here when they come to fight for it.” Grian explained, voice slurred slightly. Mumbo helped him to his feet, one of his hands under the shorter man for him to lean on. The hermits ran into the hallway towards the entrance, Mumbo and Grian following slowly behind, Grian leaning most of his weight onto his friend beside them.</p>\n<p> </p>\n<p>“Mumbo…-”</p>\n<p>“If you’re about to tell me to leave you behind, just shut up now.”</p>\n<p>Grian clamped his mouth shut, looking away from his friend in a huff. They continued down the hallway as fast as they could, making it to the staircase near the entrance before Grian gasped painfully, tripping slightly onto the ground. Mumbo leaned down to help Grian sit on the ground, propping him up against the wall in front of the stairs. Grian clutched at his side, face twisted up in pain. Mumbo moved his hands, breathing in deeply at the sight. The left side of his jumper was covered in blood, seeping out from a wound on his stomach.</p>\n<p>“You, you stupid, stupid bloody idiot, why didn’t you tell anyone,” Mumbo stuttered, pulling Grian’s jumper off him to get a closer look at the injury, leaving him in his undershirt.</p>\n<p>“We needed to… get out of there.” Grian slurred, trying hard to keep his head from falling forward, resorting to just leaning it back on the wall along with the rest of him. Mumbo pushed Grian jumper over the wound, trying to stop the bleeding somewhat. The noises from outside, now recognizable as dozens of voices screaming and screeching, were getting closer, and Mumbo was trying desperately to think of how to get Grian out of there without hurting him more.</p>\n<p> </p>\n<p>“M-Mumbo I’ve…. Gotta tell you s’mthin’…” Grian slurred more, having to actively work to keep his eyes open now</p>\n<p>“You can tell me when we get home,” Mumbo muttered, typing something into his communicator, hoping beyond hope someone would see it and respond.</p>\n<p>“No, it’s… it’s important… please.” Grian whined, and Mumbo sighed weakly, looking at his friend with slightly watery eyes, his face as tense as the rest of him.</p>\n<p>“…I’m Poultry Man.” Grian laughed lightly, cringing slightly at the movement. Mumbo also laughed, startled and choked up, the tears in his eyes actively spilling over now,</p>\n<p>“Don’t- Don’t be ridiculous, there’s… no way you could be Poultry Man.” The Redstoner smiled a small smile, though it turned into more of a grimace. It was enough for Grian though, he made him laugh, which was what he was going for.</p>\n<p>The world around Grian grew dull, and he could faintly hear Mumbo calling his name, but he sounded too far away now, maybe he’d left him there to get back to the portal, he hoped so, he needed them to stay safe…</p>\n<p> </p>\n<p>Then Grian’s world went dark.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>And suddenly, Grian’s world was white.</p>\n<p> </p>\n<p>Grian opened his eyes, less tired and less in pain. In fact, he wasn’t in pain at all. He furrowed his brow, looking out at the vast expanse of white around him, it was like one of his infinity room but… something told him that this place probably did span on forever.</p>\n<p>He sat up, head spinning slightly as he tried to distinguish up from down,</p>\n<p>“Hello, Grian.”</p>\n<p>Grian froze. He turned his head slowly in the direction of the voice, breath caught in his throat. His voice was small, like he didn’t believe the word he was about to say,</p>\n<p> </p>\n<p>“…Netty?”</p>\n<p>\n<span>Grian just… stared, gawked maybe is the better word. It was like his brain had malfunctioned, what he was seeing hadn’t caught up to him yet. He’d had thoughts about something like this before, that one of these days he was well and truly going to lose it and start seeing hallucinations of his dead friends or something, the Universe’s last hurrah before it broke him for good. He didn’t move when Netty </span>\n<em>\n<span>(was it her? Was she really here?)</span>\n</em>\n<span> slowly sat down in front of him, but he almost looks away at the sight of her sitting on well… nothing, they were both sitting on nothing.</span>\n</p>\n<p> </p>\n<p>\n<span>“Grian…?” her voice was soft, it had always been soft, even when she was laughing or telling him off, there had always been that underlying kindness to it that made her so approachable, so friendly. She reached out to him, and gently, so gently, placed her hand over his.</span>\n</p>\n<p>\n<span>He looked down at her hand, it felt warm, alive.</span>\n</p>\n<p> </p>\n<p>\n<span>“…Where are we?” he asks quietly, still too dazed to really think properly, “Am… am I…?”</span>\n</p>\n<p> </p>\n<p>\n<span>“No, no you’re not dead.” Netty reassured, “I think… this place might be some sort of in-between maybe… I’m not quite sure.”</span>\n</p>\n<p> </p>\n<p>\n<span>Grian nodded slowly, continuing to look down at their hands, there was a part of him that was scared if he looked up, she’d disappear. He felt his stomach drop for a moment, he might not be dead, but…</span>\n</p>\n<p> </p>\n<p>\n<span>“I’m… God, Netty, I’m so sorry,” his voice broke, strained and desperate with emotion. There were nights, the very bad nights when he had first just joined Hermitcraft, where he’d stay up and think about what he’d say to his friends if he’d get the chance. None of those nights ever ended in forgiveness. Now that he was here and he had a chance to say something, he found himself at lost of words, his mouth opening and shutting as he tried to find something to explain how sorry he was for what happened and how they could hate him and he hated himself too and-</span>\n</p>\n<p>\n<span>“Grian, it wasn’t your fault.” Netty’s voice cut off his train of thought, and he finally looked up at her, she was smiling, eyes soft and forgiving, “No one blames you, and no one should. We love you Grian, please never think otherwise.”</span>\n</p>\n<p> </p>\n<p>\n<span>And something inside him broke.</span>\n</p>\n<p> </p>\n<p>\n<span>His next breath was shuddering, and the breath after that even more so, and then there were tears streaming down his face and then he was holding onto her so tightly, and she was hugging him back with equal ferocity and a part of him wondered if he even deserved this.</span>\n</p>\n<p>\n<span>Neither of them spoke, they just sat there and held each other, and that was enough. Grian wasn’t thinking, he couldn’t, everything that had happened in the past few hours was crashing down around him and this was the straw to break the camel’s back, he could barely see anything from the tears in his eyes (not that there was much to see in the first place), but he felt her arms around him and it felt like coming home.</span>\n</p>\n<p> </p>\n<p>\n<span>They broke away after a moment, and distantly Grian could hear a ringing in the back of his mind, but he paid no attention to it.</span>\n</p>\n<p>\n<span>“So… so now what? If I’m not… dead then, why am I here?” Grian croaked, voice raw from the emotions.</span>\n</p>\n<p>\n<span>Netty was quiet for a moment, a thoughtful expression crossing her face.</span>\n</p>\n<p>\n<span>“I think… the Universe wanted to be kind.”</span>\n</p>\n<p> </p>\n<p>\n<span>Grian almost laughed, the Universe being kind to him was a bitter thought, the Universe wasn’t kind to him, it had never been. He sighed, the shock of it all was wearing off now and the ringing getting louder. </span>\n</p>\n<p> </p>\n<p>\n<span>“So… what’s it like, on the other side, I mean,” Grian asked, and Netty laughed slightly,</span>\n</p>\n<p> </p>\n<p>\n<span>“Don’t be naughty, Grian, I don’t think I’m allowed to tell you that,” she replied cheekily, leaning back on her hands. Grian blinked a few times, trying to get rid of the tears that had filled his eyes at the phrase, cursing himself mentally for getting so worked up over a word. A comfortable silence fell over the two for a moment, but then Grian bit his lip, looking away from the girl in front of him,</span>\n</p>\n<p> </p>\n<p>\n<span>“I… I’m so scared, Netty,” he confessed, his voice quiet, “I… I killed them, permanently, I killed them.” He shook his head slowly, like the information was surprising to himself, “And I… I didn’t feel bad. I </span>\n<em>\n<span>don’t </span>\n</em>\n<span>feel bad.” </span>\n</p>\n<p> </p>\n<p>\n<span>Netty shook her head as well,</span>\n</p>\n<p> </p>\n<p>\n<span>“That doesn’t make you a bad person, Grian. You were protecting yourself and your friends, they didn’t give you a choice.” She frowned, looking at her friend with a serious look in her eyes, “If anything Grian you’re… you’re brave, you’re so brave. You’re brave for standing up for yourself and in a very, very stupid way, you were brave for being willing to sacrifice yourself for them.”</span>\n</p>\n<p> </p>\n<p>\n<span>She paused for a moment,</span>\n</p>\n<p>\n<span>“That was a stupid thing you did though, I hope you know that.”</span>\n</p>\n<p> </p>\n<p>\n<span>Grian laughed, his body relaxing slightly. He frowned after a moment, however, the ringing loud enough now that it was irritating,</span>\n</p>\n<p> </p>\n<p>\n<span>“Do you hear that?”</span>\n</p>\n<p>\n<span>Netty shook her head, tilting her head at her friend, “No?”</span>\n</p>\n<p>\n<span>Grian hummed, trying to block it out. He leaned forward slightly, wrapping his arms around his legs and putting his chin on his knees,</span>\n</p>\n<p>\n<span>“… I don’t want to leave you here.” He admitted, mumbling into his jeans. Netty smiled apologetically at him,</span>\n</p>\n<p> </p>\n<p>\n<span>“I don’t think we have a choice with that, I’m afraid,” she paused for a moment, “Plus, you have people you need to get back to.”</span>\n</p>\n<p> </p>\n<p>\n<span>He nodded quietly; she was right. It… it was time he started focusing on the future instead of the past. Time for him to move on. He laughed a little as a thought came to him,</span>\n</p>\n<p> </p>\n<p>\n<span>“You know I’m… I’m a little surprised Taurtis isn’t here.”</span>\n</p>\n<p>\n<span>Netty look at him confused, “What do you mean?”</span>\n</p>\n<p>\n<span>Grian laughed a little awkwardly, rubbing the back of his head, “Oh well, I mean I was closest to him out of everyone, so I guess… I thought that might’ve made more sense.”</span>\n</p>\n<p>\n<span>The ringing was getting almost overwhelming now, and Netty still looked confused.</span>\n</p>\n<p>\n<span>“No Grian, I mean why would Taurtis be here at all?”</span>\n</p>\n<p>\n<span>Now Grian was confused, he put his hands over his ears instinctively at the ringing, but it did nothing, and he could feel himself getting… dizzy.</span>\n</p>\n<p>\n<span>“Wh... what do you mean…” he slurred, trying to keep himself upright.</span>\n</p>\n<p> </p>\n<p>\n<span>“Grian… Taurtis isn’t with us, on the other side.”</span>\n</p>\n<p> </p>\n<p>\n<span>And for the second time, Grian’s world went black.</span>\n</p>\n<p> </p>\n<p align=\"center\">2 Months Later</p>\n<p> </p>\n<p> </p>\n<p>\n<span>Grian flew through Hermitville, moving his way through the insanity that had become of it due to the build off. Ren had just joined the competition it seemed, his van now flying high above the ground directly in front of Grian’s house (He needed to think of something to counter that, now that he thought about it…). Grian smiled to himself as he landed in front of his house, craning his neck up to look at it stretch up high above him, he’d almost been disqualified a little while ago, Mumbo throwing a fit when he’d seen Grian using his wings to build instead of an actual elytra, which in his words, “was cheating.” Grian counted that with the fact that he couldn’t exactly… use an elytra anymore, without his wings getting in the way, which shut Mumbo up fairly quickly. He chuckled to himself at the memory, walking through his front door and tucking his wings tight behind him.</span>\n</p>\n<p> </p>\n<p>\n<span>He paid no mind to the number of chests and shulker boxes that surrounded the room, telling himself he’d get to them later, and made a b-line towards a small hole in the floor. He grabbed ahold of the ladder leading down, being sure to not hit his wings on the cramped area. He reached the bottom, turning to look at the room in front of him. His old magic room, practice room, whatever he had called it, had been renovated. Soft grass now replaced the harsh stone ground, the walls and ceiling had been replaced with glass that looked out into the surrounding water. Torches stood on fence posts along a small pathway, lighting the room up, and at the end of the pathway… a face, Taurtis’ face.</span>\n</p>\n<p> </p>\n<p>\n<span>The other hermits had been, understandably, confused when they’d seen the room for the first time. But Grian had assured them it was nothing to be worried about, that he knew what he was doing and that they just had to trust him, which was enough to calm their nerves. Grian walked up to the shrine lightly, the room was almost soundproof, being so far underground, and that along with the dim lighting, gave the room a very calming atmosphere. Sometimes he’d come down here just to get away from everything.</span>\n</p>\n<p> </p>\n<p>\n<span>He opened his inventory, grabbing the rose from it and holding it in his hand carefully. He’d built the room as soon as he had recovered enough to do so, he had wanted to as soon as he’d woken up back in Hermitcraft, but the others had near about tied him to the bed until he was well enough to walk on his own again. Which, thinking back on it now, was understandable.</span>\n</p>\n<p>\n<span>Grian took a breath, kneeling into the dirt and planting the flower, making sure that it was in the ground properly before letting go and standing back up. The room was covered in flowers of every kind, and it looked very beautiful, more so than it had back in Evo. To Grian however…</span>\n</p>\n<p>\n<span>Despite the room’s beauty, it still made his stomach churn. It had only taken a few days for Taurtis to show up at the summoning platform last time, here, however, almost two months had passed and… nothing. He planted a flower every day, and he was almost worried about running out of room, still, he kept his hopes up, he had to. He knew he was probably grasping at straws, but this was the only idea he had, he had no idea where Taurtis could be, let alone if he… was actually alive. Netty had said they he wasn’t with them but… </span>\n</p>\n<p> </p>\n<p>\n<span>He signed, he always got lost in his head when he thought about it. He shook his head, drawing himself back into the present. Looking up at the face, he smiled softly, even if this didn’t work… he would be ok, he had his friends by his side, and though the sting when he thought about Evo would never fully go away… he could handle it.</span>\n</p>\n<p> </p>\n<p>\n<span>He turned to walk back to the ladder--</span>\n</p>\n<p> </p>\n<p>\n<span>--and heard muffled sound from under the ground.</span>\n</p>\n<p> </p>\n<p>\n<span>Grian stopped in his tracks, not even breathing as he tried to listen for another noise.</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“… Hello...?”</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Grian whipped around, crashing to the ground and digging at the dirt where he’d just planted the flower. His mind was going at a million miles an hour, and his hands were shaking as he dug, dirt getting under his fingernails in his haste, but he didn’t care,</span>\n</p>\n<p> </p>\n<p>\n<span>And then the block broke,</span>\n</p>\n<p> </p>\n<p>\n<span>And,</span>\n</p>\n<p>\n<em>\n<span>And,</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>“Oh! Grian!”</span>\n</p>\n<p> </p>\n<p>\n<span>Taurtis looked up at him from under the ground, a pleasantly surprised smile on his face, but then his smile fell, and an annoyed look took its place,</span>\n</p>\n<p> </p>\n<p>\n<span>“Aw man, did I sleep through the Update again?”</span>\n</p>\n<p> </p>\n<p>\n<span>Taurtis grabbed at the edge of the hole, lifting himself up through it as Grian sat back in shock. Taurtis sat on the edge of the hole, his feet dangling into it.</span>\n</p>\n<p> </p>\n<p>\n<span>“Dude I swear I was going to come with the group, but I guess I just slept in again? I need to stop doing that, maybe I need to build an alarm clock or something, anyway, I like, woke up in that upside-down-- no what did we call it before? Downside up or something-- and I tried to get to the Update portal, but it was in the Nether and none of the portals there would work! Which was really annoying! But I was still tired, so I went back to sleep and… and you’re crying…”</span>\n</p>\n<p> </p>\n<p>\n<span>Taurtis trailed off, noticing Grian’s face. He was crying, looking at his friend with wide, almost unbelieving eyes. Neither of them said anything for a moment, Taurtis’ expression growing concerned.</span>\n</p>\n<p> </p>\n<p>\n<span>“Are… are you alright?”</span>\n</p>\n<p> </p>\n<p>\n<span>Grian laughed, and then he laughed harder, and then he leaned over the hole and grabbed Taurtis, pulling him towards him into a hug, still laughing. Taurtis, despite his confusion, laughed with him, hugging his friend back as hard as he could.</span>\n</p>\n<p> </p>\n<p>\n<span>After a moment Grian’s laughed trickled to a stop, and he sniffled, rubbing the tears out of his eyes,</span>\n</p>\n<p> </p>\n<p>\n<span>“I’m… I’m alright,” he choked out, still chuckling quietly, “I think… I’m going to be alright.”</span>\n</p>\n<p>\n<span>And as Grian held his friend, he had a thought, that maybe, just this once,</span>\n</p>\n<p> </p>\n<p>\n<span>The Universe was going to be kind.</span>\n</p>"
}