{
  "id": "19160302",
  "url": "https://archiveofourown.org/works/19160302?view_full_work=true",
  "author": [
    "ShanaStoryteller"
  ],
  "title": "Thy Kingdom Come",
  "rating": "Not Rated",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [],
  "fandoms": [
    "Good Omens - Neil Gaiman & Terry Pratchett",
    "Good Omens (TV)"
  ],
  "relationships": [
    "Aziraphale/Crowley (Good Omens)",
    "Crowley & Adam Young (Good Omens)"
  ],
  "characters": [
    "Crowley (Good Omens)",
    "Aziraphale (Good Omens)",
    "Adam Young (Good Omens)",
    "Michael (Good Omens)",
    "OFC"
  ],
  "additional_tags": [
    "Crowley centric",
    "Crowley POV",
    "King of Hell Crowley",
    "Raquel: Angel of Justice",
    "crowley has a lot of feelings"
  ],
  "language": "English",
  "series": "",
  "published": "2019-06-10",
  "completed": null,
  "words": "13,232",
  "chapters": "1/1",
  "comments": "429",
  "kudos": "7,885",
  "bookmarks": "2,441",
  "hits": "53,220",
  "summary": "<p>Crowley is just following orders.</p>",
  "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>i hope you liked it! feel free to follow / harass me at: shanastoryteller.tumblr.com</p>",
  "text": "<p>Crowley hadn’t meant to fall.</p>\n<p>He was, unlike the rest of them, just following orders.</p>\n<p>Give Eve a choice. Let her make it. Crowley did as She asked, because that’s all he’s ever known. If anyone should have fallen, he thinks it should have been the angel that gave his sword away to the disgraced humans.</p>\n<p>He doesn’t actually think that.</p>\n<p>He was rather relieved, actually, that they would have fire, at least, to keep them warm and cook their food.</p>\n<p>When all is said and done, and rain pours down, the taste of Her tears sweet on his lips, Michael finds him sitting on the edge of the wall surrounding Eden. “Lucifer is dead.”</p>\n<p>Crowley glances at her out of the side of his eye. She looks – different. Like glass that’s shattered but still holding its shape. Before there was anyone, before he was more than a thought in Her mind, there was Michael, and she had Lucifer. Siblings, lovers, friends. Crowley hadn’t known, and hadn’t asked. But their hearts had beat as one, and now Michael’s heart beats alone.</p>\n<p>“He burned up in the atmosphere,” she continues, “his death cleared the chemicals from the air outside the garden. The humans can breathe here now.”</p>\n<p>She’s looking up at the clear, beautiful sky, blue as far as they can see. He sighs, pulling his leg up to his chest and resting his chin on his knee. She raises a hand, something burning in the palm of it, and he reaches out to wrap his long fingers around her wrist. “Don’t.”</p>\n<p>“Why not?” she says, voice cracking like the rest of her. “They’ve caused nothing but trouble. If it hadn’t been for the humans, Lucifer wouldn’t have – we would still,” she cuts herself off.</p>\n<p>Crowley thinks that if Lucifer died, it’s because Lucifer chose to die. He fell and gave humans the world. When he gave Eve the power to choose, he gave her the power greater than that of an angel. When she bit the apple, she gave herself the knowledge of Her. So many choices, so many consequences, that it makes his head ache to think of it.</p>\n<p>“He died for them,” he says instead of trying to talk through any of that mess, “don’t let his death be in vain.”</p>\n<p>The celestial fire goes out in the palm of her hand, and then she clasps her hands together in her lap, like that will hide their shaking.</p>\n<p>“They need a leader,” she says, “the fallen.”</p>\n<p>“Be my guest,” he murmurs. “Although it does appear to be that falling is a subjective thing.”</p>\n<p>He’s become a demon for doing as he’s told. He doesn’t understand. Why would She do this to him?</p>\n<p>“I am to lead heaven,” she says, “and Lucifer was to lead hell. That was the plan.”</p>\n<p>Crowley can’t help the swell of amusement at that. “He didn’t like plans. Too many things to go wrong with them.” If the last thing Lucifer ever did was thwart one of Her carefully laid plans – well, they can at least know he died laughing.</p>\n<p>“Hell needs a king,” she insists.</p>\n<p>His temper flares. “Well, why are you talking to me? Go support one of the dozen idiots jockeying for power down there. Why <em>are</em> you talking to me anyway? We’re not supposed to be consorting with one another now.”</p>\n<p>They hadn’t really gotten on before, when he was still like her. He’d just been a lowly angel with the ability to shift into a snake. Maybe he’d been a snake first, before She had decided She needed another angel, he’s not sure. He was Crawley, then Crowley, but really he was no one, and she was Michael, burning so bright and pure and sharp that even like this, on the edge of breaking, she's still the best of them.</p>\n<p>She reaches out and touches his hand. He flinches, expecting her touch to burn, but it doesn’t. “You still have your wings. What other fallen has wings? You can still perform miracles, Crowley.”</p>\n<p>“Only little ones,” he says morosely. There’ll be no parting of any seas for him, no cities dissolved to salt, none of that. Not that he’d had any mind to do that to begin with, but he’d like that he could have, if he wanted.</p>\n<p>She brushes her fingers against his cheek, and he has to resist the urge to lean into her touch. She feels warm. Sometimes he feels like he’ll never be warm again. “You are not like the other fallen. If you go down there and make your bid for king, they will fall in line for you, they will obey you.”</p>\n<p>“But I don’t want to be king,” he insists. All he’d ever wanted was this, his brothers at his side and Eden at his back. Alright, maybe a little more than that, an explanation or two, just some more insight into how it all worked, is all.</p>\n<p>He fell because of his thirst for knowledge, and so did Eve. The irony doesn’t escape him, that he was the one to tell her of the apple. At least she got her answers. He just got thrown from his home with no explanation, as usual, no answers, no knowledge, no anything.</p>\n<p>Michael’s grip on the back of his neck is tight enough that it’s painful, but she’s not looking at him anymore, instead staring out at the great expanse of earth that now belongs to men, and he just knows she’s thinking of where in the clear blue sky her Lucifer burnt up, which part of the sky is the closest shade to the blue of his eyes, and does not take the pain personally. “We don’t get what we want, Crowley. Take the throne. Lead them. Because if it’s not you, it will be someone else.”</p>\n<p>Someone worse, she doesn’t say, but he hears it just fine anyway. The others didn’t fall so much as jump, their wings burning and mouths screaming as they hurtled towards earth.</p>\n<p>“Can you just stand by and do nothing?” she presses. “All it takes for evil to triumph is for good men to do nothing.”</p>\n<p>“I’m not a man,” he says, because he isn’t, no more than she’s a woman or She’s a woman or any of them are anything. But they’re close enough, he supposes, in the grand scheme of things.</p>\n<p>“You’re <em>good</em>,” she insists, and tears prick his eyes at her conviction, at what should be an insult to him now.</p>\n<p>He tilts his head back, catching the sweet rain on his tongue, looking up at the clear blue sky.</p>\n<p>Lucifer had been good too, up until the end, he thinks, from his perspective and all. Maybe that’s why he’d fallen. He’d loved Lucifer too much to hate him, and Michael is so good at hating, she’s just better at loving, in the end.</p>\n<p>“Alright,” he whispers. “I – okay. Okay.”</p>\n<p>Michael leans forward, pressing her lips to his forehead, and he closes his eyes at the sensation. “Goodbye Crowley.”</p>\n<p align=\"center\">~</p>\n<p>It’s as easy as Michael said it would be. Of course it is. They’re all rotting and wailing, skin lesions and the odor of decay impossible to escape. Then he shows up, wings perfectly intact if a darker hue, his skin clear, nothing to mark him as demonic but his eyes and the snake tattoo up the side of his face. He must be shining to them.</p>\n<p>Beelzebub presents him with a crown of onyx, dark and slick and shimmering in the light of hellfire. He lounges sidewise on his uncomfortable throne of iron and bows his head so that she may place it on him. It’s cold against his skin. “You are my eyes,” he declares, looking at her, “you are my ears, you are my mouth.”</p>\n<p>She brightens, if such a thing is possible in a place like this, with a being like her. He’s the king of hell. But that doesn’t mean he has to run the damn place himself.</p>\n<p>He’s not in hell often after that, but his crown remains as a phantom sensation, just as heavy as his halo used to be light. He thinks about it, and it’s there, pressing against his skin, reminding him of his place just as surely as manacles around his wrists.</p>\n<p>The best thing is that he doesn’t actually have to do much.</p>\n<p>He says he’s topside to keep an eye on things, because if you want a job done properly, then you have to do it yourself. He doesn’t commit murder or any other array of unspeakable horrors – no, he’s their king, he has more important things to do. He is a heralder of wars, a bringer of sickness, temptation and sin swelling across the land.</p>\n<p>The most impressive things he’s supposedly done have nothing to do with him at all, just humans being humans, just the result of too much sickness and not a deep enough understanding of hygiene. But what his dear disciples don’t know won’t hurt him.</p>\n<p>This is how he keeps running into Aziraphale.</p>\n<p>He keeps wondering if the angel will catch on, this kind, soft angel with a razor sharp edged who risked falling to give the humans a little bit of warmth. Crowley doesn’t think Lucifer and Aziraphale ever met properly. If absolutely anything set Crowley apart from the other low level angels, it was simply that he had caught Lucifer’s eye when the rest of them hadn’t. He was far below even Aziraphale, no one would have ever thought to give him a flaming sword.</p>\n<p>But he doesn’t figure it out, they talk about quotas and head offices and Aziraphale keeps smiling at him even though he shouldn’t, keeps coming to him and for him even though he shouldn’t. He must not be able to see the crown around his head, must not be able to see the ways he’s different from any other demon. Then again, demons and angels don’t usually cross paths. That’s why this is so unusual, him and Aziraphale running into each other over and over again.</p>\n<p>How many times before it’s obviously not a coincidence? How many times can he get away with searching for an angel who loves books and smells like cotton candy and woodsmoke before it’s no longer possible to pass it all off as a coincidence?</p>\n<p>Whatever that number is, he thinks they’ve passed it.</p>\n<p align=\"center\">~</p>\n<p>Crowley isn’t expecting to run into another angel, never mind an archangel, and yet here she is, dark curly hair and olive skin, towering over him by a head and her deep brown eyes sightless.</p>\n<p>“Oh, fuck,” he says, “have you come to drag me to hell?”</p>\n<p>That’s what she does to miscreant demons, drags them kicking and screaming back downstairs, discorporates them so they have no choice but to hang around down there until Beelzebub can be assed to summon him so he can miracle them up a new body.</p>\n<p>She looks at him with her sightless eyes and asks, “What good would it do me to drag a king back to his domain?”</p>\n<p>His eyes dart around them, like Aziraphale is hovering around corners waiting to hear the secret that Crowley has been successfully keeping from him all these years. He isn’t, of course. “Got some holy water then?”</p>\n<p>Dying isn’t all that appealing, but if the archangel Raquel has gotten it into her head to kill him, he’s not sure he can stop her. He could make a bid of trying to summon Michael and hiding behind her, but he’s not sure how much good it will do. She hates earth. He hasn’t spoken to her since she convinced him to make a bid for the throne of hell.</p>\n<p>Actually, last he checked, every angel but one hated earth. “What are you doing down here anyway?”</p>\n<p>She keeps looking at him, seeing him but not seeing him, and he shifts his weight from leg to the other. Her gaze is uncomfortable, because he doesn’t know what he looks like to her, a demon or an angel, a king or a snake. He’s all of them, and none of them, and sometimes it is exhausting to be nothing.</p>\n<p>Often, it is exhausting to be nothing.</p>\n<p>“I am the angel of justice,” she says. “How can I impart justice in heaven?” It’s not the truth, not really, and he doesn’t even have to call her on it, just keeps staring at her until she turns away from him and says, “I cannot find the way back to heaven.”</p>\n<p>“You’ve fallen?” he demands, incredulous, because Lucifer was one thing, the impetuous, demanding morning star, but Raquel is – she’s different, he’d sooner see Michael fall than her.</p>\n<p>In the next second the breath has been knocked from his lungs and he’s being pressed up against the wall, her divinity seeping through her skin, the heat of her touching him so intense that he fears she’s burning him, but he’s too scared to look away from her twisted face to check. “I am not <em>fallen</em>, you pathetic, squirming, beast. How dare you – I would never –”</p>\n<p>“Okay,” he says, soft like he’s talking to a wounded animal, a wounded human. “Okay, okay. I’m sorry.”</p>\n<p>Her grip loosens and she steps back. “You’re sorry? You?”</p>\n<p>“Yes?” he offers, wondering if it’s a trick question, if she’ll take offense at his sympathy and run him through with her sword. It’s not wreathed in celestial fire, but it’s still impressive.</p>\n<p>She snorts, then holds out her palm. In it materializes a scale, but it’s not properly balanced. “These are the scales of justice. They unjust are too heavy. When it’s even – when it’s even again, I’ll once more find my way to heaven.”</p>\n<p>She says it with the unshakable conviction of someone who speaks their truth based on faith alone. Crowley feels a stab of some emotion in the bottom of his chest. Not pity, because even he’s not stupid enough to pity an archangel, but some soft sort of sorrow.</p>\n<p>Even if she’s right, that’s as good as being excommunicated. He likes humans, he likes how they’re messy and bright and clever and interesting, but he’s under no illusion about humanity. If it takes balance to get Raquel home, then she’ll never again feel the warm light of heaven.</p>\n<p>But he’s not going to be the one to tell her that.</p>\n<p>“Okay,” he says, and she smiles at him. It feels like he’s lying to her, when he hasn’t said anything untrue, hasn’t said anything, really.</p>\n<p>He’s really not cut out for this demon business.</p>\n<p align=\"center\">~</p>\n<p>“Do you think,” Aziraphale begins, which is always a dreadful start to any meal, “that we all just cancel each other out? Not just you and me?”</p>\n<p>Crowley looks up at him, and he looks especially angelic like this, sitting in a warm beam of Roman sun. Like an angel, or a cat. “How do you mean?”</p>\n<p>“I mean – if we’re out here influencing things to be good, and your lot is influencing things to be bad, then aren’t an awful lot of us canceling each other out? If that’s true, we should just see who has more people, and declare them the winner of this game. I don’t know how many demons or angels there are-”</p>\n<p>“Eight thousand five hundred and seven demons,” he answers promptly.</p>\n<p>Aziraphale is staring at him, and he mentally review his answer. There’s nothing wrong with it, it’s completely correct. If he’s to keep track of his people, it would be nice to know who, exactly, those people are.</p>\n<p>Wait. Shit, right, but he’s king, and surely Michael knows how many angels there are in heaven, but he’s supposed to a be nobody, just another soldier in this ridiculous cold war. That’s not information he should have on hand. Right?</p>\n<p>“Roughly,” he amends. “More or less.”</p>\n<p>“Well, I don’t have the exact answer on hand, because I’m not ridiculous, but it is around eight thousand also,” he says, apparently putting his curiosity about Crowley’s specificity aside. “If it’s just you doing one thing, and me doing another, that’s one thing, but all of them, what’s the big deal, why are we even here, what do we gain?”</p>\n<p>“It’s not that straight forward, angel,” he says, and Aziraphale looks so distressed that he has to squash down on the urge to do something nice. “We don’t go around just causing evil, that would be ridiculous, although perhaps more cost effective in the long run. We just – we tempt is all. We offer a choice. It’s not on us if they choose wrong.”</p>\n<p>“Isn’t wrong choices what got us here to being with?” Aziraphale asks, and in this moment he looks his age, he is like Atlas, he is like Her son, bearing the weight of humanity’s sins but finding them too heavy to bear.</p>\n<p>Crowley clears his throat. “It’s not too bad a place to be, I think.”</p>\n<p>Aziraphale looks up, and his mouth quirks up in the corners, and just like that all that weight is gone. “No, it’s not.”</p>\n<p>Bodies are such insufficient things, as much as he loves his, but in this moment he feels his loss more keenly than normal. He wants to do more than touch Aziraphale, he wants to curl their atoms together, wants to dance with him in the starlight of unknown galaxies, wants to be air in his lungs and exist in and around him and next to him all at once.</p>\n<p>But this is earth, and he can do none of that here, so he raises his cup of wine and drinks deeply.</p>\n<p>They keep meeting in Rome. He wonders if all roads still lead here, or it’s just Aziraphale’s love of oysters that keeps leading Crowley here, and what the difference is, in the end. Perhaps, for him, all roads simply lead to Aziraphale.</p>\n<p>He laughs, and won’t explain why when his angel asks, just keeps drinking and smiling.</p>\n<p align=\"center\">~</p>\n<p> He does the math once, and math isn’t one of his favorite things, but he spends hours downstairs, in the basement of hell where they keep all the infernal paperwork, his oil slick crown tipping forward as he bends his head over ledgers and adds it all up.</p>\n<p>Heaven has killed more people than hell. There’s more blood on the hands of angels than that of demons, and he wonders if that says something about heaven and all its supposed cleanliness, or it says something about him as a king and the general intelligence of his demons.</p>\n<p>He decides that it means demons aren’t the best at bookkeeping, because everything else is too depressing to contemplate.</p>\n<p align=\"center\">~</p>\n<p>Crowley doesn’t usually get summoned by or called on by anyone but Beelzebub. Everyone else is too afraid of him, too wary, their distant king who seems to so casually start wars and collapse nations while they run around trying to tempt individuals to do dastardly deeds.</p>\n<p>It’s all a lie, but they don’t know that.</p>\n<p>“She’s frightening us,” Hastur whispers, head bent to the ground, “she’s - you gotta do something, Sir. She’s tearin’ us all apart.”</p>\n<p>Yeah, okay, like he’s stupid enough to go and confront an insane archangel. He doesn’t care how many new bodies he has to make them, it’s better than getting torn apart himself. He opens his mouth to say just that, but one looks at Hastur’s face and it dies in his throat.</p>\n<p>He looks hopeful. He hadn’t thought his subjects knew what hope was. How can he deny that, it’s positive reinforcement, right? His demons show some humanity, and he rewards them for it, so maybe they’ll show some more, maybe one day he won’t feel so disgusted and different and apart from all those he commands.</p>\n<p>Did She feel this way about them? If so, it’s a miracle She didn’t send them all tumbling down into hell, how She tolerated a single angel in Her domain.</p>\n<p>“Alright,” he says, and he reaches out for Hastur’s bent head. He flinches away from the touch, but Crowley just brushes his fingers through his hair, uncaring of the rotted flesh and maggots between his fingers.</p>\n<p>Did they all look at Her like Hastur is looking at him right now? If they did, well, that answers that, at least.</p>\n<p>He finds her in the middle of a desert and has to push his way through a sandstorm to get to her. At first he thinks that ringing in his ears is because of the wind, but he gets closer and realizes it’s her screaming.</p>\n<p>“Oh,” he says, all his curses and thousands of languages failing him as he steps into the eye of the storm.</p>\n<p>The first thing he notices is her eyes. They’re not just blind, they’re gone, two bloody holes in her face, dark and cavernous. Her body is too thin and covered in sores, like she’s rotting from the inside out, her chest heaves with sobs, and there are no tears for her now, not without any eyes.</p>\n<p>He should run. She’s an archangel, even like this his powers are nothing to hers.</p>\n<p>“Raquel!” he shouts, and she doesn’t hear him. He sighs, stepping closer, and it isn’t until he reaches for her shoulder and feels the hot slickness of blood and exposed flesh that he realizes. His stomach lurches, and he has to close his eyes and breathe deeply to keep from vomiting all over her, which he feels wouldn’t help the situation at all.</p>\n<p>She’s cut off her wings.</p>\n<p>“What have you done?” tumbles out his mouth before he can stop it, and he winces, wishing he could take it back, swallow those words back down.</p>\n<p>But it doesn’t matter, because she doesn’t hear him even still, and he grips her shoulder, ignoring the gut rolling sensation of sinking his fingers into her muscles, and yanks her close, pulling her against him and tucking her head under his chin so he can wrap her in his arms. He snaps his wings open. They’re just as large and healthy as they were when he was an angel, it’s only that they’re an inky blue-black now, and he curves them around her, blocking out the light and sand, making the universe smaller, until it fits just the two of them.</p>\n<p>She stops screaming, taking in a long, gasping breath like she’s forgotten to breathe, and he says, “Stop, please, please stop, you’ve - just stop.”</p>\n<p>“I can’t go home,” she wails, twisting her fingers in the material of his shirt. “I try and I try and it never balances, it’s always tipped too far and I can’t - I can’t.” She pulls back enough to tilt her head up towards him, so he’s forced to look into the gaping holes where her eyes should be. “Kill me. Please, you - you have to. You’re the only one who can, you’re King, only you can summon hellfire hot enough to burn me up. Please. I’ve never begged before.”</p>\n<p>“Don’t,” he whispers, reaching up a hand to cup her face. “Don’t talk like that, don’t beg. You are Raquel, an archangel of heaven, the angel of justice. You submit yourself to Her and to Her alone.”</p>\n<p>“She doesn’t want me,” she sobs, “and what good am I without Her, what’s the point of me? None at all. Kill me. Do it.”</p>\n<p>He leans down to press a kiss to her cheek, ignoring the taste of iron blood on his lips, and she collapses, dead weight in his arms.</p>\n<p>The wind storm subsides. He unfolds his wings, pulling them back inside his body and bends down to pick her up, an arm around her back and under her knees so he can hold her to his chest.</p>\n<p>Her breathing is ragged even under a sleeping spell, her fingers twitching. She can’t find rest, even with a miracle. He swallows, closing his eyes, and forcing it all down. They can’t both fall apart. There won’t be anyone to pick up the pieces.</p>\n<p>He takes her home and cleans her of the blood and sand. He’s no healer, not really, but he knows how celestial bodies work, he’s made thousands for his demons throughout the year, and she’s no demon, but it’s not hard for him to press his hands against the sores on her body and miracle them gone, to heal her earthly container if not the soul within.</p>\n<p>But he can’t bring back her wings.</p>\n<p>He tries, plucks feathers from his own and tries to build a new set out of them, figuring even black wings are better than none, but wings are their gift from Her, and he may be a king, but he’s not a god, so he can’t replace them. He dresses her in a soft white dress favored by the current Greeks, all draping material, but hesitates over her eyes.</p>\n<p>Her blindness was also a gift from Her, all the things she could and couldn’t see passed down from the Almighty. He can’t replace that. But he traces his fingertips along the corner of her eye sockets, trying to will eyes into their place, to at least give her something besides emptiness.</p>\n<p>It only makes her start bleeding anew, so he stops, wrapping bandages around her eyes and tying it off behind her head, unable to stop the wave of sorrow at seeing the blood seeping through the white cloth. “Sorry,” he murmurs.</p>\n<p>She sleeps for three days. He stays by her bedside the whole time, too terrified to leave unless she wakes up while he’s gone and does something terrible. When she does stir, he reaches for her hands, pressing both of them in between his own, and she stills. “You know,” she croaks, her throat still rusty from all the sand and screaming, “you’re rather terrible at being a demon.”</p>\n<p>“I was terrible at being an angel too,” he says, even though he’d always thought he was rather good at it. But that can’t be true, because if it was he wouldn’t be here.</p>\n<p>Or maybe he would. He’d thought Raquel was good at being an angel too, after all.</p>\n<p>“What do I do?” she asks, turning her body towards him, “How do I fix them?”</p>\n<p>Demons shouldn’t have hearts, it’s just not fair, because he feels a crack go right through the middle of his. “You can’t. You can’t balance the sins of humanity, you can only forgive them.”</p>\n<p>“What does a demon know of forgiveness?” she asks, but it’s not cutting or cruel this time, it’s teasing, like they’re in on the same joke. Because she’s an angel of justice, and forgiveness has no place in that, forgiveness is something softer, and Raquel is not soft.</p>\n<p>Even still, he can’t keep the exhaustion from his voice when he answers, “Nothing at all.”</p>\n<p>Later, she walks through the streets like that, always carrying her sword and her scale, and soon he hears a different name on the winds, one that’s given to her by the people rather than Her.</p>\n<p>They call her Lady Justice. She doesn’t forgive, but people go to her, looking for answers, for truth, looking to get what they deserve.</p>\n<p>And she gives it to them.</p>\n<p>He doesn’t keep track of how much blood her sword has spilled. She is justice, not mercy.</p>\n<p align=\"center\">~</p>\n<p>“Is something wrong?” Aziraphale asks, the chessboard nearly forgotten between them. “You’ve seemed … off, recently. Is it the plague? Do your superiors suspect something?”</p>\n<p>“No, no,” he assures, “everyone thinks the black plague is my doing.” It’s the rats’ doing, but he’s been taking credit for the folly of man for thousands of years, it seems only right that he start stealing the glory from rats as well.</p>\n<p>Aziraphale shifts in his seat. His eyes are piercing and far too knowing. Not that knowing, though, of course. No matter how piercing his gaze, there’s one very big secret that Crowley’s been playing close to his chest for years. “Well, something’s bothering you. You’ve been different.”</p>\n<p>His instinct is to make a joke, to change the subject. to say something glib and distracting. Instead what tumbles out his mouth is, “Do you think we would have known each other, if I hadn’t fallen?”</p>\n<p>Did he really just say that out loud? Fuck, the ground should open up and swallow him whole to put him out of his misery. He’s the king of hell, that should be something that he can arrange for himself.</p>\n<p>Aziraphale doesn’t even blink, mouth parted in surprise. “If you hadn’t-”</p>\n<p>“Forget it,” Crowley says desperately, “never mind, it’s a ridiculous thought. We wouldn’t have, of course, I was just a foot soldier and you were – you were given a flaming sword and given the duty of guarding Eden, our paths wouldn’t have even crossed.”</p>\n<p>“You crossed paths with Lucifer,” Aziraphale says, and Crowley freezes. How does he know that? Why did he know that? “He plucked you out from the others. He thought you were funny.”</p>\n<p>“I am funny,” he says, mouth numb, because he doesn’t know what else to say, what sort of response he’s supposed to have to that.</p>\n<p>“Every time we saw you with him, it would drive everyone to distraction,” he continues, like he doesn’t know what his words are doing to him. “They couldn’t understand it, what the shining morning star was doing with you, why he shunned our company but sought out yours.”</p>\n<p>He swallows to wet his mouth then says, “Recruitment strategy.”</p>\n<p>“No,” Aziraphale says immediately, “no, it wasn’t that, there were plenty of angels who followed Lucifer down who hadn’t met him personally. But not you. You knew him.”</p>\n<p>If he’s looking for an explanation, Crowley doesn’t have one. “I just – he – we got along, is all.” Lucifer shined as bright as a thousand suns, and Crowley wasn’t just in his shadow, because they were all in his shadow, but Crowley was a shadow, dark and forgotten and defined by what stood before him. But Lucifer had been sad too, in quiet moments, and Michael could not be there always, a million things needing her attention. So in those moments there was Crowley. He assumed Lucifer only let him see his pain because he wasn’t important enough to hide it from, like breaking down in front of the family dog.</p>\n<p>Aziraphale breaches the distance between them, gripping Crowley’s forearm, the heat of his divinity sinking into Crowley’s skin. “I would have noticed you, we’d have know each other. Even if Lucifer had never noticed you, I would have.”</p>\n<p>Crowley doesn’t know if it’s true or wishful thinking, but either way it makes him smile.</p>\n<p>Later, he’s sitting by the river, the phantom weight of Aziraphale’s hand making his whole arm tingle. He thinks of his crown, and it’s on his head, the physical manifestation something he can summon and dismiss even if its weight is something he’s never without.</p>\n<p>All at once, he’s swept up in rage, in a thousand what ifs. What if he hadn’t fallen, what if he’d never met Lucifer, what if he hadn’t done as Michael asked, what if he was just a regular demon, what if he wasn’t king, what if he was free to give himself away instead of belonging to eight thousand five hundred and seven demons.</p>\n<p>He screams as he hurls his shimmering black crown into the river, wishing it was as easy to toss of the mantel of king, whishing he could grip Aziraphale as tightly as he wanted to without consequences, but knowing that he can’t, not like this, not as he is now.</p>\n<p>His crown sinks into the river, then does something unexpected. It dissolves into the water, oil slick floating on top of the river and killing everything it touches.</p>\n<p>“Oh dear,” he says, suddenly bone deep tired, “it seems I’ve created pollution.”</p>\n<p>This time, at least, he won’t have to lie about his demons about his misdeeds.</p>\n<p>He prefers it when he has to lie.</p>\n<p align=\"center\">~</p>\n<p>Over six thousand years since he’s seen her last, Michael appears before him.</p>\n<p>He wishes he’d had a little forewarning, if only so he wasn’t in sweatpants eating cinnamon toast crunch straight from the box. “SHIT!” he shouts, falling sidewise off the couch. When he stands up, he’s fully clothed in a black suit and his signature sunglasses. “Hello Michael dear, long time no see. Are you here to kill me?”</p>\n<p>He wants to say she looks exactly the same, but that’s not quite right, if she didn’t look so much like herself he wouldn’t even be able to recognize her.</p>\n<p>The cracks he’d seen in her thousands of years ago have widened into caverns. For a moment, he wishes he’d remained in heaven for purely unselfish reasons, because he never would have let her get like this, eyes too blue and something (someone) clearly missing from what she used to be.</p>\n<p>“No,” she says, still looking at him. “It’s time.”</p>\n<p>“Time,” he repeats, uncertain. “Time for what?”</p>\n<p>“Armageddon.”</p>\n<p>His stomach drops. It’s been six thousand years, which is so long, but not nearly long enough. Already? So soon? It still seems like humanity is so young, like they’ve barely learned to stand on their own two legs, and already it’s supposed to be the end of the all of them. It’s not fair.</p>\n<p>He clears his throat. “Well, uh. Thanks for the heads up.”</p>\n<p>She keeps looking at him, and it makes his shoulder blades itch, right where his wings would be if he had them out. “You misunderstand. It’s time for you to start Armageddon.”</p>\n<p>“Me?” he says, and he’ll deny that that came out as a squeak. “What do you mean, what do I have to do with–” Oh, wait. Right. Why has he never thought of this before? <em>Fuck</em> Michael, if she’d mentioned this bit when she was trying to sell him on the whole king of hell bit he never would have done it. Which is probably why she hadn’t, actually.</p>\n<p>“Choose wisely,” she says, and then she’s gone.</p>\n<p>Fuck.</p>\n<p align=\"center\">~</p>\n<p>His first thought is Beelzebub, but he dismisses it almost as soon as he has it. No other demon will do.</p>\n<p>Truly, he knows deep down, that who he truly wants is Aziraphale. But he doesn’t know the truth, and even if he did, it’s not fair to drag him into this mess just because he – just because. Besides, he’s currently man-shaped, and that won’t do either. But just because his angel is off the table doesn’t mean all angels are.</p>\n<p>He finds her in America, wearing judge’s robes. Changing with the times, and all that.</p>\n<p>“Where’s your scale?” he asks, sitting on the edge of her desk. She has a gavel, but no scale.</p>\n<p>She doesn’t startle or act surprised, her hands don’t even pause in reading the braille case report in front of her. “I must have misplaced it. What do you want?”</p>\n<p>That’s a more complicated question than she thinks, probably. Or it’s exactly as complicated as she thinks, and she just likes making his life miserable. It’s probably the latter. “I – Michael came to me.”</p>\n<p>Now he has her attention. “What?”</p>\n<p>“It’s time for the end of the world.” The words taste like ash on his tongue. “I need your help.”</p>\n<p>It doesn’t take her long to figure it out, and then she’s laughing. “Should I be flattered, or insulted?”</p>\n<p>“I’m just following orders!” he exclaims, and he won’t blush over his, he’s an ancient demon, he doesn’t blush.</p>\n<p>She stands, pressing herself close to him, and has to resist the urge to lean back, to lean away from her. “Just what every girl wants to hear.”</p>\n<p>“You’re not a girl,” he says, but opens his legs so that she can step between them, so she can grip the front of shirt and pop the buttons off one by one.</p>\n<p>“And you’re not a man,” she returns, and then she’s kissing him before he can respond. They’re man and woman enough for this, at least. They somehow end up in her giant bed in her high rise apartment, the walls all glass, her sword mounted above the bed. She scratches her nails down his back until he relents and lets out his wings, so big that they drag over both sides of the bed. She flips them over, and considering his wings don’t get bent or broken in the process, it definitely involves some sort of miracle. He spreads his wings for her as she spreads her legs, sinking down on top of him as he rises up to meet her. He doesn’t do this often, not like this, and he wants this to be good for her, he wants something to be good for her after thousands of years of her life being a constant string of not-good-enough. He holds himself back until she’s shaking around him, a cry high in the back of her throat that’s as sweet as an angelic chorus, and then he’s spilling inside her, breath leaving him all at once as he grips her hips to keep himself steady.</p>\n<p>After, she lies on top of his chest, and he curls his wings around them, his soft black feathers against their naked bodies, keeping her warmer than any blanket ever could.</p>\n<p>“You don’t have to stick around,” Raquel murmurs into his collarbone, which seems rather at odds with the way she’s sprawled on top of him. “I’ll just get sick of your hovering. Don’t worry, I’ll let you know what the child is born.”</p>\n<p>Oh. He hadn’t thought of that, of what it would be like for her while their child grows beneath her heart. “Are you sure? I don’t mind.” It seems wrong to just leave her to the growing pains and the miserable mornings and sleepless nights.</p>\n<p>“Yes,” she says firmly, and it seems just as wrong to argue with her, so he doesn’t.</p>\n<p>“Alright. I’ll see you in nine months, then?”</p>\n<p>She laughs, tilts her head up to brush her lips against his jaw. “You’re no god, and I’m no Mother Mary. If I’m to deliver the end of times, I’ll need more than that. Nine years should do it, I think.”</p>\n<p>“Years?” he demands, horrified. It should be a respite, nine extra years before the end of all he holds dear, but instead he just feels horribly guilty. He hadn’t known, when he’d asked, exactly he was asking for.  </p>\n<p>She kisses him properly then, more as a way to soothe him than out of any real desire, and says, “Yes.”</p>\n<p align=\"center\">~</p>\n<p>He can’t stay completely away, of course. He checks in on her, makes sure her cabinets are always filled with crackers and ginger ale, miracles her hot water bottles to stay warm, heals soreness and tired muscles as soon as he notices them.</p>\n<p>Five years in he can’t help himself. She’s round with their child, and she sleeps on her side, breathing softly as he stands next to her bed, itching to touch, to feel, but trying to not be a huge asshole about it. Watching her face, he kneels on the edge of the bed and reaches out a hand, carefully pressing it to the taut skin of her belly.</p>\n<p>Almost as soon as he touches her, there’s a kick against his hand, then another, his child reaching for him. He doesn’t realize he’s crying until Raquel’s hand cups his cheek, using her thumb to wipe his tears away. He looks down into where her eyes should be, and he hadn’t even noticed her waking up. “Sorry,” he says, “I broke the rules.”</p>\n<p>“Well, you are a demon, after all,” she sighs. “Come on, just for tonight. Then you go back to hovering in the background where I can pretend you’re not there.” Of course she’d known what he was doing the entire time.</p>\n<p>She tugs him down, and he lies down beside her, tucking his knees against hers and sliding his arm under her neck, his head above hers. She takes his other hand and places it against her stomach, sighing as their child continues to reach for him. “Goodnight Crowley.”</p>\n<p>“Goodnight Raquel,” he whispers, and pretends he’s not holding the end of the world in his arms.</p>\n<p align=\"center\">~</p>\n<p>He’s eating sushi with Aziraphale in Osaka, and his best friend is halfway through a hilarious story about having to report into Uriel, and Crowley has to swallow his bit of sashimi before he bursts out laughing and sends a spray of rice all over their table, because then they’ll never be able to come back and Aziraphale will be cross with him, which is the last thing he wants.</p>\n<p>That’s when he feels it. A swift, sharp pain along his lower abdomen, and he knows exactly what it means.</p>\n<p>He stands so quickly that his chair falls back behind him, and Aziraphale’s face has quickly shifted to alarm. “What – are you hurt – is everything okay?”</p>\n<p>“I have to go,” he says, groping for some sort of explanation but coming up blank. “I’m being summoned.”</p>\n<p>Which Aziraphale will interpret as being summoned by his head office, and that will just have to do. He grabs Aziraphale by the lapels of his jacket and jerks him forward, kissing him once on both cheeks before he disappears into a puff of smoke. He’ll have to pay for that later, but right at this moment he can’t bring himself to care.</p>\n<p>Raquel is pacing, hands spread over her stomach, red faced and panting. “Now?” he asks when he sees her, even though the answer is rather obvious.</p>\n<p>“Now,” she says, and then bites off a groan as another contraction hits.</p>\n<p>He’s generally useless, as he imagines most partners are at these things. There’s not a midwife for this, no one to call, because this has never been done before, never happened before.</p>\n<p>An archangel is giving birth to the child of the king of hell. The antichrist, in purely clinical terms, although of course Crowley can’t think of it like that, can’t think of his child like that.</p>\n<p>She curses and screams, threatens to tear open her belly and pull the child from it, even though they both know that won’t work, not with this baby. He tries to leech her pain away, but of course he can’t, because her pain is part of the process, so he pushes her hair away from her sweaty brow and lets her break the bones in his hand, doesn’t flinch and brings their joined hands up to his face so he can kiss her wrist. It takes longer than he thinks it should, but he’s no expert at these things, hours of pushing to bring their child into the world. He kneels between her legs and cradles the baby’s neck, providing support as Raquel gives a strangled cry and one last final push, and their child slips into the world, and then he’s holding their son in his arms.</p>\n<p>Raquel groans as she pushes the afterbirth out, but that comes easily, and Crowley cleans the area around their son’s eyes, cradling him against his chest, and he’s crying, his tears falling onto the baby’s face until he thinks to turn away. He’s perfect, ten fingers and toes, and then he opens his eyes, and its Raquel’s rich brown eyes staring up at him.</p>\n<p>“Hello darling,” he whispers. His son isn’t crying, but he’s alert and breathing, just as perfect as Her son was when he took his first breath in Bethlehem.</p>\n<p>He goes to the side of the bed, where Raquel lies exhausted, tacky sweat on her skin and bed soaked with blood and other such things. He moves to place their son her chest, to let her hold the being she spend nine long years creating in her body, but she flinches and turns away from him. “Don’t.”</p>\n<p>He freezes, confused. “Do you want me to clean him first?” As soon as he’s said it, it’s done, their son soft and warm, his skin clear. He has dark hair, just like mother’s, and it sticks up with the after effects of his miracle.</p>\n<p>“Just - don’t,” she says, closing her eyes, like she can’t bear to look at him. Crowley doesn’t understand. He’s not an ugly baby, just the opposite in fact, even though he knows he’s rather biased. “Take him away.”</p>\n<p>“You don’t even want to hold him?”</p>\n<p>“What’s the point?” she asks, “We can’t keep him. He doesn’t belong to us.”</p>\n<p>Oh, there it is, that very human sensation he feels sometimes. It’s his heart breaking. “I - but - no, you’re right, but before - not even for a moment?”</p>\n<p>“It’ll be easier, for me,” she says, “if I don’t have the sensation of him in my arms to miss. Please, Crowley. Just go.”</p>\n<p>How can he argue with that? With her, of all people? He can’t. So he sighs and leans down to press a kiss to her forehead, wrapping a miracle around her, cleaning her and her bed, repairing the physical damage carrying the end of the world has wrought upon her body.</p>\n<p>He’s sitting in his car, his baby tipped against his chest. He looks down at him, brushing a thumb against his soft cheek and lets him grab his finger and hold on, looks into his eyes, and when the sob crawls its way up from his chest, he’s not surprised.</p>\n<p>There is exactly three hours and seventeen minutes until the American ambassador’s wife is set to arrive at the church of the satanic nuns.</p>\n<p>That means he has three hours and sixteen minutes to hold his son, to kiss him and listen to his heart beat, until he has to let him go.</p>\n<p>Three hours and fifteen minutes later he wipes the tears from his eyes, puts on his sunglasses, and miracles up a bassinet for his son. Handing him over isn’t the hardest thing he’s had to do, surely, he’s never wanted to be a father, doesn’t know what one does with human children, really, and he’s fallen from heaven, how can handing a nun a basket compare with that.</p>\n<p>But it does, and he’s not as surprised as he thought he’d be to discover he’d fall another hundred times if it meant getting to keep that child, and it floors him, a little, but it shouldn’t.</p>\n<p>He fell half in love with Aziraphale that day in the garden, of course loving his son comes even easier, overcomes him a totality as final as holy water on his skin.</p>\n<p>It’s the end of the world, and he’s just given his son away.</p>\n<p>It seems, then, that the only thing to do is to get roaringly piss drunk.</p>\n<p align=\"center\">~</p>\n<p>He’d glad he doesn’t have to think of a lie to tell his favorite angel, since Aziraphale assumes the reason he ran off so quickly is that he was summoned to deliver the antichrist. Which is technically true, in a very literal sense. When Aziraphale suggests they keep an eye on the child, he should refuse, should insist that they just leave it up to his nature. Which doesn’t make much sense to him to begin with, because surely his nature can’t be all evil, can it? He’s the son of the archangel of justice, after all.</p>\n<p>But when faced with the opportunity to watch his son grow up, how can he say no? They argue about it for a bit it, poking about logistics and boundaries and other such things, and it’s not until a year later that they start to insinuate themselves into the American ambassador’s house, Aziraphale as a gardener, and Crowley as a nanny. It would have been safer for him to be the gardener, and he’s the one with experience terrifying plants into submission, after all, and less direct contact with the child he’s not supposed to see in the first place, but he can’t resist.</p>\n<p>Except that the moment he sees the baby called Warlock, he knows.</p>\n<p>This is not the baby Raquel bore, not the child he held in his arms as he wept, not his son. If he was just a demon, maybe he wouldn’t know any better, because he’s supposed to be human for now, supposed to have no powers or anything different than any other baby on this earth. But he looks into his eyes and knows, because those aren’t Raquel’s eyes, aren’t his mother’s eyes.</p>\n<p>“Something wrong?” the ambassador asks.</p>\n<p>“No,” Crowley says, “no, of course not, he’s a lovely child.” He’s just not <em>his</em> child.</p>\n<p>He slips away as soon as he can, going back to the satanic nuns, and he thinks he’s calm, he’s so sure he’s calm.</p>\n<p>But they see him and scream, falling to their knees, and it takes him a moment to realize.</p>\n<p>He’s surrounded in hellfire, a crown of fire atop his head, marking him as more than simply Master Crowley, a fellow servant, but as their lord, their king. He tips down his sunglasses, knowing that there’s fire in his snake eyes too, and asks, “What have you done to my son?”</p>\n<p>It doesn’t take too long to get the truth out them.</p>\n<p>Tadfield, is it?</p>\n<p>He slips through the cracks of this middle class suburban home, until he’s in the nursery, half smoke as he hovers over the crib.</p>\n<p>Oh. There he is.</p>\n<p>He sees the kitschy blocks painted on the wall, spelling out a name, and he smiles as he leans over the crib and says, “Hello Adam. This is where you’ve gotten off too.”</p>\n<p>His son coos and grasps for him, tiny arms outstretched, and Crowley smiles as he reaches for him.</p>\n<p>“Honey?” a feminine voice calls out, “Is that you?”</p>\n<p>Crowley leaves before he can get caught, but aches with the missed opportunity, and feels some sort of twisted satisfaction when Adam starts crying and reaching for the place where he was instead of Mrs. Young, trying to get to him just as a little baby in his crib.</p>\n<p>He waits until the sun has set, until the Youngs are asleep, and then creeps back inside the house, creeps back into the nursery to look down at his baby. “Adam’s a good name. I did like that fellow, the first one, you know.” He stirs, making a soft wuffling sound, and then his eyes slowly blink open. His mouth splits into a grin, and he reaches for him once more, and this time Crowley doesn’t hesitate, scooping him out of the crib and to his chest, pressing his nose to his son’s head and just breathing.</p>\n<p>Before having a son, he never used to cry so much.</p>\n<p align=\"center\">~</p>\n<p>The right thing to do, the proper thing, the thing he should do, is tell Aziraphale that they have the wrong baby, that the son of the ambassador is just a normal human and they’re wasting their time by playing nursemaid to what will undoubtably grow up to be a deeply unremarkable human.</p>\n<p>The Youngs are relieved that their baby starts sleeping through the night, because he’d begun to get rather too old to keep waking them up, and in fact Mrs. Young boasts sometimes she can even sleep in, with her baby content to wait until she’s blearily sipped at her first cup of coffee before making a fuss.</p>\n<p>Crowley just rolls his eyes whenever he overhears this during his spying, because that’s not exactly the case.</p>\n<p>Every night he slips into his son’s room, sits in that ridiculous rocking chair, and holds him. Adam sleeps against his chest, and Crowley feeds him if he wakes up hungry, or plays with him if he’s bored, and tells him stories, about so many things, about all the wonderous things he’s experienced on this earth, tells him about Aziraphale and his bookshop, says how much he’d like to take him there.</p>\n<p>He doesn’t try to impart any grand lessons or anything like that. Maybe he will, later, but he’s not sure what the point of it is. If it’s not Adam, it’ll be another, if Crowley is killed another king will take his place, and another child will be born.</p>\n<p>Maybe that would have been the right thing to do. To die, and refuse to be the one that started the end of the world, to not drag Raquel into this mess, to not have a son who’s unknowingly burdened with a terrible destiny. But he didn’t die, and he did have a son, and they only have about nine years left until the end of the world.</p>\n<p>When Adam starts talking properly, Crowley knows he needs another strategy. For six miserable months he doesn’t visit his son at night, just watches, and tries not to hate himself whenever Adam wakes in the middle of the night and is so disappointed to find himself alone.</p>\n<p>He buys a house in Tadfield. Not just any house, in fact, but the one right next to the Youngs. He’s stupid, and this is all stupid, he should just leave well enough alone, but he can’t. He introduces himself to the neighbors, quick and efficient and not something he’s ever done before, up until he gets to the Youngs.</p>\n<p>He puts on his best smile and talks about how he travels for work so much, but he wanted to move someplace quiet, and this just seemed like a perfect place, and all of that. Mr. Young is friendly and welcomes him to the neighborhood, and then Mrs. Young walks in with Adam on her hip.</p>\n<p>“Mine!” he screams, grinning, kicking at his mother and pushing her away. “Mine, mine, mine!”</p>\n<p>Startled, Mrs. Young puts him down, and then he’s running forward on shaky legs, and Crowley bends at the knee before he can think better of it, sweeping him up in his arms. Adam grins and starts babbling at him, and Crowley can’t keep the smile off his face.</p>\n<p>“Oh, dear!” Mrs. Young says. “He’s never acted like this before.”</p>\n<p>“You’re good with him,” Mr. Young says, and Crowley tries not to feel guilty at the hint of jealousy in his words. Mr. Young loves his son, he’s just not very good at the emotional bits of it all. “Do you have kids?”</p>\n<p>“No,” he says, and sadness threatens to cripple him, “no, not really, not – I had a son,” which is more than he was planning on saying, actually. “But I lost him, just – just a few hours after he was born. He’d be about this age.” Mrs. Young looks devastated on his behalf, while Mr. Young is supremely uncomfortable, which is how he best expresses his sympathy. “Let me know if you need a sitter, yeah? I wouldn’t mind.”</p>\n<p>Mrs. Young assures him they will, and he means to leave, but Adam won’t let go of him, and he ends up staying for lunch with Adam in his lap. He can be charming when he wants to be, and he does his best to charm the Youngs, knows that access to his son depends on how much these two like him, so he tries very, very hard to be likeable.</p>\n<p>He gets asked to babysit the very next weekend.</p>\n<p align=\"center\">~</p>\n<p>“Is everything all right?” Aziraphale asks him, mouth turned down at the corners. “You’ve been so busy lately. I feel like I hardly ever see you.”</p>\n<p>Which isn’t precisely true, but certainly they’re seeing each other less. But it’s hard, to be in Tadfield enough to be known as the strange and eccentric neighbor, and he can along be away so long on a supposed business trip before he has to go back to making daily appearances.</p>\n<p>“Just busy, lots of things coming from the head office. It is the end of the world, after all.” He’s not good at lying, not to Aziraphale, never has been, never will be. But he does it, because he can’t tell him the truth. He must be okay at it, at least, since his best friend still doesn’t know that he’s the king of hell. Maybe he’s only good at lying about the big things, the type of things that Aziraphale doesn’t think to question.</p>\n<p>He keeps looking at him, then says, “Well, alright then. Do let me know if there’s anything I can do.”</p>\n<p>“To help Hell take over the world?” he asks sarcastically.</p>\n<p>“To make it easier on you,” he answers, steady as he always is, and Adam is five years old, they only have six years of all this left, and it’s such a struggle, being pulled between Aziraphale, whom he loves, and Adam, whom he also loves.</p>\n<p>But he’s had six thousand years with his angel, and he only gets eleven years of stolen moments with his son, so.  </p>\n<p align=\"center\">~</p>\n<p>“Mr. Crowley! Mr. Crowley, Mum said you were back, I know you’re in there!” Adam shouts, and Crowley’s already smiling as he opens his door. There’s his son, standing there with his little gang of friends, the Them. In the mid afternoon sun, his hair has a reddish tinge, and he got that from Crowley.</p>\n<p>He frowns. “Have you gotten taller since I saw you last? What did I say about growing up when I wasn’t looking?” He’s nine now, they’re so close to the end of all things.</p>\n<p>Adam grins, reaching for his hand tugging at it, pulling him out of his house. “I want to go berry picking!”</p>\n<p>“Does everyone want to go berry picking?” he asks. Wensley makes a so-so gesture with his hand and Pepper shakes her head. Brian, at least, nods his head enthusiastically.</p>\n<p>Adam tugs on him again, “Come on, Mum and Dad said we could go if you go with us, you will, won’t you?”</p>\n<p>“Of course,” he answers, running a hand through Adam’s hair. “Come on, we can see if we can make some sort of muffin or cake out of them after, hm?”</p>\n<p>“You’re very bad at baking,” Pepper points out, because he is.</p>\n<p>He grins and shrugs, letting Adam pull him away, the Them hurrying to keep pace. “I won’t get better at it by not doing it, I suppose.”</p>\n<p>“But at the expense of the berries?” Brian mutters, distressed, and Crowley can’t help but laugh.</p>\n<p align=\"center\">~</p>\n<p>The years pass too quickly, quicker than he thought time could pass. Adam comes knocking on his door more often than not, and he does his best to be there when he does. He goes to his school plays and helps him with his homework. When Adam gets a miserable cold that lays out Mrs. Young as well, he goes over and takes care of them both, lets Adam curl miserable and fever-sick into his lap, and pushes his sweaty hair off of his forehead. When Adam’s being particularly difficult, Crowley is there, with an inhuman patience neither of his other parents have. They should try being king of hell, it’s an excellent primer for a child’s temper tantrum, and even at Adam’s worst, at his most surely and cranky and difficult, Crowley still loves him so much that he thinks his heart will burst from his chest.</p>\n<p>Then it’s time to pick out a hellhound and release it, for Adam to start coming into his powers. When he names it Dog, and this vicious, powerful beast becomes a boy’s loving companion, Crowley just laughs, and couldn’t be prouder of Adam if he tried. He ends up cajoling Mr. Young into letting him keep it, saying it’ll teach him responsibility and character, and all that.</p>\n<p>Unfortunately, this is also when Aziraphale figures out they’ve been hanging around the wrong boy.</p>\n<p>“Don’t worry, we’ll figure it out,” he assures him, even though they won’t, of course. Crowley had wiped that night and his visit from the minds of all the nuns, and now he’s the only one that knows the truth.</p>\n<p>Aziraphale looks really, properly worried, and Crowley feels like an absolute heel, but he can’t risk it, won’t risk his son, not for anyone, not even his angel.</p>\n<p>He tries to pull Adam back when he runs into that witch that Crowley had literally run into with his car, but she fills his mind with all sorts of things, and because his mind is a powerful thing, those sort of things start appearing all over. It’s around this time that Aziraphale figures out where Adam is, exactly, and then Crowley has to run circles around everyone to keep all his secrets in place. Although, at this point, he doesn’t know why he’s bothering, since it’ll all be over in a couple days anyway.</p>\n<p>None of it does matter, in the end. They’re all standing there, Shadwell and his woman, the four horsemen, Aziraphale, the Them, Michael, and Beelzebub. Adam has overcome the tug of his hellish powers, and Crowley didn’t know that was something he could do, that it was even possible, but perhaps he should have known better, should have known his son would be extraordinary, even among the impossible.</p>\n<p>He could have probably snapped him out of it, but he thinks it’s better this way, that it was his human friends that mattered more than all that power, in the end.</p>\n<p>Still, what he can’t help focusing on is the horsemen, who he’s never seen properly with his own eyes. Pollution catches his attention first, for obvious reasons.</p>\n<p>That’s his crown.</p>\n<p>Famine is holding a very specific set of scales, and how did Raquel even lose those, and he leans over to nudge Aziraphale in the side and mutter, “Isn’t that your sword?”</p>\n<p>“Shut up,” he hisses, elbowing him in the side and shooting a terrified look at Michael. Crowley’s surprised to see her here, actually. He’d have though she’d send Uriel, who’s been dealing with all the fiddley bits of the apocalypse until now.</p>\n<p>His eyes keep being pulled to Death and then sliding away, like he can’t focus properly, and something about that feels familiar to him, but he can’t place as to why.</p>\n<p>“Look,” Beelzebub says reasonably, “just order the start to apocalypse, and we’ll take care of the rest, and you can have whatever’s left. That’ll be nice, right? We won’t linger, we’re not interested in earth.”</p>\n<p>Except as a battlefield. Someplace where angels and demons are equally disadvantaged.</p>\n<p>“No,” Adam says, spine straight, “I don’t want to rule over earth, and I like earth the way it is.”</p>\n<p>“Your father won’t be happy about that,” Beelzebub says, and Crowley winces. He’d rather not be dragged into this, all things considered.</p>\n<p>Adam’s face settles into a scowl. “Do you mean Satan? He’s not my father!” Oh, that hurts rather more than he’d expected it to. “My father is the man who raised me, who’s been there my whole life, not some stranger who I’ve never met! If that man was really my father, then he’d be here now!”</p>\n<p>There’s a moment where no one does anything at all. The horsemen exchange glances, and Michael and Beelzebub blink, turning to each other, then back to Adam, then their gazes drift over to land on him. It’s all eerily in sync. He starts to shake his head, but it’s too late. “But he is here,” Beelzebub says.</p>\n<p>Aziraphale starts looking around, and Crowley closes his eyes. Well, the truth has to come out sometime. Adam turns, following her gaze, and looks right at him. “That’s – no, that’s Mr. Crowley.”</p>\n<p>“Mr. Crowley?” Aziraphale repeats, “When on earth did you meet him? How does he know you?”</p>\n<p>He closes his eyes, takes a deep breath, and then opens them again. Aziraphale shouts and takes a couple steps back.</p>\n<p>Over his head is a crown of hellfire, the same fire that’s in his eyes as he banishes his sunglasses. He looks at Adam straight on. “Hello, darling.”</p>\n<p>For a moment, no one moves, no one so much as breathes.</p>\n<p>“You! No, there must be some mistake, you’re just a demon,” Aziraphale begins, then stops, and says, “You’re the king of Hell? For how long?”</p>\n<p>“Not – not too long,” he says, not looking away from his son, watching his face as he processes several things all at once. “Just since Lucifer fell.”</p>\n<p>“And died,” Michael says bitterly, even after all these years the wound still as fresh as it was when they spoke on the garden wall.</p>\n<p>“I was just a demon when we spoke the first time, and for everything after, well, Beelzebub takes care of most of the day to day running of the place.”</p>\n<p>She puffs up in pride at that, and he smiles without meaning to.</p>\n<p>“You’re my dad?” Adam stays, stepping forward, closing the distance between them. “For real?”</p>\n<p>He wants to reach out to him, wants to gather him to his chest like he’s still baby, but doesn’t. “I am. But you’re right. Mr. Young is your father too, and Mrs. Young is your mother.”</p>\n<p>“Mother,” he repeats, and then his voice goes gravely, and the universe pauses, waiting to do his bidding. “Who is my birth mother? Tell me!”</p>\n<p>Crowley opens his mouth, but it doesn’t matter. There’s a pop with a displacement of air, and then Raquel is there, hair pinned on top of her head, the dark holes where her eyes should be looking around in confusion. Most humans see what they want to see, so it looks like her eyes are simply clouded over, like they used to be, but the only people here who see that are probably the Them, and even then maybe not.</p>\n<p>She’s in her judge’s robes, and stumbles, taking a second to right herself. She notices him first, seeing without seeing, and says, “Crowley, what on earth is going on? I was in the middle of something, you can’t just jerk me around whenever you feel like it!” Then, a moment later, “Is that my scale?”</p>\n<p>“Our son wants to see you,” he says simply.</p>\n<p>“Our-” she pauses, and it only takes her a second to turn herself towards Adam. “Oh.”</p>\n<p>Adam rakes his eyes over her, but Crowley can’t tell what he’s thinking, if he’s impressed or horrified, so he blurts, “You have her eyes.” Then, to Raquel, “He has your eyes.”  </p>\n<p>“Oh,” she repeats again, apparently at a loss to say anything else. Then, “I carried you for nine years, you know. You always kicked in the night.”</p>\n<p>“I did?” Adam asks, voice cracking in the middle. He’s looking between them, something terrible in his face, and Crowley aches, in a very human way, and wishes he could whisk them all away from this. “Do you – do you want me to cause the end of the world?”</p>\n<p>“If you’d like,” Raquel says. “I don’t imagine I get to go home no matter who wins. It’s your world. It belongs to you. Do with it whatever you want.”</p>\n<p>Adam swallows, then focuses entirely on him. “Why – why didn’t you tell me?”</p>\n<p>Crowley opens his mouth, and then has to close it again to clear his throat. “I – it’s against the rules, you see. I shouldn’t have seen you at all, I was supposed to just – sire you and let things fall where they may, but I couldn’t, I,” his voice gets caught in his throat, but he finishes, “I loved you too much. I’m sorry, it wasn’t fair to you, none of this has been fair to you, and all a parent wants for their child is a fair world.” He finishes, barely more than a whisper, “I was just following orders. I’ve always followed orders, I’m just not very good at it.”</p>\n<p>“Do you want me to end the world?” he asks.</p>\n<p>The answer, for him, is easy. “No. I love the world. I’m not supposed to do that either. As a demon, as king of hell, as Satan, but I can’t help it. But that’s not – that’s not a choice I get to make. It’s all part of the plan.”</p>\n<p>Adam looks at him, then skips his eyes over everyone else, the Them, Michael, Beelzebub, the horsemen, and then he holds out his hand to Crowley.</p>\n<p>Resting on his palm is an apple.</p>\n<p>“I don’t understand,” Crowley says.</p>\n<p>Adam is frowning, looking so much older than his age, so much older than he has before. “It’s a choice. You’re my father, you really are, even if you were lying to me, you were still there, you still love me. And I love you. So it’s a choice. Like in the story you told me, about the snake. Take the apple, and we keep the world. Don’t, and I’ll – I’ll make us our own garden, for you and me and all the people we care about it, and we’ll be untouched by the war, while heaven and hell tear themselves apart, and the rest of the world along with it.”</p>\n<p>Was the decision this easy for Eve? It must have been, he doesn’t remember her hesitating. He doesn’t hesitate either, plucking the apple out his son’s palm and taking a large bite out of it, defiance coursing through his veins.</p>\n<p>Screw the plan. Screw following orders. Screw doing what She wants. What he wants is Adam, and sushi, and concerts, and Aziraphale.</p>\n<p>He swallows and says, “You knew I’d choose that.” Did She know that Eve would eat the apple?</p>\n<p>Adam smiles, says, “Yes,” then turns to the four horsemen and says. “Those don’t belong to you.” He glances at Pepper, who’s always been the quickest among them, both mentally and physically, and she darts forward, kicks War in the shin, and then uses the distraction to grab the flaming sword from her grip. Wensley and Brian spring into action as well, and it all probably has more to do with Adam’s will than the fighting prowess of a couple of eleven year olds, but three of the horsemen fall, and Wensley is left holding the crown, Brian the scale, and Pepper the sword.</p>\n<p>“And what of me?” Death asks, and Crowley finally places the way he can’t quite manage to look at Death for more than a couple of seconds and pales, reaching out for Aziraphale before he remembers that his angel probably hates him now, what with all the lying. But if he does, he doesn’t show it, letting Crowley grip onto his arm and covering his hand with his own, looking concerned in a way he hasn’t through all of this, more worried about Crowley’s fear than the end of the world. “You cannot kill me.”</p>\n<p>“No,” Adam agrees, something knowing in his tone, and has he known this whole time, what Crowley has just figured out. “But I won’t let you kill everyone either.”</p>\n<p>“I’m Death. That’s what I do.”</p>\n<p>“You’re Life too,” he says. “Is this not all going accorded to plan, then?”</p>\n<p>Aziraphale stiffens at his side and Raquel falls to her knees. “No, it can’t – it can’t be.”</p>\n<p>Death pauses, then shifts enough to reveal a smiling mouth, one that isn’t bone, but isn’t flesh either, made of something else that Crowley can’t describe, there’s no words for it, because these are words of men, and nothing like it exists on this earth.</p>\n<p>“Perhaps,” She answers, and what kind of vessel is She wearing, what kind of construction can withstand the force of Her, the Almighty. Before Adam can press further, before any of them can do anything at all, She’s gone, as if she was never there in the first place.</p>\n<p>Raquel’s hand is outstretched, and Crowley is sure she’d be crying right now if she had eyes. Brian walks forward and places the scale in her palm. “This is yours.”</p>\n<p>“Thank you,” she says automatically. Her shoulders start to shake, and then she’s gone, taking her scale and her grief with her.</p>\n<p>Wesley steps towards him, holding out his crown, and Crowley takes it with numb fingers. Pepper offers Aziraphale his sword back, and he reaches for it, then pauses, pulling his arm back to his side. “No, no, you keep it. I think maybe it’ll do you more good than it’ll do me.”</p>\n<p>Oh, well, that’s an idea. “Beelzebub!” he calls out, and she’s by his side in an instant, bending on her knee before him. Good, that makes this easier.</p>\n<p>He takes his crown and drops it onto her head. She freezes, looking up at him with wide, confused eyes. “What are you-”</p>\n<p>“I’ll still be around if anyone get discorporated or if the hellfire starts to feel cold,” he says, “or, you know, generally what I’ve been around for these past few thousand years. But I think it’s best if you just run things for me, instead, yeah? Just like you have been, except now you have the crown if anyone gives you trouble.”</p>\n<p>Beelzebub does something she hasn’t done in the six thousand years they’ve known each other.</p>\n<p>She hugs him.</p>\n<p>She’s gone in the next moment, hopefully back to hell to tell all the demons to stand down. He looks up, and Michael is missing too. If She doesn’t seem interested in forcing a war between them, he’s hoping Michael won’t be interested in pushing for one either. The witch and the young witchfinder come running out of the building. “We did it!” she screams, “It’s all shut down, everything is fine!”</p>\n<p>“Yes,” Adam says, satisfied, “Everything is.”</p>\n<p>He reaches out, takes the apple from Crowley’s hand, then takes a bite himself.</p>\n<p>The darkness overcoming his vision isn’t a surprise, but perhaps it should be.</p>\n<p align=\"center\">~</p>\n<p>It’s hard for him to wake up. His eyelids feel too heavy and his head feels like cotton, but then it all clears, and he’s gasping himself awake, pushing himself upright. He’s in his bed, in London, not even in Tadfield. He looks out the window, and the world is still there, the sun shining brightly across all of it.</p>\n<p>He turns, taking a step out of his apartment, and shifting to stand outside of Aziraphale’s bookshop. It had been nothing but ash when he saw it last, but it’s back to being whole once more, and through the dusty window, he sees him, his angel.</p>\n<p>It doesn’t occur to him that maybe Aziraphale doesn’t want to see him until he’s already inside, until he’s in the middle of his bookshop, mouth open, but nothing coming out, and not just because he’s uncertain of his welcome.</p>\n<p>Aziraphale isn’t alone.</p>\n<p>“I thought it was time we met,” Raquel says, a smile curled around her mouth. She’s wearing jeans and a tshirt, which should be jarring, but he can’t focus on that right now.</p>\n<p>“Your eyes,” he says, because they’re back. Still sightless, as far as humans define sight, but there, the same beautiful brown shade he remembers.</p>\n<p>She steps back, away from the wall. “That’s not all.” There’s gust of wind, the effect of her wings unfurling from her back, the ones she cut off so long ago. They’re huge and snowy white, and tears prick at his eyes just to see them again. “Gifts, from our son.” She folds them back inside herself, and looks between him and Aziraphale and says, “I’ll – we’ll talk later,” before vanishing.</p>\n<p>For a long moment, there’s only silence, only he and Aziraphale alone in the bookshop.</p>\n<p>“It’s all back,” Aziraphale says, not looking at him, “just as it was. Well, more or less. He’s quite good at this reality bending thing.”</p>\n<p>“I’m sorry,” he says, and Aziraphale startles, turning to face him. He wants to step closer, to take his angel’s hand in his own, but he doesn’t want to press his luck. “I’m sorry, I’m so sorry, I know – I lied to you, for a long time, about who I am, about Adam, about Raquel, and – I’m sorry. I didn’t enjoy it, if that matters.”</p>\n<p>Aziraphale stares at him for a long time, and Crowley wants to sink into the floor, wants to slink away and lick his wounds, except he can’t, because Aziraphale is more important than his own fear, than his own pain. Aziraphale is the one to close the distance between them, and then hold out both his hands, waiting. It takes Crowley a confusing moment to figure out what he wants, and then he’s placing his hands in Aziraphale’s gripping them tight as his angel pulls them so close together that they’re nearly chest to chest.</p>\n<p>“I always knew you were holding something back,” he says, “and this was it, wasn’t it?”</p>\n<p>“Yes,” he says, breathless, “nothing else. I promise.”</p>\n<p>Aziraphale lifts Crowley’s hand to his mouth, kissing the back of it, and Crowley feels like his heart is beating a thousand times a minute. “I believe you.”</p>\n<p align=\"center\">~</p>\n<p>They poke around a few more places, double checking things, and Crowley quietly marvels at the feeling of holding Aziraphale’s hand, but then his angel turns to him and asks, “Should we check on your son, then?”</p>\n<p>“Probably,” he says, and then they’re in Tadfield once more, in his little house next to the Youngs.</p>\n<p>They step outside and lean against the fence. Dog is barking as the kids play some sort of game involving a soccer ball but which definitely isn’t soccer. It doesn’t take them long to get noticed, Pepper yelling out and waving what probably looks like a pointy stick to other humans, but what is clearly Aziraphale’s sword to them. “You sure that was a good idea?”</p>\n<p>“No,” he answers, pleasant smile still perfectly in place.</p>\n<p>Adam drops the balls and comes running towards them, gripping the top part of the fence and pulling himself up so he can balance on the board running along the bottom, putting him nearly at face height. He makes a big show of looking around them, and then leans over to say, “Hi, Dad!”</p>\n<p>“Hello, darling,” Crowley says, reaching forward to run his hand through his son’s hair.</p>\n<p>“Adam, what have I told you about climbing on the fence!” Mrs. Young calls out, and Adam winces as he hops back down. Crowley looks up to see her walking across the yard, although her frown melts into smile when sees them. “Hello John, I didn’t realize you were back. And who’s this?”</p>\n<p>He can feel Aziraphale stiffen to hold back at laugh at the first name, and he uses the cover of the fence to step on his foot. “Just arrived, and this is Zira Fell. He’s my, uh,” he hesitates, debating for a second before deciding to go with friend.</p>\n<p>But before he can, Adam pipes up, “Mr. Fell is Mr. Crowley’s husband!”</p>\n<p>There’s a weight on his hand, and he lifts it, confused, seeing Aziraphale doing the same thing out of the corner of his eye. There’s a gold band on his finger where there wasn’t one before, and a matching one on his angel’s finger. He gives a narrowed eyed stare at his son, who tries to look innocent, but isn’t very good at it. He’s sure with some time spent around Aziraphale, that will change. His angel is so good at acting innocent, at least.</p>\n<p>“I didn’t know you were married!” Mrs. Young exclaims, “Oh, how lovely!”</p>\n<p>“Yes,” Aziraphale agrees, taking his hand once more, “it is.”</p>\n<p>It seems like it’s not going to be the end of world after all. Instead, it feels like the beginning.</p>\n<p> </p>"
}