{
  "id": "19323070",
  "url": "https://archiveofourown.org/works/19323070?view_full_work=true",
  "author": [
    "CaffeinatedFlumadiddle"
  ],
  "title": "Catching Bees with Honey",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen",
    "M/M"
  ],
  "fandoms": [
    "Merlin (TV)"
  ],
  "relationships": [
    "Merlin & Arthur Pendragon (Merlin)",
    "Merlin/Arthur Pendragon (Merlin)",
    "more implied tho",
    "Knights of the Round Table & Merlin (Merlin)",
    "Merlin & Nobles"
  ],
  "characters": [
    "Merlin (Merlin)",
    "Arthur Pendragon (Merlin)",
    "Knights of the Round Table (Merlin)",
    "Nobles of all sorts",
    "Gwen (Merlin)"
  ],
  "additional_tags": [
    "Explicit Language",
    "i think",
    "I haven't really checked but it's me so",
    "Arthur is shook",
    "the nobles are trying so hard",
    "Merlin is having a great time",
    "he is being spoiled like he deserves damnit",
    "Humor",
    "Attempt at Humor"
  ],
  "language": "English",
  "series": "",
  "published": "2019-06-23",
  "completed": null,
  "words": "5,881",
  "chapters": "1/1",
  "comments": "397",
  "kudos": "22,259",
  "bookmarks": "4,001",
  "hits": "125,485",
  "summary": "<p>“So let me get this straight,” Arthur said, folding his fingers together as the man in front him awkwardly shifted. “You are under the impression if you win the favor of my servant that you will then win my favor?” He asked and the nobleman shifted again. </p>\n<p>“Well, sire.” He said “That is the common consensus among… The chatter.”</p>\n<p>“The chatter.” Arthur repeated and his mind flashed to all the kindness Merlin had received from other nobles. Dear God. </p>\n<p>Or</p>\n<p>Merlin has all of Camelot (and neighboring kingdoms) wrapped around his finger and Arthur is beginning to resign himself to the fact his servant somehow has more power than he does.</p>",
  "notes": "<p>BAM! Two Merlin one-shots in a weekend? Yes. I gotta get it all out of my system so I can finish all my other stuff lol.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>I might just put all of my Merlin one-shots in a series tbh. There's like six of them now (probs gonna be more too) so keep an eye out for that.</p>",
  "text": "<p>“Lord Ponte is a git.” Merlin announced as he stomped into Arthur’s room, causing the usual ruckus as he banged door open and dropped Arthur’s newly polished boots onto the floor. The king glanced up at him from his desk, but didn’t bother to reprimand the treasonous words. He had heard it enough times that he was almost immune to it.</p>\n<p>“Did you finish with my armor?” He asked instead, dipping his quill into a pot of ink to sign yet another form. From across the room, Merlin huffed.</p>\n<p>“Yes, no thanks to your lovely <em>visitor</em>.” He grumbled. Arthur wondered if he should humor him by asking what Lord Ponte did, but his servant didn’t seem to need to be asked as he launched into a tirade. Apparently the visiting noble had tried to enlist Merlin’s help in seducing another visiting Lady. Why anyone would think <em>Merlin</em> was a good wingman was beyond Arthur, but nevertheless Merlin seemed to have vehemently opposed the situation anyways.</p>\n<p>“I hope you choose somebody else to give the title to.” Merlin finally mumbled “Ponte is just going to use it to try and crawl his way onto women.” He wrinkled his nose and closed Arthur’s curtains. The king hummed absently, trying to focus more on the task in front of him than Merlin’s words.</p>\n<p>“There isn’t anyone else qualified.” He commented “But I will talk to him about he treats those in my household.” He added as an appeasement. Merlin didn’t look appeased.</p>\n<p>“Lady Ponte is more than qualified.” He pointed out and Arthur paused.</p>\n<p>“<em>Lady</em> Ponte?” He repeated with some curiosity. He hadn’t seen much of Lord Ponte’s wife, but knew Merlin had spent time helping her around the castle. She was a warm, sweet lady who Arthur was fairly certain would also cut your throat if offended. It might have been Merlin’s fondness of her that led to his annoyance towards Lord Ponte.</p>\n<p>“She runs most of her husband’s affairs anyways,” Merlin shrugged, fluffing some pillows “This one would simply be in her name. She more than deserves it with putting up with her gross husband.” He added. Arthur put down his quill, considering. He hadn’t really contemplated a woman to be burdened with this responsibility… But he didn’t see what the issue would be.</p>\n<p>“Alright,” He finally said after weighing the pros and cons in his head. “If only to get you to shut up at Lord Ponte.” He rolled his eyes. Merlin smiled brightly.</p>\n<p>“I can’t wait to see the prat’s face.” He beamed. Arthur sighed. It was amazing Merlin had lived so long with his blatant disrespect of some nobles. Granted, it wasn’t everyone, but if he didn’t like someone it wasn’t at all discreet. Probably most of the castle would be familiar with his servant’s disapproval towards the visiting noble. He hoped after the ceremony this afternoon he would never have to hear about him again.</p>\n<p>“You look exhausted.”</p>\n<p>Arthur blinked in confusion as Lord McGuire glanced over in his direction. He didn’t feel particularly tired, nor had he been missing much sleep. His confusion must have shown on his face because the older man chuckled.</p>\n<p>“I was speaking to your servant, sire.” He bowed his head “I apologize for the lack of clarity.”</p>\n<p>Brows crinkling together, Arthur turned to look at Merlin who was behind him with a jug of wine. He did look awful. Arthur wasn’t sure how he hadn’t noticed it earlier. Dark circles were under his eyes and face a slightly paler shade than his usual translucent color. Arthur wondered if he was sick, hung over, or something else entirely.</p>\n<p>“Merlin?” He asked and the boy in question met his eyes with a jolt.</p>\n<p>“Um, yes sire.” He shifted “I’ve been helping Gaius with patients all night.” He admitted and Arthur sighed. Of course he was. Merlin talked non-stop unless it was anything of actual importance. That was when he seemed to become tight-lipped about everything. Pinning him with a hard look he nodded.</p>\n<p>“Go get George then.” He ordered him “And get some sleep, idiot. We’ll talk about this later.” He warned. Merlin looked like he wanted to argue, but Arthur’s glare cut him off. Muttering pleasantries, he put the jug down and stumbled out of the room. Lord McGuire smiled.</p>\n<p>“You’re kind to your servants.” He noted “I’ve heard you treat all members of your household with great respect.”</p>\n<p>Arthur wasn’t entirely sure if he had missed the part where he called Merlin an idiot or if he just had exceptionally low standards for treatment of the lower class. Either way, he wasn’t going to correct him.</p>\n<p>“It appears I could stand to be more observant,” He commented “Thank you for noticing. Merlin doesn’t… Tend to understand physical health at times.”</p>\n<p>“My understanding was he was the physician’s apprentice.” McGuire told him, grabbing another plate of grapes. Arthur held his arms out slightly with a sigh.</p>\n<p>“It makes the frustration greater.” He admitted and the lord laughed.</p>\n<p>“This why I would like my son to be trained under you,” He said and nodded when George refilled his cup eagerly (how did he get here so quickly?). “I’m not as young as I used to be and want to know he has learned to be kind to his charges once I am gone. My own father was… Strict with our household. It brought nothing but pain and betrayal.” He sighed. Arthur nodded. He hadn’t really considered McGuire’s son too closely for knighthood. Perhaps he was only considering his skills and not his potential.</p>\n<p>Besides the man deserved some kind of thank you for not letting Arthur work his servant to death. He really needed to talk to the moron about that.</p>\n<p>It wasn’t unusual for visiting ladies to flirt with Merlin.</p>\n<p>Arthur often found it amusing. Merlin had been so profoundly uncomfortable with it at first he often offended many of them by just walking away whenever they tried to talk him. Now, he seemed to take it in stride with small nods and bright smiles that had them all cooing over him.</p>\n<p>Nobody had really given him gifts before though. Arthur shouldn’t be terribly surprised. Whenever Lady Kenna visited she often looked more forward to seeing Merlin than actually greeting the King. The two had become good friends over the course of her visits where she would try and teach him Greek poetry and he would show her how to make different potions and medicines.</p>\n<p>So Arthur wasn’t completely shocked when she brought him a few rare books that contained old works of Homer. Merlin had been scandalized, insisting he couldn’t accept. Kenna had merely rolled her eyes at him and threatened to have him in the stocks if he didn’t accept.</p>\n<p>“You can’t throw me in the stocks!” Merlin had replied indignantly. Kenna rose a brow and turned sparkling eyes onto Arthur who threw his servant a wicked grin.</p>\n<p>“I’m always looking for a reason to put you in the stocks.” He shrugged and Merlin immediately tugged the books close to his chest with a glare at both of them. Kenna beamed, patting Arthur’s hand affectionately before prompting Merlin to read the first book.</p>\n<p>“I want to see how much you’ve forgotten.” She teased and Merlin gave a gasp of offense. Arthur rolled his eyes. Lady Kenna’s mother was asking for help to choose a suitable suitor for her, which was both a blessing and a curse. A blessing because Arthur wouldn’t have to do any work – Merlin would be passionate enough about ensuring his friend ended up with someone kind and loving. A curse because Merlin would think <em>nobody</em> was good enough for his friend.</p>\n<p>“Here, you choose.” Merlin told her after pushing the final three candidates at her. Kenna peered over at the men, tapping her lip as if picking out a dress rather than a husband. Her eyes paused over one of the names before scowling up at the pair.</p>\n<p>“<em>Merlin</em>.” She scolded, but her eyes were bright “How on earth did you get Robert on this list?” She asked and Merlin gave a small shrug. Arthur sighed. Kenna and Robert had chemistry ever since they first laid eyes on one another a year ago. Unfortunately, Robert was courting another woman who Merlin was not a fan of (‘She called Percival a dog, Arthur!’) and thus, not available. After a lot of needling from a certain servant, Arthur eventually intervened and pointed out that Lady Kenna would be a better match than his current bride to be. Robert didn’t need much convincing and with the king’s blessing he was free to break the engagement without consequence.</p>\n<p>“I swear, Merlin.” Kenna laughed “You might be the best ally to have in Camelot.”</p>\n<p>“Excuse me?” Arthur blinked, but Merlin gave a bright smile to both of them.</p>\n<p>“She said what she said, Arthur!” He beamed and Arthur crossed his arms, glowering over at him. It was a bit hard to be annoyed when he was obviously so pleased by the compliment, but Arthur wasn’t one to let him get away with <em>everything</em>.</p>\n<p>“Enough of you. Stocks.”</p>\n<p>“This is why you’re the worst ally in Camelot.” Merlin muttered.</p>\n<p>It was strange.</p>\n<p>Ever since Lady Kenna gifted Merlin with those two books other nobles began to do the same. Lords, Ladies, knights, and even some visiting kings and queens offered some sort of small trinket to Merlin whenever they visited whether it be something from their homelands or things that might help him with his duties. Merlin had been just as puzzled as Arthur – while Kenna’s gift had made sense, there was no reason for all of nobility to start treating a servant this way.</p>\n<p>“Maybe they think it’s a sign of respect.” Merlin told him after they finished eating a pie a duchess had brought them earlier that day “It is well known how you treat members of your household. They might want to show you they will do the same.”</p>\n<p>“I don’t <em>spoil</em> you.” Arthur scoffed “I would be satisfied if they refrained from punching you.” He said, swiping his wine away from Merlin who had been trying to sneak a sip. “If this keeps up you’re going to start thinking you’re entitled to things.”</p>\n<p>“Like you do?” Merlin told him flatly and Arthur aimed a kick from underneath the table.</p>\n<p>“I’m the king.” He grumbled.</p>\n<p>“Come, boy.”</p>\n<p>“Sire?” Merlin asked, confusion coloring his tone as he was offered a seat across from the King of Wessex himself. The man looked to be about a hundred with tiny eyes and a rather large mustache that was pure white. He patted the seat again.</p>\n<p>“Play with me.” He said, gesturing to the black and white board in front of them. Merlin eyed it warily.</p>\n<p>“I’m not sure I know how.”</p>\n<p>“All the better. I’ll teach you.” He insisted and when Merlin hesitated, offered a warm smile. After a few minutes of coaxing him, Merlin finally sat down and got lost in the rules of chess. When Arthur came by hours of later, they were on their eighth match.</p>\n<p>“Have you heard of this game, sire?” Merlin glanced up. Arthur was watching them with an air of exasperation, arms crossed as the other king moved one piece further up the board “You should learn. It’s fun.” He said, tongue poking out of the corner of his mouth.</p>\n<p>“I see that.” Arthur commented, disapproval heavy. Wessex’s king blinked up at him, confusion lacing his brows before sending his queen to finish off Merlin.</p>\n<p>“You can keep it.” He said when Merlin tried to help him pack it away. Arthur was honestly aghast.</p>\n<p>The trend continued.</p>\n<p>It seemed as though everyone with a speck of noble blood in their veins was attempting to woo him. The gifts continued, many nobles took him aside to teach him some new skill or subject (Merlin’s favorite so far had been astrology), or sometimes he was invited simply for tea.</p>\n<p>Nobody knew why. Arthur wasn’t entirely convinced sorcery wasn’t involved. Sure, nobles had always been either charmed or horrified by Merlin. He was a bold personality you either hated or loved, but it was never to this extent.</p>\n<p>“It’s the cheekbones.” Gwaine suggested during training. Merlin had just come back to lug Arthur’s armor to him after stopped by a young prince who <em>insisted</em> on showing Merlin proper sword fighting. Arthur will admit he wasn’t fond of <em>that</em> particular gesture. Especially since Arthur himself could teach Merlin if he so chose. “They look so regal. People must think he’s an undercover royal.”</p>\n<p>“Hey!” Merlin frowned and the other knight laughed fondly.</p>\n<p>“Worry not, Merlin. I would never let nobility claim you.” He smiled, ruffling the boy’s hair. Merlin gave a nod of affirmation before handing Arthur his sword.</p>\n<p>“It’s so strange. What would they gain by having me like them?” Merlin shook his head “You lot don’t even buy me… Uh. What were they? Macroons?” He said and Leon scoffed.</p>\n<p>“Because we can get you to like us with our personalities.” The knight told him and gently cuffed the back of his head “Arthur is right. You are getting much too spoiled.”</p>\n<p>“Yeah, we need to bully you more.” Elyan teased “Gwen said last week you were given a horse of your own.”</p>\n<p>“A <em>horse</em>?” Arthur repeated, eyes flicking to Merlin in alarm. The servant only shrugged. “What the- I don’t understand.” He groaned “You have to give that back.”</p>\n<p>“I tried!” Merlin said helplessly “But the duke said no and then he told me if I didn’t take her then they were just going to kill her anyways and I can’t be responsible for Sylvia’s death!”</p>\n<p>“You named it!?” Arthur asked, mouth gaping open. Merlin paused.</p>\n<p>“…no.”</p>\n<p>Arthur sighed.</p>\n<p>“What’s the harm?” Gwen chuckled later that afternoon. “They aren’t causing any trouble.” She pointed out, sitting on the edge of his bed. Arthur was sorting through some papers, having been in the midst of plotting to stop this madness.</p>\n<p>“I just don’t understand <em>why</em> it’s happening.” He shook his head “Are they trying to kill him somehow? What would a dead Merlin do for them?”</p>\n<p>“Arthur,” Gwen interrupted with a frown. She had pulled out Arthur’s sword and was balancing it in her hand “What do you mean you don’t know why? It’s obvious.” She told him and Arthur froze. When he didn’t respond, the girl sighed. “They want <em>you</em> to like them.”</p>\n<p>“Well they aren’t giving <em>me</em> horses, are they?”</p>\n<p>“No. They are giving your best friend horses.” Gwen told him and Arthur stared. She stared back. For a solid five minutes they just looked at each other before Arthur spoke again.</p>\n<p>“Merlin isn’t my friend.”</p>\n<p>“Well, whatever you label him as.” Gwen rolled her eyes though there was something in her expression that told him she hadn’t been thinking of the word ‘friend’ either. “People know that if <em>Merlin</em> doesn’t like them then <em>you</em> won’t like them.” Gwen explained as if speaking to a small child. Arthur opened and closed his mouth. That just didn’t make any sense. The idea that Merlin had any political sway at all was ridiculous.</p>\n<p>On some level Arthur knew he should be angry people thought a servant had that much influence on his decision making, but he was more offended these nobles had been using his servant like chess piece (yes, Merlin finally got him to play the damn game).</p>\n<p>Jaw clenched, he stabbed his signature on another form. Gwen sighed. Her eyes were watching him closely, lips pushed out slightly, concentrating with pinched features.</p>\n<p>“You know,” She said casually “I think I can see why you’re worried.”</p>\n<p>Arthur paused. If he was honest… He wasn’t entirely sure <em>why</em> he was worried. He just knew he was. More annoyed, but…Maybe a little worried too. Gwen set his sword down beside her, clasping her hands together “Eventually they’ll start giving him land and money. Enough so he could get a nice home of his own – which I’m sure would be <em>lovely</em>. Especially when they offer him a wife or-”</p>\n<p>“Are you insane?” Arthur squawked. His quill had dug a hole into the parchment. Arthur tried to ease his grip, but it only ended up snapping the tip off. Gwen smiled. “Why would they think I would approve of that?” He glowered. For some reason, the maid’s smile grew even wider.</p>\n<p>“Why wouldn’t you?” She countered “I mean, it would make it hard for Merlin to work for you-”</p>\n<p>“Then what’s the <em>point</em> of any of it? If he doesn’t work for me then he has no way to tell me if he likes them or not. <em>If</em> that was a thing.” He said and Gwen held up her hands in surrender. For some reason though, her expression wasn’t one of someone who had lost.</p>\n<p>“Of course, sire.” She nodded “It was just my humble theory on the matter. Would you like me to draw you a bath before you go?” She asked, standing up to dust off her dress. Arthur shot a suspicious glance, giving up on his work. For once, his chambers were clean and well attended to. He wondered when Merlin had done it, considering he hadn’t seen him most of the day.</p>\n<p>“Merlin will be here soon,” He dismissed. He expected Gwen to curtsey and leave, but he looked up to find the girl gnawing at her lower lip. “Yes?”</p>\n<p>“Well… Merlin actually won’t be here tonight.” She admitted and Arthur rose a brow. Something told him he would not be fond of her next words “Duke Orley requested Merlin join him on a trip to the carnival in the lower town.” She said. Arthur pinched the bridge of his nose.</p>\n<p>“Get me Gaius.”</p>\n<p>“You’re <em>joking</em>!” Merlin whined as Arthur steered him away from the courtroom and down the stairs, hand firmly grasping his upper arm “This isn’t my fault! I never asked-”</p>\n<p>“I know, but it hardly matters now, does it?” Arthur asked him. He was a few strides ahead of the servant so that Merlin stumbled a bit as he was dragged along. A few muttered words under his breath had Arthur not feeling quite as bad when he shoved him into the cell.</p>\n<p>“If the guards are nice are you going to behead me?” Merlin snapped when Arthur locked the door.</p>\n<p>“It’s only for a few days.” Arthur rolled his eyes “Until the House of Newcastle leaves. I don’t need anyone drooling over you while I try to organize a treaty.” He said and Merlin crossed his arms. Arthur met his gaze without much remorse, smirking a bit when he jangled the key in front of him and snapped it on his belt. Fury played over the other man’s gaze.</p>\n<p>“Remember I’m the one who brings you your food!” He yelled as Arthur marched out “It would be all too easy to slip something in there!”</p>\n<p>Arthur wished the guards were just a little fazed at the threat to their king’s life, but neither of them even turned to look at Merlin. Great. When he came back he half-suspected Merlin would be surrounded by admirers offering to redo the dungeons to his taste.</p>\n<p>As it happened, Arthur’s plan did work quite well in the end. The treaty was successful and only one person asked about his servant’s whereabouts. Nobody tried to offer any gifts, lessons, treats, smiles, or favors.</p>\n<p>The dungeon was in perfect shape too. Aside from one thing.</p>\n<p>“Where is my servant?” He asked the guards as he stared the empty cell. The pair glanced over at him from where they were playing chess (had Merlin taught the entire castle?) before looking at one another.</p>\n<p>“He asked to be let out.”</p>\n<p>“I… What?” Arthur blinked, taken aback.</p>\n<p>“Well,” The guard frowned, shifting his grip on his weapon slightly “We didn’t think you serious about putting him in there.” He began and when Arthur spluttered the guard hurriedly tacked on “We just mean, my lord, that your servant didn’t commit a crime. We figured you were just annoyed with him or something.”</p>\n<p>“So, you let him <em>out</em>? <em>Without my permission</em>?” He snapped out, anger coiling around his stomach.</p>\n<p>“He said you wouldn’t mind.” The other pouted and Arthur took a heaving breath. “And I mean, sweet thing like him hardly can cause much trouble, can he?”</p>\n<p>King Arthur Pendragon of Camelot. Son of a long line of proud rulers, knight of his land, slayer of dragons and hero among his people. One would <em>think</em> he would have enough power to keep his servant locked up for three days. Apparently not. <em>Apparently</em>, he was to be outdone by his servant’s charm.</p>\n<p>“When I come back, I’ll have you both in the stocks. If not <em>worse</em>.” He hissed at the pair and slammed the door back open. He was going to <em>kill</em> Merlin.</p>\n<p>“Come on, Arthur.” Gwaine sighed “He looks so miserable.”</p>\n<p>“Good.” Arthur muttered as he wiped the sweat off his brow. The training session had been intense and in the sweltering heat, he wanted nothing more than to strip off his armor and sleep the rest of the day away. The rest of his knights were in a similar position, minus Gwaine who looked as though he was too busy feeling sorry for Merlin.</p>\n<p>“It really isn’t his fault,” Gwaine continued “What’s torturing him like this going to do?”</p>\n<p>“Keep him out of trouble.” Leon, bless him, spoke up. Arthur knew the older man would take his side “Do you ever notice how often he sneaks off now? I’m worried some noble is trying to get something from him.” He said and Arthur paused at that. He looked at Merlin across the field. Had he been disappearing?</p>\n<p>“No, no.” Elyan dismissed “Merlin has always done that. Gwen said he did it when he was first hired too. No nobles involved. I’m with Gwaine on this one.”</p>\n<p>“Technically, I’m doing him a favor.” Arthur shrugged “He needs to learn to fight eventually. How many times have we been attacked by bandits on expeditions?” He asked and Gwaine crossed his arms, his eyes drifting back to where Percival had knocked him back down. Arthur had Merlin engaged in knight training for the past week, knowing there was nothing Merlin hated more than being forced to use a sword. Except for maybe hunting.</p>\n<p>“Well, maybe a drink will cheer him up.”</p>\n<p>“No!” Arthur scowled “Not you too.”</p>\n<p>“He’s my best mate. I’m allowed to be nice to him.” Gwaine snorted and pushed sweaty hair for his forehead “Maybe you should try saying something to the <em>nobles</em> if it bothers you so badly. Nothing will change if you keep punishing Merlin for it.” He said. Arthur wanted to argue it wasn’t technically a <em>punishment</em>. It was productive. If Merlin happened to hate it then that was just a bonus.</p>\n<p>“Water,” Merlin breathed when Percival (literally) dragged him over a few minutes later “I can’t feel my arms. Gwaine.” He said and dramatically held out an arm for the knight to place a waterskin in. “Thank you.”</p>\n<p>“Poor Merlin.” Arthur said, not a hint of sympathy in his voice. The servant looked pitifully up at him from where he lay on the ground. Arthur rolled his eyes.</p>\n<p>“No,” Arthur said with a firm shake of his head “I draw the line here. Absolutely not.”</p>\n<p>From beside him, Merlin made a noise that kind of sounded like a strangled cat. For once, Arthur couldn’t blame him as he looked at the mess in front of them.</p>\n<p>“My lord?” The noble asked and Arthur tried not to gawk and the bewildering state of it all. Why, in any life, would Merlin ever need or <em>want</em> a sorcerer?</p>\n<p>“You <em>do</em> realize magic is outlawed in Camelot? And we do not give <em>people</em> as gifts?” He demanded, eyes flicking towards where the druid girl sat in chains. Her eyes were blown wide, lips cracked and bleeding in a way that suggested she hadn’t had anything to drink in a long time.</p>\n<p>The noble blinked. From the corner of his eye, Arthur could see Merlin’s hands clench. Unsurprising. His servant was a bleeding heart for every cause. Looking back at him he tilted his head slightly. Merlin gestured subtly towards the girl and Arthur nodded.</p>\n<p>“What’s your name?” Arthur asked her and she flinched.</p>\n<p>“Too loud.” Merlin hissed at him quietly, and took a few long strides before stopping a good foot away from her. “I’m going to unchain you, alright?” He said and yanked the key away from the noble, who was watching the exchange with bafflement.</p>\n<p>“Lela.” The girl whispered when Merlin undid the locks “My name is Lela.”</p>\n<p>“I’m Merlin.” He smiled back “We’re going to get you to our physician, Gaius, alright?” He told her and Lela’s eyes drifted to where Arthur stood. Subtly, her hand drifted to her neck. She pressed a bit more into Merlin when the king met her gaze.</p>\n<p>“I have made peace with the druids,” He reassured her “After you heal you will be allowed to leave, free of punishment.” He promised “I give you my word.”</p>\n<p>He wasn’t sure what was better – Lela’s relief or Merlin’s smile.</p>\n<p>“So tell me,” He said after the pair disappeared out of the room “<em>Why</em> is my servant being gifted? It has been months and I still cannot fathom why he is in the midst of such attentions.”</p>\n<p>The noble man grimaced and with a wave of his hand ordered the rest of his people out of the room. An either wise or very unwise choice on his part. Arthur gestured for them to sit at the dining table, silently hoping George would somehow know he was needed. Within seconds he heard the sound of goblets hitting the table and knew his prayers had been answered. He should really check to see if that man was using sorcery. His efficiency was bewildering.</p>\n<p>Or maybe he was just used to Merlin.</p>\n<p>“Sire,” The nobleman started and pressed the tips of his fingers together “I don’t wish to…Overstep, but it has come to the attention of many that… You treat the members of your household with respect.”</p>\n<p>“Correct.”</p>\n<p>“And…While <em>all</em> members your household receive such honorable respects from you, there is… Favoritism.” He said slowly. Arthur stared. He has <em>got</em> to be kidding.</p>\n<p>“Favoritism.” He repeated “You mean, Merlin.”</p>\n<p>“Yes!” The noble said, nodding eagerly “Yes, exactly. People have seen that you regard him…Differently than others in your service. With more trust.”</p>\n<p>Arthur didn’t understand. He didn’t even trust Merlin to bring him his breakfast in timely manner.</p>\n<p>“And in the past, people who have won your servant’s affections have received profit.”</p>\n<p>Dear God. Gwen was <em>right</em>.</p>\n<p>“So let me get this straight,” Arthur said, folding his fingers together as the man in front him awkwardly shifted. “You are under the impression if you win the favor of my <em>servant</em> that you will then win <em>my</em> favor?” He asked and the nobleman shifted again.</p>\n<p>“Well, sire.” He said “That is the common consensus among… The chatter.”</p>\n<p>“The chatter.” Arthur repeated and his mind flashed to all the kindness Merlin had received from other nobles. Dear God. How was he going to get himself out of this one?</p>\n<p>“Yes, your majesty.” The noble nodded and Arthur considered.</p>\n<p>“Would you excuse me for a moment?”</p>\n<p>“The…The <em>audacity</em>!” Arthur yelled “The <em>nerve</em>! The… Audacity!” He shouted again for lack of a better term as a paced the length of the armory. His knights made varying noises of agreement that seemed more amused than actually sympathetic. Arthur ignored them. “Can you believe this?!” He asked. Merlin shook his head, popping another chocolate in his mouth.</p>\n<p>“It’s crazy!” He said and Arthur paused.</p>\n<p>“Who gave you that?” He asked, looking at his servant “Chocolate is…It is a <em>rare</em> delicacy that is expensive.”</p>\n<p>“I know! Lady Yolanda said she had extra.” Merlin told him brightly and tilted the cloth to him “Want one?” He asked and Arthur took a long breath.</p>\n<p>“How do I fix this?” He asked “I <em>cannot</em> have my peers thinking I am manipulated by a servant!”</p>\n<p>Merlin licked his fingers clean of the chocolate, offering Gwaine a bite.</p>\n<p>“I don’t know,” He shrugged and bit into another chocolate “It doesn’t seem so bad.” He said and Arthur stared at him with pursed lips. Leon, for his part, did look a little sorry that Arthur was in this situation and clapped a hand on his shoulder.</p>\n<p>“I don’t see what the problem is,” Gwaine said, snagging a few of the chocolates from Merlin “It isn’t like they actually <em>are</em> manipulating you… Or Merlin.” He said and sighed at the sweet taste in his mouth. Arthur sighed, but did give a small hum at that. It was true… Despite, well, everything he would say his policies had been sound.</p>\n<p>“Besides,” Merlin piped up “It’s good. I know a lot of things about the other nobles.” He said with a shrug. Arthur rolled his eyes. He honestly wasn’t that interested in whatever gossip Merlin had found out during his time with… Everyone. “For example, I know Lady Helene is planning on killing her husband.” He said and the room paused. “Which might be important considering King Bayard is giving him a rather large portion of his land to him that would undoubtedly be passed to her if he met a, uh, ill fate.” He added and bit into more chocolate.</p>\n<p>“<em>Merlin</em>,” Leon admonished, mouth dropping as he paused in polishing his sword “Why would you not mention that sooner? The man’s life is at stake!” He scolded. Merlin puckered his lip out, putting a hand over his chest in affront.</p>\n<p>“I know,” He sniffed “And I already told the Duke of Cassingworth.” He said and paused as if waiting for there to be a gasp of realization. When he only received blanked stares, the servant sighed and put the chocolate down before glowering at them all. “Her husband’s <em>cousin</em>?” He pressed. Nothing. “For the – Once Bayard finds out she is trying to murder her husband he isn’t going to give them the land and will reward the Duke, a member of <em>Camelot’s</em> court, with the land.”</p>\n<p>“I’m not sure what he just said,” Gwaine frowned “But it sounded genius.”</p>\n<p>“You… Tricked Bayard-”</p>\n<p>“I didn’t trick him!” Merlin objected and paused “Though I did trick Prince Gerran into giving us extra grain from his kingdom.” He said and wrinkled his nose “Was that wrong…?” He asked, a little uncertainty “I only did it because I knew they were just using me to get to you.”</p>\n<p>Arthur stared.</p>\n<p>“Have you been doing this the whole time?” He asked and the servant looked around at where the knights were all watching him with expectant eyes.</p>\n<p>“…maybe.”</p>\n<p>Perhaps Arthur should have been upset that his servant was meddling with political affairs. But… A larger part of him was almost a little relieved. It turns out Merlin hadn’t been so easily dazzled by the pretty offers the nobles had for him. He should really know better than to underestimate the man’s loyalty at this point.</p>\n<p>“I…Fine,” He murmured “Fine. But Merlin you must start telling these people no and <em>stop</em> getting involved in things that will certainly have you killed.” He warned “If they found out you were using them-”</p>\n<p>“They were using <em>me</em>!” Merlin objected and Arthur stared him down. “Alright, but I think I have a plan on how to lower taxes through Lady Trina’s marriage. She’s a toad of a person so you won’t mind if I rob her, right?” He asked with…Yep. That was hope in his voice. Arthur felt as though his knights should be more appalled by this. Leon didn’t let him down as the knight began to sputter indignantly.</p>\n<p>“Ooh… Isn’t she the cow who told Gwen not to look her in the eyes?” Elyan piped up “Yeah, we can rob her.” He mused. Arthur shrugged. Fine. Whatever. It wasn’t like <em>he</em> had a say in things. Oh no, not when King Merlin wanted something. Arthur? Arthur who? Camelot only knew of his highness Merlin.</p>\n<p>Preposterous.</p>\n<p>And yet…He knew he probably wouldn’t do anything about it. Maybe if pressed he would admit that…Down. Deep, deep down. <em>Deep</em> down that Camelot was essentially a reflection of himself… And damnit, if he could give Merlin everything he wanted…Maybe he would.</p>\n<p>Not that Merlin would ever find that out in a million years.</p>\n<p>Besides, he had other problems to attend to. The druids being the prime one at the moment. Despite his firm refusals, they kept sending him gifts – magical remedies, beautiful mementos from ancient sorcerers, rare blessings… He wasn’t sure that making peace with them warranted such kindness.</p>\n<p>Not to mention there was the whole situation where a white dragon (yes, a <em>dragon</em> – apparently, he had not killed the last one) kept coming along and healing him whenever he got injured. He hadn’t dare to mention it to anyone… Mainly for the fact he wasn’t sure <em>why</em> this dragon was healing him in the first place when he was no friend to it.</p>\n<p>Why was the magical community suddenly trying to please him anyways?</p>\n<p>“Arthur?” Merlin interrupted suddenly, brows coming together with a slight tilt of his head “What is that around your hand?” He asked cautiously. Arthur glanced down to see a beautiful band of silver with markings dotting the outside and a symbol in the middle. He touched it, having forgotten it was there.</p>\n<p>“Oh, yes.” He mused “It was a gift from a boy I saved some time ago,” He shrugged “Gilli, I think. He was attacked by bandits and I helped.” He said, with a small shake of his head. “He insisted I keep this… He said something about Emrys using it to protect me.” He added with a wry shake of his head. He wasn’t sure what that meant, but at any rate Gaius had only smiled secretly and assured him the ring meant no harm.</p>\n<p>Merlin, for his part, seemed exasperated.</p>\n<p>“Why do they spoil you?” He grumbled and held up his hands as if giving up on everything. Arthur wanted to argue that his people thought he was a great king which seemed like a reason enough to spoil him. However, Merlin had already disappeared, still muttering under his breath.</p>\n<p>“I want a cool ring!” Gwaine complained loudly as the exited the armory.</p>\n<p>Arthur wasn’t sure how, but three days later Gwaine received, in fact, twelve different rings.</p>\n<p>Percival also happened to come across some magical armor that somehow fit him. Elyan found an old sword that he swore was his father’s work from when he was a boy. Leon came across a beautiful old relic that he claimed had been stolen from his family many years ago.</p>\n<p>Merlin only shook his head.</p>\n<p>But really, he had no reason to be so frustrated. King Baylor had just gifted him with an entire library. So if anyone was spoiled…It was him.</p>\n<p>…And apparently this Emrys guy that people kept saying they were honoring when giving Arthur things. </p>"
}