{
  "id": "19339156",
  "url": "https://archiveofourown.org/works/19339156?view_full_work=true",
  "author": [
    "Kedreeva"
  ],
  "title": "You're the Only Prayer I Need",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "Good Omens (TV)"
  ],
  "relationships": [
    "Aziraphale/Crowley (Good Omens)"
  ],
  "characters": [
    "Aziraphale (Good Omens)",
    "Crowley (Good Omens)"
  ],
  "additional_tags": [
    "Ineffable Husbands (Good Omens)",
    "Wingfic",
    "Wings",
    "Angel Wings",
    "Angel/Demon Relationship",
    "Wing Grooming",
    "Bathing/Washing",
    "Cuddling & Snuggling",
    "Asexual Character",
    "Asexuality",
    "Asexual Relationship",
    "Snake Crowley (Good Omens)",
    "shedding skin",
    "Love Confessions",
    "Trust",
    "Non-Sexual Intimacy"
  ],
  "language": "English",
  "series": "",
  "published": "2019-06-24",
  "completed": null,
  "words": "5,507",
  "chapters": "1/1",
  "comments": "450",
  "kudos": "11,812",
  "bookmarks": "1,828",
  "hits": "68,581",
  "summary": "<p>Crowley had, in the six thousand years Aziraphale had known him, shed his skin exactly twice that Aziraphale knew of. Both times he had disappeared without a trace, having retreated somewhere very safe and very, very unknown to hide while he was so vulnerable, and Aziraphale had never thought to ask beyond that information. Everyone was, he had supposed at the time, entitled to their secrets.</p>\n<p>The problem was that he had stumbled directly into this secret now, and there was hardly a graceful way out of it.</p>",
  "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a>.)</p>\n<p>Beginning quote is from \"Oh My Love\" by The Score.</p>\n<p>If you enjoyed this, I would love to hear from you!</p>",
  "text": "<p class=\"western\" align=\"center\">\n<em>Oh my love, let me be your fire</em>\n</p>\n<p class=\"western\" align=\"center\">\n<em>We're a thousand miles up and I'm 'bout to get higher</em>\n</p>\n<p class=\"western\" align=\"center\">\n<em>Feel my heart beating out my chest</em>\n</p>\n<p class=\"western\" align=\"center\">\n<em>You're the only prayer I need to make me feel blessed</em>\n</p>\n<p class=\"western\"> </p>\n<p class=\"western\"> </p>\n<p class=\"western\">            There were very few things in the world which Crowley would deny himself, and a spacious bathroom was not one of them. Some might have argued that his entire flat could not have contained the sort of bathroom Crowley had, and they would be right, but the laws of physics, such as they were, did not always apply to those with enough will, imagination, and actual magic. Luckily for Crowley, he had an abundance of all three, and so it was that his London flat had a bath more than large enough for him to spread both of his wings to their fullest at once and not touch either wall.</p>\n<p class=\"western\">            All of it had been done in such a plain white that it seemed almost out of place with the slate color decorating the rest of the flat. No marbled veins marred the walls or floors, and even the ceiling was unbroken by fixtures. The only light in the room came from strips that did not seem to actually attach to anything, but shone so brightly that, reflected by all of the smooth, unbroken white, almost hurt to view.</p>\n<p class=\"western\">            One might wonder why a demon, used to the deep, dank labyrinth of Hell, would decorate his innermost refuge so starkly bright, but the answer was in the question, really.</p>\n<p class=\"western\">            Most of the room had been sunk into the floor by a couple of feet, turning it into a whole-room bath with a drain in the middle that was just as afraid to malfunction as Crowley's plants, and so filled and drained without the need for a plug. Crowley twisted the controls for the faucet, and water began to flow from the ceiling like a heavy rain, splattering within the pristine pit below. The sound of rainfall echoed pleasantly around the bathroom, and Crowley closed his eyes to enjoy it for a long minute, until the water had heated and the drain had closed to begin forming a puddle.</p>\n<p class=\"western\">            Crowley carefully laid his towel behind the dressing wall in the corner. He could not, unfortunately, rid his wings of water by miracle very easily, but he had long since found that some mortal comforts, like that of a soft, freshly-laundered towel immediately after a bath, were worth the trouble of going about needing them.</p>\n<p class=\"western\">            The water that had collected had cooled on the tile, but the false rain still falling from the ceiling ran down his skin in heated rivulets to pool at his feet. He lifted his face into it, not bothering to breathe, and bit by bit he began to relax. Slowly, his wings began to droop, and when the first primary touched the floor, he lifted both wings together and spread them out under the softly dripping spray.</p>\n<p class=\"western\">            The feathers themselves had no nerves, the same as any bird, but he could feel the tug of the water as it wet his feathers, introducing them to gravity in a way to which they were unaccustomed. He let them get just heavy enough to give gravity a run for its money before he let it win, sinking down to his knees, wings slacked open so that the edges rested upon the tile floor.</p>\n<p class=\"western\">            It took a while for the pool to fill completely, and through the wait Crowley just knelt in the middle, letting the water run over him and the steam accumulate to the point where the air was thick with it, just as he had wanted. He raised a hand from the warm water just long enough to flick a snap at the knobs, and the water trickled to a stop, leaving him in peace and quiet once more.</p>\n<p class=\"western\">            He closed his eyes, extending his senses beyond the physical, but it was a sleepy Saturday morning in all of London, and even the few humans in the building that were awake had not even sat down to breakfast yet. It had been weeks since his kidnapping. No one was coming for him. He could let his guard down, just for a little while.</p>\n<p class=\"western\">            Carefully, he sank down into the water, spreading himself low enough that he felt a bit like an alligator; wrong reptile, but the right idea. He wanted to soak. And more than that.... he spread his wings slowly, coasting them over the surface so as not to stir up too many waves, until they were spread to their fullest, a tip brushing either side of the massive bathing area. The warm water felt good, holding him aloft. It didn't feel like flying, but Crowley had an imagination. He could extrapolate. He pushed down a little with both wings, the smallest flap, and the water around him surged and wiggled.</p>\n<p class=\"western\">            He grinned.</p>\n<p class=\"western\">            This was, strictly speaking, not a behavior Crowley indulged in often. The work necessary to clean two entire wings full of soaked feathers was unimaginable, except perhaps to those that had done it, and <em>they</em> did not <em>like</em> to imagine it. The last time he'd lived in Heaven, water had not yet been invented, and angels had taken baths in pools of Light instead. Light, as it turned out, did not take several hours to dry or require any sort of special preening to preserve the integrity of one's feathers after it was gone.</p>\n<p class=\"western\">            But sometimes, nothing could beat a soak and a splash in a warm puddle.</p>\n<p class=\"western\">            He braced himself, fluffed all of his sopping wet feathers, and gave his wings several good, hard shakes, spraying water all over the floors and wall, all the way up to the ceiling, and all of the clean, smooth tile made much more sense as the water all sluiced cleanly right back down.</p>\n<p class=\"western\">            Crowley was utterly, thoroughly soaked and content by the time he stopped, partially on his knees in the water, his golden eyes slitted and cloudy. He could very easily have fallen asleep just like that, except for the sudden, startling noise in his bathroom's doorway.</p>\n<p class=\"western\">            \"Good lord, Crowley, what <em>are</em> you doing?\"</p>\n<p class=\"western\"> </p>\n<p class=\"western\"> </p>\n<p class=\"western\">            Aziraphale watched with wide eyes as Crowley scrambled halfway to his feet, slipped, landed face-first in the bath with his too-heavy wings flailing for balance, and then surrendered. He could not tell what was wetter- the otherwise pristine white bathroom or Crowley, but Aziraphale leaned toward the latter.</p>\n<p class=\"western\">            \"Bathing,\" Crowley said from his back, not bothering to fold his wings in again. The barbs of his feathers drifted loftily in the disturbed water as it settled. \"Doesn't anyone ever knock around here?\" A thought seemed to occur to him and he rolled so that he could sit, wings open and floating on the surface. \"Wait, did something happen? Are you okay?\"</p>\n<p class=\"western\">            \"That's what I came to ask you!\" Aziraphale told him, slightly put out. \"I rang four times, and you didn't pick up. I thought...\"</p>\n<p class=\"western\">            Crowley's features softened into a smile. \"You thought they came and got me, is that it?\"</p>\n<p class=\"western\">            Aziraphale nodded, not trusting his voice. Crowley <em>always</em> answered his phone. Maybe not the first time, rarely not the second, but Aziraphale had never had to call more than three times. When the phone had clicked to an answering service for the third time, Aziraphale had started to worry. When it had clicked over a fourth, Aziraphale had closed the shop and come straight here, only to find... this.</p>\n<p class=\"western\">            It made some amount of sense. Aziraphale had seen Hell, and he knew now that there were no Light pools there. Water was not the same, but it clung to one's feathers and washed away dirt and oils, and it was not as though he'd caught Crowley dustbathing, the way some Earth birds did. That would have been undignified. This was... indulgent, almost. Luxurious in a way Aziraphale had never actually considered before but found himself captivated by the further he thought about it.</p>\n<p class=\"western\">            \"Why are you...\" He gestured broadly to the dripping room and although Crowley was looking directly at him, his eyes didn't track the movement at all, and Aziraphale realized he already knew the answer. He had thought it was just the steam, but Crowley actually couldn't see him, or at least not very well, not with his eye caps milked over in blue. \"You're in shed.\"</p>\n<p class=\"western\">            Crowley had, in the six thousand years Aziraphale had known him, shed his skin exactly twice that Aziraphale knew of. Both times he had disappeared without a trace, having retreated somewhere very safe and very, very unknown to hide while he was so vulnerable, and Aziraphale had never thought to ask beyond that information. Everyone was, he had supposed at the time, entitled to their secrets.</p>\n<p class=\"western\">            The problem was that he had stumbled directly into this secret now, and there was hardly a graceful way out of it.</p>\n<p class=\"western\">            \"I ah... I didn't realize,\" he stammered. \"I wouldn't have- well, I'm sure you'd like to be left alone until-\"</p>\n<p class=\"western\">            \"I wouldn't,\" Crowley interrupted. Aziraphale nearly swallowed his own tongue in his rush to stop talking. Crowley's wings dragged in a little closer, almost defensive, and Aziraphale realized he was <em>anxious</em>. \"It's not that I like being alone,\" he continued, obviously pulling each word out like a tooth. \"I'm sorry I didn't answer. I should have let you know, but... old habits and all.\"</p>\n<p class=\"western\">            Aziraphale relaxed, and managed to offer a warm smile. \"I'm just glad you're alright,\" he said, gently, trying not to show how pleased he was to be trusted with something so important. \"And I would be happy to stay. I'll do whatever I can to help.\"</p>\n<p class=\"western\">            Crowley shrugged a little and tipped onto his side, sloshing water onto the floor where it lapped at Aziraphale's shoes before receding. \"There's no way to help,\" he said, pulling one wing in so he could sit against the wall of the pool, leaving the entire rest of it open and empty. \"It'll be boring. You'll have to think of something to do.\"</p>\n<p class=\"western\">            Aziraphale, as clever as he was, knew exactly what Crowley was trying to do, but fortunately for the both of them, he enjoyed being tempted. Especially when the temptation was to do something he already wanted to do. \"I'm not getting into the bath with you, Crowley,\" he said, as a matter of course. It wouldn't have been any fun for either of them if Crowley did not have to work for his acquiescence.</p>\n<p class=\"western\">            \"But you want to,\" Crowley pointed out. \"You haven't been back to Heaven since we canceled armageddon, and I know for a fact that there's nowhere else anywhere near that you could get a good bath. Your wings will thank you.\"</p>\n<p class=\"western\">            \"My wings can't talk,\" Aziraphale said dryly. \"And it would take <em>hours</em> to dry them.\"</p>\n<p class=\"western\">            \"Ohh, come on now. Didn't you just agree to stay?\" Crowley asked, a grin dancing about his lips that was not quite sure it wanted to be seen. He dragged his free wing through the water, a few loose feathers trailing in the eddies of its wake. \"I'll make you dinner.\"</p>\n<p class=\"western\">            Aziraphale relented in light of such a rare offer. He would have relented anyway, with no cards on the table at all, but Crowley had the strange habit of offering him things he wanted, in exchange for being allowed to give him other things he wanted, which was a much better magic trick than any of the ones Aziraphale knew. \"Well, when you put it that way, how could I refuse?\"</p>\n<p class=\"western\">            \"You can't,\" Crowley said. \"There's no helping it, really. You can put your stuff with mine, over there.\"</p>\n<p class=\"western\">            While Aziraphale was not sure he trusted <em>over there</em> to be any drier than anywhere else in the room, when he placed his neatly folded clothes beside Crowley's towel, he found it was, indeed, dry. He supposed it wouldn't matter, either way; the restrictions which prevented them from miracling their wings dry did not apply to towels or clothing. For that matter, he thought, they could make themselves new towels if they soaked these ones.</p>\n<p class=\"western\">            Crowley was waiting when he moved out from behind the screen, milky eyes tracking his movement slower than usual. Aziraphale tried not to think about what that must be like, how frustrating impaired vision would be for a demon who had always had to have every wit about him in order to deal with a legion of the damned ready to turn on him at any moment. All it would have taken, at any point in their long history, was for a single demon to find out about Aziraphale, and Crowley would have been as good as dead. He nearly had been because of it, more than once now.</p>\n<p class=\"western\">            Aziraphale found himself suddenly very glad indeed that Crowley had not answered the phone. He might have lied, and tried to stay here alone.</p>\n<p class=\"western\">            The water, just as Aziraphale had expected, was the right shade of warm, just enough to feel against his skin but not enough to irritate. He walked a few steps into the pool, and then a few more when Crowley motioned him closer, until he was nearly at the middle. Crowley stopped him, and Aziraphale sank down to his knees, the water rushing up around him. He crested his wings above the water almost unconsciously, slightly nervous about it. An angel with soaked wings could not fly. An angel that could not fly was <em>vulnerable</em>.</p>\n<p class=\"western\">            But the only threat here was Crowley, and that was no threat at all, so Aziraphale pulled his wings into the mortal phase and let them down into the water.</p>\n<p class=\"western\">            He nearly pulled them right back out again as the water flooded in, weighting all his barbs and dragging the shafts down with them in a way he had never experienced, even in rain. An unexpected panic rose in his throat, grabbing hold of all his senses at once.</p>\n<p class=\"western\">            He couldn't fly.</p>\n<p class=\"western\">            He had known that would be the case but he hadn't known how terrifying it would be in the moment.</p>\n<p class=\"western\">            He couldn't fly.</p>\n<p class=\"western\">            Which meant he couldn't get away if they were attacked. This was <em>not safe</em>.</p>\n<p class=\"western\">            What had he been thinking, <em>he couldn't fly</em>.</p>\n<p class=\"western\">            He had <em>never</em> not been able to fly if absolutely needed. His wings twitched as if he might try anyway, and then there was a motion at the side of his vision, and without a thought, his wing struck out, sloshing water. Even that was too slow, weighted down with water.</p>\n<p class=\"western\">            Something grabbed his patagium, holding too tightly onto his wing, and Aziraphale almost jerked it back toward himself to escape before Crowley's voice sliced through the panic. \"Aziraphale. Stop.\"</p>\n<p class=\"western\">            Aziraphale froze without question and took a breath, not having realized he'd stopped, his wing relaxing in Crowley's sure grip as he got hold of himself. He was panicking needlessly. He was fine. Maybe he couldn't fly, but he reminded himself that there wasn't anywhere to go and even if there had been, there was nowhere else he wanted to be. And, perhaps more importantly, there was nothing to go away <em>from</em>. Crowley wouldn't have stayed here to shed if he thought there was any chance at all their respective sides would come for him.</p>\n<p class=\"western\">            They were safe, here.</p>\n<p class=\"western\">            \"Sorry,\" he managed to mumble after another few seconds. \"How do you <em>stand</em> this? It's so...\" He didn't want to <em>say</em> vulnerable, even though it <em>was</em>.</p>\n<p class=\"western\">            Crowley smiled a little, patient with him in a way Aziraphale had come to love so dearly. \"Just... put your wings under a minute.\" He gently released Aziraphale's wing so that he could follow the direction, and when Aziraphale got his wings underwater completely, he was pleasantly surprised to find that it felt a lot like thick air. When he moved his wings, everything stirred like extremely sluggish air currents. Crowley must have noticed, because he said: \"That's how.\"</p>\n<p class=\"western\">            He backed away from Aziraphale, his own soggy wings slacking down into the water with a plop. Aziraphale shifted and flexed his wings, feeling the water move, and growing more fond of it with every passing second. It was not a Light bath, but it certainly was not as terrifying as the first couple of seconds had implied. It was not, he decided, something he would indulge in alone, though he understood why Crowley had been ready to.</p>\n<p class=\"western\">            \"Give them a flap,\" Crowley said as he reached the far side of the pool again and slumped down against it.</p>\n<p class=\"western\">            \"Pardon?\" Aziraphale said, though the words caught up with him a second later as he recalled what Crowley had been doing when he walked in, expecting to see Crowley under attack, fighting for his life. He had, instead, found Crowley flailing water all over, very much like a song bird in a bird bath.</p>\n<p class=\"western\">            Crowley did not bother dignifying the question with an answer, just waited until Aziraphale had considered it as carefully as Aziraphale considered anything, which was both a great deal and almost not at all. Aziraphale lifted his wings from the water by an inch and let them fall back down with an oddly satisfying smack. He looked to Crowley, who grinned broadly, and then he did it again a little harder, delighting in the waves it made, and the way the water swirled through his feathers now that they were more water than substance.</p>\n<p class=\"western\">            \"Go wild,\" Crowley suggested with a wave of his hands. \"You won't regret it.\"</p>\n<p class=\"western\">            Aziraphale hesitated. He had seen what Crowley did before and it.... it <em>had</em> looked like fun, and Aziraphale did so dearly love to have fun. So, he braced himself on the bottom of the pool, wiggled his wings a little in preparation, and then flipped and flapped and splashed them around, flinging water everywhere. The action brought him an indescribable amount of joy, and pulled from him a sound which he would never be able to repeat but that sounded an awful lot like '<em>hugrhburuble</em>!'</p>\n<p class=\"western\">            Crowley burst out laughing, but Aziraphale was too busy enjoying the sedative after-effect of the motion. He had touched something very Earthly, and it gave the same sort of light-headed giddiness he had to assume humans received from things like the satisfaction of the perfect end to a good story or the first taste of a favorite dessert or the stupor of waking from a good nap.</p>\n<p class=\"western\">            \"Me too, angel,\" Crowley told him, pleased. \"Did that too, the first time.\" He lounged back against the side of the pool, wings out to swirl lazily back and forth in the warm water, and a smile on his lips.</p>\n<p class=\"western\">            Aziraphale, even through his stupor, could not help but think that it suited him.</p>\n<p class=\"western\">            Happiness suited Crowley a great deal.</p>\n<p class=\"western\"> </p>\n<p class=\"western\"> </p>\n<p class=\"western\">            They stayed in the bath together for over an hour, enjoying the heat and steam and the mortal weight of all that water, until Aziraphale finally managed to gather his wits and climb out, producing a dry towel for each of them. He'd shaken his wings out as best he could, watching Crowley do the same in case he knew any good tricks, which he did not. He did, however, manage to look quite a bit less dignified than Aziraphale, and cared a great deal less about it.</p>\n<p class=\"western\">            Crowley fetched drinks while Aziraphale covered his very comfortable looking couch in more towels so their wings would not drip on anything important. Crowley set wineglasses on the small end table and folded himself gracefully onto the center of the couch. Aziraphale stood next to the arm of the couch, watching Crowley spread his wings out along the back, sprawling over the towels. He tipped his head back.</p>\n<p class=\"western\">            \"Comfortable?\" Aziraphale asked dryly. Almost every part of the couch contained a part of Crowley, leaving no viable space for sitting.</p>\n<p class=\"western\">            \"Bit chilly,\" Crowley said, a smile curling one corner of his mouth. He didn't lift his head at all.</p>\n<p class=\"western\">            Aziraphale rolled his eyes, but he could see the prickle on Crowley's rapidly-cooling skin and knew that while it was a joke, it was an honest one. With a little more flourish than strictly necessary, he took one step closer and then knelt on the floor beside the couch, sweeping his left wing up to cover Crowley's lap. He settled against the couch and tucked one arm under his head for a pillow, and looked up a little expectantly at Crowley.</p>\n<p class=\"western\">            Crowley gave him a deeply indulgent look, the one that Aziraphale liked best, and flicked a soft, dry cloth into existence in his hand. \"Spoiled, aren't we?\" he said, but he set his fingers to Aziraphale's feathers, smoothing the water out of them with gentle strokes.</p>\n<p class=\"western\">            Aziraphale closed his eyes. \"I'm an angel,\" he said. \"I don't get spoiled. I get-\"</p>\n<p class=\"western\">            \"Pampered?\" Crowley said, sliding his fingers down one of Aziraphale's secondaries to the tip, bending it up a little and letting it snap back down. \"Indulged? Doted upon, perhaps?\"</p>\n<p class=\"western\">            \"Loved,\" Aziraphale finished, eyes flicking up when Crowley's breath caught on the word. His hands had stopped moving, the now-damp cloth laying crumpled on top of Aziraphale's wing. He just stared at Aziraphale, not breathing or speaking or moving, until Aziraphale twitched his wing to jump-start him.</p>\n<p class=\"western\">            \"You are.\" The words hopped out of him as if they had no business having been contained in the first place. \"Loved. You know that, don't you?\"</p>\n<p class=\"western\">            Aziraphale studied him carefully, but the question was earnest in its simplicity. Crowley really was not sure if Aziraphale knew he was loved at all, much less how <em>much</em>. He wriggled his wing a little, enough that Crowley released him as if he'd been burned, clearly expecting the exact opposite of what was about to happen. He pressed himself back against the couch as Aziraphale moved, shifting to kneel directly in front of him, his hands resting gently on the outsides of Crowley's knees.</p>\n<p class=\"western\">            \"I do know,\" he said, not letting Crowley look away from him. \"I may not have realized how <em>I</em> felt until recently, but I have <em>always</em> known how <em>you</em> felt. I<em> can</em> sense love, you know, and you aren't exactly subtle. Sometimes it's hard to sense anything <em>else</em> when you're around. Sometimes it... it was the <em>only</em> thing in the universe of which I could be <em>certain</em>.\"</p>\n<p class=\"western\">            Crowley had the dramatic grace to look offended at the suggestion that he was not subtle, but opening and closing his mouth a few times did nothing to make it less true, and so he said: \"How long were you going to keep quiet?\"</p>\n<p class=\"western\">            \"Until the end of the world,\" Aziraphale joked gently, earning himself a smile from Crowley that his own lips echoed. \"But... that's supposed to have come and gone, hasn't it?\"</p>\n<p class=\"western\">            Crowley's expression dropped all pretenses, and he relaxed. \"Yeah,\" he agreed. \"Fresh starts and new beginnings and all that. Come on, then. Put your wing back up, you big sap.\"</p>\n<p class=\"western\">            Aziraphale let him drop the subject, shifting only slightly to his right to bring his wing back up, splaying it over Crowley's lap the way he had done the first time, only now he stayed all but wrapped around Crowley's shins. Crowley did not seem to mind at all. He laid a brief, gentle touch to Aziraphale's damp curls after Aziraphale put his head down, and then returned to tending all the beautiful feathers at his fingertips.</p>\n<p class=\"western\"> </p>\n<p class=\"western\"> </p>\n<p class=\"western\">            Three days later, Aziraphale looked up from one of the many books he had brought over to occupy his time, and realized that he hadn't seen or heard from Crowley at all in well over an hour. Normally this wouldn't have disturbed him, but Crowley had spent the better part of the last three days as close as he could get to Aziraphale's heat. This made it difficult to read without hindrance, but Aziraphale had volunteered to help however he could, and keeping Crowley warm seemed to be the means to that end.</p>\n<p class=\"western\">            Shedding, for a supernatural being such as Crowley, was apparently quite an exhausting endeavor and, as Crowley explained it, took more than just time and effort from him. His eyes had cleared a few hours after the bath, and Crowley had explained it would take a few days to actually be ready to shed. During that time, he couldn't use his magic, couldn't control his form; in fact he would lose his human form until after he had shed, unable to maintain it through the process. It also meant that he could not regulate his temperature the way he usually did, causing him to require an external heat source.</p>\n<p class=\"western\">            Aziraphale had, in the spirit of being helpful, offered to get him some sort of heating pad, but Crowley had just leaned harder against his side, told him <em>angels are warmer,</em> and asked for Aziraphale to read to him from the text he was studying. He had been asleep in minutes.</p>\n<p class=\"western\">            Now, however, he was nowhere to be seen, and Aziraphale realized that he could not hear him doing anything in the flat. He had left Aziraphale's side a few times to get water, but said that all he really wanted was heat and steam and safety. He also, apparently, felt it necessary to restlessly roam around as the living embodiment of <em>crawling out of his skin</em> until such time as he was almost too cold to function, which had bothered Aziraphale much more the first day than it did the third. He had learned that Crowley would come back to him when he needed, when he was ready, and that was good enough for Aziraphale.</p>\n<p class=\"western\">            Aziraphale placed his bookmark into his text and folded it closed, setting it on the seat cushion as he got to his feet. He extended his awareness and heard the faint sound of something scraping around in the bathroom. Crowley must have snuck back in for another steam bath.</p>\n<p class=\"western\">            A low, heavy hiss echoed across Aziraphale's senses, much the same way solar winds glanced off the Earth's atmosphere and left auroras in their wake.</p>\n<p class=\"western\">            Which meant that Crowley had become an aspect, a facet of his true form on the mortal plane, and anything could happen now.</p>\n<p class=\"western\">            Aziraphale walked calmly to the bathing room and nudged open the door with one knuckle, not wanting to intrude if he was unwanted. In the dry bath, he could see Crowley's sinuous black body writhe back and forth along one wall of the pool, his snout to the rougher tile stripe that lined the top edge of it. He looked as though he were trying to wipe something off of his face, but Aziraphale could see nothing of the sort.</p>\n<p class=\"western\">            \"Crowley,\" he said softly, and got a frighteningly low noise in reply as Crowley fell still. Aziraphale found himself desperately hoping Crowley would still recognize him in this state. In six thousand years, he, himself, had never taken on an aspect in the mortal coil. He had always been able to retreat safely to Heaven. \"Are you okay?\"</p>\n<p class=\"western\">            \"Sssuperb,\" Crowley hissed, turning to look at him. Aziraphale could see little sharp angles around his lips, where the skin had started to peel from being rubbed on the rougher tiles. He sounded crankier than when the apocalypse had been constantly imminent and resting upon their shoulders. \"Jussst fucking amazing. What are you doing?\"</p>\n<p class=\"western\">            Aziraphale took a seat at the edge of the pool, letting his feet hang over the edge and resting his hands to either side of his hips. \"Come here,\" he said, gently. \"I said I would help. You could have asked.\"</p>\n<p class=\"western\">            Crowley remained where he was, itchy scales twitching a little. Aziraphale just waited, until finally Crowley put his head down and reluctantly slithered over. Aziraphale's eyes traced over Crowley's serpent form as he went, watching the muscles play and wondering how different it must feel to move like that. He had never been a snake, himself; none of his aspects were reptiles at all. He held out a hand when Crowley got close enough, and Crowley reared up to place his considerable jaw into Aziraphale's palm.</p>\n<p class=\"western\">            \"What are you going to do?\" Crowley asked.</p>\n<p class=\"western\">            \"Help,\" Aziraphale repeated. He used his free hand to touch the curve of Crowley's lip, and Crowley opened his jaws a little. That long, forked tongue flicked out, tickling at Aziraphale's wrist as he used one perfectly manicured nail to pick at the loosening skin at the tip of Crowley's nose. It came easily, with a sound not unlike taking plastic wrap off a roll.</p>\n<p class=\"western\">            Crowley jerked a little in his hand when his shed began to separate, and for a second Aziraphale thought it might hurt to go too fast, but then Crowley said: \"Tinglesss. Keep going.\"</p>\n<p class=\"western\">            So, he did.</p>\n<p class=\"western\">            Gently, he coaxed the soft shed away from Crowley's scales, pulling it free from his lips and his nose, infinitely careful with his eye caps. The skin was silky and strangely soft, but the sort of soft usually reserved for brand new tree leaves that had begun to wilt. He wondered what Crowley would do with it, after. It couldn't be left here, where humans might find it somehow.</p>\n<p class=\"western\">            It did not take long until Crowley's head was free and he moved to crawl across Aziraphale's lap, inch by inch as Aziraphale worked. As he went, his gleaming, shiny body began to coil around Aziraphale's feet like a spool of rope, never getting too far.</p>\n<p class=\"western\">            \"Thisss was the hardessst part,\" Crowley admitted, well past the halfway point.</p>\n<p class=\"western\">            \"Of shedding?\" Aziraphale asked absently. He had become positively enchanted with watching each scale pop free of the shed skin, the same way humans could get lost in popping individual bubble wrap pods. He glanced down to find Crowley watching him from where his head rested upon his many coils.</p>\n<p class=\"western\">            \"Of Falling,\" Crowley said. \"Being alone for thisss. Not... having anyone to trussst.\"</p>\n<p class=\"western\">            Aziraphale's heart wrenched a bit in his chest. \"I would have watched over you, before. I could never have hurt you, Crowley.\"</p>\n<p class=\"western\">            \"Different world,\" Crowley said, and Aziraphale found it strange how much that felt like absolution and that somehow, absolution didn't feel so strange coming from this particular demon. \"You're here now. That'ss what countss.\"</p>\n<p class=\"western\">            \"I suppose I am.\" Aziraphale managed a small, uncertain smile, not sure being here was <em>enough</em>, but this was what they had, and he intended not to miss another moment of it. He tugged gently on the shed skin in his hands, and Crowley began to move again. \"Thank you, then. For trusting me.\"</p>\n<p class=\"western\">            Crowley's tongue flicked out again, long and slow. \"Glad I did.\"</p>\n<p class=\"western\"> </p>\n<p class=\"western\"> </p>\n<p class=\"western\">            That night, Crowley slept.</p>\n<p class=\"western\">            This was not unusual for him, as he had slept a great deal more than any angels and even a great deal more than most demons, who enjoyed indulging in sloth when the opportunity presented itself. He enjoyed sleeping, despite that angels and demons could not dream the way that humans did. It gave him peace, or at least a sense of rest, and time away from his mind.</p>\n<p class=\"western\">            What <em>was</em> unusual was that his bed, for the first time, was warm with the heat of another body. More specifically, the heat of <em>Aziraphale's </em>body.</p>\n<p class=\"western\">            Crowley would be able to take a human form again after a good regenerative stupor, but until then, Aziraphale had argued, he should be kept warm. So he had placed his coat over one of the bedposts, drawn back the covers, and climbed into Crowley's bed as though he belonged there. Crowley, for his part, had slithered in after him, looping his coils back and forth over Aziraphale's legs and hips and belly like a heavy, scaly blanket, soaking in all the warmth a creature so familiar with Heaven's light could provide.</p>\n<p class=\"western\">            Gently, gently, he placed his jaw on Aziraphale's sternum, and felt Aziraphale's fingertips brush over the crest of his head as he settled.</p>\n<p class=\"western\">            This close, Crowley could feel the beat of Aziraphale's heart under his belly scutes, and it beat just a little too fast.</p>\n<p class=\"western\">            \"I don't believe I've ever slept before,\" Aziraphale whispered quietly. He had folded his wings off the mortal plane, and Crowley couldn't see them where they must have passed through the bed.</p>\n<p class=\"western\">            Crowley's tongue flicked out. The air carried the sour tang of anxiety. \"You'll be alright,\" he said muzzily. \"We both will.\"</p>\n<p class=\"western\">            Aziraphale's fingers stroked absently over the small scales of his neck. \"Crowley?\"</p>\n<p class=\"western\">            Instead of answering, Crowley made a small sound of question, already half asleep, wrapped in Aziraphale's warmth.</p>\n<p class=\"western\">            \"You're loved too,\" Aziraphale said, echoing Crowley's earlier confession. \"You know that, don't you?\"</p>\n<p class=\"western\">            Crowley let out a soft hiss, reminiscent of the sound made by barely opening a soda bottle, if that soda bottle were feeling simultaneously amused and warm with affection. \"I know,\" he assured Aziraphale.</p>\n<p class=\"western\">            And the funny part, he thought as he drifted off, warm and happy and safe, was that he did.</p>\n<p class=\"western\"> </p>\n<p class=\"western\"> </p>"
}