{
  "id": "1938096",
  "url": "https://archiveofourown.org/works/1938096?view_full_work=true",
  "author": [
    "ncfan"
  ],
  "title": "When the Truth Gets Out",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "Avatar: The Last Airbender"
  ],
  "relationships": [
    "Friendship - Relationship"
  ],
  "characters": [
    "Zuko (Avatar)",
    "Suki (Avatar)",
    "Aang (Avatar)",
    "Katara (Avatar)",
    "Sokka (Avatar)",
    "Toph Bei Fong",
    "The Gaang",
    "Ozai (Avatar)",
    "Azula (Avatar)",
    "Iroh (Avatar)",
    "Hakoda (Avatar)",
    "Ty Lee (Avatar)"
  ],
  "additional_tags": [
    "Friendship",
    "Male-Female Friendship",
    "Male Friendship",
    "POV Male Character",
    "Implied/Referenced Child Abuse"
  ],
  "language": "English",
  "series": "",
  "published": "2014-07-11",
  "completed": null,
  "words": "5,194",
  "chapters": "1/1",
  "comments": "163",
  "kudos": "14,262",
  "bookmarks": "1,949",
  "hits": "117,812",
  "summary": "<p>Zuko never confided the story of how he got his scar to the Gaang, but once the war was over and they took up temporary residence in his palace, the story was inevitably going to get out. [Kind of a companion to 'Skin Deep.']</p>",
  "notes": "",
  "text": "<p>Zuko had never confided the story of how he got the scar on his face to any of his newfound friends. He might have been able to trust them the way he had trusted few others in his life, but for Zuko to speak of this would have required more than just trust forged in new friendships and battles fought together. It was hard enough to <em>remember</em>, even in the confines of his own mind; confiding the story in others would have required more from him than he was willing to give. Zuko wasn't the sort of person willing to make himself vulnerable in such a way without good reason.</p>\n<p>Zuko might have never confided the story in his friends, but once they were all living in the Fire Nation royal palace in the aftermath of the war, the story was inevitably going to get out.</p>\n<p align=\"center\">-0-0-0-</p>\n<p>It was probably a testament to how much his lightning injury had thrown him off his game that Zuko didn't hear Suki coming, that he only heard her when she knocked against the doorway of his room. When he raised an eyebrow at her, she shrugged slightly and said, \"I may be a master of stealth, but sneaking up on your friends is rude.\"</p>\n<p>He should have heard her coming. Suki had probably had silent steps drilled into her since she was a child, but Zuko still should have heard her coming. Zuko turned his face so she couldn't see his embarrassment.</p>\n<p>\"What's up?\" he asked. Among the exhausting list of things the prospective Fire Lord had been doing lately, Zuko and Suki had been coordinating the release of her Kyoshi Warriors. The warriors were being held in various prisons scattered across the Fire Nation, probably to keep them from being able to coordinate their efforts enough to attempt an escape. Or maybe the higher-ups were just trying to break the girls' spirits. Knowing what he did of the higher echelons of the Fire Nation government, Zuko wouldn't put it past them. <em>Just another thing I'm going to have to change if the Fire Nation ever hopes to regain its honor.</em></p>\n<p>Suki shrugged. \"A couple more of the Kyoshi Warriors made it here about an hour ago.\" Her eyes narrowed slightly. \"I thought you should know; Ty Lee was with them.\"</p>\n<p>Zuko perked up a bit at that. \"Ty Lee? Is she alright? Is Mai with her?\" His fears of what had happened to Mai and Ty Lee had gnawed at him since leaving the Boiling Rock; he'd been kicking himself for not going back for them for about as long. They might have been Azula's \"friends\", but everyone knew what Azula did to people who failed or betrayed her. Zuko had doubted that any bonds of \"friendship\" that existed between Azula and the two girls would be enough to save them, if Azula decided that they were no longer worth anything to her. <em>I should have gone back for them.</em></p>\n<p>Suki shrugged again, this time with the air of an apology. \"I didn't see Mai, but when we fought, she seemed pretty tough. If your sister didn't kill Ty Lee, she probably didn't kill Mai either.\" The young warrior smiled faintly, encouragement lingering around her lips. \"In that case, she's probably fine.\"</p>\n<p>Standing in the half-gloom (it was nearing sundown and the shades had been drawn), Zuko nodded stiffly. \"Probably bored half to death,\" he muttered. Mai had always bored so easily, and in prison she wouldn't have any of her knives to practice with. She wouldn't have much of anything.</p>\n<p>At his comment, Suki looked puzzled, maybe even a little offended on Mai's behalf. Zuko found that odd; why would she feel offended on the behalf of a girl who was partially responsible for her own imprisonment? But at any rate, Suki went on, \"Ty Lee has also asked me if she can join the Kyoshi Warriors.\"</p>\n<p>Was that a joke? Zuko stared at her, amazed. \"Really? But… Ty Lee <em>hates</em> looking the same as other people!\" Or, at any rate, she hated being considered part of a \"matching set.\" That was what she was going to become if she joined the Kyoshi Warriors. Ty Lee might have been irritatingly bubbly sometimes, but Zuko knew she wasn't stupid. She <em>had</em> to see what she would be walking into if she joined the Kyoshi Warriors, so why…</p>\n<p>She didn't seem to understand it any better than Zuko did. \"I know it sounds weird; I didn't expect it, either. She really doesn't seem disciplined enough for the Kyoshi Warriors.\"</p>\n<p><em>Undisciplined? You don't know Ty Lee</em>, Zuko thought, barely able to resist snorting. He'd once seen Ty Lee hold an excruciating-looking contortion, standing on one hand with her leg and her other hand looped together, for nearly ten minutes. When she was little she liked to practice walking on her hands—she probably still did, come to think of it. Zuko might not have had much use for acrobatics himself, but all he had to do was take one look at Ty Lee and know that beneath that blindingly pink exterior there was more discipline than was found in most soldiers.</p>\n<p>\"But she promised to teach us her chi-blocking, so I let her join.\" Suki rubbed the back of her neck. \"I don't think I've ever been hugged so hard in my life,\" she mumbled.</p>\n<p>\"Really?\"</p>\n<p>The look that came into Suki's purplish eyes was sharp, a little ambivalent, but most surprising of all, actually a little hopeful as well. \"Well, you're the one who keeps talking about this 'era of peace' the world needs to enter into—you and Aang, anyways.\" She grimaced, eyes flickering towards the window before meeting Zuko's gaze once more. \"Zuko, I'd be lying to you if I said I thought it was going to be easy for the world to forgive the Fire Nation,\" she said seriously. \"It's going to be hard. <em>Really</em> hard.\"</p>\n<p>\"Yeah.\" Zuko nodded, and thought of Suki's village. He'd remembered, since that day in the Boiling Rock. He knew that one 'sorry' wasn't enough to make up for lost homes and lives and livelihoods. Monetary restitution, by itself, wasn't going to be enough either. He'd seen how much the world hated the Fire Nation. Their first instinct upon seeing the Fire Nation weak and in disarray as it was might well be to try to rip it apart. \"I know.\"</p>\n<p>If Suki noticed Zuko's sudden graveness, she chose to ignore it—likely a habit acquired as the commander of a band of warriors. He was grateful for it, now. \"But I figure that if you're going to be reaching out to the world, it might set a good precedent if the world can see someone reaching out to you.\" Then, she lifted a hand to her forehead, seemingly to rub away a headache. \"But this really <em>isn't</em> going to last very long, is it?\" Clearly someone had already been exposed to Ty Lee's particular brand of enthusiasm.</p>\n<p>Zuko shook his head. \"No, it's not. Ty Lee <em>really</em> hates being part of a matching set.\"</p>\n<p>The look that came over Suki's face was one Zuko was learning to recognize, that of the leader thinking of how to turn potential disadvantages to her own advantage. \"I didn't think so,\" she muttered. \"She really does seem too flighty. Oh well,\" Suki sighed. \"If anyone asks I'll say she was part of an exchange program or something.\"</p>\n<p>Actually, the idea of exchange programs wasn't a bad one at all. Once relations between the Fire Nation and, well, the rest of the world began to improve, it would be good to send the citizens of his land—those who were willing, of course, and Zuko suspected he would have to look among the young first—out into the world so that they could learn of it, as he had.</p>\n<p>Zuko did not discount the fact that he had not taken the lessons he learned out in the world to heart until after he had been accepted back into the fold of the Fire Nation. It had taken him so long to learn these lessons, and unlearn the ones he had been raised with. Did he need to start looking at the schools, too? Fire Nation education spoke little of the outside world, except to mock it and speak of its inferiority as justification for their own conquest. Children grew up ignorant, and stayed ignorant into adulthood. It was time to rectify that.</p>\n<p>\"Zuko? …There's something else, too.\"</p>\n<p>She sounded hesitant. That was odd, considering it was Suki. None of Zuko's newfound friends were particularly hesitant when it came to conversation, and Suki was true to form on that score. She never hesitated to speak her mind (Or if she did, Zuko just didn't notice). She had been a commander, maybe not of a formal military force, but a commander nonetheless. She knew how to speak with authority, knew how to lay down the law, and knew that coming across as hesitant (except under very special circumstances) wasn't going to do her a whole lot of favors.</p>\n<p>If she was hesitant, it was probably something serious. Had some of her warriors been killed in their prison? But surely Suki wouldn't hesitate to bring this up to him, wouldn't feel like she had to ask tentatively for investigations or justice. Something else, then. \"What is it?\" he asked curiously.</p>\n<p>Suki crossed her arms around her chest, met his gaze squarely, and said, \"We've been hearing stories around the palace and the city.\" 'We' meaning her, Aang, Sokka, Toph and Katara. \"And Ty Lee gave us more details—I think she wanted us to get the <em>real</em> story instead of some bungled gossip. We know how you got that scar, Zuko.\"</p>\n<p>\"…Oh.\"</p>\n<p>Zuko felt his stomach drop.</p>\n<p>He should have expected it, really. He should have been preparing for it. In retrospect, he should have sucked it up and told them himself before it got to this point, as difficult as it would have been. At least it wouldn't have looked like he didn't trust them; Katara would probably get onto him for that later. And yet…</p>\n<p>\"You know…\" Suki spoke in cool, businesslike tones. She had gone to stand by one of the windows and was tracing her fingers against the wooden lattice of the blinds. \"The most dangerous warriors I ever met were the older ones with scars like yours. Do you want to know why? Because they'd survived the injuries that had given them those scars, and they continued to survive battle despite injuries that had robbed them of use of an arm, or an eye, or had given them a permanent limp, or something like that. It seemed like nothing could kill them.\" But Suki and Zuko both knew what had eventually happened to those warriors, in the end: the same thing that happened to every warrior, eventually, if the war they fought in didn't stop.</p>\n<p>Zuko stared long and hard at her. \"…And how many warriors like that did you know?\"</p>\n<p>Suki smiled, a cool, hard smile. \"Not many.\"</p>\n<p>There was, after all, a reason that the Kyoshi Warriors seemed to be made up entirely of teenaged girls, why their leader was a teenaged girl. There had to be a <em>reason</em> why the oldest members seemed to be around twenty or so, after all. Even if they had rarely left their island until recently. Zuko wondered what it said about Suki, that she'd joined with them when she had known what these reasons where, when she had known what her life expectancy would likely be.</p>\n<p>But Suki had put him in the category of the most dangerous warriors she knew. High praise, from her.</p>\n<p align=\"center\">-0-0-0-</p>\n<p>Zuko's day started early. This was both a peculiarity of the Fire Nation—firebenders rose with the sun, were early risers, rarely slept in—and a necessity of being the incipient Fire Lord, only weeks away from his coronation. There was a lot to do, grievances to address, wrongs to redress, political prisoners and prisoners of war to be tracked down and freed, and a host of other things besides. Uncle Iroh warned him through letters that by no means was Zuko to start rooting out corrupt ministers until <em>after</em> he had been formally installed as Fire Lord and his position was more secure; de facto leader of the Fire Nation was not the same thing as official leader of the Fire Nation. Upon reading Iroh's more detailed explanation, Zuko could see the wisdom in this, but he had gone ahead and started doing research into his ministers' backgrounds and decisions. After a while of that, Zuko gloomily wondered if he shouldn't be trying to root out ministers who <em>weren't</em> corrupt instead.</p>\n<p>However, for the first hour after the sunrise, before breakfast, Zuko set aside that time to do something he considered just as important, if not more so, then piecing his beloved, broken nation back together again. That hour he spent continuing Aang's firebending training.</p>\n<p>Uncle Iroh had also stressed the importance of not being seen to order Aang around in public. Zuko could see the wisdom in that too, however reluctantly. It would really <em>not </em>be good if the increasing multitude of foreigners staying in the Fire Nation royal capital saw the child Avatar being bossed around. For those who understood that the two of them were friends and that Zuko was Aang's firebending instructor, it wouldn't be too shocking, but there were many strangers here, and many of them unwilling to trust readily. Zuko found himself thinking that he was thinking a lot about how to do things that would make people trust him more, these days.</p>\n<p>And once again, however: If anyone thought that he was going to neglect Aang's firebending training, they had another thing coming.</p>\n<p>If Zuko was honest with himself, he would admit that he enjoyed firebending training with Aang better than he did pretty much the entirety of the rest of his day. He'd long gotten over the occasional dull prick of envy he'd experienced when he first realized that Aang was advancing much more quickly than he had when he first began firebending training. Aang was the Avatar. Of course he was going to be a prodigy, and it was a good thing he was a quick study, if he was going to be fighting Fire Lord Ozai. Not that Aang's flippancy couldn't be annoying from time to time, but really, he'd gotten a lot better.</p>\n<p>For the most part.</p>\n<p>This morning, Aang was all jokes and too-big smiles, even through hotsquats and breath exercises. He didn't fuss when Zuko insisted that they review the most basic moves they'd learned from the dragons, did not complain or good-naturedly gripe about any of what they were doing as he sometimes did when he thought that Zuko needed to lighten up and stop taking everything so seriously. Aang wasn't even calling Zuko 'Sifu Hotman.'</p>\n<p>Obviously, he was bothered by something.</p>\n<p>Unfortunately (or perhaps fortunately; Zuko wasn't sure which), Zuko had a pretty good idea of what Aang was bothered about.</p>\n<p>The Air Nomads gave their children to be raised communally in temples. Zuko had learned this in school, where the information had been twisted to be used as one of Fire Lord Sozin's \"justifications\" for wiping out the Air Nomads. They were apparently so barbaric that they didn't even care enough about their children to raise them themselves; how immoral their children must have become, without a parent's guiding hand! Aang had told Zuko that many of the Nomads who chose not to become monks reestablished ties with their families upon completing their airbending training, though he had also remarked, perhaps a little wistfully, that he'd never found out who his parents were. Maybe it was because the monks had known he was the Avatar since he was a small boy, Zuko supposed, that they had kept him away from knowledge of his family. From what Aang had said of the Air Nomads' philosophy, they probably didn't want their Avatar to have too many earthly ties.</p>\n<p>Zuko wondered, sometimes, what Aang thought about the concept of \"families.\" Oh, he knew that Aang had considered the monks his family, and that he considered his friends his family now (And if Zuko was still getting used to the idea that he was counted among \"family\", that was his own business). Zuko knew that Aang's definition of \"family\" was flexible enough that he would never be totally without one, and Zuko was glad of that. But what did Aang think of the traditional definition of family, of parents with children? What did he think about parents?</p>\n<p>What did he think about fathers who mutilated their sons?</p>\n<p>As Aang's teacher, Zuko knew he should address this. Firebending was as much about mindset as it was about stance and breath control; if Aang was bothered and Zuko could do something about it, he ought to. In his mind, Zuko supposed he was trying to think of what his uncle would have done, besides spouting proverbs and telling Aang that he needed to relax more. Provide comfort and reassurance.</p>\n<p>Aang's nervous energy culminated in the question of \"Hey, Zuko, between your face and chest and <em>my</em> back and foot, do you think we could start the \"Guys with firebending scars\" club?\" Which was a spectacularly <em>stupid</em> question, and Zuko didn't even have to think about it for a second to see how stupid it was.</p>\n<p>\"Hotsquats. Now.\"</p>\n<p>\"It was just a joke!\"</p>\n<p>\"I don't see hotsquats.\"</p>\n<p>At least something could still be normal.</p>\n<p align=\"center\">-0-0-0-</p>\n<p>Katara was staring at him.</p>\n<p>She was trying to be subtle about it, but Katara wasn't good at being subtle. There were subtleties to waterbending, of course; it was firebending's equal and opposite, and Zuko knew that there must have been some equivalent of the subtleties of firebending, and knew that Katara, waterbending master that she was, must have been master of these subtleties as well. But when it came to people, Katara was about as subtle as a komodo rhino knocking down your front door. She just hadn't figured out how to have the conversation with him, yet.</p>\n<p>Like Zuko, Katara had been very busy over the past few days and weeks. She had set herself to helping the physicians and apothecaries and surgeons and the few Water Tribe healers who had made their way this far south with the wounded. Fire Nation wounded were having to be set up in different houses and hospitals than those from the Earth Kingdom and the Water Tribe; there had already been an incident of assault, and Zuko wasn't the sort of fool who wouldn't know what the solution was.</p>\n<p>And if Zuko knew anything else about Katara, he knew that she liked to be useful, to be needed. Honestly, Zuko didn't really know anyone who liked to feel use<em>less</em>, though he did know some who didn't care if they were able to be useful in any way, shape or form. So he let her have free rein here, let those tending to the wounded know that Katara came highly recommended and that she could be a great help to them, if they let her. Katara would probably go stir-crazy if she had to sit around the palace with nothing to do for weeks on end, anyways.</p>\n<p>As soon-to-be Fire Lord, Zuko made tours of the houses and hospitals where the wounded were being kept as often as he could. It was the least he could do, and, frankly, he was worried about them. <em>All </em>of them, not just his own people. Everything every wounded civilian and soldier had in common was that they were this way because of the Fire Nation. But that didn't make it easy to face down the hate and distrust intertwined with fear in the eyes of the vulnerable Earth Kingdom and Water Tribesmen. It didn't make it easy to face the distrust and sullen suspicion in the eyes of the Fire Nation soldiers, many of whom thought his ascension was suspect and worried about what would become of them in this 'era of peace and kindness' that their new master prescribed. Their fears were rational, but it didn't make it easy.</p>\n<p>But then, Zuko had never been one to give up just because things were difficult for him.</p>\n<p>Today, Zuko had happened to walk into one of the empty houses set aside for wounded soldiers, the one where Katara happened to be working. She didn't pull her hair away from her face the way Fire Nation healers did. Zuko supposed it must not have been necessary, considering that she used waterbending to heal her patients instead of scalpels and needles and thread and other things that would require a surgeon to keep their hair well away from their eyes. It also struck him that, alone out of all the Water Tribe healers, Katara would heal soldiers from the Fire Nation.</p>\n<p>\"Now, I know that hasn't gotten rid of all of the pain or stiffness, but with proper rest you'll be feeling a lot of the pain go away,\" Katara told the man whose leg she'd just finished working on, a young soldier whose face was pale and drawn with residual pain. She was wearing a reassuring smile not unlike the smiles of the Water Tribe healers Zuko had watched work on Earth Kingdom soldiers or fellow tribesmen. It didn't quite look like it fit her. \"But if you want, I can come back tomorrow and run another session. I think I should be able to finish healing the ligament then.\"</p>\n<p>The young soldier nodded, smiling gratefully. \"Thank you, Miss. My leg really does feel a lot better.\"</p>\n<p>Katara smiled (more genuinely this time), nodded, and started to move on to the next soldier. She caught Zuko's eye as he milled into the house, and as Zuko began to converse with the soldiers (those who seemed comfortable speaking with him), her gaze never really seemed to leave him.</p>\n<p>Zuko would be lying if he said he didn't still find it a bit disconcerting when Katara stared at him. When he had first joined Aang's group, she had stared at him because she was waiting for him to give her the slightest excuse to <em>kill</em> him; of course he got a little jumpy when Katara stared at him. She had said she forgave him after they got back from tracking down the man who killed her mother, but there hadn't really been <em>ease</em> between them until after Zuko's ill-starred Agni Kai with Azula.</p>\n<p>It hadn't been so long ago that Katara would coldly watch his every move, probably cataloging weaknesses and working out which angle would be best to strike from if she decided that he needed to die. Between those cold, considering stares and the sharp, double-edged barbs she threw at him at every opportunity, Zuko had never seen so much of Azula in someone as he'd seen in Katara. It was over, and he knew that Katara, protective of her own, would never treat him that way again so long as he didn't give her a very good reason, but he couldn't forget it, not entirely.</p>\n<p>(And maybe, because Katara's behavior outwardly resembled Azula's, he'd read his sister's malice into Katara where it didn't really exist. Zuko was willing to consider that. But he had lived with Azula's malice for so long that when he saw even the slightest hint of it in another, he could not let his guard down. It wasn't a matter of 'wouldn't'; he <em>couldn't</em> let his guard down around someone who acted like Azula.)</p>\n<p>\"I guess now I know why you didn't say anything.\"</p>\n<p>Katara wasn't looking at him. She was pressing the back of her hand against the cheeks and forehead of a young woman struck down with fever; Katara peeled back the dressings of a wound on her arm and flinched. She wasn't looking at him, and her long, loose hair obscured her face from view, but then, Katara lifted her head and gazed upon Zuko instead. Her face was slightly haggard, the result of many long days and short nights, and the look in her eyes was that heavy one that didn't know whether it wanted to be angry or sad.</p>\n<p>Zuko tilted his head so that the right side of his face was facing her—the better to watch her expressions closely and listen better. \"What do you mean?\"</p>\n<p>\"When you first told us that the Fire Lord was planning to burn down the Earth Kingdom, I was horrified,\" Katara admitted, though as far as admissions went, it wasn't much of one; anyone who hadn't been fed Fire Nation propaganda their whole lives would have been. She lowered her voice as she went on, \"But the more I thought about it, it seemed pretty strange to me that you never said anything about it. The way you act, I thought you would have tried to stop him.\" She stared at him frankly. \"I guess I know why you didn't, now.\"</p>\n<p>There was nothing resembling an accusation in the words she spoke, like there might have been one or two months ago. There might have been pity, but it was masked well enough that Zuko didn't have to face it. What there was in Katara's face, in her voice, in her eyes, was a look of understanding.</p>\n<p>\"Yeah.\" Zuko wished his voice wasn't as choked as it was.</p>\n<p>Katara shifted her weight a little, perhaps a touch uncomfortably. \"Come help me with her,\" she said briskly, gesturing to the woman she was just examining. \"Infections as bad as hers are a bit beyond what I was trained in, and since she's one of yours I think it's probably better to find a Fire Nation surgeon, so we can figure out what to do about her arm.\"</p>\n<p>Zuko chanced a glimpse beyond the woman's dressings, and just as Katara had done, he flinched. \"Yeah, I think we should too.\"</p>\n<p>Over the next few days, whenever Zuko visited the places where the wounded and the afflicted were being seen to, Katara just happened to be in the same house at the same time as him. She was not directing the look at him that she had used to, the <em>'Make one move out of line and I'll kill you' </em>look. Instead, the look she was (a bit more subtly) directing at everyone else was '<em>Touch him and die.</em>' So that was what it was like to be one of the people Katara considered part of her \"family.\"</p>\n<p align=\"center\">-0-0-0-</p>\n<p>Sokka was staring at him too.</p>\n<p>In the evenings, after supper, if he didn't have appointments, Zuko would go down to the garden on the palace grounds that had been his mother's favorite, and feed the turtle ducks that lived in the pond found there. He hadn't been the only one who had the idea this evening, and didn't know whether to be relieved or saddened when the two kitchen servants hastily bowed and took flight at his arrival. Somehow, he doubted that his father or Azula had ever stopped to feed the turtle ducks, but the servants seemed to know that it wasn't good to be caught at ease around the royal family anyways.</p>\n<p>It was nice to be able to feed the turtle ducks again (and maybe Zuko should introduce Aang to doing this; he bet the kid would like it), but it really didn't feel the same without Mom sitting beside him. Between that and the mixture of relief and unhappiness Zuko had felt when the two servants had fled the pond's banks, Zuko said not a word in protest when Sokka flopped down on the grass beside him.</p>\n<p>\"So…\" the younger boy said, staring at him with wide eyes.</p>\n<p>\"So?\" Zuko said right back, raising an eyebrow at Sokka. He didn't remember Sokka being so easily lost for words.</p>\n<p>Sokka was staring at him. Zuko realized that, specifically, he was staring at the left side of Zuko's face, at the scar that crawled up and down his skin. It wasn't the gawking, slightly revolted stare he had been confronted with many times in the past, though he stiffened nonetheless.</p>\n<p>Sokka's expression was remarkably transparent: <em>My dad would never do something like that to me.</em></p>\n<p>Zuko knew Sokka and Katara's dad would never do anything like burn their faces if they spoke out of turn in a meeting. He was glad about that, too; he <em>liked </em>Hakoda. In the short time he had watched the man interact with his children at the Western Air Temple, he had wondered: Is <em>that</em> what a father was supposed to be like? The closest Zuko had ever known to that was, well, his uncle. Come to think of it, Hakoda had sort of behaved the way he had towards Sokka and Katara to all of the other children present at the Air Temple. Even Zuko, and even when Katara was still treating him like someone she barely tolerated, rather than liked. He made Zuko feel… He wasn't sure what Hakoda had made him feel.</p>\n<p>Maybe he'd sort of looked up to Sokka and Katara's father, in the time that he'd known him.</p>\n<p>\"So…\" Zuko looked over at Sokka, who had this sort of 'I feel sorry for you but can't figure out how to express it in a properly manly way' look on his face \"…Me and Dad and Bato and the other men—\" by which Zuko supposed Sokka meant the men of the Southern Water Tribe, those who had made their way to the capital \"—are gonna go fishing. You wanna go? Unless, you know,\" Sokka said with a grin, \"you're pig-chicken.\"</p>\n<p>Zuko smirked. \"Oh, I'm up for it.\"</p>\n<p>They spent the next two hours around the Great Gates of Azulon. Sokka gleefully lobbed wads of seaweed at the stone head of Zuko's grandfather while Zuko found that he absolutely did not care. Hakoda was trying to teach him the finer points of tying the knots on a fishing net, with little success. The one with the scarred arm, who was apparently Bato, looked on at the proceedings with wry amusement. It was probably the best evening Zuko had had in weeks.</p>\n<p align=\"center\">-0-0-0-</p>\n<p>Toph caught him as he was heading back to his room. \"I believe you owe me money,\" she remarked smugly, holding her arms behind her back as she did when she was training Aang or wasn't bending and wanted to look particularly impressive.</p>\n<p>\"When did I bet money on anything with you?\" Zuko asked, bemused.</p>\n<p>Toph grinned triumphantly. \"Because I bet you got that scar doing something you could be proud of, and I was <em>right</em>.\" She stuck out her hand. \"Now pay up!\"</p>\n<p>Zuko came so close to laughing that he actually did dig a few gold coins out of his pocket to give to her. The feeling of coming close to laughing was worth losing money over.</p>"
}