{
  "id": "20383669",
  "url": "https://archiveofourown.org/works/20383669?view_full_work=true",
  "author": [
    "TunaFishChris"
  ],
  "title": "The Family You Choose",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "Avatar: The Last Airbender"
  ],
  "relationships": [
    "The Gaang & Zuko (Avatar)"
  ],
  "characters": [
    "Zuko (Avatar)",
    "Aang (Avatar)",
    "Katara (Avatar)",
    "Sokka (Avatar)",
    "Toph Beifong",
    "Suki (Avatar)",
    "Ozai (Avatar)"
  ],
  "additional_tags": [
    "Hurt/Comfort",
    "Emotional Hurt/Comfort",
    "Angst",
    "obligatory \"gaang finds out about Zuko's scar\" fic",
    "love those fics",
    "Soulmates",
    "Soulmarks",
    "Platonic Soulmates",
    "kind of confusing though",
    "Like",
    "There's time travel",
    "it's a thing",
    "ozai's shitty parenting",
    "Swearing"
  ],
  "language": "English",
  "series": "",
  "published": "2019-08-25",
  "completed": "2019-08-30",
  "words": "36,049",
  "chapters": "7/7",
  "comments": "1,696",
  "kudos": "34,545",
  "bookmarks": "10,570",
  "hits": "381,357",
  "summary": "<p>Some people are born with soulmarks. Zuko has them, but his grandfather burned them off because they \"make you weak.\" </p>\n<p>Team Avatar has a few things to say about that.</p>",
  "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>I called in sick today, so you guys get two chapters in one day. </p>\n<p>TW: this chapter discusses sexual assault (there's a detailed attempt that's quickly thwarted) as well as cultural self-harm. </p>\n<p>One of the few criticisms I have of the ATLA show is that they never go into Suki's backstory, which is probably why so many people don't like her and think she's \"boring.\" I had to make all of this up, and I hope I did her character justice.</p>\n<p>I ramped up the scope of Zuko's injuries from Azula's lightning. You know, 'cause that scene wasn't angsty enough. :P</p>\n<p>Thanks to everyone who left such kind comments and kudos! It's really made my week.</p>",
  "text": "<p>Zuko first realizes that something’s wrong when he’s five. Most people around him have really cool, colorful markings. Usually they’re hidden, but sometimes they’re in a spot that’s hard to hide with clothing. One of his servants has two unique, colorful marks on the back of each hand. A guard has three on her upper arm. His mother has one on the back of her neck.</p>\n<p>Zuko doesn’t have marks. He just has a weird, wrinkled area on the left side of his belly. </p>\n<p>“Mommy?” he asks as they’re playing with the turtleducks in the garden. “Why don’t I have any marks?” </p>\n<p>Ursa sucks in a breath. She furtively looks around, making sure no one is listening. She whispers, “You did have them, sweetheart. They’re your soulmarks. But your father and the Fire Lord thought they were bad for you, so they got rid of them.” </p>\n<p>“Oh.” Zuko looks down. He knows by now that both his father and grandfather are always right, and he shouldn’t ever argue with either. It’s a shame, though. He likes the pretty colors. </p>\n<p>“What do they mean?” he asks. </p>\n<p>“It means you have a soul family. The most important people in your life you’re ever going to meet.” She whispers in his ear, “Don’t tell anyone, but I peeked. You have five of them. I’ll help you find them one day.” </p>\n<p>Zuko giggles. He loves keeping secrets with his mother. </p>\n<p>--</p>\n<p>He first “meets” one of his soulmates a couple weeks after that. He’s climbing a tree in one of the gardens, even though his mother told him he shouldn’t, and he slips and falls, hitting the ground hard. </p>\n<p>He starts crying, because <em>ow</em>. A servant runs toward him.</p>\n<p>And then the strangest thing happens. He feels a hand. </p>\n<p>It’s not visible, and when he tries to touch it, he doesn’t connect with anything. But it’s definitely a hand, as cool as snow from a mountaintop. It gently touches his cheek, and it startles Zuko so much he stops crying and sits upright. The hand stays, soothing his tears. </p>\n<p>“What’s all this racket?” Ozai demands, coming into the garden. The servant, who has just finished looking over Zuko, gives a deep bow. The cool hand has now evolved into a protective hug, kind of like what his mother does with him.</p>\n<p>“I fell,” Zuko mumbles. </p>\n<p>“Did he break anything?” he asks the servant.</p>\n<p>“No, my prince,” she answers. “He’s just bruised up.” </p>\n<p>“Then stop whining,” Ozai orders. “And go change into something presentable. We’re having dinner with your grandfather tonight.” </p>\n<p>Zuko hurries to obey. The ghost hand disappears. </p>\n<p>--</p>\n<p>He asks his mother about it, and she smiles. </p>\n<p>“That’s one of your soulmates,” she says. “Whenever you need help or support, they’ll always be there for you. At least until you meet them in person and forge the bond.” </p>\n<p>He learns later that forging the bond means a quick blood swap, usually through the palms. Both soulmates nick their palms and press them together. Most do this multiple times. </p>\n<p>Why more than once? Well, he learns even later that soul-bonding is a bit like time travel. When you create a soul-bond with someone, you go to, as Ursa said, whenever in time (in the past) they need a soulmate’s help or support. Except the only thing you can touch is your soulmate, and nothing else. Basically, soulmates are like time travelling ghosts. </p>\n<p>Zuko reads as much about soulmates as he can before Ozai finds out and puts a stop to it. “Soulmates make you weak,” he snarls. </p>\n<p>Zuko...disagrees. His soulmates make him feel strong. </p>\n<p>--</p>\n<p>Azula starts firebending a year before Zuko. Of course he gets jealous. But at the same time...</p>\n<p>“Look, Zuko!” she says, and for the first time, beautiful, golden fire springs from her chubby, four-year-old hands. “I can firebend!” </p>\n<p>And Zuko’s reaction? He grins and cheers, “Awesome!” </p>\n<p>--</p>\n<p>He’s honestly not sure where it went wrong after that, between him and Azula. He’ll gladly admit that he’s not the best brother. He gets angry and jealous, lashes out at everyone and anyone nearby. But he also protects, teaches, and lets himself be bossed around by people who are younger than him and don’t want to kill him. </p>\n<p>The fault, as always, probably lies with Ozai. As soon as Azula started firebending, he immediately began favoring her, poisoning her against the world and her family.</p>\n<p>But it’s one of Zuko’s first and fondest memories: her so excited to realize she’s bending, and him, though not yet a bender, whole-heartedly encouraging it. It makes him wonder, if Ozai had been a better father, or just hadn’t been around, what the two of them would be like today.</p>\n<p>(And then he meets Katara and Sokka and thinks, <em>Ah. That’s it.</em>)</p>\n<p>--</p>\n<p>Over the years, Zuko interacts a lot with his soulmates. And he names each of them to keep them all straight. </p>\n<p>The first is Snowflake, the one with the cool hands. She (and Zuko doesn’t know <em>how</em> he knows it’s a she, but he does) is always there when he’s hurt or sick, helping bring his temperature down better than any wet rag. She’s also there when he’s emotionally hurt. When Ozai tells him, “Your sister was born lucky. You were lucky to be <em>born</em>,” Snowflake is gripping his shoulder so tight he’s pretty sure it’s frozen. It’s okay, though. It distracts from the pain in his chest caused by his father’s words. </p>\n<p>Then there’s Feather, so named because his touch is feather-light. He’s always there when Zuko needs to play. Sure, there’s Mai and Ty Lee, and he likes them (especially Mai). But they’re Azula’s friends, first and foremost. And as the years go by, Azula just gets worse and worse. Feather is there to point him to a group of musicians, or a cute animal, or a nifty knick-knack his mom might like. </p>\n<p>Ozai is never there when Zuko successfully completes a kata, or passes his classes, because he doesn’t do it as perfectly as Azula. But Zuko’s soulmate Brother is there. He ruffles Zuko’s hair, puts his arm around his shoulders, and sometimes flicks his ears when Zuko’s being an idiot. Everything Zuko imagines an older brother would do for him. </p>\n<p>Punchy is less of a friendly hand and more of an encouraging fist. She usually only appears when he’s down or failed. Whenever he thinks of just giving up, he’ll feel a punch in the arm, or a harsh tug on his shoulder, like someone’s trying to get him to stand up by chucking a rock at him. So he does, and when he finally gets it right, there will be a gentler, celebratory punch on his arm. </p>\n<p>Guard shows up whenever Zuko’s in danger. She first appears when Zuko is six, on an Ember Island beach with his family. He’s chasing crabs as the waters temporarily recede, and then he feels a hard push at his back, like someone wants him to run. He does, but not fast enough. The massive wave brings him to the ground, and almost sweeps him away. He spends a good chunk of the day coughing up seawater after that, but at least he didn’t drown. </p>\n<p>Between the five of them, hardly a day goes by where Zuko doesn’t interact with at least one soulmate. Ursa gives a sad smile when she hears this, and tries to encourage him to make physical friends in the present. But there’s not a whole lot of opportunity for a homeschooled boy who’s rarely out of the palace. </p>\n<p>--</p>\n<p>Cousin Lu Ten is everything Zuko wants to be when he grows up. He’s a brave, strong soldier who goes out to fight earthbenders. Someday, he’ll even be Fire Lord. </p>\n<p>They wrestle a lot, and Zuko shows him the firebending forms he’s working on. “Nice,” Lu Ten says. “Your stance is a little off.” He gently corrects his form. </p>\n<p>Later, Zuko will realize that he learns a lot better under Lu Ten—and later, Iroh’s—gentle training, rather than the near-abuse of his usual teachers that Ozai appointed. They have a habit of giving slaps and burns to their students when they screw up. Snowflake and Feather always try to help, but there’s not much they can do about the steadily increasing sense of failure and unworthiness that crushes his chest after every training session.</p>\n<p>He’s eight when Lu Ten leaves for Ba Sing Se with Iroh. Zuko hugs him good-bye. “Be careful.” </p>\n<p>Lu Ten chuckles, patting his head. “Don’t you worry about me, little cousin. And I’ll make sure Dad sends you some good souvenirs.” </p>\n<p>He never sees his cousin again.</p>\n<p>--</p>\n<p>About a year after Iroh and Lu Ten leave, Zuko picks up a “dangerous habit,” as Ursa puts it. He calls it a fun game. </p>\n<p>It’s called jumping off of tall shit onto other tall shit. </p>\n<p>Zuko blames a combination of Ty Lee, Feather, and Brother. Ty Lee is constantly teaching them new ways to break their necks, Feather pulls his attention to excellent jumping points, and Brother rewards the behavior with hair ruffles and shoulder-hugs. He’ll take his mother’s scolding for that any day of the week.</p>\n<p>Then Azula decides to join him on an excursion to the roof of their beach house on Ember Island. And really, he should not have turned his back on her. Not for a minute. Guard doesn’t even have time to warn him before Azula pushes him off the edge. </p>\n<p>While physicians are working on Zuko’s sprained ankle, Azula tearfully explains that Zuko simply fell. </p>\n<p>It’s not the first time she’s lied. But it’s the first time everyone unanimously believes her over him. </p>\n<p>--</p>\n<p>“You’re soaking wet,” Ursa says, as he storms away from the fountain of giggling girls. </p>\n<p>“Girls are crazy!” he shouts. Brother gives him a sympathizing pat on the back. </p>\n<p>--</p>\n<p>Lu Ten is dead. Iroh calls off the siege of Ba Sing Se. Zuko cries himself to sleep that night. </p>\n<p>--</p>\n<p>The family of four kneels before Fire Lord Azulon. Azula shows off her advanced bending technique. Zuko tries to one-up her, but fails. Ursa tries to comfort him but can’t stop the weight of <em>not good enough not good enough not good enough</em> from getting that much heavier. </p>\n<p>A furious Azulon orders them out of the throne room, but Ozai stays. Azula suckers Zuko into eavesdropping with her. </p>\n<p>Ozai thinks that Iroh’s new lack of heirs means <em>he</em> should be named crown prince. This makes the frustrated Azulon even angrier, and Zuko flees. </p>\n<p>--</p>\n<p>“Dad’s going to kill you!” Azula cheers. “Really, he is.” </p>\n<p>He still hears it even after Ursa drags her away, and he tries to drown it out with, “Azula always lies. Azula always lies.” </p>\n<p>They can’t actually defend him, but the weight of his soulmates—all five of them—huddled around him on the bed is what eventually gets him to sleep. </p>\n<p>--</p>\n<p>Looking back, Zuko doesn’t think Azulon ever expected Ozai to go through with it. Even if the man burned his baby grandson to get rid of the soulmarks, that doesn’t mean he wanted him <em>dead</em>. That the whole “Kill your eldest child” thing was just him trying to prove a point: parents whose children are dead or in danger are put in a terrible position, and should not have their birthrights stolen from them. He probably didn’t think Ozai would hate Zuko enough to actually consider it.</p>\n<p>At least, Zuko likes to think that way about his grandfather. </p>\n<p>--</p>\n<p>Ursa disappears. No matter how much Zuko asks, begs, or shouts, everyone pretends she never existed. </p>\n<p>Azulon dies. Ozai is crowned Fire Lord. Zuko finds himself in a position he’d never thought he’d be in: the next crown prince and heir apparent. </p>\n<p>All his life, he’d been told he didn’t matter. And not just by Ozai. Everyone knew that once Azulon died, the throne would pass to Iroh, then his son Lu Ten, then <em>his</em> children. Zuko was never supposed to factor into the picture. But with Lu Ten dead and Iroh disgraced, Zuko is now one of the most important people in the Fire Nation. </p>\n<p>And yet, Ozai still looks at him with nothing but disappointment. </p>\n<p>“Hmph,” he says as he watches Zuko finish his latest forms. They’re in the courtyard, the sages that have been teaching Zuko watching from the other end of the room. “Perhaps if we’re ever at war with turtleducks, you’d make a worthy ruler.”</p>\n<p>Zuko winces. Snowflake’s cool touch at his shoulder does little to help. Why can’t he stop failing? Why can’t he be <em>better</em>?</p>\n<p>“That’s enough of that, brother.” </p>\n<p>Both of them jump, and see Iroh come into the courtyard. </p>\n<p>“Iroh?” Ozai asked, bewildered. “You disappeared. They said you went mad.” </p>\n<p>“Just traveling,” Iroh says with a smile. He bows before his brother. “The crown suits you, Fire Lord. Thank you for convincing our father to give it to you. I don’t think it’d look nearly as good on me.”</p>\n<p>Even Zuko knows a backhanded compliment when he hears one, and has to bite his tongue. </p>\n<p>“Why are you here?” Ozai asks. </p>\n<p>Iroh pulls out of his bow. “I’ve spent the last year traveling the world. I’d say I’m ready to retire, but I believe your war council still has a seat with my name on it.” </p>\n<p>Ozai studies him. “I suppose we could use your advise, since you’ve grown too lazy for the field.” </p>\n<p>Iroh laughs. “More like too old.” He finally turns to his nephew, and his face brightens. “Ah, Prince Zuko. You’ve grown so much! You’re taller than I am! And certainly more handsome. Let me see you.” </p>\n<p>Zuko lets himself to be hugged, then examined by his uncle. He has no idea how to react. Iroh has never been cruel to him. Certainly not to the extent that Ozai or Azulon were. But he’s never been very...present in his life, either. Most of the time he was out on the field, leading the troops. When he was home, he was busy with war meetings, boasting to courtiers, and spending time with his own son. </p>\n<p>He was also a lot...trimmer...than he is now. </p>\n<p>This new Iroh, the one who smiles warmly and easily despite having so recently lost a child, who manages to be polite and insulting, and who specifically turns his back on Ozai to give his full attention to Zuko...this Iroh is new. </p>\n<p>“I was watching your form,” Iroh says. “You’re not bad! But there is always room for improvement. And you’re not going to get it with these sages. I’ll take over the rest of the your training.” </p>\n<p>Zuko blinks. Snowflake squeezes his shoulder, gently. Which means, she’s not mad. This...is a good thing? </p>\n<p><em>Well, he is the Dragon of the West,</em> he reminds himself. </p>\n<p>The head sage sputters, walking up to them and Ozai. “This is outrageous! It’s tradition for the Fire Sages to train the royal family.” </p>\n<p>“But not mandatory,” Iroh says. “My nephew deserves the best training he can get.” </p>\n<p>“He’s getting that with us,” the sage says. </p>\n<p>Iroh raises an eyebrow. “Is he? Should you and I step into the ring? I’d like to see which of us has the better claim to ‘Master.’”</p>\n<p>Snowflake has moved, now leaning on Zuko, propping her elbow on his shoulder by the feel of it. She’s enjoying this. So is he. </p>\n<p>Unfortunately, the sage is smart enough to know that he’ll never win a fight against General Iroh. He gives up the right to train the prince. </p>\n<p>--</p>\n<p>Zuko is initially cautious during the first few lessons with Iroh. Every time he makes a mistake—even a minor one—he expects to get a burn, or a smack, or at least some yelling. It’s what crappy students deserve, right?</p>\n<p>It never comes. Iroh never raises a hand to him and never raises his voice. The worst he does is give him a firm scolding, and that’s only when he’s doing something dangerous or not getting the fundamentals through his thick skulls. </p>\n<p>It’s…nice. His lessons progress much better under Iroh’s direction. And not just firebending. </p>\n<p>“You want me to learn a fighting style <em>other</em> than bending?” Zuko asks, incredulous. “Why?” </p>\n<p>“What’s your favorite food, Prince Zuko?” Iroh asks. “I should know this, but I’m sad to say, I do not.” </p>\n<p>“Spicy noodles with shrimp.” </p>\n<p>“What would happen if you had spicy noodles with shrimp every day at every meal?” </p>\n<p>“Uh...I’d get sick of it?” </p>\n<p>“You would get sick, period,” Iroh says. “The body is not meant to ingest only one thing, and neither is the mind. We have to expand your horizons. Skills you learn in one area can be surprisingly useful in other areas as well.”</p>\n<p>Zuko hesitates. “Well...I’ve always kind of liked swords?” </p>\n<p>Iroh smiles. “I know just the place.” </p>\n<p>--</p>\n<p>Zuko trains with the dao swords under Master Piandao. Ozai disapproves and Azula scoffs, but he clings to this. It’s the one thing that he excels at that Azula does not.</p>\n<p>And Brother is there almost every day, too. </p>\n<p>--</p>\n<p>When he’s thirteen, Zuko talks his way into a war meeting. </p>\n<p>That makes it sound like he lied. But he meant every word. He wants to become a good fire lord, so he needs to know this stuff. What happens if Ozai keels over of a heart attack tomorrow? So he gets in, under the condition that he not speak. </p>\n<p>Yeah. Nothing in Zuko’s life is ever that easy. </p>\n<p>He doesn’t need the prompting of his soulmates—he’s not even sure who it is that’s prodding him, he’s so angry—to speak out against the general. How dare he?! How can the Fire Nation call themselves people of honor when they’re shamelessly sacrificing the lives of its people as “fresh meat”?</p>\n<p>This is not a popular opinion.</p>\n<p>Ozai growls that Zuko is being extremely disrespectful. Dishonorable, even. And the only way to settle this is with an Agni Kai. </p>\n<p>“Fire Lord,” Iroh says sharply. “He’s a child.” </p>\n<p>“He’s the crown prince. And he shouldn’t even be here. The duel will happen tomorrow.” </p>\n<p>Zuko looks at the general and tells him he’s not afraid. </p>\n<p>--</p>\n<p>Zuko is confident even though he knows that’s a solid chance he will not win this. He refuses to let such a horrible order—a horrible <em>person</em>—go unchallenged. So he gets in the ring with his vest and kneels with his back to his opponent. Punchy gives him a good-luck punch in the arm that makes him smile, just a little. </p>\n<p>He stands and turns around. </p>\n<p>It’s not the general.</p>\n<p>--</p>\n<p>Right before Ozai burns him, Zuko feels all of his soulmates act. Guard is trying to pull him back, trying to get him to <em>move</em>. Punchy is trying to get him to stand and defend himself. Brother, Snowflake, and Feather try to protect his face. </p>\n<p>It’s all futile. They can’t protect anything, and Zuko is rooted to the spot. </p>\n<p>He appreciates the effort though. </p>\n<p>--</p>\n<p>In the infirmary, Snowflake becomes his favorite soulmate by letting him use her as a big icepack. As soon as he meets her, he’s getting her a box of candy and flowers (girls like candy and flowers, right?) just for this. </p>\n<p>He can’t stay long, though. He has three days to get a ship and a crew, and leave the Fire Nation. And since nobody wants to work with a dishonored, disfigured <em>boy</em>, he needs to get to work. </p>\n<p>Lucky for him, he has Iroh. </p>\n<p>--</p>\n<p>Two and a half years. </p>\n<p>He spends two and a half years at sea, first searching the Air Nomad Temples, then the poles, then the Earth Kingdom. He trains, with both fire and sword. He yells at his uncle, his crew, at innocent civilians. </p>\n<p>He focuses on nothing but his rage, and his burning desire to regain his honor and go back home. </p>\n<p>Despite the harsh treatment, Iroh never leaves him. Neither do his soulmates. </p>\n<p>Feather is always trying to cheer him up, even just a little. He’ll poke Zuko’s nose until he looks out the window and sees falling snow for the first time in his life. He’ll draw his attention to the dolphin-sharks that follow his ship. He’ll get Zuko to pause in front of a shop that has cute knick-knacks. It rarely works, but even on his worst days, Zuko finds himself softening just a little when it happens. </p>\n<p>Snowflake is always there when Zuko gets hurt. It doesn’t happen very often as he gets better at defending himself and ignoring the hateful sneers. But when he does take a hit, or a cruel word finds its way under his armor, her cool presence is always welcome. </p>\n<p>Brother is absolutely invaluable when it comes to strategy. Not every time, but sometimes, Zuko will feel him trying to push or pull his hand across various maps until he’s settled on a specific place that he wouldn’t have initially thought of. These places rarely have news of the Avatar, but they do have deep ports for his ship, cheap supplies, and a relatively friendly attitude toward Fire Nation princes. </p>\n<p>Punchy moves from hitting him when he needs to get up—he does that on his own, now—to hitting him when she thinks he’s being an idiot. Which is, apparently, every time he:<br>\n• yells at Iroh<br>\n• yells at the crew<br>\n• yells at anyone who isn’t a jerk, really<br>\n(She’s right, of course. But he’ll never admit it.)</p>\n<p>Guard is always watching his back. It doesn’t matter who he’s fighting or what danger he’s in, she will do everything in her power to alert him. From the thugs who try to rob him on the street, to mutinous crewmembers who think the best way for them to go home is to just get rid of their captain, to Earth Kingdom soldiers trying to ambush him. He can usually spot the danger himself, but just the fact that she’s there and invested in him being alive helps.</p>\n<p>Zuko knows that they are most likely in the Fire Nation. Soulmates rarely cross national lines. So he <em>needs</em> to capture the Avatar as soon as possible, so he can find them. </p>\n<p>(Later, he’ll realize that soulmates probably don’t cross national lines so much anymore simply because <em>people</em> don’t cross those lines anymore. And that needs to change.)</p>\n<p>--</p>\n<p>One day, he’s pondering his maps, when he feels Brother’s hand over his own. </p>\n<p>Zuko closes his eyes and lets his soulmate pick their next destination. When the touch is gone, he opens his eyes. And raises his eyebrow. </p>\n<p>It’s not a port, or city. It’s the south pole. </p>\n<p>--</p>\n<p>And just like that, it all changes again in an instant. </p>\n<p>--</p>\n<p>When the Avatar tricks them and escapes the ship, some of the crew want to go back to the Water Tribe village and burn it to the ground. </p>\n<p>“He knew the rules!” Lieutenant Jee argues. “He comes with us, or the village burns. He needs to pay the debt.”</p>\n<p>Iroh says nothing. Just watches Zuko and lets him decide. </p>\n<p>And Zuko, unlike most of his other decisions, actually takes a moment to think about it. Because he knows several people—Zhao, Azula, his father—who wouldn’t hesitate. They’d leave nothing but ash and bones in the snow. </p>\n<p>But there are two things holding him back. The first is sheer practicality. Their ship is badly damaged. They need to chase the Avatar. The Avatar flew <em>away</em> from the village. They can’t risk losing his tail just to quench a grudge. </p>\n<p>Secondly...</p>\n<p>“There are no warriors in that village,” Zuko says, thinking about that stupid boy who barely counts as a fighter and ran off with the Avatar. “No soldiers. Only old people, mothers, and children half my age. Where is the honor is slaughtering them because a child didn’t keep his promise?” </p>\n<p>Lieutenant Jee sputters. “He broke his word!” </p>\n<p>“His lack of honor doesn’t excuse yours,” Zuko snaps. He marches to his chambers. “We follow the bison. End of discussion.” </p>\n<p>He sees Iroh smiling at him, and feels an approving punch—different from the “you’re being an idiot” punch—from his soulmate. But the real shocker comes when he’s alone in his chambers. He takes one step and runs into a wall of soulmates. </p>\n<p>At first, Zuko is very confused. He has no idea what’s going on or even how many are with him right now. But after a minute, he figures it out. </p>\n<p>It’s Snowflake—he’d recognize that oasis-like coolness anywhere—and, given the calluses on the hands, Brother. And they’re hugging him. </p>\n<p>He has no idea why. Maybe they’re glad he finally has a solid lead, or that he’s not dead, or they recognize a bad day when they see one. Either way, he closes his eyes and just lets himself enjoy it for a moment. </p>\n<p>--</p>\n<p>The next few months are a whirlwind that turn Zuko’s life upside-down several times over. But what most sticks out is this:</p>\n<p>Every time Zuko fights the Avatar and his friends, he does it from a sense of duty. That he has to do this for his nation, for his honor, for his soulmates. But every time he fights <em>with</em> them, it feels oddly...right. When the Avatar asks if they could be friends after the “Blue Spirit” breaks him out of Zhao’s fort, a not insignificant part of Zuko wants to say <em>yes</em>. </p>\n<p>That terrifies him. </p>\n<p>And by now, he’s an expert at channeling his fear into fury, and fire. </p>\n<p>Later, when they’re all there fighting Azula in the ghost town and Iroh takes a bolt of fire to the chest, he wants to say yes again. The waterbender can help. And while they’re his enemies, by now he knows they’re honorable enough to mean it when they say they want to help. </p>\n<p>He bends fire at them to chase them away. </p>\n<p>--</p>\n<p>Ba Sing Se happens, and Zuko is more confused than anything else. </p>\n<p>Iroh tells him that it’s time for Zuko to choose his own destiny, to do good in the world. Azula tells him that he can help her topple an empire and regain everything he’s been striving so hard for: his honor, his father’s love, his soulmates. </p>\n<p>But oddly enough, his soulmates...don’t assist him in that decision. </p>\n<p>They’ve been with him every step of the way. Every fight, every injury, every roadblock, at least one of them is there, watching his back, soothing his wounds, giving him some sort of guidance. But in the catacombs of Ba Sing Se, they’re eerily silent. </p>\n<p>He picks Azula, and the Avatar falls. </p>\n<p>(Later, he’ll remember that soulmates only appear when destiny deems that he needs them. But sometimes, he needs to make decisions on his own.)</p>\n<p>That night, Zuko’s side aches and burns. He dismisses it as a muscle cramp or minor injury from the fight. Later, he’ll learn that it’s not unlike the pain of someone’s soulmate getting perilously close to death.</p>\n<p>--</p>\n<p>He has his honor. He has his girlfriend. He has his father’s love and even his sister’s approval. </p>\n<p>So why isn’t he happy?</p>\n<p>His soulmates appear from time to time, but it’s not like before. There’s little to nothing that they can do. He tries to talk to Iroh about it, but the man says nothing behind the iron bars. He considers telling Mai, but she doesn’t have soulmates and wouldn’t understand. </p>\n<p>He knows the Avatar is alive. One of the best waterbenders in the world has a vial of spirit water and is quite possibly soulbonded with and/or dating him? Yeah, he’s not dead. Injured and recovering, sure. But not dead.</p>\n<p>And thanks to Azula, if anyone else ever finds out about that, it’s all on Zuko. Everything that he’s worked so hard for will vanish in an instant. </p>\n<p>So Zuko does the only thing he can do and hires an assassin. </p>\n<p>It leaves him with a bad taste in his mouth, and a sore arm from Punchy’s hit. </p>\n<p>--</p>\n<p>When Iroh tells him about his link to Roku, Zuko takes that information and ignores it, the way he’s been ignoring everything else: the fate of the Avatar and his friends, the fact that the national rhetoric and propaganda he took as truth so obviously clashes with what he experienced abroad, the growing sea of guilt and hate and anger churning in his stomach. </p>\n<p>This—for the most part—works. </p>\n<p>Right up until the war meeting. </p>\n<p>--</p>\n<p>“Fire Lord Sozin used the comet to wipe out the Air Noamds,” Ozai says. “I will use it to wipe out the entire Earth Kingdom. And I will rule everything!”</p>\n<p>The generals cheer. Azula smirks. Zuko wants to throw up. </p>\n<p>His soulmates are at his back, some of them nudging him forward, urging him to speak up. </p>\n<p>He doesn’t. </p>\n<p>He studies the massive portrait of Ozai in the hall, Mai hanging on his arm. And he realizes two things:</p>\n<p>His father is a monster.</p>\n<p>And he has sacrificed everything—his identity, his uncle, his honor—in the name of that monster. </p>\n<p>--</p>\n<p>Assisting the Avatar’s invasion would seem like the easiest way to end all of this. Except Zuko can’t. Too much has already gone into preparations. If he tries to change anything, they’ll get suspicious of him and lock him down. </p>\n<p>No, he has to let the eclipse go as planned, and hope that the Avatar and his friends, once again, slip out of the jaws of death. </p>\n<p>So instead, Zuko spends the morning of the eclipse preparing. He writes a break-up letter to Mai, discards his crown and armor, and packs his swords and some food. As the sun grows dark, he heads for the bunker. </p>\n<p>He stands in front of the door that separates him from his father, waiting for the eclipse to officially start. </p>\n<p>Snowflake is gripping his left hand, to the point that his palm is frozen. Feather is holding his right, jittery fingers tapping against him. Punchy is squeezing his forearm, Brother’s hand is on his shoulder, and Guard’s is on his back. </p>\n<p>“I’m ready to face you now,” he says, and walks through the door. </p>\n<p>--</p>\n<p>He feels like twenty pounds has been lifted from his chest as he walks away from Ozai, even as the man calls him a coward. </p>\n<p>And then...</p>\n<p>“Don’t you want to know what happened to your mother?” </p>\n<p>Zuko stops. </p>\n<p>Guard, Punchy, and Feather are all trying to push him out the door. And he knows, he knows <em>exactly</em> what Ozai’s doing. </p>\n<p>He turns around anyway. “What happened that night?” </p>\n<p>--</p>\n<p>His mother is alive. </p>\n<p>Iroh broke himself out of jail. </p>\n<p>The Avatar and his friends are heading for the Western Air Temple. </p>\n<p>Zuko steals a war balloon and chases after them. </p>\n<p>--</p>\n<p>It probably says something about Zuko that his “fuck you” to his abusive father is much, <em>much</em> easier than trying to convince the Avatar’s group that no, he’s really not trying to kill them this time. </p>\n<p>Predictably, it does not go over well. </p>\n<p>Ugh. This would have been so much easier with Iroh.</p>\n<p>--</p>\n<p>It gets worse before it gets better. He accidentally burns his only supporter’s feet. </p>\n<p>When he screams at the sky after she leaves, Punchy gives him a sympathetic pat. </p>\n<p>--</p>\n<p>Early the next morning, Zuko gives serious consideration to leaving. That’s what they want, and so far all he’s ever done is bring more harm than good. Maybe that’s the only way to make this right. </p>\n<p>But he can’t. Because this is his mess to clean up. And it’s his nation that’s going to destroy the world. He needs to fix this. </p>\n<p>So he resolves to just stay at arm’s length until they decide he’s not a threat. </p>\n<p>His soulmates have other ideas. </p>\n<p>Punchy’s the first the start prodding him. Then Brother, Snowflake, and finally Feather, all urging him to get up. </p>\n<p>“What?” he snaps. </p>\n<p>They push harder. </p>\n<p>“Fine! I’m up! I’m up!” He gets to his feet. “Now what, you idiots?” </p>\n<p>They prod him forward. </p>\n<p>Zuko sighs, but he closes his eyes so it’s easier to follow their lead and starts walking. A more cautious man would at least crack open an eye for stray roots or rocks, but Zuko trusts his soulmates more than anyone else. </p>\n<p>He realizes where they’re going and opens his eyes. “Really? Back here?” he asks, looking at the upside-down temple. “Right, because this went over so well last—”</p>\n<p>He sees the glint of metal. The bald head. The very distinctive tattoos. </p>\n<p>Zuko runs. </p>\n<p>--</p>\n<p>Lesson learned: whenever you want to get a group to go from “we want to murder you” to “we’ll tolerate you until you give us an explicit reason to murder you,” just save them from the assassin you hired to kill them and take a dive off a cliff. </p>\n<p>Whatever. Zuko never asked for luck, he just wants results. He’ll take their overly-cautious attitude, midnight threats, and cold shoulders with a smile. He honestly wasn’t expecting anything better. </p>\n<p>Now, if only he could actually firebend...</p>\n<p>--</p>\n<p>Zuko’s mini-adventure with Aang to the Sun Warriors really drives home how <em>young</em> the kid is. </p>\n<p>When he was chasing them, it didn’t really click that the Avatar was only twelve. He just saw his prey: a dangerous bender who grew more and more powerful every day. </p>\n<p>Now, after only a day of actually...hanging out...with Aang, the fact that this is just an overly-optimistic, unusually wise, actually <em>terrified</em> child smacks Zuko in the face. He’s extremely timid around fire, he’s wary about the traps, and he’s even more scared of Zuko’s father than Zuko was at his age. </p>\n<p>And he has to save the world in two months. </p>\n<p>On the flip side, the first time Aang manages to firebend on his own without burning anybody, his face is one of pure joy and wonder. Zuko will remember that face for the rest of his life. </p>\n<p>The whole thing boils down to Zuko vowing to himself to protect Aang with his dying breath. </p>\n<p>--</p>\n<p>“Protect Aang” in Zuko-speak translates to “grill him with all the training.” </p>\n<p>Toph, at least, greatly approves. </p>\n<p>As the week creeps by, Zuko finds himself gradually becoming accepted into the group. He does chores with Teo, Haru, and The Duke. He trains Aang. He asks Sokka why Aang and Katara aren’t dating, because he thought they were an item from day one, and Sokka shouts, “Exactly! If I have to watch them make goo-goo eyes at each other after the war, I’m locking them in a closet together.” He gives Toph piggy-back-rides until her feet heal, and even after they heal because she’s a jerk like that. Katara grudgingly accepts his tea with her dinner.</p>\n<p>And he starts having dinner with the group rather than alone in his room. He still sleeps separate from them. Part of it is because, while he’s definitely connected with Aang and probably Toph, he’s still very much an outsider. They’re still awkward around him, sometimes even tense, like they’re waiting for him to attack. </p>\n<p>Which is ridiculous, because even when he was actively chasing them, he was never smart enough to come up with a plan this good. </p>\n<p>The other reason is the nightmares. He used to get them during his exile all the time, and then they tapered off. Now they’re back. Sometimes it’s the old ones—Ozai burning him, his mother crying for help but he can never find her, drowning in darkness while Azula laughs—and sometimes they’re new. Ozai burning Aang features prominently. Uncle Iroh getting hurt or worse, and blaming Zuko. The world burning. </p>\n<p>He usually doesn’t wake up screaming, but it does happen. Better to just stay away and save that mess of a conversation for later. </p>\n<p>But he still has dinner with the group. And it’s during one such meal that the subject of soulmarks comes up. </p>\n<p>Zuko’s soulmates haven’t appeared in a long time. Not since they pointed him in the direction of the assassin. He’s a little disturbed by it; he can’t remember a time he’s gone so long without interacting with at least one of them. But at the same time, he doesn’t really need them right now. He’s busy with Aang and the rest of the team, and for the first time in a long time he knows exactly what his purpose is and how to fulfill it.</p>\n<p>Also, he really doesn’t want to explain to his soulmates what a horrible asshole he was until he’s had some time to make up for it.</p>\n<p>Sokka’s in the middle of a joke when he suddenly stops talking and looks down at his hand. Zuko frowns. “Sokka?” </p>\n<p>He doesn’t answer, and starts unraveling the wrapping around his arm and glove. </p>\n<p>“I don’t feel anything,” Toph says. </p>\n<p>“Me, neither,” Aang adds. </p>\n<p>Katara smiles at her brother, who’s ignoring them. “You probably just have a cramp from sparring today.” </p>\n<p>“I know, I know, but...” Sokka’s glove finally comes off, revealing a line of soulmarks that starts at the base of his thumb and goes to the inside of his elbow. As Zuko’s sitting right next to him, he has a prime seat, but looks away. Those are private. Sokka studies one of the marks and breathes a sigh of relief. </p>\n<p>At everyone else’s confused looks, Katara explains, “One of our soulmates is missing.” </p>\n<p>“’Our’?” Zuko echoes. </p>\n<p>“Twinkle-Toes, Sweetness, the idiot and I are all soulmates,” Toph explains, ignoring Sokka’s protests at his nickname. “We also have Suki, that’s the girl who’s missing, and a sixth person we haven’t met yet.” </p>\n<p>Zuko hums into his bowl of noodles. He’s completely unsurprised that the four of them (plus two others, apparently) are soulmates, considering how close they are and all they’ve been through. Well, maybe the fact that Katara and Sokka are. Siblings are rarely matched, simply because they’re already so close, so destiny rarely has to get involved to keep them together. </p>\n<p>“I have three,” The Duke says, rolling up his sleeve to reveal them. He points to one shaped like a log. “That’s Pipsqueak. I don’t know who the other two are.” </p>\n<p>“I have four, but they’re on my legs,” Teo says, looking down at his wrapped limbs.</p>\n<p>“None for me,” Haru says with a shrug. </p>\n<p>They all look at Zuko. Maybe it’s just his imagination, but Sokka, Aang, and Toph look like they’re all holding their breath. </p>\n<p>“Five,” he says, hoping to leave it at that. </p>\n<p>Aang leans forward. “Can you show us?” </p>\n<p>“No.” </p>\n<p>“Why not?” Katara challenges. </p>\n<p>He sighs, and lifts up his shirt, revealing the old scar. “Because my grandfather burned them off when I was born.” </p>\n<p>Everyone either pales or looks vaguely ill. Zuko tries not to squirm. He’s been half naked in front of a ship full of people and he’s never felt this exposed. </p>\n<p>“Perhaps this is a strange question,” Sokka asks, “but <em>why</em>?” </p>\n<p>“Him, my father, and Azula don’t have soulmates,” he explains, dropping his shirt. “They think soulbonds make you weak, and the best thing to do is just avoid them altogether.” </p>\n<p>“So you have no idea what your marks look like.” </p>\n<p>Zuko shook his head. “Right after it happened, my mom tried to draw them, so she could show me later and help me find them. But my father found them and destroyed them.” </p>\n<p>“Soooo, it’s possible that you <em>have</em> met your soulmates already and just don’t know it?” Sokka asks. </p>\n<p>Zuko flinches. “I sincerely hope not!” </p>\n<p>“Why not?” Toph asks. </p>\n<p>“Jee, I don’t know. Maybe because I’ve been a total bastard for most of my life and I really, really don’t want that to be how my soulmates think of me?” He looks at Katara. “If we’d had another minute in the catacombs, I would have asked you to heal <em>that</em> scar instead of the one on my face.” </p>\n<p>“Then I’d say we did your soulmates a favor,” she says. </p>\n<p>Toph whistles. “Low bar, Sugar Queen, even for you.” </p>\n<p>“Oh, come on! How do we know he’s—”</p>\n<p>“He’s not lying,” Toph says.</p>\n<p>“And I’ve felt them,” Zuko says. “All of them. So I definitely meet them at some point. I just haven’t met them yet.”</p>\n<p>“Hold on,” Sokka says. “I have a theory. Zuko, look at these.” </p>\n<p>Since he’s explicitly being asked, Zuko looks. At the base of Sokka’s thumb is a golden fan. Down his arm is a blue Water Tribe-like symbol that probably matches the design of Katara’s necklace, a blue arrow like what’s on Aang’s head, a cloudy eye that looks like Toph’s, and a golden fire symbol. </p>\n<p>“Mine’s a boomerang. They have it,” Sokka says, waving his hand at his other soulmates. “Now this one here...” he points to the fire symbol “...looks an awful lot like the Fire Nation insignia, right?” </p>\n<p>“Yeah, except the color’s off,” Zuko says. </p>\n<p>“Does the fact that it’s gold mean anything to you?” </p>\n<p>Zuko shrugs. “That is the color of the crown. But it could also mean that your sixth is a jeweler, or gold thief, or any number of things.”</p>\n<p>“Well, here’s the other thing,” Sokka says, “We know this guy is a firebender. The heat that his spirit gives off is like a fire pit. Pretty handy when you live in the South Pole.”</p>\n<p>Zuko narrows his eyes and warns, “Stop it.” </p>\n<p>“I’m just saying: it all fits. So far every one of our soulmates is helping to end the war, which is what you’re doing. You admitted it yourself that the color matches the royal crown, and you are a prince. And in our line of work, coincidences aren’t exactly a thing.” </p>\n<p>“I am <em>not</em> your soulmate,” he says, praying that it’s true. Everything that he’d done to them and put them through was horrible enough when inflicted on random people. But if they’re his <em>soulmates</em>? He might as well jump off a cliff right now.</p>\n<p>“Well, there’s really only one way to find out,” Teo says. </p>\n<p>“I’ll do it!” Aang cheers, airbending over the fire so he’s sitting cross-legged in front of Zuko. “Sokka, do you have a knife?” </p>\n<p>“Guys, come on,” Zuko tries. </p>\n<p>“Look, if it’s nothing, it’s nothing,” Sokka says. “You’ll still be our teammate. We just...want to make sure.” </p>\n<p>Zuko sighs and watches Aang prick the middle of his palm with the knife Sokka produces. “So what exactly can I expect here?” </p>\n<p>“Well, if we’re soulmates, there will be a light as soon as we touch blood, and then our spirits will get sent back,” Aang explains. “For our bodies, this takes only about three seconds. But in our minds, we’ll be going through every moment and event that we are needed, either to intervene in or, in some cases, just something the universe thinks we need to see. It’s kind of random sometimes, honestly. But it’s really cool!” </p>\n<p>“Great,” Zuko says weakly. Sokka takes the knife from Aang and wipes it on his pants, then hands it to Zuko. He takes it and pricks his palm, but hesitates.</p>\n<p>“Look, Aang,” he says, “Are you sure you want to do this? Because if we are truly soulmates, then what you’re about to see...it’s not going to be pretty. And there are a lot of things I’ve been through that I would really, really rather you not be a part of.”</p>\n<p>Aang’s exuberant smile slides off his face. He scoots closer. “Honestly Zuko, I’ve never thought your life was...entirely pleasant. But that just means that, if we are soulmates, then you’re really going to need me, need us, to get through it. Right?” </p>\n<p>Zuko feels himself choke up. He swallows it down. “Right,” he mumbles. He takes a deep breath. <em>Please don’t be my soulmate, please don’t be my soulmate.</em> “All right. Here goes.” </p>\n<p>He holds out his hand. Aang takes it in a firm handshake. And—</p>\n<p>\"Fuck!\" </p>\n<p>When Zuko clasped hands with Aang, there was a light, he blinked, and now he's in the Southern Air Temple. </p>\n<p>And it's <em>filled</em> with monks. </p>\n<p>So. Definitely, undeniably soulmates. </p>\n<p>Great. That’s just fucking great. He is now one of the worst people on the planet. </p>\n<p>\n<em>Wallow in guilt later, dumb-dumb. You have a job to do.</em>\n</p>\n<p>Zuko takes a moment to look around. When he'd come to this temple in the early days of his hunt, it had been well and truly dead. A ghost town. But now, a hundred years prior, it's teaming with life. Old people meditate under trees. People feed bison and lemurs. Airbending kids play in the skies. Nobody sees Zuko. He's effectively invisible. </p>\n<p>He immediately finds Aang. Which is weird, because the kid is a bit younger--maybe nine or ten--and has no tattoos. He blends in perfectly with all the other kids. By rights, Zuko should not have been able to recognize him. Yet Zuko knows him on sight. </p>\n<p>He's sitting behind the reins of a younger, but still formidable, Appa. An older monk is looking up at him. \"Now remember, Aang: go to the eastern temple first. Then the north. I will be waiting for you in the west, and when you get there, you will receive your tattoos.\" </p>\n<p>Aang bobs his head, bubbling with excitement. Zuko realizes that there are a few other kids his age who are also ready to go. But their saddles are empty of adults, holding only supplies. </p>\n<p>Wait. Do these monks expect a bunch of kids to travel around the world <em>on their own</em>?! Even if it's peacetime, that seems really, really dangerous. </p>\n<p>\"The eastern temple expects you in two weeks,\" the old monk continues while Zuko steams. \"A day late, and they will be sending search parties. Follow your map so you reach the checkpoints in the middle.\" </p>\n<p>\"I'll get there a week early!\" Aang cheers. </p>\n<p>Okay, so at least there's some sort of plan in case things go wrong. And he imagines there’s been a lot of preparation in this. Still. These people are really sink-or-swim. Or rather, fly-or-fall. He wants to smack that monk. </p>\n<p>\"Good luck,\" the monk says, bowing. </p>\n<p>\"Bye, Gyasto. Yip yip!\" </p>\n<p>Zuko barely has time to get in the saddle before they're lifting off. Several people cheer. Aang waves until the people are specks. He pats Appa's head. \"Well buddy, just you and me. Our first journey together! Ready to make some new friends?\" </p>\n<p>Appa groans. Aang giggles. \"I know, right? Hey, you think we'll have time to ride the hopping llamas?\" </p>\n<p>Zuko rolls his eyes. Then he wonders why he's here. Aang--in the present, that is--said that Zuko would be taken to points of time where he's either needed most, or that he really needs to see. He tries not to be jealous of the fact that Aang obviously needs him at lot less and a lot later than Zuko needed <em>his</em> soulmates. Unlike the firebender, the kid is a natural at making friends, and had a functional family.</p>\n<p>But Aang doesn't seem to need him right now. And this moment doesn't strike Zuko as particularly critical. But since he has no idea how to skip ahead, he settles down to wait. </p>\n<p>He doesn't have to wait long. A storm brews ahead. It's a small one, small enough that Aang decides to fly above it rather than through it. The problem is, the higher he goes, the colder it gets. </p>\n<p>He shivers, looking back in his saddle. \"Guess I should've brought an extra blanket, huh, bud?\" </p>\n<p>What was it Sokka said? That a soulmate could keep someone warm if they were a firebender? </p>\n<p>Cursing himself for a fool and a dork and not liking this at all--he doesn't do hugs, or <em>cuddles</em>--Zuko sits behind Aang and wraps his arms around him. </p>\n<p>Aang goes rigid, then laughs. It's such a happy, carefree sound. “A firebender! Awesome!” </p>\n<p>He puts a hand on his lower back, probably where his soulmark is. \"Took you long enough. I was getting worried! I've met everyone else. I guess you're just shy, huh?\" He settles deeper into Appa's fur and closes his eyes with a sigh. \"Can't wait to meet you, buddy.\" </p>\n<p>Zuko smiles. </p>\n<p>--</p>\n<p>Zuko flickers in and out of Aang's life. Sometimes he warns him of danger, because Aang's always had a knack for getting in trouble. He and his firebending friend Kuzon fight off a few dragon egg thieves and return the egg to the mother; Zuko has to warn him of incoming fireballs three times in that one fight. He and Bumi almost die going down their \"super slide,\" and Zuko has to alert him to the fact that he's about to crash if he doesn't jump out of the carrier. </p>\n<p>The savior of the world, everybody.</p>\n<p>But a solid half of the time seems to be just Zuko keeping Aang warm. He'd find it pointless, but Aang likes talking to his soulmates.</p>\n<p>\"Thanks for coming, buddy,\" Aang says as soon as Zuko's wrapped around him again. He's getting better at this hugging thing. Hopefully he'll be able to look present-Aang in the eye when this is over. \"It's been a rough week. Kuzon's parents won't let him hang out with me. They said some awful things about Air Nomads...\" </p>\n<p>Zuko sucks in a breath. Sozin's propaganda campaign. You can't just order a bunch of people to commit genocide without prepping them first. The clever fire lord spent years feeding his people lies about the other nations, paying particular attention to how horrible and savage the nomads were. They hated their own children, they had no order, no accountability, they were rogues, thieves, et cetera. </p>\n<p>Zuko almost wants Aang to meet Sozin. If only so Zuko could try to bash his ancestor's face in. </p>\n<p>But he can't do that. The only person, the only thing in this time that Zuko can touch or interact with in any way is Aang. So that's what he does. He focuses on keeping the boy warm and reminding him that he's not alone. </p>\n<p>--</p>\n<p>They tell Aang he's the Avatar way too soon. Every other Avatar before him got to wait until they were sixteen. But the Air Nomad Elders are right: war is coming. They need Aang to start preparing now. </p>\n<p>Of course, this alienates him from everyone else. Zuko watches with a pang in his chest as Aang is rejected by the very friends he taught the air scooter maneuver to, and he sees a little too much of himself in the crabby elder who only wants to make Aang work and study all the time. At least there's Gyasto. Zuko has grown to really like that man; he reminds him of Iroh. </p>\n<p>Gyatso is called in for a meeting with the other elders. Aang eavesdrops, and Zuko eavesdrops with him. Their blood goes cold when they hear the order, \"You and Aang must be separated.\" </p>\n<p>Aang flies back to his room. Zuko spits curses no one can hear. The kid has literally no one else! Give him a strict training schedule, maybe get him started on basic waterbending so it clicks that he really is the Avatar, but you don't just tear him away from his guardian!</p>\n<p>Aang cries as soon as the door is closed. Zuko sits next to him and leans into him. </p>\n<p>Someone else is there. </p>\n<p>Their hand brushes against Zuko's shoulder, and it shocks him enough that he jerks back a little. The other hand doesn't move from where it's holding Aang. Zuko cautiously returns to his position, and finds that he immediately recognizes who it is: Snowflake. She pats Zuko's shoulder in greeting before shifting back to Aang.</p>\n<p>So, spirit soulmates can interact a little bit with each other even if they're focused on someone else's life. Interesting...</p>\n<p>When Aang's finished crying, he paces for a little bit. Barely touches his dinner. Goes to bed early. </p>\n<p>Or rather, pretends to go to bed early.</p>\n<p>He writes a note and leaves it on his pillow. But then he hesitates. </p>\n<p>Zuko might not have heard the full story, but he knows. He knows exactly what's going to happen. Aang runs away, he gets frozen, the comet comes and his people die. If he doesn't leave <em>now</em>, he'll be dead, too. </p>\n<p>And Zuko will be damned before he lets that happen.</p>\n<p>He puts a hand on Aang's back and pushes him to the window. </p>\n<p>Aang runs away. </p>\n<p>--</p>\n<p>Zuko blinks, and the next time he sees Aang, he's in the South Pole. With Katara and Sokka. </p>\n<p>He'd find Sokka's suspicion hilarious if he wasn't dreading what was coming. Maybe he could smack past-him a few times, get him to see sense?</p>\n<p>No such luck. When Aang fights past-Zuko, and spirit-Zuko tries to yank at the ponytail, his hand just passes right through. So all he can do is watch the fight, capture, and escape in boiling silence. </p>\n<p>Past him was a total dick. </p>\n<p>--</p>\n<p>The three of them are on Appa, heading for the Southern Air Temple, when Aang gets his first good look at Katara's necklace. His whole face lights up. \"Hey! I have a mark just like that!\" </p>\n<p>\"Huh?\" Katara puts a hand to her throat. </p>\n<p>Aang wiggles out of his shirt, despite vehement protests from the siblings because it's extremely cold out. But Zuko's keeping him warm, so it's fine. Aang shows them his marks. \"See? And Sokka, don't you have a--\"</p>\n<p>\"Boomerang!\" Sokka cheers. \"Those are our marks! We've got the fan, the eye, and the fire, too!\" </p>\n<p>\"You must be the arrow,\" Katara says, and they're all grinning. Aang pulls both of them into a big hug, and Zuko relaxes. Aang might be new to this century, and he might be the last airbender, but he's not alone.</p>\n<p>--</p>\n<p>Aang finds Gyatso's skeleton. </p>\n<p>It's not pretty.</p>\n<p>--</p>\n<p>It takes Zuko a moment to remember Kyoshi Island, and when he does, he wants to hit himself. Repeatedly. </p>\n<p>Suki, his last soulmate, is the leader of the Kyoshi warriors. The trio doesn't have time to narrow the golden fan down to her, though. Thanks to Zuko. Who then proceeds to burn said soulmate's village. </p>\n<p>He is, officially, the worst soulmate ever. </p>\n<p>--</p>\n<p>Aang intercepts the map to Sokka and Katara's father and, thinking they'll abandon the quest—abandon <em>him</em>—for it, crumples it up and hides it. </p>\n<p>Zuko sputters, then smacks him over the back of the head. </p>\n<p>\"Oh, shut up,\" Aang snaps. \"They're my soulmates. We need to stick together.\" </p>\n<p>Too bad he can't hear Zuko swearing at him. This damn kid. </p>\n<p>--</p>\n<p>Aang tries to learn firebending too early and burns Katara. </p>\n<p>Zuko knew it would happen. After all, Aang did tell him about it when they accepted him into the group. But still. The sound of Katara’s scream is going to haunt him for a long time. </p>\n<p>--</p>\n<p>At the North Pole, Zuko wishes he could follow Aang into the Spirit World, because this quest to find Tui and La sounds dangerous. But he can’t. </p>\n<p>So instead, when past-Zuko shows up and carries Aang into a blizzard, he just does his best to keep the kid’s body warm.</p>\n<p>--</p>\n<p>\"Why aren't you dating?\" Zuko wails, watching Aang and Katara almost-kiss in a cave.</p>\n<p>--</p>\n<p>Omashu is Fire Nation. They go to a magic swamp. They meet Toph. Aang learns earthbending. They go to the desert. </p>\n<p>They learn about the eclipse. </p>\n<p>They lose Appa. </p>\n<p>Aang starts ripping into Toph. \"You've never liked Appa. You wanted him gone--\"</p>\n<p>Zuko puts his hand on Aang's forehead, telling him to shut up even as Katara says to calm down. </p>\n<p>Seeing him go into the Avatar State against the desert tribes, that’s just terrifying. </p>\n<p>--</p>\n<p>They reunite with Suki at the refugee dock, and she helps them through the Serpent’s Pass. Unfortunately, she can’t stay with them. She has her own duties. </p>\n<p>They make it to Ba Sing Se. </p>\n<p>Zuko would really like to stop now. </p>\n<p>--</p>\n<p>Aang dies. </p>\n<p>Aang <em>actually dies</em> for a few minutes. And it’s all Zuko’s fault. Thank Agni for Katara and her spirit water. </p>\n<p>Zuko is never going to forgive himself for this. </p>\n<p>--</p>\n<p>Aang wakes up on a Fire Nation ship and understandably freaks out. </p>\n<p>It gets worse when he learns the whole world thinks he's dead. </p>\n<p>And then he decides to run away again. </p>\n<p>Zuko tries to stop him, putting a hand on Aang's chest to push him back. Aang does stop, but only for a moment, and only to glare and hiss, \"This is your fault, too! If I hadn't run away, none of this would have happened! I never should've listened to you. And I hope we never meet!\" </p>\n<p>Zuko reels back, and watches Aang struggle to fly away. He can't say he's surprised. </p>\n<p>--</p>\n<p>He does as Aang asked, and doesn't touch him through the school, the assassin, or the scams, until the day before the eclipse. The kid isn't sleeping. He's hallucinating. If he doesn't relax right now, he risks getting himself hurt tomorrow. </p>\n<p>The others make him a bed of sheep wool and manage to convince him to get some sleep. But before he does, he sits on the wool and looks down. \"I think I messed up, guys.\" </p>\n<p>\"What do you mean?\" Katara asks. </p>\n<p>\"...Have you guys had much contact with our sixth?\" </p>\n<p>\"Fire guy?\" Sokka clarifies. \"Uh, yeah. Not that long ago. Why?\" </p>\n<p>Aang winces. \"So, when I ran off from the Fire Nation ship, I kind of blamed him for everything and said I never wanted to meet him, and he hasn't been with me since.\" </p>\n<p>\"But you <em>will</em> meet him. Obviously,\" Sokka says. </p>\n<p>\"Still. I've just been feeling off ever since then. Like, I know he's there, I can feel the heat, but it's like he's trying to avoid me.\" </p>\n<p>Zuko groans. Dammit, he tries doing what they want, and he just messes it up further. He can't win with these guys!</p>\n<p>\"Well, duh,\" Toph says. \"You literally asked him to back off. Look, if you need space, you can ask for space. If you want warm fuzzy cuddles from Sunshine, ask for warm fuzzy cuddles already. We're soulmates. He'll deliver.\" </p>\n<p>Aang rubs his eyes, but manages a smile. \"Okay. Good night, guys.\" </p>\n<p>They leave him to rest. Aang lies down, curling up on his side. He pokes the cotton. \"Uh...fire guy?\" </p>\n<p>Zuko snorts, but that can't be any more ridiculous a name than \"Feather,\" so he answers. He sits behind Aang and puts a hand on his upper arm. </p>\n<p>Aang tenses, and tries to latch on to his hand. Of course, there's nothing for him to grab on to physically, but Zuko doesn't move. </p>\n<p>\"I'm sorry.\" Aang's voice breaks when he speaks. \"You've been an amazing soulmate, and I've just thrown it back in your face. I can't wait to meet you.\" </p>\n<p>Zuko almost laughs. He figures he'll enjoy the delusion while it lasts. </p>\n<p>--</p>\n<p>They make a valiant effort on the Day of Black Sun. It's just not enough. </p>\n<p>--</p>\n<p>Zuko thinks that he should not have to sit through a repeat of his stuttering, embarrassing first attempt at making nice in the Western Air Temple, but fate makes him go through it again, anyway.</p>\n<p>This time, he gets to listen to their conversation after he leaves. </p>\n<p>\"Aang already has a firebender for a soulmate,\" Sokka points out during their argument. \"We just have to find him.\" </p>\n<p>\"What if we already did?\" Toph asks. \"What if it's Zuko?\" </p>\n<p>Katara barks a laugh. \"You know, I had that same thought in Ba Sing Se. But look what happened! Instead of doing the right thing and helping us, he fought with Azula and brought down the entire Earth Kingdom.\" </p>\n<p>\"Maybe he doesn't <em>know</em> we're his soulmates. I had no idea what my marks looked like until you guys told me.\" </p>\n<p>\"But he's not blind. And they're really obvious,\" Aang says. </p>\n<p>\"Which means, if he is our soulmate, he's chosen to reject the bond,\" Katara adds. \"And I don't know how the Earth Kingdom or the Air Nomads deal with that, but in the Water Tribe, you <em>don't do that</em>. Your bonds are your family!\"</p>\n<p>Toph storms off in a huff.</p>\n<p>--</p>\n<p>Toph comes back with burned feet. They plan on taking Zuko prisoner. As he watches them fight \"Combustion Man\" (really, Sokka?) he idly wonders how that would've gone. Probably very unpleasantly. Though he can't imagine any of them condoning straight-up torture. </p>\n<p>--</p>\n<p>Zuko joins the group, fails at firebending, they go see the Masters.</p>\n<p>--<br>--</p>\n<p>Zuko slams back into his body, in the present, holding Aang's hand. He wrenches himself free and is on his feet, pacing the campsite as a slew of swears pour of his mouth. He’s not entirely sure what he’s swearing at: the shock, the universe, or himself.</p>\n<p>“He’s our sixth!” Sokka cheers. Toph whoops. Like it’s something to celebrate. </p>\n<p>“Aang?” Katara asks, standing. “You okay?”</p>\n<p>Zuko stops his swearing long enough to look at Aang. Where Zuko had gone up, Aang had gone down, collapsing on the ground. Katara kneels over him and is about two seconds from pulling out healing water when he moves, slowly. </p>\n<p>“What happened?” Toph asks.</p>\n<p>Zuko doesn’t even know how to begin to answer that one. <em>I’ve just had every single mistake I’ve ever made in my life thrown back at me like a lemon cream pie. Oh, and I’m pretty sure I’ve emotionally traumatized Aang more than he already was. Who’s next?</em></p>\n<p>Aang pushes himself up to his hands and knees, and Zuko sees enough of his face to confirm: he is definitely crying. </p>\n<p>Zuko thinks <em>nope</em>, and bolts.</p>\n<p>Eventually he finds a quiet corner to sulk in. Zuko gets to a darkened cliff, sits on the edge, and buries his face in his hands.</p>\n<p>Or, tries to. There’s still blood smeared on his palm. He wipes it away and ties a hasty bandage in the dark.</p>\n<p>He’s just finished with that when he hears the unmistakable sound of airbending, and then Aang lands next to him.</p>\n<p>“Hey,” Aang says, closing his glider and setting it aside. </p>\n<p>Zuko stares down, at the infinite darkness. “I’m sorry.” </p>\n<p>Aang chuckles. “You’ve already apologized a thousand times.” </p>\n<p>“No. That’s not...” He groans, and his voice cracks: “You’ve all saved my life and my sanity more times than I can count. I love all of you. And I just...I’ve been horrible. There’s not a single one of you that I haven’t hurt.” </p>\n<p>“We don’t blame you for that—” </p>\n<p>“You <em>died</em>, Aang!” Zuko roars. “You died, and if I hadn’t been stupid enough to follow Azula then it never would’ve happened.” </p>\n<p>Aang sighs. He crosses his legs and twists himself so he faces the firebender instead of the cliff. “Zuko. Look at me.” </p>\n<p>Zuko doesn’t turn around, but he does tilt his head and look at him. </p>\n<p>“If Azulon hadn’t burned your marks, if you’d known who we were from the start, would you have attacked us?” </p>\n<p>“No,” he says, without hesitating. </p>\n<p>“Even if your dad ordered you to? If he’d said it was the only way you’d ‘regain your honor’?”</p>\n<p>Zuko thinks about it. “No,” he says at length. “In fact, that might’ve been better. I would’ve realized how horrible he is a lot sooner.”</p>\n<p>“Then there you go,” Aang says. “I’m not saying you shouldn’t take responsibility for your actions. You should and you have. But you’re not the villain in this. That rests squarely on Ozai and Azula.” </p>\n<p>Zuko turns back to the cliff. He can’t accept that. </p>\n<p>Aang grabs his chin and pulls. “You’re our soulmate,” he says fiercely. “And you’ve been there for me when I needed you most. I know it usually wasn’t as dramatic as when you needed me, but it was still just as important. And now you’re teaching me firebending. Without you, we wouldn’t be anywhere near ready to fight the Fire Lord. And even if you weren’t a part of our mission, I’d still want to be your friend.” </p>\n<p>“You want to be friends with <em>everybody</em>,” Zuko complains. </p>\n<p>“Only the good people. And you are a good person, Zuko. And a great soulmate.”</p>\n<p>Zuko pulls away, letting his hair cover his face. The words are chipping away at him, and he knows he’s going to cry. Yet another thing he doesn’t need Aang to see. </p>\n<p>Of course, the kid lives to defy him, and pulls him into a hug. Zuko crumples, and is shaking as he returns it. Aang just holds him tighter, and doesn’t comment on the growing wet spot on his robes. </p>\n<p>--</p>\n<p>Aang might brush it off, but Zuko has no idea how to deal with his other soulmates. He sleeps alone in his room per usual and extends the next morning’s firebending practice so he can put off getting breakfast from the main area. </p>\n<p>But his avoidance tactics don’t work when, right before her training with Aang, Toph marches up to him, waving Sokka’s knife in his face. “You, me, soulbond. Let’s go.” </p>\n<p>Zuko snatches the knife. “You’ll stab someone’s eye out with that!” </p>\n<p>“Sparky, I throw fifty-pound boulders at people for fun. Now, are we going to do this, or are you going to continue to sulk and complain about the universe?”</p>\n<p>He hesitates. He has a ton of respect for Toph—he’s not an idiot, he knows she’s as tough as her element—but she’s also twelve. And he’s just as unwilling to show her his screwed up childhood as he was with Aang.</p>\n<p>But telling her not to do something is the only surefire way to get her to do it, so he switches tactics.</p>\n<p>“You sure you don’t want to wait?” he asks. “You’re going to be training with Aang in, like, two minutes.” </p>\n<p>“Exactly,” she says. “From what Aang told us, I’m going to be in the mood to beat something up as soon as we’re done.” </p>\n<p>He sputters. “What did he tell you?” </p>\n<p>She rolls her eyes. “He didn’t give us any of the juicy details. Just that you <em>really</em> downplayed the crappiness of your life. Oh, and that the Fire Lord’s planning on literally destroying the world in a few weeks.” </p>\n<p>Zuko grimaces. “Yeah.” </p>\n<p>Toph’s not done: “And then Katara asked how you knew that, and then Aang explained the meeting, and she got angry and all like, ‘Why didn’t he try to stop them’ and he said something like, ‘cause the last time he did that he got his scar, so please shut up and maybe don’t be such a bitch.’ I’m might be paraphrasing, but that’s basically how it went.” </p>\n<p>Zuko stares at her. “Aang defended me against <em>Katara</em>?” </p>\n<p>“Just because he’s stupidly in love with her doesn’t mean he won’t call her out when she’s being all crabby.” She makes grabby motions with the knife. “Now come on! Time’s a-wasting!” </p>\n<p>He sighs, but surrenders the knife. He doesn’t bother making the cut, just picks at the scab already on his hand. </p>\n<p>“By the way,” Toph says, pricking her palm. “It’s one for yes, two for no.” </p>\n<p>“What—”</p>\n<p>She grabs his hand. </p>\n<p>--<br>--</p>\n<p>When the light clears from his eyes and he sees Toph arguing with her parents, Zuko almost doubles over laughing. </p>\n<p>She looks so cute and pretty, all dolled up in a white, flowing dress with her hair oiled, even some makeup on her face, though she can’t be much older than seven, maybe eight. </p>\n<p>It’s hilarious. </p>\n<p>His humor quickly dissolves when he realizes what they’re arguing about. </p>\n<p>“But I can see fine!” she’s yelling at two equally well-dressed adults. Her parents. “Just not like you!” </p>\n<p>“Enough,” her father snaps. “This is not up for discussion. You will stay on the grounds at all times, where it’s safe.” </p>\n<p>Little Toph storms off. Where she stomps her feet, the earthen ground cracks. Her parents scold her, but she ignores them. </p>\n<p>--</p>\n<p>She tries to explain her sight again, this time to her earthbending master, Wu, a snooty gold-lover. Zuko wants to tear off his beard. </p>\n<p>He’s talking her through breathing exercises. Toph has had enough, and stands up. “We’ve been doing this for ages. Let’s do some actual bending.” </p>\n<p>She’s apparently already started her training with the badger moles, because she gets in a warrior stance and raises some very large rocks. </p>\n<p>Her master slams down his fist, and the rocks are pushed back to earth. “None of that! You’re not ready.” </p>\n<p>“But Master Wu—”</p>\n<p>“No. I will decide when you can advance to the next forms.”</p>\n<p>Toph pulls on her hair in frustration. Zuko is right there with her. </p>\n<p>--</p>\n<p>Toph runs away and ends up in a cave. She unleashes her anger in a slew of earthbending, throwing and crushing and smashing. It’s chaotic, and she’s only holding back enough to make sure she doesn’t cause a cave-in, but it’s the most out-of-control bending Zuko’s ever seen her do. She finally collapses, throwing her head into her knees.</p>\n<p>Zuko hesitates. Toph’s not like Aang. She doesn’t like people hugging or cuddling her. But she seems so alone right now, and by now Zuko’s gotten better at recognizing when he needs to observe his soulmates’ past and when he needs to act.</p>\n<p>So he puts a hand on her shoulder. </p>\n<p>Toph jumps and gets in a stance. “Who’s there?” </p>\n<p>...has she never had contact with a soulmate?</p>\n<p>Zuko tries again. Toph attacks with earthbending, but the rocks just pass right through him. He stays put. Toph is breathing hard, and scrambles at where he’s touching her shoulder, but obviously doesn’t come in contact with anything. This only makes her panic even more.</p>\n<p>That’s when he sees her marks. They’re on her left shoulder blade, usually hidden by her clothes. But she’d run from home wearing only her pajamas, which drape down her back in such a way that leaves her shoulder blades exposed. Zuko finds his mark and touches it, hoping she understands. </p>\n<p>She does, finally going still. “You’re...my soulmate?” </p>\n<p>\n<em>One for yes, two for no.</em>\n</p>\n<p>He taps once. </p>\n<p>She giggles. Zuko almost drops his jaw because he’s never heard her <em>giggle</em>. “You feel like sunshine.” </p>\n<p>He doesn’t have anything to say to that, so he doesn’t tap. </p>\n<p>Her amusement fades. “Everyone says that I shouldn’t do...anything. That I should just stay home and be safe.” </p>\n<p>He taps her twice, hard. <em>No.</em></p>\n<p>“You disagree?” </p>\n<p>\n<em>Yes.</em>\n</p>\n<p>She smiles. “Good.” </p>\n<p>--</p>\n<p>As soon as Toph returns home she’s grounded for running away, but she manages to get them to talk about soulmates. </p>\n<p>“I met one of them today!” she says. “You said I have five, right?” </p>\n<p>Her mother softens. “Yes, you do. And that’s good to hear.” </p>\n<p>“Can you tell me what the marks look like? So I can find them?” </p>\n<p>Zuko sputters. He forgets, sometimes, that she’s blind, so of course she can’t actually see the marks. But he’d have thought that someone—especially her own parents—would have told her what they looked like!</p>\n<p>“We’ll tell you when you’re ready to leave home,” her mother says. </p>\n<p>Toph’s face falls. She and Zuko both know that means “never.” </p>\n<p>When her mother bids her goodnight and leaves her bedroom, Zuko touches Toph’s back again. She straightens. “What?” </p>\n<p>He puts the tip of his finger on the soulmark that represents him, the golden flame, and traces it. He does it twice before she says, “A circle with squiggles? That’s you?”</p>\n<p>Close enough. He taps once.</p>\n<p>A hand passes through his, and he recognizes it as Brother’s. (Sokka’s?) Toph stiffens at this new touch, but in seconds, she grins. “That feels like a corner. Or half of a square.” </p>\n<p>Aang’s arrow is the only one she gets completely right. The others: Katara’s “squiggles” and Suki’s “half-circle,” well, it’s close enough. </p>\n<p>--</p>\n<p>Toph, Zuko realizes, is a lot like him growing up. She’s lonely. And she needs her soulmates.</p>\n<p>It’s a different kind of poison from what he was fed. His father went out of his way to hurt him, tear him down and turn him into the perfect little puppet. Toph’s parents go out of their way to shield her from the world. They have good intentions, but it means that Toph has no friends. She’s completely isolated and alone.</p>\n<p>So Zuko is there a lot. Way more than he was with Aang. He flits through her days, only able to be there a few minutes at a time. He hopes it’s enough. </p>\n<p>--</p>\n<p>Toph continues her secret, underground training. Zuko finds himself helping her. </p>\n<p>She’s good, especially considering the fact that she’s self-taught. But her stances are off. They’re too loose, too casual, not solid enough. She tries to clear a cavern hall filled with loose stone, but can only make a dent. </p>\n<p>It takes some trial an error, but after a bit of prodding, Zuko manages to get her to widen her stance, lower her body, and straighten her back, until it’s much closer to the forms she uses as a master. </p>\n<p>She tries to clear the hall again, and this time she’s successful. </p>\n<p>“Are you an earthbender?” she asks. </p>\n<p>\n<em>No.</em>\n</p>\n<p>“Shame. You’d be good at it.” </p>\n<p>High praise. Zuko almost glows. </p>\n<p>--</p>\n<p>She asks Zuko a lot of questions, trying to figure out who he is. </p>\n<p>“Are you a bender?” </p>\n<p>\n<em>Yes.</em>\n</p>\n<p>“Not earth, though. Water?”</p>\n<p>\n<em>No.</em>\n</p>\n<p>“Really? Fire?!”</p>\n<p>\n<em>Yes.</em>\n</p>\n<p>“Aren’t firebenders supposed to be evil, or whatever?”</p>\n<p>\n<em>No!</em>\n</p>\n<p>“But a lot of them are bad.” </p>\n<p>\n<em>Yes.</em>\n</p>\n<p>“...I guess a lot of earthbenders are bad, too.” </p>\n<p>\n<em>Yes.</em>\n</p>\n<p>“Humans suck, huh?”</p>\n<p>\n<em>Yes.</em>\n</p>\n<p>--</p>\n<p>“Are your parents as bad as mine?”</p>\n<p>Zuko hesitates. <em>No. Yes.</em></p>\n<p>“Um...one parent is good, one parent is bad?” </p>\n<p>\n<em>Yes.</em>\n</p>\n<p>“Is your mom the bad one?”</p>\n<p>\n<em>No!</em>\n</p>\n<p>--</p>\n<p>“Are you rich, like me?”</p>\n<p>\n<em>Yes.</em>\n</p>\n<p>“Heh. If the war ends when I’m an adult, my parents might marry me off to you.” </p>\n<p>\n<em>No!</em>\n</p>\n<p>“Aw, you’re gonna hurt my feelings.”</p>\n<p>--</p>\n<p>When Toph is ten, she runs away again, and wanders the city. She managed to get her hands on one of the servant’s outfits, so she blends right in. Around noon, she overhears a conversation about earthbender fighting and follows it to Earth Rumble Six. </p>\n<p>It’s like an Agni Kai, but with earthbending, and solely for the purposes of entertainment rather than settling matters of honor. (Or corporal punishment for children.) Toph watches the fights, looking like she’s struck gold. </p>\n<p>The reigning champion is a middle-aged woman who goes by the moniker Bitch. Literally. Her opponents have to get a lot more creative with their insults. She’s a solid wall of muscle and attitude. Zuko’s pretty sure Toph is in love. </p>\n<p>At the end, the emcee jumps into the ring with a bag of money. “I have two hundred gold pieces for anyone who can defeat the Bitch.” </p>\n<p>Crickets. Nobody is that stupid. </p>\n<p>Except Toph. She jumps right into the ring. “I will!” </p>\n<p>The emcee stares. Bitch turns away. “I don’t fight kids. Never mind blind ones.” </p>\n<p>Toph glares, and earthbends a rock right at Bitch’s head, smacking into the back of her skull. </p>\n<p>The crowd Ooooo’s. The emcee hastily jumps back onto his perch, and Bitch slowly turns around. “You sure you want to do this?” </p>\n<p>Toph smirks and gets into her stance. </p>\n<p>Bitch shrugs. “All right.” </p>\n<p>--</p>\n<p>Toph loses. </p>\n<p>Oh, she gives the champion a run for her money. The fight lasts almost a whole four minutes, which is a <em>very</em> long time to be attacking, defending, and dodging a single opponent. </p>\n<p>But, for all of her raw skill and self-taught lessons, it’s still Toph’s first fight, and Bitch is a master. Toph attacks and leaves an opening for half a second. Bitch takes it, and one well-placed rock later, Toph is thrown out of the ring, crashing into the ground. </p>\n<p>She groans, leaning back against the floor. She’s got a few cuts and a lot of bruises, though Bitch was very careful not to break any bones. </p>\n<p>Zuko waits a little bit, then takes Toph’s arm and pulls, trying to get her up. He’s pretty sure Snowflake (Katara? Or maybe Suki) is cooling the bump on her forehead, but she needs to get on her feet. </p>\n<p>“Leave me alone,” she groans, pulling her arm away. </p>\n<p>Zuko growls. So she lost a fight. Boo-hoo. She needs to learn to get back up and brush herself off. </p>\n<p>He’s pulling on her again when Bitch drops down in front of her. “What’s your name?” </p>\n<p>“Toph,” she says. </p>\n<p>“Not gonna lie, Toph: you did really good.” </p>\n<p>Toph blinks. “I lost.” </p>\n<p>Bitch shrugs. “Everyone loses their first fight. I lost my first twenty. You know the difference between champions and losers? Champions keep getting up.” </p>\n<p>Toph stares after her as she walks away. Zuko pulls her arm again. </p>\n<p>She gets up. </p>\n<p>--</p>\n<p>Toph fights in every Earth Rumble Six after that. She always challenges the champion, and loses a lot. Zuko pulls her to her feet every time. She gets laughed at, mocked, ordered to go home. She grits her teeth and shows up again and again. </p>\n<p>Finally, she starts winning. </p>\n<p>Not every match. First it’s one in roughly five. Then one in four. Three. Two. </p>\n<p>Finally, she’s asked to be a standard fighter. </p>\n<p>They ask for a name. She tells them, “Blind Bandit.” </p>\n<p>--</p>\n<p>The first time she loses in over a year, it’s to Aang. </p>\n<p>She leaves the fight pissed, and is even more pissed when he follows her home. She starts a food fight with him at dinner, and then goes to her room to change and sulk. </p>\n<p>Zuko gives her a moment, then starts pushing her to the door. </p>\n<p>By now she knows him pretty well, so even with minimal touching, she gets it right on the first try: “You want me to talk to them?” </p>\n<p>\n<em>Yes.</em>\n</p>\n<p>“Screw that! I oughtta punt them out of the city!” </p>\n<p>Zuko runs a hand through his hair, trying to think. Through the white fabric of her nightgown, he can see her soulmarks. </p>\n<p>It gives him an idea. He quickly locates Aang’s, Sokka’s, and Katara’s, and touches all of them. </p>\n<p>Toph stiffens. “Do that again.” </p>\n<p>He does, slowly. When she groans, he knows she understands. </p>\n<p>“Unbelievable,” she says, walking out of her bedroom to call a truce. </p>\n<p>--</p>\n<p>“My daughter is blind. She is blind and tiny and helpless and <em>fragile</em>. She cannot help you!” </p>\n<p>Zuko nudges Toph, away from her father, toward her soulmates. Because he’s had enough of this nonsense. </p>\n<p>So has she. She pulls free of her father’s grasp and says, “Yes. I can.” </p>\n<p>Watching her beat the crap out of all those earthbenders is the most fun Zuko’s had in a long time. </p>\n<p>--</p>\n<p>“I’ve let you have far to much freedom! From now on, you will be cared for and guarded twenty-four/seven.” </p>\n<p>“But, Dad!” </p>\n<p>“We’re doing this for your own good, Toph.” </p>\n<p>“They’re my soulmates!” she snaps.</p>\n<p>Everyone freezes. “How do you know that?” her father demands. </p>\n<p>“I have five of them. And one of them, Sunshine, he told me,” Toph says. “I’ll prove it.” She pulls at her dress, despite her parents’ protests for her modesty, to reveal the marks on her shoulder blade. </p>\n<p>“Cloudy eye!” Aang exclaims. “I can’t believe we missed that!” </p>\n<p>Sokka quickly undoes his glove and steps up next to Toph so he can show her parents the match. “Aang and Katara match, too. Looks like the universe is sending a pretty strong message here.” </p>\n<p>Toph’s father grits his teeth. “Absolutely not. I refuse to let my daughter get involved in your insane quests! Escort the Avatar out. He’s no longer welcome in our home.” </p>\n<p>Sokka is pushed back. The trio leaves with little resistance. </p>\n<p>“Sorry, Toph,” Aang calls. </p>\n<p>“I’m sorry, too. Good-bye, Aang.” </p>\n<p>--</p>\n<p>Toph knocks out the guard and runs away. Zuko’s only surprised she didn’t do it sooner. </p>\n<p>--</p>\n<p>Of course, they get into a huge argument, and she leaves the group almost immediately after joining it. Despite Zuko trying to stop her, she walks right through him.</p>\n<p>Only to run into Iroh. </p>\n<p>Zuko stiffens, watching his uncle make her tea and talk. </p>\n<p>His head is spinning. He had no idea these two knew each other. </p>\n<p>It hurts, seeing his uncle like this. Back when he risked so much to try to help Zuko, not knowing where he would end up. He’s glad when Toph leaves.</p>\n<p>--</p>\n<p>Toph can’t see in the desert. So when the library starts sinking, and the sandbenders come for Appa, there’s very little she can do. </p>\n<p>Zuko tries to help, anyway, tries to help her figure out which direction the thieves are coming from. But it’s no good. Even if that worked, she still has to hold up the library. Still has to decide between her soulmates and her friend. </p>\n<p>“I’m sorry, Appa,” she says, her voice breaking. </p>\n<p>--</p>\n<p>Serpent’s Pass, the Drill (“I can’t bend in there!” Zuko snorts. <em>Not yet.</em>), getting Appa back, breaking into the palace, getting the letter...</p>\n<p>Getting kidnapped. </p>\n<p>“Quit your banging!” Chit Tsu yells, slamming his fist against the cage. “You may think you’re the greatest earthbender in the world, but even you can’t bend metal.” </p>\n<p>Toph rests a hand against the metal. Zuko nudges her forward. She takes a deep breath and resumes pounding on the metal walls.</p>\n<p>Finally, she either hits hard enough or concentrates hard enough that she finds the tiny specks of earth that have been reforged over and over and over. She smirks. </p>\n<p>--</p>\n<p>When the team regroups with the Water Tribe warriors, get Aang settled, and plan their next move, Zuko gets to see Hakoda for the first time. </p>\n<p>The man very obviously cares about his kids, and goes a little pasty when he sees Aang’s injuries. He and Sokka put their heads together and make a plan to steal one Fire Navy ship in order to blend in.</p>\n<p>While everyone’s eating on the dock of said ship, dressed in Fire Nation reds, Hakoda turns to Toph. “I’m sorry, I don’t believe I caught your name.”</p>\n<p>“Oh, yeah!” Sokka gasps. “So, Dad, this is Toph. Toph, there’s one tiny little detail Katara and I forgot to mention about our tribe.” </p>\n<p>“You mean besides the fact that your favorite snack tastes like metal?” she asks, chomping into some seal jerky. </p>\n<p>Hakoda doesn’t take insult to this, just chuckles. “It is an acquired taste.”</p>\n<p>“Just dip it in the soup,” Katara suggests. </p>\n<p>“It’s about soulmates,” Sokka says. And now Hakoda’s looking at Toph with a lot more interest. “So, in the Water Tribe, soulmates are basically considered your brothers and sisters. Unless you’re dating them, obviously. But in any case, the parents of one soulmate pretty much adopt all the others. So, congrats! You’re part Water Tribe.” </p>\n<p>Toph makes a face. “I’m not calling anyone ‘Dad.’”</p>\n<p>Hakoda smiles. “I don’t expect that to happen right off the bat, or ever, if you’re not comfortable with it.” </p>\n<p>“Well, my <em>actual</em> dad tried to ‘protect’ me because he thought I was helpless and never let me go outside.” </p>\n<p>He makes a face. “Toph, this morning I saw you <em>metalbend</em> several Fire Nation soldiers’ armors and then chuck them into the sea. If anyone here is dumb enough to call you ‘helpless,’ they deserve the same treatment.” </p>\n<p>Toph laughs. And that’s settled.</p>\n<p>--</p>\n<p>After that, the only time Toph arguably needs Zuko’s help is when she’s an emotional mess and does all those scams, becoming “The Runaway.” But Sokka’s already on it. </p>\n<p>But then, the night before the eclipse, when everyone else is asleep, she turns over. “Sunshine? Suki? You there?” </p>\n<p><em>Yes.</em> He feels Guard brush against his fingers. </p>\n<p>“I’m not gonna lie: I’m a little scared for tomorrow. You think...you think you can be there with me?” </p>\n<p>\n<em>Yes.</em>\n</p>\n<p>--</p>\n<p>He goes through the eclipse again. His hand never leaves Toph’s shoulder. </p>\n<p>--<br>--</p>\n<p>Zuko wishes that destiny let him warn Toph ahead of time not to sneak up on past-him in the middle of the night, but after the eclipse, that’s it. He blinks, and he’s back in the present, holding Toph’s hand. </p>\n<p>She lets go, first. Then punches him in the arm. </p>\n<p>“What was that for?” he snaps. </p>\n<p>“It’s how I show affection,” she says. “This can’t be news to you. You literally named me after that.” </p>\n<p>She hands him the knife, and walks away. “Give that back to Sokka, would ya? I’m going to make a statue of Fire Lord Asshole and throw rocks at it with Aang.” </p>\n<p>Zuko snorts, but does as he’s been asked.</p>\n<p>He finds Sokka sharpening his sword in the main area and gives him the knife. Sokka studies it. “So...you wanna...”</p>\n<p>“Not yet,” Zuko says, dropping next to him. “This is exhausting.” </p>\n<p>“Yeah, I feel you.” He sheathes the knife. “Wanna spar? I could use some practice.”</p>\n<p>And since Zuko has nothing better to do, he agrees. </p>\n<p>Sokka’s pretty damn good with the blade. Zuko only just manages to win with his dao swords, to much whining. </p>\n<p>“This is so unfair! You can be good at firebending <em>or</em> swordbending, but not both!” </p>\n<p>“Swordbending?” Zuko echoes. “All right, that’s it. You’re not allowed to come up with anymore names.” </p>\n<p>“Why not?” Sokka asks. </p>\n<p>“Two words: Wang Fire. I can’t believe the headmaster fell for that!”</p>\n<p>Sokka strokes his chin like he has a beard. “It’s not the content of the lie. It’s the delivery.” He sheaths his sword. “Besides, you’re one to talk. I hear you’ve come up with some pretty ridiculous names as well.” </p>\n<p>Zuko blushes. “I have the excuse of being a child when I came up with them!” </p>\n<p>“What’s mine?” </p>\n<p>“Not telling.” </p>\n<p>“Aw, come on! I’m gonna find out eventually.” </p>\n<p>“Sure. But not right now,” Zuko says smugly.</p>\n<p>Sokka groans, but doesn’t push. Instead he says, with big, watery eyes, “Katara’s making me do laundry today. Help a soulmate out?” </p>\n<p>Zuko sighs, but agrees.</p>\n<p>--</p>\n<p>A few days pass. Everyone’s acting differently around Zuko, but it’s mostly a good different. Aang and Toph are looser around him. Before the soulmate reveal, they barely knew him. Now it’s like they’ve known him his whole life, because overnight, they have. And Zuko understands them a lot better now, too. Once he’s matched Feather with Aang and Punchy with Toph, it’s easier to let his guard down a bit and relax. </p>\n<p>Sokka’s also gradually warming up to him. Zuko suspects it has more to do with his unquenchable desire to crack fire, ex-bad guy, and soulmate jokes every four minutes, but it works. Even though they haven’t actually done the soulbond yet, you’d never guess from the way Sokka treats him: throwing his arm around Zuko’s shoulder as they forage or explore the temple, cracking jokes at his expense while ruffling his hair, even unashamedly using him as a heating pad during cold evenings. </p>\n<p>(Zuko felt incredibly awkward the first time Sokka plopped his head on his stomach with a sigh, but when Sokka asked him if he wanted him to move, Zuko said no. He liked the closeness, liked feeling needed. Important. Even if it was just to keep a slight chill away. It was almost enough to convince him to sleep with the rest of the group, but…yeah. Still not ready for that. Also, the nightmares are still a thing. He’s lucky to get five or six hours a night.)</p>\n<p>Then one evenings, while Zuko is handing out tea, Sokka asks to talk to him for a second. </p>\n<p>“So, what’s up?” Zuko asks, when they’re out of earshot of the others. He’s expecting Sokka to ask him to soulbond. </p>\n<p>But, no. Sokka asks about Fire Nation prisons. </p>\n<p>…why couldn’t it have been soulbonds?</p>\n<p>--</p>\n<p>They don’t do the bond during the ten-hour hot air balloon ride to the Boiling Rock, either. </p>\n<p>Zuko very hesitantly asks, “Why not?” </p>\n<p>“Because by not doing it now, we’re basically guaranteeing that we’re both going to survive this,” Sokka says. “Think about it: we both grew up with the other’s spirit from the future watching over us, right?” </p>\n<p>At Zuko’s slow nod, Sokka continues, “So, if we wait until after we break my dad out of prison, then we’re essentially guaranteeing that this mission will be successful. Because there’s no way the universe is going to let us die <em>before</em> we soulbond. It’s kind of a cosmic protection.” </p>\n<p>“But if you push it too far, then eventually one of us <em>does</em> die before we bond,” Zuko points out. </p>\n<p>“Which is why we should do it on our way back,” Sokka says. “Just...humor me on this one, okay? It’d make me feel better knowing for sure that we’ll both make it back even if I fail again.” </p>\n<p>And what else can Zuko do but agree?</p>\n<p>--</p>\n<p>Zuko hates to be the bearer of bad news, but he makes himself say it: “I asked around the lounge. There are no Water Tribe prisoners. I’m afraid your father’s not here.” </p>\n<p>Sokka collapses against the wall in front of him. “So we came all this way for nothing? I failed. Again.” </p>\n<p>“Ugh. What would Uncle say?” Because Zuko hates to see him like this. Whenever Zuko was chasing the group around the world, every time he saw Sokka—the non-bender, the one he naively thought of as the weakest—the warrior was always smirking, plotting, finding some way to fight back. It got to the point where Zuko saw him as just as powerful and determined as the Avatar. Seeing him now, utterly defeated, breaks something in Zuko’s chest. </p>\n<p>So he spouts out some crap about clouds that he thinks is supposed to mean <em>there’s always a silver lining to a bad situation</em>, and when he’s done, Sokka jumps to his feet. “It’s Suki!” </p>\n<p>--</p>\n<p>Zuko doesn’t recognize his final soulmate—story of his life—without her makeup. That makes him sound really shallow, but it’s the truth. </p>\n<p>After he’s discovered and taken as a prisoner, Sokka tells him where the three of them are going to meet, and he finds himself mopping next to her. </p>\n<p>“Oh, good. You guys have met,” Sokka says. </p>\n<p>“Actually, he and I met a long time ago,” Suki says testily. </p>\n<p>Zuko winces. “Yeah...sorry about that. Is your village okay?” </p>\n<p>She blinks, like she’s surprised he even asked. “Yeah, actually. There weren’t any casualties, and all the damage was repaired within a couple of months. So now you’re on our side?” </p>\n<p>“Yeah. I’m teaching Aang firebending.” </p>\n<p>“What made you decide to do that?” </p>\n<p>“The short version?” Zuko asks, making sure no one’s listening. “Turns out we’re soulmates.” </p>\n<p>Suki blinks again. She looks to Sokka, and at his nod, she shrugs. “Okay then.” </p>\n<p>And that’s that. </p>\n<p>They make a plan, other prisoners get involved, and Zuko finds himself freezing in a cooler. Thank Iroh for breath of fire. </p>\n<p>Then Sokka comes to get him, and they overhear the other guards. </p>\n<p>“...some war prisoners. Though I did hear there might be a pirate!” </p>\n<p>Sokka looks stricken. </p>\n<p>“War prisoners. Could be your father,” Zuko says. </p>\n<p>“I know.” </p>\n<p>And Zuko asks him what they should do. It’s less about the fact that it’s his father they’re talking about and more the fact that he now trusts Sokka. Maybe it’s the soulmate thing, or maybe it’s just because by now he knows that Sokka will always come up with the best possible plan. </p>\n<p>That doesn’t mean Zuko has to go along with that plan quietly. He questions it as they’re getting ready to leave, and hears the utter defeat in Sokka’s voice when he says, “Maybe sometimes it’s just better to quit before you fail.”</p>\n<p>And that is the <em>stupidest</em> thing Zuko has ever heard.</p>\n<p>So he talks Sokka into staying. And is unsurprised when Suki agrees to stay with them. Because soulmates don’t let soulmates break their dads out of prison alone.</p>\n<p>--</p>\n<p>Seeing Mai again...really sucks. Especially when she reads his break-up letter to him. </p>\n<p>“Stop!” he orders. “This isn’t about you! This is about the Fire Nation.” </p>\n<p>“Thanks, Zuko,” she says, throwing the letter at his head. “That’s makes me feel all better.”</p>\n<p>He takes a deep breath and stands. “They’re my soulmates.” </p>\n<p>Mai blinks. The soulmate thing has always been a prickly subject between them. Mai doesn’t have any. Zuko would die for his. </p>\n<p>“Who are ‘they’?” she asks. </p>\n<p>Zuko snorts. “Who do you think? The Avatar and his friends.” </p>\n<p>“So you’re choosing them over me. Is that it?” </p>\n<p>“I didn’t know it was them when I left,” he says. “But now that I do know, I don’t want to choose. I don’t think I should. I love you, I love them, I love our country. And I need to save all of them.” </p>\n<p>“Save it? You’re <em>betraying</em> your country!” she snaps. </p>\n<p>“That’s not how I see it.”</p>\n<p>--</p>\n<p>When they do finally get Hakoda, Chit Sang, and the warden onto the gondola (and Zuko makes a mental note to never pick a serious fight with Suki again; that was terrifying), who else should show up to ruin it all but his sister?</p>\n<p>The three of them get on top to fight them off. Sokka and Zuko find themselves pitted against Azula. </p>\n<p>Suki watches their backs. </p>\n<p>It feels right.</p>\n<p>--</p>\n<p>It’s not until they’ve stolen Azula’s airship and are several miles away from the Boiling Rock that they all breathe a sigh of relief. </p>\n<p>Most of them start to relax. Not Zuko. Not only can he never relax so soon after a fight, but this airship is designed to be run by firebenders. He and Chit Sang take shifts keeping the fire in the ship’s belly running. It wouldn’t do to die in a crash so soon after escaping prison. </p>\n<p>At one point during his shift, Sokka comes down. “Hey. Dad’s at the helm. Suki and I are about to go to sleep.” </p>\n<p>“Good,” Zuko says. </p>\n<p>“So...you should probably get some sleep, too?” Sokka tries. </p>\n<p>He shakes his head. “I never sleep after a fight. Too wired.” And he’s been burned too many times. Too many people waiting to strike. He can’t ever let his guard down until he’s truly safe. He’s also pretty sure he’s going to get some bad nightmares as soon as he closes his eyes.</p>\n<p>Also, he can’t stop thinking about Mai. </p>\n<p>Mostly, he can’t stop thinking about Mai. </p>\n<p>“I’ll sleep when we’re back at the Temple,” he says. </p>\n<p>“You haven’t slept, like, at all,” Sokka argues. </p>\n<p>Zuko shrugs. </p>\n<p>He sighs. “Fine. Well...” </p>\n<p>“You got the knife?” Zuko asks on a whim. </p>\n<p>Sokka pauses, then smiles. “Yeah.”</p>\n<p>--<br>--</p>\n<p>It takes Zuko much longer to blink the light from his eyes than it usually does, and he realizes why soon after. The village has been covered by a thick layer of fresh, bright snow. </p>\n<p>It’s much bigger than the one time Zuko came, looking for Aang. There are more people, there are houses made of ice rather than tents made of pelts, and there’s laughter all around him. </p>\n<p>Children are playing in the winter wonderland. Women are cooking delicious-looking spiced meat. Men are doing a variety of tasks: sharpening weapons, building houses, chatting. </p>\n<p>Sokka can’t be older than seven, and even now, he’s a strategist. He, Katara, and several other young children are having a snowball fight. It seems to be boys against girls. Sokka’s built himself a crude fort for cover with a house at his back so no one can sneak up on him. </p>\n<p>He throws a ball at Katara, only about five years old and absolutely adorable. She shakes the snow from her face and glares at her brother, who’s sticking his tongue out. </p>\n<p>Then she hold up her hands and pulls. </p>\n<p>The snow on top of the house Sokka is in front of falls on top of him. </p>\n<p>“Ha!” Katara shouts. </p>\n<p>Sokka pops his head out of the pile of snow. “How’d you <em>do</em> that?” </p>\n<p>“Do what?” a woman asks, coming around the corner. Zuko sees the resemblance—and the necklace she’s wearing—and realizes this is their mother. </p>\n<p>“Katara moved the snow with her <em>mind</em>,” Sokka complains, pulling himself out of the snow. “That is not fair!” </p>\n<p>“What?” She looks at her daughter. “Katara, can you do it again?” </p>\n<p>Katara looks uncertain now, especially now that all the other children at looking at her. But with her mother’s gentle encouragement, she raises her hands again. This time, Sokka’s entire fort gets knocked down. </p>\n<p>“Hey!” he sulks. </p>\n<p>Their mother brightens. “Katara, I think you’re a waterbender!” </p>\n<p>Of course, that catches the attention of the entire village, and soon, Sokka is forgotten. Zuko sees this, winces at the boy’s dejected look, and moves to try to comfort him. </p>\n<p>Hakoda beats him to it. Which is good, because Zuko kind of sucks at the whole comforting thing. </p>\n<p>“You know, your mother was talking about wanting to cook tuna for dinner tonight,” he says, steering Sokka away from the crowd flocking around his sister. “Why don’t you and I go fishing?” </p>\n<p>This immediately cheers him up. “Okay!” </p>\n<p>--</p>\n<p>Zuko tries very, very hard not to be jealous. He fails. </p>\n<p>Hakoda is just...such a good dad. He makes it very clear to Sokka that just because Katara is a bender, that doesn’t mean they’re going to suddenly stop loving Sokka, and he does this with both words and actions. His wife Kya does the same, although it’s pretty clear that, as much as Sokka loves his mother, he’s definitely closer to his father. Even though Hakoda’s the chief of the village and very busy making sure things run smoothly, he always sets aside time for his children.</p>\n<p>Don’t get him wrong: Zuko is very happy for Sokka and Katara. He’s <em>thrilled</em>. If anyone of their soul family is going to have the tormented childhood and abusive parents, Zuko wants it to be himself. He doesn’t want anyone, never mind his soulmates, to have to go through what he did. And it kills him a little to know that, while he’s watching these loving family moments, Sokka’s stuck in his fucked-up past.</p>\n<p>That doesn’t mean he can’t help but wonder: if Ozai was a fraction of the father—a fraction of the <em>man</em>—that Hakoda is, both Zuko and the Fire Nation would have been much better off. </p>\n<p>Zuko watches Hakoda teach Sokka how to use a boomerang. “This is because it’s my mark on Katara, right?” Sokka asks, throwing it and waiting for the rebound.</p>\n<p>“That’s right.” </p>\n<p>“What about the other people?” Sokka asks, pulling up his sleeve so he can look at the marks on his arm. </p>\n<p>“Head’s up, Sokka.” </p>\n<p>He looks up, and ducks just in time. The boomerang flies past his head and ends up in the snow. </p>\n<p>Hakoda chuckles, getting the boomerang and wiping off the snow. “Those are your other soulmates. You’ll meet them someday.” </p>\n<p>“I thought they’d be my other brothers and sisters,” Sokka says. </p>\n<p>Hakoda chokes on a laugh, kneeling in front of his son. “Could be, but probably not. Your mother and I are perfectly happy with two children.</p>\n<p>“But in a way, those marks <em>are</em> your siblings. They’re going to be some of the most important people of your life: your best friends, maybe even a girlfriend.” </p>\n<p>Sokka makes a face at the mention of a girlfriend. “Do you have soulmates?” </p>\n<p>“Mm-hm.” Hakoda unbuttons his jacket, then pulls down his shirt collar enough to reveal two marks, one on either side of the hollow of his throat. “The spear is Bato. The feather is your mother.” </p>\n<p>“Weren’t you and Uncle Bato raised like brothers, even though you aren’t brothers?” Sokka asks. </p>\n<p>“Bato’s parents died when he was little. Because he’s mine and Kya’s soulmate, it fell to one of our parents to take care of him. My parents took him in because they had more room. Like I said, your soulmates are sort of like your siblings. In that sense, I would be like their father, too. It’d be my responsibility to look after them.” </p>\n<p>Sokka looks at his own marks again. His thumb brushes against the golden flame. Zuko’s mark. “What if they’re not Water Tribe? What if...what if they’re Fire Nation?”</p>\n<p>Hakoda taps his chin. “Well, it’s been a long time since anyone in our tribe has had soulmates from anywhere else. But it has happened before. They’d just become honorary tribe members, and they’d still have to put up with me. Firebender or not.” </p>\n<p>--</p>\n<p>Dread pools in Zuko’s stomach when, as Katara and Sokka play one day, the snow turns black. </p>\n<p>“I’m going to find Mom.” Katara runs off toward their house.</p>\n<p>The Fire Nation ships land. Zuko recognizes the Southern Raider flags and tucks that information away for later. </p>\n<p>This fight goes much differently than when Zuko attacked the village. Even though the Water Tribe warriors are badly outnumbered, they manage to repel the bulk of the force. Sokka throws a snowball at one and, even at eight years old, he runs out to help. </p>\n<p>All the soldiers retreat. </p>\n<p>Sokka’s shoulders sag in relief. The warriors around him, those old enough to know better, are still tense and confused. </p>\n<p>Then Bato takes Sokka by the shoulder, grief in his eyes. “Come with me.” </p>\n<p>The man leads Sokka to his house, not Hakoda’s. The chief and Katara are already there. Katara is a mess, and as soon as she sees Sokka, she launches herself at him, sobbing.</p>\n<p>“What happened? Are you hurt?” Sokka asks, holding his sister. He looks to Hakoda, who has tears in his eyes and is staring at the ground. His knuckles are pressed against where Kya’s mark is on his chest. “Where’s Mom?” </p>\n<p>Neither of the men move, or speak. They’re in shock, Zuko realizes. The pain of losing a soulmate is too much. </p>\n<p>Katara’s the one who blubbers it out, explains that a Fire Nation soldier got into their house, that she saw him interrogate their mother before Kya sent her away, and by the time Katara came back with Hakoda...</p>\n<p>They stay in that house for a long time.</p>\n<p>--</p>\n<p>For about a week, the village is in shock. Life goes on as usual, but it’s subdued. They hold a funeral for Kya, burying her in a circle of stones. Hakoda doesn’t speak. Sokka and Katara don’t say much of anything, either. Their grandmother can’t even get out of bed, she’s so depressed by the death of her daughter. </p>\n<p>Zuko doesn’t know how he can help. If he even should help. It was his people who took Sokka’s mother away. And even if it wasn’t, Zuko’s not really the comforting type. The best he can do is keep someone warm when they’re cold, but so far the thick Water Tribe clothing has been doing that for him. </p>\n<p>He stays away.</p>\n<p>After about a week, Katara pokes Sokka awake. “Come on. We’re going fishing.” </p>\n<p>Sokka blinks. “Wha?” </p>\n<p>“Fishing. We’re out of food. Dad won’t go, and neither will Bato. So we’ve gotta get it.” She pokes him again. “Fishing. Now.” </p>\n<p>Sokka groans. But he gets up.</p>\n<p>They go fishing. At eight and six, they’re not exactly experts, even though Hakoda’s taught Sokka the basics. They plop a line in the water, sit in the snow, and wait. </p>\n<p>“So...how are you?” Sokka asks. </p>\n<p>Katara looks down. “I miss her.” </p>\n<p>“Yeah. Me, too.” </p>\n<p>She takes a deep breath. “She wouldn’t want us to be like this, though.” </p>\n<p>Sokka smiles, and nudges her shoulder. “No. But don’t think you can be the boss of me.” </p>\n<p>And that’s how it goes. Katara pulls the family together. It jolts Hakoda, Bato, and Kanna out of their grief enough that they start moving again. </p>\n<p>Zuko watches all of this without once letting Sokka know that he’s there. He’s pretty sure that destiny just wants him to observe, for now. </p>\n<p>That is, until twelve-year-old Sokka, out on a hunt with his father and a couple other adults, gets separated from them. </p>\n<p>And then a blizzard hits. </p>\n<p>The snow and wind are so thick that it’s impossible to find adequate shelter. So Sokka makes it himself, by digging a little cave into a mound of snow. He crawls inside, shivering as the temperature gets lower and lower. He’s protected from the wind and falling snow, but without a fire, he’s still in danger of freezing to death.</p>\n<p>As soon as Sokka is settled, curling into a ball to conserve warmth, Zuko moves. He positions himself so that his fire-infused spirit is touching as much of Sokka as possible and holds him.</p>\n<p>Sokka jerks, startled a little. “W-Wha...”</p>\n<p>Zuko uses his fingers to press the spot on Sokka’s arm where his soulmark is. </p>\n<p>Sokka sucks in a breath. “F-figures you’d be a—a friggin’ fire bender.” </p>\n<p>Zuko wishes they had to a way to tap out <em>sorry.</em></p>\n<p>The blizzard rages for several hours. Zuko keeps him warm the whole time, listening to him talk, watching him sharpen his boomerang, watching him sleep. He pokes him awake when the storm clears. The shelter is almost completely buried, the entrance Sokka carved out shrunken to a tiny hole. He digs himself out and brushes the snow from his clothes. He looks around. The tundra looks the same all around as far as Zuko’s concerned, but Sokka manages to get his bearings and start walking. </p>\n<p>It takes him over an hour to get to the village. As soon as he’s spotted, he’s swarmed. </p>\n<p>“Sokka!” Hakoda pushes his way through the crowd and all but crushes his son in a hug. “You’re all right!” </p>\n<p>The boy beams. “Hey, Dad.” </p>\n<p>“I knew it!” Katara is right behind their father. “I knew you were okay! Your mark didn’t fade at all!”</p>\n<p>“How?” Hakoda demands, pulling back just enough so he can look him up and down for injuries or frostbite. </p>\n<p>“Well, I made a shelter in one of the snow mounds,” Sokka says. He scratches the back of his neck. “And then...well, I’m pretty sure our soulmate showed up.” </p>\n<p>Katara brightens. “Which one?” </p>\n<p>“A new one. The fire guy.” Sokka grows a little more nervous. “He...might be a firebender?” </p>\n<p>The people still. The last fire raid is still fresh on everyone’s mind. </p>\n<p>“It makes sense,” Gran-Gran says after a pause. “Benders’ spirits have always been different. Waterbenders are cool, airbenders are flighty, earthbenders are tough and solid, and firebender spirits are warm.” </p>\n<p>Even though he’s invisible, Zuko feels extremely self-conscious as the tribe goes through several different emotions. They’re obviously relieved Sokka’s okay, but they do not like the prospect of not one, but two children of <em>their</em> tribe being bound to a firebender. </p>\n<p>“Hey, he saved Sokka,” Katara defends, looking up at all the adults around her as if daring them to defy her. “So he can’t be a bad guy.” </p>\n<p>Zuko wants to laugh. <em>Just wait until you meet me. You’ll change your mind real quick.</em></p>\n<p>--</p>\n<p>Sokka and Katara decide to do their soulbond. Zuko wonders why he’s supposed to watch until after it’s done. </p>\n<p>“Okay, so now we need to set up codes,” Sokka says. </p>\n<p>“Codes?” Katara repeats. </p>\n<p>“You know, a way to communicate! Since we can’t talk to each other like that but can still touch.” </p>\n<p>Zuko wants to smack himself. It’s brilliant, and he feels like an idiot for not thinking of it himself. </p>\n<p>This communication is much more complex than the “one for yes, two for no” that Toph went by. Sokka and Katara manage to come up with codes for yes, no, danger, I’m here, safe, and several others. </p>\n<p>And now Zuko—and he imagines Aang, Toph, and Suki—also know.</p>\n<p>--</p>\n<p>While the South Pole is isolated from the rest of the world, this is not absolute. They do get the odd trader and messenger. One of them is from the Earth Kingdom. </p>\n<p>Sokka is thirteen, Katara eleven, when a messenger from the Earth King himself comes to the village. He has a private meeting with Hakoda, but it doesn’t stay private for long. </p>\n<p>The war against the Fire Nation is going badly. The Earth Kingdom is on its last legs. Ba Sing Se, Omashu, and the North Pole are the only strongholds left. The Earth King needs soldiers. </p>\n<p>Hakoda does not give an order. He puts it to a vote. Leaves it to the men of the tribe to determine what’s more important: staying home where it’s safe, or going out into the world to try to make a difference. </p>\n<p>It doesn’t take a whole lot of convincing. The warriors understand. The Fire Nation invaded their village just a few years ago. They invaded them again decades prior to eradicate their waterbenders. They’re not going to stop until someone makes them stop. </p>\n<p>Sokka tries to go with them. Hakoda says no, and leaves him to defend the tribe. </p>\n<p>He hugs both his children good-bye, and tries to lighten the mood a little. “I’ll keep an eye out for anyone with your marks.” </p>\n<p>As everyone watches the ships leave, Zuko taps on Sokka’s shoulder the message for <em>I’m here</em>. It’s the best he can do.</p>\n<p>--</p>\n<p>Zuko has to save Sokka from the cold again when the idiot falls through the ice a few months later while out fishing. </p>\n<p>“Go away,” Sokka groans, struggling to get to his feet. </p>\n<p>Zuko stays. The blizzard was bad enough. Getting drenched in cold water here is deadly. </p>\n<p>“’S your fault,” Sokka slurs. “Stupid fire war.” </p>\n<p>Zuko winces. He still stays with Sokka as the boy marches to the village, and collapses as soon as he’s seen. Katara and the adults carry him inside, strip him down, and drop him in front of a fire. </p>\n<p>Katara takes over body heat, snuggling with her brother under a heavy fur blanket. As soon as he knows they’ve got it, Zuko slips out. </p>\n<p>--</p>\n<p>They find Aang and go with him around the world. Zuko finds himself acting less as a heating pack and more as a danger-alert system. Often against himself. </p>\n<p>When they do make it to the North Pole, Zuko is completely unprepared to deal with Yue. Sokka had said his first girlfriend had turned into the moon, but “girlfriend” means a lot of different things, and rarely means “one of the greatest loves of my life.” Especially the first girlfriend. </p>\n<p>Yue is very different. Sokka is head-over-heels in love, and while his efforts to distance himself from her are valiant when she’s engaged to someone else, it’s not enough. </p>\n<p>He’s crushed when she dies and cries himself to sleep that night. Zuko does nothing. If he hadn’t captured Aang, forcing the group to follow him, maybe Zhao wouldn’t have been able to kill the moon spirit. </p>\n<p>--</p>\n<p>Sokka’s well-hidden feelings of insecurity get worse when Katara masters her bending. He does a very good job of hiding it with arrogance, but Zuko can see it clear as day. Because he has felt the same thing with his own sister. </p>\n<p>Granted, Katara is a much, <em>much</em> better sister than Azula could ever be. Her bending is incredible, and she uses it a lot, but she never shows it off, and never uses it as a tool against Sokka. </p>\n<p>Aang is much the same, as is Toph when she joins. Three of the world’s most amazing, powerful benders. And Sokka. </p>\n<p>“I didn’t count you. Not being a bender and all.” </p>\n<p>“I can still fight!” </p>\n<p>“Okay. Three on three-plus-Sokka.” </p>\n<p>It comes to a head when they’re hiding out in the Fire Nation, waiting for the eclipse. The three benders effortlessly save a village from getting burned from the fire caused by a meteor, and Sokka can do absolutely nothing. </p>\n<p>The group tries to make him feel better. Zuko wants to help, but he can’t. He’s part of the problem. His very touch would remind Sokka of his bending. So he stays back. </p>\n<p>He’s floored when Sokka ends up getting tutored by Piandao. </p>\n<p>And again when it turns out Piandao is a member of the Order of the White Lotus. </p>\n<p>Curious...</p>\n<p>--</p>\n<p>“Dude. Run,” Zuko says. Not that Sokka can hear him. Even if he could, he’d be ignored. <br>“Where. Is. Suki?” Sokka snarls. Azula just smiles at him. </p>\n<p>—</p>\n<p>At the Western Air Temple, Sokka goes out foraging by himself. </p>\n<p>Zuko’s not sure when this is. Probably after he’s joined the group, but is it before they knew he was their sixth, or after? </p>\n<p>He notices the edge of the cliff being too unstable and quickly punches <em>danger</em> to Sokka. The boy jumps just as the cliff gives way, and scrambles onto safer ground. </p>\n<p>“Thanks,” Sokka mutters. Zuko pats his shoulder and leaves. </p>\n<p>“Wait,” he blurts. “Can we talk?” </p>\n<p>Frowning, Zuko taps <em>Yes.</em></p>\n<p>“So you know that our big plan is to defeat the Fire Lord and Fire Nation before they can win the war with the comet, right?” </p>\n<p>\n<em>Yes.</em>\n</p>\n<p>“…and that doesn’t bother you?” </p>\n<p>\n<em>No.</em>\n</p>\n<p>He narrows his eyes. “Why not?” </p>\n<p>Hm. How to tap that with the limited vocabulary he has. He settles on <em>danger</em>, slowly. </p>\n<p>Sokka’s quiet for a long moment. Then he says, “Thanks for saving my life. Twice. At least. I don’t think I ever said that.” </p>\n<p>Zuko blinks. He didn’t know what to say or how to respond to that, so he just awkwardly pats Sokka on the back. </p>\n<p>The warrior snorts. “You’re such an awkward turtleduck.” </p>\n<p>--</p>\n<p>Zuko doesn’t know why he has to see any more of the Boiling Rock. He was already here!</p>\n<p>But no, destiny will have its way. He finds himself watching Sokka slip into Hakoda’s cell, helmet on. “Thank goodness you’re okay!” </p>\n<p>Hakoda is on his feet in a heartbeat, fists up. “If you take one step closer,” he growls, “you’ll see just how ‘okay’ I am.” </p>\n<p>Zuko sucks in a breath. <em>It’s not Ozai. It’s Hakoda. He’ll never hurt Sokka. It’s fine. It’s FINE. It’s not Ozai. It’s—</em></p>\n<p>Sokka takes off his helmet. “Dad, it’s me.” </p>\n<p>The aggression immediately drops. Hakoda even tears up as they hug. Zuko sags with relief. </p>\n<p>They sit against the wall, and Sokka gives him a run-down of their situation. “And you know Prince Zuko?” he asks. </p>\n<p>“The son of the Fire Lord? I don’t know him, but I know of him,” Hakoda says, and Zuko cringes a little. He’s not sure he wants to know what kind of stories Hakoda’s heard. </p>\n<p>“Well, he’s here, too.” </p>\n<p>“Sounds like a major problem.” </p>\n<p>“Actually, he’s on our side now.” </p>\n<p>Hakoda makes a face, kind of similar to the ones Katara keeps throwing at him. Zuko can’t help but feel insulted.</p>\n<p>“I know. I had the exact same reaction,” Sokka admits. “After all he’s done, it was hard to trust him. But he’s really proven himself and I never would’ve found you without his help.” </p>\n<p>Hakoda tips his head. “Well, if you’re sure...” </p>\n<p>“He’s also our sixth. The fire guy.” </p>\n<p>Hakoda blinks. “<em>Really?</em> Wait, then why was he on your tail all this time?” </p>\n<p>“He didn’t know,” Sokka says. “His grandpa burned off his marks right after he was born.” </p>\n<p>The next moment would be kind of funny in any other circumstances. Hakoda’s face completely shuts down, like the words just don’t make sense to him. It takes several heartbeats for it to register, and when it does, it’s followed by anger and grief. “Shit.” </p>\n<p>“Yeah,” Sokka says. “He was pretty beat up when we tested it with him and Aang. I’m pretty sure he thinks he still has to make it up or something.”</p>\n<p>Hakoda’s eyes narrow. “You didn’t guilt him into helping you, did you?” </p>\n<p>“What? <em>No!</em>” Sokka looks horrified at the very idea of doing that. “I actually planned on going on my own. He caught me sneaking out and insisted he come with. He wouldn’t listen to me when I said that it was all my fault you were stuck here in the first place and that it was my responsibility to get you out.” </p>\n<p>Hakoda’s face softens, and he puts an arm over his son’s shoulders. “Sokka. Nobody blames you for the invasion failing. Even the best strategies sometimes don’t go through. And while I cannot begin to tell you how glad I am to see you, it was never your responsibility to get me out. Me, Bato, the others, we would have all happily stayed in prison until the end of the war if it meant you and your soul family were safe and able to fight another day.” </p>\n<p>Sokka’s lip trembles. Hakoda pulls him into a hug. Then everything turns white.</p>\n<p>--<br>--</p>\n<p>Sokka reels back from him and swears, pacing up and down the length of the room. Zuko winces a little. “Er...sorry about that.” </p>\n<p>“No!” Sokka rounds on him, jabbing a finger in his direction. “Nu-uh. You do not get to apologize for any of that. You’ve already apologized enough. Just...spirits, Zuko! Your dad is the literal incarnation of evil and if I ever get my hands on him Aang won’t even have to fight him...” </p>\n<p>He goes on like this for a while. Zuko presses his thumb against the cut on his palm, stemming the bleeding as his listens with half an ear. He’s more bemused than anything else. </p>\n<p>Finally, Sokka calms down. They sit next to each other against the wall. </p>\n<p>“Sorry,” he says. “I was kind of a dick to you.” </p>\n<p>Zuko shrugs. “You had a pretty good reason.” </p>\n<p>“No, I didn’t. You saved my life, and I never thanked you for it until last week.” </p>\n<p>He shrugs again. He notices Sokka’s hand is still bleeding and bandages it. Sokka lets him work in silence before saying, “So, you couldn’t hear it, but I was kind of squealing like a little girl when you finally told Ozai where to shove it.”</p>\n<p>Zuko bursts out laughing, almost falling over. He’s not sure why he finds it so funny—it’s not—but he does. </p>\n<p>When he recovers, he notices that Sokka looks rather pleased with himself. But then he sobers. “So, uh, you probably saw already. But you know how in the Water Tribe...” </p>\n<p>“That Chief Hakoda is basically planning on adopting all of us?” Zuko asks. “Yeah. Don’t get me wrong: he’s a great dad. But I’m just...not ready for that. At the very least, I need to find my uncle first.” </p>\n<p>Sokka groans. “They’re <em>both</em> gonna adopt us.” </p>\n<p>“Yeah,” Zuko says, trying not to think about his uncle. While he’s positive Iroh will want nothing to do with <em>him</em>, he also knows that Iroh won’t hesitate to open his heart and home to the rest of Team Avatar. He’s already helped them several times. And they deserve him.</p>\n<p>Sokka flicks his ear. “None of that.” </p>\n<p>“None of what?” Zuko asks, cradling his ear. </p>\n<p>“That’s your ‘I am such a horrible human’ look and I don’t like it. So it’s no longer allowed.” </p>\n<p>“I don’t think it’s that easy, Sokka.” </p>\n<p>“No, but it’s a start.” He stands up, stretching. “All right, I’m going to bed. Don’t let us crash and die.” </p>\n<p>“You got it,” Zuko says, watching Sokka—watching Brother—leave.</p>\n<p>Zuko remembers that he hasn’t slept in three days after they land at the Air Temple. </p>\n<p>Katara is thrilled to have her father back (even though she still doesn’t give Zuko the time of day), and all of the team members are happy to have their final soulmate back, safe and sound. They get a fire started, heat up a stew, and Sokka fills everyone in.</p>\n<p>Zuko sits between Aang and Suki, listening to her, Sokka and Hakoda take turns telling the tale. When Suki learns that Hakoda ran into her fellow warriors at a previous prison, she demands to know what's become of them, and is obviously relieved and pleased to hear that they're alive and getting along with several other prisoners.\nThe storytelling is a Water Tribe tradition, as the father and son play off of each other beautifully, drawing out the tension and describing the fights and prison in dramatic detail. He remembers seeing similar scenes in cozy Water Tribe tents in the South Pole as Gran Gran, Bato, and several others entertained children and adults alike with tales of fantasy and whimsy. </p>\n<p>Zuko lets their voices wash over him. He wants to sleep—needs to sleep—but really, really doesn’t want to leave to go to bed in his cold, dark room. He feels safer and more at home here than he ever has in his life, and that’s including when he had his mother! </p>\n<p>Eventually the voices kind of blur and fade in the background as he nods off, still sitting up and hunched over his empty bowl. </p>\n<p>He rouses just a little when he feels the bowl being removed from his limp fingers, and feels a hand on his back. Normally, he would blast fireballs first, ask questions later. But he knows that hand, even if he’s too tired to remember her actual name. </p>\n<p>Guard gently lowers him to the ground, and his head gets pillowed in a lap. This is much more comfortable than sitting hunched like a gargoyle. Calloused fingers scratch his scalp, and damn that feels good. He hums, and drifts off to sleep. </p>\n<p>--</p>\n<p>The next morning, he’s a little concerned. </p>\n<p>He’s been dog-piled. Toph is using his legs as a foot-stool, which is practically cuddling for her. Sokka is on Zuko’s other side, snoring in his ear and sharing his pillow. </p>\n<p>Oh, and his pillow is Suki. </p>\n<p>She’s asleep like everyone else. One arm is behind her head as a makeshift pillow. The other is in Zuko’s hair.</p>\n<p>...shouldn’t she be doing this with Sokka? Or at least <em>not</em> Zuko?</p>\n<p>It’s a damn good thing he didn’t get any nightmares last night. Any movement would have woken all three of them, any noise would have woken <em>everyone</em>.</p>\n<p>The sun is just starting to rise, which is when he usually wakes up, anyway. He carefully extracts himself from everyone, hoping the shadows hide his blush, and goes to relieve himself before waking up Aang for his lesson. He also changes out of his prison clothes into something a little more his speed, and feels guilty for it. Suki, Hakoda, and Chit Sang will be stuck in their rags if the group doesn’t do something about it. He decides to see if they can go into a nearby village later. </p>\n<p>He pulls Aang out of bed, into their usual training courtyard, and they get to work. </p>\n<p>About an hour into their lesson, they start to draw a crowd. Sokka likes to watch most bending lessons. Earlier, Zuko assumed it was because he was bored and/or liked cracking jokes at their expense. Now, after the soulbond, he’s positive it’s that, <em>and</em> Sokka is analyzing their firebending technique, figuring out how he as a non-bender can defend against it. </p>\n<p>But it’s not just Sokka. Suki and Hakoda show up, too. They spend half of the lesson watching, half of it talking amongst themselves. Zuko ignores them, focusing on correcting Aang’s form. Aang does a few of the same mistakes Zuko did when he was first learning firebending. But rather than berate, smack, and/or burn him like what the sages did to Zuko, the prince nudges, critiques, and occasionally shouts if it’s a particularly dangerous mistake. He tries to remember to praise him at least once every lesson, too. That doesn’t come naturally to him, but Aang soaks it up like a sea sponge. </p>\n<p>The first lesson after their soulbond, Aang gave him the most formal bow he’d ever seen and said, “You’re a really great teacher, Zuko. Thank you.” </p>\n<p>Zuko blushed and just pushed him to the main courtyard for breakfast. Being called “Sifu Hotman” after that was almost a relief. </p>\n<p>Now, they’re wrapping up, Aang having finally gotten the hang of a particularly difficult firebending move, when Suki asks, “Hey, Zuko, can you do that again, from the other angle?” </p>\n<p>“Why?” he asks. </p>\n<p>“Because I want to see how I would defend against it,” she says. Sokka and Hakoda, who had been talking to each other, now fall silent, watching with interest. </p>\n<p>Zuko shrugs, turns so she has the other angle, and repeats the move. When the flames fade away and he looks up, Suki has a calculating look on her face. “One more time.” </p>\n<p>He obeys. Then she stands in front of him, getting in a stance. “And again.” </p>\n<p>“Whoa, what?” he asks, stepping back. “Nuh-uh.” </p>\n<p>“You won’t hurt me,” she says. </p>\n<p>“And in the very likely scenario that I <em>do</em>?” he demands. He’s put his soulmates through a lot of pain, but at least he’s never actually burned them! </p>\n<p>“Worst case scenario, Katara’s right around the corner,” Suki says. </p>\n<p>“Yeah, and she’ll probably kill me,” he mutters. </p>\n<p>Suki doesn’t respond to that. She’s just got this look of utter confidence. Zuko remembers how she fought her way through a dozen firebenders to get to the warden and sighs. “Okay.” </p>\n<p>He gets into the stance, fire curls at his fingertips, he moves his fist forward to punch—</p>\n<p>Suki smacks his wrist aside, steps into his space and palm-strikes his chest, sending him crashing to the ground. </p>\n<p>For a second, everyone just stares. </p>\n<p>Suki smirks, getting back in a ready stance. “Don’t tell me you’re quitting now, firebender.” </p>\n<p>Aaand it’s on. </p>\n<p>Sparring Suki—yes, with firebending—is kind of similar to sparring Ty Lee, in that Suki is constantly moving, diverting attacks rather than blocking, and going after his soft, squishy parts. She gets in a few good hits, and so does he (not burns, though; never burns). </p>\n<p>He’s not entirely sure if this fight means anything. It could be Suki trying to get some sort of revenge, using the old sparring excuse to punch him a few times. It could also just be totally innocent I’m-a-non-bender-and-need-to-know-how-to-defend-myself-in-case-Zuko’s-crazy-sister-shows-up-again training session. Either way, he’s really enjoying himself. And from the look on Suki’s face, she is, too. They’re at it for a while before a shrill whistle makes them pause. </p>\n<p>Hakoda lowers his fingers, <em>everyone</em> gathered around him. “Breakfast is ready,” he says. “Why don’t you two call it a draw for now?”</p>\n<p>Suki and Zuko look at each other. He kind of wants to keep going, to be honest. </p>\n<p>But then someone’s stomach growls. He’s not sure if it’s him or her, but either way, he realizes that he is <em>starving</em>.</p>\n<p>“Fine by me,” he says, dropping his arms. He bows to her. “Good fight.” </p>\n<p>She returns the bow, albeit in the Earth Kingdom style rather than Fire Nation. </p>\n<p>Sokka looks like he’s fallen head-over-heels in love with her all over again, and immediately takes her arm to escort her to breakfast. Zuko can’t really blame him. Oh, Suki is not his type by any means. And even if she was, he’d never do that to Sokka. But it seems they do share a similar taste in powerful women, and if he had been watching Mai hold her own in a sparring match against someone like, say, Katara or Toph...</p>\n<p>Thinking about Mai again wipes the small smile from Zuko’s face as he trails behind everyone to the food. He’s not really paying attention to where he’s going or who’s around him. </p>\n<p>Which is how he’s surprised when the person next to him clears his throat, and he realizes he’s sitting next to Hakoda. </p>\n<p>Oops. </p>\n<p>“Are you all right?” Hakoda asks with genuine concern in his voice. </p>\n<p>“Huh? Oh. Yeah.” Zuko turns to his food. Rice, with some veggies someone managed to forage. No one else is around him, everyone else clustered into little groups. He’s effectively alone with the Water Tribe chief.</p>\n<p>“You looked a little depressed earlier.” </p>\n<p>Zuko snorts. “Ask anyone here. I’m always either depressed or angry. Usually angry, if we’re being honest.” </p>\n<p>“So, like most teenagers, then.”</p>\n<p>Zuko is about to snap a reply when he sees Hakoda’s slight smirk and realizes the man is telling a joke. He snorts in response and takes a bite. </p>\n<p>And then...he doesn’t know why. Maybe the emotions are getting to be too much, or maybe because Hakoda reminds him of Iroh. Either way, he finds himself quietly saying, “I’m worried.” </p>\n<p>“About?” </p>\n<p>“Mai.” </p>\n<p>“The knife girl who helped us?” Hakoda clarified. At Zuko’s nod, all he says is, “Ah. She means a lot to you.” </p>\n<p>“She’s my girlfriend. Ex-girlfriend, I guess. Maybe?” He scratches the back of his neck. “It’s complicated.” </p>\n<p>“I imagine so, for a guy in your position. Do you feel guilty about it?” </p>\n<p>“Sort of?” Zuko admits. “Like, I know if we could have done something, we would’ve. And I know that without her help, we’d all have died a horrible, painful death. But at the same time, if I hadn’t been there in the first place, or if I’d just been <em>better</em>, then she wouldn’t be sitting in a prison cell. Or worse.” </p>\n<p>“Zuko, if you’re going to blame anyone, it should be me and Chit Sang,” Hakoda says. “We’re the ones who were supposed to be watching the warden.” </p>\n<p>“No one’s blaming you, chief,” Zuko says honestly. Maybe he blames Chit Sang a little, but Hakoda? Can you really fault the guy for being more concerned with the safety of his son than the security of a jerk? </p>\n<p>“And no one’s blaming you, either,” Hakoda replies. “Least of all Mai. I won’t pretend that I know her, or even you, to be honest. But she seems like an intelligent young woman?” </p>\n<p>Since it’s phrased as a question, Zuko nods. </p>\n<p>“Then she knew what she was doing,” he says. “And I imagine if your positions had been reversed, you’d have done the same thing.” </p>\n<p>Zuko nods again. He can’t say he feels much better about Mai’s predicament, but it is nice to know that someone else, at least, understands. Actually, out of all of them, Hakoda probably understands best. The prison uniform is low enough that everyone can see his soulmarks. The spear for Bato is vibrant and colorful, but the feather next to it is a faded gray. Dead. </p>\n<p>They’re silent as they continue to eat. Katara starts taking dishes to wash them, Aang and Toph leave for their lesson, all the others clear out to explore the temple. Zuko and Hakoda are still eating, but as their bowls empty, Zuko sighs. “So...you know I’m their soulmate.” </p>\n<p>“Yes,” Hakoda says, in a very neutral tone. </p>\n<p>“And I know about the Water Tribe’s views on soulmates.” </p>\n<p>“Okay.” </p>\n<p>Zuko groans. “I’m not good with...dads. Or parental figures of any type. So I’m probably going to be avoiding you? No offense?” </p>\n<p>Hakoda gives an understanding smile. “All things considered, I can’t imagine you have a good relationship with your father, or a good view of anyone even remotely like him.”</p>\n<p>“You’re <em>nothing</em> like him.”</p>\n<p>“No?” Hakoda starts counting off his fingers. “Father of two, father of at least one extraordinary bender, leader of a nation, trained in warfare, leading war efforts...that’s similar enough for a lot of people.” </p>\n<p>“Have you burned your son’s face for speaking out of turn?” Zuko asks. </p>\n<p>Again, Hakoda has that look on his face, like someone is speaking a foreign language. His eyes dart to Zuko’s scar before focusing more fully on his eyes. “No...” </p>\n<p>“Then you’re not similar. Trust me. Sokka and I did the soulbond on our way back, and if I’d seen you treat my soulmates half as badly as Ozai treated me, I’d have dropped you from the airship, no questions asked.” </p>\n<p>A handful of dishes drop into water behind them, and Zuko realizes that, yup, that was within Katara’s hearing. Before he has time to backpedal or run, Hakoda chuckles. “Good. Kya did the same thing with Bato’s mother.” </p>\n<p>Zuko tips his head. “Huh?” </p>\n<p>“Bato’s father died when he was very young. Hunting accident. He and Bato’s mother were soulmates. Pairs, not a trio like me or a sextet like you. She didn’t take his death well at all, and turned to drinking. And when she was drinking, she got mean. Started taking it out on Bato, since he’d been there, blamed the death on him. Never mind that he was six.” </p>\n<p>Something dark twists Hakoda’s expression for a moment before it smoothes out. “This was happening under everyone’s noses. We knew she had a drinking problem, but didn’t know about the abuse. At the same time, Kya and I knew that Bato was our soulmate and spent a lot of time together. He took advantage of that, tried to stay out of his home as much as possible. </p>\n<p>“One day, we had to be around eight or nine, Kya and I saw the bruises on Bato. He tried to play it off, but eventually we got him to tell us. Now, at the time, my father was the chief. I wanted to tell him right away, to have him settle this. Kya had the same idea, but went about it very differently. She went straight to Bato’s mother, who was drunk at the time, which is good because it meant she was uncoordinated. Kya then took her by the ear, twisted it, and <em>dragged</em> her all the way to my father.”</p>\n<p>Zuko cringes a little just thinking about that. “What happened then?” </p>\n<p>“Well, we convinced Bato to tell the chief the truth. He didn’t want his mother to get in trouble, but the fact of the matter is, she was hurting him. Had even managed to convince him that his father’s death was his fault, which took years to undo,” Hakoda says. “He stayed with me and my family while his mother was ordered to stay away from him and get sober.” </p>\n<p>“Did it work?” </p>\n<p>“After a while. She tried to see him once, while drunk, while my father was out on a hunt. Kya snuck Bato away while I distracted her,” he says. “She did get sober eventually, and she and Bato managed to salvage something of a relationship. But before it could go anywhere she got a tumor, and...” </p>\n<p>Zuko grimaces. “Tough break.” </p>\n<p>“Yeah. Can’t say I was particularly sad to see her go, but yeah.” </p>\n<p>Hakoda startles him by putting a hand on his shoulder. “Anyway, what I’m trying to say is, to a certain extent, I get it. Bato was terrified of any and all mother-figures in his life until he was an adult. And he, Kya, and I were a little over-protective of each other after that, too. I don’t expect you to start any kind of relationship with me just because my tribe pays special attention to some magic marks.”</p>\n<p>“Okay,” Zuko squeaks. </p>\n<p>Hakoda gives him a final pat before getting up and leaving. He passes his bowl to Katara before exiting the room. </p>\n<p>Leaving Zuko alone with the waterbender. </p>\n<p>She’s resumed washing the dishes. He brings her his bowl and asks, “Do you want any—”</p>\n<p>“No,” she says, glaring at him. “And I know I didn’t hear you threatening my dad.” </p>\n<p>“You’re right. You didn’t,” he says. “I was just stating a fact. And since he’s <em>not</em> an abusive jerk, I’ll be leaving him alone.” </p>\n<p>“Oh, because you care so much about your soulmates,” she sneers. </p>\n<p>“I <em>do</em>!” Zuko exclaims. “Look, Katara, I am sorry for everything I did to you guys. You have to know that if I had known you were my soulmates I wouldn’t have done any of it!” </p>\n<p>“You shouldn’t have <em>needed</em> to know! Not knowing that we’re soulmates doesn’t give you an excuse. You still tried to capture Aang, the world’s final hope for peace, and did spirits know what in doing so,” she says. </p>\n<p>He closes his eyes, because that just hit the nail right on the head. “You’re right. I’m sorry.” </p>\n<p>“I don’t care. Now get out of my face so I can get these done.” </p>\n<p>He leaves her alone.</p>\n<p>--</p>\n<p>Later that day, Zuko, Haru, and Aang go foraging for edibles in the surrounding forest. When they come back, they hear retching sounds in one of the hallways. </p>\n<p>“Who’s sick?” Aang asks as they round the corner. </p>\n<p>They find Suki and Sokka. Sokka’s the one throwing up. Suki is patting his back with a tight, sympathetic smile on her face. “I warned you.” </p>\n<p>“You did,” he agrees miserably. “Man, trying to kiss you as a guard was not smart.” </p>\n<p>“No, it was not.” </p>\n<p>Zuko sees their bleeding palms, puts two and two together, and steers Aang and Haru out of the hallway. “Not for us, guys.” </p>\n<p>Before they’re completely out of earshot, Zuko hears Sokka ask quietly, “Are you okay?” But he doesn’t hear Suki’s response. </p>\n<p>--</p>\n<p>Later on his stumbles upon Suki and Aang doing a soulbond. There’s a flash of light coming from the palms, and the next instant, Aang is hugging her. And crying. </p>\n<p>Zuko walks out of the room before they see him. He thinks he hears Aang mumbling “Thank you” over and over again. </p>\n<p>--</p>\n<p>The next morning goes quite similar to the first: Zuko and Aang do their lesson (though Zuko enlists Chit Sang’s help so they can do a two-on-one scenario), then Zuko and Suki spar, then they have breakfast. </p>\n<p>Only, after breakfast, Suki follows him out of the main room. “Hey,” she says. </p>\n<p>“Hey.” </p>\n<p>“Ah, so this might be an awkward question, seeing as we don’t really know each all that well, but I was wondering if you’re down for a soulbond,” she asks. </p>\n<p>Zuko blinks in surprise. He’d thought he’d have to wait a while before Suki would want that with him. Maybe not as long as Katara—he’s not expecting her to turn around anytime this century—but certainly more than a few days. </p>\n<p>At his hesitation, she steps back. “It’s no rush. I was just wondering.” </p>\n<p>“It’s not that I don’t want to,” he says, because he’s pretty sure that was a flicker of hurt he saw across her face. “It’s just that—and I’ve said this before—my past is really messed up. There are a lot of things in there that you’re going to see that I don’t want you to.” </p>\n<p>“How bad are we talking about?” she asks. </p>\n<p>“Well, it made Aang cry. And Sokka swear.” </p>\n<p>She nods. Then she says, in a very matter-of-fact tone, “When I was imprisoned, one of the guards attacked me. He didn’t get far, but if I hadn’t been able to fight back, it would’ve been rape.” </p>\n<p>Zuko blinks. “...shit. No wonder Sokka threw up.”</p>\n<p>“Yeah. So, if you want to wait on it, that’s fine. But you should know that you’re not the only one with a painful history.” </p>\n<p>It occurs to Zuko that...he really knows absolutely nothing about Suki. Even less than he did about the rest of the group when he first joined them. He knows that she’s from an island of women warriors, got inspired by the team to help in the war effort, and somewhere in all that managed to get captured by Azula. </p>\n<p>But who are her parents? Why did she become a warrior if she never planned on leaving the island before meeting Sokka? How did she become the leader of the Kyoshi warriors in the first place? </p>\n<p>Zuko suddenly wants to know. So he takes out the knife Iroh gave him. “Well, no time like the present. If I throw up, I’ll try to aim away from your shoes.” </p>\n<p>Suki laughs. </p>\n<p>--<br>\n--</p>\n<p>Suki does not have a father. </p>\n<p>She doesn’t think it’s odd, at first. Her mother Pan is all she needs. Pan teaches her how to fight, how to fish, how to sew her clothes. Soothes her scraped knees and scolds her for neglecting any chores. The usual. It’s kind of extraordinary, actually, because she’s really young. She was probably still a teenager when Suki was born.</p>\n<p>But there’s no father. No man running the house while the woman hunts and defends the border. And eventually, Suki asks, “Where’s my dad?” </p>\n<p>Pan is washing the dishes and stops. After a minute, she resumes, more slowly. “I don’t know. Probably on a boat somewhere.” </p>\n<p>“Can I meet him?” Suki asks hopefully. </p>\n<p>“No.” </p>\n<p>She pouts. “Why not?” </p>\n<p>“Because he’s a horrible human being, and if he ever comes anywhere near you it’d only be to hurt you. Do you understand?” </p>\n<p>Suki nods, wide-eyed. </p>\n<p>Zuko wonders. </p>\n<p>--</p>\n<p>It’s like Sokka with the South Pole: Zuko really only shows up to keep Suki warm. </p>\n<p>She always smiles when he does, and calls him Blanket. He tries not to grumble about it.</p>\n<p>--</p>\n<p>Not all of Kyoshi’s girls are turned into warriors. They’re all taught basic self-defense, but the majority of them choose other careers: fisherwoman, shopkeeper, farmer.</p>\n<p>It’s never a question for Suki. She’s always known she wanted to be a warrior. </p>\n<p>At one point, she and the other girls are taking a break from training. Pan is their teacher, though she often switches with another warrior. Zuko notices that there are a lot of older women—anywhere from age fifteen to fifty—on this island who were not here when he attacked. It gives him a bad feeling. </p>\n<p>Suki sits with one of the older girls and notices a fresh scar on her arm. Right under a soulmark. Suki winces. “I’m sorry about Jiang.” </p>\n<p>The girl gives a watery sigh. “Yeah.” </p>\n<p>Zuko later learns that Jiang was the girl’s other soulmate. A fisherman who was lost at sea. The mark turned gray about a week before this exchange. </p>\n<p>It’s a Kyoshi tradition to remove gray soulmarks. </p>\n<p>“You have to keep looking forward,” Pan explains to Suki when asked. “The past will only wear you down. Learn what lessons you must from it, and then move on. This is one of the greatest lessons of Kyoshi.” </p>\n<p>--</p>\n<p>Suki is eleven when she asks Pan, “Who is my father?” </p>\n<p>There’s a thunderstorm. Everyone is staying inside. It’s only the two of them, and they’ve just finished dinner. They’re drinking tea now. </p>\n<p>Pan stares at the tea in her cup. “It’s not a pretty story, Suki.” </p>\n<p>Suki takes her mother’s hand. “Please.” </p>\n<p>Pan sighs. “My father—your grandfather—was a merchant. I would go with him to the mainland, about a three day journey, to help him sell his wares. As I grew older and became better trained, I acted as a sort of bodyguard. Thought I was pretty hot stuff.” </p>\n<p>She snorts, taking a sip of tea. “One day, when I was sixteen, our boat got intercepted. Pirates. I tried to fight them off, but there were too many.” She takes a shaky breath. “They killed my father. Slit his throat and tossed him overboard. But as for me...well, they thought I was too pretty for that and had something else in mind. </p>\n<p>“I don’t know who your father is. There were six of them. When they were done using me, they robbed the boat of any and all remaining coin and goods, and then left. Nine months later, you were born.” </p>\n<p>Suki is pasty white when her mother is done. Pan sips her tea like nothing ever happened. Zuko feels sick to his stomach, and has no idea what to do. </p>\n<p>“Do you hate me?” Suki whispers. </p>\n<p>Pan almost chokes. She sets her teacup down and pulls Suki closer. </p>\n<p>“I love you,” she says fiercely. “I regret the circumstances of your birth, and if I ever see those bastards again I will castrate them and feed them to the unagi. But I will never regret having you.” </p>\n<p>Zuko breathes a sigh of relief as the two hug. </p>\n<p>--</p>\n<p>Suki is twelve when she loses her mother. </p>\n<p>It’s not a fight that does it. Not the Fire Nation, not pirates, not the unagi. </p>\n<p>It’s a plague. It wipes out half the island. </p>\n<p>At the first signs, the strongest villagers make a temporary village on the other side of the island and send the weakest there: the children, nursing mothers, and the elderly. They’re given strict orders not to come back until a messenger arrives declaring the village safe. Pan asks Suki to look after the other children before leaving.</p>\n<p>It works. </p>\n<p>Unfortunately, by the time the plague passes, almost all of the strongest villagers are gone. The Kyoshi Warriors are practically annihilated. Including Pan. </p>\n<p>--</p>\n<p>Suki is a wreck. Zuko feels his other soulmates there when he tries to comfort her, but there’s nothing they can do. The village struggles to rebuild. Suki and several other orphans sleep in the main house while everyone else works to ready for winter. </p>\n<p>And then one day, a few months later, Suki just...snaps out of it. </p>\n<p>It happens when she has to go through Pan’s things, figure out what to keep, what to scrap, what to give away. She finds her mother’s weapons. </p>\n<p>She examines a bladed fan for a long moment. Then she gets a brush and some ink. When she pulls up her pants leg, Zuko can see her line of soulmarks.</p>\n<p>On the other side of the marks, Suki writes her mother’s name in beautiful, elegant script. She watches the ink dry. Then she scrapes off the ink with the fan, taking a bit of skin with it. </p>\n<p>After a quick bandage, Suki gathers up her mother’s weapons and uniform, and throws away everything else. </p>\n<p>--</p>\n<p>Suki returns to training with a vengeance. Two adult warriors survive long enough to impart their skills to her before also passing away, one to drowning and another to old age. </p>\n<p>Suki is elected commander. She trains other girls, amassing a total force of nine warriors. </p>\n<p>Her closest friends are Lin, a sharp-sighted girl with inky hair who acts as second-in-command; Sen, who’s best at first aid; and Lu Men, who spent a lot of time before the plague in the village jail for stealing and pick-pocketing. It seemed the plague triggered a change of heart in her.</p>\n<p>Their first real test comes a year after the plague. Pirates. Apparently they heard about the island’s weakened state and decided it was ripe for plundering. </p>\n<p>Lin spots them coming, and Suki gets everyone ready. The warriors go into the woods, climbing high into the trees directly above the path the pirates have to take to get to the village. </p>\n<p>The men are laughing, weapons casually slung over their shoulders. “I hope they have pigs. I haven’t had good pork in ages.” </p>\n<p>“You think we’ll get enough silver to finally get a new sail?” </p>\n<p>“I’m hoping for some pretty girls to—”</p>\n<p>Suki gives the signal. </p>\n<p>The Kyoshi Warriors descend on the pirates like avenging spirits. The first few seconds are complete chaos as the pirates stumble into the ambush. Zuko watches Suki carefully as she disarms and knocks unconscious her first victim. </p>\n<p>Then the pirates start fighting back. Their numbers are slightly less than the warriors at this point, so it’s an even fight. Zuko warns Suki of incoming danger as someone behind her swings a sword at her back. She blocks with a fan and hits back. It's sloppy, but effective. </p>\n<p>After only a minute of fighting, the pirates decide it’s not worth it. They came here for easy prey, not a fight. They quickly retreat. </p>\n<p>Suki watches them leave with narrowed eyes, then returns to her people. </p>\n<p>--</p>\n<p>When Aang, Katara, and Sokka show up, Suki doesn’t say a word.</p>\n<p>The warriors give her odd looks. A village this small, everyone knows everyone’s soulmarks, and it’s pretty obvious that the three newcomers are Suki’s. The trio also latch onto the fans and are not-so-subtly asking around. But she doesn’t tell them, and everyone follows her lead. </p>\n<p>Suki and the warriors are putting on their makeup and outfits in the guard house when Lu Men casually asks, “So, are you not saying anything because the boomerang guy is a raging sexist, or is it something else?” </p>\n<p>Suki glares at her. Lu Men meets it with a raised eyebrow. Everyone else does a horrible job of pretending not to eavesdrop. </p>\n<p>“The Avatar and his friends are going to the North Pole to learn waterbending,” Suki says at length. “What do you think they’ll do if I reveal myself to them?” </p>\n<p>Lin gets it first. “They’d ask you to come with. And you think you should stay here.” </p>\n<p>“This island is my home. You are my people,” Suki says, snapping her makeup kit closed. “Soulmates or not, my primary responsibility will always be the safety and protection of this island.</p>\n<p>“And yes. The fact that that idiot is a raging sexist makes my decision a lot easier.” </p>\n<p>The girls giggle and leave it alone. Except Lin, who whispers, “You’ll have to tell them eventually.” </p>\n<p>Suki nods. “After the war.” </p>\n<p>--</p>\n<p>Sokka throws Suki in for a loop by humbling himself, asking her to teach him. Suki hesitates. Zuko nudges her forward. </p>\n<p>She makes an annoyed face, but she does it.</p>\n<p>And yes, Zuko will cherish the image of Sokka in a dress for the rest of his life. </p>\n<p>--</p>\n<p>After Aang leaves and the village starts repairing the damage from Zuko’s fire, Suki is deep in thought. There were no deaths (for which Zuko is greatly relieved) and only minor injuries. Suki sprained her wrist, though, and Sen is the one who tends to it. </p>\n<p>“What’s on your mind, boss?” Sen asks. </p>\n<p>“Something stupid.” </p>\n<p>“Do tell.” </p>\n<p>Suki looks out the window, toward the ocean. “Kyoshi has stayed out of the war for a hundred years. And I’m starting to think that that was a really selfish decision.” </p>\n<p>Sen pauses in wrapping Suki’s wrist. “You think we should join the fight.” </p>\n<p>“I think we should do <em>something</em>. Aang is <em>twelve</em>, and he’s risking his life to end the war.” </p>\n<p>“He’s the Avatar. It’s his job.” </p>\n<p>“So you’re saying because someone has power, they’re responsible for the betterment of others?” Suki asks. </p>\n<p>Sen thinks about it, then nods. “Basically, yeah. If you can help someone, you should.” </p>\n<p>“And what does that say about us? We’ve had the ability to help for a hundred years. And we’ve done nothing.” </p>\n<p>The medic thinks again. “I think that either choice is correct. Kyoshi is not the way it used to be. Maybe a few years ago, when we had more warriors, it’d be a simpler answer. Right now, though, staying put to protect what we have is a good choice. The nine of us are the only thing protecting our people.” </p>\n<p>Suki hums, still looking at the sea. </p>\n<p>Sen finishes wrapping Suki’s wrist. “Having said that, if the Fire Nation ever decided to turn their eyes this way, nine girls won’t make a lick of difference. Going out into the world to do some good is also a good choice.” </p>\n<p>Suki tears her eyes away from the window to stare at Sen. </p>\n<p>The medic is smiling at her. “You do what you think is best, boss. The rest of us, we trust you. We’ll follow you to the end.” </p>\n<p>--</p>\n<p>Suki’s decision to leave is met with hesitation, then widespread support. All the other Kyoshi Warriors volunteer to go with her. They take a boat and head for the Earth Kingdom mainland. </p>\n<p>“So, what exactly is the plan?” Lin asks. </p>\n<p>“Make our way to Ba Sing Se,” Suki says. “That’s where most of the fighting is happening, and where we’ll be most needed. We’ll offer our services to the Earth King.” </p>\n<p>Lin nods. “Fair enough. I’ll tell Lu Men to keep her hands off of anything shiny.” </p>\n<p>--</p>\n<p>They don’t make it to the Earth King. A few weeks into the trip, they find a bunch of firebenders burning a village to the ground. Several of the firebenders go after the helpless villagers trying to escape. </p>\n<p>Suki and the others attack. It’s a vicious fight that lasts well over an hour, the smoke and fire getting in everyone’s way. But eventually, the firebenders flee. </p>\n<p>The villagers had gone to a nearby lake, away from the fire. Suki and the others are covered head to foot in soot, and several of them are sporting burns and injuries. Sen has her hands full. </p>\n<p>Suki talks to the village leader. They decide to go to Ba Sing Se. The Kyoshi warriors agree to act as escort in a heartbeat. </p>\n<p>--</p>\n<p>They get to Full Moon Bay relatively easily. Some of the warriors are teaching the younger villagers—especially the girls—the basics of fighting. A cranky old woman demands passports and tickets. Suki explains the situation, and they manage to get said passports and tickets for the villagers. The old woman then enlists the warriors as her personal guards. </p>\n<p>“We’ve had half a dozen Fire Nation scouts try to sniff the place out in the last month,” she snarls, flicking away some paperwork. “What few guards I have here are barely worth their weight in platypus bear dung. You want to do your part? Help me keep this place safe and civil.” </p>\n<p>Suki takes her proposition to the others, and after a bit of debate, they agree to stay. </p>\n<p>--</p>\n<p>“Uh, Suki?” </p>\n<p>Suki stretches her arms over her head. It’s been a long day at work. “Yeah?” </p>\n<p>Lin points to a group of kids at the head of the line. </p>\n<p>Suki blinks. Then grins. “Cover my shift, would you?” And she goes to greet her soulmates. </p>\n<p>--</p>\n<p>“The Serpent’s Pass?” she almost shrieks. “For real?” </p>\n<p>Lin, who reported the rumor mill, nods. “Apparently the madam won’t let them give away their tickets, and the sweet idyllic family cannot fend for themselves. So obviously, the Avatar’s escorting them.” </p>\n<p>Suki sighs, rubbing her eyes. </p>\n<p>“Look, Suki, I know it’s none of our business. But they are your soulmates. And they’re about to do something stupidly dangerous. They need you.” </p>\n<p>“<em>You</em> need me,” Suki counters. </p>\n<p>Lin smiles. “We can handle ourselves for a few days. Go to your soulmates, Suki. If they have any sense, they’ll understand where you’re coming from and won’t push you to do anything you don’t want to.” </p>\n<p>Suki looks at the cave of refugees and her warriors. Then she rushes to get ready. </p>\n<p>--</p>\n<p>Sokka acts stupidly over protective, and it’s clearly getting on Suki’s nerves. It’s getting on Zuko’s nerves, too. </p>\n<p>But then Sokka asks, “So, uh, Suki. Me and the others were talking, and, uh, you know, we kind of have this soulmark that looks a bit like a fan...” </p>\n<p>Suki huffs. “Yup. That’s me.” </p>\n<p>Katara freezes, forcing Toph to bump into her. “What?!” </p>\n<p>“Why didn’t you tell us?” Sokka wails. </p>\n<p>“Because you have your destiny, and I have mine,” Suki says. “You guys have to save the world. I had to make sure my village was safe.” </p>\n<p>Toph smirks. “And yet, here you are.” </p>\n<p>Suki blushes, and resumes walking. </p>\n<p>--</p>\n<p>When they finally do get through, and the baby is safely delivered, the soulmates gather ‘round. Suki and Sokka have already had their moment, and Zuko gags at the lovey-dovey expressions the two keep sharing. </p>\n<p>That is, until Suki says, “I’m heading back. You guys stay safe, okay?” </p>\n<p>The others hesitate. Toph’s the one who asks, “No soulbond?” </p>\n<p>Suki shakes her head. “Not yet. Which means you all have to stay alive and in one piece until we meet again.”</p>\n<p>Katara pulls her into a hug. “We’re proud of you, Suki. I know you feel torn up about it, but people like you are the reason we keep fighting.”</p>\n<p>Suki smiles and hugs back. When they pull apart, there’s some discreet tear-wiping. “I’ll keep an eye out for our sixth,” Suki promises over her shoulder. “Say hi to Appa for me!” </p>\n<p>--</p>\n<p>Despite all odds, Suki gets back to the bay in one piece, though not without narrowly avoiding another attack by the sea monster. </p>\n<p>The other warriors have decided they’ve had enough of their crabby boss and agree to move on. Their work as guards has earned them all a bit of a paycheck, and they pool their money to spend it on weapon upgrades: shields and swords. </p>\n<p>--</p>\n<p>“No...it couldn’t be.” </p>\n<p>Zuko’s jaw drops as Suki follows the trail of bison fur through the forest, up a steep hill, to...</p>\n<p>“Appa?” she gasps. “Oh, no!” </p>\n<p>Watching the exchange, Zuko feels sick. He’s not particularly close to Appa, certainly not as close as the others are, but he cares about the bison. Seeing him now, wounded, dirty, <em>chained</em>, makes him want to rage and scream and set something on fire.</p>\n<p>It’s a good thing Suki isn’t him. That reaction would not go over well.</p>\n<p>She collects her warriors, and they coax Appa out of the cave. Lu Men picks the locks. Sen carefully plucks out the quills. Lin scouts out and finds a pond for them to give him a bath. </p>\n<p>After a few hours, Appa is clean, de-chained, and happy. Even Zuko is smiling.</p>\n<p>“So what now?” Lin asks. </p>\n<p>“Now we get him back to Aang,” Suki says, running a hand through Appa’s fur. “They’re on their way to Ba Sing Se, so that’s where we need to go.” </p>\n<p>Sen puts hand hands on her hips, studying the bison with a critical eye. “I don’t think we’re all going to fit without a saddle.” </p>\n<p>“We won’t. But I can do it myself,” Suki says. “We’ll take him back to town, first, give him a proper meal and find some rope for the reins. Then tomorrow morning I’ll ride him to—”</p>\n<p>Appa stiffens. All the warriors hear it, and immediately pull out fans and shields. </p>\n<p>Azula, Mai and Ty Lee burst out of the trees. “My, my, you’re easy to find...” </p>\n<p>--</p>\n<p>As good as they are, the Kyoshi Warriors cannot defeat the trio on their own. With Appa’s help...well, it’s possible. Maybe. A fraction of a chance. </p>\n<p>Zuko might have rolled with those odds, but Suki does not. And when she realizes Appa is afraid of fire, she doesn’t hesitate to pick up the burning branch. </p>\n<p>“You have to find Aang!” she orders. “We’ll be okay!” </p>\n<p>Appa hesitates, his sense of loyalty clashing with his fear of fire. The fear wins, and Suki smiles as he flies off. </p>\n<p>Zuko smacks her arm to warn her of Azula’s approach. She raises her shield just in time to catch a fire blast, and pulls out another fan. </p>\n<p>By now, almost all of her warriors are down, chi blocked by Ty Lee or pinned down by Mai. Lin is the only one still standing, blocking knives with her shield and fending off Ty Lee with her sword. Suki takes on Azula. </p>\n<p>And almost—<em>almost</em>—wins. </p>\n<p>She manages to slam her shield into Azula’s side, knocking the girl off-balance, and then presses her advantage. Her bladed fan is aimed right at the princess’s face, and Azula barely ducks out of the way. </p>\n<p>A thin line of blood appears on her cheek. Azula’s eyes burn with fury, and Suki smirks. </p>\n<p>In the end, it’s not Azula who takes Suki down. It’s Ty Lee. Mai finally manages to pin Lin, and when she does, Ty Lee flips over to Suki. Too fast for the warrior to block, Ty Lee jabs her in her chi points, and the warrior drops. </p>\n<p>--</p>\n<p>Azula only asks them one questions: “Where is the Avatar?” </p>\n<p>The chi blocking hasn’t worn off yet. Even so, Suki manages to look confident and imposing when she answers, “The safest place in the world.” </p>\n<p>Mai sighs. Azula’s eyes narrow in frustration. </p>\n<p>--</p>\n<p>The girls are all taken to a nearby Fire Nation prison. Their vibrant green uniforms are removed, replaced with bland prison clothing. </p>\n<p>Suki scans the line of guards and mass of prisoners. “Keep your eyes open, ladies. See if you can sniff out any weak points.”</p>\n<p>They do. But before they can report back to Suki, one of the guards tell her, “Don’t get comfortable. You’re being transferred tomorrow.” </p>\n<p>“What?” Suki demands. “Why?” </p>\n<p>“You’re the leader. Princess Azula specifically asked that you be taken to the Boiling Rock.”</p>\n<p>When the others hear this, Lu Men’s face blanches. “I’ve heard of that. It’s the highest security prison in the Fire Nation.” </p>\n<p>Suki sighs. “Guess I better consider that a compliment. How are we on a prison break?” </p>\n<p>“We might have an opening during the eclipse,” Sen says. “But this place is locked down tight. They’re not taking any chances.” </p>\n<p>“Are any of you getting transferred?” </p>\n<p>They shake their heads. </p>\n<p>“Good. Lin, you’re in charge. The rest of you, you stay together. Look after the other prisoners here.” </p>\n<p>Lin scoffs. “Most of them are Fire Nation!” </p>\n<p>“Avatar Aang is trying to end this war,” Suki says. “The whole point of us fighting with him is to bring balance to the world. We can’t do that if we keep treating everyone with Fire Nation blood as the villain. We have to show them what it means to act with honor and integrity. Understand?” </p>\n<p>They nod. </p>\n<p>--</p>\n<p>The day of the transfer, Suki is chained at the wrists and ankles, and walks with her head held high into the bowels of a ship that takes her to the Boiling Rock. </p>\n<p>During the transfer, she’s patted down for weapons. The guard doing it, a beefy man named Lei, spends way too long checking her chest and butt area. Suki narrows her eyes, but says nothing. </p>\n<p>They take her to a tiny cell with barely any light. She’s unchained, and locked inside. Zuko sits beside her and immediately leans against her side so she knows he’s there. Her breathing is shaky. “Stupid circus freak.” </p>\n<p>--</p>\n<p>Lei, the guard who was feeling her up earlier, suddenly visits out of the blue. Suki sits up in her cot. “What?” </p>\n<p>The guard closes and locks the door behind him. “I wish the Earth Kingdom had more female soldiers. It gets gross doing this with guys.” He grins. “I’m glad you’re here, sweetie.”</p>\n<p>Ah, shit. This is what Suki was talking about. </p>\n<p>She understands the same time Zuko does, and stands up. “Get out. Now.” </p>\n<p>“Or what?” He holds out his hand, and a little fire appears in his palm. “You try to resist, and I burn your pretty face. You bite anything, and I’ll make sure you don’t eat for a week. You scream, and I kill you. Do you understand your situation?” </p>\n<p>Suki’s face is perfectly blank. The only thing giving away her fear is the slight tremble of her hands.</p>\n<p>Zuko’s jaw drops when she shrugs, turns her back, and takes off her shirt.</p>\n<p>The guard smiles, putting out the flame, and puts his hands on her. He leaves wet kisses on her neck, rubs himself on her ass, and fondles her breasts. Suki rolls her eyes, but doesn’t move or resist. </p>\n<p>Until he reaches for her pants. </p>\n<p>The warrior moves lightning-quick. She slams her heel on his foot, then kicks his knee so hard it pops in the opposite direction. At the same time she takes his hand and spins around, wrenching his arm. They go to the floor, and she lands on his back, pinning him down.</p>\n<p>His screaming draws the attention of the other guards, and three of them pile into the room. They pull Suki off of him and push her against the wall. The captain of the guard, a woman, is furious. “What happened?” </p>\n<p>“She attacked me!” the guard whimpers. </p>\n<p>The captain looks at Suki, who is still topless, and raises an eyebrow. “Really. And what were you doing in her cell in the first place?” </p>\n<p>“I was…doing an inspection.” </p>\n<p>“Inspections aren’t scheduled until tomorrow afternoon.”</p>\n<p>Lei gulps.</p>\n<p>The captain orders him removed to the infirmary, and tells the others to let Suki put her shirt back on. The captain stands in front of her. “Are you injured?” she asks, surprisingly gentle.</p>\n<p>Suki blinks. “Uh. No. No, ma’am.”</p>\n<p>“Good. I apologize for my man’s behavior. At the very least, he will be fired. And I’m assigning only guards that I explicitly trust to handle you for the rest of the journey.” </p>\n<p>Zuko sags in relief. Suki gives a slight bow. “Thank you, captain.”</p>\n<p>--</p>\n<p>The situation may have been handled with grace, but it still messes Suki up. She wakes up with nightmares and doesn’t let any man touch her if she can help it. The captain assists where she can—the vast majority of the guards assigned to Suki are women—but there’s only so much she can do. </p>\n<p>Zuko hesitates to help—he’s a guy, after all, and he’s not sure if that’ll make the situation better or worse—but decides to act after Suki wakes from another nightmare, heaving with breath. He taps <em>I’m here</em> on her arm, even though she hasn’t had a chance to learn that from Sokka yet.</p>\n<p>She wraps her arms around her knees. “Can I get a hug, you guys?” </p>\n<p>He's quick to obey. With him on the left and Sokka on the right, they lull her back to sleep.</p>\n<p>--</p>\n<p>Suki turns the Boiling Rock into her own personal training ground. She leaves the guards alone, but picks a fight with almost every other prisoner. </p>\n<p>Especially the non-benders. Especially the fast ones. Who move like Ty Lee. </p>\n<p>Even though she’s not a firebender, she ends up in the cooler a lot for her trouble. Zuko keeps her warm. She smiles. \"Thanks, Blanket.\"</p>\n<p>--</p>\n<p>It’s an unassuming day at the Boiling Rock, when Suki suddenly gasps. Her hand goes straight to her soulmarks. </p>\n<p>She’s in the yard, in public. Everyone around her gives her strange looks. Despite the fact that time outdoors is a precious commodity, she tries to run back to her cell. The guards won’t let her; they use this time for cell inspections. </p>\n<p>So she punches one of them in the face. </p>\n<p>They throw her in the cooler. </p>\n<p>Zuko is confused by all of this behavior, until she’s finally left alone and she rolls up her pants to reveal her soulmarks. </p>\n<p>Aang’s is flickering, turning from blue to gray and back to blue. </p>\n<p><em>Ba Sing Se</em>, Zuko realizes, a sick feeling in his gut. </p>\n<p>Suki makes a wounded sound. “Come on, Aang. You’re okay, you’re okay.”</p>\n<p>She sits in that cooler for what feels like hours, shivering. Zuko does what he can to keep her warm, but he’s pretty sure his presence doesn’t even filter. Her eyes never leave the mark. Her shoulders do not lose their rigidness until the arrow returns to vibrant blue, and stays that way. </p>\n<p>She drops her head between her knees with a sigh. “When I see you again, Aang, I’m going to kill you.” </p>\n<p>--</p>\n<p>It doesn’t take long for word to reach the Boiling Rock that the Avatar is dead. </p>\n<p>Suki keeps to herself. Zuko has no idea what she’s thinking, but he knows she’s contemplating something serious. Whatever it is, she makes up her mind when she hears that Azula will be returning to the capital. </p>\n<p>Despite the Boiling Rock’s security measures, Suki still manages to get her hands on a little hand-made knife. She takes it back to her cell and rolls up her pants. All of her marks are vibrant and colorful. </p>\n<p>She cuts off Aang’s. </p>\n<p>--</p>\n<p>Zuko’s still reeling from shock. He’s gone his whole life without his marks, would have cheerfully killed to have them back ages ago, and here Suki went and <em>deliberately</em> removed one? </p>\n<p>He doesn’t get it. Until Azula visits.</p>\n<p>Prison is very routine, so when the door opens unannounced, both Suki and Zuko tense. </p>\n<p>Azula enters, and the door closes behind her. </p>\n<p>Suki stays lying on her mattress and looks at the ceiling. </p>\n<p>“Aren’t you going to bow?” Azula asks. “I just conquered your kingdom. That makes me your princess.” </p>\n<p>Suki does the smart thing, and does not engage. </p>\n<p>Azula prowls closer. “I also killed your precious Avatar.” </p>\n<p>Suki’s eyebrow twitches. It’s her only response. </p>\n<p>It’s the only one Azula needs. “Aren’t you going to avenge him? He <em>was</em> your soulmate, after all.” </p>\n<p>“You know me better than that,” Suki says. “If I try to kill you now, I’ll not only fail, but I’ll be executed tomorrow. Better to wait until I’m out of here and I can sneak into your bedroom to slit your throat.” </p>\n<p>She says it so coldly and matter-of-fact that Zuko believes her. He kind of wishes she wouldn’t—Azula is his sister after all, and assassination in any form tends to be frowned upon—but he wouldn’t blame her for trying. </p>\n<p>Azula seems more amused than anything else. “Let me see your marks.” </p>\n<p><em>Oh,</em> Zuko realizes. <em>Okay, then. Way to think ahead, Suki.</em></p>\n<p>Suki slowly smirks, her eyes finally meeting Azula’s. “I thought you said you killed him. Are you doubting your own abilities?” </p>\n<p>“Since the Water Tribe peasant took his body, my father will want proof. A gray mark is better than nothing.” </p>\n<p>“Your own father wouldn’t believe your word?” Suki asks innocently. </p>\n<p>Azula’s jaw clenches, just a little. “Your marks. Unless you want me to burn the clothes off of you.” </p>\n<p>“Tempting. That would be pretty sexy, but unfortunately my type is more sarcastic and blue-eyed.” Still, Suki pulls up her pants sleeve to reveal her marks. </p>\n<p>Azula’s eyes narrowed. “You cut it off. Hiding something?” </p>\n<p>“It’s a Kyoshi tradition,” Suki says, straightening out her clothes. “When a soulmate dies, you remove their marks from your body.” </p>\n<p>“Hmph. And I thought <em>I</em> was considered heartless.” </p>\n<p>“Kyoshi believed that strength lies in looking forward, not back,” Suki says. “And sometimes, putting the past behind you is painful. Aang is dead. He’s not coming back. </p>\n<p>“Only...that’s not entirely true. He’s the Avatar. He’ll show up again in the Water Tribe, won’t he? And you’ll have to go through the trouble of finding him and tracking him down. Without a comet deadline, he’ll have all the time in the world to master the elements.” Suki looks Azula up and down. “Maybe I won’t kill you. I think the next Avatar would like that pleasure for themselves.”</p>\n<p>“I killed this one,” Azula says. “Who’s the say I can’t kill another?” </p>\n<p>“You killed a twelve-year-old child,” Suki snaps. </p>\n<p>“And I’m a fourteen-year-old teenager. Imagine what I’ll be in my prime, when the Avatar comes again.” Azula knocks twice on the door, signaling to be let out. “I’ll be back soon, Suki. I’d love to hear about your other soulmates.” </p>\n<p>--</p>\n<p>Azula does come back. Once every few days, she and Suki have a verbal sparring match. It’s hard to tell if the princess is trying to get more information out of Suki, or if she’s just trying to break her spirit. Probably both. </p>\n<p>Sometimes, Suki checks out, spending the time meditating. She gets very good at schooling her expressions so no emotions pass her face. Other times, she replies to Azula’s barbed wired words with some of her own. </p>\n<p>“I heard you got attacked by one of the guards en route. Maybe I’ll have him transferred here. I’m sure he’d love to say hello.” </p>\n<p>Suki doesn’t respond to that one. She hides her trembling fingers behind her head as she looks at the ceiling, meditating while Azula talks. </p>\n<p>Azula threatens her village, asking, “Where was it you said you were from? Kyoshi Island? I think I’ll visit one of these days. I’m sure whatever buildings you have can be greatly improved with a bit of heat.” </p>\n<p>“Watch out for the unagi,” Suki responds. “Part of the reason we stayed out of the war for so long is because it keeps attacking your ships. All the spicy food you eat must make you especially tasty.” </p>\n<p>Another time Azula says, “I wonder how well your precious Sokka’s doing. Probably starving in a ditch somewhere. Won’t be long before that little boomerang on your leg turns gray.” </p>\n<p>“Well, when it does, do me a favor and get me a knife, would you?” Suki responds. “I’ll carve out that flesh and even send it to you, wrapped in a bow. You can give it to your father, and maybe he’ll pat you on the head like the little bitch you are.” </p>\n<p>She gets slapped for that one. Her response is a smile.</p>\n<p>Zuko is amazed. He grew up with Azula, with her taunts and cruel words. The best he could ever hope for was a tie when they argued. Most of the time, she left him feeling stupid and hurt. </p>\n<p>But for Suki, the worst she’ll get is a little frustrated and a lot exhausted. Sometimes, Azula will be the one to leave in a huff, only to come back a few days later. </p>\n<p>It takes Zuko a while to get it: Azula needs this. Suki is the closest she’s come to an intellectual equal in...ever. Mai and Ty Lee are her friends, to a certain extent, but they’re too afraid of her to defy her. Suki is constantly challenging her, and Azula needs that. </p>\n<p>The whole thing leaves him in awe of Suki and with nothing but pity for Azula. </p>\n<p>--</p>\n<p>Azula only ever gets truly violent once, and it’s during her last visit to Suki. Two days before the invasion. </p>\n<p>“Your boyfriend is leading an attack on the capital soon,” she says off-handedly. “I was thinking of stringing you up over the gates by a rope around your neck, let him watch you strangle to death. Or maybe dress you in Fire Nation armor and put you on the front lines.” </p>\n<p>Suki smiles. “You’re not going to put me in Fire Nation colors.” </p>\n<p>“Oh? Why not?” </p>\n<p>“Because I’d look better than you. And then I would escape, and even if the invasion plan fails, you’d have to explain to daddy dearest why you <em>failed</em> to keep me in line.” </p>\n<p>She emphasizes that word, fail, and Zuko knows she’s figured Azula out. That in all the time Azula has been prodding at her, trying to learn what makes her tick, Suki has been doing the exact same thing. </p>\n<p>“I fail?” Azula says carefully. “I never do that.” </p>\n<p>“You failed to kill Aang.” </p>\n<p>Azula raises her eyebrows. “So you admit it, then. The Avatar’s alive.” </p>\n<p>“We’re both smarter than that,” Suki says. She swings her legs around the bed so she’s facing Azula head-on. “Why else would you come here that day? If you had truly believed that you’d killed him, there would be no need.”</p>\n<p>“I wouldn’t be so glib with giving that kind of information to the enemy.” </p>\n<p>“You won’t do anything with it.” </p>\n<p>Azula chuckles. “And why not?” </p>\n<p>“Because you’d have to admit to failure. That you weren’t good enough to kill the Avatar.” </p>\n<p>“I told everyone my brother killed the Avatar,” Azula says.</p>\n<p>“Would they believe you, though?” Suki asks. “Regardless of who claims to kill him, you’ve said that he’s dead. You were there. You did everything in your power to confirm it. Despite your best efforts, he survived, enough to gather an <em>invasion</em> on the homeland. How’s your father going to react to your carelessness?” </p>\n<p>“The invasion plan is doomed. We’ve been preparing for months.” </p>\n<p>“But will it be enough? Do you truly, one hundred percent believe that your father can defeat the Avatar during an <em>eclipse</em>? You’re not the only one who’s been preparing. And even if the invasion fails, Aang would probably slip through your fingers again. And then what? You explain to your father why you failed—again—to capture a twelve-year-old child. You’d be just as pathetic as your brother—”</p>\n<p>Azula grabs Suki by the collar of her shirt and slams her against the wall. “I am <em>nothing like him</em>!” she snaps. “I am better than him in <em>every way</em>!” </p>\n<p>Suki raises an eyebrow. “Careful, Azula. You’re acting very unlike a princess.”</p>\n<p>Azula steams. Suki’s face is neutral. Zuko holds his breath. </p>\n<p>Azula leans in closer. “When this is over, I’m going to gather the heads of all of your soulmates and use them to decorate your cell.” </p>\n<p>Suki smirks. “I’ll enjoy watching you try.”</p>\n<p>--<br>\n--</p>\n<p>Zuko blinks, and he’s back in the present. </p>\n<p>At first, they’re not entirely sure what to do with each other. Suki huffs and says, “I should’ve killed that bitch.” </p>\n<p>He rolls his eyes. “You’re not the only one to lose a fight to Azula. But you <em>are</em> the only one I know who’s made her bleed.” </p>\n<p>She preens. “Wanna spar?” </p>\n<p>“Love to.”</p>\n<p>The day after Suki and Zuko’s soulbond, Azula shows up. </p>\n<p>Because of course she does.</p>\n<p>“Father and I are going to have so much fun with your soulmates, Zuzu,” she taunts as they battle on the airship.</p>\n<p>“You’ll have to kill me, first,” he says, and throws another fireball.</p>\n<p>—</p>\n<p>They set up camp, and Sokka toasts Zuko, and Zuko…he finally feels like maybe, he can truly be a part of this group. That he has friends. A family. </p>\n<p>“I’m touched,” he says. “I don’t deserve this.” </p>\n<p>“No kidding,” Katara says, and storms off. It’s like a bucket of cold water. Because he <em>doesn’t</em> deserve this. Any of it.</p>\n<p>—</p>\n<p>“I was the first to trust you!” Katara shouts. “Remember? Back in Ba Sing Se. And you turned around and betrayed us!” </p>\n<p>Zuko groans. “What can I do to make it up to you?” </p>\n<p>“Gee, I don’t know. Maybe you can recapture Ba Sing Se in the name of the Earth King! Or, I know, you can bring my mother back.” </p>\n<p>As she moves past him, Zuko grabs her arm. She tears herself free. “What are you—”</p>\n<p>“I can’t bring your mother back,” he says, “but I know who killed her. And I’m going to help you find them.” </p>\n<p>—</p>\n<p>The rest of the group have some concerns. </p>\n<p>And honestly, Zuko doesn’t get it. The whole pacifism thing. The whole not-wanting-revenge thing. If it were his mother, if it had turned out that she was murdered, not a force in this world or the spirit world could stop him from avenging her.</p>\n<p>Also, Katara is really fucking scary, and angry, and maybe this will help redirect that anger to anyone other than Zuko. </p>\n<p>And even if it doesn’t, she needs the closure. </p>\n<p>They convince Aang to let them take Appa, agree to meet up at Ember Island, and go. </p>\n<p>—</p>\n<p>So. Bloodbending. That’s a thing. </p>\n<p>…</p>\n<p>Zuko decides not to ask and just reminds himself not to pick another fight with Katara. </p>\n<p>—</p>\n<p>Katara doesn’t kill the man who killed her mother, and Zuko isn’t surprised. She’s always been a better person than him, better than anyone else he knows. Hurting other people for her own personal pleasure just isn’t in her nature. She needs a better reason, like self-defense.</p>\n<p>Still, he hopes that the confrontation was helpful in some way. </p>\n<p>He flies them to Ember Island and lets her go off alone. He tells Aang what happened, and the kid sags a little in relief. </p>\n<p>Zuko’s just hoping that she’ll stop conflating him with that monster of an ex-captain, and he can work with the rest of the group without worrying about getting dunked in the ocean. </p>\n<p>He doesn’t expect Katara to smile and him and say, “But I can start to forgive you.” Never mind <em>hug</em> him. </p>\n<p>Luckily, Zuko’s gotten pretty good at hugs, so he returns it. </p>\n<p>—</p>\n<p>Being back at Ember Island is…unpleasant. Memories echo in every hall, and even though most of them are pleasant enough they weigh on him. </p>\n<p>The nightmares are horrible. </p>\n<p>The good news is they’re all sleeping in separate rooms now, even if Suki and Sokka usually end up in the same one by morning. </p>\n<p>The bad news is Zuko forgot that the walls are a bit thin. Or maybe he’s just loud. Probably both. </p>\n<p>Either way, when he wakes up with a scream, the rest of the team are there in a heartbeat, looking for a threat. </p>\n<p>“What happened?” Sokka asks, sword out. “Are you hurt? Zuko?” </p>\n<p>“I’m fine,” he pants, embarrassed and terrified. The nightmare had been one of the worst: Aang getting his face burned the exact same way Zuko had, only Ozai doesn’t stop at the skin. He keeps going until the boy’s whole head is nothing but a charred skull. </p>\n<p>He looks at Aang, confirming that he’s unhurt, and sags. “I’m sorry for waking you. Go back to bed.” </p>\n<p>The others look at each other. Sokka sheaths his sword, and they file out. </p>\n<p>Katara stays. </p>\n<p>She sits on the edge of his bed. “Do you want to talk about it?” </p>\n<p>“Not particularly,” he admits, wiping the sweat from his face. Glancing out the window, it looks like dawn is still a few hours away. He probably only got about three hours of sleep. And no way is he going back to bed. </p>\n<p>“Is this a usual thing?” she asks, her voice thick with concern that reminds him a little of Ursa. “Is it why you always slept apart in the temple?” </p>\n<p>Dammit. She’s too smart. Why can’t she go back to hating him? At least then he didn’t have to talk about this.</p>\n<p>She puts a hand on his shoulder. “Zuko, we all get nightmares. Aang dreams about the Air Nomads, Sokka dreams about Yue, Suki dreams about her attack, I dream about Mom, and Toph…okay, Toph doesn’t get nightmares. But the rest of us have been there. And we want to help you. It doesn’t look like leaving you alone to deal with it by yourself has been particularly helpful.” </p>\n<p>“Oh, are you telling me that I can make all bad dreams disappear with the power of friendship?” he sneers. “Or maybe you can use your magic healing water to make it all better?” </p>\n<p>She doesn’t take the bait, staying perfectly calm and serious as she says, “I can try.” She bends some water out of her bag. </p>\n<p>Normally, Zuko would snap and fight, insisting that he doesn’t need this. But he’s tired. So fucking tired. And the habit of having Snowflake care for him is settled deep in his bones, so he grumbles but is otherwise completely compliant as she puts her hands and water on his head. </p>\n<p>It’s…nice. Soothing. He’s not sure how she’s doing it, but the bending seeps into his mind, rocking him exactly the way his mother used to when he was kid and was having trouble sleeping and…</p>\n<p>He takes Katara’s wrist and pushes her away. “I don’t want to sleep.” </p>\n<p>“Why not?” she asks. </p>\n<p>“I’m pretty sure I’ll get another nightmare,” he admits. <em>We never should’ve come here.</em></p>\n<p>“I’ll make sure that doesn’t happen,” she says. </p>\n<p>“What, we’re going to share a bed?” </p>\n<p>“Why not? Families do it in the Water Tribe all the time.” </p>\n<p>He squirms. Katara’s a gorgeous girl, even if she isn’t his type. Co-ed sleeping is not a norm in the Fire Nation, not unless some other activity was going on…</p>\n<p>Wait. Did she just call him family?</p>\n<p>She gives him a flat look. “Zuko. You need to sleep. If it looks like you’re having a nightmare, I’ll wake you up.” </p>\n<p>He takes a deep breath. “Okay. I trust you.” </p>\n<p>—</p>\n<p>He does have another nightmare that night. It’s the one where Iroh’s yelling at him, blaming him for everything as the world burns down around them. But just as it’s getting particularly bad, a blue haze falls around them. Cool water washes the nightmare away, and he’s instead on a winter beach.</p>\n<p>He doesn’t remember much of that dream other than snippets of turtle-seals and the sense of peace. When he wakes up at dawn, he finds Katara asleep next to him, snoring softly into a pillow. He slips out of bed, tucks the covers up to her chin, and leaves. </p>\n<p>—</p>\n<p>The next night, Aang and Toph declare that sleeping in separate rooms is boring. They move all the furniture in the living room, set up a bunch of blankets and pillows on the floor, and declare it the new communal sleeping space. Katara’s all in. So are Sokka and Suki, with minimal complaints from the former. It’s closer to the food, anyway.</p>\n<p>After a bit of hesitation, Zuko joins them. He doesn’t remember, but he learns later that, when he started twitching from a nightmare, Aang curled up on his back and tapped <em>safe</em> on his arm over and over again. It worked. </p>\n<p>—</p>\n<p>“Hey, Zuko?” </p>\n<p>He grunts, drinking water after an intense lesson with Aang. The kid’s getting good, and it fills Zuko with equal parts pride and dread. The comet is days away. </p>\n<p>Katara’s standing in front of him in the courtyard. Everyone else went inside to eat breakfast, and Zuko has half a mind to join them. </p>\n<p>Until he notices a familiar knife in Katara’s hands. </p>\n<p>She smiles. “Might as well make it official. If you’re comfortable doing it.” </p>\n<p>Zuko sets the water canteen down. “It’s not pretty, Katara.” </p>\n<p>“I’m aware.” </p>\n<p>He could say no. He could ask to wait, and she’d honor that without question. </p>\n<p>He takes the knife. </p>\n<p>—<br>—</p>\n<p>Zuko opens his eyes to the day of Kya’s death. </p>\n<p>Great start. </p>\n<p>“Mom!” Katara bursts into the tent to come face-to-face with Yon Rha. </p>\n<p>“Go find your father, sweetie. I’ll handle this.” Kya gives her a brave smile. With a pang, Zuko thinks she and Ursa would have gotten along famously. </p>\n<p>Katara runs out of the tent and gets Hakoda. “Dad! There’s a man in our house, and he won’t leave!” </p>\n<p>Hakoda flips a man over his shoulder, and then goes still. His hand goes to his collarbone, where his soulmarks are, and he sprints to the tent, Katara on his heels. </p>\n<p>Zuko tries to stop Katara. No kid needs to see what’s in there. But she runs right through him and into the tent. </p>\n<p>—</p>\n<p>Just like in Sokka’s vision, the family is plunged into grief and darkness. Zuko hesitates to intervene. The last thing Katara needs right now is a firebender.</p>\n<p>She pulls the family together, gets them to function again. Until the war tears them apart. Hakoda and the men leave. </p>\n<p>Katara puts on a brave face, for her family and tribe. She dries the younger children’s tears, takes care of Sokka during his hunting mishaps, and does chores with Gran-Gran. And then one day, she leaves to get some firewood. </p>\n<p>As soon as she’s out of sight of everyone else, the mask shatters. She sits on the snow and cries. </p>\n<p>“Dammit,” Zuko mutters. Katara’s always, always been the comforter for everyone else. She comforted him when he was growing up. The least he can do is try to make that up to her. </p>\n<p>He sits next to her and hugs her. </p>\n<p>She wipes her face. “I’m fine. Totally fine.” </p>\n<p>He taps, <em>no</em>.</p>\n<p>She sniffs, and lets him hug her. </p>\n<p>—</p>\n<p>Aang comes, and is taken away by past-Zuko. Katara watches the water with a determination that Zuko’s grown very familiar with. “We have to go after that ship, Sokka. Aang saved our lives, now it’s our turn to save him.” </p>\n<p>Zuko agrees, nudging her forward.</p>\n<p>Sokka speaks up: “Katara, I—”</p>\n<p>“Why can’t you realize he’s on our side? I know you don’t like him, but we have to—”</p>\n<p>“Katara!” </p>\n<p>She turns. </p>\n<p>“Are you gonna talk all day, or are you coming with me?” </p>\n<p>—</p>\n<p>Zuko stays with Katara throughout the journey, again, mostly as an alert system. But also, weirdly, as a comforter. An encourager. He pushes her forward when the earthbenders feel no hope in the Fire Nation prison at sea. Stays with her when Sokka and Aang disappear into the spirit world. Hugs her when Aang accidentally burns her hands. </p>\n<p>It’s always quiet, and it’s always private. She puts on a brave face for the others, is the glue that keeps them together and, in many ways, a mother who keeps them safe. But even the strongest people break from time to time. Zuko does his best to pick up the pieces. </p>\n<p>He also completely understands why Katara has been so livid with him. If he’d found out one of the dearest people he relies on was the same stupid asshole who chased them around the world, he’d be pissed off, too.</p>\n<p>—</p>\n<p>When they finally reach the North Pole, Katara runs into a small problem. </p>\n<p>“You didn’t tell me your friend was a girl,” Pakku says, disdain dripping from his voice. Zuko almost—almost—wishes the Fire Nation invasion of the North Pole had been successful, because <em>that</em>? That’s the exact kind of bullshit Sozin wanted to get rid of. </p>\n<p>Sneaking lessons from Aang is probably a better solution. </p>\n<p>—</p>\n<p>“What are you <em>doing</em>?” Zuko wails as Katara—untrained, idealistic, vulnerable Katara—challenges a fucking bending master to a duel. </p>\n<p>“You’re not going to win,” Sokka warns as she marches out of the palace. </p>\n<p>“I don’t care! Someone has to teach that old man a lesson!” </p>\n<p><em>It’s fine, it’s fine,</em> Zuko thinks, somewhat hysterically as Pakku comes out of the building, ignoring Katara. The few times the group has mentioned Pakku, it’s always been positive and respectful. So obviously he doesn’t hurt her today. Certainly not in the way Ozai hurt Zuko.</p>\n<p>“Go back to the healing hut where you belong,” Pakku says, without even looking at her.</p>\n<p>Zuko’s blood boils. So does Katara’s, and she uses the water whip on him.</p>\n<p>He sucks in a breath as Pakku retaliates, and the fight is on. Katara does very well, certainly better than Zuko did when he was her age. </p>\n<p>Pakku brings a wave of ice spears down on her, and Zuko wants to throttle him. Katara is, thankfully, unhurt, and the whole thing turns out to be a good thing because Pakku recognizes the necklace and realizes his patriarchal ways chased away his soulmate who’s Gran-Gran and blah blah blah…</p>\n<p>If Zuko ever sees him in real life they’re going to have words. </p>\n<p>—</p>\n<p>The next time jump is substantial. They’re on a Fire Nation ship, and it takes Zuko a minute to process what’s going on. As soon as he does, he cringes. </p>\n<p>Katara’s sitting next to a bed. Aang’s bed. He’s unconscious and wrapped in bandages. She’s still wearing the dress that got ripped, singed, and dirtied up in the catacombs, so it’s probably only been a day or two since the fall of Ba Sing Se.</p>\n<p>Zuko sits next to her. He hears her stomach growl, but she doesn’t move, just continues to watch Aang with a distant look on her face. </p>\n<p>He taps onto her skin <em>food</em>, something Sokka made up but nobody has ever actually used. </p>\n<p>“I’m fine,” she says. </p>\n<p>He taps more forcefully <em>food</em>. </p>\n<p>“I can’t leave him,” she snaps. </p>\n<p>He wishes there was an easy way to tap out <em>You need to take care of yourself, too, you idiot</em>. Instead he just taps <em>safe</em>, followed again by <em>food</em>.</p>\n<p>“Shut up! Your princess is the one who did this to him!” </p>\n<p><em>Yes,</em> he agrees, then taps <em>food.</em></p>\n<p>The door opens before she can respond, and Sokka comes in. “Hey. How is he?” </p>\n<p>“He should wake up in a few days,” she says. “Maybe weeks.”</p>\n<p>“Great. Then you have time to eat something.” </p>\n<p>She glares at him. “Not you, too…” </p>\n<p>“Katara, come on,” he says. “You’re no good to anyone if you starve yourself to death.” </p>\n<p>She looks back at Aang. “I can’t leave him. What if something happens? If I messed up the healing, or the spirit water wasn’t enough, or he wakes up early, or—”</p>\n<p>“I’ll stay with him,” Sokka says. </p>\n<p>She blinks. </p>\n<p>“Go eat something,” he says. “And get cleaned up, and maybe take a nap while you’re at it. But eating is mandatory.” </p>\n<p>She sighs, but gets up and hugs him. “Thanks, Sokka.” </p>\n<p>—</p>\n<p>Meeting Hamma is terrifying. </p>\n<p>Not because of the bloodbending thing, though that is disturbing on its own. It unnerves Zuko because of how similar she is to Katara. How, under the right circumstances, Katara <em>could</em> potentially become a twisted abomination of everything that makes her good. She could become like Azula. </p>\n<p>Katara realizes it, too, and breaks down crying as the villagers lead Hamma away in chains. Zuko is there with Sokka, Aang, and Toph. He thinks about how many other girls have lost their parents to this war, how many other people’s souls have rotted away in prisons, how many other otherwise good people have become twisted by hatred. Even if he doesn’t make it out of this war alive—and let’s be honest, he probably won’t; too many people want him dead, and of everyone on Team Avatar, he’s the one who’s least deserving of a happy ending—he has to guarantee that his friends, his soul family, do. They can set the world on the right track. They can get a happy ending and give the world a shot at one, too. </p>\n<p>—<br>—</p>\n<p>He should probably say something reassuring, or touching, or anything other than what he actually says:</p>\n<p>“You idiot! You went up against a <em>waterbending master</em> before you were even trained?!” </p>\n<p>Katara blinks, then scowls. “Oh, that’s rich coming from you, Mr. Let’s-Fight-Every-Firebending-Master-I-Disagree-With.” </p>\n<p>Zuko sputters. “You’re supposed to be the smart one! Doing things like thinking things through and considering consequences.”</p>\n<p>“And the consequences of me <em>not</em> standing up to Pakku would have been worse.”</p>\n<p>“He could have killed you!” </p>\n<p>“And your dad could have killed you!” </p>\n<p>“<em>I’m</em> the hotheaded idiot who doesn’t think things through and jumps over rivers of boiling water! <em>You’re</em> the smart heroic one who actually keeps us together!” </p>\n<p>“Guys, guys,” Sokka says, coming outside. “You’re <em>both</em> idiots.”</p>\n<p>“Shut up, Sokka!” they both snap. </p>\n<p>He shrugs and leaves. “Whatever.” </p>\n<p>The interruption has cooled Zuko down a bit. He runs a hand over his face. </p>\n<p>Katara huffs and pulls him into a hug. “Overprotective dork.”</p>\n<p>“Snowflake,” he retorts. </p>\n<p>She chuckles, squeezing him tighter. “When this is over, we’ll find your mom.”</p>\n<p>He swallows, closing his eyes. “Thank you.”</p>\n<p>That.</p>\n<p>Fucking. </p>\n<p>\n<em>Hurts.</em>\n</p>\n<p>Zuko clutches his chest, whimpering as stray electricity dances around him. </p>\n<p>He hears Katara scream his name and Azula’s insane laugh. </p>\n<p>Shit. Katara's fighting Azula now. Alone.</p>\n<p><em>Get up,</em> he orders himself. Get up, get up, get up!</p>\n<p>—</p>\n<p>Toph would never admit it, but growing up, Zuko—Sunshine—was probably her favorite soulmate.</p>\n<p>It wasn’t that there was anything <em>wrong</em> with the others. Just…well, Katara had always taken care of her, and while she was very different from her parents, Toph sometimes had a hard time separating them in her mind. But it was still great to have an invisible ice pack for her cuts and bruises. Suki was usually there to warn her of danger, whenever a fight was about to go too far. Sokka helped her cheat on her tests, which was always fun. And Aang was always down to play with her, something she desperately needed as a child.</p>\n<p>But Sunshine? He <em>challenged</em> her.</p>\n<p>He helped her bend better, pushed her farther, and always urged her to get back on her feet. That was probably his biggest lesson: always get back up. Doesn’t matter how many times you fall down or what situation you’re in, you get back up. </p>\n<p>No one else did that for her. When she got knocked down, she was coddled by everyone but Sunshine, because he knew she could do better. </p>\n<p>So she gets back on her feet, even as the airship crumbles beneath her. She keeps bringing down more airships even as she and Sokka get separated from Suki. She keeps going, until she can’t keep going any more.</p>\n<p>—</p>\n<p>Zuko can’t get up. </p>\n<p>It’s not even a matter of pain. He can breathe through pain, he’s been doing it all his life. Honestly, compared to getting his face burned, this isn’t too bad. </p>\n<p>The problem is he can’t <em>breathe</em>.</p>\n<p>—</p>\n<p>\n<em>You overprotective, stupid, selfless, son of a—</em>\n</p>\n<p>Katara’s inner monologue cuts off as she dodges another streak of lightning. Unlike Zuko, she can’t redirect any of it. A single hit, and she’s dead. And then nobody will be there to heal him. Assuming he’s still alive. </p>\n<p><em>Of course he’s still alive,</em> she scolds herself. To think of anything else was ludicrous. Zuko never gives up, even in the face of impossible, insurmountable odds. They could ask him to fetch a pearl from the coldest depths of the ocean and he’d find a way to deliver. </p>\n<p>She ducks behind a pillar, in a palace she knows as well as her own village. Zuko is lying in the middle of the courtyard, not moving.</p>\n<p>This is all her fault. If she hadn’t moved, hadn’t caught Azula’s eye, Zuko would have won that fight himself. But she let her fear get the best of her. She’d seen too much of what Azula had done, all of her horrible victories, and hadn’t trusted Zuko to handle himself. </p>\n<p>Now he’s dying. </p>\n<p>Azula’s nowhere to be seen. Katara runs.</p>\n<p>—<br>—</p>\n<p>“It is respectful to bow to your elders,” Pakku says in the rubble of Ba Sing Se’s wall. He opens his arms. “But how about a hug, for your new grandfather?” </p>\n<p>“No way!” Katara yells, hugging him as Sokka squeals behind her. While she’s surrounded by her soul family (most of them, anyway; Aang’s still missing), getting another traditional family member is like striking gold. </p>\n<p>“Welcome to the family, Gramp-Gramp!” Sokka cheers, also hugging him. Katara gives them a little space as Sokka tries to come up with more ridiculous nicknames for the already long-suffering Pakku, and sees Zuko open his mouth. </p>\n<p>She turns on him and scolds, “Be nice.” </p>\n<p>He holds up his hands. “I didn’t say anything!” </p>\n<p>“No, but you were going to.” She softens. “Please, Zuko? He’d never hurt me or Sokka.” </p>\n<p>Zuko’s face twists a little, but he stays quiet, at least until Pakku pries himself away from Sokka long enough to ask, “And who are these three?” </p>\n<p>“Our other soulmates!” Sokka cheers. “That’s Toph, my girlfriend Suki…”</p>\n<p>“And this is the extremely overprotective Zuko,” Katara finishes. </p>\n<p>“I’m not <em>extremely</em> overprotective,” he defends. </p>\n<p>They all make noises against that, but it’s all in good fun, and Katara can tell through the eyeroll he gives that he knows it. They’re all a little overprotective of each other, anyway.</p>\n<p>—<br>—</p>\n<p>Aang almost kills Ozai. </p>\n<p>Not Avatar Aang. <em>Aang</em> Aang. </p>\n<p>Not because of the loss of the Air Nomads. That had been Sozin, and it would be unfair to hold his grandson accountable for his actions. </p>\n<p>Not because of the loss of Katara and Sokka’s mother. That had been Ozai’s father, Azulon. </p>\n<p>Not even necessarily because Ozai wanted to destroy the world. </p>\n<p>But because of Zuko. Every bit of suffering he’s been through could be laid squarely at this man’s feet. </p>\n<p>Aang wouldn’t even have to kill Ozai to get even. Just burning half of his face would likely be enough. </p>\n<p>But he can’t.</p>\n<p>The Air Nomads raised him better than that. Gyatso raised him better than that. Spirits, even <em>Zuko</em> raised him better than that. Using the fire of his spirit to help others, to keep them warm on chilly nights and snowy days, rather than burning them. </p>\n<p>Aang had done his best to return the favor. Once he’d realized what kind of environment Zuko had come from, he tried to show him that there was some good in the world. Even when his mother left, even when he was banished, there was still some kernel of happiness to be found. Some bit of beauty to appreciate.</p>\n<p>The same is true of people. No matter how evil they are, the sheer fact that they’re human deserves to be respected and honored. If he killed Ozai, he’d never be able to look Zuko in the eye.</p>\n<p>So he pulls himself out of the Avatar State and finds another way to end it. </p>\n<p>—</p>\n<p>Zuko’s going to die.</p>\n<p>It would have been bad enough if the lightning had only burned his heart, but oh no. He’s not that lucky. It also got his lungs. Breathing is like fanning a fire in his chest. Every second is agony. </p>\n<p>He realizes that he hasn’t felt his soulmates since bonding with them. Nobody realized it because they were all there physically, so there’s been no need to be there as ghosts from the future. No reason for destiny to intervene. </p>\n<p>But maybe it’s more than that. Maybe it’s because Zuko’s going to die, right here and now, and they won’t get a chance at a second bond. </p>\n<p>He squeezes his eyes shut. <em>I’m sorry, guys. Look after Uncle for me.</em></p>\n<p>—<br>—</p>\n<p>“So what’s the plan on the off-chance that this goes really sour?” Sokka asks. </p>\n<p>It’s dawn, the team standing in the growing sunlight as the Order of the White Lotus gets ready for the day around them. The four teens are waiting on breakfast. </p>\n<p>“What do you mean?” Toph asks. </p>\n<p>He jerks a thumb at Iroh’s tent. “In case <em>that</em> goes sour.” </p>\n<p>“It won’t go sour,” Katara argues. “It’s <em>Iroh</em>.” </p>\n<p>“I know, I know, he’s actually a decent person. But you never know. People can surprise you. I just want to be prepared with a plan for the worst case scenario.” </p>\n<p>Katara rolls her eyes, but Toph seems to be enjoying the mental exercise. “It’s not like we can fight him. He’s the Dragon of the West.” </p>\n<p>“And the leader of the Order of the White Lotus,” Suki points out. “We need him. At least until the comet’s gone.” </p>\n<p>“Oh, yeah,” Sokka grumbles. “We’d probably want to wait for Aang, too. He’d want to fight him.” </p>\n<p>“No he wouldn’t,” Suki says. “Aang and Katara can comfort Zuko while the three of us exact revenge.” </p>\n<p>Sokka’s eyes sparkle. “I knew there was a reason we were dating.” </p>\n<p>“What exactly would this revenge look like?” Toph asks, growing even more amused. She’s got that I-know-something-you-don’t-know smile, but Suki doesn’t know what it could be for. </p>\n<p>“Simple: we target that which he loves most,” Suki said, steepling her fingers. “If that’s not Zuko, then it’s obviously the tea shop.” </p>\n<p>Sokka brightens. “Oh, yeah! We could have Toph flatten it. Or release a dozen hog-monkeys during rush hour!” </p>\n<p>“How would you even get that many hog-monkeys?” </p>\n<p>Sokka and Suki both cringe and look behind them. </p>\n<p>Iroh’s the one who asked the question, looking completely non-plussed at overhearing them plan to destroy his tea shop. Zuko’s standing next to him, face buried in his hand. </p>\n<p>Sokka turns on Toph, who’s cackling. “A little warning, next time?” </p>\n<p>“But this is so much more fun,” she says.</p>\n<p>Zuko raises his head. His eyes are a little puffy, like he’s been crying recently. But so are Iroh’s. And both of them look relaxed and happy, even if Zuko is also incredibly annoyed. “Why are we planning on destroying Uncle’s tea shop?” </p>\n<p>“On the off-chance that he turned out to secretly be a giant dick and was mean to you,” Sokka says, absolutely zero apology in his tone.</p>\n<p>Zuko turns to Suki. “You approved this?” </p>\n<p>“Not the hog-monkeys,” she admits. “Viper-rats would be the better choice. They’re easier to get and <em>way</em> more effective.”</p>\n<p>Zuko face-palms. Iroh laughs. </p>\n<p>Then he <em>bows</em>.</p>\n<p>“I’m grateful to see my nephew found such good soulmates,” he says genuinely. “Thank you for looking after him.”</p>\n<p>The sudden sincerity catches everyone off-guard, except for Zuko, who’s gotten over his annoyance and embarrassment enough to give them a warm smile. </p>\n<p>“We should be thanking Zuko,” Suki says, which turns the firebender pink again.</p>\n<p>Iroh pulls out of the bow and motions for them to follow him. “Come. Breakfast should be ready, and you children need to eat.” </p>\n<p>—<br>—</p>\n<p>Tying up Ozai seems a bit like overkill. He’s lost his bending and can’t even stand. But Sokka insists, and Suki agrees, so Toph bends some cuffs out of the airship.</p>\n<p>“Zuko and Katara?” Aang asks. </p>\n<p>“Dealing with Azula,” Toph says. “But I’ll be honest, I’ve got a pain in my shoulder and I can’t tell if it’s from the marks or something else.” </p>\n<p>Suki stiffens. She felt a pain in her leg during the fight, but she’d assumed it was because she landed wrong. Sokka, who was ordered to lie down on a cot across from the ex-Fire Lord, bolts upright and unwraps his wrist. </p>\n<p>Once he sees his marks, his brown skin turns pasty. “Get us to Caldera City. Right now.” </p>\n<p>“Who is it?” Toph demands as Aang and Suki rush to obey. </p>\n<p>“Zuko. He’s fading.” </p>\n<p>Someone laughs. </p>\n<p>Suki pauses on her way to the wheel. Ozai is apparently more coherent than they thought, chuckling at them. “So you’re the soulmates. That makes sense. Weaklings tend to flock together.” </p>\n<p>She grits her teeth. Even after seeing Zuko's entire life through their soulbond, she still doesn't understand how someone like <em>that</em> could possibly be related to their soul brother.</p>\n<p>Sokka turns his arm so the marks are visible to Ozai. The usually golden flame on his wrist is almost white. “Your son is dying,” he says lowly. “Your daughter might be dead, too. Doesn’t that mean <em>anything</em> to you?” </p>\n<p>Ozai shrugs. “They should have been better.” </p>\n<p>Suki might not be the best at coming up with insulting names. But she can—and does—knock out a fully-grown man with a single punch. </p>\n<p>—</p>\n<p>Katara chains Azula to the grate and runs to Zuko. </p>\n<p>The first thing she notices is how <em>small</em> he is, curled up around his chest. It's so wrong. He's the tallest and largest of all of them, capable of wrapping his entire being around anyone to keep them warm and safe.</p>\n<p><em>Don’t be dead,</em> she prays, turning him over and blanching at the bloody wound on his chest. <em>Don’t you dare be dead.</em></p>\n<p>—<br>—</p>\n<p>Everyone gets ready to leave. Master Piandao is out securing a ride for Sokka, Toph, and Suki so that Katara and Zuko can use Appa. Sokka puts on his armor, which is proving difficult. His hands won’t stop shaking. </p>\n<p>On the third attempt to get the straps together, pale hands take his own. </p>\n<p>Sokka jumps, and swears. “I’m putting a bell around your neck, Jerkbender.” </p>\n<p>Zuko rolls his eyes and takes over putting on the armor. “It’s good that you’re scared.” </p>\n<p>He sputters. “What? I’m not scared. What are you talking about?” </p>\n<p>Zuko gives him a look, and he deflates. </p>\n<p>“It’s good that you’re scared,” Zuko repeats. “It means you’re not stupid.” </p>\n<p>Sokka gives a nervous laugh. He, Toph, and Suki are about to go against several airships’ worth of firebenders juiced up on a magic comet. He’s fucking <em>terrified.</em></p>\n<p>On top of that, his other three soulmates are fighting either the Fire Lord, or his crazy bitch of a daughter. Any one of them could be killed today.</p>\n<p>He’d be lying if he said he wasn’t more worried about Katara than…really anyone else. He’d be crushed if any of them died, but if Katara dies, he’s pretty sure he’d <em>break</em>.</p>\n<p>“So, Katara would kill me if she heard me say this…” he begins. </p>\n<p>Zuko smiles. “I’ll make sure nothing happens to her.” </p>\n<p>Sokka lets out a gusty sigh of relief. “Thanks, man.” </p>\n<p>Zuko finishes with the straps on Sokka’s armor and steps back. Sokka awkwardly rubs the back of his neck. While they’re definitely friends now, he’s not sure how to act in this situation. The first several months they knew each other, Zuko was <em>the</em> bad guy. The one who could take hit after hit after hit and still get back up, chasing them all over the world. When he joined the group to teach Aang firebending, he was still scary, and formidable, and not someone that anyone was particularly worried about getting hurt.</p>\n<p>But then he turned out to be their soulmate, the one firebender Sokka grudgingly liked as a kid. He’d always assumed the man who saved his life at least twice by keeping him warm during blizzards and fishing mishaps was a walking, talking, fluffy blanket. </p>\n<p>Turns out, he wasn’t far from the mark. Zuko’s an awkward turtleduck, something Sokka finds hilarious as well as endearing. The desire to bundle him up in a dozen blankets and keep him tucked away from the world began to kindle as soon as he and Aang bonded. </p>\n<p>It turned into a raging <em>need</em> when it was Sokka’s turn to soulbond with him. </p>\n<p>Which is stupid. Intellectually, Sokka knows that Zuko is just as scary, formidable, and fierce as ever. Arguably more so, now that he has something more wholesome and concrete to fight for. His bending is stronger than every before. Spirits, even without the bending, he’s more dangerous than most people on the planet. </p>\n<p>So is Katara. That doesn’t stop Sokka from worrying. </p>\n<p>“Don’t die today, okay?” he asks. “We kind of need you.” </p>\n<p>Zuko rolls his eyes, and there’s that self-deprecating look Sokka hates so much. “Worst case scenario, Uncle Iroh takes the throne and—”</p>\n<p>“I’m not talking about the fucking throne or the world or whatever,” he snaps. “We need <em>you.</em> Get that through your thick, fiery skull.” </p>\n<p>Zuko stares at him, then cracks a tiny smile. “I’ll try not to die today. Promise.”</p>\n<p>—<br>—</p>\n<p>Sokka honestly can’t say how long it takes them to to reach Caldera City. He spends the whole time staring at his wrist. </p>\n<p><em>Come on, Zuko,</em> he thinks, clutching his arm so hard there will definitely be bruises. <em>You promised.</em></p>\n<p>Aang is outside of the ship, using his airbending to make them go faster. Toph leans against the wall, not too far from Ozai, who’s drooling on the floor from Suki’s hit. Suki herself is driving the airship.</p>\n<p>The mark flickers, going from gold to gray and back again. It flickers like a real fire, or some other thematically appropriate shit. </p>\n<p>And then, suddenly, it stops. </p>\n<p>He holds his breath. </p>\n<p>“Sokka?” Suki calls, concerned. “What’s wrong? Why are you crying?” </p>\n<p>Is he crying? Sokka wipes his face and realizes that, yup, definitely crying. </p>\n<p>He looks up, grinning as he shows her his wrist. “He’s okay.” </p>\n<p>—</p>\n<p>Zuko squeezes his eyes shut. <em>I’m sorry, guys. Look after Uncle for me.</em></p>\n<p>It’s getting harder to breathe. Katara and Azula are still fighting. He gives himself maybe two minutes before he’s dead, if he's lucky. </p>\n<p>That’s when he feels it. Light, fluttery fingers tapping <em>I’m here</em> over and over on his shoulder.</p>\n<p>\n<em>Aang.</em>\n</p>\n<p>In a blink, they’re all there. Katara’s curled up against his chest, cooling the burn. Suki’s at his back. Sokka’s holding his hand so tight he wonders if souls can leave bruises. Toph’s fingers dig into his arm right under Aang. </p>\n<p>He honestly can’t tell if they’re physically there, or if it’s the soulbond, or just his imagination. He can’t hear anything anymore, his lungs are pulling in less air with every breath, and right now the only things that really process are the pain and the touch of his soulmates. </p>\n<p>It's not the worst way to go, but right now Zuko's thinking that this <em>isn't</em> the way he goes. He might just survive this, if he can keep sucking in one breath after another. </p>\n<p>He manages to force another six thin, raspy breaths--barely--before someone rolls him over. The cool feeling seeps into his chest, soothing the burns on his heart and lungs. The pain lingers, then dissipates. </p>\n<p>He takes a full breath and opens his eyes. </p>\n<p>His soulmates are gone but for Katara. The glow of the water illuminates her face until it stops, and she meets his eyes. She’s smiling, and crying. </p>\n<p>“Thank you, Katara,” he whispers. </p>\n<p>—</p>\n<p>It still fucking hurts. </p>\n<p>Not like he’s going to tell anyone else that. </p>\n<p>The first thing he asked, once he was sure Azula was secured and Katara herself was okay, was to see her soul marks so they could check the others. Her marks form a ring around her bellybutton. They’re all there, vibrant and colorful and so <em>not dead.</em></p>\n<p>Now, as the airship lands in front of the palace, Zuko does his best to cover the very visible wound with the burnt remains of his shirt. It doesn’t work, though, as the first thing that happens is Aang flies down and grabs him in a hug. </p>\n<p>“You’re okay!” he cries. </p>\n<p>“Aang, ow!” </p>\n<p>The Avatar immediately pulls back. He tugs Zuko’s shirt away, and winces, but gives a wobbly smile. “Looks like we’re scar buddies.” </p>\n<p>Zuko looks him up and down. All sorts of nightmarish scenarios came to his head when he realized Aang spent the last half hour fighting Ozai, ranging from him dying to getting a burn like Zuko’s to getting shot by lightning again. Even after seeing the mark on Katara confirming he was alive, that didn’t mean he wasn’t hurt.</p>\n<p>He’s got a few bruises and his shirt is gone. But he’s fine. Not a single burn. </p>\n<p>The relief is so powerful Zuko almost falls. Katara and Aang catch him and sit him down on the edge of a little stone wall around a garden. </p>\n<p>“I’m fine, I’m fine,” he mumbles. </p>\n<p>“Right,” Aang says.</p>\n<p>Zuko rolls his eyes. “Are you okay?” </p>\n<p>“Oh, yeah! Got the Avatar State back and everything.” </p>\n<p>“Is everyone else okay?” Katara asks. </p>\n<p>“Well, Sokka broke his leg…” </p>\n<p>The idiot in question hops out of the ship, with Suki the only thing keeping him upright. </p>\n<p>“Sit your ass down before you hurt yourself!” Zuko orders. </p>\n<p>“It’s <em>fine</em>.” He hops until he’s got one arm around Zuko and another around Katara. “You’re both okay!” </p>\n<p>Katara smiles. “We are.” </p>\n<p>Sokka smacks Zuko over the head. “Don’t scare us like that again, Jerkbender.” </p>\n<p>“Hey, it wasn’t actually my fault! Blame Azula. She’s the one who shot lightning at Katara.” </p>\n<p>The waterbender winces while Sokka reels back, looking at his sister. “Are you okay?” </p>\n<p>“<em>I’m</em> okay,” she says. “Because <em>somebody</em> took the hit without properly redirecting it.” </p>\n<p>“I redirected most of it!” Zuko defends. </p>\n<p>At Katara’s flat look, he amends, “Some of it. Enough that I’m still breathing!” </p>\n<p>Sokka looks at him and seems to be about two seconds away from crying. Zuko quickly points out the broken leg to Katara, and she gets her brother lying on the wall to look it over. Suki rolls her eyes and mutters something that sounds suspiciously like, “Men.” </p>\n<p>Zuko looks around and frowns. “Where’s Toph?” </p>\n<p>“Securing Ozai,” Suki says. </p>\n<p>He blinks. “He’s…still alive?” </p>\n<p>It’s a weird feeling. A part of him is relieved, which is a surprise. The other part is filled with dread. Already he can see the Fire Nation splintering as at least half of them refuse to follow him and instead flock to Ozai. The Hundred Year War might be over, but a nasty civil war is just a heartbeat away if…</p>\n<p>“I took his bending away,” Aang says. </p>\n<p>Zuko stares at him. “Is that a euphemism or…” </p>\n<p>“It’s call energybending. It’s really cool, and I think it might be how we got our bending in the first place. See, there’s this giant lion turtle who showed me, and—”</p>\n<p>“Hey, Sunshine!” Toph calls, stepping out of the ship and metalbending something behind her. “Where do you want this?” </p>\n<p>Ozai is in crude metal cuffs and has a nasty black eye. Toph drops him at Zuko’s feet. </p>\n<p>Ozai bares his teeth. </p>\n<p>Zuko stares back at him. </p>\n<p>After a beat, Ozai glances around and asks, “So. Are you going to deliver the killing blow yourself, or have one of these children do it?”</p>\n<p>Zuko raises an eyebrow. “You think you’re here to be executed?” </p>\n<p>“Isn’t that what you want, <em>Fire Lord</em>?” he sneers. “Revenge?” </p>\n<p>No. That’s what <em>Ozai</em> wants. Zuko, realizes, wants absolutely nothing to do with him. </p>\n<p>He realizes with a jolt that his father has built his entire identity around firebending: using it for power, using it for fear, using it to secure his own superiority over everyone else. Without it, he’s nothing. Right now, death would be a relief. </p>\n<p>Zuko stands. Katara reaches out to steady him, but he doesn’t need it. He cradles his father’s head, his thumb almost touching the left eye. “If I wanted revenge, you would already be on fire.” </p>\n<p>Ozai stiffens beneath his hand. His soulmates—his family—hold their breath. </p>\n<p>Zuko pulls away. “Toph, you know where the prison is?” </p>\n<p>“Yup.” </p>\n<p>“Do me a favor and take him there. Make sure to warp the lock until I know the guards can be trusted.\"</p>\n<p>She does it without question.</p>\n<p>—</p>\n<p>Iroh finds him later, after he’s been properly bandaged. </p>\n<p>The entire soul family is in the palace. Zuko could have claimed the royal chambers for himself and given everyone else lavish guest rooms, but they decided against it. Iroh stumbles upon them all in one of the audience chambers. Mattresses, blankets and pillows litter the ground. Some are haphazardly thrown, while others—namely the ones supporting Sokka’s broken leg—are carefully placed. </p>\n<p>They’re all dog-piled on one another, each child touching at least two of their soulmates. Zuko is sandwiched between Katara and Sokka. All of them are asleep. </p>\n<p>Iroh smiles, and leaves the room, ordering the servants not to let them be disturbed until morning, at least. They deserve the rest.</p>"
}