{
  "id": "20983028",
  "url": "https://archiveofourown.org/works/20983028?view_full_work=true",
  "author": [
    "qurbat"
  ],
  "title": "tell some storm",
  "rating": "General Audiences",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "魔道祖师 - 墨香铜臭 | Módào Zǔshī - Mòxiāng Tóngxiù",
    "陈情令 | The Untamed (TV)"
  ],
  "relationships": [
    "Lan Zhan | Lan Wangji/Wei Ying | Wei Wuxian",
    "Jiang Cheng | Jiang Wanyin & Wei Ying | Wei Wuxian",
    "Lan Yuan | Lan Sizhui & Wei Ying | Wei Wuxian",
    "Nie Huaisang & Wei Ying | Wei Wuxian"
  ],
  "characters": [
    "Wei Ying | Wei Wuxian",
    "Lan Zhan | Lan Wangji",
    "Lan Yuan | Lan Sizhui",
    "Lan Jingyi",
    "Ouyang Zizhen",
    "Jiang Cheng | Jiang Wanyin",
    "Nie Huaisang",
    "Jin Ling | Jin Rulan",
    "Lan Huan | Lan Xichen"
  ],
  "additional_tags": [
    "Post-Canon",
    "Hurt/Comfort",
    "Fluff",
    "liberal amounts of outsider POV",
    "the legend of wangxian",
    "how to create a romance epic for dummies"
  ],
  "language": "English",
  "series": "",
  "published": "2019-10-11",
  "completed": "2019-11-04",
  "words": "31,210",
  "chapters": "2/2",
  "comments": "442",
  "kudos": "9,714",
  "bookmarks": "3,665",
  "hits": "125,780",
  "summary": "<p>\n<i>\"We were raised as a generation of war, A-Yuan,\" Xian-gege said to him. \"If your generation choses to be one of love - well, I don't think any of us would be opposed to that.\"</i>\n</p>\n<p> </p>\n<p>In the aftermath of the events at the Guanyin temple, the cultivation world scrambles to understand their current reality. A man roams the countryside with a string of white in his hair. Another sits on the highest seat of power with a ribbon of red around his forehead. The younger generation turns out to be full of romantics. Nie Huaisang is to blame for everything, always. Jiang Cheng realizes that happiness has been more that 16 years overdue. </p>\n<p>Wei Wuxian declares that it's time that bitch pays up. </p>\n<p>After a generation of war - much to the consternation of the elders, much to the delight of the young, much to the pleased shock of the subjects of the tale - the world welcomes a love story with open arms.</p>",
  "notes": "<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">notes</a>.)\n</p>\n<p>a gift for ct, entirely inspired by <a href=\"https://twitter.com/dazaiverse/status/1175212117047177217\" rel=\"nofollow\">this</a> prompt which haunted my waking dreams and the subsequent conversation we had in the comments. also, for fao, who wanted <a href=\"https://twitter.com/dazaiverse/status/1178031861076938752\" rel=\"nofollow\">more </a>of wangxian being recognized as the healthy romantic couple they were.</p>\n<p>This was meant to be a one shot but then my own impatience and Nie Huaisang took over so: next (and hopefully the last) chapter: the juniors! Yunmeng bros! Lan bros! Xian-gege and A-Yuan! and finally, Wanggxxiiiiaaaaannnnnn!!!! Many lose ends to try and tie together, so stick with me folks. </p>\n<p>title is from a <a href=\"https://www.youtube.com/watch?v=fBI1VKnAZdc\" rel=\"nofollow\">Hindi</a> song, with lyrics to the effect of <i>tell some storm, I've found my shore</i>, the beauty of which can never be fully translated into English. As always, I'm on <a href=\"https://twitter.com/dazaiverse\" rel=\"nofollow\"> @dazaiverse</a> for any customer complaints and also up for crying about wangxian in the comments.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>WEI YING, HAPPY BIRTH! YOU ARE LOVED AND CHERISHED AND ENTIRELY DESERVING OF IT!</p>\n<p>wrote this chapter while listening to luck life's <a href=\"https://www.youtube.com/watch?v=8F2xbQJgHs4\" rel=\"nofollow\">bokura</a> and iu's <a href=\"https://www.youtube.com/watch?v=qch5tdUQvYk\" rel=\"nofollow\">love poem</a>, which have the lines \"my empty palms take your hand, and with that alone we're able to go on\" and \"I’ll sing for you, who is walking through an especially long night\", and really recommend you read it the same way. also, for wwx's lullaby for lsz....imagine \"a narnia lullaby\" and remember that it was child kidnapping music in the movie lmao</p>\n<p>If any of you follow my <a href=\"https://twitter.com/dazaiverse\" rel=\"nofollow\">twitter</a>, or even read my other works, you know that the treatment of the Wen remnants and civilians really makes me so mad, esp in cql where it's more visible. this is my attempt at some resolution, for everyone involved. also, fusing parts of the novel with cql, but just for the style lol</p>\n<p>until next time, this is roons, signing off!</p>\n<p>Edit: this has art!!!! Thank u <a href=\"https://mobile.twitter.com/insidetwizzles/status/1192815418202828802\" rel=\"nofollow\">addie</a> and <a href=\"https://mobile.twitter.com/butleronduty/status/1195011695699099649\" rel=\"nofollow\">moose</a>!<br>edit #2: now with <a href=\"https://archiveofourown.org/works/25398004\" rel=\"nofollow\">companion fic!</a></p>",
  "text": "<p>1.</p>\n<p>They parted knowing that this would not be the last time they met. </p>\n<p>How could it? With all the strings which bound them together? Sooner or later, they would once again tangle and knot, just as they had on that cloud covered mountain a lifetime ago, just as they had on Dafan not so long ago, with a rough bamboo flute drawing them close to each other like moths to a flame. </p>\n<p>As long as they would live, Wei Wuxian realized, they would meet each other again. And to think, this time around, he even had <em> Chenqing! </em>Ahh, he would surely play that song brighter, clearer now than he ever had before, his otherwise terrible memory having labored to memorize each note and imprint it under his skin, fit it in a space near his heart that had already been carved out so long ago. </p>\n<p>“When we meet again,” he tells Lan Wangji, “you must tell me the name of that song, Lan Zhan.”</p>\n<p>Lan Wangji looks at him, his eyes softened in the shade of the wooded path. “When we meet again,” he says, his voice as clear and gentle as a river at dawn, “you will know.”</p>\n<p>It wasn’t a confirmation, wasn’t even a good answer. Yet, still, Wei Wuxian could feel his eyes fill with water, threatening to drip down his cheeks as it hadn’t in years. How long had it been since he had cried? Why on earth would he want to cry now, when his life was less dark than it had been in ages?</p>\n<p>Looking at the man in front of him, he thought that if he felt his heart beat, faster than it ever had before. It beat like it was trying to escape his fragile chest, rip itself some his body and go to the other. Delirious, he thought that if he could, he would let it do that, would put his heart in Lan Wangji’s hands himself, trusting the other man to keep it safe and sound more than he himself would. </p>\n<p><em> Lan Zhan, </em> an idle voice in his head began, <em> wouldn’t be happy if tore your heart out now, after everything he’s done to make sure that it’s still beating. </em></p>\n<p>The creepy voice in his head was correct — for some reason, he was sure that if he did anything that stupid in front of Lan Wangji, the other man would give him that <em> look </em>of sheer disapproval, the one which he had always been at the recovering end of as a teenager. Back then, his skin thick, he could shrug it off. Now, weakened by exposure to the other’s light.....he definitely wouldn’t be able to stand it!</p>\n<p>So, to avoid falling prey to such an attack just as he was leaving, Wei Wuxian lifted his hands to his hair in a sudden movement, ignoring how Lan Wangji raised his eyebrow in question. With one sharp tug, the ribbon binding his hair together came off, leaving him with a thread of red clutched between his fingers even as waves of black hair came tumbling down from their hold.</p>\n<p>Standing on a path with his hair down like this, where anywhere could stumble upon and see him in this state — it made him feel strangely vulnerable. Honestly, he didn’t know the last time he had worn his hair like this in public, had been without the shock of red that marked his presence like a beacon.</p>\n<p>But doing this with Lan Zhan.....that was alright. </p>\n<p>He took a deep breath and moved forward, painting a cheery smile on his face. Lan Wangji allowed him to move closer to his body with no resistance, but his eyes widened upon seeing what the other planned to do. </p>\n<p>“Wei Ying — ”</p>\n<p>“Lan Zhan,” Wei Wuxian cut in, desperately closing his ears to what was sure to be a protest from the other, “I’m leaving this with you as insurance, alright?”</p>\n<p>One trembling hand deftly wrapped the red string around Lan Wangji white-covered wrist, again and again until the patch of red spread half-way through his forearm. Then, having come to the end of the thread, practiced fingers tied a knot around the ends, tight enough that it wouldn’t come apart with a tug, but lose enough that Lan Wangji would be able to remove it without needing to cut the ribbon off. </p>\n<p>Wei Wuxian continued to speak, head looking down at the limb, one hand still holding the other man’s wrist. “So,” his voice broke off into a whisper, “so, you have to promise that you’ll return it to me when we next meet, alright Lan Zhan? I’m a poor man, you know, that’s my only ribbon—”</p>\n<p>The feeling of pressure on his hair cut him off, forcing him to jerk his hair up. His eyes widened with surprise at how close the other man was, separate from him by only a few inches. Like this, and he could see himself being reflected back in this unnaturally gold pools. Any closer, and he would be able to feel the other man’s quiet breath on his face, any closer and he’d be tickled by the other’s impossibly long eyelashes, any closer and he would surely lose all his precarious self-restraint and ki—</p>\n<p>His delirious thought process screeched to a stop as he noticed the actions of the other man, eyes widening to an impossible degree in his shock. “L-Lan Zhan - what - ”</p>\n<p>Sometime in between his silent internal breakdown, Lan Wangji had gathered his hair back into its usual high ponytail, the usually stubborn tresses giving the terrifyingly efficient Hanguang-jun no trouble at all. With his other hand, Lan Wangji reached into his own hair. </p>\n<p>The Yiling Laozu, known for his sharp, never ceasing tongue, watched, dumbstruck, as the reticent Second Jade took off his ever-present head-ribbon. Lan Wangji approached him slowly, as gentle as he would one of his rabbits, only to bring both his hands together and loop that cloud-patterned ribbon around his hair, once, twice, thrice, only settling when the metal rested as the top of his ponytail and the rest of the ribbon flowed freely in the air.</p>\n<p>Satisfied with his work, he stepped back. A corner of his mouth tugged into a smile at the shocked expression on Wei Wuxian’s face. “Insurance,” he said, repeating the other man’s words back to him, “for when we meet again.”</p>\n<p>Wei Wuxian closed his gaping mouth with a <em> click. </em> He didn’t dare to say that he fully understood what the Lan ribbon stood for; why only parent, spouse or child was supposed to touch it. Oh, someone must have told him the reasoning behind it, but Wei Wuxian’s memory ensured that it slipped away like an eel in water. But this is what he knew - this man in front of him, the same man who had once been so angry at him for touching that ribbon without permission, the same man who had always glared him down when he asked teasingly to borrow it.....to this man, that ribbon was important. </p>\n<p>Even if Lan Wangji had been unnaturally patient with him ever since his return, even if he had allowed him to go about tugging and touching in the form of that paperman where he once would have slapped him away - surely this - surely this much -</p>\n<p>“Wei Ying,” Lan Zhan’s voice brought him back from disarray again - and that had become a habit, hadn’t it - and he looked up to see Lan Wangji stare down at him, eyes as calm and peaceful as the waters of home he once knew. The other man smiled, and Wei Wuxian could feel his brain screech further and further to a stop, even as a red-covered wrist rose up to tug at the ends of the white ribbon now trailing his hair. “Return to me.”</p>\n<p>Inexplicably, suddenly, Wei Wuxian was sure that he was five seconds from crying. Breathing in deep, he closed his eyes to calm himself down, but when he opened them again, he was staring at Lan Wangji through the same mist which had clouded them before.</p>\n<p>Helpless, he nodded. “Yes,” he spoke, as though through a dream, “I’ll return it to you, Lan Zhan.”</p>\n<p>They both knew what he was really saying. </p>\n<p>\n<em> This time around, I’ll return to you. </em>\n</p>\n<p> </p>\n<p>2.</p>\n<p>“That’s <em> it?” </em> Ouyang Zizhen hissed, more vicious than Lan Jingyi had ever heard him, “They’re going to leave just like that?!”</p>\n<p>Lan Jingyi would answer him, he really would, if only he could get his entire face to stop burning first. Crouching and hidden as they were in the bushes, it was only the lack of sunlight which kept everyone from seeing his face turn redder and redder by the minute, an expression which he was sure his fellow GusuLan disciples mirrored. </p>\n<p>“I can’t believe this,” Ouyang Zizhen was still saying, “I can’t believe they’d just leave like that! They’re perfect for each other — what’s stopping them?!”</p>\n<p>Lan Jingyi could only thank the heavens in his heart that Hanguang-jun and Senior Wei had already departed from the path. The volume of the disciples who had gathered to watch their parting was increased second by second — he did not want to imagine the sheer amount of lines which would await him if they were discovered. </p>\n<p>Disciples from minor and major sects mingled together, gossiping like bored housewives. Only those from the GusuLan stayed silent. </p>\n<p>One of his junior reached out to him, still shell-shocked, “Shixiong, shixiong, did - did they just—”</p>\n<p><em> “Shh!” </em> Lan Jingyi blushed again, glancing around furtively like he expected Lan Qiren to descend down upon them and punish them for the very thoughts they were thinking. “Don’t say it!”</p>\n<p>Jin Ling, who had been quiet until now caught on to their exchange with all the ferocity of the hound he liked to tug around. “Don’t say what?” he asked, drawing the attention of the rest of the congregation. His eyes narrowed and he poked Lan Jingyi sharply between his ribs, “Out with it - what are you hiding?”</p>\n<p>Lan Jingyi was caught between hitting back at the younger boy or turning red once again. Ouyang Zizhen took advantage of that moment of indecision, heavily clasping his shoulder with one hand and sending them both rolling out of the bushes. “What?!” The other’s eyes were bright, curious, and Lan Jingyi knew with a helpless certainty, that he  wouldn’t be letting go until he got answers, “What do you know?! Did they promise to meet each other somewhere else beforehand? Senior Wei, he spent so much time at the Cloud Recesses since his return — they must have already planned out his living circumstances and everything in advance!”</p>\n<p>Oh, Lan Jingyi doubted that Hanguang-jun and Senior Wei had time to speak about such things, given how busy they had been over the past few days. <em> Still, </em> his traitorous ears turned red, <em> that matter is resolved regardless, isn’t it? </em></p>\n<p><em> “What, What, What is it?” </em>Ouyang Zizhen began to shake him back and forth, “I know you know something, I’m not letting go until you tell me—”</p>\n<p>Through the dizziness accumulating in him, Lan Jingyi spat out - “Hanguang-jun - Senior Wei - ribbon - <em> married - ” </em></p>\n<p>Ouyang Zizhen’s hands fell slack from his shoulder, and Lan Jingyi’s laid his head down on the earth and took deep breaths to calm down. Occupied with the thundering in his ears, he didn’t pay attention to the silence which had overtaken the whole group. He really should have.</p>\n<p>When Lan Jingyi opened his eyes again, it was to the tip of an arrow pointing at his face. His junior had fled somewhere, the cowards, abandoned him to the fate of having to explain exactly what Hanguang-Juan’s gesture meant —</p>\n<p>Jin Ling, vicious, <em> “Start talking. What do you mean, </em> <b> <em>married</em> </b>?!”</p>\n<p>Ouyang Zizhen stood by his side, looking more excited than Lan Jingyi had ever seen him. He was surrounded by curious disciple cultivators on all sides. Suddenly, he had a flashback to a memory from childhood - when he and Sizhui had fallen asleep out on the hill and woken up to a circle of red-eyed rabbits staring at them, far past curfew.</p>\n<p><em> Sizhui, </em> Lan Jingyi thought, <em> Sizhui, come save me! </em></p>\n<p>But Sizhui was out on his own journey and even if he was here, Lan Jingyi wouldn’t have let him face these dogs by themselves. Who knows how Ouyang Zizhen would have torn the boy apart after learning that he was the child that Senior Wei and Hanguang-jun had both raised?!</p>\n<p>Lan Jingyi thought that he really was a good friend. With a quick prayer to the ancestors of his clan to forgive him, he began to story of giving one of the GusuLan’s most intimate secret practice away.</p>\n<p>(And so, began the creation of another most intimate secret practice — although the secret part was up for debate.)</p>\n<p>(<em> “They got married?! Just like that?!!” </em></p>\n<p>\n<em> “Jin Ling, shh! If Master Lan Qiren hears that I’m telling you all this, he’s going to have me whipped raw.” </em>\n</p>\n<p>As always, Ouyang Zizhen remained the worst, <em> “To think, all this time, Senior Wei, Hanguang-jun....ahh that explains so much! The trust, the familiarity, the intimacy—” </em></p>\n<p>\n<em> “Zizhen, shut the fuck up!”) </em>\n</p>\n<p> </p>\n<p>3.</p>\n<p>The crux of the matter was this: Wei Wuxian did not wish to leave Lan Wangji. Lan Wangji did not wish to leave Wei Wuxian. However, they had both grown jaded enough to realize exactly which wishes they could achieve when by now.</p>\n<p>With his brother in mourning, with the cultivation world in disarray, Lan Wangji had to stay back and help to rebuild what had fallen apart in the aftermath of Jin Guangyao’s revelations. There was no one to match his reputation among the civilians or the cultivators — the pure, clear Jade, who even upon suspicion of being bewitched by the Yiling Laozu, has been right all along. Raised with his duty, Lan Wangji was loathe to leave his sect or his brother behind, when it was within his power to help.</p>\n<p>(And if he held ambitions to dragging the rot which had infected their world so badly out into the light, if he had any ideals of putting into place structures to ensure that cultivators would once again work according to true righteousness - the kind that saw them forsaking their sect, their reputation, their place in the world for the sake of defenseless prosecuted civilians - well, that was something which he would keep to himself, if only for now.)</p>\n<p>With his name cleared out, Wei Wuxian was technically free to roam the lands however he wanted. The Yiling Laozu, now proven innocent - ah, that was a commodity that sects would fight to accept within their ranks, especially considering the amount of power he had demonstrated to hold even without a proper golden core! To hold the man who arose from the dead to bring the downfall of the one who initially killed him - how thrilling!</p>\n<p>....except, Jin Guangyao wasn’t the one to kill him. In fact, until that confrontation at the temple, Jin Guangyao had never been involved in direct combat with Wei Wuxian. No, the ones who came after him, the ones who provoked his temper and destroyed the life he was trying to build in that dead mountain - it was the very cultivators who now praised his name.</p>\n<p>In all honesty, Wei Wuxian would have liked to say that he wasn’t affected by how his reputation was construed and misconstrued, how it went from one of the spectrum to the other, over and over again at the whims of these cultivators. But he <em> was, </em>he was so, so tired of the cultivation world and all its politics and hierarchies, the way it sought to divide the world into good and evil, as if life could ever be that simple. If he had been given the chance, he knew, he would have happily spent his life until the end of his days on that mountain, growing lotuses, making A-Yuan laugh, protecting the weak and living without regret. </p>\n<p>But this was his life now. The world which once sought to make him betray his own ideals — the ideals which it had inculcated in him — the world which condemned and commended and <em> wanted </em>him, dead or alive, he no longer wished to drown in its waters. No, now, finally free, he would still uphold the vow that he had made so long ago — protect the weak, punish the evil, live life without regrets, as free as a cloud, wandering in the certainty that it would always be at home in the sky.</p>\n<p>Two men walked in different directions. They walked with the surety that they were both each other’s skies, that all-accepting, all-encompassing home which they would always return to.</p>\n<p> </p>\n<p>4.</p>\n<p>Lan Wangji returned to the ruins of temple lacking his forehead ribbon and with a new ribbon tied out his wrist, the red standing out starkly on the pure white of his visage. He had left along with Wei Wuxian, and now, he returned alone. </p>\n<p>In all honesty, Jiang Cheng didn’t expect him to return at all. He had seen the way those two idiots that looked at each other, how Lan Wangji, who stared at him with such disdain and disgust, cradled Wei Wuxian as though he made of the most precious glass, how he looked at the other with infinite tenderness, so much so that even Jiang Cheng, who did not have any good relations with the Second Master Lan could recognize his expression.</p>\n<p>More red joined the blood spattered ground as Lan Qiren spat blood in shock. </p>\n<p>Lan Wangji seemed to pay no mind to the stillness which had fallen across the gathering upon his return, making a beeline for the nearby Lan disciples and asking after his brother. Stuttering, blushing, their eyes plastered to the ground, they replied that he had left already for the Cloud Recesses. Lan Wangji was clearly concerned about his sibling’s mindset, but stayed where he was, recognizing the duty which had fallen upon his shoulders. </p>\n<p>Jiang Cheng thought he looked strange, with the turns of red tied around his wrist, without the ever-present strip of white tied around his forehead. He half expected the strip to leave behind an untanned line of white against the other’s pale face, but seeing the even coloration of his skin just made him feel even more pissed off. </p>\n<p>Of course, <em> of course </em>the bastard would be perfect even in this way. God, Jiang Cheng couldn’t stand him.</p>\n<p>Lan Qiren approached Lan Wangji with the fury of a martial god in his steps. “Wangji!” he barked out, his footsteps faltering as he neared his disobedient nephew. “What is the meaning of this?!”</p>\n<p>Lan Wangji turned to him, an eyebrow raised. Calmly, he greeted, “Uncle.”</p>\n<p>Lan Qiren looked like he was going to breathe fire, “You would still call me uncle?” He stopped, breathing deeply, in and out. When he opened his eyes again, he looked exhausted, as though he had undergone some mortal trial. Jiang Cheng found, to his horror, that he sympathized. “Wangji, where is it? What have you done?”</p>\n<p>Lan Wangji bowed, mild as a spring breeze. “Respect, Uncle,” he said, “it’s where it has always belonged.”</p>\n<p>Jiang Cheng thought Lan Wangji looked strange like that — with the absence of white, with the presence of red. Thought he looked lonely without the black hovering by his side, flitting in-and-out like a hurricane circling the eye of some storm. </p>\n<p>Jiang Cheng thought he could recognize that loneliness like an ache. </p>\n<p>.....ahhh, it really pissed him off how steady Lan Wangji looked, as if the earth hadn’t shaken under all their feet, as if the foundations of the cultivation world hadn’t been affected over the course of the last week. Who knows, though, maybe things had been entirely different for him. Maybe his world had actually come back, had rebuilt after falling apart sixteen years ago, even as Jiang Cheng’s well-placed beliefs had been torn apart. Maybe this was Lan Wangji, reaping happiness that had been more than a decade overdue. </p>\n<p>Jiang Cheng shook his head, suddenly exhausted. He felt as though he could sleep for years, but there was still so much left to do. </p>\n<p>He shot another look at Lan Wangji, snorting at the sight of one of the ends of the red ribbon coming loose at his sleeve. Lan Wangji gently thumbed the fluttering cloth, looping it back around and tying a tighter knot. Jiang Cheng made a face of disgust and turned away — only to freeze. </p>\n<p>Jin Ling wandered in with a rowdy group of disciples, all pushing and whispering, flooding into Jiang Cheng’s mind memories of a simpler time, when he himself had been in that group traversing across the pier, across cloud-hidden mountains, the familiar weight of a solid arm draped around his shoulders. Jin Ling still looked pale, he noted, shock from the betrayal of one of the only people he had to his name. The ring of red around his neck stood out starkly, making Jiang Cheng clench his fist.</p>\n<p>If they had been even a second slower.....</p>\n<p>The thought spurred him into movement. He called out loud, “Jin Ling!”</p>\n<p>Jin Ling tensed, before turning to him slowly. “Yes, uncle?”</p>\n<p>Jiang Cheng looked at him for a second, taking in the tremble of his fists, the exhaustion present in his face. He wanted to tell Jin Ling to come back to Lotus Pier — to stay there until the anthill which had been overturned settled down somewhat. This child — the child that he had raised (in conjunction with the man who planned to have him orphaned, and wasn’t <em> that </em>a thought Jiang Cheng refused to touch with a ten foot pole), the child who he had loved and so nearly lost but an hour ago, he wanted to protect him more than anything.</p>\n<p>Instead, he looked at Jin Ling, surrounded as he was by his peers in the aftermath of a world overturned. He had been smiling as he entered the ground, or smiling as much as Jin Ling ever did anyway, the corners of his mouth turned us in a soft smirk, so like his father. Happiness, Jiang Cheng remembered, which was sixteen years overdue. He thought about the shock and happiness in his eyes when that thin black figure touched his cheek, scolded him for being reckless (ha! The irony), and held him to his chest. Thought about the spoilt child who refused to leave his mother’s arms for even a second, for the entire one month that they had each other.</p>\n<p>Jiang Cheng said, “I’ll be waiting for you back at Lotus Pier,” and turned away, purposefully ignoring the incredulous delight which spread across Jin ling’s face. Sixteen years of overdue happiness, he reminded himself, sixteen long, painful, lonely years. In all honest, overdue for even longer, since before that skinny, trembling, scared child had entered his home and called him <em> brother. </em></p>\n<p>His sister would never be able to hold her child again. His brother had just held his nephew less than an hour ago. </p>\n<p>Wei Wuxian might have said “let’s move on from the past,” but Jiang Cheng couldn’t, not when the days which haunted him occurred far before the world started to burn around him, when the past he remembered and longed for was filled with laughter and warmth as gentle as the spring sun. </p>\n<p>The present was miserable. The past was what brought him joy. The future had no hope but what he had invested in his nephew, then the last of his family. But maybe now, maybe after everything, he could begin to change that.</p>\n<p>Jiang Cheng was strong, was born of the ashes of war, with lightning and steel in his blood. Sixteen years was a long time to wait for someone to come home, but he knew could wait longer.</p>\n<p>(He would have stayed for longer to manage the situation, except the disciples behind him started dreamily sighing at the sight of Lan Wangji still staring down his uncle (the poor man, he never had to deal with stubbornness like this before did he.) One exclaimed about the <em> romance </em> of it all, and Jiang Cheng was <em> gone. </em>)</p>\n<p> </p>\n<p>4.5.</p>\n<p>\n<em> My dearest Lan Zhan,  </em>\n</p>\n<p>\n<em> I hope this letter finds you well. By which, of course, I hope that you haven’t created some scandal by silencing Sect Leader Yao like some junior disciple (no matter how much that vision has haunted my every waking moment). Really, I can’t believe the audacity of that man! To actually try to set you up with his daughter! I wish I had been there to see it - something tells me that one look at your expression would have had be laughing until I died for real this time.  </em>\n</p>\n<p><em> In other news of me decidedly </em> <em> not </em> <em> dying (because I know you’re already pitching a fit about that line), I stumbled upon the strangest little village yesterday, Lan Zhan, which was under the guard of one of the minor clans in alliance with the Jins. Really, you wouldn’t believe the kind of nonsense these sects come up with! Their talismans, a few of which I’ve scribbled at the back of this letter, look like something that A-Yuan would have drawn back when he was three and still chewing on Chenqing like it was the most delicious stick of tanghulu. I removed them, of course, but really, Lan Zhan, you should have seen their faces when they found out exactly who had come to examine their shoddy talismans…... </em></p>\n<p> </p>\n<p>5.</p>\n<p>The cultivation world awoke from their slumbers and found that - over the course of a single week - truths which they had believed for the past sixteen years were all made untrue. </p>\n<p>The previous chief cultivator was an incestuous, father-killing, power hungry bastard, who organized the deaths of all possible heirs to assume power in the Jin sect. He used, lied to, and  murdered one of his sworn brothers, only to be killed by the other. </p>\n<p>The previous boogeyman was an innocent, but still terrifying cultivator, who returned from the dead to seek justice for himself, unveiling a conspiracy decades in the making with little to no support. What little support he did get was from his sworn enemy who....really turned out to be quite the opposite of an enemy at the end of it all.</p>\n<p>It was all good gossip at the end, but there were some changes on the ground. Oh, the Jin sect lost some power and some face, unlikely to recover to their prior glory from the back-to-back scandalous rules of both Jin Guangshan and Jin Guangyao. Still, what it lacked in political strength, it possessed in wealth — not to mention, the leader of the YunmengJiang seemed to be a fierce tiger in his guard of its heir, even from Jin elders themselves. </p>\n<p>A few opportunist clans tried to take advantage of the sudden wound inflicted upon one of the major sects — heirs from small-time sects in the area attempted to find and antagonize the well-known temper of the Jin sect heir in an attempt to make him lose yet more face, only to find him surrounded by yet other disciple cultivators. </p>\n<p>It was a strange thing, being at the forefront of such conflict. If you didn’t end up getting swept away from it, you would find yourself bound tightly together with those who weathered it by your side. Jin Ling had no idea when the disciples who were held captive at the Second Siege of the Burial Mounds decided that they were all now allies and companions but....he could hardly mind it. </p>\n<p>(Going back to Koi tower was hell. It wasn’t just seeing the faces of the sycophantic elders, trying desperately to gain his favor where before they sneered in his face, content in the knowledge that Jin Guangyao’s rule would continue for many years to come. It wasn’t just meeting Jin Chan and his other lackeys, being mocked by them for his naivety in being so close to a murderer, although that played a part.</p>\n<p>It was still seeing shadows of everything: the hall where Jin Guangyao gifted him Fairy, the same dog he tried to later kill. The fields where Jin Guangyao watched with a proud smile as he went through sword forms with his tutors, make happiness bloom in Jin Ling’s chest at the praise that his other uncle would never give him. </p>\n<p>The bottom of the stairs, his father’s sword gleaming with the blood of the man who had guided and protected and saved him time and time again. A hand on his shoulder, Jin Guangyao’s voice whispering, “It’s alright, A-Ling. You did well.”</p>\n<p>If it meant escaping those voices, those whispers, those memories....Jin Ling would befriend anyone, join any hunt, make any ally.</p>\n<p>....but he didn’t mind the fact that these were the friends he now had.)</p>\n<p>The other major change: the appointment of Lan Wangji as chief cultivator. Honestly, in the aftermath of everything, it was an inevitable thing — with Lan Xichen out of commission and facing his own scrutiny for being so naive to what happened under his own eyes, with Nie Huaisang still being the useless headshaker, with the YunmengJiang Leader still a spitfire, more prone to burn than guide, Lan Wangji was the only good option left. No matter how the Jin sect fell, no minor sect had any hope to be able to occupy such a position of power - not when it was just seen what men with far more status would do to keep it. </p>\n<p>Hanguang-jun’s status as a cultivator was untouched, unmatched. What blights were casted on him (for example, his support of the Yiling Patriarch) seemed to slip away like oil on water. There was no one who the common civilian, or even the common cultivator, was more likely to uphold as an icon, a paragon for what cultivators should be. Their new chief cultivator was perfect. Their new chief cultivator was going to lead them to new heights. Their new chief cultivator.....</p>\n<p>......was going to drive them insane!</p>\n<p>Hanguang-jun was a terrifyingly efficient leader, with skills in managing troublesome, rambunctious, annoying cultivators teaching him how to give minimal orders and still be obeyed. There was no casual chit-chatting to curry favor and maintain good relations, as with Jin Guangyao. He took in the views of those most affected by whatever chaos they were trying to address, paying little mind to those sects and leaders who attempted to climb the social ladder by developing friendships with him. </p>\n<p>It seemed that the only way to gain Hanguang-jun’s favor and approval was to simply keep to your tasks and do them well.</p>\n<p>Still.....shouldn’t there be some conversation about things like this......</p>\n<p>Hanguang-jun sat at the front of the room, reading reports about recent on-goings in Jin territory, where efforts were still being made to find and destroy the last of the experiments which Jin Guangyao and Xue Yang has conducted. While he read them and spoke with his advisor (a blank-faced Lan Qiren), other cultivators had been given time to talk, to mingle. </p>\n<p>And yet....not a single one could bring themselves to speak higher than a whisper.</p>\n<p>They had all seen the red-ribbon tied around Hanguang-jun’s wrist. They all knew who it belonged to. Everyone knew of the absence of Hanguang-jun’s own white ribbon. They also knew who it had gone to.</p>\n<p>(The last known reports of a Wei Wuxian who was trying his best to disappear said that he was wearing that ribbon around his neck like a collar. Everyone who heard it, tried their best to forget —  except a group of younger disciples who seemed far too interested in exactly that kind of news.)</p>\n<p>That was all fine. Sure, they had been thrown off by everything, sure they were more than a little disconcerted at the implications of it all....but as long as those implications weren’t staring them in the face, they were alright.</p>\n<p>Except.....just when they had all gotten used to the image of Lan Wangji without his forehead-ribbon, with the sudden splash of color of pristine white robes....he had to go and do something like this, didn’t he?!!</p>\n<p>Hanguang-jun had entered the meeting today with the Yiling Patriarch’s red ribbon tied around his forehead like a warning. He had conducted the meeting without paying any attention to the way his advisor looked like he had lost his soul, or to how adult cultivators would avoid his gaze when speaking with him for fear of being too entranced by the strip of red stretched tightly across his forehead.</p>\n<p>Lan Wangji wore the ribbon like a promise. Like a claim, although who was claiming whom was up for debate. He wore the ribbon like it was what he had been doing for years, casual, common-place, like it was given that he would wear it in such a way.</p>\n<p>“Red,” Ouyang Zizhen whispered to Lan Jingyi, “is the color of marriage, is it not?”</p>\n<p>As usual, he was too loud. The Ouyang Sect Leader looked up to the heavens for patience, wondering not for the first time where he had gone wrong with the boy. The few disciples who had come together with them began chattering excitedly, voices getting louder and louder, even as the adults quieted. </p>\n<p>Not many of them dared to look at Hanguang-jun while this conversation occurred, but those who did were struck by the slight, pleased curl of his lips, the way his eyes had softened even while he still read the paper in front of his eyes.</p>\n<p>A minor sect leader from near Qishan swore that the chief cultivator’s ears had turned red. </p>\n<p>The silence was broken by a loud <em> thud. </em> Sect Leader Jiang had placed his cup of tea down with extraordinary force, paying no attention to the way those sitting next to him yelped as it cracked from the middle. Hot tea scalded his fingertips, gushing down his palm and soaking into his sleeve, but Jiang Cheng’s mind was somewhere else entirely. </p>\n<p>\n<em> (A quiet hall. Two cultivators kneeling before tablets in respect. Solemnly, quietly, as one, they bowed, once, twice—) </em>\n</p>\n<p>Every eye in the hall was training upon Jiang Cheng as his shoulders began to shake. They had long since known that Jiang Wanyin temperamental at best, at his worst, he was unstable. Would they finally be seeing a long overdue breakdown? In public, at that? How embarrassing.</p>\n<p>“Uncle,” Jin Ling called out, alarm over his face. He reached out to grasp one wet sleeve, “Uncle, what—”</p>\n<p>His voice faltered as Jiang Cheng rose his head, alarm giving way to shock. </p>\n<p>Instead of the expected anger, instead even of the tears that some of the more bloodthirsty of the congregation had been wishing for — Jiang Cheng’s face was tightly drawn into lines of what was - undoubtedly, unmistakably - amusement. His lips trembled from a gargantuan effort to not break out into a mad smile. </p>\n<p>Smoothly, he rose. He bowed to the gathered, muttering a trembling, “Excuse me,” before walking out of the hall quickly.</p>\n<p>In the silence left behind in his wake, a YunmengJiang disciple murmured, horrified, “Sect Leader Jiang has finally <em> lost his mind.” </em></p>\n<p>The gathering broke out into merry discussions about what had just happened, trying to puzzle out the reason behind the Jiang Sect Leader’s strange behavior. It was just as well that the noise grew louder - it masked the small, uncontrollable laughter spilling out of Jiang Cheng’s mouth only a few corridors away.</p>\n<p>To think — that after everything! — he had still watched both his siblings get married. </p>\n<p>How insane. How very like Wei Wuxian, to pop up after sixteen years of death, destroy the most important man in the cultivation world, marry the then second most important man in the cultivation world, and pop right back out — all within the timespan of a few weeks.</p>\n<p>“You idiot,” Jiang Cheng gasped out, “did no one ever teach you to <em> slow the fuck down?! </em>” Even as he spoke, he knew the answer to the question; Wei Wuxian had always been like the kites he so loved to fly, fluttering hither and thither as the breeze took him back and forth. He thought of the string of that kite in the hands of the Second Jade of Lan, watching it float with the same blank expression he always had present on his face, and felt his laughter grow even stronger, heard it tinge with hysteria.</p>\n<p>Once he calmed down, he would go back into that hall and apologize, glaring away everyone who tried to question him. He’d turn his glare on Lan Wangji last, and keep it there for the rest of the meeting - no, for all the meetings they would have in the future! It would spark more whispers about him, he knew, but Jiang Cheng found it hard to care about that at the moment. </p>\n<p>\n<em> Lan Wangji, to stealth-marry my brother right in front of me — without even asking my permission — and in such a shoddy manner — aren’t you being a bit too brazen?! </em>\n</p>\n<p> </p>\n<p>5.5.</p>\n<p>\n<em> Wei Ying, </em>\n</p>\n<p>\n<em> It heartens me to hear that you are well. The power of Chief Cultivator settles strangely upon my head, but I am glad to find that what little discomfort it causes is being alleviated by time. Brother - despite still being in seclusion - still helps me with what little he can, and every day I am glad for the support which you all provide. You were right, Wei Ying, as you often are - bringing such work to my brother has indeed helped him. I feared that before, he was wasting away, his mind focused on nothing but the tragedy that passed, but now, at least, his mind is more connected to the world.  </em>\n</p>\n<p>\n<em> I chose to omit the second half of your suggestion. Sizhui was an alarmingly small child, thereby easy to bury in rabbits. I fear that my brother is many times larger - even weakened as he is right now, he could easily shake of all the rabbits in the Cloud Recesses if I decided to set them on his body…. </em>\n</p>\n<p> </p>\n<p>6.</p>\n<p>Winter found Wei Wuxian unfairly cold. It didn’t help that he had been traveling in the north, eager to explore the wild forests and reports of beasts that he had only read of as a child — neither did the fragility of his newly-recovered body favor his condition in any way. Even before, as a child and a teenager, he had never been able to stand the cold, far too used to Yunmeng’s humid summers, spent diving into the lakes. </p>\n<p>Winter was....stifling.</p>\n<p>Honestly, this entire situation—it was so annoying! He had stood in Gusu winters after returning and still been Alright! So why was everything starting to hit him now?</p>\n<p><em> No </em> , his traitorous brain reminded him, <em> you were like this before too. You stood in the snow until you were blue lipped and shivering and Lan Zhan carried you inside in his arms, wrapped you up in blankets until you were burning from the affection in his eyes </em>. </p>\n<p><em> Shut up </em>, he told his brain weakly. One hand fiddled absently with the ribbon which covered his neck from the cold as he tapped his foot and waited for someone to come down and properly receive him.</p>\n<p>Originally, he had been all set to brave the winter by himself — perhaps win a coat or two from participating in night hunts to keep himself warm. But reports from further north spoke of heavy snow, bringing with it a chill which would last for at least the next week. Wei Wuxian hesitated at the news, unwilling to give up his journey before biting his lip and thinking, <em> what would Lan Zhan do? </em></p>\n<p>The answer to that question found him here. </p>\n<p>“Ah, Wei-xiong<em> , </em>” Nie Huaisang was far better dressed for the cold, his usual fan absent due to the already heavy winds around them, “come in, come in.”</p>\n<p>Wei Wuxian smiled through the cold, accepting the invitation and stepping into the entrance of the Nie sect’s fortress. Ignoring the wide-eyed gazes of the guards, the two began to trudge forward deeper into the residence, keeping up a light-hearted chatter the whole way. Observing him from the corner of his eye, Wei Wuxian thought that Nie Huaisang looked more peaceful, the shadows lining his eyes turned gentler. As they made their way through a twisting maze of corridors, Wei Wuxian thought: <em> ah, I’m glad. </em></p>\n<p> Wei Wuxian let out a sigh of contentment as they arrived at a room with a fire, discarding his thin overcoat to crouch down near it and warm his hands. Nie Huaisang watched him navigate his household without any permission. He shook his head in find exasperation, “Wei-<em> xiong, </em>you never do change, huh.”</p>\n<p>Wei Wuxian ignored the light-hearted chiding in favor of pouting up at his old friend. “Nie-xiong,” he whined, “I can’t believe you took so long to let me in! I was nearly freezing, you know?”</p>\n<p>Nie Huaisang laughed, “Apologies, Wei-xiong,” he replied, taking a seat next to the other man, “our disciples weren’t exactly expecting...you.”</p>\n<p>Even as he spoke a servant entered the room, carrying a tray of tea and familiar red pots of wine, very much expecting a thirsty, cold Yiling Patriarch. At Wei Wuxian’s raised eyebrow, Nie Huaisang grinned, “His Excellency was quite worried about your traveling in such conditions, did you know? He even asked that all sects who encountered you give you proper hospitality.”</p>\n<p>Wei Wuxian colored. He had written to Lan Wangji about going further up north about a week ago, but who would have thought that the other man would actually reach out in such a manner! “Lan Zhan’s a mother hen,” he replied weakly, face still red. With one hand, he grasped the cup of tea poured for him and drank it in four quick gulps, feeling the warm liquid erase some of the chill that had seeped into his bones. </p>\n<p>Mercifully, Nie Huaisang let the topic go with a chuckle. “Will you be staying until the storm passes?” He inquired, settling himself with the other cup of tea.</p>\n<p>“Mnn, that’s the plan,” Wei Wuxian replied. “You better be prepared to house me for that long, Nie-xiong! I tend to go crazy from sitting still for so long, but still, Lan Zhan won’t like it if you just threw me out!” Being who he was, naturally he had already overcome the flush of happiness which pierced through his body at the news that Lan Wangji was still looking out for him, and wielded such knowledge as a weapon unashamedly.</p>\n<p>“Oh, I’m sure that we’ll find something to do in the meantime,” Nie Huaisang said, “you might have jumped right into the middle of things as soon as you came back, but there’s still sixteen year worth of things for you to catch up on.” They both shared a quick, mischievous grin over their cups of tea. </p>\n<p>Wei Wuxian had always liked Nie Huaisang, and vice-versa. This was in large part because they recognized each other for what they really were: complete bastards. Jiang Cheng would always accuse them of gossiping like the old fish-sellers who dotted the pier in Yunmeng and whispered about their sect heir’s terrible luck with girls within his vicinity, but honestly, neither of them minded the accusation. </p>\n<p>Nie Huaisang recognized gossip as what it was: a valuable source of information. Wei Wuxian also recognized gossip for what it was: a valuable source of amusement. In such a manner, they were able to spend time with each other in harmony.</p>\n<p>“Ah!” Nie Huaisang thumped his fist against an open palm, looking as though he had just remembered some great revelation. Wei Wuxian froze where he had the cup poised at his lips; from experience, he knew that such an expression would lead to no good. “Wei-xiong,” he leaned forward, “we still have some time before the storm sets in, yes?”</p>\n<p>“Yes,” Wei Wuxian replied, with great wariness, “the watchtowers said that it was predicted to arrive in a couple of days.”</p>\n<p>“Then we should go out!” Oh this wasn’t good. This was the same tone with once had Wei Wuxian stick a paper saying KICK ME on Lan Qiren’s back. “The city has some wonderful attractions right now that you’ll never be able to see again, Wei-xiong.”</p>\n<p>Well. It would be rude to refuse his host, but Wei Wuxian has never cared much about rudeness. He didn’t really want to go back into that freezing cold that he had just been rescued from but at the same time.....he really did miss talking to this friend of his. </p>\n<p>“Nie-xiong,” he replied, sighing in defeat, “you better give me all your thick cloth. There’s no way I’m going out dressed like this.”</p>\n<p>Nie Huaisang snapped his fan open in response, but Wei Wuxian had known him long enough to know, even without looking at his lips, that his face was drawn into a smile. </p>\n<p> </p>\n<p>7.</p>\n<p>They set out for the city without any guards. It was unusual for a Sect Leader to go around with a retinue, but it only took one dismissive gesture from Nie Huaisang and a few assurances of their leader’s safety from Wei Wuxian before the well-meaning sect members who offered to be their guard let them go on alone. </p>\n<p>Wei Wuxian’s eyebrows furrowed as he looked at the strange, reverent look on the Nie sect members’ faces as they watched Nie Huaisang go. Deliberately vague, he asked, “They know?”</p>\n<p>As expected, Nie Huaisang only had to follow Wei Wuxian’s gaze to know what was being asked of him. He sighed in exasperation, “They suspect, I think. I could hardly pull everything off alone now, could I? There were some assistants within the sect, but now that things have wrapped up they probably spilled some of the beans.”</p>\n<p>Wei Wuxian raised his eyebrows, “Is that safe?” Right now, QingheNie was left out of the cutthroat politics developing on the lower rungs of the cultivation world partly because of respect to Nie Mingjue’s memory. If it got out that Nie Huaisang was capable of such strategies and manipulations.... the newly sympathetic attitude would take an immediate nosedive.</p>\n<p>Nie Huaisang huffed a laugh. “I wouldn’t be worried about that,” he said. “There are more interesting things for people to look at than me.”</p>\n<p>Well. That was ominous. </p>\n<p>In true fashion, Wei Wuxian attempted to deflect the ominous undertone by resorting to humor. “Sect Leader Nie!” He gasped like some affronted maiden, “You should believe in yourself more! Why, any person would be honored to gaze upon your fair visage!”</p>\n<p>This time, Nie Huaisang laughed, a true, loud, bright laugh, the kind that Wei Wuxian had not heard since he had left Gusu all those years ago. His friend turned to him, eyes shining, and said, “Wei-xiong, come on. There’s something you should see.”</p>\n<p> </p>\n<p>Nie Huaisang dragged Wei Wuxian through the city with a firm grip on his sleeve, stop now and again when distracted by some pretty trinkets being sold on the streetside. They ‘ooh’-ed and ‘ah’-ed over paper fans and stretches of cloth, stopping once in a while to grab a bite to eat from the few food sellers who were still working in the cold. It was the most fun Wei Wuxian had had in a while, honestly. While he wasn’t a fussy person himself, he couldn’t deny that he had missed such simple pleasures, which he could hardly access considering most of his meager earnings went to shelter and the like.</p>\n<p>Finally, they reached the place where Nie Huaisang meant for them to go. It was the corner of a street near the main market, with people swarming all around it. Instead of joining in the crowd, Nie Huaisang chose to pay a nearby tea house for entry, settling in on the balcony where they could both see what the people were swarming near. </p>\n<p>“What’s this?” Wei Wuxian asked. Cloth acting as makeshift curtains surrounded what was a small stage, with no one on it yet. </p>\n<p>Nie Huaisang smiled that odd, ominous smile once again, fluttering his fan. “Ah, of course. Having been traveling all this while, Wei-xiong must not have heard of this.” With a flourish, he used the tip of his fan to point to still-empty stage, speaking slightly louder to be heard over the enthusiastic crowd gathered near it. “They’re a group acting out a play that’s been recently written! They’ve begun their shows in Qinghe, but I hear that it’s become so popular that they’ll be traveling to showing it across the lands due to their patrons.”</p>\n<p>“Ah?” Wei Wuxian was still concerned about Nie Huaisang’s motives,  but he knew that his friend would not harm him. He couldn’t deny that he was excited; while the world might have forgotten that he was once a young master with exceptional skills in both the martial talents and the arts, he hadn’t himself. It had made Jiang Cheng tear his hair out, but Wei Wuxian didn’t just learn music and art to push up his reputation: he found genuine joy in those activities.</p>\n<p>Just as he was going to lean forward to bother Nie Huaisang into telling him more about the play, a cheer arose from the street. Nie Huaisang flicked open his fan once more, turning to face the stage. Wei Wuxian followed suit.</p>\n<p>On-stage, a man dressed in black lay still on the floor, red smears all over the cloth underneath him. With a groan, he stirred, as if slowly awakening. One hand came up to hold his head, only to freeze at the sight of the limb. His eyes opened in shock and he pushed himself up, looking around as if examining the floor. “Where....where am I?” </p>\n<p>A terrible understanding was starting to build in Wei Wuxian’s head. He turned to look at Nie Huaisang, only to find the other already looking at him, lips curled in a smile. Before he could ask his suspicions, a voice from the nearby crowd distracted him. </p>\n<p>A young girl holding on to her brother asked him, “Brother, brother, when will he come?”</p>\n<p>The brother shushed her. “Don’t you remember from yesterday? Hanguang-jun doesn’t come until the end of the first act!”</p>\n<p><em> There are more interesting things for people to look at than me </em> , Nie Huaisang said. <em> They’ll be traveling to show the play all across the lands due to their patron </em>, Nie Huaisang said.</p>\n<p>(This was also true: both Nie Huaisang and Wei Wuxian recognized each other as souls very invested in art. Indeed, often when perusing erotic books, they would become side-tracked, much more interested in how the artist was drawing the characters than in the content itself.)</p>\n<p>He turned back to Nie Huaisang with a gasp, “Nie-xiong, how could you?!” His lightning quick mind made all the connections: Nie Huaisang was the one who patronized, and most likely the  one who created the play. It was a smart tactic — undoubtedly, it would keep the attention of the public on Lan Wangji and Wei Wuxian, away from other actors of the conspiracy. But still....</p>\n<p>Nie Huaisang, If you’re using my life as artistic material, shouldn’t I be getting a bit of the profits?!!</p>\n<p>For some reason, Wei Wuxian’s cheek burned. How strange was it to see himself being depicted like this! How strange to think that people were lined up in such a way to see his and Lan Wangji’s adventures!</p>\n<p>Nie Huaisang laughed aloud. “Ah, Wei-xiong, Wei-xiong,” he sighed, fanning himself lazily, “You should be flattered! It seems the crowds really are fascinated by the love story of the Yiling Laozu and Hanguang-jun! It’s especially a hit with the younger kids, you know?”</p>\n<p>“Nie-xiong!” Wei Wuxian protested, cheeks burning until he felt like he would combust on the spot. </p>\n<p>Nie Huaisang simply laughed again, calling over a servant to bring them both some wine in order to warm up. Not, he thought, that his friend needed anything else to stay warm, considering the rush of blood still settled in his cheeks.</p>\n<p>(“ I did NOT faint into Lan Zhan’s arms like that, and he most certainly didn’t carry me in them in such a manner!”</p>\n<p>“Yes, yes, he carried you on his back, I know. But I bet you wish that he’d done this type of carry, huh?</p>\n<p>“.....fuck. I really do. Holy shit, holy shit, holy shit, I really, really, really want Lan Zhan to carry me like that, wow.”</p>\n<p>“Uhm, Wei-xiong-”</p>\n<p>“Oh, I bet I could feel his arm muscles tense so well in that angle, oh man.”</p>\n<p>“.....I really can’t stand you.”)</p>\n<p>The play concluded with the two main actors parting ways, having dressed each other in their colors. It was a cold, cold day, the kind of day which Wei Wuxian hated, but the cheers of the audience warmed him from tip to toe.</p>\n<p> </p>\n<p>8.</p>\n<p>The time Wei Wuxian spent with the Nie sect during that one awful week in winter was surprisingly fun. He spent time reading poetry and learning how to paint fans with his friend, laughing as Nie Huaisang groaned when Sect Leader responsibilities came to drag him away from the activities. He spent even more time among the disciples, re-building his sword skills even as he trained them in some basic stances and moves. </p>\n<p>The upper classes were far more interested in his drawing of talismans, and he was gratified to be allowed entry into the Nie sect library for all the services he was providing the sect. </p>\n<p>“It would feel wrong to just be a freeloader,” he would insist, but Nie Huaisang would take one look at the children sitting in front of him, enamored by his words, actions and way of being, and roll his eyes. Wei Wuxian, for his part, was happy to answer any questions they had, to tell any stories about his past that they requested — a surprising number of them just listened to ask ‘what about Hanguang-jun’, and Wei Wuxian knew with a sudden striking clarity that the Nie sect disciples were among the youth who comprised the “younger kids” which so loved that awful play.</p>\n<p>(Still.....it was easy to talk about Lan Zhan. It felt like most of the significant moments in his life were spent with Lan Zhan, like every great adventure was one where Lan Zhan had been by his side. Wei Wuxian was a bit weirded out by the light that began to shine to the eyes of the disciples when his stories inevitably turned to the other man, the way they would track where he was wearing the ribbon given to him every time he entered the field anew, but deep in his heart, he couldn’t bring himself to mind that much.)</p>\n<p>The last day of the storm arrived quickly, and Wei Wuxian found himself eager to once again be on the road. The night before his departure found him drinking with his friend, their faces just beginning to catch a healthy flush due to the warmth of the liquor. In the quiet of the room, Wei Wuxian finally asked the question that had been bothering him since that stormy day at the Guanyin temple. </p>\n<p>“What did you do with her?”</p>\n<p>There was no need for him to specify who he was referring to. Over the past week, they had been casually referred to and danced around the events which unfolded, both knowing the other’s involvement in what happened. </p>\n<p>Nie Huaisang finished his sip before setting the cup down. He asked, “What do you think I did with her, Wei-xiong?”</p>\n<p>Wei Wuxian felt a sudden tiredness wash over him like a wave reaching its crest. “I don’t know,” he replied, and felt the irony of telling the headshaker such a sentence set in fully. It was true, though, he really did not know what to expect of Nie Huaisang. He did not want to think about what he had done to Jin Guangyao’s mother’s grave — not after everything. </p>\n<p>It was a strange thing, to wake up in the world that had kept revolving without him for so long. Everything was the same - and yet, everything was so different. He didn’t know how much of his old friend remained, and how much of Nie Huaisang was now the cold, calculating man who danced all the major figures of the cultivation world on his fingers like marionettes. He didn’t think Nie Huaisang himself knew that distinction. </p>\n<p>The other man was watching him with hooded eyes, taking in his tired expression. Suddenly, his lips quirked up. “As expected,” he murmured, “Wei-xiong is still a good person after everything, to show such care over this matter.”</p>\n<p>There remain in the world a good number of people who Wei Wuxian could Nie Huaisang to who would refute that statement, himself included, but he stayed silent. In the silence of the room, the fire crackled, an ember leaping out into the air. Nie Huaisang’s eyes tracked its path lazily. “You don’t need to worry too much, Wei-xiong,” he replied absently, “I didn’t do anything untoward. It would be unreasonable for me to involve those long dead in such a grudge.”</p>\n<p>Wei Wuxian lifted an eyebrow, a teasing grin curling on his face. Catching sight of it, Nie Huaisang smiled back, “Oh come on, Wei-xiong, you only barely made the definition of dead.”</p>\n<p>Wei Wuxian laughed aloud. For some moments, the room was plunged into a comfortable silence. Then, Nie Huaisang opened his mouth and hesitantly asked, “Does he write to you of his brother?”</p>\n<p>Wei Wuxian exhaled a long, slow breath. “Still in seclusion. Lan Zhan says that he visits him often, but I can tell that he’s worried.” He examined Nie Huaisang’s face for a minute and then asked, voice soft, “Do you regret it?”</p>\n<p>It was something that Wei Wuxian had often wondered about since things had cleared out. His generation, born as they were in times of war, had become too desensitized to death and suffering. There was no time for regret on the battlefield, no time for crises which would shake your world view and leave you bereft. But Nie Huaisang, Who had always been someone who was shielded from that particular reality by his brother, who had spent time back in sheltered fortresses while the rest of them marched out, had he also developed such thinking? This sheltered young master who would have been happy spending his whole life on trivial pleasures with his friends — how did he understand the person he had come to be?</p>\n<p>In lieu of a response, Nie Huaisang picking up his cup once again, twirling it and watching the light of the fire catch on its edges. “Sometimes,” he began, “sometimes I think that I hate my brother. He was going to die, he <em> knew </em> he was going to die, and yet he chose to keep me ignorant of it, chose instead to lean on his <em> sworn brothers </em>for help.” He spat the words out as thought they were poison. “But then....how could I blame him for that?” His lips quirked in a sardonic smile, “After all, I was the one who wanted to live a carefree life devoid of all the drama the sect could bring me.”</p>\n<p>For all his aggressive bluster, Nie Mingjue was used to sheltering his younger brother, was used to keeping him safe and sound. When such circumstances emerged, what could he do but follow his habits? How could he approach delicate, cowardly Huaisang with such news? Why would he choose to, when his talented, renowned sworn brothers could possibly stop his path from advancing towards death altogether?</p>\n<p>(The strings of their mistakes crossed paths, spun, bound them in a web. Slowly, one by one, spider to an immobile, unaware prey, tragedy descended upon them and began to suck their bodies dry, while the entangled spectators could do nothing but watch, unaware of what arrow had been shot until their loved ones had already bled out.)</p>\n<p>Nie Huaisang continued, voice low, as if he were speaking to himself. “My Brother was not a good person. I’ve always known this. He....was far too rigid in his understanding of justice. Far too impulsive in how such justice should be carried out, unconcerned with what that sentence might result in. He was harsh, brash, with rarely a kind word to give to anyone. Towards the end,” Nie Huaisang admitted, “Xichen-ge probably held more of his affection than I did.” His voice turned bitter. “Towards the end....no, maybe even before that, he refused to look down and actually see who I was. If he were any other person, then I would think that what Jin Guangyao did to him was not entirely unfair, considering the treatment he received at my brother’s hands.”</p>\n<p>“But regardless, he was my brother. He was my father, my mother, my friend — as insane and lonely as that might sound. He brought me my first fan, taught me my first words, hired artists to teach me how to paint when I expressed the desire.” Nie Huaisang’s expression was the gentlest it had ever been, the softest Wei Wuxian had ever seen it, but only a fool would be blind to the undercurrent of agony underlying his every word, every breath. Nie Huaisang looked up, met Wei Wuxian’s eyes. In the light of the fire, he could see a layer of wetness glimmer. “He was my brother, Wei-xiong.”</p>\n<p>Nie Huaisang have a wet chuckle, “He’d probably kill me himself, if he saw what I did to his precious Lan Xichen. More likely than not, I’d be out on the streets for the underhanded tactics I used, for the way I manipulated everyone around me, just like the man who killed him.”</p>\n<p>“That’s not true,” Wei Wuxian interjects. He had been patiently listening all this time, but at this point he felt like he had to intervene. “Huaisang....if it were anyone else but you, then yes, he would have had that reaction. But you’re different. You’re his little brother.” People would tend to forget it, but Wei Wuxian was a big brother too. He and his little brother had destroyed each other a hundred times over, had left each other choking on promises kept and promises broken. And yet....</p>\n<p>“Huaisang, your big brother loved you.” </p>\n<p>Throughout Empathy, despite the tumult of emotions which Nie Mingjue experienced, that much was clear. </p>\n<p>Nie Huaisang choked, as if on a sob. The wetness in his eyes looked again, some drops of tears finally escaping, slowly making their way down his cheeks. “Ah, Wei-xiong,” he sighed, “if you say so, then it must be true.”</p>\n<p>He poured himself more wine from the jug. “Well then,” his composure regained after a few deep sips, he turned to Wei Wuxian again, “to answer your question of whether I regret it.” A smile lit up his face, dying before it could reach his eyes. “What do you think, Wei-xiong? Do I?”</p>\n<p>Looking into those eyes, Wei Wuxian thought of Wen Chao, of dogging his footsteps, encouraging him to tear himself apart. He thought of the anger that arose in when he saw Wen Ning on that rainy night in Qiongqi path, compounded by the sobs of one of the strongest women he had ever known. He thought of waking up alone after being paralyzed in that godforsaken cave on a dead mountain, hiding A-Yuan away, making him sleep with gentle hands even as his mind screamed for blood, blood, blood. </p>\n<p>He thought of shijie, pale-faced and trembling. Thought of her touching his cheek, of the way her blood felt on his hands.</p>\n<p>Did he regret the path he had taken? If given the chance, would he have done things differently?</p>\n<p>He wanted to say yes, he really did. But he couldn’t help but remember the unnatural calm that had settled over him in the aftermath of the storm at the Guanyin temple. The blood that he had shed was still on his hands — would never be washed off — but to know that the lives of the innocents under his charge were not lost through any fault of his own, that their deaths were instead the result of the machinations of other, more power hungry beings — it was a bittersweet relief. It reminded him of first settling into the Burial Mounds with the Wen remanent. Back then, even as the world cursed him, even as the ache of the separation from his brother, his sister and his friends set in, he had thought: No matter what happens, at least I remained true to myself.</p>\n<p>Did he regret it all? Would he take it all back?</p>\n<p>\n<em> I, Wei Wuxian, wish I can always stand with justice, protect the weak and live with no regrets. </em>\n</p>\n<p>Wei Wuxian turned back to Nie Huaisang and raised his cup. “Ask me again next year.”</p>\n<p>Nie Huaisang raised his cup as well, in toast. “I’ll look forward to it, Wei-xiong.” As one, they drank.</p>\n<p><em> To love, </em> Wei Wuxian thought, <em> and to the monster that it makes out of the best of us. </em></p>\n<p>And so, deep into the night, the two monsters remained.</p>\n<p> </p>\n<p>8.5.</p>\n<p>\n<em> Most Illustrious Hanguang-jun, </em>\n</p>\n<p>\n<em> You will be glad to hear that I did indeed arrive at the Nie sect safely - and have spent the week dressed in the warmest coats which I could steal from them. But, Lan Zhan, I think that’s it for my adventures in the north - this storm has lessened my excitement to explore these lands. Next time around, you should come here with me! I’d like to see any storm try to beset someone who was under the immediate protection of His Excellency! And also, I imagine that we’d be much warmer if we were travelling together, don’t you? </em>\n</p>\n<p>\n<em> Hahahaha, dearest Er-gege, I can imagine how red your ears turned at such a comment! I know, I know, I’m indeed the most shameless - but my shameless proclivities have only been exacerbated by my proximity to Nie Huaisang, who, even after all these years, still proves to be the most deviant of us all. Honestly, Lan Zhan, if your uncle saw some of the stuff I spotted in the Nie sect library, I’m sure he’d explode! It’s for the better, then, that the person who was allowed access to such materials was me and not him. </em>\n</p>\n<p>\n<em> And oh, Lan Zhan, the things which I have found…... </em>\n</p>\n<p> </p>\n<p>9.</p>\n<p>Nie Huaisang saw his friend out of the city with a retinue of excited teenagers and a bag full of coins. “It’s only what is already due,” he insisted. He had no reason to insist: Wei Wuxian was entirely shameless enough to take money that such a person outright offered to him. That he knew the reason behind this generosity (payment, really, after making Wei Wuxian do all his grunt work and steal <em> his love story </em>to create a successful play) only made him that much more eager to grab it. </p>\n<p>Nie Huaisang saw the self-satisfied look on his face, snorted, and set the fidgeting disciples he had been teaching for the past week on him.</p>\n<p>It took more willpower than Wei Wuxian wanted to admit to bid them adieu. The younger ones especially whined and whined, each telling him how terrible the usual sword master was as though they hadn’t been regaling him with tales of his strictness for the entirety of the last week. Nevermind that there was little that Wei Wuxian could teach them regarding advanced swordplay in the first place; the Nie sects saber technique deviating entirely from his YunmengJiang training besides the few basic stances. </p>\n<p>However, finally, with ample promises of returning next year, he was able to seek his leave. Even then, the children had only let him go with Nie Huaisang’s promise that Wei Wuxian would be coming back to visit them — if only to uphold the promise he had made to Huaisang to aid in making the wild techniques of the Nie sect safer for those who used them. Neither of them wanted to see the young disciples face the consequences that Nie Mingjue had been resigned to.</p>\n<p>“Give my regards to Hanguang-jun, Wei-xiong,” said Nie Huaisang the absolute <em> bastard, </em>well aware of how every ear in their vicinity would perk up to hear the answer to such a request from Wei Wuxian. However, by now, Wei Wuxian had learnt how to deal with people who spoke in such silver tongues. </p>\n<p>Instead of replying, he made one rude gesture with his hands and quickly set off, grinning at the scandalized gasps and the muffled laughter he left in his wake. </p>\n<p>The time he spent at the Nie sect had been much needed. It allowed him to recuperate from the weeks of travel he had been doing before, allowed him to hide from the storm, which seemed to have taken away with it the worst of winter. Reconnecting with Nie Huaisang again was a blessing; in part because, despite his name cleared up, Wei Wuxian was aware that he was still in dire need to true allies, in case the cultivation world once again deemed him to dangerous once he was not working to their benefit. Also because, quite frankly speaking, Wei Wuxian had missed him, the sneaky little bastard. </p>\n<p>Still, he was glad to take leave of Qinghe. The him of the past would never have thought that he would one day find such pleasure in silence and solitude, but as he was, Wei Wuxian had to admit that traveling by himself, being able to determine where his road went - it was already doing him a world of good. Already, his body felt stronger as his mind buzzed with ideas to regrow his spiritual energy. Many people, among them Jiang Yanli and Wen Qing, could attest that in such a mindset, Wei Wuxian was best left to his own devices.</p>\n<p>\n<em> So — </em>\n</p>\n<p>Wei Wuxian swore once again as he swung down and outright tackled a teenager out of the way of yet another beast.</p>\n<p>— <em> how the fuck did he get tangled up in this mess again?! </em></p>\n<p>He had such grand plans after leaving — traveling by himself, going to lands unseen, bringing Lan Zhan back drawings of views which he had never examined before, perhaps even extracting a promise to go to those places again together.</p>\n<p>Why, then, had he made into some glorified babysitter?! Where were all these children coming from?!!</p>\n<p>Losing his patience, he snapped out loud, “All of you, step back!”</p>\n<p>Instinctively, the disciples took some steps back, a few of them retreating to the trees. From what he could see, Wei Wuxian was aware that he had just ordered around a bunch of juniors from prominent sects, the white of GusuLan and purple of YunmengJiang standing beside more muted colors of small sects. His heart leapt as he recognized Jin Ling standing in their midst, the sole Jin in the whole group.</p>\n<p>“Wei Wuxian!” Jin Ling retorted back, as if his face wasn’t pale from the fear of facing the beasts unprepared, “Don’t go around thinking you can order me around!”</p>\n<p>Wei Wuxian gritted his teeth, focused on the creatures in front of him. “Be quiet, brat! Don’t think that just because you’ve gained a couple of inches I can’t plant you into the ground like a radish!”</p>\n<p>Jin Ling fell back, struck silent by the double-faced praise (‘I grew taller?’) and threat (‘Bury me into the ground?!!!!’). Next to him, Lan Sizhui, freshly returned from his travels to Qishan with his uncle, buried a laugh behind a shaking hand. </p>\n<p><em> What on earth is this child doing, going out without a guard, </em> Wei Wuxian scowled. Even as detached as he was from cultivation politics in his travels, he knew that being a Jin at this time - not to mention being the sole heir of the Jin sect - was just asking to be bullied. As soon as he was done dealing with this…. <em> thing, </em>he’d surely shake that brat until his brains rattled!</p>\n<p>Much like the disciples, he had followed reports of a pack of beasts attacking local merchants as they travelled on the route from GusuLan territory to YunmengJiang lands, stoppering trade in the region for the past few weeks. <em> Unlike </em>the disciples, he suspected, he had visited nearby villages in order to gain more information about past incidents rather than just relying on witness testimony of the beasts. </p>\n<p><em> Really, </em> he lamented as he trapped one of the beasts into a hasty array, <em> what on earth are today’s masters teaching the youth?! </em></p>\n<p>Behind him, the juniors <em> ooh- </em> ed and <em> aah </em>-ed at this senior, taking down the beast which had troubled them all for so long with such ease. Wei Wuxian rolled his eyes, driving away the other creatures which circled their packmate with a shrill chirp of Chenqing. Then, he gestured the disciples closer, going up to the cage of the beast, intent on making a lesson out of this mess.</p>\n<p><em> If I’m going to be stuck here, </em> he thought, <em> might as well have some fun with it.  </em></p>\n<p>The unholy grin that spread across his face made the approaching disciples shiver. Still, they took one look at the beast, madly ramming itself into the invisible lines which held it, another look white ribbon which dangled from Wei Wuxian’s hair, and steadfast, they stepped forward to receive their lessons. </p>\n<p> </p>\n<p>10.</p>\n<p>Before the pack of beasts had emerged, they learned over the course of the impromptu lecture, the villages nearby were beset by a string of living corpses. Thankfully, a nearby cultivation sect had picked up their case. Something to be less grateful about: as soon as the sect was done getting rid of the corpses, the incident at the Guanyin temple occurred and they left to secure their bases, without cleaning up the remains of the corpses behind them. </p>\n<p>(“Stupid,” Wei Wuxian grumbled, “ahhh, the standards of cultivation have truly themselves been buried in these past 16 years.” The disciples surrounding him wanted to protest (those were their sects he was talking about!) but ultimately had to concede that he was right.)</p>\n<p>In the end, the exorbitant prices which the sect demanded from the village for the service impoverished them, leading them to expand their farms and increase the number of their cattle for trade. At the same time, the shoddily buried corpses were discovered by a pack of animals on the outskirts of the forest. By eating on those corpses, the animals were transformed into beasts - going on to impede the trade paths and destroying the village’s economy even more.</p>\n<p>“That’s terrible!” Lan Jingyi cried. Even the more stoic Jin Ling looked disgusted by what he had heard. To have such shameful conduct - as a cultivational sect, to go on to harm the common people in such a way - how disgraceful!</p>\n<p>Wei Wuxian snorted in derision. “If it doesn’t directly affect them,” he told the disciples, barest hints of bitterness slipping into his voice, “you’d be surprised by how many cultivators who would just outright ignore such a situation.” Almost to himself, quieter but still audible, “I see some things haven’t changed at all.” </p>\n<p>Indeed, Wei Wuxian could feel the seeds of anger and disgust begin to bloom in his heart. All those years ago, under the spell of power after a period of powerlessness at the hands of the Wen clan, they had made the same error - choosing to cast out and kill a number of innocents, simply because they had forgotten what righteousness, <em> true righteousness, not just that nonsense that was scribbled on the walls of the GusuLan, </em>looked like. </p>\n<p>“Senior Wei?” </p>\n<p>A calm voice jolted him out of his reverie. He half-turned to see Lan Sizhui (<em> A-Yuan! His A-Yuan, all grown up! </em>) look at him with concern. The boy bit his lip in hesitation before stepping closer to him. “Is there anything we can do to help them?”</p>\n<p>All around him, the faces of the disciples gathered for the night hunt were cast into expressions of determination. Looking at them, Wei Wuxian felt his own bitter heart soften, touched by the virtue of their conduct, by the degree of their defensiveness of these people that they had never even met before.</p>\n<p>It was like looking at himself, he thought, back before the world burnt down around them. Back when he was young, bright, full of ideals and ideas, creating dreams in his mind about night-hunting with Lan Wangji by his side, aiming to stand with justice, protect the weak and live life with no regrets. </p>\n<p>He smiled. “First,” he declared, “we’ll hunt the beasts.” Unlike the sect which helped the village before, they would do their job properly. And after that, just perhaps, they could help those who were hurt heal.</p>\n<p> </p>\n<p>11.</p>\n<p>The battle with the pack of beasts took more out of them than Wei Wuxian thought it would. It would probably have been easier to entrap and take them all out himself, but...it felt wrong to not allow these children to get the experience the so needed. He found that supervising them as they traversed across the woods, fighting and tracking the pack, was far more exhaustive than he had thought.</p>\n<p>At the end it, they had hunted well into the night, far past bedtime for good little Lans. Seeing the tiredness of the disciples, he made another executive decision to not head all the way back to the village, but rather just sleep in the forest. </p>\n<p>Jin Ling grumbled, because of course he did, asking who precisely died and made him Leader, but in the end even he gave in, far too concerned about the scratch that stretched across his chin from where one of the beasts clipped him. Wei Wuxian rolled his eyes at the vanity (really, just like the peacock) and quickly had a fire running, sending the more energetic disciples to gather soft grasses from a nearby field to serve as bedding. Job delegated, he beckoned Jin Ling forward, tugging him close to examine his wound despite his protest. </p>\n<p>“Stay still!” he chided as he turned the other’s face left and right, finding great joy in how the skin reddened under the close scrutiny. “Hmm, nothing too bad. It should be all healed by the time you awaken tomorrow.”</p>\n<p>Hearing the prognosis, Jin Ling practically ripped himself away from the elder, blushing so hard that Wei Wuxian feared his heart stopping due to lack of blood. “D-don’t do that again!” he cried out loud, stammering through his words. </p>\n<p>Wei Wuxian fought the urge to coo out loud. Ah, how precious! Just like Jiang Cheng back when Wei Wuxian or Jiang Yanli would fuss over him! He wanted to dig in more, to tease and delight in the cluster, but before he could, he was called away again. </p>\n<p>“Senior Wei.” Lan Sizhui was always a serene being, but he seemed to emanate new light since his return from Qishan. Looking at him now, standing tall and proud, happy, living, <em> loved, </em> Wei Wuxian felt his heart overflow with affection. “We’ve gathered all the grasses for the bedding tonight, but there weren’t enough soft ones....”</p>\n<p>This time around, Wei Wuxian allowed the coo to escape his throat, reaching out to muss Sizhui’s neat hair and smiling at how the other let him do so, despite the reddening of his cheeks. “That’s alright, A-Yuan,” he told the other, his voice having gone lower, “I’ll stay up the night to keep watch.”</p>\n<p>Lan Sizhui’s head shot up. “But Xia—Senior Wei,” he corrected himself mid-sentence, “there’s no need! We can alternate, surely! You shouldn’t have to stay up the whole night!” Behind him, Lan Jingyi nodded in vehement agreement.</p>\n<p>Wei Wuxian snorted, messing about the younger boy’s hair again. “It’s alright,” he reassured, “I was planning on staying up anyway. While having the fire run for the whole night is necessary on a day this cold, it also presents a danger, if any predator were to see it. Trust me, I’ve done this many times before.”</p>\n<p>Lan Sizhui still looked uneasy with the idea, no doubt coming up with ways to protest. Wei Wuxian shut the argument down before it could begin, exclaiming loudly, “Aiyah, you Gusu people are useless at night anyway! Your Hanguang-jun fell asleep at exactly 9 while being trapped in the Xuanwu cave, so by staying up this late, you have already surpassed him!”</p>\n<p>As he expected, at the very mention of Lan Wangji’s name crossing his lips, the children stirred. Every eye in the clearing was now focused on him, narrowing in with terrifying focus. “Hanguang-jun did what?!” Jingyi exclaimed. “You have to be lying!”</p>\n<p>It was such obvious bait — but these kids were so cute that Wei Wuxian couldn’t help but take it. “How dare you accuse me of lying about something like this! I’ll have you know that I remember every moment of that encounter clearly....”</p>\n<p><em> Success! </em>The disciples looked at each other, grinning, and settled down to hear about yet another tale of Hanguang-jun and the Yiling’s Laozu’s Great Adventures. And from the man himself!</p>\n<p><em> Zizhen, </em> Lan Jingyi thought, <em> is going to first kill all of us out of jealousy, and then himself.  </em></p>\n<p> </p>\n<p>Later still, the moon found Wei WuXian awake. He amused himself by coaxing the fire into odds shapes with twirls of his fingers. It had been amusing to watch these spoilt young masters build the fire without the help of talismans. He had given in eventually, shown them how to carve the wood so that one could generate enough friction to create sparks, all the while lamenting their terrible education until Jin Ling had finally thrown a boot at him to shut him up. </p>\n<p>He chuckled at the memory, remembering the scandalized faces of the other disciples, and Jin Ling’s own rapidly reddening expression. Ahh, he’d get these children to be heretics yet!</p>\n<p>“Xian-gege?” The quiet whisper arrested his attention. He turned to see Lan Sizhui, his face half-illuminated by the firelight. In the dark, the flames reflected off his eyes like they were jewels. </p>\n<p>Wei Wuxian found his voice becoming softer, gentler. Even before knowing the truth, knowing of Lan Zhan’s greatest and most amazing gift to him, he couldn’t deny that he had been soft for this boy. “Still awake, A-Yuan?”</p>\n<p>The younger boy blushed, cheeks matching the glow of the flame. “I couldn’t,” he admitted, “I’m still….” He trailed off.</p>\n<p>Wei Wuxian smiled. “Still hyped up, huh? That happens, especially after a fight. You kids worked hard today,” he praised, delighting in how the younger blooming at the compliment. </p>\n<p>“I’m glad I met you again, Xian-gege,” Lan Sizhui mumbled, clearly exhausted despite the adrenaline keeping him awake. “I...I have so many questions I want to ask you…”</p>\n<p>Wei Wuxian fought to keep himself from cooing at how adorable the boy was. Ah, really, how had Lan Zhan not spoilt this child to the stars and back! ‘Maybe he had,’ he thought suddenly, with a fierce spark of delight, remembering the story about Lan Zhan burying the child in rabbits. </p>\n<p>What was A-Yuan like as a young boy? What had he looked like with his cheeks as puffed up as he concentrated on his calligraphy? Did his little tongue poke out of his lips when he concentrated the way it did when he was younger, creating masterpieces out of dirt and dead grass and proudly gifting it to his Xian-gege? Did someone hold his small hands when they guided him through the Lan sword forms? Was he still that mischievous imp who would cry for his Aunt Qing every time Xian-gege was being too mean, only to stick out his tongue when he was safely hidden behind her back? </p>\n<p>So much time missed out. So many questions he wanted to ask - both Lan Zhan and A-Yuan. 16 years was enough for A-Yuan to grow up from that clinging child who glued himself to Wei Wuxian’s leg and giggled when the elder jokingly threatened that he’d sweep the floor with his robes if he didn’t get off, but it hadn’t done anything to quash the affection that spread across every molecule of his being when he looked at the child in front of him. </p>\n<p>He reached out to stroke the other’s hair. “Later,” he crooned, “growing boys need to sleep, A-Yuan.”</p>\n<p>Lan Sizhui leaned into the touch, pouting at the admonishment. “I’m not that tired, Xian-gege,” he whined, internally marvelling at the fact that he was allowed to do so. Xian-gege laughed, and it was like the moon had begun to shine brighter, like the fire had grown warmer, and Lan Sizhui looked at the man who he had unknowingly missed for his entire life and felt that warmth seep into him. </p>\n<p>“I should have guessed,” Wei Wuxian grinned. “You were always a nightmare to get to sleep when you were a kid. Oh we’d tell you story upon story, create epics out of the mundane everyday and still you’d be asking ‘what happened next? What happened next’?”</p>\n<p>The blood that suffused Lan Sizhui’s cheeks was less from embarrassment than it was from sheer happiness. Uncle Ning had been full of stories about his childhood - some happy, some sad - but still, hearing them from Xian-gege….</p>\n<p>The man moved suddenly, fiddling with the flute dangling on his waist until it was in his hands. He twirled it, once, twice, thrice, smiling at how Lan Sizhui’s eyes followed the movement, as though hypnotised. “Fortunately,” he announced, “I was the champion of the Who Can Get Little A-Yuan To Sleep Contest for two years in a row!” Much to Wen Qing’s frustration - they had both had an intense, never-ending competition over who was A-Yuan’s favorite, with only poor Wen Ning moderating them. </p>\n<p>If she could see them now, what would she….</p>\n<p>Wei Wuxian shook his head, as though to clear the thoughts that had suddenly arisen in them. Then, in front of A-Yuan’s fascinated gaze, he brought the flute to his lips and closed his eyes in memory of the song. </p>\n<p>He hadn’t played it for so long, and yet his fingers moved over the notes as though it was second nature. Perhaps it was - lullabies, even one as unconventional as this, were hard to forget.</p>\n<p>It was an old tune, bastardized from Granny Wen’s hums of the mourning songs of her people. He had invented it in a fit of exhaustion at the end of a particularly long day, when A-Yuan’s unwillingness to sleep had only added onto the noise of the spirits of the Burial Mounds following him about the whole day. </p>\n<p>Wen Qing had nearly come screaming in when he first played it, shouting about him giving A-Yuan nightmares. It was only Wei Wuxian’s frantic gesturing that kept the initial shout from coming out of her throat as she froze at the sight of Wen Yuan, happily asleep. </p>\n<p>The reason behind Wen Qing’s anger, behind why she had frankly banned him from playing the song near the more elderly members of the camp was because….well, quite frankly, it was because it was way too creepy!</p>\n<p>Half-way to sleep, Jin Ling woke up a jolt at the sudden noise, nearly leaping out of his skin when a hand touched his. He looked in the direction of the touch to see Lan Jingyi shush him, a finger on his lips. He bristled, nearly opening his mouth to ask who exactly Lan Jingyi thought he was to make such gestures - only to stop when the other pointed to their left. </p>\n<p>Slowly, Jin Ling looked up, and immediately sucked in a sharp breath. </p>\n<p>When they had gone to sleep, they had left a decent amount of distance between the junior disciples and the senior guiding them, more out of habit than anything else. Yet somehow, over the course of the night, Lan Sizhui had migrated to where the other was sitting, flute pressed to his lips.</p>\n<p>The music that he was producing…..was really not fit for one nearing sleep at all! It was more akin to what one would imagine accompanying a tale of horror, or, Jin Ling thought with a blush, even that moment in The Play when the Yiling Laozu, surrounded by a legion of giggling undead women, invites Hanguang-jun onto his balcony, twirling a peony in his hand. </p>\n<p>It was a lilting melody, smooth twists and turns reminiscent of some dark forest path. Subconsciously, Jin Ling imagined the winding road up that cave in the Burial Mounds where unc - where Jin Guangyao had trapped him and the others, and shivered. If such a melody played back then, surely Ouayng Zizhen would have fainted from shock! </p>\n<p>The melody continued, soft, repetitive, pushing the boundary of melancholy into some hypnotic terror and back. Even though Jin Ling knew that he was probably safer here than he had been in months, surrounded by allied disciples and an awesomely strong guardian, he could feel the hairs on his arms rise. All around him, he could see other disciples stirring, but none of them awoke. It was only he and Jingyi, he realized with horror, who had awoken due to their close vicinity to Wei Wuxian. </p>\n<p>‘Get close to your uncle, Jin Ling,’ he had thought, ‘Pick up your balls and start building a relationship with your uncle Jin Ling.’ Hah! </p>\n<p>“What the actual fuck is this,” Lan Jingyi hissed, voice low enough to be covered by the sound of the flute. “Why is he trying to invite all the denizens of hell into this clearing?”</p>\n<p>“How would I know?” Jin Ling furiously retorted back. “That’s <em> your </em>beloved Second Master’s spouse!” </p>\n<p>“He’s your uncle!” Lan Jingyi bit right back. They fell silent, having moved closer together to speak. “Oh god, he’s still going. Oh god, he’s never going to stop.”</p>\n<p>Jin Ling craned his neck up, “Then we should tell him to shut up! What on earth is Sizhui doing allowing this madness to continue?!”</p>\n<p>As if he had heard them, the sound of the flute cut off. They heard the sound of shifting cloth, a light thud, followed by silence. Unconsciously, they held their breaths. </p>\n<p>Wei Wuxian chuckled. “Ahh, it’s good to see that still works,” he murmured, fondness permeating throughout his tone. It was only his curiosity which gave Jin Ling the courage to crane his neck up, his breath catching at the sight before him. </p>\n<p>Lan Sizhui lay completely asleep, his head placed on Wei Wuxian’s thigh. They made for an odd sight, this child dressed in stark white and the man cloaked in black, but still when Wei Wuxian leaned forward, dragged a hand through Lan Sizhui’s hair slowly, steadily, when Lan Sizhui leaned into the touch with a sleepy murmur, Jin Ling couldn’t help but think that they were the most natural thing he had ever seen. </p>\n<p>Wei Wuxian looked up and suddenly caught his eyes. Jin Ling froze, fighting his original instinct to duck and feign sleep again. The older man grinned, lifting his hand to his lips in a shushing gesture, before moving it as though asking Jin Ling to lie down again. When Jin Ling made a face, he threateningly picked up his flute again, as though he were going to play that god awful tune once more. </p>\n<p>Jin Ling lay down.</p>\n<p>A small <em> pfft </em>of laughter followed. He could almost imagine the other man’s shoulders rising and falling in an attempt to suppress the noise and keep it from waking the child in his lap. Despite himself, despite the indignation he felt at being ordered around, Jin Ling smiled, closing his eyes as he tried to force his body to relax again. By his side, he could sense Lan Jingyi do the same. </p>\n<p>One deep breath, then another. A soft flute joined the sound of their sleep, kinder, more forgiving this time than it had been before. It mixed with the melody of the night and between one blink and another, Jin Ling found himself asleep. </p>\n<p> </p>\n<p>11.5.</p>\n<p>\n<em> Wei Ying, </em>\n</p>\n<p>\n<em> I’m glad to hear that you have encountered Sizhui on his way home and that he is doing well. Even with the entire sect willing to help me on any trials I face, I must confess that I missed his presence dearly. He is, after all, the only one after my brother and you who can fully read my “ice-block face”, as you so eloquently put it. Perhaps it was a shortcoming of mine as a father, but I fully admit to using him as a medium to conduct interactions with other people.  </em>\n</p>\n<p>\n<em> The news that you bring from the borders is alarming indeed. Unfortunately, it matches reports that I have received from other areas of the same misfortunes, which appear to have been occurring for quite a while under all our noses. Wei Ying, your decision to bring the matter in front of Sect Leader Jiang was the right, considering that the village was closer to Yunmeng than it was to Gusu, but I still worry about your presence there. Even if you had left on somewhat amicable terms, Jiang Wanyin has gotten strangely more prickly and disagreeable since your parting…. </em>\n</p>\n<p> </p>\n<p>12.</p>\n<p>There was nothing quite like Yunmeng in bloom. The scent of the lotus blossoms permeating the air, the noise of loud market-sellers laughing, teasing and bargaining, the smell of spices in the wind….ahh, how could he not have missed this place? How could he not have longed to come back?</p>\n<p>Still, he had been hesitant to come here, even going as far as to say that Jin Ling could come back and take care of the issues himself. Each of the disciples had, after all, gone to the village after the hunt and seen the condition of the people there. If need be, any of them could provide adequate testimony, which was why they had been invited to come to Yunmeng instead of going back to their respective sects, and told to stay there until their sect leaders arrived for a small meeting regarding the issue. </p>\n<p>“Are you going to take off again?” Jin Ling had the most terrible expression in the world, something so quiet and resigned. Wei Wuxian remembered with a start that this nephew of his was only a teen - around the same age he had been when Lotus Pier burned, and found himself agreeing to tag along without a second thought. </p>\n<p>(Anything to get that strange sorrow off Jin Ling’s face.)</p>\n<p>Still, that didn’t mean he was looking forward to the shitstorm which would follow! Despite having parted with Jiang Cheng somewhat peacefully, he had no illusions about what their relationship had become. </p>\n<p>At the end of the day….well, quite frankly, it was still an absolute shitshow. </p>\n<p>“Jin Ling,” he said as they entered the doors of the YunmengJiang courtyard, “I’ve known you for less than a year but I still love you dearly, so you should know: this is me giving all the presents I’ve missed out on for 16 years. Never say I didn’t do anything for you.”</p>\n<p>Jin Ling colored lightly. He had been barely holding on to the onslaught of affection for their entire journey back, entirely unused to how Wei Wuxian would sling his arms around their shoulders or ruffle their hair when they said something particularly clever. It was something entirely new - not even Jin Guangyao, the more tender of his uncles, had ever been so casual in his praise and love but...honestly, he couldn’t say that he minded it.</p>\n<p>“What do you mean, 16 years worth of presents?” he shot back, delighting in the disrespect, “You’re way too poor to even buy me one!”</p>\n<p>“Hah?!” Wei Wuxian advanced on the boy, waving his flute as if to hit him on the head. Jin Ling ducked, hiding behind a giggling Lan Jingyi, biting his lips to curtail his own smile. “You’ve become mouthy I see! Nothing a few hours buried neck-deep in the lotus ponds won’t fix!”</p>\n<p>“Xian-gege, don’t!” Despite his protests, Lan Sizhui was clearly fighting back his own laughter. </p>\n<p>It was this merry scene which greeted Jiang Cheng when he made out to invite them in, Wei Wuxian chasing a laughing Jin Ling down the pier with playful threats of punishment. He should have let them know that he was there - should have told them to stop messing around - but - but -</p>\n<p>\n<em> “Wei Wuxian, if you keep running that fast, you’re going to fall into the lake!” </em>\n</p>\n<p>\n<em> Cheerful laughter compounded by the sound of running feet. “That’s the plan, shidi!” </em>\n</p>\n<p>It was Lan Sizhui who spotted him first. His laughter died in his throat as he stiffened, turning towards the man and offering a deep bow. “Sect Leader Jiang.”</p>\n<p>The other disciples jumped at the name, also turning around to offer their greetings, apologies and thanks tumbling from their lips. Apart from a short nod, Jiang Cheng deigned to reply to them, instead turning to call, “Jin Ling!” just as the boy pushed his laughing uncle into the lake. </p>\n<p>Jin Ling whipped around, just as Wei Wuxian emerged from the water, spluttering. Despite himself, Jiang Cheng couldn’t stop his lips from twitching at the startled expression on both their faces. </p>\n<p>“If you’re done making a buffoon of yourself,” he told his nephew, “then come in. Tonight’s going to be cold.”</p>\n<p>He swept right back into the main compound, not waiting for anyone to follow him, handing the still Lan Sizhui something with no explanation. The disciples trudged in anyway, keeping silent and speaking in whispers about the days to come. </p>\n<p>Wei Wuxian was content to watch them all go, kicking around the still-warm waters with lazy feet. He startled as a hand reached to pull him out, looking up to see Jin Ling standing above him, waiting for him to take the offered assistance. “Come on,” the younger boy said, the excitement of the chase still visible in the tousled look of his hair and the red of his cheeks, “Uncle was right, it <em> is </em>going to get cold tonight.”</p>\n<p>Most disciples knew of the older man’s lack of tolerance for the cold due to Hanguang-jun’s request to shelter him during the big storm. But as they approached the gate, where Lan Jingyi and Lan Sizhui were still standing in wait for them, Wei Wuxian knew that that was not the only reason why Jiang Cheng had invited them in. </p>\n<p>“Senior Wei,” Lan Sizhui greeted with a smile, “Jin Ling.” He offered them the items in his arms. “Sect Leader Jiang was worried about you both getting too cold.”</p>\n<p>Wei Wuxian took the large, warm cloth and wrapped it around himself with shaking hands. He trembled partly because of the wind, but also because - because -</p>\n<p>\n<em> “A-Xian, A-Cheng, come back in before you catch a cold! Here, wear this. I made your favorite soup today, so drink lots of it and warm yourselves up, alright?” </em>\n</p>\n<p> </p>\n<p>12.5.</p>\n<p>\n<em> My beloved Er-gege, </em>\n</p>\n<p>\n<em> My stay in Yunmeng so far has been calm. Well, perhaps not entirely: I’m sure that you’ll soon get reports that I’ve been up to my old tricks in terrorizing the market people lately but I want to tell you beforehand that it’s not my fault! Besides, they enjoy the challenge I present! Haggling isn’t just some fun hobby for poor men like me, Lan Zhan, it’s a way of life.  </em>\n</p>\n<p>\n<em> The disciples in Yunmeng are super cute, though, even if the swordmaster is just as stuffy as Old Master Lan. I’ve taken to teaching them bits and pieces of Yunmeng style stances when I can, including how it can be integrated with styles from other sects. I can see Jiang Cheng looking in when I’m teaching them, but he doesn’t move to stop me. And while I’m glad for it, I can’t deny that it still saddens me somewhat, dear Lan Zhan. We have stayed out of each other’s ways throughout this trip, and while not getting another explosive public argument is definitely for the better, I still had hopes that we would be able to reconnect…. </em>\n</p>\n<p>\n<em> …really, this shidi of mine is so like you in certain ways. No, I saw the face you made at that, Lan Er-gege, let me explain! For example, every restaurant I’ve gone to in Yunmeng has refused what meagre payment I’ve tried to offer them, claiming that they’ve already been paid….My favorite Yunmeng liquor is also well stocked in the kitchens! The cooks say that the sect leader told them to….. </em>\n</p>\n<p>\n<em> ….and despite all this, that silly little brother of mine has made no move to come talk to me…. </em>\n</p>\n<p>\n<em> ….I suppose I share just as much of a fault in our non-communication - I am the elder brother, after all…. </em>\n</p>\n<p> </p>\n<p>13.</p>\n<p>In their last few days  in Yunmeng, Lan Sizhui found Wei Wuxian by the pier. Judging by the three empty bottles carelessly next to his side, he had been there for a while. With his hands pressed against his side and his feet creating light ripples in the water, the older man was looking at the sky, humming a light tune as he took in the sight of the stars. </p>\n<p>Lan Sizhui hesitated - Xian-gege looked so peaceful, could he really interrupt him? Wei Wuxian had been a popular  figure within Yunmeng, with the number of people wanting his presence only increasing as he began to mentor the younger disciples more. Lan Sizhui was happy, incredibly so, that his guardian was being received so well, considering his previous reputation...and yet, he could not deny that he wanted to speak to the elder by himself.</p>\n<p>What a childish feeling it was - to want your parent’s attention to yourself - and yet, even the thought that he could have this now made him giddy with happiness. </p>\n<p>Before he could make up his mind on the best course of action, Wei Wuxian called out to him. “A-Yuan! Come over here!”</p>\n<p>Lan Sizhui smiled, making his way over with light steps. Carefully, he sat down next to the elder, taking care to remove his boots and socks behind him so that he could also dip his feet in the water as well. He let out a sound of surprise when they made contact with the water, making Xian-gege laugh out loud. </p>\n<p>“Haha, that was such a cute reaction, A-Yuan!”</p>\n<p>Lan Sizhui blushed. “Oh, I’m sorry, Xian-gege….I just didn’t realize how warm the water would still be.”</p>\n<p>Wei Wuxian hummed, feet kicking in the water. “It’s because water always holds more of the sun’s warmth than the land,” he told the younger. “It’s also harder to heat up, though. So, if you live by a body of water, you can always get a cool bath in the middle of the day and a warm rest later at night! It’s the best!”</p>\n<p>Lan Sizhui let out a sound of understanding. “Ah, I see. While the Cloud Recesses does indeed have many smaller ponds, we normally aren’t awake late enough at night to enjoy this - not to mention that since some of those ponds hold fish, it’s forbidden to do so anyway,” he explained. </p>\n<p>Wei  Wuxian made a disgusted face. “Blegh! Forbidden this, forbidden that - when I go up that mountain again, I’ll drive that stuffy Old Man Lan into tears or my name won’t be Wei Wuxian!”</p>\n<p>Lan Sizhui couldn’t hide his excitement at the statement. “So you’ll come back?!”</p>\n<p>Wei Wuxian looked at him, clearly surprised at the sudden liveliness in his tone. Still, his eyes softened when he saw the excitement in the boy’s face. He lifted one hand to pat the other’s head, “Of course I’ll have to come there! Who’s going to rescue Lan Zhan from those boring old fuddie-duddies if not me?”</p>\n<p>There was a reason why Lan Sizhui was considered amongst the smartest in his clan. “But you aren’t right now?” Even if he posed it as a question, he knew the answer in his sinking heart. </p>\n<p>Wei Wuxian’s eyes widened at the vulnerable tone of the child in front of him. After some moments, he smiled - a soft, gentle smile, so unlike his regular rambunctious ones, but just as precious. “Oh, A-Yuan,” he said, “We’ll all be together soon.” His hand stroked the younger’s hair once more, then again, falling into a pattern that made Lan Sizhui’s eyes flutter shut. “The world’s shaken up so much….we both needed this time to ourselves, just as much as we need each other.”</p>\n<p>Lan Sizhui gave into his impulse, allowing his head to fall into the other’s lap with a soft thud. Staring at the stars above them, he asked, “Does it bother you, Xian-gege?” His voice was quiet. </p>\n<p>“Hmm?” </p>\n<p>Lan Sizhui was strangely hesitant about saying. Finally, he began, “Everyone is always talking about you two nowadays. And then that play…” He trailed off, remembering the journey here, and how everyone had beset the elder with questions about his and Lan Wangji’s early adventures. Things had quietened down somewhat since they had come to Yunmeng, with people unwilling to make as much noise and excitement near the fearsome YunmengJiang sect leader, but if Lan Sizhui had noticed how the eyes of the Jiang disciples so eagerly tracked the motion of the white headband tied upon the other’s wrist, there was no way that Wei Wuxian himself had missed it. </p>\n<p>In response, Wei Wuxian gave another thoughtful hum, resuming his play with the younger’s hair. Just as Lan Sizhui looked at the stars, Wei Wuxian looked at their reflection in the rippling waters of the lake and allowed the thoughts in his mind to set into the perfect words. </p>\n<p>“A-Yuan, our generation was one which was built for war,” he finally said. “We were created with it in our veins. All our guardians….were incredibly aware of the fragile reality of the world we lived in. They knew just how little it would take for the balance of power to tip over, and for chaos to reign anew.”</p>\n<p>“And so,” he continued, “they raised us with that in mind.”</p>\n<p>If he closed his eyes now, he could almost see that past again, him and his fellow disciples on the training field while Madam Yu taught them how to take down men thrice their size. “We must have spent more time learning how to fight and disable other humans than we ever did learning how to help them. Even when they were teaching us about beasts and spiritual creatures….our instructors always paid extraordinary attention to teaching us how to spar, in ensuring that we knew the weak points of the human body, and exactly how far we could push it before it collapsed.”</p>\n<p>He opened his eyes and immediately met the concerned gaze of the boy in his lap. Before the other could react, he reached forward to touch Lan Sizhui’s cheek. “The war on the horizon was inevitable, and we were raised accordingly to be a generation which would live through it. But, A-Yuan, all we ever wanted is to clear the skies, for ourselves <em> and </em>for those who would follow us.”</p>\n<p>His voice dropped in tone. “It’s shameful enough that you have to live in the shadows of our sins, that you have to pick up after our mistakes. A-Yuan, we were a generation of war. We never wanted to create another one like us. So...if your generation chooses to be one of love - well, I don’t think any of us would be opposed to that.”</p>\n<p>Lan Sizhui blinked rapidly at the end of the speech, attempting to dispel the tears in his eyes. “X-Xian-gege,” he began, “I…..”</p>\n<p>“Or if anyone <em> is </em>opposed to that, you send them to this Laozu, and I’ll teach them a lesson!”</p>\n<p>It was slightly teary, but the sound that left Lan Sizhui’s mouth was still undoubtedly a laugh. “Xian-gege, you can’t just go beating people up!”</p>\n<p>“Psh, I’d like to see any of them stop me! What’re they going to do, whine about me to Lan Zhan?”</p>\n<p>They continued talking in such a manner deep into the night, with Wei Wuxian eventually bringing out his flute to once more send the child to sleep. So absorbed were they in each other, in the awe of once again being able to live and laugh beside an existence so dear, an existence which they once thought to be lost forever, that neither of the two distinguished cultivators noticed a familiar shadow linger behind a pillar, departing well before dawn. </p>\n<p> </p>\n<p>14.</p>\n<p>The night before he left Yunmeng once more, Wei Wuxian decided to fuck propriety and the imminent threat of being whipped to once again visit the Ancestral Hall. It felt strange - to be back in the place where he had spent so much of his childhood and to see the names of the people who he had once loved and held in such high regard placed there. </p>\n<p><em> Shijie. </em>It had been so many years since he had last seen her, and yet, every day, it shocked him to realize that he would wake up in a world where he would never be able to make her smile again. </p>\n<p>It was only the understanding that shijie would be unhappy to see him unhappy which allowed him to curl his lips into a painful grin. “Shijie,” he began, fake cheer permeating his voice, “your XianXian has come back to you.” In the silence of the hall, his voice echoed uncomfortably, but still, he settled down to have a long talk with his sister. </p>\n<p>She wouldn’t have liked to know about all the chaos which struck the cultivation world - had already been sick and tired of the bloodshed back when she had been serving amongst the medics in the Sunshot Campaign. So, rather than tell her tales of fire and rebirth, Wei Wuxian instead told her tidbits of the world today. He told her about Jin Ling, how he had grown into a man with promise, who still retained enough of his childhood to throw him into the lake. He told her about the children who her son had befriended, his own sun-lit child included. </p>\n<p>“I wish you could see him, shijie,” he murmured, gazing adoringly at the tablet above him. “You would be so proud and happy.”</p>\n<p>If Jiang Yanli could see her child right now - if she could see just how much he had grown over the course of a few months, from that bitter, friendless boy to an emerging leader with his roots anchored in the ground, she would be ecstatic. And by now, after all his wounds had been scabbed over and the skin under them had regrown, Wei Wuxian also knew this: If Jiang Yanli could see him now, the little brother who had broken apart and taken half the world with him, the little brother who she had bled and died for - if she could see how much he now loved and cherished the life she had saved, if she could see him as at peace as he was right now….</p>\n<p>It would have been worth it to her, he knew. </p>\n<p>“Shijie,” he murmured at last, kneeling one last time, a deep bow that made his forehead touch the ground, “Uncle Jiang. Madam Yu.”</p>\n<p>“I’m sorry.” His voice trembled, and still, he forged onwards. “And….thank you.”</p>\n<p>He stayed in that position for a long time, until he back ached from the bend. <em> Some more time, </em> he thought, <em> just some more time, and then I’ll leave. </em>But truth be told, he wanted to stay here forever, breathing in the smell of incense and feeling the presence of his sister surround him. He could almost imagine her hand in his hair, her fingers tweaking his nose. </p>\n<p>The idea that this was the closest he’d ever be to her again….he wondered if he would ever grow used to it. </p>\n<p>A <em> thud </em>near his head startled him from his thoughts. Still kneeling, he looked over to see a bowl placed next to him, steam still escaping from the top. His breath froze, falling silent in the quiet hall as two accompanies sounds told him that the person who brought the bowl had also chosen to kneel. Wei Wuxian closed his eyes, turning them back to the ground.</p>\n<p>If he looked up and saw those familiar purple robes….he didn’t know what he would do. </p>\n<p>As his luck would have it, the person next to him seemed to have no intention of letting him go that easily. “How long are you going to keep bowing, you fool,” Jiang Cheng muttered. “If you wanted to have your back broken, you need only have come to me.” </p>\n<p>The words, vicious as they were, held no venom. Slowly, as though he had been backed into a room with some predator, Wei Wuxian sat up and looked to his left. </p>\n<p>The last time he had been in this room, this man had entered with enough fury to outburn the sun, intent on not letting Wei Wuxian leave it unscorched. If Lan Wangji had not been there….Wei Wuxian had no doubt that they would have been re-enacting scenes from the first fires all over again, that Jiang Cheng would have wrapped his hand around Wei Wuxian’s throat and <em> squeezed, </em>that this time, he would not let go, and that this time, with no threat to protect him from, Wei Wuxian would have let him achieve that longed-for dream. </p>\n<p>None of that flame was present right now. No, Jiang Cheng just looked….</p>\n<p>“You look tired,” the words escaped him before he was even aware of it. He settled himself on his knees, placing his hands on his lap.</p>\n<p>Jiang Cheng snorted. “<em> You </em>try managing the idiots that form the local sects and we’ll see how pretty you look at the end of it.”</p>\n<p>Wei Wuxian burst out into a bark of loud laughter, only to hurriedly clamp his mouth shut, the sound echoing awkwardly through the wooden walls. He cleared his throat, looking ahead at the altar once again. “That, uhm, that must be rough.”</p>\n<p>Looking as he was ahead, he did not notice the small flecks of amusement in the other man’s face. It wasn’t long before they fell into silence once again. </p>\n<p>“You’re leaving,” Jiang Cheng said, matter of fact. Wei Wuxian, unsure of whether it was a command or a statement, simply nodded his head. </p>\n<p>“Yes….something tells me I’ve outstayed my welcome here.”</p>\n<p>Jiang Cheng’s voice darkened. “And who told you that?”</p>\n<p>Wei Wuxian remained quiet. </p>\n<p>Jiang Cheng scoffed. “Typical. How very <em> Wei Wuxian </em>of you, to determine what other people do and do not think, without even once considering their opinions.”</p>\n<p>Wei Wuxian flinched, instinctively curling into himself. “Jiang Cheng,” he began, “not here, please. Not now. Please, just give me some more time and I’ll leave.”</p>\n<p>This time, it was Jiang Cheng’s turn to freeze. Slowly, he turned and looked at the miserable figure of the older man (was he even older? Where did he spend all those years? Did he spend them awake or dreaming, haunted by the nightmares that dogged Jiang Cheng’s steps in either state?) and felt his heart stutter. His mouth opened and closed as he struggled to find the words he had thought of speaking, realizing that they had slipped away the moment he had stepped foot in the hall. </p>\n<p><em> No plan, </em> he remembered his junior disciples saying hysterically, <em> ever survives first encounter with Wei Wuxian.  </em></p>\n<p>Finally, “You said that you never wanted to come back to this place again.”</p>\n<p>Wei Wuxian, “....I thought that would make you happy.”</p>\n<p>Jiang Cheng, fed up with the whole situation, said with great deliberation, “...you should stop thinking about doing things to make me happy.” He stood up suddenly, completely prepared to walk away. </p>\n<p>He had spent so long preparing himself to come here, to confront this man. And yet, once faced with him - once faced with him -</p>\n<p><em> Ah, </em>he really couldn’t stand this person!</p>\n<p>His steps echoed throughout the room as he moved towards the door, only to stop when a broken voice behind him rang out, “....how could I do that?”</p>\n<p>Wei Wuxian did not move an inch from where he had been before. “How could I stop trying to do things that make my little brother happy? Especially after - after <em> everything -” </em> He cut himself off, wrapping his arms around himself. He wasn’t bowing anymore, but still, looking at him on his knees like this felt <em> wrong, </em>no matter how much Jiang Cheng had dreamt about making him beg for forgiveness and repentance in this hall.</p>\n<p>“Jiang Cheng, I’m sorry,” his brother told him, “I’m sorry, I’m sorry, I really am.” He trembled harder still, but still continued, as though the words were escaping him without his consent. “I didn’t mean for any of this to happen. I just - I promised Madam Yu I’d take care of you. How could I break that promise?”</p>\n<p>“You should have told me,” Jiang Cheng spoke, his voice sounding distant to his own ears, “You should have told me, you <em> bastard, </em>or did you really think that I was so fragile as to fall apart -”</p>\n<p>“No!” Wei Wuxian looked up at him, “Of course I don’t think you’re weak - god, Jiang Cheng, I just - things were happening so <em> fast -” </em></p>\n<p>Jiang Cheng didn’t know when he had crossed back into the room and fallen beside his brother again. No longer looming, looking at Wei Wuxian in the eye, Jiang Cheng said, “That day, I didn’t go back for their bodies.”</p>\n<p>Wei Wuxian intook a sharp breath. </p>\n<p>“There were Wen soldiers on the street, looking for you,” he told the other, “you were - you were <em> buying food, you absolute idiot, you didn’t even notice -” </em></p>\n<p>His brother let out a pained groan, swaying as though he had been hit. Jiang Cheng’s hands fluttered, twitching as though trying to catch him. “Why would you do that?” The words came out in a moan, “You’re the heir — what would I have done without — why would you—”</p>\n<p>“You’re my brother,” Jiang Cheng replied, and <em> oh, </em>that was the most simple vein of thought to follow, “why wouldn’t I want to keep you safe?”</p>\n<p>Wei Wuxian sobbed, “You were starving,” a gasp, “you wouldn’t react to anything I said, wouldn’t move unless I told you to, and I just - I just wanted to make you <em> happy </em> again, A-Cheng - <em> I’m sorry - I couldn’t keep our promise -” </em></p>\n<p>“Stop it,” Jiang Cheng reached out to grasp shaking hands, barely noticing how his own were shaking in turn, “stop.” </p>\n<p>At his touch, Wei Wuxian looked up once again. Jiang Cheng panicked at the sight of those familiar grey eyes pooling with tears, and reacted to that panic by bringing his arms around the other and crushing him to his chest. </p>\n<p><em> If I don’t see it anymore, it doesn’t exist. </em> Childish thinking, yes, but no one had ever accused Jiang Cheng of growing up. <em> If I pretend that I didn’t make him cry again, maybe Lan Wangji won’t descend out of the sky to reap my soul.  </em></p>\n<p>“What’re you apologizing for, you fool,” his own voice shook, a fact that he ignored expertly, with years of practice in locking up his emotions. “Don’t you remember the first thing you were promised when you arrived on Lotus Pier?”</p>\n<p>Wei Wuxian’s eyes flew open, stretching wide in shock. Despite his terrible memory, there were some things he could never forget. </p>\n<p>Was Jiang Cheng really saying - was he <em> actually </em>suggesting -</p>\n<p>“Wei Ying,” his little brother murmured in his ears, and <em> oh, </em>they were both shaking, wasn’t this a funny sight, “brother. In Lotus Pier, you never have to apologize for things which are not your fault.” </p>\n<p>Wasn’t that another promise that had been broken a thousand times over? Even when he walked the halls with his head held high, even when he teased and laughed and glowed brighter and brighter by the year, Wei Wuxian had always lived in Lotus Pier as though he were apologizing for his very existence, so very hesitant to believe that they might think of him as family despite proclaiming them to be his. </p>\n<p>“I promised Madam Yu that I’d keep you safe,” Wei Wuxian whispered, “even if it cost me my life.”</p>\n<p>“Fuck what my mother said,” oh god, he actually said that — oh god, he said that in the <em> ancestral hall, his mother’s spirit would kill him in his sleep — </em>“I never needed you to die for me, or to rip yourself apart for me. A-Xian, I just wanted you to stay by my side.”</p>\n<p>His mother said, “I knew you would bring calamity upon this sect, boy,” but his brother said, “The war on the horizon was inevitable,” and at this moment, Jiang Cheng knew who he could believe in, knew who was right.They could snipe and snark and try to shift blame, try to find the exact person they could pin their tragedy on, but what good would that do in its aftermath? What good would that do when they had each other now?</p>\n<p>“You’re the only one I have left,” Jiang Cheng murmured into a black-clad shoulder. It wasn’t true, not entirely. Jiang Cheng had his sect, the pride that he had built up brick-by-brick, the disciples who he had personally selected and taught. He had Jin Ling, the last strand of his sister’s existence, the child who he had raised, who he had rocked to sleep on late, wide-eyed nights. Even without his sister, even without his brother, he had lived, somehow. </p>\n<p>But jiejie had once said <em> A-Xian, you, me, and A-Cheng, we’re now the closest in the whole world, </em>and hadn’t she been right? It felt like they were one soul split into three, like without the other two by his side, Jiang Cheng was bereft. </p>\n<p>He would never hold jiejie like this again, but this part of his soul had returned to him once again. Slow and stubborn as he was, Jiang Cheng would always <em> learn </em>from his mistakes, would get the things which Wei Wuxian succeeded in at once right in two tries. </p>\n<p>In this second try, he wouldn’t let go. </p>\n<p>“Stay here for the night. Eat with me, drink with me. Let me see you off in the morning. A-Xian, there will never be a Lotus Pier which you will be forced to leave again.”</p>\n<p>Wei Wuxian nodded his head frantically, their arms still wound so tightly around each other that it was hard to tell where one ended and another began. “I won’t leave you,” he mumbled, voice still teary, “not like before, I swear.”</p>\n<p>Wei Wuxian would depart come morning, leave to see a world which could no longer ask anything of him. Later still, he would go to his <em> husband </em>(and wow, wasn’t that still a sour word), to cause chaos and have the one who follows the chaos be right beside him. But he was in Jiang Cheng’s arms now (when was the last time he had held his brother?), the two uneven jagged shards of their same-soul merging together. Even without the third, they had no intention of ever splitting apart again.</p>\n<p>Jiang Cheng knew this time, they had both made promises that they had every intention of keeping. </p>\n<p> </p>\n<p>14.5</p>\n<p>\n<em> Father, </em>\n</p>\n<p>\n<em> Thank you for letting me go on this journey. I feel like I have learnt much from Uncle Ning, about myself and who my people once were, and I will aim to integrate this learning into all that I do now. I can only apologize for the abrupt and irregular letters back. Still, I find that I couldn’t stay away from home for too long, so as I begin my journey there, I promise I’ll keep much more in touch. </em>\n</p>\n<p>\n<em> I’ll be traveling back with Jingyi and the junior disciples once the discussion about the border situation has been cleared out. I invited Xian-gege over too but he expressed a wish to travel westward. He left earlier this morning, seen off by Sect Leader Jiang. I’m happy to announce that they seem to have rekindled their relationship.... </em>\n</p>\n<p> </p>\n<p>15.</p>\n<p>In the end, it feels as though everything passes: time, life, love. Everything passes but grief.</p>\n<p>It’s a foolish, infuriating reality, one that Lan Xichen finds himself unable to change.</p>\n<p>Since he began his seclusion, Lan Xichen had not allowed himself to see anyone. He was well aware of his sect’s worry, of the world’s curiosity, of his uncle’s shame. It was simply....hard to care about those things, nowadays. It was hard to care about anything but the growing void in soul, the echoes of grief and regret and disgust at that grief and regret. </p>\n<p>He could hear his uncle now: <em> why would you grieve such a person, Xichen? He has done nothing to deserve your concern! </em> Once, Lan Xichen had watched his uncle say the same to his little brother. Back then, Lan Wangji had stood tall in the face of recrimination, unwilling to bend even a little. <em> Uncle, my grief is my own to give. </em></p>\n<p>For all that people would compare him and his brother, for all that they would group them as the same, the <em> Twin Jades of the Lan, </em>Lan Xichen knew better. His brother was the pride of the world, his soul unmarred despite the marks on his body. And Lan Xichen.....</p>\n<p>...he was the world’s pity.</p>\n<p>But even the thought of seeing that pity sickened him. He didn’t want to go out and be surrounded by sympathetic eyes, by venomous words hidden in cotton. <em> Poor Zewu-Jun, to have been tricked by the bastard son of a prostitute in such a manner. Those folks, trying to move their way up society, defying the fate that they were given by their birth - they’re all the same heathens.  </em></p>\n<p>How would he respond to such words? <em> Don’t you all see that he was more than just a son of a prostitute? Don’t you see how far he went to elevate himself above that status? </em></p>\n<p>\n<em> Oh, A-Yao, do you see what’s become of your name now? If you could, would you do it all over again? When you killed your son - when you killed those women - when you organized the death and misery of so many - did you ever feel any regret? </em>\n</p>\n<p>Everyday, new questions arose in his mind, a litany of never-ending <em> what-ifs </em> and <em> maybes. </em>They would never be answered again. He had resigned himself to living and dying with his regrets. The rest of the sect, managing external turmoil and internal murmurs, was helpless to stop him.</p>\n<p>Perhaps unsurprisingly, it was Lan Wangji who refused to give up on him.</p>\n<p>If Lan Xichen could, he wouldn’t have allowed his brother into his seclusion chamber in the first place, would have kept himself sequestered here until he could make sense of the world around him again, no matter how long that took. But Lan Wangji was no longer the boy who waited outside closed doors for eternity.</p>\n<p>(And hadn’t that been a shock, when his brother simply <em> blasted </em>through the talismen he had present around his prison, shamelessly claiming that Wei Wuxian had given him some offensive seals to ‘test out’? When exactly had his brother grown to be bold? Why had he not been able to see it? </p>\n<p>What would he miss out on again, while he languished in his despair?)</p>\n<p>In the end, Lan Wangji would visit him every day that he could, sometimes sitting next to him and playing the guqin, sometimes sitting next to him and staring him down until he drank the tea that would be laid out in front of them, sometimes straight-up bullying him into aiding his duties.</p>\n<p>(“Jiang Wanyin and Sect Leader Yao would be the best neighbours for this conference, would you not agree, Xiongzhang?”</p>\n<p>“....Wangji, just give me the seating plan please.”)</p>\n<p>It was….humiliating, to be cared for in such a way by his little brother. It was calming. The only thing that made Lan Xichen’s head quiet down these days. Although he had at first been hesitant of allowing these visits, had spent the first month silent and staring at the wall when they occurred, nowadays, they were the one thing he looked forward to.</p>\n<p>Lan Wangji had always seemed an unearthly entity, but ever since the end of this storm, even since the parting on that shadowed path, he seemed more at peace with himself than ever. It was hard to look at the man in front of him and see the quiet boy who punished himself for the slightest transgression, who held a flaming brand to his own chest and <em> pressed, </em>for no other reason than to feel the pain it caused, as though that sensation was the only thing keeping him grounded in reality. </p>\n<p>At the end of everything, they had all walked their own ways: Lan Sizhui to his past, Wei Wuxian to his future, Lan Xichen to his self-reflective  imprisonment. While he didn’t regret the decision to go into seclusion, knew that this quiet was one he needed to understand and even dream of alliviating the turmoil in his mind, he feared that they had all left Lan Wangji trapped in the present by himself. </p>\n<p>Not that the other man complained. Lan Wangji handled the crushing weight on top of his head the same way he had managed his grief for sixteen years - with immense dignity. He handled it with his eyes looking forward and his feet on the ground, a steady entity in the midst of a howling storm. </p>\n<p>People always commented on how Lan Xichen was able to read his inexpressive brother with inhuman accuracy, praising him for his understanding of the otherwise recticent man. What many did not realize was that the opposite was true as well. There was perhaps no one who knew what Lan Xichen was feeling better than his brother. But even so, Lan Xichen knew better than to compare their situations, for he - no, the whole <em> world, </em>knew how flawed such a comparison would be by now. </p>\n<p>How could one compare the loss of a soulmate, an equal, one who shared the same dreams and the same ideals, to the loss of a pretend-friend?</p>\n<p>Lan Wangji had frowned, when Lan Xichen finally burst out into those thoughts, around the second month of his visiting. He had said, “It would indeed be false. My grief was my own. Xiongzhang’s grief is his own too.”</p>\n<p>“For 16 years, Wei Ying was a loss which remained in my soul,” Lan Wangji had murmured, moving to pour the lightly steeped tea into either of their cups. “At first, I feared that it was a loss I would never recover from. I feared that I had neither the strength nor the will to continue on, but still, I had Xiongzhang. I had Sizhui. I had a vow that only I could uphold.”</p>\n<p> There was an emptiness in him now. Lan Xichen knew better than to hope that it would ever be filled again. Somedays, it felt like everything passed by the grief. </p>\n<p>Nearly five months ago, Lan Xichen had sequestered himself into his cottage, intent on secluding himself for eternity, realizing that it was <em> he </em>and not his brother, who would share his parents’ fate. Three months ago, his brother had burst into his imprisonment with all the force of a hurricane, bullying him into taking on half his work in a tactic that wouldn’t be amiss on Young Master Wei’s strategies. Now, Lan Wangji sat next to him, reading his letters, taking calm sips of his tea, announcing that his nephew would also be coming to see him soon, and Lan Xichen knew better than to think that grief was all that remained.</p>\n<p> </p>\n<p>15.5</p>\n<p>\n<em> Dearest, </em>\n</p>\n<p>\n<em> First the most important matters: I’ve attached some of my rough talisman designs to this letter. Make sure Sizhui gets those, won’t you? I noticed that the suppression designs that they were using in the hunt for which I accompanied them had some energy inconsistencies, but these should be much better! Also, Lan Zhan, what on earth are these idiot sects training their disciples in nowadays - would you believe that one of them didn’t even know how to set a broken wrist? Honestly, if Wen Qing knew about the travesty we had made of field medical knowledge, she would have murdered us all by now…. </em>\n</p>\n<p> </p>\n<p>16.</p>\n<p>There was something about the Jingshi which never failed to set Lan Sizhui’s heart at peace. His earliest memories were of its walls; to this day, the Lan sect medics grumbled about how stubborn Hanguang-jun had been, unwilling to let the child he had brought back for even a second while the fever raged across his mind and destroyed all traces of his past. Lan Sizhui knew now that this hadn’t been his first home (the smell of wet soil, a dark cave, the sound of a flute echoing through its walls) but still, it held a special place in his heart.</p>\n<p>Things had been hectic since his return to the Lan sect, Hanguang-jun’s duties bleeding into the duties of other disciples and members of the sect. None of them objected to it, of course, considering how much work the other man had been shouldering by himself. Still, at the end of the day, in between their regular training and a crash-course on how to organize diplomatic meetings 101, most senior Lan disciples were completely worn out. </p>\n<p>Which is why, despite having been back for nearly a week, he hadn’t been able to spend as much time with his father as he wanted to. At the end of the day, he had simply taken matters in how own hands and shown up at the Jingshi an hour before curfew. </p>\n<p>If it were anyone else, they would undoubtedly be scolded for showing up unannounced. But since it was Sizhui….everyone knew what liberties he could take in the Recesses. </p>\n<p>(“He spoilt you rotten even back then in Yiling,” Xian-gege laughed. “I had to keep burying you in soil so you wouldn’t wander off in search of your “Nice Brother Rich.””)</p>\n<p>True to prediction, his father had simply nodded his head to allow him into the Jingshi, not looking up from where he was reading a letter with a now-familiar scrawl occupying every inch of the page, as though the sender couldn’t encompass all his thoughts over the words. </p>\n<p>Knowing Xian-gege, Lan Sizhui thought, that was probably true. </p>\n<p>“Hanguang-jun,” he gave the other man a short bow before coming to seat himself in front of him. </p>\n<p>Without words, the other passed him a few sheets of loose paper with an intricate design inked onto them. “From Wei Ying,” he explained. “He had some criticisms of the current suppression talisman.”</p>\n<p>Lan Sizhui’s grip on the paper grew tighter as he felt his heart swell with fondness. Really, Xian-gege looked after them so well. “Should I tell the hallmaster to replace them all?”</p>\n<p>“Mn, do so. But copy down the array and check on a night-hunt beforehand.”</p>\n<p>“I will.” With care, he set down the array near him, resuming his position. Before he could catch himself, he found the question escaping his mouth, “How is Xian-gege? Is he well?”</p>\n<p>It would have been audacious to ask any other senior a question while they were in the middle of reading, but he knew that his impatience would be excused. True to his beliefs, his father simply looked up, a slight smile on his lips, before moving to indulge him with answers.</p>\n<p>“He is well,” there was no mistaking the fondness in the other’s tone, only furthered by the gentle way he caressed the chaotic characters on the page, as though he could feel the other man through them. “Travelling westward. He stopped by to aid a village which was experiencing some problems with growing crops due to corrupted soil.”</p>\n<p>Lan Sizhui’s admiration was visible in his tone, “Uncle Ning told me that he did something similar when we first came to the Burial Mounds. That’s the only reason we were able to grow anything at all in that soil.”</p>\n<p>“Advanced musical cultivation can help with liberating non-living beings.” Lan Wangji set the letter aside, focusing on the boy in front of him. “If you ask him, he will teach you the theories behind it.”</p>\n<p>Lan Sizhui glowed at the suggestion, nodding in agreement. “I will!”</p>\n<p>Lan Wangji watched the boy in front of him with fondness. Lan Sizhui was - is, would always be - his greatest good, the sum of his and Wei Ying’s vow brought into a reality more grand and beautiful than either of them had ever imagined. Even when the elders had questioned his decisions in the aftermath of the siege, even after they ordered them into seclusion to clear his mind (an order he gladly took, besieged as he was by grief at the time), he refused to allow them to barr him from the child. </p>\n<p>(He refused to allow A-Yuan to feel what he had felt - kneeling in front of a door that would never open again.)</p>\n<p>Perhaps they recognized the tenuous ties binding him to the sect, but in the end, no one objected to his requests. Oh they would whisper behind his back, would stare in judgement when he didn’t reprimand Lan Yuan for making noise, but caught as he was in the sudden understanding of <em> this is right, this is how it should be, </em>those criticisms slipped off his back with ease. </p>\n<p>To see Wei Ying interact with this child - to see how fond they were of each other even when they did not recognize each other - it filled his heart with contentment. To know that he hadn’t failed in this, in his greatest and most venture yet, to know that he had done <em> well, </em>raised a child that both and Wei Ying would be proud of - it was a relief that he didn’t know he needed. </p>\n<p>It would be curfew soon, but they both knew that rules were only good as the purpose they served. So, rather than insist on sending Lan Sizhui back to his quarters, he nudged him to turn around, grabbing a simple wooden comb from nearby and lightly passing it through his hair. He had done this many times, and still, it felt sacred. </p>\n<p>“How was your meeting with him?” he asked. </p>\n<p>“It was really good! He taught us a lot. I could tell that even Jin Ling was impressed.”</p>\n<p>Lan Wangji’s voice turned amused. “Wei Ying has much wisdom and knowledge to dispense, despite all first impressions. No single person has ever changed or challenged as many pre-set theories as he.”</p>\n<p>“Mn, we learned much from even the single night of the actual hunt. Later, he taught us how to incorporate different sword forms into a cohesive set of stances.”</p>\n<p>“Adaptability is something he is especially adept at.” Lan Wangji arrived at a small tangle of hair on the lower back, turning the angle of the comb to pass it through in minimal time. “You would be wise to take in all that he offers in these matters.”</p>\n<p>Lan Sizhui laughed. “He also told us many stories about you, father.”</p>\n<p>“Oh?” Lan Wangji paused mid-stroke. Connected as he was to the on-goings of the world, it would be impossible for him to miss the rumors which were rising about him and Wei Ying. Not to mention Wei Ying’s own correspondence, where he had liberally complained about “Nie-xiong, that cheapskate - he’s probably making so much from this and he gives me <em> pocket change? </em> For my <em> own story? </em> Lan Zhan, you simply <em> must </em>torment that man in your next meeting, I know he’s still afraid of you.”</p>\n<p>(As strange and personal as their story was, it was a giddy delight to realize that so many people - so many cultivators, so many disciples, so many among the common folk - had watched his and Wei Ying’s love and recognized it as <em> true. </em>   Lan Wangji would never tell anyone of the many sleepless nights, his Jingshi too quiet, his bed too cold, when he had slipped out of the Recesses to watch the play in the town below and delighted in the <em> oohs </em> and <em> ahs </em>of his fellow watchers. </p>\n<p>Lan An had written, <em> don’t be prideful, </em>but Lan Wangji was sure that his ancestor would not begrudge him the blossom of pride that he felt upon seeing the triumph of their hard-won love.)</p>\n<p>“Did you really tie your headband around his wrist back when you were disciples to save him from a deadly assassin in the Cloud Recesses?”</p>\n<p>Lan Wangji put the comb down. “Wei Ying often exagerrates. While ancestor Lan Yi was known to be very powerful and terrifying, having invented the Chord Assasination Technique among others, calling her a deadly assassin detracts from her contributions to the Lan Sect, even if it flows better in the context of the story told....”</p>\n<p>It was far from the most calm and soothing tale a parent had told their child before bedtime, but to Lan Yuan, who had grown with melodies of war and mourning, who had felt the most comfortable in the darkness, secure in the knowledge that the shadows would protect him, it was exactly what he needed.</p>\n<p> </p>\n<p>Later that night, his son sent off to sleep, Lan Wangji looked over the letter that he had been saving for the next day, too awake to think about going to bed himself. As he read on, his eyebrows raised, breath catching at the content. Finally he set it down, hand trembling from the impact of what he had been told. </p>\n<p>He should go to rest, ruminate on it overnight and come up with a clearer idea in the morning. But in his mind, he could still hear Sizhui, echoing Wei Ying’s words to him. </p>\n<p>\n<em> “We must have spent more time learning how to fight and disable other humans than we ever did learning how to help them.” </em>\n</p>\n<p>\n<em> “A-Yuan, we were a generation of war. We never wanted to create another one like us.” </em>\n</p>\n<p> </p>\n<p><em> Wei Ying, </em> he thought, warmth spreading throughout his blood at the very thought of the other man, <em> I will uphold our vow. I will protect the innocent and punish the evil. What regrets you and I have, I will attempt to soothe, to make right where wrong has been done before.  </em></p>\n<p>\n<em> Wei Ying, I’ll see you soon. </em>\n</p>\n<p> </p>\n<p>16.5</p>\n<p>\n<em> Respected Leaders, </em>\n</p>\n<p>\n<em> This is to request your presence at the Cloud Recesses for a conference at the next full moon, to discuss an issue of the utmost importance. Reports from sects nearing Qishan have brought to attention the fact…. </em>\n</p>\n<p> </p>\n<p>17.</p>\n<p>Reports from the sects nearing Qishan had brought into attention the fact that something in the area was desperately<em> wrong. </em>On a routine night hunt, junior disciples from a minor sect which had formed near the previous center of Wen power after the war claimed to have accidentally torn through suppression arrays deep within the forests. No one knew who set the arrays up, nor what they were suppressing, so they had stayed on their guards.</p>\n<p>It wasn’t long before the results of such an act began to show. The waters in the nearby streams began to run red, causing panic in the villages reliant on them. Crops failed, with cattle becoming weaker and weaker, until they were barely enough to sustain families in the area. The wild animals the forests became more and more ferocious, attacking travelers who walked along the wooded paths with no restraint. </p>\n<p>The only clue as to what caused the phenomena were the restless spirits, too numerous to count, would arise out of thin air in the middle of the day, haunting the common folk and the cultivators alike. More than ghosts, less than demons, they  seemed to wander with no end, spirits of men, women, children — each covered in blood, appearing with trails of red streaming from their eyes. They were dressed in all sorts of scruffy clothing, but eventually, an elder was able to determine their identity — by the smallest symbol of a red sun etched on one of their robes. </p>\n<p>Under the careful investigation of the Chief Cultivator, assisted by Sect Leader Nie, the full truth came to light. If what occurred half a year ago with Jin Guangyao was a scandal, then this — this was a <em> nightmare. </em></p>\n<p>(It was a story that the entire elder cultivating generation had known, in their heart of hearts, but to see it play out in real life....that was another matter entirely.)</p>\n<p>Nearly two decades ago, Jin Guangshan and Jin Guangyao had planned the massacre of hundreds of Wen civilians, even as the world celebrated the demise of the ruling Wen branch. And then, when they realized that the spirits of those people were still uneasy — given power by the sheer depth of their sorrow and resentment — they decided to seal them away before that resentment could truly begin to flourish, entrapping them for the decades to come. </p>\n<p>If they hadn’t been released right now, Sect Leader Nie reported with a pale face, they would have broken out of the seal later on, as being trapped did nothing to appease their hatred. “What we are seeing now,” he said, “what probably what the Burial Mounds looked like when it first began to form.”</p>\n<p>As one, the audience of sect leaders shivered. It wasn’t a shocking conclusion, if one thought about it — too many of them remembered storming villages on their way to and from the Nightless City, laughing darkly as they found the settlements devoid of human life. <em> They’ve run away, the cowards, </em> they said. <em> They got what they deserved, the bastards, </em>they thought as they heard the news of handfuls beings recovered and sent to labor camps. </p>\n<p>(And when one amongst them had dared to raise his voice, to ask <em> what, why, how dare you, </em>they had sought silence him too. Too bad for them, no one could stop Wei Wuxian from speaking when he decided too.)</p>\n<p>It was a strange dissonant identity to have: the heroes of the Sunshot Campaign, also the same people who have overseen the formation of a new Burial Mounds, be it through willful or involuntary ignorance. At the end of this, what would history know them as? Would they be heroes or monsters?</p>\n<p>(The answer was quite simple, actually. All heroes were monsters by any different name, after all.)</p>\n<p>Regardless, one thing was for certain: what few clans had arisen in the west after the downfall of the QishanWen had neither the power nor the resources to resolve the issue by themselves. Therein lay an opportunity for redemption. </p>\n<p> </p>\n<p>The first hunt organized by the new Chief Cultivator….well it had debatable whether it could be called a hunt or a competition. It would be disgraceful to compete over a matter as gravely tragic and important as this, to make sport out of the death and terrible fates handed to thousands. It would be even more disgraceful to not come at the call, to sit at home and ignore what justice so demanded of them.</p>\n<p>(“Sizhui, it is not required for you to come.”</p>\n<p>“Thank you father but…..I need to do this. For myself, and for them.”)</p>\n<p>While the hunt was being organized, members of the Lan sect were sent to the area to mitigate the damage, temporarily clearing out the inhabitants of nearby villages to protect them from the resentful energies building in the area. One by one, volunteers from other sects also began to come, mainly senior disciples who could be trusted to handle the duties of organizing a mass exodus with respect and without harming their cultivation. </p>\n<p>(Lan Xichen, pale-faced, thinner than he had ever been, stood tall before their uncle and clan and announced that he would go, with all the authority of the sect leader still present in him. Looking at him, seeing him undoubtedly still hurt from the pain of newfound betrayal (“How could he do this? How could anyone do this, Wangji?! How could I have let him???”) and still stand strong in the face of calamity, Lan Wangji realized that he had never been more proud to be known as this man’s brother.)</p>\n<p>By the time spring arrived, the sects were once again ready to march to Qishan. It was reminiscent of the march all those years back, when they were empowered by their own sense of righteousness, by the sense that they were going to act in the name of <em> justice, </em>only to leave behind atrocities in their wake. </p>\n<p>It was a legion of shame-faced sect leaders who headed the procession, stuck between denying their role in the crimes to preserve their position in society or accepting their weakness in front of their disciples.</p>\n<p>(Regardless of who wielded the blade for the destruction of the Wens in Qishan, they were the ones who had demanded the death of the handful who remained. Getting the Yiling Patriarch’s people to surrender had been a point of pride after that battle at the Nightless City, they had all proudly told stories about how the proud Wen Qing had bowed. How the rabid Ghost General had been burnt. How their master had been destroyed next. </p>\n<p>Now, the Ghost General roamed the lands freely, teaching and protecting their children  from their own foolishness. Now, the same Yiling Patriarch who they had celebrating destroying had risen past his status in the past. Now, their ghosts had finally, <em> finally </em> come to haunt them. </p>\n<p>What could one say, in such a reality?)</p>\n<p> </p>\n<p>17.5.</p>\n<p>\n<em> Wei Laozu, </em>\n</p>\n<p>\n<em> It is with immense respect that we invite you….. </em>\n</p>\n<p> </p>\n<p>18.</p>\n<p>“Jingyi, watch out!”</p>\n<p>Lan Jingyi staggered as Lan Sizhui pushed him with great force, making him fly backwards and avoid the ghostly hand reaching for his chest. With quick movements, the other Lan disciples surrounded them, each grasping their chosen instruments as though they were precious weapons, which, in this scenario, was not be far from the truth. Like many other sect disciples, the Lan had chosen to act in groups, with senior disciples like Lan Jingyi and Lan Sizhui taking charge of protecting the junior disciples against the spirits as they focused their attentions on attempting to liberate them. </p>\n<p>It was a hard thing, this liberation. Some spirits went easy, already tired from years of being tied to the world long passed. Others yet, remained persistent, overflowing with sorrow and hatred. Oh, they screamed, they wept, they demanded to know what they had done to deserve their fates without words. It was....really, just too terrible. </p>\n<p>Only a few disciples could stand to remain in the villages and open forests which they roamed at a stretch, others still choosing to recuperate in the safe area created by elder cultivators, struggling to bring their mind under control before heading out to join their fellow disciples once more. </p>\n<p>It was, undoubtedly, the most challenging hunt to ever have taken place, solely because they  were expected to exercise <em> restraint. </em>To suppress these spirits again would be truly cruel.  To eliminate them - when they could not even be considered vicious ghosts, when they were the victims of wrongful deeds instead - was out of the question. Liberation, then, was the only avenue left. It was a fine balance to walk, to ensure that they did not overpower the spirits, while at the same time not being overpowered by the spirits themselves, even as they got close enough to conduct liberation rituals. </p>\n<p>It was testament to that difficulty that many of the higher level sect members and leaders had chosen to not leave the grounds. They chose to wander across the vast space to keep an eye on the efforts of their disciples, staying far enough to allow them the freedom to carry out efforts but close enough to step in if any of them truly faltered. </p>\n<p>Indeed, one of the juniors flagged, drained from the effort of playing <em> Rest </em>for so long. As if sensing the dwindling energy, the spirits renewed its efforts to escape anew, breaking through the formation as Lan Jingyi concerned himself with the falling disciples. Lan Sizhui moved forward with urgency, however the soft sound of a xiao undermined his efforts.</p>\n<p>Light and melodious, the tune soon stopped the spirits in its tracks, allowing for the juniors to hastily bow as Lan Xichen slowly approached them. Despite having been supervising the hunting grounds since early in the morning, the elder man looked completely put together. He smiled at the exhausted disciple. “Xiyi, do you wish to retire for a while?”</p>\n<p>Lan Xiyi, who was on the younger end of the group gathered there, shook his head. “Apologies, Zewu-jun,” he spoke quietly, “I cannot bear to leave the grounds. Many thanks to sect leader for aiding this disciple, despite his weakness.”</p>\n<p>Lan Sizhui frowned. “Xiyi, you have been aiding us relentlessly since the morning, not once stopping for rest. It is not weakness to falter.”</p>\n<p>Lan Jingyi nodded earnestly, always a softie when it came to the junior disciples. “You’ve been so well!” he cheered. “If you came back refreshed, how much better would it be?”</p>\n<p>Lan Xiyi turned red at the attention, spluttering at the praises. Lan Xichen watched the gathered disciples with a fond smile, eyes softening at the sight of their efforts to cheer this troublesome junior of theirs. “Sizhui, Jingyi,” he spoke, “I’ll trust you both to escort him to the rest area, then. In the meanwhile, I’ll guide the group here.”</p>\n<p>“Yes, Zewu-jun!” </p>\n<p>Just as they were preparing to depart, panicked shouts from a nearby path made them tense. “Jin Chan, you fucking idiot! Why would you do that?! You know we can’t eliminate them!”</p>\n<p>“And who do you think you are to reprimand <em> me? </em> Don’t think a leadership that was handed to you simply due to an absence of competitors can give you any power over me, <em> Jin Rulan!” </em></p>\n<p>\n<em> “YOU -” </em>\n</p>\n<p>“BOTH OF YOU! SHUT UP AND MOVE!”</p>\n<p>Lan Jingyi perked up at the last voice, turning to the right. “Is that <em> Zizhen?” </em>Neither he nor Sizhui had ever heard the normally mild mannered boy ever sound so ferocious. </p>\n<p>From the right side of the clearing, a group of disciples broke through, varied in sects. Their eyes widened when they saw Lan Xichen and the others. “Zewu-jun!” Ouyang Zizhen seemed to have abandoned his manners, not even bowing in his panic, but considering the situation, no one could reprimand him. </p>\n<p>Behind him, Jin Ling and Jin Chan, who had been viciously shoving each other even as they ran, froze at the sound of the name. They turned to look at the other party. “Jingyi, Sizhui!” Jin Ling’s voice sounded relieved. “Zewu-jun,” he came to a stop a few meters from the other man, giving a short bow. He turned to address his friends. “I’m so glad that you guys are here. You can’t <em> believe </em>the brainlessness which has been surrounding me for the past few hours.”</p>\n<p>Ouyang Zizhen, indignant, “What am I, chicken liver?”</p>\n<p>“Young Master Jin,” Lan Xichen began, “what appears to be the problem?”</p>\n<p>Jin Ling’s spine straightened, dipping into a salute. “Respect, Zewu-jun,” he replied, “the Ouyang sect and the Jin sect were attempting to liberate multiple spirits at one time, and then <em> someone,” </em>here, he shot a deathly glare at the ruffled Jin Chan, “broke formation.”</p>\n<p>Indeed, they could begin to sense a mass of resentful energy come from the same direction, heading swiftly towards where they were standing. Lan Sizhui looked once again at Jin Ling, taking in his grim look and the dirty robes with concern. Despite the seriousness of the situation, he couldn’t help but be relieved. </p>\n<p>The Jin Ling that they had begun to know over half a year ago would undoubtedly have stayed, even if he had been overwhelmed, and refused help from any who sought to give it to him. To see him now, teaming up with disciples from other sects, retreating when he knew that he was overpowered - it was an overwhelming relief. To think that things were looking so much brighter, despite how bleak everything had seemed at the cusp of the scandal...really, he couldn’t ask for anything more. </p>\n<p>“Jingyi, Sizhui, shield,” Lan Xichen bit out, stepping forward to take charge of the situation. </p>\n<p>The two seniors perked up, hurridly handing Lan Xiyi to one of the junior disicples before moving forward to create a shield around their contingent, and <em> oh fuck, </em> they could see that giant mass of energy coming towards them now, headed by at least a dozen spirits, and Sizhui was going to <em> scream </em>at Jin Ling and Ouyang Zizhen for attempting to pull this shit when they were past this-</p>\n<p>And then, just as everything was beginning to build up, before Lan Xichen could even begin to put to xiao to his lips, before the shield could finish constructing, before the entire mass of resentment was anywhere <em> near </em>them - it all stopped. </p>\n<p>Instead of the gentle melody of <em> Rest, </em>or even a temporary tune of suppression, the sound of a dizi rang out across the clearing, gentle, soft, wandering throughout the hills and valleys. Lan Sizhui knew this song, like it had always been a part of him. Apart from the songs which Xian-gege made for him, this was the only tune which would bring him peace. </p>\n<p>This was his father’s song. This was the song of both his parents. </p>\n<p>He could see the spirits stop in their tracks across the clearing, freezing to stillness at the sound of the music. Absurdly, he thought that he could sympathize. He too, didn’t know if he could move right now. </p>\n<p>Lan Jingyi’s gasp of <em> “Senior Wei!” </em>brought him back into motion. He followed the sound of the tune up a hill, overlooking the clearing they were all standing in, to a lone figure dressed in black, a white ribbon fluttering in the wind behind him. </p>\n<p>Xian-gege didn’t look like he had heard Jingyi, his eyes closed as though he were engulfed in his own melody. Despite himself, despite the distance that stood between them right now, Lan Sizhui felt himself lean into the music, felt it induce a <em> yearning </em>in him, so deep that it felt unfathomable.</p>\n<p><em> Oh father, </em> he thought, <em> is this what you’ve always felt?  </em></p>\n<p>They stayed there for the length of the song, the entire clearing of cultivators, juniors, seniors, distinguished leader silent in the face of a love song, alongside the slowly evaporating mass of spirits. It would almost have been comical, if Lan Sizhui hadn’t been on the verge of tears the whole time. </p>\n<p>The song began to slow down, an oddly reedy quality entering the notes as the player lessened the force of his breath. Any second now, it would end. Lan Sizhui realized, with a strange, sudden longing, that he didn’t want it to. </p>\n<p>As it was, he didn’t get to hear it to its conclusion. Their cultivation trained ears could pick up the sound that cut through it’s dying strains, smothering the melody completely. </p>\n<p>“Wei Ying.” </p>\n<p>Xian-gege stopped abruptly, the last breath of music sharply ending. His eyes opened wide, staring at the ground. Chenqing came to rest at his side. From this distance, Lan Sizhui could almost imagine him taking a deep breath before he slowly turned around to face the figure that none of them could see. </p>\n<p>After a length of time, Wei Wuxian spoke, his voice full of some unmentionable emotion. “Lan Zhan.”</p>\n<p>Within seconds, he had moved out of sight, leaving behind only a slight <em> thud </em> of an impact. Lan Sizhui felt breath that he didn’t even know he was holding release in a <em> whoosh.  </em></p>\n<p>He knew that he was grinning like a madman right now, his eyes glistening with the barest sheen of tears. But at least, he thought, looking around the clearing, he wasn’t the only one. </p>\n<p>As one, the disciples - tired, exhausted, injured, dirty from dust and mud - broke out in raccous cheer and discussion. </p>\n<p> </p>\n<p>19.</p>\n<p>No force in heaven or hell could stop Lan Sizhui from dragging Lan Xiyi to the resting point after that, having been told by a laughing Lan Xichen that that was probably the first place his parents would go to. Perhaps unsurprisingly, Lan Jingyi, Jin Ling and Ouyang Zizhen tagged along. By the time they arrived, neither Lan Wangji nor Wei Wuxian had arrived at the safezone. “The idiot probably got sidetracked by a squirrel,” Sect Leader Jiang snorted when they asked him about their whereabouts. “They’ll be here soon, don’t worry.” He paused to look at them and frowned. “You all look like a mess. Sit down and drink some water for god’s sake.”</p>\n<p>In the relative quiet of the safezone, Lan Sizhui could indeed feel the exhaustion beginning to settle in. Being one of the more senior disciples, all four of them had undertaken a great responsibility throughout the event, organizing and carrying out strategies all the while keeping their juniors safe. It was hard to tell on the battlefield, pumped as they were with adrenaline, but once they were off of it….</p>\n<p>“Ugh, I could sleep for twenty years,” Ouyang Zizhen groaned, rolling his shoulders to work out the muscles which had been tensed for so many hours. He ungracefully sprawled on the ground, yelping as Jin Ling nearly threw a water container on his face. “Hey! Watch where you toss that stuff?”</p>\n<p>Jin Ling raised an eyebrow. “Are you doubting my shooting skills again, Zizhen? Need I remind you who won the last three little competitions we had?”</p>\n<p>Ouyang Zizhen opened his mouth to retaliate, just as Lan Jingyi under his breath, muttered a vulger oath at their argument, causing Lan Sizhui to splutter and color. But before he could truly reprimand the other for using such language, commotion at the west end of the safezone caught their attention. “Is that…” Lan Jingyi trailed off, exchanging looks of disdain with Ouyang Zizhen. </p>\n<p>Jin Ling was much more vocal about his own dislike, having suffered far too many meetings with the rabble-rousers now causing a commotion. “Sect Leader Yao and his son. Both still operating with the same small brain, I don’t doubt.”</p>\n<p>“Jin Ling,” Lan Sizhui scolded, “be nice.”</p>\n<p>Jin Ling, clearly ignoring his words, continued to crane his head to try and see what was happening. “What the hell are they doing?”</p>\n<p>A passing young healer heard his words and came to stop by them. “Sect Leader Yao’s son’s come back all scraped up. Apparently, he tried to take on too many spirits all at once and when they overwhelmed him, he fell into his own traps which he had rigged the ground with.”</p>\n<p>Lan Jingyi cackled. “Sounds like something that cocky idiot would do.” They had always been at odds with each other - Yao Min always thought that Lan Jingyi was far too outspoken for a Lan, while Lan Jingyi thought that Yao Min was always outspoken, considering that he was completely incompetent and mediocre in talent. Everyone knew why the Yao sect had risen in power after their initial eradication by the Wens - and everyone knew that it wasn’t because of their brimming skills and talents. </p>\n<p>“This has gone too far,” Sect Leader Yao was saying as he dragged his son to where the healers were stationed. “Really, this entire venture - this has really gone too far!”</p>\n<p>Next to him, Lan Jingyi felt Lan Sizhui stiffen. He himself tensed at the words. There had been much criticism and discussion when this strange hunt had first been proposed. Despite the fact that everyone had caved at the end, bowing to the power of the GusuLan, to the weight of their own sins and to the expectations of a people who were now far too aware of it, none of them would forget that Sect Leader Yao had, as usual, been among one of the loudest voices. </p>\n<p>Yao Min swayed from where his father held his upright with one arm on his elbow, nearly staggering as his was forced to match the elder’s pace. This close, they could begin to see the twist of his wrist, how his fingers were curled in an unnatural manner. </p>\n<p>Sect Leader Yao was still continuing. “Really, even after everything, to think that they would cause us such trouble and suffering. How unthinkable….”</p>\n<p>“I really don’t think that a couple of broken bones could dream of matching up to what the Wen civilians suffered,” a dry voice spoke from the end of the gathered crowd. Lan Sizhui’s heart leaped, a smile dawning on his face even as the crowd parted with urgency for the two figures who were waiting for it. </p>\n<p>Dressed in opposing colors, standing together like this - Lan Wangji and Wei Wuxian looked every bit like the united front they had always been when it came to such matters. Instantly, Lan Sizhui felt all the tension which had raised in him upon hearing Sect Leader Yao’s criticisms fall through: no matter how it happened, he had no doubt that his parents could take care of things from now on.</p>\n<p>Sect Leader Yao startled at the voice, visibly getting shocked at the sight of the two. Still, proving that for all his stupidity, he had remarkable courage, he gulped down his shock and continued on. “Ah, Hanguang-jun and...uhm...Wei Wuxian. What a surprise, to see you here.”</p>\n<p>The other man gave a cold smile, eyes softening as he looked at the man by his side. “I <em> was </em>invited, you know. It would have been rude to not come.”</p>\n<p>Lan Wangji answered the unasked question. “Wei Ying is the highest authority on resentful energy. To not invite him to such an event would be remiss.”</p>\n<p>Wei Wuxian smiled, “Ah, Hanguang-jun, you truly think of everything! The best, simply just the best…”</p>\n<p>“Hanguang-jun,” Sect Leader Yao interrupted the two before they could go too far in their conversation, “please, look at what has occurred to my son.” He lifted Yao Min’s broken hands with care, ignoring the muted moan the boy let out. “These spirits are far too vicious for disciples this young. Perhaps, if your partner would agree, then isn’t it the best idea to get him to handle them, considering his expertise in the matter?”</p>\n<p>Wei Wuxian’s glare turned glacial. “Sect Leader Yao, how is it that your disciples are the only ones in such conditions while others are facing the spirits well enough? And what’s this about these spirits being “far too vicious?” Just this morning, I was able to liberate an entire group with ease. Are you, perhaps, suggesting that their ire at their fates is undeserved?”</p>\n<p>Wei Wuxian paused, observing the reddening face of the other man before continuing, “Furthermore, asking me alone to carry out a duty that all of us share, is that not too shameful? To ask me to single-handedly save the souls of the Wens from damnation where you once damned me for doing the same, is that not too hypocritical?”</p>\n<p>Seeing the speechless face of the Sect Leader, a Yao sect elder attempted to save them some face from nearby. “Now, Wei Wuxian, isn’t that an over aggressive reaction for a small request? You must know, our leader did not mean any harm.”</p>\n<p>Wei Wuxian pinched the bridge of his nose, looking pained. “Just- just be quiet, all of you.”</p>\n<p>Obediently, they all fell quiet, far too unnerved by the calm words and collected body language of the demonic cultivator. Those who had been there at the banquet all those years ago, when Wei Wuxian had first demanded the location of the Wens, felt an eerie sense of familiarity. </p>\n<p>Then too, he had been collected, quiet, just like this, just before <em> exploding.  </em></p>\n<p>“An over aggressive reaction?” Wei Wuxian murmured under his breath. “A small request?” He huffed a laugh. “To think, even after all this time, you would <em> dare </em>to say that. You people really never learn.” </p>\n<p>Lan Wangji, concerned for his partner’s pain, stepped forward. “Wei Ying…”</p>\n<p>Wei Wuxian looked back at the other with hooded eyes. “Do you remember, Lan Zhan? That path which we just walked right now - there was a group of Wens being chased down it, all those years ago. They were wearing chains around their wrists, all screaming, “Help us!” They were all shot down by arrows,” he recalled slowly, “all but one. A woman, carrying a child.”</p>\n<p>“Jin Zixun stopped his group from chasing her,” Jin Ling perked up at the mention of his relative, even as the sick feeling in his stomach grew, “he did so only to draw an arrow to shoot her down himself.” Here, he paused, looking at Lan Wangji once again. “The only reason he couldn’t do so was because you deflected the arrow yourself, do you remember?”</p>\n<p>Lan Wangjioi looked pained. Still, he gave a short nod. “Mn. I remember.”</p>\n<p>“I asked him back then,” Wei Wuxian continued, “I asked him what those people - elderly, infirm, weak - whether they were also deemed evil, whether they also deserved to die. Do you remember what he said back then?”</p>\n<p>Lan Wangji nodded again. “He said,” here, his eyes flickered to his brother, so fast that no one but his brother could have caught it, “that Sect Leader Jin had commanded that anyone with any connection to the Wen sect was to be killed. He said that Sect Leaders Lan and Nie agreed. And then he asked whether the Jiang sect had any questions.”</p>\n<p>Lan Xichen smothered a moan of agony that fought to escape his mouth.</p>\n<p>“I very nearly killed him there and then,” Wei Wuxian murmured. “Thank god you stopped me, Lan Zhan.”</p>\n<p>Lan Wangji, with concern, “Wei Ying-” </p>\n<p>But Wei Wuxian wasn’t listening, too lost in his own memories. </p>\n<p>“Jin, Lan, and Nie sects agreed. No one else stepped in to help. Even though we were able to play <em> Rest </em>back on that path, how many more did were we not able to help? How many more screams did we not hear?”</p>\n<p>He gazed out below the mountain where the safezone had been established, the high peak providing a good overview of the hunting grounds down below. “Those people,” he began, slow, sure, “died knowing that a world which deemed itself righteous had deemed their deaths as just. That this righteous world had killed their parents, their children, their siblings, without mercy, without reason, without restraint. That no force on earth would protect them from that righteousness.”</p>\n<p>If Wei Wuxian closed his eyes, he could remember that time in Qiongqi Path like it was just yesterday, the despair and fury that had filled him when he looked at Wen Qing hold his friend’s body in her arms and <em> weep. </em>He could remember the insanity that set in when he walked through the gate of the Nightless City and see the bodies of those under his protection swaying in the breeze like rotten fruit. </p>\n<p>He could almost imagine thinking once again, <em> this disgusting world is not worth the effort.  </em></p>\n<p>A soft touch at his arm dragged him out of his thoughts. He looked up once again to see warm eyes gaze at him concern, brow furrowed in such a tiny manner that no one who didn’t know the man next to him would be able to see. The thought that he knew this man well enough, the thought that he was known by him in turn — even in such a desolate conversation, it filled him with joy. </p>\n<p>He gave the other a gentle smile, an unspoken <em> I’m ok, </em> before against facing the crowd gathered around him. He wanted to rage against them — to tell them that they had used him as a weapon once and discarded him when they realized that he had a certain standard for a wielder, that from now on, he would allow no one to wield him but himself. He wanted to ask them, <em> how dare you shy from your responsibility in all this? How dare you not accept the consequences of your actions? </em></p>\n<p>(If there was one thing that Yu Ziyuan had taught him, maybe a bit too well some would say, it was this: you can do whatever you wish, as long as you accept your accountability in those actions at the end of the day, as long as you stand by them and accept their consequences without shrinking.)</p>\n<p>All these thoughts and more whirled in his head, but instead he said, “I should have gathered them at that time and left. I shouldn’t have waited for things to get that bad, for only a handful of civilians to cling to life with little to nothing left in the world. In the path that I have walked, this is my biggest regret.”</p>\n<p>“So, what music I play today, what actions I take today: none of them absolve you of your roles in this massacare. This is my apology to them, and mine alone.”</p>\n<p>With that, the Yiling Laozu turned around and left, taking the same path he took to come up to the safe zone to go back down. The Chief Cultivator followed him, with one last bone-chilling stare to the shame-faced Yao Sect Leader. </p>\n<p>Within moments, Ouyang Zizhen shoved his friends with urgency and set off to follow them as well. Too busy staring down Sect Leader Yao, now slowly recovering and beginning to complain about the “extreme response” he had gotten, Jiang Cheng let his nephew go.</p>\n<p>Nie Huaisang looked down the mountain, spotting the black clad figure making his way down. He looked back up, observing Jiang Cheng get ready to murder a sect leader, first with his eyes and then with a spluttering Zidan. He thought, once more, about monsters and men, and wondered who they were today.</p>\n<p>Maybe one day, he’d be able to answer that question. For now, he settled for ensuring that in all meetings and banquets to come, Sect Leader Yao would have the delightful company of the Chief Cultivator and the Jiang Sect Leader on either side.</p>\n<p> </p>\n<p>20.</p>\n<p>“Wei Ying.”</p>\n<p>Wei Wuxian came to a stop from where he had been descending down the hill with purpose, closing his eyes and taking a deep breath. He turned back around to face the man who called him, offering a small apologetic smile. “Lan Zhan, I’m sorry for losing it like that back then, I-”</p>\n<p>“You were right,” Lan Wangji uncharacteristically interrupted. “For Sect Leader Yao to ask such a thing of you was disrespectful. Your outrage in the matter was justified.” If Wei Wuxian hadn’t said anything, then Lan Wangji would have denied the absurd request himself. </p>\n<p>The other man’s face softened. “Regardless,” he spoke, “I must have made things awkward for you. Sect Leader Yao is someone who many small clans hold in trust.”</p>\n<p>Lan Wangji shook his head. “It doesn’t matter.”</p>\n<p>Wei Wuxian laughed. “Ah, Lan Zhan, you truly would let this patriarch get away with anything, wouldn’t you?”</p>\n<p>Lan Wangji felt his own expression soften as he stepped closer to the other. “Not everything. But in matters like this, Wei Ying is right.”</p>\n<p>Wei Wuxian’s eyes widened, his face reddening at the sincerity in the other’s words. Shuffling backwards as though overhwhelmed by Lan Wangji’s close proximity to him, he looked to the side and attempted to change the subject. “A-ah, Sizhui’s sure gotten good at his swordplay, huh? I was seeing him keep the spirit at bay earlier while the younger ones were using musical cultivation to liberate it! He’s mixing a lot of styles too, it’s really fascinating to see.”</p>\n<p>Sighing, Lan Wangji allowed for the turn in conversation to take place with indulgence. “Mn. He has been studying hard with disciples from other sects. They’ve learnt much from each other.”</p>\n<p>Hearing the hint of pride in the other’s tone, yet again, Wei Wuxian’s grin softened into a smile, no less joyous and sincere. “Ah, it should be expected of Hanguang-jun’s child, to be so great.”</p>\n<p>Rather than being flattered by the compliment, Lan Wangji frowned. “Wei Ying’s child too.”</p>\n<p>Slowly, the joy that existed on Wei Wuxian’s face seeped out, leaving an almost pensive, helpless turn of the lips. “Ah...I suppose.”</p>\n<p>Lan Wangji’s frown became deeper. He stepped closer to the other, grasping at one of the hands hanging losely by his side and holding them in between both his own. “Yours too,” he insisted, “Sizhui is both of ours, Wei Ying.”</p>\n<p>“Hmm, but is he really?” Lan Wangji couldn’t bear to see the sorrow on his face, but Wei Wuxian continued, “I only had him for a handful of years, after all. You did all the heavy-lifting on this one as usual.” </p>\n<p>“That’s not true,” Lan Wangji replied after a moment. “Wei Ying, you were the one who put your all at stake and saved him at first. In this matter, you have carried enough burdens.”</p>\n<p>Wei Wuxian looked stunned at the response. “I….I only had him for such little time..h-he didn’t even know that I existed for a majority of his life, Lan Zhan -”</p>\n<p>“Regardless,” Lan Wangji reach out to grip both his forearms, bringing the other closer to him, “regardless, the bond that both of you cannot be discarded.” He thought back to that day in Yiling when he had first met the child who would come to be so dear to him and the man who had always had his heart. Even back then, malnourished and eagerly eating rich food for the first time in years, A-Yuan had reached out to the other and demanded, “Xian-gege, eat!” </p>\n<p>Only a fool would be blind to the affection which they shared for each other. Lan Wangji’s heart ached at the thought that Wei Wuxian had not been there to help Lan Sizhui through his first sword forms, to teach him calligraphy and talisman-making. But, absurd as it was, one of the thoughts which had helped him live over the years was the idea that, despite only having known him for such little time, despite not sharing his blood, some part of A-Yuan had always retained the essence of the man who had raised him - in his impossible kindness, in his sun-bright smile, in his firm sense of justice, tempered by his own ideals. </p>\n<p>He wanted to tell the man in front of this all this, to tell him how amazing their child always had been, to thank him for saving Lan Sizhui to begin with. Instead, he said, “In every way that mattered, A-Yuan has always been both of ours.”</p>\n<p>Eyes wide, Wei Wuxian looked down slowly at where Lan Wangji’s hands were holding him, shock clear in his expression. Lan Wangji’s ears burned from his boldness, but still, he didn’t let go, continuing to stay close to the other that he could his own reflection shine back through grey eyes. “Do you understand, Wei Ying? Sizhui will agree with me on this matter.” And he would - Lan Sizhui had always been a happy child, delighting in the smallest of pleasures, but there was no mistaking how brightly he had been glowing since Wei Wuxian once again entered his life. </p>\n<p>Mechanically, Wei Wuxian nodded. “Yes,” he whispered, “yes, I understand.” Hesitantly, he broke the grip on his arms. Lan Wangji’s heart fell, only to soar once more as the other put his own around Lan Wangji’s neck, pulling himself closer in an embrace. A wet laugh sounded by his ear. “You’re the best, Lan Zhan. The absolute best, the most good, the most lovely, did you know? There’s no star in the sky which would compare to you; nor any sun, nor any flame - rather, you have always been the brightest of them all. More than the holder of light - rather, like the light itself -”</p>\n<p>Lan Wangji’s precarious control shattered and he lunged forward, completing the embrace, bringing the other close, closer still, almost like he could make them one. </p>\n<p>In his ear, Wei Wuxian continued speaking, voice wavering under the strength of his emotions. They were both trembling, standing up solely through each other’s support. </p>\n<p>“You’re so great; I like you. More than I’ve ever liked anyone. I want to be by your side, want you to be by mine. I want to night hunt with you for the rest of my life.”</p>\n<p>Lan Wangji’s voice interrupted his tirade. “Like you, more than anyone. Want to be by your side, want you by mine. Want to night hunt with you for the rest of my life.” Here, his breath faltered. “Wei Ying...Wei Ying…”</p>\n<p>Wei Wuxian laughed, sudden, joyous. “Yes, yes, it’s me! It’s me, Lan Zhan, good Hanguang-jun, I’m here!”</p>\n<p>“Mn.” Lan Wangji nodded into the crook of the other’s neck. “You’re here.”</p>\n<p>They stood like that, intertwined, trembling, for a long silent minute before Wei Wuxian began again. “Say, Hanguang-jun, will you ever tell me the name of the song? You promised to do so!”</p>\n<p>Lan Wangji smiled. “I made no such promise.” He couldn’t see Wei Wuxian’s face while he was tangled with him like this, but just the imagination of the pout which would accompany the <em> hmph </em>made the smile widen. “But, I will do so anyway.”</p>\n<p>With that, he brought himself close to Wei Wuxian’s ear and that long sought for answer, quietly enough that even Wei Wuxian had to strain his ears to catch it. </p>\n<p>Wei Wuxian fell silent. “Oh, Lan Zhan, ever since then…?”</p>\n<p>Lan Wangji, softly, “Ever since the beginning. Always.”</p>\n<p>Wei Wuxian couldn’t handle it anymore. Hurriedly, he pulled back, putting his hands on the other’s cheeks and holding them gently. He bit his lips in nervousness; seeing how Lan Wangji’s eyes tracked that bite from this distance gave him the courage to go on. Slowly, gently, he brought their faces closer and finally, <em> finally, </em>pressed their lips together in a kiss. </p>\n<p>As far as first kisses went, this was a chaste one. And yet, it still hit Wei Wuxian with all the force of a meteor - he was kissing Lan Wangji. He was <em> kissing Lan Wangji.  </em></p>\n<p>There was nothing like it in the world. Lan Wangji’s lips were soft, the hands which came to cradle Wei Wuxian’s face were hard and calloused from years of hard work, and Lan Wangji was a perfect balance between both those attributes. After several moments of lightly joining their lips together, Wei Wuxian pulled back to press their foreheads together. He whispered against Lan Wangji’s lips, “It’s a wonderful name, Lan Zhan. Oh, I only wish that I knew of it sooner. Maybe then we wouldn’t have spent so long...”</p>\n<p>Maybe then, they wouldn’t have spent so long being wrenched apart. </p>\n<p>But Lan Wangji only shook his head, an action which would have been almost imperceptible if not for the way they were joined. “Here now,” his breath came out in a huff against Wei Wuxian’s skin and caused the other to shiver, “Here now, Wei Ying.”</p>\n<p>Wei Wuxian laughed, pressing one, then two small kisses on the other’s face. “Yes, here, here. Never to be torn apart again.”</p>\n<p>“Never,” Lan Wangji vowed. And then, when Wei Wuxian’s barrage of small pecks did not stop, his last thread of patience snapped. Pushing him against the tree, Lan Wangji undid the red ribbon tied around his wrist with his teeth and used it to tie Wei Wuxian’s wrists together instead. “Yours,” he announced. His hands moved to caress the ends of the white ribbon trailing Wei Wuxian’s hair, face flushing at touching such a strange, intimate part of himself. He didn’t move to remove it and reclaim it upon his own person; rather, he tugged on it to grab the attention of its wearer and declared, “Also yours. Everything that is mine is...”</p>\n<p>Wei Wuxian moved his bound wrists to interlock behind Lan Wangji’s head, pulled it closer to him yet again. “Everything that belongs to you is mine,” he said, “and I, in my entirety, am yours, and in this way, we are both complete.”</p>\n<p>Their kiss turned filthy this time, passion which was more than two decades in the making quickly overpowering chaste affection to swirl into a raging storm. Kissing each other in such a manner, intertwined, one, they both thought that they would never again be apart. </p>\n<p>...which is why Lan Wangji got annoyed when a rustling now nearby dragged his attention, forcing him to step away from the panting, weak-kneed, figure of his partner. His hand on Bichen, he very nearly unleashed the weapon — had Wei Wuxian not stopped him at the last minute. </p>\n<p><em> Really, Sizhui, </em> he thought, amusement seeping in through a haze of pleasure, <em> you should be glad that I’m here to distract him from you. I need to teach you all how to sneak around properly. </em>If Lan Wangji had caught the four figures crouching in the nearby bush, then regardless of their status or family, he surely would have punished them until their arms fell off!</p>\n<p>With the hands tied around Lan Wangji’s neck, he made a quick gesture, an outward flick of his fingers, a signal that he knew his child would pick up on. To his lover he said, “Eyes on me, Hanguang-jun. Don’t look away.”</p>\n<p>Those clever golden eyes stared at him. Lan Wangji said, “Aiding mischief is forbidden in the Cloud Recesses.”</p>\n<p>There were many ways which Wei Wuxian could respond to that statement. He could say that they were not in the Cloud Recesses - that such a rule was then moot. He could point out that, at the end of it all, neither of them cared much about the rules anyway - that they had grown enough to decide for themselves what was wrong and right. </p>\n<p>Instead, with the heat running through his veins, setting him afire from the inside out, he leaned in. Said, “How ever are you going to punish me for that, <em> Lan er-gege?” </em></p>\n<p>Lan Wangji’s answering growl as he leaned in and finally <em> took </em>what was being offered to him — what, in many ways, had always been his, since all those years ago when Wei Wuxian looked at him and spoke, “I desire equivalance,” — was almost loud enough to drown the sound of the bushes rustling once again as four teenagers made a run for it.</p>\n<p><em> A-Yuan, oh A-Yuan, </em> Wei Wuxian thought, <em> never say that I don’t do anything for you.  </em></p>\n<p>And then, he didn’t think anything else for a long, long time. </p>\n<p> </p>\n<p>20.5.</p>\n<p>\n<em> Respected Master Qin, </em>\n</p>\n<p>\n<em> I have heard from valuable and respectable sources, new information on the story that we are trying to convey. I believe that the addition of this new information into the play would prove a fruitful venture indeed - finally ending the one criticism that we had gotten throughout it all, namely that it wasn’t a strong enough conclusion….. </em>\n</p>\n<p>\n<em> ...with respect,  </em>\n</p>\n<p>\n<em> Nie Huaisang, </em>\n</p>\n<p>\n<em> Sect Leader QingheNie. </em>\n</p>\n<p> </p>"
}