{
  "id": "21047438",
  "url": "https://archiveofourown.org/works/21047438?view_full_work=true",
  "author": [
    "HappilyUnconventional34"
  ],
  "title": "Of Badgerfrogs and Dragon Eggs",
  "rating": "Not Rated",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "Avatar: The Last Airbender"
  ],
  "relationships": [
    "The Gaang & Zuko (Avatar)",
    "Iroh & Zuko (Avatar)"
  ],
  "characters": [
    "Zuko (Avatar)",
    "Sokka (Avatar)",
    "Aang (Avatar)",
    "Katara (Avatar)",
    "Toph Beifong",
    "The Gaang (Avatar)",
    "Iroh (Avatar)",
    "Jee (Avatar)",
    "Sun Warriors",
    "Druk (Avatar)",
    "The Wano Crew"
  ],
  "additional_tags": [
    "Wild Animals like to adopt Zuko",
    "Sometimes this works out",
    "Sometimes it doesn't"
  ],
  "language": "English",
  "series": "",
  "published": "2019-10-15",
  "completed": "2020-06-18",
  "words": "13,586",
  "chapters": "3/3",
  "comments": "449",
  "kudos": "10,622",
  "bookmarks": "2,825",
  "hits": "81,413",
  "summary": "<p>Zuko has an unnatural affinity with wild animals. Everyone else suffers because of this. Features badgerfrogs,Dragons and adoption via Sabre Tooth Moose Lions.</p>\n<p>In which General Iroh argues with a Sabre Tooth Moose Lion for custody rights and Jee rethinks the meaning of life. Otherwise known as ‘I invent lore on Sabre Tooth Moose Lions because I can.’</p>\n<p>Takes place when Zuko is 14.</p>",
  "notes": "<p>This was only supposed to be like a 2000 word oneshot not a chaptered fic. I don't know what happened.</p>\n<p>Just a little indulgent fic of Wild animals loving Zuko and everyone around him trying and failing not to find it cute. I have no explanation for this. Blame it on MuffinLance.</p>\n<p>( This takes place after Southern Raiders and before Ember Island Players)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">notes</a>.)\n</p>\n<p>Poor Sokka. A wart on your throatal flap will really turn you against frogs. He stood no chance against Zuko and Froggy’s wholesomeness. Don't ask me how Froggy managed to track Zuko down. Just chalk it up to that love an animal has for it's human.</p>\n<p>Holidays mean freetime. Yay! </p>\n<p>Just a note. Ham Ghao is the name of that really bitchy Sun Warrior who wanted Aang and Zuko to fail.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>And then Zuko found a Phoenix. He tried to name it Sunny but Iroh stepped in. Aang once again drowned in jealousy. Sokka could not be reached for comment.</p>\n<p>-Insert sad sappy AN here-</p>\n<p>Hey everyone.</p>\n<p>I know I've been gone for a while. Things have been pretty terrible on my end. Mental health issues and a few Hospital visits have pretty much taken up my time in the past few months, but even that can't compare to the biggest hit I took. </p>\n<p>I lost my Mom in April to Cancer.</p>\n<p>Even today it still doesn't feel real. I still can't look at any of her pictures without crying. Everything reminds me of her, reminds me that she is gone and I didnt even get a chance to say goodbye. But through the sadness and tears, funnily enough the reviews I would get, the knowledge that people enjoyed what I put out, it was one of the things that helped me. It meant so much to me to see my silly insignifiant little stories could make people happy during this time that is so hard for everyone and I found my will to write again and when I started I couldn’t stop. ^^</p>\n<p>I might sound like a ridiculous sap for saying so , but thank you guys, thank you so much for helping me, for kicking me back into gear. Even if all you were doing was just enjoying a cracky fluffy fic.</p>\n<p>-End Sad sappy AN -</p>\n<p>Now back to the regularly scheduled fluffy humor.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>Mango, at Jee : Who lets a cub run out into a rockslide and get injured!? You fail at parenting! And what’s with that Scar on his face? Let me find out any of you put your hands on my cub-</p>\n<p>Jee: General Iroh, why is she growling at me?<br>-------<br>I really couldn’t end this without including Sokka.</p>\n<p>Jee (and the crew) love Zuko and care about his well being. I don't take constructive criticism.</p>\n<p>That's the end of it. I become quite fond of this universe. I might make it a series and write some oneshots here and there. Especially since you guys have given me some good ideas about assassin stopping turtleducks.</p>",
  "text": "<p>Sokka comes back to the waking world rather slowly, his body protesting the entire way. It had been a hard week with running from the Fire Nation and fighting a war . So it’s a bit of a surprise when Sokka finds himself blearily blinking up at the night sky in blank confusion.</p>\n<p> </p>\n<p>The slight crackling of the dying fire and the warmth of his bedroll do a phenomenal job of leading Sokka back into dreamland . He snuggles deeper into his bedroll, flexing his toes deep into the fluffy and slimy warmth….. </p>\n<p> </p>\n<p>Wait. Slimy?</p>\n<p> </p>\n<p>“Ribbit!”</p>\n<p> </p>\n<p>Sokka shoots up. It takes awhile for his eyes to catch up to his sleep-fogged brain, but when it does the first thing he notices is a pair of large glowing yellow eyes staring back at him from under the front of his bedroll.</p>\n<p> </p>\n<p>His proceeding manly howl is loud enough to wake the dead.</p>\n<p> </p>\n<p>\n<em> (“It was a girly shriek.” Toph will argue later, when she is more awake and thus able to properly insult Sokka. </em>\n</p>\n<p> </p>\n<p>\n<em> “It was a manly howl,Toph”  A sulking Sokka would reply. “I thought being blind made your ears bett- Ahhhh.” </em>\n</p>\n<p> </p>\n<p>\n<em> “Now that was girly shriek.” Sokka would keep his mouth shut after that because Tui and La , did Toph hit hard! ) </em>\n</p>\n<p> </p>\n<p>As it stands, his manly howl is more than enough to wake the entire camp, who in less than five second are up, mobilized, armed and ready to confront the danger attacking their trusted comrade.</p>\n<p>.</p>\n<p>Sokka would take the time to be impressed( and a bit touched) if he wasn’t still hopping from foot to foot and patting frantically at his arms ,trying to rid his clothes of the slimy icky Froggy residue.</p>\n<p> </p>\n<p>“Sokka.” Katara’s water whip gleams in the, her eyes sharp and dangerous and way too alert for someone who was just woken up in the middle of the night.  “What’s wrong?!”</p>\n<p> </p>\n<p>“There’s a frog in my bedroll!” </p>\n<p> </p>\n<p>The immediate silence that follows his statement is judgmental and frankly, quite rude.</p>\n<p> </p>\n<p>“A frog?”  Katara says blankly. Beside her, a wild haired, rumpled Toph stares in his direction incredulously.</p>\n<p> </p>\n<p> “ You woke us up and nearly blew out my eardrums... over a frog?” </p>\n<p> </p>\n<p>“It's a big Frog!” Sokka snaps, indignation making his voice shrill. Could they not see how distraught he was? </p>\n<p> </p>\n<p>Toph stares at him for a moment, then looks towards the boulder she’s levitating. She turns back to Sokka and there’s an oddly… contemplative expression on her face.</p>\n<p> </p>\n<p>“Toph?” </p>\n<p> </p>\n<p>“It would leave too much of a mess.” Is what Sokka thinks he hears( He’s obviously mistaken because Toph would never crush him with a rock...right?) </p>\n<p> </p>\n<p>As it stands, Toph lets her boulder drop with an accusing thud, and stomps back to her bedroll.</p>\n<p> </p>\n<p>Now that the adrenaline of their rather abrupt wake up call has worn off, the rest of the Gaang , confirming that there really wasn’t any real danger( Physically, Sokka’s emotional well-being was definitely in danger at the moment) were all dropping their weapons and shifting into relaxed stances. </p>\n<p> </p>\n<p>“Well, if there’s nothing else.” Aang says, rubbing the back of his neck awkwardly. His eyes shift over to Sokka and Sokka can tell that it’s only Aang’s innate kindness that is currently keeping the monk from laying into him. “Let's all go back to sleep.”</p>\n<p> </p>\n<p>He’s greeted with a chorus of sleepy agreements as Suki, Zuko and Katara start to hobble back to their bedrolls.</p>\n<p> </p>\n<p>Sokka desperately resists calling out to them. His pride battles with his need to avoid all things amphibian in nature, but he had already lost enough face, waking everyone for a frog in his bedroll, he wouldn’t stoop to actually asking them to get the frog out for him. </p>\n<p> </p>\n<p>No matter how big and warty it was.</p>\n<p> </p>\n<p>Just as Sokka was steeling himself up to confront the giant monster frog, a hand came to rest on his shoulder. He looks to see Zuko staring down at him.</p>\n<p> </p>\n<p>“Stand back,” he says gruffly, “I’ll get the frog out of your bedroll.”</p>\n<p> </p>\n<p>“What makes you think I need you to get the frog out of my bedroll.” Sokka sniffs, trying to portray an image of manly bravado. From the look on Zuko’s face,however, something tells him he’s not doing a very good job.</p>\n<p> </p>\n<p>“I don't know. I just got the impression that you don't like frogs very much.”</p>\n<p> </p>\n<p><em> ‘I DON’T!’ </em> is what Sokka desperately wants to say, but he notices that Aang and Katara are watching the exchange curiously. He takes special notice of the glint in Katara’s eyes. He knows that glint. That’s her ‘I'm-going-to-use-this-embarrassing-thing-against-you-when-you least-expect-it’ glint. Sokka would not give her the satisfaction.</p>\n<p> </p>\n<p>“Thanks, but I think I got it covered.”</p>\n<p> </p>\n<p>“Okay.” Zuko moves to head back over to his own bedroll, but a deep, loud, threatening  Ribbit has Sokka making a wild lunge for Zuko’s arm, firmly rooting him in place. There’s a long awkward silence, broken only by Katara’s barely muffled giggles.<br><br></p>\n<p>“Um, It’s a really big frog.” Sokka says weakly. The look Zuko gives him is one of  almost patronizing kindness.</p>\n<p> </p>\n<p>“I’m sure it is, buddy.”</p>\n<p> </p>\n<p>Sokka valiantly ignores his sister and stands off to the side as Zuko carefully approaches the occupied bedroll. He watches with a certain degree of vindication as Zuko’s eyes widen as he pulls open the top of Sokka’s bedroll.</p>\n<p> </p>\n<p>“It’s gigantic isn’t it? The biggest frog you've ever seen?” He says smugly before turning to Aang and Katara, “See? Even Zuko’s shocked. Imagine that. A gigantic monster frog, in your bedroll. That’s what I woke up to so I would appreciate a little bit of sympathy for-“</p>\n<p> </p>\n<p>“It’s you!” Zuko’s shocked exclamation abruptly cuts off the rest of Sokka’s bid for sympathy. As one he, Aang and Katara turn to where Zuko is staring at the inside of Sokka’s bedroll, his eyes shining in delight.</p>\n<p> </p>\n<p>“Uh, Zuko?” Sokka calls. Zuko ignores him.</p>\n<p> </p>\n<p>“What are you doing here, little guy?”</p>\n<p> </p>\n<p>Zuko’s soft tone is out of place for someone currently looking at a giant, monster frog. In fact, it’s more akin to someone looking at their favorite pet.</p>\n<p> </p>\n<p>Zuko shuffles back a bit from Sokka’s bedroll and holds his hands out, palms up.</p>\n<p> </p>\n<p>“Come on.” He beacons softly, “Come on out.”</p>\n<p> </p>\n<p>There’s a happy ribbit from within the confines of Sokka’s bedroll (really how does one discern emotion from a frog? This is what happens when Sokka doesn’t get enough sleep) and suddenly something slimy and gigantic and warty jumps out into Zuko’s open palms. Sokka shudders in utmost revulsion at the wet sound the action produces. That was in his bedroll!</p>\n<p> </p>\n<p>Oogie!</p>\n<p> </p>\n<p>“That is a pretty big badgerfrog.“ Sokka hears Aang whisper, and he doesn't even take the time to bask in his validation, too preoccupied by the strange sight unfolding before him.</p>\n<p> </p>\n<p>“I can't believe it!” Neither can Sokka. Zuko is actually cooing at a  Frog like it was some cute Polar Bear pup instead of a slimy disgusting, hideous monster frog. The Fire Nation was weird.  </p>\n<p> </p>\n<p>“You know this Frog?” Katara asks, as she comes over to stand next to Zuko, Aang in tow. Zuko nods absently, his eyes crinkling in soft fondness.</p>\n<p>        </p>\n<p>“He kept me company at my first  campsite, the one I stayed at before I joined you guys.”</p>\n<p> </p>\n<p>“You mean the one way back near the Western Air temple? “ Aang says, his eyes bulging. “That was miles away, not even factoring in flying on Appa! He followed you all the way from there!?”</p>\n<p> </p>\n<p>“You sure it’s the same badgerfrog?” Katara asks.</p>\n<p> </p>\n<p>“ Yeah,” Zuku says and runs a finger down the Frog’s warty back, “See, I recognize the markings on his back. I can't believe he followed me all the way here.” Zuko raises the Frog to his face, “How did you find me, Froggy?”</p>\n<p> </p>\n<p>“Froggy?” Aang asks with utter delight. </p>\n<p> </p>\n<p>“That’s his name.” Zuko says with an entirely straight face, as if there was nothing out of the ordinary about an angry jerky angsty Banished Prince naming a frog Froggy.</p>\n<p> </p>\n<p>Katara makes a strange sound at that,  almost crossed between a hiccup and giggle. Sokka chooses not to comment on it . Mostly because of the situation at hand. There are so many things he could say about this situation. Such a wealth of material, an endless well of mockery, but Sokka is running off little sleep and post-frog-in-bedroll adrenaline so the best he can come up with is,</p>\n<p> </p>\n<p>“Froggy is a stupid name for a Frog.” Zuko’s shoulders visibly slump.</p>\n<p> </p>\n<p>“Sokka!” Katara says giving Sokka her best disappointed glare.</p>\n<p> </p>\n<p>“Am I wrong?” Sokka waves his arms wildly in Zuko’s direction. “He’s just basically taking what it is and putting a ‘Y’’ at the end of it! It lacks creativity, individualism, intrigue!”</p>\n<p> </p>\n<p>The stare Katara levels at him reeks of ‘I'm-going-to-use-an-embarrassing-thing-against-you.’</p>\n<p>Sokka shrivels before the might of it.</p>\n<p> </p>\n<p>“What?”</p>\n<p> </p>\n<p>“Hawky.” Is all she says. It effectively takes all the wind out of Sokka’s  sails. Leave it to Katara to  expose Sokka’s blatant hypocrisy in the art of animal naming rather than blindly taking his side and backing him up like a good sister should!</p>\n<p> </p>\n<p>“I think Froggy is a perfectly wonderful name for a Frog.” Aang says with a smile. Sokka doesn’t recall Aang giving that reassurance. “And he must really like you if he followed you all the way from the Western Air Temple.”</p>\n<p> </p>\n<p>Zuko’s face lights up and he draws Froggy the BadgerFrog closer to his chest.</p>\n<p> </p>\n<p>“Could you stop cuddling that thing!” Sokka cries because he just can’t take it anymore. Zuko has had the frog pressed against his chest for a solid minute and Sokka skin crawls at the slight slimy residue he can see shining on Zuko’s clothes..</p>\n<p> </p>\n<p>“I'm not cuddling him!” Zuko snaps. He brings the Frog closer to his chest, ironically cuddling it even harder. “Come on Froggy.”</p>\n<p> </p>\n<p>Sokka does like the way Zuko says that. “ What do you mean ‘Come on, Froggy’?’ I hope you mean ‘ Come on Froggy,’ as in  ‘Come on Froggy, let me toss you out into the wilderness where you belong. ‘</p>\n<p> </p>\n<p>“No, why would that be what I meant?”</p>\n<p> </p>\n<p>“Because you’re obviously going to take him far away from the camp and set  him loose so he doesn’t rudely interrupt my precious sleep again.”</p>\n<p> </p>\n<p>Zuko looks scandalized at the very thought.</p>\n<p> </p>\n<p>“I’m not setting Froggy loose.” he says, his brows drawn into a frown. “Especially after all the trouble he went through to find me. He’s staying with us.”</p>\n<p> </p>\n<p>Sokka knew he was gonna say. He knew it, he had seen it coming when he’d started fawning over the frog. And that's why Sokka has a  response ready to go.</p>\n<p> </p>\n<p>“No Zuko. You absolutely are not going to  keep a slimy ugly frog that doesn’t respect personal boundaries at this campsite! Nu-uh, not happening!”</p>\n<p> </p>\n<p>Zuko’s face shifts  into an expression of deep offense. “Froggy isn’t ugly! Don’t say that! You’ll hurt his feelings!”</p>\n<p> </p>\n<p>Sokka couldn’t believe he was having this conversation. If his feet weren’t still covered in Froggy slime he’d think he was still dreaming.                                                                                                                                                                                        </p>\n<p> </p>\n<p>“Zuko, it’s a frog. It has no feelings.”</p>\n<p> </p>\n<p>“Everything has feelings, Sokka.” Aang says sagely, implanting himself into the conversation to impart his airbendery wisdom. “You shouldn’t be so closed minded.”</p>\n<p> </p>\n<p>Sokka is completely unmoved. “I will be when it comes to frogs.” </p>\n<p> </p>\n<p>Zuko cuddles Froggy  the Frog closer to his chest, his eyes glittering with fiery defiance.</p>\n<p> </p>\n<p> “He followed us all this way. I’m not going to abandon him!”</p>\n<p> </p>\n<p>Sokka is forcibly reminded of being in a similar position. Except instead of Zuko, it’s Katara. And instead of a badgerfrog it’s a polar dog bear pup, or a zebra seal, or a penguin, or a tigershark, or an airbender -</p>\n<p> </p>\n<p>Okay, losing focus. Zuko was being too damn stubborn about this frog. He needed outside support.</p>\n<p> </p>\n<p>“Katara back me up! We don't need a slimy frog hopping around,do we? Think of the warts!”</p>\n<p> </p>\n<p>“So that’s what this is about” Katara murmurs with a slight shake of her head. She turns to Zuko and places a comforting hand on his shoulder. “Don't mind Sokka, Zuko.“</p>\n<p> </p>\n<p>“Yeah,” Aang pipes in. He’s looking at Zuko and the Frog with those sappy eyes he wears when he’s looking at something cute. Which was ridiculous because cute, frog and Zuko did not belong in the same sentence. “Sokka just has a thing about Frogs...and warts.” </p>\n<p> </p>\n<p>Now, <em> that </em>sounded strangely accusational. Sokka wouldn’t stand for it. “A WART ON MY THROATAL FLAP AANG!” Aang sighs and Katara rolls her eyes.</p>\n<p> </p>\n<p>“For Tui’s sake- there was nothing there Sokka!”</p>\n<p> </p>\n<p>“I KNOW MY THROATAL FLAP KATARA!”</p>\n<p> </p>\n<p>Zuko looks between Sokka and Katara in abject confusion, before eventually turning to Aang when no explanation is offered. </p>\n<p> </p>\n<p>Aang merely shrugs and waves his hand in the universal gesture of ‘you-don’t-want-to-know’. Thankfully Zuko takes his dismissal in stride and drops it. Instead, he takes a step closer to Sokka, holding up the Frog a little higher. Sokka is treated to  a brief look at large yellow eyes before Zuko is suddenly a good few feet away from him and there’s a tree separating them.</p>\n<p> </p>\n<p>“Wow,” Aang says, clear amazement coloring his tone. “ I don’t think I’ve ever seen you move that fast, Sokka.”</p>\n<p> </p>\n<p>“Keep that thing away from me!!” Sokka yells from behind the safety of his tree.</p>\n<p> </p>\n<p>“Froggy wont hurt you Sokka.” Zuko says in a tone that was meant to be comforting. It was not.  “He’s a good frog. He’s nice and cuddly and he’s a really good listener.”</p>\n<p> </p>\n<p>One of those things did not sound quite right. </p>\n<p> </p>\n<p>“Frogs can't be cuddly, Zuko.” Sokka says, ”And how do you know he's a good listener?” He adds as an afterthought because honestly all things considered, a cuddly frog is a lot stranger than a frog that's a good listener.</p>\n<p> </p>\n<p>“He was my sounding board back at the campsite.” Zuko says, as if that was a natural thing to do. “He actually helped me practice my introductory Speech. Y’know, the one I used when I asked to join you guys.”</p>\n<p> </p>\n<p>That gets everyone’s attention. Katara turns to Zuko slowly, her eyes practically sparkling.</p>\n<p> </p>\n<p>“You practiced that speech...on a frog?”</p>\n<p> </p>\n<p>Her voice cracks at the end. Sokka, shockingly enough, completely understands. Because as much as he wants to deny it, the image of Zuko actually practicing an introductory speech to use on the Gaang, on a frog no less, is so unbelievably dorky it somehow transcends hilarity and settles firmly into adorable territory.   </p>\n<p> </p>\n<p>Sokka feels the intense need to insult Zuko, just to realign the universe.</p>\n<p> </p>\n<p> “Well, if he’s your speech advisor you should  think about firing him cause your introductory speech sucked.” Sokka says with a haughty sniff. Zuko sheepishly rubs the back of his neck.</p>\n<p> </p>\n<p>“Froggy actually thought it was bad too. He hopped away after I tested it on him.”</p>\n<p> </p>\n<p>Huh? Well, Froggy may be ugly and disgusting but at least he wasn’t dumb, Zuko’s speech skill were truly terrible.</p>\n<p> </p>\n<p>“Okay, so the frog at least has good taste, but I still object to him staying.”</p>\n<p> </p>\n<p>“You can't make that decision by yourself!” </p>\n<p> </p>\n<p>“Yeah, but Aang can. Aang, tell Zuko he can't keep that monster frog.”</p>\n<p> </p>\n<p>“Froggy went through so much to find me Aang. Tell Sokka he deserves to stay.”</p>\n<p> </p>\n<p>They both turn to a wide eyed Aang, who looks surprised at his sudden promotion to mediator. He looks at Sokka, then back at the frog, then at Zuko then back at Sokka then finally back to the frog. Sokka knows he’s already lost even before Aang’s eyes soften in the way they normally do before he’s about to cave.</p>\n<p> </p>\n<p>Betrayal! Aang has been turned by the enemy! Sokka should have known this would happen when they let Zuko into the group. To actually use Aang's love of animals to get his way.Katara was right this whole time. Zuko was an evil mastermind sent to infiltrate the Gaang and tear them apart!</p>\n<p> </p>\n<p>“Aaaaangggg,” Sokka says in his best big brother voice. But it is nothing in the wake of Zuko’s rather impressive set of  puppy dog eyes. It wasn’t far. Zuko was a big brother too. Big brothers were not to have puppy dog eyes. </p>\n<p> </p>\n<p>“It’s just a little froggy Sokka.” Aang says and just like that the matter is officially closed. Aang has ruled in Zuko’s favor. The frog is staying.</p>\n<p> </p>\n<p>Sokka tries to be angry. Truly he does, but Zuko’s doing something unfamiliar  with his face that’s currently making it impossible for Sokka to focus on being mad. Something that pulls at his cheeks and makes his eyes light up and ....</p>\n<p> </p>\n<p>Oh, he’s smiling.</p>\n<p> </p>\n<p>Huh.</p>\n<p> </p>\n<p>That’s an unfair thing to do when Sokka is trying to be mad.</p>\n<p> </p>\n<p>“Welcome aboard Froggy.” Zuko says. He brings Froggy the BadgerFrog up to his face and presses it against his cheek . </p>\n<p> </p>\n<p>Okay, now <em> that </em> was just overkill. Sokka couldn’t separate that, no matter how Oogie it was.</p>\n<p> </p>\n<p>Well and truly defeated, Sokka ignores the beaming Aang and cooing Katara and slinks away to his bedroll to lick at his wounds. “Just keep that abomination away from me!” he calls over his shoulder.</p>\n<p> </p>\n<p>“Don’t worry, Sokka. I won't let Froggy anywhere near your throatal flap.” </p>\n<p> </p>\n<p>Zuko says this with such genuine earnesty, Sokka can’t even be mad when Aang and Katara burst into snickers.</p>\n<p>\n<br>\n<br>\n</p>\n<p>\n<span>The servant’s  fervent and fearful whispers are what compels Zuko to stop. The day was young and warm, Agni high and proud in the sky. Zuko had thought a nice stroll was warranted. He had no pressing issues to attend to, so why not take a break? Beside, Papaya, one of the adult turtleducks, was due to birth a clutch soon and Zuko really wanted to check up on her.</span>\n</p>\n<p> </p>\n<p>\n<span>Yet, it was only halfway through his walk that he noticed Dai and Mei, two of the servants that tended the gardens, bundled together in a corner, fear coloring their faces. Zuko doesn’t so much as stop to think as he changes his course and quickly makes his way over to them.</span>\n</p>\n<p> </p>\n<p>\n<span>“Um, Mei, Dai?”</span>\n</p>\n<p> </p>\n<p>\n<span>Zuko barely resists sighing when they jump in that familiar way that  his staff does whenever he directly addresses them. He really does sigh when, in unison, they sink into bows so low their noses nearly brush the ground. Really, they’d talked about this.</span>\n</p>\n<p> </p>\n<p>\n<span>“ Your highness. “ Mei says, “Forgive our idleness. How may we assist you?</span>\n</p>\n<p> </p>\n<p>\n<span>“ Good Morning, I’m not in need of any assistance. I just, um noticed that you both looked a little distressed. Are you okay? Is there something I can help with ?”</span>\n</p>\n<p> </p>\n<p>\n<span>“ Nothing you need to worry about your highness.” Mei said. “It’s just there’s a small disturbance in the garden.” Now that caught Zuko’s attention.</span>\n</p>\n<p> </p>\n<p>\n<span>“ A disturbance in the gardens?” His turtleducks were in the gardens.</span>\n</p>\n<p> </p>\n<p>\n<span>“It’s nothing we can’t handle , your Highness.“ Dai rushes to pacify, “It was just an unusual creature and it took us by surprise.” That made him even more alarmed</span>\n</p>\n<p> </p>\n<p>\n<span>“ Unusual how?”</span>\n</p>\n<p> </p>\n<p>\n<span>“ It was small and slippery. It moved really fast, so we didn’t get a good look but from the slashes we saw along the trail it left behind, it must have some pretty impressive claws. We managed to track it to a nearby bush but when we got close enough it let out the most ferocious growl. We sent Aki to fetch a guard- um your Highness?”</span>\n</p>\n<p> </p>\n<p>\n<span>Zuko walked towards the garden. A guard. There was something dangerous enough in his gardens to warrant a guard. </span>\n</p>\n<p> </p>\n<p>\n<span>Zuko doesn’t pause as Mei and Dai catch up to him, trailing behind him nervously.</span>\n</p>\n<p> </p>\n<p>\n<span>“ Um, your highness,” Dai says, “May I ask where you are going?”</span>\n</p>\n<p> </p>\n<p>\n<span>“ I’m going to confront this creature.”</span>\n</p>\n<p> </p>\n<p>\n<span>Mei and Dai look about ready to pass out at the mere notion.</span>\n</p>\n<p> </p>\n<p>\n<span>“ Your highness, no! I promise we have it under control. You need not concern yourself with these trivial matters!I!” Zuko does not break his stride, waving off Mei’s concern with a flick of his hand.</span>\n</p>\n<p> </p>\n<p>\n<span>“I do when my staff is in danger. Beside my turtleducks are in there. They could be in trouble.” </span>\n</p>\n<p> </p>\n<p>\n<span>“ I honestly fear less for the turtleducks and more for whatever is foolish enough to attack the little menaces- ack!”</span>\n</p>\n<p> </p>\n<p>\n<span>“I’m sorry?” Zuko stops at the Garden’s entrance and turns back to them. Dai is rubbing his arm, his eye fixed firmly on the wall. Mei smiles sweetly at him. She quickly hides her clenched fist behind her back.</span>\n</p>\n<p> </p>\n<p>\n<span>“Nothing your Highness.”</span>\n</p>\n<p> </p>\n<p>\n<span>Shrugging, Zuko silently gestures for them to stay still, cutting off their immediate protests with a sharp glance. He leaves them at the entrance and silently creeps into the garden.</span>\n</p>\n<p> </p>\n<p>\n<span>The first thing Zuko notices is that his usually tranquil garden was not very tranquil. In fact, it sounded like it was in the midst of absolute pandemonium, if only due to the loud angry squawking. Zuko cautiously makes his way over to the pond, his senses on high alert. The pond is completely empty, every turtleduck having forgone their domain to cluster around a nearby tree. If Zuko strains his ears, he can just barely make out a low chattering growl.</span>\n</p>\n<p> </p>\n<p>\n<span>“Whoa guys! What’s wrong?” Zuko is absolutely shocked. His turtleducks have never acted like this before. They look half ready to start climbing the tree. Half of the squawking abruptly stops and suddenly Zuko is swarmed by a fluffy wave of feathers as the younger turtleducks happily crowd around his feet.</span>\n</p>\n<p> </p>\n<p>\n<span>Normally, this would effectively take away all of Zuko’s attention but he can’t help but notice that the adult turtleducks are still squawking at the tree. It would seem they had chased something up there. Taking extra care not to step on any chicks, Zuko walks over to the tree. He immediately notes that the trunk is covered in claw marks.</span>\n</p>\n<p> </p>\n<p>\n<span>“ Everyone settle down.” He soothes as the squawking from the adults grows more frantic at his appearance. He gently tugs his robe from  the beak of Lilac, one of the mother turtleducks, as she attempts to tug him away. Now that he’s closer, he can definitely hear the low growling. However, the nearer he comes the more the ferocity of that growl eases. By the time he’s at the base of the tree the growling has morphed into a low trill.</span>\n</p>\n<p> </p>\n<p>\n<span>Looking up, Zuko only has about a second to register a pair of golden eyes before something is barreling straight for his chest.</span>\n</p>\n<p> </p>\n<p>\n<span>Zuko barely has time to even summon his fire before a small,hard, pointy weight rams into his stomach. He goes down hard in a flurry of limbs, robes, and panicked yelps. </span>\n</p>\n<p> </p>\n<p>\n<span>He hears the outraged squeaks from his turtleduck and the alarmed gasps of Mei and Dai but Zuko only has eyes for the small huddle of purring scales clinging to the front of his robes.</span>\n</p>\n<p> </p>\n<p>\n<span>“Oh no.”</span>\n</p>\n<p> </p>\n<p>\n<span>-----</span>\n</p>\n<p>\n<span>The news of the Fire Lords’ abrupt departure is a hot button topic in the palace by sundown.</span>\n</p>\n<p> </p>\n<p>\n<span>Mei and Dai remain tight-lipped even as Prince Iroh quietly slips in as his nephew's representative with the reasoning that his nephew simply had an urgent matter to attend to.</span>\n</p>\n<p> </p>\n<p>\n<span>“The Fire Lord swore us to secrecy.” Is all Mei and Dai say as they frequently share glances filled with giddy wonder and delight. The other palace servants are near ready to resort to bribery by the end of the day. </span>\n</p>\n<p> </p>\n<p>\n<span>The Fire Lord's eventual return coincides with a surprise visit from the Avatar and company. Mei and Dai’s air of secrecy takes on a smug knowing edge, like there’s an inside joke that only they are a part of. </span>\n</p>\n<p>\n<span>------</span>\n</p>\n<p>\n<span>Aang blinks as he steps into Zuko’s study. The sight before him remains. He blinks again, rubs a fist over his eyes. The spots that enter his vision lets him know that he indeed is not hallucinating.</span>\n</p>\n<p> </p>\n<p>\n<span>That fact does not bring him comfort.</span>\n</p>\n<p> </p>\n<p>\n<span>“Hey Zuko, um, w-w-whatcha got there buddy?”</span>\n</p>\n<p> </p>\n<p>\n<span>“A tea cup.” Zuko is all smiles mixed with an aura of serene tranquility. </span>\n</p>\n<p> </p>\n<p>\n<span>If it was anyone else, that might’ve been an attempt to dodge the question or a sarcastic quip but this is Zuko so Aang dismisses it as a typical literal Zuko answer, because he was indeed holding a teacup, and tries again.</span>\n</p>\n<p> </p>\n<p>\n<span>“I um, actually meant that,” Aang points a finger just beyond Zuko  to where a tiny, red dragon is currently tearing into a tiny tea cake.</span>\n</p>\n<p> </p>\n<p>\n<span>“Oh,” Zuko’s tone is adoring and yet perfectly casual, as if a baby Dragon tearing into a teacake was an everyday occurance, “ This is Druk. He’s my new Dragon.”</span>\n</p>\n<p> </p>\n<p>\n<span>There were a lot of gaps between</span>\n<em>\n<span> ‘this is Druk’</span>\n</em>\n<span> and </span>\n<em>\n<span>‘he’s my new dragon’ </span>\n</em>\n<span>that Aang desperately needed filled.</span>\n</p>\n<p> </p>\n<p>\n<span>Like,</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>‘Where do you find a baby dragon?’</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>‘How did you get the baby dragon here?’</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>‘What is it with you and finding things that have been missing for centuries?’</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>And most importantly,</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>‘Can I hold it?’</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Granted, that last one may not be the most pressing question but it was still pretty important.</span>\n</p>\n<p> </p>\n<p>\n<span>Aang takes a minute to think of the best approach for this situation because while visiting Zuko and discovering that he had a new pet was now a shockingly familiar experience, visiting him to see that he now had a baby dragon was very different from visiting him and seeing he had added yet another pond to the royal garden to hold his growing collection of turtle ducks.</span>\n</p>\n<p> </p>\n<p>\n<span>However, just as Aang settles on the </span>\n<em>\n<span>‘Where and how</span>\n</em>\n<span>’, Sokka choses that very moment to make an appearance.</span>\n</p>\n<p> </p>\n<p>\n<span>“Hey Zuko, I heard you just got back buddy. How was your little vacat -”</span>\n</p>\n<p> </p>\n<p>\n<span>Whatever else Sokka was about to say was completely cut off the second he laid eyes on Zuko or rather Zuko’s newest friend. His easy going smile slowly slides off his face, replaced by a look of abject horror  as he processes what he’s seeing.</span>\n</p>\n<p> </p>\n<p>\n<span>“Zuko... is that a dragon?” Sokka doesn't wait for Zuko to answer him, “Zuko that’s a Dragon. That’s a dragon, Zuko. Why do you have a dragon Zuko? Zuko, where did you get a Dragon?”</span>\n</p>\n<p> </p>\n<p>\n<span>“Sokka,” Aang soothes, because Sokka's face is doing that twitchy thing, “calm down!”</span>\n</p>\n<p> </p>\n<p>\n<span>Sokka turns to Aang, his eyes shining  with such a crazed intensity that Aang actually takes a hasty step back.</span>\n</p>\n<p> </p>\n<p>\n<span>“Aang, that’s a dragon! Aang, why does Zuko have a dragon!?”</span>\n</p>\n<p> </p>\n<p>\n<span>“ His name is Druk.” Zuko says helpfully. Unfortunately, it does not  help in the slightest. If anything this sets Sokka off even  more.</span>\n</p>\n<p> </p>\n<p>\n<span>“ You let him name it?!” He shouts at Aang who puffs up in indignation. </span>\n</p>\n<p> </p>\n<p>\n<span>“ I didn’t let him do anything! He had already named it before I even knew he had it!”</span>\n</p>\n<p> </p>\n<p>\n<span>“Where did he even get a dragon to name?!”</span>\n</p>\n<p> </p>\n<p>\n<span>“That’s what I’ve been trying to figure out!”</span>\n</p>\n<p> </p>\n<p>\n<span>They both turn to Zuko, who stares back at them with an expression of blank puzzlement as if they are the ones who are being weird. Aang approaches Zuko carefully.</span>\n</p>\n<p> </p>\n<p>\n<span>“Hey Zuko, you think you can tell us a little more about your new friend?” Zuko immediately perks up.</span>\n</p>\n<p> </p>\n<p>\n<span>“ He likes tea cakes. “ Zuko says brightly, before his eyes take on a worried glint as he surveys the dragon happily licking the crumbs off the table, “But I’m worried about him having so many sweets. This is the 2nd one. I don’t want them to upset his stomach. I’ll have to contact Chief Ito again just to make sure I’m keeping up with his diet -“ </span>\n<span>\n<br>\n<br>\n</span>\n</p>\n<p>\n<span>“Um,” Aang interjects gently, keeping a wary eye on Sokka, “ I was thinking more along the lines of where you got him from, actually.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Oh, my gardens. The poor thing was chased up a tree by my turtleducks. I still need to figure out what caused them to be so aggressive. I’ve never seen them act  that way. They nearly swarmed me trying to get at him. I was barely able to get him out of the gardens   -”</span>\n</p>\n<p> </p>\n<p>\n<span>Sokka pinches the bridge of his nose. He looks about a step away from tearing his hair out.</span>\n</p>\n<p> </p>\n<p>\n<span>“Zuko, forget about your crazy, possessive army of psycho turtleducks!. Where. did. The. Dragon. Come. From!” Zuko frowns at Sokka in reproach.</span>\n</p>\n<p> </p>\n<p>\n<span>“My turtleducks aren't crazy or possessive.” Aang wasn’t sure about that. He had marks on his ankles that said otherwise. “And his name is not Dragon, it’s Druk.”</span>\n</p>\n<p> </p>\n<p>\n<span>Sokka throws his hands in the air. “Druk then! Where did you get Druk!?”</span>\n</p>\n<p> </p>\n<p>\n<span>“ I told you, I just found him.” </span>\n</p>\n<p> </p>\n<p>\n<span>The silence that follows is broken by the loud smacking of Sokka’s palm meeting his forehead.</span>\n</p>\n<p> </p>\n<p>\n<span>Aang can sympathize. He does not believe that for a second. Coming from personal experience, downplay was the language of Zuko. After all, Aang wouldn’t feel that Zuko was leaving out a significant portion of the story if </span>\n<em>\n<span>‘ I just found him.’</span>\n</em>\n<span> wasnt the exact same answer he had whenever anyone inquired about how he managed to track down the Avatar.</span>\n</p>\n<p> </p>\n<p>\n<span>Luckily, Sokka is of the same mind.</span>\n</p>\n<p> </p>\n<p>\n<span>“You did not just </span>\n<em>\n<span>find</span>\n</em>\n<span> him, Zuko.” Zuko opens his mouth to argue but Sokka swiftly cuts him off. “ No! I refuse. I refuse to believe you just randomly found a Dragon in your gardens. You don’t just find something that hasn't existed for over a century.”</span>\n</p>\n<p> </p>\n<p>\n<span>“But is that  not exactly how we all meet?” Aang just can’t help but point out. The look Sokka gives him is the very essence of dryness.</span>\n</p>\n<p> </p>\n<p>\n<span>“Present company excluded.”</span>\n</p>\n<p> </p>\n<p>\n<span>Zuko considers him for a moment, a contemplative look on his face.</span>\n</p>\n<p> </p>\n<p>\n<span>“ You know you might be right Sokka. I didn’t just find him.” </span>\n</p>\n<p> </p>\n<p>\n<span>“Finally, you’re starting to talk sense-”</span>\n</p>\n<p> </p>\n<p>\n<span>“ He found me.” He shoots Druk a fond smile, to which the dragon responds with a proud trill.</span>\n</p>\n<p> </p>\n<p>\n<span>Sokka’s eye twitches and Aang decides at that point that it’s best for him to do his Avatar thing and start meditating. </span>\n</p>\n<p> </p>\n<p>\n<span>“We need a little more background Zuko. Do you think you can start from the beginning?” </span>\n</p>\n<p> </p>\n<p>\n<span>“Well, it all started when I went for a walk ….”</span>\n</p>\n<p>\n<span>——</span>\n</p>\n<p>\n<span>Chief Ito was a complete loss. He knows he should say something, knows that the stretching silence was unsettling the young man before him, but cannot believe what was happening.He knows his fellow Sun warriors feel the same is their slack-jawed expression are any indication. Ham Ghao looked particularly upset. Ito has never quite seen so many veins on his forehead at once.The only one that doesn’t seem affected by the thick tension was the actual cause of it. The Young Master currently dozing in the Fire Lord’s arm.</span>\n</p>\n<p> </p>\n<p>\n<span>Because the Fire Lord, despite all evidence to the contrary and Ham Ghao’s ...insistent accusation, absolutely did not steal the egg. What  thief would return something that they stole? That and the Fire Lord was too honest on top of being a horrible liar. Chief Ito knew the second the boy had come flying into the inner sanctum with a tiny dragon clinging to his front,his face a mask of distress and babbling about turtleducks and gardens, that he had absolutely no idea the honor that had been bestowed upon him.</span>\n</p>\n<p> </p>\n<p>\n<span>A spirit bond.That was the only thing that could have compelled the Young Master to not only travel to the Fire Lord’s palace but to recognize him on sight.  </span>\n</p>\n<p> </p>\n<p>\n<span>The first Dragon born in over a century had formed a Spirit bond with the Fire Lord. The Fire Lord he’d never seen. The Fire Lord that probably only held his egg for 10 seconds tops. The Fire Lord he’d travelled across an entire nation for.</span>\n</p>\n<p> </p>\n<p>\n<span>Ito frowns.</span>\n</p>\n<p> </p>\n<p>\n<span>30 years.</span>\n</p>\n<p> </p>\n<p>\n<span>For 30 years, Ito had looked after  that precious golden egg. Protected it from all that would see it harmed and cared for it as if it was an actual dragonling. Not once had the egg so much  warmed under his touch. But the Fire Lord holds it for a couple of seconds and the young Master sees fit to not only hatch but to make an entire cross-country journey.</span>\n</p>\n<p> </p>\n<p>\n<span>Chief Ito is not a child and thus is not prone to fits of petty jealousy, but he wouldn’t lie and say that he wasn’t annoyed and a bit bitter by this turn of events. </span>\n</p>\n<p> </p>\n<p>\n<span>If only slightly. </span>\n</p>\n<p> </p>\n<p>\n<span>He’d probably be a little more so if the Fire Lord and the Young Dragon didn’t make such a cute picture.</span>\n</p>\n<p> </p>\n<p>\n<span>“Fire Lord Zuko?” Ito calls. The boy jumps at the sound of his voice and subconsciously tightens his arm around the bundle in his arms. The young master makes a happy sound,  snuggles up deeper into his robes, and butts its tiny head against his chin.</span>\n</p>\n<p> </p>\n<p>\n<span>The young Master is tiny and very affectionate and already firmly attached to the Fire Lord. Ito is an old man, he has a pretty good hold on his emotions, but it is becoming harder and harder by the second not to break into a smile at the admittedly adorable sight of the Young Master trying to bury himself into Fire Lord Zuko’s robe.</span>\n</p>\n<p> </p>\n<p>\n<span>Which makes what he’s about to say a little easier to get out. </span>\n</p>\n<p> </p>\n<p>\n<span>“It would appear that the Young Master has created a Spirit bond with you.”  At the boys blank stare, Ito elaborates. “It has claimed you as a companion, so to speak. In the days of old, dragons would mark humans that they were fond of through Spirit bonds. That is what the young master did to you and why he was able to find you.”</span>\n</p>\n<p>\n<br>\n<br>\n</p>\n<p>\n<span>“But I had never even seen him before. How was he able to mark me?”</span>\n</p>\n<p> </p>\n<p>\n<span>“ I think it may have happened after you picked up his egg on your last visit here.” </span>\n</p>\n<p> </p>\n<p>\n<span>“But it was ages ago, and  I didn't even hold it for that long! How could he have bonded with me that quick!?”</span>\n</p>\n<p> </p>\n<p>\n<span>“I cannot be sure.” Is all Ito can manage  because he honestly has no damn clue himself. This was clearly the work of something far beyond the realm of his understanding. A dormant Dragon egg hatching at a simple touch could only be the work of the Spirits. There was no other explanation. No matter how badly Ito would like to keep the little master, he was not fool enough to interfere in the work of Spirits. </span>\n</p>\n<p> </p>\n<p>\n<span>“Be that as it may, there is no interfering with a Spirit bond. As such the Young Master is now in your care. It is not easy to raise a dragon, so I will need a few days to catch you up on proper care as well as-” </span>\n</p>\n<p> </p>\n<p>\n<span>“No, “ Ito starts as Ham Ghao's heated  voice cuts across his words. His Second is glaring at The Fire Lord with barely contained venom. “I do not accept handing a Dragon over to a member of Sozin’s line!” The Fire Lord tense at that but thankfully remains silent, even as his eyes narrow into a heated glare.</span>\n</p>\n<p> </p>\n<p>\n<span>“The Young Master has chosen the Fire Lord as his Companion, Ham Ghao. “ Ito says, willing the boy to hold his tongue. “We must respect his decision.”</span>\n</p>\n<p> </p>\n<p>\n<span>“ With all due respect, Chief Ito, the Young Master is an infant. He knows not the crimes of the line of Sozin. I propose that we care for the young Master just to ensure he actually makes it past infancy.”</span>\n</p>\n<p> </p>\n<p>\n<span>Fire Lord Zuko’s shoulders slump at that and Chief Ito feels a stab of annoyance at his second’s intolerant attitude. “Ham Ghao, you are out of line. You dishonor the Master’s  wisdom and insult the Fire Lord’s integrity with your accusations. ”</span>\n</p>\n<p> </p>\n<p>\n<span>Ham Ghao does not back down. If anything he pushes harder. “Our job is to protect the Dragons and keep their existence a secret. Do you really believe that the </span>\n<em>\n<span>Fire Lord</span>\n</em>\n<span>-” He spits the word.</span>\n</p>\n<p>\n<span> “Would be able to contain himself  from revealing the secret of the Masters? Do you think he’d forgo the glory?”</span>\n<span>\n<br>\n<br>\n</span>\n</p>\n<p>\n<span>“I don't care about glory!” Fire Lord Zuko snaps, outraged.  “I’ve kept the secret of the Masters and I intend to continue to do so!”</span>\n</p>\n<p> </p>\n<p>\n<span>“And how will you do that if you have a Dragon in your care,hmm?”</span>\n</p>\n<p> </p>\n<p>\n<span>“By lying of course!” Ito notes with some amusement that Ham Ghao is at a loss at how to counter that. Unfortunately, he recovers quick enough.</span>\n</p>\n<p> </p>\n<p>\n<span>“ If you were supposed to have that Dragon, there would have been a sign, some sort of indication from the Masters -”</span>\n</p>\n<p> </p>\n<p>\n<span>His words were cut off by a tiny growl. Ham Ghao’s eyes widen and he takes a hasty step back as the tiny Dragon lunges at him. With his fangs flashing and tail on edge he’s a far cry from the mewling docile dragon of just a few seconds ago. In fact, he looked downright terrifying. Before Ito can even think to intervene a louder, more menacing growl shakes the ground. As one, the Fire Lord and the assembled Sun warriors turn to the cave of the Masters. Shaw’s head peeks out of her cave, her eyes focused squarely on the Fire Lord Zuko. Everyone falls to their knees and  holds their breath, unsure of what to do at one of their Masters’ sudden appearance. Shaw slowly slides her gaze over the assortment of  Sun warriors before landing on a frozen Zuko. She holds his gaze for a few seconds and then tilts her head back, unleashing  a roar that produces a shower of Dragon fire.</span>\n</p>\n<p> </p>\n<p>\n<span>It’s a sign of approval if Ito’s ever seen one. He looks over to Ham Ghao. The man's face is pale, his expression twisted into a mixture of a grimace and a scowl.</span>\n</p>\n<p> </p>\n<p>\n<span>“Well,” Ito says faintly as Shaw retreats back into her cave.  “I do believe that that’s all there is to say on the matter. The young Master has made his choice and one of the Masters has given their approval.”  Ito pins Ham Ghao with a pointed stare, “ Unless of course you still believe there is a mistake.”</span>\n</p>\n<p> </p>\n<p>\n<span>Ham Ghao’s eye twitches, his face twisting into an expression that made him look slightly constipated.</span>\n</p>\n<p> </p>\n<p>\n<span>“No Chief.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Good. Then it's settled. The young Master passes over into Fire Lord Zuko’s guardianship.” </span>\n</p>\n<p> </p>\n<p>\n<span>The Young Master lets out a happy chirp at that. With not another glance their way, he turns back to the shock still Fire Lord and leaps at his chest. Fire lord Zuko’s arms move to cradle him automatically. </span>\n</p>\n<p> </p>\n<p>\n<span>Just as well. Even without Master Ran’s approval, Ito had seen the iron grip the young master had on his new Guardian’s robes and the equally possessive(albeit tender) hold the Fire Lord had on the Dragon. Nothing short of the full force of every Sun warrior present would be able to pry the tiny dragonling from the Fire Lord’s  arms. Ito wouldn’t lie and say he wasn’t apprehensive about the young Master staying with the Fire Lord or the existence of a Dragon being exposed to the world but he trusts the master’s judgement.</span>\n</p>\n<p>\n<br>\n<br>\n</p>\n<p>\n<span>“Soo, he stays with me?” Fire Lord Zuko asks, finally regaining his voice. Ham Ghao’s face twists even more at the hopeful question, but he holds his tongue. The Young Master and  Master Shaw have spoken and he wouldn’t dare go against them.</span>\n</p>\n<p> </p>\n<p>\n<span>“ Yes, young one. The young Master has chosen you as  his guardian.” Ito’s barely bites back a smile when the FireLord eyes literally begin to sparkle. “May you find veneration in your new companion, your highness and through actions may you usher in the new age of Dragons.”</span>\n</p>\n<p> </p>\n<p>\n<span>“ I’ll take care of him, I swear it.” The boy breathes and there’s such fierce conviction in his words,that Ito doesn't doubt for a second that the Fire Lord will be the ideal companion for the Young Master.</span>\n</p>\n<p> </p>\n<p>\n<span>“ I think I’ll name him Scales.”</span>\n</p>\n<p> </p>\n<p>\n<span>Or not.</span>\n</p>\n<p> </p>\n<p>\n<span>“ Scales.” Ito hears Ham Ghao whisper behind him. There’s a hint of genuine terror in his voice. Ito can empathize.</span>\n</p>\n<p> </p>\n<p>\n<span>No. No. No no no.  Ito had been very forgiving when it came to  the line of Sozin’s crimes against the Dragons but every man had a limit. THERE HAD TO BE A LINE!</span>\n</p>\n<p> </p>\n<p>\n<span>“Your Highness, perhaps a more illustrious name is appropriate, all things considered.” Ito says with a touch of desperation because he will not be known as the man who let the Fire Lord name the first dragon born in centuries ‘Scales’.</span>\n</p>\n<p> </p>\n<p>\n<span>“ Oh,” The Fire Lord asks. He strokes the Dragonling’s back, a contemplative look on his face. “You really think so?”</span>\n</p>\n<p> </p>\n<p>\n<span>“Yes.” Ito say a tad too quickly. “May I suggest Druk? It means Thunder Dragon. It’s a proud mighty name. I think it would suit the Young Master quite  well.” </span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>‘Please take the name.’</span>\n</em>\n<span> Ito thinks as Fire Lord Zuko lapses into silence. ‘</span>\n<em>\n<span>Please, Sweet Agni take the name.’’ </span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>“ Eh, “ Their Fire Lord says after a moment of quiet deliberation. ”He looks more like a Scales to me but if it honors his heritage then Druk it is.”</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>‘Thank Agni.’</span>\n</em>\n<span> Ito thinks as the newly named  Druk trills in delight under Fire Lord Zuko’s tender affections. </span>\n</p>\n<p> </p>\n<p>\n<span>And thus Chief Ito  would go down in history as the only person to save one of Zuko’s pets from his horrible naming skills.</span>\n</p>\n<p> </p>\n<p>\n<span>It’s an honor he’d unknowingly wear with pride.</span>\n</p>\n<p>\n<span>-----</span>\n</p>\n<p>\n<span>Sokka has his head in his hands by the time Zuko has finished with his epic tale. Aang can vaguely hear him muttering. He thinks he catches the phrase  </span>\n<em>\n<span>‘Freaky Animal magnet spirit powers’</span>\n</em>\n<span> and </span>\n<em>\n<span>‘conspiracy against his sanity.’ and ‘of course it would be a Dragon’ </span>\n</em>\n<span>somewhere mixed in there.</span>\n</p>\n<p> </p>\n<p>\n<span>“Wait, Aang says,” You mean to tell me that the golden glowy thing in the temple was a dragon egg the whole time?!” At Zuko’s nod, Aang crosses his arms, fuming as he thinks back to the pretty golden orb that he had warned Zuko not to touch. If he hadn’t been so careful he could've had his very own dragon. Dangit.</span>\n</p>\n<p> </p>\n<p>\n<span>As Aang internally fumes Zuko’s boldness, Sokka finally composes himself enough to speak in coherent sentences. </span>\n</p>\n<p> </p>\n<p>\n<span>“This is all your fault, Aang.” </span>\n</p>\n<p> </p>\n<p>\n<span>Aang abruptly snaps out of his funk to stare at Sokka in indignation.</span>\n</p>\n<p>\n<br>\n<br>\n</p>\n<p>\n<span>“How is it my fault?!” </span>\n</p>\n<p> </p>\n<p>\n<span>Sokka scowls at Aang, his hands coming to rest on his hips.</span>\n</p>\n<p> </p>\n<p>\n<span>“</span>\n<em>\n<span>It’s just a little Froggy, Sokka</span>\n</em>\n<span>.” Sokka says in an eerily accurate impression of Aang’s voice. “Remember when you said that? Remember when he found that monster frog at  the Campsite and you said that?You enabled him and now look at where we are!” </span>\n</p>\n<p> </p>\n<p>\n<span>Sokka waves his hands  to where Zuko is happily feeding Druk another tea cake.</span>\n</p>\n<p> </p>\n<p>\n<span>“A Dragon Aang. An actual Dragon.”</span>\n</p>\n<p> </p>\n<p>\n<span>“His name is Druk.” Aang says before Zuko can. He sees Zuko nod approvingly out the corner of his eye. Yes. Cookie points. He could practically feel that tiny dragony weight in his arms. </span>\n</p>\n<p>\n<span>“And how was I supposed to know a frog would escalate to a dragon!?”</span>\n</p>\n<p> </p>\n<p>\n<span>“These things always escalate Aang,” Sokka says darkly, his eyes taking on a haunted edge “One day it’s a baby penguin separated from its herd and then BAM you’re trying desperately not to die as you herd a full grown tiger shark back into the sea.”</span>\n</p>\n<p> </p>\n<p>\n<span>Those scenarios sounded a little too specific. Aang makes a mental note to pull Katara aside later and get the details.</span>\n</p>\n<p> </p>\n<p>\n<span>“I’m not even going to tell you that you can't keep the Dra-Druk.” Sokka quickly corrects as Zuko opens his mouth, “Clearly this has to be the work of some kind of freaky, spirit magic. I mean, one time is a coincidence but twice is a trend. I’m not getting in the way of freaky spirit magic. That being said, I hope you know that taking care of a Dragon is a huge responsibility, young man, and you need to be sure you’re up to it. ”</span>\n</p>\n<p> </p>\n<p>\n<span>Aang wasn’t so sure Sokka was talking to Zuko during that last part. He really needed to grill those details from Katara. </span>\n</p>\n<p> </p>\n<p>\n<span>Zuko for the most part, seemed to be taking Sokka very seriously indeed, if his very serious expression was anything to go by.</span>\n</p>\n<p> </p>\n<p>\n<span> “I’m more than up to it. I told Chief Ito that I was not leaving until I knew all there was to know about Dragon Care. That’s why I was gone for so long, so he could teach me. He even gave me some old scrolls to read through.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Good. Also, I would like the coordinates to the Sun Warrior temple.”</span>\n<span>\n<br>\n</span>\n<span>\n<br>\n</span>\n<span>“Why?”</span>\n</p>\n<p> </p>\n<p>\n<span>“I need to send the Chief a strongly worded letter about Dragon Egg watching.”  Sokka pauses to consider something, “And a thank you note, you know, for stopping you from naming that poor little guy Scales.”</span>\n</p>\n<p> </p>\n<p>\n<span>“What’s wrong with Scales!”</span>\n</p>\n<p>\n<span> </span>\n</p>\n<p>\n<span>“It’s a stupid name Zuko. Scales is a stupid name for a dragon. You can name a frog Froggy but  you can't name a Dragon something lame like Scales! He would’ve been a laughingstock.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Avatar Roku named his dragon Fang,” Aang says, once again showing off his irrational need to defend Zuko’s terrible naming skills. “and he was pretty intimidating.” Sokka stares at the monk in disbelief.</span>\n<span>\n<br>\n<br>\n</span>\n</p>\n<p>\n<span>“Avatar Roku named his dragon Fang?” </span>\n</p>\n<p> </p>\n<p>\n<span>“That’s not a bad name either.” Zuko says with a thoughtful look. Sokka shakes his head in despair.</span>\n</p>\n<p> </p>\n<p>\n<span>“It’s a family thing. It’s got to be a family thing.”</span>\n<span></span>\n<br>\n<br>\n</p>\n<p>\n<span>“There you guys are! Zuko, what is this we’re hearing about a tri - IS THAT A DRAGON!?”</span>\n</p>\n<p> </p>\n<p>\n<span>“His name is Druk.” Aang, Sokka and Zuko say in perfect unison.</span>\n</p>\n<p> </p>\n<p>\n<span>Katara can only blink in helpless confusion. </span>\n</p>\n<p>\n<span>————</span>\n</p>\n<p> </p>\n<p>\n<span>It doesn’t take long for news of Fire Lord Zuko’s newest acquisition to spread across the Fire Nation.</span>\n</p>\n<p> </p>\n<p>\n<span>The general populace could not believe it. To think that a dragon, something believed to be dead for over a century, would suddenly turn up in the Garden of their venerable Fire Lord and claim him as its owner. It was something straight out of a spirit tale. A long dead legend revived! A perilous journey taken to find their one true companions. Was it not the might of Agni’s Chosen? To call forth legend from the dead? It was a sign from Agni himself. A sign that their Fire Lord and their Nation was indeed blessed.</span>\n</p>\n<p> </p>\n<p>\n<span>The tale spreads past the Capital. The story becomes a favored folktale practically overnight. Takao of the colonies eagerly watches his fortune grow with each rendition of </span>\n<em>\n<span>‘The Sacred journey.’ </span>\n</em>\n<span> An original ballad composed of the heart-wrenching journey of the last dragon seeking his treasured Fire Lord.</span>\n</p>\n<p> </p>\n<p>\n<span>“ I tell ya Lee,the Fire Lord is a magnet for legends straight outta spirit tales .” Takeo chirps to his friend as they stroll through the market. He doesn’t notice a nearby figure in blue immediately tense up. “He found the Avatar. He found a Dragon. Who knows? Maybe the next thing he’ll find will be a phoenix.”</span>\n</p>\n<p> </p>\n<p>\n<span>“ Sokka, no!”</span>\n</p>\n<p> </p>\n<p>\n<span>There is a slight commotion to his left and then Takao is on the ground, an angry blue blur looming over him.</span>\n</p>\n<p> </p>\n<p>\n<span>“ You don’t know what you’ve done! You’ve doomed us all. If you say things like that it might just come true! Take it back! Take it back!” The bard is too shocked to even speak as he’s violently shaken back and forth.</span>\n</p>\n<p> </p>\n<p>\n<span>“ Sokka, let him go!”</span>\n</p>\n<p> </p>\n<p>\n<span>“ Not until he takes it back! I’m putting my foot down Katara. He will NOT find a phoenix. I will not allow it!”</span>\n</p>\n<p> </p>\n<p>\n<span>It takes the effort of Lee and two girls;one that bears a striking resemblance to the crazed lunatic, and one that looks to be blind; to get the boy off of Takao. He’s helped to feet by a hand covered in the tattoos of an airbending Master. Takao can only stand there stiffly as the Avatar himself bows low in apology.</span>\n</p>\n<p> </p>\n<p>\n<span>“I’m so sorry. It’s been a long week.”</span>\n</p>\n<p> </p>\n<p>\n<span>And without another word he joins the two girls in dragging away their companion.</span>\n</p>\n<p> </p>\n<p>\n<span>It seemed like the Fire Lord didn’t actually have to be present. Just his name alone could call forth legends.</span>\n</p>\n<p> </p>\n<p>\n<span>Takao starts composing his next ballad that very night.</span>\n</p>\n<p> </p>\n<p>\n<span>He titles it </span>\n<em>\n<span>“The Fire Lord and the Phoenix”</span>\n</em>\n<span> and puts it aside for later. </span>\n</p>\n<p> </p>\n<p>\n<span>Just in case.</span>\n</p>\n<p>Jee is sure that later, when he has time to process what is currently happening , he would still never quite understand how things had progressed to this point.</p>\n<p> </p>\n<p>“<em> Not too close. Not too close.” </em></p>\n<p> </p>\n<p>\n<em> “AHHH! IT ALMOST TOOK MY ARM OFF!” </em>\n</p>\n<p> </p>\n<p>\n<em> “Stop yelling! You'll make it angrier, you idiot!” </em>\n</p>\n<p> </p>\n<p>And yet here he was.</p>\n<p> </p>\n<p>“<em> Wave the meat at it again Jin. Hurry.” </em></p>\n<p> </p>\n<p><em> “It’s not going for the damn meat. Haku.” </em> <em><br></em> <em><br></em> <em> “Well try using your arm again. It seemed to like that.” </em></p>\n<p> </p>\n<p>\n<em> “Oh, Fuck you-” </em>\n</p>\n<p> </p>\n<p>It was supposed to be a simple scouting mission. Why had it not been a simple scouting mission?</p>\n<p> </p>\n<p>The ground rumbles threateningly. All conversation ceases as the Sabre Tooth Moose Lion rises from its  tense crouch, kicking up dust and pebbles as it stomps angrily It’s beady black eyes glare at the assembled group menacingly. It bears its teeth, a low snarl rising deep from its throat…</p>\n<p> </p>\n<p>Jin drops the slab of  meat and he, Haku and the handful of other crewmates huddled a bit further back, scramble to put some space between them and the Moose Lion.</p>\n<p> </p>\n<p>Some of them trip. Some of them trip over each other.</p>\n<p> </p>\n<p>Jee barely resists the urge to bury his face into his hands.</p>\n<p> </p>\n<p>Agni, they were making complete fools of themselves.</p>\n<p> </p>\n<p>In hindsight, he really couldn’t blame them, neither the crew nor Jee were adequately prepared to deal with such an….. unprecedented situation.</p>\n<p> </p>\n<p>But the world works in mysterious ways when you follow a banished Prince chasing after a spirit tale.</p>\n<p> </p>\n<p>Satisfied with the distance, the great hulking beast lowers back into her defensive crouch, careful not to crush the unconscious Prince she so fiercely guarded. The very same Prince they’d been trying to retrieve for the last hour.</p>\n<p> </p>\n<p>And throughout it all, the Prince slept on, completely unaware of his precarious predicament.</p>\n<p><br>That in itself was more worrying. It had been a good while since the Prince was knocked out and the cut on his head was still bleeding sluggishly. They needed to retrieve him so they could treat his head injury before it got worse.</p>\n<p> </p>\n<p>Jee turns to the huddled group of trembling  sailors who’d taken solace behind him.</p>\n<p> </p>\n<p>“What are you doing!? Get back in there and retrieve your Prince!”<br><br>“Sir!” Jin squeaks, “ That thing almost took my arm off!”</p>\n<p> </p>\n<p>Don't get angry, Jee. Be comforting. It improves morale.</p>\n<p> </p>\n<p>“No it didn't,” Jee snaps,  “ That was a warning nip at best. If it really wanted your arm, you wouldn’t have it anymore!”</p>\n<p> </p>\n<p>Considering the fact that Jin’s face goes 4 shades paler, Jee would hazard that that fact wasn’t very comforting at all.</p>\n<p> </p>\n<p>Coward. His men were a bunch of cowards.General Iroh could never know what happened here. They’d never live down the shame.</p>\n<p> </p>\n<p>“Stop sniveling boy! So what if it takes your arm. Are you not a loyal citizen of the Fire Nation! It is your duty, your privilege, to risk life and limb for the Royal Family!”</p>\n<p> </p>\n<p>“But it’s scary!” Haku wails. The man looks as if he would actually start crying.</p>\n<p> </p>\n<p> Indeed, the beast  was scary  with her razor sharp tusks and colossal paws. She had yet to grow to her full size, but that just made her even more lethal. There was nothing more dangerous than an adolescent Sabre Tooth Moose Lion. </p>\n<p> </p>\n<p>Still, Jee wasn’t moved, mainly because there was indeed reason to fear for their lives, but it was not because of the Beast before them.</p>\n<p> </p>\n<p>“I can guarantee you that there are far scarier things than a temperamental Moose Lion, mainly an elderly General that was once the Dragon of the West.” Jee feels a very grim satisfaction at the way the men pale. Good. They should be afraid. Jee sure as hell was. “ Do any of you fancy explaining to General Iroh why we allowed his nephew to be ensnared by  a vicious beast?”</p>\n<p> </p>\n<p>“No sir.” the men say, suddenly looking a lot more  motivated. </p>\n<p> </p>\n<p>That was good. If they could just get the Prince they could probably salvage this situation. Explain away his injury as something else and make sure that General Iroh never knew what happened-</p>\n<p> </p>\n<p>“Well, that is indeed good to hear, for I assure you that no explanation you could give me would be satisfactory.”</p>\n<p> </p>\n<p>Jee doesn’t scream, because he’s better than that. His men, unfortunately, are not.</p>\n<p> </p>\n<p>“GENERAL IROH!?” Jee wants to cry, did they have to sound so pathetically shrill?</p>\n<p> </p>\n<p>General Iroh’s answering smile is all teeth.</p>\n<p> </p>\n<p>“Yes, General Iroh.”</p>\n<p> </p>\n<p>Angi preserve him, Jee would hazard he’d just lost a good ten years off his life at the General's tone alone. </p>\n<p> </p>\n<p>“General Iroh,” Jee was not shaking, he was not! “ Sir, I thought you were going to wait on the ship.”</p>\n<p> </p>\n<p>General Iroh regards him coolly and Jee loses an additional 5 years.</p>\n<p> </p>\n<p>“ I was. But then I heard the sounds of a rockslide and I grew worried. It is indeed fortunate that I  chose to track you down.” General Iroh surveys the scene with a solemn gaze. “Yes, a good thing indeed, because not only did you not send someone to inform me, immediately, that my nephew was in danger, but from what I just heard it also sounded like I would have never known about this incident otherwise. I would hope that you weren’t intending to lie to me about what happened here, Lt. Jee.”</p>\n<p> </p>\n<p>“O-o-o-o-of course not sir.”</p>\n<p> </p>\n<p>“Truly? Well in that case, would you care to tell me why my bloody and unconscious nephew is being held hostage by a Sabre Tooth Moose Lion or  am I just to infer that your guardianship abilities are so horrendous you could allow such an unbelievable oversight to occur?” </p>\n<p> </p>\n<p>Sweet Agni, Jee was going to die. He was going to die either by shame or Dragonfire. And he’d deserve it.  He was a failure, a disgrace….</p>\n<p> </p>\n<p>“Now, would be an appropriate time to tell me, Lieutenant.” Jee can't hold back a flinch at that.</p>\n<p> </p>\n<p>“Well sir, let me assure you that the Prince currently isn’t in any danger.”</p>\n<p> </p>\n<p>General Iroh raises a brow at that, and Jee sees his life flash before his eyes.</p>\n<p> </p>\n<p>“I’m curious to know what you define as <b> <em>danger</em> </b>, Lt. Jee.”</p>\n<p> </p>\n<p> “I understand your scepticism but, it’s really not what you think, sir.”</p>\n<p> </p>\n<p>“Oh? What is it then?” Jee swallows. He throws a quick look at his useless crew before turning back to the General’s feet because looking him in the eye was currently impossible.</p>\n<p> </p>\n<p>“It’s like this-”</p>\n<p align=\"center\">000000000000000000000</p>\n<p>\n<br>\n<br>\n</p>\n<p>“Hurry up!” Prince Zuko snapped for what was surely the 100th time. Jee barely resists snapping back at the little brat, the tremulous task of not slipping down the narrow mountain path doing much to hold his tongue. The mountain rumbles ominously with each step they take, fine tremors shaking the small foundation beneath their feet. </p>\n<p> </p>\n<p>Jee bits back a curse as he loses his footing once again. He barely managed to snag hold of a tree branch, saving himself from a rather nasty tumble. Behind him, he hears a few of the men in their tiny search party grumble mutinously.</p>\n<p> </p>\n<p>He can't blame them. The Prince had been absolutely unbearable( well, more so than usual)  since he’d gotten a tip at the last  outpost that could lead him to a spot the Avatar was said to have frequented. He’d damn broken the engine in his rush to get to the tiny Island, and had hopped off the boat before they had the chance to even properly dock, yelling for the entire crew to comb the Island.</p>\n<p> </p>\n<p>It had only been the timely interference of General Iroh that had  halted the Princes’ frenzied  charge.</p>\n<p> </p>\n<p>“A search party seems more prudent.” The General had said, because he was old and wise and should really be leading them instead. “Less of a waste of time and resources, wouldn’t you agree, my nephew?”</p>\n<p> </p>\n<p>And thus the Prince had assembled a small group of men, which included Jee because the Spirits hated him, to map out a course for more in-depth exploration.</p>\n<p> </p>\n<p>Which landed them on this damn mountain covered in rocks and misery.</p>\n<p> </p>\n<p>Another tremor shakes the mountain, dislodging a few rocks. Jee hears Haku  yelp behind him, followed by the sound of rocks crumbling and decides enough is enough. They need to get off this damn mountain.</p>\n<p> </p>\n<p>“My Prince, perhaps we should -” But the Prince shushes him with a harsh hand wave.<br><br></p>\n<p>“Shut up!” He hissed and Jee’s hackles raised. Disrespectful little-</p>\n<p> </p>\n<p>However, before Jee could finish puffing up in anger, Prince Zuko pointed down towards an adjacent path.</p>\n<p> </p>\n<p>“Look.” Jee begrudgingly followed his hand and felt his stomach drop.</p>\n<p> </p>\n<p>Further down the path, was a raging  Sabre Tooth Moose Lion. Jee’s brain temporarily forgets how to work as he takes in the beast’s giant frame and razor sharp tusks gleaming in the sunlight. There are a few things that the Earth Kingdom has to offer that can truly frighten him, and one of those things were Sabre Tooth Moose Lions. Extremely Dangerous and highly temperamental, Jee had heard horror stories about the beasts from some of his friends from the colonies. He would sooner take on a battalion of Earth Kingdom soldiers than wrestle with a Sabre Tooth Moose Lion.</p>\n<p> </p>\n<p>His palms were already heating when he saw that the beast had not noticed them. In fact, Jee would doubt it would notice anything , what with it’s attention being solely focused on the giant boulder pinning its paw to ground. Jee watches as the beast struggles against the weight , it’s struggles growing more and more frantic as it slams it body against the cliffside.. </p>\n<p> </p>\n<p>At least he knew what the source of the tremors were. </p>\n<p> </p>\n<p>“We should double back.Now.”</p>\n<p> </p>\n<p>“Wait! “ Jee turned back  and saw that the Prince was staring at him in outraged disbelief. “We can't leave it.”</p>\n<p> </p>\n<p>“Wha- yes we can.”</p>\n<p> </p>\n<p>“But it’s trapped!”<br><br></p>\n<p>Jee failed to see why the Prince phrased that as if it was a bad thing. “Well, that’s good for us then. Less chance of getting maimed. Now, let's double back and get as far away from that beast as  physically possible.”</p>\n<p> </p>\n<p>“I’m not leaving it there.” Prince Zuko growled and the only thing that stops Jee from strangling the boy is the fact that assaulting Royalty is a crime worthy of imprisonment. </p>\n<p> </p>\n<p>“Prince Zuko,” Jee said slowly, calmly, “ that is not a badgerfox kit with its paw stuck in a snare trap. It is a vicious monster that can snap your spine with a single click of its jaws. You ARE NOT going to get near it. We ARE going to double back, and you WILL return to the ship UNMAIMED.”<br><br>Prince Zuko’s looks like he’s rearing up for an epic tantrum, one Jee is ready to smack down, but any retort he can give is cut off as the Moose Lion lets out a thunderous roar. Heart thumping, Jee whips around to where the Moose Lion is still attempting to dislodge it’s foot. The beast has apparently grown desperate and is thrashing wildly, it’s great hulking mass slamming into the side of the mountain. The mountain lets lose a very ominous rumble, followed by a terrifying crack.</p>\n<p> </p>\n<p>Jee has about five seconds to register why that is not a good thing, before his hands find Prince Zuko’s wrist. The boy lets out an indignant squawk as Jee slams him against the cliffside, before pressing his own body as close to the side as he can.</p>\n<p> </p>\n<p>“PRESS AS CLOSE TO CLIFFSIDE AS YOU CAN!” he yelled at the rest of the party, “NOW!”</p>\n<p> </p>\n<p>Another slam against the mountain, a louder rumble and suddenly an avalanche of rocks are raining down the mountainside.</p>\n<p> </p>\n<p><em> ‘I don't get paid enough for this.’  </em>Is Jee's only thought as rocks the size of small houses fell  mere inches in front of him. He can barely hear his own heart beat or the panicked yells of his men of the thunderous crash of rocks against earth.</p>\n<p> </p>\n<p>“Oh no!” If Jee wasn’t so familiar with his Prince’s voice, he might've thought that horrified whisper came from someone else. He feels an unhealthy  amount of vindication at the Prince’s fear.</p>\n<p> </p>\n<p>\n<em> ‘Yes, this is what happens when you charge in head first, you little brat!’ </em>\n</p>\n<p> </p>\n<p>But when he looks over at  Prince Zuko he sees that the boy isn’t looking at the rocks. No, he’s looking at the Moose Lion! The Beast's furious roars have been replaced by loud high pitched yelps of fear and Jee would almost feel sorry for it… if it hadn't caused the avalanche in the first place.</p>\n<p> </p>\n<p>Jee is more concerned with the safety and survival of his Prince and crew, which is why he has a miniature heart attack when Prince Zuko suddenly surges forward. Jee just barely manages to snatch onto his arm, pinning the suicidal idiot in place.</p>\n<p> </p>\n<p>“WHAT ARE YOU DOING!?” </p>\n<p> </p>\n<p>“It’s stuck!” The Prince yelled back, fighting against Jee’s  ironclad hold on his arm. ”We have to help it! It’ll be killed!”</p>\n<p> </p>\n<p>What in Agni’s name was this child on!? “<b> <em>You’ll</em> </b> be killed! Stay put-”</p>\n<p> </p>\n<p>But the Prince is done listening. Before Jee even has a chance to register what is happening, the Prince breaks out of his hold and barrels down the mountain path at top speed, weaving through the rockslide. Jee curses viciously and presses back into the path’s wall unable to do anything else.</p>\n<p> </p>\n<p>The Moose Lion roars as it spots Zuko approaching, it tusks flashing menacingly, but the Prince pays it no mind. He nimbly dodges a tumbling boulder, and without even pausing to think, brings his leg down in a mighty kick, effectively breaking the large rock trapping it’s paw into tiny pieces.</p>\n<p> </p>\n<p>“Holy <em> shit </em>.” Jee hears Jin whispers. Jee would echo the sentiment, if he wasn’t worried out of his mind.</p>\n<p> </p>\n<p>“Prince Zuko!” Jee can barely hear himself over the rumbling. “ TAKE COVER!”</p>\n<p> </p>\n<p>But his warning has the opposite effect. Distracted by his yell, Prince Zuko, who’d been focusing on dodging boulders now that the beast was freed, abruptly loses his concentration and takes a well sized rock to the temple. Jee can only watch in horror as the Prince goes down, hard.</p>\n<p> </p>\n<p>“PRINCE ZUKO!” Jee is dimly aware of the rest of the men letting out loud dismayed  exclamations, but he barely registers it. All he could see was his Prince, lying motionless on the ground, helpless in the middle of a rock avalanche and at the mercy of a vicious beast.</p>\n<p> </p>\n<p>TIme loses its meaning. The rocks are  not letting up and Jee can not get to his Prince and the men are still screaming, and the mountain is still shaking and the beast is looming over Prince Zuko and the boy is no longer on the ground but clutched between lethal jaws and  the beast is running, dodging the rocks and disappearing through the trees and Jee could only blink at the retreating beast, his body immobilized by horrified disbelief.</p>\n<p> </p>\n<p>When Jee comes back to himself, the mountain is once again calm, the Prince is still gone and Jin is pulling at his arm, his face a mask of panic.</p>\n<p> </p>\n<p>“Sir, the Prince was taken by that Beast!”</p>\n<p> </p>\n<p>“WHAT DO WE DO!?”</p>\n<p> </p>\n<p>“DO MOOSE LIONS EAT HUMANS?”<br><br></p>\n<p>“OH SHIT! WHO'S GOING TO TELL THE GENERAL!?”</p>\n<p>“NOT ME!”<br><br>“SILENCE!”</p>\n<p> </p>\n<p>The men instantly quiet under Jee’s fierce glare. </p>\n<p> </p>\n<p>“Panicking is not going to get the Prince back. Moose Lions usually take their prey back to their den. If we want to save him we need to move NOW. Pull yourselves together and follow me.”</p>\n<p> </p>\n<p>It is not hard to track the beast, thanks to its huge footprints. As they follow the trail, Jee internally fumes, torn between worry and rage.  They're gonna track down the Moose Lion, retrieve their Prince and when they got back to the ship he was going to tear that IDIOT CHILD a new one, Prince or not!</p>\n<p> </p>\n<p>--------</p>\n<p> </p>\n<p>Jee doesn’t know what he expects when they finally arrive at the Moose Lion den. Part of him thinks (hopes) the prince has regained consciousness and found a way to escape. Another part of him is terrified  that he’ll find the Prince, but he won't find him alive.</p>\n<p> </p>\n<p>“Sir,” Haku’s low whisper  breaks Jee out of his morbid thoughts. “Look.”</p>\n<p> </p>\n<p>Jee follows the other finger and nearly jumps as he spots the Moose Lion, pacing in front of its den, and just beyond its massive frame, pale and unmoving,  is…..</p>\n<p> </p>\n<p>“Prince Zuko!”</p>\n<p> </p>\n<p>Unfortunately, Jee severely underestimates the Beast’s  hearing. He barely refrains from squeaking in fear alongside his men as the Moose Lion’s head swivels in his direction.</p>\n<p> </p>\n<p>Jee feels like he is rooted to the ground, as those beady black eyes bore into his and that lethal mouth shifts into a threatening snarl.  He doesn’t move, doesn't even dare to breathe, least he angers the beast and seals the fate of the unconscious boy at its feet.</p>\n<p> </p>\n<p>The tense stand-off seemed to go on forever, until in a move that contributed to the  emergence of at least 50 new gray hairs, the Moose Lion broke eye contact  with Jee and lowered its  head down. No one dared make a sound as the beast gently pressed its snout against Prince Zuko’s cheek.</p>\n<p> </p>\n<p>It took  everything that Jee had not to lash out at the beast and drown it in fire. The little brat may get on his nerves but he was still his Prince and he was still a child. No self-respecting adult could watch a child get mauled by a beast and not want to save them.</p>\n<p> </p>\n<p>But, as it turns out, the Moose Lion had no intention of mauling the Prince. Nope,  no intention at all, if the way it was lovingly nuzzling his temple was any indication.</p>\n<p> </p>\n<p>Jee couldn't tear his eyes away from the tender display. </p>\n<p> </p>\n<p>Was the …. beast friendly? Was he wrong in his assessments? Could the violent, volatile nature the world associates with the creatures be false? Was everything he thought he knew about Sabre Tooth Moose Lions a lie?</p>\n<p> </p>\n<p>Jee hesitantly takes a step forward….only to immediately retreat several paces when the Moose Lion lets out a ground-shattering roar.</p>\n<p> </p>\n<p>Nope, not a lie then.</p>\n<p> </p>\n<p>The Moose Lion glowers at him for a few more seconds before happily returning to nuzzling Prince Zuko’s cheek with a gentleness that one would only show their own offspring.</p>\n<p> </p>\n<p>“What is happening?” Haku whimpers as Jee stumbles away from the shelter of the trees.</p>\n<p> </p>\n<p>“I think a Sabre Tooth Moose Lion just abducted our Prince.”</p>\n<p> </p>\n<p align=\"center\">0000000000000000</p>\n<p>\n<br>\n<br>\n</p>\n<p>“.....And we’ve been trying to get him back ever since.”</p>\n<p> </p>\n<p>To his credit, General Iroh doesn’t immediately drown Jee in Dragonfire for relaying such a ridiculous tale. Honestly, if Jee hadn’t lived it, he wouldn’t believe the story either. He still kinda doesn’t.</p>\n<p> </p>\n<p>“You mean to tell me that a Sabre Tooth Moose Lion has adopted my nephew?”</p>\n<p> </p>\n<p>Jee can only shrug helplessly.</p>\n<p> </p>\n<p>“Yes sir. Like I said, the beast doesn't want to hurt him.  She just….doesn’t seem to want to give him back and every attempt to retrieve him just seems to agitate her.”</p>\n<p> </p>\n<p>As if in response to his words, the Moose Lion paws angrily  at the ground once more, causing an assortment of tremors  to shake the earth. Then, with a contradictory amount of gentleness, it carefully lays a mighty paw on their Prince’s chest. It keeps its glare on them the entire time. </p>\n<p> </p>\n<p>General Iroh’s brow disappears behind his hairline.</p>\n<p> </p>\n<p>“I…..see.”  It takes everything in Jee not to start fidgeting like a new cadet as the General lapses into silence. He can practically see his credibility as a competent leader going up in flames.</p>\n<p> </p>\n<p>“That’s it! Let’s just set the damn beast on fire and be done with it!.”</p>\n<p> </p>\n<p>Apparently literally.</p>\n<p> </p>\n<p>“ Yuji, please explain to me why you think it’s a good idea to flame the Sabre Tooth Moose Lion that is currently holding our prince hostage. It can't be because you might agitate the beast who would in turn trample the Prince and attack us. OR because you might accidentally hit the Prince.”</p>\n<p> </p>\n<p>All of Yuji’s bravado abruptly disappears in the wake of Jee’s scathing glare.</p>\n<p> </p>\n<p>“I-um-I-”</p>\n<p> </p>\n<p>“I assure you gentlemen, there need not be any idiotic acts of violence. Allow me to handle this.”</p>\n<p> </p>\n<p>“Sir?” General Iroh merely smiles at him. This time it’s more reassuring than terrifying.</p>\n<p> </p>\n<p>“I believe this is  all just a misunderstanding as well as a…. difference in opinion.”</p>\n<p> </p>\n<p>Before Jee can ask what he means. General Iroh  is breaking away from their group and walking purposely toward the Moose Lion’s den. It’s such an unexpected move Jee doesn’t register it until the General is mere inches away from the Moose Lion.</p>\n<p> </p>\n<p>“What is he doing?!” Jin whispers, terrified. “ Why is he just walking up to it?”</p>\n<p> </p>\n<p>Jee doesn’t answer. He’s too busy tearing at his hair.</p>\n<p> </p>\n<p>The Moose Lion keeps a wary eye on Iroh as he approaches, but otherwise does react as he stops  just a few inches before the mouth of the den.</p>\n<p> </p>\n<p>“Good Afternoon, Madam.” Jee starts at General Iroh’s pleasant tone. “I must say, you’ve done a fantastic job of caring for my nephew and I do thank you for that, however I’m going to have to insist that you return my nephew to me.”</p>\n<p> </p>\n<p>Jee cannot believe what he’s currently witnessing. Why was his General having a conversation with a wild animal? Were the rumors true? Did insanity truly run in the Royal Family!?</p>\n<p> </p>\n<p>The Moose Lion regards General Iroh stoically for a few seconds before tossing her head.<br><br></p>\n<p>“Your apprehension is appreciated but unfounded Ma’am. I understand you have not been shown the best example of the care that he receives with us, but I assure you , he is quite safe with us.”</p>\n<p> </p>\n<p>The Beast regards him and to Jee's utter amazement the Moose Lion snorts. </p>\n<p> </p>\n<p>Honest to Agni snorts.</p>\n<p> </p>\n<p>General Iroh is unperturbed.</p>\n<p> </p>\n<p>“That,” he points at Zuko, “Is my nephew.  I care for him deeply and I would appreciate it if you return him to me, now.”</p>\n<p> </p>\n<p>To Jee’s mounting disbelief it looks as if the beast is actually considering the General’s words. Then in a deliberate show of defiance the Moose Lion uses a paw to delicately slide Prince Zuko's body closer to her.</p>\n<p> </p>\n<p><em> ‘Try and take him.’ </em>Her eyes seemed to say.</p>\n<p> </p>\n<p>What …. Was happening? </p>\n<p> </p>\n<p>”If that's how it’s going to be.” General Iroh shifts into a fighting stance, “ If I must take him back by force, I will.” There is a lethal promise in his words and Jee and the men instinctively scramble behind the cover of the trees, on principal.</p>\n<p> </p>\n<p>Man and Moose stare each other down. After about five minutes into their tense exchange,  the Moose Lion let out a slight huff. Her head tilts to the side, the hostility fading  from her gaze, replaced with something almost looks like… respect.</p>\n<p> </p>\n<p>Before Jee can contemplate the eerily humanlike expression, the Moose is shifting,the paw she was using to cover Prince Zuko now being used to push him toward General Iroh. The General slowly shifts out of his fighting stance, his fierce expression morphing into one of gratitude.</p>\n<p> </p>\n<p>“Thank you.” Jee holds his breath as General Iroh steps forward and bundles the Prince into his arms. THe Prince stirs just a bit and Jee feels a bit of tension leave his shoulders. The Moose Lion doesn’t so much as twitch, though she does eye Jee menacingly out of the corner of her eye. Jee glares back with just as much force.</p>\n<p> </p>\n<p>“You have my eternal gratitude for saving and looking after my nephew, Madam. Your protection will not go unrewarded.”</p>\n<p> </p>\n<p>The General bows as formally as he can with his nephew in his arms and starts to head in Jee’s direction. Jee and the Moose Lion hold each other’s stare until the General passes him and continues on. Only then does Jee deem it safe enough to turn his back on the creature. </p>\n<p>\n<br>\n<br>\n</p>\n<p>They make the trip back to the ship in silence, No one relaxes until they see the tip of the ship's burner peeking out over the trees. </p>\n<p> </p>\n<p>Immediately the rest of the men stumble down to galley. No doubt to drown themselves in alcohol and regale the other crewmates with the fantastical events that took place. NOt that they would believe them.</p>\n<p> </p>\n<p>Jee opts to follow the General down to The Prince’s quarters.</p>\n<p> </p>\n<p>“Um, General Iroh, may I ask how you were able to outmaneuver that beast and retrieve Prince Zuko?”</p>\n<p> </p>\n<p>“There was no out maneuvering on my part  at all Lt. Jee.”<br><br></p>\n<p>“Huh?”</p>\n<p> </p>\n<p>“Contrary to popular belief Lt. Jee, Sabre Tooth Moose Lions are perfectly amicable and reasonable animals. While temperamental and territorial if they or theirs are threatened they are actually very parental. Most do not know this due to their fearsome reputation,  but Moose Lions are known as nanny animals due to their natural disposition to care for and foster young of different species.”</p>\n<p> </p>\n<p>“I don't see what that has to do with why the Moose Lion took the Prince or why she wouldn’t return him to us.” General Iroh momentarily stops tucking in the Prince and looks over at him. The smile on his face is a bit disconcerting. </p>\n<p> </p>\n<p>“Apparently, Madam Moose Lion found your care of Zuko quite lacking, and  was thus reluctant to release him back to you, lest he come to more harm.  However, as I was prepared to challenge her head on, she saw that she could trust me to care for him and happily relinquished him.” </p>\n<p> </p>\n<p>Jee takes a minute to process the meaning behind that revelation.</p>\n<p> </p>\n<p> “You mean, she was protecting him…. from us?”</p>\n<p> </p>\n<p>“Indeed.”</p>\n<p> </p>\n<p>Jee’s pride had suffered a lot today but that, somehow, that was the worst hit of all.  How bad of a Quartermaster was he if a vicious wild animal thought his Captain was safer with her than with him. </p>\n<p> </p>\n<p>It would take awhile to get over that. Maybe he’d join the men in the galley for a drink, after all.</p>\n<p> </p>\n<p>“ Do send the Doctor down, Lieutenant. “ General Iroh calls after his retreating form, “and make sure the ship stays docked for the time being . I would think my nephew would like to personally thank Madam Moose Lion.”</p>\n<p>--------</p>\n<p> </p>\n<p>The Prince does indeed jump at the chance to personally thank his Moose Lion Savior, once he stops seeing double, and the knot on his head shrinks. All thoughts on the Avatar lead are forgotten as they trudge through the forest to the Moose’ Lion den. </p>\n<p> </p>\n<p>Jee tries and falls not to scream as the hulking beast outright tackles Prince Zuko the second she sees him.</p>\n<p> </p>\n<p>It’s only the fact that the Prince is not screaming in agony from having his bones crushed that keeps Jee from going into cardiac arrest. In fact, the Moose Lion is cradling Prince Zuko in her paws  as tenderly as one would a newborn Owlkitten. It's worth noting that  Prince Zuko is not the slightest bit perturbed by these happenings.</p>\n<p> </p>\n<p>“Uncle, did you bring the dried meat for Mango?” Prince Zuko calls over the Moose Lion’s loud happy purrs.</p>\n<p> </p>\n<p> Jee blinks in confusion.</p>\n<p> </p>\n<p> “Whose Mango?”</p>\n<p> </p>\n<p>“The Moose Lion.” General Iroh  as if it was obvious . As if most people went around naming dangerous animals after fruit. “It’s what Zuko decided to call her.”</p>\n<p> </p>\n<p>“He named it?” Is what Jee says.</p>\n<p> </p>\n<p><em> ‘He named it MANGO?’  </em>Is what Jee thinks. <em> ‘You let him name it Mango!?’ </em></p>\n<p> </p>\n<p>“Well, we certainly couldn’t keep calling her Moose LIon.” General Iroh says with a chuckle. “That would be rude.”</p>\n<p> </p>\n<p>Jee’s natural response to that would have been that wild animals have no concept of rudeness, but after the events of the previous day, he’s not so sure anymore. Jee watches as Prince Zuko happily feeds the Moose Lion scraps of dried meat and contemplates the most recent events.</p>\n<p> </p>\n<p>Not only had the Prince down what until recently had seemed impossible and somehow tamed a Moose Lion but he’d also named it Mango. Mango the Moose Lion. Mango.</p>\n<p> </p>\n<p>It hits him suddenly then, when he takes the time to think about it. By the time it registers Jee can’t even stop it, the smile is already pulling at his cheeks.</p>\n<p> </p>\n<p>Mango the Moose Lion. Jee shakes his head with a soft chuckle.</p>\n<p> </p>\n<p>Dammit, that was adorable.</p>\n<p> </p>\n<p>\n<em> (Jee really doesn’t feel like smiling, however, when Prince Zuko declares that they are to make yearly stops to visit Mango.) </em>\n</p>\n<p> </p>\n<p>\n<em> (Just be grateful I talked him down from monthly visits, Lieutenant.) </em>\n</p>\n<p>_____</p>\n<p> </p>\n<p>“And that’s the story of how Zuko was adopted by a Sabre Tooth Moose Lion.” Iroh takes a long satisfying sip of tea and basks in the young faces painted in various shades of disbelief. Aang is the first to break the silence , his eyes pinning a sheepish Zuko with an irritated glower.</p>\n<p> </p>\n<p>“Why do you get all the cool pets?” he pouts , throwing a longing gaze at Druk, who's curled around Momo and Froggy, “It’s not FAIR!”  </p>\n<p> </p>\n<p>Zuko stares at him blankly.</p>\n<p> </p>\n<p>“Aang… you have…. a flying bison.” Aang merely huffs as Katara gently  pats his arm.</p>\n<p> </p>\n<p>“Sparky, this is important. ” Toph says, turning to stare at Zuko intensely, “Did you go back and visit Mango and did she remember you?”</p>\n<p> </p>\n<p>“Every year in fact.” Iroh answered for him, ignoring Katara’s soft whisper of<em> ‘Of course’ </em>, “ And she did indeed remember him and I unfortunately found myself having the same  argument with her every time we visited. She grew even more insistent on keeping him with her after she had a litter of her own. “  Iroh takes another sip of tea. “ It drove Lt. Jee insane. They never did quite learn to get along.”</p>\n<p> </p>\n<p>“Speaking of which, with everything that happened, we missed our visit with her this year. She must be so worried. I’m going to have to spend a few extra days with her to make up for it.”</p>\n<p> </p>\n<p>“I’m surprised you haven't tried to move her to the Palace.” Zuko actually looks mildly offended at that.<br><br></p>\n<p>“ I wouldn't do that to her Katara! Of course I’d like her closer but she’s meant to be in the wild. I’d have to put her in an enclosure and that would make her miserable! I am worried about her though. I hear Moose Lion hunting has increased over the past few months. I do hope King Kuei got my proposal about classifying Moose Lions as a protected species. Maybe I should send him another messenger hawk-”</p>\n<p> </p>\n<p>As Zuko begins to fret, Katara turns to stare at Sokka, who’d been strangely quiet. After shifting under her intense gaze for a few minutes, Sokka couldn't take it anymore.</p>\n<p> </p>\n<p>“WHAT?!”</p>\n<p> </p>\n<p>“You're not going to say anything?” Katara asks incredulously, “ After all the fuss you made about Froggy and Druk and Blaze-”</p>\n<p> </p>\n<p>“We don't talk about the <b> <em>Phoenix</em> </b>, Katara.”</p>\n<p> </p>\n<p>“You’re really not gonna overreact and scream about ‘freaky spirit magic’ or tackle unsuspecting bards?”</p>\n<p> </p>\n<p>“First off, I don’t appreciate your assasination of my character. I only tackled <b> <em>one </em> </b>bard, don't make it sound like it’s a reoccurring thing. Secondly, normally I would do all that , but I actually understand this one. There’s something sacred about the bond between a boy and his Sabre Tooth Moose Lion. That’s not freaky spirit magic, that’s just being claimed. You wouldn’t understand, Katara. It’s an ‘in the know’ kinda thing.” Katara rolls her eyes at Sokka’s haughty handwave.</p>\n<p> </p>\n<p>“Yes, of course. We can't forget about little  Foo Foo CuddlyPoops, can we.” Sokka flinches violently as Zuko stops his proposal planning and looks over at them curiously.</p>\n<p> </p>\n<p>“Whose Foo Foo CuddlyPoops?” Sokka flinches even harder and pointedly looks away.</p>\n<p> </p>\n<p>“Ummmmmm.”</p>\n<p> </p>\n<p> Toph barks out a laugh as Aang giggles and a positively evil smirk spreads across Katara’s face.</p>\n<p> </p>\n<p>“That’s the name of Sokka’s own little Moose Lion Cub. Isn't it sooo cwute?” Katara’s smirk widens as Zuko turns to stare at Sokka.</p>\n<p> </p>\n<p>“You named a Sabre Tooth Moose Lion ‘<em> Foo Foo CuddlyPoops </em>’?”</p>\n<p> </p>\n<p>And there it was. Sokka figured this would come back to bite him in the butt. Karma never let  him get away with anything for too long. He’d gotten too comfortable making fun of Zuko’s naming skills and ignored the fact that his own weren’t any better. And now he was going to pay for it. The worst thing about it? Zuko deserved to throw this one in his face.  He can’t even complain about it. He can only sit there and wait for the epic teasing to commence.</p>\n<p> </p>\n<p>Nothing of the sort happens.</p>\n<p> </p>\n<p>Instead a small smile devoid of any kind of mockery spreads across Zuko’s face.</p>\n<p> </p>\n<p>“That <b> <em>is</em> </b> a cute name for a Moose Lion cub. You wouldn’t mind if I used that, would you?” </p>\n<p> </p>\n<p>Sokka stares at Zuko blankly. He’s not the only one. Zuko begins to fidget as the weight of everyone’s eyes pin him down.</p>\n<p> </p>\n<p>“Seriously Sparky?” Zuko flushes under Toph ‘s deadpan stare.</p>\n<p> </p>\n<p>“ Well - I just - uh - AH!” Zuko squawks in surprise as Sokka suddenly rockets  across the room and throws his arms around Zuko’s neck.</p>\n<p> </p>\n<p>“Um, Sokka?” Sokka hugs him tighter and buries his face into Zuko’s neck.</p>\n<p> </p>\n<p>“I don't deserve you.”</p>"
}