{
  "id": "21363562",
  "url": "https://archiveofourown.org/works/21363562?view_full_work=true",
  "author": [
    "discordiansamba"
  ],
  "title": "kintsugi",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "Avatar: The Last Airbender"
  ],
  "relationships": [
    "Toph Beifong & Zuko"
  ],
  "characters": [
    "Zuko (Avatar)",
    "Toph Beifong",
    "Lao Beifong"
  ],
  "additional_tags": [
    "Alternate Universe - Canon Divergence",
    "toph didn't get her field trip so she gets to hog zuko for three whole years"
  ],
  "language": "English",
  "series": "Part 1 of kintsugi",
  "published": "2019-11-09",
  "completed": null,
  "words": "8,390",
  "chapters": "1/1",
  "comments": "229",
  "kudos": "9,335",
  "bookmarks": "749",
  "hits": "78,131",
  "summary": "<p>After his ill-fated Agni Kai, Zuko is cast out of the Fire Nation without even so much as a hope of returning. Dumped on Earth Kingdom shores, he's forced to come to terms with the fact that his father likely wants him dead- and that maybe the Fire Nation was never that great to begin with.</p>\n<p>That's the painful part.</p>\n<p>The weird part? The weird part is breaking into a nobleman's manor in order to steal food, getting caught and then being hired to protect (babysit) said nobleman's blind daughter. Then again... maybe it's exactly what he needs right now.</p>\n<p>(or, toph never got her field trip so now she gets to hog zuko for three whole years)</p>",
  "notes": "<p>So, this story! I first should preface this with an updated on my Voltron stories for anyone who follows me for that: I have about half of the next chapter of <i>long live the queen</i> written, so hopefully I'll get to finishing that within the next week or so! But on to this story in particular- I got Avatar the Last Airbender on Blu-Ray recently and have been rewatching the series in my spare time, so of course, me being me, I instantly start thinking of Totally Self-Indulgent AUs because this is what I do. I feel like my two favorite Avatar characters being Zuko and Toph should come as a total non-surprise to anyone, so alas, how sad it is that the two never got that life-changing field trip.</p>\n<p>But what's better than a life-changing field trip? An AU where Toph gets to hog Zuko for three whole years. Hence this. The title is taken from kintsugi, the art of repairing damaged pottery with gold, which felt extremely fitting for an au that focuses on everyone's favorite earth and fire benders. I plan to write a lot more for this, and actually have a lot of stuff planned, but updates will probably be sporadic bc I've got all that Voltron fic to get back to working on as well. Just had to get this one out of me while I had the chance!</p>\n<p>Also a special shout out to my good buddy Kit for listening to me ramble about this AU for like... hours, over the course of several days. They know all the secrets now.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>",
  "text": "<p>He wouldn't have done it if he wasn't desperate.</p>\n<p>It was that and hunger, but the two were pretty much the same thing in this context anyways. When he'd been dropped off- more like <em>dumped</em>, really- at the nearest mainland Earth Kingdom port, he'd only been given enough coin to last for about two months, <em>if </em>he was frugal.</p>\n<p>It had been four months since then. He'd long since run out of coin, and out of anything he had that was worth any value to sell- at least, anything that he was still willing to give up. He'd spent his last copper pieces on a loaf of bread three villages ago, and had eaten the last piece of said bread two weeks prior. Once he'd polished that off, all he'd managed to find were various nuts and berries he was only half-sure weren't poisonous.</p>\n<p>He hadn't lost any of those bets yet, but he wasn't willing to bank on the trend continuing. He'd always had bad luck. Maybe his father had been right- maybe he <em>was </em>just lucky to be born.</p>\n<p>Or maybe his father was just an awful man who liked mutilating children.</p>\n<p>It was hard not to think that, not when the evidence was burned into almost every village he'd passed thus far. Maybe none so obvious as the unwanted lesson that had been seared into his face, but the war had followed him everywhere he went, seared into the land and into the people themselves. It was everywhere he looked, and he couldn't even try to pretend that his father, to some extent, didn't know about it. Not when he'd been willing to sacrifice an entire division of young soldiers whose only crime was being loyal to a nation and a ruler who clearly didn't deserve it.</p>\n<p>Some of those who bore the marks of his nation's advance were even younger than him. Some older- <em>much </em>older.</p>\n<p>(People who couldn't fight back. Not just people who had refused, like he had.)</p>\n<p>Gaoling was the first town he'd been in that <em>didn't </em>bear any visible scars from the war. Even then, it was probably only a matter of time.</p>\n<p>It was why he had let his guard down so much- he didn't think anyone would be looking for him here. That is, if anyone <em>was </em>looking for him, and they didn't just think he was dead. There were already vague rumors starting to spread that the Firelord had banished his only son. He wasn't sure how far those rumors had gotten, or if anyone even knew what he even looked like. Nobody really thought much of his odds of survival- whether it was just because they thought of him as a stupid, spoiled prince, or because they just didn't think he'd survive the burn his father had inflicted on him. He'd had precious little time to heal from it before he was forced out of the Fire Nation and into exile.</p>\n<p>Now he was here, in the Earth Kingdom, with no possible way to return home. His father had even gone so far as to bar him from setting foot in any of their colonies.</p>\n<p>It was a death sentence in everything but name only.</p>\n<p>His father <em>wanted </em>him dead. He just couldn't be bothered to do it himself. Realizing that had been almost as painful as getting half his face burned off.</p>\n<p><em>Almost</em>.</p>\n<p>And now, forced to his knees inside the same kind of grand, sprawling manor that had once been his birthright, he couldn't help but wonder if his father was about to get his wish. Gritting his teeth, he stared down at the floor, like he was more angry at it than he was himself. It had been so stupid- all he'd needed was to get in, grab some fruit, and get out. It wasn't even that hard, so how had he let himself get caught?</p>\n<p>He wasn't proud of resorting to theft, but he was even <em>less </em>proud of getting caught.</p>\n<p>\"Who is this?\"</p>\n<p>He didn't think it was possible, but he managed to grit his teeth even more at the nobleman's tone- that, and the way the question wasn't even addressed to <em>him</em>, but to the guard at his side. He was the one who'd earthbent the restraints into place, though they were loose enough that with some effort, he could probably wriggle free. As far as oversights went, it seemed like a pretty suspicious one.</p>\n<p>Maybe he'd taken one look at the intruder he'd been called to capture, and had taken pity on him.</p>\n<p>He wasn't sure how he felt about that.</p>\n<p>\"We caught him sneaking around in the gardens.\" The guard informed his employers. \"He had these on him.\"</p>\n<p>He didn't look up, already knowing what it was that he held out. The dual dao were one of the few things he still had from home- the only weapon he had, other than the knife tucked into his boot, the one they hadn't found yet. It had been a gift from his uncle- so had the swords, actually.</p>\n<p>Uncle Iroh hadn't been in the Fire Nation when... well, when everything had happened. He didn't even know if he knew about it yet- depending on where he was, it could take <em>months </em>for the rumors of his banishment to reach him, and even longer for him to return to the Fire Nation to verify the truth for himself.</p>\n<p>He doubted father would have so much as bothered to send him a single message.</p>\n<p>\"I see.\" He didn't even have to look up to see the sharp incline of the nobleman's brows- his tone was enough. \"And what were you planning on doing, young man, sneaking around with such things?\"</p>\n<p>He was half tempted to remain silent out of spite. But while the guard who had restrained him might have taken a small amount of pity on him, the guard keeping him kneeling definitely wasn't. Jerking his head up, he looked the nobleman in his eye, taking the tiniest amount of satisfaction from the way they paled at the sight of his face.</p>\n<p>Or at the very least, the left half of it.</p>\n<p>\"Stealing your fruit.\" Zuko said bluntly.</p>\n<p>\"While carrying swords?\" The nobleman asked, once he had recovered from his initial shock.</p>\n<p>He was pointedly trying to avoid looking at his left.</p>\n<p>\"I wasn't planning to kill anyone, if that's what you're thinking.\" Zuko said. \"I was just hungry. I don't exactly have any money, and you have <em>a lot</em> of fruit trees.\"</p>\n<p>The nobleman tilted his head, like he was contemplating his words. Well, at least he wasn't ordering his death on the spot, or hauling him away to Agni knows where.</p>\n<p>\"Let him stand.\" The nobleman finally said, motioning with his hand as if he expected him to rise with it, like a puppet on strings. He almost wanted to laugh, but he bit it back, stumbling to his feet the moment the guard let him up, drawing himself to his full height- whatever that was worth.</p>\n<p>Compared to the two guards who flanked him, not much.</p>\n<p>\"What's your name, boy?\" The nobleman asked.</p>\n<p>Zuko twitched, more at being asked his name than at being called <em>boy</em>. <em>Zuko </em>was a Fire Nation name, and if there was one thing he'd learned in his four months in the Earth Kingdom, it was that being Fire was a dangerous thing here. It was why shortly after arriving, he'd cut off his phoenix tail, as much as it pained him to do so. He might have already lost his honor, but cutting it off had made it all feel so <em>final</em>, in a way that being banished hadn't. He drew less attention this way, but only so much- there might be others with pale skin and dark hair in the Earth Kingdom, but gold eyes weren't found anywhere outside of the Fire Nation.</p>\n<p>It didn't stop him from meeting the nobleman's eyes.</p>\n<p>\"Li,\" he lied, blurting out the first name that came to mind, \"-it's Li.\"</p>\n<p>He was a terrible liar, he knew, but the nobleman seemed to buy it. \"How old are you?\"</p>\n<p>\"Thirteen.\" Zuko said. It wasn't a lie this time.</p>\n<p>Something in the nobleman's face twitched, but he wasn't good enough at reading people to determine what that meant. That was more of Azula's thing.</p>\n<p>Azula, who was probably gleefully embracing her new role as crown princess, while he was being treated like a common criminal.</p>\n<p>(Azula, who he'd left alone with their father.)</p>\n<p>\"And where are your parents, Li?\" The nobleman asked. \"Surely they wouldn't approve.\"</p>\n<p>They wouldn't, and for two different reasons, Zuko couldn't help but think.</p>\n<p>\"They're gone.\" He said instead. It wasn't technically a lie. His mother had been gone for years, and his father had removed himself from his life- or had removed him from his.</p>\n<p>\"Gone.\" The nobleman repeated, this time actually managing to hold his gaze.</p>\n<p>He saw his brows crease, and bad at reading people or not, he'd seen that on enough faces to recognize it as the moment the man registered the fact that his eyes were <em>gold</em>. Zuko tensed, holding his breath. If he could firebend, he be able to gain the element of surprise, maybe enough to get away.</p>\n<p><em>If </em>he could firebend.</p>\n<p>He hadn't been able to, not since the Agni Kai. Not since...</p>\n<p>He tried not to think about it.</p>\n<p>The nobleman leaned back in his chair, idly stroking his thin mustache. He was drawing his own conclusions, so Zuko just shut up and let him. Anything he could come up with was hopefully better than any attempt on his part to lie his way out of the situation. Maybe if he was lucky, he'd just go to jail for a few days.</p>\n<p>At least they'd feed him there, some part of him that wasn't as prideful as the rest thought. He was pretty sure it was his stomach.</p>\n<p>\"Where are you from, Li?\" The nobleman questioned.</p>\n<p>Zuko dropped his gaze. He wasn't sure he liked the pity he saw there, and didn't want to read too much into it. \"Around.\"</p>\n<p>\"Hm,\" he felt the nobleman's gaze shift, back towards the guard, \"-it <em>is </em>rather late. Perhaps I will mull this over with a clearer head in the morning.\"</p>\n<p>\"What should we do with him?\" The guard who had taken pity on him asked.</p>\n<p>\"There is an empty room in the servant's quarters.\" The nobleman said. \"Take him there. And remove the restraints. They seem a bit much for a thirteen year old <em>fruit thief</em>.\"</p>\n<p>Zuko's shoulders sagged. At least he'd believed part of his story. Maybe he'd scrape through this yet. Without the restraints, it would be easier to escape. He could be gone before the sun rose.</p>\n<p>\"Make sure someone gives him a proper meal,\" the nobleman instructed, and then, with a bit more disdain, \"-and a proper <em>bath</em>, perhaps.\"</p>\n<p>Zuko felt an ugly flush rise to his cheeks, grateful he was already looking at the floor. He'd done what he could to keep himself clean, but there was only so much he could do in cold streams without any soap around. He couldn't even heat up the water with his firebending. That didn't even require any actual <em>flame</em>, and even that was beyond him.</p>\n<p>He wondered if his father knew this would happen. He wouldn't put it past him.</p>\n<p>\"And his swords?\" The other guard asked, seemingly less enthused at the prospect of letting him loose.</p>\n<p>\"Keep them.\"</p>\n<p>Zuko's head snapped up, his eyes going wide. No. No, he needed those. They were the only connection he had to home, and he wasn't willing to give them up yet. And without his firebending, they were the only thing he could depend on to protect himself.</p>\n<p>There must have been desperation in his eyes, because the nobleman merely frowned, and added, \"-for now.\"</p>\n<p>Zuko felt himself breathe again, but he didn't relax, not this time. He couldn't leave here without his dao. Maybe he could overpower the guards and take them back- but no, fighting them was what had gotten him caught in the first place. It would be a lot easier to slip out when no one was looking.</p>\n<p>Which meant his only real option was to wait until morning, and hope that the nobleman decided to let him go. He hadn't called for his arrest yet, and he was even offering him a meal and a bath- which was more than he'd had in <em>months</em>. But hope wasn't something that came easy to him- not anymore, at least.</p>\n<p>Not since his mother vanished.</p>\n<p>He grit his teeth again, staring back down at the floor. He hated living like this, having to do everything he could just to survive, and even then only barely managing to scrape by. It shouldn't be this way- he was a <em>prince</em>!</p>\n<p><em>Was </em>a prince, a voice in the back of his head reminded him. It sounded too much like Azula for his comfort, and it's enough to take the fire out of him.</p>\n<p><em>Was </em>a prince. Not anymore. He couldn't go home again. Not ever.</p>\n<p>All he could do was try to survive.</p>\n<p>The increase in guards didn't exactly slip her notice.</p>\n<p>She felt a slight bubble of apprehension as she crept back towards the manor, wondering if someone had noticed she was missing. But the guards weren't looking for anyone, like they would be if they had, she quickly realized- they were just <em>there</em>.</p>\n<p>Huh.</p>\n<p>Either way, it motivated her to make short work of the trip back to her room. Even without her earth sense, it was an easy enough path to follow- she'd only done this more times than she could count already. If she wanted to practice earthbending- <em>really </em>practice it, not just the breathing exercises and boring baby basics that Master Yu had her doing- she couldn't exactly stick around the house, after all. Her parents would <em>freak </em>if they knew what she was doing.</p>\n<p>Would that stop her? No, of course not. It just meant that she had to be <em>sneaky </em>about it.</p>\n<p>And she was good at sneaky.</p>\n<p>Increased guard or not, Toph made it back to her room without any trouble. Just in time, too- she could hear footsteps coming down the hall. She practically dove into her bed, flinging her covers over herself in an attempt to make it look like she had been here, asleep in bed the entire time- an act that she'd had plenty of chances to practice.</p>\n<p>It wasn't long before she could hear the guards outside her door. She didn't need her earth sense to tell they were guards either- all she needed was the heavy sound of their footsteps and their not so hushed whispers as they peeked into her room. If it was one of the servants, they would have been more subtle about it.</p>\n<p>\"She's asleep.\" One of them said in a soft voice, quiet enough that it wouldn't have woken her if she <em>was </em>actually sleeping, but still loud enough that it was audible when she wasn't. \"I don't think she noticed anything.\"</p>\n<p>Her back turned the door, Toph's brow shot up. Notice <em>what</em>? The increase in guards? Because she'd totally noticed that.</p>\n<p>\"Good.\" The other said, slightly louder. \"If anything happened to her, it would be <em>our </em>heads.\"</p>\n<p>Okay, now she was super curious. What the heck had she missed? Had something actually <em>interesting </em>happened around here while she was gone? Nothing interesting <em>ever </em>happened around here.</p>\n<p>Just her luck she'd missed it.</p>\n<p>The door slid shut, but she could still hear the soft conversation of the guards outside. \"Think the kid's going to stick around till morning?\"</p>\n<p><em>What kid</em>, Toph wanted to ask, but years of practice in not saying what was on her mind around her parents held her tongue for her.</p>\n<p>\"Depends.\" The other replied, still speaking at a volume that was too loud to be a whisper. She rolled her eyes, wondering if the moron thought she was deaf, too. \"Huan said he seemed pretty attached to those swords. I don't think he's going to be leaving without them.\"</p>\n<p><em><strong>What </strong></em><em>swords</em>, Toph wanted to ask even more. Her first thought was a thief, but there weren't any even swords in the manor to steal- at least, not that she knew of. Besides, from the sound of it, they were sticking around voluntarily- not something a thief would do, at least, not one that wasn't a total dunderhead.</p>\n<p>It actually kind of sounded like the swords belonged to <em>him </em>anyways.</p>\n<p>She was almost starting to regret sneaking out tonight. <em>Something </em>had clearly happened while she was gone.</p>\n<p>\"If not that, maybe the lure of a warm bed'll do it.\" The first guard observed. \"I caught a glimpse of the kid as Huan and Yang were hauling him in. Kinda looked like death warmed over, you know?\"</p>\n<p>Toph rolled her eyes. Gee, thanks for the great visual. That told her absolutely nothing.</p>\n<p>The other guard seemed to understand it well enough, though. \"The master will probably just send him on his way tomorrow morning. Nothing good comes from keeping a kid like <em>that </em>around.\"</p>\n<p>Toph almost grunted in frustration. Like <em>what</em>!? <em>Context</em>, people!</p>\n<p>\"I thought you didn't see him.\"</p>\n<p>\"No, but I heard. Kind of hard not to.\"</p>\n<p>Okay, that did it. Sitting up in bed, Toph paused for just a second to dust herself off as much as possible. She couldn't <em>feel </em>any dirt clinging to her still, but better safe than sorry. Making her way towards the door, she lightly tapped on it, taking no small amount of satisfaction at the way the guards jumped at the sound of it.</p>\n<p>One of them cracked the door open. \"Miss Beifong. We didn't mean to wake you.\"</p>\n<p>\"Has something happened?\" Toph asked, barely managing to keep the impatient demand out of her voice.</p>\n<p>\"Nothing you need to worry about, miss,\" came the reply.</p>\n<p>The edges of her lips twitched downwards in a frown. \"Please?\"</p>\n<p>She could feel the guards shifting uncertainly on their feet, and fought the urge to grin. The pouty face got them every time.</p>\n<p>\"It really is nothing that you need to be concerned about,\" one said, \"-it was just a boy who snuck in to steal some fruit from the trees.\"</p>\n<p>Toph arched a brow. That's it? All this just for some fruit thief? That seemed a little extreme, even for her parents. \"And does my father know about this?\"</p>\n<p>\"Of course. Your father spoke with him already.\"</p>\n<p>\"And?\" Toph asked, now outright fishing for information. They'd probably just think she was cranky from being woken up.</p>\n<p>\"Your father took pity on him, and allowed him to stay overnight in the servant's quarters.\" The guard hesitantly replied. \"But I'm certain he'll be gone by morning.\"</p>\n<p>Toph hummed, before faking a yawn. \"Oh. If that's all, I would like to go back to sleep now.\"</p>\n<p>She could hear the rustle of fabric she had come to associate with bowing, just as well as she could sense the motions. \"Of course. Our apologies for waking you.\"</p>\n<p>The door slid shut again, leaving Toph alone. For a moment, she considered making her way towards the servants quarters to get a sense of this <em>fruit thief</em> for herself, but quickly decided against it. While her father wasn't exactly the type to throw a kid to the wolves, he also wasn't the type to let an unknown factor reside on the grounds of their manor without having <em>someone </em>keep watch on them. She'd probably just get caught if she tried to sneak out, earth sense or no earth sense.</p>\n<p>Besides, who knew? Maybe the kid <em>would </em>actually stick around until morning.</p>\n<p>With that thought, she let out another yawn- a real one this time, and trudged back into her bed. Without the guards mumbling outside her door, she fell asleep quickly.</p>\n<p>He woke with a startled jerk, just as the first rays of sunlight arced over the horizon.</p>\n<p>For a split second, he couldn't remember where he was, before the previous evening's events caught up with him. It didn't serve to relax him at all. He hadn't actually meant to fall asleep. It hadn't even been that comfortable, just a thin mattress placed on a stone floor. He must have been more exhausted than he'd realized.</p>\n<p>He hadn't exactly slept well- not since his banishment.</p>\n<p>Groaning, he dragged himself to his feet. If things here worked anything like they did back home, then there would already be servants who were awake and prepping for the day. Any chance he might have had of slipping back into the main house and taking back his swords was pretty much gone, leaving him with two options- either wait until he was summoned, or leave without them. Maybe he wouldn't be able to make his way back into the main house without being noticed, but it was still early enough that he could at least slip out.</p>\n<p>...and leave himself without anything to defend himself with.</p>\n<p>Running a hand through his scruffy hair, he let out a frustrated sigh. He had his knife, but that would only go so far. As long as he wasn't able to firebend, he'd need those swords.</p>\n<p>How pathetic. A firebender who was afraid of fire. He'd never heard of anything so absurd before.</p>\n<p>Dropping his hand, Zuko settled back down on the floor to wait. Closing his eyes, he did his best to remember the breathing exercises that his uncle had once taught him. Lately they felt more comfortable than anything he had learned from the Fire Sages. He wished his uncle had been able to teach him more, but after Lu Ten's death, he had never stayed in the palace for longer than a handful of weeks at the most. Everyone said that he was haunted by the memories of his lost son, and that it made him weak- that was why he had ended his six hundred day siege on the city of Ba Sing Se, the only failure in his otherwise long and illustrious career as a general.</p>\n<p>He'd never agreed.</p>\n<p>Taking in a deep breath, he slowly let it out. He hadn't been able to properly meditate since he'd been banished, but now was as good a time as any, he guessed. He was just glad that he could still feel the sun's energy, his own inner fire responding to it as it slowly made its way over the horizon.</p>\n<p>It gave him hope that he hadn't lost his firebending completely.</p>\n<p>The sun had been up for a little over an hour when he picked up on the sound of footsteps outside the small room he'd been given. Peeking an eye open, he turned towards it with a slight frown. They sounded too slight to belong to one of the guards, or even one of the servants- unless the servants here all had exceptionally small feet.</p>\n<p>They also weren't trying to come inside.</p>\n<p>Frown deepening, Zuko rose to his feet. \"Who's there?\"</p>\n<p>\"Wow, good ears. And here I thought I was being sneaky.\"</p>\n<p>The voice was pitched high- a child, maybe a young girl. Zuko's brow furrowed, already feeling a lot less tense. A child probably wasn't much of a threat.</p>\n<p>He was, however, confused.</p>\n<p>\"Who are you?\" Zuko asked.</p>\n<p>\"I should be the one asking you that,\" the girl replied, making no move to come in, or even open the door, \"-seeing as you're in <em>my </em>house and all.\"</p>\n<p>\"Your-\" Zuko began, even as pieces clicked together, \"-are you that daughter of that nobleman?\"</p>\n<p>She could have just been the child of a servant, but servant children didn't typically refer to grand estates as <em>their </em>house. It was safe to assume when she said it was hers, she meant it.</p>\n<p>\"That's a distinct possibility.\" The girl replied, almost sounding amused. \"I hear you tried to break in last night.\"</p>\n<p>Zuko's remaining brow twitched. Had she come to spy on him, like he was some kind of spectacle? His burn might make him <em>look </em>like a freak, but he was <em>not </em>a spectacle. Storming towards the door, he threw it open, not wanting to further engage in a conversation with someone he couldn't even <em>see</em>.</p>\n<p>-and quickly realized why the reverse hadn't bothered the girl in the slightest.</p>\n<p>She was <em>blind</em>.</p>\n<p>He'd seen blind people before. On one of his rare visits back to the royal palace, Uncle Iroh had taken him to a hospital that had been set up to treat wounded soldiers. Among those being treated were those who had lost their eyesight in the war- some due to retaliation from earthbenders, and others still due to their own flames turning back on them. He was nearly half-blind himself now, his left eye reduced to a mere slit.</p>\n<p>The glassy eyes and unblemished face of the petite Earth Kingdom girl told him that she was none of those.</p>\n<p>She was also completely unfazed by his reaction. \"Wow, <em>someone's </em>testy.\"</p>\n<p>\"I-\" Zuko began, abruptly realizing he had no idea what to say.</p>\n<p>Peeking down the hall, he tried to see if anyone else was around, searching for some kind of guard. Surely they wouldn't have just let the young lady of the house come on her own to meet someone who had broken in, right? Especially not when she was <em>blind</em>- and tiny, Zuko couldn't help but realize. He'd always been tall for his age, but even then, she barely came up over his waist.</p>\n<p>And yet... there wasn't a single guard. Not even any servants. She was alone.</p>\n<p>What was going <em>on</em>?</p>\n<p>\"If you're looking for my keepers,\" the girl began, a tooth-baring grin that didn't suit her fancy clothes at all on her face, \"-they're not around.\"</p>\n<p>Zuko blinked, staring down at the girl in confusion. How did she-?</p>\n<p>\"Why are you,\" he began, finally finding his voice, \"-why are you <em>here</em>?\"</p>\n<p>\"Because you breaking in is the one interesting thing that's happened in here in literal <em>years</em>.\" She replied. \"Why <em>wouldn't </em>I want to come see you?\"</p>\n<p>Something about the girl's toothy grin told him that her choice of words was a trap. He huffed again, the feeling of being a spectacle returning. It felt like people had done nothing <em>but </em>stare at him since he'd come to the Earth Kingdom- though typically, it was the scar that drew their attention.</p>\n<p>This girl though... she couldn't see the scar. Or anything, for that matter. But apparently, that wasn't enough to stop her from wanting to gawk at him anyways. He crinkled his nose, disgusted at how he must seem to her- the poor starving peasant boy who broke into her home just to take a small handful of what she had in abundance.</p>\n<p>For someone who'd been one once, he sure was starting to hate rich people.</p>\n<p>\"I'm not here for you to gawk at.\" Zuko said firmly. \"I just want to get my swords back from your father so I can leave already.\"</p>\n<p>\"But where's the fun in that?\" The girl asked, not even so much as blinking at the change in his tone. \"The name's Toph, by the way. Toph Beifong.\"</p>\n<p>\"I didn't ask.\" Zuko said flatly.</p>\n<p>The girl- <em>Toph</em>- remained completely unfazed, the edge of her mouth twitching upwards in amusement instead. \"Geez, did something crawl in your bed and die? I'm trying to be <em>friendly </em>here.\"</p>\n<p>\"I broke into your house, and you want to be <em>friends</em>?\" Zuko asked in disbelief.</p>\n<p>\"Why not?\" Toph shrugged. \"You don't sound much older than me. And my parents don't exactly allow me to talk to other kids my age. Or anyone at all, actually.\"</p>\n<p>Something in Zuko deflated at that. She hadn't come here to make a spectacle out of him- she'd come here because she was <em>lonely</em>.</p>\n<p>And that was something he could understand. <em>More </em>than understand, even. He never had friends either. Azula made sure of that.</p>\n<p>\"Oh.\" Zuko finally said, his voice quiet. \"That's um... that's not great of them.\"</p>\n<p>To his surprise, Toph laughed. \"Wow, you sure have a way with words, Scruffy.\"</p>\n<p>\"Scru- my name is not <em>Scruffy</em>.\" Zuko said quickly, one hand self-consciously flying to his hair. It wasn't <em>that </em>scruffy, was it? And how could she even <em>tell</em>?</p>\n<p>\"Then what <em>is </em>your name?\" Toph asked, tilting her head curiously. \"You didn't say.\"</p>\n<p>\"Li.\" Zuko said, quickly recalling the false name he'd given her father last night. \"I'm Li.\"</p>\n<p>The girl's brows shot up, but she only continued to grin. \"I think Scruffy suits you better.\"</p>\n<p>Zuko just grumbled, crossing his arms in front of him. \"Aren't you blind? How do you even know what my hair looks like?\"</p>\n<p>Toph just continued to give him that toothy grin. \"I don't. You just sound like a Scruffy.\"</p>\n<p>\"That doesn't even make any sense.\" Zuko said.</p>\n<p>\"Hey, it's not my fault you don't understand a good nickname.\" Toph said.</p>\n<p>Zuko opened his mouth to say something, but stopped short at the sound of footsteps. These were much heavier than Toph's had been- and sure enough, mere seconds later, the pair of guards from last night rounded the corner. Toph visibly flinched, but he was blocking the only escape route, leaving the young noble girl nowhere to hide.</p>\n<p>Whoops.</p>\n<p>\"Miss Beifong!\" One of the two- the one who had made sure his cuffs were somewhat loose- exclaimed. \"I don't think- you shouldn't be here.\"</p>\n<p>It was amazing, the way Toph's posture transformed. Where her shoulders had been squared before, set with confidence, they now relaxed, giving her a far more meek appearance. Even her voice, when she spoke, sounded like the fight had washed out of it in a rush.</p>\n<p>He didn't believe it for a second.</p>\n<p>\"I'm sorry.\" She apologized. \"I was just curious.\"</p>\n<p>\"You know your father doesn't want you to wander the estate on your own.\" The guard continued to scold her. \"Especially not when there are strangers around.\"</p>\n<p>Zuko stiffened, but said nothing. It wasn't like he couldn't understand why they might be concerned. He'd taken up their offer of a warm bath, so he was at least more presentable than he'd been last night, but he knew he looked more like a half-starved refugee than he did a prince. He'd be suspicious of him too.</p>\n<p>\"But Li's <em>nice</em>.\" Toph insisted. \"He wouldn't hurt me. Right, Li?\"</p>\n<p>\"Uh,\" Zuko blinked, struggling to keep a neutral expression even as he wondered what he'd done to give off the impression of being <em>nice</em>, \"-right. I wouldn't- I wouldn't do that.\"</p>\n<p>\"See?\" Toph said. \"Do you think my father would let him stay?\"</p>\n<p>Wait- what? Staring down at Toph, Zuko could only blink. They'd barely spent longer than three minutes together- and he'd snapped at her for more than part of it. Was she really that lonely that even the slightest promise of companionship from someone close to her own age was enough to leave her wanting more?</p>\n<p>(Of course it was. He'd been exactly the same.)</p>\n<p>The guards shifted on their feet, clearly more uncomfortable with this situation than he was. \"He's a thief, Miss Beifong.\"</p>\n<p>\"He tried to steal fruit, not priceless family heirlooms.\" Toph said, just a hint of the edge her voice had held previously coming back. \"And <em>I </em>like him.\"</p>\n<p>\"I don't think your father would-\"</p>\n<p>\"In that case,\" Toph said, grabbing his wrist without even the slightest hint of fumbling to find it, \"-I will talk to father myself.\"</p>\n<p>Before Zuko could get another word out, Toph was already storming past the guards, with him in tow. If Azula saw him like this, being dragged by the wrist by a blind girl half his size, she would have laughed at him. Toph's grip was surprisingly firm, but nothing he couldn't break out of if he really wanted to.</p>\n<p>He didn't.</p>\n<p>'Li' was already shaping up to be way more interesting than she'd anticipated.</p>\n<p>Oh, she knew <em>Li </em>wasn't his actual name. It had been super obvious. He'd tried to sound curt about it, like that would make selling the lie a little easier, but there was no fooling her feet. Normally she would be a bit miffed about someone lying to her, but honestly, lying about something as basic as his name only served to make him <em>more </em>interesting.</p>\n<p>She liked a little enigma in a person.</p>\n<p>\"So,\" she chirped, \"-where are you from, Li?\"</p>\n<p>\"Around.\" Li said rather curtly. \"What are you even-?\"</p>\n<p>\"I'm nine.\" Toph cut him off, answering a question he hadn't even asked. \"How about you?\"</p>\n<p>\"...thirteen.\" Li replied- and huh, that was the truth. Guess he didn't just <em>sound </em>young.</p>\n<p>\"You know how to use those swords the guards took from you?\" Toph asked.</p>\n<p>\"Yes.\" Li quickly replied, then added, \"-why?\"</p>\n<p>\"Just wanted to make sure.\" She said, pleased to see that he was telling the truth.</p>\n<p>After all, her whole plan hinged on this guy knowing how to fight. She wasn't kidding about Li being the first interesting thing to happen around here for years. And from the sound of it, he didn't exactly have much going on in his life either, not if he was trying to steal fruit that he <em>should </em>have just been able to buy in the market. Probably couldn't afford it, she thought. With his clothes on, she couldn't tell for sure if he was scrawny or not- at least, not with her earth sense.</p>\n<p>Her own hand, however, informed her that his wrist was both too thin and bony. Coupled with the fact that he'd been trying to steal food... well, she wasn't exactly the <em>champion of justice</em> type or anything, but kids barley older than her shouldn't be starving.</p>\n<p>(His wrist also felt unusually warm, but eh. She'd been accused of having cold hands before, so maybe Li's were what temperature hands were <em>supposed </em>to feel like.)</p>\n<p>\"Where are you even taking me?\" Li asked.</p>\n<p>\"Getting you a job, duh!\" Toph said. Hadn't he been listening?</p>\n<p>Li came to an abrupt halt, grinding his feet into the dirt with a surprising amount of stubbornness. He'd make a halfway decent earthbender, she couldn't help but think to herself, even as he snatched his bony wrist back from her. She could sense the way he deliberately straightened his posture, jerking his chin upwards.</p>\n<p>\"I don't need your pity.\" He said, an echo of pride clinging to his words.</p>\n<p>Toph just groaned. \"Its not pity, Scruffy. I'm just trying to help you out.\"</p>\n<p>\"Same thing.\" Li said.</p>\n<p>\"So what, you'd rather starve to death on the streets?\" Toph asked.</p>\n<p>\"I wouldn't-\" Li began, but cut himself short. \"Look. I appreciate the thought, but all I want is to get my swords back and be on my way.\"</p>\n<p>There was a slight pause there, before he added, \"-and also preferably not be arrested.\"</p>\n<p>\"Why?\" Toph asked. \"You have somewhere to go?\"</p>\n<p>Li's continued silence was answer enough.</p>\n<p>\"Then don't be so quick to dismiss my help, Scruffy. Besides,\" she told him, \"-this is as much for me as it is for you.\"</p>\n<p>\"What do you-?\"</p>\n<p>\"Toph!\"</p>\n<p>Toph huffed slightly, annoyed at the interruption even if she <em>had </em>sensed it coming. She wasn't sure how her father had even gotten here so fast, but if she had to guess, then she would say that one of the guards had taken a shortcut to get him. It wasn't like she could move very fast with Li's dead weight behind her.</p>\n<p>Who, incidentally, had dropped half a step back.</p>\n<p>\"Toph, what are you doing here?\" Her father said, grasping her by the shoulders. His touch was feather light, like he was afraid she would shatter at even the smallest amount of pressure. \"You should be in your room, not-\"</p>\n<p>\"-not talking to the only person that's been here since forever that's anywhere <em>near </em>close to my age?\" Toph finished for him.</p>\n<p>That gave her father some pause. Good.</p>\n<p>\"Toph,\" her father slowly began, \"-I can understand why you might be lonely, but you know why your mother and I keep you here. We are not trying to be cruel.\"</p>\n<p>\"I know.\" Toph said, fighting the urge to grit her teeth. She knew her parents thought they were doing the right thing by protecting her, but sometimes it just felt so <em>suffocating</em>. \"You just want to keep me safe.\"</p>\n<p>\"Exactly.\" Her father agreed, his hands slipping away from her as he rose, as if he thought their conversation was already done and over with. \"Now, as for <em>you</em>, young man-\"</p>\n<p>She opened her mouth to say that she wasn't done talking yet, when Li caught her off guard. She couldn't help but wonder if her feet were as broken as her eyes, because it felt a lot like he'd <em>bowed </em>to her father- the kind of proper noble, courtly bow that she'd been taught to do herself, her mother guiding her through the actions like she was some kind of doll. His was almost perfect- even if he <em>did </em>nearly mess up the hand movements. Maybe she wasn't an expert on homeless kids, but that didn't exactly seem like the kind of thing your average one knew how to do.</p>\n<p>She knew he was an interesting guy.</p>\n<p>\"I apologize.\" Li said in a clear voice. \"I didn't mean to cause any further trouble.\"</p>\n<p>If <em>she </em>had been caught off guard, then her father had been even more so. He straightened further, as he would in the company of another noble.</p>\n<p>\"It is... quite alright.\" He said, hesitantly, as if he wasn't really sure it was. \"I understand this was my daughter's idea. Despite her blindness, she can be rather stubborn at times.\"</p>\n<p>\"I'm sorry about trying to steal from you too.\" Li added.</p>\n<p>Toph had to fight to keep her expression neutral. From the sound of his heartbeat, he didn't seem as sorry about stealing as he was about being caught.</p>\n<p>\"Yes, well,\" her father cleared his throat, \"-I have thought it over since last night, and I suppose in light of your young age, I can overlook this incident.\"</p>\n<p>\"Thank you.\" Li said, sounding honestly relieved. \"If you can return my swords to me, I can be gone quickly.\"</p>\n<p><em>Before you have cause to change your mind</em>, Toph mentally added for him. Not that he needed to worry- her father was a lot of things, but he wasn't the kind of guy who dragged a thirteen year old kid to the local guard just over some stolen fruit. It wasn't like he'd tried to kidnap <em>her </em>or something.</p>\n<p>Not that he could, of course. She'd totally wipe the floor with his scrawny ass.</p>\n<p>\"Very well then.\" Her father said, lifting a hand. \"Huan, retrieve the boy's swords.\"</p>\n<p>\"Actually,\" Toph chose then to interject, \"-I think he should stay.\"</p>\n<p>Her father turned to face her. She wasn't sure what a disapproving expression actually looked like, but she was positive that was what his face was set in. \"Toph, I do not think-\"</p>\n<p>\"But he has nowhere else to go!\" Toph insisted. \"We can't just send him out into the cold, can we?\"</p>\n<p>She knew how her father worked. If she didn't make her move now, didn't put her foot down, she wouldn't get another chance. And then it would be back to her boring, isolated life, with nothing but boring old men and giggling servants to talk to. Sure, Li seemed a little lacking in the whole <em>social graces</em> department- but at least he was proving interesting to talk to.</p>\n<p>Her father turned his head, presumably looking towards Li. \"Do you?\"</p>\n<p>\"I-\" Li began, only to quickly think better about whatever it was he'd planned to say. \"Yes.\"</p>\n<p>\"That's a lie.\" Toph said firmly, narrowing her eyes.</p>\n<p>What was his deal, anyways? She was trying to help him out here. Not many people were offered a deal as sweet as the one she was about to. Why didn't he just accept the favor and be happy about it?</p>\n<p>She felt her father shift on his feet. \"Well, I suppose I could see if there is anyone in Gaoling looking for an... <em>able-bodied</em> worker.\"</p>\n<p>Toph frowned slightly at that. She hadn't exactly missed that small hesitation before he'd deemed Li as <em>able-bodied</em>. Was there something wrong with him? From what she could tell, he seemed to have all his limbs in all the right places, and he could certainly <em>hear </em>her. She briefly wondered if he might be blind, before she quickly shelved the idea. He didn't <em>seem </em>blind- or like he was actually an earthbender who was doing the same thing she was. The way he held himself wasn't right for that.</p>\n<p>Which left her at a loss as to what could possibly be <em>wrong </em>with him. Maybe he was just skinner than she thought he was? She couldn't exactly get a solid read on clothing, but his did seem a little on the loose side, but she'd just chalked that up as it being slightly too big for him. His wrist had been bony, but it hadn't been quite <em>that </em>bony.</p>\n<p>\"Thank you.\" Li said quickly. \"But I really should be heading on.\"</p>\n<p>Toph narrowed her eyes. All she wanted was some company around here for once, so why was everyone being so dang stubborn?</p>\n<p>Well. It was a good thing <em>she </em>was stubborn too.</p>\n<p>Heaving a long sigh, Toph let her shoulders slump. \"Well, if you're really <em>that </em>insistent, I guess I'll just have to resign myself to wallowing in my own loneliness again.\"</p>\n<p><em>That </em>got a reaction. She felt her father shift on his feet, likely in discomfort- or guilt. Probably both. It had been a few years since she'd run away and hid in the caves where the badgermoles lived, but it was pretty clear her parents were still feeling the effects. Mostly it was just in the form of making sure there was a guard around the place twenty four seven, so she couldn't slip out again- it didn't do any good, but she wasn't about to tell them that- but sometimes it came out in different forms.</p>\n<p>Like occasionally acknowledging that she was actually <em>lonely </em>every now and again. It wasn't the first time she'd complained about it- it was part of why she'd run away in the first place, all those years ago. It was just that usually, her parents desire to protect her won out over any guilt they felt over keeping her so isolated.</p>\n<p>But something told her that was about to change.</p>\n<p>\"Well,\" her father slowly began, \"-I suppose perhaps we can come to <em>some </em>sort of arrangement.\"</p>\n<p>To the side, Li shifted uncomfortably on his feet, as if he'd just realized for the first time exactly what he'd gotten himself into.</p>\n<p>He had no idea what he'd gotten himself into.</p>\n<p>The sun was already dipping low over the horizon by the time he found himself back in the small room he'd been given last night. His swords sat sheathed in his lap, handed back to him what felt like a near lifetime ago- even though he knew it had only been a few hours since then.</p>\n<p>They'd <em>hired </em>him.</p>\n<p>Taking in a deep breath, Zuko pinched the bridge of his nose, trying to figure out exactly what had happened. He got up to the part where he'd been caught trying to steal fruit and had been dragged in front of the manor's lord- a man he now knew was named Lao Beifong, of the prestigious Beifong family.</p>\n<p>And that was where things stopped making sense.</p>\n<p>Because he'd broken into their house, and not only had they not had him arrested- they'd <em>hired </em>him.</p>\n<p>To watch their blind daughter, no less.</p>\n<p><em>Bodyguard </em>had been the official term they'd used, but he got the feeling <em>babysitter </em>would be more accurate. Who even hired a thirteen year old refugee to guard their daughter?</p>\n<p>At least, that was the story he'd given them when asked. He was a refugee, fleeing the war alone. It technically wasn't a lie- it wasn't like he could go back to the Fire Nation, and it was true that he had nowhere to go. He didn't exactly blend in- or at least, he thought he didn't. He was so sure that the nobleman- <em>Lao</em>, he should really try and remember his name seeing as he apparently <em>worked for him</em> now- had realized he was Fire Nation, but that didn't seem to be the case.</p>\n<p>Although, if he was going to be honest, the whole day had gone by in kind of a surreal blur, so maybe he <em>had </em>noticed and he'd just missed it. It was all he could do to just keep up with the absurdity of it all.</p>\n<p>He vaguely remembered being introduced to Toph's mother, Poppy- who'd taken one look at his scarred, disfigured face, and had decided it was a sign. She hadn't even needed to say what kind- he could tell, just from the pity in her eyes. That she thought the only person who could possibly feel at ease looking at him was someone who couldn't even <em>see</em>.</p>\n<p>He wasn't sure how he felt about that, either.</p>\n<p>Even then, he couldn't deny just how bad his own burn was. Maybe she was right.</p>\n<p>Dropping his hand from his face, he slowly breathed out. He didn't have to stay. They had given him his swords back, and they were the only thing that had been keeping him here in the first place. It would be better for everyone involved, himself included, if he just moved on.</p>\n<p>He didn't want to bring any trouble to their doorstep.</p>\n<p>But even though things had worked out for him in the end- for once in his life- the reality was that last night had been a very close call. If he'd made one wrong move, or the Beifongs were less merciful, he could have been hauled off to the guard, or worse. And if the guard recognized him as being Fire Nation... well, somehow he didn't think only being a child would have provided him with much protection.</p>\n<p>(And why should it? It wasn't like his people had any mercy on <em>their </em>children. It would be justified.)</p>\n<p>And then there was the girl. <em>Toph</em>.</p>\n<p>He knew... he knew what it was like to feel lonely. Isolated. Even if their circumstances were different, he couldn't help but see something of himself in her. It was obvious that she was desperate for someone to talk to, so desperate that she was willing to have that someone be <em>him</em>. Heritage aside, if he was going to be honest, he wasn't exactly the most social person around. That much <em>had </em>to be obvious from their interactions.</p>\n<p>And yet she almost seemed to <em>like </em>him.</p>\n<p>He huffed, almost in amusement. <em>That </em>wouldn't last long. Maybe the best option was for him to stay until she got sick of him, and sent him away. At least then, he'd leave with some actual money to his name- not to mention a full stomach, something he was starting to fully appreciate the value of. It wasn't like anyone was actually <em>looking </em>for him.</p>\n<p>If Uncle were here, he was sure he'd provide a suitable proverb for the situation. Something about not letting a rare opportunity slip away.</p>\n<p>But he wasn't, and Zuko couldn't think of a fitting one himself. All he could think of was the time Azula had taunted him, all smiles as she claimed that their father was going to kill him, and that maybe he should go find a 'nice Earth Kingdom family to adopt him'. He thought she'd been lying then.</p>\n<p>Now he wasn't so sure.</p>\n<p>Shoving that thought aside, he drew in a deep breath, making up his mind. Gaoling was far enough out of the way that it shouldn't be an issue if he stuck around for a month or two, especially if he never actually left the manor. Maybe he could use the time here to plan his next move. He would need to pick somewhere far from the war- if there even were any places like that left.</p>\n<p>Somehow he doubted it.</p>\n<p>He narrowed his eyes at the thought, guilt twisting his stomach. Not for the first time, he wondered if this was the real reason his Uncle had halted his siege on Ba Sing Se- not because cousin Lu Ten had died, but because he'd realized the truth, just as he had.</p>\n<p>The war had never been about spreading progress. It was about spreading <em>ruin</em>. It always had been.</p>\n<p>(The air nomads probably never even had an army.)</p>\n<p>Letting out a long breath, he felt the last ray of sunlight retreat beyond the horizon. His inner fire flickered in response, waning, but not going out.</p>\n<p>Not yet, at least.</p>\n<p>He might be a firebender who couldn't bend, afraid of his own element. He might be the enemy living in a land of people who hated his kind- and for good reason. His burn might still sting every now and then, still raw and healing, disfiguring and disabling him in the same breath, but he was still here. Still alive.</p>\n<p>After everything that had been done to him, he was still alive. And he'd <em>stay </em>alive.</p>\n<p>His father wanted him dead. That was the truth. But he was going to have to do a little better than mutilating his face and dropping him off in enemy territory alone if he wanted that to actually happen. The knife his uncle had sent him from Ba Sing Se read <em>never give up without a fight</em>- and that was exactly what he intended to do.</p>\n<p>He'd fight. He'd survive. And if that meant taking advantage of misplaced, unwanted pity, then maybe it was time to swallow his pride and accept it.</p>\n<p>Setting aside his swords, Zuko lay back against the thin mattress, staring up at the ceiling. Tomorrow he'd officially start his new (and still <em>utterly bizarre)</em> job, but until then... he'd try and get some much deserved rest.</p>\n<p>Recalling Toph's fierce, tooth baring grin, he got the feeling he'd need it.</p>"
}