{
  "id": "213786",
  "url": "https://archiveofourown.org/works/213786?view_full_work=true",
  "author": [
    "Aria"
  ],
  "title": "End Racism in the OTW | Shatter",
  "rating": "Explicit",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Thor (Movies)"
  ],
  "relationships": [
    "Thor/Loki"
  ],
  "characters": [
    "Loki (Marvel)",
    "Thor (Marvel)",
    "Jane Foster",
    "Darcy Lewis",
    "Erik Selvig"
  ],
  "additional_tags": [
    "Identity Issues",
    "Dreams",
    "Families of Choice",
    "First Time",
    "Norse Mythology - Freeform",
    "Podfic Available",
    "Alternate Universe - Canon Divergence"
  ],
  "language": "English",
  "series": "",
  "published": "2011-06-20",
  "completed": null,
  "words": "32,209",
  "chapters": "1/1",
  "comments": "297",
  "kudos": "14,296",
  "bookmarks": "2,777",
  "hits": "264,124",
  "summary": "<p>\"Loki,\" Odin says, heavy with disappointment and regret for all he has to raise his voice, \"Odinson. I cast you out.\"</p>",
  "notes": "<p>I've retitled this fic as part of an effort to call on AO3 to fulfill commitments they have already made to address harassment and racist abuse on the archive, and since <i>Shatter</i> has continued to cheerfully do numbers for over a decade, I hope posting about it here gets your lovely eyes on it! Read more, boost, and get involved <a href=\"https://www.tumblr.com/end-otw-racism/716978822501875712/\" rel=\"nofollow\">here</a>.</p>\n<p>Credit where credit is due: Amiel for hand-holding, cheerleading, feeding me lines, hanging around for hours multiple nights in a row to yell about all the Loki feelings -- in short, this fic would not <i>exist</i> without them. Wyn for saying smart, necessary things, and for making sure that my love for Loki didn't mean I was too nice to him. Olivia, as always, for forcing my structure to be better and for making the finished thing actually look good.</p>\n<p>CW: incest, weird and violent situations cribbed from Norse mythology, bits of dialogue taken straight from both the film and the shooting script, reasonable scientific concepts (mis)used for nefarious magical purposes</p>\n<p>I'm so delighted that people are still reading and reccing this! Many years later, I'm still very happy with it (and I stand by all of it except for That Bit With The Dry Ice, which I have been informed by more chemistry-minded people is <i>not</i> how dry ice behaves); if I don't manage to get around to replying to comments, know that I still see them all, and love that you're here with baby's first Thorki fic &lt;3</p>\n<p>Cyranothe2nd has also recorded a lovely <a href=\"http://amplificathon.livejournal.com/1434454.html\" rel=\"nofollow\">podfic</a> version of this story.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>",
  "text": "<p>Something in Loki is flawed beyond fixing. This is a truth.</p>\n<p>Loki did not always know he was flawed so. He spent a long and happy childhood listening to his father's stories, sitting content before the hearth in his mother's embrace, running through the shining city with his brother and their friends. When he was young he didn't understand that kneeling for hours on the shining road to Bifrost, staring at the shifting patterns and trying to create meaning from them, was wrong because it was different. It seemed to Loki that he was a piece of his father, and Thor was another: Loki was Odin's deep thought and quiet cunning, Thor his fearlessness and warrior's strength; opposite but equal.</p>\n<p>(Odin once told Thor a story: he lost his eye in battle with Laufey, a sacrifice gladly made for the peace and safety of Asgard and the Nine Worlds. Odin once told Loki a story: he lost his eye at the Well of Wisdom, giving it willingly in exchange for the understanding of sorrow and time and all great things. Both of these stories are also true. Perhaps they are one and the same, but as a child Loki did not guess this.)</p>\n<p>Loki is a fool.</p>\n<p>As he grew older he came to know that he was Thor's equal in nothing. All acts and feats being measured as one, his strategy in battle is no lesser than Thor's -- but on Asgard, the man who fights his enemies with a shouted challenge and a heavily-wielded hammer is a hero, while a man who fights with soft words and illusions is a coward. No one said so to Loki's face, because no one dared directly insult a son of Odin; instead they call him <i>silvertongue</i>, a backhanded compliment that twists inwards, devouring itself, and under the word Loki can hear another: <i>liesmith</i>. He knows he is flawed because he can hear that word.</p>\n<p>In order to create illusions, one must know truth. Perhaps the problem is that Loki knows everyone's secrets, and they can sense it, and that is why they are afraid. He knows that Hogun's mask of quiet is no mask at all. He knows that Volstagg eats so because he has an appetite for everything, but also the wisdom to channel it so he does not burn out from the excess. He knows that Fandral's dashing self-confidence is a thin veneer over the terror that he is nothing but a thin veneer. He knows that Sif is always a breath from finding that one cause worth dying for.</p>\n<p>He knows that Thor is solid through and through, all arrogance and boy-dreams of glory, false bullying sport disguised as valor, their father's worse half, not fit for kingship. But unlike everyone else, Thor has never learned to fear him.</p>\n<p>Loki is flawed beyond fixing because he cannot challenge Thor on Thor's own ground. Nor can Thor challenge Loki on his, but that is no fault of Thor's: a challenge for kingship should be made with swords or battleaxes. Thor does not know how to fight in sideways movements and calculated words. Loki does not know how to explain his terror of Thor's kingship without it sounding like petty jealousy. So he swallows his words, and with nowhere else to go, they poison him. Sometimes Loki feels as though in his heart's place there is living ice, and every secret he collects, every fear unspoken, every time he realizes anew that the Asgardians will never accept Loki as their king and have doomed themselves to a hotheaded fool, the ice in his chest splinters a little more.</p>\n<p>He doesn't know what he'll do if the pressure grows to shattering.</p>\n<p>*</p>\n<p>On the eve of Thor's coronation, Loki sits by himself and thinks. The sounds of merriment drift past him from a feast hall below, but Loki made his quiet excuses and bowed out early to come sit on this balcony. He can see the shining pillars of Asgard and the glittering road stretching to Bifrost and the sea, spilling into void and stars. Loki has left Asgard before, of course, taking the whirling way down to Midgard with its thousand diverse landscapes. But when Loki sees the stars, he burns to know every world, not just Earth. His father would understand. Thor would not.</p>\n<p>Thor.</p>\n<p>The problem must lie with Loki. When Thor goes on some hunt or adventure, he does what no one else will do, and treats Loki just as he does his other friends. Sif and the Warriors Three adore him, so if Loki sees arrogance where they see nobility, hotheadedness in the place of true courage, and the casual assurance that Loki will always be at his beck and call when they should share true comradeship, that must be Loki's affair.</p>\n<p>Still Loki dreads his brother's rule. Thor likes Loki, but not well enough to listen, not even when it might be desperately needed; and to be Thor's friend is at least to be Loki's associate, but not one of the Warriors Three nor Sif would listen to Loki, no matter if he tried to reason with them or to beg.</p>\n<p>He thinks for a moment on going to Odin, of kneeling, fist over his heart, and saying, Please, Father, reconsider; think of Thor's rashness, of his disregard for the thousand mysteries and truths that lie beyond his scope. Think of me. But even in Loki's mind the words grow cold and useless. Odin would ask why Loki did not speak out when the succession was first announced. Odin would point out that Loki is the younger son, that Thor is beloved of the people, and he would be right. Loki rests his arms upon the balcony, head bowed and hands clenching, examining this from every angle, looking for cracks. But he already has his answer.</p>\n<p>The only way to force his father to see the truth is through action.</p>\n<p>*</p>\n<p>Everything goes with beautiful precision. Odin senses the invading Jotun and stops moments from pronouncing Thor's kingship. In the vault a handful of guards lie dead, but the Destroyer has done its work: the ice casket is safe, the Frost Giants shattered. Loki folds his laughing smile inside a look of quiet serious concern, so practiced at being the solemn second son that nothing can shake him. Nothing, not even the moment when Thor, stung into rage, declares \"As King of Asgard --\" and their father snaps, \"But you're not king!\"</p>\n<p>The look on Thor's face is perfect. Confused, hurt, <i>alone</i>. Loki savors that look, taking it in to keep indelible in his memory, so that he might see it again whenever he needs reminding of what his brother looks like, stripped bare. Loki's doing.</p>\n<p>It only takes a short while for Thor's rage to return, of course. Odin leaves them in the vault, and Loki follows Thor, treading softly in his wake up to an abandoned feast hall. Loki stands behind a pillar and waits while Thor storms and shouts wordless oaths, smashing goblets and overturning tables. Triumph and pity war in Loki's chest. He wraps his arms close around himself and waits for Thor's tantrum to abate.</p>\n<p>When the world quiets, he comes around the pillar to find Thor slumped upon the steps. Thor straightens at once to Loki's approach, and says, looking away, \"It's unwise to be in my company right now, brother.\"</p>\n<p>This is why, for all that Thor is a boy and a fool, he is favored. He gives everyone fair warning, and would protect Loki from his wrath. This is why, for all that Thor is a boy and a fool, Loki settles beside him.</p>\n<p>\"This was supposed to be my day of triumph,\" Thor says. His voice shakes.</p>\n<p>It's all Loki needs. The laughter in his heart collapses in on itself; his own pain is quieted by Thor's. For this moment the balance between them is even, and so, when Loki says, soft and measured and understanding, \"It'll come, in time,\" it is not a lie but a hope.</p>\n<p>Then Thor's friends ruin everything.</p>\n<p>They stride into the hall, taking in the overturned tables and Thor's dejected frame, standing there in their armor like sparks waiting for tinder, and a half-dozen possible plans flee Loki's mind in favor of the obvious. Something in Loki is flawed beyond fixing because this moment is a turning point, the axis upon which the future rests, when he has caught Thor in a moment of rare pure vulnerability and he still has time to say the right words before anyone else can speak; but Loki sees Sif and the Warriors Three, and all he knows are the words that will catch that spark.</p>\n<p>He leans in. \"If it's any consolation,\" he says quietly, \"I think you're right -- about the Frost Giants, about Laufey, about everything.\" He is speaking low enough that Thor's friends, examining the ruined hall, might not hear. Thor is beginning to breathe too fast, the heady in-and-out drag before a fight. Loki's fingertips tingle. \"If they found a way to penetrate Asgard's defenses once, who's to say they won't try again, next time with an army?\" He waits for Thor's vehement agreement, and adds, \"There's nothing you can do without defying Father.\"</p>\n<p>Thor's face changes, from frustrated despair to revelation. The spark has caught.</p>\n<p>\"No!\" Loki says as Thor rises. \"No no no no no no, I know that look!\"</p>\n<p>\"It's the only way to ensure the safety of our borders!\" Thor declares, but he's no longer speaking to Loki; he's addressing Sif and Hogun and Volstagg and Fandral too, playing leader, playacting king.</p>\n<p>\"Thor,\" Loki says, discovering even as he speaks that the plea in his voice is real, \"it's madness.\"</p>\n<p>\"We're going to Jotunheim,\" Thor announces, and the ice in Loki's chest cracks a little more. He doesn't want to see how terribly, beautifully easy it is to speak a handful of words and effortlessly start some avalanche to ruin. He doesn't want to test Thor to treason.</p>\n<p>*</p>\n<p>Thor lives up to every damning expectation. He gives Loki the faint hope he might listen to reason before discarding it in favor of wielding his hammer with a savage satisfied grin. He fights fiercely, but in that selfish, guileless way he has, neglecting to watch his friends' backs because he carries the mistaken belief that they are as good as he, and for that both Fandral and Volstagg are wounded. When Odin comes down to Jotunheim, tall in his stirrups, shining with splendor, nearly too damned late, Thor the idiot raises Mjolnir high and shouts, \"Father! We'll finish them together!\"</p>\n<p>Loki has more than made his point concerning Thor's kingship.</p>\n<p>The worst of it is that he has no time for triumph, for disappointment, indeed for anything but a powerful whirl of confusion. The words Odin and Laufey exchange surely have grave import, but although Loki hears them, they mean nothing. All Loki knows is that Volstagg has a wound upon his arm, a hand-shaped iceburn from where he was seized by a foe, and that when Loki was seized the same way, his armguard shattered from the cold but the Frost Giant's hand felt like nothing but a hand, and Loki's skin turned Jotun-blue. All Loki knows is that, standing still now for parlay, even unwounded Hogun is shivering in his fur-lined cloak, while Loki, in cold metal and thin cloth, feels nothing but numb.</p>\n<p>Loki forces himself to focus in time to hear Laufey give a clear threat, if not a declaration, of war; Odin blasts him backwards, and the Bifrost catches them all up. The shining colors are too much. Loki squeezes his eyes shut and marshals himself for the aftermath.</p>\n<p>Then they are back in the warm bronze of Heimdall's observatory, lightning crackling out around them, and Odin is shouting everyone out. Loki stays, because he must. He must see what he has wrought.</p>\n<p>Thor is already yelling. \"There won't be a kingdom to protect if you're afraid to act! The Jotuns must learn to fear me, just as they once feared you!\"</p>\n<p>Odin stares down at Thor, clear-eyed, with the gravest disappointment. \"That's pride and vanity talking,\" he says heavily, \"not leadership. You've forgotten everything I've taught you. But a warrior's patient.\"</p>\n<p>\"While you wait and be patient,\" Thor cries, \"the Nine Realms laugh at us. The old ways are done! You'd stand giving speeches while Asgard falls!\"</p>\n<p>The numbness is melting away, and in its place Loki feels slow horror. Surely Thor knows policy, and would not be such a fool as to think Odin's long peace is cowardice or senility. Surely Thor's fury lies with the Jotun, not with his father. Surely.</p>\n<p>\"You are a vain, greedy, cruel boy!\" Odin snaps, beyond patience.</p>\n<p>\"And you are an old man and a fool!\" Thor shouts.</p>\n<p>The chamber echoes hollowly with their shock. Thor flinches just as much as Loki and Odin do; it is said in the heat of the moment, and cannot be meant. Words are not Thor's weapons -- he uses them in broad strokes, to build or to wreck, and does not understand their damage until it has been done. Loki's impulsive brother. Oh, Thor.</p>\n<p>\"Yes,\" Odin says finally, on a breath, with immeasurable sorrow. \"I was a fool. To think you were ready.\"</p>\n<p>In the pause before judgment falls, Loki knows that he has won. His silence, or a token protest at best, will seal Thor to whatever fate Odin has waiting for him -- restriction, confinement, powers revoked; Loki knows the Allfather's laws well enough, and can guess what might happen when Odin is incensed and has been disobeyed. Loki has made his point and will see his brother fallen.</p>\n<p>But something in Loki is flawed beyond fixing, because his moment of triumph has come and all he can do is destroy his work.</p>\n<p>\"Father,\" Loki says, and when Odin whirls upon him, hand outstretched to bid him to silence, Loki says, \"It was me.\" Odin's anger wavers; he is surprised out of his singular focus. Even Thor is staring at Loki now. Loki swallows hard on the tightness gathering in his throat and goes on, quiet, \"I told Thor he was right, that we needed to act. When he resolved to go I did nothing to stop him.\"</p>\n<p>Odin's shoulders slowly slump. \"Loki,\" he says, in a thousand shades of soft disappointment, and it is far worse than the shouting rage. When he turns back to Thor, he says, measured, \"Thor, you have betrayed the express command of your king. Through your arrogance, you have opened these peaceful realms to war.\" He holds out a hand, and Mjolnir flies to him from Thor's grasp; Odin holds it well, but it seems to weigh heavy. \"Until such time as you have learned to be worthy of your title and of this hammer, you are no more than any Asgardian, and confined to this realm. If you break my trust again, you will be cast out.\"</p>\n<p>Thor is breathing heavily, eyes wide with shock, his weapon hand still hovering uselessly by his side. He glances at Loki, and back to Odin, then squares his shoulders. \"Yes, Father,\" he says, and if his voice is still trembling with suppressed fury, he has wisdom enough at least to keep from striking out at Odin when he has been stripped of everything but his native strength.</p>\n<p>\"Go,\" Odin commands. Thor bows his head, fists clenching, and turns to leave; Loki makes to follow him. \"Not you, Loki,\" Odin adds, quiet, his voice bouncing back from the rounded walls and holding Loki in place. Thor wavers for a moment, looking back at Loki, and it is all Loki can do to offer him the twitch of a smile. Thor goes.</p>\n<p>Odin turns, Mjolnir still in hand, to stare down at Loki. By now all his rage has been replaced with sadness. But he says nothing, and the silence stretches until Loki knows he must be the one to speak first. Through the terrible pounding of his heart, the cut-short self-sabotaged triumph, the confusion at the moment his skin shifted without his command, the fear he feels under the weight of Odin's gaze, Loki pulls forth a seeming of sincere apology. \"I wish it wasn't so, Father,\" he says. \"I only meant to console Thor. If I had been more careful in my words, perhaps I could have talked him down, but you see how he is -- you know how he can be.\"</p>\n<p>\"Yes,\" Odin says. \"Somehow you did have time to alert a guard to Thor's plans. I wonder, could you have found me in that time?\"</p>\n<p>Loki's breath snags. \"I could not leave him to fight alone,\" he whispers. \"I would be no kind of brother if I did that.\"</p>\n<p>\"Instead you baited him, with Laufey on one end of the trap and me on the other,\" Odin says heavily. It is not speculation, but fact; Loki knows this. Loki learned long ago that the Allfather is immune to his speeches and deceits, whether by grace of godhood or simply because he is Loki's father. Loki can only lie to Odin with the truth, and even now he has failed.</p>\n<p>\"All I meant,\" Loki says in a rush, \"was to make you see that Thor is unready! I wish he was far less eager to war, truly I do.\"</p>\n<p>\"And the Jotun you led to Asgard, what of them?\" Odin asks. Loki is sure his face gives away nothing save innocent confusion, but Odin looks grim. \"There are only a handful of ways the Jotun could have come in, diminished in power as they are without their casket. When Heimdall told me they were hidden from him as you sometimes are, I knew.\" Odin leans heavily on Mjolnir. \"<i>Why</i>, Loki?\"</p>\n<p>Loki thinks of a half-dozen plausible lies in the space of a breath, everything from a dismissal of Heimdall to the revealing of a scheme to take Jotenheim out from the inside without an unnecessary spilling of Asgardian blood. Loki considers falling to his knees and begging Odin's forgiveness, of promising redress and all filial love. He knows, even now, all the strategies that will save him. But the ice in his chest is splintering, and when he speaks, it comes out harsh and cracked. \"<i>Why</i>? Why were you so eager to be blind to Thor's faults? Why did it take everything I've done today to get you to see how arrogant, how -- how willful and dangerous he is? Why is it <i>always</i> Thor --\"</p>\n<p>\"Enough,\" Odin says. Loki swallows, choking on the words. \"I've heard enough,\" Odin says, in the same tone of disappointment he had for Thor long minutes ago. \"I thought ... you might do great things. But there is nothing within you but jealousy and bitterness. Your desire for power has brought ruin to your brother and war to our doorstep. You are a danger to us all.\"</p>\n<p>By now Loki is taut and trembling, each word a fresh piercing blow. \"I take from you your power,\" Odin says, and Loki was expecting that, although he can't imagine how Odin will manage it, even if every one of Loki's spell books is confiscated. He feels no different for the pronouncement.</p>\n<p>Then Odin does something unexpected. He hefts Gungnir and slides it into the dock where he stands, summoning up the tree of lightning as the Bifrost hums up to life around them.</p>\n<p>In a flash of horror Loki understands.</p>\n<p>\"Loki,\" Odin says, heavy with disappointment and regret for all he has to raise his voice, \"Odinson. I cast you out.\"</p>\n<p>And before Loki has time to cry out a protest, he is falling into light.</p>\n<p>*</p>\n<p>He lands on his feet in the dark, and stands there for a moment, trying to remain upright through the shock. The whirl of the Bifrost lifts up from around him. Then something loud and heavy slams into him, and Loki hits the ground hard.</p>\n<p>Lying there stunned, beams of cold light cut across Loki's vision. Distantly he hears concerned female voices yelling to one another, and then one of the voices is very close, and saying, with heartfelt fervency, \"Do me a favor and don't be dead.\"</p>\n<p>With some effort Loki focuses. Hovering above him is a woman's face; she is about of Sif's beauty, but soft where Sif is all hard angles. The cold light shines through her hair, and when she sees Loki looking at her, she slumps with relief. Only then does she take her eyes from him. \"Where did he come from?\" she asks the world at large.</p>\n<p>The real question is, where did he come <i>to</i>. Loki stumbles to his feet, properly taking in his surroundings this time. The woman who addressed him scrambles up too, and away; Loki sees she is accompanied by another young woman, and a man of middling years, both of whom also back away as though Loki is something fearful. The cold light comes from their vehicle -- likely the thing which slammed Loki to the ground. He looks up, futilely, though it makes his head pound, but the Bifrost is gone; all that remains is a clear star-spanned night, with Midgard's constellations.</p>\n<p>\"Oh my god, Erik,\" the woman says, \"look at this! We have to move quickly before this all changes.\"</p>\n<p>Loki looks. Of course; the Bifrost left an imprint in the dirt. He stares at each whorl and cannot understand them. Only the immediate physical aspects of his predicament are registering. His armor is gone; all that remains are his boots, trousers, undershirt. His whole body aches from impact, and his mind is an awful blank hum.</p>\n<p>\"Jane,\" the man says, \"we have to take him to the hospital.\" He's watching Loki with wary concern. Loki wants to scream.</p>\n<p>\"I don't,\" he tries, and it comes out harsh and cracked with pain. He swallows and tries again. \"I don't need a hospital,\" he says. This time his voice is soft, so unthreatening that both women draw a step each towards Loki. It won't do to admit he has no idea where he is more generally than Earth, and a terrible weariness is crashing down upon him. \"I would ask upon your courtesy a place to rest until morning.\"</p>\n<p>\"Of course!\" the woman called Jane says.</p>\n<p>\"Jane --\" The man Erik.</p>\n<p>\"Darcy, I need -- you have the first aid kit?\" Jane accepts a box from the other woman. \"Go get the cameras. We need to document this circle pattern. Erik, please --\"</p>\n<p>\"All right,\" Erik grumbles, following Darcy back to the vehicle.</p>\n<p>Jane turns to Loki, the concern back on her face. \"Look, if we aren't taking you to a hospital, at least sit down in the back and let me make sure you don't have a concussion or something.\"</p>\n<p>Loki is too hollow to protest. He follows Jane to the vehicle, which has doors which swing open outwards and a compartment in the back that is comfortable enough for sitting. Jane takes a handheld light and shines it into Loki's eyes; he flinches and blinks, but lets her. \"Well,\" Jane says, \"your pupils are the same size, at least. Can you stay awake until we get back into town just in case?\"</p>\n<p>\"Yes,\" Loki agrees.</p>\n<p>Erik and Darcy return, climbing into the vehicle. Jane slams the doors shut, and Loki winces at the sound. Then the vehicle rumbles to life and sets off across the dark plain, rattling and bouncing over every rut. Loki holds hard to his seat and feels every stitch in the upholstery. It's as though his intellect has been torn out and the whole world is pouring in, so immediate it is scraping his skin raw.</p>\n<p>Jane keeps glancing sideways at Loki, but perhaps she sees something in his face; rather than addressing him, she leans forward and engages in some quiet, animated discussion with Erik. Loki knows well enough that listening might give him vital information he needs to navigate this world and deal with these people, but he cannot bring himself to care. He has been cast out.</p>\n<p>He has been cast out.</p>\n<p>Unbidden, Loki begins to shake. He still cannot marshal any thoughts, not even some distant voice of analysis to monitor his actions, though of course the uncontrolled trembling in his muscles must be shock. His body has never betrayed him thus, but it cannot possibly disobey when Loki isn't bothering to give orders. He bows his head and clasps his hands too tight together, the pain grounding him a little, and breathes to the rhythm of the rutted road and the flutter of his heartbeat.</p>\n<p>By the time the vehicle approaches the lights of a town, Loki has mastered himself. He straightens in his seat and sees a sign flash by in the dark: Puente Antiguo, a city of two thousand souls. They stop at the very outskirts, and Darcy hops out the moment the vehicle is still. The others follow, and so Loki climbs out too, and stands with his hands clasped tight before him.</p>\n<p>\"Late-night diner, anyone?\" Darcy asks. \"No <i>way</i> am I falling asleep after that.\"</p>\n<p>Jane looks over at Loki again. \"Maybe I should stay ...\"</p>\n<p>\"No.\" All Loki desires right now is to be alone. \"I would not want to inconvenience you. I only need rest.\"</p>\n<p>\"Okay.\" Jane chews on her lip. \"I guess you can stay in my trailer tonight, and we'll figure out what's going on in the morning. I'll just get you set up and you can get some sleep, how does that sound?\"</p>\n<p>Loki gives a slight bow of acquiescence, which for some reason makes Jane smile in that charmed, flustered way Loki can usually only call forth with a good deal more effort. \"Okay,\" Jane says, \"uh, follow me.\"</p>\n<p>She leads him across the road, which is paved now, and towards a very small dwelling, much smaller than any of the buildings that surround it -- indeed, it is not a building at all, but some kind of metal caravan. Dubious, Loki follows Jane inside. The light she calls up is so damnably bright that it takes him a moment to discover that the dwelling is no more than a few paces wide and scant more across, most of it taken up by a bed. At any other time Loki might have sneered at such a small offering, but now that bed is all Loki desires.</p>\n<p>He sinks down onto it and looks up at Jane. \"Thank you.\"</p>\n<p>Jane's brow wrinkles with worry, but all she says is, \"Of course! Feel better. And -- I'm so, so sorry about hitting you with the van.\"</p>\n<p>\"Think no more on it,\" Loki begs her, wanting only to be left in peace. Jane nods and ducks out quietly, leaving Loki in sudden soft darkness.</p>\n<p>He collapses back on the bed. The mattress is stuffed with cloth and held up by metal; it supports Loki like some alien creature, and he cannot find any comfort in it. He would give an eye of his own to be safe now in a bed stuffed with down and heather at Asgard, Thor snoring in ignorant contentment in the next chamber, this day's actions erased.</p>\n<p>Alone, with no one to hear, Loki curls up, clutching at the unfamiliar sheets, and breathes in moaning gasps, every one of Odin's words striking him anew. They build to screaming despair, but Loki has no one to rage at, no one to implore, and no means left to force it down. Instead he lies there, making helpless animal noises, and shakes himself to exhausted sleep.</p>\n<p>*</p>\n<p>Loki dreams he is in Odin's great hall. All the gods are sitting to feast, and Loki lingers in the shadows of a doorway, unsure of his welcome. At the long table Thor looks up in his direction, face lighting in a grin; but before Loki can return it, he is jostled from all sides, and turns to find Fandral, Hogun, and Volstagg standing with him. Loki tries to turn, but they back him into the corner.</p>\n<p>\"Please,\" Loki says. \"I must go to the feast. Father is expecting me.\"</p>\n<p>\"You'll try to talk him out of it,\" Hogun says.</p>\n<p>\"Things are far better now you're gone,\" Fandral adds. \"If you speak you'll destroy everything.\"</p>\n<p>Volstagg says nothing, but the needle he holds gleams in the torchlight.</p>\n<p>\"No!\" Loki gasps, and thrashes, but they hold him down as easily as they might a child. Over Fandral's shoulder Loki sees that every god in the feast hall is watching, with mild amused interest. He tries to scream out for help, but the needle pierces his bottom lip and stabs back out the top lip, a rough slither of thread following and red pain flaring in its wake. Again, through the bottom lip and out the top, Loki's mouth slanting shut; he convulses, sobbing, and the watching gods laugh. Through splinters of pain Loki sees Sif failing to hide a chuckle behind one hand, Thor grinning openly at the sport, even Frigga smiling her soft dimpled smile. Loki finds his father's face, and though Odin is the only one not openly full of mirth, his eye glitters with satisfaction.</p>\n<p>Loki screams again, scrabbling for the words that will set the world to rights, but he cannot open his mouth, and his voice has been sanded to silence. The gods roar with approval.</p>\n<p>\"Best idea I ever had,\" Thor says.</p>\n<p>Loki jerks awake. He is breathing in shredded gasps, his face wet. In the first glimmers of dawn through Jane's tiny window, he sees blood on the pillow, drops fallen from where he's bitten through his lip.</p>\n<p>\"Oh,\" Loki whispers, a cracked syllable of despair, and rises to clean the mess.</p>\n<p>*</p>\n<p>There is no question of sleep after that. Once Loki has staunched the blood, and gingerly touched his mouth enough to convince himself that the only wound comes from his own teeth, once his pounding heart has slowed, Loki emerges from Jane's abode.</p>\n<p>In the early hours of morning, the town of Puente Antiguo is still. Loki shuffles silently out into the street. Buildings sit before him, low rectangular structures on a regular grid. In the other direction is a stretch of red-brown desert, and above it a pale blue sky. Directly across from the place where Loki slept rises a structure that is less uniform than the rest of the town. It is open and circular, and atop its roof sits some kind of array. Loki stares up at the array and feels understanding just at the edge of his mind, but when he reaches for it, it slips away.</p>\n<p>Perhaps a closer look at the array will call up the memory. Anything is better than dwelling on his dream, so Loki makes for the round building. The glass doors that lead inside are locked, but Loki can slip through doors like air, and reflective surfaces make the best conduits for teleportation. Loki smiles a little, though it pulls at his lip, and steps forward.</p>\n<p>He bumps into the glass.</p>\n<p>Loki stumbles back half a step, astonished. He hasn't made so elementary a mistake since he was a boy. But slipping from one side of the glass to the other is easy. All he must do is ... twist the physics of it, make himself the reflection, make the reflection solid, and that is accomplished by -- by --</p>\n<p>He does not know.</p>\n<p>If he cannot remember, he can simply charm the lock; a child's spell. Loki places his hand upon the door handle and opens his mouth to whisper the syllables of incantation, but though he knows he has said them a thousand times, though he knows precisely the feeling of intention, the words in his mind are a blank.</p>\n<p>\"Damn,\" Loki whispers, letting his hand fall. In truth he knew from the first moment he failed to walk through the glass, but admitting it signals the death of yet another hope: Odin did not need to take Loki's spell books to strip him of his power. He merely took the knowledge from Loki's mind. Loki has no more magic than a mortal does.</p>\n<p>Jane finds him still standing there some time later, amid the long shadows of the just-risen sun. Loki has been carefully going over everything in his mind to find what has been taken from him, and has discovered that he remembers concepts but not mechanics -- he knows that certain words will coax an object from one state of being to another, but not what those words are; knows that gestures will dispel an illusion, but not what those gestures might be; knows that the Bifrost can carry him between worlds, but not the means by which this is accomplished. It is sickeningly frustrating.</p>\n<p>\"Morning,\" Jane says, coming up beside him.</p>\n<p>Turning, Loki gets his first good look at her in the light of day. She's still soft and pretty, more than a head shorter than him, but her chin tilts up and her stance is strong. Nor does she lose any of that air of determination when she takes in Loki's face, but there is genuine concern in her voice when she adds, \"Oh my god, what happened?\"</p>\n<p>\"A bad dream,\" Loki admits, touching his lip gently and wincing. \"Does it look as bad as it feels?\"</p>\n<p>\"Probably.\" Jane gives Loki a sympathetic smile. \"Want some ice for it?\"</p>\n<p>A flash of cold horror goes through Loki. \"No, thank you. But a meal would be most welcome.\"</p>\n<p>\"Oh, of course!\" Jane casts about for a moment, wavering between options, then says, \"Okay, cereal's a bad idea right now, so let's go get breakfast at the diner. Just give me a sec to text Erik and Darcy, and then I'll go over with you.\"</p>\n<p>Loki watches with interest while she takes out a small device and does something rapid and clever with her hands; perhaps Erik and Darcy have devices like it, and they can communicate over a distance. Midgard has achieved impressive things while Loki was not attending. Jane puts the device away and Loki falls into step beside her. They walk up the road.</p>\n<p>\"So,\" Jane says, \"we didn't get to properly introduce ourselves last night. I'm Jane Foster.\"</p>\n<p>\"Loki,\" Loki says in return, and cannot quite bring himself to add <i>Odinson</i>.</p>\n<p>\"Huh.\" Jane stops at a crossing of two roads, and waits while a few vehicles go by. Loki observes the various colored lights that stand above the roads governing the vehicles, and by the time Jane steps out across the pavement, Loki has worked out their patterns. On the other side of the road, Jane enters a building, and Loki, following, finds himself amidst a delicious mixture of scents. His stomach clenches with hunger he hadn't known was severe until this moment.</p>\n<p>Jane sits at a table, so Loki settles across from her and mirrors her gesture when she takes a sheaf of paper. By the time a servant comes for their orders, Loki has examined the offerings and feels some small comfort in calling for eggs, ham, and toast, though he doubts anyone in Midgard will make it to his satisfaction. Jane also tells the servant to bring something called coffee for both of them, and Loki is dubious until the first sip: he discovers it's hot and bitter and exactly what he needs.</p>\n<p>While they await their food, Jane leans forward and says, \"I hate to grill you like this, and god knows you've had a hell of a night, but could you tell me what it was like to be in the middle of that storm?\"</p>\n<p>Loki savors his coffee for a moment. Peering at her over the rim of his cup, he says, \"Why do you ask?\"</p>\n<p>\"Well.\" Jane straightens. \"Stop me if I'm not making sense; I know Darcy doesn't know what I'm talking about half the time because of the technical terms. The thing is, we were out storm-chasing last night because -- it wasn't storm-chasing, actually. We were out trying to observe meteorological anomalies -- magnetic storms. There are a lot in the desert around here, and with thermal imaging some of them show lensing that indicates the presence of a possible Einstein-Rosen bridge. I haven't collated all the data this morning, but the initial sighting probably means the storm you were found in was special.\" Their food comes, and Jane takes a moment to thank the servant before turning back to Loki. \"How much of this is making sense?\"</p>\n<p>Only some of it, but Loki hardly cares. The woman sitting before him has just demonstrated that she is possessed of a good intellect, sharp curiosity, and a set of as-yet unknown words by which she describes the world and sets it into order. \"If you might explain this Einstein-Rosen bridge,\" he says.</p>\n<p>\"A wormhole,\" Jane says. Loki stares at her blankly, waiting, and Jane's eyebrows raise. \"Basically, a black hole that has a different universe on each end, or two really different parts of the same universe. A way to travel faster than light. It's kind of complicated.\"</p>\n<p>\"No,\" Loki says. \"I like complicated. Please explain.\"</p>\n<p>Jane considers for a moment. \"Black holes are created when a supermassive star dies and collapses, right? The gravity of the collapsed star is so great it creates a singularity -- no light can escape, and after a certain point the laws of physics start to break down. Einstein wrote up all the equations for it, and if you follow the equations through to their logical conclusion, at the center of the hole time comes to an end --\"</p>\n<p>\"What are the equations?\" Loki asks. Jane looks skeptical, but he says, \"I will understand them,\" so Jane sighs and pulls over a napkin. She produces a pen from her shirt and, tearing the napkin's paper somewhat in the process, inscribes an elegant description calculating a singularity. Loki doesn't know which is better, the description itself or the fact that Jane knows it from memory, as a good sorceress should.</p>\n<p>\"So if you go further in,\" Jane says, writing out the next part of the equation as she does so, \"time should run backwards on the other side. The math works out, but ...\" She caps the pen. \"It's mostly theory. Black holes don't actually produce wormholes. On the other side, where time theoretically runs backwards, there should also be a reverse black hole -- it's called a white hole, and it generates matter and energy the way a black hole takes it in -- but it violates the second law of thermodynamics. Not only that, wormholes are unstable and they break Einsteinian causality.\" She gives Loki a wry look. \"Still following?\"</p>\n<p>\"Up to a point.\" Loki examines the equations for a moment, settling them into his memory, the first small act in taking back what is his. \"If it is only theory, what of your thermal imaging and your bridge?\"</p>\n<p>\"I've been ... looking at other possibilities,\" Jane admits. \"Some of the magnetic anomalies I've photographed show different stars on the other end -- different stars from what can be seen from our quadrant of space. That effect is probably generated by a wormhole, which means that somehow our upper atmosphere or something nearby is capable of supporting an Einstein-Rosen bridge for a short period of time. I still don't know if that means matter from other universes can get through, but light definitely can, and that's amazing.\"</p>\n<p>Loki is seized by sudden possibility.</p>\n<p>\"Matter can as well,\" he says quietly. \"The conversion of matter into energy, or energy into matter, is simple enough.\" He frowns at Jane's equations. \"And the problem of your unstable wormhole is solved easily enough by introducing some foreign matter into what you call the singularity -- once the way is properly paved, instability is of no consequence.\"</p>\n<p>\"Exotic matter,\" Jane says, staring at Loki in naked astonishment. \"Yeah, that's the theory.\"</p>\n<p>\"I'm unfamiliar with the system you use to describe these bridges of yours,\" Loki tells her. \"But were I to familiarize myself, I could explain it easily enough.\"</p>\n<p>\"You can write up an equation that definitely solves the instability problem,\" Jane says, her voice wavering between skepticism and hope, \"and explain the conversion between matter and energy?\"</p>\n<p>\"Yes,\" Loki breathes. He has lost the tools of description, not the theory behind them. \"If you have books which add depth to the ... equations, to these descriptions you've shown me, it would take me but a matter of days.\"</p>\n<p>\"This is crazy,\" Jane says, but she says it with a hint of delighted laughter. She downs the end of her coffee. \"Okay. Let's see what you've got.\"</p>\n<p>*</p>\n<p>It is not so easy as that. When Loki follows Jane back to her workshop, and receives the delightfully heavy pile of tomes that are her spell books, he is not free to settle in with them at once. First there is the matter of the images Jane and her colleagues captured of the Bifrost and Loki's fall. Jane arranges them on a board without looking closely at them, which affords Loki the opportunity to find a damning one of his fuzzy outline still midair. He sleight-of-hands it from sight before Jane sees it and remembers that she wanted answers to Loki's experiences inside the storm.</p>\n<p>When this is done, Loki is still not afforded an opportunity to closely study the books; Jane's colleagues arrive then, and introductions need to be made. Erik Selvig is a man of impeccable politeness and deep suspicion; within a minute of their introduction, Loki knows that he regards Jane as a daughter, that he harbors quiet secrets that will take some delving to discover, and that he will be Loki's fast friend if he believes Loki is dealing with him honestly. Darcy Lewis is even easier; she is a sunny, simple girl, full of bright interest, taking things as they come. It will hardly be an effort to keep these mortals where he wishes them, for as long as Loki chooses to remain in this town.</p>\n<p>Even when they have begun examining the images of the Bifrost and Loki is left to himself, he cannot devote all his energy to learning the system by which Jane describes the world. He arranges the books about him, and begins sorting through them, but he listens to the discussion taking place low-voiced behind him.</p>\n<p>\"So you're letting him look at your research?\" Erik asks.</p>\n<p>\"I figure, why not?\" Jane. \"He claims he can learn the fundamentals of astrophysics in a few days, great. If he's making it up or messing with me, he probably won't understand it anyway, and it's not like I'm working on some top-secret project. If he really can figure it out, <i>great</i>, we can use all the help we can get. And either way, he knows something about the storm he's not talking about, and I want to know what it is, so I'm okay with him sticking around for a little while.\"</p>\n<p>Erik heaves a sigh. \"Fine. But I don't want you or Darcy alone in the building with him. We don't know a thing about him. He's probably harmless, but I don't want to take chances.\"</p>\n<p>\"Of course,\" Jane says, and then, no longer in an undertone, \"Okay, look at this! Erik, this is <i>solid evidence</i> that whatever that storm was, some other quadrant of space was on the other side.\"</p>\n<p>Loki stops listening. If the situation becomes tense he will defuse it, but for the moment Jane seems willing enough to be strung along. In the meantime he goes methodically through Jane's books, sorting them by topic and degree of advancement. He wants to start with the ones that look most interesting, but he made that mistake as a boy, and more than one spell went awry or failed altogether for his impatience. Instead he begins with a book that details the theories and equations of a man called Einstein, and reads with great absorption for some time.</p>\n<p>Jane interrupts him with lunch and an offering in the form of more clothing, a little too big but otherwise acceptable; for the rest of the Midgardian day Loki sits there, reading and making notes as he goes. The material is fascinating but utterly foreign, less like decoding an unfamiliar language than like learning an entire new system of thinking. With a sinking heart Loki realizes that his boast to Jane of needing but a few days was exactly that, an arrogant boast. With time and patience Loki may one day understand these concepts well enough to describe them as Jane does, and from there learn to manipulate them and thereby reclaim his magic, but it will not be a matter of days. It may be a matter of <i>weeks</i>.</p>\n<p>He says nothing of his frustration. When Jane invites him to sup with herself, Erik, and Darcy, Loki accepts, and sits quiet and attentive at their meal. No one questions Loki's past or speaks of his future, and this suits him. After dinner, in the fading twilight, he makes a quick exploration of the workshop and surrounding town. Then he goes to Jane. \"I will no longer impose upon your lodgings,\" he tells her, \"but I would beg your indulgence to sleep on the roof of your workshop.\"</p>\n<p>\"Oh no, I can't let you do that,\" Jane says, alarmed. \"It's way too cold for that. We'll figure something else out.\"</p>\n<p>\"But I don't feel the cold,\" Loki says. \"Truly.\" It takes some time to convince Jane of his sincerity, and she still looks worried when she bids him goodnight, but her concern means only that she has taken Loki into her life. This knowledge is satisfactory, and it carries Loki into a dreamless sleep atop that round building under unfamiliar stars.</p>\n<p>*</p>\n<p>Over the next few days Loki busies himself with learning everything he can from Jane's books. More often than not he must go back and review basics: even the very building-blocks of such concepts as mass and gravity sometimes behave differently here than they do in Asgard. Loki is distantly aware that his struggle with the equations is a gift, as his frustration with the books before him leaves little room for the screaming despair he felt that first night. But this is small comfort.</p>\n<p>One evening before dinner, trying to apply what he thinks he understands of Einstein's equations to recreating the description of a black hole without referencing it, Loki completely botches the thing. It comes out such a terrible mess that Loki is visited with the creeping horrible suspicion that Odin did more than remove the specific memories of spells; it is entirely possible that he stripped Loki of his entire intellect and left him a bumbling fool with nothing but the delusions of his former prowess. Loki slams his fists down hard upon the table, slumping with defeat.</p>\n<p>\"Whoa, am I interrupting something here?\"</p>\n<p>Loki looks up slowly. Darcy is standing in the doorway, holding in each hand a white carton of what Loki has come to know as takeout. Darcy peers at Loki over her glasses. \"That's the first time I've seen you act like a human with feelings.\"</p>\n<p>Loki has no idea what to say to that. \"What do you have there?\"</p>\n<p>\"Food. I figured you might be hungry.\" Darcy seems to take this as an invitation, and comes over to him, handing Loki one of the cartons and perching on the edge of the table. \"So, you stuck?\"</p>\n<p>\"A temporary setback,\" Loki says, but it comes out despairingly.</p>\n<p>\"Huh.\" Darcy tilts her head, a curtain of hair obscuring her face before she tucks it behind an ear. She looks over Loki's sheaves of equations. Her mouth twists. \"I tell you what, I have no idea what any of this means. And you know what that means?\" She looks back at Loki. \"It means you're really freaking smart, and also totally crazy. You know how long it takes to get a degree in astrophysics?\"</p>\n<p>\"No,\" Loki admits.</p>\n<p>Darcy throws up her hands. \"Neither do I! Which means it is a <i>long-ass time</i>. You know how long it takes to get an undergrad degree in poli-sci? Four years, plus, like, summer credits. And then they let us dictate international policy and shit.\"</p>\n<p>Loki snorts delicately and opens his takeout. \"It is much like that where I come from as well.\"</p>\n<p>\"Uh-huh. But my point is, you're busy being crazy smart, so don't freak out if you get a couple of headaches.\" Darcy twirls noodles around her fork and slurps them up. It reminds Loki of Volstagg at mealtimes, and he feels an irrational twinge of homesickness, despite the fact that he does not mourn the loss of Volstagg from his life. \"So,\" Darcy says, \"what's the deal, then? With your home or whatever. I get that you're a private guy, but someone really did a number on you.\"</p>\n<p>Darcy's speech is sometimes more incomprehensible than a dozen of Midgard's equations. Loki merely eats and gives Darcy a blank look.</p>\n<p>\"I mean maybe you knocked your head really hard when the van hit you,\" Darcy says, \"or you had a bad breakup or something. But I bet it's family.\" She's watching Loki hard, but Loki's face does not so much as twitch. Darcy shrugs. \"It's cool. You don't have to say. And I know you'd probably rather talk to Jane or Erik about it anyway, because it's not like anyone takes me seriously, but I figured I'd let you know that I'm cool with it. If you did wanna talk.\" She busies herself with her noodles.</p>\n<p>How very strange. Loki had made no move to ally himself with Darcy, nor can he see what advantage his goodwill might give her. An easy companionship, something for nothing, is Thor's forte more than it has ever been his. But Darcy just admitted to knowing she is not taken seriously, and Loki thinks he hears the silent words nested underneath, whispering self-deprecation and reaching out for contact.</p>\n<p>So Loki ducks his head, murmuring, \"Thank you,\" and thinks he might mean it.</p>\n<p>*</p>\n<p>Darcy's talk gives Loki no miraculous breakthrough, but it does break the barrier Loki had without design set up to protect himself. Whether it was his unbidden fleeting thought of Volstagg or Darcy's mention of family is no matter; it remains that the frustrating equations are no longer enough to keep the rest of Loki's thoughts at bay.</p>\n<p>He is beyond the first wild anguish, of course, but as he tries to go to sleep that night the memories come pouring in. They are fragmented with shock, and no longer have any sound but the white noise in Loki's mind, but he can see Thor's face and Odin's, clear as pain. What he took for disappointment in Odin's gaze becomes something else now, a strange sort of self-recrimination. Regret. It must be that Odin finally came upon the truth that Loki has always known, that Loki is something broken; and Loki's next breath comes in a soft noise of torment. He clenches his teeth and stares fixedly up at Midgard's distant stars, but he cannot break the compulsion to revisit every moment in the Bifrost chamber. He tries to think of equations (<i>the square root of these, two times gravity times mass over the radius, is --</i>) but they collapse impossibly inwards and all he can remember is the confusion on Thor's face when he looked back over his shoulder at Loki. They had no chance to say goodbye. What might Odin have told him? That Loki had allowed the Jotun within a hand's breadth of their casket?</p>\n<p>Thor allows many things of Loki, but he will not forgive Loki that.</p>\n<p>At least Loki cannot know for certain that Thor thinks ill of him, and for once the uncertainty is a blessing: until Loki has concrete proof to the contrary, he can imagine that Thor believes him exiled merely for being the expendable prince and best gesture of good faith to the Frost Giants. But these are mere wishes in a world that seldom goes as Loki means it to, and Loki cannot hope to see Thor again without his brother watching him with open hostility. Midgard's stars blur and smear together in Loki's vision.</p>\n<p>Eventually the sky begins to pale, dew collecting on Loki's skin. It beads, shining like frost, and Loki's exhausted mind, balking from thoughts of Thor and Odin, catches on a different memory: Loki's armor shattering, Loki's hand turning Jotun-blue. Perhaps Loki's magic saved him from the cold burn that befell Volstagg. Perhaps it was but a trick of the light. But Loki cannot run any experiment to seek out the truth. Jotunheim is closed to him; the ice casket in the weapons vault is equally out of reach. He doesn't know what to do.</p>\n<p>Sleep, at least, is impossible. Loki drags himself downstairs to pore once again over Jane's books.</p>\n<p>*</p>\n<p>The question of the strange happening in Jotunheim torments Loki all morning, breaking his concentration more thoroughly than Jane and her colleagues can do with any amount of running about the workshop. Loki still cannot shake the feeling that he has become slow, and he cannot shake the feeling that perhaps his body has betrayed him just as thoroughly as his mind.</p>\n<p>Finally unable to stand it, he goes to the area of the workshop that has been set aside as a kitchen. He knows they keep an icebox there. When he opens the bottom door, it breathes out cool air, but only cool as autumn; the top section of the icebox feels like winter. Loki settles his hands inside the icebox, feeling no discomfort, and watches them for any sign of change.</p>\n<p>\"Hey,\" Darcy says, appearing at his elbow. \"Looking for ice cream?\"</p>\n<p>Loki stares at her.</p>\n<p>\"Okay, seriously, <i>ice cream</i>?\" Darcy actually shoves Loki aside and reaches in, pulling out a carton of something. \"Sit. Eat.\"</p>\n<p>Certainly Loki should feel great affrontry at this, but Darcy's well-meaning disarms him. He sighs, examining his hands; they are still pale, but no different, and certainly not blue. So he takes a seat and allows Darcy to serve him this ice cream. \"It's good,\" Loki says, astonished.</p>\n<p>\"Of course it is,\" Darcy returns, rolling her eyes. \"And it comes in at least thirty-two flavors.\"</p>\n<p>\"Good,\" Loki murmurs, bending all his attention to the food before him. How had they nothing of the kind on Asgard? He would gladly eat it and little else, though he hopes that some of those thirty-two flavors are savory rather than sweet, or the ice cream will eventually lose some part of its charm. \"Is it all so sweet?\"</p>\n<p>\"Uh huh,\" Darcy says.</p>\n<p>Loki frowns.</p>\n<p>At their lunch all together (of more substantial food, although all three mortals have ice cream of their own) Loki says, to the table at large but particularly Jane, \"The physics I have been studying describes but one aspect of the function of things. If I applied physics to the bowl of ice cream, I could make it float, exchange it for some equal object far light years away across the universe, or turn it from matter to pure energy. But I could not do something so simple as change its taste. How do you describe the composition of a thing?\"</p>\n<p>Darcy and Jane both stare at Loki in astonishment. Erik frowns and, after a moment, says consideringly, \"You want to know about chemistry.\"</p>\n<p>\"Chemistry,\" Loki repeats.</p>\n<p>\"Yeah, that might be it,\" Jane nods. \"Chemistry is about elements and compounds rather than particles.\"</p>\n<p>Elements. Loki was but a child when he mastered the manipulation of water into ice and vapor, and though he doesn't remember the necessary words or gestures now, only the whispered intent, he has hope again. \"Do you also have books of chemistry?\"</p>\n<p>\"No, but I'm sure the local library has them.\" Jane hesitates. \"But don't you have enough on your plate already?\"</p>\n<p>\"To dwell too much upon one topic is to exhaust the mind,\" Loki tells her. \"The library, if you please.\"</p>\n<p>*</p>\n<p>The concepts in chemistry are just as foreign to Loki as the ones in physics are, but perhaps Loki has become somewhat accustomed to the strange way Midgardians frame their thinking, or perhaps in this field they are more aligned to the Asgardian way; in either case, an afternoon with the chemistry texts and Loki is already reassured that he has not, after all, lost his intellect.</p>\n<p>Through that night and all the following day, taking breaks when meals are foisted upon him but otherwise ignoring the activities going on around him, Loki divides his time between chemistry and physics. When Jane bids Loki goodnight and ducks out, leaving his the only lamp burning, he murmurs something vague in return and reviews with feverish intensity the notes he has created. There will be no miraculous breakthrough tonight, but Loki looks at the equations and they <i>fit</i>, the way he remembers spells settling into his mind when he knew them well enough for use.</p>\n<p>He falls asleep at the desk and dreams in strange fragments. In one, he explains the properties of frozen carbon dioxide to the Warriors Three, and Hogun wants to know why Loki did not then burn, but Loki has no answer. In another, Odin sweeps into Loki's chambers in Asgard and gathers together all of Loki's books; Loki shouts at him that the books are Lady Jane's, or borrowed from the library, but Odin ignores him and Loki resorts to hurling baseless abuse at his retreating back.</p>\n<p>In a third Thor sits with Loki under the Midgardian sky and says, \"I am glad you are happy.\" Loki stares at him in astonishment, but before he can correct his brother's error, Jane is shaking him gently awake.</p>\n<p>Loki blinks up at her, and Jane gives him a smile. \"Sorry to wake you up like that,\" she says softly. \"But it didn't look comfortable. Were you here all night?\"</p>\n<p>\"I must have been.\" Loki yawns and straightens, wincing.</p>\n<p>Jane pulls up another chair and sits down next to him. \"Loki. Are you doing okay?\"</p>\n<p>\"Yes.\" Loki searches her face, but he is still too tired to work out the intent behind her question. \"I am closer now,\" he offers, \"to the equations you seek.\"</p>\n<p>\"I'm glad to hear that,\" Jane says, leaning forward earnestly, \"but you staying around doesn't depend on whether you miraculously explain how we can be getting Einstein-Rosen bridges in the sky here, or anything like that. You don't get in the way like Darcy does, and I think even Erik's figured out that you're eccentric but you're not crazy.\" She twists her hands together. \"But I do want to know what you experienced in that storm, and I want to know where you came from. Just give me anything, okay?\"</p>\n<p>Loki nods. The question is fair. \"I have been ... turned away,\" he says. \"My brother is a rash man, and was not ready to take on the duties expected of him. When our father discovered this, he took me to task for my brother's errors. For not keeping him better. I suspect it was politically expedient for my brother to remain at home, and I -- I am not sure if I am my father's son by birth. Perhaps it was easy for him to cast me out.\" Speaking the words like a story, like a lie, makes them blessedly unreal. Still, Loki can feel the sting of tears pricking his eyes, and he uses that, gazing tremulous at Jane. Her mouth is a little open, her brow creased with concern. Good.</p>\n<p>\"He took all my research,\" Loki goes on. \"Years of notes, formulas, equipment -- gone. He did not allow me to have them. And I think the knock I took from your van compounded the problem, but I do not blame you, Jane. It is the greatest of blessings that I chanced upon another scientist.\"</p>\n<p>\"Oh,\" Jane says. \"I -- I'm sorry to hear that. I mean, I'm glad we ran into each other, even if it was literally, but ... Your dad. That's awful.\" She gives him a small smile. \"Thank you for telling me.\"</p>\n<p>\"You have been kind,\" Loki tells her. \"It is the least I could do,\" and finds that the tears don't wish to leave his eyes. He blinks rapidly and turns back to the desk. \"Now,\" he says, \"I think I understand this material well enough to propose a solution to the problem of bridge instability. I'm still far from implementing it, but it should be theoretically sound.\"</p>\n<p>\"Okay.\" Jane draws her chair in. \"Show me.\"</p>\n<p>*</p>\n<p>Loki's proposal excites Jane. Loki is half sure that she's merely being kind, but when Erik arrives and Jane shows him Loki's equations, Erik gets very excited too. The equation is nothing, merely the best way Loki knows how to translate what he remembers of the Bifrost's workings into Midgardian physics, but when Loki shrugs and says, \"I realize it's not much --\" Erik turns to him and retorts, almost indignantly, \"Not <i>much</i>? No one else has done this!\" Loki can't help preening a little.</p>\n<p>All their meals are distracted affairs that day, and Darcy stays out of the way. After dinner Jane retrieves the small black book where she keeps her personal notes, and says, vaguely, \"I'm just gonna ...\" before wandering out to the roof. Loki stands, thinking to follow her, but Erik catches his arm.</p>\n<p>\"She goes there to think,\" he tells Loki. \"Leave her to it. You've given her a lot to think about.\" Loki nods, and Erik regards him thoughtfully for a moment. \"Let's go get a drink,\" he says.</p>\n<p>Loki flushes with pleasure. In some strange way Erik is an anchor to home; he does not speak often, but when he does, he says familiar words. On Asgard, a celebratory drink with the older warriors is customary after a victory in battle; here, Erik will do the same for his equation. So Loki fetches his coat and follows Erik into the evening.</p>\n<p>The bar Erik leads them to is dimly bronze-lit in a way that reminds Loki of the lesser feast halls at home. It is that more than anything that leads him to down his first drink so quickly, but Erik seems willing enough to call for another round. Then he turns in his seat and squares up to Loki in a way that is determined but not threatening. \"What you've done today,\" he says, \"it was impressive.\"</p>\n<p>\"Thank you.\" Loki tilts his glass at Erik.</p>\n<p>\"You're exactly what Jane's been looking for,\" Erik goes on. \"I find that very convenient, but I'm not complaining. I don't know what you're here for, but I don't think it's to hurt her.\"</p>\n<p>\"Never,\" Loki assures him. He can think of no reason for this word to be anything but the truth. \"I am only searching for answers, as she is.\" Erik's face softens a little. He nods. Loki stares down into his glass and back at Erik. \"Your concern ...\"</p>\n<p>\"For Jane?\" Erik actually smiles. \"Her father and I taught at university together. He was a good man. She's like a daughter to me.\"</p>\n<p>It is as he thought. Loki nods. To Erik, family is not a matter of blood: it is a web of alliances, matters of trust. He envies Erik that easy fiction, and is more grateful than he should be when Erik orders them a third round. Loki downs this quickly too; the pressure in his chest can be drowned in drink if equations are not sufficient. Erik shoots Loki a look of some concern when Loki demands a refill from the barkeep, but does nothing to stop him.</p>\n<p>The reason becomes apparent some time later; Loki's limbs are heavy, his head light, and Erik says, casually, \"So what were you doing in that storm?\"</p>\n<p>As though Erik Selvig can outsmart him. Loki laughs, and inside his head it is cracked, but when it reaches the air the sound is sweet and quiet. \"I was lost,\" he says, the words slurring not at all. \"The storm came upon me suddenly.\"</p>\n<p>Erik sighs. \"Fair enough. Come on, let's get you home.\"</p>\n<p>Loki does not want Erik's support, but neither can he summon the energy to fight off the well-intentioned arm Erik wraps around him. He suffers to be led out of the bar into the quiet street. The stars overhead spin gently, and Loki knows that if only he can find the right words, he might whisper the ground into releasing him, and so fall up into the endless sky. Instead he staggers against Erik, tethered.</p>\n<p>\"Y'know,\" Erik says, \"there were stories I knew growing up about a trickster with your name. Loki.\" Loki is too boneless to tense, but the wandering quality to Erik's speech means he might not notice regardless. \"I liked him. He got his hands dirty. Did things the other gods didn't want to do, and didn't care if he looked foolish doing it. You remember that, hey? Make mistakes.\"</p>\n<p>Laughter spills out of Loki again, unbidden. \"I have,\" he says. \"I will.\"</p>\n<p>\"Good.\" Erik stops before the glass doors of the workshop. \"Can you get to the roof by yourself?\"</p>\n<p>Loki considers this. The stars still spin, but his feet are steady. \"Yes,\" he says. \"Good night, Erik.\"</p>\n<p>\"Good night, Loki,\" Erik returns, clapping Loki upon the shoulder, and turns back to the night. Loki fumbles with the door handle for a moment, but the door swings open. Inside, the workshop is quiet and shadowed; the icebox hums quietly. Loki hesitates in the middle of the open floor. Families are made, and families are broken. He has made mistakes, and he will, dirtying his hands, confessing to himself even if Odin could not do it for him. Loki goes to the icebox, and finds what he hoped to find: a carefully sealed container that meant nothing to him but a few hours ago, before he began to read chemistry texts.</p>\n<p>Liquid nitrogen.</p>\n<p>It must be for one of Erik's experiments. It is no matter; Loki removes it from the icebox, and at the sink he pours it over a metal spoon, then taps the spoon sharply against the counter. It shatters just as Loki's armor did. Satisfied, Loki rolls up his sleeve and pours a careful splash over his forearm. It feels like cold water.</p>\n<p>\"Loki, what are you <i>doing</i>?\"</p>\n<p>He looks up to see Jane standing in the doorway, half in shadow, her eyes wide with horror. Loki sets the nitrogen container carefully aside, and looks back down at his arm with the slowness of a dream. The skin there is blue, fading slowly back to pale. Loki struggles to find his voice. \"I may be cursed,\" he whispers.</p>\n<p>As though the words have freed Jane, she rushes over and seizes Loki's arm, turning it gently this way and that. Her face lifts to his. \"I -- I don't understand.\"</p>\n<p>\"I don't either.\" It is suddenly very important that he sit down, and since no seat is convenient, Loki simply sinks to the floor. Jane kneels beside him, still clutching his arm. Loki's head falls back, and without warning he is doing his best to swallow bewildered tears. He cannot be Asgardian. But surely it cannot be that Odin had cast him aside after Loki had outgrown the Allfather's uses. No father could be so cruel. No.</p>\n<p>\"No,\" Loki moans, and turns, burying his face against Jane's small shoulder. She wraps her arms about him and murmurs soothing nonsense lies, because now that Loki has unlocked this secret, nothing will ever be right again.</p>\n<p>\"Let's get you to bed,\" Jane says finally, and Loki, half asleep with drink and misery, allows himself to be led to Jane's bed. He falls asleep with Jane sitting next to him, gently touching his hair.</p>\n<p>*</p>\n<p>When Loki wakes, he doesn't dare open his eyes. The shame will be terrible whether or not Jane is still there. He is cursed with a throbbing headache, and a sick twisting in his stomach that has less to do with drink than with his terrible new knowledge. Loki is fatherless.</p>\n<p>He tries to move beyond this thought, but his mind refuses, circling it like carrion. Loki is Jotun. Odin cast him out because, in allowing Frost Giants access to Asgard, it must have looked very much as though Loki was returning his allegiance to his own people. Perhaps he <i>was</i>. Perhaps the thing that is flawed in Loki is that, under his Asgardian seeming, he is a monster and a traitor even to his own will. He is <i>wrong</i>.</p>\n<p>A noise; Loki jerks upright without meaning to, and thus cannot feign sleep when Jane leans in through the door. Jane's trailer seems even smaller than it did that first day; Loki shrinks back against the bed. Jane comes in, moving carefully, holding a covered plate that smells sickeningly of breakfast. She sets it on her little table and comes to sit gingerly on the edge of the bed, avoiding Loki's gaze as though he is some frightened animal. \"May I look at your arm?\" she asks softly.</p>\n<p>Loki holds it out. Jane runs careful fingers over his unblemished, lying skin. \"I don't understand,\" she whispers, just as she had the night before, and looks up at Loki. \"How is this possible?\" Loki stays still, head bowed. \"Loki, <i>please</i>,\" Jane says. \"Please talk to me. I just want to understand.\"</p>\n<p>She deserves something, for holding him and for not looking at him with pity now. But Loki has nothing left to give. The ice in his chest has frozen solid again, creeping upwards and seizing his throat. Besides, if he could speak, what would he say? Loki cannot admit he is a traitor. Loki does not even know if he remembers how to speak the truth; he sees it, but it comes out flawed and twisted, because all of Loki is a lie.</p>\n<p>\"Well,\" Jane says, soft and disappointed, \"I brought you breakfast, and there're mugs in the cupboard if you want some water.\" She stands and slips out.</p>\n<p>After a long while Loki gets to his feet and pours himself some water from the tap. He stares at it unseeingly and thinks of how the first spell he mastered was blowing gently on water and causing it to freeze; a clever trick. Loki tries it now, but the water merely ripples. So he drinks it, if only to dull the pounding in his head.</p>\n<p>He cannot bring himself to eat, though, and instead returns to the bed and sits there, curled in on himself. He wonders if it is a curse after all, if in betraying the house of Odin, even in some small way, to see if he could, to halt Thor's day of triumph, he has brought down some awful spell that makes him like those enemies he let in. The terrible thing is that Loki wishes it so. Then it is his own fault; then he still has a father and mother and brother; then he is Odin's son, not his -- his spoil of war.</p>\n<p>What did Odin <i>want</i> him for?</p>\n<p>And so it goes. Loki cannot settle on any one thought or explanation, and that is a terror all its own. He'd thought, on coming here, that he had nothing left; but it appears that he never had anything to begin with. His mind grinds to a helpless halt.</p>\n<p>Someone knocks on the trailer door.</p>\n<p>Loki makes no move to answer, and after a moment, the door swings open and Darcy sticks her head in. \"Hey,\" she says, and when Loki does nothing, she steps inside and leans against a wall, looking at Loki consideringly. Finally she says, \"If you're an alien, you don't have to worry about us experimenting on you or, like, turning you over to the government.\"</p>\n<p>She waits for a response, but Loki merely watches her with disinterest. \"Or if you're a godlike extradimensional being,\" Darcy adds. \"Pretty much no experimenting or turning you over to the men in black, period.\" She bites her lip. \"Jane's pretty freaked, though. Not of you or anything, just about you. Please come out?\"</p>\n<p>Loki turns away and stares unseeingly at his deceiving hands. Darcy's kindness deserves a better recipient than a fatherless monster. \"Well,\" Darcy says. \"Feel better.\" She retreats.</p>\n<p>A weak part of Loki wants to call out to Darcy and beg her to stay with him, no matter how undesirable his company. But Loki is already being dragged down into his thoughts again, though they are no longer circles, but cold lines: of course Odin always favored Thor. Even if Thor had been entirely weak and stupid Odin would have favored him, for there is no question that he could have a Frost Giant on the throne of Asgard. Of course, too, everyone treated Loki politely and feared him when his back was turned. Whether they all knew he was Jotun or merely sensed it is of little consequence, for the result was the same, but Loki cannot stand to think that the Warriors Three, or Sif, or worst of all Thor, knew and said nothing. That cannot be. Thor cannot have known, or Loki would have read it in his face long ago.</p>\n<p>Perhaps Thor still lives ignorant of his false brother's lineage. Loki finds himself clutching at that hope like a man with no foothold above an abyss.</p>\n<p>When Erik comes in, it is without knocking, and he carries an offering of food. He doesn't leave it with the abandoned breakfast, but takes it over to Loki, sets it in front of him, and says, firmly, \"Eat.\"</p>\n<p>Loki does, though it sits heavy in his hollow stomach. In a just world his acquiescence to the food would have been enough, and Erik would leave him, but Erik stays. He doesn't speak until Loki has cleared the plate, and then he sits down on the bed beside Loki and says, \"Jane says we should leave you alone and let you deal with whatever it is. But I don't think that will do any good.\" He looks sideways at Loki, who stares back impassively. Erik chuckles ruefully, shaking his head. \"I always imagined you with red hair.\"</p>\n<p>\"What?\" Loki says involuntarily.</p>\n<p>\"Red hair,\" Erik repeats. \"I don't know why now. Maybe it was in a book I read as a child. But that doesn't matter. What matters right now is that I have Jane and Darcy out there coming up with theories about you, and the one they can agree on is that you're the real Loki, and you were sent down by storm from Asgard. You have anything to say to that?\"</p>\n<p>With effort, Loki shrugs. \"It hardly matters.\"</p>\n<p>\"Like hell it doesn't matter,\" Erik says. \"I don't know if they're right, but I do know that you didn't listen to a word I said last night. Don't you disappoint me by making a mistake and not picking yourself up again afterward.\"</p>\n<p>\"It wasn't,\" Loki tries. His voice breaks. \"It wasn't last night. My great mistake was more than a week ago, or -- or much further back than that, and not my mistake, my father's. I don't know.\"</p>\n<p>\"Well,\" Erik says, his voice twisting into wry humor, \"if your father's Odin, he's made his mistakes too and it's not his way to be punished for them.\"</p>\n<p>Loki stares at him in astonishment. This is an entirely new viewpoint. \"I see,\" he says. \"Thank you for lunch, Erik. If I might have some short time to myself.\"</p>\n<p>Erik nods, standing. \"Dinner's at six,\" he says.</p>\n<p>After he leaves, Loki sits quiet but no longer despairing. These mortals are as loyal to him, it seems, as ever the Warriors Three were to Thor. He has before him all the tools of this world's magic, for all he is still learning how to use them. He does not have Asgard, but neither was he thrown to Jotunheim. There may be something for him still, no matter that for the first time he has no idea what it should be.</p>\n<p>At six Loki emerges and crosses the road to the workshop. Erik and Darcy, it appears, have been making dinner while Jane collates data; the scene is familiar, and it tugs a small fleeting smile from Loki. When he appears in the kitchen everyone goes very still. Loki tucks his hands in the pockets of his jeans and says, softly, \"I am sorry for my behavior today, and whatever I have done to alarm you. I would ask that you give me no questions tonight; I am tired.\" He sees the naked disappointment on Darcy's face, the better-concealed disappointment on Jane's, and adds, \"It is not that I will answer your questions never. Just not tonight.\"</p>\n<p>\"Thank you,\" Jane returns quietly.</p>\n<p>\"Ooookay,\" Darcy says. \"Dinner's served, guys.\"</p>\n<p>*</p>\n<p>In the morning Loki wakes no worse than he has a dozen other days in this place. He feels lighter, and knows that at any moment it might all come crashing back, so he will enjoy this small freedom as long as it lasts. Coming down into the workshop, he is occupied with the extrapolations for his equation, thinking to run them by Jane over breakfast. Entering the kitchen, he freezes.</p>\n<p>Standing by the counter, speaking with a visibly flustered Jane, is <i>Thor</i>.</p>\n<p>Thor looks over at Loki at once, and his face lights in a beaming grin. \"Brother!\"</p>\n<p>Any word but that. The weight of dread falls so heavily upon Loki that his legs nearly buckle; but he still has mastery of himself, and he knows he pales, but otherwise remains composed. Jane seems fragile standing beside Thor, who looks outlandish in his armor, colored too brightly by some light from within. He hurts Loki's eyes. For a moment Loki is afraid he cannot bear it, but he has already borne much worse than anything Thor can offer.</p>\n<p>\"Thor,\" Loki says coolly, padding into the kitchen. \"I hope you haven't been alarming Lady Jane.\"</p>\n<p>\"No,\" Jane says, quiet and steady. \"I'm okay. Thor was just introducing himself.\"</p>\n<p>\"Indeed.\" Loki meets Thor's eyes; Thor looks back at him with confusion, as though he really expected some warmer reception. Perhaps he expected Loki to fall gratefully into his arms. Loki's lip curls slightly. \"Come outside, Thor. We should not impose.\"</p>\n<p>\"Of course.\" Thor bows over Jane's hand in courtly farewell. Jane allows this, though she throws Loki a bewildered glance. She looks more pleased with Thor's attentions than Loki likes, so he turns on his heel and goes swiftly outside.</p>\n<p>Thor joins him. The clear morning light turns Thor's eyes impossibly blue, his hair impossibly gold. Loki is suddenly aware, as he has not been for days, of his worn jeans, dirt-scuffed boots, old green sweater; faded, dingy, low. Thor stands easily at Loki's side, as though his place there is still assumed, and Loki is aware, too, of how little space there is between them. \"Tell me,\" he says, looking out at the desert rather than meeting Thor's earnest gaze again, \"what are you doing here?\"</p>\n<p>\"I've been trying to come for days,\" Thor replies, as though it is the most obvious thing in the world. \"Heimdall would not let me through until now.\"</p>\n<p>\"And what was it that changed his mind?\" Loki asks. Inside, everything is very steady and still, Loki's pulse thrumming in his fingertips.</p>\n<p>\"He watches you,\" Thor says, low, and turns closer still so that Loki must look up and meet his eyes. Thor looks much more serious than is his wont. \"I do not know what he saw, but this morning when I went out to the Bifrost and asked leave to go to you, Heimdall said he would let me pass, because you are in need of help.\"</p>\n<p>Loki laughs and slips away. \"From <i>you</i>?\"</p>\n<p>\"Of course,\" Thor says, following. \"I will not abandon you.\"</p>\n<p>This is intolerable. Even yesterday, Loki would have gone to all necessary lengths to persuade Thor to take him back to Asgard, so that he might beg Odin for forgiveness and promise every possible repentance. Now all Loki wants is for Thor to leave without discovering anything. \"I thought you were forbidden to leave Asgard,\" he says. \"Are you trying to get Father to exile you too?\"</p>\n<p>\"I told him to,\" Thor says bitterly. Loki turns and stares at him in astonishment. Thor is glowering. \"If you were exiled for disobedience then I should be too. Father thinks it was <i>your</i> doing we went to Jotunheim, and when I told him you'd tried to stop me, he called me a fool.\" Thunder rumbles in the distance. \"I thought Father knew better.\"</p>\n<p>\"Knew better?\" Loki repeats blankly.</p>\n<p>\"Than to distrust you as the ignorant do!\" Thor cries. He seizes Loki's stiff shoulders. \"With you gone, nothing is right in Asgard.\"</p>\n<p>Thor is the worst sort of fool. Loki shrugs his hands off violently. \"You mean with me gone you have no one to outshine,\" he snaps. \"Father's finally found the time to take issue with <i>your</i> many faults.\" The flinching hurt on Thor's face tells Loki that the words have struck home. His vision goes white-edged with rage. \"You came running because it pleases you to see me here in the dirt.\"</p>\n<p>\"No,\" Thor says, \"brother --\"</p>\n<p>\"<i>Stop calling me that</i>!\" Loki screams.</p>\n<p>Thor stills in astonishment. \"Loki.\"</p>\n<p>\"I am not your brother,\" Loki snarls. Everything is so cold. \"Go to Odin and see if he prefers to tell you truths you have not wits to hear or if he would rather hold to that lie about his second son. Ask him what he took from Jotunheim that day. See if your warrior's pride demands that you be exiled with a monster.\"</p>\n<p>\"Loki, please,\" Thor says. \"What madness is this? Tell me straight what you mean to say.\"</p>\n<p>\"Go,\" Loki tells him. But that will not be enough, so he steps up to Thor, and reaches out, hand hovering near Thor's face. There is the old feeling of lightning between them. \"Please, brother,\" Loki whispers.</p>\n<p>Thor's eyes are overbright. \"I will be back for you,\" he says. \"I vow it.\"</p>\n<p>Loki laughs, dropping his hand. \"Do not make false vows, Thor,\" he says. \"Farewell.\"</p>\n<p>Thor hesitates a moment longer, but then he goes, striding off into the desert with his cape a bright shout streaming behind him, because Thor always listens when Loki's words have the power to destroy them. Loki stays standing very still, watching his last false hope dwindle into the distance, and does not turn when he hears Jane's soft tread behind him.</p>\n<p>\"So that was Thor,\" Jane says. She squints up at the gathering roil of storm clouds overhead. \"Thor like the god of thunder?\"</p>\n<p>\"The same, yes,\" Loki murmurs.</p>\n<p>\"Huh.\" Jane gives Loki a small smile. \"Want some breakfast?\"</p>\n<p>\"All blessings on your house, Jane Foster,\" Loki says, and follows her inside through the first drops of rain.</p>\n<p>*</p>\n<p>The downpour lasts through the morning, drumming at the glass. Loki knows better than to imagine that it means anyone mourns him. He waits until Erik and Darcy have arrived at the workshop, damp but none the worse for it, before settling on his chair and saying, \"I believe this is the time for explanations.\"</p>\n<p>The three mortals exchange glances, but they sit down too, forming an insulating circle. In some strange way that Loki cannot yet explain, he draws strength from it, and so is able to nod to Jane, allowing her to begin.</p>\n<p>\"This morning,\" she says, \"a big Scandinavian type turned up and said he was your brother Thor.\"</p>\n<p>\"No <i>way</i>,\" says Darcy.</p>\n<p>\"Shh.\" Jane turns back to Loki. \"So what's the deal?\"</p>\n<p>Loki tells them. He tells them carefully, trying to keep the events ordered in his mind. The ugliness of his bone-deep jealousy he omits, but he remembers what Erik has said about the Loki of his childhood, and so he takes a deep breath and says, \"I knew Thor wasn't ready, but on Asgard words don't mean as much as actions do. So on the eve of Thor's coronation I opened the way to Jotunheim, enough for a handful of Frost Giants to come through. It was just a bit of fun, really, to show everyone that Thor had no grasp of policy. But it worked too well.\" He sees that Jane is frowning, but Erik meets Loki's eyes and nods, so he goes on: Thor's warmongering, Odin's knowledge of Loki's betrayal, his banishment. And finally he comes to the experiment with the liquid nitrogen, and his discovery that he is Jotun.</p>\n<p>None of them speak; instead they all watch Loki, as though still awaiting an ending.</p>\n<p>\"It sucks to not be told you're adopted,\" Darcy offers finally.</p>\n<p>\"Right!\" Jane reaches out and pats Loki's knee gently. \"And I can't imagine how hard it must be to suddenly need to -- to reevaluate everything you thought you knew about yourself. But you're going to be okay.\"</p>\n<p>\"Wh --\" Loki starts, bewildered, and suddenly realizes: they do not hear <i>Jotun</i> and think <i>monster</i>. To them one extradimensional godlike being is much like another. In Jane and Darcy's eyes, he is still exactly the same Loki. \"Oh,\" he says, on a laugh of astonishment.</p>\n<p>\"So all this studying you've been doing,\" Erik puts in after a moment. \"The stabilizing equation --\"</p>\n<p>\"An attempt to reshape my magic,\" Loki says. \"With this world's rules.\"</p>\n<p>Darcy's eyes go round. \"Whoa.\"</p>\n<p>\"Assuming you don't remember all the specifics,\" Jane says, glancing at Erik, \"could you at least give us a -- a general idea of your conception of the universe?\"</p>\n<p>Loki looks around at their eager faces. He thinks of the Bifrost, and of the branches of Yggdrasil that he must translate into quantum physics if they are to understand it, and of all the quiet back ways through the universe he used to know before the knowledge was stolen. He sees the hope in Jane's eyes, and a near-smothered spark in Loki kindles to life.</p>\n<p>\"Of course,\" he says.</p>\n<p>*</p>\n<p>That evening Loki ignores the heartache at the edges of his awareness and busies his mind with what is before him. The questions his mortals ask, about Yggdrasil, about the Bifrost, about his magic, are all intelligent -- or, in Darcy's case, creative -- and force Loki's mind into new constructions and considerations. Nor does all their talk linger on describing and shaping the universe; Jane also speaks of Loki's future. It is possible that he can come to work with her and Erik in some official capacity, which will ensure him the currency by which things are bartered on Midgard, and he will not need to live off Jane's goodwill alone. Erik can even procure for Loki some identification that asserts his right to be here, although Erik warns this may take some time. The conversation veers off course when Darcy decides to think up names for, as she puts it, Loki's secret identity; but Loki, amused, allows this.</p>\n<p>\"That's enough,\" Erik says finally. He looks outside at the wet night and makes a face. \"You can't stay on the roof tonight, not in this.\"</p>\n<p>\"I'll sleep here.\" Loki shrugs.</p>\n<p>\"On what?\" Erik wants to know. \"No, I'll give you my couch tonight. And tomorrow we'll find you an apartment -- I think some rooms are open in the building where I'm renting.\"</p>\n<p>\"Very well,\" Loki says. They make their farewells to Jane and Darcy, and walk together through the town. Loki is quiet, thinking of the things he might do with a place of his own: he can recreate his workshop, with the Midgardian spell books of science and perhaps even with a computer, though he does not understand all a computer's applications yet. He can make a new princely name for himself in this world where to be a sorcerer is not seen as the path of cowardice.</p>\n<p>He can prove that he is more than any Jotun, and that he does not need his false Asgardian family to be whole.</p>\n<p>\"So,\" Erik says, breaking his reverie. Erik's home is small, though not so small as Jane's, and it requires a flight of stairs to arrive in his rooms. In the daylight it might even have a nice view. Loki toes off his boots and sits on the couch while Erik moves about, settling in for the night. \"Which of the stories are true?\" Erik asks.</p>\n<p>Loki smiles. \"Stories about me, you mean.\"</p>\n<p>\"Yes.\" Erik glances sidelong at Loki. \"The one about your father's horse --\"</p>\n<p>Loki's smile turns bitter. \"Vicious rumors circulate throughout the realms, I see. I would not seduce a stallion even for my fa -- for Odin's favor. Whoever started that rumor, Erik Selvig, had a great overestimation of my abilities if he believed I could hold the form of a mare for near on a full turning of seasons. Sleipnir is from I know not what realm, and I am nothing to do with his issue.\"</p>\n<p>To his surprise, Erik barks a laugh. \"You just -- surprise me,\" he says in response to Loki's raised eyebrow. \"Sometimes you talk like we do, and then you slip into the way a god is supposed to talk. Formal.\" Loki's mouth twists, and Erik adds, \"I like it! It's just surprising.\"</p>\n<p>\"Well enough,\" Loki grumbles, and settles into the couch, which is at least as comfortable as the bed in Jane's trailer. When he has his own rooms, he will buy a mattress of down and heather.</p>\n<p>Silence descends. Loki has the sudden desire to turn and ask Erik what other rumors the people of Midgard have heard -- whether in their stories Loki is outcast or monster or faithful companion to the heroic Thor. But Loki does not ask, because he knows that the answer is all of these things.</p>\n<p>*</p>\n<p>When he sleeps, Loki dreams as he used to, when he had the power to learn secrets merely by slipping into a trance and listening. In his dream, he is a shadow on the wall of Odin's private chamber, and Thor is there, kneeling before his father's chair.</p>\n<p>\"Forgive me, Father,\" Thor says. \"But Loki was in need. Heimdall saw it, and it was my duty as a brother to go to him. I know I have defied you, but I also know that there are times a king must break his word in order to do the right thing. I would not disobey you and go to Jotunheim again ... but this is Loki.\"</p>\n<p>\"Thor,\" Odin sighs. \"You are still too rash. You know that's why I must keep you here.\" Thor's head bows, but Odin goes on, \"Still, it was well-considered, and done out of love. It is no offence to Laufey if you go to Midgard. I will forgive you this, though your defiance cannot go unnoticed.\"</p>\n<p>\"Yes, Father.\" Thor makes to rise, and hesitates. \"Father? When I talked with Loki, he said troubling things.\"</p>\n<p>Odin's eye closes for a painful moment. \"Yes,\" he says. \"Loki has a gift for saying troubling things. What was it he said?\"</p>\n<p>\"That he is not my brother,\" Thor says. \"That you ... lied. That you took something from Jotunheim, and that Loki is a monster.\" His hands curl to fists at his sides. \"He wouldn't do more than imply. What was he talking about?\"</p>\n<p>\"Ah.\" Odin looks smaller, like an old man. \"So he has found out. I did not mean him to -- not until the time was right. And not at all, now, after all that's happened.\" He looks at Thor and smiles, a sad, tired smile. \"In the aftermath of the battle on Jotunheim, I went into the temple, and I found a baby. Small, for a Giant's offspring. Abandoned, suffering, left to die -- Laufey's son.\"</p>\n<p>Thor is very still. The shadow that is Loki trembles with rage and hurt, so that a torch on a bracket near him flares unnaturally, but Loki does not cry out; to do so would break this spell and send him to waking.</p>\n<p>\"That was a noble thing,\" Thor says finally. \"But you didn't fear that Loki would be a danger?\"</p>\n<p>\"I hoped he would grow as you did,\" Odin admits. \"I thought we could unite our kingdoms one day. Bring about an alliance, bring about a permanent peace, through Loki. But those plans no longer matter. Loki has done nothing but cause mischief and break those things I try to build. It is better for him to find a new life on Earth, away from the Jotun and from us.\"</p>\n<p>Thor nods slowly, but he is wearing that thunderous frown Loki knows well, the one he gets when he perceives some injustice. \"I don't know how he discovered the truth,\" Thor says, \"but whatever happened, it frightened him. Why did you say nothing before?\"</p>\n<p>\"And tell Loki that he comes from a people with whom we are at war? A people whose defeat we celebrate in song, and whose destruction is <i>your</i> dear, foolish wish, Thor?\" Odin sighs. \"No. I wanted only to protect him.\"</p>\n<p>\"Very well.\" Thor stands. \"Then you must tell him this yourself.\"</p>\n<p>\"Thor --\"</p>\n<p>\"Or,\" Thor overrides him, on a sudden idea, \"of course, you can't leave Asgard, not now. I will tell him for you.\" Thor remembers himself. \"With your permission, Father.\"</p>\n<p>Odin is very still, deep in thought. Loki is more scream than shadow now, holding onto this vision with an edge of iron will, but his desire to hear his father's words is greater even than the agony of, one practiced liar to another, knowing them all for lies. \"Very well,\" Odin says. \"But this is the last time, Thor.\"</p>\n<p>\"I swear it,\" Thor says, eyes shining. \"Thank you, Father.\"</p>\n<p>The dream dissolves into blackness. It takes long moments for Loki to pull himself up, and he awakens cursing, Midgard's morning light in his eyes. He rolls off the couch in a tangle of limbs, already reaching for his boots and jacket, vaguely hoping that this noise does not rouse Erik from the next room. He stumbles down the stairs and onto the street, mind racing. What he has seen matches too exactly those other times he's spied on far-away things to be dismissed as a dream. The question is <i>how</i>. Loki was content last night, but his mind was not sufficiently quiet to achieve the necessary state; and his desire to know what transpired with Odin was not enough alone. Besides, what has he learned, but that all his fears are true, and that Odin is tired?</p>\n<p>Loki stops in the road, shaking with excitement. Odin is tired. His hold on Loki's magic is slipping.</p>\n<p>This is no way to meet Thor; Loki is fired with fury and hope, everything far too close to the surface for another confrontation, especially one in which Thor will relay to him some false tale of Odin's goodwill. But Loki is brimming with something bright-edged and unfamiliar, and he <i>wants</i> this fight.</p>\n<p>He meets Thor just outside of town, a few hundred feet further into the desert than their last encounter. When they are close enough to see one another, Thor's face registers confusion, and his stride slows. He is stepping <i>carefully</i>, Loki sees, and pads up to Thor with lithe fighting grace, smiling a soft dangerous smile. \"Thor.\"</p>\n<p>\"Loki,\" Thor returns, wary. \"I've talked with Father.\"</p>\n<p>\"I know,\" Loki says. \"He gave you some sad and noble tale. But why are you here? It cannot be to make amends between a Jotun and the man who stole him to allay his blood-soaked guilt; surely you are not errand-boy to a coward who hasn't the stomach to face what he has wrought.\"</p>\n<p>\"It's not like that!\" Thor cries. \"He cannot leave Asgard as things are now, you know that. And he was trying to protect you, Loki.\"</p>\n<p>\"Of course,\" Loki sneers. \"Mustn't let the little boy know that he's a monster. What <i>would</i> his brother think! Do you suppose it was an open secret? Or is it an instinctual aversion? That's why your friends merely tolerated me. There must have been much feasting and merriment after I was gone.\" The stricken look on Thor's face tells him all he needs to know. Loki laughs, soaring on the bright-edged rage. \"I think that Father would not have been so overhasty to banish a native son. But Jotun are Jotun, and it must have been in my blood to betray you.\"</p>\n<p>Thor stares at him. \"What?\"</p>\n<p>Oh. He's gone too far. \"I mean only that Father thinks I goaded you into seeking out war --\" Loki starts, but Thor overrides him.</p>\n<p>\"No,\" he says. \"There's something more. You're a talented liar when you have need, but I know you better than that. What did you do?\"</p>\n<p>Horror claws at Loki's throat. Curse Odin for not ending this properly and betraying Loki in turn; curse Odin for <i>protecting</i> them, in this way that is no protection at all. Loki discovers, with a shock, that after all this, the destruction of his old life and the slow building of his new one that Thor keeps blundering into and nearly knocking down, the thought of really losing Thor does not bear thinking. Loki's shining fury turns inwards, and he can hardly breathe for the pain. \"It was me,\" he whispers. \"I let those Frost Giants into Asgard.\"</p>\n<p>Thor's eyes kindle dangerously. \"<i>What</i>?\"</p>\n<p>\"You weren't ready,\" Loki says. The words are inadequate and hollow, but he forces them out, because it will mean they are finally and forever done with this charade of kinship. The world begins to waver through a sheen of useless tears. \"I wanted to stop your swearing in. Give you more time, because Father was too blind to see you're still a boy.\"</p>\n<p>\"So you thought you had the right to judge me?\" Thor demands. They're standing not far apart enough, and his voice is starting to shake with rage. \"Did you realize how you were endangering Asgard? How if they had succeeded it would have endangered all the Nine Realms? Did you <i>think</i> --\"</p>\n<p>\"Yes!\" Loki snaps. \"And weighed against that, it was still worth it to stop you.\" To his shame a tear spills over, but he ignores it.</p>\n<p>Bewilderment is replacing anger in Thor's face. \"Do you hate me so much as that, brother?\"</p>\n<p><i>Brother</i>. After all this. Loki laughs, a sound like ice cracking. \"Hate? You think it's that simple? How am I to hate someone so noble, so beloved? Brave Thor Odinson!\" The turned-inward rage burns white-hot in the center of his chest, splintering and shattering the ice. Loki shudders helplessly. \"How am I to hate the one person who didn't flinch from my spells, and who dragged me away from my books to go on adventures? How am I to hate you when you're so true you cannot imagine that I might be malicious?\"</p>\n<p>The bewilderment has cleared from Thor's face. \"Ah,\" he says, with smiling self-assurance, \"so you do love me, then.\"</p>\n<p>Loki hits him.</p>\n<p>It is unlike anything he has ever done, or imagined doing. But he needs desperately for them to, just <i>once</i>, be on equal ground, and it cannot be with words when Thor has already stumbled upon the words that will destroy him. So Loki hits Thor clean across the face, and when Thor falters back, surprised more than anything, Loki follows with his fists, wishing for a knife, a sword, a spear, anything with an edge.</p>\n<p>Thor catches and holds Loki, though not easily, the muscles in his arms bunching with the effort. Loki struggles wildly. \"Damn you, let me <i>go</i>.\"</p>\n<p>\"Loki, please, calm down!\" There is real fear in Thor's voice.</p>\n<p>\"What use have I for that?\" Loki snaps. Thor's hands holding his arms are burningly hot through the thin fabric of his sweater, and Loki wants to -- to blast Thor backwards, or conjure up a blade, or surround Thor with a dozen taunting copies of himself, wants to <i>fight</i>, wants it so badly that his whole body is pounding with it, and oh, Thor is just holding him <i>still</i>. \"Fight me,\" Loki snarls. \"If you don't listen to a damn thing I say, at least give me that satisfaction!\"</p>\n<p>\"I listened,\" Thor says, shaking Loki gently in emphasis. His face is too close, a red mark blooming high on one cheekbone. \"What you did dishonors us, but you are still a son of Odin.\"</p>\n<p>If only Thor had called him brother again; for that Loki would have torn him apart. But to hear Thor call him Odinson after all this -- Loki stills, shuddering. \"Let me go,\" he says coldly.</p>\n<p>Thor releases him, holding fighting stance, but Loki backs away. \"Go home, Thor,\" he says. \"And do not seek me again, or next time I will have a knife to greet you at our meeting.\"</p>\n<p>\"I do not doubt it,\" Thor says, but he makes no move to go.</p>\n<p>\"Shall I put it another way?\" Loki asks softly. \"Do not presume that love or hate has anything to do with violence. Do not presume that your absolution is of any use to me. Do not be so arrogant as to assume that you know a thing about me when I have little reason left to know or trust myself. I do not want to see you again. Not <i>ever</i>. Is that clear enough for you?\"</p>\n<p>\"Yes,\" Thor says, solemn. \"And --\" But whatever it is, he thinks better of it. \"Goodbye, Loki.\"</p>\n<p>\"Farewell,\" Loki returns, and walks away without a backward glance.</p>\n<p>*</p>\n<p>For some time after that things are well enough. Loki's days are spent at the workshop, developing equations, performing experiments, some more successful than others. He spends his nights on Erik's couch, learning the ways of computers and assisting Erik in fashioning his new identity; by the weekend, Erik has crafted all the necessary identification papers for his nephew, Lukas 'Loki' Selvig, and Loki cannot help the glow of satisfaction he feels for this particular new surname. In short order Loki has a bank account attached to Erik's, and rooms of his own, not in Erik's apartment complex but in a building on the edge of town, with Loki's second-floor windows facing the desert and the sky. On the day he moves in, his mortals brings small, useful housewarming gifts, and an ice cream cake for dessert.</p>\n<p>He does not dream again in visions, so he does not know what report Thor has brought to their father. Loki tries, sometimes, to throw his mind out while waking, but he is still too wrecked to try anything of the kind again, no matter how he quiets his mind. Instead he and Jane work on the Bifrost equation, and at night Loki goes to the only home he has, where the stars shine in familiar now but the bed still feels strange, and he dreams in nightmare fragments that he cannot remember on waking.</p>\n<p>It is not the life he wanted. Even for all the acceptance his mortals have shown him, it is not a life he loves. It is also a life he has made from the ruins of the old one, and he might even one day have come to enjoy it; but it lasts almost no time at all.</p>\n<p>Because Loki has no visions, he has no warning. A few days after moving into his apartment, Loki is in the workshop alone. Erik has a meeting in Albuquerque, and Jane has dragged Darcy out in the van to map the atmospheric disturbances in realtime, as not every disturbance can be attributed to the Bifrost and she believes there may be more to learn. Loki is struggling to work out the complexities of a graphing program on the computer when someone raps on the glass door. Loki glances up idly and bites back a curse.</p>\n<p>It's Thor. The infuriating <i>madman</i>.</p>\n<p>Loki rises and strides to the door, slamming it open. \"Are you deaf as well as stupid?\" he demands.</p>\n<p>\"Possibly,\" Thor says ruefully.</p>\n<p>This is unexpected enough that Loki actually waits for him to continue. Thor shifts awkwardly, and Loki notices that he is out of his cape and armor, his brightness somehow dimmed. \"I,\" Thor says, and pauses, searching for the words. \"I may have made a mistake.\"</p>\n<p>It is not the first time Loki has heard Thor say those words; he has been privileged to hear them a handful of times over the years. But it is the first time they have been a confession to Loki, and for that he wraps a hand around the doorframe and says, gentle, \"Tell me.\"</p>\n<p>Thor won't quite meet Loki's eyes. \"I went to Father,\" he says, \"and told him that he must either allow you back, or exile me as well.\"</p>\n<p>Loki's hand bites into the doorframe. \"<i>What</i>?\"</p>\n<p>\"Your offence was against me,\" Thor explains, \"not Father,\" and it is only because Loki knows Thor very well that he can believe the backwards reasoning he's hearing. \"He told me it was none of my concern, but of course it is. So I said ...\" Thor is blushing now, but he goes on, determined to see it through, \"I said that you were always better at keeping me out of trouble than getting me into it, no matter what Father believes. I told him that I still think it wrong to wait idly by while Laufey plans a war against us. The time to strike is now, and if he didn't want me to do so --\"</p>\n<p>\"He should cast you down too,\" Loki sighs. \"Thor, what have you <i>done</i>?\"</p>\n<p>\"Not enough,\" Thor says, glowering. \"He took Mjolnir, but that is all. Father says that once I've cooled down I'll see reason, and I have only to call Heimdall to open the Bifrost. It is a mockery of your punishment!\"</p>\n<p>\"It is mockery indeed,\" Loki agrees. \"No one is better for this, Thor. If the third time will get the lesson through, I am not touched by our reunion. If Father thinks you'll learn something valuable by playing with the mortals, he is exactly the fool you take him to be; you're far too stubborn to learn. So go back, and call to Heimdall that you have changed your mind.\"</p>\n<p>Thor's jaw sets, but whatever he was going to say is interrupted by the sound of the workshop's far door opening. Thor's gaze lights on something over Loki's shoulder. \"Lady Jane!\"</p>\n<p>\"<i>Thor</i>?\"</p>\n<p>Loki groans, but Jane is already hurrying over. \"What's going on?\"</p>\n<p>\"I too have been exiled,\" Thor announces.</p>\n<p>\"He really hasn't,\" Loki begins, but Jane is actually reaching out to touch Thor's chest with gentle sympathy, saying, \"Oh, I'm so sorry!\" Loki stares, heart sinking. So that's the way of it.</p>\n<p>\"I will be well enough, with such friends as you,\" Thor tells Jane, smiling down at her, and then transfers that smile to Loki, completely guileless. Loki hates him with vicious helplessness.</p>\n<p>He continues to do so for the remainder of the horrible day. Despite the fact that the readings Jane and Darcy have taken seem promising, they are much more interested in studying Thor; Darcy's aesthetic appreciation is embarrassingly blatant, and Jane keeps touching Thor in small unconscious ways. Loki's one consolation is that Thor is utterly oblivious to both, being much more interested in learning the conditions of Loki's exile. He eats dinner in vast quantities and makes both Jane and Darcy laugh with casual tales of home.</p>\n<p>By the time Thor follows Loki back to his apartment with the self-assurance that he will be welcome there, Loki has sunk into a sort of dark acceptance. He does not tell Thor to go away, but when Thor attempts to engage in conversation, Loki says shortly, \"I have not entirely changed my mind about that knife,\" and Thor for once chooses the wise course and is silent.</p>\n<p>Though his bed is big enough for two, Loki makes Thor take the couch. Despite this indignity Thor is asleep in minutes, and snoring gently. Loki lies in bed, staring up at the dark ceiling, and, listening to Thor breathe across the room, finds himself really relaxing for the first time in weeks. It hurts a little, and Loki hates it too, but he can't help it; somewhere too deep for him to ever extricate it, Loki believes that if his brother is there, he is safe. He sleeps soundly that night.</p>\n<p>*</p>\n<p>The next morning, they discover that the only clothes in Loki's closet which fit Thor are the castoffs from Jane's ex-boyfriend. Thor wears them well, too, and Loki finds it infuriating. By the time Jane and Darcy turn up on his doorstep, looking cheerful and inviting them out to breakfast, Loki wants to break something, a lamp or Darcy's glasses or Thor's hand, but he just gives the mortals a small smile and accepts.</p>\n<p>Thor tucks into breakfast at the diner with the same enthusiasm he had for last night's takeout. Darcy, who is finished eating well before Thor, produces her phone and takes pictures. \"This is totally crazy,\" she tells him. \"Are you also the god of buff dudes who eat ridiculous amounts of food at every meal?\"</p>\n<p>\"Not to my knowledge,\" Thor says, favoring Darcy with a smile. He finishes off his coffee. \"This is good. Another!\" And, just as he would at home, he takes his cup and smashes it upon the floor.</p>\n<p>Darcy and Jane both yelp, jumping in their seats. Loki actually has to struggle to hide his grin, but after a moment he is able to replicate the shocked and bewildered looks that the mortals are turning on Thor.</p>\n<p>\"Sorry,\" Jane says to the diner at large, sounding mildly appalled. \"Sorry, just a little accident,\" as she gets from her seat and goes to clean the mess. She glares up at Thor. \"What <i>was</i> that?\"</p>\n<p>\"It was delicious,\" Thor says, smiling at her. \"I want another.\"</p>\n<p>\"Well, you could've just said so!\" Jane snaps, gathering the shards of mug in a napkin.</p>\n<p>Thor laughs. \"I just did.\"</p>\n<p>\"No, I mean -- you could have asked!\" Jane gets up and returns to her seat, glaring at Thor. \"<i>Nicely</i>.\"</p>\n<p>Thor glances sideways at Loki, but Loki sits impassive. Thor looks back at Jane. \"I meant no disrespect.\"</p>\n<p>\"All right,\" Jane says, not much appeased. \"No more smashing! Deal?\"</p>\n<p>\"You have my word,\" Thor says, and smiles again, as though this solves everything. But both Jane and Darcy glance over at Loki, and he shrugs slightly. Darcy's mouth twists, and Jane's look turns sympathetic. Good; better, in any case. Loki can tell well enough that, the two of them weighed, it is Thor who is found wanting today.</p>\n<p>When they leave the diner and head for Jane's workshop, Loki falls back to walk next to Thor. \"Welcome to Midgard,\" he murmurs. \"It <i>has</i> been some time since you were here last. I'm sorry to say that their customs are not yours, and that ... how shall I put this? Even if you <i>did</i> have Mjolnir, they wouldn't be very impressed.\"</p>\n<p>\"Hold your tongue, brother,\" Thor mutters.</p>\n<p>Loki laughs softly. \"What need have I of that? It is you who should tread carefully here.\"</p>\n<p>Thor huffs and goes silent. Loki smiles to himself. There must be some way to get Thor to act the fool again, more spectacularly. The trouble is not that it is difficult to think of a plan, but that Loki can think of so many; and he will need to be subtle about it. So he spends the day going over the atmospheric data with Jane, while Thor is left at Darcy's tender mercies -- which, as far as far as Loki can tell, consist of Darcy trying to set up a Facebook page for Thor under the name The Mighty Thor Odinson, God of Thunder. Jane and Loki leave them to it.</p>\n<p>When Darcy leaves for the evening, and Jane is gathering her things, Loki goes to Thor. Thor is uncharacteristically quiet, but he looks up with a smile when Loki folds into a chair beside him. \"Lady Darcy has been very kind,\" he says.</p>\n<p>\"They are all kind here,\" Loki returns lightly. \"Thor, I may have been overhasty. Standing up to Father as you did, accepting an exile for my sake -- that was noble of you, and no less than I should have expected. You must be patient with me if I am not so quick to make peace with my true origins as you seem to be.\"</p>\n<p>\"Of course,\" Thor says, as though this really is a matter of course.</p>\n<p>\"I would like to make some small amends,\" Loki goes on. \"I still have experiments to finish here, but if you walk down the road you will find a tavern not unlike those we would visit as truant boys. It might lift your spirits.\"</p>\n<p>\"It might,\" Thor agrees, brightening. \"But you will not come with me?\"</p>\n<p>\"My work,\" Loki says, gesturing regretfully. \"But I should not be long, and my door is open to you.\"</p>\n<p>Thor stands. \"Thank you, brother,\" he says, briefly clasping Loki's shoulder, and strides out. Loki smirks and bends his attentions to the equations before him. He is more than a little tempted to go into trance and throw out his awareness -- he has enough motivation now that it might work this time -- but he falls instead into the lesser trance of elegant description and endless possibility, and stays there until he is drawn from it by the sound of a door opening across the workshop.</p>\n<p>It's Erik, back from his meeting in Albuquerque. \"Still here, are you?\" he says by way of greeting.</p>\n<p>Loki stretches, wrists popping. \"Was your trip a success?\"</p>\n<p>\"It went well enough.\" Erik comes to look at the equations over Loki's shoulder, but he seems distracted. \"Jane called me this morning, you know. She said Thor was here too. What's going on?\"</p>\n<p>\"He has nobly exiled himself for my sake,\" Loki says, not bothering to disguise the bitterness in his voice. \"If he does not turn tail after tonight, you may need to invent another Selvig cousin.\"</p>\n<p>\"And why would Thor of all people run away?\" Erik wants to know.</p>\n<p>Loki's mouth twists into a smile. \"I sent him to the bar.\"</p>\n<p>\"Oh, for --\" Erik glares at Loki. \"He's going to get in trouble! Do you want him to be arrested without an ID?\" Loki's smile spreads wider, and Erik makes a noise of disgust. \"I'll make something for him tonight, just in case, but you go down to that bar right now and haul him out before there's real trouble.\" He doesn't wait to see if Loki will obey him, but shuffles off to sit down at his laptop; Loki can faintly hear him mutter something that sounds like, \"<i>Gods</i>, of all the stubborn bastards, and no way could it be someone nice like <i>Freyja</i>, no, it's all mischief and thunder ...\"</p>\n<p>It is Erik's disapproval more than any concern for Thor that drives Loki from the workshop and towards the bar. When he gets there, however, Thor is not to be found, and the establishment possesses rather more smashed bar stools than it did on Loki's last visit. Loki observes this with great satisfaction, and then he must slip into the shadows of the alley behind the bar and double over laughing himself breathless with joy. There is a strange, simple pleasure to instigating a bar brawl, and having been buildings away for the event itself makes the satisfaction no less heady.</p>\n<p>It is perhaps possible that, his other powers revoked, his way with words is more than it used to be. Loki likes this notion.</p>\n<p>He goes back to the workshop, slipping inside silently and watching Erik work for some time, until at least the basics that will get Thor out of trouble with the law are dealt with. Then Loki says quietly, \"I believe I have a brother, or perhaps a cousin, to retrieve from the police station.\"</p>\n<p>Erik flinches with surprise and turns to glower at Loki. \"I've half a mind to disown you.\"</p>\n<p>\"I'll talk you out of it in the morning,\" Loki returns dismissively. \"Am I to ask after Thor Selvig?\"</p>\n<p>\"I didn't have time for something like that,\" Erik tells him. \"You're the concerned friend of a Dr. Donald Blake. He'll be in the system. Now go pick him up, and think about apologizing.\"</p>\n<p>Loki studies Erik's annoyed face, and allows a soft smile to slip through. \"Erik,\" he says. \"Thank you. I hardly deserve it.\"</p>\n<p>\"Tell me something I don't know,\" Erik says, waving him out.</p>\n<p>Loki goes, padding softly up the dark street under an overcast sky. Around him, Puente Antiguo settles in for the night; Loki can hear them, shopkeepers, children, tourists, drunks, each of them and their brief lives a well of possibility. Loki can almost taste all the secrets he used to know, and he wonders if Odin is tired, if Odin is slipping, if Odin regrets the failure and loss of both his sons. Loki wonders who it will help or harm if he goads Thor into going back tonight.</p>\n<p>He arrives at the police station. A desk sergeant looks up at him with disinterest. Loki smiles politely. \"I've come for my friend Donald,\" he says. \"Or at least I do hope he's here; I left him at the bar, and I'm afraid he wandered off or got in some sort of trouble.\"</p>\n<p>\"Huh,\" the desk sergeant says. \"Maybe you mean that John Doe in holding. What's the full name?\"</p>\n<p>\"Dr. Donald Blake,\" Loki says, leaning on the counter.</p>\n<p>\"Just a sec.\" The desk sergeant types this information into her computer, and after a moment an identification of Thor pops up. \"Yeah, that's the one,\" she says. \"What's your relationship to Mr. Blake?\"</p>\n<p>\"Merely a concerned friend,\" Loki says.</p>\n<p>\"Okay.\" The desk sergeant sighs. \"He's disturbed the peace pretty badly, and I don't mean just at the bar -- he's been yelling crazy things from the cell in holding, too. We'd like to keep him for overnight observation, but no one's pressing charges. If you want to see him now, you can. It might calm him down.\"</p>\n<p>\"I would like that very much, thank you,\" Loki says.</p>\n<p>Another officer leads him through the building. Loki hears nothing out of the ordinary as he's led down the hall, but he doesn't doubt that Thor was shouting for some time. The thought makes him smile inwardly, but he adopts an expression of concern, and holds it impeccably, even when confronted with the most pleasing vision of Thor on the other side of the bars of a cell, sitting dejected with his hair in disarray. Thor looks up when he hears Loki without, but no smile of greeting lights his face.</p>\n<p>\"Oh,\" Thor says, voice somewhat hoarser than usual. \"It's you.\"</p>\n<p>\"Donald Blake,\" Loki returns. \"How very nice to see you again.\"</p>\n<p>\"What --?\" Thor starts, but then something like comprehension passes over his face. \"Oh. Yes. Have you come to gloat?\"</p>\n<p>Loki's eyes go wide. \"Whatever for?\"</p>\n<p>Thor surges to his feet, lunging at the door; Loki holds his ground, and Thor does not reach for him, but merely wraps his hands around the bars, clutching with squeezing force. \"This is <i>your</i> fault!\" Thor growls. \"Of all the things you could have done to welcome me, you chose the one that would make me look like a fool! They laughed at me, and called me crazy -- <i>me</i>, Thor! You cannot know how that feels!\"</p>\n<p>The guard is too far away to hear, if Loki talks quietly. He gives Thor a poisonous smile. \"Do I not?\" Thor scowls at him. \"You know,\" Loki murmurs, \"I do wish I felt sorry for your predicament. Not to be a good brother, you understand; we have been beyond that for some time. But I would like you to see some righteous disappointment, some concern for your lot, cast in your direction just this once. Then you might have some hope of understanding what you deserve, for everything you've done to me.\" Thor gapes at him in astonishment, and Loki reaches out, brushing Thor's fingers with his own. \"If you cross my threshold tomorrow, that knife <i>will</i> be waiting. Goodnight.\"</p>\n<p>He does not await a reply, but leaves with his blood singing. In truth it does not matter if Thor understands; Loki no longer really expects him to. The joy of having spoken the words aloud is enough.</p>\n<p>*</p>\n<p>Loki sleeps only a short while, and fitfully, passing through strange dreams in which he lies chained to a great rock and Thor stands over him, holding a bowl above Loki in both hands; he looks at Loki and says, \"Eventually the venom will be too much.\" When Loki wakes the dream becomes a kaleidoscope of unconnected images, but it does not matter; the bright-edged rage is back. Loki sits up, blinking in the morning light, and realizes that he hopes Thor is stubborn enough, reckless enough, to come to Loki rather than returning to Asgard.</p>\n<p>He is not hungry yet, and some of his notes and equations have drifted to his apartment. Loki pads to his kitchen space, and selects one of the knives Jane gave him as a housewarming gift, sliding it into his boot, for Loki does keep his word when he can. Only then does he settle in with his papers, working quietly as sunrise slants into his rooms and turns the world gold.</p>\n<p>Just as he is beginning to think of breakfast, there is a knock on his door.</p>\n<p>Loki smiles in a flicker that darts across his face and is gone, and stands fluidly, going to the door. When he opens it, Thor is waiting there, tousle-haired, shoulders slumped. \"Loki,\" he says, sticking a booted foot against the doorframe, as though he thinks Loki might shut the door in his face. \"We must talk.\"</p>\n<p><i>Talk</i>. As though that will ever be Thor's weapon. \"About the things I said last night, I imagine,\" Loki says. \"Do you come to make an apology or demand one?\"</p>\n<p>\"I haven't yet decided,\" Thor admits. A faint frown creases his brow, but it's more confusion than anger. \"What have I done, for you to treat me so? I've been going over it in my mind all night. You never do things without reason, so I must have done something to wrong you, and for that ...\" Thor squares his shoulders. \"For that I am sorry. If you would but tell me what your grievance is --\"</p>\n<p>Loki laughs, sharp-edged and bright with fury, amazed that Thor can hold to his willful blindness so. It is pitiable and enviable in equal measures, and with remote clarity Loki knows that he will get through to Thor only as he got through to Odin: with action in such measure that it cannot be ignored. \"Please,\" he says. \"Come in.\"</p>\n<p>Thor enters warily, and in the same movement Loki shuts the door behind him and kneels to slip the knife from his boot. Thor still has his back turned, for all Loki's warnings; it must be that Thor has that same inextricable feeling of safety around Loki as Loki does with Thor. It is time to prove that this is the greatest lie of all, and so Loki lashes out, swift as thought, knocking Thor to his knees, and before Thor has time to react Loki is standing behind him with the knife pressed to Thor's throat.</p>\n<p>Thor goes very still, trembling with tension. \"Loki?\" he whispers.</p>\n<p>It is well that he tries nothing more, for there is a great difference between imagining violence upon Thor, or using quiet words and backhand stratagems to bring him down, and <i>this</i>. Loki breathes in quiet shocked gasps, the knife a hot living thing in his hand, his body thrumming. \"My grievance,\" he says, calm. \"Of course I will tell you.\" His other hand tightens on Thor's shoulder. \"But in return I must have your word that you will, for once, <i>listen</i>. You will not dismiss what I say out of hand because you believe you know better. You will not call it petty cowardice or foolish misunderstanding; you will not make it safe. You will take it into your heart and you will keep it, or I will <i>kill</i> you, I swear it.\"</p>\n<p>He can feel Thor's pulse under the knife. Loki can hardly breathe for fear and anger; that he should be forced into truth like this is nearly unbearable, but more unbearable still is the dread that Thor might never be more than a brash fool whom Loki has failed. \"I understand,\" Thor says, low. \"I'm listening.\"</p>\n<p>\"Then it will be the first time,\" Loki tells him. The morning sun is turning Thor's hair to blazing gold, crowning him still for all he has been cast out, and the knife is a streak of silver, too bright. He cannot do this. But, \"There is ... something wrong with me,\" Loki says. \"Whether because I am Jotun, or for some other reason, or no reason at all, is no matter. You know that my only skill is my magic. I do not wish it so. If I could be a warrior -- prove myself in mettle and valor, rise up without knocking you down ... but I cannot. Every Asgardian but you has long since learned to mistrust and fear me. I was ruined for kingship long before I was a false son. Can you imagine how that feels?\"</p>\n<p>Thor is silent; Loki imagines it must be because he does not realize the question is really for him, but then, Loki cannot see Thor's face. It is still a surprise when Thor says, the words dragged out of him, \"No. I can't.\"</p>\n<p>Loki's hand on Thor's shoulder tightens convulsively, but his other, the knife hand, is steady. \"So then,\" he says softly. \"I have a brother, whom I love. He is quick to anger, but quick to be kind. He holds weapons as trusted friends, and his friends are his willing armor. He is too young for rule, and would push his realm to war for the sake of his own petty glory, but he believes in honor and nobility and all those great ideals which hold no real meaning.\"</p>\n<p>Thor's tension under Loki's hands is shifting; something hot and dangerous still vibrates between them, but it no longer feels as though Thor is seconds from trying to disarm him. By all wonders, Thor is <i>listening</i>, though Loki shouldn't be surprised; the story is, after all, about him. Loki grits his teeth and presses the knife a little closer, not hard enough to draw blood. \"And I could make no challenge,\" he says. \"I had no way to prove that I am a worthy son; I let those Frost Giants into Asgard so that I might at least prove you were unworthy. But it worked too well. You proved yourself a warmonger, and worst of all you <i>trust</i> me.\" The words are spilling out unbidden, ringing true and clear; Loki is dizzy with it. \"Father knew what I'd done -- but still you came for me; even when you knew I was Jotun you came for me. I have a chance of building something new with people who care not for valor but for intellect, and here you are, with your damn <i>honor</i> that demands your exile too, and you would make them love you, take them away, and want me by your side still after all we've done to each other!\"</p>\n<p>Loki is breathing too hard now, fired by something he does not wish to name, and under him he can feel the flutter of Thor's pulse reverberating through the knife. Thor is holding so still. Loki shudders, barely biting back a moan, and snarls, \"Why can't you be like everyone else? Why can't you just hate me?\"</p>\n<p>Silence stretches between them, Loki's harsh gasps the only sound in the still room. He <i>aches</i>, raw with truth, tight hot tension settling low in his belly. Thor shifts, the knife rasping quietly against his skin.</p>\n<p>\"Brother,\" Thor says, soft and pleading.</p>\n<p>Something snaps. Loki falls to his knees, knife clattering to the ground forgotten, seizing Thor's shirt and his hair. He expects Thor to fight him, but Thor is turning, seizing Loki in turn, and they are kissing, hard and messy, in a tangle of limbs on the floor. Loki claws at Thor, graceless with terror and desire. Thor's mouth is impossibly hot. Loki needs -- needs --</p>\n<p>As always, he's still tangled up in his mind when Thor has already hit upon some action. One of Thor's hands finds its way under Loki's clothes, rucking up his sweater, and suddenly all Loki can think is <i>skin, oh, yes, more</i>, fragments of desperation while Thor's hands smooth over Loki's ribs and his back, mapping him, leaving contrails of fire in their wake. Thor pulls away, and Loki tries to follow with a moan of panicked protest, only to be smothered for a moment as Thor yanks his sweater and shirt up over his head. Then Loki is sitting there in nothing but his too-tight trousers, trembling with shock and need, and he accidentally meets Thor's eyes.</p>\n<p>Thor has never learned to hide, so Loki reads it plainly on his face: Thor is startled, and afraid, and wants this badly. It's like looking in a mirror.</p>\n<p>Loki surges to his feet, cursedly unsteady. Thor stares up at him with hope and worry, and Loki snaps, \"Get up. Undress. Now.\"</p>\n<p>Thor breaks into a grin, and Loki turns away. He fumbles with his trousers, flushing with fury. Of course Thor must think that Loki saying yes means he is forgiven; in Thor's world, things are that simple. It is possible that some of what Loki said has made its way into Thor's mind, but for all that he must think that this is an act of absolution. Loki kicks his trousers away, disgusted, and turns to tell Thor that it is nothing of the kind, but before he can say a word Thor descends upon his mouth again.</p>\n<p>This kiss is different. It is no less desperate, but Thor goes gently this time, his hands cupping Loki's face. Loki's hands settle uncertainly on Thor's bare shoulders. Without warning the backs of Loki's knees hit the bed, and he sits with a thump; Thor follows swiftly, but this time Loki shoves him back with a glare. He meets Thor's startled eyes and snaps, \"Would you best me in this too?\"</p>\n<p>\"It is no contest,\" Thor says in surprise; and the worst part is that he means it. Thor did somewhat indulge his youth -- mostly with Sif, Loki is given to understand -- while Loki, infinitely preferring utility to possible rejection, simply took care of matters by himself as the need arose; but Thor was always very conscientious about his couplings, either from his innate sense of damnable honor or because in that one respect he learned to understand the duties of a prince. Thor is nothing if not fair and noble when he takes someone to bed.</p>\n<p>Loki does not want to be <i>taken</i>.</p>\n<p>He wants to see Thor fall apart.</p>\n<p>\"In that case,\" Loki says, with a smile he knows isn't in the least reassuring, \"go lie down on the bed.\"</p>\n<p>Thor rises at once to move as he's told, all grace, and Loki doesn't know how he does it; Thor's just as hard as he is, but Loki is all trembling limbs. Still, soon enough it won't matter. Loki follows Thor up the bed, and waits until Thor, propped up expectant on his elbows, has met Loki's eyes; then Loki slides down and takes Thor's cock in his mouth.</p>\n<p>Loki realizes at once that it isn't the best angle: he has to hold himself above Thor with arms nearly too weak with desire to bear the weight. Thor gives a choked-off moan, his thighs clamping Loki's shoulders and his hands settling in Loki's hair, but lightly, lightly. Thor's pulse is rapid, but he is holding far too still. Loki wonders if Sif taught him this courtesy, but cuts that thought off at the pass, and instead leans in further and tries something clever with his tongue.</p>\n<p>Thor cries out, hands going tight in Loki's hair, and <i>thrusts</i>. Without warning everything inside Loki's head goes very bright; his throat opens up, and the frantic trembling leaves his body. It is exquisite: Thor rocking into his mouth, twisting his hair, shaking thighs holding Loki in place, and Loki rubs up against the sheets, in no hurry at all. He seems to be making soft helpless noises of pleasure, but it's entirely beyond his control to stop.</p>\n<p>\"Enough,\" Thor gasps, tugging Loki up. Loki blinks at Thor, dazed and bereft; Thor is flushed and panting, his eyes dark. \"You're too talented,\" Thor says. \"I want this to last.\"</p>\n<p>\"Yes,\" Loki breathes. Thor struggles to sit up, and Loki surges to meet him, nearly drawing blood in his haste to kiss Thor again. This time Thor is not careful with him; he grabs a fistful of Loki's hair and yanks it back, biting Loki's exposed neck hard. Loki laughs with dark joy. So Thor does have it in him after all, that desire to wreck something because it is beautiful.</p>\n<p>He is in Thor's lap now. Loki realizes, with a flash that is equal parts fear and excitement, that he has only to rise up and shift a little and he can have Thor inside him. A part of Loki balks at this -- it is dangerously close to being used -- but his body aches for it, and Thor is looking up at him again now, grinning as though the laughter is something they can share, his hands petting down Loki's back. It will be more than worth it for the look on Thor's face.</p>\n<p>He rises up, and eases himself down carefully. The look on Thor's <i>face</i>. Thor is gasping, eyes wide and helpless, hands grasping Loki's hips with shaking uncertainty. Loki laughs again, and it turns to a moan as he settles, rocking gently, his hands clutching Thor's shoulders hard enough to bruise. \"<i>Oh</i>.\"</p>\n<p>\"Loki.\" Thor's thighs are trembling. He thrusts up once, desperate and involuntary, and it sparks something deep in Loki.</p>\n<p>Loki cries out, riding it, and grins wildly at Thor. \"That, again.\"</p>\n<p>There is a rhythm to this, one Thor knows, and uses when he sees that Loki will take it and greedily. For his part, Loki watches Thor's face, memorizing how Thor looks, mouth soft and wet, eyes glazed, struggling for breath. Thor's grip on Loki's hips is bruising. Once, Thor lets go with one hand and reaches for Loki's cock, but Loki knocks his hand away and snarls breathlessly, \"That is not yours to take.\"</p>\n<p>Thor does not try again, but he does seize Loki by the hair, and kiss him until Loki is dizzy, is caught between overwhelming sensation, is suddenly fighting to hold on, because whatever this is it is <i>his</i>, and Thor will not -- will -- <i>Thor --</i></p>\n<p>Loki cries out, trembling through it, hating the way Thor holds him as though he might shake apart, hating too that Thor still thrusts once, twice more before groaning and shuddering into stillness.</p>\n<p>For a long moment Loki stays with his face pressed hot and damp to Thor's shoulder. Then he shifts, wincing, and clambers off Thor. He'll be feeling this all day, Loki realizes, marked <i>Thor's</i>, and he hunches up on the edge of the bed, curling in on himself.</p>\n<p>\"Loki?\" Thor murmurs, and then again, more alert, \"Loki? Are you well?\"</p>\n<p>This time when Loki laughs it sounds hollow. He <i>feels</i> hollow now, unfilled, incomplete. \"Fear not, brother,\" he says. \"I have no complaints.\"</p>\n<p>He hears Thor shift behind him, and flinches away from the hand that touches his shoulder. \"Come now,\" Thor says, half laughing with bewilderment. \"Surely you will not act the shy maiden.\"</p>\n<p>That stings. Loki springs to his feet and glares at Thor. \"No,\" he snaps. \"Nor do I need coddling. There are fresh clothes in the closet; I'm going to take a shower.\"</p>\n<p>\"Very well,\" Thor says, hurt now joining the bewilderment in his voice. But Loki cannot meet his eyes, nor form some adequate apology; he is far too naked already. He tries to walk to the shower with dignity, but in truth, he flees.</p>\n<p>*</p>\n<p>Loki stays in the shower only long enough to clean and compose himself. To remain any longer would be cowardly, and sometime-sorcerer Loki may be, but he is not afraid to face his own brother.</p>\n<p>When he emerges in a cloud of steam, face schooled to impassivity, he finds Thor sitting on the bed, wearing fresh clothes but still looking rumpled. Thor looks up at Loki, takes a deep breath, and says, \"I'm sorry.\"</p>\n<p>\"Please,\" Loki says shortly, \"don't bother. Spare us both.\"</p>\n<p>Thor's jaw goes stubborn. \"I failed you,\" he says. \"And I'm sorry for that.\"</p>\n<p>In the act of retrieving a boot, Loki freezes and straightens slowly. \"What?\"</p>\n<p>\"I've been thinking of what you said,\" Thor explains. \"And on how you were treated at home. I thought -- I thought the people who treated you poorly were but common folk with common minds fearing magics they couldn't understand ... but it happened at court too, didn't it?\" He frowns down at his hands. \"No one called you coward to my face. I would have beaten them for that. But it wasn't enough.\"</p>\n<p>\"No, it wasn't,\" Loki agrees, but he says it quietly, stunned.</p>\n<p>Thor looks back up at him, and there is pleading in his eyes. \"It is my turn to talk now,\" he says, \"and we know I'm no good at it, so -- please.\"</p>\n<p>Loki sees the knife shining where he dropped it. He goes and picks it up, not because it means anything but because it will give him something to do with his hands. \"Of course,\" he murmurs. \"Go on.\"</p>\n<p>Thor shifts, uncomfortable with sitting while Loki stands. But he says only, \"Anyone who thinks you a coward -- anyone who finds you inferior at all -- is himself a fool. I know I'm Asgard's best warrior save Father, but you ... You understand things I don't, and things I never will. That is noble, and worthy of respect.\"</p>\n<p>It is a fair speech. Thor has seen Loki's fear, and is offering in return a leveling between them. It is well meant, at least. For this Loki nods, trying on a smile. Thor returns it, with hesitance, and stands. Realizing he still holds the knife, Loki sets it aside. Finished.</p>\n<p>\"I know things are not so easily mended,\" Thor says. \"But neither am I sorry for anything that has been done today.\"</p>\n<p>He seems to be waiting for something, but he makes no move to draw nearer. For that Loki can forgive him much -- not whole years, perhaps, but moments. Loki takes a breath and tries to find the words, not that Thor wants to hear, but that are honest. \"What was done,\" he says, \"if we never spoke of it again, I could live with that silence. I do not give of myself lightly, but you take lightly, and it does not sit well with me.\"</p>\n<p>\"Loki,\" Thor says, tilting his head until Loki is forced to meet his eyes. Thor's own are very earnest. \"If you believe I would lie with you and think lightly of it, you don't know me so well as you think. And if you only allow me what we shared today this once -- you would break my heart, brother.\"</p>\n<p>Thor really means it. Loki stares at him, amazed, and can think of nothing to say. So when Thor steps forward, and leans in to kiss Loki softly, Loki allows it, for all that he is too wrung out to feel anything but the briefest flare of warmth. \"You speak prettily,\" he murmurs, when the kiss breaks. \"Did you learn it from me?\"</p>\n<p>\"Perhaps,\" Thor returns, eyes dancing. \"Are we well, then?\"</p>\n<p>\"Yes,\" Loki says. He does not know if it is a lie. \"I think it's time we ate. There is something I want to introduce you to: it's called ice cream ...\"</p>\n<p>*</p>\n<p>Loki coasts through the day on equations, lightheaded with anticipation for some confrontation he has no idea how to navigate, relishing the challenge and the fear, because it's <i>Thor</i>, Thor sitting across the room with Darcy while Loki works, Thor whose eyes are electric with promises Loki doesn't yet understand but desperately wants to. Erik keeps trying to catch Loki's attention, to ask him questions Loki has no intention of answering, but he distracts Erik with explanations of Yggdrasil, and it works well enough.</p>\n<p>That evening they say their farewells to the mortals and walk home together. Thor's step beside him is measured, and Loki wishes that either of them still had the power to call down a storm; there is one raging inside him, and it is unkind of the night to be so still. He can think of a thousand ways to keep Thor here, but each plan blows to pieces before Loki can bring any confidence to it. His hand unlocking the door to his apartment trembles only a little, and if Thor sees, he says nothing.</p>\n<p>Loki shuts the door behind them. The tension is so tight that his <i>skin</i> hurts, but Loki still moves about the room, tidying his notes, removing his boots, acting as though there is no hurry at all, and what Thor does is no matter to him. He can feel Thor's eyes on him, though, and when he turns Thor is standing right before him.</p>\n<p>\"<i>Enough</i>,\" Thor growls, but he makes no move to hem Loki in. Instead he reaches out to touch Loki's face gently, and that -- that is something Loki did not expect. He has long since come to read Thor's gestures as a language, translatable, but this one is foreign; it whispers of things that Loki, for all his studies, doesn't yet know.</p>\n<p>He drags in a breath and looks at Thor straight on, steady, for all that his pulse is pounding too hard all the way down to his fingertips and he has no idea who either of them are. \"I want,\" Loki whispers, and thinks <i>to destroy you</i>, but that is no longer true. Instead he plucks at Thor's shirt, graceless again, and hates being so far out of his depth.</p>\n<p>Thor is beginning to smile. \"How long have you wanted?\" he asks.</p>\n<p>Forever. But Thor's smile says that he already knows; for this one, inconvenient time, he is as quick as Loki. <i>Forever</i>, Loki thinks, <i>any way I can get under your skin,</i> and aloud he says, \"You arrogant, boorish, self-satisfied --\" and has any other number of waiting epithets that die unsaid because Thor is laughing and kissing him again. Loki will have to teach him better than to interrupt, but now, with Thor's mouth insistent and his hands threading in Loki's hair, does not seem quite the time.</p>\n<p>It is different, touching Thor so without being fired with anger. It is frightening; Loki has no idea what to do, and no idea how to pretend that he does. But Thor does not expect anything of him, save that he be here and go along with Thor as he always has. Loki can do that. He has done it a thousand times before. He will <i>make</i> it right. So Loki pushes into Thor's mouth, goading him on, and this time when Thor walks him backwards and deposits him on the bed, Loki goes down willingly. He lies there with Thor over him, both of them still dressed, indulging endless kisses while Thor insinuates a thigh between Loki's legs. Heat burns low in his belly, spreading outwards slow and delicious, and Loki wants to keep it; he wants Thor to feel it too, and to find it <i>necessary</i>. Loki moans, trying to pull Thor closer.</p>\n<p>Instead Thor, contrary as ever, pulls away. He laughs at Loki's accusatory glare. \"But a moment, brother,\" he says, tugging his shirt off over his head.</p>\n<p>Loki sees this for wisdom, and quickly wiggles out of his own clothes, but he cannot resist muttering, \"If I had my magic we'd have long since been naked.\"</p>\n<p>Something flares in Thor's eyes. \"Someday,\" he says, but before Loki can ask him what he means by it, he has bent over Loki again and is trailing sucking kisses down his neck. Loki gasps, arching, and forgets all about Thor's words. He tries to breathe while Thor mouths along his collarbone, while Thor licks and kisses down his chest; and Loki struggles to allow it, struggles to lie there and let Thor do as he likes, because this is more focused attention than Loki has ever thought to have, and the fierceness with which he craves it is <i>dangerous</i>.</p>\n<p>Thor kisses down into the hollow of Loki's right hipbone, and then -- he stops, just above Loki's cock, and looks up at Loki with earnest blue eyes. \"What should I do?\" he asks, quietly, and that is strange, unsure and unlike him, but for that of course Thor has impeccable courtesy in bed. Loki stares down at him and <i>hates</i> it, that Thor can ask this question, when both of them well know everything is up to Thor.</p>\n<p>But Loki knows what to do. He says, soft and steady, \"Everything. Anything.\" He has to; in a patient press of kisses Thor has already stripped him bare, and there is nothing to lose. Anything, for Thor to be bound to him.</p>\n<p>Thor says, half-stumbling over the words as though even now he is less than sure of his reception, \"I would have you again.\"</p>\n<p>Loki shivers. And Loki says yes.</p>\n<p>That is how he comes to be sprawled on his stomach, legs spread, cock trapped against the sheets and hands fisted in a pillow, moaning into it while Thor twists slick fingers inside him. Loki's face is burning; he is hot all over with the certain knowledge that he looks completely undone. And he knows Thor likes it: Thor says nothing, but his free hand is stroking the curve of Loki's back, and his breathing is unsteady. It hovers on the edge of too much, the certainty that Thor is doing this because it feels so terribly, overwhelmingly good to Loki.</p>\n<p>Loki turns his head, trying to pull in air, trying to take anything back. When he speaks, he means to snap it like an order but it comes out on a breath: \"<i>Now</i>, Thor.\" And then Thor is pulling him up and back, on his hands and knees, for all that Loki is so shaky and wrung-out with desire that for a moment he doesn't think that his arms can support him.</p>\n<p>Thor presses into him, at his own pace. Loki can't even <i>see</i> him, nor balance well enough to reach up and grip his own cock; he has no control over <i>any</i> of this. He bows his head and gasps, and Thor is curled over him, thrusting slowly, kissing the back of Loki's neck where the hair has slid away. Loki thinks he is making noises like sobs. It comes to him then, how terribly out of his depth he is: this is everything he wants, and he still has no idea whether Thor is being dragged along with him through this heady mess, or if, to Thor, it is just in fun.</p>\n<p>The thought is unbearable. Loki has to do something, something besides rock with every thrust and mouth inarticulate moans; but when he tries to speak, he says, \"Touch me, please, <i>please</i>,\" open and needy and desperate.</p>\n<p>Thor does; he wraps a hand around Loki's cock and strokes, a sure careful rhythm in time with his thrusts. Distantly Loki hears that Thor is murmuring, broken, \"Loki, oh, you feel --\" but Loki does not find out what, because he is coming, in long wrecking pulses, collapsing to his elbows.</p>\n<p>Thor holds his hips and drives into him hard, through the aftershocks, until Loki is whimpering at every thrust, until Thor stiffens, crying out, his hands digging hard into Loki's sides in a last delicious flare of pain.</p>\n<p>They fall to the bed together, Thor slipping out; both of them are too exhausted to move enough to clean the mess. Instead Thor wraps an arm around Loki, pulling him close against Thor's chest, burying his face in Loki's hair. He murmurs, \"Perfect.\"</p>\n<p>And Loki thinks, <i>You're going to stay. I'm going to make you stay</i>.</p>\n<p>*</p>\n<p>Loki wakes first, only a little sore. Thor still has an arm wrapped around him, but Loki slides out from under it and gets to his feet. Sprawled on the bed, Thor is stern in sleep, more a prince of Asgard than he ever is when waking. The effect is ruined by Thor's nakedness, and Loki's mouth twitches for a moment into a smile.</p>\n<p>When Loki is washed and dressed, Thor sleeps still. Loki writes him a note detailing his whereabouts, leaves it on the pillow, and slips out into the bright morning. He walks to the workshop with his mind very still; he does not think of equations, but nor does he fall back into remembering the kaleidoscope of sensation that is the previous night. He cannot feel caught if he does not think on it.</p>\n<p>Of course when he arrives at the workshop, Erik is already there. Loki nods good morning and heads for a laptop, but Erik cuts this ruse off at the pass by coming to sit with him, bearing an offering of coffee. Loki takes it, and allows Erik's presence.</p>\n<p>\"So,\" Erik says. \"Want to tell me what's happened between you and Thor?\"</p>\n<p>Loki nearly drops his mug. Scalding coffee splashes over his fingertips, and he leaps to his feet, hissing ineffectual curses. Running his hands under cold water at the sink does give him the necessary time to compose himself, and to remember that Erik is but a man and is therefore asking how it came to pass that he and Thor were at odds one day, and apparent friends the next. Loki knows how to play this.</p>\n<p>When he folds back into his seat, he sips his coffee and shrugs. \"I thought Thor was making mockery of my exile. But we talked, and I find that he is sincere: a good and loyal brother. He forgave me in turn once I had explained my grievances.\"</p>\n<p>\"Hm.\" Erik looks Loki over thoughtfully. \"You're good,\" he says. \"At lying with the truth, I mean. I don't doubt all that happened, but I think it wasn't the important thing.\"</p>\n<p>\"You may think what you like,\" Loki tells him.</p>\n<p>Erik frowns, leaning forward. \"Loki,\" he says, \"do you think we're keeping you around because you're useful? Jane's full of wild theories, and yours are brilliant, but even if the math works out, nothing's going to happen. I don't need you here to keep Jane's hopes up. Honestly, I'm still not sure if you're crazy. But that isn't important; what matters is that somewhere along the way I've started caring what happens to you. So just for a moment, stop being a trickster and tell me.\"</p>\n<p>The invitation is tempting. But Loki has been giving so much of himself lately that soon he will have nothing left. He looks at Erik over his mug and considers what he might say. <i>I'm taking Thor back the only way I know how. I finally have something I've always wanted. I have no idea what I'm doing.</i> If he thought that Erik could advise him, he would speak in a moment; but it is difficult to imagine that Erik can even understand why Loki is doing as he is, when Loki cannot untangle it himself. \"It is no business but mine and Thor's,\" Loki says, ice in his voice. \"If you would pry, make your next attempt on him.\"</p>\n<p>\"Fine.\" Erik is frowning, but he rises and leaves Loki be.</p>\n<p>More than once that morning Loki is tempted to go to Erik and beg another perspective on the situation. Erik of all people knows that Loki makes mistakes and does not apologize for them. But the temptation is never quite great enough to drag Loki out of his chair, and once Jane and Darcy arrive, Loki is sufficiently distracted to discard the thought entirely. Even when Thor arrives, Loki merely gives him a nod in passing, and will not be shaken from his work.</p>\n<p>Today's project is star charts: Jane spreads out diagrams of the known galaxy as mapped from Midgard, and Loki is well occupied trying to figure out distances by Earth reckoning, so that he might find Asgard, Jotunheim, Alfheim, Vanaheim, and all the rest. Loki has known the stars for years on years, and perhaps Odin did not think to take that knowledge from him; it is not easy work, but by lunchtime Loki is able to pinpoint Asgard with some confidence.</p>\n<p>\"More than ten light years,\" Jane breathes, when he has identified the likeliest star. \"I -- I know that one has at least two proposed planets. But <i>ten light years</i>. How long does it take by Bifrost?\"</p>\n<p>\"No time at all,\" Loki says. \"It is flying and falling for the length of a dream. Subjective time, as our gatekeeper might measure it? Perhaps two of your minutes.\"</p>\n<p>Jane chokes. \"<i>Five light years a minute</i>? That's <i>impossible</i>.\"</p>\n<p>\"No, just improbable,\" Thor says, coming up to stand next to Jane. He smiles down at her, and she returns it in that flustered way she used to have with Loki, the smile she employs when she is not quite sure of her ground. \"From Asgard to Jotunheim it is longer, but from Midgard to Jotunheim it might not be. Midgard is called so because it is near the center of Yggdrasil.\"</p>\n<p>\"Really?\" Jane's eyes are shining.</p>\n<p>\"Yes,\" Loki puts in, nettled. \"And if you would like to be useful, kindly calculate where Jotunheim is in relation to Midgard.\"</p>\n<p>\"Certainly,\" Thor says, completely oblivious to Loki's tone, and leans over the star charts. He throws another grin at Jane. \"So where is Midgard on this map?\"</p>\n<p>Loki's breath catches on fury, familiar and unwanted. But Jane is leaning subtly into Thor, bending with him to trace her finger across the white lines that crisscross the page. Loki does not have to stand here and watch this. He stalks across the room, ignoring Erik trying to catch his eye, and throws himself down in front of the desk full of his equations. He stares blankly at them, not even bothering to pretend studiousness; across the workspace, he hears the low murmur of Thor's voice, and then Jane <i>giggles</i>.</p>\n<p>Loki cannot <i>see</i> through the white-edged glittering anger.</p>\n<p>He does hear the rasp of Darcy rolling over on a chair, though, and once he has taken a couple of deep, steady breaths, he is able to look at her with apparent indifference. Darcy's cheeks hollow for a moment with consideration; she scoots in close next to Loki and peers across the workshop over her glasses. \"Huh,\" she says. \"That sucks.\"</p>\n<p>Loki understands enough of Darcy's vocabulary now that he is tempted to snap that this is inaccurate, as that is a courtesy Thor has <i>not</i> extended to him. He ignores the impulse, shrugging slightly. \"I do not begrudge him the desire to be useful.\"</p>\n<p>\"Uh-huh.\" Darcy sinks down in her chair. \"I'm seeing a whole lot of begrudging. I totally didn't know you were into her.\"</p>\n<p>This is so completely absurd that Loki's indifference slips; he stares at Darcy in pure astonishment.</p>\n<p>Her eyebrows go up. \"Or not. Okay.\" She turns, propping her elbows on the desk, chin in hands, and falls silent. Hoping that this is the end of it, Loki turns back to his papers, this time attending them with pencil in hand with the hope it will help him focus. This works for a few minutes; then Jane says something on a giggle, and Thor's bass laugh joins hers. The tip of Loki's pencil digs through the paper, tearing it.</p>\n<p>\"Ohmy<i>god</i>,\" Darcy says, in a whispered shriek. Loki looks up to see that she is staring at him with her mouth open; it is nearly comical. But Loki just regards her, composure perfectly in place, until Darcy blinks and looks away. \"Hey,\" she calls across the workshop, \"Jane!\"</p>\n<p>Jane disentangles herself. \"Yeah?\"</p>\n<p>\"Come over here a sec?\" Darcy asks. \"Loki has some equation ... thing.\"</p>\n<p>\"Sure.\" Jane smiles up at Thor. \"Back in a minute.\" Thor inclines his head graciously, and Jane trots over, transferring the cheerful smile to Darcy and Loki. \"So what's up?\"</p>\n<p>Loki opens his mouth, ready with a half-dozen excuses, but Darcy says, pitched low, \"What's up is you've gotta step off Loki's brother.\"</p>\n<p>\"What?\" Jane glances between Darcy and Loki, color suffusing her cheeks. \"Oh god, was I turning the flirt on? God, that's embarrassing -- it must be so awkward for you. Sorry, Loki. Of course, your brother's off-limits -- I didn't even mean --\"</p>\n<p>\"It's all right,\" Loki tells her quietly. He's strangely moved by her apology, made as it is out of genuine contrition rather than fear of him. \"It's best not to get your hopes up anyway. Thor's appreciation runs toward Asgardian warrior maids.\" He touches Jane's shoulder lightly, and returns with kind understanding the awkward smile Jane gives him.</p>\n<p>\"Okay,\" Jane says. \"Okay, um, star charts,\" and goes back to Thor, but Loki is pleased to see that she holds herself at a polite distance.</p>\n<p>\"'Asgardian warrior maids',\" Darcy mutters. She punches Loki's shoulder. \"You are freaking <i>evil</i>.\" Loki turns to her with a look of surprised bewilderment, but Darcy just rolls her eyes. \"It's cool,\" she says. \"I mean, it's not like he's <i>actually</i> your brother, and he's totally hot, so congratulations on getting dibs.\"</p>\n<p>As always, Darcy offers up gifts Loki has no idea what to do with. He bends his head to his equations again, but Darcy seems to be waiting for something, so he offers, quietly, \"Thank you.\"</p>\n<p>\"Mmhm.\" Darcy bounces up to go looking for her iPod, leaving Loki to himself. He tries to concentrate on the equations before him, but though Jane's apology has lowered his anger to a simmer, it is still there, twisting in his belly. If Thor still thinks to make light of what they have done, and be flirtatious with Jane Foster while Loki is in the same damned room, he must be made to see his error.</p>\n<p>For the rest of the day, Loki is patient, cradling his anger like a flame. When Jane discovers that, for all his charms, Thor doesn't understand a single principle of Midgardian math, she calls Loki back to the star charts. He calculates Jotunheim's position that afternoon, some twelve light years out in a different quadrant of space than Asgard's. By then evening is drawing down, and Erik offers to take them all out to dinner, but Loki smiles, a sharp cold smile, and declines for both himself and Thor. Erik takes one look at Loki's face and wisely chooses not to argue.</p>\n<p>Thor, of course, is not so wise. He does follow when Loki stalks out, heading for the apartment, but he does not do so quietly. \"Why did you turn them down?\" he demands. \"I like them. I would like to spend time with them.\"</p>\n<p>\"Not tonight,\" Loki says shortly.</p>\n<p>\"Loki --\" Thor reaches for his arm, but Loki ducks away, picking up his pace. Thor matches him stride for stride, but he does not ask again.</p>\n<p>The moment they're inside the apartment, Loki turns and slams Thor up against the door. Thor goes, more startled than anything, and returns Loki's furious kisses readily enough, but when Loki tears Thor's shirt off and goes kissing down his chest, still pressing Thor to the door, Thor says, uncertain, \"Loki, what --\"</p>\n<p>Loki draws back. \"On the bed,\" he snaps, fumbling to remove his own clothing. \"<i>Now</i>.\"</p>\n<p>He won't meet Thor's eyes, and for a long moment Thor hesitates. All the words Loki can think of are cutting and cruel, so he grits his teeth, and finally Thor moves, going to the bed, stripping as he does so. Loki takes a shaky breath, drawing in the tangle of rage and possession and desperation, waiting until they are all locked away and the only one they can hurt is Loki.</p>\n<p>Then he goes to take Thor apart.</p>\n<p>Loki tries to be gentle. He does. He kisses Thor, touches him, everywhere but his cock, until Thor is wide-eyed and panting, until he is reduced to gasping, \"Loki, <i>please</i>, let me --\" But Loki does <i>not</i> let him. Loki is already long past gentleness or sympathy; he climbs onto Thor and rides him, driving down, snarling, \"You won't even <i>look</i> at her like that, <i>ever again</i>.\" Whether Thor even knows what he means is no matter; he is matching Loki helplessly, clawing at Loki's back, babbling, \"Never, never, I swear,\" and it is so <i>good</i>, Thor's frantic hands leaving bruises, leaving bright streaks of pain. Loki loses himself. Loki forgets that this was about teaching Thor anything, and wraps around him, <i>taking</i>, taking everything Thor will give him, and comes screaming.</p>\n<p>Afterwards, he orders in for pizza.</p>\n<p>They eat together on the bed. \"This is good,\" Thor offers, around a mouthful of pepperoni; he swallows and adds, hesitantly, \"Loki, your back ...\"</p>\n<p>Loki half-turns to get a glimpse. Thor's nails have bit red streaks into his pale skin, and his shoulders are mottling with bruises. A grin creeps across Loki's face, and then he cannot rid himself of it; there is a pressure in his chest like wild joy, and even when he turns back to Thor he's still grinning. \"I know,\" he says. It comes out on a soft laugh. \"You did that, brother.\"</p>\n<p>\"I didn't mean --\" Thor says, uncertainly.</p>\n<p>Loki dusts the pizza crumbs from his fingers and stretches, feeling everything from the dull aches to the pains that still pull sharply. \"You're a terrible liar,\" he says. \"Of course you meant to. And you loved every moment of it.\" A red flush is creeping up Thor's cheeks, and Loki reaches out, touching Thor's face softly. \"Don't you <i>dare</i> be sorry.\"</p>\n<p>Thor looks away, and then, unexpectedly, turns and presses a fervent kiss to Loki's palm. \"I am glad,\" he says, barely above a whisper, \"of you, brother.\" He does look at Loki then, and there is something like pleading in his eyes. It is different from anything Loki has seen on Thor's face before. There is depth to the feeling there, and it is anything but simple; Loki's brother, to whom everything is simple, now looks <i>complicated</i>.</p>\n<p>The pizza box falls to the floor with a thump. Loki sprawls over Thor, kissing him softly, and allows it when Thor settles back, arms wrapped around Loki. <i>Got you,</i> Loki thinks, with a shiver of triumph. <i>I've got you.</i></p>\n<p>He falls asleep in Thor's arms, and dreams strange shadowed dreams. In one, Odin is sitting hunched on his throne, an old man, and the air around Loki sings with power, but the dream shifts before he can use it. In another, he softly treads a frozen wasteland, ancient ice buildings crumbling around him, and idly considers how he might remake this place. In a third, Loki sits before a fire, a bloody beating heart in his cupped hands, and can't remember what he's supposed to do with it. But none of these dreams trouble him, and they vanish upon waking.</p>\n<p>*</p>\n<p>Loki continues his mapping of Yggdrasil using the star charts. Jane is impeccably polite to Thor; Darcy smirks like she owns a secret, but otherwise behaves herself; and Erik acts just as he always does, but with a wary edge. Loki tolerates it, but with Thor there, reminding him, the world feels too small. He knows that Thor can feel it too.</p>\n<p>Thor is a mystery.</p>\n<p>Thor is quiet and courteous, without ever allowing that courtesy to become a show. He helps with the star charts, when he can. He makes Darcy laugh, and Erik smile, but he draws close to them rather than drawing them in. He helps Loki shop for groceries. He even goes to the diner, and replaces the mug he smashed. But his weapon hand sometimes grasps for the absent Mjolnir, and Loki catches him frequently gazing up at the sky.</p>\n<p>When they lie together, which is often, Loki cannot shake the feeling that he is barely managing to keep Thor from leaving, bound with fragile fetters of lust and love. For that Loki does anything Thor asks, anything he can think of, and only relaxes when he sees the smile of dazed satisfaction on Thor's face and knows he's earned himself at least one more day of his brother's company.</p>\n<p>On a gray morning, with rain pelting down with a sound like thousands of angry fingers against the glass, Loki reaches over the still-sleeping Thor for his cell phone and sends <i>I will come to the lab if the weather clears.</i> He gets no response from Erik, but Jane texts back <i>Ok see you later!</i> and, shortly thereafter, Darcy adds <i>have fun ;)</i> Loki considers this second message for a moment before smiling and sliding down under the covers to bid Thor good morning.</p>\n<p>\"Loki,\" Thor says afterwards, when Loki is wrapped around him in sinuous satisfaction and Thor's heavy hand is resting absently in Loki's hair, \"you need not try so hard.\"</p>\n<p>Loki is not quick enough to suppress the first involuntary stiffness of his muscles before the lie is ready and he relaxes. Still, his voice is absently content when he says, \"What are you talking about?\"</p>\n<p>Thor's hand tightens in Loki's hair and tugs, until Loki is forced to look up at Thor. Loki shivers. \"I mean,\" Thor says, \"that everything you do is -- is better than it needs be. I would love you still if you were less sure.\"</p>\n<p>\"If I acted the shy maiden, you mean?\" Loki does not bother disguising the sharp bitterness in his voice. \"But of course. Your magnanimity is boundless.\"</p>\n<p>The hand in Loki's hair twists a little. \"You don't make it easy, do you? I would give you a knife again if you could have an honest conversation that way.\" Loki grits his teeth and tries to jerk away, but Thor is holding him in place with both hands now, and it's too much effort to break free, especially when Thor adds, \"I'm <i>staying</i>, Loki, don't you understand?\" Loki stills. Thor shakes him gently. \"I'm of more use to you than I am to Father. And I think I could come to like this place. I want you by my side.\"</p>\n<p>Loki lets go of some small bit of tension. \"You're a terrible liar,\" he whispers, but he doesn't even believe himself. When Thor kisses him, he tastes of bloodlust and duty and the heavy air before a storm, but for Thor's sake Loki pretends that he knows none of these things, and that Thor is telling the truth.</p>\n<p>*</p>\n<p>The next day Loki wakes with his mind alight with something terrible. He lies there, trying to catalogue it; the light slanting in through the nearest window tells him it's already late morning, the hollow where Thor lay has gone cold, and the world is absolutely, fundamentally different. Loki sits up carefully.</p>\n<p>And he remembers.</p>\n<p>He remembers how to travel by shadow, how to walk on air, how to call up a flame in the palm of his hand. He remembers how to slip Heimdall's gaze and how to read the surface thoughts of an untrained mind. He remembers the secret names of stars and how to speak words of great power. Loki remembers, and he sits in his dingy useless human apartment, cracked open with joy, laughing harsh and wild.</p>\n<p>He dresses with shaking hands, and in a whisper his clothing is polished and elegant, Midgardian still but of far more princely quality than Loki Selvig could ever afford. Loki smooths his hair down in the mirror and then watches his face, carefully, until his mouth does not slant into triumph, until his eyes are no longer green chips of ice. Harmless. He never perfected it on Asgard, and it's the best lie of all.</p>\n<p>Loki slides through the reflection and arrives, unnoticed, in a corner of the workshop by one of the myriad convenient glass doors. He takes in the scene, just as it always is: Erik examining the star charts, Jane fussing with one of her pieces of homemade equipment, Darcy entering Jane's latest data into a computer. It is small, and futile, and makes Loki smile again for a moment before he masters himself.</p>\n<p>\"Jane,\" he says, strolling out. \"A word?\"</p>\n<p>Jane turns in surprise. \"I didn't hear you come in.\"</p>\n<p>\"Whoa.\" Darcy looks Loki up and down. \"Nice duds.\"</p>\n<p>Loki inclines his head to her. \"Thank you. Erik -- you may wish to see this as well.\" He goes to his desk and flips to a fresh page in his notebook. \"Now. The specifications for building a Bifrost of your own are still well beyond you, but here is the formula for the exotic matter necessary to stabilize the wormhole.\" He writes it out, in quick, efficient lettering. \"The conversion of matter and energy is much simpler.\" This equation follows. He straightens, capping the pen, and turns to the mortals. Jane's eyes are wide; Erik's are narrow; and Darcy still seems more interested in his clothing. \"I believe this concludes our business.\"</p>\n<p>\"Wait a second!\" Jane protests. \"This concludes our <i>business</i>? You just gave us the equations you've been working on for <i>weeks</i> -- what's going on?\"</p>\n<p>Loki smiles. \"In time. Where is Thor?\"</p>\n<p>He does not expect the hesitation that passes over their faces. Finally Erik says, \"Some ... people came by for him this morning.\"</p>\n<p>Everything in Loki goes very cold. \"People?\" he says. It comes out so soft and dangerous that Jane takes an involuntary step back, but Loki does not care to modulate his reaction for her sake.</p>\n<p>\"Yes,\" Erik says, meeting Loki's eyes. \"In armor. They told him he was urgently needed at home.\"</p>\n<p>\"Ah,\" Loki says, on a sigh. Something terrible is happening, but Loki has no time for it; he pushes it aside, to the corners of his awareness, and reaches out with his mind. There, a few miles out: the ozone-and-lightning imprint of the Bifrost lingering in the air. His vision races backwards from that spot, and in a moment he has them: Fandral, Hogun, Volstagg, and Sif, striding along with Thor in their midst.</p>\n<p>\"-- no idea how much I am looking forward to home,\" Thor is saying. He is not smiling, but the old light that kindles him from within is back, as it has not been for days. He stops, gazing up into the sky, and calls up, \"Heimdall! I am ready!\"</p>\n<p>The Bifrost crashes down, obscuring Loki's vision, breaking his concentration. He is snapped back to his body, and finds that his mortals are staring at him with white faces and wide eyes.</p>\n<p>\"Loki?\" Darcy ventures, tremulously. \"You okay?\"</p>\n<p>\"No,\" Loki says. He smiles, a smile that makes them blanch. \"But it is no matter. Those equations are accurate, and will make you heroes to your people; so your debt of kindness is repaid. Jane.\" He reaches out a hand to her, and after a moment, hesitantly, she takes it. Loki presses a brief kiss to the back of her hand. An imprint in frost sparkles there. \"All blessings on your house, and on your search for mysteries.\" He lets go, and Jane takes a shaky breath, cradling her hand against her chest. Loki turns. \"Darcy.\" She steps forward, her jaw set, and Loki brushes a brief kiss to her hand too. He says nothing, but Darcy meets his eyes, and swallows, nodding, taking all the silent thanks Loki can give her. When he releases her, she huddles up against Jane.</p>\n<p>\"Erik,\" Loki says.</p>\n<p>\"You're never going to tell us, are you,\" Erik says.</p>\n<p>Loki holds up a blue-white flame in the palm of his hand. \"You always knew,\" he says gently. \"And it's time for me to go, and make my mistakes.\"</p>\n<p>Erik gives a huff of shocked laughter. Loki can tell it's nearly too much for him to bear, but all Erik says is, \"Good luck, then.\"</p>\n<p>\"And to you.\" Loki bows.</p>\n<p>In the next moment he is a rising shriek over the desert, Puente Antiguo small and meaningless behind him. He materializes in a whirl of dust, destroying the Bifrost's imprint where he lands, and he stands there trembling. Distantly he knows that there is nothing left inside him but ice and shrapnel, lacerating him to ribbons, but it will only matter when the destruction is too great for him to bear, and oh, Loki can bear <i>anything</i>. \"Heimdall,\" he says, conversationally, to the sky, \"watch your post. You will not see me again until I wish to be seen.\"</p>\n<p>And Loki vanishes.</p>\n<p>*</p>\n<p>He is light that Heimdall cannot follow, falling away from Midgard, away from the familiar branches of the World Tree, into the spaces that are cold whispers between stars. By now he is nothing but a desire to <i>hurt</i>; he will make novas, he will crush Jotunheim to powder, he will tear Thor to pieces, and in the end he will stand before his father and say <i>Look at me. Look what you have wrought.</i></p>\n<p>But Odin would not have been such a fool as to give Loki back his power.</p>\n<p>The hunger for destruction fades under a desperate need for answers. Loki flashes from star to star, unbearable burning flares alternating with terrible vacuum darkness, but Loki has no time for subtler means. It takes countless ages, and by the time Asgard rises up before him, all shining towers like distant memories of belonging, Loki is a silent howl of agony.</p>\n<p>He slides along the colors of the rainbow bridge, past Heimdall, who stands unblinking and oblivious. Inside the palace, Loki is a whisper on gilded walls; guards and courtiers shiver at his passing, and every room holds the somber timbre of mourning. Loki goes directly to Odin's chamber, and there -- there on the bower is his father, encased in golden light. Not dead, but sleeping, and in sleep powerless to keep from Loki those things which are rightfully his.</p>\n<p>Frigga is sitting at Odin's side, half asleep. She looks tired and drawn, older than Loki remembers her, and he cannot resist reaching out to brush a stray curl from her cheek. Frigga blinks her eyes wide and looks about the chamber, but there is nothing to see. Loki is tempted to take the form she knows, but there are more urgent matters to attend, and he has no quarrel with her, this dear woman who did not bear him but still treated him with more unwavering affection than ever Odin did. Loki lingers a moment longer, memorizing her one last time, before slipping back out.</p>\n<p>Thor is easy enough to find, pacing in one of the antechambers. But he is not alone; Sif and the Warriors Three are with him. The fire at the center of the room flares with Loki's rage and frustration, but they are in heated discussion, and ignore it.</p>\n<p>\"-- know the Allfather cast him out for good reason!\" Sif.</p>\n<p>\"And what do you know of that reason?\" Thor snaps. \"You are above idle gossip, Sif.\"</p>\n<p>Sif looks away at that, but Fandral leans forward in his seat and says, earnestly, \"Thor, you know as well as we do that Loki is not to be trusted. I hardly need list reasons, and now, with what Heimdall said --\"</p>\n<p>\"I know Loki warned Heimdall to watch himself,\" Thor retorts. \"I would have done the same, if you'd vanished Loki back here without a pause for explanations.\"</p>\n<p>\"What,\" Volstagg puts in, \"you think he's as reasonable as all that?\"</p>\n<p>\"I think he is a man like any of us,\" Thor says, his voice hard. \"On Midgard I was all but useless; he was the one with allies, and with skills of worth. And you would care nothing that he is lost to us?\"</p>\n<p>\"You have bigger problems,\" Hogun says from a corner.</p>\n<p>Thor glares at him. \"I know,\" he says. \"And can any of you advise me? Does even one of you know of any better recourse than the war that my father would avoid at all costs?\" He looks around at each of them in turn, every inch a king. All of them are strong enough to meet his gaze, but none say a word. Thor nods grimly. \"Think as warriors, then, and help me that way,\" he says. \"But if you speak ill of Loki again, I will not be so forgiving.\"</p>\n<p>It is a clear dismissal, and they take it as one; Fandral and Volstagg exchange glances and rise, leaving the room with Hogun following. Sif lingers for a moment, watching Thor closely. \"Something happened,\" she says. \"What was it?\"</p>\n<p>\"An understanding,\" Thor replies. His face softens a little. \"I hope.\"</p>\n<p>\"So do we all,\" Sif says, touching his shoulder lightly, and leaves him.</p>\n<p>By now Loki is a shiver of excitement in the embers of the fire. He waits until Thor has turned away; then he rises, clothed in flame for a moment before he is back in his armor, in the false skin he knows. \"Brother,\" he says.</p>\n<p>Thor turns, eyes lighting. \"<i>Loki</i>,\" he breathes, and without warning Loki is being pulled into a fierce kiss and crushing embrace. After so long as light across stars, the feeling of Thor's solid physicality is overwhelming, and Loki makes a choked noise of pained pleasure. Thor pulls back enough to search his face. \"You left,\" he says. \"I would have sent for you.\"</p>\n<p>\"I know,\" Loki says, and the truth of it, the honest <i>knowing</i>, is nearly too much weight to bear. \"So you're king.\"</p>\n<p>\"I am,\" Thor says, and swallows. \"Loki. With both of us back -- we have broken Father's treaty with the Frost Giants.\"</p>\n<p>Loki hears the words Thor does not say: <i>And I don't know what to do.</i> He smiles, stepping back from Thor. \"That is well; aren't you eager to make war with them? Don't you want to teach the Jotuns to fear you as they feared Father? Or would you stand giving speeches while Asgard falls?\"</p>\n<p>Thor winces. \"Trust your memory to be as sharp as your tongue,\" he says. \"What would you have me do?\"</p>\n<p>Oh.</p>\n<p>Loki is in no condition to act the advisor. He is exhausted and rung out, desperately furious with Odin, riding down from his desperate fury at Thor; he is still made of ice and shadows and starlight more than flesh, and he feels half-drunk with the restoration of his power. And here Thor is, asking him, <i>trusting</i> him. What happens to Jotunheim is Loki's affair.</p>\n<p>And it would be so <i>easy</i>. The Bifrost is pure destruction if left open too long. Pointed at Jotunheim, it would shatter the planet to rubble. There would be no war, not a single drop of Asgardian blood spilled. It is a brilliant display of intellect, proof that Loki knows how to apply force, much more precisely and effectively than ever Thor did. It is exactly what Loki needs to satisfy the desire to wreck something. It would rid the worlds of that part of Loki he most despises. It is <i>perfect</i>.</p>\n<p>A month ago, Thor would have found it cowardly, but he would have agreed to it. Loki knows he will never say yes now.</p>\n<p>\"I will go to them,\" Loki says. \"I will have them reconsider.\"</p>\n<p>Thor regards him with undisguised hope and pride. \"You would do this?\"</p>\n<p>\"I imagine we have some common ground,\" Loki points out quietly. \"I don't know what permanent peace Father thought to make -- I hardly expect Laufey to greet his bastard child with open arms -- but I may still be sufficient leverage.\"</p>\n<p>Thor grins. \"Good.\"</p>\n<p>\"But not yet,\" Loki tells him. \"You haven't learned the first thing about kingship, have you? There is much to do.\"</p>\n<p>\"Yes,\" Thor agrees. \"And first of all, we must tell Mother of your return.\"</p>\n<p>Loki blanches; he is still much too tightly wound to intrude upon her time. But he also has nothing left with which to argue this, so he nods his acquiescence.</p>\n<p>They go to Odin's chambers together; when Frigga sees Loki, she springs up and rushes to envelop him in a hug that smells of perfume and linen and home. Loki tucks his head into the junction of her neck and shoulder, swallowing tears. \"How glad I am to see you, my dear,\" Frigga murmurs. \"I'm so very sorry, Loki.\"</p>\n<p>Loki draws back. \"You never told me.\"</p>\n<p>\"I know.\" She touches his face softly. \"The heavens know we debated it often enough. Perhaps he will see my side of things when he wakes.\"</p>\n<p>A frisson of fear goes through Loki. \"His word is law. Thor is not crowned. And I cannot -- I won't --\"</p>\n<p>\"I'm drafting a pardon for you,\" Thor says. He glances at Frigga. \"And I'll speak with Father. We both will. If Loki makes a treaty with Jotunheim, surely that will make reparations enough for the business at my coronation.\"</p>\n<p>Frigga nods. \"It will be something, at least,\" she says. \"Now, for that pardon, and then we must check our defenses, and weapons stores, and see to it that our allies on Alfheim and Vanaheim know that the house of Odin is still strong.\" She looks between them. \"Go on, then.\"</p>\n<p>So through the long evening Loki writes endlessly, sometimes correcting Thor's choice of words, considering all the politic and reassuring things they might say. Going through the motions, he feels strange. Of all Loki's ambitions, the throne of Asgard was never one of them. Being forever a prince granted him some freedom from responsibility, and so it should still, yet here he is, doing all he can for these people who have made and unmade him, who distrust him and love him yet. Grief and elation and exhaustion and rage tangle together in his head, until at last Thor drags him from his papers.</p>\n<p>\"Enough,\" Thor tells him. \"Go to bed, or it will be of no use, sending you to Jotunheim in the morning.\"</p>\n<p>Loki shivers, but he says only, \"Very well.\" He does not tell Thor that he hasn't yet decided what to do with the Jotun. The possibilities are frightening, but he doesn't tell Thor that, either. Instead he gives Thor a brief kiss, and smiles a slight, wry smile when Thor comments that his hands are cold. \"Goodnight, brother,\" Loki says quietly, and retires to his familiar bed of down and heather.</p>\n<p>*</p>\n<p>He dreams he is sitting, comfortably cross-legged, in the midst of formless golden light like that aura that surrounds his father in the Odinsleep. Where the light touches Loki's skin it tingles faintly, like static. He watches it play over his hand with mild interest.</p>\n<p>\"So here you are,\" Odin says.</p>\n<p>Loki looks up to see that Odin is sitting with him, in informal robes, every inch a king and much less tired-looking than Loki remembers him. He eyes Loki with a look Loki cannot decipher.</p>\n<p>\"Well met, Father,\" Loki says.</p>\n<p>Odin snorts softly. \"So it's 'Father' still. That is something. We have used each other ill, Loki, you and I, and I am not a forgiving man.\"</p>\n<p>\"Nor am I,\" Loki murmurs. \"Where does that leave us?\"</p>\n<p>\"You are dangerous,\" Odin says.</p>\n<p>Loki smiles. \"Yes.\"</p>\n<p>The light glints off Odin's eyepatch, momentarily blinding. \"And where does your loyalty lie?\"</p>\n<p>\"With myself,\" Loki says, because it is good to tell the Allfather what he wishes to hear. But he thinks on it, and the answer is obvious. \"With Thor,\" he says, \"and with you, no matter how you have used me.\"</p>\n<p>\"Loki,\" Odin sighs. But it is not disappointment nor resignation; Odin is merely at a loss. He settles a hand on Loki's shoulder, light as a raven's feather. \"Will you do it, then, and make your father proud?\"</p>\n<p>Loki is filling up with light. \"Yes,\" he whispers, and wakes to a soft morning.</p>\n<p>It is no kind of ending. Loki does not for a moment imagine that Odin will change what he is for Loki's sake. But he is strangely settled in his skin, an alien but not uncomfortable feeling, so he rises with purpose. He dresses the nonmagical way, one item at a time, arming himself with each layer. In the end he stands there, Loki Odinson, and that is enough.</p>\n<p>He sets out on foot to the bridge and Heimdall's observatory, keeping in plain sight, cherishing the span of familiar stars overhead and the glimmer of nebulae on the horizon. His footfalls throw out ripples of color; Loki strides through cascades of power and knows how it works, all of it. Then Heimdall is standing before him, all in gold, and Loki sketches him a bow. \"Gatekeeper.\"</p>\n<p>\"Loki,\" Heimdall says. \"You would go to Jotunheim to parlay?\"</p>\n<p>\"Yes.\" Loki meets Heimdall's gaze and, for the first time in his life, he holds it, giving no quarter. That Heimdall can see through him holds no horror now; neither is Loki going to apologize.</p>\n<p>\"Stay in my sight,\" is all Heimdall says, and he turns to go to the Bifrost.</p>\n<p>For all of Loki's secret ways, the Bifrost is still his favorite to travel. There is elegance to being drawn into an endless tunnel of light, pulled along the veins of Yggdrasil where energy runs a thousand times as swiftly as thought, and deposited on the other end with a roar and a light-footed landing.</p>\n<p>Jotunheim is still a cold-lit desolation. Ancient towers crumble around Loki as he walks, and his lip curls with distaste. He cannot imagine what it would be like to grow up here, and to live knowing nothing but the ruins of former glory and a bloody rage at an enemy who had bested the Jotun by so simple a trick as theft. The Jotun <i>deserved</i> their defeat, for putting all their faith and power into the Casket of Ancient Winters.</p>\n<p>For a moment Loki wonders what he might do with that casket, but the question is academic, so he pushes it from his mind.</p>\n<p>Finally he reaches the open pavilion which Laufey styles his throne room. Loki stands unconcerned, feeling the cold not at all, and waits with the casual arrogance of a prince expecting an audience. Soon enough there are large shapes looming in the shadows around him, unsubtle but quiet. Loki waits, and then Laufey is there, glowering down at him.</p>\n<p>\"So,\" Laufey says, in a rumble like the movement of far-off glaciers, \"tell me. Why shouldn't I kill you?\"</p>\n<p>Loki spreads his hands in a gesture of unconcern. \"I've come alone and unarmed.\"</p>\n<p>\"To what end?\" Laufey asks.</p>\n<p>\"To make you another proposition,\" Loki says, delicately. A plan is forming, and he wants to laugh. And he wants Laufey to say no, so that he can destroy them all, but that, too, might be a lie.</p>\n<p>Laufey is watching him closely. \"So,\" he says, \"you're the one who let us into Asgard.\"</p>\n<p>Loki smiles. \"You're welcome.\"</p>\n<p>Laufey's red eyes narrow. \"My men are dead,\" he says, \"and I have no Casket.\" He lashes out to seize Loki by the throat, vicious, but slow enough that Loki has more than enough time to dodge or defend himself. Instead Loki stands his ground, and his skin shifts under Laufey's grip. Jotun. Laufey's eyes widen; after a moment his grip eases, and he releases Loki, leaning back. \"Ah. The bastard son. I thought Odin had killed you -- that's what I would have done. He's as weak as you are.\"</p>\n<p>Loki holds his calm smile while the blue fades from his skin. Inside, everything is very sharp and bright. Laufey is making this so <i>easy</i>. \"No longer weak,\" he says. \"I now rule Asgard, until Odin awakens.\"</p>\n<p>It gives Laufey pause. \"I will hear you.\"</p>\n<p>\"I have no desire for war,\" Loki says. \"Reparations have been made for Thor's actions, as you well know. Your cause to war is now no more than it was when Odin first made your treaty. What reason Odin took me for, I don't know, but I have my own reason: Asgard is mine, and the Casket is mine -- I can use it, as no one else on Asgard can, and I can destroy it too, if you choose to break that treaty again. I am not so kind as Odin.\"</p>\n<p>Laufey sucks a breath through his teeth, in a sound like winter wind. \"And if I kill you now?\"</p>\n<p>Loki laughs. \"Then the kingship will fall to Thor, and all will end in blood. You know I speak truly.\"</p>\n<p>\"Yes,\" Laufey growls. \"I see it in your face.\" His eyes narrow. \"I should have killed you myself when I had the chance.\"</p>\n<p>\"So you accept my treaty, then?\" Loki asks. In his head there is a voice, wild with laughter, crying, <i>Reject me, try it, lay one hand on me again and you will be </i>atoms<i>, all of you, and your pathetic ruin, nothing but dust.</i> Outwardly he holds to that slight, polite smile.</p>\n<p>\"I,\" Laufey grinds out, \"accept.\" The red eyes bore into Loki's. \"But it cannot last. You are a bastard child alone in the wilderness, and one day you will fall.\"</p>\n<p>Loki shrugs lightly. \"We all tell lies to comfort ourselves,\" he says. \"Good day, Father.\"</p>\n<p>When he leaves none of the Jotun contest it, and no one attacks him as he makes his way back to the Bifrost site. Loki's blood sings for a fight. But he does not waver, and he does not call for Heimdall; the Bifrost snatches him up at once. So Heimdall was watching. It is a strange comfort, but Loki takes it.</p>\n<p>*</p>\n<p>Thor meets him in the hallway outside Loki's chambers. He takes one look at Loki's face and asks, with some indefinable mix of concern for Loki and faith in him, \"How did it go?\"</p>\n<p>\"We have our treaty,\" Loki tells him. Thor stands there, bright and beaming at the news, carefree and proud, and Loki's mind is still howling destruction, and Laufey's voice is in his ear, <i>it cannot last</i>. \"Thor,\" Loki says. His voice cracks. \"I lied. I told them I was king, and I told them that if they tried anything I would destroy them and their casket. It should hold. It should hold until Father is back, and even if they learn you are king, my threat is good.\"</p>\n<p>\"It is,\" Thor agrees at once. His eyes plead with Loki to come to him, but Loki is shivering, and turns away for his chambers. He does not protest when Thor follows him, though, shutting the door quietly behind them. His rooms are scattered with papers and the various small objects essential to difficult spells, all exactly as he left it, and Loki draws comfort from that. He sinks down on his bed. After a moment's hesitation, Thor sits down beside him, but leaves Loki space.</p>\n<p>\"Please,\" Loki says, \"don't say it will be all right. Father has me outmaneuvered at every turning. I think I would destroy Jotunheim if you would let me. No one here will ever trust me, never mind I stopped a war.\"</p>\n<p>\"I know,\" Thor says quietly. \"As much as I want to protect you --\"</p>\n<p>Loki laughs, short and painful.</p>\n<p>\"All I have to offer is myself,\" Thor tells him, very serious. \"I know it's not enough.\"</p>\n<p>Thor means it. Thor, who basked in the cheering of crowds, who made a spectacle of his battles, who shone so bright and took the awe around him for granted, thinks he is not even enough to shore Loki up. Loki waits for the moment of dark triumph, but there is nothing in him but a spill of affection for his fool of a brother. He climbs onto Thor's lap and pushes him backwards. Thor obligingly sprawls out, looking up at Loki in confusion. Loki leans down to kiss him, possessively, thoroughly.</p>\n<p>Against Thor's lips he murmurs, \"It is sufficient,\" and that is the truth.</p>"
}