{
  "id": "21383248",
  "url": "https://archiveofourown.org/works/21383248?view_full_work=true",
  "author": [
    "etymologyplayground"
  ],
  "title": "You, Asleep and Dreaming",
  "rating": "Mature",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "陈情令 | The Untamed (TV)",
    "魔道祖师 - 墨香铜臭 | Módào Zǔshī - Mòxiāng Tóngxiù"
  ],
  "relationships": [
    "Lan Zhan | Lan Wangji/Wei Ying | Wei Wuxian"
  ],
  "characters": [
    "Lan Zhan | Lan Wangji",
    "Wei Ying | Wei Wuxian"
  ],
  "additional_tags": [
    "LWJ POV",
    "5+1 Things",
    "Literal Sleeping Together",
    "Sharing a Bed",
    "Cuddling & Snuggling",
    "Intimacy",
    "Getting Together",
    "Fluff",
    "November Is For Getting Cozy.",
    "Post-Canon",
    "Undressing",
    "wwx's 'angry lwj' kink",
    "Spanish Translation"
  ],
  "language": "English",
  "series": "",
  "published": "2019-11-10",
  "completed": null,
  "words": "9,632",
  "chapters": "1/1",
  "comments": "750",
  "kudos": "18,816",
  "bookmarks": "5,705",
  "hits": "175,326",
  "summary": "<p>Wei Wuxian chuckles and starts pushing Lan Wangji's outer robes off his shoulders. \"Poor Lan Zhan, subject to such earthly miseries. You must be exhausted, come to bed, come to bed.\"</p>\n<p>\"Mm,\" Lan Wangji says. He raises his arms so that Wei Wuxian can keep undressing him. His clothes will end up on the floor, but no matter. Wei Wuxian's deft hands at his belts are worth wrinkled robes.</p>\n<p>\"... Goodness, Hanguang-Jun, you wear too many damned layers,\" Wei Wuxian tells him after a while. \"Would it kill you to stop after a reasonable five?\"</p>\n<p>--</p>\n<p>Wei Wuxian moves into the Jingshi. They sleep together.</p>",
  "notes": "<p>translation in spanish | traducción en español <b><a href=\"https://www.wattpad.com/story/238707854\" rel=\"nofollow\">here!</a></b></p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>THE END</p>\n<p>--<br>*takes a break from writing my 40k wangxian to write a 10k wangxian* this is reasonable</p>\n<p>CREDIT WHERE CREDIT'S DUE: the little bit where lqr is like \"at least move a second bed into the jingshi\" and lwj is like \"that's awfully optimistic of him\" is a reference to <a href=\"https://archiveofourown.org/works/20473640/chapters/49031558\" rel=\"nofollow\">this delightful fic</a> bc i thought it was SO funny</p>\n<p>MMghjhhmgMMHM SNUGGLING... BEING COZY... ITS NOVEMBER ITS TIME TO GET COZY</p>\n<p>title from <a href=\"https://www.youtube.com/watch?v=RJsK2mSUwnM\" rel=\"nofollow\">asleep and dreaming</a> by the magnetic fields</p>\n<p>find me on twitter @sanlanglovemail or on tumblr @megafaunatic !!</p>",
  "text": "<p>\n<span>The first day he has Wei Wuxian back after their almost year-long parting, the two of them arrive in the Cloud Recesses an hour after curfew. Lan Wangji had not been planning on being out so late, but of course he hadn't planned to find Wei Wuxian playing a love song on the edge of a cliff, either. With their speed reduced to the gait of Wei Wuxian's ridiculous donkey, it takes the two of them hours longer to get back to the Cloud Recesses than it had taken Lan Wangji to leave; but it's fine, because they're together, and any time spent together is better than time spent apart. </span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian had embraced him, then, on the cliff, his hair and clothes smelling of sweat and earth and the distant sea. Lan Wangji had held him close and wanted to kiss him. He had not kissed him; instead Wei Wuxian had pulled away a little and said, \"Lan Zhan, let me come with you to Gusu,\" and Lan Wangji had said, \"We are already in Gusu,\" and Wei Wuxian had laughed at him and stepped away.</span>\n</p>\n<p> </p>\n<p>\n<span>Now they are in the Cloud Recesses, walking quietly in the dark to the kitchen, so that Wei Wuxian may eat at least one warm meal today. Lan Wangji heats leftover broth from dinner and throws some chopped vegetables in a wok as Wei Wuxian makes rice. \"Aren't we breaking rules, making food after dark?\" Wei Wuxian asks him in a gleeful whisper.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yes,\" Lan Wangji admits. \"But it's no trouble.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Isn't it?\" Wei Wuxian insists. \"I know you people added another thousand rules, I don't plan on writing or learning any of them.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"As the current highest-ranking Lan disciple, I have decided to pardon us,\" Lan Wangji tells him magnanimously. Wei Wuxian barks a surprised laugh and helps him pack the food onto a little tray.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Lan Zhan ah! Already abusing your authority, eh, Your Excellency?\" he teases.</span>\n</p>\n<p> </p>\n<p>\n<span>\"It's not an abuse of authority,\" Lan Wangji tells him as he cleans the wok. \"It's being a good host. Wei Ying is my guest; to let him go hungry would be a disgrace.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I see, I see,\" Wei Wuxian says, nodding thoughtfully. \"Well, this humble guest thanks GusuLan profusely.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji waves his gratitude away. \"No need for thanks, between us,\" he reminds him. Wei Wuxian smiles big and crooked, and they walk back to the Jingshi in considerate silence. Once there, Lan Wangji produces the bottle of chilli oil he's taken to keeping and gives it to Wei Wuxian, who beams at him again and immediately dumps it all over the perfect, mild food Lan Wangji had made for him. He's such a fool. Lan Wangji adores him.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji sits across from him and watches, feeling inordinately fond, as Wei Wuxian shovels food into his mouth and makes the occasional little happy sound. Lan Wangji himself doesn't particularly need to eat; he had eaten just before he left, and a golden core ensures that one needs less sustenance than an ordinary person might. Still, Wei Wuxian remembers himself halfway through his meal and tries to offer some food to Lan Wangji.</span>\n</p>\n<p> </p>\n<p>\n<span>\"I'm not hungry,\" Lan Wangji demures. \"And I have no bowl or utensils.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Open up then,\" Wei Wuxian advises him, brandishing a chunk of cabbage at him. Lan Wangji watches as chilli oil drips off of it. He leans forward and opens his mouth obediently anyway. Wei Wuxian carefully places the cabbage on his tongue. Lan Wangji's eyes start watering immediately and he wills himself not to choke. To chew and swallow.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Thank you,\" he says weakly.</span>\n</p>\n<p> </p>\n<p>\n<span>\"No thanks between us, Lan Zhan. It's good, right?\" Wei Wuxian asks him. \"I think it's good.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji nods. \"It is,\" he says, meaning that it is good when Wei Wuxian hand-feeds him. The food is terrible, bless him.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Lan Zhan ah Lan Zhan,\" Wei Wuxian sighs in contentment. \"You may be the only person alive who can stand the stuff I eat!\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mmn,\" Lan Wangji agrees.</span>\n</p>\n<p> </p>\n<p>\n<span>\"I'll have to go into town and get ginger,\" Wei Wuxian says speculatively. \"And other spices. Peppercorns and things. And peanuts for sauces, and interesting curries, and different kinds of fresh peppers…\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"You mean in Caiyi?\" Lan Wangji asks. The market in Caiyi is well-stocked enough, but he's not convinced that they'll have such a variety of ingredients.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Sure, sure,\" Wei Wuxian says. \"I thought I'd stay here for a while. Is that alright with you?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yes,\" Lan Wangji says at once. \"Stay as long as you wish.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian pauses and smiles at him. \"Mark your words,\" he says, his voice warm. \"You say that now, but next thing you know I'll have borrowed my way into your life like a woodworm. You'll be begging me to leave and I'll say, </span>\n<em>\n<span>No, no, Lan Zhan, I'm here to stay!\"</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji feels his eyes narrow in pleasure. \"I could live with that,\" he decides.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian's smile widens. \"You're my favorite,\" he says cheerfully, as if Lan Wangji hasn't been longing to hear him say such a thing since they were teenagers. \"You're my favorite person, Lan Zhan. This humble guest will endeavor not to annoy you too much, okay?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Okay,\" Lan Wangji says, his heart beating huge and hot in his chest.</span>\n</p>\n<p> </p>\n<p>\n<span>\"I'm serious, if I start to be annoying you have to tell me, alright?\" Wei Wuxian insists.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Alright,\" Lan Wangji agrees. He does not anticipate that this will be a problem. </span>\n</p>\n<p> </p>\n<p>\n<span>They clean the dishes together, and then Lan Wangji draws a bath for Wei Wuxian, then sets up a privacy screen and sits down at his desk to work while Wei Wuxian bathes. Wei Wuxian hums to himself behind the screen and chatters aimlessly about food and his travels and various things he wants to do in the Cloud Recesses. Mostly he has some ideas about cultivation theory that he wants to double check against books in the library, which can certainly be arranged. Lan Wangji tells him so, at which point Wei Wuxian pauses in instinctive surprise at having been answered, and then he responds with enthusiasm.</span>\n</p>\n<p> </p>\n<p>\n<span>\"I forgot I wasn't alone,\" he admits. \"Ah, it's so good to be with you again.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mm,\" Lan Wangji agrees. It's good to have Wei Wuxian with him.</span>\n</p>\n<p> </p>\n<p>\n<span>It isn't that it's too late in the day to arrange for a separate room for Wei Wuxian. It isn't that all the beds are full or even that Lan Wangji wants to keep an eye on him tonight. It simply does not occur to either of them to pursue separate sleeping arrangements until they're both wearing just clean underrobes, standing in front of Lan Wangji's bed.</span>\n</p>\n<p> </p>\n<p>\n<span>\"I can take the floor,\" Wei Wuxian offers half-heartedly.</span>\n</p>\n<p> </p>\n<p>\n<span>\"No. You're my guest,\" Lan Wangji tells him. He does not offer to take the floor instead.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yeah okay,\" Wei Wuxian says, and he climbs onto the bed and scoots over to sit near the wall so there's room. Lan Wangji sits down beside him, feeling like he ought to be more flustered than he is. \"I'm still going to be awake for a couple hours,\" Wei Wuxian warns him, brandishing his notebook.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji unties his forehead ribbon and lies down. \"That's fine,\" he says. \"Extinguish the candles when you sleep.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Sure, sure.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji closes his eyes. \"Goodnight, Wei Ying.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian's hand appears in his hair, petting it gently and then tracing down his face and throat until his fingers lie curled loosely over his chest. They stay there, warm and protective, and Wei Wuxian says, \"Goodnight, Lan Zhan.\"</span>\n</p>\n<p> </p>\n<p>\n<span>*</span>\n</p>\n<p> </p>\n<p>\n<span>(Lan Wangji wakes up, briefly, when Wei Wuxian removes his hand, blows the candles out, and shuffles down the bed to lie down properly. Lan Wangji tilts his head towards him and makes a sound to indicate that he's awake, and Wei Wuxian bumps their foreheads together gently. \"Did I wake you?\" he asks. \"Sorry.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mmmmm,\" Lan Wangji mumbles. He's so sleepy and comfortable, with their shoulders and upper arms pressed together like this in the dark. \"'s fine. I'll wake you in the morning.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian huffs a laugh. \"So you shall,\" he agrees.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji sighs in satisfaction. He loves that Wei Wuxian is here to wake him and be woken. He shifts his leg to bump Wei Wuxian's socked foot with his own, and Wei Wuxian responds by slinging his foot over, so their legs are crossed at the calf. Lan Wangji hums his approval.</span>\n</p>\n<p> </p>\n<p>\n<span>\"I missed you,\" Wei Wuxian whispers into the dark. \"While I was gone. I missed you a lot.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji breathes in slowly through his nose. No one has ever missed him before, he thinks. Maybe his mother did. He doesn't know. \"I missed you too,\" he says.)</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>*</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>The next day Lan Wangji is busy with Chief Cultivator activities right up until dinner, and Wei Wuxian is busy whirling around saying hi to disciples and ransacking the library, and then they eat together and then they talk about how the day went and they forget again to arrange some other sleeping situation, so Wei Wuxian stays with him in the Jingshi again. The day after that Lan Wangji really does have a guest room prepared, but then Sizhui and Wen Qionglin arrive home at last from their travels, and while Sizhui has his own quarters, Wen Qionglin really ought to have his own room too by now, and goodness, what a coincidence, this guest room was just cleaned up this morning!</span>\n</p>\n<p> </p>\n<p>\n<span>The day after that Lan Wangji comes home to find two sets of Wei Wuxian's dark robes folded in his wardrobe and he gives up on pretending that he wants anything other than this.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian is sitting at Lan Wangji's desk, so he notices when Lan Wangji pauses upon opening the doors of the wardrobe. \"Oh,\" he says, \"Is that okay? I did laundry and I thought I might as well fold everything for once, and I didn't want to just leave things lying around, so…\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji stares into the wardrobe. White. White. Pale blue. White. Slightly less pale blue. White again. Silver. White. Then dark red. Grey. Dark red. Black. \"It's fine,\" he says. He closes wardrobe. He can't remember why he was looking in there in the first place.</span>\n<span></span><br>\n<br>\n</p>\n<p>\n<span>\"Come look at what I'm working on,\" Wei Wuxian tells him, so he does.</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>*</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>Two weeks after Wei Wuxian arrived in the Cloud Recesses, Lan Qiren informs Lan Wangji that he's had a pair of disciples find an extra bed and they've taken it to the Jingshi, Wangji, it's kind of you to share your space with your guest but it really isn't necessary to go to such lengths, Wangji. Lan Wangji thinks this is very optimistic of him. When he gets back to the Jingshi that evening there is no extra bed. Wei Wuxian doesn't say anything about it. Lan Wangji presses his face to the warm firmness of Wei Wuxian's hip when he lies down that night, breathes in the smell of warm clean cotton and the beloved scent of his body, and Wei Wuxian pets his hair until he falls asleep.</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>*</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>It is almost three weeks before Wei Wuxian wakes Lan Wangji with a nightmare. Ordinarily he tends to twitch in his sleep, and every once in a while he'll mumble quietly to himself; tonight Lan Wangji wakes to Wei Wuxian thrashing and crying out in the dark. Lan Wangji sits up abruptly, disoriented, and then he realizes what's happening and he catches Wei Wuxian's wrists in the air before he can hurt himself. \"Wei Ying,\" he says. \"Wei Ying, wake up.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"No!\" Wei Wuxian cries, curling in on himself. \"No, no, shijie! Get — get away from her!\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji's heart breaks. \"Wake up,\" he repeats, a little louder. \"Wei Ying!\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Shijie —!\" Wei Wuxian gasps. He jolts upright, and then he stops breathing for a long moment, his whole body going still. At last his eyes open, dark and wet with tears, and he inhales shakily. Lan Wangji releases his wrists in favor of wiping his tears away. \"Lan Zhan?\" Wei Wuxian croaks.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mn,\" Lan Wangji replies. \"I am here. You were having a nightmare.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian gives a little sigh and leans into his side. \"I woke you up,\" he guesses.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mm,\" Lan Wangji agrees. He puts one hand on Wei Wuxian's back and draws the fingers of his other hand through his hair.</span>\n</p>\n<p> </p>\n<p>\n<span>\"I don't deserve comfort,\" Wei Wuxian mutters.</span>\n</p>\n<p> </p>\n<p>\n<span>It hurts to hear. But he doesn't move away, so Lan Wangji tells him, \"You will receive it regardless,\" and he laughs wetly. Lan Wangji keeps finger-combing his hair, and Wei Wuxian relaxes into him, warm and pliant now.</span>\n</p>\n<p> </p>\n<p>\n<span>\"That feels nice,\" he mumbles.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Good,\" Lan Wangji says. He lies back down, pulling Wei Wuxian gently with him. Wei Wuxian goes willingly, sighing, and arranges himself so that he's draped half over Lan Wangji's chest, his head tucked under Lan Wangji's chin. \"I've got you,\" Lan Wangji tells him quietly, stroking his hair over and over. </span>\n</p>\n<p> </p>\n<p>\n<span>\"Mmn,\" Wei Wuxian agrees. His fingers tangle sleepily in the back of Lan Wangji's shirt.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Sleep,\" Lan Wangji says, and they do.</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>*</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>Wei Wuxian has never been shy with his touches, and Lan Wangji has always been happy to reciprocate. But since Wei Wuxian's nightmare, they have been touching more and more — more frequently, for longer periods, with greater intimacy — and Lan Wangji feels that with each brush of his fingers on Wei Wuxian's waist, he lurches closer to the edge of the storm that has been building inside him since they met. When the storm finally takes him, there will be no graceful retreat: only wet and wind and howling. And Wei Ying.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Ying, grabbing his wrist to pull him somewhere. Wei Ying, approaching him from behind and announcing his presence by sliding an arm around his waist. Wei Ying, sitting down next to him on the porch of the Jingshi in the blue of the evening, so close that their shoulders and knees press together. </span>\n</p>\n<p> </p>\n<p>\n<span>Wei Ying, who is now lying on his back in the center of their bed, holding a book above his head so he can read while Lan Wangji bathes. Usually he sits at the desk to read, or he sprawls out on the floor, but not tonight. Lan Wangji wrings his hair out over the tub and tells him, \"You'll have to move in a moment.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Hmmm,\" Wei Wuxian replies. Non-committal. Lan Wangji slips his inner shirt on, steps into his trousers. Ties all his ties. Folds his forehead ribbon neatly and places it on his clothes for tomorrow. He pads barefoot around the privacy screen to see if Wei Wuxian has moved yet, which of course he has not.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Wei Ying.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian lowers his book and looks up at him with his big dark eyes, looking very innocent. \"Don't make me move, I'm cozy,\" he protests. \"Look at me, I'm all tucked in.\" He wiggles his feet under the quilt.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji is not really asking him to untuck himself, or to leave the bed. There just isn't room for Lan Wangji to lie down next to him if he's in the middle of the bed like that. He considers explaining this.</span>\n</p>\n<p> </p>\n<p>\n<span>Then he plucks Wei Wuxian's book out of his hands and flips the quilt open, to an immediate \"Ah ah ah Lan Zhan!\" from Wei Wuxian. Lan Wangji ignores his protests and crawls into bed on top of Wei Wuxian, holding the book carefully so he doesn't jab it into Wei Wuxian's ribs. Once he's settled, with their legs alternating neatly and his face tucked into Wei Wuxian's throat, he hands the book back. </span>\n<em>\n<span>\"Thank</span>\n</em>\n<span> you,\" Wei Wuxian sniffs.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mm. You are cozy,\" Lan Wangji tells him. </span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian huffs and shifts around a little to get comfortable. \"I told you so,\" he says. Lan Wangji smiles into his neck. Wei Wuxian drums his fingers on his back, then just keeps his hand there as he goes back to reading. It's good to be on top of him like this, all warm and quiet, rising and falling with his breathing. His heart is a rabbit running. Lan Wangji falls asleep there, lulled into dreams by the sensation of Wei Wuxian alive underneath him.</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>*</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>(Wei Wuxian wakes him up at midnight by scritching his back pointedly. \"Lan Zhan,\" he whispers. \"I can't reach the candle like this.\" His chest shakes as he flails one arm around in demonstration.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mmmmmm,\" Lan Wangji says into his throat. \"What do you propose I do about it?\" If Wei Wuxian wants him to move, he'll move. But he'll be sad about it.</span>\n</p>\n<p> </p>\n<p>\n<span>\"You've got spiritual power for a reason, go ahead and blow them out for me,\" Wei Wuxian tells him.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji smiles and obeys with a sleepy flick of his wrist. Darkness swallows the Jingshi. Wei Wuxian's book-holding hand appears on his back, and he squeezes Lan Wangji close. \"Good boy,\" he whispers. \"Good good boy. G'night, Lan Zhan.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mm. See you tomorrow, Wei Ying.\")</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>*</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>Deer </span>\n<em>\n<span>(not </span>\n</em>\n<span>rabbits) get into the medicinal herb garden and eat almost everything overnight, and Wei Wuxian, as the person with the most free time on the entire mountain, spearheads the project of replanting everything. It's early summer already, so it's not the best time to be planting most of the herbs in question, but Wei Wuxian really does seem to be a master gardener. He spends several days cheerfully digging and fertilizing and tenderly watering seeds, and by the end of the week he already has a handful of visible sprouts.</span>\n</p>\n<p> </p>\n<p>\n<span>\"I'm impressed,\" Lan Zhixun admits to Lan Wangji. Lan Zhixun is the head doctor; she had been second doctor at the time of Lan Wangji's convalescence, so they know each other well enough. She has a no-nonsense manner that he appreciates; her approval isn't vainly won. She walks with him now to the gardens, as he hasn't actually checked in on them yet. As they round the corner of the doctors' wing, she continues, \"I didn't think he'd get anything growing so soon.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Ahaha, Honored Doctor Lan flatters me!\" Wei Wuxian calls over to them, having overheard that last bit. He's crouching in the garden, his hands covered in dirt, smiling magnificently up at them. His hair is pulled into a messy bun on top of his head, and he's ditched his outer layers in the heat, the dark red sleeves of his inner shirt shoved up to expose his forearms, his collar hanging open at his chest. He stands up and says, \"Hey, Lan Zhan.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji stares at him. </span>\n</p>\n<p> </p>\n<p>\n<span>\"You've been doing good work, Master Wei,\" Lan Zhixun tells Wei Wuxian when Lan Wangji fails to respond. \"The doctors of GusuLan extend to you their gratitude.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian laughs it off nervously. \"It's nothing, it's nothing,\" he insists. \"The dirt here is so fertile, any moron with a bit of water and time could grow something successfully. ....N-not to say that previous gardeners have been morons! It's just, compared to where I grew things last, this place is heaven-sent.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Right. \"Still, we appreciate Master Wei's dedication,\" Lan Zhixun tells him.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian shoots Lan Wangji a look, like, </span>\n<em>\n<span>Don't let her keep thanking me!! </span>\n</em>\n<span>He rubs the back of his neck and says, \"Ah, well, you know, I might as well.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Show us what you're planting,\" Lan Wangji suggests. He receives a grateful grin in return.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Ah, well, right here is mint,\" Wei Wuxian says, and then he spends the next couple minutes explaining what else he's planted and what everything is used for, as if Lan Wangji and Lan Zhixun might not already know, and also he changed the irrigation system so it should be more efficient, and he's planted soybeans in this area because the dirt there really was getting a little tired… Lan Wangji watches him dart around and thinks about kissing him, right here in the dirt.</span>\n</p>\n<p> </p>\n<p>\n<span>At last Lan Zhixun clears her throat politely and says, \"Right, well, thank you again, Master Wei. I'll let you get back to it.\" She bows to him, then to Lan Wangji. \"Your Excellency.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian and Lan Wangji salute her back, and she leaves. \"You saved me,\" Wei Wuxian sighs when she's gone. \"Good heavens, I hate when people thank me. And you Lan people are all so sincere, it gives me hives.\" He shudders in mock horror.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mm,\" Lan Wangji says. He steps closer. \"Come here.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian gives him a curious look, but he steps carefully over his rows of baby plants and comes to stand in front of Lan Wangji. \"What's up?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji reaches out and unties, then reties more tightly the fastening of Wei Wuxian's shirt under his arm. Wei Wuxian raises his eyebrows. \"You're indecent,\" Lan Wangji says. He pats Wei Wuxian's collar so it sits more neatly, and regrets it immediately.</span>\n</p>\n<p> </p>\n<p>\n<span>\"But Lan Zhan, it's so hot out,\" Wei Wuxian complains. \"I'm all sweaty, I don't want my shirt sticking to me. I already have to keep redoing my hair and shoving my sleeves up.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"That's because you aren't doing it properly,\" Lan Wangji tells him. He pulls Wei Wuxian's sleeves back down and runs his hands over them to smooth out the wrinkles, then rolls them neatly from the cuff, one then the other. Wei Wuxian watches him with dark eyes.</span>\n</p>\n<p> </p>\n<p>\n<span>\"You gonna do my hair for me too?\" he asks quietly.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mm,\" Lan Wangji confirms. \"Turn around.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"It's all sweaty,\" Wei Wuxian warns him, but he obeys anyway. Lan Wangji pulls the ribbon from his messy hair and runs his fingers through it. It is sweaty, warm and humid near Wei Wuxian's scalp, and it would be unpleasant if it weren't Wei Wuxian. But because it's Wei Wuxian, and Lan Wangji is himself, he doesn't mind. He pulls Wei Wuxian's hair into a high ponytail, then wraps the long hair around the base of the ponytail to form a bun. On a whim he removes one of his own elaborate combs from his hair so that he can push it into the bun to stabilize it. When he draws his hands away, he realizes he's made a terrible mistake: now he can see the elegant sweep of Wei Wuxian's neck. The cute backs of his ears. The wispy hairs too short and fine to be drawn into the ponytail, sticking to his skin with sweat. The smudge of dirt from where Wei Wuxian had rubbed his neck earlier. Lan Wangji wants to lick it clean.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Lan Zhan ah, what are you doing back there? Is it really that hopeless?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji clears his throat and steps away. \"No,\" he says. Then, because he can't help himself, he reaches out and rubs his thumb across the dirt smudge to clear it. \"There was dirt,\" he says pathetically, pulling his hand away.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian turns and gives him a look he doesn't know how to read. \"There's dirt,\" he agrees. \"There'll always be dirt with me.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Oh, no. Lan Wangji is no good with metaphors. He thinks frantically for something to say that's better than </span>\n<em>\n<span>I like dirt. </span>\n</em>\n<span>After a moment, he settles on, \"Then we'll clean it. Together.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian watches him. Then one of his eyebrows lifts, just a little, and Lan Wangji thinks </span>\n<em>\n<span>Uh oh, </span>\n</em>\n<span>and then Wei Wuxian's earth-dark hand is darting out to smear dirt onto Lan Wangji's face, and the other hand is reaching minnow-quick to grab at his white sleeve — and the juniors on laundry duty are always so mad when people's robes are dirtied — and delight is rising fresh and floral in Wei Wuxian's eyes —</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji turns and runs. Wei Wuxian leaps after him, shrieking with improper laughter, and they tear away from the garden and into the forest where the troublesome deer live, sprinting between the trees for a good thirty paces before Wei Wuxian catches the trailing end of Lan Wangji's forehead ribbon. Lan Wangji whirls, and Wei Wuxian barrels into him, still laughing breathlessly, and they tumble to the forest floor together. \"Wei Ying,\" Lan Wangji gasps. He thinks he's smiling. He can't tell if his forehead ribbon stayed on.</span>\n</p>\n<p> </p>\n<p>\n<span>\"That's what you get for wearing all these fancy robes,\" Wei Wuxian tells him, panting. He slaps Lan Wangji's chest for emphasis, leaving a dirty handprint. Ah, well. \"I know you could outrun me! And yet!\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I was going easy on you,\" Lan Wangji tells him. Wei Wuxian cracks up, hiding his face in Lan Wangji's chest.</span>\n</p>\n<p> </p>\n<p>\n<span>\"How many rules did we just break, huh?\" he asks gleefully.</span>\n</p>\n<p> </p>\n<p>\n<span>\"None,\" Lan Wangji says. \"That was a training exercise.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian laughs again, shocked. \"Lan Zhan! You are so full of shit,\" he snickers. \"What if your uncle saw us!\"</span>\n</p>\n<p> </p>\n<p>\n<span>They take a silent moment to contemplate the utter apoplexy that would strike Lan Qiren if he saw the two of them running around, and exchange looks of horror. Then Wei Wuxian's eyebrows begin to twitch helplessly, and his mouth curves down, and finally he bursts again into laughter, and Lan Wangji can't help but to follow. He laughs breathlessly, quiet but uncontrollable, and Wei Wuxian smiles huge and warm, and then Lan Wangji finds his face pressed into Wei Wuxian's chest as Wei Wuxian hugs his head.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Cute,\" Wei Wuxian gasps, \"cute, cute, I can't believe you can laugh.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I didn't know either,\" Lan Wangji admits, and then he inhales wetly and wraps his arms tight around Wei Wuxian's narrow waist as his quiet laughter turns seamlessly into silent tears. \"Wei Ying,\" he says into Wei Wuxian's warm chest, \"Wei Ying, Wei Ying.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Lan Zhan?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji doesn't even really know why he's crying until Wei Wuxian pets his back hesitantly and says, \"You really did miss me, huh?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji gives a little sigh. \"I really did miss you,\" he confirms.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian strokes his back again. They lie there for a moment just holding each other as Lan Wangji gets himself back under control. \"Poor Lan Zhan,\" Wei Wuxian says. \"I really haven't made it easy to be my soulmate, huh.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji huffs a little in bitter amusement. \"I thought I would die, when you did,\" he admits. Wei Wuxian stills under his hands. He continues slowly, \"At that time, and before… Everything was difficult, for me. Hearing what people would say about you. Watching you on your single-plank bridge. Knowing it could only end one way.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Lan Zhan,\" Wei Wuxian whispers, horrified.</span>\n</p>\n<p> </p>\n<p>\n<span>\"But being yours is the easiest thing I've ever done,\" Lan Wangji finishes, hot tears prickling anew. \"Like breathing. Easier.\" After all, he needs to be alive to breathe. But when he's dead he'll still love Wei Wuxian.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Lan Zhan,\" Wei Wuxian repeats. He pulls away and sits up, shifts around so he's sort of sitting in Lan Wangji's lap looking down at him. Lan Wangji fights the urge to cover his tear-stained face. It's alright if Wei Wuxian can see him being vulnerable. Wei Wuxian tugs on his arms until he sits up as well, then cups his face in his warm hands. Lan Wangji wonders if he's about to be kissed.</span>\n</p>\n<p> </p>\n<p>\n<span>Instead Wei Wuxian just tugs him forward so that his face is once again hidden in Wei Wuxian's collar. \"My Lan Zhan, my soulmate,\" he whispers into Lan Wangji's hair. \"I hope you know I feel the same way.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji swallows. He didn't know, not really. But — does Wei Wuxian </span>\n<em>\n<span>really </span>\n</em>\n<span>feel the same way? All the love he bears for Lan Wangji — isn't it possible that it's fraternal? He needs to know. He can never ask.</span>\n</p>\n<p> </p>\n<p>\n<span>He breathes in the earthy smell of Wei Wuxian's collar — dirt and sweat and sun — and thinks that he'll take what he can get.</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>*</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>(He's late for his next meeting because he is covered in dirt. That evening Wei Wuxian informs him delightedly that the bun Lan Wangji constructed lasted all day and that people kept staring at the comb. Lan Wangji says, \"Mm,\" in satisfaction. Everyone already knows, but they should be periodically reminded that Wei Wuxian has his favor.</span>\n</p>\n<p> </p>\n<p>\n<span>He falls asleep draped over Wei Wuxian like he's been doing recently, but when Wei Wuxian goes to sleep several hours later, he wakes Lan Wangji up and insists that they both sleep on their sides, holding each other. \"It was comfortable when we were like that earlier,\" he explains to a sleepy Lan Wangji.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Do as you will,\" Lan Wangji mumbles. He doesn't care how they sleep, as long as they're close. He lets Wei Wuxian manipulate his arms and legs like a doll until he's satisfied, and then he pulls himself a little closer, spreads his hands against the warm planes of Wei Wuxian's back and waist. Wei Wuxian has one leg thrown over his hips. Lan Wangji hums in pleasure and falls back asleep.)</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>*</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>Sect Leaders Yao and Ouyang come to Gusu with what seems to be the express purpose of giving Lan Wangji a headache. They certainly don't seem to have any other pressing needs, at least none that aren't either solved by saying \"yes\" or \"no,\" or so transparently farcical that Lan Jingyi actually forgets himself and squawks, \"What are you even talking about?\" </span>\n</p>\n<p> </p>\n<p>\n<span>Still, they're in Gusu and they insist on wasting his time at random hours for days on end. Lan Wangji is not someone prone to complaining, but Wei Wuxian wheedles it out of him on the first day and then demands to be kept up to date on their tomfoolery, so Lan Wangji complies.</span>\n</p>\n<p> </p>\n<p>\n<span>\"And you're sure they're not wasting your time maliciously?\" Wei Wuxian checks as Lan Wangji dresses, just like he checked yesterday morning and again last night. He's awake for once, sitting on their bed swaddled in the quilt. \"They're not distracting you while some nasty friend of theirs executes some nefarious plan??\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I'm sure,\" Lan Wangji says for the third time. \"Wei Ying, you give them too much credit.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"You think they're too stupid to scheme like that?\" Wei Wuxian asks.</span>\n</p>\n<p> </p>\n<p>\n<span>\"I think the chances of their having a third friend is very low,\" Lan Wangji says. Wei Wuxian cackles, falling over sideways in his delight.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Vicious,\" he says approvingly. \"Ah, well, that's alright, I suppose. As long as they know that if they mess with you too much, they'll have me to deal with,\" he adds, and he's joking, but he isn't, really. Lan Wangji's chest warms. He likes when Wei Wuxian is protective of him.</span>\n</p>\n<p> </p>\n<p>\n<span>\"They know,\" Lan Wangji says easily. Everybody knows. He fastens the last of his belts and tucks the ties away, then looks up to see Wei Wuxian smiling dopily up at him. Lan Wangji feels his own gaze soften in return.</span>\n</p>\n<p> </p>\n<p>\n<span>After a moment Wei Wuxian clears his throat and says, \"You'd better go, right?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mn,\" Lan Wangji agrees, looking away. He crosses the room to the bed, then crouches to pull the quilt around Wei Wuxian more snugly. And then, because his hands are already right there, he gives Wei Wuxian's ears a tug, and then he pushes his hands through his warm hair. \"Have a good morning,\" he says. \"I'll see you at lunch.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yeah,\" Wei Wuxian says, his voice hoarse as Lan Wangji pulls away. \"See you at lunch.\"</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>*</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>They do not see each other at lunch. Instead Lan Wangji finds himself beset by Sect Leaders Yao and Ouyang, who have come up with a litany of new complaints for him, and he misses lunch entirely. Then he has meetings and paperwork, and then he has dinner with his brother like he does once a week, and then Yao and Ouyang catch up to him </span>\n<em>\n<span>again </span>\n</em>\n<span>and waste his time for another couple hours by taking turns monologuing at him. They know, of course, that he can't bring himself to interrupt them, but they're happy to interrupt each other, so they just stand there yammering pointlessly as first curfew, then bedtime, come and go. </span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji is infuriated. He should be in bed wrapped around Wei Ying, not sitting here being talked at by morons.</span>\n</p>\n<p> </p>\n<p>\n<span>He's contemplating how much trouble he could </span>\n<em>\n<span>really </span>\n</em>\n<span>get into if he were to slap both of them with a silencing charm when Sect Leader Yao actually falls asleep mid-sentence. Lan Wangji blinks, and then he says, \"That's enough for today, then,\" and sweeps past both of them without another word. The two junior disciples at either side of the door, Lan Faseng and Lan Congyi, struggle upright from where they were slumping with exhausted boredom, and he nods at them. \"Get to bed,\" he advises. \"You're exempt from morning classes tomorrow.\"</span>\n</p>\n<p> </p>\n<p>\n<span>They thank him profusely and then they definitely do not run to the juniors' quarters. Lan Wangji does not run to the Jingshi, either.</span>\n</p>\n<p> </p>\n<p>\n<span>He expects to find Wei Wuxian sprawled out on their bed like he usually is in the evenings. He's looking forward to the sight, in fact. But when he opens the door, Wei Wuxian is sitting at the desk reading. He looks up when Lan Wangji enters, and then he scrambles up and over to grab at Lan Wangji's hands, his waist, his hair.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Lan Zhan ah! What in the world kept you so long? Was it those two fools? I'll kick their asses for you,\" he rambles as he dismantles Lan Wangji's complicated hair piece. As soon as his hair is more or less free, Lan Wangji lets his forehead fall to Wei Wuxian's shoulder with a thunk.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Don't kick their asses,\" he says. \"It would deprive me the pleasure of doing so myself.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian chuckles and starts pushing Lan Wangji's outer robes off his shoulders. \"Poor Lan Zhan, subject to such earthly miseries. You must be exhausted, come to bed, come to bed.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mm,\" Lan Wangji says. He raises his arms so that Wei Wuxian can keep undressing him. His clothes will end up on the floor, but no matter. Wei Wuxian's deft hands at his belts are worth wrinkled robes.</span>\n</p>\n<p> </p>\n<p>\n<span>\"... Goodness, Hanguang-Jun, you wear too many damned layers,\" Wei Wuxian tells him after a while. \"Would it kill you to stop after a reasonable five?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Hmmmmmm,\" Lan Wangji says into his shoulder. If he had stopped after five, he wouldn't have gotten these extended quiet minutes of Wei Wuxian peeling him carefully out of his clothes, his hands firm and warm. </span>\n</p>\n<p> </p>\n<p>\n<span>At last he's down to just his undershirt and trousers, and Wei Wuxian pats his chest in approval. \"Do you want to take a bath or do you just want to pass out?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji does not drape his arms over Wei Wuxian's shoulders and lean all his weight into him, and he also does not sigh, \"Take me to bed,\" and Wei Wuxian does not laugh quietly and drag him over to their bed. All of that would be very undignified and unbefitting of the Chief Cultivator.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian drops him onto their bed and crawls in after him, pulling the quilt with him as he goes. \"Stupid Yao,\" he whispers into Lan Wangji's hair. \"Stupid Ouyang. How am I supposed to sleep if I haven't been relaxing underneath you for four hours? They're really trying my patience this time.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mmmmm,\" Lan Wangji says. He pulls Wei Wuxian closer and slowly tangles their legs. \"Sleep now.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yeah, okay,\" Wei Wuxian says. He presses his forehead against Lan Wangji's cheek. \"You have to blow the candles out though. … Aren't you going to take off your forehead ribbon?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji waves a hand and extinguishes the candles. In the dark he says, \"You may remove it.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian makes a little sound. Then he pushes himself up onto his elbows and carefully unties the ribbon under Lan Wangji's head, folds it loosely, and hangs it over the bedpost. \"My Lan Zhan,\" he sighs, settling back into him.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yours,\" Lan Wangji agrees, too sleepy to be anxious. \"Goodnight, Wei Ying. See you tomorrow.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"See you tomorrow.\"</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>*</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>Morning comes too soon. Lan Wangji wakes and forces himself out of the warmth of Wei Wuxian's sleepy embrace, trying not to feel bitter about it. He bathes and dresses himself, then he goes to the kitchen, and then he wakes Wei Wuxian up so they can eat together. Wei Wuxian is so sweet and sticky in the mornings, all slurred words and clumsy hands. Lan Wangji wants to crawl back into bed with him. He wants to kiss him silly. He wants to touch him until he's awake and then he wants to fuck him so thoroughly he falls asleep again. </span>\n</p>\n<p> </p>\n<p>\n<span>He does none of these things. Instead he cleans up their breakfast and picks Wei Wuxian up and tucks him back into bed. Then he wraps himself in all his layers of robes. He's tying the first of his small ponytails into place when Wei Wuxian reaches over from the bed to nudge his thigh. When he looks down, he sees his forehead ribbon in Wei Wuxian's hand.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Don't forget it,\" Wei Wuxian mumbles. Lan Wangji loves his slack mouth, his drooping eyelids.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mm,\" Lan Wangji says. He kneels next to the bed. \"Will you tie it?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yeeeahhhh,\" Wei Wuxian says, the word a contented sigh. He braces himself on one arm and draws the ends of the ribbon around to the back of Lan Wangji's head. Lan Wangji puts his finger on the metal embellishment to hold it in the center of his forehead as Wei Wuxian ties it. When he's done, he loops his arms around Lan Wangji's neck and tips his head forward to rest on his collar. Lan Wangji strokes his back. \"So sweet,\" Wei Wuxian mumbles, \"so so so sweet, Lan Zhan… I wish you could stay and hold me…\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji is aflame. He swallows and says, \"Me too.\" But he gently lifts Wei Wuxian's arms and arranges him back in bed anyway, so that his fragile willpower isn't broken entirely. He finishes doing his hair quickly, and then he says, \"I'll see you at lunch,\" and then he leaves.</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>*</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>This time they do see each other at lunch. Wei Wuxian dresses nicely and makes a point of sitting next to him at the seniors' table, makes a point of serving him and being served in return. Then he makes a point of ignoring Sect Leaders Yao and Ouyang in favor of exchanging silly faces with their much more likeable sons. Lan Qiren is beginning to twitch. Lan Wangji is fairly sure that he dislikes Yao and Ouyang even more than he dislikes Wei Wuxian, but certainly the combination of all three of them is not improving his opinion of any of them. Lan Wangji thinks that there is an easy solution to all of this, which is to kick Yao and Ouyang out of the Cloud Recesses. </span>\n</p>\n<p> </p>\n<p>\n<span>Ordinarily his patience is replenished with sleep, but staying up so late last night has done away with the last of his mercy. And so, when lunch is over and everyone returns to their duties, he settles behind his desk in the Chief Cultivator's Hall and announces, \"Patient Sect Leader Yao and attentive Sect Leader Ouyang will forgive this humble servant for quickly seeing to other matters before he can see to theirs,\" and Yao and Ouyang have no choice but to agree. </span>\n</p>\n<p> </p>\n<p>\n<span>For the next several hours Lan Wangji listens to every suggestion, complaint, question, observation brought before him, and then during the hour he would ordinarily eat he silently does paperwork at his desk while Yao and Ouyang stand there sweating, and then Sizhui drops by and tells him what he's been up to, and then at last, with only half an hour left before curfew, Lan Wangji turns his attention to Yao and Ouyang and says, \"Sect Leaders, this servant thanks you for your endless patience. You have the time it takes to burn this stick of incense to state your concerns.\" He produces a stick of incense, places it in the holder on his desk, and lights it.</span>\n</p>\n<p> </p>\n<p>\n<span>Yao and Ouyang sputter in indignance. \"You can't be serious!\" Sect Leader Yao blurts.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Preposterous!\" Sect Leader Ouyang wheezes. \"You must be joking!\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I am not joking,\" Lan Wangji tells them.</span>\n</p>\n<p> </p>\n<p>\n<span>\"You've been too busy for us all afternoon, telling us </span>\n<em>\n<span>oh one more meeting</span>\n</em>\n<span> a thousand times over, not even giving us the time of day, and now we get a single incense stick worth of your time? How outrageous!\" Sect Leader Yao complains.</span>\n</p>\n<p> </p>\n<p>\n<span>\"This incense burns rather quickly, so, gentlemen, if you please,\" Lan Wangji says. </span>\n</p>\n<p> </p>\n<p>\n<span>\"You've wasted our time!\" Sect Leader Ouyang declares.</span>\n</p>\n<p> </p>\n<p>\n<span>\"You have wasted mine,\" Lan Wangji tells him, rising from his place behind the desk. \"Sect Leader Yao, Sect Leader Ouyang, if you find some aspect of my performance as Chief Cultivator objectionable, you are welcome to tell me. But your conduct these past days has been shameful. You've had your fun. Leave.\"</span>\n</p>\n<p> </p>\n<p>\n<span>With that, he extinguishes the incense with his fingers and leaves. Lan Faseng and Lan Congyi follow him with huge eyes as he opens the double doors of the hall, only to find Wei Wuxian standing just behind them, his eyebrows raised dramatically.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Lan Zhan,\" he greets him, joining his stride. He's still dressed rather formally like he was at lunch. It occurs to Lan Wangji now that, of course, Wei Wuxian in formal clothes is invoking the Yiling Patriarch. \"I was ready to kick the doors down if they kept you past curfew again, but I see that's not necessary.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Indeed,\" Lan Wangji agrees. To the juniors he says, \"Faseng, Congyi, you're dismissed. Wei Ying, have you eaten?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yes,\" Wei Wuxian says. \"I made a tray for you, it's in the Jingshi.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji stops walking to stare at him. Wei Wuxian stops too and makes a concerned expression. \"What? Did you not want me to?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji is going to kiss him. He's just stepped forward, his hands already reaching out to cup Wei Wuxian's sweet face, when Yao and Ouyang burst together out of the Chief Cultivator's Hall, spitting mad.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Hanguang-Jun, how dare you!\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Hanguang-Jun, what a disgrace!\"</span>\n</p>\n<p> </p>\n<p>\n<span>Ah! There goes the last of Lan Wangji's patience. He keeps his back to them, keeps holding Wei Wuxian's face, and says, \"Sect Leader Yao and Sect Leader Ouyang, you may leave the Cloud Recesses on your own terms or you may leave here on mine. Choose wisely.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian raises his eyebrows again, a little smug smile working its way onto his lips. \"I like it when you're mean,\" he says in an undertone, swaying closer. Louder, he says, \"Let's go, Lan Zhan, before I remember just how mad I can get.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mm,\" Lan Wangji agrees, and they go.</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>*</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>When they return to the Jingshi, Lan Wangji gets almost a full stride inside the door before Wei Wuxian crowds himself close. \"Lan Zhan,\" he says, running his hands up Lan Wangji's chest. He pushes the loose outer layers off Lan Wangji's shoulders. \"Lan Zhan, that was very good, what you just said to them.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Uncle will be angry,\" Lan Wangji admits. He unties his belts. He wants to put his hands on Wei Wuxian, but he doesn't want to get in the way.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Forget your uncle,\" Wei Wuxian orders him, tugging on his collar. \"Think about me instead.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji's mouth goes dry. \"Alright,\" he agrees hoarsely. He puts his hands on Wei Wuxian's waist after all, pulls him closer. Wei Wuxian goes easily, stepping into his space until their chests are pressed together. His quiet breath is warm on Lan Wangji's ear and the tender skin underneath, his hands firm and exploratory on Lan Wangji's back. \"Wei Ying,\" he murmurs.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yeah? Lan Zhan…\"</span>\n</p>\n<p> </p>\n<p>\n<span>So close like this Lan Wangji can only see the curve of Wei Wuxian's ear, the black sweep of his hair. He wants to bite that ear, tangle that hair. He says, \"Let me undress you.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian stills against him. Then he presses impossibly closer and nuzzles Lan Wangji's neck, saying in an almost-moan, \"Yyyeeeahhh. Lan Zhan ah… you do that.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Permission thus granted, Lan Wangji sets to work untying all Wei Wuxian's belts. It becomes very hard to concentrate once Wei Wuxian starts mouthing soft and hot at the side of his throat. He swallows and works faster. When the belts have dropped to the floor, he has to step away a little to untie the layers of skirts and tops, and Wei Wuxian whines a little in protest. \"Wei Ying,\" Lan Wangji says mildly.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Lan Zhaaan,\" Wei Wuxian groans, but his hands finally leave Lan Wangji's back so that he can help untie things too. Between both their efforts, he's soon down to the dark red underrobes that Lan Wangji likes so much. \"Now you,\" Wei Wuxian tells him breathlessly. Lan Wangji lifts his hands to release Wei Wuxian's hair from his half-ponytail as Wei Wuxian's clever fingers make short work of the ties keeping his collars closed. \"Lan Zhan,\" Wei Wuxian repeats, pushing the last of his outer robes off of him, \"You really have no idea what you do to me…\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji has some idea. He grips Wei Wuxian's waist again and Wei Wuxian shudders, pushes closer, curls his fingers to claws that he pulls down Lan Wangji's back. \"All this because I was a little mean?\" Lan Wangji wonders. He shifts his hands down to palm the angles of Wei Wuxian's narrow pelvis, pulls him in so their hips press together. He can feel Wei Wuxian's growing erection against his own.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yes,\" Wei Wuxian gasps into his last remaining collar, \"yes, because you were mean — I never see you angry anymore, I love when you get angry... Lan Zhan ah, you know, the first time I was here, and you were always irritated with me — that time you yelled at me to get out — oh, I wanted you to chase me and catch me and kiss me against the desk…\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji inhales shakily. He had had the same daydream. It had not ended with just kissing. \"Wei Ying,\" he manages.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Please,\" Wei Wuxian begs, rolling his whole body against Lan Wangji's, \"please, please, please, Lan Zhan, touch me.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji touches him. He stoops and sweeps Wei Wuxian up into his arms and carries him to the bed, where he carefully deposits him and immediately climbs back into his embrace. Wei Wuxian is laughing now, thrilled and breathless, wrapping his limbs around Lan Wangji like an octopus. Lan Wangji braces himself on one elbow above him and tenderly brushes his messy hair off his face. \"Wei Ying,\" he says.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Kiss me,\" Wei Wuxian demands, smiling.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji obeys. The storm takes him.</span>\n</p>\n<p><br>\n<br>\n<br>\n</p>\n<p>\n<span>*</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>Lan Wangji has now woken up with Wei Wuxian in his arms on dozens of mornings. The experience has yet to underwhelm. But this — Wei Wuxian sleepy and warm like he always is, but now also naked and messy, smelling of sex, one hand curled around Lan Wangji's waist and the other, endearingly, curved clumsily over his ass — </span>\n</p>\n<p> </p>\n<p>\n<span>This is new.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji revels in it. He revels in kissing Wei Wuxian awake, and then he revels in Wei Wuxian's look of sleepy, surprised pleasure as he wakes, and the little sigh he makes when Lan Wangji draws away. But he's only drawn away so he can yawn into Wei Wuxian's shoulder, and then he's back, and Wei Wuxian huffs a laugh and kisses him more before yawning himself. \"Every day,\" he mumbles into Lan Wangji's mouth after long quiet minutes of only kissing. \"Wake me like this every day, Lan Zhan.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji hums thoughtfully against his lips. \"I could be convinced,\" he teases.</span>\n</p>\n<p> </p>\n<p>\n<span>\"I'll just have to convince you,\" Wei Wuxian decides, smiling widely. </span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji kisses his dimples, one after the other, and tells him, \"Do your worst.\"</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>*</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>Lan Wangji has been kissing Wei Wuxian awake every day for almost a month when the letter arrives from Lanling. They've just finished with lunch when the Lanling courier is announced, and Wei Wuxian subtly perks up, as if he thinks it may be something interesting from Jin Ling. Lan Wangji is privately doubtful that it will be either interesting </span>\n<em>\n<span>or </span>\n</em>\n<span>from Jin Ling, but he doesn't say so. Instead he just waves the courier in and receives the letter.</span>\n</p>\n<p> </p>\n<p>\n<span>It's formal, fine paper bound in red ribbon. Wei Wuxian nudges him and says, \"Whoa, wonder if someone's getting married!\"</span>\n</p>\n<p> </p>\n<p>\n<span>Perhaps it will be interesting, then. Lan Wangji unties the ribbon and unrolls the letter. Wei Wuxian leans closer to read it over his shoulder.</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>\"Esteemed Chief Cultivator, Hanguang-Jun… </span>\n</em>\n<span>salutation salutation…\" Wei Wuxian mumbles. </span>\n<em>\n<span>\"LanlingJin is honored to announce </span>\n</em>\n<span>blah blah… Jin Shoudu, daughter of Jin Linghua — that's one of Jin Guangshan's cousins, right? Accomplished young maiden, head disciple, good for her… Of an age to be married, nice, nice… GusuLan still needs to produce an heir, yeah, your brother should really get on that… LanlingJin humbly proposes a courtship between —\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian stops talking.</span>\n</p>\n<p> </p>\n<p>\n<span>They are very still against each other.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Qiren clears his throat. Ah, yes. It isn't just the two of them at the seniors' table. Lan Wangji drags his gaze from the letter in his hands to meet his uncle's look. \"Wangji,\" he says.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji dares him to suggest that he accept.</span>\n</p>\n<p> </p>\n<p>\n<span>But Lan Qiren clears his throat again and looks briefly skyward before saying only, \"LanlingJin is very courteous to send such a proposal. It would be best to reply promptly.\" </span>\n<em>\n<span>Don't make them waste more of their time than they already have, </span>\n</em>\n<span>he means.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji is so relieved that his hands shake. \"Yes, Uncle,\" he says. He folds the letter neatly and tucks it into his collar. He'll reply to it later.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian is silent beside him.</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>*</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>When he returns to the Jingshi that evening, Wei Wuxian is grading papers at their desk. He's taken to teaching recently, and he's really very good at it, which is no surprise to Lan Wangji and a constant source of bitterness to Lan Qiren. Lan Wangji goes to sit beside him, already letting his hair down. Wei Wuxian leans against him in greeting, then settles back into his own space again. \"Wei Ying,\" Lan Wangji greets.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian looks up at him that time, giving him a brief smile that doesn't reach his eyes. \"Hi, Lan Zhan.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji watches him. He knows that, although he tries his best to be cheerful, Wei Wuxian does occasionally… shut down, a little. A puzzle box with sticky joints. Lan Wangji has learned that the most helpful thing he can do is simply sit beside him, then, and trust him.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji is very good at sitting next to Wei Wuxian. He shakes out his hair and removes the letter from earlier from his collar, thinking he might as well draft a reply as long as he's at the desk. He glances over it again to see how formal he ought to make his apology, then takes a brush from the brush stand and a piece of paper from the neat stack on the corner of the desk.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian clears his throat, so he looks over. Wei Wuxian doesn't meet his eyes as he says, \"Good — good for you. A man oughta get married at some point, right?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji stares at him. Blinks hard. Waits for the punchline.</span>\n</p>\n<p> </p>\n<p>\n<span>When the optimal time for Wei Wuxian to say </span>\n<em>\n<span>Haha, just kidding, can you imagine! </span>\n</em>\n<span>has come and gone, Lan Wangji says, \"Excuse me?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I'm just saying, it's exciting,\" Wei Wuxian says, not sounding excited at all. \"It's great. It'll be a party.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji blinks again. \"I don't understand,\" he admits.</span>\n</p>\n<p> </p>\n<p>\n<span>\"A party is when a bunch of people come together to have fun,\" Wei Wuxian informs him. \"Like a wedding. Your wedding will be lots of fun.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Dread rises like a monsoon tide in Lan Wangji's throat. \"I'm not marrying the Jin girl, Wei Ying,\" he says.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian has the goddamn gall to look up then and say, with apparent sincerity, \"What? Why not?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji is speechless. He stares at Wei Wuxian: his messy hair. The lovebites just barely visible above his collar. His beloved face, earnest and confused, evidently under the impression that Lan Wangji is such a faithless lover than he would </span>\n<em>\n<span>marry someone else.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>\"Unbelievable,\" Lan Wangji tells him at last, and then he stands up and leaves. The courtesy screen between the desk and their bed is a welcome barrier; he doesn't want Wei Wuxian seeing how long it takes to strip for bed, with his hands shaking. When he's down to just his trousers, he walks back around the courtesy screen and summons the courage to say to Wei Wuxian, \"You made me promise that if you ever happened to annoy me, I would tell you.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I recall,\" Wei Wuxian says, shoulders hunched uncomfortably.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji swallows and closes his eyes and says, \"You've annoyed me.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian wilts. Lan Wangji goes to bed. It's the first time in almost a year that he's gone to bed alone. The bed is huge and cold without Wei Wuxian in it. That's why he shakes himself to sleep. The cold.</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>*</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>He wakes in the dark. He thinks for a moment that Wei Wuxian must be joining him finally, but he waits for a warm clumsy touch that doesn't come. When he turns his head to look around, he doesn't see Wei Wuxian anywhere. Fear spikes in him, and he lurches out of bed, stumbling a little before striding around the courtesy screen, as if Wei Wuxian might still be at the desk. He isn't, of course. Lan Wangji checks the desk just in case he left a note; he did not. \"Wei Ying,\" he says, and it's only half to check if Wei Wuxian is still in the Jingshi; it's also for himself, because the simple act of saying Wei Wuxian's name is comforting.</span>\n</p>\n<p> </p>\n<p>\n<span>But then he hears a groggy, \"Lan Zhan?\" so either way he's won. He moves in the direction of the sound: back towards the bed. This time he sees the dark lump of blanket and beloved huddled near the stove.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Wei Ying,\" he repeats, crouching next to him. \"Love, what's wrong? Why are you here?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian uncurls slightly, his skin pale against the dark of his hair and the blanket. \"I thought…\" he starts. Lan Wangji's heart falls. </span>\n<em>\n<span>I thought this was what you wanted, </span>\n</em>\n<span>he hears.</span>\n</p>\n<p> </p>\n<p>\n<span>\"I was just annoyed with you. I haven't kicked you out,\" Lan Wangji tells him. \"Come to bed, Wei Ying.\" He reaches out and tucks a lock of Wei Wuxian's hair behind his ear.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Oh…\" Wei Wuxian says. He's still half-asleep, it seems, but he pushes himself up to sitting, at least. Lan Wangji kneels closer, hooks an arm around his back to support him. Wei Wuxian's head drops tiredly onto his chest. \"I thought… I thought, maybe, you didn't want me sleeping with you anymore…\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Wei Ying,\" Lan Wangji sighs. He pulls Wei Wuxian fully onto his lap and kisses his temple soundly. \"I always want you sleeping with me,\" he tells him. And then, just in case it isn't clear enough: \"I will not marry the Jin girl. Or anyone else who wants to marry the esteemed Hanguang-Jun. You are the only person I want in my bed, now or ever.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian exhales and loops his arms around Lan Wangji's neck. \"Lan Zhan,\" he mumbles. \"Lan Zhan, Lan Zhan… Sorry I've been stupid. I don't want you marrying some random cultivator. Even if she's very accomplished.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I don't want to marry some random cultivator either,\" Lan Wangji tells him, feeling a little exasperated. \"I will not.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I don't even want you to court anyone…\" Wei Wuxian says. \"I'm too selfish, too selfish.\" He nuzzles miserably into Lan Wangji's neck.</span>\n</p>\n<p> </p>\n<p>\n<span>\"You're entitled to such selfishness,\" Lan Wangji tells him. \"I will not court anyone.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Your family needs an heir,\" Wei Wuxian points out, as if that's a real argument.</span>\n</p>\n<p> </p>\n<p>\n<span>\"I </span>\n<em>\n<span>have</span>\n</em>\n<span> a son,\" Lan Wangji reminds him. \"And I have you.\" He squeezes Wei Wuxian for emphasis. Then, quieter, he asks, \"You really think I could marry anyone but you?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian leans back to look at him. They stare at each other in the dark. \"Lan Zhan,\" Wei Wuxian says finally.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Have I not been clear enough?\" Lan Wangji asks him gently. \"Wei Ying, it's only you, for me. It could only ever have been you.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Lan Zhan,\" Wei Wuxian repeats. His voice is thick now with tears. He tips forward again to press their foreheads together. \"It's only you for me too. Oh, gods, Lan Zhan, I want to sleep with you every night for the rest of my life.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yes,\" Lan Wangji agrees.</span>\n</p>\n<p> </p>\n<p>\n<span>\"I want you to kiss me awake every morning.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yes.\" He punctuates this with a kiss.</span>\n</p>\n<p> </p>\n<p>\n<span>\"I want to feed you my delicious spicy food and I want you to feed me your pathetic rabbit food.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yes.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I want to help you undress in the evenings and dress in the mornings, and I want to take your forehead ribbon off whenever we're alone.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yes!\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I wanna marry you,\" Wei Wuxian cries, holding him tightly. \"Lan Zhan, Lan Zhan, I want to marry you.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji holds Wei Wuxian's face in his hands and kisses him all over. \"Yes,\" he breathes against his mouth, his eyelids, his ears. \"Yes, Wei Ying, my love, let's marry.\"</span>\n</p>\n<p> </p>\n<p>\n<span>They make it back to bed eventually.</span>\n</p>"
}