{
  "id": "21446797",
  "url": "https://archiveofourown.org/works/21446797?view_full_work=true",
  "author": [
    "TentativeTreason"
  ],
  "title": "When You Assume Wrong",
  "rating": "General Audiences",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [],
  "fandoms": [
    "Marvel Cinematic Universe",
    "The Avengers (Marvel) - All Media Types",
    "Spider-Man - All Media Types",
    "Iron Man (Movies)"
  ],
  "relationships": [
    "Peter Parker & Tony Stark",
    "May Parker (Spider-Man) & Peter Parker & Tony Stark",
    "May Parker (Spider-Man) & Tony Stark",
    "Tony Stark & Avengers Team",
    "Peter Parker & Avengers Team"
  ],
  "characters": [
    "Peter Parker",
    "May Parker (Spider-Man)",
    "Tony Stark",
    "Clint Barton",
    "Natasha Romanov (Marvel)",
    "Steve Rogers",
    "Sam Wilson (Marvel)",
    "Avengers Team (MCU)",
    "James \"Rhodey\" Rhodes",
    "Happy Hogan"
  ],
  "additional_tags": [
    "Post-Spider-Man: Homecoming",
    "Not Avengers: Infinity War Part 1 (Movie) Compliant",
    "Irondad",
    "Tony Stark Acting as Peter Parker's Parental Figure",
    "Parent Tony Stark",
    "Peter Parker Meets the Avengers",
    "Suspected Affair",
    "Misunderstandings",
    "Precious Peter Parker",
    "Tony Stark Has A Heart",
    "Identity Reveal",
    "Protective Tony Stark",
    "May Parker (Spider-Man) & Tony Stark Coparenting Peter Parker",
    "no beta we die like men"
  ],
  "language": "English",
  "series": "Part 1 of There Can Only Be One Explanation",
  "published": "2019-11-16",
  "completed": "2020-12-05",
  "words": "14,419",
  "chapters": "3/3",
  "comments": "373",
  "kudos": "11,288",
  "bookmarks": "1,735",
  "hits": "134,236",
  "summary": "<p>Tony is hiding something. </p>\n<p>The Avengers notice the little discrepancies in Tony’s behaviour, and they eventually come to the only conclusion they can think of: Tony is having an affair.</p>\n<p>****</p>\n<p>(i.e. Tony Stark and May Parker co-parent Peter and somehow the Avengers translate this into him cheating on Pepper)</p>\n<p>Now the Avengers knew that Tony wasn’t having an affair. They now realised all the discrepancies were actually because he had a son.</p>\n<p>****</p>\n<p>(i.e. Tony Stark and May Parker co-parent Peter and the Avengers translate this into him having a son. Except this time it’s May’s fault)</p>\n<p>The Avengers now knew Tony had a son, but this wasn’t how they were supposed to find out exactly who his son was.</p>\n<p>****</p>\n<p>(i.e. Tony Stark and May Parker co-parent Peter and it takes longer than expected for the Avengers to realise exactly who he is. This time it is 100% Peter’s fault.)</p>",
  "notes": "<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">notes</a>.)\n</p>\n<p>Part 2 of the series will carry of from where Part 1 left off.</p>\n<p>****</p>\n<p>(i.e. Tony Stark and May Parker co-parent Peter and the Avengers translate this into him having a son. At least it was May’s fault this time)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>Part 3 of the series will carry of from where Part 2 left off.<br>****<br>(i.e. Tony Stark and May Parker co-parent Peter and it takes longer than expected for the Avengers to realise exactly who he is. This time it is 100% Peter’s fault)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>I want to especially thank all the people who left kudos and comments for me - it really motivated me to continue writing this and finishing it quicker. 🙌</p>",
  "text": "<p>It started with a phone call, a call that set off alarm bells with the newly pardoned Avengers, not that Tony would know for quite some time.</p>\n<p>The Avengers (both remaining and Rogues) found them selves altogether in the same room for only the second time since the Rogues had been pardoned. They were in a meeting discussing new training and asset distribution, the conversation stilted by the still present tension between both groups.</p>\n<p>Now, Tony might have been instrumental in the getting them pardoned, but that didn’t mean he forgave any of them, or forgot anything that happened between them. Most of the time he still felt numb over the events of Siberia. He could hardly fathom how one of his best friends, someone he had trusted most in the world, had been capable of leaving him for dead. He couldn’t move on when Rhodey was still in the throes of learning to walk again, with the help of Stark prosthetics. He couldn’t forgive when none of them could see how they had been in the wrong, how they had hurt him.<span class=\"Apple-converted-space\"> </span></p>\n<p>But he knew the pardoning was necessary. The world <em>needed</em> the Avengers. All of them. Everything was changing, events were being set in motion and the future needed the Avengers in it to protect it. No matter the personal cost.<span class=\"Apple-converted-space\"> </span></p>\n<p>But while he knew the world needed the Avengers, that didn’t mean he did. He had Pepper. And Happy. And <em>Peter</em>. He needed to protect them from whatever the world threw at them, which meant bringing the Avengers back together. It <em>also</em> meant keeping the Rogue Avengers far away from anything to do with Peter.<span class=\"Apple-converted-space\"> </span></p>\n<p>Peter had partially moved into the Avengers Compound a few months back, after May had spent four consecutive night shifts in the hospital and Peter had nearly bled out on the carpet floor from a stabbing on patrol gone wrong.<span class=\"Apple-converted-space\"> </span></p>\n<p>Tony and May had agreed that they couldn’t let that happen again.<span class=\"Apple-converted-space\"> </span></p>\n<p>So they had compromised, May would have weekends and any odd day that she wasn’t on a night shift and Peter would spend the rest of his time at the compund. It was far from ideal, what with the extra travel for school and the added stress of avoiding the Rogues when coming in and out, but Tony had volunteered Happy to drive him to and from school and Peter predominantly stayed within Tony’s wing of the compound so had yet to actually see the other Avengers.</p>\n<p>Ned had flipped out when Peter had come into school and whispered to him in Chemistry about the transition. It had resulted in a detention for Peter from Mr Harris but it was worth it.<span class=\"Apple-converted-space\"> </span></p>\n<p>So here’s where Tony’s problems began.<span class=\"Apple-converted-space\"> </span></p>\n<p>He was sat in amongst the recently pardoned Rogues, the seating arrangement was Pepper’s idea to ‘foster and re-build old relationships’, so he was currently sat in-between Clint and Steve and opposite Natasha.<span class=\"Apple-converted-space\"> </span></p>\n<p>Rhodey, unfortunately for Tony, had begged off attendance due to physiotherapy and Tony hadn’t wanted to post-pone and bring more attention to the still present consequences of their so-called ‘Civil War’.</p>\n<p>His phone vibrated.<span class=\"Apple-converted-space\"> </span></p>\n<p>The buzzing interrupted the Clint and Sam’s negotiation of gym and training equipment, causing attention to turn to Tony.<span class=\"Apple-converted-space\"> </span></p>\n<p>“Stark, I thought we booked your valuable time,” Sam huffed, jokingly. “I mean, it only took us two weeks.”<span class=\"Apple-converted-space\"> </span></p>\n<p>Tony glanced at the Number ID to see Peter’s smiling face flashing from his home screen. He immediately felt concerned, checking his watch, he confirmed that it was only 14:30pm. <em>Shouldn’t Peter be at school?</em></p>\n<p>Worried, Tony moved to rise from his seat and answer, the excuse tumbling from his lips, “It’s work, I’ve got to-“</p>\n<p>Steve questioned, curious but intentionally not accusatory, they were still working to repair old relationships, after all, “Tony, why would work be phoning? Pepper organised this meeting for all of us, and anyone else would phone Pepper not you. What’s going on?”</p>\n<p>“It, er, it is actually Pepper. Probably an update, or something, I’ve just got to-“<span class=\"Apple-converted-space\"> </span></p>\n<p>He pressed accept, still giving the passive ‘I’ll be just a moment’ spiels to the other Avengers as he left the room.</p>\n<p>As he exited, he pulled the door closed for privacy.</p>\n<p>This, however, didn’t stop Steve and Bucky’s super-powered hearing from accidentally overhearing the one-sided conversation.</p>\n<p><em>“Hey, is everything alright?” </em>Tony’s voice sounded genuinely worried, which piqued their interest, <em>was something wrong with Pepper?</em></p>\n<p>\n<em>“I thought I said you weren’t supposed to phone when at s-“</em>\n</p>\n<p>Steve and Bucky gave each other confused looks, <em>Why would Tony say Pepper shouldn’t phone him?</em></p>\n<p>\n<em>“Oh, so you won’t be staying here tonight?”</em>\n</p>\n<p>\n<em>“No. It’s fine! You are still coming over to stay this weekend though, right? Pepper will be in Japan then, so I’ll be by myself.”</em>\n</p>\n<p>That gained the concern of the two sitting in the conference room; Tony had just told them he’d been talking to Pepper and now he was talking to this unknown person about coming over to stay over when Pepper wasn’t around.</p>\n<p>It was almost reminiscent of, well, Howard.</p>\n<p>Before Howard met Maria, he would have several women on the go and lie to them about when and where the others would be. But Tony wouldn’t do that, <em>would he?</em></p>\n<p>They exchanged knowing looks, an interaction that wasn’t lost on the other members of the team.<span class=\"Apple-converted-space\"> </span></p>\n<p>Clint kicked them, his head gesturing towards the door. “You’re listening to something that us mortals can’t hear. What’s going on?”</p>\n<p>Steve strained to make out more, hushing Clint as he did, saying, “We’ll tell you later, just-“</p>\n<p>\n<em>“Glad you let me know, I’ll see you this weekend.”<span class=\"Apple-converted-space\"> </span></em>\n</p>\n<p>It was the last part of the exchange that sealed the deal for both super-soldiers.<span class=\"Apple-converted-space\"> </span></p>\n<p>\n<em>“I love you too.”</em>\n</p>\n<p>Tony was having an affair.</p>\n<p align=\"center\">****</p>\n<p>They were gathered in a coffee shop down the street from the compound, they being: Clint, Steve, Bucky, Wanda, Natasha and Sam.</p>\n<p>\n<em>“What?!”</em>\n</p>\n<p>“I don’t believe it.”</p>\n<p>“Bullshit!”</p>\n<p>Each of them turned to look at Clint. His declaration having been the loudest and most vehement.<span class=\"Apple-converted-space\"> </span></p>\n<p>“Well, it is! I don’t believe that after everything, Stark would just go around and cheat on Pepper. The guy has like, what, two friends outside of the Avengers which are Happy and Pepper.” Clint counted the names on two of his fingers, holding them each out as if to make a point. “You’re trying to tell us he’s <em>actually</em> cheating on one of the only other people in his life? I’m not his biggest fan but I’m calling bullshit.”</p>\n<p>“Language.” Natasha chimed in, unhelpfully, earning a glare from the Steve.<span class=\"Apple-converted-space\"> </span></p>\n<p>Steve responded, firmly denying the accusation. “We’re not saying he’s <em>definitely</em> cheating-”<span class=\"Apple-converted-space\"> </span></p>\n<p>“That’s not what I heard.” Clint chimed.</p>\n<p>“-we’re just telling you what we heard.”</p>\n<p>There was a moment of uncomfortable silence, as they all pondered what to do with the information. At the end of the day, they all liked Pepper. If the conversation Steve and Bucky had overheard was genuine, then Tony might be cheating on her.<span class=\"Apple-converted-space\"> </span></p>\n<p>If that was the case then, what next? Did they tell her and risk any and all progress they’d made re-building their broken friendships? Did they say nothing and become complicit? If Tony truly was cheating on her, maybe he just wasn’t the man or team-mate that they remembered him to be.<span class=\"Apple-converted-space\"> </span></p>\n<p>Natasha mulled, before breaking the silence. “Why don’t we just do some investigation?”</p>\n<p>At their blank looks, she elaborated, “If he’s <em>truly</em> hiding some mystery woman then we’ll find evidence of it. We could always try looking up phone records and find out who he was talking to. Maybe there’s a reasonable explanation.”</p>\n<p>“Reasonable explanation for<em> ‘I love you’</em>?” Sam retorted, emphasising ‘I love you’ with sarcastic quotation marks.</p>\n<p>“I’ll do it.”<span class=\"Apple-converted-space\"> </span></p>\n<p>It was Bucky’s turn to be on the receiving end of the groups look.<span class=\"Apple-converted-space\"> </span></p>\n<p>He shifted uncomfortably. “Pepper was nice to me. Even after everything that happened with Stark, she always asked if I was okay, or if she could do anything to help with my rehabilitation. So I’ll help you. I won’t be part of hiding him cheating on her. I won’t.”</p>\n<p>If Bucky was in, then Sam was too. From there, it wasn’t too hard from there to convince the others to help. They’d agreed to investigate on a couple of different fronts: they would look into the phone records and any monetary connections that could rule out cheating. They would invite themselves over on the weekend and find the woman at Tony’s, maybe catch him in the act and expose him.<span class=\"Apple-converted-space\"> </span></p>\n<p>They, also, agreed not to tell Rhodey or Vision; the Avengers were worried they would tell Tony of their suspicions, or worse, both already knew and didn’t care enough to stop him.<span class=\"Apple-converted-space\"> </span></p>\n<p align=\"center\">****</p>\n<p>Unaware of the investigation that his actions had started, Tony had been doing his best to do as much as he could to throw the Avengers off the scent for his weekend with Peter. But they seemed only to be getting more and more interested.</p>\n<p>“Hey, Tony, what you doing this weekend? We’re planning to get some shawarma, you want to come?”<span class=\"Apple-converted-space\"> </span></p>\n<p>The nonchalant question from Natasha had set him on edge. He hoped, vehemently, that she hadn’t noticed.<span class=\"Apple-converted-space\"> </span></p>\n<p>“Er, well I’ve actually got plans with, um, Rhodey this weekend. But thanks.“ Tony lied, unwittingly flagging the attention of the Rogues.<span class=\"Apple-converted-space\"> </span></p>\n<p>“Both Saturday and Sunday? All day, both days?”</p>\n<p>“Yeah, it’s a special weekend. To, um, celebrate 6-months of physio.”<span class=\"Apple-converted-space\"> </span></p>\n<p><em>I’m going to Hell. </em>Tony definitely wasn’t proud of that lie, out of all the ones he could have told, but it’d been enough to make the questions awkwardly ebb off.<span class=\"Apple-converted-space\"> </span></p>\n<p>The questioning, however, had succeeded in making him more paranoid about keeping Peter hidden.</p>\n<p>He’d begun to organise events that Peter and he could do <em>outside</em> of the compound. Maybe a trip to Europe would be nice for a weekend? After all, Peter’s only trip outside of the US was to Berlin and look how that’d ended.<span class=\"Apple-converted-space\"> </span></p>\n<p>No, that was too flashy. Maybe he could take Peter to that new science exhibit he’d been going on about?</p>\n<p>From the closed elevator, as it began to go down a level, oblivious to the eavesdroppers, he phoned Peter. “How do you feel about going to an exhibit this weekend?”</p>\n<p align=\"center\">****</p>\n<p>It was a couple of days later on a Friday. And a number of things had become apparent to the Rogue Avengers.</p>\n<p>Firstly, the original phone call wasn’t a one off. On numerous occasions Tony had excused himself for phone calls citing ‘work’ or ‘Pepper’ as the excuse, however, the conversations themselves indicated otherwise. The hours of the calls, also, were questionable; they varied from midday, evening and sometimes odd hours of the day or night.<span class=\"Apple-converted-space\"> </span></p>\n<p>Secondly, Tony <em>always</em> answered. No matter if they were having a team dinner, training or even in his lab, he answered. One time he even answered when Pepper was in the room next door. The audacity of it, indicated to them that it must have been going on long enough that he was becoming lax at hiding it.<span class=\"Apple-converted-space\"> </span></p>\n<p>Upon reconvening, they each shared their findings.<span class=\"Apple-converted-space\"> </span></p>\n<p>“I’ve got a potential name.”</p>\n<p>At this everyone, except Clint, clamoured over to Natasha, each as interested as the next about who might be enough to draw Tony away from Pepper.<span class=\"Apple-converted-space\"> </span></p>\n<p>Spinning around the laptop, Natasha revealed the picture of a woman. A brunette, in her late forties and a heart-warming smile and naturally very beautiful.</p>\n<p>“She’s pretty, for a home wrecker.” Clint remarked snidely, <em>“What?”</em> He raised his hands apologetically when the others gave him disapproving looks, “Come on, if she’s ruining Tony and Pepper’s relationship, then she <em>is</em> a home-wrecker.”</p>\n<p>“Her name is May Parker,” Natasha continued as though she hadn’t been interrupted, “And home-wrecker or not, she and Tony have, according to phone records, been phoning regularly for nearly a year.”</p>\n<p>Natasha clicked onto the next screen and up popped images of May Parker’s phone records and bank statements. Something which, Steve noted, couldn’t have been obtained strictly legally.</p>\n<p>“She’s been receiving money from him the last three months, as well as so-called ‘gifts’.”</p>\n<p>Bucky spoke up for the first time in the meet-up, “What kind of gifts?”</p>\n<p>“Well, so far, from what I can see money. And two sets of new Stark Phones and Phone contracts. And-“ She changed slides to show a recent photo from May’s Facebook page,”- jewellery.”</p>\n<p>The photo showed May smiling at the camera. She was wearing a chained gold-pendant, one which was clearly new and to a trained eye worth far more than most houses in New York cost.<span class=\"Apple-converted-space\"> </span></p>\n<p>“It looks like the pendant was a present. She couldn’t have bought it on a nurse’s salary and it doesn’t look like she has anyone else in her life that would be able to afford such a present.”</p>\n<p>Taking over from Natasha, Clint pressed the ‘next’ button. It was seamless enough that Sam actually wondered if they’d practiced the presentation. “Natasha gave me the name a couple of days ago and I’ve done some research of my own. I have been watching the Parker home from a nearby roof the past few days.”<span class=\"Apple-converted-space\"> </span></p>\n<p>He pointed out a photo of the Parker home, with Tony’s car out front, it was fairly obvious that despite the extravagance of the car compared to those around it, the car had been chosen as one of Tony’s ‘incognito’ cars. It was less flashy than those he normally drove in.<span class=\"Apple-converted-space\"> </span></p>\n<p>“This was taken two days ago. Tony left the compound about midnight on Wednesday.” The slide he’d chosen showed May Parker answering the door, casting a furtive look around, before closing the door. “He, er, <em>stayed</em> for a couple of hours and then came back home.”</p>\n<p>This new revelation didn’t look good for Tony. They all knew it, but none would come out and say it. It was pretty damning evidence.</p>\n<p>Natasha followed on, the next slide showing traffic camera footage. “From what I can gather, he has been to her house at random times of the day or night for nearly a year. Often times it’s when Pepper has been away, sometimes she hasn’t been. It’s to the point where, I think even her nephew has gotten to know Tony.”</p>\n<p>“Nephew?”<span class=\"Apple-converted-space\"> </span></p>\n<p>Sam questioned, looking at the new photo showing a teenage boy answering the house door and being completely unfazed to see <em>the</em> Tony Stark on his doorstep.<span class=\"Apple-converted-space\"> </span></p>\n<p>Answering his question, Natasha said, “Nephew, one Peter Parker. He’s 15 years old. Was taken in by Ben and May Parker after his parents died in a plane crash. May’s husband, Ben, died a few years back during a robbery gone wrong, the poor kid apparently saw everything.”</p>\n<p>“Shit, that’s rough.”</p>\n<p>“Yeah.” Sam shared Clint’s sentiments, but tried to avoid being derailed. “But if even the kid isn’t surprised Tony’s there, then this is worse than we thought.”</p>\n<p>Steve interjected, wanting to offer any potential alternative information that could refute the growing evidence against Tony. “Look, they could just be friends, <em>good</em> friends. Maybe it was a birthday present. And maybe they just talk so much for a number of different reasons. We don’t know <em>anything</em> for certain.”</p>\n<p>He closed the laptop Natasha had open, not wanting to see any more against Tony.<span class=\"Apple-converted-space\"> </span></p>\n<p>“Steve,” Wanda started, “<em>You</em> were the one who thought this to start with. Is there really anything that just been shown that proves otherwise?”</p>\n<p>Steve shook his head, wearily, and moved to sit down.<span class=\"Apple-converted-space\"> </span></p>\n<p>He rubbed his temples, trying to fight the growing migraine. He hadn’t wanted this to be true. In fact, he’d mentioned it to his team with the hope that they would be able to provide an alternative explanation, <em>anything</em> that would explain it.</p>\n<p>“Hey, man, it’s okay.” Sam had sat down beside him, settling a hand on his shoulder comfortingly. “Look. It’s Friday, right? Well, if Tony is <em>really</em> having someone round and cheating then all we’ll have to do is find a reason to get into his personal rooms and find them. We’ll find out the truth.”</p>\n<p>All this running around behind Tony’s back was hardly fostering a new found trust, but if this was the only way they’d be able to find out once and for all if Tony was cheating, then this was what they’d do.</p>\n<p align=\"center\">****</p>\n<p>Tony was excited.<span class=\"Apple-converted-space\"> </span></p>\n<p>The weekend had arrived and he was, <em>finally</em>, going to see Peter again.<span class=\"Apple-converted-space\"> </span></p>\n<p>It had surprised him, the last few days of solitude, how much he had grown used to Peter’s presence. When Peter had moved in, he had worried it would be too much; that he wouldn’t be able to handle it or wouldn’t be as good as Peter’s Aunt at looking after him.<span class=\"Apple-converted-space\"> </span></p>\n<p>But he needn’t have worried, looking after Peter had become as easy as breathing. It was something he looked forward to, something that got him out of bed in the morning. Not that Pepper didn’t. But Peter had given him a new sense of purpose; he was more driven at work (super hero and otherwise), it was all done with the purpose of giving Peter a legacy.<span class=\"Apple-converted-space\"> </span></p>\n<p>So yes, Tony might say he was excited. He was made even more excited by the news that May had got the Friday and Saturday off and would be deigning to join them for a family night. Peter was thrilled by the idea.<span class=\"Apple-converted-space\"> </span></p>\n<p>The moment Happy pulled up, into Tony’s private garage, the car door was flung open and Tony found himself with an armful of teenager.<span class=\"Apple-converted-space\"> </span></p>\n<p>“Hey, kiddo!”<span class=\"Apple-converted-space\"> </span></p>\n<p>Peter pulled back, smiling happily at Tony. “Hey, Tony.”</p>\n<p>They had finally moved on from the ‘Mr Stark’ phase, though it had taken some time. Tony was glad for it. But in the long run, he was hoping for a more permanent change, one that he was going to need May’s blessing for. <em>Dad</em>.</p>\n<p>“Tony Stark, are you going to help with all these bags?”<span class=\"Apple-converted-space\"> </span></p>\n<p>Ruffling Peter’s hair, he moved around to give May a hug. “Good to see you too, May.”</p>\n<p>Playfully huffing, May returned the hug. “It’s been too long. I hope Peter has been behaving himself when he’s been here.”</p>\n<p>“He never does anything else.”</p>\n<p>Tony moved away from the hug, only to turn to Happy. Happy gave him an unimpressed look. “Well, I’m not hugging you.”</p>\n<p>Laughing, Tony reached to grab a couple of the bags from the trunk and lift them inside. He was sure he’d built robots to do exactly this, but he didn’t know where in his labs those would be.<span class=\"Apple-converted-space\"> </span></p>\n<p>They carried the bags and Peter’s books into Tony’s personal living area.<span class=\"Apple-converted-space\"> </span></p>\n<p>Peter immediately went to dump his bags in his room, while Tony showed May to one of the spare rooms down the hall.<span class=\"Apple-converted-space\"> </span></p>\n<p>“So, it’s about 5 O’Clock now... I can order us some pizza and we’ve got a selection of films to watch. Peter wanted a family movie marathon. Is that good?”</p>\n<p>May smiled, “Sounds wonderful.”</p>\n<p>“Good. We’ve got a science exhibit tomorrow, I booked out the entire place for us.”</p>\n<p>Peter squealed from his room in excitement, shouting to Tony about how amazing it was going to be. May rolled her eyes at the enthusiasm. She couldn’t quite remember the last time she felt this content, this <em>happy</em>. It had certainly been a long time.<span class=\"Apple-converted-space\"> </span></p>\n<p>Now she was so happy, she could burst, and it was all because of Peter. Peter <em>and</em> Tony. As she watched them talk science to each other, she found herself eternally grateful that Peter had found someone who encouraged his interests, someone who looked after him when she couldn’t, someone who love him like she did. Someone who was like a father to him.<span class=\"Apple-converted-space\"> </span></p>\n<p>That’s what she saw when she looked at Tony and Peter. A Father and Son.</p>\n<p align=\"center\">****</p>\n<p>“So, it’s settled?”</p>\n<p>“Yeah. Natasha still has clearance to get into Tony’s personal living areas, in case of emergencies. So Saturday morning, we’re going in. We’re going to find out what’s really going on, once and for all.”</p>\n<p align=\"center\">****</p>\n<p>May awoke early, to an empty household; her work as a nurse meant she wasn’t really able to stay in bed longer than 8 hours without a large amount of anxiety, while Peter was a teenager and didn’t get up before midday on a weekend - other than to patrol or go to Ned’s - and Tony had such an odd sleep schedule, May was unsure if he ever slept at all.<span class=\"Apple-converted-space\"> </span></p>\n<p>As a result, May found herself alone, in her pyjamas, pouring herself a bowl of cereal in Tony’s personal kitchen that Saturday morning when the elevator let out a loud<em> ‘ding’.<span class=\"Apple-converted-space\"> </span></em></p>\n<p>Completely blindsided, May could do little more than drop her spoon before virtually <em>all the Avengers</em> came out of the elevator at once.<span class=\"Apple-converted-space\"> </span></p>\n<p>May immediately stood up.</p>\n<p>The Avengers looked a mixture of livid, upset and disappointed at seeing her. Considering she’d never met any of the Avengers before, she had no idea why they were looking at her like that, but she didn’t plan on finding out.<span class=\"Apple-converted-space\"> </span></p>\n<p><em>“Tony!”</em> May shouted out towards Tony’s room, hoping that her voice or Friday would help wake him up.<span class=\"Apple-converted-space\"> </span></p>\n<p>“You must be May Parker.” Bucky looked up her and down, unimpressed.<span class=\"Apple-converted-space\"> </span></p>\n<p>“How do you kno-?!”</p>\n<p>Her question was interrupted by Tony sprinting into the kitchen, his suit already half forming around his pyjamas. “May, are you alr-?!”</p>\n<p>Stumbling after him, was a disheveled Peter, who also looked panicked at his Aunt’s shouting. “Aunt May?!”</p>\n<p>They both came clattering to a halt, seeing the half assembled Avengers Team in front of them.<span class=\"Apple-converted-space\"> </span></p>\n<p>There was a beat of silence.</p>\n<p>Steve, taking charge, spoke first. “Tony, what is going on here?”</p>\n<p>Trying to act nonchalant, Tony responded, “<em>Hey</em>, Cap. What brings you to my humble abode?”<span class=\"Apple-converted-space\"> </span></p>\n<p>The look was ruined slightly by the clanging of his armour as a metal pad from his repulser fell uselessly to the floor.<span class=\"Apple-converted-space\"> </span></p>\n<p>“I stood up for you!” Clint, unable to take the awkward tension and having grown angrier by the second at Tony’s attempt at feigning ignorance, blurted out. “I told them that you wouldn’t be doing this and yet here you are!”</p>\n<p>Tony felt fear seep through his bones; they had finally found out about Peter, about <em>Spider-Man</em>, he hadn’t done enough to protect him and now the Rogues were rightly angry at him for bring a <em>child</em> to a battleground.<span class=\"Apple-converted-space\"> If he was them, he would be too.</span></p>\n<p>He raised his hands, placatingly. “Look, I know I should have told you and I know it was wrong but I was trying to do the right thing.”</p>\n<p>Bucky chipped in, looking murderous, “How could you lie like that?!<span class=\"Apple-converted-space\">  </span>Go behind everyone’s backs, behind <em>Pepper’s</em> back, and do this?!”</p>\n<p>“To start with, Pepper didn’t know but she does now, I swear.”</p>\n<p>“You’re trying to tell us that Pepper is okay that you’re <em>cheating on her.</em> That’s some bull, right there!”</p>\n<p>“Wha-?” Now Tony was confused, <em>what were they talking about?</em> “What are you talking about?”</p>\n<p>May, who had moved to stand beside Peter, shielding him from sight, looked at the scene in front of her and suddenly it clicked. They had become angry when they had seen her there, standing in the kitchen in her pyjamas. They weren’t angry about Peter, or Spider-Man, they were angry about <em>her</em>.</p>\n<p>“Tony, I think... I think they think we’re having an affair.”</p>\n<p><em>“What?!” </em>Both Peter and Tony turned to stare incredulously at May, dumbfounded.<span class=\"Apple-converted-space\"> For geniuses, they both were incredibly dense sometimes.</span></p>\n<p>The Rogues gave each other confused looks. They were a lot less confident, and angry, than they were a few seconds before. If Tony wasn’t having an affair, then what on Earth was going on?</p>\n<p>Being the chosen scapegoat, Steve hesitantly asked. “Aren’t you?”</p>\n<p>Immediately, Tony started laughing. The kind of laugh that has you doubling-over, clutching your stomach. It was actually more painful than he remembered. He looked over at Peter to see the disgusted look on his face and creased up again.<span class=\"Apple-converted-space\"> </span></p>\n<p>May took over, clearly Tony wasn’t in a fit state to reply just yet. “Tony and I aren’t having an affair. <em>Why</em> would you have thought that?”</p>\n<p>“Maybe the fact that he’s been contacting you and visiting your house on a bi-weekly basis for the last year? Or the fact that he’s been sending money and gifts to you? Or, the fact that you are in his <em>personal quarters </em>having spent the night here while Pepper is gone and Tony lied about it?!” Clint’s diatribe picked up speed towards the end, but the speech seemed to have got through to Tony, as he’d stopped laughing and seemed a little more somber than when they’d first started out.<span class=\"Apple-converted-space\"> </span></p>\n<p>“Wait.” Bucky, couldn’t help but voice everyone else’s confusion, along with his own. “If you aren’t having an affair, how do you know each other? What is she doing here? What is the kid doing here? And what were you apologising for lying to us about?!”</p>\n<p>Everyone’s attention turned back to May, Tony and Peter.<span class=\"Apple-converted-space\"> </span></p>\n<p>Tony’s mouth was open, but he was frozen and no sound was coming out. It was like he didn’t know what to say, or do.</p>\n<p>“He-He was lying about me.” Peter’s voice came out small and quiet.<span class=\"Apple-converted-space\"> </span></p>\n<p>With all the Avengers attention on him he felt small. He could normally brave it out, when in his suit; he could blind them with cool tricks and fast words, but here, in his Hello Kitty pyjamas, and bare face he felt frightened.</p>\n<p>“Pete, no, it’s fine. You don’t have to say anything. It’s none of their business.” Tony turned to look at Peter and hated how meek he looked. He placed his hands on Peter’s shoulders, ignoring the Avengers behind him, and spoke quietly to Peter, even though he knew the others could here him.<span class=\"Apple-converted-space\"> </span></p>\n<p>“If you aren’t ready, we don’t have to tell anyone anything, okay kiddo? Why don’t you go get dressed? Your Aunt and I will be in in a minute and we can all go out to the exhibit like we planned, okay?”</p>\n<p>Through his talk with Peter, the Avengers were examining their interaction, fascinated. They had never seen Tony act so patient or caring towards someone other than Pepper or Rhodey. He was acting maturely and.. maybe even <em>fatherly</em>.</p>\n<p>After an encouraging nod from May, Peter trailed hesitantly towards his room.<span class=\"Apple-converted-space\"> </span></p>\n<p>“What was that?”</p>\n<p>Ignoring Clint, May and Tony had a silent communication. They had discussed telling the other Avengers before, when they had first been moving into the Compound, but decided against it; May didn’t trust them. They had, also, considered the Personal Intern route, like before, but didn’t know how to explain that whole ‘Intern living in Tony’s personal quarters’ thing. They hadn’t got any further than that, but from May’s expression he knew she was about to give her own excuse, he just didn’t know what.<span class=\"Apple-converted-space\"> </span></p>\n<p>Her expression said <em>‘trust me’ </em>and he did, so he nodded.<span class=\"Apple-converted-space\"> </span></p>\n<p>“Tony knew my sister-in-law, Mary. He knew her fifteen years ago, before she died. Last year, Tony found out about Peter and reached out. He offered money and gifts, he visits a lot and invites us over because... because Peter is his son.”</p>\n<p>Jaws dropped around them, disbelief across their features, Tony only hoped his own face didn’t reflect their expressions. He looked at May, searchingly, asking her non-verbally, <em>‘are you sure you want to do this?’</em><span class=\"Apple-converted-space\"> </span></p>\n<p>May smiled at him, it was hardly a lie. It was just a stretching of the truth, a truth that the other Rogues had no right to either way.</p>\n<p>Tony felt a mixture of fear, excitement, pride and love well-up in him.<span class=\"Apple-converted-space\"> </span></p>\n<p>\n<em>I guess I’m a dad now.<span class=\"Apple-converted-space\"> </span></em>\n</p>\n<p>He wondered to himself how Peter would take the news.</p>\n<p>Peter was sat in his room.<span class=\"Apple-converted-space\"> </span></p>\n<p>He was supposed to be changing from his Hello Kitty pyjamas, but instead he was sat dumbfounded on his bed, reeling from what he’d just heard.<span class=\"Apple-converted-space\"> </span></p>\n<p>He doubted anyone in the kitchen, including Tony, knew or remembered his super-powered hearing, so they wouldn’t know he’d heard them. Yet.</p>\n<p>May had just told all the Avengers that <em>he</em> was Tony’s son. <em>Him</em>. There had been no wavering or hesitance; she stated it like it was a fact.<span class=\"Apple-converted-space\"> </span></p>\n<p>Worryingly, he hadn’t heard Tony respond, he had only heard the uproars that sounded immediately after the announcement. So he didn’t know what Tony’s reaction was. Would he be upset that May just foisted a pretend son on him or would he be happy to claim a relationship like that with Peter?</p>\n<p>Peter hoped the latter. After all, they had been spending so much time together recently that it almost seemed like that might be what Tony wanted. But that could just be Peter reflecting him own emotions on Tony. And then, if he did accept that relationship, what would they do when it inevitably came out? Or if the Parker luck hit again? Peter couldn’t bare to loose another parent or guardian, not May and especially not Tony.<span class=\"Apple-converted-space\"> </span></p>\n<p>He heard shouting, lots of shouting. He could make out Tony’s voice, but couldn’t concentrate enough to distinguish what was being said. Tony just sounded angry.<span class=\"Apple-converted-space\"> </span></p>\n<p>Finally, there was silence.<span class=\"Apple-converted-space\"> </span></p>\n<p>Distantly, he could hear the muffled voices of Aunt May and Tony. They were getting closer.<span class=\"Apple-converted-space\"> </span></p>\n<p>There was a knock on the door.<span class=\"Apple-converted-space\"> </span></p>\n<p>Peter wondered vaguely how long he’d been sat on his bed.<span class=\"Apple-converted-space\"> </span></p>\n<p>“Hey kiddo, can I come in?” Tony sounded calm, but after all the shouting Peter had heard he didn’t know if it was put-on or not.</p>\n<p>“Yeah.” Peter curled up, wrapping his arms around his pillow for comfort.<span class=\"Apple-converted-space\"> </span></p>\n<p>Tony opened the door slowly, seemingly unsurprised to see Peter still unchanged and curled up on his bed.<span class=\"Apple-converted-space\"> </span></p>\n<p>“How much of that did you hear?”</p>\n<p>“Some. May-You-Both of you told <em>them</em> I was your son.” Peter refused to look at Tony.<span class=\"Apple-converted-space\"> </span></p>\n<p>He didn’t know what would happen if he did. Maybe he would see Tony’s expression of laughter, as if they’d pulled a joke on the Avengers and it would all be one great laugh. If that happened, he didn’t think he could share the amusement; he couldn’t go through the motions of pretending to have a father when secretly all he wanted was for <em>that</em> to <em>actually</em> be true.<span class=\"Apple-converted-space\"> </span></p>\n<p>In the doorway of Peter’s bedroom, Tony debated what to respond.<span class=\"Apple-converted-space\"> </span></p>\n<p>He could say that he agreed with May because it would keep Peter’s identity hidden. He could say that that was all there was to it, but that wouldn’t be the truth and Peter deserved better. He agreed because he wanted Peter to be his son. After all the betrayals he’d had in his life; his father, Obadiah, <em>Steve</em>, he needed something stable in his life. He wanted that to be Peter. And he didn’t want to hide that from Peter, it wouldn’t be fair to either of them. So, he was going to tell Peter the truth about why he agreed with May and just <em>hope</em> that Peter felt the same way.</p>\n<p>Tony edged towards the bed to sit beside Peter, moving the newest Lego Death Star model over to make room.</p>\n<p>“Peter, I don’t want you to think that I’m trying to replace your parents, or Ben. But when May said that, when I <em>confirmed</em> it, I wasn’t just saying it to keep your identity secret.” Tony waited a moment, hoping Peter would raise his eyes.<span class=\"Apple-converted-space\"> </span></p>\n<p>“Peter, I said it because I would love nothing more than to claim you as my son. I spoke with May after those little shits-” Peter giggled at the language despite himself, ”-left and she gave her permission. So, if you want to, and <em>only if you want to,</em> would you like to become my son?”</p>\n<p>Peter felt his world stop. <em>Is this real? Tony Stark wants him to be his son?!</em></p>\n<p>“-Peter?”</p>\n<p>“<em>Why</em>?”<span class=\"Apple-converted-space\"> </span></p>\n<p>The question was out of his lips before his brain could catch up with him. He felt a blush creep up his neck, so he spoke quickly before Tony could reply, “I mean, I know <em>why</em>. It’s ‘cause I’m Spider-Man, but I-“</p>\n<p>“No.”<span class=\"Apple-converted-space\"> </span></p>\n<p>That stopped Peter short, his gazed fixed back onto Tony’s devastated face.</p>\n<p>“Peter, that’s not true. I didn’t ask you because you are Spider-Man. I’ve asked you because <em>I love you</em>. I love you because you are <em>Peter Parker. </em>You are a certified <em>genius</em>, someone who listens to his music too loud at night, who likes pineapple on pizza, who didn’t want to go crime-fighting because he <em>had homework.</em> You have an obsession with Lego and nerdy shit and you are the kindest person I’ve ever met. I love you because you are Peter Parker and you <em>just so happen</em> to also have super-human powers.”</p>\n<p>Tears were filling up Peter’s eyes and he didn’t know how to stop them.<span class=\"Apple-converted-space\"> </span></p>\n<p>“You don’t have to say yes, but whether you do or not, powers or not, I will love you as if you are my own kid, no matter what.”</p>\n<p>Peter flung himself at Tony, wrapping his arms around Tony’s neck, and Tony hugged back just as fiercely. They both ignored the crunching sound, which was most likely them crushing the half-built Star Wars model. Comparatively, it was hardly of importance.<span class=\"Apple-converted-space\"> </span></p>\n<p>As Peter’s tears abated, Tony pulled back.</p>\n<p>He looked into Peter’s face, “I don’t want to assume anything, but was that a yes?”</p>\n<p>Peter choked out a laugh.<span class=\"Apple-converted-space\"> </span></p>\n<p>“Yes, I would love to be your son.”</p>\n<p>He smiled tearfully and Tony responded in kind, hugging him again.<span class=\"Apple-converted-space\"> </span></p>\n<p>\n<em>Who would have thought they would go from Tony saying that ‘we aren’t there yet’ for hugging to asking him to be his son? This is like a dream come true.<span class=\"Apple-converted-space\"> </span></em>\n</p>\n<p align=\"center\">****</p>\n<p>After actually wiping away the tears and getting changed, Peter and Tony emerged from Peter’s room.</p>\n<p>May, sat at the kitchen table, all dressed, with a coffee mug in hand. She looked up at they entered the room.<span class=\"Apple-converted-space\"> </span></p>\n<p>Her expression was nervous as she spotted the tear-tracks down Peter’s face, but the moment she saw his smile, she beamed. “You said yes?”</p>\n<p>Peter nodded, glancing between Tony and May, as though checking to see if this was all real. “I said yes.”</p>\n<p>“Peter Parker, is officially going to be my son.”</p>\n<p>The pride in Tony’s voice was unmistakeable. The three of them drew into one big group hug, each unable to hold back their excitement and gleefulness.<span class=\"Apple-converted-space\"> </span></p>\n<p>Once they’d settled back down for breakfast, the realities of the situation began to kick in for Peter.<span class=\"Apple-converted-space\"> </span></p>\n<p>“Ton- Can I still call you Tony?”</p>\n<p>Tony startled a little at the question, glancing to May for assurance.</p>\n<p>“You can, if you like, but... if you want to that is, you could call me Dad?”</p>\n<p>“Dad? <em>Dad</em>.”<span class=\"Apple-converted-space\"> </span></p>\n<p>Peter tested the word. It wasn’t a word he remembered ever using before, but from the way Tony’s face lit up when he said it, he knew he would be using it a lot from then on.</p>\n<p>“Okay, then.. <em>Dad</em>?” Tony merely grinned. “What will happen now?”</p>\n<p>“What do you mean?”</p>\n<p>“Will... Will anything change with Aunt May? Will I have to live here full-time?”</p>\n<p>Realising Peter’s concern, Tony wanted to assuage his fears. “No, not if you don’t want to. We can keep doing what we do now. Whenever your Aunt is free, you can stay with her, otherwise you can stay here. At home.”</p>\n<p>“And what about my name, I can still keep Parker, right?”</p>\n<p>“Yeah, kiddo, of course. Your parents were called Parker. Your Uncle Ben was called Parker. <em>Aunt May </em>is called Parker. It’s your name, I won’t make you change that. But if you want you can use the name Stark as well. It doesn’t have to be right away, but if you want to, in the future that is, you can.”</p>\n<p>Peter nibbled as his bottom lip, considering.<span class=\"Apple-converted-space\"> </span></p>\n<p>“I don’t think I want to now, at least, not until school is over. I don’t think anyone there would understand. Except maybe Ned, and MJ.”</p>\n<p>“Well, that’s your decision. And as for telling people, we won’t do that until you’re ready. Okay?”</p>\n<p>Peter felt a rush of anxious realisation run through him. “But-But what about the Avengers?! If you told them, they could tell other people.”</p>\n<p>May soothingly reached to rub Peter’s back, calming him.<span class=\"Apple-converted-space\"> </span></p>\n<p>“Sweetie, it’s okay. Your Dad-” Peter felt his heart swell,”-had some words with them. He told them-“ May coughed embarrassedly, trying to find the words.</p>\n<p>“-Well let’s just say the language isn’t appropriate to say, right now. But essentially, while they might have <em>thought</em> they were acting in Pepper’s best interest, Tony stressed to them that they <em>completely</em> violated Tony’s privacy and were well out of order. They aren’t allowed to come back until they’ve apologised and they cannot tell anyone about you without fear of being sued so hard that they would have to bankrupt several small countries to get out of it. So, Peter, don’t worry about the Avengers. Your Dad has them covered.”</p>\n<p>“And what about Pepper?”</p>\n<p>Tony felt his heart stutter. He hadn’t even considered what Pepper’s reaction might be to him now claiming Peter. <em>Did that make him a bad person? </em>It wasn’t like they couldn’t afford it, nor was it like Peter didn’t already live with them, but Pepper might be upset at the lack of consultation, or involvement. <em>Too late now.</em></p>\n<p>“That’s not your concern, Peter. But, just so you know, Pepper loves you too.” He knew Pepper loves Peter. But beyond that, Tony didn’t want Peter worrying about adult things; he only wanted Peter concerned with when to tell Ned and what homework he needed to do for Monday.<span class=\"Apple-converted-space\"> </span></p>\n<p>“I will tell Pepper. And don’t worry, she’ll be delighted. Now, let’s have our first outing together as father and son. To the Science exhibit!”</p>\n<p>Peter grinned.</p>\n<p align=\"center\">****</p>\n<p>“So. We really fucked that one up, didn’t we?”</p>\n<p>All the Rogue sat in their East Wing common room, attempting to wrap their heads around what just happened.<span class=\"Apple-converted-space\"> </span></p>\n<p>Steve didn’t even have it in him to criticise Clint’s cussing, as it seemed appropriate for the situation.<span class=\"Apple-converted-space\"> </span></p>\n<p>He was currently clutching a bag of ice to his face where Tony had punched him. He let him, not trying to avoid the blow. After everything they had just accused Tony of, Steve was surprised there wasn’t more violence.</p>\n<p>“We need to apologise.” Steve confirmed, glancing over at Bucky.<span class=\"Apple-converted-space\"> </span></p>\n<p>The guilt was obvious on the ex-hydra agent’s face; they had been working so hard to gain Tony’s trust back after the fiasco in Siberia and they just went straight back into violating his trust again.<span class=\"Apple-converted-space\"> </span></p>\n<p>“Yeah.” Bucky grunted. “But how can we make <em>this</em> better? We literally just accused him of cheating on the love of his life. We hacked into May Parker’s phone records and <em>we stalked Tony</em>. And <em>then</em>, to make it worse, we bullied him into revealing his son to us before he was ready.”<span class=\"Apple-converted-space\"> </span></p>\n<p>Clint sat beside them, quietly stewing. He contemplated his own family situation, had been thinking of it ever since their encounter with Tony. How would he have felt if any of his team-mates had found the farm and arrived unannounced, catching him and his family unawares? Even when they were all on the best of terms he wouldn’t have acted favourably, so the fact that there had been only a limited amount of yelling and very little maiming spoke volumes of Tony’s restraint.</p>\n<p>What would he have wanted Tony to do if the situation was reversed?</p>\n<p>“Here’s the plan. First, we apologise. To Tony <em>and</em> to May and Peter.”</p>\n<p>Clint paused, looking around him to ensure that everyone was paying attention. “When I say that, I don’t mean as a group. We need to apologise separately. We <em>all</em> fucked up here and so we should <em>all</em> apologise. It’s more genuine that way.”</p>\n<p>Steve, Sam and Bucky nodded along, making mental notes of his instructions. Natasha’s head was tilted, indicating she was listening intently, probably memorising everything. And Wanda had her eyes closed, so Clint assumed she was following along too.<span class=\"Apple-converted-space\"> </span></p>\n<p>“Secondly, we should get to know Peter. If we want to make repairs with Tony then we can start by showing him that his family is also our family. And, it should go without saying, no more looking into Tony’s life, or Peter’s. We talk to them at the compound only, if they want us to. So <em>no following anyone. </em>We’ve done enough of that.”</p>\n<p>Natsha stood, “Alright team, let’s get to work.”</p>\n<p align=\"center\">****</p>\n<p>It was Peter’s first day at school since Tony offered to adopt him. It still felt surreal.<span class=\"Apple-converted-space\"> </span></p>\n<p>The process had been started as soon as he’d accepted. Tony was pushing through on the legally side as he walked into school. He was changing his legal documents and next of kin, he’d even put Peter <em>in his will.</em> Not that he wanted to think about that potential.<span class=\"Apple-converted-space\"> </span></p>\n<p>Tony - <em>his Dad</em> - said he’d be contacting the school today to change guardianship names and address, especially since his primary residence was now the Compound.<span class=\"Apple-converted-space\"> </span></p>\n<p>The teachers and any staff with access to school files would be asked to sign NDAs today. It made Peter’s skin itch with nerves.<span class=\"Apple-converted-space\"> </span></p>\n<p>Peter looked up in surprise. He’d manage to walk to his locker on auto-pilot, not even paying attention the the hubbub surrounding him; purely relying on his spidey-sense to lead him through the crowd. It spoke a lot of his sense development that he’d been able to do it without thinking.<span class=\"Apple-converted-space\"> </span></p>\n<p>He grabbed his books out of his locker and waited. Turns out he didn’t have to wait long, as Ned came around the corner not two minutes later.</p>\n<p>“Ned, Ned, Ned.”<span class=\"Apple-converted-space\"> </span></p>\n<p>He scrambled over to him and intercepted before Ned could reach his locker. Ignoring the other boys confusion, he dragged Ned into the closest ‘Boys’ bathroom.<span class=\"Apple-converted-space\"> </span></p>\n<p>“Woah, Peter what’s up?”</p>\n<p>Without responding, Peter started checking the bathroom stalls. “Make sure the door stays closed, Ned.”</p>\n<p>Ned moved his bags to weigh the door down and leaned against it. “Peter, what’s happening? Is it your <em>internship</em> stuff?”<span class=\"Apple-converted-space\"> </span></p>\n<p>Ned’s voice lowered to a whisper when he said ‘internship’, which was their not-so-subtle code word for anything spider-related.<span class=\"Apple-converted-space\"> </span></p>\n<p>“No. Well, not quite.”<span class=\"Apple-converted-space\"> </span></p>\n<p>Peter started pacing, shaking his hands out nervously. “So, there was this thing on Saturday-I mean, it started on Friday- May and I went over to the Compound and we- Well, doesn’t matter-“</p>\n<p>“Peter, just tell me, man. You’re freaking me out.”</p>\n<p>“Tony Stark is adopting me.”</p>\n<p>“WHAT?! NO WAY!” Ned immediately pounced on Peter, hugging and jumping, elated. “Oh MY God, tell me everything!”</p>\n<p>Peter’s chest loosened, he grinned.<span class=\"Apple-converted-space\"> </span></p>\n<p>Maybe today would be a good day.</p>\n<p align=\"center\">****</p>\n<p>Today had not been a good day.<span class=\"Apple-converted-space\"> </span></p>\n<p>Flash had caused him to drop all his books that morning, heading into class, and trodden all over his homework to the point where the writing was indecipherable. It had effectively ruined his morning’s good mood and, also, succeeded in getting him a detention in chemistry.<span class=\"Apple-converted-space\"> </span></p>\n<p>He was grateful to heading back to the Compound (or should he start officially calling it home?).</p>\n<p>Even just yesterday, he had found himself more relaxed than the past few weeks; now if he saw any of the Rogues he wouldn’t have to worry about hiding, he now had a valid excuse for being in the compound.<span class=\"Apple-converted-space\"> </span></p>\n<p>Over the weekend the Rogues had individually apologised to him. From what Tony (<em>his Dad</em>) had said, they had done so to him too.</p>\n<p>Peter hadn’t wanted to make things easy for them; his Dad had opened <em>their home</em> to the Rogues and all of them had effectively thrown any trust they’d been given out of the window.</p>\n<p>So, yeah, he’d been a little bitter about the whole situation.<span class=\"Apple-converted-space\"> </span></p>\n<p>He’d made Steve and Bucky’s apologies as long and drawn out and awkward as he could. Those men had left his father to die in the wastelands of Siberia, someone who had considered them friends, so no, Peter had not felt forgiving. He’d taken comfort from the fist-shaped bruise on Steve’s face; it looked Tony-sized.<span class=\"Apple-converted-space\"> </span></p>\n<p>He’d even gone out of his way to mention the school PSAs of Captain America to Sam, to his strong amusement; he hadn’t felt as angry at Sam, he hadn’t been a team-mate or friend of Tony’s before the Civil War so it wasn’t as much of a betrayal, he’d just been fighting for his friends.</p>\n<p>He thought back to the days where he’d been excited to catch Captain America’s shield. <em>How things have changed.<span class=\"Apple-converted-space\"> </span></em></p>\n<p>Since that fateful Saturday, the Rogues had all gone out of their way to interact with him when they saw him.<span class=\"Apple-converted-space\"> </span></p>\n<p>So as he got out of the car and walked into the Compound from school on Monday, he had a number of them waving at him awkwardly.<span class=\"Apple-converted-space\"> </span></p>\n<p>He ignored them.</p>\n<p>It was lucky Peter had the experience interacting with them as Spider-Man, otherwise he’d have felt a lot more overwhelmed than he already did.</p>\n<p>The only Avenger who was succeeding in breaking past his barriers was the Black Widow. <em>Natasha Romanov.<span class=\"Apple-converted-space\"> </span></em></p>\n<p>It helped that she had been on his father’s side during the so-called Civil War and that she hadn’t left his father to die like he was nothing. It also helped that he was in awe of the way she could kill a man with her pinky finger.<span class=\"Apple-converted-space\"> </span></p>\n<p>Her apology had been the first and, from what he could tell, the most genuine. After which, she had offered to teach him how to throw knives. That’s right. <em>The Black Widow offered to teach him how to throw knives. </em>Apology accepted.</p>\n<p>They were going to start immediately after school that afternoon. He’d asked Tony about it, he’d been hesitant at first but agreed to it once Peter said he’d still have time to spend in the lab with Tony.</p>\n<p>Arriving in the training room, he double-checked the doors to make sure it was the correct one; Peter found it empty.</p>\n<p>Shrugging, he started to stretch.</p>\n<p>His spidey-sense tingled. It was an underlying buzz, not a cause for alarm, so he didn’t move.<span class=\"Apple-converted-space\"> </span></p>\n<p>A throwing star flew past his head and imbedded itself in the wall beside him.<span class=\"Apple-converted-space\"> </span></p>\n<p>Peter pretended to be shocked.<span class=\"Apple-converted-space\"> </span></p>\n<p>As in, he swivelled his head around and had an exaggerated look of surprise on his face. Peter didn’t know if he over did it, but he already knew that he wouldn’t be getting any awards in Drama this school year, so he doubted he did well.</p>\n<p>“Awareness-” Natasha dropped down from the rafters in a move that strongly reminded Peter of Hawkeye, making him wonder briefly if they ever had shared training. “-is key to any training, Stark Jnr.”</p>\n<p>“Er, J-Just Peter is fine, Miss Widow.”</p>\n<p>Natasha smiled, “Natasha is fine, Peter.”</p>\n<p>Peter was officially freaking out. <em>This was one of the best days of his life.</em></p>\n<p>Once they began throwing the knifes, Peter knew Natsha was surprised at his aptitude. He wondered vaguely if he should be pretending to be worse, but then again that might look even more suspicious.</p>\n<p>By the end of the session, they had been moving on to moving targets. The moving targets Peter found much harder and would only get their outer body parts, as opposed to the head and heart he’d been getting previously.</p>\n<p>Natasha was a brilliant teacher, patient but critical where needed. He loved every second of it.<span class=\"Apple-converted-space\"> </span></p>\n<p>“N-Natasha?”</p>\n<p>“Yes, маленький?”</p>\n<p>“Could you teach me Russian?”</p>\n<p>Natasha smiled conspiratorially.</p>\n<p align=\"center\">****</p>\n<p>“Hey, Peter!”</p>\n<p>As he walked into Tony’s personal quarters, he was assaulted by a big hug.</p>\n<p>“Ahhhhh!” He flailed uselessly for a second, before realising who was hugging him.<span class=\"Apple-converted-space\"> </span></p>\n<p>“Rhodey!”</p>\n<p>“Peter!”</p>\n<p>Once back on the ground, Peter held his hand out seriously. Rhodey took it just as seriously and began to do their secret handshake, which had taken them an entire day to learn.</p>\n<p>“Hey, Petey-Pie, I’m the Dad here! Where’s my hug?!”</p>\n<p>Peter immediately launched himself at Tony. The novelty of the whole situation still rife.<span class=\"Apple-converted-space\"> </span></p>\n<p>He stiffened, looking between Rhodey and Tony.<span class=\"Apple-converted-space\"> </span></p>\n<p>“Wait, you told Rhodey about <em>it</em>, right?”</p>\n<p>“Of course he did! Which means little Peter, that you need to start calling me Uncle Rhodey!” Peter beamed. “You might be the only niece or nephew I get!”</p>\n<p>Tony threw him an unimpressed look. “Your sister is <em>literally</em> 6 months pregnant.”</p>\n<p>“How, um, how did Pepper take it?”</p>\n<p>Tony, who still had his arms wrapped around Peter’s shoulders, moved back to get a good view of Peter’s face.<span class=\"Apple-converted-space\"> </span></p>\n<p>“She said ‘Welcome to the Family’, Pete.”<span class=\"Apple-converted-space\"> </span></p>\n<p>And so, the tears began again.<span class=\"Apple-converted-space\"> </span></p>\n<p align=\"center\">****</p>\n<p>A few days later, on Thursday night, Peter crept into his room from Patrol.<span class=\"Apple-converted-space\"> </span></p>\n<p>It had been a day or two, with all the madness, since he’d been out and the guilt had been overwhelming.<span class=\"Apple-converted-space\"> </span></p>\n<p>Peeling off the suit, he winced.<span class=\"Apple-converted-space\"> </span></p>\n<p>Moving over to the mirror, he caught a glimpse of his injuries. He had what looked to be severely bruised ribs and a black eye, but thankfully no cuts or bleeding.<span class=\"Apple-converted-space\"> </span></p>\n<p>He snorted to himself, ‘<em>All the bleeding is internal, that’s where the blood is supposed to be.’ Damn, Brooklyn-99 is amazing.</em><span class=\"Apple-converted-space\"> </span></p>\n<p>“Hey, Friday.”</p>\n<p>“Yes, Junior.”<span class=\"Apple-converted-space\"> </span></p>\n<p>He couldn’t resist rolling his eyes at the new nickname, Tony had been practically vibrating with joy when he’d done it.<span class=\"Apple-converted-space\"> </span></p>\n<p>“Add a copy of my injuries to the log, but <em>don’t</em> wake Dad up. Let him see it in the morning, it’s not <em>that</em> bad.”</p>\n<p>He’d had a good night all-in-all. He had stopped two muggings, walked a woman home after she’d been harassed and bought a homeless man a hotdog. And then, of course, got caught up in a third robbery gone wrong, with an extra lookout he hadn’t spotted.<span class=\"Apple-converted-space\"> </span></p>\n<p>Thankfully, he’d been able to wrestle one of their knives of them and pin the other to the wall with it, it had been very satisfying.<span class=\"Apple-converted-space\"> </span></p>\n<p>\n<em>Thank you, Natasha.</em>\n</p>\n<p align=\"center\">****</p>\n<p>Friday afternoon, Pepper was coming home.<span class=\"Apple-converted-space\"> </span></p>\n<p>Peter was nervous. He didn’t know how she had actually taken the news; he had only got Tony’s word for it and he knew Tony would try to protect him from bad news if she hadn’t taken it well.</p>\n<p>He walked into the Compound with trepidation.<span class=\"Apple-converted-space\"> </span></p>\n<p>“маленький!”</p>\n<p>“мисс паук!”<span class=\"Apple-converted-space\"> </span></p>\n<p>He grinned at Natasha.<span class=\"Apple-converted-space\"> </span></p>\n<p>She frowned back at him.<span class=\"Apple-converted-space\"> </span></p>\n<p>“What happened to your face?”</p>\n<p>He startled. He had forgotten he still had a bruise, to be honest. He’d told Tony about it and everyone at school had bought the excuse that he’d been hit by a baseball in the park, so he’d forgotten that other people might see it and be worried.<span class=\"Apple-converted-space\"> </span></p>\n<p>“Ah, it’s nothing, don’t worry about it.”</p>\n<p>He tried not to shift guiltily.<span class=\"Apple-converted-space\"> </span></p>\n<p>“<em>Who did this to you?”</em></p>\n<p>“No-one, it was an accident, I swear!”</p>\n<p>“You’re lying.” Natasha’s face crinkled with concern. “Are you getting bullied?”</p>\n<p>“What? No! I mean, yes, but <em>he</em> didn’t do this.” Peter stumbled over his words.<span class=\"Apple-converted-space\"> </span></p>\n<p>“<em>Who</em> is bullying you?”</p>\n<p>“It’s fine, it’s just some dickhead called Flash. But it’s fine, he didn’t do this. He’s just some kid.”</p>\n<p>Natasha pursed her lips angrily, but nodded. “We’re still on for Sunday?”</p>\n<p>“Yeah, I can’t wait!”</p>\n<p align=\"center\">****</p>\n<p>Entering their quarters, he came face-to-face with a disaster waiting to happen.<span class=\"Apple-converted-space\"> </span></p>\n<p>There, in front of him, was May and Pepper laughing loudly and conspiratorially together, with Tony sulking in the corner.<span class=\"Apple-converted-space\"> </span></p>\n<p>Hearing the ‘<em>ding</em>’<span class=\"Apple-converted-space\"> </span> of the elevator, Tony rushed over to Peter, whispering, “Finally, I’ve been waiting for some backup.”</p>\n<p>“Sweetie!” Aunt May held her arms out for a hug. Obliging, Peter melted into it.<span class=\"Apple-converted-space\"> </span></p>\n<p>He turned slowly round to Pepper, only to see her also open her arms invitingly. His face crumpled with relief.<span class=\"Apple-converted-space\"> </span></p>\n<p>“Peter, you are one of the family. You <em>and</em> your Aunt. Don’t ever let anyone tell you differently.”</p>\n<p>“Sir,” The echoing voice fo Friday rang out, “Pizza has arrived.”</p>\n<p>“I guess family dinner is a-go then.”</p>\n<p>Peter glanced around at Aunt May, Pepper and Tony. <em>Yeah, family.<span class=\"Apple-converted-space\"> </span></em></p>\n<p align=\"center\">****</p>\n<p>It was but a couple of hours later, that they got the call.<span class=\"Apple-converted-space\"> </span></p>\n<p>Friday interrupted, telling them that <em>Thor</em> and <em>Bruce Banner</em> had landed a space ship in rural Wyoming and they <em>and the ship</em> were being escorted to the compound by former SHIELD agents.</p>\n<p>Immediately, Tony had instructed Friday to alert the other Avengers. They may not be getting on right now, but everyone deserved to be there for a reunion. <em>Bruce</em>. It had been two years. <em>Where had they been?<span class=\"Apple-converted-space\"> </span></em></p>\n<p>A lot had changed in two years. Tony glanced at Peter. A lot had changed.<span class=\"Apple-converted-space\"> </span></p>\n<p>The team had assembled outside the compound, including: Sam, Steve, Bucky, Wanda, Clint, Rhodey, Vision, Pepper, May, Natasha, Peter and Tony.</p>\n<p>Natasha had begun talking to Peter slowly in Russian, with him replying just as slowly back. <em>When had that happened?</em></p>\n<p>Meanwhile, the others were clustered to the side, guiltily glancing between Pepper and May.<span class=\"Apple-converted-space\"> </span></p>\n<p>Tony may have listened to their apologies, for the sake of the Team and Peter, but he still wasn’t ready to forgive them. He felt a jolt of satisfaction run through him when he saw the yellowing tinge of a healing bruise on Steve’s face. He must have hit Steve <em>really</em> hard for it to still be there nearly a week later. <em>Good</em>.</p>\n<p>“Dad?”<span class=\"Apple-converted-space\"> </span></p>\n<p>He instinctually turned at the address, before a warm feeling spread through him. Every time Peter called him Dad, he felt like the luckiest man alive.<span class=\"Apple-converted-space\"> </span></p>\n<p>“Should I be here?”</p>\n<p>“Wha-? Of course you should! I want Bruce to meet you.” He wrapped an arm around Peter’s shoulders, “And you always said you wanted to meet him and discuss anti-electron collisions or his thermonuclear fusion papers, why would you pass on that?”</p>\n<p>He ruffled Peter’s hair, “Come on, kiddo, settle down. You’re staying with us.”</p>\n<p>From next to Peter, Tony heard May teasing him, “Yeah, Peter. You know I’ve always wanted to ask Dr Banner about thermonuclear thingys, you wouldn’t let me miss this opportunity, would you?”</p>\n<p>As Peter sat himself down, Tony caught Clint glancing at him out of the corner of his eye. Clint was smiling sadly at their interaction. It reminded Tony that Clint had only been allowed to see his kids a handful of times since his release. <em>He must miss them.</em></p>\n<p>He mightn’t be Clint’s, or any of the Rogues, biggest fan right now, but he wouldn’t wish that on anyone. He made a mental note to look into extending the timing of supervised leave for the Rogues. <span class=\"Apple-converted-space\"> </span></p>\n<p>He was listening to the surrounding conversations, waiting for the roaring of an engine, when he overhead the absent-minded, innocent questioning of Sam. “Hey, if all the Avengers are here, where’s Spider-Man?”</p>\n<p>It was an innocent enough question, but it was one that would have to be dealt with in the near future. The Team were bound to be curious about the newest recruit, but Tony figured with the extreme recent violation of privacy they wouldn’t be hankering after answers any time soon. But it was only a matter of time.<span class=\"Apple-converted-space\"> </span></p>\n<p>It was only an hour or so later that they heard the tell-tale signs of a spaceship’s engine. <em>When did that become a semi-normal sound?</em></p>\n<p>It settled in the grass in-front of the compound.</p>\n<p>Tony felt himself bristle a little, thinking, Thor really does not care about lawn maintenance.</p>\n<p>He glanced over at Steve only to see him staring straight back at him, clearly remembering the same conversation.<span class=\"Apple-converted-space\"> </span></p>\n<p>He looked away.</p>\n<p>When the ship opened, Thor, Bruce and a woman in a white body suit trudge out.<span class=\"Apple-converted-space\"> </span></p>\n<p>Immediately, the Avengers converged.<span class=\"Apple-converted-space\"> </span></p>\n<p>“Bruce!”</p>\n<p>“Thor!”</p>\n<p>“Point Break!”</p>\n<p>“Banner!”</p>\n<p>With no sense of order, Thor and Bruce started getting passed around, hugs and handshakes galore.<span class=\"Apple-converted-space\"> </span></p>\n<p>“Midgardians, this is our sister in arms, Brunnhilde. She is a Valkyrie, one of the great warriors of the Valkyrior and my good friend.”</p>\n<p>“It’s a pleasure to meet you, Valykyrie. And amazing to see both of you, Thor, Banner. Come inside, we’ve a lot to catch you up on and I’m sure you do too.”</p>\n<p>“Yeah, we’ll come in, but first can we secure some more food and water? We’ve got a lot of people in the space ship.” Nodding, Tony motioned for some of the Agents around him to get to it.<span class=\"Apple-converted-space\"> </span></p>\n<p>“Sure, bud. What’s with the brigade?”</p>\n<p>Thor looked down, the loss of his homeland hitting him once more. “My sister Hela destroyed Asgard. We-We are refugees, asking Earth for sanctum.”</p>\n<p align=\"center\">****</p>\n<p>Finally inside, the Thor told the others of his Father’s death and how Hela had used his passing to try take back Asgard. He said of how he met Valkyrie and re-united with Bruce and then of how Hela had slaughtered countless people and eventually destroyed his home.<span class=\"Apple-converted-space\"> </span></p>\n<p>There was a silence when he had finished, everyone trying to come to terms with everything that had happened. <span class=\"Apple-converted-space\"> </span></p>\n<p>Finally, Tony spoke up. “Thor, we are really sorry about what’s happened. And we’re gonna do everything in our power to get you and your people refugee status here, <em>all</em> of us.”</p>\n<p>Tony glanced around, to receive a round of nodding. It might have been the first time since the pardoning that all the Avengers (Rogues and otherwise) were in agreement.</p>\n<p>“Thank you, Stark. Your generosity knows no bounds.” Thor raised the mug he held up as a toast.<span class=\"Apple-converted-space\"> </span></p>\n<p>“What about you, my friends? It has been years, you must have shared your own adventures together? For instance, who are the new members of your team?” Thor pointed to both Peter and May, who had drifted quietly off to the corner of the room.<span class=\"Apple-converted-space\"> </span></p>\n<p>The group paused, glancing at each other as though to ask who would break the news of the so-called Civil War to Thor. When none came forward, Tony jumped on the second question, which was slightly less uncomfortable.<span class=\"Apple-converted-space\"> </span></p>\n<p>“This-“ He stood up and reached around for Peter, dragging him reluctantly to the middle of the group. “-is my son, Peter. And his Aunt. Aunt May.”</p>\n<p>Bruce’s jaw dropped. His eyes flickering between Peter and Tony.<span class=\"Apple-converted-space\"> </span></p>\n<p>Inclining his head towards Thor, he whispered. “Exactly, <em>how long</em> were we gone for?”</p>\n<p>Tony laughed. “You were only gone two years, don’t worry, he’s just a fast grower, aren’t you Pete? Peter. Bruce. Bruce. Peter.” Motioning between them.</p>\n<p>“Dr Banner, it is an honour to meet you. I loved your work on stabilising quantum tunnels, it was fascinating.” Peter stuck his hand out, shaking Bruce’s excitedly, without breathing he turned to Thor. “Oh my God, Mr Thor, is that really Mjölnir? Does it really have the power to emit it’s own force field? I heard it is capable of controlling vortices and manipulating molecular expansion, is that true? Can it-?”</p>\n<p>“Woah woah, slow down there buddy, give the guy a chance to speak.”<span class=\"Apple-converted-space\"> </span></p>\n<p>Peter blushed, shuffling embarrassedly.<span class=\"Apple-converted-space\"> </span></p>\n<p>While Bruce leaned over to Tony and whispered, “He’s got your brains there, Tony.”</p>\n<p>Tony couldn’t help but whisper back proudly, “No, Bruce. He’s got a brain well beyond mine.”</p>\n<p>Thor grinned, clearly enjoying Peter’s enthusiasm. “You are welcome to hold it, Son of Stark, if indeed you are worthy.”<span class=\"Apple-converted-space\"> </span></p>\n<p>Everyone in the group laughed or grinned at the invitation. It was a reminder of better times, before the Civil War and before, even, Ultron. It was almost as though, with the arrival of Thor and Bruce, they were transported back to that evening of joking and drinking, everyone getting on with each other.<span class=\"Apple-converted-space\"> </span></p>\n<p>Peter gaped at Thor. “<em>Can I</em>?!”<span class=\"Apple-converted-space\"> </span></p>\n<p>He then turned to May and Tony, as though for permission.</p>\n<p>“I’m not stopping you, sweetie.”</p>\n<p>“Go for it kid, I’d love to be the father of a King.”</p>\n<p>Peter was practically vibrating with excitement. However, as he looked at the eager faces around him and back at the hammer, he was less and less sure he wanted to find out.</p>\n<p>“What you waiting for there, Pete?”</p>\n<p>“I-I- Maybe I shouldn’t. I don’t think I’m going to.”</p>\n<p>There was a chorus of ‘<em>noooo’s</em>’ and ‘<em>boos</em>’, when Peter noticed Natasha not joining in. Looking at her curiously, she shrugged. She said, in Russian, “<em>It was not a question I wanted answered either.”</em></p>\n<p>Peter nodded, but despite the encouragement around him, he declined to pick up the hammer.<span class=\"Apple-converted-space\"> </span></p>\n<p>Finally as the night wore on, Thor asked the question that they’d been avoiding since the start, “So. What else has happened since we’ve been gone?”</p>\n<p align=\"center\">****</p>\n<p>Peter had left not long after, not wanting to stay in the now uncomfortable and slightly tense atmosphere as they touched on the subject of their split.</p>\n<p><span class=\"Apple-converted-space\"> </span>So, instead, Peter had snuck out and gone on patrol.<span class=\"Apple-converted-space\"> </span></p>\n<p>Hours later, in the early hours of the morning, Peter crept back in as stealthily as possible. As he passed through the lounge area, where they had congregated that night, he caught a glimpse of Thor’s Mjölnir laying on the table.<span class=\"Apple-converted-space\"> </span></p>\n<p>He paused.<span class=\"Apple-converted-space\"> </span></p>\n<p>It couldn’t hurt for him to at least get a picture holding the handle, right? That would be fine, right? Come on, Ned would kill him if he had the chance and didn’t take it.</p>\n<p>Looking around and letting his spidey-sense roam, he knew the room was empty.<span class=\"Apple-converted-space\"> </span></p>\n<p>With that, Peter removed his mask. He wrestled his StarkPhone out of his pocket and leant it up against the nearby lamp.<span class=\"Apple-converted-space\"> </span></p>\n<p>Setting the timer to take a photo in 10 seconds, he rushed around to the handle. He placed his hands either side and as the counter beeped down he pulled.<span class=\"Apple-converted-space\"> </span></p>\n<p>However, instead of it staying still on the counter, as expected, the hammer <em>moved</em>.</p>\n<p>Mjölnir lifted with Peter’s arms. The force that Peter had lifted it with caused him to topple; having not shifted to account for balance.</p>\n<p>He looked towards his phone as he fell, the look of surprise on his face genuine as he held the Mjölnir in the air.<span class=\"Apple-converted-space\"> </span></p>\n<p>The flash went off.</p>\n<p>“Oh my God.”</p>\n<p>Peter lay on the floor. <em>What on Earth just happened?</em></p>\n<p>He lifted his head up off the floor and looked to his right hand which was wrapped around the handle of the hammer. <em>Did I just-?</em></p>\n<p>Peter looked around once more, no-one was in sight.<em> Should I tell someone? Would letting them know mean that they’d guess at his identity as Spider-Man? What about Tony? Would people look at him differently? Would Tony? Maybe... Maybe it’s something that no-one needs to know.<span class=\"Apple-converted-space\"> </span></em></p>\n<p>It’ll be something just for Peter. But still.</p>\n<p>“<em>Oh MY God.”</em></p>\n<p align=\"center\">****</p>\n<p>In the dark of his and Pepper’s room, Tony gawped at the StarkPad infront of him. <em>Did Peter just-?</em></p>\n<p class=\"p1\">\n<span class=\"s1\">Peter felt different, though he knew theoretically nothing had changed, nonetheless, he felt the difference as though it was a physical siren above him.</span>\n</p>\n<p class=\"p1\"><span class=\"s1\">He wouldn’t let it change anything; after all, who would believe that he, </span> <span class=\"s2\"><em>Peter Parker</em>, </span><span class=\"s1\">could hold Thor’s hammer? That he was <em>‘</em></span><em><span class=\"s2\">worthy’</span><span class=\"s1\">.</span></em></p>\n<p class=\"p1\"><span class=\"s1\">Peter couldn’t believe it himself, and he had </span> <em><span class=\"s2\">done</span></em> <span class=\"s1\"> it.</span></p>\n<p class=\"p1\"><span class=\"s1\">But it was fine, no-one else was there, he could keep it hidden and the only evidence he had of it was a photo saved on his StarkPhone and FRIDAY. He’d already begged FRIDAY not to show the clip to anyone, with the AI agreeing as long as Tony did not ask </span> <span class=\"s2\"><em>directly</em> </span> <span class=\"s1\">to see it.</span></p>\n<p class=\"p1\">\n<span class=\"s1\">So here Peter was, in the Tony’s and his family kitchen, trying to act as normal as possible, and distractedly pouring Cocopuffs into his cereal bowl.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">If Peter had been a little more observant, he might have noticed the way Tony was staring at him the entirety of breakfast, as though he knew something that Peter didn’t.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">“-ete? Pete?”</span>\n</p>\n<p class=\"p1\"><span class=\"s1\">Peter jerked, his mind snapping back to the kitchen around him and away from the scenario his mind was putting before him: a situation where he told the Avengers, told </span> <span class=\"s2\"><em>Tony</em>, </span><span class=\"s1\">about holding </span> <em><span class=\"s2\">Mjölnir </span></em> <span class=\"s1\">only for them to ask for a demonstration. Except when it came to showing them that he held it, the hammer didn’t move; the world would realise that it had made a mistake, that there was </span> <em><span class=\"s2\">no </span></em> <span class=\"s1\">way that he would have been worthy to hold the hammer.</span></p>\n<p class=\"p1\">\n<span class=\"s1\">He tuned back in to see Tony staring at him.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">“Wha-? Sorry, Dad... I was, er, just thinking about the new Lego set Ned got. You know, just got a bit distracted.”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">“Yeah, sure, Pete.” Tony nodded quickly, easing Peter’s concern. “It just seems like there’s something else on your mind... is there anything you want to tell me?”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">Peter broke his gaze from Tony’s face guiltily, not seeing the hopeful look on his face. “Uh, no. Not really. Just normal school stuff and, you know, Spider-Man stuff.”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">With his eyes focussed firmly on the cereal bowl in front of him, he failed to noticed the hopeful look fall from his father’s face. “Oh, okay kiddo.”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">Wanting a quick escape, Peter wolfed down the rest of his cereal. He leapt from him seat, speaking round the Cocopuffs in him mouth. “Y’know I might just head in now, get to school early.<span class=\"Apple-converted-space\">  </span>Maybe do my homework.”</span>\n</p>\n<p class=\"p1\"><span class=\"s1\">“You haven’t done your </span> <em><span class=\"s2\">homework?</span><span class=\"s1\">!”</span></em></p>\n<p class=\"p1\">\n<span class=\"s1\">Peter sped up, laughing as he did.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">“You can’t do that to me, Pete! Your aunt will kill me!”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">When asked later by Rhodey why he was working to improve the shielding on his iron suit, he blamed Peter.</span>\n</p>\n<p class=\"p3\" align=\"center\">\n<span class=\"s1\">****</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">Having left as early as he did, he managed to get to school with an hour to spare, and ended up using the time to complete his previously abandoned work.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">By the time Ned arrived, he’d even began drawing up design for potential improvements to his Spider-suit. He hoped Tony would approve of them. It had been such a long morning that he’d almost managed to forget his agitation from the morning and what caused it.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">However, Ned managed to remind him the moment he sat down.</span>\n</p>\n<p class=\"p1\"><span class=\"s1\">“Peter, Peter, Peter. I can’t believe you met a god yesterday. A literal </span> <span class=\"s2\">god.</span> <span class=\"s1\"> Was he as good looking in person? Did you see it? You know, his magic hammer?! Did you get to-”</span></p>\n<p class=\"p1\">\n<span class=\"s1\">“Ned, woah. Slow down, man.”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">Peter made a placating gesture with his hands. His face flushed lightly from Ned’s words; unable to prevent his teenage mind making them more euphemistic than necessary.</span>\n</p>\n<p class=\"p1\"><span class=\"s1\">“C’mon, you can’t send me texts and photos of you meeting Thor </span> <em><span class=\"s2\">and</span></em> <span class=\"s1\"> Dr Banner and not expect me to freak! This is one of the coolest things to ever happen to us!”</span></p>\n<p class=\"p1\"><span class=\"s1\">Any rationale Peter had about telling Ned and him being calm and clear headed about the whole </span> <span class=\"s2\"><em>‘I held Mjölnir’</em> </span> <span class=\"s1\">thing shrivelled up and died in that moment. Nevertheless, Ned was his ‘Guy in the Chair’, he had to tell him.</span></p>\n<p class=\"p1\">\n<span class=\"s1\">“Can I tell you something and you promise not to freak out?”</span>\n</p>\n<p class=\"p1\"><span class=\"s1\">“Is this something related to... </span> <em><span class=\"s2\">your Dad</span></em><span class=\"s1\"><em>?</em> ‘Cos if it’s anything on that level I can’t promise anything.”</span></p>\n<p class=\"p1\"><span class=\"s1\">“</span> <span class=\"s2\"><em>Ned</em>, </span> <span class=\"s1\">I’m being serious.”</span></p>\n<p class=\"p1\"><span class=\"s1\">“Fine, </span> <span class=\"s2\">okay</span><span class=\"s1\">. I promise.”</span></p>\n<p class=\"p1\"><span class=\"s1\">“I need to show you something, just-just don’t </span> <span class=\"s2\">scream, </span><span class=\"s1\">alright?” He reached into his hoodie, pulling out his StarkPhone reluctantly.</span></p>\n<p class=\"p1\"><span class=\"s1\">“Pffft. I </span> <em><span class=\"s2\">won’t. </span></em><span class=\"s1\">I’m your ‘Guy in the Chair’, whatever you’ve got to show me won’t faze m-</span><em><span class=\"s2\">HOLY SHIT!“</span></em></p>\n<p class=\"p1\"><span class=\"s1\">Instinctually, Peter slapped his hands over Ned’s mouth in an attempt to muffle his reaction. However, they still manage to garner a </span> <span class=\"s2\">lot</span> <span class=\"s1\"> of attention. Pulling Peter’s hand away from his face, Ned cringed minutely. “</span><span class=\"s2\">Sorry, </span><span class=\"s1\">but </span> <em><span class=\"s2\">oh my god.</span></em> <span class=\"s1\"> You’re </span> <em><span class=\"s2\">literally</span></em> <span class=\"s1\"> holding Thor’s hammer. Thor’s </span> <span class=\"s2\"><em>magic hammer.</em> </span><span class=\"s1\">Don’t you, like, get to rule Asgard now that you are worthy?”</span></p>\n<p class=\"p1\"><span class=\"s1\">Peter felt his stomach plummet a little, remembering the news that Thor had told them about his homeland. “I didn’t mention it over text, but... there </span> <span class=\"s2\">is</span> <span class=\"s1\"> no Asgard anymore.”</span></p>\n<p class=\"p2\"><em><span class=\"s1\">“</span><span class=\"s2\">What?!” </span></em> <span class=\"s1\">Ned whispered, his jaw dropping in horror.  “What are you talking about?!”</span></p>\n<p class=\"p1\">\n<span class=\"s1\">“Thor said it was destroyed by his sister, Hela. And now he’s come with all the Asgardians who survived to Earth for refuge. When he said destroyed, I think he meant it... I think even Loki came with him for safety but I’ve not actually seen him around. And Thor, he lost one of his eyes and everything.”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">“That’s messed up, man.”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">Not knowing what else to say in response, Peter could only agree. “Yeah, it really is.”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">Thinking his morning over, Peter wondered if maybe he should have led with that news and then finished with the photo of him holding Mjölnir, at least then they would have gone into first period feeling a little more upbeat. Instead, he and Ned trudged into Biology with the knowledge of the loss of an entire civilisation weighing on them.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">Shockingly, it did not make for a good studying environment. </span>\n</p>\n<p class=\"p2\" align=\"center\">****</p>\n<p class=\"p2\">By lunch time, both he and Ned had been jolted slightly out of their macabre attitudes, mainly due to MJ had spending the entire period before throwing sketches of themselves brooding onto their desks. Peter appreciated this was MJ’s version of concern and support, he felt touched.</p>\n<p class=\"p1\">\n<span class=\"s1\">Unfortunately, it was also lunchtime when Peter saw the news.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">He had put his phone on airplane mode as he did every time he had class; he’d found it difficult to focus otherwise, as he often received a slew of spam messages when Tony got bored in meetings, ones that regularly included gifs of unusual animal friendships. Tony knew him too well.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">Switching airplane mode off, Peter found at least a dozen notifications from various news apps he was subscribed to. All of which were alerting him to a confrontation between the Avengers and a previously unknown supervillain contingent.</span>\n</p>\n<p class=\"p1\"><span class=\"s1\">The article explicitly said </span> <span class=\"s2\"><em>all</em></span> <span class=\"s1\"> the Avengers were there. Knowing the Avengers and the Rogues like he did, the only way </span> <em><span class=\"s2\">both</span></em> <span class=\"s1\"> groups would be there together was if it was a full scale invasion or if the attack location was full of vulnerable civilians.</span></p>\n<p class=\"p1\">\n<span class=\"s1\">His heart skipped a beat.</span>\n</p>\n<p class=\"p1\"><em><span class=\"s2\">Shit. </span></em> <span class=\"s1\">He needed to go. He needed to go </span> <em><span class=\"s2\">now.</span></em></p>\n<p class=\"p1\">\n<span class=\"s1\">“Ned, Ned,” He gesticulated vaguely in his friend’s direction,<span class=\"Apple-converted-space\">  </span>motioning towards his phone screen as he did. “I gotta go.”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">Ned’s eyes scanned the screen quickly and without pausing to consider, he responded frantically. “Go, Go! I’ll cover for you with Mr Harris!”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">Ned really was the best friend he could ask for.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">Without a second look back, Peter leapt up and scrambled out of the backdoor of the cafeteria.</span>\n</p>\n<p class=\"p1\"><em><span class=\"s2\">Aunt May will understand</span></em><span class=\"s1\"><em>,</em> he thought, fully aware that May wouldn’t understand him skipping school unless the world </span> <em><span class=\"s2\">truly </span></em> <span class=\"s1\">ended and faded into dust before them.</span></p>\n<p class=\"p1\">\n<em> <span class=\"s2\">Too late now.</span> </em>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">He swung through the dizzying heights of New York, heading downtown to the last reported attack location.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">In the distance Peter could make out a crowd of fleeing citizens. After the attack of New York, there were regular evacuation tests in operation with higher congested areas prone to more regular tests. He supposed they should be grateful for those now, when seeing them successfully in effect.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">Following the direction the civilians were coming from, he finally reached the heart of the battle.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">While it wasn’t on par with the attack of New York in terms of scale, the group of superhuman villains were certainly nothing to laugh about, especially considering the heavy civilian casualties he could already see around them.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">Instantly, Peter joined the fray.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">He shot webs over the corner of an alleyway, catching debris that would’ve landed on two cowering, scared teenagers.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">“Spider-Man!”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">“Where you been, spandex?”</span>\n</p>\n<p class=\"p1\"><span class=\"s1\">“Kid,</span> <em><span class=\"s2\"> what are you doing here</span><span class=\"s1\">?!”</span></em></p>\n<p class=\"p1\"><span class=\"s1\">The last one came from Tony directly. The man shouted from across the battlefield, unable to pause and look round at his son. “Don’t you have </span> <em><span class=\"s2\">that thing</span> </em><span class=\"s1\"> you should be at right now?!”</span></p>\n<p class=\"p1\"><span class=\"s1\">With Tony unable to directly scold him for skipping school, Peter couldn’t help but send a cheeky winky to his father, retorting, “Nope. I had nothing on, Mr Stark. I was </span> <em><span class=\"s2\">completely</span></em> <span class=\"s1\"> free today, </span> <em><span class=\"s2\">all day.”</span></em></p>\n<p class=\"p1\">\n<em> <span class=\"s1\">“You little-!”</span> </em>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">“On your left, Mr Stark!”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">Peter ducked a projectile that whizzed past Tony’s right shoulder.</span>\n</p>\n<p class=\"p2\">“That’s the Cap’s line!” Abandoning his ineffectual attempt at parenting Peter for another time, Tony refocused on the fight before them. Peter similarly weaved through the chaos, dispatching the enemy below when he could.</p>\n<p class=\"p1\">\n<span class=\"s1\">Taking stock, the teenager landed on a nearby roof beside the God of Thunder, marvelling slightly at the lightening pulsating around him. “Hi, Mr Thor. Nice to finally meet you! Do you need some help at all?”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">“I do not need help, Young Tonysson.”</span>\n</p>\n<p class=\"p2\"><span class=\"s1\">“What did you just call me?!” Peter definitely did </span> <em><span class=\"s2\">not</span></em> <span class=\"s1\"> squeak.</span></p>\n<p class=\"p2\">“Tonysson.” The God glanced over, frowning confusedly. “Your father introduced us yesterday.”</p>\n<p class=\"p2\"><span class=\"s1\">If his heart wasn’t already racing from the fighting and adrenaline, it would have spiked in horror. Peter knew for a fact that he had been introduced to Thor as ‘Peter’, </span> <em><span class=\"s2\">not </span></em> <span class=\"s1\">Spider-Man, which meant </span><em> <span class=\"s2\">Thor knew.</span></em></p>\n<p class=\"p1\">\n<span class=\"s1\">Anxiously, Peter glanced around checking that no one else had heard Thor’s loud proclamation. Seeing the other Avengers otherwise occupied, Peter managed to splutter unconvincingly, “N-No, we haven’t met. You-you must be mistaken, Mr Thor. I-I gotta go!”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">Not waiting for Thor’s reaction, Peter threw himself bodily off the edge of the building and pounded on his next target.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">Finally, after another ten minutes of intense fighting, the battle died down, with only a couple stragglers groaning on the ground around them.</span>\n</p>\n<p class=\"p1\"><span class=\"s1\">He could breathe again.</span> <em><span class=\"s2\"> Everyone was okay.</span></em></p>\n<p class=\"p1\"><span class=\"s1\">No sooner than he thought that, Peter hear the dull </span> <em><span class=\"s2\">ping </span></em> <span class=\"s1\">of a bullet followed by a surprised cry that he knew all too well.</span></p>\n<p class=\"p1\">\n<span class=\"s1\">He turned around in time to see his father hit the floor with a solid <em>clang</em>.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">“Tony!”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">“Stark!”</span>\n</p>\n<p class=\"p1\">\n<em> <span class=\"s1\">“</span><span class=\"s2\">Dad</span><span class=\"s1\">!”</span> </em>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">Peter tripped over debris in his haste to reach Tony taking no notice of the shocked silence around him, instead reaching to remove Tony’s body plates.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">“Friday, is he okay? What should I do? Karen, how do I stop the bleeding?!”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">“Kid-“, Tony’s voice was weak with pain. His face, visible only between the cracks of the Iron Man armour, started to go lax. “I’m fine, really I’m-“</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">Peter hands shook, he pressed down but the blood oozing from his father’s stomach wasn’t stopping. Memories of the last time he tried to stem the bleeding of someone he loved flashed before his eyes. Tony’s face morphing with his Uncle Ben’s.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">He couldn’t breathe.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">He didn’t know how long had passed but he felt hands on his shoulders, leading him away, and voices flowing over him.</span>\n</p>\n<p class=\"p1\"><span class=\"s1\">No. </span> <span class=\"s2\"><em>No.</em></span><span class=\"s1\"><em> </em>He couldn’t do it. </span> <em><span class=\"s2\">Not again</span><span class=\"s1\">.</span></em></p>\n<p class=\"p1\"><span class=\"s1\">Maybe he was cursed. Everyone he loved seemed to die. First his biological parents. Then Uncle Ben. And </span> <span class=\"s2\"><em>now.</em></span></p>\n<p class=\"p1\">\n<span class=\"s1\">“-reathe with me. In and out. Like this.”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">He couldn’t see anything in front of him. Blurry images overlapping each other.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">“It’s me, kid. It’s Uncle Rhodey.” He could hear the words but was no closer to comprehending them. “Tony’s fine, the Doctors are looking after him now. He’ll be fine. Peter, your Dad’s okay.”</span>\n</p>\n<p class=\"p1\"><span class=\"s1\">The last words were no more than a whisper but Peter could finally hear them. Tony, </span> <em><span class=\"s2\">his Dad</span></em><span class=\"s1\"><em>,</em> would be okay.</span></p>\n<p class=\"p1\">\n<span class=\"s1\">“U-Uncle Rhodey?”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">“Hey, yeah, that’s me.”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">The world finally came back in to focus and Peter was shocked to discover he was back at the compound, with a blanket wrapped securely around his shoulders.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">“Tony, where is he? Is he okay?”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">Peter tried to stand but was pushed firmly back down by Rhodey. “Oh no, you don’t. Tony’s fine. The bullet’s been removed and they’re just stitching him up now. It didn’t nick anything important.”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">He breathed a sigh of relief and instantly felt the rush of adrenaline and shock leave him. He felt drowsy. “Unc’e Rh’dey?”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">“It’s okay, I got you. You go to sleep, it’s okay.”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">And darkness took him.</span>\n</p>\n<p class=\"p3\" align=\"center\">\n<span class=\"s1\">****</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">He opened one eye groggily, only to wince at the lights.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">He groaned.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">His stomach hurt, almost like... like he’d been shot.</span>\n</p>\n<p class=\"p2\">Instantly, Tony sat up. Pain seared down his sides and a headache flared from the bright lights, but he ignored it.</p>\n<p class=\"p1\">\n<span class=\"s1\">“Tony!”</span>\n</p>\n<p class=\"p2\">“Rhodey! Is everyone okay?!” He glanced around, looking for the one person he needed to see. “Peter, is he okay? Where is he?”</p>\n<p class=\"p2\">“Peter’s fine, Tony, relax. You were the one that was shot.”</p>\n<p class=\"p2\">He leaned back into the medical bay pillows, making a mental note to get better pillows brought in for next time he ended up here. “Shot?” The pain in his stomach throbbed. “Yeah, that sounds about right.”</p>\n<p class=\"p2\"><span class=\"s1\">“Peter’s in his room, asleep. He panicked when you were shot, started freaking out. I think he had a flashback of some sort-“, Tony didn’t have to think why; he remembered reading about Ben’s death when he first found Peter, it had said that his teenage nephew had been there when he was shot and seen it all happen. </span> <span class=\"s2\"><em>I’m sorry, kid.</em></span></p>\n<p class=\"p1\">\n<span class=\"s1\">“He, uh, he called you Dad. Y’know, in front of all the Rogues.”</span>\n</p>\n<p class=\"p2\">\n<em> <span class=\"s2\">Fuck</span><span class=\"s1\">.</span> </em>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">“Fuck.”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">“Yeah.” Rhodey’s face was as apprehensive as his own, “They have some questions.”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">“Well, it’s none of their damn business. Tell them that.”</span>\n</p>\n<p class=\"p2\"><em> <span class=\"s1\">“</span><span class=\"s2\">I already did.</span> </em> <span class=\"s1\"><em>” </em>Rhodey’s voice heavily implied his opinion on the Rogues. “But they still want answers.”</span></p>\n<p class=\"p1\"><span class=\"s1\">Tony sighed. </span> <span class=\"s2\"><em>Of course they did.</em> </span> <span class=\"s1\">He wished, just this once, that they would let it go. </span>“Fine. Send them in.”</p>\n<p class=\"p1\">\n<span class=\"s1\">“You don’t have to do that. As you said, it’s none of their business.”</span>\n</p>\n<p class=\"p1\"><span class=\"s1\">“Well, I can’t have them just walking round without talking to them. What if one of them says something to someone about Peter... or </span> <span class=\"s2\"><em>worse,</em></span><span class=\"s1\"><em> </em>tries to </span> <span class=\"s2\"><em>ask Peter</em> </span> <span class=\"s1\">about it. </span> <span class=\"s2\"><em>No</em></span><span class=\"s1\"><em>.</em> He’s my son, I’ll answer their questions so he doesn’t have to.”</span></p>\n<p class=\"p1\">\n<span class=\"s1\">Rhodey nodded, reluctantly, but went to fetch the Rogues anyway.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">Tony grimaced in pain. <em>Why did this conversation have to happen when he still had a fresh bullet wound?</em></span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">The Rouges and other Avengers filtered in, one by one, the silence heavy around them until Natsha saw fit to break it.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">“I’m glad you’re not dead, Stark.”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">Tony huffed a laugh. “Thanks, Romanov. I appreciate it.”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">There was another awkward beat of silence, in which time Tony grudgingly looked at Steve. He felt anger curl within him at the disapproving stare. He blamed the painkillers for what he said next. “Fuck you, Rogers.”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">“Wha-?”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">Steve looked startled at his verminous outburst.</span>\n</p>\n<p class=\"p1\"><span class=\"s1\">“I said, </span> <span class=\"s2\"><em>fuck you, Rogers.”</em> </span><span class=\"s1\">He elongated the words, as though talking to a child. “Don’t give me that look, like your all ‘holier-than-thou’. You recruited a recovering soldier with PTSD-“, he pointed vaguely in Sam’s direction, “-and a </span> <span class=\"s2\"><em>literal</em> </span> <span class=\"s1\">war criminal.” He made another motion towards Bucky.</span></p>\n<p class=\"p2\"><span class=\"s1\">“You recruited a child, Tony.<em> A </em></span> <em> <span class=\"s2\">child.</span><span class=\"s1\">”</span></em></p>\n<p class=\"p1\">\n<span class=\"s1\">“You don’t even know anything about the situation and haven’t even asked me about it and yet you’re already criticising me.”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">“It was two years ago, Tony, he would’ve been fourte-“</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">“You think I don’t know that?!”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">“Then why did you bring him? Were you really that desperate that you’d risk the life of a-?!”</span>\n</p>\n<p class=\"p1\"><em> <span class=\"s1\">“</span><span class=\"s2\">Stop it!</span></em> <span class=\"s1\"><em>”</em> The shouting match was interrupted by Natasha, she stood in the corner of the room, her voice barely raised but cutting through the argument like a knife. “Didn’t we learn anything from last week, about making assumptions about things?!”</span></p>\n<p class=\"p1\"><span class=\"s1\">She glared at Steve, her eyes scanning the others - Sam, Bucky, Clint and Wanda - as she did. “Tony’s not the bad guy he’s always painted out to be.” Tony felt tears prickle in his eyes, more grateful than ever to have someone other than Rhodey on his side. “He’s not like </span> <span class=\"s2\"><em>Hydra</em></span> <span class=\"s1\"> or the people from the Red Room. He’s not churning out </span> <span class=\"s2\"><em>child soldiers</em></span><span class=\"s1\"><em>.</em> If he was, </span> <span class=\"s2\"><em>trust me,</em> </span><span class=\"s1\">I’d have something to say about it. So why don’t we try not assuming anything and just listen to what he has to say?!”</span></p>\n<p class=\"p1\">\n<span class=\"s1\">Natasha turned to him expectantly, ignoring the stunned expressions of her peers.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">“Thanks, Natasha.”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">The assassin just nodded back at him before perching herself on the edge of his bed.</span>\n</p>\n<p class=\"p1\"><span class=\"s1\">Taking a deep breath, Tony started speaking, his voice bitter. “Look, I know he’s a child, okay. I mean, for God’s sake, he’s </span> <em><span class=\"s2\">my</span></em> <span class=\"s1\"> child.” He unconsciously found himself seeking out Clint, the only other parent in the room, silently begging him to understand. He didn’t need the Rogues’ forgivenesses, it wasn’t their place to forgive him for anything and yet he couldn’t help but want them to understand.</span></p>\n<p class=\"p1\">\n<span class=\"s1\">“Peter, he was already out there fighting. If I didn’t help him, give him the suit for protection and teach him how to do it safely, he would have gone out there anyway. Except he would have gone there without me or even Karen to keep an eye on him. And that, that would have been on my conscience.”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">Clint, on the other side of the room, dipped his head in acknowledgement. It wasn’t much, but Tony appreciated the gesture.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">Beside him, Steve’s face remained unmoving. “You brought him to a <em>war zone</em>, Tony.”</span>\n</p>\n<p class=\"p1\"><span class=\"s1\">“I’m fully aware of that, Rogers. I </span> <span class=\"s2\"><em>know</em></span> <span class=\"s1\"> it was dangerous. I never said I was the perfect father. I know we mightn’t have been friends towards the end there, but I also didn’t honestly expect anyone to try and actually kill each other.“</span></p>\n<p class=\"p1\">\n<span class=\"s1\">The Captain’s eyes locked onto his and he saw regret and understanding pass through them. A moment passed. A moment where he knew they both remembered how he drove his fist into Tony’s face.<span class=\"Apple-converted-space\"> How his </span>shield pushed ruthlessly into Tony’s Arc Reactor. They both remembered Steve leaving him for dead in the wastelands of Siberia.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">“I’m sorry, I didn’t mean-“</span>\n</p>\n<p class=\"p1\"><span class=\"s1\">“So you keep saying.” Tony bit out. “Maybe you don’t agree with my choices, maybe I don’t agree with them anymore either. I know I’ve made mistakes, been stupid. But Peter is </span> <span class=\"s2\"><em>my</em></span> <span class=\"s1\"> kid, May and I are his parents and we know what’s best for him.”</span></p>\n<p class=\"p1\">\n<span class=\"s1\">“If you don’t regret anything, why’d you keep Peter’s identity a secret?”</span>\n</p>\n<p class=\"p2\"><span class=\"s1\">He laughed derisively. “After how you’ve all behaved this last week, you’re </span> <span class=\"s2\"><em>really</em></span> <span class=\"s1\"> asking me that?”</span></p>\n<p class=\"p1\"><span class=\"s1\">He turned away from them, wearily pressing his face into the pillows. They were suddenly a lot more comfortable than he remembered them being. </span>“I’d like you all to leave.”</p>\n<p class=\"p2\">Not needing Tony to ask again, Rhodey immediately started to push them towards the door. Natasha was the first to leave the room, clearly trying to honour his request for rest and set the example. Bucky and Sam followed suit, trailing after Steve.</p>\n<p class=\"p1\">\n<span class=\"s1\">Clint hesitated on his way towards the door. “I didn’t agree with them asking you questions, you know. I know how hard it is to raise kids, especially with everyone second guessing your choices. I just wanted you to know that.”</span>\n</p>\n<p class=\"p2\">The archer turned without waiting for a response. Just before he reached the door, Tony called out to him. “Thanks, Clint. By the way, I made some calls last week. I couldn’t get you extended supervised leave but I made an agreement with Laura. She said the kids could come here for a full weekend every once in a while, instead of just for a few hours.”</p>\n<p class=\"p1\">\n<span class=\"s1\">“Wha-? You’re serious.” A look of shock mixed with extreme gratitude passed over Clint’s face. “Even after all this?”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">Tony stared back at him seriously seriously, Peter’s face swimming in the back of his mind. “Yeah,” He said softly. “Even after all this.”</span>\n</p>\n<p class=\"p3\" align=\"center\">\n<span class=\"s1\">****</span>\n</p>\n<p class=\"p1\"><span class=\"s1\">In the couple of days since the altercation in downtown New York, Peter had seen very little of the Rogues around, only spotting them briefly on his way to and from the shower. The awkward glances at him were enough to confirm that they </span> <span class=\"s2\"><em>definitely</em> </span> <span class=\"s1\">had heard him call Tony</span><em> <span class=\"s2\"> ‘Dad’ </span></em> <span class=\"s1\">while still in his Spider-Man outfit.</span></p>\n<p class=\"p1\">\n<span class=\"s1\">When he brought it up with his Dad, Tony had just told him that he’d already spoken to them and none of them would cause trouble or bother him about it.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">Out of all of them only Natasha was acting normal, further lending itself to his belief that she’d already figured it out and just not bothered to tell anyone. Natasha had neither confirmed nor denied it when he’d asked which only made him admire her more.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">Peter had managed to convince May to let him stay home from school for the rest of the week - though he’d had plenty of grovelling to do for skipping school in the first place - and he had spent most of that time at Tony’s bedside.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">The teenager had only left to get a shower and use the rest room; such was his dedication, Tony had even had his staff install a second bed in the room for Peter to sleep in.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">Tony would have found the incessant hovering irritating in anyone else, but with Peter he found it adorable. Thankfully though, for everyone’s sake, Tony was permitted to leave the Medical Bay today which meant Peter’s babysitting could come to an end.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">Unfortunately, this occasion seemed to have encouraged the Avengers to gather in the shared living quarters of the compound to welcome him back.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">Tony privately wished they would have left the welcoming to just Pepper, Rhodey, Happy, May and Peter.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">“Pete, it’s fine, I can walk to the couch by myself!”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">“I know - I just don’t want you straining yourself.” Peter rounded the corner, purposefully ignoring the crowd around them. “Here, I’ll clear the couch for you to sit on.”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">Absentmindedly, Peter rushed over to the couch not paying attention to the items he found there and picked it all up.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">He heard several gasps, but paying them no heed, he placed the miscellaneous items on the table before him and turned intent on helping his father the rest of the way.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">He was brought to a halt by the gobsmacked looks on the entire rooms faces.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">“Did he just-?!”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">“Peter, that was-!”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">“Oh my-“</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">“Holy shit!”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">Peter looked confusedly towards his father, uncertain what the cause of the outbursts were. Tony, in comparison to the other expressions surrounding him, only looked smug.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">“What are they upset about?”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">“Why don’t you look behind you.”</span>\n</p>\n<p class=\"p2\">Peter rotated on the spot, slowly.</p>\n<p class=\"p1\">\n<span class=\"s1\">“I don’t-“ He stopped, finally spotting the offending item resting innocuously on the table where he put it.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s2\"> <em>Mjölnir.</em> </span>\n</p>\n<p class=\"p1\"><span class=\"s1\">Oh. He glanced back at the Avengers freaking out around him. </span> <em><span class=\"s2\">Oh</span><span class=\"s1\">.</span></em></p>\n<p class=\"p1\">\n<span class=\"s1\">“Will you believe me if I say it’s not what it looks like?”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">Tony grinned.</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">He hobbled over to Peter and wrapped his arm round his shoulders. “I told you all, I’m the father of a King.”</span>\n</p>\n<p class=\"p1\">\n<span class=\"s1\">Peter looked over at Tony in response and beamed. </span>\n</p>"
}