{
  "id": "21526240",
  "url": "https://archiveofourown.org/works/21526240?view_full_work=true",
  "author": [
    "Haicrescendo"
  ],
  "title": "The Good Vanilla",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Avatar: The Last Airbender"
  ],
  "relationships": [
    "Sokka/Zuko (Avatar)"
  ],
  "characters": [
    "Sokka (Avatar)",
    "Zuko (Avatar)"
  ],
  "additional_tags": [
    "this is soft garbage",
    "no room for pain here",
    "try somewhere else",
    "well maybe a little pain because it ain’t a zuko fic without it",
    "Assassination attempts",
    "something tastes like poison",
    "playing the long game without realizing that you’re playing the long game",
    "Showing Love through Food",
    "Fire Lord Zuko",
    "the sweetest and softest fire lord in current history",
    "Ambassador Sokka",
    "who’s just here for the food and great bed",
    "also to make the world a better place",
    "terrible awful flirting",
    "like zuko is so so so bad at it",
    "but it’s fine",
    "he doesn’t even consider that it could ever go anywhere anyway",
    "surprise"
  ],
  "language": "English",
  "series": "",
  "published": "2019-11-22",
  "completed": null,
  "words": "5,620",
  "chapters": "1/1",
  "comments": "570",
  "kudos": "26,681",
  "bookmarks": "4,853",
  "hits": "152,023",
  "summary": "<p>Sokka’s beautiful friendship with Zuko doesn’t start with breaking Dad out of jail. That’s just what he tells people.</p>\n<p>Sokka’s beautiful friendship with Zuko started the day he realizes that he knows how to cook.</p>\n<p>Feat. breakup cake, an attempted assassination, and eating out of the pan like dirty heathens.</p>",
  "notes": "<p>This is possibly the fluffiest thing I’ve written in my current AO3 history. I regret nothing.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>",
  "text": "<p> </p>\n<p>\n<span>There’s a smell in the Western Air Temple.</span>\n</p>\n<p> </p>\n<p>\n<span>Not a fart smell, though (thanks, </span>\n<em>\n<span>Aang</span>\n</em>\n<span>), a </span>\n<em>\n<span>good</span>\n</em>\n<span> smell, like if Katara knew how to cook anything other than rehydrated jerky and whatever Sokka manages to catch, with rice, with whatever vegetables they may or may not have. Sokka knows better than to complain about it, because that’s a great way to not eat, but still.</span>\n</p>\n<p> </p>\n<p>\n<span>Jerky on rice nights makes him miss Ba Sing Se.</span>\n</p>\n<p> </p>\n<p>\n<span>The place was a shitstorm in its own right, but spirits, Sokka misses being able to get almost any kind of noodle under the sun, and fresh meat that he didn’t have to hunt for himself, not cooked by his sister.</span>\n</p>\n<p> </p>\n<p>\n<span>Who, he will emphasize, does </span>\n<em>\n<span>the very best that she can</span>\n</em>\n<span> (you hear that, Katara? Your favorite brother is not ungrateful!), but just doesn’t have the means or the experience of the fancypants, Earth Kingdom noodle-makers. That’s just how it is!</span>\n</p>\n<p> </p>\n<p>\n<span>But Sokka’s smelling something </span>\n<em>\n<span>amazing</span>\n</em>\n<span> that definitely isn’t Katara’s cooking.</span>\n</p>\n<p> </p>\n<p>\n<span>Idly, Sokka wonders where Zuko’s at.</span>\n</p>\n<p> </p>\n<p>\n<span>The dude’s practically a ghost, and that’s fine with him. After chasing them all over the world for months, Sokka never wanted to see him again, but here he is. And he wants to teach Aang firebending? </span>\n</p>\n<p> </p>\n<p>\n<span>Please.</span>\n</p>\n<p> </p>\n<p>\n<span>Like any of them are gonna fall for </span>\n<em>\n<span>that</span>\n</em>\n<span>.</span>\n</p>\n<p> </p>\n<p>\n<span>“Yo, Aang, are you holding out on me?” He calls, “Something smells </span>\n<em>\n<span>awesome.</span>\n</em>\n<span>”</span>\n</p>\n<p> </p>\n<p>\n<span>“...</span>\n<em>\n<span>What</span>\n</em>\n<span>?”</span>\n</p>\n<p> </p>\n<p>\n<span>...That ain’t Aang.</span>\n</p>\n<p> </p>\n<p>\n<span>Sokka pokes his head into the room the voice came from and stops dead.</span>\n</p>\n<p> </p>\n<p>\n<span>There, sitting at a tiny campfire, is the prince of the Fire Nation himself. Former prince? Is that technically correct? Sokka doesn’t know.</span>\n</p>\n<p> </p>\n<p>\n<span>Said prince of the Fire Nation is sitting cross legged in front of his tiny fire, looking very much like a kangaroo-deer in front of a lantern. There’s a banged up little frying pan in the fire, too, and whatever Zuko’s pushing around in there smells </span>\n<em>\n<span>so good</span>\n</em>\n<span>. There’s a big, flat leaf sitting next to him and on that leaf are some piled up vegetables, some spices, and…</span>\n</p>\n<p> </p>\n<p>\n<span>“Holy shit, </span>\n<em>\n<span>meat</span>\n</em>\n<span>.”</span>\n</p>\n<p> </p>\n<p>\n<span>Not fish either, but some unidentifiable red meat that’s already been cut up and cleaned, and—</span>\n</p>\n<p> </p>\n<p>\n<span>Sokka wipes his mouth abruptly and closes it. Scowls.</span>\n</p>\n<p> </p>\n<p>\n<span>“I mean...uh…”</span>\n</p>\n<p> </p>\n<p>\n<span>Zuko raises the only eyebrow he’s got (and wow, that’s gotta suck), and the edges of his lips tilt up in a very awkward smile, like he’s not sure he’s doing it right. Weirdo. </span>\n</p>\n<p> </p>\n<p>\n<span>“You could just come in,” he points out and beckons inward with a hand. Sokka doesn’t move. “...Or you could stand there like a weirdo?”</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Who’s a weirdo?!</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Sokka does come in, though, tentatively at first, and then with more confidence when it’s clear that Zuko’s more focused on what’s going on in his pan than Sokka’s malfunction.</span>\n</p>\n<p> </p>\n<p>\n<span>“You can cook?” he finally asks. </span>\n</p>\n<p> </p>\n<p>\n<span>Zuko shrugs.</span>\n</p>\n<p> </p>\n<p>\n<span>“I lived on a ship for three years, and Uncle thought I needed distractions.” To be fair, he definitely needed distractions, but cooking lessons had only worked so well. “And then, once, Uncle tried to brew tea from a poisonous flower and almost died. So…you know.” Zuko shrugs again. “And it’s cheaper.”</span>\n</p>\n<p> </p>\n<p>\n<span>Sokka remembers how much the Upper Ring Ba Sing Se noodles had cost, and that was on their VIP stipend, and sees Zuko’s logic.</span>\n</p>\n<p> </p>\n<p>\n<span>They fall into a silence that should be </span>\n<em>\n<span>way </span>\n</em>\n<span>more awkward than it is, and Zuko goes back to what he’s doing.</span>\n</p>\n<p> </p>\n<p>\n<span>It’s too bad that Sokka is not meant for silence.</span>\n</p>\n<p> </p>\n<p>\n<span>“What are you making?” he asks eventually.</span>\n</p>\n<p> </p>\n<p>\n<span>“Just some potato-chokes with onion-snips, and the squirrel-possum.” It’s not a classy meat but Zuko’s not exactly classy anymore, is he? And it beats fucking </span>\n<em>\n<span>fishing</span>\n</em>\n<span>. In go the rest of the veg and meat and a healthy spoonful of chili-grass-garlic paste, with a slightly smushed, about-to-go-bad tomato, which he proceeds to squish further with the spoon. “Here, if you’re going to talk, you should be useful. Stir.”</span>\n</p>\n<p> </p>\n<p>\n<span>He thrusts the spoon at Sokka to keep the food moving and rummages around in a bag, eventually fishing out a package of flour. Another large leaf goes down, and zuko pours out a few handfuls of flour onto it, eyeballs a sprinkle of salt and some water and oil into the mix, and starts kneading.</span>\n</p>\n<p> </p>\n<p>\n<span>Bread, too?</span>\n</p>\n<p> </p>\n<p>\n<span>“I don’t know what you think you’re gonna do with that, we don’t have an oven—“</span>\n</p>\n<p> </p>\n<p>\n<span>Zuko just gives him an exasperated but weirdly tolerant </span>\n<em>\n<span>look</span>\n</em>\n<span>. He works his dough, splits it into pieces, and stretches them out into maybe-sorta-circular-but-not-really shapes.</span>\n</p>\n<p> </p>\n<p>\n<span>“Don’t need one. They can go right on the coals.”</span>\n</p>\n<p> </p>\n<p>\n<span>As if to prove his point, Zuko does exactly that, tossing the dough onto the coals next to the pan and letting them sit until appropriately browned and slightly charred before flipping them.</span>\n</p>\n<p> </p>\n<p>\n<span>The food in the pan seems cooked to Sokka’s inexperienced-at-cooking but experienced-at-food-poisoning eyes. Zuko snuffs the flames down to embers and gestures for him to take it off the fire. He pulls the bread off too, brushes off the soot left from the coals, and hands one to Sokka.</span>\n</p>\n<p> </p>\n<p>\n<span>“I’ve only got one plate so we can just eat it out of the pan, if you’d like some,” he offers.</span>\n</p>\n<p> </p>\n<p>\n<span>For a moment, Sokka’s tempted to refuse, because he doesn’t trust Zuko as far as he can throw him...but it wasn’t like he didn’t see everything that went into the pan. Hell, he even helped cook some of it! So, in the end, he takes the offered bread, and watches how Zuko tears off a piece of his own and uses it to scoop some of the food out of the pan.</span>\n</p>\n<p> </p>\n<p>\n<span>It’s an interesting way of eating, and not one that Sokka would have expected from a prince.</span>\n</p>\n<p> </p>\n<p>\n<span>Sokka thinks of princely eating, and he thinks of three forks and tiny portions and food he can’t recognize, not eating with your hands right out of the frying pan. He definitely doesn’t care whether it’s princely or not the minute the first bite goes in mouth, because it’s hot and spicy and </span>\n<em>\n<span>really good</span>\n</em>\n<span>.</span>\n</p>\n<p> </p>\n<p>\n<span>Before Sokka knows it, the pan is empty and the bread is gone, and he would have tried </span>\n<em>\n<span>way</span>\n</em>\n<span> harder to switch Zuko onto their side months ago if he’d know he could have been eating like this the whole time.</span>\n</p>\n<p> </p>\n<p>\n<span>The other boy is giving him a pretty interesting look, too, considering but tinged with confusion. Just the way Sokka likes it.</span>\n</p>\n<p> </p>\n<p>\n<span>“Good?”</span>\n</p>\n<p> </p>\n<p>\n<span>The interesting expression on Zuko’s face goes a little self-conscious. Sokka’s surprised to find that, despite himself, he wants to reassure him.</span>\n</p>\n<p> </p>\n<p>\n<span>“Yeah, dude,” he tells him, “Really good. If fighting the Fire Lord doesn’t work out, you could definitely just open up a restaurant!”</span>\n</p>\n<p> </p>\n<p>\n<span>If anything, Zuko actually looks </span>\n<em>\n<span>more</span>\n</em>\n<span> stressed out. Sokka flounders.</span>\n</p>\n<p> </p>\n<p>\n<span>“What else do you know how to make?”</span>\n</p>\n<p> </p>\n<p>\n<span>Zuko shrugs. </span>\n</p>\n<p> </p>\n<p>\n<span>“I don’t know...just putting stuff together, I guess? Cook just sort of threw things together from whatever we bought at port and after Uncle almost…” For a moment, Zuko looks a bit sick to his stomach but barrels on anyway, “I just asked around wherever we stopped, I guess. Whatever’s local that wouldn’t poison either of us. My mo— I learned how to make some of the osechi-ryori dishes when I was little, for the New Year. Gyoza, too. Just...things here and there, I guess.”</span>\n</p>\n<p> </p>\n<p>\n<span>Sokka has a distinct feeling that </span>\n<em>\n<span>things here and there</span>\n</em>\n<span> means a lot more than Zuko intends. His first instinct is to poke at him, but manages to stop himself because that’s the most words he’s ever heard the guy say at one time that wasn’t a furious tantrum about capturing Aang or screaming profanities. </span>\n</p>\n<p> </p>\n<p>\n<span>(Sokka didn’t even realize how many swear words one person could know until he saw Zuko get worked up, and then, suddenly, it was </span>\n<em>\n<span>very</span>\n</em>\n<span> easy to believe that he’d spent three years with sailors. Gran-gran would have a </span>\n<em>\n<span>heart attack.</span>\n</em>\n<span>)</span>\n</p>\n<p> </p>\n<p>\n<span>When he thinks about it, he realizes that while he’s heard a lot of shouting (</span>\n<em>\n<span>a lot</span>\n</em>\n<span> of shouting), he hasn’t ever just...heard him talk. Not really.</span>\n</p>\n<p> </p>\n<p>\n<span>If Sokka pokes fun at him, that probably won’t ever happen again. </span>\n</p>\n<p> </p>\n<p>\n<span>It would be a stretch to say that he and Zuko are friends. It’s a stretch to say that he even trusts him, except that he’s the only option they’ve got for Aang learning to firebend, so here he is. Sokka’s accepted that they’re stuck with him. For the time being, anyway. But it’s not a horrible thought, Sokka realizes, to have someone else on their side. To maybe, someday but probably not right now, be friends.</span>\n</p>\n<p> </p>\n<p>\n<span>But to do that he’s going to have to trust him, and Sokka’s not totally that he can.</span>\n</p>\n<p> </p>\n<p>\n<span>So he lets it go and just leans back a little, rubs his belly in contentment. With the grace of someone used to it, Zuko sprinkles some soap powder into his pan and gives it a quick scrub with water from a pot, bends it dry in seconds.</span>\n</p>\n<p> </p>\n<p>\n<span>“You should teach my sister.”</span>\n</p>\n<p> </p>\n<p>\n<span>Zuko gives an unflattering and not princely at all snort.</span>\n</p>\n<p> </p>\n<p>\n<span>“Pretty sure if I go within six feet of your sister, I’m dead.”</span>\n</p>\n<p> </p>\n<p>\n<span>It </span>\n<em>\n<span>sounds </span>\n</em>\n<span>like a joke, but Sokka knows Katara and he’s seen in person who </span>\n<em>\n<span>Zuko</span>\n</em>\n<span> got for a baby sister, and both of them know that it’s not.</span>\n</p>\n<p> </p>\n<p>\n<span>“At the very least, you could be a </span>\n<em>\n<span>little</span>\n</em>\n<span> more sociable. I know from experience that it’s hard to stay on your guard when you’re eating,” Sokka tells him with a grin, inviting him to share in the joke. He’s not expecting Zuko’s face to do this funny twitch and for him to abruptly turn away, his whole posture tense and stressed again.</span>\n</p>\n<p> </p>\n<p>\n<span>“I didn’t...I wasn’t trying to get you to let your guard down, okay? I wasn’t...you showed up </span>\n<em>\n<span>first</span>\n</em>\n<span>.”</span>\n</p>\n<p> </p>\n<p>\n<span>…</span>\n<em>\n<span>Oh</span>\n</em>\n<span>.</span>\n</p>\n<p> </p>\n<p>\n<span>Sokka leans forward and, possibly against his better judgement, wraps his fingers around Zuko’s bicep and squeezes firmly.</span>\n</p>\n<p> </p>\n<p>\n<span>“Dude. I was </span>\n<em>\n<span>joking</span>\n</em>\n<span>. Okay? Like...I know we’ve had our shit, okay, but there’s no way in hell that you’re slick enough to pull something like that off. No matter what Katara thinks.” And that’s not a lie, either, Sokka realizes. Zuko shouted about half of every plan he ever had to capture Aang right to their faces; he’s so honest that it almost physically hurts, for better or for worse.</span>\n</p>\n<p> </p>\n<p>\n<span>He’s pretty sure he knows who got the manipulation skills in the family, anyway.</span>\n</p>\n<p> </p>\n<p>\n<span>Zuko gives him a look that contains such a horrifying amount of gratitude that Sokka feels like he’s gonna break out in hives. He didn’t even say anything that </span>\n<em>\n<span>nice</span>\n</em>\n<span>, what the fuck.</span>\n</p>\n<p> </p>\n<p>\n<span>When Sokka leaves to head back to the rest of his friends, he can’t get the image of Zuko, very alone in that damp and moody room, all by himself, and how he’d actually been enjoyable company.</span>\n</p>\n<p> </p>\n<p> </p>\n<p>\n<span>Zuko’s coronation is </span>\n<em>\n<span>wild</span>\n</em>\n<span>.</span>\n</p>\n<p> </p>\n<p>\n<span>Sokka’s not sure if it’s because of the end of the war or if it’s because Zuko’s the closest thing to a sane Fire Lord there’s been for a century at least, but the entire country seems out of their minds with joy. The night Zuko’s crowned is a riot of merrymaking and free flowing alcohol and Sokka spends most of it drunk. To be fair, so does Dad, but the difference is that Sokka doesn’t mean to; it just sort of...happens.</span>\n</p>\n<p> </p>\n<p>\n<span>And it feels like one minute, he’s dancing with Suki and the next, Toph’s depositing him next to the new Fire Lord who looks nearly constipated with awkwardness at being constantly bowed to and greeted and toasted when two weeks ago, he was to be killed on sight. It’s a weird backspin, but Sokka’s here for it.</span>\n</p>\n<p> </p>\n<p>\n<span>“Heeeeeeey,” Sokka says and definitely doesn’t lean against Zuko the first chance he gets and definitely doesn’t make every single guard in the vicinity twitch. He’s a touchy feely guy, okay? They’d better get used to it.</span>\n</p>\n<p> </p>\n<p>\n<span>“Get used to what?”</span>\n</p>\n<p> </p>\n<p>\n<span>Oh fuck, he said that out loud.</span>\n</p>\n<p> </p>\n<p>\n<span>“You did, you definitely did,” Zuko tells him. </span>\n</p>\n<p> </p>\n<p>\n<span>“Are you a mindreader?” Sokka asks and receives the very first snort of laughter from Fire Lord Zuko, the First Of His Name.</span>\n</p>\n<p> </p>\n<p>\n<span>“No, definitely not. You’re just really drunk.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Call it like it is,” Sokka insists, “I’m </span>\n<em>\n<span>shitfaced</span>\n</em>\n<span>. Get it right.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Okay, Ambassador Shitfaced.”</span>\n</p>\n<p> </p>\n<p>\n<span>“</span>\n<em>\n<span>What</span>\n</em>\n<span> about my ass???”</span>\n</p>\n<p> </p>\n<p>\n<span>Sokka feels the vague sensation of Zuko rubbing his temples and laughing very, very quietly to himself.</span>\n</p>\n<p> </p>\n<p>\n<span>“You started earlier than I thought,” he says and sighs a little bit. It probably goes against Fire Lordy propriety for Zuko to sling his arm around Sokka’s shoulders the way that he does and it’s definitely against whatever passes now for royal protocol for Sokka to rub his cheek on Zuko’s fancy robes. He can’t help it, though, they’re </span>\n<em>\n<span>so soft</span>\n</em>\n<span>. He deserves soft things and should wear them </span>\n<em>\n<span>all the time.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Sokka means to tell him that but what comes out instead is a cheerful </span>\n<em>\n<span>you’re so soft</span>\n</em>\n<span>, and he gets the most glorious visual of Zuko going bright red all the way down those super soft robes. Zuko hails a waiter without a word, takes the offered glass of sake that’s definitely for sipping and not shooting, and knocks it back.</span>\n</p>\n<p> </p>\n<p>\n<span>“You gonna be good, buddy? Don’t think I’ve ever seen you drink before,” Sokka points out. Zuko leans into him hard, warm and loose and </span>\n<em>\n<span>soft, </span>\n</em>\n<span>whuffs an amused breath into Sokka’s hair.</span>\n</p>\n<p> </p>\n<p>\n<span>“I’ll be fine. Had less than you, at any rate.”</span>\n</p>\n<p> </p>\n<p>\n<span>That’s the fucking truth right there.</span>\n</p>\n<p> </p>\n<p>\n<span>Sokka feels </span>\n<em>\n<span>awesome</span>\n</em>\n<span>.</span>\n</p>\n<p> </p>\n<p>\n<span>“You’re gonna be so good at this, man,” he tells him, doesn’t even try to disguise the surprising amount of open affection in his tone. Couldn’t even if he tried, but he doesn’t care to. Zuko deserves to know that people give a shit about him. “Like...fuck, dude. You’re gonna be </span>\n<em>\n<span>amazing</span>\n</em>\n<span>. You know that, right? Heard it here first. Best Fire Lord </span>\n<em>\n<span>ever</span>\n</em>\n<span>.”</span>\n</p>\n<p> </p>\n<p>\n<span>Zuko throws his hand up for another shot of sake.</span>\n</p>\n<p> </p>\n<p>\n<span>“Thank you,” he breathes, and the frankly ridiculous amount of gratitude there makes Sokka want to hug him, so he does. Every guard gives another twitch but Zuko waves away their concern with an indulgent hand wave in their direction.</span>\n</p>\n<p> </p>\n<p>\n<span>Somehow Sokka manages to end up in his own bed despite the revelry (and how fucking </span>\n<em>\n<span>weird </span>\n</em>\n<span>is it to have his own room in the Fire Nation palace?) but he’s not entirely sure how he got there. He remembers dancing, and drinking, and accosting Zuko a significant amount and then...walking? Or being walked. He definitely remembers an arm around his shoulders and he remembers rumbling voices that are warm and kind and familiar, remembers Katara’s exasperated affection at how both he and dad are drunk as shit.</span>\n</p>\n<p> </p>\n<p>\n<span>Sokka remembers somebody pulling the blankets down and pushing him into bed, and </span>\n<em>\n<span>holy shit</span>\n</em>\n<span> being an ambassador is gonna be great if he gets a bed this nice.</span>\n</p>\n<p> </p>\n<p>\n<span>He remembers his boots being pulled off and then being tucked in by someone with calm, callused hands. Sokka hasn’t been tucked into bed since Mom did it, and he sort of remembers petting the person’s head? Maybe?</span>\n</p>\n<p> </p>\n<p>\n<span>They had soft hair. Maybe dark hair? Spirits, drunk Sokka is useless.</span>\n</p>\n<p> </p>\n<p>\n<span>Drunk Sokka is </span>\n<em>\n<span>impossible.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Not-drunk Sokka wakes up the next morning with a pounding headache and crusty eyes and his mouth tasting like something fucking died in it. He’s never drinking again. Ever.</span>\n</p>\n<p> </p>\n<p>\n<span>Which is probably not going to be true, but it’s true right now and that’s what counts.</span>\n</p>\n<p> </p>\n<p>\n<span>There’s a glass of water and a covered dish on his nightstand. This ambassador thing is getting better and better, if he’s getting sent breakfast. This is going to be </span>\n<em>\n<span>awesome</span>\n</em>\n<span>.</span>\n</p>\n<p> </p>\n<p>\n<span>It’s just scrambled eggs with diced and fried bacon on top of rice but somehow, it’s one of the best things he’s ever tasted.</span>\n</p>\n<p> </p>\n<p>  </p>\n<p>\n<span>Sokka gets dumped.</span>\n</p>\n<p> </p>\n<p>\n<span>He’s not surprised by it, honestly. He and Suki had tried to do the long distance thing since it had worked fairly well before, but apparently long distance during wartime when everyone has a ton going on and long distance during peacetime are…different.</span>\n</p>\n<p> </p>\n<p>\n<span>Different enough that when Sokka receives the message, he doesn’t have to open it to know what it is. He just </span>\n<em>\n<span>knows</span>\n</em>\n<span>.</span>\n</p>\n<p> </p>\n<p>\n<span>It doesn’t mean it doesn’t still hurt, though, and he devotes a good few days to moping and slinking and sighing through life before Zuko’s finally had it with him.</span>\n</p>\n<p> </p>\n<p>\n<span>“Get up, Ambassador Depression,” Zuko grumbles and physically pulls Sokka up from where he’s laying facedown in the sun in the gardens, waiting for sweet death to come take him away, “I cannot deal with this.”</span>\n</p>\n<p> </p>\n<p>\n<span>Neither could Suki.</span>\n</p>\n<p> </p>\n<p>\n<span>Sokka starts crying again.</span>\n</p>\n<p> </p>\n<p>\n<span>Zuko sputters in horror but keeps manhandling him like Sokka’s some kind of emotionally contagious pentapus, drags him out of the gardens and into his office. Spirits, Zuko has a great fucking chair. Maybe being Fire Lord is worth it just for the sweet seat.</span>\n</p>\n<p> </p>\n<p>\n<span>Sokka then remembers the screaming match the teenage Fire Lord had with an unreasonable General who just wouldn’t </span>\n<em>\n<span>listen</span>\n</em>\n<span> a few weeks back and thinks solidly </span>\n<em>\n<span>no</span>\n</em>\n<span>, it ain’t worth it.</span>\n</p>\n<p> </p>\n<p>\n<span>Zuko hates sitting on the throne, too. He only does it for ceremony and for very formal occasions and the look on his face is always so surly and sour whenever he does that they all try and get him off of it as soon as humanly possible. Sokka’s pretty sure that it’s because it reminds him too much of his dad, that he can’t even sit there without feeling awful. Same with the raised dais in the meeting room; he won’t touch it, just sits at the same table with everyone else.</span>\n</p>\n<p> </p>\n<p>\n<span>Zuko’s office is way more of a </span>\n<em>\n<span>him</span>\n</em>\n<span> space. It’s where he prefers to work, where he has private meetings, where he and Iroh have tea. It’s where Sokka’s caught him napping a few times when he can get it and a few times when he just crashes and no one has the heart to move him, sprawled out on the most comfortable sofa ever created by human hands. It’s where Sokka’s seen him, hunched over his desk with his head in his hands.</span>\n</p>\n<p> </p>\n<p>\n<span>Sokka’s whole job is communication. Sometimes he travels but mostly he stays in the palace and helps prevent a cultural breakdown between his people and Zuko’s, because they may share the same words but those words don’t always mean the same thing when it comes to politics and global relations. So where did he go wrong with Suki?</span>\n</p>\n<p> </p>\n<p>\n<span>Did he ignore her?</span>\n</p>\n<p> </p>\n<p>\n<span>Did he make her feel unloved?</span>\n</p>\n<p> </p>\n<p>\n<span>Did she doubt his </span>\n<em>\n<span>loyalty</span>\n</em>\n<span> to her?</span>\n</p>\n<p> </p>\n<p>\n<span>What could he have done to make it better, other than quit his job? She never would have asked it of him, never would and never did, but in her letter it was clear. She cited </span>\n<em>\n<span>growing apart</span>\n</em>\n<span>, and </span>\n<em>\n<span>going in different directions</span>\n</em>\n<span>. If he hadn’t taken this job, would they still have been going in the same direction? If he hadn’t said yes to Zuko, would he still be single right now?</span>\n</p>\n<p> </p>\n<p>\n<span>But that’s not fair, he thinks into the warm wood of Zuko’s desk.</span>\n</p>\n<p> </p>\n<p>\n<span>Nobody </span>\n<em>\n<span>made</span>\n</em>\n<span> him do this. Sokka </span>\n<em>\n<span>wanted</span>\n</em>\n<span> this, wanted to help but also wanted it for himself, and he’s good at it. He’s really, really good at it and everybody says so, not just Zuko.</span>\n</p>\n<p> </p>\n<p>\n<span>Sokka knows that he’s needed and he </span>\n<em>\n<span>likes </span>\n</em>\n<span>it.</span>\n</p>\n<p> </p>\n<p>\n<span>Sokka lifts his head. At some point during his moping, Zuko’s left him alone in his office, and somehow that’s even worse because that warm, comfortable space is made less so without him there. Sokka drops his head back down with a hard </span>\n<em>\n<span>thunk.</span>\n</em>\n<span> </span>\n</p>\n<p> </p>\n<p>\n<span>“Trying to give yourself a concussion, too?”</span>\n</p>\n<p> </p>\n<p>\n<span>“Maybe,” Somka grumbles into the desk. Something smells good, and sweet. He lifts his head again and there’s Zuko standing shyly in his own doorway, holding a…</span>\n</p>\n<p> </p>\n<p>\n<span>Cake?</span>\n</p>\n<p> </p>\n<p>\n<span>“Did you make </span>\n<em>\n<span>cake</span>\n</em>\n<span>?”</span>\n</p>\n<p> </p>\n<p>\n<span>Zuko shrugs and approaches, pushes aside some scrolls to make room. It’s not a big cake but it’s big enough, and he sets it ceremoniously in front of Sokka.</span>\n</p>\n<p> </p>\n<p>\n<span>There’s </span>\n<em>\n<span>sprinkles</span>\n</em>\n<span> on it.</span>\n</p>\n<p> </p>\n<p>\n<span>“It’s breakup cake,” the </span>\n<em>\n<span>fucking Fire Lord</span>\n</em>\n<span> tells him. “When Mai broke up with me, I ate an entire cake by myself. Uncle said it might make you feel better too.”</span>\n</p>\n<p> </p>\n<p>\n<span>Sokka is going to murder Uncle Iroh but only after he hugs Zuko within an inch of his awkward, impossible life and even then, only after he eats that damn cake, because it smells amazing.</span>\n</p>\n<p> </p>\n<p>\n<span>Zuko hands him a fork and Sokka doesn’t even feel a little bit bad about digging into the white frosting with confetti sprinkles. It’s vanilla cake and it’s </span>\n<em>\n<span>so good</span>\n</em>\n<span>, and Sokka suddenly feels like crying again.</span>\n</p>\n<p> </p>\n<p>\n<span>He may be crying again.</span>\n</p>\n<p> </p>\n<p>\n<span>“Why does breakup cake taste so good?” He mumbles into his next mouthful, and Zuko pats him on the shoulder.</span>\n</p>\n<p> </p>\n<p>\n<span>“Could be the tears,” he tells him gently and uses the heel of his hand to brush at Sokka’s cheeks, “Or it could be the good vanilla.”</span>\n</p>\n<p> </p>\n<p>  </p>\n<p>\n<span>Zuko nearly dies.</span>\n</p>\n<p> </p>\n<p>\n<span>Nearly, no thanks to any of the rest of them who stand there half stupid when the Fire Lord freezes after taking his first bite at the start of the meal, goes milk pale, and shoves his fingers down his own throat to vomit into his sleeve just in time to start wheezing and drop to the ground.</span>\n</p>\n<p> </p>\n<p>\n<span>It’s about the scariest thing that Sokka’s ever seen in his life, watching, useless, as Iroh starts chest compressions and breathing for him until the healers can get him stabilized. Less scary but more horrible, if that’s even possible, is when Zuko spikes the fever. It goes so high that he hallucinates and starts crying so desolately for his mom that Sokka ignores the protests of his doctors and climbs right into his bed and holds him, curls around his body and holds him so tight that the tremors quaking through Zuko’s frame shake Sokka’s too.</span>\n</p>\n<p> </p>\n<p>\n<span>It turns out that if Zuko had eaten any more than he had or made himself throw up any slower, he definitely would have been dead.</span>\n</p>\n<p> </p>\n<p>\n<span>Iroh sits by his bed the entire time with his head in his hands.</span>\n</p>\n<p> </p>\n<p>\n<span>They found the culprit quickly but that doesn’t really make anyone feel better.</span>\n</p>\n<p> </p>\n<p>\n<span>It doesn’t change anything.</span>\n</p>\n<p> </p>\n<p>\n<span>It doesn’t change that Zuko was almost murdered right there in front of everyone, because someone with a grudge didn’t approve of him giving a shit about making the world better. </span>\n</p>\n<p> </p>\n<p>\n<span>Zuko doesn’t die but he’s not the same.</span>\n</p>\n<p> </p>\n<p>\n<span>He works even harder and for longer hours, balancing treaties and war reparations and a sustainable, long term plan for his country with obsessively researching poisons. He doesn’t want to delegate, doesn’t want to let Uncle shoulder his load, doesn’t want to make any concessions for his health or safety.</span>\n</p>\n<p> </p>\n<p>\n<span>He doesn’t want a taster either.</span>\n</p>\n<p> </p>\n<p>\n<span>That’s its own little private shitshow, because what the hell kind of nearly-poisoned-to-death, idiot Fire Lord refuses a taster?</span>\n</p>\n<p> </p>\n<p>\n<span>This one, apparently, because merely mentioning it as an option is a great way to get yelled at real quick, and eventually people quit trying even though it’s an open secret that everyone thinks he has a death wish. Sokka knows better.</span>\n</p>\n<p> </p>\n<p>\n<span>It’s not a death wish that Zuko has.</span>\n</p>\n<p> </p>\n<p>\n<span>Zuko just doesn’t want anyone to die for him.</span>\n</p>\n<p> </p>\n<p>\n<span>The problem is that he refuses a taster but also won’t eat unless he’s prepared it himself or seen it made, and he doesn’t have much time for himself as it is. So now he’s not really eating, either, and Sokka’s not sure how long he can let Zuko manage himself before someone does something really stupid.</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Really stupid</span>\n</em>\n<span> comes quickly in the form of Uncle Iroh reaching his own breaking point with Zuko’s stubbornness, swiping a dumpling off of his untouched plate and popping it in his mouth. </span>\n</p>\n<p> </p>\n<p>\n<span>Zuko goes absolutely out-of-his-mind </span>\n<em>\n<span>ballistic, </span>\n</em>\n<span>shouting and throwing things off his desk and shaking Uncle back and forth by his collar, demanding that Uncle </span>\n<em>\n<span>spit it out, </span>\n</em>\n<b>\n<em>please</em>\n</b>\n<em>\n<span>, spit it out</span>\n</em>\n<span>, until he’s a silently shivering wreck in the middle of his half destroyed office.</span>\n</p>\n<p> </p>\n<p>\n<span>His eyes are </span>\n<em>\n<span>huge</span>\n</em>\n<span> and his grip on his desk has left deep gouging marks, singed black and charred. </span>\n</p>\n<p> </p>\n<p>\n<span>Sokka can’t make himself move forward or back, just stands there like a fucking dummy.</span>\n</p>\n<p> </p>\n<p>\n<span>Iroh stares his nephew down, motionless. Eats another dumpling. Swallows.</span>\n</p>\n<p> </p>\n<p>\n<span>Zuko trembles where he stands and looks like he’s going to start crying.</span>\n</p>\n<p> </p>\n<p>\n<span>And Sokka realizes, suddenly and with more clarity than almost anything in his entire life, that Uncle’s plan might work with anyone else but it </span>\n<em>\n<span>won’t work on Zuko</span>\n</em>\n<span>. Not the way he wants it to. He wants Zuko to see reason, but the problem is that Zuko sees it and has already made up his mind that it’s an unacceptable option.</span>\n</p>\n<p> </p>\n<p>\n<span>The guy will </span>\n<em>\n<span>die</span>\n</em>\n<span> stubborn and pushing him this hard won’t do anything but hurt him.</span>\n</p>\n<p> </p>\n<p>\n<span>So Sokka makes up his mind and takes that step forward, kneels on the floor to gather the scrolls and maps that were thrown in one hand, takes Zuko by the arm in the other.</span>\n</p>\n<p> </p>\n<p>\n<span>“Come on,” he tells him gently, “Let’s go take a walk.”</span>\n</p>\n<p> </p>\n<p>\n<span>Their walk takes them down to the kitchens. </span>\n</p>\n<p> </p>\n<p>\n<span>Sokka gestures for the lone guard that Zuko’s permitted to follow him to clear off a spot at the prep table and then drops the scrolls on it.</span>\n</p>\n<p> </p>\n<p>\n<span>“There, now you can work too. Sit.”</span>\n</p>\n<p> </p>\n<p>\n<span>Zuko sits.</span>\n</p>\n<p> </p>\n<p>\n<span>“What are you doing?” He asks, finally, looking, despite the fancy robes and crown, like he belongs right there where he is.</span>\n</p>\n<p> </p>\n<p>\n<span>Sokka shrugs.</span>\n</p>\n<p> </p>\n<p>\n<span>“Eating stresses you out, I get that. And right now, you don’t really have a lot of people you can trust with your food.” Sokka starts rummaging through cabinets, through the pantries, peeks into the cold box to see what’s there. “So until you do, I’m gonna take care of it. Whatever I’ve gotta do to help you feel safe again.”</span>\n</p>\n<p> </p>\n<p>\n<span>Zuko sits there, looking so bewildered and so young, until he can speak again.</span>\n</p>\n<p> </p>\n<p>\n<span>“But you don’t…” </span>\n</p>\n<p> </p>\n<p>\n<span>“Cook? I guess not really. But I’ve watched you enough, you know?” Because he has watched Zuko, probably more than he wants to admit. Has admired the easy way he handles a knife, admired the attention he pays to whatever he makes. Admired the way he cares about it, and the way he uses it to care about others. “Worse comes to worst, it’s just burned. You won’t die from a little char, will you?”</span>\n</p>\n<p> </p>\n<p>\n<span>That startles a laugh out of him and Zuko leans forward, props his chin up on his hand. He looks fucking wiped.</span>\n</p>\n<p> </p>\n<p>\n<span>Sokka hopes that Iroh will apologize to him later for scaring the absolute shit out of him.</span>\n</p>\n<p> </p>\n<p>\n<span>“No, I don’t think any firebender worth their flame would die from that.”</span>\n</p>\n<p> </p>\n<p>\n<span>That’s as good as Sokka knows he’s going to get as far as permission goes. The head chef has already cleared out of the way so Sokka’s got the kitchen mostly to himself. He hums a little and pulls out some potato-chokes, some onion-snips, a jar of chili-grass-garlic paste.</span>\n</p>\n<p> </p>\n<p>\n<span>“No squirrel-possum,” he says, “But we can make do with something else, I guess.”</span>\n</p>\n<p> </p>\n<p>\n<span>Zuko’s jaw drops open when it clicks.</span>\n</p>\n<p> </p>\n<p>\n<span>“Are you really…? That’s the first—“</span>\n</p>\n<p> </p>\n<p>\n<span>“The first meal we ever had together, yup.” Sokka shoots him an indulgent grin, because Zuko’s ignoring his scrolls and shedding his outer robe, draping it over the stool. He just can’t help himself. He comes round and Sokka hands him a bag of flour and little unmeasured bowls each of water, salt, and oil. “I’ll leave the bread to you.”</span>\n</p>\n<p> </p>\n<p>\n<span>This is the first time they’ve really cooked together. Mostly Zuko cooks and Sokka watches and talks at him, and Sokka had been going for a meaningful role reversal but somehow this is better. Mostly because he’s still pretty sure that he’ll definitely fuck up the bread.</span>\n</p>\n<p> </p>\n<p>\n<span>He can manage cutting vegetables into chunks, though, and he knows he can handle cutting up the meat, and the stove might be fancy and fit for a royal but all Sokka can see is that little flickering fire that feels so long ago and so far away.</span>\n</p>\n<p> </p>\n<p>\n<span>“You know, when my dad asked me when we became friends, I told him that it was when I knew you were ride-or-die enough to help break him out of jail with no plan on hand,” Sokka says, pushes the potato-chokes around in the pan and hopes they don’t burn, “But that was a lie.” Zuko’s hands pause their kneading for a beat, two, then continue. “I think that it was this, you remember? I didn’t trust you for shit, you know?”</span>\n</p>\n<p> </p>\n<p>\n<span>“You has no reason to,” Zuko says reasonably, not hurt by the comment at all. “Honestly, it was probably one of the smarter choices you’d made.”</span>\n</p>\n<p> </p>\n<p>\n<span>This was true, objectively speaking, but man, how much easier life would have been if they could have gotten to trust </span>\n<em>\n<span>sooner</span>\n</em>\n<span>. Who knows if they’d be in the same place if they had, though? Sokka’s pretty content with his lot in life and, minus Zuko’s recent assassination attempt that’s fucked up most everything in some way, he’s not sure he’d change a thing.</span>\n</p>\n<p> </p>\n<p>\n<span>Not much, anyway.</span>\n</p>\n<p> </p>\n<p>\n<span>“You don’t have to eat soot this time, at least,” Zuko actually </span>\n<em>\n<span>jokes</span>\n</em>\n<span> as he throws the stretched flatbreads into the oven.</span>\n</p>\n<p> </p>\n<p>\n<span>“I don’t know, the soot gave it that little special something.”</span>\n</p>\n<p> </p>\n<p>\n<span>“You’re more than welcome to lick the coals later, then.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Hard pass, thanks.”</span>\n</p>\n<p> </p>\n<p>\n<span>Zuko snorts and tries to pretend that he’s not hovering over Sokka and his pan and low-key babysitting them. Sokka swats him on the shoulder and shoos him back to his seat.</span>\n</p>\n<p> </p>\n<p>\n<span>It’s probably only because everybody’s used to Sokka being Sokka that the guard doesn’t even so much as twitch at somebody putting their hands on the Fire Lord.</span>\n</p>\n<p> </p>\n<p>\n<span>Or it could have been that Zuko </span>\n<em>\n<span>laughs</span>\n</em>\n<span> at him and lets himself be shooed, looking more relaxed than Sokka’s seen him in a while.</span>\n</p>\n<p> </p>\n<p>\n<span>The meat looks done and bread is just this side of burnt but in a good way when he gingerly pulls it off the rack with his fingertips. Sokka doesn’t bother with plates, just plunks the pan down on a potholder.</span>\n</p>\n<p> </p>\n<p>\n<span>“No plates?”</span>\n</p>\n<p> </p>\n<p>\n<span>“Not unless you wanna do the dishes.”</span>\n</p>\n<p> </p>\n<p>\n<span>Zuko smirks.</span>\n</p>\n<p> </p>\n<p>\n<span>“I’m the Fire Lord. I don’t have to do my own dishes.”</span>\n</p>\n<p> </p>\n<p>\n<span>Sokka bops him with a piece of bread and sits down in the second stool. He’s charmed by the feeling of nostalgia and comfort this reenactment brings but finds that he’s even more charmed by Zuko this time around. Sokka’s not sure whether it’s his level of trust in Sokka himself or because, like last time, he saw everything that went into it, but when Zuko tears off a piece of bread and goes in, he finds that he can’t look away from him.</span>\n</p>\n<p> </p>\n<p>\n<span>“Are you good?” The Fire Lord asks. Sokka realizes that he’s just staring, half spellbound, and flusters.</span>\n</p>\n<p> </p>\n<p>\n<span>“No no no no, I’m good!” He exclaims. “Hold on a sec, you’ve got some…”</span>\n</p>\n<p> </p>\n<p>\n<span>Sokka reaches out a hand and swipes a tiny bit of tomato off of Zuko’s cheek and instead of wiping it onto a napkin, just licks it off. Zuko goes very, very still, the look on his face unreadable.</span>\n</p>\n<p> </p>\n<p>\n<span>Slowly, he puts down his bread.</span>\n</p>\n<p> </p>\n<p>\n<span>“Hey,” he says, voice barely louder than a whisper. “I’m pretty, uh, bad at reading a room. But can I…?”</span>\n</p>\n<p> </p>\n<p>\n<span>Can Zuko what? Zuko’s the Fire Lord, he can do pretty much whatever he wants within reason—</span>\n</p>\n<p> </p>\n<p>\n<span>Zuko kisses him.</span>\n</p>\n<p> </p>\n<p>\n<span>It’s not a long or deep kiss but it’s very sweet and so brief that Sokka regrets that he spends most of it frozen like a statue before his brain goes</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Oh.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>And kisses back just as Zuko pulls away from him. He’s red all down his neck and looks torn between mortification and terror and elation. Sokka </span>\n<em>\n<span>stares </span>\n</em>\n<span>at him, because Zuko’s always been an objectively pretty dude but he’s even prettier like this, even if Sokka definitely wants to kiss him until he stops looking so afraid.</span>\n</p>\n<p> </p>\n<p>\n<span>“...hi,” is all his stupid brain can come up with, and </span>\n<em>\n<span>so much </span>\n</em>\n<span>in his life makes </span>\n<em>\n<span>way more sense now</span>\n</em>\n<span>. </span>\n</p>\n<p> </p>\n<p>\n<span>“...hi.”</span>\n</p>\n<p> </p>\n<p>\n<span>Sokka sways closer and finds Zuko’s hands, laces their fingers together, holds. It feels right to do it, like he should have been doing it for ages by now and just hasn’t, for whatever reason.</span>\n</p>\n<p> </p>\n<p>\n<span>“Just, uh, for future reference, you are more than welcome to do that again </span>\n<em>\n<span>literally</span>\n</em>\n<span> any time you want.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Can I do again right now?” Zuko’s trying to pull off coy but it’s not really working because he keeps smiling about it. This time Sokka’s the one who moves, kisses Zuko’s stupidly pretty, stupidly stubborn, stupidly annoying and Fire Lordy face right there in front of his guard. He cradles Zuko’s face in his hands and pulls away only to get another good look at him, just so that he can kiss him again. He feels like his heart’s gonna fucking explode.</span>\n</p>\n<p> </p>\n<p>\n<span>It’s funny because he’s not </span>\n<em>\n<span>surprised</span>\n</em>\n<span> by this at all.</span>\n</p>\n<p> </p>\n<p>\n<span>Maybe, he thinks very deep down, when Sokka realizes that he and the Fire Lord are making out right there in the middle of the kitchen and starts laughing hysterically, the only thing that he’s surprised about is how long it took for them to get there.</span>\n</p>\n<p> </p>\n<p>  </p>"
}