{
  "id": "21759226",
  "url": "https://archiveofourown.org/works/21759226?view_full_work=true",
  "author": [
    "Yuu_chi"
  ],
  "title": "one good thing",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "魔道祖师 - 墨香铜臭 | Módào Zǔshī - Mòxiāng Tóngxiù",
    "陈情令 | The Untamed (TV)"
  ],
  "relationships": [
    "Lan Zhan | Lan Wangji/Wei Ying | Wei Wuxian"
  ],
  "characters": [
    "Lan Zhan | Lan Wangji",
    "Wei Ying | Wei Wuxian",
    "Lan Huan | Lan Xichen"
  ],
  "additional_tags": [
    "Alternate Universe - Modern Setting",
    "Ghost Wei Wuxian",
    "Angst and Humor",
    "Angst with a Happy Ending",
    "I swear there really is a happy ending",
    "And an alarming amount of rabbits"
  ],
  "language": "English",
  "series": "Part 1 of heart, home, spirit & soul",
  "published": "2019-12-11",
  "completed": null,
  "words": "26,608",
  "chapters": "1/1",
  "comments": "846",
  "kudos": "17,700",
  "bookmarks": "5,831",
  "hits": "151,460",
  "summary": "<p>Wei Wuxian has been haunting his childhood home for three years. He's perfected the fine art of scaring away all the tenants, and has grown used to living with the dying flowers in the garden as his only company. </p>\n<p>When Lan Wangji buys the house, Wei Wuxian fully intends to drive him off too. Except Lan Wangji is beautiful, and interesting, and captivating company - even if he supposedly doesn't know Wei Wuxian exists.</p>",
  "notes": "<p>\n<strong></strong>\n<br>\n<a href=\"https://www.wattpad.com/story/213270656?utm_source=android&amp;utm_medium=link&amp;utm_content=share_writing&amp;wp_page=create&amp;wp_uname=Lunatica-nightmare&amp;wp_originator=Bhyt3lzBDVLT7QNEoojS%2F0Z%2FB4eDwJEPf8QUlMmcPl3POow0Z0YEKCaWva2K3Fudh%2BiK3jP7Vf4LgDUI6UWU6xe17CDeOZtnWBSZaZ4Fflbch6N%2FhMroPiChKAi4MhmJ&amp;_branch_match_id=753229392366758063\" rel=\"nofollow\">Spanish translation by Luna_tica4</a>\n<br>\n<a href=\"https://www.wattpad.com/story/243454002?utm_source=ios&amp;utm_medium=link&amp;utm_content=story_info&amp;wp_page=story_details&amp;wp_uname=Bichennoc_egritaria&amp;wp_originator=vWVqZ0vBX2Z0eMm5izNQnYW78pR%2BFsMuesa8IFxtWHkajyjnrC46vVwuphKHjav88zrcxepfAJXWdOMEf%2FvhdY7GLIUkolB3kvBAiRMMl9OY6zYwgM64b1o%2B8aqeJr%2Bq&amp;_branch_match_id=859731532124885097\" rel=\"nofollow\">Portuguese translations by Venusinpisces1</a>\n</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>This was a marathon effort of three days of frantic writing, and I cannot even begin to tell you how relieved I am to finally be able to share it. </p>\n<p>Tumblr: glenflower<br>Twitter: @doingwritebyme</p>\n<p>Some absolutely gorgeous fanart by incredibly talented people:</p>\n<p><a href=\"https://twitter.com/beccadrawing/status/1312866674799005697\" rel=\"nofollow\">By @beccadrawing on twitter</a>  |  <a href=\"https://twitter.com/andreannaness/status/1331046370430623745\" rel=\"nofollow\">By @andreannaness on twitter</a>  |  <a href=\"https://twitter.com/EraiEraiArt/status/1299855064941682688\" rel=\"nofollow\">By @EraiEraiArt on twitter</a>  |  <a href=\"https://twitter.com/korimichele/status/1243948034477772800\" rel=\"nofollow\">A really interesting comic about the experience of reading fanfic by @korimichele</a>, with some brilliant art for this fic and many others I'm sure you all recognize. And<a href=\"https://archiveofourown.org/works/25435420/chapters/62792773\" rel=\"nofollow\"> one more here as well</a>, as included in <a href=\"https://archiveofourown.org/works/25004899\" rel=\"nofollow\">the very talented Russian translation. </a></p>",
  "text": "<p>Wei Wuxian has been dead for three years. </p>\n<p>He knows this only because he keeps a careful eye on the calendars the ever changing residents of his house hang on their walls. Without them, he thinks it’s probably likely he’d have lost track of the passage of time a long, long time ago now. Being dead comes with a lot of perks - improving his already admittedly shaky memory had not been one of them. </p>\n<p>The first year had been a rough one. He doesn’t remember a lot of it, too overcome with an uncontrollable rage and something that felt a lot like anguish. He’d never understood what that really meant until he was hovering six inches off the ground in an empty house, his family god knows where, and his body probably rotting somewhere deep in the dirt. He hadn’t even remembered how he died, which seemed remarkably cruel.</p>\n<p>Two families had tried to move in that year, and Wei Wuxian had chased them both away with midnight howling, scraping his nails down the walls and leaving bloody scratches furrowed in the wallpaper. Small pranks, he’d justified to himself, even though he hadn’t been thinking much of anything except <em>leave me alone </em>when he’d done them. Sure, he was a ghost, but he wasn’t actually going to <em>hurt </em>anybody. He was just… </p>\n<p>Even now, Wei Wuxian doesn’t have the words for what he’d been back then. Angry. Furious. Confused, hurt - monstrously, tortuously <em>miserable</em><em>.</em> Slipping further and further away from human with every passing moment. </p>\n<p><em>I wouldn’t actually hurt anybody, </em>he’d promised himself when he was feeling more lucid. <em>Not really. I’m not like that. That’s not me. </em></p>\n<p>He kept telling himself that right up until the moment a disinterested teenage boy found a box of Wei Wuxian’s old things lost in the basement and then he saw <em>red. </em>He doesn’t remember clearly what he did, but the next time he came to awareness, the family were packing the last of their things in a moving van. The boy was sitting silent and pale-faced in the back, his mother’s arm around his shoulders. </p>\n<p>There was a row of stitches to the left of his temple and bruises around his wrists in the shape of Wei Wuxian’s ghostly fingers. </p>\n<p>That was his wake up call, really. Wei Wuxian was dead. He was dead, and he was staying this way, and no matter how fucking <em>tragic </em>this whole stupid thing was, he wasn’t going to let himself become the kind of ghost that become an urban legend on the strength of its cruelty alone. </p>\n<p>In life, Wei Wuxian had been a whirlwind of laughter and harmless jokes. He’d always been aware enough to know that people found him charismatic and charming; he was well liked and deeply loved, and he loved just as deeply in return. </p>\n<p>What would his sister think if she saw him like this? Terrorizing families? Hurting <em>children? </em>How could he ever face her again if he kept going the way he was heading? </p>\n<p>After that, it took a while before anybody dared to move into the house again, and by then Wei Wuxian was <em>reformed. </em>The anger that had been slowly building inside of him was still there, but it was buried where it couldn’t hurt anybody. He restricted himself to harmless pranks - chairs creeping across the dining room in the middle of the night, messages written in the shower fog on the mirror. Little things to keep him entertained, because the afterlife was, it turned out, <em>really boring. </em></p>\n<p>People came and people went. Nobody stayed more than six months in Wei Wuxian’s house. He was pretty smug about that. Two years passed. Three. The house gets a reputation. The real estate agent despairs at ever selling it again. </p>\n<p>And then, like a fucking miracle, Wei Wuxian discovers a fat <em>sold </em>sticker across the board in the front yard. He can’t leave the general premises, but he can see it from the window of the living room, and he stares at it for what might be a small eternity. </p>\n<p>As a ghost, Wei Wuxian does not always, in the technical sense of the term, <em>exist. </em>Sometimes he’s here, in the house he shared with a family kind enough to raise him when he had nobody else, and sometimes he’s <em>not. </em>He doesn’t know exactly where he is when he’s gone, or if he’s anywhere at all, just that when awareness returns to him, time has passed. Usually it doesn’t bother him. Wei Wuxian is a resilient person, but three years spent mostly alone in his childhood home would drive even him insane. The gone periods are a pleasant break. When you’re living a liminal existence, you’re not so worried about what you miss in your absence. Most of the time, there’s nothing <em>to </em>miss. </p>\n<p>Except he’s missed this. </p>\n<p>“What,” he says, “the <em>fuck?” </em></p>\n<p>The house has been empty going on eight months now. In a way, Wei Wuxian can admit he’s been missing having company, even if the company in question doesn’t know he even exists.  But he’d have liked to have seen them <em>before </em>they started moving in. </p>\n<p>It’s moments like this that Wei Wuxian wishes he had somebody to complain to. One of the worst fucking parts about being dead is that he lacks even somebody willing to pretend to be his confidant, like Jiang Cheng had back when he was alive. Sure, he’d complain about it, but at the end of the day he’d always let Wei Wuxian share his burdens with him. That was just what brothers did. </p>\n<p>Now though, the closest thing to a friend Wei Wuxian has is the withering garden growing just beneath the kitchen window. He’d be more embarrassed about his tendency to sit on the windowsill and ramble to the wilting wildlife if he had anybody there to witness him. He does not. If Jiang Cheng could see just how much death had increased his shamelessness, he thinks he’d have a heart attack. </p>\n<p>(Good. Maybe <em>then </em>Wei Wuxian would have some company.) </p>\n<p>A week after the sold sticker appears, so does a moving van. </p>\n<p>Wei Wuxian watches from the second floor, spying through the thin curtains as movers slowly unpack what seems like a suspiciously low amount of furniture from the truck and carry it inside. A part of him wants to go downstairs and flit around, but he knows being amid the chaos would just make him want to wreak havoc on it all, so he clings to his self-control and stays tucked away in the spare room for everybody’s wellbeing. </p>\n<p>Not long after the move starts, a Mercedes pulls up in the driveway and Wei Wuxian’s brows shoot high. As he watches, the door opens smoothly and out steps possibly the most attractive man Wei Wuxian has seen in both life <em>and </em>death. </p>\n<p>His hair is long, pulled neatly out of the way, and his pale face is <em>impeccable</em>. When people talk about gods being carved from marble, Wei Wuxian imagines this is what they picture. Smooth, flawless skin, dark eyes and features sharp enough to cut yourself on if you stare for too long. He has to be a model, Wei Wuxian thinks. Or maybe some new actor that’s taken the world by storm in the years Wei Wuxian’s been gone. He <em>has </em>to be because it’d be a fucking <em>crime </em>otherwise to waste such beauty. </p>\n<p>“Oh,” Wei Wuxian can’t help but say aloud, smile splitting his face. If he’s going to be miserable and trapped in this house for the rest of existence, at least the view looks promising. </p>\n<p>As Wei Wuxian watches, the man inserts himself into the moving process without so much as batting an eye, uncaring of his neat, expensive clothing. One of the movers reluctantly slides out of the way and the man hefts three boxes in his arms as if they weigh no more than a feather. What Wei Wuxian would pay to see underneath his perfectly fitted sweater - he bets he has abs you could bounce a coin off. </p>\n<p>The move seems to go quicker than it ought to - between the new home owner’s considerable strength and the sparsity of his possessions, everything is finished long before the evening sinks down from the horizon. Wei Wuxian drifts down to the kitchen and props himself up on his favorite windowsill to watch, leg swinging absently back and forth. </p>\n<p>To the flowers struggling to grow on the other side of the glass, he says, “We’re getting a new roommate. Well, <em>I’m </em>getting a new roommate - you’re getting somebody who might actually be able to water you for a change.” The flowers outside sway a little in the breeze, and Wei Wuxian nods contemplatively. “He can’t be any worse than the last guy who lived here. Remember when I spooked him while he was cooking and he nearly burnt the house down? Of course you don’t. You’re fucking foliage, your memory is worse than mine. I remember though, so it’s cool.” </p>\n<p>There’s the sound of shuffling behind him and Wei Wuxian looks up to see the stranger has entered the kitchen, setting the last of the boxes down on the table. Disgustingly neat handwriting declares the box <em>kitchen - homeware. </em>The stranger carefully brushes his hair back from his face and, without so much as a second of hesitation, cracks open the box and begins unpacking. </p>\n<p>“Wow, you really don’t waste any time, do you?” Wei Wuxian marvels. “You literally just got here - who cares about unpacking? Sit down for a moment, breathe, have something to eat. It’s not going anywhere.” </p>\n<p>The stranger, of course, gives absolutely no sign that he’s heard him. He pulls out a neat dining set and begins stacking it in the cupboards. Wei Wuxian props his chin on his palm and watches curiously. His new roommate walks with a beautiful economy of movement; graceful, somehow, even when he’s just slotting cutlery into a draw with his pretty fingers. </p>\n<p>“You know,” Wei Wuxian announces, “pretty rude of you not to introduce yourself. I was here first, after all. You’re living here out of my boundless generosity.” He swings himself off the windowsill and approaches so he can lean on the opposite side of the bench to the one the stranger is standing at. “I’m Wei Wuxian, but given the fact we’re going to be living together, you can call me Wei Ying if you want.” </p>\n<p>Expressionlessly, the man reaches right past Wei Wuxian to settle a teapot neatly in the corner where Wei Wuxian’s fantastic coffee machine used to live back when Wei Wuxian was more of a person than a vague concept. </p>\n<p>“You’re not chatty, that’s alright, I get it,” Wei Wuxian says. “I can talk enough for both of us. My brother used to tell me that one day they’d be trying to bury me and I’d still be yammering as the soil hit my coffin.” He pauses to grin ruefully. “I suppose he wasn’t wrong in the end. Don’t tell him I said that though. The last thing he needs is a bigger head than he’s already got. His ego can hardly fit through doorways as it is.” </p>\n<p>Without so much as blinking, the stranger finishes unpacking the last of the box, breaks it down effortlessly, and leans it by the backdoor. As Wei Wuxian watches, he splits open another. </p>\n<p>“You’re really just gonna unpack the whole damn kitchen, huh? You realize it’ll still be here in the morning, right? Sit down! Get a beer! Order a pizza!” </p>\n<p>The stranger does no such thing. Wei Wuxian watches as he methodically unpacks his belongings with a calm, satisfied aura as if there’s nothing else he’d rather be doing. Wei Wuxian, who had kept his things organized only on threat of death from Madam Yu, cannot even begin to imagine actually doing such a thing out of his own free will. </p>\n<p>Beneath Wei Wuxian’s careful scrutiny, the stranger genuinely spends the rest of the evening carefully unpacking his belongings. Disbelieving, he trails him upstairs where the man unpacks most of his bedroom, and then back down again where he uses his newly tidy kitchen to cook an actual honest-to-god meal, as if he doesn’t have the perfect excuse to laze around and order in. </p>\n<p>Wei Wuxian sits across the table from him, watching him eat in peaceful silence. He feels strangely dumbstruck, infected by the peaceful silence that seems to follow his new roommate wherever he goes. He really doesn’t know what to make of him. Aloud, he says, “You know, this would be a lot more fun if I could get you to react to anything I say at all.” </p>\n<p>Across the table, the man finishes his meal, sets down his chopsticks, and gets to his feet. Predictably, he immediately sweeps his dishes towards the sink to be washed. Wei Wuxian watches him, bemused. He really looks out of time, sleeves rolled politely back as he scrubs sticky rice from his plate, hair neatly trailing down his back, chiseled face almost stone like in the dim kitchen lights. </p>\n<p>“Wish I at least knew your name,” Wei Wuxian says, a little wistful. “It’s kind of lonely, you know? Talking at a complete stranger.”</p>\n<p>The man pulls the plug from the sink and the water rushes away in a rattle. Carefully, he dries his hands and, for a moment, he seems to look right at Wei Wuxian. If Wei Wuxian had a heartbeat, he’s sure it would have stumbled. The man’s eyes are golden and strangely warm when compared to the fine ice of his expression. Wei Wuxian holds his breath. </p>\n<p>A long, tension filled second. The man’s eyes pass by him. Disappointment tastes like ash in Wei Wuxian’s throat. After so long, Wei Wuxian doesn’t know why he even bothers hoping anymore.</p>\n<p>At nine in the evening exactly, the man retires upstairs to his bedroom. Wei Wuxian lingers outside as he brushes his teeth and changes in the bathroom, and then stares after him as he climbs into his fresh sheets like going to bed before ten is the national average and not the most outlandish thing Wei Wuxian has ever seen, this side of the grave or the other. </p>\n<p>It seems to take the stranger no more than a handful of minutes to fall asleep, chest rising and falling rhythmically beneath the blankets. He doesn’t snore, doesn’t drool, doesn’t so much as breathe too loudly. Looking at him like this, Wei Wuxian can’t help but think this is probably what people thought of when they wrote of sleeping beauty, and he grins. </p>\n<p>Squatting down beside the bed, he watches him quietly. “You’re a really strange one, aren’t you?”</p>\n<p>.</p>\n<p>It takes a few days, but eventually Wei Wuxian manages to get the man’s name off a stack of letters on the table by the door. Lan Wangji. Free of worldly concerns. Wei Wuxian has never seen a name so fucking fitting. </p>\n<p>Lan Wangji rises early each morning, Wei Wuxian watching, fascinated, as he neatly makes his bed before sweeping into his bathroom to bathe and emerge as put together as a runway model. He doesn’t even look awful when he wakes up, which Wei Wuxian feels is unfair for the human race as a whole. He tells Lan Wangi as much, sprawling across from him as he eats his breakfast, and running his mouth the whole time as if all he needs to do is fill the air with enough words so that the weight of it all presses down on Lan Wangji’s shoulders. </p>\n<p>It doesn’t work, of course. If it were that easy, Wei Wuxian would have made genuine human contact with one of the house owners years ago now. </p>\n<p>“What do you do?” Wei Wuxian asks, following him around the house as Lan Wangji packs his belongings for the day. “For work, I mean. You have a job, I’m assuming. You’re out of the house enough for it. What is it? A lawyer? Banking? Some boring desk job? Give me something to work with here or I’m going to snoop through your stuff.” </p>\n<p>Lan Wangji, of course, does not reply. Wei Wuxian watches sullenly as his expensive car pulls from the driveway and then, true to his word, goes to snoop. </p>\n<p>His ability to interact with the world at large is a flimsy one even on a good day. He can’t so much as <em>touch </em>things as he can <em>influence </em>them; coaxing chairs to scrape across the floor, or items to leap from their shelves. Reading through the papers on Lan Wangji’s desk requires more finesse than he really possesses, and he makes a spectacular mess as he whirlwinds them around into a position he might conceivably be able to see them in. </p>\n<p>It’s enough. There’s several student papers marked tightly with red ink, and Wei Wuxian recognizes the penmanship that had been written on Lan Wangji’s moving boxes. “A professor,” he observes, and then decides he’s not really all that surprised. If anybody has the patience for teaching, it’d be somebody like him - effortless and regal in everything he does. He feels a little bad for leaving the papers so rumpled and scattered, but fixing them would probably make things worse. He leaves them where they lay.</p>\n<p>He also, to his delight, discovers Lan Wangji’s birth name. <em>Lan Zhan. </em>Lan Wangji suits him, but there’s something about ‘Lan Zhan’ that just brings delight to every inch of Wei Wuxian’s being. He bets Lan Wangji is the kind of person who hasn’t let anybody call him anything other than his courtesy name in <em>years. </em>It’s a pity that Wei Wuxian can’t be the one to break that streak. He’s sure the reaction would be worth it. </p>\n<p>When Lan Wangji comes home from work, he frowns at the mess of papers sitting innocuously in the center of his office floor. “Sorry,” Wei Wuxian says cheerfully. “I told you I was going to snoop. If you want your secrets to remain secret, you should put them in a safer location, you know?” </p>\n<p>Lan Wangji gathers the papers up, stroking out the creases and settling them back atop the desk. Wei Wuxian fight the impulse to send them flying again and hovers obtrusively as Lan Wangji unpacks his bag. “So, you teach, huh? I bet the students are terrified of you. Have you ever thrown chalk at somebody like on TV? I had a teacher that did that once. Who throws chalk at a university student just for talking during class?” </p>\n<p>He chatters at Lan Wangji as they head downstairs, hovering after him and talking a mile a minute, only to be pulled up short when he notices another, equally expensive, car pulling up in the driveway. “You have a visitor! Lan Wangji! Why didn’t you tell me you had a social life!” </p>\n<p>Unfortunately for Wei Wuxian, he can’t follow Lan Wangji out the door, but he hovers at the threshold, peering outside as Lan Wangji steps forward to meet the man climbing gracefully out of the driver’s seat. It’s immediately apparent that this is a relative of Lan Wangji’s - the similarities between their faces are frightening, broken up only by a smoother jawline here, a straighter nose there. </p>\n<p>“Brother,” Lan Wangji greets and the other man smiles. </p>\n<p>“Wangji, you’re looking well.” Lan Wangji’s brother turns to observe the house, eyes skimming right past Wei Wuxian who’s clinging to the doorframe and watching obsessively. “So this is it? It’s bigger than I thought.” He turns his gaze back to his brother. “Are you certain you won’t get lonely by yourself in such a big house?” </p>\n<p>Lan Wangji doesn’t visibly react to the tease. It’s nice to pretend the way he doesn’t interact with Wei Wuxian at all is more to do with his nature than Wei Wuxian’s. “Xichen,” he says, like a scolding. </p>\n<p>Lan Xichen smiles. Like this, the differences between them become even more pronounced. Trying to imagine such an expression on Lan Wangji’s face is enough to nearly give Wei Wuxian an aneurysm. “You know I'm only worried,” Lan Xichen says. “But come, I’ve got something for you.” </p>\n<p>Wei Wuxian watches as they round the rear of Lan Xichen’s car. They open one of the back doors and then, to Wei Wuxian’s absolute bafflement, Lan Wangji gently pulls out a cage which looks to hold <em>rabbits. </em>Actual, real life <em>rabbits</em>. Four feet, fur, and pink noses included. As he stares, Lan Wangji steps back, holding the cage as if it were containing a great treasure. The expression on his face is as blank as ever, but if Wei Wuxian didn’t know better he might say that the look in his eyes is almost <em>soft. </em></p>\n<p>“Do you need a hand?” Lan Xichen asks. </p>\n<p>“The hutch,” Lan Wangji says. </p>\n<p>“Of course.” </p>\n<p>Wei Wuxian watches in amazement as Lan Wangji brings the rabbits through the house and out the back door to the yard, his brother following him with a hefty looking wooden hutch in his arms as it weighs nothing at all. Wei Wuxian trails after them, fascinated. </p>\n<p>The brothers set the hutch up in the yard, and Lan Wangji very carefully lifts each fat little rabbit from the cage and lowers it to sit in the fresh grass. They allow him to with no sign of a struggle, quite content in his palm. Lan Wangji gently brushes his fingers through their fur before he steps back and lets them explore. </p>\n<p>For Wei Wuxian, who has spent days watching Lan Wangji expressionlessly breeze through the house, it’s like witnessing something both monumental and sacred. He can’t do more than stare, faintly open mouthed, and for once be thankful that neither of the two men standing before him can stare back. </p>\n<p>“Thank you for looking after them,” Lan Wangji says, prim and proper. </p>\n<p>“Wangji, please. It was hardly trouble. You’ve raised perhaps the most well behaved rabbits to have ever existed.” </p>\n<p>Lan Wangji <em>raised </em>them? Who is this man, and what has he done with the untouchable deity made of stone and ice than Wei Wuxian has been living alongside? Lan Wangji’s expression doesn’t change, but the gentle way he strokes the nearest rabbit seems almost pleased. </p>\n<p>Wei Wuxian settles in the grass to watch as Lan Xichen vanishes back out to the car, presumably to obtain more items for the rabbits. They clamber happily about, never straying too far from their owner, apparently more enamored with being reunited with Lan Wangji than exploring their strange new world. One of them smears a small grass stain along the knee of Lan Wangji’s impeccable trousers, and Lan Wangji does nothing more than lift it into his lap to keep it out of trouble. The rabbit seems quite pleased with the arrangement. </p>\n<p>“I really don’t know what to say about this,” Wei Wuxian confesses. “I want to tease you, but I’m really just at a loss here. This is the most adorable thing I’ve ever seen, which is saying something because you haven’t met my sister and she’s really stiff competition in that department.” </p>\n<p>Lan Wangji pats the rabbit in his lap a few more times before settling it back into the hutch. Carefully, he collects the others. Each one hops towards him with practiced obedience. Watching the serious faced Lan Wangji cradling an armful of rabbits is enough to nearly kill Wei Wuxian for a second time. “Oh my god, this is it. This is officially too much. I wonder what your students would think if they could see you now. I’d bet anything they’re terrified of you, and yet here you are, herding <em>bunnies.” </em></p>\n<p>Lan Xichen returns with a tote bag and a small wrapped up length of wire fencing. To Lan Wangji, he says, “I’ve got their toys.” </p>\n<p>Wei Wuxian flings his hands to the sky. “You gave them toy! <em>Toys! </em>They’re rabbits! You’re spoiling rabbits! I can’t! I’m out! If I have to watch this for a moment longer I’m going to combust! </p>\n<p>Wei Wuxian goes, vanishing into the ether, but not before catching one last glimpse of Lan Wangji’s golden eyes looking through him, rabbit soft and warm in his arm, and expression beautifully solemn. </p>\n<p><em>How is it possible, </em>Wei Wuxian thinks before he dissipates, <em>that somebody so unerring perfect can even exist? </em></p>\n<p>.</p>\n<p>The rabbits prove to be an excellent addition to the household in the end. Wei Wuxian had quietly worried they might eat his flowers, but Lan Wangji erects a generous fence around their hutch to keep the two apart, and Wei Wuxian is incredibly grateful. </p>\n<p>During the day, when Lan Wangji is out of the house, Wei Wuxian makes it a habit to bother his rabbits instead. Animals, Wei Wuxian has long since come to learn, have far more spiritual awareness than humans, and rabbits, unlike vicious, horrible <em>dogs, </em>can’t bark and bite at him when he approaches. </p>\n<p>He can’t pick them up, but he contents himself with stroking along their backs. Sometimes they even let him, which makes Wei Wuxian incredibly smug. It’s nice to be acknowledged for a change, even if that acknowledgement is coming from a handful of fluffy rodents who live in the backyard of a house that isn’t even legally his anymore.</p>\n<p>True to his prediction, Lan Wangji spoils the things terribly. Most evenings, he sits outside in the comfortable backyard chairs, letting the rabbits roam about as he studiously marks essay after essay with a red pen that is as sharp as the cutting grades he leaves. Wei Wuxian joins him, settling in the spare chair that is just near enough that if he weren’t a ghost he could kick at Lan Wangji’s feet. </p>\n<p>It’s been nearly a month since he moved in, and so far Wei Wuxian hasn’t done… well, much of anything, really. He makes a mess sometimes, when his curiosity gets the better of him, and sure, he’s whittled away more than a few nights sitting by the kitchen windowsill whistling for his flowers, but as far as genuine, bona fide hauntings go? Lan Wangji’s getting off exceptionally lightly. </p>\n<p>The last person who had owned this house had left when he came downstairs for breakfast one morning to discover all the chairs promptly stuck to the ceiling. It’d taken a lot out of Wei Wuxian to manage that little trick, but it had been more than worth it for the expression on the guy’s face when he bolted out the door and halfway down the street, bare-foot and screaming. In comparison? He’s practically being <em>friendly </em>here. </p>\n<p>It’s just… Lan Wangji is interesting. Well, mostly he’s <em>boring, </em>but that’s what makes him so interesting! He’s quiet and self-contained, and sticks to his schedule with rigorous, unbending enthusiasm. And he also loves rabbits, and Wei Wuxian has caught him watching gameshows with genuine interest in his eyes, and has an actual <em>guqin </em>that he plays nightly. And every time Wei Wuxian manages to sneak a look at all the essays he’s marked for his students the comments are… maybe not encouraging, but they’re honest and never harsh; a complete lack of judgement, even alongside the most <em>stupid </em>of errors, and boy, some of his students can really make some stupid errors.</p>\n<p>He’s also probably the most beautiful person Wei Wuxian has ever seen, but that’s neither here nor there. </p>\n<p>So maybe Wei Wuxian likes him a lot. Has grown fond of him. It’d be a shame to send him packing when finally - <em>finally - </em>there’s somebody around here who knows how to water a garden and has been nothing but respectful to Wei Wuxian’s home. Just maybe he wants Lan Wangji to stick around for as long as he can be convinced. </p>\n<p>It does make him a little lonely though. Liking somebody for a change and still not being able to get anything out of it. But Wei Wuxian mastered the fine art of managing expectations before he even learnt to speak, and disappointment is a constant companion he’s grown comfortable living with. </p>\n<p>Tonight, it must be cool out, because Lan Wangji sits with a shawl draped delicately over his shoulders. One or two rabbits are asleep by his feet, but the rest have retired to the hutch for the evening. The sun is just starting to set, and the soft glow of the patio light overhead softens the chiseled edges of Lan Wangji’s perfect face. </p>\n<p>“You know,” Wei Wuxian says, leaning forward so he can watch the scritch of Lan Wangji’s pen across the paper. “When you first moved in, I thought you were going to be a real stick in the mud. You’ve got that aura; all stiff, no fun. You’d get along with Jiang Cheng, I think. The both of you can really pull down a party with your moods.” </p>\n<p>Lan Wangji shuffles the paper, moving onto the next essay. He pauses for a moment, frowning at something he’s reading, before scratching it out pointedly. Wei Wuxian can’t help but smile. </p>\n<p>“Poor kid,” Wei Wuxian says. “You’re going fairly easy on them, honestly.”</p>\n<p>Lan Wangji makes no reply. A faint breeze ruffles his hair, blowing it over his shoulder, and Wei Wuxian is seized with the desire to tuck it behind his ear and out of the way. He’s halfway towards doing just that before he remembers he <em>can’t </em>and his hand drops midair. Of course, Lan Wangji doesn’t so much as look up, but Wei Wuxian clears his throat awkwardly. “Anyway, what I meant to say is that you’re really… you’re really something, you know that? Something special. Something <em>good. </em>I can feel it. I have an intuition for these sorts of things.” </p>\n<p>One of the rabbits by their feet sneezes and Lan Wangji immediately glances at it, gaze concerned. He sets his papers aside, reaches down, and gently hauls it into his lap. A moment later the shawl disappears from his shoulders and is draped across his thighs, tucking the rabbit up tight. </p>\n<p><em>Oh, </em>Wei Wuxian thinks, staring at the soft picture they both make, and the hollow ghost of his heart almost beats. <em>Oh. </em></p>\n<p>Aloud, he says, “How much do you think your brother would pay me for a picture of this? I’m betting a lot. He seems to dote on you almost as much as you dote on those bunnies.” </p>\n<p>Lan Wangji reaches for his papers again, one hand careful to keep the rabbit in his lap balanced. </p>\n<p>“I can’t believe even your brother calls you Wangji,” Wei Wuxian says. “Doesn’t anybody use your given name? They can’t all be too scared. Somebody out there has to know you’re a big softie. I can’t be the only one.” He pauses, and then adds, teasingly, “Or maybe I am. I wouldn’t mind. Being the only one to see you like this. Being the only one to call you by your given name.” </p>\n<p>Lan Wangji has his papers in one hand, the other gently pressed to the soft fur of the rabbit. The way the wind had blown his hair aside has left the graceful curve of his neck exposed, the shell of his ear, and Wei Wuxian can’t help himself. He leans forward, hand on Lan Wangji’s chair as if he needs the balance, and daringly breathes, <em>“Lan Zhan.” </em></p>\n<p>Lan Wangji freezes. His eyes go wide and the tips of his ears go red. He whips around and stares <em>right at Wei Wuxian. </em></p>\n<p>It all happens so quickly that it takes Wei Wuxian a shaky second to realize it’d happened at all. Lan Wangji’s startled gaze is locked with his own. There is absolutely no way Wei Wuxian is imagining it - not this time. Lan Wangji had <em>heard </em>him - he was <em>seeing </em>him. </p>\n<p>“Oh,” Wei Wuxian blurts, because his mind is tripping over itself, a mess of misfiring thoughts, of panicked realizations. “I… Lan Zhan, can you see me?” </p>\n<p>Lan Wangji does not move. The fingers he has in the rabbit’s fur tighten, just ever so slightly. </p>\n<p>Swallowing, Wei Wuxian asks, “Have you… been able to see me this whole time?” </p>\n<p>Lan Wangji does not need to nod. The look on his face is enough. If there is one thing Wei Wuxian has come to realize during their tentative, silent cohabitation, it’s that Lan Wangji cannot lie if his life depends on it. </p>\n<p>“This whole time,” Wei Wuxian repeats, slightly dizzy with the thought of it. </p>\n<p>Lan Wangji hesitates for a second, and then he says, “Wei Ying…” </p>\n<p>That’s enough. That’s more than enough. <em>This whole time. </em>He knows Wei Wuxian’s name because he’d heard it the very first day when Wei Wuxian had introduced himself. He’s known this whole time. He’s heard every word Wei Wuxian’s ever said to him, and there really has been quite a lot of words. </p>\n<p>Wei Wuxian has never been good with confrontation, and embarrassment has always been something that happens to other people. Right now, he’s staring down both of them, and it isn’t a pretty sight. </p>\n<p>Lan Wangji’s mouth opens, but whatever he’s going to say Wei Wuxian doesn’t stick around to hear. </p>\n<p>He’s gone before he can even realize he plans to go at all. </p>\n<p>.</p>\n<p>It takes the better part of a week before Wei Wuxian finds himself existing again. </p>\n<p>The downside to his little stunt is by slinking away to lick his wounds by ceasing to be, he’s really not solved any problem whatsoever. He still feels mortified, and the first time Lan Wangji finds him keeping the flowers company by the kitchen window, his eyes widen ever so slightly in surprise.</p>\n<p>“Wei Ying,” he says, in a voice that almost sounds concerned. “I -” </p>\n<p>Wei Wuxian vanishes away before he can find out what Lan Wangji plans to say next. He thinks if Lan Wangji can spend a whole month pretending that he’s completely unaware of Wei Wuxian’s entire existence, then Wei Wuxian is entitled to sulk like a child for as long as he so wants. </p>\n<p>Half of it is the genuine embarrassment of having to face up to all the things he may have said when he wasn’t aware that he was being heard, and the other half is the sting of finally having somebody who could share the burden of his loneliness and having them silently decline it without so much as a word. Lan Wangji has had<em> weeks </em>to talk to him - the fact that he only seems to want to now that the big secret is out robs Wei Wuxian of any possible gratitude. </p>\n<p>So he’s petty. Sue him. He never claimed to be otherwise. He’s been stuck in this goddamn prison of a house for <em>years, </em>both alone and lonely. His interpersonal skills have grown dusty with disuse, and his resolution skills were never all that impressive to begin with. </p>\n<p>For three days, Wei Wuxian manages to avoid Lan Wangji. Whenever he’s out of the house, Wei Wuxian roams about as normal - spends time with his flowers and the rabbits. Upends Lan Wangji’s office a little if he’s feeling particularly grumpy. When Lan Wangji comes home, Wei Wuxian wills himself away before he can try for another conversation. </p>\n<p>Lan Wangji’s golden eyes watch him shimmer in and out of existence with what seems like a building resignation. Every time Wei Wuxian sees him, his mouth is pressed thinner and thinner. He’s not even putting up a token effort of pretending not to see him anymore, staring right at him the moment he enters a room to find Wei Wuxian had already laid claim to it. </p>\n<p><em>Good, </em>Wei Wuxian thinks, a little peevishly. <em>Let’s see how you like being ignored for a change. </em></p>\n<p>Wei Wuxian whistles loudly through the nights, an unnerving tune he’d perfected three hauntings ago, and although Lan Wangji still goes to bed at nine PM like an old man, he can tell by the creaking upstairs that he’s not sleeping the night through. He scatters papers on Lan Wangji’s desk, rearranges the furniture into a chaotic mess, loosens the bolts in the upstairs sink. Mean spirited pranks that Wei Wuxian is sure he’ll feel bad about when the worst of the hurt blows over. </p>\n<p>He’s not made for holding grudges, but he channels Jiang Cheng best as he can and pretends as if he’s more mad than embarrassed, and more embarrassed than stung. It doesn’t work, but Wei Wuxian is very good at turning a blind eye to the lesser parts of his personality when he wants to.</p>\n<p>On day four, Wei Wuxian sits himself in the next room over to Lan Wangji’s and begins his now nightly ritual of whistling loudly and obnoxiously, leaning against the wall it shares with Lan Wangji’s bedroom for maximum effect. He’s just really getting into the flow of it when there’s the sound of footsteps outside the door and he trails off, tensing, ready to flee downstairs if he needs to. </p>\n<p>The door does not open, but Lan Wangji says, “Wei Ying.” </p>\n<p>Wei Wuxian stops whistling but he does not answer. He doesn’t think he’s actually said a word since their last fateful conversation. He can feel the itch of it in the back of his throat; Wei Wuxian was not a person meant to stay silent for this long. </p>\n<p>“I understand if you do not wish to talk to me,” Lan Wangji says. Wei Wuxian can’t see his face, but he thinks he hears a faint hint of sorrow in his tone. “I did not mean to upset you, and I do not intend to make you uncomfortable. I am sorry.” </p>\n<p>Wei Wuxian’s shoulders snap tight. He twists his hands in his lap, squinting at the door. Lan Wangji does not lie. He knows this. He’s never met a more silent, respectful man. They haven’t even needed to have a real conversation - one with both of them talking - for Wei Wuxian to understand that he’s a man of principles. </p>\n<p>He should say something. Something snappy, something witty. Something that lets Lan Wangji know he’s listening. Something that lets Lan Wangji know that even Wei Wuxian is sick of the way he’s acting. Something that lets him know that he’s not <em>mad </em>he’s just… he’s just a little hurt, and a lot confused. It’s not like Wei Wuxian has exactly had a lot of experience in situations like this. </p>\n<p>His silence must stretch for too long because Lan Wangji says, “Thank you for hearing me out. Goodnight.” </p>\n<p>His footsteps retreat from the door. From the bedroom, there’s the sound of the bed creaking. </p>\n<p>Wei Wuxian sits in the late night silence, the moon painting silver shadows over the dark floorboards. He stares down; at the ghastly pale hands tangled in his lap, at the way his feet don’t touch the floor. There is no sound from the other side of the wall. </p>\n<p>Slowly, tentatively, Wei Wuxian starts whistling again. Not his old tune, the one he’d used to chase out the unworthy from his house, but something softer, sweeter - a song Yanli used to sing to him when he was a child, soothing and warm. </p>\n<p>There’s a faint creak from the other side of the wall, as if Lan Wangji has rolled over in his bed. Wei Wuxian imagines him facing the wall Wei Wuxian is leaning against and he almost smiles. </p>\n<p>He does not stop whistling until he can hear the soft, faint sounds of sleep from behind him. </p>\n<p>.</p>\n<p>The next day, a car pulls into the drive while Lan Wangji is at work. Wei Wuxian, who has been lingering upstairs and debating existence, peers out the window, watching as Lan Wangji’s brother calmly steps from the car and strolls to the door. He can hear the sound of a key in the lock turning and, drawn by his curiosity, floats downstairs. </p>\n<p>Lan Xichen closes the door behind himself, looks Wei Wuxian in the eye and says, “You’ll have to forgive me for not introducing myself earlier. I’m Lan Xichen, Wangji’s older brother. You’re Wei Wuxian, yes?” </p>\n<p>Caught off guard, Wei Wuxian blinks at him for a moment, gaping, before he asks, “Great, so you’ve been able to see me this whole time too? What is <em>with </em>you two? And I thought I was the one who lacked any manners!” </p>\n<p>Lan Xichen smiles at him, something polite and genuinely amused. “I’m sorry. Let’s have some tea and sit down for a chat, shall we?” </p>\n<p>He heads to the kitchen and, without quite knowing why, Wei Wuxian follows after him. True to his word, Lan Xichen makes the both of them tea with enough confidence that Wei Wuxian might be convinced that this was his own house if he didn’t know better. He sets Wei Wuxian’s cup down on the side of the table opposite to him and gracefully takes his seat. He looks so expectant that Wei Wuxian can’t help but join him, fingers curling uselessly around the intangible heat of the porcelain he can’t even touch. </p>\n<p>“You know I can’t drink this, right?” Wei Wuxian asks. </p>\n<p>“That’s no reason to be rude,” Lan Xichen says, calmly sipping his own cup. </p>\n<p>“I can pour it on the floor if that would help the illusion,” Wei Wuxian offers. </p>\n<p>The corner of Lan Xichen’s mouth twitches. “That won’t be necessary. Wangji would forgive you much, but a sticky mess on his kitchen floor is probably not what he hopes to return to after work.” </p>\n<p>“Does he even know you’re here?” Wei Wuxian asks with a dawning suspicion. </p>\n<p>“Not as such,” Lan Xichen says, which, as an older sibling himself, Wei Wuxian recognizes as code for <em>‘I’ve taken it upon myself to meddle in his matters’. </em>“Although I imagine if he really did not want me to visit, he would not have taken care to tell me that he’d decided to make contact with you.” </p>\n<p>Wei Wuxian snorts. “Make contact? What am I, a sexy new alien race? I don’t know if you can really call what happened ‘making contact’. More like, I caught him out in a big fat lie.” </p>\n<p>“I can see how you might view it like that,” Lan Xichen says calmly, “but you have to understand, you are not the first ghost we’ve encountered, nor do I anticipate you will be the last. This is an ability descendants of Lan ancestry have been living with for all of their lives, and we are taught from a very young age how to manage it.” </p>\n<p>Wei Wuxian raises a brow. “Manage it? By that, you mean ignore it.” </p>\n<p>“Not quite,” Lan Xichen says. Then, throwing Wei Wuxian for a loop, he asks, “Have you ever seen a ghost, Wei Wuxian?” </p>\n<p>Wei Wuxian stares at him for a second then waves a hand to encompass his own general existence. “Every time I float past a reflective surface, yeah.” </p>\n<p>“Other than yourself,” Lan Xichen clarifies, and there’s the faint hint of a smile at the corner of his mouth. </p>\n<p>Wei Wuxian shakes his head. </p>\n<p>“Of course you haven’t,” Lan Xichen says, not unkindly. The steam from his tea fogs around his pretty face. Up close like this, Wei Wuxian can see all the little similarities he shares with his brother, and all the differences too. “Because the ability to understand the dead is rare, and the ability to survive contact with them is even rarer.” </p>\n<p>Wei Wuxian blinks startled. “What does that mean?” </p>\n<p>“Ghosts, in general, are not kind creatures, Wei Wuxian,” Lan Xichen says softly. “The longer they linger, the more resentful they grow and the lonelier they become. How long have you been here, if you don’t mind me asking?” </p>\n<p>For a second, Wei Wuxian hesitates, but he can’t see a reason not to admit it. “Three years, I think. It’s… hard to keep track of time.” </p>\n<p>“And your death?”</p>\n<p>Wei Wuxian shrugs. “I don’t remember.”</p>\n<p>Lan Xichen does not look surprised by this. “How do you feel?” </p>\n<p>“What do you mean?” </p>\n<p>“You know what I mean, I think.” </p>\n<p>Wei Wuxian does. He looks to the tabletop, scratching absently at the grain of the wood. “Better now,” he says. “But I used to be… not so good.” </p>\n<p>Lan Xichen does not ask him to clarify. “Imagine then, please, how you would feel if you were still here like this ten years from now; fifty, a hundred, maybe even more. And then a young man moves in, and you found out that he can see you for the first time in all of those endless years. How do you think you would feel then?” </p>\n<p>“I wouldn’t hurt Lan Zhan,” Wei Wuxian protests. “I’m not like that! I don’t hurt people! I don’t…” </p>\n<p>He thinks, then, of a young boy sitting in the back of a car; stitches in his face and the ghost of Wei Wuxian’s touch bruising along his pale skin. The frightened, empty look in his eyes as they drove away, and the feeling that tasted like blood weighing heavy in Wei Wuxian’s still heart. </p>\n<p>His silence must speak volumes to Lan Xichen, because he reaches out and lays his gentle fingertips on the tabletop an inch from Wei Wuxian’s own. “Maybe you won’t,” he says. “But how is Wangji to know that? All we know is what you are capable of, and I can promise you that Wangji has seen more than once peaceful ghost turn resentful over nothing more than finally having an ear to listen to their outpouring of grief.” </p>\n<p>Wei Wuxian feels strangely caught out, overly aware of the heavy pressure of Lan Xichen’s eyes boring into his own. He glances away and summons up a cheerful, wide smile, trying to chase away the tacit warning lingering at the edge of his words. He says, “So what? You came here to vouch for Lan Zhan’s character? Convince me he’s not as frigid as he looks?” </p>\n<p>Obligingly, Lan Xichen pulls back, gracefully allowing the abrupt change in topic. “I don’t think you need me for that,” he says. “You’ve seen how many rabbits he owns.” </p>\n<p>Wei Wuxian laughs. “I can’t blame him, they are really cute. Sometimes they even let me pet them.” </p>\n<p>Lan Xichen smiles. “If you appreciate them, I can see why Wangji’s become so taken with you.” </p>\n<p>Wei Wuxian’s laughs trails off awkwardly. “Well,” he says, “we’ve only had like… maybe one conversation. I think it’s a bit soon to be even saying we’re friends.” </p>\n<p>Lan Xichen’s expression is peaceful and equally ambiguous. Wei Wuxian does not know what to make of it in the slightest. He gets to his feet. “It’s been a pleasure to finally meet you,” he says. “I told Wangji you seemed harmless enough, but I think by that point so long had passed that he wasn’t sure how to begin breaking the ice, so to speak. If you hadn’t approached him first, I promise you that he was working up to it.” </p>\n<p>Wei Wuxian decides not to say that ‘approaching him’ had really been more of embarrassing them both by being a flirtatious tease, emboldened by a false sense of security and the way Lan Wangji looked in the glow of the light evening. He follows Lan Xichen to the door, trying not to be obvious when he asks, as casually as he can, “You’ll come visit again, right?” </p>\n<p>The look Lan Xichen gives him is indulgent. “Wei Wuxian, my brother lives here. I’m sure you’ll find that you’ll be seeing plenty of me.” </p>\n<p>Wei Wuxian is sure he looks stupidly relieved at that, but he can’t help it. <em>This </em>is the first proper conversation he’s had in years. Lan Wangji is - well. He’s something, that’s for sure. But when he was alive, Wei Wuxian thrived on attention the way a garden might thrive in the sun. The prospect of having some of it again, after all this time, is too good to pass up. He’s never done well alone. He is not a solitary creature. </p>\n<p>Lan Xichen opens the door and steps outside, only to pause, considering. </p>\n<p>“What? Forget something?” </p>\n<p>Lan Xichen turns to face him, one hand on the door jamb and says, “Wei Wuxian, I find you to be an interesting and kind person. I believe you when you say you have no ill intentions towards my brother.” </p>\n<p>“Oh,” Wei Wuxian says, surprised. “Uh. Thanks?” </p>\n<p><em>“But,” </em>Lan Xichen says, voice suddenly as sturdy as the walls stopping the roof from falling down above their heads, “I want you to know that if I ever think you’re a danger to Wangji, I will exorcise you so quickly that you will not even have the time to wonder what went wrong.” </p>\n<p>Wei Wuxian stares at him blankly. If he had any breath in him, he think it might be going sour in his frozen lungs. </p>\n<p>Lan Xichen smiles pleasantly. “Thank you for your time,” he says, and steps back, closing the door, leaving Wei Wuxian dumbstruck on the threshold. </p>\n<p>.</p>\n<p>Lan Wangji is late home that night, and Wei Wuxian blows through about a solid dozen reasons why that might be, each more nerve wracking than the last, before headlights finally cut through the gloom of the living room windows. The relief Wei Wuxian feels is only eclipsed by the doubt eating at the calm he’s worked all day to build since Lan Xichen left, but if there was one thing he has always had in abundance, it’s confidence. </p>\n<p>He takes his place by the door, smoothing out his hair as if the death might be capable of beating the flyaway strands into submission where life had failed, and clears his throat expectantly. There’s the turn of Lan Wangji’s key in the lock, and Wei Wuxian straightens his back and pastes on what he hopes is a fairly good imitation of a smile as the door opens. </p>\n<p>It’s evident that the last thing Lan Wangji had been expecting was Wei Wuxian waiting at the door like an overly enthusiastic pet and he pauses on the doorstep, minute surprise in his mild features. Wei Wuxian takes the opportunity to enthusiastically say, “Lan Zhan! You’re home late today! I was just starting to get worried that maybe your students ate you alive after seeing the grades you gave them all on those last essays. I’d really hate to have to break the news to your rabbits though, so I’m glad you managed to make it back.” </p>\n<p>Lan Wangji stares at him silently for so long that Wei Wuxian’s confidence falters on its shaky foundation. He’s just beginning to think about launching into another monologue when Lan Wangi says, “I had a faculty dinner.” </p>\n<p>The relief that hits Wei Wuxian is immeasurable. As far as conversation starters go, it’s weak, but Wei Wuxian’s silver tongue can spin anything to gold if he tries hard enough. “And I bet you ordered the most boring dishes on the menu. Did it give you indigestion having to eat at a different hour than normal too?” </p>\n<p>Lan Wangji’s brows pull down, just ever so slightly, and he finally steps inside, closing the door behind him. “My brother came to see you,” he says, and it’s a statement, not a question. </p>\n<p>Wei Wuxian winces. “Okay, we’re really just going to jump into it then, aren’t we? Haven’t you ever heard of subtlety, Lan Zhan?” </p>\n<p>Lan Wangji looks at him expectantly and doesn’t answer. </p>\n<p>Wei Wuxian admits, “He may have dropped by. We had tea.” </p>\n<p>“Tea,” Lan Wangji repeats, sounding faintly dubious. His eyes drop down to where Wei Wuxian’s feet don’t quite seem to settle properly on the floor, existing on another plane of reality, and then back up again. His meaning is plain. </p>\n<p>“Yeah,” Wei Wuxian says, smile broadening. “That’s what I said! No sense wasting good tea over something as stupid as manners, but your brother insisted.” </p>\n<p>“Hm,” Lan Wangji says, and he turns away, heading towards the stairs. </p>\n<p>Wei Wuxian breathes out a wholly unnecessary breath. With the unfathomable weight of Lan Wangji’s gaze lifted from him, he feels as if he passed some kind of test that he didn’t know the both of them were participating in. It surprises him, honestly, how <em>easy </em>it had been once he’d gotten over the worst of his fear and pride and opened his mouth. He follows after Lan Wangji to his office where he is, as is his routine, unpacking his laptop and supplies upon his desk. </p>\n<p>“I think the rabbits are hungry,” he says. “They finished what was in their hutch earlier.” </p>\n<p>Lan Wangji doesn’t look up as he calmly says, “We will go feed them in a minute.” </p>\n<p><em>We. </em>Heat blooms warm and comforting in Wei Wuxian’s gut and he’s glad Lan Wangji isn’t looking at him because the smile that slips onto his face feels chaotic in its sheer immeasurable delight. He mouths it to himself silently - <em>we - </em>and it tastes a lot like how he remembers sunshine feeling on his skin. </p>\n<p>“Yeah, okay,” Wei Wuxian says. “Easy.” </p>\n<p>And it is. After that, it really becomes that goddamn easy. Wei Wuxian’s no prophet, but he thinks it sounds a lot like something unshakable and new, weaving together a foundation for something truly awe inspiring to build upon. </p>\n<p>\n<em>We. </em>\n</p>\n<p>.</p>\n<p>Wei Wuxian and Lan Wangji become inseparable. Well, perhaps it may be more accurate to say that Wei Wuxian latches onto Lan Wangji with the characteristic annoyance that saw him through all his close relationships in life, and Lan Wangji bears it with a surprising amount of grace. </p>\n<p>He follows Lan Wangji around the house, chattering aimlessly, and although their conversations don’t grow all that less one sided, at least now he can tell Lan Wangji is <em>listening. </em>Every now and again he’ll contribute a soft sentence, or incline his head if he thinks Wei Wuxian’s made a particularly valid point, and it gives Wei Wuxian imaginary heart palpitations every time. </p>\n<p>It becomes his new goal; drawing engagement out of Lan Wangji in whatever form he can have it. At first, he thought it’d be like trying to get blood from a stone, but Lan Wangji surprises him by not being nearly reticent as he’d thought. He’s quiet, but not taciturn. Wei Wuxian comes to learn that Lan Wangji is sparing with his words because to him they’re valuable, and he sees no sense in wasting them. To Wei Wuxian, who’s always found conversation careless and free, it’s an interesting but not necessarily unpleasant dynamic to observe. </p>\n<p>They watch Lan Wangji’s game shows together, and Wei Wuxian obnoxiously guesses most of the answers and is both right and wrong in fairly equal measure. </p>\n<p><em>“Which one of these actors won an Emmy for their performance in a renowned 2018 drama?” </em>asks the game show host, grinning winningly out of the broad screen to where Lan Wangji is calmly typing at his laptop on the sofa, Wei Wuxian sprawled next to him.</p>\n<p>“Answer C,” he says clearly to the TV with an unwarranted amount of confidence. </p>\n<p>“You were already dead when this movie came out,” Lan Wangji says bluntly, not looking up. </p>\n<p>It should be rude, but it just makes Wei Wuxian smile. “Maybe,” he says, “but that doesn’t mean I can’t watch TV as a ghost, Lan Zhan. Other people lived here before you did.” </p>\n<p>Lan Wangji looks up, unimpressed. “Have you seen it?” </p>\n<p>“Nope,” Wei Wuxian says cheerfully. </p>\n<p><em>“The answer is D!” </em>hollers the TV. </p>\n<p>When Lan Wangji is at work, Wei Wuxian finds that he spends most of his time just waiting for him to return. It’s kind of pathetic, really, but Wei Wuxian’s social circle is what one might call <em>strictly limited </em>so he thinks he can be forgiven for becoming overly attached far too quickly. In any case, the only ones to witness his hopeless moping are his flowers and Lan Wangji’s rabbits, and neither of them are going to rat him out. </p>\n<p>Once or twice a week, Lan Xichen joins them for dinner, and although Lan Xichen tells Wei Wuxian that they’d been raised to be silent during meal time, Wei Wuxian cheerfully points out that he, as a ghost, cannot eat actually and so is not bound by any such restriction. The dinner table is as full of lively one sided conversation as any other place in the house, and he’s absolutely <em>delighted </em>when Lan Wangji never shushes him. </p>\n<p>It’s during one such meal, just as Lan Xichen is setting the table, that he turns to Wei Wuxian and asks, “You’re more than welcome to try the food.” </p>\n<p>Wei Wuxian snorts and pointedly swipes his hand through the tabletop in front of him. “I thought we talked about this when you offered me tea,” he says. “Any food I try and touch is going right to the floor.” </p>\n<p>“I’m not talking about consuming it physically,” Lan Xichen says, remarkably patient. “I’m talking about partaking of its essence.” </p>\n<p>Wei Wuxian squints at him. “Partaking of its <em>what?” </em></p>\n<p>Lan Xichen frowns ever so softly and turns a disapproving eye to his brother. “You didn’t tell him?” </p>\n<p>Lan Wangji sets down the last of the bowls for the evening meal expressionlessly. “He didn’t ask,” he says. “I presumed he knew and was uninterested.” </p>\n<p>Lan Xichen turns back to Wei Wuxian who is watching, baffled. “Why do you think people leave offerings to the dead, Wei Wuxian? When it comes to food, if the flavor is particularly strong, you may be able to taste but trying.” </p>\n<p>“Oh!” Wei Wuxian has overseen many family meals in this house, but the food at the table was just another part of the human world that had become shut off to him. He’d never even attempted to sample it. What was the point? He was dead. Food wasn’t doing much good for him now anyway. “I… didn’t know.” </p>\n<p>Lan Xichen nods, understanding, and plucks one of the dishes from his side of the table, setting it down before Wei Wuxian. “You’re young, as far as ghosts go. You haven’t had time to figure much out. That’s understandable. Here, try this.” </p>\n<p>Wei Wuxian stares down at the warm broth swirling in the bowl before him. Faintly, if he really focuses, he can smell something bitter and also sweet. He looks up and awkwardly asks, “How do I do this?” </p>\n<p>Lan Wangji takes his seat beside his brother. “Breathe it in,” he advises, as if this is perfectly natural advice to give somebody who hasn’t taken a genuine breath in years.</p>\n<p>Wei Wuxian looks skeptically to Lan Xichen but he just offers him a kind smile. He looks back to the soup. Both of the brothers are watching him, and for a second Wei Wuxian worries he’s going to get stage fright. He settles his hands around the bowl. He can’t feel the heat of the broth, the hard press of the ceramic, but he pretends that he can. He closes his eyes and takes the deepest breath that he can manage. </p>\n<p>The faint smell becomes a <em>taste, </em>just barely; the lingering after effect of a meal and not much more. The flavor, if it can be called that at all, is mild at best. It’s too weak to be unpleasant, but it’s not something Wei Wuxian would have ever willingly consumed in life. </p>\n<p>He looks up, meeting the expectant eyes of the brothers, and smiles. “Sorry,” he says. “It’s kind of weaker than I thought it would be.” </p>\n<p>Lan Xichen doesn’t look surprised. “I suspected it might be. The flavors our family favors are not particularly encouraging to ghosts.” </p>\n<p>Wei Wuxian wonders if that’s by design but he thinks that might be rude to ask. Instead, he says, “Well, it doesn’t matter. I’ve gone this long without it. Don’t worry about me.” </p>\n<p>Lan Xichen allows the conversation to change with a gentle nod of his head, and Wei Wuxian sits there, cradling the bowl in his intangible hands as he chatters about something entirely unrelated, pretending as if the small kernel of disappointment in his gut isn’t attempting to flower. </p>\n<p>It’s stupid. It’s just that Wei Wuxian hadn’t realized how much he missed something as simple as <em>taste </em>until he almost had the chance to have it back again. He’ll be damned if he lets the brothers feel guilty about it though, so he smiles cheerfully ignoring the curious way Lan Wangji is staring at him. </p>\n<p>The next night, it’s just them for dinner, and Lan Wangji politely asks him to check on the rabbits while he cooks. It’s not an unusual request, so Wei Wuxian thinks nothing of it until he flits back to the dining table as Lan Wangji is setting down the meal only to realize that a place has been set for him. </p>\n<p>He’s pulled up short. “Lan Zhan,” he says. “You really don’t have to. Don’t mind what your brother said. This is just a waste of food.” </p>\n<p>Lan Wangji doesn’t acknowledge him, just slips into his chair and glances pointedly at Wei Wuxian until he takes the hint and joins him. The moment he does, he realizes something is different from last night, and all the nights he’s spent here with Lan Wangji watching him eat. </p>\n<p>The food Lan Wangji cooks always looks good from a purely professional standpoint, but the food sitting in front of Wei Wuxian looks good to <em>him. </em>There’s a sheen of red atop everything spread in front of him. This time Wei Wuxian doesn’t need to think about it - he breathes in deep enough that it hurts. </p>\n<p>Spice. Hot and warm on his tongue. He can’t help but take another breath, savoring it desperately. Death has robbed the depth of the flavor from him, but to be able to taste it at all is… is something Wei Wuxian hasn’t been able to experience in three years.</p>\n<p>“Is it good?” </p>\n<p>Startled, Wei Wuxian looks up and when his gaze lands on Lan Wangji he sees that the expression on Lan Wangji’s face might almost be called a <em>smile. </em>It’s just the tiniest upturn of the corner of his mouth, a softness in his eyes, but it’s enough to nearly lay Wei Wuxian flat. He’s so overwhelmed that for a moment all he can do is blurt, “Lan Zhan - <em>how?” </em></p>\n<p>“You told me you prefer spicy food,” Lan Wangji says. </p>\n<p><em>“Weeks ago,” </em>Wei Wuxian says. “Back when I wasn’t even sure you could hear me.” </p>\n<p>“A stronger flavor helps to experience it after death,” Lan Wangji says, which isn’t really a response to what Wei Wuxian said at all. “Especially if it’s a flavor you enjoyed in life.” </p>\n<p>Wei Wuxian doesn’t know what to say. He breathes in again, desperately, hungrily. His eyes feel as if they’re burning and it has little at all to do with the spice on his tongue. Horrified, he realizes he’s very close to crying, which is something he didn’t even know he could <em>do, </em>and he works to choke it back. “Lan Zhan,” he says, when it feels safe enough to speak, “<em>thank you.” </em></p>\n<p>“There is no need for thanks,” Lan Wangji says, and the thing is, Wei Wuxian can tell he genuinely <em>means </em>it. </p>\n<p>Wei Wuxian strongly disagrees. This is the nicest thing somebody has done for him in a long, long time - predating his death, and perhaps even the years before that. He doesn’t know how to say that though, how to tell Lan Wangji that the gift he’s given Wei Wuxian is larger than one simple meal. </p>\n<p>In the end he doesn’t. He can’t. Lan Wangji seems to understand and he grants Wei Wuxian his peace to put himself back together. </p>\n<p>Wei Wuxian watches him from across the table; the inky black of his hair, the beautiful gold of his eyes, the calm but not unkind expression on his face. Wei Wuxian’s stomach flips but he can’t make himself look away. </p>\n<p>It’s perhaps the first meal they’ve ever passed quietly. Wei Wuxian discover that with Lan Wangji, maybe silence is not such a terrible thing. </p>\n<p>.</p>\n<p>The first indication that anything at all is wrong comes one night when Wei Wuxian is hovering over Lan Wangji’s shoulder, adding his cheerful commentary to the seemingly endless stack of papers he’s grading. </p>\n<p>“You should just fail him if he can’t even get the key dates of a major world conflict right,” Wei Wuxian says. “What’s he even doing taking history? His talents are wasted on you, Lan Zhan. Send that kid somewhere more creative.” </p>\n<p>Lan Wangji diligently marks the mistake and turns the page, completely unbothered by Wei Wuxian’s faded hands pressing against the back of his chair. “He wanted to take the course,” he says. “I’ll mark him accordingly.” </p>\n<p>Wei Wuxian gives a fond smile. “No leniency at all, huh?”  </p>\n<p>Lan Wangji doesn’t reply, but Wei Wuxian doesn’t need him to. The silent hum he gives under his breath as his pen scratches against the paper is an entire answer in its own right. Wei Wuxian feels as if over the past two months he’s gotten better and better at translating all the little micro expressions that make up Lan Wangji’s communication. He opens his mouth to say something, only to feel a faint tug in his gut. </p>\n<p>It’s so minute that, had he been alive, Wei Wuxian may have missed it, but as it is Wei Wuxian hasn’t felt <em>anything </em>at all in many years. The back of his neck prickles uneasily. </p>\n<p>“Wei Ying?” </p>\n<p>Wei Wuxian hadn’t even realized he’d gone abruptly silent until he blinks down to see Lan Wangji frowning up at him, concern in the crease of his brow. </p>\n<p>Wei Wuxian slaps on a smile. “Sorry,” he says. “Clearly watching you grade all these papers is so boring you defied the impossible and put a dead man to sleep.” </p>\n<p>Lan Wangji does not look any more reassured. In fact, he looks downright dubious, probably because over the course of their friendship Wei Wuxian has very rarely shut his mouth mid conversation for no reason at all. </p>\n<p>He goes to say something, to reassure him, when he feels it again, this time harder. Not just a tug but a <em>pull. </em>It must show on his face because there’s something that might even be genuine concern dawning in Lan Wangji’s eyes.</p>\n<p>“Wei Ying,” he starts to say, but Wei Wuxian doesn’t hear whatever he plans to finish with. Between one blink and the next he’s <em>gone. </em></p>\n<p>(<em>- it’s dark and Wei Wuxian feels more tired than he can possibly ever explain. Something hurts, deep inside. An ache so viciously deep that it feels like another part of his body entirely -)</em></p>\n<p>The next time Wei Wuxian opens his eyes, disoriented and confused, he’s standing alone in Lan Wangji’s darkened office. </p>\n<p>“What,” he says, “the fuck?” </p>\n<p>He doesn’t know how long has passed since he vanished, but when he drifts down the hall towards Lan Wangji’s bedroom he discovers that it’s night. Wei Wuxian is used to having periods of non-existence where he peacefully retires from reality for a while, but they’d never been like <em>that. </em>Most of the time, they’re willing, or at the very least a distracted fade of consciousness. Second nature, like blinking. This had been forceful and rough - as if he’d been seized by something greater than himself and dragged into the darkness. </p>\n<p>Wei Wuxian won’t admit to feeling scared, but to say he’s mildly unsettled might be putting it lightly. </p>\n<p>He pauses at Lan Wangji’s door but after no more than a moment of hesitation he passes through it. Lan Wangji is in bed, as expected, but when Wei Wuxian drifts closer he sees a tension in his face that is usually absent in sleep. Slowly, he reaches out, as if his ghostly touch can do anything at all, but before his fingers can so much as graze Lan Wangji’s exposed shoulder, his eyes snap open. </p>\n<p>Wei Wuxian freezes, feeling strangely caught out, and then Lan Wangji breathes, <em>“Wei Ying.” </em></p>\n<p>“Yeah,” Wei Wuxian says, trying for a grin. “That’s my name.” </p>\n<p>Slowly, Lan Wangji sits upright, hair sweeping over his shoulder in a gorgeous wave. For a second it seems as if he’s going to reach out, try and wrap his long fingers around Wei Wuxian’s insubstantial wrist, but the last of the sleep seems to clear from his mind and the moment passes. Instead, he asks, “Are you alright?” </p>\n<p>“Am I alright? I’m dead, Lan Zhan. Why wouldn’t I be alright? What can possibly hurt me now?” </p>\n<p>Lan Wangji visibly hesitates for a second before he asks, “Will you tell me where you went?” </p>\n<p>Wei Wuxian doesn’t want to worry him, but the heavy press of his eyes bore through the tentative shield he’s been trying to build around himself. More honest than he wants to be, he admits, “I don’t know.” </p>\n<p>“You don’t know if you’ll tell me?” </p>\n<p>“I don’t know where I went,” Wei Wuxian corrects. “It’s… it’s never happened like that before.” </p>\n<p>“Like what?” </p>\n<p>Wei Wuxian struggles to find the words to describe it. The intricacies of living alongside death are something that escape his often flimsy grasp of sincere expression at the best of times, let alone right now. For Lan Wangji though, he tries. “Normally, it’s like - I don’t know. Blinking. Sleeping. I go, and then I come back, and the in between time doesn’t matter, you know?” </p>\n<p>Lan Wangji is sitting upright, back tall and proper, watching Wei Wuxian fidget in front of him. The stoic calmness of him helps, just a bit. Eases away some of the nervous tension clawing at Wei Wuxian’s gut. Slowly, Lan Wangji nods to indicate he’s listening and he does, to the best of his limited ability, understand. </p>\n<p>“This was more like being <em>yanked</em>. Getting pulled off stage before the curtains fall. I don’t know. It was uncomfortable and I didn’t like it.” </p>\n<p>Lan Wangji asks, “Do you remember what happened while you were gone?” </p>\n<p>Wei Wuxian shakes his head. “I don’t even remember being gone.” The corners of Lan Wangji’s mouth turn down, and suddenly Wei Wuxian can read a concerned realization in his dark eyes. “Lan Zhan, what?” </p>\n<p>“Wei Ying, do you know how long you’ve been gone for?” </p>\n<p>Wei Wuxian glances over his shoulder to the shuttered window and the moonlight filtering in. Guilt settles in his gut at imagining Lan Wangji here in the house alone for hours, no clue where Wei Wuxian went or if he’s okay. “I missed dinner, I suppose,” he says. “I’m sorry, Lan Zhan. I really -” </p>\n<p>“Wei Ying,” Lang Wangji says, “you’ve been gone for a <em>week.” </em></p>\n<p>A week. <em>A week. </em>Wei Wuxian is so struck that for a moment he can’t say anything at all. “No. I was - I was just here.” </p>\n<p>“Wei Ying,” Lan Wangji says, voice soft, and Wei Wuxian’s protests wither away. Lan Wangji has never lied to him. He knows in his heart that Lan Wangji never will. </p>\n<p>“A week,” Wei Wuxian says, as if hearing the words trip off his tongue may make them feel like the truth. They do not. Then, with awful realization, “Oh my god, Lan Zhan. You must have been so worried.” </p>\n<p>The quiet way Lan Wangji stares at him, as if he expects Wei Wuxian to vanish again at any moment, speaks volumes. He’s never seen such a fragile expression on his face before, and it utterly breaks Wei Wuxian’s heart. </p>\n<p>He steps closer and then, before he can doubt himself, reaches out and lays his hands along Lan Wangji’s cheeks. “Lan Zhan,” he says. “I’m sorry I made you worry.” </p>\n<p>He can’t feel the warmth of Lan Wangji’s skin beneath his palms, and he knows that at best Wei Wuxian’s hands feels like nothing more than an intangible hint of cold air, but this is as close as he’ll ever really get to touching him. Lan Wangji’s eyes drift closed for a second. He leans into the hint of Wei Wuxian’s grip. </p>\n<p>“Wei Ying,” he says, and Wei Wuxian waits, but he says nothing else. </p>\n<p>What happened is probably not his fault, but it doesn’t matter. Wei Wuxian feels like the world’s shittiest human being imaginable to have worried the unflappable Lan Wangji like this. </p>\n<p>“Come on,” Wei Wuxian says gently. “It’s late, you need to sleep.” </p>\n<p>Lan Wangji’s eyes flutter open and he looks fit to protest, but Wei Wuxian steps back and then around him, climbing onto the mattress beside him. The sheets do not so much as shift beneath him and the mattress does not dip beneath his weight. He crawls into the slip of space between where he knows Lan Wangji sleeps and the wall. He flops down, rolling over to look back at Lan Wangji who is watching him expressionlessly. “Well?” Wei Wuxian asks. </p>\n<p>Slowly, Lan Wangji lowers himself back down. The distance he keeps between them is careful and deliberate, which hurts, but Wei Wuxian doesn’t have the courage to bridge it. He can ignore a lot of reminders about his death, but he doesn’t think he could stomach trying to lay his head on Lan Wangji’s shoulder right now and getting… nothing. </p>\n<p>Although Lan Wangji usually sleeps on his back, he settles on his side, solemn eyes holding Wei Wuxian’s own. It should be uncomfortable, the both of them laying side by side like this, holding one another’s gaze unflinchingly, but Wei Wuxian feels nothing but a deep sense of peace. </p>\n<p>Lan Wangji usually does that to him, he’s discovered.</p>\n<p>“Sleep,” Wei Wuxian insists. “I’ll still be here when you wake up, I promise.” </p>\n<p>Lan Wangji hesitates. “Wei Ying.” </p>\n<p>“Yes?” </p>\n<p>He doesn’t answer. After a moment of searching Wei Wuxian’s face, he closes his eyes. Wei Wuxian wonders if perhaps Lan Wangji has just missed saying his name. </p>\n<p>Eventually, Lan Wangji does go to sleep. Wei Wuxian stays by his side the whole night, watching the steady rise and fall of his shoulders. His fingers itch to touch, to tuck Lan Wangji’s loose hair behind his ear, to pull the blankets higher around his waist. He cannot. </p>\n<p>This is all he can offer Lan Wangji - but he’ll offer it for as long as Lan Wangji is willing to take it. </p>\n<p>.</p>\n<p>After they start, the occurrences do not go away. If anything, they grow worse. </p>\n<p>Wei Wuxian loses anything from hours to a week at a time. When he returns, his memory of being gone is always shaky. He can only say with certainty that he was gone at all because each time he returns Lan Wangji looks more and more stressed which does not exactly inspire confidence in Wei Wuxian. If the ghost whisperer doesn’t know why this is happening to him, who the fuck does? </p>\n<p>When asked, Lan Xichen is equally in the dark. </p>\n<p>“I’m sorry,” he says, as Wei Wuxian lingers by his shoulder as he washes the dinner dishes. “I’ve never heard of anything like this before. I’m afraid I don’t have the answers.” </p>\n<p>Wei Wuxian had politely asked Lan Wangji to water his flowers to spirit him out of the kitchen for this exact conversation, which is the only reason he finds the courage to ask, “If it’s something bad and you just don’t want to tell me, I can take it.” </p>\n<p>Lan Xichen finishes drying the dishes and rolls down his sleeves. The look he gives Wei Wuxian is pinched. “I know you could,” he says. “I’m not lying to you. Whatever this is, Wei Wuxian, I have not heard of it before.” </p>\n<p>Wei Wuxian’s shoulders sink. “There’s got to be a reason, right? Something we can fix?” </p>\n<p>“I will ask my uncle,” Lan Xichen says. “If anybody might know, it’s him.” He pauses, glancing out the window where Lan Wangji is very patiently and thoroughly making sure Wei Wuxian’s daisies are thriving. Despite wearing a white shirt, there’s not a spot of dirt on him. Something about the earnest picture he makes through the window causes Wei Wuxian to smile. Lan Xichen asks, “Is this why you very unsubtly asked my brother to leave?” </p>\n<p>“I was subtle!” Wei Wuxian protests. “Lan Zhan didn’t even realize anything.” </p>\n<p>Lan Xichen shakes his head, smiling softly. “My brother knew, Wei Wuxian. He was just humoring you.” </p>\n<p>It’s probably the truth, but Wei Wuxian insists, “I can be subtle!” </p>\n<p>Rather than argue with him, Lan Xichen stacks the last of the dishes and says, voice faux casual, “Wangji is very fond of you, you know.” </p>\n<p>Wei Wuxian is momentarily thrown by the abrupt and sudden turn in conversation. His gaze unwittingly flits out the window and back again. “I’m fond of him too?” he offers uncertainly. </p>\n<p>Lan Xichen straightens up and his gaze locks with Wei Wuxian’s own. “My brother does not grow attached easily,” he says. “He care sparingly and deeply.” </p>\n<p>Wei Wuxian knows this, of course. He’s never seen Lan Wangji bring so much as a work friend home in the entire time he’s lived here. The few photos that decorate the house are of him, Lan Xichen, and their uncle with the occasional rabbit lurking in the frame. It’s not hard to deduce that while Lan Wangji may not admit to living a lonely existence, he chooses to live very alone. </p>\n<p>“I’m aware,” Wei Wuxian says, unsure what Lan Xichen expects him to say here. “I’m very grateful that he puts up with me.” </p>\n<p>That seems to be the wrong thing. The faint hint of disapproval that Wei Wuxian has learnt to look for surfaces in Lan Xichen’s gaze. He says, “I’m afraid I’m going to need more than that from you, Wei Wuxian.” </p>\n<p>“Sorry?” </p>\n<p>“I do not think you understand how easily and deeply you could hurt my brother,” Lan Xichen says. “I consider you a friend, and I hope you would consider me as such too, but I worry about the flippancy with which you treat my brother’s regard for you.” </p>\n<p>“His regard?” Wei Wuxian wants desperately to go back to when they were talking about the awful things happening to him. That had been easier. “Of course I know Lan Zhan cares about me. I care about him too. A lot. I don’t know how I can prove that to you.” </p>\n<p>Lan Xichen looks like he has more to say, but at that moment Lan Wangji enters the kitchen and they both look up. Lan Xichen expression is immediately peaceful smiles, and although Wei Wuxian still feels unnerved, he can’t help break into a grin when he sees the rabbit in Lan Wangji’s arm. “I thought you didn’t permit your pets in the house?” he teases. </p>\n<p>“He’s unwell,” Lan Wangi says. “For tonight, I will keep an eye on it.” </p>\n<p>God, looking at this man makes Wei Wuxian feel so pathetically, ridiculously soft inside. Lan Wangji… he’s just <em>good. </em></p>\n<p>Lan Xichen seems to feel the same, because the hurried smile he’d pasted on turns instantly genuine. “Of course. I’m not working tomorrow, let me know if you need me to watch him.” Lan Xichen picks up his coat from the back of the chair, draping it over his arm. “I’ll head off for tonight. I’ll see you next week, Wangji.” </p>\n<p>Lan Wangji inclines his head in agreement. Lan Xichen’s gaze turns to Wei Wuxian who feels himself tense, but the smile he offers seems real enough, as does the resigned fondness in his eyes. “I’ll look into what’s been happening, but I make no promises that I’ll be able to find anything, I’m afraid.” </p>\n<p>“That’s fine,” Wei Wuxian, just relieved to have Lan Xichen on his way out the door. “Drive safe!” </p>\n<p>Lan Xichen gently strokes the rabbits furry head on his way out of the kitchen. When they hear the door close behind him, Lan Wangji’s gaze turns to Wei Wuxian. “You spoke with my brother?” </p>\n<p>“Ah, a little,” Wei Wuxian says vaguely, coming closer. He gently scratches the rabbit’s chin. It blinks at him blearily. “Think this little guy will be okay?” </p>\n<p>“Wei Ying can watch over him while I sleep,” Lan Wangji says, and something about the confidence Lan Wangji has in him really hits Wei Wuxian where it counts. </p>\n<p>“I’m sure he and I will get along just fine,” he agrees. </p>\n<p>.</p>\n<p>That night, Lan Wangji plays his guqin for him. </p>\n<p>It’s something they do almost every night these days. Lan Wangji had played before Wei Wuxian truly became a centered part of his life, but it wasn’t until after they’d grown close that Wei Wuxian finally felt welcome to sit beside him as Lan Wangji’s fingers gently flowed across the strings. </p>\n<p>Lan Wangji is as excellent at music as he is as at everything else, something that Wei Wuxian will eventually stop finding surprising, he’s sure. He sounds better than some of the professional players Wei Wuxian had heard as a child when Madam Yu was on a particularly traditional music kick, and it makes him sorely wish that he could play his flute for Lan Wangji in return. </p>\n<p>He tells him as much tonight, leaning wistfully against the wall as he stares at Lan Wangji carefully sit before the guqin as he makes it sing. “I mean, I’m not saying I was exactly on your level or anything, but I’d gotten pretty good at it over the years,” he says. “I kind of miss it, honestly.” </p>\n<p>The sick rabbit sits between them, wrapped loosely in a throw blanket. Wei Wuxian strokes gently along its soft ears, immeasurably content. </p>\n<p>Lan Wangi says, “I would like to hear you play.” </p>\n<p>Wei Wuxian grins, warmed by the genuine compliment. “It’s okay, you play well enough for both of us. Still, do you think we could have done a duet? I’d bet we’d be good.” </p>\n<p>Lan Wangji seems to consider that for a second and then his fingers slide along the strings and the song he’s playing changes, morphing from the comforting tune that Wei Wuxian had been listening to into… something else. Something he hasn’t heard before. </p>\n<p>It’s soft, but with peaks and lows - a valley of emotion packed carefully into a single song. The pluck of the strings rings gently through the room and Wei Wuxian can’t help but close his eyes, shutting out the world as he listens, fingers ghosting along the rabbit’s soft fur. The song is utterly new to him, but the emotion it evokes is not. </p>\n<p>Opening his eyes, Wei Wuxian asks, “Did you write this, Lan Zhan?” Lan Wangji’s fingers still and he looks up, eyes exceptionally bright in the dimness of the late evening light. “Don’t stop playing,” Wuxian protests. “I was enjoying myself!” </p>\n<p>Lan Wangji looks at him for a long moment and Wei Wuxian could swear there was something that was almost a smile playing on his lips before he turned back to the guqin. The song picks up again, and something about it soothes out all the worries Wei Wuxian’s been nursing for weeks. </p>\n<p>Sighing with satisfaction, he shuffles closer so that, if he were only alive, he might lay his head on Lan Wangji’s shoulder. He’s sure Lan Wangji must notice, but he doesn’t pull away. He leans into Wei Wuxian, the two of them separated only by the rabbit dozing between them. Lan Wangji plays for a long, long time. When the stings finally fall quiet, Wei Wuxian stirs. “It’s gorgeous,” he says. “When did you write it?” </p>\n<p>“Recently,” Lan Wangji replies. </p>\n<p>Wei Wuxian smiles at him. “Does it have a name?” </p>\n<p>Lan Wangji inclines his head, hair falling past the curve of his ear. </p>\n<p>“Are you going to tell me?” Wei Wuxian teases.</p>\n<p>Lan Wangji’s silence is answer enough. He reaches out, gently picking up the sleepy rabbit and setting it on his knees. Wei Wuxian has no idea how he can retain such perfect posture for such a long time. Wei Wuxian is sprawled on the floor, back to the wall and one knee hiked high, and <em>he </em>feels sore, yet here Lan Wangji sits, as perfect and as immovable as porcelain. </p>\n<p>Staring at him, serene and imperial, rabbit on his knees, Wei Wuxian is hit with such fondness he feels as if he may drown in it. </p>\n<p>“Lan Zhan,” he says, “you know you’re the best thing that’s ever happened to me, right?” </p>\n<p>Lan Wangji freezes. He looks up, and he looks so clearly taken aback that Wei Wuxian can’t help but grin. It’s not every day that he manages to wrangle a genuine expression out of Lan Wangji with as little as a sentence. </p>\n<p>“I’m serious,” he says. “And I don’t just mean, you know, the best thing to happen since I died. Just… I feel like a better person for having you in my life. Or in my death, whatever. I wish I could have met you before. See if you’d be so willing to put up with me if we weren’t stuck in this house. It’d be nice to be able to hold your hand, just once.” </p>\n<p>Lan Wangji is staring at him, utterly unreadable. Possibly he doesn’t know what part of Wei Wuxian’s little speech to respond to first. Wei Wuxian rests his hands on his folded knee and then his chin on his folded hands and waits. Eventually, Lan Wangji says, “Not stuck.” </p>\n<p>“Hm?” </p>\n<p>“I’m not stuck with you,” Lan Wangji says. “I choose to be here because this is where you are, Wei Ying.” </p>\n<p>This time it’s Wei Wuxian who’s taken aback. If he could, he’s sure he’d be bright red. The embarrassment is only eclipsed by the giddy, overwhelming feeling of sheer joy bubbling deep inside his stomach. “Holy shit, Lan Zhan. When did you get so smooth? You have to warn me before you say something like that! I’m delicate right now, you know?” </p>\n<p>Lan Wangji gets to his feet and sets the rabbit down beside Wei Wuxian’s thigh. “Wangxian,” he says. </p>\n<p>Wei Wuxian stares at him. “Huh?” </p>\n<p>“The song’s name,” Lan Wangji clarifies. “It’s called Wangxian.” </p>\n<p>He turns, and sweeps out of the music room. Wei Wuxian stays frozen to the floor, rabbit nestled neatly beside him and eyes fixed on Lan Wangji’s vanishing back. He wants to get up, to follow him - to ask him to repeat himself, to say it again, to <em>play </em>it again. </p>\n<p>He wants to give chase very dearly, but very embarrassingly for a man who is three years dead, Wei Wuxian isn’t sure that his legs will hold him. </p>\n<p>.</p>\n<p>Wei Wuxian is, very possibly, in love with Lan Wangji. </p>\n<p>This does not come to him as a realization so much as an acknowledgement. The grass is green, the sky is blue, rabbits are very cute actually, and Wei Wuxian is very much in love with Lan Wangji. </p>\n<p>Wei Wuxian is not in the business of lying to himself. When he was alive, he spent so much time lying to others - for their sakes, for his own - that he’d had to practice what little honesty he could wherever he could find it. </p>\n<p>He thinks it’d probably take a stronger man than him to <em>not </em>fall in love with Lan Wangji. Lan Wangji, who cooked him food he couldn’t even eat, who watered the flowers that had been Wei Wuxian’s only companions for years. Lan Wangji, who broke his own family’s rules to talk to him, who wrote him the most beautiful song Wei Wuxian’s ever heard and named it after the both of them. </p>\n<p>Wei Wuxian isn’t that man. He’s not strong enough to resist so much affection, freely given. He’s been hungry for it all his life, scrabbling to take what scraps he can because to hope for the real thing was to risk taking it by force from somebody who deserved it more. Wei Wuxian had gotten used to living without it, but it never stopped him wanting. </p>\n<p>Typical Lan Wangji, really. Calming introducing himself to Wei Wuxian’s life and giving him all the things and more he could ever hope for. How the fuck was Wei Wuxian <em>not </em>meant to fall in love with him? </p>\n<p>If Jiang Cheng could see him now, he’d be laughing. Twenty years, and Wei Wuxian couldn’t summon enough romantic interest in anybody to so much as go on a date. Three months of living with Lan Wangji and suddenly he’s playing out the tragic romance of the century. </p>\n<p>Just one good thing. Wei Wuxian wants just <em>one good thing </em>to not be tainted by his misfortune. That’s all he’s ever asked. </p>\n<p>This is why the next time Lan Xichen comes to visit, Wei Wuxian latches onto him before he’s even through the door. “Lan Xichen! It’s really good to see you! Lan Zhan’s in the middle of cooking right now, so how about you come out with me to see the rabbits!” </p>\n<p>“I see you haven’t improved your subtlety at all,” Lan Xichen says, amused, but allows Wei Wuxian to lead him out the back kitchen door and into the yard. He greets his brother as he passes but doesn’t pause for conversation. Lan Wangji watches them go, frowning, but his attention is quickly pulled back to the stove. </p>\n<p>Outside, Lan Xichen frees the rabbits from their hutch and settles in one of the chairs to watch as they roam. “I assume you want to know if I’ve talked with Uncle,” he says. </p>\n<p>Wei Wuxian sits on his hands to stop himself from fidgeting. “Did he say anything?” </p>\n<p>Lan Xichen sighs. Wei Wuxian’s heart sinks. “It’s not good news,” he warns. </p>\n<p>Wei Wuxian had not anticipated it would be. “Tell me.” </p>\n<p>Lan Xichen eyes him for a moment. One of the rabbits sniffs at his spotless loafers, settling its fluffy butt on his toes. Lan Xichen does not reach down to move it, content to let it do whatever it pleases. “Have your episodes been getting worse?” </p>\n<p>“They don’t seem to be lasting for as long,” Wei Wuxian say. “But they’re happening more frequently. Is that bad?” </p>\n<p>Lan Xichen shakes his head. “I don’t know,” he says truthfully. “You have to understand, Wei Wuxian, you’re something of an outlier for our family. When we interact with ghosts it’s usually with the express purpose of exorcising them. What little lore we have about ghosts living a peaceful continued existence is thin at best.” </p>\n<p>“But your uncle? It sounded like he had some idea.” </p>\n<p>Lan Xichen hesitates, and then he says, careful, like he’s worried he’ll upset him, “It’s possible your soul is trying to move on.” </p>\n<p>Wei Wuxian stares at him. “But I’m not trying to move on,” he says. “If I wanted to move on, don’t you think it’d have happened when I spent three years alone and isolated haunting my own house?” </p>\n<p>“You had resentment tying you here,” he says. “When we spoke, you told me that, once, you weren’t as peaceful as you are now.” </p>\n<p>Wei Wuxian raises a brow. “And?” </p>\n<p>“Wei Wuxian, I know you. My brother knows you. You are not an aggressive individual. In life, I assume you had very rarely wished ill will on anybody, if ever. Did you not wonder why in death you were being drawn to darker thoughts?” </p>\n<p>Wei Wuxian had, actually, but he’d thought it was a personal failing, not a spiritual one. “I got better,” he insists.</p>\n<p>“You got better at containing the resentment,” Lan Xichen says. “You were still resentful. Why wouldn’t you be? You died unfairly young, possibly violently, and you have a large, expressive personality. You have the textbook makings of a resentful spirit.” </p>\n<p>“I feel like I ought to be offended,” Wei Wuxian says, but it’s weak. </p>\n<p>Lan Xichen obligingly offers him a smile at his faltering joke, because he’s an exceptionally good sport. “Ghosts are made of resentful energy, Wei Wuxian. Alone, you were consumed by it. But now you have Wangji, and your resentment is fading.” </p>\n<p>Wei Wuxian can’t get his head around it. He glances over his shoulder, past his sprightly flowers and into the kitchen where Lan Wangji is serving up dinner. “Are you telling me,” he says, “that I was stuck here alone because I was miserable, but now that I’m <em>happy </em>I’m getting fired from the afterlife?” </p>\n<p>“Well,” Lan Xichen says delicately, “I suppose that’s one interpretation of it.” </p>\n<p>They sit in silence for a moment. Wei Wuxian expects to be angry, expects to feel that rumored resentment Lan Xichen had been talking about bubble and rise from the locked box deep inside of himself, but when he reaches for it, there’s nothing there. Lan Xichen had been right. Wei Wuxian does not want to be angry anymore. He spent three years on that, and it had been awful. Right now, he’s happy - has gotten to experience what it means to truly <em>be </em>happy. </p>\n<p>The only way to stay is to ruin this, and if he ruins this he has no reason to stay anyway. It’s a catch twenty-two and Wei Wuxian is a lot of things but he’s not a wizard; he can’t fix that.</p>\n<p>“For what it’s worth,” Lan Xichen says, soft and quiet, “I’m sorrier than you can imagine, but I am glad to have had the chance to meet you, Wei Wuxian.” </p>\n<p>Wei Wuxian’s throat is thick. He struggles to slap on a smile and says, “Why do you sound like you’re saying goodbye? I’m not gone yet.” </p>\n<p>The back door rattles open and the both of them turn. Lan Wangji stands in the doorway, looking out at the two of them. He doesn’t say anything, but his brow is furrowed, and Wei Wuxian can read concern in the faint lines by his eyes. He clears his throat and gets to his feet, taking care not to look at Lan Xichen. “Lan Zhan! Is the food done?” </p>\n<p>Lan Wangji’s gaze ticks from Wei Wuxian to Lan Xichen and back again. Wei Wuxian can see him contemplating asking, and his stomach turns, but he just steps back, making space for them. </p>\n<p>“Sorry for leaving you to the cooking,” Lan Xichen says as he gets to his feet. “I’ll set the table.” </p>\n<p>Wei Wuxian follows after him to the door, but once Lan Xichen sweeps inside, Lan Wangji steps in front, blocking Wei Wuxian as best as he can. He doesn’t say anything, but Wei Wuxian can read the question on his face with perfect ease. <em>Is everything okay? Are you okay? </em></p>\n<p>For a second, he lets himself look shamelessly; Lan Wangji’s smooth skin, his dark hair, his deep eyes. It’s not the first time Wei Wuxian has wistfully thought about how beautiful he is, but it’s the first time he’s realized that very soon there will come a moment where he looks at Lan Wangji for the last time and he won’t even realize it. </p>\n<p>Wei Wuxian leaving is going to hurt him. He wishes there were a way around that, something to soften the blow when it hits, but Wei Wuxian is too weak to push him away and not strong enough to tell him the truth. </p>\n<p>He does not want whatever time he has left to become a living wake - watching Lan Wangji mourn him even as Wei Wuxian is still here. He wants to make the most of it, to enjoy the last of his afterlife and his time with Lan Wangji; to be able to go peacefully when it’s finally time, content in the knowledge that for however small it may be, there was a time where he loved and was loved in return.</p>\n<p>To Lan Wangji, he says, “I’m okay, Lan Zhan. You don’t need to worry about me.” </p>\n<p>He thinks Lan Wangji would be proud of him. It is perhaps the first time he’s said ‘I’m okay’ and <em>meant </em>it. </p>\n<p>.</p>\n<p>After Lan Xichen’s visit, Wei Wuxian becomes increasingly clingy. He’s sure Lan Wangji notices, because Lan Wangji notices most everything, but he does them both the kindness of not saying anything, for which Wei Wuxian is incredibly glad.</p>\n<p>When Lan Wangji is away, Wei Wuxian is mostly away too. He stops attempting to fight the tug in his core, as if storing up his absences when Lan Wangji isn’t there to observe them. When Lan Wangji is home, Wei Wuxian is positively glued to his side, chattering away as they watch TV, feed the rabbits, eat dinner. All that separates them is the uncrossable gulf that death has created, and every time Lan Wangji turns to look at him, allows Wei Wuxian to wiggle closer as if succumbing to Wei Wuxian’s orbit, he can’t help but feel unbearably smug. </p>\n<p>He doesn’t know how much time he has left, but he’s pretty sure it isn’t a lot. He’s going to take what he can get, allow himself to be greedy and selfish, and pretend like he doesn’t see the cautious, sad way Lan Wangji looks at him sometimes, as if he <em>knows </em>what Wei Wuxian is trying to do. </p>\n<p>Not even Lan Wangji’s bedroom survives the force of Wei Wuxian’s enthusiasm. He spends most of his nights in Lan Wangji’s bed, curled against the wall, watching him sleep as if that’s a perfectly normal thing to do. Lan Wangji weathers this with grace too, not so much as batting an eye when Wei Wuxian reclaims his place beside him as if the last time they’d done this hadn’t been the resulting of outlying circumstances. </p>\n<p>“You don’t mind, do you, Lan Zhan?” Wei Wuxian asks cheerfully, stretching out as he settles. “The house is so boring without you. I might as well just stay up here.” </p>\n<p>Lan Wangji does not point out that Wei Wuxian has his flowers to talk to, the rabbits to play with, the TV Lan Wangji is happy to leave on for him. He does not point out that Wei Wuxian spent years alone in this house before he arrived, keeping himself occupied in any number of ways. Instead, he gracefully slips into bed beside him, turning to his side so that they face one another, and closes his eyes. </p>\n<p>It still blows Wei Wuxian away - the depth of Lan Wangji’s trust in him, his comfort <em>with </em>him. He does not know what he did to earn that, the companionship of a man who gives sparingly but deeply, and he’s not so sure he deserves it, but he promises himself that he’ll do his best by him anyway. </p>\n<p>He spends the last of his time like that - fiercely devoted to Lan Wangji in a way he’s only committed himself to his family before. The careful way Lan Wangji sometimes returns his smiles makes the tacit lie of how very little time they have left worth it. </p>\n<p>Three weeks after Lan Xichen told him the truth, Wei Wuxian realizes that he can’t interact with the world at all anymore. The rabbits can’t seem to sense his touch, and he can’t so much as influence the perfect papers of Lan Wangji’s desk to scatter. Whatever tenuous thread that has him clinging to reality has thinned to the point of snapping. He does not need to be a genius to know what that means. </p>\n<p>That evening when Lan Wangji returns from work, Wei Wuxian greets him with a winning smile and sweetly requests his favorites for dinner in the voice he knows gets him most anything he asks for. </p>\n<p>Lan Wangji seems suspicious, probably because Wei Wuxian has never actually had a request for their shared meals before, but he acquiesces. Wei Wuxian hovers anxiously over his shoulder as he cooks, making unnecessary suggestions like “needs more chili powder” and “no, really, more chili powder, Lan Zhan.” </p>\n<p>By the time the food hits the table Wei Wuxian is a bouncing ball of tension. He smiles broadly at Lan Wangji and says, “Thanks for humoring me, Lan Zhan.” </p>\n<p>Lan Wangji sits Wei Wuxian’s plate in front of him and simple says, “No need for thanks.” </p>\n<p>Wei Wuxian laughs and turns his attention to the food. He braces himself, sets his hands around the edges of the plate, and leans forward to breathe in as deeply as he can manage. </p>\n<p>He tastes… nothing. </p>\n<p>Wei Wuxian is not disappointed. He had suspected this would happen. It does not stop the resigned sinking in his gut. When he opens his eyes he discovers Lan Wangji is staring at him, brow creased ever so slightly in a frown. “Wei Ying?” </p>\n<p>Wei Wuxian hurries to smile. “It tastes great, Lan Zhan,” he lies. “You really are an excellent cook. Is there anything you can’t do?” </p>\n<p>Lan Wangji does not seem convinced, but Wei Wuxian easily spins the conversation away from him, talking about what the rabbits had been up to when Lan Wangji was away, how healthy the garden outside the kitchen is looking these days, how he’s fairly certain Lan Wangji’s neighbors are starting to cotton on to the fact he’s not exactly living alone, per se. Gracefully, Lan Wangji allows himself to be distracted and Wei Wuxian is pathetically grateful. </p>\n<p>After dinner, they feed the rabbits together, and Wei Wuxian pretends like the way that they don’t seem to acknowledge his existence anymore doesn’t bother him in the slightest. The one Lan Wangji had been worried about all those weeks ago had made a full recovery, and it, out of all its siblings, is the only one who seems to feel the ghost of Wei Wuxian’s fingers along its fluffy back. It looks up at him with large, solemn eyes, and Wei Wuxian smiles at it helplessly. </p>\n<p>“I don’t know how you raised your rabbits to be so serious, Lan Zhan,” he says. “They really take after you.” </p>\n<p>“Not this one,” Lan Wangji says, picking up Wei Wuxian’s admirer. “He chewed through the fence earlier.” </p>\n<p>“A little trouble maker!” Wei Wuxian exclaims, delighted. </p>\n<p>“Wei Ying’s influence,” Lan Wangji says, and Wei Wuxian cannot help but go mushy on the inside at the thought. </p>\n<p>It’s just that the idea that even once he goes, he might leave behind at least a little bit of a reminder that he was here at all is an appealing one. He doesn’t want Lan Wangji to forget about him, not even if he might be happier for it. A selfish thought, really, but Wei Wuxian suspects he’s allowed it after everything he’s been through. </p>\n<p>Back inside, they curl up on the couch and watch Lan Wangji’s favorite game show. Wei Wuxian shamelessly guesses all the answers as usual, and the familiarity of it seems to ease some of the tension from Lan Wangji’s shoulders. Lan Wangji marks essays as they watch, and Wei Wuxian slumps beside him, closing his eyes and savoring the moment deeply.</p>\n<p>When Lan Wangji gets ready for bed, Wei Wuxian claims his spot on the mattress, back against the headboard and legs sprawled intangibly among the messy sheets. Lan Wangji comes out of the bathroom, hair still damp from his shower and looking every bit the gorgeous god Wei Wuxian has always known he was. On impulse, he asks, “Do you think you could play your guqin for me?” </p>\n<p>Lan Wangji pauses in the act of putting up his hair to look at him. “Here?” he asks. </p>\n<p>“Please.” </p>\n<p>He expects Lan Wangji to turn him down, but instead he nods, finishes tying his hair, and then vanishes out of the room. He comes back a moment later with his guqin and settles on the edge of the bed, gently placing it in his lap. His back is to Wei Wuxian like this, but that’s alright, because it means Wei Wuxian gets to stare at his profile unselfconsciously. </p>\n<p>Lan Wangji’s playing is as good as always, unblemished by the change in routine or surroundings or even having to carefully balance the instrument on his knees. The soothing pluck of the strings is enough to make Wei Wuxian sigh wistfully, instantly content. Not for the first time he wishes he could have met Lan Wangji when he was alive, so they could have shared this together too. </p>\n<p>Unable to help himself, he says, “Play our song.” </p>\n<p>Lan Wangji’s fingers still on the strings. They haven’t talked about the song Lan Wangji wrote for him since the first time he played it, and Wei Wuxian misses the sound of it terribly. The moment stretches, long and unwinding, and then Lan Wangji’s fingers start to move again. </p>\n<p>It’s gorgeous. Even more beautiful than Wei Wuxian remembers, and he remembers it being pretty amazing to start with. He wonders what the other people in Lan Wangji’s life would think of him if they knew the man who walked through the world so icy and distant could write something like this; something that almost sounds like a love song. </p>\n<p>Wei Wuxian’s throat tightens. In front of him Lan Wangji turns slightly, glancing up from the guqin and towards Wei Wuxian. Then, like a supernova, he smiles at him; soft, tentative, and every bit as warm as the sounds his fingers pull from the strings beneath them. </p>\n<p><em>Oh, </em>Wei Wuxian thinks, again. <em>Oh, I really love him. </em></p>\n<p>Lan Wangji turns back to the guqin. Wei Wuxian stares; at the exposed nape of his neck, the faint hint of a smile still lingering at the corner of his lips, the unyielding line of his back. He wants to touch him so badly it hurts. </p>\n<p>There’s a tug in his gut.</p>\n<p>“Lan Zhan,” he says, and for all that he’s trying to sound bright and cheerful, his voice is remarkably unsteady. “I just want you to know that I was never happier than when I was with you.” </p>\n<p>Lan Wangji’s hands stutter on the strings. </p>\n<p>Wei Wuxian closes his eyes. <em>Alright, </em>he thinks. <em>Alright, I’m ready. </em></p>\n<p>Before Lan Wangji can so much as turn around, he’s gone.<em> </em></p>\n<p>.</p>\n<p>Wei Wuxian opens his eyes. </p>\n<p>This is remarkable mostly in the fact that, two seconds ago, he had thought he would never open his eyes again. He was gone - he was <em>dead</em> dead. </p>\n<p>The world swims around him as he blinks, disoriented and dizzy. He has an impression of a pale ceiling, of a soft mattress beneath his back, and then the dark shape of somebody looming over him, blocking out the too-bright light from overhead. </p>\n<p>“Oh my god,” Jiang Cheng says.</p>\n<p><em>What, </em>Wei Wuxian thinks, <em>the fuck? </em></p>\n<p>He blinks again and finally the world falters into being. Jiang Cheng’s shocked face hovers above him, eyes wide and disbelieving. Wei Wuxian has never seen him look so downright emotional in their many, many years together. </p>\n<p>“What…” Wei Wuxian’s voice sounds grated and rusty, and he winces as it scrapes at his throat.</p>\n<p>“Hold on, don’t try and talk,” Jiang Cheng says, and then he’s turning away, talking urgently with somebody behind him. Wei Wuxian can hear the sound of a door rattling open and then closed, and then Jiang Cheng is back. “Wei Wuxian, I’m going to <em>murder </em>you.” </p>\n<p>That sounds more like the Jiang Cheng he remembers, and Wei Wuxian would smile if he wasn’t so awfully, terribly confused. “You can’t,” he says, and this time the words sound at least a little clearer. “I’m already dead.” </p>\n<p>Jiang Cheng laughs, high and disbelieving. “No, Wei Wuxian, you’re <em>not. </em>You’ve been in a fucking coma. Don’t even joke about that right now.” </p>\n<p>“Coma?” Wei Wuxian can’t make sense of <em>anything. </em>He’s so overwhelmed he almost wants to close his eyes again, slip away back to the darkness, but before he can try Jiang Cheng grips his hand, squeezing tight enough to grind his bones. </p>\n<p>“Don’t you dare,” Jiang Cheng threatens. “We’ve been waiting three years for you to open your stupid eyes, asshole.”</p>\n<p>Three years. <em>Three years. </em></p>\n<p>Wei Wuxian’s hazy thoughts finally click into place. The house. <em>Lan Wangji. </em></p>\n<p>Wei Wuxian tries to sit upright, but Jiang Cheng’s hands are on his shoulders pushing him back down again before he can even lift his head from the pillow. “Lan Zhan,” he says, desperately. “I have to - I just left him. He’s got to be so confused.” </p>\n<p>“Who?” Jiang Cheng asks, baffled. Then, “Never mind. Wei Wuxian, you just woke up from the longest fucking nap in history. You’re not moving so much as an inch until the doctor checks you out.” </p>\n<p>“You don’t understand,” Wei Wuxian says urgently. “I have to -” </p>\n<p>The door opens and Wei Wuxian manages to find the strength to turn his head. There’s a young woman standing by his bed in a white coat, staring at him with a look of utter amazement. “I thought I misheard,” she says. “You really woke up, huh?” </p>\n<p>Wei Wuxian stares at her. “Who are you?” </p>\n<p>“Wen Qing,” she says. “I’m the doctor that’s been making sure you didn’t rot away in that bed for the last few years.” </p>\n<p>Not for the first time, Wei Wuxian insists, “I wasn’t sleeping. I was <em>dead.” </em></p>\n<p>Wen Qing maneuvers Jiang Cheng out of the way of the bed as she approaches. She reaches down and picks up Wei Wuxian’s wrist, setting her fingers to his pulse points. “Don’t insult me,” she says. “You’ve been in picture perfect health except for the fact that you simply would not wake up.” She seems satisfied with whatever her touch is telling her, because she drops his wrist and plucks a small torch from her pocket. “Tip your head back for me,” she says, and then tucks her fingers beneath his chin and does it forcibly when Wei Wuxian is too slow. He winces as the light hits his eyes. </p>\n<p>“I don’t understand,” he says, feeling like a broken record. </p>\n<p>“Follow the light, please,” Wen Qing says in a no nonsense tone and Wei Wuxian obeys. She makes a thoughtful noise and, thankfully, turns off the torch and tucks it away. “What do you remember about the accident?” </p>\n<p>Behind her, Jiang Cheng’s pinched expression tightens. He looks miserable and guilty and when he sees Wei Wuxian staring at him he looks away quickly. “I’m going to call the others,” he says, and then vanishes out of the room before Wei Wuxian can press. </p>\n<p>He turns back to Wen Qing who doesn’t look surprised in the least by Jiang Cheng’s quick exit. She raises a brow at him expectantly. “Well?” she prompts. </p>\n<p>Wei Wuxian has to take a moment, forcibly wrenching his thoughts away from Lan Wangji and the big empty house. It’s on the tip of his tongue to say <em>‘I don’t’ </em>because for the past few years, Wei Wuxian’s death - what he had <em>thought </em>was his death - has been something of a mystery to him; just another thing he never allowed himself to think about too hard, because really, who wants to remember how they (supposedly) died?</p>\n<p>Now though, his thoughts are clearer. Hazy to a degree, but present. He supposes that after three years in a fucking <em>coma, </em>apparently, he might be forgiven for being a little confused. </p>\n<p>Hesitantly, he says, “I… there was a car crash?”</p>\n<p>He remembers sitting in the passenger seat, the bright lights of the street flashing by. He remembers… being upset. Trying to joke, to laugh, and Jiang Cheng taking his eyes off the road just for just a split second to say, tone biting and rough, <em>“Can’t you ever take anything seriously?” </em></p>\n<p>He doesn’t remember what came next. When he opened his eyes, he was back in the empty house, feet barely touching the ground. </p>\n<p>“You did die for a minute,” Wen Qing says. “They managed to revive you in the ambulance, but for whatever reason, you never regained consciousness.” She looks at him, assessing. “You healed up from the crash, and medically there was nothing wrong with you. You just did not seem to want to wake up.” </p>\n<p>Wei Wuxian would say that seems like something medically wrong with him, but the more he thinks about it the less true it feels. If haunting the shell of his childhood home had taught him anything, it’s that not all the things in the world make sense the way they feel they should. </p>\n<p>Wei Wuxian had died in that crash. <em>The textbook makings of a resentful spirit, </em>Lan Xichen had said. A ghost unable to move on because he was too bitter and restless - that hadn’t been wrong. It just turned out that he wasn’t struggling to move <em>on, </em>he was struggling to move <em>back. </em></p>\n<p>To Wen Qing, he says, “I need to call somebody.” </p>\n<p>“Your brother is already contacting your family. I anticipate they’ll be here very soon,” she says. </p>\n<p>“No,” he says urgently. “It’s somebody else. I have to…” realization dawns. He doesn’t have Lan Wangji’s phone number. Doesn’t have anything but his fucking house address. </p>\n<p>“Whoever it is, your family can contact them,” Wen Qing says. “For now, I’ve had the most mysterious patient I’ve ever treated wake up from his inexplicable, seemingly voluntary coma, so I’m going to need you to not push yourself and listen to me while we work on establishing a rehabilitation plan.” </p>\n<p>Wei Wuxian stares at her helplessly, struggling to think of a way to tell her that in the three years he’d been lying in this bed, he’d also been haunting his childhood home, harassing stranger after stranger as they moved in until eventually he’d fallen in love with one of them - that he’d left him alone and probably confused, with no way of knowing that Wei Wuxian was <em>alive. </em></p>\n<p>The door opens and Jiang Cheng strides back in. “Dad and jiejie are on their way,” he says. He looks to Wei Wuxian and says, “You made her cry again, so make sure you apologize for that.” </p>\n<p>This time, Wei Wuxian does manage to laugh. It sounds hoarse and dry and hurts his chest on the way out. “I will, I will.” </p>\n<p>Wen Qing turns to Jiang Cheng. “I’m going to run some scans, see if there’s been any lasting damage. See if we can figure out why he’s even awake <em>now </em>after all this time.” </p>\n<p>“Anything,” Jiang Cheng says. </p>\n<p>“Hey, shouldn’t you maybe ask the guy in question?” Wei Wuxian says, even though he doesn’t feel capable of making any decision at all right now. The longer he’s awake, the more exhausted he feels, but the novelty of being <em>alive </em>is too great and the idea of closing his eyes again is faintly horrifying. </p>\n<p>Jiang Cheng says, “You’ve been scientifically proven to be incapable of making your own choices.” </p>\n<p>Wen Qing says, “As your doctor, I advise you to be quiet and let me do my job.” </p>\n<p>Wei Wuxian slumps against his pillows. His heart is still beating unsteadily in his chest, and all he can think of is Lan Wangji alone in their big empty house, but he knows that he has to be patient; that if he starts rambling about being a ghost, about falling in love with somebody he’s never conceivably met, then there’s a very real chance it’ll be a long time before they let him out of the hospital at all. </p>\n<p>Patience has never particularly been his strong suit, but three months with Lan Wangji have taught him more of it than he ever thought possible. He can wait, just for a moment. He can put together a plan. He won’t leave Lan Wangji hanging - won’t leave him alone. </p>\n<p>But, for now, he has his family who have been mourning him as he wasted away in this hospital bed for three years. He has his <em>life</em>. </p>\n<p>He says, “Do what you have to do.” </p>\n<p>.</p>\n<p>Despite his intentions, once Wen Qing has finished putting him through what feels like every scanner in the hospital, Wei Wuxian cannot help but fall asleep again. </p>\n<p>He’s <em>tired. </em>It turns out being in a coma, whether it was possibly spiritually induced or not, is actually kind of an exhausting experience. He struggles for a while to keep his eyes open, justly paranoid about what happened the last time he closed them, but Jiang Cheng notices his struggle and sighs, aggravated, and drags his chair closer to the side of Wei Wuxian’s bed. “Go to sleep,” he says. “Stop being difficult.” </p>\n<p>“You’re every bit as comforting as I remember,” Wei Wuxian informs him, but despite himself he’s reassured anyway. He goes to sleep. </p>\n<p>The next time he wakes up, it’s to Yanli clinging tearfully to the side of his bed, saying his name over and over again like she never thought she’d get the chance to say it again. Behind her, Jiang Fengmian lingers, smiling softly. </p>\n<p>“Jiejie,” Wei Wuxian says, struggling to sit upright and offering her a smile that he’s sure looks hideous with his cracked lips and pale skin. At least Wen Qing finally let him have some water and brush his teeth so he no longer sounds and smells as if he’s been trapped in a desert for an eternity. “Are we sure I’ve been asleep for three years? You haven’t changed at all.” </p>\n<p>Her tearful smile is positively beautiful, and when Wei Wuxian opens his arms, she throws herself into them. “A-Xian,” she says again, squeezing tightly. “Thank you for coming back to us.” </p>\n<p>A kernel of guilt flowers in his stomach. He knows it’s not his fault, exactly, that he’d been trapped outside of his own life for the past three years, but he can’t help but feel as if it is. Maybe if he’d tried harder, he could have returned to them sooner. Maybe if he could have proven how much he loved them, the universe would have let him go. But then he wouldn’t have met Lan Wangji, and that isn’t a trade Wei Wuxian would make for anything. </p>\n<p>Honestly, he says, “I came back as soon as I could, I promise.” </p>\n<p>Finally, Yanli pulls back, knuckling away the tears in her eyes. She squeezes Wei Wuxian’s hand with one of her own, dainty and fine. It’s then that he notices the ring on her finger.</p>\n<p>“Jiejie, did you get <em>married? </em>To <em>who?” </em></p>\n<p>That shocks a laugh out of her. “Oh, A-Xian,” she says fondly, which tells him what he needs to know. </p>\n<p>“Jin Zixuan? Really?” He gives her a pleading look, tugging at her hand. “You had to do it while I was asleep, I guess, because you knew I’d have thrown a fit if I were awake.” </p>\n<p>Despite his intentions, her smile dims. “I wanted to wait for you,” she says. “Both of us agreed we would. But, well…” she blushes. </p>\n<p>“But?” Wei Wuxian repeats, suspicious. </p>\n<p>Over her shoulder, Jiang Fengmian says, indulgent, “You have a nephew, Wei Wuxian.” </p>\n<p>Wei Wuxian is momentarily blown away. All his youthful distaste for Jin Zixuan evaporating in the face of that announcement. Overwhelmed, he says, “You have a <em>son?” </em>Then, with dawning delight, he turns to Jiang Cheng. “We have a nephew!” </p>\n<p>Jiang Cheng’s smile is almost fond and he swats gently at Wei Wuxian’s arm. “I know, idiot. I’m the one who’s been on babysitting duty while you were snoozing.” </p>\n<p>“A nephew,” Wei Wuxian can’t help repeat again. “What’s his name?” </p>\n<p>Yanli smiles, and she looks to mostly be over her tears. “A-Ling,” she says. “I would have brought him to visit you, but it all happened so fast. We didn’t want to overwhelm you.” </p>\n<p>“Overwhelm me,” Wei Wuxian scoffs, even thought he had, perhaps, been a little overcome. “Next time, I want to meet him.” </p>\n<p>“Of course,” she says. She squeezes his hand once before stepping back. “Now, tell me, A-Xian, how have they been treating you here?” </p>\n<p>.</p>\n<p>Wei Wuxian spends the rest of the day with the family he thought he would never see again. He really doesn’t have much to tell them, given he’s been awake for less than a day and he still hasn’t quite figured out when or even <em>if </em>he should tell them the truth about his condition, but his family have three years of news to share with him. </p>\n<p>Madam Yu had supposedly volunteered to stay behind and look after little Jin Ling, but Wei Wuxian suspects she had made the executive decision to give them this peaceful reunion without the tension of their relationship hanging over the rest of the family. Regardless of the truth, he’s grateful for it. </p>\n<p>They tell him they sold the house shortly after the accident in order to move closer to the hospital where Wei Wuxian was receiving his care, and Jiang Fengmian seems guilty about it, even as Wei Wuxian assures him he understands. He can’t very well explain that he can hardly miss a house he’d seen all of a day ago and fully plans to return to. </p>\n<p>Eventually, visiting hours draw to a close, and although he’s sure that if Wei Wuxian asked, Wen Qing would probably bend the rules for them, he pushes them to go home. </p>\n<p>“I’ll be here tomorrow,” he promises. “I’m probably just going to pass out from sunset to sunrise anyway. You wouldn’t believe how tired playing sleeping beauty leaves you.” </p>\n<p>Yanli promises to bring Jin Ling with her, and Jiang Fengmian gives his shoulder a tight, comforting squeeze, emotion thick in his kind eyes. Surprisingly, it’s Jiang Cheng who lingers behind, hand on the doorway, looking hesitantly back. </p>\n<p>Wei Wuxian raises an eyebrow. “Yes?” </p>\n<p>Jiang Cheng scowls, looking away. “It’s nothing.” </p>\n<p>Wei Wuxian does not buy that in the slightest, but he’s too tired to press. Instead, he takes advantage of Jiang Cheng’s unstable mood to ask, “Do you think I could borrow your laptop for the night?” </p>\n<p>Jiang Cheng looks back up, instantly suspicious, clutching at the messenger bag over his shoulder. “Why? I thought you said you were going to sleep.” </p>\n<p>“I am, I am,” Wei Wuxian assures him. “Just… I’ve been out of the world for three years. I maybe want to catch up on some things, you know?” </p>\n<p>Jiang Cheng hesitates for a moment, and Wei Wuxian strives to look as innocent as possible. After a moment he sighs, shrugging the bag off his shoulder and pulling the laptop from inside. “Don’t break it,” he warns. </p>\n<p>“Wouldn’t dream of it,” Wei Wuxian says.</p>\n<p>Jiang Cheng pauses for a second time, seems to think something over, but then just shakes his head and leaves. Wei Wuxian watches his back disappear out the door, curious, and wonders if this is something else he should be worried about. Possibly - hopefully - Jiang Cheng is just struggling to process Wei Wuxian’s miraculous return to the world. </p>\n<p>Wei Wuxian waits until he’s sure nobody’s going to double back, and then he opens the laptop, struggles to connect the hospital’s free wifi, and navigates his way to google. </p>\n<p>Painstakingly, he types out <em>Lan Wangji, </em>heart in his throat.</p>\n<p>He does not find any social media accounts to speak of and he hadn’t necessarily expected to. What he does find is the staff page for the local university, Lan Wangji’s name listed neatly as an assistant professor in the history department. His unsmiling, beautiful face looks back at Wei Wuxian from the accompanying photograph. </p>\n<p>For a second, Wei Wuxian just sits there, staring. </p>\n<p>It’s not that he doubted his time spent as a ghost had been real, but the jarring reality of going from a spirit to <em>alive </em>has left him reeling, unsure whether he ought to trust his notoriously awful memory. Seeing the hard proof of it right in front of him though - that loosens the tight band around his lungs and the ache in his heart. </p>\n<p>He <em>knew </em>he hadn’t made Lan Wangji up. </p>\n<p>His profile has an email address where he can be reached for professional inquiries, and Wei Wuxian debates it for a moment, but in the end can’t bring himself to reach out in such an impersonal way. It just doesn’t seem right, not after everything. </p>\n<p>Instead, he searches up Lan Xichen instead, and this time hits gold with some semi-public social media accounts. The browser has him signed in as Jiang Cheng, but that’s possibly for the best because Wei Wuxian isn’t sure he even remembers his own account details at this point. It takes him several tries to draft out what he thinks is a fairly competent message trying to explain what had happened and attaches the hospital’s phone number at the end. </p>\n<p>He hits send and then, with nothing else to occupy himself with, he closes the laptop and tries to wait, heart pounding like a hammer. </p>\n<p>To his surprise it doesn’t take long at all. Maybe ten minutes later there’s a knock on his door, and Wei Wuxian looks up to see a nurse lingering at the threshold, phone in her hand, frowning. “There’s a gentleman on the phone for you,” she says. </p>\n<p>Wei Wuxian swallows thickly and offers his most charming smile. “Thanks,” he says, holding out his hand. </p>\n<p>“I’ll be back for the phone soon,” she warns. “You’re not supposed to have calls anyway.” </p>\n<p>Wei Wuxian had suspected as much, but to Lan Xichen sweet-talking a lonely nurse into letting him talk to Wei Wuxian was probably a piece of cake. “I won’t be long, I promise,” he says. </p>\n<p>She gives him one last suspicious look and wanders off. Wei Wuxian takes a breath and raises the phone to his ear. Hopefully, he asks, “Lan Xichen?” </p>\n<p>There’s a moment of silence and then Lan Xichen says, <em>“So it really is you, Wei Wuxian.” </em></p>\n<p>Wei Wuxian can’t help but let out a slightly deranged sounding laugh. “I could say the same to you! Let me tell you, when I opened my eyes to discover not only was I <em>not </em>gone, I wasn’t even <em>dead, </em>I was kind of worried about what else I might have mistaken.” </p>\n<p>Lan Xichen is quiet again, a lingering kind of silence that unsettles Wei Wuxian deeply. <em>“I suppose I don’t need to tell you that Lan Wangji has not been doing well in your absence.” </em></p>\n<p>Wei Wuxian’s heart lurches. “I only woke up this morning,” he says. “Trust me, I tried to reach you as soon as I could. I would have been out the door and halfway to the house if my doctor let me.” </p>\n<p>For a moment he’s not sure Lan Xichen is going to believe him. Wei Wuxian knows how protective he is of Lan Wangji, and while he’s never been hostile to Wei Wuxian, he has always been wary. Wei Wuxian doesn’t blame him. He’s a brother, too. He once punched Jin Zixuan in the face for calling his sister ‘homely and unremarkable’. He’s in no position to be throwing stones.</p>\n<p><em>“For the first time in his life, Wangji did not go to work today,” </em>Lan Xichen says. <em>“I know this not because he told me, but because his boss called me when Wangji did not show up for class.” </em></p>\n<p>Wei Wuxian squeezes his eyes shut. “I just want to see him again,” he says. “I didn’t know how to get in touch with him. Can you give me his number? Please, I’m desperate here, Lan Xichen. They won’t let me out of the hospital yet.” </p>\n<p><em>“No.” </em>Wei Wuxian’s heart sinks, but then Lan Xichen says, <em>“If you call him, I’m afraid he might not believe you right now. I’ll call.” </em></p>\n<p>It’s not exactly what Wei Wuxian wants, but he’ll take anything at all right now, doesn’t dare trample on Lan Xichen’s good will when he knows to offer Wei Wuxian this much at all is a bigger expression of trust than he’s probably due. “Yeah. Yes. Anything. You know where I am and how to get ahold of me.” </p>\n<p><em>“I imagine you’ll be hearing from him soon,” </em>Lan Xichen says. </p>\n<p>“Thank you,” Wei Wuxian says fervently. </p>\n<p><em>“It’s no trouble,” </em>Lan Xichen says. </p>\n<p>There’s a knock at the door and Wei Wuxian looks up to see the nurse from earlier is back, frowning at him expectantly. “Look, I have to go. I’m not even supposed to be on the phone. My doctor is going to kill me if she finds out.” </p>\n<p><em>“Yes, the nurse did seem reluctant when I told her who I was calling for,” </em>Lan Xichen says, and he sounds faintly amused. </p>\n<p>“I’ll talk to you soon,” Wei Wuxian says, wincing as the nurse pointedly taps at her watch. </p>\n<p><em>“Soon,” </em>Lan Xichen agrees. <em>“And Wei Wuxian?” </em></p>\n<p>“Yes?” </p>\n<p>\n<em>“I’m very glad that you’re alive.” </em>\n</p>\n<p>.</p>\n<p>Although he’d mostly been saying it to get his family to leave, Wei Wuxian, true to his word, sleeps pretty much from dusk to dawn, just as he’d promised. By the time Wen Qing slips into his room the next morning, he’s feeling almost alert. </p>\n<p>“Well,” she says, stepping forward to check the chart on his bed, “you’re looking chirpy.” </p>\n<p>Wei Wuxian flashes her a smile. “I went to sleep and woke up to find out I’m still alive, I don’t know what I have to be sad about.” </p>\n<p>She snorts, dropping the board and coming closer to check the IV drip still solidly embedded in his hand. “If you fall back into a coma on my watch, I’m going to be furious,” she says. “Your scans and blood work came back as clean as ever. As far as medical science is concerned, you mysteriously woke up from your equally mysterious slumber for no reason that anybody can find.” </p>\n<p>“That does sound like something I would do,” Wei Wuxian agrees, and this finally draws a smile out of her. </p>\n<p>She finishes fussing with his IV and says, “I think we might be able to take this out today.” </p>\n<p>“Does that mean I’ll actually get real food?” Wei Wuxian asks, thrilled. </p>\n<p>“It means you’ll get something weak and easy for your digestive system, yes,” she says, which is as good as a no, but Wei Wuxian is willing to take anything to get the last of the needles out of him at this point.</p>\n<p>“Never thought I’d yearn for hospital food,” he says wistfully. </p>\n<p>Wen Qing shakes her head in what he has to imagine is a fond manner. “Your brother’s here,” she says. “Do you want me to send him in?” </p>\n<p>Wei Wuxian blinks at her, surprised. “I thought visiting hours didn’t start until nine?” </p>\n<p>“They don’t,” she says. “Your brother seems to think the rules don’t apply to him.” </p>\n<p>“That would be my influence,” he tells her. “I’m a good big brother.” </p>\n<p>“I don’t doubt it,” she says dryly, but she leaves the room and a moment later the door opens again to admit Jiang Cheng, looking more tired than Wei Wuxian thinks he has the right to considering he’s not the one confined to a hospital bed. </p>\n<p>“Jiang Cheng,” he says, grinning and gesturing to the chair beside him. “Couldn’t stay away I see.” </p>\n<p>Jiang Cheng rolls his eyes but flops down beside him. “If you want to be alone I can leave.” </p>\n<p>“Don’t be like that,” Wei Wuxian says. “Who would ever say no to the joy of your company?” </p>\n<p>He expects Jiang Cheng to argue with him, bickering back and forth as is their strength, but he remains quiet. He’s not quite looking at Wei Wuxian, eyes fixed at the crumpled blanket over his lap. There are bruises under his eyes that look older than just one night of bad sleep can account for. </p>\n<p>Wei Wuxian’s heart twists. Three years he’s been gone. He has no idea what Jiang Cheng’s life has become in all that time. Who’s to say the man sitting beside him isn’t a stranger at this point? Without even blood tying them, all that’s left might have just turned to obligation. </p>\n<p>That’s a darker thought than he can stand to think so he clears his throat and says, “Wanna play go fish? One of the nurses left me a deck of cards. I tried playing solitaire but I’m pretty sure one of the aces is missing.” </p>\n<p>Jiang Cheng stirs, glancing up at him with a snort. “You don’t even know how to play solitaire as it is,” he accuses. </p>\n<p>Wei Wuxian digs the cards out from beneath his pillow and wiggles the deck at him. “That’s why you should play with me! C’mon, it’ll be just like when were kids. I promise I won’t even cheat.” </p>\n<p>Jiang Cheng sighs. “Just deal, Wei Wuxian.” </p>\n<p>It turns out there’s more than just one card missing, but Wei Wuxian thinks it adds to the charm of the game. When they were younger, Jiang Cheng was the reigning go fish champion of their house, but today he’s distracted, handing cards over without complaint and pausing before every question like he means to say something different entirely and changes his mind at the last second. </p>\n<p>Wei Wuxian debates not saying anything, he does, but in the end his curiosity and his concern outweigh his self-preservation, as has always been the way. After Jiang Cheng fails to ask for his two despite it obviously sticking out of the corner of his hand, Wei Wuxian sets the cards down. “So,” he says, “are we going to talk about it?” </p>\n<p>Jiang Cheng’s shoulders go bowstring tight. “About what?” </p>\n<p>“About why you look like you’re about to jump out the nearest window whenever we’re alone in a room together,” Wei Wuxian says bluntly, and he can see Jiang Cheng’s badly concealed wince. “If you don’t want to be here -” </p>\n<p>“Don’t be stupid,” Jiang Cheng snaps, cutting him off, and he sounds like he means it. </p>\n<p>Relief blooms deep in Wei Wuxian’s gut. “Then what is it? Is it something I did? Something I <em>didn’t </em>do?” </p>\n<p>Jiang Cheng visibly hesitates for a moment, and then he slams his cards down on the bedside table loud enough to make Wei Wuxian jump. Viciously, he asks, “How are you okay with it?” </p>\n<p>Baffled, Wei Wuxian says, “Okay with <em>what?” </em></p>\n<p>“What do you mean <em>‘with what’? </em>With me! With this! With everything!” Jiang Cheng gestures to Wei Wuxian laid up in the bed, to himself, to the room. “Aren’t you angry? Get mad at me! Yell at me! God, Wei Wuxian, I don’t need your pity, okay?” </p>\n<p>Wei Wuxian stares at him for a moment, blown away by the strength of his words, and then realization hits. Disbelieving, he asks, “Are you talking about the car accident, Jiang Cheng?” </p>\n<p>“What else would I be talking about?” he snaps. </p>\n<p>Wei Wuxian opens his mouth, thinks for a second, and then closes it. He shakes his head. “Jiang Cheng, you have to know I don’t blame you for that.” </p>\n<p>“I was the one driving,” he says. “I was - right before. We were arguing. I said… you know what I said. I took my eyes off the road.” </p>\n<p>The longer he’s been awake the more his memories of the accident have returned to him. He couldn’t forget them now even if he wanted to. He remembers the glow of the traffic lights turning from red to green, reflecting through the windshield and painting Jiang Cheng’s skin. He remembers his brother’s furious scowl, the sharp edge of his words designed to hurt, the tightness of his hands on the wheel. </p>\n<p>He remembers opening his mouth to say something as they pulled forward - and he remembers the blaring of a horn as the truck slammed right into them. </p>\n<p>“Jiang Cheng,” he says, gently as he can manage. “The truck ran a red light - nothing you did caused the crash. I would know, I was sitting right there.” </p>\n<p>“If I had been paying attention, I’d have seen it in time,” Jiang Cheng insists. “If I wasn’t so fucking busy <em>yelling </em>at you -” </p>\n<p>“Maybe you would have,” Wei Wuxian interrupts. “Or maybe you wouldn’t have. Maybe if you’d hit the brakes sooner rather than later <em>both </em>of us would have wound up in a coma instead.” He shrugs. “We’ll never know. For what it’s worth, I don’t regret it. I’m <em>glad </em>it happened the way it did.” </p>\n<p>“Don’t say that,” Jiang Cheng says, furious. His knuckles are white in his lap. “Don’t you <em>ever</em> say that.” </p>\n<p>Wei Wuxian looks at him, at the angry, miserable slump of his brother, and he can’t help but feel immeasurably saddened. He doesn’t know how to explain that he’s telling the truth, that he’s sorry for all the hurt he caused while he was unconscious but the three years he spent in this bed were not a waste - his brother is alive, his family is well, and he had gotten to meet and love the most brilliant man he’s ever met. </p>\n<p>He wants to though. He wants to tell his family <em>everything. </em>He wants to make Jiang Cheng understand that the both of them have been punished enough and that there’s no reason to keep carrying the burden he’s wrapped around his shoulders. </p>\n<p>Carefully, he reaches out and lays a hand on his brother’s fists. “Jiang Cheng,” he says. “I have something to tell you, and it’s going to sound absolutely ridiculous but I’m being perfectly serious here.” </p>\n<p>Jiang Cheng glances up, frowning. His eyes are slightly bloodshot. Wei Wuxian suspects from struggling not to cry. Suspiciously, he asks, “What?” </p>\n<p>“I,” Wei Wuxian says, “have spent the last three years as a ghost.” </p>\n<p>The silence that follows his announcement is almost comical. Jiang Cheng is so clearly dumbstruck that it’s wiped most of the fury from his expression. “What?” he says, a little stupidly. Then, “Wei Wuxian, this is not the time for your pranks. Right now? <em>Really?” </em></p>\n<p>Wei Wuxian shrugs throwing his hands up. “It’s true! I swear! I’ve spent the last three years thinking I was <em>dead </em>and living in our old house. Speaking of which, did you know you left a box of my old stuff behind in the basement when you moved? I’m hurt! Just because I used to lose my things doesn’t mean you shouldn’t go looking for them!” </p>\n<p>Jiang Cheng stares at him. “Wei Wuxian, you weren’t a ghost. You were a <em>coma </em>patient.” </p>\n<p>“No,” Wei Wuxian say stubbornly. “I was a ghost. I just also happened to be alive as well.” </p>\n<p>“If you’re trying to make me feel better, stop. It’s not working. This is ridiculous.” </p>\n<p>“I can prove it to you,” Wei Wuxian says. “In fact, I <em>will </em>prove it to you, hopefully very soon. I’m friends with the man who owns the house now, and I got in contact with him last night - well, his brother, it’s a long story.” </p>\n<p>“You can’t be friends with the owner of our old house,” Jiang Cheng says, exasperated. “You’ve been asleep for three years.” </p>\n<p>Wei Wuxian smiles brightly. “Which is exactly why I can prove it!” </p>\n<p>Jiang Cheng shakes his head, expression tight. “Wei Wuxian,” he says. He looks up, meeting Wei Wuxian’s earnest gaze, and whatever he was about to say seems to leave him. He sighs, pinching the bridge of his nose and getting to his feet. “Forget it,” he says. “I’m going to get some coffee.”</p>\n<p>Wei Wuxian knows better than to push right now. He doesn’t need Jiang Cheng to believe him right this second. He just needs him to know that later, when he <em>does </em>believe him - and he <em>will - </em>that Wei Wuxian had been telling him the truth.</p>\n<p>“If you smuggle me back one too I’ll give you my first born child,” Wei Wuxian says. </p>\n<p>“No,” Jiang Cheng says bluntly. “I already have to babysit one nephew, why would I need another?” </p>\n<p>He leaves, and Wei Wuxian keeps a close eye on his vanishing back. The tension that had been there when he’d come in seems to have eased at least, and Wei Wuxian takes that as a success for now. His brother is stubborn, but he’ll come around. He always does. That’s why they make such a pair. </p>\n<p>He starts cleaning up the mess of cards, shuffling them together and trying to figure out if he still knows any of his old card tricks. His fingers aren’t quite as dexterous as they used to be, but he hopes time will fix that. Time and a reunion with his flute, at least. </p>\n<p>Wei Wuxian is in the middle of trying to riffle shuffle the cards with only moderate success when there’s a knock at the door. He glances up, smile in place. “You’re back quick -” </p>\n<p>It’s not Jiang Cheng. The cards in his hands stutter and collapse across the bed. Wei Wuxian gapes. Standing in the doorway is none other than Lan Wangji, looking drawn and pale, but <em>there. </em></p>\n<p>“Lan Zhan,” he says weakly. “I - I was waiting for you to <em>call.” </em></p>\n<p>“We thought it was best if we just came straight down,” Lan Xichen says, appearing behind his brother’s shoulder. He smiles at Wei Wuxian. “It’s good to see you well.” </p>\n<p>Wei Wuxian nods vaguely, but can’t make himself reply. His eyes are still fixed on Lan Wangji who’s staring at Wei Wuxian as if he’s waiting for him to flicker into smoke and fog, to fade away as easily as he had the night he’d vanished. </p>\n<p>“Lan Zhan,” Wei Wuxian says again, voice a bit shaky. </p>\n<p>That seems to do the trick. Lan Wangji stirs, taking first one tentative step forward and then another until he’s standing by the side of Wei Wuxian’s bed, practically in touching range. He’s looking down at him, eyes wide and unreadable. “Wei Ying,” he says, and Wei Wuxian almost squirms where he sits hearing the familiar, deep tone of his voice. “You…”</p>\n<p>“Me,” Wei Wuxian agrees, slightly nonsensically, but he couldn’t care less. Lan Wangji is <em>here </em>and they’re both <em>alive </em>and holy shit, he’s thought about this so many times, wistful dreams he’d thought could never actually happen. Wei Wuxian can <em>touch </em>him. </p>\n<p>Once the thought enters his mind, there’s no dismissing it. Wei Wuxian’s been craving it for so long he doesn’t know who he was before that. He’s surging up on his knees and throwing his arms around Lan Wangji’s middle before he can think it through - think about how he knows Lang Wangji doesn’t like being touched, and how he’s not really meant to be moving like this, and they’re in the middle of the damn hospital. </p>\n<p>He doesn’t care. Everything else is secondary at best. Lan Wangji is <em>here. </em></p>\n<p>In the background, he distantly hear Lan Xichen say, “I’ll just go get some coffee or something, shall I?” Wei Wuxian scarcely notices. </p>\n<p>“Lan Zhan,” he says again, face pressed into Lan Wangji’s chest. “God, you feel so <em>real.” </em></p>\n<p>Lan Wangji is stiff beneath him, but only for a moment. Then, tentatively, his arms fall around Wei Wuxian’s shoulders. He bends slightly, curtain of hair falling around them, and rests his chin atop the mess of Wei Wuxian’s much more unwashed and much less impressive bed hair. “Wei Ying,” he says, soft. </p>\n<p>Wei Wuxian can’t help but laugh. It’s just so ridiculous. If one of them doesn’t stop saying the others name soon, this is going to get real pathetic. He can’t make himself pull back. He squeezes tighter. “I’m so sorry,” he says. “I know you must have been so worried. I didn’t want to leave, I promise.” </p>\n<p>Lan Wangji pulls away, and Wei Wuxian reluctantly lets him, but he only puts enough space between them so that his warm hands can cup Wei Wuxian’s face. “I know,” he says. “I am glad though, because now I get you like this.” </p>\n<p>Wei Wuxian beams up at him, feeling positively watery with all the emotions running a wreck through him. Lan Wangji’s face is tired and pale, but when he smiles at Wei Wuxian, it’s as beautiful and genuine as he remembers. Wei Wuxian can’t help but say, “Is that what you want, Lan Zhan? To ‘get’ me?” </p>\n<p>“Yes,” Lan Wangji says, so blunt that it actually renders Wei Wuxian speechless. “Only if Wei Ying also wants that.” </p>\n<p>Wei Wuxian reaches up, holding the hand that Lan Wangji has pressed to his cheek. “God, Lan Zhan. Of course. You know that. Your brother tells me I’m not very subtle. I was making an absolute embarrassment of myself towards the end there, even I know that.” </p>\n<p>“You were not embarrassing,” Lan Wangji says generously. </p>\n<p>“That’s very kind of you, Lan Zhan, but I was spending my nights watching you sleep so I think we both know that I was toeing some seriously dubious lines there,” Wei Wuxian says. Then before, he can lose his confidence, he uses his grip on Lan Wangji’s waist to haul himself up higher. “Hey, Lan Zhan, kiss me?” </p>\n<p>Lan Wangji looks down at him, and Wei Wuxian tries for his most charming smile as if his insides aren’t a tumultuous mess. Slowly, Lan Wangji bends down, and when his lips touch Wei Wuxian’s it’s both sudden and the natural conclusion of months of first falling over each other and then into each other. </p>\n<p>It’s probably embarrassing to admit that at twenty-three he’s never so much as kissed anybody before, but as Lan Wangji slowly tilts Wei Wuxian’s chin so that their lips slide together seamlessly, he thinks he probably wasn’t meant to. He’s spent all those years waiting for <em>this</em>. </p>\n<p>Somewhere behind them, the door rattles open. “What,” Jiang Cheng says as his coffee falls from his hand to spill on the floor, “the <em>fuck?” </em></p>\n<p>“Ah,” Lan Xichen says succinctly. “I see we returned too early.” </p>\n<p>Wei Wuxian pulls away, peering around Lan Wangji to see his brother standing in the doorway, Lan Xichen beside him, looking as if he’s walked in on something far more scandalous than what it actually was. He looks almost as shocked as he had yesterday when Wei Wuxian had blinked awake from a three year coma to find him standing over his bed. </p>\n<p>“Jiang Cheng,” he says cheerfully, reaching down to seize Lan Wangji’s hand. “This is the guy I was telling you about earlier. You know, the one who owns our old house?” </p>\n<p>Jiang Cheng opens his mouth, seems to find no words, and closes it again. Wei Wuxian almost feels bad for him. </p>\n<p>Surprised, Lan Xichen says, “You told him?” </p>\n<p>“Well, I wasn’t planning on keeping it a secret. How else was I going to explain Lan Zhan?” Wei Wuxian says, quite sensibly he thinks. </p>\n<p>Lan Xichen glances between Jiang Cheng’s stunned expression and then to where Wei Wuxian is still making a show out of holding Lan Wangji’s hand, leaning against his chest. “And did you tell him… about this development?” </p>\n<p>“It’s very recent,” Wei Wuxian says. </p>\n<p>Lan Xichen says, “I would ask you not to lie to me, Wei Wuxian. I have eyes and have spent the past several months sharing meals with the both of you.” </p>\n<p>Wei Wuxian grins ruefully. Beside him, Lan Wangji says, in that familiar pained tone of his, <em>“Brother.” </em></p>\n<p>“Holy shit,” Jiang Cheng announces, uncaring of the puddle of coffee spreading out beneath his feet. “You actually <em>were</em> a ghost.”<em> </em></p>\n<p>\n<em>.</em>\n</p>\n<p>Recovery turns out to be a slow process. Wei Wuxian had hoped, vainly it turned out, that if supernatural bullshit could keep him as a ghost when he was technically alive, then surely it could cut back on the rehabilitation time of being stuck in a bed for three years? </p>\n<p>The answer is no. No it cannot. </p>\n<p>Wei Wuxian’s family, who is still just ecstatic to have him back at <em>all, </em>seem unbothered by this development. Madam Yu herself tells him, “That you’re alive at all is unexpected. Don’t get greedy.” </p>\n<p>It’s perhaps one of the nicest things she’s ever said to him, which might purely be down to the fact she’d been bouncing Jin Ling in her arms when she said it. Wei Wuxian would like to say he’s shocked to find that Madam Yu makes a better grandmother than she ever did a mother, but he thinks that would be a lie. </p>\n<p>Lan Wangji sticks by his side throughout it all. He takes leave from the university despite Wei Wuxian repeatedly reassuring him that it’s not necessary, to which he only calmly reminds him that a portion of his work can be done remotely anyway. When Wei Wuxian tries turning to Lan Xichen to be the voice of reason, he simply says, “Let him. He hasn’t taken time off since he began teaching there anyway. It’ll be good for you both.” </p>\n<p>Wei Wuxian had been slightly worried how his family would take their relationship, but it turns out he needn’t have worried at all. Yanli cheerfully tells him, “It’s clear he dotes on you, A-Xian. You’d be very foolish to waste that kind of devotion. Besides, I’m glad something good came out of this mess.” </p>\n<p>Wei Wuxian eyes her suspiciously but takes the bowl of soup she pushes into his hands. It’s not strictly on his diet plan, but Wen Qing has developed a massive soft spot as far as Yanli is concerned and often allows her to smuggle her lotus root and pork rib soup providing she brings enough to share. “And the whole ghost thing? That doesn’t… scare you?” </p>\n<p>“Why should it?” she asks calmly. In her lap, little Jin Ling continues chewing on the lollipop Wei Wuxian’s rehabilitation nurse, Wen Ning, had snuck him. “Lan Wangji says you weren’t a very scary ghost at all.” </p>\n<p>“I could have been,” Wei Wuxian says. </p>\n<p>Yanli smiles and shakes her head. “A-Xian isn’t capable of scaring me,” she says. She gets up, gently setting Jin Ling down on the bed beside him. “I’m going to take the Wens their serve. Watch A-Ling.” </p>\n<p>“Of course,” Wei Wuxian says. “I’m his favorite uncle anyway. He loves to spend time with me.” </p>\n<p>Jin Ling doesn’t look up from the game he appears to be playing on Yanli’s phone. Wei Wuxian worries at the wisdom of giving a phone to a two year old, but he supposes that if something happens Jin Zixuan can afford to pay for it. </p>\n<p>He’s about halfway through his soup, enjoying the quiet company of his distracted nephew, when the door opens again and Lan Wangji pauses on the threshold. He looks at the two of them side by side in the bed and raises a brow. </p>\n<p>Grinning, Wei Wuxian says, “Lan Zhan! Perfect timing! You can’t get out of meeting A-Ling now.” </p>\n<p>“I have not been trying to,” Lan Wangji says, although the careful way he takes Yanli’s empty seat says that although he may not have been <em>trying </em>to avoid this occasion he certainly hasn’t been seeking it out. </p>\n<p>Wei Wuxian laughs, setting aside his bowl. “He’s just a child, Lan Zhan. He’s harmless.” </p>\n<p>The look Lan Wangji gives him says he’s not impressed with Wei Wuxian’s teasing. Well, that’s just too bad, because Wei Wuxian has no intention of stopping. He twists, plucking Jin Ling from his spot beside him and swinging him over onto Lan Wangji’s lap. He’s heavier than he expected and he can’t help but wince a little, admiring his sister once more for being able to haul this little bundle around as if it’s nothing. </p>\n<p>The alarm on Lan Wangji’s face is priceless. His hands come up instantly, as if scared Jin Ling is going to fall, but he hesitates, unsure about touching. “Here,” Wei Wuxian says, leaning forward to adjust him so that Jin Ling is comfortably in his lap and unlikely to go anywhere. Jin Ling still hasn’t looked up from his toddler game, completely unbothered. Wei Wuxian leans back and grins at the picture they make. “There you go, not so difficult is it?” </p>\n<p>“Wei Ying,” Lan Wangji says, vaguely long suffering, but he carefully wraps his arms around the child. </p>\n<p>They look so cute that Wei Wuxian can scarcely contain himself. “What do you think, Lan Zhan? Should we look at getting one of these ourselves?” </p>\n<p><em>“Wei Ying.” </em>The very tips of Lan Wangji’s ears are red, exactly the way Wei Wuxian likes them, and he can’t help but laugh, delighted. </p>\n<p>“It’s okay, we can’t go doing that until you make an honest man of me anyway. I wouldn’t want to disappoint jiejie. If she could get married before committing to some sprouts, so can we.” </p>\n<p>Despite the red in his ears, Lan Wangji’s expression remains as unflappable as ever. “Your brother would not like it if I were to ‘make an honest man out of you’ while you were still in the hospital.” </p>\n<p>“I don’t think Jiang Cheng is going to like it no matter when it happens,” he says. “But we can probably afford to wait, I guess. There’s no rush.” </p>\n<p>That softens Lan Wangji’s expression instantly, just as Wei Wuxian had known it would. All it takes is a single reminder that this is <em>real - </em>that the both of them get to have this for keeps - and he goes to putty in Wei Wuxian’s hands. It is intensely gratifying, but Wei Wuxian cannot afford to be smug about it because it tends to hit him just as hard too. </p>\n<p>“Yes,” Lan Zhan says. “We can wait.” </p>\n<p>“But,” Wei Wuxian says after a moment, “it <em>will </em>happen.” </p>\n<p>“Wei Ying,” Lan Wangji sighs again, which is as good as a yes. </p>\n<p>Wei Wuxian grins at him, unrepentant, and pats beside him on the bed. “Come on. There’s room up here for three.” </p>\n<p>Lan Wangji looks dubious, but he obediently stands up. He passes Jin Ling back to Wei Wuxian - who continues to be totally unbothered about being passed around like a hot potato - and very carefully takes the sliver of space on the mattress beside him. Wei Wuxian immediately plops his nephew down so that’s he’s half sprawled across both of their laps, a position Jin Ling seems to like because it allows him to kick his legs over Lan Wangji’s comfortably. </p>\n<p>“See? This isn’t so bad,” Wei Wuxian says. </p>\n<p>“I never thought it would be,” Lan Wangji says. “Anywhere with Wei Ying is good.” </p>\n<p>Wei Wuxian smiles, feeling dopey and soft. “We’ve talked about this,” he says. “Warning, Lan Zhan. You have to give me warning.” </p>\n<p>“Of course,” Lan Wangji says. Then, seriously, “I’m going to kiss you, Wei Ying.” </p>\n<p>He does, a heavy hand on the back of Wei Wuxian’s neck, the most comforting weight that Wei Wuxian has ever known. Against his mouth, Wei Wuxian mumbles, “And people say you don’t have a sense of humor.” </p>\n<p>From the doorway, Jiang Cheng snaps, “He doesn’t. Stop making out in front of my nephew, and get your hands off my brother.” </p>\n<p>Lan Wangji lingers for a moment, just to be difficult Wei Wuxian is sure, and then pulls back, putting a polite distance between them. Wei Wuxian turns to grin at Jiang Cheng who’s coming into the room balancing three cups of coffee. “Is that for us?” </p>\n<p>“Jiejie made me,” he says, setting the coffee down. To Lan Wangji, he says, “Don’t get used to it.” </p>\n<p>Without so much as blinking, Lan Wangji says, “Thank you.” </p>\n<p>Jiang Cheng scowls, sitting down heavily in the empty chair. “I didn’t do it for you.” He turns to Jin Ling and makes a move to pick him up, but he squirms out of his grip.</p>\n<p>“No,” Jin Ling says petulantly, and Wei Wuxian can’t help but let out a startled laugh, dropping a hand atop his nephew’s messy hair. </p>\n<p>“Not you too, A-Ling,” Jiang Cheng says. “This family is full of traitors.” </p>\n<p>“Sorry,” Wei Wuxian says with a shrug. “Guess we know who the favorite uncle is.” </p>\n<p>The look Jiang Cheng shoots him is murderous, but Yanli chooses this moment to return. The look on her face when she sees her son curled up with Wei Wuxian and a stone faced Lan Wangji is a thing to behold. </p>\n<p>“Oh!” she says, hands flying to her mouth, looking like she might just melt where she stands. “Oh, A-Xian, how cute. A-Cheng, take a photo.” </p>\n<p>“Why don’t you do it?” Jiang Cheng says, pained. </p>\n<p>“A-Ling has my phone.” She swats at his shoulder. “Quickly! Before A-Ling starts to get fussy.” </p>\n<p>The sigh Jiang Cheng gives sounds like it could move mountains but he obediently digs his phone out. “One photo,” he warns. “If you look ugly, that’s on you. I’m not doing it again.” </p>\n<p>“How dare you, Jiang Cheng. Lan Zhan could <em>never </em>look ugly.” </p>\n<p>“I’m going to suffocate you in your sleep,” Jiang Cheng says. “C’mon, quick.” </p>\n<p>Wei Wuxian shuffles closer, throwing an arm around Lan Wangji’s shoulder. Lan Wangji leans into him immediately, the way he always does. It’ll never stop being gratifying. Yanli smiles sunnily at them all, as if this is the best thing she’s ever witnessed. </p>\n<p>“Three,” Jiang Cheng says, “two, one…” </p>\n<p>At the very last second, Wei Wuxian twists up to kiss Lan Wangji on the cheek just as he hears the camera click. He’s immediately rewarded with the hand Lan Wangji has on his thigh tightening. </p>\n<p>“Oh, <em>gross,”  </em>Jiang Cheng says. “There is a <em>child</em> present.” </p>\n<p>Wei Wuxian pulls back, laughing so hard he’s positively giddy. “It’s just a kiss on the cheek, Jiang Cheng. Don’t be such a prude. Besides, somebody has to teach A-Ling to be affectionate.” </p>\n<p>The door rattles open in the background and Wen Qing says, sounding amused, “I see I’ve interrupted.” </p>\n<p>Instantly, Jiang Cheng gets to his feet. “Not interrupting! Good afternoon, doctor.” </p>\n<p>“Good afternoon, Jiang Cheng,” Wen Qing says, as if she doesn’t notice Jiang Cheng’s obvious and entirely unsubtle flush. Wei Wuxian supposes a complete lack of subtlety is a sibling trait. </p>\n<p>“Oh, <em>gross,”</em>  Wei Wuxian repeats, voice high. “There is a <em>child </em>present!” </p>\n<p>Jiang Cheng whips around to glare at him, hissing, <em>“Wei Wuxian!” </em></p>\n<p>Wei Wuxian sticks his tongue out at him, but when Yanli and Wen Qing turns to look the both of them are facing forward the picture of innocence. “Don’t mind me,” Wen Qing says. “I just came to thank your sister for the soup.” </p>\n<p>“You didn’t come to see me? Isn’t that your job?” Wei Wuxian teases. </p>\n<p>Peacefully, she says, “You can rot.” </p>\n<p>Wei Wuxian laughs and then once he starts he can’t seem to make himself stop. He turns, burying his face in Lan Wangji’s shoulder, grinning into the expensive fabric of his sweater as Wen Qing turns back to his sister and Jiang Cheng works at coaxing a reticent Jin Ling from the bed with very little success. One of Lan Wangji’s hands strokes through his hair. “Wei Ying?” </p>\n<p>Wei Wuxian shakes his head. “I’m fine,” he says. “Really, I promise.” </p>\n<p>Lan Wangji doesn’t say anything, but the careful way he tucks Wei Wuxian’s hair behind his ear is a question all on its own. Before, Wei Wuxian had thought he spoke Lan Wangji’s silent language quite well. Now, with the added benefit of his touch, Wei Wuxian has become practically fluent in it. </p>\n<p>He pulls back to grin up at him. “Really, I’m fine,” he says. “It’s just…” </p>\n<p>“Just?” </p>\n<p>“I’m not dead,” he says. “I’m not dead, Lan Zhan, and this is my <em>family.” </em></p>\n<p>Without having to explain, Lan Wangji seems to understand that ‘family’ includes him - includes his siblings, his nephew, and even Wen Qing who has patiently watched over him for three years and then saw him through his recovery with a stern devotion that surpassed her obligations. </p>\n<p>Wei Wuxian means, <em>I really can’t believe I get to be here </em>and he means <em>I really can’t believe I get to have this at all. </em></p>\n<p>Lan Wangji smiles. Wei Wuxian reverently adds it to the small but steadily growing collection he’s been cultivating. Lan Wangji leans forward and presses the world’s gentlest kiss to Wei Wuxian’s forehead, making him sigh in contentment.</p>\n<p>Jiang Cheng groans, “I literally <em>just </em>said -” </p>\n<p>Wei Wuxian closes his eyes and answers the smile he can feel against his skin. </p>"
}