{
  "id": "21981424",
  "url": "https://archiveofourown.org/works/21981424?view_full_work=true",
  "author": [
    "etymologyplayground"
  ],
  "title": "Linger in the Sun",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "陈情令 | The Untamed (TV)"
  ],
  "relationships": [
    "Lan Zhan | Lan Wangji/Wei Ying | Wei Wuxian",
    "Jiang Cheng | Jiang Wanyin & Wei Ying | Wei Wuxian"
  ],
  "characters": [
    "Wei Ying | Wei Wuxian",
    "Lan Zhan | Lan Wangji",
    "Jiang Cheng | Jiang Wanyin",
    "a whole SLEW of oc's"
  ],
  "additional_tags": [
    "Case Fic",
    "Intimacy",
    "Curses",
    "Canon Compliant",
    "Post-Canon",
    "Cuddling & Snuggling",
    "Getting Together",
    "Romance",
    "Sexual Tension",
    "Scent Kink",
    "m.. maybe??",
    "its not as intense as a kink",
    "wwx Loves To Teach",
    "oohh myg od... theyre married. wangxian are married",
    "Fluff",
    "this is so long and it is mostly. nonsexual intimacy! you're welcome",
    "Scars",
    "Sharing a Bed",
    "Wuji.MP3",
    "Nonverbal Communication",
    "this is HEAVY on the symbolism",
    "Перевод на русский | Translation in Russian"
  ],
  "language": "English",
  "series": "",
  "published": "2019-12-27",
  "completed": null,
  "words": "39,400",
  "chapters": "1/1",
  "comments": "940",
  "kudos": "15,160",
  "bookmarks": "5,937",
  "hits": "189,028",
  "summary": "<p>\"Tell Lan Zhan that I'm weeping uncontrollably,\" Wei Wuxian says to the juniors. \"Tell him I'm truly pitiful and he needs to do everything I say until I'm well again.\"</p>\n<p>Lan Congyi is in the middle of carefully holding his eyelids open to check his pupils, but he still obeys, bless him. \"Hanguang-Jun, Senior Wei would like us to tell you that he can't stop crying and he'd like for you to do everything he says until he's better.\" There's a moment of silence, and then Lan Congyi says to Wei Wuxian, \"Hanguang-Jun says he already does everything you tell him.\"</p>\n<p>--</p>\n<p>Wei Wuxian and Lan Wangji find themselves cursed, unable to see or hear each other. They figure things out anyway.</p>",
  "notes": "<p>translation in Russian <a href=\"https://ficbook.net/readfic/10661492\" rel=\"nofollow\">available here!</a></p>\n<p><b>content warning for a minor character briefly, nongraphically threatening to kill herself</b> (she does not attempt to follow through), and for an instance of <b>non-fatal drowning</b> of the POV character, which is unpleasant but resolved fairly quickly</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>THE END</p>\n<p>-</p>\n<p>HMM... WOW! WOW! I FINISHED THIS, FINALLY!!! WAHOO!!</p>\n<p>some notes and counterfactuals:<br>- lwj didn't actually formally Consider Them Married until wwx called him husband - he just considered himself \"closer to\" a widower, bc they were soulmates and he didn't intent on marrying anyone Else<br>- they DO have an actual wedding at some point. how could they not<br>- all of the magic in this is a combination of What Wikipedia Has To Say about <a href=\"https://en.wikipedia.org/wiki/Wuxing_(Chinese_philosophy)\" rel=\"nofollow\">the five elements</a> in daoism + original nonsense on my part! i tried to keep it reasonable + relatively vague but i'm certain my rendition of magic is colored by the western imagination. hopefully nothing is Obviously Fucky ó~ò<br>- similarly lan congyi's treatment of wwx's Pending Pneumonia is pretty rudimentary tcm stuff, i'm sure an actual trained practitioner wd have more to say than \"idk man eat spicy\" (but would wwx want to hear it...?)<br>- i do love jiang cheng but he does need his ass kicked by lwj sometimes<br>- title is from <a href=\"https://www.youtube.com/watch?v=dHLL7fGoLMQ\" rel=\"nofollow\">someday we'll linger in the sun</a> by gaelynn lea. they get to linger in the sun... NOW!</p>\n<p>gosh! anyway! thank you for reading!! catch me on twitter @sanlanglovemail where i'm quite active + talk about WIPs, or on tumblr @megafaunatic where i................ am not that. hahahahah</p>\n<p>happy new year ya filthy animals</p>",
  "text": "<p>\n<span>They'd almost kissed, back there. Well — probably not just then. They'd almost kissed a lot of times, by Wei Wuxian's estimation. Certainly he has made the conscious decision multiple times: the decision not to kiss Lan Wangji and potentially ruin things forever. Most recently they almost kissed when they reunited after a year apart; Wei Wuxian had been playing Lan Wangji's beautiful, nameless song for himself, and then Lan Wangji had appeared behind him as if summoned and he'd said, </span>\n<em>\n<span>Wei Ying, </span>\n</em>\n<span>and Wei Wuxian had run to him and clutched his arms and they'd almost — they'd almost —</span>\n</p>\n<p> </p>\n<p>\n<span>But then Lil Apple had brayed loudly and trotted over to investigate Lan Wangji's sleeves for treats, and Lan Wangji's band of new Lan juniors had crested the hill behind him, and the moment was lost. Again.</span>\n</p>\n<p> </p>\n<p>\n<span>Now it's the evening, and Wei Wuxian is tagging along with Lan Wangji and his new kids, because he doesn't have anything better to do and anyway he missed Lan Wangji terribly. He keeps catching himself staring at Lan Wangji over their campfire, which would be more embarrassing if he didn't keep catching Lan Wangji staring, too. Heavens above, this man. The worst is that Lan Wangji doesn't even look away when he gets caught; he just keeps watching Wei Wuxian with his strange golden eyes, his gaze intense, giving nothing away.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian wrenches his eyes away once again and looks back at the juniors. Goodness, they're young. Wei Wuxian was never that young! He sprang fully-formed from — oh, well, from Mo Xuanyu's bloody corpse, sort of. He shakes his head and says, \"So, tell me what you're up to, Young Masters. You must be on some night hunt or other, right? Give me your report so far.\"</span>\n</p>\n<p> </p>\n<p>\n<span>The kid who seems to be the head disciple of the group looks to Lan Wangji for permission. Lan Wangji inclines his head, and the kid recites, \"Ye Mi Village near the Yunmeng border has reported nine incidences in the past year of locals being struck with a variety of unusual curses. In particular, the curses seem to affect children between the ages of nine and twelve, although there have been outliers on either end. The curses are never fatal, simply strange and at times disabling.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I see, I see,\" Wei Wuxian says, nodding. \"Do you know any curse in particular?\"</span>\n</p>\n<p> </p>\n<p>\n<span>The kid nods, but he looks a little embarrassed when he says, \"Yes. One girl was cursed so that she couldn't speak, she could only sing. A boy was cursed with hair that grew an inch a day. Another girl was, um… her hands turned into frogs.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Wow,\" Wei Wuxian says. \"Like, live frogs?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Live frogs.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I see,\" Wei Wuxian says, trying not to laugh. \"Do the frogs at least do what she tells them?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I… do not know,\" the disciple admits.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian waves him off. \"It's fine, it's fine, it doesn't matter. Is that everything?\"</span>\n</p>\n<p> </p>\n<p>\n<span>The boy hesitates, then says, \"The village head's letter also mentioned that several people have been menaced by a large alligator in recent years. But… We are not convinced that the alligator is related. The village is on a river, and alligators are known to live in the next region over. Of course we'll deal with it if the alligator really is causing trouble for the villagers, but for now there's no reason to believe that it's anything worrisome.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Hm,\" Wei Wuxian says. \"Yeah, you're probably right about that. What are your thoughts, Hanguang-Jun?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji slides his hands into his sleeves thoughtfully. \"Agreed. Alligators here are rare, but not impossible. If it were a yao, it would be obvious, and the villagers would say so. Probably it's a lone animal washed from its ordinary hunting grounds by flood or some other force.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Right,\" Wei Wuxian agrees. \"And of course anyone who isn't used to seeing alligators would think it's scary and weird, and certainly it would be hard for a farmer to kill! I suppose if they insist that we deal with it, you Lans won't want to kill it, right?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"No,\" the head disciple says quickly, \"Killing animals unnecessarily is forbidden!\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Riiight,\" Wei Wuxian says. \"So what do you think you should do, if it comes to that?\"</span>\n</p>\n<p> </p>\n<p>\n<span>The kids sit in silence for a minute, thinking. Some of them have little Lan-ish frowns on their faces. The problem is pretty similar to the problem of the waterborne abyss, way back when; they don't want to destroy the alligator, but it would be nearly impossible to bring it elsewhere, too. Wei Wuxian waggles his eyebrows at Lan Wangji, then says, \"It's okay if you don't have an answer right now. Just something to think about.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Thank you, Senior Wei,\" the kids chorus. Wei Wuxian grins and nudges Lan Wangji.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Bet you never thought you'd hear a bunch of Lan disciples saying that,\" he teases, as the Lan disciples fall into quiet conversation amongst themselves.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Not when we were young,\" Lan Wangji admits. \"But I knew you would be a good teacher when I saw you at the Burial Mounds.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Hm,\" Wei Wuxian says, heart warmed. He nudges Lan Wangji again, and Lan Wangji presses back and doesn't move away. \"Hey, can't believe that little kid I buried in dirt isn't even a junior anymore,\" Wei Wuxian offers, tilting his head onto Lan Wangji's shoulder. </span>\n</p>\n<p> </p>\n<p>\n<span>\"Mm,\" Lan Wangji agrees. \"It's been a long time.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I've already forgotten the names of your new kids,\" Wei Wuxian admits. They'd all introduced themselves earlier that afternoon, when Wei Wuxian had first joined them, but, you know, it's like six Lans and then a Guo something and a Pei something… He can't be expected to keep track of everyone! \"Anyone related to anyone I know?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji nods. \"Lan Qubei is the son of Lan Huigang and Lan Xiaoyu,\" he says, indicating one of the kids. Wei Wuxian squints.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Who?\" he asks.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Second from the right,\" Lan Wangji says.</span>\n</p>\n<p> </p>\n<p>\n<span>\"No, no, I know which kid you're pointing at, who are his parents? Should I know them?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji looks down at him. \"Lan Huigang is the most accomplished female archer of our generation,\" he says. \"Her husband Lan Xiaoyu was the second Lan disciple after me.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Oh,\" Wei Wuxian says. He sits up and rubs his nose sheepishly. \"Well, I guess I never spent any time with them.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"They were in our class,\" Lan Wangji says. \"Lan Xiaoyu sat behind me. You saw him every day for months.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Oh! Well, if he was sitting behind you, how could I notice him? Like trying to look at a star when the sun's right there!\" Wei Wuxian laughs. Lan Wangji tugs his hair in admonishment. </span>\n</p>\n<p> </p>\n<p>\n<span>\"Wei Ying,\" he says. \"Be serious.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I am serious!\" Wei Wuxian protests. \"You know I didn't pay attention to anyone but you. Well, and Nie Huaisang and Jiang Cheng, but they were different.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Were they?\" Lan Wangji asks.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian thinks, </span>\n<em>\n<span>Uh oh. </span>\n</em>\n<span>But he says, \"Well, yeah. You were my soulmate, you know?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji stares at him for a long moment. Long enough for Wei Wuxian to start to sweat. But then he says, \"Yes.\" And then, to everyone at large, \"It is late. Prepare your tents for sleep.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Tents, huh,\" Wei Wuxian says, as the juniors start pulling ropes and bundles of oilcloth from their qiankun pouches. \"How luxurious of you.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Rain tonight,\" Lan Wangji explains.</span>\n</p>\n<p> </p>\n<p>\n<span>\"What, are you Lans made of spun sugar?\" Wei Wuxian teases. \"A little rain's good for you. Like a free bath.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji just looks at him. Wei Wuxian gives him his winningest smile. \"... Tell me that isn't the only time you bathe,\" Lan Wangji says at last.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian cracks up. A couple juniors freeze and stare at him, with varying levels of overtness. \"Yes, yes,\" he laughs, slapping Lan Wangji's shoulder in his hilarity, \"don't worry, Lan Zhan, I bathe, I bathe.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mm,\" Lan Wangji says. He looks down at Wei Wuxian's hand on his shoulder, but he doesn't look disapproving. He looks fond. Wei Wuxian squeezes once and releases him, still chuckling.</span>\n</p>\n<p> </p>\n<p>\n<span>\"I'll let you set up,\" he says. \"I should check on Lil Apple anyway.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"En,\" Lan Wangji agrees, and they both stand up.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian had tied Lil Apple to a tree a couple yards away. When he approaches, she looks up from her pile of apple cores (an offering from Lan Wangji — how long had he been collecting those?) and snorts a donkey greeting. He tugs on her ears in a friendly way, which she hates, then goes to retrieve his bedroll from the back of the saddle. He doesn't have a tent because he's not rich or a fucking weenie, but he does have a sedge rain cape, which is basically just as good. His saddlebags are charmed against the weather, so they'll be fine without his having to cover them.</span>\n</p>\n<p> </p>\n<p>\n<span>He loiters next to Lil Apple as the Lans set up their tents around the fire; he doesn't want to get in the way, and he'll take up so little space with his little bedroll that he can fit himself in just about anywhere. The kids, meanwhile, have three- or four-person tents to maneuver, so they should get first dibs on flat ground. Lan Wangji's tent is neat and narrow, essentially just a long rectangle of oiled and charmed white silk folded twice to make a triangular prism with room for one adult man inside. Wei Wuxian knows, in a vague sort of way, that in the Lan sect you only get your own tent when you're a senior, and before that everybody shares the large communal tents that belong to no one in particular; he wonders absently who had to share a tent with Lan Wangji. He can't imagine anyone involved enjoyed it very much.</span>\n</p>\n<p> </p>\n<p>\n<span>When the tents are all set up, Wei Wuxian wanders back over and picks a spot for his bedroll.</span>\n</p>\n<p> </p>\n<p>\n<span>It starts raining gently only an hour after the Lans go to sleep. But Wei Wuxian is an expert at sleeping anywhere, at any time, under any circumstances — he lived for three years in the Burial Mounds, of course he is! — so he's fine to sleep curled up under his rain cape, sitting in a sloppy lotus pose so that the rain slides down his back like it's supposed to. It's still a little early for him to sleep, but it's not like there's anything else for him to do, so he drifts off listening to the light rain and the cheerful burping of frogs.</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>*</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>A cool wet hand on his shoulder. A beloved voice saying, \"Wei Ying.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mmngnh.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Wake up.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian scowls sleepily and mumbles, \"If you're about to tell me it's time to get up I'll kick your ass, Lan Zhan. No way it's five.\"</span>\n</p>\n<p>\n<span> </span>\n</p>\n<p>\n<span>\"It is not,\" Lan Wangji admits. Wei Wuxian cracks an eye open to look at him. He's hard to make out in the dark, even crouching so close next to Wei Wuxian with an umbrella in his hand; his unbound hair is so black it becomes indistinguishable from the shadows behind him, his white sleeping clothes appearing dark blue. He raises one elegant hand and puts a finger to his lips. \"Don't wake the juniors,\" he says quietly.</span>\n</p>\n<p> </p>\n<p>\n<span>\"What the hell are you doin' up? Something going on?\" Wei Wuxian asks in a whisper. Surely if there were an emergency happening, Lan Wangji would have said so right away? Wei Wuxian glances around; it's so dark that even the white Lan tents are barely visible against the black trees. It's raining crazy hard, big fat raindrops making their way past even the tightly-woven fibers of his cape. He scrunches his nose in dismay and flicks water from one hand. \"Wet,\" he complains.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yes,\" Lan Wangji agrees. \"It is raining too hard for you to be outside. Come sleep with me.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian raises his eyebrows. \"Hanguang-Jun, how forward of you,\" he teases. \"We haven't even gone on any dates.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji just Looks at him. Wei Wuxian grins cheekily and prepares to be ignored. But Lan Wangji says, \"Haven't we?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Oh.</span>\n</p>\n<p> </p>\n<p>\n<span>Well… alright. Wei Wuxian swallows and says, \"Alright, fair. Is there even room for two in your tent?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"No,\" Lan Wangji says. \"But it is better than nothing.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian looks at him in the dark. Lan Wangji looks back. Wei Wuxian is suddenly very eager to know just how much room there is in his tent. \"Okay, sure,\" he says. \"Lead the way.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji stands wordlessly and switches his umbrella to his left hand, then offers his right hand to Wei Wuxian to grasp as he stands. Wei Wuxian accepts his hand and keeps holding it as they pick their way over to Lan Wangji's tent, only dropping it to untie his cape from around his shoulders. He lets the cape fall with a splat onto the muddy ground, and Lan Wangji immediately steps closer with the umbrella. Wei Wuxian smiles to himself, then asks, \"Head first?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji looks blankly at him for a moment, and then he says, \"Pardon?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian raises his eyebrows. \"Are you the one who's been awake for two minutes, or am I? Your tent is so narrow, should I crawl in head-first or feet-first?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Ah,\" Lan Wangji says, and then, \"Feet-first. Leave your boots outside under the canopy.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian does that. In addition to being good at sleeping anywhere, he's also good at wriggling, so Lan Wangji's goofy narrow tent is no match for him. It's not a particularly comfortable setup inside; Lan Wangji was using a cloak as a blanket and his own rolled-up outer robes as a pillow, so it's all pretty lumpy and uncushy. But it's warm and dry and it smells like Lan Wangji, so he loves it. He rolls to one side and Lan Wangji slides in beside him, then closes the front flaps, and then they're lying next to each other in almost complete blackness.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Thanks,\" Wei Wuxian whispers, after a moment of just listening to the rain pouring down on the oiled silk of the tent.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mm,\" Lan Wangji says. \"I woke up and heard the rain. Had to come get you.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian smiles again. This man. He shifts so that he's lying on his side more properly, his head pillowed on his arm to face Lan Wangji, whom he can't see but knows must be on his back with his arms folded over his stomach like a proper Lan. \"So good to me, my Lan Zhan,\" he praises sleepily, closing his eyes. Then, \"You have enough room, right? D'you need me to move?\"</span>\n</p>\n<p> </p>\n<p>\n<span>There's the sound of Lan Wangji moving next to him, and then he reaches over Wei Wuxian's side, evidently to see how much space is between his body and the side of the tent. When he inevitably finds that the answer is 'none, and it's a little damp, actually,' he slides his hand down Wei Wuxian's back and pulls him closer, towards the middle of the tent. Wei Wuxian lets himself be pulled so that his chest is touching Lan Wangji's other arm, and then he says, \"Do you wanna just —\" and Lan Wangji says \"Would you —\" and Wei Wuxian says, \"Lan Zhan,\" and they fall into each other, exhaling at the same time, wrapping their arms tight around each other's chests. Wei Wuxian ends up draped diagonally on top of Lan Wangji's chest, which is surprisingly comfortable.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yes,\" he breathes into Lan Wangji's collar, \"yes, yes, yes, yes,\" and Lan Wangji holds him closer, inhales deeply. Pressed close to him like this, Wei Wuxian can feel Lan Wangji's heart beating hard in his chest, the way his breath stutters when Wei Wuxian puts one hand in his hair. \"Lan Zhan,\" Wei Wuxian whispers, \"Lan Zhan, I missed you.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji exhales shakily and slides his hands up and down his back. \"Missed you too,\" he murmurs. He inhales deeply again, nuzzling at Wei Wuxian's hairline.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Eh, Lan Zhan ah, are you smelling me?\" Wei Wuxian mumbles. When Lan Wangji remains pointedly silent, he clarifies, \"I'm not judging you, I'm just, I probably don't smell very good right now. Probably smell like sweat and donkey.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"You do a little,\" Lan Wangji admits, and Wei Wuxian groans.</span>\n</p>\n<p> </p>\n<p>\n<span>\"You weren't supposed to agree with me!\" he whines.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Hush,\" Lan Wangji whispers. \"Do not disturb the others.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian rolls his eyes, although he knows Lan Wangji can't see it in the dark. \"Lan Zhan is so mean,\" he whispers back. \"Calls me smelly and then doesn't even let me complain about it… Well, you're no bouquet either, Hanguang-Jun! You smell like — like —\" He pauses and pushes his face into Lan Wangji's neck and breathes in deeply. Lan Wangji waits patiently for him to finish his insult, but, unfortunately, there's nothing to insult. Lan Wangji smells just as good as he always does. \"Augh, I can't even bring myself to slander you, Lan Zhan,\" Wei Wuxian sighs. \"You just smell like expensive incense. And maybe a little sweat.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Sweat?\" Lan Wangji asks, dismayed.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yeah, but that's not a bad thing. It's good. It's manly, it's sexy. Don't worry about it.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji makes the sort of huffing sound that he makes when he's not sure if he's amused or just perplexed. Wei Wuxian pats him supportively. It's nice here, with his face tucked into Lan Wangji's throat, and Lan Wangji's hands warm on his back. He snuggles closer, tangles their legs, mumbles, \"This is good, right? We're good like this.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mm,\" Lan Wangji agrees. \"Very good.\" He squeezes Wei Wuxian's waist for emphasis. Wei Wuxian twists his fingers in Lan Wangji's hair and tries not to kiss him. They're surrounded by kids. Kissing can wait a little longer.</span>\n</p>\n<p> </p>\n<p>\n<span>\"G'night, Lan Zhan,\" he says. \"Keep me warm, okay?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mm. Goodnight, Wei Ying.\"</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>*</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>It's getting light out by the time Wei Wuxian wakes up again, the off-white silk of the tent turned pale gold by the lightening sky outside. The rain stopped at some point, and the late-summer birds are out in full force, louder even than the frogs had been, but what wakes Wei Wuxian is Lan Wangji gently extricating himself from his sleepy grasp and easing out of the tent.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Nooo,\" Wei Wuxian whines, making clumsy grabby hands at Lan Wangji's heels where they're still visible just beyond the tent flaps. \"No, stay, Lan Zhan, I'll get cold… Or you'll get cold…\"</span>\n</p>\n<p> </p>\n<p>\n<span>After a moment Lan Wangji crouches and flips one flap aside to peer down at him. Somehow he's already put his outer robes back on, which Wei Wuxian thinks is cheating. \"Come help light the fire,\" he suggests, as if that's an immediate solution. Wei Wuxian pouts up at him, but he knows Lan Wangji isn't going to crawl back into the tent and hold him some more, so he forces himself to get up and slither out of the tent and into the morning.</span>\n</p>\n<p> </p>\n<p>\n<span>The Lan juniors are already up and scampering around, shaking water off of things, dismantling tents, et cetera. A couple of them slide curious looks towards him, which makes sense; he did go to sleep outside and wake up in Hanguang-Jun's tent, after all. He tugs his boots back on and wanders over to Lil Apple and gives her a smooch on the nose, which she hates and almost bites him for, then he rifles through one of his saddlebags and retrieves an apple and his fire kit. He gives the apple to the donkey, then he returns to where Lan Wangji is sitting on a stump by the stack of firewood. \"Morning,\" he says, petting the top of Lan Wangji's head absently.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Good morning, Wei Ying,\" Lan Wangji replies. He draws a talisman in the air and flicks it into the wet black coals of last night's fire. After a moment, the rainwater in the coals hisses and steams, rising to join the humid morning air, and the remains of the fire are left dry and reignitable. Wei Wuxian pets him again as he does the same to the stack of firewood. Lan Wangji tilts his head briefly into it.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Hey, kids, you wanna learn something cool?\" Wei Wuxian calls to the juniors at large. The juniors glance around at each other and at Lan Wangji, then they convene to sit around the site of the fire. Wei Wuxian gestures at the charcoaled logs. \"Can anyone tell me how you'd light this fire?\"</span>\n</p>\n<p> </p>\n<p>\n<span>The kids look at each other again, and then the head disciple — Lan... Faseng, maybe? — stands up to volunteer, \"I would use a minor fire talisman. The wood is dry already, so it would catch easily and burn warm, and minor fire talismans don't take much spiritual energy to use.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Right,\" Wei Wuxian says. \"That's a good answer.\" Lan Faseng blushes and visibly refrains from preening. Wei Wuxian continues, \"But what if you can't use spiritual energy at all?\"</span>\n</p>\n<p> </p>\n<p>\n<span>The juniors look at him cautiously. One of the ones whose name he doesn't know stands up and asks, \"Can one… use resentful energy in the same way?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"One can,\" Wei Wuxian allows. Lan Wangji places a hand on the back of his calf in warning. \"But </span>\n<em>\n<span>you</span>\n</em>\n<span> wouldn't, right?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"N-no…\" the boy says. \"I don't know how.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"That's a good thing,\" Wei Wuxian reassures him, and he relaxes a little. \"So if you can't use spiritual energy and you don't want to use resentful energy, how do you light a fire?\"</span>\n</p>\n<p> </p>\n<p>\n<span>The boys look at him, stumped. Wei Wuxian tries not to laugh; it's not their fault they've been immersed in the cultivation world their entire lives.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Think of the five phases,\" Lan Wangji suggests. Wei Wuxian pets him again. \"What generates fire?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Wood!\" a third boy answers. \"Wood feeds fire. But… that's only if there's a fire to be fed.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"No,\" Lan Faseng says slowly. \"You can make a fire by rubbing two pieces of wood together, right?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Right!\" Wei Wuxian says. \"Wood feeds fire, fire produces earth, earth yields metal, metal attracts water, and water grows wood. Ya?\" The juniors all chorus their agreement. \"Good, good, so that old man is teaching you something useful after all,\" he teases.</span>\n</p>\n<p> </p>\n<p>\n<span>\"So you'll make fire using two pieces of wood?\" the third boy asks.</span>\n</p>\n<p> </p>\n<p>\n<span>\"No, I'm going to use earth and metal,\" Wei Wuxian says, and the kids gasp in confusion and dismay. \"The philosophy of the five phases is true and important. But real life is more complicated than that!\" He produces his fire kit and shows the kids his flint and steel. \"This is a special kind of rock that makes sparks when you hit it against steel. That's what common people use when they need to set fires.\"</span>\n</p>\n<p> </p>\n<p>\n<span>He walks them through the creation of an ember, using fluffy reed fiber from his fire kit and passing it around from junior to junior so each boy can blow on the sparks inside, until at last the little bundle ignites in one of their faces. Then he guides that boy to place the ember under a pyramid of smaller sticks, and finally to place fresh logs on top. \"You see?\" he says at last, when they've successfully gotten the fire going. \"It's easy.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Most of the juniors make noises of agreement, but one of them — the one who suggested using resentful energy — shakes his head in polite disagreement. \"It's easy, but it takes so long,\" he says. \"It's good to know, I guess, but when will any of us ever need to make a fire without spiritual energy?\" He gestures to the group at large.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian sits down on the ground next to Lan Wangji, who's still sitting on his stump. That puts his thighs right at head-leaning height, so Wei Wuxian does just that. \"Someday, you may find your spiritual powers bound temporarily,\" he says, tapping his nose knowingly. \"That can happen even to such people as the illustrious Hanguang-Jun, you know. Or — although I pray this won't ever happen to you — something may happen to your golden core, and you won't have any spiritual powers at all.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"What?!\" one of the juniors gasps. \"I would rather </span>\n<em>\n<span>die.\"</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>\"You may rather die,\" Wei Wuxian allows. \"But in general I've found death is worse than the alternative.\" Then it's his turn to receive pets on the crown of his head.</span>\n</p>\n<p> </p>\n<p>\n<span>\"But you</span>\n<em>\n<span> have</span>\n</em>\n<span> a golden core,\" the same junior points out. \"How would you know?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I do not have a golden core,\" Wei Wuxian says. \"I do know.\" Lan Wangji's hand stills in his hair, and the kids all stare at him in slowly mounting horror.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Is it… is it because you died and came back??\" one of them asks. That's Lan Qubei, right? His classmates' kid? Pretty bold!</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian laughs. \"No, I lost it during the Sunshot Campaign,\" he says. The kids gasp again. \"I actually don't know what would have happened if I'd had it when I died.\" If he would have died at all, with a golden core. He scratches his nose thoughtfully and admits, \"I </span>\n<em>\n<span>wrote</span>\n</em>\n<span> the spell that was used to bring me back, but I'll be honest, it didn't even work how I thought I would. I'd thought that whoever used it would literally be possessed by the spirit they summoned, which would have meant that I'd get access to a golden core again. But I got my whole body back, just like how it was when I died. It's probable that my golden core would have come back with me, but I honestly don't know.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Qubei frowns. \"Why didn't the spell work like you thought it would? Shouldn't it just do what you say it should do?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian frowns back at him. \"Eh! Such criticism! Do you see any Lan Qiren teaching the theory and practice of demonic cultivation? Some things you must figure out yourself, Young Master, and sometimes that means getting things wrong.\"</span>\n</p>\n<p> </p>\n<p>\n<span>He doesn't mean it to be particularly harsh, but Lan Qubei blanches and looks away in shame. Lan Wangji places a careful hand on the back of Wei Wuxian's neck, under his ponytail; Wei Wuxian isn't sure if it's in reprimand or support until Lan Wangji sweeps his thumb comfortingly along his hairline. Worried he's made things too serious, Wei Wuxian says quickly, \"It's not a big deal, though, and now I know a little bit more than before! Anyway: the lesson is that common people are just as resourceful and adaptable as cultivators, and it behooves you to know a little about how they do things, too.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Thank you for the lesson, Wei Ying,\" Lan Wangji says pointedly, and the juniors echo, \"Thank you, Senior Wei,\" which will never get old.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yes, yes, you're very welcome,\" Wei Wuxian dismisses them. \"Now where's breakfast!\"</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>*</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>They're back on the road by eight. Ye Mi Village isn't far from where they are now; they should get there in the mid-afternoon, with plenty of time to find lodging and begin investigation. Wei Wuxian decides to give Lil Apple a break for today so that he and Lan Wangji can walk side by side, with Lil Apple behind them. Ordinarily, as the senior of the group, Lan Wangji would be walking in front of all the juniors, but Wei Wuxian convinces him to walk behind them so that he can tell Wei Wuxian, once again, what all the kids' names are. There's eight whole kids! That's eight names he's expected to remember!</span>\n</p>\n<p> </p>\n<p>\n<span>So he and Lan Wangji walk together and talk quietly about the juniors, and the juniors walk together and, presumably, talk quietly about the two of them. Or about lunch, or meditative practice, or whatever Lan kids are supposed to talk about when they're allowed to speak at all. Wei Wuxian is pleased to see that Lan Wangji actually knows a little bit about each boy — not a lot, because he's still himself, but just little anecdotes, favorite foods, random skills. Enough for Wei Wuxian to know that he's been paying attention.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Lan Zhan,\" Wei Wuxian says at last, once he's able to name each boy with only a little bit of waffling and um-ing involved.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mm. I'm listening.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian turns to face him fully and says, \"Lan Zhan, I'm really proud of you.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji sort of blinks at him in surprise.</span>\n</p>\n<p> </p>\n<p>\n<span>\"I'm serious,\" Wei Wuxian tells him. \"You're amazing! You're a really good teacher to them. You've grown up into a truly wonderful person, Hanguang-jun.\" He bumps his shoulder against Lan Wangji's in a friendly way, grinning widely as Lan Wangji's ears begin to redden.</span>\n</p>\n<p> </p>\n<p>\n<span>\"... You too,\" Lan Wangji manages after a couple seconds of embarrassed silence.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Hmm?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I'm proud of you, too,\" he says. He glances at Wei Wuxian, then looks away quickly. \"Wei Ying... is also wonderful.\" </span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian's smile fades a little. \"I'm not sure about that one,\" he admits. Lan Wangji looks back at him, eyebrows drawn together ever so slightly, so he quickly rallies, \"But if Lan Zhan says so, then it must be true.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji nods shortly. \"It's true,\" he declares, and he says it so easily, like, </span>\n<em>\n<span>of course. </span>\n</em>\n<span>Of course he would be proud of Wei Wuxian, of course he can say something like 'Wei Ying is wonderful' and not choke on his words. Wei Wuxian wants, suddenly, to cry. To kiss him. To kiss him and cry at the same time, although that probably wouldn't be the greatest first kiss anyone's ever had. Instead of doing either of those things, he swallows and blinks hard and reaches out to grab Lan Wangji's hand, which is so warm in his own. Lan Wangji looks at him curiously, but he squeezes Wei Wuxian's hand back, and they don't stop holding hands until they get to the town.</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>*</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>Once there, they find the house of the village head, and the juniors administer a full interview. The full rundown of curses is as follows:</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian must admit that he has to hold back a chortle once or twice. Not to be mean, but some of them are really funny! But of course, they're also unpleasant or even scary to live with, and the victims are all children, so he reigns himself in.</span>\n</p>\n<p> </p>\n<p>\n<span>(Okay, the kid who can talk to chickens and goats has it pretty good. Wei Wuxian doesn't know what that kid's doing, complaining about something cool like that.)</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>*</span>\n</p>\n<p> </p>\n<p>\n<span>They investigate each child one at a time, beginning with those at the eastern end of the village, where they arrived, and ending at the far western end. In general, each interview takes about half an hour; the eight-year-old with the ears/eyes trouble has a tendency to talk long, which is unfortunate because he's really pretty unpleasant to look at, but Young Master Inky Armpits is helpfully concise. </span>\n</p>\n<p> </p>\n<p>\n<span>By the time they've interviewed the first five kids, the pattern is clear: each child was outside playing at some point in the last several months, and suddenly found themselves. The curses happened one at a time, but without any obvious pattern in the way they occurred: the time lapsed between one curse and the next varies apparently at random, between weeks and mere hours; the children weren't cursed in any particular order regarding age, gender, family wealth, or location in the town. The children all know each other because the town is so small; some of them are friends, but not all of them. Wei Wuxian is more than a little intrigued, and he can tell Lan Wangji is as well.</span>\n</p>\n<p> </p>\n<p>\n<span>The last person to be interviewed is the screaming girl, because she lives at the far edge of town. Her parents are visibly relieved that cultivators have arrived. The mother cautions them, \"Please don't be afraid of a-Qian. Her screaming is very loud and disturbing, but she really isn't angry. She can speak fine, she just… has to scream, when you speak to her.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I know someone like that,\" Wei Wuxian jokes, thinking of course of Jiang Cheng. </span>\n</p>\n<p> </p>\n<p>\n<span>A-Qian's mother laughs weakly, but her father just scowls. \"That lunatic is in the kitchen,\" he says gruffly. \"Good luck.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian frowns at him. \"She's cursed,\" he says. \"Not a lunatic.\" But the father just huffs, like he's not so sure.</span>\n</p>\n<p> </p>\n<p>\n<span>There isn't room for the whole group of them in the kitchen, so Lan Wangji, Wei Wuxian, and Lan Faseng stay in the cool dark of the house while the others go back outside. There is indeed a girl in the kitchen; she's poking miserably at a pot of stew on the stove. Lan Wangji raps politely on the doorframe and a-Qian looks up, her eyes widening slightly in realization, and they all exchange bows.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian says, \"Good afternoon, young—\" and a-Qian screams wordlessly. He was expecting it, but he still twitches in surprise, and Lan Wangji puts a hand on his back briefly. Beside them Lan Faseng has the kind of look one gets when one is thoroughly rattled and trying not to show it.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Sorry, daozhangs,\" a-Qian says, although she doesn't look particularly sorry at all. \"I'm not trying to do it.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"We know,\" Wei Wuxian says quickly, managing to get it out right before she screams again. When she's done he turns to Lan Wangji and says, \"It's alright, right, Lan Zhan?\" In his peripheral vision Wei Wuxian sees a-Qian twitch abortively, like she was about to scream again and didn't. Lan Wangji nods.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Miss Po, can you —\" Lan Faseng begins, then shuts up as she shrieks. \"Um, can you tell us —\" Another scream. \"Miss Po, when did —\" Another scream.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian strokes his chin thoughtfully and says pointedly, \"Lan Zhan, I wonder if perhaps Miss Po could tell us how long this has been going on.\"</span>\n</p>\n<p> </p>\n<p>\n<span>He's expecting surprise from a-Qian, maybe relief that he's found a way around her curse. But she seems almost sullen when she says, \"This one has been cursed for the last two months, daozhang. Just like the others.\"</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Not quite, </span>\n</em>\n<span>Wei Wuxian thinks. Miss Frogs-for-hands and Young Master Inky Armpits have been that way for around two months, but others have been cursed for as long as six months or as recently as two weeks. He nods as if it's an unimportant distinction, and says, \"Young Master Lan, where do you think Miss Po was when she first became cursed?\"</span>\n</p>\n<p> </p>\n<p>\n<span>A-Qian says, \"I woke up one morning and I was like this.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Lan Zhan, you hear that? How interesting,\" Wei Wuxian says idly. Meaning: the other kids all became cursed when they were outside playing. She just woke up like that? \"That must have been pretty scary for Miss Po! I wonder, how old did Master Po say she was, again? Fifteen? What a scary thing for a fifteen-year-old to go through!\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I'm sixteen,\" a-Qian corrects him miserably.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Sixteen, thank you, th—\" Wei Wuxian says. A-Qian bellows loud enough to hurt his ears. \"Right,\" he says, wincing. \"Lan Zhan, please excuse me for a moment. Young Master Lan, with me.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Sorry,\" a-Qian says, not sounding sorry at all.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian and Lan Faseng file out of the kitchen. It's just a normal little house; he understands Master Po works at the rice mill on the river, so the family surely isn't wealthy but they aren't quite peasants, either. There's a shiny red trunk by the door gathering dust. Master and Madame Po bow to both of them as they leave the kitchen, and Wei Wuxian bows back. \"The interview is going well,\" he reassures them. \"Miss Po is very brave, she's telling us exactly what we need. I was wondering if perhaps I could trouble you to speak with my juniors? This here is Young Master Lan Faseng, the head disciple of the Lan Sect.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Oh, yes, of course, daozhang,\" Madame Po agrees. Her husband grunts. \"There's room for all of us on the porch, if Young Master approves?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Faseng slides a curious glance at Wei Wuxian, who gives him a discreet nod. \"Young Master Lan and his peers would just like to go over everything you remember,\" he says, and Lan Faseng nods back, having caught on. </span>\n<em>\n<span>She's lying, and her parents can't overhear us questioning her about it.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>\"Of course, of course,\" Madame Po says again. Wei Wuxian bows to both parents and to Lan Faseng, then returns to the kitchen.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji and a-Qian are having some sort of staredown when he comes back. \"Lan Zhan,\" he says, nudging their shoulders together. \"Miss Po's honored parents are outside interviewing with the juniors.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mm,\" Lan Wangji says. \"Miss Po may speak freely now, if she so chooses.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Miss Po doesn't know what you're talking about,\" a-Qian says immediately. \"Miss Po has nothing to say that her parents can't also hear.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian can't help but to huff a laugh. \"Really? Lan Zhan, kids these days are so different. I had all </span>\n<em>\n<span>sorts </span>\n</em>\n<span>of shit I wanted to say as a teenager that I didn't want my family to hear.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mm,\" Lan Wangji agrees. \"You said much of it to me, I'm sure.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian laughs again, pleased that Lan Wangji is playing along. \"And I wasn't even really subject to all that much of Uncle Jiang's rule,\" he continues. \"Jiang Cheng had it much worse than me. And of course, shijie had to deal with being engaged to that dunderhead.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I recall,\" Lan Wangji says. His voice is soft with memory, but his gaze is sharp. \"You weren't happy about that.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I wasn't,\" Wei Wuxian agrees. \"I would have done anything to break it off. I </span>\n<em>\n<span>did </span>\n</em>\n<span>break it off, actually.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"How?\" a-Qian says abruptly. Wei Wuxian looks at her. </span>\n<em>\n<span>Gotcha. </span>\n</em>\n<span>She stares boldly back.</span>\n</p>\n<p> </p>\n<p>\n<span>\"I accidentally manipulated her into humiliating her fiancé and his family,\" Wei Wuxian says. A-Qian makes a face like, </span>\n<em>\n<span>Not bad. </span>\n</em>\n<span>She doesn't scream. \"But I'm sure if I could have convinced her to pretend that she'd been cursed, so horribly that she couldn't step foot in public ever again, that would have worked, too.\"</span>\n</p>\n<p> </p>\n<p>\n<span>A-Qian scowls at him. \"If you blow this for me, I'll kill myself and come back as a ghost and haunt you,\" she threatens.</span>\n</p>\n<p> </p>\n<p>\n<span>\"We're not telling your parents, little snake,\" Wei Wuxian says, feeling almost fond. \"Do you want to know how the story about my shijie ends?\"</span>\n</p>\n<p> </p>\n<p>\n<span>She squints at him and nods slowly.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian leans against the doorframe and admits, \"They ended up married anyway. It turned out that the dunderhead was… actually a good, brave man, even if I didn't like him. All my meddling just delayed happiness for both of them.\"</span>\n</p>\n<p> </p>\n<p>\n<span>A-Qian glares at him for a long moment, then spits at him and turns away. \"Your story sucks,\" she sneers. \"I'm not getting married.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"It's good for girls to get married,\" Wei Wuxian insists. \"As long as the guy isn't awful. You don't want to be stuck here with your parents forever, do you?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I do if it means I don't have to get married!\" A-Qian snaps. \"You don't understand because you're a </span>\n<em>\n<span>boy. </span>\n</em>\n<span>When girls get married our lives just — just — </span>\n<em>\n<span>shrink.\"</span>\n</em>\n<span> She clenches her hands together in the air in front of her. \"It's all just, housework and farmwork and children and getting fucked, and there's no more exploring, and no more learning, and everything is </span>\n<em>\n<span>boring</span>\n</em>\n<span> and </span>\n<em>\n<span>sad.\" </span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian blinks. Housework and farmwork and children and getting fucked sounds pretty good to him, frankly. He'd love that life. What's he supposed to say to that?</span>\n</p>\n<p> </p>\n<p>\n<span>Thankfully, Lan Wangji steps in to save him. \"Miss Po,\" he says slowly. \"Allow this one to advise.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"If you're gonna try to tell me to get married too, I'm gonna start screaming and I won't stop until my throat starts bleeding,\" a-Qian seethes. \"I can do it. I've done it.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I will not,\" Lan Wangji reassures her. He pauses to collect his thoughts, and the other two watch him with caution and curiosity respectively. He says after a moment, \"I have been avoiding arranged marriage for almost as long as you have been alive, Miss Po.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian blinks. He hadn't known that.</span>\n</p>\n<p> </p>\n<p>\n<span>\"It was not for the same reasons, and it is easier for men. But I understand how the decision not to marry can make an enemy of those who should be your allies… even as that same decision makes staying with them your only option,\" Lan Wangji says slowly.</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>\"Yes,\" </span>\n</em>\n<span>a-Qian agrees. \"Either way it's awful. You, daozhang, how have you managed it for so long?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji tilts his head just a little, as if he's embarrassed. \"After some time I made those closest to me understand that my status was closer to that of a widower than a bachelor. That helped a little. But… I also made a point of traveling a lot. For that reason among others.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian swallows. Lan Zhan… thinks of himself as a widower? </span>\n</p>\n<p> </p>\n<p>\n<span>A-Qian deflates. \"Well, that's great for you, but I can't do either of those things,\" she says. \"I'm not a widow, obviously, and I can't just travel by myself for no reason.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"You cannot,\" Lan Wangji agrees. \"But if you had a reason?\"</span>\n</p>\n<p> </p>\n<p>\n<span>A-Qian looks at him. \"I maybe could,\" she says. \"But what kind of reason could I possibly have for leaving and not coming back? Because I wouldn't,\" she adds. \"I wouldn't come back.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji looks at her thoughtfully. \"If Miss Po were to join a cultivation sect,\" he says, \"Miss Po might find herself training abroad for years. Then Miss Po might find herself on frequent night-hunts, with no time for courtship.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian starts nodding; they're back on the same page. \"Miss Po's curse is unrelated to the curse the other kids are under,\" he says speculatively. \"Our group of juniors isn't prepared to investigate two different cases, so we recommend that Miss Po go to another sect for help.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Perhaps those honorable cultivators of QingheNie could help,\" Lan Wangji suggests, and Wei Wuxian is struck by an almost overwhelming wave of adoration for him. </span>\n</p>\n<p> </p>\n<p>\n<span>He hides it with a grin. \"Perhaps,\" he agrees. \"Most of those guys are total meatheads, but we know someone who would appreciate a cunning, determined kid like you.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"You'd really do that?\" a-Qian asks cautiously. \"I've been lying to everyone, and you want to help me?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Oftentimes when a person lies so thoroughly even to their loved ones, it is precisely because they need help,\" Lan Wangji tells her. \"Honesty is a virtue. But so is compassion.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wow, Wei Wuxian loves him!! \"And anyway, kids lie all the time,\" he says, before he or a-Qian starts to cry. \"The fact that everyone bought it is impressive. You're smart and resourceful, so even if you don't end up being able to cultivate, you'd still be good to have around.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Huh,\" a-Qian says.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mhm. In any case, we can introduce you, if you'd like,\" Wei Wuxian says. \"But first we should explain to your honored parents, yes?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Alright,\" a-Qian agrees cautiously.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian follows Lan Wangji out of the house, back into the oppressive heat of the day. It seems that the juniors have just wrapped things up with the Po adults, so Lan Wangji and Wei Wuxian summarize their recommendation to send a-Qian to Qinghe. Lan Wangji, being himself, manages to talk around the whole thing without ever actually </span>\n<em>\n<span>lying, </span>\n</em>\n<span>which Wei Wuxian thinks is very cute and sexy of him. A couple of the juniors, Wei Wuxian notices, have subtle looks of indignation on their faces: why </span>\n<em>\n<span>shouldn't </span>\n</em>\n<span>they take on a second case? But they're Lans, so they have the good sense not to question their seniors in public.</span>\n</p>\n<p> </p>\n<p>\n<span>The Po parents thank everyone for their efforts, and everyone bows to everyone else, and then they head out. This time Wei Wuxian and Lan Wangji lead the way back into town, each lost in his own thoughts as their shadows lengthen in front of them. Wei Wuxian can't stop thinking about Lan Wangji's revelation back there: his family has been trying to marry him off? He — again, this really can't be stressed enough — thinks of himself as a widower?</span>\n</p>\n<p> </p>\n<p>\n<span>The truth is that Wei Wuxian knows that Lan Wangji loves him. That they love each other. That they belong together, that they wilt in each other's absence and thrive in each other's presence. That when Lan Wangji imagines the future, he assumes Wei Wuxian will be by his side, and vice versa. They've never said it, not in so many words, but Wei Wuxian knows.</span>\n</p>\n<p> </p>\n<p>\n<span>Maybe it's time to start saying it.</span>\n</p>\n<p> </p>\n<p>\n<span>He looks over at Lan Wangji and wonders if there's a particular moment at which Lan Wangji began to consider them 'married.' He thinks back over the years, all the moments he might have chosen. It must have been before Wei Wuxian's death, if he's been avoiding marriage for that reason for so long; was it when they ate together in Yiling? Or that day on Baifeng Mountain, when they agreed at last that they were soulmates? Or even before, back in Gusu, when Lan Wangji tied his forehead ribbon around Wei Wuxian's wrist so that Lan Yi's guqin would consider him family? Yes, that must have been it. Wei Wuxian grins doofily to himself. Goodness, that was early in their relationship! Lan Wangji didn't even like him yet!</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji slides his gaze over to meet Wei Wuxian's look. When he sees Wei Wuxian's dumb smile, his own eyes narrow just a little bit, from the bottom up, and his brow softens. Wei Wuxian wants to make out with him until they can't breathe. Lan Wangji gives a minute quirk of his brow, as if to ask what Wei Wuxian's smiling about.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Nothing,\" Wei Wuxian says. \"Just happy to be alive with you.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji looks taken aback. But then he smiles — really smiles, even if it's just a little one — and says, \"Mn. I am happy to be alive with you, too.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian halts their little party just before they get back to the village center, and guides them all to sit under the last large shade tree by the side of the road. He knows the Lan kids are too hot from running around interviewing people all afternoon, and he also knows that none of them will ever admit it or ask to take a break, so he considers it a public service when he hurls himself into the shade and starts whining dramatically about how he's about to pass out from heatstroke. Lan Wangji looks at him like he knows exactly what Wei Wuxian is up to, but he also sits next to him and passes him his water skin, so it's a net win. Wei Wuxian takes the skin and drinks, the water miraculously cool and sweet in his mouth, and passes it back.</span>\n</p>\n<p> </p>\n<p>\n<span>While Lan Wangji is drinking, Lan Qubei -- the bolder one, his classmates' kid, who must surely have heard stories about what a nuisance Wei Wuxian was to have in class and so fears him less -- asks, \"Senior Wei, this disciple is curious why we turned down Miss Po's case. This disciple thinks we could handle two cases at once.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian has been waiting for this. He taps the side of his nose and says, \"We </span>\n<em>\n<span>are</span>\n</em>\n<span> handling Miss Po's case. Escorting her to Qinghe isn't turning her down.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Alright, but, what can the Nie sect do that we can't?\" Lan Qubei insists. \"Surely the curse isn't so complicated that Hanguang-Jun couldn't handle it.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian looks at Lan Wangji: is he planning on telling the kids that there really isn't any curse at all? Lan Wangji gives a measured nod: </span>\n<em>\n<span>go ahead.</span>\n</em>\n<span> Wei Wuxian takes the water skin back from him, partially to make Lan Qubei wait a little longer and partially for indirect kiss reasons. He winks at Lan Wangji while he drinks, and Lan Wangji's ears turn red. When he's done Wei Wuxian wipes his mouth and says to Lan Qubei, \"There isn't any curse on her. But that means that her situation </span>\n<em>\n<span>is</span>\n</em>\n<span> actually complicated enough that we alone can't provide her with the help she needs, so we'll take her to Qinghe.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"There isn't a curse?\" another kid -- Lan Ruoshi -- blurts, and then he covers his mouth and mutters, \"Excuse me.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian flaps a hand at him. \"It's fine. No, there isn't a curse. The girl is taking advantage of everyone else's afflictions so that she won't be expected to marry. It's pretty brilliant, actually. We're sending her to Qinghe so that she can learn how to cultivate.\" </span>\n<em>\n<span>And come up with more watertight schemes,</span>\n</em>\n<span> he thinks.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Oh,\" Lan Ruoshi says.</span>\n</p>\n<p> </p>\n<p>\n<span>\"So… you're lying to her parents?\" Lan Qubei interprets. He looks between Lan Wangji and Wei Wuxian, as if thinking, </span>\n<em>\n<span>This guy's only been around for a day and a half and he's already corrupting Hanguang-Jun.</span>\n</em>\n<span> If only he knew that this whole thing was Hanguang-Jun's idea in the first place!</span>\n</p>\n<p> </p>\n<p>\n<span>\"Not technically,\" Wei Wuxian says. \"It's like I said, her problem is one that our group isn't prepared to deal with by ourselves, but the Nie sect can help. All of that is true.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"But the spirit of it is dishonest,\" Lan Qubei insists. \"And — and you keep saying </span>\n<em>\n<span>our group </span>\n</em>\n<span>and </span>\n<em>\n<span>our juniors, </span>\n</em>\n<span>but Senior Wei isn't of GusuLan anyway. I know Hanguang-Jun and Senior Wei are — are peers, or friends, or something, but this sort of conduct goes completely against everything GusuLan represents. This disciple doesn't understand why Hanguang-Jun is letting you do something so shameful!\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian's eyebrows cannot get any higher on his face right now. He isn't really sure what part of that to address first. He's stuck between the desire to defend Lan Wangji, and his approval that Lan Qubei wants to challenge </span>\n<em>\n<span>any</span>\n</em>\n<span> authority, even his own.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji makes his decision for him. \"Qubei,\" he says. \"It was not Wei Ying's idea to send Miss Po to Qinghe. It was mine.\" Lan Qubei blanches. The other juniors are making horrified eye contact at each other behind him. \"Your disapproval is noted, and I respect your concern about our sect's values. But if you must challenge anyone, challenge me, not Wei Ying.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yes, Hanguang-Jun,\" Lan Qubei says meekly. He looks as if he'd like to dig a hole in the dirt and disappear right there.</span>\n</p>\n<p> </p>\n<p>\n<span>\"You're not in trouble, kid,\" Wei Wuxian tells him. \"It's good to speak up when you think something's wrong, and it wasn't unreasonable to assume that it was my idea. You don't have to like me or even trust me, but trust Hanguang-Jun, alright?\" Lan Qubei nods. His face is bright red now with horrified embarrassment. Wei Wuxian makes eye contact with Lan Wangji, then turns back to the juniors and says, \"Alright, well, I </span>\n<em>\n<span>would</span>\n</em>\n<span> advise that you all go into town and find an inn and book rooms for everyone, but as Young Master Lan pointed out, I'm not your senior. Hanguang-Jun, your thoughts?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji inclines his head and says, \"You're dismissed.\"</span>\n</p>\n<p> </p>\n<p>\n<span>The juniors scramble up and bow and leave so fast they're </span>\n<em>\n<span>almost </span>\n</em>\n<span>running. Wei Wuxian huffs a laugh and leans back against Lan Wangji's shoulder. After a moment Lan Wangji lays his hand shyly on Wei Wuxian's back, so Wei Wuxian snuggles closer. \"They're good kids,\" he says.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mn,\" Lan Wangji says. \"He should not have spoken to you like that.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Eh,\" Wei Wuxian says. \"I've been more disrespectful to more important people. He's fine.\" He tips his head back to look at the sky through the leaves of the tree, then slides his eyes over to watch the play of light and shadow on Lan Wangji's beautiful face. </span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji looks down to meet his gaze. Wei Wuxian loves having his eyes on him. He loves being the center of Lan Wangji's attention. If no one else ever looks at him ever again, if no one listens to him or even hears him at all — if suddenly his existence goes unnoticed by every other person in the world — he'll still be happy, as long as he has Lan Wangji's steady attention on him. He reaches across Lan Wangji's lap to grasp his other hand, the one that isn't currently on his back, and he brings it to his mouth, presses chaste kisses to the well-defined knuckles.</span>\n</p>\n<p> </p>\n<p>\n<span>He hears a soft little sigh above him, and then Lan Wangji tilts his head down to rest in the crook of Wei Wuxian's neck. Wei Wuxian hums and adjusts his posture so that it's more comfortable for both of them, then kisses his hand again.</span>\n</p>\n<p> </p>\n<p>\n<span>They stay there curled up around each other under the tree, not speaking, just breathing warm and quiet together in the shade, even though the heat of the day makes it uncomfortable to touch another person, even as their clasped hands become damp with sweat. They still don't move. They have spent so long not touching each other. A little discomfort is nothing compared to how sweet it feels to have Lan Wangji breathing softly into Wei Wuxian's collar.</span>\n</p>\n<p> </p>\n<p>\n<span>They stay like that for so long that Wei Wuxian is almost dozing by the time the juniors return. The two of them untangle themselves and sit properly as the juniors look away in curious embarrassment, and then Lan Faseng clears his throat and steps forward to say, \"Hanguang-Jun, Senior Wei, we found an inn in town and reserved rooms, if you would care to follow us.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Lead on, Young Masters,\" Wei Wuxian says cheerfully, scrambling upright. The juniors bow and turn to leave. He turns to offer Lan Wangji a hand getting up, which is accepted, although of course Lan Wangji probably has better balance than he does now. Wei Wuxian grins at him, then hesitates. \"Oh, ah, Lan Zhan, sweetheart,\" he says, gesturing at his own forehead, \"Your ribbon is a little crooked.\" Presumably from leaning against Wei Wuxian's shoulder.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji looks at him. His ears get redder and redder. Did Wei Wuxian just call him sweetheart? Whoops. Well, it was going to happen at some point. After a long moment Lan Wangji says, \"You may fix it.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian swallows. Thinks, </span>\n<em>\n<span>spouse. </span>\n</em>\n<span>Thinks, </span>\n<em>\n<span>widower. </span>\n</em>\n<span>He steps closer and reaches out slowly to fix Lan Wangji's forehead ribbon. He lets his fingers brush Lan Wangji's temples, the high arcs of his cheekbones. Thinks, </span>\n<em>\n<span>my husband. </span>\n</em>\n<span>And then again: </span>\n<em>\n<span>oh, gods, my husband. </span>\n</em>\n<span>Lan Wangji's eyes flutter closed. Wei Wuxian says, \"There,\" very quietly, and steps away again. \"Now you're perfect.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mn,\" Lan Wangji agrees, opening his eyes again. They hold each other's gaze for a long breath, and Wei Wuxian almost — he </span>\n<em>\n<span>almost</span>\n</em>\n<span> —</span>\n</p>\n<p> </p>\n<p>\n<span>But the kids are waiting on them. Wei Wuxian takes a steadying breath and turns to follow the juniors into town, and Lan Wangji follows.</span>\n</p>\n<p> </p>\n<p>\n<span>As they make their way to the inn, Lan Wangji says to the juniors, \"There are still two hours before it will be time for the evening meal. Sort yourselves into two groups and consider what your next steps should be in the investigation. We shall decide what to do after eating.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yes, Hanguang-Jun,\" the kids chorus.</span>\n</p>\n<p> </p>\n<p>\n<span>The inn is only a short walk into town, especially compared to how much they've walked already, and it's right next to the sleepy river that runs through the village. It's nice and clean and simple inside, nothing too crazy. Very appropriate for a group of Lan disciples. The juniors paid for five rooms, they say, and Wei Wuxian nods in understanding. \"This inn doesn't have rooms for more than two people?\" he asks idly. Two juniors to a room is reasonable enough, but back when he was a junior, he always shared with Jiang Cheng and their third shidi, and sometimes even the fourth shidi.</span>\n</p>\n<p> </p>\n<p>\n<span>\"No, it does,\" Lan Faseng says, looking a little confused. \"Second shidi and I get a room just the pair of us because there are eight of us, but the others are three to a room.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Wei Ying,\" Lan Wangji says quietly. \"As a senior, you get your own room.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Ah,\" Wei Wuxian says delicately. He had been assuming that the two of them would share. \"Right. Um, which one's mine?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Guo Zongyuan, one of the only two non-Lan-clan juniors, points him towards the end of the hall. \"Hanguang-Jun is in the big room at the end, then Senior Wei, then first and second shixiong, and the rest of us are in the two rooms across the hall from first and second shixiong. We'll be in those rooms to discuss the investigation.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Good, good,\" Wei Wuxian says. He almost offers something to the effect of, </span>\n<em>\n<span>I'll be in my room if you have any questions, </span>\n</em>\n<span>but then he remembers that he's trying to back off a little, and also he probably won't be in his room anyway. Still, he says, \"Good work today, gentlemen. We'll see you in two hours to eat, right, Hanguang-Jun?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mm,\" Lan Wangji agrees, and the party splits into the various rooms.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian really does go to his room first, although not without exchanging a glance and a nod with Lan Wangji as they open their respective doors. Wei Wuxian dumps his packs on the bed and sighs loudly, feeling strangely relieved to be alone again. He's been by himself on the road for months, after all; even someone as gregarious as he is can get used to solitude, even if he prefers company. The juniors really </span>\n<em>\n<span>are </span>\n</em>\n<span>good kids, but that doesn't mean it feels great to know that they don't trust him. Even if it's a good thing that they don't automatically trust any authority figure that shows up. He sighs again.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Okay, enough,\" he says to himself, shaking his head. As long as he has his own room, might as well take a bath before he goes to drape himself all over Lan Wangji, which of course is his immediate next plan. Goodness, it's nice to be able to charge his expenses to Lan Wangji's purse! Obviously, as he said the night before, he </span>\n<em>\n<span>has </span>\n</em>\n<span>been bathing, but he's got so little money that he sticks to cold baths at inns and lots of mountain streams. But if GusuLan are paying, he can have a </span>\n<em>\n<span>hot </span>\n</em>\n<span>bath. With bath beans and perfumed oils and everything. He even gives his dirty laundry to the inn worker who brings the hot water to him. He'll feel like a whole new man tomorrow!</span>\n</p>\n<p> </p>\n<p>\n<span>He takes his sweet time bathing, soaking his hair and face and scrubbing off what feels like at least two layers of skin until he's pink all over. Then he throws on his only other clean set of trousers and inner robes, and then he slips out of his room, and then he knocks on Lan Wangji's door, and then he just lets himself in anyway.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji is sitting at the desk, reading over what looks like probably essays from class. He looks up when Wei Wuxian enters, his expression softening immediately. Oh, he's really cute. Wei Wuxian really, really likes him. He sits down right next to Lan Wangji and says, \"Hi.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mm. You're clean,\" Lan Wangji observes.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yeah, now I smell nice like you,\" Wei Wuxian agrees. He wrinkles his nose and half-jokes, \"You're truly an immortal for tolerating me all night.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Not tolerating,\" Lan Wangji protests. \"It was fine. Nice.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian smiles despite himself. \"You said it yourself, I smelled like donkey and sweat.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji looks at him. \"Sweat is fine,\" he says. \"Wei Ying said it.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian squints. Oh, he did say sweat is sexy, didn't he. He kind of meant it's sexy only on Lan Wangji. Sweaty anyone else is just kind of gross, himself included. \"Hm,\" he says skeptically. He finally gives in and drapes himself over Lan Wangji's shoulders from behind. \"Well, now I smell like roses, isn't that better?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Wei Ying is Wei Ying,\" Lan Wangji says simply, placing one elegant hand on Wei Wuxian's forearm where it's slung across his collar. \"Donkey or roses, doesn't matter.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian stares at his ear, which is just about all he can see like this. \"Lan Zhan,\" he says, when he's regained the ability to speak. \"Lan Zhan, carry me to bed. If you want to say things like that then you have to hold me, too.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji twists around in his grasp to look at him with dark, searching eyes. Wei Wuxian raises his eyebrows and tries to look as serious as possible. There are consequences for your actions, Lan Zhan!</span>\n</p>\n<p> </p>\n<p>\n<span>Then he's whooping in surprise as Lan Wangji pulls him into his lap and stands to carry him to the bed as requested. He releases Wei Wuxian carefully and climbs immediately on top of him, and Wei Wuxian thinks, </span>\n<em>\n<span>Yes yes yes yes yes!!!! </span>\n</em>\n<span>But Lan Wangji doesn't kiss him or ravish him or anything, he just settles in like a warm heavy blanket and sighs contentedly into Wei Wuxian's still-wet hair. Wei Wuxian snakes his arms back around his shoulders and turns his head to look at him, feeling unspeakably, unstoppably fond. Their noses brush when he does, and he grins helplessly, watches Lan Wangji's strange pale eyes narrow in amusement.</span>\n</p>\n<p> </p>\n<p>\n<span>\"What do you think of the night hunt, Lan Zhan?\" Wei Wuxian asks, his voice just barely above a whisper because of how close they are. \"What are your suspicions?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji hums thoughtfully. \"We're missing something,\" he decides, his voice pitched low to match Wei Wuxian's. \"The curses lack intentionality, so we're looking for an object, not a person. But they're so varied that a single object seems doubtful.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Right,\" Wei Wuxian agrees, stroking Lan Wangji's hair absently as he thinks. \"That's what I've been thinking as well. So somehow there's multiple cursed objects around here, but they do such goofy stuff that I'd be surprised if they were part of a protection array or some other real purpose. It's more like a prank than a punishment, but so far there's no punchline. So there must be something more.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mm,\" Lan Wangji says. \"Something the children hesitate to tell us.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Right,\" Wei Wuxian says. \"Something they might get in trouble for. Unlike you and me, most kids like to avoid punishment.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji exhales shortly, a tiny amused huff that Wei Wuxian feels as warm air on his face and a contraction of Lan Wangji's chest under his hands. Wei Wuxian shifts underneath him to tangle their legs together. He loves this, he decides. He loves their quiet voices together, the way everything sounds different surrounded by sheets. He loves Lan Wangji lying on top of him, laughing. He loves this new and easy intimacy, how they've never touched each other like this and yet they both seem to know exactly what to do, exactly how to fit together.</span>\n</p>\n<p> </p>\n<p>\n<span>He nuzzles back into the pillow and murmurs, \"Hey, Lan Zhan. Think the inn will give you your money back if we don't need one of the rooms?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji pretends to think about it, but Wei Wuxian can see his ears flushing from here. \"You already dirtied your room for today,\" he murmurs back, and Wei Wuxian rolls his eyes. \"But for any other days, yes.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Pedant,\" Wei Wuxian teases him.</span>\n</p>\n<p> </p>\n<p>\n<span>\"You love it,\" Lan Wangji whispers with a straight face.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian's grin softens, and he says, \"Yes. I do.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji looks at him, his mouth slightly open in surprise, even after everything. Wei Wuxian watches as he closes his mouth on a swallow, as he licks his lips discreetly. He can feel Lan Wangji's heart beating fast in his chest. Wei Wuxian swallows too, finds his gaze fixated on Lan Wangji's pretty mouth. </span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji's voice is so low when he says, \"Wei Ying…\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian has just opened his mouth to answer when there's a knock on the door. They look at each other in horror before Wei Wuxian hides his face in Lan Wangji's neck and groans loudly. \"Every time!!\" he wails, pushing Lan Wangji onto his side so he can hide more effectively. \"Your kids really have it out for me, huh!!\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Hanguang-Jun?\" calls a voice from outside. It's one of the kids, but Wei Wuxian isn't sure which one.</span>\n</p>\n<p> </p>\n<p>\n<span>\"One moment,\" Lan Wangji calls back. He rubs Wei Wuxian's back in sympathy, which feels very good, but then he says, \"Let me up,\" which is very stupid of him. Wei Wuxian groans again but releases him from his monkey grasp, and they both sit up and straighten each other's clothes a little. Lan Wangji looks perfect after five seconds, because he always looks perfect, but Wei Wuxian is kind of a lost cause, seeing as his hair's still wet and unbound and he's woefully underdressed for anyone other than Lan Wangji. He waves Lan Wangji off; there's nothing more he can do here. Lan Wangji acquiesces and goes to answer the door.</span>\n</p>\n<p> </p>\n<p>\n<span>It's Lan Qubei. Wei Wuxian can't see him, but he recognizes his voice now as he says, \"Hanguang-Jun, sorry to interrupt. I'm looking for Senior Wei but he doesn't seem to be in his room. This disciple wonders if Hanguang-Jun knows where he is?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Oh, this is gonna be weird, huh. When Lan Wangji hesitates, Lan Qubei says quickly, \"If — if he's busy, or something, I can come back — I'd only like a quick word with him, it's not urgent. Actually, never mind, it's fine, I'll go.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"That's exactly the sort of thing someone who doesn't really want to talk to me might say,\" Wei Wuxian observes. \"Let him in, Lan Zhan, let's put him out of his misery.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji steps aside. Wei Wuxian tries to project an air of dignity and competence despite the fact that he's sitting damp and underdressed on Lan Wangji's rumpled bed. \"How can this senior help you, Lan Qubei?\" he asks regally.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Qubei enters the room and bows to him and visibly tries to suppress his embarrassment. \"This Lan Qubei would like to apologize to Senior Wei for earlier,\" he forces out. Wei Wuxian blinks. \"I spoke harshly and assumed the worst of you. And Hanguang-Jun, too,\" he adds, turning to bow to Lan Wangji as well. \"This disciple doesn't need to understand his seniors' reasoning for things. He should have accepted your decisions and trusted that your reasons were sound.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji steps forward to lift Lan Qubei's arms out of his bow. \"Your apology is accepted, Qubei,\" he says. \"Your words were impolite and unconsidered —\" Lan Qubei flinches — \"but Wei Ying was right. When one perceives that justice and honor have been violated, one ought to speak. Authority does not mean immunity to foolishness.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Qubei nods hesitantly. \"Thank you, Hanguang-Jun,\" he says. \"Thank you, Senior Wei.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Don't worry about it,\" Wei Wuxian advises. \"I'm the last person alive who's going to give you shit for questioning authority. And Hanguang-Jun here is the second-to-last person, believe it or not.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mm,\" Lan Wangji agrees.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Qubei kind of laughs nervously. Then he seems to decide something; he straightens his shoulders and looks up from the ground, which he's been staring resolutely at for most of this interaction. \"Then, Hanguang-Jun, if it's not too bold, this disciple would like to know more about the decision to lie,\" he says. \"If it's Hanguang-Jun he must have a good reason, so, this disciple would appreciate the lesson.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian tries not to laugh in delight. This kid </span>\n<em>\n<span>is </span>\n</em>\n<span>bold! \"Lan Zhan, what do you think? Shall we explain ourselves to your juniors?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mm,\" Lan Wangji says. \"Qubei, gather the others in one of the rooms. We'll be in shortly.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Qubei bows again and scurries out. Lan Wangji closes the door behind him, then returns to the side of the bed. Wei Wuxian raises his hands so he can be pulled up off the bed, but Lan Wangji kneels between his legs instead, slips his arms around his waist, presses his face to Wei Wuxian's chest. Wei Wuxian looks down at him in surprise. \"Lan Zhan?\" he asks. \"Are you okay?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji inhales slowly. \"I like this,\" he says quietly into Wei Wuxian's underrobe. \"I like being on your side.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Oh. Oh. Wei Wuxian pets his hair and squeezes his knees together around Lan Wangji's chest. \"I like having you on my side, too,\" he says. Then, after a moment, \"Let me up, sweetheart, I should go get dressed.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji makes a humming sound that might almost be a noise of complaint, but he draws away and rises, pulling Wei Wuxian up with him. Wei Wuxian wraps his arms around his neck and shoulders and squeezes once, tightly, and then he draws back to cup Lan Wangji's beloved face in his hands and just look at him. Lan Wangji's big hands settle on his waist even as he lowers his gaze and says, \"The juniors will be waiting.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yeah,\" Wei Wuxian agrees, his voice rough. He clears his throat and says, \"Yeah,\" again, and pulls away. \"Meet you in the hall in two,\" he offers, and Lan Wangji nods, and he leaves.</span>\n</p>\n<p> </p>\n<p>\n<span>Alone back in his room, Wei Wuxian bites back a scream of frustration. WHEN will he get to kiss Lan Wangji!! Huh!! Is one kiss too much to ask for, world?? (Well — he knows it wouldn't just be one. If it were just one kiss he wanted, he could have kissed him just now. But Wei Wuxian wants to be kissed breathless, wants Lan Wangji to press him back into the sheets and kiss him until they forget what it's like not to be kissing. He wants Lan Wangji's hands all over him, he wants to see Lan Wangji's pretty mouth red and slick, he wants — — —)</span>\n</p>\n<p> </p>\n<p>\n<span>He splashes cold water on his face and gets dressed.</span>\n</p>\n<p> </p>\n<p>\n<span>When he emerges into the hallway again, Lan Wangji is already waiting for him. The hair around his face and the collars of his robes are wet at the edges, as if he too just washed his face.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian is struck, once again, by an overwhelming affection for him. He winks at Lan Wangji and knocks on the doorframe as Lan Wangji's ears turn red again.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Faseng bids them enter. The juniors are standing in two straight lines as if they're ready to leave, and they all bow respectfully. Wei Wuxian fights the urge to wave their bows away; he knows Lans love to be formal. Instead he and Lan Wangji both bow back. \"Hanguang-Jun, Senior Wei,\" Lan Faseng greets them, \"These disciples have been thinking about the case.\"</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>I should hope so! </span>\n</em>\n<span>Wei Wuxian thinks. Lan Wangji inclines his head and says, \"After dinner, Head Disciple. First an explanation as to Miss Po's situation. Please sit.\"</span>\n</p>\n<p> </p>\n<p>\n<span>The juniors sit obediently, still in their two straight lines. Lan Wangji and Wei Wuxian sit facing them — or rather, Lan Wangji kneels politely and Wei Wuxian sits just as messily as he always does, with one knee drawn up to his chest and the other splayed out to touch Lan Wangji's lap. It's good to be messy in front of Lan kids, he thinks! Show them how the other half lives! He props his head in his hand and watches as Lan Wangji gathers his thoughts.</span>\n</p>\n<p> </p>\n<p>\n<span>\"The problem Miss Po faces is not a curse. It is a marriage she would rather die than undergo. To expose her lie would be to condemn both her and her family to public humiliation; to play along but force her to marry anyway would condemn her to death. So I gave her a third path,\" Lan Wangji summarizes. \"Our duty as cultivators and as moral people is to minimize pain in this world. Sometimes the most righteous path is easy and uncomplicated.\" He glances at Wei Wuxian. \"Other times, it is not.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian bumps his knee against Lan Wangji's thigh again in support. \"Does that make sense to you all?\" he checks. The juniors all nod, which obviously means very little. \"It's okay if it doesn't. Asking questions is good. It shows you're paying attention,\" he adds, tapping the side of his nose.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Ruoshi looks around at his peers, then stands hesitantly. \"This disciple is wondering, won't Miss Po's parents miss her? Won't they worry, if she's sent off to a foreign sect and doesn't come back?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian nods. \"Yeah, they probably will worry,\" he admits. Or at least her mother will. He's not sure about the father. \"If she's kind, she'll send word that she's alright. But that family isn't well-off; that's why she was supposed to marry at sixteen anyway. Even if they worry, it'll be a relief not to have another mouth to feed.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Ruoshi nods and sits back down. After a moment, Pei Shouli stands. Wei Wuxian watches with mild interest; Pei Shouli is the other non-clan member, and he's been pretty quiet so far. Lan Wangji described him earlier as 'romantic.' He asks, \"This disciple wonders why Miss Po didn't want to get married in the first place? Is it possible she has a secret lover, and her going to Qinghe will separate them?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian suppresses his grin. This kid and Ouyang Zizhen would get along just fine. \"No secret lover,\" Lan Wangji confirms. \"Marriage itself is the problem, not her partner. She does not wish to be stifled by wifely duties.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Pei Shouli nods in comprehension. \"I see, I see,\" he says, \"An adventurous maiden,\" and sits. </span>\n</p>\n<p> </p>\n<p>\n<span>\"... Right,\" Wei Wuxian says. \"Just can't be tied down.\"</span>\n</p>\n<p> </p>\n<p>\n<span>For some reason </span>\n<em>\n<span>that's </span>\n</em>\n<span>what makes the rest of the juniors seem to get it, as they all nod and no one has any more questions. \"Alright, well, it's just about time to eat, right? Let's go downstairs,\" Wei Wuxian suggests. Lan Wangji hums his agreement and the two of them stand and lead the way downstairs.</span>\n</p>\n<p> </p>\n<p>\n<span>Dinner is almost silent, of course, because Wei Wuxian is surrounded by well-behaved Lans who don't speak while eating. The ten of them are all crowded at a long table, with Lan Wangji at the head and Wei Wuxian to his right, Lan Faseng to his left, and so on; and of course even though their table is by far the largest group in the inn, it's also the quietest. At least Lan Wangji orders wine for him and even pours it, because he's really a very good husband. Wei Wuxian makes a note to himself to tell him so later. In the meantime he contents himself with making sure Lan Wangji has enough tofu on his plate; he tends to go for only vegetables and forgo protein, bless him. In return Lan Wangji makes sure he gets enough vegetables. Their chopsticks keep clicking together as they serve each other, and Wei Wuxian thinks abruptly, </span>\n<em>\n<span>That's what love sounds like.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>When Lan Wangji notices his cup is empty and pours more wine for him, Wei Wuxian is gripped by such a vicious tenderness that he finds himself blinking back tears. It's just so fucking domestic, the two of them feeding each other like this. Wei Wuxian wants to go on night-hunts with Lan Wangji forever, he wants to eat with him in restaurants and inns and sect dining halls forever. It feels so good to care and be cared for.</span>\n</p>\n<p> </p>\n<p>\n<span>He must make some sort of choked sound, because Lan Wangji puts the wine jar down and looks up at him in concern. \"Wei Ying?\" he says quietly.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian nods, </span>\n<em>\n<span>I'm alright, </span>\n</em>\n<span>but he has to wipe his eyes anyway. He gestures in half-hearted dismissal with his chopsticks. \"I'm fine,\" he insists, swallowing thickly. \"I'm good. Really good. I just. Um, this is nice.\" He's painfully aware of the eyes of the juniors on him, but sometimes you just need to have a very small meltdown in public.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji's gaze softens infinitely. He picks up a piece of bok choy from his own bowl and puts it in Wei Wuxian's bowl and agrees, \"It is nice.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian takes the bok choy and stuffs it in his mouth so he doesn't say something stupid, like, </span>\n<em>\n<span>I didn't think I'd get to have anything like this, </span>\n</em>\n<span>or, </span>\n<em>\n<span>Forget the case, just take me to bed, </span>\n</em>\n<span>or even just, </span>\n<em>\n<span>I really love you. </span>\n</em>\n<span>After a moment he feels a touch at his hand; he looks up and sees that Lan Wangji has switched his chopsticks to his left hand, and his right has disappeared under the table to hold Wei Wuxian's hand. Wei Wuxian twists their fingers together and squeezes, and receives a squeeze in return. They spend the rest of the meal like that, quietly holding hands underneath the table. If the juniors notice, they do a good job of pretending they don't.</span>\n</p>\n<p> </p>\n<p>\n<span>Once the meal is over and paid for, their little party heads back upstairs and returns to the room they were in previously. The juniors sit in two lines again, and the head of each line — Lan Faseng and the second shixiong, Lan Congyi — present each group's thoughts. They largely align with Lan Wangji and Wei Wuxian's own discussion from earlier: probably a series of cursed objects, probably minimal supervision by whoever made the objects, probably an intention closer to mischief than malice. They'll go back tomorrow and see if they can bribe some of the younger kids into confessing exactly where they were when they got themselves cursed (although of course the Lan disciples would never </span>\n<em>\n<span>call </span>\n</em>\n<span>it bribery), and then if they succeed in finding that information they'll go check out the site. </span>\n</p>\n<p> </p>\n<p>\n<span>Having reached an agreement and made a plan for what comes next, they split up again for the rest of the evening. Lan Wangji returns to his room to write his brother with an update; Wei Wuxian goes down to the inn stables to check on Lil Apple. She's all set up with a trough of sweet hay, which means she's miserable and indignant about the lack of fresh grass. \"Stupid spoiled little meimei of an animal,\" Wei Wuxian tells her. \"I have no sympathy for you!\" But he goes and uses his pocket knife to cut a bunch of fresh grass from outside for her anyway.</span>\n</p>\n<p> </p>\n<p>\n<span>When Lil Apple seems appeased, Wei Wuxian goes back inside and wanders up to Lan Wangji's room again. Lan Wangji has finished his letter, it seems; he's sitting at the desk tuning his guqin. Wei Wuxian enters silently and sits behind him, lays the side of his face against the firm curve of his back, listens as Lan Wangji studiously compares the open and closed notes of each string. When at last he's satisfied, he transitions right into playing that song, his lovely song whose name he still hasn't told Wei Wuxian. Wei Wuxian hums along into his shoulder.</span>\n</p>\n<p> </p>\n<p>\n<span>The last notes of the song are heavy in the quiet of the room. The two of them inhale deeply and sigh in unison, and then Wei Wuxian asks, \"You ever going to tell me the name of that song?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mm,\" Lan Wangji answers. He stows the guqin and twists in place to face Wei Wuxian, who moves to lean one elbow on the desk next to him. Lan Wangji looks at him consideringly. Wei Wuxian tries his best to look like the kind of person who ought to know song titles. \"I'll tell you,\" Lan Wangji says at last, and Wei Wuxian starts to grin, but then he continues, \"if you guess correctly.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian groans piteously and tips forward to fall into Lan Wangji's lap. \"Lan Zhaaaan,\" he whines into the top of his belt, \"How could you be so cruel! I'm terrible at names, you know about my sword. How can I be expected to guess whatever elegant and interesting title you came up with?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Wei Ying is good at names,\" Lan Wangji corrects him. \"Chenqing is appropriate. Rulan is poetic. Suibian is Suibian because you came up with too many, not too few.\" </span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian groans again. Lan Wangji pets his hair. </span>\n<em>\n<span>That's very sweet of you, Lan Zhan, but just tell me what the song is called! </span>\n</em>\n<span>He thinks hard for a while. \"Sapling growing on a cliffside,\" he guesses idly.</span>\n</p>\n<p> </p>\n<p>\n<span>\"No.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Swallows dancing in early monsoon wind.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"No.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Thousand-year magnolia in bloom.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"No.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Wei Ying is my favorite person to ever walk the hallowed paths of the Cloud Recesses.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"No. … Getting closer.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"What, really?\" Wei Wuxian gasps, lurching out of Lan Wangji's lap to look at him. \"Lan Zhan, how bold of you.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji looks back. \"Not close in phrasing,\" he admits. \"Wei Ying is more verbose.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yeah I am,\" Wei Wuxian agrees. He pushes at Lan Wangji's shoulders. \"Lie down, it's no good for me to hunch over you like this.\" Lan Wangji lets himself be maneuvered back so that Wei Wuxian can crawl up his body to lie on top of him. The bed is like eight steps away, but they're already here, so why move? Wei Wuxian settles on top of Lan Wangji's chest, braced with his elbows on either side of Lan Wangji's head so that he can look down at his handsome face as he guesses. \"Okay, so, my phrasing's not close, but the sentiment is closer?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mm,\" Lan Wangji says. His ears are turning pink. He puts his hands on Wei Wuxian's waist, which is great, because that's exactly what it's there for.</span>\n</p>\n<p> </p>\n<p>\n<span>\"So shameless, my Lan Zhan,\" Wei Wuxian teases. \"Alright, let me think. You hummed it for me in the Xuanwu cave, so you wrote it before then, yes?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji looks to the side, too bashful to make eye contact. \"En,\" he confirms.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Cute,\" Wei Wuxian breathes, ducking close to nuzzle at his temple. \"Too cute, too cute, Lan Zhan is unbearable. Hmm… 'Annoying pain-in-my-ass boy is actually very smart and cool.'\" Lan Wangji just ignores that one. \"Releasing late-spring lanterns.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"No.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Ribbon of fate.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"No.\" But his ears get pinker.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Ignoring duties, library in disarray.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji's gaze slides over. \"... Closer,\" he admits. Wei Wuxian grins, thrilled.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Won't you tell me, Lan Zhan?\" he cajoles. He pets Lan Wangji's soft hair with one hand, trails the other down Lan Wangji's shoulder to his elbow. He nuzzles his temple again down to his warm pink ear. He can feel Lan Wangji's heart beating in his chest, his hands tightening at Wei Wuxian's waist. \"You wrote it for me, didn't you?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yes,\" Lan Wangji breathes.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian presses a kiss to the soft lobe of his ear. \"Please tell me,\" he murmurs. \"How cruel, to keep secrets from your husband, ah.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji freezes underneath him. Then he grasps Wei Wuxian's waist even more firmly and flips them both with a </span>\n<em>\n<span>thump</span>\n</em>\n<span>, so that Wei Wuxian is on his back underneath him. Wei Wuxian huffs at the impact and winds his arms around Lan Wangji's neck to pull him closer, moves his legs around roughly so that he's got Lan Wangji's narrow hips bracketed between his thighs.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Again,\" Lan Wangji gasps, his eyes wide and dark in his face. \"Say it again.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Husband,\" Wei Wuxian says immediately. \"Wei Ying is your husband, didn't you know that? Wei Ying is yours, yours, yours.\" Lan Wangji makes a helpless little sound in his throat. Wei Wuxian squeezes his legs together around his hips. \"I was thinking about it at dinner,\" he says conversationally, \"and that's why I almost started crying, you know. Lan Zhan is such a good husband. He's so good to me, he takes such good care of me.\" Lan Wangji's eyes are so wide. Wei Wuxian reaches up and cups his face in his hands. \"Lan Zhan protects me and listens to me and writes love songs for me,\" he says, and then he adds, \"And then he teases me for months, not telling me what the song is called.\" He waggles Lan Wangji's face back and forth a little in punishment.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji just turns his face to the side to press a kiss to Wei Wuxian's palm. \"My husband,\" he says in quiet wonder.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian is abruptly done goofing around. \"Hey,\" he breathes. \"Hey, hey, Lan Zhan, my husband, sweetheart, my love, please kiss me.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji is just tilting his head down when they hear footsteps thundering up the stairs and down the hallway. Wei Wuxian has barely enough time to say, \"No </span>\n<em>\n<span>fucking</span>\n</em>\n<span> way,\" before someone pounds urgently on the doorframe.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Daozhang!! Daozhang!! The alligator is outside!!\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian doesn't bother muffling his wail of outraged frustration. \"AuuaaAAAAAUUGH!! Come back later!\" he yells desperately over Lan Wangji's shoulder. \"We're busy!\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Daozhangs, please, it won't leave!!\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian exchanges a despairing look with Lan Wangji. Then he mutters, \"Damn it all,\" and Lan Wangji rolls off of him. They manage to stand up, although Wei Wuxian lets himself sway into Lan Wangji's chest, his legs turned to jelly in his arousal. Lan Wangji clasps his arm and shudders when Wei Wuxian places one steadying hand low on his belly.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Wei Ying,\" Lan Wangji says lowly. Wei Wuxian presses closer. Lan Wangji takes a deep breath and lifts Wei Wuxian's hand off of him. \"Later,\" he promises.</span>\n</p>\n<p> </p>\n<p>\n<span>\"You bet,\" Wei Wuxian breathes, and they pull apart.</span>\n</p>\n<p> </p>\n<p>\n<span>When they emerge from the room, the juniors have already come out of their own rooms and are trying their best to calm the innkeeper. \"It's outside?\" Lan Wangji demands. Wei Wuxian laughs quietly at his impatience.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Y-yes!\" the innkeeper says. \"Some of the others are down there trying to catch it — b-but we don't have any tools, daozhangs, please help us!\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yes, yes, let's go help,\" Wei Wuxian agrees. He tugs at Lan Wangji's hand and beckons at the juniors. \"The sooner this is over with, the better.\" He winks at Lan Wangji, who nods, his eyes narrowed in amusement.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji leads them downstairs and out the door of the inn, and sure enough a group of villagers are outside in a loose, wide circle in the street, close to the riverbank. The sun is already set, but there's enough light from businesses nearby for Wei Wuxian to see the telltale dark shape of an alligator, low and motionless in the center of the circle. The villagers are yelling to each other in excitement as the cultivators approach.</span>\n</p>\n<p> </p>\n<p>\n<span>\"We've got it!\" one of them yells, \"We caught it with Ol' Xia's fishing net!\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian grimaces in thought, stepping closer. \"Good work,\" he says. \"But what are you planning to do now that you've caught it?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Er… well… that's where you come in, daozhangs,\" says a woman to his right. She gives him an obvious once-over. \"Aren't you supposed to have a sword?\"</span>\n</p>\n<p> </p>\n<p>\n<span>He ignores that question in favor of looking closer at the alligator. The lakes at Lotus Pier are alligator-free, but he's encountered a handful of them elsewhere in Yunmeng. Back when he was a teenager there was a year of drought and some farms nearby needed extra food, so he and Jiang Cheng had volunteered to help hunt for them. Alligator's good eating if you don't kill yourself catching it, and besides, one fewer alligator means a hundred more fish in the river. Wei Wuxian had ended up sitting on an alligator's neck with his legs wrapped around its neck, holding its mouth closed with his arms while it thrashed around until Jiang Cheng figured out how to kill it.</span>\n</p>\n<p> </p>\n<p>\n<span>He suspects that's not the best approach this time around. He leans closer to Lan Wangji and mutters, \"This is weird, right? That alligator's acting weird?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji is silent for a moment, still watching the animal in the street. Then he admits, \"I am not familiar with alligator behavior. Should it be struggling?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yeah, it should.\" It's just lying there motionless, its mouth shut. The only thing moving are its eyes, which catch the light as it looks around. It's not obviously injured, but maybe it's got something wrong with it on the inside. \"It should be scrambling around, hissing, generally making a scene. Maybe it's hurt.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mm,\" Lan Wangji says. Then the stupid bastard just walks right up to the alligator, ignoring the yells from the villagers.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Eh! Lan Zhan ah, come back!!\" Wei Wuxian exclaims. Sure, the alligator isn't moving right now, but those things are crazy fast! If it decides Lan Wangji has gotten too close, it could dart out and rip his foot off at the ankle like it was nothing, ropes be damned. Wei Wuxian whips around and orders the juniors, \"Stay right there or I'll kick ALL your asses,\" and then he runs after Lan Wangji. \"Lan Zhan, get away from that thing, I'm serious,\" he hisses.</span>\n</p>\n<p> </p>\n<p>\n<span>By now Lan Wangji is crouching in front of it. \"I won't hurt you,\" he says quietly, and then he reaches out as if to touch its big gnarled head between its frog-like eyes. Oh, gods, Wei Wuxian's never gonna see that hand again. He loves that hand. He has plans for that hand.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Lan Zhan!!\" Wei Wuxian repeats, as panic begins to roil in his gut. \"It can't understand you, fool!\" He reaches Lan Wangji and grabs his shoulder, and then Lan Wangji's fingers make contact with the alligator's head — and then a villager's arrow whistles past Wei Wuxian to bounce pathetically off the alligator's thick hide, and the alligator startles, surges up onto its feet to scramble backwards and away. Wei Wuxian barely has time to feel pissed before he realizes that he had stepped into the fishing net the villagers used to snare the alligator. A loop of rough netting snags around both his ankles as the alligator skitters away, and he lands hard on his hand and one hip.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Wei Ying!\" Lan Wangji exclaims, grabbing at his free hand.</span>\n</p>\n<p> </p>\n<p>\n<span>\"I'm fine,\" Wei Wuxian starts, and then the alligator starts running in earnest. He lets out a woop as the alligator's movement jerks him sharply from Lan Wangji's grasp. </span>\n<em>\n<span>Oh, hells, </span>\n</em>\n<span>he thinks, as the alligator drags him swiftly away, and he shouts, \"Lan Zhan!!\" He scrabbles at the hard-packed dirt road, and then he feels the dirt turn to mud, and then he inhales one last deep gulp of air before summer-warm river water swallows him whole.</span>\n</p>\n<p> </p>\n<p>\n<span>He can't see anything in the dark of the water, but he can tell that the alligator is swimming faster than he could ever hope to swim, and they're heading downstream, to boot. The force of the water rushing past is too great for him to curl up and try to cut himself free from the net. He flails around a little, hoping to burst a hand through the surface of the water so that the others can see where he is, but he ends up just smacking his hand hard against a rock at the bottom of the river. He gasps with the sudden pain and a stream of air leaves him, which is infinitely worse than a broken finger or two. </span>\n<em>\n<span>Shit. Shit. Lan Zhan better catch up quick.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Then his head slams against something in the water, and his body goes limp.</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>*</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>The first sensation is water gurgling up out of his mouth. He turns his head weakly, and then the second sensation comes, which is an immense and prickly force pressing abruptly down on his chest, forcing more water up and out of him. He inhales sharply and then spasms from the immediate, burning pain that causes, and he curls onto his side to cough up water uncontrollably, his chest and throat burning with the effort. \"Lan Zhan,\" he wheezes when most of the water is out, heaving down air, \"Lan Zhan—!\" He has to stop to cough again. Lan Wangji, wherever he is, is conspicuously silent. Wei Wuxian tries not to hyperventilate, tries to breathe slowly enough not to trigger another coughing fit. Gods above, his head fucking hurts. Ah, and his hand hurts, and his chest, and even his ankles —</span>\n</p>\n<p> </p>\n<p>\n<span>He blinks hard and wipes his mouth of river water and bile, and then he looks around. The sky is a little darker than it was when they'd left the inn, but it's still not fully night, which is probably a good sign. He's collapsed on a sloping riverbank, mostly hidden from the river by trees on either side, and he's able to wrench the nets loose from his feet quickly, now that he isn't being dragged through turbulent water. Lan Wangji isn't here, and neither are the juniors or anyone else.</span>\n</p>\n<p> </p>\n<p>\n<span>But the alligator is.</span>\n</p>\n<p> </p>\n<p>\n<span>It's lying a couple feet away, watching him with cold reptilian eyes. When it notices him looking, it turns its face away a little, as if in shame. Wei Wuxian looks down at himself. His chest hurts because he was drowning, but there's also a hot sensation on his skin — blood? He yanks his collars open and sees that he has five neat little puncture wounds in a wide arc, as if — as if from the massive claws of an alligator. As if an alligator had very carefully put one foot (paw??) on his chest, and pressed down hard, to push the water out of him.</span>\n</p>\n<p> </p>\n<p>\n<span>\"What the hell,\" Wei Wuxian mutters.</span>\n</p>\n<p> </p>\n<p>\n<span>Then he hears a faint voice calling, \"Wei Ying!\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Lan Zhan!!\" he calls back, but his voice is wrecked from the water, and he collapses into coughs again. He slaps the riverbank with the open palm of the hand that isn't injured, trying to make a sound, any sound to let Lan Wangji know where he is.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Wei Ying!\"</span>\n</p>\n<p>\n<span><br>\n</span>\n<span>\"Senior Wei! Senior Wei!\"</span>\n</p>\n<p> </p>\n<p>\n<span>Their voices are still far away. Wei Wuxian gives the alligator the stink eye. \"You saved me,\" he says. \"Make yourself useful again, why don't you? Give us a roar.\"</span>\n</p>\n<p> </p>\n<p>\n<span>The alligator, very obligingly, opens its mouth and bellows. Wei Wuxian jerks back with a shudder. The alligator seems to give him a look as if to say, </span>\n<em>\n<span>You asked for it.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>\"Wei Ying!!\" Closer now. Wei Wuxian slaps the riverbank again, a sharp dada-DA! He tries whistling, and is pleased to find that while his lung capacity is shot right now, he can still achieve a loud, clear sound. He whistles as loud as he can, short sharp bursts, until Lan Wangji flies into view on Bichen, just barely a foot off the surface of the water. He sees Wei Wuxian immediately and turns, leaps off his sword onto the sand, almost stumbling in his haste to kneel by Wei Wuxian's side.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Lan Zhan,\" Wei Wuxian croaks, reaching out to catch him, \"I'm alright, don't worry.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Wei Ying,\" Lan Wangji breathes, reaching out at once to check him for injuries. His hands are shaking as he checks Wei Wuxian's pulse, follows the too-quiet lines of his meridians. Wei Wuxian is dimly aware of the arrival of the juniors, but he only has enough attention right now for Lan Wangji, who pulls away just far enough to press a kiss between his eyebrows. \"Wei Ying,\" he says into his skin, \"Love, I'm sorry. I should have noticed, should have cut you loose —\" </span>\n</p>\n<p> </p>\n<p>\n<span>\"Lan Zhan ah, I'm really fine,\" Wei Wuxian tells him, feeling pleased and flustered in the face of his sudden affection. </span>\n<em>\n<span>Love? </span>\n</em>\n<span>But then Lan Wangji pulls him close, tight against his chest, and the pressure against his ribs forces too much air out of his lungs, and he has to push him away abruptly so that he can still breathe. He heaves in more air as Lan Wangji stares. When he doesn't feel like his lungs are about to collapse, he revises, \"I'll </span>\n<em>\n<span>be </span>\n</em>\n<span>fine. Just a spot of drowning, it's nothing.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji hisses quiet through his teeth and kisses his forehead again. </span>\n</p>\n<p> </p>\n<p>\n<span>\"Ah, H-Hanguang-Jun! Senior Wei, get back!!\" Lan Faseng says suddenly. \"The alligator's still there!\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I know,\" Wei Wuxian says, clutching at Lan Wangji's arms so he doesn't do something stupid, like kill it. \"It's fine, I don't think it's really an alligator. It saved me, believe it or not.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Wei Ying,\" Lan Wangji says in alarm.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Help me sit up, Lan Zhan, and you juniors come stand over here with us,\" Wei Wuxian requests. They all do as they're told. Lan Wangji slips one muscular arm under Wei Wuxian's armpit and behind his shoulders and pulls him close to his side, letting his hand fall to hold Wei Wuxian's waist. Wei Wuxian leans in gratefully — Lan Wangji won't mind if he gets wet, not because of this — then turns to the alligator, which is still there, watching them quietly. \"You, the alligator, nod your head if you understand me, ya?\"</span>\n</p>\n<p> </p>\n<p>\n<span>The alligator nods its head enthusiastically. The kids all gasp. Wei Wuxian sighs. \"You didn't </span>\n<em>\n<span>mean </span>\n</em>\n<span>to drag me underwater with you, did you?\"</span>\n</p>\n<p> </p>\n<p>\n<span>The alligator very firmly shakes its head no.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Are you very sorry about that?\"</span>\n</p>\n<p> </p>\n<p>\n<span>The alligator nods rapidly.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Are you normally a human being?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Another vigorous nod.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Are you stuck like this?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Another nod.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Are you cursed in the same way that the other village kids are cursed?\"</span>\n</p>\n<p> </p>\n<p>\n<span>The alligator hesitates, then nods.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Hm,\" Wei Wuxian says. \"Can you show us where you were when you got cursed?\"</span>\n</p>\n<p> </p>\n<p>\n<span>The alligator nods, then it slithers off into the undergrowth, leaving nothing but gently waving ferns in the dark. Wei Wuxian tries not to swear. Stupid idiot, who just drowned because of you! There's no way Wei Wuxian will be able to follow quickly. But it's only a moment before the alligator returns and turns a circle in front of them, then settles down with its snout resting on the tip of its tail. It bobs its head at Wei Wuxian, as if to say, </span>\n<em>\n<span>I'll wait.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>\"Thanks,\" Wei Wuxian tells it wryly. \"Lan Zhan, help me up?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mm,\" Lan Wangji says. He stands, pulling Wei Wuxian up with him. Wei Wuxian leans into his chest, wrapping one arm snugly around his waist. \"I can carry you,\" Lan Wangji offers, stroking his back. \"If you want.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"You're sweet,\" Wei Wuxian sighs. \"If I can walk, I'd like to walk.\" Obviously being carried by Lan Wangji is a thousand times better than being yanked a mile down a river, and certainly it's the kind of thing he would normally enjoy, but right now he's had enough of being moved by forces other than himself. He takes an experimental step forward; his knees are still shaky from shock, but he stays upright. He lets himself cling to Lan Wangji anyway, and Lan Wangji starts passing him spiritual energy where their hands are joined at his waist. \"Thanks,\" Wei Wuxian murmurs. </span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji kisses his temple again. \"No need for thanks between us,\" he says. Wei Wuxian holds him tighter.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Alright, alligator person,\" Wei Wuxian says, when he's as steady as he's going to get. \"Lead us there — </span>\n<em>\n<span>slowly.\"</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>As the alligator stands back up and turns to leave again, a light charm floats past Wei Wuxian to hover above its back so they can track it in the dark. Wei Wuxian turns and gives whoever made the charm a thumbs-up, expecting it to be Lan Faseng or the second shixiong, Lan Congyi. But it's Lan Qubei who lowers his hands and returns his nod. \"Good idea,\" Wei Wuxian tells him, and he smiles shyly and bobs his head.</span>\n</p>\n<p> </p>\n<p>\n<span>The alligator leads them through the lush dark of the forest for a quiet half-hour, until at last they break through the foliage and find themselves at the edge of an overgrown rice paddy. In the eastern distance Wei Wuxian can see the lights of the village; just a couple yards west there's a dilapidated little house. The alligator looks towards the house and rattles its jaws together in excitement. It's actually a little cute, in a giant, friendly lizard kind of way.</span>\n</p>\n<p> </p>\n<p>\n<span>\"It's in this house?\" Lan Faseng asks the alligator. It nods eagerly.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Be careful,\" Lan Wangji warns the juniors. \"Touch nothing.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Alligator buddy, you stay back,\" Wei Wuxian decides. \"You're too big and uncoordinated right now, it would suck if you got double-cursed.\"</span>\n</p>\n<p> </p>\n<p>\n<span>They approach the house as a group. It's clear that no one has lived here for years; the sedge roof has visible holes even in the dark, and the front porch has months of dust and plant debris built up all over. Wei Wuxian gestures to Lan Wangji: there are two lines of old leaves pointing diagonally to the doorway, as if the opening of the doors had pushed them there over time. So not wholly abandoned, it seems.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Faseng checks the doorway for charms and finds only a little inscription on the lintel asking the gods for protection, so he opens the doors wide and sends a fire talisman into the black depths of the house. There are little objects all over the place: bowls, medals, lanterns, little carved wooden animals, talismans that range from clearly recognizable to unintelligible even to Wei Wuxian's eye.</span>\n</p>\n<p> </p>\n<p>\n<span>\"So what are we looking for here?\" Wei Wuxian asks the kids as they spread out in the house. \"Eh? What do we hope to find? Just answer, don't be formal about it.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"We're looking for a clue about what all this is,\" Lan Faseng answers. \"Ideally notes that explain what each object is and how it works. Then we can figure out how to reverse the curses.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"We're also looking for information as to who made it all,\" says Lan Ruoshi. \"If we can find the curse-maker and convince them to reverse the curses, we won't need their notes at all.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Good thoughts,\" Wei Wuxian tells them both. \"As a former mad inventor myself, I took extensive notes… but, all of them were in code.\" Didn't stop Mo Xuanyu, but hey, that kid had trained with Jin Guangyao, and Nie Huaisang probably helped a bit too. \"On the other hand, if we track down the person responsible, it's possible that they won't want to reverse the curses, and in fact would rather curse the lot of us, too. So there are advantages and disadvantages to both approaches.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I found the desk,\" Lan Congyi says, from the next room over. \"It's got all sorts of papers and scrolls on it.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Oh goody,\" Wei Wuxian says, and he and Lan Wangji make their way over, followed by a couple of the juniors. The two of them are no longer attached quite so firmly to each other now that Wei Wuxian has gotten more stable on his feet, but they're still holding hands.</span>\n</p>\n<p> </p>\n<p>\n<span>The desk really is a mess. It looks like Wei Wuxian's workspace used to look, back in the Burial Mounds, but with less general blood and gore. Wei Wuxian comes to stand behind it and peers down at it; at first glance it is in code, as he feared, but then he realizes that the code is literally just writing each character backwards. He huffs and says, \"Good heavens, however shall I break this?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji steps closer and looks over his shoulder. \"Completely impenetrable,\" he agrees drily, and Wei Wuxian can't help but to turn his head and press a laughing kiss to his cheek. </span>\n</p>\n<p> </p>\n<p>\n<span>Lan Qubei steps closer and peers at the writing. \"What? It's just backwards,\" he says. \"If you were really desperate you could just use a mirror. In fact,\" he adds, reaching up between them, \"there's a mirror right —\"</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>\"No!\" </span>\n</em>\n<span>cry Lan Wangji and Wei Wuxian at the same time, and they both reach out to grab his hand before he can touch the mirror. But Wei Wuxian is forgetful as always, and he reaches with his injured hand and then of course feels a throb of pain as it connects. \"Shit,\" he snaps, recoiling, and his other elbow hits the bookcase behind the desk, and the great silvery mirror on the top shelf topples down, and there's a massive crashing sound, and the world goes black for the second time that evening. </span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>*</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>\"—nguang-Jun! Hanguang-Jun! Senior Wei!\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian blinks awake again to the dim orange light of a fire talisman. \"I'm fine,\" he wheezes. \"Just… concussed, probably.\" He sits up carefully, making sure not to touch anything other than the floor. Gods, his poor head! He feels the hair at the crown of his head and his hand comes away bloody, but not very. \"Hm,\" he says. He glances to his left to check on Lan Wangji —</span>\n</p>\n<p> </p>\n<p>\n<span>Who isn't there.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Lan Zhan?\" he says. He looks up at Lan Qubei and the other juniors who've crowded behind him. They're all looking down at him and the space where Lan Wangji should be, with varying looks of concern. \"Where'd he go, eh? He's alright, right? Did he just leave me here??\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"You — ah, Hanguang-Jun, Senior Wei, you're both speaking at once,\" Lan Faseng says. \"Hanguang-Jun, you speak first, please?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"What are you talking about?\" Wei Wuxian asks. \"Hanguang-Jun isn't here.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Senior Wei, please wait a moment,\" Lan Congyi tells him, so he shuts up. What in the hell is going on? </span>\n</p>\n<p> </p>\n<p>\n<span>The juniors listen intently to nothing at all for a moment, then Lan Faseng says, \"Y-yes, he seems fine.\" Pause. \"You can't see Senior Wei?\" Pause. \"He can't see you either.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Or hear him,\" Wei Wuxian says hollowly.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Or hear him,\" Lan Faseng echoes. Then, to Wei Wuxian, \"Hanguang-Jun is alright too.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Thanks,\" Wei Wuxian says, then he reaches out tentatively to where Lan Wangji must be. It's extremely strange to feel his fingers — the uninjured hand this time — encounter something he can't see at all, but that's what happens; he meets Lan Wangji's hand halfway, recognizable by its size and shape, the unique calluses from his sword and guqin. \"Lan Zhan,\" he breathes, gripping his hand immediately. It looks like he's got his hand wrapped around air, but it feels normal; Lan Wangji's hand is just as warm and heavy as it always is. Lan Wangji's other hand comes up to trail up Wei Wuxian's arm to grip his shoulder, brush his neck, check his pulse at his jaw. Wei Wuxian pulls him closer and reciprocates his touch. \"What the hell,\" he murmurs as he traces up Lan Wangji's invisible collar, \"what the hell, what the hell — that damned mirror!\" He looks around, but he doesn't see anything — no warped metal disk, no broken mirror frame.</span>\n</p>\n<p> </p>\n<p>\n<span>He turns back to Lan Wangji, and all at once he can see him again, the two of them making instant and intense eye contact. \"Lan Zhan!\" he gasps, and Lan Wangji opens his mouth and says something — probably </span>\n<em>\n<span>Wei Ying </span>\n</em>\n<span>— but Wei Wuxian still can't hear him. \"Lan Zhan,\" he says again, \"I can't —\" and then Lan Wangji disappears again. \"Fuck!\" Wei Wuxian yells. Then he says, \"Sorry,\" to the juniors, who are staring at him with huge eyes. \"I saw him for a second and then he disappeared again.\" But when he says </span>\n<em>\n<span>I saw him, </span>\n</em>\n<span>he hears a strange double-voice: his own and Lan Wangji's.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Hang on,\" he says, a theory slowly forming in his mind. He feels his way up to cup Lan Wangji's warm face in his hands, his injured left hand curled loosely by his ear. When he feels the soft skin under Lan Wangji's eye, he taps it lightly with his thumb. \"Look at me,\" he says to himself. Lan Wangji mirrors his actions on Wei Wuxian's own face, his hands moving up to feel where his eyes are. Wei Wuxian closes his eyes reflexively, then opens them again to look directly above his own thumb.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji stares back at him, visible once again. \"Eye contact,\" they say at the same time, and Wei Wuxian grins. He heard him that time! Lan Wangji is visibly relieved, and then he opens his mouth and says something else that Wei Wuxian can't hear. Instinctively Wei Wuxian lowers his gaze to read his lips, and Lan Wangji disappears again for a split second until he remembers himself and wrenches his gaze back up to look him in the eye again. \"Sorry,\" Wei Wuxian says, although he knows Lan Wangji can't hear him.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji raises his eyebrows and opens his mouth, and Wei Wuxian watches carefully from the corner of his eyes as he forms words: </span>\n<em>\n<span>Same words, same time. </span>\n</em>\n<span>Wei Wuxian repeats it: \"Same words, same time,\" and Lan Wangji repeats himself too, catching up at </span>\n<em>\n<span>words </span>\n</em>\n<span>so that Wei Wuxian can hear him again.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian removes his hands from Lan Wangji's face and makes a </span>\n<em>\n<span>one moment</span>\n</em>\n<span> gesture. Then he forces himself to look away. The moment he breaks eye contact, Lan Wangji blips out of visibility again, and Wei Wuxian shudders, reaches out to grab his hand. To the juniors, he says, \"Do you understand what just happened?\"</span>\n</p>\n<p> </p>\n<p>\n<span>The juniors stare at him. Lan Ruoshi says slowly, \"You… can see each other, but only if you make eye contact? And you can hear each other, but only if you say the same thing at the same time?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yes, exactly,\" Wei Wuxian says, bobbing his head. He grips Lan Wangji's hand tighter and stands up carefully, and Lan Wangji's hand rises in his, as if he stood up too. \"You know, I'm sick of being here!\" he decides. \"Let's leave and come back in the morning, when it's not dark out and I've had a chance to sleep off my drowning and double concussion. Can you tell him I said that?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Uh,\" Lan Faseng says. \"Hanguang-Jun, Senior Wei suggests that we leave for tonight and come back in the morning. He… does not feel well.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Thanks,\" Wei Wuxian says.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Hanguang-Jun agrees,\" Lan Faseng tells him, and then Lan Wangji wraps a warm but invisible arm around Wei Wuxian's waist.</span>\n</p>\n<p> </p>\n<p>\n<span>They all file out of the house again, into the cool night air. The alligator is gone. Wei Wuxian can't quite bring himself to care. He can feel it in Lan Wangji's chest when he says something to the juniors, who agree and leap onto their swords. Ah: they're flying back to town. Probably for the best! Bichen becomes suddenly visible as it unsheathes, and Lan Wangji steps away from him to mount it, his hand trailing across Wei Wuxian's waist up to his arm to hold his wrist. Then Bichen is invisible again, officially included in what Wei Wuxian perceives is what the curse treats as \"part of Lan Wangji.\" Lan Wangji pulls his wrist a little, like, </span>\n<em>\n<span>Come on.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>\"Lan Zhan ah,\" Wei Wuxian says uselessly, \"How am I supposed to get on your sword if I can't even see it?\" But he reaches out anyway and catches Lan Wangji's other hand, and Lan Wangji hovers closer and presses Wei Wuxian's uninjured hand to his own hip. That's properly helpful: if Lan Wangji's hip is this far away, then Bichen is that far away. Wei Wuxian grasps his hip and steps up into thin air, trusting Lan Wangji's grip on his wrist to keep him balanced.</span>\n</p>\n<p> </p>\n<p>\n<span>His first foot connects, and then his second, and then Lan Wangji is wrapping his arms back around Wei Wuxian's waist and pulling him close, and Wei Wuxian slides his arms around his neck and closes his eyes. The two of them really do work really well together, he thinks. Lan Wangji drums his fingers once between Wei Wuxian's shoulder blades, just to make sure he's paying attention, and then they start to move, slowly at first and then gaining speed. Wei Wuxian opens his eyes briefly, just to see what it looks like to be carried by an invisible flying body, and then he promptly gets crazy strong vertigo and shuts his eyes again. Turns out flying is great when you can see the sword you're flying on, but looking at your own feet hovering on nothing, thirty feet in the air, is a little disorienting! He tucks his face into the warm column of Lan Wangji's throat and pretends, in the darkness of his closed eyes, that everything is normal. He feels Lan Wangji's throat bob as he swallows.</span>\n</p>\n<p> </p>\n<p>\n<span>He focuses on the sensation of the cooling night air tugging at his wet hair and clothes until they get back into town. They fly right up to the inn and dismount; most of the villagers from earlier seem to have gone home in their absence, but there's still a little group milling around who perk up when they approach. The innkeeper is there, and the village head, and a couple others; the juniors approach the village head to let her know what they had discovered.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Oh, good, daozhang is alright,\" one of the other villagers says, an older woman with big arms and rounded shoulders. She hurries over and clasps Wei Wuxian's hands in hers. \"This mother apologizes for her rash, clumsy son. His hands slipped, he didn't mean to loose the arrow. We have caused you so much trouble.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian gently extracts his hands and pats her hands, feeling awkward. \"It's no trouble,\" he says. \"I'm fine in the end, so, please don't worry, auntie.\" Of course it was trouble, and he isn't totally fine, but there's no point in saying so.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Faseng comes up beside him as the auntie bows to him and he bows back. \"Ah, Senior Wei? Hanguang-Jun says we should go inside.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Okay,\" Wei Wuxian says. \"It's getting late, isn't it? Time for little Lans to go to bed.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"No, we have another hour,\" Lan Congyi says helpfully, falling into step beside him. </span>\n</p>\n<p> </p>\n<p>\n<span>\"Shouldn't you have that as free time?\" Wei Wuxian wonders. \"You should be wandering around town, eating street snacks and playing.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"The others have free time now, but Senior Wei is injured and Hanguang-Jun can't see the injuries, so he's asked second shidi and me to help,\" Lan Faseng explains. \"Congyi-shidi is learning medical arts, so you're in good hands, Senior Wei.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I don't doubt it,\" Wei Wuxian says as they enter the inn. \"Where'd Hanguang-Jun go, is he upstairs already?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"No, Hanguang-Jun is right here,\" Lan Congyi says, and then Lan Wangji's warm hand touches the inside of Wei Wuxian's wrist. Wei Wuxian laces their fingers together and looks to his right, although he knows he won't see anything. It's strange, to know he's there and not be able to see him at all. Lan Wangji presses closer as they climb the stairs, as though he's nervous that Wei Wuxian will fall. Well, it's very sweet, but Wei Wuxian isn't </span>\n<em>\n<span>that</span>\n</em>\n<span> unsteady just now!</span>\n</p>\n<p> </p>\n<p>\n<span>… Not quite, anyway.</span>\n</p>\n<p> </p>\n<p>\n<span>The four of them file into Lan Wangji's room at the end of the hall, and Wei Wuxian drops to sit ungracefully on the couch. The invisible hand of Lan Wangji lights all the lamps, but turns all but one moveable lamp down low, for which Wei Wuxian and his pounding head are very grateful. The door opens and closes; Lan Wangji must be going to get something. The two juniors consult quietly, then Lan Congyi says, \"Senior Wei, you said you hit your head and you swallowed water — are you injured in any other ways?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Drowned,\" Wei Wuxian corrects, since it's an important distinction. \"I passed out both times when I hit my head, but I think that the second time was probably just the curse. And I hit my hand.\" He offers his left hand for inspection. In the light he can see a dark bruise already forming under his fourth finger.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Congyi looks at him appraisingly for a moment, then decides, \"Senior Wei, I'll take a look at your head if shixiong will look at your hand.\" Wei Wuxian gives his agreement, and the kids get to work, prodding gently at his hair and palm. The door opens and closes again, and a moment later there's a warmth at his side, and Lan Wangji takes his free hand to channel spiritual energy to him.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Tell Lan Zhan that I'm weeping uncontrollably,\" Wei Wuxian says to the juniors. \"Tell him I'm truly pitiful and he needs to do everything I say until I'm well again.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Lying is forbidden,\" Lan Faseng reminds him.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Well find a way around the lie,\" Wei Wuxian advises. \"Tell him that's what I said to tell him.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Congyi is in the middle of carefully holding his eyelids open to check his pupils, but he still obeys, bless him. \"Hanguang-Jun, Senior Wei would like us to tell you that he can't stop crying and he'd like for you to do everything he says until he's better.\" There's a moment of silence, and then Lan Congyi says to Wei Wuxian, \"Hanguang-Jun says he already does everything you tell him.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian laughs in delight, and then he winces as his chest contracts painfully. \"Oh, ow, don't make me laugh again,\" he begs, \"that sucked.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"How's your vision?\" Lan Congyi asks, instead of telling Lan Wangji to stop being so funny. His vision is fine; his hearing is fine; his balance is a little dodgy; his strength is fine, and he can feel everything (unfortunately); his hands are still shaky, but that might just be shock. Or cold, since he's still in his soaking-wet clothes. Mostly he just has an awful headache and he wants to go the hell to sleep. \"You definitely have a concussion, but it could be worse,\" Lan Congyi decides. \"You should take these pills, but the best thing is to rest. No physical or mental strain if we can help it. Hanguang-Jun, don't let him run around too much.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Hah! The nerve of this kid, ordering Lan Wangji around! But Lan Wangji squeezes his hand, like, </span>\n<em>\n<span>Understood, </span>\n</em>\n<span>so maybe he really will be under house arrest for a day or two. \"Boring,\" Wei Wuxian mutters. He takes the proffered pills and swallows them dry.</span>\n</p>\n<p> </p>\n<p>\n<span>As for his hand, Lan Faseng's opinion is that he probably didn't break anything, it's just a really deep bruise. Lan Wangji reaches across his lap to take that hand from Lan Faseng and concentrate spiritual energy into the bruise, which helps with the pain, but other than that there's not a whole lot one can do about such an injury. If he still had his golden core, he could heal it by himself in a day; without it, it'll take longer.</span>\n</p>\n<p> </p>\n<p>\n<span>The last condition to check is his lungs. Lan Congyi has him move to sit on the floor, where he lays his ear against Wei Wuxian's back to listen to his breathing. Wei Wuxian breathes in, out, then in again deeper — and chokes, his muscles spasming painfully around his ribs. He curls forward and coughs violently, dimly aware of Lan Congyi scooting backwards in surprise, and then Lan Wangji's big warm hand appears at his back, rubbing soothing circles into his shoulder blades. Wei Wuxian holds his breath between coughs for as long as he can, trying to regain control. When the fit has mostly passed, he slumps sideways into Lan Wangji's invisible lap and says to the floor, \"I'm okay. This is the worst.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Senior Wei may have noticed there's still some fluid in his lungs,\" Lan Congyi says. Yes he did notice, thanks, Congyi! \"That'll cause problems with damp phlegm if you aren't careful, so this disciple advises you to eat hot food, with ginger, strong spices, and the like.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Oh goody,\" Wei Wuxian says weakly, if sincerely. \"Congyi-shidi, you're my new favorite.\" Lan Wangji pats his back knowingly. Wei Wuxian endeavors to sit up. \"That's all, right? Thanks, you two.\"</span>\n</p>\n<p> </p>\n<p>\n<span>The juniors salute him and say together, \"Yes, Senior Wei.\" Then their attention shifts to the air next to him, as Lan Wangji says something. \"Oh!\" Congyi says. \"He didn't mention. Senior Wei, Hanguang-Jun says you have scratches on your chest?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Oh, he does, doesn't he. He looks down at his robes. \"They're not a big deal,\" he says, picking at his dark collars. \"I forgot about them until now.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Allow this disciple to clean them?\" Lan Congyi asks.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Sure,\" Wei Wuxian sighs. He sits up properly and reaches around to undo his belt, but he can't do it one-handed, so he grabs around for one of Lan Wangji's hands. Once located, he guides Lan Wangji's hand to the back of his belt and pats it once, like, </span>\n<em>\n<span>Okay, husband, do your job! </span>\n</em>\n<span>After a moment Lan Wangji acquiesces, carefully extracting the ends of the ties from underneath the main belt and pulling it open. \"I bet his ears are so red right now,\" Wei Wuxian mumbles to himself. He shrugs his top layers off and looks at the scratches himself; their resemblance to dog scratches makes him feel a little queasy, but otherwise they really don't look particularly bad at all.</span>\n</p>\n<p> </p>\n<p>\n<span>The juniors both hiss through their teeth anyway. \"What??\" Wei Wuxian asks. \"Am I not seeing something? Do they look that bad??\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"N-no, the scratches are fine,\" Lan Congyi says. \"It's just… the rest of you, Senior Wei.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian looks down at himself again. Is he really that scarred up? He's got the Wen brand, obviously, and the top of the scar from the core removal is just visible above his loosened belt. Plus a handful of purple marks from Zidian curling around his sides, plus a scar like a knot in a tree on his shoulder where he was shot that time, plus two big lines where first Jiang Cheng and then Jin Ling stabbed him… Various other little scars from where people nicked him with their swords... \"I fail to see your point,\" he says.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji must say something, because Lan Faseng says to him, \"Senior Wei really is fine, Hanguang-Jun, these disciples were just… surprised by old scars. Senior Wei, please forgive us, it is unbecoming of Lan sect disciples to be so intrusive.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian flaps a hand at them. \"It's fine,\" he says, \"No worries.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"What scars —? Hanguang-Jun hasn't seen Senior Wei with his shirt off??\" Lan Congyi blurts, looking in surprise at Lan Wangji, and then his eyes widen in horror and he looks at the ground. \"Sorry! Sorry! Please forgive me!\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian cackles. \"Rub it in, why don't you!\" he gasps, and then he starts coughing again. He's still choking on giggles when he says, \"Tell him he was there for most of them, please, he shouldn't be surprised.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Congyi obeys, and Lan Wangji's hand appears warm and solid on the bare skin of Wei Wuxian's upper back. \"Anyway, it's not like he doesn't have scars he hasn't told me about,\" Wei Wuxian mumbles, as Lan Congyi dabs cleaning goop onto the scratches from the alligator. To be fair, Lan Xichen had told him about those scars, but that was only because Lan Wangji would never have said anything.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Congyi sits back on his heels and says, \"Alright, Senior Wei, rinse that off in ten minutes, and that's about all this disciple can do. Remember no running around and no solving puzzles! Take it easy!\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian bobs his head obediently and raises three fingers in a salute. \"Yes sir! Thank you for your care!\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Goodnight, Hanguang-Jun, Senior Wei,\" Lan Faseng says, echoed by Lan Congyi.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Goodnight,\" Wei Wuxian and Lan Wangji say together, and Wei Wuxian grins to hear Lan Wangji's voice again. He leans back into Lan Wangji's hand as the boys leave, tilts his head to bat his eyelashes in Lan Wangji's general direction even though of course he can't see it. \"You've finally got me with my shirt off,\" he teases, equally in vain.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji's hand moves over his skin from his back to his waist, pulls him closer so his back is pressed along Lan Wanji's front. Wei Wuxian lays his head back on Lan Wangji's shoulder as he feels his way blindly up Wei Wuxian's chest, his long fingers gentle in their exploration. He's feeling for scars, Wei Wuxian realizes. He turns his face to press his forehead against Lan Wangji's throat and the side of his chin, reaches down to cover Lan Wangji's invisible hand with his own. He guides his hand to the Wen brand, their matching scar, then, careful to avoid the goop, down to the scars from Jin Ling and Jiang Cheng. Then to the surgical scar from the core removal. It starts just below his belly button, the white line of scar tissue neatly bisecting the trail of dark hair there. He feels Lan Wangji inhale as he guides their fingers down the length of the scar, below the waist of his still-wet trousers.</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>This shouldn't be sexy, </span>\n</em>\n<span>he thinks. He's showing Lan Wangji the scar that represents the death of his spiritual life. The best and worst thing he's ever done to his brother, to himself. It shouldn't be sexy. It isn't. It's not.</span>\n</p>\n<p> </p>\n<p>\n<span>And yet...</span>\n</p>\n<p> </p>\n<p>\n<span>And yet, as Lan Wangji traces his fingers along the scar, Wei Wuxian finds himself leaning closer. He strokes little circles with his thumb onto the side of Lan Wangji's investigating hand, closes his eyes. The scar itself is small, and more or less numb, but he can feel Lan Wangji's fingers brushing the fine hair around it, can feel the heat of his hand above his lower dantian. He shivers, and Lan Wangji's other hand appears then as a warm heavy weight on his thigh, not moving, just touching him. \"Lan Zhan,\" Wei Wuxian breathes. Lan Wangji is still stroking along the scar. Wei Wuxian squeezes his hand and laces their fingers together, spreads Lan Wangji's palm flat against his body, urges it a little lower. Lan Wangji says something into his hair, two syllables, probably </span>\n<em>\n<span>Wei Ying. </span>\n</em>\n<span>Wei Wuxian turns his head and presses a humming moan into Lan Wangji's throat.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji shudders around him. He nuzzles Wei Wuxian's hairline, smears dry kisses along his temple, his ear. Gods, he's warm. Wei Wuxian tilts his head away to bare his neck, and Lan Wangji takes the hint, kissing under his ear and down his throat. Wei Wuxian smiles lazily and leans all the way back into him, scooting backwards a little until Lan Wangji gets the idea and pulls him onto his lap, his left leg folded up by his chest, the perfect height for Wei Wuxian to hook his arm around that knee. Now who's sitting messily! He snuggles back into the warm silk of Lan Wangji's chest and Lan Wangji leans down to kiss his shoulder again. His lips are so soft on Wei Wuxian's bare skin, just a little wet.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian opens his eyes abruptly. He has realized that he needs Lan Wangji's tongue in his mouth or else he will surely perish. He twists in Lan Wangji's lap and looks around in the general direction of his eyes until they make eye contact, and for a moment Wei Wuxian drinks in the sight of him, his blown pupils and pink ears, and then he demands, \"Kiss me.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Realistically speaking, Lan Wangji probably couldn't read his lips out of the corner of his eye like that, not when their faces are so close together. But it's not like Wei Wuxian's request is coming out of nowhere, so Lan Wangji leans in anyway. He disappears from sight immediately; either he closed his eyes or he went to look at Wei Wuxian's mouth instinctively. It doesn't matter. They find each other's mouths anyway, finally, </span>\n<em>\n<span>finally. </span>\n</em>\n<span>It has taken so long for them to get here, and Lan Wangji's mouth is perfect, warm and soft and wet against Wei Wuxian's lips. Wei Wuxian shuts his eyes, inhales hard through his nose and presses closer, raises his hands to loop his arms around Lan Wangji's neck and shoulders. Lan Wangji's breath comes in warm little puffs against his face, his lips moving firm and slow against Wei Wuxian's own. </span>\n</p>\n<p> </p>\n<p>\n<span>\"Yes,\" Wei Wuxian murmurs into him, and \"yes,\" as Lan Wangji kisses his mouth open, \"yes,\" as Lan Wangji pulls him closer with his left hand and grips his bare hip with his right, \"yes,\" as he slides his own right hand along the back of Lan Wangji's neck, feels his throat vibrate against his thumb with silent vocalizations of his own, \"yes,\" as —</span>\n</p>\n<p> </p>\n<p>\n<span>— as someone knocks on the </span>\n<em>\n<span>fucking </span>\n</em>\n<span>door. </span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian really might cry at this rate. They pull apart and stare at each other wildly, visible once more. Oh, that's what Lan Wangji looks like when he's been kissed stupid. Wei Wuxian lets out a horrible little whining moan at the sight of him, even as Lan Wangji looks away and becomes abruptly invisible again. \"Lan </span>\n<em>\n<span>Zhan,\"</span>\n</em>\n<span> Wei Wuxian groans. Lan Wangji gently removes his hand from Wei Wuxian's hip and picks him up. Wei Wuxian squeezes his eyes shut against the vertigo, opens them again when he's been safely deposited back on the couch. After a moment Lan Wangji's abruptly visible outer robe is tucked neatly over his naked torso, and then there's a few seconds of silence, and then the door opens.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian lies there on the couch, trying to be discreet as Lan Wangji has whatever conversation he's having with the inn employee who so rudely interrupted them. The door opens wider and the inn employee rolls a great big wooden tub into the room, then leaves, then immediately returns with two sloshing buckets full of steaming water. Wei Wuxian watches as she fills the tub, walking back and forth between the room and what must be a cart of buckets in the hallway. Lan Wangji must be helping her; the water splashes audibly when she's away. At last the inn employee bows to thin air and leaves, closing the door behind her.</span>\n</p>\n<p> </p>\n<p>\n<span>\"I suppose that's for me,\" Wei Wuxian says into the silence. Sure enough, Lan Wangji's gentle hands appear at his shoulder and waist, and he stands with a sigh. Lan Wangji takes his outer robe back, and Wei Wuxian has a second to miss being able to see it before Lan Wangji touches the waist of his trousers. Wei Wuxian waits for him to untie them, but he just keeps his hands there, as though he's waiting for — oh, of course, he's waiting for Wei Wuxian to give him permission. Wei Wuxian puts his hands on Lan Wangji's and guides them to where the bow sits right over his scar. </span>\n<em>\n<span>Yes.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji unties the bow. Pushes the pleated fabric of Wei Wuxian's trousers down until they fall to the floor by themselves.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian stands there in front of him, naked and invisible.</span>\n</p>\n<p> </p>\n<p>\n<span>He tilts his head forward until it bumps gently against Lan Wangji's shoulder. Lan Wangji stiffens under him, but after a moment he relaxes, and hands appear in Wei Wuxian's hair to release his ponytail. Wei Wuxian exhales as Lan Wangji cards through his wet hair, getting the worst of the tangles out.</span>\n</p>\n<p> </p>\n<p>\n<span>When his hair is more or less detangled, Lan Wangji steps away. Wei Wuxian waits for him to do something else, but no hand comes gentle and warm to cup his face or trace his shoulder blade. So he steps into the tub unaided and sinks into the water, hissing at its heat on his skin. He scrubs residual mud and sand from himself, slides down in the tub to fully immerse his hair. He can't help but think that this would be easier if someone wanted to help him, but the hot water does feel good, and he had been kind of sticky and gritty from the river, so he really can't complain.</span>\n</p>\n<p> </p>\n<p>\n<span>When he's all scrubbed clean, he lets himself just sit there soaking for a while, letting his fingers prune and his muscles relax, curled up quietly with his nose only an inch above the surface of the water. And then, at last, the water in front of him is disturbed by an unseen force, and Lan Wangji's gentle fingers brush his face, slip down to cup his chin, feel at his throat for his pulse. Wei Wuxian grabs his wrist with wet hands and squeezes it, thinking, </span>\n<em>\n<span>Pay attention to me! </span>\n</em>\n<span>Lan Wangji's other hand appears at the back of his head, stroking over and over. Wei Wuxian twists around in the tub and looks around until the two of them make eye contact.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji has taken his hair down and is crouching next to the tub, and he looks distressingly unaroused. In fact, he just kind of looks anxious. He stops stroking Wei Wuxian's hair and gestures to his ear and then the tub, and then to Wei Wuxian, and then to his ear again. Wei Wuxian endeavors to track his movements without breaking eye contact. Lan Wangji strokes his fingers across his own throat, and then Wei Wuxian realizes: he'd been listening for the sounds of Wei Wuxian bathing, and then they stopped, and he'd gotten worried. Wei Wuxian squeezes the hand he's got captive. \"It takes more than a bathtub to drown me, Lan Zhan,\" he says, figuring Lan Wangji will get what he means from his expression if not his words. \"It takes an alligator at </span>\n<em>\n<span>least.\"</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji's eyebrows just draw together minutely. Wei Wuxian looks away and stands up, a little thrilled at his own nakedness so close to Lan Wangji. He squeezes the water from his hair with one hand and clambers out of the tub. Lan Wangji's outer robe settles over his shoulders a moment later, and he slips his arms into the sleeves gratefully. He tucks the edges around himself without tying it closed and reaches out until his hand hits Lan Wangji's waist, and then he reels himself in. He catches Lan Wangji's eye after a second of fruitless looking around, and then he says, \"Hold me!\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji says something — a guess at what he'd said? — so Wei Wuxian repeats himself: \"Hold me!\" Then again, so that Lan Wangji can say it with him, \"Hold me,\" and this time he hears Lan Wangji's beautiful voice with his own. And then, well, Lan Wangji just said </span>\n<em>\n<span>Hold me, </span>\n</em>\n<span>and who is Wei Wuxian to refuse him? He steps closer and wraps his arms around Lan Wangji's narrow waist, nuzzles into his throat like he's increasingly sure he was born to do. After a second of surprise, Lan Wangji's hands fall warm and soft onto his back, pressing him close. Wei Wuxian kisses his pulse point in reward. Lan Wangji shivers, pulls his hands up through Wei Wuxian's wet hair to hold his face in his hands. He maneuvers Wei Wuxian's head out from the crook of his neck and blinks into visibility again, and the two of them just look at each other, feel each other breathe. Wei Wuxian loves his short straight eyelashes and his strange light eyes. \"Husband,\" he says, letting his hands fall to Lan Wangji's angular hips. \"My Lan Zhan. Take me to bed.\"</span>\n</p>\n<p> </p>\n<p>\n<span>He's certain that Lan Wangji has no clue what he just said, but he leans down and kisses Wei Wuxian anyway. Wei Wuxian closes his eyes and hums into the kiss, lets their lips move together like a question, answered. Why haven't they been kissing this whole time? Of course they keep getting interrupted, but — before that, even, when they were together for weeks chasing the mystery of Nie Mingjue and the rest of it, why hadn't they ever just stopped and made out for a couple hours? All of a sudden he can't remember at all what kept stopping him from stepping closer, from even holding Lan Wangji's hand. This, now: this feeling of total warmth, the softness of Lan Wangji's breath on his face, the sweet glide of their mouths together — how come it took so long?</span>\n</p>\n<p> </p>\n<p>\n<span>How come they didn't do this while they could actually see and hear each other???</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian reaches up to hold Lan Wangji's lean forearms and walks backwards with him the couple steps it takes to reach the bed, still kissing. When the backs of his legs hit the bedframe he sits down heavily and pulls Lan Wangji down with him. There's a huff of air by his cheekbone, and then Lan Wangji kisses his cheek, his ear, his chin. Wei Wuxian can feel him smiling against his skin. \"I like you,\" he declares into empty air, because he just can't help himself. \"I really like you, Lan Zhan — you'll stay with me, this time, right?\" Lan Wangji kisses his mouth as he says </span>\n<em>\n<span>right, </span>\n</em>\n<span>then, perhaps realizing Wei Wuxian was saying something, he pulls back a little and they make eye contact. Oh, wow, he's so stupidly handsome, all gold and black in the lamplight. \"I like you,\" Wei Wuxian repeats, holding his gaze, and then he says it again, \"I like you,\" and then Lan Wangji says it too, with him, his pretty eyes narrowed in happiness. Wei Wuxian watches him say </span>\n<em>\n<span>Wei Ying. I like you. </span>\n</em>\n<span>Something that could be </span>\n<em>\n<span>Husband, </span>\n</em>\n<span>maybe </span>\n<em>\n<span>My husband. </span>\n</em>\n<span>Wei Wuxian adores him.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Don't leave me,\" Wei Wuxian says, so softly that his lips barely move around the words. He strokes Lan Wangji's unbound hair back from his face. It feels scary and good to say it aloud to him, like a piece of stolen candy; he won't ever say such a thing when Lan Wangji can really hear him, because he would hate it if Lan Wangji were to stay with him because he thought he had to. What Wei Wuxian really wants is for Lan Wangji to stay with him because he </span>\n<em>\n<span>wants </span>\n</em>\n<span>to stay with him. But Wei Wuxian is sick of being left behind, and so he says it anyway. Lan Wangji watches him, silent and warm above him. Wei Wuxian blinks and he disappears. A moment later his mouth presses wet and gentle against Wei Wuxian's throat, sweet kisses lavished against his pulse. </span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian pets his hair, strokes his hands down his back. He considers pushing Lan Wangji's hand back down his chest, down below his scar. But… he finds he doesn't want to. Or rather: he really, really wants to, but even more than he wants Lan Wangji to touch him, he wants to be able to see Lan Wangji's hands on him, to hear his quickened breath. This state is temporary. He wants as much of Lan Wangji as he's allowed to have. He can wait until the curse is fixed. And anyway, he's tired and in pain.</span>\n</p>\n<p> </p>\n<p>\n<span>Until then… \"You must be enjoying this, huh,\" Wei Wuxian mumbles to himself. \"Can't hear my nonsense or see me being messy at all… Finally some peace and quiet for Hanguang-Jun,\" he jokes, and then he laughs to himself, and Lan Wangji kisses him silent.</span>\n</p>\n<p> </p>\n<p>\n<span>For now he's content to just lie here kissing quietly. They settle side by side on the bed, holding each other loosely, trading quiet kisses until Wei Wuxian can feel Lan Wangji beginning to fall asleep mid-kiss. He laughs to himself and kisses him one last time, soundly, and then he reaches up and feels around the back of Lan Wangji's head to untie his forehead ribbon for him. They catch each other's gaze as he draws away, folding the ribbon in his hand. Lan Wangji looks sleepy and handsome and kissable, so Wei Wuxian holds his gaze and kisses him again with drooping eyelids. He feels it against his mouth when Lan Wangji hums into the kiss, and then Lan Wangji pulls away and disappears again. The bed shifts as he sits, then stands. A minute later he returns; when Wei Wuxian touches him, he finds that Lan Wangji is now wearing only his undershirt and trousers. He lies back down next to Wei Wuxian, and the lamps extinguish themselves. Wei Wuxian snuggles close and whispers, \"Goodnight, Lan Zhan.\"</span>\n</p>\n<p> </p>\n<p>\n<span>He feels Lan Wangji's breath on his face as he reciprocates. </span>\n<em>\n<span>Goodnight, Wei Ying.</span>\n</em>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>*</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>Wei Wuxian wakes up just once that night, to the feeling of Lan Wangji shifting beside him. They'd both gone to sleep on their backs — Lan Wangji because he always does, and Wei Wuxian because he's injured and he supposes he should treat his body nicely for once — but now Lan Wangji is turning onto his side to face Wei Wuxian in the dark. Wei Wuxian closes his eyes; it's not like he can see Lan Wangji anyway. He's almost dozing again when Lan Wangji puts one warm hand on his bare chest, his fingers right over his sternum, his palm over the Wen brand. Wei Wuxian breathes evenly, tries not to let on that he's awake. He wonders what Lan Wangji is up to: is he feeling for scars again? But he doesn't move his hand, just keeps it there for several long breaths, heavy on Wei Wuxian's chest. Then he removes it, and Wei Wuxian thinks, </span>\n<em>\n<span>Huh. Okay.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Then Lan Wangji shifts again, pushes himself up almost to sitting, and his hair trails over Wei Wuxian's bare chest before he lays the side of his face where his hand had been. His face is just a little wet. Wei Wuxian stops pretending to be asleep. \"Lan Zhan?\" he asks; even though Lan Wangji can't hear him, he'll feel the contraction of his chest as he speaks. Wei Wuxian reaches up and puts his hand in Lan Wangji's hair, strokes it softly. \"My Lan Zhan, don't cry,\" he says, and then he thinks about what it must have been like, growing up in the Cloud Recesses with Lan Qiren as a guardian, and he corrects himself, \"Cry all you want. Why are you so sad, huh?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji turns his head to kiss Wei Wuxian's chest, right in the middle, where his heart is. He spreads his hands over Wei Wuxian's pectoral muscles, warm and flat, lets them rise and fall with Wei Wuxian's breath, intimate without feeling sexy. Wei Wuxian pets his hair again, puzzled and endeared and worried. Lan Wangji kisses his chest again, and then he retreats, slips away to lie on his back again like he had before, their shoulders brushing invisibly. Wei Wuxian turns his head to face him and finds himself making eye contact in the dark. Lan Wangji's face is a blue smudge in front of him. \"Are you okay?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji says something, but it's too dark and they're too close for Wei Wuxian to attempt to read his lips. So Lan Wangji reaches over and takes Wei Wuxian's right hand in his, lines up their pointer fingers together like spoons, and writes in the air. Wei Wuxian watches as his own finger draws each stroke above him, until he puts the words together: </span>\n<em>\n<span>Miss you.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>\"Oh, Lan Zhan,\" he breathes. How is it possible to love one person this much? Shouldn't he hit a limit at some point? Shouldn't he wake up one day and love Lan Wangji just as much as he did the day before, no more? He turns onto his side and tugs Lan Wangji close, presses kisses all over his sweet face. Lan Wangji exhales through his nose and puts one warm hand on Wei Wuxian's waist, accepts the kisses. \"I'm here, you silly man,\" Wei Wuxian whispers into his mouth. \"You don't have to miss me.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji kisses him again and holds him close, and they fall back asleep like that, curled into each other, silent and invisible in the dark.</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>*</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>He wakes again, of course, to Lan Wangji moving around him in the morning light, trying to slip discreetly from his grasp. Wei Wuxian pouts and clings tighter, whines, \"Noooo, Lan Zhan, stay here, keep holding me,\" although he knows that such efforts are even more useless than they might ordinarily be. Lan Wangji kisses his forehead and pets his hair and keeps trying to escape, the early-rising bastard, so Wei Wuxian snuggles closer and ups the ante by pressing little kisses all over Lan Wangji's throat and chin. \"Lan Zhan, it's sooooo early,\" he mumbles. \"We went to bed late, don't you want to sleep in? Your poor husband is so sleepy…\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji says something against his mouth, probably something about 'rules' and 'juniors' and 'setting an example,' or some other such completely unreasonable thing. But Wei Wuxian can't hear him, so he doesn't have to wake up, right? When at last Lan Wangji successfully extricates himself and stands up, Wei Wuxian melts back into the bed and snuggles into the pillow to nap until Lan Wangji realizes he hasn't gotten up yet. Maybe there are some advantages to being invisible to Lan Wangji after all.</span>\n</p>\n<p> </p>\n<p>\n<span>He's sort of half in a dream involving Lil Apple and an excess of radishes when a hand appears at his shoulder to shake him gently awake. He groans and swats at the hand, but he sits up anyway and leans forward to bonk his head into whatever part of Lan Wangji is closest to him, which ends up being his shoulder. Ah, so he's kneeling by the bed. After a second Lan Wangji finds his hand and presses a bowl of tea into it, which Wei Wuxian takes gratefully. It's the perfect temperature, and Lan Wangji can't see him anyway, so Wei Wuxian drinks it all at once. </span>\n</p>\n<p> </p>\n<p>\n<span>Then he reaches up to push his hands through Lan Wangji's silky hair, and cups his face and pulls him into a kiss. When he pulls away, they make eye contact and say, \"Good morning,\" at the same time, and Wei Wuxian is so happy to see and hear Lan Wangji that he has to lean in and kiss him again, eyes open so as not to lose him.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji accepts the kiss, then presses a bundle into Wei Wuxian's hands that turns out to be his newly-laundered clothes from when he'd first arrived. \"Oh, good,\" he says, and he scrambles up to shrug off Lan Wangji's outer robe in favor of hopping into his usual black trousers. He likes wearing Lan Wangji's expensive silk clothes because he's in love with him, but there's something to be said for a simple pair of black linen trousers.</span>\n</p>\n<p> </p>\n<p>\n<span>Once he's decent again he takes the robe he wore all night and flaps his hand about in the air until he hits Lan Wangji, then he drapes the robe around his shoulders and ties it by touch. He wants to dress Lan Wangji every morning, to undress him every night. He sweeps his hands up Lan Wangji's chest to cradle his jaw, then gives both his earlobes a little tug. \"That's for being too cute,\" he tells him seriously. Lan Wangji swims into visibility again as their eyes meet, and Wei Wuxian realizes his hair is up but he isn't wearing his forehead ribbon yet. A hand at his wrist, pressing the ribbon into his fingers: an offering. </span>\n</p>\n<p> </p>\n<p>\n<span>\"You know I won't be able to tie it perfectly like this,\" Wei Wuxian warns him. \"I can look at you or I can look at the ribbon, but not both.\" He takes it anyway, watches Lan Wangji's eyes as he drapes it over his forehead. Lan Wangji reaches up and holds the center filigree helpfully in place at the center of his forehead, and Wei Wuxian ducks closer to tie it blindly under his hair. When the knot is tied, Lan Wangji dips forward to kiss him soundly.</span>\n</p>\n<p> </p>\n<p>\n<span>All at once Wei Wuxian thinks, </span>\n<em>\n<span>Holy shit, he really loves me, </span>\n</em>\n<span>only about seventeen years late. He wraps his arms tight around Lan Wangji's neck and makes a sound into the kiss that he's immediately grateful Lan Wangji cannot hear. They kiss deeply, wet and open-mouthed, and Wei Wuxian thrusts his tongue experimentally into Lan Wangji's mouth. Oh! the results of that experiment! Lan Wangji sucks on his tongue and they make simultaneous </span>\n<em>\n<span>mmn </span>\n</em>\n<span>sounds, which means they can hear each other, and then they have to break apart as Wei Wuxian starts laughing helplessly. \"Sorry,\" he gasps, leaning closer, \"again, do it again,\" and Lan Wangji has just taken him up on that when there's a knock at the door.</span>\n</p>\n<p> </p>\n<p>\n<span>This time their twinned groans are frustrated, not aroused. Wei Wuxian reluctantly releases Lan Wangji, and a moment later the door opens, revealing an inn worker with a tray of food. The tray disappears and the inn worker salutes the empty doorway, then the door closes. Wei Wuxian waits for the tray to reappear on the low table, then he goes to sit on the side of the table farther from the door. When he's seated he makes eye contact with Lan Wangji again, sitting across from him. His eyes are large and dark in his face, his hair ever-so-slightly disheveled. His mouth is so red. Wei Wuxian smiles.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji looks away, invisible again. But his hand appears over Wei Wuxian's left hand on the table, and they eat breakfast like that, silent and holding hands. The click of their chopsticks colliding as they serve each other is inaudible with the curse, but Wei Wuxian feels it just the same.</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>*</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>After they eat, they reconvene with the juniors and head outside. Lan Congyi looks at Wei Wuxian's hand and listens to his breathing again and tells him he's already better than he was last night, which is good to hear. He certainly feels better, although he does have a slight headache lurking behind his eyes. Then they all hop back on their swords and return to the abandoned house; Wei Wuxian rides with Lan Wangji again, leaned back against his chest with Lan Wangji's arm warm and snug around his waist. </span>\n</p>\n<p> </p>\n<p>\n<span>In the daylight, Wei Wuxian can certainly see why all those kids kept coming out here even though their peers kept ending up cursed: the place is a Curious Kid magnet. Certainly if he'd grown up in this town, he would have spent all possible free time sneaking out to investigate. Even as they approach, he can tell the house is tantalizingly decrepit: not so fragile as to be truly falling apart, but enough to be thrillingly dangerous, and with such strange and exciting things inside! He leaps off Bichen before Lan Wangji has even come to a stop, ignoring the gasps of surprise from the juniors, and lands with a flourish on the solid dirt path up to the porch.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Oh, I already forgive this place for cursing me,\" Wei Wuxian decides, his hands on his hips. A moment later Lan Wangji's hand appears at his shoulder, hesitant and then sure as he locates him in space.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yes, Hanguang-Jun,\" the juniors chorus, in response to something that Wei Wuxian can't hear. Probably 'Be careful.'</span>\n</p>\n<p> </p>\n<p>\n<span>\"Alright, back to work,\" Wei Wuxian says, stepping forward. \"Like last night— Ah, Hanguang-Jun, why are you stopping me?\" he asks, when Lan Wangji catches his elbow. He turns and makes eye contact with Lan Wangji, who says something inaudible. He looks conflicted.</span>\n</p>\n<p> </p>\n<p>\n<span>After a moment, Lan Faseng says, \"Ah… Hanguang-Jun says, it's best if Senior Wei stays outside, since you're already injured and he can't see you.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Lan Zhan ah,\" Wei Wuxian complains. \"I feel fine. I'm better already, Young Master Congyi says so.\" But he's got a point about their not being able to see each other; they've been moving together just fine so far, but it's risky to be together in an enclosed space full of cursed objects. Wei Wuxian sighs and relents. \"Alright, I'll stay out here. Lan Qubei, do me a favor and go get those notes we saw last night, hm?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yes, Senior Wei,\" Lan Qubei agrees. </span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian looks back to catch Lan Wangji's eye. He's still holding his elbow. Wei Wuxian nods once, and Lan Wangji's expression relaxes as he nods back. He squeezes Wei Wuxian's arm, then disappears as he turns to enter the house. \"Don't get yourself double-cursed, alright,\" Wei Wuxian says uselessly.</span>\n</p>\n<p> </p>\n<p>\n<span>\"We'll keep him safe for you, Senior Wei,\" Pei Shouli assures him. Wei Wuxian grins at him. Then he and the other juniors file into the house, and Wei Wuxian is alone outside in the rising heat.</span>\n</p>\n<p> </p>\n<p>\n<span>He sighs to himself and goes to sit on the porch, looking out at the land surrounding the house. At some point this place had fair irrigation; now it's just swampy and overgrown, and buzzing with insects. He keeps having to slap mosquitoes before they can bite him. Fat dragonflies whirl and dip over the reeds, their dark wings iridescent in the sun, and bees bobble between the tall heads of wildflowers. There are birds in the woods by the river, orioles and shrikes and thrushes, all of them singing raucously. It's nice, he thinks, all this life. Even the mosquitoes. In the Burial Mounds all they ever saw were cockroaches, beetles, flies — decomposers. There are roaches here, too, but there are also flowers.</span>\n</p>\n<p> </p>\n<p>\n<span>After a while Lan Qubei comes back out with the notes from the desk; presumably Lan Wangji had delayed him to remind him to be nice, or something. \"Here you are, Senior Wei,\" he says, looking cowed.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Thank you, Qubei,\" Wei Wuxian says, taking the notes. Lan Qubei nods awkwardly. He looks like he thinks he's supposed to leave but doesn't want to, so Wei Wuxian pats the porch beside him. \"Lan Zhan gave you The Look, did he? He's not mad, he's just disappointed?\" Lan Qubei kind of huffs in confirmation and sits down next to him. Wei Wuxian gives him a section of the notes back so he can look like he's busy. \"Don't worry about it. He gives me The Look all the time and I'm alright.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I don't think he does,\" Lan Qubei replies, and then he looks at Wei Wuxian in panic and says, \"Um, I mean, thank you for your advice, Senior Wei.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian laughs. \"Again, don't worry about it. You can talk back to me a little, I don't care.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"It's improper,\" Lan Qubei argues.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yeah, well, who told you I cared about propriety, huh?\" Wei Wuxian counters.</span>\n</p>\n<p> </p>\n<p>\n<span>\"It's not you I'm worried about,\" Lan Qubei mutters.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Fair enough,\" Wei Wuxian says. \"Although, wow, what a sentiment. Anyway, you don't have to worry about Hanguang-Jun being mad at you. He knows it wasn't your fault that I knocked the mirror over, he's just protective of me.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"That's exactly the problem,\" Lan Qubei groans. \"First I was mean to you and now I got both of you cursed in the stupidest way possible. He must hate me!\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Kid, it takes a lot more than just being sort of rude to me and one clumsy mistake to make Lan Zhan hate someone,\" Wei Wuxian tells him drily. He thinks Lan Wangji maybe felt something approaching hatred for Jin Guangyao, and he certainly dislikes Jiang Cheng, but even then… That guy just doesn't have it in him, to really hate somebody.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Why doesn't he hate </span>\n<em>\n<span>you?\"</span>\n</em>\n<span> Lan Qubei blurts. Then he </span>\n<em>\n<span>really </span>\n</em>\n<span>looks horrified. \"S-sorry, Senior Wei, I really didn't —!\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"It's fine,\" Wei Wuxian says again, waving a hand at him. \"You're not the first person to wonder about that and you won't be the last. I have asked myself that very question, and the best answer I can come up with is that he's just too good to hate me so all his negative feelings circled back around into liking me.\" It's either that or he's just </span>\n<em>\n<span>that </span>\n</em>\n<span>handsome, but he's not about to say that to Lan Qubei.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Ha ha,\" Lan Qubei says, looking extremely unamused.</span>\n</p>\n<p> </p>\n<p>\n<span>\"You're no fun,\" Wei Wuxian tells him lightly. He looks back out at the wild grasses, watches them wave in the wind. \"Like I said, he doesn't hate anyone, so he doesn't hate me either.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Not hating someone is really different from liking them,\" Lan Qubei points out.</span>\n</p>\n<p> </p>\n<p>\n<span>\"If you're asking me why Lan Zhan likes me, I must admit, my face is way, way too thin to even begin to answer,\" Wei Wuxian warns him. Lan Qubei scowls at him. \"I'm serious! If I think about it for even a second I'll just turn red and maybe start crying, and neither of us wants that.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"You're the worst,\" Lan Qubei decides, and Wei Wuxian laughs. \"Let's just read the notes.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Right, right,\" Wei Wuxian says easily, looking down at the stack of pages in his lap. What a goofy code, huh! He's so used to his own elaborate code that reading this person's backwards script is barely any more difficult than reading normal writing. Helpfully, the notes seem divided into messy, disorganized project notes — little diagrams with things like </span>\n<em>\n<span>double check array? </span>\n</em>\n<span>and </span>\n<em>\n<span>don't know what this'll do haha! </span>\n</em>\n<span>scribbled all over the margins — and a slightly neater, more organized directory, sorted apparently by the size of the object in question. At the end of the directory is a third section concerning spells that aren't attached to any objects at all. Wei Wuxian is flipping towards the middle of the objects section, where he imagines the mirror might be, when the alligator from last night slithers out of the grass and onto the hard dirt path in front of them.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Good morning,\" Wei Wuxian says to it. It bobs its head in greeting. \"You don't have anything helpful to add, do you?\" He says this idly, but the alligator immediately bobs its head again and scampers around in a circle, looking extremely enthusiastic. \"Oh? You know something we don't?\" It stomps its feet eagerly. Wei Wuxian holds up the notes in his hand. \"Anything having to do with these?\"</span>\n</p>\n<p> </p>\n<p>\n<span>The alligator scampers in a circle again, then opens its mouth wide, as if to grin. \"Aiyoh, put those fangs away,\" Wei Wuxian demands with a shudder, and it snaps its mouth closed, looking almost sheepish. \"So you know about the notes, huh?\" It nods again. Wei Wuxian gets the sinking feeling that he knows exactly what's going on here.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Did you know the inventor who lived here?\" Lan Qubei asks, and the alligator nods once.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian sighs, then asks, \"Are </span>\n<em>\n<span>you </span>\n</em>\n<span>the inventor who lived here?\"</span>\n</p>\n<p> </p>\n<p>\n<span>The alligator nods again. Wei Wuxian groans. \"Qubei, go get Hanguang-Jun, would you?\" he requests. Lan Qubei obeys, and Wei Wuxian hops off the porch to go sit down in front of the alligator. \"So, you've turned yourself into an alligator and you can't get unstuck, huh,\" he says. The alligator nods morosely. \"Is it that you don't know how to change back, or that something is preventing you from changing back?\" The alligator shakes its head no, then nods its head yes. \"Something's preventing you?\" A nod. Wei Wuxian thinks about it. What could prevent an alligator-shaped person from performing a ritual?</span>\n</p>\n<p> </p>\n<p>\n<span>\"Is it… because you don't have thumbs anymore?\" Wei Wuxian asks slowly.</span>\n</p>\n<p> </p>\n<p>\n<span>The alligator nods.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian valiantly resists hiding his face in his hands. This is so, so, </span>\n<em>\n<span>so</span>\n</em>\n<span> stupid. In order to do something as complicated as truly transforming your body, you need to draw an array, and in order to draw an array, you need fine motor control. The claws of an alligator are excellent for swimming and running, but not so good for drawing fine details.</span>\n</p>\n<p> </p>\n<p>\n<span>Just then Lan Qubei and the rest of the juniors spill out of the house; presumably Lan Wangji is among them. Ah, he's just asked the alligator something; it's nodding in response. Lan Qubei thrusts the rest of the notes into Wei Wuxian's hands and says, \"Hanguang-Jun says we should find the array in the notes, and then help them perform the ritual. Then once they're a person again they can help reverse all the other curses!\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Good idea, Hanguang-Jun,\" Wei Wuxian says, taking the notes. To the alligator he asks, \"Is it in here, you think?\" A nod. So he needs to find notes regarding an array to turn a person into an alligator, and then from that he needs to reverse-engineer an array to turn an alligator back into a person. He says as much to the juniors, handing each of them ten or so pages from the third section so they can find the array faster. When he reaches the last junior, Lan Wangji catches his hand gently so he'll know where to thrust the remaining half of the pages.</span>\n</p>\n<p> </p>\n<p>\n<span>\"How difficult will it be to make the new array?\" Lan Ruoshi asks.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Well, it depends,\" Wei Wuxian says. \"It depends on how straightforward the original array is, basically. If it was really simple, then hopefully the only thing I'll have to do is swap the positions of things, maybe rotate some stuff according to the cardinal directions, flip that whole thing around, you know. But if it was more complex, I might have to draw a whole new array essentially from scratch.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Oh,\" Lan Ruoshi says. \"So… How long will that take, do you think?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian squints consideringly. \"Anywhere from half an hour to... two hours, tops?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"What??? No way!\" Lan Qubei exclaims. Lan Wangji must say something, because he immediately clarifies, \"Senior Wei says two hours, tops!\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Ah, people forget this, but I'm something of a genius, you know,\" Wei Wuxian says with a wink. When he says </span>\n<em>\n<span>a genius, </span>\n</em>\n<span>he hears Lan Wangji's beautiful voice alongside his own. Wei Wuxian turns to him and catches his gaze, and Lan Wangji smiles at him, just a little. Wei Wuxian gets a little lightheaded. He looks away in embarrassment and mutters, \"Why can't he say these things when I can hear them??\" Then he clears his throat and says to the juniors, \"Uh, anyway. If you find any array for transforming a body, shout.\"</span>\n</p>\n<p> </p>\n<p>\n<span>The ten of them sit there quietly shuffling through notes for a couple minutes, until the last shidi, Lan Hongzuo, throws his hand up and says, \"Oh, I think I've found it!\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Oh? Let me see!\" Wei Wuxian demands. Lan Hongzuo passes him the page in question. Indeed, it's messy and the whole thing is written and drawn backwards, but it's identifiably a transformation array. Wei Wuxian peers at it for a while. Something something dragons… blah blah yang energy blah… wood, fire, earth, et cetera… \"Okay, I think I know how to reverse this,\" Wei Wuxian decides. \"Someone get me something to write on.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Unbelievable,\" Lan Qubei says, but he digs in his bag for loose paper and sticks of compressed charcoal and hands them over.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Thanks,\" Wei Wuxian says absently, and he begins to write. \"Alright, so, Young Master Inventor, give me a sign if I'm wrong, but here's how I understand it: the original array had you using earth magic in order to transform into a dragon, that is, an alligator. You would have created the array out of scraps of wood then lit them on fire to produce ash, yes?\" The alligator nods eagerly. \"Right. So then you had the array drawn in ash, so, earth. Burning the wood generated a lot of yang energy, which is good, because you needed extra yang energy to match the energy of a dragon. You probably had an alligator tooth or claw or something to tell the array what precisely you wanted, and of course there's all the nitty-gritty details of what to write in the array, but that was the concept, right?\"</span>\n</p>\n<p> </p>\n<p>\n<span>The alligator nods and sweeps its tail back and forth in excitement. One of the kids whistles, impressed. </span>\n</p>\n<p> </p>\n<p>\n<span>\"Great, so, in order to reverse the transformation, we need to make the array out of wood again, because wood energy overcomes earth energy. We'll want to draw the array in dirt and then trace it in living plants. But then, those have even more yang energy than fire… We want to reduce your yang energy, not strengthen it…\" Wei Wuxian makes a show of thinking hard about it.</span>\n</p>\n<p> </p>\n<p>\n<span>\"What about plants that grow in water?\" Lan Faseng suggests. \"Since water has the strongest yin energy. And we're surrounded by a marsh already.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian snaps his fingers. \"Just so!\" he agrees. \"Add some human artifact and carefully guide the intentions of the array, and you should be back to normal, my draconian friend. Does that make sense to you?\"</span>\n</p>\n<p> </p>\n<p>\n<span>The alligator scampers around in a circle in what is quickly becoming its signature method of expressing enthusiasm. Wei Wuxian grins, then finishes transcribing what he just said and hands his piece of paper to Lan Wangji so he can be in on it too. Their fingers brush, and Lan Wangji takes his hand and holds it idly while he reads. Wei Wuxian stares at the air in the direction of his face until at last he turns and they make eye contact. Lan Wangji nods, his eyes narrowed in approval.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian clears his throat and turns back to the juniors to say, \"I have the strongest yin energy and the most experience with... unconventional arrays… so I'll do the actual physical creation of the array. But if the eight of you could work together to figure out what all needs to be written inside, that'll be good practice for you, right, Hanguang-Jun?\"</span>\n</p>\n<p> </p>\n<p>\n<span>But of course, Hanguang-Jun can't hear him. He wilts a little. The juniors say, \"Yes, Senior Wei!\" anyway, and then they get to work.</span>\n</p>\n<p> </p>\n<p>\n<span>While the kids are doing that, Wei Wuxian looks through the rest of the notes. He already recognizes a couple of the magical objects: an ink stone whose purpose is to allow the holder to convert their spiritual energy directly into ink seems like it's probably the source of Young Master Inky Armpits; an enchanted hairbrush meant to regrow hair in balding adults is surely to blame for the boy whose hair won't stop growing; a charmed whistle to give the user a beautiful singing voice took away that girl's speaking voice. Everything in here, Wei Wuxian realizes, is meant to be useful, or at least fun; it's just that they don't work perfectly yet, and without the inventor there to help reverse it, they ended up as curses.</span>\n</p>\n<p> </p>\n<p>\n<span>Boy, Wei Wuxian is sure glad that he didn't have any unfinished inventions lying around when another of his inventions took him out of commission! Haha, oh, wait. Wei Wuxian laughs to himself and then sighs tiredly. \"Young Master Inventor, you may not believe it, but it really could be much worse,\" he says to the alligator. The alligator hisses gently at him.</span>\n</p>\n<p> </p>\n<p>\n<span>After a while the sun starts to get to him; his headache worsens every time he looks at the blaring white of the Lan robes, and his own black cottons and linens are getting uncomfortably warm. So he retreats to the shade of the porch to keep reading. Lan Faseng looks up and notices him massaging his temples, and says, \"Oh — ! Senior Wei, didn't Congyi-shidi say you shouldn't strain your mind?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"No puzzle-solving,\" Lan Congyi agrees.</span>\n</p>\n<p> </p>\n<p>\n<span>Oh, right. Damn. \"I'm just reading,\" Wei Wuxian protests. \"I already solved the big puzzle.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Rest,\" Lan Congyi advises him. \"Go walk around or something. Or take a nap.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian grimaces and collates the notes back into a rough stack. \"Fiiine,\" he sighs, scooting forward to dangle his feet off the edge of the porch. \"I'll be here if anyone needs me, suffering, bored out of my mind. I'll probably count the spiders in the roof, or something.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Uh huh,\" Lan Congyi agrees cheerfully. Kids these days, no respect! \"Sounds good, Senior Wei.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian blows a raspberry and leans backwards until he's lying down, facing the underside of the porch roof. Yes, indeed, it is full of spiderwebs, both inhabited and abandoned. Annoyingly, he really does feel better like this, mostly out of the sun, not trying to peer at someone else's backwards writing. But how boring! He drums his fingers on his belt and watches the spiders move above him. He's never minded spiders; he doesn't like them, but he likes that no one else likes them either. They're not like dogs, which happily infiltrate every level of human society as if they aren't stinky, loud, annoying killing machines. No, spiders mind their own damn business and just catch flies all day like a reasonable animal.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian has his eyes closed and is thinking sleepily about spiderwebs when Lan Wangji sits down beside him. He knows it's Lan Wangji because both the approach and the sitting were silent, and because his presence is accompanied by the clean smell of sandalwood incense. Wei Wuxian moves his leg closer so that their thighs are touching. He imagines Lan Wangji leaning back to lie beside him; he never would, of course, because Lan Wangji would never do something so informal and sloppy, at least not while he's sober, but it's an extremely cute image. Instead Lan Wangji touches his leg, his fingers feather-light on the warm black cotton, and traces up Wei Wuxian's body until he finds Wei Wuxian's hands folded together over his chest. He gives the underside of Wei Wuxian's wrist two light taps with his pointer and index finger: </span>\n<em>\n<span>Sit up.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian sits up, already pouting. Congyi told him to nap; he's napping!! He was just getting comfortable!! He feels Lan Wangji shifting beside him — pulling his legs up onto the porch, maybe? \"Lan Zhan,\" Wei Wuxian complains uselessly.</span>\n</p>\n<p> </p>\n<p>\n<span>But then Lan Wangji taps both of his shoulders. He's sitting behind Wei Wuxian now? Wei Wuxian twists in place to face him; after a moment of aimlessly looking at the wall of the house, he catches Lan Wangji's gaze and he swims into view. \"What?\" Wei Wuxian asks him, holding his gaze. Lan Wangji flickers as he looks away instinctively, then remembers himself and looks back. He's sitting against the wall of the house, his legs crossed neatly. He pats his knees and then reaches up and gives Wei Wuxian's ponytail a gentle tug.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian blinks. Lan Wangji… wants him to nap with his head in his lap?</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian's eighteen-year-old self is howling.</span>\n</p>\n<p> </p>\n<p>\n<span>He smiles, slow and big, and says, \"Yeah, okay.\" Then he quickly pulls his hair from his ponytail for comfy reasons, and then he turns back around and lies back slowly. Lan Wangji guides him with gentle hands on his shoulder and the crown of his head, strokes his hair back from his temples once he's settled. Wei Wuxian can't stop smiling. He catches Lan Wangji's invisible hand and brings it to his mouth, kisses his knuckles, thinks </span>\n<em>\n<span>I love you </span>\n</em>\n<span>very loudly in Lan Wangji's direction.</span>\n</p>\n<p> </p>\n<p>\n<span>With Lan Wangji holding him, he falls asleep quickly.</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>*</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>He wakes again when Lan Wangji squeezes his hand, and then Lan Faseng is calling, \"Hanguang-Jun, Senior Wei, these disciples believe we have adequately designed the new array.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian blinks up at the roof of the porch, then sits up, rubbing his eyes. Lan Wangji leans briefly forward; Wei Wuxian feels him breathing warm and soft into his hair, the nape of his neck. Then he leans away again, and the two of them slide off the porch and go to check the juniors' work.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Faseng presents it to them both, and they stand side-by-side as they read, each holding one side of the scroll on which the final draft is drawn. Everything looks just about right to Wei Wuxian; he has small changes here and there, little things like using a different character for the same general concept or swapping where things are in the array. He says as much to the juniors, then grabs Lan Wangji's left hand and puts their pointer fingers together to indicate where he would make changes, trusting him to know which changes Wei Wuxian would make.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Hanguang-Jun says he agrees,\" Lan Faseng says helpfully.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Great!\" Wei Wuxian says. </span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<b>*</b>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>\"Okay, Young Master Inventor,\" Wei Wuxian says, slapping the worst of the mud off his hands. \"Go ahead and stand in the center, and then I'll close the array, and these gentlemen will initiate it.\"</span>\n</p>\n<p> </p>\n<p>\n<span>The alligator slithers into the array, careful not to obscure any of Wei Wuxian's careful work with the reeds. Wei Wuxian lays the last bundle of reeds down, closing the circle on the outside of the array, and steps back. The Lan juniors step forward and stand at the cardinal and intercardinal directions, and each puts his fingers to his forehead and draws out spiritual energy, then directs it into the array. The reeds dissolve into pure energy immediately, and the array glows pale blue on the ground, illuminating the alligator strangely. The juniors begin to walk around the circle to their right, symbolizing the undoing of the initial alligatorfication process, and the glow of the array intensifies, the brightness growing until the alligator in the center isn't visible at all. </span>\n</p>\n<p> </p>\n<p>\n<span>Then something in the air changes, and Wei Wuxian announces, \"Alright, that's enough,\" and the kids stop walking and lower their fingers. The glow recedes slowly, until at last a human form is revealed, a lump of bare skin and unruly dark hair, curled up in the center of the array. </span>\n</p>\n<p> </p>\n<p>\n<span>\"Ah, it worked!\" Lan Faseng exclaims. \"Young Master Inventor, you're human again! I'll break the array now, and then you can exit.\" The inventor gives a hand sign like </span>\n<em>\n<span>okay! </span>\n</em>\n<span>but stays curled on the ground. Lan Faseng drags an elegant boot through the fizzling reeds on the ground, and the last of the spiritual energy disperses. </span>\n</p>\n<p> </p>\n<p>\n<span>The inventor sits up clumsily, one limb at a time, and looks around and says, \"Thank you, esteemed cultivators!\", and all the Lan disciples gasp in shocked embarrassment and whirl away. Even Wei Wuxian blushes and turns away, immediately undoing his belt so he can shrug off his outer robe. He'd known, of course, that the inventor would return to human form without any clothing; he'd assumed it would be fine, even with all these repressed, easily-embarrassed Lans around, because they were all men.</span>\n</p>\n<p> </p>\n<p>\n<span>But he was wrong. The alligator-turned-inventor is a woman.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Er, pardon me, Young Lady Inventor,\" Wei Wuxian says, blindly offering her his robes. \"I, uh, assumed you were a man.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I know,\" she says cheerfully. She clears her throat violently, and there's the sound of someone who is not used to walking on two legs, walking on two legs. The robe is tugged from his outstretched hand. \"It's fine. It's not a distinction that matters to me anyway.\" The sound of cloth being wrapped around a body.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Oh,\" Wei Wuxian says. He scratches his nose thoughtfully. \"That makes sense, I suppose. Man or woman, doesn't matter if you're an alligator.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"No, no, it's not that I've been an alligator and so I don't care,\" the inventor says. \"I didn't care before that either. Anyway, I'm decent, I think. But, you know, it's been a while.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian chances it. They are decent, it turns out; they're smaller than him, so his skirt is more than long enough to cover their legs, although the top does hang open a little. He clears his throat. \"Welcome back to being person-shaped,\" he offers, then, bowing, \"Wei Ying, courtesy name Wuxian, at your service.\"</span>\n</p>\n<p> </p>\n<p>\n<span>The inventor grins and bows back. \"Liang Zhi, at yours. Are these your juniors?\" they add, bowing again to the kids, who have turned back around to face them politely.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Ah, no, they're my husband's,\" Wei Wuxian admits. \"He's the tall one, very handsome, a little grim? I can't see him right now, or I'd point him out to you specifically.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Sorry,\" Liang Zhi says. \"I gather that's my fault.\" They turn away from him and bow in what must be Lan Wangji's direction. \"Daozhang, you must be the husband?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian desperately, desperately wishes he could hear it when Lan Wangji says yes. Instead all he gets is the juniors looking at each other in poorly-concealed surprise — as if the two of them have been subtle at all. He grins widely. Lan Wangji's ears are probably turning red right now.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Inventor Liang,\" Lan Faseng says, \"This was your house, right? Do you still have clothes of your own inside?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yes, sir, Young Master,\" Liang Zhi says. \"Though I'm not sure how they'll have fared in my absence! Lots of bugs and mice around here, you know. I suppose I should check, Master Wei will be wanting his robe back.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Much obliged,\" Wei Wuxian agrees. and Liang Zhi strides past him, up the stairs, and into the house. They're a little wobbly on their feet, and they move their hands in time as they walk, like they're still sort of moving like an alligator. \"I'm sure I don't need to tell you this, but be careful not to touch anything that might curse you!\" he calls after them after a moment.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Whoops!\" they exclaim from the dark interior of the house. \"Oh, no, what's this I've just touched? It'll turn me into a cockroach? AND an eel at the same time? Aiyee!\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Alright, alright,\" Wei Wuxian says. \"I get it.\" Liang Zhi laughs at him. Wei Wuxian entertains himself by swapping goofy faces with Lan Qubei until they emerge again, clad in faded, mothbitten navy robes.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Alright, I'll undo everything,\" they announce, as they hand Wei Wuxian's robes back to him and start to wrestle their hair into something approaching a ponytail. \"Who first, huh? You two touched my mirror, right? I heard a big crash last night and I got scared and ran away.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yes,\" Wei Wuxian says eagerly. \"I knocked into it by accident. But when we came to it had disappeared.\" Hope that's not a problem, Inventor Liang!!</span>\n</p>\n<p> </p>\n<p>\n<span>\"It disappeared?\" Liang Zhi echoes with a frown. \"That's not good… Are you sure it didn't just disappear for </span>\n<em>\n<span>you?\"</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian blinks. It's true, he hadn't thought to check. If he and Lan Wangji can't see each other, maybe they can't see the mirror either.</span>\n</p>\n<p> </p>\n<p>\n<span>\"I saw a big mirror on the floor,\" Lan Faseng confirms.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yeah, it was behind the desk,\" agrees Lan Qubei.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Great,\" Wei Wuxian says, and he means it.</span>\n</p>\n<p> </p>\n<p>\n<span>Liang Zhi clears their throat. \"Here's the thing, honored daozhangs…\" they begin. Uh oh!! \"That curse is a one-time-only sort of deal. It's supposed to disorient thieves, not prank friends.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Alright…\" Wei Wuxian says slowly. \"So, if some Young Master Lan or other were to go fetch the mirror, he wouldn't have to be particularly careful?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Well, yes,\" Liang Zhi says. \"Because that's just a normal mirror, with a normal frame, now. Do what you like to it, your curse won't be reversed unless I go to the trouble of performing the whole spell again.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian sighs and pushes his palms into his eyes. He's been trying not to let this whole curse thing get to him, because at least they're both unhurt, and it really will be a simple fix. But he keeps thinking about waking up last night to Lan Wangji kissing his chest and writing </span>\n<em>\n<span>Miss you </span>\n</em>\n<span>in the dark. An invisible, silent Lan Wangji isn't </span>\n<em>\n<span>all</span>\n</em>\n<span> that different from a visible, audible Lan Wangji, but Wei Wuxian misses the weight of his gaze, the smooth tone of his voice, the way he says </span>\n<em>\n<span>Wei Ying. </span>\n</em>\n<span>And, he's realizing, an invisible, silent Wei Wuxian might not be the Lan Wangji Dream Scenario he always sort of assumed it would be.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Alright,\" he sighs. Just in case, he asks, \"Can we undo it with something else or do you have to enchant the mirror again?\" </span>\n</p>\n<p> </p>\n<p>\n<span>\"It doesn't have to be that mirror in particular, but, yes, we'll have to do the same spell on a similar object,\" Liang Zhi says. \"Sorry, daozhangs. But it shouldn't take very long! I can probably have it enchanted again by tonight, if I can drop everything else.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian catches Lan Wangji's eye. They shake their heads minutely at each other, and both say, \"No.\" Wei Wuxian allows Lan Wangji to tell them to fix the curses on the kids first.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Are you certain?\" Liang Zhi says after a moment, when Lan Wangji has finished speaking. \"You turned me back into a person, you have the right to go first.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"We're certain,\" the two of them say together. Their curse is frustrating, but they're adults, and they can stand to miss each other for the next day or two while the village kids are sorted out. The village kids, on the other hand, have been cursed for months — some of them almost a year — and they're children, and it's scary. So, sure, Wei Wuxian and Lan Wangji can wait.</span>\n</p>\n<p> </p>\n<p>\n<span>In the meantime, they send the juniors off to go collect the village kids; there's eight juniors and eight cursed kids, so it works out nicely. The three adults remain at Liang Zhi's house. They spent a short time locating the cursed objects responsible for the kids' afflictions; it doesn't take very long, because of course it's not like anyone got that far into the house before touching something they ought not to. Once a likely object is found, Lan Wangji uses spiritual energy to direct its movement onto the porch without anyone having to pick it up again. Soon the porch has a little flea market of trinkets: the hairbrush, the whistle, and the ink stone, as well as a carved wooden frog, a painting of a horse, two different weird homemade masks.</span>\n</p>\n<p>\n<span><br>\n</span>\n<span>\"You're a very strange person, Inventor Liang,\" Wei Wuxian tells them, peering at the masks.</span>\n</p>\n<p> </p>\n<p>\n<span>Liang Zhi laughs and says, \"Yes, indeed, Master Wei. That's why you like me.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yes, indeed!\" Wei Wuxian agrees.</span>\n</p>\n<p> </p>\n<p>\n<span>While they wait for the kids to get back, Wei Wuxian sits beside Lan Wangji on the porch and naps on his shoulder. At last the first pairs of junior+villager start to trickle back, and Liang Zhi directs each villager child through undoing each curse. Sometimes all it takes is touching the object again; sometimes Liang Zhi has to mess with the object itself for a while so that it will have the opposite effect from the original. In the end it takes the better part of the afternoon for them to get all the kids back to normal, but they do it, and there's only minimal weeping involved. Miss Frogs-for-hands is so grateful to have thumbs again that she cries and hugs Liang Zhi, and then she hugs all the juniors and Wei Wuxian and, yes, even Lan Wangji, to whom many strangers will not even smile. Wei Wuxian desperately wishes he could see Lan Wangji's expression, his body language, whether or not he hugged her back.</span>\n</p>\n<p> </p>\n<p>\n<span>The last village kid is uncursed just as the sky begins to purple with the setting of the sun. Liang Zhi stretches and slaps their hands together in satisfaction. \"That's everyone, yes?\" they ask.</span>\n</p>\n<p> </p>\n<p>\n<span>\"That's everyone,\" Wei Wuxian confirms. \"Except for Lan Zhan and me, tomorrow. Good work, everyone.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Good work yourself,\" Liang Zhi tells him, and then immediately follows it up with, \"Hey is anyone else hungry? I'm hungry! I haven't eaten people food in two years! Let's eat let's eat!\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian laughs. Lan Faseng looks in what must be Lan Wangji's direction for confirmation, then offers, \"We have rooms at the inn in town, would Inventor Liang like to join us for dinner?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"PLEASE,\" Liang Zhi says.</span>\n</p>\n<p> </p>\n<p>\n<span>So they make their way back to town. They walk this time, since it would be a little weird for any of the juniors to carry Inventor Liang on their swords and obviously Lan Wangji wasn't going to do it, so by the time they arrive in town the sky is a deep dark blue and the air is alive with twilight sounds, crickets and cicadas and frogs. The open door of the inn is a welcome splash of yellow, and the interior already smells of steaming rice and roasting vegetables, and Wei Wuxian remembers abruptly that he hasn't eaten since breakfast. He tugs on Lan Wangji's invisible sleeve in his enthusiasm as they enter.</span>\n</p>\n<p> </p>\n<p>\n<span>The eleven of them crowd around their table from last night. Wei Wuxian lets Lan Wangji order for the table, because he's feeling merciful, and while they wait he explains to Liang Zhi about the Lan clan rules. \"Brace yourself for a quiet meal,\" he warns them.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Oh, that's fine by me,\" they say cheerfully. \"I'll be too busy trying to remember how to use chopsticks to talk all that much, I think.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian laughs. When the food arrives, he's surprised and pleased to see that there's one bowl of heavily spiced chicken just for him. He pats Lan Wangji's thigh in appreciation and starts piling Unseasoned Steamed Bok Choy into his husband's bowl.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Liang Zhi?\" the inn worker gasps. She sets the last tray down carefully on the table and stares at Liang Zhi.</span>\n</p>\n<p> </p>\n<p>\n<span>Liang Zhi looks up from where they were carefully using both hands to arrange their fingers around their chopsticks. \"That's me! Hey, Ma Liu, it's been a while.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yes, it has! You're alive??\" Ma Liu says.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Of course I am!\" Liang Zhi says, hand to their chest in mock offense. \"Why wouldn't I be?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"You disappeared for years?\" Ma Liu suggests. </span>\n</p>\n<p> </p>\n<p>\n<span>\"Disappeared,\" Liang Zhi dismisses. \"Pah. I was right here! I came into town more than once! I was just an alligator.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Ma Liu stares at them. When they don't laugh, she says, \"I……………………. see………..\"</span>\n</p>\n<p> </p>\n<p>\n<span>Liang Zhi invites Ma Liu to sit and eat and talk with them, and after a while the innkeeper comes out to see where Ma Liu went off to and she joins them, too. After she finishes one bowl she goes to grab her husband and their daughter from the kitchen, and at some point the Lan boys give up on eating silently and join the conversation. Liang Zhi explains, mouth full and chopsticks waving, about how they were bored with the life of a rice farmer, and since they had some natural talent in cultivational things but had never joined a sect, they had decided to invent things in their spare time. They liked the puzzle of it, they say, and the satisfying business of having lots of projects to work on at once. Wei Wuxian agrees heartily. The only trouble, of course, came when they successfully turned themself into an alligator and then could not turn back.</span>\n</p>\n<p> </p>\n<p>\n<span>\"It could be worse,\" Wei Wuxian tells them again, wry.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Oh, sure, sure,\" Liang Zhi agrees. \"Being an alligator isn't so bad. I like to swim anyway, and it was fun to have a tail. It was really only that I wanted to keep working and couldn't, and that everybody was scared of me.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian nods. \"Yeah,\" he says. \"I get that.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Liang Zhi regards him thoughtfully. He wonders what they're thinking. He's never sure how much common people know about him; the war had touched their lives, of course, but even the worst of the Wens had little interest in harassing little rice villages on the road to nowhere. Even tyrants must eat. And anyway, Liang Zhi would have been a child when all that was happening; maybe they haven't heard of him at all.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji's hand appears warm and heavy on his shoulder, and then Wei Wuxian's wine jug disappears from in front of him. He pats Lan Wangji's hand and feels the air displaced as Lan Wangji stands up. \"Good husband,\" he tells the empty air.</span>\n</p>\n<p> </p>\n<p>\n<span>\"H-hey, Senior Wei,\" Pei Shouli says, when Lan Wangji has gone to get more wine. Wei Wuxian looks at him and realizes that at some point the innkeeper gave all the juniors bowls of wine, too. Uh oh!!!!!! \"Senior Wei, since when have you and Hanguang-Jun been married???\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yeah!\" Lan Ruoshi agrees.</span>\n</p>\n<p> </p>\n<p>\n<span>\"You'd think I would have heard about it,\" mutters the sixth shidi. Lan Shaoyong, Wei Wuxian thinks his name is. \"I'm his — um, our mothers were cousins on their mothers' side. Whatever that is. We should have been invited to the wedding!\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Oh, there was no wedding,\" Wei Wuxian tells him. \"And I think it was actually so long ago that you weren't born yet anyway.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"You think??\" repeats Lan Ruoshi. </span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian scratches his nose in embarrassment. He'd been hoping to have some clarifying conversation with Lan Wangji before anyone else asked him about this. \"Well, it's just that… I don't know exactly when we got married,\" he admits. \"I've been meaning to ask.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"You're nuts,\" Lan Qubei tells him. Wei Wuxian makes a face like, </span>\n<em>\n<span>Well, can't argue with that.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>A hand at the back of his head heralds Lan Wangji's return. A new wine jug appears in front of him, and Wei Wuxian takes it immediately and refills his bowl. \"Ask Hanguang-Jun when we got married, I'm curious what he'll say,\" he suggests to the juniors, who all of them shake their heads furiously and indignantly 'no.'</span>\n</p>\n<p> </p>\n<p>\n<span>Fortunately Liang Zhi is not particularly intimidated by Lan Wangji, perhaps because they were until very recently three times as massive as he is, so they take pity on Wei Wuxian and wonder aloud, \"Say, Hanguang-Jun, when did you and Master Wei here get married?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Again Wei Wuxian desperately wishes the curse were lifted already. He wants to see Lan Wangji's sweet expressionless face, wants more than anything to hear his answer. Instead all he gets is Lan Qubei doing a spit-take of wine all over the table before exclaiming, \"Hanguang-Jun doesn't know either?!?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian bursts into laughter. \"Lan Zhan ah Lan Zhan, how did we get here?\" he demands, reaching out blindly until his hand touches Lan Wangji's sleeve. \"My husband, you don't know either? I'm only following your lead.\"</span>\n</p>\n<p> </p>\n<p>\n<span>As if he knows what Wei Wuxian is saying, Lan Wangji taps on his wrist pointedly: </span>\n<em>\n<span>You started it, not me. </span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>\"We'll get back to you,\" Wei Wuxian decides. \"For the record my money is on Lan Yi's ice cavern.\"</span>\n</p>\n<p> </p>\n<p>\n<span>The kids all look scandalized at that. An outsider got to enter Lan Yi's ice cavern? And maybe got married there???</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji must say something then, because all the kids look up in embarrassment and say, \"Yes, Hanguang-Jun!\" and scramble to stand up.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Curfew already?\" Wei Wuxian asks, dismayed.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yes,\" Lan Faseng says. \"Um… Hanguang-Jun, these disciples have drunk wine, what should be our punishment?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"No punishment, no punishment,\" Wei Wuxian says quickly, grabbing Lan Wangji's hand to forestall his answer. \"It was offered to you by the master of the inn, you were merely being courteous!\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yes, Hanguang-Jun,\" the kids say morosely. Lan Congyi adds, \"Thanks for trying, Senior Wei.\" Then the eight of them bid goodnight to their seniors and file upstairs. </span>\n</p>\n<p> </p>\n<p>\n<span>\"Lan Zhan ah,\" Wei Wuxian complains, tugging on his hand. \"How cruel!\" He runs his hand up Lan Wangji's arm, follows the line of his throat to cup his cheek. \"Look at me, won't you? Look at me while I'm scolding you.\" Lan Wangji blinks into visibility as they make eye contact. Ah, with Lan Wangji's attention on him, Wei Wuxian can barely even pretend to be mad anymore. Still, he twists his mouth down into an exaggerated scowl. \"No mercy for the juniors, huh?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji just looks at him, his gaze softening impossibly further. Without breaking eye contact, he turns his face into Wei Wuxian's hand and presses a chaste kiss to his palm.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian's face heats up spectacularly. This person, he — !!!</span>\n</p>\n<p> </p>\n<p>\n<span>\"N-no mercy for your husband, either, I see!!\" he stutters. Liang Zhi and the inn workers laugh at him.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji says something into his hand, then drops his gaze. In the safety of his invisibility, Wei Wuxian slumps sideways and covers his face with his free hand, half-wailing, \"He's too cute!!\" Liang Zhi laughs at him again. Lan Wangji laces their fingers together and removes Wei Wuxian's hand from his face, standing. Wei Wuxian stands with him. \"Oh, Inventor Liang, you're welcome to stay in one of our rooms upstairs,\" he says on a whim. \"We have an extra, second from the end.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Liang Zhi looks up in surprise. \"That would be great,\" they say. \"I haven't slept inside in two years! This humble alligator is very grateful.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"It's nothing, it's nothing, we're paying for it anyway,\" Wei Wuxian says. \"Goodnight to you and goodnight to our gracious hosts!\" He drops Lan Wangji's hand to salute the table at large. As he rises he feels the air move next to him as Lan Wangji echoes his movement, and then Liang Zhi and the Ma family bid them both goodnight.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji puts his hand on Wei Wuxian's back as they go upstairs. Wei Wuxian's face heats again. Whether the gesture is possessive or merely supportive, Wei Wuxian likes it. He wants more of it. He wants Lan Wangji to take care of him, to protect him, to feel a little jealous over him. </span>\n</p>\n<p> </p>\n<p>\n<span>When Lan Wangji has shut the door behind them, Wei Wuxian reaches out to gauge where he is, then steps close and wraps his arms around Lan Wangji's chest. Lan Wangji responds at once, sliding his hands warm and flat up Wei Wuxian's back to hold him close, and they just breathe into each other's collars for a long moment. It's strange to feel Lan Wangji's breath without hearing it, stranger still to open his eyes and see nothing but the far wall. </span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian is tired of this curse.</span>\n</p>\n<p> </p>\n<p>\n<span>He pulls away just far enough to meet Lan Wangji's gaze. \"Soon,\" Wei Wuxian promises. \"We'll be back to normal soon.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji says something in response. Maybe </span>\n<em>\n<span>Soon </span>\n</em>\n<span>too. Maybe </span>\n<em>\n<span>I know. </span>\n</em>\n<span>Maybe </span>\n<em>\n<span>Husband.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian watches him, stroking his hair idly. Ordinarily prolonged eye contact gets weird pretty quickly, but given the circumstances Wei Wuxian is happy just to look. To catalogue in his memory the elegant shape of Lan Wangji's eyes, his short straight eyelashes, the way the candlelight pulls out the honey tones around his pupils. \"So handsome,\" Wei Wuxian tells him, \"Lan Zhan is so handsome…\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji flickers before him as he blinks. For the first time Wei Wuxian wonders if Lan Wangji thinks </span>\n<em>\n<span>he's </span>\n</em>\n<span>handsome. He knows — has always known — that he's good-looking. That's part of why he was the fourth most eligible young master for so long. But does Lan Wangji think so? He's seen Wei Wuxian at his absolute worst: injured, half-starved, out of his mind with resentful energy. Not super sexy!</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>And he loved you then, </span>\n</em>\n<span>his heart reminds him. </span>\n<em>\n<span>He loves you still.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian leans forward slowly, holding Lan Wangji's gaze. He wants to look at him for as long as possible before the sweet slow crush of their mouths makes him forget himself and close his eyes. </span>\n</p>\n<p> </p>\n<p>\n<span>They stand there for a long moment in the center of the room, swaying slightly, their eyes half-lidded to watch each other, just barely kissing. Less kissing and more simply leaning into each other with every shared breath, slack mouths brushing together again and again without ever sealing together in a kiss. Wei Wuxian feels dizzy with desire, thrilled by Lan Wangji's dark eyes, the way air cycles between them. He imagines the movement of air: into Lan Wangji's mouth, into his lungs, then out again to be pulled immediately into Wei Wuxian's body. \"Lan Zhan,\" he breathes.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji kisses him for real. Wei Wuxian's eyes flutter shut, predictably, as he kisses back, mouth already open and wet. Lan Wangji moves his hands up to Wei Wuxian's hair, kissing him insistently as he dismantles his ponytail. Wei Wuxian lets him do it, lets Lan Wangji free his hair and push his hands into his hair to hold Wei Wuxian's head firmly, turning it this way and that to kiss him thoroughly in whatever angle he wants. Wei Wuxian thinks, </span>\n<em>\n<span>He's thought about this. </span>\n</em>\n<span>Thinks, </span>\n<em>\n<span>Fuck.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji tilts Wei Wuxian's face back so that he can lean forward to suck wet and warm at a spot just under the edge of Wei Wuxian's jaw, and Wei Wuxian's knees just about give out. \"Lan Zhan ah, have mercy!\" he begs, clutching Lan Wangji's shoulders, \"You can't expect me to take that standing up!\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji stops and straightens, and Wei Wuxian opens his eyes to see him again, his eyes huge and dark. He says something, his eyebrows creased in concern. Wei Wuxian frowns back at him. \"Well, don't </span>\n<em>\n<span>stop,\"</span>\n</em>\n<span> he says, reaching up to grab Lan Wangji's head and guide his mouth back down to his own throat. Then he grabs Lan Wangji's now-invisible arms and pulls them down to wrap around his waist, so that he doesn't need to support his own weight. \"There,\" he says into Lan Wangji's hair, \"That's better.\"</span>\n</p>\n<p> </p>\n<p>\n<span>He feels Lan Wangji smiling into his neck, and then he's being lifted and carried to the bed. As soon as he's been deposited on the edge of it he scrambles to disrobe, and then once he's down to his underrobes he grabs at the air in front of him, only to find on making accidental eye contact that Lan Wangji has also peeled himself out of his many layers. He's somehow both smaller and larger in just the thin fabric of his underrobes; his shoulders are narrower but his muscles are more defined, revealed to Wei Wuxian's hands after being hidden under layers and layers of silk all day. Wei Wuxian feels him up shamelessly.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji says something again, then surges forward to push Wei Wuxian bodily back onto the bed, crawling up onto his lap even as Wei Wuxian scoots agreeably backwards. Wei Wuxian shuts his eyes so as not to be disoriented again by his invisibility, instead keeping track of Lan Wangji on top of him by the feel of it. A hand trails light and hot up Wei Wuxian's chest to the crook of his neck, followed shortly by Lan Wangji's mouth back on his throat, open and wet, threatening teeth. Wei Wuxian shudders and tosses his head to the side, exposing as much of his throat to Lan Wangji's mouth as possible. Lan Wangji's weight on top of him is perfect; when Wei Wuxian hitches a leg up to wrap around his waist, Lan Wangji hums into his skin and pushes his own knee up under the raised leg to keep it in place. Wei Wuxian laughs and drags his fingers hard down Lan Wangji's hunched shoulder blades. \"Good boy,\" he says into Lan Wangji's hair, \"good good boy — ah!! Lan Wangji ah!! You just bit me, you beast!!\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji applies several little kitten licks to the skin he just bit in apology.</span>\n</p>\n<p> </p>\n<p>\n<span>\"...I suppose I could be convinced to let you do that again,\" Wei Wuxian decides, and guides Lan Wangji's head closer.</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>*</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>In the end they make out for hours until they're both more liquid than solid, draped all over each other, trading increasingly slow kisses until Wei Wuxian realizes that Lan Wangji is once again half-asleep on top of him. At that point he laughs and pushes Lan Wangji off, and Lan Wangji lets him maneuver him blindly around like a ragdoll until he's more or less in the Lan sect sleeping position. Then Wei Wuxian carefully unties his forehead ribbon for him, kisses him soundly one last time, and snuggles into his side. \"See you tomorrow, Lan Zhan,\" he whispers.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji reaches up and pets his hair clumsily. </span>\n<em>\n<span>See you tomorrow.</span>\n</em>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>*</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>When Wei Wuxian wakes it's still dark outside, hours before even Lan Wangji should wake up. Indeed, he can feel Lan Wangji breathing warm and even beside him; no waking up to weep gently into Wei Wuxian's chest tonight, it seems. It's rare that Wei Wuxian wakes up in the middle of the night, and rarer still that such an event isn't accompanied by a nightmare; why the hell isn't he still asleep? He grimaces and turns over so that his back is pressed against Lan Wangji's side.</span>\n</p>\n<p> </p>\n<p>\n<span>A golden Jin messenger butterfly opens and closes its wings slowly on the bed in front of him.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Fuck,\" Wei Wuxian mutters, and he sits up. \"Alright, you stupid insect, what's up.\" He offers his finger to the butterfly, which obligingly creeps closer and then unfolds into a shimmering note that reads, </span>\n<em>\n<span>Fuck you for not sending word that you're in Yunmeng, </span>\n</em>\n<span>and then below that, </span>\n<em>\n<span>I'm downstairs, </span>\n</em>\n<span>in Jiang Cheng's neat, bold handwriting. </span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian slips out of bed, wraps his outer robe around himself, then sneaks downstairs.</span>\n</p>\n<p> </p>\n<p>\n<span>Jiang Cheng is sitting at a table in the dark, his arms crossed defensively, Sandu on the table in front of him. Wei Wuxian takes a lamp from the wall and carries it over to the hearth, where he lights it with one of the smoldering coals, then sits down across from Jiang Cheng. \"I'd just like to point out that we're not even in Yunmeng,\" he says.</span>\n</p>\n<p> </p>\n<p>\n<span>\"It's close enough,\" Jiang Cheng argues. \"It's basically Yunmeng.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian scoffs and catches himself about to grin. \"Alright, whatever, we can pretend Ye Mi is in Yunmeng. Why are you here in the middle of the night, Sect Leader?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I received a message from Sect Leader Lan that you were here,\" Jiang Cheng says. \"You rude, ungrateful person, you thought you could just go on a nighthunt in my region and not tell me?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian rolls his eyes. \"Am I required to tell each Sect Leader where I am, wherever I am? What difference does it make to you where I am, as long as I'm not defiling the Jiang family ancestral hall?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Jiang Cheng flinches. \"Sect Leader Lan sent me a message that you and your Hanguang-Jun had gotten yourselves cursed,\" he says, careful and nasty. \"Although Ye Mi village is not in Yunmeng, it's closer to Lotus Pier than it is to the Cloud Recesses, so he suggested that I make sure everything was fine. I see we were both fools for worrying.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian deflates. \"Jiang Cheng ah,\" he sighs. \"You know you're allowed to just tell me you care, right?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I don't,\" Jiang Cheng says shortly. Doesn't care? Or doesn't know he's allowed to say it?</span>\n</p>\n<p> </p>\n<p>\n<span>\"I'm fine,\" Wei Wuxian tells him. \"We did get cursed, but it's not dangerous. Just a pain in the ass. And we're fixing it, we'll be back to normal tomorrow.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Jiang Cheng snorts derisively, but he looks more or less mollified. \"What the hell did you even do to yourselves?\" he asks. \"Lan Xichen didn't say. He just said Hanguang-Jun was 'uncharacteristically expressive' in hating it.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian leans forward slowly until he can lay his head gently on the table. Lan Zhan ah……………………..</span>\n</p>\n<p> </p>\n<p>\n<span>\"Wei Wuxian?!\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Give me a moment,\" Wei Wuxian begs. \"Uuughgghhhhh.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"What the hell is wrong with you now?\" Jiang Cheng demands.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian turns his head so his cheek is flat against the table. \"You know when we were like sixteen and I was obsessed with him and then we were like eighteen and he was obsessed with me and then four years later I died.\"</span>\n</p>\n<p> </p>\n<p>\n<span>There's a heavy pause, and then Jiang Cheng says cautiously, \"Yes…\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Well, we didn't stop being obsessed with each other,\" Wei Wuxian tells him.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Obviously,\" Jiang Cheng scoffs. \"Is that supposed to be news to me? It's not.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Hm!\" Wei Wuxian says. He sits up again. \"We got cursed so he and I can't see or hear each other. I sort of assumed that he'd find it gratifying, but I guess not.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"You are so fucking stupid,\" Jiang Cheng informs him, which, fair. Then he squints and leans forward. \"Is that the curse mark on your neck?? Wei Wuxian!\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"On my neck??\" Wei Wuxian echoes. He reaches up in confusion to feel his skin. \"I don't think so? What's it look like? I probably still have a scar from when Jin Guangyao had the guqin string around my neck, is it that?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Jiang Cheng leans further forward, uncrossing his arms in his concern. \"No, it's no scar, it's big dark bruises. Turn your head… It goes almost up to your ears!\" He pokes Wei Wuxian in the neck.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Ay ay ay ay ay!\" Wei Wuxian squawks, jerking away. \"Don't just poke at it, you horrible man!\" Jiang Cheng rolls his eyes. \"Bruises almost up to my ears, huh…\" None of the village kids had had curse marks… But then again, the mirror really was meant to be defensive, unlike the other things… But the Lan juniors surely would have said something if they noticed he was bruised, right? He rubs at his throat thoughtfully.</span>\n</p>\n<p> </p>\n<p>\n<span>Then he freezes.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Oh, I know what that is,\" he mumbles. \"It's not a curse mark, Jiang Cheng.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Oh? You get strangled lately?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian coughs. \"No,\" he says. No, Jiang Cheng and Wen Ruohan remain the only two people to have actually given in to the no doubt overwhelming urge to strangle him. \"No, it's, uh… hm….\" He coughs again. \"Well, sometimes when one person likes kissing another person very much…\"</span>\n</p>\n<p> </p>\n<p>\n<span>Jiang Cheng narrows his eyes, then a second later they're comically wide. \"NO,\" he says, \"NO, NO, ABSOLUTELY NOT. NO FUCKING WAY.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian cackles into his hands. \"You asked!! You asked!!\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"When you said you were still obsessed with each other, I didn't think —!!\" Jiang Cheng starts, and then he flaps a hand pathetically at Wei Wuxian's love-bite-covered throat.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Didn't you???\" Wei Wuxian asks, genuinely curious.</span>\n</p>\n<p> </p>\n<p>\n<span>Jiang Cheng looks away, flustered. \"Well — I mean I knew that you two — that he —\" He waves his hand at Wei Wuxian again, and then finally he manages, \"Look, Wei Wuxian, I know you weirdos have been in love with each other forever, but I absolutely cannot think of Lan Wangji as someone who feels sexual desire. I refuse. Actually, the same goes for you. Neither of you is ever allowed to fuck.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Oh, he definitely fucks,\" Wei Wuxian tells him gleefully.</span>\n</p>\n<p> </p>\n<p>\n<span>\"I'm going to kill you,\" Jiang Cheng decides.</span>\n</p>\n<p> </p>\n<p>\n<span>\"You could never,\" Wei Wuxian says lightly.</span>\n</p>\n<p> </p>\n<p>\n<span>There's a beat, then, the two of them just looking at each other in the dim lamplight, surprised at themselves. And then Jiang Cheng says, \"Yeah, I couldn't.\" He scrubs his hands over his face. \"Heavens help me, I never could kill you, Wei Wuxian.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian sits back on his heels. Breathes in deep just to sigh it all out again. \"Well,\" he says. \"Well.\" He looks at his hands. \"I don't really know what to say to that,\" he admits. Not </span>\n<em>\n<span>Thank you, </span>\n</em>\n<span>not </span>\n<em>\n<span>Sorry. </span>\n</em>\n<span>Not </span>\n<em>\n<span>I couldn't ever leave you to die either.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>\"Yeah,\" Jiang Cheng says. \"You don't have to.\"</span>\n</p>\n<p> </p>\n<p>\n<span>They sit there in silence. The lamp flickers between them.</span>\n</p>\n<p> </p>\n<p>\n<span>After a while Wei Wuxian says, \"... Wait, you knew Lan Zhan was in love with me??\" and Jiang Cheng groans loudly.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Wei Wuxian, anyone who spent any time with either of you knew you were in love with each other,\" he complains. \"It's not like you were particularly subtle.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Well, sure, but you aren't particularly observant, either.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Jiang Cheng lunges across the table to whack him on the head. \"Ay ay ay!!\" Wei Wuxian cries, cowering. Jiang Cheng whacks him successfully and sits back down. Wei Wuxian bounces back up and insists, \"Tell me, tell me, when did you suspect? When did you </span>\n<em>\n<span>know?\"</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>\"What, do you just want a play-by-play of your relationship from my point of view??\" Jiang Cheng demands.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yes, that's exactly what I want,\" Wei Wuxian says. Jiang Cheng swears under his breath. Wei Wuxian takes pity on him and says, \"You can start small and just tell me when your worst fears were confirmed.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Or I could whip you with Zidian, you know, for old times' sake,\" Jiang Cheng offers, clenching his fist threateningly.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Ha ha ha,\" Wei Wuxian says. \"That's why you don't have a girlfriend, you know. You've got a terrible temper.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Right, because you're the pinnacle of even temperament,\" Jiang Cheng says. \"Sorry, which one of us —\"</span>\n</p>\n<p> </p>\n<p>\n<span>He stops talking abruptly. Wei Wuxian imagines there are a number of ways he could have ended that sentence, and neither of them would have liked any of them. It would be easy to call him on it, to provoke him.</span>\n</p>\n<p> </p>\n<p>\n<span>But Wei Wuxian has been trying to be kind.</span>\n</p>\n<p> </p>\n<p>\n<span>He covers his face with his hands and heaves a sigh. \"Jiang Cheng ah,\" he says. \"You know something awful? I love him. I really, really love him.\" Jiang Cheng makes a comically disgusted sound. \"I do,\" Wei Wuxian insists, and then, \"Oh, I think we're married.\"</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>\"What?\"</span>\n</em>\n<span> Jiang Cheng says. Then, \"You </span>\n<em>\n<span>think </span>\n</em>\n<span>you're married?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I mean, I guess I know we're married. He said he was a widower, and so I called him my husband, and he called me </span>\n<em>\n<span>his </span>\n</em>\n<span>husband, so…\" Wei Wuxian waves a hand, like, </span>\n<em>\n<span>What can ya do?</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>\"I hate you, I really do,\" Jiang Cheng sighs. \"Can you two not do </span>\n<em>\n<span>anything </span>\n</em>\n<span>normally??\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Of course we can't,\" Wei Wuxian says, and then Jiang Cheng jumps in surprise. Wei Wuxian looks around; surely that can't have been a reaction to him, right?? </span>\n</p>\n<p> </p>\n<p>\n<span>\"Hanguang-Jun,\" Jiang Cheng says stiffly. Ah, Lan Zhan is awake? But it's not five yet…</span>\n</p>\n<p> </p>\n<p>\n<span>\"Jiang Cheng, tell him where I am,\" Wei Wuxian requests. \"We can't see each other, you remember.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Jiang Cheng gestures at him and says to thin air, \"He's there.\" A moment later Lan Wangji touches Wei Wuxian's shoulder, tentative and searching at first and then firmer as he figures out where Wei Wuxian is. Wei Wuxian reaches up to pat his hand. Lan Wangji entwines their fingers and sits beside him, close enough that their arms touch. \"I haven't said </span>\n<em>\n<span>shit</span>\n</em>\n<span> to him,\" Jiang Cheng says, offended by whatever Lan Wangji just said.</span>\n</p>\n<p> </p>\n<p>\n<span>That isn't quite true, but Wei Wuxian pats Lan Wangji soothingly anyway. He reaches out until he finds Lan Wangji's face, and after a moment he blinks into view. \"There you are,\" Wei Wuxian says. \"Lan Zhan, you brute, look what you've done to me!\" He gestures at his bruised neck. Lan Wangji disappears; reappears; holds Wei Wuxian's gaze as he strokes long fingers against the tender skin of Wei Wuxian's throat, his eyebrows knitted together subtly. Oh, his touch is so different from Jiang Cheng's inelegant poking, from Wei Wuxian's own curious investigation. Wei Wuxian closes his eyes. His mouth has gone dry.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Would you </span>\n<em>\n<span>please,\" </span>\n</em>\n<span>Jiang Cheng says.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Sorry,\" Wei Wuxian says, not sorry at all. He opens his eyes as Lan Wangji pulls his fingers away. \"Jiang Cheng, did you come here alone? Are you expecting to buy a room? Because you won't be able to do that, not at this hour in a town this small.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Jiang Cheng huffs. He clearly had not planned ahead that far. \"I'll meditate down here then,\" he says gruffly.</span>\n</p>\n<p> </p>\n<p>\n<span>\"You could —\" Wei Wuxian begins to offer, but Jiang Cheng shudders and waves him away.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Don't finish that sentence,\" he demands. \"If you think I would willingly sleep in a room with you and your guard dog, you're more insane than I thought.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"My what??\" Wei Wuxian asks, looking around in instinctive fear. Then he realizes what Jiang Cheng means and says seriously, \"Hey, absolutely not. You can say what you like to me, but you don't get to call Lan Zhan a dog.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Whatever,\" Jiang Cheng says. \"Get out of here and let me rest.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"The innkeeper will be mad when she wakes up and realizes that you didn't pay for a room,\" Wei Wuxian points out.</span>\n</p>\n<p> </p>\n<p>\n<span>\"So I'll pay for a room in the morning!\" Jiang Cheng snaps. \"Go away! I'm sick of your face!\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian feels Lan Wangji shift sharp and angry beside him, and he quickly throws his arm out to prevent Lan Wangji from trying to punch Jiang Cheng. \"It's fine,\" he says uselessly, \"He's just embarrassed,\" and Jiang Cheng snorts indignantly, but Lan Wangji backs off under Wei Wuxian's calming hand. To Jiang Cheng he says, \"Would it kill you to stop saying things you </span>\n<em>\n<span>know </span>\n</em>\n<span>will rile him up?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yes,\" Jiang Cheng says flatly.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian sighs and stands up, giving Lan Wangji's hand a tug so he knows to stand too. \"Well, goodnight, Sect Leader Jiang. We'll be down in like two hours anyway.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Jiang Cheng scoffs. \"Ha ha.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I'm not joking,\" Wei Wuxian says as he makes his way back to the staircase. \"They're Lans, remember? Lan Zhan will be dragging me downstairs with the rest of them.\" Or maybe he can convince Lan Wangji to carry him… \"Get ready to wake up bright and early!\"</span>\n</p>\n<p> </p>\n<p>\n<span>Jiang Cheng's groan follows them up the stairs.</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>*</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>\"You're insane.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Am not.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"You're out of your fucking gourd.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I'm firmly in my gourd, thank you. Don't talk so loud, it's too early. My gourd hurts.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Haven't you been awake for an hour and a half? Which is, by the way, just one of my many reasons to think you're crazy.\"</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>\"Allegedly </span>\n</em>\n<span>awake.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Moronic,\" Jiang Cheng mutters. \"I don't know why Hanguang-Jun is bothering to break this curse at all. He should be savoring the peace and quiet.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yeah, well,\" Wei Wuxian starts, but then the juniors stifle a chorus of gasps and Jiang Cheng makes a shocked sound through his teeth, as if Lan Wangji just said something particularly cutting. \"What'd he say!\" Wei Wuxian demands. </span>\n</p>\n<p> </p>\n<p>\n<span>\"I'm not telling you!\" Jiang Cheng says. Wei Wuxian elbows him and receives an elbow in return, sending him stumbling a step into Lan Wangji's invisible form. Lan Wangji steadies him, and Wei Wuxian pats his arm in thanks and also to tell him not to go after Jiang Cheng, since Wei Wuxian did in fact start it this time.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Why are you even coming with us anyway?\" Wei Wuxian asks. \"You're gonna tag along with us to Inventor Liang's house just to bully me the whole way?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Jiang Cheng sniffs. \"No,\" he lies.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Sect Leader Jiang probably plans to continue bullying you once we get there,\" Liang Zhi says cheerfully.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Exactly,\" Jiang Cheng says.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Unbelievable,\" Wei Wuxian mutters, thrilled to have a little brother again. \"I'm older than you! I should be the one giving you shit! And yet here we are.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Liang Zhi scratches their nose thoughtfully. \"</span>\n<em>\n<span>Are</span>\n</em>\n<span> you still older?\" they wonder. \"You were dead for a while, weren't you? Do you still get to claim to have aged?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji presses closer to him for a couple steps. \"Hmm,\" Wei Wuxian says. \"My body didn't age, and it's not like I was awake as a ghost for those years… But I </span>\n<em>\n<span>definitely </span>\n</em>\n<span>still have shixiong rights over this little upstart,\" he concludes, tapping his nose. \"It's all about the frame of mind.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Whatever,\" Jiang Cheng scoffs.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Didn't Senior Wei get kicked out of the Jiang Sect?\" Lan Qubei asks, and then he slaps his hands over his mouth. \"Um. I mean. It's just that, how can you be his shixiong if, um…\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian scratches his nose. \"Well, fine, then I get gege rights,\" he decides, and Jiang Cheng swats him upside the head.</span>\n</p>\n<p> </p>\n<p>\n<span>All at once the juniors straighten their posture and say, \"Yes, Hanguang-Jun,\" all eight of them looking properly chastened. Even Liang Zhi schools their face into some sort of respectful grimace. </span>\n</p>\n<p> </p>\n<p>\n<span>\"You don't get to order me around, Lan Wangji,\" Jiang Cheng snaps. From Wei Wuxian's point of view he's met only by silence, but he can imagine that Lan Wangji probably responds with something about being Chief Cultivator and how Jiang Cheng really </span>\n<em>\n<span>does </span>\n</em>\n<span>have to do what he says.</span>\n</p>\n<p> </p>\n<p>\n<span>\"So this is fun,\" Wei Wuxian says after a while. The only response he receives is a snort from Lan Qubei.</span>\n</p>\n<p> </p>\n<p>\n<span>From then until they get to Liang Zhi's house there is an extremely uncomfortable silence, filled only by the scuffing of ten pairs of boots and one set of bare feet along the beaten dirt road. At last they come to Liang Zhi's old house, which Jiang Cheng stares at with no small amount of confused distaste until Liang Zhi says grandly, \"Welcome back to my humble abode,\" and he quickly flattens his expression.</span>\n</p>\n<p> </p>\n<p>\n<span>Liang Zhi continues, \"I'll fetch the mirror frame from the house, if Sect Leader Jiang would accompany me and carry the mirror itself. Master Wei, you can look through my notes for the relevant spell and see what needs to be done, and direct Hanguang-Jun and his young masters around to fetch things.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yes, sir!\" Wei Wuxian says brightly. Liang Zhi grins at him, and they and Jiang Cheng disappear into the house. Wei Wuxian fetches their notes from Lan Faseng and starts flipping through them again, searching for the cursed mirror. He finds it fairly quickly; blah blah wood for eyes blah blah water for ears, which conveniently of course they already gathered and thought about for the de-alligatorfication spell from yesterday. He instructs the juniors to go get some more, and then tugs Lan Wangji down to sit on the porch next to him as he thinks through the reversal of the spell. </span>\n</p>\n<p> </p>\n<p>\n<span>\"Alright, so, it'll be a series of talismans set around the mirror frame,\" he says, even though Lan Wangji can't hear him. It's still nice to talk it through out loud. \"Because the curse is meant to protect Liang Zhi and their inventions, they'll have to be the one to reapply it to the mirror. I don't think it will be as easy as just touching the mirror again, but I also don't think we'll need to alter the initial spell. My prediction is that we'll have to interact with it in some special way…\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Your theory is correct, Master Wei,\" Liang Zhi tells him as they emerge once more from the house. Their arms are full of the pieces of the wooden frame; behind them Jiang Cheng is lugging the warped metal disk of the mirror itself. Liang Zhi drops the pieces of frame off the edge of the porch and plops down next to Wei Wuxian, dangling their feet over the side into the frothing wild grasses. \"Yes, indeed, the secret behind this thing is that it isn't the mirror per se that's cursed, it's the frame. The curse was activated when the frame fell over you. So we'll make a new frame and curse it and then instead of the frame dropping down over you, we'll drop you into it.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian makes a thinky face. Jiang Cheng says, \"What the hell does that mean?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Liang Zhi's attention turns past Wei Wuxian to where Lan Wangji is sitting neatly next to him as he gives some smart and perfect answer. Then Liang Zhi says, \"Precisely right, Hanguang-Jun!\" Wei Wuxian pats his invisible thigh. \"Master Wei, Hanguang-Jun's guess was that the two of you will step into the frame and use spiritual energy to raise it up over your heads.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I see, I see,\" Wei Wuxian says. \"I like it. Less head-smashing this time around.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Significantly less,\" Liang Zhi agrees. \"Alright, step one is to make a frame. We aren't really going to attach it to the mirror, so it can just be some sticks we've tied together. You young masters, go fetch us some sticks, eh!\"</span>\n</p>\n<p> </p>\n<p>\n<span>The juniors snap to their order, and Lan Faseng leads them into the woods to go find good sturdy sticks. By the time they've returned, Wei Wuxian and Liang Zhi have made all the talismans they need. As far as he can tell, Jiang Cheng and Lan Wangji are stonily ignoring each other, since they have nothing else to do. Wei Wuxian thinks they're probably bored, so he makes Jiang Cheng help the juniors tie the frame together with reeds, and he has Liang Zhi tell Lan Wangji to look over their talismans, although he's certain they're fine already. </span>\n</p>\n<p> </p>\n<p>\n<span>In the end it's a simple thing to enchant the stick frame; to lay it on the ground and then to step inside it with Lan Wangji; to stand chest to chest with him as Jiang Cheng and the tallest junior, Lan Wangji's little cousin (or something) Lan Shaoyong, raise the frame up carefully around them.</span>\n</p>\n<p> </p>\n<p>\n<span>It's even simpler to meet Lan Wangji's gaze just before the curse takes hold and the world goes dark.</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>*</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>He comes to only moments later, collapsed on the ground (of course) half on top of Lan Wangji, who must also have lost consciousness briefly. Wei Wuxian lurches upright and looks down at Lan Wangji, who blinks back at him. \"Lan Zhan,\" Wei Wuxian breathes.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Wei Ying,\" Lan Wangji says, and Wei Wuxian </span>\n<em>\n<span>hears it.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>He hurls himself back onto Lan Wangji's chest. Lan Wangji's hands come up to grip his waist, almost shy, as Wei Wuxian clasps his head in his hands and presses kisses all over his sweet face. \"Lan Zhan,\" he repeats, \"My Lan Zhan, sweetheart, my husband, my love, I missed your face.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji looks at him with wide eyes. His ears are pinking adorably. Ah, how Wei Wuxian missed looking at his ears! \"Wei Ying,\" Lan Wangji manages.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian sits up again so that Lan Wangji doesn't have to keep lying on the hard dirt path. Lan Wangji follows him up and brushes dust off Wei Wuxian's black sleeves. Wei Wuxian ducks forward to kiss him again on the cheek, because he can, and he grabs Lan Wangji's hands to hold them, and then he pulls back to grin at Liang Zhi. \"I think we're all back to normal, Inventor Liang!\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I see!!\" they reply, smiling proudly. \"Sect Leader Jiang, Young Master, you can put that thing down now.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Shaoyong releases his side of the stick frame to Jiang Cheng, who goes as if he's about to put it down and then just bonks Wei Wuxian on the head with it.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Hey!\" Wei Wuxian says, releasing Lan Wangji's hands to rub his head. \"Aiyah, Jiang Cheng ah, I've had enough head trauma in the past couple days without your help!\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"That's for getting yourself cursed in such a stupid way,\" Jiang Cheng informs him. \"And this is for not telling me you were in the area.\" He goes to bonk Wei Wuxian again.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji catches the stick frame in one hand and channels so much spiritual energy into it so quickly that it bursts into dust. \"Don't touch him,\" he says flatly.</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian blinks. Well, that's kind of hot, even if it leaves Jiang Cheng snarling in shocked anger. \"Maybe we should make a new frame and curse the two of you,\" he says. </span>\n</p>\n<p> </p>\n<p>\n<span>\"Hm,\" Lan Wangji says, looking like he's really considering it.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Finally a good idea out of Wei Wuxian,\" Jiang Cheng says.</span>\n</p>\n<p> </p>\n<p>\n<span>\"I'm joking,\" Wei Wuxian says. \"It was a joke, funny, ha-ha. Honestly, you two, I don't know what your problem is!\" He stands up and dusts himself off. </span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji stands too, somehow flawlessly dust-free despite the fact that he cushioned Wei Wuxian's fall and is wearing white, and shoots Wei Wuxian an incredulous look. Jiang Cheng scoffs. \"You think he's bad now,\" he says. \"That guy spent sixteen years refusing to acknowledge my existence.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji's lip curls slightly. Wei Wuxian has never seen him make that expression before. \"My silence to you was restraint,\" he says icily.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Right, because you're so talkative normally,\" Jiang Cheng says. \"Between you and Wei Wuxian, you're almost one normal person.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji steps closer to him and grits out, \"Stop insulting him.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Oh, how righteous of you,\" Jiang Cheng snaps. \"As if you've always treated him so well!\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji makes a sharp sound through his teeth. \"Whose sword was it—\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Stop it!!\" Wei Wuxian yells. \"That's enough!!\"</span>\n</p>\n<p> </p>\n<p>\n<span>Both of them startle, and Wei Wuxian shoves them apart, makes furious eye contact with one beloved person and then the other. The juniors stare pointedly at the ground or the horizon. Liang Zhi picks at their nails.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Look,\" Wei Wuxian says, \"I don't give a shit if you hate each other forever. That's none of my business. But you both love </span>\n<em>\n<span>me </span>\n</em>\n<span>and I love you and I don't need you at each other's throats on my behalf. And anyway, you're scaring the juniors.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji blinks. He looks at Wei Wuxian, then he looks at the juniors, who do their best to look like they're totally comfortable and everything is fine. \"This senior apologizes,\" he says to them. \"It is undignified to allow oneself to be drawn into argument,\" because he's still a petty bastard.</span>\n</p>\n<p> </p>\n<p>\n<span>Jiang Cheng scoffs again. \"Whatever.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Jiang Cheng,\" Wei Wuxian says. \"Thank you for coming to check on me. But I think you should go home now.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Jiang Cheng stares at him. After a moment he spits, \"Fine.\" He salutes Liang Zhi shortly, then turns to Lan Wangji and says, \"What's it like, huh?\" Lan Wangji gazes at him blankly. \"What's it like, for him to always choose you?\"</span>\n</p>\n<p> </p>\n<p>\n<span>A tiny line appears between Lan Wangji's eyebrows. \"You tell me, Jiang Wanyin,\" he says, and then he turns and leaves, disappearing behind Liang Zhi's house. After a second Lan Faseng makes the executive decision to follow him, and the juniors clear out as well. Liang Zhi dances after them.</span>\n</p>\n<p> </p>\n<p>\n<span>Jiang Cheng and Wei Wuxian look at each other. \"I suppose I'm leaving then,\" Jiang Cheng says after a long awkward moment.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yeah,\" Wei Wuxian says, looking away. \"Yeah. Fly safe.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Hm,\" Jiang Cheng says. \"When you come to Lotus Pier, don't bring him.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"He's my husband,\" Wei Wuxian says automatically. \"I have to introduce him that way to shijie. And to Jiang Fengmian and Madame Yu.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"There's no room for him in the Jiang family complex,\" Jiang Cheng insists, and the way he says it, it's as if he wants something.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Okay,\" Wei Wuxian says. \"So we'll stay in town.\" He hadn't expected to stay in the family complex anyway.</span>\n</p>\n<p> </p>\n<p>\n<span>\"There's no room,\" Jiang Cheng repeats slowly, \"for</span>\n<em>\n<span> him.\"</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>… Ah. </span>\n</p>\n<p> </p>\n<p>\n<span>\"Hm,\" Wei Wuxian says, slapping Jiang Cheng's shoulder. \"Well, we'll see about that! Soon, alright?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"But not too soon,\" Jiang Cheng says quickly.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Right, right,\" Wei Wuxian says. \"I'm sure my room needs dusting, or whatever.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Or whatever,\" Jiang Cheng agrees gruffly, which probably means that it needs construction. He draws Sandu and mounts it without ceremony. \"Try not to die again,\" he advises.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Uh huh,\" Wei Wuxian says. \"But, hey, Jiang Cheng?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"What.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian looks around to make sure they don't have any obvious eavesdroppers, and then he says, \"I don't have any interest in having to choose between you and Lan Zhan. So stop trying to make me.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Jiang Cheng sets his jaw, his expression pinched. \"But if you did,\" he says.</span>\n</p>\n<p> </p>\n<p>\n<span>\"I won't choose. I won't pretend to choose,\" Wei Wuxian tells him sharply. Jiang Cheng looks away. Wei Wuxian scrubs his hands over his eyes and says, \"I have made... a </span>\n<em>\n<span>lot</span>\n</em>\n<span> of hard decisions in my life. After all this, don't you think I deserve not to make this one? Can't I just love both of you?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Can't </span>\n<em>\n<span>one thing </span>\n</em>\n<span>be easy?</span>\n</p>\n<p> </p>\n<p>\n<span>Jiang Cheng finally deflates. \"I'll… try not to provoke him,\" he concedes at last. \"But it's </span>\n<em>\n<span>not </span>\n</em>\n<span>just me.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I know,\" Wei Wuxian says, \"believe me, I'm aware. It'll have to be a team effort.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Hm,\" Jiang Cheng says. </span>\n</p>\n<p> </p>\n<p>\n<span>\"Think of it as a competition with him,\" Wei Wuxian suggests. \"Who can be nicer and more accommodating?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yeah, I'm leaving now,\" Jiang Cheng decides. Sandu drifts higher into the air. \"Next time you're in Yunmeng, be polite for once and come pay your respects, Wei Wuxian.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Of course,\" Wei Wuxian says, and Jiang Cheng flies away.</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>*</span>\n</p>\n<p> </p>\n<p>\n<span>When Wei Wuxian picks his way to the side of Liang Zhi's house, he immediately runs into Lan Qubei, Pei Shouli, and the little shidi Lan Hongzuo, who all scramble away from the corner of the house and try very hard to look like they weren't eavesdropping. Pei Shouli's eyes are a little red. Wei Wuxian claps him on the shoulder and offers neither censure nor reassurance.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Lan Zhan, sweetheart,\" he says as they round the corner to the back of the house. \"A word?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji rises from where he was sitting crosslegged on the ground. His ears have gone red again with the endearment; he's so fucking cute. Wei Wuxian offers his hand as they walk back around to the front of the house, and Lan Wangji takes it and laces their fingers together. </span>\n</p>\n<p> </p>\n<p>\n<span>\"I apologize for my behavior,\" he says, just before Wei Wuxian tugs him down to sit on the porch. Lan Wangji sits easily, and Wei Wuxian crawls up behind him to spoon him, Lan Wangji's back to his chest, hooking his chin over his shoulder. Lan Wangji presses back into him and says, \"I know it is hard for you already. I should not have taken his bait.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"No apologies, between us,\" Wei Wuxian tells him, and then he ducks forward to kiss his ear. \"I forgive you, obviously. I guess I'm just surprised. You don't usually let yourself get provoked like that.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mm,\" Lan Wangji says. \"I… have little patience when it comes to that man.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I noticed,\" Wei Wuxian says dryly.</span>\n</p>\n<p> </p>\n<p>\n<span>\"I respect that you have decided to forgive him,\" Lan Wangji tells him quietly. \"But I find I cannot.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Forgive him for what?\" Wei Wuxian asks, quirking his eyebrows. \"Just for being rude?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji stills in his arms, then turns around to look at him. \"Wei Ying,\" he says. \"Be serious.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I am being serious,\" Wei Wuxian tells him. \"I know he's a dickhead, but lots of people are dickheads. </span>\n<em>\n<span>I'm </span>\n</em>\n<span>a dickhead sometimes. And — and, if the problem is that he's mean to </span>\n<em>\n<span>me, </span>\n</em>\n<span>then, it's fine. I can take it. That's just how brothers are.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Not all brothers,\" Lan Wangji says, and then he kind of narrows his eyes briefly, as if he didn't mean to say that.</span>\n</p>\n<p> </p>\n<p>\n<span>\"That's how he and I are, then,\" Wei Wuxian allows. \"We always roughhouse. As my little brother he has the right to bop me gently on the head when I've been stupid, and as his older brother I have the right to cry about it and threaten to kick his ass.\" It's true; he had faked offense when Jiang Cheng hit him with the stick frame, but in his heart he had been thrilled at the familiarity of it. When Jiang Cheng cares, he scolds. </span>\n</p>\n<p> </p>\n<p>\n<span>\"Hm,\" Lan Wangji says, so maybe he's accepted Wei Wuxian's explanation. But then he turns back around to face the overgrowth and says, \"It's not only that he disrespects you.\"</span>\n</p>\n<p> </p>\n<p>\n<span>When he doesn't elaborate, Wei Wuxian squeezes his middle and hums like, </span>\n<em>\n<span>Go on.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji says nothing for a moment. Wei Wuxian holds him and listens for his quiet breath, almost inaudible underneath the ever-present summer hum of cicadas, bees, frogs. Finally Lan Wangji says slowly, \"Time and time again I have been the only person who seems to see you truly. This singularity brings me no pleasure. That the man who should be your brother failed you so utterly — especially at the end, back then, when he would have taken your life…\" He trails off, clenching and unclenching his fists in a rare display of emotion, before concluding in a whisper, \"He fills me with such rage that I cannot speak it.\" </span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian blinks, surprised.</span>\n</p>\n<p> </p>\n<p>\n<span>\"L-Lan Zhan,\" he says when he's recovered somewhat. \"You really…\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I know you love him still,\" Lan Wangji says, and he says it like an apology. \"I have no wish to complicate things between you. I shall endeavor not to be drawn into conflict with him in the future.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian's heart feels like a rising sun. \"Lan Zhan, you… How can you do it?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Do what?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Wei Wuxian squeezes him again and rocks him back and forth. \"How does all that love even fit in this body of yours? You're not small, but good heavens! How is there room in there??\"</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji turns again to stare at him. Wei Wuxian smiles to hide the fact that he feels like he's two seconds from bursting into tears. His body, too, seems too small to hold all the love it holds.</span>\n</p>\n<p> </p>\n<p>\n<span>But then Lan Wangji carefully takes Wei Wuxian's face in his hands, and places a gentle kiss between his eyebrows, and explains in total sincerity, \"I breathe it,\" and Wei Wuxian's battle against tears is very abruptly lost.</span>\n</p>\n<p> </p>\n<p>\n<span>He weeps into Lan Wangji's shoulder for a while, and then Lan Wangji kisses his tears away, and then Wei Wuxian kisses him back and they end up making out on the porch for a few honey minutes. And then Wei Wuxian remembers that the kids and Liang Zhi are still around back, and he has to push himself away from Lan Wangji's sweet mouth so he doesn't do something stupid like try to go down on him.</span>\n</p>\n<p> </p>\n<p>\n<span>Lan Wangji looks at him, eyes huge and dark, and waits for an explanation. His hands are hot on Wei Wuxian's waist.</span>\n</p>\n<p> </p>\n<p>\n<span>\"I, um,\" Wei Wuxian gasps. Oh, kissing Lan Wangji has rendered him so useless. \"The uhh — all your juniors, we should go home. Back to the inn. Whatever.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Home,\" Lan Wangji says.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Home,\" Wei Wuxian breathes. \"I haven't had a home in so fucking long, Lan Zhan.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"You have one now,\" Lan Wangji says. \"As long as I breathe, Wei Ying.\"</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>*</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>Later they will go back to the inn with the juniors and Liang Zhi, whose house is still uninhabitable. The next day they will carefully remove all the cursed objects from that house and neutralize them, or store them safely where Liang Zhi can get to them later; eventually they will escort both Liang Zhi and young Po Qian to Qinghe, where they introduce the two of them to Nie Huaisang, who will be delighted. Liang Zhi will learn proper cultivation; a-Qian is too volatile to take to cultivation easily, but she and Nie Huaisang will see each other clearly. They will make fans and churn rumors. She will never marry.</span>\n</p>\n<p> </p>\n<p>\n<span>Later still Wei Wuxian will accompany Lan Wangji to the Cloud Recesses, where they will fall into bed in the Jingshi and not emerge for hours, hours. Wei Wuxian will ask, \"We're home now, right?\" and Lan Wangji will kiss his mouth and his scarred knuckles and the curve of his bicep and tell him, very gently, \"Wherever you are, that is where my home is,\" and Wei Wuxian will freeze for a moment and then kiss him silly. When night has fallen Wei Wuxian will hold Lan Wangji close and murmur, \"What could I have done to deserve you? The yang to my yin, my perfect match, the heart against which my heart is balanced,\" and Lan Wangji will say only, \"Wei Ying,\" and \"Wei Ying,\" and again: \"Wei Ying.\"</span>\n</p>\n<p> </p>\n<p>\n<span>But for now they lean against each other on Liang Zhi's broken porch, and the air is thrumming with late summer heat and the sounds of things living and dying around them, and together they stay upright.</span>\n</p>"
}