{
  "id": "22065874",
  "url": "https://archiveofourown.org/works/22065874?view_full_work=true",
  "author": [
    "MistressEast"
  ],
  "title": "the observer effect",
  "rating": "Not Rated",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Dr. STONE (Anime)",
    "Dr. STONE (Manga)"
  ],
  "relationships": [
    "Asagiri Gen/Ishigami Senkuu"
  ],
  "characters": [
    "Asagiri Gen",
    "Ishigami Senkuu",
    "brief allusions to the presence of other characters",
    "Ogawa Yuzuriha",
    "Ooki Taiju",
    "Nanami Ryuusui",
    "Francois (Dr. STONE)"
  ],
  "additional_tags": [
    "Wrong Number AU",
    "don't hide author's style please please",
    "Texting",
    "i worked so hard to format this",
    "html and i are not friends",
    "ignore the fact that theyre apparently texting on iphones but senku cant see the emojis",
    "the blue is easier on my eyes",
    "i'm very bad with timelines so if i got something majorly wrong sorry!!",
    "if dr stone can shove Knowledge down our throats then so can i goddammit",
    "this is technically pre-relationship but don't worry. we know what's up ;)",
    "i can't believe i typed bohr-chan with my own two hands",
    "some character names get proper spellings but most are spelled like they are in the subtitles so eh",
    "Getting Together",
    "Identity Porn",
    "kind of lol",
    "i love francois and ryusui so much guys",
    "Banter",
    "homoerotic hot air balloon rides",
    "brief mention of blood and decomposition",
    "and dont think i didn't notice gen isnt in many of minamis photos!",
    "i noticed and im making it angsty"
  ],
  "language": "English",
  "series": "Part 1 of quantum entanglements",
  "published": "2020-01-01",
  "completed": "2020-01-23",
  "words": "21,708",
  "chapters": "2/2",
  "comments": "313",
  "kudos": "6,428",
  "bookmarks": "1,171",
  "hits": "50,187",
  "summary": "<p>More than a year before the petrification incident, Gen gets a text from a stranger.</p>\n<p>Everything is different now.</p>",
  "notes": "<p>it's new year's day!</p>\n<p>i spent longer formatting this fic than i did writing it i stg. technically, i wrote this for sengen week, but i didn't want to follow a specific theme. i've been wanting to do a wrong number au for this pairing for a while so i decided, in the spirit of sengen week, to just go for it.</p>\n<p>i've tested this fic on my android phone, my apple ipad, and my windows laptop and it looks fine, so fingers crossed everyone can see it as it's meant to be seen. make sure you don't hide the author's style bc my knowledge of the html for this fic is so tenuous, any change will render the whole thing unreadable.</p>\n<p>i'll be honest, these characters aren't easy to write. i tried to keep them as in-character as possible. senku is, of course, a know-it-all, but i always got the impression gen was very proficient with soft sciences and cultural studies. and we get like no info about his background in the series, so i'm just making it up lol.</p>\n<p>hope you enjoy!!</p>\n<p>oh my goodness...this really got away from me. it careened wildly off the rails into completely unplanned territory, but I'm incredibly pleased with how it turned out and I hope you enjoy it too!!</p>\n<p>several people expressed disappointment that the 2nd part wouldn't have text convos, but fear not! I loved writing them too much not to include some. the ones featured here aren't necessarily in chronological order and they don't always directly relate to the surrounding sections, but they do inform the narrative a bit more, plus they're just cute to read!! I think I ironed out all the formatting bugs, but if you see something weird, let me know!</p>\n<p>(btw thank you Zenyr for pointing out those typos! you rock!) </p>\n<p>MAJOR SPOILERS FOR THE MANGA from here on out, guys. I'm serious, don't read if you don't want to be spoiled for the next season of the anime.</p>\n<p>okay, that's enough from me. enjoy!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>i hope it was worth the wait lmao. let me know what you think! I'm busy with my other wips, but I love this pairing so much, there may be more sengen in the future if I can get my shit together.</p>\n<p>follow me on <a href=\"https://mistresseast.tumblr.com/\" rel=\"nofollow\">tumblr</a> and <a href=\"https://twitter.com/MistressEast\" rel=\"nofollow\">twitter</a> for occasional sengen and constant nonsense!</p>",
  "text": "<p>Right after the stagehand signals five minutes, Gen feels his phone vibrate in his back pocket.</p>\n<p>Unsure who would be texting him other than his manager, who’s waiting in the green room, Gen pulls it out quickly, unlocking the screen. It’s from an unknown number.</p>\n<p class=\"messagebody\">\n<span class=\"text\">Bohr says I’m right.</span><br>\n<br>\n</p>\n<p>Followed by a link.</p>\n<p>Eyebrows raised, Gen taps the link. After a second of buffering, his phone browser pulls up a page that Gen recognizes as some sort of scientific article about quantum physics. He catches sight of the terms <em>matter wave nature</em> and <em>observer effect</em> before his eyes glaze over and he switches back to the messaging app.</p>\n<p>Normally, he’d just ignore the message and block the number, like he does when fans occasionally get a hold of his personal information, but something about the sheer confidence of the message intrigues him and before he can stop himself, he’s tapping out a response.</p>\n<p class=\"messagebody\">\n<span class=\"breply\">From what I can tell, this Bohr person is dead and can’t weigh in on any personal arguments. One of several mistakes you’ve made today ;)</span><br>\n<br>\n</p>\n<p>His phone buzzes with a response before he can even put it back in his pocket.</p>\n<p class=\"messagebody\">\n<span class=\"text\">You know that’s not what I mean, old man. The observer effect and the uncertainty principle are different, period. I’m trying to help you study, so take this seriously.</span><br>\n<br>\n</p>\n<p>Shaking his head, Gen starts typing again. Clearly, he’s been accidentally contacted by some sort of science nerd and he really needs to cut that off at the pass.</p>\n<p class=\"messagebody\">\n<span class=\"breply\">I should have been clearer: you’ve got the wrong number.</span><br>\n<br>\n</p>\n<p>Again, the response comes quickly:</p>\n<p class=\"messagebody\">\n<span class=\"text\">Don’t try that on me again. I’m not falling for it.</span><br>\n<br>\n</p>\n<p>In his periphery, Gen sees the stagehand signaling two minutes, but he keeps frowning down at his phone.</p>\n<p class=\"messagebody\">\n<span class=\"breply\">Don’t be so pushy. No one likes an aggressive guy, you know.</span><br>\n<br>\n<span class=\"text\">Stop trying to distract me from the fact that you were wrong.</span><br>\n<br>\n<span class=\"breply\">What exactly was I wrong about?</span><br>\n<br>\n<span class=\"text\">Do I really need to spell it out for you? Fine, fine. After you were so INSISTENT about Heisenberg’s work, I took the liberty of tracking down these materials for you so that you don’t make such an embarrassing mistake on your selection exam. No need to thank me.</span><br>\n<br>\n</p>\n<p>Gen can’t help but snort at the gall. Who talks like this? Other than him, that is.</p>\n<p>“Asagiri-san,” the stagehand whispers loudly.</p>\n<p>“Coming, coming,” Gen sings, powering his phone off and tucking it back in his pocket. Let his unaware friend talk to themselves for a while.</p>\n<p>He’s still smiling as he parts the curtains with aplomb to begin his act.</p>\n<p>When Gen checks his phone later, after letting himself into his empty apartment, still flushed with energy from a successful show, he’s tickled to find eight missed notifications.</p>\n<p>Most of them are paragraphs of technical-sounding jargon that Gen can barely parse, interspersed with fond-sounding insults and links to increasingly esoteric articles.</p>\n<p>Flopping down on his sofa, Gen responds:</p>\n<p class=\"messagebody\">\n<span class=\"breply\">That’s ~fascinating~ and all, but I was serious earlier. If you want your wayward student to pass his exam, you should try texting him instead, sensei.\n</span><br>\n<br>\n</p>\n<p>This time, Gen has time to run a hand over his tired eyes and consider going to bed before the reply comes.</p>\n<p class=\"messagebody\">\n<span class=\"text\">Hang on, you’re not joking?</span><br>\n<br>\n<span class=\"breply\">Nope~ double-check the number.</span><br>\n<br>\n</p>\n<p>Another few minutes pass, during which Gen assumes his mystery texter is cross-referencing his contacts. Then--</p>\n<p class=\"messagebody\">\n<span class=\"text\">I apologize for that.</span><br>\n<br>\n</p>\n<p>Gen snorts.</p>\n<p class=\"messagebody\">\n<span class=\"breply\">It’s okay~ it’s not every day I get mysterious, passionate texts about science.</span><br>\n<br>\n<span class=\"text\">You didn’t have to let me just keep rambling.</span><br>\n<br>\n<span class=\"breply\">I tried to tell you, sensei.</span><br>\n<br>\n<span class=\"text\">Yeah, I guess you did.</span><br>\n<br>\n<span class=\"breply\">Tsk tsk. You should trust people more.\n</span><br>\n<br>\n<span class=\"text\">To be fair, my father has tried that on me before to get out of studying.</span><br>\n<br>\n<span class=\"breply\">To his own son? How cold~</span><br>\n<br>\n</p>\n<p>After hitting send, Gen realizes he just assumed his mystery texter was male and quickly amends:</p>\n<p class=\"messagebody\">\n<span class=\"breply\">*child</span><br>\n<br>\n<span class=\"text\">No, son is correct.</span><br>\n<br>\n<span class=\"breply\">Well, you sound like quite the taskmaster, so I guess I can’t blame him. What is he studying for?</span><br>\n<br>\n<span class=\"breply\">Or not studying, as the case may be.</span><br>\n<br>\n<span class=\"text\">He’s trying to get selected for a manned mission to the International Space Station.</span><br>\n<br>\n</p>\n<p>Gen raises his eyebrows, stretching out on the sofa.</p>\n<p class=\"messagebody\">\n<span class=\"breply\">And you’re helping him?</span><br>\n<br>\n<span class=\"text\">He needs the help. He’s a physics professor, but if he can’t even tell the difference between the observer effect and the uncertainty principle, then he’ll never pass the preliminary selection.</span><br>\n<br>\n<span class=\"breply\">Of course, of course.</span><br>\n<br>\n</p>\n<p>Gen has almost no idea what those words mean.</p>\n<p class=\"messagebody\">\n<span class=\"breply\">You certainly know a lot. Are you a professor too?</span><br>\n<br>\n<span class=\"text\">Fishing for information?</span><br>\n<br>\n<span class=\"breply\">Are you saying you don’t trust me?</span><br>\n<br>\n<span class=\"text\"> I don’t know you.</span><br>\n<br>\n<span class=\"breply\">I don’t know you either.</span><br>\n<br>\n<span class=\"text\">Fine then. I’ll tell you what I do if you tell me what you do.</span><br>\n<br>\n</p>\n<p>Gen considers for a second, tapping a finger against his lips. Basic stranger danger insists he not divulge personal information to a complete stranger over text message, but there’s something oddly charming about his new texting buddy. What harm can a little polite conversation do?</p>\n<p>(And it’s not like he has anyone else texting him.)</p>\n<p class=\"messagebody\">\n<span class=\"breply\">Deal. I’m a performer~</span><br>\n<br>\n<span class=\"text\">A performer of what?</span><br>\n<br>\n<span class=\"breply\">Sorry~ can’t tell you that. I’m getting fairly well-known. If I tell you what I perform, you might be able to track me down and murder me.</span><br>\n<br>\n<span class=\"text\">That’s fair. You do seem pretty irritating. I’m not sure I’d be able to help myself.</span><br>\n<br>\n</p>\n<p>Gen cackles, rolling over on his side.</p>\n<p class=\"messagebody\">\n<span class=\"breply\">How cruel!</span><br>\n<br>\n<span class=\"text\">It’s better to be safe.</span><br>\n<br>\n<span class=\"breply\">Your turn, sensei.</span><br>\n<br>\n<span class=\"text\">I’m a student.</span><br>\n<br>\n</p>\n<p>So not a sensei. The title still seems apt, somehow. Gen takes a second to change the unknown number’s contact name to <em>Sensei</em> before responding:</p>\n<p class=\"messagebody\">\n<span class=\"breply\">What’s your major?</span><br>\n<br>\n<span class=\"text\">I’m in high school.</span><br>\n<br>\n</p>\n<p>Gen’s eyes widen.</p>\n<p class=\"messagebody\">\n<span class=\"breply\">You’re not!!</span><br>\n<br>\n<span class=\"text\">Unfortunately, I am.</span><br>\n<br>\n<span class=\"breply\">Seeeriously?? You must be very precocious for your age.</span><br>\n<br>\n<span class=\"text\">Okay, I’m not twelve. Quantum mechanics and particle wave research are well within high school curriculum.</span><br>\n<br>\n<span class=\"breply\">But helping someone study for a space program selection exam surely isn’t.</span><br>\n<br>\n<span class=\"text\">It’s really not that impressive.</span><br>\n<br>\n<span class=\"breply\">No need to be modest!! I’m your fan, sensei~</span><br>\n<br>\n<span class=\"text\">Oh, great. The wrong number I texted and lectured about Niels Bohr is cheering me on.</span><br>\n<br>\n<span class=\"breply\">You’re definitely younger than me and I barely understood any of what you sent me earlier. Of course I’m impressed~</span><br>\n<br>\n<span class=\"text\">Please, that was nothing. It’s actually very easy to understand once you know the basics.</span><br>\n<br>\n</p>\n<p>This guy wants to explain, Gen realizes. He smiles. It’s not like he had plans for the evening.</p>\n<p class=\"messagebody\">\n<span class=\"breply\">I’m afraid I wasn’t a very good science student, sensei. Is it really that easy to understand?</span><br>\n<br>\n<span class=\"text\">Anyone can pick it up. All you have to know is the fundamentals of particle physics, and that’s easy stuff. So in 1925, a physicist named Erwin Schroedinger….</span><br>\n<br>\n</p>\n<p>Gen sticks one of the couch pillows under his head and settles in.</p>\n<p>It shouldn’t become a habit. Any sane person would laugh the whole thing off and stop talking to the guy who accidentally texted them about Niels Bohr, but Gen is nothing if not experimental. Every notification from Sensei makes him giddy. It’s the same feeling he gets when he works a kink out of his act, or when a trick goes right for the first time.</p>\n<p>It’s fun, in a way. Gen prides himself on being able to figure out how people tick, and a stranger he only communicates with via text is a unique challenge. He can’t help testing this guy, or being delighted when Sensei tests him right back.</p>\n<p>From what he can tell, Sensei responds best to genuine-seeming curiosity and understated praise. He can pick out probing questions instantly and is uninterested in flattery, but he’s eager to educate and responds well to certain kinds of compliments. It doesn’t take Gen long to uncover Sensei’s iron-clad ego, incredibly advanced for someone his age and solid enough to rival even Gen’s, but it’s obvious that Sensei isn’t arrogant. Confident and audacious, sure, but he’s the first to admit when he doesn’t know something and seems honestly intrigued by Gen’s knowledge of psychology.</p>\n<p>Chatting with Sensei quickly becomes Gen’s favorite distraction. Perhaps he shouldn’t be so eager to text someone several years younger, but it’s not like either Gen or Sensei have any desire to meet.</p>\n<p class=\"messagebody\">\n<span class=\"breply\">Frued was a hack, of course, but he was the first to act on the concept of innate desires in his practice.</span><br>\n<br>\n</p>\n<p>Gen types, trying to keep his restless hands busy as he waits for his editor to arrive at their meeting spot. A publisher finally showed interest in his first book and he needs to make sure the draft is perfect before he sends it off.</p>\n<p class=\"messagebody\">\n<span class=\"breply\">He was wrong about literally everything, though, and it’s unfortunate that he’s the face of modern psychology.</span><br>\n<br>\n<span class=\"text\">Oh yeah, the Oedipus complex guy.</span><br>\n<br>\n</p>\n<p>Sensei goes through long periods of silence, but when he’s in a talkative mood, he responds very quickly.</p>\n<p class=\"messagebody\">\n<span class=\"breply\">Among other things. He pioneered psychoanalysis but his theories on the unconscious are all out of line. Did you know he popularized the concept of the libido?</span><br>\n<br>\n<span class=\"text\">I didn’t. That’s a psychology thing?</span><br>\n<br>\n<span class=\"breply\">Of course! And it ruined the whole field of study for a long time. Almost everything he proposed has been disproven, but his work has pervaded the general public, so we’ll never get rid of it. You’ve heard of Id, Ego, and Super-Ego?</span><br>\n<br>\n<span class=\"text\">In passing.</span><br>\n<br>\n<span class=\"breply\">As if the human mind can be so easily compartmentalized.</span><br>\n<br>\n<span class=\"text\">It’s interesting to see you speak so scathingly about something.</span><br>\n<br>\n<span class=\"breply\">This is my wheelhouse, sensei~ it’s kind of fun to know more about something than you.</span><br>\n<br>\n<span class=\"text\">Psychology isn’t something I need in my line of work.</span><br>\n<br>\n<span class=\"breply\">Don’t be so hasty. You never know when you might need to get in someone’s head.</span><br>\n<br>\n<span class=\"text\">If I ever need to do that, I’ll just call you.</span><br>\n<br>\n</p>\n<p>Blinking down at his phone, Gen almost misses his editor sliding into the booth across from him.</p>\n<p class=\"messagebody\">\n<span class=\"breply\">Sorry sensei, my editor is here. Gtg!!</span><br>\n<br>\n</p>\n<p>And he puts his phone in his backpack and tries not to think about why he’s blushing.</p>\n<p>When his meeting is over and he’s nearly bouncing with excitement, he checks his phone again to find one new message.</p>\n<p class=\"messagebody\">\n<span class=\"text\">Editor? Are you a writer?</span><br>\n<br>\n</p>\n<p>Gen curses internally. He’d been so caught up in his thoughts he didn’t even notice the slip. That’s just a little more information than he intended to share. He types slowly, biting his lip:</p>\n<p class=\"messagebody\">\n<span class=\"breply\">In a manner of speaking.</span><br>\n<br>\n</p>\n<p>Sensei responds quickly.</p>\n<p class=\"messagebody\">\n<span class=\"text\">I thought you were a performer.</span><br>\n<br>\n<span class=\"breply\">I wear many hats. In this economy, it pays to diversify.</span><br>\n<br>\n<span class=\"breply\">It’s nothing you’d be interested in, sensei. Trust me.</span><br>\n<br>\n</p>\n<p>The typing bubble pops up, ellipses rippling for a beat, then disappears. A moment passes before Sensei’s reply comes:</p>\n<p class=\"messagebody\">\n<span class=\"text\">I’ll take your word for it. That’s pretty cool, though.</span><br>\n<br>\n</p>\n<p>Relieved, Gen smiles.</p>\n<p class=\"messagebody\">\n<span class=\"breply\">Thank you~ but don’t be too nice, sensei. I’ll get used to it~</span><br>\n<br>\n</p>\n<p>He almost adds a winky face but stops himself. A winky face is a big commitment. He needs to probe a little more to discover how Sensei feels about emojis before taking that step.</p>\n<p class=\"messagebody\">\n<span class=\"text\">Noted. And I looked into that guy we were talking about earlier. Even with my limited knowledge of psychology, I can tell you’re right. He is a hack.</span><br>\n<br>\n<span class=\"breply\">Thank you!!</span><br>\n<br>\n</p>\n<p class=\"messagebody\">\n<span class=\"text\">I’m not saying that memetics isn’t a legitimate field of study.</span><br>\n<br>\n<span class=\"breply\">You’re just saying it’s beneath you.</span><br>\n<br>\n<span class=\"text\">No, I’m saying it’s not as vital as other anthropological fields.</span><br>\n<br>\n<span class=\"breply\">What is anthropology if not the study of memes?</span><br>\n<br>\n<span class=\"text\">Is that a joke?</span><br>\n<br>\n<span class=\"breply\">Me~? Joking~?</span><br>\n<br>\n<span class=\"text\">Memetics in the modern day can’t be compared to the study of things like art trends or linguistic analysis. That’s just a fact.</span><br>\n<br>\n<span class=\"breply\">I disagree. It’s social language, sensei! Doesn’t sending a specific image to someone to denote a particular emotion ultimately serve the same purpose as hieroglyphics? In the 1700s it was common for painters to paint themselves posing in window frames. How is that not a meme?</span><br>\n<br>\n<span class=\"text\">Art historians would disagree with you.</span><br>\n<br>\n<span class=\"breply\">Do you know any art historians?</span><br>\n<br>\n<span class=\"text\">Do you? </span><br>\n<br>\n<span class=\"breply\">That’s beside the point.</span><br>\n<br>\n<span class=\"text\">Why don’t you ask an art historian and get back to me.</span><br>\n<br>\n<span class=\"breply\">Why don’t you ask Neils Bohr.</span><br>\n<br>\n<span class=\"text\">Maybe I will.</span><br>\n<br>\n<span class=\"breply\"><span class=\"x1F644\"><span class=\"hide\"></span></span></span><br>\n<br>\n<span class=\"text\">Little gray box.</span><br>\n<br>\n<span class=\"breply\">Omg, are you texting me on a brick? You need an upgrade, sensei.</span><br>\n<br>\n<span class=\"text\">It’s funny--you’re not the first person to tell me that today.</span><br>\n<br>\n<span class=\"breply\">Someone who does as much research as you needs a high-quality smartphone.</span><br>\n<br>\n<span class=\"text\">Mine works just fine, thank you.</span><br>\n<br>\n<span class=\"breply\">Obviously not, if you can’t see half of my adorable and super relevant emojis.</span><br>\n<br>\n<span class=\"text\">Somehow I think I’ll survive.</span><br>\n<br>\n<span class=\"breply\"><span class=\"x1F61B\"><span class=\"hide\"></span></span></span><br>\n<br>\n<span class=\"text\">I can see that one.</span><br>\n<br>\n<span class=\"text\">:P</span><br>\n<br>\n</p>\n<p class=\"messagebody\">\n<span class=\"breply\">Leeches? Seeeeriously??</span><br>\n<br>\n<span class=\"text\">Yeah, some hospitals still keep them.</span><br>\n<br>\n<span class=\"breply\">Ewww!!! Why?</span><br>\n<br>\n<span class=\"text\">Nobody believes they suck out bad blood or anything. They have a really specific purpose.</span><br>\n<br>\n<span class=\"breply\">Ensuring that I never set foot in a hospital ever again?</span><br>\n<br>\n<span class=\"text\">Yeah, and doctors will sometimes use them after reattaching a body part. If it’s something small like a finger or toe and they act fast enough, severed pieces can be reattached without too much damage.</span><br>\n<br>\n<span class=\"breply\">Oh, that’s good to know.</span><br>\n<br>\n<span class=\"text\">Skilled surgeons can reconnect arteries, which carry blood from the heart to the limbs, but veins, which do the opposite, are smaller and harder to work with. So what happens is that blood flow can be reestablished to the severed part, but only in one direction, and since the limbs they’re working with are usually really small, normal draining methods don’t always work.</span><br>\n<br>\n<span class=\"breply\"><span class=\"x1F914\"><span class=\"hide\"></span></span></span><br>\n<br>\n<span class=\"text\">So, to keep the limb from swelling with blood that has no way to get out, doctors will use leeches. They’re small enough to only take a little blood and infection isn’t a huge worry in such a sterile environment.</span><br>\n<br>\n<span class=\"breply\">Does the patient just have to stick leeches on themselves periodically for the rest of their life?</span><br>\n<br>\n<span class=\"text\">Nah, the veins will grow back on their own after a while.</span><br>\n<br>\n<span class=\"breply\">That’s pretty cool, sensei, but, no offense: <span class=\"x1F616\"><span class=\"hide\"></span></span></span><br>\n<br>\n<span class=\"text\">If you’re lucky, you’ll never have to see it firsthand.</span><br>\n<br>\n<span class=\"breply\">Yeah, fingers crossed.</span><br>\n<br>\n</p>\n<p class=\"messagebody\">\n<span class=\"breply\">No, Houdini didn’t go to the seances because he believed in ghosts.</span><br>\n<br>\n<span class=\"text\">Then why would he go?</span><br>\n<br>\n<span class=\"breply\">To disprove the mediums!!</span><br>\n<br>\n<span class=\"text\">Wasn’t he a magician?</span><br>\n<br>\n<span class=\"breply\">That doesn’t mean he didn’t value the truth! He worked hard on his illusions but he never claimed to have supernatural powers and he hated people who exploited the public with lies for money.</span><br>\n<br>\n<span class=\"breply\">You would have liked him, sensei. He was very methodical. He’d wait until he had definitive proof that the medium was faking and then he’d reveal himself dramatically and out them as a fraud.</span><br>\n<br>\n<span class=\"text\">I can see why you like him.</span><br>\n<br>\n<span class=\"breply\">You can’t tell me you wouldn’t love to flip a table and tell off a fake medium.</span><br>\n<br>\n<span class=\"text\">Fake medium...implying there are real mediums?</span><br>\n<br>\n<span class=\"breply\">Well~ who’s to say?</span><br>\n<br>\n<span class=\"text\">Don’t tell me you believe in ghosts.</span><br>\n<br>\n<span class=\"breply\">Fine, I won’t tell you.</span><br>\n<br>\n<span class=\"text\">Oh my god.</span><br>\n<br>\n<span class=\"breply\">You can’t prove there aren’t ghosts!!</span><br>\n<br>\n<span class=\"text\">The burden of proof is yours, man. I can’t prove a negative.</span><br>\n<br>\n<span class=\"text\">Have you ever seen a ghost?</span><br>\n<br>\n<span class=\"breply\">...no</span><br>\n<br>\n<span class=\"text\">¯\\_(ツ)_/¯</span><br>\n<br>\n<span class=\"breply\">Not yet!</span><br>\n<br>\n<span class=\"text\">Do you really believe in that stuff?</span><br>\n<br>\n<span class=\"breply\">I’m just open to the possibility. There are a lot of crazy things in the world. You should know that better than anyone, Mr. Science Man.</span><br>\n<br>\n<span class=\"text\">Nothing exists in the world that can’t be explained with science.</span><br>\n<br>\n<span class=\"breply\">Maybe ghosts and things like that are just a science we haven’t figured out yet.</span><br>\n<br>\n<span class=\"text\">Doubtful.</span><br>\n<br>\n<span class=\"breply\">Psychology is a legitimate science, right?</span><br>\n<br>\n<span class=\"text\">A SOFT science, but yes.</span><br>\n<br>\n<span class=\"breply\">But we barely know how the human brain works right now, yet there’s no denying there are extensive mental machinations governing everything we do. Just because we don’t understand it, that doesn’t mean it’s not there.</span><br>\n<br>\n<span class=\"text\">That’s different.</span><br>\n<br>\n<span class=\"breply\">For now~</span><br>\n<br>\n<span class=\"text\">Psychology moves slowly because it’s the mind trying to understand itself, but most of it is ultimately testable. Theories involving ghosts or the afterlife, by their very definition, can never be tested.</span><br>\n<br>\n<span class=\"breply\">So I guess we’ll never know for sure!</span><br>\n<br>\n<span class=\"text\"> As someone who knows so much about human psychology, I would think you’d be quick to attribute supernatural phenomenon to faulty human perception and memory. Isn’t that more logical?</span><br>\n<br>\n<span class=\"breply\">Sure, most of it is, but who am I to dismiss thousands of years of witness testimony? What are the odds they’re all wrong or lying?</span><br>\n<br>\n<span class=\"text\">High.</span><br>\n<br>\n<span class=\"breply\">But can you say 100%?</span><br>\n<br>\n<span class=\"text\">You know what, yeah. 100%</span><br>\n<br>\n<span class=\"breply\">Bet.</span><br>\n<br>\n<span class=\"text\">Bet?</span><br>\n<br>\n<span class=\"breply\">If I die, I’ll come back and give you some sort of proof.</span><br>\n<br>\n<span class=\"text\">IF you die??</span><br>\n<br>\n<span class=\"breply\">So if you stop hearing from me and then your house gets possessed, that’s me~</span><br>\n<br>\n<span class=\"text\">You have no way of knowing where I live.</span><br>\n<br>\n<span class=\"breply\">I assume I’ll attain some sort of cosmic knowledge when my soul merges with the universe or whatever. I’ll find you ;)</span><br>\n<br>\n<span class=\"breply\">How’s that for burden of proof?</span><br>\n<br>\n<span class=\"text\">I can hardly wait.</span><br>\n<br>\n</p>\n<p>Being in the entertainment industry at his age is as much a curse as it is a blessing.</p>\n<p>Gen has the means to live on his own and support himself, he’s following his ambitions much earlier than most of his peers, and he’s doing what he loves every day. It’s hard work, to be sure. He writes all his own material and invents his own tricks, which usually take hours of workshopping and testing just to be feasible, not to mention the additional hours spent mastering every little motion and diversion to ensure his acts go smoothly. But even with the late nights, frustrated practice sessions, and pounds of discarded material, he’s proud of how far he’s come.</p>\n<p>His extensive knowledge of psychology helps him navigate the adult-dominated worlds of broadcast and publishing, but sometimes it’s not enough. When you get down to it, Gen is a kid, something people are eager to remind him of when he gets a little too confident.</p>\n<p>He slams his front door with a loud bang and fists his hands in his hair, clutching tight enough to make his eyes water. “I’m a <em>fucking mindreader</em>,” he hisses to himself. “What were they expecting?”</p>\n<p>It’s obvious to him now that the host of the talk show he was invited on didn’t put much stock in his abilities, so she was ill-prepared when he started reading her. But what was he supposed to do? He’ll pull his punches if he’s briefed beforehand, but otherwise he’s going to give it his all. It’s not his fault she has unresolved issues with her daughter and an unhealthy dependence on caffeine pills. But instead of handling it like a professional, she decided to mock her teenage guest live on air when he couldn’t even defend himself.</p>\n<p>Gen hadn’t even checked his phone afterward, too furious and dreading the reaction on social media. His book is nearly ready for print and this is the <em>opposite</em> of what he needs right now.</p>\n<p>But he has to check in with his manager, who’s probably boiling with rage over the whole thing. So he pries stiff fingers out of his hair and reaches into his messenger bag, stalking into the living room.</p>\n<p>His phone lights up with several texts and a missed call from his manager and he groans, but before he can respond, he catches sight of a notification from Sensei. Right, they’d been texting before Gen went onstage. He should tell Sensei he’s signing off for the night.</p>\n<p class=\"messagebody\">\n<span class=\"text\">And that’s why you actually shouldn’t drink tea for a sore throat.</span><br>\n<br>\n<span class=\"breply\">That’s super cool, sensei~! But I have to go for tonight~! :)</span><br>\n<br>\n</p>\n<p>When he doesn’t hear back right away, he assumes Sensei has moved on. But then, halfway through an explanatory text to his manager, his phone buzzes.</p>\n<p class=\"messagebody\">\n<span class=\"text\">Did something happen?</span><br>\n<br>\n</p>\n<p>Gen blinks.</p>\n<p class=\"messagebody\">\n<span class=\"breply\">What do you mean, sensei?</span><br>\n<br>\n<span class=\"text\">You went quiet for a long time and now you’re saying you have to go. And you used two tildes in one text. So I was just wondering if something was wrong.</span><br>\n<br>\n<span class=\"breply\">Aww, are you trying to read me? I thought you didn’t like psychology.</span><br>\n<br>\n<span class=\"text\">This has nothing to do with psychology, I just recognize your mannerisms.</span><br>\n<br>\n<span class=\"text\">Are you trying to change the subject?</span><br>\n<br>\n<span class=\"breply\">Of course not~</span><br>\n<br>\n<span class=\"breply\">Nothing happened, sensei. But I appreciate the concern <span class=\"x1F618\"><span class=\"hide\"></span></span></span><br>\n<br>\n<span class=\"text\"> I don’t trust that little gray box, but if you don’t want to talk about it, fine.</span><br>\n<br>\n</p>\n<p>Gen makes a face at his phone. Sensei always thinks he knows everything, but when you get down to it, they’re both strangers, and Sensei is younger than him. He has no reason to go blabbing about his problems to a high school kid he’s never even met.</p>\n<p>After a tense text exchange and a frustrating phone call with his manager, Gen flops down on his bed, not even bothering to change. The room is dim, only illuminated by the street light spilling in through the window, casting a sickly yellow glow across the walls. Gen cups a hand over his eyes, exhaustion weighing him down.</p>\n<p>But he’s still humming, buzzing too much for sleep.</p>\n<p>His phone vibrates beside him.</p>\n<p>He gropes for it, uncovering his eyes and squinting at the glowing screen, wondering what else his manager wants to complain about.</p>\n<p class=\"messagebody\">\n<span class=\"text\">Do me a favor and look outside.</span><br>\n<br>\n</p>\n<p>Gen rereads the text several times, trying to parse it.</p>\n<p class=\"messagebody\">\n<span class=\"breply\">Why?</span><br>\n<br>\n<span class=\"text\">Just do it. Are you near a window?</span><br>\n<br>\n<span class=\"breply\">Yes.</span><br>\n<br>\n<span class=\"text\"> Humor me.</span><br>\n<br>\n</p>\n<p>Sighing, Gen levers himself up and shuffles over to the window. His bed is in the corner of the room under the windowsill so he doesn’t have to get up. He peers through the glass but doesn’t see anything spectacular.</p>\n<p class=\"messagebody\">\n<span class=\"breply\">Okay, what am I looking for?</span><br>\n<br>\n<span class=\"text\">Can you see the sky?</span><br>\n<br>\n</p>\n<p>Gen’s unit is pretty high up, and he doesn’t live too far into the city, so he can see a good swath of sky over the roofs of the low-lying buildings in his neighborhood.</p>\n<p class=\"messagebody\">\n<span class=\"breply\">Yes?</span><br>\n<br>\n<span class=\"text\">What do you see?</span><br>\n<br>\n<span class=\"breply\">A lot of black. A few stars. Why?</span><br>\n<br>\n<span class=\"text\">Do you see a short row of stars with a really bright one at the end?</span><br>\n<br>\n<span class=\"breply\">Well, really bright is subjective in the city, but yes I can see Sirius from where I am.</span><br>\n<br>\n<span class=\"text\">So you know what it’s called.</span><br>\n<br>\n<span class=\"breply\">I do horoscopes sometimes~ I can recognize the zodiac constellations and the major stars. You can’t see most of them in the city, but they’re up there.</span><br>\n<br>\n<span class=\"text\">Of course you do horoscopes. Why am I not surprised.</span><br>\n<br>\n<span class=\"breply\">Is there a point to this, sensei? It’s late and I’m sleepy <span class=\"x1F62A\"><span class=\"hide\"></span></span></span><br>\n<br>\n<span class=\"text\">I’m getting there.</span><br>\n<br>\n</p>\n<p>Gen snorts and settles into a cross-legged position.</p>\n<p class=\"messagebody\">\n<span class=\"text\">Sirius is the brightest star in the sky because it’s the closest star to earth relative to its luminosity. It would outshine our sun over 20 times. And it’s always been the brightest star, so people have been curious about it since the dawn of mankind.</span><br>\n<br>\n</p>\n<p>Gen stares up at the little star speck in the sea of flat black above him. Even with the light pollution, it’s visibly brighter than the other stars in Orion’s belt.</p>\n<p class=\"messagebody\">\n<span class=\"text\">Since you’re into astrology, I’m sure you know stories about Sirius.</span><br>\n<br>\n<span class=\"breply\">Of course. Canis Major. The dog star. The Greeks called it Orion’s dog. Ancient Persians associated it with Tishtrya, a rain-maker. Chinese mythology calls it the star of the celestial wolf. Native Americans had references to it in their culture as well.</span><br>\n<br>\n<span class=\"text\">Yeah, so it’s been important for a while.</span><br>\n<br>\n<span class=\"breply\">Thousands of years.</span><br>\n<br>\n<span class=\"text\">Right. People have been charting its path for a long time. But in 1844, a German astronomer discovered that it had been deviating from its path since 1755. He theorized that an unseen mass was affecting the path Sirius had been on for thousands and thousands of years.</span><br>\n<br>\n<span class=\"breply\">I see.</span><br>\n<br>\n<span class=\"text\">It wasn’t until 1862 that researches found Sirius B, a white dwarf in Sirius’s shadow. White dwarfs are dying stars with low-to-medium mass. So this massive, ancient star was being affected by the gravity of a tiny, dying star that we didn’t even know about.</span><br>\n<br>\n</p>\n<p>Gen props one elbow on the window sill and leans his cheek on his hand, peering up at the little twinkle of Sirius in the distance, considering Sensei’s words. It’s interesting, but he can’t figure out why Sensei is telling him this now.</p>\n<p class=\"messagebody\">\n<span class=\"breply\">And you’re telling me all this because…?</span><br>\n<br>\n<span class=\"text\">I just thought it was interesting.</span><br>\n<br>\n<span class=\"text\">How things can change. Even our perceptions of things.</span><br>\n<br>\n</p>\n<p>Blinking, Gen rereads the message several times. Is...is Sensei trying to encourage him? Unbidden, a smile curls the corners of his mouth.</p>\n<p class=\"messagebody\">\n<span class=\"breply\">I guess you’re right, sensei~ you never know what’s gonna come along and change your path. A tiny, dying star, or a bad day.</span><br>\n<br>\n<span class=\"breply\">Or a wrong number.</span><br>\n<br>\n</p>\n<p>It takes a second for Sensei to respond.</p>\n<p class=\"messagebody\">\n<span class=\"text\">Don’t get sentimental on me. I didn’t mean anything by it.</span><br>\n<br>\n<span class=\"breply\">I know, I know~ that would be way too sweet for someone like you.</span><br>\n<br>\n</p>\n<p>Gen glances back up at the sky, still smiling softly, and can’t help imagining Sensei, somewhere out there, looking up at the same little glowing dot.</p>\n<p class=\"messagebody\">\n<span class=\"breply\">So I won’t say thank you.</span><br>\n<br>\n<span class=\"text\">Good. I’ll talk to you later.</span><br>\n<br>\n<span class=\"breply\">Goodnight, sensei.</span><br>\n<br>\n</p>\n<p class=\"messagebody\">\n<span class=\"text\">No.</span><br>\n<br>\n<span class=\"breply\">Just a hard no? Surely there’s room for debate.</span><br>\n<br>\n<span class=\"text\">Within our lifetime, A.I. will not reach the point of true autonomy, so, no, consensual sex with a robot isn’t possible.</span><br>\n<br>\n<span class=\"breply\">I’m realizing that I forgot you’re a high schooler and I shouldn’t be discussing sex with you in any capacity.</span><br>\n<br>\n<span class=\"text\">I’m not a child.</span><br>\n<br>\n<span class=\"breply\">You’re literally a child!! By definition!!</span><br>\n<br>\n<span class=\"text\">Fine, we don’t have to talk about it, but I’m only interested in the scientific morality of the whole thing.</span><br>\n<br>\n<span class=\"breply\">Sex with robots or sex in general?</span><br>\n<br>\n<span class=\"text\">Sex with robots.</span><br>\n<br>\n<span class=\"breply\">If A.I. can’t be fully autonomous, then does it matter that it’s not consensual?</span><br>\n<br>\n<span class=\"breply\">Omg, what’s wrong with me?? Don’t answer that!! This conversation is cancelled.</span><br>\n<br>\n<span class=\"text\">You sure? You seem interested.</span><br>\n<br>\n<span class=\"breply\">I don’t really want to get into morality with you anyway, sensei. I get the feeling you and I won’t agree about the entire school of philosophy.</span><br>\n<br>\n<span class=\"text\">Why? I think philosophy is important.</span><br>\n<br>\n<span class=\"breply\">But?</span><br>\n<br>\n<span class=\"text\">But it bores me.</span><br>\n<br>\n<span class=\"breply\">There we go.</span><br>\n<br>\n<span class=\"text\">It’s all talk and speculation. There’s nothing in philosophy that can be tested.</span><br>\n<br>\n<span class=\"breply\">And I know you hate that.</span><br>\n<br>\n<span class=\"text\">The philosophers can sit in their ivory towers and talk themselves hoarse. I’d prefer to be on the ground actually figuring things out.</span><br>\n<br>\n<span class=\"breply\">Of course you would, sensei~ that’s what makes you so charming~</span><br>\n<br>\n<span class=\"text\">I can sense your sarcasm.</span><br>\n<br>\n<span class=\"breply\">Me~? Sarcastic~? Never~!</span><br>\n<br>\n<span class=\"text\">Anyway, I never said that people weren’t going to have sex with robots regardless, but without complete autonomy, the entire question of consent is moot.</span><br>\n<br>\n<span class=\"breply\"><span class=\"x1F62C\"><span class=\"hide\"></span></span></span><br>\n<br>\n</p>\n<p class=\"messagebody\">\n<span class=\"breply\">What do you MEAN you’ve never seen Alien???</span><br>\n<br>\n<span class=\"text\">Do you want me to apologize??</span><br>\n<br>\n<span class=\"breply\">Do you have a rabb.it account? Make one. Now.</span><br>\n<br>\n</p>\n<p class=\"messagebody\">\n<span class=\"text\">I’m waiting for this centrifuge to finish spinning. What’s up?</span><br>\n<br>\n<span class=\"breply\">I’m rearranging my apartment.</span><br>\n<br>\n<span class=\"text\">Oh?</span><br>\n<br>\n<span class=\"breply\">The feng-shui was really off. It was blocking all my chakras and I couldn’t stand it.</span><br>\n<br>\n<span class=\"text\">Oh.</span><br>\n<br>\n<span class=\"breply\">JK!! I don’t really believe in that stuff.</span><br>\n<br>\n<span class=\"text\">Ghosts are a maybe but Chinese spirituality is a definite no?</span><br>\n<br>\n<span class=\"breply\">For me at least. I’m just waiting for a phone call and needed to do something. I’m regretting it now though. I’m tired and sweaty but everything’s in the way so I have to finish :(</span><br>\n<br>\n<span class=\"text\">Do you live alone?</span><br>\n<br>\n<span class=\"breply\">I’m a working professional, sensei~! I pay alllll my own bills~</span><br>\n<br>\n<span class=\"text\">How old are you?</span><br>\n<br>\n<span class=\"breply\">Nosy!!</span><br>\n<br>\n<span class=\"text\">Sorry, I just didn’t think you were that much older than me.</span><br>\n<br>\n<span class=\"breply\">I’m not, but I’m not in high school.</span><br>\n<br>\n<span class=\"text\">College?</span><br>\n<br>\n<span class=\"breply\">I went right into the workforce. In a manner of speaking.</span><br>\n<br>\n<span class=\"text\"> I see.</span><br>\n<br>\n<span class=\"breply\">Are you planning to go to college?</span><br>\n<br>\n<span class=\"text\">Yeah. I’ve already got scholarship offers.</span><br>\n<br>\n<span class=\"breply\">Seeeeriously?? That’s great!! Where do you want to go?</span><br>\n<br>\n<span class=\"text\">Nosy.</span><br>\n<br>\n<span class=\"breply\">Sorry~! I got excited.</span><br>\n<br>\n<span class=\"text\">Why didn’t you go to college? You’re perfectly intelligent.</span><br>\n<br>\n<span class=\"breply\">Wow, high praise from the boy genius himself <span class=\"x1F644\"><span class=\"hide\"></span></span> but the truth is I already knew what I wanted to do with my life. I can do my own research and my brand of entertainment requires more hands-on experience than I’d be able to get in a classroom. I didn’t see any point in delaying my start for several years just to pay money to learn things I can learn on my own.</span><br>\n<br>\n<span class=\"text\">That makes sense. And you’ve clearly had some success.</span><br>\n<br>\n<span class=\"breply\">You could say that~ what do you want to make of yourself, sensei?</span><br>\n<br>\n<span class=\"text\">I’m going to space.</span><br>\n<br>\n<span class=\"breply\"><span class=\"x1F632\"><span class=\"hide\"></span></span></span><br>\n<br>\n<span class=\"text\">As soon as possible. I’m really only planning to go to college for networking purposes. Getting on a manned space mission requires knowing the right people.</span><br>\n<br>\n<span class=\"breply\">Oh, I know alllll about networking~ you’ll have to do something about that abrasiveness of yours, sensei.</span><br>\n<br>\n<span class=\"text\">What abrasiveness?</span><br>\n<br>\n<span class=\"breply\">Not everyone likes a know-it-all.</span><br>\n<br>\n<span class=\"text\">What about you?</span><br>\n<br>\n<span class=\"breply\">Well, clearly I don’t mind, since I’ve been texting you for a year now.</span><br>\n<br>\n<span class=\"text\">Oh, it has been a year, hasn’t it?</span><br>\n<br>\n<span class=\"breply\">Sorry, I don’t remember the exact day :(</span><br>\n<br>\n<span class=\"text\">February 3rd.</span><br>\n<br>\n<span class=\"breply\">Wow.</span><br>\n<br>\n<span class=\"text\">I have good numerical recall.</span><br>\n<br>\n<span class=\"breply\">Clearly. I’m touched you bothered to file our anniversary in your enormous brain.</span><br>\n<br>\n<span class=\"text\">Don’t be. It’s not every day I misread my dad’s new number and text a complete stranger about Niels Bohr.</span><br>\n<br>\n<span class=\"breply\">Well, for what it’s worth, I’m grateful.</span><br>\n<br>\n<span class=\"text\">For what?</span><br>\n<br>\n<span class=\"breply\">For Bohr-chan of course! He advanced the study of quantum physics significantly!!</span><br>\n<br>\n<span class=\"text\">Right. Thanks, Bohr.</span><br>\n<br>\n<span class=\"breply\">Thank you, Bohr-chan~!</span><br>\n<br>\n</p>\n<p>Gen catches segments of the shuttle launch broadcast on his phone during breaks from rehearsal. He has a big show coming up, so he can’t afford to take a day off, but he’s determined to watch because he’s positive Sensei will want to talk about it later.</p>\n<p>The commentators talk about a lot of stuff Gen doesn’t really understand, but he gets the gist of it, and he manages to catch the take-off livestream. He texts Sensei right afterward.</p>\n<p class=\"messagebody\">\n<span class=\"breply\">That’ll be you someday!</span><br>\n<br>\n</p>\n<p>Accompanied by a screenshot from the launch. But then he has to return to rehearsal, so he powers his phone off and slides his gloves on.</p>\n<p>A few hours later, on the train home, Gen checks his phone and is surprised to see no response from Sensei. He shrugs it off. It’s not like they’re in constant contact, after all. Sensei has his own life.</p>\n<p>So he doesn’t think about it that evening, or the next morning when his phone is still quiet. By the end of that day, however, Gen can’t help feeling a little concerned. He would have sworn Sensei would be all over the shuttle launch, and he certainly isn’t shy about texting Gen when he’s excited about random scientific minutiae. So why the radio silence now?</p>\n<p>He decides he’ll give it another day. He’s pretty busy himself, after all: preparing for his show, writing his next book, fielding interview requests, etc. After his first book took off, his career really accelerated, but he doesn’t have time to rest. The entertainment industry is always moving and he can’t afford to be left behind.</p>\n<p>So he puts his phone away and opens his laptop to respond to some emails.</p>\n<p>Another day turns into two, into three, four--then a week has gone by with no word from Sensei. Gen tries not to feel hurt. It’s not like this is the longest they’ve gone without speaking to each other, but he’d been <em>so</em> sure Sensei would want to gush about the shuttle, and he’d been looking forward to sharing that excitement with him for reasons he doesn’t really want to examine.</p>\n<p><em>Sensei is a student</em>, Gen rationalizes, sitting on his bed, knees to his chest, staring at his dark phone on the duvet in front of him.<em> He probably just got busy with school</em>. </p>\n<p>The sun is mostly gone, nothing but a thin haze of orange on the horizon, but his room is lit by strands of string lights crisscrossing the walls haphazardly, a decision he made when he rearranged his apartment a while back. He kept the bed by the window, though, and every time he looks outside at night, he finds Sirius in the sky, recalling Sesnsei’s dry explanation so many weeks ago. It’s comforting in a way he can’t explain.</p>\n<p>Now, he glances out the window, at the darkness overtaking the sky, and a thought occurs to him.</p>\n<p class=\"messagebody\">\n<span class=\"breply\">Sensei, can you see the ISS in the sky?</span><br>\n<br>\n</p>\n<p>He vaguely recalls hearing something about the ISS looking like a star from earth but he can’t remember the details. Could something so comparatively small really be visible from the surface?</p>\n<p>After a whole week of nothing, Gen isn’t really expecting a response, so when his phone vibrates a minute later, he jumps.</p>\n<p class=\"messagebody\">\n<span class=\"text\">Yes, but not for very long.</span><br>\n<br>\n<span class=\"breply\">What do you mean?</span><br>\n<br>\n<span class=\"text\">Due to the way it’s orbiting earth, when it is visible, it looks like it’s moving very fast. It moves from horizon to horizon very quickly, so there’s not much to look at.</span><br>\n<br>\n<span class=\"breply\">Seeeriously? Can you see it from Japan?</span><br>\n<br>\n<span class=\"text\">Not tonight, and probably not from the city. In the suburbs, maybe</span><br>\n<br>\n<span class=\"breply\">Not tonight? Did you look it up?</span><br>\n<br>\n<span class=\"text\">I know the schedule.</span><br>\n<br>\n</p>\n<p>Gen can’t quite put his finger on it, but something seems off about Sensei tonight. Usually, he’d be chomping at the bit to explain the ISS’s orbit in excruciating detail, but he’s being shorter than usual. It’s hard to get a read on someone who’s not physically in front of him, but Gen’s been talking to Sensei long enough that he’s pretty sure he can tell when something’s up.</p>\n<p>That being said, what can he even do about it? It’s not his business, not really. But when he factors in Sensei’s week-long absence, he just can’t shake the concern.</p>\n<p>Fuck it, he thinks.</p>\n<p class=\"messagebody\">\n<span class=\"breply\">Is something wrong, sensei?</span><br>\n<br>\n</p>\n<p>He tosses the phone to the other side of the bed and glares out the window. This is stupid. He shouldn’t feel this nervous. Sensei didn’t hesitate prying into his personal life that one time, did he? They’re friends, in a weird way, and don’t friends ask about each other?</p>\n<p>All rationalizations aside, he grits his teeth when his phone buzzes a minute later.</p>\n<p class=\"messagebody\">\n<span class=\"text\">No. Sorry I disappeared for a week.</span><br>\n<br>\n</p>\n<p>Nothing, predictably. Sensei isn’t the type to be open with his feelings, Gen knows that much for sure. But something is obviously bothering him. Should Gen push it or let it go?</p>\n<p class=\"messagebody\">\n<span class=\"breply\">Yeah I was really lonely <span class=\"x1F622\"><span class=\"hide\"></span></span></span><br>\n<br>\n<span class=\"breply\">I thought you’d want to talk about the shuttle launch. I made sure to\nwatch it just for you~</span><br>\n<br>\n<span class=\"text\">I caught bits of it.</span><br>\n<br>\n<span class=\"breply\">Pretty cool, huh~?</span><br>\n<br>\n<span class=\"text\">Of course.</span><br>\n<br>\n</p>\n<p>God, this is like pulling teeth. Gen pushes his hair behind his ear and tries again.</p>\n<p class=\"messagebody\">\n<span class=\"breply\">Didn’t you say your father was studying to go to space? How is that going?</span><br>\n<br>\n<span class=\"text\">Pretty well.</span><br>\n<br>\n<span class=\"breply\">That’s great!! Maybe you two will be able to go together!</span><br>\n<br>\n<span class=\"text\">Maybe.</span><br>\n<br>\n</p>\n<p>Gen pouts. If Sensei really doesn’t want to talk, he could just not respond. But then, since he’s still responding, as stilted as the conversation is, that probably means he does want to talk to someone but he doesn’t feel like getting into his personal problems. With that in mind, Gen starts typing.</p>\n<p class=\"messagebody\">\n<span class=\"breply\">You know, there’s a lot of interesting psychology associated with space travel.</span><br>\n<br>\n<span class=\"text\">I bet.</span><br>\n<br>\n<span class=\"breply\">It’s hard to study, since the sample size of people who have actually been to space is so small, but it’s important to understand the effects space travel has on the human brain.</span><br>\n<br>\n<span class=\"breply\">Not just isolation studies either! We already know that isolation is dangerous for humans, but even when groups are in space together, problems can occur.</span><br>\n<br>\n<span class=\"text\">Infighting?</span><br>\n<br>\n<span class=\"breply\">Sometimes, but what happens more often is that people start closing themselves off. It’s literally called psychological closing, and it can happen in several ways. After a while, groups on orbit will sometimes communicate less with mission control. They’ll basically close ranks on their group and develop a very exclusive attachment to each other, shutting out those that they don’t perceive as sharing their experiences. It’s usually just a response to group stress and works itself out after a while.</span><br>\n<br>\n<span class=\"text\">I see.</span><br>\n<br>\n<span class=\"breply\">But psychological closing can happen to individuals too. Astronauts can sometimes self-isolate and stop communicating effectively. It’s easy to understand why. I can’t imagine a more stressful job <span class=\"x1F630\"><span class=\"hide\"></span></span></span><br>\n<br>\n<span class=\"breply\">Once you’re up there, one member of your group autonomizing can be a big problem, so there are measures in place to encourage team unity! Astronaut teams are encouraged to celebrate birthdays and holidays together and make calls to mission control as a group, as well as contact loved ones as much as possible.</span><br>\n<br>\n<span class=\"text\">Are you trying to tell me something?</span><br>\n<br>\n<span class=\"breply\">Oh, I could never presume to tell YOU anything, sensei~! I just thought it was interesting. The fact that humans need to be social is so well-established that they have rules to make sure it happens in space~ how cool is that~?</span><br>\n<br>\n<span class=\"text\">It just seems inconvenient.</span><br>\n<br>\n<span class=\"breply\">Even so, you can’t get around it. NASA agrees with me. You can’t go to space if you’re anti-social. The personality tests will flag you.</span><br>\n<br>\n<span class=\"text\">I guess that makes sense.</span><br>\n<br>\n<span class=\"breply\">So you might want to rethink your ambitions, sensei.</span><br>\n<br>\n<span class=\"text\">Excuse me?</span><br>\n<br>\n<span class=\"breply\">Someone who cuts off communication when stressed and evades questions about their well-being doesn’t seem like a good match for spaceflight in my humble opinion.</span><br>\n<br>\n</p>\n<p>Sensei’s text bubble pops up and disappears a few times. Gen watches it, chewing his bottom lip.</p>\n<p class=\"messagebody\">\n<span class=\"text\">Good thing no one asked your opinion, then.</span><br>\n<br>\n<span class=\"breply\">¯\\_(ツ)_/¯</span><br>\n<br>\n<span class=\"text\">Anyway, you’re being a hypocrite.</span><br>\n<br>\n<span class=\"breply\">Oh, I’m so sowwy about that, sensei! I’ll do better next time~!!</span><br>\n<br>\n<span class=\"text\">You know, you’re really annoying sometimes.</span><br>\n<br>\n<span class=\"breply\">We have that in common.</span><br>\n<br>\n<span class=\"text\">For the record, I am not anti-social.</span><br>\n<br>\n<span class=\"breply\">Have you spoken to your irl friends about your problem?</span><br>\n<br>\n<span class=\"text\">There’s no problem.</span><br>\n<br>\n<span class=\"breply\">Okay, sensei~ I believe you~</span><br>\n<br>\n<span class=\"breply\">But just in case you ever do have a problem, I promise I’ll only judge you a little bit.</span><br>\n<br>\n<span class=\"text\">There’s no problem.</span><br>\n<br>\n<span class=\"text\">But.</span><br>\n<br>\n<span class=\"text\">I suppose I was in need of a bit of a distraction.</span><br>\n<br>\n<span class=\"breply\">Well, I’m nothing if not distracting. It’s kind of my specialty.</span><br>\n<br>\n<span class=\"text\">So, I guess I should say thanks.</span><br>\n<br>\n<span class=\"breply\">For what~?</span><br>\n<br>\n<span class=\"text\">For Niels Bohr, of course.</span><br>\n<br>\n<span class=\"breply\">Right! Thanks, Bohr-chan!</span><br>\n<br>\n<span class=\"text\">Thanks.</span><br>\n<br>\n</p>\n<p>Gen huffs out a laugh and turns his gaze back to the window. The stars are finally starting to blink awake in the night sky and Gen tilts his head, imagining a little streak of light rocketing across the horizon somewhere on earth.</p>\n<p class=\"messagebody\">\n<span class=\"breply\">Omg, I’m so tired!!!</span><br>\n<br>\n<span class=\"text\">What are you doing up this late?</span><br>\n<br>\n<span class=\"breply\">What are YOU doing up this late??</span><br>\n<br>\n<span class=\"text\">Working.</span><br>\n<br>\n<span class=\"breply\">Good little students should be in bed~</span><br>\n<br>\n<span class=\"text\">I’m not interested in being a good student and you didn’t answer the question.</span><br>\n<br>\n<span class=\"breply\">If you must know, I was working too.</span><br>\n<br>\n<span class=\"text\">Right, your mysterious job you don’t want me to know about.</span><br>\n<br>\n<span class=\"breply\">Exactly~ though I kind of wish I could tell you, because I have a LOT to complain about.</span><br>\n<br>\n<span class=\"text\">You manage to complain just fine while being secretive.</span><br>\n<br>\n<span class=\"breply\">Noooo, you have no idea how lucky you are. I could be complaining way more.</span><br>\n<br>\n<span class=\"text\">I guess there are things I wish I could be more specific about.</span><br>\n<br>\n<span class=\"breply\">I’ll listen to anything you want to say, sensei.</span><br>\n<br>\n<span class=\"text\">So you can put it in your notes and use it to try and read my mind later? No thank you.</span><br>\n<br>\n<span class=\"breply\">How mean!! I don’t need notes to read your mind.</span><br>\n<br>\n<span class=\"text\">That just makes me want to tell you even less.</span><br>\n<br>\n<span class=\"breply\"><span class=\"x1F622\"><span class=\"hide\"></span></span></span><br>\n<br>\n<span class=\"breply\">Are you really up working?</span><br>\n<br>\n<span class=\"text\">I’ve got some chemicals heating and I misjudged the time and can’t leave.</span><br>\n<br>\n<span class=\"breply\">Aww. How much longer will it take?</span><br>\n<br>\n<span class=\"text\">It’s hard to say. An hour?</span><br>\n<br>\n<span class=\"breply\">Seeeeriously??? To heat up some chemicals??</span><br>\n<br>\n<span class=\"text\">They’re volatile. I can’t rush it.</span><br>\n<br>\n<span class=\"breply\">Want me to stay up with you?</span><br>\n<br>\n<span class=\"text\">You don’t have to do that.</span><br>\n<br>\n<span class=\"breply\">It’s fine~ do you have your laptop? We could watch something.</span><br>\n<br>\n<span class=\"text\">I do.</span><br>\n<br>\n<span class=\"text\">I’m serious. You said you were tired so you should go to bed.</span><br>\n<br>\n<span class=\"breply\">But I’d rather stay up with you, sensei~</span><br>\n<br>\n<span class=\"text\">Why?</span><br>\n<br>\n<span class=\"breply\">What do you mean why? I like talking to you. Why do you think we’ve been texting for over a year?</span><br>\n<br>\n<span class=\"breply\">Or could it be <span class=\"x1F622\"><span class=\"hide\"></span></span> you don’t like talking to me??</span><br>\n<br>\n<span class=\"text\">No</span><br>\n<br>\n<span class=\"text\">I mean, no, I like talking to you</span><br>\n<br>\n<span class=\"breply\">Good~! <span class=\"x1F338\"><span class=\"hide\"></span></span></span><br>\n<br>\n<span class=\"breply\">What do you want to watch?</span><br>\n<br>\n<span class=\"text\">Whatever you want.</span><br>\n<br>\n</p>\n<p>Gen doesn’t give the future of their arrangement much thought. Whatever happens will happen, he figures. He kind of wants to meet Sensei some day, but he’s not in a rush, and he can’t imagine Sensei is too invested in meeting the stranger he texted accidentally and just kept talking to for some reason. What they’ve got works for them, and that’s all that matters.</p>\n<p>Maybe they’ll meet up someday, maybe they’ll gradually lose contact, or maybe they’ll keep texting each other forever. Regardless, they’ve got time to work it out. </p>\n<p>They’ve got time.</p>\n<p>They were fighting. Arguing about something stupid. A science fiction movie that just hit theaters. Gen accused Sensei of being pedantic and Sensei responded that Gen just had poor taste. A variation on an argument they’d had dozens of times before. Gen just rolled his eyes, shoved his phone in his pocket, and charged onstage, ignoring the text notification that buzzed right as he started his act. Let Sensei talk to himself for a while.</p>\n<p>He should have checked.</p>\n<p>That’s all he can think as the world goes black and cold around him.</p>\n<p>He should have checked his phone.</p>\n<p>After the initial drama dies down and he’s already been conned into physical labor in the pursuit of electricity, he realizes that something about Senku seems very...familiar.</p>\n<p>He doesn’t have much time to ponder the situation, especially when he’s too busy being murdered, but even then, lying on the floor of a hut and making absurd promises with a madman, Senku’s confidence strikes a chord somewhere inside him. He almost asks, as Senku helps him quietly slip his robe back on.</p>\n<p>\n<em>Have we met before?</em>\n</p>\n<p>But they’re short on time, and besides—Gen would definitely remember meeting someone as unique as Ishigami Senku.</p>\n<p>He knows that Taiju and Yuzuriha are plants, of course; that much was obvious to him from the moment he first met them, soon after he was de-petrified, even before he knew anything about their supposedly dead friend. Nothing on them, though. They were doing an admirable job of playing the grieving-but-accepting converts to Tsukasa’s empire. Gen is simply uniquely suited to picking up on that sort of thing. As a result, he has to be careful how he interacts with them after he returns from the village. Spending too much time with them would tip his hand, but avoiding them would be equally suspicious.</p>\n<p>Yuzuriha, at least, seems to understand what Gen’s presence means. Most of the empire knows he was sent to check on Senku’s status, and as one of the only other people who knows Senku is alive, Yuzuriha must realize that Gen’s report means he’s switched sides. Taiju seems oblivious to the whole thing, which is probably for the best.</p>\n<p>When he’s not with Tsukasa, Gen often finds himself helping Yuzuriha with whatever she’s doing, usually sewing. After a childhood spent making his own costumes, Gen isn’t completely useless with a needle and thread, which is more than can be said about most of the people in Tsukasa’s empire.</p>\n<p>It’s during one of these sessions that Yuzuriha asks: “Is there someone you’d like to find, Asagiri-san?”</p>\n<p>It’s not exactly a taboo topic of conversation, even if everyone knows Tsukasa’s policy on depetrification, and people will sometimes speculate about the whereabouts of loved ones, or even appeal to Tsukasa if they think they know someone who would be a good fit for the Empire. Gen himself hasn’t given it too much thought. His family wasn’t exactly in the picture 3700 years ago. His manager can just wait as far as he’s concerned. And as for friends—</p>\n<p>He really only had one.</p>\n<p>“Not really,” he chirps in response, eyes on the felling stitch between his fingers. “I’ve always been fine on my own.”</p>\n<p>“Oh, I see. That’s a good thing, I guess.” Yuzuriha’s tone dips and Gen looks up to find her smiling sadly, gaze distant. “I worry about my parents a lot. It can be distracting.”</p>\n<p>It can’t be easy for her, Gen realizes. On top of everything that’s happening, she’s still grieving the loss of almost all the people she ever knew. Taiju was an orphan, and most of the people in the empire are fine with Tsukasa’s philosophy, so she doesn’t really have anyone to relate to. In an effort to encourage camaraderie with one of his few allies, Gen finds himself saying: “Well, there is one person.”</p>\n<p>She perks up curiously. “Who?”</p>\n<p>“A friend. Well, I suppose I would call him a friend.” Gen smiles wryly. “I never actually met him.”</p>\n<p>“What do you mean?” she wonders, scooting forward slightly.</p>\n<p>Gen feels himself flush inexplicably. He’s never actually discussed Sensei with anyone. How would he have even explained it? <em>One day, this guy texted me by mistake and I texted him back and we just never stopped?</em> Talk about pathetic. Not to mention, it was kind of...private. Sensei was like this secret refuge from the rest of the world and Gen didn’t want to ruin that. Now, though, there was no reason to be precious about it.</p>\n<p>“It’s kind of funny, actually,” he hums after a moment. “We only met because he texted the wrong number. Isn’t that strange?” he chuckles. “Anyone else would have just blocked the number and forgotten about it, but, well, things happened and—” he shrugs. “Truly, a friendship for the modern era. But I never even found out where he lived, so finding him would be...impossible.” Gen’s smile freezes on his face, the truth of that statement sinking in for the first time. Given the nature of their relationship and how the world has changed, the probability that he’ll ever talk to Sensei again is...incredibly low.</p>\n<p>“Wait—” Yuzuriha is frowning. “He texted you by mistake? And then you kept texting? For how long?”</p>\n<p>“Oh—uh—” Gen composes himself. “A little over a year, if I remember correctly.”</p>\n<p>Her eyes widen.</p>\n<p>“Isn’t that silly?” Gen continues, laughing intentionally. “Even thinking about that kind of thing seems so crazy now!”</p>\n<p>“Asagiri-san,” she says seriously. “You’re...a performer, right?”</p>\n<p>He blinks at the sudden shift in tone. “Among other things.” He returns her intense stare. “I thought you knew of me before the incident, Yuzuriha-chan.”</p>\n<p>“I thought I did, too,” she mutters. “I think I still do.”</p>\n<p>“What do you mean?”</p>\n<p>“Asagiri-san,” she says slowly. “Do you think—”</p>\n<p>“Gen-kun!” A familiar, sickly sweet voice cuts her off and they both jump, turning to see Hyouga striding toward them.</p>\n<p>“Hyouga-chan!” Gen greets, passing his work to Yuzuriha wordlessly and rising, dusting himself off. Yuzuriha nods politely and returns to her sewing. “How can this humble metalist help you today?”</p>\n<p>“Tsukasa-kun wants to speak with us.” Hyouga’s shrewd eyes rake him up and down and Gen represses a shudder of unease.</p>\n<p>Tucking his hands into his sleeves, Gen smiles and pushes all thoughts of Sensei out of his head. “Lead the way, then.”</p>\n<p> </p>\n<p class=\"messagebody\">\n<span class=\"breply\">Sounds like a lot of hassle</span><br>\n<br>\n<span class=\"text\">Yeah, troubleshooting has been a real bitch.</span><br>\n<br>\n<span class=\"breply\">Do you have people who can help you?</span><br>\n<br>\n<span class=\"text\">A couple. They’re eager, but not really as technically-minded as I am.</span><br>\n<br>\n<span class=\"breply\">Wow, so polite from the guy who calls people idiots at the slightest infraction.</span><br>\n<br>\n<span class=\"text\">One of them is definitely an idiot, but he’s useful in his own way.</span><br>\n<br>\n<span class=\"breply\">What about your father? Isn’t he a professor?</span><br>\n<br>\n<span class=\"text\">Not really the hands-on type, and even his understanding of the theories I’m working with is shaky. Hence why he needs to STUDY</span><br>\n<br>\n<span class=\"breply\">Well, I’d be no help at all. Unless you like card tricks!</span><br>\n<br>\n<span class=\"text\">Eh.</span><br>\n<br>\n<span class=\"breply\">That’s all I can offer, sensei <span class=\"x1F622\"><span class=\"hide\"></span></span></span><br>\n<br>\n<span class=\"text\">I’m sure I’d figure out something for you to do. You don’t seem completely unintelligent.</span><br>\n<br>\n<span class=\"breply\">When it comes to that kind of thing, I’m totally hopeless.</span><br>\n<br>\n<span class=\"text\">I can teach you.</span><br>\n<br>\n<span class=\"breply\">I’m not sure if that’s sweet or calculating.</span><br>\n<br>\n<span class=\"text\">Science can always use extra hands. Sometimes literally.</span><br>\n<br>\n<span class=\"breply\"><span class=\"x1F613\"><span class=\"hide\"></span></span></span><br>\n<br>\n<span class=\"breply\">I’m amazed anyone hangs out with you.</span><br>\n<br>\n<span class=\"text\">Childhood friends are obligated.</span><br>\n<br>\n<span class=\"breply\">How unexpectedly wholesome~!</span><br>\n<br>\n<span class=\"text\">You better not be profiling me based on this information.</span><br>\n<br>\n<span class=\"breply\">Me~? I would never!!</span><br>\n<br>\n<span class=\"breply\">But I never read you as a total loner anyway, sensei. You’re far too well-adjusted.</span><br>\n<br>\n<span class=\"text\">List the qualities that make you think I’m well-adjusted so I can eliminate them.</span><br>\n<br>\n<span class=\"breply\">I can’t give up all my secrets, sensei~!</span><br>\n<br>\n</p>\n<p>Things happen very quickly after the assault on Ishigami Village.</p>\n<p>Gen’s ruse is up, which is fine by him, all things considered. Tsukasa’s empire was a stressful place to be, and he wasn’t much use as a spy with no way to pass information. He feels a flicker of concern for Taiju and Yuzuriha, but he trusts that Tsukasa won’t do anything to them. It isn’t his way.</p>\n<p>Being with Senku is way more interesting, anyway. The kid’s intellect is dizzying. If Gen wasn’t already convinced of his lunacy by the carving he left outside of the Cave of Miracles, or his momentous victory in bringing electricity to the dark world, Senku’s cell phone declaration would have sealed it. As impossible as it sounds, however, Gen can’t help but believe it. If anyone can reinvent cell phones in the stone world, it’s Ishigami Senku.</p>\n<p>Gen almost laughs wondering what Sensei would have to say about the whole situation. He’d probably agree with Senku: <em>if you just follow the steps, you’ll definitely get there</em>. He was always very utilitarian like that.</p>\n<p>If there’s a drawback to joining the kingdom of science, it’s that it’s harder not to think about Sensei when he’s around Senku. On bad days, the way Senku talks, his intense and confident tone, echoes Sensei so much that it sits like a physical ache in Gen’s chest. On good days, the similarities are almost comforting, a touch of the familiar in a vast sea of the unknown. Dwelling on the matter is pointless, of course, but he can’t help it.</p>\n<p>Senku’s excitement in the face of a challenge, his encyclopedic knowledge of science and natural processes, his eagerness to educate everyone around him, his smirking sarcasm— it’s all so <em>familiar</em>. Sometimes Gen can hardly stand it, but he can’t stay away.</p>\n<p>What makes it even harder is that Senku seems just as interested in <em>him</em>. They’re all very busy, and Senku isn’t overt or anything, but Gen wasn’t a semi-famous psychic for nothing, and he can tell when Senku is intrigued by something.</p>\n<p>For as much as Senku rolls his eyes at Gen’s abilities, he always seems to be around when Gen is doing tricks for the village kids (and Ginrou), watching with sharp eyes and a wry smile. He refuses when Gen offers to teach him some sleight-of-hand but pays close attention when Gen demonstrates anyway.</p>\n<p>“There’s no shame in liking magic tricks, Senku-chan,” Gen says at one point, dropping the handful of nuts he just conjured into Senku’s palm. “They may even come in handy someday.”</p>\n<p>“I’m not ashamed,” Senku replies, pulling a tool from his waist pouch and using it to crack the hard hull of one of the nuts. “And it’s not that I particularly like magic tricks or anything.” He offers the shelled nut to Gen. “Watching you just kind of reminds me of someone, that’s all.”</p>\n<p>Ears perking up, Gen accepts the nut and rolls it between his fingers. “<em>Someone</em>? I never expected the great chief of the kingdom of science to consort with <em>magicians</em>.”</p>\n<p>“I consort with you, don’t I?”</p>\n<p>“I’m a mentalist with magic powers, Senku-chan. There’s a difference.” Gen pops the nut in his mouth and smiles as he chews.</p>\n<p>“Right, my mistake.” Senku busies his hands cracking the rest of the nuts.</p>\n<p>Gen watches him carefully. “Did you know this person well?”</p>\n<p>Senku shrugs. “Pretty well, I guess.”</p>\n<p>“You guess?”</p>\n<p>Senku glances up, a crooked smile making his eyes glitter. “Nosy.”</p>\n<p>A shock zips up Gen’s spine. “Sorry,” he sings, betraying nothing. “You just make me <em>so</em> curious, Senku-chan!”</p>\n<p>“There’s nothing to be curious about.” Senku discards the empty shells and offers the rest of the nuts to Gen, who barely has time to hold his hands out to accept them.</p>\n<p>“Trust me, if I could stop, I would,” Gen laughs, juggling his new handful of nuts.</p>\n<p>Senku smiles and opens his mouth like he’s about to say something, but Chrome shouting from the lab distracts them both and the matter is dropped.</p>\n<p>Christmas comes, bringing the first major test of the components for their cell phone, and as Gen blinks in awe at the illuminated tree, Senku steps up beside him.</p>\n<p>“Why take the time?” Gen wonders.</p>\n<p>He feels more than sees Senku shrug. “Nothing wrong with a little celebration. It pays to keep morale up.”</p>\n<p>Gen smiles, watching Suika and the other kids run around excitedly, tugging the adults into their games, bathed in the light. “Of course, all in service to your vision.”</p>\n<p>“We’re all stuck with each other, more or less,” Senku says. “Sort of like castaways surviving together. Or astronauts. And even astronauts celebrated holidays together.”</p>\n<p>Gen blinks, a shiver of recognition flashing through him. He tucks his arms closer to his body, trying not to think of a time, thousands of years ago, that he made that exact point to someone in need of perspective.</p>\n<p>“Cold?” Senku asks.</p>\n<p>“Ah, a little,” Gen hitches his smile back up.</p>\n<p>“No wonder. It’s snowing, after all.”</p>\n<p>Gen casts a look at the little white specks drifting gently to the ground around them. “It actually feels like Christmas,” he chuckles.</p>\n<p>Senku grins at him before Suika drags him away.</p>\n<p>Senku’s birthday gift is no small feat, if Gen does say so himself. With both of the most scientific minds in the village away, it falls on him to do all the planning and technical work. He’s not a complete moron, but engineering isn’t exactly his wheelhouse. Regardless, with everyone’s help, they manage to get it done in time, and surprising Senku brings with it a rush so strong it makes Gen giddy enough to spill some of his true feelings.</p>\n<p>He plays it off, thankfully, and Senku takes it in stride.</p>\n<p>Once everyone else has retired, Gen hangs around, watching Senku fiddle with the telescope.</p>\n<p>“How’d I do?” he asks, tucking his hands into his sleeves against the chill coming in through the open roof. “I didn’t get a lot of time to test it.”</p>\n<p>Senku glances at him, smirking. “It’s pretty shoddy, but I’m actually impressed. It really magnifies. Where’d you learn telescope mechanics?”</p>\n<p>“I wouldn’t call myself an expert or anything, but I did once suffer through a very long lecture on the fundamentals of telescopics. The mirrors and lenses and all that.” Gen smiles at the contraption, remembering how irritated Sensei used to get when he called it <em>the Hubble Kaleidoscope</em> on purpose. “I just wrote down everything I remembered and Kaseki-chan did the heavy lifting.”</p>\n<p>Senku hums, peering through the eyepiece. “Well, it works. Mostly.”</p>\n<p>“High praise coming from you.” Gen steps up beside him, gazing up at the sky through the roof hatch. The stars are so much brighter now, in a world without artificial light, but he can still easily pick out Sirius, glowing the brightest of all of them. “Didn’t you say the positions of the stars have shifted?”</p>\n<p>“Some of them. Some are too far for the Earth’s tilt to mean much, but the skies definitely look different now.”</p>\n<p>“Well now, that’s a little melancholy, isn’t it? Kind of like the universe is saying things will never be the same again. ”</p>\n<p>Senku straightens up, hands on his hips, and considers the sky alongside Gen. “Don’t get too depressed, mentalist. Everything changes all the time.”</p>\n<p>“Yes, yes, I know,” Gen laughs quietly. “Sirius B comes along and messes everything up. Nothing is constant. You don’t need to comfort me, Senku-chan.”</p>\n<p>Beside him, Senku goes very still. Gen slides him a sideways look and finds that his expression has gone rigid. Even in the cold glow of the stars, Gen can see how tight his jaw is.</p>\n<p>After a beat, Senku seems to shake it off. “So you’re an astronomer too,” he says, not looking at Gen. “Pegged you as more the astrology type.”</p>\n<p>“Whatever gave you that impression?” Gen giggles. “But you’re right. Everything I know about astronomy was forced on me by a friend of mine. The same one who lectured me about telescopes, actually. I wonder if I could still do horoscopes with the new stars.” He frowns thoughtfully at the ceiling of light above them.</p>\n<p>“You could probably figure it out. Or make something up.”</p>\n<p>“Want to give it a try, Senku-chan?”</p>\n<p>“That kind of thing is a waste of time.”</p>\n<p>“Ah, yes, of course, of course.” Gen lowers his head, smiling at the floor. Senku is just...so much like Sensei. His heart gives a pang of longing and suddenly he can’t be in Senku’s gravity well anymore. “Well, I’ll leave you to it. Happy birthday, Senku-chan.” He turns to leave.</p>\n<p>“Gen—” Senku breaks off but Gen pauses his steps, looking up.</p>\n<p>“Something wrong?”</p>\n<p>“No, I just—” Senku scratches the back of his neck, brows furrowed and looking as uncertain as Gen has ever seen him. Backlit by the night sky, Senku’s eyes gleam like stars themselves. “I wanted to say thanks. I don’t think I said it before. So thanks.”</p>\n<p>Gen tilts his head. “For what?”</p>\n<p>“For—” Senku blinks, startled. He lowers his gaze, a small smile curling his lips. If Gen didn’t know any better, he’d say Senku looked sad. His lips move, like he’s mumbling to himself, but no sound escapes.</p>\n<p>“Senku-chan?”</p>\n<p>Senku glances up, expression back to his neutral smirk. “Don’t fish for compliments, mentalist. I’m not saying it again.”</p>\n<p>“Right.” Gen chuckles. “Goodnight, then.”</p>\n<p>Already turning away, Senku waves a dismissive hand. “‘Night.”</p>\n<p>Gen casts him one last searching look before descending the ladder.</p>\n<p> </p>\n<p class=\"messagebody\">\n<span class=\"breply\">I’ve been sitting in this tech meeting for so long my legs have fallen asleep and I’m about to follow. PLEASE distract me.</span><br>\n<br>\n<span class=\"text\">Did you know that the numbness of your limbs “falling asleep” isn’t due to lack of blood flow but actually pinched or compressed nerves?</span><br>\n<br>\n<span class=\"breply\">...no I didn’t know that. I always thought it was blood.</span><br>\n<br>\n<span class=\"text\">If you lose circulation to a limb, it will start decomposing.</span><br>\n<br>\n<span class=\"breply\">Yikes!!! Just like that?</span><br>\n<br>\n<span class=\"text\">The decomposition process starts as soon as the cells lose access to oxygen, which is delivered by the blood. So yeah, if you actually lost blood flow to your legs, they would rot off.</span><br>\n<br>\n<span class=\"breply\">Thanks, I’m awake now.</span><br>\n<br>\n<span class=\"text\">Thankfully, that’s not what’s happening when a limb falls asleep.</span><br>\n<br>\n<span class=\"breply\">So what about tourniquets and stuff? First responders use those all the time.</span><br>\n<br>\n<span class=\"text\">Tourniquets should only be used as a last resort. EMTs and doctors only use them if they’re willing to sacrifice the limb. Once circulation is gone, it’s incredibly difficult to reestablish it. Sometimes, that’s the only option, though.</span><br>\n<br>\n<span class=\"breply\">You’re seeeriously blowing my mind, sensei.</span><br>\n<br>\n<span class=\"text\">Want to know the truth about vitamins?</span><br>\n<br>\n<span class=\"breply\">Truth? What truth?</span><br>\n<br>\n<span class=\"breply\">Sensei?</span><br>\n<br>\n<span class=\"breply\">Sensei, I take vitamins! Don’t do this to me!!!</span><br>\n<br>\n</p>\n<p>Working closely with Senku on their deception plan is an experience.</p>\n<p>They spend several long hours alone together ironing out the details and even longer while Senku teaches Gen morse code. In the days leading up to Gen’s departure with the cell phone team, Senku drills him almost constantly, tapping messages onto his arm for him to decipher while they work.</p>\n<p>Despite the distraction of having Senku constantly nearby and <em>touching him</em>, Gen picks the language up quickly.</p>\n<p>Thanks to Senku’s rotten luck, several things go terribly wrong during the whole operation, but Senku’s equally strong grasp on his own fate drags them back from the brink of disaster.</p>\n<p>“I think you should let me do your horoscope after all,” Gen whines, slumping over the table after they finally hang up with Nikki. “I bet it’s like nothing I’ve ever seen.”</p>\n<p>Senku smiles grimly. “Maybe someday. Where are Magma and Chrome?”</p>\n<p>Gen buries his face in his hands. “We were cornered by Ukyo. I had to leave them to make it back in time. I don’t even know if they’re okay.” He bites his lip, still hiding his expression. He trusts that Ukyo won’t kill them, but if they get captured—</p>\n<p>“Alright—” hands on his shoulders pull him upright and start guiding him toward the ladder. “Bed time.”</p>\n<p>Startled, Gen drops his hands, unable to resist. “Ah—Senku-chan, it’s okay! We have to prepare, and I have to keep practicing for the next call—”</p>\n<p>“How long have you been up?”</p>\n<p>“How long have <em>you</em> been up?” Gen counters, knowing full well that Senku has barely rested since they split ways.</p>\n<p>“I haven’t been running through the woods for hours,” Senku shoots back. His grip is firm, his tone unyielding.</p>\n<p>“Don’t deflect.”</p>\n<p>“Suika!” Senku yells and the familiar melon rolls into view in the clearing below. “Make sure Gen goes to sleep.”</p>\n<p>“Got it!” she chirps, already racing over to scramble up the ladder.</p>\n<p>Gen shoots Senku a glare. “Sneaky.”</p>\n<p>“What can I say?” Senku shrugs. “I learned from the best.”</p>\n<p>Gen lets Suika herd him away, heart pounding.</p>\n<p>The Kingdom of Science knows no rest, and, after Chrome is confirmed captured, they have to move quickly. Between shifting the entire village closer to Tsukasa’s stronghold and using the cell phone to trick members of the Kingdom of Might, Gen barely has time to think. Despite the seemingly insurmountable odds, however, Gen never feels the fear he expects. He’s scared, of course; he’s seen Tsukasa and Hyouga’s power up close, but Senku does everything with a certainty that overwrites even bad luck, and it’s hard to feel hopeless when you trust someone so much.</p>\n<p>It’s trust that crams Gen into their paper tank alongside Senku, facing the full brunt of the Kingdom of Might head-on. It’s trust that drives him into the Cave of Miracles beside Senku when everything goes wrong. It’s trust that lets Senku take over the negotiations.</p>\n<p>And it’s trust that keeps him from panicking when Senku and Tsukasa go into the river. Senku wouldn’t die from something like that.</p>\n<p>He wouldn’t. Gen trusts that he wouldn’t.</p>\n<p>It’s a little while before he actually sees Senku again. Tsukasa’s injury needs immediate attention and Senku isn’t exactly unscathed. Plus there are a million things to do in the aftermath of the battle, but Gen eventually makes it to the cave where Tsukasa is being treated.</p>\n<p>Senku is fiddling with something when he gets there, Tsukasa sleeping more-or-less peacefully in front of him. He’s drooping wearily, but at the sight of Gen, he stands.</p>\n<p>Gen doesn’t have the energy to fake snide disinterest as he meets Senku in the middle of the cave. “Are you alright?” he asks, gripping Senku by the shoulders and eyeing him over. He looks scuffed and battered, one hand wrapped in bloody bandages, but it seems as though Kohaku’s report was correct and Senku wasn’t seriously injured.</p>\n<p>“I’m fine.” Senku grabs Gen’s wrists but doesn’t try to remove his hands. “Hyouga’s no big deal.”</p>\n<p>“I’m supposed to be the liar, remember?”</p>\n<p>Senku blows out a sound that’s almost like a laugh. “You saved my life, you know?”</p>\n<p>That brings Gen up short. He meets Senku’s gaze with furrowed brows. “What do you mean?”</p>\n<p>“Took a page out of your book.” Senku gestures to his abdomen. “I wrapped a sheet of batteries around my vitals. A spear-proof vest and stun gun all in one.”</p>\n<p>Gen stares at him. “Well—” he collects himself. “Then all that awful work was worth it, I guess.”</p>\n<p>“You guess?”</p>\n<p>“Don’t go stealing any more of my tricks. I’ll lose my niche.”</p>\n<p>“Don’t worry,” Senku chuckles roughly. “I’ll leave the near-death experiences to you from now on.”</p>\n<p>“Don’t say that—” Gen grips Senku a little tighter, the corner of his mouth twitching up. “With your luck, I’ll be a ghost by noon.”</p>\n<p>“As long as you hang around, that’s no problem. It’s not like you’re good for physical labor.”</p>\n<p>“So cruel!” Gen releases one of Senku’s shoulders to pinch his cheek. “You’re definitely getting haunted for that.” Deja-vu prickles at the back of his mind but he ignores it. This is Senku in front of him right now.</p>\n<p>“Don’t cry, mentalist,” Senku smirks.</p>\n<p>Gen blinks, realizing his expression had indeed crumbled and his eyes are wet. “Please, who would cry over you!” But his smile is wobbly. The hand on Senku’s face softens until it’s cupping his cheek.</p>\n<p>Senku’s sharp smile hardens into an intent line, his eyes blazing.</p>\n<p>“Forget about this—” Gen mutters before wrapping his arms around Senku’s neck and pulling him in. It’s not how Senku does things, he knows. This kind of overt display isn’t familiar for either of them, but after everything, Gen just needs something <em>solid</em>, just for a minute.</p>\n<p>After a suspended second of rigid stillness, Senku seems to relax, just a bit, and Gen feels Senku’s hands settle firmly on his back. Senku exhales, the air brushing Gen’s ear. “Don’t cry,” he mutters.</p>\n<p>Gen tightens his grip, ducking to press his face into Senku’s collar. “Not crying,” he insists, voice muffled.</p>\n<p>Hugging Senku is strange. It’s obvious that neither of them are really used to it, but when Senku presses his cheek against the side of Gen’s head and curls his fingers into the back of Gen’s robe, Gen thinks he wouldn’t mind staying in this weird, awkward circle of warmth forever.</p>\n<p>Of course, they can’t. Behind Senku, Tsukasa stirs, and the sound startles them away from each other. Shaking off the lingering emotional haze of the moment, Gen hurries past Senku, deeper into the cave.</p>\n<p>“Tsukasa-chan! I was so worried!”</p>\n<p>“Gen—” Tsukasa croaks. “I am glad to see you again, despite the circumstances.”</p>\n<p>“Oh, you always know just what to say.”</p>\n<p>And his little breakdown is forgotten in the face of everything they have to do.</p>\n<p> </p>\n<p class=\"messagebody\">\n<span class=\"text\">How do you make two people realize their feelings for each other?</span><br>\n<br>\n<span class=\"breply\">owo what’s this? Is Sensei experiencing the adolescent flutterings of ~love~?</span><br>\n<br>\n<span class=\"text\">Gross. Not me. Just two people I know.</span><br>\n<br>\n<span class=\"breply\">Do you know them well?</span><br>\n<br>\n<span class=\"text\">You could say that.</span><br>\n<br>\n<span class=\"breply\">And you know they like each other?</span><br>\n<br>\n<span class=\"text\">It’s painfully obvious.</span><br>\n<br>\n<span class=\"text\">To everyone but them, apparently</span><br>\n<br>\n<span class=\"breply\">And they’re your age, correct?</span><br>\n<br>\n<span class=\"text\">Yes.</span><br>\n<br>\n<span class=\"breply\">Hmmmmm</span><br>\n<br>\n<span class=\"breply\">Well, I’m afraid there’s nothing to be done, sensei!</span><br>\n<br>\n<span class=\"text\">I thought you’d have some sort of psychological trick I can use to make them get it over with.</span><br>\n<br>\n<span class=\"breply\">Sorry, sensei, but this kind of thing can’t be rushed.</span><br>\n<br>\n<span class=\"breply\">I could coach you on ways to manipulate them, but you like both of these people, right?</span><br>\n<br>\n<span class=\"text\">Unfortunately.</span><br>\n<br>\n<span class=\"breply\">So any trickery could backfire on your relationship with them. People like that have to work these things out for themselves. If it’s really affecting their lives, however, you should try to speak honestly about it with them.</span><br>\n<br>\n<span class=\"text\">I’m not sure what to say. That’s shockingly reasonable coming from you.</span><br>\n<br>\n<span class=\"breply\">Hey, I know real psychology and neuroscience! It’s not all cunning and manipulation all the time!!</span><br>\n<br>\n<span class=\"text\">I can see that now.</span><br>\n<br>\n<span class=\"breply\">Sensei is so mean!!!</span><br>\n<br>\n<span class=\"text\">I guess I just think they’d be happier if they got on with it.</span><br>\n<br>\n<span class=\"breply\">They probably would be, but they wouldn’t appreciate you meddling. Unless one of them comes to you for help, or you’re worried about them, you should stay out of it.</span><br>\n<br>\n<span class=\"breply\">You seem like the type who needs to be in control, so that will probably be hard for you, but give it a try.</span><br>\n<br>\n<span class=\"text\">Alright, enough profiling me. I didn’t come here for that.</span><br>\n<br>\n<span class=\"breply\">Am I wrong~?</span><br>\n<br>\n<span class=\"text\">This whole ordeal is more trouble than it’s worth.</span><br>\n<br>\n<span class=\"breply\">What, love?</span><br>\n<br>\n<span class=\"text\">Love, relationships, feelings in general.</span><br>\n<br>\n<span class=\"breply\">I’m not surprised that someone as driven as you would think that way.</span><br>\n<br>\n<span class=\"text\">I don’t have the patience for distractions like that.</span><br>\n<br>\n<span class=\"breply\">That’s fine, sensei! Nobody is going to make you fall in love.</span><br>\n<br>\n<span class=\"text\">From what I can tell, if it happens, it certainly won’t be up to me.</span><br>\n<br>\n<span class=\"breply\">Ah, yes, and you’d hate that.</span><br>\n<br>\n<span class=\"breply\">Since you need to be in control.</span><br>\n<br>\n<span class=\"text\">I’m warning you.</span><br>\n<br>\n<span class=\"breply\"><span class=\"x1F61A\"><span class=\"hide\"></span></span></span><br>\n<br>\n<span class=\"text\">And I’m warning that little gray box.</span><br>\n<br>\n<span class=\"breply\">You’re young, sensei. There’s no need to rush on this stuff. If you don’t wanna bother with it now, you don’t have to. No one’s pressuring you, are they?</span><br>\n<br>\n<span class=\"text\">As if I’d put up with something like that.</span><br>\n<br>\n<span class=\"breply\">High school is dangerous! You can never be too careful.</span><br>\n<br>\n<span class=\"text\">Yeah, you seem like the type that was bullied in high school.</span><br>\n<br>\n<span class=\"breply\">You come to me for advice and this is how you treat me?? So cruel!!!</span><br>\n<br>\n<span class=\"breply\">And I’ll have you know I was NOT bullied in high school.</span><br>\n<br>\n<span class=\"text\">Right.</span><br>\n<br>\n<span class=\"breply\">Which of us is supposed to be the psychology expert?</span><br>\n<br>\n<span class=\"text\">I’m really not sure anymore</span><br>\n<br>\n</p>\n<p>Merging with the Kingdom of Might goes smoother than anyone expected, probably due to Tsukasa and Senku’s obvious regard for each other. If Tsukasa trusts him, the rest of the empire is inclined to as well, even after Tsukasa is frozen, but Gen keeps an ear out for potential conflict.</p>\n<p>Fortunately, nothing arises that a little smooth-talking can’t fix, and keeping Yo and Magma pitted against each other effectively distracts them from potentially sowing discord among the others.</p>\n<p>Once plans for the Perseus are underway, Gen doesn’t see Senku as much. It’s to be expected, he figures. Senku is the brains behind the huge operation, after all, plus he’s reconnected with his old friends and doesn’t need to lean on Gen as a fellow modern man as much. Perfectly understandable. Gen tries not to think too hard about it.</p>\n<p>After a grueling day of digging the shipyard, Gen deposits Suika back at her hut and heads for the cave Senku has taken over for his drafting, a new stack of paper piled in his arms. As he approaches, the familiar sound of Taiju’s excited voice greets him and he pauses just outside the entrance, unable to resist the temptation to eavesdrop.</p>\n<p>“—know we’re busy, but things are way calmer now, so I think—”</p>\n<p>“Since when do you <em>think</em>?” Senku cuts in, and Gen’s ears perk up at his uncharacteristic harshness. Senku is biting and sarcastic, but Gen rarely sees him actually lose his temper. Now, though, he sounds truly irritated.</p>\n<p>“—we should try to find them,” Taiju continues, unperturbed. “I mean, it couldn’t hurt.”</p>\n<p>Gen hears the sharp scratching of pencil on paper but no response.</p>\n<p>“Dude,” Taiju tries after a second. “Come on. I <em>know</em> you miss them.”</p>\n<p>“So what? Everyone here is missing someone. What makes me so special?”</p>\n<p>“Senku—”</p>\n<p>“And where would I even start?” Senku barrels forward. “They could be anywhere in Japan. Or—there are Japanese speakers all over the world, they could be <em>anywhere</em>—you think I should waste time on a wild goose chase?” He huffs. “And that’s ignoring the fact that I have no idea what they look like.”</p>\n<p>“Aren’t you worried about them?”</p>\n<p>“Taiju, stop—”</p>\n<p>“I’m not a mind-reader like Gen, but I know you miss them. You have to! You were so close—”</p>\n<p>“That doesn’t change anything.” Senku sounds like he’s speaking through his teeth.</p>\n<p>“Surely, you’ve got some way to find them. Some detail or <em>something</em>—”</p>\n<p>“No.”</p>\n<p>“Everyone else is looking for statues they know, so why—”</p>\n<p>“Taiju, there’s nothing!” Gen jumps at the sudden vehemence in Senku’s voice. “Don’t you think I’ve tried to figure it out? Don’t you think if there was some chance of finding them, I’d have done it already? I’ve been over and over it and there’s nothing.”</p>\n<p>“So you’re just giving up?” As always, Taiju matches Senku beat-for-beat. “You’re probably the only person in the world who <em>could</em> find them with nothing and you’re not even going to try?”</p>\n<p>“I don’t want to talk about this anymore.”</p>\n<p>“You’re just cool with never seeing them again?”</p>\n<p>“I’ve never seen them at all!”</p>\n<p>“Senku, you always said you—”</p>\n<p>“Stop!”</p>\n<p>“Did you just turn those feelings off?”</p>\n<p>“Do I have any other options? Even after we re-establish society, the odds of us finding each other are virtually nothing! I can’t afford to sit around and—and <em>pine</em> like an idiot when there’s nothing to be done!”</p>\n<p>Gen stares at the ground, eyes wide. He’s never heard Senku this worked up, a painful mixture of anger and despondency that almost hurts to listen to. And the revelation that Senku had someone so important in his life that he now has no chance of seeing again—</p>\n<p>It strikes a familiar chord of sorrow that Gen thought he had buried completely.</p>\n<p>“Drop it,” Senku is saying, accompanied by the rustling of paper. “I don’t want to hear about this again.”</p>\n<p>Taiju growls and heavy steps sound on the stone. Gen has a brief second to arrange himself before Taiju is striding out of the cave, nearly bumping into him.</p>\n<p>“Oh, Taiju-chan!” Gen says, acting like he just walked up. “Sorry, I didn’t see you there.”</p>\n<p>Taiju just nods and maneuvers around him, stomping off down the path. Gen watches him go before ducking into the cave. “What put a bee in his bonnet?” he asks.</p>\n<p>Senku is hunched over his makeshift drafting table, body language closed, eyes down. “No idea,” he says mildly.</p>\n<p>Gen hums. “I brought more paper.”</p>\n<p>“Thanks. Just put it anywhere.”</p>\n<p>Settling the stack on a shelf, Gen glances over his shoulder at Senku’s tense figure. “Trouble in paradise?”</p>\n<p>Senku doesn’t react, reaching for a tool that looks like a handmade compass. “Don’t know what you’re talking about.”</p>\n<p>“Oh, you know—” Gen wanders closer, folding his hands together, “—I would just hate to see the stone world’s cutest couple break up over something silly. If you and Taiju-chan are having problems, I’m always willing to lend an ear.”</p>\n<p>“What makes you think we’re having problems?” Senku asks, not looking up.</p>\n<p>“Taiju-chan seemed <em>so</em> upset a minute ago, and you’re the only one in here. I don’t need to be a scientific genius to put two and two together.”</p>\n<p>“Your math needs work.”</p>\n<p>“The Kingdom of Science will surely crumble if two of our pillars are at odds! I’m only trying to—”</p>\n<p>“Gen—” Senku finally looks up, fixing Gen with a hard stare. “Let it go.”</p>\n<p>Gen regards him. Senku’s expression is firm. “Alright,” he relents. “It’s your business.”</p>\n<p>After a beat of intense eye-contact, Senku returns to his sketching, and the rough scratching of the pencil fills the silence between them. For a brief, insane second, Gen considers blurting out the truth, that he cares about someone he has no chance of meeting again, but that would just tell Senku that he was eavesdropping, and, besides, what would be the point? Commiseration? As if Senku has ever been interested in that. The last thing Gen wants is for Senku to think he pities him.</p>\n<p>So Gen shoves the urge aside and sweeps out of the cave.</p>\n<p> </p>\n<p class=\"messagebody\">\n<span class=\"breply\">That’s it! I’m quitting show business!!</span><br>\n<br>\n<span class=\"text\">Good for you. It’s about time.</span><br>\n<br>\n<span class=\"breply\">Sensei, do you know how to kill someone and make it look like an accident?</span><br>\n<br>\n<span class=\"text\">Are you seriously asking?</span><br>\n<br>\n<span class=\"breply\">Yes.</span><br>\n<br>\n<span class=\"text\">Oh boy. Strap in.</span><br>\n<br>\n<span class=\"text\">Injecting air directly into the blood will cause an embolism and is virtually undetectable in an autopsy. Staging a carbon monoxide leak is easy and looks like an accident. Potassium chloride is deadly and mimics a heart attack. Gradual lead poisoning is risky if you get caught part-way through, but it’s worked before. Aconite is only detectable through extremely in-depth analysis and you only have to use a little for it to be fatal.</span><br>\n<br>\n<span class=\"text\">Of course, people fall and die all the time, so if you see a chance, take it.</span><br>\n<br>\n<span class=\"breply\">Thanks, sensei. I’ll have to block you and delete this chat now.</span><br>\n<br>\n<span class=\"text\"> Finally, I’ll be free.</span><br>\n<br>\n<span class=\"text\">What made you decide to quit show business/commit murder?</span><br>\n<br>\n<span class=\"breply\">A man three times my age called me “sweetheart” and tried to touch my hair today </span><br>\n<br>\n<span class=\"text\">Oh. Ew.</span><br>\n<br>\n<span class=\"breply\">He’s lucky I’m so nice!! I almost cursed him on the spot, but then everyone would know it was me.</span><br>\n<br>\n<span class=\"text\">Right.</span><br>\n<br>\n<span class=\"text\">If you know his email, I could send him a virus or something.</span><br>\n<br>\n<span class=\"breply\">Aw, that’s so sweet, sensei~</span><br>\n<br>\n<span class=\"breply\"> But he’s a bit of a big name in the industry. You could trace him back to me. And that would ruin this fun mystery we’ve got between us.</span><br>\n<br>\n<span class=\"breply\">Plus this kind of thing happens all the time, unfortunately.</span><br>\n<br>\n<span class=\"text\">Let me know if you change your mind.</span><br>\n<br>\n<span class=\"breply\">You’ll always be the first person I turn to if I need to break the law.</span><br>\n<br>\n<span class=\"text\">Nothing illegal about sending an email.</span><br>\n<br>\n<span class=\"breply\"><span class=\"x1F914\"><span class=\"hide\"></span></span></span><br>\n<br>\n</p>\n<p>Senku seems to feel contrite about his argument with Taiju, and, a few days later, Gen catches him allowing Taiju to subject him to a massive hug, complete with manly sobbing and tearful gibberish, as always. It’s a heartwarming sight that Gen makes sure to mock Senku for mercilessly at the first available opportunity. Senku just smiles and snipes back and Gen is relieved that things seem back to normal.</p>\n<p>His relief turns to confusion when Senku tosses him what appears to be a thick paper envelope.</p>\n<p>“What’s this?”</p>\n<p>“Just open it.”</p>\n<p>Suspicious, Gen peels open the sachet and peers inside.</p>\n<p>“It’s not poison, mentalist,” Senku groans. “Just get on with it.”</p>\n<p>“When it comes to you, one can never be too careful, Senku-chan.” But Gen complies and tips the envelope over his hand. A thick stack of small papers lands in his palm, bound with twine, and Gen’s eyes widen. “A deck of cards?” he asks in disbelief.</p>\n<p>Senku shrugs. “Figured a lying gambler like you would need some at some point.”</p>\n<p>Nearly vibrating with excitement, Gen unties the cards and spreads them out, taking a quick mental count. It’s a full deck of 52 cards, plus 2 Jokers, made of some sort of stiffened paper, and complete with scientific terminology and little drawings on the face cards. He laughs when he notices the Jokers both sporting his petrification scars. “Did you draw these?”</p>\n<p>“Maybe.” Senku crosses his arms. “Is there something wrong with that?”</p>\n<p>“Of course not!” Gen sings. “I always forget how <em>very</em> talented you are, Senku-chan. A true renaissance man!”</p>\n<p>“Yeah, yeah.” Senku rolls his eyes.</p>\n<p>“Thank you,” Gen says earnestly. “They’re perfect.”</p>\n<p>Senku turns away, back toward whatever project he’s working on, and if Gen didn’t know better, he’d say the tips of Senku’s ears look red.</p>\n<p>Ryusui is a surprise. Ryusui reintroducing capitalism is less of a surprise, honestly, given what Gen surmised about the man upon first meeting him, but it’s no problem for Gen. After a few initial hurdles, he figures out how to make Ryusui dance to the preferred beat and all is well.</p>\n<p>He’s a little less adept at managing how affectionate Ryusui is compared to everyone else. It’s obvious that Ryusui is a lover of many things, an aspect that makes him easy to control, and that affection quickly spreads to his new comrades. Even Senku isn’t immune, unable to dodge all of Ryusui’s manly back slaps and excited hugs.</p>\n<p>Gen is no exception, though he’s better at staying an arm’s length away, trained from years around grabby entertainers and show business personalities. He can’t always escape, though, and he frequently finds himself with a muscular arm around his shoulders or unceremoniously hoisted off his feet if Ryusui deems it more efficient for whatever they’re doing.</p>\n<p>He endures it gamely, unable to deny that Ryusui has a magnetism that rivals even Senku’s in its ability to make people like him. Unfortunately, he has to draw a line when Ryusui absently reaches over to ruffle his hair while they’re all sorting a huge stack of newly made bolts, weeding out ones with too many imperfections.</p>\n<p>“Ah—” Gen ducks quickly away, still smiling. “Sorry, Ryusui-chan, but if you touch my hair, I <em>will</em> have to curse you.”</p>\n<p>“I see,” Ryusui says astutely. “I’ll keep that in mind.”</p>\n<p>A metallic clatter draws Gen’s attention to Senku, who has apparently tipped his basket of rejects over onto the table. “Everything alright, Senku-chan?”</p>\n<p>“Yeah,” Senku says shortly, righting his basket and scooping the little metal pieces back into it.</p>\n<p>“Don’t be scared, Senku,” Suika pipes up. “Gen can’t <em>really </em>curse people!” She aims her helmet at Gen, who can picture the wide, glistening eyes behind her thick lenses. “Right?”</p>\n<p>He smiles disarmingly at her. “Don’t worry, Suika-chan. I’d never put a curse on <em>you</em>.”</p>\n<p>“I’m not scared,” Senku insists, as though the very idea is preposterous. He glances at Gen, and Gen recognizes the calculating glint in his eyes. “Gen, did you go to college?”</p>\n<p>Gen blinks. Senku rarely requests personal information, and he never makes smalltalk. “Oh? Trying to dig up dirt on your favorite mentalist? I’m not sure if I should be flattered or frightened.”</p>\n<p>“Don’t be anything,” Senku scowls. “I didn’t mean anything by it.” And he returns to his sorting, brows pinched.</p>\n<p>Gen eyes him curiously. It’s not like Senku to get down. He regards that kind of wallowing as unproductive and refuses to engage in it, no matter how tired or disheartened he may be.</p>\n<p>But then Ryusui is grandstanding about something loudly right next to him and the moment is over.</p>\n<p>Gen trusts Senku’s abilities absolutely, but the prospect of sending him, Chrome, and Ryusui up in a handmade hot air balloon admittedly makes him a little nervous. He mentally recites Senku’s simplistic explanation of how the contraption works, along with what he remembers from Sensei’s little lectures on aviation and safe cruising altitudes but he just can’t talk himself out of his nerves.</p>\n<p>He’s standing to the side as they prepare for take-off, arms tucked close, watching, when his ruminations are interrupted by a now-familiar arm around his shoulders.</p>\n<p>“Don’t look like that, Gen,” Ryusui says jovially, as though he didn’t just nearly send Gen off his feet with his enthusiasm.</p>\n<p>“Look like what, Ryusui-chan?” Gen asks, smiling up at him.</p>\n<p>Ryusui gestures vaguely to his own face. “Like that.”</p>\n<p>“You must be seeing things. Perhaps you should stay down here after all—”</p>\n<p>“He’s looking, you know,” Ryusui interrupts, pointing surreptitiously at Senku, who seems absorbed in some complicated ropework on the basket.</p>\n<p>“What?”</p>\n<p>“If you’re nervous, he’ll be nervous.”</p>\n<p>Gen nearly scoffs at that. “That’s preposterous, Ryusui-chan. You clearly don’t know Senku-chan very well.”</p>\n<p>Ryusui shrugs, the motion jarring with one of his arms still wrapped around Gen. “Smile anyway. Who doesn’t want to be sent off with a smile?”</p>\n<p>“I’m always smiling, Ryusui-chan.”</p>\n<p>“Then fake it a little better.” And with a pat, Ryusui releases him, charging toward the hot air balloon.</p>\n<p>Gen watches him go with narrowed eyes.</p>\n<p>He doesn’t tell Senku to be careful, or wish him luck, because he would just say something pithy in response, but when Senku approaches him inexplicably right before lift-off, he heeds Ryusui’s words and pastes on a wide smile.</p>\n<p>“Aviation is a ladder, right?” Gen says, echoing something Sensei once told him. “I know it’s still far off, but this is a step toward space.”</p>\n<p>Senku blinks dumbly at him for a second before his face cracks with a crooked grin and he shakes his head. “No need for inspirational speeches, mentalist.”</p>\n<p>“Aw, isn’t that why you keep me around?”</p>\n<p>“Yeah, that’s the only reason.” He scratches the back of his head and gestures at the balloon slowly inflating behind him. “You’ll be next.”</p>\n<p>“Next?” Gen frowns.</p>\n<p>“I’ll get you up there with me sooner or later.”</p>\n<p>Gen gapes at him. “Th—that is a threat! I’m perfectly comfortable here on the <em>ground</em> where I’m not in danger of plummeting to my death at any moment, thank you very much!”</p>\n<p>Senku chuckles. “We’ll see.”</p>\n<p>“We won’t!”</p>\n<p>“Senku!” Chrome calls, waving wildly from the basket, Rysusui lounging artfully beside him. “Come on!”</p>\n<p>Before he realizes he’s doing it, Gen’s hand shoots out and wraps around Senku’s wrist. They both look down at it.</p>\n<p>“Uh—” face warming, Gen tries to pull away, but Senku catches him, clasping their hands together. He looks just as surprised as Gen when Gen meets his eyes.</p>\n<p>“This—” Senku starts, stops, swallows, tries again. “I’ll see you soon.”</p>\n<p>Gen’s grip tightens compulsively. “Yes. See you soon.” He hitches his smile back up. “One small step for man, and all that.”</p>\n<p>“Right.” Senku smiles and starts to step away.</p>\n<p>For a single, burning second, with now-ancient news stories of ballooning accidents and the long tragic history of the whole exploit running through his mind, Gen is consumed by the almost irrepressible urge to yank Senku back, grab him by that ridiculous hair and lean forward—</p>\n<p>Then Senku slides his hand out of Gen’s and Gen watches him walk toward the basket, breathless from the full-body insanity he just fought off.</p>\n<p>He’s still staring long after the balloon has risen into the sunrise.</p>\n<p> </p>\n<p class=\"messagebody\">\n<span class=\"text\">HI!!!! THIS IS TAHDOAIDFJ;LS</span><br>\n<br>\n<span class=\"breply\">Sensei? Are you alright?</span><br>\n<br>\n<span class=\"text\">NSJYS;SAL;Akskdhlssu</span><br>\n<br>\n<span class=\"breply\">???</span><br>\n<br>\n<span class=\"text\">Sorry about that. One of my friends took my phone.</span><br>\n<br>\n<span class=\"breply\">Oh?? Put them on! I’d love to talk to someone who can manage being friends with you.</span><br>\n<br>\n<span class=\"text\">Absolutely not. He’s an idiot and he’ll say unnecessary things.</span><br>\n<br>\n<span class=\"breply\">Well now I’m curious. What unnecessary things?</span><br>\n<br>\n<span class=\"breply\">Sensei?</span><br>\n<br>\n<span class=\"breply\">Aw, did you slip up~?</span><br>\n<br>\n<span class=\"text\">No, it’s nothing like that.</span><br>\n<br>\n<span class=\"text\">Stop making that face.</span><br>\n<br>\n<span class=\"breply\">What face? You don’t even know what I look like!</span><br>\n<br>\n<span class=\"text\">I can tell you’re smiling like an idiot.</span><br>\n<br>\n<span class=\"breply\"> No you can’t.</span><br>\n<br>\n<span class=\"text\">I can.</span><br>\n<br>\n<span class=\"breply\">Okay, you’re right.</span><br>\n<br>\n<span class=\"breply\">I’m smiling like this (¬‿¬)</span><br>\n<br>\n<span class=\"text\">Yeah, I knew it. And I only meant he would say random bullshit.</span><br>\n<br>\n<span class=\"breply\">Suuuuure, sensei. Whatever you say!!</span><br>\n<br>\n<span class=\"breply\">Why did he take your phone anyway? Just to text me?</span><br>\n<br>\n<span class=\"text\">Yes. He and one of my other friends found out that I’m texting you and they’re inordinately curious.</span><br>\n<br>\n<span class=\"breply\">I’m so flattered~!</span><br>\n<br>\n<span class=\"breply\"> I’d love to talk to your friends, sensei. Shame on you for keeping us apart!! </span><br>\n<br>\n<span class=\"text\">I don’t want you guys anywhere near each other.</span><br>\n<br>\n<span class=\"breply\">Well, we won’t be NEAR each other.</span><br>\n<br>\n<span class=\"text\">No.</span><br>\n<br>\n<span class=\"breply\">Don’t be so stingy! Worried I’ll steal them with my irresistible charm~?</span><br>\n<br>\n<span class=\"text\">Okay, that made me laugh. Tell me another.</span><br>\n<br>\n<span class=\"breply\">So cruel!!</span><br>\n<br>\n<span class=\"breply\">You know they’re just interested in your life, right sensei?</span><br>\n<br>\n<span class=\"text\">TOO interested.</span><br>\n<br>\n<span class=\"breply\">They seem like good friends and they just want to be included. You text me often enough that they’ve noticed, so naturally they’re curious about this mystery person you’re talking to. You have to admit, our acquaintance is a little...unusual. If it was MY friend, I’d want to make sure everything was above board too.</span><br>\n<br>\n<span class=\"text\">I don’t need to be monitored. They’re just being nosy.</span><br>\n<br>\n<span class=\"breply\">Aw, you don’t really think that. You’re lucky to have such caring friends.</span><br>\n<br>\n<span class=\"text\">Jealous?</span><br>\n<br>\n<span class=\"breply\">Sooooo jealous!!</span><br>\n<br>\n<span class=\"text\">Yeah. You should be.</span><br>\n<br>\n<span class=\"breply\">Tell your thieving friend I said hi!!!</span><br>\n<br>\n<span class=\"text\">He says hi back.</span><br>\n<br>\n<span class=\"breply\"><span class=\"x1F60A\"><span class=\"hide\"></span></span> <span class=\"x1F338\"><span class=\"hide\"></span></span></span><br>\n<br>\n</p>\n<p>The night after the balloon takes off, a few minutes after Senku’s check-in call from Ishigami Village (complete with an excited recount of their dangerous mid-air mishap), Yuzuriha sidles up to him, looking more nervous than usual.</p>\n<p>“Gen-san, can I talk to you?” she asks.</p>\n<p>He scans her covertly as he smiles. “Of course, Yuzuriha-chan. Whatever can I help you with?”</p>\n<p>“It’s not really—I don’t need—can you follow me?” she gets through the question haltingly, but she gets through it, and Gen surmises that her anxiety is secondary to her determination to have whatever conversation she’s trying to get out of him.</p>\n<p>He gestures with one of his sleeves. “Lead the way.”</p>\n<p>She takes him to the hut where her massive loom sits, currently still and silent, and flicks a few lights on, indicating for him to take a seat on a pile of furs in one corner. He does and watches curiously as she settles herself beside him, fidgeting.</p>\n<p>“Is everything okay?” he opens with.</p>\n<p>“Yes, everything’s fine!” she says quickly.</p>\n<p>“You seem very tense, Yuzuriha-chan.”</p>\n<p>“I am—I am, but—” she takes a deep breath. “I should have talked to you sooner, but—” she twists her fingers in her lap. “We’ve been so busy, and, to be honest, I—I was worried.”</p>\n<p>Gen cocks his head. “This sounds very serious.”</p>\n<p>“It kind of is. It really, kind of is, but I thought I was just imagining things and I had mostly decided to just leave it alone, but then Taiju told me about his fight with Senku and I—I—” she presses her hands flat against her thighs and levels Gen with an intense look. “Gen-san, a long time ago, you told me about someone you knew, before the event, that you only talked to through text, right?”</p>\n<p>Gen stares at her, his stomach curling unpleasantly. “Yes, I do remember mentioning that.”</p>\n<p>“Can you tell me more?”</p>\n<p>“More?”</p>\n<p>She nods. “As much as you can.”</p>\n<p>Gen shifts his weight. “Why do you want to know, Yuzuriha-chan? It’s really not a very interesting story.”</p>\n<p>“Gen-san—” her eyes are shining in the lamplight. “Please.”</p>\n<p>It’s an absurd request. Why would Yuzuriha care? Curiosity? Collecting blackmail material? As soon as the thought crosses his mind, Gen dismisses it. Whatever agenda Yuzuriha is working from, her intentions are pure. Anyone can see that. It’s in the earnest rigidness of her spine, the way she’s leaning forward slightly, the trembling of her lips.</p>\n<p>Gen sighs. “Very well. How could I refuse the request of such a cute girl?”</p>\n<p>And he tells her everything. The very first mistaken text, the strange non-relationship they developed, the gradual graduation to actual friends, the reluctant admissions of care, that last stupid, <em>stupid</em> argument—everything.</p>\n<p>It’s almost cathartic, in a way. Gen knows all about the mental benefits of therapy and counseling, the need humans have to <em>talk</em> about things, but he’s never been in a position to test any of that for himself. Now, spilling all of his memories of Sensei to Yuzuriha, he feels a little pressure leave his shoulders with every word. He’s tried so hard not to think about Sensei at all since the world ended, but now it all comes flooding back.</p>\n<p>Yuzuriha listens in rapt silence, each story pulling her body language tauter like a bowstring just waiting to loose a single, devastating arrow.</p>\n<p>When he catches himself choking up with frustration while recounting their last exchange, Gen clears his throat, folding his hands in his lap. “Well, that’s the long and short of it,” he finishes, smiling blithely at his captivated audience. “Nothing too crazy, I’m afraid.”</p>\n<p>Yuzuriha looks as though a sharp tap would shatter her all over the floor. “This—this Sensei person—you cared about him?” she asks tremulously.</p>\n<p>Gen taps his chin. “Yes, I suppose. As much as you can care for someone in that situation, anyway. Why are you so interested in this, Yuzuriha-chan?”</p>\n<p>“Gen-san, please be honest with me—” she leans forward so intently that Gen nearly startles backward. “Do you miss him?”</p>\n<p>“What—what is the point—”</p>\n<p>“<em>Please</em>.”</p>\n<p>Gen’s heart stutters in his chest. “Yes,” he confesses, holding her searing gaze. “He was my closest friend. I miss him all the time.” This time, the smile that curls his lips is thin and wry. “Pathetic, right?”</p>\n<p>She shakes her head, clasping her hands in front of her. “No, it’s not! It’s not! It’s wonderful!”</p>\n<p>“Wonderful?” Gen repeats. “I’m afraid I don’t see how—”</p>\n<p>“Gen-san!” She’s positively beaming now. “I know who Sensei is!”</p>\n<p>Gen blinks. “I’m...sorry? How is that possible?” But he can’t help the little bubble of hope that swells inside him.</p>\n<p>Yuzuriha laughs delightedly. “I could hardly believe it myself! The probability—it’s fate! It must be fate!” She bounces back on her heels. “Oh, he’s going to be so <em>happy</em>—”</p>\n<p>“Yuzuriha-chan, please, put me out of my misery,” Gen pleads, watching her with mounting trepidation. “Who is it? Do you know where he is? Can we find him?”</p>\n<p>She shakes her head, grinning. “We don’t need to find him! Gen-san—Sensei is Senku!”</p>\n<p>Gen’s breath freezes in his lungs. “What?” he rasps.</p>\n<p>She’s still jittering with glee. “This is so exciting! It’s kind of weird—you always seemed a little familiar to me, but I thought it was because I saw you on TV, and when you told me about your friend, I always wondered—but I thought that was too much of a coincidence! But still!” She beams at him. “Here you are! It’s—it’s nice to finally meet you!”</p>\n<p>Gen wants to protest, to explain that it’s simply not <em>possible</em> for Senku to be Sensei, but the words won’t come out. Because the puzzle pieces are assembling in an irrevocable cascade, one into another into another—Sensei’s father studying to go into space, Sensei’s two childhood friends with feelings for each other, Sensei’s obsessive pursuit of knowledge, Senku’s cryptic argument with Taiju—until Gen is faced with the whole picture.</p>\n<p>It’s unbelievable. But it’s undeniable. Sensei is Senku.</p>\n<p>Yuzuriha is still babbling excitedly but Gen can only stare at her, brain whirring as it tries to process this new reality.</p>\n<p>“What—” he starts after a second, and she breaks off instantly, leaning forward. “What do I do now?” he asks quietly.</p>\n<p>She tilts her head. “What do you mean?” Her eyebrows pinch together. “Are you okay? You look a little lost.”</p>\n<p>Gen laughs humorlessly. “I...I am lost. What am I supposed to do? What does this mean?”</p>\n<p>“Gen-san—”</p>\n<p>“I can still barely believe it—that kind of coincidence—is it even possible?”</p>\n<p>“It’s a miracle,” she insists.</p>\n<p>Gen squeezes his eyes shut for a second, and when he opens them again, he’s smiling. “Sorry, Yuzuriha-chan. I forgot myself for a minute there. I’m just so shocked!”</p>\n<p>She frowns. “Gen-san—”</p>\n<p>“Thank you for telling me! What a crazy story, right?”</p>\n<p>“Gen-san, are you okay?”</p>\n<p>“Of course, Yuzuriha-chan!” Gen rises smoothly. “Anyway, we’ve had a long day. You should get some sleep. I’ll leave you alone—”</p>\n<p>She scrambles up beside him, catching his sleeve. “Gen-san—” her eyes are wide and glistening. “Are—are you going to tell him?”</p>\n<p>“If it comes up, I might mention—”</p>\n<p>“He really cared about you,” she interrupts, curling her fingers tighter into his sleeve. “<em>So</em> much. He talked about you all the time. And he misses you, I <em>know</em> he does. He’d be out there looking for you if, well, if it was possible—and even then, I know he wants to find you.”</p>\n<p>Gen keeps his gaze fixed carefully over her shoulder. “He wants to find his silly wrong number friend.”</p>\n<p>“That’s <em>you</em>!”</p>\n<p>“I don’t think it is anymore.”</p>\n<p>Her face crumples. “Gen-san—”</p>\n<p>“I need to think about this, Yuzuriha-chan,” Gen says honestly. “Thank you for telling me. I have been worried about what became of Sensei, and I’m relieved to know he’s okay. But I…I need to think.”</p>\n<p>After a tense second, Yuzuriha nods and releases him, clasping her hands against her chest. “I’ve wanted to be friends with you for so long, Gen-san,” she whispers. “Since before I even met you in Tsukasa’s camp. I’ll keep quiet to Senku if you want me to. And if you ever want to talk—” she offers him a watery smile. “I’m here.”</p>\n<p>“Thank you,” Gen forces out. Then he all but flees from the hut, his heart in his throat.</p>\n<p> </p>\n<p class=\"messagebody\">\n<span class=\"text\">Can you cook?</span><br>\n<br>\n<span class=\"breply\">ExCUSE me?</span><br>\n<br>\n<span class=\"breply\">The audacity. The gall.</span><br>\n<br>\n<span class=\"breply\">Can I cook??? Who do you think I am??</span><br>\n<br>\n<span class=\"text\">I have literally no idea who you are.</span><br>\n<br>\n<span class=\"breply\">That’s no excuse!</span><br>\n<br>\n<span class=\"text\">You haven’t answered my question.</span><br>\n<br>\n<span class=\"breply\">Because it’s preposterous! Of COURSE I can cook. I’ve been living by myself for years.</span><br>\n<br>\n<span class=\"breply\">Honestly sensei.</span><br>\n<br>\n<span class=\"text\">This is a lot of indignation for seemingly no reason</span><br>\n<br>\n<span class=\"text\">You’re not lying, are you?</span><br>\n<br>\n<span class=\"breply\">Sensei, I would NEVER lie to you.</span><br>\n<br>\n<span class=\"text\">Right.</span><br>\n<br>\n<span class=\"breply\">Name a time I lied to you.</span><br>\n<br>\n<span class=\"text\">I wasn’t disagreeing with you!</span><br>\n<br>\n<span class=\"breply\">Because it’s never happened!</span><br>\n<br>\n<span class=\"text\">So what kind of things do you cook?</span><br>\n<br>\n<span class=\"breply\">Why are you being so nosy all of a sudden?</span><br>\n<br>\n<span class=\"text\">Why are you avoiding the question?</span><br>\n<br>\n<span class=\"breply\">The nerve!! I’ve never been so insulted!!</span><br>\n<br>\n<span class=\"text\">Yeah, this is about how I expected this conversation to go.</span><br>\n<br>\n<span class=\"breply\">WHY are you asking?</span><br>\n<br>\n<span class=\"text\">My friends said I should ask you more questions about yourself.</span><br>\n<br>\n<span class=\"breply\">So you open with cooking? Are you interviewing a housekeeper?</span><br>\n<br>\n<span class=\"breply\">Wait, are you curious about me, sensei?</span><br>\n<br>\n<span class=\"text\">Did you miss the part where I said my friends put me up to this?</span><br>\n<br>\n<span class=\"breply\">Just admit you’re interested in me!</span><br>\n<br>\n<span class=\"text\">Unlike you, I don’t lie.</span><br>\n<br>\n<span class=\"breply\">But you’re fine with UNFOUNDED ACCUSATIONS, I see.</span><br>\n<br>\n<span class=\"breply\">Okay, fine.</span><br>\n<br>\n<span class=\"breply\">The truth is I can only do the basics. Enough to survive on, but I’m not a gourmet or anything.</span><br>\n<br>\n<span class=\"breply\">I’m really good at a few western dishes I learned in America though!</span><br>\n<br>\n<span class=\"text\">Now was that so hard?</span><br>\n<br>\n<span class=\"breply\">What about you? Can you cook?</span><br>\n<br>\n<span class=\"text\">Cooking is just science. I can do anything with a recipe.</span><br>\n<br>\n<span class=\"breply\">But what about ~experimentation~?</span><br>\n<br>\n<span class=\"text\">I’m not allowed to do cooking experiments anymore.</span><br>\n<br>\n<span class=\"breply\">Let me guess~you exploded your kitchen and your dad banned you.</span><br>\n<br>\n<span class=\"breply\">Sensei?</span><br>\n<br>\n<span class=\"breply\">That’s it, isn’t it?</span><br>\n<br>\n<span class=\"text\">Personal sharing time is over.</span><br>\n<br>\n<span class=\"breply\">Awwww <span class=\"x1F622\"><span class=\"hide\"></span></span></span><br>\n<br>\n<br>\n</p>\n<p>There’s plenty to do. With Senku, Chrome, and Ryusui away, a lot of leadership duties fall to him, so it’s not like Gen has time to dwell, especially once the farming effort starts in earnest.</p>\n<p>And yet, dwell he does.</p>\n<p>Yuzuriha, true to her word, keeps the whole thing to herself but can’t seem to resist shooting him baleful glances at least a few times a day. Gen just smiles and acts natural, but in private, he <em>dwells</em>.</p>\n<p>He can’t pin down how he feels about the whole thing, cycling through stages of frustration, anger, confusion, and mortification. Now that he’s on the other side of it, he realizes he <em>should</em> have known. All the signs were there, and hadn’t he felt instinctively that Senku was familiar to him? If only he’d trusted his gut and actually paid attention, he wouldn’t be boiling with humiliation and inexplicable dread.</p>\n<p>And Senku! Does he know? His argument with Taiju suggests he didn’t at first, but what about now? That probing question a few weeks ago—did he figure it out then? Gen knows he’s parroted things Sensei told him—would Senku remember well enough to pick up on that? Would he even care? Yuzuriha and Taiju both seem to think Senku misses his texting buddy, but does he? <em>Really?</em> What if he knows and he just doesn’t care? Maybe their quote-unquote relationship pre-petrification was only important to Gen—but no, that’s just destructive thinking. Senku had to like him at least a little, right? He wouldn’t have kept texting him otherwise. So Senku, straightforward, no-nonsense Senku, probably doesn’t know, but does that mean Gen should tell him? What would be the point? But Senku did seem worried when Gen overheard him in the cave—</p>\n<p>Questions and memories and justifications run around and around, arguing with each other and spinning Gen’s brain in circles as he lays awake at night, staring at the ceiling. But there’s no conclusion, no aha moment. All of Gen’s mentalist powers combined can’t conjure anything more substantial than a string of vehement curse words that plays like a record every time he thinks about the whole thing.</p>\n<p>And before he can get any further than that, Ryusui needs them to find his mysterious butler, who then takes off into the wilderness, basically forcing Gen to follow them all the way back to Ishigami Village because what else is he going to do? Let this strange tiny person wander the forest alone minutes after awakening from complete petrification? Gen might not want to see Senku right now but he’s not that cruel. (Plus he really can’t take Yuzuriha’s well-meaning smiles anymore.)</p>\n<p>“Been a while,” are Senku’s first words when Gen limps up to the group surrounding the makeshift oven while Francois, seemingly unperturbed by the long walk, inspects their sorry attempt at bread.</p>\n<p>Gen flashes him an exhausted smile. “We talked on the phone the day before yesterday.”</p>\n<p>Senku crosses his arms. “That’s not the same.”</p>\n<p>He’s right; now that Gen is back in Senku’s atmosphere, after the longest time they’ve spent apart in over a year, he feels like a moon settling back into orbit. He’d been so preoccupied with his own thoughts he failed to realize how much he missed the pressure of Senku’s gravity constantly at his side. A warmth where he didn’t even know he was cold. There’s really nothing like it.</p>\n<p>So Gen straightens up and grins. “I hope you didn’t have too much fun without me, Senku-chan.”</p>\n<p>“Oh, yeah, map-making, <em>so</em> fun.” Senku grins back and then they’re just standing there, grinning at each other like idiots.</p>\n<p>Until Gen clears his throat. “Anyway. Bread?”</p>\n<p>“Right. Bread.”</p>\n<p>Francois quickly proves to be the best possible addition to the kingdom. They’re competent, efficient, intelligent, and nice to Suika, so Gen takes to them quickly as well. The only downside is that Francois is way too perceptive and the third time they purposely leave a room so that Senku and Gen can be alone, Gen realizes he might have a problem.</p>\n<p>“Am I really that obvious, Francois-chan?” he asks, reaching for another handful of dried berries.</p>\n<p>Francois doesn’t even look up from the dough they’re kneading. “If you’re worried that the others have picked up on your feelings for Ishigami Senku, do not fear. I am merely attuned to slight shifts in behavior. It is my duty as a butler to read my master’s every whim, sometimes before even he is aware of it.”</p>\n<p>“Ah, I see.” Gen presses the berries into his own dough mechanically.</p>\n<p>“This concerns you?”</p>\n<p>“Well, it’s not really something I like to think about. Knowing that someone else knows—” he smiles blankly. “I’m not thrilled about that.”</p>\n<p>“Rest assured, I am the only one who has picked up on it.”</p>\n<p>“That’s somewhat of a relief, but, really, Francois-chan, you don’t have to play matchmaker.”</p>\n<p>“My apologies for any confusion, Asagiri-san—” Francois settles their dough in a perfect little mound and looks up, fixing Gen with a steady gaze. “My matchmaking hasn’t been in response to <em>your</em> feelings. I have been acting on Ishigami Senku’s desires.”</p>\n<p>Gen’s hands reflexively dig into the dough. “I’m sorry?”</p>\n<p>“Throughout my interactions with him, I have surmised that Ishigami Senku wishes to spend more time alone with you, thus I have endeavored to fulfill that desire whenever it is within my power to do so. Initially, I concluded that you share this wish as well. If I am mistaken, of course I will defer to you.”</p>\n<p>Gen stares at the dough squishing out between his fingers. “Excuse me?”</p>\n<p>“Again, my apologies. I thought you were aware.”</p>\n<p>“Aware.”</p>\n<p>“That Ishigami Senku enjoys spending time with you and wishes to do it more often. Unlike you, he is not so subtle in his desires.”</p>\n<p>Gen giggles, trying to keep it from sounding too manic, and presses the dough back into shape. “Of course he enjoys my company, Francois-chan. I’m a treasure and we’ve been, dare I say it, friends for over a year now.”</p>\n<p>“Asagiri-san, please don’t make me correct such a blatant attempt at falsehood.” Francois coolly sets their dough aside and powders the table with another pinch of flour. “You know as well as I that Ishigami Senku’s feelings for you exceed those of mere friendship.”</p>\n<p>Before Gen can process <em>that</em>, Chrome is running up, shouting something about pigs, and Gen can only go along helplessly.</p>\n<p>So Francois, one of the smartest people on the planet, probably even without the petrification, seems to be laboring under the delusion that Senku has distinctive non-friendship feelings for Gen. How unfortunate. How...distracting.</p>\n<p>Now his midnight ruminations have a whole new dimension to torture him with.</p>\n<p>Senku is all over the place these days, in the air and on the water, back and forth between the village and the ship-building site, always doing and thinking about a million different things, and it’s not like Gen isn’t busy too, so the amount of time they spend together varies wildly. Now that he’s painfully aware of it (courtesy of Francois) Gen can’t ignore how Senku tries to stay nearby. If he has to switch locations, he comes up with a reason for Gen to come along, and if they have to act separately, Senku arranges frequent phone calls, ostensibly for management purposes. It’s definitely helpful to coordinate their movements, but Gen thinks they spend too much time snickering like schoolboys over the line for it to be completely professional.</p>\n<p>“And what have we learned from this?” Gen asks, cheek propped on one hand.</p>\n<p>“Don’t let Ryusui ride the minecart unsupervised,” comes Senku’s droll, tinny reply.</p>\n<p>“Honestly, Senku-chan, that seems like common sense. I thought you were supposed to be a genius?” It’s way too late but Gen is still sitting on the floor of the observatory, listening to Senku recount an unfortunate incident at the mine, his face aching from smiling.</p>\n<p>“I can’t be on all the time.”</p>\n<p>“I guess that’s true. And Ryusui can be hard to handle.”</p>\n<p>“You don’t seem to have a problem.”</p>\n<p>“Oh my, Senku-chan, do I detect a note of bitterness?”</p>\n<p>“The quality of this phone isn’t high enough for you to detect anything, mentalist.”</p>\n<p>Gen laughs. “But I know you, Senku-chan.” <em>I know you</em>. <em>I’ve known you</em>. His smile freezes on his face.</p>\n<p>“Unfortunately,” Senku sighs. “Though I’d prefer you didn’t.”</p>\n<p>“Someone has to,” Gen forces out.</p>\n<p>There’s a faint rustling on the other end of the line, like Senku shifting his weight. “Everything okay over there?”</p>\n<p>“Of course, Senku-chan!” Gen says quickly. “Why wouldn’t it be?”</p>\n<p>“You sound weird.”</p>\n<p>“The quality of this phone isn’t high enough for you to—”</p>\n<p>“Yeah, yeah—” a short burst of static, like Senku huffing out a laugh right into the mic. “Such a comedian.”</p>\n<p>“I do my best.”</p>\n<p>“Hey, uh—” Senku clears his throat and Gen tilts his head, listening intently. “I’ll be back in a few days.”</p>\n<p>Gen’s stomach swoops involuntarily. “Okay? Everyone will be excited to see you.”</p>\n<p>“You—” more shuffling. Gen pulls the earpiece back to raise an eyebrow at it. “Anyway—uh, it’s late.”</p>\n<p>“Very observant, Senku-chan.”</p>\n<p>“Go to sleep, mentalist,” Senku says shortly, and before Gen can respond, the line goes dead.</p>\n<p>Gen squints at the blocky structure of the phone. What was all that about? With a sigh, he replaces the mic and the speaker in their cradles and pulls his blanket tighter around himself, turning his face into the starlight streaming in through the ceiling hatch.</p>\n<p>He has a place to sleep in the village proper, but when he’s here, he prefers to stay in the observatory. It’s strange being here without Senku, but it’s also the place in the village that feels the most like him. Even the thought makes him feel like a pining maiden, but all his efforts to switch his emotions off have have come to naught, so he just buckles down and lets the inconvenient longing wash over him.</p>\n<p>Above him, Sirius twinkles, a little out of place, and Gen wonders if Senku is looking at it too, so many miles away. It’s all so familiar. It’s all so new.</p>\n<p> </p>\n<p class=\"messagebody\">\n<span class=\"text\">You up</span><br>\n<br>\n<span class=\"breply\">Yes, but I shouldn’t be. The grind never stops, it seems. Why are you awake at this ungodly hour?</span><br>\n<br>\n<span class=\"text\">Got back late. Exploded</span><br>\n<br>\n<span class=\"breply\">What??</span><br>\n<br>\n<span class=\"breply\">What exploded?</span><br>\n<br>\n<span class=\"breply\">Sensei???</span><br>\n<br>\n<span class=\"text\">Rocket</span><br>\n<br>\n<span class=\"breply\">You exploded a rocket?? A small one, right?</span><br>\n<br>\n<span class=\"text\">Y</span><br>\n<br>\n<span class=\"breply\">Are you okay?</span><br>\n<br>\n<span class=\"text\">Tired</span><br>\n<br>\n<span class=\"text\">Ears hurt</span><br>\n<br>\n<span class=\"breply\">You should go to the hospital. What if you popped your eardrums?</span><br>\n<br>\n<span class=\"text\">Already did. I’m fine</span><br>\n<br>\n<span class=\"breply\">Okay, that’s good. Go to bed then.</span><br>\n<br>\n<span class=\"breply\">Jeez, you really scared me.</span><br>\n<br>\n<span class=\"text\">Sorry</span><br>\n<br>\n<span class=\"text\">Wanted to text</span><br>\n<br>\n<span class=\"text\">You</span><br>\n<br>\n<span class=\"breply\">I’m flattered, sensei. Please get some rest.</span><br>\n<br>\n<span class=\"text\">Wish you were here</span><br>\n<br>\n<span class=\"breply\">Oh dear. You’re going to be so irritated in the morning.</span><br>\n<br>\n<span class=\"breply\">But as long as we’re being honest.</span><br>\n<br>\n<span class=\"breply\">I wish I was there too.</span><br>\n<br>\n<span class=\"breply\">Sensei?</span><br>\n<br>\n<span class=\"breply\">Are you asleep?</span><br>\n<br>\n<span class=\"breply\">Good night, sensei.</span><br>\n<br>\n</p>\n<p>When Senku does arrive a few days later, as promised, he apparently does so in the middle of the night and in complete silence because one minute Gen is fast asleep in the observatory and the next he’s blinking awake to a hand on his shoulder and a voice in his ear.</p>\n<p>“Wake up, mentalist, we’ve gotta go.”</p>\n<p>“Go—what—?” Gen pushes himself up, squinting through the half-light and catching the glint of Senku’s crooked smile. “Senku-chan?”</p>\n<p>“Surprise.”</p>\n<p>Gen runs a hand over his eyes. “Trying to sneak up on me?”</p>\n<p>“Yeah, and it wasn’t easy.” Senku sits back on his heels, allowing Gen to push away the pile of blankets he’d amassed to ward off the encroaching chill of winter. “You weren’t in your hut. Why are you staying all the way out here?”</p>\n<p>He’s too drowsy for this, Gen laments, reaching for his outermost robe to hide the blush warming his cheeks. “No reason in particular.” He shrugs the robe over his shoulders, pulling it close. “I like looking at the stars as much as the next guy, and sometimes I fall asleep.”</p>\n<p>“Uh-huh.” The room is too dim for Gen to read Senku’s expression. “Well, come on, we’ve got places to be.”</p>\n<p>“Places?”</p>\n<p>Senku rises smoothly, offering a hand to help Gen up. “You’ll see.”</p>\n<p>Stomach fluttering, Gen accepts and allows Senku to pull him to his feet.</p>\n<p>A few minutes later, the fluttering turns to clenching.</p>\n<p>“Senku-chan, you meanie! You tricked me!”</p>\n<p>“How did I trick you?” Senku tugs on Gen’s arm but Gen plants his feet and refuses to move. “I never said <em>where</em> we were going!”</p>\n<p>“Don’t play that game with me! I’m the king of vague wording and you knew exactly what you were doing!”</p>\n<p>“Turnabout is fair play, mentalist!” Senku gives another fruitless tug. “What, mad because I got one over on you?”</p>\n<p>Gen glares. “Please, this hardly qualifies.”</p>\n<p>“Then why are you so pissy?”</p>\n<p>“Because—!” Gen gestures at the massive shape of the inflated hot air balloon tethered to the ground in front of them, so huge it blocks the view of the dark sky.</p>\n<p>“You gotta go up at some point!”</p>\n<p>“Why?” Gen demands.</p>\n<p>“If nothing else, just to say you did.”</p>\n<p>“I’m not nearly as vain as you seem to think I am.”</p>\n<p>“I will carry you into that basket if I have to,” Senku warns.</p>\n<p>Gen scoffs. “As if you could lift me.”</p>\n<p>“I’m not strong but I can handle your scrawny ass.”</p>\n<p>Gen turns his nose up haughtily. “Glass houses, Senku-chan.”</p>\n<p>“Gen—“ Senku takes a step into him. “I want to show it to you.”</p>\n<p>Gen blinks, taken aback, and Senku uses that moment of weakness to duck down and grab him around the waist.</p>\n<p>“What—“ The world tilts violently and before Gen can react, he’s slung across Senku’s shoulders in a fireman’s carry. He flails against the hands gripping his arm and wrapped around his leg. “Senku-chan!”</p>\n<p>“Give it up, mentalist,” Senku laughs, striding toward the the balloon without hesitation.</p>\n<p>“This is kidnapping!”</p>\n<p>“I’ll keep you safe, I promise.”</p>\n<p>Defeated, Gen hangs morosely over Senku’s shoulders. He knows that if he pushed the issue, Senku would give up, but he also recognizes that Senku would have given up sooner if he didn’t have a good reason to keep trying. The act allows both of them to save face. So, benevolent ally that he is, he permits Senku to deposit him in the basket and only glares a little as Senku swings inside after him.</p>\n<p>“Did you learn that from Kohaku-chan?” he asks snidely.</p>\n<p>Senku sets about untying the tether ropes. “She said it was the only way I’d ever be able to lift anyone.”</p>\n<p>“She’s probably right,” Gen mutters.</p>\n<p>The basket lurches slightly as it loses contact with the ground and Gen grabs the edge in a white-knuckled grip.</p>\n<p>“It’s alright,” Senku assures him. “I’ve got this. I do this all the time.”</p>\n<p>“Yeah, with Ryusui-chan or Chrome-chan.” Gen watches nervously as Senku severs the last rope and turns to stoke the fire. “What good am I going to be when we’re about to crash and die?”</p>\n<p>“I know how to handle it on my own now.” Senku grins. “And we won't be up for that long.”</p>\n<p>“Ah, yes, that makes me feel better.” Gen watches the ground sink away from them and has to fight the urge to curl up in a ball.</p>\n<p>“Just enjoy the ride, mentalist. Put it in your next book.”</p>\n<p>“If you can believe this, I’m not getting a lot of writing done out here, Senku-chan.” The basket bobs past the tree tops and a wave of vertigo washes over him. “Maybe once we solve the grand mystery and save all of humanity, I’ll pen a bestseller about the Prometheus of the new world and how he forced me into a hot air balloon against my will.”</p>\n<p>“Prometheus of the new world, huh?” Senku joins him at the edge of the basket, leaning way too casually against the wicker. “I kind of like that.”</p>\n<p>“Did you miss the part about how I’m going to reveal all of your horrible antics?”</p>\n<p>“Reveal away.” Senku waves a dismissive hand. “I’m not interested in being famous.”</p>\n<p>“I’m afraid you won’t have much choice in that.” Gen presses his lips together and nervously eyes the rapidly shrinking forest of shadows below them. “How does anyone get used to this?” he mutters.</p>\n<p>“Humans didn’t invent flight so they could stare at the ground,” Senku responds, his voice low and suddenly much closer than Gen was anticipating. A calloused hand cups his jaw and tilts his head up before Gen can resist. “Look up, mentalist.”</p>\n<p>A glint of light, sudden and bright, makes Gen squeeze his eyes shut, and when he blinks them open again, he’s greeted by glowing pinks and oranges, early morning hues spilling over the clouds as the balloon rises through them. Gen sucks in an involuntary gasp, crisp air filling his lungs, transfixed by the riot of sunrise colors stretching before him. The sun is still just a glimmer along the horizon, but the rays catch in the dips and rises of the clouds surrounding them, casting the balloon into a sea of light.</p>\n<p>It’s breathtaking.</p>\n<p>A familiar clicking flash jolts Gen out of his stupor and he whirls around in time to see Senku lowering one of Minami’s boxy cameras and grinning impishly.</p>\n<p>“Senku-chan, you <em>sneak</em>!” Gen shrieks. He lunges for the camera. “Give me that!”</p>\n<p>Senku ducks out of the way, jumping to the other side of the basket, crowing with laughter. “Nope! You’re too late! I got the new world’s first paparazzi shot of celebrity psychic Asagiri Gen!”</p>\n<p>“You’re gonna get my foot up your ass if you don’t give me that camera!”</p>\n<p>“If you run around too much, you’ll tip the basket!”</p>\n<p>Gen freezes instantly, grabbing the edge of the basket in terror.</p>\n<p>“I’m kidding, I’m kidding!” Senku rounds the furnace, eyes wide, and puts a hand on Gen’s shoulder. “The counterweights will keep the basket still, and neither of us weigh enough to—”</p>\n<p>Before he can finish, Gen snatches the camera out of his hand and leaps nimbly to the other side of the basket. He sticks his tongue out at Senku’s dumbfounded expression. “Don’t play with me, Senku-chan. You won’t win.”</p>\n<p>Senku blinks and huffs out a breath, sticking his hands on his hips. “I guess not.”</p>\n<p>Gen turns the camera over in his hands, frowning and fiddling with the little details. “It’s lighter than I thought it’d be.”</p>\n<p>“It’s basically just wood and a mirror.” Senku creeps hesitantly to his side. “Nothing like the ones we’re used to.”</p>\n<p>Gen examines the gears on the front of the camera. “I don’t think I’ve actually held one of these yet. Even though the whole thing was kind of my idea anyway.”</p>\n<p>“You’ve pretty much avoided the cameras altogether.” Senku crosses his arms and leans back against the edge of the basket, watching Gen shrewdly. “Don’t think I haven’t noticed.”</p>\n<p>“Oh, of course not.” Gen rolls his eyes. “Nothing gets past you, Senku-chan.”</p>\n<p>“I would have thought celebrity psychic Asagiri Gen would be first in line for the limelight.”</p>\n<p>Gen glances up at Senku, lips curling in a rueful smile. “Celebrity psychic Asagiri Gen doesn’t really exist anymore, Senku-chan. What good does the limelight do me now?”</p>\n<p>Senku returns his gaze, eyes glittering, face dyed half-pink in the pastel sunrise. “You’ve got a good point. Our old selves...they vanished thousands of years ago. I guess none of those people really exist anymore.” He cocks his head. “Still, a shallow man like you doesn’t want to be in the history books?”</p>\n<p>Tracing a nail over the smooth wood grain of the camera body, Gen looks back down into the lens, pursing his lips at the tiny, distorted version of himself reflected there. “I don’t really need people looking at me anymore,” he says thoughtfully. His former status has never really crossed his mind. Unlike Ryusui, eager to regain what he lost, and Francois, eager to return to the position they find most fitting, Gen has found himself content to use his skills for Senku’s benefit, furthering his plans. Before, he only sought notoriety because it was the best way to advance his craft while making a living. He enjoyed the attention, of course; he was young and cute, why wouldn’t he? But he never sought fame for fame’s sake. “I suppose I never really needed it,” he finishes quietly.</p>\n<p>“Why go for it in the first place, then?”</p>\n<p>“Sometimes life just take you where it takes you, Senku-chan,” Gen smiles. “Things happened, and suddenly I was in magazines and on TV. Don’t get me wrong—I liked it. I was being appreciated for my art, after all. But now—” Gen leans over to settle the bulky camera on the floor of the basket, careful despite his earlier protests. He doesn’t actually want to damage one of Senku’s survey instruments. When he straightens back up, Senku is eyeing him searchingly. “Now, <em>you</em> appreciate my hard work, right, Senku-chan?”</p>\n<p>One side of Senku’s mouth curls up in a slanted smirk. “Hell yeah.”</p>\n<p>Gen claps his hands together. “Then that’s all I need!” Giggling, he turns to face the sky, bracing his forearms on the rim of the basket and leaning out enough to let the wind ruffle his hair. “I’m a bit different behind the cameras, anyway. Wouldn’t you agree?”</p>\n<p>“I wasn’t a fan of yours or anything.” Senku scratches his cheek, shifting to face into the basket, one hand still resting on the edge, inches from Gen’s arm. “But I guess so. From what I saw, anyway. Always putting on a show.” He huffs out a breath. “Like how you used to be, when we first met.”</p>\n<p>“What can I say? Old habits die hard.” Gen tilts his head back, enjoying the brisk air on his flushed skin. “We all act differently when we’re being watched, I suppose. There’s a scienc-y term for that, isn’t there?”</p>\n<p>“In the broadest sense, yes, I guess that falls under the observer effect.”</p>\n<p>A chill that has nothing to do with the cold runs up Gen’s spine. “Yes, I’ve heard of that one,” he says evenly, keeping his eyes fixed on the cloud-scudded sky in front of him. “It’s different from the uncertainty principle, right? You wrote them on separate cards in my deck.”</p>\n<p>Senku lets out a quiet snort. “<em>Of course</em> they’re different. When you get down to it, they’re completely different phenomenons, so that confusion is mostly just ignorance.”</p>\n<p>Gen hums absently, heart pounding. He could tip the scales right now. Spill everything.</p>\n<p>Yuzuriha’s aggrieved face flashes across his mind.</p>\n<p><em>“That’s </em>you<em>!”</em></p>\n<p>\n<em>“I don’t think it is anymore.”</em>\n</p>\n<p>He’s not the person Senku texted accidentally. No matter what, he’ll never be him again. But—</p>\n<p><em>I guess none of those people really exist anymore</em>.</p>\n<p>With Senku’s own words ringing in his ears, Gen throws caution to the winds whirling past their balloon. “You know, I never did find out what exactly Neils Bohr had to do with all that.”</p>\n<p>“Oh, that’s easy—” Senku starts immediately, “—back when the theories were new, along with the entire concept of an observable quantum state, there was a lot of debate...about….” he trails off and Gen hears him inhale haltingly.</p>\n<p>Fighting to keep his expression neutral, Gen pushes himself upright and turns to face Senku directly, finding him staring wide-eyed at the floor. “Go on, sensei,” he says softly. “I want to hear the rest.”</p>\n<p>Slowly, Senku raises his head. “Is this a trick?” he asks, words so quiet they’re nearly snatched away by the wind.</p>\n<p>“Do you really think I’d do something so cruel?” Gen shoots back.</p>\n<p>“You—” Senku straightens up, one hand twitching abortively toward Gen. “You’re serious?”</p>\n<p>“Ten billion percent!” Gen smiles brightly to hide the nervous twisting of his stomach. “Quite a coincidence, huh, Senku-chan?”</p>\n<p>To his horror, Senku drops his head, pinching the bridge of his nose.</p>\n<p>“I know this probably isn’t what you expected,” Gen babbles, trying to cover the terrifying silence. “Believe me, I was surprised too—I would have mentioned it earlier, but you have to agree it’s a bit of a strange topic—and I apologize if you’re disappointed, but—”</p>\n<p>“Gen,” Senku rasps. “Just—be quiet for a second.”</p>\n<p>Gen snaps his mouth shut so quickly his teeth click together.</p>\n<p>Senku takes a few deep breaths. Tucking his hands into his sleeves anxiously, Gen watches Senku’s shoulders rise and fall, hardly daring to breathe himself. Then Senku’s shoulders stutter. Senku flattens both hands against his face and, actually, this is worse than the silence. Gen is seized with panic at the realization that he’s made the Prometheus of the new world cry.</p>\n<p>“Senku-chan, I—”</p>\n<p>“You absolute <em>bastard</em>—” Senku jerks his head up, revealing a wide, toothy grin.</p>\n<p>Gen blinks.</p>\n<p>“Do you have <em>any</em> idea how much I worried about you?” Senku demands. “I had no idea where to even look for you! I’ve been wracking my memory for clues, but that stupid rule we had—if only I’d been nosier, asked more questions—I thought I’d never see you again!”</p>\n<p>Me—me too!” Gen lurches forward, propelled by the sudden swell of joy in his chest, and grabs Senku’s shoulders. “I thought I’d never—I mean we never even sent each other pictures, so how could we—I–I missed you so much!”</p>\n<p>Senku grips Gen’s shoulders in response, still beaming. “I missed you too!”</p>\n<p>A laugh, wild and ecstatic, tumbles out before Gen can stop it. “The stupidest thing is—you always reminded me so much of Sensei. I should have realized, I should have—“</p>\n<p>Shaking his head, Senku tugs Gen in closer. “You seemed familiar too, and the way you talked, sometimes I could have <em>sworn,</em> but the odds of that—“</p>\n<p>“Astronomical,” Gen breathes.</p>\n<p>“I wouldn’t believe it was possible if it wasn’t happening right now!”</p>\n<p>“Sometimes—sometimes—“ Gen’s fingers curl into the material of Senku’s clothes, the soft hide bunching in his grasp, and meets Senku’s shining gaze with watering eyes. “Sometimes I could hardly stand it—you were <em>so like him</em>, it almost hurt, like you were reminding me how much I screwed up—“</p>\n<p>“We couldn’t have known—“</p>\n<p>“Of course not, but—“ Gen searches Senku’s face, taking it in like it’s the first time all over again. The sharp brow, the thin lips, the shrewd eyes, the jagged scars—it’s all Senku, but now, for the first time since he found out, Gen finally accepts that it’s Sensei as well. “Senku-chan, I just—I missed you so much!” Eyes swimming with tears, he pulls Senku in, wrapping his arms around his neck in their second ever hug.</p>\n<p>Senku responds instantly, embracing Gen tightly, and he’s so warm, hands like branding irons against Gen’s back. “I knew you,” he murmurs in Gen’s ear. “From the second I met you, I knew you. I always told myself it was impossible, that I was just deluding myself out of misery but—something inside me still knew.”</p>\n<p>Gen chokes out a laugh. “That was your heart, Senku-chan!”</p>\n<p>“Preposterous.” But when Senku leans back, his smile is the softest Gen has ever seen it. “Instinct, maybe. The odds that this would even happen—I still can’t wrap my head around it.”</p>\n<p>“Fate,” Gen suggests.</p>\n<p>“There’s no such thing as fate.”</p>\n<p>“Regardless, I think you’re my fate, Senku-chan.” Gen places his hands on Senku’s cheeks, framing his face. “How else do you explain us meeting against all odds <em>twice</em>? Out of a whole world, you texted me, and out of a whole country, Tsukasa found me to track you down. There’s good luck and then there’s <em>destiny</em>.”</p>\n<p>Senku rolls his eyes. “The circumstances are unbelievable, but to attribute them to concepts like fate and destiny is simply—“</p>\n<p>Gen cuts him off by leaning forward and pressing their mouths together, trapping the rest of Senku’s words between their lips.</p>\n<p>When he pulls back, Senku is staring at him, eyes wide and jaw slack.</p>\n<p>“Only you could miss such an obvious romantic set-up, Senku-chan,” Gen smiles coyly. “It’s not every day a cute boy tells you you’re his destiny, you know.”</p>\n<p>“You little—“ then there’s a hand on the back of his head and Senku is hauling him back in, sealing their mouths together again.</p>\n<p>Gen didn’t wake up that morning expecting to be kissing Ishigami Senku in a hot air balloon before the sun was even completely up, but now that he’s here, hands fisted in Senku’s collar, pressed against Senku’s chest, completely protected from the chill by the heat growing between them—Gen can’t imagine being anywhere else.</p>\n<p>“It’s always bothered me,” Gen says, a few hours later, watching Senku go through the process of developing the camera film in the lab. “Our last conversation.”</p>\n<p>Senku hums, submerging the plate in a vat of some chemical. “What about it?”</p>\n<p>“I didn’t get a chance to check my phone before I started my show.” Gen leans over the vat curiously. “And we were arguing. What did you send me?”</p>\n<p>“Oh, right.” Senku sets his little tongs aside and turns to face Gen, propping one hip against the table. “Just something about your unsalvageable taste and the tragedy of modern science fiction.”</p>\n<p>Gen laughs. “Yeah, I guessed as much.”</p>\n<p>Senku reaches out, tracing his fingers down the opening in Gen’s robe. Gen watches raptly as he pinches the material, absently dragging his thumbnail over the edge. “It always bothered me too,” Senku confesses lowly. “Thinking that was the last thing I ever said to you.”</p>\n<p>Heart thudding, Gen rests a hand on Senku’s wrist and steps into him. “Fortunately, you’ll have an infinite number of opportunities to berate me for my poor taste in the future.”</p>\n<p>Senku flicks his eyes up to Gen’s, a smirk creeping across his face. “You’re right. I’ll get started on that right away.”</p>\n<p>Gen giggles, pressing one sleeve to his mouth. “Please don’t hold back, sensei.” He starts, remembering. “Oh, that’s right. You must already know that I named your contact <em>Sensei</em> in my phone, but what did you call me? Something cute, right?”</p>\n<p>The hand on Gen’s robe stills. “Don’t get too excited, mentalist,” Senku says dryly. “I labelled your contact <em>machigatta bangō</em>.”</p>\n<p>Gen blinks. “You...you called me <em>wrong number</em>?”</p>\n<p>Senku shrugs. “It’s not like I knew your name.”</p>\n<p>“So cold, Senku-chan!”</p>\n<p>“I shortened it to Ma-ban after a while, and Taiju and Yuzuriha both called you Ma-ban-san.”</p>\n<p>“That’s not much better!” Gen summons some tears and dabs at the corner of his eye. “I should have called you <em>science nerd</em>.”</p>\n<p>Senku grins. “That doesn’t sound too bad.”</p>\n<p>“I should have known you’d choose something boring,” Gen laments.</p>\n<p>“Yeah, I’m really not sure why you’re so worked up.” Using his grip on Gen’s robe, Senku tugs him even closer, until Gen is practically in his lap. “Think about it this way: I talked about you so much, I had to give you a nickname.”</p>\n<p>Gen pouts obstinately. “I’m still heartbroken.”</p>\n<p>“That must be so hard for you.” Senku glances to the side. “Looks like the film is done.”</p>\n<p>Reluctantly, Gen steps back and Senku fishes the plate out of the vat, shaking it a few times to flick the solution off.</p>\n<p>“What do you think?” Senku asks as Gen peers over his shoulder.</p>\n<p>Obviously, the quality can’t hold a candle to the cameras of the past, but it’s undeniably him, washed out by the sunlight and gaping like an idiot. “Destroy it.”</p>\n<p>Senku laughs. “No way. This is a collector’s item.”</p>\n<p>Gen rolls his eyes. “I thought you disliked sentiment.”</p>\n<p>“It’s unproductive,” Senku agrees, setting the plate safely out of the way. “But this is different.”</p>\n<p>“How so?”</p>\n<p>Instead of responding, Senku snags Gen by the robe and hauls him in again.</p>\n<p>“Honestly, Senku-chan, it’s not a handle—”</p>\n<p>“I’ve thought about you everyday for thirty-seven hundred years,” Senku cuts in, eyes shining. “That’s brainpower I could have been using for something else. Now that I know where you are, my productivity is about to shoot through the roof.”</p>\n<p>A smile unfolds inexorably across Gen’s face and he drapes his arms over Senku’s shoulders. “So utilitarian,” he chuckles, brushing their foreheads together. “But, really, this is exactly what I expected. I’m so flattered to be a waste of brainpower.”</p>\n<p>“I can’t believe I didn’t realize who you were sooner,” Senku mutters. “It’s so obvious now. No one’s ever annoyed me like you do.”</p>\n<p>Gen huffs. “Same here.”</p>\n<p>Yuzuriha is going to be so happy, Gen thinks absently as Senku winds his arms around his waist and he slides one hand into Senku’s hair. And once she clues Taiju in, he’ll probably lose it. The villagers will be confused by the full story, but the modern folks will probably go nuts. Ryusui will be unbearably smug, and Francois will just smile mildly like always. Gen can’t help giggling against Senku’s mouth at the thought.</p>\n<p>“What’s so funny?” Senku rumbles.</p>\n<p>Gen’s smile grows. “Nothing. Just thinking about who’s responsible for all of this.”</p>\n<p>Senku pulls back slightly to quirk an eyebrow at him. “And who would that be?”</p>\n<p>Grinning now, Gen smooths Senku’s hair out of his face. “Bohr-chan, of course!”</p>\n<p>Blinking, Senku smiles slowly in response. “Right. Thanks, Bohr.”</p>\n<p>“Thanks, Bohr-chan!”</p>\n<p><em>Thank you, </em>Gen thinks, laughing joyfully as Senku surges forward to catch the sound in his own mouth. <em>Thank you</em>.</p>"
}