{
  "id": "22132261",
  "url": "https://archiveofourown.org/works/22132261?view_full_work=true",
  "author": [
    "Maeglin_Yedi"
  ],
  "title": "The Serpent That Devours Us",
  "rating": "Mature",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Harry Potter - J. K. Rowling"
  ],
  "relationships": [
    "Harry Potter/Tom Riddle",
    "Regulus Black/Bartemius Crouch Jr.",
    "Sirius Black/Remus Lupin",
    "James Potter/Lily Evans Potter",
    "Hermione Granger/Ron Weasley"
  ],
  "characters": [
    "Harry Potter",
    "Tom Riddle",
    "Tom Riddle | Voldemort",
    "Luna Lovegood",
    "Lily Evans Potter",
    "James Potter",
    "Hermione Granger",
    "Ron Weasley",
    "Severus Snape",
    "Regulus Black",
    "Bartemius Crouch Jr.",
    "Blaise Zabini",
    "Newt Scamander",
    "Newt Scamander's Magical Beasts"
  ],
  "additional_tags": [
    "Alternate Universe - Canon Divergence",
    "Alternate Universe - No Voldemort",
    "Sane Tom Riddle",
    "Tom Riddle in Harry's time",
    "POV Harry Potter",
    "Magical Accidents",
    "Care of Magical Creatures",
    "Good Severus Snape",
    "Adult Hermione Granger",
    "Luna Lovegood is a Good Friend",
    "Severus Snape Has a Heart",
    "Possessive Tom Riddle",
    "Tom Riddle is Not Voldemort",
    "Gay Sirius Black",
    "Harry Potter is Not the Boy-Who-Lived",
    "Harry Potter is Bad at Feelings",
    "Gay Harry Potter",
    "Regulus Black Lives",
    "Not Beta Read",
    "Sorry Not Sorry",
    "Idiots in Love",
    "Eventual Romance",
    "do not copy story to another website",
    "Smart Harry Potter",
    "Harry grows up with his parents",
    "Mentor Severus Snape",
    "Lily Evans Potter & Severus Snape Friendship",
    "Basilisks",
    "Demiguises",
    "Acromantulas (Harry Potter)",
    "Augurey",
    "Fluff and Angst",
    "Domestic Fluff",
    "Angst and Humor",
    "Humor",
    "Romantic Comedy"
  ],
  "language": "English",
  "series": "",
  "published": "2020-01-05",
  "completed": "2022-02-09",
  "words": "40,212",
  "chapters": "13/13",
  "comments": "616",
  "kudos": "10,386",
  "bookmarks": "2,821",
  "hits": "106,335",
  "summary": "<p>When Harry Potter, magical zoologist and Britain's only parselmouth hears the rumour of a basilisk named Voldemort living in an Indian forest he rushes to investigate.</p>\n<p>What he finds is more, much more, than he could ever imagine.</p>\n<p>Harry and Tom hunt some spiders and have a serious talk.</p>",
  "notes": "<p>Based on a prompt found on tomarrywritingprompts on tumblr.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Wow, it's been a long time since this was updated. Fear not, though, this story is not forgotten and I finally got around to writing the next chapter. I'll do my very best to make the next update a bit quicker this time.</p>\n<p>Thanks for reading! Your comments and support keep me writing.</p>\n<p>No, this story has not been abandoned or forgotten. I've got the rest of it plotted out now and I expect to need another 5 to 10 chapters to finish it, which I will try to do within a reasonable time-frame. </p>\n<p>Thank you all for sticking with this story, even after all this time. Seeing your comments keeps me motivated to see it finished. Let me know what you think!</p>\n<p>Yes, an update. I swear, I'm going to do my very best to get the next chapter out a bit sooner. In fact, I've made it my mission now to actually finish this story. Finally. </p>\n<p>Thanks for your patience and your support. Do let me know what you think. Your comments give me life.</p>\n<p>Another update, because I'm determined to finish this fic now that we're so close to the end. There's still a bit of plot left, because naturally, Dumbledore will have something to say about these recent developments. </p>\n<p>Thanks for your patience and support. Let me know what you think! Your comments mean more to me than I can possibly say.</p>\n<p>We're almost at the end. One more chapter to go!</p>\n<p>Thanks for all your patience with this story. It took me a while to tell it, but I did have an excellent time writing it along the way. Thanks for reading. Let me know what you think! Your comments keep my writing going, always.</p>\n<p>This story is now officially completed! It only took me two years to write, but we got there in the end. I had a lot of fun writing this story and I hope you all had just as much fun reading it.</p>\n<p>Thanks so much for all your patience and your support. Hearing from you kept me determined to finish this one eventually.</p>\n<p>Thanks for reading. Let me know what you think.</p>\n<p>Come join me on Tumblr: <a href=\"https://maeglinyedi.tumblr.com\" rel=\"nofollow\">maeglinyedi</a></p>",
  "text": "<p>When Harry heard the rumours of a basilisk living in the magical part of the forest in Van Vihar National Park in India, he knew he had to go and find it.</p>\n<p>“Have you gone insane?” Hermione asked him once he confessed the destination of his next journey. He hadn’t meant to tell her but Hermione had a way of pulling the truth from him even when he was determined to hide it. </p>\n<p>“Listen,” Harry said and gestured up and down his own body. “I’m the first parselmouth in Britain in centuries. Maybe even the world. I’ll just have a chat with it, nothing more.”</p>\n<p>Ron was a little more reasonable than his fuming wife, but not much. “Mate, going to India to have a chat with a basilisk is a bit much, even for you.”</p>\n<p>Harry shrugged, which infuriated Hermione even more. “I’m telling your mother.”</p>\n<p>Harry’s eyes widened. “Please don’t,” he pleaded.</p>\n<p>She did.</p>\n<p>“Harry, dear,” his mum said later that day after she and his dad had invited themselves over for tea. Lily sat on the sofa, cup balanced in her hands while his dad paced in front of the fireplace. “We respect your choices, but going to hunt a basilisk is not a good idea.”</p>\n<p>Harry gasped, insulted. “I’m not going to hunt it, Mum. I just want to meet it.”</p>\n<p>Sighing, his dad stopped and pushed his glasses up his nose. “Just because you can do...this thing, doesn’t mean you should, Harry.”</p>\n<p>“You mean parseltongue, Dad,” Harry said, beyond tired of his dad’s rejection of Harry’s magical talents. “I’m a parselmouth that speaks parseltongue.”</p>\n<p>His dad waved his comment away as though it was irrelevant which only infuriated Harry more. “You’ve been gallivanting around the globe for a decade now,” his dad said in his most annoyingly lecturing tone.</p>\n<p>“Because I am a magical zoologist,” Harry said loudly, but James fucking Potter, Auror extraordinaire, ignored him completely. Story of his life.</p>\n<p>“It’s time you think about your future, Harry,” his dad went on. “Look at your sister –“</p>\n<p>“Enough.” Harry jumped up from the couch, glaring between his mum and his dad. “I’m a grown man of 33 years old with a successful career that I love. That’s it. No need for your input. Thanks for stopping by. See you in a few weeks.” And he marched to the fireplace, threw in a hand of floo-powder, called out Potter Mansion and waited with tightly crossed arms until his parents got the right idea and left. </p>\n<p>He loved his mum and dad but they drove him up the wall more often than not.</p>\n<p>The next afternoon his sister stopped by. “If you get eaten by a big fat snake I inherit everything, just so you realize,” Hyacinth told him with a grin. </p>\n<p>Harry snorted but let Hyacinth pull him into a hug. “Seriously, Harry, be careful please. Your niece or nephew wants you to stick around long enough for them to meet you.” She gestured at her baby bump and Harry gave her a genuine smile.</p>\n<p>“I promise I’ll do my best not to get eaten. I have plans for your kid.” Harry winked at her. </p>\n<p>“As long as those plans don’t involve basilisks I’m fine with it.” She accepted a kiss on the cheek from him. “See you in a few weeks. Send us a postcard.”</p>\n<p>“Always.”</p>\n<p>That evening his business partner stopped by. “Bring back some venom if you can coax it out of the beast,” Severus said while accepting a tumbler of firewhiskey.</p>\n<p>All throughout Harry’s childhood and adolescence, his ‘uncle Sev’, as Lily insisted Harry and Hyacinth call him, had looked down his hooked nose at Harry. The man was Hyacinth’s godfather and perfectly friendly towards her, but Harry hadn’t had a decent interaction with the man until he was well out of Hogwarts and decided on a career in magical zoology. Severus had cornered him during his mother’s birthday party and quietly asked him what kind of rare potions ingredients he was expected to come across during his next trip.</p>\n<p>And that was, as they say, the start of a beautiful friendship. Harry got to travel the world looking for magical creatures, and Severus used and resold any ingredients he brought back. It earned them both a pretty Galleon.</p>\n<p>“Some scales wouldn’t go amiss either,” Severus said, sipping his whiskey. “Shed skin if you can find it. Blood is also worth something.”</p>\n<p>“So just bring back the whole beast, is what you’re saying.”</p>\n<p>“As long as it’s dead, certainly.”</p>\n<p>Sirius sent him a postcard from Lisbon, where he and Remus were spending a week to celebrate their wedding anniversary. “Have fun! Don’t get eaten! Remus says to take some pictures he can use in his classes.” Remus, of course, was the Defense Against the Dark Arts professor at Hogwarts, while Sirius was an Auror. </p>\n<p>Last but certainly not least, his best friend Luna stopped by. “It’s going to be fine,” she assured him in that peculiar way of hers. “Here, you might want to use these.” She handed him a pair of plastic muggle sunglasses with iridescent lenses. </p>\n<p>“Thanks,” Harry said with a smile, having long ago learned never to question anything Luna did. He hugged her tightly. If Harry had at all been straight he would have proposed to her in a heartbeat. But alas, he wasn’t, and Luna met and fell in love with Rolf Scamander. And sadly, Rolf didn’t have a gay brother hiding in the closet. </p>\n<p>It took Harry three portkeys to get to Mumbai and from there he could use the floo network to travel within the enormous country. For the very last part of the journey Harry used his broomstick, aided by his trusty invisibility cloak. </p>\n<p>The magical part of the forest was surrounded by a thick layer of wards to keep people, magical and muggle, out. But the wards were decades old and decaying and it took Harry less than an hour to create a small opening for him to slip through. </p>\n<p>He called out in parseltongue and almost immediately a king cobra answered. </p>\n<p>“The King of Serpents?” the cobra wondered. “Yes, I know where he lives. A monocled cobra told me right before I ate him. A friendly chap he was, but a girl’s got to eat. Goes by the name of Voldemort.”</p>\n<p>“The monocled cobra?” Harry asked, crouched before the snake.</p>\n<p>“No, silly, the King of Serpents. I never ask my prey their name. I might get attached and then where would I be? Starving, that’s what.” The cobra snickered to herself. “I’ll show you where he lives if you like.”</p>\n<p>“That would be lovely.” Harry got up and followed the king cobra through the forest.</p>\n<p>“Oh, I don’t mind,” the snake assured him. “It gets a bit lonely, you know, when the only creatures you can talk to are the ones you eat.”</p>\n<p>“I’m sure it does,” Harry agreed, realizing the cobra had a point. “So you never talk to Voldemort?”</p>\n<p>“Oh no,” the cobra said while shaking her head. “A silly old girl like me, chatting with the King of Serpents? I wouldn’t dare. Also, I hear he gets a bit cranky from time to time.”</p>\n<p>“Huh.” Harry swallowed and wiped his suddenly sweaty palms against his jeans. “How cranky exactly?”</p>\n<p>“I hear that every few years he throws a tantrum. He tries to leave, can’t, and destroys some part of the forest. Eats a few deer. One time a tiger, I heard. Imagine eating a whole tiger. The rests of the time he sleeps, I think.”</p>\n<p>“Okay. I can work with that.”</p>\n<p>The snake eyed him up and down to asses his size. “I hope you can, wizard, because you’re much smaller than a tiger so he could swallow you whole.” </p>\n<p>Harry’s hand shot to his necklace, which functioned as an emergency portkey. It was still there. Good. “I’ll be fine,” he said to assure himself more than the cobra.</p>\n<p>“If you say so.” The cobra stopped moving and indicated a large hill in front of them. “Behind that are lots of big caves. That’s where he lives.”</p>\n<p>“Thank you,” Harry said, meaning it. The cobra had saved him days of searching on his own. “I really appreciate it.”</p>\n<p>“It was my pleasure,” the cobra said and waved her tail at him. “Goodbye, wizard. Don’t be prey!”</p>\n<p>It took Harry most of the day to trek through the forest across the hill. Once he was across he pulled his suitcase out of his backpack and climbed inside. The suitcase was Harry’s pride and joy, enchanted by Newt Scamander himself just a month before his death about a decade ago. Harry just counted himself lucky to have gotten to know the man before he passed away.</p>\n<p>Being a parselmouth in an upstanding Gryffindor family had its challenges. The Sorting Hat wanted him in Slytherin for one, but at eleven Harry was still naive enough to believe that being sorted into Gryffindor would earn him his father’s approval. It didn’t, not in the way Harry wanted. </p>\n<p>James Potter just couldn’t accept that his oldest child, his only son, was somehow a parselmouth. </p>\n<p>When Harry had talked to a grass snake in the garden when he was six, his father had first accused Lily of infidelity, which earned him a slap in the face from a fuming Lily. Then he had flooed Professor Dumbledore in a blind panic. </p>\n<p>Dumbledore had looked Harry up and down and assured his parents there was nothing wrong with their son, that sometimes such magic could appear after laying low for generations, and that just because their son displayed a Slytherin trait didn’t mean he was evil.</p>\n<p>Harry wondered what all the fuss was about when all he’d done was discuss the frogs in their pond with a friendly snake. </p>\n<p>Lily had tried very hard to accept him for who he was, and for the most part she succeeded, but his father had since that day treated Harry as just a little bit defective. </p>\n<p>Surprisingly it had been Sirius, his beloved godfather and staunch Gryffindor, who had helped Harry the most by introducing him to Hagrid when he was seven.</p>\n<p>“Show him what you can do, Harry,” Sirius said with an encouraging smile while he conjured a garter snake.</p>\n<p>And Hagrid had clapped his massive hands when Harry talked to the animal about the weather. “Jolly good, Harry. Wish I could talk to some of me animals. Dead useful that would be.”</p>\n<p>And a beautiful friendship had been born. Harry credited Hagrid for nursing his burgeoning love for all creatures, and it was through Hagrid that Harry was introduced to Newt Scamander when Hagrid invited Harry over for tea in his first year just as Newt was visiting. Harry had listened in awe and fascination to the soft spoken man, and since that day they kept up a steady correspondence. </p>\n<p>It was Newt that had inspired Harry to become a magical zoologist when the whole world expected him to follow his father into the Auror department. </p>\n<p>And Harry had no regrets. He loved his work, made a nice living thanks to Severus’ business savvy and some of the books Harry had published, and felt he was contributing something by educating the public about all magical creatures great and small.</p>\n<p>The only regret Harry had was that being abroad as much as he was made it hard to have a relationship. He’d dated a few wizards over the years, some more seriously than others. Oliver Wood had been a potentially great future husband, but between both their hectic schedules that relationship had petered out before it ever really got started. </p>\n<p>Blaise Zabini had been a casual relationship with some of the best, most intense sex Harry had ever had. But Blaise wasn’t interested in anything more serious, and Harry needed commitment, so they’d broken it off after almost a year. </p>\n<p>There had been others, but none kept Harry’s attention for long. The forests and oceans of the world called to him, and Harry always answered. </p>\n<p>Besides, Luna assured him he’d find someone eventually who would accept him and his career, and Luna Lovegood was rarely wrong about anything. </p>\n<p>Harry made himself a simple dinner of bacon sandwiches with some scrambled eggs on the side in the small kitchen in his suitcase. After eating he took a cup of tea to bed with him and read a zoological journal about a colleague’s travels to meet a thunderbird until his eyes drooped shut. </p>\n<p>The next day Harry took a refreshing shower, had some porridge and a strong cup of coffee for breakfast and packed up his suitcase in his backpack. </p>\n<p>It was only another two miles or so until the mouth of the cave. The entrance was enormous, easily as big as the great hall at Hogwarts. Harry walked to the middle of the entrance, inhaled a deep breath and called out in parseltongue. </p>\n<p>“Greetings, King of Serpents. I come in peace.”</p>\n<p>Something moved in the shadows deeper inside the cave. “Listen, krait, I told you to bugger off. I have no interest in your schemes.”</p>\n<p>It was spoken in perfect parseltongue, at once familiar but with an other-worldly quality to it. </p>\n<p>Harry cleared his throat. “I’m not a krait. I’m a wizard.”</p>\n<p>Massive dark-green coils erupted from the shadows, and on instinct Harry squeezed his eyes shut and clenched his fingers around his emergency portkey. </p>\n<p>Scales ground against the stone as something massive came closer and closer until it encircled him. Harry heard the beast move and breathe, but he kept his eyes shut tightly, his breath caught in his throat while sweat dripped down his back.</p>\n<p>“Well,” the basilisk said as Harry heard his head stop in front of him. “That took you long enough. I’ve only been waiting for decades.”</p>\n<p>Harry was so shocked and flabbergasted by that response he accidentally opened his eyes and stared right into a pair of bright yellow orbs. Shrieking, Harry clapped both hands over his face, emergency portkey quickly forgotten. </p>\n<p>“Not a very bright one, are you,” the basilisk said in a quite frankly snooty tone. “Ah well, beggars can’t be choosers. You can open your eyes. Parselmouths are immune to a basilisk’s gaze.”</p>\n<p>Very, very slowly, Harry lowered his hands and looked at the basilisk. He was enormous, easily sixty feet long with a head that indeed could swallow Harry whole should it desire to. </p>\n<p>“Hi,” Harry said, so awed by talking to an actual basilisk he had no clue what else to say.</p>\n<p>The basilisk rolled his eyes and sighed. “Really not a bright one. What is your name?”</p>\n<p>“Harry Potter. And you are Voldemort, right?”</p>\n<p>The basilisk gave what could only be described as an embarrassed shrug. “I made the mistake of telling a Russell’s viper that name when I first arrived here and it stuck.”</p>\n<p>Harry got more and more confused by the minute. “So Voldemort is not your name?”</p>\n<p>The basilisk moved closer until they were almost nose to nose. “My name is Tom Riddle and I need your help to turn me back into a wizard.”</p>\n<p>“What?” Harry gaped at the basilisk, mouth hanging open. He knew he must look the fool but he was too shocked to care. </p>\n<p>“How thick are you?” the basilisk – Tom! – asked him. “I’m a wizard. I need your help.”</p>\n<p>“No, I got that part. Just...how did this happen? Is it an animagus transfiguration gone wrong? I’m an animagus, so I might be able to help you.”</p>\n<p>The basilisk – Tom – shook his massive head. “I’m an animagus as well, but I became one years before this happened and my form is not a basilisk.” Tom looked away from Harry. “I performed a ritual, but...I was betrayed. The sorceress who gave me the ritual knew this would happen. She wanted this to happen.”</p>\n<p>“What kind of ritual? I’m really not well-versed in rituals, to be honest.” Harry shrugged helplessly. Of course he wanted to help this wizard, but his expertise was magical creatures, not magical catastrophes.</p>\n<p>Tom ducked his head, his coils tightening for a second. “It was a ritual of longevity. Do the ritual, have a guaranteed 1000-year-long lifespan, that sort of thing.”</p>\n<p>Harry couldn’t help himself. He snorted. “So the ritual did work. Basilisks do live that long.”</p>\n<p>“Yes, thank you,” Tom snapped. “I had realized that a time or two or five hundred since I got stuck like this. Wait, what year is it?”</p>\n<p>“It’s 2013.”</p>\n<p>Tom visibly recoiled, his yellow eyes widening. “It’s 2013? I knew some decades had passed but I thought it might be the eighties.”</p>\n<p>“When did you get stuck like this then?” Harry asked, his heart aching for this guy. No wonder he got cranky sometimes and tore up the forest. “How old are you?”</p>\n<p> “I was born December 31st, 1926. I performed the ritual on midsummer’s eve, 1953,” Tom whispered.</p>\n<p>“Wow. You have been stuck here for a long time.” Harry considered the situation and knew at once what to do. “Come with me.”</p>\n<p>Tom’s head snapped up. “Are you mad? I’m a basilisk, in case you haven’t noticed. I go beyond this forest and the whole world will hunt me down.”</p>\n<p>Harry’s smile was wide as he slipped off his backpack and pulled out his suitcase. “Oh mate, the world won’t know you’re with me.” He placed the suitcase on the floor and flipped open the lid. “Just follow me. You’ll fit, don’t worry.”</p>\n<p>And Harry quickly climbed down the stairs into the main area of the suitcase. Newt had charmed it, much like his own suitcase, to have a main holding area with many habitats bordering it, with a small apartment off to the side. Harry heard scales sliding above him and he watched quietly as Tom lowered the bulk of his body inside the holding area, forked tongue flicking in and out of his mouth. </p>\n<p>“This is quite impressive,” Tom said, carefully sliding along the floor as he checked out all the different habitats. </p>\n<p>“Plenty of space for you to move around in until we can reverse the ritual.” Harry crossed his arms, leaning his hip against a support beam as he watched Tom get familiar with the place. “I don’t have any animals with me now. My owl, Hedwig, always travelled with me but she died a few years ago. I use the habitats for sick creatures or ones that need relocating. I’m a magical zoologist,” he added, not sure if he’d told Tom that yet or not. </p>\n<p>“And a Gryffindor,” Tom said with a sigh as he poked his head inside Harry’s living quarters where Harry kept a Gryffindor flag above the sofa. “Of course you had to be a Gryffindor, blundering your way inside a basilisk’s lair as you did.”</p>\n<p>“What’s wrong with Gryffindor?” Harry asked with a grin and then realized something. “Wait, are you British? Did you go to Hogwarts?”</p>\n<p>Tom gave him a disbelieving look before rolling his eyes. “Born and raised in London. I’m a Slytherin. Prefect. Head boy, even. I had the highest NEWTs score, at least until then.”</p>\n<p>Harry chuckled. “You sound like the boy my friend Hermione complained about after she went through Hogwarts’ student records. She wanted to be the best and she was determined to beat your scores but she couldn’t quite manage it.”</p>\n<p>“Well,” Tom said with a smug look. “It’s nice to know I left some kind of legacy behind.”</p>\n<p>“So, what do you think?” Harry gestured around the space. “This way we can take our time getting you back to yourself, and in the meantime you get out of the forest and I can do my job.”</p>\n<p>Tom stared at him for a moment. “I suppose that is acceptable. It’s not like I’ve got anything better to do.”</p>\n<p>“Great,” Harry said, but he sobered after a moment of excitement. “Just promise me you’ll be careful with your gaze. I might be immune but the rest of the world isn’t.”</p>\n<p>“I can shield my gaze with my third eyelid temporarily.” Tom demonstrated by raising an opaque lid over his bright yellow eyes. “But perhaps it’s wise to not let anyone else down here.”</p>\n<p>Harry nodded. “The suitcase is warded. No one can enter without my express invitation.”</p>\n<p>“Good. There is one thing left to do.” And with that, Tom raised himself up and slid out of the suitcase. Harry jumped up the ladder and followed him out. Tom led him deeper inside the cave to a part where it was almost too dark to see. “You’ll need to bring this for me.” Tom nudged his nose against a small rocky ledge. </p>\n<p>Harry leaned closer to see what was on it. “Is that your wand?” he asked after he managed to identify the object in the near darkness.</p>\n<p>“Yes. If you could grab that for me I would be much obliged.”</p>\n<p>Harry did and the moment his fingers closed around the pale wood an almost familiar warmth shot up his arm. “What’s it made of? It feels almost like my own wand.”</p>\n<p>“Yew and phoenix feather.”</p>\n<p>“Ah.” Harry reached for the holster in his sleeve and pulled out his own wand. “Holly and phoenix feather.”</p>\n<p>“Might be from the same phoenix if they are that similar,” Tom suggested.</p>\n<p>“Might be,” Harry agreed. He placed both wands inside the holster. “I’ll take good care of it until you can hold it again, I promise.”</p>\n<p>Tom was quiet for a moment before he whispered, “Thank you. That wand is what has kept me sane over the years. Knowing it was there, that it was mine, that I was a wizard, it kept me from giving up.”</p>\n<p>Harry placed a hand on Tom’s scaly side in comfort. “We’ll get you sorted out, Tom. I know a lot of brilliant people. They’ll help.”</p>\n<p>Tom nodded his head and without saying anything else he slid back to the suitcase. Harry followed him with a sense of purpose brewing in his chest. He would help Tom get back to himself and in the meantime he had a companion for his travels.</p>\n<p>Before Harry climbed down in the suitcase he aimed his wand at the cave. “Accio shed basilisk skin.”</p>\n<p>Three long almost translucent skins came flying towards him. One, the oldest, was too far gone to be of any use, but the other two were still in good shape. Harry folded them with a wave of his wand and ignored Tom’s amused look as he carefully stored them in an empty trunk.</p>\n<p>“The rent doesn’t pay itself,” Harry said, closing the trunk. “I’ve got to sell things I find to fund this operation.”</p>\n<p>“You should milk some of my venom. That should earn you a nice pile of Galleons.” Tom briefly opened his mouth to show off his enormous fangs. “If you dare,” he added with a hissed laugh. </p>\n<p>“If you let me I’ll dare.” Harry offered him his cockiest grin. “Gryffindor, remember.”</p>\n<p>“How could I forget. Though what the Sorting Hat was thinking in placing a parselmouth in Gryffindor, I’ll never understand.” Tom stretched his coils out before getting more comfortable.</p>\n<p>“Well, it hadn’t seen a parselmouth in a long time,” Harry offered. “Dumbledore told me I was the first parselmouth in Britain in centuries.”</p>\n<p>Tom reared his head up with a terrifying hiss. “Dumbledore is full of shit. I’m a parselmouth, which I told him when he came to give me my letter when I was eleven. He never trusted me afterwards. And now he’s erasing my existence altogether.” Tom’s eyes positively glowed as he glared at Harry.</p>\n<p>Not knowing how to respond to that, but slightly cowed in the face of a basilisk’s fury, former human or not, Harry lowered his gaze. “I’m sorry. I had no idea.”</p>\n<p>Tom seemed to deflate slightly. “I realize it’s not your fault. It just angers me beyond belief that Dumbledore would do such a thing. That man has never given me a fair chance.”</p>\n<p>“So I guess asking Dumbledore for help is out of the question? Because he’s at the top of my list to go to, if I’m being honest,” Harry said carefully.</p>\n<p>Tom’s eyes started glowing again. “That man is still alive? And yes, going to him is definitely out of the question. I’d rather remain this way than ask him for anything.”</p>\n<p>“Okay, point made,” Harry said, meanwhile wondering what the hell Dumbledore had done to this man to make him hate the headmaster that much. To be honest, Harry had never had much to do with Dumbledore. His parents were friendly with him, his dad had business with him through his work from time to time, and his mother, who worked as a healer in St Mungo’s, had called upon the headmaster for his expertise in transfiguration in a few difficult cases. But Harry himself, especially after he became a zoologist had never garnered much of the headmaster’s attention. Then again, he’d never been an exceptional student outside his interest in creatures and his talent on a broom.</p>\n<p>Harry had figured out years ago, after a few nights drinking wine or whiskey with Severus and listening to some of his stories about his time at Hogwarts, that Dumbledore was the kind of man who surrounded himself with talented people who could solve his problems for him. Severus wasn’t overly fond of the man for his abysmal treatment of Slytherins, and Blaise had always had lots to complain about the headmaster as well, and Harry realized Tom might very well have similar experiences as those two when it came to the headmaster and Slytherins.</p>\n<p>Best to respect his grievances and find help elsewhere. </p>\n<p>“I’m getting a sandwich. Do you need to eat?” Harry moved inside his small apartment, amused when Tom stuck his head inside the door to see what he was doing.</p>\n<p>“No, I ate two deer just the other week. I don’t require much sustenance.”</p>\n<p>“Let me know when you get hungry. There’s plenty of deer and wild boar in the world.” Harry prepared himself a simple roast beef sandwich and a cup of tea and flopped down on the sofa to eat it. </p>\n<p>Tom flicked his tongue in and out. “I miss tea,” he sighed.</p>\n<p>“I think I would, too,” Harry said between bites. “What possessed you to do such a ritual in the first place?”</p>\n<p>“Stupidity,” Tom replied with a bitter laugh. “Arrogance. Ambition. Immortality.”</p>\n<p>“Immortality? Really? That sounds a bit...much.”</p>\n<p>“I have, since being stuck like this for sixty years, come to the conclusion that immortality is overrated, yes.” Tom’s gaze was miles away. “I wonder if this was the sorceress’ goal when she gave me the ritual. I’d spent so many years trying to lose my humanity and yet, now I would do almost anything to be human again.” And with that Tom pulled his head back and disappeared into the holding area, leaving a baffled Harry behind.</p>\n<p>Harry left Tom alone for an hour while he stretched his legs out on the couch and wrote in his journal. If there was something that Newt had taught him, it was to take lots of notes, then some more notes, and just when you thought you had enough, you added a few extra just to be safe.</p>\n<p>After logging the highlights of his adventure so far, Harry stuck the journal in the back pocket of his jeans and went in search for Tom.</p>\n<p>He found the basilisk swimming in the mountain lake in the temperate habitat.</p>\n<p>“Isn’t that a little cold?” Harry called out as he stood on the shore, water lapping at his shoes. “There’s also a big lake in the tropical habitat.”</p>\n<p>Tom swirled around in the water a few times and swam towards him. “No,” he said as he slid on land beside Harry. “Basilisks can tolerate much colder temperatures than most other reptiles.”</p>\n<p>Harry reached for his journal and dutifully wrote that titbit of information down.</p>\n<p>“Besides,” Tom said with a little sigh. “I love this view.” He nodded his head at the snow-capped mountains in the distance. “I’ve had enough of trees to last me a very long time.”</p>\n<p>Harry quirked a smile at that. “Hey, I’ve been thinking.”</p>\n<p>“Oh dear,” Tom said in mock sympathy. “Did it hurt a lot?”</p>\n<p>Staring at the enormous basilisk beside him, Harry wasn’t sure how to react at first. He settled for rolling his eyes, though he couldn’t hold back a grin. “How old were you again?”</p>\n<p>“Older than you.” Tom seemed to shake himself a little. “But go on. Share your thoughts with the group.”</p>\n<p>Merlin, this guy. Harry snickered quietly. “When we get you turned back into yourself, you’ll need to start over, right? I’m assuming here you don’t have wealthy relatives or a fat vault at Gringott’s waiting for you.”</p>\n<p>“You assume right. I grew up a penniless orphan, and even though I worked after Hogwarts and managed to save a small amount, taking 60 years worth of inflation into account that amount would barely buy you a set of robes nowadays.”</p>\n<p>“Hmm.” Harry nodded in agreement. “My business partner and I sell rare ingredients, among other things.”</p>\n<p>Tom seemed to cotton on where this was going. “And I’m a living, breathing treasure trove.”</p>\n<p>“Something like that, yes. You go in with us, we sell your venom and shed skins and split the profits three-way.”</p>\n<p>Tom tilted his head and narrowed his eyes. “No, we split 50-50. I take half, and how you divvy up your half is up to you. Share with your partner or not, I don’t care.”</p>\n<p>“It’s a deal,” Harry said with a huge grin. Half of the proceeds of selling basilisk products was more than enough to add a small fortune to both his and Severus’ vaults.</p>\n<p>“Then you’d best get milking, hadn’t you, Harry.” Tom grinned in a way that showed off his fangs. </p>\n<p>Harry stared, reminded himself he was a Gryffindor, turned on his heels and marched back to the holding area. He called out over his shoulder, “Come on then. I promise I’ll be gentle. I’m quite adapt at...milking other wizards. Never have any complaints.”</p>\n<p>Tom inhaled a sharp breath and shot forward to catch up with him. “Was that flirting, Harry?”</p>\n<p>“You’re not sure?” Harry asked, deeply amused by Tom’s overly dramatic response.</p>\n<p>“I don’t speak Gryffindor, so no, I’m not sure,” Tom said with an almost bashful tilt of his head. “After all, we’ve only just met and you are being very forward with my person.”</p>\n<p>“Wow, you managed to get all of that out with a straight face. I’m impressed.” Harry couldn’t stop grinning as he collected a pair of galvanized buckets and hit them with the most abrasive cleaning charm he knew. </p>\n<p>“Mission accomplished,” Tom said. “Being a sixty foot basilisk wasn’t impressive enough, apparently. It’s my conversation skills that were ultimately needed to truly impress.”</p>\n<p>Laughing, Harry found a stretch of old canvas. He cut out two big squares and fixed them over the top of the buckets so Tom would have something to bite down on that would create enough pressure to release some venom.</p>\n<p>“Seriously though, do you have any idea how long it’s been since I’ve had some reasonably intelligent conversation?” Tom mused as he watched Harry work. </p>\n<p>“Sixty years?” Harry guessed as he pulled a pair of dragon-hide gloves out of a nearby trunk.</p>\n<p>“Sixty years,” Tom agreed sagely. “So excuse me if I’m feeling a little bit starved for socialization.” He shook his big head in obvious bewilderment. “Which is the height of irony because for my entire life, before I came here, I prided myself on being a loner, on not needing anyone but myself.”</p>\n<p>“What you went through would change anyone.” Harry pulled open a few other trunks but couldn’t find a pair of protective goggles. He suspected the orphaned litter of nifflers he’d raised the previous spring had done away with them. And then he remembered. He summoned his backpack, pulled out the ridiculous pair of sunglasses Luna had given him and slid them on. </p>\n<p>“I’m not even going to ask,” Tom said. Harry had no idea basilisks could look that unimpressed. “Let’s get this over with.” </p>\n<p>The procedure was fairly simple. Tom opened his mouth wide, Harry levitated the two buckets into place below the fangs, and Tom bit down. Thick, yellow venom squirted from the fangs, filling the buckets almost three quarters full. </p>\n<p>“Sweet baby hippogriff,” Harry said as he carefully levitated the buckets to the floor and removed the canvas. “That’s a lot of venom.”</p>\n<p>“Not bad.” Tom raised his head and peered over Harry’s shoulder at the buckets. “Just give me a week and I’ll have that amount again.”</p>\n<p>Harry swallowed and turned to stare at Tom. “We’re going to be rich.”</p>\n<p>“I imagine it will take at least a few weeks to find a way to reverse the ritual, so yes, we’re going to be very rich,” Tom said with what passed as a huge grin on a basilisk.</p>\n<p>Harry transfigured lids out of the canvas and spelled them on the buckets so not a drop would be wasted. One bucket for Tom, and one bucket for Severus and himself.</p>\n<p>“There’s no reason to stay here, is there?” Harry asked after he put the buckets away in a locked cupboard. </p>\n<p>“I’ve been trying to leave this forest for sixty years. I’m beyond ready to go.” Tom gave Harry an inquiring look. “The wards around the forest won’t let me through, though.”</p>\n<p>“Those wards are old and poorly maintained. I was able to squeeze my way through in under an hour. If you stay in here I believe I can take you through without a problem.”</p>\n<p>“Well then,” Tom said with no small amount of excitement in his voice. “I’ll be over there, swimming, while you rescue me like I’m a princess locked in a tower, Gryffindor hero that you are.”</p>\n<p>Harry snorted with laughter. “Some princess you are, you scaly worm. More like the monster that’s guarding some innocent maiden.”</p>\n<p>Tom gasped in mock offense, threw his head to the side in a very dramatic fashion and then slithered towards the mountain lake. Halfway there, he stopped, turned around and called, “And what does that say about you, brave Gryffindor hero, that you are rescuing me?” And then he was off again and within seconds he disappeared beneath the gentle waves of the lake.</p>\n<p>Harry shook his head, deeply amused by his new friend’s antics. Tom had so far shown him he was capable of great fury, but also of silly flirtations, and Harry liked what he’d seen of him so far. He couldn’t wait to get to know him better, first as a basilisk and hopefully soon as a man.</p>\n<p>Harry left Tom to the lake, packed up the suitcase and mounted his broom. It took only an hour of flying close to the forest canopy, startling various birds and some screeching monkeys, to get across the hill, and then another half hour to get to the ward line. Harry dismounted and pulled out his wand to reopen the crack in the wards so they could slip through.</p>\n<p>“Oh hello again,” a familiar voice said behind him. “Still alive, I see. Did you meet him? What was he like?”</p>\n<p>“Hi there,” Harry said to the king cobra who had helped him the previous day. “Yes, I met him. And he’s a wizard stuck as a basilisk.”</p>\n<p>The cobra flared her hood a little. “Well, that’s a little disappointing. The King of Serpents, a wizard.”</p>\n<p>“Perhaps to you,” Harry said as he waved his wand at the wards in a repeating pattern. “But I’m going to help him become a wizard again.”</p>\n<p>“You’re taking him with you?” the cobra guessed. “Do you think that’s wise? I heard he ate a whole village of people once.”</p>\n<p>Harry whipped his head around. “He what now?”</p>\n<p>“When he first came here, long before my time, he destroyed an entire village. That’s why the wizards came to put up the magic lines.”</p>\n<p>“Well,” Harry said, but then didn’t know what else to say. He could see it, though. Tom, recently betrayed and trapped in a basilisk’s body, his yellow eyes glowing as he took his anger and fear out on a nearby town. He didn’t agree with it, but he could understand.</p>\n<p>“Still want to save him?” the cobra asked with a curious tilt of her head.</p>\n<p>“Yeah,” Harry said, and meant it. “No one deserves this. Thanks again for your help.” And with one final smile at the cobra he slipped through the wards, mounted his broom and took off into the sky.</p>\n<p>Harry didn’t look back. If he had, he would have seen a woman standing in place of the king cobra. Tall and black of skin with four arms and wearing a necklace comprised of human heads. When she spoke, her voice echoed with destiny. “The one once destined to kill you will be the one to save you. You will hear him as he speaks your tongue. You will see him as he will find you. You will love him as if your souls were bound. Only he can restore you, oh great King of Serpents.”</p>\n<p>And she was gone. </p>\n<p>Harry travelled as quickly as he could back to the UK, not wanting to risk anyone finding out he was smuggling one of the deadliest creatures known to wizard-kind across international borders. Once home in his cottage in Hogsmeade, Harry immediately sent a Patronus to Severus even though it was already evening. His translucent stag, once a point of pride when he was still trying to win his father’s affections, only annoyed him these days. Still, it darted dutifully away and only ten minutes later a translucent bear burst through the wall, informing him he was welcome to stop by. </p>\n<p>Gathering the trunk with the shed skins and the buckets with venom, Harry said goodbye to Tom, who was sunbathing in the desert habitat, and set out into the village.</p>\n<p>Severus also owned a cottage in Hogsmeade, though one much larger than Harry’s, with its own potions labs, and on the opposite side of town. It was still only a short walk, since the village wasn’t very big. </p>\n<p>Severus opened the door and ushered him inside and towards the laboratories. “You were successful?”</p>\n<p>“Oh yeah,” Harry said with a grin, just as the door to his right opened and Hilde stuck her head out, her blond ponytail in complete disarray. </p>\n<p>“Hi Harry, good to see you. There is tea and strudel in the kitchen, help yourself. I have three brews on, so I have to go.” And she quickly disappeared behind the door again. Harry was used to her behaviour so he didn’t blink an eye.</p>\n<p>Severus had married a German witch ten years his junior named Hilde Baumgarten. She was a passionate potioneer, having invented and marketed three potions before she even finished Durmstrang. She was also the most vicious chess-player Harry had ever met. After Harry introduced them, even Ron had been intimidated by some of her strategies, and that was saying something.</p>\n<p>Severus adored her, not in the least because she was the mother of his children.</p>\n<p>It was one of life’s little ironies that one of the most intimidating men Harry had ever met, Severus Snape, had fathered the world’s most adorable six-year-old twin girls. Severus doted on them with all the love and dedication of a mother bear and woe to anyone who so much as looked at them funny. </p>\n<p>Naturally, Harry was the proud godfather, while Hyacinth was their godmother. </p>\n<p>Harry followed Severus inside the lab on the left, because as Hilde always said to anyone who would listen: “Separate labs, happy marriage.”</p>\n<p>Severus stared at the buckets once Harry removed the lids, and then in a rare show of affection he threw his arm around Harry’s shoulders and gave him a brief squeeze. “That is our retirement right there,” Severus said with as big of a smile as Harry had ever seen on his face. “Both of our retirement.”</p>\n<p>“There’s more,’ Harry said, flipping open the trunk and pulling at one of the skins to spread it out a bit.</p>\n<p>“Retirement and a very nice family vacation,” Severus said, bending down to take a closer look.</p>\n<p>“As many as you like,” Harry said with a huge grin. “There is a lot more where that came from.”</p>\n<p>Severus glanced at him for a second before going back to examining the skins. Then he stood up abruptly and glared at Harry, apparently having just remembered he was dealing with a Gryffindor.</p>\n<p>“Did you bring the beast back with you?”</p>\n<p>“Er...no?” Harry tried, quite unsuccessfully, to lie.</p>\n<p>“Is. It. Dead?” Severus loomed over him. How he managed this, Harry had no idea, since they were the same height. </p>\n<p>“Define dead?”</p>\n<p>“I define dead as Not. Being. Alive.” Severus seemed to suddenly notice the backpack at Harry’s feet and before Harry knew it there was a hand around his throat that started squeezing. “Are you telling me, Potter, that you brought a basilisk inside the house my children are sleeping in?”</p>\n<p>Harry coughed and tried to swallow. “Not a basilisk,” he gasped. “Not really. A wizard. Stuck as basilisk. Botched ritual.” </p>\n<p>Severus released him and Harry desperately conjured a glass of cold water to soothe his aching throat. He gulped it down in two seconds flat.</p>\n<p>“A wizard stuck as a basilisk, you say? And how much is he willing to donate before you help him get unstuck? Because I’m assuming that’s why you brought him back.”</p>\n<p>Ah, Slytherins and their pragmatism. You had to love them. “Plenty,” Harry rasped and cleared his throat. “He wants half though.”</p>\n<p>“Hmm.” Severus eyed the buckets of venom. “If he gives us a few more of those I see no problem with that.” Then he rounded on Harry. “I still want him out of my house.”</p>\n<p>“Yeah, okay,” Harry conceded. He’d only brought the suitcase because he was paranoid about leaving it alone in his home. What if it got stolen with Tom inside? “Do you have any idea how to get Tom unstuck?”</p>\n<p>“Who?”</p>\n<p>“Tom Riddle. The basilisk.”</p>\n<p>Severus’ glare was full of condescension. “Harry, you have unlimited access to perhaps the finest magical library outside of Hogwarts. Go and do your homework.”</p>\n<p>“Fine,” Harry sighed. He’d hoped that somehow Severus would have the cure to Tom’s situation handy on a silver platter, but alas, it seemed he was going to have to do this the complicated way. “I’ll floo Reggie.”</p>\n<p>When Sirius Black decided to elope with his half-blood werewolf lover, exactly no one was surprised. A few old biddies spent an afternoon or two sipping tea and decrying today’s youth, but that was about all the fuss it caused. Ever since Sirius was sorted into Gryffindor he had let the world know, loudly and repeatedly, that he was nothing like the rest of his conservative, blood-prejudiced family, and that he couldn’t care less of what society expected of him.</p>\n<p>Sirius was quietly disinherited and his younger brother Regulus was made heir, and that was that. </p>\n<p>But when three years later Regulus Black announced that he was marrying a man, all hell broke loose. Quiet, studious Regulus, the perfect pureblood son was expected to marry a pureblood witch of good upbringing and produce copious amounts of pureblood children. </p>\n<p>The only good thing about Regulus’ intended was that he was a pureblood, but he was neither a witch nor capable of giving Regulus heirs. </p>\n<p>Bartemius Crouch Jr was easily as quiet as Regulus and far more studious. A Ravenclaw, he met Regulus in the Hogwarts library during their fifth year when Regulus looked about ready to burst into tears over a particularly nasty arithmancy problem. Bartemius, who had admired the Slytherin from afar for a while, kindly asked him if he needed help. Regulus accepted the offer and before the year was over they were madly in love and joined at the hip. </p>\n<p>Walburga threatened everything from disinheritance to the Unforgivables. Every single high society luncheon and ball was filled with nothing but gossip of this scandal of the year, nay, the decade. Pollux Black, Walburga’s father, got involved, publically accusing Barty of dosing his grandson with love potions. Barty Crouch Sr wasn’t about to take such an insult to his family lying down and had the entire Auror corps raid Pollux’ family mansion looking for dark artefacts after conveniently receiving an anonymous tip. </p>\n<p>Meanwhile, Regulus kept his chin up and his mouth shut and his hand firmly holding on to Barty’s. No matter how anyone begged, pleaded, bribed or threatened, Regulus would not be dissuaded. </p>\n<p>It was Arcturus Black, still head of the family despite his advanced age, that had to step in to keep the peace in his family, and indeed in the rest of British wizarding society. He declared that Regulus could marry who he wanted and that he would remain heir to the family and could simply appoint someone else in the Black family as his heir apparent.</p>\n<p>On the day of Regulus’ wedding, Sirius showed up uninvited, hugged his little brother and told him he’d never been more proud of him. And thus the rift that Walburga had spent years driving between her sons was fixed once and for all.</p>\n<p>And that was how Harry and Hyacinth grew up with an Uncle Reggie and Uncle Barty added to their extended family.</p>\n<p>After having sworn Severus to secrecy, Harry had gone home and flooed Regulus to ask him if he could stop by the next day. Regulus agreed and was waiting for him when Harry tumbled out of the fireplace the next morning. </p>\n<p>“Uncle Reggie!” Harry cried out in his best child-like voice. </p>\n<p>Regulus sighed. “How often do I have to tell you to call me Regulus? You’re a grown man.”</p>\n<p>“Apparently one more time,” Harry told him with a shit-eating grin, and then just to rub it in he added, “Is Bartemius home? I could use his advice.”</p>\n<p>“You little shit,” Regulus muttered and then turned to call up the stairs. “Barty! The zookeeper’s here, probably freeloading again!”</p>\n<p>Harry bent over laughing as Barty came thundering down the stairs.</p>\n<p>“Hey, Harry. I heard you went to India to meet a basilisk. Are you back already?” Barty gave Harry a pat on the shoulder and then followed his husband into the drawing room. Regulus’ ancient house-elf Kreacher served them tea while Harry got comfortable on the sofa. </p>\n<p>“That’s why I’m here. I need your library, and your expertise, Barty, to help the basilisk,” Harry said. Barty was a Rune and Ward Master and knew a heck of a lot more than Harry did about rituals. In fact, Barty was the kind of person who knew a heck of a lot about most things, and if he didn’t then he needed two hours in Reggie’s family library and he’d be completely informed.</p>\n<p>“Help the basilisk?” Regulus asked with a frown. “What on earth does a basilisk need help for?” </p>\n<p>“A basilisk that is actually a wizard who got stuck after a botched ritual,” Harry explained and took a sip of his tea and watched shock flicker across Barty’s and Regulus’ faces. </p>\n<p>“How the hell did this wizard manage that? What kind of ritual even was it?” Barty wanted to know, ever the Ravenclaw.</p>\n<p>“Who is this wizard? What’s his name?” Regulus demanded, ever the pureblood socialite no matter his slightly more progressive leanings.</p>\n<p>“He got the ritual from a local sorceress. I don’t know more than that yet. And his name is Tom Riddle.”</p>\n<p>Regulus stiffened and very carefully sat his cup and saucer down on the coffee table. “And did Mr Riddle have another name by any chance?”</p>\n<p>Harry blinked in confusion. “Er...oh, some of the snakes there called him Voldemort, but Tom seemed a bit embarrassed by that name.”</p>\n<p>“Did he now,” Regulus said with the kind of forced calm that made the hair on the back of Harry’s neck stand up. </p>\n<p>“You know him?” Barty asked. </p>\n<p>“I know of him.” Regulus inhaled a deep, controlled breath, his grey eyes as sharp as shards of ice. “A few years before his death, my father told me about him when they had Riddle declared legally dead. They hadn’t heard from him in twenty five years and they wanted access to his vault to get back some of the priceless tomes and artefacts several members of prominent families had gifted him.” Regulus picked up his cup again and took a careful sip. “The way my father told it, Riddle was the second coming of Merlin, if Merlin was a blood-prejudiced killer hell-bent on world domination.”</p>\n<p>Harry swallowed against his suddenly dry throat.</p>\n<p>“Riddle was a poor half-blood, but a direct descendant of Salazar Slytherin and a parselmouth. He was also one of the smartest students to ever attend Hogwarts, and more powerful than most of his Slytherin year mates combined. He also really enjoyed doling out the cruciatus curse if any Slytherin did something to displease him. All that, combined with his ambition to rule the wizarding world while permanently getting rid of muggleborns made it so my father and many others of his standing followed a half-blood without question.”</p>\n<p>“Merlin’s saggy pants,” Barty muttered. “Why have we never heard of this guy?”</p>\n<p>“What happens in the Slytherin common room stays in the Slytherin common room. And to the outside, Riddle was a model student. Humble, helpful, a prefect and Head boy. My father said Riddle was one of the greatest actors he’d ever met.”</p>\n<p>“But...” Harry cleared his throat, desperately looking for a way to explain this that didn’t paint the Tom he knew as a monster. Yet no words came to him that could.</p>\n<p>“Riddle was responsible for at least one student death. My father didn’t know the details, but he knew Riddle did it and framed another student. He also knew Riddle murdered his muggle father and grandparents. Again, no details, but Riddle framed it on someone else.”</p>\n<p>Harry gulped down the last of his tea and wiped a hand across his sweaty brow. “It’s been sixty years, though,” he argued weakly. “People change.”</p>\n<p>“They do,” Regulus agreed with the same tight control he’d been holding onto for minutes now. “But I believe, Harry, that you had best make sure you are not simply turning one monster into another before you visit our library.”</p>\n<p>“Yeah,” Harry whispered, having nothing else to say to that.</p>\n<p>“Look at the bright side,” Barty said with forced cheer, “You’ll get to travel to India again. Such a beautiful country with amazing food.”</p>\n<p>Apparently the look Harry gave them was very telling because Barty gasped as Regulus raised his eyebrows. Then both of them noticed the backpack at Harry’s feet.</p>\n<p>“For fuck’s sake, Harry,” Regulus snapped, his calm finally broken, “Get that thing out of my house.”</p>\n<p>“Yeah, sorry,” Harry muttered, grabbing his backpack and standing up.</p>\n<p>Regulus got to his feet as well. “Once you have reached a well-thought out and careful conclusion about the fate of your new friend, I will gladly listen to your arguments and decide to grant you access or not. But until that time, I’m afraid the library is closed.”</p>\n<p>Harry nodded in understanding. He himself was very confused and even a little bit hurt about all he’d just learned. He needed to talk to Tom. He needed to know the truth about the other man.</p>\n<p>Barty jumped up from his leather chair and grabbed Harry by the elbow. “I’ll see you out, Harry.” He guided Harry to the front door, looked over his shoulder to make sure Reggie was still in the drawing room, and then he leaned close to Harry. “Get me that ritual. Any details you can find. Send me an owl and I’ll see what I can do.” He gave Harry a cheeky wink and opened the door for him.</p>\n<p>Ah, Ravenclaws. The thirst for knowledge trumped everything else. </p>\n<p>Harry found a secluded spot around the corner of Grimmauld Place and apparated to the doorstep of his cottage. Once inside he dropped down on the couch and ran both hands across his face. He did not look forward to the conversation he would be having, but he was a Gryffindor and talk to Tom he would no matter how unpleasant. </p>\n<p>He pulled the suitcase from his backpack, flipped the lid open and climbed inside, his heart slowly sinking towards his stomach. </p>\n<p>“You’re back soon,” Tom said as he came sliding out of the desert habitat. “Did you get to visit that library you mentioned?”</p>\n<p>“The Black family library,” Harry said softly.</p>\n<p>Tom’s yellow eyes widened. “You have access to the Black family library?”</p>\n<p>“Yes, the current Head of the Black family is part of my extended family.” Harry summoned a wooden kitchen chair from his living quarters. He needed to sit down because his knees were trembling. “Tell me, Tom. Do you know Orion Black?”</p>\n<p>“Yes, I went to Hogwarts with him. We were dorm mates,” Tom said pleasantly, still not cottoning on to Harry’s growing distress “Is he still alive?”</p>\n<p>“No, he died quite a few years ago, but before he did he mentioned you to his son when they were having you declared legally dead.”</p>\n<p>Tom let out an annoyed hiss and curled his large body around itself. “I was afraid they would do that. Probably wanted their books back.”</p>\n<p>Harry couldn’t stand it anymore. “World domination, Tom? Blood prejudice? The cruciatus curse?”</p>\n<p>Tom stopped moving and he gave Harry a very careful, even a calculating look. “Harry, I can explain.”</p>\n<p>“Explain?” Harry jumped up from his chair. “How do you explain killing a student?”</p>\n<p>“That was an accident, I swear, Harry.”</p>\n<p>“And when you killed your father and grandparents, was that an accident as well?” Harry balled his hands into fists as he glared at the basilisk. </p>\n<p>Tom shot forward until his nose nearly touched Harry’s chest. “They deserved it! They were living in the lap of luxury while they left me to rot in a muggle orphanage. Do you have any idea what it’s like to grow up in an orphanage during the Great Depression? During World War 2? Surrounded by ignorant muggles who punish you every time you accidentally perform magic? Do you, Harry?” He waited a moment but Harry had no response. “Until you do, you do not get to judge me for this. Judge me for everything else, but killing those monsters is something I will never regret.” Tom inhaled a deep breath, his scaly side heaving as he moved back a bit. </p>\n<p>Harry looked down at his shoes for a moment. “Fine, I won’t judge you for that because you’re right. I have no idea what your childhood was like. But everything else, Tom? Explain everything else to me.”</p>\n<p>“Explain?” Tom snorted, shaking his head. “I was young and stupid.”</p>\n<p>“You’ve got to do better than that,” Harry snapped.</p>\n<p>“I can’t explain it to you in just a few words besides that. I was far too clever for my own good and far too ambitious. But the real truth is, that I was far too scared. I had learned long ago in that fucking orphanage that the best way to keep from being hurt was to strike first.” Tom curled up tightly, his coils winding over each other. “When I got to Hogwarts and was sorted into Slytherin as a suspected muggleborn, I very quickly learned that the same principles applied in the wizarding world.”</p>\n<p>Harry sighed, his mind reeling. Tom sounded so reasonable, so likable, so genuine. But Orion Black had called him a great actor, hadn’t he? “I don’t know what to think,” he said honestly. </p>\n<p>Looking at him with wide eyes, Tom crept a little closer. “Please let me explain myself to you, Harry. Please give me a chance.”</p>\n<p>“I don’t know if I believe a word you say,” Harry whispered. Tom released a wounded little hiss and tried to follow Harry to the ladder but Harry stopped him with a gesture. “I need to think about this, Tom. Alone.”</p>\n<p>Tom nodded, looking absolutely despondent. “Just promise me you’ll listen.”</p>\n<p>“I can’t promise you anything right now.” And with that Harry climbed the ladder out of the suitcase. Tom didn’t follow.</p>\n<p>Mind in turmoil and heart aching, Harry made himself a strong cup of tea. He settled on the couch and stared at the opposite wall for a while. This was not at all what he’d been expecting when he’d decided to help Tom change back to his old self. He’d expected hours of research, not having to judge if a fellow human being was even worthy of being a human.</p>\n<p>How had Reggie put it? He might be changing one monster into another. </p>\n<p>Then again, people did change, didn’t they? The problem was, Harry had no idea if what Tom was telling him was even true. Tom could tell him all sorts of pleasant things, meanwhile plotting murder and mayhem. How was Harry to know?</p>\n<p>The facts didn’t lie. Tom had murdered people. His own father. Sure, he had reasons to hate the man, but that wasn’t a justified reason to kill him, was it?</p>\n<p>A knock sounded on the front door. With a sigh, Harry got up, determined to send away whoever it was. He really wasn’t in the mood for company right now. </p>\n<p>Harry opened the door and came face to face with Blaise. Arms loosely crossed, shoulder leaning against the doorpost, Blaise struck a carefully constructed, carefree pose. </p>\n<p>“Hello, my dear,” Blaise said with a little smirk. “I heard you got yourself a pet basilisk.”</p>\n<p>Harry grabbed Blaise’s wrist and yanked the man inside, quickly shutting the door. “Who told you this? Severus? Reggie? If this gets out, if the ministry finds out I have –“</p>\n<p>“Relax, Harry dearest,” Blaise said with the kind of smug smile that drove Harry to contemplate murder. “I merely heard you were looking for a basilisk in India and, knowing you, I drew a few logical conclusions.” Leaning over, Blaise gave him a quick kiss on the lips. “And you, my sweet Gryffindor child, have just confirmed all I needed to know.”</p>\n<p>Harry stared in disbelief. He probably should be surprised, but he’d been hanging around Slytherins in general and Blaise specifically long enough to know how cunning they could truly be. He sighed, shook his head and marched back to the couch. Throwing himself on it, he dropped his head back and stared up at the ceiling. </p>\n<p>“You look like you have all of the world’s problems resting on your shoulders.” Blaise moved around Harry’s living room towards the liquor cabinet with the familiarity of someone who had spent a lot of time there looking for missing socks and boxers in the dark at three in the morning. He grabbed two tumblers from the cabinet and filled both with a generous serving of firewhiskey.</p>\n<p>“For fuck’s sake, Blaise, it’s not even noon yet,” Harry complained, but he accepted the drink and took a fortifying swallow.</p>\n<p>Blaise sank down on the sofa beside him and carefully arranged his acromantula silk robes while crossing one leg over the other. Blaise liked to present himself as a wizard of leisure but Harry knew he was an avid investor in both magical and muggle businesses, and that kept him plenty busy. It also kept him plenty rich.</p>\n<p>Blaise indicated the suitcase, sitting on the floor in front of the fireplace, with a twist of his foot. “I knew when I started associating with Gryffindors I would be living dangerously.” He raised his glass at Harry. “But contrary to you, I need my courage to be liquid when I’m in the same room as a basilisk.”</p>\n<p>Harry sighed and took another sip. “He’s not a basilisk. He’s a wizard who got stuck as a basilisk after a botched ritual.”</p>\n<p>Blaise raised a single eyebrow, but barely, as though he was only a tiny bit impressed.</p>\n<p>“And I was going to help turn him back, but now I’ve found out he wasn’t a very nice guy before and I’m not sure if he deserves to be human again.”</p>\n<p>“Hm.” Blaise glanced at Harry, swirling the whiskey around in his glass. “How long has he been stuck?”</p>\n<p>“Sixty years.”</p>\n<p>“A lot can change in sixty years, especially people,” Blaise said with a knowing smile. “This reminds me of someone else who changed quite a bit, though he needed far less time than sixty years.”</p>\n<p>“Draco?” Harry guessed.</p>\n<p>“No.” Blaise frowned. “Well, yes, but that is not who I meant. I was talking about you.” And to drive his point home, Blaise poked him in the chest with a finger.</p>\n<p>“Me?” Harry asked, affronted.</p>\n<p>“Harry, dear, you were a self-righteous little prick for most of your Hogwarts career. You are a parselmouth and yet you despised everything and everyone Slytherin, simply because of what an enchanted piece of cloth said about us when we were eleven. And you didn’t start changing until our sixth year.”</p>\n<p>Harry swallowed, memories rushing him. “That summer, after my OWLs, I told my parents I wanted to be a zoologist. They had always assumed, though they never asked, that I would become an Auror. We had the biggest fight and I realized I’d been trying to be someone I’m not, so I changed.”</p>\n<p>Blaise gave him a fond smile. “I remember it well. October of our sixth year in the library. You passed me in the stacks and you said hi with a smile on your face.” Blaise clutched a hand to his chest. “I was so shocked I almost fainted. And when I told Draco what happened he didn’t even believe me.”</p>\n<p>Harry punched Blaise lightly in the arm though he couldn’t hold back a grin.</p>\n<p>“And even then it took you another three years to have a polite conversation with a Slytherin without looking like you’re constipated.” Blaise observed Harry quietly for a moment. “Rather like you were looking earlier. So I can only assume the gentleman in question is a Slytherin.”</p>\n<p>“How did you...” Harry narrowed his eyes. “Are you using legilimency?”</p>\n<p>Blaise cracked a sly grin. “There is no need for that, my dear. To me you are an open book.” Blaise ignored Harry’s grumbling with all the grace of a cat who ate both the canary and all the cream. “So we have a no-name half-blood or muggleborn sorted into Slytherin at least 70 years ago.”</p>\n<p>“How could you possibly know he’s – “</p>\n<p>Blaise waved Harry’s interruption away. “If he was a member of a pureblood family you would have told me his name already. Anyway, Slytherin has a very specific culture within its walls. Eat or be eaten. The weak will sink to the bottom while the strong rise to the top. And especially that long ago these traditions were still accompanied by a certain amount of violence.”</p>\n<p>Harry frowned. He’d heard enough about Slytherin House over the years from Severus and Reggie and Blaise to know he was glad to have chosen Gryffindor, but was that really enough to explain Tom’s behaviour? Better yet, to excuse it?</p>\n<p>“You must remember, though, that whatever his past sins were, the man has spent sixty years trapped as a serpent. One could assume that he’s been punished enough.” Blaise gave Harry a patient look while Harry mulled this over.</p>\n<p>With a sigh Harry downed the last of his whiskey and placed the empty glass on the coffee table. He sat forward, resting his elbows on his knees and wringing his hands.</p>\n<p>“You have a point,” Harry said, while Blaise placed a comforting hand on his back. “But I don’t know if I can trust anything he says. He could pretend to be a model citizen and the moment I help turn him back he could go and murder anyone I care about in their sleep.” </p>\n<p>“Ah,” Blaise said, rubbing lazy circles across Harry’s back. “I see what this is about. Your family was betrayed once before, and now you fear being betrayed again.”</p>\n<p>Harry glanced over his shoulder at Blaise while he raised his eyebrows. “You mean Pettigrew?”</p>\n<p>Blaise nodded. “I mean Pettigrew.”</p>\n<p>Peter Pettigrew had been best friends with Sirius, Remus and his father all throughout their Hogwarts years and beyond. He’d kept up the act of good and loving friend for years while he secretly built a criminal organization that sold everything from illegal potions and endangered magical creatures to child prostitutes. He’d used all the information he learned from James and Sirius, who were assigned to the case as Aurors, to always stay a few steps ahead of law enforcement. And when his organization finally was exposed he almost managed to frame Sirius and Remus, having long ago fabricated ‘evidence’ that pointed in their direction. And plenty of people, even some of Sirius’ own colleagues, had bought it. After all, Sirius came from a dark family and was married to a werewolf. They were quickly thrown in prison to await trial.</p>\n<p>Pettigrew might have gotten away with it, too, if it wasn’t for Regulus Black. Reggie didn’t believe for one second that his brother was capable of such things, and he brought the might of the Black family down upon the Ministry. Every great-aunt and uncle, every second and third cousin was called upon to investigate, threaten or bribe anyone necessary until the truth was revealed. Pettigrew was sentenced to life in Azkaban.</p>\n<p>Harry, barely eight years old at the time, remembered a lot of crying and shouting from his parents and later on, when Sirius and Remus were released from prison, a lot of hugging and again a lot of crying. It had changed them, though, as people and as a family. Lily became a lot more suspicious of others and James lost a lot of sympathy he might have had for people who found themselves in trouble with the law through life’s unfair circumstances.</p>\n<p>And Harry learned that trusting people, even those you thought were good friends, came with huge risks.</p>\n<p>“Yeah, maybe,” Harry said with a deep sigh. “Though why my parents ever trusted Pettigrew in the first place is a mystery. The bastard turned into a rat for fuck’s sake. That was a pretty clear indication of his character.”</p>\n<p>“If only our mystery wizard was an animagus, we’d be able to judge his personality easily enough.” Blaise himself had become an animagus with Harry’s help. He turned into a raven. A fitting form for a clever and resourceful Slytherin with commitment issues.</p>\n<p>Harry sat up and looked at Blaise with wide eyes. “Tom told me he’s an animagus, but he didn’t mention his form.”</p>\n<p>Blaise gestured towards the suitcase. “Then I suggest you go and find out what it is.” And with that, Blaise emptied his glass in a single go and got up from the couch. “Sorry to cut this short, but I have an appointment in Aberdeen in fifteen minutes.”</p>\n<p>“Thanks, Blaise,” Harry offered with a smile as he walked Blaise to the door.</p>\n<p>“Anytime, my dear.” Blaise cupped Harry’s face with a warm hand, gently running his thumb across Harry’s cheekbone. “Though if you want I can come back later to help you take your mind off your troubles for a while.”</p>\n<p>Harry gulped. While he and Blaise had officially broken off their relationship years ago, whenever they were both available they still hooked up from time to time. The sex was pretty fucking spectacular, but that wasn’t the only reason. Sometimes it was just plain comforting to sleep wrapped in a pair of arms belonging to someone you loved and trusted. And while Blaise never said such things out loud, Harry knew he felt the same.</p>\n<p>Tempted beyond belief, Harry considered the offer for a moment but ultimately realized he had other, bigger things on his plate right now. Namely a sixty foot basilisk named Tom. “Maybe next time.”</p>\n<p>Releasing his face, Blaise gave him a knowing smile. “Yes, I suppose you’ll want to spent some time with your new paramour.”</p>\n<p>Harry sputtered. “He’s not my paramour.”</p>\n<p>“Isn’t he? Then why are you feeling so hurt by what you’ve found out about him?” And before Harry could reply, Blaise slipped out of the door and apparated away. </p>\n<p>Ugh. Fucking Blaise and his annoying habit of always needing the last word. Harry shook his head and closed the door. He contemplated making himself a strong cup of tea to ward off some of the effects of the whiskey, but quickly decided he had no patience for that.</p>\n<p>He needed to know what Tom’s animagus form was because it would say a lot about the man’s personality. It was by no means an exact science, but in Harry’s experience it was a pretty good indicator. </p>\n<p>Sirius, loyal to a fault, loving but aggressive when needed, turned into a big dog. His father, social, loving to his family, but full of pride, turned into a stag. Blaise and his clever, resourceful raven. Pettigrew, willing to sell out his closest friends, abandon them to a fate worse than death, became a snivelling rat.</p>\n<p>There was a lot of information to be found in the kind of animal that chose you, both as an animagus and for your Patronus charm. The animagus transformation and the Patronus charm had been areas of magic Harry had been interested in during his years at Hogwarts and he’d studied them vigorously. Hermione used to tease him it was because both fields featured animals, and Harry supposed that was true, but he also was fascinated about what the inner animal said about the person once they were revealed.</p>\n<p>So Harry was quite confident he could make an educated guess as to Tom’s real personality once he knew what kind of animal lurked beneath his skin. </p>\n<p>He flipped the suitcase lid open and climbed down. Almost immediately, Tom came sliding out of the temperate habitat. </p>\n<p>“Harry,” Tom breathed, and then seemed at a loss for words as he gave Harry an anxious look. </p>\n<p>Harry pursed his lips and ignored the nervous fluttering in his stomach. “Tom, I am going to ask you one question and you need to answer honestly.”</p>\n<p>“Yes, anything,” Tom said at once, no hesitation. </p>\n<p>“What is your animagus form?”</p>\n<p>Tom blinked his big yellow eyes at Harry. “My animagus form?” Tom ducked his head, looking away from Harry. “It’s...” And Tom muttered something unintelligible.</p>\n<p>Harry bit back a sigh of frustration. “A what, Tom? Speak up.”</p>\n<p>Tom’s blazing look was positively defiant. “It’s a magpie, all right? An itty, bitty bird. Some animagus form for the wizard that once aspired to become the greatest dark lord that ever lived.”</p>\n<p>Releasing a shuddering breath, Harry lowered his head. A bird, which meant a thirst for freedom or wanting to break away from something. A magpie, which was a thief and a trickster, but which also represented joy and good fortune. An animal with a dual nature, delivering both good and bad omens. </p>\n<p>In other words, someone capable of both good and bad, possessing both a dark and a light side. </p>\n<p>In short, a normal human being. Not some evil megalomaniac set on death and destruction. </p>\n<p>“Okay,” Harry said with a relieved sigh. “I can work with this.” </p>\n<p>Tom observed him quietly. “This pleases you?” he whispered.</p>\n<p>“Yes, in so far that I’m willing to listen to what you have to say for yourself. I’m willing to give you a chance.” Harry grabbed the chair he’d left standing in the holding area earlier, flipped it the wrong way around and sat down, arms leaning on the backrest. </p>\n<p>Releasing a long hissed breath, which sounded more relieved than anything else, Tom slid a little closer to Harry and gave him an expectant look.</p>\n<p>Harry considered the situation for a moment. He wanted, needed to know everything about the other wizard if he was to make any kind of informed decision. “I’m not sure where to begin. Maybe we should just go about this the Gryffindor way and dive in headfirst.” He gave Tom a long, hard look. “What would you say is the worst thing you’ve ever done?</p>\n<p>“Easy,” Tom said with a pained yet resigned sigh. “It’s also the stupidest thing I’ve ever done. I once split my soul.”</p>\n<p>“You split your soul,” Harry repeated, but no matter that he heard the words again, they still made no sense to him. “Why would you even think of doing that?”</p>\n<p>“Immortality,” Tom said in the kind of tone that suggested he was tired of even thinking about the subject, let alone talking about it. But he soldiered on. “All throughout my Hogwarts years I asked Dumbledore and Dippet to let me stay at Hogwarts during the summer. They always refused, even when the war broke out and the Blitz hit London. I had to spend months during the summer hoping the orphanage wouldn’t take a direct hit while around us street after street, building after building was destroyed by muggle bombs dropping from the sky.”</p>\n<p>Harry listened quietly, wondering why no one had thought to offer those magical kids living in London during the Blitz a place to stay outside of the city. He knew from his history lessons at the muggle primary school he and Hyacinth had attended that a lot of muggle children were evacuated from London to the countryside to stay with complete strangers for their own safety. </p>\n<p>“I was genuinely terrified I wouldn’t see my next school year,” Tom continued. “So when I came across a method for immortality in the restricted section, it seemed like a perfect solution to my problems.” Tom fell quiet for a moment, eyes squeezed shut. “I was so terrified to die, so desperate to stay alive that I never wondered about the real consequences of such a method. As I know now, all rituals that promise powers of that magnitude come at a terrible price.”</p>\n<p>“What was the price?” Harry asked, fascinated yet horrified by the idea of achieving immortality by literally ripping your essence apart. </p>\n<p>“Insanity,” Tom whispered, eyes still shut as though admitting these things physically pained him. “The price was slowly becoming insane without even realizing it.”</p>\n<p>Harry wrung his hands, his head down. That certainly explained a few things, didn’t it? Why Tom choose to do some of the things he did. </p>\n<p>“But there was another price to pay,” Tom went on, finally opening his eyes and giving Harry a resigned look. “The only way to split your soul is to commit murder.”</p>\n<p>Inhaling a sharp breath, Harry sat back a little and stared at Tom, meeting his yellow gaze head on. There it was. The reason Tom decided to kill someone, a fellow student if Harry guessed correctly. </p>\n<p>“I wasn’t sure I could do it,” Tom said, coiling his body tighter around himself. “At this point I was a child that had grown up in a harsh environment, that had to fight for every scrap of anything he’d ever gotten, that gave as good as he got, but I wasn’t a killer. Still, I was desperate and terrified. I got lucky when I found the Chamber of Secrets.”</p>\n<p>Harry, who had been staring at the floor, snapped his head up. “The what now?”</p>\n<p>“The Chamber of Secrets,” Tom said slowly with an amused glint in his eyes. “Salazar Slytherin himself built it when they constructed Hogwarts. It requires parseltongue to enter it.” </p>\n<p>Astonished there were still parts of Hogwarts he hadn’t known about, Harry slowly closed his mouth which had dropped open. He’d used his father’s Marauder’s Map diligently throughout his Hogwarts years and he was certain he’d explored every last inch of the castle. Apparently, though, he’d missed a spot.</p>\n<p>“Slytherin left a basilisk inside the chamber and I used her to take out my anger and resentment on the student population during my fifth year. I didn’t mean for her to kill anyone, just petrify a few muggleborn students who got to go home to safe places in the muggle world. But there was a student hiding in the bathroom when the basilisk left the tunnel to her lair and before I could stop her she’d killed the girl.”</p>\n<p>Harry’s mouth had dropped open again. “Tom,” he said, and swallowed once, twice. “Tom, what happened to the basilisk?”</p>\n<p>“She went back to the chamber and stayed there, hibernating. I didn’t dare open the chamber again while I was at Hogwarts.”</p>\n<p>“Tom,” Harry said again, voice pitched higher, in tune with the rising panic bubbling in his chest. “Is there currently a basilisk at Hogwarts? A basilisk that’s already killed at least one student?”</p>\n<p>“When you say it like that, it sounds quite terrible,” Tom said with a little shake of his head. “She’s asleep, I told you.”</p>\n<p>“How do I get into the Chamber of Secrets?” Harry demanded as he got up from his chair. There was no way he was leaving a basilisk sleeping in a secret room at Hogwarts. People he knew and cared about worked there or attended it. “We’re getting that basilisk and we’re relocating her to your old home in India. That’s already warded and the local government knows a basilisk lives there. No need to tell anyone we’ve replaced you with her.”</p>\n<p>“Very well,” Tom said with a resigned nod. “The girl’s bathroom on the second floor. There is a sink with a tap with a snake on it. Speak parseltongue and the entrance will open.” Tom frowned at him. “Best let me out after that point to talk to Aisa. She wasn’t all that put together after spending so many centuries alone.”</p>\n<p>“Fine. I’ll call you out once we get there.” Harry gave Tom a firm nod and climbed the ladder out of the suitcase. </p>\n<p>Harry had spent quite a bit of time during his Hogwarts years sneaking out of the castle, but this was the first time he’d be sneaking in. Usually, when he needed to be at Hogwarts, Hagrid simply let him in. But he couldn’t risk anyone finding out about the basilisk. She’d almost certainly be killed, especially if people found out she’d actually killed a student in the past, and Harry wouldn’t allow that to happen. Whatever happened, it wasn’t the basilisk’s fault. She’d been locked up in a castle for centuries. She deserved whatever semblance of freedom Harry could give her. A nice set of caves in a vast yet warded forest in India seemed like a pretty good deal compared to a secret chamber in a cold and damp castle in Scotland.</p>\n<p>Thankfully, it was the summer so the castle would only house a few staff members. No students would be endangered. Still, Harry would be transporting an actual basilisk halfway around the world this time, not just a wizard stuck as one. It couldn’t hurt to be prepared, so Harry grabbed a decorative pillow from one of the armchairs near the fireplace and transfigured it into a rooster. After making sure he could make it crow on command with a well-placed imperius curse, Harry hit it with a sleeping charm and stuffed it in his backpack.</p>\n<p>The Unforgivables were only unforgivable when cast on humans. That was a nice little loophole most magical zoologists readily exploited when subduing prey animals or relocating dangerous beasts. </p>\n<p>Harry also grabbed the Marauder’s Map from his old school trunk that was stored in his attic. Finally, he draped the invisibility cloak around his shoulders and he was ready to do some breaking and entering. </p>\n<p>Honeyduke’s was open for business as usual and Harry had no problem slipping inside after a customer. He wasted no time and made his way to the cellar and through the trapdoor into the dark tunnel that led straight to Hogwarts. He lit his wand and activated the map, studying the positions of various staff members as he made the long trek. </p>\n<p>Hagrid was on the grounds, McGonagall was with teachers he wasn’t familiar with named Bilkes and Roseworth in the Great Hall and Dumbledore was in his office. Harry would enter Hogwarts on the third floor, so he’d have to hurry down one floor and into the bathroom and he’d be in the clear. </p>\n<p>Just as Harry neared the entrance behind the statue, Dumbledore left his office. Harry wondered if he’d tripped the wards. Squeezing himself through, Harry kept a close eye on the map. Dumbledore was slowly but surely making his way to the third floor. </p>\n<p>Bugger that. Harry was not ready in any way to explain to the headmaster why he was kidnapping a basilisk from the castle, and more importantly, how he even knew the animal was there in the first place. Thankfully, Dumbledore was beyond ancient and used a cane to get around. And Harry was in the prime of his life, supposedly. </p>\n<p>Casting a silencing charm on his feet, Harry wrapped his invisibility cloak tightly around himself and made a run for it. He dashed through the corridor, practically threw himself down the stairs to the second floor and then was stumped for a moment where the girl’s bathroom even was. It’s not like he’d ever had to use it while attending school. </p>\n<p>“Come on, come on,” Harry muttered to himself as he speed-walked up the corridor until he spotted the bathroom in question. He burst through the door and immediately started speaking in parseltongue. “Open, Chamber of Secrets, where ever you are.”</p>\n<p>To his left a section of the wall started moving, stone grinding across stone. </p>\n<p>“Yeah, that’s not loud at all,” Harry whispered, just as a female ghost came flying out of a toilet stall. </p>\n<p>“Who is there? Who is talking? This is a girl’s bathroom, and I can hear you’re a boy!”</p>\n<p>Harry ignored the wailing ghost and squeezed himself through the gap as soon as it was large enough. “Please close now. Good chamber, what a good chamber you are.” The wall stopped moving for a second before it started sliding closed again. </p>\n<p>Harry let out a sigh of relief, and then realized it was quickly becoming pitch black. “Lumos,” he said as he drew his wand from its holster. What greeted him was an abyss. “Couldn’t have warned me, Tom,” he complained as he summoned his broom from his backpack. He’d learned long ago that a broom was a very valuable tool in his line of work. It only took a minute to fly down what Harry realized was some kind of big stone sewer pipe that ended in a cavern with a low, rocky ceiling. </p>\n<p>It was probably a good idea to let Tom out now because Harry had no idea where the other basilisk was hiding. He pulled the suitcase from his backpack, opened the lid and stuck his head inside. “Tom! We’re in the chamber!”</p>\n<p>Harry heard Tom before he saw him, scales scraping across the floor as Tom moved towards the ladder. Harry stood back as Tom emerged from the suitcase, tongue flicking in and out eagerly and almost anxiously.</p>\n<p>“This isn’t the chamber yet,” Tom told him once he was free and Harry tucked the suitcase away. “But I can smell a shed skin to our right if you want to collect it.”</p>\n<p>Of course Harry wanted to. More Galleons in the bank. The skin was in pretty good shape, so Harry folded it carefully and dropped it down into his suitcase. That would do for now. Tom was already moving forward and Harry had to hurry along to catch up with him. They saw a round, metal door which opened the moment Tom spoke to it in parseltongue. Apparently Salazar Slytherin wasn’t big on actual security, perhaps trusting that only his own kin could speak the language of serpents. Well, Harry was living proof good old Sal was wrong about that. </p>\n<p>“Now this is the Chamber of Secrets,” Tom said as Harry followed him through the round door. Around them torches lit up with bright orange flames. Harry admired the charm work that must have been applied many centuries ago but still worked like, well, a charm. Statues of snakes lined a stone walkway that ended in a large room dominated by a truly ugly statue of a wizard. </p>\n<p>“Best stay behind me now, Harry,” Tom whispered and Harry did as he was told for once. No need to accidentally provoke a thousand year old basilisk in taking a bite out of him.</p>\n<p>“Open,” Tom called towards the statue, and Harry watched in surprise as the mouth and jaw unhinged to form a tunnel. “Aisa, wake up, dearest. It’s Tom.”</p>\n<p>“Tom?” a hissed voice echoed in the dark tunnel before them. The voice was distinctly female though just as other-worldly as Tom’s. </p>\n<p>“Yes, it’s me,” Tom said, slowly winding closer to the statue. “I’ve brought a friend. He’d like to meet you.”</p>\n<p>The basilisk that emerged from the tunnel was, if anything, even bigger than Tom. On second thought, Harry realized, that wasn’t all that strange taking her age into account. </p>\n<p>“Tom, you look different. I was so worried when you stopped visiting,” Aisa said as she slithered towards Tom and gently bumped her nose against his. </p>\n<p>“I’m sorry I had to leave like that, but it wasn’t safe.” Tom gestured towards Harry with his head. “This is my friend Harry. He’s here to take you to a beautiful new home.”</p>\n<p>“Hi,” Harry said with a little wave as he took a careful step closer. </p>\n<p>“You brought me another speaker,” Aisa said happily. “Hello, Harry. Why do you want to take me away from my home?”</p>\n<p>“Er...because your new home is a beautiful set of caves in a large forest. Lots of deer to hunt and sun to bask in.” Harry gestured around the chamber. “A much nicer environment than this.”</p>\n<p>“Will you be there, Tom?” Aisa asked as she pressed her side against Tom’s large body. </p>\n<p>“I will visit,” Tom assured her. “As will Harry.”</p>\n<p>“Yes,” Harry quickly confirmed. If they played this right, they’d have a supply of basilisk venom and shed skins for the rest of their lives, even after Tom became human again. Harry did not want to screw this up. </p>\n<p>“Harry, why don’t you show Aisa how she will be travelling,” Tom suggested with a pointed look. </p>\n<p>“Aisa, you’ll be travelling in style,” Harry said as he got his suitcase out and opened it. Tom slid inside first while Aisa looked on curiously. “Go on, you’ll love it,” Harry told her and after a few more moments of intense tongue-flicking Aisa followed Tom down the metaphorical rabbit hole. Harry quickly slammed the lid closed, trusting Tom to give Aisa the grand tour and explain things if she had any questions. </p>\n<p>Harry wanted to get out of there and get Aisa relocated as quickly as he could. Yes, he’d wanted to meet a basilisk, yes, he’d sought one out, but that turned out to be a wizard in disguise. The idea of taking an actual basilisk into populated areas made Harry very nervous indeed. He was immune to the basilisk’s lethal gaze, but the rest of the world wasn’t. Aisa was, in essence, a magical weapon of mass destruction and the damage she could do if she got out at the wrong moment was unimaginable. Harry inhaled a deep breath to calm his wily nerves and pulled out the map to see if it was safe for him to exit the chamber.</p>\n<p>Dumbledore was walking through the second floor corridor. </p>\n<p>“Buggering fuck,” Harry muttered. He was almost sure at this point that he’d tripped some kind of ward and that Dumbledore knew someone had snuck in. And the ghost in the bathroom may have told him what she’d seen and heard.</p>\n<p>Wait a minute. Did Hogwart’s wards encompass the chamber? If it had been built to be a secret then there was a good chance the wards didn’t cover it. Harry pulled out his wand and cast every ward detection spell he knew. He smiled. He was right. He could get out of there without trekking all the way back through the castle and alerting Dumbledore even more to his presence. Harry picked up his backpack and apparated home. </p>\n<p>He didn’t waste any time and sent a quick Patronus to Severus, telling him he was travelling back to India for reasons and not to expect him back for a week or so. Harry’s friends and family were used to Harry leaving the country at the drop of a hat, and if they needed him they knew to check with Severus where he was at any given time. </p>\n<p>Harry booked the necessary port-keys and left immediately. He made a pit stop in the black forest in Germany and summoned a handful of deer and wild boar, which he unceremoniously levitated down into the suitcase, trusting that two basilisks knew how to hunt them. He guessed Aisa had to be hungry and this way she’d be less tempted to have him for dinner. </p>\n<p>It wasn’t until a stopover in Pakistan that the excitement of the last few days caught up with Harry and he felt dead on his feet. He booked a simple, cheap hotel room, but still pulled out his suitcase and opened it. He preferred to sleep in his own bed in his living quarters. He made sure to close and lock the lid behind himself so there would be no basilisk encounters of the accidentally lethal kind if the maid decided to stop by unannounced. Tom and Aisa were nowhere to be found, but Harry trusted they’d found a comfortable spot for themselves to spend the journey. </p>\n<p>Stretching out on the sofa with a cup of tea, Harry pulled out his journal to log the latest developments. Just winding down for a moment before calling it a night. </p>\n<p>The door burst open and Tom rushed inside. All sixty foot of him. Harry’s living quarters were tiny. It didn’t fit and Harry’s coffee table cracked and then crumbled beneath Tom’s coils. Tom wound himself up as small as he could and gave a gaping Harry a pleading look.</p>\n<p>“Harry, you have to help me!”</p>\n<p>“What the hell, Tom,” Harry said as he looked around his living quarters. The coffee table had disappeared under Tom’s bulk entirely and Harry’s small desk against the opposite wall was lost as well.</p>\n<p>“It’s Aisa,” Tom said, his scaly sides heaving with every anxious breath he took. “She keeps trying to...mate with me.” Tom buried his nose inside his coils, eyes peeking over just enough to give Harry a look that dared him to laugh.</p>\n<p>Harry couldn’t help himself. He guffawed. He quickly pressed his fist against his mouth to control himself, but it was no use. He fell over on the couch, laughing until his sides hurt. </p>\n<p>Tom hissed. “So glad my misery amuses you so.”</p>\n<p>“Sorry,” Harry said, not feeling sorry at all. He inhaled a few big gulps of air, trying to calm down enough to have an actual conversation. “I’m surprised you’re turning her down,” Harry said, barely holding back a snigger. “It must be at least 60 years since you got laid.”</p>\n<p>“She isn’t exactly my type,” Tom snapped, burying his head even deeper inside his coils. </p>\n<p>“Too scaly?” Harry guessed.</p>\n<p>“Too female,” Tom replied with an edge to his voice. He raised his head a little and looked at Harry with a challenge in his yellow eyes.</p>\n<p>Harry held up a hand immediately. “Mate, I’m gay myself. The wizarding world has become a little more accepting in the past decades. Even the head of the Black family is married to a man. You don’t have to worry about this at all.”</p>\n<p>“Truly?” Tom raised his head, coils visibly losing some of their tension. “In my youth it wasn’t talked about in polite pureblood society. If one was inclined to prefer one’s own gender, it was expected one marry the opposite gender anyway and just dally on the side.”</p>\n<p>Harry nodded in agreement. “There are still families like that these days, but they are few and far between.”</p>\n<p>“That is a welcome development.” Tom stared at Harry for a long moment. “Are you married to a man, then?”</p>\n<p>“No,” Harry said with a shake of his head. He reached for his cup of tea, realized it had been lost beneath Tom’s bulk, and just sat back with his hands folded in his lap. “Not for lack of trying. I’ve dated some, but I’m away for work so often that maintaining a relationship is difficult.”</p>\n<p>“I can imagine. Magical zoology certainly is an interesting career choice.”</p>\n<p>“Are you complimenting me, Tom?” Harry said with a teasing smile. “I’m certain I heard a compliment in there somewhere.”</p>\n<p>“Don’t be absurd,” Tom said with a snort. “I’m merely commenting on your privileged background, that you were able to choose such a financially mediocre career.”</p>\n<p>Harry wasn’t surprised or insulted by Tom’s assumptions. He knew his last name made people believe they knew him and his family. “Yeah, you couldn’t be more wrong,” Harry said with a sharp smile.</p>\n<p>“Oh?”</p>\n<p>“My parents weren’t exactly happy with or supportive of my career choice,” Harry explained patiently. Any old feelings of anger or frustration he’d had about his parents’ decisions had long been erased by the success he’d had with his chosen careers. “They made it very clear they would not be paying for my mastery or my upkeep while I pursued magical zoology as a career. So I played professional Quidditch for a few years while I got my mastery in Care of Magical Creatures. I got signed right out of Hogwarts by the Montrose Magpies as their new Seeker and that allowed me to move out of my parent’s house and go my own way.”</p>\n<p>“You were a magpie,” Tom said with a smile in his voice. “How amusing.”</p>\n<p>“Look who’s talking. My animagus form isn’t a little black and white bird, just in case you were wondering.”</p>\n<p>“I was wondering.” Tom’s smile turned into a toothy grin. “I’ve told you mine. Perhaps you should share with the class now, Harry.”</p>\n<p>“Nah, I don’t think I will.” Harry couldn’t help returning Tom’s smile with a teasing one of his own. “Too tired right now. I’m going to bed.”</p>\n<p>Before Tom could reply there was a thump coming from the door, sounding exactly like a basilisk bumping her nose against the wood. Another thump, and another one. </p>\n<p>“Tom?” Aisa called out. “Tom, are you in there? I can smell you.”</p>\n<p>Tom ducked his head back inside his tightening coils, giving Harry a desperately pleading look.</p>\n<p>Laughing all over again, Harry managed to call out, “Tom’s not feeling very well, Aisa. He’s asleep right now, and I’m about to turn in as well.”</p>\n<p>“Oh.” Aisa sounded disappointed indeed. “Then I will see him in the morning.”</p>\n<p>“Good night!” Harry said cheerfully, and both he and Tom listened to the sound of Aisa slithering away from the door. </p>\n<p>“Thank you.” Tom’s voice was soft but heartfelt. “Please let me sleep in here tonight.”</p>\n<p>“Yeah, sure,” Harry said, since he couldn’t very well let a man spend the whole night being sexually assaulted by a giant snake. “I wasn’t lying when I said I was tired, though.”</p>\n<p>“It’s been a very exciting few days, hasn’t it?” Tom said, moving his body away as much as he could so Harry had room to leave the couch. Harry still had to climb across Tom’s body to get to his bedroom. </p>\n<p>“It sure has been,” Harry agreed as he stepped inside his bedroom. “Good night, Tom.”</p>\n<p>“Good night, Harry.”</p>\n<p>It wasn’t until Harry was tucked in his bed and stared up at the ceiling that something occurred to him. “Why would Aisa be trying to mate with you?” he called out towards the living room. “Do basilisks even reproduce sexually? In order to create a basilisk you have to –“</p>\n<p>“Stick a chicken egg under a toad and let them hatch it,” Tom finished for him as he stuck his head inside Harry’s tiny bedroom. Harry turned on his side to look at him. “I have no idea if basilisks can breed but Aisa certainly thinks so.”</p>\n<p>“You know,” Harry said with a snigger as an idea came to him. “Maybe you should give it a go, you know, for science.”</p>\n<p>“Absolutely not.” Tom gave him a look that spoke of being deeply, deeply insulted. “I will not subject myself to these kind of sexual acts just so you can satisfy your professional curiosity.”</p>\n<p>“Aw,” Harry said with an exaggerated pout. “Just close your eyes and think of England. I’ll even give you credit in the paper I’ll be writing about your sexy times with Salazar Slytherin’s giant snake.”</p>\n<p>“You are an impossible child.” Tom threw his nose in the air and retreated back to the living room. Harry was sure he heard the couch groan and crack in a way it shouldn’t, but he was too amused to care. Besides, he had magic. A few waves of his wand in the morning and everything would be fixed. Harry closed his eyes and fell asleep with a smile on his face.</p>\n<p>It wasn’t until the next day, after Harry arrived in Mumbai for the second time in a week that it occurred to him that he’d had a really nice time talking to Tom, and he wasn’t sure how he felt about that. </p>\n<p>Tom was a murderer and a man who had once aspired to become the world’s most powerful Dark Lord. Harry had heard that from Tom’s own lips. Then again, Tom had been an utter imbecile while still a child in many ways and had accidentally turned himself insane. There was still a lot Harry didn’t know about Tom and what exactly had happened to him over the years. </p>\n<p>Not to mention, Harry still didn’t know what kind of ritual Tom had used. Harry was determined to find out all this and more, but after he relocated Aisa. Harry didn’t think he’d ever been as nervous in his whole life as he was when he walked from the Mumbai portkey station through some very busy muggle areas to the public floo stations. Around him, hundreds of people were going about their day, driving cars while honking their horns, selling and buying spicy foods in dozens of shops and stalls, and here Harry was walking among them while carrying two creatures around in his bag that could kill them all with a look. </p>\n<p>Harry allowed himself no more distractions, internal or external, and focussed on getting to Van Vihar National Park as fast as he could. It took him another day of travelling and of sharing his living quarters with Tom while he caught a few hours of sleep until he stood in front of the ward line again. The crack he’d opened a week ago was still there, closed again but easily wrenched open with a few flicks of his wand. Inside the warded area Harry used his broom to get to the cave system Tom had called home for sixty years.</p>\n<p>Everything looked the same as how they’d left it and Harry doubted anyone had even noticed the basilisk missing for a week. They probably wouldn’t notice a different basilisk, opposite gender and all, taking up residence either. Harry opened the suitcase in front of the cave system. </p>\n<p>“Aisa, Tom, we’re here.” Harry stood back as Aisa stuck her head out of the suitcase, flicked her tongue a few times, and then slid outside, blinking in wonder while looking up at the sun. Tom was far more reluctant to follow. </p>\n<p>“It smells so nice here,” Aisa said as she slithered around. “Like earth and water and prey and Tom.”</p>\n<p>“Aisa, could I ask you for a favour?” Harry asked, not wanting to miss this opportunity. He wasn’t sure when he’d have a chance to visit her again. “Could I take some of your venom?” </p>\n<p>“My venom?” Aisa looked at him while she tilted her head. “Do you want to use mine because you don’t have your own?”</p>\n<p>“Something like that. All you’d have to do is bite down in some buckets.”</p>\n<p>Aisa nodded. “You can have some because you brought me to this wonderful place.”</p>\n<p>Harry got to work at once, preparing two buckets, while Aisa wandered around, exclaiming how much she liked her new environment. Tom stayed close to the suitcase. </p>\n<p>The process of extracting Aisa’s venom was as easy as Tom’s had been and before long Harry carefully levitated two almost full buckets down into the suitcase to store in a cupboard. He couldn’t wait to see Severus’ face when Harry gave him two full buckets now, and another two next week when he could milk Tom again. Severus would probably spread out the sale somewhat as not to flood the market and bring the price down. Then again, Basilisk venom was so rare and every potioneer worldwide would dearly love to get their hands on some that Harry didn’t think a few extra buckets would make a dent in the global demand.</p>\n<p>“Are you staying with me, Tom?” Aisa asked as Harry told her it was time to say goodbye. </p>\n<p>Tom gave Harry a very anxious look which Harry didn’t understand at first until it dawned on him that Tom was genuinely worried Harry would leave him there. “No,” Harry said in Tom’s stead. “Tom is coming with me. He’s going to help me with my next job.”</p>\n<p>“Oh.” Aisa gave Tom a very disappointed look. </p>\n<p>“I’ll visit,” Tom assured her. “Goodbye, Aisa. You’ll love this place, I’m sure.” And with that Tom slid inside the suitcase and Harry quickly closed the lid. </p>\n<p>“We’ll stop by as often as we can. Enjoy the sun and all the prey that lives in this forest. Goodbye.” Harry mounted his broom and took off at once, suitcase in hand. He did not want to give Aisa a chance to demand to come along or forcibly try to make Tom stay. Thankfully, Aisa stayed put and Harry could make a clean escape. </p>\n<p>That night, Harry warded a small patch of forest many miles away from Van Vihar and opened his suitcase. He met Tom in the holding area.</p>\n<p>“Did you think I was going to leave you there?” Harry asked, both amused and a little sad that Tom apparently thought so little of him.</p>\n<p>Tom shrugged. “I wouldn’t have blamed you if you had.”</p>\n<p>“You think I’m the kind of guy who would do that? Who’d leave you to be assaulted for the next few centuries?” Harry really was feeling a little hurt by this latest development.</p>\n<p>“No!” Tom seemed surprised by his own sharp denial as he blinked at Harry. “I’m just not sure I deserve a second chance. Maybe it would be better if I was locked away for the rest of my life. Preferably without Aisa, but still... I wouldn’t blame you, Harry, if you made sure I was properly punished. I haven’t been a good man in the years I was human.”</p>\n<p>Harry sighed. Tom just voiced some of the thoughts Harry had been struggling with himself. “I haven’t decided yet, to be honest. I want to hear more about what happened to you before I make a decision.”</p>\n<p>“That’s fair. Whatever you want to know, I’ll tell you.”</p>\n<p>Harry’s stomach let him know he had other priorities now. “Thanks, but that has to wait until later. I’m starving right now.”</p>\n<p>Tom followed Harry to his living quarters but kept the bulk of his body outside this time. Only his head rested inside to observe everything Harry did. Harry peeled a few potatoes with a flick of his wand and got them boiling in a pot of water on the stove. Then he opened a can of beef stew with carrots, dumped it in a pan and got that heating up as well. Harry loved muggle canned foods. They kept forever, came in lots of variety and tasted pretty good combined with potatoes, rice or pasta. Harry was a busy guy, especially when on the road. He didn’t have time to prepare elaborate meals.</p>\n<p>“Did you mean it?” Tom asked just as Harry put the kettle on to make a cup of tea. “That you needed me for a job?”</p>\n<p>“At that time, no,” Harry said as he stuck a teabag in a mug and poured boiling water over it. “But I’ve been thinking. How would you like to go hunt some acromantulas? Their venom sells for quite a bit these days, not to mention their silk, and we’ll split the earnings.”</p>\n<p>“Acromantulas?” Tom moved a little further into the living quarters, but still keeping most of his body outside. “Where? And how do you hunt them?”</p>\n<p>“I know a few colonies here in India. There’s a big one in the Sundarbans that’s considered vermin and open to hunting because they occasionally hunt the local endangered tiger population.” Harry stirred his stew as he waited for his potatoes to be done. “When I hunt them alone, I fly high above the colony, because those fuckers can jump, and summon one into a wooden crate I have hanging from my broom. Not without risk, because one gust of wind and the spider misses the crate and ends up in your face.” Harry grinned at Tom who was looking at him as if he were completely mad. “But with you there, we can simply drop in the middle of the colony, you take a look around and we have a dozen or so dead spiders while the rest flee in terror. Easy.”</p>\n<p>“Easy,” Tom repeated, but in an entirely different tone of voice. “You call that easy?”</p>\n<p>“Compared to my earlier method, sure.”</p>\n<p>Tom sighed. “I suppose it would be good to add a bit more to my savings in case I do one day get my old body back.” He moved as though squaring his shoulders and gave Harry a decisive nod. “Very well. Let’s pretend I’m a Gryffindor and we can hunt some giant man-eating spiders.”</p>\n<p>“Awesome,” Harry said, excitement coursing through him. “It’s a date.”</p>\n<p>Chapter 8</p>\n<p>During Harry’s second year at Hogwarts, Hagrid had taken Harry into the Forbidden Forest one Saturday afternoon to meet his best friend, Aragog. Harry had been secretly a little terrified of Aragog, but since Hagrid clearly loved the giant spider, Harry had kept it together during their meeting. </p>\n<p>Harry hadn’t kept it together, however, when after their meeting with the old spider, Aragog’s many offspring had decided to turn Harry into dinner. Apparently, Aragog’s kids had promised their daddy they wouldn’t ever eat Hagrid, but they had made no such promises about any guests Hagrid was stupid enough to bring into their lair. </p>\n<p>To make a long story very short, Hagrid and Harry had barely made it out of there alive, and Harry had learned a very important lesson. No, two very important lessons. </p>\n<p>One, that he despised acromantulas with a vengeance, and two, that not all magical creatures should be preserved at all costs. </p>\n<p>Newt and Hagrid were the kind of men to see the good in any creature, even an enormous man-eating spider, and would never think to harm them. </p>\n<p>Harry, on the other hand, had no problems killing the crap out of eight-legged beasts that bred like rabbits and had the potential to destroy entire ecosystems should they establish themselves somewhere they weren’t native. Hagrid had been unknowingly very lucky he’d released Aragog into a forest that housed centaurs who kept the acromantula population in check by hunting the beasts and using their silk and fangs for all manner of objects. If Aragog’s offspring hadn’t been kept in check there wouldn’t have been a single living animal found in the Forbidden Forest, magical or not, after a decade or so. Acromantulas were not picky eaters and killed anything they could find. </p>\n<p>Harry portkeyed to Calcutta and flooed to Gosaba, on the edge of the Sundarbans. From there he took his broomstick while hiding under his invisibility cloak and took off across the largest mangrove forest in the world. The trees were thick and the ground soaked, if there was ground at all, because a lot of the forest was a crisscross of streams, rivers and tidal areas. </p>\n<p>It was a stunning place, but not without any risks. Aside from the invasive acromantula population, the local tiger population was also a very real threat to people who visited the area, wizard or muggle. Because even for a wizard with magic, a tiger was a fierce opponent, especially because it was very difficult to see them coming in the shadowy undergrowth of a dense forest. Therefore, Harry stayed on his broom and kept above the treetops until he found the area where the acromantulas had their nest. </p>\n<p>Before travelling south, Harry and Tom had discussed their plan, which was incredibly simple, so Harry knew he could get started on the attack right away. </p>\n<p>While hovering on his broomstick above the colony, Harry got his suitcase out of his backpack and kept it ready in one hand, while with the other he steered his broom down at a high speed, bursting through the canopy and taking the many, many man-eating spiders completely by surprise. </p>\n<p>“Now!” Harry yelled, dropping the suitcase to the floor and kicking it open with his foot. At once, Tom burst out the opening, yellow eyes blazing and all around them acromantulas started screaming, a noise so high pitched that it hurt Harry’s ears. </p>\n<p>Well, that was something Harry had to write down in his journal as soon as he could, because before that moment Harry hadn’t known acromantulas could scream. Tom slithered around in a circle while all around them spiders that hadn’t yet met his killing gaze fled in all directions. Many, though, did meet their end and fell from the trees around them, legs curled inward as they hit the ground with dull thuds. </p>\n<p>The chaos only lasted less than a minute and after that the quiet returned and Harry looked around in awe. There had to be at least thirty or so carcasses spread around them, in all sizes, from very young spiders the size of French bulldogs to full grown specimens the size of a Volkswagen Beetle. </p>\n<p>“Holy crap,” Harry said with an awed laugh before turning to Tom, eyes wide and slightly disbelieving. “We’re going to be so rich. I know at least six more acromantula colonies that are open to hunting. I say we visit them all. Their silk alone is worth a ton these days, not to mention their venom.”</p>\n<p>“Sounds like a plan,” Tom agreed with a toothy smile, looking around in obvious satisfaction. “It hardly even feels like work.”</p>\n<p>“Nah, the work comes now,” Harry said as he started breaking off branches from the trees around them. “First, we harvest the silk.”</p>\n<p>“How?” Tom asked curiously as he slithered closely. </p>\n<p>“With magic, surprisingly,” Harry said with a completely straight face, which earned him a loud snort from Tom. “Here, let me show you.”</p>\n<p>Harry waved his wand around at the backend of the first dead spider, gently pulling a strand of silk out from between the spinnerets. He wound that strand of silk around the three foot long branch and then charmed the branch to stay upright and rotate slowly but surely, pulling all the silk out of the spider in one long strand while winding it up.</p>\n<p>“Ingenious,” Tom commented as Harry got to work on the second spider. It really wasn’t very difficult work. The real fun started when Harry was done with the silk, storing it all away in an enlarged trunk inside the suitcase, and got his dragonhide gloves out plus a whole tray of glass mason jars. </p>\n<p>“Now we get the venom.” Harry placed a mason jar under a fang and pressed the venom gland on the side of the spider’s face to fill it up. He repeated the process with every fang on every dead spider until he had over sixty jars full of yellow venom. He very carefully stored those away inside the suitcase, because that was worth a small fortune. </p>\n<p>“How about the rest of them?” Tom asked, looking between Harry and the spiders. “Are any other parts worth money, too?”</p>\n<p>“Oh yes,” Harry said with a grin. “The eyes go for a nice amount, for potions, as do the fangs, which are used both in wand making in some countries and in jewellery. The rest of the bodies aren’t worth as much, but thirty spiders like this will still make quite a nice amount of Galleons. By myself I usually only manage to catch one or two spiders, and when broken down they pay the bills for up to four months or so.”</p>\n<p>“We’re definitely hunting more of them, then,” Tom said, getting out of the way as Harry levitated all the carcasses into the suitcase. He’d put them under preservation charms and harvest the eyes and fangs later, to keep everything fresh. Tom followed him inside the suitcase and stayed there while Harry got back on his broom and flew them out of the Sundarbans. Since it was getting dark quickly, Harry put up some simple wards to keep muggles away on a stretch of grass with a smattering of trees on the outskirts of Gosaba, placed his suitcase on the ground and climbed inside. </p>\n<p>“I’m pooped,” Harry said, stretching his arms over his head. Tom came slithering out of the temperate habitat, where he’d been swimming again by the looks of his wet, shiny scales. “And I need a bath, too.”</p>\n<p>“You do reek like dead spiders,” Tom said with an obvious tongue flick aimed at Harry, who, in a move that was not at all childish, stuck his tongue out back at Tom before quickly disappearing into his private quarters. </p>\n<p>Harry took a quick shower in the small bathroom and got dressed in fresh pyjamas, dumping his dirty clothes in the overflowing hamper. He really needed to do laundry once they got back home. </p>\n<p>And thoughts of returning home reminded Harry there were still things to discuss with Tom. Important things. They’d left Britain in a hurry to relocate Aisa, since that took priority over anything else, but that didn’t mean that Harry was going to forget that Tom had split his soul and committed murder. </p>\n<p>For dinner, Harry boiled some pasta on the stove and heated up a can of chunky pasta sauce with meat and veggies. He ate it on the couch while Tom poked his head through the doorway inside the living quarters, watching quietly while Harry finished his meal. </p>\n<p>“We have a conversation to finish,” Harry said, putting his empty plate on the coffee table and leaning back in the couch while gazing at Tom steadily. </p>\n<p>“A conversation?” Tom asked, seeming genuinely confused for a moment before his eyes widened for a second. “Ah, yes, that conversation.”</p>\n<p>Harry sighed and rubbed a hand across his face. He didn’t like this part much, either, but he needed to know what Tom had been up to when he was still a human if he was going to help him become human once more. “Yeah, you were telling me about how you’d let Aisa kill a student. Wait, was that student that annoying ghost that hangs out in the girl’s bathroom?”</p>\n<p>“What ghost?” Tom asked, giving Harry a befuddled look. </p>\n<p>“Moaning Myrtle. I briefly met her when sneaking into the Chamber and Hermione used to complain about her all the time.”</p>\n<p>“Ah, yes, the student’s name was Myrtle Warren.” Tom nodded solemnly. “I was able to frame another student who was keeping an acromantula as a pet for Warren’s death. The acromantula got away, unfortunately, but the student got expelled.”</p>\n<p>Very slowly, Harry closed his eyes and leaned forward to press his face into his hands. Every fucking time Tom opened his mouth, worse things came out. “Tom,” Harry asked very softly. “Did you get Hagrid expelled?”</p>\n<p>“Ah, yes, that was his name. Hagrid.” Tom seemed to warm up to the subject and started talking a little louder in his enthusiasm. “Hagrid had already received numerous warnings for keeping dangerous animals inside the castle, even inside his dormitory. I’d caught him with his acromantula, since I was a Prefect, and reprimanded him thoroughly because keeping a man-eating spider in a castle full of children is madness, and Hagrid had promised to get rid of it but then didn’t, so I was planning to turn him over to the authorities when Aisa killed Warren and I realized I could see Hagrid punished for the acromantula while taking the blame for Aisa’s accident. I thought it was quite the elegant solution, all things considered.”</p>\n<p>Harry counted to ten, and then to twenty, so he wouldn’t curse the stuffing out of Tom, even though he really wanted to. “Hagrid is my friend.”</p>\n<p>Tom recoiled a little, ducking his head while staring at Harry. “Oh. I hadn’t realized.”</p>\n<p>“So that’s another life you’ve ruined,” Harry whispered. </p>\n<p>“In my defence, Hagrid would have been expelled sooner rather than later, or did you miss the part about him keeping a man-eating spider in a school full of children?”</p>\n<p>“I’m well aware of Hagrid’s short-sightedness when it comes to dangerous beasts, especially enormous spiders,” Harry said through gritted teeth while a shiver ran down his spine as he remembered that ill-faithed trip into the Forbidden Forest during his second year. “But that doesn’t change the fact that you’ve hurt a friend of mine.”</p>\n<p>“He would have been expelled anyway the moment I reported the acromantula to the authorities,” Tom said, sounding just a tad desperate. “What difference does it make in the end why he got expelled, Harry?”</p>\n<p>Harry released another sigh, leaning back to stare up at the ceiling. Tom actually made a good point, even though a large part of Harry was still silently fuming over the injustice done to Hagrid. Except, as Tom told it, there hadn’t been much injustice, because Hagrid had kept a man-eating spider in a school full of children. Harry knew this, because Hagrid happily told that tale to all who would listen. </p>\n<p>Fucking hell. Tom really did have a point there. </p>\n<p>“All right,” Harry finally said, anger slowly draining away. “I’ll give you that one. Hagrid probably would have been expelled over the acromantula anyway. Case closed. Please continue your story.”</p>\n<p>“Oh, yes, of course.” Tom moved a little closer to Harry again, massive head tilted slightly as though asking for permission. Harry didn’t object and that seemed enough for Tom to move a little closer still. “Anyway, after Warren’s death I basically created a horcrux in an act of desperation, since I had to return to London that summer again and I genuinely feared for my life. I just didn’t have all the information about horcruxes yet, how they will drive you insane eventually. I used my muggle diary since I didn’t even have a suitable object prepared.”</p>\n<p>“Okay, that’s one horcrux, but you said you made multiple,” Harry said, dreading the rest of Tom’s story.</p>\n<p>“Yes, I did that the following summer,” Tom said, and it looked as though he was squaring his shoulders, the way he rearranged his body. “I tracked down my useless father and grandparents, killed them and framed my muggle-hating uncle, who was more of a squib than a wizard. The Gaunt family, of which my mother was a member, were known for marrying not just their own cousins, but their siblings as well.”</p>\n<p>“Ah, yeah,” Harry said with a shake of his head. “That kind of family. Most of them eventually go extinct because they lose their magic through inbreeding. My mom did a study into this phenomenon when she just became a healer.”</p>\n<p>“Yes, exactly.” Tom seemed a little bashful all of a sudden, massive head swinging to the side. “It took me many years to realize that I should probably be grateful that my mother chose a muggle as the father of her child. If she’d followed tradition and fucked her own brother, I would have been a squib.”</p>\n<p>“Yeah, almost certainly.”</p>\n<p>“For many years I resented the fact that my father was a muggle. I no longer feel like that. I will, however, never forgive him or my grandparents that they left me to rot in an orphanage while they lived a life of wealth and privilege. So I don’t regret killing them and I never will. I used those deaths to create my second horcrux and I used an old family heirloom, my uncle’s ring, for it.”</p>\n<p>“So that’s two,” Harry said, just to keep track. So far Harry was glad no new murders he wasn’t already aware of were being recounted. “Any more than that?”</p>\n<p>“No,” Tom said with a sigh, though Harry wasn’t sure if it sounded relieved or exhausted. “I had planned to create more, and I was even eying up some ancient artifacts some old witch was hoarding to use as the new containers, but before I thought up a plan to get my hands on those I came across a vague reference to the ritual of longevity and decided to pursue that, since by that time I’d read up on horcruxes some more and had come across some references that they might cause insanity.”</p>\n<p>“And that’s why you travelled to India and met the sorceress?” Harry guessed. </p>\n<p>“Yes. I took a vacation from my job at Borgin and Burke’s and used some of my savings to travel to India, where I met the sorceress who gave me the details of the ritual, which I performed right there and then and well, the rest as they say is history.”</p>\n<p>“And they say Gryffindors are impulsive,” Harry said with an amused grin. “But by the sound of it you had some serious impulse control issues as well, Mr Slytherin.”</p>\n<p>Tom shook his head and seemed downright embarrassed for a moment. “I am aware I may have acted a little impulsively at some critical moments in my life, thank you.”</p>\n<p>“How much do you remember of the ritual?”</p>\n<p>“Everything.”</p>\n<p>“Good.” Harry reached for his wand and summoned his journal out of his bedroom, together with a self-inking quill. “Tell me every detail, because I know a guy who does have access to the Black Family Library and he’s willing to look into it.”</p>\n<p>Tom spoke carefully, going over everything he remembered from the ritual and how he’d performed it, and Harry dutifully wrote it all down, making sure he got every little detail right. </p>\n<p>“Thanks,” Harry said when Tom was finally finished. “Once we’re back in Britain, I’ll owl Barty this. Where are your horcruxes now? Did you keep them in your Gringotts vault, because your friends emptied that out when they had you declared dead.”</p>\n<p>“No, I never stored them there.” Tom looked puzzled for a moment, eyes narrowed while looking down. “I’m not sure if I still have horcruxes, to be honest, because ever since I performed the ritual of longevity, I’ve felt more…whole and complete.”</p>\n<p>“That’s interesting,” Harry said, because that would make things a lot easier. Tom with a complete soul was likely less prone to violence and killing than a Tom whose soul was still in tatters. “We could collect the items and check them, I assume?”</p>\n<p>“Yes, we could do that,” Tom agreed easily. “I hid the ring in the Gaunt shack under some quite terrifying curses.”</p>\n<p>“And the other one?”</p>\n<p>“I gave the diary to Abraxas Malfoy for safekeeping,” Tom said and gave Harry a questioning look. “Is Abraxas still alive?”</p>\n<p>“No,” Harry said with a groan. “But his son, Lucius is. And Lucius and his wife Narcissa hate my guts, so I think we’re better off with the terrifying curses for now.”</p>\n<p>“I can tell you exactly how to break the wards and get around those curses,” Tom quickly said, looking just a bit worried. “Does this mean you are going to help me become human again?”</p>\n<p>Harry blinked and realized that apparently he had been working towards that, even if he hadn’t yet made up his mind officially. But here was the thing…Harry liked Tom as he was now. The man was a giant snake, which was fascinating to a zoologist, but what Harry truly liked about Tom was his personality. Tom was clever and funny and just a bit haughty with a side of arrogance, yet at the same time possessed a very real talent for seeing through his own bullshit, at least he did now. </p>\n<p>So, the question Harry now had to answer for himself was, did Tom deserve a second chance as a human? As Blaise had pointed out, Tom had basically spent the last sixty years imprisoned in solitary confinement, so he had been punished for all the wrongs he’d done in his younger years. He’d done the crime, but he most certainly also had done the time, as the saying went. And he seemed remorseful, at least about certain things, and he also seemed to no longer aspire to become a Dark Lord. </p>\n<p>“What would you do once you’re human again?” Harry asked, because that was something Tom hadn’t elaborated on yet. </p>\n<p>“Honestly? Really boring, silly, human stuff.” Tom smiled until his fangs were showing. “Take a hot bath, drink tea, sleep in a soft bed, eat something other than live, whole animals, read books…Merlin, yes, read lots and lots of books.”</p>\n<p>Chuckling, Harry got up to wash his dirty plate and make himself a cup of tea. Tom’s suggestion had made Harry crave some tea of his own. “And in the long run?”</p>\n<p>“I honestly don’t know yet,” Tom said with a bit of a shrug. “I’ve been stuck like this for so long that I’d genuinely given up hope of ever returning to my human form. I suppose now that I’m earning money, I could live the rest of my life in a nice cottage somewhere, just enjoy being human again, and if I get bored perhaps involve myself in some academics.”</p>\n<p>“Wait, the rest of your life?” Harry turned to stare at Tom in confusion. </p>\n<p>“I’m well over eighty years old, Harry, or have you forgotten?” Tom’s smile looked rather sad yet resigned. “And with my inbred genetics, I doubt I’ll live as long as some healthy wizards might. I’d just be happy to have a few healthy years as a human before my time is up.”</p>\n<p>Harry suddenly felt as if the wind got knocked out of him and he had to inhale a few deep breaths to chase away the sudden light-headedness he felt. He’d forgotten Tom was that old and in his mind, whenever he imaged Tom becoming human again he saw him as a man in his twenties, the age Tom had been when he’d performed the ritual. But now Harry realized that Tom might very well be right and should they reverse the ritual, Tom would be an old man. </p>\n<p>“I’ll help you,” Harry said, blinking rapidly a few times before he looked at Tom. “I do believe you deserve a second chance, so I’ll help you become human again.”</p>\n<p>Chapter 9</p>\n<p>Now that Harry knew Tom’s remaining time was limited, he wasted not a second in getting back to Britain so he could seriously start on getting Tom back to his authentic self. Thankfully Harry now knew exactly which portkeys to book to make the journey as quickly as possible. </p>\n<p>Once back in his cottage in Hogsmeade, Harry copied his notes about the ritual Tom had used onto a few sheets of paper and rolled them up. Since his beloved owl Hedwig had passed away a few years ago from old age, Harry hadn’t felt the need to replace her, since honestly, there was no replacing her. And since Severus took care of most of their business correspondence anyway, Harry simply used a post office owl if he had a letter to send. Which is exactly what he did that afternoon, even though his mind was slowly succumbing to some kind of jetlag from having travelled halfway across the globe more than once in the span of a week or so. </p>\n<p>While Harry strolled through Hogsmeade on his way to the post office he considered if he should perhaps let Hermione in on the research for a reverse ritual as well. On the plus side, Hermione was easily as smart as Barty, and just as capable a researcher. On the down side, Hermione was not well read in anything dark magic, in fact she despised just the thought of it. </p>\n<p>Harry used to be the same, unsurprisingly, having grown up in a proud Gryffindor family who openly and gladly supported Dumbledore and his agenda to see all dark magic eradicated. </p>\n<p>And then Harry had started hanging out with Slytherins, had gone into business with them, had started dating them, and he’d come to his senses enough to realize dark magic wasn’t necessarily evil, it was just a different side of the same magical coin. </p>\n<p>Hermione, though, hadn’t undergone such a personal shift in her viewpoints on magic, and therefore Harry ruled her out as a potential source of help, at least for now. If Barty was unable to come up with anything, then Harry would consider the rest of his options, but for now Harry put his faith in his honorary uncle, because he knew Barty had no problems delving as deep into dark magic as he needed to solve a magical mystery.</p>\n<p>After sending off his letter to Barty, Harry strolled through the village towards Severus’ home. </p>\n<p>Severus answered Harry’s knock after just a few moments and he immediately narrowed his eyes when he saw who was at the door. “Is the beast with you?”</p>\n<p>Harry held up his hands in surrender. “Yeah, but he’s secured, I promise. I just came to drop of 30 acromantulas worth of venom and silk. My new best friend and I went hunting in the Sundarbans yesterday.”</p>\n<p>Severus blinked, face carefully blank, before he gestured to the side of the house. “Just put it in the backyard for now, I’ll take it inside momentarily.”</p>\n<p>Harry understood all too well why Severus refused Harry entry with Tom the basilisk tucked away in his trunk, because he could hear Severus’ twin girls shrieking with joy from within the house. So Harry didn’t object and simply pushed the gate to the side of the cottage open and unloaded the venom and silk, placing them carefully against the side of the cottage. </p>\n<p>Once home again, Harry climbed into his suitcase where Tom was waiting for him in the main holding area. </p>\n<p>“I’ve sent the ritual to Barty,” Harry told him while he started breaking down the acromantula carcasses that were still piled up under a preservation charm. “He’s one of the smartest guys I know, so I have good hopes he’ll come up with something.” </p>\n<p>“Thank you,” Tom said sincerely, not for the first time since Harry had announced he’d help his new best friend. </p>\n<p>“Sure.” Harry gave Tom a brief smile while he started pulling out the acromantula eyes with a quick spell, placing them in straw-lined crates with extra cushioning and preservation charms. “Tell me in detail about the defences around the Gaunt shack, because while we wait to hear from Barty I think it would be a good idea to gather your horcruxes to see if they’re still active or not.”</p>\n<p>Tom blinked and tilted his head a little. “Why go for the ring that’s got some serious dark magic on it instead of the diary that’s lying about Malfoy Manor somewhere?”</p>\n<p>Harry chuckled while he finished up with the eyes and moved on to ripping out the fangs. “Because Lucius and his wife Narcissa hate my guts. Well, not me personally, but all Potters.”</p>\n<p>“What happened? In my time Abraxas had no such problems with your family that I recall.” Tom moved his large body out of the way a little when Harry levitated an expanded trunk closer and placed the spider carcasses inside of it once he was done with them. </p>\n<p>“My parents were friends with a wizard named Peter Pettigrew, who basically built a criminal empire behind everyone’s backs. Bellatrix Lestrange, Narcissa’s sister, was one of Pettigrew’s business associates and she was found guilty as well on a whole mountain of criminal charges and sentenced to 80 years in Azkaban along with her husband Rodolphus Lestrange.”</p>\n<p>“What on earth did she do to earn such a sentence?” Tom asked, looking rather impressed. </p>\n<p>“She specialized in child slaves. She’d kidnap muggle children, obliviate their parents, and sell them as fuck toys to depraved purebloods, basically.” Harry shrugged, having heard the story so often by now that it hardly affected him anymore. “Lucius and Narcissa were also brought forward as suspects in the investigation, though not for those horrible crimes. They allegedly smuggled endangered magical creatures for potion ingredients, or something like that, but they were never officially charged. My dad claims Lucius bought his way out of that.”</p>\n<p>“How the mighty have fallen,” Tom said with a contemplative nod. “In my days both the Malfoys and the Lestranges were respectable pureblood families, who would never have involved themselves in such obvious criminal activities. Bribing a few politicians here and there, sure. But kidnapping muggle children to be used as sex toys, absolutely not.”</p>\n<p>Harry finished up a few more spiders and tucked them away in the trunk. “Regulus theorized it’s because of Dumbledore.”</p>\n<p>“As much as I despise Dumbledore,” Tom said with an amused little quirk of his mouth, “and I despise him a great, great deal, how on earth is this the old man’s fault?”</p>\n<p>“Dumbledore got a lot of traction with his light propaganda over the past few decades, he got a lot of different kinds of dark magic banned and such.” Harry leaned back against the wooden pillar behind him and stretched out his wand arm to ward off any stiffness. “Regulus thinks that because there was no effective political pushback to that from the conservative factions, they descended into criminality as a giant ‘fuck you’ to polite society.”</p>\n<p>“An interesting theory,” Tom mused while Harry got back to work. “But surely not all dark families became common criminals?”</p>\n<p>“Oh no, there’s plenty still around. Some adapted and became just progressive enough to still be accepted, like Regulus and Barty, or even the Malfoy’s only son Draco. Other families have moved to the fringes of society, become reclusive and keep to themselves basically.”</p>\n<p>“And your parents were involved in sending Narcissa Malfoy’s sister to prison and therefore they despise you all nowadays,” Tom finally concluded as he shifted his large coils to make room for Harry again. </p>\n<p>Harry tucked the last of the spider carcasses inside the expanded trunk and stacked all the crates of eyes and fangs. He’d drop them off at Severus’ later. “Exactly right. You can tell me about all the protections you put on that Gaunt ring while I finally tackle my laundry.”</p>\n<p>And Tom did, going into great detail while Harry got out the shrunk washtub and wringer, enlarged them and summoned his small mountain of dirty clothes. Harry listened carefully, asked questions as needed and in the meantime washed his clothes with a few well-practised charms before drying them with a stream of warm air coming straight out of his wand. </p>\n<p>“We’ll go first thing tomorrow morning,” Harry said once he had his freshly washed clothes folded and tucked away in the small wardrobe in his bedroom. </p>\n<p>“Be careful,” Tom said with real worry in his voice. “That curse I put on the ring is a real nasty piece of work.”</p>\n<p>“Did you create it?” Harry asked curiously as he went through his pantry in the small kitchen to see what he needed to stock up on, as he always did once he came home from travelling. </p>\n<p>“I did, yeah.” Tom hung his head a little. “I created lots of vile curses, just because I could. It never even occurred to me that I could put my magical talents to use in creating things that might be useful to others and earn me some serious money along the way.”</p>\n<p>“You just wanted to lash out,” Harry guessed, familiar with that kind of feeling. Harry had been a ball of fury and frustration in his fifth year at Hogwarts, when it became clear that he would never win his Dad’s approval, no matter what he did. It had taken a whole schoolyear of lashing out at others before Harry realized he could just go his own way, after a few extensive talks with both Sirius and Regulus, who had in their own ways done exactly that themselves when they were Harry’s age. </p>\n<p>“Yeah, hurting others was far easier than dealing with the emotional pain I felt,” Tom agreed quietly. </p>\n<p>Harry nodded in understanding. “But you know better now?”</p>\n<p>“Oh yes, I promise you that.” Tom raised his head a little and gave Harry an intense stare. “Once I’m able to cast magic again, I’m going to be productive instead of destructive.”</p>\n<p>Smiling, Harry patted Tom on his scaly shoulder. “I can’t wait to see what you’ll come up with. I’m going to drop off the acromantula parts at Severus’ real quick.”</p>\n<p>Harry used his broom to quickly fly to Severus’ cottage, too tired to apparate, and after a quick talk with Severus, he stacked the crates and trunk in the garden for Severus to collect. The acromantula parts, combined with the basilisk parts, would soon enough earn Harry a small fortune and which gave Harry real peace of mind for his future. This ensured that he’d basically have enough money to live off all the way through his retirement, as long as he didn’t go and splurge it all.</p>\n<p>Since he was about to fall over from an immediate need for sleep, Harry quickly ate a bowl of soup once he got home and then crawled into his bed where he pretty much passed out at once. </p>\n<p>The next morning, after a short talk with Tom to go over the plan one last time, and after carefully examining some maps of England, Harry apparated to Little Hangleton, a town where he’d never been before. </p>\n<p>It turned out to be a historical muggle market town, similar to the dozens and dozens of market towns that were dotted around the English countryside. Tom had given him directions as best he could to the Gaunt Shack, but it still took Harry a good half hour of walking up and down several country lanes before he spotted the hovel that was mostly covered by the surrounding weeds and brushes, with trees almost completely hiding it from view. </p>\n<p>Harry had to slice his way through a thick wall of ivy to even get to the front door, which was covered in wards only a parselmouth could pass. Well, that wasn’t a problem for Harry. </p>\n<p>Once inside the shack, Harry had to do some more serious weed whacking because the ivy had gotten in through some broken windows and covered almost every surface of the small room. </p>\n<p>Finally, Harry had enough cleared space to use a few charms to detect magical artifacts, and one particular area under the floorboards lit up like a Yule log. Harry summoned a nearby woodpigeon from a tree outside, as Tom had instructed he should, and then carefully removed the floorboards, revealing the simple ring. Without thought, and without giving the compulsion charms on the ring a chance to grab hold of him, Harry dumped the fluttering pigeon on top of the ring, triggering the curse. </p>\n<p>The poor bird died instantly, feathers turning black and withering away while its skin shrivelled up into a dried husk. With a small shudder, Harry levitated the pigeon out of the hole, vanished it and then used every detection spell he knew on the ring, to make sure there were no other curses left on it, just to be sure. But no, the one vile curse had been spent and the ring was safe to handle, just as Tom promised him it would be. </p>\n<p>Harry picked it up and tucked it in his pocket, and pushed the floorboard back into place. He wanted to get out of there before anyone at the ministry might pick up on the dark magic that had just been released. Harry knew from his dad that these days the ministry had many ways to monitor for forbidden magics, and the last thing Harry wanted was to end up sitting in an Auror interrogation room while trying to explain to his father why he’d felt the need to trigger a horrifically dark curse on an heirloom ring.</p>\n<p>Brushing some more ivy to the side with a few waves of his wand, Harry left the cottage and pushed the door closed behind him as well as he could, considering that it barely hung straight on its hinges anymore. </p>\n<p>When Harry looked up, he saw Albus Dumbledore standing in front of him. </p>\n<p>Dumbledore had remained a physically powerful wizard well into old age, but these days it seemed that his advanced age really had caught up with him. Dumbledore’s posture was slightly stooped, even if he obviously tried to hide that, and he needed a cane to get around with. Still, his eyes were ever sharp and Harry made himself no illusions about Dumbledore’s ability to kick Harry’s arse in a duel, even as old as he was now. </p>\n<p>“Headmaster?” Harry asked in obvious surprise, and then he schooled his face in a politely curious mask while he thanked Merlin he’d spent so much time around Slytherins that he’d learned some of their tricks. </p>\n<p>An important one was: stop talking. When confronted by someone who wanted to accuse you of any wrongdoing, you should keep your mouth shut as much as possible and let the other explain their motivations. </p>\n<p>And Harry made himself no illusions Dumbledore was here because even after all this time he apparently still kept a close eye on any location that was linked to Tom Riddle. </p>\n<p>So Tom really hadn’t been exaggerating when he claimed Dumbledore had always despised him, and had even tried to erase his existence all together. </p>\n<p>“Mr Potter,” Dumbledore said with a genial smile while his eyes carefully took in their surroundings. “I am surprised to see you here.”</p>\n<p>“Not as surprised as I am to run into you, I’m sure,” Harry said with a good-natured chuckle, and then he kept his mouth shut again while giving Dumbledore a curious look. </p>\n<p>“Indeed.” Dumbledore nodded a few times, leaning a little heavier on his cane, probably trying to draw even more attention to his advanced age. “Might I ask what you are doing here?”</p>\n<p>“Certainly,” Harry replied with an agreeable nod. “I’d heard rumours the family that once lived here were parselmouths, so I decided to take a look around.” </p>\n<p>“Ah, yes, it stands to reason you’d want to learn more about your unusual talents.” Dumbledore took a few steps closer to Harry. “Where did you hear these rumours, though? The family that once lived here has been dead for a long time.”</p>\n<p>“Regulus Black,” Harry said without hesitation. “Reggie came across a mention of the Gaunt family being parselmouths in some book in his library.” Harry was very proud of himself for coming up with that answer as quickly as he had. Regulus hated Dumbledore, for his biased treatment of Slytherins and his crusade against dark magic, and Dumbledore was well aware of this, so Harry doubted Dumbledore would ever bother to check with Regulus if Harry had spoken the truth. </p>\n<p>“One can find many secrets in books long forgotten,” Dumbledore said mysteriously, and Harry had to put some real effort into not rolling his eyes. “Some of those secrets had better be left forgotten.”</p>\n<p>Harry nodded politely but otherwise didn’t respond. </p>\n<p>Silence stretched out between them, probably an attempt by Dumbledore to see if he could get Harry to break down into a nervous confession of whatever Dumbledore thought he’d done wrong now. But Harry was no longer a student, hadn’t been one in a long time, and Harry had never held Dumbledore on a pedestal like his parents had done, so the old headmaster had no power over him. </p>\n<p>“Did you find anything noteworthy here?” Dumbledore finally asked when it became clear Harry wasn’t going to give him what he wanted. </p>\n<p>“Lots of ivy,” Harry said with a nod towards the wall of green behind him. “And a few dangerous wards with some serious dark magic. I didn’t linger, too afraid I might trigger something worse.” </p>\n<p>At Hogwarts, Harry had been a mediocre student, because he honestly couldn’t care much about anything other than Care for Magical Creatures and Quidditch. He’d shown some talent for Defence against the Dark Arts, but he’d never really explored that since he didn’t think he needed it since he refused to even consider becoming an Auror like James Potter. So as far as Dumbledore knew, Harry wasn’t a very talented wizard, especially not when it came to things like wards and curses. </p>\n<p>What Dumbledore forgot to take into account was that Harry had gone into business with Severus Snape early in his career, and Severus wanted to protect his investments and thus he’d instructed his young business partner in all manner of important magic he should command while travelling around the world looking for dangerous creatures. And thus, under Severus’ more than strict tutelage, Harry became quite proficient in defence, warding, curse-breaking and much more. </p>\n<p>Dumbledore chuckled, as though Harry had just told a funny joke. “Yes, sticking your nose into places it doesn’t belong can get you into more trouble than you could have foreseen.”</p>\n<p>“Isn’t that the truth,” Harry agreed, keeping up his act of clueless student that Dumbledore expected of him. </p>\n<p>“Well then, my boy, perhaps you should hurry home.” Dumbledore stepped to the side as though to allow Harry passage through the overgrown garden path. </p>\n<p>Conceited prick. Harry had never had personal issues with Dumbledore, because Dumbledore had always simply ignored him. But he’d heard more than enough complaints from his Slytherin friends, and now that he was confronted with Dumbledore sticking his nose into Harry’s business, Harry could see for himself what a manipulative old man the headmaster really was. </p>\n<p>“Oh yes,” Harry said mildly as he walked past Dumbledore. “I could do with a cup of tea after all this excitement.”</p>\n<p>“Give my best wishes to your parents, Harry.” Dumbledore kept up his act of kindly old headmaster all the way to the moment Harry apparated away. </p>\n<p>Wasting no time the moment he got home, Harry opened the suitcase and climbed inside. </p>\n<p>Tom rushed towards him, scales sliding loudly across the stone floor, and he looked Harry over top to bottom. “Did you get it? Are you all right?”</p>\n<p>“I got it,” Harry said with a sigh and he pulled a wooden folding chair closer and sank down into it. Harry fished the ring out of his pocket and held it up for Tom to see while he told his friend exactly what had happened. </p>\n<p>“That old bastard,” Tom said with a terrible hiss, yellow eyes narrowing. “He must have had the Gaunt shack magically monitored for any intruders, thinking perhaps that if I ever appeared again I might check it out.”</p>\n<p>“Yep,” Harry agreed while Tom flicked his tongue at the ring a few times, trying to see if it was still a horcrux. “Is there magic we can use to see if this still has a piece of your soul in it?”</p>\n<p>“Yes, a ritual,” Tom explained while dipping his head in thought. “But knowing that Dumbledore was snooping around one of my horcruxes, however accidentally, does make me nervous. Perhaps we should get the diary as soon as we can, and perform any detection rituals afterwards.”</p>\n<p>“Fine by me,” Harry said with a nod, putting the ring back in his pocket. “I’ll floo Draco.”</p>\n<p>Chapter 10</p>\n<p>Harry kneeled in front of his fireplace, threw in a handful of floo powder and called out, “Blackcurrant Cottage.”</p>\n<p>Draco and his wife Astoria lived in a ‘cottage’ on the Malfoy ancestral grounds. It was a house that dwarfed most other wizarding dwellings, with seven bedrooms, four reception rooms and a large conservatory, but to the Malfoys it was a teeny, tiny cottage, at least compared to their main mansion. Draco had certainly whined about it often enough when he first moved in there after he married Astoria, how he suddenly had to make do with no space at all. It was Astoria who had insisted upon separate living quarters when she married him, to wean Draco off his parents’ direct influence and whenever Draco started complaining she merely gave him an incredibly fond yet exasperated smile. </p>\n<p>A house-elf answered the floo call and Harry requested to speak to the master of the house. Draco appeared a mere minute later, which was a first because usually he made any floo-callers wait for at least ten minutes before showing up to take the call. Harry had once waited for twenty minutes before severing the call in frustration and simply apparating to Draco’s cottage to talk to him. </p>\n<p>“Harry!” Draco panted, as though he’d ran all the way to the fireplace. “Harry! I’ve been trying to contact you for days and days.”</p>\n<p>“I was abroad,” Harry said in a vaguely amused tone at seeing Draco so flustered. His perfectly styled hair even had a few strands escaping from its usual stranglehold.</p>\n<p>“Yes, yes.” Draco waved Harry’s comments away. “Blaise told me eventually. Listen, I need your help. An Augurey has taken up residence in the woodland behind the cottage and it keeps wailing and wailing since it’s been a very wet spring. Astoria keeps bursting into tears throughout the day. She’s very sensitive to their cries. It’s been a depressing week to be honest.”</p>\n<p>As if on cue, a mournful wailing could be heard in the background. </p>\n<p>Draco glanced over his shoulder. “Yes, we know it’s going to rain, you bloody bird. Shut up already!”</p>\n<p>Harry had a fist pressed to his lips to keep from bursting out in laughter. “I’ll come get him,” he easily agreed. “But I need a favour in return.”</p>\n<p>“Sure, what do you need?” Draco said without hesitation. He was a Slytherin after all, well accustomed to trading favours. </p>\n<p>Harry hesitated. Floo connections weren’t always secure. “Make some room and I’ll step through right away.” Harry summoned his backpack with a simple gesture of his hand and walked through the green flames into the entrance hall of Blackcurrant Cottage. </p>\n<p>“What I want in return is very sensitive in nature and requires the utmost discretion,” Harry whispered, leaning a little closer to Draco. </p>\n<p>At once, Draco perked up, eyes growing wide while he gave Harry an expectant look. During his sixth year, when Harry had slowly started to socialize with the Slytherins, Harry had quickly discovered that Draco Malfoy was the absolute gossip king of Hogwarts. The boy thrived on learning everything and anything he could about every single person in the whole world. So Harry knew exactly what he was doing by emphasizing the importance of what he was about to say.</p>\n<p>“Your father has an old, muggle diary in his possession,” Harry whispered right into Draco’s ear. “It was given to Abraxas by an old schoolmate named Tom Riddle. I need that diary, Draco.”</p>\n<p>Scrunching his eyebrows up in a thoughtful frown, Draco gave Harry a searching look. “Why would my father hold onto a muggle diary?”</p>\n<p>“Because Riddle cursed it and turned it into a very dangerous artifact. I need it now to help save someone’s life.”</p>\n<p>“Hm.” Draco’s grey eyes were positively piercing while he stared at Harry. </p>\n<p>The Augurey wailed again, long and slow. </p>\n<p>Releasing a frustrated groan, Draco finally nodded his head. “All right, all right, I’ll get that book for you, as long as you get that blasted bird out of here right now.”</p>\n<p>“Thanks,” Harry said with a cheerful smile, not at all put off by the sound of an Augurey. If anything, hearing their calls made Harry feel warm with nostalgia. Newt had always kept a few Augureys he’d rescued over the years and hearing them call out reminded Harry of all the times he’d spent with his old mentor. </p>\n<p>Harry found the Augurey in an oak tree right behind the cottage. It looked more bedraggled than Augureys usually did, and Harry quickly realized why. The poor thing was suffering from a serious chizpurfle infestation. Chizpurfles were tiny parasites that fed on magic from things living and dead. It was probably the reason the Augurey had moved so close to Draco’s home. It needed help to get rid of the parasites.</p>\n<p>“I’m sorry, mate. Usually I’d let you lose in my suitcase but I cannot risk a chizpurfle infestation while my friend Tom is down there.” Chizpurfles were greedy little parasites. They’d eat a large, magical creature like a basilisk alive. Harry rummaged around in his backpack until he found a shrunken wire cage, which he enlarged with a flick of his wand. He opened the door and gestured at it. “I promise to get that infestation dealt with right away. You’ll be good as new in no time.”</p>\n<p>The Augurey gave Harry various curious looks, but wasn’t so easily swayed by Harry’s sweet promises. Eventually Harry summoned a field mouse, killed it by snapping its tiny neck and placed the offering inside the cage. That did the trick and the Augurey spread its grey wings and soared down to the ground where it hopped inside the cage to devour the mouse. </p>\n<p>Right after Harry closed the door and levitated the enclosure, Draco stepped out of the cottage, waving a small, black book. “Got it! I had to ask a house-elf for help, but I found it eventually.”</p>\n<p>Harry gladly accepted the book and immediately tucked it away inside his backpack before hauling the whole thing over his shoulder. And not a second too soon, because a large shadow grew closer and closer in the overcast sky. </p>\n<p>“Ah fuck,” Harry muttered while Draco winced beside him. </p>\n<p>An enormous Abraxan touched down on the grass a few yards away, carrying Charis Yaxley-Lestrange, Bellatrix’s oldest child. Charis was almost a decade older than Harry and Draco so they never encountered her at Hogwarts, but Harry had heard plenty of stories of how she’d ruled over Slytherin house with a very eager wand. As rumour had it, Charis was just as talented at casting curses as her mother had always been. </p>\n<p>And since James Potter had helped put Bellatrix and Rodolphus Lestrange behind bars, Charis naturally had it out for Harry. </p>\n<p>“Sorry,” Draco whispered while Charis glared at them over her nose. “I didn’t realize she was here today since mother is away for the afternoon.”</p>\n<p>Charis Yaxley-Lestrange enjoyed spending time with her aunt Narcissa, as they both shared a passion for Abraxan. She looked a great deal like her mother Bellatrix, with the same hooded eyes, though hers were brown instead of the usual Black family grey. “And what brings the most useless of Potters here today?”</p>\n<p>“He’s here on my behalf,” Draco was quick to say, looking rather pinched as he glared at his cousin. Harry knew from Draco’s many complaints that Charis hadn’t ever treated him with kindness either but enjoyed bullying him when Narcissa wasn’t looking. “There was an Augurey that bothered Astoria. Harry’s come to get it.”</p>\n<p>“Yep,” Harry agreed, warily watching how Charis moved her hand closer and closer to the wand on her hip. “Right after this I’ve got a meeting with my father.” Which was bullshit, of course, but Harry thought it might be a good idea to remind Charis who his father was and what he would do if someone hurt his only son. Well, Harry thought James would avenge him if someone did him in. Probably. Even if only to defend the Potter name instead of Harry the freaky parselmouth himself.</p>\n<p>“Oh, I’m not going to hurt you, you sad little boy,” Charis said with a bit of a cackle and at once she aimed her wand at the Augurey. “But no one will care if I hurt that stupid bird.” And with that she cast a silent spell and a sickly yellow light flew towards the caged bird beside Harry.</p>\n<p>Much to Harry’s surprise, Draco all but threw himself in front of the Augurey so the magic hit him instead. Both Draco and Charis released simultaneous screams, Draco from pain and Charis from shock.</p>\n<p>“Dobby!” Harry yelled, summoning Draco’s house-elf at once. “Get the Healer. Draco’s been hurt. Badly.” Once the house-elf popped away again, Harry crouched beside a groaning Draco. “What the hell did you do that for?”</p>\n<p>Draco released a pained chuckle. “So I could tell mother what Charis did. I’m sick and tired of always walking on eggshells around her.”</p>\n<p>Charis stared down at them from her position on the Abraxan, mouth opened and cheeks pale. “You wouldn’t tell Cissy.”</p>\n<p>“Yeah, I would,” Draco whispered through gritted teeth. “Mother may be fond of you, cousin, but she would fight a dragon with her bare hands to keep me safe.”</p>\n<p>Harry couldn’t hold back a small, amused smile. That did describe Narcissa Malfoy rather well, as far as he knew. </p>\n<p>Dobby led an older woman out of the cottage who was carrying a large potions bag. </p>\n<p>“Go,” Draco said as he blinked up at Harry. “You don’t want Mother to find you here, Harry.”</p>\n<p>“Thanks,” Harry said, patting Draco carefully on his shoulder. “For saving the Augurey. But please do give me a bit of warning next time you decide to impersonate a Gryffindor.” </p>\n<p>Draco snorted in response just as the Healer reached them. The Healer started pouring various potions down Draco’s throat at once and Harry, studiously ignoring Charis’ unrelenting glare, quickly fled into the cottage to use the floo. </p>\n<p>Once he stumbled out of the fireplace in his own home Harry released a relieved sigh. Then he pulled out his wand and conjured his Patronus. The huge, silvery stag gave him a curious look. “Go to Blaise and tell him Draco’s been injured and he could use some cheering up. Also tell him Draco may or may not have a brain tumour that’s turning him into a Gryffindor because he just risked his life to save a bloody bird just to spite his least favourite cousin.”</p>\n<p>The moment the stag disappeared through the walls, Harry released an enormous sigh. Fucking Draco and his idiotic behaviour. Then he remembered the caged Augurey he was still holding. Shit, he did not want a chizpurfle infestation in his home. Harry quickly carried the bird out into the garden and summoned his potions bag from his suitcase. He always kept treatments for pretty much all types of magical parasites on hand, because you never knew when you suddenly needed them. He opened the correct bottle and with his wand spread the potion out across the Augurey. That would take care of the majority of the pests, and after a repeat treatment the next day the whole lot should be eradicated. Harry released the Augurey who immediately flew to the apple tree in the back of Harry’s yard. “Just stay put, mate. I’ll give you the next treatment tomorrow.” </p>\n<p>The Augurey started wailing at once, since dark clouds were gathering on the horizon and Harry let that gloomy sound calm him down. </p>\n<p>Just as the first fat raindrops fell Harry went back inside his home and lowered himself inside his suitcase. </p>\n<p>“Did you get it?” Tom asked eagerly as he came sliding out of the temperate mountain habitat. He’d really taken a liking to swimming in the lake there.</p>\n<p>“Yep.” Harry pulled the black book from his backpack and turned it over in his hands. On the back the name T.M. Riddle was embossed in faded gold print. “Not sure if it still has your soul or not.”</p>\n<p>“There’s a fairly simple ritual to find that out,” Tom offered and then proceeded to tell Harry what to do. It involved drawing a simple ritual circle, adding the appropriate runes, placing the object inside and casting a few charms. </p>\n<p>Harry managed it without any problems and within moments they learned that neither the diary or the ring held any pieces of soul. </p>\n<p>Tom’s grin was wide and toothy. “That’s excellent news. That means I won’t have to go through the very painful ritual of reuniting my soul pieces by myself.”</p>\n<p>“Yeah,” Harry agreed, a warm feeling erupting in his chest when realizing how close they were to turning Tom back into a human. “Now all we have to do is wait for Barty to get back to us.”</p>\n<p>“We could hunt some more spiders in the meantime,” Tom suggested with a tilt of his massive head. “Might as well make use of this form while we still have access to it.”</p>\n<p>Harry shrugged. “Might as well,” he agreed easily enough.</p>\n<p>And that is what they did. Two days later Harry booked a portkey that would take them to Sumatra, Indonesia, where a very large colony of Acromantulas lived that was open to hunting year round. They used the same tactics as they’d done before, and this time they managed to kill well over fifty spiders in one fell stroke. </p>\n<p>“I’ll never have to work a day in my life again,” Harry mused as he started winding up the spiders’ silk. </p>\n<p>Tom was gliding around the forest, giving every single dead spider a smug look. “Don’t tell me you’d be happy to retire this early in your life.”</p>\n<p>“Of course not,” Harry agreed with a chuckle. He couldn’t imagine not travelling anymore, not going out to rescue animals and collect rare potions ingredients. “But it’s nice to know that I can choose only what I want to do from now on, instead of having to always worry about money.”</p>\n<p>Tom gave an agreeable nod. “That is most certainly true. I’m looking forward to buying a small home for myself and living out my human days in peace.”</p>\n<p>“You’ll have plenty of gold to do so,” Harry said with a laugh as he started on collecting venom. It took him most of the day to process and collect all the spider carcasses and it was getting dark by the time Harry gathered the last of the bodies so he could store them inside his suitcase. </p>\n<p>“Harry!” Tom suddenly cried out as he came rushing towards Harry through the undergrowth. “Behind you!”</p>\n<p>Harry turned around in surprise and suddenly there was only darkness and needle like pricks all around his torso. Thankfully, Harry still had his wand in his hand and on instinct he called out, “Expecto Patronum!” The memories that swam to the forefront of his mind weren’t of him spending time with Luna, Hagrid and Newt as they studied animals together, or of earning his Magical Zoology mastery, as they usually were. No, the things he saw in his mind’s eye as the silvery stag burst forth were images of Tom and their adventures together so far. </p>\n<p>The stag lowered its head and pierced a thin, black thing with its silvery antlers. The thing reared itself up, resembling a sentient cloak that squirmed against the barrages of Harry’s Patronus. And then Tom was there, mouth opened wide, fangs glistening with venom as it bit down on the black creature until it stopped moving altogether. </p>\n<p>“Merlin’s saggy balls,” Harry said when he finally caught his breath as he sat on the forest floor. “I think you just killed a lethifold. I didn’t even think that was possible. Seriously, this is the first time anyone has killed one. I need to write this down.”</p>\n<p>Tom slowly spat out the lifeless black beast and gave Harry a worried look. “Are you all right? You’re bleeding. I can smell it.”</p>\n<p>Harry waved his worries away as he pushed himself to his feet. “You do not understand, Tom. Until this moment people assumed lethifolds were unkillable. Yet you just killed it with your venom. This is huge, I’m telling you.”</p>\n<p>Tom glared down at the dead lethifold for a moment and then turned away from it. “Yes, this is going to help wizard-kind so much, isn’t it. Just carry a basilisk around with you the next time you find yourself in an Indonesian jungle and you won’t have to worry about lethifolds.”</p>\n<p>Harry burst out in laughter, mostly at Tom’s utterly snooty tone. “All right, it’s not a very practical solution, I agree. But academically, this really is an amazing discovery.” And before Tom could protest, Harry levitated the dead lethifold into the suitcase and locked it in an empty trunk with every locking charm he knew. Just in case the lethifold wasn’t as dead as they assumed. Harry would take great pleasure in studying the creature later and he was quite sure Severus and Luna would want to take a good look at it as well, just for curiosity’s sake. Heck, probably everyone he knew would want a look at such a scary beast now that it was safe to do so. </p>\n<p>Tom gently nudged Harry with his nose. “Will you please tend to your wounds now?”</p>\n<p>“Yeah, all right.” Harry got some healing potions and salves and carefully inspected his chest after he pulled off his shirt. The lethifold’s teeth had left behind a whole row of slowly bleeding small holes on both his chest and back. It really had tried to devour Harry whole. Not for the first time in his life, Harry was very grateful Severus had taken the time to teach him the Patronus charm. </p>\n<p>Once they returned to Harry’s cottage in Hogsmeade, the first thing Harry did was shoot off a Patronus to Severus and Luna. “Hey, I caught a lethifold. Don’t worry, it’s dead. Want to come have a look?”</p>\n<p>Naturally, word spread quickly and instead of having two friends over, Harry found himself with a house full of guests. Severus was there, as were Luna and Rolf. Ron and Hermione had shown up, as had Hyacinth and her husband Rupert Longbottom. Blaise was chatting with Regulus and Barty right before Sirius and Remus arrived. </p>\n<p>“Do you really have a lethifold?” Sirius asked with wide, disbelieving eyes. “No joke?”</p>\n<p>“No joke,” Harry said solemnly. “It tried to eat me, had me half devoured already when I managed to cast a Patronus charm. And then Tom came charging and bit the thing and killed it.”</p>\n<p>“Tom?” Sirius asked with an uncertain look. </p>\n<p>“The not-basilisk?” Harry gestured towards the suitcase, which stood tucked away against the dark fireplace. </p>\n<p>“You have a basilisk?” Sirius asked, now sounding just a tad panicked. </p>\n<p>Harry sighed. “He’s a wizard who got stuck as a basilisk. Long story. We’re turning him back.”</p>\n<p>Regulus made a throaty sound of disbelief while he turned his nose up at Sirius’ sudden look of intrigue.</p>\n<p>“Well, show us the beast then,” Severus said, sipping a tumbler of fire whiskey.</p>\n<p>Harry stepped up to the trunk and placed his wand on the lid. “I’m pretty sure it’s dead, but just in case…everyone who can cast a Patronus, keep your wands at the ready.”</p>\n<p>“Wait, you’re not sure it’s dead?” Hermione asked, voice high and tight. She quickly pulled her wand out, holding it in an unsteady grip. </p>\n<p>“Bloody Gryffindors,” Severus muttered, his look one of utmost contempt while he aimed his wand at the trunk.</p>\n<p>“It’s dead,” Harry said while he started unlocking the trunk. It had better be. If it wasn’t, Harry was kicking it straight down into the suitcase so Tom could bite it again, harder this time. </p>\n<p>When Harry very carefully opened the trunk, no living black shroud came flying out. Inside the trunk Harry found the beast lifeless, just as he expected. He levitated it out and up and around the room sounded many exclamations of awe and shock. </p>\n<p>“You actually got a lethifold, you mad lad,” Sirius said with a bark of laughter. He ran a hand through his greying hair as he leaned over for a closer look. </p>\n<p>Everyone eventually dared to approach the almost mythical beast. Luna stood beaming at Harry, though she did give him a brief, sad smile. “It’s too bad it tried to eat you. I’d have liked to meet it while it was still alive.”</p>\n<p>Harry turned the beast over, so it’s very wide mouth fell open, showing off multiple rows of very fine and very sharp teeth. “Are you sure, Luna dear?”</p>\n<p>“I’m glad it’s dead,” Rolf said with a laugh as he wrapped his arm around his wife’s shoulder. </p>\n<p>“I’d love to meet Tom,” Luna then said, blinking large, blue eyes at him. </p>\n<p>Harry swallowed. He knew Tom wouldn’t purposefully hurt any of Harry’s loved ones, but he was unwilling to risk it. One misplaced look, and Luna would be dead. “When he’s a man again. It won’t be long now.”</p>\n<p>“Oh, I know,” Luna happily agreed. “We’ll all meet him soon enough I suppose.”</p>\n<p>People mingled and chatted for an hour or two more during this impromptu reunion of Harry’s favourite people in the whole world. Right as people got up to leave, Barty sidled closer to Harry, glancing over his shoulder to make sure his husband was otherwise occupied. Barty quickly pressed a small scroll into Harry’s hand before taking a step back. </p>\n<p>“That’s the ritual you need,” Barty said in a quick whisper, glancing around multiple times, but Reggie was arguing with Sirius and seemed none the wiser of his husband’s illicit activities. </p>\n<p>“Thanks, Barty,” Harry said with an utterly grateful smile. “We’ll use it first thing in the morning.” </p>\n<p>This was it, Harry noted with a huge swell of happiness. They finally had a way to turn Tom back into a man.</p>\n<p>Chapter 11</p>\n<p>Tom was unexpectedly quiet after Harry showed him the scroll with the ritual. “You said there were a few more Acromantula colonies that we could hunt, correct?” Tom finally whispered as Harry looked at him in confusion.</p>\n<p>“Sure.” Harry opened the scroll and read over the ritual again. It wasn’t even that complicated. It required a few ingredients he’d have to buy, but that wouldn’t take him more than an hour trip to Diagon Alley. </p>\n<p>“Then let’s use this form as long as we still have it,” Tom suggested, some eagerness finally showing in his voice. “Let’s hunt a few more colonies while we still can. I’ve been a basilisk for so long it hardly matters if I turn back tomorrow or next week.”</p>\n<p>Harry gave Tom a dubious look, very surprised Tom wasn’t jumping at the opportunity to turn back into himself right away. Then again, Tom did have a very good point about hunting Acromantulas. Without a convenient basilisk, it was impossible to hunt that many giant man-eating spiders at a time. Whenever Harry went hunting by himself he’d get one spider, perhaps two if he was very lucky and the wind wasn’t too strong. Getting a few dozen in a day was unheard of unless you went out with a huge team of experienced hunters. </p>\n<p>“There’s a big colony on Bali,” Harry said, already calculating which portkeys they’d have to take. “And there’s an invasive one in Vietnam. During the war the wizards in North Vietnam released a few adult Acromantulas in the jungles there to help with the war effort. Those monsters grew fat on American soldiers and populated a huge stretch of jungle. Nowadays they’re contained, but the Vietnamese ministry welcomes hunters with open arms.”</p>\n<p>“How fascinating,” Tom said and he did sound like he was genuinely interested in what Harry had to say. And yet Harry detected a certain tone in his voice that suggested Tom wasn’t quite as happy as he pretended to be. Harry decided to give it a few days, see if Tom’s mood improved. If not, Harry would ask him about it. He hated seeing Tom distraught in any way. </p>\n<p>It took them a day to get to Bali and their hunt went much the same as the previous one, without a surprise attack of a lethifold this time. </p>\n<p>“That’s a pity,” Harry said, standing beside his suitcase in which he’d just dumped over 40 spider corpses while darkness fell around them. “I’d have loved to add another lethifold to my collection.”</p>\n<p>Tom was rooting around in the undergrowth. “There’s no sign of one. I can’t smell anything, alas.”</p>\n<p>Harry swallowed his disappointment and climbed inside his suitcase for some dinner and a shower. </p>\n<p>“I’ll keep watch tonight,” Tom announced as he also slid inside the suitcase and curled up in the holding area, head poking in Harry’s small apartment. “Just in case one slithers inside and tries to eat you alive.”</p>\n<p>“That’s much appreciated.” Harry was sure his wards would keep out lethifolds. Well, mostly sure. He opened up a can of pork and beans and boiled some rice. Once his dinner was ready Harry sat down on his couch and ate in silence while Tom watched him quietly. </p>\n<p>It was strange how comfortable Harry felt around Tom. How much he’d enjoyed having someone around all the time, even if that someone was currently stuck as an enormous murder serpent. </p>\n<p>Not for the first time Harry regretted that part of his profession. Harry loved travelling, seeing all parts of the world, but he knew all too well that doing so was a lonely existence. None of Harry’s previous partners had felt any desire to join him on the road, unfortunately. But now that Harry had got to spend a few weeks with a companion, however strange that companion might be, Harry knew with certainty that any romantic partner would want to travel with him in the future. </p>\n<p>It was a pity Tom was so old already. Harry was sure that if Tom had been around Harry’s age, give or take a decade, Harry would have proposed to him the second he turned back into a man. Harry didn’t even know what Tom looked like as a man, but that hardly mattered. Tom was clever and devious and had a wicked sense of humour and loved wandering the jungles of the world as much as Harry did. </p>\n<p>Tom was damned near perfect as a potential romantic partner, save for the fact that Tom was well over 80 years old. </p>\n<p>Well, Harry mused as he put his empty plate on the coffee table and leaned back in the couch. They could always remain friends. “Tom,” Harry said as he leaned his head back and closed his eyes, tired of breaking down spider bodies all day. “Once you’re back to yourself, I’d love it if you still joined me in my travels.”</p>\n<p>“I’d be an old man,” Tom pointed out carefully. </p>\n<p>“So? Old men can still travel. We’ll add a comfortable bed for you, make some adjustments in the bathroom if needed, and you’d be set.” Harry cracked an eye open and gave Tom a hopeful look.</p>\n<p>“In that case, I’d love to see some more of the world through my human eyes.” Tom blinked his large, yellow eyes at Harry in emphasis. </p>\n<p>Harry grinned. “So that’s a deal. We’ll be travel buddies.”</p>\n<p>“It’s a deal,” Tom replied in a quiet voice. Yeah, Harry was sure something was bugging Tom but he obviously wasn’t ready yet to talk about it. </p>\n<p>They travelled to Vietnam the following day and the day after that they arrived at the Acromantula colony. Harry dove down on his broom and Tom burst out of the suitcase, killing dozens of the beasts instantly. They had that little routine down perfectly nowadays. </p>\n<p>“Tom!” Harry yelled just as all the remaining Acromantulas had fled while the dead ones dropped down around them. “Shield your eyes!” </p>\n<p>There, halfway up the tree, was a bundle wrapped in spider silk that was moving faintly. Harry mounted his broom, flew up and carefully cut the bundle loose. He levitated it to the ground and used cutting charms to open the sticky spider silk. For a few long moments Harry thought it might be a human child, since it had about that shape and size, but when he finally opened up the top of the silk bundle he saw that it was a demiguise. </p>\n<p>“Oh, you poor thing,” Harry muttered. The demiguise had its eyes closed and was hardly conscious, but it was breathing and occasionally twitching its body.</p>\n<p>Tom remained at a safe distance, his third eyelids clouding his yellow eyes. “Is that a human?”</p>\n<p>“Nah, a demiguise. It’s injured.” Harry aimed his wand at his backpack and summoned his potions bag. He rummaged through it and then sighed in frustration. “Tom, do you know what would work against Acromantula venom? I don’t have any antivenom in stock.” Which was a bit of an oversight seeing as Harry had been hunting the beasts over the last two weeks. Ugh, sometimes Harry really got tired of being an impulsive, reckless Gryffindor.</p>\n<p>“Phoenix Tears,” Tom yelled back, still carefully keeping a distance. </p>\n<p>“Don’t have any of those, either!”</p>\n<p>Tom slithered a little closer, eyes still clouded. “I’m quite sure I know how to brew a quick and basic antivenom that would work. If I tell you what to do, can you brew it? I’m rather lacking in hands at the moment.”</p>\n<p>Harry chuckled and started removing the rest of the silk from the demiguise. “Severus will claim otherwise, I’m sure, but I can manage to brew most potions just fine. I do most of my own brewing, at least all of my everyday potions.” Harry picked up the demiguise and carried it inside the suitcase. Tom followed, eyes still carefully veiled. </p>\n<p>While Harry got his cauldron set up over the stove in his apartment, Tom gave him instructions from the doorway. The demiguise was resting on the couch, the sluggishly bleeding wounds on its abdomen clearly visible even through its thick pelt. It took almost an hour but then Harry had a potion that Tom assured him would deactivate most of the Acromantula venom in the demiguise’ body. Harry gently raised up the demiguise’s head and poured the potion in its mouth. With a little magic he helped the demiguise swallow. Next he gave it a general healing potion and a blood-replenishing potion and then he cleaned the wounds as best he could with an antiseptic potion. </p>\n<p>“There,” Harry said, wiping his hands on a towel. “That’s the best we can do.”</p>\n<p>Tom had been watching him with interest. “I’ve never seen a demiguise before.”</p>\n<p>“Few people have,” Harry agreed with a chuckle. “They are rather good at being invisible. I’ve seen one or two before in the wild, from a distance before they disappeared. But Newt has told me plenty of stories about the few he’s looked after during his life.”</p>\n<p>Just then the demiguise blinked its eyes open and looked at Harry with a large, black gaze. Then it spotted Tom out of the corner of its eyes, and it released a shriek before turning invisible instantly. </p>\n<p>“Fuck,” Harry said, reaching forwards with both hands to catch the demiguise but he only felt air. The demiguise was gone. </p>\n<p>“I think it just ran over me into the holding area,” Tom said with a few twitches of his large body. </p>\n<p>Harry sat back, bent his head and laughed. “We’ll leave the suitcase open so it can escape. We’ve got to get the dead spiders anyway.”</p>\n<p>“I’ll keep my eyes covered, just in case,” Tom offered, which Harry thought was very kind of him. </p>\n<p>Breaking down the spiders kept Harry busy for the whole day, as usual, and by the time he’d loaded up all the bodies he had a small mountain of dead spiders stacked in the desert habitat under heavy preservation charms. </p>\n<p>Harry cast a quick charm to count how many living things were currently in his suitcase. The answer came back as three. </p>\n<p>“So it’s still here,” Tom said as he came to a stop beside Harry. </p>\n<p>“Yep,” Harry said, deeply amused by the situation. “It’s probably hiding somewhere in one of the forests. We’ll never find it. Though…” Harry briefly hurried inside his apartment, rummaged around in his pantry, and came back with a can of peaches. “Newt told me they love peaches in heavy syrup. We might win its trust this way.” Harry opened the can with a swish of his wand and placed it just inside his tropical jungle habitat, guessing that’s where the demiguise was hiding. </p>\n<p>“I’ll just keep my eyes hidden for the time being,” Tom said with a tired little sigh. “It’s not uncomfortable,” he added quickly when he noticed Harry’s concerned expression. “But it’s just like looking through very dirty windows. It’s annoying.”</p>\n<p>Harry, who used to wear glasses before he had his eyes corrected, knew only too well how annoying it was to look through dirty lenses. “Or we could do the ritual and turn you back. That would solve the problem.”</p>\n<p>Shrugging his giant body, Tom turned away a little. “Or we could continue hunting. Wasn’t there another colony or two we could hit?”</p>\n<p>“Tom,” Harry said, stepping closer to Tom and placing a steady hand on his body. “Tom, why are you really stalling? We’ve got more spiders than we can even handle. We really do not need more.”</p>\n<p>Closing his eyes, Tom ducked his giant head, his whole body slumping down a little. “I’m scared,” he said in a whisper so soft Harry had trouble hearing it. </p>\n<p>“Why?” Harry kept a comforting hand on Tom’s body. </p>\n<p>“I’m well over 80. What if I turn back and die next week? What if I don’t get to live at all?” Tom’s whole giant body shuddered and Harry stepped up to it and gave it a hug as best as he could.</p>\n<p>“Or you might live for another 20 years. Or 40. Or 60. It’s not unheard of. Look at Dumbledore. That man is over 130 and he’s still around.” Harry pulled back a little and heaved a deep sigh. He understood Tom’s fears. It must be terrifying to have to make this choice, not knowing how soon death would come. “No one knows when their end comes,” Harry whispered, leaning his forehead against the side of Tom’s head. “My grandfather Fleamont Potter was a potioneer. A great man, funny and loving. I barely remember him because when I was 8 he blew himself up in his potions lab. Took half the house and my grandmother Euphemia with him.”</p>\n<p>“I’m sorry,” Tom muttered, finally opening his eyes again but keeping them shielded with his third eyelid. </p>\n<p>“Yeah, it was a huge shock to our family,” Harry said, remembering his grandparents with great fondness, but also with great sorrow. “It really messed up my dad, and right after the whole Pettigrew betrayal came to light. He was never the same after those incidents. Became a much harder and sterner man.”</p>\n<p>They remained quiet for a few long moments before Harry spoke again. “The point is, we don’t know when our time will come. Hell, I almost got eaten by a lethifold just last week. Not the first time either I barely escaped becoming someone’s meal. I have a dangerous profession.”</p>\n<p>Tom nodded in understanding. </p>\n<p>“Just know, Tom, that whatever time you have left, you’re welcome to spend it with me if you so desire.” Harry pulled back a little and gave Tom his most cheerful grin, even though his heart was filled with sorrow. “Or not, if you’re already tired of my awesome company.”</p>\n<p>“You would think that, but as it turns out, spending time with a staunch Gryffindor isn’t as bad as advertised,” Tom said, also doing his best to lift the general melancholic mood. “Very well. Let’s turn me back. Tomorrow. I want you rested before attempting the ritual.”</p>\n<p>“Excellent.” It was then that Harry realized they were still in Vietnam. “How about the day after tomorrow. Because we’re still a long way from home.”</p>\n<p>“Fine,” Tom replied with a toothy grin. </p>\n<p>The next morning, the can of peaches was empty but a quick charm showed that the demiguise was still somewhere in the suitcase. </p>\n<p>“Well, I guess he’s coming along for the ride, for now,” Harry said after he just finished securing their plentiful spider bounty for the journey. </p>\n<p>“Should we name it?” Tom asked, looking slightly miserable with his third eyelids still up. “What’s its gender?”</p>\n<p>“I didn’t get a good look,” Harry admitted as he put one foot on the lowest rung of the ladder leading out of the suitcase. “Their genitalia are hidden by all their fur.”</p>\n<p>“How about Rene?” Tom suggested with a mildly uncertain look. </p>\n<p>“That would work,” Harry agreed and started climbing up the ladder. “You have fun with Rene. I’ll get us home.”</p>\n<p>Travelling back to Britain took a day, and by the time they arrived home Harry was too tired to hop to Diagon Alley for supplies for the ritual. He saved that for the next morning. He also stocked up on canned peaches because like most demiguises, Rene really seemed to enjoy them. Aside from all that sugary goodness Rene had an entire jungle to munch on in the tropical habitat. The space may be magically expanded but all the plants in there were real, just for such an occasion that Harry found himself with a herbivore guest.</p>\n<p>“We should do it in the basement of my cottage,” Harry suggested once he lowered himself in the suitcase again. </p>\n<p>“As long as you secure your home against any unexpected visitors, that shouldn’t be a problem.”</p>\n<p>Outside the Augurey, who seemed to have started calling Harry’s apple tree home, released a long and slow wail to announce a coming rain storm. Harry smiled at the sound while he locked his floo and cast every security and privacy charm he knew on his doors and windows. That should do it. </p>\n<p>Once inside the basement, Harry got to work drawing the ritual circle and adding the herbs and crystals to the runes that he painted on the stone floor. Once he was all set, Harry opened the suitcase and called out to Tom. “Ready when you are!”</p>\n<p>Tom slid out of the suitcase and straight into the ritual circle where he coiled himself up as tightly as he could. It still barely fit and Harry couldn’t help a chuckle at seeing Tom’s disgruntled face. </p>\n<p>“You couldn’t have made it a bit bigger?” Tom grumbled while he shifted first left and then right until he found a comfortable position. </p>\n<p>Harry waved towards the stone walls around them. “Not really, no. I didn’t have time to magically expand my basement so we have to make do.”</p>\n<p>“Very well, carry on.” Tom stopped moving and gave Harry an expectant look. </p>\n<p>For some strange reason, Harry got a bit of a lump in his throat. “All right.” Harry raised the scroll, wand in hand, ready to start casting the necessary magic. “Just for the record, I had a great time with you and I can’t wait to meet you in person.”</p>\n<p>“Likewise,” Tom replied in a bit of a tight voice. </p>\n<p>Since there was no longer a reason to delay, Harry squared his shoulder, inhaled a deep breath, and started casting the magic. Harry wasn’t really familiar with rituals, aside from a few simple ones he used to cast temporary wards or something. This was strong, heady magic, and Harry was glad that he had a powerful magical core. James Potter had more than once complained that Harry was wasting his magical potential by running after critters. Harry always ignored him, but he had to admit that being magically powerful did come in handy from time to time. </p>\n<p>Like when turning a basilisk back into a man. </p>\n<p>The magic grew while the air filled with the scent of ozone and Tom released a soft, grunting noise. Eventually Harry cast the final spell and looked at Tom expectantly. </p>\n<p>Tom’s yellow basilisk eyes looked right back at him. </p>\n<p>“So that didn’t work,” Harry sighed, chest full of hot disappointment. </p>\n<p>“You did everything right, I’m sure,” Tom said in confusion. </p>\n<p>“Don’t move. I’ll floo Barty.” With a quick gesture at Tom to stay put, Harry rushed up the stairs, unlocked his floo and threw in some powder. “Grimmauld Place!”</p>\n<p>Usually Kreacher answered the floo, and Harry planned to ask for Barty so hopefully they could keep their conversation from Regulus. The last thing Harry wanted to see happen was Regulus putting a stop to their ritual. </p>\n<p>Unfortunately, it was Regulus himself who answered the floo. </p>\n<p>“Er…” Harry tried to look at innocent as he could. “Is Barty home? I just have a quick question for him. About demiguises. I found one.”</p>\n<p>Regulus narrowed his grey eyes and released a soft, knowing sigh. “I know exactly what you two are up to, Harry Potter. Convince me that this murderer deserves to be a man again, and I’ll get Barty.”</p>\n<p>Crap, Harry didn’t have time for this but he recognized that mulish look on Reggie’s face and he knew there was no way he’d get what he wanted without giving Regulus a proper answer. “All right. Tom’s sorry. He really is. And he’s well over 80 years old and he just wants to quietly retire and drink tea and read books. Those are the things he’s missed. Not world domination. And we’ve agreed that, his health permitting, we’ll continue to travel together because we have a lot of fun, just the two of us.”</p>\n<p>Reggie blinked a few times and tilted his head while he processed all that information. Then he sighed and gave a sharp nod. “I’m holding you accountable, Harry. If Riddle only thinks about becoming a Dark Lord, I’m skinning you alive.” Before giving Harry a chance to reply, Regulus turned around and yelled, “Barty! Harry’s in the floo.”</p>\n<p>Barty came storming down the staircase and all but skidded to a halt in front of the fireplace where he threw himself down on his knees. “Did it work?”</p>\n<p>Harry shook his head. “No, and I’ve got no clue why.”</p>\n<p>“Hm.” Barty’s face scrunched up in a thoughtful from. He didn’t even seem upset that it hadn’t worked. Then again, Barty liked nothing more than an academic challenge and this was exactly that. “Did you leave anything out about the ritual?”</p>\n<p>Harry shook his head again. </p>\n<p>“Did Riddle partake in any other rituals before the longevity one?”</p>\n<p>Harry was about to deny that until he remembered the horcruxes. Those counted as a ritual. Perhaps even a bit more than that. “Er…yeah, he did.”</p>\n<p>“What was the ritual?” Barty asked, giving Harry a confused look as to why Harry seemed so reluctant to answer. </p>\n<p>“He…er…it was a horcrux ritual,” Harry mumbled. </p>\n<p>“Oh yes, what a real gentleman he is,” Regulus said in scathingly mocking tone. “He used the murder he committed to split his own soul and create a horcrux. A real charmer, that one.”</p>\n<p>“Two horcruxes,” Harry whispered, hanging his head. </p>\n<p>“What the fuck, Harry?” Reggie said, with feeling. </p>\n<p>“Well, that explains why the ritual didn’t work,” Barty mused, entirely unfazed by his husband’s sudden anger. </p>\n<p>“The thing is, though, the objects no longer hold his soul,” Harry said quickly, as though that information made up for the unspeakable things Tom had done. Horcruxes were a real taboo for a reason. “We checked.”</p>\n<p>Barty’s frown deepened. “But the containers are still intact?”</p>\n<p>“Yep.”</p>\n<p>“That’s your answer,” Barty concluded with a satisfied grin. “The souls may have returned to the body, but the containers are still whole. The only way to truly destroy a horcrux is to destroy the containers. Basilisk venom should work.”</p>\n<p>Harry heaved a huge sigh of relief. “Thanks, Barty.”</p>\n<p>“What the hell was that?” Regulus said, jumping in shock. </p>\n<p>Barty also twitched violently. “Something just rushed past me.”</p>\n<p>Oh fuck, Harry had left the suitcase open in the basement. “It’s fine. It’s just a demiguise. Put out a can of peaches for now and I’ll come get it later.”</p>\n<p>“Harry!” Reggie looked about ready to skin Harry right there and then. “Tell me it’s really a demiguise. Not a lethifold or worse.”</p>\n<p>“It really is a demiguise. Promise. His name is Rene.” Harry pulled back from the floo. “Canned peaches!” And then he quickly closed the floo and locked it again. Rene would be fine. He hoped. At any rate, Harry had no time to worry about their unexpected guest because he had a basilisk to transform. </p>\n<p>“You have to destroy these,” Harry said, all but throwing the diary and the ring at Tom. “Bite down on them during the ritual and it should work. Also, Rene escaped so once we’ve got you back to your old self we have to go find him.”</p>\n<p>Tom looked like there were many things he wanted to say at that moment but he wisely kept his mouth shut and simply gave Harry a nod. </p>\n<p>Without wasting another minute, Harry got started on the ritual again, feeling a bit more confident now that he’d already performed it once. Ten minutes of casting magic later, Tom bit down on his horcruxes and what followed was a rush of magic that shook Harry’s cottage on its foundation. A huge cloud of smoke filled the basement and Harry quickly waved his wand around to clear the air. </p>\n<p>Once he was able to see again, and breathe again without coughing, Harry noticed that the basilisk was gone and a man lay in the middle of the ritual circle. </p>\n<p>A young man. Probably the age Tom would have been when he performed the ritual in the first place, which was somewhere in his twenties.</p>\n<p>Tom slowly sat up, stark naked, but Harry hardly noticed that. All he had eyes for was Tom’s face, with its black, wavy hair, and his brown eyes and sharp cheekbones. </p>\n<p>“Holy crap,” Harry blurted before he could stop himself. “You’re hot!”</p>\n<p>Chapter 12</p>\n<p>The brief, knowing smirk Tom gave him was quickly replaced with a look of vague disbelief as Tom pushed himself up from the ground and looked down his own body. </p>\n<p>Harry also couldn’t stop staring at Tom. He really was a very attractive man. Tall and lean and grinning like a man possessed as he stepped up to Harry. </p>\n<p>“My wand?”</p>\n<p>“Oh, of course.” For a second Harry had hoped Tom would perhaps want to touch him, hug him or even kiss him, but Harry understood that Tom probably had other priorities right now. Harry reached inside his wand holster and pulled out both their wands. He handed Tom his. </p>\n<p>Tom’s eyes closed in obvious pleasure as he held his wand. Harry imagined that after all this time it must be very close to the first time any of them touched a wand that choose them. A huge magical rush that promised great and exciting things in the future. </p>\n<p>Next Tom aimed his wand at Harry, his expression giving nothing away while his eyes narrowed. </p>\n<p>Harry got a brief glimpse in his mind of Reggie’s disappointed expression while he muttered about knowing all along Tom Riddle was bad news and why had Harry not simply believed Regulus when he had the chance. </p>\n<p>But Tom didn’t cast any hexes or curses. Instead he used a bit of gentle magic to pull Harry closer until they were practically face to face. Harry was no short guy by any means, but Tom still had a few good inches over him. Tom slowly, as to give Harry time to move away, bent his head and brushed his lips across Harry’s. </p>\n<p>“I’ve been wanting to do that for a while now,” Tom whispered against Harry’s mouth. </p>\n<p>“I’d love nothing more than to take this further,” Harry replied in an equally quiet voice. “But you’ve got basilisk breath. Perhaps a shower first?”</p>\n<p>Tom threw his head back and laughed, and it was a wonderful sound, dark and deep. Harry grinned in reply and then led Tom up the stairs to the bathroom. He showed Tom where to find everything he needed, and then rummaged around in his own wardrobe for some simple clothes for Tom to wear for now. Tom was a very rich man, so they could visit Diagon Alley later and buy everything he needed. </p>\n<p>Tom gave him a cheeky wink before sliding the toothbrush Harry had given in in his mouth. Harry left him to it and decided to fulfil one of Tom’s simple desires. He put the kettle on and brewed a large pot of Earl grey. He also fried up some eggs and bacon, and toasted some bread which he slathered with Molly’s homemade butter and strawberry jam. </p>\n<p>By the time Tom entered the kitchen, clean and dressed, Harry had a small feast waiting for him. </p>\n<p>“You are amazing,” Tom said, all but throwing himself into a chair at the kitchen table while Harry served him a steaming cup and a full plate. “Keep this up and you’ll never be rid of me.”</p>\n<p>Harry chuckled as he sat down and tucked into his own lunch. </p>\n<p>Afterwards, as Harry placed the dirty dishes into the sink, a very satisfied Tom pressed himself against Harry’s back and brushed a kiss across the back of Harry’s neck. Harry turned around in his embrace and met Tom’s lips with his own. Their kiss was long and slow and they explored each other with their tongues to their heart’s content. </p>\n<p>“Whatever gave you the idea I wanted to be rid of you?” Harry asked as they finally pulled back. Tom had deep brown eyes, but Harry was sure he could see a fine sheen of gold over them still. </p>\n<p>Tom shrugged, ducking his head a little, though his smile bordered on being smug. “I just don’t want to assume anything.”</p>\n<p>“I want you to stay,” Harry said, blunt as can be, because he wanted there to be no confusion on this subject. “I enjoy your company. I’d love for you to fuck me silly later.”</p>\n<p>“I have no objections to any of that,” Tom said as he stepped away from Harry. “Though I would like to go and get my affairs in order first and buy some necessities.”</p>\n<p>Harry beamed at him. “Well then, let’s go to Diagon Alley!”</p>\n<p>Severus had put all of Tom’s earnings in Harry’s vault, so while Tom opened up his own Gringotts account, Harry transferred Tom’s share to his brand new vault. Tom withdrew a sizable bag of gold, looking like he could barely believe all this wealth was truly his. </p>\n<p>They stopped at Madam Malkin’s where Tom got a basic wardrobe, and then at Flint and Sons – Cobblers, where Tom got two pairs of shoes. Next was Flourish and Blotts where Tom bought fairly new books on just about every subject. Which led to a quick stop at the luggage shop for an expanded trunk with special library features. </p>\n<p>“I’d like to catch up on all the new magical developments of the last five decades or so,” Tom said with an eager gleam in his eyes. “And this way I can easily take my books with me during our travels.”</p>\n<p>Harry merely nodded in response. His chest felt like it was glowing and he didn’t think he’d ever felt this happy before. Finally Harry had found a potential partner who wanted to live his lifestyle, who wanted to spend time travelling with him. It was more than Harry had ever dared to hope for and it made him feel so ridiculously ecstatic, Harry hardly knew what to do with himself. </p>\n<p>Tom visited a few more stores for a few more knickknacks, and Harry made a short trip to the grocers for some more canned peaches. He also picked up some canned pears, pineapple and cherries, just to see if those would help lure Rene back to their home through the floo. </p>\n<p>Just as they were about to call it a day and have some dinner in one of the little restaurants in Fantastic Alley, a very unwelcome voice sounded behind them.</p>\n<p>“Mr Potter, I heard some interesting stories about your latest quest,” Albus Dumbledore said, leaning on his cane while he gave Harry a searching look. “That you caught and killed a lethifold.”</p>\n<p>“Technically, that wasn’t me,” Harry said with a strained smile. He gestured at Tom standing beside him. “My friend here did the beast in.”</p>\n<p>“Your friend…” Dumbledore stopped speaking, his face draining of all colour as he stared at Tom in absolute disbelief. “Tom… my boy… how…” Dumbledore bent down a little, releasing a pained groan, his free hand pressed to his chest while he leaned his entire weight on his cane. A passing woman rushed towards him and placed a hand on his elbow. </p>\n<p>“Headmaster, are you well? Do you perhaps need to sit down?” the woman asked in obvious concern. </p>\n<p>“I’m fine, just had a bit of a shock.” Dumbledore pushed himself up again, though now his face looked a rather sickly white. </p>\n<p>“I was cursed,” Tom said, apparently eager to stave off any more questions from his despised former professor. They had decided along the way they would tell people the truth of what happened to Tom since it explained where he’d been for so long and how he was still so young. “I’ve been stuck as a basilisk for 60 years, hiding away in an Indian forest. Harry found me and helped me return to myself.”</p>\n<p>“Oh, Harry, my dear boy,” Dumbledore said with a tired sigh. “What have you done?”</p>\n<p>“Saved a man’s life,” Harry said with a hard stare. “If you’ll excuse us, Headmaster, we were just about to go and have dinner. Good day.” And with that Harry turned on his heels while Tom did the same. They marched off without a backwards glance. </p>\n<p>They ended up in a little bistro named The Golden Goose, where they enjoyed generous portions of fish and chips, with a huge slice of chocolate cake for afters. They made small talk along the way, talking about countries they wanted to travel to and creatures they wanted to see. They studiously avoided talking about Dumbledore and that unwelcome confrontation, even though Harry was certain they hadn’t heard the last of the headmaster just yet. </p>\n<p>Harry turned out to be right when they returned to Harry’s cottage in Hogsmeade. In the backyard they heard the Augurey wail and Harry glanced up at Tom as he opened the garden gate so they could enter the yard. “It seems he wants to stay. We should probably name him.”</p>\n<p>Tom peered up at the bedraggled grey bird up in the apple tree. “How can you even tell its gender?”</p>\n<p>“The male’s plumage is slightly more colourful than the female’s,” Harry said with a chuckle.</p>\n<p>“<i>That</i> is colourful plumage?” Tom asked in disbelief. </p>\n<p>“It’s very subtle.” Harry couldn’t stop grinning at Tom’s wide-eyed look. “How about Paul?”</p>\n<p>“Fine by me.” Tom turned towards Harry and stepped a little closer. “How about we let Paul practice the song of his people while I take you to bed and give you something you seemed to rather desperately want earlier.”</p>\n<p>“Let’s,” Harry agreed and brushed a kiss against Tom’s lips, body heating with anticipation of what was to come. </p>\n<p>The backdoor banged open and a furious James Potter stood in the doorway. “Harry James Potter, get inside! Now! And bring that criminal with you!”</p>\n<p>Harry could only gape at his father. “What the fuck,” Harry muttered, and behind him Tom muttered the exact same thing. “Let me do the talking,” Harry said with a quick glance over his shoulder. “How the hell did he even get in here? The floo was locked.”</p>\n<p>The answer to that question became clear the moment Harry and Tom stepped inside the living room. There stood Severus, face carefully blank. Severus was Harry’s emergency contact and he was tuned into all of Harry’s wards for this very reason. So Lily had probably begged her old friend to open the wards for them. And Severus being the secret drama queen that he was, wasn’t about to miss some good old-fashioned Potter family dramatics, now live in Harry’s living room. </p>\n<p>But Severus wasn’t the only guest. Sirius and Remus stood beside Lily, looking as though they both regretted ever becoming friends with James in the first place. Against the opposite wall Regulus and Barty stood, looking very much as if they weren’t sure what was going on and why they were there in the first place. </p>\n<p>“You weren’t answering your floo,” Barty said with a bright smile. </p>\n<p>“We’re here to remind you to come get your pet,” Regulus added with a bit of a scowl. </p>\n<p>“Also, nice to meet you.” Barty gave a little wave in Tom’s direction. </p>\n<p>“Thank you for your invaluable help,” Tom replied with a polite nod. </p>\n<p>“Is this an intervention?” Harry asked as he glanced around the room while his father quietly fumed with his arms crossed tightly. </p>\n<p>“Harry,” Lily said, head tilted to convey some extra sympathy. “We’re all here because we love you.”</p>\n<p>“That’s nice,” Harry said in a snippy tone. “Now please all leave. I have plans for this evening.” </p>\n<p>“We’re here because you’re housing a criminal and participated in some dubiously legal rituals to allow this man entry into the country,” James finally said, voice almost a growl. Sirius sighed and rolled his eyes, seemingly not at all in agreement with what James was trying to pull. </p>\n<p>“Accidentally turning yourself into a basilisk is not a crime,” Harry snapped, unable to contain his rising anger. His father always had that effect on him. “And me helping to turn him back to himself isn’t against the law either!”</p>\n<p>Severus gave Harry a very subtle yet very pointed look. Ah yes, Harry was on the verge of having full blown verbal diarrhoea and desperately needed to be stopped. Harry knew full well that the Slytherin code clearly stated that when confronted with an adversary, one should stop talking. But it seemed that being surrounded by his Gryffindor kin rubbed off more Gryffindor values on Harry than he wanted.</p>\n<p>“How about the student he murdered while he was at Hogwarts?” James said, a challenge in his voice, daring Harry to deny that accusation. </p>\n<p>Harry did what he had to and kept his mouth shut, lips pursed tightly. In the corner of the room near the door Regulus could barely contain a smile and he quickly ducked his head. Tom, being well aware of the Slytherin code of conduct, also kept his mouth shut and merely looked at James with barely enough polite interest. </p>\n<p>“Well,” James said, expression turning into one of triumph. “Got nothing to say to that, have you?”</p>\n<p>Regulus cleared his throat. “Was Mr Riddle ever officially accused of this crime?” For some reason, this made Sirius grin widely and he beamed at Reggie with pride. Harry was briefly confused why Regulus would even want to speak up in Tom’s defence, but then he remembered the Slytherin code of conduct once again. When confronted with hostile Gryffindors, Slytherins always banded together. Always.</p>\n<p>James gave Reggie a very snooty sort of look. “Not to my knowledge. But Dumbledore was adamant that this man was behind the brutal murder of a girl at Hogwarts during his time as a student.” </p>\n<p>“Ah yeah,” Barty said with a thoughtful frown. “I think I’ve heard about that incident. Didn’t Hagrid do her in by accident via that man-eating spider he was illegally keeping as a pet? I’m quite sure he was expelled for that very reason. He’s told me about it often enough over the years.”</p>\n<p>Harry had trouble to hide his laughter. Hagrid was well known for telling everyone the story of how he got Aragog in vivid detail, so it wasn’t the least bit of a surprise that Barty knew of it.</p>\n<p>James’ expression had turned completely sour, as though he was sucking on a lemon. “That’s neither here nor there. Dumbledore is certain this man is a murderer.”</p>\n<p>“But the law clearly says that a man is innocent until proven guilty, Prongs,” Sirius said, pushing himself away from the wall to stand beside James. “If you’re really certain Dumbledore is right and this man has committed a crime then go and find evidence and bring him up on charges. But simply standing here accusing him of a crime someone else was already convicted for is wasting everyone’s time.”</p>\n<p>James squared his shoulders and got that haughty expression on his face he always did before laying into Harry for his poor life choices. “This has gone far enough, Harry. You’ve abandoned your family, rejected our values and now you’re shacking up with a criminal.”</p>\n<p>It took Harry everything he had not to rip into his father. Surprisingly, Harry didn’t need to, because Severus did if for him. </p>\n<p>“It sounds as though you’re jealous of your own son, Potter,” Severus said, smooth as can be with an entirely bored expression on his face. “Of course, it’s no surprise, since Harry is far more successful in his career than you are in yours. He makes more money, he gets more job satisfaction and he is much better regarded by the general public for his entertaining books and articles.”</p>\n<p>“How dare you,” James breathed, going for his wand. </p>\n<p>“Oh, I dare,” Severus said, reaching for his own wand and aiming it at James. </p>\n<p>“No, stop!” Lily stepped between them, holding up both hands to try to calm the situation down. She had no success, but someone else did. </p>\n<p>“ENOUGH!” Tom bellowed, making everyone, even Harry, jump. “I have been a literal beast for 60 years and I still have better manners than you both. You are uninvited guests in Harry’s home, yet here you are trying to duel in his living room. If you are so eager to do each other some serious damage, you will go outside and do it there. And with that I mean the street, not the yard. We don’t want Paul to get injured because of your inability to control your emotions even as grown adults.”</p>\n<p>“Who’s Paul?” Barty whispered, leaning over a little in Harry’s direction. </p>\n<p>“An Augurey I rescued from Draco’s woodland. He now lives in my apple tree,” Harry whispered back with a chuckle. </p>\n<p>“Ah. Thanks.” Barty was back to smiling now that he had another answer to one of his many questions he ran into on a day to day basis. </p>\n<p>“This isn’t over,” James said, shoving his wand back in its holster and marching out of the room. He shouldered Severus to the side as he did so, but thankfully Severus let that slide and merely sneered in response. </p>\n<p>“Sorry, Harry,” Sirius said as he briefly stopped in front of Harry. “I’ll make sure he calms down.” And with that, Sirius and Remus hurried after his friend. </p>\n<p>“Harry,” Lily sighed while giving Harry a hug he didn’t return. “Think about what you’re doing.”</p>\n<p>Harry blinked at his mother in genuine confusion. “What I’m going? I’ve saved a man’s life and I made a new friend. That’s it. Whatever crawled up James Potter’s arse has nothing to do with me.”</p>\n<p>The stern look Lily gave Harry in response was full of disappointment but Harry couldn’t care less. He was done with orchestrating his life to his parents’ wishes. He was his own man, plain and simple. </p>\n<p>When it became clear Harry wasn’t going to apologize, Lily simply sighed and shook her head. “We’ll talk later.” And with that she disappeared after her husband. </p>\n<p>“Thanks,” Harry said to Severus, who merely nodded in return and also left. </p>\n<p>Regulus gestured to the floo. “Get your pet, Harry. It keeps creeping out Kreacher. His heart can’t take much more of an invisible animal sneaking about and stealing his cabbages.”</p>\n<p>“Yeah, all right.” Harry pulled on Tom’s wrist while he stepped up to the floo. He picked up his backpack and made his way to Grimmauld Place. </p>\n<p>That is how Harry found himself stalking through the dark hallways of the Black ancestral townhouse with an opened can of peaches in his hand. “Rene, I promise you, the scary snake monster is gone. There’s now a very nice and polite gentleman who is not going to hurt you.”</p>\n<p>Barty glanced at Tom. “Looks like he might be a while. Want to see the library?”</p>\n<p>“Do you need to ask?” Tom gave Barty a cheeky little smile and followed him to the next floor up. </p>\n<p>It was probably a good thing Reggie was busy comforting a very upset Kreacher, because Harry doubted he’d have been as eager to let Tom inside one of the country’s greatest private libraries. Even if Reggie had spoken in Tom’s defence, he didn’t yet seem quite eager to fully accept him. Harry figured Regulus wanted to wait and see what Tom would get up to in the coming weeks and months before making any final judgements on his character.</p>\n<p>“Come on, Rene. I know you love peaches.” Harry sighed and put down the opened can. He reached in his backpack and got out the can of pears instead. “Let’s try these then.”</p>\n<p>It wasn’t until Harry opened a can of pineapple that he felt a small, invisible hand reached inside the can and grab a small, yellow chunk of fruit. “Ah, so you love pineapple even more than peaches.” Harry grinned down at his new invisible friend. “Well, come along then and you can have the whole can. Reggie, I found him! Open the floo!”</p>\n<p>Carefully, with the can becoming emptier and emptier, Harry lured Rene back to his cottage. There was a moment of some confusion when Harry wasn’t sure if Rene had followed him through the floo, but eventually the can of pineapple on Harry’s coffee table moved on its own accord and Harry knew he’d gotten his wayward friend home. </p>\n<p>“I’m closing the floo,” Harry yelled at Reggie’s face dancing in the green flames. “I don’t want Rene to slip through again. Tell Tom to apparate home.”</p>\n<p>Harry didn’t mind that Tom was having a little fun with Barty in the library. Tom was a bibliophile who had been deprived of books for 60 years. Harry understood Tom had some catching up to do. While Rene kept snacking on the pineapple and the other cans of fruit Harry put out for him, Harry decided he might as well take a shower before turning in. He was exhausted by the day’s events. </p>\n<p>As Harry stood under the warm spray massaging shampoo in his hair, the curtain drew back and Harry felt a hand on his shoulder. “Oh Rene,” Harry said with an exaggerated sigh. “We must be careful before we are caught.”</p>\n<p>Tom’s chuckles were warm and deep as he squeezed Harry’s wet shoulder. “Mind if I join you?”</p>\n<p>“Not at all,” Harry said with a smile as he looked over his shoulder. Tom had already undressed himself and slipped right into the shower with him. “Have fun with Barty?”</p>\n<p>“Oh yes,” Tom said, wrapping his arms around Harry, pressing himself to Harry’s back. “But then I remembered that I could be having even more fun with you.”</p>\n<p>Harry rinsed out his hair and then gave Tom an apologetic smile. “I’m sorry, but I’m exhausted. Can we leave the fucking until tomorrow?”</p>\n<p>“Of course.” Tom leaned over to give Harry a soft kiss. “How about I give you a hand instead?”</p>\n<p>“Now that’s an excellent plan,” Harry mumbled, returning Tom’s kisses with eager touches of his tongue. They brought each other off with quick strokes of their hands and afterwards they dried off with a few charms and crawled into Harry’s warm bed. </p>\n<p>“How are you?” Harry asked as they lay cuddled together, naked bodies entwined. “This was your first day as a human again.”</p>\n<p>Tom chuckled and rubbed his nose through Harry’s hair. “It’s been rather surreal at times, I must admit. But I’ve also felt happier than I ever have, I’m sure. Overall…today I’ve been at peace.”</p>\n<p>Harry gave him a kiss in response and then let sleep claim him. </p>\n<p>They were rudely awakened the next morning with banging on the door. “Whoever that is can fuck off,” Harry muttered, pressing his face into his pillow with a groan. Beside him, Tom reacted much the same. And Harry was absolutely determined to ignore whoever that was. But then they started hacking away at his wards and that wouldn’t stand. </p>\n<p>“Fucking hell.” Harry jumped up, grabbed his wand, summoned his robes and then hurried down the stairs. Tom was right there by his side as Harry ripped the front door open. </p>\n<p>James Potter stood outside the door, an absolutely glowing look of triumph on his face while a few Aurors Harry didn’t know were trying to bring Harry’s wards down without much success. </p>\n<p>“Tom Marvolo Riddle,” James said, wand out and pointed straight at Tom. “I hereby arrest you for the murder of Albus Dumbledore.”</p>\n<p>Chapter 13</p>\n<p>Once Ginny Weasley was old enough to understand why she was poor, her entire future changed. </p>\n<p>Her parents, Arthur and Molly Weasley, were loving, kind, hard-working but slightly naive people. When they’d been expecting their third child and the Burrow needed expanding, they’d gotten a loan from who they assumed was an honourable wizard. Unfortunately for them, Aloysius Nott was anything but. One might best describe him as a loan shark with a talent for writing creative contracts with exorbitant interest rates. </p>\n<p>That is how Arthur and Molly Weasley got stuck paying off a small loan for the rest of their lives. Arthur’s already measly Ministry salary was stretched almost to the breaking point under these payments. The thing was that the contract was so obviously skirting the law that it probably wouldn’t hold up in front of the Wizengamot. But to get it in front of the Wizengamot one needed a solicitor, and solicitors were far too expensive for the Weasleys to afford. </p>\n<p>When Ginny Weasley learned all this, she was determined to become the first ever solicitor in the Weasley family. Problem with this was that becoming a solicitor required a four year apprenticeship and those were not free. In fact, a law apprenticeship was amongst the most expensive of apprenticeships, aside from a Potions one. A master may decide to wave any apprenticeship fees if the student was exceptionally talented or otherwise benefited the Master in some ways, like having a important family name. </p>\n<p>Such had happened with a young but poor man named Severus Snape, who was so naturally talented that several Potioneers had actually offered Severus a salary to come work as their apprentice. This was practically unheard of. </p>\n<p>Ginny Weasley had no family name to fall back on, nor was she particularly talented in ways that stood out, aside from on the Quidditch pitch. </p>\n<p>It was her good friend Harry Potter who ultimately inspired Ginny. When Harry left Hogwarts he was determined to get a Mastery in Magical Zoology. But Harry’s family refused to pay for it, so Harry used his other major talent, that of a Seeker, to fly for the Montrose Magpies for many years while he got his mastery. </p>\n<p>This, Ginny realized, was her one and only chance to save her family from financial doom. She put everything she had in becoming the best Quidditch player she could be in her final year at Hogwarts. She was Captain of the Gryffindor team and led them to victory in the Quidditch Cup. And when she applied to the Holyhead Harpies she was hired right out of Hogwarts as their new star Chaser. </p>\n<p>Ginny kept living at the Burrow and saved every knut she made. She even wrote articles about Quidditch for several newspapers and magazines, and she accepted a Spellington Broom Wax sponsorship, all to earn as much money as she could. After 4 long years she finally had enough to pay for a law apprenticeship. Ted and Andromeda Tonks accepted her as their new apprentice and taught her everything they knew.</p>\n<p>Unbeknownst to Ginny, however, someone had been keeping a very close eye on her career. What had started as an innocent crush on a pretty girl who looked particularly good while flying a broomstick at Hogwarts had eventually turned into something of an obsession. </p>\n<p>Theodore Nott, youngest child of Aloysius Nott, was a brand new solicitor who’d apprenticed under his uncle Lambert Nott. He was also madly in love with Ginny Weasley, even if he’d yet to speak a word to her. </p>\n<p>It wasn’t until Theo, as he preferred to be called, ran into Ginny in the bowels of the ministry that he finally spoke to her. And the words he said to Ginny were definitely enough to make her notice him at once. </p>\n<p>Theo said, “Sue me, Ginevra.”</p>\n<p>And Ginny had. She’d dragged Theo and his entire family in front of the Wizengamot and gotten that illegal contract nullified at once. Not only that, but Aloysius Nott had to pay back any gold, aside from the loan’s principal, he’d taken from the Weasley family over the years, plus a little extra as a fine.</p>\n<p>And Theo had loved every second of it. </p>\n<p>What followed was a whirlwind romance born on the Wizengamot floor. They flirted while they defended clients, they got hot and bothered while they listened to each other’s final remarks, and within a few weeks they were fucking and five months later they were married. </p>\n<p>Nowadays they ran a successful law practice called Nott &amp; Weasley – Solicitors. Ginny had insisted on keeping her own name. She’d worked far too hard to just give it up, and Theo honestly couldn’t care less as long as she agreed to become his wife. </p>\n<p>This is why Harry ended banging on the door of their lovely farmhouse in Ottery St Catchpole early in the morning. </p>\n<p>Theo opened the door, clearly in the middle of getting dressed, his shoes untied, his tie undone. “Harry? What’s the emergency?”</p>\n<p>Harry leaned one hand against the doorpost while he panted. “I need your help. Or Ginny’s. Or both.”</p>\n<p>“I’m expected in the Wizengamot in half an hour, but Ginny has office duty today so she can see you,” Theo said, opening the door further to let Harry in. </p>\n<p>Ginny came walking down the stairs, wearing a black pantsuit. Once Ginny had been officially sworn in as a solicitor, Hermione had taken her shopping in the muggle world and Ginny had fallen in love with the sharply cut pantsuits she found there. She wore nothing else to the office these days. </p>\n<p>Ginny raised a single eyebrow as she stopped in front of her friend. “Harry? What’s going on? Please don’t tell me that lethifold you caught ate someone. That’s going to be a challenge to defend in front of the Wizengamot.”</p>\n<p>“No, no.” Harry shook his head and finally felt like he could breathe again. Ginny was an amazing solicitor. She would be able to help Tom. “My dad has lost his mind and he’s arrested my boyfriend for Dumbledore’s murder even though I’m sure the old man just died of a heart attack.”</p>\n<p>Ginny blinked. “Okay, tell me everything. But first take a few deep breaths. Blippy, tea for two!”</p>\n<p>After they sat down in the sitting room and Harry finished a strong cup of Earl grey he was able to tell Ginny the whole story. </p>\n<p>“Pfft.” Ginny said with an unimpressed snort. “They probably don’t even know the cause of death this soon after he died. We’ll demand an autopsy first thing. That should get your man off in no time.”</p>\n<p>“Thanks,” Harry said, finally feeling like things would be all right again. He hadn’t dared attack his father that morning, not with four other Aurors around. Harry knew James would arrest his own son in a heartbeat and with Harry behind bars as well there would be no one to arrange for legal help and to ensure a fair trial was held. Tom had understood this much as well, and he’d gone quietly with James while giving Harry a reassuring smile. After that Harry had gotten dressed in a hurry and apparated to Ottery St Catchpole at once. </p>\n<p>Ginny and Harry used her floo to get to the Ministry and Ginny marched them straight to the office of Susan Bones, Head of the Auror Department. Susan was of course the niece of Amelia Bones, who had been Head of Magical Law Enforcement for many years until she eventually ran for Minister for Magic which she remained to this day. Susan’s father, and Amelia’s brother, Edgar Bones was the current Head of Magical Law Enforcement. Good old nepotism at its finest.</p>\n<p>“We enjoy playing a game of Quidditch on the weekends,” Ginny explained when Harry wondered out loud how Ginny even knew Susan Bones personally. Harry knew her from Hogwarts because they’d been in the same year, but they never spent any time together. “Susan is a ferocious beater. She played for Hufflepuff during her Hogwarts years,” Ginny added with an admiring smile. </p>\n<p>“Ginny, what can I do for you?” Susan was seated behind her desk and gave Ginny a curious look. </p>\n<p>“Save James Potter from ruining his own career, for one,” Ginny said, and then she gestured at Harry. “This is my good friend Harry Potter, the zoologist. His boyfriend was just arrested by James on some bogus charges because James doesn’t like his son dating a Slytherin.”</p>\n<p>Susan sighed, long and deep, and then she waved her wand and summoned her Patronus. “Get me James Potter. Now,” she said to the silvery wolf, who disappeared through a wall immediately. </p>\n<p>For the next five minutes Ginny and Susan made small talk about their Quidditch plans for the weekend while Harry tried not to succumb to the nerves he felt swirling through his entire body. Harry kept telling himself that everything would be all right and Tom would be at his side again in no time. But a small little voice in the back of Harry’s mind was already planning on how to get Tom out of Azkaban. Perhaps he could train Rene to put sleeping potions in the human guards’ beverages and then sneak in himself to break Tom out. And if that didn’t work and Harry truly became desperate, he could always go and get Aisa the basilisk and just storm Azkaban like the reckless Gryffindor he was. </p>\n<p>The prospect of never seeing Tom again had that big of an effect on Harry, that he was seriously considering the life of a wanted criminal just to have Tom by his side again. Harry had never met someone like Tom before, someone who fit him and his strange life so perfectly. Heck, they even spoke the same, very rare language. If that wasn’t true love, Harry didn’t know what was. </p>\n<p>James Potter barged into the office without knocking and looked down at Susan Bones over his nose as though she was a mere secretary and not his immediate boss. One might wonder why James Potter wasn’t the Head Auror, or even Head of Magical Law Enforcement. He was certainly old enough, with enough years in the field to qualify for it. </p>\n<p>But the fact that James Potter’s best friend had turned out to be the worst crime boss their world had seen in decades, while James hadn’t noticed a thing wrong with him, had pretty much killed James’ career. Ever since then James had been passed over for every single promotion, as had Sirius Black. They were doomed to work the rest of their lives as Aurors in the field because neither had noticed that their best friend Peter Pettigrew was running a huge crime syndicate right under their noses. </p>\n<p>Harry suspected that this was the most important reason James Potter was so adamant that Harry become an Auror. It was, at least to James, the one opportunity they had to save the Potter name, at least in the Ministry. Hyacinth had become a Healer, just like Lily was, so James couldn’t complain about that. Harry, though, had chosen what to James seemed like an entirely useless profession and thus Harry should drop it and do as his father told him. But Harry wasn’t about to give up his own life and happiness because his father had shitty taste in friends, and hence their battle of wills had begun and seemed to be coming to a head, finally, in Susan Bones’ office. </p>\n<p>“Do you have an autopsy report for Albus Dumbledore yet?” Susan asked, giving James a stern glare. </p>\n<p>“Not yet. Should be coming at end of the morning,” James muttered while giving Harry a disgusted glare. </p>\n<p>“Then why on earth have you arrested a man for Dumbledore’s murder?” Susan demanded. “From all initial assessments I’ve seen it appears he died of massive heart failure.”</p>\n<p>“Because Dumbledore told us Tom Riddle was a criminal right before his own death. If that’s not suspicious, I don’t know what is,” James said in a sort of belligerent tone that suggested everyone in the room was batshit crazy aside from himself. </p>\n<p>Ginny snorted and crossed her arms. “You mean a senile old man accused my client of a crime someone else was convicted of 70 years ago.”</p>\n<p>Sighing, Susan shook her head and gave James a tired look. “Did Dumbledore present you with any actual evidence?”</p>\n<p>“His word should be enough!” James said with finality. </p>\n<p>Susan looked like she very much wanted to roll her eyes but her professionality stopped her at the last moment. “Auror Potter, release Mr Riddle from custody at once and drop the charges.” When James looked ready to explode in protest, Susan actually stood up from her chair, placing her hands on her desk as she leaned closer to James. “I don’t care what sort of vendetta you have against your own son and his boyfriend, but you will keep it out of my department and the Wizengamot, is that understood? If evidence shows up that Mr Riddle is guilty of a crime, I will arrest him myself, but until such a time he remains a free man.”</p>\n<p>Harry was deeply impressed by Susan’s little speech, because it even got James to back down.</p>\n<p>“Fine,” James muttered, slowly stepping up to the door. “But just for the record, you’re making a huge mistake.”</p>\n<p>“Duly noted,” Susan snapped, glaring at the man with fire in her brown eyes. “Now get the hell out of my office.”</p>\n<p>Harry got an impulse he couldn’t control and he quickly followed James into the hallway. “Dad, this is it,” Harry said, finally saying the words he’d wanted to say for years and years but hadn’t dared. These were his parents, after all, and Harry loved them, even if he hadn’t actually liked them for years now. “You’ve gone too far this time. I no longer want any contact with you or mum.”</p>\n<p>“Harry, that is codswallop. You’re our son, even if you haven’t acted like it in years,” James started on his usual monologue of how Harry was the family disappointment, but Harry was done. He was well and truly done. </p>\n<p>With an empty heart, that had once housed endlessly conflicting emotions, Harry stepped away from his father. “Goodbye,” he said and then quickly entered Susan’s office again, shutting the door behind him with a huge sense of finality. </p>\n<p>“You okay?” Ginny asked with a knowing glint in her eyes. Harry could only nod in response, throat too tight for any verbal response. “Mum was saying just the other day she hasn’t seen you in too long. Come over Sunday for dinner at the Burrow and bring your new man.”</p>\n<p>“We’ll be there,” Harry whispered, beyond grateful for the many amazing people he had around himself. Even if he’d just lost his parents, Harry knew he still had plenty of family to fall back on in his life. </p>\n<p>Fifteen minutes later Harry and Ginny approached the Atrium where they found Tom patiently waiting. Harry gave him a long, tight hug. </p>\n<p>Ginny cleared her throat after a few minutes. “Hi, I’m Ginny Weasley. Harry’s friend and your solicitor. If you ever need anything, just contact me.”</p>\n<p>“It’s truly a pleasure to meet you,” Tom said, finally prying himself away from an overly clingy Harry. “And thank you for your help.”</p>\n<p>Ginny waved his gratitude away. “I barely did anything. I have to be in the office, though, so I’ll see you both Sunday.”</p>\n<p>“What’s on Sunday?” Tom asked after Ginny disappeared in the throng of people around them. </p>\n<p>“Dinner with Ginny’s parents, Arthur and Molly. They’re lovely people,” Harry said, looking up at Tom in slight disbelief they were really together again. The relief he felt was enormous and made him question his earlier thoughts of what he would do if Tom had been locked up. Harry leaned closer so he could whisper in Tom’s ear. “I was about ready to get Aisa and storm Azkaban if you’d been convicted.”</p>\n<p>“What a splendidly Gryffindor plan,” Tom said with a terribly fond smile.</p>\n<p>“I would have done it, too,” Harry insisted, though he couldn’t hold back a wide grin. “What I’m actually trying to say is that I’ve… you know… gotten used to you and I’d like to keep you around.”</p>\n<p>“<i>That</i> is your big romantic declaration?” Tom rolled his eyes, though his cheeks flushed a slight pink in obvious pleasure. </p>\n<p>“Well, you try it, then,” Harry said, winding his fingers through Tom’s and all but dragging him to the fireplace. </p>\n<p>“How about I show you instead,” Tom whispered against the side of Harry’s head. </p>\n<p>“You did make me a promise last night, that’s true,” Harry said, warm arousal coiling in his belly. “I’m going to keep you to that promise.”</p>\n<p>When they arrived home, Tom took Harry to bed, even if it was the afternoon. They then proceeded to show each other exactly how much they’d grown to like the other. Multiple times. </p>\n<p>Life went on and Harry kept his distance from his parents, though not for lack of trying on their part. But Harry had informed everyone of what had happened and what he’d decided to do about it, and even Severus understood that Harry meant it this time and no longer let Lily through Harry’s wards whenever she begged him to. </p>\n<p>Dumbledore’s autopsy came back as heart failure, as everyone had expected, so Tom didn’t hear from the Auror department again, much to Harry’s relief. </p>\n<p>Five weeks after Tom’s morning in a jail cell they woke up to a grunting sound. The first thing Harry saw was two large dark eyes giving him a demanding look. </p>\n<p>Rene stood beside the bed, visible this time, with an empty pineapple can in his hand. He shook it at Harry, grunting again. He’d started showing himself more and more since a few weeks and nowadays he was almost always visible whenever he got hungry. </p>\n<p>“Rene needs breakfast,” Harry mumbled into his pillow while outside Paul announced that there was rain coming with a few wails. </p>\n<p>Beside him, Tom turned over and gave Harry a bleary look. “I’ve got my own critters to look after.” In a box beside Tom’s side of the bed several tiny kittens stirred and let out pitiful squeaks. A neighbour across the street had found a litter of kneazles no more than three weeks old under his shed that appeared abandoned and he’d dropped them off at Harry’s. Since Harry had been in a meeting with his publisher that day, Tom had accepted them. In the brief period Tom had looked after them by himself he’d already grown rather attached to them. </p>\n<p>Harry worried they might end up with five kneazles of their own, though thankfully Hermione, Ginny, Hyacinth and even Blaise had already expressed an interest to adopt one of them once they were old enough. So Tom and Harry would probably end up with one kneazle for themselves, which was fine by Harry. </p>\n<p>Harry got up, pulling on his bathrobe as he walked into the living room. There, on a wall, hung the lethifold, displayed under heavy preservation charms. Harry had studied the creature extensively, even going so far as performing an autopsy with the assistance of Severus and Tom. Harry was currently writing a new book about the lethifold and their extraordinary capture of it. And when Harry’s publisher heard about Tom’s unique predicament, he’d offered him a book deal as well, which Tom had accepted. Tom had just started writing his own book about his life as a basilisk and kept coming up with silly titles, such as ‘The Day I Ate A Tiger’ and ‘A Basilisk Named Tom’, much to Harry’s amusement. </p>\n<p>Just as Harry shuffled into the kitchen and grabbed a can of pineapple for Rene from the warded cupboard, a Patronus flew into their kitchen. It was Rupert Longbottom’s hedgehog. “Hyacinth went into labour last night and the baby is almost here. Meet us in St Mungo’s.”</p>\n<p>“Tom!” Harry yelled, instantly awake. “Tom, Hyacinth is having her baby.”</p>\n<p>“You go ahead!” Tom yelled back from the bedroom. “I’ll feed the kittens and then meet you there!”</p>\n<p>Harry threw on whatever clothes he could find while Rene sat on the couch, munching pineapple and watching Harry tripping over himself. Then Harry rushed out the door and apparated straight to the hospital. </p>\n<p>“Is Tom looking after the kittens?” Hermione asked him first thing as he met his friends in the hallway outside Hyacinth’s room. “Are they all right?” Hermione hadn’t adopted another cat after she lost her beloved Crookshanks, and now that she had a baby kneazle coming her way soon she appeared more of an expectant mother than Hyacinth even.</p>\n<p>“Yeah, they’re fine. He’ll be here soon,” Harry assured her while he waved hello to everyone else already there. </p>\n<p>Once Harry’s parents arrived, his friends closed ranks around Harry and didn’t let them near him, for which Harry was eternally grateful. Tom arrived next and studiously ignored the suspicious glares James kept sending his ways while he chatted with Regulus and Barty.<br>\nHyacinth accepted that Harry had gone no contact with their parents and was more than willing to accommodate Harry’s desires as long as Harry accepted that Hyacinth still wanted to keep a relationship with James and Lily. Harry was fine with that, since he had no desire to try to dictate his sister’s life. She was old enough to make her own choices. </p>\n<p>Rupert yanked open the door and stuck his head out. “It’s a boy!” he yelled, face flushed while a baby’s wail could be heard in the background. </p>\n<p>The two couples of brand new grandparents were allowed in first, but after that it was Tom and Harry’s turn, together with Neville and his wife Hannah.</p>\n<p>“We’ve named him Francis Harrison Longbottom,” a proud Rupert said while Harry carefully held his nephew. He looked a bit like a grindylow, if Harry was to be honest, but that was probably just the result of the recent birth. Harry hoped. </p>\n<p>“We’ll call him Frankie,” Hyacinth said with a tired smile while she kept a careful eye on Harry holding her child. </p>\n<p>“A fine name,” Tom said as he stood beside Harry and peered at the babe with mild interest. </p>\n<p>Later, when they came home and sat down on the couch together, Tom turned to Harry and gave him a questioning look. “Do you want kids?”</p>\n<p>“Hell no, I’ll stick with animals,” Harry said. Tom seemed utterly relieved by that reply but before he could say anything they were ambushed by five kneazle kittens with very sharp claws. </p>\n<p>“Oh look who’ve managed to escape their box,” Tom said with a beaming smile while one of the kittens climbed on top of his head. </p>\n<p>Rene came sauntering into the living room, shaking his empty can in their direction while outside Paul started wailing.</p>\n<p>Harry shared a smile with Tom while a kitten crawled inside his shirt and he realized that right at that moment, life was absolutely perfect.</p>\n<p>The end.</p>"
}