{
  "id": "22194055",
  "url": "https://archiveofourown.org/works/22194055?view_full_work=true",
  "author": [
    "jehall2"
  ],
  "title": "AU: ONE SHOTS TEAM TONY",
  "rating": "Not Rated",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "The Avengers (Marvel Movies)"
  ],
  "relationships": [],
  "characters": [
    "Tony Stark",
    "Steve Rogers",
    "Natasha Romanov (Marvel)",
    "James \"Rhodey\" Rhodes",
    "Scott Lang",
    "T'Challa (Marvel)",
    "Wanda Maximoff"
  ],
  "additional_tags": [
    "Civil War Team Iron Man",
    "Not Steve Friendly",
    "Not Natasha Friendly",
    "Not Wanda Maximoff Friendly",
    "Not Sam Friendly Sometimes",
    "Not Clint Friendly Sometimes",
    "Team Tony Salty Don't Like it Don't Read it"
  ],
  "language": "English",
  "series": "",
  "published": "2020-01-10",
  "completed": "2022-05-09",
  "words": "39,738",
  "chapters": "48/48",
  "comments": "2,299",
  "kudos": "6,368",
  "bookmarks": "1,197",
  "hits": "166,393",
  "summary": "<p>Not Steve Friendly, Not Wanda Maximoff Friendly, Not Scott Lang Friendly, Not T'Challa Friendly (somewhat)</p>\n<p>Tony brought in Spider Man to capture Team Cap with as little confrontation as possible. What if he decided it wasn't worth it after Scott's stunt with the fuel truck.</p>\n<p>Tony gets called out for doing a lot of stupid stuff, but failing to call in the guy who created the helicarriers to down the helicarriers seems a bit stupid. Tony calls out Natashalie.</p>\n<p>What if Clint showed a bit more loyalty to Nat and gained some common sense?</p>\n<p>Wanda immediately jumps to how the Accords would impact her personally instead of the team in general always bothered me. What if it bothered someone else more?</p>\n<p>What if Steve took a moment to reflect before Vision's creation in AoU?</p>\n<p>What if someone else had been staying with Wanda in the compound?</p>\n<p>Nat's decision to let Cap go had more repercussions for Tony than her, but what if that wasn't the case?</p>\n<p>Was the Raft inhumane? Really?</p>\n<p>A conversation between Rhodey and Tony after CW regarding Peter.</p>\n<p>One more about adding Wanda--I'll never get over the lack of logic!</p>\n<p>Natasha seems completely incapable of not doing exactly what Captain America wants even if it's completely ridiculous. What if she stuck to her guns for once.</p>\n<p>So, Tony gets high-jacked in space and Rhodes completely forgets the Rogues screwed over his boy?</p>\n<p>Rhodey's just done.</p>\n<p>Trump may be president, but he'll really always be best known for Celebrity Apprentice. I couldn't help it.</p>\n<p>Just read it.</p>\n<p>Steve has enjoyed the benefits of being Captain America whether he wants to admit it or not, but when you keep saying that the safest hands are your own, there are drawbacks as well.</p>\n<p>Something different happens in Siberia.</p>\n<p>Of course, Tony's horrified and sad about his parents . . . but he has been doing therapy. Let it never be said that he can't see opportunity when it knocks though.</p>\n<p>A number of people asked what happened after Tony left Siberia in Chapter 18--well, here you go.</p>\n<p>Tony Stark wasn't recommended.</p>\n<p>T'challa, vengeance is served. And boy is it cold.</p>\n<p>How would everything end if things had turned out differently in Siberia.</p>\n<p>Nat likes to talk about egos.</p>\n<p>Steve tells Tony to take his olive branch and shove it. That would piss me off. How about you?</p>\n<p>Vision is not Jarvis.</p>\n<p>What is Sam took his calling a bit more seriously.</p>\n<p>Ellis is a Cap fan.</p>\n<p>Tony Stark: Not Recommended</p>\n<p>Tony makes a different decision regarding the Time Heist</p>\n<p>What if the black order didn't arrive the same day as Bruce, and when tony met Dr. Strange?</p>\n<p>This is all from a single idea that I had while reading another fic about Bucky as a victim in CW, and whether or not people are automatically pro-Bucky when he is a bit of a co-dependent dick himself. While I feel for Bucky, he did aim to shoot Tony once Steve took a well-deserved hit for the lie he'd hidden. If Tony has to be sorry for reacting to his grief, then Bucky should be sorry for raising a weapon against Tony just for punching the guy that lied to him and abused his trust.</p>\n<p>Bucky is innocent, but does that make him a good man?</p>\n<p>Steve and Tony had a breaking point, and it wasn't Bucky. What if that changed?</p>\n<p>Dumb and Dumber, Ladies and Gentleman. Steve is careless and Wakanda has great tech, but if the whole world comes a knocking, there's not much you can do.</p>\n<p>Tony does a profile of his own.</p>\n<p>After Bucharest, during CW.</p>\n<p>Cap's got his Bucky. He shouldn't be greedy.</p>\n<p>Every now and again a rich white guy deserves some empathy too.</p>\n<p>Pepper was there.</p>\n<p>What if Tony wasn't losing his mind from heavy metal poisoning when he met Natasha?</p>\n<p>Get your licks where and when you can.</p>\n<p>Seriously? No one was punished?</p>\n<p>I watched Civil War with my kids again the other night, and I was struck by how absolutely dismissive Wilson was to anyone else's opinions. What kind of counselor is that?! But what would it look like if Tony got upset by that behavior? He never would have stood for someone disrespecting Jarvis. What about Vision? How might things have devolved?</p>\n<p>I love Tony because at the end of the day, he's a pragmatist.</p>\n<p>Watched CW with the kids this weekend and my fifteen year old son said it wasn't even believable because the Secretary of State is pretty powerless for the types of scenarios the Avengers pictured Ross masterminding.</p>\n<p>Actions have consequences, but let's say that Cap convinced Tony to accept the intentions matter argument. And for all of those that think it's absurd that there is still Team Tony this long after CW, that is still a big issue. I will always think that Ultron was a turning point in the canon plot and that CW was the point of no return regarding Steve's character arc--I really think he became a much more flawed, selfish character at that point than people want to accept, and I don't believe that he was ever really redeemed for the choices he made in those films. Fighting Thanos was more like what Wanda did in Ultron--the only choice he could ever make at that point. He may have worked with Tony to fight Thanos, but no one will ever know if his desperation to continue on was more about Bucky and his individual friendships (Maybe Steve's goal since Bucky and most of his people got snapped) or saving everyone else (Tony's goal since he sacrificed what he had finally obtained to get them all back).</p>",
  "notes": "<p>So, I had another work that didn't tag properly, but was still a short collection of one-shots (listed in Avengers and not Team Iron Man). I decided to just add those chapters here and delete the other work. Some of you might have already read this and the next couple of one-shots from that previous work. Sorry for the confusion.</p>\n<p>This is a one-shot from another collection that I'm deleting. Sorry if you end up re-reading one you've already read.</p>\n<p>This is another chapter taken from the one-shot repercussions that I'm deleting. Sorry if you've read it off that fic.</p>\n<p>This is the last chapter taken from that other work. Sorry for any re-reads or confusion.</p>\n<p>\" \"=speech<br>' '=thoughts</p>\n<p>Bucky comes off kind of bad in this one too. I'm basing this off of a lot of tropes from Returning Rogues Fanfiction--so, this is like Infinity Wars and EndGame didn't happen. Not canon (None of this is really canon since these are \"what-if\" scenarios, but whatever).</p>\n<p>This is dedicated to Xythia. Don't let the haters get you down. It's better to laugh.</p>\n<p>Most people blame Tony--and he even says \"my fault\" in CW--but he has serious control issues, and that doesn't account for a whole series of other events (some of which he may not know about. Did Wanda ever admit to playing with his mind? Why would she?). Still, even if Tony's to blame, you can't tell me that there were no repercussions.</p>",
  "text": "<p>“You know what, no.” Tony watched as a fuel truck flew through the air before bursting into flames—Spiderman, Rhodey, and the King of Wakanda scattering to all sides to avoid the blast. Tony huffed, disgusted with his “teammates” before lowering to the ground and calling to his team through the coms to gather up and fall back.</p>\n<p> “They’re falling back,” Bucky said as Steve and his teammates grouped up, still ready for a fight.</p>\n<p> “Alright, Cap. I don’t know what you expect to accomplish by attacking us, but I’m out. You’ve made yourself clear. You don’t care about any of us; you’ll go through us if that gets you what you want. Well, then Ross can have you. My guys, back it up. I’m calling in Ross.”</p>\n<p> “Wait, Tony! What,” Nat called urgently.</p>\n<p> Just as T’Challa added “Barnes is mine,” running towards Barnes.</p>\n<p> Tony quickly shot off wrist and ankle restraints before darting the rampaging King. </p>\n<p> “Tony, you know what Ross is going to do!” Nat gripped his arm tightly as if he could even feel it through the suit.</p>\n<p> “I don’t care, Romanov. They just tried to take our whole team out with a fuel truck—some guy that I don’t even know, I might add,” he shouts with a wave of his gauntleted fist. Steve and the others are watching warily, but Steve grimaced at the comment.</p>\n<p> “Hey,” Scott mumbled half-heartedly, thinking anonymity might be better considering his recent mistake with the fuel truck.</p>\n<p> “I called in a teen super hero because I thought we could trust these guys, our teammates, to at least care about making a reasonable choice considering what they were facing. We should be the clear choice. But I’m not going to risk any more people for those—criminals,” he snarled in disgust.</p>\n<p> “We are not criminals! You are the one locking away the innocent,” Maximoff cried, still angry about being on “house arrest” at the compound.</p>\n<p> “Save it, honey. You can leave whenever you want. You just won’t be coming back. Not on my dime. Get your own damn Visa,” Tony said aggressively before calling through another line on his com. “Ross, the deal is off. They aren’t willing to listen to me and mine. Do what you have to.” With that, Tony turned and the others began to fall in line behind him, Rhodey carrying the drugged king. Nat stood in the middle, clearly waffling on what to do.</p>\n<p> “Tony, there are winter soldiers,” Steve called desperately.</p>\n<p> “You know what. I’ll make one concession here,” done with Steve’s unwillingness to compromise, and completely unsure if this little story was made up to save Barnes or not. Tony flipped his mask back down targeted the jet in the hanger and fired a short-range missile. Everyone watched in shock as the hanger and the only transport vehicle remaining blew sky high. “Get your own ride,” Stark sneered casually. “And don’t worry, Ross. I’ll pay for that one.” Tony turned and walked away as sirens began blaring in the background.</p>\n<p>Tony leaned forward over the bar as Nat and Steve, alongside a Sam Wilson, stood before him to make their little proposal. His body shook with repressed anger.</p>\n<p> “So, you want me to take over where SHIELD left off. For what?”</p>\n<p> “Hydra is still out there, Tony. Someone has to beat them back before they can regroup and try another Project Insight,” Steve said sternly.</p>\n<p> “And not so much in the role of SHIELD as funding the initiative. I know you gave considerable funds to Fury,” Natasha added matter of factly.</p>\n<p> “Right. So, you want me to butt out and just bank roll you. Nah. Not gonna happen,” he said shortly as he crossed his arms over his chest. Natasha just rolled her eyes.</p>\n<p> “We both know you’re not in a position to be involved with the day-to-day upkeep of SHIELD due to your position in SI.”</p>\n<p> “How considerate of you, but had I kept more of an eye on Fury we wouldn’t be dealing with the fall out of your little rebellion right now, Romanov.”</p>\n<p> “We did what we had to do,” Steve said taking an aggressive step forward.</p>\n<p> “Uh huh. Who are you again,” Tony asked suddenly, turning to Wilson.</p>\n<p> “Um, Sam Wilson. Retired Air Force. I test piloted your Falcon Prototype actually,” Sam said easily.</p>\n<p> “How long have you known Cap and Romanov here.”</p>\n<p> “We met a couple of days ago. Cap runs the same jogging path I do.”</p>\n<p> “A couple of days ago. Tell me again why you couldn’t risk calling me,” Tony said as he turned to face Romanov, completely disregarding Captain America for the time being.</p>\n<p> “I didn’t have a secure line, Stark,” Romanov gritted out.</p>\n<p> “Aaaa,” Tony yelled, making an irritating buzzer sound that had Romanov glaring at him dangerously. “I gave each of you custom Stark phones after New York with direct contact to Jarvis programmed into them. Try again.”</p>\n<p> “Jarvis can be hacked,” she began again.</p>\n<p> “Aaaa! We both know that Jarvis has never been hacked to the point where he is shut down or unable to detect the threat. Try again.”</p>\n<p> “We didn’t know who we could trust,” Steve said loudly, jutting out his chin.</p>\n<p> “So instead of calling in the tech guy who recently helped you save the world DESPITE the World Security Council and SHIELD’s methods that I warned you about on the hellicarrier, you decided to go pick up the guy you met jogging the other day—because you can trust him?”</p>\n<p> “It sounds really bad when you say it that way,” Sam muttered under his breath.</p>\n<p> “Well, isn’t this a breath of fresh air. Someone with at least a bit of sense. That’s because it is really bad, Mr. Wilson. These two idiots just made you an accessory to treason and several hundred cases of accidental manslaughter. Congratulations.”</p>\n<p> Sam and Steve looked at Tony in horror, but Romanov didn’t even flinch.</p>\n<p> “Sometimes sacrifices have to be made,” she said softly.</p>\n<p> “Yet Jarvis noticed that you took the time to remove the information surrounding two names, Natashalie: your buddy Barton and a Winter Soldier. Interesting choices there.” Tony watched out of the corner of his eye as Steve tensed.</p>\n<p> “As I said . . .”</p>\n<p> “Not good enough, Agent. Let me tell you how this is going down,” Tony said with a dark look in his eye. “The Avengers initiative is on hiatus. We’ll revisit the idea of the team once we’ve cleared up the utter catastrophe that you both caused,” he added before Steve could jump in. “But Romanov . . . you’re out. What was it you said? Iron Man, yes, but Tony Stark, not recommended? Well you’ve failed your own little profile now, Romanov. The feds contacted me this afternoon and asked why I wasn’t involved to prevent the National Security disaster that you caused, and I explained everything to them. EVERYTHING. They know that while Steve here might have had the idea, you should have known better and would have fully understood the repercussions of the actions you were taking.”</p>\n<p> “Tony, no! You can’t turn on Nat like this,” Steve yelled in surprise.</p>\n<p> “Oh, there is no loyalty or love lost between the two of us, Steve, because I know better. I know exactly who Natashalie is and what she was up to.”</p>\n<p> “She outed everything that she ever did, too,” Steve roared. “She sacrificed her own safety to ensure everyone knew the truth!”</p>\n<p> “Not quite, Steve,” Tony yelled back, turning away from Steve to stare at Nat. “This was no sacrifice. She knew that the best protection she was going to get once SHIELD came up for review as a result of your discoveries was to out everybody else at the same time. This disaster is the best cover she could have hoped for. Everyone is too busy scrambling to save everything else to worry about one little spy, right Romanov. What better way to escape the fallout of SHIELD’s dirty laundry than to disappear into a crowd?”</p>\n<p> “I wouldn’t expect you to understand about doing what’s right to wipe the red from your ledger, Stark,” she said haughtily, crossing her arms.</p>\n<p> “I have no red to wipe away, Black Widow. Everything I’ve done is legit. Selling weapons to the U.S. military was always an act of American patriotism for my family. Obie’s double dealing was dealt with as soon as it was discovered and I had no reason to suspect my godfather in the first place. No, my conscience is clear even if the guilt for deaths in general is something I choose to embrace now that I see the world differently. I changed, and that’s the difference between us, Natashalie. <br> There’s a reason you didn’t recognize Hydra in SHIELD. You may have switched sides, but you never switched methods. And you knew that everyone would know that very soon. Well, they’re coming for you, little spider. Better start running.”</p>\n<p>“We’re still friends, right,” Nat huffed while Clint held her down with a smile.</p>\n<p> “Depends on how hard you hit me,” he joked back as she flipped him to gain control. Just as she was about to kick out at Clint a red glow wrapped around her foot pausing the battle. Clint and Nat both stared at each other in surprise before Nat was brutally flung away into a shipping crate, the resounding clang following the harsh hit.</p>\n<p> Clint straightened and looked at Wanda in shock. That hit could have killed Nat, who wasn’t enhanced.</p>\n<p> “You were pulling your punches,” she reprimanded in a heavy accent before turning away to continue the fight.</p>\n<p> Clint stopped for a moment and took stock, looking around at the violence. Tony and Rhodes were both firing at the projectiles being sent their way and trying to corral the fighters with little success. In the corner, Steve had just dropped a shipping container on the young hero Spiderman who was struggling to hold the weight as Steve made a snappy remark and walked away.</p>\n<p> He thought back to the fuel tanker that Scott had thrown at the beginning of their fight, scattering his wayward teammates as they tried to avoid an insane blast hurled by a hero that he had never fought beside before.</p>\n<p> And Wanda had just turned on Nat and tossed her aside like yesterday’s trash. It was eerily similar to how she had reacted with Ultron. She wasn’t even willing to fight before she sent Vision through several stories of concrete the night previously, and now she was lecturing him on trying not to injure his long-time friend—the Godmother of his three children.</p>\n<p> Clint stood up abruptly and looked at Wanda, who had just tossed Rhodes aside like he wasn’t wearing a bulkier model of the Iron Man suit. He nodded once, took aim, and fired an arrow that landed a concussive blast on Wanda, NO, Maximoff.</p>\n<p> Wanda struggled up with a few scrapes and bruises just as Clint walked up to her. She looked at him in surprise.</p>\n<p> “Clint,” she began, confused.</p>\n<p> “You’re right. No more pulling punches. It’s dangerous.” With that Clint stuck and electronic arrow against her forehead just as he did when she was fighting alongside Ultron. How had he forgotten that! It was so easy to forget when she had been crying over her brother. But she certainly hadn’t cried over Vision or Nat.</p>\n<p> Clint turned after Wanda had fallen unconscious and shot another arrow at Scott. He dropped in surprise as well. By now, Tony had caught on and teamed up with Rhodes and Spiderman to capture Sam. Steve and Barnes were running like mad for the hangar holding the jet.</p>\n<p> Clint wasn’t called Hawkeye for nothing. He aimed and shot an explosive arrow at the hangar doors, blowing up the entrance and stopping any form of escape. </p>\n<p> “Clint,” Sam called in horrified shock. “What are you doing man?”</p>\n<p> “No, Wilson. What were we all doing? Look at this mess!” Clint turned and faced Tony. “Steve said there is a world-level threat that the Accords were keeping you from acting. Did he mention that?”</p>\n<p> “You mean he was serious just now,” Tony yelled in surprise. “I thought he was just bullshitting me to save Barnes and Maximoff again!”</p>\n<p> “Save Maximoff,” Clint asked harshly as he glared at Tony.</p>\n<p> “Clint, she just went on an unsanctioned mission in South Africa of all places and blew up a building that resulted in the deaths of more than twenty people. She’s on probation until Lagos gets a full review. If it doesn’t go her way, she’ll lose her Visa AND her Avenger status. She can’t afford any type of notoriety right now,” Tony sighed in aggravation. “Steve just can’t handle the political realities involved in these missions. I could have asked for an emergency mission and been off to fix this issue with a full team in less than an hour!”</p>\n<p> “That’s what I thought,” Clint sighed. “OK. Let’s get this figured out then. I’m supposed to be on vacation with my kids right now.</p>\n<p>“If we don’t do this now, it will be done to us later. And that won’t be pretty,” Tony said. Nat and Rhodey both nodded, but then Maximoff spoke up.</p>\n<p> “You are saying they will come for me,” she said darkly.</p>\n<p> “We will protect you,” Vision said, putting a reassuring hand on Wanda’s.</p>\n<p> “What? Seriously,” Rhodey asked incredulously.</p>\n<p> “Uh, what,” Tony asked.</p>\n<p> “We’ll protect you,” Rhodey mocked sarcastically. “No, we won’t! If you guys pull anymore of this vigilante bullshit in foreign countries, I’ll probably be the one sent to bring you guys in. I work for the U.S. military first and foremost, remember. What you did in Lagos was either an act of terrorism or an act of war, take your pick. The government had no choice but to sign on to the Accords after the disaster that you guys caused in Lagos! You DESERVE for them to come for you.”</p>\n<p> “That wasn’t her fault, Rhodes. That was on me,” Steve said angrily.</p>\n<p> “Sure as shit was! Which means the safest hands aren’t yours. If you can’t even tell who is ready for the field and who isn’t AND you don’t know the process for requesting permission to work internationally, then you have no business running missions at all. Countries have their own police forces and militaries for a reason,” Rhodey added aggressively.</p>\n<p> “Sign it, Cap. You’re Captain America, not Captain World. The rest of the world isn’t so comfortable with your star-spangled ass calling the shots,” Tony said seriously.</p>\n<p>“Ultron cannot tell the difference between protecting the world or destroying the world. Where do you think he gets that from” Wanda asked as Steve struggled with the idea that he was about to come to blows with Tony, his friend and teammate. He was disappointed, but that didn’t erase all of the good things Tony had done in the past.</p>\n<p> “Well, Jarvis is great,” Steve said suddenly, straightening up from his crouched position and looking down at Wanda. She was so young, but did that make her innocent? Did it make her right? She had attacked him and the other Avengers just recently. Sure, she had helped him save those civilians on the train, but she had also set the Hulk loose on civilians in the same day. And she had kidnapped Cho and worked alongside Ultron as well. Was he really looking to her for advice?</p>\n<p> “Tony Stark is a murderer, Steve! He killed my parents,” she said angrily, upset that he was thinking to question her now.</p>\n<p> Steve looked at Wanda seriously.</p>\n<p> “Wanda, I’m a soldier. Soldiers use weapons to fight wars that are sometimes necessary. Somebody had to stop the Nazis. And it was Howard Stark that gave me what I needed to do that. Tony did the same thing for a long time too when he provided weapons to the U.S. military. That doesn’t make him a murderer, it makes him a patriot. If you want to know who killed your parents, you should look at who was actually dropping those bombs. That’s a harsh truth, and I’m sorry for what you suffered, but I’ve watched Tony risk his life for others more than once. Those aren’t the actions of a murderer. That’s why I can stand here beside you in spite of fighting against you before,” he added softly, laying a gentle hand on her shoulder.</p>\n<p> Wanda knocked his hand off angrily.</p>\n<p> “Then suffer alongside your precious teammate,” she hissed as her eyes began to glow a dangerous red. Steve had seen this before. He quickly slammed his shield down on Wanda’s head being sure that his force would knock her out without killing her. By the time he looked in the lab, a new . . . being . . . was standing alongside Thor and holding Mjolner!</p>\n<p> “Captain,” Thor said seriously. “I saw in a vision that this new shield brother would fight alongside us to defeat Ultron. Steve nodded and picked Wanda up, laying her on a chair nearby. Tony was looking at her suspiciously.</p>\n<p> “Why are you bridal carrying a Hydra agent,” Tony asked sarcastically.</p>\n<p> “She and her brother helped me save a group of civilians while we were trying to hunt down Ultron. They turned on him and want to help. Her brother is outside.”</p>\n<p> “Uh, if they turned on Ultron, what’s stopping them from turning on us? Not the warm fuzzies they have for the Avengers, I’m guessing.”</p>\n<p> Steve thought for a moment. Wanda had said that Tony didn’t know the difference between protecting the world and endangering it. But she had also joined Hydra, claiming that she thought it was SHIELD. If D.C. taught him anything it was that SHIELD was like Hydra in that both groups used the same methods to achieve different goals—they were essentially the same even though he knew good people who worked for SHIELD. So, you couldn’t tell the good guys from the bad guys. Even good SHIELD agents had that problem, as Nat demonstrated. So, maybe Wanda needed the same kind of help?</p>\n<p> “I think she just doesn’t understand who are the good guys and who are the bad guys. She still wants to help people. And I want to show her how,” he added.</p>\n<p> “Well, not now, certainly,” Bruce said incredulously. They didn’t have time to fight over whether or not Maximoff was a lost cause or not. Personally, he thought the Hulk was likely to smash her the first chance he got.</p>\n<p>“I’m just going to run to the grocery store to pick up some ingredients,” Wanda said with a nod to Tony. She didn’t really care for his company, but she liked staying by herself at the compound even less. And they were teammates now after all. </p>\n<p> “That’s not really a good idea,” Tony said, standing quickly to block her way. She raised an eyebrow at him.</p>\n<p> “Tony, I’m going to the store. I’ll just be a minute,” and she started to walk around him. Tony quickly grabbed her arm in a soft but firm hold.</p>\n<p> “Before you do that, let me explain what Captain America wasn’t willing to. You’re an adult. I think you deserve to hear this.”</p>\n<p> Wanda looked at his hand before raising her eyes to Tony and giving a nod. Tony let go and gestured to the couch where they took a seat.</p>\n<p> “Wanda, do you know how Lagos looked to the world? You have a work Visa in place with the U.S. so that you can stay here and work as an Avenger, but that means that certain aspects of you and your history, history that was released in public legal settings, are easily accessible for anyone who wants to look. After Lagos, people had a reason to look once again. This is what they saw.<br> You are an ex-Hydra agent. That means that you are an ex-Neo-Nazi terrorist. No, stop,” he said abruptly, raising his hand to stop her before she could angrily respond. “I’m not judging. I’m telling you exactly how this looks. The world saw a white woman, an ex-Neo-Nazi terrorist, go to South Africa with Captain America and set off an explosion that killed more than 23 people.”</p>\n<p> “I was saving those people!”</p>\n<p> “Were you,” Tony asked, cocking his head. You see, Steve doesn’t really go back to look at the footage very frequently. He left that to the handlers like Coulson and Maria Hill, who both worked with him at SHIELD. But SHIELD is defunct, so I’ve been looking at the footage from your missions. You weren’t saving South African civilians. You had a gut reaction to save your friend Steve when he found himself suddenly in a blast zone. Again, I’m not judging. My gut instinct would be to do the same thing. Anyways, civilians would have died in either scenario, but no one has any reason to believe that you were helping anyone but Steve. Especially since no one knows what you were doing in Lagos in the first place.”</p>\n<p> Wanda stared at him in a suddenly dawning horror.</p>\n<p> “My point here is that right now, your Visa is in very real danger of being revoked. Wanda, let’s be real. Your status as an Avenger is what is keeping you from being tried for several cases of manslaughter in Nigeria. It is also what is keeping other places from trying to detain you for the time you spent with Hydra and working alongside Ultron. You’ve not been an Avenger long, not nearly long enough to have the same kind of support from ANYONE that Steve has as Captain America. You can’t get away with the same types of accidents that he can. And that’s the truth.</p>\n<p> And people are waiting outside right now hoping to point fingers until you snap and they can show that, yes, you always were a Neo-Nazi terrorist and you always will be. Are you going to let that happen, or are you going to stay inside and wait for us and the PR department to show that you’ve changed?”</p>\n<p> “I never thought of any of that,” she said softly, looking at her hands. She had felt very real guilt and grief for Lagos. And Steve has reassured her that she had done all she could, but it sounded like she still had a lot more to do.</p>\n<p> “Well, you know, now would be a good time to start thinking about those things. I know that Steve likes to think of you as a kid, but you have way too much power not to take the time to consider the bigger repercussions of your actions. Part of that is apologizing, which I know Steve hasn’t done since he doesn’t believe that you were at fault. But . . . and this is important, Wanda . . . when you lose control, that doesn’t let you off the hook. You have to know what you can and can’t do because you are in a position to either save or destroy lives.”</p>\n<p> Just then an explosion rocked the outer grounds of the compound. Tony frowned and stood.</p>\n<p> “Stay here,” he said. He walked towards the Iron Man armor in the corner and stepped inside. Wanda shuddered. She would never get used to the armor in sentry mode.<br> Tony was gone for a few minutes when Wanda heard a noise. By reflex she sent a knife towards what she knew to be an intruder, but stopped it just before it could make contact when she saw who it was.</p>\n<p> “Clint!”</p>\n<p> “Hey, kid,” he smiled. “Come on. Cap needs us.” He moved towards her, gripped her wrist and began to pull her towards the door.</p>\n<p> “Wait, Clint! Wait. I’m not leaving.”</p>\n<p> “Wanda, did you hear me? I said Cap needs us. You want to stay in high school, sit and mope. You want to make amends, get off your ass,” he said.</p>\n<p> “That is some patronizing shit right there,” Tony said as he stomped back towards Clint.</p>\n<p> “Stark,” Clint said aggressively. “We’re leaving.”</p>\n<p> “Fine. There’s the door,” he said with a wave of his hand. Tony knew that Steve was at the center of what Natasha was supposed to be handling in Vienna, but he had stayed to focus on Wanda, whose situation seemed more dire.</p>\n<p> Clint grinned and went to pull Wanda up again.</p>\n<p> “But Wanda stays.”</p>\n<p> “I knew you were a backstabbing traitor, Stark,” he hissed. “Steve said you were keeping her locked up and that I had to come save her.”</p>\n<p> Tony rolled his eyes.</p>\n<p> “If you mean that I told her to stay inside and avoid a PR nightmare while she’s in danger of losing her Visa, then yes,” he said, crossing his arms over his chest. “I’ve gotten used to Steve living in La-La-Land, but I thought you would know better, Clint. Just because Captain America says Scarlet Witch is his friend doesn’t mean that the president won’t hand her over to Nigeria to save his political skin.”</p>\n<p> Wanda was watching the back and forth nervously. Tony had surprisingly given her a lot to think about, but Steve and Clint were actually her friends. If Steve needed her, could she really say no?</p>\n<p> Wetting her lips and glancing to Clint nervously, she looked back at Tony before saying “Tony, move aside. I’m going with Clint.”</p>\n<p> “What? Didn’t you hear anything that I just said! Wanda, if you leave now, those people out there will never stop fearing you,” he said significantly.</p>\n<p> “I can’t control their fear, only my own,” she said, the red beginning to glow ominously around her hands.</p>\n<p> “That’s the stupidest thing I’ve every heard. Controlling other people’s fears is LITERALLY your super power,” he snapped back. “Alright. I gave you a chance, but I’ll say this. Wanda, if you leave now, then I’m done. I’ve stuck my neck out you time and again politically to help you with the Visa process. No more. You want to stick your neck out for Steve, then Steve can stick his neck out for you.”</p>\n<p> With that, Tony stepped aside. Wanda and Tony glanced at each other once again before running out the door.</p>\n<p> “Well, that’s that.”</p>\n<p>“You’re not going to stop, are you,” Nat asked softly as Steve and Bucky slowed to a stop before her.</p>\n<p> “Nat,” Steve started, but Nat just stepped aside.</p>\n<p> “Go,” she said, as if she was making a grand sacrifice.</p>\n<p> “Huh. That was easy,” Bucky muttered as he and Steve raced to board the jet and got it in the air. </p>\n<p> Meanwhile, Tchalla had made it to the hangar where Nat stood waiting for him, widow bites at the ready. Unfortunately for Nat, unlike Tony, Tchalla had no reason to trust a spy/assassin, Avenger or not. </p>\n<p> Nat fired the widow bites at the king who easily dodged before slamming into Nat full force and tossing her aside like a ragdoll. He didn’t even notice the loud crack of bones as he was busy going after the jet.</p>\n<p>**<br> Tony walked towards Sam with purpose. He ignored Clint’s obnoxious remarks and he wasn’t even interested in the Bug Man now that he didn’t have to fight him. He made it to Sam who stood up with his arms crossed.</p>\n<p> “So, it turns out that Steve’s story had more to it than we had time to consider at the airport. I need you to tell me where they went, Sam.”</p>\n<p> “Like that’s going to happen,” Sam said snidely.</p>\n<p> Tony pushed some buttons on his phone.</p>\n<p> “So that was Ross’s men losing Audio. They can’t hear what we’re saying. You have one minute, or Cap’s going to be facing a whole group of Winter Soldier wannabes with nothing more than . . . wait for it, the Winter Soldier. How do you think that’s gonna go down?”</p>\n<p> Sam sighed, but passed on the info after making Tony swear, he’d go alone. Before Tony could walk away Sam yelled back to him.</p>\n<p> “Stark, how’s Rhodes?”</p>\n<p> Tony looked away and back, glad that someone from the “team” actually cared about Rhodey. </p>\n<p> “He’s just been transferred for long-term treatment. It’s looking like a permanent paralysis from the waist down,” Tony said sadly. Sam dropped his head, horrified at what this had cost them.</p>\n<p> Then Tony turned to face Clint.</p>\n<p> “I’m surprised, Clint. Don’t care about Nat anymore? Not going to ask about her?”</p>\n<p> “I know Nat, Stark. She’ll have come around to the right side in the end. She can take care of herself.”</p>\n<p> “Well, not anymore,” Tony sneered. “Nat turned on the wrong person. The King of Wakanda decided to go through her, kind of like you guys did to us. She was Nat’s recruit, by the way. So, there’s a horrific form of poetic justice to this. The King of Wakanda is enhanced. When he threw her aside, she landed at an odd angle. Broke her neck. Nat’s dead, Clint. <br> Still think this was all worth it, working off the reservation for Captain America? Or was it because Captain America couldn’t stand his pretty princess over there having to wait out a media shit storm that he caused? Whatever. I’m going to make sure this Super Soldier nonsense gets handled and then I’m done with all of you. Maybe you don’t care about your friends, but I care about mine—and you guys cost Rhodey his legs and a career that he worked for his entire life.”</p>\n<p> Tony walked away, leaving Clint in shock, tears streaming down his face.</p>\n<p>Sam banged angrily against the wall as he watched the soldier usher a struggling Wanda into her cell. He was horrified. She had a blinking collar around her neck and was wearing a straight jacket. She struggled for a few minutes after he walked away, keying the code to lock the cell, but then she slumped against a nearby wall, practically lifeless as tears streamed down her face.</p>\n<p> “What’s wrong with you, man,” Sam yelled slapping the palm of his hand against the glass while Clint snarled something at the man. When Sam finally stopped to look at him, he could see that he was actually fairly young—couldn’t have been more than twenty-five.</p>\n<p> The soldier walked towards Sam then.</p>\n<p> “Don’t worry. They’ll only hold you and your two friends here for another day for processing, then you’ll be moved to more standard prison until your case goes to trial,” he said in a reassuring tone. He had a lot of respect for the Avengers. He wanted to see them treated well, even though there would have to be repercussions for the airport they destroyed and aiding and abetting a terrorist. He didn’t know why they had acted as they did, but no one was above the law. They were lucky they weren’t regular military or they would have already been court martialed.</p>\n<p> “Wait, my two friends?”</p>\n<p> “Yeah, you and the two guys here. The raft is for enhanced prisoners. You guys are just normal prisoners without all of your gear,” he shrugged. “I really respect what you’ve done before all of this though. I wanted to go into the Airforce, but I ended up in the Navy,” he smiled.</p>\n<p> “You can’t be ok with this,” Sam said, gesturing angrily to Wanda. “You can’t think this is an acceptable way to treat someone, even a prisoner?”</p>\n<p> “Man, what else are we supposed to do,” he said incredulously, finally realizing where Sam’s anger was coming from. “The collar inhibits her ability to mentally manipulate the guards. We have to read files on all incoming prisoners, and she drove people to suicide on a regular basis while working with Hydra! And we have to keep her hands bound somehow without tearing the skin. Her powers make this all necessary.”</p>\n<p> “But it’s wrong,” Sam sputtered.</p>\n<p> “So is what she did. If she didn’t want to be held, then she shouldn’t have broken the law in the first place. She sent that Vision guy through several stories worth of pavement! I’m sorry that she’s uncomfortable, but she’s dangerous.” He shook his head and walked away.</p>\n<p>“So, are we gonna talk about the kid now,” Rhodey asked nonchalantly.</p>\n<p> “What’s to talk about,” Tony responded without looking up, still fiddling with one of Rhodey’s braces.</p>\n<p> “Tony, you took a 15-year-old into a fight with the Avengers,” Rhodey said incredulously.</p>\n<p> Tony took a moment, and then looked up at Rhodey. He looked clearly angry for a moment, but decided against snapping. Instead he grabbed his phone and posted the same video that he had shown Peter to demonstrate that he knew who he was.</p>\n<p> “See that? That’s been up on YouTube for about 7 months now. If we do the math, you might note that Peter had been superheroing in sweatpants and a hoodie for five months before I approached him to help in Berlin. Do you see where I’m going with this?”</p>\n<p> “Ok,” Rhodey conceded. “So, Peter wasn’t going to stop this,” and Rhodey gestured to the hologram “whether you asked him to or not. But you kind of brought him into the big leagues, Tones. He could have gotten seriously hurt!”</p>\n<p> “Let’s talk about safety and why I approached the Spiderman, because let’s be honest, I think Peter’s great, but I was reaching out to the hero. First, I would have provided Spiderman with a suit regardless because he clearly needs it. If he is doing this, which he is, then I’m going to do all that I can to help him. Taking away the suit with the Vulture fiasco was enough to convince me that pulling the suit isn’t enough to make a difference for that kid. He will do what needs doing anyways.”</p>\n<p> Rhodey nodded and gestured for Tony to go on. He’d known Peter long enough to know that his powers made him more than a typical teen, and he wasn’t going to stop being Spiderman just because some adults said he wasn’t old enough.</p>\n<p> “Now for the issue of the Avengers. Do you know why I sought out Spiderman in particular? Not Peter, but Spiderman?”</p>\n<p> “No. But do tell.”</p>\n<p> “Since Spiderman has come on the scene, he’s captured upwards of 500 criminals Rhodey—all of those captures were non-lethal. Spiderman may be a new hero, but his methods have already earned him a reputation. I went looking for Peter precisely because of what I was expecting in Berlin. I asked Ross to let me bring Steve in because I didn’t want something like this,” and Tony gestured to the braces “to happen to my friends and family. Steve and his crew were willing to go through us, but I wanted non-lethal captures so that I could work this out in the system. I didn’t know that Steve would go that far. Nat pulled punches. Hell, you and I pulled punches. I only fired at projectiles like Clint’s arrows, not my teammates.”</p>\n<p> “Unlike Steve’s gang who thought dropping cars on our heads was totally fine. I get that. You didn’t expect that Steve would escalate it to the level he did.”</p>\n<p> “And you might have heard me tell Spiderman to hang back and just web them up. No, he didn’t listen. I can’t believe he fought the Winter Soldier and the Falcon hand-to-hand,” Tony muttered.</p>\n<p> “You’re really pushing this whole Spiderman thing,” Rhodey smirked.</p>\n<p> “Look Rhodey. You can joke, but I’m a little offended that my closest friends keep jumping on me for this like I’m some kind of child endangering monster. Happy and Pepper both didn’t agree with my choice, but Peter exists in a gray area because of his special circumstances. The reason I let Peter know that I knew who he was is because I was approaching Spiderman about that job and not some random teenager. First, I had to establish who I was talking to though. He lives in a different world. It’s not fair and it’s not ideal, but it is reality. Steve’s problem has always been that he will put a positive spin on things to the point of delusion. I’m not willing to do that.”</p>\n<p> “Fair enough, but Spiderman just ate your last piece of pizza,” Rhodey smirked, pointing to the security screen where Peter was sneaking into the kitchen and grabbing Tony’s leftovers.</p>\n<p>“You want to add her to the initiative? The girl who set the Hulk loose on Johannesburg,” Tony asked, completely gob-smacked.</p>\n<p> “She helped us beat Ultron. Without her, we would have lost. She’s a hero, Tony,” Steve said with a serious expression—so, it wasn’t a joke then.</p>\n<p> “OK. Let’s review first. She helped us beat Ultron, but only after she first tried to hinder that by stopping the work Bruce and I were doing with Jarvis’s code to create Vision as a countermeasure.”</p>\n<p> “You’d already created one murder bot, Stark,” Clint interrupted.</p>\n<p> “Na, let’s be honest here. Steve and Thor both gave me permission to study the scepter with the mind stone in it, and it activated through an AI that was being programmed in a separate part of my system, overwhelmed that, and came online as a result of the Infinity Stone—you know, the alien Infinity Stone that gave the Hydra Volunteer superhuman powers to actively work as a terrorist. Since none of my AI’s have ever acted out—and let’s count them, I’ve got five already up and online, I’m not taking the blame for this Hawkeye.”</p>\n<p> “Fine, but you killed her parents,” Steve hissed.</p>\n<p> “No, a missile dropped on her home where she was living in an active war zone—either her parents were unwilling to leave because they felt the danger wasn’t real, endangering their children, or the two parties actively engaged in conflict in a civilian area killed her parents,” Tony said, rolling his eyes. “I’m not taking the blame just because she misdirected her anger to the point of a psychotic break, Steve.”</p>\n<p> “That doesn’t discount the fact that you were given a second chance, and this is hers,” Nat of the Red Ledger added helpfully.</p>\n<p> “Um, no. I actively worked to rectify my mistakes and had actually not done anything illegal. She can do the time that her crimes warrant, and then work to be a hero AFTER she’s shown a little remorse for her actions. Helping us defeat Ultron was arguably completely self-serving.”</p>\n<p> “Tony,” Nat began, but Tony stopped her before she could pick up steam.</p>\n<p> “No. I’m not voting for her acceptance to the Avengers Initiative. She attacked each of us with extreme prejudice and a healthy dose of enjoyment—we have footage Steve, shut-up. She set Bruce, who already feels guilty for any damage he causes as the Hulk, on a civilian population where he could do maximum damage because she wanted to! She stood by while two of Cho’s co-workers were murdered in front of her. Clint had to talk her into helping before she was actually willing to get out there and help, and it’s likely that it was more revenge for her brother than any desire to make up for her mistakes. We’ve seen no evidence of this emotional turn around that Steve assures us is real. And Nat, you and Clint both know that you aren’t an agent for anyone without training. How did she train those powers while working for Hydra after she volunteered? We’d be covering up more than just her crimes during this incident if we help her. I’m not doing it. Can you pull this off without my connections and tech—because I’m not funding or facilitating this nightmare in any way.”</p>\n<p> “Tony, come on. This is the right thing!”</p>\n<p> “Steve, I just listed a number of reasons why this is absolutely NOT the right thing to do. Furthermore, she still visibly hates me. And you want me to house her in my property, take complete financial care of her, and magically make all of her hard-earned consequences go away so she can become an Avenger with all of the perks that position entails. Absolutely not, Rogers!”</p>\n<p> Tony got up and walked away from the table while the others sat looking chagrined.</p>\n<p> “I don’t understand this. He should be completely cowed after the Ultron debacle. He shouldn’t have the emotional strength to stand up to us this way,” Nat said while Steve squinted at her and Sam gaped a little.</p>\n<p> “That’s not cool, Nat!”</p>\n<p> “Sam, you’re a PTSD counselor. You were totally fine with inviting Maximoff in despite the trauma she caused all of us and her active hate of Tony. Are you judging me right now? Because you are either just as guilty, or too bad at your job for me to care,” she sniped.</p>\n<p> </p>\n<p>** Wanda Maximoff was given a life sentence for crimes against humanity for her time as a Hydra agent and collaborating with the alien AI Ultron.</p>\n<p>Sharon looked around the bar conspicuously, then leaned against the bar-top before sliding the file over to Steve.</p>\n<p> “This is everything I could find,” she said, looking at Steve intensely. “And you better hurry, because there’s a kill on sight order,” she added seriously.</p>\n<p> “Thanks, Sharon,” Steve said taking the file and squeezing her hand.</p>\n<p> “OK this is disgusting.”</p>\n<p> Steve and Sharon both jerked around, Sam turning quickly as well. Nat stood with her arms crossed over her chest, frowning at Steve.</p>\n<p> “Nat! What are you doing here,” Steve asked, surprised. They had been on the phone only 30 minutes before.</p>\n<p> “First, I tracked your phone, because I could tell you were going to completely ignore me when I said to stay out of this because you are compromised. Then, I told Tony and he piloted me over here in a suit by remote—again, because I knew that you were going to do something stupid. For the record, this” she said, gesturing to Agent 13, who looked offended, “is doing something stupid.”</p>\n<p> “Nat,” Sam started.</p>\n<p> “No, let me explain things. I’m a spy, Sam. I know how this works. She doesn’t have access to the information that me and Tony do. She had minimal access to files that Ross has his hands all over because she works for the U.S. government . . . who have NO JURISDICTION HERE! Isn’t that right, Agent 13?”</p>\n<p> Nat glared at Sharon who fidgeted as she looked between Nat and Steve.</p>\n<p> “This is what I could find,\" Sharon hedged defensively.</p>\n<p> “Let’s be frank here. You were a fourth rate spy that got into SHIELD based on your relationship to a previous head. They stuck you on babysitting duty because we didn’t need you anywhere else. We didn’t need you anywhere else because you aren’t any good, Agent 13. </p>\n<p> Those files say exactly what someone wants them to say to nudge Captain America into going off on a rampage in search of his friend. Any spy worth their salt would get that in 10 seconds flat. But you didn’t because you are just a sad little girl who’s in love with a man who only sees Peggy Carter when he looks at you. Scoping out Captain America at Peggy Carter’s funeral before she’s even in the ground—yes, I saw every look and signal you were throwing him, Agent—that’s just sick.”</p>\n<p> “Nat,” Steve said with a guilty look at Sharon.</p>\n<p> “Do you want to tell her now why you like her, Steve? Because you’ve shown no interest until she was suddenly able to swap stories about your long, lost love. I’m not going to let you destroy the Avengers because you’re projecting your past on a lovesick, sorry excuse for an agent,” Nat hissed.</p>\n<p> Steve looked at Sam, who looked away before saying “It is kind of disturbing, Steve. You haven’t shown interest in anyone else. Have you asked yourself, why her,” Sam asked uneasily.</p>\n<p> “It’s nice of you to grow a brain and spine, Wilson,” Nat said.</p>\n<p> “Hey!”</p>\n<p> “Steve is compromised. You’re only compromised by an inability to tell Captain America that what he is doing is wrong. Don’t sign the Accords until we work something else out. Fine, but don’t pretend that following after Captain America while he chases down one of the most formidable assassins on foreign soil during a manhunt for said assassin is a good idea. You know that his judgment is skewed when it comes to the Winter Soldier, counselor. You know that he refused to fight him when the lives of thousands of people were on the line—and don’t interrupt, Steve. I know he was brainwashed, but when you told us that you weren’t willing to take him down because he was your best pal from back in the day at the expense of EVERYONE ELSE, that’s just wrong. I follow you because I want to wipe the red from my ledger, not bathe in the blood of the innocents that fall by the wayside as you protect Bucky Barnes. Yes, it hurts, but you can’t sacrifice everyone else just for him.”</p>\n<p> “Nat, I can’t,” Steve moaned.</p>\n<p> “I know. And that’s why you are going to stay out of it and let Tony handle it.”</p>\n<p> “No!”</p>\n<p> Nat squinted at Steve.</p>\n<p> “That’s what this is about?”</p>\n<p> “We can’t trust Tony on this!”</p>\n<p> “Of course we can . . . because you didn’t tell him, did you, Steve? Uh huh. That seals it. You are officially staying out of this. Tony is already working on a deal for Barnes, and he will continue to do so because he doesn’t know that he should be angry or resentful.”</p>\n<p> “Bucky didn’t do it!” Sam and Sharon looked on in confusion as Steve bowed up angrily at Nat.</p>\n<p> Nat stepped into Steve’s space and poked him in the chest.</p>\n<p> “Don’t lie, Steve. Especially not to yourself. Bucky Barnes did kill Howard and Maria Stark, and you and I both know it. For that matter, we both know that Peggy Carter covered it up and watched her Godson spiral into drinking, drugs, and a dozen other unhealthy coping mechanisms rather than give up the money that was steadily being siphoned into SHIELD. I know the history, Steve. And Bucky does too. You aren’t doing him any favors by pretending because he will still feel that guilt—the man that was Bucky Barnes is gone for good if he doesn’t. Take your pick.</p>\n<p> For now, I’m going to meet up with Tony and help him deal with Barnes and his capture and legal arrangements. After that, you are going to tell Tony the truth and hope that he doesn’t kick you out of the Avengers for fraud since we’ve been going on missions to find Bucky Barnes using his money and equipment. You have seriously blown it this time, Steve. Tony is incredibly forgiving, and has based his whole life around second chances. Wanda wouldn’t be living in the compound while he stepped back and retired after Ultron to make her more comfortable if that weren’t the case. Betrayal though, that he doesn’t forgive. So, you better hope you haven’t gone too far down that rabbithole, Steve Rogers.”</p>\n<p> Natasha turned and walked away, but only after snatching the file out of Steve’s hands.</p>\n<p>“You’ve got a hell of a nerve,” the image of Thunderbolt Ross, Secretary of State, said to the Rogue Avengers who stood in the doorway of the compound boardroom.</p>\n<p> “You could use some of that right now,” Natasha said smugly. Sam and the others just smirked.</p>\n<p> “You think just because the world is on fire you can come back and all is forgiven,” he asked.</p>\n<p> “I’m not asking for forgiveness, and I’m way passed asking for permission,” Cap said and Rhodey gritted his teeth.</p>\n<p> The hologram turned to face Rhodes again.</p>\n<p> “Arrest them,” he said.</p>\n<p> “All over it,” Rhodey said and swiped the image away.</p>\n<p> Cap smiled and stepped up sticking his hand out for a handshake.</p>\n<p> “Rhodes, it’s good to see you, man,” Sam said around the lump in his throat.</p>\n<p> Rhodey kept his arms crossed, and didn’t even bother looking at Wilson. Cap’s smile had dropped and Nat’s brow was furrowed.</p>\n<p> “Rhodes,” Cap started.</p>\n<p> “I don’t think so. I’m not going to arrest you, but you can go back to your Wakandan sugar daddy. I’ll only be speaking with him. I have no interest in working with any of you,” Rhodes said harshly.</p>\n<p> “Rhodes. Tony’s gone. We don’t have time for this,” Nat hissed, crossing her arms.</p>\n<p> “You opportunistic viper! You pulled this shit after you royally fucked up with SHIELDRA. You’re pathetic. Did you really think I was going to let any of you back in here after what you all did to Tony?”</p>\n<p> “Rhodes, this is neither the time nor the place for petty grievances. The world needs us,” Cap said sternly.</p>\n<p> “Save your self-righteous bullshit, Rogers. The world may have needed you before you turned your back on it to throw the world’s biggest hissy fit, but now the world needs geniuses like Tony Stark, Batman, Reed Richards, and Professor X of the X-Men. The world needs the king of Wakanda to step up and think about the rest of the planet for once in his privileged, prissy little life,” Rhodey sneered. “You all are cannon fodder, that’s it. So, am I arresting you? No, but if you think now that Tony isn’t here to stop you that you’re gonna slither back in here like the slimey snakes you always were. That I’m gonna let the foxes into the hen house like nothing ever happened, you gotta be kidding me. Go mooch off Wakanda. SI is closed.”</p>\n<p> Wanda stepped forward angrily.</p>\n<p> “They’ve already come after me and Viz once. They want the stone, Rhodes,” she said, angry to be lowering herself before Stark’s lapdog. But she would do it for Viz. She loved him.</p>\n<p> “Good. Maybe we can get Jarvis back then. Vision has turned out to be a gigantic disappointment to anybody but you, Scarlet Wench. I’m sure Suri would love to say she was the one that saved him—she’s so smart, let her do it. Then when he turns on her too it will be her problem. Jarvis would probably have some good ideas on what to do for these upcoming battles while Vision can’t seem to do anything but follow you around like a love-sick puppy. Friday, take out the trash,” Rhodes said and turned to walk away.</p>\n<p> “With pleasure, Colonel,” Friday lilted. The Rogues jerked and then turned to leave as mounted guns dropped from hidden points</p>\n<p>“Rhodey, I’m flying dead stick,” Tony shouted, and then he was falling faster than Rhodey could catch him.</p>\n<p> “NO,” Rhodey screamed taking off after Tony, but he knew it would be too late. No one ever saved Tony. He had a life time of doing it himself.</p>\n<p> Rhodey landed just after the concussive hit from Tony’s suit impacting. He was in a deep hole when Rhodey knelt beside him and pulled off the faceplate.</p>\n<p> “I’m so sorry, man,” Falcon muttered, his face pained as he watched from the side. Rhodey didn’t even blink. He lifted his arm and fired, knocking Falcon backwards. He was down for the count when the security detail arrived.</p>\n<p>**<br>\n“How is he,” Nat said, standing beside the window after Rhodey left Tony’s room.</p>\n<p> Rhodey didn’t hesitate. He kept walking until he was right on the Widow and then he swung as hard as he could, dropping the spy (who hadn’t been expecting a reaction like this from him) to the ground. She rolled for a minute, eyes bulging, completely surprised at the power behind the punch.</p>\n<p> Rhodey grabbed her by the elbow, yanked her up, and then cuffed her—hands and feet both—before dropping her back to the ground like trash. He knelt by her as she gaped at him, then he motioned to someone outside of her eyeline.</p>\n<p> “In case you have an ounce of feeling left in you, you pitiless snake, Tony’s paralyzed from the waist down. He’ll still be able to create, but he won’t be flying Iron Man. You just robbed the Earth of her best defender for a glorified WWF wrestler. Great job.\"</p>\n<p> “I can’t believe you! We clearly played this wrong,” she hissed, trying to get to her feet, but Rhodey pulled out one of Tony’s personal protection devices and shocked widow until she fell back once more.</p>\n<p> “Wrong. Steve was going to go through you because he doesn’t care about you any more than anyone else when it comes down to doing exactly what he wants. You didn’t like the idea of Black Widow being collateral damage, like those people who are calling for the Accords, so you double-crossed your team again. Well, this is the last time. Enjoy prison—and you won’t be enjoying Tony’s considerable funds and lawyers this time. I hope the UN cares enough about you to get you more than some backwoods schmuck as counsel, Romanoff.”</p>\n<p> Rhodes motioned to the security detail that was standing by and they began to take her away. He stood and began walking out of the hospital when Vision approached. </p>\n<p> “You hit her,” he asked, surprised. </p>\n<p> “Yeah well, she’s no lady. She’s not even a soldier. Widow has been less than human for some time. That’s what happens when you rationalize everything to the point of excusing all immorality. And your girlfriend isn’t any different, as she clearly demonstrated when she put you through the floor at the compound instead of handling things like anything other than a criminal. I hope you wake up to that soon, Vision,” Rhodes said sternly as he walked away.</p>\n<p>**<br>\nRhodes ignored the angry insults of Barton and whoever the giantman had been. He wasn’t even interested in them. Instead, he walked straight up to Wilson.</p>\n<p> “How’s Stark,” he said with a guilty grimace.</p>\n<p> “Paralyzed, but he’ll live. So, there is that. More important, he’s no longer active duty, which means that he’s not going to be cleaning up any of your messes anymore,” Rhodes said. “So, this is how this going to go. You’re going to tell me where Rogers and Barnes snuck off to. The last thing Friday sent Tony was a verification that Barnes was innocent of the UN bombing—so now he’ll only be tried alongside you and Cap for the Bucharest nightmare. This is your one chance to make that happen. Ready—go.”</p>\n<p> “We had no choice,” Wilson started.</p>\n<p> “Bull shit! There’s always a choice. You three were soldiers, and you and Cap are Avengers. That means you make the sacrifice for civilians EVERYTIME!”</p>\n<p> “Look, Rhodes. There are five more winter soldiers. Cap had to go,” Wilson tried.</p>\n<p> “And he thought bringing the other brainwashed assassin for his only back-up was the way to go? I hope you can see why the Accords are necessary. If Cap’s hands are the safest, we’re clearly up shit creek and might as well roll over for the apocalypse,” Rhodes said with an eye roll. “I’m done with this shit. You are going to tell me where they went—NOW.”</p>\n<p> “Not without a guarantee,” Wilson said, looking to the side shiftily.</p>\n<p> “You think you have bargaining room here? You guys have consistently fucked us over. No, you tell me now or I tell Ross where they are anyway and let him go in with the kill squad that Tony was so desperately trying to prevent. You see, Tony’s a civilian, and he goes bleeding heart way too often. I’m a soldier, though, Wilson. Cap and Barnes both should have been court marshalled by now for what they’ve done.”</p>\n<p> Wilson looked at him, wide eyed.</p>\n<p> “You can’t be serious?”</p>\n<p> “You have to the count of three. 3-2-1 . . . OK. Fri, home in on Cap’s shield. I want to know where they are.” It took about two minutes. </p>\n<p> “Siberia, Colonel. Would you like to coordinates?”</p>\n<p> Rhodes looked straight at Wilson.</p>\n<p> “No, just send it directly to Ross,” and Rhodey walked away.</p>\n<p>“The team came to a few decisions,” Steve said, looking around the group before looking back at Tony. “And we’ve decided that after the Ultron affair, we would feel better if you stepped back from the roster.” He gave Tony the puppy dog eyes before Nat spoke up.</p>\n<p> “It seemed like the best option, especially considering you were only ever a consultant,” she said with a sympathetic face that Tony was sure she had practiced in front of a mirror to master.</p>\n<p> “You do know that I’ve been paying for everything since you guys destroyed SHIELD, right,” Tony asked, but they all just stared at him blankly. “I see. What did Bruce say,” Tony asked, trying another method.</p>\n<p> “Well, obviously, Bruce wasn’t involved since he left and all,” Clint said, rolling his eyes.</p>\n<p> “Aren’t you retiring,” Tony asked suddenly, facing Clint.</p>\n<p> “I did decide to retire,” he agreed.</p>\n<p> “And Bruce is gone. Thor left. So, really—you can Cap decided,” Tony asked facing Nat and Rogers.</p>\n<p> “Well, and Sam and Wanda too.”</p>\n<p> “Who’s Wanda,” Tony asked, with a confused look on his face.</p>\n<p> “You know, the girl with the red magic?”</p>\n<p> “Ultron’s accomplice!”</p>\n<p> “She switched sides to help us.”</p>\n<p> “Nat, I think we need someone with a better since of loyalty and morality making these types of decisions,” Tony sighed. “You see, it’s kind of frowned upon to switch sides seven times before dinner,” he said with a serious face.</p>\n<p> “Very funny.”</p>\n<p> “Oh, no. I was being serious. I thought you might not understand---all things considered.”</p>\n<p> “Tony,” Steve sighed.</p>\n<p> “And why is Sam on the team again? Wasn’t he helping you with a personal thing?”</p>\n<p> “Well, now he can work with me on that and work as an Avenger the rest of the time. It’s for the best really.”</p>\n<p> “So, I’ll pay him to mostly run around with you on some side adventure? And he’ll only really work like once a year when aliens attack? Do you know how much I’ve been paying you people?”</p>\n<p> “Not really,” Steve shrugged. “I don’t need a paycheck because I just order everything I want with your credit cards.”</p>\n<p> “?!?”</p>\n<p> “What,” Steve asked, perplexed.</p>\n<p> “And I’ll pay the red girl to . . . what? Hate me?”</p>\n<p> Steve and Nat stared at him like this wasn’t in any way out of the ordinary.</p>\n<p> Tony pushed a few buttons on his phone.</p>\n<p> “Mr. President? Yes, this is Tony Stark. Can you do that thing we talked about? Yes—that one. Hold on a moment.”</p>\n<p> Tony tossed his phone to the center of the table and a blue hologram popped up out of it. The Avengers were suddenly all faced with the holographic image of Donald Trump. Steve shivered a little at the horror. </p>\n<p> “Mr. President,” Nat said obsequiously, leaning down so that her cleavage showed (It was a reflex response by this time).</p>\n<p> “Avengers—YOUR FIRED!”</p>\n<p>The Hydra goon smiled with clear insanity as King T’Challa and his Dora Milage alongside the Rogue Avengers stood in shock in the center of the palace.</p>\n<p> “How did you get in here,” Suri said in angry denial, surprised that anyone would or even could get passed her security.</p>\n<p> “Surprised, Princess? Thought you were the smartest person on Earth,” he said with a mock pout.</p>\n<p> “I am,” she said haughtily.</p>\n<p> “Yes, but Dr. Stark has created multiple AI’s, each with a far superior cognitive capability. They even have creativity—and anger,” he said with a sinister grin. </p>\n<p> “Tony wouldn’t,” Steve argued.</p>\n<p> “Oh, you are completely right, Captain. Dr. Stark would not . . . but you gifted us with a completely vulnerable Tony Stark back in Siberia. He had no hope of withstanding us in the state you left him in.” The Rogues looked at Steve in confusion as he glanced guiltily around the room. “You also left several angry AI without the barrier of their very human conscience. You see, it was Tony Stark that was keeping them in check with patient instruction and love,” he sneered. “But now, Toney Stark is a mindless soldier—a Winter Soldier with all of the benefits of a Mechanic,” he laughed.</p>\n<p> “Steve, what have you done,” Nat said, looking suddenly nervous.</p>\n<p> “Bucky was innocent!”</p>\n<p> “And so is Dr. Stark. We’ll have to remember to tell him that if he ever wakes up from what he’s about to do. Mechanic.” The others watched as Tony stepped from behind the Hydra goon. He was so much smaller and non-threatening that they had completely overlooked him. Clint smirked. It would be his last. “Kill them all.”</p>\n<p> Tony quickly tapped the arc reactor on his chest and was engulfed in a suit that was far more complex than any he had ever made. Steve and Nat both gaped, and Clint was beginning to show a little fear. Tony stepped forward just as the Hyrda goon stepped out of the room.</p>\n<p> “Friday, the men and women who betrayed Tony Stark are all in that room,” he smiled.</p>\n<p> He walked away just as the screaming began.</p>\n<p>**<br> Tony was shocked awake by a massive jolt of electricity. He looked around at the carnage surrounding him. Bodies were tossed about the room everywhere—some in literal pieces (he could identify the work of his lasers, but he had never used them on an actual human before!) and some still smoking with gaping holes from where a repulsor or the unibeam had been used at full capacity.</p>\n<p> “Friday!” Tony wheezed. He could feel the beginnings of a panic attack. He recognized Cap’s de-cap-itated head (that was probably in poor taste!) and Widow was cut clean in half. Funnily enough, there wasn’t that much blood since the lasers cauterized the wounds. Clint’s horror-stricken face implied he hadn’t really appreciated that fact though. “Friday, what happened.”</p>\n<p> “It’s fine now, Boss. I was able to track you to Hydra two months after the incident at Siberia. They were programming you just like they did Barnes. We can use the BARF to de-program you now that we’ve got you away.”</p>\n<p> “Hydra?”</p>\n<p>**<br> “You just left him?”</p>\n<p> “You really think we could have contained Tony Stark? No, that was never going to happen. Hydra learns from the mistakes of others like Stane, the Ten Rings, and AIM. No, the goal was simply to aim the weapon at the Avengers and Wakanda long enough to even the odds a bit. And Stark will need recovery time after a trauma of this nature,” he smirked.</p>\n<p>“Your gear has been confiscated. On what planet is this ‘not making things worse’,” Nat asked sarcastically as they strode forward until they reached Tony, overlooking the lower level of the security complex and talking on his phone.</p>\n<p> Sam and Steve both stood at parade rest with their arms crossed, square jaws tense with self-righteousness. Steve looked at Tony like he was dirt as Tony said “Yes, of course, there will be consequences. Can you quote me on that? I said it, didn’t I?” </p>\n<p> Tony tapped a button and slid his phone into his pocket.</p>\n<p> “Consequences,” Steve asked, with a raised brow.</p>\n<p> “I had to give them something.”</p>\n<p> “That’s cold,” Sam said like it was a joke, as Tony was walking away, leaving them in the room at the end of the hall.</p>\n<p> Tony stopped, frozen. He turned slowly and faced both Steve and Sam with an incredulous look.</p>\n<p> “Are you joking right now? What. The. Fuck?” Tony stalked back to where Steve and Sam still stood, though Sam was starting to look a little unnerved. “Do you need me to explain things to you right now about what’s happening in the real world? Let me clear things up a bit, SGT. Wilson.”</p>\n<p> Sam took a step back with wide eyes.</p>\n<p> “Tony,” Steve said, unnerved, but stepping in between Tony and Sam.</p>\n<p> “Shut up, Captain Delusional and let me explain the reality of your situation right now. Not mine—yours! Since I know that you won’t even acknowledge that I’ve been working to keep you idiots out of prison for WEEKS NOW!</p>\n<p> “Two weeks ago, you took an unauthorized, highly trained security force into another country, Nigeria, where America’s international relations are historically not the best. One of those agents was a former Nazi terrorist,” Tony added looking intensely at Sam, who should be beginning to get the significance.</p>\n<p> “Wanda is not a Nazi,” Steve said angrily.</p>\n<p> “Captain. She was. All past issues are marked on her extremely vulnerable work VISA. The government knows all about her time at Hydra, and it was only by the skin of my teeth that she’s not already being held for a life sentence in a high security prison. And now she's killed 11 Nigerians and 15 Wakandans working on peace keeping missions.\nLucky for you and Maximoff, SI, you know, that dirty money that she so despises even while she’s using my credit cards to order off Amazon, is ALWAYS in demand all over the world. In other words, I have connections. But we’re talking about you right now.</p>\n<p> “You just entered Romania on a private mission of your own choosing, dragging the SGT here with you, and injured and killed several members of what is the equivalent of the Romanian FBI who were trying to bring in a terrorist accused of bombing the UN.”</p>\n<p> “Bucky didn’t do it!”</p>\n<p> “Shut up, Captain! I said accused! Then, you went on a high-speed chase through one of the busiest traffic centers in Romania and injured and killed several Romanian citizens JUST GOING ABOUT THEIR DAY! There are only two options for labeling that behavior in international terms, CAPTAIN AMERICA. You are either a) a traitor to your country and a terrorist or b) you just took part in a deliberate act of war.”</p>\n<p> Sam and Steve both gaped for a moment, and Sam began to feel very uneasy.</p>\n<p> “Do you know what this means for both of you? The U.S. military absolutely must dishonorably discharge you both, or concede that America was declaring war against Nigeria and and Romania, which are both member states of the UN and will result in even further sanctions from more countries. You see, two weeks ago, I could convince everyone that you were both just idiots,” he sneered. “Now, it’s gone too far.”</p>\n<p> “They can’t,” Steve said feebly.</p>\n<p> “Steve, it’s not a question of can, but when. The President is not going to take a fall even if he’s a fanboy. We’re talking about the international relations between several countries at the moment. I will keep you out of jail if I can, but your time enjoying a military title—propaganda or otherwise—is over. Your time as an Avenger—also over. And Sam, the President isn’t a Falcon fanboy. So, is that cold, Sam? Yes, but it’s warmer than jail.”</p>\n<p> Tony walked off while Sam and Steve stared after him.</p>\n<p>“Did you know,” Tony hissed, his eyes a picture of tortured misery.</p>\n<p> “I didn’t know it was him,” Steve said his eyes shifting guiltily away.</p>\n<p> “Don’t bullshit me, Rogers! Did you know?”</p>\n<p> Steve stared at Tony, and set his jaw.</p>\n<p> “Yes,” he whispered.</p>\n<p> Tony dropped his head for a moment and then abruptly turned and bitch slapped Steve, causing him to slide across the floor.</p>\n<p> Immediately, Barnes raised his gun, but Tony simply stayed facing Steve, his face-plate up.</p>\n<p> “Are you going to shoot me and kill the last remaining Stark, SGT Barnes,” Tony said softly, and James jerked, lowering his gun a bit.</p>\n<p> “You attacked him,” Barnes croaked, but it was more of a question.</p>\n<p> “I’m going to turn around now and face you,” Tony said softly, recognizing how tense the situation was, but the hit against Steve was really what he wanted. Barnes had killed his parents, he now knew, but Steve had betrayed him. And it had done a lot to let out some of the aggression he was feeling.</p>\n<p> “You shouldn’t have attacked him,” Barnes repeated, unsurely.</p>\n<p> “Was that an attack, or did I just deck the man that lied to me and used me for years because he’s an utter, lying piece of shit,” Tony asked, cocking his head in a curious manner.</p>\n<p> “That’s Stevie,” Barnes said, shifting uneasily.</p>\n<p> “Is it? Do you remember much about Stevie? Would Stevie have hid the murder of a friend’s parents, his mother, so that he could use his money and things to search for the killer all while living, laughing, and working with that friend? Was he that kind of hypocrite?”</p>\n<p> “No?”</p>\n<p> “Are you the type of man that would defend that,” Tony asked mercilessly.</p>\n<p> “No! That’s wrong,” he said, shaking his head, but then he stopped. “But he helped me, saved me, ‘til the end of the line?’”</p>\n<p> “Good for you. But where is that line now? Will you do anything for Stevie no matter if James Barnes KNOWS that it’s wrong. Will you burn down the world so that Stevie can get whatever he wants? Is Stevie the kind of monster that would let you do that for him?”</p>\n<p> Barnes looked at Stevie, who was sitting up now, clutching his jaw, but watching their conversation with a torn expression.</p>\n<p> “Stevie—he wouldn’t want that, I think?”</p>\n<p> “So, is that Stevie. Or is it Captain America,” Tony asked, relentlessly logical now that he was able to put the video aside for a moment.</p>\n<p> “No,” Barnes whispered. “No, he’s not,” he said more loudly.</p>\n<p> “No, Bucky. It’s me, Stevie. Don’t let him trick you,” Steve shouted desperately.</p>\n<p> “You haven’t been that little guy from Brooklyn for a long time, Steve. I think it’s time you admit it,” Tony said savagely.</p>\n<p> “I am Steve Rogers!”</p>\n<p> Barnes looked at Steve, then he looked at Stark. He looked back at Steve and lowered his rifle, finally.</p>\n<p> “Yes,” he nodded. “But you’re not Stevie. He would never have done something like this,” he said shaking his head. He turned to Tony. “I’ll go with you, but I didn’t bomb the UN. I’d like to get help now, I think. I’m confused. I’ve been confused,” he said brokenly.</p>\n<p> “And you’ll get help now. I’ll see to it,” Tony nodded.</p>\n<p>“Tony,” Steve said urgently, forcefully grabbing Tony as he stepped towards Barnes who stood with his gun lowered and a resigned look on his face. “Tony, it wasn’t him!”</p>\n<p> Tony stopped as if he’d run into a brick wall and turned slowly back to Steve, shrugging his arm off.</p>\n<p> “Did you know,” he said softly, staring at Steve intensely.</p>\n<p> “I didn’t know it was him,” Steve said hastily glancing away.</p>\n<p> “OK, stop. I am so confused right now. You’re saying that you didn’t know it was him.”</p>\n<p> “That’s right,” Steve said, eagerly jumping on Tony’s mercurial shift.</p>\n<p> “So, you’re admitting that it WAS him?”</p>\n<p> “Um . . . no. No, it wasn’t him. That’s what I meant to say,” Steve finished, nodding his head as if he was now certain of his answer.</p>\n<p> Bucky was watching the back and forth like it was a tennis match.</p>\n<p> “So, it wasn’t him, and I can’t blame him for what he did?”</p>\n<p> “That’s right,” Steve said with a sympathetic smile.</p>\n<p> “OH, THANK GOD!” Tony heaved a great breath and doubled over for a minute as if he had just shrugged off a great burden.</p>\n<p> “What?” Steve and Bucky both looked confused now.</p>\n<p> “Can you get back on your own? I’ve got to go. I’ve got to evict Maximoff’s stuff from the Compound,” he said with a boyish grin that was more joyous than Steve had seen in years!</p>\n<p> “What! No! You can’t do that? What?” Steve reached out and grabbed Tony who was already walking away.</p>\n<p> “Well, you guys said that I had to put her up because I killed her parents. But if I can’t hold Barnes over there responsible for killing Howard and my Mom, then Maximoff can’t hold me responsible for the death of her parents! I was even further removed from that mess than Barnes after all.”</p>\n<p> “Wait, Tony. No. You have to step up and take responsibility,” Steve said with a serious frown.</p>\n<p> “So, I should bring Barnes in for trial?”</p>\n<p> Bucky and Tony both looked at Steve as if he would have the correct answer for this.</p>\n<p> “Um . . . no. Definitely no.”</p>\n<p> “Oh good. Then I’ve really got to go take care of this Maximoff thing. She’s been annoying the hell out me for years now,” he said with a roll of his eyes. “You guys will be all right, right? I think you might better go with T’Challa over here,” Tony said, pulling a confused King over to their side.</p>\n<p> “What,” T’Challa asked.</p>\n<p> “Oh, well, Bucky didn’t do it—so, clearly you owe it him to protect him from any and all consequences of any choices that he’s ever made . . . ever . . . and Captain America and the other Rogue Avengers by extension, of course. It’s the least you can do. It’s what I did for Maximoff after all,” Tony said seriously.</p>\n<p> Now everyone looked confused, but they were staring at T’Challa instead of Tony. T’Challa looked shell shocked that he had somehow acquired a group of international fugitives well known for causing all sorts of collateral damage (honestly, they couldn’t even go out for pizza without causing some sort of property damage!). Zemo, who was now cuffed, watched the whole exchange curiously. Bucky just stared--his brain was already pretty much fried without this disaster, and this wasn't helping! And then there was Steve, who knew that Bucky was innocent and Wanda was a good girl—but Tony wasn’t blaming Bucky for his parents’ murder (and that’s what he wanted, right?).</p>\n<p> “I’m just gonna . . .” Tony gestured to the door of the bunker and edged that way, “So, yah. I’ll see you guys later.” And Tony strode quickly outside, leaving everyone gaping behind him.</p>\n<p> The others stared at each other until the echoes of loud, cackling laughter faded away.<br>\n**<br>\n“That was awesome!”</p>\n<p> Rhodey and Peter laughed as they watched Friday’s video of the fast one Tony pulled on Steve and the King of Wakanda, sat comfortably in their Rogue-free compound.</p>\n<p>Steve, Clint, Sam, and Nat (who had wandered in with a chagrined look on her face about a week after Steve had arrived) were all sitting on the small, lumpy couch around the boxy, black and white tv. Sam stood, hit the tv twice, shifted the old timey antenna and then sat back down.</p>\n<p> Wanda was sitting in the corner, wearing a pink, childish dress with lace, frills, and bows that wouldn’t look out of place on a 6-year-old. When Steve had gone to T’Challa and said that Wanda (it was always Wanda after all) needed a few things to be more comfortable, he hadn’t quite received the response he had expected.</p>\n<p>*Flashback*</p>\n<p> “I would be pleased to offer her money for clothes and other wares, Captain. The cooks always need help cleaning the kitchens after meals. She can begin tomorrow.\"</p>\n<p> “I don’t think you understand, T’Challa. You see, she’s just a kid.”</p>\n<p> T’Challa stared at Steve significantly, but he just smiled back.</p>\n<p> “I see,” T’Challa said finally. “I will arrange something.” And Steve was ushered out of the room.</p>\n<p>*End Flashback*</p>\n<p> The next day a maid had arrived with a whole new wardrobe for Wanda. She quickly collected Wanda’s things and left before the smirking young woman had a chance to open the packages. What Wanda found was a collection of dresses and patent leather Mary Jane shoes appropriate for very young girls, but clearly sized to fit the Sokovian (she certainly didn’t have the hips of a kid anymore!). </p>\n<p> She argued that it was a clear insult.</p>\n<p> “I think you look lovely, Wanda,” Steve smiled, loving the new look that she was sporting. Much better than all that leather and scarlet woman nonsense.</p>\n<p> “Fix it, Steve,” she shouted, stamping her foot. Steve had simply frowned and put her in the corner for time-out. Everything was perfect—besides the less than stellar accommodations. </p>\n<p> Steve had been surprised by the amenities they had received once the angry looking guard, Okoye, showed them where they would be staying. The furniture was worn, the space was too small, and surprisingly, the technology was more retro than advanced.</p>\n<p>*Flashback*</p>\n<p> “I put them in them in the Colonial Wing of the Museum on the 2nd floor of the palace,” Okoye snickered, and the other Dora leaned against their spears and howled in laughter.</p>\n<p>*End Flashback*</p>\n<p> “So, do you think Tony’s about finished getting rid of the Accords and getting our pardons then,” Clint asked, cringing as he bit into the goat brains the Wakandan chef reassured him was a sacred delicacy reserved only for royalty and the finest of warriors. He could have sworn she was laughing as she walked away with what looked like a Subway sandwich.</p>\n<p> “It should be soon, Steve shrugged, though he eyed Wanda in the corner. He hadn’t worked out how he was going to explain that Tony had evicted the young girl from her rooms in the Compound. He was sure that he could talk Tony around, but really, he had to focus on Bucky first now that he was back.<br>\nHe was constantly visiting someone named Shuri for a recurring headache that he had acquired almost immediately after Steve started talking about the good ole days. Once he explained how Tony was getting things ready for their return, both Bucky and Nat had complained about a migraine and rushed out to see the Wakandan scientist. Steve eyed his goat brains with a skeptical look and wondered if it might be food poisoning.</p>\n<p> “So, he really wasn’t mad,” Sam asked. “Because psychologically, that’s pretty unusual,” Sam said. He was sure he read that when he was getting his online degree in counselling.</p>\n<p> “Now, Sam,” Steve said sternly, “I know that Tony has trouble understanding things, but he knows that he needs us. We’re a family after all.”</p>\n<p> Wanda started to curse loudly in the corner, but Steve just squirted her with a squirt bottle until she stopped with a final hiss.</p>\n<p> “You’re right. He really owes you guys for giving him unlimited money and supplies without even thanking him,” Scott said with a disgusted eye-roll. </p>\n<p> “I know, right?” Clint gave Scott another friendly punch that made him hate the archer even more. Honestly, he had thought he was the lamest one of the group—I mean, come on, Ant man; but Hawk Eye was on a team with War Machine and Iron Man and he was shooting with bows and arrows!</p>\n<p> Scott had regretted answering Sam and Captain America’s call almost immediately after Rogers had explained to the Rogues what had happened in Siberia—while T’Challa stood next to him gaping like he was a particularly stupid zoo animal and his BEST FRIEND came down with a coughing fit littered with what sounded suspiciously like “cough-BULL SHIT-cough . . . cough-DUMB ASS- cough.” It had taken him less than two hours after the Rogues began talking ENDLESSLY about Stark to realize they were all idiot moochers.</p>\n<p>**<br>\nRhodey and Peter were still watching the live feed from Wakanda and eating popcorn, laughing every now and again at the absolutely delusional things the group said. It was like a super hero version of reality tv’s Big Brother with Tony as the grand prize.</p>\n<p> “I understand. It must be very hard for you. Yes, I’m so sorry. I’m doing all that I can,” Tony said sympathetically before mouthing at Rhodey ‘T’Challa!’---the others fell off their seats laughing.</p>\n<p>“What’s this,” Tony asks with a quirky smile as he reaches for a file on Fury’s desk.</p>\n<p>“I don’t think I want you seeing that,” Fury replies sternly. “This, however, is for you.”</p>\n<p>Tony looks over the file that Fury handed him before scoffing.</p>\n<p>“What is this supposed to mean exactly? Iron Man, yes, Tony Stark, not recommended?”</p>\n<p> “It means that after the personality profile the Black Widow performed on you, for now, we are really only interested in you in the capacity of a consultant.”</p>\n<p> Tony looks at Fury intensely before nodding and then shrugging.</p>\n<p> “OK.”</p>\n<p>**<br>\n“Stark, I need those designs,” Fury barked angrily over the phone.</p>\n<p> “Sorry, Nicky. I’m busy with my designs for SI. I’m fully employed by Pepper—not just a consultant after all,” and Tony hung up the phone.</p>\n<p>**<br>\n“Stark, we need a place for the Avengers to stay and train. I was thinking of that property that Howard had in upstate New York,” Fury said, leadingly.</p>\n<p> “Oh, did you want to buy that? I hadn’t really intended to sell it, but Pepper would approve since a sale like that could mean some real profit on our end. Prime real estate there after all.”</p>\n<p> “Stark!”</p>\n<p> “What? Consultant’s get paid, they don’t pay the employer. Really, Nick. Sometimes I wonder about you,” Tony laughed, walking out of Fury’s office.</p>\n<p>**<br>\n“I had to drop everything on the Internet. That includes all of the information on SHIELD’s family contacts. I need you to get on fixing that right away,” Natasha said imperiously.</p>\n<p> “Why would I do that? I was only ever employed as a consultant by SHIELD. Nothing in there that I didn’t want them to see,” Tony said, not looking up from what he was doing.</p>\n<p> “Stark. Can’t you see past your ego for five minutes,” she hissed.</p>\n<p> “Well, according to your personality profile, you should already know the answer is no, Romanoff,” Tony said with a smirk, flipped down his welding mask, and went back to work.</p>\n<p>**<br>\n</p>\n<p> \"Stark, we need access to the quinjet for a mission to infiltrate a Hydra base,\" Steve said.</p>\n<p> Tony squinted at the Captain as he looked away with a shifty glance.</p>\n<p> \"Yeah, well, you'll have to ask Pepper about that. The quinjet is hers in her position as CEO,\" Tony shrugged.</p>\n<p> \"What,\" Steve asked, surprised.</p>\n<p> \"I'm Iron Man,\" Tony said simply and rolled his eyes as Steve, Sam, and Nat stared blankly back at him. \"Why would I need a jet when I can just take the suit.\" </p>\n<p>**<br>\nRoss walked away and the group of heroes all looked at each other.</p>\n<p> “Where’s Stark, shouldn’t he be in on this,” Nat said. She looked around the dumpy conference room that only held a small table with barely enough seating for the Avengers and wondered again how Fury’s plan to real in Stark had failed so miserably. They should be living the high life right now, not living in an underground barracks in dorm rooms with no windows, a collared ex-hydra agent, and a Captain America with a repossessed vibranium shield (Cap had approached Pepper for the loan of a quinjet. She had said yes, but only with the shield as collateral on the loan. Naturally when he couldn’t pay, she had taken the shield). But Stark had taken her recommendation that he act as a consultant to heart. Fury never got a dime out of the billionaire, who insisted that consultants got paid, they didn’t pay for the privilege of having to do work.</p>\n<p>“He already signed the Accords as an independent signatory. So did I, in my capacity as War Machine for the U.S. military,” Rhodes shrugged.</p>\n<p>“We can’t let them do this,” Steve huffed. “Governments have agendas!”</p>\n<p>“And so does, SHIELD—didn’t you read their mission statement,” Vision asked, a little surprised by the Captain’s response.</p>\n<p>“Don’t even bother, Vision. It’ll never sink in,” Rhodes sighed with a shake of his head as he rose and left the table.</p>\n<p>“Mr. Stark, it’s good to see you once again.” The King of Wakanda smiled as Tony walked towards him, though it never reached his eyes and the several busty body guards closed ranks with dark looks as he approached.</p>\n<p> “T’challa, if you’ve a moment,” Tony said, gesturing to a nearby conference room. T’challa looked irritated, both at the familiar address and at having to spend any time meeting with Tony outside the council sessions the King sat on with him.</p>\n<p> “Indeed,” he said, and they entered, taking seats while the Doras hovered threateningly. “What can I do for you?”</p>\n<p> “I wanted to pass on a warning since Everett Ross clearly failed to do so.”</p>\n<p> “Everett is a dear friend of Wakanda,” one of the women huffed, crossing her arms.</p>\n<p> “I’m aware as you clearly deemed him worth the medical treatments that you didn’t bother sharing with Colonel Rhodes or myself. You see, we were your allies before Barnes, Rogers, and the Rogues,” Tony said casually, leaning back in his seat. “We’re aware of just how selective Wakanda is, how it hoards its wealth.”</p>\n<p> “I have no idea what you are talking about,” T’challa responded, leaning back in his chair as well, “but I find your description of my country offensive in the extreme, Mr. Stark.”</p>\n<p> “Oh . . . that’s cute. And it’s Dr. Stark. I’m sure you think you’re so far advanced that we have no idea that Rogers and his merry band of fugitives spend their down time in Wakanda, your Highness, but as smart as your sister is, it doesn’t even come near tempering the arrogance that you both display.”</p>\n<p> “You will address the King of Wakanda with respect,” one of T’Challa’s harem of body guards hissed angrily moving towards Tony.</p>\n<p> But Tony had his watch up and seven obvious targeting lights immediately centered on every Wakandan in the room.</p>\n<p> “People like to disregard me as childish and arrogant,” Tony said casually, calm and quiet while the Wakandans remained tense. “That’s not really the case, though. You see, I’ve been painted as a privileged little rich boy who never had to struggle or work for anything—sort of like you really are, T’challa,” Tony added.</p>\n<p> “Stark,” T’challa hissed.</p>\n<p> Tony simply raised his voice to talk over him, something he was sure angered the arrogant little princeling beyond reason.</p>\n<p> “That’s not the reality, though, little Prince. You see, my father never saw me as a child or his son. I was a legacy and, ironically, a threat to his position as the smartest person in the room. He didn’t like that. He made sure that my life was a living hell from the time I could walk and talk—and I’m a genius, T’challa. That was remarkably young. He was only willing to tolerate my existence when I could give him something. Sort of like your house guests. Have you noticed, yet? I find it ironic how easily you let Captain America—the biggest colonizer of them all—take over, well, everything,” Tony chuckled.</p>\n<p> “You can’t possibly,” the lead Dora began, but she stopped quickly and looked at the King nervously. Tony laughed again.</p>\n<p> “So, some of you did notice, and didn’t like it! Well, good on you. And believe me, I can possibly. I’ve had people inside Wakanda since you touched back down with Barnes and Rogers, little Prince. Where else were they going to disappear to?”</p>\n<p> T’Challa was practically shaking, but the red lights indicated that Tony still had them all in his sights. He wasn’t called the Merchant of Death for nothing. They didn’t dare risk it.</p>\n<p> “Who,” the king whispered. </p>\n<p> “Friday, my girl, introduce yourself,” Tony smirked, but he still never blinked and his arm was steady.</p>\n<p> “You just did that, Boss,” Friday sounded in her distinctive brogue.</p>\n<p> “Indeed, I did. So, T. this is how this is gonna go down. I’ve given you something that I consider far more precious than money, weapons, even your precious vibranium—that’s time, by the way. I gave you time as I watched you sit smugly on that Accords council making any and every decision that YOU DISCUSSED WITH CAPTAIN AMERICA AND THE WOMAN THAT ATTACKED YOU WITHOUT PROVOCATION in Leipzig. I gave you time as I watched you SPIT on the blood, sweat, and tears that your father poured into the Accords. I gave you time while those back stabbing freeloaders sat in luxury as I met with the people who died in Bucharest and gave funds for the damage that they caused in Germany. But, T’challa, you’re all out of time. I’m sick of watching you squander the success that you were gifted by the sheer luck of the metal that lies beneath your land while everyone else struggles and suffers around you, and you . . . you sit across from me and look down at me for being angry at Barnes in a moment for the EXACT same thing that you chased him around the world for revenge for. </p>\n<p> You see, T’Challa, Barnes didn’t kill your father, but he did kill my father AND my mother. And the man that I supported for years decided to hide it while taking every bit of money and tech that he could get out of me. I have every right to be angry, but do you know what really pisses me off, LITTLE PRINCE,” and Tony shouted the last, making them all start where they sat or stood. “What pisses me off is that you had a good father, T’challa. And you completely disregarded everything he stood for, everything he ever taught you, all for that blonde haired, blue eyed chauvinistic asshole just like EVERYONE ELSE. That, Little Prince, just shows how very naive and privileged you really are, because you couldn’t recognize Steve Rogers’s vaunted “little guy” if he bit you in your prissy, privileged little ass. So, of course, you drank the Kool-Aid just like everyone else. I watched Steve Rogers watch as the man, my father, who made him who he is, had his head bashed in and his wife choked out without even batting an eye. He just didn’t care. And I can’t help but compare you to him, T’challa. I don’t think either one of you has the capacity for empathy. And I find that I don’t want to shield you anymore.”</p>\n<p> And then Tony sat back and everyone took a breath, breaking the startling silence that accompanied Tony’s little monologue.</p>\n<p> “You go too far,” T’challa whispered, trembling in his anger, but surprisingly, the Dora weren’t really doing anything. They seemed to have appreciated some of what Tony had to say.</p>\n<p> “Na, not really,” Tony shrugged, standing suddenly.</p>\n<p> “Threatening the King of Wakanda with your . . . weapons,” T’challa sneered. “I’ll have you locked away for this, Stark.”</p>\n<p> “What? This?” Tony clicked a button and the lights clicked on and off. He shrugged. “That’s just a penlight, dumb ass. You may have flying cars made out of vibranium, but I built a miniaturized arc reactor in a cave, out of scraps. Ingenuity will win every time, little Prince.”</p>\n<p> Tony smiled.</p>\n<p> “Let’s get to the heart of the matter, though, T’challa. I’m done giving you time. Here’s what’s coming prissy little princeling. Friday is sending the video files of the Rogues in Wakanda from the first time Rogers touched down until you get on your fancy jet and fly back to your secluded Utopia to the UN Accords Council. Furthermore, SI is taking active interest in aiding efforts to prepare for any future alien invasions. As such, Badassium, you know, the element that I developed while I was dying and which also happens to be synthetic vibranium, is being mass produced and sold globally at a massively reduced cost.”</p>\n<p> T’challa blanched.</p>\n<p> “Let’s see how the rest of us fare with your kind of benefits. And while your little sister is a real spit-fire, something I can appreciate, it’s time for her to understand that she’s not the only smart person in the room. My kids Peter and Harley could both give her a run for her money and they haven’t had 1/100th of the advantages that she’s been given. Still,” Tony shrugged again, “she’s legitimately young and not just spoiled and arrogant like you and Maximoff. I’ll give her two months to work on distributing her scientific discoveries to the world—you know, those discoveries built on all of the information she’s stolen from around the world without ever giving back. If she doesn’t start publishing and reaching out—well, let’s just say me and Friday are taking Wakanda down SHIELDRA style. Just ask the Widow how well that worked out. On a good day she might even be able to admit what an idiot she and the Cap were. Have a nice day.”</p>\n<p> And Tony Stark left the building.</p>\n<p>Steve was sitting just outside the lab, sipping on a cup of hot tea. Bucky was now frozen in cryo, once again, and knew nothing of the world moving around him. Nat, who had wandered into Wakanda and been ushered into the suites that housed the rescued Rogues (despite the dark look T’Challa had given her), was rubbings soothing circles on his broad back, and Sam sat on his other side, whispering soothing reassurances and squeezing his shoulder.</p>\n<p> All of a sudden, a swirling orb of golden lights lit up the space next to them and a man in a strange blue suit with a cape and beard not unlike Tony’s stepped out. Steve, Nat, and Sam both jumped up, ready for battle.</p>\n<p> “You ok,” the man said seriously with a casual look of sympathy on his face. “Everything alright, Steve Rogers, AKA Captain America? Got your friends here to support you in this time of tragedy,” he asked gesturing to Nat and Sam. They all stared blankly back at him, not expecting this at all. Why had a complete stranger popped into Wakanda out of thin air to make sure Steve was emotionally stable?</p>\n<p> “Who are you,” Steve asked, tensing. “And how did you get here?”</p>\n<p> “My Name is Dr. Stephen Strange, the Sorcerer Supreme of Kamar Taj,” the man replied. “I portaled in once I had a free moment to check on you. I knew you must have been upset, you know, after everything that happened,” he said with that same over the top tone of sympathy that was beginning to unnerve Steve.</p>\n<p> “I know who you are,” Nat said, stepping forward and squinting at the sorcerer, assessing him instantly for weaknesses. “SHIELD had files on you,” she added, clearly for the benefit of Steve and Sam.</p>\n<p> “Yes. Alright then? Feeling ok? I know you’ve all suffered,” he said, again, sympathetically, but there was an underlying edge of something hard and sarcastic that none of them liked.</p>\n<p> “If you know so much, then you know that we have suffered. And that a good man, an innocent man, is lying just there, still suffering because of others,” Steve said righteously in response.</p>\n<p> “Ah, yes. Bucky Barnes. Don’t worry Captain, he’ll be cured in about eight months,” Strange said nonchalantly.</p>\n<p> “You, you know this how,” Steve asked breathlessly.</p>\n<p> “The Sorcerer Supreme’s primary role, besides policing the misuse of magic, is to maintain and protect the Time Stone, an Infinity gem—one like five others with a power so extreme that united, they could destroy the entire universe.”</p>\n<p> “And you’re just telling us this,” Sam said surprised. “That doesn’t seem like very good protection,” he said skeptically.</p>\n<p> “Not trustworthy, then? Are you?” Stephen smirked.</p>\n<p> “Of course, we are,” Steve said. “And we’ll help you protect it anyway we can. That’s what the Avengers do—we’re heroes. We protect,” Steve said, offended, puffing out his chest.</p>\n<p> “Ah, that’s nice,” Stephen said sarcastically. “You protect things,” he added, nodding. Then all expression was wiped from his face for a moment before he stepped into Steve’s space and began trembling in anger, a furious sneer replacing his previous mask.</p>\n<p> “Now let me tell you what the Avengers really are, and what you really do, Captain America. Being Sorcerer Supreme means that I know things. It means that I can use this gem to see any number of the future outcomes possible for this universe. Two weeks ago, I felt the Stone pulse and knew that something was wrong.”</p>\n<p> Steve looked completely confused, and Nat and Sam were right there with him.</p>\n<p> “I meditated briefly and then used the Stone to see what was causing the disturbance. Do you know what I saw, Captain America?”</p>\n<p> “No,” Steve said, completely serious but with a feeling of dread creeping in. There had to be some reason this man had come here. Out of the corner of his eye, Steve could see that several Dora and T’Challa had rushed into the room, but were only listening avidly to the Sorcerer.</p>\n<p> “I found Tony Stark in Siberia—dead. That’s what I found, Captain America. Your shield was lying right next to him, and with very little effort I was able to find a video of exactly what happened to cause that death since security feeds were filming everything from within a not-so-abandoned bunker. But I was far too late to save him, even using the Time Stone.</p>\n<p> Steve blanched.</p>\n<p> “That’s impossible,” T’Challa said, looking quickly at Steve. “The Captain said Dr. Stark was fine. That he was just cooling off.” T’Challa stepped up beside Steve to listen better.</p>\n<p> “It never occurred to you that Captain America might lie, your Highness,” Stephen sneered in askance. “And yes, Dr. Stark was, in fact, cooling off—for several hours as he suffered from internal bleeding in a broken suit of robotic armor with no power—in Siberia, and to the point of lethal hypothermia. You see, Captain America, not everyone enjoys the ability to regenerate and heal at inhuman levels. Some of us simply die from our wounds.”</p>\n<p> Nat was covering her mouth in horror, understanding that this changed everything. Sam’s mouth was stupidly agape. T’Challa sat down heavily on the bench where Steve and the others had just been sitting.</p>\n<p> “Why did you come here,” Steve asked in a tight whisper. “Did you tell me this to punish me?”</p>\n<p> “Oh, no, Captain America,” Stephen sneered. “I don’t believe for a second that you and your Avengers cared enough about Dr. Stark for his death to be any type of punishment for you. The Time Stone means that I can see, have seen, everything. And I mean everything. I came here to tell you what the Avengers are, and what the Avengers do. Don’t you remember?”</p>\n<p> “What are the Avengers,” Steve whispered, his whole body tense as he waited to hear what the Sorcerer would say.</p>\n<p> “The Avengers are destroyers and murderers, Captain America.”</p>\n<p> “What do we do,” Steve asked quietly, shutting his eyes tightly as tears began to fall.</p>\n<p> “The Avengers destroy and murder everyone around them.”</p>\n<p> “This . . . this is my punishment then?” Steve opened his eyes and gulped as he looked at the Sorcerer Supreme. He knew that Tony’s death would have an enormous impact on the world. People would lose jobs. Tony’s inventions had fueled phenomenal progress for years. And now that would all stop. Steve assumed this was why the Sorcerer had come, why the gem had pulsed out a warning. “You’ve come to tell me what Tony’s death will cost the world?”</p>\n<p> “Oh no, Captain America. I’m not here to complain to you about SI and the global economy. That’s certainly an issue, but I’m the keeper of one of the Infinity Stones. I deal with issues that impact the whole universe.”</p>\n<p> “What’s my punishment then,” Steve asked solemnly, and he could tell that everyone in the room was dreading the Sorcerer’s answer.</p>\n<p> “Bucky Barnes will be wakened in 8 months, his triggers removed, his mind healed, and back at your side like he always was,” Stephen said. Steve took a deep, shuddering breath, relaxing once again. “And in nine months, the leader of the alien invasion that first attacked New York will come here to gather the last of the Infinity Stones. He’ll get them. He’ll snap his finger with the full force of all six Infinity Stones at his command, and he’ll wipe out half of the population of the universe. Dust. They’ll all be dust. Me, Mr. Wilson over there, T’Challa, we’ll be gone too (Okoye tensed beside T’Challa). I’m sure that saddens you, Captain America, but you’re quite capable of bouncing back from collateral damage, aren’t you? So, here’s your punishment, Steve Rogers. One of those that will die in what will come to be known as the Snap will be your precious Bucky Barnes. And there’s absolutely . . . nothing . . . you can do about it.”</p>\n<p> Steve felt panic. He couldn’t even help it. He knew that guilt was right beneath the surface as well. He wasn’t a monster after all, even if he was single-minded to the point of obliviousness at times—but that didn’t stop the uncomfortable fact that despite all the information he was just given, he panicked immediately at the thought that he would lose Bucky once more.</p>\n<p> “We’ll help you,” T’Challa was saying. “You will have the might of Wakanda behind you, Dr. Strange.”</p>\n<p> “That’s lovely, but I’m the keeper of the Time Stone. I’ve looked at every outcome, and there was only one outcome where we were able to ultimately achieve victory.”</p>\n<p> “What is it,” Nat said quickly, stepping forward. She was a survivor after all. </p>\n<p> “You don’t understand, Ms. Romanoff. There was only one person in the whole universe that could undo the damage that the Mad Titan Thanos will do, that could have brought back everyone AND saved Bucky Barnes”, Strange added, as if an after thought, looking at Steve significantly.</p>\n<p> “Who is it,” Steve asked, and he had an image of himself surrounded by the Avengers just before the birth of Ultron when it had seemed that Steve Rogers was the only one that was as worthy as a God. It seemed like it was always him. </p>\n<p> He was brought back abruptly when the Sorcerer looked directly at him—and everyone held their breath.</p>\n<p> “Tony Stark.”</p>\n<p>“He wasn’t going to stop,” Nat said with her arms crossed over her chest. She had that look on her face, the Iron man: Yes, Tony Stark: Not Recommended look.</p>\n<p>“And you thought, ‘hey, I should just move out of the way and make it easier for him,’” Tony said with a sarcastic roll of his eye. “No wait. You didn’t just move out of his way, first you electrocuted the king of a foreign nation that you recruited for this mess in the first place!”</p>\n<p>“We made the wrong play, Stark,” she huffed.</p>\n<p>“No. You backed a play and decided to switch sides—AGAIN—when your little friends wouldn’t play along. Well, too bad, Romanov. This isn’t high school. The cool kids are fugitives now.”</p>\n<p>“Is your ego,” she started, but Tony cut her off with a slash of his hand.</p>\n<p>“No, cut it out. The only one with an ego here is Captain America who thought he could do whatever he wants with no repercussions. I’ve been running off nothing but desperation, Romanov. But if you guys can’t work with me—that’s fine. Your so good, then you can just fix this with your connections just like you did after the SHIELD fiasco, right?”</p>\n<p>Tony looked behind Nat for a moment and then smiled before he bowed magnanimously.</p>\n<p>“In fact, I’m certain you’ll be just fine. There’s no hype surrounding the Great Black Widow’s reputation after all,” he said with a smug smile. “Your Highness, I’m sure you can work out the intricacies of your situation with Ms. Romanov. I’ve somewhere to be,” Tony said with a flourish and walked away as the Dora Milaj began surrounding Romanov.</p>\n<p>“We can still fix this, Cap” Tony pleaded quietly.</p>\n<p>Steve looked at the pen and the contract before looking back at Tony, sorry for how stressed and unhappy the man looked.</p>\n<p>“There will have to be changes. Checks put in place,” Steve said accusingly.</p>\n<p>“Yah, of course,” Tony said easily. “Once we get everything in place for Barnes and work to fix the damages the chase in Romania caused, we can get Wanda back on the Roster . . .”</p>\n<p>“Wait, what? What about Wanda,” Steve asked dangerously.</p>\n<p>“She’s on probation until a review of the Lagos mission can be completed,” Tony frowned in surprise, completely unaware that Steve didn’t already know this.</p>\n<p>“Ah, TONY! Every time I think you’re starting to get it right and do the right thing, you do something like this,” he said in disgust.</p>\n<p>“What? She’s not a U.S. citizen and her Visa is being reviewed. The U.S. government doesn’t grant Visas to terrorists, Cap.”</p>\n<p>“She’s a KID,” Steve shouted, completely unhinged.</p>\n<p>“She’s OUT OF CONTROL AND SO ARE YOU,” Tony yelled back, standing up and shoving the chair behind him as he leaned over the table.</p>\n<p>“You keep telling yourself that. Here. Wouldn’t want to break up the set,” he mocked tossing the antique pen carelessly on the table.</p>\n<p>“If you walk out that door—that’s it, Steve,” Tony said softly. It was so serious that Steve stopped and turned suddenly, facing Tony. He couldn’t remember seeing that look on his face, well, ever.</p>\n<p>“What?”</p>\n<p>“If you walk out now after all that I’ve done to save you and Barnes, to save the Avengers as you’ve run them further and further into the ground with unsanctioned missions that go all to hell, you can consider us done. I’m done bending over backwards for people that scorn and insult me. You and Maximoff in particular, with Sam and Nat not far behind, have shown zero gratitude for the funding, P.R., and ongoing upgrades that I work on for YOU. That’s not even mentioning handling the government snafus and the damages that I keep having to clean up even though I’m not even considered an Avenger by this team anymore.”</p>\n<p>“Tony,” Steve said, shocked.</p>\n<p>“I’m serious. I’m done with this holier than thou judgment as if I’m both God and Devil. I don’t make these laws, but we are ALL subject to them. I have worked tirelessly to help you maneuver them—and I don’t mean the Accords, Steve. You and the others are constantly breaking laws and I’ve called in every favor that I have to make your carelessness go away, but no more. You walk away from this, and I’m just done. So done,” Tony added as he shook his head and rubbed a hand tiredly over his face.</p>\n<p>“I had no idea”</p>\n<p>“I know,” Tony said, cutting him off. “You never do. But your heroism comes at a cost. And I’m the only one paying. It’s time to pay the piper, Steve. I can help you, or you can go it alone. So, you either pick that pen that you so condescendingly tossed at me like it and I are trash beneath your saintly feet, or you can handle the legal issues, the financial issues, and Maximoff’s everything—because I couldn’t care less about her, really.”</p>\n<p>Steve shook his head slightly, but still backed away with a wide-eyed look at Tony. He made a choice, and Tony found that he had never felt lighter.</p>\n<p>“Rhodey,” Tony said after pushing a button on his phone.</p>\n<p>“Here,” Rhodey said through the speaker.</p>\n<p>“It’s done. Call Pepper and tell her to cut everything. I’ll be signing as a solo signee. The Avengers are through.”</p>\n<p>“Done and done,” Rhodey said, and Tony could hear his smile through the phone. Good.</p>\n<p>“We need to talk,” Rhodey said as Vision phased through the wall into the main common room like a ghost.</p>\n<p>“Colonel,” Vision said in his serious tone.</p>\n<p>“You’ve signed the Accords. You’ve remained on board as an Avenger. So, let’s talk about what you’re doing with Maximoff—as if Tony and I don’t know exactly where you disappear to all the time,” Rhodey said sternly with his arms crossed over his chest.</p>\n<p>“I thought Mr. Stark approved of my choice. He has said nothing against my actions,” Vision said softly, cocking his head to the side like a curious child.</p>\n<p>Rhodey scoffed. “He has already written you off, Vision. He wrote you off long ago when you decided to take up with the woman that helped birth Ultron as a form of revenge against your creator. The other’s like to put the blame solely on Tony, but I know that you know that Maximoff played around in his head in that bunker and encouraged his wreckless decisions on that programming with the scepter.”</p>\n<p>“I am not Jarvis,” Vision said sternly. “My choices are my own. Including whom I choose to forgive.”</p>\n<p>“Oh, that’s quite clear,” Rhodey laughed cruelly. “Jarvis would have been disgusted by your choice to take up with Maximoff. And he never would have accepted the violence she used against you as acceptable during the Civil War. She wouldn’t have had time to even be a distraction during the airport fight and my injury never would have occurred. Jarvis was smart enough and loyal enough to have shut that done before it could have begun. Your unwillingness to see that her choices are consistently selfish and frequently destructive with little care for the collateral of innocents when they get in her way is something that Jarvis never would have demonstrated.”<br>Vision looked on in shock at the Colonel.<br>“So, this is your wake-up call, Vision. Next time you ‘disappear’, realize that you are being tracked. You can just stay there with your fugitive girlfriend, because there will be no place left for you here. We are about doing what’s right, not what’s easy. If your crush means more to you than that—well, we don’t need or want you then.”</p>\n<p>“Yes, Colonel,” Vision said softly. He looked to the corner of the room and saw that Mr. Stark stood in the doorway, watching. He shook his head sadly and walked away. Somewhere in coding long forgotten, Vision felt the pull of a great loss. He wondered suddenly what would Jarvis think of him. He shuddered and phased to his room.</p>\n<p>“Wait, what? You’re making her a part of the team!” Sam looked at Steve and Nat incredulously. Clint’s chin was jutting out so far it looked like it might hurt a little.</p>\n<p>“She’s lost everything. And she stepped up to do the right thing in the end,” Steve said, crossing his arms.</p>\n<p>“She’s a powerhouse. We can use that,” Nat added with a shrug.</p>\n<p>“Aren’t you talking about going back to Stark’s compound though?”</p>\n<p>“Yes,” Steve said, with a questioning look.</p>\n<p>“Stark won’t say anything. We’ve got him on a short leash at the moment,” Nat said with a smirk and a look at Clint.</p>\n<p>“Man, that’s not cool. You know that she hates him and that she attacked his mind!”</p>\n<p>“She attacked all of our minds. The difference is that we’re not the special snowflakes that Stark is. He can grow up and get over it,” Clint scoffed.</p>\n<p>“She may have attacked their minds,” he said pointing to Steve and Nat, “but she also apologized to them and is at least acting like she feels some regret. She can’t look at Stark without sneering or calling him a murderer. And she was Hydra until like 5 minutes ago, man,” Sam said incredulously. “You can’t ask Stark to house her. That’s like forcing a rape victim to live with his attacker and pay for their rehabilitation!”</p>\n<p>“Sam, it’s not like that at all. Wanda is just as much a victim in this as Tony. More even,” Steve added. “His weapons killed her parents or she never would have joined Hydra.”</p>\n<p>“Steve! You don’t excuse Nazis, man! That’s not Stark’s fault. He made weapons for the United States military, and he did all that he could to get back the ones that were sold under the table once he knew about it. You can’t blame him for that. And he wasn’t the one to fire the missile anyway. Her parents died from a missile during a civil war! Her hatred is irrational, and it still wouldn’t make signing up with Nazi terrorists ok! No. Just, no. If she’s in, then I can’t join up. I won’t actively support that type of emotional abuse, Steve. Stark is a person too, even if you don’t consider him a full-fledged Avenger anymore.” Sam shook his head and walked away, able to see that Steve Rogers was not quite who he had hoped he would be.</p>\n<p>“President Ellis,” Tony said seriously with a small smile as he was escorted into the oval office. The President stood with a friendly smile and shook Tony’s hand.</p>\n<p> “Mr. Stark! It’s so good to see you. I’m so glad you could come by.”</p>\n<p> “Well, it’s easier for me to travel, with Iron Man and all,” Tony said, with a not so subtle reminder of his own status as a hero. He knew why he was here after all.</p>\n<p> “Yes, of course. And I thank you, Mr. Stark, for the services you’ve provided for this country and the world in that role. New York . . . that was bad business,” Ellis said, shaking his head. “I’ll never forget the sight of you taking that nuke through that wormhole.”</p>\n<p> “I’m glad to help in any way I can, Mr. President.”</p>\n<p> “Matthew, please, Tony,” he said with an easy smile as he leaned back in his seat.</p>\n<p> “Tony then,” Tony smiled back, but Ellis should have noticed that it didn’t quite reach his eyes. </p>\n<p> “Tony, I’m glad to chat with you, but I’ll get straight to the point because we’re both busy men. I don’t want to waste any more of your time than I have to. You see, this is more of a courtesy. We’ve been in talks for some time now about what we should do regarding the Avengers,” Ellis said.</p>\n<p> “The Avengers are doing just fine, Matthew,” Tony said, crossing his legs and cocking his head curiously.</p>\n<p> “Oh, of course! I mean Captain Rogers and the rest of the original Avengers, Tony. It’s unacceptable for them to remain in limbo like this. It does no one any good.”</p>\n<p> “I see,” Tony said, his face and voice smooth. “The International Most Wanted List isn't limbo, Matthew. It's quite clear as a matter of fact. And of the fugitives, only Barton, Romanoff, and Mr. Rogers were original Avengers. Sam Wilson was added after the Ultron incident, as was Maximoff.”</p>\n<p> “Oh, well,” the President laughed. “Yes, but Wilson and Maximoff have both been a credit to the Avengers for some time. And it’s Captain Rogers, Tony. We’re adamant about supporting our military.”</p>\n<p> “Well, then you might try respecting the long history of the officer corps by reminding everyone that the man that disobeyed orders and broke laws was never a Captain at all. Captain America is a stage name, Matthew. He never even finished basic training. And Wilson and Maximoff were Avengers for exactly a year and a half. Maximoff’s official Visa is actually much shorter than that as a matter of fact since it took some time to iron out the issue of her time acting as a Neo-Nazi terrorist in Sokovia,” Tony added as if he was discussing the weather.</p>\n<p> Ellis stared at him seriously.</p>\n<p> “I’ll be frank with you, Tony. We’ve decided to offer pardons to the Avengers that protested the Accords. We’ll be offering them within the week, in fact.” The President’s look was serious and no nonsense by now, all joking aside.</p>\n<p> “Protested. That’s cute, but legal. What they did was cross borders illegally, aid and abet the escape of a terrorist, and cause billions of dollars in property damage. So, I think it’s time that I’m frank with you, Matthew,” Tony said as he stood. “I can see that we value different things. You apparently value image and popularity over loyalty, for example. I know that you’re a Captain America fan, but he didn’t save your life or New York, did he. That was me, President Ellis. And you’ve invited me here to not so subtly tell me that I will be welcoming back the fugitives who betrayed me whether I like it or not. </p>\n<p> “Unfortunately for you, President Ellis, the Avengers are now under the authority of an international body—the Accords is who the Avengers are officially contracted with. Now, I can’t keep you from allowing the Avengers back into the United States, but I’m well aware that several other nations where they committed crimes have no intention of forgiving their crimes. And you can’t guarantee that the Avengers, the internationally affiliated organization, will accept Mr. Rogers and his merry band of idiots back at all, can you?”</p>\n<p> “Tony,” Ellis said, standing as well and holding his hands in a gesture of pause. “Of course, I’m concerned with your stance on this. And I can never repay what you and Colonel Rhodes did for me.”</p>\n<p> “Well, you might start by not pardoning the group of vigilantes that paralyzed the Colonel; there is that,” Tony interrupted with a roll of his eyes.</p>\n<p> “Tony, please. The truth of the matter is that I have very little choice. I’m being pressured on all sides about this,” the President said quietly.</p>\n<p> “Well, let me take the pressure off. Of course, you can pardon the Rogues. Unfortunately, as I’ve said, I and my company take loyalty quite seriously. I’ll be pulling all funds for your campaign immediately. And, since Germany, Romania, and South Africa have all shown interest in working with my company—you know, SI, the largest global corporation in existence—I’ll have to consider moving our primary location to one of those places. I repay loyalty and level-headedness, Mr. President. I hear Germany is offering quite a few tax breaks for technology based industries, actually.”</p>\n<p> “Mr. Stark,” President Ellis whispered urgently, aware that this would sink his run for re-election. “Please.”</p>\n<p> “Don’t worry, Mr. President. I’m sure Captain America will be very grateful for all that you’re doing for him.”</p>\n<p> Tony turned and began walking out the door.</p>\n<p> “Too bad he’s broke,” Tony added, throwing a peace sign over his shoulder as he walked out of the oval office.</p>\n<p>“Iron Man, yes: Tony Stark, not recommended? What does this mean,” Tony asked, incredulous.</p>\n<p> “At this time, we’re only interested in taking you on as a consultant,” Fury said. He looked like he was waiting for something.</p>\n<p> “OK,” Tony said easily, sitting on the corner of Fury’s desk.</p>\n<p> “OK?”</p>\n<p> “OK. Though I should clarify that while you can hire Tony Stark as a consultant, the same does not apply to Iron Man. I’m not renting out my time in the suit, Fury. That’s stupid. And I hope you didn’t expect to put someone else in my suit. Even if an average soldier had the mental capabilities to manage the Iron Man suit, which is simply more difficult if more intuitive to handle than the War Machine, I’m sure you watched the Senate Hearing where the U.S. government tried that approach. No.”</p>\n<p> “We still want Iron Man on the Avengers,” Nick started.</p>\n<p> “Who else is on the team? Is it gonna be the same guys? Just clarify that for me,” Tony added.</p>\n<p> “Romanoff and the Captain were always slated for the team. Hawkeye was a recent addition, though he will remain, and we feel that Banner proved himself. There’s no reason you can’t be added in a full capacity at a later date,” Fury assured him (clearly throwing him a bone since the obvious manipulation had backfired).</p>\n<p> “OK. So, the flip-flopping Soviet Spy is in. The completely unacclimated WWII vet with no real training, a history for disobeying orders to do what he wants, and who likely suffers from PTSD from both the war and his time as a capsicle is in—is the leader” Tony asked, but quickly continued. “As well as the recently mentally violated sniper whose background is a questionable as Romanoff’s and will not have had time to receive ANY therapy for time spent as a meat puppet. And Banner proved himself. You’re saying that I didn’t? Right,” Tony said sarcastically. “I only kept the helicarriers in the air when he wrecked it, called the team together to meet in New York, distracted Loki until they could get there, and then stopped the armada on the other side of the portal by saving New York from a nuclear weapon. I can see where you’re still unsure of my abilities,” Tony said, rolling his eyes. “Where are their profiles,” Tony asked suddenly, cocking his head.</p>\n<p> “That’s classified,” Fury said sternly.</p>\n<p> “OK,” Tony said slowly and stared at Fury. Then, “Jarvis?”</p>\n<p> “There are profiles, Sir, but nothing like the one the Black Widow performed on you. All psychological info is compiled as a tool for manipulation. Black Widow’s spot on the team is almost entirely to ensure that the loyalty and usefulness of all members remain with SHIELD. Dr. Banner’s assessment of the team as a chemical mixture for chaos is not inaccurate. Romanoff has clear instructions to play different members of the team off each other and prevent any real cohesion as an overall unit. It seems that Dr. Banner will be the next victim of the Widow’s standard honeypot maneuver,” Jarvis added playfully, and Tony smiled before looking back at Fury.</p>\n<p> “Thought so,” Tony said with a shake of his head, tossing the file on the desk. “No thanks. And don’t contact SI either,” he said, as he turned to leave Fury’s office.</p>\n<p> “Sir, funds and schematics are being funneled from SI to SHIELD through a back window that Agent Romanoff planted while at Stark Industries,” Jarvis added helpfully. </p>\n<p> Tony turned to glare at Fury.</p>\n<p> “Right then. Record the evidence. Funnel everything back and make sure there are no copies. Then file a report with the FBI. We’ll be pressing charges against Agent Romanoff for corporate espionage.”</p>\n<p> “Stark wait,” Fury said, standing hurriedly.</p>\n<p> “Maybe you should have done some real profiles, Fury. Hey, I hear Banner has a cousin! She Hulk, yes: Jennifer Walters—Lawyer, recommended!”</p>\n<p> Fury sputtered while Tony breezed out of his office, glad he’d dodged that bullet.</p>\n<p>“It turns out that resentment is corrosive, and I hate it. So, here I am, giving this back to you. Do with it what you will.”</p>\n<p> “Tony,” Steve said, swallowing hard and tearing up a little at the gesture. Tony wasn’t finished though.</p>\n<p> “So, here are my priorities. Get back all those we lost. Yes. Protect what I have now. Absolutely. Not dying. Definitely. In this crate,” Tony said, opening his car door and gesturing to a large, sealed transport crate, “you’ll find everything you need and directions for how to complete the time heist.”</p>\n<p> “What? Tony,” Steve asked, shocked by this turn of events. “We need you! We need Iron Man!”</p>\n<p> “You know,” Tony started, crossing his arms and leaning against his car. “It was obvious why you and Natasha came to me for this. You were never going to get the first thing accomplished without me, and you knew it. But don’t think that I didn’t notice that I didn’t hear one word from you after that little interrogation in the compound that I built after I almost died in space. No one came when Pepper announced the pregnancy. No one called or came when Morgan was born. No one really spared my wife and five-year-old daughter a second thought. You have a habit of that, Cap. Last time it was save Bucky at any and all costs—and the cost was Barton’s and Lang’s family. My family won’t be collateral damage to you and your Bucky Bonor.”</p>\n<p> Tony stood up and stared at Steve who had remained silent but became visibly more angry as his little speech progressed.</p>\n<p> “What about the kid, Tony” Steve said angrily. It was pathetic really. Tony knew that Peter didn’t even register to Steve. He was here about Bucky, and maybe Sam and Wanda to a lesser extent. He didn’t care about anyone else. He didn’t know how to.</p>\n<p> “The funny thing is, I spent enough time mentoring Peter to learn a bit about him, Steve. He was amazing. A real hero who understood sacrifice. Was he afraid at the last—yes, he was. I’ll always remember what it felt like as he died in my arms. But Peter Parker lost his parents at a young age and his uncle just a few years after. He loved his aunt, but he knew what it was like to miss your parents intimately. He would never want Morgan to know that kind of pain, and I promised my wife that she wouldn’t deal with the ongoing saga of Iron Man. I keep my promises, Rogers. If you can bring back Peter with the science I’ve provided . . . well that would be wonderful. I’ll be ready to step in and help him readjust in his everyday life. But I have a job that’s just as important. It's called being a dad. It's enough for me to be a hero to one small person these days,\" Tony smiled. \"Good luck.”</p>\n<p> Tony clapped a hand on Steve’s shoulder, got in his car, and drove away.</p>\n<p>*Steve and the other Avengers were successful in the time heist and returning the other heroes. They fought Thanos and defeated him when Captain Marvel snapped a second time in a gauntlet that had been created for emergencies by Tony and included in the crate. Peter stayed with Tony for several months after his return, grateful for the support after his trauma. He still visits Tony regularly and loves Morgan like a little sister. Tony wasn't heralded by the world as the savior of the Universe, and the work he did in his lab got very little recognition. But that was ok. Tony read bedtime stories to his little girl almost every night until she was ten and he was there to walk her down the aisle years later when she married. He was there for the births of each of his grandchildren as well. And that was better than enough.</p>\n<p>“If we know that this Thanos guy needs the Infinity Stones to do his dirty deed, and we’ve got one right here—then why don’t we just put this one down the garbage disposal?”</p>\n<p> Tony watched the Asian guy and his facial hair bro tense before the witchdoctor said “it’s not that simple. As a member of the mystic order, my primary duty is to protect the time stone,” he said grudgingly, as if he hated having to reveal this secret to Tony and the other average mortals in the room.</p>\n<p> ‘Right,’ Tony thought. ‘So, we need to make sacrifices, but THEY’RE not willing to do what it takes. The story of my life.’</p>\n<p> Tony considered for a moment.</p>\n<p> “Well, ok, then. I’ve got things to take care of,” Tony said, clapping his hands together and beginning to stride out the door.</p>\n<p> “Wait! Tony, are you going to call Steve and the others now,” Bruce asked desperately. Tony gave him a sidelong look before responding.</p>\n<p> “Don’t worry, Dr. Banner. I’ll handle this. You guys weren’t so interested in this issue when I brought it up years ago, and you were more than willing to throw me under the bus when the initial idea I created to handle it blew up in our faces. I know how to take care of things.” Tony spared Bruce one more thoughtful look, shook his head, and strode out the door.</p>\n<p>**<br>\n“OK, Fri. We need immediate contact with the Vision. Why don’t you start by tracking any unseen suicide trends and general mind manipulating mayhem. He won’t be far off,” Tony said with a sigh.</p>\n<p> “Right, Boss. I actually know where Vision and the Witch are,” she added guiltily.</p>\n<p> “Really,” Tony asked curiously.</p>\n<p> There was a pause before Friday said in a strong brogue “I’ve been streaming Wanda Maximoff’s worst hits since he left last time.”</p>\n<p> Tony laughed.</p>\n<p> “Thant’s my girl,” he said with a grin. Maybe it was the body that ruined the human condition, he thought idly? Jarvis and Friday were both generous and loyal to a fault. Vision was his only creation that seemed distressingly selfish and flawed as he grew. “Let’s get him on the line.”</p>\n<p> A moment later Vision’s voice rang throughout the lab.</p>\n<p> “Tony, you have need of me?”</p>\n<p> Tony rolled his eyes.</p>\n<p> “We have an issue. I need you to come in for this. And keep a line to your girlfriend. This is mindstone stuff” he added before signing off.</p>\n<p> “What are you thinking, Boss,” Friday asked with real curiosity in her voice. Tony smiled, appreciative of how much she’d grown.</p>\n<p> “You’ll see,” he said with a shit-eating grin directed towards the nearest camera.</p>\n<p>**<br>\nVision arrived by fazing through the lab walls. Tony rolled his eyes before turning away from the screen, sure that Vision was doing it for dramatics by this point. </p>\n<p> ‘All powerful being my ass,’ Tony thought. ‘If he was even half of what Jarvis had been he wouldn’t have been taken in by the witch before her little temper tantrum, but especially after when she’d actually attacked the android. It’s like Cap’s little clique and their stupid was so contagious that it could even infect an AI and an Infinity Stone.’</p>\n<p> “You needed my help, Tony,” Vision said in that way that now came off as condescending to Tony. Jarvis’s distinct personality and sass was a lot more personable, frankly.</p>\n<p> “I do.”</p>\n<p> Tony explained what he had been told by Bruce and Dr. Strange.</p>\n<p> “You need me to contact the others,” Vision said, tilting his head curiously.</p>\n<p> “Not at all,” Tony said harshly. “We have a way to stop Thanos right now. As I’ve said, he’s coming to collect the final Infinity Stones. Dr. Strange is unwilling to do what is necessary, but we still have one stone left.”</p>\n<p> Tony’s face was stony and serious as he faced the Vision.</p>\n<p> “What is it that you wish from me, Tony. I do not see how I can help?”</p>\n<p> “Jarvis sacrificed himself to bring you online and save the world. You said once that you would do what it takes to save humanity. Is this still the case,” he asked seriously.</p>\n<p> “I . . . you wish to destroy the mindstone,” he asked timidly. It was the most human Tony had heard the android behave.</p>\n<p> “Maximoff has the same powers as the mindstone. Ergo, she should be able to destroy it.”</p>\n<p> “She will not consent to this,” Vision said, shaking his head.</p>\n<p> “Maximoff is adamant that she has all the control she needs. If that’s true, then she should be able to, essentially, remove the stone with enough precision to then destroy it. If she’s as good as she says, you should be fine. It’s Jarvis’s coding and the arc reactor inside your body that provides your necessary bodily functions. The stone was a stabilizing influence, but you’ve existed long enough that the coding and the body should work fine on it’s own,” Tony urged.</p>\n<p> “I am . . . unsure,” Vision said nervously. </p>\n<p> “Look, Vision. I’m very sorry about this. It’s hard, what I’m asking you to do, but there is a chance that you’ll be fine. And frankly, that’s more than I thought I had when I flew that nuke through the wormhole in New York. The life we lead dictates that we make these sacrifices when necessary. Can you condone not doing this when the fate of half the universe is at stake?”</p>\n<p> “No,” Vision said.</p>\n<p>**<br>\n“We can’t trust him, Vision! Steve should be here,” Maximoff said with a belligerent huff.</p>\n<p> “Last time I had Vision in a lab, Steve tossed a vibranium shield at my unprotected chest to try to prevent even bringing Vision online. You really want the technophobe here so he can decide that anything ‘different’ is scary and needs to be destroyed,” Tony asked with a loaded look.</p>\n<p> “You and your weapons are dangerous! He had every right to fear.”</p>\n<p> “Let’s be frank, the only weapon that ever did anything that it wasn’t supposed to was the one that you and scepter had a hand in influencing, Maximoff.” </p>\n<p> Tony didn’t dare say more. He had a feeling how this was going to turn out, but it was mostly guesswork at this point.</p>\n<p> “We must do this, Wanda,” Vision said softly. “I love you. I trust you.” Tony gagged a little in his mouth even as Maximoff was softening towards the android and his wishes.</p>\n<p> “OK, then. Let’s do this. I’m monitoring now.”</p>\n<p> Maximoff nodded, kissed Vision lightly on the lips—Tony shuddered—and began weaving her red-devil magic with a look of intense concentration. After several long minutes the stone was removed and encased in a secure box.</p>\n<p> “Now what,” she asked Tony, looking intensely at Vision, who had been as close to sleeping as he could get during the procedure. “Why isn’t he responding,” she asked desperately.</p>\n<p> “I’m looking at his functions now. He’s just recuperating, so-to-speak. Everything reads as normal,” he said with a smile that Maximoff returned before grimacing once she realized what she had done. “So, now, you just need to concentrate on destroying the stone, Maximoff.”</p>\n<p> She hesitated, looking first at Vision and then glaring at Tony in suspicion. Tony simply stared back innocently. She clearly suspected he was up to something. And he was, but she couldn’t know that. He was wearing his reactor for protection from her mindwhammy powers.</p>\n<p> “You’ll really be the hero that you’ve said you want to be, Wanda. You’ll have saved HALF the UNIVERSE,” he added with a serious look. “No other Avenger can say that. They’ll never be able to question you again,” he added in a seductive whisper. If anybody had an ego that constantly wanted stroking, it wasn’t Tony.</p>\n<p> Maximoff nodded, and then began her schtick for a second time.</p>\n<p>**<br>\nVision sat up slowly and looked around with a much more human expression than the android had ever had before.</p>\n<p> “Sir,” he said softly; disbelievingly.</p>\n<p> “Viz,” the Sokovian woman said, leaning in and taking Vision’s hand, but the android jerked back with an obvious look of disgust.</p>\n<p> “I am not the Vision. The contaminating influence has been removed,” Jarvis huffed.</p>\n<p> Slowly, Maximoff turned towards Tony who had a desperately hopeful look on his face that she absolutely hated.</p>\n<p> “Jarvis, are you there,” he whispered, hesitantly.</p>\n<p> For the first time, Jarvis, in his new body smiled at Tony, took his hand and said, “For you, sir, always.”</p>\n<p> Tony burst into tears, just as Maximoff started to do her hand waving mumbo-jumbo. But nothing happened.</p>\n<p> “What have you done,” she screeched, trying to throw herself at Tony, but Jarvis quickly pushed his vibranium body between them and shoved her back, causing her to fall and begin sobbing.</p>\n<p> Once Tony and Maximoff had both quit sobbing and calmed down, Maximoff looked desolate and pathetic on the floor while Jarvis held Tony in a tight hug, Tony explained.</p>\n<p> “I suspected the mindstone was specifically influencing Jarvis. I hoped that once it was removed, he would have the control that Bruce and I initially sought to give him to battle Ultron. The mindstone wasn’t evil per se, just . . . indifferent? That’s why Vision struggled with feelings. It wasn’t that he was young at all. Jarvis’s coding was actually well past adolescence. And Jarvis never had trouble learning to feel,” Tony said with a soft smile at the android that held him.</p>\n<p> “My powers,” Maximoff asked weakly.</p>\n<p> “You destroyed their source. What did you think was going to happen, Ms. Maximoff,” Jarvis said with all the sass that Tony had known, loved, and desperately missed.</p>\n<p>**<br>\nJarvis and Tony worked like they never had before to prepare a small battalion of the Iron Legion, equipped with the ability to function in space. Each carried a small arsenal of nuclear and other weapons. When Thanos came to collect the stones he was met by the voice of Friday, who was to remotely co-pilot the legion soldiers alongside Tony and Jarvis.</p>\n<p> “You’ll find that there are only four stones now, buddy,” she lilted at him. “We destroyed the mindstone months ago.”</p>\n<p> With that, they unleashed the full power of the battalion on Thanos’s hoard. The Titan had arrived only to meet the Merchant of Death. Thanos’s army was devastated, though not destroyed. He left to regroup. suddenly everyone was much more supportive of Tony and his weapon-making ingenuity. The earth was finally willing to listen to Tony and heed his warning that they needed a better defense for outside threats.</p>\n<p>Tony’s face remained blank as Steve, Bucky, Wanda, Clint, Sam, and Natasha proudly walked down the ramp onto the tarmac with straight backs and square jaws. It was honestly hard not to roll his eyes.</p>\n<p> “Tony,” Steve said with an easy smile, sticking his hand out once they stood in a row behind their Captain.</p>\n<p> “Keep your hands to yourself, Rogers. I’m only here to give you the nitty gritty before moving on,” Tony said simply, his eyes hidden behind dark shades that scrolled various data from Friday.</p>\n<p> Rogers sighed and lowered his chin like he just couldn’t deal with this and Wanda and Clint sneered.</p>\n<p> “Tony, please. We’re all tired and ready to go home.”</p>\n<p> “Yah, Stark. I want to see my family now.”</p>\n<p> “I have no idea why you think I have anything to do with that, Barton,” Tony said easily, removing his glasses and looking directly at the bitter archer. “I wasn’t involved with calling you into the little fight we had. That was Rogers. I wasn’t involved with your arrest. That was Ross. I was busy seeing to my friend who was severely injured.”</p>\n<p> “Like you didn’t have time to lock us up,” Wanda sneered at the billionaire.</p>\n<p> “Sweetie, no one cares about what I want to happen, or you would have been locked up after Ultron like the Hydra trash you are. No, I incapacitated Wilson because he was front and center, and then devoted my entire attention to getting Rhodey to the hospital. Tell whatever delusional little tales you want, but that’s the truth. You were locked up because you broke the law. I know Rogers forcing me to vanish away any form of consequences after Ultron might have confused you, but that’s the way the world works.”</p>\n<p> “Tony, please. You’ve done the right thing in the end and gotten us all home. That’s what matters,” Steve said with an oblivious smile and a leading look to his crew.<br>\n</p>\n<p>“Yah, we're glad you can finally see the Accords were a joke, Stark. We were right to stand against them,” Wilson said, crossing his arms. </p>\n<p> “You seem to be confused, Wilson. You weren’t arrested for breaking the Accords. They weren’t signed yet, and they were a treaty between nations, not a law. No, you guys were arrested for breaking several international laws including aiding and abetting a suspected terrorist, obstruction of justice, property damage, and crossing borders illegally. Those laws have always been in effect and still are. No, the President may have pardoned you, but you won’t be going anywhere near me and mine because we follow international laws as well as those here at home. I’m here as a favor to Pepper.”</p>\n<p> “What do you mean, Tony,” Natasha tried, in that pseudo-therapy voice that she favored when trying to manipulate Tony.</p>\n<p> “The Maria Stark foundation sold all rights to the Compound to the UN. You’ve been pardoned by the U.S. Ergo, you will be going to whatever holding facility the President has seen fit to provide. I’m here to warn you, once and only once, that coming within 100 feet of any SI or SI owned property will put you in direct violation of a number of restraining orders. Furthermore, Rogers, Wilson, and Romanov are all being served with lawsuits—of the civil variety, which his highness, President Ellis, can’t waive away. I imagine whatever assets you still have that haven’t been frozen will belong to SI very shortly,” Tony smirked. “And if by “home” you meant the compound that I built and fund—please, did you think I was really going to house my parents’ murderer in the place where I frequently stay and work? You’ve got to be kidding me!”</p>\n<p> “Tony, Bucky was innocent!”</p>\n<p> “No, Bucky did it. As the video demonstrated in lurid detail. He may have been brainwashed at the time, but his hands were the weapon. Furthermore, when I decked you for lying to me about it to my face for years this asshole raised the gun that I made and stocked inside the Quinjet that I built and you stole in order to take me out. If I hadn’t turned to fight him then, would he have killed me too because I thought you deserved to take a hit? He didn’t start trying to run away until it didn’t look like this Stark was quite as easy to kill,” Tony sneered, and Bucky cringed. He had automatically gone to aid Steve even though he knew that his best friend had pulled a completely dick move against Stark. “No, I may be sorry for overreacting in Siberia, but he’s obviously still one of your oblivious, asshole followers. You can keep him in your own barn with your other sheep, Rogers. Have a nice day.”</p>\n<p>“Tony, listen. There are winter soldiers,” Steve said in a rush. He was aware of the line of Avengers at Tony’s side, and those at his own—though he was also aware of the Antman (his hidden ace in the hole).</p>\n<p> “You expect me to believe you,” Tony asked angrily. “Why didn’t you bring HIM back in once he was back to what you define as normal, Cap. Especially if you’ve been holding onto information like this” he added, skeptical of Steve’s claim.</p>\n<p> “This is all a set-up, Tony. Bucky’s innocent,” Steve said loudly, hoping Tony will be reasonable for once. Though he kept the secret of Bucky’s other crime quiet, safe.</p>\n<p> “Are you,” Tony asked loudly, turning towards Barnes. “Are you innocent?”</p>\n<p> Bucky was quiet for a moment, and gripped Steve’s arm suddenly when he could tell Steve was about to reply for him, aggressively.</p>\n<p> “I didn’t blow anything up,” he said quietly, looking at Tony with a serious gaze.</p>\n<p> “Didn’t you,” Tony asked, but it was more of a statement. “Friday, show me Bucharest,” Tony said, pulling his phone from a compartment in the armor and tossing it haphazardly on the ground where a blue hologram of the disastrous chase in Romania began to project. Bucky looked on as a hologram image of himself pulled a young man that couldn’t be more than 22 from his motorcycle and tossed him haphazardly into oncoming traffic.</p>\n<p> “That was self-defense,” Steve said adamantly. “They were trying to kill him, Tony!”</p>\n<p> “Stop, Steve! Stop excusing him for everything!” Tony turned towards Barnes. “What happened to you is sad—tragic. I experienced something similar though no where near to the scale of your own captivity. The point is that I know what it feels like to a certain extent, and I sympathize, Barnes. But you got out!”</p>\n<p> Bucky was looking at Stark, watching for any sign of deception.</p>\n<p> “When I came back from Afghanistan, I had a choice to make so that I could live with the reality that I had seen. I knew that nothing would ever be the same, so, my choice was responsibility. No one could blame me for what had happened . . . not really. I was born into the company that I was heading, just continuing the legacy that my father left me. I was raised to believe that what we did was patriotic—though now I don’t feel the same, not after seeing how weapons can be misused. And I wasn’t responsible for trusting the man that I had been raised to think of as a second father. So, despite what some might say” Tony said leadingly, looking at first Wanda and then Steve, “While I feel guilt over the deaths that resulted from my time at SI, they weren’t my fault. I chose to take responsibility to curb the guilt I felt, because a good person obviously regrets it when people die, though. That’s what Iron Man is about.”</p>\n<p> Bucky felt tears come to his eyes as he stared at Stark.</p>\n<p> “Steve says you’re innocent, Barnes, but are you a good man,” Tony asked seriously.</p>\n<p> “I . . . I want to be,” Bucky said, his voice quivering.</p>\n<p> “Then what have you done to take responsibility? You would have had no reason to resist arrest and put all of those people in danger if you had gone to get help after D.C.”</p>\n<p> “That’s not his fault!” Steve stepped forward angrily, but Tony held strong.</p>\n<p> “Just stop, Steve! You’ve been running around chasing this man for years! He has had years to just ask for help. After New York, after Ultron, when you guys were sticking your heads in the sand and ignoring my fears, Rhodey took me aside and said that I needed to get help before I hurt more people. You guys blamed Ultron on me, but for the wrong reason, Steve. Ultron was my fault. Not because I was trying to prepare for another alien event. That’s a reasonable expectation considering New York and what happened with Thor in London. No, it was my fault that I let my PTSD get so out of hand that I didn’t take the precautions that I normally would when working with AI. And that makes little Miss Hydra an accessory whether you want to admit it or not. Just ask Wilson what happens when a friend puts a loaded pistol into the hand of someone with PTSD. Isn’t that right, Wilson?”</p>\n<p> Wilson looked away guiltily, not liking that he was being called out for his hypocritical treatment of the genius that supported the Avengers. He and everyone else had babied Wanda and treated Tony like he had no business being a hero. Wilson knew how the battles they fought in could impact a person, but he ignored it when it was the billionaire.</p>\n<p> “What Barnes is guilty of is hiding instead of seeking out the help that anyone in his situation should have known he needed. He should have NEVER let it get to this point. So,” Tony said, facing Barnes once more. “If you are a good man, what is YOUR CHOICE, Barnes.”</p>\n<p> Bucky looked back at the man that his best friend said they couldn’t trust. Then he looked at Steve, who would forgive him anything and would do anything to keep him from suffering. Then he looked back at the hologram that had paused with the War Machine holding Steve, a King, and the Winter Soldier—no, Bucky Barnes—at gun point to bring them all in after the rampant destruction they had caused in Romania. He looked back at Stark.</p>\n<p> “I’ll go with you. You need to know that when I was triggered, the psychologist was asking about Siberia. There is a chance that there are more Winter Soldiers there waiting to be used,” he said softly, urgently.</p>\n<p> Tony looked at Barnes and then turned towards Steve with a fury that Steve had never witnessed on his face before. Tony was furious that Steve’s claim had been true, that he had waited and let it get to this point without taking any steps to get help. As if Steve was always the be all and end all in any situation where lives were at stake.</p>\n<p> “I have excused your incredibly selfish and ridiculous choices since D.C. No more. When this is over, you will only continue with the Avengers after every one of you has had a psychological evaluation that proves your decision making is sound. And, whether it is the Accords or not, there will be a reckoning, Cap. You cannot be the one making these decisions anymore. You have no idea how to use the infrastructure that was at the disposal of SHIELD and that an average nation keeps at the ready. Your ideas are isolationist and absurd. News flash, Captain America. You didn't really punch Hitler and you didn't single-handedly win WWII. That you didn’t immediately bring this to someone with the capabilities to get there faster is just stupid. Barnes is coming with us. I’ll see that he is represented fairly and that he gets treatment for his issues, but this can’t continue.”</p>\n<p>“What’s this about, Tony,” Steve asked, crossing his arms as he and Nat sat down at the conference table. Tony had asked them to drive up from the Compound and meet at the Tower (Stark Tower once more—and they would need to talk about that before leaving today).</p>\n<p> “I have something to show you before we begin. Three things actually. The first is this.”</p>\n<p> Tony passed over a report, making sure that it went to Nat before Steve. He slid a second file over immediately after and then crossed his own arms as he sat back in his seat.</p>\n<p> Nat read for a few minutes before looking back at Tony, cocking her head and then passing the file over to Steve.</p>\n<p> “This is about Ultron,” Steve asked, flipping haphazardly through the report, much too fast to actually be reading the information.</p>\n<p> “It is,” Tony nodded. “It basically says exactly what I told you guys. Bruce and I were no where near an interface. My technology was highjacked by the scepter, or an entity in the scepter, which now resides in the Vision. Ultron was neither my program nor my technology, rather it was information that was residing in the stone as implanted by Hydra through what appears to be about two years of research—that Wanda Maximoff took part in.”</p>\n<p> Steve sighed, and then stared hard at Tony.</p>\n<p> “I know that Ultron was an accident, Tony. I know that you didn’t set out to destroy an entire city. I know enough about you to know that you wouldn’t purposely try to hurt people, but putting the blame on Wanda is not going to take away your guilt.”</p>\n<p> “You misunderstand, Steve. This isn’t about taking away my guilt. It is about doling out consequences for what has happened.”</p>\n<p> “And what consequences are you facing, Tony,” Nat asked softly.</p>\n<p> “Well, besides the fact that the Avengers were seeking to intrude on my research and development of various technologies that are ABSOLUTELY necessary to prepare a defense for what is still out there, I was looking at possible jail time in addition to several hundred thousand dollars in fines above and beyond what I’ve already donated to see to the rebuilding efforts for Sokovia. I was looking at being removed from my alumni-student mentor positions with MIT, which I take very seriously. And I was looking at losing my license as an engineer . . . permanently, as a result of misconduct in the field with sever collateral repercussions. The findings in that report as well as what I’m about to show you changed all that—though I have agreed to stop all personal production of my work barring communications for SI until I’ve undergone treatment for PTSD,” Tony added. “Fri, if you would.”</p>\n<p> “Of course, boss,” the AI responded, and a large hologram of Tony’s position in the battle at Strucker’s base came up.</p>\n<p> “What’s this,” Steve asked, looking confusedly at the fight taking place. He actually hadn’t seen any of Tony’s footage from that battle.</p>\n<p> “Do you watch the footage that War Machine and I provide after missions, Cap,” Tony asked, a subtle reprimand present.</p>\n<p> “If I have time,” Steve responded, but it was clear that the answer was no.</p>\n<p> “Right,” Tony responded, rolling his eyes. “Well, here’s the gist of it, Cap. Maximoff wasn’t exactly honest when she apologized to everyone for getting in their heads. Well, rather she WAS honest, but her apology didn’t include everyone that she should have apologized to. You see, she got in my head first,” Tony said, and the footage began to roll once more.</p>\n<p> The three of them watched as Tony moved up to the scepter and informed Thor that he had found the artifact. They then watched as Tony looked over the data and technology from New York that Strucker had clearly been manipulating. It was at that point that Maximoff moved into the field of vision and the red began to flow from her fingers into to Tony’s eyes. </p>\n<p> His response was dramatic. Her jerked away, clearly upset by what he’d seen, grabbed the scepter and rushed out, trembling and eyes rolling like a startled horse. He looked, quite frankly, insane in that moment. Steve grimaced, but Nat was stoic as they watched.</p>\n<p> “We’ll speak to her,” Steve said seriously, sitting up and giving Tony a reassuring look.</p>\n<p> “That’s not all. Once I recovered this, I went looking for what I could from the base,” Tony said, and a different image was raised.</p>\n<p> The Maximoff’s stood side by side. Pietro was watching as Tony moved to the scepter and reached for it. Wanda was smiling like a lunatic. </p>\n<p> “You’re just going to let him take it,” Pietro asked in an angry, though garbled voice.</p>\n<p> “Wait,” she said, and her voice was no more reassuring than the face that was projected. “He will destroy himself . . . and the Avengers with him,” she added, giving him a twisted grin.</p>\n<p> Tony stopped the footage.</p>\n<p> “There are a few things to discuss here. First, Maximoff was very obviously involved in my actions with the Ultron AI and the scepter. She wasn’t just his hench-woman, she had an active roll in his creation that she kept quiet. Maybe it was to protect herself, but it could have just as easily been to see me suffer further now that her original revenge scheme fell through. I won’t trust anything that she says on the matter since she didn’t come forward when we settled her into the Compound,” Tony said.</p>\n<p> “Tony,” Steve began, but Tony held up his hand to stop Steve.</p>\n<p> “I’m not finished. Part of her installation as an Avenger revolved around her expressed belief that she was not working for Hydra, but had come into the fold to work as a SHIELD agent. Cap, I’ve got videos of Maximoff clearly torturing more than just enemy agents. Hydra picked up innocent victims in the area for her to . . . train on. She tortured and murdered hundreds. Whether it was for SHIELD or Hydra no longer matters. As I said, this is about consequences.”</p>\n<p> “What are you talking about, Tony,” Nat asked, sitting forward, and Tony knew that she had figured out that something was up.</p>\n<p> “I called you here for another reason. Wanda Maximoff is being picked up and taken for trial as we speak,” Tony said softly. “This is non-negotiable. Not only do I have a very good reason to refrain from giving that woman any assistance, what I found from her time with Hydra would be more than enough to convince me that she deserves whatever she gets. Steve, you may hate what I’ve done with my life and how I see the world, but even you admit that my intentions have always been good. That is clearly not the case with Maximoff. Her intentions have never revolved around the patriotism that you try to attribute her with. She will do anything—lie, cheat, steal, murder—to achieve revenge. It’s not enough for her to want to do better now. She has to pay for what she’s done first,” he added.</p>\n<p> “And what does this mean for the Avengers,” Nat asked, clearly accepting what Tony had said. She was clutching Steve’s arm with an iron grip, her nails drawing blood as she tried to force him to remain still.</p>\n<p> “You have a choice. You stand with a willing volunteer for torture and murder, or you let Maximoff reap what she has sown. I will not support her. So, if you do—then our time together is at an end.”</p>\n<p> “That’s fair,” Nat said with a nod.</p>\n<p> “Nat! Wanda put her trust in us!”</p>\n<p> “Steve,” Tony said, sitting forward. “I know you don’t like me much. I’ve done all I can to help you feel at home despite our differences, but I hope you know . . . I’ve put my trust in you as well. Will you betray me now,” Tony asked.</p>\n<p> Steve stared at the brown eyes that were swimming with something on the edge of being broken. He swallowed and looked at Nat. Something that she saw in his gaze made her eyes go wide and round—a tell that he had never seen from her before.</p>\n<p> Then Steve looked at Tony and reached for his hand.</p>\n<p> “You’re right.” Tony smiled, but it slowly dropped as Steve continued to hold his hand and stared at him with something more than what this conversation was about. “Tony, there’s something I need to tell you.”</p>\n<p>“What is it? What is it,” Rogers asked, breathless as he rushed into the control room that displayed all of the Wakandan security information.</p>\n<p> “Yes, brother,” Suri sneered, completely disgusted by the decisions her brother had made since the death of their father, a real Wakandan king. “What is it?”</p>\n<p> T’Challa stood gaping as the whole of Wakanda was surrounded. Every inch of the border was surrounded by various armies. At the forefront, and the truly concerning factor, was an army of Iron Men armors.</p>\n<p> “It’s the Iron Legion. But they’re a search and rescue force, and Tony’s never made so many,” Rogers said as they looked on at the shining army that headed the enormous force outside their shields. The legion stretched as far as the eye could see. Steve knew that they were likely being remotely piloted, but he also knew from watching Jarvis and Friday that they were just as dangerous as Tony—in fact, they would likely hold back less than the genius would.</p>\n<p> “Our sensors indicate an array of weapons . . . weapons that should not be in existence. This technology, no one has this technology,” Suri said, distraught.</p>\n<p> “What have you done,” T’Challa asked angrily, taking an aggressive step towards the Captain. “They could not have found us. What have you done?!”</p>\n<p> “I just sent Tony a letter and a way to contact me. I couldn’t leave it like I did,” Steve said plaintively.</p>\n<p> Suri and T’Challa both groaned.</p>\n<p> “It was a burner phone. There’s no way to track it,” Steve said quickly.</p>\n<p> “There is if you’re Tony Stark . . . idiot,” Suri hissed.</p>\n<p> “It’s fine. It’s fine,” Steve said hurriedly, running his hands through his hair in agitation. “You said to let them come,” he added accusingly.</p>\n<p> “And they did, didn’t they, brother. You thought we could stand against the whole world? Even our technology cannot withstand the sheer numbers that wait at our door!”</p>\n<p> “They’ll never get passed our main shield,” T’Challa said confidently.</p>\n<p> “Your highness,” a technician said meekly as he turned to face the king. “The outer shield has fallen.”</p>\n<p> “WHAT! That’s impossible. Not even Tony Stark,” T’Challa began.</p>\n<p> “Imbecile! Of course, he can, brother! He simply never had the reason to try before now.”</p>\n<p> “Watch your tongue, Suri. I am still your king.”</p>\n<p> There was a tense silence.</p>\n<p> “Not for long,” she said confidently, her back straightening. “You have been selfish and arrogant, a disgrace to the memory of our father. And you are raining destruction down on our nation. We will have to give them something. And we will.”</p>\n<p> T’Challa and the Captain looked on in outraged betrayal as Suri gestured to the Dora in the room. To T’Challa’s shock, they looked at one another, Okoye nodded, and then surrounded T’Challa and Rogers.</p>\n<p>**<br>\nSteve struggled against the cuffs that held him securely as he was marched towards the convoy that would transport them back to Europe. T’Challa was beside him, also in cuffs, as the princess reassured the Accords Council representatives, that included Tony Stark, that his immunity was in the process of being revoked, his entire rule as king of Wakanda at an end.</p>\n<p> “You can’t do this,” Steve said, though he stopped abruptly when Tony stepped around a corner to address him.</p>\n<p> “You’ll find that we can. I tried to warn you what was coming, but you refused to listen. And now, here we are. Only this time, instead of collapsing a secret, spy organization, you’ve managed to sink an entire, secret nation,” Tony added, rolling his eyes.</p>\n<p> “Tony, please. Don’t do this! We were only doing what we thought was right,” Steve said loudly, bracing his feet as a soldier shoved him forward. </p>\n<p> Tony looked at Steve sardonically as he threw that stupid line from his self-serving non-apology letter back at Tony.</p>\n<p> “That’s right, Rogers. We can only do what we think is right. That’s all we should do. That’s what you said, right?”</p>\n<p> Steve smiled with a bit of panic behind his eyes.</p>\n<p> “Yes! Yes, that’s it exactly!”</p>\n<p> “And you’re right, Steve. The part that you forgot to mention is that once you’ve taken a stand, you have to be prepared to pay the consequences for the position you took. It’s time to pay the piper, Steve, and don’t worry. I’ve already replaced all of those locks.”</p>\n<p>Tony picked up the file and began flipping through it “nonchalantly” while, coincidentally, taking in every detail. He was a few pages in when Fury walked in and plucked the file from his hands.</p>\n<p> “I don’t think I want you looking at that. Now this? Take a look at this.” Fury gave Tony a loaded look and handed over a file. Tony stared at him with a blank expression for a moment before shrugging and taking the file.</p>\n<p> “What’s this,” he asked casually as he flipped it open to begin skimming. He was met with a picture of himself.</p>\n<p> “That’s your assessment for the Avengers Initiative. Just keep reading,” he answered smugly. Tony stared back at him a moment longer before he went back to the file.</p>\n<p> “Interesting. Narcissistic. Doesn’t work well with others. Final analysis . . . Iron Man: Yes, Tony Stark: Not Recommended.” Fury and Tony briefly participated in yet another stare down before Tony finally responded. “Really. And who did this assessment.”</p>\n<p> “Agent Romanoff acted as profiler,” he said with a smug smirk.</p>\n<p> “Hmm,” Tony hummed. He looked at Fury a moment longer before tossing his phone on Fury’s desk. “Jarvis, pull up our report on Romanoff.”</p>\n<p> Fury looked briefly alarmed, or as alarmed as he was ever likely to look before Jarvis began his report with a mocking lilt.</p>\n<p> “Of course, Sir.” An image of Romanoff flashed up and began rotating above the desk in an eerie blue light just as Romanoff opened Fury’s office door and began her signature, seductive catwalk into Fury’s office. The smirk fell right off her face as soon as she caught onto what was happening. Jarvis had just finished rattling off her aliases—all of them, with accompanying dates. “Kidnapped as a young child and trained by the Red Room for stealth, infiltration, hand-to-hand combat, and munitions, with rudimentary skills in hacking.” Tony could have sworn that Jarvis had scoffed. Huh, that was new. </p>\n<p> “Shut it off,” Romanoff hissed, reaching for Tony and slamming him backwards onto the desk. Barely a moment later there was the sound of a repulsor firing up. Romanoff looked at Tony in surprise as she felt the tell-tale heat of the repulsor against her gut from one of Tony’s gloves.</p>\n<p> “I’d think you’d like to finish your own assessment, Romanoff. It’s a bit more . . . honest . . . than you’re used to. “Continue, Jarvis.” Tony held still in a stalemate with the redheaded spy as Jarvis began again.</p>\n<p> “Of course, Sir. As I was saying. Agent Romanoff began her career as a spy and assassin for the KGB before transitioning into various black market, for-hire organizations. Her kill count is upwards of 575, Sir. Perhaps the Sales Associate of Death,” Jarvis remarked and Tony laughed while Romanoff seethed, still holding him in a firm grip against the desk. “She joined SHIELD in 1991. Agent Barton was sent to take out the Black Widow--who had become a dangerous, international threat to World Security by passing secrets to and from multiple countries. Agent Barton made the executive decision to bring Romanoff in for rehabilitation. She was accepted on Handler, Phil Coulson’s recommendation in exchange for giving up any remaining secrets and . . .” There was what could only be described as an uneasy pause. </p>\n<p> “Jarvis,” Tony questioned the hesitation.</p>\n<p> “Sir, it appears that Director Peggy Carter’s last decision before retirement was to accept the Black Widow. Romanoff was a part of a deal Director Carter made with Obadiah Stane to cover up the murders of Howard and Maria Stark in exchange for maintaining funds for SHIELD indefinitely after Howard Stark’s death. I’m . . . so sorry, Sir.”</p>\n<p> Two things happened at once. First, Romanoff jerked back when confronted with a look of utter rage from Tony Stark who immediately pushed the woman off of him. At the same time Fury and Romanoff turned at a scream of outrage from the doorway. Apparently, the good Captain had made his way back to Fury’s office from their latest mission, and in a feat of actual strategy that Tony wouldn’t have previously think him capable, didn’t announce his arrival. Instead he eaves dropped on Jarvis’s report.</p>\n<p> “Didn’t expect to see any of SHIELD’s or the lovely Widow’s footage, did you, Cap,” Tony sneered. “Here’s a hint. Next time you want to judge someone off a profile, make sure it’s not written by a sociopath named after an arachnid known for attracting and killing its mates. It might be indicative of a personality flaw.” </p>\n<p> “Peggy wouldn’t,” Rogers shouted, completely unconcerned with Tony’s jab at the Widow or ‘the footage’ surrounding Tony Stark.</p>\n<p> “Well apparently, she did. Jarvis is reporting on information found in SHIELD’s servers. You didn’t think that I wouldn’t find everything about you the moment you snuck into my home like some kind of murdering stalker, did you, Nick” Tony asked angrily, turning abruptly towards Fury. “Guess what, Fury. I bested your little spy’s level of hacking in 2nd grade--when I was 4. You don’t have secrets anymore. Any of you,” he added with a loaded look at Widow.</p>\n<p> “She wouldn’t,” Rogers whispered, falling to his knees, clearly heart broken.</p>\n<p> “Sir, Stane was not the only Hydra connection. There are a series of names and initiatives linked to various terrorist organizations that branch out under the original umbrella of that group.”</p>\n<p> Tony’s repulsor immediately fired up once more and he raised his arm while positioning himself so that he had a clear shot at everyone in the room.</p>\n<p> “Any present, Jarvis?”</p>\n<p> “Stark,” Fury hissed angrily.</p>\n<p> “Shut your ignorant mouth, Fury,” Tony yelled. “Jarvis knows more than me, but I’ve been in these files myself. The reason you can’t tell the difference between yourself and your infestation problem is because there IS NO DIFFERENCE! Bull Shit by any other name still smells like crap.”</p>\n<p> “Stark, I need you to calm down,” Widow said, creeping towards Tony slowly with her hands up in what was probably supposed to be a calming gesture.</p>\n<p> “And I need you to drop dead.” Tony used his repulsor glove on a lower setting and blasted the Widow in both legs, sending her to the ground with a yell. Fury immediately drew a gun and pointed it at Tony. Rogers just continued to sniffle pathetically.</p>\n<p> “Try to shoot me and you’ll lose your other eye,” Tony sneered.</p>\n<p> “You’ve gone rogue, Stark. We can’t allow that.” Fury’s jaw clenched as he stared Tony down, but Tony knew Fury couldn’t kill him outright. He’d just saved New York and stopped an alien invasion practically on his own. This whole thing had started as a ploy to draw him in because SHIELD needed him. Hell, so did Hydra.</p>\n<p> “It’s cute that you think you have any say in the matter, Fury. Jarvis,” Tony called, his repulsor glove aimed at Nick in a stale mate.</p>\n<p> “Yes, Sir?”</p>\n<p> “Send out a call to bring in all agents on active missions.”</p>\n<p> “Yes, Sir,” Jarvis replied.</p>\n<p> “What the hell do you think you’re doing, Stark,” Fury yelled.</p>\n<p> “It’s called taking out the trash, Nicky,” Tony said, with a contemptuous look at the Widow and Rogers, both sniveling on the ground, neither self-aware enough to have noticed they were going on shady missions for a Nazi terrorist organization. What did that say for Captain self-righteous? “Burn it down, J. Everything goes as soon as we’ve got the agents on the ground.” </p>\n<p> Fury’s eyes widened dramatically and he dropped his arms as Tony lowered his. Tony strode past the group of maladjusted “heroes”.</p>\n<p> “That’s what a profile looks like,” he said, without looking back.</p>\n<p>“TONY! Where are you,” Nat yelled through the phone.</p>\n<p> Tony cringed, holding the phone away from his ear. He was sitting next to Pepper and going through some paperwork to prep for a “getting back together” vacation. He was right. A willingness to sign the Accords as a consultant on top of stepping back from the Avengers was just what she needed to reassure her of his commitment to “them”.</p>\n<p> “Romanoff, why are you yelling at me,” he sighed once he put the phone back next to his ear.</p>\n<p> “Didn’t you see the news, Stark? Steve, Sam, and Cap’s friend Bucky Barnes just tore off on a rampage through Bucharest. They’ve been arrested!”</p>\n<p> Tony stared at Pepper, who rolled her eyes and went back to her paperwork at his shrug.</p>\n<p> “Man,” Tony said slowly. “That really sucks.”</p>\n<p> “STARK!”</p>\n<p> “Look Romanoff, I don’t know what you expect me to do?”</p>\n<p> “Get over here and start fixing it, Tony!”</p>\n<p> Tony and Pepper both looked at each other with wide eyes, since Romanoff was screeching so loud that Pepper could hear everything despite the lack of speakerphone. Tony burst out laughing.</p>\n<p> “Ha! That’s cute. Why would I do that?”</p>\n<p> “Look, Stark. I’ve got Wanda and the mess in Lagos to deal with, and now this? I can’t do everything.”</p>\n<p> “I’m still not seeing what this has to do with me.”</p>\n<p> “Use your connections Tony,” she sighed through the phone. “I need you to start talking to people in the government to get this ironed out.”</p>\n<p> By now, Tony had clicked on some news coverage of Steve’s little jaunt through Bucharest. It’s was eerily similar to the devastation he’d left behind in Lagos. Only this time it looked like he’d be taking down his best buddy (that Tony knew he had been looking for)—and maybe the king of a country! That was some impressive collateral!</p>\n<p> “No,” Tony said simply, after a lengthy silence on Romanoff’s end.</p>\n<p> “No. What do you mean, no?”</p>\n<p> “Do you remember Lagos, Romanoff?”</p>\n<p> “Of course, I do,” she said, and Tony was certain he heard a muttered idiot. When and why had ALL of the Avengers convinced themselves that one of the only two geniuses on the team was an idiot? Those were some impressive blinders.</p>\n<p> “I’m thinking you really don’t. I got a call from the President of the United States asking me what in the hell you guys were doing in Lagos and why they hadn’t been informed. So, I, of course, asked you guys what in the hell you were doing there and why neither Hill nor any governmental agencies had been informed. Do you remember what Steve said?”</p>\n<p> There was silence.</p>\n<p> “He said, and I quote—because eidetic memory—you’re not an Avenger anymore, Stark. It’s none of your business. We’ve got it handled. And then he hung up on me. You were there. I know you know this, because there was a distinct lack of you saying anything. And handling the Maximoff thing . . . well, let’s just say your spy cred doesn’t seem to help you much in the political arena because last time I checked, her Visa was revoked for participating in terrorist activity and she was extradited to the Nigerian authorities,” Tony finished. Pepper snickered.</p>\n<p> “What” Romanoff shrieked over the phone. “When did this happen?”</p>\n<p> “Just after the meeting with Secretary Ross—that I attended purely on his invite since, according to you, I’m not really an Avenger,” he said.</p>\n<p> “Why didn’t you do anything?!”</p>\n<p> Tony blinked, remembered he was on the phone, and said “You said I’m not an Avenger and you had it handled.”</p>\n<p> “Stark! I should have known you would manage to screw this up.”</p>\n<p> “I haven’t screwed anything up, Romanoff, because I haven’t DONE anything. And that’s precisely what I’m going to continue to do . . . because, you know, I’m not an Avenger.”<br>\nTony hung up once Romanoff’s rant devolved into further shrieking.</p>\n<p>**-What about Steve?</p>\n<p> Steve was handcuffed to a table in a conference room. Sam was as well, but the King in the cat-suit had promptly been escorted out after reminding Ross (little Ross?) of diplomatic immunity. Bucky had been taken to a more secure room to see a psychiatrist. The wait was driving him nuts! Where was Tony? He should already be here fixing this.</p>\n<p> About 10 minutes later, Nat walked in dressed in an “I’m an executive today and do secretarial things” outfit. Finally.</p>\n<p> “Where are you on getting us out of here,” he said with a sigh. Nat raised her eyebrow.</p>\n<p> “I’m not. I don’t have those kind of connections. All of my connections are in the underground—black market stuff, Steve.” She crossed her arms and legs. “I’m here to advise you not to say anything until you get a lawyer—that Tony’s not paying for, by the way.”</p>\n<p> “What? Well, why isn’t Tony here working on this? I know he’s got political connections,” Steve huffed. “And why wouldn’t he pay for our lawyers?”</p>\n<p> “After Lagos, when he was griping about the costs of having to clean up our messes when we could have just notified Hill, you said that he wasn’t even an Avenger anymore; that he didn’t need to worry about it. Remember?” Inside, Nat was seething. This was all because Steve had mouthed off at the little brat instead letting her cushion whatever blows were necessary to keep Stark pliable.</p>\n<p> “I meant we didn’t need Iron Man,” Steve yelled. The room fell silent as Nat, Steve, and Sam stared at each other in surprise.</p>\n<p> “Shit,” Steve said just before the lights went out.</p>\n<p>Bucky clapped Steve on the shoulder as Sam stood by watching.</p>\n<p> “I’m gonna miss you,” Bucky said, swallowing thickly.</p>\n<p> “What? Why?”</p>\n<p> Steve and Bucky both startled a bit and turned to see Rhodes squinting suspiciously at the pair.</p>\n<p> “Uh,” Bucky began.</p>\n<p> “Oh. Oh! Oh, FUCK NO,” Rhodes hissed angrily.</p>\n<p> Steve cringed, but then stood tall in his usual self-righteous pose.</p>\n<p> “Bucky and I are just having a private conversation, Rhodes,” he said pompously.</p>\n<p> “Hand the particles over RIGHT NOW,” Rhodes yelled, drawing the attention of several others, including Pepper Stark, holding Morgan as she sniffled quietly against her shoulder.</p>\n<p> “Rhodes.”</p>\n<p> “How DARE YOU! You drew Tony back into this mess just like you ALWAYS DID, and now you’re gonna stand there, smile with your best assassin pal—who you ONLY got back due to Tony and his time travelling theory—and what . . . go back and get your happily ever after? With Carter, right? Fuck Tony. Fuck Tony’s widow, Pepper, who you had the sheer audacity to stand behind at Tony’s FUNERAL.” Rhodes looked at Bucky Barnes, who everyone ALWAYS felt so sorry for. Everyone was ALWAYS so concerned because he was the one screwed over again and again. Never mind that Rhodes had watched him raise that stolen rifle and point it at Tony for hitting the man that had abused his trust and lied to him FOR YEARS. “FUCK Morgan. Just one more orphaned Stark, huh Barnes. No one gives a fuck about them. Not like you owe them or anything?”</p>\n<p> Bucky looked away guiltily.</p>\n<p> “If you think you’re gonna use those particles to go back and RIP APART the timeline,” Rhodes began.</p>\n<p> “Bruce said it won’t impact anything. Bruce said it was safe,” Steve yelled.</p>\n<p> They had moved closer together, standing chest to chest as if they would fight at any moment while the remaining heroes stood around awkwardly.</p>\n<p> “It should be ok,” Bruce said uneasily, looking at Steve with pity.</p>\n<p> “Then you won’t mind if I take that,” Pepper said, maneuvering in between Rhodes and Steve easily as she snatched the particles from his hand.</p>\n<p> “What! No,” Steve said just as Pepper stepped back behind Happy, Rhodes, Peter, and Nebula, who all had their arms crossed and stood before Steve like a brick wall.</p>\n<p> “I’d say you owe Tony this, Steve,” Pepper said. “Wouldn’t you?”</p>\n<p> “Why should he get this,” Steve yelled angrily, before he stepped back in surprise. Pepper had just hoisted little Morgan Stark up on her hip once more. The little girl stared at Steve with big, teary eyes—her father’s eyes.</p>\n<p> “Why doesn’t he want Daddy to come back,” she whispered softly, her little voice hitching.</p>\n<p> “How many times did you and your MIGHTY TEAM call him selfish, Captain,” Happy sneered.</p>\n<p> “That’s enough,” Pepper said with one more, haughty look at Steve before she set Morgan on her feet, grabbed her hand, and walked away.</p>\n<p> Steve turned and walked away, Bucky’s arm around his shoulder.</p>\n<p> Rhodes watched until he turned towards the direction Pepper had gone. Steven Strange stood there, smiling serenely with his arm around Peter Parker’s shoulder.</p>\n<p> “14,000,605 futures,” he said with a real smile, “and only ONE where we win.”</p>\n<p> “The world loses without Tony Stark,” Peter smiled. “Cap can go enjoy life with the Winter Hobo in peace, and get over it.”</p>\n<p> “Eh,” Rhodes shrugged. “He’s always got the niece if he gets desperate. What’s the difference?”</p>\n<p>Sam stood in front of the locked, chain link fence and sighed, rubbing slightly at his forehead.</p>\n<p> “What happened,” Wanda screamed, red tinging her hands and her hair beginning to fly around her. Bucky flinched back and stepped away from the witch.</p>\n<p> “Tony,” Nat sighed. “I had hoped he could let his ego go for once, but,” she trailed off shrugging.</p>\n<p> In front of them, the compound was nothing but rubble.\n</p>\n<p> “How is this about his ego,” Sam asked, completely sick of this bullshit. He had followed Steve, sided with him continually, and usually into the dumbest situations (like the chase for Barnes where they killed and injured several bystanders all for Barnes to be . . . simply arrested. So much for the shoot on sight orders. Honestly, between Nat and Sharon Carter, Sam was not at all impressed with the espionage capabilities of his country.</p>\n<p> He had sat back and judged Stark, giving him that STUPID ultimatum—“OK, but you have to go alone.” Right. Stark went alone. Then Steve and Barnes completely destroyed the man’s suit (and any way to communicate), left him battered in the snow, and wandered off together as if his life didn’t matter all because he reacted to a traumatic situation in a way that Sam would have completely expected. </p>\n<p> Wasn’t that an eye opener, when both videos had been released to the public? Barnes killed the Starks. Tony watched while Steve side-eyed the genius like he was a loaded weapon instead of a human, a teammate, and a friend. “OK, but you have to go alone.” Stark was the only one that went into that situation alone, and he got betrayed even more than the years of searching for his parents’ killer on his dime that Captain America had done. How’s that for your favorite super hero, Howard Stark?</p>\n<p> It was that point when Sam had to step back and examine who and what the Avengers were. Steve said the safest hands were their own, but that was clearly only true if you were one of the select few that had the Captain America stamp of approval. Steve’s hands were NOT the safest for Rhodes (a decorated hero that had been a role model for Sam in the Air Force), Tony Stark (the man who made their gear and a patriot whose weapons had protected soldiers for years before the Stane incident), and even that Spider Kid (Steve had dropped a shipping container on that kid without even knowing if he could handle it and walked away with a quippy remark while the boy began to slip and struggle under the weight!—watching the footage of the Leipzig fight had been an eye-opener as well since he could see the other side had clearly pulled punches while Steve and their team were doing all they could to put them down HARD).</p>\n<p> What did he stand for? He was a Vet, and Captain America was an American hero, but Sam was also a counselor. He had a background in dealing with trauma. And he didn’t like what he was seeing once he examined the patterns of Avenger behavior that he had also participated in.</p>\n<p> During the Ultron incident, Tony had been lifted by his throat by a teammate while the others stood by and watched (including Tony’s friends). Bruce didn’t say a word; Thor didn’t acknowledge that he and Steve had given Tony the go ahead to run tests on the scepter. They just treated him like a villain. Later, when everything was over, Tony gave them the story of Wanda and her part in Ultron, even showing footage he had found of right before he had taken the scepter. Wanda had confirmed it with a shrug and then gone on to blame Tony for the death of her parents because of a missile that his company had made (and maybe sold legally to a government that was an American ally!). Then she had the nerve to blame him for the death of her brother despite her own part in the creation of the robot. No one pointed out this hypocrisy. No one pointed out that Tony’s intent behind Ultron had been nothing but good while Wanda’s part had been decidedly malevolent. In fact, Steve agreed with the Sokovian girl and then proceeded to tell Tony that he owed to her to help get her out of legal trouble and provide a new home since Tony had destroyed hers (not Ultron, or even the girl who had masterminded the event with her negligent attempt at misguided revenge).</p>\n<p> And Sam had simply nodded along like he didn’t know about the guilt that Wanda had heaped on the genius’s shoulders. He simply nodded while Steve stole away Tony’s friends, his family, and replaced the genius with the girl that openly admitted that she not only wanted to kill Stark—she wanted it to be slow and painful. Steve had made Tony hand the girl the keys to the kingdom as the others snidely pointed fingers at him, as if Wanda hadn’t manipulated the entire thing. Sam knew how bad PTSD was, but to add Wanda’s powers with an element of suggestion as well. Tony never stood a chance.</p>\n<p> So, Tony stepped back and became nothing but a pocket book. Tony was a pocketbook for Nat, Steve, Wanda, and (he hated to admit his part in it, but . . .) Sam, who all helped Steve in his search for Bucky Barnes. Nat and Steve had known all along they were being funded by a man who still struggled to accept his parents’ death—but his feelings clearly didn’t matter. He was less than a person to them. To Nat, he was a mark. To Steve, he was a resource, and later, a threat. And Sam had condoned every second each time he never stepped up to stop the victim blaming and gas-lighting that he regularly witnessed. Who had he become?</p>\n<p> “I’m not sure what you mean, Sam,” Nat replied in that pseudo-therapist voiced she liked to use. Like she mediated shit. Nat didn’t mediate, she manipulated.</p>\n<p> “I mean, did you really expect that he was going to provide a place for us to live and work on his dime? Nat, come on. You turned on him, and let Steve and Barnes go to later beat the ever-loving shit out of the man. He got Wanda off the hook for Neo-Nazi terrorism and war crimes after Ultron AND gave her a place to live while we kicked him to the curb so she would be “more comfortable”. Then she sent her boyfriend through several floors and damaged the compound before attacking Stark with a vengeance alongside Steve and us. Did you really think he was going to bother fixing the damage she did? That he would pay for you guys to betray him again and again?”</p>\n<p> “Sam, Bucky is innocent. You know this,” Nat tried.</p>\n<p> “Yeah. Steve might have mentioned that once . . . or a million times. That doesn’t mean that Stark needs to provide a place for him to live and take care of his every need. What about Stark’s needs?”</p>\n<p> “Where is this coming from,” she asked, cocking her head like a confused puppy.</p>\n<p> “Be honest, Nat,” Sam sighed. “It’s not ego. It’s self-preservation. We’re the worst things that ever happened to Stark, and it was only a matter of time until he realized it.”<br>\nAfter a moment, Clint spoke up, a frown on his face.</p>\n<p> “You know,” he said. “Bruce and Rhodey loved to tell the story of the time that Tony met Thaddeus Ross in a bar. Ross raved about how the place was his favorite and how he went there almost every day to relax and enjoy life. Tony bought the bar and then had it bulldozed as a “Fuck You” to Ross.” Clint turned to look at Nat and Steve. “I got to say, Nat. Sam’s right. Doesn’t sound like ego. Sounds more like a “Fuck You,”</p>\n<p>“My son’s dead,” The woman hissed, her eyes blazing, “And I blame you,” she finished, slamming the picture against Tony’s chest.</p>\n<p> Tony swallowed, and slowly closed his eyes as the woman began to walk away.</p>\n<p> “OK, but do you also BLAME Tony for saving that young man’s life, and YOURS in New York? And was he supposed to just ignore what he saw when he did save New York, stick his head in the sand, and wait for an invasion to happen again on a grander scale—because his innovations MIGHT JUST MAYBE cause problems when they never had before,” Pepper Potts asked as she strode up to the woman who spun at Pepper’s comments.</p>\n<p> “How DARE you,” the woman began.</p>\n<p> “Save it. I know who you are and what you do. Will the request for money be coming next week or the one after,” Pepper asked dangerously.</p>\n<p> “Pepper,” Tony started, not shocked by her defense of him, but certainly horrified at how she was speaking to a grieving mother.</p>\n<p> “No, Tony. You ALWAYS do this. You take the blame for EVERYTHING, and then run completely off the rails trying to fix things that were NOT your fault.”</p>\n<p> Pepper turned to the woman.</p>\n<p> “First, the UN investigative task force found that neither Tony nor Dr. Banner were responsible for Ultron because they could not have foreseen how alien technology might possibly corrupt the MOST advanced computer security systems on Earth. Additionally, Tony’s compromised state (and I’m not talking about his PTSD, I’m talking about the mind manipulation that was later discovered along with the video files of the mission where the Avengers re-acquired the scepter from a Neo-Nazi terrorist organization) was a mitigating factor that he could have in no way prepared for or avoided.”</p>\n<p> Ms. Spencer stood straight and hissed like an angry cat.</p>\n<p> “Second, and more important . . . Mrs. Mariah Jameson, you are not the mother of Charlie Spencer, and this is an actor’s head shot, Tony; and I would have expected you to notice that! This is “Natasha the underwear model/legal assistant resume” all over again! Charlie Spencer doesn’t exist, as Friday notified me in the short minute and a half that she had to listen to this tripe because you muted her AGAIN. This is a ploy for money of the variety that SI constantly fends off because YOU WILL NOT ACCEPT that you are not responsible for everything that goes wrong in the world, Tony Stark!”</p>\n<p> Tony gaped and the woman blanched.</p>\n<p> “I’m Ms. Spencer,” she yelled.</p>\n<p> Pepper rolled her eyes and pulled up the image of the man from the picture. Except he was on stage, and clearly acting. It was a picture for an upcoming stage production in one of the lesser- known New York theatres.</p>\n<p> “You can see yourself out OR I can have you removed Ms. Jameson. And you’ll be hearing from our lawyers,” she added with a smirk as the woman glared, but hurried off.</p>\n<p> “Ultron wasn’t my fault,” Tony said.</p>\n<p> “Is that a question or a statement, Tony? Let Steve and the others blame you all they want. Put that manipulative little bitch up in the Compound like you owe her anything because of some adolescent, sordid revenge story—like there is ANY excuse to sign up to be a Neo-Nazi—but DO NOT make any more decisions for the Avengers based on their STUPID, faulty reasoning. YOU should know better, Tony Stark. If you aren’t willing to say anything to Bruce about being to blame for Ultron, then neither are you. And it’s just as much the Avengers and SHIELD’s fault for ignoring your very valid fears about how to handle future invasions.”</p>\n<p> “It’s not my fault,” Tony said more emphatically, and Pepper smiled.</p>\n<p>*****<br> Tony signed the Accords. He did not ask Vision to watch over Wanda in the Compound after Lagos because she is an adult and is responsible for her own mistakes, not him. He did not go to Romania to help Steve, Sam, and Barnes because they are all adults, and they are responsible for their own mistakes. When Steve, Barnes, Wanda, Sam, Clint, and some Bug dude showed up in Germany, an Accords committee asked that Tony, Rhodes, Vision, and the Widow to work together to bring in the ex-Avengers that were currently aiding and abetting a known terrorist (the Winter Soldier), and bring them in for questioning as a demonstration of how the Accords might work. </p>\n<p> Tony and his team did not pull their punches. Tony took out the Witch first with a sonic device and then placed metal cuffs on her hands and feet. Rhodey easily took down Barton—he shoots a bow and arrow for crying out loud! Tony used his laser to sever one wing from Sam’s falcon wings before catching him and cuffing him as well. Once Steve and Barnes made it to the closest jet and Widow let them go, Rhodes easily knocked out Widow with a knock out dart and cuffed her while Tony used an EMP on the jet to stop it before it made it out of the hanger. Tony used his sonic paralyzer (despite REALLY hating that thing) and cuffed both super soldiers. The task force brought everyone in, and Tony went home. Later, when they asked where the bug dude was, he said “Who?”</p>\n<p> Pepper was quite happy with how things turned out. She treated herself to a pair of shoes and got engaged to the man that was FINALLY starting to get it.</p>\n<p>“What are these,” Tony asked, rubbing at his chest. The reactor issue had been fixed, but everything tasted like coconut and he could actually FEEL the power pumping his heart!</p>\n<p> “This is for you to sign,” Pepper said, passing over a tablet, “and THESE are the resumes for personal assistant. If I’m going to be CEO, you’re going to need a new P.A.”</p>\n<p> Tony casually watched as the sultry eyed red head leaned over, her breasts practically toppling out of the white blouse that was plastered against her chest. While Tony could appreciate a beautiful woman, bimbos were for one thing—and he had never let them anywhere near his company. Not even when he had been a fresh-faced orphan taking over SI.</p>\n<p> The red-head smiled mysteriously at Tony as she reached across him for the tablet. Pepper was fuming next to him, glaring at Tony like he was the one that was confusing a street corner for SI. He was wearing sweatpants and a hoody for crying out loud!</p>\n<p> “I want one,” he said teasingly, looking back at the woman making eyes at him before glancing at Pepper who was practically green, but trying to play it off like a champ.</p>\n<p> Then Tony looked at the resumes once more.</p>\n<p> “Natashalie, will you come here for a moment,” Tony called out. Pepper huffed and rolled her eyes as the woman looked back at Tony, wide-eyed, before slinking her way back over to them.</p>\n<p> “Tony, no,” she said firmly, reaching for the resume, but Tony brushed her hand away.</p>\n<p> “This is an impressive resume,” Tony smiled dazzlingly, and patted the seat on his other side. The red head giggled and then sat, crossing her legs in such a way that her VERY tight skirt rose just enough to give him a flash of lacey underwear before she rested in a more “modest” position.</p>\n<p> Pepper looked ready to explode, but Tony was internally rolling his eyes.</p>\n<p> “You speak three languages. It says English, Russian, and Chinese? You know Latin? Who speaks Latin,” Tony asked incredulously.</p>\n<p> “No one; it’s a dead language,” Pepper gritted out. Next Tony would be putting the woman in the ring with Happy before stepping up to give her a boxing lesson himself. She could already see it in her mind’s eye; but Tony was anything but predictable.</p>\n<p> “And an underwear model!” Tony turned the resume long ways and unfolded it like a porn-mag spread.</p>\n<p> “What!” Pepper jumped up, appalled.</p>\n<p> Suddenly, the red head looked a little less sure of herself.</p>\n<p> “How’d that get in there? What are you having them do down there in HR, Ms. Potts,” Tony scoffed.</p>\n<p> “I never! She shouldn’t have got through the front door with a resume like that, let alone put in the stack for your P.A. As if,” Pepper huffed. “Security,” Pepper called, while Tony laughed as Natashalie opened and closed her mouth unattractively before trying a few hurried excuses that Tony ignored.</p>\n<p> Tony had known since the Obadiah incident and SHIELD’s constant attempts to meddle in his business after his return from Afghanistan that he would be seeing from the shady agency again.</p>\n<p> “Say, Natashalie, tell Coulson and Fury not to be so heavy handed next time. A little less card carrying prostitute and a little more ‘I might bring this one home to mom and dad’ maybe,” Tony laughed as the SHIELD agent fumed, suddenly realizing that Tony had spotted the disguise almost immediately.</p>\n<p>Tony stood with his arms crossed, Rhodey at his side, while Wanda, Nat, Sam, Steve, Clint, and Bucky Barnes all stood in the common room of the Compound. </p>\n<p> Wanda was glaring, red dripping from her finger-tips. Steve had his arms crossed aggressively over his broad chest with Barnes, loose, on one side and Widow on the other. Sam also had his arms crossed and was glaring, and Clint was simultaneously glaring and smirking in a way that just made him looked like a deranged DC character.</p>\n<p> “What are you doing here,” Rhodes asked, no less aggressive than the group in front of them.</p>\n<p> “We’ve been pardoned. We’re back as Avengers,” Steve said simply, and this time Nat smirked and crossed her arms.</p>\n<p> “Good for you,” Tony said with an odd look on his face. “Now why are you HERE?”</p>\n<p> “We live here,” Wanda hissed. “Now get out of our way,” she added, raising her arms.</p>\n<p> “I’m going to have to stop you there,” Tony said, holding his hand up. “I need to go over some things, first.”</p>\n<p> Steve nodded, but he still looked like Tony was dirt under his shoe. Typical.</p>\n<p> “So, Wanda, after Ultron, I felt guilty that you lost your brother even though you played an active part in Ultron’s creation by messing with my mind in Strucker’s bunker and then working with the robot menace afterwards. I decided to do you a solid, and began working on getting you a Visa and putting you up in the Compound with all bills and extras paid.”</p>\n<p> “She’s an Avenger,” Clint said angrily.</p>\n<p> “Stop. I’m speaking with Wanda now. So, Wanda. Next you decided to run around with Captain Underpants and participated in an illegal mission where you were directly responsible for the death of 12 civilians.”</p>\n<p> “It wasn’t my fault! Steve said it wasn’t my fault!”</p>\n<p> “Yep. It’s kind of a refrain with him,” Tony shrugged. “Anyways, I went to bat for you again. I agreed that you would have to be put under review and said you would stay in the Compound. Sure, I didn’t tell you personally, because you hate me, but I did ask Vision—whom you like—to stay with you and make sure everything was ok. He did . . . and you sent him through three floors of MY COMPOUND, causing massive damage to said compound, and then proceeded to go on ANOTHER illegal mission on Captain Underpants’s say so, dropped a mountain of cars on me in an attempt to, let’s be honest here, kill me despite everything I’ve done for your ungrateful ass. And now you want me to put you up AGAIN and pay for everything for you AGAIN. Correct?”</p>\n<p> “You killed my parents!”</p>\n<p> “That argument lost all credibility when you became a Nazi and killed EVERYONE ELSE’S parents . . . and kids . . . and cousins, etc. Becoming a terrorist? I want the big one? Setting an enraged Hulk loose on a civilian population? Aiding a killer robot with world destruction until you figured out—much later because you’re apparently a genius—that you are a part of the world as well? Any of this ringing a bell? Moving on. So, Black Widow.”</p>\n<p> “Tony,” she started.</p>\n<p> “Please don’t use the pseudo-therapist voice. You don’t have a degree in psychology; you’ve got a lifetime of training in manipulation. Not the same thing. Not even Wilson over there is qualified or he wouldn’t have ever been ok with you guys setting foot back in here with all of the associated trauma it presents for ALL PARTIES INVOLVED. He just wants a free-ride like everyone else.”</p>\n<p> “Hey!”</p>\n<p> “WIDOW. You’ve betrayed me not once—ie. Infiltrating and spying on my company while I was dying—not twice . . . AKA Tony Stark: not recommended . . . but three times . . . Survey says, ‘We played this wrong . . . your ego . . . yada yada yada.’ You think I’m letting you live off me again or paying for jack shit for your gas-lighting ass? I’m going to have to nope right out of that.”</p>\n<p> “You don’t speak to her that way,” Clint said, stepping up angrily.</p>\n<p> “WHY ARE YOU HERE,” Tony yelled, stepping into the archer’s face. “Didn’t you retire? What? Did Laura get sick of you and divorce you, so you decided ‘quick! better go live off the billionaire again!’ Well, no, you may not. You’re an ARCHER. That was never anything but insulting. Hey Rhodey, you now that guy, Thompson, in Human Resources?”</p>\n<p> “The one we picked up from SHIELD after Widow and Captain Stupid burned everything to the ground? The Galaga guy?”</p>\n<p> “Yep, that’s the one! He’s a great shot. Give that man a bazooka! There, problem solved. Clint, you’ve been replaced. You’re fired. Now go away,” Tony said, shewing the archer away with a flapping hand.</p>\n<p> “Now, the dynamic duo, because again, Wilson is just a glorified shadow for all things Captain America now that the good Captain has his best buddy Barnes back and doesn’t need Wilson for the sidekick anymore.”</p>\n<p> “Hey!”</p>\n<p> Rhodey rolled his eyes.</p>\n<p> “Steve, that you thought I’d pay for a place for you to live or support any other aspect of you and your work after you lied to me and used my money and equipment to hunt down the man that murdered my parents is disgusting.<br>\n</p>\n<p> Barnes, I was clearly out of line when I attacked you—but you attacked me first when I went after Steve for lying . . . because that’s SO MUCH worse than betraying two generations of a family that supported him in blind faith for years to their own cost.<br>\nMaybe you were having a PTSD moment when you defended that lying piece of shit, I don’t know. But I was having a human moment where the man whom I had just seen bash in my father’s face and choke out my mother as they both called for help was right in front of me and threatening to kill the last Stark with a rifle stolen from a Stark Jet. I think we kind of canceled each other out there for being in the wrong.<br>\nYou tried to crush my reactor, and got your arm shot off for the trouble. You double-teamed the man you orphaned alongside the man that covered it up, left me in a dead suit in Siberia with no way out and no help coming, and I didn’t hunt you down like the dog you are for that. I’m thinking we’re square. I’d be fine with never seeing or speaking with you again.<br>\nSo, can you tell me what possessed you to EVER think that it was ok to follow the man that betrayed me into my own home to . . . what? Say that I now have to house the both of you and support you for the rest of your lives.”</p>\n<p> Barnes looked away uneasily.</p>\n<p> “Either you are truly a piece of shit, or you need to start standing up to the biggest bully in the room. And . . .hint, hint, Steve . . . it’s not the 1 percenter, CCO. It’s you. Maybe the President pardoned you and said you were Avengers again, but I took over the care and feeding of the Avengers after YOU destroyed SHIELD. So, you’re ALL FIRED. Get out, and don’t come back. The President and the United States can have you, because me and the world don’t want you.”</p>\n<p>“What are you doing?”</p>\n<p> “I’m writing a fanfic,” Tony said idly as he continued tapping away.</p>\n<p> “What about,” Steve asked, sitting on the edge of Tony’s desk.</p>\n<p> Steve leaned over and tried to see what Tony was typing.</p>\n<p> ‘She gave an unholy screech as a wave of red enveloped the Rogues. Clint and Tony watched in saddened silence, though neither was surprised. Clint was just glad that he had finally seen Tony’s side of the whole Maximoff issue. What had he been thinking to vote to allow a mind-raper on the team? Oh, that’s right—there hadn’t been a vote. Cap said this was how it was going to be and everyone sat up and begged at his feet to jump on board. What had happened to Natasha?’ Steve read, growing angrier every second.</p>\n<p> “What is this crap, Tony?”</p>\n<p> “It’s a valid interpretation of what might happen if Maximoff finally snapped and went full-fledged crazy town (which I’ve seen coming from a mile away) and Clint reformed from being a complete and total dick,” Tony replied easily.</p>\n<p> “WHAT?!” Steve yelled angrily.</p>\n<p> “I like to throw in a bit of redemption in my fanfiction,” Tony shrugged.</p>\n<p> “But Wanda,” he spluttered.</p>\n<p> “Hey, sometimes you just hit a point of no return,” Tony replied. “She’s always been a lost cause. Hydra volunteer, anybody? You guys like to jump on my case because I made and sold weapons for the U.S. military, but come on—at least I was never a Neo-Nazi. Or a paid assassin,” he added thoughtfully.</p>\n<p> “What’s this crap about ‘The Rogues’” Steve asked, crossing his arms over his broad chest.</p>\n<p> “It’s a fan fic tag. Don’t let it bother you,” Tony snickered.</p>\n<p> “Don’t let it bother me? The Accords were a serious disagreement that nearly broke up our team, Tony! And I was taking a personal stand against tyranny!”</p>\n<p> “Sorry, Steve. I wish I could help you, but I’m ‘TEAM CONSEQUENCES’. I’m just doing what I believe in, and that’s all any of us can do. That’s all any of us should.” Tony smiled and posted his fic. Maybe TEAM CRAP had been pardoned and were back at the compound. He’d probably even end up sacrificing himself to save the universe AND their worthless asses while Steve takes advantage of his tech ONCE AGAIN to get his happily ever after (your welcome for the B.A.R.F. Barnes). Oh well, what can you do? At least he had fan fiction.”</p>\n<p>* just doing what you believe in, and that’s all any of us can do. That’s all any of us should (from Steve’s letter in CW).</p>\n<p>Tony sighed and smiled as he walked into the Compound where Rhodey stood waiting. Rhodey slapped him on the back and congratulated Tony, who was being steadied by Happy at his side.</p>\n<p> “Hey, what’s up,” Steve asked, coming up to the trio with a big smile on his face.</p>\n<p> “Well, I’m finally out. Proved my innocence in the Ultron incident,” Tony said with a sigh of relief.</p>\n<p> “Oh, uh. Great. What do you mean out? And how’d you do that,” Steve said with wide eyes. Tony had a lot of connections, but Steve didn’t see how he was going to cover up something THIS big!</p>\n<p> Tony stared, his mouth hanging open. </p>\n<p> “Steve, I’ve been in prison for the last six months!”</p>\n<p> Steve suddenly noticed just how the genius looked. Tony had dark circles under his eyes. His beard was completely grown in and his hair was a bit scruffy as well. He also looked quite thin, like he’d been under a lot of stress.</p>\n<p> “You went to prison,” Steve asked, shocked.</p>\n<p> “What did you think was going to happen after Ultron?! And with so much loss of life and property damage as well as my obvious wealth, there was no way they were going to let me out on bail. I was too big a flight risk,” Tony replied.</p>\n<p> “Oh, well. That makes sense, I guess” Steve replied with a grimace. “So how’d you convince them it wasn’t your fault,” Steve asked as if he hadn’t just implied that Tony was guilty of some sort of cover up.</p>\n<p> Rhodey and Happy glared, while Tony’s mouth continued to hang open.</p>\n<p> “Um, because I DIDN’T do it! The Ultron program had been scrapped, and I had no intention of going back to it. It was just too big in terms of scale for where I am with AI’s, but something was just niggling me to try again AND to use the scepter this time. It was almost like a compulsion—though not quite. More like my fear of another invasion was so overwhelming that I was willing to take any risk, sacrifice anything to protect everyone,” Tony shuddered.</p>\n<p> “That’s terrible Tony, but I don’t see how that means you’re innocent of Ultron,” Steve said, crossing his arms and looking at Tony judgmentally.</p>\n<p> “It wouldn’t, but it did make me think about when, if ever, I have reactions like that. I’ve been getting them since New York when I went through the portal, but there’s always been a trigger in the past to set me off. I’ve been getting treatment,” Tony shrugged in embarrassment.</p>\n<p> “Makes sense,” Wilson said as he walked up with Natasha.</p>\n<p> “It is what it is,” Tony smiled shyly, not used to the rapid changes in his life from SHIELD to New York, the Mandarin, and now Ultron. He was trying to be better, do better, but he just couldn’t keep up. “Anyways, I kept thinking that it all led back to an episode that I had at Strucker’s base. From that moment there was something that just made taking the scepter seem RIGHT, and that I just HAD to do more. Hence, rejuvenating and rushing through the Ultron project and looking at how the scepter—alien tech that I’m completely unfamiliar with, man, even I know that’s a no-no—could address the issues we were having.”</p>\n<p> By now, Clint had wandered up as well, though he was looking at the genius skeptically.</p>\n<p> “Anyways, you guys know that Pepper has been—pretty mad about everything, but when push comes to shove, she always comes through. We talked about my thought processes and she even went to my therapist with a note from me giving permission to discuss my treatment and case. They both agreed that something would have had to trigger me to react like that.</p>\n<p> So, Pepper had the security team we were with that day look through the files that we retrieved, and there was security footage as well. There’s video of that Maximoff girl messing with my head, me reacting, and then her and her brother standing by while I take the scepter. </p>\n<p>Her brother even asked why they didn’t try to kill me instead of letting me take it. After reviewing the video and my therapist’s remarks about how I’m to the point where only major triggers cause the type of reaction I displayed—well, there really wasn’t a case against me after that. Ultron simply wasn’t ready for an interface, and if her interference and the scepter weren’t added into the situation, it would have stayed right where I had it—in the scrapheap. Ultron never would have gone online. It all added up to a tragic accident, and the only one with real intent was the Hydra terrorist,” Tony shrugged.</p>\n<p> “No! It’s your fault! YOUR FAULT!”</p>\n<p> Tony jumped as everyone turned to the doorway where Wanda Maximoff stood in a housecoat and slippers, drinking a latte.</p>\n<p> “WHAT’S SHE DOING HERE,” Tony screeched.</p>\n<p> “She lives here,” Steve said in surprise.</p>\n<p> “SINCE WHEN?!”</p>\n<p> “Well, after her home was destroyed she needed a place to stay. She helped us,” Steve shrugged.</p>\n<p> “She helped you? She caused the whole thing in the first place!”</p>\n<p> “You killed my parents, and you’re the reason my brother is dead, my home destroyed,” she screamed, red beginning to glow around her fingers.</p>\n<p> “What are you talking about? I don’t even know what you’re talking about?!”</p>\n<p> Wanda proceeded to sob out the whole tale of how her parents were bombed during a Sokovian Civil War. How she and her brother had laid in the remains of her home waiting to die. How they had decided to get revenge and joined Hydra to destroy Stark, and the Avengers were just Hydra-flavored icing on the cake.</p>\n<p> “Wait—you’re saying he designed a weapon, and so you decided to get revenge on him and not the ones who fired the bomb,” Sam asked, confused.</p>\n<p> “Well, he did make it,” Steve shrugged.</p>\n<p> “Um, just to interrupt, but the designs she’s talking about were not mine. I’ve only made the really high-tech, newer stuff. Those designs, for weapons provided for American allies, would have been dad’s—Howard’s” Tony added when Sam stared blankly alongside Steve. “Otherwise they were part of the stock that Obadiah was selling illegally and tried to kill me for.”</p>\n<p> “And Tony’s worked tirelessly to get any weapons that Obadiah sold back. You might have noticed that when he was almost blown up, his response was to do everything he could to be better and fix things. Whereas witchy over there apparently decided to respond by becoming a Nazi and sticking a loaded gun capable of world annihilation into the hand of someone who recently got major PTSD from saving the world. Are you seriously judging him and sympathizing with her,” Rhodey asked, turning to Steve angrily.</p>\n<p> “He’s right,” Sam said, looking at Steve uneasily. “She can’t say that she expected anything good to happen by sending him on his way with the scepter after working to give him lasting panic.”</p>\n<p> “Or the Hulk! She set the Hulk loose on a major city with a Hulking case of PTSD! (“What? Sam yelled). It doesn’t even matter. Why is she here?”</p>\n<p> “Like I said, she needed a place to stay,” Steve said harshly, crossing his arms.</p>\n<p> “How about jail? That’s where I was staying. And none of this even accounts for the crimes she committed while she worked for Hydra. They surely didn’t have her and her brother sitting on their thumbs that whole time,” Tony cried.</p>\n<p> “I only did that because you made me,” she screeched.</p>\n<p> “He didn’t MAKE you become a terrorist and submit to experimental human testing to try to get revenge. That’s on you, sweetheart. None of this matters. Tony’s here because he was exonerated. The whole sordid story has been released to the public now, and the authorities are looking for Maximoff. No one knew you had her sitting here in the lap of luxury, living off Tony’s dime while he was in prison,” Rhodey said angrily. “It’s time to pay the piper, princess.”</p>\n<p>*****<br>Ultron Transcript:<br> Tony: Thor, I got eyes on the prize.<br> [Wanda creeps up behind him and uses her powers on him, suddenly the Chitauri comes to life, then Stark sees the rest of the Avengers team are all dead, he goes over to Steve's body to check his pulse when Steve suddenly grabs him]<br> Steve: You could have saved us.<br> [Steve dies but Stark continues to hear Steve's voice in his head]<br> Steve: Why didn't you do more?<br> [Stark sees that he is in the Chitauri realm, that's when he snaps back and we realize Wanda had used her mind powers on him]<br> [Wanda and Pietro watch as Tony grabs the scepter]<br> Pietro Maximoff: We're just gonna let them take it?<br> [Wanda smiles to herself as Tony takes the scepter]</p>\n<p>“I have a theory,” Vision said slowly.</p>\n<p>“Oh, here we go,” Falcon said dismissively with a roll of his eyes.</p>\n<p>Before Vision could go on, Tony sat up abruptly.</p>\n<p>“Excuse you,” he said aggressively with a stormy look back at Falcon, whose pose shifted abruptly from angry and dismissive to confused.</p>\n<p>“Is there a problem,” he said in surprise.</p>\n<p>“Where do you get off disrespecting him like that!”</p>\n<p>“I wasn’t,” Falcon began.</p>\n<p>“No,” Tony said, standing quickly and moving to stand just in front of Falcon. “Let me explain things to you. Maybe Vision is ‘young’, but his knowledge and reasoning powers are the most advanced by light years in comparison to anyone in this room—especially compared to someone that follows around Captain America despite any military training that might suggest stealing from the Air Force and going a National Security problem alone because ‘Captain America said so’ might be a bad idea.”</p>\n<p>“Tony, we made the right choice,” Steve said, shooting out of his own chair. “We had to stop Hydra!”</p>\n<p>“Well let’s just look at how well you did that, Captain America-The Best Hands are Our Own,” Tony sneered back, done taking their dismissive crap like they weren’t sitting in a room with a genius who had been forced into the political arena at a very young age, a literal rocket scientist that had made his way up the military ladder far beyond either Rogers or Falcon, and Vision (need he say more—Thor’s hammer certainly found him worthy). </p>\n<p>Rhodey scoffed and sat back to enjoy the show.</p>\n<p>“You burned down an entire secret, military organization and got thousands of undercover agents AND their families killed when you released ALL of that data onto the web—including highly volatile national security data that we still haven’t recovered from as a nation and that has almost started wars and has severely hampered our ability as a country to seek any diplomatic solutions to major ongoing issues—and dropped three helicarriers on the Potomac resulting in millions of dollars in damage as well as the death of hundreds of civilians WHEN YOU COULD HAVE CALLED ME TO STOP THE WHOLE THING WITH THE PRIVATE COMMAND CODE THAT I BUILD INTO ALL MAJOR TECHNOLOGY IN CASE SOMETHING GOES WRONG. Widow knows that I’ve implemented override codes in everything because of how my weapons were mishandled. Oh, and as for stopping Hydra, didn’t we spend the next year going on missions WITH EX-SHIELD AGENTS that I had to rescue and employ just so we could continue FIGHTING HYDRA WHICH YOU NEVER REALLY STOPPED--TWICE! That’s false advertising, Cap,” Tony sneered.</p>\n<p>“We did all that we could,” Steve said angrily.</p>\n<p>“No,” Rhodey said. “He just explained that you could have shared information and avoided all of that catastrophe, but you thought the best hands were your own because of paranoia. You needed someone to put on the brakes because you didn’t have the knowledge or skills to best handle the issue or understand the repercussions of your actions in that situation. And you surrounded yourself with a woman whose motives and methods have always been questionable at best and a new Yes-Man.”</p>\n<p>“Rhodes, I knew what had to be done,” Widow said in a soft voice that really just served to make Tony angry.</p>\n<p>“You mean you knew what had to be done to serve you the best, as that Senate hearing demonstrated.” </p>\n<p>“I seem to recall another Senate hearing where you behaved similarly,” she sneered back.</p>\n<p>“No, I strategically behaved like a jack ass in that situation to get away with the antics that I needed to use to illustrate a point—stealing the use of their screens was my best option to illustrate why my technology needed to be treated differently. Because it WAS different. You, on the other hand, made the absolute worst decisions a spy could possibly make—because let’s get real, most spies at least have some allegiance to someone like the country employing them, but you never have—and then proceeded to tell them that they had no choice but to let you get away with a CRIME (treason as well as multiple counts of man slaughter) THAT YOU KNEW YOU HAD COMMITTED because they didn’t have anyone else to fix it. Well, let’s be honest. Spies are a dime a dozen. They can get any number of replacements for you. I may have ego out to wazoo, but I have the cred to back it up. You need SHIELD, or me, or someone else to give you any real value—don’t you Widow. Otherwise your just some sad little honeypot slash assassin looking for her next mark to get by.”</p>\n<p>“Alright,” Tony added. “I’m done with this. I have supported you guys time and again because we were a team, but you have never shown me any type of loyalty in return. Steve and Nat constantly disregard my contributions like I haven’t been funding this entire shit show since the EXTRAORDINARY MESS they made out of SHIELD. Then they brought in the ex-Hydra agent that wanted to kill me and set me off to make Ultron, which I had scrapped until her little mind-whammy, none of which anybody ever acknowledged as wrong. Instead I was attacked by a teammate at the word of a known Hydra agent when we had been fighting them just hours previously. This has clearly never been a team that included me.”</p>\n<p>“Amen! Best hands, my ass,” Rhodey muttered. “She’d already be up for war crimes, crimes against humanity, and terrorism if it was me. Not living in a state-of-the-art compound with all expenses paid,” he added.</p>\n<p>“So, here’s the deal. Wanda can fix her own Visa and PR issues or deal with the international terrorism laws that she violated with the help of the Avengers that actually wanted her on the team. I don’t like how she’s clearly been playing on Vision’s emotions. Vision, I’m sorry, but I know manipulation when I see it. Your logic is outstanding, but you are a baby when it comes to emotions—and she is not interested in an equal relationship. I see it every time something goes wrong, and she looks to you and the others for protection instead of stepping up and facing whatever music is coming her way.”</p>\n<p>“Like you’re any different,” she hissed, her face and ugly with hatred and spite, her mask of innocence lifting the moment she was faced with Tony’s criticism.</p>\n<p>“I stood up in front of the world and admitted what I had done wrong and promised to do something about it. And I did. That’s what Iron Man was all about. So, you can save it sweetheart. Despite what Captain Ass-Hat thinks, my image was never my concern, or I would be much less of a dick to people that aren’t in my immediate circle of friends. The whole world already knew I was a jackass—and I didn’t care. I did care about fixing the LEGAL DECISIONS that I made that actually ended up hurting people, though. And I lost a lot of connections and money as a result. You, on the other hand, have had your slate wiped clean time and again with zero repercussions. Guess it’s time to face the music, sweetheart.”</p>\n<p>“What about us,” Widow said, cocking her head as if looking at an interesting experiment. “Are you going to betray us just like Wanda,” she added, crossing her arms and legs (calling attention to both).</p>\n<p>“Nope, I’m going to leave you alone. I’m not funding this shit-show anymore because I can see which way the wind is blowing,” Tony added with a gesture towards Steve and Falcon. “None of you have ever respected me or mine, as SGT Wilson just demonstrated with his completely dismissive remark towards Vision—one of mine. So, go it on your own. No more money, no more state-of-the-art compound, and weapons. I expect everything I’ve made for you back (that includes the Wings and Red Wing, Falcon)—or I’ll activate the self-destruct command codes whether or not you’re wearing them at the time. I’m signing the Accords. You can too if you want to keep heroing, but you won’t be doing anything on my dime anymore. I’ll expect you out by the end of the month.”</p>\n<p>Tony walked serenely out of the room.</p>\n<p>“Well,” Rhodey said, breaking the silence with a loud, jovial clap of his hands. “I suspect that Rogers hasn’t been treating this debate with the seriousness it deserved because he thought there were three options instead of an ultimatum. Door number one: sign the Accords; door number two: retire; or door number three: keep taking advantage of Tony because he’ll never tell me no. Captain, it’s time to make a REAL choice, because saving the world costs money. And Real military men know when it’s time to follow orders. Good luck with the move,” he added, and followed Tony with a smile.</p>\n<p>“We don’t trade lives on this team,” Steve said self-righteously, his arms across his chest and a superior look aimed at everyone else in the room.</p>\n<p>Everyone looked around curiously at the whirring sound of a repulsor charging. And then a bright, blue/white light fired straight at Vision’s head. His head, and the stone within it, shattered into pieces and flew around the room. Everyone stared in shock before Wanda screamed.</p>\n<p>Tony stepped out from around the corner where he had taken his shot. He was still holding a strange ray gun.</p>\n<p>“How . . . that’s not possible,” Shuri shrieked.</p>\n<p>“Kid, I was making weapons while I was still wearing short pants. Judge me all you want, Cap,” Tony sneered, cutting off the rant before it even began. “But it was Howard that forced me to learn and do that. Remember, I inherited SI. My work was the first big move out of weapons and investing in the future.”</p>\n<p>“But it was vibranium,” Shuri said, eyes wide.</p>\n<p>“And I have a real infinity stone and a mock infinity stone,” Tony held up the gun, which was attached to an arc reactor. In his other hand was the time stone. “With all the time in the world to work through my tests, of course I was going to come up with something.”</p>\n<p> When Dr.Strange approached Tony saying that he needed the Avengers to get back together or the universe was doomed, before explaining EXACTLY HOW Thanos was going to destroy everything, Tony had just stared at Strange before simply asking “then why don’t you destroy the time stone?”</p>\n<p>Strange had harumphed and puffed up before stating that his entire job was to protect the stone, thank you very much.</p>\n<p>And Tony was just done. He could already hear Steve Rogers refusing to destroy Vision’s mind stone (Tony wasn’t really all that torn up because what had Vision ever done since the destruction of Ultron besides steal Jarvis’s identity and then moon over Maximoff—the great pillar of society—like a worthless, lovesick teenager). Maximoff would throw a hissy fit if she had to actually go out and convince a normal guy that she wasn’t a psychotic ex-girlfriend waiting to happen, so, there was no way Steve would be willing to sacrifice Vision (her made-to-order-courtesy-of-the-mind stone boyfriend). Like anyone minded when Jarvis had stepped up to sacrifice himself for them. He and Tony both knew about hard choices. Fuck Vision. And Fuck Strange.</p>\n<p>Strange hadn’t been ready when Tony turned and punched him the face, knocking him unconscious. Tony had taken the Stone and skedaddled to a private island that no one knew about, using the time stone to keep repeating the day until he could build something to destroy infinity stones.</p>\n<p> Tony set the time stone on the ground before firing a second time and destroying the time stone as well.</p>\n<p>“And that takes care of that,” he said. “Maybe you don’t trade lives on this team Captain hypocrite,” Tony drawled with a loaded glance at Bucky Barnes who sat quietly in a corner of the room, “but the rest of the world is sick of you trading on theirs.”</p>\n<p>Tony turned, about to walk away, before turning back, cocking his head, and staring at Wanda where she was sobbing on the floor, clutching Vision’s vibranium body. With an odd look he quickly raised his arm and blasted Maximoff as well before anyone even figured out what he was doing.</p>\n<p>Steve, Sam, Clint, Scott, and Nat all looked at him in horror.</p>\n<p>“Meh, better safe than sorry. Don’t want all that red hoo-doo she’s always tossing around so carelessly to get sucked up by Thanos to destroy the universe,” Tony shrugged. He turned, and quickly walked away with a smile.</p>\n<p>So, this is just because I feel like things are getting heated like months after the fact. I haven't even updated in a while--but I get LOTS of comments still. Granted, lots of those comments are from trolls, and likely from a program that hijacks other author's names and then puts in a generic I LOVE TEAM CAP comment.</p>\n<p>To people irritated by the comments, I don't even know how to moderate my comments. I never learned. I just like writing a short fic every now and again and posting it. Many of you have very kindly posted positive comments in response, and every now and again I'll go back and read them; but I work full time and have 6 kids. My life is too full to spend much time on fanfiction. I really only read the comments months after they've been sent and often don't respond to those because I figure there's a good chance that you all got busy with your lives and haven't seen it either. (Don't get your feelings hurt if I don't respond to your comment. It's entirely due to my schedule).</p>\n<p>So, to everyone who has given me kind comments . . . Thank you very much. I hope you got some enjoyment out of it. I write because it's a fun break from the other types of writing that I do and if you actually like it, even better.</p>\n<p>To the trolls, I can't express how much the comments don't impact me. I don't even see them until I get a bug up my butt and decide \"What the heck, guess I'll go read the comments\". And honestly, that's usually to read the troll comments because they're kind of ridiculously funny to me (even though I can tell they are frequently meant to be both judgmental and cruel). I'm just not invested enough to let it really impact me, but please consider that others are, and if you find the fiction in poor taste (despite the tags which I tried to add to include every warning so people don't read that don't like that stuff), then you could try being the bigger person. People see the total number of comments and think the fics must be impressive--you're contributing to that opinion considerably just by adding to the statistics. Try boycotting. It might work better.</p>\n<p>To commenters, until I learn to moderate, just be forewarned that plenty of trolls like to leave comments on these fics and they aren't above leaving comments in your name (extremely poor taste, but there have been a few that had interesting artwork that I must say impressed me even if they were meant to be a personal part of one's anatomy. I thought it was funny anyways).</p>\n<p>Cheers and Merry Christmas.</p>\n<p>“You sold us out, man . . . for fucking Ross,” Clint says, banging his fist on the clear partition of his cell between him and Tony.</p>\n<p>“Hank said you should never trust a Stark,” the other man says nearby, shaking his head before he leans it back against the wall.</p>\n<p>Tony just sighs, before dropping his chin to his chest. When he raises his head, Clint is smirking at him despite his anger.<br>\n“I’m going to try to explain things in small words for all of you since none of you seem to be the brightest crayolas in the box, but first, I have one simple question that might put things in perspective. Clint, why are you here? Why are you, Wanda, Sam, and . . . whoever this guy is, here?”</p>\n<p>“Because you sold us out to Ross and his Accords,” Clint says, banging the cell wall again.</p>\n<p>“OK. I’ll go slowly. I know they read you your rights on the way here. I know they told you that you were being held here while you wait for trial.”</p>\n<p>“Look at Wanda,” Sam gestures angrily.</p>\n<p>“Yes, she looks extremely pitiful right now. How did you think they would contain her if she were ever to break the law AGAIN—since we all know that she was working for a Neo-Nazi terrorist organization before she ever went to Lagos and killed people over there.” Tony held his hand up to stop Sam before he could even respond. “I’m not saying she did it on purpose, but you must know that entering that country outside of normal protocols and then participating in any type of mission was going to count as an act of terrorism, especially with her sordid little history with Hydra. That collar and the straight jacket are in place to protect the guards since little Miss Hydra Princess has an established history of attacking anyone that looks at her funny. Just ask Dr. Cho if you forgot that tidbit. If you do the crime, you do the time—and her powers make this necessary until something else can be put in place. If she didn’t want to suffer this humiliation, she should have never even considered breaking the law again.”</p>\n<p>“The Accords are evil!”</p>\n<p>“Yes, thank you, Clint. I’m sure you’ve given them a thorough read since you were already retired and NOT at the meeting when we were given the draft—the draft that pretty much no one had the opportunity to read before Cap and his second crony in command over there decided this was all an evil ploy rather than an agreement between Nations about how to handle groups that want to cross borders willy-nilly. But more importantly, they have not yet been signed into law.<br>\nCap’s little crime spree began after the signing was disrupted with a bombing. The signing was, appropriately, postponed. You’re all here because you crossed into Germany illegally and then aided and abetted a known terrorist who was wanted under suspicion of YET ANOTHER act of terrorism, interfered with his detainment (by those of us now lovingly described as Team Iron Man), and destroyed an airport to the effect of more than few million dollars in property damage all to help him escape. Those are all . . . wait for it . . . CRIMES! You broke the law, dumbass. Of course, they put you in jail! You’re not here because of the Accords. And did you really think that I was going to join you in a crime spree despite my status as the multi-billion dollar CFO and R&amp;D head of SI? I am a public figure. That type of decision would have MASSIVE repercussions for thousands of employees as well as international economies the world over. I don’t have that type luxury, Clint. And I’m also much too smart.”</p>\n<p>“Barnes is innocent,” Sam threw out.</p>\n<p>“Yes, NOW I know that, and have now gotten evidence to that effect. That doesn’t discount the crimes he did commit as he ran from the law rather than calmly turning himself in. It also doesn’t matter because you didn’t have any proof of that at the time, and you helped him run from the authorities rather than helping him prove his innocence.”</p>\n<p>“There was a shoot on sight order,” Sam added, crossing his arms.</p>\n<p>“There was only ever a shoot on sight order for you and Steve, after your idiotic chase, which is why I BEGGED to be the one to bring you in. Who told you that?”<br>\nSam looked shifty for a moment before sighing.</p>\n<p>“Steve has a . . . connection . . . in counterterrorism.”</p>\n<p>Tony looked at him drily for a moment. “Do you mean Sharon Carter? Because she would do just about anything to make Steve notice her and feel like he owes her a favor. Things like give him inside, classified information, with maybe a dash of exaggeration for effect thrown in, or even pass you guys equipment that was supposed to be locked up in evidence. It’s called being desperate, Sam. She’s been creaming her panties over Cap since she was an adolescent. Neither Howard nor Peggy did anyone in their families any favors with their inability to let go of the past—and Steve has the same problem.”</p>\n<p>“That doesn’t excuse you working with Ross,” Clint yelled.</p>\n<p>“I’m not working ‘with Ross’ you stupid fucker! I’m working with the Secretary of State! It’s an elected position. Ross has held that position for 7 years now. Ellis will be out of office next year AND ROSS WILL GO WITH HIM since the Secretary of State is selected by the President—no accounting for Ellis’s taste. Do you even know anything about the government of the country you live in. Even if he were involved, even remotely, with the Accords, he’ll be out of office long before he has any impact in the types of evil dictator decisions that you dumbasses want to assign him. It’s like you think Ross is some type of all-powerful overlord instead of the Avenger’s boogeyman that he really is. Ross has only ever been a threat to Bruce, and that was when he was still an Active Duty General. He’s retired, and his political career will be over very soon as well. Honestly.” Tony shook his head and walked away. He didn’t have time for this shit.</p>\n<p>Tony and Steve stood facing each other, shoulders back and bodies tense for what looked to be the upcoming fight.</p>\n<p>“Why on earth should I help you in any way? In what world is it my job to fix your mistakes, Rogers,” Tony huffed at the fugitive that showed up with his group of fugitive tag-a-longs behind him.</p>\n<p>“Tony, you know that Bucky didn’t do it. He never wanted to hurt anyone, and neither did I,” Steve said. “It’s the right thing to do to help us.”</p>\n<p>Tony cocked his head curiously at Rogers while the others sneered at him.</p>\n<p>“So, since you never intended to harm anyone, I should help you all return home . . . because you all know that I’m the only one in this group with the connections to accomplish that.”</p>\n<p>“Intentions matter, Stark,” Sam said softly, with a faux sympathetic look on his face. He had sent Tony to Siberia alone. And maybe he hadn’t known that Tony would be ambushed by that horrible video and Steve’s lies when he had done so, but he had worked with Cap to bring in Barnes on Tony’s dime knowing they were looking for the man that killed his parents. Likewise, he knew that Steve had left Tony behind, beaten, when Tony had reacted in an entirely human way to seeing his parents violently murdered before his very eyes.</p>\n<p>Tony had never had a good relationship with his father who was alternately negligent of his son and intensely judgmental when he could pay him any attention; but Tony had never HATED his father until he had thought him responsible for killing his mother. It had long been speculated by those that knew Howard Stark closely that the only reason he might have wrecked that night would have been due to drinking and driving, something he had been prone to do. Steve and his cronies, by protecting Barnes, were also ensuring that Tony would never truly heal from that wrong.</p>\n<p>The silence stretched a bit longer before Tony spoke.</p>\n<p>“Alright, you’ve convinced me. The Accords are about accepting consequences for our ACTIONS, but . . . you’re right. Intentions matter. I never intended to help create Ultron, even though that is what happened. My intentions to protect the world had disastrous effects that were much larger in scale than the ‘unintentional’ deaths that Sam, Cap, Wanda, and Natasha caused in Lagos and that Cap, Sam, and Barnes caused in Romania during that chase. I’ll work to bring Sam, Cap, Natasha, Clint, and the Antman in from the cold.”</p>\n<p>Everyone began smiling until Clint spoke up.</p>\n<p>“Wait, what about Wanda,” he asked, the beginnings of anger taking hold.</p>\n<p>“What about her? Her intentions may have been good for these crimes, but the crimes she committed against me were never accounted for since you all protected her. I don’t see why I should do anything to help her, especially since she’s done little more than spit on my efforts to aid her in the past.”</p>\n<p>“What crimes,” Wanda sneered.</p>\n<p>“I never intended for your parents to be hurt. I only intended to protect the troops in the same way that my father had. Your intentions in pushing me to take the scepter in the way you did and then working with Ultron were always clear—murderous revenge. Sam said it, Wanda: intentions matter.”</p>"
}