{
  "id": "22221652",
  "url": "https://archiveofourown.org/works/22221652?view_full_work=true",
  "author": [
    "Yuu_chi"
  ],
  "title": "shadows in the sun rise",
  "rating": "Explicit",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "陈情令 | The Untamed (TV)",
    "魔道祖师 - 墨香铜臭 | Módào Zǔshī - Mòxiāng Tóngxiù"
  ],
  "relationships": [
    "Lan Zhan | Lan Wangji/Wei Ying | Wei Wuxian"
  ],
  "characters": [
    "Lan Zhan | Lan Wangji",
    "Wei Ying | Wei Wuxian",
    "Lan Huan | Lan Xichen",
    "Lan Yuan | Lan Sizhui"
  ],
  "additional_tags": [
    "Post-Canon",
    "Night hunts",
    "Curses",
    "Intimacy",
    "Light Angst with a Happy Ending",
    "They're married and they're in love"
  ],
  "language": "English",
  "series": "",
  "published": "2020-01-12",
  "completed": null,
  "words": "24,618",
  "chapters": "1/1",
  "comments": "517",
  "kudos": "14,494",
  "bookmarks": "4,423",
  "hits": "125,444",
  "summary": "<p>“Wei Ying,” Lan Wangji says, voice slow and a pitch too quiet. A second later Wei Wuxian understands why. “I cannot hear.” </p>\n<p>Or; Lan Wangji is cursed into internal isolation. Their ability to understand one another remains as unwavering as ever.</p>",
  "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>This was truly outside of my usual wheelhouse for writing, and I had both a blast and a lot of anxiety working on it, which is always a lot of fun. Thank you so much for reading, and I hope you enjoyed it as much as I enjoyed writing it! </p>\n<p>twitter: @doingwritebyme<br>tumblr: glenflower</p>",
  "text": "<p>It takes until the evening for Wei Wuxian to realize something is wrong at all. </p>\n<p>They’ve just finished a largely boring night hunt, following rumors of vicious bandits in the thick woods that border the sleepy farming village they’re passing through. They’d instead found a collection of fierce corpses roaming blindly about what must have once been their hideout, bumping into trees and tripping over one another. </p>\n<p>Going by their withered appearance, it was safe to assume they’d been dead for some time, eyes foggy and unseeing in death, and skin hanging loosely from rattling bones. The spoils of their pilfered forest hut had revealed that, in life, none of them had been perhaps what Wei Wuxian would call good men, spare maybe one who looked like he might have been their last victim before nature took them all to rest; a man dressed in ragged cultivation robes although for all their searching they couldn’t seem to find his sword. Wei Wuxian could only hope he’d forgive them for burying him without it. </p>\n<p>Lan Wangji had dug out a sizable pit for them to work as a grave, and Wei Wuxian had coaxed them into it with the lull of Chenqing. In the end, from entering the woods to leaving them, the hunt had taken more or less three days. </p>\n<p>Still, that was three days of sleeping rough; backs on the unforgiving forest floor while Lil Apple snored sullenly in the grass nearby. Wei Wuxian maybe gets carried away in the enthusiasm of finally returning to society, chattering endlessly as they take their dinner in their modest one-bed room, excited for a reunion with such things as <em>pillows </em>and <em>blankets </em>and Lan Wangji’s broad palm over his mouth later when Wei Wuxian doubtlessly gets too loud for such a crowded building. </p>\n<p>Lan Wangji is quiet all the way through dinner, which is just the typical way of things, and then he’s quiet still as he helps comb the dirt and grit from Wei Wuxian’s hair, which <em>still </em>isn’t atypical. It’s not until Wei Wuxian finishes his weaving story with <em>“what do you think, Lan Zhan?”</em> and doesn’t receive an answer that the first seed of worry begins to sprout. </p>\n<p>He twists in Lan Wangji’s lap to face him, and Lan Wangji blinks, apparently startled by the abrupt shift as Wei Wuxian’s hair falls from his careful hair. “Wei Ying?” </p>\n<p>“Is everything okay?” Wei Wuxian asks. </p>\n<p>Lan Wangji’s brows knit ever so slightly. “Of course.” </p>\n<p>“Really? Because you’re being very quiet and it’s starting to really worry me.” He reaches out, pressing his freshly scrubbed palms to Lan Wangji’s cheeks. “You’ve spoilt me too much. I’m not used to being ignored now.” </p>\n<p>Lan Wangji reaches up and cups Wei Wuxian’s hands. “I would never ignore you,” he says, simple and true. Then, “We have had a long journey.” </p>\n<p>“You’re tired?” Wei Wuxian guesses, because Lan Wangji is weird about admitting those kinds of things out loud, as if they’re perceived weakness he ought to be above. He glances over Lan Wangji’s shoulder and out the window where the sun is only just starting to sink. “I suppose you would be. You haven’t exactly been able to go to sleep at your usual bedtime these past few days. Do you want to turn in for the evening?” </p>\n<p>Lan Wangji’s hands slip from atop Wei Wuxian’s down to his waist, hauling him more firmly into his lap and making Wei Wuxian flail about for balance, arms settling over Lan Wangji’s broad shoulders. “Not that tired,” he says, and stoops down to kiss Wei Wuxian’s exposed throat. </p>\n<p>Wei Wuxian laughs, squirming slightly in his lap as he leans back to grant him more access. He runs his hands down Lan Wangji’s back, delighting in the shiver that chases his touch. “Are you sure?” he teases. “I’d understand if Lan Zhan was too exhausted for such a thing tonight. After all, maybe ‘every day’ was just a newlywed promise?” </p>\n<p>The way Lan Wangji presses him firmly back into the bed is answer enough to that accusation, Wei Wuxian laughing breathlessly all the way down. </p>\n<p>Wei Wuxian has always considered their sex good - even before they figured out how to take it from <em>good </em>to <em>better </em>- but tonight it’s really something else indeed. They’d fucked while on the night hunt, but it’d been little more than rough exchanges pressed against tree trunks or the dirty floor of abandoned forest huts. This is the first time in <em>days </em>that they can really take their time, no threats looming behind their sweaty backs, and Lan Wangji throws himself into the task of reacquainting himself with each and every part of Wei Wuxian’s body like there might later be a quiz - <em>how many freckles hide in the curve of his thigh? How many fingers does it take to really, really make him moan? </em></p>\n<p>By the time Lan Wangji is pressing into him, Wei Wuxian is a gasping, frantic mess. “Lan Zhan, Lan Zhan,” he mutters, useless and far too loud for the thin walls. He expects Lan Wangji’s hand to smother his mouth at any moment, always greedy to keep Wei Wuxian’s voice to himself, but instead he simply hauls him closer, teeth hot and sharp beneath Wei Wuxian’s ear as he fucks him into an abrupt and brilliant orgasm. </p>\n<p>Wei Wuxian curses and swears, scrabbling at Lan Wangji’s back for purchase. Somebody thumps on the adjoining wall, and Wei Wuxian can barely tell it apart from the pounding of his pulse. His throat feels raw from the way the sharp cracks of his voice had caught at it on the way out, and by the time he feels Lan Wangji shudder and go still against him, Wei Wuxian is feeling both incredibly worn out and twice as smug. </p>\n<p>“Lan Zhan,” he says, running his hands through his hair and down his sweaty back. “I thought you said you were tired, hmm?” </p>\n<p>Lan Wangji nuzzles at his throat for a moment and doesn’t answer. He seems utterly disinterested in getting off Wei Wuxian, so Wei Wuxian makes the most of the situation and wraps his legs around Lan Wangji’s narrow waist, rolling them both to their sides so that he can both cuddle <em>and </em>breathe. </p>\n<p>Lan Wangji’s eyes are hooded, fixed on Wei Wuxian’s face. One of his hands runs absently up and down Wei Wuxian’s side. He looks quite content, in that expressionless way that Wei Wuxian had worked very hard to be able to read. It’s enough to stem the quiet worry that had still been fluttering uselessly in his stomach from earlier. </p>\n<p>He pats Lan Wangji’s cheek and goes to sit up only to be firmly tugged back down again. “Lan Zhan,” he says. “You’re the one who prefers that we wash before sleep.” Lan Wangji’s head turns on the pillow so that he can gaze up at him. He looks a little confused, like he hadn’t quite heard him, and Wei Wuxian very pointedly runs a hand through the come coating his stomach and raises a brow at him. </p>\n<p>In one well practiced move Lan Wangji presses Wei Wuxian back down and swings himself off the bed with far more elegance than most men can manage while naked as the day they were born. This is probably because most men don’t look like Lan Wangji. Wei Wuxian obediently settles back down amid the messy blankets, watching with great enjoyment as Lan Wangji bends to wet a cloth in the abandoned wash tub in the corner of the room. His hair swings in a curtain over his shoulder, exposing the bruise Wei Wuxian had bitten into his shoulder earlier, and Wei Wuxian feels rather vindictively pleased. </p>\n<p>Lan Wangji cleans him off with careful hands that are both familiar and thorough. For all that he has no qualms about being rough in bed, he’s always soft in the aftermath and every other avenue of their shared lives. Wei Wuxian positively <em>lives </em>for the contradiction of it, delights in being spoilt almost as much as he enjoys the despoiling that comes before. </p>\n<p>When Lan Wangji has washed them both clean to his satisfaction, Wei Wuxian reaches out to haul him back into bed. “Come on,” he says. “This time for real, <em>sleep.” </em></p>\n<p>Lan Wangji blinks but settles obediently beside him, allowing Wei Wuxian to arrange them into the optimal position for a restful night of sleep, which is to say Wei Wuxian sprawled over his chest, Lan Wangji’s chin resting atop his head. A good dinner, nice wine, a roof over his head, a fantastic round of sex, and his husband beside him in bed - Wei Wuxian is feeling immeasurably content. </p>\n<p>“Lan Zhan,” he says as Lan Wangji pets soothingly down his back. Lan Wangji doesn’t answer. Wei Wuxian pulls a face and tugs pointedly at his robes. Louder this time, <em>“Lan Zhan.” </em></p>\n<p>Lan Wangji shifts beneath him, tilting his face down to meet Wei Wuxian’s gaze. “Hm?” </p>\n<p>Wei Wuxian wants to pretend to pout at being, however unintentionally, ignored, but one look at Lan Wangji’s sleepy, satisfied face and he finds he doesn’t have the will to tease. Instead, he says, as has become their tradition, “I’ll see you tomorrow, Lan Zhan.” </p>\n<p>The corner of Lan Wangji’s mouth lifts, just a little. “Tomorrow,” he agrees. </p>\n<p>Assured, Wei Wuxian resumes his position and closes his eyes. He dreams sweetly, and by the time the sun rouses him in the morning, he’s feeling languid and greedy. The bed is empty beside him, which given that it is clearly far past five is not unusual, and Wei Wuxian has confidence in his ability to coax Lan Wangji back between the sheets. </p>\n<p>He rolls over, blinking awake as he searches the room for his husband. He finds him standing by the window, back to him as he seems to observe the town below. Wei Wuxian stretches like a cat and calls, “Lan Zhan.” </p>\n<p>Lan Wangji does not answer. He does not move. The white of his robes is an immovable rock before Wei Wuxian’s gaze. Frowning, he calls again, louder this time, “Lan Zhan, what are you doing?” </p>\n<p>When Wei Wuxian says his name, Lan Wangji always turns to him. Always. Seeks his husband’s voice out like a sunflower turning bright petals towards the giving sky. Again, this time he does not so much as tilt his head in acknowledgement. </p>\n<p>The bud of unease that Wei Wuxian had suppressed last night flowers anew. He climbs from the bed, sweeping his inner robes from where they’d been left on the floor. He ties them loosely shut for modesty’s sake as he approaches Lan Wangji. Gently, hesitantly, he sets a hand to his shoulder. “Lan Zhan?” </p>\n<p>This time, at his touch, Lan Wangji turns to him. The relief at seeing his face is fleeting when he sees the blank expression greeting him; carefully banked wariness and concern hiding just beneath the iron set of Lan Wangji’s mouth. </p>\n<p>“What is it?” Wei Wuxian says, hand sliding down Lan Wangji’s shoulder to clutch at his robes. “What’s wrong? Are you okay?” </p>\n<p>Lan Wangji reaches out, catching Wei Wuxian’s worried hand. For a foolish moment, Wei Wuxian allows himself to relax into the familiarity of that grip, and then Lan Wangji speaks.</p>\n<p>“Wei Ying,” Lan Wangji says, voice slow and a pitch too quiet. A second later Wei Wuxian understands why. “I cannot hear.” </p>\n<p>.</p>\n<p>“I’m sorry,” says the village doctor as he closes his bag. “There’s really nothing I can do.” </p>\n<p>Lan Wangji is sitting very patiently on the bed, hands folded neatly in his lap and hair tucked behind his unhearing ears. Wei Wuxian, who has spent the whole examination hovering about like a particularly anxious wasp, can’t even hope to match his calm. </p>\n<p>“How can there be nothing?” he asks. “He certainly wasn’t deaf when we went to bed last night - there has to be <em>something </em>causing it.” </p>\n<p>The doctor shakes his head. “If there is, I can’t find it,” he says. “As far as I can tell, this young master is in perfect health. Above perfect, truly, even by cultivator standards. There is nothing at all wrong with his ears, with his head, or with anything else I can find.” </p>\n<p>“There has to be <em>something,” </em>Wei Wuxian presses. “Have you -” </p>\n<p>“Wei Ying.” Lan Wangji reaches out and catches one of his hands, uncaring of the doctor standing before them. He meets Wei Wuxian’s eyes seriously, and even without another word Wei Wuxian can tell he’s being gently scolded. </p>\n<p>He deflates, heart sinking straight to his boots. To the doctor, he says, “Thank you for your help. I’m sorry to have imposed on you so early in the morning.” </p>\n<p>The doctor shakes his head once more. “Not at all. I’m only sorry I couldn’t offer you any assistance.”</p>\n<p>He refuses the money Wei Wuxian offers him and bows once on his way out the door, even though truthfully Wei Wuxian probably should be paying respect to him. It makes him feel twice as guilty for his uncharacteristic snappiness, although going by the pitying look the doctor shoots him as Wei Wuxian closes the door, he’s both understood and forgiven. </p>\n<p>If it is not a problem of the body, then it is a problem of the spirit, and that is much, much worse. </p>\n<p>He takes a moment to paste on the most reassuring smile he can manage before he turns around and returns to his husband. Lan Wangji watches him approach with narrowed brows and holds out a hand that Wei Wuxian gladly takes as he squats down to put them at eye level. </p>\n<p>“Lan Zhan,” he says, trying to enunciate as clearly as he can. Lan Wangji’s eyes fixate on his mouth. “Can you understand me?” </p>\n<p>A lingering pause and then Lan Wangji gives a small nod. Wei Wuxian breathes a sigh of relief and reaches out, gently retucking the hair that had fallen from its position behind his ear. He tries to keep his voice low, focusing more on shaping the words than pronouncing them. “The doctor can’t help. We need to return to Cloud Recesses.” </p>\n<p>He’s not sure that Lan Wangji understands the sentence as a whole, but he must catch the end, familiar with the way his home looks falling from Wei Wuxian’s mouth. “Returning to Cloud Recesses?” </p>\n<p>Wei Wuxian nods. “Hopefully, your uncle or your brother can help.” </p>\n<p>Lan Wangji’s eyes flick from Wei Wuxian’s mouth to his eyes again. “We shall leave after breakfast.” </p>\n<p>A wave of fondness so intense it nearly disorientates him sweeps through Wei Wuxian. “No, Lan Zhan. We can eat on the road. The sooner the better.” </p>\n<p>Lan Wangji’s frown deepens. Gently, he extricates himself from Wei Wuxian’s grip and stands. For a second, Wei Wuxian thinks he’s obeying, ready to swoop the rest of their possessions neatly together, ready to depart. Instead, he opens the door and catches the attention of a passing inn attendant. “May we please request our meal be brought to the room?” Lan Wangji says, so calmly and serenely you’d never guess he’d woken deaf and confused only an hour ago. </p>\n<p>“Lan Zhan,” Wei Wuxian starts to say, ready to complain, before abruptly remembering that with his back turned, Lan Wangji has no way of knowing he’s speaking to him. He grits his teeth against the pulsing waves of frustration that roll over him. </p>\n<p>Lan Wangji nods once to the inn attendant before shutting the door and turning back to Wei Wuxian. He clearly sees the upset expression on Wei Wuxian’s face and assumes it’s directed at him. Lan Wangji says, “We shall leave once you have eaten a proper meal.” </p>\n<p>The mulishness of it manages to soothe the mounting irritation at the situation. He thinks not enough people seem to understand just how stubborn the mighty Hanguang-Jun really is - unshakable in his resolution whether the situation be breakfast or war.</p>\n<p>“Alright, alright,” Wei Wuxian says, conceding because if the time between Lan Wangji waking and the useless examination ending hadn’t caused him new grief, then surely they have enough time left to have one last meal before they begin the not insubstantial trek back to Gusu. “Breakfast first; but <em>then </em>we’re heading out, okay?” </p>\n<p>He points threateningly at his husband, but as ever, Lan Wangji is utterly uncowed. He comes back to join Wei Wuxian be the bed, bending down to cup his face, kissing him warmly. “Then we leave,” he agrees. “Xichen will be able to help.” </p>\n<p>Lan Xichen better know how to help, because if they must go to Lan Qiren, Wei Wuxian’s pretty sure he’s going to turn his own nephew into a widower. </p>\n<p>.</p>\n<p>They’re a few days out from Gusu by foot, which is unfortunately how they’re stuck travelling for the time being because it’s not exactly like Lil Apple can straddle a sword. Wei Wuxian makes Lan Wangji promise to tell him if things seem like they’re taking a downward turn so they can bribe some kind farmer to look after his useless donkey and fly the rest of the way. </p>\n<p>Out in the bright sunlight with the town disappearing behind them, Wei Wuxian manages to find equilibrium again. They stride side by side, Lil Apple plodding along behind them, and Wei Wuxian talks and talks even though he knows Lan Wangji can’t hear him. It doesn’t bother him as badly as he feared it might. Not even marriage has turned his husband into an avid conversationalist, and Wei Wuxian often spends their time together aimlessly rambling, creating conjecture out of thin air for his own amusement. </p>\n<p>Given the natural way of things, it is very easy to pretend that nothing is wrong at all. </p>\n<p>Wei Wuxian talks about the juniors who are no longer very junior at all, and he talks about taking the time to visit Jiang Cheng next month for his birthday. He talks about the interesting market stall they’d stopped at for souvenirs yesterday, and he talks about how much of a shame it is that they’d paid to have a bed for two nights and only managed to enjoy one. </p>\n<p>Beside him, Lan Wangji is silent. Whenever Wei Wuxian glances up, Lan Wangji glances up too, and their eyes meet, catching in a moment of silent understanding. The corner of Lan Wangji’s mouth is ever so slightly pinched, and Wei Wuxian has to look away each and every time lest it ruin the illusion of normalcy. </p>\n<p>They don’t stop for lunch, eating on the road and washing their sticky fingers with the water they carry. By the time darkness finally begins to encroach on the horizon, Wei Wuxian’s throat is hoarse from talking nonstop with nobody around to hear him, and he’s practically vibrating out of his skin with the intensity of his emotions. </p>\n<p>He does his best not to let Lan Wangji see this however, cheerfully helping him set up their camp by spreading their robes on the ground, overlapping one another. Usually, this would be the time where they wander off to forage or hunt for dinner, but the very thought of dragging a deaf and off kilter Lan Wangji through the dimming light and into the trees where <em>anything </em>could sneak up on him is enough to make his heart beat against his ribs like a drum. Instead, he scrounges out the last of the dried fruit from lunch and divides it between them. </p>\n<p>Lan Wangji catches his hands as Wei Wuxian goes to press his share into them. “Wei Ying,” he says. “I am fine.” </p>\n<p>“Of course you’re fine,” Wei Wuxian says immediately. “You’re Hanguang-Jun, one of the Twin Jades of Gusu Lan - it’d take more than a bit of spiritual backlash to do you in. Certainly not when you’ve got such a fearsome, brave, and kind husband to watch your back.” </p>\n<p>He doesn’t expect Lan Wangji to respond. It’s getting too dark from him to watch Wei Wuxian’s lips, and Wei Wuxian knows that he tends to talk too fast when he’s nervous. Instead, catching him by surprise, Lan Wangji says, “I am fine. I have Wei Ying.” </p>\n<p>Wei Wuxian stares at him, still hunched over on his knees with their joint hands cradling soft, squishy fruit. He doesn’t know why it should surprise him that even when Wei Wuxian’s voice can no longer reach him, his faith does not shake, and neither does his indescribable ability to know everything Wei Wuxian ever wants to say to him anyway. </p>\n<p>“Lan Zhan,” he says, helplessly, and then lets their dinner fall to the ground so he can throw himself in his husband’s lap like an idiot. </p>\n<p>To his credit, Lan Wangji catches him seamlessly. They wind up in the dirt, Wei Wuxian’s hands in Lan Wangji’s hair, kissing him deeply. Lan Wangji doesn’t protest, not that he ever does, hands sliding into Wei Wuxian’s robes familiar and comforting, grounding Wei Wuxian in a way that, back when he was younger, he’d never imagined a touch could. </p>\n<p>To call the way they frantically rub against each other sex would be generous at best. They don’t even get undressed, barely manage to untie their robes enough so as to get their hands on one another. Wei Wuxian doesn’t mind too much - this kind of sex is good too, although to be fair any kind of sex is good long as it’s with Lan Wangji.</p>\n<p>It’s only as he’s panting desperately into Lan Wangji’s ear, so so <em>so </em>close that he comes to an abrupt realization - last night, when Lan Wangji hadn’t shushed him, it wasn’t just because he was too distracted; it was because he’d already been struggling to hear, had needed Wei Wuxian to moan as loud as he could. </p>\n<p>This time, when he comes, it’s almost painful with the weight of realization pressing heavily against him, rubbing at the raw edges Wei Wuxian had been trying to soothe over since he woke alone and in silence this morning. Lan Wangji follows him a moment later, fingers pressing fresh bruises into Wei Wuxian’s skin, overlapping the ones he’d left the night before. </p>\n<p>They lay together for a moment, foreheads pressed tight, Lan Wangji’s ribbon cool against Wei Wuxian’s skin. When he catches his breath, he turns to press his mouth against Lan Wangji’s cheek so he can feel the movement of his lips and says, “Lan Zhan. Lan Zhan.” </p>\n<p>“Hm?” The hands on him rub up and down his back. Wei Wuxian is hopeless with adoration. </p>\n<p>“I love you. I hate that you can’t hear me say that.” He kisses his cheek, his nose, and then down, mumbling again into the heat of his mouth, “I love you.” </p>\n<p>Lan Wangji pulls back, reaching up to cup Wei Wuxian’s face. The sun had truly set while they’d been rolling around in the dirt, and he can just barely see the glimmer of his eyes. “Wei Ying,” he says, thumb stroking over his cheekbone. “I love you.” </p>\n<p>Lan Wangji never says “I love you too” - just always “I love you”. Never a response and always an earnest declaration. </p>\n<p>With a sigh, Wei Wuxian lets his head fall to Lan Wangji’s chest, winding his arms around him tightly. “It’s going to be okay,” he says, with as much conviction as he can manage, unsure if he’s trying to reassure Lan Wangji or himself. “We’ll fix this. Just you wait and see. By this time tomorrow, things will be looking much better.” </p>\n<p>Lan Wangji’s hand comes up to rest gently at the nape of his neck. Softly, he says, “Goodnight, Wei Ying. I will see you tomorrow.” </p>\n<p>Despite himself, Wei Wuxian smiles. He kisses the strip of skin beneath him. “See you tomorrow, Lan Zhan.” </p>\n<p>(Wei Wuxian stays awake for hours after, listening to Lan Wangji’s breathing, his heartbeat, fingers loosely pressed against the steady pulse in his wrist.) </p>\n<p>.</p>\n<p>The next morning Wei Wuxian wakes first, which is unusual but not uncommon. He thinks about getting up, but he doesn’t want to wake Lan Wangji, so he stays curled by his side, arm over his chest and head on his shoulder, enjoying the quiet morning. Somewhere nearby, he can hear the gentle sound of Lil Apple decimating the wild grass. </p>\n<p>Like this, it’s almost enough to convince him that yesterday had been but a dream, but Wei Wuxian knows better than to hope for impossible things. </p>\n<p>Eventually, Lan Wangji stirs. Wei Wuxian props himself up with an elbow, chin in hand, and watches as the long fan of his lashes blinks into wakefulness. </p>\n<p>“Good morning, Lan Zhan,” Wei Wuxian says, reaching out to stroke his hair. “How is - how are you feeling?” </p>\n<p>As expected, Lan Wangji still doesn’t seem to hear him. He stares up at the sky for a moment, brow creasing into a frown. He turns his head to the side so the gold of his gaze falls on Wei Wuxian. </p>\n<p>“Wei Ying.” </p>\n<p>Wei Wuxian smiles as brightly as he can manage. He does not stop patting Lan Wangji’s hair. “I’m right here,” he teases, giving one of the strands a pointed tug. “Where else did you think I’d go?”</p>\n<p>Something in Lan Wangji’s expression seems to falter. Immediately, an awful premonition dawns like a rising storm in Wei Wuxian’s already shaky heart. </p>\n<p>“Wei Ying,” Lan Wangji says. “I cannot see.” </p>\n<p>.</p>\n<p>There’s a small village a morning’s walk away, and, with the other choice being abandoning Lil Apple to the wilderness, they make it. </p>\n<p>With one hand, Lan Wangji allows Wei Wuxian to lead him, the other holding a sturdy branch that Wei Wuxian had fetched as a makeshift cane. His face is impassive, immovable as stone, and it’s almost enough to reassure Wei Wuxian until his gaze catches on Lan Wangji’s sightless, searching eyes. </p>\n<p>Unlike the day before, he can’t seem to make himself talk. All his words get trapped in his throat, choking him fiercely until it’s all he can do to simply breathe. What’s the point? Lan Wangji can’t hear him, can’t see him - can only tell that Wei Wuxian hasn’t run off and left him behind by the unfaltering grip on his hand. </p>\n<p>Once or twice Lan Wangji stumbles, foot catching on a root or pothole. Wei Wuxian always steadies him before he can go down, hands on his shoulders to haul him gently upright, but the minute tightening off Lan Wangji’s face speaks volumes. </p>\n<p>However helpless Wei Wuxian feels, Lan Wangji feels it at least a thousand-fold over. Lan Wangji is not a man made for feeling helpless, his life at the whims of others, and Wei Wuxian can only be feverishly glad that they’re never far from each other’s side - he cannot even begin to imagine Lan Wangji permitting anybody else to help him like this. </p>\n<p>Eventually, a small outlying farm bobs into sight and Wei Wuxian could cry from sheer relief. Gently, he guides Lan Wangji off from the road with the tight grip on his hand. “Okay, alright. We’re just going to see if these nice people are willing to care for a moody, ugly donkey and then we’ll be heading right back to Cloud Recesses. Okay, Lan Zhan?” </p>\n<p>The young couple who own the farm are in the fields, and look up curiously when they see Wei Wuxian approach, leading a gorgeous man with one hand and Lil Apple with the other. He’s sure they make quite a sight, but they don’t seem hostile; friendly in that way most small-town folks are, and Wei Wuxian is infinitely grateful. </p>\n<p>“Good afternoon,” he greets cheerfully. “I’m sorry to bother you both when you’re so clearly hard at work, but I was wondering if you might be interested in boarding this one for a small period of time.” Wei Wuxian gives a pointed tug on Lil Apple’s reins. “Of course, you’re more than welcome to put her to work on the farm, and I’d compensate you for your troubles.” </p>\n<p>The farmers exchange a bemused look. The woman stands upright, steadying the sleeping baby strapped to her chest with one dirty hand. “That one seems fond of you,” she says, as if the way Lil Apple is chewing maliciously on Wei Wuxian’s sleeve is some kind of indicator of great esteem. “Sure you wanna leave her behind?” </p>\n<p>Wei Wuxian is not emotionally prepared to explain the circumstances in which he’d been forced to make this choice. “I can send someone back to get her within a week or two,” he says. Then, because he’s feeling dangerously close to a meltdown, “Please.” </p>\n<p>The wife looks to her husband. They stare a silent conversation that Wei Wuxian is intimately familiar with from his own marriage. The baby on her chest starts to fuss and she glances back, one hand dropping down to hold it a little more firmly. “We have room in the barn,” she says. “It shouldn’t be a problem.” </p>\n<p>Wei Wuxian is so immensely, pathetically glad, but when he tries to press some money from Lan Wangji’s pouch into her hand she shakes her head firmly, pushing it back. “People in trouble need to look out for each other,” she says wisely. “Your donkey will be safe with us for the time being.” </p>\n<p>Lil Apple goes with her willingly, only shooting Wei Wuxian a single baleful glance before the promise of fresh grass coaxes her away. Wei Wuxian thanks the husband one last time before picking up Lan Wangji’s hand once more and leading him away and ought of sight. </p>\n<p>“Okay,” he says, gently slipping Bichen from Lan Wangji’s side and firmly into Lan Wangji’s free hand. “A blind man flying the both of us back to Gusu; what could possibly go wrong?” </p>\n<p>Lan Wangji’s fingers close around the hilt and he falters, frowning. “Wei Ying?” Wei Wuxian reaches out and takes his other hand, unfolding his fingers. Carefully, he traces out <em>Gusu </em>on his empty palm. Realization seems to dawn. “You wish to fly back?” </p>\n<p>Wei Wuxian squeezes his hand, patting the back of his fingers in confirmation. </p>\n<p>Lan Wangji does not seem convinced. “You would need to guide me.” </p>\n<p>Unhesitatingly, Wei Wuxian spells <em>trust. </em></p>\n<p>Lan Wangji folds his fingers atop Wei Wuxian’s. “I do,” he says, and then lowers Bichen into the air. </p>\n<p>It’s truly a blessing that Lan Wangji is as competent as he is, because he barely needs Wei Wuxian’s guidance to climb atop his sword. He holds out a hand in the general direction he clearly last remembers Wei Wuxian being to help him up too, and Wei Wuxian takes it, feeling a familiar pang of fondness. </p>\n<p>“Okay,” he breathes out once the both of them are settled. “What’s a little challenge to the two of us, hey? It’ll be easy.” </p>\n<p>It’s not easy. Wei Wuxian has to watch where they’re going with absolute focus, Lan Wangji’s arms wrapped firmly around his waist to keep them steady and secure. When they begin to list too much one way or another, he gives Lan Wangji’s robes a soft tug until their course is correct again. He’s not used to watching the ground fly by miles beneath them with such intensity, and his eyes water, head spinning with vertigo. </p>\n<p>He doesn’t complain. What does he even have to complain about? That he’s seeing <em>too much? </em>He’s sure that’s a problem Lan Wangji would love to have right about now.</p>\n<p>They leave the Lanling area, and by the time the evening is encroaching heavy and thick around them, they finally whistle through Moling. The mountains of Cloud Recesses loom ahead, the thick of the clouds above obscuring them, and Wei Wuxian has never been so grateful in all his life to return to Gusu like this. </p>\n<p>Careful to be gentle about it, he pulls at Lan Wangji’s robes; a very pointed downward tug. Lan Wangji immediately understands, and Bichen begins a very slow descent. Wei Wuxian keeps an eye on the approaching ground, and when it becomes frighteningly near, he squeezes the arms Lan Wangji has around him tightly. </p>\n<p>Dismounting is nowhere near as graceful as mounting had been. The distance between them and the pathway below is still a little too much, and Wei Wuxian stumbles as he leaps off, grunting and wheeling his arms in surprise to keep from going down. Although Lan Wangji can’t see or hear him, he seems to sense something amiss all the same because he asks, voice tense, “Wei Ying?” </p>\n<p>“I’m fine,” Wei Wuxian says uselessly. “Just - ahh. What I’d give to be as graceful as you Lans.” When he reaches up, they’re at such a height that he can set his hands on Lan Wangji’s waist. He tries to convey what he wants without unbalancing him, a soft pull in his direction. “C’mon, Lan Zhan. Promise I won’t let you eat dirt.” </p>\n<p>“You want me to jump?” Lan Wangji guesses, and Wei Wuxian rewards him with another gentle pull. </p>\n<p>Despite being both deaf and blind, Lan Wangji somehow manages to leap off with much more poise than Wei Wuxian had managed, long hair fluttering and robes a brilliant white against the pitch darkness behind him. Wei Wuxian cannot help but smile stupidly as he gently guides Lan Wangji back to the ground in front of him. Without its master’s directions to guide it, Bichen clatters to the dirt. </p>\n<p>“Wow,” Wei Wuxian says, lifting one hand from Lan Wangji’s waist to push his husband’s wayward hair back behind his ear. “I can’t believe we really did that. How long do you think we were flying blind for? It has to be nearly bedtime in your sect by now.” </p>\n<p>“Wei Ying,” Lan Wangji says, reaching out to catch the hand in his hair, giving it a tight squeeze. “We are in Gusu?” </p>\n<p>Wei Wuxian returns the squeeze in silent confirmation and Lan Wangji lets out a deep, steady breath that he suspects he's been holding for days now. They’re home - they’re safe. </p>\n<p>The winding path they’d landed on takes them right to the foot of the impressive stairs that carve through the mountains. Up ahead, Wei Wuxian can see the bright light of the lanterns that lead the way and then, beside the perfectly carved stone, a set of people in the unblemished white of the Lan robes guarding against the crawling evening.</p>\n<p>Wei Wuxian does not cry, because he’s far too strong for that, but the overwhelming relief nearly bowls him over. He’s a bit too overcome for speech, but he waves a hand frantically in the air, and the eyes fall to him immediately. </p>\n<p>“Senior Wei?” It’s one of the juniors, although Wei Wuxian would be hard pressed to recall his name right now. “I thought you and Hanguang-Jun were still traveling?” </p>\n<p>Wei Wuxian and Lan Wangji finally hit the pool of light illuminating the stairs and both the boys standing before them startle when they see Lan Wangji trailing behind him, holding tightly to Wei Wuxian’s hand. Wei Wuxian tries for a smile that feels uncomfortable on his face. “Yeah,” he says. “Slight change in plan.” </p>\n<p>One of the alarmed juniors stays with them as they climb the stairs, the other running ahead to alert Lan Xichen and Lan Qiren about the mess Wei Wuxian has promptly dragged to their doorstep. Wei Wuxian would feel worse about stirring trouble so late at night if he hadn’t just spent the past two days all but terrified out of his wits as his husband’s body slowly rebelled against him. </p>\n<p>The stairs prove to be something of an ordeal, which Wei Wuxian feels he should have anticipated. Thankfully, like everything else in Cloud Recesses, each and every step has been carved with unnerving precision, and once Lan Wangji falls into rhythm, he rarely trips. Wei Wuxian still pointedly refuses to let go of his hand, and the way Lan Wangji clings tightly to it tells him he’s made the right choice. </p>\n<p>By the time they reach the entrance to the compound, both Lan Wangji’s brother and uncle are waiting. Lan Qiren is scowling fiercely, arms folded tightly over his chest, but Lan Xichen’s expression is as tense and worried as Wei Wuxian has ever seen it, and at this point he’s seen Lan Xichen through a lot. </p>\n<p>“Sect leader Lan,” Wei Wuxian says. “You would not believe how relieved I am to see you.” </p>\n<p>Thoroughly distracted by the sight of his brother, Lan Xichen sweeps forward to gently lay a hand on Lan Wangji’s shoulder. “Wangji,” he says, low and urgent. “What has happened?” </p>\n<p>Feeling an abrupt touch that clearly does not belong to Wei Wuxian, Lan Wangji flinches back. Lan Xichen looks momentarily dismayed before he manages to bury it away. Wei Wuxian hurriedly turns the hand he’s holding over and traces out, as clearly as he can manage, <em>brother. </em></p>\n<p>Lan Wangji’s face flickers. He turns to look several inches away from his family. “Brother?” </p>\n<p>“Wangji,” Lan Xichen says again, a bit helplessly. He turns to look at Wei Wuxian. “What happened?” </p>\n<p>Wei Wuxian throws his free hand into the air as the bubble or frustration that has been slowly expanding within his chest teeters towards an explosion. “We have no clue! He just… woke up like this. First, he couldn’t hear, and then this morning he woke up blind. The doctor we spoke with failed to find anything either.” </p>\n<p>The thunderous look on Lan Qiren’s face could put a storm to shame. “Take him back to the Jingshi,” he says. “Try not to let the other disciples see him. We do not need to cause undue concern.” </p>\n<p>Wei Wuxian thinks any concern at this point is more than due, but he has better things to do than argue with Lan Qiren right now. He turns back to Lan Wangji and tugs gently on his hand. “Come on, Lan Zhan. We’re going home, okay?” </p>\n<p>The familiar path back to the Jingshi seems to take forever. Lan Xichen walks beside them, his tight expression a solid deterrent for any Lan members who think of approaching. Wei Wuxian stops Lan Wangji before the steps inside, takes his hand, and traces out the shape of a staircase on his palm as warning. </p>\n<p>Inside, the Jingshi is just as they left it, clean and sandalwood scented, the gauze of the curtains a thin barrier to the moonlight outside. The comfort of it eases the tight knot of tension wrapped around Wei Wuxian’s bones, if only a little, and he lets out a steady breath as he guides Lan Wangji past the low table to the bed. Lan Wangji’s hand fumbles along the edge for a second before he sits, Wei Wuxian’s guiding hands on his shoulders. </p>\n<p>When Wei Wuxian turns back around, Lan Xichen is watching, looking almost stricken. Wei Wuxian has had days to get used to this, but he supposes this is a first for Lan Xichen - to see his proud, independent brother so utterly helpless, dependent on Wei Wuxian for something as simple as crossing a room. </p>\n<p>“You’d be surprised how well he’s taking this,” Wei Wuxian says. “If it were me, I think I’d have had a breakdown on the first day.” </p>\n<p>Lan Xichen does not look reassured in the slightest. “And you say it’s been how long?” </p>\n<p>“This is day two,” he says. “We came back as soon as we could, I promise.” </p>\n<p>“Last I heard you were still days out. How did you make it back so soon?” </p>\n<p>“We flew,” Wei Wuxian admits. </p>\n<p>Lan Xichen stares at him for a second. “My brother is currently blind, Wei Wuxian.” </p>\n<p>“It was an exciting trip.” </p>\n<p>The door the Jingshi rattles open and they turn to see Lan Qiren returning, accompanied by a tall woman dressed pristinely in Lan white. </p>\n<p>“This is Lan Feiyan,” Lan Qiren says, following after her. “She’s the best doctor the Lan sect has ever produced.” </p>\n<p>She has a sharp but not unkind face, and she makes a beeline straight for Lan Wangji, gently easing Wei Wuxian out of the way as if he’s nothing more than a minor obstacle. The second Wei Wuxian’s hand slips from Lan Wangji’s grip, his husband says, “Wei Ying?” </p>\n<p>Unhesitating, Wei Wuxian wiggles back around the newcomer and takes Lan Wangji’s hand again, giving it a very tight squeeze. The sudden tightening of Lan Wangji’s shoulders eases instantly. </p>\n<p>“I’m staying here,” Wei Wuxian says stubbornly, sweeping the room with a glare, daring them to contradict him. “Right now, I’m the only thing Lan Zhan is familiar with.” </p>\n<p>Lan Feiyan clucks her tongue. “You can stay, just do not get in my way,” she says. She points to the best beside Lan Wangji and says, like Wei Wuxian is a dog, “Sit.” </p>\n<p>Wei Wuxian pulls a face but after she arches a brow at him he rushes to obey. </p>\n<p>“How have you been communicating with him?” she asks, and it takes Wei Wuxian a second to realize she’s asking <em>him. </em></p>\n<p>“Poorly, mostly,” he says. “I’ve been kind of tracing words or such on his palm. So long as it’s simple, it’s been working.” </p>\n<p>“Smart,” she says. Behind her, Lan Qiren scowls, as if Wei Wuxian being praised in any capacity, even in assistance to his nephew, is a personal affront to him. Oblivious, Lan Feiyan says, “Can you let him know I need to examine him.” </p>\n<p>Wei Wuxian is both surprised and deeply grateful that she thought to ask. Carefully, he turns over Lan Wangji’s hand. <em>Doctor, </em>he writes, as neatly as he can. Then again, for emphasis. <em>Doctor. Touch. </em></p>\n<p>Lan Wangji frowns and then, incredibly astute, asks, “Lan Feiyan?” </p>\n<p>His husband is so fucking smart. He gives the hand he’s holding a squeeze, patting soothingly along Lan Wangji’s knuckles. Lan Wangji turns his head vaguely in the direction of the others and says, “You have my permission to do what you need.” </p>\n<p>To Wei Wuxian, Lan Feiyan says, “Keep holding his hand. The more comfortable he is, the easier this will be.” </p>\n<p>Unlike the doctor they’d seen in the village, she wastes no time with any genuine medical exam. Instead, she sets her fingers first on the pulse point of his other wrist, and then up at his temple. Wei Wuxian can just barely see the thin tendril of spiritual energy she’s passing between them, familiar with it from the dozens of times Wen Qing had forced such an examination him. </p>\n<p>(the hurt that shivers through him at the memory is dull but present - at this point, he’s resigned to the fact it will never fade, and if he’s being truthful, he doesn’t think he wants it too.) </p>\n<p>The Jingshi is full of tense silence, everybody watching fixedly. Lan Wangji sits patient and quiet, allowing the foreign touch without a word, but the increasing grip he maintains on Wei Wuxian’s hand tells him that he’s not nearly as comfortable as he’s striving to appear. </p>\n<p>Eventually, Lan Feiyan pulls away, getting back to her feet. Unable to even pretend at the legendary patience of the Lans, Wei Wuxian anxiously asks, “Well?” </p>\n<p>“It’s a curse,” she says, no beating around the bush at all. “A nasty one too, by the look of it.” </p>\n<p>“A curse?” Wei Wuxian blinks at her, taken aback. “From <em>what?” </em></p>\n<p>“That is what you should be telling us,” Lan Qiren says, one hand rubbing over his chin. “Why does it only seem to be with you that my nephew runs aground of such nefarious things?” </p>\n<p>Most of the time, Wei Wuxian has a pretty good handle on his temper. He has to. It’s the result of nearly two decades of the world believing him to be an evil demonic entity capable of any manner of apocalyptic mischief on the wind of a whim. He can’t afford to go around fanning the flames of an entire generation of fear. Right now though, Wei Wuxian has spent countless hours watching his husband succumb to something awful that both of them are powerful to stop. He is perhaps, if he’s being honest, not at his best. </p>\n<p>“If you’re implying I did something to Lan Zhan,” Wei Wuxian snaps, “why don’t you just come out and say it clearly?” </p>\n<p>Lan Qiren blinks, clearly startled to have Wei Wuxian biting back, but a moment later his face drops into a dark scowl. Before he can say anything else, Lan Xichen steps in front, blocking the both of them from each other’s views. “We both know that you would never do anything to intentionally hurt Wangji, Wei Wuxian,” Lan Xichen says gently, but it’s not enough to appease him. </p>\n<p>“Intentionally? So you’re implying that I may have done something unintentionally?” </p>\n<p>“I am not,” Lan Xichen says, and the response is so clear, so immediate, that Wei Wuxian manages to reign back in his fraying temper, banking the embers of annoyance. “We can only thank you for your efforts in taking care of Wangji throughout this trial.” </p>\n<p>Wei Wuxian sighs. “You don’t need to thank me,” he says. “It’s wasn’t like I was doing it for gratitude. Lan Zhan is my husband. He’d do this and more for me too.” </p>\n<p>Wresting the conversation back, Lan Feiyan asks, “Do you know where the curse may have come from? I would be very impressed if this was something you just managed to stumble across.” </p>\n<p>Wei Wuxian shakes his head uselessly. “There’s nothing I can think of,” he says. “Believe me, I’ve been racking my brain. It was just a normal night hunt. Some fierce corpses disturbing a quiet village. It barely took us a few days to complete.” </p>\n<p>“There was nothing unusual about it at all?” Lan Feiyan presses. “You didn’t interact with anything strange? Didn’t upset any belligerent cultivators?” </p>\n<p>“Nothing!” Wei Wuxian says. “It was just Lan Zhan and I.” </p>\n<p>Lan Xichen sighs, as if he had expected as much. He casts his brother a lingering concerned look before turning to Lan Feiyan. “Can you break it?” </p>\n<p>Lan Feiyan purses her lips. “Usually in this case, the curse is best left to just run its course and pass in due time. It’s simple but it’s strong.” </p>\n<p>Wei Wuxian glances to Lan Wangji. He’s sitting placidly, long hair neatly parted over his shoulder and eyes listlessly staring into the middle distance. Wei Wuxian regrets every time he’s ever thought his husband looked like he’d been carved from marble. He faces forward and asks the question he’s been nursing all day, heaving and uncomfortable in the pit of his stomach. “What if it continues to get worse?” </p>\n<p>Lan Feiyan shakes her head. “Until I’m able to ascertain for certain what we’re dealing with, I advise against interfering unless it proves to be life threatening.” </p>\n<p>Silence falls like a funeral shroud. That had not been what anybody in the room had wanted to hear. It had certainly not been what Wei Wuxian had spent all day flying ceaselessly through the sky with only a blind man to keep him from falling to hear. </p>\n<p>He doesn’t realize the grip he has on Lan Wangji’s hand has turned to iron until, soft as fresh snow, Lan Wangji says, “Wei Ying?” </p>\n<p>Wei Wuxian starts, turning around and rubbing his fingers apologetically along Lan Wangji’s skin. “Sorry, sorry,” he says, even though he knows the words are falling on empty ears. “Everything’s fine, Lan Zhan.” </p>\n<p>Lan Wangji seems to hesitate and then he asks, “What does Lan Feiyan say?” </p>\n<p>Wei Wuxian doesn’t know how to tell him the truth. He raises Lan Wangji’s hand up and brushes a kiss along his knuckles, utterly uncaring of their audience. </p>\n<p>Lan Wangji’s fingers unfold to brush first along Wei Wuxian’s chin and then up to his cheek. He says, “Wei Ying, we will figure it out.” </p>\n<p>His husband is so smart. So fucking smart. For once, Wei Wuxian hates it with a passion. He wishes he could give Lan Wangji the comfort of ignorance at least. A moment of peace in this nightmare. </p>\n<p>Behind them, Lan Xichen says quietly, “I’ll have dinner sent for you. I imagine you’re both tired after recent events.” </p>\n<p>Wei Wuxian nods, but can’t find the energy to turn away from Lan Wangji’s seeking fingertips. “Thank you,” he says.</p>\n<p>From the corner of his eye, he sees Lan Qiren leaving without so much as a word, despite the fact Wei Wuxian thinks that’s probably considered rude. He doesn’t care. Now that the tension is leaking from him like air from a punctured kite, he thinks he can probably understand that, in his own frigid way, Lan Qiren is struggling. </p>\n<p>Lan Feiyan says, “I’ll be sleeping just down the path for now in case you have need of me in the night. Do not hesitate to come fetch me should something happen.” </p>\n<p>Wei Wuxian nods. “Thank you for your help. I’m sorry we had to meet under these circumstances.” </p>\n<p>That manages to wrangle something that might be a smile from her. “As am I.” </p>\n<p>Lan Xichen lingers after the other two excuse themselves. Wei Wuxian is completely unsurprised. “Do you want to speak with him?” he asks. “Lan Zhan is familiar enough with your handwriting that it ought to be fine.” </p>\n<p>Lan Xichen looks divided. Clearly, the answer is yes, but he knows his taciturn brother well enough to understand how poorly he traditionally reacts to unannounced touch. “I do not think Wangji would be comfortable with that,” he hedges. </p>\n<p>Wei Wuxian snorts. He plucks Lan Wangji’s hand from his lap and once again traces out <em>brother - touch. </em></p>\n<p>Lan Wangji inclines his head and Wei Wuxian smiles at him. Turning back to Lan Xichen, he offers him Lan Wangji’s upraised palm. “It’s fine,” he insists. “Trust me.” </p>\n<p>Lan Xichen does not look entirely convinced, but he approaches. With very little regard to his pristine robes, he kneels gently on the floor before them and carefully takes his brother’s palm as if it’s made of glass and not as if it’s spilt more blood than could ever be measured. </p>\n<p>Wei Wuxian cannot tell what his fingertips write, but whatever it is it, it makes the corner of Lan Wangji’s mouth turn up ever so minutely. “I am well, brother,” he says. “Wei Ying has been taking care of me.” </p>\n<p>Lan Xichen and Wei Wuxian trades an amused glance before Lan Xichen writes something else. </p>\n<p>Lan Wangji says, “I do not know. At first, I was just struggling to hear. And then it was gone. My sight followed the next day.” </p>\n<p>Any flicker of amusement burns away quickly. </p>\n<p>Lan Wangji’s head is gently tilted as he focuses on the writing on his skin. “No, I am not in pain. I am as comfortable as I can be.” </p>\n<p><em>As comfortable as I can be while stuck like this, </em>is unspoken but present. </p>\n<p>Lan Xichen sighs. He spells one last thing that Lan Wangji does not seem to need to answer and then gets back to his feet. Despite the unhappy words, Wei Wuxian can instantly tell that just the short conversation with his brother has done wonders for the awful anxiety he imagines must have been eating at Lan Xichen since he first laid eyes on him. </p>\n<p>“I will leave the two of you be for the night,” he says. “I only ask that if you have need for Lan Feiyan, you also send for me.” </p>\n<p>“Of course,” Wei Wuxian says. </p>\n<p>Lan Xichen smiles at him, but it looks heavy and tired. “Rest for now,” he says. “We’ll confer again in the morning.” </p>\n<p>Wei Wuxian watches as he brushes his way out of the Jingshi, pausing for only a second on the threshold before he disappears out of sight. Wei Wuxian, who is very familiar with how it feels to leave a younger brother alone and pained, admires his restraint. </p>\n<p>Turning back to Lan Wangji, he takes his hand and strokes through his hair in a soothing gesture.</p>\n<p>“You’re worrying your brother,” he says. “The first thing you’ll see when you get your sight back is all the fresh grey in his hair.” </p>\n<p>He sits with Lan Wangji on the bed, carefully running his fingers through his hair with one hand and the tangled mess of the other knotted in his lap, until there’s a light knock on the door. When he gets up to answer it, one of the young disciples from the gate bows, presenting an unappetizing tray. </p>\n<p>“Senior Wei,” he says respectfully and then, after a clear moment of internal struggle, “is Hanguang-Jun okay?” </p>\n<p>Despite himself, Wei Wuxian cannot help but smile. Lan Wangji’s popularity with the younger generations has never ceased to both endear and amaze him. He supposes it shouldn’t surprise him so much when he thinks back to when Lan Sizhui was still just little A-Yuan, climbing over him in the teahouse and sitting on Lan Wangji’s lap like it was the coziest place in the world. </p>\n<p>Wei Wuxian takes the tray and says, “It’d take more than this to rattle your Hanguang-Jun.” </p>\n<p>The junior doesn’t look entirely appeased, but the impeccable manners of the Lan sect lead him to incline his head once more before he leaves without pushing the subject. Wei Wuxian watches the white vanish off into the night for a moment before he steps back, closing the door quietly and returning to his helpless husband. </p>\n<p>Dinner is slow. Wei Wuxian has to guide the bowl of soup into Lan Wangji’s hands and then his hands to his mouth. Twice, Lan Wangji nearly knocks over the accompanying dish until Wei Wuxian gently pulls the chopsticks from his hands. </p>\n<p>“Think about it like this,” he says faux cheerfully as he hand feeds his husband, “you’re usually the one spoiling me. It’s good to mix things up every now and again, you know? Keep things from going stale.” </p>\n<p>Lan Wangji is as silent as usual throughout the course of the meal, and Wei Wuxian can only pray as fiercely as he dares that Lan Wangji does not for a moment believe Wei Wuxian thinks less of him for this. Surely, after everything he has seen Wei Wuxian through - a rock bottom so deep it put every other moment of his life to shame - he would not deny Wei Wuxian the right to help him through the same? </p>\n<p>Once the food is mostly finished, Wei Wuxian stacks the dishes by the door. It’s easily past midnight by now, and Lan Wangji is listing sleepily into his side. Wei Wuxian helps him strip out of his outer robes, and then leads him to the bed where the two of them fall together in a tangled mess, Lan Wangji’s face pressed into Wei Wuxian’s throat, and Wei Wuxian’s hands tight around his waist. </p>\n<p>They don’t need to be able to talk to know what they’re both thinking, this Wei Wuxian is sure of. </p>\n<p>So far, the curse has worsened with each waking morning. If they choose not to sleep and thus not to wake, what could the curse latch onto? Probably, this counts as interfering, and certainly it is not the cleverest plan Wei Wuxian has ever thought of, but it’s all they’ve got. </p>\n<p>“Lan Zhan,” he mumbles. He reaches down and clumsily hauls one of Lan Wangji’s hands up, placing it over his mouth so the movement of his lips brush against Lan Wangji’s palm. “Lan Zhan, Lan Zhan, Lan Zhan.” </p>\n<p>Lan Wangji stirs, pulling himself up. His hair falls like a curtain over his shoulder and his empty gaze comes to rest just to the left of him. He catches hold of Wei Wuxian’s wrist, holding him still as he first kisses his palm, and then the flutter of his pulse beneath his skin, chasing up Wei Wuxian’s arm as his sleeve falls back. </p>\n<p>Unable to help himself, Wei Wuxian tosses his arms around Lan Wangji’s shoulders and brings him back down, his knees spread to cradle his hips. </p>\n<p>They kiss for an age that night but, for perhaps the first time in a very long time, it does not go much further. </p>\n<p>Lan Wangji’s hands gently caress every inch of Wei Wuxian’s body; a thumb pressing in the hollow of his throat, fingers circling his ankle, a hand hauling his knee up until it hooks around Lan Wangji’s waist - but he doesn’t push for more. It’s the most serene they’ve ever been in bed together like this, and Wei Wuxian presses his face into his husband’s chest and tries not to cry. </p>\n<p>Eventually, the sun begins to rise, spilling golden morning light through the thin curtains. </p>\n<p>Lan Wangji is awake, stroking soothing hands down Wei Wuxian’s sides. Wei Wuxian himself has struggled, coming close to dozing off several times, but always pulling himself back with the anchor of Lan Wangji’s touch on his skin. </p>\n<p>Outside, a bird twitters lightly, and Wei Wuxian rolls from his side to his back, staring up at the ceiling. He clears his throat and asks, “Lan Zhan?” There is, of course, no answer. He pulls gently on Lan Wangji’s robes for attention, twisting his head to watch as the man beside him shifts upright. </p>\n<p>His hair is rough, made positively ruinous by a night of Wei Wuxian’s greedy fingers, and the gold of his gaze is sleepy and soft even when it flickers past Wei Wuxian’s face. There’s a faint imprint in his cheek from the embroidery of Wei Wuxian’s robe he’d been resting atop, and Wei Wuxian reaches out, fingertips gently grazing it. </p>\n<p>“Good morning, Lan Zhan,” he says, hand cupping his face.</p>\n<p>Lan Wangji opens his mouth.</p>\n<p>Nothing comes out of it. </p>\n<p>.</p>\n<p>Wei Wuxian takes him to visit the rabbits in the afternoon. </p>\n<p>The morning had been fraught, both of them tense and clinging as Lan Feiyan examined Lan Wangji for the second time and came up with just as few answers as she had the first time. Lan Xichen had stood straight backed and equally as silent beside her, staring at his brother with a look of open grief that made Wei Wuxian uncomfortable to witness. </p>\n<p>It’s probably the first morning since he came to Cloud Recesses that the Jingshi really lived up to its name. </p>\n<p>He hadn’t told Lan Wangji where he was taking him, because the hope was he could shock a smile onto his face when he pushed his favorite rabbit gently into his hands. Lan Wangji may be as quiet on the topic as he wished, but Wei Wuxian is well aware that not only does he consider the rabbits to be a part of his home, that he shamelessly has favorites among the lot, ones that get extra fresh lettuce and he cradles extra close. </p>\n<p>When they get to the field by the cold spring where they live, Wei Wuxian is surprised to find somebody else there; a shapeless white form crouched in the grass, feeding the milling rabbits comfortably out of their hands. It’s only when the figure looks up that Wei Wuxian realizes who it is. </p>\n<p>“Sizhui!” he exclaims, thrilled. </p>\n<p>Lan Sizhui’s startled face drops into glowing warmth and he gets to his feet quickly, one rabbit cradled in the crook of his arm. “Senior Wei!” he says, as if Lan Qiren is lingering around the corner, waiting to catch him being overly familiar. His gaze ticks behind him to where Lan Wangji is lingering, hand clasped firmly with Wei Wuxian’s, and his enthusiasm falters. </p>\n<p>He doesn’t look surprised, just worried and saddened. “I take it you’ve heard the news?” Wei Wuxian asks.</p>\n<p>“Sect leader Lan told us this morning,” he says. “It’s… it’s true?” </p>\n<p>“What’s true?” Wei Wuxian says. “Lan Zhan’s just facing a little bit of a burden right now, but it’s nothing that a young one like you needs to concern yourself over. When has your Hanguang-Jun ever lost a battle of any kind, eh?” </p>\n<p>Lan Sizhui smiles, but it doesn’t quite reach his eyes. He comes closer, fat rabbit still dangling in his arms. “If Senior Wei says so,” he says, “it must be true.” </p>\n<p>Wei Wuxian reaches out to mess up his perfect Lan hair. “Of course it is. Now, what are you doing out here at this time? Don’t you have lessons?” </p>\n<p>“Ah.” Sizhui has the grace to pretend to look slightly abashed, but Wei Wuxian had helped raise him and sees through it easily. “I wasn’t sure if either of you would be up for leaving the Jingshi today, and I thought I might come by to see how Hanguang-Jun was.” </p>\n<p>Wei Wuxian studies him seriously for a moment. Lan Sizhui averts his eyes. Wei Wuxian says, “Sizhui, were you going to smuggle some rabbits into Cloud Recesses to leave with Lan Zhan?” </p>\n<p>Lan Sizhui looks down at the rabbit in his arms and then back up again. “It seems like Senior Wei had a similar idea,” he says shyly. </p>\n<p>The fragile edges of Wei Wuxian’s cold fear he’d been nursing since this morning thaw beneath the affection of one of his most beloved people. “In that case, I’d say it’s fifty-fifty on whether it’s a good one or not. Why don’t we find out?” </p>\n<p>He squeezes Lan Wangji’s palm softly before letting go to gently take the rabbit from Lan Sizhui’s arms. It stares up at him balefully, as if by daring to touch it Wei Wuxian had wronged it deeply. He snorts, turning around and gently arranging it into Lan Wangji’s startled arms. For a moment Lan Wangji looks caught off guard, and then realization seems to arrive and the narrowed edges of his features soften immediately, one of his pale hands stroking gently along the vibrant fluff of fur burying its face in his robes with far more enthusiasm than it had showed Wei Wuxian. </p>\n<p>Lan Sizhui laughs quietly, covering the small smile on his face with a hand. “They tend to miss him when the two of you are gone too long,” he says. </p>\n<p>“How can you tell?” Wei Wuxian asks. “They seem just as grumpy as usual to me.” </p>\n<p>“Maybe if Senior Wei were to stop threatening to eat them within earshot, they may warm to him?” Lan Sizhui suggests. </p>\n<p>“How far away would I need to go for that? Their ears are very big after all.” </p>\n<p>Something brushes against his ankles and Wei Wuxian looks down to see another rabbit drawing nearer, intent on Lan Wangji. He can’t help but grin; the high and might Hanguang-Jun beloved by fluffy animals and woodland creatures all the country over. He thinks outsiders to Gusu Lan might not be so intimidated by his expressionless face and cool gaze if only they could see him like this. It’s probably a pity that the only people Wei Wuxian ever intends to share that knowledge with already know it. </p>\n<p>“Here,” he says, stepping closer and laying a hand on Lan Wangji’s arm. “You’ve got an adoring audience vying for your attention, Lan Zhan.” Gently, he eases them down to the grass to sit and immediately the nearest of the rabbits approach, their soft noses bumping Lan Wangji’s knee or grazing Wei Wuxian’s fingertips. </p>\n<p>Lan Wangji is as patient with them as ever. He loosens his grip on the one in his arms, allowing it to settle on his lap, and blindly holds out a hand until one trails near enough to pet. Even his lack of sight isn’t an obstacle here, because the rabbits recognize their dearest friend instantly and huddle around him. The small crease between his brows he’s been nursing since waking speechless has, for the first time all morning, smoothed into flawless skin. </p>\n<p>“I think we can safely call this experiment a success,” Wei Wuxian declares, reaching out to tweak a floppy ear. </p>\n<p>Lan Sizhui gently crouches down beside them, arranging his robes to avoid grass stains on the unforgiving white with an ease that tells Wei Wuxian he’s had much practice at it. He’s watching Lan Wangji quietly, hands knotted atop his knee. “Do you think,” he asks, “that… is there a way you could let him know I’m here?” </p>\n<p>He looks almost embarrassed to ask, not quite meeting Wei Wuxian’s eye, but Wei Wuxian’s already tender heart warms further. “Of course,” he says, and reaches out to take Lan Wangji’s spare palm. </p>\n<p>Lan Wangji allows him to without so much as twitching, head tilted vaguely in Wei Wuxian’s direction even as he continues to placidly pet the rabbit fussing about beside him. Wei Wuxian considers for a moment how to best communicate their visitor. Lan Sizhui’s name is too complex for the rudimentary system of communication they’re working on, and he struggles to think of a way around that. After a moment, he smiles, thumb brushing Lan Wangji’s palm comfortingly before he traces a fingertip along his skin. </p>\n<p><em>Son. </em>He pauses for a second to give him a moment to process it and then traces it out again, firmer: <em>son. </em></p>\n<p>Lan Wangji’s fingers fold around his and Wei Wuxian knows he understands. Wei Wuxian turns back to Lan Sizhui and says, “He knows it’s you. Come on, you can’t say hello from over there.” </p>\n<p>When Wei Wuxian offers Lan Wangji’s hand in Lan Sizhui’s direction, he hesitates for a moment but he reaches out to take it. His fingers look incredibly small lined up alongside Lan Wangji’s own, but something about it really makes Wei Wuxian grin. Lan Wangji draws Lan Sizhui to the empty spot on the other side of him, and Lan Sizhui goes obediently, sitting close enough to Lan Wangji that their knees knock and their shoulders brush. It is far closer than anybody other than Wei Wuxian is ever usually permitted to sit, but right now touch is the only method of communication Lan Wangji has open to him, and Wei Wuxian would bet that he’s secretly delighted to have an opportunity to treat Lan Sizhui as a child again, the way he did before the iron propriety of the Lan clan necessitated a degree of distance. </p>\n<p>“Is this alright?” Lan Sizhui asks. </p>\n<p>“Lan Zhan doesn’t seem to mind,” Wei Wuxian says breezily. He bends down and scoops up a passing rabbit, plopping it in Lan Sizhui’s lap before he can start to overthink things. </p>\n<p>The morning breaks into early afternoon like that; the three of them sitting in a loose circle, tight-knit and familial as the rabbits come and go around them, growing bored with one person and moving onto the next. Wei Wuxian regales Lan Sizhui with an only slightly embellished retelling of their latest night hunt, and Lan Sizhui, like the dutiful son he is, listens attentively and only gently calls Wei Wuxian out on the more extravagant details. </p>\n<p>It’s the most peace Wei Wuxian has felt in days. The tension is still there, lurking like a fog in the very back of his mind, but for the time being he’s able to set it aside, focusing on distracting all three of them from the matter at hand. </p>\n<p>Wei Wuxian would be content to stay there until evening, truth be told, but eventually he hears the sound of approaching footsteps and glances up to see Lan Xichen, hands folded neatly behind his back and a faintly amused smile on his face as he observes them. Lan Wangji has one hand resting gently on Wei Wuxian’s knee and the other held tentatively by Lan Sizhui beside him. Wei Wuxian can imagine the picture they make, which is why he greets Lan Xichen with the sunniest smile he has in his not inconsiderable arsenal. </p>\n<p>“Zewu-Jun,” he says cheerfully. “What brings you out this way?” </p>\n<p>At the sound of Lan Xichen’s name, Lan Sizhui starts guilty, immediately rocketing to his feet. He drops Lan Wangji’s hand, then, seeming to think better of it, picks it up again and gives it the world's softest squeeze before letting go once more. Wei Wuxian is hopelessly charmed by Lan Sizhui’s thoughtfulness - his tacit understanding that his abrupt release may worry Lan Wangji, and the reassurance he follows it with. </p>\n<p>“I did not intend to interrupt,” Lan Xichen says indulgently. Not looking at Lan Sizhui, he adds, “I just heard a rumor that the classroom was emptier today than perhaps it usually is.” </p>\n<p>Lan Sizhui proves unabashedly that he’s as much of a product of Wei Wuxian’s influence as he is Lan Wangji’s by looking utterly unapologetic to be caught doing something as flagrantly disrespectful as skipping lessons. “My apologies,” he says with a perfect accompanying salute. “I’ll head straight to the classroom now. I did not mean to worry the Sect Leader.” </p>\n<p>Lan Xichen inclines his head. “The Sect Leader would have to find you in the act of violating the rules to be worried,” he says breezily. “Although, if he did, he might recommend that you were to tidy the rabbit fur from your robes lest Lan Qiren deduce where you’ve been.” </p>\n<p>Lan Sizhui flushes just slightly and brushes the fur hiding among the white of his robes. He turns to pay his respects to both Wei Wuxian and Lan Wangji, even though one really couldn’t care for such formalities and the other is utterly unaware of them. “May I come by to see Hanguang-Jun later?” he asks, as if Wei Wuxian would ever deny him time spent together. </p>\n<p>“Just Hanguang-Jun?” he teases. “What happened to all the lip service to respecting your Senior Wei?” </p>\n<p>“And Senior Wei too, of course,” he adds obediently without blinking, far too used to Wei Wuxian’s jokes. </p>\n<p>“Come by for dinner,” Wei Wuxian says. “I’m not as good of a cook as Lan Zhan, but I’m sure I can manage something for us.” </p>\n<p>“Ah,” Lan Sizhui says, “maybe it might be best to leave it to the cooks?” </p>\n<p>Wei Wuxian has the inclining that Lan Sizhui is implying something about his cooking, but before he can press, Lan Sizhui salutes once more and escapes back in the direction of the classrooms. To Lan Xichen, Wei Wuxian says, “He’s just being polite. Lan Zhan loves my cooking.” </p>\n<p>“I think he might have been suggesting that Wangji has been through enough for now,” Lan Xichen says, not unkindly. “I’ll arrange to have the cooks bring enough for four to the Jingshi tonight.” </p>\n<p>“Four, huh?” Wei Wuxian smiles. “I’m sure Lan Zhan would be very grateful for your company.” </p>\n<p>He’s almost certain that as Sect Leader, Lan Xichen has far more important things to be doing with his time than relentlessly checking in on his younger brother, especially when Wei Wuxian is already there to watch him, but he doesn’t question him. </p>\n<p>Lan Xichen observes the serene picture his brother makes in silence for a moment before he says, “Lan Feiyan is working hard to figure out a viable way to break the curse.” </p>\n<p>Wei Wuxian had suspected as much. This morning, when Lan Xichen had followed her into the Jingshi, Lan Xichen had been almost as mute as his brother had become through sheer concern. Wei Wuxian can still remember the horrified drop in his stomach that first morning he awoke to find Lan Wangji deaf, and can’t possibly begrudge anybody their moment of horror in return. </p>\n<p>“I’ll help as much as I can,” he says, but Lan Xichen shakes his head. </p>\n<p>“All you need to focus on is looking after Wangji,” he says. “I’m afraid there’s nobody else whom I can entrust this duty to.” </p>\n<p>Wei Wuxian wants to protest but he’s afraid Lan Xichen may take it as Wei Wuxian making light of the situation. He wouldn’t entrust anybody else with this duty either, but it’s hardly like he can’t multitask. </p>\n<p>Still, he says, “Of course.” </p>\n<p>“Thank you,” Lan Xichen says, earnest enough to nearly make him uncomfortable. His gaze flickers back to his brother, who is sitting patiently and quietly beside Wei Wuxian, gaze sharp but not worried. </p>\n<p>“I can let him know you’re here,” Wei Wuxian offers. </p>\n<p>Lan Xichen shakes his head. “I don’t wish to overwhelm him,” he says. “I can only imagine the stress he must be under as it is. I’ll speak with him tonight.” </p>\n<p>Privately, Wei Wuxian thinks Lan Xichen is being almost a step too considerate - this, although awful, is far from the worst thing Lan Wangji has ever suffered through. It would take more to really render him overwhelmed. He’s about to say as much when he catches sight of the tension drawing Lan Xichen’s shoulders tight and he has a quiet and perhaps belated realization. </p>\n<p>One of the Twin Jades is overwhelmed - it’s just not the one whose hand he’s holding. </p>\n<p>Abruptly, Wei Wuxian remembers sitting alongside Jiang Cheng’s bed many, many years ago now - his empty eyes gazing at the ceiling, his cold hand pressed between Wei Wuxian’s palms, totally unresponsive to all of Wei Wuxian’s wheedling and begging. The situations are different, but the audience is not; an elder brother’s greatest pain is to be utterly helpless in the face of a tragedy laying greedy hands upon the siblings entrusted to their care. </p>\n<p>He keeps his face peacefully blank and says, “Tonight, then. Lan Zhan and I will be looking forward to it.” </p>\n<p>Lan Xichen offers him a small smile. When he glances towards his brother his gaze flickers, but he turns, vanishing back towards Cloud Recesses without another word. Wei Wuxian watches him go and wonders what it is about this pair of brothers that causes him to worry so ceaselessly. </p>\n<p>There’s a squeeze at his hand and Wei Wuxian glances up to see Lan Wangji frowning at him, expression politely confused. Wei Wuxian softens instantly, turning his hand over so he can thread their fingers together. “Sorry, Lan Zhan,” he apologizes. “There’s nothing to worry about. We’re just having a very popular morning.” </p>\n<p>Lan Wangji cannot hear Wei Wuxian, but his frown deepens all the same. He seems to consider for a moment, and then he pulls free from Wei Wuxian’s grip and plucks the rabbit nesting on his lap. He pats around in the air for a moment until his hand lands on Wei Wuxian’s knee, and then, using that as a guide, gently situates the rabbit in Wei Wuxian’s lap instead. </p>\n<p>It startles a laugh out of Wei Wuxian, settling a hand on top of the one Lan Wangji still has buried in the fur. “A gift, huh? What is it with you and giving me animals, Lan Zhan. This one’s not even as tasty as the last.” He strokes along its silky back. “Ah, you have so many people worried, you know that? When you’re back to normal, we’re going to have to make so many apologies.” </p>\n<p>Lan Wangji’s regal expression does not change in the slightest. Wei Wuxian reaches up and hooks his fingers beneath his chin, tilting Lan Wangji’s face down to him so he can lean forward and, very carefully, press a kiss to the corner of Lan Wangji’s mouth. One of Lan Wangji’s hands climbs to his back, and he turns his head, taking Wei Wuxian’s mouth with his own so easily that Wei Wuxian does not doubt for a second that no matter what the universe takes from them, finding each other will continue to be as natural and uncomplicated as breathing. </p>\n<p>They stay like that for a moment, kissing quietly and unhurriedly, and when Wei Wuxian can summon the strength to pull back, he finds that Lan Wangji is smiling, just ever so slightly. </p>\n<p>Wei Wuxian brushes his thumb against the curve of his mouth. “Would you look at that,” he marvels. “If only you could see how handsome you are right now, Lan Zhan.” </p>\n<p>Lan Wangji twists to kiss the pad of his thumb, and this time it’s Wei Wuxian who breaks into a helplessly smitten smile. He lightly pats Lan Wangji’s cheek and then sets the rabbit in his lap aside, getting to his feet with a groan. “Alright,” he says, as he takes Lan Wangji’s hands and coaxes him upright. “Enough playing in the fields - let’s head back for now.” </p>\n<p>.</p>\n<p>By the time they return to the Jingshi, Lan Feiyan is waiting for them. There are faint lines underneath her eyes that tells Wei Wuxian that whatever sleep she’d gotten before she’d been roused this morning by Wei Wuxian’s frantic banging at her door wasn’t nearly enough. Still, she’s as thorough and uncompromising as ever as she pushes Lan Wangji to sit, fingers checking his pulse points and all the major throughways of his meridians. </p>\n<p>“Any ideas yet?” Wei Wuxian says, standing behind his husband with a hand to his shoulder. </p>\n<p>“I have some suspicions to the nature of the curse, but as for where it was obtained or how to break it, I’m still searching,” she says. </p>\n<p>She leaves them with a cup of foul-smelling tea that Lan Wangji drinks without complaint, and a stirring restlessness deep in Wei Wuxian’s gut. It’s not within his nature to simply sit by and let other people solve his problems for him, but he has the notion that Lan Feiyan would probably be even less receptive to his offers of assistance than Lan Xichen had been. </p>\n<p>There’s still plenty of time before the evening meal, and they spend it with Lan Wangji resting quietly, making up for the sleep lost the previous night, and Wei Wuxian sitting beside him on the bed, hand running soothingly through Lan Wangji’s hair as he writes out a brief summary of the last few days with the other, trying to order the chaotic rattling of his thoughts and wrangle his unreliable memory - hoping to shake loose any kind of hint as to Lan Wangji’s condition. </p>\n<p>Eventually, Lan Wangji stirs, and Wei Wuxian puts aside his note taking to help him out of the bed. Lan Wangji sits patiently as Wei Wuxian reties his outer robes and combs his hair back into some semblance of order. He doesn’t bother replacing Lan Wangji’s hairpiece - partially because any company they’re expecting will certainly not mind and largely because Wei Wuxian loves having it loose around his shoulders. </p>\n<p>To his surprise, Lan Sizhui and Lan Xichen arrive together, both bearing the dinner trays as Wei Wuxian steps aside to let them in. “Such service,” he says. “If I didn’t know better I’d say we were staying at some high class inn.” </p>\n<p>Lan Wangji inclines his head when Wei Wuxian gently tells him about their visitors, but he seems pleased in a way that only Wei Wuxian and his brother could ever read. Going by the slight smile on Lan Xichen’s face, it does not pass him by, for which Wei Wuxian is infinitely glad. </p>\n<p>He’d worried that between the Lan silence and Lan Wangji’s current reliance on Wei Wuxian the meal would be awkward, but Wei Wuxian has decades worth of practice at defusing any tension before it even has a chance to mount. He chatters away as he helps the soup bowl rise to Lan Wangji’s mouth, and then keeps chattering away as he gently feeds him from the plate, taking care not to embarrass either of them by dropping cabbage all over his pristine robes. </p>\n<p>To his relief, neither Lan Wangji’s brother nor their surrogate son so much as bat an eye. By the time the plates are clear, Wei Wuxian is feeling remarkably loose and relaxed; this is the first time in days he’s had proper, long-lasting company, and while he’s never minded spending his days hiding away with only Lan Wangji, the sheer loneliness of everything has been silently eating at him for longer than he’d ever willingly admit. </p>\n<p>They talk around Lan Wangji’s condition. Polite exchanges about Cloud Recesses and the travels of the last few weeks. Largely meaningless and comfortable. Lan Sizhui talks about a night hunt coming up with Jin Ling, hinting thinly how pleased they both would be if Wei Wuxian and Lan Wangji were to accompany them, and Lan Xichen lists the new rules that have made themselves at home on the wall, much to Wei Wuxian’s consternation. </p>\n<p>When Wei Wuxian goes to sprawl crookedly across the floor, Lan Wangji’s hands gently ease him back upright, apparently able to tell when Wei Wuxian is being rude with just his intuition alone. </p>\n<p>“Lan Zhan,” Wei Wuxian groans, as Lan Sizhui laughs. “Nobody’s here to see me, and it’s just the Jingshi.” </p>\n<p>Lan Wangji turns his lightly scolding gaze vaguely in his direction. <em>My brother is here, </em>it seems to say. <em>Be polite. </em></p>\n<p>Wei Wuxian grins hopelessly and even though he knows Lan Wangji can’t hear him, he says, “Nobody who minds, anyway.” </p>\n<p>“It’s alright,” Lan Xichen says, getting to his feet in an elegant sweep of white. “It’s getting close to curfew.” </p>\n<p>Lan Sizhui looks a little like he wants to disagree, but there’s not a Lan alive who would argue with Lan Xichen even before he became Sect Leader. He follows his lead, getting to his feet and gathering up the stack of trays. </p>\n<p>Amused, Wei Wuxian says, “We’ll still be here tomorrow, Sizhui.” </p>\n<p>Lan Sizhui’s cheeks pink, just a little. “I know, Senior Wei,” he says. “It’s just…” </p>\n<p><em>We don’t know what state Lan Wangji will be in by then, </em>is unsaid, but loud and clear all the same. </p>\n<p>Wei Wuxian can’t allow himself to think about that right now. Can’t permit himself to give into the helplessness clawing hungrily at his gut, sinking its claws in as tight as it can manage. Given the circumstances and his rapidly worsening condition, they’ve managed to have a pleasant day, not all that different from one they would have had if nothing had been wrong at all. Wei Wuxian desperately wants to cling to that illusion. </p>\n<p>“I might bring Lan Zhan to see the rabbits again tomorrow if you’d like to accompany us,” he says. Then, after a pointed glance from Lan Xichen, he hurries to add, “After lessons are finished, of course.” </p>\n<p>That draws a small smile from Lan Sizhui. “Of course,” he agrees. </p>\n<p>Wei Wuxian leaves Lan Wangji settled by the small table as he sees the others to the door. Lan Sizhui gently squeezes his hand before leaving and, to his surprise, even Lan Xichen seems to overcome his doubt long enough to gently lay his long fingers on Lan Wangji’s shoulder. </p>\n<p>Lan Wangji seems to recognize the touch even without Wei Wuxian there to interpret it, because he turns his head towards his brother, raising his shoulder into it in silent reassurance. Wei Wuxian does not think he imagines the sad smile that draws from Lan Xichen, but he turns, putting his back to them so he can help Lan Sizhui take the dishes to the door. </p>\n<p>Lan Sizhui heads back towards the dormitories, but Lan Xichen pauses on the threshold. He glances over Wei Wuxian’s shoulder to his brother and then back again. Quietly, as if sound is at all something they need to worry about now, he says, “Whatever happens tonight, please make sure to send for me immediately.” </p>\n<p>“You could stay if you’d like,” Wei Wuxian offers. “If you’re worried.” </p>\n<p>Lan Xichen shakes his head. “Wangji wouldn’t like that,” he says. “He doesn’t need me to see him when the curse rolls over.” </p>\n<p>Wei Wuxian knows he’s right. The fact that so far it’s only been Wei Wuxian there to witness the break of mornings has been far more than just coincidence. He would not necessarily call his husband prideful, but he is<em> proud</em>, and the moments where his whole world tilts on its axis is something he’d never permit anybody but Wei Wuxian to see of his own free will. </p>\n<p>Wei Wuxian inclines his head. “The moment something changes, we’ll let you know.” </p>\n<p>Lan Xichen doesn’t thank him this time, for which Wei Wuxian is grateful. He watches in the doorway for a moment as Lan Xichen disappears down the stone path, back towards his own rooms, step slow and thoughtful, before he rattles the door closed and returns to his husband’s side. </p>\n<p>He crouches down and takes Lan Wangji’s palm. Carefully, he traces out, best as he can, <em>bath. </em>Lan Wangji pauses to consider for a moment and then nods, understanding. Wei Wuxian leans up to kiss him, squeezing his hand, before he lets go and sets about making preparations. </p>\n<p>He has to leave the Jingshi to organize for the water, and every moment he has Lan Wangji out of his sight weighs on him heavily. He allows some of the other to fetch the buckets for him, but only permits them as far as the door. Wei Wuxian shuttles the water into the tub in the Jingshi himself, unwilling to let even the most well intentioned of the Lans within the comfort of their space. </p>\n<p>When he’s done and steam is wafting gently from the fine wooden tub, he fetches his husband from where he seems to be meditating serenely by the table. “I would have lit some incense for you if you’d asked,” Wei Wuxian says as he directs him behind the changing screen. “You can ask me things too, you know?” </p>\n<p>Unaware, Lan Wangji begins to strip out of his robes. Wei Wuxian bats his hands away, even though this at least he’s sure Lan Wangji could do, and works at the ties himself. The robes slip neatly off Lan Wangji’s broad shoulders, baring his pale skin to the dimly lit room. Unable to help himself, Wei Wuxian shuffles forward and very carefully places a kiss at the shadow of his collarbone. The way Lan Wangji shudders beneath his touch tells him he doesn’t mind. </p>\n<p>He helps Lan Wangji into the tub, one hand holding his and the other at his waist. He doesn’t have Lan Wangji’s strength, couldn’t pick him up and gently carry him to and fro the way Lan Wangji does to him when Wei Wuxian is half asleep and disagreeable in the morning. With their height difference, he’d probably drop him anyway. Not for the first time, Wei Wuxian misses his original body with a sharp pang that makes him grimace. </p>\n<p>Lan Wangji sinks gracefully into the water until it laps just above his mid chest. He tilts his head back, gathering his hair out of the way with a wet hand, turning it from darkness to the shine of wet ink. </p>\n<p>Really. Sometimes his husband is so beautiful Wei Wuxian can scarcely stand to look at him. </p>\n<p>“Here,” he says, dropping to his knees beside the tub and gently laying his hands on Lan Wangji’s skin. “Let me.” </p>\n<p>Lan Wangji allows Wei Wuxian to wash him easily, leaning into the cloth as Wei Wuxian pulls it across his skin, and then into Wei Wuxian’s hands as he runs them through his wet hair, washing that too. He looks at peace, eyes closed, utterly trusting and disinterested in taking charge. </p>\n<p>Wei Wuxian can't help but smile. He arranges Lan Wangji’s hair over one of his shoulders and leans in, pressing his mouth to the nape of his neck. He pauses, giving Lan Wangji a chance to push him away, but Lan Wangji only shivers beneath his touch and reaches back to wind his fingertips clumsily through Wei Wuxian’s hair. </p>\n<p>That’s all the encouragement he needs. He kisses down his neck, between his shoulder blades, at the top knot of his spine. One of his hands rests on Lan Wangji’s shoulder, the other gently running along the firm muscles of his side. He slides it lower, to his waist, and gives the tender skin there a playful pinch. Lan Wangji jerks in his grip, the breath that hisses from between his teeth sharp and sudden. </p>\n<p>Laughing quietly, Wei Wuxian takes pity and leans back, reluctantly pulling his hands away. “Sorry, Lan Zhan,” he says. “Couldn’t help myself.” </p>\n<p>He’s barely withdrawn his hand from the water when Lan Wangji twists in the tub to face him, water sloshing at the edges. His gorgeous face is as calm as ever, but there’s a flush climbing the length of his throat. He reaches out, hands seeking, and manages to fist them in Wei Wuxian’s robe, drawing him in. His lips brush Wei Wuxian’s cheek for a second before he finds his way to his mouth, determined and hungry. </p>\n<p>Lan Wangji’s kisses are not nearly as brief as Wei Wuxian’s had been; open mouthed and hot, his fingers working their way into Wei Wuxian’s hair so that he’s hopeless but to do anything other than kiss back, clinging to the tub in front of him for balance lest he be pulled into the water by the sheer strength of his husband’s enthusiasm. </p>\n<p>“Lan Zhan,” he gasps, when he finally manages to break away. “Lan Zhan, are you sure? We don’t have to do anything.” </p>\n<p>One of Lan Wangji’s hands falls from Wei Wuxian’s hair, traveling down the length of his arm until he can seize his hand. Without so much as blinking, he uses his grip to direct it to his body, Wei Wuxian’s palm pressing into wet, bare skin. Lan Wangji kisses him again, pointed and almost bossy, and Wei Wuxian grins against his mouth. </p>\n<p>“Okay, okay,” he says. “Not in the bath though, okay? We don’t want a repeat of last time.” </p>\n<p>Wei Wuxian’s hands settle on his shoulders, coaxing, and Lan Wangji seems to understand. He rises from the water like a god from a mountain stream, sleek and naked. Wei Wuxian’s mouth goes positively dry at the sight, and he nearly sends the both of them sprawling in his hurry to help Lan Wangji out of the tub, hands running over the wealth of skin before him. </p>\n<p>The trip to the bed is a mess, truthfully speaking. Wei Wuxian is too distracted to pay much attention to where they’re going. Twice, they trip over each other, and Wei Wuxian gets tangled in his robes in his rush to strip them off. Lan Wangji’s hands are more of a hindrance than a help, but each glance of his fingertips against Wei Wuxian’s heated skin makes him shiver until finally he can press his husband down onto the bed, doubtlessly soaking the sheets horribly, but Wei Wuxian couldn’t care less. </p>\n<p>“Lan Zhan,” he pants, settling on Lan Wangji’s thighs and skating his hands along his chest. Beneath him, Lan Wangji’s hair is spread like a blanket, his gold eyes hot and searching. “Lan Zhan, fuck, you really…” One of Lan Wangji’s hands creep up his thigh, squeezing tightly, and Wei Wuxian’s pointless murmuring is lost in a whimper. </p>\n<p>He leans down to kiss him again, helpless, and grinds against the hardness pressing against his thigh with the enthusiasm and deliberation that comes with long practice. The way Lan Wangji breaks away to groan silently against his cheek is very gratifying, and Wei Wuxian reaches down to wrap his palm around the heavy press of him. </p>\n<p>“What do you want?” he asks, pointless and desperate. “Whatever you want, Lan Zhan.” </p>\n<p>Lan Wangji presses up into Wei Wuxian’s touch and then, reaching down, guides Wei Wuxian’s hand lower between his legs. Instantly, Wei Wuxian’s heart trips over itself, a sudden blast of <em>wanting </em>almost rendering him as senseless as his husband beneath him. </p>\n<p>It’s not that they don’t do this, it’s just that each and every time Lan Wangji offers it Wei Wuxian feels positively overcome. Lan Wangji is a person who prefers to be in control of all things, and it’s a greater gift than can ever be put to words when he willingly cedes that control to Wei Wuxian, trusting him to take care of them both, to make it <em>good. </em></p>\n<p>Still, on the tail end of his instinctual <em>yes </em>comes a fleeting hint of uncertainty. With Lan Wangji likes this, it really… Wei Wuxian does not want to press for more than Lan Wangji can stand to give, to take advantage of his vulnerability in a moment where he can’t be anything <em>but. </em></p>\n<p>“Are you sure?” he asks again, even as he grips Lan Wangji’s thigh, hauling his leg around Wei Wuxian’s waist. “Lan Zhan, you have to be <em>sure, </em>okay?” </p>\n<p>Lan Wangji can’t hear him, but he must feel Wei Wuxian’s hesitation through all the points where they connect, because he arches up into his grip, one hand fisting in Wei Wuxian’s hair to direct his head down until Lan Wangji can press his mouth against his cheek. He can’t speak, but Wei Wuxian recognizes the shape of his name falling silently from Lan Wangji’s lips. <em>Wei Ying, </em>he says, quiet and devoted. <em>Wei Ying. </em></p>\n<p>It’s answer enough for Wei Wuxian. </p>\n<p>He takes his time opening Lan Wangji up, slippery fingers and a mouth pressed against Lan Wangji’s thigh, begging him for patience when he twists beneath Wei Wuxian’s hands. It should really be impossible that after so many years together they still seem to want each other so much, but Wei Wuxian’s shoulders shake with the effort of taking this as slow as either of them can stand, trying desperately not to roll his hips into the sheets beneath him to find relief. </p>\n<p>Lan Wangji’s hands claw at his back, hauling Wei Wuxian up and wrapping a stubborn leg around his waist. His cups Wei Wuxian’s cheeks, drawing him into a biting kiss, and when he grinds back against Wei Wuxian’s erection his intent is crystal clear. <em>Wei Ying, </em>he mouths again, as close to frustrated as the esteemed Hanguang-Jun ever gets. His heel digs into the low of Wei Wuxian’s back, pressing forward. </p>\n<p>Wei Wuxian laughs, breathless and panting. “Okay, okay,” he says, struggling to plant one hand on the bed beside Lan Wangji for balance. “God, even from the other side you’re as rough as always, Lan Zhan.” </p>\n<p>With a shaking hand he lines himself up and, after a breath, pushes in. Beneath him Lan Wangji throws back his head, tightening his grip on Wei Wuxian’s shoulders to bruising point. Wei Wuxian is hypnotized by the long line of his throat, sleek with sweat and bath water, and he bends down to feel the pounding of Lan Wangji’s pulse with his mouth. </p>\n<p>He holds one of Lan Wangji’s thighs with one hand, tucking it over his waist, and fucks into him; first careful, and then, as Lan Wangji urges him on, less so. The snap of his hips is loud in the quiet of the Jingshi, and Lan Wangji holds tightly to him, moving with Wei Wuxian smoothly, content with the pace he’s setting. </p>\n<p>Wei Wuxian uses his spare hand to push the hair from Lan Wangji’s face, watching adoringly as Lan Wangji turns his face towards the press of his palm. “Lan Zhan,” he says, breathless. “Gods, I wish I could hear you right now. I wish you could hear <em>me. </em>I could howl Cloud Recesses down and you wouldn’t even notice.” </p>\n<p>Lan Wangji’s head tilts back, and his mouth falls open. A quiet <em>ah </em>followed by the familiar shape of <em>Wei Ying. </em></p>\n<p>Wei Wuxian shudders. He loses his grip on Lan Wangji’s thigh, focuses on holding himself upright between Lan Wangji’s spread knees. Between them, Lan Wangji is leaking all over his stomach, and Wei Wuxian reaches down to grip him, shivering at the hardness and heat in his palm, the sensation almost as much of a turn on as the sight alone. </p>\n<p>Lan Wangji’s knees tighten around Wei Wuxian’s hips and his brow creases. A silent hiss escapes his lips, and his unseeing eyes snap open staring at the ceiling. He bucks into Wei Wuxian’s thrusts once, twice, and then shudders as he comes messily in Wei Wuxian’s hand. </p>\n<p>It’s all Wei Wuxian needs. He’s barely holding back as he is - his stamina in bed has never been in the same league as Lan Wangji’s, and seeing him come first like this, Wei Wuxian between his spread thighs, sets a light to the wick of heat strung tight in his stomach. </p>\n<p>“Lan Zhan,” Wei Wuxian gasps, fumbling blindly for his hand, and shudders his way through his own orgasm. </p>\n<p>They stay like that for a few dragging minutes, Wei Wuxian hunched over Lan Wangji, holding tightly to his hand as they struggle to breathe. Eventually, Lan Wangji’s legs loosen from around him, and Wei Wuxian takes that as the sign to crawl his way off him, flopping down roughly in the mussed sheets beside his husband. </p>\n<p>Lan Wangji’s head turns to follow the sensation of somebody curled up beside him, and he smiles, soft and blinding. Wei Wuxian loves him so fucking <em>much </em>that it squeezes at his already sore heart something fierce. </p>\n<p>“Okay?” he asks, reaching out to tuck some hair behind Lan Wangji’s ear. It’s an utter mess, half dried from the bath and freshly wet from sweat. Lan Wangji would probably die before letting anybody other than Wei Wuxian see it like that, which is exactly why Wei Wuxian loves it like this the most. </p>\n<p>Lan Wangji turns over, feeling out until he can put an arm around Wei Wuxian’s waist and draw him close, unmindful of the utter mess they both are. Wei Wuxian allows it easily, settling against his husband’s chest as if drawn by an intangible force. “You just got out of the bath and you’re going to have to go right back in again,” he says, amused. “You really do humor me too much, you know that, Lan Zhan?” </p>\n<p>Lan Wangji’s eyes drift closed, serene and peaceful. Wei Wuxian lets him. Given everything, he supposes Lan Wangji is entitled to some exhaustion, and Wei Wuxian has no intention of disturbing him until he’s ready. </p>\n<p>He amuses himself chasing out formless shapes along Lan Wangji’s skin - enjoying the warmth of his body beneath his fingertips. Lan Wangji is complacent against him, indulging Wei Wuxian’s idleness as he does everything. Feeling both cheeky and fond, Wei Wuxian trails his touch up higher until it rests over the pounding of Lan Wangji’s heartbeat. Slowly, so the lines of it are unmistakable, he traces the outline of a heart. </p>\n<p>Lan Wangji’s eyes flutter open and he looks vaguely down in his direction. Wei Wuxian offers him a grin he knows Lan Wangji can’t see but hopes he can sense. Lan Wangji reaches up, catching the hand on his chest, and squeezes it gently. He brings it to his mouth and lays a kiss on Wei Wuxian’s knuckles, lingering and soft. </p>\n<p>Wei Wuxian laughs. “Who’s the bigger smitten fool here?” he teases. </p>\n<p>Lan Wangji turns the hand he’s holding over and, very carefully, traces a heart over the fluttering pulse point in Wei Wuxian’s wrist. It’s the first real communication from him Wei Wuxian’s had all day, and it makes him suddenly feel overcome, throat thick and awkward. </p>\n<p>“Ah, Lan Zhan,” he says. “I really love you, you know?” </p>\n<p>Lan Wangji can’t hear him, but it’s okay; Wei Wuxian doesn’t need him to. </p>\n<p>This much, he’s sure his husband knows. </p>\n<p>.</p>\n<p>Wei Wuxian is roused from sleep by the sound of something shattering. </p>\n<p>He blinks awake, confused and concerned, to see Lan Wangji standing several steps away, nearer to the table than the bed. He’s still half asleep, so he doesn’t immediately understand what’s happened. “Lan Zhan?” </p>\n<p>Lan Wangji’s face is expressionless, but, when he goes to step back, something crunches loudly beneath his bare feet. Frowning, Wei Wuxian hauls himself upright, squinting through the early morning light, and when he realizes what’s happened a bright spark of alarm chases aware the last vestiges of exhaustion.</p>\n<p>“Ah! Lan Zhan, be careful! Don’t move, okay?” </p>\n<p>The fine tea set that had been sitting neatly on the table had been knocked clean to the floor, leaving a mess of porcelain scattered on the wood. The splatter of blood trailing from the mess to where Lan Wangji is standing tells him that his blind husband hadn’t been able to notice what was going on until it was too late. </p>\n<p>He rockets out of bed, stepping gingerly over the mess, and sets his hands on Lan Wangji’s shoulders. “C’mon,” he says, gently urging him back towards the bed. “Let me see what you’ve done.” </p>\n<p>Lan Wangji does not move. He sways slightly beneath the pressure of Wei Wuxian’s hands but gives no real indication that he even realizes Wei Wuxian is there. Up close, he can see a tight crease in his brow, but it seems more confused than pained. He tugs harder, finally managing to coax him back towards the bed, although Lan Wangji’s steps are unsteady at best. </p>\n<p>Wei Wuxian has to physically seize his shoulders and bodily press him down until Lan Wangji takes that as a cue to sit. The short trip across the room has left blood splattered liberally over the fine floor, and Wei Wuxian desperately hopes that it doesn’t stain. </p>\n<p>“Here,” he says, sinking to his knees and wrapping his fingers around Lan Wangji’s ankle so he can haul his foot up into his lap. “Let me see, okay?” </p>\n<p>Lan Wangji does not resist, but he does not help either. He’s still frowning into the middle distance, body tight like a spring, and Wei Wuxian swallows the thick concern in his throat as he looks down. </p>\n<p>There’s a large shard of porcelain lodged firmly in Lan Wangji’s heel, and the sole of his foot looks as if he’d tread right through a field of shattered glass; a mess of cuts and slashes that makes Wei Wuxian’s stomach turn to even look at. “Lan Zhan,” he says, “what were you even doing? When Lan Feiyan sees this, she’s going to murder us both.” </p>\n<p>He doesn’t want to leave the porcelain lodged in Lan Wangji’s foot for any longer than he has to, and he soothingly strokes his husband’s shin as he reaches out to grasp the tiny sliver sticking out. “I’m sorry,” he says. “This is probably going to hurt.” </p>\n<p>He pulls is out, one agonizing inch at a time. It’s approximately the size of a large city, by Wei Wuxian’s reckoning, and he knows if he were in Lan Wangji’s position he’d be whining like a child. </p>\n<p>Lan Wangji does not so much as bat an eye. Wei Wuxian knows that his stoic husband has a stone face that could put a mountainside to shame, but something gnaws at the back of his mind, something that just doesn’t feel <em>right.</em> </p>\n<p>Blood is leaking thickly over Wei Wuxian’s fingers, making a mess of his sleeping robes. Carefully, feeling like a monster, Wei Wuxian tightens his grip on Lan Wangji’s foot, digging his fingertips into the gash that rends his heel wide open. </p>\n<p>No reaction. Lan Wangji continues to listlessly stare beyond him. </p>\n<p>The grim realization that rises within makes Wei Wuxian sick to his stomach. </p>\n<p>This isn’t Lan Wangji being stoic in the face of pain; this is Lan Wangji completely and utterly unable to feel a thing. </p>\n<p>.</p>\n<p>After Lan Feiyan patches up the mess of Lan Wangji’s feet, Wei Wuxian corners her. </p>\n<p>“I don’t care what your opinion on this is,” he says. “Whatever the curse is doing to Lan Zhan, it’s getting worse, and I’m tired of just sitting back and watching.” </p>\n<p>“Wei Wuxian,” Lan Xichen scolds from where he’s sitting on the bed beside his brother. It had taken a truly spectacular amount of coaxing to get Lan Wangji to lie down again before he could hurt himself, and he looks incredibly sour about it. “Lan Feiyan is not at fault here.” </p>\n<p>“I know that,” Wei Wuxian says. “I’m not saying she is. I’m just saying that I once founded an entirely new path of cultivation all by myself and perhaps I might be put to better use than just sitting around like a weeping widow watching my husband waste away.” </p>\n<p>Lan Feiyan’s lips purse, eyes dark and troubled. Up close, Wei Wuxian notices for the first time that there’s some gray in her hair, hiding at her temples and behind her ears. He would wager any time spent being a doctor in the company of the Lan clan would stress even the most patient of practitioners.</p>\n<p>Wei Wuxian steels himself to argue his case, but instead, she says, “Okay.” </p>\n<p>Wei Wuxian startles, momentarily thrown off. “What?” </p>\n<p>Lan Feiyan turns, heading for the door, leaving him lingering by the foot of the bed. “I’m not nearly making the progress I need to be making on my own. If you think so highly of your skills and you’re determined to be involved, I’m not averse to putting you to work. Better than you trying to take initiative on your own and mucking it all up.” </p>\n<p>It’s not exactly a ringing endorsement, but Wei Wuxian knows better than to trip over the details. Permission is permission, and he wouldn’t have been above getting down on his hands and knees to beg if it’s had come to that. “Thank you,” he says fervently. “You won’t regret it.” </p>\n<p>“See that I don’t,” Lan Feiyan says. </p>\n<p>Wei Wuxian spends the day huddled over the table in the Jingshi with books and scrolls, drowning in a wealth of protected history that Lan Qiren would have an aneurysm over if he knew was being shared with him. It perhaps would have made more sense to join Lan Feiyan, but regardless of the fact that Lan Wangji is no longer even in a state to be able to tell if Wei Wuxian is with him or not, he hadn’t wanted to leave, not even with Lan Xichen there, lingering beside his brother as if his dedication alone could stop Lan Wangji from succumbing to the lingering poison of the curse. </p>\n<p>“This is what I’ve gathered so far,” Lan Feiyan had said as she pressed her meticulous notes into his hands. “I’m afraid it’s not much. From what I can tell, it seems designed to cut him off from any possible form of communication. How to fix it and to what end, I still can’t say.” </p>\n<p>Wei Wuxian has suspected as much himself since the second day when Lan Wangji’s sight withered away in the morning sun, each sense he lost that much more debilitating than the last until he’s trapped within himself with only the silent dark for company. It’s probably the worst fate Wei Wuxian can imagine. </p>\n<p>(strictly speaking, Wei Wuxian does not remember his time spent dead. Occasionally, however, he dreams of a crushing blackness, an isolation so intense that it rendered his very existence questionable. Whenever he wakes, he does his best to forget, but now he can’t help but imagine Lan Wangji in that same emptiness and it makes his heart clench horrifically.)</p>\n<p>More than once Lan Wangji stirs restlessly and tries to clamber from the bed until Wei Wuxian and Lan Xichen rush to press him back down again. With no sense of pain - no sense of <em>touch </em>- it’s too risky to let him roam about.</p>\n<p>Twice, Wei Wuxian breaks from his research to help him sit up, hands forceful and rough so that Lan Wangji can feel the pressure if not anything else, and helps him eat. Unlike before where they’d managed some degree of grace between them, this time they’re not so lucky. Wei Wuxian can <em>feel </em>Lan Wangji’s frustration when he helps him slide his outer robes off, stained with mediocre soup, and clumsily into a new set. It makes his own frustration scratch at his skin from the inside out. </p>\n<p>In the notes Lan Feiyan had left him, Wei Wuxian finds a grand total of… nothing. There’s some talk of curses, of sensory deprivation, but nothing that combines the two.</p>\n<p>“Is there any chance I could look at the secret books in the library?” Wei Wuxian asks Lan Xichen, desperate. </p>\n<p>Lan Xichen gives him a pitying look and says, “Wei Wuxian, you already <em>are.” </em></p>\n<p>By the time the sun begins to set, Wei Wuxian has nothing to add to Lan Feiyan’s findings. His mind is a scrambled mess, spinning out half a dozen possible scenarios at a time and discarding them each in turn. He’s bitten right through his nails, leaving them bleeding at the quick, and when he climbs into the bed beside Lan Wangji he’s about ready to scream. </p>\n<p>“Trust you to succumb to the one curse nobody in the cultivation world has ever heard of before,” Wei Wuxian says, running a hand through Lan Wangji’s splayed hair. He knows he can’t feel it, but he’s not really doing it for <em>him. </em>“Do you think, perhaps, this is the universe’s way of repaying us for the mischief of our youth?” </p>\n<p>Lan Wangji frowns deeply and reaches up, fumbling. His fingers manage to grasp around Wei Wuxian’s wrist, and he squeezes tight enough that Wei Wuxian knows he’s going to be ringed with bruises. </p>\n<p>Lan Wangji’s lips part. <em>Wei Ying? </em>he mouths, quiet and uncertain.</p>\n<p>He turns their hands over so he can return the iron grip, his skinny fingers cutting into Lan Wangji’s pale skin. “I’m here, Lan Zhan,” he says. “Where else would I be?” </p>\n<p>That night, Lan Wangji sleeps restless and tense, head tucked beneath Wei Wuxian’s chin, and Wei Wuxian’s hands pressing firmly into his back to keep him from moving away during the evening. </p>\n<p>Wei Wuxian doesn’t sleep - he’s dreading the rising of the sun with enough intensity to make himself sick. Instead, he lays on his back, stares at the ceiling, and <em>thinks. </em></p>\n<p>It couldn’t have been the night hunt. Wei Wuxian had taken the children on more exciting adventures than that. It had been over in the span of three days, and most of it had been the hike in and out of the thick trees where Bichen could not navigate. </p>\n<p>Frustrated, Wei Wuxian rolls over, putting his back to the slowly setting moon outside the window. In front of him, Lan Wangji breathes steadily, a tight crease that is usually absent in sleep drawing his brows to meet. Wei Wuxian reaches out to poke at it, hoping to unravel the tension with his fingertips, but Lan Wangji doesn’t so much as stir. </p>\n<p>It <em>can’t </em>have been the night hunt. It was barely a night hunt at all. That was just… clean up duty. A band of thieves getting their comeuppance. </p>\n<p>“Ahh,” Wei Wuxian groans, rolling over to fling an arm over his face. All he has to work with is dozens of useless books on medical cultivation and curses that are answering exactly none of his question, and a group of fierce corpses rotting in the ground. </p>\n<p>Wei Wuxian pauses. Slowly, he removes the arm from his face and turns, squinting out the far window where the moonlight is bathing the Jingshi is shades of silver. Carefully, he pulls himself from his husband who does not so much as seem to realize the bed is going empty beside him. </p>\n<p>Lan Xichen opens the door immediately after Wei Wuxian’s first set of slightly manic knocks. Somehow, despite the late hour, he’s perfectly put together, not at all like Wei Wuxian who’d barely managed to pull on his outer robes before tripping out the door. He’s sure his hair is a right mess. Wei Wuxian couldn’t care less. </p>\n<p>“Wei Wuxian?” Lan Xichen asks, faint alarm stirring at his bedraggled appearance. “What’s happened? Is Wangji -” </p>\n<p>“Who curses people?” Wei Wuxian interrupts. </p>\n<p>Lan Xichen looks taken aback. “What do you mean?” </p>\n<p>“Who curses people?” Wei Wuxian repeats. “Who and why would somebody do that?”</p>\n<p>Lan Xichen’s brow furrows, bewilders. “If we’re talking about one cultivator cursing another, the greatest reason is a grudge, I would assume,” he says. “A curse always comes with a cost, so the reason would have to be fairly dire.” </p>\n<p>“Exactly,” Wei Wuxian says. “Who holds a grudge against Lan Zhan who has the resentment, the ability, <em>and </em>the backbone to curse him in the cultivation world at this point? Nobody left alive, that’s for sure.” </p>\n<p>Lan Xichen looks as if he might have something to say about Wei Wuxian’s blithe summary of things but doesn’t scold him. “What is it you’re getting at here, Wei Wuxian?” </p>\n<p>“A cultivator wouldn’t be able to cast a curse like this,” he says. “Not on Lan Zhan, not on purpose.” </p>\n<p>“You think it was an accident?” </p>\n<p>“I don’t think it was a cultivator at all,” Wei Wuxian says. “At least, not like you or Lan Zhan.” </p>\n<p>Lan Xichen is, as ever, quick to catch Wei Wuxian’s meaning. His brows drawn uncharacteristically tight, and like this Wei Wuxian can see the similarities between him and his brother clearly. “Are you saying you suspect demonic cultivation?” </p>\n<p>“When we were burying the bodies on our night hunt, one of the men was dressed like a cultivator but no matter how we looked, we couldn’t seem to find a sword. I thought perhaps the bandits had sold it off before they died too, but now I’m thinking maybe he wasn’t carrying one at all.”</p>\n<p>Lan Xichen has the grace not to look at the empty place on Wei Wuxian’s belt where Suibian used to hang. “Because he didn’t think he needed one to protect himself.” </p>\n<p>Often, Wei Wuxian regrets that he hadn’t had the opportunity to destroy more of his research before he perished under the weight of his own callous pride. He stands by the fact that, as an art itself, demonic cultivation has potential under an intelligent practitioner - it’s just he’s starting to suspect that he might be the only intelligent practitioner out there. </p>\n<p>“Let’s say you’re a demonic cultivator,” Wei Wuxian says. “You go chase down some bandits in the woods because clearly you left behind your intelligence in the cradle. You have a new curse you want to try out; something to render an enemy totally helpless, unable to fight back.” Wei Wuxian pauses pointedly. </p>\n<p>Lan Xichen’s mouth turns down at the corner. “Except curses have a potential to be almost as contagious as disease if not properly cast,” he says. </p>\n<p>“Exactly,” Wei Wuxian says. “You get caught in the backlash and now you’ve got a half dozen people absolutely stripped of their senses without anybody to reverse the curse. The bodies were in such bad states that determining how they died was practically impossible, but I’d be willing to bet it was starvation.” </p>\n<p>“If that’s the case, how do we go about solving the curse if the caster is dead?” Lan Xichen asks, but Wei Wuxian shakes his head. </p>\n<p>“It doesn’t matter. The source of <em>their </em>curse was the caster, but the source of Lan Zhan’s curse is corpses - if we can simply get rid of his side of the curse, it should…” Wei Wuxian trails off. His heart is tripping in his chest, dangerously eager at the first stirring of hope in days. </p>\n<p>“Wei Wuxian,” Lan Xichen asks, looking at him with serious eyes. “Are you sure?” </p>\n<p>Wei Wuxian’s isn’t. Not totally. How can he be? He’s working largely off conjecture - but Wei Wuxian’s conjecture has always been one of his strongest points. It was what once toppled the empire Jin Guangyao had spent decades building. </p>\n<p>Wei Wuxian meets Lan Xichen’s gaze and says, as firmly as he can manage, “I’m sure.” </p>\n<p>Lan Xichen’s jaw tightens and he steps past Wei Wuxian and outside, shutting the door behind him. “I’ll go at once,” he says. </p>\n<p>“What?” Wei Wuxian protests. “No, it’d be easier for me to do. I know where the bodies are, and -” </p>\n<p>“Wei Wuxian,” Lan Xichen says, with perhaps more patience than Wei Wuxian really deserves. “Do you have a sword? Can you fly?” </p>\n<p>Wei Wuxian closes his mouth. Again, he resolves to work harder at strengthening his new golden core, regardless of whether he’s all that interested in following the proper path of cultivation at this point. </p>\n<p>Lan Xichen must see his frustration, because the tightening around his mouth eases. He sets a comforting hand on Wei Wuxian’s shoulder, and the surprise of it rattles the depression right out of him. “I will find the bodies,” Lan Xichen says, “and you will stay here with Wangji.” </p>\n<p>Wei Wuxian breathes out. He wants to go so desperately that it chokes him, but his husband is waiting alone and isolated in their bed, and even if Wei Wuxian <em>could </em>fly, he truthfully doesn’t know if he could find the strength to leave him behind, not when there was another option. </p>\n<p>They’d had too much of that already. Wei Wuxian refuses for either of them to suffer any more. </p>\n<p>It’s not really his place to make requests of the Sect Leader, but still, he can’t help but to say, “Be quick.” </p>\n<p>Lan Xichen’s hand falls from his shoulder. “Of course.”</p>\n<p>Watching Lan Xichen head off into the darkness alone is rough, but once the startling white of his robes disappears from sight, Wei Wuxian turns and heads back to the Jingshi without hesitation. </p>\n<p>Lan Wangji is exactly where he left him - asleep and ignorant in the bed, unaware that in his sleep Wei Wuxian has managed to dig out the first scrap of hope for them in days. Wei Wuxian crawls in beside him, tossing a leg over Lan Wangji’s own and arranging Lan Wangji’s arm over his waist. </p>\n<p>It doesn’t feel exactly right, but it’s close enough, and Wei Wuxian will take whatever he can get. </p>\n<p>“Lan Zhan,” he says, reaching out to move his hair from his face. “Just hang on a little more, okay?” </p>\n<p>.</p>\n<p>In the morning, Wei Wuxian wakes to Lan Wangji staring at him quietly, golden eyes blank and face utterly slack. </p>\n<p>Uneasy, Wei Wuxian reaches over and shakes his shoulder. “Lan Zhan?” </p>\n<p>Lan Wangji slumps bonelessly to the side beneath the force of Wei Wuxian’s movement. He blinks and his eyes skate around the empty space in front of him, uselessly searching for something they haven’t been able to see in days. </p>\n<p>Wei Wuxian sits up. Carefully, he reaches out and takes his husband by the shoulders, drawing him upright against the head of the bed. Lan Wangji goes with him, unresisting like a doll. </p>\n<p>Outside, the morning sun rises cheerful and bright, totally unconcerned that it’s burnt away the last of Lan Wangji’s freedom. His ability to so much as move gone, he lays there, subject to the whims of the world; at last, reduced to nothing more than passenger in the prison that has become his body. </p>\n<p>.</p>\n<p>At Lan Feiyan’s guidance, they decide not to try and feed him. They’d persisted so far, uncertain whether he could practice inedia in his current state, but, as Lan Feiyan had explained, with Lan Wangji unable to control his own body the risk of choking him was just far too great. </p>\n<p>“If you’re right, he won’t be stuck like this for much longer,” she says as she helps Wei Wuxian arrange him as comfortably on the bed as he’s likely to get. “Best not risk it. That’s no way for a man like Hanguang-Jun to go.” </p>\n<p>If Wei Wuxian has his way, Hanguang-Jun isn’t going to go at all. They have centuries ahead of them yet. An eternity, maybe, if they get to be so lucky, and Wei Wuxian is very prepared to fight to keep it. </p>\n<p>Lan Sizhui comes by soon after she leaves, and Wei Wuxian greets him at the door, slapping on his biggest and most empty smile. “What’s this? Skipping lessons again already? You must have all four thousand of those rules memorized by now.” </p>\n<p>Lan Sizhui doesn’t take the bait. “I heard… is he…?” </p>\n<p>“Lan Zhan’s fine,” Wei Wuxian says. “Nothing for you to worry about.” </p>\n<p>Lan Sizhui’s gaze skitter behind him, catching a glimpse of the silent Jingshi. “May I see him?” </p>\n<p>For a second, Wei Wuxian hesitates, but ultimately he shakes his head. Very carefully, he says, “I don’t think that would be a good idea right now.” </p>\n<p>Lan Sizhui is quiet for a moment before he says, “That doesn’t like something I shouldn’t be worried about.” </p>\n<p>There are times Wei Wuxian wishes they hadn’t raised a kid who was both gentle <em>and </em>stubborn. Clearly, he took that first trait from Lan Wangji and the second from him. What a combination it makes. </p>\n<p>Because he has never actually been very good at lying to the people he loves, Wei Wuxian opts for the path of honesty and says, “You don’t want to see him like this, trust me, Sizhui. He’ll be better soon, and I’m certain he’d like nothing more than to see you then.” </p>\n<p>Lan Sizhui leaves, but with the look of somebody deeply troubled. Up ahead, Wei Wuxian can see a small gathering of the more persistent juniors, headed by Lan Jingyi, waiting for the news he comes bearing. Wei Wuxian can’t help but smile wistfully as he closes the door, locking out the outside world once more. </p>\n<p>“You’re so popular,” he teases gently as he settles on the bed beside Lan Wangji. “How come the number of your fans only seems to grow as you age? I could swear teenagers weren’t so smitten with you when we were that age.” </p>\n<p>Other than Wei Wuxian, of course, but there’s no joy in saying as much when Lan Wangji isn’t aware enough to respond to his teasing. Wei Wuxian rolls over, throwing his arms around him and resting his cheek on Lan Wangji’s chest. Like this, he can feel the gentle thump of his heart and it helps to soothe the anxious tension climbing his ribs like a ladder, rushing to choke him with fear the moment he so much blinks. </p>\n<p>How many days had it taken for the bandits to succumb? How alone and fearful had they been? What about the cultivator who’d started this mess? Had he realized what was happening? Had he regretted his arrogance at least a fraction of as much as Wei Wuxian had when he too had been torn apart by the hubris of his own creation?</p>\n<p>The day passes by at the approximate speed of Lil Apple’s slowest walking pace. Wei Wuxian stays in the bed beside his husband where he belongs, head tilted to watch as the sun rises and falls on the zenith of the horizon, and wondering all the while about where Lan Xichen is, whether he’d made it to the village yet, the forest beyond it, the mass grave hidden just out of sight. </p>\n<p>Soon, he thinks. Surely soon. </p>\n<p>At some time after what Wei Wuxian estimates to be the usual dinner hour, there’s a knock on the door. Wei Wuxian rolls over to face it but doesn’t move and doesn't answer. It doesn’t matter anyway, because it opens a moment later without his say-so and Lan Feiyan steps in. She seems fit to scold him for ignoring her, but her gaze lands on the bed where Wei Wuxian has wound himself around Lan Wangji like a stubborn weed and her gaze softens. </p>\n<p>“You ought to give him some space,” she says, but it’s without heat.</p>\n<p>Wei Wuxian pulls a face but obediently shuffles back just enough to grant her room for her examinations. “Have you heard anything?” </p>\n<p>She shakes her head, picking up Lan Wangji’s wrist and setting her fingers to his pulse. “I’m sure he’s doing his best. We can only be patient.” </p>\n<p>Wei Wuxian is sick to death of being patient. He wants his husband back. “What happens if he doesn’t make it by sunrise? What’s left for the curse to take at this point?” </p>\n<p>Lan Feiyan gives him a look as she sets Lan Wangji’s wrist down gently atop the bed. “Shouldn’t you be telling me, oh wise one? You were the one who figured it to be demonic cultivation.” </p>\n<p>Wei Wuxian hesitates. “It looked like they’d starved to death, at least some of them,” he says. “So, whatever this curse does, it doesn’t kill outright.” </p>\n<p>“Or so you assume,” Lan Feiyan reminds him, but not unkindly.</p>\n<p>“Or so I assume,” Wei Wuxian agrees. “But it’s very likely the pace at which the curse attacked Lan Wangji is different from the pace at which it ate at them. An offensive curse that takes several nights to truly set in is hardly a weapon. With that, it’s hard to know what could possibly come next.” </p>\n<p>“Whatever happens, we’ll be prepared,” she says. “I’ll stay here tonight. Just in case.” </p>\n<p>Wei Wuxian couldn’t bear to think about what ‘just in case’ might mean. Instead, he says, as sincerely as he can manage, “We’re in your care.” </p>\n<p>Lan Feiyan stands up, brushing imaginary dirt from her robes. “Then believe that I speak plainly when I say between you and me, there is no safer place for Hanguang-Jun to be.” </p>\n<p>.</p>\n<p>The sun sinks. Still, Lan Wangji lays on the bed, doll-like and distant. </p>\n<p>Lan Feiyan manages to coax Wei Wuxian up and away for long enough to pick at his dinner, thinking with every mouthful how bland it is, how much better Lan Wangji’s cooking is, how Wei Wuxian doesn’t actually know where the spices Lan Wangji hides in the Jingshi are because he’s never needed to - it’s always been Lan Wangji who fetched them. </p>\n<p>Afterwards, Lan Feiyan stays in the main room, pointedly reading over some of her notes and granting the two of them privacy that feels empty at best. Wei Wuxian huddles up beside his husband, takes one of his cold hands between his own, and settles his head on the pillow to gaze at him. </p>\n<p>Like this, Lan Wangji looks almost too perfect to be true. A marble statue carved and left to glow in the moonlight; something unnatural and other worldly, beyond them all. Wei Wuxian hates it. Lan Wangji - <em>his </em>Lan Wangji - never looks like this, not to him. His gaze is always soft when it lands on Wei Wuxian, his hands warm, his touch constant and soothing even when his expression is stern. </p>\n<p>Wei Wuxian loves every version of his husband, so of course he loves this one too, but it’s not <em>really </em>Lan Wangji - it’s the shell of him waiting for the spirit to return, and Wei Wuxian has done everything he can to urge it home. All he has left to do is wait. </p>\n<p>(he’s so fucking tired of waiting too. Once this is over, he fully expects to be spoiled terribly. He thinks he’s earned it.) </p>\n<p>The moon rises, creeping across the curve of the sky. </p>\n<p>This is the sixth night. It somehow feels like far too few and far too many; most of all, it feels like the climax of the hardest war he’s ever fought, which is saying something considering the general trajectory of Wei Wuxian’s life, before and after death. </p>\n<p>Out past the curtains separating the bed from the main room, Wei Wuxian can hear Lan Feiyan turning the pages of her book. The incense burns silently and steadily, filling the Jingshi with the smell of sandalwood that’s beginning to fade from Lan Wangji’s skin. </p>\n<p>Wei Wuxian breathes in deeply and presses his face into Lan Wangji’s chest. His eyes are stinging something awful. <em>Please, </em>he thinks, semi-hysterical. <em>Please, give him back to me. He’s all I’ve got left. You don’t want to see what I’ll become in a world without Lan Zhan. </em></p>\n<p>He must stay like that for hours. At some point, he begins to doze. His dreams are disturbing, fractured things, and every time he wakes it’s like a breath of fresh air. He dreams, of course, of Lan Wangji - which is perhaps why when he hears “<em>Wei Ying” </em>whispered right in his ear it takes him a scrambled moment to realize he’s not still sleeping. </p>\n<p>Wei Wuxian’s eyes snap open. It’s fully dark out now, but he shoves himself upright, hair falling messily over his shoulders, and his eyes lock with Lan Wangji’s. His heart is pounding. Hope tastes like acid in his mouth. “Lan Zhan?” he croaks. </p>\n<p>Lan Wangji blinks, and for one awful second Wei Wuxian thinks that maybe it <em>was </em>a dream after all, but then Lan Wangji reaches up with one slightly shaky hand, tucking Wei Wuxian’s hair behind his ear, and whispers like a prayer, <em>“Wei Ying.” </em></p>\n<p>“Lan Zhan!” Wei Wuxian says, high and reedy, and swoops down on him. </p>\n<p>They’re a mess of fumbling limbs, Lan Wangji still uncoordinated and shaky and Wei Wuxian practically vibrating out of his skin with the sheer <em>need </em>to touch and be touched in return. Lan Wangji’s hands land on his back, and Wei Wuxian collapses across his chest, tilting Lan Wangji’s face down so that he can kiss him. The angle is awkward and uncomfortable, but it would take strength unheard of in this world to pry them apart right now. </p>\n<p>“Lan Zhan, Lan Zhan, Lan Zhan,” Wei Wuxian mumbles in between kisses, frantic and nonsensical. “Gods, I should strangle you. I’ve never been that worried in my life. I’ve missed you so much.”</p>\n<p>Lan Wangji is both more and less eloquent all at once. “Wei Ying,” he says, his hands climbing into Wei Wuxian’s hair. He presses a kiss to his cheek and then to his mouth. “Sorry. Thank you.” </p>\n<p>Wei Wuxian isn’t crying. He’s not. He’s just a little overcome is all. </p>\n<p>Behind them, Lan Feiyan says, “I don’t want to interrupt, believe me, but I think we would all sleep much better if you’d let me examine him first to make sure everything is in order.” </p>\n<p>Knowing Lan Feiyan is right does not make it any easier for Wei Wuxian to reluctantly peel himself away. He doesn’t go far though, settling beside Lan Wangji and helping him upright. The relief he feels when Lan Wangji moves beneath his touch, following Wei Wuxian’s lead but not relying on it, is stronger than he’ll ever say. </p>\n<p>Lan Feiyan checks his pulse again and feeds some her spiritual energy into him to check the state of his meridians. All the while Lan Wangji’s gaze keeps listing towards Wei Wuxian, as if being able to see him at all is such a novelty that he can’t bear to look away, and each time Wei Wuxian breaks into a genuine grin, squeezing his hand, affirming. </p>\n<p>“As far as I can tell, you’re more or less healthy,” Lan Feiyan announces, allowing Lan Wangji to withdraw his hand. “Of course, I’d recommend a good meal come morning and time spent in meditation, but I’m sure you already had such plans yourself.” </p>\n<p>“Mmhm,” Lan Wangji agrees. Then, to Wei Wuxian, “What happened?” </p>\n<p>Wei Wuxian smiles broadly and then, uncaring of their audience, brings the hand he’s holding up so he can lay a kiss along his knuckles. “I assume you’re asking how it is I single handedly saved you from withering away like a hapless maiden?” </p>\n<p>Lan Wangji does not look amused. “Wei Ying.” </p>\n<p>“What? It’s the truth!” </p>\n<p>Lan Feiyan smiles, one of the most genuine ones Wei Wuxian has seen from her yet, and straightens from her crouch. “Wei Wuxian isn’t so far from the truth,” she says. “Of course, your brother played a large part in it too. I expect you have much to be thankful for.” </p>\n<p>To Lan Feiyan, Lan Wangji says, “And to you.” </p>\n<p>She shakes her head. “I barely did anything, I’m ashamed to say. I’m just glad to see you well again. I won’t be the only one either. You’ve had the whole of Cloud Recesses fussing.” </p>\n<p>Lan Wangji looks slightly abashed at that. Taking pity, Wei Wuxian says, “Do you remember the corpses we put to rest during the night hunt?” </p>\n<p>Lan Wangji turns to him and frowns. “Of course.” </p>\n<p>“And do you remember the cultivator among them?” </p>\n<p>Understanding seems to dawn. “He was the origin of the curse?” </p>\n<p>“That was my theory,” Wei Wuxian says. “And considering you’re well again,” he pauses to playfully shake the hand he’s holding, “then I must have been right.” </p>\n<p>“And my brother?” </p>\n<p>Completely unashamed, Wei Wuxian says, “I sent him to burn the corpses. It was the only way to make sure that there was nothing left tying you to the curse. With the point of origin gone, the curse should have nothing to cling too. Besides, we couldn’t risk anybody else stumbling upon them and digging them up.” </p>\n<p>Unsurprisingly, Lan Wangji doesn’t look thrilled with the idea of desecrating the dead, even if the dead in question were the fierce corpses of bandits and a demonic cultivator, but he doesn’t protest. He knows that if Wei Wuxian says it was the only way, then it was the only way. </p>\n<p>“Let’s just be grateful it’s over with,” Lan Feiyan says. “I’ll let you two rest now.” </p>\n<p>They’re very clearly not planning to rest at all, not after so many days of slowly being drawn apart, but she clearly leans more towards Lan Xichen’s brand of polite subtlety rather than Lan Wangji’s stubborn bullheadedness. </p>\n<p>Wei Wuxian makes to get up to help her gather her things, but she waves him off, and he lets her go without argument. Lan Wangji’s hand on his wrist pulls him back to the bed and Wei Wuxian goes willingly. By the time he has his arms around Lan Wangji’s shoulders, he only distantly notices the sound of the door closing. </p>\n<p>.</p>\n<p>All things considered, Wei Wuxian would say that their reunion is remarkably chaste. It turns out even the enviable stamina of Lan Wangji is somewhat withered by a week of having his spiritual energy slowly consumed from the inside out. </p>\n<p>Instead, they curl up together, Wei Wuxian sneaking his hands into Lan Wangji’s robes just to feel the calm of resting them against his skin, and Lan Wangji gathering Wei Wuxian as close as is humanely possible. Wei Wuxian tells him what he’s missed in the past few days, scolds him for worrying Lan Sizhui, and, when he finally can’t bear it anymore, begs him never to do anything like that again. </p>\n<p>The lives they live are, while not as dangerous as they once were, far from safe. It’s not a promise Lan Wangji can really make. Still, he kisses Wei Wuxian deeply and says, dead serious, “I promise. I will not worry Wei Ying again.” </p>\n<p>It’s stupid. Wei Wuxian believes him anyway. Lan Wangji has never lied to him. </p>\n<p>Eventually, they do manage to get some rest, just through the sheer combined value of their exhaustion. They must sleep right through breakfast too because Wei Wuxian wakes to the gentle sound of knocking at their door; something he’s become very familiar with lately. </p>\n<p>Beneath him, Lan Wangji stirs. Wei Wuxian pats his chest reassuringly, trying to convince him to lay back down even as he sits upright, blinking the last of the haze from his eyes. “It’s fine, Lan Zhan. You can keep resting.” </p>\n<p>Lan Wangji glances out the window and seems to realize how late it’s gotten. He shakes his head and stands, sweeping behind the room divider to change into a fresh set of clothes. Wei Wuxian watches him go, sighing, before he gets up and head for the door. </p>\n<p>Utterly unsurprisingly, it’s Lan Sizhui standing on the threshold, smiling in that bright subdued way he has. In his hands he holds a tray of what looks like lunch. Wei Wuxian can’t help but smile too, reaching out to take it. “I suppose I don’t need to ask if you’ve heard the news,” he says. </p>\n<p>“Lan Feiyan asked me to bring this to you,” he says, instead of answering. Then, slyly, “I’m not skipping lessons if I’m running errands.” </p>\n<p>Wei Wuxian is so hopelessly fond of this boy, he steps back, allowing him in. “If Lan Qiren disagrees, don’t let him know I let you in here.” </p>\n<p>Wei Wuxian is just setting the tray down on the table when Lan Wangji emerges. His robes are new, but his hair is still loose. Clearly, he had a vague notion of who was at their door too, because greets Lan Sizhui with a rare smile. “Sizhui.” </p>\n<p>Lan Sizhui offers a picture-perfect salute. “Hanguang-Jun,” he says. “I’m glad to see you well again.” </p>\n<p>“I am glad to be well again,” Lan Wangji says simply, and takes his place at the table, gently organizing the bowls for the three of them. Wei Wuxian notices that he’s already fetched the chili oil for him, and it’s enough to make his heart clench tightly. </p>\n<p>Lan Sizhui takes his position between them a little shyly but obviously elated. He looks like he has much he wants to ask, but when Lan Wangji silently lifts his chopsticks he follows his lead, falling into the silence with the ease of long practice. </p>\n<p>The Jingshi is quiet but for the light clatter of chopsticks on bowls. Wei Wuxian had thought he’d be sick of silence by now, but this is something else entirely - a part of his routine he hadn’t realized he was missing, as soothing as Lan Wangji’s hands on his skin or his sleepy eyes in the morning. </p>\n<p><em>Don’t get emotional, </em>Wei Wuxian coaches himself. <em>It’s just a typical Lan meal. Don’t get emotional. This is fine. You’re fine. </em></p>\n<p>“Senior Wei, are you crying?” </p>\n<p>“No, I’m not,” Wei Wuxian sniffs, scrubbing his eyes on his sleeve. “Shut up and drink your soup.” </p>\n<p>.</p>\n<p>It takes until late evening for Lan Xichen to arrive back. </p>\n<p>Wei Wuxian had wanted Lan Wangji to retire to bed before then - he’s still exhausted from a week of fighting his own body - but Lan Wangji had clearly wanted to stay awake to see him return and Wei Wuxian couldn’t begrudge him that.</p>\n<p>They’re out with the rabbits, flagrantly breaking the curfew that Wei Wuxian thinks shouldn’t apply to men their age anyway, and Lan Wangji is studiously examining each and every one that approaches him, as if they could have changed in the days since he’d been able to see them last. Or perhaps enjoying the ability to finally match sight to touch again, considering last time they’d been here all he’d been able to feel was their fur. </p>\n<p>Wei Wuxian has his back to a tree, watching fondly, so he’s the first one to see Lan Xichen approaching from the other direction, seemingly utterly unsurprised to find them out here so late. Still, when his gaze lights upon his brother he comes to a momentary standstill. It’s too dark and he’s too far away for Wei Wuxian to really make out his expression, but he thinks that’s probably for the best. </p>\n<p>If there’s one thing Wei Wuxian has come to realize from this week, sometimes the illusion of privacy is a greatly needed thing. </p>\n<p>After a moment, Wei Wuxian says, cheerful and loud, “Ah, Zewu-Jun,” he says. “Welcome back.” </p>\n<p>Lan Wangji twists, sight finding him. He doesn’t smile, but his face is loose and relaxed when he says, “Brother.” </p>\n<p>Lan Xichen takes the last couple of steps closer. “Wangji, it is very good to see you. How are you feeling?” </p>\n<p>“Well,” Lan Wangji says, inclining his head. “Thank you. I am sorry to have caused so much distress.” </p>\n<p>Lan Xichen’s gaze is the softest Wei Wuxian has seen it. “I’m only glad to have you back,” he says. “So long as you’re well, that’s all that matters.” </p>\n<p>The brothers stare at each other for a long, quiet moment. Wei Wuxian has the feeling that he just witnessed a very heartfelt declaration of kinship as far as Lans are concerned. </p>\n<p>Not wanting to interrupt but needing to know all the same, Wei Wuxian asks, “I take it everything was as I predicted?” </p>\n<p>Lan Xichen turns to him and says, “I took care of it. There’s nothing to be concerned about anymore.” </p>\n<p>Wei Wuxian leaves it at that. If he never has to think about that night hunt, those corpses, or this whole mess ever again, he’ll die a very grateful man. “Thank you.” </p>\n<p>“You do not need to thank me,” Lan Xichen says. “You said you’d do anything for Wangji - that much we have in common.” </p>\n<p>It’s one of the genuinely nicest compliments Lan Xichen has paid him since his resurrection, but Lan Wangji says, slightly scolding, “Brother.” </p>\n<p>Unbothered, Lan Xichen says, “It’s the truth. I’m merely saddened that I couldn’t have offered more help. Although, to be fair, it didn’t seem as if you needed it.” He gives them a meaningful look that borders on indulgent. “Without Wei Wuxian, I dread to think what state you would have been in. I’ve never seen two people’s communication so unencumbered beneath such a burden.” </p>\n<p>That too, Wei Wuxian thinks is a compliment. “I think Lan Zhan and I got the worst of misunderstanding each other out of the way a long time ago,” he says. “Where would we be if we let something like this break us now?” </p>\n<p>He’s not looking at him, but he feels the hand Lan Wangji has resting on his thigh suddenly squeeze tight. Wei Wuxian suppresses a small smile, helplessly enamored with how easy it is to earn the affection of his husband. </p>\n<p>Lan Xichen sighs. “Yes,” he says. “I suppose so.” He casts a meaningful look to the darkened sky and then down again. “It’s far past curfew,” he says. “I think we could all benefit from whatever rest we can get after the trial of the past week.” </p>\n<p>Wei Wuxian recognizes a dismissal when he hears one. He gets to his feet, holding out a hand to Lan Wangji even though he absolutely does not need the assistance. Lan Wangji takes it, allowing Wei Wuxian to pull him up. The rabbits scatter about their feet. </p>\n<p>To his brother, Lan Wangji says, “You will join us for breakfast?” </p>\n<p>Lan Xichen looks pleased at the invitation. “Of course,” he says. “I would like nothing more.” </p>\n<p>Wei Wuxian says, “Sizhui might join in again. You should probably let him. He’s been very patient, all things considered.” </p>\n<p>“You are aware that my uncle considers all of his misdeeds to be your influence,” Lan Xichen says to him. “First you ruined his star student of the previous generation, and now you’re working at ruining this one.” </p>\n<p>“Sizhui makes his own choices,” Wei Wuxian says breezily. “Although, I must say I’m very impressed with his ability to make the right ones.” </p>\n<p>Lan Xichen gives an amused smile. “I will see you in the morning, Wei Wuxian. Please continue to take good care of my brother.” </p>\n<p>“Always,” Wei Wuxian says, maybe a little too honestly. </p>\n<p>They leave, heading back to the Jingshi hand in hand, which is more performative than Lan Wangji usually encourages when at Cloud Recesses, but Wei Wuxian thinks, given the circumstances, they’re entitled to be a little clingy. </p>\n<p>“You’re going to get so tired of everybody fussing around you very quickly,” Wei Wuxian says as they follow the path. “I think the rest of the juniors are set to ambush you.” </p>\n<p>“Hm,” Lan Wangji says, sounding unbothered. “We can head out again soon.” </p>\n<p>“Only once Lan Feiyan allows it,” Wei Wuxian warns. </p>\n<p>“Of course,” Lan Wangji says. “After that.” </p>\n<p>Probably they should stay longer - really reassure everybody that Lan Wangji is good and well - but he knows that neither of them have the patience for that sort of thing. They will indulge Lan Xichen and Lan Sizhui and the rest of the juniors, and they will reacquaint themselves with the novelty of safety and security, however transitory it is, and then they will leave. </p>\n<p>That’s just how it is. It’s what they do. And besides, selfishly, Wei Wuxian wants to have Lan Wangji to himself, to fall in love with him over and over again as he relearns the planes of his stomach and the curve of his shoulders. He wants to be the them they are on the road, with only each other for company. </p>\n<p>For now though, he’s willing to share. If there’s anybody who knows what it’s like to love and miss Lan Wangji, it’s him, and he wouldn’t dare spirit him away before reassurance can set in.</p>\n<p>He knows that, although it hadn’t been true for Wei Wuxian, for everybody else, the last week has been a total shut down, cut off from him in every way. Lan Xichen has said it best - that although seeing Lan Wangji wasting away had been rough, for the most part, Wei Wuxian had not felt isolated until the very end - there was always a way in; a sight when there we no sound, and then a touch when that failed too. </p>\n<p>Wei Wuxian had missed his husband not because he felt alone, but because a minimized version of Lan Wangji was not the version he was meant to be, and Wei Wuxian loves him best like this; big enough to eclipse the whole world beneath the importance he plays in his role by Wei Wuxian’s side. </p>\n<p>To Lan Wangji, Wei Wuxian says, agreeing, “After that. Besides, we’ve got to go pick up Lil Apple.” </p>\n<p>“Of course,” Lan Wangji agrees seriously. </p>\n<p>“And then it’ll be the three of us again,” Wei Wuxian says. “The way it’s meant to be.” </p>\n<p>That draws a smile from Lan Wangji. “Wei Ying.” </p>\n<p>Wei Wuxian plays innocent, swinging their hands between them as they walk, like a child. “What?” </p>\n<p>Lan Wangji trails to a stop, using his grip on Wei Wuxian’s hand to draw him back in. The other hand tilts Wei Wuxian’s chin up for a kiss, warm and familiar. “Whatever Wei Ying wants,” he promises. </p>\n<p>“And if Wei Ying wants to be stubborn and spoiled and run off with the esteemed Hanguang-Jun and a donkey and make a whole bunch of mischief on the road?” Wei Wuxian says, face as straight as he can manage. </p>\n<p>“Then that is what we will do,” Lan Wangji says. </p>\n<p>Wei Wuxian can’t decide if he’d rather laugh or cry. “You’re so stupid sometimes, Lan Zhan,” he says. “I love you so much it’s unbelievable. If you ever stop loving me too, I’m going to be devastated.” </p>\n<p>“That will never happen,” Lan Wangji says, matter of fact. </p>\n<p>Wei Wuxian believes him. Even if Lan Wangji didn’t always tell the truth, he’d have to; the alternative was unthinkable. </p>\n<p>“Okay,” Wei Wuxian says. “Running away again with a donkey it is. But first, sleep.” </p>\n<p>“Sleep,” Lan Wangji agrees. “Then breakfast with my brother and Sizhui.” </p>\n<p>“And stopping by to see the juniors,” Wei Wuxian adds. “And thanking Lan Feiyan again.” </p>\n<p>“The rabbits,” Lan Wangji says. </p>\n<p>“Right, how could I forget? And then saying goodbye to the rabbits.” He pauses. “Am I forgetting anything else?” </p>\n<p>“Uncle,” Lan Wangji says. </p>\n<p>“Nope, not forgetting anything else,” Wei Wuxian says decisively, just to see the near smile it draws from Lan Wangji. He stands on his toes so that he can kiss him. “Now, the real question is, are you still too tired to take me to bed?” </p>\n<p>The answer it turns out is no, no he is not.</p>\n<p>Wei Wuxian delights in gasping loudly, digging his fingertips into Lan Wangji’s back, legs kicked up around his waist. He twists his hands in Lan Wangji’s hair, and when Lan Wangji shivers and comes it’s with Wei Wuxian chanting his name in his ear. He leaves Wei Wuxian with bruises that he’s been missing dearly, and Wei Wuxian cannot wait to see Lan Qiren’s face tomorrow when he sees the fingerprints on his wrist.</p>\n<p>Lan Wangji falls asleep quickly after, still tired, and Wei Wuxian contents himself with watching his sleeping face, the fan of his lashes across his skin, the creaseless area between his brow. The fondness he feels is so overwhelming he could drown. </p>\n<p>Outside, the moon sets. The sun rises. </p>\n<p>For the first time in a week, Wei Wuxian welcomes it. </p>"
}