{
  "id": "22310215",
  "url": "https://archiveofourown.org/works/22310215?view_full_work=true",
  "author": [
    "XxmerthurcatxX"
  ],
  "title": "Quietus Riotous",
  "rating": "Explicit",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Wiedźmin | The Witcher - All Media Types"
  ],
  "relationships": [
    "Geralt z Rivii | Geralt of Rivia/Jaskier | Dandelion"
  ],
  "characters": [],
  "additional_tags": [
    "Mutual Pining",
    "friends to lover",
    "geralt pines real hard in this one",
    "Curses/Spells",
    "yennifer is a good bro",
    "Hurt/Comfort",
    "Silencing spell",
    "truth spell",
    "First Kiss",
    "First Time",
    "Fluff",
    "piiiiiiiiiiining",
    "Geralt uses his words a lot",
    "truth spell as an excuse to write dialogue other than “hmm” and “fuck”"
  ],
  "language": "English",
  "series": "",
  "published": "2020-01-19",
  "completed": "2020-01-28",
  "words": "16,755",
  "chapters": "6/6",
  "comments": "432",
  "kudos": "12,033",
  "bookmarks": "1,774",
  "hits": "113,746",
  "summary": "<p>After an unfortunate run in with a mage, Jaskier finds himself without his voice, while Geralt discovers he's bound to answer every question he's asked with the truth. What else could go wrong?</p>",
  "notes": "<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">notes</a>.)\n</p>\n<p>Thank you so much for the comments and kudos!!!! I appreciate each and every one of you for reading my explosion of emotions lol &lt;3 &lt;3</p>",
  "text": "<p>\n<span>“How far away is this mage exactly?” Jaskier asked, following Geralt out of the Inn and to the stables where Roach was waiting. </span>\n</p>\n<p> </p>\n<p>\n<span>“Hard to say,” Geralt huffed, patting Roach on the back by way of hello before attaching his supply bag to her saddle. “Locals aren’t exactly eager to venture into the woods with all that’s been happening.”</span>\n</p>\n<p> </p>\n<p>\n<span>“So no precise location. Fantastic. Should have brought better boots,” Jaskier whined, pouting as he adjusted one of said boots. </span>\n</p>\n<p> </p>\n<p>\n<span>“You could always stay behind,” Geralt said hopefully. Though he would rather die than admit it, the bard’s company wasn’t entirely unwelcome. However, his proclivity for making extra trouble for Geralt was. No doubt the mage would have Jaskier clucking like a chicken and dancing in circles. </span>\n</p>\n<p> </p>\n<p>\n<span>“It’s fine for you I suppose, since you’ve got Roach,” Jaskier carried on, ignoring Geralt entirely. Typical. “I mean, how expensive is a horse? What did you have to pay for Roach? She was more than a worthy investment,” Jaskier blathered, reaching out to scratch the horse between the ears. Roach snorted and nudged Jaskier’s chest affectionately, making the bard laugh as he pressed a kiss to her nose. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt rolled his eyes, shoving a bundle of herbs into his bag. He remembered when Jaskier had first started traveling with him. Roach hated his incessant chattering just as much as Geralt did and had, on several occasions, nipped at Jaskier’s fingers when he tried to pat her. But when a bandit had thought to try to take Roach for his own while Geralt was busy fighting his cohorts, Jaskier had for once, sprung into action by whacking the scum in the face with his lute. </span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“That’ll teach you to try and steal a man’s horse!” the bard cried triumphantly, turning to Geralt with a wide grin on his face. “Geralt did you see! Knocked him out cold with my...”</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Jaskier trailed off, looking down at what used to be his lute. The neck of the thing was snapped nearly in half which meant that Jaskier must have hit the bastard with a decent amount of force. Geralt wouldn’t quite be ashamed to admit he was impressed. But then Jaskier was falling to his knees in the dirt, cradling his lute as if it were a newborn baby. Ever the overly dramatic poet.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“Well,” Jaskier said, sitting on the ground and staring at the ruined instrument in his lap. “I suppose I’ll be in the market for a new instrument. Though I’ll be hard pressed to find one as fine as this,” he sighed, his eyes suspiciously wet. “Most beautiful lute I’ve ever played.”</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>He sounded so miserable Geralt actually felt bad, though he was admittedly thankful to him for sacrificing the damned instrument to save a horse who didn’t even like him. As if she could hear Geralt’s thoughts, Roach moved forward cautiously and nuzzled the bard’s hair. Jaskier looked up in surprise when the horse whinnied her thanks at him. </span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“You’re welcome,” Jaskier said, scratching her nose and looking a little lighter despite his blood stained lute</span>\n</em>\n<span>. </span>\n</p>\n<p> </p>\n<p>\n<span>“Geralt?”</span>\n</p>\n<p> </p>\n<p>\n<span>The witcher was jolted from his thoughts at the sound of Jaskier’s voice. He turned to see both the bard and Roach looking at him expectantly, like they were waiting for him to get a move on so they could be off. </span>\n<em>\n<span>Traitor</span>\n</em>\n<span>, Geralt thought as he heaved himself onto Roach’s back. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier hummed happily, strumming simple chords as they walked. This lute was grander than the last and Geralt knew how important it was to the bard. Geralt had long since given up trying to get Jaskier to travel in silence, and had decided music was at least preferable to conversation. Until Jaskier started trying to find rhymes for words like Kikimora. </span>\n</p>\n<p> </p>\n<p>\n<span>“Could you not fight monsters with shorter names?” Jaskier complained, slinging his lute over his shoulder. Geralt was thankful that he’d given up for the moment, but he knew that without music to keep his mouth busy, Jaskier was likely to start making idle chatter instead. Not ideal when trying to find a mage. </span>\n</p>\n<p> </p>\n<p>\n<span>Apparently, there was a dark mage terrorizing a small village with all manner of spells, taking what people valued most. The innkeeper's daughter, known for her gorgeous golden curls, was stricken bald. The best hunter in the village, named as such because he could spot a deer from far away even through the fog, lost his sight. And so on and so forth. </span>\n</p>\n<p> </p>\n<p>\n<span>“Why is she spending her time hiding in a damp, dark forest?” Jaskier wondered. He grimaced when he stepped in a particularly large mud puddle. “I thought mages preferred the finer things in life. Or is that just Yennefer?”</span>\n</p>\n<p> </p>\n<p>\n<span>Geralt grunted, not dignifying that question with a response. He’d been trying not to think about Yennefer if he could help it. After the way things had ended between the two of them, both deciding that they couldn’t trust their feelings enough to give any sort of relationship a real chance. It was Geralt’s fault that it had ended up that way, since his heart had fallen out of his mouth and he’d made that stupid wish. If he’d kept his emotions hidden from the world before, he had them under lock and key behind an impenetrable force field now. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier was there to pick up the pieces when Geralt fell apart over losing the witch. After Geralt had cooled off, he immediately regretted the way he had yelled at Jaskier. The bard had been nothing but loyal to him despite his taciturn nature and unwillingness to admit that they were friends and, in a fit of rage a hurt, Geralt tossed him aside. Not his finest hour, to be sure. </span>\n</p>\n<p> </p>\n<p>\n<span>Still, he had gotten over his pride and gone to find the bard, who was so drunk he was tripping over his feet outside of a tavern not far from where they parted ways. </span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“W-what? Come to yell at me some more?” Jaskier slurred. There were tear tracks on his cheeks, his eyes and nose red. He’d obviously been crying and not for the first time, Geralt wanted to punch himself in the face for being the cause of the bard’s heartache. He should apologize. He should beg forgiveness. But the words stuck in his throat. Instead, he paid for a room and helped Jaskier up the stairs to bed. </span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“Stop bein nice t’me,” Jaskier grumbled, swatting as the witcher tucked him under the covers. “M’mad at you, b-but if you keep being so nice I’ll--”</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>He cut himself off with a loud snore, the alcohol finally knocking him out. Geralt slept on the floor, trying to work out a course of action for the morning. In fact, he didn’t sleep much at all, too full of guilt to get any real rest. </span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>The next morning, despite his confusion. Jaskier readily accepted Geralt’s invite to continue traveling with him and if anything that just made the witcher feel worse. No apology and the bard was still ready to follow him. He was being selfish, but he’d already lost one person he cared about. He wasn’t about to lose another</span>\n</em>\n<span>. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt shook his head. Now wasn’t the time to get lost in his thoughts. It was becoming a habit and one that Jaskier had called him out on a time or two. “</span>\n<em>\n<span>If you don’t let out your feelings once in a while you’ll get stuck in your own head, Geralt</span>\n</em>\n<span>.” Whatever. He swung down from Roach’s back.</span>\n</p>\n<p> </p>\n<p>\n<span>“Stay,” he told her, running his fingers through her mane before he continued on foot, Jaskier close behind. “You should stay with Roach,” he grumbled. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier scoffed. </span>\n</p>\n<p> </p>\n<p>\n<span>“And miss the chance at new material? Hardly. If I stay behind I’ll never get enough details out of you for a song,” he said and while to him it may have sounded logical, to Geralt it sounded stupid. He never did understand why the bard willingly put himself in danger just for the sake of his music. </span>\n</p>\n<p> </p>\n<p>\n<span>“Well, that’s not a sight you see everyday,” a voice said, slow and sultry.</span>\n</p>\n<p> </p>\n<p>\n<span>Geralt paused, catching Jaskier by the collar and pulling him to a stop as a woman appeared in front of them. She was beautiful, that much couldn’t be denied; flowing red hair and sharp green eyes. There was something off about her, just like with all dark mages. Even the trees seemed to shrink away from her. </span>\n</p>\n<p> </p>\n<p>\n<span>“A witcher traveling with a bard. In my limited experience, witchers are solitary creatures. Interesting,” she mused, taking a step closer. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt drew his sword, dragging Jaskier backwards so the bard was safely behind him. The mage arched a brow in amusement. </span>\n</p>\n<p> </p>\n<p>\n<span>“Cautious thing, aren’t you?” she asked.</span>\n</p>\n<p> </p>\n<p>\n<span>“Just being careful,” Geralt said, eyes following her movements. </span>\n</p>\n<p> </p>\n<p>\n<span>The woman hummed, stopped a breath away from the witcher. Ordinarily, he wouldn’t have allowed her to get so close, but it was like something was holding him in place. </span>\n</p>\n<p> </p>\n<p>\n<span>“G-Geralt, why can’t I move?” Jaskier hissed from behind him. Right. The witcher wasn’t the only one under her spell then. Fantastic. Geralt was reminded of the very memorable occasion that he and the bard had stumbled across a siren and Jaskier had been so smitten that he nearly let the thing drown him. </span>\n</p>\n<p> </p>\n<p>\n<span>The mage smiled, peering around Geralt to stare at Jaskier. Geralt’s fingers twitched around his sword as he tried to fight against the force keeping him still, an eerie sense of fear for the other man’s safety creeping up his spine.  </span>\n</p>\n<p> </p>\n<p>\n<span>“You value your voice,” the witch said, reaching out to press her fingers to Jaskier’s throat. The bard made a choked sound and Geralt tried to turn around, but he couldn’t. “And you,” she started, sizing Geralt up now. “You are interesting. Different from any common man, woman, or child. There is fear in you. And want. Oh, you want </span>\n<em>\n<span>badly</span>\n</em>\n<span>, dear witcher,” she said with a laugh. “And for things you think you can never have.”</span>\n</p>\n<p> </p>\n<p>\n<span>Geralt swallowed hard, gritting his teeth. He’d spent decades holding in his emotions, creating a wall that not even the strongest force could tear down. But this witch was reading him like an open book. He hated it. </span>\n</p>\n<p> </p>\n<p>\n<span>She pressed her fingers to Geralt’s temple. </span>\n</p>\n<p> </p>\n<p>\n<span>“I believe I’ll take from you, the privacy of your own thoughts. All of them. The superficial ones that no one wants to be bothered about. And the deepest ones that make your heart </span>\n<em>\n<span>ache</span>\n</em>\n<span>.” </span>\n</p>\n<p> </p>\n<p>\n<span>A white hot burst of pain spread through Geralt’s body and his eyes squeezed shut on instinct even as the pain ebbed as quickly as it had come. His head was swimming when he opened them again and the witch...was gone. He checked himself over. Nothing was missing. He didn't feel any different. Wasn't she meant to take something from him? From the both of them? He wracked his brain for what the witch had said, but everything was fuzzy. Never a good sign. After mentally making a note to kill the witch, or at the very least get her locked up somewhere the next time he saw her, Geralt turned to face the bard who had been remarkably silent. </span>\n</p>\n<p> </p>\n<p>\n<span>“Are you okay?” Geralt asked, frowning when Jaskier did nothing but stare at him. “Jaskier?”</span>\n</p>\n<p> </p>\n<p>\n<span>The bard opened his mouth, eyes widening when no sound came out. He grabbed Geralt’s arm, squeezing hard as he tried and failed to produce even the simplest noise. His voice, Geralt realized. She’d taken his voice. Jaskier was clawing at Geralt’s chest now, eyes shining with unshed tears, fear coming off him in waves, making Geralt dizzy with the smell of it. </span>\n</p>\n<p> </p>\n<p>\n<span>“Okay. Easy, easy,” Geralt said, trying to calm him the same way he would Roach, with gentle words and a soft hand on his back. “We’ll reverse the spell,” he said, though he wasn’t sure how. Jaskier must have sensed his thoughts, taking Geralt’s hand in his and spelling out a word with his finger, tracing each letter slowly and waiting for Geralt’s nod that he understood before he continued. The word, Geralt quickly realized, was a name. One he hoped never to hear again. </span>\n</p>\n<p> </p>\n<p>\n<span>Yennefer. </span>\n</p>\n<p>\n<span>It was easy to find Yennefer. The upside of the foolish with Geralt had made, was that she was never very far. This time, with luck on their side, she was only a few towns over. He never intended to use it to find her on purpose, but desperate times called for desperate measures. It was proof of just how serious the situation was that Geralt let Jaskier ride seated behind him on Roach, the bard’s arms wrapped tight around his middle as he held on for dear life. Geralt was hyper aware of the warmth seeping through the fabric of his shirt, and the shaking of Jaskier’s hands where they were pressed against Geralt’s abdomen. </span>\n</p>\n<p> </p>\n<p>\n<span>“She’s not going to be happy,” Geralt murmured, steering Jaskier toward what looked to be a very impressive castle, even in the dark. He braced himself for the sight of another orgy or something equally scandalous, this was Yennefer after all, as he pushed open the doors and stepped inside. </span>\n</p>\n<p> </p>\n<p>\n<span>Yennefer was already waiting on the other side, arms crossed and an unimpressed look on her face. </span>\n</p>\n<p> </p>\n<p>\n<span>“I believe the last time we spoke I made it clear I never wanted to see you again,” she said sullenly. </span>\n</p>\n<p> </p>\n<p>\n<span>“I wouldn’t be here if it wasn’t an emergency,” Geralt told her. </span>\n</p>\n<p> </p>\n<p>\n<span>Yennefer snorted, her eyes landing on Jaskier. </span>\n</p>\n<p> </p>\n<p>\n<span>“You’re awfully quiet, bard. No scathing insults for me today?” she asked. </span>\n</p>\n<p> </p>\n<p>\n<span>Both the witcher and the mage started when Jaskier abruptly burst into tears, pressing his hand to his throat and leaning against Geralt for support. </span>\n</p>\n<p> </p>\n<p>\n<span>“Oh gods, I didn’t mean to...” Yennefer trailed off, moving forward to place a hand on Jaskier’s shoulder. “There now, come on. This is what we do isn’t it? We banter. Throw insults back and forth. I wasn’t--</span>\n</p>\n<p> </p>\n<p>\n<span>“He can’t speak, Yen,” Geralt explained, to save the witch from continuing her surprisingly jumbled attempt at an apology. It made Geralt feel better about his own botched apology attempts. When he bothered to make them. </span>\n</p>\n<p> </p>\n<p>\n<span>Yennefer hummed curiously, offering Jaskier her hand. The bard took it hesitantly, rubbing impatiently at his tears with the other. She held his hand in both of hers, eyes fluttering shut as she did whatever it was that mages do. When she opened them again her expression was hard. </span>\n</p>\n<p> </p>\n<p>\n<span>“I see you’ve met Sabine,” she said. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt frowned. </span>\n</p>\n<p> </p>\n<p>\n<span>“You know the witch who did this?” he asked, grunting when Jaskier bolted back to his side when Yennefer released him, wrapping his arms around Geralt and refusing to let go. Yennefer looked amused, but said nothing when Geralt glared at her. </span>\n</p>\n<p> </p>\n<p>\n<span>“Oh, Sabine and I go way back. She fell in with a questionable crowd. I don’t know a single witch who hasn’t had a dark dealing or two, but hers were decidedly more sinister. The kind of power she possesses...one hardly comes by it easily. This spell won’t be easy to break,” Yennefer said, her eyes falling to Jaskier as the bard held Geralt tighter, tucking his face into his neck. </span>\n</p>\n<p> </p>\n<p>\n<span>“But you </span>\n<em>\n<span>can</span>\n</em>\n<span> break it,” Geralt prompted, trying and failing to extract the bard. He’d seen Jaskier scared before, but never like this and certainly never this clingy. </span>\n</p>\n<p> </p>\n<p>\n<span>Yennefer nodded. </span>\n</p>\n<p> </p>\n<p>\n<span>“Yes. I can. But it may take time. Come with me,” she said, turning on her heel and expecting them to follow. </span>\n</p>\n<p> </p>\n<p>\n<span>“Can you walk or will I have to carry you?” Geralt asked, arching a brow teasingly. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier glared up at him, a light blush on his cheeks as he finally relented and let Geralt go so they could follow Yennefer. </span>\n</p>\n<p> </p>\n<p>\n<span>“You may sleep here tonight,” Yennefer said, opening a door to reveal an ornately decorated room. Her words were directed at Jaskier. Under different circumstances, Geralt had a feeling the bard would be off on an overexcited tangent about how lovely the room was. But now he looked defeated and sad as he once again sought comfort in Geralt’s arms. </span>\n</p>\n<p> </p>\n<p>\n<span>“Jaskier,” Geralt sighed, prying the bard from his arms and ushering him into the room. “Get some rest. Yennifer and I have things to discuss.” </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier frowned, a hurt look flickering across his face. He steeled his expression quickly and quite literally, stomped through the open door, letting it slam shut behind him. Geralt shook his head. Jaskier did have a flair for the dramatic. Still, the witcher decided he would check on him later, to make sure he was actually sleeping and now spending the night sulking.</span>\n</p>\n<p> </p>\n<p>\n<span>“I don’t recall the two of you ever being so...touchy,” Yennefer mused, leading Geralt further down the hall to an extravagant sitting room.  </span>\n</p>\n<p> </p>\n<p>\n<span>“He’s scared,” Geralt grunted. It was true that Jaskier had gotten more liberal with his touching lately, even before this happened. He always had a hand on the small of Geralt’s back when he slipped around him to grab something or pester some pub patrons for a story. It went unspoken between them that Jaskier was always the one to wash Geralt’s hair when he let it go for too long and the back got so tangled that he couldn’t do it himself. So yes, while the touching was new to Yennefer, the same couldn’t be said for the witcher. </span>\n</p>\n<p> </p>\n<p>\n<span>Yennefer moved into Geralt’s space, looking him up and down slowly. There was a time a look like that would have had Geralt ripping her bodice off with his teeth. But not anymore.  </span>\n</p>\n<p> </p>\n<p>\n<span>“I’ve never known Sabine to let her prey escape without taking something from them. Yet you appear the same as always,” she said, distrust clear in her voice. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt hummed noncommittally. He had been wondering the same thing, but he wasn’t about to let on that he was worried. </span>\n</p>\n<p> </p>\n<p>\n<span>“She said something when we were in the woods. I can’t remember what it was,” Geralt said. “Something about Jaskier’s voice and my...” he trailed off with a hiss, frustrated that he couldn’t remember. </span>\n</p>\n<p> </p>\n<p>\n<span>Yennefer held out her hand. </span>\n</p>\n<p> </p>\n<p>\n<span>“May I?” she asked. </span>\n</p>\n<p> </p>\n<p>\n<span>Part of Geralt didn’t want to feel her too familiar touch, but another part of him, the part that wanted to know for sure if Sabine had done anything to him, was stronger. He let Yennefer take his hand, watching her unblinking as she searched for anything wrong. When her eyes opened again they were wide. A slow smile spread across her face. Well, that was ominous. </span>\n</p>\n<p> </p>\n<p>\n<span>“Interesting,” she said, unable to keep the giddiness from her voice. </span>\n</p>\n<p> </p>\n<p>\n<span>“What?” Geralt asked, tugging his hand back. </span>\n</p>\n<p> </p>\n<p>\n<span>“What’s your favorite color?”</span>\n</p>\n<p> </p>\n<p>\n<span>“Blue,” Geralt said, mouth moving of its own volition. He frowned. “What’s--</span>\n</p>\n<p> </p>\n<p>\n<span>“Uh-uh, witcher. I’ll ask the questions,” Yennefer smirked. “Is it true that the witchers at Kaer Morhen do naked rituals under the moon once a month?”</span>\n</p>\n<p> </p>\n<p>\n<span>“Of course not. The nudity isn’t required, it’s a personal choice,” Geralt blurted, eyes widening as mortification swept over him and he finally remembered the words the witch in the woods had said to him. </span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>I believe I’ll take from you, the privacy of your own thoughts. All of them. The superficial ones that no one wants to be bothered about. And the deepest ones that make your heart ache</span>\n</em>\n<span>.</span>\n</p>\n<p> </p>\n<p>\n<span>“Fuck,” Geralt grumbled. </span>\n</p>\n<p> </p>\n<p>\n<span>Yennefer hummed. </span>\n</p>\n<p> </p>\n<p>\n<span>“Yes, quite.” </span>\n</p>\n<p> </p>\n<p>\n<span>“Why didn’t I start blurting things out until now?” Geralt demanded. </span>\n</p>\n<p> </p>\n<p>\n<span>Yennefer laughed, patting his arm. </span>\n</p>\n<p> </p>\n<p>\n<span>“It only seems to happen when you’re asked a question. For example,” she thought for a moment, setting herself into a cozy looking chair and fixing Geralt with a look. “Why did you make that wish?”</span>\n</p>\n<p> </p>\n<p>\n<span>“Because I wanted you. From the moment I saw you and I didn’t want to risk losing sight of you. Not when my job takes me to the end of the world and back. I wanted to ensure I had a chance of seeing you again,” Geralt told her. His face was burning, his body shaking, unused to sharing this much--fuck, unused to sharing </span>\n<em>\n<span>any</span>\n</em>\n<span> information about himself. </span>\n</p>\n<p> </p>\n<p>\n<span>Yennefer beckoned him closer with a twitch of her finger, once again taking Geralt’s hand. </span>\n</p>\n<p> </p>\n<p>\n<span>“And now? Do you want me now?” she asked, looking up at him with beautiful violent eyes that Geralt had spent more time than he cared to admit thinking about. </span>\n</p>\n<p> </p>\n<p>\n<span>“No,” Geralt said, the world leaving his mouth before he could stop it.</span>\n</p>\n<p> </p>\n<p>\n<span>“Why?” Yennefer pressed. </span>\n</p>\n<p> </p>\n<p>\n<span>“Because you were right. Back on the mountain top that day. I don’t know what’s real. And neither do you. I’d never be able to trust my feelings. Or yours,” he admitted, gritting his teeth when he was finished. </span>\n</p>\n<p> </p>\n<p>\n<span>Yennefer stood, pressing a soft and fleeting kiss to his cheek. </span>\n</p>\n<p> </p>\n<p>\n<span>“I’m sorry. It was cruel of me to use your curse to my advantage. But I had to know and you were hardly likely to give up the information voluntarily,” she reasoned. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt couldn’t fault her for it, even though he wanted to. He was overcome with sudden exhaustion, which Yennefer must have noticed. </span>\n</p>\n<p> </p>\n<p>\n<span>“I’ll show you to your room. Or would you prefer to share with the sulking bard?” she asked, teasing. </span>\n</p>\n<p> </p>\n<p>\n<span>“I’d prefer to share with the sulking bard,” Geralt mentally punched himself in the face. </span>\n</p>\n<p> </p>\n<p>\n<span>Yennefer’s face brightened with understanding. </span>\n</p>\n<p> </p>\n<p>\n<span>“Ah, suddenly the touching makes sense.”</span>\n</p>\n<p> </p>\n<p>\n<span>Geralt shook his head. </span>\n</p>\n<p> </p>\n<p>\n<span>“It’s not like that,” he said seriously. </span>\n</p>\n<p> </p>\n<p>\n<span>“But you want it to be...don’t you?” </span>\n</p>\n<p> </p>\n<p>\n<span>“</span>\n<em>\n<span>Yes, </span>\n</em>\n<span>very much. Fuck! Would you stop that!” Geralt shouted. </span>\n</p>\n<p> </p>\n<p>\n<span>Yennefer held up her hands in defeat. </span>\n</p>\n<p> </p>\n<p>\n<span>“Sorry! I’m sorry. That was the last one, cross my heart,” she promised, giggling as she watched a very put out witcher trudge down the hall toward where his bard was, hopefully, already asleep. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt let the door to the room close heavily behind him, leaning back against it and letting out a long breath. </span>\n</p>\n<p> </p>\n<p>\n<span>“Stupid truth spell,” he grumbled, flinching when something crashed loudly to the floor. His head shot up and he locked eyes with Jaskier, who was gaping at him like fish. The crash, Geralt realized, had been Jaskier’s lute falling from his lap and onto the floor. “Uh...what are the odds you didn’t hear that?” Geralt asked. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier grabbed his notebook and a quill from his bedside table, writing frantically as he moved closer to the witcher. He held up the notebook so Geralt could read it.</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Truth spell</span>\n</em>\n<span>?</span>\n</p>\n<p> </p>\n<p>\n<span>Geralt braced himself to blurt out the truth, but found that no words came out. Ah. Doesn’t work unless the question is spoken. That’s a small mercy. Still, the bard should know what was going on. </span>\n</p>\n<p> </p>\n<p>\n<span>“The witch took your voice and she took my thoughts. Or my ability to keep them to myself when I’m asked a question,” Geralt explained, pushing past the bard to sit on the unnecessarily large bed so he could pull off his boots. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier followed him, scribbling frantically and once again holding the notebook for Geralt to see. </span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>What’s your favorite color</span>\n</em>\n<span>?</span>\n</p>\n<p> </p>\n<p>\n<span>Geralt chuckled. </span>\n</p>\n<p> </p>\n<p>\n<span>“That was Yen’s first question too. Sorry bard, it only works when the question is spoken aloud.”</span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier threw up his hands, shaking his head. He collapsed next to Geralt on the bed, writing again. This time whatever he was writing was longer because by the time the notebook was being thrust under his nose Geralt had his boots and all of his armor off. </span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Figures</span>\n</em>\n<span>. </span>\n<em>\n<span>The one time I could ask you anything about your adventures</span>\n</em>\n<span>. </span>\n<em>\n<span>Anything about you that I’ve always wanted to know but you won’t tell me, AND I CAN’T SPEAK</span>\n</em>\n<span>. </span>\n<em>\n<span>Clearly the witch has a cruel sense of humor</span>\n</em>\n<span>. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt hummed in acknowledgement, climbing fully onto the bed and laying back against the pillows, feeling utterly drained. He frowned when Jaskier got up, taking one of the furs with him and laying it out on the floor. </span>\n</p>\n<p> </p>\n<p>\n<span>“Jaskier,” he said, getting the man’s attention. He waited until Jaskier’s eyes were on him before he patted the bed beside him. Jaskier’s cheeks went a lovely shade of pink and for a moment he looked like he would refuse, but the call of a good night’s sleep in a real bed must have been too strong because a second later he was crawling into bed beside the witcher. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt blew out the candles and settled in. Despite his exhaustion, it took him a long time to fall asleep. He lay in the dark, listening to Jaskier’s steady breath and finding he missed the usual sound of the bard’s soft snores. It wasn’t until much later that sleep finally took him, his thoughts still swirling, wondering what questions Jaskier would ask him if he could speak.</span>\n</p>\n<p> </p>\n<p>\n<span>Morning came far too soon, the brightness of the room making Geralt stir. He glared at the window that was letting in the offending light, about to get up and close it when he realized he couldn’t move. A quick glance downward told him why. </span>\n</p>\n<p> </p>\n<p>\n<span>Sometime during the night, Jaskier had moved closer, as he often did when the two were sleeping in close quarters. His body naturally sought out Geralt’s warmth. This time, however, he’d managed to snuggle close enough that his arm was thrown across Geralt’s middle. The witcher froze when he realized one of Jaskier’s legs had worked its way between both of his own and his thigh was currently pressing against Geralt’s morning wood. Geralt was suddenly very awake and very eager to get out of bed and get into a bath as to avoid any awkwardness. </span>\n</p>\n<p> </p>\n<p>\n<span>Fate seemed to have other plans as Jaskier shifted slightly, burying his face in Geralt’s neck as he snuggled closer. Geralt cursed under his breath. He needed to wake the bard before--Jaskier moved again, his thigh brushing more solidly against Geralt’s dick, making the witcher’s breath hitch. </span>\n</p>\n<p> </p>\n<p>\n<span>“Jaskier,” he hissed, giving the man’s shoulder a shake. </span>\n</p>\n<p> </p>\n<p>\n<span>The bard moved again, this time to rub the sleep from his eyes and yawn directly in Geralt’s face. Ordinarily that would earn Jaskier a shove onto the floor, but Geralt was more than thrilled the he was waking up. He prayed to every god he could think of that Jaskier would roll away from him before he realized the predicament they were in. Of course, as fate seemed to be determined today to make Geralt’s life miserable, the bard tensed against him. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt swallowed, watching as Jaskier dragged his gaze downwards to stare at where his thigh was still pressed to the witcher’s dick, which was achingly hard at this point. His face went beat red and Geralt had no doubt that had Jaskier had the use of his voice he would be stuttering out an incredibly awkward apology that would make the situation even worse. Jaskier finally shifted to remove his leg from between Geralt’s and in doing so, once again brushed against the witcher’s cock. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt moaned. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier froze. He blinked up at Geralt with wide eyes, a pretty flush across his cheeks and his mouth slightly parted. Geralt, for his part, was mortified. He should get up. He </span>\n<em>\n<span>needed</span>\n</em>\n<span> to get up. He needed to put more than a little distance between the two of them, but he couldn’t move. It was like he was stuck, Jaskier wound around him, their faces so close they were sharing the same breath. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt followed the movement of Jaskier’s tongue as he darted out to wet his bottom lip. Slowly and with a great amount of trepidation, Jaskier rocked his hips forward, on purpose this time. A sinful smirk spread across his face when Geralt groaned, the witcher’s hand finding Jaskier’s hip and squeezing hard. He wasn’t entirely sure what was happening, but he was more than on board and it seemed like the bard was as well. </span>\n</p>\n<p> </p>\n<p>\n<span>Before they could take it any further, there was a loud knock at the door. The two men rolled apart from each other, Geralt fighting back the urge to growl at the interruption as he made his way to the door. Yennefer was waiting on the other side, a playful glint in her eye, like she knew exactly what she had just interrupted. </span>\n</p>\n<p> </p>\n<p>\n<span>“Morning,” she said brightly. “Sleep well?”</span>\n</p>\n<p> </p>\n<p>\n<span>“No,” Geralt told her, rolling his eyes. Good to know the truth spell was still working just fine. </span>\n</p>\n<p> </p>\n<p>\n<span>“Pity. A good night’s rest would have done you some good since I need you to go out and gather some herbs for me,” she said, leaving no room for Geralt to even begin to argue. “Get dressed and meet me in the sitting room. I’ve got an old friend of yours here. I thought she may be able to help.” </span>\n</p>\n<p> </p>\n<p>\n<span>Without another word, she turned on her heel, leaving the two men to get dressed in what promised to be very awkward silence. When Geralt turned back around, Jaskier was already doing up the laces of his doublet. His eyes met Geralt’s shyly for a moment. Had Geralt been a poet like the bard, or even just an ordinary man with better use of his words, he may have said something reassuring. Something...nice. Instead, the witcher let out a quiet “hmm” before grabbing his discarded shirt from the night before and tugging it on over his head. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt felt bad for thinking it, but for the moment he was glad the Jaskier didn’t have a voice. For one thing, he’d be able to ask Geralt questions that he’d have to answer with total honesty. For another, it would be much harder to avoid the topic of conversation. It would be relatively easy to avoid reading anything that the bard scribbled in his notebook about the subject. </span>\n</p>\n<p> </p>\n<p>\n<span>When they reached the sitting room, Yennefer was laughing. Her companion was facing away from them, but even from behind Geralt knew who it was. </span>\n</p>\n<p> </p>\n<p>\n<span>“It’s been a long time, Triss,” he said, wondering for a moment if it was strange that two people who used to be the object of his affection, and the person who currently held the title, were all in the same room together. </span>\n</p>\n<p> </p>\n<p>\n<span>The mage turned to look at them over her shoulder, an amused smile on her face. No doubt Yennefer had filled her in on what was going on. From an outside perspective, it must have seemed hilarious. </span>\n</p>\n<p> </p>\n<p>\n<span>“Hello, Geralt. How are you this morning?” she asked. </span>\n</p>\n<p> </p>\n<p>\n<span>“Horny,” Geralt said.</span>\n</p>\n<p> </p>\n<p>\n<span>The room was silent for a long moment before Triss and Yennefer burst into uncontrollable laughter. Geralt contemplated leaving. Perhaps he could go live in a cave somewhere until the spell wore off. That way, even if he ended up being stuck this way forever, no one would be around to ask him any questions that had him making an utter fool out of himself. Geralt glared at the mages, turning to his left to see that even Jaskier was trying to hide a smile behind his notebook. Rude. </span>\n</p>\n<p> </p>\n<p>\n<span>“Apologies for my unfortunate timing this morning,” Yennefer managed between her giggles. </span>\n</p>\n<p> </p>\n<p>\n<span>“I told you, it’s not like that,” Geralt growled, so caught up in setting the record straight that he missed the look of hurt on Jaskier’s face. </span>\n</p>\n<p> </p>\n<p>\n<span>Even with what had almost happened between them, nothing had changed. It was a fluke. Geralt had woken up hard and Jaskier was warm and wanting, just as he usually was. They were victims of each other’s circumstances, nothing more. </span>\n</p>\n<p> </p>\n<p>\n<span>“Gosh,” Triss said, sizing up both men. “Sabine’s magic is strong as ever.”</span>\n</p>\n<p> </p>\n<p>\n<span>Geralt wasn’t surprised that Triss knew about the mage in the woods as well. When a mage was that powerful, they tended to attract attention; wanted or otherwise. </span>\n</p>\n<p> </p>\n<p>\n<span>Yennefer sighed, picking up a scrap of paper from a small tea table and handing it to Geralt. </span>\n</p>\n<p> </p>\n<p>\n<span>“That’s the list of what I need, if you would be so kind as to fetch it for me,” she said. “Shouldn’t be too much trouble. All those herbs are located in the forest surrounding the castle.” </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt grunted, taking the list from her and looking it over. He grimaced. </span>\n</p>\n<p> </p>\n<p>\n<span>“Selkimore blood?” he asked, arching a brow. </span>\n</p>\n<p> </p>\n<p>\n<span>Yennefer shrugged. </span>\n</p>\n<p> </p>\n<p>\n<span>“Dark magic requires less than savory ingredients I’m afraid. Lucky for you there was a Selkimore sighting less than two days ago and as far as I know no one has taken care of it yet,” she said cheerfully. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt sighed, but nodded. He turned to head back to the room to get his armor, stopping Jaskier with a hand on his shoulder when the bard made to follow. </span>\n</p>\n<p> </p>\n<p>\n<span>“You stay here,” he said seriously. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier balked at him, shaking his head and trying to push past Geralt. The witcher held him in place, about to remind him of what happened the last time they’d run into a Selkimore when Triss stepped in. </span>\n</p>\n<p> </p>\n<p>\n<span>“Don’t worry, sweetie. He just wants you to be safe,” she said, throwing an arm around Jaskier’s shoulders and steering him toward the tea table. “Isn’t that right, Geralt?” she asked over her shoulder. </span>\n</p>\n<p> </p>\n<p>\n<span>“Yes. I’d rather he not get hurt,” Geralt said, smacking his forehead with his palm and fixing the giggling witch with a glare. He flinched when he felt Jaskier’s hand on his arm, the bard giving him a look that spoke volumes. </span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>I’d rather you not get hurt either</span>\n</em>\n<span>. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt swallowed hard. He nodded and, despite the fact they had an audience, took a moment to give Jaskier’s hand a squeeze before he headed off to get changed. </span>\n</p>\n<p> </p>\n<p>\n<span>Yennefer walked with Geralt to the door. He waited for her to ask another question that he would be helpless to answer with anything but the truth, but she didn’t. </span>\n</p>\n<p> </p>\n<p>\n<span>“Be careful,” she told him, her brow creased in worry. “Sabine’s spells have a tendency to get worse before they get better.” </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt frowned. </span>\n</p>\n<p> </p>\n<p>\n<span>“Meaning?” he asked. </span>\n</p>\n<p> </p>\n<p>\n<span>“Meaning that you’re already more open with your thoughts and desires than you realize. I’ve never known you to give a reassuring hand squeeze,” she said. “It’s too...intimate for you.” </span>\n</p>\n<p> </p>\n<p>\n<span>That was true. Geralt was used to denying himself of what he wanted, but it had been harder since he’d been hit with the spell; letting Jaskier cling to him while he sat behind him on Roach, his inability to make himself move when he awoke to Jaskier being pressed so close he could feel his breath against his neck. And now the hand squeeze.</span>\n</p>\n<p> </p>\n<p>\n<span>“Fuck,” Geralt cursed. The sooner they broke this curse, the better. </span>\n</p>\n<p> </p>\n<p>\n<span>“Yes, quite,” Yennefer agreed. “I do care about you, Geralt. And, much as I hate to admit it, I care about the bard as well. I don’t want to see either of you hurt.” </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt touched her cheek, a familiar gesture that used to mean more, but now was meant only as a friendly comfort. </span>\n</p>\n<p> </p>\n<p>\n<span>“Thanks, Yen. For helping. For...caring,” Geralt said, the words easier to get out than they normally were. It should be nice. It should be a nice moment. Instead, it worried them both. </span>\n</p>\n<p> </p>\n<p>\n<span>Before he could say anything else that gave away too much of what he was feeling, Geralt pushed open the door and headed out to find the blasted Selkimore. </span>\n</p>\n<p> </p>\n<p>\n<span>XXX</span>\n</p>\n<p> </p>\n<p>\n<span>It seemed that it was Geralt’s lot in life to get swallowed by near every Selkimore that he fought. He should really be used to it, considering how often it happened, but he was still ridiculously put out as he trudged back to the castle completely covered in guts. Roach had still been exhausted from their ride to find Yennefer, so he left her in the stables, something he deeply regretted. </span>\n</p>\n<p> </p>\n<p>\n<span>As he neared the castle he paused. There was music coming from close by, the unmistakable sound of Jaskier’s lute drifting through the air and filling his ears with, he had to admit, a pleasant melody. He followed the music to its source, coming to a stop when he saw Jaskier sitting cross legged in to grass, strumming his lute and smiling while Triss and Yennefer tried to best to sing along with the lyrics they remembered from parties and such. Geralt was, not for the first time, reminded of how popular Jaskier’s music was. </span>\n</p>\n<p> </p>\n<p>\n<span>The bard himself looked happy for the first time since the spell had hit them. It had only been about a day since it happened, but Geralt was surprised to realize how much he missed the bard’s smile. The corner of his mouth twitched into something resembling a smile as he watched Jaskier close his eyes and throw his head back as he mouthed the words, looking delighted even though no sound came out. When the bard opened his eyes again they landed on Geralt and he fumbled the next cord, letting his lute fall from his lap as he got to his feet to run full speed over to the witcher. </span>\n</p>\n<p> </p>\n<p>\n<span>His hands fluttered over Geralt, looking for injuries, which was fair, considering his current appearance. </span>\n</p>\n<p> </p>\n<p>\n<span>“Jas, you’re getting Selkimore guts on your hands,” Geralt said gently. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier looked down at his hands, gagging. He looked like he was going to vomit, but he took a few deep breaths before turning to Geralt with an exasperated look on his face, gesturing to the state of Geralt’s entire being. </span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Again</span>\n</em>\n<span>, he mouthed. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt shrugged. </span>\n</p>\n<p> </p>\n<p>\n<span>“Occupational hazard.” </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier rolled his eyes, looking over his shoulder at the ladies who were watching the whole exchange with smiled hidden behind their hands. He pointed to waved his hands at Geralt, mouthing “<em>fucking, witchers</em>,” exaggerating both words and grinning when the witches laughed. Geralt had half a mind to wipe his hands on Jaskier’s shirt, to pay the bard back for cracking jokes at his expense.</span>\n</p>\n<p> </p>\n<p>\n<span>“You need a bath,” Yennefer said, as if it wasn’t obvious. </span>\n</p>\n<p> </p>\n<p>\n<span>“Why don’t you give him a hand, Jaskier? Make sure that wound on his abdomen that he doesn’t want you to know about doesn’t get infected,” Triss added. Geralt scowled at her. As far as he knew, he'd never wronged her. They parted ways quite amicably. He really didn't need two witches on his case about feelings that he ordinarily wouldn't even express under the penalty of death. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier’s eyes went wide and suddenly he couldn’t care less about the foul smelling guts that Geralt was covered in, trying to rip the buckles of his armor off so he could get a look at it. Geralt could practically hear the tirade Jaskier must have had going in his mind. </span>\n<em>\n<span>Stupid armor. What’s the point if it doesn’t even protect you from getting injured? You’re a witcher for goodness sake, you’re supposed to be good at this sort of thing. Why is it you always end up in the stomach of a Selkimore. For the love of</span>\n</em>\n<span>--Geralt stilled Jaskier’s hands. </span>\n</p>\n<p> </p>\n<p>\n<span>“It’s just a scratch,” he assured him, “But if you would feel better seeing it for yourself, you could--</span>\n</p>\n<p> </p>\n<p>\n<span>“Follow him to the bath,” Triss called.</span>\n</p>\n<p> </p>\n<p>\n<span>Geralt was suddenly wondering why he thought it was a good idea to seek help from a witch, well two of them now, when it was a witch who started all this in the first place. Yennefer and Triss were enjoying this far too much. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier however, seemed to think that was a brilliant idea, grabbing Geralt by the hand and yanking him toward the castle. Considering the witcher’s superior strength, he could have resisted. </span>\n</p>\n<p> </p>\n<p>\n<span>He could have.</span>\n</p>\n<p> </p>\n<p>\n<span>But he didn’t want to.</span>\n</p>\n<p>\n<span>The bathtub was unnecessarily large. More a bathing pool than a tub. Very different from the small ones in the rooms of the Inns Geralt stayed in, that he was long used to squeezing his large frame into uncomfortably. The swirling of the steam made the water look warm and inviting. Geralt could already feel his sore muscles relaxing, just from the sight. </span>\n</p>\n<p> </p>\n<p>\n<span>Eager to get out of his ruined clothes, Geralt stripped off his armor quickly, before Jaskier tried to “help.” He was fond of the bard, but the man was absolute rubbish at removing armor. Maybe with a bit more practice he could--Geralt bit his tongue, berating himself for allowing that particular thought to start forming. Now was hardly the time, what with Jaskier fluttering around him like a mother hen. </span>\n</p>\n<p> </p>\n<p>\n<span>Apparently, Geralt was taking too long disrobing because the next minute Jaskier’s hands were at the hem of his shirt, yanking it up over his head and tossing it on the ground. Geralt tried to be still under the bard’s gaze, but his fingers itched to reach out and touch. </span>\n<em>\n<span>You can’t touch what isn’t yours</span>\n</em>\n<span>, Geralt reminded himself. Jaskier stared at the wound on Geralt’s abdomen, just to the left of his bellybutton, his eyes narrowed when they met Geralt. He mouthed his words slowly. </span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Just a scratch</span>\n</em>\n<span>? </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt could practically hear the indignation in his voice and fine, okay, maybe it was more than a little scratch. It did smart more than Geralt expected it too and even though it had long since stopped bleeding, it still looked rather gruesome. Either way, it was nothing worth getting worked up over. Witcher’s healed fast and Geralt needed a bath more than he needed healing at present. </span>\n</p>\n<p> </p>\n<p>\n<span>“Right. I’m going to get in the bath now,” Geralt said kicking off his boots and tugging his pants off. “Feel free to continue to stare in disapproval.”</span>\n</p>\n<p> </p>\n<p>\n<span>Not waiting for Jaskier’s reaction, Geralt stepped into the bath, unable to stop himself from letting out a soft groan as he slipped fully into the water. He leaned against the edge of the pool, resting his elbows atop the ledge, and letting his eyes slip shut. It felt good. It felt good to just sit and not worry about anyone asking him questions. To let the water soothe his aches and pains and--</span>\n</p>\n<p> </p>\n<p>\n<span>Geralt’s whole body jerked in surprise as a pitcher of water was upended over his head. He rubbed his eyes, whipping around to see Jaskier with an innocent look on his face, despite the empty pitcher in his hand. Geralt grunted, scrubbing impatiently at the gunk in his hair, pointedly ignoring the bard. It wasn’t so long ago that he was body guarding Jaskier at one of the ridiculous balls his attended and the bard had insisted he be fresh and clean for the occasion. </span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Stop your boorish grunts of protest</span>\n</em>\n<span>. </span>\n<em>\n<span>It is one night, body guarding your very best friend in the whole wide world</span>\n</em>\n<span>. </span>\n<em>\n<span>How hard can it be</span>\n</em>\n<span>. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt grimaced when he remembered what his response had been. That Jaskier wasn’t his friend. That he neither wanted nor needed anyone. It wasn’t true then and it certainly wasn’t true now. Geralt wondered if there really was some truth to the rumor that witcher’s didn’t feel emotions. That maybe somewhere along the line, someone had gotten it mixed up. </span>\n</p>\n<p> </p>\n<p>\n<span>It wasn’t that witcher’s didn’t feel emotions. It was that they didn’t know how to properly express them. Vesemir had been like a father to Geralt, to all the witchers, but he could never admit that he cared what happened to them. Not in so many words. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt was so lost in thought, a habit that he was starting to think was another side effect of the spell, that he didn’t even realize he had stopped scrubbing his hair. He stilled when he felt familiar hands close around his, guiding them away from his hair. Before he could ask what the bard was doing, his own fingers had replaced Geralt’s, working slowly to untangle knots and rid his locks of blood and whatever kind of goo it was that coated a Selkimore’s insides. </span>\n</p>\n<p> </p>\n<p>\n<span>“You don’t have to--</span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier cut him off with a flick to his cheek, a silent cue for the witcher to shut up and let him work. The bard had removed his own boots and rolled the cuffs of both his pants and his shirt. He slipped his feet into the water, legs on either side of Geralt so he could scoot closer, pouring a small amount of something fragrant onto his hands before working it into Geralt’s hair. </span>\n</p>\n<p> </p>\n<p>\n<span>The witcher sighed, leaning into the touch, breath hitching when Jaskier’s fingers brushed behind his ear, a place he was particularly sensitive. Jaskier must have liked the reaction because he did it again, twice more, before moving away to refill the pitcher. He emptied the water over Geralt’s head, more careful this time, not wanting any of the oil he used to drip into the witcher’s eyes. </span>\n</p>\n<p> </p>\n<p>\n<span>It was no shock that Jaskier was good with his hands, considering he made his living playing the strings of his lute with well practiced elegance. Geralt hummed softly when Jaskier, done with his hair, moved on to his neck. </span>\n</p>\n<p> </p>\n<p>\n<span>The bard slid his thumbs down either side of Geralt’s neck, staring behind his ears before slipping down to where his neck and shoulder met. It had been a long time since he’d been touched in any way resembling this, and Geralt was both horrified and not at all surprised to find himself getting hard. Ever since whatever had </span>\n<em>\n<span>almost</span>\n</em>\n<span> happened that morning, he’d been on edge. It would be so easy to reach between his legs, take himself in hand and work himself over while Jaskier rubbed the tension from his neck and shoulders. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt would deny the whine he let out when Jaskier’s hands stopped until his dying day. On his tombstone, should he have one, it would read “Here lies the witcher. Never once did he whine.” He opened his eyes, leaning back in an attempt to catch Jaskier’s eyes. </span>\n</p>\n<p> </p>\n<p>\n<span>The bard’s breath was unsteady, his bottom lip caught between his teeth and his cheeks flushed. He’d been sporting pink cheeks frequently as of late and Geralt found he was </span>\n<em>\n<span>weak</span>\n</em>\n<span> to it. Jaskier fidgeted under Geralt’s gaze, one hand subtly tugging at his pants up near the crotch and oh, okay, now it made sense. Geralt wasn’t the only one affected by the bard’s ministrations. Jaskier was </span>\n<em>\n<span>hard</span>\n</em>\n<span>. </span>\n</p>\n<p> </p>\n<p>\n<span>“Jaskier,” Geralt murmured, voice rough and far too desperate for his liking. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier met his eye, a shyness that Geralt wasn’t expecting reflected in his expression. Considering the man had written a number of songs about his exploits, as well as the bits of gossip Geralt had overheard at a ball or two, the witcher had assumed he would be confident when it came to matters regarding anything below the belt. </span>\n</p>\n<p> </p>\n<p>\n<span>With a steady hand, Geralt reached out to curl his fingers under Jaskier’s chin. He tilted the bard’s head down, using his other hand to push himself up. Their noses were nearly brushing, he could feel Jaskier’s breath fanning out across his lips, all he had to do was lean in those last few inches and--</span>\n</p>\n<p> </p>\n<p>\n<span>Geralt fell back into the tub with a hiss, his hand covering the wound on his side. Right, he’d forgotten about that and had apparently leaned just far enough for it to reopen a bit and start bleeding again. </span>\n</p>\n<p> </p>\n<p>\n<span>Whatever the spell that had fallen over them was, it had broken. Jaskier quickly helped Geralt out of the bath and handed him a towel to wrap around his, thankfully already flaggings, erection.</span>\n</p>\n<p> </p>\n<p>\n<span>Geralt allowed himself to be led back to their room and deposited heavily onto the bed, though he grumbled the whole way. </span>\n</p>\n<p> </p>\n<p>\n<span>Blue balls twice in one day. </span>\n</p>\n<p> </p>\n<p>\n<span>Fate truly was a bitch.</span>\n</p>\n<p> </p>\n<p>\n<span>Or as the case might be. </span>\n</p>\n<p> </p>\n<p>\n<span>A witch. </span>\n</p>\n<p> </p>\n<p>\n<span>XXX</span>\n</p>\n<p> </p>\n<p>\n<span>Only after several potions were shoved down his throat and Yennefer had muttered some magical nonsense, did Jaskier concede that the witcher was in fact fine. A little banged up, as he always was after a monster fight, but healing nicely. </span>\n</p>\n<p> </p>\n<p>\n<span>“Here,” Yennefer said, handing a jar of salve and several bandages to the bard. “Put this on the wound and wrap it tight. He’ll be fine.” </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier nodded, giving Yennefer a kiss on the cheek as she passed him on her way out the door before he once again turned to glare at Geralt. </span>\n</p>\n<p> </p>\n<p>\n<span>“Will you stop looking at me like that if I promise to be more careful?” Geralt asked. He was getting quite sick of being fretted over.</span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier deposited the supplies on the bed next to where Geralt was perched on the edge and scribbled something in his notebook. </span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>I’m not sure you even know what it means to be careful. You’ve absolutely no sense of self preservation when you’re in a fight.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Whatever argument was forming died on his tongue when Jaskier dipped his fingers into the salve, rubbing a liberal amount over the wound. He would have a scar, that much was unavoidable, even with magical assistance. But, as Jaskier’s warm fingers pressed against his skin, he couldn’t find it in himself to care. </span>\n</p>\n<p> </p>\n<p>\n<span>It was strange, having the bard patch him up in total silence. Normally when Jaskier had to help clean Geralt’s wounds after a particularly nasty fight he went on a tirade, first berating Geralt for getting injured and then moving seamlessly to talk about how he had felt during the battle. He spent far too much time worrying about getting mud and blood on him and he often missed most of the action, something that he bemoaned because then he didn’t have enough material to compose anything new. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier was still frowning when he finished and Geralt couldn’t take it anymore. </span>\n</p>\n<p> </p>\n<p>\n<span>“I’ll give you one truth. You can ask me anything you want, written out, and I’ll answer honestly,” Geralt said, eager to wipe the look of disapproval and concern off the bard’s face. He wasn’t used to being fussed over so much and it was making him feel...well, he wasn’t sure what it was making him feel, but he didn’t like it. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier’s eyes went wide and he scrambled for his discarded notebook, plunking down on the edge of the bed beside Geralt. He tapped his chin thoughtfully, trying to work out what to ask. Geralt assumed it would be something about his life. What his grandest adventure was. What it was like at Kaer Morhen. What--</span>\n</p>\n<p> </p>\n<p>\n<span>The notebook was suddenly thrust under his nose and Geralt took it, blood going cold as he read the words. </span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Did you mean it, when you said that the one blessing you wanted from life was for me to be taken off your hands?</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Jaskier wasn’t looking at him, instead fiddling with one of the leftover bandages. Geralt’s throat was dry. His stomach had twisted itself into knots. Of all the questions he was prepared to answer, that wasn’t one of them. </span>\n</p>\n<p> </p>\n<p>\n<span>It occurred to him that he could lie. The question wasn’t spoken aloud and therefore he wasn’t bound by the truth. He could lie through his teeth. He should. If only to spare the bard’s feelings. But the truth was begging to be set free and Geralt found he was powerless to stop it. </span>\n</p>\n<p> </p>\n<p>\n<span>“Yes.” </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier was off the bed in an instant, making a beeline for the door, but Geralt was faster. He caught Jaskier by both of his wrists, holding the squirming bard in place. </span>\n</p>\n<p> </p>\n<p>\n<span>“Listen to me,” Geralt said seriously, but Jaskier wasn’t having it. He grit his teeth, trying to rip himself from the witcher’s grip as though he actually thought it possible, as though he wasn’t considering Geralt’s advantage in both height and strength. Geralt took no pleasure in holding him against his will like this, finding his words quickly in hopes that once Jaskier heard what he had to say he would stop trying to run away. </span>\n</p>\n<p> </p>\n<p>\n<span>“I wanted to be alone. Yennefer was gone and I faced the very real truth about my child surprise and you were there, about to offer idle chatter as you always do. I didn’t want to hear it,” Geralt said honestly, sighing as Jaskier continued to twist against him. He let go, unwilling to keep the bard in discomfort, but moved to block the door, sighing when Jaskier tried to shove him out of the way. </span>\n</p>\n<p> </p>\n<p>\n<span>“Jaskier, if you would just---for fuck’s sake I--” another push, almost hard enough to move him. Almost. “I knew you would never leave me!” Geralt shouted. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier stopped. He took a few steps away, staring hard at Geralt’s chest. The witcher took it as his cue to continue. </span>\n</p>\n<p> </p>\n<p>\n<span>“I knew you would never leave me,” Geralt said again, softer this time. “I knew to get you to go...I’d have to hurt you. And it doesn’t excuse what I said, I know that, but you have to understand how desperate I was to be alone. There was nothing you could say in that moment that I wanted to hear. I wasn’t...I wasn’t worthy of comfort. Not after making an idiot of myself with Yen or running from my child surprise. So yes...in the moment I meant what I said to you.”</span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier’s bottom lip was trembling. He covered his mouth as the tears finally spilled over, dripping down his cheeks as he moved to sit on the edge of the bed, hiding his face in his hands. Geralt moved to kneel in front of him, on his knees between Jaskier’s legs. He’d imagined himself in this position so many times, but never in this context. </span>\n</p>\n<p> </p>\n<p>\n<span>“Part of me expected you to brush it off, like you always do when I say something mean out of anger or annoyance,” Geralt admitted, running his fingers along the back of Jaskier’s calf, still exposed from when he’d rolled his hands up earlier. “But then you were gone and I--</span>\n</p>\n<p> </p>\n<p>\n<span>He cut himself off, gritting his teeth. With hands that shook, he reached for Jaskier’s wrists again, pulling his hands away from his face. There were tear tracks staining his cheeks as the bard sniffled, looking far more broken than Geralt could bear. He hated himself for being the one responsible for those tears. Vowed to do everything in his power to make sure Jaskier never felt this way again. </span>\n</p>\n<p> </p>\n<p>\n<span>“I regretted it as soon as you left. You...you have no idea how much I regretted it,” Geralt said. He felt nauseous. Dizzy from his own honesty. He ached for Jaskier to respond in some way. In </span>\n<em>\n<span>any</span>\n</em>\n<span> way; a nod of his head or a hand on his shoulder. When nothing happened, Geralt was dangerously close to begging. </span>\n</p>\n<p> </p>\n<p>\n<span>He closed his eyes against the thought, words spoken long ago by Vesemir playing in his head. </span>\n</p>\n<p> </p>\n<p>\n<span>Witchers are the opposite of humans. </span>\n</p>\n<p> </p>\n<p>\n<span>They are not ruled by emotions. </span>\n</p>\n<p> </p>\n<p>\n<span>They do not beg. </span>\n</p>\n<p> </p>\n<p>\n<span>They do not want. </span>\n</p>\n<p> </p>\n<p>\n<span>But Geralt wanted. </span>\n</p>\n<p> </p>\n<p>\n<span>He wanted so badly he was willing to beg if that’s what it took. </span>\n</p>\n<p> </p>\n<p>\n<span>“Forgive me,” Geralt pleaded, resting his forehead on Jaskier’s knee, so overcome he felt he might lose himself. </span>\n</p>\n<p> </p>\n<p>\n<span>Was this how humans felt all the time? So ruled by their emotions and the desire to express them that they were constantly bursting at the seams? </span>\n</p>\n<p> </p>\n<p>\n<span>“Forgive me,” he said again, a shudder running through his body when at last, gentle fingers slid through his hair. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt let out a slow breath, lifting his head just to move closer, sighing when Jaskier’s other hand curled around the back of his neck and Geralt wondered if maybe the bard was just as hungry for closeness as the witcher was. </span>\n</p>\n<p> </p>\n<p>\n<span>How did human’s live like this? So ruled by their emotions and the desire to express them that they were constantly bursting at the seams? Breaking apart, shaking with the force of it, as Geralt was now, cradled between Jaskier’s legs with his arms locked tight around his waist and his forehead against the bard’s breastbone. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier’s hands were suddenly on Geralt’s face, making him look up, confusion melting away when he saw the look in the bard’s eyes. He allowed himself to be led, unwilling to close his eyes even for a moment as Jaskier leaned down to meet him, pressing his lips to Geralt’s in a kiss that had no right to be as soft or as gentle as it was. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt </span>\n<em>\n<span>trembled</span>\n</em>\n<span>, as something in his chest loosened, his body and his mind finally giving in. </span>\n</p>\n<p> </p>\n<p>\n<span>Years of tension built between them--</span>\n</p>\n<p> </p>\n<p>\n<span>Shattered.</span>\n</p>\n<p>\n<span>Such a gentle kiss, but the room was on fire with it; energy swirling around them where they clung to one another. It was like now that they had released the lightning from the bottle, they couldn’t stop. Or maybe the kiss was so profound that it had turned Geralt into a poet, his mind suddenly filled with nonsensical pretty words and metaphors. Just in case it wasn’t merely his thoughts running away with themselves, he opened his eyes to make sure the room wasn’t truly on fire. </span>\n</p>\n<p> </p>\n<p>\n<span>It wasn’t. </span>\n</p>\n<p> </p>\n<p>\n<span>But it could have been with the heat blooming in Geralt’s stomach as Jaskier clawed at his bare back, dragging him in until Geralt had no choice but to press him fully onto the bed. With the bard’s back against the sheets, Geralt crawled over him, knees on either side of Jaskier’s hips. He was reminded, not for the first time, that the height difference between himself and the bard was minimal. Jaskier always seemed so much smaller than him, but it was easy now, to line their hips up so they could rock against each other without ever breaking the kiss. </span>\n</p>\n<p> </p>\n<p>\n<span>It was Jaskier who deepened it. Taking the gentle, almost chaste kiss, and turning it on its head. He nipped at Geralt’s bottom lip and took full advantage of the way the witcher’s lips parted in surprise, licking into his mouth. Geralt groaned, content to let the bard ravage his mouth, his hands tugging the flimsy chemise from where it was tucked into Jaskier’s pants. He’d been shirtless since he’d gotten out of the bath and he was eager to get Jaskier into a similar state of undress. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier’s breath hitched when Geralt’s hands touched his bare skin, fingers digging hard into Geralt’s hips as he desperately pressed his hips against the witcher’s. It was good. Too good. Embarrassingly close to the edge already, and unwilling to let this end without at least seeing the bard naked, Geralt broke the kiss. Jaskier pouted, trying to drag him back down. The witcher smiled, shaking his head fondly. </span>\n</p>\n<p> </p>\n<p>\n<span>“I’m not going anywhere. I just want...I want to touch you,” he said, teasing his fingers under the waistband of Jaskier’s pants. “May I?”</span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier nodded, blushing at his own eagerness, but Geralt was thankful to have his very enthusiastic consent. Though it would be better if Jaskier could have spoken the words aloud. Honestly, the only thing that could make this better would be if Jaskier had the use of his voice. Geralt never thought he would miss it this much, but gods, he wanted to hear the bard telling him what he wanted; how he wanted Geralt to touch him, guiding him through giving him pleasure because Geralt was nothing if not giving when it came to the pleasure of his bedmates. He wanted to make Jaskier come. Gods, he wanted to hear how the bard sounded when he </span>\n<em>\n<span>came</span>\n</em>\n<span>.</span>\n</p>\n<p> </p>\n<p>\n<span>Geralt chuckled when a silly thought drifted into his mind. Jaskier arched a questioning brow at him, eyes going wide when the witcher finally slipped his hand beneath the band of his pants. </span>\n</p>\n<p> </p>\n<p>\n<span>“I was wondering if you’d sing when you came,” Geralt teased, brushing his nose against Jaskier’s and kissing the indignant look from his lips. </span>\n</p>\n<p> </p>\n<p>\n<span>Deft fingers tugged at the lacings of Geralt’s pants and after a fair about of yanking and a couple of exasperated huffs, Jaskier finally managed to get them down far enough to wrap his fingers around the witcher’s cock. Geralt groaned long and low, rocking into the bard’s grip and speeding up his own strokes, resting his forehead against Jaskier’s. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt paid close attention to every little hitch in Jaskier’s breath and every sudden inhale, desperate for anything close to an actual sound he could get. When he gave a playful flick of his wrist, Jaskier’s hips bucked, his mouth falling open in a silent gasp. Goddess above, Geralt wanted to hear him now more than ever. </span>\n</p>\n<p> </p>\n<p>\n<span>“Next time,” Geralt started, cutting off with a grunt when Jaskier tightened his grip just the right way. “When your voice has returned, I’ll spend hours taking you apart,” he promised, a wolfish grin on his face when Jaskier brought his free hand around to grab at Geralt’s ass. He could tell the bard was close, his hips rutting desperately against Geralt, his breathing erratic. </span>\n</p>\n<p> </p>\n<p>\n<span>“I want to hear you. Gods, you’ve no idea how badly,” Geralt murmured, kissing Jaskier without any sort of finesse, but they were both too far gone to care. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier came first, breaking the kiss and throwing his head back. His nails were dug into Geralt’s ass, his eyes squeezed shut and his bottom lip caught between his teeth. </span>\n<em>\n<span>Beautiful</span>\n</em>\n<span>. The sight alone was enough to send Geralt over the edge as well, coming hard across the bard’s stomach and taking care not to collapse on top of him for fear of crushing the other man. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt rolled to the side, keeping and arm and a leg around Jaskier to keep him close as he panted against his neck. Jaskier turned awkwardly in his arms, pressing a kiss to Geralt’s forehead, then both cheeks, his nose, his chin, stopping a breath away from his lips. The look in his eyes made Geralt’s heart ache, the naked affection too much to bear. His eyes fluttered closed when the bard began to trace his lips with shaking fingers. </span>\n</p>\n<p> </p>\n<p>\n<span>The witcher sighed, opening his eyes. He pushed Jaskier’s sweaty fringe back from his forehead, a frown creasing his brow. </span>\n</p>\n<p> </p>\n<p>\n<span>“What’s the matter?” Geralt asked, an uneasy feeling settling in his gut when Jaskier wouldn’t meet his eye. </span>\n</p>\n<p> </p>\n<p>\n<span>Before he could ask again, Jaskier threw himself forward, locking his arms tight around Geralt and burying his face in his neck. Despite his surprise at the shift in attitude, Geralt quickly got himself together, hushing the trembling man. He traced each knob of Jaskier’s spine and dropped kisses on the crown of his head, but the bard only tightened his hold, refusing to lift his head from the crook of Geralt’s neck. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt was seconds away from demanding an explanation because moments ago they’d been having a marvelous time and he wanted nothing more than to bask in the post orgasmic haze and then drift off to sleep with his arms around his bard. The witcher startled when he felt Jaskier fingers on his back and it took him a minute to realize he was spelling something. Now that his attention was focused on Jaskier’s touch, Geralt tried to work out what he was saying. </span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Don’t go</span>\n</em>\n<span>. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt’s chest went tight. </span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Stay</span>\n</em>\n<span>. </span>\n</p>\n<p> </p>\n<p>\n<span>So that was it. The bard was so used to Geralt leaving him behind, disappearing with hardly a word. Geralt cursed himself over and over again for making Jaskier feel this way. Like he didn’t matter to Geralt at all, all because the witcher was crap at emotions and even a sentence as simple as “you’re my friend and I care about you” made him want to run away to a cave and never speak to anyone again. If it weren’t for the spell, he might never have--</span>\n</p>\n<p> </p>\n<p>\n<span>Geralt’s eyes went wide. </span>\n</p>\n<p> </p>\n<p>\n<span>He pulled away from Jaskier, just enough so that he could tip the man’s chin up a little, unwilling to say this without looking at his face. </span>\n</p>\n<p> </p>\n<p>\n<span>“This wasn’t because of the spell.” </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier blushed, once again trying to hide against Geralt’s neck, but the witcher held strong. </span>\n</p>\n<p> </p>\n<p>\n<span>“All the spell has done is make me voice my thoughts. Even without being asked a question I can’t help but give them more freely,” Geralt admitted, touching Jaskier’s cheek. “It made me face my thoughts honestly, but it didn’t put any thoughts in my head that weren’t there to begin with.” </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier looked a little unsure, but he nodded just the same, melting against Geralt when he closed the distance between them. Though it promised to be a good kiss that had them both weak at the knees, it was halted abruptly when Jaskier yawned directly into Geralt’s mouth. </span>\n</p>\n<p> </p>\n<p>\n<span>The witcher snorted, a fond look on his face when Jaskier blinked sleepily up at him, his unfairly beautiful blue eyes a little glazed. </span>\n</p>\n<p> </p>\n<p>\n<span>“Sleep. I’ll be here when you wake up,” Geralt told him, pressing one final kiss to Jaskier’s forehead before pulling the bard close, quite ready for a nap himself. </span>\n</p>\n<p> </p>\n<p>\n<span>XXX</span>\n</p>\n<p> </p>\n<p>\n<span>Considering how desperately Jaskier had clung to him, Geralt was more than a little shocked to wake up in an empty bed. He pushed himself up enough to look around the room to be sure the man hadn’t simply gotten up to jot down a new lyric in his notebook or throw on his chemise because he got chilly. </span>\n</p>\n<p> </p>\n<p>\n<span>It was not as such. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt was used to his bedmates not staying. Yen had always been up the moment the witcher drifted off, throwing on her gown and leaving the man behind tangled in sheets still soaked with sweat. On the occasion he popped into a brothel, he’d barely come down from his orgasm when payment was demanded and he was kicked from the room. Always the same. Eager to fuck a witcher to say they had done it, but never willing to stick around after. He has assumed it would be different with Jaskier. </span>\n</p>\n<p> </p>\n<p>\n<span>Instead of staying in bed sulking, which was what he desperately wanted to do, Geralt got himself dressed and headed off in search of something to eat. He was determined not to go looking for Jaskier. The bard would come back to him...he hoped. </span>\n</p>\n<p> </p>\n<p>\n<span>In his haste, Geralt nearly knocked Triss over. Though to be fair he hadn’t expected her to be waiting right outside his bedroom door. </span>\n</p>\n<p> </p>\n<p>\n<span>“Not so fast, witcher!” Triss said, putting a hand on his chest as though it could really stop him if he wanted to get by. </span>\n</p>\n<p> </p>\n<p>\n<span>“What’s going on? Where’s Jaskier?” Geralt asked. Ah, so apparently his mouth hadn’t gotten the memo about not looking for the bard. </span>\n</p>\n<p> </p>\n<p>\n<span>“Relax, he’s with Yen. He never would have left your side had she not portaled him into her spell room,” Triss explained, a cheeky grin on her face. “Admittedly, neither of us expected him to be starkers. Well done with that one, my friend. He’s got quite the--</span>\n</p>\n<p> </p>\n<p>\n<span>“Is he okay?” Geralt asked, cutting her off before she said anything else about Jaskier’s...more personal assets. </span>\n</p>\n<p> </p>\n<p>\n<span>“He’s fine. Yen finished the potion that should cure his curse and she didn’t want to wake you because the process involves a lot of just sitting around and waiting to see if the potion works and that would bore you to tears. Besides, all of us know what you’re like when you first wake up. You needed the rest more than you needed to pace around nervously and kick up a fuss while she worked,” Triss said knowingly. </span>\n</p>\n<p> </p>\n<p>\n<span>“I wouldn’t kick up a fuss,” Geralt said grumpily. </span>\n</p>\n<p> </p>\n<p>\n<span>Triss arched a brow. </span>\n</p>\n<p> </p>\n<p>\n<span>“Oh? Geralt darling, tell me honestly, would you flutter about nervously like a mother hen if we’d woken you?”</span>\n</p>\n<p> </p>\n<p>\n<span>“Yes,” Geralt answered, rolling his eyes when the witch burst into a fit of giggles. Right, somewhere between their coupling and falling asleep, Geralt had forgotten about the truth spell. “Is the kitchen off limits or am I permitted to eat?” he asked. </span>\n</p>\n<p> </p>\n<p>\n<span>Triss smiled, producing a picnic basket from behind her back and handing it to him. </span>\n</p>\n<p> </p>\n<p>\n<span>“Why don’t you take that to the barn and have a nice long chat with your horse? I’m sure she’d appreciate the apple peels I snuck in there.” </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt grunted, accepting the basket and immediately heading for the barn. He was fond of Triss, but he didn’t want her asking anymore prying questions. </span>\n</p>\n<p> </p>\n<p>\n<span>Roach greeted him with a playful nudge of her nose against his chest, but he didn’t miss the way she peeked over his shoulder to check and see if he’d brought Jaskier with him. </span>\n</p>\n<p> </p>\n<p>\n<span>“He’s busy,” Geralt told her, opening the basket and taking out the apple peels. “But I brought these for you.” </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt held the peel under her nose, smiling when her lips tickled his hand as she ate the peels. </span>\n</p>\n<p> </p>\n<p>\n<span>“If memory serves, I used to be your favorite,” Geralt reminded her. </span>\n</p>\n<p> </p>\n<p>\n<span>Roach nickered, hooking her chin over the witcher’s shoulder to show that even if she had developed a fondness for the bard, Geralt was in fact still her favorite. </span>\n</p>\n<p> </p>\n<p>\n<span>As per Triss’s instructions, Geralt took his time in the barn. He felt bad for neglecting Roach, though she didn’t seem to be holding a grudge as she stood still and patiently let him brush out her mane. </span>\n</p>\n<p> </p>\n<p>\n<span>It was a nice barn, Geralt had to admit. Though it made sense he supposed since it was part of the castle. A small part of him wondered how exactly Yen ended up with a castle of her own in the first place, but decided that some questions were better left unanswered. </span>\n</p>\n<p> </p>\n<p>\n<span>“Must be nice to stay in a place like this,” Geralt mused, taking a loaf of bread from the basket and taking a large bite, suddenly aware of how hungry he was. “We’ll be off as soon as this mess gets sorted. Off too...”</span>\n</p>\n<p> </p>\n<p>\n<span>He trailed off, unsure of how to really finish that sentence. Winter wasn’t far off and the best place to be when it hit was Kaer Morhen, but there was still the matter of his Child Surprise. With the war brewing, he knew she would be in danger and destiny had decided it was his duty to protect her. And what of Jaskier? Would he want to go with him? Even if it meant the possibility of riding into an actual battle?</span>\n</p>\n<p> </p>\n<p>\n<span>Geralt shook his head. Those were questions he couldn’t answer at present. Not without talking with his bard first. </span>\n</p>\n<p> </p>\n<p>\n<span>When the food was finished and Roach was sufficiently full of snacks, her mane free of any knots, Geralt gave her a parting scratch behind the ears before he headed back inside. </span>\n</p>\n<p> </p>\n<p>\n<span>Triss was nowhere to be seen this time, so Geralt decided to head to the spell room, pushing the door open without bothering to knock. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier was seated in a comfy looking chair, tears streaming down his face while Yennefer stroked his hair and kissed the top of his head. </span>\n</p>\n<p> </p>\n<p>\n<span>“What’s wrong?” Geralt asked, his concern moving him forward. “Is he alright?” </span>\n</p>\n<p> </p>\n<p>\n<span>Yennefer stepped around the bard, pausing Geralt with a hand to the chest. She looked at him with fondness in her eyes, pressing a soft kiss to his cheek and leaning in close to whisper in his ear. </span>\n</p>\n<p> </p>\n<p>\n<span>“Be gentle with him you emotionally stunted brute,” she said, giving Geralt a pat on the cheek before exiting the room. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt frowned. That was strange. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier’s sniffles brought him back to the present and he went to the bard immediately, dropping to his knees in front of him, hands on his thighs. The position was eerily similar to the one Geralt had found him in just hours earlier, though the atmosphere was vastly different. </span>\n</p>\n<p> </p>\n<p>\n<span>“Did the potion not work? Yennefer and Triss won’t stop trying after one attempt. They’ll find--</span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier cut him off, two fingers pressed to Geralt’s lips as he opened his mouth to speak his first words in what felt like decades. </span>\n</p>\n<p> </p>\n<p>\n<span>“It worked.”</span>\n</p>\n<p>\n<span>Geralt wasn’t prepared for the rush of joy he felt when the bard spoke those two simple words. It worked. Jaskier had is voice back. Which begged the question, why was he weeping? As if sensing his thoughts, Jaskier snorted, rubbing the tears from his cheeks even as they continued to fall. </span>\n</p>\n<p> </p>\n<p>\n<span>“It’s the damned potion,” he explained. “Yen said it was normal, but goddess above I’m going to dehydrate myself if I don’t stop soon, which let me tell you is so bad for my voice and I can’t just--</span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier cut off abruptly, bringing his hand up to his throat and touching it gingerly. </span>\n</p>\n<p> </p>\n<p>\n<span>“You know I...I haven’t actually tried to sing yet,” he said quietly. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt nodded in understanding. The bard made his living with pretty ballads and jigs about randy fishmonger’s daughters. His worry that his voice might not be the same was understandable. </span>\n</p>\n<p> </p>\n<p>\n<span>“You could try singing now,” Geralt suggested. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier raised his brows at him. </span>\n</p>\n<p> </p>\n<p>\n<span>“I was under the impression that my singing drove you mad. I distinctly recall the last time I sang Toss a Coin to Your Witcher you told me to shut up or you would strangle me with the strings of my lute,” Jaskier reminded him. </span>\n</p>\n<p> </p>\n<p>\n<span>Ah. Well, the bard had a point. For all his complaining though, Geralt couldn’t deny that Jaskier’s voice was nothing short of lovely. It did grate on him from time to time, but only when he needed the man to keep quiet for safety purposes. He’d be lying if he said he hadn’t missed his crooning the last few days. </span>\n</p>\n<p> </p>\n<p>\n<span>“Been too quiet without it. I...wouldn’t mind hearing a bit,” Geralt said. He pointedly stared at Jaskier’s knee, unwilling to see the look of smug satisfaction of his face. A moment later, soft melodic words drifted through the air. </span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Toss a coin to your witcher</span>\n</em>\n</p>\n<p>\n<em>\n<span>Oh valley of plenty, oh valley of plenty</span>\n</em>\n</p>\n<p>\n<em>\n<span>Ooooh</span>\n</em>\n</p>\n<p>\n<em>\n<span>Toss a coin to your witcher</span>\n</em>\n</p>\n<p>\n<em>\n<span>A friend of humanity!</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Jaskier finished the phrase, looking relieved that his voice seemed to be normal, suffering no lasting effects from the curse. Geralt offered a small smile, but it faded quickly when he remembered that while Jaskier’s curse was broken, his own was still very much in tact. Should the bard wish it, he could ask Geralt anything...and he would be bound to answer truthfully. He caught sight of a small glass bottle with a cork in the top closed in Jaskier’s fist. </span>\n</p>\n<p> </p>\n<p>\n<span>“What’s that?” he asked. </span>\n</p>\n<p> </p>\n<p>\n<span>The bard looked down and jumped in surprise, like he had forgotten he was holding it. He turned it over in his fingers, a pensive look on his face. </span>\n</p>\n<p> </p>\n<p>\n<span>“It’s--um, Yen gave it to me— it’s the cure for your...your curse,” he said, biting his lip as he waited for Geralt to react. </span>\n</p>\n<p> </p>\n<p>\n<span>The witcher’s first instinct was to wrench the potion out of Jaskier’s grip and down it quickly before the man had a chance to ask him any questions he wasn’t prepared to answer. As the potent smell of fear entered his nose, coming off the bard in waves, his sense of urgency to break his own curse was replaced with a need to know what was wrong; why Jaskier looked like he wanted to run from the room with the potion in hand. </span>\n</p>\n<p> </p>\n<p>\n<span>“You’re scared,” Geralt said slowly. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier flinched. </span>\n</p>\n<p> </p>\n<p>\n<span>“No I’m n--</span>\n</p>\n<p> </p>\n<p>\n<span>“I can smell it.”</span>\n</p>\n<p> </p>\n<p>\n<span>Geralt tried not to be accusatory as he pushed himself to his feet to get a bit of distance, pacing the room. He’d never known Jaskier to be scared around him. Or if he was, it was because he was being chased by a monster and not because he was afraid of Geralt himself. It made him </span>\n<em>\n<span>hurt</span>\n</em>\n<span>, to think of the bard scared of him in any way. </span>\n</p>\n<p> </p>\n<p>\n<span>“Not of you,” Jaskier said quietly, coming to stand behind Geralt and placing a gentle hand between the witcher’s shoulder blades. “Never of you. Gods, no one who has seen what you look like with beer foam on your nose could be scared of you.”</span>\n</p>\n<p> </p>\n<p>\n<span>Geralt remembered vividly the foam on the nose incident. Jaskier laughed so hard that he had fallen from the barstool he was perched on while Geralt’s cheeks had gone red and he wiped his nose with the back of his hand. </span>\n</p>\n<p> </p>\n<p>\n<span>He offered Jaskier a grunt in response. </span>\n</p>\n<p> </p>\n<p>\n<span>“That, right there!” Jaskier said suddenly, the force of the words enough to make Geralt turned around to face him in confusion. “That’s what I’m scared of!”</span>\n</p>\n<p> </p>\n<p>\n<span>Geralt frowned. </span>\n</p>\n<p> </p>\n<p>\n<span>“I don’t--</span>\n</p>\n<p> </p>\n<p>\n<span>“The damn grunting! I-I’m terrified that once you drink this potion things are going to go back to how they were,” Jaskier admitted, shaking with fear and fury and too much sadness for Geralt’s liking. </span>\n</p>\n<p> </p>\n<p>\n<span>“Jaskier...I’m not--</span>\n</p>\n<p> </p>\n<p>\n<span>“I know! I know you’re not normally good at voicing you feelings. And I can’t even fault you for it because you’ve been taught your whole life that emotions are weakness. I’d like a word with whatever bullheaded witcher told you that. Not to mention every person you meet asks you if it’s true that witchers don’t have feelings,” Jaskier continued, on a roll now. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt was tempted to stop him and tell him not to worry, but he hadn’t heard Jaskier go on a rant in days and to be honest he had sort of missed it. </span>\n</p>\n<p> </p>\n<p>\n<span>“I’ve traveled with you long enough to understand what you’re actually trying to say every time you respond with a hum or a curse, but hearing you be honest with me with your actual words has been...it’s meant more to me than I can put into words. More than I can say with a million ballads. But...but I fell in love with you back when you couldn’t use your words and it’s not like I’ll stop loving you just because--</span>\n</p>\n<p> </p>\n<p>\n<span>“You love me?” Geralt asked. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier’s cheeks were pink even as he glared at Geralt. </span>\n</p>\n<p> </p>\n<p>\n<span>“You knew that. Don’t pretend you didn’t know that.” </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt hadn’t known that actually. He suspected there might be something more to it whenever Jaskier offered to wash his hair or patch up his wounds. There had been moments between them, like the ones that happened since they’d arrived at Yen’s, but they were few and far between. Jaskier never pushed for more so Geralt didn’t either. It wasn’t until things came to a head with the whole, rolling around in bed and kissing each other senseless bit, that he even sure that Jaskier’s feelings mirrored his own. </span>\n</p>\n<p> </p>\n<p>\n<span>The pain in Geralt’s chest increased tenfold and he couldn’t help but reach out for the bard. Jaskier took a step back, keeping himself just out of Geralt’s reach. </span>\n</p>\n<p> </p>\n<p>\n<span>“I could ask you anything. I could ask you anything right now and you’d have to answer. If--if you didn’t take the potion then I could ask you anytime I was feeling insecure and you’d have to tell me the honest truth,” Jaskier said, holding the bottle in shaking hands. </span>\n</p>\n<p> </p>\n<p>\n<span>“But it wouldn’t be fair. I could never do that to you. Not when I know what your own thoughts mean to you. And the last thing I would want is to lose your trust or make you think that I don’t trust you. Not to mention someone else could use it to hurt you. Fuck. </span>\n<em>\n<span>I </span>\n</em>\n<span>could hurt you without even meaning to. I’m sorry! I’m so sorry for dragging this out. Y-you must want--I mean of course you---here,” Jaskier thrust the potion at him, bottom lip trembling as he waited for the witcher to take it. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt took the potion, turning it over and over in his fingers. All he had to do was drink it and he would be back to normal. He glanced at Jaskier, the bard giving him what he supposed was his attempt at a reassuring smile. </span>\n</p>\n<p> </p>\n<p>\n<span>If anyone else had withheld the cure for his curse from him, even for a moment, Geralt would have been beyond pissed. But as Jaskier stood there, looking at Geralt with nothing but trust in his eyes despite his shaking hands, he knew what he had to do. </span>\n</p>\n<p> </p>\n<p>\n<span>He set down the potion. </span>\n</p>\n<p> </p>\n<p>\n<span>“Geralt what--</span>\n</p>\n<p> </p>\n<p>\n<span>The witcher moved closer to his bard, bring a gentle hand to rest on the back of Jaskier’s neck, his thumb brushing below his ear. He knew Jaskier liked that. He knew it would help to put him at ease. </span>\n</p>\n<p> </p>\n<p>\n<span>“Ask me,” Geralt said. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier’s eyes were wide as saucers. He shook his head vehemently. </span>\n</p>\n<p> </p>\n<p>\n<span>“No. No, Geralt, you don’t have to. I trust you. I--</span>\n</p>\n<p> </p>\n<p>\n<span>“I know,” Geralt told him, cupping his face in both his hands. </span>\n</p>\n<p> </p>\n<p>\n<span>“Then why?” Jaskier asked, curling his fingers around Geralt’s wrists, just holding him there. </span>\n</p>\n<p> </p>\n<p>\n<span>“Because I trust you too.” </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt knew that Jaskier would understand the weight that those words carried for him. There were so few people in the world that Geralt was willing to place all of his trust in. Yennefer he trusted for the most part, but her never ending quest for power still made her dangerous. Triss was sweet, but they were hardly bosom buddies. Aside from Roach, the only person that Geralt trusted completely was Jaskier. </span>\n</p>\n<p> </p>\n<p>\n<span>“Ask me,” Geralt said again. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier nodded, his heart beating so rapidly Geralt was worried the bard may collapse before he actually got a chance to ask. </span>\n</p>\n<p> </p>\n<p>\n<span>“Do you love me?” </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier’s voice was soft, hesitant, like he was afraid of the question. His fingers flexed nervously where they were still clutching Geralt’s wrists. </span>\n</p>\n<p> </p>\n<p>\n<span>The words came tumbling out of Geralt’s mouth, clearly eager to put the antsy bard at ease.</span>\n</p>\n<p> </p>\n<p>\n<span>“Yes,” Geralt said, letting his forehead rest against Jaskiers. “More than anything.”</span>\n</p>\n<p> </p>\n<p>\n<span>The bard shuddered against him, pressing up on his toes, lips barely a breath away from Geralt’s and--</span>\n</p>\n<p> </p>\n<p>\n<span>“Except for maybe Roach, but to be fair I’ve had her since before I met you.”</span>\n</p>\n<p> </p>\n<p>\n<span>They blinked at each other, both surprised at the words. Not for the first time, Geralt cursed the truth spell for ruining the moment, but Jaskier was laughing so hard he had to hold onto the witcher for support, so he guessed it wasn’t all bad. </span>\n</p>\n<p> </p>\n<p>\n<span>“I suppose I can’t blame you for that. She is a truly majestic beast,” Jaskier said, giggling into Geralt’s neck. “And so are you,” he teased.</span>\n</p>\n<p> </p>\n<p>\n<span>Geralt growled playfully, curling his fingers around the collar of Jaskier’s jacket and dragging him in for a kiss that started slow and deep but was quickly going frantic. Jaskier moaned when Geralt’s tongue teased against his own, fingers already slipping down to slide down the front of Geralt’s pants--</span>\n</p>\n<p> </p>\n<p>\n<span>“I’ll thank you not to explore the more carnal side of your relationship in the middle of my spell room,” Yennefer said, the sound of her voice making the two men break apart. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier, at least, had the decency to look sheepish, but Geralt was annoyed at being interrupted. The sooner they got out of here the better. Not that he wasn’t thankful to Yen for her hospitality and her help in breaking spell, but he’d like to be able to kiss Jaskier whenever he wanted and not worry about being walked in on by his ex. </span>\n</p>\n<p> </p>\n<p>\n<span>“Sorry, Yen, but I mean,” Jaskier gestured to all of Geralt. “Can you really blame me?” </span>\n</p>\n<p> </p>\n<p>\n<span>Yennefer smirked. </span>\n</p>\n<p> </p>\n<p>\n<span>“I suppose not. Have you tried bouncing a coin off his ass yet, because--</span>\n</p>\n<p> </p>\n<p>\n<span>“Yen,” Geralt warned. </span>\n</p>\n<p> </p>\n<p>\n<span>The witch rolled her eyes, but didn’t continue wherever that sentence was about to go. She eyed the potion bottle that was still sitting on the table. </span>\n</p>\n<p> </p>\n<p>\n<span>“Might want to see if that works. If not, it’s back to the books,” she said, sounding both annoyed and intrigued by the prospect of more research. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier picked up the potion, handing it to Geralt, his hands perfectly steady this time.</span>\n</p>\n<p> </p>\n<p>\n<span>“Right then, bottoms up,” the bard said, waiting expectantly to Geralt to take it. </span>\n</p>\n<p> </p>\n<p>\n<span>The witcher took the bottle, popping the cork with his thumb. He hesitated for only a moment, but at Jaskier’s reassuring smile, he downed it in one gulp, grimacing at the taste. </span>\n</p>\n<p> </p>\n<p>\n<span>“The fuck did you put in that?” he asked Yennefer, wiping his mouth in disgust. </span>\n</p>\n<p> </p>\n<p>\n<span>“It’s better if you don’t know,” Triss said, appearing at Yennefer’s side out of nowhere. </span>\n</p>\n<p> </p>\n<p>\n<span>They waited with baited breath as the potion entered the witcher’s system. There was a sheen of sweat on his brow and his pulse was unusually fast, but Geralt grit his teeth and waited it out, knowing it would pass. His stomach lurched and he fell to his knees, but thankfully he didn’t vomit. Jaskier was at his side in an instant, rubbing his back and pressing his lips to Geralt’s temple to keep him grounded. The witcher dug his fingers into Jaskier’s knee, closing his eyes and bracing himself as he waited for the nausea to pass. </span>\n</p>\n<p> </p>\n<p>\n<span>It was a solid few minutes before Geralt felt he could stand back up. The room wasn’t spinning anymore, so that was a good sign. </span>\n</p>\n<p> </p>\n<p>\n<span>“How do we know if it worked?” Jaskier asked the witches, who were looking on in both concern and amusement at the way the bard was refusing to let go of the witcher. </span>\n</p>\n<p> </p>\n<p>\n<span>“Ask him a question,” Triss suggested. </span>\n</p>\n<p> </p>\n<p>\n<span>“Right, yes, I should have thought of that,” Jaskier said. “Uh, Geralt, how old were you when you lost your virginity?” </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt grimaced. </span>\n</p>\n<p> </p>\n<p>\n<span>“Really? That’s what you chose to ask?” </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier grinned. </span>\n</p>\n<p> </p>\n<p>\n<span>“Well, you didn’t answer so I’m guessing that means you’re back to your normal gruff sense.” </span>\n</p>\n<p> </p>\n<p>\n<span>As if to prove the bard’s point, Geralt hummed. He noted that despite the relief on Jaskier’s face, he still looked a little apprehensive. Quick as a flash Geralt hefted the man over his shoulder, ignore his shriek as he headed for the door. </span>\n</p>\n<p> </p>\n<p>\n<span>“Where are you going?” Yennefer asked, giggling madly and trying to keep herself upright as Triss fell into her, laughing so hard she looked like she might pass out.</span>\n</p>\n<p> </p>\n<p>\n<span>“Not that it’s any of your business, but I believe I have a bard to ravage,” Geralt called, ignoring Yen’s warning shout that should they break anything beyond repair, they’d be paying her back for it in coin. That was fair. Geralt didn’t stop until he was back at the room he and Jaskier were sharing. </span>\n</p>\n<p> </p>\n<p>\n<span>He deposited Jaskier onto the bed, perhaps a bit too roughly if the “oof” that the bard let out was anything to go off of, crawling over him with a smirk. </span>\n</p>\n<p> </p>\n<p>\n<span>“You absolute ass! You can’t just--</span>\n</p>\n<p> </p>\n<p>\n<span>Geralt cut off Jaskier’s rambling, fond of it though he was, and kissed him hard. Now that Jaskier had his voice back, he was more than eager to get his hands on him. He had wondered long enough what he would sound like when Geralt had him trembling with pleasure. As he trailed hot open mouthed kisses down Jaskier’s neck, he felt a harsh tug on his hair. It took him a moment to realize the man wanted his attention and that he wasn’t pulling Geralt’s hair for sexy reasons. </span>\n<span></span><br>\n<br>\n</p>\n<p>\n<span>“Yes?” Geralt asked, put out when he’d been about to leave a rather sizable love bit on the bard’s neck. </span>\n</p>\n<p> </p>\n<p>\n<span>“You’re sure this is what you want, right?” Jaskier asked. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt frowned. He thought they’d been over this. Had the bard forgotten his love confession already? </span>\n</p>\n<p> </p>\n<p>\n<span>“I’ve got my voice back now, Geralt. I won’t shut up. You know I won’t. Promise you won’t get sick of the sound of my voice.” </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt nudged Jaskier’s nose with his own, kissing him once, twice, three times before he found the words to respond with. </span>\n</p>\n<p> </p>\n<p>\n<span>“I like your voice,” he said simply. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier looked at him with disbelief clear on his face. </span>\n</p>\n<p> </p>\n<p>\n<span>“You and I both know that my voice drives you up a wall, don’t even--</span>\n</p>\n<p> </p>\n<p>\n<span>“It drives me up a wall when you can’t shut up when you’re safety is called into question. It’s got nothing to do with your voice,” Geralt told him seriously, kissing the bard’s forehead. </span>\n</p>\n<p> </p>\n<p>\n<span>“Jas...I’m...I’m not going anywhere.”</span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier nodded, smiling shyly. </span>\n</p>\n<p> </p>\n<p>\n<span>“Suppose you better get on with it then. These pants do feel a bit tight,” he said, wiggling his hips for good measure. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt sat back on Jaskier’s thighs, tugging his own shirt up and over his head. Jaskier did the same. His arm got caught in one of the sleeves of his chemise, but with a little help he was free of the offending garment. Before he could get started on his pants, Geralt was on him again, nipping at his chest. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier arched into his touch when Geralt’s tongue circled one of his nipples, clever fingers giving the other one a pinch before they continued their downward quest. </span>\n</p>\n<p> </p>\n<p>\n<span>“Gods, that’s--ah!” Jaskier gasped, pushing his hips up into Geralt’s hand as he palmed at him through his pants. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt shivered with every moan the bard let out. It was so much better like this, Jaskier free to use his voice as much as he pleased, soft sounds of pleasure sliding past his lips, getting louder as Geralt continued. </span>\n</p>\n<p> </p>\n<p>\n<span>“O-oh my---off, t-take them off for mercy's sake,” Jaskier panted, pawing at Geralt until the witcher halted his assault on the bard’s chest to unceremoniously rip his pants from his legs. </span>\n</p>\n<p> </p>\n<p>\n<span>What the--Geralt! I liked those pants!” Jaskier said. </span>\n</p>\n<p> </p>\n<p>\n<span>“I’ll buy you a new pair,” Geralt growled, catching the bard’s flailing leg to press a kiss to his ankle. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier seemed to forget all about the ruined pants as Geralt nipped at his inner thighs, leaving red and purple bruises as he went. Geralt couldn’t help but rock his hips against the bed, eager some type of relief, every sound out of Jaskier’s mouth making him impossibly harder. </span>\n</p>\n<p> </p>\n<p>\n<span>“Can I?” Geralt asked, so close to Jaskier’s dick that the bard shivered as he felt the witcher’s breath. </span>\n</p>\n<p> </p>\n<p>\n<span>“Yes,” Jaskier breathed. “Anything, anything you want.” </span>\n</p>\n<p> </p>\n<p>\n<span>Those were dangerous words and they both knew it. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier’s entire body shuddered when Geralt finally got his mouth on him, wrapping his lips around the head of the bard’s dick and sucking lightly. The witcher had planned to tease, but when Jaskier wrapped his thighs around Geralt’s neck and began to thrust shallowly into the heat of his mouth, he found he could scarcely hold back himself. </span>\n</p>\n<p> </p>\n<p>\n<span>“Goddess above, that feels---h-how are you so good at--w-where did you learn--” Jaskier seemed to be having trouble stringing a full sentence together. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt hummed around him, bobbing his head faster, not missing the way Jaskier’s thighs were beginning to tremble, the hand that had wound its way into Geralt’s hair tightening. </span>\n</p>\n<p> </p>\n<p>\n<span>“It’s so good, </span>\n<em>\n<span>oh Geralt, please</span>\n</em>\n<span>,” Jaskier whined when Geralt slipped a finger lower, teasing at his entrance. “</span>\n<em>\n<span>Fuck me</span>\n</em>\n<span>,” Jaskier groaned. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt pulled off with a wet pop, catching Jaskier’s thumb in his mouth when the bard traced his bottom lip, giving it a playful nip. A second later a small bottle of oil was, quite literally, thrown at his head. Geralt frowned at it, looking up at the bard with an arched brow. </span>\n</p>\n<p> </p>\n<p>\n<span>“You know what it is and why I handed it to you,” Jaskier said quietly, looking at Geralt with a sort of reverence that made the witcher’s pants tighter than they already were. </span>\n</p>\n<p> </p>\n<p>\n<span>“Are you sure?” Geralt asked, running his hands over the bard’s still shaking thighs. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier nodded eagerly. </span>\n</p>\n<p> </p>\n<p>\n<span>“Yes. I’m sure. Gods, I’ve spent months, </span>\n<em>\n<span>years</span>\n</em>\n<span>, thinking about what it would feel like having you inside me,” Jaskier admitted. </span>\n</p>\n<p> </p>\n<p>\n<span>Neither of them were prepared for the deep groan that Geralt let out at that thought. The smirk on Jaskier’s face was nothing short of filthy. </span>\n</p>\n<p> </p>\n<p>\n<span>“Ooo, interesting,” Jaskier teased, holding Geralt’s chin between his thumb and forefinger. “I believe I’ve found one instance where you don’t mind my chatter one bit.” </span>\n</p>\n<p> </p>\n<p>\n<span>Instead of responding, Geralt uncapped the oil and dribbled a decent amount onto his fingers, reaching under Jaskier to tease once more. The bard let out a hiss as the first finger slipped inside, giving an impatient wiggle of his hips when Geralt began to move his finger in and out far too slowly for his liking. </span>\n</p>\n<p> </p>\n<p>\n<span>“For goodness sake, Geralt, I’m not going to brea--ake!” </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier’s voice skipped several octaves as Geralt took him back into his mouth at the same time as he added a second finger. </span>\n</p>\n<p> </p>\n<p>\n<span>The witcher took great care in opening the bard up, scissoring his fingers slowly, taking Jaskier as far into his mouth as he could without gagging to distract him from the sting that came with being stretched. </span>\n</p>\n<p> </p>\n<p>\n<span>“I-If you don’t stop I’m going to finish before you even get a chance to fuck me,” Jaskier warned. </span>\n</p>\n<p> </p>\n<p>\n<span>“Distract yourself,” Geralt grunted, licking a drop of precum that had gathered at the tip of the bard’s dick. Somewhere deep inside, the more animalistic side that all witcher’s had, purred with pleasure at the bittersweet taste of Jaskier on his tongue. What was happening between them now was raw; fueled by lust and love alike and Geralt found he wanted to crawl inside the bard until they were one and the same. </span>\n</p>\n<p> </p>\n<p>\n<span>“What do you suggest I--oh god--do to distract myself? Sing?” Jaskier asked, a contemplative look on his face. “Actually--</span>\n</p>\n<p> </p>\n<p>\n<span>“Don’t you dare,” Geralt warned, but Jaskier was already grinning cheekily. </span>\n</p>\n<p> </p>\n<p>\n<span>“When a humble bard, graced a ride along...ride along is a bit weird to say when your fingers are in my--ass!” Jaskier gasped, jaw dropping open when Geralt’s tongue joined his fingers. </span>\n</p>\n<p> </p>\n<p>\n<span>It was pure, primal instinct, to get his mouth on every part of Jaskier he could; a need to leave his mark any and everywhere that he could. If they way Jaskier was clawing at the sheets was anything to go by, he was more than on board, but all too soon he was pushing at Geralt’s shoulders with a whine. </span>\n</p>\n<p> </p>\n<p>\n<span>“Please, for the love of god Geralt, I’m ready. I want--need you. </span>\n<em>\n<span>Please</span>\n</em>\n<span>,” he begged, and really, who was Geralt to refuse.</span>\n</p>\n<p> </p>\n<p>\n<span>The witcher pressed a lingering kiss to Jaskier’s thigh, pushing himself off the bed to finally rid himself of his pants. When he looked back at the bard, his eyes were trained on Geralt’s cock. It wasn’t as though he hadn’t seen Geralt’s cock before. Hell, he’d held it in his hand just the night before. But now he looked...hungry. </span>\n</p>\n<p> </p>\n<p>\n<span>“You’re drooling,” Gerlat deadpanned. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier shook himself from his stupor, blushing hard and wiping at his mouth, glaring at Geralt when there wasn’t any actual drool. </span>\n</p>\n<p> </p>\n<p>\n<span>“I told you, I’ve wanted you inside me for years. Did you think my fantasies were limited to one orifice?” Jaskier asked, eyes back on Geralt’s cock and his tongue caught between his teeth. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt had to take himself in hand, squeezing the base of his dick in an attempt to calm himself down because the thought of Jaskier taking him into his mouth was too much for him to handle in his current state of almost aggressive arousal. </span>\n</p>\n<p> </p>\n<p>\n<span>“Later,” Geralt said, crawling back over the bard. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier nodded. </span>\n</p>\n<p> </p>\n<p>\n<span>“Yes. Later,” he agreed, settling himself against the pillows, his hands settling on Geralt’s hips as the witcher situated himself between his legs. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt poured more of the oil onto his hand, using it to slick himself up before he pressed himself against the bard. Jaskier gave his hips a reassuring squeeze, his breath catching when Geralt pushed forward until just the head of his cock was inside. </span>\n</p>\n<p> </p>\n<p>\n<span>“Keep going,” Jaskier gasped. </span>\n</p>\n<p> </p>\n<p>\n<span>“You should take a minute to--</span>\n</p>\n<p> </p>\n<p>\n<span>“</span>\n<em>\n<span>Please</span>\n</em>\n<span>.” </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt hushed the bard, taking one of his legs and hooking in over his shoulder, kissing at the bend of his knee. Despite Jaskier’s pleads for him to continue, he waited, giving himself a moment to adjust as much as the bard before he slowly pushed in the rest of the way. Jaskier’s fingers were digging into his hips so hard, Geralt knew there would be crescent shaped marks from his nails left behind, a reminder of their coupling that he would wear with pride. </span>\n</p>\n<p> </p>\n<p>\n<span>“Oh, this is not going to last long at all,” Jaskier said, a breathy sort of laugh leaving his throat. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt hummed in agreement, his embarrassment at being so close to the edge already ebbing now that he knew that Jaskier was in the same state as him. </span>\n</p>\n<p> </p>\n<p>\n<span>“Y-you can move now,” Jaskier told him. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt nodded, letting the bard’s leg drop from his shoulder. Jaskier looked confused for a moment, but then Geralt was looping his arms around the man’s back and yanking him upwards so that he was seated in his lap. </span>\n</p>\n<p> </p>\n<p>\n<span>“Geralt, what--</span>\n</p>\n<p> </p>\n<p>\n<span>“You’re the one who wanted a ride along,” Geralt teased, rocking his hips up to thrust shallowing into the man above him. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier moaned, locking his arms around Geralt’s neck, lifting himself up and dropping back down. Geralt adjusted to his rhythm easily, meeting him thrust for thrust. </span>\n</p>\n<p> </p>\n<p>\n<span>“This wasn’t w-what I meant when I wrote t-that line,” Jaskier huffed. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt smirked. </span>\n</p>\n<p> </p>\n<p>\n<span>“Wasn’t it?” he asked knowingly. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier blushed, but refused to give Geralt the smug satisfaction of being right. Geralt groaned when clever fingers tangled in his hair, pulling hard, a sharp contrast to the bard’s lips trailing softly up his neck to nibble at his ear. </span>\n</p>\n<p> </p>\n<p>\n<span>“Jaskier,” Geralt grunted, picking up the pace of his thrusts, his own nails dug hard into the other man’s back. He was close. So fucking close, and Jaskier’s gasps and moans were already starting to sound reedy and broken where his lips were pressed to Geralt’s ear. </span>\n</p>\n<p> </p>\n<p>\n<span>“I-I know,” Jaskier said, understanding without Geralt having to say the words, just like he always did. “Me too. I-I’m close too.” </span>\n</p>\n<p> </p>\n<p>\n<span>The thought spurred Geralt on, his hand snaking down between them to curl around Jaskier’s dick, stroking in time with the rise and fall of the bard’s hips. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier came first, head thrown back as he moaned unabashedly, a beautiful, broken sound that had Geralt following a moment later, his teeth sunk into the bard’s neck. </span>\n</p>\n<p> </p>\n<p>\n<span>They came down slowly, taking long shaking breaths. </span>\n</p>\n<p> </p>\n<p>\n<span>“Um, Geralt? Not that this wasn’t fucking fantastic, but do you think you could maybe remove your teeth from my neck?” Jaskier asked. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt had been so caught up in his pleasure that he hadn’t even noticed his teeth were still in Jaskier’s neck. He pulled away carefully, kissing the reddening bite apologetically. That was a mark that would be there for a day or two and despite Geralt’s remorse, he knew it wouldn’t be a hardship to see the mark standing out against Jaskier’s pale skin. </span>\n</p>\n<p> </p>\n<p>\n<span>When they had both cleaned up, Jaskier decided it was Geralt’s job to go find them something to eat, since his ass was sore and he didn’t intend to move until morning. </span>\n</p>\n<p> </p>\n<p>\n<span>“I’m sorry about the bite,” Geralt mumbled as he passed Jaskier a large piece of bread with cheese. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier shook his head. </span>\n</p>\n<p> </p>\n<p>\n<span>“Don’t be. I liked it. A lot actually,” Jaskier said thoughtfully, fingers brushing over the bite. “Makes me feel like I’m yours.” </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt’s lips twitched into a soft smile, which he tried to cover up by shoving a handful of grapes into his mouth. </span>\n</p>\n<p> </p>\n<p>\n<span>“I am you know...yours I mean. That’s probably obvious at this point but I feel like sometimes it needs saying,” Jaskier said, scrambling excitedly for his notebook. “That’s rather good actually. There’s definitely a ballad in there somewhere and--oi!”</span>\n</p>\n<p> </p>\n<p>\n<span>He dropped his notebook as Geralt yanked him into his arms, nuzzling into his hair. Geralt had always been better with actions than with words, but her understood that now and again, he’d have to find it in himself to be honest with how he was feeling. If anyone deserved to know his thoughts it was Jaskier. </span>\n</p>\n<p> </p>\n<p>\n<span>“Mine,” he said softly, kissing Jaskier’s forehead. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier smiled, popping a grape into his mouth and settling back against Geralt’s chest. </span>\n</p>\n<p> </p>\n<p>\n<span>“Yours,” he agreed. </span>\n</p>\n<p> </p>\n<p>\n<span>They sat in comfortable silence, Geralt feeling content for the first time in--</span>\n</p>\n<p> </p>\n<p>\n<span>“I mean, who else is going to put up with your grumpy ass?”</span>\n</p>\n<p> </p>\n<p>\n<span>Geralt took a deep breath, letting it out slowly through his nose. </span>\n</p>\n<p> </p>\n<p>\n<span>“You have until the count of three,” he said. </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier frowned. </span>\n</p>\n<p> </p>\n<p>\n<span>“Until what?” </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt set the food aside, readying himself as if he were going to pounce.</span>\n</p>\n<p> </p>\n<p>\n<span>“One.”</span>\n</p>\n<p> </p>\n<p>\n<span>“You look a bit like you’re going to eat me...you’re not are you? You wouldn’t want to eat me, I’d be very stringy. Ha! Stringy! C-cause I’m a bard a-and I play the lute a-and a lute has strings...get it? ” Jaskier asked nervously, sliding as far away as the bed would allow. </span>\n</p>\n<p> </p>\n<p>\n<span>Geralt smirked, shrugging.</span>\n</p>\n<p> </p>\n<p>\n<span>“Two.” </span>\n</p>\n<p> </p>\n<p>\n<span>Jaskier scrambled off the bed, tripping in his haste to get away from the witcher, who had a playful glint in his eyes that the bard knew spelled trouble. </span>\n</p>\n<p> </p>\n<p>\n<span>“Oh dear, oh dear, oh dear--Geralt!”</span>\n</p>\n<p> </p>\n<p>\n<span>“Three!”</span>\n</p>"
}