{
  "id": "22438099",
  "url": "https://archiveofourown.org/works/22438099?view_full_work=true",
  "author": [
    "DancingInTheStorm"
  ],
  "title": "And Now I See Daylight",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
  ],
  "relationships": [
    "Midoriya Izuku & everybody"
  ],
  "characters": [
    "Midoriya Izuku",
    "Sero Hanta",
    "Kirishima Eijirou",
    "Shinsou Hitoshi",
    "Asui Tsuyu",
    "Bakugou Katsuki",
    "Yaoyorozu Momo"
  ],
  "additional_tags": [
    "outside pov",
    "mostly - Freeform",
    "Social Media",
    "Future Fic",
    "Pro Hero Midoriya Izuku",
    "pro hero everybody",
    "fanboy!hero deku",
    "Hero Con",
    "addressing Quirkless discrimination"
  ],
  "language": "English",
  "series": "Part 3 of DancingInTheStorm’s BNHA fics",
  "published": "2020-01-27",
  "completed": null,
  "words": "9,302",
  "chapters": "1/1",
  "comments": "464",
  "kudos": "12,200",
  "bookmarks": "3,481",
  "hits": "69,396",
  "summary": "<p>AnalysisOverload<br>Current mood: HERO CON HERO CON HERO CON HERO CON</p>\n<p>AnalysisOverload reblogged AnalysisOverload <br>Okay, let’s talk HeroCon. </p>\n<p>Look around, and you’ll see a lot of discrimination—against people whose Quirk is debilitating, against people whose Quirks scare us, against people who have trouble controlling their Quirk, against people who don’t have a Quirk at all. It’s easy to feel alone in a sea of discrimination.</p>\n<p>Enter HeroCon:X. </p>\n<p> </p>\n<p>A social media fic following Deku post-graduation. </p>",
  "notes": "<p>I made a few text edits plus major formatting edits on February 9, 2022</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>I made a few text edits plus major formatting edits on February 9, 2022<br>Tumblr: <a href=\"https://www.tumblr.com/blog/awake-my-oceans\" rel=\"nofollow\">awake-my-oceans </a></p>",
  "text": "<p><strong>AnalysisOverload</strong><br>Current mood: HERO CON HERO CON HERO CON HERO CON</p>\n<p>\n<em> #I AM READY #no but seriously I’ve heard some of what they’re planning this year and I think it’s going to help a lot of people #HeroCon</em>\n</p>\n<p> </p>\n<p align=\"center\">\n<em>. . .</em>\n</p>\n<p> </p>\n<p><strong>DekuTracker</strong><br>Deku is an UNCONFIRMED ATTENDEE at Tokyo’s HeroCon, you all know what this means, buckle up folks it’s gonna be a wild ride</p>\n<p><strong>Living-Clock<br></strong>I don’t know what this means? Am I stupid? I feel stupid</p>\n<p><strong>DekuTracker<br></strong>you must be new here! np. If Deku is a confirmed attendee, that means he’ll formally attend the event as a hero. If he’s an unconfirmed attendee, that means he’s coming as Midoriya Izuku, fanboy extraordinaire. The past year he’s been roped into attending all the cons as Deku, so we’ve all missed everyone freaking out over Deku going undercover with all his fans.</p>\n<p><strong>dekuforlife<br></strong>“Undercover” makes it sound like he’s some celebrity milking his fans for compliments. That’s not it. He’s just as much of a fanboy as the rest of us.</p>\n<p><strong>Living-Clock</strong><br>But if he’s an unconfirmed guest, he...might not be coming at all?</p>\n<p><strong>eat-the-sun<br></strong>Oh you sweet, naive thing. Deku ALWAYS comes to hero cons.</p>\n<p>\n<em>#the sun is hot the sky is blue and deku will be first in line to any hero con #listen I don’t make the rules #heroes #deku #hero con</em>\n</p>\n<p> </p>\n<p align=\"center\">\n<em>. . .</em>\n</p>\n<p><em><br></em><strong>OfficialUravity<br></strong>I’m not sure you all realize how much Deku loves every single one of you. Right now he’s in tears because someone on social media is having a hard day at school, and he’s trying to figure out a way to help. </p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p>4:25 just_a_blogger: @<em>theherozone </em></p>\n<p>4:26 just_a_blogger: @<em>theherozone </em></p>\n<p>4:27 just_a_blogger: @<em>theherozone </em></p>\n<p>4:27 allmightanalyses: what??? are you so excited about???</p>\n<p>4:27 just_a_blogger: Deku just released a new interview</p>\n<p>4:27 just_a_blogger: it’s FANTASTIC</p>\n<p>4:27 just_a_blogger: @<em>theherozone</em></p>\n<p>4:29 just_a_blogger: I’d have @‘d you too, Mido, except you always get awkward when we talk about Deku</p>\n<p>4:29 theherozone: I’M COMINGGGGGGGG STOP MAKING MY POCKET BUZZ SQUID</p>\n<p>4:30 theherozone: okay I forgive you deku interviews are gold</p>\n<p>4:30 theherozone: speaking of, what do you have against deku, mido? he’s #1 for a reason.</p>\n<p>4:30 theherozone: mido?</p>\n<p>4:30 just_a_blogger: look at that, you killed him. Go and think about what you’ve done</p>\n<p>4:30 just_a_blogger: but seriously, you okay mido?</p>\n<p>4:31 allmightanalyses: yeah! I was just struggling with a sudden impulse for honesty </p>\n<p>4:31 theherozone: I am Intrigued</p>\n<p>4:31 allmightanalyses: okay</p>\n<p>4:31 allmightanalyses: so</p>\n<p>4:31 allmightanalyses: I know I’m going to have to tell you pretty soon or never, but work was really stressful today and I? just? ouch. </p>\n<p>4:31 just_a_blogger: a mystical answer</p>\n<p>4:31 theherozone: okay i’m not trying to be pushy. It’s just weird that you don’t like to talk about Deku</p>\n<p>4:31 just_a_blogger: what was stressful about work?</p>\n<p>4:32 allmightanalyses: I had this big video project and I’m not happy with how postproduction handled it</p>\n<p>4:32 allmightanalyses: I think they wanted my presentation to look more sensationalist, when I wanted it to look more genuine</p>\n<p>4:32 just_a_blogger: what was the project for?</p>\n<p>4:32 allmightanalyses: it was promoting my company</p>\n<p>4:32 theherozone: you had a postproduction team? Must have been a pretty big project</p>\n<p>4:32 allmightanalyses: yeah</p>\n<p>4:32 allmightanalyses: anyways I’ll just lurk on the group chat for a while if that’s okay. I’d actually really like to know what you think of that interview</p>\n<p>4:33 just_a_blogger: ok</p>\n<p>4:33 just_a_blogger: sO</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p>\n<b>Deku claims that “anyone can be a hero”</b>\n</p>\n<p>In a new interview with the Number One Hero, Deku claimed that “anyone can be a hero when they help people.” </p>\n<p>The heroics career track, the dream career of any child and a fair few adults, has long been restricted to the elite students of the hero track courses. Now, Deku is claiming that everyone can be “a hero in the most important ways” by simply helping your neighbor, walking the dog, or reaching out to someone in need. Do these words ring true, or are heroics reserved for the big leagues? In this video summary, we ...</p>\n<p>[<u>Read more</u>]</p>\n<p>[View full interview <u>HERE</u> ]</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p>4:47 theherozone: and the way he talks about the QUIRKLESS </p>\n<p>4:47 theherozone: I have never felt so validated in my life tbh</p>\n<p>4:47 theherozone: excuse me for not being worth anything because I can’t blow bubbles from my nose like my sister</p>\n<p>4:47 theherozone: but then comes Deku </p>\n<p>4:47 theherozone: saying the most important thing we can value in a person is their kindness</p>\n<p>4:47 theherozone: I am Shook</p>\n<p>4:48 just_a_blogger: I watched the whole interview </p>\n<p>4:48 just_a_blogger: and just went “wow Jazz has to see this”</p>\n<p>4:48 just_a_blogger: you still there, mido? </p>\n<p>4:48 allmightanalyses: yup just crying </p>\n<p>4:48 theherozone: same</p>\n<p>4:48 allmightanalyses: I’m really really really glad Deku’s words meant something good to you jazz</p>\n<p>4:49 theherozone: !!! You can like Deku! </p>\n<p>4:49 theherozone: I gotta say, I’ve never liked him more than in this moment so you chose a good time for your awakening</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p align=\"center\"> </p>\n<p>9:01 allmightanalyses: DONE</p>\n<p>9:01 allmightanalyses: DONE</p>\n<p>9:01 allmightanalyses: AND DONE</p>\n<p>9:02 theherozone: ?</p>\n<p>9:02 allmightanalyses: you know that project I’ve been talking about?</p>\n<p>9:02 theherozone: the one where you’re trying to fight Quirk/Quirkless discrimination?</p>\n<p>9:02 theherozone: the one where everyone’s been stupid about it the whole time?</p>\n<p>9:02 allmightanalyses: yeah</p>\n<p>9:03 allmightanalyses: my superiors FINALLY approved it</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p align=\"center\"> </p>\n<p>\n<b>VIDEO—Announcing HeroCon:X</b>\n</p>\n<p>\n<em> View comments &gt; </em>\n</p>\n<p>JayBird: “The next hero con will focus on Quirk inclusivity and acceptance” yeah but asking the real question: who’s Deku going to cosplay as?</p>\n<p>\n<em><br>27 replies &gt;</em>\n</p>\n<p>FroppyPositivity: 1) Quirk inclusivity is pretty important 2) Maybe this year he‘ll do Froppy!!!</p>\n<p>KingExplodoKill: if deku doesn’t cosplay as jurassic I quit</p>\n<p>Hurting-on-the-inside: @everyone can we just. stop. with all the hero hype when there are actual legitimate problems going on right now? the vote for tightening quirk restrictions is just two days away and all anyone can talk about is hero con??</p>\n<p>MikoTheTerrible: RED RIOT RED RIOT RED RIOT RED—</p>\n<p>Electric-Dancer: Honestly I don’t care who Deku picks, he has good taste</p>\n<p>Feeltheburn: @<em>JayBird </em> Quirk acceptance is more important than what a 20something dresses up in, fight me</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p align=\"center\"> </p>\n<p><strong>darkness-all-consuming<br></strong>Can we all give my precious child of eternal darkness some love? Tsukuyomi is SUCH an effective and humble hero.</p>\n<p><strong>OfficialDeku<br></strong>YES.</p>\n<p>(Sorry OP, I’m told that my commenting on anything gives a headache’s worth of notes for the next month or so.)</p>\n<p>(Everyone check out OP’s commissions, they’ve got some master-level art skills.)</p>\n<p>Tsukuyomi’s main tenet is control. With a Quirk like his, that’s easy to understand, but it has some fascinating implications for his hero work.</p>\n<p>\n<u>Read more</u>\n</p>\n<p>\n<em> #tsukuyomi is an amazing hero and an honorable person #tsukuyomi </em>\n</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p align=\"center\"> </p>\n<p><strong>AllMightAllDay<br></strong>[Could not load image]</p>\n<p>Aren’t we all jealous?</p>\n<p><strong>flavormonster<br></strong>Image description: Deku leans against All Might, fast asleep. One of All Might’s arms is over Deku’s shoulder, and both are clearly content.</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p><strong>AnalysisOverload</strong><br>I got!! an All Might figurine! It is Big. I am putting it by my twelve other All Might figurines. it is bigger than Buff Might but littler than Tall Might.</p>\n<p><strong>mariathinksoutloud</strong><strong><br></strong>@<em>AnalysisOverload </em> remember this? It’s really cute how you lined up all your All Might figurines by height and weight.</p>\n<p><strong>AnalysisOverload<br></strong>I was literally ten when I wrote that post and it shows. My love and admiration for All Might is undying, but it Haunts me how everything that goes on the internet stays on the internet. </p>\n<p><strong>squirrelbrain<br></strong>BUFF MIGHT</p>\n<p>\n<em> #yes hello I would like to order a buff might #the buffest might you’ve got in stock<br></em>\n</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p align=\"center\"> </p>\n<p><strong>torrents-of-flowers<br></strong>Surreal story of the day: I start my first day working at Deku’s agency (!!!) as a low-level secretary. I get assigned an email address that’s last name.first name@[redacted]. Cool, cool. </p>\n<p>I’m checking my email since sO HELP ME I AM STANDING IN-PERSON IN DEKU’S AGENCY I need some way to distract myself so I don’t spontaneously combust. </p>\n<p>I get an email from midoriya.izuku@[redacted] saying how he’s really looking forward to working with me, and a whopper of a paragraph on how cleverly I use my Quirk. First impression: slightly overenthusiastic but kind coworker. I google “Midoriya Izuku” because the guy works at a hero agency, so I can probably get some information on him online, right?</p>\n<p>Right?</p>\n<p>And THAT is the story of how I found out that Deku himself emailed me, personally, on my first day of work as a secretary so low-level that I doubt we’ll ever see each other EXCEPT MAYBE WE WILL WHO KNOWS ANYTHING ANYMORE anyways Deku is the nicest person ever and he almost gave me a heart attack twenty seven minutes into my first day of work.</p>\n<p><b>DekuForLife<br></b>lol you’ve had the Deku Experience</p>\n<p>\n<em> #got another one folks #sometimes I wonder if he gives heart attacks to people on purpose #it would explain So Much #he has a chaotic streak that he doesn’t have much chance to express as a lawbound hero #and there’s gotta be some sort of outlet #The Deku Experience</em>\n</p>\n<p align=\"center\"> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p><strong>fanboyforever<br></strong>TWO WEEKS TO HEROCON:X</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p><strong>AnalysisOverload<br></strong> <em>Anonymous asked: Why did you stop doing Quirk breakdowns? They were So. Good. Could I interest you in Juggernaut’s Quirk? Pleaaaaaase?</em></p>\n<p>I’ve answered variations of this ask <u>here</u>, <u>here</u>, and <u>here</u>. The upshot is, my analyses got a little too detailed and accurate, and anyone can read my content. It’s honestly not a great idea to post thorough breakdowns of a hero’s strengths and weaknesses to the web, so no, I won’t be breaking down Juggernaut’s Quirk, although it is FASCINATING. Sorry!</p>\n<p>\n<em> #hero analyses #personal #asks </em>\n</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p align=\"center\"> </p>\n<p align=\"center\"><b>Stars and Scars<br></b> <em>Commission info — Drop me a note! — FAQs — About me</em></p>\n<p>Does anyone else find it ironic that Deku and All Might get along so well? I mean, All Might was forced to retire by a guy with tons of Quirks, and now here’s the former Symbol of Peace mentoring a hero with six Quirks?</p>\n<p>I mean, does ANYONE else question this? The Quirk to have more than one Quirk is unheard of, and here’s a villain and a hero with the same Quirk and nobody is concerned? </p>\n<p>We’ve all seen the conspiracy videos about Deku being All Might’s secret child, but we know next to nothing about the villain at Kamino Ward except how he SHARES THE SAME QUIRK AS DEKU.</p>\n<p>Quirk heritage is pretty straightforward. The child usually gets some variant of the parents. The evidence is in your faces.</p>\n<p>Deku is not All Might’s secret child. Not by a long shot.</p>\n<p align=\"center\">\n<em> View 181 comments &gt;<br></em>\n</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p><strong>DekuTracker<br></strong>UPDATE: Deku has a panel scheduled for HeroCon:X on Thursday at 3:30</p>\n<p><strong>Falcon-king-of-birds<br></strong>does this mean he’s coming officially instead of as a fan? :’(</p>\n<p><b>OfficialDeku<br></b>Nope! I told the event organizers that if they tried to rope me into being Deku the whole con again, I was canceling my panel.</p>\n<p><strong>dusterchild<br></strong>You killed Ai, Deku. You killed her. @<em>Falcon-king-of-birds </em> is on the ground hyperventilating since you answered her post. </p>\n<p>\n<strong>Falcon-king-of-birds</strong>\n</p>\n<p>HEY @<em>dusterchild </em> you hypocrite you’re freaking out toO</p>\n<p>\n<em> #AAAAAAAAAAAA #AAAAAJSJDJFHFHHEHEGFHFJDHSHGHSHFJJDJAJSJVJDJFJDJ</em>\n</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p><strong>AnalysisOverload<br></strong>Okay guys, buckle down. Today we’re talking about all the flaws in the heroics system.</p>\n<p>I’ve made an itemized list. It’s 33 points long. If that’s too much for you, the tl:dr is as following: heroics has turned into a popularity contest and a political game instead of a system where heroes focus on helping people.</p>\n<p>Here goes.</p>\n<p>\n<u>Read more</u>\n</p>\n<p><strong>Nejire-Chan-forever<br></strong>So you’re saying Stain was right?</p>\n<p><strong>AnalysisOverload<br></strong>Good question. Completely, absolutely not. Stain said “the hero system is messed up so I’m going to kill imperfect heroes.” I’m saying “the hero system is messed up so we need to do better at grassroots compassion, and we need to change the political landscape so it values people’s lives more.”</p>\n<p>Killing people is almost never the answer. Killing people simply because the system they learned to adapt to is flawed? That’s definitely not the answer.</p>\n<p>\n<em> #I get compared to Stain more often than I like #but he’s Wrong #killing people who don’t measure up isn’t a good way to increase selflessness in a system #analyses #stain #heroics<br></em>\n</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p align=\"center\">\n<b>337 days since Deku broke a bone</b>\n</p>\n<p>Iida_Tenya: so unless you want to deal with hero liability insurance companies, please refrain from such rookie behavior.</p>\n<p>SpaceGirl: speaking as someone whose parents own a construction company, Iida is way right. Don’t go knocking down abandoned buildings unless you want to pay enough to keep a construction company afloat for half a year.</p>\n<p align=\"center\"><em> Deku </em> is online <em>   </em></p>\n<p>Deku: where’s Kacchan?</p>\n<p>SpaceGirl: he left for some undercover assignment an hour ago</p>\n<p>Deku: Kacchan? Undercover?</p>\n<p>Alien Queen: that’s what we said</p>\n<p>Alien Queen: speaking of unbelievable stuff, have you all seen that trending blog post?</p>\n<p>Deku: about All for One being my father? Yes.</p>\n<p>SpaceGirl: say what</p>\n<p>Alien Queen: thoughts?</p>\n<p>Deku: All Might makes a better dad</p>\n<p>Alien Queen: BURN</p>\n<p>Alien Queen: but really</p>\n<p>Alien Queen: what do you think?</p>\n<p>Iida_Tenya: I must object to your interest in gossip and slander! Midoryia has every right to ignore such an article!</p>\n<p>Deku: it’s fine</p>\n<p>Deku: my dad was never around</p>\n<p>Deku: so having him be All for One would at least give him an excuse for not coming back home after his first fight with All Might</p>\n<p>Deku: that leaves only three years of blatant neglect</p>\n<p>Deku: could be worse</p>\n<p>SpaceGirl: you okay, Deku?</p>\n<p>Alien Queen: okay I was not expecting that level of burn</p>\n<p>Deku: fine</p>\n<p>Deku: I worried my father might try to get back into my life once I went pro, but nope. Like I said, could be worse.</p>\n<p>Deku: anyways how long is Kacchan assigned to his undercover mission?</p>\n<p>SpaceGirl: he said he’d be gone at least a month</p>\n<p>Deku: huh</p>\n<p>Deku: okay then</p>\n<p>Deku: wow</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p><b>OfficialDeku<br></b>Everyone take a look at what Creati has been up to in the past few months. She’s often only talked about as the Yaoyorozu heir and a sex icon, but she shut down what experts were calling the new League of Villains, worked with medical experts to synthesize a groundbreaking drug, and traveled from one end of the country to another in a campaign to prevent sexual abuse. </p>\n<p>\n<em>#she’s also doing incredible work in some areas I can’t talk about yet #suffice to say: her brilliance and compassion are off the charts #it has been an honor to work with Creati and more people need to pay attention to her work #hero updates #Creati<br></em>\n</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p align=\"center\">\n<b>NEW MERCHANDISE: DEKU, URAVITY, SPRINGBOARD</b>\n</p>\n<p>Want a sneak peak at the hottest items of the summer? Get your first look at HEROSTASH. </p>\n<p>Top of our list is Deku, who announced a NEW LINE of apparel featuring inspirational quotes from heroes across the rankings! Click <u>here</u> for more information.</p>\n<p>[Your ad will load shortly]</p>\n<p>Next up is Uravity, boasting an <u>adorable new space onesie</u> for your baby dreaming of heroics! We adore the paw-shaped footies and, of course, the classic Uravity pink.</p>\n<p>Last but not least, Springboard is shooting up the rankings with her elastic Quirk, and now YOU can own a special-release edition of her <u>latest and greatest shoe line</u>.</p>\n<p>Want more? Keep your eyes open for regular merchandise updates from HEROSTASH.</p>\n<p>Related</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p>2:42 allmightanalyses: tell mineta he can stuff it</p>\n<p>2:42 just_a_blogger: ?</p>\n<p>2:42 allmightanalyses: sorry wrong group chat</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p><strong>Dekuforever<br></strong> <u>Deku forgets he’s on national TV, info dumps for five minutes straight</u></p>\n<p>\n<u>Deku jumps so high he gets stuck in a tree</u>\n</p>\n<p><u>Deku forgets that none of his Quirks are How To Keep Calm At Hero Con</u> (compilation)</p>\n<p>\n<u>Deku gets so excited over Froppy’s katsudon that he cries</u>\n</p>\n<p>\n<u>Deku flails hard enough to fall over</u>\n</p>\n<p><strong>XxryouxX<br></strong>watch Deku <u>burst into tears over the tiniest baby cosplayer</u></p>\n<p><strong>american-japanese-cookie<br></strong><u>See Deku tackle hug All Might!</u> 1) wish fulfillment, 2) smol son, tol dad</p>\n<p><strong>featherlightflurry<br></strong> <u>Deku shouts “Kacchan” on live TV and BOOKS IT in the opposite direction</u></p>\n<p><strong>juggernaut-astronaut<br></strong> <u>Deku awarded rank of Number One Hero, hugs announcer, dies of embarrassment</u></p>\n<p><strong>underage-adult<br></strong>I love Deku</p>\n<p><strong>CloudDreamer<br></strong>After dealing with Endeavor being number one, Deku is such a breath of fresh air</p>\n<p>\n<em> #the endeavor fandom was pretty toxic #back in the bad old days #i need to make “back in the bad old days” a tag #does anyone remember fandom before deku came along? #i do #*shudders*</em>\n</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p align=\"center\"> </p>\n<p><strong>AnalysisOverload<br></strong>If one more person @‘s me a NSFW picture of Deku I’m going to close my account forever. You Have Been Warned.</p>\n<p>\n<em>#no amount of pithy tagging can convey my conviction #personal</em>\n</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p>1:06 theherozone: so I want to go to herocon:x, but I don’t want to be publicly harassed for not having a Quirk. thoughts?</p>\n<p>1:06 theherozone: also I don’t know if I have the money to go so this might be a moot point, lol</p>\n<p>1:06 just_a_blogger: punch ‘em in the face if they try anything</p>\n<p>1:06 just_a_blogger: you’ll get kicked out, but what a way to go</p>\n<p>1:06 just_a_blogger: thoughts, mido? </p>\n<p>1:07 just_a_blogger: mido?</p>\n<p>1:07 theherozone: give him a moment, he’s typing</p>\n<p>1:08 allmightanalyses: herocon:x is specifically designed to be inclusive for everyone. Everyone’s talking about how it’s Quirk inclusive, but there’s not nearly enough coverage about how it’s meant to be Quirkless inclusive, too. It’s really bad, since if not everyone knows herocon:x is meant to avoid Quirk centrism then they’ll show prejudice anyway.</p>\n<p>1:08 allmightanalyses: anyways I’m ready to throw down </p>\n<p>1:08 just_a_blogger: no kidding</p>\n<p>1:08 theherozone: why haven’t I heard any of this before now???</p>\n<p>1:09 allmightanalyses: like I said</p>\n<p>1:09 allmightanalyses: bad news coverage</p>\n<p>1:09 theherozone: then geT PEOPLE SOME NEWS COVERAGE OF THIS</p>\n<p>1:09 allmightanalyses: I think I took that differently than you intended, but you’re right</p>\n<p align=\"center\"><em> allmightanalyses </em> has logged off</p>\n<p>1:09 theherozone: mido?</p>\n<p>1:10 just_a_blogger: you know how sometimes he makes really cryptic remarks and then just leaves? </p>\n<p>1:10 theherozone: yeah</p>\n<p>1:10 just_a_blogger: I hate when he does that</p>\n<p>1:11 theherozone: add it to the tally</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p>4:05 theherozone: @<em>allmightanalyses </em> @<em>just_a_blogger </em> </p>\n<p>4:05 theherozone: you would not beliEVE what Deku just did—</p>\n<p>4:05 theherozone: [attachment: <u>Deku says herocon:x is meant for all, not just Quirked</u>]</p>\n<p>4:06 theherozone: iS HIS EIGHTH QUIRK MIND READING????</p>\n<p>4:06 theherozone: FORGET ALL MIGHT DEKU’S MY FOREVER NUMBER ONE</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p>\n<strong>Subject: Paperwork</strong>\n</p>\n<p>\n<em>From: <a href=\"/cdn-cgi/l/email-protection\" class=\"__cf_email__\" data-cfemail=\"4924283a282220673b2827090308282e2c272a30672d2c223c\">[email protected]</a></em>\n</p>\n<p>\n<em>To: <a href=\"/cdn-cgi/l/email-protection\" class=\"__cf_email__\" data-cfemail=\"c1aca8a5aeb3a8b8a0efa8bbb4aab4818b80a0a6a4afa2b8efa5a4aab4\">[email protected]</a></em>\n</p>\n<p>Midoriya, you know that I love you, but if you make me put together another press conference with only two hours warning, we’ll be having words.</p>\n<p>In other news, I have quite a stack of papers that need your signature moving forward. In order of urgency, they are:</p>\n<p>1) Updated intel on the Kindwing human trafficking ring</p>\n<p>2) Three cases of fan mail that reviewers flagged as needing immediate hero intervention. Starsight identified the second letter as having some connection to Kindwing.</p>\n<p>3) Forms to sign for the Quirk Rights petition. Yaoyorozu-san says she’ll cover the wording for you if you want. I recommend it, because you do NOT have extra time right now, despite your eternal optimism on that topic.</p>\n<p>4) Forms arranging for other teams of heroes to cover your shifts during herocon:x</p>\n<p>5) The joint partnership forms with Jakku agency</p>\n<p>6) Property damage assessment forms from your fight with Landmine</p>\n<p>As always, don’t even think about breaking something again.</p>\n<p>Best, </p>\n<p>Masaki</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p align=\"center\">\n<em> <strong>Search results: “Deku”</strong> </em>\n</p>\n<p><b>Compilation: Deku and His Fans<br></b> <em>108,039,748 views</em></p>\n<p><b><br>SEVEN QUIRKS??? The insane up-and-coming hero: Deku<br></b> <em>78,980,024 views</em></p>\n<p><b><br>my love for Deku is infinite<br></b> <em>6,854 views</em></p>\n<p><b><br>Stain: “Deku and All Might are the only true heroes”<br></b> <em>303,793,210 views</em></p>\n<p><b><br>DEKU VS JAGGARTOOTH<br></b> <em>130,582 views</em></p>\n<p><b><br></b> <b>Current Events: Deku talks discrimination, compassion, legal reform<br></b> <em>6,341,782 views</em></p>\n<p><b><br>deku faceplants into trash heap lol<br></b> <em>81,993 views</em></p>\n<p><b><br>QuirkTheories: All Might’s Archenemy is Deku’s Father<br></b> <em>1,382,480 views</em></p>\n<p><b><br>Sports festival recap: smol child breaks every bone, comes back for more (edit: I cannOT believe this is baby deku)<br></b> <em>14,294,831 views</em></p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p align=\"center\"> </p>\n<p>\n<strong>Subject: Kindwing mission launching now</strong>\n</p>\n<p>\n<em>From: <a href=\"/cdn-cgi/l/email-protection\" class=\"__cf_email__\" data-cfemail=\"0e63676a617c67776f2067747b657b4e444f6f696b606d77206a6b657b\">[email protected]</a></em>\n</p>\n<p>\n<em>To: <a href=\"/cdn-cgi/l/email-protection\" class=\"__cf_email__\" data-cfemail=\"076e69666566296968657268474d4666606269647e2963626c72\">[email protected]</a>, <a href=\"/cdn-cgi/l/email-protection\" class=\"__cf_email__\" data-cfemail=\"fd939c969c879c8a9cd3959c8f88bdb7bc9c9a98939e84d399989688\">[email protected]</a>, <a href=\"/cdn-cgi/l/email-protection\" class=\"__cf_email__\" data-cfemail=\"046d63612a65766d7771444e456563616a677d2a60616f71\">[email protected]</a> and 43 more</em>\n</p>\n<p>It’s time. Briefing in one hour. Come dressed in your hero gear; we’ll be moving out immediately.</p>\n<p>Midoriya Izuku</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p align=\"center\"> </p>\n<p>\n<b>BREAKING: Deku in critical care after fate-defying fight<br></b>\n</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p align=\"center\"> </p>\n<p>9:51 theherozone: @<em>allmightanalyses </em> @<em>just_a_blogger </em></p>\n<p>9:51 theherozone: is anyone else watching the news?</p>\n<p>9:53 theherozone: it’s been like three years since Deku got hurt this bad</p>\n<p>9:53 theherozone: I’d honestly forgotten how scary it is</p>\n<p>9:54 just_a_blogger: sorry to interrupt but look at the news</p>\n<p>9:54 just_a_blogger: oh</p>\n<p>9:55 theherozone: the news says he’s being transferred to Mustafa hospital</p>\n<p>9:55 just_a_blogger: what channel are you on?</p>\n<p>9:55 theherozone: channel 42</p>\n<p>9:55 just_a_blogger: ok</p>\n<p>9:55 just_a_blogger: where’s mido? His shift should have been done an hour ago</p>\n<p>9:55 just_a_blogger: and he’s always on top of news like this</p>\n<p>9:55 theherozone: @<em>allmightanalyses </em></p>\n<p>9:57 theherozone: @<em>allmightanalyses </em></p>\n<p>9:58 just_a_blogger: @<em>allmightanalyses </em></p>\n<p>10:00 just_a_blogger: mido?</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p align=\"center\"> </p>\n<p>\n<b>351 days since Deku broke a bone</b>\n</p>\n<p>Froppy: [attached: <u><em>Deku in the ICU</em></u>]</p>\n<p align=\"center\"><em> Earbuds </em> is online</p>\n<p align=\"center\"><em> Hot&amp;Cold </em> is online</p>\n<p align=\"center\"><em> SpaceGirl </em> is online</p>\n<p align=\"center\"><em> Iida_Tenya </em> is online</p>\n<p align=\"center\"><em> TooTiredToCare </em> is online</p>\n<p>SpaceGirl: did the children Deku was protecting make it out okay?</p>\n<p>Earbuds: yes</p>\n<p>Earbuds: I’m with them now</p>\n<p>Earbuds: they’re bumped up but nothing serious</p>\n<p>Earbuds: mostly shaken</p>\n<p>Hot&amp;Cold: will Izuku make it out okay?</p>\n<p align=\"center\"><em> Electicitieeee </em> is online</p>\n<p align=\"center\"><em> Electiciteeee </em> changed the name of the chat to <b>0 days since Deku broke a bone</b></p>\n<p>SpaceGirl: not right now, Kaminari</p>\n<p>Electiciteeee: look I’m upset too</p>\n<p>SpaceGirl: sorry</p>\n<p>Hot&amp;Cold: will Izuku make it?</p>\n<p align=\"center\"><em> All Might </em> is online</p>\n<p>Earbuds: he was conscious when the paramedics took him away</p>\n<p>Froppy: he’s made it this far</p>\n<p>All Might: The doctors say he’ll make it</p>\n<p>TooTiredToCare: then tell him to not be an idiot like that again</p>\n<p>TooTiredToCare: and half of you have patrol right now. Stay focused so more people don’t get hurt.</p>\n<p align=\"center\"><em> TooTiredToCare </em> is offline</p>\n<p>SpaceGirl: I’m crying rn</p>\n<p>Hot&amp;Cold: tell him we’re thinking of him, Toshinori</p>\n<p align=\"center\"><em> InvisibleGirl </em> is online</p>\n<p>All Might: I will</p>\n<p>Froppy: he’ll make it, Toru</p>\n<p>InvisibleGirl: okay</p>\n<p>InvisibleGirl: good</p>\n<p align=\"center\"><em> Kacchan </em> is online</p>\n<p align=\"center\"><em> It’sSoManly </em> is online</p>\n<p align=\"center\"><em> QuothTheRaven </em> is online</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p align=\"center\"> </p>\n<p align=\"left\">1:27 allmightanalyses: im ok</p>\n<p>1:30 allmightanalyses: thnaks for wrrnyg</p>\n<p>1:32 allmightanalyses: wooring *</p>\n<p>1:33 allmightanalses: *wori</p>\n<p>1:34 allmightanalyses: *worry</p>\n<p>1:35 allmightanalyses: im so hi rn</p>\n<p>1:38 allmightanalyses: aizaas gonna kil me</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p align=\"center\"> </p>\n<p>\n<b>DekuTracker</b>\n</p>\n<p>6 months since Deku got badly hurt</p>\n<p>\n<b>DekuTracker</b>\n</p>\n<p>1 year since Deku got badly hurt</p>\n<p>\n<b>DekuTracker</b>\n</p>\n<p>2 years since Deku got badly hurt</p>\n<p>\n<b>DekuTracker</b>\n</p>\n<p>3 years since Deku got badly hurt</p>\n<p>\n<b>DekuTracker</b>\n</p>\n<p>Streak broken at 3 years, 2 months, and 15 days. </p>\n<p>1) Our thoughts and prayers are with you, @<em>OfficialDeku </em></p>\n<p>2) Can we take a moment to appreciate how Deku’s improved since UA? He kept himself safe for three whole years—impressive enough in the hero industry, but especially for the kid who casually shattered his hands in his first year sports festival.</p>\n<p>\n<em> #get better soon Deku #deku updates<br></em>\n</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p><em><br><br></em><b>DancingOnStardust<br></b>@everyone has anyone heard from AnalysisOverload in the past few days? </p>\n<p><b>GingerGenerator<br></b>No, but it’s been, like, five days. He’s gone on hiatus for a lot longer before.</p>\n<p><b>DancingOnStardust</b><br>Yeah, but he’d usually comes back off hiatus to talk about something as big as the Number One being severely injured.</p>\n<p><b>ButterflyForTopTen</b><br>Has anyone else noticed how AnalysisOverload’s hiatus’s almost always coincide with major Deku events?</p>\n<p><b>KingOfNothing<br></b>^^^Which supports my pet theory that AnalysisOverload is actually Deku’s private blog.</p>\n<p><b>AnalysisOverload<br></b>lol you’re right</p>\n<p><b>KingOfNothing<br></b>.................................I wasn’t prepared</p>\n<p><b>MallMight</b><br>wHAT</p>\n<p><b>galeforce</b><br>i’ve been following AnalysisOverload for years, and I don’t even LIKE Deku but I love AnalysisOverload what even is my life</p>\n<p><b>DancingOnStardust<br></b>As the person who started this thread, I have the dubious pleasure of getting a notification for every response to this post. PLEASE keep it appropriate, folks. If Deku puts up with stuff like this every day, he must be a saint.</p>\n<p><b>OfficialCellophane</b><br>Congratulations to @<em>Tailman </em> , who just won the absurdly specific bet that Deku would accidentally reveal his blog after more than 6 years but less than 6.5 years. Runner up is @<em>Official_Tentacole </em>, who bet that Deku would reveal himself after more than 5 years but less than 6 years. You lost by twenty three days, buddy.</p>\n<p><b>Leadballoon<br></b>At least we know Deku is well enough to be starting Internet Drama</p>\n<p><b>ClawingAtTheLine<br></b>AAAAAAAAAAAAAAAA</p>\n<p><b>red-riot-or-bust</b><br>we should have known tbh</p>\n<p><b>blood-and-blossoms</b><br>I can’t believe I’ve been mutuals with Deku for like two years. Asking as a concerned friend (wow, that sounds pretentious but dude I’ve seen you rant at two in the morning): are you doing okay?</p>\n<p><b>AnalysisOverload</b><br>Let this be a lesson to literally everyone: never answer blog posts while high on painkillers. Anyways, hi everyone! You can all stop worrying about me—I’m gonna have a pretty fancy brace for a while, but I’m doing fine. </p>\n<p>On an unrelated note, my ask box is closed for the next forever.</p>\n<p>\n<em> #while i have your attention go check out what uravity’s been up to #it’s really awesome #but I haven’t been able to rant about it because. you know. hospital #personal</em>\n</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p align=\"center\"> </p>\n<p>\n<b>OfficialCellophane</b>\n</p>\n<p>Deku just got out of the hospital, and we’re wandering the streets. Nobody notices him, since put this guy in a hoodie and somehow nobody pays attention to him? His whole body language changes and stuff, he looks like a whole different person. Not sure how he does that.</p>\n<p>ANYWAYS, Deku drags us (me and Uravity) into the nearest merch shop since they have a picture of Froppy in the front window. </p>\n<p>And then. We see it, covering the entire back wall. It’s a beautiful fan art of Deku, one arm in a sling, holding up his fist like All Might did in Kamino Ward, with get-well messages signed by about a million people. </p>\n<p>He loses it, then and there. To everyone who worked on that knowing that Deku would hit that merch shop sooner or later, congratulations. We currently have one (1) very, very emotional Number One on our hands, and he loves you all.</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p align=\"center\"> </p>\n<p><b>fanboyforever<br></b>TEN DAYS TILL HEROCON:X</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p align=\"center\"> </p>\n<p><b>AnalysisOverload<br></b> <em>Anonymous asked: Could I interest you in a Deku shipping fanfic? I know you generally don’t read that, but this one is quality. </em></p>\n<p>Due to personal reasons, No. </p>\n<p><b>sunfish<br></b>reading AnalysisOverload’s old content is hilarious in hindsight</p>\n<p>\n<em> #”no” #that’s it #just a dead “no” #not even tags from him on this one folks #he truly said “no” and then tried to erase it from all living memory #didn’t work but gotta give him credit for trying <br></em>\n</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p align=\"center\"> </p>\n<p>5:45 theherozone: mido there is literally nothing that would make me stop loving you</p>\n<p>5:45 just_a_blogger: ^^^^^^^^^^^^^^^^</p>\n<p>5:45 allmightanalyses: thanks &lt;3</p>\n<p>5:46 theherozone: that’s it?</p>\n<p>5:46 theherozone: “thanks”?</p>\n<p>5:46 theherozone: that came off wrong</p>\n<p>5:46 allmightanalyses: er?</p>\n<p>5:46 allmightanalyses: I profess my undying love of you two??</p>\n<p>5:46 theherozone: that’s not what I meant</p>\n<p>5:47 allmightanalyses: what did you mean?</p>\n<p>5:47 just_a_blogger: subtle, jazz. very subtle.</p>\n<p>5:47 allmightanalyses: okay I confess: I have no idea what you guys are talking about</p>\n<p>5:47 just_a_blogger: I’m just going to say it</p>\n<p>5:47 theherozone: don’t </p>\n<p>5:47 theherozone: you’ll scare him off</p>\n<p>5:47 allmightanalyses: scare me off what?</p>\n<p>5:47 just_a_blogger: scare you off telling us the secrets you’re keeping </p>\n<p>5:48 theherozone: ooooooooor you could just go and say it I guess don’t mind me</p>\n<p>5:48 just_a_blogger: it’s pretty obvious that you’re hiding something</p>\n<p>5:48 just_a_blogger: you keep weird hours and you’re gone for days at a time and you make really weird references you refuse to explain</p>\n<p>5:48 just_a_blogger: plus there was the time a week ago when you told us you were okay despite CLEARLY not being okay</p>\n<p>5:48 just_a_blogger: like, we respect your privacy but is everything okay? You good?</p>\n<p>5:49 theherozone: mido you’re not responding that’s not encouraging</p>\n<p>5:49 theherozone: I told you you’d scare him off by asking straight up</p>\n<p>5:49 allmightanalyses: see I don’t want to tell you</p>\n<p>5:49 allmightanalyses: but the last week has got me thinking that I need to</p>\n<p>5:49 theherozone: cryptic as always, continue </p>\n<p>5:50 allmightanalyses: so we’ve known each other since middle school, right?</p>\n<p>5:50 just_a_blogger: right...?</p>\n<p>5:50 allmightanalyses: I kind of failed to mention where I went to high school</p>\n<p>5:50 just_a_blogger: less “failed” and more “got so awkward about it that we stopped asking you about school” but continue</p>\n<p>5:50 allmightanalyses: UA</p>\n<p>5:50 theherozone: nice!</p>\n<p>5:50 just_a_blogger: why hide that??</p>\n<p>5:51 allmightanalyses: hero track</p>\n<p>5:51 theherozone: oh</p>\n<p>5:51 theherozone: UA hero track students have a 87% chance of making it as a pro hero </p>\n<p>5:51 theherozone: so you’re saying...</p>\n<p>5:51 allmightanalyses: well I was working on saying, I’m not sure I was doing a great job</p>\n<p>5:52 theherozone: squid you aren’t saying anything it’s a little scary</p>\n<p>5:52 theherozone: give some moral support here</p>\n<p>5:52 just_a_blogger: I figured out where mido was headed with this</p>\n<p>5:52 theherozone: and???</p>\n<p>5:53 theherozone: WAIT mido you said you were high a week ago. I thought you meant high on drugs but you meant high on drugs-drugs</p>\n<p>5:53 theherozone: medicine-drugs</p>\n<p>5:53 theherozone: were you hurt? Are you okay?</p>\n<p>5:53 allmightanalyses: basically</p>\n<p>5:53 just_a_blogger: “basically,” he says </p>\n<p>5:53 just_a_blogger: Midoriya you liar you made the news for how bad it was</p>\n<p>5:54 just_a_blogger: and I’m torn between wanting to punch you and knowing how absolutely bad an idea that is</p>\n<p>5:54 just_a_blogger: Deku</p>\n<p>5:54 theherozone: huh</p>\n<p>5:55 just_a_blogger: THIS COUNTS AS THINGS TO TELL US OKAY?</p>\n<p>5:55 allmightanalyses: in fairness I’m doing my best to tell you right now</p>\n<p>5:55 just_a_blogger: WE’VE KNOWN EACH OTHER NINE YEARS YOU TELL US THESE THINGS BEFORE NOW</p>\n<p>5:55 allmightanalyses: valid but it’s really hard making and keeping friends as the number one</p>\n<p>5:55 allmightanalyses: all might agrees with me on this one incidentally</p>\n<p>5:55 just_a_blogger: stop throwing stuff like that out and help me with jazz</p>\n<p>5:55 theherozone: I’m okay</p>\n<p>5:55 allmightanalyses: that was a worse lie than when I said it</p>\n<p>5:56 theherozone: I just...I talked about you so much and you were so uncomfortable and I want to hide under my blankets and never come out</p>\n<p>5:56 theherozone: also you’re deku and I’m still trying to process that</p>\n<p>5:56 allmightanalyses: I’M still trying to process that. I was in the top ten right out of high school, do you have any idea how surreal and frightening that is?</p>\n<p>5:57 allmightanalyses: I was called the next all might since my second year at UA, and, like, I KNOW all might. I can’t be anything like as great a man as he is.</p>\n<p>5:57 allmightanalyses: anyways that was an info dump that wasn’t really helpful right now I’m sorry</p>\n<p>5:57 theherozone: no that helps</p>\n<p>5:57 theherozone: like that’s definitely what mido would say if he did anything as ridiculous as become the number one</p>\n<p>5:58 just_a_blogger: Midoriya I’m looking at footage of the end of your fight with Kindwing and 1) you’re terrifying and 2) that’s a really complex fracture in your arm. Now that you’re actually being honest, are you okay?</p>\n<p>5:58 allmightanalyses: using “mido” is fine</p>\n<p>5:58 just_a_blogger: not yet it’s not</p>\n<p>5:58 allmightanalyses: I actually can’t legally talk about what happened</p>\n<p>5:59 allmightanalyses: the upshot is the government employs some people with top-secret Quirks and some of those people helped my injury</p>\n<p>5:59 allmightanalyses: it’ll be okay</p>\n<p>6:00 just_a_blogger: why now?</p>\n<p>6:00 just_a_blogger: why tell us now, I mean</p>\n<p>6:00 allmightanalyses: if things had gone different I could have died on the Kindwing mission</p>\n<p>6:00 allmightanalyses: and there’s always that risk moving forward</p>\n<p>6:00 allmightanalyses: I don’t know if we’ll be able to go on like normal, and frankly that terrifies me, but you guys shouldn’t have to go through me not answering my messages one day and then me never coming back</p>\n<p>6:00 theherozone: okay it’s really comforting to know that I’m not the only one who’s scared about how to move forward from here</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p align=\"center\"> </p>\n<p>8:53 theherozone: @ <em> allmightanalyses </em> so could you get me into herocon:x?</p>\n<p align=\"center\"><em> allmightanalyses </em>is online</p>\n<p>8:55 allmightanalyses: sure</p>\n<p>8:55 allmightanalyses: I could bring you as my plus one but that would raise such a media fuss that it’d be easier to just buy you a ticket</p>\n<p>8:55 allmightanalyses: don’t worry about the money. Even with donating most of it to charity, I have more than enough to live comfortably. </p>\n<p>8:57 theherozone: actually</p>\n<p>8:57 theherozone: question</p>\n<p>8:57 allmightanalyses: fire away</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p align=\"center\"> </p>\n<p><b>AnalysisOverload<br></b>Current mood: HERO CON HERO CON HERO CON HERO CON</p>\n<p>\n<b>AnalysisOverload</b>\n</p>\n<p>Okay, let’s talk HeroCon. </p>\n<p>(I had this queued up before everything went down, so no, I’m not going to deal with the five billion questions everyone has right now. We’re saving that for when I’m a little less drugged up on painkillers. Love you all.)</p>\n<p>Look around, and you’ll see a lot of discrimination—against people whose Quirk is debilitating, against people whose Quirks scare us, against people who have trouble controlling their Quirk, against people who don’t have a Quirk at all. It’s easy to feel alone in a sea of discrimination.</p>\n<p>Enter HeroCon:X. </p>\n<p>In this keystone conference, people are celebrated, not discriminated against. There will be...</p>\n<p>\n<u> Read more</u>\n</p>\n<p><b>ComeFightMidnight<br></b>Man, this hits differently knowing it’s Deku speaking. I mean, I’ve always loved and respected AnalysisOverload, but knowing that the Number One knows I’m struggling because of my Quirk is EVERYTHING.</p>\n<p><b>robins-nest <br></b>I get that this is Deku speaking, and sunshine and holding hands is his whole aesthetic, but did he really have to go so hammy and trite?</p>\n<p><b>DekuDance<br></b><em>@robins-nest</em> Deku is not “trite” he’s sincere come fight me</p>\n<p><b>Downwiththepatriarchy<br></b>Not once does AnalysisOverload use the term “villainous Quirk.” Critics, take notes.</p>\n<p><b>Ocean-and-sage</b><br>“In the end, while Quirks are great, we are more than our Quirks; we are ourselves, and that’s worth celebrating” THAT’S OUR NUMBER ONE</p>\n<p>\n<em> #i’m going to frame this quote it’s so good </em>\n</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p align=\"center\"> </p>\n<p><b>fanboyforever</b><br>FOUR DAYS TILL HEROCON:X</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p>1:29 allmightanalyses: what the hell</p>\n<p>1:30 just_a_blogger: LANGUAGE</p>\n<p>1:30 theherozone: dude</p>\n<p>1:30 allmightanalyses: what the hell</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p align=\"center\"> </p>\n<p>\n<b>Private message</b>\n</p>\n<p>unknown number: hey add me to the group chat</p>\n<p>3385025963: who is this?</p>\n<p>unknown number: mido</p>\n<p>unknown number: kacchan stole my phone and he’s looking at the group chat</p>\n<p>3385025963: your life is weird, mido</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p align=\"center\"><em> just_a_blogger </em> added <em> mido </em> to the group chat</p>\n<p align=\"center\"><em> mido </em> changed their name to <em> give_my_phone_back_kacchan </em></p>\n<p>1:32 give_my_phone_back_kacchan: see the username</p>\n<p>1:32 give_my_phone_back_kacchan: and no language. That’s a chat rule, so deal with it</p>\n<p>1:32 theherozone: this makes way more and way less sense than mido swearing</p>\n<p>1:32 allmightanalyses: what the hell</p>\n<p>1:32 allmightanalyses: you’re in a group chat with civilians? </p>\n<p>1:33 give_my_phone_back_kacchan: LANGUAGE</p>\n<p>1:33 give_my_phone_back_kacchan: and yes</p>\n<p>1:33 give_my_phone_back_kacchan: give my phone back</p>\n<p>1:33 allmightanalyses: not until you take back what you said about me, stupid nerd</p>\n<p>1:33 give_my_phone_back_kacchan: no</p>\n<p>1:34 give_my_phone_back_kacchan: and there’s one important detail you missed</p>\n<p>1:34 give_my_phone_back_kacchan: whose phone am I texting from if you have my phone?</p>\n<p>1:34 theherozone: this is the funniest thing I’ve seen all year</p>\n<p>1:35 allmightanalyses: GIVE MY PHONE BACK ******* DEKU</p>\n<p>1:35 give_my_phone_back_kacchan: no</p>\n<p>1:35 allmightanalyses: then I’ll come and get it</p>\n<p>1:39 theherozone: ...are they gone?</p>\n<p>1:39 just_a_blogger: looks like</p>\n<p>1:40 it’s one thing to know that Deku calls Dynamight “Kacchan” and a whole nother thing to see mido say kacchan wow</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p align=\"center\"> </p>\n<p><b>DekuTracker<br></b>Dynamight appears to be chasing Deku across the city. We have no idea what’s going on, but Dynamight is screaming “DIE DIE DIE” so it’s probably not that serious</p>\n<p>[Video could not load. <u>Check your connection</u>]</p>\n<p>\n<em>#deku updates #dynamight<br></em>\n</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p>1:53 allmightanalyses: Deku get over here the hero commission is calling you</p>\n<p>1:53 give_my_phone_back_kacchan: same to you</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p>2:18 theherozone: I frankly didn’t know mido could move that fast up a building</p>\n<p>2:18 theherozone: especially for something as non-life-or-death as chasing Dynamight</p>\n<p align=\"center\"><em> give_my_phone_back_kacchan </em> is online</p>\n<p align=\"center\"><em> give_my_phone_back_kacchan </em> changed their name to <em> Dynamight</em></p>\n<p>2:19 Dynamight: We need to talk</p>\n<p>2:19 Dynamight: What you just saw between Deku and me about the Hero Commission? That’s highly classified information. </p>\n<p>2:19 Dynamight: Frankly, it was a mistake to use this platform to communicate that information </p>\n<p>2:20 Dynamight: I need both of you to understand that if you tell anyone about that conversation you’ll have government agents on your doorstep faster than you can count to three. Understood?</p>\n<p>2:20 theherozone: understood</p>\n<p>2:20 just_a_blogger: understood </p>\n<p>2:20 Dynamight: Great</p>\n<p align=\"center\"><em> Dynamight</em> is offline</p>\n<p>2:22 theherozone: wait @<em>Dynamight</em></p>\n<p align=\"center\"><em> Dynamight </em>is online</p>\n<p>2:22 Dynamight: I’m busy</p>\n<p>2:22 theherozone: what’s mido doing?</p>\n<p>2:22 Dynamight: That’s so classified that your question isn’t even cute</p>\n<p>2:23 Dynamight: He’ll be busy for the next several days</p>\n<p>2:24 theherozone: what about herocon? It’s in three days</p>\n<p>2:24 Dynamight: Believe it or not, some things are more important than a convention. He’ll finish when he finishes.</p>\n<p>2:24 Dynamight: Don’t @ me again.</p>\n<p align=\"center\"><em> Dynamight </em> is offline</p>\n<p>2:25 just_a_blogger: what possessed you to @ him?</p>\n<p>2:25 theherozone: okay look</p>\n<p>2:25 theherozone: 1) that was terrifying I’m never doing that again</p>\n<p>2:25 theherozone: 2) ever since I learned mido is deku, I’ve been really anxious whenever it looks like deku gets a big assignment</p>\n<p>2:26 theherozone: like, deku is the unbreakable number one and all that, but I know mido and he’s not infallible by a long shot</p>\n<p>2:26 theherozone: and that’s terrifying</p>\n<p>2:26 just_a_blogger: I feel that in my bones</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p align=\"center\"> </p>\n<p><b>fanboyforever<br></b>TWO DAYS TO HEROCON:X</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p><b>HeroesAndVillains<br></b>Vote who you think Deku will cosplay as in HeroConX!</p>\n<p><b>awaken-the-stars<br></b>NEJIRE-CHAN IS NOT ON THIS LIST</p>\n<p><b>Girl-fury<br></b>NEITHER IS JUGGERNAUT</p>\n<p><b>becauseofdeku<br></b>Calm down, everyone. Deku goes out of his way to cosplay heroes that nobody expects. Remember the time he did Mothwing when she was under media fire? Or the time he did Hatchet when literally nobody knew who Hatchet was? Or the time he did Windsnare to support her statements on government reform? Or the time he did Nighteye to honor him? The upshot is, you aren’t going to guess correctly on a clickbait survey that’s more a popularity contest than anything else. </p>\n<p>\n<em>#do I have to say this every time?</em>\n</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p><b>socks-and-blocks<br></b>AnalysisOverload only posted once since accidentally outing himself as Deku. Is he gone for good? I hope not, his updates were the best part of my day.</p>\n<p><b>GravitationalGaps<br></b>It’s been three days, and he only just got out of the hospital. Give him some time, and I think he’ll be online more frequently.</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p align=\"center\"> </p>\n<p><b>fanboyforever<br></b>TWENTY FOUR HOURS TO HEROCON:X</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p>6:02 theherozone: @<em>allmightanalyses </em> ignore this if you’re busy, but will you be able to make it to herocon:x? </p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p><b>fanboyforever</b><br>HEROCON:X IS OPEN!!!!</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p><strong>Sunburst-Starfish<br></strong>Water bottle, check</p>\n<p>Energy bars, check</p>\n<p>Comfortable shoes, check</p>\n<p>Cosplay, check</p>\n<p>Sewing kit for when something in the cosplay inevitably falls apart, check</p>\n<p>All the cash I could scrape together over the past five months, check</p>\n<p>HeroCon:X, here I come!</p>\n<p>\n<em> #I’m so ready </em>\n</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p><b>hoppingthroughlife<br></b>Ways to freak out an entire fandom: walk into hero con with green hair. Sigh. No, I’m not Deku, folks. Sorry to disappoint.</p>\n<p>\n<em> #frog quirks run in my family #that’s it. that’s all. not deku.<br><br></em>\n</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p>\n<b>Subject: Police liaison request</b>\n</p>\n<p>\n<em>From: <a href=\"/cdn-cgi/l/email-protection\" class=\"__cf_email__\" data-cfemail=\"2a47434e455843534b0443505f415f6a606b4b4d4f444953044e4f415f\">[email protected]</a></em>\n</p>\n<p>\n<em>To: <a href=\"/cdn-cgi/l/email-protection\" class=\"__cf_email__\" data-cfemail=\"d5bcbeb0b1b4fbbdb4bbb4beba959f94b4b2b0bbb6acfbb1b0bea0\">[email protected]</a></em>\n</p>\n<p>Hello, Ikeda-san,</p>\n<p>Could you be my main point of contact with the Mustafa police for the Kindwing investigation? If so, I need the identifying information for all operatives currently in custody; I know it can feel like drudge work, but this is critical to an ongoing investigation and I know I can trust you to do this well. </p>\n<p>Sincerely,</p>\n<p>Midoriya Izuku</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p><b>fanboyforever<br></b>DAY TWO OF HEROCON</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p><b>finnish-fanboy<br></b>Has anyone spotted Deku at HeroCon:X yet?</p>\n<p><b>DekuTracker<br></b>As far as I can tell, nothing yet! He usually gets through most of a con before revealing himself, though, so no surprises there.</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p><b>fanboyforever<br></b>LAST DAY OF HEROCON</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p>10:13 allmightanalyses: @<em>theherozone</em> I’m finished. How fast can you be ready, Jazz?</p>\n<p align=\"center\"><em> theherozone </em> is online</p>\n<p align=\"center\"><em> just_a_blogger </em> is online </p>\n<p>10:17 theherozone: there’s no cosplay I have to put on, so, now</p>\n<p>10:18 just_a_blogger: best of luck to you two. Knock ‘em out</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p align=\"center\"> </p>\n<p align=\"center\">\n<b>BREAKING: Remaining Kindwing Executives Arrested<br></b>\n</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p><b>Xenobug<br></b>I’m probably risking my job to say this, but Deku just checked into HeroCon:X, and he has a plus one with him.</p>\n<p><b>Xenobug<br></b>lol yup I’m fired</p>\n<p>\n<em> #called it</em>\n</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p align=\"center\"> </p>\n<p align=\"left\">“—got it. ‘K. The camera’s on.”</p>\n<p>“Are you sure you want to be recording this, Jazz?”</p>\n<p>“We’re supposed to look normal, right? There’s nothing more inconspicuous than video recording everything, and I want to footage of how everyone reacts.”</p>\n<p>“Good point. Don’t forget to call me Mido.”</p>\n<p>“That’s really easy when you look so different. You’re pretty plain-looking when you aren’t projecting ‘I’m The Number One Hero,’ you know?”</p>\n<p>“That’s the idea, here. Let’s go.”</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p><b>OfficialDeku<br></b>My plan for HeroCon:X is a little different than past years. Keep an eye out!</p>\n<p>\n<em> #HeroCon #HeroCon:X<br></em>\n</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p>“That’ll come to 6,050 yen.”</p>\n<p>“Okay. Here’s cash. Hey, I like your Quirk! Can you hear better, or are your ears just large?”</p>\n<p>“My hearing’s a bit better than average, but it’s pretty useful. What are your Quirks?”</p>\n<p>“We’re both Quirkless.”</p>\n<p>“Ah. Thank you for your purchase. Next!”</p>\n<p>\n<em>[Sounds of chatter and footsteps]</em>\n</p>\n<p>“Well, that could have gone better.”</p>\n<p>“We’re specifically doing this because people don’t like the Quirkless, Jazz.”</p>\n<p>“Easy for you to say, oh six-Quirked one.”</p>\n<p>“Jazz. Jazz, look at me.” <em>[pause]</em> “I was Quirkless until I was fourteen.”</p>\n<p>“I—oh.” <em>[silence]</em> “Oh. That’s why you care so much about us.”</p>\n<p>“I know Squid doesn’t like us talking about negative stuff that happens in real life, so I get why you haven’t brought it up, but I know about the bullying, the abuse, the” <em>[pause]</em> “the suicide baiting. You don’t have to hide it all away. I get it, Jazz.”</p>\n<p>\n<em>[END RECORDING? YES/NO]</em>\n</p>\n<p>\n<em>[YES]</em>\n</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p><b>ChampionOfHope<br></b>[Could not load image]</p>\n<p>[Could not load image]</p>\n<p>[Could not load image]</p>\n<p>[Could not load image]</p>\n<p>@<em>spadays </em> proposed to @<em>ashira’s-ideas </em> at HeroCon:X! She said yes!!!</p>\n<p>I’m so happy for both of them!</p>\n<p>\n<em> #I’ve been waiting so long you don’t even KNOW #heroconx</em>\n</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p align=\"center\"> </p>\n<p><b>jaguar-park<br></b>The Quirk positivity at hercon:x is so. much. </p>\n<p>\n<em> #this one quirkless kid came up to me and asked me how my quirk works and just got excited instead of bailing #when I told him about face copy #someone else said my quirk must be great for cosplay #idea: can we have it like this always? </em>\n</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p>“Nice to meet you! That’s a really cool Deku costume!” </p>\n<p>“Jazz, stop it.”</p>\n<p>“Can I get a picture? It’s almost like standing next to Deku himself!”</p>\n<p>“<em> Jazz </em> .”</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p><b>AnalysisOverload<br></b>So this account isn’t dead. </p>\n<p>There’s a lot of questions going around, and I haven’t answered any of them, mostly since hospitalization and then an urgent case took all my attention. So, FAQs:</p>\n<p>1) Yes, this is really Deku. I was high on painkillers, but not high enough to think I was the wrong person. Although personally, I think that would be super funny.</p>\n<p>2) My arm will be okay.</p>\n<p>3) This account will keep running, but PLEASE direct job-related questions to my alternate account, <em>@OfficialDeku</em>. This account is for analyzing and fanboying, not for trying to be anything official.</p>\n<p>4) I’m not posting personal updates on here anymore. I do have an alternate-alternate blog I’ll be posting to. Let the conspiracy theories of which blog is mine begin.</p>\n<p>5) Yes, I’m attending HeroCon:X. Yes, I have a panel. Please listen to it. I’ll be talking about some stuff that’s really important to me.</p>\n<p>Love you all!</p>\n<p>\n<em> #personal #HeroCon:X #HeroCon<br></em>\n</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p>3:47 Dynamight: @<em> allmightanalyses </em> what the ******************** are you playing at this time?</p>\n<p align=\"center\"><em> just_a_blogger </em> is online</p>\n<p>3:48 just_a_blogger: why are you asking THIS group chat</p>\n<p>3:48 Dynamight: my reasons are twofold, specifically that DMs contain just him and thus less chance of a fast answer, and that I want to mess with him in front of his nerd friends after pulling this on me.</p>\n<p>3:48 just_a_blogger: well if it’s to mess with him I’m on board. I’ve got no context for what he did, but mido and jazz are going to herocon:x as Quirkless people and seeing how everyone reacts</p>\n<p>3:48 Dynamight: For once, a good idea.</p>\n<p>3:49 Dynamight: I’m still going to kill him for dressing up as a hero otaku and then asking for my autograph.</p>\n<p>3:49 Dynamight: @<em> allmightanalyses </em> pick up your phone stupid ******** nerd</p>\n<p>3:49 just_a_blogger: ok I have to ask: we’ve got a bot that filters intense swears, do you keep running into it and keep using them since you don’t care, or are you deliberately typing out asterisks every time you want to make a point</p>\n<p>3:49 Dynamight: HA I like you</p>\n<p>3:49 Dynamight: also wouldn’t you ********* to **************** know ********* </p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p>“How are you even able to carry that much merch at once? One of your arms is broken!”</p>\n<p>“Well, my Quirks are coming in handy, I admit.”</p>\n<p>“It’s pretty obvious you need super strength to carry that all with one hand. You’re going to blow our cover, Mido.”</p>\n<p>“But what a way to go out, and—look at that booth!”</p>\n<p>“We are not going to another booth until you find somewhere to put that all down.”</p>\n<p>“I need Small Might statues like I need air, Jazz.”</p>\n<p>“Well, hold your breath. We’re going.”</p>\n<p>“You know, I figured you would be more intimidated by me.”</p>\n<p>“I am, but if I remember you’re just a huge hero nerd, I can handle you the same way I handle Squid.”</p>\n<p>“Fair.”</p>\n<p>“…Jazz, they have <em>Eraserhead</em> merch, just one more stop I <em>promise</em>—“</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p><b>quiet-april<br></b>#HeardAtHeroCon: “I don’t care which hero you are, just put your hair on already!”</p>\n<p><strong>quiet-april</strong><br>#HeardAtHeroCon: “If you don’t change the gravity of your backpack now, you’ll regret it.”</p>\n<p><b>quiet-april<br></b>#HeardAtHeroCon: “I dare you to do a handstand on the ceiling.”</p>\n<p><b>quiet-april</b><br>#HeardAtHeroCon: “Quirkless junk don’t belong at Deku’s panel!” Um, dude, inclusivity is the point of HeroCon:X. You kinda missed the boat there.</p>\n<p><strong>quiet-april</strong><br>To everyone asking, the Quirkless kid is alright. There’s two of them, actually, and they seemed to think the jerk had said the funniest thing in the world. Anyways, the line for Deku’s panel is starting to move, got to go. </p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p><strong>AnalysisOverload<br></strong>Okay guys, buckle down. Today we’re talking about all the flaws in the heroics system.</p>\n<p>I’ve made an itemized list. It’s 33 points long. If that’s too much for you, the tl:dr is as following: heroics has turned into a popularity contest and a political game instead of a system where heroes focus on helping people.</p>\n<p>Here goes.</p>\n<p>\n<u>Read more</u>\n</p>\n<p><strong>FlowersInBloom<br></strong>Hey, are we gonna talk about the fact that this is the <em>Number One Hero</em> speaking about how the hero system is messed up?</p>\n<p>I feel like we need to talk about it. </p>\n<p><strong>SparksFly<br></strong>Oh. I.</p>\n<p>I remember reading this and agreeing 100% but. I hadn’t put together that it was. You know. Deku.</p>\n<p><em>Oh</em>.</p>\n<p>Give me a minute—</p>\n<p><strong>OfficialUravity<br></strong>Sometimes social change happens when careful planning culminates. Sometimes it happens when your friend gets high on painkillers and outs his secret “hey heroes are great but let’s pause and study how we can really best help people” blog. When you’re friends with Deku, you get used to a dizzying mix of both.</p>\n<p>Anyways, hey, yes! This is a big thing that’s going on! The graduated class of 3A has been talking about it for years and only got away with our licenses because we were such big name heroes. Didn’t stop the censors from deleting the content, though. Are we trying to stop the whole system? It’s nice but unrealistic, and before you start claiming that we want to keep profiting from the industry, please remember that heroics is the <em>only</em> current system for first-responders, crisis management, and disaster relief. Even if villains disappear overnight (<em>also</em> nice but unrealistic, might I point you to some of the essays <em>@AnalysisOverload</em>’s been posting for years), we can’t pull heroics without good infrastructure that’s ready to go.</p>\n<p>This is probably a good time to mention said infrastructure! And no, it’s not a wild shot in the dark or a risky plan without payoff. We’re starting to see real traction in the legal system, and related censorship is going down, too. Here’s several good places to start:</p>\n<p>https://TimeForChange.org/QuirkActivism</p>\n<p>https://GovTracker.Japan.com/quirk-rights/all</p>\n<p>https://ShiningChildren.org/infrastructure-initiatives</p>\n<p>https://MutantsInMemoriam.ja.gov</p>\n<p>tldr: to all the people saying “3A took down the League and All for One before the graduated, what are they doing with their lives now?” This. We’re doing this. Get on board or get out of the way, because things are about to move very, very fast.</p>\n<p>\n<em>#Izuku reblog this after your HeroConX panel ok? #speaking of which #the biggest person driving a Quirk-Quirkless-inclusive HeroCon? Deku #100% Deku</em>\n</p>\n<p>[post queued to publish at 19:00 QJT]</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p align=\"center\"> </p>\n<p><b>OfficialDeku<br></b>Someone’s already set out a box of tissues by the microphone at my panel. I feel called out.</p>\n<p>\n<em>#I mean they’re right #but still #HeroCon #HeroCon:X</em>\n</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p>“Okay, this was a stupid idea.”</p>\n<p>“You’re nervous.”</p>\n<p>“I’m going to get pointed out to literally five thousand people at once, of course I’m nervous, Mido! It’s easy for you to say—you’re used to everyone watching you.”</p>\n<p>“I believe in you.”</p>\n<p>“That is the sappiest thing I’ve heard from you, and I’ve listened to all your interviews.”</p>\n<p>“Okay, but it’s still true. Is your camera on?”</p>\n<p>“It’s been on this whole time. I kept it in my pocket to get audio.”</p>\n<p>“You’d better pull it out. Ready?”</p>\n<p>\n<em>[rustling and banging, then a flood of light]</em>\n</p>\n<p>“Yeah, uh. Absolutely not.”</p>\n<p> </p>\n<p align=\"center\">. . .</p>\n<p> </p>\n<p>Shinsou had accused him of being overly dramatic. And sure, it sent the whole crowd crazy whenever he came to his panel in cosplay, particularly since several dozen of them had interacted with him throughout the con. </p>\n<p>But Izuku knew it was important for his fans to get to interact with him, not as some untouchable Number One, but as a equal fan. And today—today was going to be different.</p>\n<p>Today, his cosplay as a Quirkless person was going to draw many of the questions that were always left on the cutting room floor of any interview he did.</p>\n<p>Today, there was going to be a reckoning—a fierce one, a kind one, a necessary one.</p>\n<p>There was a roar, giant to the point of vast, as he stepped onstage. The lights went blinding for endless seconds, sweeping across the stage, before fading back. </p>\n<p>He had requested, from his very first hero con, that the lights never be bright enough to make it so he couldn’t see everyone in the audience. The people were, after all, why he was there.</p>\n<p>The roar slowly died off, tinged with confusion and chatter. Izuku knew full well why. In all his years, he had never cosplayed as anyone other than a hero.</p>\n<p>“Hi, everyone,” he called out, clicking on the handheld microphone. “I guess you’re wondering why I cosplayed as a Quirkless person.”</p>\n<p>And the roar was back.</p>\n<p>Izuku settled more firmly in his skin and waited for it to quiet off. </p>\n<p>“As I’m sure many of you know,” he said, projecting his voice to the very back corners, “this hero con is about acceptance and inclusion. I know from personal experience that one of the hardest things to do is include people who aren’t like us. Let me tell you something the media companies wish I wouldn’t share.”</p>\n<p>A buzz. Izuku had framed his words like a scandal, and everyone wanted to be the first to hear it.</p>\n<p>Deep breath in. Deep breath out. Make eye contact with as many people as possible. </p>\n<p>“My first year on the job, there was something I brought up in every interview I did. In every case, it never made it to the final broadcast. I could have done this on live TV, but that always ran the risk of the interviewer dismissing the subject. I’ve been waiting for a time to talk about this where I have full control of the conversation. Are you ready?”</p>\n<p>An affirmative shout. </p>\n<p>“I was Quirkless until right before UA,” he said, and the room went still. “I know what it’s like to be a societal reject, and I’m making sure that we don’t make people feel unwanted going forward.” </p>\n<p>Now, to break the script completely.</p>\n<p>“Can I talk for a moment?” he asked, dropping his voice into something quieter, something softer, letting the microphone do all the hard work of projecting his voice. “Can I talk as Midoriya Izuku instead of Deku?”</p>\n<p>A hush, stronger than the roar, settled in.</p>\n<p>“It was really hard, growing up Quirkless,” he said. “People don’t believe in you very much, not when you don’t have a superpower.” He took a breath. It shook only a little. “I knew I wanted to be a hero from really early on. At first, I just wanted to be like All Might. Don’t we all?” A laugh, quickly cut off, circled the room.</p>\n<p>“But then,” Izuku said, “I found I wanted to be a hero because I saw that there were a lot of people hurting, like me. Some of them were Quirkless. Some of them weren’t. Truth is, you can have any sort of Quirk and still be hurting. I wanted to help all the hurting people, and so I said I’d become a hero. That is my mission in life, to help people. I wanted to come here today to say that helping people is so important, and you don’t have to be a hero to do it. There’s—there’s this myth, that you can only do cool, important stuff if you’re a hero. That’s not true. Some of the best people I know aren’t heroes to anyone except for me.”</p>\n<p>He was tearing up, now. He had enough practice leashing it that he could have suppressed it, but he didn’t. People needed to see that this was important to him. </p>\n<p>“I brought one of my best friends, Jazz, with me today. She’s amazing. She’s wise and she’s brave and she’s willing to face the world with kindness. She’s also Quirkless.”</p>\n<p>Chatter, now. People started twisting in their chairs, looking for Jazz. Izuku could barely see her from here, hands hiding her face, shoulders shaking.</p>\n<p>“I want people to know that your Quirk doesn’t determine your worth. Not even your actions determine your worth. You are all worth so, so much.” Tears rolled down his face, quiet and determined. “Every last one of you is worth the world. That’s what I came here to say. Thank you.”</p>\n<p>He met Jazz’s eyes above the crowd.</p>\n<p>And her smile was like daylight.</p>"
}