{
  "id": "22543702",
  "url": "https://archiveofourown.org/works/22543702?view_full_work=true",
  "author": [
    "angst_goblin"
  ],
  "title": "Mockingbird",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
  ],
  "relationships": [
    "Aizawa Shouta | Eraserhead & Midoriya Izuku",
    "Midoriya Izuku & Yagi Toshinori | All Might",
    "Aizawa Shouta | Eraserhead/Yamada Hizashi | Present Mic",
    "Bakugou Katsuki & Midoriya Izuku",
    "Aizawa Shouta | Eraserhead & Class 1-A",
    "Class 1-A & Midoriya Izuku"
  ],
  "characters": [
    "Aizawa Shouta | Eraserhead",
    "Midoriya Izuku",
    "Yagi Toshinori | All Might",
    "Midoriya Inko",
    "Bakugou Katsuki",
    "Todoroki Shouto",
    "Shinsou Hitoshi",
    "Yamada Hizashi | Present Mic"
  ],
  "additional_tags": [
    "Parental Aizawa Shouta | Eraserhead",
    "Parental Yagi Toshinori | All Might",
    "Midoriya Izuku Needs A Hug",
    "Age Regression/De-Aging",
    "Protective Bakugou Katsuki",
    "Protective Aizawa Shouta | Eraserhead",
    "Good Parent Midoriya Inko",
    "Abusive Midoriya Hisashi",
    "Fluff",
    "Hurt/Comfort",
    "Class 1-A Shenanigans (My Hero Academia)",
    "Class 1-A as Family (My Hero Academia)",
    "Shinsou Hitoshi is in Class 1-A",
    "Protective Class 1-A (My Hero Academia)",
    "Aizawa Shouta | Eraserhead Adopts Shinsou Hitoshi",
    "Yagi Toshinori | All Might Adopts Midoriya Izuku",
    "Worried Midoriya Inko",
    "Bakugou Katsuki is a Good Friend",
    "Midoriya Hisashi's Bad Parenting",
    "Midoriya Hisashi Being an Asshole",
    "Mentor Aizawa Shouta | Eraserhead",
    "Kid Midoriya Izuku",
    "Bakugou Katsuki Has PTSD - Post-Traumatic Stress Disorder",
    "Bakugou Katsuki is Bad at Feelings"
  ],
  "language": "English",
  "series": "Part 1 of Dreamers Never Die",
  "published": "2020-02-16",
  "completed": "2020-02-26",
  "words": "10,849",
  "chapters": "2/2",
  "comments": "239",
  "kudos": "15,585",
  "bookmarks": "2,475",
  "hits": "153,852",
  "summary": "<p>Izuku gets de-aged to 3 years old and Shota Aizawa is really not being paid enough to deal with any of this. </p>\n<p>-<br>“Izuku, how old are you right now?”</p>\n<p>Izuku's wide green eyes stare back at him. “I'm- I'm 3, Mr. Eraser.”</p>\n<p>“Okay. What's the last thing you remember?”</p>\n<p>Izuku looks down at his lap, his small fingers tracing over a bruise on his stomach. “Papa was angry cause I was too loud. So I cried and took a nap and now I'm awake here... Did Papa take me here?”</p>\n<p>Shota exhales and decides that the truth might be too confusing for now. “Well, I'm going to take care of you until you feel better, okay? You're going to be staying with me for now. Your dad's gone. He won't hurt you anymore.”</p>\n<p>Izuku looks up, eyes full of hope that dares not be called hope, something so shaky and hesitant but desperate nonetheless. “Really?”</p>\n<p>And for once, Shota gives his student a smile. “I promise. Cross my heart.”</p>\n<p>Bakugou isn't a heartless asshole, Hizashi keeps taking pictures and ruining Aizawa's reputation as the Snape of the school, and Izuku and Todoroki have a heart-to-heart.</p>",
  "notes": "<p>Talks of abuse.</p>\n<p>The quotes that are in italics are Bakugou's unless stated otherwise.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>Tell me what you think! This is my first BNHA fanfic.</p>\n<p>I'm planning on more oneshots and stories in this universe, so stay posted! :D</p>",
  "text": "<p>Shouta tries not to notice anything weird in the Midoriya kid. After all, he teaches at UA, where everyone has their own stories and own motivations and, truthfully, he's seen everything.</p>\n<p>Which might also be why he can't help but notice some things about the problem child of Class 1-A. Because he's seen enough things to know the patterns and way that things unfold. He notices the small things others might not because he's learned the consequences for being imperceptive.</p>\n<p>He notices the way that Midoriya's files don't list a father to allow him visitation rights to his son, and he notices the way that Midoriya gets overwhelmed in crowds and has a low self-esteem.</p>\n<p>Sure, he was one of the people who originally gave the boy a hard time when he first entered, but he didn't exactly know at the time that he'd literally just gotten his quirk.</p>\n<p>\n<em>“You mean to tell me,” Shouta says, keeping his voice level and his tone neutral in spite of the rage building up inside of him. “That his quirk just manifested? And you didn't think it would be important for me- his teacher- to know that?”</em>\n</p>\n<p>\n<em>Toshinori lowers his eyes, his shoulders deflating. “It was safer for it to be kept a secret, at least until-”</em>\n</p>\n<p>\n<em>“He's my student!” Shouta yells, cutting through the excuse that Toshinori was about to give him. He looks down to make sure that Midoriya hasn't woken up. </em>\n</p>\n<p>\n<em>Quieter, barely above a whisper, he says, “He's my student and I nearly damn-well expelled him because I thought he was this kid with a quirk that could easily destroy his body and put others in danger and he didn't care enough to control it. If I'd expelled him that day, what then? He would have been left without any support, any official training at all.”</em>\n</p>\n<p>\n<em>“I would have kept training him...” Toshinori says, but it's an invalid argument and a half-hearted one, at that.</em>\n</p>\n<p>\n<em>Shouta pushes down his rage, focusing on the injured student between them, unconscious again for the umpteenth time this year. Overexertion, Recovery Girl said. “The boy doesn't know when to stop, does he?”</em>\n</p>\n<p>\n<em>Toshinori smiles sadly, pushing a strand of hair from the kid's face. “Afraid not.”</em>\n</p>\n<p>But when he found out, he'd made sure to amend things. He called Izuku into his office and talked to him, gave him afterschool classes to get him to the same level as his peers, taught him self-control and moderation to keep him from abusing his body and breaking himself before any villains could do it for him.</p>\n<p>And that's fine. Shouta isn't against lending a helping hand and pulling his students up from their knees. He's a teacher, he knows that it's his job not to just make heroes, but to make people who can survive between one day to the next. He's seen everything. From child abuse to neglect to suicidal kids and kids with minds that worked against them.</p>\n<p>He doesn't say it out loud, but he notices. And he cares.</p>\n<p>For most of them, it's easy enough to see where their weaknesses and sorrows lie, and they're open enough to admit it.</p>\n<p>He gives Kaminari a pair of gloves when he admits that his quirk can hurt his hands sometimes. And he gives Todoroki a box of tea that helps with sleeping when he finds out that he struggles with nightmares from time to time.</p>\n<p>Some of his students this year are on the spectrum. He starts leaving out weighted blankets in the common room's drawers, labeling it for “students who need it”. He leaves out fidgets in a bowl on the coffee table. He gives students a sheet of single-use “chill tickets” for when they need to leave the room until they feel better.</p>\n<p>He's a hero, yes, but before he is a hero, he has to remember that his main obligation is to his students. His students that are <em>kids</em> thrown into a battlefield from a young age. His students, who are strong and brave and kind and playful. His students. His kids.</p>\n<p>After all, every hero has their own weaknesses. His is certainly that he grew up walking through shards of himself and needed to learn to grit his teeth through that.</p>\n<p>He is cynical, but he sees Midoriya and he hopes.</p>\n<p>He hopes that just once, the instinct that's helped him as a Pro Hero is wrong. Because Midoriya has a dazzling smile and he doesn't hide his emotions and he's selfless and he's a beacon of light for people around him to be able to see through the darkness inside of them. He's the one that inspires his peers to work harder and smarter, standing tall so that his friends will be unafraid to stand as well.</p>\n<p>He hopes that just this once there's truly nothing terrifying hiding behind the walls of the paper dollhouse.</p>\n<p>But there are things in Midoriya that makes him pause. The way that Midoriya never seems to hesitate in saving others at the cost of his own life. The way Midoriya freezes when Shouta stands behind him or someone else touches him suddenly. The way Midoriya's mother felt it was necessary to clarify and emphasize that only she's authorized to see her son.</p>\n<p>The way Midoriya wanders to the kitchen late at night and falls asleep on the couch from time to time, as if something in his room makes it hard for him to breathe.</p>\n<p>He notices some things but he doesn't know what to do with them, because they threaten the hope that just once, he has a student with a kind heart that hasn't ever been broken before he even stepped onto the steps of UA.</p>\n<p>He hopes. He hopes but he sees.</p>\n<p>He hopes but he releases the hope to finally dare to look into what's in front of him when Midoriya ends up in the hospital and Recovery Girl tells him to take a seat as he stares at the scars on the boy's body that definitely weren't from training or hero work.</p>\n<p>He stares at the body too small to be in primary school, let alone UA.</p>\n<p> </p>\n<p>A de-aging quirk, Iida tells Shouta. That accounts for the size of his boy, but not the scars and bruises on it.</p>\n<p> </p>\n<p>Inko Midoriya enters the infirmary room with eyes wide, looking at Izuku with such an intense and pained expression that Shouta has to avert his eyes from where he's standing unseen by her. “Izuku,” she whispers, running her hand through his hair, tears in her eyes. “What have you done?”</p>\n<p>Recovery Girl gives Inko a run-down of his injuries, and Inko only gives her an empty thanks, still focused on her son laid out in front of her.</p>\n<p>“Mrs Midoriya,” he greets, walking into her line of sight and standing at the foot of Izuku's bed.</p>\n<p>Inko finally tears her eyes from Izuku, giving Shouta a soft smile. “Professor Aizawa. Izuku speaks highly of you.” Shouta tries not to look surprised, but some of it must have stayed on his face, because Inku chuckles. “He was so excited to be in your class. He's always so excited about heroes.”</p>\n<p>A feeling that is both warm and painful wriggles around in Shouta's chest. He doesn't even know what he's feeling as he processes the words.</p>\n<p>He catches sight of a scar on Midoriya's side that seems to continue onto his back. It only makes the bruises surrounding it stand out even more. Shouta can't tear his eyes from it.</p>\n<p>“Ma'am, I am sorry you had to be called here. If I could have done something to avoid this, I would have. He wasn't attacked, but while on a class outing, someone's quirk caused him to revert to a younger age. Recovery Girl estimates he's around 4.”</p>\n<p>Something crosses Inko's face, but it leaves too soon for Shouta to decipher it.</p>\n<p>He squints a bit, wondering. “Ma'am, may I ask you about these injuries? I can't help but wonder how he got them at this age.”</p>\n<p>Inko's smile twists into something else, a painful facsimile of one. “My boy's had a rough life. Not-Not as rough as some, maybe, but...” She exhales, pushing her hair away from her face. Shouta watches her deliberate before she meets his eyes. “Hisashi Midoriya.”</p>\n<p>Shouta's eyebrows furrow. “Izuku's father?”</p>\n<p>Inko nods, but there is something more to the story that Shouta isn't yet understanding. He can feel it like ice crackling under his feet, ready to let him drop into the cold depths beneath. It reminds him of his mother's icy silence before she admitted certain truths he wasn't old enough to know.</p>\n<p>He waits until Inko continues, “I met him when we were young enough to not really know what we were doing. He could breathe fire, which wasn't an overly strong or flashy quirk, but it was interesting and, along with his personality, I found myself falling for him.” A ghost of a smile flicked across her face, but it was overshadowed by the sea of regret in her eyes. “He was kind, at first. But when I took a job that meant I was away from home for long stretches of time, I noticed how Izuku was... changing. He flinched too much- even more than the bullying could account for.”</p>\n<p>Shouta listens quietly, filing everything away for later. Bullying- he'd had an idea of sorts that Izuku had been bullied from Bakugou and Izuku's interactions.</p>\n<p>Inko lets out a breath, shaking her head. “I should have noticed sooner. I work with children- I'm a nurse in a pediatric hospital, I've seen children come in for cases of abuse and- and I still didn't- I didn't...” Tears well in her eyes again, but these ones fall, tracking down her chin. “I didn't want to see what was going on right in front of me. While I was out working with children and making sure they were safe, I was leaving my own son alone with a monster of a man.”</p>\n<p>Shouta understands.</p>\n<p>Sometimes, you hope, and you hope so strongly that everything that can threaten that hope is shut down and pushed back. You close your eyes to keep from seeing something that you're not sure you can handle.</p>\n<p>He understands. He understands because he's done that very thing many times before.</p>\n<p>“Then it all sorta climaxed when he found out that Izuku's quirkless and I ended up needing to take Izuku to the hospital for it.” A soft sorrow can be heard in her words, and Shouta can see in her eyes how she remembers it. He lets himself wonder, imagining a younger Inko holding a limp Izuku in her arms and-</p>\n<p>“What happened to that man?” he asks, unaware he'd even opened his mouth, unable to control the sheer amount of rage that simmers behind each word.</p>\n<p>His child. Though not by blood, Izuku was <em>his child</em> as long as he was in these walls. Someone had hurt his child.</p>\n<p>Inko gives him a soft smile again, and Shouta has to wonder if she cries a lot using her smiles to look strong for her son, or if it might be a trait she developed in being a nurse. Some teachers at UA do the same- smiling so they don't seem scared. Smiling so the students feel less scared.</p>\n<p>Smiling so that everyone can pretend a little easier that they're okay.</p>\n<p>“He disappeared after that. I never heard anything from him since.”</p>\n<p>Shouta forces himself to feel satisfied with that outcome. At least he's gone. At least Shouta doesn't have to worry about Hisashi coming back from wherever-the-hell to claim his child now that his child has proven himself to be incredibly power and brilliant.</p>\n<p>He's seen it happen before. The parents aren't different, but now they have different goals and new ways to achieve them, using their child until they can no longer provide anything, at which point the children are discarded once more. Or they latch on and seek to control their child, manipulating their child so that they have someone who admires their every action who would fervently deny whatever abuse happened before they became an asset to use for their parent.</p>\n<p>He's so wrapped up in his thoughts that he doesn't notice that he's gone into his own mind until Inko places a hand on his arm. “Professor? What'll happen to Izuku when he wakes up?”</p>\n<p>Shouta wonders the same thing. “From what I heard, there's a 50-50 chance he'll remember his life as a student here. If he remembers, that'll make it an overall smoother process.”</p>\n<p>He doesn't know how he'll explain to Izuku that he's in a hero academy at the age of 4, after all, nor why his parents aren't here. He's not a primary school teacher- and for good reason. Children are messy, emotional, and needy. Shouta isn't made for it.</p>\n<p>He gives Inko an apologetic look. “I know that you must want to take him home, but given the current climate that our young heroes are living in, I'm afraid that it likely won't be allowed for his safety. Villains might want to take advantage of his currently weakened form and use it against him.”</p>\n<p>Inko seems to accept this, nodding her head. “I figured as such. Though, I have one thing to ask you.” Shouta nods to gesture he's listening. “Keep my son safe, will you? I know this is one of the best schools where they can learn how to be a hero and how to be strong, but...”</p>\n<p>“Even though they're here to train, they're still children. We never forget about that fact, ma'am. I'll take care of him, I promise.”</p>\n<p>They talk for another hour with Inko telling him more facts about Izuku when he was little, giving him details he didn't think he'd ever be interested in. At the moment though, he's glad to know them going in so he isn't caught by surprise when Izuku asks for “popcorn” which is actually marshmallows or his favorite stuffed kitten, Hana.</p>\n<p>Inko smiles by the end of it, standing. “Professor... Thank you. I know he trusts you with his life. I... I trust you, too. I know you'll keep him safe.”</p>\n<p>Shouta absolutely does not feel his chest go warm at the words. He doesn't smile at Inko. He doesn't wave at her as she leaves.</p>\n<p>Just his luck, the resident problem child begins shifting and waking only half an hour after his mother leaves. Those bright green eyes blink awake and look around, pulling his blanket to himself as he looks at Shouta with a very distinct expression of fear.</p>\n<p>Shouta leans back, keeping his hands in Izuku's line of sight. “Do you remember me, Izuku?”</p>\n<p>Izuku's eyes rake over him, his eyebrows furrowing in thought as though he isn't sure if this is a trick question. Though, when he sees Shouta's capturing weapon, he visibly relaxes. “Eraserhead! You're an underground Hero!”</p>\n<p>And that...</p>\n<p>Goddammit. Izuku doesn't remember him. Of course life doesn't want to be simple.</p>\n<p>“Izuku, how old are you right now?”</p>\n<p>Izuku's wide green eyes stare back at him. “I'm- I'm 3, Mr. Eraser.”</p>\n<p>“Okay. What's the last thing you remember?”</p>\n<p>Izuku looks down at his lap, his small fingers tracing over a bruise on his stomach. “Papa was angry cause I was too loud. So I cried and took a nap and now I'm awake here... Did Papa take me here?”</p>\n<p>The question in his eyes is obvious. <em>Have I been abandoned?</em></p>\n<p>Shouta exhales and decides that the truth might be too confusing for now. “Well, I'm going to take care of you until you feel better, okay? You're going to be staying with me for now. Your dad's gone. He won't hurt you anymore.”</p>\n<p>Izuku looks up, eyes full of hope that dares not be called hope, something so shaky and hesitant but desperate nonetheless. “Really?”</p>\n<p>And for once, Shouta gives his student a smile. “I promise. Cross my heart.” He does the symbol over his chest and his student beams so brightly that Shouta wants to ruffle his hair. He's adorable.</p>\n<p>Shouta looks up from his grading when Toshinori walks into the room, looking curiously at his successor, who had allowed Shouta to place him in a child's playpen that Hizashi had lying around. Izuku looks up when Toshinori walks in, just as curious but more cautious, holding the blocks in his fingers tightly as he holds his breath, waiting.</p>\n<p>Shouta watches as Toshinori watches the problem child for a few seconds, before he turns to Shouta with a question in his eyes. Shouta takes pity on him. “He doesn't remember,” he says, flipping the paper he's grading over so he no longer has to stare at the sea of red corrections. “You can try introducing yourself, but be gentle.”</p>\n<p>Toshinori seems to understand. He kneels to be in front of Izuku's playpen, smiling brightly at Izuku through the bars. “Hi, Izuku. I'm Toshinori. I'm Shouta's friend.”</p>\n<p>Izuku tilts his head to the side. “Friend?”</p>\n<p>Toshinori extends a hand, trying to be gentle and not make any sudden moves.</p>\n<p>He knows to be careful and not to be hurt if Izuku isn't sure of him yet, of course.</p>\n<p>Shouta told him what he'd already known. Ever since Izuku had a nightmare and Toshinori found him panicking, reaching out to comfort him only for Izuku to flinch away and say, <em>Papa, please</em>, <em>I'm sorry.</em></p>\n<p>It had taken everything in Toshinori not to show Izuku the burning rage at the faceless man in his mind who he knew only as Izuku's father.</p>\n<p>Izuku blinks at him, looking between him and Shouta, trying to analyze his threat level before he seems to settle on an answer. He reaches out, holding Toshinori's hand through the bars. “Are you a hero too, Mr Toshinori?”</p>\n<p>Toshinori nods. “That I am, young Midoriya, but I guess I'm on a break from being a hero for now.”</p>\n<p>“What's your hero name?”</p>\n<p>Toshinori shares a look with Shouta , having a silent conversation with eyes. Shouta nods. “All Might.”</p>\n<p>The light that enters Izuku's eyes is akin to the sun, burning brightly as his eyes widen. “All Might! All Might! All Might! You're skinny!”</p>\n<p>Toshinori nods. “I only become very muscular when I'm in my hero form.”</p>\n<p>An idea enters Izuku's mind and he nods, easily accepting that. “Changing bodies, like the Simulacreye, the hero of shape-shifting and mind possession!”</p>\n<p>Izuku stands, practically bouncing with energy. Toshinori laughs, lifting the boy into his arms. He turns, seeing Shouta holding a phone in what's meant to be a subtle attempt to take a picture of them. “I didn't think you'd be the sentimental-photographer type of person,” Toshinori says, giving his colleague a smile that Shouta doesn't respond to in the slightest.</p>\n<p>“It's only so Inko knows her son is alive,” Shouta responds, though Toshinori doesn't see him delete the photo after he sends it to Inko.</p>\n<p>Izuku plays with Toshinori's hair as he sways him, quietly letting the man hold him without much fuss. “He's very low-maintenance,” he murmurs, just loud enough for Shouta to overhear.</p>\n<p>“After what he'd been through, I'm not sure he can be blamed for it.”</p>\n<p>The first problem, Shouta realizes, is how Izuku has nothing aside for the things that Inko had sent over. Meaning- he had toys and a few pairs of clothes. Shouta's first idea is to send Iida or some other student to the nearest shop to buy some supplies, because from what he's been told, this can last for... a while.</p>\n<p>Especially given the fact that the person who'd caused this was a kid, and their parent was currently playing hide and seek because they were worried about legal repercussions and the press.</p>\n<p>\n<strike>To be fair, if All Might and Eraserhead arrived at your door asking questions about how to reverse your son's quirk because he accidentally used it on one of the students who always ended up being talked about (the one who keeps breaking his bones to win like he's got nothing to lose), Shouta supposes that he might have decided to hide as well.</strike>\n</p>\n<p>“Mr Eraser!” Izuku says, pulling at his sleeve. He looks down at the little troublemaker, who's still a bit bruised but healing, at least. Izuku looks up at him with bright eyes, then hands him a piece of paper with some crayon squiggles in it. It takes him a second, but it dawns on him that the squiggles are of him and Toshinori. He doesn't even try to hide the smile that crosses his face.</p>\n<p>“Wow, Izuku. This is really good. I like how you drew my scarf,” he says, enjoying the way that Izuku beamed under the praise. So sue him, he had a soft spot that even he didn't know existed beforehand.</p>\n<p>“Hmm, you wanna go out today?” he asks. “We need to get you some things. How's that sound?”</p>\n<p>Izuku hesitates, hand clenching around Shouta's shirt. “Do I go?”</p>\n<p>Shouta sees the fear of being left behind in his face easily, though he doesn't seem like he'd put up a fight if Shouta were to say that he'd be left behind.</p>\n<p>“Of course you're coming with me. We might even take some of your frie- some of my students with us. How does that sound?”</p>\n<p>Izuku seems to take that well, nodding.</p>\n<p>It's easier in concept than it is to put it to practice, mostly because once word gets out about what's going on, it becomes difficult to tell the class that there is absolutely no way that Shouta is going to bring all of them. Ruckus breaks out amongst the students, all of them deciding that being in a mall would be much more fun than being in the dorms.</p>\n<p>It takes himthreatening expulsion, Iida preaching about discipline and honor, and Hizashi offering to let them play a friendly game rather than sit around being bored to convince most of the students that they don't need to come along.</p>\n<p>Bakugou comes, surprisingly. He's on the van they decided to bring before Shouta can tell him no, and by that point Shouta decides that it's easier to let him come than tell him that he's staying.</p>\n<p>And maybe the way that Izuku whispers “Kacchan” and launches himself at the blond teenager and the way that Kacchan winces at the bruises on Izuku's face convince Shouta that somewhere underneath the brooding exterior is still a person that cares about Izuku.</p>\n<p>This version of Izuku, anyways.</p>\n<p>Iida and Uraraka also come, though that almost goes without saying. Aside for the three, Todoroki, Hitoshi, Kirishima, Ashido, and Kaminari hop along for the ride.</p>\n<p>Shouta didn't plan on bringing Kirishima, Ashido, Asui, and Kaminari along. But when he saw Bakugou coming, Kirishima quickly joined the train and that triggered Kaminari to come along which triggered Ashido into joining- and when Shouta tried to tell them that he thinks they can stay behind instead, Ashido's eyes widen with tears and... well.</p>\n<p>His job isn't to deal with tears. He doesn't like tears in the slightest. He's fiercely allergic to them.</p>\n<p>So in the end, he just lets them join, not commenting when Asui hops into the van, squeezing in next to Ashido, not caring that she's pressed against the door. He just sighs and decides to stare ahead of him.</p>\n<p>Toshinori is brought along to make sure the other students don't cause explosions or get up to trouble while Shouta's busy with Izuku.</p>\n<p>That makes 12 people in one van. He's somewhat grateful that they had the foresight to get a large van.</p>\n<p>Shouta doesn't try to separate Izuku from his Kacchan, focusing on driving them to the shopping center- a smaller one, one where he's at least mostly sure that the League of Villains won't be there to try and kidnap or intimidate his students. With his problem student like this, he doesn't know how he'd be able to decide whether to act or retreat, especially with students who likely won't be hesitating in rushing head-first into battle.</p>\n<p>20 minutes into the drive, Toshinori sleeping soundly in the passenger's seat, Shouta remembers why he doesn't enjoy chaperoning students on shopping trips.</p>\n<p>“Sir! Denki keeps shocking me!” Ashido yells, elbowing the boy in question. Kaminari shoves her back.</p>\n<p>“I can't help it!” Kaminari snaps back defensively.</p>\n<p>“Hey, cut it out!” Asui yells, though Kaminari yells back something that goes unheard over the mish-mash of voices talking at once, each one just as upset as the last. Iida begins a rant about the behavior and how it's low of UA students. Kaminari and Ashido continue to yell at each other. Others begin to chime in, mostly when they become collateral damage.</p>\n<p>Shouta doesn't take his eyes from the road. He convinces himself that if he doesn't see it, it's not happening. They're close to the mall. All he needs is-</p>\n<p>“Hey! You hit Deku, asshole! I'll kill you!” Bakugou yells at the same time that Shouta hears Izuku yell in pain and then begin crying quietly.</p>\n<p>They haven't even made it to the shopping center and Izuku is bleeding.</p>\n<p>Of course the little problem child is bleeding.</p>\n<p>The silence that follows when the students realize what is happening is something that seems to pulse like the headache at Shouta's temple. He pulls over, needing to see if Izuku's wound is serious and give the students a stern talking-to. If he weren't so afraid of them being abducted or attacked by villains, he might just drop them on the side of the road and leave them to walk back to the campus.</p>\n<p>Shouta reaches out, glad when he sees Izuku reach out for him instantly, burying his face in Shouta's chest.</p>\n<p>Shouta speaks as he takes a napkin and stifles the bleeding, voice level as he can make it, “Would someone like to explain what happened?”</p>\n<p>The silence drags on, each student looking to the others to see who's willing to speak up first. With the exception of Bakugou and Todoroki, each one seems to believe that talking would have them thrown into a volcano. Shouta waits.</p>\n<p>He's good at waiting.</p>\n<p>It's Kaminari that breaks the silence, voice quiet and teary. “Sorry, sir.”</p>\n<p>“That isn't what I'm looking for, but thank you for the apology,” Shouta responds. “I want to know why things happened the way they did.”</p>\n<p>Ashido spoke next, voice just as soft as Kaminari's. “Denki kept shocking me and I elbowed him and then he shoved me and then we began arguing, sir. ”</p>\n<p>“Kaminari, why did you keep shocking her?”</p>\n<p>There's a beat of silence before Kaminari answers. “I lost my gloves and I've been accidentally letting off sparks.” He pauses, sounding nervous. “I'm <em>sorry</em>, I didn't mean to lose the gloves you gave me, I know they're expensive, I'll find them, sir, I-”</p>\n<p>Ashido cuts into his apologies with her own apology. “ I'm sorry, too. It was my fault just as much as it was his. I should have understood that he didn't mean to, but I still hit him, and I'm sorry. Please don't blame him, sir, I'll take the punishment. Please.”</p>\n<p>“Okay,” Shouta cuts in, voice calm. He's pinpointed the problem and, from what he can see, there isn't a clear culprit of anyone who can take the blame.</p>\n<p>Kaminari can't be faulted for his quirk being beyond his control when he's been left without the prime buffer in how he controls the electrical discharges that happen every so often. And Ashido can't exactly be faulted for getting upset when she kept getting shocked. It's doubtlessly painful and upsetting to be shocked at random intervals.</p>\n<p>So, there's no need for a punishment.</p>\n<p>Which is good.</p>\n<p>Punishments mean tears which he's deathly allergic to. The only reason he's able to bear Izuku's tears right now is because he took his anti-tear-allergy pills earlier. Any more and he'd die. Surely.</p>\n<p>“Here's the plan. Kaminari, sit between the door and Kirishima- Kirishima, use hardening on your left side so that you don't get hurt. It'll be an exercise in control for you. When we get to the shopping center, Kaminari, I want you to find a store where you can get gloves until we can have another set made for you. Does anyone have any complaints about the plan?”</p>\n<p>After several murmurs of no, he waits for Bakugou and Kaminari to switch places. The wound on Izuku's arm is small, most likely from a scratch more than anything. Izuku seems content to remain in Shouta's lap, but he hesitantly hands him to Todoroki, trying not to notice the way that Bakugou scowls deeply at that.</p>\n<p>After another 10 minutes of uneventful chatter, he finally parks the van. Toshinori wakes as he does. “Here already?”</p>\n<p>Shouta doesn't tell him that they'd been on the road for half an hour due to traffic.</p>\n<p>Instead, he gets out the car and lets Toshinori take Izuku into his arms, giving each group of students a small list of items they need. He assigns Uraraka and Iida to clothing for Izuku, knowing that Uraraka would know Izuku's likes and dislikes best while Iida would be sure to find something practical and useful.</p>\n<p>He assigns Bakugou, Todoroki, Hitoshi, and Kirishima to food, both for the dorm kitchen and for Izuku's personal snacks. At least that way, there's less of a likelihood for any of them to have to argue about this or that.</p>\n<p>And finally, he assigns Kaminari, Ashido, and Asui to find suitable toys for the young student. It's merely to be ready in the future for other such events, of course. Nothing more and nothing less.</p>\n<p>And, maybe, it's because he can still see the shame on Kaminari's face and the guilt in Ashido's. And even though they're heroes in training, he knows that even teenagers can enjoy a nice toy or boardgame every once in a while.</p>\n<p>He watches them all separate to complete the tasks. “You're growing soft,” Toshinori says with a smile. “Who said you didn't love your students?”</p>\n<p>Shouta looks at him. “I'm not the one who people believe is the secret father of a certain green-haired student.”</p>\n<p>Toshinori only grins at that. “That's not a denial.”</p>\n<p>Shouta looks at the sleeping toddler in Toshinori's arms. “I didn't say it was.”</p>\n<p>“And, it's quite funny. I've heard people talking about you fathering a different student of a different hair color. Does that sound familiar?”</p>\n<p>Shouta sighs, sitting down on a bench so he has the best view of where the students scattered off to.</p>\n<p>The last thing he needs is for another incident. His students have enough nightmares as it is.</p>\n<p>“Hitoshi is a student with a lot of potential but he's had a rough life. With a quirk like he has, it's only natural for people to assume the worst, even his parents. I'm mentoring him to overcome his weaknesses and help him grow. I just... saw something in him I want to cultivate.”</p>\n<p>Toshinori nods. “I understand. Midoriya's mother trusts me with him. I'm very blessed to be able to be in a role where I can directly help raise him. When I found him, he had a spark in his eyes and a determination I admired. Now I'm helping him have the chance at turning his dreams into a reality.”</p>\n<p>Shouta and Toshinori share a look. A silent promise. An understanding between two father-mentors regarding their charges.</p>\n<p>The green-haired hero sleeps on in Toshinori's arms, safe and content as the Pro Hero holds him.</p>\n<p>“The universe is going to test their mettle,” Shouta says quietly. “They're going to break multiple times over until they can learn to stand up to the weight of the universe.”</p>\n<p>Toshinori nods solemnly. “Then we'll be there to help them bear the weight until they can carry it on their own.”</p>\n<p> </p>\n<p> </p>\n<p>Shouta, through some minor miracle in the world, finally gets his students to sit at the largest table in the restaurant after much switching spots and pushing and clumping. Apparently, the people at the restaurant didn't quite expect quite a large group to come in. There are some looks their way from the staff.</p>\n<p> </p>\n<p>It confuses Shouta at first, though when he hears someone murmur, “that's quite the family,” he realizes why people are looking at them strangely. The way that Ashido keeps subconsciously holding onto All Might while they walk certainly doesn't help Shouta disprove the idea that they're one family.</p>\n<p> </p>\n<p>Another woman looks over and coos at Izuku, giving Toshinori a warm smile. “Aw, your son is very cute!”</p>\n<p> </p>\n<p>“Thank yOU!” Toshinori yells, blushing furiously but prouder than Shouta's seen him. Shouta rolls his eyes.</p>\n<p> </p>\n<p>“And! You have a wonderful family. It's very nice of you to adopt even though you have your own kids.” She gives a meaningful glance to Kaminari and Bakugou, then walks away, leaving behind a group of teenagers in uproar.</p>\n<p> </p>\n<p>“GUYS SHE THINKS I'M ALL MIGHT'S SON!” Kaminari yells, nearly elbowing his water across the room.</p>\n<p> </p>\n<p>Ashido pouts. “I wanna be All Might's s- daughter! That's not fair!”</p>\n<p> </p>\n<p>“Hah! You extras, you heard the old hag! I look as strong and heroic as All Might.” Bakugou's evil laughter does not, in fact, convince his classmates that he looks as heroic as All Might.</p>\n<p> </p>\n<p>Iida, Asui, and Uraraka look to each other, then All Might, then Shouta. “Hmm... I guess we look more like Sir Aizawa, kero,” Asui says, and Shouta resolutely ignores her statement and doesn't blush. <em>He doesn't.</em></p>\n<p> </p>\n<p>“Wait!” Kirishima yells, outraged. “Does this mean that I'm adopted?”</p>\n<p> </p>\n<p>“It isn't the worst thing,” Hitoshi says dryly, giving Shouta a Look.</p>\n<p> </p>\n<p>Kirishima scowls. “Maybe not to you!”</p>\n<p> </p>\n<p>The class continues arguing until the food arrives, at which point they all fall into quiet, mostly too busy eating to focus on bothering each other and being an annoyance to the staff. The peace, however, doesn't last forever.</p>\n<p> </p>\n<p>“Here you are, Deku!” Uraraka says cheerily, holding a sandwich for their smallest member.</p>\n<p> </p>\n<p>Bakugou looks over and frowns. “Cut the crusts.”</p>\n<p> </p>\n<p>Uraraka frowns at the sharp order. “What?”</p>\n<p> </p>\n<p>“Cut the crusts! He doesn't eat his damn sandwiches when they have crusts left on them!”</p>\n<p> </p>\n<p>Everyone seems to hesitate, except for Kaminari, who doesn't have the brain cells to fear God or Bakugou. “Why would <em>you</em> know how he likes his-”</p>\n<p> </p>\n<p>“Shut up, Pikachu! I don't need to explain myself!”</p>\n<p> </p>\n<p>Nobody seems to agree with that, even Shouta himself. It is a very curious thing for Bakugou to know about how Midoriya likes his sandwiches.</p>\n<p> </p>\n<p>“Hmm,” Asui says. “You know a lot about Midoriya... as his <em>sworn</em> <em>rival, </em>kero.”</p>\n<p> </p>\n<p>“That is true,” Todoroki says, looking between Izuku and Bakugou as if he's trying to figure something out. “Did you two grow up toge-”</p>\n<p><br>“Shut up, IcyHot! Nobody asked for what you thought.” Bakugou aims his hand at Todoroki, letting out a small explosion.</p>\n<p> </p>\n<p>Well... “small”. Shouta knows it's small because he's seen him at full-power. To the staff, it might seem actually quite big.</p>\n<p> </p>\n<p>Todoroki stares at Bakugou, unimpressed.</p>\n<p> </p>\n<p>Shouta sighs. He's not going to have the money to pay the damage bills if his exploding student doesn't calm down, and he's already spent enough already today because his idiots accidentally cooked the decorative plants on the second floor.</p>\n<p> </p>\n<p>It's Toshinori who speaks next. “Young Bakugou, keep your voice down. You'll scare Izuku and the staff.”</p>\n<p> </p>\n<p>That seems to get Bakugou's attention and he stiffens, torn on whether or not to explode even louder to spite the universe or to obey his hero. In the end, though, he just scowls and crosses his arms.</p>\n<p> </p>\n<p>Uraraka cuts the crusts off of Izuku's sandwich, but the boy doesn't pay attention to the sandwich, his brows furrowed tightly in thought. “Kacchan?” Izuku whispers, looking up to the teenager that grunts as response. “Are- Aren't we still friends? Why are we rivals?”</p>\n<p> </p>\n<p>Shouta quietly curses the boy's large vocabulary for knowing what it means, what it entails. He'd be lying if he says he doesn't wait for an answer, though.</p>\n<p> </p>\n<p>Silence falls over the table, this one more tense than the last. Bakugou's shoulders tense, knowing that everyone's watching him. He looks over- his first mistake- and sees wide green eyes looking at him nervously.</p>\n<p> </p>\n<p>It must be a familiar sight.</p>\n<p> </p>\n<p>He sighs and stares down at the table like it personally insulted him. “Of course we're... friends, dumbass. I'm still here, aren't I?”</p>\n<p> </p>\n<p>It isn't the whole truth, but Izuku believes him.</p>\n<p> </p>\n<p>“But she said we're riv-”</p>\n<p> </p>\n<p>“We are.” Bakugou looks over at Izuku, small and helpless and <em>trusting</em>. Shouta sees him <em>tsk</em> under his breath. This is more than he wants to say, but he says it nonetheless. “If we weren't rivals then we'd never progress past these extras! Everyone is too weak to be a worthy rival, so we have to be rivals if we wanna improve. You wanna be a damn hero, don't you?”</p>\n<p> </p>\n<p>“Language!” Iida chides, chopping the air in front of him like a football coach. “Do not swear in front of a child, Bakugou! Even if that was a nice sentiment that shows you care for Midoriya more than we thought!”</p>\n<p> </p>\n<p>Bakugou growls, aiming to blast Iida before Shouta erases his quirk, glaring at the bomb in human form.</p>\n<p> </p>\n<p>“I wanna be a damn hero!” Izuku repeats excitedly, leading to most of the group immediately jumping in to tell him to never repeat anything Bakugou says again.</p>\n<p> </p>\n<p>Most of the group except for Bakugou, whose eyes take on a devious shine, and Hitoshi, who's looking very amused. “Young Midoriya!” Toshinori says with a heavy frown that is a bad attempt at hiding his laughter. “Never say that word again!”</p>\n<p> </p>\n<p>Izuku looks up innocently. “Hero?”</p>\n<p> </p>\n<p>“No, the word before that.”</p>\n<p> </p>\n<p>“Damn?”</p>\n<p> </p>\n<p>“Yes. Never say that again,” Toshinori confirms.</p>\n<p> </p>\n<p> </p>\n<p>He does, in fact, say it again at the instruction of his childhood best friend, many times over the short course of several days. After all, what reason would Izuku have to distrust his childhood best friend? How would a young and naive Izuku know that his best friend is, in fact, a complete bastard of a boy.</p>\n<p> </p>\n<p>When Shouta finally decides enough is enough, <em>(“May I have some damn cookies, please, Mr. Eraser?”)</em> he scolds Bakugou.</p>\n<p> </p>\n<p>Bakugou stares back at him with a small smirk, which Shouta doesn't question because he can never hope to understand what the hell goes through Bakugou's mind.</p>\n<p> </p>\n<p>He regrets this decision when different swear words find their way into Midoriya's vocabulary.</p>\n<p> </p>\n<p>“<em>Can I have my fucking bath now, Mr. Might?” </em></p>\n<p> </p>\n<p>Toshinori spits blood everywhere and even Shouta has to take a minute to keep from walking out of the door and never returning to UA. He isn't paid enough for this. He <em>isn't.</em></p>\n<p> </p>\n<p>Suddenly, the idea of resigning and never coming back to this abandoned factory of clowns feels like such a rational decision.</p>\n<p> </p>\n<p>Hizashi, on the other hand, finds it hilarious and it's too late when Shouta realizes that he's recording.</p>\n<p> </p>\n<p>Though the two heroes argue with him for the phone, neither win against Hizashi. After all, there's only so much arguing to be done when Hizashi decides to take his hearing aids out and close his eyes so he doesn't see them signing at him.</p>\n<p> </p>\n<p> </p>\n<p>Shouta pauses when the figure enters his peripheral, Bakugou standing at his door with his hands shoved into his pockets like he isn't sure what to do with them. He shifts and shuffles for a minute before Shouta sighs and gives him a glance. “Is there something you want to talk about?” he asks, watching as Bakugou continues to scowl at his feet.</p>\n<p> </p>\n<p>He waits, letting the silence stretch on until Bakugou can't stand it anymore. “So are you going to be, like, Deku's dad until he's normal again?”</p>\n<p> </p>\n<p>Shouta pauses, capping his pen and looking up at his student cautiously.</p>\n<p> </p>\n<p>If anyone is going to be Izuku's dad, Shouta thinks it's definitely Toshinori. After all, those two seem to have some “history” that Shouta is just now beginning to understand. He's heard through the grape vine that Toshinori and Inko have already done the paperwork to have him be Izuku's legal guardian in the event that she can't care for him anymore.</p>\n<p> </p>\n<p>The way that Toshinori fusses over Izuku and worries like a mother hen certainly doesn't dispel any of those rumors.</p>\n<p> </p>\n<p>Rumors that even the students have picked up on.</p>\n<p> </p>\n<p>“As his homeroom teacher, I'm his main caretaker when he's in this school. All Might and Present Mic also help me in taking care of him. Why do you ask?”</p>\n<p> </p>\n<p>Bakugou growls. “You're not going to hurt him?” It's meant to be a threat, a statement, but his words turn into a question and Shouta suppresses a wince.</p>\n<p> </p>\n<p>\n<em>What do you know, kid?</em>\n</p>\n<p> </p>\n<p>He wouldn't. He wouldn't hurt him. Not like this.</p>\n<p> </p>\n<p>Not when he's so small and frail and <em>afraid.</em></p>\n<p> </p>\n<p>Not when he's still carrying scars from the fast hands and angry breath of his father.</p>\n<p> </p>\n<p>“I would never raise a hand to my student unless if it's in training and I know they'll be able to bounce back from it,” he answers honestly, but the answer doesn't seem to calm Bakugou. He pushes a little bit more. “Bakugou, why would you ask this? Do you think I would-”</p>\n<p> </p>\n<p>“He used to hit Auntie Inko,” Bakugou says, speaking fast and wild as a cannon ball. “He only did it a few times to her, but- but what he did to Deku-”</p>\n<p> </p>\n<p>A moment of silence before Bakugou finds his words again, his shoulders tensed like he's preparing to bolt or pounce at any minute. The fight is clear in his face, written in every atom of his body.</p>\n<p> </p>\n<p>“Deku made me promise not to tell and I didn't because he was so scared of what would happen if I did.”</p>\n<p> </p>\n<p><em>A common fear, </em>Shouta thinks. Most abusive parents instill a fear in their children to save their own hide. Maybe Izuku was afraid of what would happen to him if he told. Maybe he was scared of what would happen to his mother, if he knew his father was hurting his mother.</p>\n<p> </p>\n<p>“<em>I want to be a hero so nobody worries about me anymore!” Izuku yells, determination written plain across his face.</em></p>\n<p> </p>\n<p>“Then it escalated,” Shouta says, knowing this story well. He wishes with everything in him that he was still blind to it, but since becoming a teacher, he knows what happens behind closed doors.</p>\n<p> </p>\n<p>Knows the story of children carrying around wounds from hands meant to nurture them.</p>\n<p> </p>\n<p>Bakugou nods hesitantly, a small jerking movement.</p>\n<p> </p>\n<p>“He came to our apartment bleeding and fucking <em>broken,” </em>he says like the words burn his tongue. To Shouta's horror, he sees the tears jump to Bakugou's eyes.</p>\n<p> </p>\n<p><em>He hasn't spoken about this,</em> Shouta thinks.</p>\n<p> </p>\n<p>“And- and we had to take him to the hospital and the stupid useless idiot just kept telling us not to tell Auntie. He was bleeding all over the car and he just kept begging us not to fucking tell her because his dad might get into trouble. As if- As if his dad hadn't been the one to beat him like that.”</p>\n<p> </p>\n<p>He breathes raggedly like there's no air left in the room and all the stars are falling from the sky. Shouta stands slowly, placing his hand on Bakugou's arm and leading him to the seat. The boy is putty in his hands, letting himself be sat down, his eyes still as wild as his words.</p>\n<p> </p>\n<p>These words aren't meant for Shouta. They aren't directed at him as much as they're spilling from Bakugou's mouth like bullets into a cave.</p>\n<p> </p>\n<p>But he's responsible for this boy and he'll be damned if he doesn't listen with everything in him.</p>\n<p> </p>\n<p>“Bakugou-”</p>\n<p> </p>\n<p>“Deku didn't wake up for 2 days....” He shakes his head, pushing back against whatever memory he's remembering. “Auntie Inko kept crying. My mom stayed with her in the hospital, but me and dad stayed at home because they didn't want me to see Deku like that... They were scared I'd watch him <em>die</em>.”</p>\n<p> </p>\n<p>“<em>Get out! We'll both fucking die here if you don't leave. Just go!”</em></p>\n<p> </p>\n<p>The sound of Bakugou's struggle to breathe fills the otherwise silent room and it makes Shouta's chest ache.</p>\n<p> </p>\n<p>“<em>Don't you dare die like this, you asshole. Not like this. Wake up! Wake up right now! Please. Dekiru!”</em></p>\n<p> </p>\n<p>“Breathe, kid,” he says softly, crouching in front of him. “You're safe now, and so is Midoriya. Midoriya's father is gone. You two survived. You're here now, son, you made it.”</p>\n<p> </p>\n<p>Neither of them speak for a while as Bakugou tries to remember how to get into his lungs. Then, softly, “I thought it would make him stronger.”</p>\n<p> </p>\n<p>Shouta raises an eyebrow.</p>\n<p> </p>\n<p>“I bullied him. I thought it would make him stronger so that- if that asshole comes back, he would be ready. He would know how to defend himself. Then we could go back to what we were.”</p>\n<p> </p>\n<p>And with only those few words, it makes sense. The fights, the rivalry, the insults towards Izuku. The way that Bakugou keeps acting like he's already half-way to being an irredeemable villain.</p>\n<p> </p>\n<p>“But he never <em>fought back</em>. He never fought back, he just took it! And every time, I just kept remembering the way that he stumbled into our apartment and the way he begged and he wouldn't <em>fight</em> back. So I would hit him harder, and I would call him useless and quirkless like his dad did, because I wanted him to get angry! But he never got <em>angry</em>, he just <em>took it.</em> And it pissed me off because I couldn't understand why he could never get angry but I was <em>drowning</em> in rage!”</p>\n<p> </p>\n<p><em>They're both traumatized,</em> Shouta realizes, a weight falling against his stomach like a hammer. Bakugou would have been 4, too.</p>\n<p> </p>\n<p>Bakugou would have been terrified, too.</p>\n<p> </p>\n<p>And he's been carrying around all this weight like a cross on his shoulder, carrying the guilt like a bullet in his ribs.</p>\n<p> </p>\n<p>“<em>Fight back, godammit! Do you think I'm below you?!”</em></p>\n<p> </p>\n<p>Of course Izuku wouldn't fight back. Of course he wouldn't. Even now, after everything, he wouldn't defend himself unless if it was against a villain. Unless if there were other lives on the line.</p>\n<p> </p>\n<p>Because that's just who Izuku is.</p>\n<p> </p>\n<p>Izuku doesn't know that he's allowed to hurt. He doesn't know that it's okay to snap and fight back because all he's known is to be timid and nervous and stay out of the way of people who wouldn't think twice before running through him like a truck.</p>\n<p> </p>\n<p>Some children break and they learn to bare their teeth. They howl until the moon echoes back their sorrow and the world can hear what its done to one of its own.</p>\n<p> </p>\n<p>That's what happened to Bakugou, it seems. He grew angry and learned to fight because he was scared of being helpless to save the people he cared about.</p>\n<p> </p>\n<p>“<em>I don't need you to fucking protect me, Deku!”</em></p>\n<p> </p>\n<p>But Izuku is the other kind- the kind who learn to keep their words soft and their manner unassuming. He learned to stay out of sight and to avoid blows.</p>\n<p> </p>\n<p>He learned that if he wanted to stay safe, he had to please everybody, at the cost of everything, even his own health.</p>\n<p> </p>\n<p>It makes a sickening amount of sense. The constantly broken bones, the near-suicidal level of self-sacrificing, the desperation to prove himself as worthy.</p>\n<p> </p>\n<p>The flinching. The crying. The fact that he still thinks of himself as weak and useless compared to his classmates. The nightmares.</p>\n<p> </p>\n<p>“He's forgiven you though, hasn't he?” Shouta asks. Bakugou nods with a soft frown.</p>\n<p> </p>\n<p>Of course he has. Shouta doesn't expect anything less.</p>\n<p> </p>\n<p>“He'll forgive anyone! Of course he'll forgive me for being horrible. Even if he does say he forgives me, that doesn't make it <em>okay</em>.”</p>\n<p> </p>\n<p>“It isn't your choice to say whether or not you can be forgiven,” Shouta says quietly. “Who was hurt?”</p>\n<p> </p>\n<p>“Well, Deku was, but-”</p>\n<p> </p>\n<p>“The victim of the sin is the one who can choose the sinner's fate, as they say,” Shouta continues. “If Midoriya has decided to forgive you, what right do you- as the sinner- have to tell him he is wrong for doing so?”</p>\n<p> </p>\n<p>Bakugou freezes like these aren't the words he wants to hear, and Shouta knows it isn't, but he isn't going to be the one to deliver his student to his own guillotine of regret.</p>\n<p> </p>\n<p>“If you still think you need to make it up to him, then do so- reasonably. You can also talk to him, you know. I know you want to protect him and I know you feel like you've lost the right to his friendship, but don't forget that he <em>wants</em> you as his friend, Bakugou. He cares very much about you. And I think that you should also take that into account.”</p>\n<p> </p>\n<p>Bakugou stares at his hands. “How... How do I make it up to him? I don't know what to say about feelings and stupid dramatic stuff like that. I'm not much of a talker, so I'll probably screw it up if I try to talk...”</p>\n<p> </p>\n<p>Shouta smiles, placing his hand on Bakugou's knee and standing. “Why don't you... what is the phrase? 'Kill him with kindness'.”</p>\n<p> </p>\n<p>Bakugou jerks as if dunked into cold water, staring up at Shouta with bright eyes as it all clicks into place in his mind. His sulky face turns into a determined grin. “That's right! I'll show Deku what's what! He'll never doubt it again when I drown him in kindness!”</p>\n<p> </p>\n<p>Shouta hopes that's not literal.</p>\n<p> </p>\n<p>He stands and rushes for the door, only pausing long enough to give Shouta a thankful look. He doesn't verbally say it, of course, but it's there.</p>\n<p> </p>\n<p>And to Shouta , who knows him well enough to know how hard it is to acknowledge the existence of emotions, it is enough.</p>\n<p> </p>\n<p>Bakugou walks through the door, leaving Shouta alone with his thoughts. He takes his seat, sinking against the hard wood and wondering what to do next.</p>\n<p> </p>\n<p>He'll need to figure some things out, maybe sign Izuku up for therapy. Bakugou's already been doing a weekly sit-down after being kidnapped and having his crisis about All Might, but Izuku's been flying under the radar because of his bubbly and determined nature.</p>\n<p> </p>\n<p>He cries over small matters and smiles in the face of danger. They all thought he wore his emotions on his sleeve so they didn't dig deeper under the surface.</p>\n<p> </p>\n<p>And Bakugou... Shouta cannot help but grieve for him as well, because for a child so young to see their best friend treated in such a way...</p>\n<p> </p>\n<p>No wonder he wants to be the strongest.</p>\n<p> </p>\n<p>“<em>I'll be the strongest hero so I'll never be powerless! I'll beat every villain into the ground so they can never hurt anyone again!”</em></p>\n<p> </p>\n<p>His first encounter with a villain wasn't the sludge villain.</p>\n<p> </p>\n<p>It was Izuku's father, who he watched routinely beat his Auntie and best friend. And he was powerless to do anything about it, fueling his desire to grow stronger, fueling his determination to bend his best friend until he was something unbreakable.</p>\n<p> </p>\n<p>What is he meant to do with these kids of his?</p>\n<p> </p>\n<p>Shouta's phone rings and he picks up without looking at the ID. “Shouta! Izuku woke up from a nightmare and he's sorta- well- okay, don't worry, but ahhh-”</p>\n<p> </p>\n<p>“Hizashi,” he says, sitting up straight. “What happened?”</p>\n<p> </p>\n<p>“Well, apparently our little listener still has his quirk,” Hizashi says, sounding like he's panting. “He's not injured- but he's just- very scared. Please come- home.”</p>\n<p> </p>\n<p>Shouta stands and decides to leave his papers there. “I'll be right there.” He throws on his coat and grabs his bag, running as fast as he dares through the halls. He nearly trips over a stray rabbit that hops in his way but keeps running, ignoring the nervous student from General Studies who all but flings their body out of Shouta's way.</p>\n<p> </p>\n<p>The door is open when he gets there, thank god. “Hizashi?” he yells, seeing the blond man on the sofa, hand on his stomach. He walks over, giving him a look-over. “What happened?”</p>\n<p> </p>\n<p>“Had a nightmare. I accidentally touched him while he was having said nightmare.” Hizashi moves his hand to show the wound on his stomach which is, thankfully, not deep enough to require any medical care.</p>\n<p> </p>\n<p>Dammit. <em>Dammit, </em> <em> <b>dammit</b> </em> <em>, </em> <em> <b>DAMMIT</b> </em> <em>.</em></p>\n<p> </p>\n<p>“Go to him,” Hizashi says, pushing Shouta from his side. “He needs you more than me, love.”</p>\n<p> </p>\n<p>Shouta doesn't waste a second in doing so, dropping his bag and coat on the sofa and walking to their second floor. The sound of sobbing reaches his ears from the staircase and he hustles to reach the door, knocking on the door before he enters.</p>\n<p> </p>\n<p>Inside, he sees Izuku seated on the large mattress, rubbing furiously at his eyes. “'m sorry, 'm sorry, didn't mean to hurt 'im!”</p>\n<p> </p>\n<p>Shouta walks forward, watching his charge tense as if to take a blow. He sighs and takes his seat beside the boy. “I know, Izuku. I know. Hizashi isn't mad at you, I promise. I know it's an accident and you would never use your powers to hurt anyone.”</p>\n<p> </p>\n<p><em>Except yourself</em>, he doesn't say.</p>\n<p> </p>\n<p>“Don't send me back,” Izuku says, begging with all the force of a child that's terrified of what awaits them. “Please. Please. I'll be good, I promise.”</p>\n<p> </p>\n<p>Shouta reaches out out a hand cautiously, asking the question before he touches Izuku. Izuku, this time, does not flinch, instead burying himself into Shouta's chest. Shouta runs a hand through Izuku's hair, holding him close.</p>\n<p> </p>\n<p>“Nobody's going to send you back, kiddo,” he says gently. “I promised you, didn't I? We're going to take care of you and keep you safe. This doesn't change that. Hizashi understands and he's not mad at you.”</p>\n<p> </p>\n<p>“Bu-but I-!”</p>\n<p> </p>\n<p>“I know, you accidentally used your quirk. It happens to everyone, trust me. It happened to me as a kid, too.”</p>\n<p> </p>\n<p>Izuku sniffles, pulling back to look up at him. “It did?”</p>\n<p> </p>\n<p>He nods. He doesn't make it a habit to talk about his past for the most part, but... well. Maybe this time, it's okay. “Yeah. I would accidentally erase my dad's quirk and my dad would get even angrier. But that was because I didn't know how to control it yet, so it wasn't my fault and he shouldn't have gotten angry at me for it.”</p>\n<p> </p>\n<p>It's simple to explain it to Izuku because Shouta knows that he needs to get the idea across.</p>\n<p> </p>\n<p>It was less simple to deal with it, to believe that maybe his father's hatred wasn't his own fault. To grow up thinking he was inherently broken for always pissing his father off and then realize that his father was the one in the wrong.</p>\n<p> </p>\n<p>“I can't get angry at you for not controlling your quirk yet either, because that would be silly and hypocritical of me. You're just a kid.”</p>\n<p> </p>\n<p>\n<em>You're just a kid and you've been through too much already.</em>\n</p>\n<p> </p>\n<p>“Do you understand?” Izuku nods. “Do you... want to talk about what your nightmare was about?”</p>\n<p> </p>\n<p>Izuku murmurs, “dreamt of being in a closet.”</p>\n<p> </p>\n<p>Shouta looks around at the dark room. “Why? Were you ever trapped in a closet?”</p>\n<p> </p>\n<p>Izuku, too young to lie, answers honestly. “Only twice when Papa was angry.”</p>\n<p> </p>\n<p>Shouta, to his credit, does <em>not</em> throw the table into the wall and scream, <em>of fucking course that bastard threw you into a closet as punishment!<br></em></p>\n<p> </p>\n<p>Instead, he just holds Izuku closer and closes his eyes. “We're going to get you a nightlight to help you sleep better, okay? And if you have a nightmare, you can come wake me and 'zashi up. I promise we won't get mad.”</p>\n<p> </p>\n<p>Izuku nods and rubs his eyes sleepily. “Papa?” he mumbles, his face still in Shouta's chest. Shouta doesn't freeze and his ears don't burn-<em> they don't, damn you</em>- but he does pay closer attention. “I'm tired. Can I go back to sleep?”</p>\n<p> </p>\n<p>“Sure thing,” Shouta whispers back, placing Izuku on the bed and tucking him in. It is only part of his job as Izuku's primary caretaker in the dorms. Nothing more. “Get some sleep, child.”</p>\n<p> </p>\n<p>He turns to go, but a hand catches his sleeve. “Stay?” Izuku asks, sleepy eyes staring at him.</p>\n<p> </p>\n<p>Shouta looks at the dent in the ceiling that's Hizashi-shaped. “I'll stay,” he finds himself saying without any argument.</p>\n<p> </p>\n<p>Nobody will know, after all.</p>\n<p> </p>\n<p> </p>\n<p>Except Hizashi, who <em>does</em> know and who possesses photo and video evidence.</p>\n<p> </p>\n<p>His phone wakes him at 4:46 am and he squints down at his phone, turning down the brightness so it doesn't blind him. Then blinks.</p>\n<p> </p>\n<p>Then blinks again at the phone wallpaper which is definitely not what it was before he fell asleep. The picture...</p>\n<p> </p>\n<p>The picture's of Shouta in bed with Izuku on his chest. Izuku, naturally, happened to be dressed in an Eraserhead onesie that Uraraka had bought “because it's cute” for Izuku. And which Hizashi had dressed Izuku in because it's warmer than the other clothes. Or so he said.</p>\n<p> </p>\n<p>He unlocks the phone to check his notifications, frowning at the sudden activity in his messages. Shouta sighs with the exhaustion of the ocean upon seeing the barrage of pictures of Izuku and Shouta in their <strike>professional</strike> group chat, pushing down at the mild spike of emotion when he realizes that Hizashi posted all of them.</p>\n<p> </p>\n<p>All.</p>\n<p> </p>\n<p>Of.</p>\n<p> </p>\n<p>Them.</p>\n<p> </p>\n<p>\n<b>zashi</b>\n</p>\n<p>Looks like our caterpillar is becoming a wonderful butterfly of fatherliness! And it only took a dislocated shoulder and a 3 inch wound on my end :D They look so CUTE!</p>\n<p> </p>\n<p>In spite of the early hour, everyone in the group chat is awake, it seems. Even Nezu, who always goes on about good sleeping habits to the students. Hypocrite.</p>\n<p> </p>\n<p>There goes the hope that nobody will see it before work.</p>\n<p> </p>\n<p>\n<b>Y'all Might</b>\n</p>\n<p>How absolutely adorable! Izuku truly trusts you, Aizawa!</p>\n<p> </p>\n<p>The number of emojis after the message makes Shouta's head ache.</p>\n<p> </p>\n<p>\n<b>never safe for work</b>\n</p>\n<p>So cute! Who knew you had a fatherly bone in you? :P ;)</p>\n<p> </p>\n<p>\n<b>zashi</b>\n</p>\n<p>It was so cute I nearly wept from the sight of it!</p>\n<p> </p>\n<p>\n<b>caterpillar</b>\n</p>\n<p>Is it too late to decide that I don't want to be a teacher?</p>\n<p> </p>\n<p>\n<b>teddy bear</b>\n</p>\n<p>Yes.</p>\n<p> </p>\n<p>\n<b>caterpillar</b>\n</p>\n<p>Damn. I thought that since the carnival pays more, I may as well be a clown professionally since you all seem intent on forcing this wig into my hands.</p>\n<p> </p>\n<p>\n<b>zashi</b>\n</p>\n<p>I think he's telling us he loves us.</p>\n<p> </p>\n<p>\n<b>never safe for work</b>\n</p>\n<p>We love you too!!! ;P &lt;3</p>\n<p> </p>\n<p>\n<b>caterpillar</b>\n</p>\n<p>I am going back to sleep.</p>\n<p> </p>\n<p>He turns his phone off, then turns it on again, seeing the picture of him and Izuku staring back at him. It makes his lips turn upwards. It's... a nice photo.</p>\n<p> </p>\n<p>He goes back to sleep, content with the warmth of Izuku's body atop his own.</p>\n<p> </p>\n<p>The weird pull-tugging sensation in his chest continues during the day, even when he's sitting in with 1-A. Hm. Maybe he needs to watch out for symptoms of heartburn.</p>\n<p> </p>\n<p>Maybe it's the coffee.</p>\n<p> </p>\n<p> </p>\n<p>Shouta walks into the common room to retrieve his charge, surprised to see that Todoroki is alone with Izuku. They seem to be talking as Izuku messes with Todoroki's hair. Shouta, still unseen by both, pauses.</p>\n<p> </p>\n<p>“I know it's hard to trust people, but Sir Aizawa... He is not bad,” Todoroki says with that serious blank expression of his. “He protected me as well.”</p>\n<p> </p>\n<p>Izuku looks up at him, frowning at the scar on Izuku's face. “Who hurt you?”</p>\n<p> </p>\n<p>“Enji Todoroki. My... father.”</p>\n<p> </p>\n<p>Todoroki doesn't react to Izuku clipping a girl's accessory into his hair. “And... Mr. Eraser protected you?”</p>\n<p> </p>\n<p>“Yes, he found out about my father's bad behavior and made sure I no longer have to go home to him for breaks,” Todoroki answers, bending his head so Izuku can access the strand of hair he wants. “He... cares a lot about this class, I think. More than he's cared about other classes.”</p>\n<p> </p>\n<p>Other classes weren't targeted by villains numerous times.</p>\n<p> </p>\n<p>Shouta didn't need to watch his other students suffer through catastrophe after catastrophe and then see his students come out on the other side still joking, still smiling, still as determined as ever.</p>\n<p> </p>\n<p>Izuku hums, thinking. “He's like a dad.” Todoroki nods.</p>\n<p> </p>\n<p>“I may not know a lot about fathers, but I am certain that if Sir Aizawa were to become a father, he would be a great one,” Todoroki says, voice certain. From his hiding place, Shouta feels the sudden urge to leave this intimate conversation.</p>\n<p> </p>\n<p>“I hurt Mr. Mic last night. I'm scared that...”</p>\n<p> </p>\n<p>Todoroki looks at him evenly. “You're afraid that they'll give you away or hurt you?” Izuku nods. “Well, I can't promise you anything, but I do know Present Mic. He isn't the type to deal out discipline, and even if he were, I know he wouldn't resort to violence of any sort. And I think it's mostly the same for Sir Aizawa. He's very rational and even though he's strict, it's usually for a good cause. Again, Sir Aizawa was the one who helped me get away from my father. I doubt he would do that unless he thought that what my father did was wrong.”</p>\n<p> </p>\n<p>Hizashi would likely burst into tears himself if he had to punish an errant child using force. He's got a heart as soft as bread.</p>\n<p> </p>\n<p>They fall into silence for a few moments and Shouta almost steps into their line of sight before Todoroki says, “But if either of them- or anyone else- does hurt you, I want you to tell me, okay? I'll protect you, no matter who or what it is that hurts you.”</p>\n<p> </p>\n<p>Izuku hesitates like he isn't sure if he's meant to answer and looks doubtful as if he's heard empty promises before, but he nods all the same.</p>\n<p> </p>\n<p>From where he's standing, Shouta sees Izuku continuing to braid Todoroki's hair messily.</p>\n<p> </p>\n<p>“You're your own person, Midoriya. You're not your father's son any more than I am Endeavor's. You're not alone anymore, I promise. We're here to protect you. You are... family.”</p>\n<p> </p>\n<p>Shouta's heart twinges, remembering that those words are the same ones he'd said to Todoroki some time ago. Izuku nods. A three year old shouldn't be understanding any of this, Shouta muses. But then again, it's Izuku, a hyper-verbal and rather intelligent three year old who's had his world crumble around his knees already.</p>\n<p> </p>\n<p>He clears his throat, getting the attention of the two. Shouta gives Todoroki a small nod. “I hope he behaved alright for you?”</p>\n<p> </p>\n<p>Todoroki looks up, his hair covered in various clips and colorful flowers, half of it braided messily and the other half in a bun. “He behaved excellently, sir.”</p>\n<p> </p>\n<p>There's a moment of silence and Shouta fumbles, but Izuku takes that moment as his chance to place a bright blue flower clip in Shouta's hair. “A-Ah,” he says, gently pressing his fingers against it, wishing with everything in him that none of his students come.</p>\n<p> </p>\n<p>He has a reputation, thank you very much. And although Hizashi has already been trying to ruin his reputation among his coworkers, he can still salvage his reputation as a fearsome teacher.</p>\n<p> </p>\n<p>After all, he knows better than to show weakness to the enemies.</p>\n<p> </p>\n<p>“Pretty,” Izuku says, grinning brightly at him.</p>\n<p><br><br>Todoroki gives Shouta a rare smile. “It is a pretty color, isn't it?”</p>\n<p> </p>\n<p>Shouta doesn't tell them to knock it off.</p>\n<p> </p>\n<p>Enemy or not, he finds himself hesitant to remove the flower from his hair. Izuku will cry if he takes it out, he tells himself, and he is really trying to avoid that.</p>\n<p> </p>\n<p>He has no classes left for the day, so surely it wouldn't harm anyone if he keeps it in.</p>\n<p> </p>\n<p>“Uh, Sir?” Todoroki calls after them when Shouta's about to leave with Izuku in his arms. Shouta turns back, looking over to see Todoroki staring at him earnestly. “Thank you for... everything.”</p>\n<p> </p>\n<p>Shouta nods at him, giving the student a soft smile. “You're welcome, Todoroki.”</p>\n<p> </p>\n<p>This class is definitely different from the rest. He didn't need to take two students and make them his own charge before, and he certainly never had to take care of his student because they got de-aged before.</p>\n<p> </p>\n<p>He's never been woken up by half of his class at 3 am because their mute member lost his bunny.</p>\n<p> </p>\n<p>He's never had his class worm their way into his heart with their words and actions.</p>\n<p> </p>\n<p>He's never had a class go through microwaves like string cheese.</p>\n<p> </p>\n<p>He's never been the father of so many idiots.</p>\n<p> </p>\n<p>But in spite of the headaches and gray hairs they give him, he isn't really complaining. They're family. They're his kids. And he loves each and every one of them.</p>\n<p> </p>"
}