{
  "id": "22613167",
  "url": "https://archiveofourown.org/works/22613167?view_full_work=true",
  "author": [
    "sarahyyy"
  ],
  "title": "soft-hearted",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "魔道祖师 - 墨香铜臭 | Módào Zǔshī - Mòxiāng Tóngxiù",
    "陈情令 | The Untamed (TV)"
  ],
  "relationships": [
    "Lan Zhan | Lan Wangji/Wei Ying | Wei Wuxian"
  ],
  "characters": [
    "Wei Ying | Wei Wuxian",
    "Lan Zhan | Lan Wangji"
  ],
  "additional_tags": [
    "Alternate Universe",
    "Childhood Friends",
    "Hurt/Comfort",
    "Getting Together",
    "First Kiss",
    "Wedding Fluff"
  ],
  "language": "English",
  "series": "",
  "published": "2020-02-08",
  "completed": null,
  "words": "6,465",
  "chapters": "1/1",
  "comments": "414",
  "kudos": "17,643",
  "bookmarks": "3,904",
  "hits": "130,320",
  "summary": "<p>Lan Zhan finds himself returning the smile. “Go home,” he urges gently, because it’s cold, and Wei Ying does not look like he’s dressed warmly enough to be out in the streets like this. </p>\n<p>Wei Ying’s smile dims. “A-Ying sleeps here when it’s cold,” he tells Lan Zhan. “When it’s summer, A-Ying likes to stay by the pond!” </p>\n<p>Lan Zhan frowns, looking at the alley around them. His stomach churns at the thought of leaving Wei Ying there. “Has Wei Ying eaten?” </p>\n<p>(Or, the one where Wei Wuxian grows up in the Lan Sect.)</p>",
  "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>God, okay, so I was trying to hard to get a fic out for 元宵, and yay, I did it! 元宵快乐, my buddies! &lt;3</p>\n<p>YES, this whole fic has been written just to cater to my <i>gege</i> problem, no I will not take any criticism. NO PLOT, JUST GEGE FLUFF, WE DIE LIKE MEN.</p>\n<p>As usual, you can find me <a href=\"https://sarah-yyy.tumblr.com/post/190714096583/soft-hearted-sarahyyy-%E9%AD%94%E9%81%93%E7%A5%96%E5%B8%88-%E5%A2%A8%E9%A6%99%E9%93%9C%E8%87%AD-m%C3%B3d%C3%A0o\" rel=\"nofollow\">here on tumblr</a>, come say hi! :D</p>",
  "text": "<p>1.</p>\n<p>Lan Zhan is five when he comes across Wei Ying for the first time. </p>\n<p>Wei Ying’s eyes are drawn to his rattle drum, staring at the toy as though it is his heart’s desire. </p>\n<p>Lan Zhan’s grip on the rattle drum tightens instinctively, and he immediately chides himself for his selfishness. The rules speak of being generous, of performing acts of chivalry, of acting virtuously. Lan Zhan reflects on the rules, and offers the toy to Wei Ying.</p>\n<p>“For me, <i>gege</i>?” Wei Ying asks, and his face lights up with the biggest smile. </p>\n<p>Lan Zhan finds himself returning the smile. “Go home,” he urges gently, because it’s cold, and Wei Ying does not look like he’s dressed warmly enough to be out in the streets like this. </p>\n<p>Wei Ying’s smile dims. “A-Ying sleeps here when it’s cold,” he tells Lan Zhan. “When it’s summer, A-Ying likes to stay by the pond!” </p>\n<p>Lan Zhan frowns, looking at the alley around them. His stomach churns at the thought of leaving Wei Ying there. “Has Wei Ying eaten?” </p>\n<p>—</p>\n<p>Uncle and <i>dada</i> are both startled when Lan Zhan brings Wei Ying back to the inn. </p>\n<p>Dada looks as upset as Lan Zhan feels when Lan Zhan recounts Wei Ying’s circumstances. </p>\n<p>“<i>Shufu, dada</i>,” Lan Zhan says, sinking to his knees, “please allow Zhan’er to take Wei Ying back to Cloud Recesses.” </p>\n<p>His uncle and brother exchange looks. </p>\n<p>“Zhan’er has promised Wei Ying he can go back home with us,” Lan Zhan says insistently, when they do not reply. “One should not break promises. Zhan’er does not want to break his promise.” </p>\n<p>Uncle’s gaze softens. “Son of Cangse Sanren, you say?” he asks, turning to Wei Ying, who is quietly kneeling by Lan Zhan, fingers fisted tightly in Lan Zhan’s robes, as if he’s afraid that if he lets go, he will be chased away.</p>\n<p>Ridiculous. Lan Zhan will not let that happen.</p>\n<p>Wei Ying nods. “Yes, <i>xiansheng</i>.” </p>\n<p>Uncle hums. </p>\n<p><i>Dada</i> smiles at Wei Ying. “Were you out in the cold for very long, A-Ying?” he asks, and then beckons for Wei Ying to go to him. </p>\n<p>Lan Zhan watches as his brother pours out a glass of warm tea for Wei Ying, pressing it to his hands, urging him to drink and keep warm, and lets out a breath he wasn’t even aware he was holding. His brother will take care of Wei Ying the same way <i>dada</i> takes care of him. </p>\n<p>“Wei Ying hasn’t eaten all day,” Lan Zhan pipes up. </p>\n<p>His uncle’s breath stutters. He turns to dada. “Have the kitchen prepare a few dishes,” he says, before turning to Wei Ying. “What does Wei Ying like to eat?”</p>\n<p>Wei Ying’s eyes go wide at the question. “<i>Xiansheng</i> does not have to trouble himself,” he says quickly. “A-Ying is used to not eating often. A-Ying can wait till morning, when everyone else is eating too. Or… Or…if <i>xiansheng</i> has some leftover bread, A-Ying will be happy with that.”</p>\n<p>“Wei Ying should answer the question asked,” Lan Zhan reminds him.</p>\n<p>“Mn,” <i>dada</i> says gently, too. “It is considered rude not to answer a question when asked,” he teases with a smile. </p>\n<p>Wei Ying’s lip wobbles. “A-Ying is sorry,” he says quietly. And then, softer still, “A-Ying likes dumplings.”</p>\n<p>His brother smiles. “I will have the kitchen prepare a few varieties of dumplings for supper,” he declares. </p>\n<p>—</p>\n<p>They take Wei Ying back to Cloud Recesses when they leave.</p>\n<p>—</p>\n<p>Wei Ying is understandably attached to Lan Zhan, a fact which Lan Zhan finds comforting himself. Everyone else would prefer the company of his brother, who is kinder and freer with his smiles, but Wei Ying sticks to Lan Zhan’s side, and is most at ease in Lan Zhan’s presence. </p>\n<p>Wei Ying acts cautiously when he’s in Cloud Recesses, the way he had in the inn. He tries his best not to be a bother, because he still thinks that at any moment, they could kick him out, and he will have to go back to his life on the streets. </p>\n<p>A most ridiculous notion. There are many rules that would dictate the Sect’s abilities to expel someone Cloud Recesses, not to mention how unjust it would be to send a <i>child</i> back to the streets with no care for his well-being. </p>\n<p>Wei Ying is here to stay, and while both Lan Zhan and <i>dada</i> try to express this to him often, Wei Ying still tries his best not to impose. </p>\n<p>Lan Zhan hears a soft knock on his door one night when it’s storming outside, just before <i>hai shi</i>. </p>\n<p>“Wei Ying?” Lan Zhan murmurs, when he opens the door to find Wei Ying standing outside, arms wrapped around himself tightly.</p>\n<p>“<i>Gege</i>,” Wei Ying says. “Can I- Will it be too much trouble-”</p>\n<p>Lan Zhan takes him by the hand, and leads him into the <i>jingshi</i>. “Take time to formulate your thoughts, speak slowly, and make your intent clear,” he tells Wei Ying, repeating the words his brother had taught him.</p>\n<p>Wei Ying is quiet for a moment, considering Lan Zhan’s words. </p>\n<p>“A-Ying doesn’t like it when it storms,” Wei Ying says. “When it thunders, A-Ying is afraid. Can A-Ying stay with <i>gege</i> tonight?” </p>\n<p>Lan Zhan’s lips tip up, just slightly. Wei Ying is a fast learner. “Mn.”</p>\n<p>When the bell sounds outside, signalling that it is <i>hai shi</i>, Lan Zhan blows out the candles, and climbs into bed, making sure to leave enough space for Wei Ying to join him. </p>\n<p>He is startled when Wei Ying settles on the ground by Lan Zhan’s bed instead, curling into a ball in an effort to keep warm. </p>\n<p>“Wei Ying,” he says. </p>\n<p>Wei Ying sits up. “Huh?”</p>\n<p>“The bed is wide enough to share,” he tells Wei Ying. “You don’t have to sleep on the ground.” </p>\n<p>Wei Wuxian beams at him again, that same wide smile that had tugged at all of Lan Zhan’s heartstrings the first time they met, and climbs up onto the bed. He falls asleep quickly, cuddling up close to Lan Zhan.</p>\n<p> </p>\n<p>2.</p>\n<p>Lan Zhan is six, and he hasn’t seen his mother in too long.</p>\n<p>It is customary for him and <i>dada</i> to visit Mother every full moon, but <i>dada</i> did not bring him the last moon, and Uncle had forbidden them the moon before. </p>\n<p><i>Dada</i> tells him that they will not be able to see Mother again. Lan Zhan is not stupid — he knows that he has been unruly, has been neglectful of sect rules, has disappointed the elders and Uncle and now Mother, but Lan Zhan knows he can do better, and he <i>knows</i> Mother will forgive him if <i>dada</i> and Uncle just let him apologise to her. </p>\n<p><i>Dada</i> is sad when Lan Zhan tells that to him. He, too, must be disappointed in Lan Zhan. </p>\n<p>It does not matter. </p>\n<p>Lan Zhan will set things straight himself. </p>\n<p>He makes the track to Mother’s gentian house himself. </p>\n<p><i>Dada</i> had admonished him not to come unannounced and unauthorised before, when Lan Zhan’s feet would take him of their own volition to the edges of Mother’s hut, but surely <i>dada</i> will understand just this once. </p>\n<p>He knocks, and waits for Mother to answer; she always used to in the past, even on the days where the moon was not full and Lan Zhan was not supposed to come, always at least with a <i>‘Zhan’er, be good and go back, hmm?’</i>, even if she would not open the door. </p>\n<p>Mother does not answer. She must be so upset at Lan Zhan. </p>\n<p>His lips wobble. The thought of Mother being disappointed in him makes his chest <i>ache</i>. </p>\n<p>He takes a couple of steps back, and sinks to his knees. “Mother,” he calls out, because she must be listening. “Mother, Zhan’er apologises for his actions.” </p>\n<p>He waits for her to ask for an elaboration, the way she always does. She takes pleasure out of coaxing words out of Lan Zhan, and Lan Zhan similarly takes pleasure in Mother’s gentle, self-satisfied smile when she gets what she wants. </p>\n<p>She does not ask. </p>\n<p>“Zhan’er deliberately missed a class last week,” Lan Zhan says urgently, eager now to clear the air, to draw a response, <i>anything</i>. “Wei Ying was ill, and he did not want to go. He asked Zhan’er not to go too, and Zhan’er… Zhan’er wanted to stay with Wei Ying.” </p>\n<p>Lan Zhan had brought Wei Ying to see Mother just the once, and Mother had smiled and patted them both on the heads. She had said that she was happy that they were friends, and had told them to look after each other. </p>\n<p>Surely Mother would understand why Lan Zhan missed his class. Surely now she would talk to Lan Zhan.</p>\n<p>“Mother?” he calls out.</p>\n<p>She does not respond. </p>\n<p>—</p>\n<p>Lan Zhan doesn’t keep track of how long he kneels before Mother’s door, but it must be past lunchtime now, because <i>dada</i> comes by, and crouches down by him. “Come,” he says, gentle. “It is cold out here, and you must be hungry.”</p>\n<p>Lan Zhan shakes his head. If he kneels for long enough, Mother may be convinced that he’s repented, and she may come out to see him. </p>\n<p>“Zhan’er, you will catch a cold out here, and what then?” </p>\n<p>Lan Zhan shakes his head again. This time, he hears <i>dada</i>’s deflated sigh, before <i>dada</i> slips out of his outer robe, and places it over Lan Zhan’s shoulder. </p>\n<p>He comes back twice more. Once with hot tea that he makes Lan Zhan drink, and another time with osmanthus cake that Lan Zhan eats two mouthfuls of. Lan Zhan is grateful for <i>dada</i>, grateful that <i>dada</i> has not forced him to leave before he has earned Mother’s forgiveness. </p>\n<p>—</p>\n<p>The third time his solitude is interrupted, it’s Wei Ying who comes. </p>\n<p>Wei Ying takes one look at him, and then sinks down to his knees in the snow right next to Lan Zhan. </p>\n<p>“You should go back, Wei Ying,” Lan Zhan says quietly. </p>\n<p>“A-Ying will wait with <i>gege</i>,” Wei Ying says firmly. “It’s cold if you’re outside and it’s snowing. Colder still if you’re lonely.” </p>\n<p>He speaks from experience, Lan Zhan thinks, and the ache in his chest worsens. </p>\n<p>“I am not lonely,” Lan Zhan tells him, in an effort to make Wei Ying go back to where it’s warm. The sun will set soon, and it will get colder still. Lan Zhan has to be here to earn forgiveness, but Wei Ying has done no wrong. </p>\n<p>Wei Ying shakes his head. “A-Ying will wait with <i>gege</i>,” he repeats. </p>\n<p>They kneel outside the gentian house until their legs turn numb, and Lan Zhan is hungry and sleepy and cold from being out for so long. Wei Ying must be tired too, because he’s started to sway, listing towards Lan Zhan, even though he doesn’t utter a single word to complain. </p>\n<p>“Wei Ying,” Lan Zhan murmurs. “Go back.”</p>\n<p>“A-Ying wants to stay with <i>gege</i>,” Wei Ying’s reply comes, as resolute as it was hours ago. </p>\n<p>Wei Ying’s kneeling pose loses its form at some point, and he ends up leaning against Lan Zhan heavily. The extra weight brings some discomfort, but Lan Zhan does his best to adjust, unwilling to disrupt Wei Ying’s sleep. </p>\n<p>Wei Ying’s hand brush against his — his skin is cold to the touch, and Lan Zhan belatedly realises that Wei Ying is not dressed as warmly as he is. </p>\n<p>Lan Zhan should keep kneeling. If he does, maybe Mother will forgive him and agree to see him. </p>\n<p>But he is also very concerned about how Wei Ying’s skin feels unnaturally cold. Mother would not want him to keep kneeling out here, if it meant that Wei Ying would get sick, he thinks. </p>\n<p>He shakes at Wei Ying lightly. “Wei Ying. <i>Wei Ying</i>.” </p>\n<p>Wei Ying blearily opens his eyes. “<i>Gege</i>? Will we go home now?”</p>\n<p>Lan Zhan nods, and makes the track back to the <i>jingshi</i> with Wei Ying’s chilly hand in his. </p>\n<p>—</p>\n<p>Wei Ying falls ill as a result of being out in the cold for so long. </p>\n<p>Lan Zhan expects to be admonished for it, but Uncle does not say a word. Still, Lan Zhan can recognise that it is his fault, and he makes amends to Wei Ying the way he knows Wei Ying will appreciate the most — he visits Wei Ying every day that Wei Ying is stuck bedridden. </p>\n<p>“<i>Gege</i>, you look sad,” Wei Ying says softly one morning when Lan Zhan brings breakfast for him. “Why is <i>gege</i> sad?”</p>\n<p>Lan Zhan looks away from Wei Ying’s earnest eyes. It is a long moment before he says, “<i>Dada</i> says Mother is not coming back.”</p>\n<p>Wei Ying’s face falls. He drops the steamed bun in his hand quickly in favour of pulling Lan Zhan into a tight hug. “My <i>baba</i> and <i>mama</i> didn’t come back too,” he whispers quietly to Lan Zhan, even though it’s not a secret. Lan Zhan was the one who found him in the streets, alone, afterall. “<i>Gege</i> will be sad and lonely for awhile, but remember, <i>gege</i> still has <i>da-gege</i> and A-Ying!” </p>\n<p>The words comfort him. </p>\n<p>Lan Zhan lets himself return Wei Ying’s hug. </p>\n<p> </p>\n<p>3.</p>\n<p>Lan Zhan is nine when Wei Ying seems to have lost all his fear of being chased out of Cloud Recesses. Wei Ying starts being bolder, wilder, <i>freer</i>, a sure sign that he has finally accepted that Cloud Recesses is his home, and that he belongs there just as much as anyone else does.</p>\n<p>It’s a comforting thought, one that brings the smallest of smiles to Lan Zhan’s lips. </p>\n<p>It’s nice, having Wei Ying around. Wei Ying is loud and likes to laugh, but is quick to school himself to the perfect picture of a Lan Sect disciple whenever Uncle rounds the corner. His charade never really convinces Uncle, but Lan Zhan knows that Uncle has a soft spot for Wei Ying, even if it’s just for the fact that Wei Ying is the only one who knows how to sweet talk him. </p>\n<p>Wei Ying spends a lot of his nights in the <i>jingshi</i>, in Lan Zhan’s bed. </p>\n<p>“You have your own room,” Lan Zhan says one night, when Wei Ying clambers onto his bed, tugging half of Lan Zhan’s covers over as he goes. </p>\n<p>“Yours is better,” Wei Ying says simply, waving a hand to put the candle out. </p>\n<p>Lan Zhan allows a small shake of his head. “They are the same.”</p>\n<p>“Wrong,” Wei Ying whispers, and then shifts closer. He doesn’t like being cold — Lan Zhan thinks it maybe reminds him of the time he had to spend in the streets. “Your room has <i>you</i> in it. That automatically makes it the best room,” Wei Ying reasons, throwing an arm over Lan Zhan, and pressing himself close. </p>\n<p>Lan Zhan’s lips curl up slightly. “It is <i>hai shi</i> now. Go to bed.”</p>\n<p>“Mn, <i>gege</i>,” Wei Ying murmurs, and does as Lan Zhan says. </p>\n<p> </p>\n<p>4.</p>\n<p>Lan Wangji is already fifteen when Wei Ying asks him to pick out a courtesy name for him, two nights before his birthday.</p>\n<p>Lan Wangji’s courtesy name was picked out for him after long discussions between Lan Qiren and Lan Xichen, as is customary for his family. Courtesy names are a gift from one's closest family, in the Lan Sect. </p>\n<p>That Wei Ying would ask <i>him</i> brings a deep sense of satisfaction, even though it does not exactly come as a surprise. Even Lan Qiren and Lan Xichen had been dropping discrete suggestions. </p>\n<p><i>Zhili</i> (知礼), for instance, would be a name that would hopefully instill some sense of propriety and etiquette in Wei Ying, Lan Qiren had hinted. Lan Xichen had merely grinned at that, and patted Lan Wangji gently on the thigh to remind him to wipe the incredulous look on his face off before their uncle noticed. </p>\n<p>As Lan Wangji was leaving the <i>hanshi</i> that day, Lan Xichen had explained that perhaps he should think of a name that would encompass all his wishes for Wei Ying. A courtesy name will stick with Wei Ying forever, it should have a loved one’s blessings deeply imbued into it. </p>\n<p>It is good advice — his brother has a knack for telling him all the important things he needs to hear. </p>\n<p>“What about Wuxian?” Lan Wangji asks. </p>\n<p>It’s an auspicious name, he thinks, and he hopes Wei Ying likes it. He would wish Wei Ying a bountiful life, a life filled with immeasurable happiness. A life without envy, because Wei Ying should always have everything he wants. Everything that he could possibly need, Lan Wangji will always find a way to procure for him. </p>\n<p>A life without envy would suit Wei Ying, he thinks. </p>\n<p>“Wuxian?” Wei Ying echoes. He sits up slowly, tries the name out on his tongue. “<i>Wuxian</i>. Without envy. Wei Wuxian.”</p>\n<p>“Mn.”</p>\n<p>Wei Ying smiles at that. “Well, it’s accurate, I’ll say. Who do I have to envy? I have everything!” He lets out a soft laugh. “If anything, everyone should be envious of me.” He lies back down, pillows his head on Lan Wangji’s chest. “Wei Wuxian,” he murmurs quietly again. “I like it,” he decides. “Thank you, <i>gege</i>.” </p>\n<p>Lan Wangji smiles. “Mn,” he hums. “Go to sleep now, Wei Wuxian.”</p>\n<p>Wei Ying looks up at that, scrunching his nose. “<i>Gege</i> has to keep calling me Wei Ying,” he says, petulant. </p>\n<p>“Wei Ying,” Lan Wangji allows, voice gentle.</p>\n<p>“Mn,” he tells Lan Wangji, tucking himself back neatly into Lan Wangji’s arms. He lets out a sleepy yawn. “I like it when you say my name like that.”</p>\n<p>“Okay,” Lan Wangji says, and holds Wei Ying close. “Then I will keep saying it like that.”</p>\n<p> </p>\n<p>5.</p>\n<p>Lan Wangji is sixteen when the disciples from the other sects come, and Wei Wuxian gets drunk for the first time. </p>\n<p>He comes stumbling into the <i>jingshi</i> when it happens, past <i>zi shi</i>, breath smelling of alcohol when he climbs into Lan Wangji’s bed and presses himself close. </p>\n<p>“Consumption of alcohol is not allowed in Cloud Recesses,” Lan Wangji tells him. </p>\n<p>“I only had a bit,” Wei Wuxian says, pouting slightly. </p>\n<p>“Who?”</p>\n<p>“If I tell you, will you promise not to report them?” Wei Wuxian asks warily, much to Lan Wangji’s exasperation. </p>\n<p>Lan Wangji has no intention of reporting any of Wei Wuxian’s drinking buddies. Reporting them mean that Wei Wuxian will get into trouble too. Wei Wuxian already gets into too much trouble without Lan Wangji having to tattle on him. </p>\n<p>“Mn.”</p>\n<p>Satisfied, Wei Wuxian tells him, “Qinghe Nie Sect, Nie Huaisang. Yunmeng Jiang Sect, Jiang Cheng.” </p>\n<p><i>Jiang Cheng.</i> </p>\n<p>He means Jiang Wanyin, the young master and heir of the Jiang Sect. </p>\n<p>Wei Wuxian’s use of Jiang Wanyin’s birth name brings an unpleasantness in Lan Wangji’s chest. </p>\n<p>“You should not partake in their tomfoolery,” he admonishes, instead of asking how Wei Wuxian has gotten so close to Jiang Wanyin so quickly. </p>\n<p>“Perhaps <i>er-gege</i> should join us next time,” Wei Wuxian suggests with an impish grin. </p>\n<p>Lan Wangji closes his eyes, and does not reply. He tries hard not to focus on the fact that there will be a next time. </p>\n<p>“<i>Gege</i>,” Wei Wuxian says by his ear. “Nie-<i>xiong</i> showed me some books, earlier.” He shifts closer to Lan Wangji as he speaks, close enough that his lips touch the shell of Lan Wangji’s ear. </p>\n<p>Lan Wangji can feel his ears burn from the touch of Wei Wuxian’s lips. </p>\n<p>“They were very provocative books,” Wei Wuxian adds. </p>\n<p>“<i>Wei Ying</i>.” Lan Wangji sits up, dislodging Wei Wuxian who is half splayed across his body in the process. “What was the purpose of Nie Huaisang showing you the books?” he asks, voice low, furious. </p>\n<p>Did Nie Huaisang try-</p>\n<p>Would he <i>dare</i>? </p>\n<p>Would Wei Wuxian have said <i>yes</i>? </p>\n<p>Wei Wuxian smiles at him, and tugs him back down onto the bed. “It’s not what you’re thinking,” he tells Lan Wangji.</p>\n<p>Lan Wangji stares at him. “You didn’t...”</p>\n<p>“I didn’t,” Wei Wuxian confirms. “I wouldn’t want to do any of those things with Nie Huaisang.”</p>\n<p>Lan Wangji lets out a breath he hadn’t known that he was holding. </p>\n<p>“I only want to do them with you, <i>gege</i>,” Wei Wuxian adds, voice so soft Lan Wangji almost thinks that he’s imagined it, except Wei Wuxian’s lips brush against the corner of Lan Wangji’s lips. <i>A kiss.</i> “It’s past <i>hai shi, gege</i>. You must be tired. Let’s rest?” </p>\n<p>Lan Wangji doesn’t sleep that night. </p>\n<p> </p>\n<p>6.</p>\n<p>Lan Wangji is seventeen, and his heart is beating to a rhythm he cannot seem to understand. His thoughts have been a mess since Wei Wuxian kissed him two weeks ago, and since then, meditation has been difficult, because he cannot find peace. </p>\n<p>Wei Wuxian <i>kissed</i> him, and implied that he’d wanted to do <i>other things</i> with Lan Wangji, and-</p>\n<p>And then he’d woken up with a hangover, and promptly forgot everything that he’d said to Lan Wangji. </p>\n<p>Lan Wangji hadn’t reminded him of it; he isn’t sure how he could. </p>\n<p>He does what he does best in situations that make him feel off-kilter. He seeks solitude. </p>\n<p>—</p>\n<p>Lan Wangji’s quest for solitude is doomed from the start, knowing Wei Wuxian’s tendencies to seek him out when he least wants to be found. Lan Wangji knows this to be true, and yet, his stomach still churns when Wei Wuxian comes running down the steps to the cold springs. </p>\n<p>“<i>Gege!</i>” he calls out cheerily, already undoing his sash, but frowns when Lan Wangji hoists himself out of the water, and dresses quickly. “Huh? Are you already done? I thought we could soak together for awhile!” He pouts at Lan Wangji, and crosses over to him. “You’ve not been around much recently, <i>gege</i>.”</p>\n<p>“<i>Shufu</i> has asked me to help with copying scriptures,” Lan Wangji tells him, which is not exactly a lie. He doesn’t tell Wei Wuxian that he’d been the one to volunteer to spend more of his time in the library pavillion. </p>\n<p>Wei Wuxian makes a face. “<i>Xiansheng</i> is too much,” he complains half-heartedly. “You can copy scriptures any other time, but here he is, keeping you from bonding with the visiting disciples. They’ll be gone in a couple of weeks.” </p>\n<p>He doesn’t miss the disappointment in Wei Wuxian’s voice, and wonders if it’s Jiang Wanyin that Wei Wuxian cannot bear to see leave. </p>\n<p>“Wei Ying should spend time with them before they leave, then.” </p>\n<p>“I am,” Wei Wuxian tells him. “But I miss <i>gege</i> too,” he murmurs quietly, and then wraps his arms around Lan Wangji. </p>\n<p>Lan Wangji’s heart skips a beat. </p>\n<p>“<i>Gege</i>, let’s spend time together today? I’ve been invited to join the Jiang siblings for dinner, but I’m sure Yanli-<i>jie</i> will not mind an extra mouth to feed.” </p>\n<p>“You spend a great deal of time with the Jiang siblings,” Lan Wangji says, instead of replying.</p>\n<p>“Mn!” Wei Wuxian hums. “Jiang Cheng is fun to bully, and Yanli-<i>jie</i> makes the most delicious food!” He peers up at Lan Wangji. “She’s very easy to talk to. She just helped me to figure out a lot of things about myself recently.” </p>\n<p>“Oh,” Lan Wangji says, inexplicably hurt. Lan Wangji is used to being the person Wei Wuxian would go to to speak of his troubles. He forces himself to smile. “That’s good.” </p>\n<p>Wei Wuxian beams at him. “Will you come to dinner, then?” </p>\n<p>“I should not impose where I’m unwanted,” Lan Wangji says. </p>\n<p>Wei Wuxian’s smile slips. “<i>Gege</i>?” His arms tighten minutely where they’re clasped around Lan Wangji’s midriff. “Has Wei Ying done something to annoy <i>gege</i>?” </p>\n<p>Lan Wangji looks away from him. “Of course not.” </p>\n<p>“I went to the <i>jingshi</i> last night, but the door was bolted,” he says quietly. “You never used to lock the door until after I arrived.” </p>\n<p>Lan Wangji hadn’t thought that Wei Wuxian would notice; after all, it’s been several days since the last time he came to the <i>jingshi</i> at night to share Lan Wangji’s bed. </p>\n<p>“If Wei Ying has done anything to make <i>gege</i> upset…” Wei Wuxian’s lips turn down into a frown. “Then <i>gege</i> can punish me however he wants!”</p>\n<p>“Unnecessary,” Lan Wangji says. “I’m not upset.”</p>\n<p>“I could copy scriptures with you?” Wei Wuxian suggests. “My writing is not as neat, but I will try hard to make it look neater. If <i>gege</i> is worried I will be too disruptive, you can even use the silencing charm on me!” </p>\n<p>“Wei Ying,” Lan Wangji says. “I’m really not upset.”</p>\n<p>“Then why don’t you want to spend time with me anymore?” Wei Wuxian asks, and oh, his eyes are shining, wet with tears. His voice wobbles when he says, “Why don’t you <i>like me</i> anymore?” </p>\n<p>Lan Wangji feels <i>terrible</i>. “I’m not-”</p>\n<p>“Lying is forbidden in Cloud Recesses,” Wei Wuxian interjects, before Lan Wangji is able to insist, for the third time, that he isn’t upset. “Please tell me what’s wrong, <i>gege</i>.” </p>\n<p>Lan Xichen has always told him that the trick to finding all the right words is to formulate his thoughts, to speak slowly, to make his intent clear. Lan Wangji holds onto these precepts, and tries to put his thoughts into words. </p>\n<p>“I like you,” Lan Wangji confesses. He closes his eyes, takes a deep breath, then reopens them slowly, and says it again, “I like you, Wei Ying.” </p>\n<p>Wei Wuxian’s eyes go wide with surprise. </p>\n<p>“I like you, and I don’t know what I should do about it,” Lan Wangji tells him. “It’s...difficult for me to decide what I should do, not knowing how you feel about me.” </p>\n<p>“Is it not apparent?” Wei Wuxian whispers. “How I feel about you, is that not the most obvious thing under the sky?” </p>\n<p>Lan Wangji shakes his head. “No,” he chokes out, “it is not.” </p>\n<p>“Then you should ask me,” Wei Wuxian tells him, and he’s smiling now, the same wide, happy smile that makes Lan Wangji’s heart feel too full. “Be proactive in seeking knowledge,” he quotes the sect rules. </p>\n<p>Lan Wangji can feel himself shake. “Wei Ying,” he breathes. </p>\n<p>“<i>Gege</i>,” Wei Wuxian returns, closing the distance between them, and taking Lan Wangji’s trembling hands in his. “Ask me, <i>gege</i>.”</p>\n<p>Lan Wangji takes a grounding breath, and steels himself. “Wei Ying, do you return my feelings?” </p>\n<p>Wei Wuxian’s eyes crinkle. “Of course I do,” he tells Lan Wangji. “I want to hold your hand, and kiss your lips, and have you hold me in bed every night. I want to spend all my time with you, because every minute I spend away from you feels too long. I want you to smile at me like- Yes, like <i>this</i>, all the time! <i>Gege</i>, I’ve felt this way for so long! You can’t possibly imagine how long.”</p>\n<p>“You’ve already kissed me.” It feels suddenly important to tell Wei Wuxian.</p>\n<p>Wei Wuxian’s jaw drops. “What? <i>When?</i>” </p>\n<p>“That night you got drunk with Nie Huaisang and Jiang Wanyin,” he reminds Wei Wuxian, and smiles when Wei Wuxian’s cheeks flush. </p>\n<p>“I thought that was an alcohol-induced fevered dream,” he confesses. And then scrunches his nose. “<i>Gege</i>, was it a good kiss?” </p>\n<p>Lan Wangji feels the tips of his ears grow hot. “I wouldn’t know,” he says. “I don’t have any other kisses to compare to.”</p>\n<p>Wei Wuxian laughs, a happy, bright sound that reverberates around them, and makes Lan Wangji’s heart sing. “We can fix that,” he tells Lan Wangji, and then kisses him and kisses him and <i>kisses him</i>. </p>\n<p> </p>\n<p>7.</p>\n<p>Lan Wangji is eighteen the first time he is…<i>intimate</i> with Wei Wuxian. </p>\n<p>He wakes up the next morning to a naked Wei Wuxian curled in his arms, breathing soft and even, and flushes at the marks he can see that he’s left on Wei Wuxian’s skin. He would be mortified, if it weren’t for the fact that Wei Wuxian was egging him on last night, urging him to mark him up properly. </p>\n<p>At least he’s had the foresight to not leave marks where Wei Wuxian’s robes will not be able to cover. </p>\n<p>“Wei Ying,” he whispers, pressing his lips to Wei Wuxian’s brow. “Wei Ying, you have to wake up, or we’ll be late for class.”</p>\n<p>Wei Wuxian lets out a sleepy whine, and shifts closer to Lan Wangji. “I’m <i>tired</i>,” he says. “<i>Gege</i> tired me out last night.”</p>\n<p>Lan Wangji can feel his ears burn. He should have stopped after the first time, but he had <i>wanted</i>, and Wei Wuxian had been willing. </p>\n<p>He gently pries himself out of Wei Wuxian’s hold, and tucks the covers back over Wei Wuxian. “Rest,” he murmurs. “I will tell <i>shufu</i> you are unwell.”</p>\n<p>Wei Wuxian’s eyes open at that, and he lets out a delighted laugh. “<i>Gege</i>, you pamper me!” he says, grinning. “If this is the treatment I get after a night of being very well-loved by my <i>er-gege</i>, then I want to be bedded by you every night.”</p>\n<p>Lan Wangji leans down so their noses are touching. “Wei Ying should learn not to tease.”</p>\n<p>“Then Lan Zhan should learn not to give me opportunities to tease,” Wei Wuxian murmurs back, and then shifts so he can press his lips to Lan Wangji’s, and sighs into the resulting kiss. </p>\n<p>Lan Wangji takes stock of the current situation, runs a quick count in his head, and presses Wei Wuxian back to the bed. If they are quick, he will make it to class in time. </p>\n<p>Lan Wangji is almost late for class, but he gets there in time anyway, with a very self-satisfied Wei Wuxian pressed to his side. </p>\n<p> </p>\n<p>8.</p>\n<p>Lan Wangji is nineteen, and he knows Wei Wuxian as well as he knows himself now. </p>\n<p>He knows the punched-out gasp Wei Wuxian lets out whenever Lan Wangji enters him, knows the taste of Wei Wuxian’s lips, knows the brightness in wei Wuxian’s eyes whenever he is about to urge Lan Wangji to go faster, harder, deeper. </p>\n<p>He knows all the different ways Wei Wuxian’s lips can curve into variations of smiles, knows his mind well enough to anticipate Wei Wuxian’s words before he voices them, knows the kindness that Wei Wuxian radiates, knows the beat of Wei Wuxian’s heart.</p>\n<p>He knows <i>Wei Wuxian’s heart</i>, and he knows his own. </p>\n<p>It is because he knows, that he understands that the racing of his own heart whenever Wei Wuxian smiles at him is an indicator that he’s in love. </p>\n<p>It is easy to take the next step, once he has reached the correct conclusions. </p>\n<p>“Hand,” Lan Wangji murmurs, one night when they are in bed, satiated from their earlier bout of activities. </p>\n<p>Wei Wuxian passes Lan Wangji his left hand. “Does <i>gege</i> have a gift for me?” he asks curiously. </p>\n<p>Lan Wangji looks him in the eye, and then very deliberately picks up his discarded forehead ribbon, lying by the side. </p>\n<p>Wei Wuxian’s eyes widen, his lips part in surprise. </p>\n<p>He looks so lovely that Lan Wangji can’t quite help the half-smile that tugs at his lips as he carefully winds the forehead ribbon around Wei Wuxian’s wrist, finishing off with an intricate bow. </p>\n<p>He hasn’t had a chance to practise the knot, not with Wei Wuxian’s presence being a constant around him, but he has read the ancient scrolls, and he has observed the diagrams carefully. </p>\n<p>“Lan Zhan, you-” Wei Wuxian manages to choke out. </p>\n<p>“Mn.” </p>\n<p>Wei Wuxian stares at the forehead ribbon tied around his wrist for a long time. </p>\n<p>Lan Wangji had originally thought that he would be nervous, that it should be nerve-wrecking to be putting his feelings on display like this, but he knows deep down in his heart that his feelings are returned, and he is not afraid. </p>\n<p>When Wei Wuxian next looks up at Lan Wangji, his eyes shine with tears. “This is the wedding knot,” he says shakily. “This is how spouses used to bind themselves to each other.” </p>\n<p>“Mn,” Lan Wangji agrees softly, smiling. He’d been right to guess that Wei Wuxian would understand, even if the tradition has long since been abandoned, and considered too frivolous. </p>\n<p>“This is how cultivation partners in the Lan Sect used to tell each other that they are <i>loved</i>,” Wei Wuxian whispers. </p>\n<p>Lan Wangji nods. “Wei Ying <i>is</i> loved.” </p>\n<p>Wei Wuxian throws his arms around Lan Wangji. “So is <i>gege</i>,” he breathes out. “Oh, Lan Zhan, I love you so much.”</p>\n<p>Lan Wangji presses a kiss to his hair, and holds him tightly for the rest of the night. </p>\n<p>Wei Wuxian spends a good portion of the night staring at the wedding knot, and when he eventually is lulled to sleep, he holds his left hand close to his chest, as if protecting the forehead ribbon on his wrist.</p>\n<p>It will be a pity to have to remove the ribbon from Wei Wuxian’s wrist in the morning.</p>\n<p>But as long as Lan Wangji swears to always tie it back on in the evenings, he can’t imagine that Wei Wuxian will be too displeased. </p>\n<p> </p>\n<p>9.</p>\n<p>Lan Wangji is twenty when he makes the decision to marry Wei Wuxian. </p>\n<p>It is against the rules to make important matrimonial decisions without the consultation of one’s elders, but Lan Wangji knows what will make him happy, will make <i>Wei Wuxian</i> happy, and so he must marry Wei Wuxian. </p>\n<p>It does not sit right with him to exclude his uncle from the decision, however, so he goes to Lan Qiren’s study one evening before dinner.</p>\n<p>“Shufu, I wish to talk to you about Wei Ying,” Lan Wangji says. </p>\n<p>“Ah,” Lan Qiren murmurs. “You have been notified of the missive from the Jiang Sect, then?” </p>\n<p>Lan Wangji frowns at that. “No, Wangji has not.”</p>\n<p>Lan Qiren regards him, and then says, “Sect Leader Jiang writes that Wei Changze was a loyal member of his sect, and a very dear friend. He, on behalf of the Jiang Sect, asks for Wei Wuxian’s opinion on marrying back into the Jiang Sect, and returning to Yunmeng. He offers the hand of his son and heir, Jiang Wanyin. I believe Wei Wuxian is familiar with Jiang-<i>gongzi</i> from his time in the Cloud Recesses.”</p>\n<p>Lan Wangji’s stomach clenches painfully. The thought of Wei Wuxian leaving Cloud Recesses, of Wei Wuxian <i>marrying another</i>… </p>\n<p>“No,” he says fiercely. </p>\n<p>“No?” Lan Qiren asks, frowning.</p>\n<p>“No,” Lan Wangji says again, calmer. He takes a grounding breath, and drops into a proper bow, prostrating himself before Lan Qiren. “<i>Shufu</i>, I would like your permission to marry Wei Ying.”</p>\n<p>He hears the sharp intake of breath from Lan Qiren. Lan Qiren is <i>surprised</i>, even though he really should not be. Lan Wangji has taken no steps to hide his affections for Wei Wuxian; this has always been plain to Lan Xichen, and the same should be clear to his uncle, too.</p>\n<p>“It is what I came to speak to you about,” Lan Wangji says, straightening his back to look his uncle in the eye. “I would like to marry Wei Ying,” he tells Lan Qiren again, this time firmer. </p>\n<p>“Wangji… You…” Lan Qiren blinks, and regains his composure. “What will you do if I do not give you my permission as head of the family?”</p>\n<p>“I will marry Wei Ying regardless,” Lan Wangji says, and knows the truth behind his statement the moment the words leave his lips. He <i>will</i> marry Wei Wuxian. Nothing, short of Wei Wuxian being unwilling, will stop him. “Wei Ying has expressed an interest in travelling.”</p>\n<p>“You would elope, is what you’re saying,” Lan Qiren concludes. </p>\n<p>“If necessary,” Lan Wangji says. There is no reason to lie. </p>\n<p>Lan Qiren lets out a long sigh. He is quiet for a long moment, before he asks, “Is Wei Wuxian willing?”</p>\n<p>The door bursts open, and Wei Wuxian spills into the room, clearly having been eavesdropping outside. He flashes both Lan Wangji and Lan Qiren a sheepish smile when he comes and kneels down beside Lan Wangji. </p>\n<p>“<i>Xiansheng</i>,” Wei Wuxian says, “Wuxian is more than willing!” </p>\n<p>Lan Wangji turns to face Wei Wuxian, and smiles at him. </p>\n<p>“<i>Xiansheng</i>, I have loved Lan Zhan my entire life,” Wei Wuxian tells Lan Qiren sincerely. “I promise I will take good care of him. I promise!”</p>\n<p>That cannot be Lan Qiren’s concern. Wei Wuxian has always been an unspoken favourite of Lan Qiren’s since he was a child, even if Lan Qiren is quick to deny the same. </p>\n<p>“Wangji returns Wei Ying’s feelings,” he tells Lan Qiren quietly. “Wangji also promises to take good care of Wei Ying.” </p>\n<p>Lan Qiren spends a long moment looking at the both of them, and finally, <i>finally</i> approves of the marriage. </p>\n<p> </p>\n<p>10.</p>\n<p>Lan Wangji is twenty-one when they complete their three bows. </p>\n<p>It’s an unusually beautiful day — the sun shines brightly above them, the skies are clear, the winds that blow are soft and gentle, and Wei Wuxian is a sight to behold in his wedding robes. </p>\n<p>Lan Wangji finds it hard to turn his gaze away from Wei Wuxian, and so he doesn’t even bother trying. He keeps his eyes on Wei Wuxian whenever he can, revelling in the joy it brings to him to know that by the end of the day, Wei Wuxian will be his <i>husband</i>. </p>\n<p>They retreat from the festivities close to <i>you shi</i>; it’s a little early, but no-one stops them from leaving. </p>\n<p>Wei Wuxian tangles his fingers with Lan Wangji’s, and skips most of the way back to the <i>jingshi</i>, eyes bright with mirth. Lan Wangji smiles back at Wei Wuxian, and follows his lead. </p>\n<p>It brings him much satisfaction when they cross the threshold of the <i>jingshi</i> that Wei Wuxian will never have to sneak into the <i>jingshi</i> to sleep with Lan Wangji again, because this will be their home from now on.</p>\n<p>He smiles at Wei Wuxian, and presses their foreheads together. “Wei Ying,” he says softly. </p>\n<p>It feels like a lifetime ago when he found Wei Wuxian by the streets. If he hadn’t brought Wei Wuxian back with him then, what would have become of them both? Certainly, Lan Wangji would not have had any cause to experience joy the way he does now, with Wei Wuxian. Most of the happy things that have happened in his life have their roots in Wei Wuxian.</p>\n<p>“Lan Zhan. <i>Er-gege</i>,” Wei Wuxian says, smiling back at Lan Wangji softly. “<i>Husband</i>,” he whispers at last, shyly, softly, and it’s all Lan Wangji can do to press their lips together.</p>\n<p>They are both smiling too widely for it to be a good kiss by any measure, but Lan Wangji cannot find it in himself to care.</p>\n<p>They are in love, <i>married</i>, and have a whole future ahead of them to be this happy together.</p>\n<p>Forever almost doesn’t seem long enough. </p>\n<p>“Husband,” Lan Wangji returns just as gently, and then kisses Wei Wuxian.</p>"
}