{
  "id": "22687075",
  "url": "https://archiveofourown.org/works/22687075?view_full_work=true",
  "author": [
    "hansbekhart"
  ],
  "title": "Gathered Herbs & Sweet Grasses",
  "rating": "Not Rated",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "魔道祖师 - 墨香铜臭 | Módào Zǔshī - Mòxiāng Tóngxiù",
    "陈情令 | The Untamed (TV)"
  ],
  "relationships": [
    "Lan Yuan | Lan Sizhui & Lan Zhan | Lan Wangji",
    "Lan Zhan | Lan Wangji/Wei Ying | Wei Wuxian"
  ],
  "characters": [
    "Lan Yuan | Lan Sizhui",
    "Lan Zhan | Lan Wangji",
    "Lan Huan | Lan Xichen",
    "Lan Jingyi",
    "Lan Qiren"
  ],
  "additional_tags": [
    "dad wangji",
    "Lan Wangji's Questionable Parenting Skills",
    "Grief/Mourning",
    "Recovery",
    "Injury Recovery",
    "Hopeful Ending",
    "Canon-Typical Violence"
  ],
  "language": "English",
  "series": "",
  "published": "2020-02-13",
  "completed": null,
  "words": "19,782",
  "chapters": "1/1",
  "comments": "846",
  "kudos": "6,335",
  "bookmarks": "2,412",
  "hits": "49,382",
  "summary": "<p>Later, when he’s older, it’s this that A-Yuan will remember most: the stretch of silence, the two of them both dirty and shaking with fever, as he looked at Brother Rich, and Brother Rich looked back at him.</p>",
  "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>Thank you so much to my betas, <a href=\"https://archiveofourown.org/users/gracelesso/pseuds/gracelesso\" rel=\"nofollow\">gracelesso</a> and <a href=\"https://archiveofourown.org/users/girlbookwrm/pseuds/girlbookwrm\" rel=\"nofollow\">girlbookwrm</a> - you guys were amazing &lt;3.</p>\n<p>You can find me on twitter @ <a href=\"https://twitter.com/hansbekhart/status/1227782818496950273?s=11\" rel=\"nofollow\">hansbekhart</a>.</p>\n<p> </p>\n<p>Please check out <a href=\"https://twitter.com/cloudy_recesses/status/1266869146001780736?s=21\" rel=\"nofollow\">this incredible art of A-Yuan, Lan Wangji, and the fireflies</a> by @cloudy_recesses!</p>",
  "text": "<p class=\"p1\"> </p>\n<p class=\"p2\">\n<span class=\"s1\"> Lan Sizhui remembers coming to Gusu, though he’s never told anyone about it. The memory itself is unmoored, disconnected from his first life in the mounds and his second life in the clouds, and since he’s never asked Lan Wangji or Lan Xichen or anyone else who was there, he’s never known for sure whether what he remembers is real or made strange by a child’s fevered imagination. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> The memory starts with footsteps - the rushed sound of boots thudding over wood, the clatter of a door thrown open. The weight of his own body, crawling with fever, sticky and grimy and soiled, and tightly held.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “Wangji!” </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> More than the fever, more than how it hurts when the person holding him is shaken, and him too by proxy, it’s the terror in that voice that makes him cry.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">The last thing Brother Xian said was, “Be brave, and be quiet,” and A-Yuan had been both, had stayed still and silent in the sour-smelling tree, covering his face with his hands to help him hide better, as the whole world became very loud and then very, very quiet, and stayed quiet for a long time. He has been swallowing his tears for days, as full of tears as fever, and though he tries to stay brave they just keep pouring out.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">The crying makes the shaking stop. It brings silence where the only sound is crying and the fast, ragged heartbeat pressed against A-Yuan’s ear.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Wangji?”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">The second time it’s barely more than a breath of air. Careful hands unearth A-Yuan from the cradle of arms and the robe wrapped around him. They pry his little fingers away from the long, sweat-matted hair and the ribbon threaded between them. They pull him away, into candlelight and a room he’s never seen before, and all above him are a crowd of faces he’s never seen before, and no matter how hard he looks he doesn’t see Granny or Brother Xian or Sister A-Qing or Uncle Four or Brother Ning among them, not anywhere. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> He might have cried forever, if a hand hadn’t reached out and settled warm against his belly, clumsily patting at him. He looks at the hand first, which is glowing blue, and then at the person it belongs to, who A-Yuan doesn’t recognize until he does: until he sees that it’s Brother Rich, whose face is red and sweaty and covered in dirt, whose pretty robes are smeared with dirt too. He smells like the dark pool in the back of Brother Xian’s house, and he looks more like a corpse than a person. A-Yuan stops crying in surprise. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “Wangji,” someone says again, and A-Yuan thinks for the first time of looking up and seeing who’s holding him. He looks like Brother Rich, except that his eyes are dark like A-Yuan’s, and he doesn’t look like a corpse at all. “Wangji, whose child is this?” </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> When Brother Rich says nothing, the other looks down at A-Yuan and asks, “Whose child are you?” and A-Yuan says nothing to that too, because he doesn’t know. On the mound he was everyone’s child. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “Are you sick?” A-Yuan asks Brother Rich, instead.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> When Brother Rich says nothing, the other sighs and says, “He is sick. You are both very sick.” And then he turns to the pale faces huddled around them and says to one, “Please go fetch the doctor,” and to another, “Please tell my uncle,” and to the others, “Please go, and say nothing to anyone for now.” </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> The other people go away. The doors slide closed behind them. The man adjusts his hold on A-Yuan, enough to curl one long hand around Brother Rich’s wrist and pull it gently away from A-Yuan. The blue light flickers out like a candle. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “Wangji,” the other sighs. “What have you done?” He stands, with A-Yuan in his arms. From up high the room swims into focus. The round windows, the cloud paintings. The silks that drip from the walls like fog. They’d all been sitting on the ground next to a big wooden bed. Brother Rich is leaned up against it, like he’d tried to sit and fell instead. His chest heaves up and down. His eyes follow A-Yuan’s as the other sets A-Yuan sniffling down on the bed, carefully re-swaddling him in the sweet-smelling robe.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> The other kneels down next to Brother Rich. He touches his long hair and says, just as carefully and softly as he’d carried A-Yuan, “You keep nothing for yourself, do you, didi?” </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">He pulls Brother Rich up onto the bed as well. This time Brother Rich is the one who makes noise: a long, terrible groan that makes A-Yuan yank the edge of the robe up over his face in fright. The whole of his back is wet and covered in red, and when he is flat on his stomach the smell of Brother Xian’s dark pool is strong and home-like. His eyes are very pale in the candlelight. Later, when he’s older, it’s this that A-Yuan will remember most: the stretch of silence, the two of them both dirty and shaking with fever, as he looked at Brother Rich, and Brother Rich looked back at him. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Brother Rich tugs free the sleeve of the robe he’d taken off and wrapped around A-Yuan, back on the mounds. It’s very warm, a blue so pale it’s almost the color of clouds, cleaner than any other part of them. He uses it to carefully brush away the tears on A-Yuan’s cheeks. He holds it up to A-Yuan’s sticky nose, and keeps it steady while A-Yuan, well-trained by Granny, blows into it. He folds the dirty fabric in on itself, tucks it carefully away from their hands and faces. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Brother Rich tells A-Yuan, low and gravelly, “I am here.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> After a while, A-Yuan tucks his chin into his chest and nods. Brother Rich nods back, very seriously. Brother Rich’s brother has stepped away, gone to stand next to the door to see if the doctor is coming yet, so it’s just the two of them, watching each other closely, waiting to see what will happen next. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “I am here,” Brother Rich repeats, even though now he’s the one with tears running down his cheeks, and A-Yuan the one who stretches out his small hands to wipe them away.</span>\n</p>\n<p class=\"p2\"> </p>\n<p class=\"p2\"> </p>\n<p class=\"p2\" align=\"center\">\n<span class=\"s1\">-</span>\n</p>\n<p class=\"p1\"> </p>\n<p class=\"p1\"> </p>\n<p class=\"p2\">\n<span class=\"s1\">As for what happened next, Lan Sizhui only knows what he is told. That Hanguang Jun did not always look after him; that Hanguang Jun was in seclusion when he was very young. Of course the elders would not let Lan Wangji keep the child he’d appeared with so suddenly, both of them covered in blood and gravedirt - not after he refused to tell them whose child this was, no matter how obvious the answer might have been, and not after his panicked flight to Yiling brought him closer to death than the whips by themselves had. For months afterwards he lingered at the bank of that long river, drifting on the currents, unable to walk or sit up or, truly, to wake or sleep. Both Lan Wangji’s memories and Lan Sizhui’s memories of those in-between times have only really ever been fragments. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> By the time the fever left them both, A-Yuan had been given over to the care of others: Grannies who looked after the Lan clan’s children while their parents were elsewhere. But no one had told these venerable ladies that this boy had been saved from a killing field, that everyone he’d ever known was dead - and there were so many other children to care for. No one in Cloud Recesses knew that this quiet, morose child had been so free with his smiles and laughter back home in the mounds. There was no one left alive except for Lan Wangji to tell them otherwise. When A-Yuan asked for his own Granny and Brother Xian and Sister A-Qing and Uncle Four and Uncle Six, they shook him off their skirts and told him to go play with the other children. In the clouds, A-Yuan was no one’s child. So he grew more quiet, and more morose, and instead of playing he hit and bit and cried, which is what happens when Lan Wangji finally reappears in his life.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Granny Two brings A-Yuan to a little house that sits on the edge of the clouds, where the white buildings grow thin and the bamboo grows thick and the mountain starts to tumble back down to earth. The little house is locked away behind a thick fence, with a garden full of white stones and a long wooden deck and endless white-papered doors that look like watching eyes, or the barriers that Brother Xian would set around the places A-Yuan was forbidden to go. But he’s already started to forget about that - the edges and details of Brother Xian’s cave have grown dim on the other side of his fever - and all he really knows is that the little house looks like a place A-Yuan is not welcome. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> He tugs his arm away from Granny Two’s hand before they can go up the low steps to the little house, to the man in white who sits straight-backed on the long deck, so still that at first A-Yuan hadn’t seen him at all. There’s a second cushion next to him, and a table with food set out in covered jars and lacquered trays. A-Yuan can smell the food, and his stomach fights him even as he crouches behind one of the big stone lamps and hides. He can hear Granny Two and Brother Rich speaking, and then Granny Two shuffles back down the stairs. She hisses at him as she passes, says: “You behave for Second Master Lan,” and then she’s gone. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> A-Yuan stays where he is, scowling. His hands wrap around his knees. He watches the ants crawl back and forth under his feet. He listens to the wind rattle the bamboo around. Maybe he could run away into the forest. His feet know the slope of a mountain, and he thinks from here he could find the cave and his home and all of his family. He could go home. His stomach gurgles again.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Brother Rich kneels down next to A-Yuan. His white robes spread across the white stone and his face, too, is white, even his mouth, like he has no blood in him at all. He made no noise coming closer, and he is very large and very scary looking, so of course A-Yuan jerks away. Brother Rich, eyes wide, snatches his wrist to keep him upright, which makes A-Yuan yell, and in answering surprise Brother RIch lets him go, and A-Yuan falls down. His butt hits the ground; his head hits the stone lamp. For a second he doesn’t cry, and Brother Rich stares down at him in open shock, and then A-Yuan opens his mouth and starts to howl. It’s the sort of crying that’s terrifying to people who aren’t used to children. Great, heart-rending sobs, too big and loud for the small chest they come from. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Lan Wangji is not used to children, and his heart - just barely stitched together - is torn to pieces again. His hand dangles uselessly in the air. He can see that A-Yuan is not really hurt - his palms aren’t scraped, his clothes not torn. Lan Wangji’s fingers, when he remembers he has them, find not even a bump on the small head. But still A-Yuan cries, loud enough to break the clouds.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Lan Wangji’s hands curl and soften, finally, and move to hold A-Yuan, but then A-Yuan sobs, “Brother Xian!” and - heaven help him - Lan Wangji looks. The motion is automatic: he always looks, he always <em>will</em> look. The day he’d met A-Yuan his eyes scanned the crowd for rescue to swoop in on black and red wings, even before he’d known who A-Yuan belonged to. But the forest and the Jingshi are as empty as they always are, as they always have been. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">For a moment it’s as if the whips are striking him again. For a moment he is fiercely, hungrily jealous of the way A-Yuan can cry. And then A-Yuan pushes him away, as hard as his little arms can, and kicks him too, in case it wasn’t enough.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">It rocks Lan Wangji back on his heels, but not from the force of it. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"><em>No one is coming</em>, he wants to tell A-Yuan. But A-Yuan must already know this. The child had already lost everything there was for a person to lose, over and over. If he were Wei Ying, he would have the words to comfort A-Yuan - but even the brush of that name against his throat is enough to make him want to tear it out. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">He pulls away. A-Yuan’s yell catches halfway out of his mouth and he looks at Lan Wangji with wide eyes, suddenly terrified. Lan Wangji doesn’t know that the fear in his little heart is that Brother Rich will call Granny Two, and that A-Yuan will be shuffled back to the little compound and be left to sit in corners by himself. Hiccuping, tears still streaming down his face, A-Yuan puts his arms around his own shoulders and mutters, so soft that Lan Wangji barely catches the words: “Good A-Yuan, precious A-Yuan. Everything is okay,” which was what Granny used to whisper to him as she rocked him in her soft arms.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Lan Wangji puts his hands under A-Yuan’s arms and pulls him to his feet. He wraps a hand around A-Yuan’s impossibly small one and leads him, still crying, out from behind the thick fence and away from the little house. His injuries make it nearly impossible to carry the boy. Instead he walks very, very slowly and very, very carefully, so carefully that A-Yuan never stumbles over the uneven ground, even though his eyes are shut tight with grief. Eventually the narrow path widens into a little meadow, which is dense with grass and ferns and dotted all around with small white fluffy balls, which sit up quickly as they approach.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">The crying stops. The silence is blissful, as is the thin hope of not having failed in this, as he has in everything else.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">He can tell at once that A-Yuan has never seen a rabbit before. He’s sure that if one had come within a li of the Burial Mounds it would have been gobbled right up. Lan Wangji saw, too, the Wen detention camp with his own eyes: there were no animals there at all. Lan Wangji may as well have taken his hand and walked them to the surface of the moon. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">A-Yuan allows Lan Wangji to seat him on the ground, and then kneel next to him. The rabbits, in color and substance like the mist that drifts through the mountains, circle around them and shake their long ears. As soon as one gets close, Lan Wangji picks it up and gives it to A-Yuan. He puts three in A-Yuan’s small hands, four or five more in his lap, and balances a particularly docile one on his head. The rabbits, of course, don’t stay still but wiggle their soft paws up onto his arms and shoulders. They balance on his knees and press their twitching noses to his. Even a jade statue would start to giggle under such an assault, or feel his heart lighten to watch it.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Be gentle,” he tells A-Yuan, with a voice as soft as rabbits’ fur. “Pet with the back of your hand.” And he demonstrates, the rabbit happily shutting its eyes under his touch. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Oh,” A-Yuan breathes. He is gentle, without having to be told twice, and the rabbits settle down into a furry blanket on his still, thrilled lap. His tears dry on his cheeks and beside him, unnoticed, Lan Wangji’s panicked heartbeats slow to their usual pace. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Lan Wangji says, hesitantly, “Good A-Yuan. Precious A-Yuan. Everything will be okay,” and puts a single hand on A-Yuan’s back.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">A-Yuan sighs very deeply. The rabbits tumble slowly to the forest floor as he carefully gets up, crawls into Lan Wangji’s lap, and buries his face in his chest.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"><em>Oh,</em> Lan Wangji thinks.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">He will never tell Lan Sizhui - not then, not later, not ever - that he had saved him from the Burial Mounds with no particular plan in mind. The soul he had gone to find was Wei Ying’s, and anyone else’s would have been incidental. His grief was so terrible that it seemed impossible to imagine that he would even continue to exist. His grief was an extension of the violence done to the rest of his body: it sickened and isolated him. The simple act of waking up, day after day, was astonishing and unfair. Wei Ying was dead - he was dead, he was <em>dead:</em> that was all that mattered. Lan Wangji had brought the child to Cloud Recesses because despite the whips, he had only ever known safety in one other place, and that place - that person - was gone. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">He puts his arms around A-Yuan, who is so small that it almost feels like holding one of the rabbits. It hurts, of course - any movement at all pulls at the wounds on his back, as it will for many years, and indeed never fully cease. But he holds A-Yuan until the sun has chased shadows all the way across the little meadow. He holds A-Yuan until he nearly falls asleep himself. He holds A-Yuan until his wounds scream too loud to be ignored and then, regretfully, achingly, he hauls himself to his feet. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">A-Yuan stirs in his arms. His face is hot against Lan Wangji’s neck. His hand is heavy on Lan Wangji’s shoulder. His little fingers curl around the shape of bandages under Lan Wangji’s robes. He murmurs, still mostly asleep, “A-Yuan doesn’t want to go back. A-Yuan wants to stay with Brother Rich.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Lan Wangji’s arms tighten.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Uncle hadn’t asked about the boy, though of course he knew. Neither had Brother, though he had stayed faithfully by Lan Wangji’s side through the worst of his sicknesses, and had even helped him take his first steps out of the Jingshi. It was lucky that one of them hadn’t taken it upon themselves to rehome A-Yuan somewhere out of the Cloud Recesses entirely, before Lan Wangji could do anything about it. No one has asked him what his intentions were, and in truth he hadn’t any, not until that day he’d buried the boy under rabbits.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “You will,” he says to A-Yuan, and so he does.</span>\n</p>\n<p class=\"p1\"> </p>\n<p class=\"p1\"> </p>\n<p class=\"p2\" align=\"center\">\n<span class=\"s1\">-</span>\n</p>\n<p class=\"p1\"> </p>\n<p class=\"p1\"> </p>\n<p class=\"p2\">\n<span class=\"s1\">The first clear memory that Lan Sizhui has of living with Lan Wangji is of new robes. He never really had anything new before and the novelty of it, the specialness, never really fades from his mind. There are several sets of clothes, so even if he dirties one he doesn’t have to sit naked by the river while someone cleans it, the way he used to. There are new shoes, made of leather instead of coarse straw. A small bed in one corner of the Jingshi, and a cabinet to put books and notepaper and toys. And a thin white ribbon that Brother Rich ties on his forehead every morning after he brushes A-Yuan’s hair. Sometimes he still is put in the care of Grannies One, Two, and Three, but not often and not for long. Lan Wangji has a long road of recovery ahead of him and is, officially, in secluded meditation and not permitted to leave the boundaries of Cloud Recesses, for fear that he’ll expose either his heresy or discipline wounds to outsiders, or come back with another wayward orphan and refuse to explain where he’d gotten it.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Mostly to A-Yuan <em>secluded meditation</em> means Brother Rich doesn’t go many places, and when he does he usually takes A-Yuan with him. In the morning they feed the rabbits (Brother Rich brings extra vegetables since A-Yuan will eat as many carrots as the rabbits do). In the afternoon he sits on the long deck and watches A-Yuan play. Before dinner he teaches A-Yuan to read, or positions his fingers above the guqin, showing him music his hands are too small to yet make. He still walks slowly and not for any distance, and he will never speak much. That doesn’t bother A-Yuan, who absorbs attention like sunlight and care like sweet rain, and blossoms once again. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Later, when Lan Sizhui is older, he will eat almost all of his meals with other people. With his clan in the big hall during festivals and happy occasions. With the other disciples in their own little courtyard, jostling each other’s elbows and laughing. Regularly, too, with Lan Wangji, even after he moves into the disciples’ quarters, and later into his own rooms as a leader of the Gusu Lan - just the two of them in the little house at the edge of the woods, and he’ll find the silent meals meditative and soothing, and feel settled and happy afterwards. It won’t seem strange to him that they spent much of his first years in the clouds like that: alone. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> If not for the efforts of Lan Xichen, his refusal to sideline his brother, they might have remained that way.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> One summer night, not too many months after A-Yuan has come to live at the little house at the edge of the clouds, Lan Xichen and Lan Qiren join them for dinner. They eat on the little pavilion outside where they can all feel the cool breeze rolling off the mountains, and A-Yuan can watch the fireflies playing in the grass. The meal is silent, as it always is; Brother Xichen smiles through it, and Master Lan scowls through it, as they usually do. That night there are <em>five</em> different dishes on the table, and A-Yuan has been allowed to try <em>all</em> of them, even the soup with its bitter, bitter leaves; even the meat in its thin gravy; even the bamboo although he spits out the first crunchy piece Brother Rich puts into his bowl. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “Don’t waste food,” Master Lan snaps at A-Yuan, though he’s already put the strange vegetable back in his mouth and is chewing gamely on it.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “Improve your posture,” Master Lan orders A-Yuan, though he’s been sitting very carefully too. He does his best to wiggle straighter anyway, and doesn’t tell Master Lan that speech is forbidden during meals. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Good,” Brother Rich tells A-Yuan, pointedly, and puts more food into A-Yuan’s bowl before Master Lan can catch him hiding any of it in his sleeves. A-Yuan stays still and quiet and follows all the precepts he’s learned so far, and when he’s finished eating his reward is to lean most of his body weight against Brother Rich’s arm, and play with the fine white fabric of his sleeve while the adults talk. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “You spoil him,” Master Lan says.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “He looks healthy,” Brother Xichen says, and then to Brother Rich, “The first of the watchtowers have started construction on the Ouyang sect’s lands. I have a letter from them that I’d like your opinion on.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Brother Rich doesn’t say anything. A-Yuan drapes the long sleeve over his own knees and draws it off, bunches the fabric between his little fingers to look like white flowers, ripples it to look like rushing water.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “Qinghe Nie will be hosting a martial arts conference next month,” Brother Xichen says.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “Oh? Will Lanling Jin be attending?” Master Lan says.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “Uncle,” Brother Xichen says, chiding. “A-Yao has mended his friendship with Da-ge. He visits him often in the Unclean Realm. Do not worry.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Brother Rich doesn’t say anything. A-Yuan sags against him, his head heavy despite the fancy of the fireflies, sparkling in and out of sight. His stomach is full and his robes are cozy warm. His fingers soften around the sleeve. He rubs his face against Brother Rich’s arm.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “Sit up straight,” Master Lan snaps again.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “A-Yuan is young still,” Brother Xichen says gently. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"><em> “If</em> he’s to be raised here, then he’ll follow the same rules as any other outside disciple,” Master Lan says. “Otherwise, send him down the mountain and be done with it.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Brother Rich’s arm has turned to stone against A-Yuan’s cheek. He says, very low, “He won’t be an outside disciple.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> The silence is very tense. A-Yuan straightens up without having to be told, rubbing at his eyes. Master Lan and Brother Xichen are frowning at Brother Rich, and then Master Lan turns to frown at A-Yuan, studying him very deeply. “What is he wearing?” he asks, sharp.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Brother Rich says nothing, but it’s a nothing that feels sharp all over to A-Yuan, like needles on his skin, or a blood red pool that he only barely still remembers. He tugs on Brother Rich’s sleeve, and turns on a smile. “A-Yuan wants to go pet the rabbits,” he pleads. “Can we go pet the rabbits? They’re very hungry.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “The rabbits are sleeping,” Brother Rich tells him. He brushes one hand over A-Yuan’s hair, very softly. “We will see them in the morning.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">A-Yuan whines playfully in his throat. He’d been raised to tease, even if he won’t remember it for a long, long time. He pushes his lower lip out for added effect. “Brother Rich,” he begs, but his efforts are interrupted.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“You will address your elders <em>properly,</em>” Master Lan snaps, his voice growing even sharper, sharp enough that A-Yuan feels real alarm for a moment, just until he remembers that Brother Rich is there and it will be okay. Master Lan points to Brother Rich. “He is Hanguang Jun.” He points to Brother Xichen. “Zewu Jun.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> A-Yuan looks up at Brother Rich. Brother Rich looks back at him. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “We will watch the fireflies,” Brother Rich decides. He picks A-Yuan up, sets him on the ground, and takes his hand to lead him away.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> The grass grows long on the far side of the Jingshi, away from the stone garden and the long deck that overlooks it. It’s the perfect height for both fireflies and A-Yuan to hide in, and this night both of them do, dipping and dancing between the gently waving stalks. Brother Rich sits down in the grass to watch him, which is good, and he smiles as A-Yuan tries his best to catch fireflies, which is even better. But they’re not so far away that A-Yuan can’t hear Brother Xichen and Master Lan still arguing, in the strange, quiet way people seem to argue in the clouds.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Uncle,” Brother Xichen says, “don’t trouble yourself. When he starts his schooling we can discuss addressing family in public.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “This child is not -” Master Lan starts to say, and Brother Rich tenses, looking over his shoulder instead of at A-Yuan - but then Brother Xichen laughs. It’s a good laugh, and it’s comforting to A-Yuan to hear it.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “Apologies, Uncle,” Brother Xichen says, “but you saw the embroidery on his forehead ribbon. He clearly is.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Brother Rich stretches out one hand and closes it around a firefly, so easy it seems like magic. A-Yuan shouts with happiness and rushes over to see the light flickering in between Brother Rich’s fingers. The firefly darts around inside Brother Rich’s palm, bashing against his calloused skin, and it’s beautiful. After a moment he lets A-Yuan pry his fingers apart and set the light free, and then he captures another firefly so that they can repeat the process.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Distracted, A-Yuan almost forgets about the argument happening on the little pavilion, but the same warm breeze that rattles the bamboo also brings Brother Xichen and Master Lan’s voices to them again. “What are you trying to achieve, doing these things?” Uncle Xichen asks. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Master Lan <em>harrumphs.</em> “Children need a firm hand,” he says. “If Wangji refuses to accept his responsibilities, then they will be taken away.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> A-Yuan looks wide-eyed at Brother Rich, who only shakes his head firmly, and sets another firefly free. “I don’t think he’s refusing anything,” Brother Xichen says. “Look at them, Uncle. A-Yuan is clearly very happy here. And - I think Wangji is happy too, now.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “What does happiness have to do with it?” Master Lan demands.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> There’s a stretch of silence. A-Yuan puts his hands over his mouth to stop it from quivering. He squats down and starts pulling out long strands of grass, so that Brother Rich will weave them together to make a crown or a sword for him. He sighs deeply, this time not even meaning anything by it, his teasing finished, his sadness real. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “A-Yuan?” Brother Rich prompts. A-Yuan doesn’t say anything for a while, but Brother Rich is better at silence than any child, other than the one he himself had been. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Finally, A-Yuan sighs again and says, softly, “He doesn’t like A-Yuan.” </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Brother Rich looks at him. “Master Lan just doesn’t like radishes,” he says. He starts pulling grass himself, gathering it in a neat pile on one knee. Over the years he’ll get better at teasing, and eventually he’ll be good enough to confound a soul made to tease, but his efforts now are rough. “When you first sprouted from the soil, it scared him.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> A-Yuan gives his handfuls of grass to Brother Rich, who accepts them solemnly and begins to weave. “Gusu’s soil is thin,” he says, after long minutes. “We’re not lucky here, to grow many children only with sun and rain.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “Just me,” A-Yuan says glumly. He knows. If there were other children like him then the grownups wouldn't wonder where A-Yuan comes from. He hears them asking sometimes, mostly when A-Yuan goes to be watched by the Grannies. It happens when they think A-Yuan cannot hear. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “Just you,” Brother Rich repeats, but the way he says it makes A-Yuan feel special instead of sad. He makes himself a nest in Brother Rich’s lap, and forgets about his tears, and about Master Lan and Brother Xichen, who now are speaking so softly that even Lan Wangji can’t hear their words.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “We <em>need</em> him,” Lan Qiren says to his nephew. “The war may be over but Gusu Lan is still rebuilding, Xichen. When Wangji is finished with this - this <em>tantrum</em>, he must resume his place at your side.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “Uncle,” Lan Xichen says, very faintly. “He nearly <em>died.</em>”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Lan Qiren blows angry air through his nostrils. “The Yiling Patriarch is the one who died,” he points out. “Wangji lives, so he must <em>live.</em>” </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Lan Xichen draws in a deep breath, and is silent for a long time. When he finally speaks, his voice is as mild as ever, belying the fact that it’s the second time in his life that he’s dared to argue with his uncle. “One day,”<span class=\"Apple-converted-space\">  </span>he says slowly, “you will ask Wangji to do something he cannot.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> And Uncle says, firmly, “There is nothing Wangji cannot do.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Cradled gently in the grass, A-Yuan looks up at Brother Rich. “Is Brother Rich a bad name?” he asks, curious.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Brother Rich shakes his head, and places a grass crown on top of A-Yuan’s head. “You may call me what you like,” he says. “When you’re older, I’ll give you a name too.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> A-Yuan is falling asleep for real this time, his eyes getting heavier and heavier. The fireflies smear across his sleepy gaze. He’s rocked gently within Brother Rich’s arms, mostly by accident as Brother Rich continues to weave together long tails of grass, making abstract shapes with them. “Brother Zhan,” he tries. Brother Rich flinches, just a little. A-Yuan opens his eyes back up, gauging the reaction. “Brother Rabbit!” he says, wanting to please. That one is better, and earns him a curl of Brother Rich’s lips, as fast as a firefly. A-Yuan glows too. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Cheeky, with his little heart beating fast, he says, “Daddy?”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Brother Rich becomes very still. Snuggled close, A-Yuan doesn’t see the firefly smile reappear, tucking itself like a secret into the corner of his mouth - but he can feel Brother Rich’s heartbeat thudding against his ear, beating just as fast. He straightens A-Yuan’s crown carefully, and tells him again, “You may call me what you like.”</span>\n</p>\n<p class=\"p1\"> </p>\n<p class=\"p1\"> </p>\n<p class=\"p2\" align=\"center\">\n<span class=\"s1\">-</span>\n</p>\n<p class=\"p1\"> </p>\n<p class=\"p1\"> </p>\n<p class=\"p2\">\n<span class=\"s1\"> Lan Sizhui turns seven or eight the year that Lan Wangji emerges from his forced seclusion. The two of them spend the years in between growing stronger, twining together like trees towards the sunlight. After the first year, Lan Sizhui can read and write as well as the other children, despite his late start. After the second, he is allowed to prove it. He takes to school like he was born to it, swallowing any scrap of knowledge given to him, and hiding the leftovers in his sleeves to puzzle over later. His posture is perfect during lessons. He is kind to his classmates and dutiful to his teachers. In public he always says Hanguang Jun, and Zewu Jun, and Master Lan. He gives no one cause to wonder whose child he is.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> The third year, a few days after the first snowfall of the season, Lan Wangji takes Lan Sizhui to his brother and says he has business out of Gusu, and asks if he will watch over him. He doesn’t say where he’s going. He doesn’t say when he will be back. He doesn’t say goodbye. Dubiously, Lan Sizhui and Lan Xichen look at each other, and then Xichen asks if he’d like to learn how to play the xiao. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">That night is the first night that A-Yuan and Wangji spend apart from each other in more than two years. A-Yuan sleeps poorly in the Hanshi, which is closer to the center of Cloud Recesses than the set apart home of Xichen’s mother, and accordingly noisier. There are servants that bustle through the bordering courtyards. The clatter of wooden chimes in the wind. Each morning when Xichen opens his eyes, A-Yuan is already awake, curled in his blankets and playing quietly to himself with one of the little boy treasures he keeps in his sleeves: a wooden puzzle, or a grass butterfly, or a little book full of basic calligraphy. He picks over his food. He practices guqin fingering on empty tables.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> They feed Wangji’s rabbits together, who greet disappointment each morning as they dash across the meadow to say hello and then realize all over again that Xichen is not their master. They shake their ears and kick grass at Xichen to express their feelings, and then clamber all over A-Yuan to beg for sympathy. A-Yuan brings his schoolwork so that he’ll have an excuse to linger when Xichen excuses himself to see to his duties. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Wangji sends no word for five days. The silence lingers like incense as Xichen goes about his day, and hangs heavy in the Hanshi as he and Uncle and A-Yuan eat their meals. When they were younger, Wangji often disappeared for days at a time, finding himself wherever the chaos was. And of course Xichen had worried then: Wangji had been unfathomably young to be doing such things, but that was all before -<span class=\"Apple-converted-space\">  </span><em>before,</em> a word that feels so inadequate that all the poetry in the world could not describe the gulf of experience between Xichen and his younger self - and the worry poisons him. <em>Before,</em> he had so little idea of what evils were out there in the world for his little brother to find.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Voices wake Xichen in the middle of the fifth night. A-Yuan’s round face flashes pale in the dark when Xichen flies to the door, not bothering to light a candle. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “It’s Hanguang Jun,” the messenger says, speaking Xichen’s greatest fear to life, but the words that follow undercut his terror with confusion. “He’s wrecking the storeroom.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> The messenger wears a plain white ribbon and an expression of poorly banked disbelief - asking him <em>why is Wangji wrecking anything</em> would be pointless. “I’ll come,” Xichen says instead. He lingers long enough to throw a robe over his sleeping clothes and to tell A-Yuan, “Stay here. Don’t come out for any reason.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> At this time of night Cloud Recesses is completely silent, their footsteps swallowed up by the mist. Even the noises coming from the partially open door of the storeroom seem dream-like. “Go back to your posts,” Xichen tells the messenger, and another outer disciple standing guard outside the storeroom. He goes to face his brother alone.<span class=\"Apple-converted-space\">  </span></span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> In the morning, Wangji will need to be told what he’s done. He’ll wake in the back room of the doctor’s quarters, and he’ll vomit onto the floor because Xichen doesn’t know enough about drunkenness to have a bowl ready, or even to anticipate such a thing happening. His eyelashes will frost over and clump together with tears, because Wangji hadn’t known anything about drunkenness either, and will feel a type of sick pain that he’d avoided his whole life. He will sit and stare at his bare, dirty feet when Xichen describes the rules he’s broken - the destruction of their clan’s treasures, the two empty bottles of liquor left on the steps of the Jingshi - and the look of horror on his face will soften Xichen’s retelling. He won’t mention the bruise that darkens his jawline. He’ll leave out that he tried to wrestle the Wen brand away from Wangji’s grip, and failed. He’ll never describe to anyone the smell of his brother’s skin burning, not even to himself. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> In the night, in that moment, the stink is inescapable. It fills the ruined storeroom as Lan Xichen stands panting over his brother’s unconscious body. He stoops to pick up the brand and is sickened by his failures and also by the charred bits of skin that adhere to the iron. He rolls Wangji onto his side to see if the scars on his back have torn, if he has any other injuries. He allows himself a single moment of indulgence when he finds they have not - a few breathless, grateful seconds where he presses his forehead to his brother’s shoulder and listens to the thud of his unsteady heart - before he pulls Wangji’s robes closed and gathers him into his arms. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> The guards have not gone to bed, nor back to their post. They hover on the edge of the lamplight with wide eyes and open ears. “Wake the doctor,” Xichen sighs. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Lan Qiaohua receives the pair of them into her offices with surprise concealed only a little better than the outside disciples’. “I thought I’d seen the last of him for a while,” she allows, as Xichen sets his burden down. She was the doctor for Wangji’s birth; for Xichen’s too. She cured A-Yuan of the fever that nearly took his life, and Wangji when the whips nearly took his. “What happened now?”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Xichen draws a breath, and finds he doesn’t have the words. “I need to speak to my Uncle,” he says. “Wangji has a wound on his chest that will need seeing to. For the rest of it …” He leaves the words unspoken, because he doesn’t know. He doesn’t know.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">The steps to his Uncle’s rooms, not far from Xichen’s own quarters in the Hanshi, have been walked so often that he’s practically worn grooves in the wood. But the way before him feels unfamiliar. Every step feels wrong, as if the path has already fallen out from under his feet without his notice: washed out when their home burned and he and Wangji’s father was murdered. Not for the first time he wishes for the wisdom and comfort of his sworn brothers - but he’s already ushered in a new year without Da-Ge beside him, and the memory of that loss makes him breathless. The thought of losing Wangji as well is a horror beyond his ability to voice, and one he’d foolishly hoped had died three years before.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “Uncle?” he calls, and almost hopes that an answer won’t come.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> They walk back in silence. A gray dawn is just beginning to break. Through windows Xichen can see candles being lit, and hear the sounds of people waking up. The sleeplessness is wearing on him. His eyes feel gritty. His body is sore all over, bruised beneath his robes. His memories lie to him. They tell him that Wangji had gotten better. That he’d finished grieving and made his peace, and was ready to rejoin the world. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Uncle says very little to the doctor’s pronouncements. From the alcohol, Wangji should suffer no ill effects besides the usual. From the brand, he would be adding a sun to his collection of scars. Wangji doesn’t stir; he breathes shallowly on the sick bed, sleeping a false sleep. His shoulders are bare; the blanket is pulled up to his collarbone. It’s nearly high enough to cover the bandages. His skin is sallow. The lids of his eyes are reddened and fragile looking. He still smells of liquor. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Lan Qiaohua waits for questions and receives none, and retreats with her arms held in a loose salute, to go make her morning tea.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Did you know he’d go to Yiling?” Uncle asks, when they’re alone. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Xichen shakes his head. He thought Wangji might, though. “To pay his respects,” he says numbly. “And to say goodbye.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">The silence that follows is profound and considering. Xichen traces the features of Wangji’s sleeping face. The last of Wangji’s babyfat had melted away during the Sunshot Campaign but he never stopped looking soft and young to Xichen. He’s never forgotten the weight of his brother, hefted on one hip.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “Another year of seclusion,” Uncle declares. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “No,” Xichen says.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “No?” Uncle repeats, disbelieving.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> It’s the third time in all of Xichen’s life that he has, in some meagre way, defied his uncle. No doubt Da-Ge (or even A-Yao) would have thought little of his rebellion. In the moment he thinks very little of it himself, feels no flicker of nerves or anger or much of anything at all. Just an uneasy, disbelieving fear, like standing too far away from a fire to feel either warmth or danger. What good is another year, if thirty-three lashes did not beat obedience back into Lan Wangji? </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “Wei Wuxian is dead,” Uncle says, and Xichen hears his own fear and confusion echoed back to him. It’s true - Wei Wuxian is dead, leaving not even a ghost behind, vengeful or otherwise. And yet here they sit. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> For a moment Xichen feels true anger lick at him: they have been through so much, the three of them. The last of their immediate family. Xichen’s own sleep is disturbed often with memories of the war, of killing. The memories he seals away during the daytime come rushing back to him at night, as unspoiled and sharp as when he was in the thick of things, where he held dying men, and learned to fear death. Had they not all suffered terribly? Had Xichen not sat locked away with their clan’s books, imagining his brother’s death a thousand times over, in a thousand different ways - the helplessness worse than any battlefield? </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> He hadn’t imagined this - that death would be something Wangji would choose, if given the opportunity. He knows with chill certainty what waits at the end of this narrow path, and that Wangji will only hurry his steps towards it unless - </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Unless - </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> He doesn’t know, and Wangji wakes before Xichen can even think of what might save his brother’s life. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> It’s Uncle who moves first, to scoop Wangji’s hair away from his face, and to hold it twisted softly at the back of his neck until he’s finished being sick, and it’s Uncle who leaves first as well, not even waiting for punishment to be decided between the three of them. “Keep him, then,” is all he says as he shakes his sleeves and sweeps out of the room.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Wangji’s eyes flicker up to Xichen’s and, for once, stay there for a long time. He doesn’t look away until Xichen begins to tell him what happened, what he’s done. The words are difficult to find. He’s forgotten how to speak the language they used to share. His brother’s face looks nothing but blank to him. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“You will kneel as punishment, for as long as you see fit,” Xichen tells him, after the story runs out. The tea that Lan Qiaohua brought both of them has grown cold. The incense she lit to clear the room has long burned out. “I must go see to your son.” </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Wangji’s hands clench in his lap. His mouth quivers. He says nothing, so Xichen takes his leave too. The world has come alive again while Wangji has been dreaming. Cloud Recesses is full of everyday activities, the sounds and sights he’s grown too accustomed to. The sight of disciples clustered in groups, <em>Hanguang Jun</em> on their lips, who break guiltily apart when they see Zewu Jun coming - that, too, is painfully familiar.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Lan Sizhui is not in class, when Xichen peers in through the open doorway. He sighs, and goes to the kitchen first, to get a meal in case his adopted nephew interpreted “Don’t come out” as, “until you’re told otherwise.” When he returns to the Hanshi it seems that this is the case: A-Yuan has dressed himself and fixed his own hair and forehead ribbon, and is waiting, so very patiently, for the door to open and someone to come for him. His little hands still on Xichen’s writing desk, positioned for chords. His dark eyes dart over Xichen’s shoulder, seeking Wangji, and he looks down quickly to hide his disappointment.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Xichen sets their meal down on the table, sets out a bowl and spoon and chopsticks for each of them. He scoops rice mechanically into A-Yuan’s bowl, as if the boy is still too small to serve himself. His face aches, where Wangji hit him last night. Each mouthful makes the bruise feel more tender and, anyway, only tastes like ashes. Xichen puts his own bowl down with a sigh. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “Where is Father?” A-Yuan asks.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"><em> Speech during meals is forbidden,</em> Xichen thinks automatically, but A-Yuan isn’t eating any more than he is. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Wei Wuxian is dead - and yet here Xichen sits, helping to raise the man’s child. Perhaps he was a fool, not to see this coming. Perhaps he has been a fool all along, to think that raising the boy would be good for Wangji, and not a living reminder of all of their failures: as if Wangji hadn’t named A-Yuan after his own grief, and dared the world to say anything about it. Was A-Yuan happy? Could be happy, in such a home, with such a guardian? “He’s receiving punishment,” Xichen says finally. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> From the look that passes over A-Yuan’s face, it probably would have been less alarming to hear that Wangji had been injured on his travels. “Can I see him?” A-Yuan asks. His little hands make anxious fists on his knees. His posture is impeccable. He breathes fast, like one of Wangji’s rabbits. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “No,” Xichen says.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “I want to see him,” A-Yuan says. He’s too old to make demands like this, and Xichen can see on his face that he knows it. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “A-Yuan,” Xichen starts, and it’s against the rules to interrupt your elders and against the rules to show excess emotion but the plea bursts from A-Yuan’s heart like an arrow, and plunges into Xichen’s own. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"><em>“Please,”</em> A-Yuan begs. “Please let me see my father.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Throughout his life, Lan Xichen will have many opportunities to repent for his own softness. He will try over and over again to harden his spirit, and he will always fail to do so, and he fails to do so now. Years later, when he is so alone, and questioning every choice he’d ever made in life, he will look out of the windows of his quiet heart and think: at least Wangji lived. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Xichen breathes out. He says, mostly to himself, “He would want to see you.” And then to A-Yuan, “All right. Eat first. Then I’ll take you.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Bellies full, dishes neatly stacked, they go together to a part of the Cloud Recesses A-Yuan would probably not have visited before. The buildings are all newly washed, the wood hallways and paths neatly swept. The stones in the courtyards are perfectly white around the hills and bumps of ornamental plants, dusted lightly with the falling snow. This is a place for adults to go, not for children. But A-Yuan had asked, and Xichen had listened, and now they’re here, and Xichen watches A-Yuan steel his emotions and straighten his face.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> The people there look at Lan Xichen and Lan Sizhui with disbelief on their faces, and whisper quietly as they pass. They thin like trees as the two of them get closer to the heart of Cloud Recesses, until they turn a corner and there is no one at all except for Lan Wangji, kneeling alone on the ground without a cushion or a winter robe. His head is bare, the silver headpieces gone, his hair up only in the half-knot he wears inside the Jingshi. There’s snow in the wispy pieces hanging around his face, snow across the lashed bamboo poles he holds at shoulder height, perfectly still. Xichen’s chest throbs to see him. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> A-Yuan pulls his hand out of Xichen’s and runs the last few steps, flinging himself onto his knees next to Wangji, who flinches visibly. He looks at Xichen instead of at A-Yuan, his eyes narrowing. He’s furious that Xichen allowed A-Yuan to come, to see him like this. The part of Xichen that isn’t soft, that wants to rip the bamboo out of Wangji’s hands and shake him until he’s actually sorry, has no trouble meeting that angry gaze. Wangji will always be the one who looks away first.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> A-Yuan molds himself to Wangji’s side, his little hands resting gingerly on Wangji’s arm, careful not to pull him off balance. He’s a small child. Even for his age, even measured against anything other than Wangji and his height, he’s so small. “Why?” he cries. It’s a large question, open to many interpretations. Why is this happening? Why is Wangji being punished? Why was he left alone? </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “This is his decision,” Lan Xichen says carefully. “A-Yuan, there are consequences to every action.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> But A-Yuan shakes his head. “No,” he says, his fingers tightening on Wangji’s arm. “No, why did you - where did you <em>go?”</em></span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"><em> Tell him,</em> Xichen thinks. <em>He knows who the Yiling Patriarch is. You taught him yourself. Maybe he would remember more, if given a chance to. Maybe you could grieve together. Tell him.</em> But Wangji says nothing, stares straight ahead, looking through them.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “Take me with you next time,” A-Yuan begs. “Please, take A-Yuan with you.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Lan Xichen’s voice turns so sharp it’s as if Uncle is speaking through him. “There will be no next time,” he says, and then says again, softer, his eyes flickering to A-Yuan, “Wangji, there are consequences to every action.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Wangji’s eyes widen. His breath comes as shallow puffs in the chill air. Xichen’s breath doesn’t come at all. The threat hangs between them, stretching as thin as Xichen’s patience, his hope. Neither of them say anything for a long time.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Wangji looks away first, as Xichen knew he would. He squeezes his eyes closed and lowers his head. He sways, almost imperceptibly, closer to his child. He nods once. Xichen’s breath tumbles out of his chest.<span class=\"Apple-converted-space\">   </span></span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">It’s started to snow again, just little whispers against A-Yuan’s cheeks. Seeing this, Xichen holds out his hand. “Let’s go inside,” he says. A-Yuan looks to his father, who finally looks back. He gives a small shake of his head. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">A-Yuan doesn’t protest. But instead of taking Xichen’s hand, he reaches into his sleeves, digging around for a moment before he pulls out a rumpled, faded-brown grass butterfly, and gently sets it on Wangji’s knee. He wipes his face, climbs to his feet, and gently brushes the snow out of Wangji’s hair. Only then does he take Xichen’s hand and allow himself to be led away, looking over his shoulder until father is out of sight once more.</span>\n</p>\n<p class=\"p1\"> </p>\n<p class=\"p1\"> </p>\n<p class=\"p2\" align=\"center\">\n<span class=\"s1\">-</span>\n</p>\n<p class=\"p1\"> </p>\n<p class=\"p1\"> </p>\n<p class=\"p2\">\n<span class=\"s1\"> The first time Lan Sizhui leaves the clouds and represents Gusu Lan to the world, he is ten or eleven years old. They travel by boat, and he is sick the entire length of the journey. He is sick from the moment he steps on their boat each morning, and for hours after they disembark at night. It is three full days of suffering, broken only by the humiliation of Hanguang Jun bringing him broth and clean wet cloths to wipe his face. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> The trip comes three months after he’d donned the white uniform of a junior disciple and left the Jingshi for the dormitory his cohort will live in throughout their training. Two months after that, a letter had arrived in Cloud Recesses. Enclosed in the purple scroll was an invitation to a Cultivation Conference, written on purple paper. It was delivered during the evening meal, on a night that Lan Sizhui had been eating with his family instead of his peers, so he’d been present as Master Lan unrolled it, read it through carefully, and then passed it to Uncle to read.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“They must have finished the renovations to the hall,” Master Lan said.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“I will send Gusu Lan’s acceptance,” Uncle said.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Father’s lip had curled, very slightly, but he said nothing.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Wangji, you will attend as well,” Master Lan said. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Father and Uncle looked at each other. “We’ll take Sizhui with us,” Uncle said, after a moment. Master Lan made a noise into his beard, and Uncle added, “He’s old enough. He will need to know about these things, given his position in the family.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Uncle rolled his eyes to the heavens, but only said, “You will do as you like.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">And here Sizhui was, making a mess of everything. “I’m sorry,” he begs Hanguang Jun, the first night. “I don’t know what’s wrong with me,” he says on the second. On the third he says, as determined as he can manage, “I won’t eat anything at all tomorrow so that when we arrive I can stand with you to greet our hosts.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Father wipes the sweat off Sizhui’s forehead, and smiles his almost-smile. “In the morning, you’ll eat,” he orders. “The ceremonies tomorrow aren’t important. Rest, and be ready for the next day. There’s much for you to learn.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Lan Sizhui is eager to learn, eager to show himself as a credit to Gusu Lan, eager to see famous cultivators perform feats of swordsmanship and archery and song, eager to see a place so different than his home, but he is sick instead - and so miserable that he doesn’t notice at all the tight, pained way his father moves, the way he speaks even less than usual, the way his hands hold a tremor almost too fine to be seen. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Yunmeng is indeed beautiful, even if Lan Sizhui has to watch their approach through their boat’s slitted curtain, his face propped up on Hanguang Jun’s bundled outer robe so that he can feel the breeze on his face, and also be close enough to the water in case he needs to throw up again. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“How are you from Gusu,” Lan Jingyi says, though he sounds more confused instead of disgusted. Lan Sizhui, who by this time remembers nothing of a life before the clouds, wonders the same thing.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">The lake they enter stretches almost as far as the eye can see, gracefully dotted with strange plants that sprawl across the surface of the water, which has become so shallow that Lan Sizhui can see flashes of carp scales almost within reach of his fingertips. He throws up one final time before they make their landing - partially out of fear that he’ll do it on the dock instead, right at the clan leader’s feet, but also partially because as they get close the air becomes redolent with things he’s never smelled before, like chili peppers, and spices that numb the tongue and heat the blood, and fatty meat grilled on an open flame. He isn’t the only Gusu Lan disciple who looks queasy clambering onto Lotus Pier.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">He doesn’t throw up at the clan leader’s feet, which he will offer prayers of gratitude for later since the Jiang clan leader is fierce and unfriendly and disconcertingly uncourteous. The most ill-mannered person Lan Sizhui can remember meeting is Lan Jingyi, so Sandu Shengshou is an unappetizing glimpse into the world outside of Gusu. But Lan Sizhui is a forgiving and optimistic child, and more importantly knows he’s only expected to sit silently and absorb knowledge from his elders, so there’s no need to be too frightened. The next day, once the sea sickness has passed, he diligently starts to record his observations for Hanguang Jun, who will save them in a lacquered chest along with A-Yuan’s first pair of shoes, his battered toys, his best schoolwork, and many, many childish drawings of rabbits. (Decades later, he will return these faithful notes to Lan Sizhui as “preparation” for assuming leadership of Gusu Lan, and Sizhui’s other father will laugh himself sick upon reading them.) </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">He keeps as close to Hanguang Jun’s hem as he can over the next few days, which is not close at all, not nearly as close as Sizhui is used to or would like. It’s not only that Hanguang Jun is very important, and many people want his brusque opinion on this matter or that; or that as the smallest and most junior of the Gusu Lan disciples (excepting Lan Jingyi), he is seated or standing in the least important position (excepting Lan Jingyi). But it is also true that Hanguang Jun seems strangely forgetful. He is far away even when Sizhui is standing right next to him.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">But to Sizhui everything seems fine until the fourth day. The Gusu Lan contingent has been housed right next to the lake, in a series of rooms circling a lovely little courtyard with flower patterns everywhere. They light their lamps in a pale blue dawn, the morning so misty that it’s seeped under doors and through open windows. Lan Sizhui loves it, loves the strangeness of it; he feels like he’s woken up in a magical land. When mist comes to Cloud Recesses it chills the bones, but here it’s warm like bathwater, like how he imagines the lake with its strange plants to feel. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">On the first morning Father had called Sizhui to his room, so early he was still stumbling bleary-eyed and queasy, and it had been the entirety of the time they spent with each other for the whole day, so on the next day and the next Sizhui had gone without needing to be called. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">On the fourth day he wakes early. They eat breakfast with Uncle, and then Father combs Sizhui’s hair for him and fixes his ribbon, something he hasn’t done since Sizhui left the Jingshi. The first morning it almost lulled him back to sleep, but this morning he can barely sit still. He wants to talk about the archery competition that yesterday Hanguang Jun had easily won. He wants to talk about the monsters he’s heard about in the discussions, and whether Father and Uncle have ever faced anything so terrible. He wants to know what exciting things they’ll see when they all go into Yunmeng today.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">But Father remains seated when Uncle and Sizhui rise to leave, and since Uncle doesn’t ask why Father isn’t coming with them, Sizhui can’t ask either. He smooths his face over and doesn’t pout, though he is a little quiet as they meet the Jiang disciples who will escort them around Yunmeng. Sandu Shengshou isn’t one of them, thankfully, although Lianfang Zun is, who Lan Sizhui knows well from his frequent visits to Cloud Recesses. Lianfang Zun is kind, and is such a knowledgeable tour guide that the Jiang disciples stop talking and listen to him instead, even though he isn’t from Lotus Pier or Yunmeng at all. He buys Sizhui and Jingyi flaky scallion pancakes, and spicy peanuts, and sweet red bean buns when the spiciness makes their eyes water.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Yunmeng is beautiful, and Lan Sizhui is learning so many wonderful new things, but he can’t shake off his quiet feeling, no matter how much Lan Jingyi tries to trick him into eating more peanuts. Zewu Jun smiles his real-smile all day, the first time Lan Sizhui has seen it in Lotus Pier. He doesn’t seem bothered that Hanguang Jun stayed behind, or that Lan Sizhui’s chin is low against his chest, or that Lan Jingyi eats so much that he’ll spend the rest of the night being very sick. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Over lunch, Lianfang Zun remarks, “It’s good to see your brother at the conference. I’ve been afraid he would never again leave Cloud Recesses, except to defend fishing villages from fierce corpses.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Zewu Jun actually laughs. He says, “He had to be ordered to attend, A-Yao. Do you know, this is the first time he’s ever been to Yunmeng at all? All this time, he’s avoided the region entirely.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Lianfang Zun makes a thoughtful noise, sympathetic. “There are many ghosts for him at Lotus Pier,” he says.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Zewu Jun admits, “I wake up every day expecting him to have abandoned us all and gone back to Gusu, or vanished into the wind.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Lan Jingyi kicks Lan Sizhui under the table. They make eyes at each other to express their outrage: <em>Abandon us?? Never!</em> But Lianfang Zun only sighs. “It’s clear he’s unhappy,” he says. “After yesterday’s performance, others came to me to complain about -” but he stops himself. His eyes are so apologetic that they look like mountain pools, fascinating in their clarity, every stone exposed.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“It was an,” Zewu Jun says softly, “ungracious thing to say.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Only unpolitic,” Lianfang Zun says soothingly. “We live in peaceful times now, Er-ge. People want to forget about the past.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Except my brother,” Zewu Jun says.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">What Hanguang Jun had said, after the final arrow had soared and the crowd had cheered and Sandu Shengshou came to congratulate him on the win, was, “Everyone better than me is dead.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Lianfang Zun puts a hand over Zewu Jun’s. “Give him time,” he says. “He will take off the mourning robes eventually.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Zewu Jun sighs. “It’s been almost seven years.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “Three of which were spent in,” Lianfang Zun retorts but then he looks at Lan Sizhui and Lan Jingyi and doesn’t finish the thought. He continues, more quietly, “He’s a private man. You know this better than anyone. He will come back to the world if he is given the space and the choice to do so.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“I only ask that he stays until the end of the conference,” Zewu Jun says, but his smile is back, the real one. He turns his hand over to wrap his fingers around Lianfang Zun’s. “If he manages it I will not ask anything of him for another seven years.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">On the way back to Lotus Pier, Lianfang Zun buys one more treat. He crouches a little so that he’s the same height as Lan Sizhui. “Why don’t you give this to Hanguang Jun,” he suggests, and smiles. “He wouldn’t have had this before. I bet it will make him feel better.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Hanguang Jun is not in their rooms, though. He’s not at the training fields. He’s not in the big hall where all of the important meetings have been held. Lan Sizhui doesn’t run, because running is forbidden even when you’re not in the Cloud Recesses, but he walks as quickly as his little feet will carry him. Hanguang Jun would never abandon them, but he <em>has</em> been sad, and Sizhui feels foolish not to have seen it before, because he could have <em>helped.</em> There are many adults bustling around, and they don’t pay any attention to him at all.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">He finds his father, finally, in a little courtyard tucked down a winding walkway so far away from the busy places that the buildings are more like piers themselves, up on stilts above the lake. Sizhui’s feet slow automatically, finding pace with the sigh of water moving back and forth underneath the walkway. It’s a peaceful place to sit and rest, with a beautifully carved wooden bench and a pretty little tree in a pot next to it. The sun is dying behind the far away hills, and it bounces over the surface of the water and paints patterns along the dark wood, the little pavilion, Father’s silver headpieces, and his bowed head. He doesn’t react when Sizhui approaches. His eyes are the kind of far away that keeps Sizhui quiet, waiting to be noticed. He waits for a long time.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Father’s expression is strange when he looks up. He says nothing. He reaches up and strokes Sizhui’s hair. The corners of his eyes are very red. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">There’s a quality to his stillness that is unnerving. A little scary.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“I brought you something,” Sizhui blurts. He pulls the little paper bag out of his sleeve and unrolls the top of it, holds it out for Father to take. He’d saved the whole bag just like Lianfang Zun had told him to, but he’d eaten a little bit from Lan Jingyi’s portion and he thinks maybe Father will like them, that maybe it will help. “They’re fresh lotus seeds.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Father flinches. His fingers twitch back from where they were about to lift the bag of seeds out of Lan Sizhui’s hands. But Sizhui had already had the bag set on his fingertips, and it spills everywhere. The lotus seeds land on the bench and bounce off Father’s robes. They fall between the planks and disappear soundlessly into the water. Sizhui stares in horror. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">And then jumps - when a very loud, very angry voice calls out to them.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Lan Sizhui’s insides turn to dust when he sees who is yelling. “What are you doing here?” Sandu Shengshou demands, from far away. “This is not a public area of Lotus Pier. Who are you looking for, Lan Wangji?”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Hanguang Jun is on his feet in an instant, pushing Lan Sizhui behind him. Behind his sleeve, Sizhui watches Sandu Shengshou stomp down the pier. “Well?” Sandu Shengshou says. He’s so loud. His fist is sparkling with purple lightning. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">For seven years, Lan Sizhui has not heard a raised voice or seen a fist lifted in anger. Hanguang Jun’s hand tightens on his shoulder, but it’s shaking, and he doesn’t say anything - and for the first time in all his life Sizhui realizes that maybe he can’t.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">His feet move before his head can think about it. He ducks under Hanguang Jun’s hand - and then steps in front of <em>him.</em> “Please, Clan Leader Jiang!” he says, and bows as best as he possibly can. “Please, it is this disciple’s fault. I - I wanted to see the fish in the lake. Hanguang Jun was only bringing me back.” He looks up at Hanguang Jun and says, sincerely, “I’m sorry, Hanguang Jun.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Sandu Shengshou stares at him, and then looks at Hanguang Jun. He wears so many emotions on his face that it’s dizzying for Lan Sizhui to look at him, but at least the lightning has gone away. Lan Sizhui is frozen in his bow, his eyes trained on the wood beneath their feet. His hair falls down over his shoulders. Through the slats he can see fish, wriggling just below the glittering surface. He wishes Hanguang Jun would put a hand back on his shoulder. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Is this your kid?” Sandu Shengshou says abruptly. “He looks like you.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Lan Sizhui looks up. The question curls unpleasantly in his stomach. He’s never been asked, not outright, not like this. Everyone in Cloud Recesses knows who Lan Sizhui is, but equally they all know what Sizhui isn’t. When neither of them say anything, Sandu Shengshou laughs. “No,” he says. “I don’t suppose there’s any woman who would have caught your eye, Second Master Lan.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Lan Sizhui frowns. He doesn’t understand what Sandu Shengshou means, not really, but it sounds bad, like an insult. “Hanguang Jun is my father,” he says, as firmly as his rabbit heart will allow.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Faintly, too soft to be heard over the sound of water, Lan Wangji exhales. His eyes are unfocused, unsteady, aimed somewhere in the middle distance. His expression doesn’t change, not more than it ever really does. Only the miniscule parting of his lips betray that he feels anything at all, much less that he is breathless and overwhelmed: so sad that he feels it as a mortal wound, so furious that he would probably choke if he tried to give voice to his contempt. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Lan Wangji has known for years that grief is a tree without roots, that it cannot be dug from the heart by any ordinary means. He lives with his sadness the way he lives with the scars on his back, without hope that either will fade until the seas run dry and the mountains crumble. He has put ten thousand li between himself and the things he can never have, never undo - and if it had been his choice, the whole of Yunmeng would never have known his name. But there have been few choices offered to Lan Wangji throughout his life, and fewer still that mattered. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Uncle had said to go to Lotus Pier, so he’d gone to Lotus Pier. Anticipating the pain and finding the reality worse: his grief as fresh as snow, as refined and perfected as a wine aged for many years, which is the same number of years he’d known Wei Ying at all. They weigh him down and make him old. They rob him of the little patience he has for politics and the responsibilities he never really wanted in the first place. He returned to the world to find it more or less as he’d left it, and himself more bitter for the time that had passed. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">So Lan Wangji had left. Had climbed onto his sword when the day was hot and the shifting clouds blocked the white sun, and abandoned his duties and his family, meaning never to return. It wasn’t the first time he had done it, and it’s far from the last. It’s a cycle that happens so often it’s become a habit, whenever he feels like the clouds and the quiet will strangle him. He will deliver Sizhui to his brother’s care and descend the mountain in search of whatever chaos he can lay his hands on. It calms him, and makes quiet the misery that lives in his chest, and makes it easier to come back to Gusu and be Lan Wangji again. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">He’d gotten nearly all the way across the vast lake before he realized that there was nowhere for him in Yunmeng, and no chaos to be found there that would satisfy. His shadow trailed forlornly over the clear water, outlined in stark solitude. He turned back, but made it only to the furthest pier and no further, unable to clear his muddied thoughts and reassemble the armor that had gotten him through the last few days.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">He wants Wei Ying to be alive. That’s the simple truth of it, unadorned by poetry or beauty or any of the words he doesn’t have to describe how much he wants. That Wei Ying is not alive is a mistake that will never be undone. He has pictured, over and over, turning around and simply finding Wei Ying there - whole, alive, smiling, beautiful, the way he should be. Every path he has walked in Lotus Pier, Wei Ying has walked half a step behind. Which had been his rooms? The books he’d owned, the clothes he’d worn, the arrows he’d hunted kites with? His favorite foods? Favorite places to play, trees to climb, ponds to swim through? </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">He’s spent days combing through his memories until they’re barely more than threads, so well-loved and abused that they feel like paper creased until it’s nearly torn. Was he ever told these things? He doesn’t know; he can barely remember. Every dish becomes Wei Ying’s favorite. Every tree is the best tree in Yunmeng to climb. Every heartbeat feels like the echo of a life he only truly was ever on the outskirts of. Every breath strangles him with regret.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">But there - standing between Lan Wangji and the last person left alive that Lan Wangji truly hates - there are the shaking shoulders of his child, narrow and inadequate but there, a shock that is wholly new and one he is truly unprepared to deal with.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">It’s enough of a shock that, standing behind Sizhui, he takes a breath of his own. His head clears a little of the fog that’s haunted him for days. He sees the surprise in Jiang Wanyin’s eyes, the conflict there. Sizhui’s defense of him has pushed them both off-balance.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Lan Wangji is the first to recover, as he always is. He puts his hand back on Sizhui’s shoulder, then pushes him forward. Jiang Wanyin lets them pass, abruptly quiet - his arms folded across his chest, his expression complex. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">When they’re nearly away, Jiang Wanyin calls after them. “Don’t go wandering around anymore,” he says. “You won’t find who you’re looking for at Lotus Pier, Second Master Lan.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Lan Wangji keeps a hand on Sizhui’s shoulder as they walk back to Gusu Lan’s quarters. They’re both trembling, walking too fast. By the time Lan Wangji closes the doors behind them, Sizhui is near tears. He pulls away from Lan Wangji and runs to the desk the room had been equipped with. There is paper and ink and brushes already on top of it, and a pile of correspondence that Xichen had left behind in Wangji’s room for him to read through. Sizhui folds himself down, takes a moment to rearrange his hair and his posture and wipe his face, and then wets a brush and bends to work.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Lan Wangji sits next to him, watching intently. His thoughts tumble through him. He can’t speak, but he wouldn’t know the words to choose even if he could. He’s never had the ability to name his emotions, and especially not if more than one of them comes crashing through him. He might as well try to lure the moon from a pond, or ask the rabbits to interpret his own temperament to him. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">He reaches out and covers Sizhui’s hand with his own, and moves it gently away from the page. Sizhui’s fingers twitch around the brush. He’s only on the fifth precept. “I broke rules,” he mumbles.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">With profound effort, squeezing each word between everything else that’s crowding his heart, Lan Wangji says, “Punishment is waived.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Sizhui’s eyes flicker up to his face, and then back down to their hands. His jaw pushes out a bit, even as a few tears slip from his eyes and trail down his round cheeks. He wants to take the punishment anyway. He’d accepted the consequences of his actions before he’d even stepped forward. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Strangely, Lan Wangji wants to laugh. It would probably scare Sizhui if he did, so he doesn’t, but he lets the feeling settle into his chest, lets his heart get quiet. He pulls one sleeve over his fingers and wipes Sizhui’s tears away as he has so many times before. Sizhui leans into it, unselfconscious in the way that children are if only you let them, and the feeling grows, sets down roots. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"><em>Wei Ying,</em> he thinks, and for once it hurts a little less.</span>\n</p>\n<p class=\"p1\"> </p>\n<p class=\"p1\"> </p>\n<p class=\"p2\" align=\"center\">\n<span class=\"s1\">-</span>\n</p>\n<p class=\"p1\"> </p>\n<p class=\"p1\"> </p>\n<p class=\"p2\">\n<span class=\"s1\">At the age of thirteen or so, most Gusu Lan disciples have been studying cultivation for nearly a decade. They are proficient in the Five Arts (some more than others, depending on temperament and ability) and well-versed in identifying and suppressing monsters, ghosts, and other dangers of the night (some more than others, depending on how scary a particular monster is and whether it is something truly terrible, like a snake or a spider). Their golden cores hum with the desire to prove themselves, to win glory and respect, to see the world below the clouds, to further their cultivation at the feet of the very best.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">So of course it’s crushing when, three days before they are to leave the mountain as junior cultivators for the first time, it is announced that Hanguang Jun will not be the one leading them.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“But <em>why?”</em> Lan Jingyi cries, following Lan Sizhui to the lower meadow where the rabbits live. Whenever Hanguang Jun is not at Cloud Recesses, it falls to the juniors to tend to his colony, or more usually, to Sizhui and Jingyi. It’s forbidden to kill animals within the boundaries of Cloud Recesses, so after many years there are many rabbits, and many snares that lay just outside of the boundaries of Cloud Recesses. The rabbits know no fear and even less respect, and do their best to trip Jingyi as he trails pathetically after Sizhui, distributing lettuce and carrots. “Why isn’t he coming with us?”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“I don’t know,” Sizhui says. He upturns his basket and gives it a shake, letting vegetable scraps rain down on the crowd of hungry little faces at their feet. “He travels often, Jingyi. And I don’t think anyone even <em>asked</em> him if he wanted to escort us.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Why would they need to <em>ask?”</em> Jingyi demands. He throws himself down among the rabbits. “He teaches us all the time. Way more than the other junior classes. And it’s your first night hunt! Doesn’t he want to come?” </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Sizhui laughs. He settles down onto the grass next to Jingyi, but with much better posture. The rabbits hop right on up into his skirts, nosing at his hands for more treats. One particularly fat rabbit, white with a big black spot over one eye, ambles its way over to Jingyi instead and headbutts him in the knee as hard as it can. “We are not friends,” Jingyi tells it angrily.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> “Hanguang Jun is very busy,” Sizhui says. He pulls a carrot out of his sleeve but eats it himself instead of giving it to the rabbit. “We’re lucky to have him as a teacher at all.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Jingyi looks over his shoulders, but there’s no one around. Why is Sizhui being so formal? He’s not even <em>looking</em> at Jingyi - he’s got his head bowed over the rabbits, gently fending them away from his carrot. “Yeah, but,” Jingyi says, chewing at his bottom lip. “Won’t he be worried about you? <em>I’d</em> be worried about you. Maybe he’s <em>too</em> worried. Maybe he thinks if he sees you in danger he won’t be able to stop himself from swooping in and saving you, and then you wouldn’t learn <em>anything</em> and probably the rest of us wouldn’t either.” </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Sizhui shoots an elbow into Jingyi’s side, and then pats his shoulder soothingly, which is nice because Sizhui is <em>very</em> strong. “Worry about yourself,” Sizhui retorts. “Isn’t your mother’s cousin leading us? Fifth Senior is a strong cultivator.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“I guess,” Jingyi admits. Unwillingly, he pets the fat rabbit. It flings its entire long body at him shamelessly. “But he’s not <em>Hanguang Jun</em>. Don’t you just - feel better when he’s there?”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Sizhui smiles so warmly that for a moment Jingyi feels like one of the rabbits, fat and fearless and secure. “Of course I do,” he answers, and nudges Jingyi with his shoulder. “But he’s taught us really well. We’ll be fine.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">They leave the mountain three days later, in two straight rows. Their white robes and forehead ribbons snap and flutter in the wind. They make for a beautiful sight as they walk behind Lan Zhiyi, even though sometimes their footsteps slow to exchange grins behind their sleeves. Even Sizhui and Jingyi can’t help but feel giddy, for all that they’d agreed in the meadow that they <em>would</em> feel better if it was Hanguang Jun leading them. Their senior, Lan Zhiyi, <em>is</em> strong, but he’s also impatient with younger disciples, and believes that beatings are love and name-calling is affection, especially when it comes to Lan Jingyi. He allows them only one break for rest, to fill their waterskins at a river and rest their feet and eat whatever snacks their families had packed for them, and he spends most of it shouting at Jingyi.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Stop fooling around!” he says.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“I wasn’t!” Jingyi shouts back, hopping off the boulder he’d been trying to climb.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Put your sword away!” he says.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“It wasn’t out!” Jingyi cries, resheathing his sword behind his back.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“If you sit down and eat he’ll stop yelling at you,” Sizhui tells Jingyi, and hands him a steamed bun. Arguing with Sizhui is like arguing with a wall, so Jingyi takes it and stuffs half of it into his mouth instead of trying to convince him that nothing stops Lan Zhiyi from yelling, not even if Jingyi tried his best to <em>behave like a proper Lan.</em> The inside of the steamed bun is still warm, and full of mushrooms and bamboo, which is a combination that Jingyi loves and Sizhui hates. He must have asked the kitchen for it specially, knowing that Jingyi would forget to bring any food for himself. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“You’re right,” Jingyi says around mouthfuls of mushroom, feeling mollified. “We need to keep our strength up before doing battle. Do you want to practice sword fighting for a little while, just so we’re warmed up before we come upon any fierce corpses?” </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Sizhui grimaces at him. Jingyi hastily wipes his mouth on the inside of his sleeve, which is already stained from breakfast. “It’s only one fierce corpse,” Sizhui says. “You don’t have to be scared.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“I’m not scared,” Jingyi says immediately. He reaches into Sizhui’s bag for another bun. Sizhui dodges expertly, and then relents and hands Jingyi one anyway. Mushroom and bamboo again. The warm, soft taste of it melts comfortingly on Jingyi’s tongue. “You’re right though,” he says, swallowing. “You’re right. It’s only one fierce corpse.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Their destination is only two or three li from Caiyi Town. When they passed through Caiyi, Sizhui became very nervous that a boat would be involved, but they only end up following a canal that becomes a stream that becomes a charming little river, with fish and birds and pretty reeds that grow from it. The water keeps pace with them, and its surface swarms with dragonflies. “Swap positions with me,” Jingyi hisses at Sizhui, “I want to look at the river.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“You should pay attention to Fifth Senior instead,” Sizhui says, but he does it anyway.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Lan Zhiyi brings them to a halt just as night falls for real, on the side of a dusty road that’s barely better than a trail through the forest. “No fooling around,” he warns them sternly. “Even a low-level corpse can hurt you, if you’re not careful. I’ll scare it into the open and you’ll take turns freezing it with the talismans I have for you. If anything unusual happens, don’t be brave - just run away and let me handle it. That means <em>you,</em> Jingyi.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“I wasn’t doing anything,” Jingyi protests. He says to Sizhui, “I wasn’t.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Sizhui ignores him. “Senior,” he asks instead, “why haven’t we gone to interview the villagers about the fierce corpse? Shouldn’t we find out more information about it? Where it came from, if there are any other disturbed graves in the area, or -”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“We already have the information we need,” Lan Zhiyi says. “Two villagers came to Cloud Recesses a week ago to ask for our help. It’s only a low-level corpse, but it keeps bothering their livestock. It’ll be good practice for you.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Sizhui frowns. He doesn’t seem nervous at all, even though he’s <em>talking back.</em> “But Hanguang Jun says -”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"><em> “Hanguang Jun,”</em> Lan Zhiyi says, in the kind of tone he usually saves for Jingyi, “isn’t here. You’re listening to me tonight. Do you understand, Lan Sizhui?”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Sizhui’s lower lip juts out, but he drops his gaze. “Yes, Senior,” he says.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Lan Zhiyi turns away. He pulls a stack of talismans out of a qiankun pouch and starts counting through them. He mutters angrily to himself as he does it, quietly enough that Jingyi only catches some of the words, which sound like “not enough chaos” and “still chasing after his dead wife.” He rouses himself to hold out a portion for each junior. Jingyi accepts his without a protest, and so does Sizhui, even though he’s still got the ghost of backtalk lurking in his eyes.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">They leave the river behind as they walk on. The forest feels too quiet around them, the only sound the crunch of their boots on the road. It’s too early in the night for the frogs to sing, and too early in the year for cicadas, and after a few minutes every sound starts to sound like the shuffle of corpse feet. Jingyi wipes his sweaty palms off on his clothing, and then puts one hand back on his sword.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“You’ll be able to smell it before it gets close,” Sizhui says to him, out of the side of his mouth.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“I know,” Jingyi says quickly. He touches the talismans in his sleeve, crinkling the paper anxiously. “Does Hanguang Jun really have a dead wife?”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Sizhui turns towards him, his thick eyebrows knitting together in confusion. Did he not hear Lan Zhiyi complaining? “No,” he says. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“No?” echoes Jingyi, and so do the two boys in the next row behind them.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“No? Where did you come from, then?” Shuren says, leaning forward.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“No? Isn’t that where he goes all the time, to look for her soul?” Liuxian asks, close enough that his sword handle pokes into Jingyi’s back.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“He goes to help people,” Sizhui says, exasperated now. His face is a pale smear against the black trees. He walks facing forward, and doesn’t turn around even when Jingyi shoves Liuxian back into formation. The boys bringing up the rear titter behind their sleeves, and everyone falls silent quickly when Lan Zhiyi whips a stern look over his shoulder at them.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Focus,” he snaps at them. “We’re almost at the farmhouse.” And then something lunges out of the darkness and drags him to the ground.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">For a moment all of the juniors are as still as trees. The <em>thing</em> is on top of Lan Zhiyi, and they scuffle right there in the dirt, a wide circle of white and brown robes, and there’s less noise than Jingyi thought there would be - to fight a fierce corpse, but also just to fight <em>anyone</em>, to fight for real instead of just sparring, where you shout to be scary and also because it’s fun to shout. The thing is shaped like a man, and it sounds like a man, making the same little muffled grunts that Lan Zhiyi is making, and it’s only as the seconds flow by and they’re <em>still fighting,</em> Lan Zhiyi still struggling and grunting with his back on the ground, that Jingyi smells it, faint and heavy. This corpse is so barely dead that he hardly stinks at all, the smell more like sour sweat than rot, his skin colored like skin instead of slimy green. Hanguang Jun’s voice echoes through Jingyi’s ears: <em>this one can’t have been dead more than a day or two. It’s a different corpse. There’s more than one corpse in the woods.</em></span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Run!” Lan Zhiyi roars.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Jingyi’s feet obey before his mind can even hear the words. He runs. He grabs Sizhui by the elbow and together with the other junior disciples, they flee into the darkness. The moon isn’t any brighter than their robes, and though he can see the farmhouse up ahead through the trees there’s not a single lamp lit inside of it, all the windows cold and black. There’s only a pathetic little fence around it, more brush than anything else, good for keeping chickens fenced in but not for much else. “We’ll lock ourselves inside the house,” Sizhui calls, and they run faster. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">They fling the door closed behind them. Inside is a small space, entirely dark and smelling of hay and stale cooking. Xieren is the first to light a talisman, and the yellow flames reveal eight scared, pale faces, surrounded by the detritus of a life: hammers and chisels and wicker frames and half finished objects, scattered and dusty on work tables, everything from farm tools to musical instruments. It’s cold inside, like the windows were left open, and it smells - strange. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Is everyone okay?” Sizhui asks. Each boy pats himself down, checks his sleeves, wraps his fingers around the handle of his sword, breathing hard. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Yes,” Jingyi answers, and the rest of them nod fervently.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Do you think Fifth Senior is okay?” Liuxian whispers.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“He’ll be fine,” Sizhui answers firmly. “It’s better if he doesn’t have to worry about us. We’ll stay here, and if he doesn’t come find us in an hour, we’ll send up a signal flare.” </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Everyone nods again, and a few people reach out and pat Sizhui on the shoulder, as if in thanks. Jingyi’s one of them, and Sizhui shoots him a little smile, like he’s saying thanks back. It’s a good plan, and Jingyi feels safer for it, even though the smell of the place is climbing up his spine just like the silence in the woods did. Is that stale cooking oil? Had whoever lived there hung game up in the rafters and forgotten about it? </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Can we light a candle?” Jingyi asks abruptly. “Is there a brazier we can -”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">There’s a low moan from the other side of the room, where a dim, dark doorway sits. All of the juniors go silent as one. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">The talisman flickers in Xieren’s hand, which has started to shake. The light bounces in his hands and makes lies of the shadows, so much so that when a green, greasy hand wraps around the doorframe, Jingyi can’t make himself believe it’s really there. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">The corpse hauls itself piece by piece into the light. Its feet slide across the floor like they’ve been nailed to the boards. Its clothing is half rotted off, and dusted with animal hair and mud. The wind blows through the room and the stench of it rises abruptly, filling the small space completely. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Jingyi’s heart is beating so fast that suddenly he can’t hear anything else. The room is small and he’s the closest one to the corpse. What should he do? Throw a talisman at it? What if he misses? His sword is in his shaking hands. Should he attack? What if it moves as fast as the one that had come out of the woods? What if it hurts him?</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> The corpse takes another step into the room. It’s making a noise low in its throat, something not quite like a groan. It’s staring right at Jingyi, and he can’t look away. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Everyone, get back outside,” Sizhui says. He sounds like he’s very, very far away. “Don’t push, but do it quickly. If it follows us we’ll freeze it with talismans out in the yard just like we planned. If it doesn’t follow we can trap it in the house again.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">The wind shifts again, cold on the back of Jingyi’s neck, which is damp with sweat. Someone has opened the door. The corpse is closer, its arms coming up, groping for Jingyi, almost close enough to reach past his outstretched sword. He needs to turn around. He needs to follow Sizhui’s lead and go outside, where they can maneuver better, and fight the corpse together. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Jingyi!” Sizhui shouts. “Jingyi, come on!” </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> If he’d had another moment - just one more second - Jingyi would have run. He’d tensed to run, his whole body going stiff with the anticipation of movement. But then Xieren drops his talisman, and the lights go out.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Everything happens all at once.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">He feels something collide with his sword, and then yank it right out of his hands. He hears metal clatter on the floor, and he turns to run.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Pain flashes bright against the back of his eyes, sharp and bright enough that he almost thinks someone’s lit another talisman.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> His face feels abruptly wet and hot. He snorts blood into his nose and down his throat and chokes on it.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> A huge, awful weight collides with his back.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Everyone around him shouts, and three boys get stuck trying to run out of the open door.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> And Sizhui screams, “Jingyi!” </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Jingyi registers all of this in the time it takes to hit the ground, the fierce corpse on top of him. He’d cried out in fear as he fell, and the weight crushes the rest of the air out of him. The absence of oxygen is as shocking as the pain of it all, of being crushed against the wooden boards. There’s blood streaming down his face and into his nose and mouth and he doesn’t know how it happened, did the corpse bite him, did it hurt him? The corpse is so much <em>bigger</em> than he is, all the way grown up and twice Jingyi’s weight, and if he could <em>breathe</em> he could fight back but he’s choking instead.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> Something collides with the corpse. Its bulk rocks a little, and one awful dead hand lifts from Jingyi just long enough to fling whatever it is away. Jingyi barely registers the movement and he doesn’t at all hear the thud of a small body as it hits the work table all the way across the room. He’s struggling against the horrible, suffocating mass on top of him, still choking. Only seconds have passed since the light went out. The corpse’s humid breath is hot against his face. He’s not going to be able to overpower it.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> The worst sound Jingyi has ever heard cuts abruptly through his terror, and leaves a silence in its wake so profound that even the coughing, sobbing sound of Jingyi’s own breathing feels muted. It’s not the noise itself but the feeling that follows it, dark and sticky. It fills the room like oily smoke and suddenly, his heart pounding, Jingyi realizes that he’s fighting nothing: that the corpse has stopped, that its huge body is curved above him and not moving, and that his hands are free.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> He plunges his right hand into his left sleeve and blindly shoves all of the talismans he can at the corpse’s face.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\"> For a second nothing happens. Then, slowly, the corpse collapses, burying Jingyi again under its weight. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Voices collide, far above him. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Is he dead?”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Help!” </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“We need to send a flare!” </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Is Jingyi <em>dead?”</em></span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Jingyi tries to move and can’t. He’s stuck firm, his breath coming as thin, pathetic whistles. “Urgh,” he wheezes.<span class=\"Apple-converted-space\">   </span></span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">A pair of knees hit the ground next to his face, barely visible through the tacky blood in his eyes. “Get it off of him,” Sizhui says urgently.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">It takes all of their combined strength to roll the corpse off of Jingyi. Sizhui’s arms go around his shoulders halfway through and pull him upright. Sizhui speaks the whole time, directing the other boys where to go, to fetch water from the pump outside, to be careful of Jingyi’s legs, to angle the dead weight properly. He’s shaking, hard enough that it shakes Jingyi too. Each time he inhales, he shudders at the top of the breath. Jingyi wraps a hand around Sizhui’s wrist. Sizhui puts his hand on top of Jingyi’s, and they hold onto each other until Jingyi is all the way free.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Someone else puts a wet cloth to Jingyi’s face, and starts wiping the blood off of him. It stings when it touches his forehead, and Jingyi hisses automatically between his teeth. “Sorry,” he hears Liuxian say. “You ran into the tip of my sword when the lights went out.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Was that what happened? In his head he hears the ghost of his mother say, <em>you’re lucky you still have both your eyes.</em> He shivers, and Sizhui’s hand tightens around his own.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Suddenly, like stones being dropped into a dark pool, Xieren says, “You used demonic energy.” </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Sizhui tenses all over. “No I didn’t,” he says. Jingyi would struggle upright but he’s not sure that he can now - Sizhui is <em>very</em> strong, and he feels like he’s held by a rock. He stays still, stuck in the middle, waiting impatiently as whoever wipes blood out of his eyes.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Yes you did,” Xieren says. “I saw you. You picked up that dizi and you stopped the fierce corpse with it. Those are the Yiling Patriarch’s tricks.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Energy is energy,” Sizhui says. “Hanguang Jun says so. To be strong cultivators we need to be quick and use any tools at our disposal. That’s all that I did.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Sizhui,” Jingyi tries to say, but there’s still blood in his mouth and it comes out strange and garbled. He spits, and the towel comes obligingly up to wipe his lips. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“It’s heretical,” Xieren says, but he sounds a little uncertain about it. Sizhui’s the best student among all of the juniors, and everyone’s friend. The question of using resentful energy has come up in their lessons before, and each Lan senior seems to have a different opinion of it. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“It’s the Yiling Patriarch’s invention,” Shuren says, sounding less uncertain. His cousin was one of the ones who left Gusu Lan for Moling Su, and that whole group had been full of opinions about the Yiling Patriarch.<span class=\"Apple-converted-space\">  </span>“Grand Master Lan says anything that that the Yiling Patriarch made is evil.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“The Yiling Patriarch invented the Stygian Lure Flags too,” Sizhui says. His arm tightens around Jingyi’s chest, who lets out an uncomfortable gurgle. “Gusu Lan didn’t make that up. And the fire talisman you’re holding, Xieren, he made that too.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">And the Compass of Evil, but maybe Jingyi’s the only boy that has one of those, because Sizhui doesn’t mention it. Jingyi taps on Sizhui’s arm, trying to get him to let up, but Sizhui doesn’t seem to notice. He can’t open his eyes yet but he can hear the other boys shuffling around the room, drawing closer together, maybe. Drawing together against <em>Sizhui,</em> maybe. Everyone sounds so <em>tense</em> that his heart, just barely having accepted that maybe they didn’t get killed by a fierce corpse, picks its pace right back up again.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Hey,” Jingyi tries to say, but no one listens. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“You have to turn yourself in for punishment,” Shuren says, sounding smug about it.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Punish myself for <em>what?”</em> Sizhui snarls, and the tone is enough to spur Jingyi into action, <em>really</em> into action, because he’s never heard Sizhui raise his voice, not ever, and especially not against his own family, and he knows Sizhui would never hurt anyone but right now he’s squeezing bruises into Jingyi’s already bruised chest and he’d like everyone to just <em>stop now! </em></span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Everyone stop yelling!” Jingyi yells, as loud as he can, and it’s enough to startle everyone into obeying.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Jingyi flails around until Sizhui finally lets him go, startled. Jinygi wipes his eyes with his grubby sleeves and finally, finally is able to open them. His eyes have been closed for so long that the light from the candles wavers strangely, and he has to blink hard a few times before everyone’s faces swim back into focus. Like he’d thought, the rest of the boys are clumped together in a weird, suspicious circle at the corpse’s feet, except for Liuxian, who’s kneeling next to Jingyi with a bloody cloth and a bucket full of water he’d barely snatched out of range of Jingyi’s thrashing limbs. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Jingyi fixes everyone with an icy glare. It works pretty well, probably because he’s still pretty covered in blood; Xieren actually shrinks back behind Shuren’s shoulder. “Stop talking,” Jingyi tells them. His voice shakes a little, but he sounds as vicious as he means to be (which isn’t nearly as vicious as Sizhui just now, but that’s not what’s important right now). </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">He turns to Sizhui, and sees him too for the first time: bruised all over, covered in Jingyi’s blood, clean tear tracks on his cheeks, and a look on his face that’s a little scary, one that Jingyi has never seen before. It kind of makes Jingyi want to cry too, if he’s honest, but maybe that’s another effect of almost getting his head taken off by a fierce corpse.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">So Jingyi grabs Sizhui by his shoulders, and gives him a good hard shake. “You stopped that thing with a flute?” he demands. “That awful noise was a <em>flute?”</em></span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Sizhui blinks at him. His chin is low against his chest. He thinks Jingyi is going to yell at him too. “Yes,” he admits, after a moment.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“That was terrible,” Jingyi informs him, and gives him another shake. “Hanguang Jun would have your skin for playing so badly. If I was a fierce corpse I would have died a second time.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“I,” Sizhui stutters. Another tear rolls down his cheek. “I only know how to play the xiao, a dizi has a completely different mouthpiece.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Ugh,” Lan Jingyi says. He looks down at his sleeves in despair. He finds a clean corner down at the very bottom of the left one, and uses it to wipe the tears off of Sizhui’s face. He puts his other arm around Sizhui’s shoulders, and shoots a hard look at the other boys. “Don’t be embarrassed,” he says to Sizhui, and gives particularly fierce attention to Shuren. “We won’t tell Hanguang Jun you can’t play the dizi.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Shuren drops his eyes. Xieren scuffles his feet across the floor. Liuxian bursts into tears, drops his bucket of water, and flings his arms around both Jingyi and Sizhui. After a moment, the other boys kneel down on the wet ground and do the same, and that’s exactly how Lan Zhiyi finds them, a little while later.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">They make for a sorry sight, trudging home as the sun rises. Jingyi came off the worst of it, of course - his whole head wound with bandages, his robes stiff with dried blood and sloughed off pieces of corpse - but Lan Zhiyi had the harder fight and looks almost as battered. Sizhui makes little wheezing noises as he walks, one hand across his ribs to protect where he’d gotten thrown across the room and into a table. The rest of the juniors are dusty and disheveled, and stifling yawns behind their sleeves as they walk. They see a few villagers on their way back - early risers tending to cattle or squatting in their yards, watching over a child or washing clothes - but no one waves. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">By the time they’re nearly to Cloud Recesses, Jingyi is nearly one of the walking dead himself. He’s looking downwards, watching his sore feet very closely to make sure they don’t make him slip and tumble back down the mountain, so he doesn’t notice that anything is wrong until Lan Zhiyi says, “Oh no.” </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Hanguang Jun is waiting for them at the gates. He’s wrapped in the morning fog, so still that for a moment Jingyi mistakes him for a beautiful statue. The other juniors fall silent as one except for Sizhui, who sucks in a breath so fast that it actually startles Jingyi.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Are you okay?” he asks in an undertone. “Did you get hurt and not tell me?”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“No,” Sizhui says weakly. He doesn’t look over at Jingyi, but Jingyi sees him wipe his hands off inside his sleeves - like he’s nervous, which is weird.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Hanguang Jun watches them approach and make their bows. His eyes flicker over each of them without a word or change in expression. Jingyi straightens his spine anyway when it’s his turn, trying to hold still - which is <em>very</em> difficult since he’s practically vibrating out of his skin, suddenly awake and eager to tell Hanguang Jun everything that had happened. He fought a fierce corpse! He and Sizhui overpowered it! It was amazing! </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Wait here,” Hanguang Jun says to the juniors, and he and Lan Zhiyi step off of the path and out of earshot. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">The rest of them mill around the stone steps, not quite daring to sit down and rest. Only Sizhui stands dead still, his hand on his sword and his chin lifted high like he’s pretending to be Hanguang Jun. After a few minutes of this, Jingyi joins him and starts pretending too. They watch Lan Zhiyi make many, many tiny bows as he - Jingyi assumes - explains exactly what happened on the night hunt. Once or twice he gestures at where Jingyi and Sizhui are standing together. Jingyi lifts his chin a little higher and imagines communicating his displeasure with a single wordless <em>look,</em> and having the whole world listen to him. He imagines being tall, and never being questioned. Never being yelled at or made to do anything he wouldn’t want to. He imagines being good and righteous and loved all the time.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Jingyi tries looking down his nose, but he only really sees his nose. He nudges Sizhui with his shoulder. “Do you think you’ll be that tall, when you’re older?” he asks. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“What?” Sizhui asks, and gives him a look like Jingyi is crazy. “Why would I be?”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">It’s true that Sizhui is the shortest boy in their class, but there’s no reason to be mad about it. Jingyi sniffs, and practices a cold, haughty expression, like the one Hanguang Jun makes whenever someone wearing Yunmeng Jiang purple robes crosses his path. He nudges Sizhui again. “Stop staring,” he says. “They’ll let us go home when they’re ready.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“He’s mad,” Sizhui mutters.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Is he?” Jingyi squints. “Are you sure?”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Oh yeah,” Sizhui says, and swallows thickly. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Jingyi squints harder. Hanguang Jun looks the same to him, but he trusts that Sizhui would know. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Sizhui’s shoulders hitch like he’s about to start crying again, and then he leans in close to Jingyi’s ear to whisper, very rapidly, “I used resentful energy to stop the corpse.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Jingyi gives up pretending to be Hanguan Jun so he can stare at his friend. “I know,” he says. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“I - I don’t know how I did it though,” Sizhui says. “No one’s ever taught me, I just, I picked up the flute and I knew what to do.” He looks at Jingyi with big and despairing eyes.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Jingyi frowns at him. “Do you think Hanguang Jun’s mad at <em>you?”</em> he asks. Sizhui doesn’t say anything, just keeps staring at Jingyi with those big eyes. “Ugh, stop,” Jingyi tells him. “Why would he be mad at you? So what if you used resentful energy? Liuxian stabbed me in the face and my cousin let us fight a corpse by ourselves. <em>You’re</em> fine. You did good!”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Jingyi,” Sizhui says, exasperated. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Jingyi sighs very deeply, and very loudly, so that Sizhui will know he means it, and wipe that look off his face. “What does Hanguang Jun always tell us?” he demands. “What’s the most important thing?”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Sizhui’s mouth twists. He’s silent for a long time, thinking it over. His eyes flicker back and forth between Jingyi and Hanguang Jun, uncertainly. He already knows the answer, because he’s the best student in their class, and Jingyi thinks that one day he’ll be just as strong and good as Hanguang Jun. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Come home safe,” Sizhui admits. “Do what it takes to make sure <em>everyone</em> comes home. That’s the most important thing.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Jingyi nudges Sizhui with his shoulder for a third time. “See? You said we’d be fine and we were,” he says, feeling very satisfied. “And I’ll have a really great scar to show for it! I don’t really think we’re going to get in trouble, but even if we were, that’s worth getting in a little trouble for. Right?”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Sizhui nudges him back, hard enough that he almost sends Jingyi spinning off his feet. He has to shoot a hand out to catch Jingyi, who’s laughing too hard to catch himself. He pats Sizhui’s shoulder. “Okay, okay,” he says. “Oh, look, they’re coming back. You better stop fooling around, Lan Sizhui, before Hanguang Jun catches you.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Sizhui almost pushes him off the path again, but they manage to school their expressions before the adults return. Hanguang Jun sweeps another thrillingly majestic look across the lot of them. How does he <em>do it?</em> Doesn’t his own nose get in the way, like Jingyi’s? Jingyi is going to have to practice more. “You are excused from morning classes,” Hanguang Jun tells them. Is he still mad? Is he mad at them? Jingyi really can’t tell at all. Adults are mad at Jingyi all the time, so he’s pretty used to it, but he’s not sure how he’d feel if Hanguang Jun were mad at him. Pretty terrible, probably. No wonder Sizhui still looks so nervous.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Come on,” Lan Zhiyi says, and makes a gesture with both hands like he can sweep children up the mountain, like dust. He looks at Sizhui and Jingyi and says, “Not you two. Hanguang Jun will escort you both to see the doctor before you return to the dormitories.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Sizhui bows, and murmurs, “Thank you for your guidance, Fifth Senior,” and shoots a look at Jingyi too, like he’s expecting him to forget his manners. As if he would, when Hanguang Jun is standing right there! Jingyi scoffs to himself, and makes an even prettier bow, and says his thanks even more politely.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Then it’s just the three of them, standing together in the morning fog. Jingyi has been awake and sleepy for so long that he’s starting to feel like maybe he’s both awake and asleep at the same time, but he tries to keep his back straight and his eyes open. Sizhui still looks a little scared - they didn’t tell Lan Zhiyi exactly what he’d done to save Jingyi, but he had to know, right? Did he tell Hanguang Jun about it? <em>Are</em> they going to be in trouble? How <em>much</em> trouble?</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Hanguang Jun looks from Sizhui to Jingyi, and says, “Good work.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Lan Jingyi’s soul just about flees from his body. It pushes him up on his toes in excitement and shoves his heart up against his rib cage. Good work! <em>Good work! </em></span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">He looks at Lan Sizhui to share the joy, but Sizhui isn’t looking back - he’s beaming up at Hanguang Jun, like he’s never been scared of anything at all.</span>\n</p>\n<p class=\"p1\"> </p>\n<p class=\"p1\"> </p>\n<p class=\"p2\" align=\"center\">\n<span class=\"s1\">-</span>\n</p>\n<p class=\"p1\"> </p>\n<p class=\"p1\"> </p>\n<p class=\"p2\">\n<span class=\"s1\"> When Lan Sizhui is sixteen or so, he meets a man in a small village who wears faded, smeared makeup and a smile that never leaves his face. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Lan Sizhui likes him immediately. He likes the rapid way the man speaks, the lofty arrogance of his tone, so far above his station and the circumstances they find him in. He pities the way the man cringes away from something as simple as a hand to help him to his feet, and how he greets Sizhui’s courtesy with an odd, quiet puzzlement. He admires the quickness of the man’s mind: the neatness of his explanation of the stone goddess on Dafan Mountain, and the way he’d twisted out of Sandu Shengshou’s claws. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Then they bring the man back to the Cloud Recesses. Back to the Jingshi. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Sizhui wakes early, the morning after Mo Xuanyu comes to Gusu. The dormitory is silent, filled only with the breathing of the other junior disciples, as soft as clouds except for Jingyi, who whistles through his nose as he sleeps. He stares at the ceiling for a long time, watching the wood warm with the approaching sun. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">He shouldn’t concern himself with the private affairs of others. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">But even Uncle had said how unusual it was. That Father had never brought guests back to Cloud Recesses before. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">And Sizhui had liked Mo Xuanyu - immediately, immensely - and he knew they had to protect the poor man from Sandu Shengshou’s paranoia, but - </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">But Mo Xuanyu had spent the night in the Jingshi, where no one except Sizhui was normally allowed to go.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">It’s not like Sizhui is stupid. He knows what cutsleeves do. He knows that Father has never had a wife but that he’d lost <em>someone,</em> and Sizhui has wondered, just a little bit, if there’s a reason why no one seems to speak this person’s name. If it wasn’t Sizhui’s mother, maybe it had been his father. Or maybe -</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">He’s almost asked, so many times: who this person was, how long they’d known each other, how this person had died. How it was possible to still wear white for them, even after so many years. He wants to know about a love like that.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">He doesn’t know how to reconcile that with Mo Xuanyu, mercurial and clever, dragged into Cloud Recesses in the throes of the fakest hysterics Sizhui has ever seen. Father had watched the juniors wrestle Mo Xuanyu all the way up the mountain, and he’d ignored Sizhui completely while they did it. Uncle had only sighed, and looked heavenward, and then patted Sizhui’s shoulder and told him not to worry. Maybe he hadn’t realized exactly where they’d been taking Mo Xuanyu. Maybe Sizhui was just breaking rules, putting his nose in other people’s business.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Sizhui sighs and slips out of bed. He combs his hair and fixes his forehead ribbon. He breathes deeply in through his nose, and closes his eyes as he exhales. It helps a little, but the feeling of strangeness doesn’t leave even as he closes the doors behind himself, or as he traces the well-worn, winding path from the dormitory to his childhood home. Instead, it clings to his white-robed shoulders like mist, or rabbits’ fur. He knows that if he can only talk to Father privately he’ll feel better, and as the path gets steeper his steps quicken. The sun is burning through the fog, and when he finally sees the Jingshi’s thick brush fence and white stone garden, his heart squeezes gladly. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">And then falters.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">For a long moment Lan Sizhui is frozen, one foot through the Jingshi’s gate and the other lifted to complete the step, only his toes still resting on the ground. His breath feels caught in his chest, even though he can see the steam of his own exhales in the morning air. If you asked him to explain his hesitation, he might not have the words - but he probably wouldn't even really need them. The sight that greets him as he walked through the gate would make anyone in Cloud Recesses stop dead and stare.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">The door to the Jingshi is open to the sunlight, and Father is standing out on the long deck. He’s dressed in the sort of light robe that he might wear only at home, or walking to and from the cold springs. His hair is pulled up in a loose half knot, free of ornamentation. His eyes are closed, and his face is tilted up to greet the sunshine, and he’s smiling.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Lan Sizhui takes a step closer, and another. He sets his feet lightly, carefully on the stone. He watches Father closely, as if his smile were a particularly timid rabbit that might startle and vanish at any moment. But it doesn’t - it stays, so warm and soft around his mouth and eyes, as Sizhui climbs the low steps of the Jingshi and comes to stand at his father’s side. Sizhui knows he’s staring. He feels his mouth hanging open in astonishment. His hands make damp fists inside his sleeves, self-consciously. He reaches instinctively for the soft pouch he always keeps in there, and the old, crumpled grass toy inside of it that he’s had for longer than he can remember, which always makes him feel better. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Father opens his eyes. They’re cut through with sunlight, which turns his eyes into polished glass, with little bits of gold and green and brown throughout. He looks down at Lan Sizhui, who can’t help but smile back at him, wide and helpless and weirdly overwhelmed. After a moment it’s too much, and Sizhui looks away, into the Jingshi where it’s dark and quiet. “Is Senior Mo still sleeping?” he asks.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Father nods, and then reaches behind himself and slides the door closed. “He’ll sleep for a few more hours,” he says - and there, at the corner of his mouth, the smile gets fonder, turns up at one corner. Sizhui watches it, fascinated. Father says, “Arrange for breakfast to be brought at nine.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Nine?” Sizhui repeats, unsure if he heard right. “Are you sure? That’s so late ...”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Father nods. He moves away from the door, and Sizhui follows automatically. “There should be some chili oil leftover from the Qinghe Nie delegation two weeks ago,” Father tells him. “Ask the cook to include some with the meal.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Okay,” Sizhui says faintly. “But Father -”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">A strange look passes over Father’s face, and he turns and faces Sizhui fully. Sizhui straightens automatically, unsure of what he’s looking for. Father’s scrutiny sometimes makes him feel like his forehead ribbon is crooked, even though he knows it isn’t. He feels impatient, too - full of questions he doesn’t know how to ask. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“A-Yuan,” Father says abruptly. </span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">He doesn’t usually call Sizhui by his birth name, even when it’s just the two of them, so to hear it is kind of alarming, on top of everything else that’s happened since yesterday. “Yes?” Sizhui asks. He looks over his shoulder, at the white eyes of the Jingshi’s paper windows.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“A-Yuan,” Father says again, urgently. Startled, Sizhui looks back at him.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">They watch each other for a long moment. The tension and curiosity in Sizhui’s heart stretches like spun sugar, almost to a breaking point. Words crowd up his throat and into his mouth, jockeying for position. He thinks, maybe, that Father is feeling the same: after a lifetime of exposure, he can pick out <em>anxiety</em> on Father’s brow and <em>worry</em> in his eyes. He’s scared about something - scared for <em>Sizhui.</em> But there, tucked like a secret in the corner of his mouth - that’s something else. Something Sizhui has never seen before.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Are you,” Sizhui asks, tentatively, and his head says, <em>Okay?</em> And his heart asks, <em>Happy? </em></span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">In the end he can’t say either one. He looks at his father, helplessly silent, and his father looks back at him, and, slowly, the worry fades again, for both of them.</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">Sizhhui laughs. It bubbles up unexpectedly from his chest, surprising him. Father only nods, like Sizhui had asked his questions after all. “It’s early,” he says, and turns away, starting down the Jingshi’s steps. “We will feed the rabbits.”</span>\n</p>\n<p class=\"p2\">\n<span class=\"s1\">“Yes, Father,” Sizhui says, still smiling, and they fall in step together.</span>\n</p>\n<p class=\"p1\"> </p>\n<p class=\"p1\"> </p>\n<p class=\"p1\"> </p>"
}