{
  "id": "23113045",
  "url": "https://archiveofourown.org/works/23113045?view_full_work=true",
  "author": [
    "feyburner"
  ],
  "title": "I hope that you will come and meet me",
  "rating": "Mature",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "陈情令 | The Untamed (TV)"
  ],
  "relationships": [
    "Lan Zhan | Lan Wangji/Wei Ying | Wei Wuxian"
  ],
  "characters": [
    "Lan Zhan | Lan Wangji",
    "Wei Ying | Wei Wuxian"
  ],
  "additional_tags": [
    "Post-Canon",
    "Getting Together",
    "Love Letters",
    "Emotional Hurt/Comfort",
    "Cuddling & Snuggling",
    "Literal Sleeping Together",
    "Intimacy",
    "CQL Compliant",
    "No Plot Just Feelings",
    "First Time",
    "Two soulmates figuring their shit out",
    "Let Hanguang-jun talk about his feelings agenda",
    "Podfic Available"
  ],
  "language": "English",
  "series": "",
  "published": "2020-03-12",
  "completed": null,
  "words": "28,384",
  "chapters": "1/1",
  "comments": "917",
  "kudos": "11,830",
  "bookmarks": "4,884",
  "hits": "148,686",
  "summary": "<p>The second time Lan Zhan said <i>Wei Ying, come back</i>, Wei Wuxian did.</p>",
  "notes": "<p>- Title from <a href=\"http://wengu.tartarie.com/wg/wengu.php?l=Tangshi&amp;no=18\" rel=\"nofollow\">\"On Climbing Orchid Mountain in the Autumn to Zhang\"</a> by Tang dynasty poet Meng Haoran.<br>- I realize show canon has Wei Wuxian dead for 16 years, but also show canon says \"16 years ago\" at the very start of the flashback timeline, and then like 3 years pass, and then Wei Wuxian dies and the present timeline starts \"16 years\" after that? So I think 16 was a mistake and it's actually 13 and that's what I used.<br>- No specific warnings that I can think of. Please let me know if there's something I should add.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>- Wei Wuxian's line about \"separated hearts\" is a reference to another Tang poem: <a href=\"http://wengu.tartarie.com/wg/wengu.php?l=Tangshi&amp;no=91%22\" rel=\"nofollow\">\"Looking at the Moon and Thinking of One Far Away\"</a> by Zhang Jiuling. It felt appropriate.<br>- Lan Wangji's list of approved people inspired by <a href=\"https://twitter.com/hyacinthsuns/status/1236007713760399360\" rel=\"nofollow\">this tweet</a>.<br>- I would love to hear your thoughts ❤️</p>",
  "text": "<p>The second time Lan Zhan said <em> Wei Ying, come back, </em>Wei Wuxian did.</p>\n<p> </p>\n<p>It didn’t escape him that this time, too, he was standing at the edge of a cliff, open air behind him and Chenqing in his hand. But otherwise things couldn’t have been more different. Back then, the world had been black and boiling and smelling of smoke, sulfur, hot blood and the oily fecal stench of split intestines, corpse-rot rising up from far below. Death in every breath. Now it was all green. The world smelled of wildflowers, mountain grass, a coming rain. It smelled like soil, wet and dark enough to grow something.</p>\n<p>\n<em>   </em>\n</p>\n<p>\n<em> Wei Ying. </em>\n</p>\n<p> </p>\n<p>Wei Wuxian turned around. And there he was.</p>\n<p> </p>\n<p>They stared at each other for so long Wei Wuxian almost laughed, if only to break the silence. Ten months. It had been ten months.</p>\n<p> </p>\n<p>Lan Zhan looked the same, except Wei Wuxian hadn’t seen him in ten months, and it was like stumbling through a dark forest only to find a shining river; he couldn’t not drink deeply. The reality of Lan Zhan, here and solid and bright. Here, with all the details that didn’t show up in dreams.</p>\n<p> </p>\n<p>“Lan Zhan,” he said. “You found me.”</p>\n<p> </p>\n<p>“Wei Ying,” said Lan Zhan, and Wei Wuxian closed his eyes. Nobody said his name like that. Nobody had ever said his name like that, not even shijie. In Lan Zhan’s voice, his name was a piece of glass washed up on the lakeshore, soft around the edges from all those years of water. It was like that.</p>\n<p> </p>\n<p>Ten months. Ten months. Wei Wuxian knew he’d miss him, but god damn.</p>\n<p> </p>\n<p>“Come back,” said Lan Zhan.</p>\n<p> </p>\n<p>And Wei Wuxian opened his eyes and said, “Yes.”</p>\n<p> </p>\n<p align=\"center\">✵</p>\n<p> </p>\n<p>It took the rest of the afternoon to coax Little Apple down one mountain and up another, into the cool mists of the Cloud Recesses. Wei Wuxian spent that time regaling Lan Zhan with everything he’d done over the past ten months: the towns and villages he passed through, the countless night hunts, the hauntings, the monsters, the nasty little foxglove-imps in Tianbeiwan, the woman in Shangfeng who begged him to stay for dinner because he played the dizi like her dead son. The dead son, a flicker of silvery blue light in the corner of the room. <em> He was easy, </em> Wei Wuxian told Lan Zhan. <em> Just wanted to play one last song for his ma. Still, I kept wishing you were—I kept wishing I knew Inquiry. </em> He told Lan Zhan about riding west, his back to the rising sun. The village terrorized by an imitation Xiangliu that turned out not to be a nine-headed snake monster at all, just a regular old grass snake with an illusion sigil burned into its white belly, a young cultivator’s prank gone wrong. Meihua Village, a cluster of houses on an island in the middle of a wide river, so named because the island had more plum trees than people. <em> Lan Zhan, I thought I was seeing things at first. The whole island was bright pink.  </em> </p>\n<p> </p>\n<p>“Lan Zhan, you really shouldn’t let me talk so much,” he said as they crossed a shallow creek. Lan Zhan was stepping delicately from stone to stone; Wei Wuxian had chosen to wade barefoot alongside his horrible idiot donkey. The last rays of the setting sun cut through the mist, turning everything around them a fine, hazy gold. “It’s been months since I talked to someone who actually listens. I’ll talk all night if you’re not careful. I’ll never shut up again!”</p>\n<p> </p>\n<p>Lan Zhan reached the other side and turned around, his gaze warm and steady.</p>\n<p> </p>\n<p><em> Nobody looks at me like you do</em>, Wei Wuxian didn’t say.</p>\n<p> </p>\n<p>Instead he said, “Lan Zhan—,” and then Little Apple slipped on a rock and nearly took him down with her. By the time he’d managed to regain his footing on the slippery creek bottom, clinging to Little Apple’s bridle for dear life, he was already laughing. His voice rang through the trees, loud enough to startle a few birds into taking off overhead, a flutter of wingbeats and rustling leaves. Wei Wuxian’s robes were soaked to the thigh with icy mountain runoff. He shivered, still laughing, and looked up to find Lan Zhan watching him.</p>\n<p> </p>\n<p>Lan Zhan’s face was doing the soft thing.</p>\n<p> </p>\n<p>This was a semi-recent development. Wei Wuxian remembered seeing the soft thing maybe three or four times in his past life, the most recent time being that perfect sunlit afternoon in Yiling before they’d sprinted back to the Burial Mounds. Before Lan Zhan had left for Gusu; before Wei Wuxian’s mind had gone belly-up and blank-eyed; before all good things hit the ground and shattered.</p>\n<p> </p>\n<p>Well, no. Not everything that had hit the ground was good, and not everything good was lost. The proof stood before Wei Wuxian right now on the bank of a shallow creek. The proof glowed even in the fading sun. Hanguang-jun, light-bearer. There was no one more worthy.</p>\n<p> </p>\n<p>Anyway, the soft thing.</p>\n<p> </p>\n<p>Over those first few months after Wei Wuxian had come back from the dead, he’d seen it more and more: Lan Zhan’s eyes going all dark and gentle, his mouth curving into the faintest smile. It was devastating every single time. Wei Wuxian had no idea what to do with a smile like that, never mind one directed at him. It felt like the only appropriate reaction would be to curl up in a ball or shriek at the top of his lungs or climb a tree just to leap out of it. The only reason he hadn’t died again within a week of being resurrected was because he no longer had a golden core, and therefore could not physically go into qi deviation.</p>\n<p> </p>\n<p>Lan Zhan wasn’t smiling as Wei Wuxian dragged Little Apple out of the creek and back up onto the mountain path, but there was a warmth to his face. If Jiang Cheng was the flash of a saltpeter bomb and shijie a lantern lighting the way home, Lan Zhan was—</p>\n<p> </p>\n<p>Lan Zhan was—</p>\n<p> </p>\n<p>“Lan Zhan, did you miss me?” Wei Wuxian asked. “I don’t even want to imagine how boring it is in the Cloud Recesses when I’m not around to stir up trouble. No, I’m kidding, I bet you liked the peace and quiet. Do you have to take a lot of meetings? How much paperwork does the Chief Cultivator do in a day? Aiyah, poor Lan Zhan, what a nightmare. You’re lucky I’m back. I’ll let you work for... seven hours a day. Not a minute more.”</p>\n<p> </p>\n<p>“I did,” said Lan Zhan.</p>\n<p> </p>\n<p>Wei Wuxian ran back through everything he said. “You liked the peace and quiet? Well, of course. Why do you think I waited ten months to come back?” He swatted at Little Apple’s flank, urging her along. They’d reached the main path that led up to the white gates of the Cloud Recesses, and Wei Wuxian was impatient to get there all of a sudden, terrible food and four thousand rules be damned. “To tell you the truth,” he said, “I was planning to keep traveling through winter, at least through the solstice, but....” He remembered just in time that he absolutely should <em> not </em> mention the poisonfeather birds, Lan Zhan would just worry for nothing. “Ah, it doesn’t matter. Let’s just say ten months was enough.”</p>\n<p> </p>\n<p>“I received your letters,” said Lan Zhan.</p>\n<p> </p>\n<p>“You—?” Wei Wuxian panicked for a second before remembering he had, in fact, sent some of the letters he wrote. “Right, right. Sorry about my handwriting, I tried to write neatly but it took so <em> long </em> and I figured, it’s fine, Lan Zhan will know what I’m saying. My calligraphy never held a candle to yours, anyway. Did you get the one about the hungry ghost on Yugu Mountain?”</p>\n<p> </p>\n<p>“Yes.” Lan Zhan, walking a few steps ahead, glanced back at him. “You were reckless.”</p>\n<p> </p>\n<p>“I was not!”</p>\n<p> </p>\n<p>“You’re always reckless.”</p>\n<p> </p>\n<p>“I do what needs to be done,” Wei Wuxian argued. And that was true of the hungry ghost on Yugu Mountain. Bound to a local shrine, the ghost had been attacking everyone who came to offer fruit and incense. It should have been an easy exorcism... except the ghost was that of a recently married man, and when his young widow learned a cultivator was on the way, she’d barred the doors to the shrine and locked herself in with him. Her late husband had died in a fire, so the place was already burning with greenish, ghoulish phantom flames by the time Wei Wuxian had arrived. He’d managed to rescue the widow and liberate the ghost, but phantom flames burned the soul instead of the body, so it had taken three days of bedrest before he could cast even a paperman.</p>\n<p> </p>\n<p>“What part was reckless?” he demanded, trying to remember what he said in the letter. There was no way he’d told Lan Zhan the whole truth. “You mean just because of the fire?”</p>\n<p> </p>\n<p>Lan Zhan stopped walking. “What fire?”</p>\n<p> </p>\n<p>Oh. “Nothing!” Wei Wuxian said quickly. “Nothing at all. Even if there had been something, it was almost three months ago, and clearly I’m fine.” When Lan Zhan still didn’t move, “Lan <em> Zhan. </em>You worry too much. I came back in one piece, didn’t I? Look at me. I might not have a sword, but I’m far from helpless.”</p>\n<p> </p>\n<p>“I know,” said Lan Zhan.</p>\n<p> </p>\n<p>“Good,” said Wei Wuxian, grinning at him, and launched into another story.</p>\n<p> </p>\n<p align=\"center\">✵</p>\n<p> </p>\n<p>Upon reaching the Cloud Recesses, Lan Zhan handed Little Apple off to an unfortunate servant and led Wei Wuxian straight past all the guesthouses to the Jingshi. <em> Well, alright then</em>, Wei Wuxian thought. He hadn’t necessarily been expecting Lan Zhan to put him up in a guest room—he’d stayed in the Jingshi before, after all. But that was when they were hiding from Jin Guangyao, when it was Yiling Laozu and Hanguang-jun vs. the entire cultivation world. It had made sense for both of them to hunker down in the Jingshi. Now they weren’t hiding from anyone, and Wei Wuxian planned on staying in the Cloud Recesses a good long while. Allowing of course for frequent travel breaks, so he didn’t lose his everloving mind.</p>\n<p> </p>\n<p>Would he be staying in the Jingshi just for tonight, because it was already so late? Would Lan Zhan have a room prepared in the guesthouse come morning? Would he notice if Wei Wuxian pretended to sleep there but actually just snuck into the Jingshi every night to listen to Lan Zhan breathe?</p>\n<p> </p>\n<p>All valid questions.</p>\n<p> </p>\n<p>Lan Zhan must have noticed Wei Wuxian’s hesitation at the threshold, because he asked, “Do you wish to stay elsewhere?”</p>\n<p> </p>\n<p>“No!” Wei Wuxian said loudly. “No, this is good. This is great.” He kicked off his shoes and darted past Lan Zhan into the Jingshi, then sheepishly retrieved the shoes and lined them up neatly next to Lan Zhan’s upon receiving a <em> look</em>. The inside of the Jingshi hadn’t changed at all since the last time he’d been here. Moonlight filtered in through the silk-screen walls, there was a guest bed by the window overlooking the bamboo grove out back; Lan Zhan’s guqin sat on its low table, and everything smelled of sandalwood incense, woodsmoke and musk. There was even a jar of Emperor’s Smile on the table in the main room alongside a teapot, two ceramic cups, and a tray with a covered pot leaking steam.</p>\n<p> </p>\n<p>“Have you eaten?” Lan Zhan asked, following Wei Wuxian’s gaze. “There’s soup.”</p>\n<p> </p>\n<p>“What color is it,” Wei Wuxian said suspiciously.</p>\n<p> </p>\n<p>“Red,” said Lan Zhan.</p>\n<p> </p>\n<p><em> Marry me, </em>Wei Wuxian almost said with his actual fucking mouth. Gods, he’d been alone for too long; he’d been talking to himself pretty much constantly and had thus become accustomed to saying whatever he wanted, confident that no one was listening. But now someone very much was listening, and he needed to adjust his behavior accordingly. Instead of proposing to Hanguang-jun, he said, “Thank the heavens.” Then he went and plopped down in front of the table.</p>\n<p> </p>\n<p>Before he could fill his own bowl, Lan Zhan sat down across from him. Gracefully, holding his white sleeve with one hand so it didn’t trail across the table, he took the lid off the pot and set it aside. He picked up the white porcelain serving spoon and ladled soup into a bowl. He replaced the lid of the pot, then unstoppered the jar of Emperor’s Smile and poured a full cup, and somehow even his pour was beautiful. Each movement was measured and deliberate, like this was a formal ceremony instead of just Wei Wuxian’s dinner. Only after he’d served Wei Wuxian did he reach for the teapot.</p>\n<p> </p>\n<p>“Ah!” said Wei Wuxian, shooing Lan Zhan’s hand away. He poured Lan Zhan a cup of tea. Knowing the Lans, this tea was white, floral, and so astringent it dried out your mouth like biting into an unripe persimmon. But Lan Zhan liked it, and Wei Wuxian hadn’t been around to watch him drink disgusting tea for ten whole months, so he didn’t even make fun of it. He just set the cup in front of Lan Zhan and smiled at him, feeling so warm.</p>\n<p> </p>\n<p>“Do you know, Lan Zhan, I think I missed this the most,” he said, starting in on the soup. It was actually pretty good, even lacking any sort of meat. “I thought it would be traveling together or playing music by the cold springs. And I did miss all of that. But I <em> really </em> missed sitting at a table with you, just eating.”</p>\n<p> </p>\n<p>“You never just eat,” said Lan Zhan.</p>\n<p> </p>\n<p>“I was not born into this sect and therefore ‘Silence during meals’ does not apply to me,” Wei Wuxian informed him. “The other four thousand rules I’ll consider following on a case-by-case basis, but that one is simply not going to happen and it’s high time you accepted it.”</p>\n<p> </p>\n<p>“Hm,” said Lan Zhan into his teacup.</p>\n<p> </p>\n<p>“Too much peace and quiet is bad for you, you know. It’s bad for your qi.”</p>\n<p> </p>\n<p>“Is it?”</p>\n<p> </p>\n<p>“Also, you’re a terrible actor and I know you secretly like it when I chatter at you. Sometimes.”</p>\n<p> </p>\n<p>“Hm.”</p>\n<p> </p>\n<p>“You <em> missed </em>me,” Wei Wuxian said, mostly joking, so he was taken aback when Lan Zhan looked at him and said, “Yes.” Flustered, he tossed back an entire cup of liquor, but then Lan Zhan immediately poured him another cup, and that flustered him even more. He wasn’t used to someone paying attention to him like this, anticipating what he wanted and giving it to him for no reason other than that he wanted it. He drank the second cup slowly, savoring the taste, cold and clean like fresh snowmelt.</p>\n<p> </p>\n<p>After Wei Wuxian finished his soup, Lan Zhan got to his feet and said, “Come.”</p>\n<p> </p>\n<p>Wei Wuxian got up and followed him, curious. There was a silk-screen door in the northeast corner of the main room, leading out to the small courtyard behind the Jingshi. Lan Zhan paused before it, and for the first time Wei Wuxian examined the scene painted intricately across the silk panels: an ink-wash sea, a gold-leaf sky, and in the center a scarlet phoenix and a brilliant white crane meeting at the surface of the water, their bodies forming a yin-yang.</p>\n<p> </p>\n<p>“My mother’s work,” Lan Zhan murmured.</p>\n<p> </p>\n<p>“So that’s why your calligraphy is so beautiful,” said Wei Wuxian, nudging him gently. “It’s in your blood.”</p>\n<p> </p>\n<p>“Wei Ying is good at painting.”</p>\n<p> </p>\n<p>“Ah?” said Wei Wuxian. “You flatterer, Lan Zhan. Do you want me to paint another portrait of you, is that it? All you have to do is ask. You’re the perfect subject, you sit so still.”</p>\n<p> </p>\n<p>“Paint whatever you like,” said Lan Zhan.</p>\n<p> </p>\n<p>“I’ll paint you, then.”</p>\n<p> </p>\n<p>Lan Zhan blinked at him. Then slid the door open.</p>\n<p> </p>\n<p>The night air was cool and wet, alive with the chirrup of peeping frogs and the hollow rustle of the bamboo grove. White pebbles and shells crunched beneath Wei Wuxian’s feet when he stepped out into the courtyard. “Lan Zhan, it’s cold out,” he complained. “Why are we—?”</p>\n<p> </p>\n<p>\n<em> Oh. </em>\n</p>\n<p> </p>\n<p>Wei Wuxian’s breath caught in his throat.</p>\n<p> </p>\n<p>\n<em> Oh, Lan Zhan. </em>\n</p>\n<p> </p>\n<p>There was a lotus pond in the center of the courtyard.</p>\n<p> </p>\n<p>It was small, about the same size as the one he and the Wens had dug into the hard dirt of the Burial Mounds a lifetime ago. The water was dotted with wide, flat leaves, unbloomed lotus pods swaying above them like bells. Wei Wuxian approached the pond almost cautiously, some part of him afraid it wasn’t real, he was dreaming, he’d already gone to sleep and he was dreaming. But his dreams were never this good. He knelt at the edge of the water and trailed his fingers across the surface, moonlight shivering in his wake. In summer the lotuses would bloom, delicate pink petals unfurling to reveal a yellow heart, each flower a little sunrise.   </p>\n<p> </p>\n<p>Wei Wuxian remembered—</p>\n<p> </p>\n<p>Wei Wuxian remembered leaning too far over the side of a rowboat, hand outstretched toward a particularly vibrant flower, <em> shijie, you can wear it in your hair! </em> Losing his balance, toppling headfirst into the water. Breaking the surface with a gasp, Jiang Cheng cackling at him from the boat, Jiang Yanli hiding a smile. <em> Silly Xianxian, at least the water’s warm! </em></p>\n<p>\n<em>   </em>\n</p>\n<p>His eyes were stinging.</p>\n<p> </p>\n<p>A lotus pond in the Cloud Recesses.</p>\n<p> </p>\n<p>He glanced back over his shoulder. Lan Zhan was silhouetted in the doorway to the Jingshi, tall and silent and moon-white, just watching. Wei Wuxian wiped his wet hands on his robes and stood up, trying to get it together. But Lan Zhan knew him, and whatever was on his face made Lan Zhan take a step forward.</p>\n<p> </p>\n<p>“Wei Ying?” he said, hesitant.</p>\n<p> </p>\n<p>There was something hot and bright in Wei Wuxian’s chest. A few inches lower and he’d have thought it was a golden core. “Lan Zhan,” he said, and the burning thing took over. He closed the few steps between them and threw his arms around Lan Zhan’s middle, burying his face in the warm curve of Lan Zhan’s throat. As expected, Lan Zhan went perfectly still, arms remaining stiff and awkward at his sides. He wasn’t breathing, and Wei Wuxian realized abruptly that they’d never embraced before. How absurd—they’d known each other since they were sixteen, they’d fought and traveled and slept side by side; Lan Zhan had literally carried Wei Wuxian’s unconscious body halfway across the country on two separate occasions, and they’d never fucking hugged?</p>\n<p> </p>\n<p>“Lan Zhan,” Wei Wuxian whispered.</p>\n<p> </p>\n<p>Over the past ten months he’d had plenty of time to sift through his earliest memories of the Cloud Recesses. They were always too-bright and blurry, like his mind’s eye was squinting against a white winter sun, but he remembered teasing that young, incandescent Lan Zhan. He remembered that at the time, he’d thought wanting to get a rise out of Lan Zhan was born from the same urge as tossing a stone into a tranquil lake just to watch it ripple. It took Wei Wuxian about, oh, two decades to figure out that that wasn’t the only reason he’d wanted the Second Jade of Lan to look at him.</p>\n<p> </p>\n<p>He remembered lying awake in his narrow, uncomfortable Cloud Recesses bed, considering the possibility that Lan Wangji, beneath all the rules and restraint, was just a tiny bit fascinating. And a lot less cold than everyone seemed to think.</p>\n<p> </p>\n<p>He’d been wrong about a lot of things, but not that.</p>\n<p> </p>\n<p>The boy who had knelt in the snow till he fell asleep, waiting for his long-dead mother to open the door. The man who had spent thirteen years mourning someone who didn’t deserve his grief, thirteen years investigating every trace of darkness and chaos, playing <em> Evocation </em>to silence. Lan Xichen had said it was stubbornness, but that wasn’t it.</p>\n<p> </p>\n<p>Wei Wuxian closed his eyes, fingers twisting in the back of Lan Zhan’s robes, and thought, <em> You just love with your whole damn heart</em>. <em> Your heart, your soul, with everything inside you. Not widely, but ocean-deep. You love so hard, don’t you, Lan Zhan? So hard it hurts. You don’t know how to do it any other way. </em></p>\n<p> </p>\n<p>A lotus pond in the Cloud Recesses. Tucked away behind the Jingshi.</p>\n<p> </p>\n<p>Wei Wuxian squeezed Lan Zhan one last time and was about to pull away when Lan Zhan shifted, hands coming up to rest on either side of Wei Wuxian’s spine. Lan Zhan was so solid. His heartbeat was quick and light like rain on a tiled roof. Wei Wuxian almost teased him about it—<em>are you nervous, Lan-er-gege?</em>—but kept his mouth shut. Lan Zhan didn’t touch other people, certainly not like this. Of course he was nervous.</p>\n<p> </p>\n<p>The pond wasn’t blooming, but Wei Wuxian could’ve sworn he could smell freshly bloomed lotus flowers, delicate florals layered over the musty earthiness of algae. The smell of home. Not home anymore. He let out a sharp breath against Lan Zhan’s throat, maybe laughing, maybe crying, and for some reason that was what made Lan Zhan shudder and melt the rest of the way, ice cracking on a frozen lake. He wrapped his arms fully around Wei Wuxian’s back and gathered him close, closer, holding him so tight it was hard to breathe. He pressed his face into Wei Wuxian’s hair and took a deep breath through his nose.</p>\n<p> </p>\n<p>The imagined scent of Lotus Pier gave way to the real, familiar scent of Lan Zhan, smoky sandalwood and almond, orchid hair oil. He was so warm. If he held Wei Wuxian long enough, would some of that warmth transfer over? Pour into Wei Wuxian like good wine?</p>\n<p> </p>\n<p>Suddenly it was too much.</p>\n<p> </p>\n<p>“Okay, alright,” said Wei Wuxian, stepping back. Lan Zhan’s arms fell away from him and he was cold again; he was always cold these days. “Lan Zhan ah Lan Zhan, I can’t believe you!” he said. “A lotus pond in the Cloud Recesses! Don’t tell me your uncle actually approved it?”</p>\n<p> </p>\n<p>Lan Zhan cleared his throat. “Uncle had no choice,” he said. “I told him afterward.”</p>\n<p> </p>\n<p>“Ha!” Wei Wuxian crowed. “Look at you, the glorious rebel of Gusu! Ah, Hanguang-jun, you better be careful. Your reputation’s only just started to recover.”</p>\n<p> </p>\n<p>“I don’t care about that,” said Lan Zhan, oddly intense.</p>\n<p> </p>\n<p>“I’ll care for both of us, then.”</p>\n<p> </p>\n<p>“You have never cared about reputations.”</p>\n<p> </p>\n<p>“Correction,” said Wei Wuxian, holding up a finger. “I don’t care about <em> my </em>reputation.”</p>\n<p> </p>\n<p>Lan Zhan took a breath as if to say something, paused, then finally just said, “Bed.”</p>\n<p> </p>\n<p>That word, in that voice, just felt unfair. “Uh-huh,” Wei Wuxian breathed. Following Lan Zhan back into the Jingshi, caught in his wake, he couldn’t help but feel like moonlight on the surface of a lotus pond: insubstantial and easily disturbed, a temporary glimmer on something calm and perfect and full of life.</p>\n<p> </p>\n<p align=\"center\">✵</p>\n<p> </p>\n<p>\n<em>Lan Zhan, </em>\n</p>\n<p>\n<em>   </em>\n</p>\n<p>\n<em> I always had a bad memory, but I think dying made it worse. </em>\n</p>\n<p>  </p>\n<p align=\"center\">✵</p>\n<p> </p>\n<p>Over the next few days, they fell into a routine.</p>\n<p> </p>\n<p>The Cloud Recesses were emptier than usual. Zewu-jun was in seclusion, Lan Qiren was paying a visit to Lanling Jin in preparation for an upcoming discussion conference; Sizhui, Wen Ning, and the other junior sect members were on a night hunt to the west, near the border of Gusu and Moling. Wei Wuxian missed Sizhui and Wen Ning and even that little brat Lan Jingyi, but it was nice, having the space to settle in. He’d spent ten months traveling, rarely staying anywhere longer than a night. It was strange, staying. Wanting to stay.</p>\n<p> </p>\n<p>“Lan Zhan,” he said on the fifth morning of waking up in the Jingshi. “Have you heard of Yinhe Temple?” </p>\n<p> </p>\n<p>Lan Zhan didn’t answer for a moment. He was in the middle of writing some letter or another. One of his duties as Chief Cultivator was to foster communication between the major and minor clans, which he took very seriously, because he was Lan Zhan and he took everything seriously, which was admirable of him, <em> except </em> when it meant Wei Wuxian couldn’t talk to him until he’d finished writing one million letters in response to various petty gripes and squabbles between minor clan leaders. Wei Wuxian had read some of Lan Zhan’s letters and they were pretty much just very formal, polite versions of ‘<em>Figure it out amongst yourselves and stop wasting my time, dumbass.’ </em></p>\n<p> </p>\n<p>So far, their days went like this: Lan Zhan woke up at five, meditated for an hour, and began his work. Wei Wuxian usually woke up around eight or nine, meditated for fifteen minutes, multi-tasked eating breakfast and bothering Lan Zhan, got bored, and wandered off in search of something to do. These days he liked wandering around the mountain in a way he wouldn’t have when he was younger. Before he lost himself, before his mind filled with black water and, too exhausted to keep his head up, he slipped under.</p>\n<p> </p>\n<p>Meditation was okay, but Wei Wuxian found a lot more peace in birdsong, a thick carpet of pine needles under his shoes, the white-noise rush of terraced waterfalls feeding into a mountain river. He liked running his fingers over rough tree bark, wading into the cold springs, numbing his hands in the icy water and warming them on a sun-baked rock. Physical sensations. Real things he could feel and experience, because he was real and alive in this world.</p>\n<p> </p>\n<p>Lan Zhan finished his letter, folded it, and sealed it with the Lan crest. Then he turned his attention to Wei Wuxian. “Yinhe Temple?”</p>\n<p> </p>\n<p>“It’s about as far west as you can go,” said Wei Wuxian, stretching like a cat. He’d been holding lotus pose for what felt like hours. Morning sunlight was streaming into the Jingshi, illuminating Lan Zhan’s papers, the white of his robes, the silver ornament in his hair. “In the foothills of the Great Desert. On swords the journey would take a week, but—well, you know. On foot it’s probably three. When I was passing through Meishan territory I met a girl who originally hailed from the foothills, and Lan Zhan, she said each summer there’s a Qixi festival at Yinhe Temple that lasts for seven days and seven nights! And it’s not just the typical festival stuff, the best part is that the temple monks spend all seven days and nights sculpting a massive bridge out of desert sand. Pan-guniang said it’s as long and wide as a river, and people travel from all over the country just to walk the length of it. I told her I’d definitely try to make it this year.”</p>\n<p> </p>\n<p>He waited for Lan Zhan to react, but Lan Zhan looked even stiffer than usual. Wei Wuxian would have to scold him about working too much. His poor bones.</p>\n<p> </p>\n<p>“Lan Zhan, doesn’t that sound amazing?” he prompted. “I want to go.”</p>\n<p> </p>\n<p>“Mm,” said Lan Zhan. Again he did nothing but stare silently at the green jade tabletop.</p>\n<p> </p>\n<p>“Lan <em> Zhan</em>,” Wei Wuxian whined. “Come on, at least think it over. Can’t Zewu-jun come out of seclusion and be Chief Cultivator for a few weeks? The war’s over, everything’s quiet. You can take one little trip.”</p>\n<p> </p>\n<p>At that, Lan Zhan looked up. “You... wish for me to accompany you?”</p>\n<p> </p>\n<p><em> What. </em>Wei Wuxian snorted. “Uh, yes? Obviously you’d be going. First of all, I already told you ten months was enough. Second of all, you’re crazy if you think Little Apple would leave this mountain without you.” When Lan Zhan didn’t respond, Wei Wuxian gave up on lotus pose and scrambled over to join him at the low table. This was another part of their routine: sitting together in the evenings, Wei Wuxian with a drink, Lan Zhan with a cup of tea, steam curling around his pretty face. “Lan Zhan, come west with me,” Wei Wuxian said, smiling as cutely as possible. “I’ve never seen a desert before, I wanna see it with you.”</p>\n<p> </p>\n<p>Lan Zhan’s lips parted. Eyes never leaving Wei Wuxian’s, he gave a small nod.</p>\n<p> </p>\n<p>“Good,” said Wei Wuxian, breaking into a grin. “Good! We can night hunt along the way, how’s that? I miss hunting with a partner, it wasn’t nearly as fun on my own.” Too late, he realized he was veering dangerously close to <em> cultivation partner </em> territory. “Ah, I mean... it’s just nice knowing someone’s got your back. I can handle myself, but, you know.”</p>\n<p> </p>\n<p>“Mm.” Lan Zhan took out a fresh ink stick and poured more water onto the grinding stone. “You mentioned a fire. On Yugu Mountain.”</p>\n<p> </p>\n<p>“Did I? That doesn’t sound like me.”</p>\n<p> </p>\n<p>“Wei Ying.”   </p>\n<p> </p>\n<p>“It was nothing,” Wei Wuxian said distractedly. He was watching Lan Zhan’s hand as he swirled the ink stick over the grinding stone, black ink bleeding into the water. “It was, ah.... It was fine. Just a minor complication with an exorcism, but it worked out alright in the end. Lan Zhan, you shouldn’t worry so much.”</p>\n<p> </p>\n<p>Lan Zhan set the ink stick down, cleaning the lampblack off his fingers with a white silk cloth. “You always do this,” he said.</p>\n<p> </p>\n<p>“Do what?”</p>\n<p> </p>\n<p>“Same as the evil spell you took from Jin Ling. Same as the curse marks from Mo Xuanyu. Same as your core. You get hurt and tell no one.”</p>\n<p> </p>\n<p>It was Wei Wuxian’s turn to fall silent.</p>\n<p> </p>\n<p>“When it was me,” said Lan Zhan, “you told me to stop pretending everything was fine.”</p>\n<p> </p>\n<p>“Yugu was months ago,” Wei Wuxian mumbled. He could feel Lan Zhan watching him. “Really, Lan Zhan. Of course I love it when Hanguang-jun protects me, but I’m not <em> that </em> feeble.”</p>\n<p> </p>\n<p>“Wei Ying.”</p>\n<p> </p>\n<p>“Aiyo, why is it you only talk this much when it’s time to scold me?”</p>\n<p> </p>\n<p>Somewhere beyond the walls of the Jingshi, a blue thrush started singing its high, flutelike song. Lan Zhan didn’t react to Wei Wuxian’s grumbling at all. He just sat there, a sculpture of white jade, waiting for some sort of answer or explanation. Wei Wuxian wasn’t even sure what the question was.</p>\n<p> </p>\n<p>“Okay, look,” he said finally. “It’s just... it’s different when it’s me, yeah?”</p>\n<p> </p>\n<p>“Why?”</p>\n<p> </p>\n<p>“Because....” Shit, he’d never really thought about this before, let alone tried to voice it. There were a thousand different reasons. A lifetime’s worth of reasons. A reason for every day he ran through the halls of Lotus Pier, for every grain of rice he ate beneath that roof, for every punishment from Madam Yu, for every time Jiang Fengmian praised him while Jiang Cheng sat miserably on the sidelines. A reason for every Wen he’d tried and failed to save. For Wen Qing, who had died so he would live. For Jin Zixuan.</p>\n<p> </p>\n<p>For shijie, who had loved him at the end of all things. Wei Wuxian’s name had been cleared of many crimes, but that death was his. That sword was meant for him. There would be no absolution; no forgiveness. That death, not his own, was when Wei Wuxian’s life cracked down the center and shattered.</p>\n<p> </p>\n<p>A reason for every scar on Lan Zhan’s back.</p>\n<p> </p>\n<p>He sighed. “Sometimes I think I was meant to die as a child, alongside my parents,” he said, gazing into the fresh ink on the grinding stone, so black it didn’t reflect the sunlight, just swallowed it. “Or later, torn apart on the streets by wild dogs. Don’t get me wrong, Lan Zhan, I’m not trying to sound ungrateful. It’s not like I sit around thinking, ‘Oh, woe is me, what a monster I became, if only I’d died before any of it happened.’ It’s useless to think like that. But, I don’t know. If there is such a thing as fate, I think it made a mistake with me. I think I was meant to die, but Jiang-shu—Jiang-zongzhu found me. And the Jiang Clan gave me everything, they gave me a life and a home and a golden core, and in return I broke every promise I ever made.” He let out a quiet laugh, shaking his head. “You know I don’t like to dwell on the past, but it’s true that I’ve always been a bit of a burden. I’ve already caused a great deal of trouble and inconvenience for Lan Zhan, haven’t I? So why should I complain about a spell or a couple curse marks, ah?”</p>\n<p> </p>\n<p>When he looked up, he was taken aback by the intensity in Lan Zhan’s eyes. “You are not a burden,” said Lan Zhan. “You are not inconvenient.”</p>\n<p> </p>\n<p>“Well, that’s nice,” said Wei Wuxian. “But in this second life I’ve watched the esteemed Hanguang-jun defy his family, his clan, the cultivation world, all orthodoxy, just to stand at my side....”</p>\n<p> </p>\n<p>“It was the right thing to do. The only right choice.”</p>\n<p> </p>\n<p>“You're very clever, I’m sure you could’ve exposed Jin Guangyao for the snake he was <em> without </em> publicly throwing in with the Yiling Laozu.”</p>\n<p> </p>\n<p>Lan Zhan shook his head. “I am not referring to the investigation of Jin Guangyao,” he said. “The choice I made was Wei Ying.”</p>\n<p> </p>\n<p>Oh.</p>\n<p> </p>\n<p>Wei Wuxian tried to look calm and collected and not at all like Lan Zhan had just delivered the exact words he’d been longing to hear since he was sixteen. “Hah,” he said weakly.</p>\n<p> </p>\n<p>Lan Zhan picked up his bamboo brush again, dipping it in the ink and starting a new letter. Even just responding to someone’s petty grievance, his handwriting was a study in flawless calligraphy, each stroke a tiny, precise movement of the wrist. It was particularly captivating for Wei Wuxian, who could paint and design talismans but whose handwriting had once been described by Lan Qiren as ‘an utter disgrace.’ Lan Zhan wasn’t a painter, but he was an artist all the same.</p>\n<p> </p>\n<p>“Well, <em> anyway</em>,” Wei Wuxian said, moving right the fuck along. “Now that I’m back, I’d like to night hunt with you. Think about it, Lan Zhan! We could travel from village to village, and with your Gusu Lan coffers we wouldn’t even have to sleep on the road. And if we did run out of silver, you could just sit in the market and play your guqin. I made pretty decent money doing that, and that was just me and Chenqing. Imagine what we could make with a face like Hanguang-jun’s.”</p>\n<p> </p>\n<p>A pause.</p>\n<p> </p>\n<p>“West, then,” said Lan Zhan.</p>\n<p> </p>\n<p>“What, like, you’ll go? For Qixi? Really?”</p>\n<p> </p>\n<p>“Yes,” said Lan Zhan.</p>\n<p> </p>\n<p>Wei Wuxian beamed.</p>\n<p> </p>\n<p align=\"center\">✵</p>\n<p> </p>\n<p>\n<em> Lan Zhan, </em>\n</p>\n<p>\n<em>   </em>\n</p>\n<p>\n<em> I always had a bad memory, but I think dying made it worse. I don’t just forget faces anymore. There’s whole stretches of time gone, where I’ve learned from other people’s accounts that the Wei Wuxian of then was in Lotus Pier, Caiyi, Qinghe, Baifeng Mountain, but I don’t remember a lot of it. Most of my childhood is still here, and thank the gods for that, thank you, I don’t want to forget the lotus lakes, sunlight on the water and boats scattered across the surface like that children’s game, you know the one. Do you? Maybe you don’t, considering what I know about your uncle. The game where you make a little pile of joss sticks and take turns picking out one at a time, and the rule is if you disturb any of the other sticks you lose. You have to sit still and move slow and concentrate really hard. Lan Zhan ah, it won’t shock you to learn I was terrible at it! Shijie won every time. I didn’t care because I always lost in the first round, but Jiang Cheng—oh, his face got so red. Anyway, the long boats scattered like that, and when I was little I always imagined a giant hand coming down to pluck one of them right out of the water. I still remember that. So it’s okay. If it’s some sort of price I’m paying, I’ll happily give up every memory of the Sunshot Campaign for one moment of shijie. </em>\n</p>\n<p>\n<em>   </em>\n</p>\n<p>\n<em> Scattered like joss sticks, that’s how it is in my head these days! Scraps of memory all over the place and I’m not sure how they fit together, how many are real, how to touch one without disturbing another and maybe losing it forever. But if I’m very careful I can pluck one off the top of the pile and guess what, Lan Zhan? It’s you. Almost always. You in the cold springs, you in the sun-dappled woods, in a rain of flower petals, in a dark cavern, blood on your robes. You in the Library Pavilion, young and furious. My fault! How insufferable I was. I couldn’t help it, Lan Zhan. I just wanted you to look at me. </em>\n</p>\n<p> </p>\n<p align=\"center\">✵</p>\n<p> </p>\n<p>The junior sect members returned the next day, Wen Ning trailing after them like a mother goose after goslings. The first thing Sizhui and Jingyi did, bless them, was report to Lan Zhan, so Wei Wuxian was woken just after dawn by two bright little voices calling <em> Hanguang-jun! Hanguang-jun! </em>from outside the Jingshi.</p>\n<p> </p>\n<p>“Loud noise is forbidden in the Cloud Recesses!” he yelled back.</p>\n<p> </p>\n<p>It was quiet for a moment. Then came Sizhui’s tentative voice, “Wei-qianbei?”</p>\n<p> </p>\n<p>Lan Zhan sighed and got up to open the door. Jingyi immediately stuck his head inside, lighting up the moment he saw Wei Wuxian. It was actually pretty adorable; maybe Wei Wuxian wouldn’t throttle him after all. “Wei-qianbei!” Jingyi said, then remembered himself and greeted Lan Zhan with a bow and a cutely deferential, “Hanguang-jun.” Then to Wei Wuxian, “Wei-qianbei! You’re back!” </p>\n<p> </p>\n<p>“I’m back,” said Wei Wuxian, resigning himself to an early morning. The Jingshi only had the one bedroom, so Wei Wuxian had been sleeping in the main room where Lan Zhan did his work. Lan Zhan kept trying to give him the bedroom and Wei Wuxian kept refusing. He liked that the first thing he heard in the morning, before even opening his eyes, was the whisper of an ink-brush on paper. He liked that he opened his eyes to Lan Zhan.</p>\n<p> </p>\n<p>“Wei-qianbei!” said Sizhui, appearing at Jingyi’s shoulder. He bowed properly to both Lan Zhan and Wei Wuxian, then straightened up and gave Wei Wuxian a toothy smile, because he was the nicest kid to ever exist. “How long are you staying?” he asked.</p>\n<p> </p>\n<p>Wei Wuxian hesitated. He knew what he wanted the answer to be, but....</p>\n<p> </p>\n<p>“For as long as Lan Zhan allows it,” he said.</p>\n<p> </p>\n<p>“For as long as Wei Ying wishes,” Lan Zhan said at the exact same time.  </p>\n<p> </p>\n<p>They looked at each other. Jingyi snorted, then turned it into the fakest cough Wei Wuxian had ever heard.</p>\n<p> </p>\n<p>Sizhui cleared his throat. “Ah, so... Hanguang-jun, Wei-qianbei! We hunted a jackal king!”</p>\n<p> </p>\n<p>A jackal—? “Ai ai ai!” Wei Wuxian said loudly, trying not to shudder. “No! If it’s a jackal anything, I don’t want to hear about it. Just tell me whether or not you upheld the illustrious name of Lan, and then I’ll leave and you can give all the gory details to Hanguang-jun.”</p>\n<p> </p>\n<p>“We defeated it with minimal property damage and zero civilian injuries,” Sizhui rattled off.</p>\n<p> </p>\n<p>“It had eight legs,” Jingyi added.</p>\n<p> </p>\n<p>Wei Wuxian, in the middle of putting on his socks, nearly fell over. “I said I didn’t want to know!” he squawked. “I’ve saved your life how many times and you repay me like this? By giving me nightmares about horrible eight-legged monster dogs? Hanguang-jun! Banish him from the sect!”</p>\n<p> </p>\n<p>“Wha—you can’t do that!” said Jingyi.</p>\n<p> </p>\n<p>“Watch me!”</p>\n<p> </p>\n<p>Jingyi rounded on Lan Zhan. “Hanguang-jun!”</p>\n<p> </p>\n<p>“Oh, now you’re shouting at His Excellency, the Chief Cultivator?” Wei Wuxian shook his head. “Banishment for sure.”</p>\n<p> </p>\n<p>“Wei Ying,” Lan Zhan said mildly. “There is no need to antagonize the junior sect members.”</p>\n<p> </p>\n<p>“That’s right!” said Jingyi, sticking out his tongue.</p>\n<p> </p>\n<p>“The disrespect,” said Wei Wuxian. “Does the title Yiling Laozu mean nothing anymore? Do I not strike fear into your tiny baby hearts? I feel like I should strike more fear than I am currently striking.”</p>\n<p> </p>\n<p>“They have seen you with the rabbits,” Lan Zhan said gravely.</p>\n<p> </p>\n<p>Wei Wuxian buried his face in his hands. “Lan Zhan ah Lan Zhan.... This is terrible, I’m not scary at all anymore.... Maybe I should go on a crime spree.”</p>\n<p> </p>\n<p>“Yes!” said Jingyi.</p>\n<p> </p>\n<p>“No,” said Lan Zhan.</p>\n<p> </p>\n<p>“Can we come?” said Jingyi. Sizhui looked worried.</p>\n<p> </p>\n<p>“Maybe,” said Wei Wuxian.</p>\n<p> </p>\n<p>“No,” said Lan Zhan.</p>\n<p> </p>\n<p>“Unfortunately you cannot,” amended Wei Wuxian.</p>\n<p> </p>\n<p>Jingyi’s shoulders slumped. Sizhui, visibly relieved, patted his shoulder in consolation.  </p>\n<p> </p>\n<p>“Come,” Lan Zhan addressed the two juniors. “You may deliver a full report in the Elegance Room.”</p>\n<p> </p>\n<p>“Yes, Hanguang-jun!” they said at once, leaping to attention. It was so damn sweet, how much they looked up to him. How much they loved him. Lan Qiren had inspired discipline and respect, but nothing like this.</p>\n<p> </p>\n<p>With one last glance at Wei Wuxian, Lan Zhan led the juniors back outside and slid the door shut behind them. Then it was quiet again. Dawn light crept across the floor. Outside, the swallows were singing the coming day.</p>\n<p> </p>\n<p>Wei Wuxian took a shaky breath.</p>\n<p> </p>\n<p>It was ridiculous, being this affected by a smile. Not even a smile. Just that soft, dark-eyed look.</p>\n<p> </p>\n<p align=\"center\">✵</p>\n<p> </p>\n<p>Later that afternoon Wei Wuxian found Lan Zhan in the main courtyard, speaking with Wen Ning.</p>\n<p> </p>\n<p>“Wei-gongzi!” Wen Ning called out, waving like a drowning man hailing a ship, as if worried Wei Wuxian would somehow miss him. “Wei-gongzi! You’re back!”</p>\n<p> </p>\n<p>“As are you,” said Wei Wuxian, stepping up to them. He smiled at Lan Zhan and then ruffled Wen Ning’s hair the way he used to do with Jiang Cheng. Of course Jiang Cheng had despised it; Wen Ning looked shyly pleased. “How were your travels? <em> Don’t </em> tell me about the jackal king, I’ve heard more than enough already.”</p>\n<p> </p>\n<p>“It’s been going well, Wei-gongzi,” Wen Ning said. “I—I like night hunting with the Lan Clan.”</p>\n<p> </p>\n<p>“They’re very competent, aren’t they?” said Wei Wuxian. “Wen Ning, eat with us in the Jingshi tonight. I want to hear all about your latest grand adventure.”</p>\n<p> </p>\n<p>Wen Ning’s eyes widened. “Wei-gongzi, are you sure? Hanguang-jun?”</p>\n<p> </p>\n<p>“Sure I’m sure. And Lan Zhan’s fine with it, aren’t you, Lan Zhan?” Wen Ning didn’t seem to realize it, but he’d very much earned a spot on Lan Zhan’s list of approved people, places, and things. Categories: ‘People Lan Zhan Trusts With Wei Ying and Sizhui’s Well-being,’ ‘People Jiang Wanyin Hates,’ and ‘People Who Do Not Make Excessive Noise.’</p>\n<p> </p>\n<p>Lan Zhan nodded. “Mm.”</p>\n<p> </p>\n<p>“See, there you go!”</p>\n<p> </p>\n<p>“O-okay,” said Wen Ning, ducking his head bashfully. “Thank you, Wei-gongzi, Hanguang-jun.”</p>\n<p> </p>\n<p>After Wen Ning took his leave to go rest up in the guesthouse, Wei Wuxian turned to Lan Zhan. “How was Sizhui’s report?” he asked. “How’d he do on the hunt?”</p>\n<p> </p>\n<p>Lan Zhan never missed an opportunity to praise his son. “He did well,” he said, which meant Sizhui had done fucking fantastic and Lan Zhan was brimming with pride. “The others and Wen Qionglin, too.”</p>\n<p> </p>\n<p>“I’ve got high hopes for this new generation.” Wei Wuxian slipped his hand into Lan Zhan’s and tugged him along, leading him back through the main courtyard, past Zewu-jun’s Hanshi and the Jingshi on its gently sloping hill, to the mountain path that led to the cold springs. He didn’t actually have any plans to soak in the springs, it was just a nice afternoon and Lan Zhan had been busy with important-person things all morning and Wei Wuxian wanted him all to himself, at least for a couple hours.</p>\n<p> </p>\n<p>The woods were cool and bright, bamboo groves thinning out into a forest of fir trees and red pine. Swallows sang all around them, flitting overhead, flashes of blue. After a while Lan Zhan adjusted his grip on Wei Wuxian’s hand, lacing their fingers together. His hand was big and warm and dry. The lace of his sleeves tickled Wei Wuxian’s wrist. If someone saw them walking so close together like this, holding hands, they’d probably assume—well. Wei Wuxian smiled at his feet and thought about the song Lan Zhan had composed. He still didn’t know the title.</p>\n<p> </p>\n<p>“If I wrote a song,” he said casually, swinging their hands between them, “I’d call it ‘Ode to a Lotus Pond High in the Clouds.’”</p>\n<p> </p>\n<p>“That is a good title.”</p>\n<p> </p>\n<p>“Maybe I’ll write it. Maybe I’ll write a whole collection, and it’ll be so good that your poor uncle will be forced to put it in the Library Pavilion, and I shall leave my mark upon the Cloud Recesses forever.”</p>\n<p> </p>\n<p>“You already have,” said Lan Zhan. “Six hundred and seventy-three times over.”</p>\n<p> </p>\n<p>“Wait a minute, are you saying only six hundred and seventy-three of the new rules are because of me?” Wei Wuxian asked, dismayed. “It’s really not the whole thousand? Who inspired the other ones, then?”</p>\n<p> </p>\n<p>“Some were written in the aftermath of the war,” said Lan Zhan. “Some arose naturally; new generations always beget new rules.” He paused. “Many were Lan Jingyi.”</p>\n<p> </p>\n<p>“Love that kid.”</p>\n<p> </p>\n<p>“Two were Sizhui.”</p>\n<p> </p>\n<p>Wei Wuxian’s jaw dropped. “No, really? Which two?”</p>\n<p> </p>\n<p>“It is forbidden to transport cicada eggs indoors. It is even more forbidden to hide cicada eggs amongst the linens.”</p>\n<p> </p>\n<p>“Oh my god.”</p>\n<p> </p>\n<p>“It was an unusually cold spring. He worried the cicadas might freeze. Half the sect woke up crawling with nymphs.”</p>\n<p> </p>\n<p>“How old was he?”</p>\n<p> </p>\n<p>“Six.”</p>\n<p> </p>\n<p>“<em>Love </em> that kid.”</p>\n<p> </p>\n<p>“Many were me,” said Lan Zhan.</p>\n<p> </p>\n<p>Wei Wuxian stopped walking. They’d long since passed the cold springs and were making their way down the mountainside now, roughly parallel to one of the white mountain streams, the tumbling water a low roar in the background below the birdsong and the hushing leaves. “That’s stupid,” Wei Wuxian said. Anger was rising in his throat just like it had the first time he’d seen the whip scars on Lan Zhan’s back. “That’s stupid. You’re perfect.”</p>\n<p> </p>\n<p>“I have made my mistakes.”</p>\n<p> </p>\n<p>That stung, and Wei Wuxian didn’t hide it fast enough. He swallowed and made to let go of Lan Zhan’s hand, but Lan Zhan just held him tighter.</p>\n<p> </p>\n<p>“You were not one of them,” he said.</p>\n<p> </p>\n<p>Wei Wuxian’s breath stuttered. He wanted a lot of things. Most of them involved kissing Lan Zhan. There were definitely reasons not to do that, but it was getting harder and harder to remember them, especially with Lan Zhan looking at him like this, earnest but guarded; his shy face. The sunlight brought out the dark, earthy browns in his black hair, the strange gold of his eyes. He was icy jade in moonlight, soft and human in the sun. Glowing either way.</p>\n<p> </p>\n<p><em> I’m yours</em>, Wei Wuxian tried to communicate telepathically. <em> I’m yours, I’m yours, just take me</em>. Before he’d died, so many people had wanted him for themselves, wanted him as a mindless servant, a secret weapon, a trump card, a bargaining chip. The hypocrisy had disgusted him then; it disgusted him now. He was his own. But he was also Lan Zhan’s.</p>\n<p> </p>\n<p>“You didn’t make any mistakes with me,” Wei Wuxian said, finding Lan Zhan’s eyes. “You did everything you could. It’s just I was never going to listen. Okay? None of it was your fault, okay?”</p>\n<p> </p>\n<p>Lan Zhan didn’t answer.</p>\n<p> </p>\n<p>“Stubborn,” Wei Wuxian scolded him gently, and then, since they were now in the business of embracing, he let go of Lan Zhan’s hand only to step into his arms, pressing his cheek to Lan Zhan’s shoulder. This time Lan Zhan melted immediately, arms coming up around Wei Wuxian’s back. He smoothed one hand down the curve of Wei Wuxian’s spine.</p>\n<p> </p>\n<p>Wei Wuxian closed his eyes and let himself be held. He could feel Lan Zhan’s breaths in his hair, warm on the shell of his ear.</p>\n<p> </p>\n<p>“I like this,” he murmured, finding it easier to be honest when he didn’t have to make eye contact. “Why didn’t we ever do this before? We should be doing this all the time.”</p>\n<p> </p>\n<p>Lan Zhan’s arms tightened around him. He nodded against Wei Wuxian’s head.</p>\n<p> </p>\n<p>“When we go west, I think you’ll have to hold me a lot,” said Wei Wuxian. “I’ve heard the Great Desert gets freezing at night even when it’s boiling hot during the day, and I get cold so easily now, I’m really very delicate. Lan Zhan will have to keep me warm so I don’t freeze, okay?”</p>\n<p> </p>\n<p>He was expecting a huff of amusement or an admonishing <em> ‘Wei Ying,’ </em> but Lan Zhan just nodded again.</p>\n<p> </p>\n<p>“Ah, you—you don’t actually have to,” Wei Wuxian said, guilt squirming in his belly. He knew damn well that Lan Zhan had a complex about Wei Wuxian experiencing any sort of discomfort whatsoever, and it wasn’t fair to play into it like that. “I was kidding, you don’t have to.”</p>\n<p> </p>\n<p>“I will,” said Lan Zhan, holding him even tighter.</p>\n<p> </p>\n<p>“Oh,” said Wei Wuxian in a tiny voice. “Okay.”</p>\n<p> </p>\n<p>“Mm.”</p>\n<p> </p>\n<p>They held each other like that for a long time, the woods alive and breathing around them, until the sunlight deepened from pale to honey-gold. Then it was time to head back up the mountain, back to the Cloud Recesses, to dinner with Wen Ning and whatever came after. Lan Zhan looked just as reluctant to part as Wei Wuxian felt, but they held hands for the whole walk back. And somehow, that was just as good.</p>\n<p> </p>\n<p align=\"center\">✵</p>\n<p> </p>\n<p>\n<em> Lan Zhan, </em>\n</p>\n<p>\n<em>   </em>\n</p>\n<p>\n<em> How funny, I knew I’d miss you, but missing isn’t the right word for this. I miss hot baths and good liquor. I miss waking to guqin music. I miss watching your hands like golden sparrows hopping from string to string. I do not miss silence except the silence with you; I do miss the scent of sandalwood and orchid and even your bland meals, really, how much tofu can one person eat? Well, I miss these things only sometimes, when I’m reminded of them, and I miss you always, and I am reminded of you always: you live inside me. Ahh! That’s dramatic! You’ll never read this, but if you did, I think you might disapprove. Does the Cloud Recesses have a principle forbidding excessive displays of emotion? Almost certainly. Over four thousand rules now, right? How many were conceived in direct response to that troublemaker Wei Wuxian? Some people inspire poetry; I inspire new laws. </em>\n</p>\n<p>\n<em>   </em>\n</p>\n<p>\n<em> But you’re pretty good at breaking them, aren’t you? </em>\n</p>\n<p>\n<em>   </em>\n</p>\n<p>\n<em> If I said that out loud, I think it would hurt you. I think you’d hear it in your uncle’s voice. But it’s me, Lan Zhan, and you have to know I don’t mean it like failure, I mean it like you’re the best, you’re just the best, you’re so good. Sweet Lan Zhan in the moonlight with your twin white jars. I’d come back from the dead just for that. When I tell you it’s a revelation to watch you pour liquor, please know it has nothing to do with you breaking the rules. </em>\n</p>\n<p>\n<em>   </em>\n</p>\n<p align=\"center\">✵</p>\n<p> </p>\n<p>Thirteen years later, Caiyi Town hadn’t changed much. The docks were loud and bustling, the market street still lined with stalls selling children’s toys and paper lanterns and sugar-blown animals, scallion pancakes and roasted hazelnuts and steamed buns and hot fried buns and baskets of sunset-orange persimmons—no loquats this time of year. And yes, Emperor’s Smile.</p>\n<p> </p>\n<p>Wei Wuxian nudged Lan Zhan, nodding at the rows of white porcelain jars. “Can I?”</p>\n<p> </p>\n<p>Lan Zhan’s mouth twitched. “Do you need permission?”</p>\n<p> </p>\n<p>“Well, you’re <em> Chief Cultivator </em> now,” Wei Wuxian said loftily. “Who knows, maybe you’re even stricter than you used to be. Maybe you’ll make me copy the Lan Sect Principles another thousand times.”</p>\n<p> </p>\n<p>“I don’t think I can make you do anything,” said Lan Zhan.</p>\n<p> </p>\n<p>Wei Wuxian laughed. “Quite the opposite, actually. You’re maybe the only person who could.”</p>\n<p> </p>\n<p>“I would not.”</p>\n<p> </p>\n<p>“And that’s why.”</p>\n<p> </p>\n<p>They’d been walking alongside one of the winding canals that cut through town, not going anywhere in particular, just enjoying the sunlight. It was warmer here at the foot of the mountain than up at the Cloud Recesses, the sky a perfect forget-me-not blue. Winter wouldn’t take hold of the valley for another month yet, but the hills were snow-white with blooming loquat trees. In early spring, the tiny star-shaped flowers would bear their golden fruit.</p>\n<p> </p>\n<p>“Persimmons!” one of the vendors shouted. “Ripe persimmons! First of the season!”</p>\n<p> </p>\n<p>“Fresh prawns! Fresh prawns caught just this morning!”</p>\n<p> </p>\n<p>“Guniang, don’t you want a new ribbon for your hair?”</p>\n<p> </p>\n<p>It was beautiful here, but seeing the Caiyi market made Wei Wuxian miss the riverside markets of Yunmeng. He missed spicy pork buns and baskets of lotus root, fish cakes shaped like lotus flowers. He missed steaming bowls of noodles speckled with white crawfish meat, swimming in chili oil. He missed the men who darted around with bundles of fat red chili peppers strapped to their backs, the fishermen’s wives who squatted over baskets of the morning’s catch, gossiping loudly and giving the stink-eye to anyone who dared interrupt. Wei Wuxian missed the clam-shucking girls. The heaps of dried river shrimp and shiny black mud snails. The ever-present smell of fish and river muck. The chaos—wives and servants and cooks all swarming around the straw birdcages at the fowl stall, pointing to the fattest chickens, shouting at the stall owner to squeeze them by the neck to prove he hadn’t shoved pebbles down their gullets to make them heavier, then shouting at him over the price. It was always loud and overwhelming and messy, just how Wei Wuxian liked it.</p>\n<p> </p>\n<p>He missed Yunmeng. He’d always miss it. But it hadn’t been his home for a long time. </p>\n<p> </p>\n<p>Lan Zhan was looking at him, expectant. Wei Wuxian tried to remember what on earth they’d been talking about.</p>\n<p> </p>\n<p>Then Lan Zhan said, “You can buy whatever you want. You can do whatever you want.”</p>\n<p> </p>\n<p>Wei Wuxian’s heart pattered like summer rain.</p>\n<p> </p>\n<p>If someone like Jiang Cheng had told him ‘<em>you can do whatever you want</em>,’ he’d mean it like: ‘<em>Do whatever you want, see if I care.’ </em> That wasn’t how Lan Zhan said it. He said it like this was a fundamental truth, a known law of the world. He said it like: <em> ‘In the past you couldn’t do whatever you wanted, but things are different now.’ </em> It was strange, because from Wei Wuxian’s perspective, he’d spent the majority of his life being selfish and doing whatever the fuck he wanted, and that was how he’d ended up universally reviled and dead at twenty-one.</p>\n<p> </p>\n<p>But if Lan Zhan wanted to spoil him, he certainly wasn’t going to argue.</p>\n<p> </p>\n<p>“That’s a bold statement, Hanguang-jun,” he said, raising his eyebrows. “What if I want....” <em> You. You. Just you. In the sunlight. In early spring when the loquats fall. In the Jingshi. In my bed. In yours. </em> “A jewel for each finger and... and a set of mulberry silk robes for every day of the week so I never repeat one, and... um....”</p>\n<p> </p>\n<p>“A solid gold divan,” Lan Zhan suggested.</p>\n<p> </p>\n<p>“Yeah! A solid—sorry, what?” Wei Wuxian stared at him. “A solid gold divan? Did you just make that up?”</p>\n<p> </p>\n<p>“One such item was reportedly found amongst the possessions of former Jin zongzhu Jin Jinhai after his death. Three generations ago now.”</p>\n<p> </p>\n<p>“That’s disgusting,” said Wei Wuxian. “It wouldn’t even be comfortable!”</p>\n<p> </p>\n<p>“Indeed.”</p>\n<p> </p>\n<p>“Gods, of course it was a Jin.” Wei Wuxian made a face, then thought of Jin Zixuan and tamped it down. “Well, whatever, don’t worry about getting me one of those.”</p>\n<p> </p>\n<p>“Noted. And the jewels?”</p>\n<p> </p>\n<p>Wei Wuxian waved a hand. “Forget all of it. Just pour my drinks forever and I’ll be perfectly happy, how’s that?”</p>\n<p> </p>\n<p>Lan Zhan blinked, then nodded.</p>\n<p> </p>\n<p>“Good boy,” Wei Wuxian said, and started off again. There was a stall selling chestnut cakes up ahead, sugar and honey sticky-sweet in the air. “Lan Zhan! I haven’t had one of these in ages!”</p>\n<p> </p>\n<p>He’d just stepped up to the cake stall when a woman’s voice said, “Hey! Handsome gongzi! Come buy a comb for your wife!” </p>\n<p> </p>\n<p>It was the auntie at the next stall over, perched on a stool behind a counter heaped with an assortment of combs and ribbons and hair sticks and other little ornaments. The moment Wei Wuxian caught her eye, she started beckoning wildly. </p>\n<p> </p>\n<p>“Come here, gongzi, there’s not a girl out there who doesn’t want a comb from her young man!” she said. “I’ve got everything from bamboo to the finest jade, so don’t tell me you can’t afford to spoil her a little! You have to show your wife she’s appreciated, you know. You can’t let the romance die just because you’re married!”</p>\n<p> </p>\n<p>“Ah….” Wei Wuxian said, inching closer just so she’d lower her voice. He could feel Lan Zhan at his back. “Thank you, but I don’t have a wife.”</p>\n<p> </p>\n<p>She looked scandalized. “But you’re so handsome!”</p>\n<p> </p>\n<p>“Ah?” He laughed awkwardly and tried to make desperate <em> save me! </em>eye contact with Lan Zhan, who of course had chosen this exact moment to be wholly focused on a comb of white jade, the useless lump. “Thank you, that’s very—”</p>\n<p> </p>\n<p>“Surely you must want a wife!” the auntie said. “How old are you, twenty-five? Both my sons were married with sons of their own by your age! Don’t tell me you don’t even have a sweetheart?”</p>\n<p> </p>\n<p>More like thirty-five, actually, but Wei Wuxian wasn’t about to get into the semantics of weird cultivator aging with her. Also, he’d been dead for thirteen of those years. So who knew what counted and what didn’t, in the end. <em>Also, </em>“I’m really not looking,” he said with a polite smile.</p>\n<p> </p>\n<p>“So you do have a sweetheart!” She must have caught something in his expression, because she broke into a grin and crowed, “Ha! I knew it! Women can always tell.”</p>\n<p> </p>\n<p>“Nope,” Wei Wuxian said, panicking a little, hyper-aware of Lan Zhan’s presence less than five feet away. “No, sorry, no sweethearts here!”</p>\n<p> </p>\n<p>Her eyes glinted. “Well, if that’s the case, you can ask anyone around and they’ll tell you my niece Kang Kueifei is the prettiest maiden in Caiyi!”</p>\n<p> </p>\n<p>Alright, they were done here. “Many thanks, I’ll keep that in mind,” Wei Wuxian said. He took a big step sideways, reaching out blindly until his fingers found the soft, flowy fabric of Lan Zhan’s sleeve. “So sorry, my friend and I have to be going. He’s very important, very busy.”</p>\n<p> </p>\n<p>“Are you sure you don’t want a comb? Just in case? It’s an investment in your future!”</p>\n<p>\n<em>   </em>\n</p>\n<p>“Quite sure, thank you kindly,” said Wei Wuxian, and dragged Lan Zhan away from the stall and around the corner onto a narrower street, the ground packed dirt instead of cobblestone. He finally let go of Lan Zhan’s sleeve and rounded on him. “Lan Zhan! You really just left me to fend for myself back there!”</p>\n<p> </p>\n<p>“Madam Comb-seller was not a threat.”</p>\n<p> </p>\n<p>“I’d rather face a horde of fierce corpses than one tenacious matchmaking auntie any day,” Wei Wuxian said. “That was a nightmare. I didn’t even get a cake for my suffering!”</p>\n<p> </p>\n<p>In response, Lan Zhan held out a little paper sleeve.</p>\n<p> </p>\n<p>Wei Wuxian’s mouth dropped open, all grievances forgotten. How sly! He hadn’t even noticed Lan Zhan buying it. “Lan Zhan,” he said happily, accepting the cake. It was almost too pretty to eat, warm and crumbly and beeswax-yellow, stamped with the image of a four-petaled flower. Wei Wuxian made a mental note to do some research re: inventing a spell that could make his entire life smell of honey and rock sugar and chestnut paste, like, all the time. In the name of scientific advancement. He beamed at Lan Zhan, eyes crinkling. “Thank you, you’re the best, you’re my favorite.”</p>\n<p> </p>\n<p>Lan Zhan’s ears were wonderfully pink. “Mm,” he said.</p>\n<p> </p>\n<p>Wei Wuxian shoved half the cake in his mouth just so he didn’t do something crazy like beg Lan Zhan to kiss him. That would be too much. It felt impossible that he could have even this; that he could stand here on a dusty street in Caiyi with his favorite person in the world, this endlessly kind person who bought him sweets and liquor and all the other things he wanted but didn’t need, who protected him and let him sleep in and said ridiculous things like <em> ‘you can do whatever you want’ </em>and actually meant it. And somehow, somehow, this was real. There was no time limit, no war on the red horizon, no bounty on Wei Wuxian’s head. No foreseeable reason for this to end. That, more than anything else, was the part Wei Wuxian couldn’t wrap his mind around. Because this had to end, didn’t it? It was so good, it was really so good, it couldn’t possibly last. He’d never known a bright thing that wasn’t snuffed out. He wanted to stay at Lan Zhan’s side forever, but wouldn’t Lan Zhan get sick of him eventually?</p>\n<p> </p>\n<p>Well.... Until then, Wei Wuxian would take whatever Lan Zhan was willing to give, for however long he was willing to give it, and he would not ask for more.</p>\n<p> </p>\n<p>Until then:</p>\n<p> </p>\n<p>Wide blue sky. A lack of fear. Lan Zhan.</p>\n<p> </p>\n<p>Wei Wuxian held out the other half of the chestnut cake to Lan Zhan. “Here, you try.”</p>\n<p> </p>\n<p>Lan Zhan shook his head. “It’s for Wei Ying.”</p>\n<p> </p>\n<p>“But I want to share it. It’s not often I have something to share.” He channeled Sizhui, doing his best hopeful fawn eyes. “Please, Lan Zhan? I don’t think I’ve ever seen you eat something sweet, don’t deny me the satisfaction.”</p>\n<p> </p>\n<p>Lan Zhan sighed. Wei Wuxian was expecting him to take the paper sleeve, so when Lan Zhan simply leaned down and took a neat, careful bite of the cake, lips almost brushing Wei Wuxian’s fingers, he had to bodily restrain himself from squeaking.   </p>\n<p> </p>\n<p>“Hm,” said Lan Zhan, straightening up as if nothing out of the ordinary had happened and he ate from Wei Wuxian’s hand all the time. Gods, Wei Wuxian should be so lucky<em>. </em> “It’s good.”</p>\n<p> </p>\n<p>“Good.” Wei Wuxian cleared his throat. “You want more?”</p>\n<p> </p>\n<p>“No. It’s for Wei Ying.”</p>\n<p> </p>\n<p>“Alright, alright.” He finished off the cake, licking honey off his fingers as he thought about what they should do next. They’d already been through the market, but he didn’t feel like going back to the Cloud Recesses just yet. “Hey, wanna go get a drink?”</p>\n<p> </p>\n<p>“...Hm?” said Lan Zhan.</p>\n<p> </p>\n<p>“A drink,” Wei Wuxian repeated. “You know, you actually look a little flushed, Lan Zhan. Let’s go find a place to sit down, okay? I’ll buy you all the fancy flavorless tea your heart desires.”</p>\n<p> </p>\n<p>“You didn’t bring any money,” Lan Zhan pointed out.</p>\n<p> </p>\n<p>Wei Wuxian pouted at him. “You’re my zhiji, what’s mine is yours. And the other way round.”</p>\n<p> </p>\n<p>“Is that so.”</p>\n<p> </p>\n<p>“Well, isn’t it?”</p>\n<p> </p>\n<p>“...Yes,” said Lan Zhan.</p>\n<p> </p>\n<p>“That’s right,” said Wei Wuxian, smiling at him. “C’mon then, let’s get you out of the sun.”</p>\n<p> </p>\n<p>They found a nice restaurant just off the docks. The owner recognized Lan Zhan and bowed about a dozen times, babbling on about what an honor it was to serve the esteemed Hanguang-jun and his, ah, companion. He set them up at the back of the restaurant behind a privacy screen, and two waiters showed up immediately with bowls of figs and pickled vegetables and jars of Emperor's Smile and a pot of what was apparently the finest oolong in Gusu, aged forty years.</p>\n<p> </p>\n<p>“I could get used to this kind of service!” said Wei Wuxian after the waiters left, leaning across the table to pour Lan Zhan’s tea. “It's funny, I noticed they didn’t refer to you as His Excellency. It’s always nice to remember that the common people don’t give a shit about cultivator politics. They just know Hanguang-jun keeps the bad things away.” He winked. “Well, most of them.”</p>\n<p> </p>\n<p>Lan Zhan gave him a flat look. He picked up his teacup but didn’t drink, which was unusual, as Lan Zhan did not fidget or otherwise make gratuitous movements.</p>\n<p> </p>\n<p>“Lan Zhan?”</p>\n<p> </p>\n<p>He was quiet for a long moment. Then, almost hesitant, “The comb seller.”</p>\n<p> </p>\n<p>Wei Wuxian waited for an elaboration that didn’t come. “...Uh, yes? What about her?”</p>\n<p> </p>\n<p>“Do you... is that something you want?”</p>\n<p> </p>\n<p>“What, a comb?”</p>\n<p> </p>\n<p>“A wife.”</p>\n<p> </p>\n<p>Wei Wuxian was shocked into laughter. But Lan Zhan didn’t lift his eyes from his tea, and now that Wei Wuxian was looking, he can tell Lan Zhan’s shoulders were even stiffer than usual. Holy shit, he wasn’t joking. “What the hell,” Wei Wuxian said weakly.</p>\n<p> </p>\n<p>“What she said was not inaccurate,” Lan Zhan said. “You are... past the proper age.”</p>\n<p> </p>\n<p>“So are you, and you’re not married,” Wei Wuxian pointed out. “Do you want a wife? Is that what this is about?”</p>\n<p> </p>\n<p>Lan Zhan stared at him. “No,” he said.</p>\n<p> </p>\n<p>“Good,” said Wei Wuxian, then realized how that sounded and scrambled to save it. “Because—because if you did find a wife, Sizhui would have to get used to a third p—a third, um, adult person hanging around, and that would be way too confusing for him.” Oh, mother of fuck, that was a million times worse. “But then again he’s the best kid in the world, so I’m sure it would be fine and he’d just be super excited for you. If you got married, I mean. Because he cares about your happiness. As do I.”</p>\n<p> </p>\n<p>“Wei Ying,” said Lan Zhan. “I do not want a wife.”</p>\n<p> </p>\n<p>“Okay,” Wei Wuxian said helplessly, wondering why monsters and hungry ghosts never attacked when you needed them to. “Thank you for that information.”</p>\n<p> </p>\n<p>“Do you?”</p>\n<p> </p>\n<p>“Hm?”</p>\n<p> </p>\n<p>“Do you,” Lan Zhan repeated.</p>\n<p> </p>\n<p>“Ah—no,” said Wei Wuxian. He was doing this sexy new thing where he didn’t lie to Lan Zhan, but gods, this conversation was a nightmare. “No, I—I don’t think that’s in the cards.” Lan Zhan’s brow furrowed slightly and Wei Wuxian realized he hadn’t actually answered the question; he’d answered around it. It was unfair of him, especially considering Lan Zhan had clearly exhausted his ‘verbal intimacy’ reserves and was going to let him get away with the non-answer. That was no good. Wei Wuxian took a steadying breath and said, “No, I don’t want a wife. I will never want a wife.”</p>\n<p> </p>\n<p>An excruciating pause, then Lan Zhan nodded. He took a sip of tea. His face was completely unreadable, even to Wei Wuxian.</p>\n<p> </p>\n<p>“Alright,” said Wei Wuxian, pouring himself another drink. “Good talk.”</p>\n<p> </p>\n<p align=\"center\">✵</p>\n<p> </p>\n<p> Wei Wuxian wasn’t drunk, it was just that the world was swaying.</p>\n<p> </p>\n<p>He’d been clinging to Lan Zhan for the better part of an hour, first during the walk back through Caiyi to the docks and then on the sword-ride back to the Cloud Recesses. Lan Zhan had wanted to just get a room in town for the night, doubting Wei Wuxian’s abilities to hold onto him if they rode Bichen, which was silly of him, as these days there was nothing Wei Wuxian did better than hold on to Lan Zhan, and nothing he liked to do more. It only took a bit of wheedling before Lan Zhan caved, and Wei Wuxian was allowed the fantastic experience of stepping up onto Bichen and hugging Lan Zhan as tight as he could, one of Lan Zhan’s arms wrapped firmly around his back, for the entire trip back up the mountain. The less fantastic part was when the sword rose high enough that the air grew cool and wet with drifting clouds, and Wei Wuxian’s heart lurched with a visceral memory of the last time he’d been suspended in the air like this, and how it ended. He’d closed his eyes, pressed his face to Lan Zhan’s neck, and breathed deeply, sandalwood and almond. That helped a lot.</p>\n<p> </p>\n<p>Before long they'd descended into the Cloud Recesses like a leaf sinking slowly through water. Lan Zhan had stepped off the sword, Wei Wuxian stumbling down after him, and they’d crunched their way over the white shell courtyard to the Jingshi, and here they were, and Wei Wuxian was <em> not </em> drunk, just off-balance.</p>\n<p> </p>\n<p>“It feels like I’ve lost a lot of blood but like, in a good way,” he mused aloud as Lan Zhan slid open the door to the Jingshi, leading him inside. Wei Wuxian tripped over the threshold and didn’t fall only because Lan Zhan caught him. “You’re good at that,” he said, and snorted at his own joke, laughing into Lan Zhan’s shoulder. “Lan Zhan ah Lan Zhan.... Remember the first time we met? Well, technically the second time. When I snuck into the Cloud Recesses. There was a full moon just like tonight. Remember that?”</p>\n<p> </p>\n<p>“Mm.”</p>\n<p> </p>\n<p>“You were so funny,” Wei Wuxian continued as Lan Zhan walked him over to the bed. He sat down heavily and grabbed a handful of Lan Zhan’s robes when he started to move away. “Noooo, don’t go, I’m telling you how funny you were. Are. Did you know, Lan Zhan, I think you’re the funniest person I’ve ever met. Nobody knows how funny you are! People are so dumb—<em>ai ai ai Lan Zhan</em>! Don’t go!”</p>\n<p> </p>\n<p>“I’m not going,” said Lan Zhan. He knelt at Wei Wuxian’s feet. “No shoes in bed.”</p>\n<p> </p>\n<p>“Ah?”</p>\n<p> </p>\n<p>A little dazed, Wei Wuxian peered down at him, this kneeling Lan Zhan. He was so graceful even with this: tugging Wei Wuxian’s shoes off. Disappearing briefly to put them with the other shoes that were lined up just outside the door, and Wei Wuxian took a moment to get emotional about that: that his black shoes had a permanent spot next to Lan Zhan’s pretty white boots, because he <em> lived </em> here, he wasn’t a guest. Lan Zhan returned and knelt down again to remove Wei Wuxian’s socks, cupping his ankle in one big, warm hand. In the low light Lan Zhan wasn’t white jade, he was pure gold. His hair was deepest black, his eyes darker than usual, a lovely, shifting color like autumn leaves rippling in a light breeze. He was trying to look exasperated, but his mouth was doing something sweet.  </p>\n<p> </p>\n<p>Wei Wuxian wasn’t drunk enough to say ‘<em>You’re stunning,’ </em> but he thought it very hard.</p>\n<p> </p>\n<p>“Hanguang-jun,” he said, and patted Lan Zhan’s cheek twice, pat-pat, like he would a rabbit. “What an honor it is to know you.”</p>\n<p> </p>\n<p>“...Water,” said Lan Zhan.</p>\n<p> </p>\n<p>“Ah?”</p>\n<p> </p>\n<p>Lan Zhan got to his feet again, ignoring Wei Wuxian’s noise of protest. It took one thousand years for him to go <em> all </em> the way over to the table, pour a cup of water from the copper teapot, and come <em> all </em>the way back again. It was like he was moving slow on purpose! Damn the elegance of the Lan! Wei Wuxian wanted Lan Zhan and water, in that order, and he had never been patient.</p>\n<p> </p>\n<p>“Drink,” said Lan Zhan, holding out the cup.</p>\n<p> </p>\n<p>Wei Wuxian couldn’t resist teasing him. “Only if you sit with me.”</p>\n<p> </p>\n<p>“Wei Ying.”</p>\n<p> </p>\n<p>“Lan <em> Zhan</em>.” Wei Wuxian scooted over and patted the space beside him. “Sit with me.”</p>\n<p> </p>\n<p>They stared at each other. Wei Wuxian tried to look innocent. He was innocent. He was just warm and drifting and wanted Lan Zhan closer, that was all.</p>\n<p> </p>\n<p>Lan Zhan sighed and sat on the edge of the bed, leaving a deliberate hand’s-length between them. He faced Wei Wuxian, back and shoulders straight, and offered the cup again. For a moment Wei Wuxian saw two Lan Zhans: the current one, and the Lan Zhan who had offered him a stolen lotus pod, awkward and lovely in the middle of a misty lake.</p>\n<p> </p>\n<p>“Better,” said Wei Wuxian. He drained the cup sloppily, water trailing down his chin and throat. “Look at you, taking care of me. Last time it was the other way round, remember that?” He shook his head, tsking. “Never mind, I guess you don’t. You’re a menace when you’re drunk, Lan Zhan.”</p>\n<p> </p>\n<p>Lan Zhan’s eyes widened. “You said I didn’t do anything.”</p>\n<p> </p>\n<p>“No, don’t worry, you didn’t. But I asked if you liked rabbits and you were like, ‘<em>yyyeaaahh</em>,’ and it was the cutest thing I’ve ever seen in my whole life. It was so funny.”</p>\n<p> </p>\n<p>“Funny,” Lan Zhan repeated, doubtful.</p>\n<p> </p>\n<p>“You’re always funny. I don’t know how other people don’t see it.” Wei Wuxian set the cup aside and scooted closer, studying Lan Zhan’s face in the candlelight. “Look at you,” he said again, softer.</p>\n<p> </p>\n<p>“Other people don’t,” said Lan Zhan.</p>\n<p> </p>\n<p>“What?”</p>\n<p> </p>\n<p>“Look at me.” His expression shifted into something almost embarrassed. “Wei Ying should sleep.”</p>\n<p> </p>\n<p>Wei Wuxian ignored him. “They’re all fools,” he declared, gesturing grandly. “Everyone should look at you all the time. Oh no, actually I take it back, you’d hate that. How’s this: I’ll look at you twice as much to make up for everyone else’s slacking off.” He rubbed his nose, lost in thought. “Ah, how much did I drink....”</p>\n<p> </p>\n<p>It was too bright in here. Wei Wuxian waved a hand and all the candles in the room snuffed out at once, nine tendrils of smoke rising up like the tails of a fox spirit. The warm yellow light was replaced by blue moonlight filtering in through the silk-screen walls. He blinked, feeling like he’d been plunged underwater, everything slow and dark and still.</p>\n<p> </p>\n<p>He reached out to take Lan Zhan’s wrist.</p>\n<p> </p>\n<p>“Lan Zhan,” he whispered. “Can I tell you something?”</p>\n<p> </p>\n<p>Lan Zhan nodded. In the blue dark, his eyes were unwavering on Wei Wuxian’s face. Everything about him was unwavering.</p>\n<p> </p>\n<p>“When I first woke up in that room,” said Wei Wuxian, “surrounded by talismans and blood, and I saw the curse marks on my arm and realized what Mo Xuanyu had done to summon me....” He huffed, shaking his head. “I thought, ‘Aiyo, that bastard. I wish he’d just left me alone. I wish I was still dead.’”</p>\n<p> </p>\n<p>Lan Zhan was silent.</p>\n<p> </p>\n<p>“What a terrible thing to say to you, of all people,” Wei Wuxian said. “What a cruel thing. But it’s true. I hadn’t seen you yet. I didn’t know you were mourning me, I really didn’t think anyone would mourn me, Lan Zhan. It’s not sad, it’s just how it is. Who would mourn the Yiling Laozu? He died and the world rejoiced.”</p>\n<p> </p>\n<p>“I didn’t mourn the Yiling Laozu,” Lan Zhan said, quiet but fierce. “I mourned Wei Ying of Yunmeng.”</p>\n<p> </p>\n<p>Wei Wuxian nodded. “I know, I know. But when I first woke up.... It’s true that I don’t remember any of those thirteen years. But Lan Zhan, I think maybe I was somewhere peaceful, just sleeping. I never told you this, but in the last few months leading up to—you know—I pretty much stopped sleeping. I felt like I was going crazy. I guess I kind of was. Anyway, I’d finally gotten a chance to sleep, and then Mo Xuanyu had the nerve to wake me up! Ah, I was so annoyed. I didn’t want to be in this world again.” He made a face. “I’m always cold here. Not ‘here’ as in the Cloud Recesses, but everywhere. The world aches.”</p>\n<p> </p>\n<p>“Wei Ying,” Lan Zhan whispered. “Wei Ying.”</p>\n<p> </p>\n<p>“No, it’s okay,” Wei Wuxian said, brushing a thumb over the inside of Lan Zhan’s wrist. “Lan Zhan. I’m saying it’s different now, I don’t feel like that anymore. I want to be here. I want to be alive. Maybe I don’t deserve this second chance, but I want it.”</p>\n<p> </p>\n<p>Lan Zhan took Wei Wuxian’s hand in both of his own and squeezed. “Be here,” he rasped. “Be alive, Wei Ying.”</p>\n<p> </p>\n<p>“Yeah.” Wei Wuxian tipped forward till his forehead hit Lan Zhan’s shoulder. “Yeah, sweetheart. That sounds good.”</p>\n<p> </p>\n<p align=\"center\">✵</p>\n<p> </p>\n<p>Sometime in the black hours before dawn, Wei Wuxian woke feeling warmer than he had in a long time.</p>\n<p> </p>\n<p>His spine was up against the side of the bed frame. There was another body in his bed on the side between him and the room. Wei Wuxian might have panicked, except everything smelled like sandalwood. The blankets, his pillow, the body.</p>\n<p> </p>\n<p>“Lan Zhan,” he whispered, and scooted closer, wrapping an arm around Lan Zhan’s waist. Lan Zhan was sleeping on his back like a proper Lan, hands folded over his stomach. At some point he’d removed his hair ornament and his forehead ribbon. He was still wearing his regular robes, not his sleep clothes. That was Wei Wuxian’s fault; he vaguely remembered wrapping himself around Lan Zhan and refusing to let him leave the bed even for an instant. And Lan Zhan, strangely indulgent of Wei Wuxian’s nonsense, had not.</p>\n<p> </p>\n<p>Half asleep and all love, Wei Wuxian pressed his mouth to Lan Zhan’s shoulder. He lingered, thinking about how nice it would be to have this every night, Lan Zhan in his bed, within arm’s reach. Even if Wei Wuxian woke up in the middle of the night as he so often did, gasping, brain on fire, he’d be opening his eyes to Lan Zhan. </p>\n<p> </p>\n<p>That would be worth it.</p>\n<p> </p>\n<p>He kissed Lan Zhan’s shoulder one more time and settled in to sleep. This time, he didn't dream.</p>\n<p> </p>\n<p align=\"center\">✵</p>\n<p> </p>\n<p>\n<em> Lan Zhan, </em>\n</p>\n<p>\n<em>   </em>\n</p>\n<p>\n<em> I’m a little drunk and a lot lonely, so here goes. </em>\n</p>\n<p> </p>\n<p align=\"center\">✵</p>\n<p> </p>\n<p>“Wei Ying.”</p>\n<p> </p>\n<p>He was underwater.</p>\n<p> </p>\n<p>“Wei Ying.”</p>\n<p> </p>\n<p>Deep at the bottom of a lake. Was it the Aqua Demon? Had it caught him after all, dragged him down, down, down into the icy black depths of Biling Lake? Had everything since then been a dream? A nightmare?</p>\n<p> </p>\n<p>\n<em> “Wei Ying.” </em>\n</p>\n<p> </p>\n<p>Light pierced the water. Wei Wuxian opened his eyes.</p>\n<p> </p>\n<p>He was... not at the bottom of a lake. He squinted at his surroundings, mind all honey-drip slow from sleep. It wasn’t afternoon yet. Midmorning, maybe? Silk-screen windows grayish with overcast sunlight. This was—the Library Pavilion. Right. Right, he’d woken to an empty bed this morning, skull panging with a rare hangover. Lan Zhan had already left for some meeting or another, but he’d let Wei Wuxian a tray of breakfast. Wei Wuxian had eaten alone and then wandered over here to search for research material on ancient talismans. </p>\n<p> </p>\n<p>He was sitting in the central chamber of the library, where a lifetime ago he’d spent hours and hours copying the Lan Sect Principles and trying not to look at the Second Jade of Lan more than fifty times per hour. The walls were lined with shelves and hanging scrolls, and Wei Wuxian was bent over one of the low desks, a pile of books at his elbow. <em> Collection of Tranquility. Collection for the Symmetry and Balance of the Senses. Collection of the Dreaming Mind. </em> He’d apparently been using <em> Collection for the Taming of Beasts </em> as a pillow. Lan Zhan was leaning over him, one hand hovering near Wei Wuxian’s shoulder as if in preparation to nudge him awake.</p>\n<p> </p>\n<p>Wei Wuxian sat upright, wincing. “Did I fall asleep?”</p>\n<p> </p>\n<p>“En.”</p>\n<p> </p>\n<p>He pouted. “Why’d you wake me up?”</p>\n<p> </p>\n<p>“You looked uncomfortable,” said Lan Zhan. He was glorious in the pale light. Luminous, like his soul was glowing through his skin.</p>\n<p> </p>\n<p>“Carry me back to the Jingshi and put me to bed, then.”</p>\n<p> </p>\n<p>Lan Zhan gave him an unimpressed look. Then, “You were... saying things.”</p>\n<p> </p>\n<p>Ah. “Yeah, I do that sometimes,” Wei Wuxian said carefully. “It’s okay, though. Most of the time I don’t remember whatever I dreamed about.”</p>\n<p> </p>\n<p>Lan Zhan’s hand was still right there, and Wei Wuxian was still sleepy and soft, so he grabbed it and put it on top of his own head, guiding Lan Zhan’s fingers into his loose, sun-warmed hair. He let his eyes flutter shut again, pressing up into the touch.</p>\n<p> </p>\n<p>“Feels good,” he mumbled. “Feels good, Lan Zhan ah.”</p>\n<p> </p>\n<p>He let go of Lan Zhan’s wrist, but Lan Zhan didn’t stop petting him. He carded his fingers through Wei Wuxian’s hair, careful not to tug at any of the little tangles. Wei Wuxian wanted Lan Zhan to do this all the time. He wanted to do this in bed, he wanted to curl up in bed with Lan Zhan and have his hair petted, he wanted to push his own hands into Lan Zhan’s hair and pull him close and kiss his forehead and his cheekbones and his pretty mouth. He wanted to sleep with him again and not wake up alone. Or—not care about waking up alone, because they slept together every night and not just when Wei Wuxian was drunk and clingy. </p>\n<p> </p>\n<p>“What are you working on?” Lan Zhan asked.</p>\n<p> </p>\n<p>“Oh, a lot of things,” Wei Wuxian said, glancing over his messy notes. “At first I was looking for general information about ancient talisman work, like the invention and development of the very first talismans. I was expecting it to be similar to what we use today, you know, some type of writing surface and cinnabar, or blood if you’re a terrifying demon man.”</p>\n<p> </p>\n<p>“Not a demon,” said Lan Zhan, just like Wei Wuxian knew he would.</p>\n<p> </p>\n<p>“Terrifying, though?”</p>\n<p> </p>\n<p>Lan Zhan made a considering face. “To others. When you want to be.”</p>\n<p> </p>\n<p>“Glad to know I’ve still got it,” said Wei Wuxian. Lan Zhan’s hand had paused in his hair, so Wei Wuxian butted up into it like a cat, and Lan Zhan started petting him again. “Anyway, I expected the use of talismans to correspond with record-keeping, like how before people wrote on paper and wood they wrote on silk or animal skin or strips of bamboo. But I found this passage in—you’ll like this, it’s not even a history book, it’s a book of love poetry from the venerated Gao Li to his cultivation partner—here, in <em> Thoughts on Parting with an Old Friend at Yangzhou, </em>listen to this: ‘By the bamboo thicket in a silver pool left by a summer storm, here I watch my beloved open and with phoenix-pinfeathers color the water… blah blah… Red carp turns to watery flame. When the white moon rises over the mountains of Chu, with Xuewu and a shiver of light we leave Danyang behind.’” Wei Wuxian drummed his fingers on the desk, excited all over again. “It’s blood, the whole ‘phoenix pinfeathers’ thing. Gao Li’s cultivation partner was spilling her own blood into this pool of water, but not like a regular blood spell, right? Because then she drops her dagger Xuewu into the water and somehow that becomes the talisman—a portal talisman, they used it to leave the city of Danyang, there’s a whole verse about it later on. I’m trying to figure it out. How do you get any sort of accuracy if you’re just dropping a blank talisman into a pool of bloody water? I’m assuming she spelled the blood first and the water acted as some sort of activation mechanism, but….” He squinted down at his notes. “Obviously there’s the yin energy of the standing water and the yang of the metal blade, but that’s not inherently powerful enough to transport two people, and it’s not like she’s writing spells on the blade itself….” </p>\n<p> </p>\n<p>“Have you finished the book of poetry?” Lan Zhan asked.</p>\n<p> </p>\n<p>“No,” Wei Wuxian sighed. “The next hundred verses are just Gao Li talking about how great it is to make love on a blanket of peach petals and at the top of a mountain and on the banks of the Huai River and so on and so forth. I got bored.”</p>\n<p> </p>\n<p>“That would be a first.”</p>\n<p> </p>\n<p>“What, me not liking porn? It’s not porn, Lan Zhan, it’s only sexy for poetry nerds like you,\" said Wei Wuxian, waving a hand. Then, \"Wait. <em>Wait</em>, don’t tell me you read stuff like this as a teenager?” Lan Zhan was silent, and Wei Wuxian cackled with laughter. “Lan Wangji, you harlot, no wonder you spent so much time in the library! And here I was thinking you’d never had an impure thought in your life!”</p>\n<p> </p>\n<p>“That was certainly an assumption,” said Lan Zhan.</p>\n<p> </p>\n<p>Wei Wuxian’s laughter cut off. He blinked, a sudden flush rising under his collar. “Well, I… I guess so,” he said, and quickly went back to his notes. As it turned out, the concept of ‘Lan Zhan with impure thoughts’ was something he needed to <em> not </em> think about while Lan Zhan had a hand in his hair.</p>\n<p> </p>\n<p>Lan Zhan stayed there and petted him for a little while longer, yellow sunlight sliding across the floor. Then he had to go meet with the visiting leader of a minor clan to the south, but before he left he said, “I’ll see you tonight for dinner.” Wei Wuxian thought that was one of his most favorite things he’d ever heard.</p>\n<p> </p>\n<p align=\"center\">✵</p>\n<p> </p>\n<p>\n<em> Lan Zhan, </em>\n</p>\n<p>\n<em>   </em>\n</p>\n<p>\n<em> I’d love to say I’ve never forgotten anything about you, any moment with you, but we both know that would be a lie. I’ve always had a bad memory. Dying made it worse. Do you know what fucks with me the most, Lan Zhan? I’ll never have a new memory of shijie. How is it that someone I loved infinitely can become finite just like that? It’s been thirteen years for Jiang Cheng and Jin Ling, of course not to say that it ever gets less painful, but they’ve had thirteen years of living without her and to me she was just here. She was just here, where did she go? </em>\n</p>\n<p>\n<em>   </em>\n</p>\n<p>\n<em> I didn’t attend my sister’s wedding or her funeral. </em>\n</p>\n<p>\n<em>   </em>\n</p>\n<p>\n<em> Lan Zhan, I don’t want to forget anything about you ever again. I won’t. I told you once to let me go; I take it back. Keep me around for a long time, okay? I’m writing this on the road to Gusu and whenever I think about seeing you again I can’t breathe, I really can’t. This big ocean tide swells inside me and I can’t breathe around it, I’m honestly a little worried about my ribs cracking. Ahh! Lan Zhan! Lan Zhan, I like writing your name, have you noticed it’s always so pretty in the letters I send you even when the rest of my handwriting is a mess? To become a great calligrapher you have to wholly understand and evoke and give yourself over to the ‘spirit’ of each character; that’s when writing becomes art. When you know something past the bones to the soul and love it with every movement, every breath, and you can let go and let it guide you and know that what you make will be beautiful. Lan Zhan, my handwriting is absolute shit unless I’m writing your name—then I’m the greatest calligrapher of all. </em>\n</p>\n<p>\n<em>   </em>\n</p>\n<p>\n<em> I can’t breathe again! Fingers crossed I make it to Gusu! </em>\n</p>\n<p>\n<em>   </em>\n</p>\n<p>\n<em> This won’t happen, but I wish you would kiss me when you see me. I’d definitely perish on the spot, but... what a way to go. Much better than the first time. (I wouldn’t make that joke in front of you. I know you’d hate it, you soft heart.) </em>\n</p>\n<p>\n<em>   </em>\n</p>\n<p>\n<em> You’re not going to kiss me, I don’t even know if you want to. But I wish you would. I hope you do. </em>\n</p>\n<p>\n<em>   </em>\n</p>\n<p align=\"center\">✵</p>\n<p> </p>\n<p>Wei Wuxian left the Library Pavilion at sunset, stretching his stiff, aching limbs and heading for the Jingshi. A servant brought dinner at exactly six o’clock, right when he was starting to get hungry. It was funny how quickly he’d adjusted to the Cloud Recesses schedule, all his internal patterns and rhythms shifting around for this new way of life. </p>\n<p> </p>\n<p>He took off his outer robes and hung them up in the wardrobe beside Lan Zhan’s. Then he sat down at the table and spread out an array of blank talismans, writing with water while he waited for Lan Zhan to get out of his dumb meeting, the Fu characters evaporating almost as quickly as he drew them. </p>\n<p> </p>\n<p>Finally, he heard the telltale crunch of shoes on white shells, then shoes crossing the porch. Wei Wuxian grinned to himself, heart skittering like a drop of oil in a hot wok. A moment later the door to the Jingshi slid open to reveal a tall, beloved figure, shadowy white against the purple dusk outside. </p>\n<p> </p>\n<p>“Lan Zhan!” Wei Wuxian said brightly. “You’re home!”</p>\n<p> </p>\n<p>Lan Zhan paused in the threshold.</p>\n<p> </p>\n<p>“There’s dinner,” Wei Wuxian continued, pushing aside his talismans to clear a space on the table. “Ah, ignore the mess, I had this <em> other </em> idea about using bloodwork to manipulate existing energy from the natural world, like pulling from rivers or springs or other places with perpetual motion, or even an entire forest or mountain, so you could access spiritual power even if your own core energy had been depleted. I’m just trying to figure out how to do it without harming the source. Or using too much blood. It’s definitely possible! It’s just a matter of finding the right exchange—anyway. Come sit, come eat.” He set about spooning millet into one bowl and boiled gai lan into another. Unlike Wei Wuxian, who liked to mash everything up in one bowl, Lan Zhan preferred to keep each dish separate.  </p>\n<p> </p>\n<p>He heard Lan Zhan moving around the Jingshi, putting Bichen on the sword-stand, removing his fancy hairpiece, hanging up his outermost robe. By the time he joined Wei Wuxian at the table, he was no longer His Excellency; he was Wei Wuxian’s Lan Zhan.</p>\n<p> </p>\n<p>“I’m glad you’re home in time for dinner. I missed you today,” Wei Wuxian continued, pouring two cups of water. “Tomorrow you should tell all the sect leaders to shove it and hang out with me instead. When was the last time we visited your bunnies?”</p>\n<p> </p>\n<p>No response.</p>\n<p> </p>\n<p>Wei Wuxian put down the teapot and glanced up. Lan Zhan’s eyes were lowered. His expression was... it took Wei Wuxian a few moments to parse it, because it wasn’t one he’d seen very often, plus Lan Zhan was hiding it on purpose. But therein lay the answer: usually Lan Zhan’s face was blank because he wasn’t a physically expressive person; right now it was blank because he felt vulnerable, flung-open, and was trying to regain some semblance of control. So that sparked a second question: why did he feel vulnerable?</p>\n<p> </p>\n<p>Or—shy? Both?</p>\n<p> </p>\n<p>“Okay, I know you can’t <em> actually </em> tell the sect leaders to shove it,” Wei Wuxian said, deciding the best course of action was to give Lan Zhan the space to collect himself. “But I still think it’s time for Zewu-jun to come out of seclusion and take up the mantle. I’m tired of sharing you with every bottom-feeder in the cultivation world.” He dumped chili oil over his gai lan. “Yao-zongzhu and Ouyang-zongzhu in particular do not deserve to look at your pretty face all day.”</p>\n<p> </p>\n<p>“Wei Ying,” Lan Zhan said quietly.</p>\n<p> </p>\n<p>“Ah?”</p>\n<p> </p>\n<p>He gave Wei Wuxian a small, soft smile. “Thank you for dinner. I am glad to be home.”</p>\n<p> </p>\n<p>“Ai,” said Wei Wuxian, flustered by the one-two punch of devastating smile and dreadful Lan sincerity. “Don’t thank me, I didn’t cook it! What’re you trying to give me a heart attack for, ah? Thanking me out of the blue like that? No, absolutely not. Be quiet and eat your vegetables, you terrible, terrible man. Silence during meals.”</p>\n<p> </p>\n<p>“Hm,” said Lan Zhan. The shyness was replaced by amusement.</p>\n<p> </p>\n<p>“Hm!” said Wei Wuxian, and made a crinkly-nosed face at him, then busied himself with his own dinner. He lasted a very impressive two minutes before launching into a more detailed explanation of the talismans he’d been tinkering with all day, because 95% of the time all it took to solve a problem was relaying it to Lan Zhan. By the time they’d finished eating and had moved into the tea-and-Emperor’s-Smile portion of the evening, he’d come up with at least three new ideas to experiment with come morning.</p>\n<p> </p>\n<p>After <em> that, </em> Lan Zhan practiced the guqin and Wei Wuxian harmonized with him, the two of them transitioning seamlessly from one song to the next. Wei Wuxian loved the music they made together, Chenqing’s high, leaping notes layered over the low, steady vibrations of the guqin. He loved how Lan Zhan’s gaze flickered up to meet his every couple minutes. Wei Wuxian always smiled around the next note, and Lan Zhan always smiled back, even if it was just with his eyes.  </p>\n<p> </p>\n<p>It was such a good evening. This was such a good life.</p>\n<p> </p>\n<p>Wei Wuxian didn’t have the best track record with ‘good,’ but that was his past lifetime. In this one, he was hoping bright things stayed.</p>\n<p> </p>\n<p align=\"center\">✵</p>\n<p> </p>\n<p>That night Wei Wuxian woke to darkness, and for once he didn’t know why. It was unsettling enough that he got out of bed and padded silently over to the doorway of the second room where Lan Zhan slept, partly to make sure he was okay and partly because watching Lan Zhan breathe always calmed him down. </p>\n<p> </p>\n<p>Then he heard a sharp intake of breath and realized what had woken him.</p>\n<p> </p>\n<p>Wei Wuxian was at Lan Zhan’s bedside in an instant. “Lan Zhan,” he said, shaking Lan Zhan’s shoulder. “Lan Zhan. Lan Wangji. Wake up.”</p>\n<p> </p>\n<p>He knew Lan Zhan was awake when his body went stiff all over, a statue wrapped in blankets. </p>\n<p> </p>\n<p>Neither of them moved for a long time, just breathing. Then Lan Zhan opened his eyes. “...Wei Ying?”</p>\n<p> </p>\n<p>“Lan Zhan. I’m here.”</p>\n<p> </p>\n<p>Lan Zhan reached for him. His hand slid up Wei Wuxian’s arm to his shoulder, pulling him down and in, tactile and graceless like he never was in daylight. Wei Wuxian ended up with his cheek pressed to Lan Zhan’s chest, right over his war-drum heart.</p>\n<p> </p>\n<p>No, not war-drum; not zhangu. Yaogu, a dancing drum. Nothing about Lan Zhan was war. Everything about him was music.</p>\n<p> </p>\n<p>It was a little awkward: Lan Zhan on his back, Wei Wuxian bent over him, still half-sitting, one hand braced on the mattress by Lan Zhan’s hip. This would be easier if he just got up on the bed. If he tucked himself into Lan Zhan’s warm side, curled around him like a fox, made one shape of their two bodies. There were usually reasons not to do that, but he couldn’t think of anything more important than Lan Zhan being scared and sad, so Wei Wuxian just went for it. He clambered up onto the bed and inserted himself in the narrow space between Lan Zhan and the window, wriggling under the blankets and throwing an arm around Lan Zhan's waist.</p>\n<p> </p>\n<p>Lan Zhan ran a shaking hand through Wei Wuxian’s hair.</p>\n<p> </p>\n<p>“It’s okay,” Wei Wuxian whispered, nudging into the touch. He cuddled even closer, resting his cheek on Lan Zhan’s shoulder. “You’re okay, you’re alright.” Lan Zhan was silent. Wei Wuxian tried to remember the things shijie had whispered to him when they were children and Wei Wuxian had woken up screaming on a regular basis. “It was just a nightmare. Whatever you saw, it’s not real.”</p>\n<p> </p>\n<p>“It was,” said Lan Zhan in a hollowed-out voice.</p>\n<p> </p>\n<p>Maybe he’d dreamt of the Cloud Recesses burning. “Well, it’s over now,” Wei Wuxian murmured, reaching up to trail his fingers down the side of Lan Zhan’s face. “It happened and you survived it and it’s over now, and you’re here with me and everything’s alright.”</p>\n<p> </p>\n<p>Lan Zhan turned his head to look at Wei Wuxian. Their faces were suddenly very close together, noses almost brushing. Wei Wuxian wanted to kiss him. If they’d been—if they’d been something else, this was where he’d kiss Lan Zhan. This was where he’d find Lan Zhan’s mouth in the darkness and kiss him, warm and lingering; this was where he’d slide a hand into Lan Zhan’s hair and put love in all the places the fear was. They were so close. He could feel Lan Zhan’s quiet exhales on his lips.</p>\n<p> </p>\n<p>“What’re you scared of, ah?” he whispered. “Tell me so I can beat it up.”</p>\n<p> </p>\n<p>That got him a slightly less quiet exhale. So practically a laugh.</p>\n<p> </p>\n<p>“I’m not kidding! I’m the Yiling Laozu. Demons quiver at my feet. When I cross a river, it runs red. One time I slaughtered a whole village just to suck the marrow out of everyone’s bones.”</p>\n<p> </p>\n<p>“Hm,” said Lan Zhan.</p>\n<p> </p>\n<p>“I eat babies, possibly? Conflicting accounts on that one. Definitely no consensus as to whether I eat them raw or turn them into a nice stew. What else.... I’ve bedded both the Xiangliu and the Yeren. Don’t ask me about the physical logistics of that, I really couldn’t tell you. I have caused four separate droughts and either one or three famines depending on who you ask. I roam the countryside wreaking havoc just for fun.”</p>\n<p> </p>\n<p>“That one is true.”</p>\n<p> </p>\n<p>“Ah Lan Zhan,” Wei Wuxian whined. “It’s not true at all, I was very well-behaved those ten months.”</p>\n<p> </p>\n<p>“Wei Ying does not behave.”</p>\n<p> </p>\n<p>Wei Wuxian pouted at him in the dark. “Well, that’s why you like me.”</p>\n<p> </p>\n<p>“Hmmm.”</p>\n<p> </p>\n<p>“You do. I know you do.”</p>\n<p> </p>\n<p>“I do,” Lan Zhan whispered, and it dropped into Wei Wuxian’s belly like a coin into a deep pool, winking gold all the way down. He barely managed not to shiver. “I like Wei Ying.”</p>\n<p> </p>\n<p>“I like you too,” he said. It was too much, saying that kind of thing with Lan Zhan’s steady, dark gaze on him, so he squirmed around until Lan Zhan’s arm was around him and his face was hidden in the crook of Lan Zhan’s neck. He sighed into Lan Zhan’s hair, feeling more comfortable than he had in—he didn’t know how long. When was the last time he’d fully relaxed like this, with even the most paranoid, animal parts of his brain settling down, hackles dropped? Definitely before he’d died. Before defecting. Before the Burial Mounds. Before the fall of Lotus Pier, before pulling a dark sword from a fake Xuanwu’s shell, before leaving for Qishan, before getting kicked out of the Cloud Recesses. Was it at the Cloud Recesses? Before? He laid a hand on Lan Zhan’s chest, fingers curled loosely over his heart. “Lan Zhan,” he said after a moment. “Your heartbeat’s going so fast.”</p>\n<p> </p>\n<p>Lan Zhan was silent above him.</p>\n<p> </p>\n<p>Wei Wuxian pressed even closer. “Poor Lan Zhan. No more nightmares, okay? Does this help?” A thought occurred and he snorted a little, laughing soundlessly into Lan Zhan’s neck. “Should I just sleep with you every night? Is that what it’ll take?”</p>\n<p> </p>\n<p>“Don’t joke.”</p>\n<p> </p>\n<p>“I’m not,” said Wei Wuxian, realizing as he said it that he wasn’t. He stopped laughing. “I’m not. I wasn’t.”</p>\n<p> </p>\n<p>“You...,” Lan Zhan trailed off. “That is not necessary.”</p>\n<p> </p>\n<p>“That’s not what I was asking.”</p>\n<p> </p>\n<p>A long pause. Wei Wuxian felt his own heartbeat trip and quicken. He was about two seconds from pretending like he’d been joking after all when Lan Zhan said, “Yes.”</p>\n<p> </p>\n<p>“Ah?”</p>\n<p> </p>\n<p>His fingers twitched on Wei Wuxian’s hip. “Yes,” he said again, and there was an odd note in his voice; melancholy, or resigned. “If Wei Ying wants.”</p>\n<p> </p>\n<p>“Wei Ying wants,” Wei Wuxian said softly. “Does Lan Zhan want?”</p>\n<p> </p>\n<p>That got him an even longer pause. Wei Wuxian lay there, face hidden, breathing in the woodsmoke scent of Lan Zhan’s hair and the soap-smell of his skin, and thought about kissing him, kissing him and being kissed by him. Thought about Lan Zhan rolling over and climbing on top of him, his hair a black curtain around their faces, his weight so warm and perfect, pressing Wei Wuxian into the mattress, holding him down. </p>\n<p> </p>\n<p>“Yes,” Lan Zhan whispered.</p>\n<p> </p>\n<p>“Then I will,” Wei Wuxian said immediately, lips brushing Lan Zhan’s neck as he spoke. “I will, I’ll sleep here every night. Do you understand? If Lan Zhan wants me to, I will. If Lan Zhan wants me in his bed, that’s where I am. If Lan Zhan wants me gone, then I’m gone.”</p>\n<p> </p>\n<p>“Never,” Lan Zhan said, and turned over, though he didn’t climb on top of Wei Wuxian, just faced him in the dark. He wrapped his other arm around Wei Wuxian and gathered him to his chest, his lips at Wei Wuxian’s hairline. “No, never. Never gone. Always here.”</p>\n<p> </p>\n<p>Wei Wuxian squeezed his eyes shut. He had never been held like this. He had never been held like this. “Then I’m always here, my Lan Zhan,” he said. “Always.”</p>\n<p> </p>\n<p>Lan Zhan didn’t say anything. He just nodded and pulled Wei Wuxian even closer, heart beating like water on rock.</p>\n<p> </p>\n<p align=\"center\">✵</p>\n<p> </p>\n<p>\n<em> Lan Zhan, </em>\n</p>\n<p>\n<em>   </em>\n</p>\n<p>\n<em> I’m a little drunk and a lot lonely, so here goes. </em>\n</p>\n<p> </p>\n<p>\n<em> It’s really good that you’ll never read this because I know it would make you sad, but I knew I was going to die for a long time before it actually happened. I’m not dumb, Lan Zhan, I knew I couldn’t just fuck off to the Burial Mounds and live there forever in peace; not with the Wens as hunted as they were or me as dangerous as I was. I was just prolonging the inevitable, buying us one day at a time. And here’s the strange part: so many of those days were good. Objectively it was the worst time in my life; I was going crazy, I could feel the darkness eating away at me like flames devouring paper, the edges of my soul turning black as soot and curling. I missed shijie and you and even Jiang Cheng and a lot of other things, and in the beginning we were all starving and we hadn't figured out that we could go into Yiling for supplies; we thought the moment we stepped foot outside the wards we’d be dead, and there weren’t any animals yet; those came later. One day Madam Wen told me to call her wai po and the next day she said if it came down to it and we were really gonna starve, I should take A-Yuan and run. She said Wen Qing wouldn’t leave Wen Ning and the rest of them would face their fate together, but A-Yuan had to live, and his best chance at survival was with me. And I said okay but later that night I was thinking about it and I thought ‘Maybe that’s not true, it’s true I would kill for him but it’s not true I’ll survive.’ And then I thought ‘Okay, how about this. I’ll get him to Gusu. All I have to do is get him to Gusu and send a message to Lan Zhan. That’s his real best chance at survival.’ And I imagined him in a little set of white robes with a white ribbon on his head and I think that was the last time I ever felt at peace. </em>\n</p>\n<p>\n<em>   </em>\n</p>\n<p>\n<em> Anyway I knew I was dead meat. I didn’t think about it much because there was always stuff to do, and of course it’s no use thinking about things like that and getting all maudlin, not when there’s so many turnips to pick! Do you know Lan Zhan, when Jiang Cheng came to visit that one time he saw everyone picking the turnips and potatoes and so on, and he said ‘How can you eat food grown in this soil? Isn’t it poisonous?’ and the funny thing is that it wasn’t. It wasn’t poisonous. It was just turnips. </em>\n</p>\n<p>\n<em>   </em>\n</p>\n<p>\n<em> So objectively it was the worst time in my life, and I’ll admit at the beginning I was bitter about everything I wasn’t gonna become. I don’t regret anything with the Wens except for how it ended; it’s just I always had my life planned out. I would be second in command to Jiang Cheng just like my father was to Jiang Fengmian. I was going to live out my days in Yunmeng, in Lotus Pier, and I’d spend my free time night hunting and inventing things and visiting shijie in Lanling and maybe one day taking on students, I know your uncle would spit blood if he ever heard me say that but I did want to be a teacher. And that would be my life and it would be familiar and sunlit and good. I know a lot of people think I’m very arrogant and it’s true that I can be, but I never cared about being ‘A Great or Notorious Something,’ I just wanted to be a Wei Wuxian whose name speaks for itself. Well anyway, then Jiang Cheng lost his core, so that was that. </em>\n</p>\n<p>\n<em>   </em>\n</p>\n<p>\n<em> In the first days of the Burial Mounds I did have some thoughts like ‘I can never return, this is it, this is my life now,’ but you know me Lan Zhan, once I’ve made a decision I’ve made it, and I won’t go back on my word, and besides Wen Ning needed help and the idea of slinking back to Jinlintai and kowtowing to Jin Guangshan made me sick. Ah.... All this to say that in the beginning I didn’t think it would be good; it was simply the most bearable choice. </em>\n</p>\n<p>\n<em>   </em>\n</p>\n<p>\n<em> But Lan Zhan, it was good. </em>\n</p>\n<p>\n<em>   </em>\n</p>\n<p>\n<em> Not all the time. Of course there were terrible days, especially toward the end. But there were so many good days. I wish you could have seen it. We had a lotus pond. They were my family. When we first got to that place it was silent all the time, dead air, flat sky, no wind in the dead trees; only ghosts could dwell there. Maybe that’s why it let us stay. Maybe it could tell we were on the verge of belonging, just give it a few months. So it was silent, but on the morning of the sixtieth day I woke up crying. Uncle Four came barrelling into my Demon-Subdue Palace and he was crying too, and I realized: that odd noise outside was a nightingale. There were so many songbirds, Lan Zhan. And cicadas, and little animals scuttling around in the dead leaves, and one time a fawn walked right up to our fire during dinner! I don’t know where it came from but I guess it hadn’t seen humans before; it wasn’t scared at all. And we didn’t eat it even though we were low on food that night, because how funny is that! It just walked right up like it was angling for a meal! Ah, we laughed all night. We grew turnips and lotuses. They were my family. Living there, I began to dream about this and that. I dreamed about having a farm, like a real farm in a valley between two faraway mountains, with pigs and chickens and a fat little donkey. I dreamed about waking up at the crack of dawn (ha!) and working in the fields all day and coming home hungry and eating a hot meal, then reading a bit, then going to bed. I thought about the stuffy sect leaders who look down on non-cultivators, who laugh at the cosmic insignificance of the common people, how they live and die so quietly without doing anything worth recording in the annals of history. I thought about how the unknown farmer who grew the rice in Jin Guangshan’s bowl had already contributed more to this world than Jin Guangshan ever could. </em>\n</p>\n<p>\n<em>   </em>\n</p>\n<p>\n<em> I thought ‘I’m not going to make it out of this, but if I did, that would be a good life.’ </em>\n</p>\n<p>\n<em>   </em>\n</p>\n<p>\n<em> Sometimes you were there, in my dreams. Most of the time you weren’t. You see, at the very end all I wanted was to be left alone and forgotten, and I couldn’t do that to you. Not to you, Lan Zhan. You were the only one of those fuckers worth remembering. </em>\n</p>\n<p>\n<em>   </em>\n</p>\n<p align=\"center\">✵</p>\n<p> </p>\n<p>The next week passed quietly. At first Wei Wuxian slept in Lan Zhan’s bed, but then he insisted on both of them switching back to the bed in the main room, so he could still have the pleasure of waking to see Lan Zhan working at the table. On the first night, they started off on their separate sides of the bed and lasted almost until dawn before curling into each other, fingers intertwined on Lan Zhan’s stomach. On the second night, they started off with their arms touching. By the fifth night, Lan Zhan went to bed at nine with Wei Wuxian cuddled right up to his side, though of course Wei Wuxian planned on staying awake for a few more hours because he had reading to do and he wasn’t one hundred years old or a Lan. The sixth and seventh nights were the same.       </p>\n<p> </p>\n<p>On the afternoon of the eighth day, Wei Wuxian returned from his daily walk to find Lan Zhan and Sizhui standing on the porch of the Jingshi.</p>\n<p> </p>\n<p>“Hey sweetheart, hey kiddo,” said Wei Wuxian, hopping up onto the porch and immediately reaching for Lan Zhan’s hand, lacing their fingers together. “What’s up?”</p>\n<p> </p>\n<p>Sizhui’s eyes sparkled as he glanced between Wei Wuxian and Lan Zhan, but he didn’t say anything, bless his precious little heart. Wei Wuxian hadn’t known he was going to call Lan Zhan ‘sweetheart’ before it came out of his mouth, and now he was trying very hard not to freak out and/or check Lan Zhan’s reaction. “Hello, Wei-qianbei,” said Sizhui. “We received a message this morning from the village of Guoyang to the south. They’ve been dealing with a vengeful ghost for a while now, and recently the attacks have grown more frequent.”</p>\n<p> </p>\n<p>“Oh?” said Wei Wuxian. “How so?”</p>\n<p> </p>\n<p>“It is the ghost of a woman who drowned last spring,” said Lan Zhan. His voice sounded normal, so Wei Wuxian dared to take a quick peek at him. His expression was placid. His ears were bright red. “She keeps attempting to lure village children into the river where she drowned.”</p>\n<p> </p>\n<p>“She hasn’t succeeded yet,” said Sizhui. “Or—she has, but the children were always rescued. There haven’t been any deaths. But up until a month ago she’d only attacked five children total, and now there have been eleven attacks in the past two weeks alone.”</p>\n<p> </p>\n<p>“Still no deaths?”</p>\n<p> </p>\n<p>“No. Just a lot of near-drownings.”</p>\n<p> </p>\n<p>“So the attacks have grown more frequent, but not more severe.” Wei Wuxian leaned into Lan Zhan’s side. “Hmmm. Question. Why do these kids keep playing near the haunted death river?”</p>\n<p> </p>\n<p>“They don’t,” said Lan Zhan. “The ghost cannot leave the river, but somehow she is able to control the children from over a mile away.”</p>\n<p> </p>\n<p>“Now <em> that</em>,” said Wei Wuxian, “is interesting.”</p>\n<p> </p>\n<p>“Hanguang-jun, did you call me here because you want me and the others to take the case?” asked Sizhui.</p>\n<p> </p>\n<p>Lan Zhan shook his head. “I will be taking it,” he said. “Along with Wei Ying.”</p>\n<p> </p>\n<p>“You are?” said Wei Wuxian. “We are?”</p>\n<p> </p>\n<p>“We are.”</p>\n<p> </p>\n<p>Wei Wuxian beamed up at him. “<em>Yeah </em>we are.”</p>\n<p> </p>\n<p>To Sizhui, Lan Zhan said, “I do not anticipate it will take more than three days. If a problem arises, send a butterfly. We will return at once.”</p>\n<p> </p>\n<p>“Yes, Hanguang-jun,” said Sizhui. “Don’t worry, we’ll be fine here! You and Wei-qianbei just focus on—um, the case.”</p>\n<p> </p>\n<p>Wei Wuxian squinted at him. Sizhui smiled innocently back.</p>\n<p> </p>\n<p>“Hm,” said Lan Zhan.</p>\n<p> </p>\n<p>The village of Guoyang was half a day’s journey on foot. They packed qiankun bags with three days’ worth of clothing and set off at once, bidding farewell to Sizhui at the main gates. With Wei Wuxian perched atop Little Apple and Lan Zhan walking alongside, holding onto her bridle, they made their way down the mountain and into the valley, heading due south. As the hours passed, the mountains flattened out into hills like folds of green cloth, patched with yellow where the first frosts of winter had already started killing the grass. Wei Wuxian played Chenqing as they went, any and every song he could think of plus some he invented on the spot. He was serious about composing “Ode to a Lotus Pond High in the Clouds.”</p>\n<p> </p>\n<p>He’d also been experimenting with a melody he currently thought of as “Hands.” That one wasn’t ready to be heard, though.</p>\n<p> </p>\n<p>Guoyang was a small village on the Gusu side of the border between Gusu and Yueling, nestled in the bend of the Yingwu River. It traded mainly in pottery made of river clay; all the shops along the main street had wide-bellied clay pots sitting outside their doors like little sentinels, painted exquisitely with river scenes and lines of poetry. Wei Wuxian and Lan Zhan stopped at the first inn they found. Lan Zhan paid for their room while Wei Wuxian dragged Little Apple out to the stables, hand-feeding her some hay off the floor of her stall. He patted her velvety soft nose, scratched behind her big ears, and told her, “I’ll be back in the morning. Try not to get yourself kicked out before then, you horrible worm.”</p>\n<p> </p>\n<p>With one last ear-skritch, he went back to the inn. </p>\n<p> </p>\n<p>Lan Zhan had gotten them a room on the second floor with a window overlooking the street, which at this hour was dark but for a few lanterns, a black river speckled with golden fish. He was bent over the hearth fire on its low stone platform by the bed when Wei Wuxian entered. Candles were already burning low around the room. </p>\n<p> </p>\n<p>“Should I call for a bath?” Lan Zhan asked, straightening up.</p>\n<p> </p>\n<p>“Nah, I’m too tired,” said Wei Wuxian. He padded over to the wardrobe in his sock feet, unwinding his wrist wraps. “Sorry, I can sleep on the floor if you don’t wanna share a bed with me all grimy.”</p>\n<p> </p>\n<p>Lan Zhan joined him at the wardrobe, stepping right into Wei Wuxian’s personal space. He leaned in and Wei Wuxian thought hysterically <em> ‘he’s going to fucking kiss me’ </em> and then Lan Zhan… sniffed him. “Not grimy,” he decided.</p>\n<p> </p>\n<p>“That is so great,” said Wei Wuxian. Lan Zhan moved away, the picture of calm, and began shaking out the bedsheets to check for mice. Wei Wuxian cleared his throat. “Ah, I can’t help but feel a little bad for Sizhui and Wen Ning, swiping their hunt. Seems like they make a pretty good team.”</p>\n<p> </p>\n<p>“They are both skilled.”</p>\n<p> </p>\n<p>“Especially Sizhui, considering he’s so young. I know you know this, but he’s such a bright kid. He’s wonderful.” He gave Lan Zhan a significant look. “Your son takes after you.”</p>\n<p> </p>\n<p>“Our son,” said Lan Zhan.</p>\n<p> </p>\n<p>“Hm?”</p>\n<p> </p>\n<p>“Our son,” Lan Zhan said, very serious. “Not mine. Ours. Before he came to me, he was Wei Ying’s. He is alive because of Wei Ying.”</p>\n<p> </p>\n<p>“No,” said Wei Wuxian. </p>\n<p> </p>\n<p>“Yes.”</p>\n<p> </p>\n<p>“<em>No</em>,” said Wei Wuxian, abruptly on the verge of tears. <em> Our son. Our son. </em> “No, he’s alive because of you,” he said. “You were the one who found him, you were the one who took him back to the Cloud Recesses and hid him there, you were the one who raised him for <em> thirteen years</em>, I never—I never thanked you for that, I can’t believe you did that, I mean—I can, of course I can, you’re <em> you</em>, but—,” he turned away, pressing a hand over his mouth. “Lan Zhan. I managed not to kill the kid for a year. That’s not....”</p>\n<p> </p>\n<p>“You forget that I visited you.”</p>\n<p> </p>\n<p>“Yeah, I try not to fucking think about it,” said Wei Wuxian. Lan Zhan’s expression went blank, hurt. “<em>No</em>, no, not because of you, just—fuck, Lan Zhan, I was losing my mind. I knew the cultivation world wouldn’t leave me alone. I knew it was just a matter of time. And the look on your face that day. You were horrified.”</p>\n<p> </p>\n<p>“Not horrified,” said Lan Zhan. “Terrified.”</p>\n<p> </p>\n<p>Wei Wuxian frowned. “Okay...?”</p>\n<p> </p>\n<p>Lan Zhan took a step closer. “I failed to communicate this, back then,” he said. “I was not horrified by you. I was terrified for you. Wei Ying, to me... you were never the Yiling Laozu. You were always Wei Ying. You were brilliant and kind. You brought life to the Burial Mounds. Your lotus flowers.”</p>\n<p> </p>\n<p>“How—the lotus pond was after you visited, how did you...?”</p>\n<p> </p>\n<p>“I saw the ruins of it.”</p>\n<p> </p>\n<p>Right. “Okay, but I didn’t do any of that alone, though.”</p>\n<p> </p>\n<p>“Nor did I raise Sizhui alone.”</p>\n<p> </p>\n<p>“Zewu-jun helped?” said Wei Wuxian. “Other people in your sect? Gods, surely not just your uncle, right?”</p>\n<p> </p>\n<p>“My uncle. My brother. You.”</p>\n<p> </p>\n<p>Wei Wuxian stopped breathing.</p>\n<p> </p>\n<p>“I would not have my son grow up as I did,” said Lan Zhan. His body was ringing with tension, all his strings pulled taut. He was clearly struggling with some internal barrier, to talk like this. “Bored. Lonely. Seeing the world only in black and white. I would not have him spend his days in isolation, waiting for someone to—to throw open the door.”</p>\n<p> </p>\n<p>“Lan Zhan....”</p>\n<p> </p>\n<p>“He is your son,” Lan Zhan said again. “Wei Ying. There was no body. You left behind no possessions. That child was—,” he broke off, closing his eyes and taking a deep, steadying breath. When he spoke again, his voice was fractured like Wei Wuxian had never heard it before. “He talked about you. The fever affected his memories, but when he was still small.... He talked about you. He called you ‘Xian-gege.’ He adored you. He was someone else who....”</p>\n<p> </p>\n<p>The last thread of Wei Wuxian’s self-control snapped, just like that. </p>\n<p> </p>\n<p>He crossed the room in two strides, reeled Lan Zhan in by the collar of his robes, and kissed him.</p>\n<p> </p>\n<p>He’d imagined this a thousand times, both before he died and after, but what he never imagined was this: Lan Zhan freezing instantly and melting just as quick, catching Wei Wuxian by the waist, mouth opening on a sharp, stuttering breath; his version of a sob. The kiss was hard and hot and lasted only a few seconds before Wei Wuxian was wrenching away, gasping. His pulse crashed in his ears like whitewater. His lips already felt bruised. He and Lan Zhan were still close enough to share breaths, Wei Wuxian’s hands twisted in the white silk of Lan Zhan’s robes.</p>\n<p> </p>\n<p>They stared at each other, equally stunned. Lan Zhan’s eyes were so wide and dark, flickering across Wei Wuxian’s face. His lips were parted in shock.</p>\n<p> </p>\n<p>“L-Lan Zhan,” said Wei Wuxian.</p>\n<p> </p>\n<p>Lan Zhan’s throat moved when he swallowed.</p>\n<p> </p>\n<p>“Lan Zhan. Again.”</p>\n<p> </p>\n<p>Slowly, as if expecting Wei Wuxian to stop him at any moment, Lan Zhan let go of Wei Wuxian’s hips. He reached up to tuck a tendril of hair behind Wei Wuxian’s ear. His hands were shaking.</p>\n<p> </p>\n<p>“Lan Zhan, kiss me. You want to, right? You look like you want to.”</p>\n<p> </p>\n<p>Lan Zhan gave the tiniest nod.</p>\n<p> </p>\n<p>“So do it,” said Wei Wuxian. “Do it, I want you to do it, I want you to kiss me. Lan Zhan, kiss me.”</p>\n<p> </p>\n<p>Another nod. Lan Zhan took Wei Wuxian’s face in his hands and leaned in. He paused at the last possible moment, their lips almost touching, and took a breath like he was about to slip slowly underwater; not the deep inhale before a plunge but a quiet, measured reassurance. Then he pressed forward.</p>\n<p> </p>\n<p>This kiss, like the first one, was brief. Wei Wuxian had just enough time to think <em> ‘it’s Lan Zhan kissing me’ </em>before it ended, but Lan Zhan swayed in again almost immediately, firmer this time. Wei Wuxian let go of his collar only to wrap his hands around Lan Zhan’s wrists, holding them in place, and he thought about how he’d never done this before, because in his first life he had died unkissed. For some reason that, instead of literally anything else, made his eyes prick with sudden tears. He might have stayed dead. Nie Huaisang and Mo Xuanyu might’ve easily snatched some other soul out of hell or wherever he’d been. Wei Wuxian might have just died, forever, without ever knowing what it felt like to kiss Lan Wangji.</p>\n<p> </p>\n<p>He was abruptly tired of himself. They parted again, a quiet catching sound, and Wei Wuxian whispered, “I like you so much.”</p>\n<p> </p>\n<p>Lan Zhan went still. His nose was still brushing Wei Wuxian’s cheek. His hands were so warm on Wei Wuxian’s face, one thumb stroking the soft skin in front of his ear. People didn’t touch Wei Wuxian like this. Gently, with so much care.</p>\n<p> </p>\n<p>“I like you,” Wei Wuxian said, and kissed him again. They were so close, he barely had to move at all. He kissed Lan Zhan on the mouth and lingered there, letting their lips brush as he spoke. “Lan Zhan is so good, he’s really my favorite. I love sleeping with him. I love doing anything with him. If he allowed it, I’d stay at his side forever, and I’d sleep with him every night and wander around with him every day, and I’d be so happy, because he makes me happy always, my Lan Zhan.”</p>\n<p> </p>\n<p>“Wei Ying,” Lan Zhan choked out. “Wei Ying.” He tangled his fingers in Wei Wuxian’s hair and pressed their foreheads together. His breaths were quick and harsh on Wei Wuxian’s lips. “You are always allowed,” he said. \"I told you. Always.\"</p>\n<p> </p>\n<p>“Oh,” said Wei Wuxian, overcome. “Oh, good.”</p>\n<p> </p>\n<p>“All of that. I want all of that, with Wei Ying. Every day.”</p>\n<p> </p>\n<p><em> Yes, </em> Wei Wuxian thought, <em> oh gods, yes, </em>but... his wild grin faded, reality seeping in. “Lan Zhan,” he said. “To most of the cultivation world, I’m still the Yiling Laozu. It’s more acceptable if we’re simply old friends, but if—”</p>\n<p> </p>\n<p>“Don’t care,” Lan Zhan said firmly. “I do not care what those people think.”</p>\n<p> </p>\n<p>“But you’re the Chief Cultivator.”</p>\n<p> </p>\n<p>“No. Brother will emerge from seclusion soon. He will take over as Chief Cultivator. It has already been decided.”</p>\n<p> </p>\n<p>“What—wait, <em> what</em>?”</p>\n<p> </p>\n<p>“Hate that job,” Lan Zhan said, leaning back a little to meet Wei Wuxian’s eyes. His cheeks were glowing, his ears pink; he’d never been more lovely. “Hate dealing with fools all day. I want to night hunt with Wei Ying.”</p>\n<p> </p>\n<p>“Wei Ying is also a fool,” Wei Wuxian pointed out.</p>\n<p> </p>\n<p>“Mm. Good fool. Not like them.”</p>\n<p> </p>\n<p>Wei Wuxian burst out laughing, then wrapped his arms around Lan Zhan’s neck and drew him into a messy, lopsided kiss that quickly became a messy, very good kiss, Lan Zhan’s mouth opening under his own. They kissed like that for a long time, holding each other in the center of the room. At some point Lan Zhan’s fingers found the ribbon in Wei Wuxian’s hair, untying it and letting it drop to the floor in a rare display of carelessness; he seemed unwilling to let go of Wei Wuxian even for the time it would take to go put the ribbon on the table. Wei Wuxian tried to do the same, but he couldn’t actually get rid of Lan Zhan’s complicated hairpiece without looking, so he broke the kiss and stood on his tip-toes, frowning a little in concentration as he carefully removed the big silver ornament, then all the pins holding Lan Zhan’s bun in place. He didn’t actually want to drop the hairpiece on the floor, so he made to slip out of Lan Zhan’s arms—only for Lan Zhan to catch his wrist.</p>\n<p> </p>\n<p>“I’m just gonna—,” Wei Wuxian started, then saw the look in Lan Zhan’s eyes, nervous and determined, and realized what he was after. “Ah,” he said, a low, punched-out sound. Oh, gods.</p>\n<p> </p>\n<p>He handed the hairpiece to Lan Zhan and stood in front of him, close enough that if he leaned forward a couple inches they’d be kissing again. Lan Zhan’s mouth was red in the low candlelight. His hair was loose and undecorated, his eyes a warm, burnished gold. He was so god damn beautiful. How was it possible for one person to have the most beautiful heart and soul <em> and </em>face?</p>\n<p> </p>\n<p>“Lan Zhan,” Wei Wuxian murmured, and reached around to the back of Lan Zhan’s head, feeling for the small knot in his forehead ribbon. Lan Zhan closed his eyes. He didn’t open them again until Wei Wuxian had untied the ribbon and slipped it out of his hair. Wei Wuxian waited until Lan Zhan was looking at him, then brought the silver filigree to his lips and kissed it, and Lan Zhan swayed as if caught in some invisible wake.</p>\n<p> </p>\n<p>Wei Wuxian went to put the hairpiece and the forehead ribbon on the table beside the bed, folding the ribbon neatly. Then, instead of returning to Lan Zhan, he sat down on the bed.</p>\n<p> </p>\n<p>“C’mere,” he said to Lan Zhan.</p>\n<p> </p>\n<p>Lan Zhan blinked twice. He approached the bed slowly, but not cautiously. He sat down beside Wei Wuxian, and unlike the last time they’d been in this position, he didn’t leave any space between them. His thigh was warm against Wei Wuxian’s even through what had to be like five thousand layers of robes.</p>\n<p> </p>\n<p>Wei Wuxian shifted to face him, bringing one knee up onto the bed. “I’m 99% sure I know the answer to this,” he said, “and it doesn’t matter anyway, it won’t change anything. I’m just curious. Have you done anything like this before?”</p>\n<p> </p>\n<p>“What do you think,” said Lan Zhan.</p>\n<p> </p>\n<p>“Okay, I’m just saying you were so famously <em> chivalrous</em>, Hanguang-jun. You could’ve had your pick of girls.”</p>\n<p> </p>\n<p>Lan Zhan’s dazed look turned to something that could only be described as incredulous. “Wei Ying. I have never wanted a girl.”</p>\n<p> </p>\n<p>Well, Wei Wuxian pretty much knew that. “Anyone else, then.”</p>\n<p> </p>\n<p>“I....” He sounded pained. “I did want someone.”</p>\n<p> </p>\n<p>Wei Wuxian's mouth fell open. “<em>Ah? </em> You did? Lan Zhan, you sly fox. Who was it?” Lan Zhan just stared at him. “No, c’mon, tell me! What lucky fellow caught the eye of the jadelike Lan Wangji? Did I know him? Also, wait, when was this? After we met? How could I possibly not notice?”</p>\n<p> </p>\n<p>“That is a very good question,” said Lan Zhan.</p>\n<p> </p>\n<p>Wei Wuxian frowned. “Lan Zhan. Who was it? What happened?”</p>\n<p> </p>\n<p>“Nothing happened,” said Lan Zhan. “I just wanted him.”</p>\n<p> </p>\n<p>All at once, Wei Wuxian understood. “No fucking way,” he breathed, feeling like he’d just been whacked upside the head with one of Lan Qiren’s bastinados. “You don’t mean—surely not all the way back <em> then</em>?”</p>\n<p> </p>\n<p>“Mm.”</p>\n<p> </p>\n<p>“But I was so annoying. You thought I was so annoying!”</p>\n<p> </p>\n<p>“You were,” Lan Zhan agreed. “Among other things.”</p>\n<p> </p>\n<p>“But....”</p>\n<p> </p>\n<p>Lan Zhan looked at him. “Every day the same,” he said, deliberate. “Everything the same. Then, you.”</p>\n<p> </p>\n<p>Wei Wuxian’s breath left him in a rush. “Lan Zhan, you really....”</p>\n<p> </p>\n<p>“Wei Ying. There has never been anyone else for me. There will never be anyone else. We met and I was yours. I was furious about it, I was scared, but I was yours.”</p>\n<p> </p>\n<p>A hot flush spread through Wei Wuxian’s belly, warming him like a mouthful of wine. Moonstruck, he reached out and cupped Lan Zhan’s face in his hands. He stroked his thumbs over Lan Zhan’s pretty cheekbones, fingertips on the soft soft skin below his ears, every part of this person star-bright and beautiful, his Hanguang-jun, his waxing moon. His yang. His zhiji. The weight of that settled in Wei Wuxian’s chest like snowfall. His soul.</p>\n<p>\n<em>   </em>\n</p>\n<p><em> There has never been anyone else for me</em>, he thought, for once unable to speak. <em> There will never be anyone else. </em> The blackness of Lan Zhan’s eyes in the candlelight was beautiful. Black like embers, black like a hollow tree. Wei Wuxian had slept in one once, a few months before Jiang Fengmian had found him. He’d been small and starved-skinny and he’d fit. And he’d felt strangely safe there, curled up in a hollow tree in the woods beside a wide fishing river. He remembered wishing he could stay forever. That night he’d dreamt of his limbs turning to roots, his body sinking into the tree, into the rich, rain-wet soil. Where nothing went hungry.  </p>\n<p> </p>\n<p>This was a different kind of hunger.</p>\n<p> </p>\n<p>He cleared his throat, finding his voice again. “I think I wanted you back then, too,” he said. A confession for a confession. “Not in the exact same way at first, and of course once I figured it out I just ignored it, like, ‘Well obviously that can’t happen.’ But sometimes....” He winced. “Ah, Lan Zhan. It’s hard to say out loud. I already said so much tonight, how is it still hard?”</p>\n<p> </p>\n<p>“You don’t have to.”</p>\n<p> </p>\n<p>“No, but I do,” Wei Wuxian insisted. “Lan Zhan ah, I took it to the grave once. I’m not doing that again.”</p>\n<p> </p>\n<p>Lan Zhan’s expression hollowed out. Right, fuck, he hated it when Wei Wuxian spoke casually about his own death. Privately Wei Wuxian thought that he, of all people, had earned the right to talk about that time he was dead for thirteen years. But Lan Zhan hated it, and one time Wei Wuxian had imagined himself in Lan Zhan’s place: he’d imagined Lan Zhan falling off that cliff, Lan Zhan just <em> gone</em>, without even a body to mourn, and he’d nearly started hyperventilating.</p>\n<p> </p>\n<p>“Sorry,” he murmured, and leaned in to kiss Lan Zhan’s face and nuzzle at his temple, because he could do that now. “Sorry, sorry. I’m sorry. But Lan Zhan, I wanted your attention, I wanted you to look at me. I thought you were so interesting, even when you were also being—ah—”</p>\n<p> </p>\n<p>“Rigid,” supplied Lan Zhan. “Strict. Depressing.”</p>\n<p> </p>\n<p>“Okay, alright.”</p>\n<p> </p>\n<p>“Pedantic.”</p>\n<p> </p>\n<p>Wei Wuxian slapped him lightly on the chest. “You’re the one who said ‘How boring,’ ‘How ridiculous,’ no matter what I did!”</p>\n<p> </p>\n<p>“The former was a lie.” He paused. “I stand by the latter.”</p>\n<p> </p>\n<p>“I thought there’s no lying in the Cloud Recesses.”</p>\n<p> </p>\n<p>“There wasn’t,” Lan Zhan said wryly. “Then, you.”</p>\n<p> </p>\n<p>“Ai,” Wei Wuxian whined, and pulled him close. Lan Zhan came easily, pressing his bare forehead to Wei Wuxian’s neck. Wei Wuxian rested his cheek on the side of Lan Zhan’s head and breathed in the familiar scent of his soap and hair oil, almond and orchid. “Of course I wanted you,” he said softly. It was easier to talk like this, when he didn’t actually have to look Lan Zhan in the eye. “Of course I did, how could I not? First you were the only person to ever match me in a fight, then you were so funny and smart and fun to tease, then you were just—perfect. I remember meeting Song Lan and Xiao Xingchen and watching them leave together and thinking, <em> That’s what I want with Lan Zhan.</em>” He heard Lan Zhan’s breath hitch. “I didn’t actually think it was possible, because I was supposed to be Jiang Cheng’s second-in-command and you were always going to do great things, and besides I didn’t think you’d ever want to leave Gusu. But I thought about it. Just traveling around night hunting with you forever, and everyone we met would know we belonged together.” He sighed, tugging lightly at the ends of Lan Zhan’s hair. “I don’t know. I had a lot of thoughts like that.”</p>\n<p> </p>\n<p>“What else?” said Lan Zhan. He sounded dazed.</p>\n<p> </p>\n<p>“Hm?”</p>\n<p> </p>\n<p>“What else did you think about?”</p>\n<p> </p>\n<p>“Oh, a thousand things, each sillier than the last. I wanted to swim in a lotus lake with you. I wanted to show you around Yunmeng... okay, this one’s actually kind of embarrassing, because I really did just want to show you all my favorite places in Yunmeng, but also, ah... if I’d shown you around the riverside markets, there was a good chance some of the young maidens would have flirted with me, and I thought about you getting jealous.” Lan Zhan was silent. Wei Wuxian groaned, feeling his cheeks heat up. “It was just dumb teenage stuff. I didn’t even think you liked me. Ah, whatever.”</p>\n<p> </p>\n<p>“I would have been,” said Lan Zhan.</p>\n<p> </p>\n<p>“...What?”</p>\n<p> </p>\n<p>Lan Zhan’s lips brushed his collarbones. “I would have been jealous.”</p>\n<p> </p>\n<p>Thrilled, Wei Wuxian hugged him even closer. “Hm! Apparently so!”</p>\n<p> </p>\n<p>“Wei Ying wanted that?”</p>\n<p> </p>\n<p>“Yes,” Wei Wuxian said. “I mean, not in a mean way. I didn’t want to make you mad or upset or anything. But, ah, there was this one girl who had a pork bun stall. I don’t remember her name, but she always gave me an extra bun for free. And I thought about taking you there so you’d see her smile at me, and you’d see that she wanted me, so maybe it would make you start wanting me, too.”</p>\n<p> </p>\n<p>“I already wanted you,” Lan Zhan pointed out. He moved both hands to Wei Wuxian’s waist, warm even through two layers of robes. Wei Wuxian shuffled closer till his knees were pressed against Lan Zhan’s thigh. It was kind of a weird angle. This would be a lot easier and more comfortable if Wei Wuxian just climbed into his lap.</p>\n<p> </p>\n<p>“Well, I know that <em> now</em>,” he said. His hands found their way into Lan Zhan’s hair, running through it all the way to the ends, silky between his fingers. “But I didn’t back then. So I thought if you saw someone else flirting with me, you’d realize I was like, a hot commodity.”</p>\n<p> </p>\n<p>Lan Zhan huffed in amusement. “You were the fourth most eligible bachelor in the cultivation world. I was aware.”</p>\n<p> </p>\n<p>“That’s right, and you were the second, weren’t you? Right behind Zewu-jun? I always thought that was ridiculous. You should’ve been number one.” He thought about it. “No, never mind, you shouldn’t have been on the list at all. You weren’t eligible, you were mine.”</p>\n<p> </p>\n<p>“Mm,” Lan Zhan confirmed. “Yours.”</p>\n<p> </p>\n<p>“So strike both of us off the list, then. Who would’ve been second and fourth? Jiang Cheng and—gods, Nie Huaisang?”</p>\n<p> </p>\n<p>“Two people I do not wish to think about right now,” said Lan Zhan, squeezing Wei Wuxian’s waist for emphasis.</p>\n<p> </p>\n<p>Wei Wuxian cackled. “Okay, fair. My <em> point </em> was that the pork bun maiden would’ve flirted with me. And I used to think about you seeing that, and... and I know it wouldn’t have happened like this in real life, but I thought about you, ah. Moving closer. Putting a hand on my shoulder.” He was distantly aware of his voice dropping into something lower, softer. “Um. Leading me out of the market to somewhere quiet, with nobody else around. And I’d be like, ‘Lan Zhan? What are you doing?’ and you’d just... you’d just, ah....”</p>\n<p> </p>\n<p>Lan Zhan’s mouth opened against Wei Wuxian’s neck, a flicker of breath and wet.</p>\n<p> </p>\n<p>“You’d,” Wei Wuxian said, hushed. He was quickly losing the ability to concentrate. “You’d, um. You’d grab me and take me in your arms and just—kiss me, just fucking kiss me. Hard. I... I thought about your hands a lot.”</p>\n<p> </p>\n<p>“My hands?”</p>\n<p> </p>\n<p>“They’re so big. And pretty. I wanted them...,” he trailed off into a sigh, tipping his head back, as Lan Zhan began to mouth at his neck, bottom lip catching wetly on his skin. “Oh, gods. I wanted them all over me, I wanted you all over me, wanted you to.... to drag me to the nearest inn and take me upstairs and sweep everything off the table, like, a whole tea-set—keep in mind this is a fantasy, I know you’d never destroy a perfectly good tea-set—and take me right there on the table, ah Lan <em>Zhan</em>, I really tried not to think about it because I knew I shouldn’t want you and also I was like, ‘oh, he’d be horrified if he knew I was thinking about this,’ but sometimes—you know when you’re really close and you can’t control where your mind goes—”</p>\n<p> </p>\n<p>Lan Zhan reared back to look at him, wild-eyed, breathing hard. “You,” he said, strangled. “You—when you were—?”</p>\n<p> </p>\n<p><em> “Yeah,” </em> said Wei Wuxian, and climbed into his lap. Like this he had a few inches on Lan Zhan, so he pushed his hands into Lan Zhan’s hair and used it to tilt his head back, baring the elegant curve of his throat. Lan Zhan’s lips parted on a shocked breath and Wei Wuxian didn’t fuck around, just kissed him, sliding their open mouths together. He hitched up the skirt of his robes and straddled Lan Zhan properly, thighs spread around his hips. Lan Zhan’s hands fell from his waist to his ass, bolder than Wei Wuxian might have expected, pulling him in till the swell of him was pressed against the flat muscle of Lan Zhan’s lower belly. Wei Wuxian heard himself moaning, rocking into him with tiny, helpless movements. He’d never done this before, but he’d never <em> not </em> known how to move with Lan Zhan, whether they were sparring or fighting back-to-back on a battlefield or playing music together or pouring each other’s drinks, serving each other at mealtimes, sitting quietly in the evenings; Lan Zhan with a book and Wei Wuxian bent over his talismans, all their treasured routines, the tiny brush-strokes that formed each day, mundane and predictable and sacred. They knew each other. Lan Zhan’s mouth was soft even when his kiss wasn’t. He was so easy to get lost in, this most trusted person.</p>\n<p> </p>\n<p>So Wei Wuxian got lost. The rest of the room, the noises floating up from the street down below, everything fell away until nothing existed but this bed, this man; this man and his hands and the way he kissed, deep and endless, all-consuming. They were kissing and kissing and then the world tilted and Wei Wuxian found himself on his back, Lan Zhan hovering over him with a careful hand under his head so he wouldn’t crack his skull on the bedframe. For a moment they both just gazed at each other, dark-eyed and panting. Lan Zhan’s cheeks were pink; his mouth was kissed a deep red. His hair was messy for perhaps the first time in his entire life. Wei Wuxian did that.</p>\n<p> </p>\n<p>He was beyond beautiful. There weren’t any words for what he was, gilded edges in the candlelight. He was Wei Wuxian’s heart outside his body. He was a hearth fire. If Jiang Cheng was the flash of a saltpeter bomb and shijie a lantern lighting the way home, Lan Zhan was a hearth fire. Always the brightest, warmest thing in the room, the first place you’d go if you’d been cold for a very long time.  </p>\n<p> </p>\n<p>Wei Wuxian smiled up at him and said, “Lan Zhan, you’re so good. I like you so much.” He said, “You’re my favorite. I love you, I’m really in love with you, I want you forever. Let’s get married, okay?”</p>\n<p> </p>\n<p>Lan Zhan, whose eyes had gone very wide somewhere around <em> ‘love you,’ </em> blinked once. Then he tipped sideways, catching his weight on one elbow. His other hand was still under Wei Wuxian’s head. “Wei Ying,” he managed.</p>\n<p> </p>\n<p>“Marry me,” Wei Wuxian said again. “Lan Zhan, you can’t kiss me like that and not marry me.”</p>\n<p> </p>\n<p>“...Marry you,” said Lan Zhan. He appeared to be malfunctioning.</p>\n<p> </p>\n<p>“Yes. I want you to be my closest most beloved friend and my zhiji and my husband. Three’s a lucky number, you know. It’s very powerful. Right now you’re only two of those things, and that’s no good.” He laughed and a couple tears brimmed over, running down his temples into his hair. “Well, it’s pretty good. But three’s still better. Hanguang-jun, Lan Wangji, Lan Zhan, marry me, I wanna be your husband. And cultivation partner.” Lan Zhan was just staring at him, frozen. “Oh wait,” Wei Wuxian continued, “wait, damn, that’s four things, four’s no good at all... father of our son. There, that’s five. Lots of important things come in fives.” He sniffled. “Hey, my love, are you breathing? You should be doing that.”</p>\n<p> </p>\n<p>Lan Zhan unfroze long enough to take a breath.</p>\n<p> </p>\n<p>“Good boy,” said Wei Wuxian, beaming at him. “My Lan Zhan. Marry me.”</p>\n<p> </p>\n<p><em> “...Yes,” </em> Lan Zhan said at last. His eyes still hadn’t left Wei Wuxian’s face. “Yes. Wei Ying. Marry me.”</p>\n<p> </p>\n<p>“Marry <em> me, </em>I asked first.”</p>\n<p> </p>\n<p>“Okay. I’ll marry you. Marry me.”</p>\n<p> </p>\n<p>Wei Wuxian’s heart was all fireflies, he couldn’t believe it wasn’t glowing through his chest. “Alright, I will,” he said, and shoved at Lan Zhan’s shoulder, pushing him the rest of the way over and climbing on top of him immediately, kissing his cheek, forehead, coaxing his mouth open, already over the strangeness of pressing his tongue inside. He’d never really understood the appeal of kissing like this, of wanting someone else’s tongue in his mouth, but he got it now. It wasn’t the invasion he’d always thought it would be. It was soft and warm and wet; it was opening up for someone who wanted deep inside him, wanted to taste him and draw out all his breathy little noises, wanted to take him and was starting with his mouth. It was so good, it took Wei Wuxian longer than it should have to notice Lan Zhan was tense beneath him.</p>\n<p> </p>\n<p>He pulled away, worried—then immediately saw what the problem was and tried not to burst out laughing. Flat on his back like this, Lan Zhan was simply too tall for the little wooden bed. Even with his legs bent and no hair ornament, the top of his head was shoved up against the headboard.</p>\n<p> </p>\n<p>“What kind of inn is this,” Wei Wuxian gasped. “Are the people of Guoyang just unnaturally short?”</p>\n<p> </p>\n<p>Lan Zhan sighed.</p>\n<p> </p>\n<p>“My goodness. Well, get up.” He clambered off Lan Zhan and the bed, kind of surprised when his knees didn’t buckle. Lan Zhan followed him, and something about his expression reminded Wei Wuxian of the time he’d gotten drunk in Yueyang. He’d been so cute and pliant, trailing after Wei Wuxian down the dark, misty streets, big doe eyes fixed on Wei Wuxian’s face.</p>\n<p> </p>\n<p>Wei Wuxian gathered up the bedding and the padded mat and dumped it all on the floor. He’d seen some extra blankets in the wardrobe earlier, so he fetched those too and added them to the pile, then arranged all the blankets over the mat so it was less of a nest and more of a makeshift bed. Satisfied, he was about to turn around and fling himself at Lan Zhan when two big hands settled on his waist. Lan Zhan stepped up behind him, his front warm and solid at Wei Wuxian’s back. He nosed at Wei Wuxian’s hair, kissed his ear and the side of his head. Wei Wuxian leaned back into him, eyes fluttering shut, and after a moment Lan Zhan’s arms wrapped around his waist and his chin came to rest on Wei Wuxian’s shoulder. It felt like sinking into a hot bath. Heat spreading through him from his toes to the pit of his belly to the tips of his fingers.</p>\n<p> </p>\n<p>“Lan Zhan,” he whispered. He put his own hands on Lan Zhan’s forearms. “Lan Zhan ah.”</p>\n<p> </p>\n<p>Lan Zhan made a low, sweet noise.</p>\n<p> </p>\n<p>Wei Wuxian turned his face to the side and kissed what he could reach, which was Lan Zhan’s cheekbone and temple and the corner of his eye. Barely even kisses, just brushing his parted lips over Lan Zhan’s skin, breathing him in. He smelled so good. He was so steady and real, his arms around Wei Wuxian, his heart beating at Wei Wuxian’s shoulder. When Lan Zhan breathed in, Wei Wuxian felt the slow expansion of his chest; when he breathed out, his breath was warm on Wei Wuxian’s collarbones.</p>\n<p> </p>\n<p>It occured to Wei Wuxian that he had just proposed, and Lan Zhan had said yes, and they were going to be married, and this person would be his <em> husband</em>, which sounded laughable. He hadn’t realized it at the time, because there was so much else going on, but he’d stopped dreaming about his someday-wedding the moment he’d watched Wen Qing reach inside him and come back with his core cupped in her bloodied hands like a golden bird, illuminating her face with pulses of light. When she’d severed the spiritual vein it had looked so ridiculously like cutting an umbilical cord that Wei Wuxian, delirious with pain and exhaustion, had started laughing. Some part of him had known then that he wouldn’t make it out of the war. His future had been cut abruptly short—but Jiang Cheng’s had been ensured, so that was alright. Some people were meant to survive terrible things, and others were not. Some people became the terrible thing, and those people never survived themselves; there was no exception throughout history.</p>\n<p> </p>\n<p>How strange, having a future again. How funny, having time.</p>\n<p> </p>\n<p>How wild, how miraculous, having someone to spend it with.</p>\n<p> </p>\n<p>Husband.</p>\n<p> </p>\n<p>It was a totally normal thing to be. Lots of people were husbands. But as Wei Wuxian turned in Lan Zhan’s arms, finding his mouth and sinking into him again, he thought about how the Yiling Laozu was long dead, so in this second life he’d rather be known for this. Wei Wuxian: semi-rogue cultivator, semi-mad inventor, grower of lotus seeds, flouter of rules, new father to an old son. Wei Wuxian: husband.</p>\n<p> </p>\n<p>He was definitely crying again. And also grinning so hard it was sort of impeding the whole ‘making out with the love of his existence’ thing. Lan Zhan pulled back and Wei Wuxian chased his mouth, kissing him one more time, and then it was his turn to be chased and kissed, on his mouth and the hollow of his cheek. Then they were just gazing at each other, Wei Wuxian in the circle of Lan Zhan’s arms. His vision was hazy with tears. He couldn’t stop smiling.</p>\n<p> </p>\n<p>“Lan Zhan,” he said, and he was going to follow it with something like ‘you’re the best’ or ‘I like you so much,’ but there were too many options, so he just wrapped his arms around Lan Zhan’s middle and hugged him. Lan Zhan hugged him back so hard Wei Wuxian was lifted off the floor a little, their bodies one curve.</p>\n<p> </p>\n<p>“Love you,” Lan Zhan murmured into his hair. “Love you, love you.”</p>\n<p> </p>\n<p>“Lan Zhan,” said Wei Wuxian. “Take me to bed.”</p>\n<p> </p>\n<p>There was no getting around the awkwardness of lowering themselves to the floor and crawling onto the blankets. Wei Wuxian giggled and laid on his back, spreading his legs for Lan Zhan to settle between, reaching up to wind his arms around Lan Zhan’s neck. Lan Zhan looked so different with his forehead bare, somehow more naked than he would have if he’d taken all his clothes off but kept the ribbon. Wei Wuxian couldn’t resist leaning up to kiss his forehead right where the filigree always sat, then his cheek, then Lan Zhan was pressing him into the blankets and drawing him into a kiss that felt like the first time he’d ever shot a kite right out of the endless blue sky, his arrow true, a single moment of wild, surging joy. They spent long minutes like that, all their kisses open-mouthed, warm and orange-gold in the candlelight. Wei Wuxian’s mind went hazy, that hot-bathwater feeling again. Something was pulsing behind his navel, a deep, thrumming sensation, tidal; his inner thighs ached; his hips wanted to push up off the blankets over and over until he found the right friction. He spread his legs wider and moaned into Lan Zhan’s mouth, startled, when Lan Zhan dragged a hand down his thigh to his knee, pulling his leg up to wrap around Lan Zhan’s waist, robes trailing.</p>\n<p> </p>\n<p>They broke apart to look at each other, panting hard. “Lan Zhan,” Wei Wuxian managed. Holding Lan Zhan’s gaze, he rolled his hips up and dragged himself over Lan Zhan’s lower belly, making the hottest, truest part of himself known, and had the immense pleasure of seeing Lan Zhan’s eyes flutter shut, lips parting around a silent <em> ‘oh.’ </em>Wei Wuxian dropped his hands to Lan Zhan’s shoulders. “Lan Zhan,” he said. “Lan Zhan, you should—I want you to—”</p>\n<p> </p>\n<p>Lan Zhan’s eyes were so dark. It hit Wei Wuxian all over again that they were here together, after everything, the impossible, dizzying truth of it unfurling like a lotus flower, a fat dawn-yellow peony, a paperman shaking its limbs out, coming to life. He’d wanted to kiss this man since they were sixteen. This man in all his forms: the boy at the white gates, the silent, beautiful boy from the library, the boy who slept at Wei Wuxian’s side on the rocky ground of the Dancing Fairy’s cave, the boy who liked rabbits and floral teas and old poetry and somehow Wei Wuxian.</p>\n<p> </p>\n<p>“Touch me,” he said. “Lan Zhan, I want you to touch me, please touch me.”</p>\n<p> </p>\n<p>“Wei Ying,” Lan Zhan said, reverent, and smoothed a hand over Wei Wuxian’s thigh again, but Wei Wuxian was officially too turned on to be patient. He grabbed Lan Zhan’s hand and brought it to the front of his robes where his belts were tied. Lan Zhan, bless him, didn’t need to be told twice; he made quick work of the cloth belt and the thick leather one beneath, and then they were falling away from Wei Wuxian’s waist and Lan Zhan’s hand was on his chest, rising and falling with his breaths, fingers spread out over his heart. Wei Wuxian squirmed under his touch, whining a little. The corner of Lan Zhan’s mouth quirked. Instead of taking Wei Wuxian’s robes off, he ducked to kiss his throat, mouthing warm and wet at the skin just above his collar.    </p>\n<p> </p>\n<p>“Lan Zhan <em> ah</em>,” Wei Wuxian protested, bucking his hips again. “Get on with it, I can’t believe I’m lying here waiting to be ravished and you’re <em> not ravishing me</em>—”</p>\n<p> </p>\n<p>Lan Zhan’s teeth grazed his skin. “I am ravishing you.”</p>\n<p> </p>\n<p>“Ravish me faster!”</p>\n<p> </p>\n<p>“No,” Lan Zhan said, and ran his hand down Wei Wuxian’s chest to his belly to the curve of his hip, fingers dipping beneath the front of his robes only once. He raised his head to look Wei Wuxian in the eye. “Like this.”</p>\n<p> </p>\n<p>Wei Wuxian gaped up at him. “Oh my god,” he said, so turned on he could barely think. “Okay. Fuck. What the fuck. Do whatever you want.”</p>\n<p> </p>\n<p>“Mm,” Lan Zhan agreed, and ducked down again. Wei Wuxian tilted his head back and let the haze take over, awareness giving way to sensation: Lan Zhan’s hot mouth on his neck; Lan Zhan’s clever fingers finally pushing his robes open, letting the outer robe fall away, kissing across Wei Wuxian’s newly exposed collarbones; one hand sliding under the inner robe, hot on Wei Wuxian’s bare skin. Wei Wuxian arched into him, one leg still wrapped around his waist and the other bent open. He got to work on Lan Zhan’s belts. It was a god damn ordeal picking apart the complicated knots without looking, but Lan Zhan was kissing his mouth again, taking him deeply, fucking his tongue into Wei Wuxian’s mouth, slow and hot and slick.</p>\n<p> </p>\n<p>Then Wei Wuxian’s shoulders were bared to the cool air. He shivered, gasped into Lan Zhan’s mouth, and then of course starting laughing at himself, head thumping back into the blankets. “This is so—,” he couldn’t speak for a second. “This is so ridiculous,” he told Lan Zhan. “I can barely feel pain anymore, but I’m—I’m really sensitive. I didn’t think I’d be able to feel this much.”</p>\n<p> </p>\n<p>Lan Zhan smoothed a piece of hair off Wei Wuxian’s forehead. His touch was so gentle.</p>\n<p> </p>\n<p>“I mean—I knew I liked your hands on me,” said Wei Wuxian. He turned his face to the side, swallowing hard. “I love it when you hold me, I knew I wanted this, I just—I didn’t know it was gonna be this good. It’s so intense,” he said, and started laughing all over again, quiet and breathless. “I feel it everywhere, but it doesn’t hurt.”</p>\n<p> </p>\n<p>Lan Zhan didn’t say anything, just bent to kiss Wei Wuxian’s cheek.</p>\n<p> </p>\n<p>“Sorry,” Wei Wuxian said, embarrassed. “Ah, Lan Zhan, ignore me, sorry.”</p>\n<p> </p>\n<p>“No apologies between us,” said Lan Zhan. He kissed Wei Wuxian’s forehead. “I want to make Wei Ying feel good.”</p>\n<p> </p>\n<p>“I want to make Lan Zhan feel good.”  </p>\n<p> </p>\n<p>“You do.”</p>\n<p> </p>\n<p>“Better, then.”</p>\n<p> </p>\n<p>“Hmmm.” Lan Zhan shifted his weight to the other elbow, cupping one of Wei Wuxian’s bare shoulders in his free hand. “We’ll see.”</p>\n<p> </p>\n<p>“Guess so,” said Wei Wuxian, grinning, and they were kissing again, deep, heated kisses, Wei Wuxian sliding his hands under Lan Zhan’s pretty robes, “how many <em> layers </em> are you <em> wearing</em>,” revealing his chest, his narrow waist, the peaks of his hipbones just above the waistline of his thin linen pants. The Lan robes fell around them like a snowdrift. Wei Wuxian ran sword-calloused hands over Lan Zhan’s shoulders, upper arms, the planes of his chest. He'd stopped wielding Suibian over a year before he’d died, but those callouses wouldn’t fade so easily, and he loved the subtle friction of his own hands on Lan Zhan’s fine skin. Lan Zhan’s palms were softer than his own, well-cared for. His middle and index fingers had a slight roughness where he plucked the strings of his guqin.</p>\n<p> </p>\n<p>All the scars of Wei Wuxian’s past life, even the thick, knotted one that had bisected his lower belly where Wen Qing had cut him open, were gone. The skin had regenerated; the core itself had not. His chest and back were smooth, unmarked by the Wen brand, Jiang Cheng’s sword, the strange lightning fractals of the Zidian, countless other nicks and scrapes he’d accumulated over the years. It had been harder to get used to than he might have thought. Waking up in a body without scars was like waking up in a body that wasn’t his own.</p>\n<p> </p>\n<p>Lan Zhan had new scars. When Wei Wuxian ran his hands down Lan Zhan’s back, that warm, smooth skin was cross-hatched by rough lines of scar tissue. He broke their endless kiss just long enough to lean up, pressing his open mouth to the Wen brand on Lan Zhan’s chest. He still didn’t know where it came from. It wouldn’t have been part of a Lan punishment; it couldn’t have been a Wen. It couldn’t have been anyone, really, except....</p>\n<p> </p>\n<p>He kissed it again, pressed the flat of his tongue to the center, listened to the shudder of Lan Zhan’s breath.</p>\n<p> </p>\n<p>“Wei Ying,” Lan Zhan said above him, pleading. “Wei Ying.”</p>\n<p> </p>\n<p>Wei Wuxian leaned back down and shoved his own bloodred inner robes the rest of the way off. He was naked all at once, completely bared. “Lan Zhan,” he said, self-conscious in a way he wasn’t accustomed to. He’d never been shy about his body and he wasn’t really now. It was less about hoping Lan Zhan would like what he saw and more about the loss of a final barrier; the sudden escalation of intimacy in what was already by far the most intimate experience he’d ever had. “Lan Zhan, tell me I’m handsome,” he demanded jokingly, trying to get the fuck out of his own head. “Don’t you know you’re supposed to shower me with compliments? I don’t take my clothes off for just anyone.”</p>\n<p> </p>\n<p>Lan Zhan didn’t dignify the last part with a response. He just lifted his gaze from where it had fallen immediately to Wei Wuxian’s nakedness and said very seriously, “Wei Ying is handsome.”</p>\n<p> </p>\n<p>Bad idea! Bad idea! Wei Wuxian squeaked and wrapped all his limbs around Lan Zhan, clinging to him like a monkey. “Silence during—this!” he gasped, so full of love he was vibrating a little. “That’s a rule! It’s a new rule! The moment we get back to the Cloud Recesses I’m putting it on the Wall!”</p>\n<p> </p>\n<p>“It’s not a rule,” Lan Zhan said serenely. He nipped Wei Wuxian’s earlobe and said, “Wei Ying is very handsome.”</p>\n<p> </p>\n<p>Embarrassingly, that made Wei Wuxian’s hips buck up of their own accord. Lan Zhan made a shocked, breathy noise at the feeling of Wei Wuxian pressed against his bare stomach, and that was all it took to lose themselves again, bodies moving together, chest to chest, Lan Zhan’s hands on Wei Wuxian’s thighs, hips, the curve of his ass. The first touch was always hesitant, the second bold. Wei Wuxian managed to shove Lan Zhan’s pants down, and then they were both naked, wide-eyed and flushed and gasping in the candlelight, in the mess of blankets, the white and scarlet yin-yang of their discarded robes.</p>\n<p> </p>\n<p>“Oh,” Wei Wuxian said when Lan Zhan took him in hand, “oh, oh Lan Zhan, Lan Zhan—,” but his mouth was still hot and open against Lan Zhan’s so it came out like <em>La-Zha, </em>a desperate flick of the tongue, more breath than voice, <em>La-Zha, La-Zha, kiss me, don’t stop, oh gods, want you deeper, want you inside me, fuck, fuck</em> <em>me</em>, shameless and too loud, chasing his pleasure with fluid movements of his hips, fingers tight in Lan Zhan’s hair, <em>oh, touch me harder, </em>Lan Zhan’s teeth on his collarbones, Lan Zhan panting into his mouth. Wei Wuxian arched into him and let his head fall back, exposing the lines of his body, the line of his throat. <em>Take me, take me</em>, and Lan Zhan took. His hand was so big, perfect once he found a rhythm, and at one point he reached up to brush his fingers over Wei Wuxian’s lips, asking permission; Wei Wuxian took them into his mouth and sucked, moaning around them until Lan Zhan withdrew, spit trailing, and the next touch was hot and slick with spit and precome. Wei Wuxian’s hips stuttered, graceless with how close he was. Lan Zhan was watching him. His hot, dark gaze was focused not between their bodies, on his hand around Wei Wuxian, but on Wei Wuxian’s face.  </p>\n<p> </p>\n<p>“I’m,” Wei Wuxian said, “I’m, I can’t—Lan Zhan—”</p>\n<p> </p>\n<p>Lan Zhan kissed him. For one breathless moment, Wei Wuxian went still. In the next, he shuddered apart. He rolled his hips just as the wave crested, smearing his wetness across Lan Zhan’s belly. He could hear himself moaning brokenly into Lan Zhan’s mouth, but all sound and sensation was distant, muted; he was suspended in deep water, but he wasn’t drowning. He was just weightless.</p>\n<p> </p>\n<p>He came back to himself in increments, drifting slowly ashore. Lan Zhan had gathered him close, one arm under his back. He was kissing Wei Wuxian’s face, cheeks and chin and forehead and mouth, mouth, mouth, and Wei Wuxian tried to kiss back but didn’t have total control over his body yet. His thoughts were caught in amber, his thighs trembling, his breaths shaky and erratic, catching in his throat. It had never felt like this. Even before losing his core, it had never felt like this.</p>\n<p>  </p>\n<p>“Okay,” he mumbled at last, fully aware that he sounded drunk. “Okay. Yeah. We’re gonna do that every day.”</p>\n<p> </p>\n<p>Lan Zhan started laughing.</p>\n<p> </p>\n<p>At first Wei Wuxian didn’t know what was going on. Lan Zhan was shaking in his arms, making these tiny, hitching noises into Wei Wuxian’s hair, not even really noises, just intakes of breath. “Lan Zhan?” he said, worried Lan Zhan was crying, but then Lan Zhan lifted his head and—gods, he was smiling enough to show a tiny bit of his front teeth, eyes narrowed with happiness. He stopped laughing pretty quickly, but the smile didn’t fade.</p>\n<p> </p>\n<p>“My Lan Zhan,” said Wei Wuxian, matching that smile with his own, wide and bright. “My Lan Zhan, you’re so sweet. Look at you, how can you be so sweet? I just came so hard I solved all ten of Hui Shi’s paradoxes and you have the gall to be the cutest person in the world right now?”</p>\n<p> </p>\n<p>“I like you,” said Lan Zhan.</p>\n<p> </p>\n<p>“God damn,” said Wei Wuxian, and flipped them over. He sat on Lan Zhan’s thighs, staring down at him, all that pale skin and black hair spread out in the blankets. Lan Zhan hadn’t come yet. He was full and flushed, and when Wei Wuxian curled his fingers around him, Lan Zhan closed his eyes and drew in a long, slow breath.</p>\n<p> </p>\n<p>Wei Wuxian brought him to the edge like that, eyes zeroed in on his face, trying out different rhythms and pressures, fascinated by the way Lan Zhan reacted, intense but internal: where Wei Wuxian might have thrown his head back or cried out, Lan Zhan only furrowed his brow, shifted his hips infinitesimally under Wei Wuxian, twisted his fingers in the blankets. It wasn’t lack of interest, and it wasn’t even restraint. This, Wei Wuxian realized, was simply what Lan Zhan looked like when he was being taken very carefully apart, and it was fucking glorious. Wei Wuxian paused only to spit into his own palm, which earned him an eyebrow twitch and a funny expression like Lan Zhan wasn’t sure whether to find it nasty or sexy. He evidently settled on sexy, because when Wei Wuxian did it again a minute later, Lan Zhan pushed himself up onto his elbows and reached up to slide his fingers into Wei Wuxian’s sweaty hair, pulling him down into a kiss.</p>\n<p> </p>\n<p>“Wei Ying,” he breathed.</p>\n<p> </p>\n<p>He was about to come. Wei Wuxian sucked on his tongue once, twice, head bobbing, then broke away and bent down and took Lan Zhan into his mouth. He only had time to register <em> musky, heavy, soft skin </em>before Lan Zhan made a choked noise, muscles tensing, spilling over Wei Wuxian’s tongue. It was hot, salty, oceanic, not the best taste in the world but certainly not the worst. Wei Wuxian swallowed around him and pulled off, wiping his mouth.</p>\n<p> </p>\n<p>Lan Zhan looked poleaxed. He was staring at Wei Wuxian with wide, shocked eyes, chest heaving.</p>\n<p> </p>\n<p>Wei Wuxian grinned, extremely satisfied with himself. He stuck out his tongue, just to get the message across because yeah, <em> he did that</em>, and said, “Lan Zhan tastes so good.”</p>\n<p> </p>\n<p>“Wei Ying,” Lan Zhan said faintly.</p>\n<p> </p>\n<p>“I wanna do that again,” said Wei Wuxian, climbing off Lan Zhan’s thighs to cuddle up beside him. The room had grown chilly, fire burning low and sweat cooling on Wei Wuxian’s skin, so he tugged at the blankets and maneuvered Lan Zhan’s limbs around until the two of them were wrapped up in a big cocoon, Wei Wuxian tucked under Lan Zhan’s arm. He rested his cheek on Lan Zhan’s chest and listened to his rabbit heartbeat, waited for him to come back.</p>\n<p> </p>\n<p>“Yes,” said Lan Zhan after about a thousand years. “Yes. Again.”</p>\n<p> </p>\n<p>“A lot.”</p>\n<p> </p>\n<p>“Yes.”</p>\n<p> </p>\n<p>Wei Wuxian closed his eyes, exhaustion rising in him like summer twilight, hazy lavender. He felt Lan Zhan raise a hand, then the color behind his eyelids turned to black as all the candles snuffed out, leaving only the glowing embers of the hearth fire. “It’s past your bedtime,” he whispered.</p>\n<p> </p>\n<p>“Mm. If only I’d gone to sleep.”</p>\n<p> </p>\n<p>Wei Wuxian pressed his laughing mouth to Lan Zhan’s heart. Kissed him there and said, “Night. Night, my Lan Zhan.”</p>\n<p> </p>\n<p>Lan Zhan stroked his hand over Wei Wuxian’s naked hip, just once. “Sleep well, Wei Ying.”</p>\n<p> </p>\n<p>“You too,” said Wei Wuxian, or at least he tried to. Warm and whole and alive in Lan Zhan’s arms, in this soft dark with the promise of dawn, he was already halfway to a really good dream.</p>\n<p> </p>\n<p align=\"center\">✵</p>\n<p> </p>\n<p>\n<em> Lan Zhan, </em>\n</p>\n<p> </p>\n<p>\n<em> I’m tired of writing to you, I’m tired of not seeing you. I’m tired of my heart separated from yours. I miss your face. Two decades later and that hasn’t changed; all I want is to look at your face, and for you to look back at me. </em>\n</p>\n<p> </p>\n<p>\n<em> I’m coming back. Lan Zhan, I wanted to write something different just now, I wanted to write ‘I’m coming home.’ That’s pretty presumptuous but can you blame me! I want a home, I want a home, I want a home with you, in the mountains or on the road or anywhere else, everywhere else with you. When I see you please tell me to come back. You don’t have to say ‘home’ but please tell me to come back. I’ll do it if you tell me. My handwriting is so fucked right now, thank the gods I’m going to burn this before you read it, you wouldn’t be able to read it at all. Lan Zhan, just tell me to come back. I’ve burned all these letters but I’ll tell you what they said, okay? I’ll write it out again. I’ll tell you everything. I want you to know about me and I want to know about you. Your sweet soft heart. I could learn you forever. </em>\n</p>\n<p> </p>\n<p>\n<em> I’ll be in Gusu tomorrow. I don’t know how I’m gonna tell you I’m there yet. I guess I'll send a message to the Cloud Recesses or something. Or maybe I’ll just break the wards and sneak over the wall, let myself into the Jingshi, beg you to let me stay. </em>\n</p>\n<p> </p>\n<p>\n<em> I’ll see you soon, Lan Zhan. </em>\n</p>\n<p> </p>\n<p>\n<em> Tell me to come back, okay? This time I promise I’ll say yes. </em>\n</p>\n<p>\n<em>     </em>\n</p>\n<p align=\"center\">✵</p>\n<p> </p>\n<p>Like so many other days, Wei Wuxian woke to the sound of Lan Zhan. Except this time it wasn’t the whisper of his ink-brush on a fresh piece of paper, it was the quiet click of bowls and chopsticks being set out, the scrape of a serving spoon on the inside of a ceramic pot. Wei Wuxian kept his eyes shut for a long moment, just listening. The color behind his eyelids was grayish-blue, not red, so it had to be really early in the morning. Way too early for reasonable people to be awake.</p>\n<p> </p>\n<p>“Wei Ying.”</p>\n<p> </p>\n<p>He stayed quiet.</p>\n<p> </p>\n<p>“Wei Ying. I know you’re awake.”</p>\n<p> </p>\n<p>“I’m your husband, almost,” Wei Wuxian whined. “You have to be nice to me.”</p>\n<p> </p>\n<p>“I am very nice to you.”</p>\n<p> </p>\n<p>That made Wei Wuxian smirk and roll over, fixing Lan Zhan with the most salacious look he could muster. “That’s true, Lan Zhan is <em> extremely </em> nice to me,” he purred. “In fact, why don’t you come over here and be nice to me some more?”</p>\n<p> </p>\n<p>It was intentionally lurid and not at all sexy. To Wei Wuxian’s delight, Lan Zhan’s ears still went pink. “There’s congee,” he said. “Wei Ying should eat.”</p>\n<p> </p>\n<p>“Ai Lan <em> Zhan</em>,” Wei Wuxian complained, but got up and put on his inner robes anyway, as he knew the only thing Lan Zhan wanted more than to rail him was to keep him safe and warm and well-fed. It was incredibly sweet, even if Wei Wuxian would rather climb into his lap and get his hands back under those pristine white robes as soon as possible. Now he knew what Lan Zhan looked like when he kissed, when he came, with that hot dark gaze and messy black hair, robes hanging off his shoulders, sweat shining at his temples, lips bitten red, skin flawless in the moonlight, all of him a cut of moonlight, pale and glowing and unearthly beautiful, somehow real. He knew the sounds the solemn Hanguang-jun could make. Frankly, all the sect leaders should consider themselves lucky if Wei Wuxian didn’t crash every meeting and banquet and conference from now until the end of time, just to stand up in front of everyone and kiss His Excellency the Chief Cultivator till his cheeks turned pink, till his breaths came fast.</p>\n<p> </p>\n<p>Actually, damn, that was an image. Lan Zhan at the head of a banquet in his finest robes. Wei Wuxian draped across his lap, hand-feeding him slices of fruit. Yao-zongzhu approaching them, eyes downcast, to voice his latest grievance. Lan Zhan shutting him up with the Silence Spell, Wei Wuxian dumping a jar of wine over his head—no, scratch that, waste of wine. Lan Zhan shutting him up with the Silence Spell and then making out with Wei Wuxian on the fancy table with all the fancy dishes, his hands on Wei Wuxian’s thighs, his teeth at Wei Wuxian’s throat—</p>\n<p> </p>\n<p>“Wei Ying,” said Lan Zhan.</p>\n<p> </p>\n<p>Wei Wuxian looked up. He was abruptly aware that he’d been frozen with a spoonful of congee halfway to his mouth for like thirty seconds. “...Yes,” he said. He could feel his entire face growing hot. “Yes. Hi. Good morning, Lan Zhan. What? Hello.”</p>\n<p> </p>\n<p>Lan Zhan’s eyebrow twitched. “Hello, Wei Ying. Are you alright?”</p>\n<p> </p>\n<p>“Haaaaah,” said Wei Wuxian.</p>\n<p> </p>\n<p>Lan Zhan offered him a steamed bun.</p>\n<p> </p>\n<p>“Thank you. I want you to fuck me,” said Wei Wuxian.</p>\n<p> </p>\n<p>Lan Zhan’s lips parted. His eyes flicked from Wei Wuxian’s face to the bun and back again as if searching for some sort of correlation.</p>\n<p> </p>\n<p>“Not right now!” Wei Wuxian clarified. “Right now we should probably save this town from ghosts or whatever. But. I’m just warning you in advance. Because—well, I’m not sure how much you know about the specific logistics involved, but there’s, uh, there’s some stuff we should probably buy—”</p>\n<p> </p>\n<p>“I am aware,” said Lan Zhan.</p>\n<p> </p>\n<p>“Oh,” said Wei Wuxian.</p>\n<p> </p>\n<p>They stared at each other over the breakfast tray.</p>\n<p> </p>\n<p>“So, um.” Wei Wuxian’s voice came out all low and breathy. He cleared his throat and tried again. “So... the ghost. The ghost of the drowned woman.”</p>\n<p> </p>\n<p>“The ghost,” said Lan Zhan.</p>\n<p> </p>\n<p>“We know it exists. We know it’s here in the, um. In the. In the... vicinity.”</p>\n<p> </p>\n<p>“Mm.”</p>\n<p> </p>\n<p>“And that’s bad.”</p>\n<p> </p>\n<p>“It is not ideal,” Lan Zhan agreed.</p>\n<p> </p>\n<p>“Someone should do something about that.”</p>\n<p> </p>\n<p>“Mm.”</p>\n<p> </p>\n<p>Wei Wuxian buried his face in his hands and groaned for exactly ten seconds. Then he stuffed the entire bun in his mouth in one go, chewing miserably. Later. Later. They had time, that was the whole point of this: having time. He wouldn’t die, <em> again</em>, if Lan Zhan didn’t fuck him right now at this moment. The ghost of a drowned woman was luring children into a river. They had to deal with it. Objectively, the lives of innocent children were more important than Wei Wuxian getting railed.</p>\n<p> </p>\n<p>He looked up. Lan Zhan was already looking back at him. There was a little red mark on his throat, just above the collar of his robes. His face was doing the soft thing. He was so handsome in the winter dawn, this bearer of light, this strange, steadfast heart. Husband. Wei Wuxian’s husband. </p>\n<p> </p>\n<p><em> I’ll tell you everything, </em> Wei Wuxian thought. <em> I want you to know about me. I want to know about you. </em></p>\n<p> </p>\n<p>Later, though. They had time.</p>\n<p> </p>\n<p>Wei Wuxian swallowed his mouthful of spicy pork bun. He brushed the crumbs off his robes and shook out his sleeves. “Okay, Lan Zhan,” he said, grinning at Lan Zhan across the table. “Okay, my love. Let’s figure this thing out.”</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p align=\"center\">\n<small>END.</small>\n</p>\n<p align=\"center\"> </p>\n<p align=\"center\"> </p>"
}