{
  "id": "23161111",
  "url": "https://archiveofourown.org/works/23161111?view_full_work=true",
  "author": [
    "sospes"
  ],
  "title": "Patterns of Behaviour",
  "rating": "Explicit",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Wiedźmin | The Witcher - All Media Types",
    "The Witcher (TV)"
  ],
  "relationships": [
    "Geralt z Rivii | Geralt of Rivia/Jaskier | Dandelion",
    "Geralt z Rivii | Geralt of Rivia & Yennefer z Vengerbergu | Yennefer of Vengerberg",
    "Jaskier | Dandelion & Yennefer z Vengerbergu | Yennefer of Vengerberg"
  ],
  "characters": [
    "Geralt z Rivii | Geralt of Rivia",
    "Jaskier | Dandelion",
    "Yennefer z Vengerbergu | Yennefer of Vengerberg"
  ],
  "additional_tags": [
    "Tropes",
    "5+1 Things",
    "Bathtubs",
    "Animal Transformation",
    "Wolf!Geralt",
    "There Was Only One Bed",
    "Fuck Or Die",
    "Kidnapping",
    "hurt!Jaskier",
    "immortal!jaskier",
    "This Is Callimachean Bullshit",
    "Fluff",
    "Humor",
    "A little angst",
    "Idiots in Love"
  ],
  "language": "English",
  "series": "",
  "published": "2020-03-15",
  "completed": null,
  "words": "5,785",
  "chapters": "1/1",
  "comments": "538",
  "kudos": "12,271",
  "bookmarks": "1,836",
  "hits": "66,148",
  "summary": "<p>Over the years, Yennefer notices that Geralt and Jaskier’s life can be really bloody weird at times.</p>\n<p>Alternative summary: five Geraskier fandom tropes that our boys find completely normal, and one that isn’t at all.</p>",
  "notes": "<p>Okay, this fandom is tropey as fuck, and don’t get me wrong, I love it, but it’s just hilarious to me how we have so many versions of the same story! This isn’t intended to bash anyone at all, far from it - I’ve written most of these tropes myself, in one form or another. (Hurt!Jaskier, anyone??) So this fic is my self-indulgent way of poking fun at our collective fandom obsession with there only being one bed, with sharing baths, and with Geralt getting turned into a wolf. Among other things!</p>\n<p>Edit: There is now a podfic of this fic available <a href=\"https://archiveofourown.org/works/23216701\" rel=\"nofollow\">here</a>, by the wonderful reena_jenkins!</p>",
  "text": "<p>\n<i>one.</i>\n</p>\n<p>Yennefer is in Novigrad, browsing a pile of expensive furs at a market stall. The furrier keeps eyeing her not-so-subtly, trying either to peer down her cleavage or to figure out whether or not she’s going to buy anything, but she’s unperturbed: she runs her fingers through a snow-white pelt that feels like fox fur, then says, “How much for this one, and for the mink?” </p>\n<p>The furrier picks up the fox, hefts it thoughtfully. “One hundred for this one,” she says, and “fifty for the mink. But for you? Together?” He deliberates showily. “One twenty-five, all in.” </p>\n<p>“One hundred for both,” Yennefer says flatly. </p>\n<p>“One twenty.” </p>\n<p>“One hundred,” Yennefer repeats, “and I won’t tell the last couple who bought from you that that glorious wolf pelt they’re going to show to their fancy friends is actually from a stray dog you caught on the harbour front two days ago.” </p>\n<p>The furrier eyes her. “One ten.” </p>\n<p>“Done,” Yennefer says, and hands over the coin. </p>\n<p>It’s nearly evening, now, the summer sun sliding down low in the sky, and Yennefer makes her way through the narrow, cobbled streets to a tavern with the surprisingly evocative name of The Whispering Wind. She’s heard rumours that there’s a white-haired Witcher staying here, fresh from some adventure or other in the countryside around the city, and, well, she only knows one white-haired Witcher. </p>\n<p>Heat stirs in the pit of her stomach. </p>\n<p>The innkeeper of The Whispering Wind greets her with a respectful nod when she enters his establishment. “Madam Sorceress,” he says. “It’s an honour that you have graced me with your patronage. How may I help you?”</p>\n<p>The obsequiousness grates Yennefer’s teeth. “Geralt of Rivia is staying here,” she says, not a question. “Where is he?”</p>\n<p>The innkeeper struggles for a second, then clearly realises that there’s not much point in arguing privacy laws with Yennefer of Vengerberg. “Upstairs,” he says. “The room at the end of the corridor.” </p>\n<p>“Thank you,” Yennefer says, offering him a smile. “And a glass of Est Est, please.”</p>\n<p>Wine in hand and furs thrown over her shoulder, Yennefer climbs the stairs. There’s a single corridor of rooms up here and she steps casually along to the end, heels snapping against the wooden boards. She doesn’t bother knocking on the door at the end, just turns the handle and opens it, knowing that, whatever state of undress Geralt is in, he’ll be happy to see her. </p>\n<p>The door opens, and she blinks. </p>\n<p>Geralt’s in the bath. In and of itself, that’s not particularly surprising: he’s a Witcher, he gets dirty, therefore he needs to bathe more regularly than most otherwise he gets… a little ripe. And not all baths can be the bath that Yennefer shared with him in Rinde, marble-sculpted, set into the floor, large enough for five or six people if you squashed together – so currently Geralt is in The Whispering Wind’s wooden tub, barely long enough for him to stretch out his legs, his arms resting along the wooden edges, scarred skin bare to the warm air. </p>\n<p>And his bard is in the tub with him. </p>\n<p>Both men look up as Yennefer opens the door, confusion on the bard’s face, wariness on Geralt’s. Both melt into identical expressions of surprise when they see its her – and, to be honest, Yennefer imagines she’s probably wearing a similar expression herself, because they’re sharing a bath? Close enough that their knees must be touching? Suds in the bard’s hair, a cloth in the Witcher’s hand? </p>\n<p>“Yen?” Geralt says, making no move to get out of the bath. </p>\n<p>His bard eyes her with his usual trepidation. “If she comes any closer, I’m going to need you to protect my virtue, Geralt,” he says, full of his usual sarcasm, then goes back to rinsing out his hair. </p>\n<p>Geralt just hums, still frowning at Yennefer. “Do you need something?”</p>\n<p>“You’re sharing a bath,” Yennefer says, tone oddly flat. “With the bard.”</p>\n<p>The bard snorts. “I have a name.” </p>\n<p>Geralt seems confused. “I shared a bath with you in Rinde,” he points out. </p>\n<p>The bard wags a finger at her. “There’s no more room in this tub,” he says. “If you want to wash, Georgi downstairs is a lovely chap. I’m sure he’d be happy to organise you another.” </p>\n<p>Why are they acting like this is completely normal? Two grown men who, as far as Yennefer is aware, aren’t sleeping together, crammed together in a bathtub that’s barely big enough for one – and they’re acting like <i>she’s </i>the weird one. </p>\n<p>Yennefer figured she’d come find Geralt, have a few rounds of fantastic sex, then go back to her life. She wasn’t prepared to deal with whatever the fuck is going on here. </p>\n<p>“I’m staying at The Golden Hind, Geralt,” she says. “If you want, come find me after you’re done washing your bard.” </p>\n<p>The bard makes an offended noise. “One, I’m not his bard,” he snaps, turning round in the bath to face Yennefer more fully. “Two, my name is Jaskier, and you must be the only member of high society who doesn’t know that. Three, I wash myself, thank you very much. Four, if anyone gets washed in these situations, it’s Geralt. Five? Go away, witch, and leave us to our bath in peace.” </p>\n<p>Yennefer rolls her eyes, turns her back, and leaves them to their bath. </p>\n<p> </p>\n<p>\n<i>two. </i>\n</p>\n<p>The woods outside Vengerberg are quiet this early in the morning, the only sounds the birds singing merrily in the trees and the soft trickle of a nearby brook. Yennefer is rummaging through the undergrowth, searching for a particular strain of purple-flowering yarrow that she <i>swears</i> used to grow around here when she was young – although, admittedly, that was several decades ago now, so it’s entirely possible that it’s died out by now. It’ll be perfect for the spell she’s working on, though, so she keeps on looking. </p>\n<p>After a little while, a new sound breaks through the peace of the trees. The clopping of hooves, slow and languorous, accompanied by the soft strumming of some kind of stringed instrument – and then, floating over the top, the stop-start singing of someone in the middle of composing a song. </p>\n<p>Yennefer gets to her feet, cracks her shoulders, and heads towards the road. She’s met Geralt’s bard enough times by now that she recognises his voice – and she knows their pattern well enough to know that where you find the bard, you usually find the Witcher, too. </p>\n<p>The path through the Vengerberg woods is narrow and rutted, mainly used by wagons trying to avoid the better maintained toll road a few miles to the east and by travellers who like to take the scenic route. Currently, there’s a single horse trotting towards Yennefer, a single horse led by a single man wearing a doublet made of an exceptionally bright yellow silk. It’s Jaskier, of course, his forehead creased as he mumbles to himself, fingers fluttering across the strings of his lute – and Yennefer frowns, because she recognises the horse walking behind him as Geralt’s horse, but Geralt himself is nowhere to be seen. </p>\n<p>“Witch!” Jaskier greets brightly, finally catching sight of her. “What brings you here on this fine spring day? Lying in wait for us in the woods?” </p>\n<p>“Hardly, bard,” Yennefer says, faintly amused despite herself. “This is Vengerberg. I’ve been living here.”</p>\n<p>“Ah, of course,” Jaskier nods, plucking a cheery chord from the strings of his lute. “The wandering witch who always comes home in the end. There’s probably a song in that.”</p>\n<p>“No, there isn’t,” Yennefer says flatly. “Where’s Geralt? Or have you just stolen his horse?” </p>\n<p>At which point, a wolf with dazzlingly white fur and gleaming golden eyes emerges from behind the bard and the horse. Yennefer’s heart thuds so loud in her ears for a second that she can barely breathe, but then Jaskier glances down at the wolf with an affectionate expression and she sees that it has the horse’s halter gripped in its jaws – and, oh, shit. “Geralt?” she asks, a little strangled. </p>\n<p>The wolf makes a rumbling sound in its throat and looks up at Jaskier. </p>\n<p>“Present and accounted for,” Jaskier says, surprisingly chirpy given that apparently his friend has been turned into a wolf. </p>\n<p>Yennefer stares at them. “What happened?” </p>\n<p>“I would have thought that was fairly obvious,” Jaskier says. “Geralt got turned into a wolf.” Wolf-Geralt makes a noise halfway between a howl and a growl. “By a sorcerer,” Jaskier clarifies, seemingly in response, “who’d had a bit too much to drink and thought it would be funny.” </p>\n<p>“So you came to find me?” Yennefer asks. “To turn him back?” </p>\n<p>“Nah, it’ll wear off in a week or so,” Jaskier says. “It usually does.” He’s interrupted by Geralt nudging at his ankle, and he looks down, says, “What?” As Yennefer watches, more than a little confused, Geralt props his paws up on Jaskier’s thigh and presses the horse’s halter into his hand, then jumps down and comes to sniff at the hem of Yennefer’s dress. He circles her a few times, still sniffing, then howls quietly and goes back to Jaskier, who promptly hands the halter back. </p>\n<p>The horse just stands there, quietly unimpressed by the whole thing. </p>\n<p>Yennefer finds her tongue. “Usually?” she echoes. “Has this happened before?”</p>\n<p>“Once or twice,” Jaskier says, then Geralt rumbles again and he adds: “To both of us. Although I tend to get turned into a bird. You know, because I’m a bard? It’s songbirds and larks for me, wolves for Geralt.” He sniffs. “Never let it be said that the Continent’s sorcerers lack originality.” </p>\n<p>Yennefer frowns. “You don’t seem particularly worried by this.” </p>\n<p>“Should I be?” </p>\n<p>“Geralt is currently a wolf,” Yennefer says flatly. “I would think that would be a <i>little</i> concerning.” </p>\n<p>Jaskier shrugs again. “I suppose you can get used to anything,” he says, and looks down at Geralt. “Wouldn’t you agree?” Wolf-Geralt makes that rumbling noise again, and Yennefer realises with a start that it’s the lupine version of his usual hum. “Quite,” Jaskier says, then flashes Yennefer a smile. “If it’s alright with you, Lady Sorceress, I’ve got a performance booked a couple of towns over. We need to get going.” </p>\n<p>“Sure,” Yennefer says. “You sure you don’t want me to turn him back?”</p>\n<p>Geralt growls, yellow eyes bright. </p>\n<p>“Between you and me, I think he actually quite likes being the wolf,” Jaskier says. “He’s always pretty grumpy after he turns back. Grumpier than usual.” </p>\n<p>“Right,” Yennefer says slowly. </p>\n<p>“Well, we’ll see you around!” Jaskier says, and wanders off down the path through the Vengerberg woods. Geralt trots along at his heels, leading his horse—who is remarkably unperturbed by the whole scenario—and Yennefer stands there for a long moment, hands on her hips, yarrow forgotten, just watching them go. </p>\n<p>The next time she meets them, Geralt is riding along the road to Cintra with a brightly-coloured songbird perched on his shoulder, trilling happily in the warm evening air. </p>\n<p>Yennefer doesn’t even bother asking. </p>\n<p> </p>\n<p>\n<i>three. </i>\n</p>\n<p>“This will do,” Geralt says, hood pulled up over his head as some paltry protection against the driving rain. He turns Roach’s head towards the tavern, towards the brightly-lit windows and the sound of muted chatter, and Yennefer pulls her cloak tighter around herself and nudges her grey palfrey in the same direction. Jaskier’s trudging beside them on foot, mud splattered up his typically weather-inappropriate green silk trousers, and it’s indicative of quite how exhausted he is that he doesn’t say a word. </p>\n<p>Yennefer will just be glad to get out of these wet clothes as soon as possible. </p>\n<p>The tavern is rickety and shambling, a small handful of locals sitting inside and a sign advertising an even smaller handful of rooms for hire. “Only one left, I’m afraid,” the owner says, handing Geralt a rusty iron key. “There’s a fireplace, though, and a few logs. Should warm you up after the storm.” </p>\n<p>“Thank you,” Geralt says, nodding slightly. Jaskier still hasn’t spoken, Yennefer realises, huddled silently under his cloak, and he follows Geralt towards the stairs, lute bumping carelessly against his back. </p>\n<p>Yennefer pauses at the bar for a moment, hands the owner another few coins. “Ale for them, wine for me, food for all of us,” she says, and the owner nods his acquiescence. </p>\n<p>The room is small but surprisingly clean, and by the time Yennefer arrives Geralt’s already got a fire going in the grate. Jaskier strips off his wet clothes wordlessly, then, just in his smallclothes, sits as close to the merrily crackling fire as he can, slowly rubbing feeling back into his skin, flushed red from the cold. “Fuck,” he finally grinds out through chattering teeth. “That’s the last time we go hunting drowners in storm season, Geralt.” </p>\n<p>“He has a point,” Yennefer quips, settling her bags down beside one of the room’s two narrow single beds. “You were both about to end up drowned yourself before I stumbled across you.” </p>\n<p>“See?” Jaskier says, not looking away from the fire. “The witch agrees. I must be on to something.” </p>\n<p>Geralt is unbuckling his armour, piling it in a corner and then shucking the worst of his wet clothes. The room is starting to smell distinctly fusty so Yennefer twitches her fingers, whispers a spell, and dries off their clothes with a thought. She shouldn’t really use her magic for such trivial purposes, not when she’s as tired as she is, but she has no desire for the bard to catch a damn cold and spend the next few days sniffling and complaining. He’s only human, after all. </p>\n<p>There’s a knock at the door, and a barmaid appears with a tray. She brings them two ales, a glass of red wine that’s actually not that disgusting, and three bowls of pottage, thick and oily. They eat ravenously, Jaskier still pretty much naked, Geralt shirtless, Yennefer perfectly put together, of course, but she has the benefit of magic so she’s not going to unduly criticise them. The food is filling, the drink alcoholic, and before long the tension of the cold has all but left Yennefer’s bones. Now, she’s just tired. </p>\n<p>“We should sleep,” Geralt says, setting his bowl aside. “We’ve got a long journey tomorrow, and the storm doesn’t look like it’ll let up any time soon.”</p>\n<p>“Great,” Jaskier grumbles. “More rain.”</p>\n<p>Yennefer cocks an eyebrow. “Maybe if you wore more appropriate clothes?” she jibes, but there’s no real heat behind it. </p>\n<p>“Says you, black velvet dress with a white lace trim,” Jaskier jibes back, just as toothless. There’s a lick of humour in his eyes. “I just don’t have the ability to magically dry my clothes with a click of my fingers.” </p>\n<p>“Maybe you should have thought of that in advance,” Yennefer suggests. “Besides, I dried your clothes, too.” </p>\n<p>“True,” Jaskier says, and meets her gaze. “Thanks for that.” </p>\n<p>It’s unexpectedly sincere. Yennefer is going to chalk that up to the bard being too tired for his own good. “I’m having this bed,” she says, taking a seat on the worn blankets and starting to remove her boots. “You two can fight over the other one.” </p>\n<p>“There’s room for both of us,” Geralt says, similarly kicking his boots into the corner. </p>\n<p>Jaskier’s already digging himself in under the blankets, drawing them up around his ears. His mussed, still-damp hair is a birds nest across the pillow, but Geralt doesn’t seem particularly fazed as he settles in alongside his bard. Yennefer watches, surprised, as they fit themselves together in the narrow space: Geralt’s arm is around Jaskier’s shoulders, Jaskier’s hand slung across Geralt’s waist, their legs clearly tangled together under the blanket. It’s almost frighteningly intimate, and—<i>again</i>—they’re treating it like it’s the most normal thing in the world. </p>\n<p>As far as Yennefer knows, they’re still not fucking. </p>\n<p>Geralt glances over at her. “Yen?” he asks. “You okay?” </p>\n<p>Jaskier’s head rises from Geralt’s chest. “You do look a little peaky,” he says, frowning. “Do sorceresses get colds?” </p>\n<p>“I’m fine,” Yennefer answers, slipping beneath the blankets of her own bed. “Go to sleep, bard.” </p>\n<p>Jaskier huffs, but after a moment his head drops back down to rest on Geralt’s chest. He’s dozing in seconds, his breath slowing, features lax – and Yennefer spends a long, long moment watching Geralt, as he accommodates Jaskier’s sleeping twitches, as his arm wraps more securely around Jaskier’s shoulders, as the expression on his face softens, just a little. </p>\n<p>Yennefer thinks she might be starting to understand. </p>\n<p>“Yen?” Geralt asks, barely audible over the crackling of the fire. </p>\n<p>“Nothing,” Yennefer says, swathes herself in the threadbare blankets, and goes to sleep. </p>\n<p> </p>\n<p>\n<i>four. </i>\n</p>\n<p>Yennefer’s sharing a jug of vinegary wine with Jaskier in a tavern in Temeria. This has become a surprisingly unsurprising event in her life, lately, and—not that she’d ever admit it—but she’s actually starting to enjoy the bard’s company. He’s funny, once you get past the idiocy and crassness, and loyal to a fault. She’s seen him smash more than one ceramic tankard over the head of the latest farmhand who dared insult the White Wolf in his hearing. </p>\n<p>It’s almost endearing. </p>\n<p>Jaskier’s in the middle of a rambling anecdote involving the Countess de Stael and six chickens when the door to the tavern smashes open and Geralt comes thudding in. There’s blood on his face and something that looks like viscera in his hair, and he slams a hunk of hair and flesh down on the alderman’s table, says, “It’s done.” </p>\n<p>The alderman fumbles with the promised purse, but Geralt just snatches it out of his hand and comes towards Jaskier and Yennefer’s table. Which is when Yennefer notices it: there’s a tension thrumming through his body, electric and frantic, pulsing in his eyes and his gait and his breathing. </p>\n<p>Still seated across from her, Jaskier sighs sharply and finishes off his wine. “Again?” he asks, high-pitched and a little petulant. “This is the third time this month, Geralt.” </p>\n<p>Geralt just makes a little animal noise in the back of his throat, fists his hand in the neck of Jaskier’s doublet, and drags him bodily up the stairs to their room. Jaskier doesn’t seem too surprised about this turn of events, for some reason – which really should have warned Yennefer, to be honest, because the things that this pair find normal are just so deeply, intimately <i>not </i>that she’s sort of given up trying to figure them out. </p>\n<p>She follows them upstairs anyway. </p>\n<p>Their room is across the hall from hers, the door still open. She goes in and closes it behind her, then studies Geralt warily, the sallow paleness of his skin, the hitching of his breath. “What’s wrong with you?” she asks. </p>\n<p>Geralt bares his teeth. “Incubus.”</p>\n<p>Yennefer frowns, but Jaskier just barks a laugh. “<i>Again? </i>That’s the same as last week!”</p>\n<p>“There’s a lot of incubi around at the moment,” Geralt grinds out. He’s bent over, hands gripping his thighs so tight it makes Yennefer’s hands hurt in sympathy. </p>\n<p>Jaskier sighs. “Which way around?” </p>\n<p>“You to me,” Geralt answers shortly. </p>\n<p>“I’ll get the oil,” Jaskier says, and starts rummaging around in his pack. </p>\n<p>“What’s going on?” Yennefer asks, a little sharply. </p>\n<p>Jaskier glances up at her as, somewhat unexpectedly, Geralt starts pulling his armour off with jerky motions. “Geralt got bitten by an incubus,” he says, matter of fact and straightforward. “Don’t know how familiar you are with this particular magical subspecies, my dear sorceress, but the effect an incubus’ bite has on a Witcher of Kaer Morhen is, well, fatal. Heart palpitations, vomiting, death. That kind of thing.” </p>\n<p>“He’s dying?” Yennefer asks, taking a stumbling step forward. </p>\n<p>“Nope,” Jaskier answers, “because I have the cure!” He retrieves a stoppered vial of oil from his pack, brandishes it like a weapon. “You may want to leave the room for this bit.” </p>\n<p>Yennefer eyes the vial. “Is it magical?” </p>\n<p>Jaskier snorts. “Oh, I think so,” he says brightly. “It can surely cast a mighty spell. It’s mesmerising, you might say, when unsheathed.” </p>\n<p>Geralt groans, full of pain and something else that Yennefer can’t immediately identify. “The cure,” he growls, “is for him to fuck me.”</p>\n<p>“Like I said,” Jaskier says. “<i>Magical</i>.” </p>\n<p>Geralt is by this point completely naked. He kneels on the bed, gripping the sheets with shaking hands, and Jaskier, apparently unfussed by Yennefer’s presence, gets to work, unstoppering the vial and slicking up his fingers. Geralt lets loose a guttural moan as Jaskier spreads him open with a brisk, practical efficiency that tells Yennefer quite clearly that this isn’t the first time he’s done this. “How many times has this happened?” she asks.</p>\n<p>Jaskier doesn’t glance up from his task, three fingers buried in Geralt’s arse. “You lose count after a while,” he says. “Although it has been ridiculous lately. Seriously, Geralt, you know there are easier ways to get me into bed than poisoning yourself every few weeks?” </p>\n<p>Geralt just makes an incoherent noise. </p>\n<p>Jaskier withdraws his fingers, unlaces his trousers, and glances at Yennefer. “Are you just going to watch?” he asks. “Not that I mind, but it’s a bit weird that you’re just standing there like that.”</p>\n<p>“<i>Jaskier</i>,” Geralt barks. </p>\n<p>“Yeah, sorry,” Jaskier says, strokes his hard cock a few times with oil-slick fingers, and proceeds to fuck Geralt with a precision and attentiveness that Yennefer didn’t expect. Geralt comes astonishingly quickly, groaning his orgasm into the pillows, momentarily silent – and Yennefer frowns. “Is that it?” she asks. “Is he cured?” </p>\n<p>Jaskier laughs, cheeks flushed, still pretty much fully dressed. “Not exactly,” he says, still buried deep in Geralt’s arse. “With an incubus’ bite, it’s usually a four or five orgasm kind of thing. Certain aphrodisiac pollens it’s just one or two, and we came across this big worm monster once whose saliva was seven—gods, that was a long day—but an incubus is going to take a bit more work than this. It’ll probably take most of the night.” </p>\n<p>Yennefer blinks. “You’re going to fuck him all night?”</p>\n<p>Jaskier shrugs. “I’ll fuck him a few times, and then he’ll probably turn it round on me for a bit. A few handjobs, maybe a blowjob. Whatever he needs.” His voice is oddly soft towards the end. </p>\n<p>“Whatever he needs,” Yennefer echoes. </p>\n<p>“You going to stick around?” Jaskier asks. “You don’t need to worry about him, Yennefer. He’s in safe hands.” </p>\n<p>Geralt moans, voice rough. “Jaskier,” he says, needy, trusting. </p>\n<p>Jaskier strokes his hand down Geralt’s back. “Just hold on,” he says soothingly. “You’ll be okay. I’ve got you.” – and it’s bizarre and absurd, a bard medically fucking a Witcher to save his life, but at the same time it’s so intimate that Yennefer feels like she’s intruding. </p>\n<p>“I’ll leave you to it,” she says. “I’ll be across the hall if you need me.”</p>\n<p>Jaskier flashes her a smile. “Thanks, witch,” he says, jokingly affectionate. </p>\n<p>“Any time, bard,” Yennefer responds, and means it. </p>\n<p> </p>\n<p>\n<i>five. </i>\n</p>\n<p>“Jaskier’s been taken.” </p>\n<p>Geralt’s rigid in the doorway to her house in Novigrad, shoulders hunched, jaw set. His eyes are wide and wild, yellow as the setting sun, and Yennefer knows without a second’s pause that he needs her help. “When?” she asks, ushering him inside, closing the door behind him. </p>\n<p>“I last saw him in the market two days ago,” Geralt says, gruff and taught. “I was leaving the city to go on a hunt, and he said he’d meet me back in the inn tonight.” </p>\n<p>“He’s not there?” </p>\n<p>“He’s not there,” Geralt says, and throws a folded slip of parchment on the table. “This was.” </p>\n<p>Yennefer picks it up, and she doesn’t need to be a Witcher to know that the fingerprints smeared across the folds are made in blood. She unfolds it. “Tomorrow morning, the Harsdan graveyard,” she reads. “Five hundred crowns.” </p>\n<p>“It’s his handwriting,” Geralt says tightly. “And it’s his blood.” </p>\n<p>Yennefer frowns. “How do you know?” </p>\n<p>“I know the smell.” </p>\n<p>There’s something halfway between tragic and comic in that admission, but this isn’t the time to address it. “They made him write his own ransom note.” </p>\n<p>“They often do,” Geralt says tightly. </p>\n<p>Yennefer frowns at him, then decides to come back to that later. “Do you have any idea where they took him?” she asks. </p>\n<p>Geralt shakes his head. “I was hoping you could track him,” he says. “With the blood. It’s relatively fresh, only a few hours old.” </p>\n<p>Yennefer grimaces. “Blood magic is unpredictable,” she says. “I can’t guarantee an accurate location.” </p>\n<p>“It doesn’t have to be accurate,” Geralt says. “Give me an area of the city, and I can track his scent. I’ve done it before.” </p>\n<p>Yennefer pauses, stares at him. “You’ve rescued Jaskier from kidnappers before?”</p>\n<p>“Several times,” Geralt says, like it’s obvious. </p>\n<p>Yennefer sighs. “Of course you have,” she says, and gets to work. </p>\n<p>The spell indicates an area of Novigrad known for its criminality and its lack of common sense – the exact kind of place where the idiots who decided to try to extort a Witcher would live. Yennefer goes with Geralt, trading her fur stole for a tough leather coat, and watches as he practically sniffs his way around the narrow streets, stalking like he’s tracking his prey. Which, in a way, Yennefer supposes, he is. </p>\n<p>Geralt’s hackles raise, and he stops in the middle of an alleyway, head turning towards a low, dark door tucked away in the corner. </p>\n<p>“Geralt?” Yennefer asks quietly. </p>\n<p>“He’s hurt, Yen,” Geralt says shortly, and an unexpected surge of worry rises in Yennefer’s heart. “Badly.” He bares his teeth. “They were never planning on giving him back to me alive.” </p>\n<p>Yennefer takes a breath. “Go to him,” she says, and feels her fists tighten at her sides. </p>\n<p>She stays back as Geralt barrels in through that low, dark door, stays in the street as the screams and shouts come pouring out from inside, stays in the street as the violence comes to a halt, stays in the street until she hears Geralt’s bellowed, “<i>Yen</i>.” Then she goes inside, because she knows better than to get in the way of Geralt when he’s going after someone he, what? Travels with? Lives with? Shares meals and beds and baths with? </p>\n<p>It only takes Yennefer a glance to see that Jaskier is in a bad way. He’s unconscious, slumped against Geralt’s shoulder, blood pouring from three neat stab wounds in his body, one in his shoulder, one in his arm, and one in his thigh. It’s the thigh wound that’s the problem, gushing rather than oozing, which means whatever careless blade was driven in there probably nicked an artery. “Shit,” Yennefer bites off, kneels beside the fading bard, and gets to work. </p>\n<p>The energy required to stem the flow of the blood, to close the seam of the artery, to knit the flesh back together, is considerable. Yennefer can’t do it all at once, not by herself, so she gets to the point where the wound in his leg is a raw, bloody gash that isn’t going to make him bleed out, and then stops. “Back to my house,” she says, catching her breath, blood on her hands. “He’s stable, now, but we need to see to his other wounds. This place isn’t exactly… hygienic.” She glances around, at the cobwebbed walls and dirty floors, the piles of mouse droppings and the human bodies scattered at unnatural angles. “Infection could still kill him.” </p>\n<p>Geralt nods. “Do you have medical supplies at your house?” </p>\n<p>“I do,” Yennefer says. “We’ll take him there.” </p>\n<p>If a bloody Witcher, an exhausted sorceress, and an unconscious bard are an unusual sight to the citizens of Novigrad, none of them really show it. They’re mercifully unmolested on their way through the city, and before long they’re laying Jaskier out on Yennefer’s kitchen table, Geralt sliding a pillow from the sofa under his head and Yennefer pulling open his bloody clothes to allow herself better access to his wounds. </p>\n<p>Which is when she sees it.</p>\n<p>Jaskier’s torso is a mess of scars, old and new, stabs and slashes, burns and bruises. They’re crisscrossed over each other like a sewing pattern, interacting like ley lines, and Yennefer reaches out, traces her fingertips over a long, pink scar stretching across his right hip, clearly only a month or so old. </p>\n<p>“Yen?” Geralt asks, frowning at her. </p>\n<p>Yennefer’s mouth is dry. “What the fuck happened to him?”</p>\n<p>Geralt frowns. “He was kidnapped,” he says. “We rescued him.”</p>\n<p>“No, Geralt, I know what happened <i>today</i>,” Yennefer snaps. “I’m asking what happened to make your fucking <i>bard </i>carry more scars than some soldiers do? Gods, he looks like he’s been torn apart.” </p>\n<p>Geralt’s jaw is tight. “People have learnt that he’s my friend,” he says. “So they try to take him from me. And he doesn’t keep his mouth shut when he should, so they hurt him, more often than not.” </p>\n<p>Yennefer just stares at him, astonished. </p>\n<p>On the table, Jaskier stirs. “Geralt?” he says, sluggish and limp. </p>\n<p>Geralt is at his side in a moment, pressing a hand gently into his uninjured shoulder. “You’re safe,” he says, brushing sweat-slicked hair back from Jaskier’s face. “They’re dead.”</p>\n<p>Jaskier groans, hands fluttering away from the table until Geralt carefully presses them down. “My shoulder,” he rasps. </p>\n<p>“You were stabbed several times,” Yennefer says, collecting herself enough to fetch a bowl of water and an antiseptic salve. “I need to clean the wounds. It’ll hurt.” </p>\n<p>Jaskier’s forehead scrunches almost drunkenly. “I know,” he sighs, his head rolling towards Geralt’s hand. “This isn’t my first time.” </p>\n<p>Yennefer grits her teeth. “Hold him still, Geralt,” she instructs, and gets to work. </p>\n<p>Jaskier bears the pain surprisingly well – or, well, not so surprising when Yennefer looks at the tapestry of scars worked across his skin. He breathes steadily, evenly, nostrils flaring as Yennefer packs his wounds with healing herbs and wraps them in clean bandages, and Geralt never leaves his side, hands pressed against Jaskier’s skin, half restraint, half comfort. Yennefer watches them as she works, the protectiveness in Geralt’s hands, the trust in Jaskier’s laxity, and all of a sudden, it dawns on her. They don’t know. They haven’t realised, despite everything. They haven’t worked it out. </p>\n<p>Yennefer washes her hands when she’s done, scraping the blood and medicines out from under her nails, then puts away the rest of her supplies and goes back to the idiots in her kitchen. They’re talking quietly, Geralt’s hands hovering above Jaskier’s unhurt shoulder, Jaskier’s gaze following him like a flower following the sun, and Yennefer goes to them, folds her arms and eyes them both. “You do know,” she says flatly, and the two of them snap to face her immediately, “that you’re both hopelessly in love with each other?” </p>\n<p>Jaskier flushes bright red, and Geralt just stares at her like a startled deer. </p>\n<p>Yennefer does not have time for their shit right now. “I’m going out,” she says shortly. “I’ll be back in the morning. I expect you to have actually <i>talked</i> about your fucking feelings by then, because I’ve seen the pair of you dancing around each other like idiots all across the Continent for too many years now. I’m sick of it. You love each other. Work it out.” </p>\n<p>And she turns on her heel, and leaves them to it. </p>\n<p> </p>\n<p>\n<i>and one more. </i>\n</p>\n<p>After the war, after all the pain and heartbreak, Yennefer meets Geralt and Jaskier in a field of sunflowers just outside of Oxenfurt. They’re sitting on a picnic blanket, of all things, with a wicker hamper full of wine and cheese sitting between them – and Yennefer joins them with a sigh, accepts a glass of red, and settles in to enjoy the late summer sun. </p>\n<p>They talk about inconsequential things, about the price of salmon, the height of the university’s astronomical observatory, the politics of cartography, and then they talk about their lives. Jaskier has been offered a professorship, and he’s going to take it. Geralt is going to take a break from witchering for a little while, maybe train some more with Ciri, maybe just rest. And Yennefer is going back to Vengerberg. </p>\n<p>Jaskier flashes her a knowing smile. “The wandering witch who always goes home in the end,” he says, and tops up her glass. </p>\n<p>They talk some more, and drink some more, and remember. The sun moves through the sky, slow and lazy, and the crickets buzz in the fields around them, the swallows chirp overhead, the wagons travel along the rutted path just out of sight. It’s a bucolic caricature and Yennefer doesn’t think she’s felt this peaceful in years. </p>\n<p>Jaskier falls asleep, a little before dusk, his cheeks flushed with wine and exhaustion. His head rests in Geralt’s lap, one long-fingered hand curled loosely around Geralt’s ankle, and Yennefer watches Geralt run his fingertips slowly through dark hair that’s just beginning to be touched with silver. “He’ll suit teaching,” she says. “And his students will love him.” </p>\n<p>Geralt hums his agreement. </p>\n<p>Yennefer studies him. “Will you stay with him?” </p>\n<p>“For a time,” Geralt answers, after a moment. “I don’t know how long.” His fingers still on the greying streaks at Jaskier’s temples. “But he can’t travel with me, anymore,” he says, regret twisting his voice. “He’s older than he once was.” </p>\n<p>Yennefer smiles, just a little. “He ages slower than most humans,” she says wryly. “The same at forty as at thirty. Excepting a few more dozen scars, of course.” Geralt has the good grace to look vaguely guilty. “I half-wondered if he might have elven blood in his family tree,” Yennefer says. “Or a dash of fae. Enough to give him a little immortality.” </p>\n<p>Geralt’s lips curl in a soft smile. “He’s all human,” he says, then snorts. “Ask him about his skincare regime sometime. He swears by it.” </p>\n<p>“Pity,” Yennefer says, softer. “I’ve grown to appreciate his company.” She’s silent for a moment. “I have to say, though, I think the grey suits him.” </p>\n<p>Geralt hums. “So do I.” </p>\n<p>“Will you stay with him?” Yennefer asks again, and they both know that she’s asking a different question, now, a harder question. </p>\n<p>Geralt holds Jaskier’s sleeping body with a tenderness that Yennefer never thought she would see at the hands of a Witcher. “Until the end,” he answers eventually, his thumb skimming across the shell of Jaskier’s ear, and the warm light of the sun catches in his pale hair. </p>\n<p>Yennefer sips her wine, closes her eyes, and listens to the birdsong, to the the rustle of the sunflowers, to the slow, steady whisper of Jaskier’s sleeping breaths.</p>"
}