{
  "id": "2323055",
  "url": "https://archiveofourown.org/works/2323055?view_full_work=true",
  "author": [
    "buu"
  ],
  "title": "i can do better",
  "rating": "Mature",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Haikyuu!!"
  ],
  "relationships": [
    "Hinata Shouyou/Kageyama Tobio"
  ],
  "characters": [
    "Kageyama Tobio",
    "Hinata Shouyou"
  ],
  "additional_tags": [],
  "language": "English",
  "series": "",
  "published": "2014-09-18",
  "completed": "2014-10-06",
  "words": "45,504",
  "chapters": "14/14",
  "comments": "577",
  "kudos": "10,082",
  "bookmarks": "1,993",
  "hits": "171,022",
  "summary": "<p>an accident leads to yet another weird competition (that's all it is, hinata tells himself)</p>\n<p>what's a little competition between friends?</p>",
  "notes": "<p>wellllll there was a serious lack of competitive dumb jerks trying to see who makes the other cum first and so i wanted to write that. i love the kind of relationship where kageyama and hinata don't realize they're in love until they have sucked each other off multiple times and everyone thinks they're already dating. “ψ(｀∇´)ψ</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>i tried writing kageyama's pov but realized i'm much more comfortable with hinata haha and rewrote the chapter... i've never really written explicit smut before but hopefully i will get there. anyway thank you for reading _:(´□`」 ∠):_ i also kind of want hinata to jerk off with kageyama's jacket LOL |･ω･｀) suga will probably be in the next chapter</p>\n<p>i want to say thanks for the comments!! i read them all and they make me really excited to continue writing this, i'm glad people have fun reading it ｡(*^▽^*)ゞ</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>i want to try to add a kageyama pov but i'm not sure!! also maybe some blowjobs -(๑☆‿ ☆#)ᕗ</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">notes</a>.)\n</p>\n<p>hopefully possessiveness coming up in the next chapter, because that's my favorite (*-`ω´- )人 also kageyama giving hinata a return blowjob?? i am actually a little surprised at how i'm able to regularly update this but it's thanks to your very kind reviews, i'm so happy there are people enjoying this (*＾▽＾)／ right now the smut is pretty fast because..they both have no stamina LOL i'm sorry</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">notes</a>.)\n</p>\n<p>this chapter ended up being kind of long!! longer than usual i think, and there's not that much smut.. ｡(*^▽^*)ゞ they'll step it up in the next chapter probably, though...i want to write some possessive kagehina! next chapter! thanks for reading and for your support, i appreciate your kudos and comments so much... (˘ʃƪ˘)</p>\n<p>thanks again for all the comments!! i'm very shy so i don't respond to all of them _:(´□`」 ∠):_ but i read them all and it makes me so happy and motivated to keep writing...i'm really glad people are enjoying my silly slow writing..i was a bit nervous posting at first but i'm glad i did...anyway here is the next chapter! ( ･ㅂ･)و ̑̑</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">more notes</a>.)\n</p>\n<p>sorry there's no actual sex yet, i feel so slow developing this but i promise it's coming and hopefully more than once in a few different scenarios!! hinata has started feeling a little possessive but i would like him to get even more so... \"kageyama is mine\" or something like that (*ﾉωﾉ) i felt it would be a little too soon for hickeys but those will come too..kagehina marking each other...!! (´ q ` ” )</p>\n<p>honestly don't like this chapter that much because there's no smut in it, just a lot of talking ;o; but i wanted to add the team...and do sort of an in-between chapter before they start to work up to more smut..<br>they'll show up more but i felt it was long overdue...a little plot development i guess..not that there is really much of a plot (一。一;;）</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_7_endnotes\">more notes</a>.)\n</p>\n<p>i have the next chapter planned out so hopefully it will be up tomorrow if i'm not too tired! <br>there will be more smut!! (#｀ε´#ゞ and finally possessive kageyama, which is my favorite. <br>and maybe some wet dreams ｡ﾟ(TヮT)ﾟ｡</p>\n<p>i hope they hurry up and work up to xxx..i liked the idea of asahi being roped into trying to talk to hinata and being horrified of what hinata brings up (*・艸・)</p>\n<p>THIS CHAPTER IS REALLY LONG!! _:(´□`」 ∠):_</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_8_endnotes\">more notes</a>.)\n</p>\n<p>thanks again for reading and all your comments...i hope they will work up to sex soon... (they will, very soon (*-`ω´- )人 )</p>\n<p>it got so out of hand that suga got left out of this chapter but he will be back in the next i hope along with the other boys. thank you for reading again..is kageyama too far into this?!?! (((╹д╹;))) well it's okay if he is because so is hinata...</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_9_endnotes\">notes</a>.)\n</p>\n<p>i am feeling a bit discouraged so i don't know when i'll be able to update next but hopefully sometime soon (@_@)</p>\n<p>sorry this took a bit to get up, ooh i'm feeling so uncertain about my writing lately..thank you so much for your kind words, i'm doing my best to power through and i hope people still enjoy this<br>tbh i had uploaded another chapter before this one but i really didn't like it so i deleted it lmao<br>:;(∩´﹏`∩);: i get pretty embarrassed to post my writing a lot and i always second-guess myself when i do post it because i don't know if it's good enough and i don't want to disappoint anyone!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_10_endnotes\">more notes</a>.)\n</p>\n<p>i hope they'll graduate to Real Sex really soon! Σ੧(❛□❛✿) i was also thinking about giving my personal tumblr to open up an opportunity for requests for one-shots but i like being a ghost as well</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_11_endnotes\">notes</a>.)\n</p>\n<p>so they're finally going to do it... at kageyama's house (〃￣ω￣〃ゞ i wonder how that will go</p>\n<p>hinata really needs to step up his game because kageyama's sucked his dick three times but i wanted kageyama's face to get messy...</p>\n<p>thanks again for your really sweet comments L(・o・)」</p>\n<p>!!!!!!!!!!!!!!!!!!!!!!!!!! this fic really went nowhere fast and i'm so sorry</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_12_endnotes\">more notes</a>.)\n</p>\n<p>i split it into two parts because this is going on 4k words and i left you with a cliffhanger..will they do it... (of course they will) (but how bad will it be)</p>\n<p>of course suga knows what kageyama and hinata are up to o(｀ω´*)o</p>\n<p>there might only be one or two chapters after this depending on how much i end up writing (⊙﹏⊙✿) probably just two!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_13_endnotes\">notes</a>.)\n</p>\n<p>the next chapter will probably be the last! thanks so much for reading my really mediocre writing and all the lovely comments people have left..if you have an idea you would like me to write feel free to tell me because i'm not sure what to write after this is done</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_14_endnotes\">notes</a>.)\n</p>\n<p>well that's it for now!! i'm sorry this is so..?? I'M STILL EMBARRASSED ABOUT IT _:(´□`」 ∠):_ i hope some of you liked it and thank you for all the wonderful comments, i hope to see you all again on the next fic i work on...maybe i will make a sequel i don't know, or start something new but if you have anything you would like to see me write please comment and i'll do my best!</p>\n<p>all your comments have made me so happy and i'm glad i could have someone enjoy something i wrote, and thank you for the kudos</p>\n<p>thank you again for sticking with me through these long 14 chapters..is it 14? i don't know...haha..i've never written a fic this long in my life... see you next time! <br>( ´ ▽ ` )ﾉ</p>\n<p>this was originally a one-shot but as i was writing it i realized it was going to be too long!! and i wanted to divide it into multiple chapters with kageyama and hinata amping up their competition to the very end. i'm usually not very motivated to finish things which is why i usually write one-shots, but if people enjoy this i will do my best ｡(*^▽^*)ゞ i'd like to include hinata and kageyama being ridiculously possessive of each other in the future...anyway thank you for reading! i probably will include some daisuga</p>",
  "text": "<p>It starts on a Monday.</p>\n<p>Hinata has never been too fond of Mondays, but he can't say that's anything abnormal. Class drags by as usual and the his notes fill up with poorly-drawn circles which he meant to be volleyballs (he imagines Kageyama's reaction to them-- “you can't even draw one properly by now?” and disrupts a math lesson with his snorting). It's a normal Monday, focus pinpointed on practice at the end of the day.</p>\n<p>When the bell finally rings and Hinata and Kageyama somehow find each other racing to the gym, nothing seems out of the ordinary at all. He loses, but even that is comfortingly familiar and they enter the gym bickering about how many losses it will take for him to finally give up (“you're only three ahead, jackass!”)</p>\n<p>Practice, in fact, goes swimmingly; Hinata and Kageyama are both on their game and Sugawara claps Hinata on the shoulder, telling him he's getting better at recieves and have you been training outside of practice again? He has, but it's not like anyone else needs to know that. He glances over at Kageyama, expecting a pointed Look over the extracurricular practicing that he's been roped into, but for once Kageyama isn't paying attention to him in the slightest. Instead, he's bowing a farewell and quickly shuffling off to change.</p>\n<p>Now this, Hinata is not expecting. Most days Kageyama stays behind with him to practice more; even though he grumbles about it, Hinata knows he's just as eager to improve. Maybe Kageyama wasn't feeling well? But they'd been so in-sync earlier, that couldn't have been it. Hinata vaguely registers Sugawara finishing up their (decidedly one-sided) conversation and turning away to discuss something with the captain, and takes his chance to bark out a hasty “good work today” and take off after Kageyama.</p>\n<p>Kageyama is still in the room, hunched over his bag in the corner and in the process of changing his shirt. He jumps when he hears Hinata enter, whipping his head around. Hinata pouts at the disinterested expression when Kageyama sees it's only him, but gets over it quickly when he notices the redness of Kageyama's face.</p>\n<p>“Kageyamaaa,” Hinata starts out, making his way over. “What's up, didn't you want to stay and toss to me today?” Hinata almost doesn't ask because of course Kageyama wants to toss to him. Why wouldn't he? But Hinata humors his friend's strange behavior and when he finally reaches him, claps both his hands on Kageyama's broad shoulders.</p>\n<p>Once again, Kageyama visibly jumps. “The hell do you think you're doing, dumbass?” he clips out, smacking one of Hinata's hands off his shoulders. </p>\n<p>There's no bite in his statement, so Hinata's hand finds his way back. He's just about to tell Kageyama exactly what he is doing (“trying to coerce you into tossing to me, what else?” when he hears voices approaching and the door opens, the rest of the team filtering in. After a brief glance, Hinata turns back to Kageyama to say something, maybe about today's practice or getting meat buns afterwards since today is Kageyama's turn to pay, but he stops short when he notices Kageyama's shoulders hunching almost imperceptibly under his hands. Was Kageyama actually feeling sick?</p>\n<p>Leaning down, Hinata tries speaking in his best whisper, which doesn't really differ much from his normal speaking voice, but everyone is noisy enough that it doesn't really matter. “Are you feeling sick or something?”</p>\n<p>Everyone would agree that Hinata isn't the most perceptive kid, but even he notices the hitch in Kageyama's breathing. Hinata frowns. Being sick could seriously hinder his and Kageyama's practice together, and Kageyama was definitely the type of person to deny it until he was on the verge of dying. After entertaining the brief thought of having to nurse Kageyama back to health on his death bed, Hinata tighten his grip on Kageyama's shoulders.</p>\n<p>“Should I tell the captain you're not feeling well?” He hopes Kageyama notes the definitely genuine concern for his well-being and not just their volleyball sessions. He amps up the pleading tone in his voice. “You can't play if you're sick!”</p>\n<p>At that, Kageyama whips his head around to glare up at Hinata. “I'm not sick!” He glances around to make sure nobody took notice of his outburst; thankfully they're all busy listening to Nishinoya and Tanaka recount some television series they've been into of late.</p>\n<p>“Look, I'm seriously not sick. Just shut up and leave me alone and we can practice later.” Kageyama's voice is gruff, but Hinata can tell he's also trying to be reassuring, maybe? He thinks that's the case. Maybe he's giving Kageyama's growth a little too much development, but Hinata likes to think the best of people before he thinks the worst, and sometimes he's even feeling generous enough to extend that to Kageyama, especially at the mention of extra practice later. Kageyama will probably treat him to food if they play well enough, and Hinata's feeling confident enough in his abilities today to nod firmly and bound away to get changed.</p>\n<p>Or he was, anyway. When ten minutes pass and the rest of the club members are filtering out, Hinata watches as Kageyama still sits crouched over his bag, shuffling around in it like he's pretending to be looking for something really important. True, Hinata had been changed in about two minutes, but lingering concern for Kageyama (maybe) and the expectation of practicing with him have made him stall for time until the two of them are the last in the club room. Daichi's told them he'll wait outside to lock up, so hurry up and finish whatever the heck is taking you so long, Kageyama. At this Kageyama does blush, nodding quickly. Hinata watches.</p>\n<p>He keeps watching as Kageyama awkwardly stands up and shuffles out of his shorts and into his school pants. The thought that it might be a little weird and invasive doesn't even cross Hinata's mind. It was totally normal for teammates to see each other changing, and it's not like Kageyama didn't know he was right there.</p>\n<p>When he finally gets done changing and turns around though, Kageyama's yelp makes Hinata realize that no, he seriously didn't know he was right there. It's enough to make Hinata burst into laughter.</p>\n<p>“The look on your face!” he wheezes out between snorts. “Did I seriously surprise you? I've been here the whole time!”</p>\n<p>Kageyama's face is red again, and he's scowling in the way that he does when he's embarrassed. “Fuck off, I didn't know you were capable of being quiet for more than five seconds!”</p>\n<p>Hinata opens his mouth to start a long-overdue bout of bickering, until he glances down and stops dead. He's pretty sure his mouth is hanging open still, and by the look that flashes over Kageyama's face—annoyance to confusion and settling on horrified shame—Hinata knows what's going on.</p>\n<p>Kageyama totally and undoubtedly has a boner.</p>\n<p>He stares for what feels like ages but is probably only a few seconds, before finally closing his mouth. Kageyama is scrambling to grab his bag from the floor and cover up the obvious tent in his pants, but Hinata can tell from the fumbling he isn't going to get anywhere soon.</p>\n<p>“It's not what it looks like, okay,” Kageyama blurts out when he finally has the bag in a death grip. “Even an idiot like you has to know this just happens sometimes. It's not anything weird so just leave and forget it, or I'm seriously going to kill you.”</p>\n<p>Weird is the last thing that's on Hinata's mind, mostly preoccupied of thinking how he could use this to extort more snacks out of his partner and maybe he's also feeling a little guilty for catching Kageyama in a situation he had obviously, looking back, been trying to hide. He's about to bite out a (hopefully scathing) retort when he realizes Kageyama is still shamefaced and trying to look anywhere but at him, and guilt pangs a little stronger.</p>\n<p>“It's not a big deal,” Hinata finally says when he settles on an action. He's never exactly been in this situation before. “One time I got hard in the middle of class, it was seriously the worst. I had to sit there through lunch and I didn't even get to eat anything.”</p>\n<p>At this, Kageyama allows himself to snort. Of course Hinata would think only of the food he was missing and not the horrifically embarrassing predicament he'd been in. Hinata is banking on that and almost sighs in relief as he watches Kageyama's tense shoulders relax. It's only a little, but then Kageyama is never really relaxed even in the best of situations. He's about to say something when there's a knock on the door, and Daichi pops his head into the room.</p>\n<p>“Are you guys finished yet?” He sounds irritable, but Hinata's busy watching Kageyama's face change back to some grimace of horror and before he really has a chance to think, he's jumping in front of Kageyama and facing Daichi.</p>\n<p>“Yes!” he blurts out, nudging Kageyama behind him in what he hopes is an obvious hint to sling his bag over his shoulder. “We were just talking about practice! Right, Kageyama?”</p>\n<p>Kageyama grunts in assent as he adjusts his back over his front and then bows, and if it's a little awkward and stiff Daichi doesn't say anything. “Sorry, we'll be leaving.” He strides forward and clamps down on Hinata's arm, dragging him out after. Even though he's pretty sure it's bruising, Hinata doesn't even say anything until they're at the bike stand and Kageyama finally releases him and turns to go.</p>\n<p>“Wait a minute!” Hinata's jumping after Kageyama, clutching onto the back of his jacket. “You said we were gonna practice! I didn't wait that whole time for nothing!”</p>\n<p>Incredulous, Kageyama turns back to him. “Are you seriously going to just... Do you really have that much of a one-track mind?”</p>\n<p>They both glance down to Kageyama's bag.</p>\n<p>Honestly, Hinata doesn't know why it's such a big deal. It's not like it isn't something they don't both deal with, as teenage boys, and he knows from experience that it'll go away sooner or later. He hopes sooner, because he's getting kind of hungry and maybe they can stop for food before they practice. </p>\n<p>He must have been thinking out loud, because Kageyama is staring at him again. “Looks like I was too soon to think maybe you had a little bit of common sense in that thick skull of yours,” he bites out, and Hinata bristles.</p>\n<p>“Can't we just wait for it to go away or something? You promised we were going to practice,” and if Hinata is pouting a little, he doesn't really care, because a promise is a promise. </p>\n<p>When Kageyama doesn't answer, he grabs his arm and starts walking. Sputtered protests fall on deaf ears as Hinata marches them towards where they usually practice. When they get there, Hinata shoves Kageyama down on a nearby bench and folds his arms, settling him with a glare he hopes is intimidating.</p>\n<p>For his part, Kageyama looks startled, and Hinata can't deny he feels a small swell of pride for catching the King off-guard. “What the fuck do you think you're doing?”</p>\n<p>“Fixing the problem,” says Hinata, and this time his smug look over startling Kageyama is unmistakable.</p>\n<p>“What the—are you—Dumbass Hinata!” Kageyama manages to choke out, and his face is burning at this point. “I don't want you sitting here and staring at me while my...while this goes away!”</p>\n<p>Hinata shrugs. “You promised to practice with me and you left so early we didn't even get to stay later. Can't you just...” He glances down at Kageyama's crotch again, the bag having fallen to the wayside, and this time he does have the decency to look embarrassed. He can feel his face heating up and wills himself to reclaim that steely resolve he had just a minute ago.</p>\n<p>But Kageyama isn't going for it. “You can't seriously fucking expect me to jack off in front of you!” He's yelling, and Hinata lurches forward to jam his hand over Kageyama's mouth. Kageyama scowls at him as Hinata takes his hand away.</p>\n<p>“You could go behind a tree or something?” Hinata's starting to think maybe this wasn't the best idea and he could have just had Kageyama promise double the practice tomorrow, but he shakes it off, refusing to admit an idea of his isn't great.</p>\n<p>“No!” </p>\n<p>Kageyama's spluttering again, and he looks like he's about to throw another fit, so Hinata does the first thing he thinks of. He's never really been one for second-guessing himself—he likes to think it's how he has come this far up to now. Placing his hands firmly on Kageyama's knees, he yanks his legs apart. He quickly jerks his eyes up to Kageyama rather than face the...slightly large problem staring right at him, and is rewarded with Kageyama looking absolutely shocked. His face has probably gone three more shades of red, and Hinata bites back a laugh because this is probably not a laughing situation.</p>\n<p>“If you don't want to take care of it, I will.” He realizes how weird that sounds only after he's said it, but Hinata doesn't care at this point. He has made up his mind, and he hates going back on things he has decided on. Plus, how hard can it really be? He does it himself all the time at home or, once, in the bathroom at school. He reaches out for Kageyama's zipper before reigning himself in and glancing back up.</p>\n<p>Hinata doesn't know what he's expecting, but it's not the resigned grimace that has settled across Kageyama's face. Reassured, Hinata only hesitates a minute before jamming his hand against the bulge in Kageyama's pants.</p>\n<p>Kageyama grunts and slaps his hand away, which is definitely not what he was expecting. Hinata doesn't know exactly what he was expecting, but it's not that.</p>\n<p>“If you're going to do it, do it right, idiot,” Kageyama growls, and he wasn't expecting that, either. Kageyama isn't fighting tooth and nail to keep Hinata's hands away from his junk, and Hinata's resolve almost wavers. He was definitely waiting for Kageyama to kick and scream and grab his head before marching off to take care of himself in private.</p>\n<p>Hinata watches at Kageyama's hands go for his zipper, and notes that they might be slightly trembling. He suddenly realizes that wow, Kageyama has been dealing with a boner since the end of practice and what had Hinata been doing? Shoving Kageyama's bag back against it, forcing him to march to their practice spot; he feels bad, suddenly, and nods to himself. The least he can do is help his friend out with this, right? Wouldn't Kageyama do the same for him? Probably not, but Kageyama wouldn't really do much of anything for anybody, so it's okay. Hinata has always been a pretty giving person.</p>\n<p>This time it's Hinata who smacks Kageyama's hands away in favor of pulling down his zipper. Hinata's tongue peeks out of the corner of his mouth at the same time as Kageyama's boxers peek out of his unzipped pants, and he stares. He knows he should pull the boxers aside too, but he's honestly never seen another boy like this, and he's not sure if he's feeling anticipation or apprehension. Maybe both.</p>\n<p>“If you don't want to do it, you don't have to.” Kageyama's gruff voice startles Hinata out of his thoughts, and he looks up. “You're the one who offered, and for the record I was totally and completely fully against this.”</p>\n<p>Kageyama looks like he's about to push Hinata away and stand up, and Hinata takes that as a challenge, gripping Kageyama's thighs enough to make the other boy wince. “I'm doing it!” is all he says before he lets go of Kageyama and yanks down his boxers. Kageyama yelps and immediately goes to cover himself up, but Hinata pushes his hands out of the way and grabs the dick he's been presented with, which is more than happy to see him. He feels a little bad for Kageyama's earlier suffering.</p>\n<p>“Don't grab it so hard!” Hinata realizes Kageyama is yelling and pulls his eyes away from the staring contest he'd been having with Kageyama's intimate bits. “Do you even know how to do this? Have you ever even done this yourself?”</p>\n<p>“Yes!” Hinata scowls and loosens his grip. This has definitely become a challenge, and he's determined to make Kageyama eat his words. He adjusts his hand, trying to get a feel for doing this at a completely different angle. Kageyama's hiss is more reassuring than it probably should be. He can do this.</p>\n<p>Hinata starts moving his hand, slowly and experimentally. Kageyama responds by bending over, folding himself in on Hinata and partly shielding them from any passersby, which Hinata admits is not something he'd considered when he had started this. He hopes it's late enough that most people are gone, and their spot is in a pretty secluded place, anyway. He twists his wrist and Kageyama groans by his ear, curling tighter around their shared space.</p>\n<p>He had no ideal Kageyama was so expressive about stuff like this, and it leaves Hinata a little winded. He can feel his face heating up, but he reassures himself this is stuff guys do for each other, sometimes, probably, and keeps going. He picks up a rhythm. Kageyama is breathing in his ear.</p>\n<p>He feels a little dizzy.</p>\n<p>“Hurry up,” Kageyama grunts, and the breathless quality makes Hinata jump. “I thought you said you knew how to do this, dumbass.”</p>\n<p>“I do!” Hinata rubs his head over the tip of Kageyama's cock to prove it, and Kageyama's startled...moan? Kageyama seriously just moaned, and oh my god, Hinata feels his own self stirring in reaction. He wills it to go away and leans in closer, determined not to let anything distract him from completely crushing Kageyama with the expertise of his masturbation technique. He breathes out, trying to steady his nerves.</p>\n<p>And then he hears a strangled groan, feels Kageyama tense, and there is something splattering on his face.</p>\n<p>Before he can even register what has happened, Kageyama is shoving him away, looking absolutely mortified. “Oh my god, I'm—are you—oh my god,” he's saying, over and over, frantically rooting around in his bag for something. Hinata brings a hand up to his face and it comes away sticky and warm, and he realizes that Kageyama came in his face.</p>\n<p>He doesn't even have time to be startled because Kageyama is down in the dirt with him, trying to mop up the mess on his face with his own practice jersey, and Hinata wrinkles his nose as the fabric scrubs across his cheeks. Kageyama is still babbling and seriously, it shouldn't be that big of a deal, right? And Kageyama's dick is still kind of hanging out of his pants and this shouldn't be as funny as it is, and before he knows it Hinata is laughing and Kageyama is staring at him like he grew another head.</p>\n<p>Kageyama keeps staring, soiled jersey in one hand, until Hinata has composed himself enough. “You came in like five seconds!” he manages to snort out, and he's laughing again because this is honestly the most ridiculous situation he has been in and Kageyama still has not zipped his pants up.</p>\n<p>Then Kageyama is scrambling to fix that, and they're both left sitting in the dirt.</p>\n<p>“I had no idea you were such a quick shot, Kageyama,” Hinata says smugly, more okay with what had happened than he thinks he should be, but he doesn't mind because he's seen yet another of the cool Kageyama's embarrassing sides.</p>\n<p>“Shut up.” Kageyama is stuffing his jersey back in his bag and standing up, and the familiar glare is back on his face. “I can't believe I felt bad for you for a second. I was going to apologize but on second thought, you deserved it.”</p>\n<p>Hinata whines as he pushes himself to his feet. “No, apologize! If you were going to do it already, just do it!” He latches onto Kageyama's sleeve and tugs. “Apologize and toss to me, and I'll forgive you for getting my face dirty.”</p>\n<p>Kageyama's face goes scarlet again, and he opens and closes his mouth a few times. Finally, he just lowers his head and Hinata has to crane his neck to hear the “sorry” that comes out of his mouth. Hinata's honestly a little stunned, because Kageyama never actually apologizes, so he must feel really bad. It leaves Hinata feeling a little awkward, and he shoves Kageyama's arm in what he hopes is a playful manner. It's okay, he wants to say, stop acting so weird about it. Instead, he just reaches down and pick the volleyball out of Kageyama's bag.</p>\n<p>“Toss to me, and I'll forgive you.” And if his face is a little red, Kageyama doesn't tell him.</p>\n<p>The next day is a Tuesday, three weeks later.</p>\n<p>Hinata had been worried their little...what would you call it, a fling? It wasn't even a fling, he tells himself, it was just a friend helping out another friend. Kageyama should be grateful he was so generous helping him out, but it was mostly because he just wanted to get back to practice and not because he was concerned about Hinata's well-being. He had been worried things would be awkward between them the next day, but he should have known Kageyama was already so awkward that it was basically just another day for him, and their encounter fades into the monotony of class and the energy of volleyball practice afterward. Today, Kageyama has even agreed to some extra practice during lunchtime, which he usually does anyway, but that doesn't make it any less exciting for Hinata.</p>\n<p>“Is eating dirt part of your new technique?” Kageyama's face is smug as Hinata tries to wipe dirt out of his mouth. “We already had lunch, don't tell me you're still hungry. Knowing you, though...”</p>\n<p>Hinata's expression is indignant and his sleeve is smudging the dirt around in a futile attempt to clean his face. For a split second, he finds his mind drifting to something he really would rather not relive so soon, something he has spent a little more than a week recovering from, something that still sometimes pops into his head while he bites his knuckle as hard as he can to think less awkward thoughts. His mother has caught him a few times and he had to explain it away as thinking really hard about his earlier practice. She'd given him a weird look, but he figures she's used to that sort of thing by now.</p>\n<p>In a delayed attempt to defend his honor, Hinata is up off his ass in a jiffy, dirty face forgotten in favor of yelling at Kageyama to toss one more time. “I'll get it next time,” he grumbles, while Kageyama turns to shuck off his jacket. Hinata had left his behind a while ago, which is probably for the best considering his current state. At least he'd avoid his mom nagging him about keeping clean at least some days of the week. He was a growing boy, he was supposed to get dirty.</p>\n<p>Kageyama is busy disdainfully surveying the dirt, which has traveled from Hinata's face to the rest of him, and he's probably about to comment on how Hinata can't even keep himself clean, he's like a complete five-year-old, blah blah, when he stops short. His mouth is hanging open, and Hinata's eyebrow raises. It's not like getting dirty is unusual for Hinata; he's still not the best at receiving, which is what they'd been working on a few minutes ago. He would never admit it out loud to Kageyama, but there's a reason he's practicing extra.</p>\n<p>Hinata, waiting expectantly for the toss that is apparently not coming, frowns and shifts. Maybe he's gotten dirtier than usual, because his pants are feeling a little tight. “What, are you seriously going to be an asshole about the dirt, because I--”</p>\n<p>“You didn't notice?” Kageyama blurts out, and Hinata can see the blood rising to his cheeks. He watches Hinata shift and pointedly glances at his crotch.</p>\n<p>It takes Hinata another second or two to realize there's a very clear reason for his pants feeling a bit tight, and he immediately regrets laughing at Kageyama for his little reaction a week prior. This is probably even more embarrassing than when he'd popped one in class and had been unable to do anything about it all through lunch because Kageyama is here, although he's finally looking off to the side, reading the shameful recognition gracing Hinata's features.</p>\n<p>Hinata jumps into action, trying to cover up the bulge in his pants, even though it's a little late to prevent anyone from noticing. At least he can narrow it down to just Kageyama, if everyone stays away like they usually do and he can cover up fast enough. There's also the matter of getting to class like this when lunch ends, if it doesn't go away by then. Hinata starts praying.</p>\n<p>“Dumbass, just take this for now.”</p>\n<p>Startled out of his fourth consecutive prayer to whatever god governs embarrassing boners, Hinata is smacked in the face with a still-warm jacket. Pulling it away from his face, he looks to Kageyama, who is still pointedly looking at the sky like he's found something really interesting to watch. Hinata allows himself a brief glance up in which he determines no, there's nothing up there, Kageyama is just being his usual awkward self.</p>\n<p>Bowing frantically to signal his gratitude, Hinata ties the jacket awkwardly around his waist. Honestly, he's feeling more disappointed than embarrassed now that he's out of immediate danger, thinking they're going to have to cut their lunchtime practice short because he popped an untimely boner. His penis murdered their practice session and he doesn't think he's going to be able to forgive it that easily.</p>\n<p>“I guess this means we're done with practice,” he says, a little petulantly, and Kageyama rolls his eyes. “It's not even halfway through lunch, I was just getting warmed up. I totally would have hit that toss next time.”</p>\n<p>He watches as Kageyama sits down heavily on the bench. Hinata sits down next to him and he knows Kageyama can probably tell he's sulking, but his dick is making him feel hot and irritable and not in the mood to deal with anything because he still wants to hit Kageyama's toss. He presses Kageyama's jacket against his lap; Kageyama is going to end up wearing that later. He tries not to think about it.</p>\n<p>Hinata takes a deep breath, struck with a sudden idea. “Look, I can't believe I'm saying this, but nobody is around...” he looks around, just to make sure, “So like, would you mind if I...”</p>\n<p>Kageyama is staring at him again, and Hinata shrinks into himself a little. He should have probably just excused himself to go to the bathroom and take care of it before class or something, but he'd stupidly figured since last time Kageyama wouldn't be weird about stuff like this, maybe. They were two guys, after all, and this was completely normal, right? He heard guys talking about erections all the time in class, although it definitely was not exactly the same as sitting right next to your volleyball partner sporting a tent in your pants at right that moment.</p>\n<p>“It'd probably take you 30 second to finish,” Kageyama finally and unexpectedly says, and Hinata quickly looks up at him. It takes him a minute to register exactly what Kageyama said, but when he does, his cheeks puff out.</p>\n<p>“That would be 25 seconds longer than you,” he says, and Kageyama elbows him in the stomach. He has to admit he feels a little relieved, though, like some tension has evaporated from within him, and he lets his shoulders relax.</p>\n<p>“Let me do it.”</p>\n<p>Maybe he spoke too soon. Hinata jerks his head over to look up at Kageyama and he knows his mouth is probably hanging open, and he must have heard wrong, because is Kageyama seriously asking to jerk him off?</p>\n<p>“Let me do it,” Kageyama says again, and he's looking away in that way he has when he's sort of embarrassed that Hinata decides is kind of endearing if you forget that it's Kageyama who is doing it. It's definitely more of a statement than a question, too, and that's really Kageyama.</p>\n<p>Maybe he feels like he owes Hinata from a week ago; Hinata wouldn't put it past him, because Kageyama has stupid pride issues or something. However, Hinata is kind of curious what it's like letting someone else touch your dick, and he did do Kageyama a favor last time, and he also knows from experience that Kageyama doesn't offer to do anything he really doesn't want to do.</p>\n<p>So he takes a breath and says “Okay.”</p>\n<p>Kageyama looks back at him, clearly surprised that Hinata agreed, and at that Hinata feels a little swell of pride in himself at having outsmarted Kageyama. He scoots closer so their thighs are touching. The warmth is kind of nice. He has the decency to at least stare at his lap (Kageyama's jacket) instead of Kageyama and look a little embarrassed, but if he had to admit it, he was feeling a little excited. Like, besides the excitement he obviously was feeling in his pants.</p>\n<p>They sit there in silence for a minute, because while it somehow came so easily to Hinata last time, this time is different, and Kageyama clearly has absolutely no idea how to initiate stuff like this. Hell, he can barely initiate a normal, everyday conversation. Hinata doesn't begrudge him this, though, and helps by nudging his thigh against Kageyama's.</p>\n<p>“So, what, am I doing this or are you going to let me show you that I can definitely last longer than you?” Hinata still feels a little embarrassed, but he has that cocky grin on his face he gets when he's telling Kageyama there's no way he's going to lose the next race, and Kageyama sucks in his breath and sticks out his arm and whoa, Hinata can definitely feel a vague pressure there that he isn't used to feeling, and before he even realizes it he seriously moans, and they both stare at each other for a minute before Kageyama starts laughing and Hinata's face twists into embarrassed indignation.</p>\n<p>“You're that into it already?” says Kageyama. He is apparently feeling a little more bold now, and slides his hand underneath the jacket. Hinata is about to try and defend himself, (“I wasn't expecting that yet! You could have warned me!”) but whatever he's meaning to say escapes him in one hot breath as Kageyama presses down, and he can feel himself shiver.</p>\n<p>Kageyama is rubbing the outside of hi pants now, and Hinata can honestly say the pressure feels amazing. Kageyama's hand is a lot bigger than his, and the press of his palm against the straining fabric makes Hinata moan again before he can stop himself.</p>\n<p>Kageyama violently bumps Hinata with his shoulder. “Shut up, you jackass, unless you want someone to come over here!” He presses down harder against Hinata.</p>\n<p>Hinata bites back the noise this time, glaring at Kageyama, and leans against him instead. The pressure is making his head feel a little fuzzy, and it's pretty different from when he's doing it himself, just knowing that this is someone else's hand and he's sort of at Kageyama's mercy here. That shouldn't sound as hot as it does. Hinata hates Kageyama for making him briefly contemplate being at the mercy of his greatest rival.</p>\n<p>“It'll make it look like we're just hanging out, or something,” he says in response to Kageyama's glare at Hinata's weight being forced on him. Hinata definitely isn't going to say it's also because he kind of might fall over if he doesn't have something to lean on. He would rather Kageyama have something else against him.</p>\n<p>No longer preoccupied with the usual bickering, Kageyama allows his focus to fall onto what he's doing with his hand, and Hinata lets himself just pay attention to what's going on underneath Kageyama's jacket. Although Kageyama's pressing decidedly harder than he was a moment ago, it's still not quite enough, and Hinata finds himself pressing up against Kageyama's palm, choosing to ignore the smug look Kageyama is definitely directing at him. Hinata closes his eyes and thinks about something else, maybe volleyball, and Kageyama tossing to him with those hands of his that are capable of doing pretty much anything when it comes to volleyball, long slender fingers and calluses Hinata remembers from when he grabbed his wrist the other day, and--</p>\n<p>Before he even realizes what's going on enough to stop himself, Hinata jerks his head to muffle his voice in Kageyama's shoulder while he completely and definitely comes all over the inside of his pants, hips pressing up away from the bench and towards Kageyama's hand.</p>\n<p>And Kageyama is laughing.</p>\n<p>“Shut up!” Hinata's face is still pressed against Kageyama's shoulder, and his knees are shaking, but he does his best to sound as menacing as possible. “Stop laughing like you just murdered someone, stupid Kageyama! I lasted way longer than you did, and this position was different so it's not even on the same playing field.”</p>\n<p>“I didn't even touch you!” Kageyama's hand is still soft on Hinata's lap, but he doesn't mention it. “Whatever, you just don't want to admit I'm better than you. I definitely lasted longer last time.” </p>\n<p>Kageyama finally withdraws his hand from Hinata's pants, and Hinata shifts his hips uncomfortably, wrinkling his nose at the slimy feeling on the inside of his boxers. He's definitely going to have to go to the bathroom and wipe that off, but it's still better than dealing with a boner during class.</p>\n<p>Lifting his head from Kageyama's shoulder, Hinata finally sets his eyes on his partner. Kageyama's face is definitely red, even though he's trying to hide it with that snotty look he gets when he knows he's right and Hinata is wrong. Hinata feels himself sticking his tongue out at Kageyama, ignoring the heat in his own face. He chalks it up to the adrenaline going through him.</p>\n<p>“Hurry up and stop making me look at that so we can get back to practice,” Hinata grumbles, tossing Kageyama's jacket back at him. He tries not to think about how that was just pressed against his crotch and became an unwitting witness to him coming undone under Kageyama's hand, and how Kageyama is going to put that back on after lunch is over and he's going to have to look at it for the rest of the day.</p>\n<p>It's a Saturday evening when they step it up a little.</p>\n<p>If Hinata's being honest with himself, this might be a little abnormal. It's been a month, and Kageyama has touched his dick exactly four and a half times. The half was when they were both in the club room and Kageyama had almost been caught with his hand down Hinata's pants because someone hadn't checked whether or not the coast was clear. That someone may or may not have been Hinata, but he's not going to admit to anything regarding that close call.</p>\n<p>The point is, Hinata has gotten a little more than familiar with parts of Kageyama he'd never really even expected to see, before. They haven't gone any farther than quick handjobs in the park on the way home from school, or behind the storage shed during lunchtime. Hinata's enthusiasm for competition has, as usual, ignited Kageyama's refusal to lose, and he seems much more willing to go along with it now. Last time, the time they'd almost been caught, he had initiated it on his own, and thinking about it makes Hinata more embarrassed than usual. </p>\n<p>What's worse, it's not exactly a matter of accidental boners anymore. Hinata is pretty sure he hadn't even been hard the last time, but everything happened so fast that he can't really be sure. All he knew is that the things Kageyama had done with his hand this time around were probably definitely cheating.</p>\n<p>Hinata has only touched Kageyama's dick three times. Thinking about it makes his hand twitch with what has to be some form of competition, because he really can't have Kageyama one-upping him in something like this, can he? He feels his gaze drifting away from the court, something he should seriously learn to control during practice. Hinata's not really one for taking the advice of others, though, and lets his mind wander to how he's possibly going to get Kageyama alone after this so he can even the score and maybe, possibly, reach five before he does.</p>\n<p>It's not impossible for it to happen twice in a row if he maybe cheats a little, right? Like Kageyama did last time.</p>\n<p>He's shaken out of his fantasy (not that he's fantasizing about anything other than how to get even) by a hand clapping on his shoulder, and he feels weirdly guilty turning to see Sugarawa's concerned face.</p>\n<p>“Is everything alright?” Suga's smile is enough to make Hinata's face heat up in shame; he feels like his mom just caught him with a dirty magazine.</p>\n<p>“Yes!” Hinata thinks he sounds a little too enthusiastic and lowers his voice, noticing the glances his other teammates are sending his way. He pointedly ignores Kageyama's. “I was just thinking about...about homework!”</p>\n<p>The minute his flimsy excuse slips out, Hinata knows he's in trouble. Hinata never thinks about homework, which is why he doesn't have the best marks. Suga frowns a little, as much as it's possible for Suga to frown.</p>\n<p>“Are you sure everything is alright? You're not having trouble in class again, are you?” Hinata could kick himself. “If you need some help, I'd be more than happy to--”</p>\n<p>“No!” Hinata's face flushes. “See uh--”</p>\n<p>Suddenly, there's another pressure on his shoulder. He turns around and has to look up to see Kageyama fixing Suga with a look he'd describe as decidedly awkward. “Hinata is coming over after school to study.” Hinata hates how smooth his lie is, and wonders if he could take some pointers from—on second thought, there's definitely nothing he needs to learn from Kageyama, of all people. His nose wrinkles until he notices Suga giving him a curious look.</p>\n<p>“Yeah, Kageyama has graciously offered to let me look over his notes and make sure he got them right this time.” He feels Kageyama's grip tighten on his shoulder and grins. This is more like what he's used to.</p>\n<p>“Dumbass,” Kageyama hisses, “If I relied on taking notes from you, I'd never be able to play volleyball again in my life. It's a miracle already that you're here as it is, I don't know how you manage to get by on that shitty attention span of yours, you can't even focus on the court long enough to stop Suga-senpai from having to drag you out of whatever fantasy you were having to make sure you don't get a concussion like you almost did last week--”</p>\n<p>Sugawara sighs but his expression is more fond than anything, and he shakes his head once before leaving the boys to their usual bickering. Hinata tunes Kageyama out as he watches Suga trot off to join some of the other team on the sidelines, waiting until he's safely out of earshot before turning back to Kageyama.</p>\n<p>“Hey, did you really mean it? Studying at your house?”</p>\n<p>Kageyama's grip goes slack and he looks kind of confused and very put on the spot. “Uh...I was kind of just trying to cover for you, but if your grades are really that bad then--”</p>\n<p>Hinata stomps on Kageyama's foot and he swears. “No! I want to hang out at Kageyama's house!” He knows he probably looks and sounds like a bratty little kid, but the prospect of finally going over to Kageyama's is too good to pass up. “Come on, we don't have school tomorrow, right? We can just go right after practice!”</p>\n<p>Eyes narrowing, Kageyama stares him down like he's trying to discover some ulterior motive. Hinata puts on his best angelic expression, rocking on his heels. He wills silently “say yes, say yes, say yes” and Kageyama's expression finally softens, and he shrugs.</p>\n<p>“Okay, I guess. My mom's going to be out and she said I can order in. Plus it would probably be good to look over your notes anyway since you came so close to actually getting kicked out last time.”</p>\n<p>Hinata lets that one slide because he's too busy jumping and whooping and punching the air with his fist.</p>\n<p> </p>\n<p>Despite Kageyama's claims of wanting to look over Hinata's notes, they get absolutely no studying done. The second they reach Kageyama's house and Hinata enters with a “sorry for intruding!”, Hinata is running around like a madman, thankful that Kageyama's mother isn't in to see him like this. Kageyama just shakes his head and tilts his head at the stairs, which Hinata proceeds to bound up. He almost trips and hears Kageyama shouting a gruff “careful, idiot,” before he makes it inside.</p>\n<p>Kageyama's room is as immaculate as he would expect. Hinata doesn't think anyone else has ever been in this room, and it's hard to believe even Kageyama uses it. The bed is made way too neatly, so he flops down on it, not even bothering to remove his jacket.</p>\n<p>Kageyama makes his way inside after Hinata and deposits his bag on the floor by the wall. Hinata watches him, cheek pressed against the bedspread that smells comfortingly like Kageyama and that shouldn't make his stomach feel weird, but it does. He chalks it up to excitement at visiting a friend's house for the first time. Kageyama, from the seat he's taken on the floor, watches him, and Hinata stuffs his face into the blanket.</p>\n<p>They sit there like that for a minute, before Hinata turns his face back to Kageyama.</p>\n<p>“Is this the first time you've had anyone over?”</p>\n<p>Kageyama's face turns red and he splutters, and Hinata can't really tell what he's saying but it's definitely not a no. Hinata's stomach feels warm and he can't help the grin creeping across his face.</p>\n<p>“I'm the first person to brave the hostile territory of Kageyama Tobio's bedroom.” His voice is over-dramatic and makes Kageyama glare, but Hinata's in too good of a mood to even bother with that. “Maybe I should explore a little.”</p>\n<p>Kageyama is still watching as Hinata rolls off the bed and onto the floor. Their legs bump and Hinata doesn't move away; he's always been a little touchy-feely (okay, maybe more than a little) and he's been feeling even more-so lately.</p>\n<p>“Say, Kageyama, do you hide dirty magazines in here?” Hinata rolls over again to peer under Kageyama's bed, but it's immaculate, unlike Hinata's back at home. He glances back at Kageyama, who, to his delight, has turned that shade of red he gets when he's embarrassed. Hinata realizes for a moment that he's actually cataloged Kageyama's embarrassed faces, and that might be weird but for now he doesn't care, he's a man on a mission and wants to see the kind of stuff that turns Kageyama on. Or maybe he just looks at volleyball magazines when he gets busy, Hinata wouldn't put it past him.</p>\n<p>Hinata rises to his knees and peers under the mattress, because in every piece of media he's ever consumed that's where people keep them. It's where he'd keep them, if he had any, bu with Natsu around it's way too dangerous. He's not really sure what he'd want, anyway. The only time Hinata has seen a dirty magazine was in class when some boys were passing one around.</p>\n<p>To his disappointment, there's nothing under the mattress but a few pieces of paper. He reaches out to grab one when he feels Kageyama yanking on the back of his shirt.</p>\n<p>“Idiot, don't go messing around with my stuff!” His face is still red and Hinata's stomach does a little flip that he assumes is from satisfaction at having teased his rival.</p>\n<p>The mattress flops back down with an underwhelming little thud. Hinata's curiosity is piqued because who hides stuff unless it's something juicy they don't want other people seeing? He's going to have to remember to look when Kageyama's back is turned. For now, he just sits back on his heels and pouts.</p>\n<p>“That's lame, Kageyama. You don't have any dirty magazines at all? Are you sure?” He watches at Kageyama lets go of his shirt and turns his head away, glaring at the wall.</p>\n<p>“Not all of us are hormone-crazed idiots like you apparently are.”</p>\n<p>“I am not! I was just curious, I mean, isn't this what guys do when they go to each other's houses? I'm pretty sure it is, and I think I'd know better than you since I've actually had people over to my house.” He sticks his tongue out. “Well, if you did have any, what kind of girl would you like?”</p>\n<p>Kageyama finally glances back at him, looking disinterested despite the red still dusting his cheeks. “I already told you I don't care about stuff like that.”</p>\n<p>Hinata crows. “I knew it, Kageyama really only cares about volleyball!”</p>\n<p>“No!” Kageyama's eyes are flashing in the familiar sign of an impending argument. “I'm not you, I don't go all red-faced and wide-eyed after just hitting a spike, stupid.”</p>\n<p>“I don't look like that!”</p>\n<p>“You do. And I guess I like petite girls, but I told you I'm not really interested in them right now.”</p>\n<p>Hinata thinks about this for a minute, then nods to himself. He supposes basically any girl would be petite compared to a giant like Kageyama (he snickers and Kageyama gives him a dirty look).</p>\n<p>“I like cute girls,” he supplies, even though Kageyama hadn't asked him and seems disinterested in the conversation already. “Girls who look at you and theyre like BAM! You know, and they bat their eyelashes but they could also probably take you on in a fistfight...”</p>\n<p>This time Kageyama snickers. “Leave it to you to fantasize about girls beating you at fistfights.”</p>\n<p>“That's not what I fantasize about!” Hinata realizes as soon as he's said it that this is probably not the greatest line of conversation, but he's never really been able to back down once they get going.</p>\n<p>Kageyama rises to the occasion, like usual. “Oh? So what do you fantasize about, besides volleyball? That's right, I remember that time at training camp when you ended up talking in your sleep.”</p>\n<p>“I don't talk in my sleep, stupid Kageyama. That was probably you dreaming about me.” Kageyama stutters indignantly which is pretty funny, and Hinata falls silent, thinking. “I guess I don't really fantasize about anything, though. I've only ever really had experience with you, after all.”</p>\n<p>It's Kageyama's turn to fall silent, although his face remains as red as ever, possibly redder. “Same, I guess.”</p>\n<p>“You guess?”</p>\n<p>“Yeah, I guess!” Kageyama spits out, and he definitely looks uncomfortable now if he didn't before. “Why the hell are we even talking about this?”</p>\n<p>Hinata shrugs and scoots closer to Kageyama. He's already looking kind of hot under the collar, maybe this would be the perfect opportunity to settle the score. They've never really initiated anything when neither of them were hard already, but Hinata has learned lately that Kageyama is pretty sensitive to physical touch. Last time Kageyama had been on the receiving end of a handjob, it had happened during practice when the two of them ended up tangled on the floor.</p>\n<p>Maybe he could set up a similar situation here.</p>\n<p>Hinata scoots closer again, and Kageyama is looking at him warily like he expects Hinata to pull something.</p>\n<p>“You know, Kageyama, it's getting kind of hot in here, isn't it?” Hinata fans himself, pretending. “You're still wearing that sweater from practice, right? Aren't you hot? And probably sweaty.”</p>\n<p>Hinata doesn't know why that really sounds as appealing as it does when it's out of his mouth, and he really is starting to get hot. Kageyama is giving him a weird look, and it's not the one from earlier that says 'I'm super embarrassed right now and you're just making it worse.' Instead, it's like 'Are you really this dumb?'</p>\n<p>Yeah, maybe he really is this dumb, for once. Hinata's feeling something stirring in his stomach and this is not the way this was supposed to go at all.</p>\n<p>Suddenly, he is staring up at the ceiling and the cool floor is pressing into his back where his shirt is rucked up around his sides from where Kageyama has bowled him over, trapping him between his arms. Arms that Hinata, at this moment, cannot stop thinking about how they look when they're sending a toss to him. Kageyama's face is a lot less red than it was a moment ago, his hair is still mussed up from practice, and before he knows it, Hinata is hissing as Kageyama brings a knee to his groin.</p>\n<p>“Were you seriously trying to outsmart me here?” Kageyama stares down at him, and he has that look about him that really screams “king”, not that Hinata would ever admit it. “You come into my house and try to jump me to get us even?”</p>\n<p>“No!” Yes, actually.</p>\n<p>Kageyama rubs his knee into Hinata, who is getting harder by the second. “Yeah right, stupid, why else would you actually want to come over to my house?”</p>\n<p>Hinata completely forgets his growing erection for a second, blinking. Is Kageyama really that stupid that he'd think Hinata had only wanted to come over for part of their dumb competition? He reaches up and shoves his hand at Kageyama's face, which is getting way too close, so he can actually speak.</p>\n<p>“Kageyama, no wonder girls aren't interested in you if you treat people like this when they just wanted to hang out at your house.” He sort of feels like a chiding mother. “We've been friends for a while now and I'd never even been over, right? You can come to my place next time. I'll even let you off this time.”</p>\n<p>Hinata thinks he's sounding charmingly generous, but after Kageyama gets over his embarrassed-bewildered expression that yeah, Hinata hates that he recognizes, he leans in close again.</p>\n<p>“You're going to let me off? I kind of think I have the upper hand here, dumbass,” he grinds his knee down, “And I'm definitely taking this opportunity to beat you again. We've never done it in this position before so I'm pretty sure you're not going to last even a second.”</p>\n<p>He's about to rise to the challenge when Kageyama does something completely unexpected; he leans in and kisses him.</p>\n<p>Admittedly, this is Hinata's first kiss. He thinks he kissed a neighbor girl when he was little, if embarrassing stories from his mom are anything to go by, but he doesn't remember that so he doesn't count it. He's definitely going to remember this, though, Kageyama's chapped lips sliding against his and, before he closes his eyes, the determined-embarrassed expression that Hinata gets to add to his memory collection.</p>\n<p>It's maybe not the best kiss, but Hinata doesn't really have anything to compare it to, and then Kageyama is pulling away and trying to sneak his hands under Hinata's shirt and Hinata groans because Kageyama's big hands are cool on his heated skin.</p>\n<p>'What the hell, Kageyama?' is what he wants to say, but he's busy rutting his hips against Kageyama's leg because it feels really actually amazing. And then he glances down, and right there, staring him in the face, is his opportunity.</p>\n<p>Kageyama is hard, too.</p>\n<p>“You jackass!” Hinata grunts, and grabs onto Kageyama's hips. “You're trying to act all cool and collected but your dick is right there and I'm not letting you get away with this again.” He's tugging at Kageyama, trying to align their hips together because it seems like a good idea right then, and Kageyama is too bewildered to do anything.</p>\n<p>And then Hinata manages to line their hips together and he pulls down at the same time as he pushes up and his mind goes blank. He vaguely registers Kageyama moaning and actually pushing his hips down on his own, and then they're both moving and Kageyama's hands are gripping Hinata's waist and it takes them less than a minute before they're both shaking.</p>\n<p>Hinata comes in less than a minute and he hates it.</p>\n<p>He hates it a little less, though, when Kageyama collapses on top of him, face smushed against Hinata's neck. He's panting, and even though it tickles, that's not the reason Hinata laughs.</p>\n<p>“I beat you!” He wraps his arms and his legs around Kageyama and clings. “I beat you at your own game, finally!”</p>\n<p>“Shut the fuck up!” Kageyama is griping into his shoulder now. “We came at the same time! You didn't beat me at anything, and even if you did, I'm still ahead!” He doesn't complain about the clinging, though, like Hinata assumed he would, so Hinata just clings harder. He has a weird fuzzy feeling in his stomach, almost like when he spikes one of Kageyama's tosses. It's kind of pleasant, actually.</p>\n<p>They lay there for a while until Kageyama pokes Hinata in the side.</p>\n<p>“Take a bath.”</p>\n<p>Hinata huffs. “You stink too, okay.”</p>\n<p>“That's not what I'm saying, dumbass.” Kageyama leans up on his elbows to look down at Hinata. His face is red, and it's an expression Hinata can't quite classify yet. “I'm saying you can take a bath and clean up. I'll take one after you.”</p>\n<p>Is Kageyama being...nice? Hinata almost snickers, but he holds it back and grins instead. This was a pretty good visit, after all.</p>\n<p>By the time Hinata and Kageyama are both fresh and clean, it's pretty late. Kageyama's mother isn't home yet and for some reason, leaving him alone in an empty house doesn't seem that appealing, so he whines and prods until Kageyama grumbles assent in spending the night. As soon as he gets the all-clear, Hinata is hollering and bouncing on his butt on Kageyama's bed, hair still dripping from his bath because he's always too eager to dry it properly.</p>\n<p>Hinata calls his mom and she definitely sounds surprised, since he's never actually been to Kageyama's house before, but she's glad her son is making some close friends in his club. Hinata almost snorts and says 'It's just Kageyama,' but he holds his tongue and agrees to be polite and clean up after himself. He hangs up and flops back on his bed, feeling absolutely content.</p>\n<p>“Oi, stupid, don't lie on my bed with wet hair.” Kageyama's plopping down next to him and dragging him up by his arm, and Hinata is about to complain about how that's no way to treat a guest, Kageyama, when he feels himself maneuvered with his back to Kageyama. He tries to turn around to see what the heck Kageyama is up to (maybe he lured him into his house just to murder him) but his eyes are suddenly covered by something soft and admittedly pretty fluffy. He yelps, surprised, but it's just Kageyama roughly toweling off his hair. Hinata doesn't even protest, because it feels pretty nice. He brings his legs up agains his chest and rests his chin on his knees.</p>\n<p>After a minute, Kageyama pulls the towel off and ruffles Hinata's hair with his hand. It's warm and firm and Hinata leans into it. Kageyama does not move his hand away.</p>\n<p>“I thought maybe after seeing you come out of the shower, I would have figured out the secret to that nest you call hair, but I guess it really is just like that all the time after all.” Kageyama keeps on ruffling.</p>\n<p>Hinata finally bats his hand away, turning to scowl at him. “Just because some of us aren't weighed down by our horrible personalities doesn't mean you have to be jealous, Kageyama,” but he reaches up and tries to smooth his hair out anyway. </p>\n<p>Kageyama's hand is back in his hair, gripping a little too hard for comfort in that stupidly familiar Kageyama way, and Hinata laughs because he knows he won this round. Eventually they both flop back on the bed, warm and sort of sleepy, and Hinata yawns.</p>\n<p>“Weren't we supposed to study?” Kageyama tilts his head to look at Hinata, and Hinata shrugs.</p>\n<p>“Yeah, I didn't actually need help studying.” He probably could use help after all, but that's not why he wanted to come over. “When does your mom get home, anyway?”</p>\n<p>Kageyama shrugs. “She's working late tonight.” He watches as Hinata stifles a yawn, then sits up. “I'll go get out the guest futon and we can go to sleep. It's never been used, so...”</p>\n<p>“Oh. Okay.” Now that they don't have anything to talk about and Hinata's left thinking about how he's about to actually sleep in Kageyama's room, the very first time he's ever been in it. He's kind of excited, actually. It's not like he's never seen Kageyama sleeping, but this is definitely the first time they've been alone together. It feels weirdly intimate, but Hinata finds that he's okay with that. He wonders if he'll ever manage to get Kageyama to agree to spend the night at his house.</p>\n<p>He's jolted out of his daydream by the sound of Kageyama's voice. “I said it's all set up, are you going to get into bed or what?”</p>\n<p>“Hmm...” Hinata pretends to think about it. “Kageyama, do you have pajamas I can borrow?”</p>\n<p>Kageyama's face turns pink. “You seriously think anything I own is going to fit that tiny body of yours? I'm not even sure how you manage to find clothes while you're shopping unless it's in the kiddie section.”</p>\n<p>“Fine, I'll sleep naked!” Hinata says with a huff, already going to pull his shirt off. At that Kageyama's face turns visibly redder, although Hinata really doesn't see why it's such a big deal since they get changed near each other pretty much every day. </p>\n<p>A pile of clothes hits him in the face.</p>\n<p>“Thanks,” he says, muffled by the shirt and shorts that smell exactly like Kageyama. He tosses them to the side as he pulls off his own clothes, leaving them in a heap which he notices Kageyama eying disdainfully. He ignores it to pull on the shirt which he's only swimming in a big; it's falling off one shoulder but it's surprisingly comfy. The shorts, however, refuse to sit on his hips, and he gives up and settles for just wearing his boxers.</p>\n<p>By the time he looks over at Kageyama, he's already disrobing, pulling his own shirt over his head. Hinata watches, distracted, as Kageyama's stomach muscles clench; he's extremely fit and while Hinata knows that well enough, this is the first time he's ever really paid attention to it without being distracted by something else, like volleyball or racing to see who could get to the gate faster after practice. He briefly wonders what it would be like to run his hands over those abs, and begrudgingly admits there might be a reason for the confessions Kageyama was always getting. Too bad his personality was shit.</p>\n<p>“Oi.”</p>\n<p>Hinata looks up to Kageyama's face, blinking. How long had he been staring? Apparently long enough for Kageyama to finish getting dressed, because he's in a t-shirt and sweatpants and giving Hinata a weird look.</p>\n<p>“Oh, uh...I'm ready for bed!” Hinata scrambles for the covers, burrowing under them. He pokes his head out, grinning. “Now you.”</p>\n<p>Kageyama rolls his eyes and turns out the lights, stepping over Hinata to crawl into his own bed. Hinata chirps out a “goodnight!”, Kageyama grunts in response, and they fall into silence. It has never taken Hinata very long to fall asleep, especially considering the double exhaustion of volleyball practice and their earlier 'activities', and he can feel himself drifting already. He's probably dreaming, but he hears a soft “goodnight” come from Kageyama's bed.</p>\n<p>The futon is surprisingly comfortable, Kageyama's shirt is warm and smells nice, and it leaves Hinata with a soft feeling in his stomach. He sleeps soundly, dreaming about spiking tosses and rough hands and soft lips, and it's honestly the best he has slept in a while.</p>\n<p>That is, until he wakes up around 2 in the morning, having to really, really pee. He fumbles to get the covers off of him, yawning, and the floor is cold and there's a draft touching his skin where the loose fabric of Kageyama's shirt is hanging off of him, and he really doesn't want to get out of bed because he's way too warm and cozy. Nature calls, though, and he stumbles his way to the bathroom and does his business in that daze between sleeping and waking. He rubs his eyes as he wanders back into the bedroom, spotting his bed and climbing back into it. There's a weight there and he nudges it over, settling back into a comfortable position before he falls back asleep.</p>\n<p>Hinata doesn't wake again until the sun is filtering through the window, and he stretches. He's confused for a minute, because this isn't his bed and this isn't his house, but then he remembers he's spent the night at Kageyama's house. He yawns and rubs at his eyes, and glances down at the floor.</p>\n<p>The floor where Hinata's futon is, blankets messed from when he had gotten up to pee. A sudden wave of horror goes through him and he feels his stomach drop. Kageyama is absolutely going to kill him for sleeping in his bed with him, even if it was an accident. He glances behind him; maybe Kageyama is still sleeping and he can sneak back to his own bed.</p>\n<p>Kageyama is still sleeping, thank god, and Hinata heaves a sigh of relief. His hair is messy, at least as messy as Kageyama's hair can get, which is nothing compared to Hinata's, and his face is pressed comfortably against Hinata's shoulder.</p>\n<p>In fact, that's not the only thing pressed comfortably against Hinata. He doesn't know why he hadn't noticed it before, but there is something definitely hard and warm poking into his back. Hinata stiffens for a minute, almost panicking before he realizes something: this is the perfect opportunity to settle the score between them. He has something he's been saving, too; he had been wondering when he'd be able to try it, since it seemed like something Kageyama would look extremely annoyed-embarrassed about, and even though Hinata thinks that face is pretty endearing, (for Kageyama), he wants to be able to pull this off.</p>\n<p>Hinata carefully shifts, testing to see if Kageyama is going to wake up. He doesn't, instead groaning and rolling over onto his back. His face is looking a little red, and Hinata wonders if he's dreaming about something embarrassing. He'll have to ask him later, if Kageyama doesn't kill him for what he's going to do.</p>\n<p>Slipping carefully under the covers, Hinata wriggles himself over one of Kageyama's legs, nudging the other one open a bit more so he can fit comfortably between them. It's a little hot and stuffy, but Kageyama is still asleep and Hinata is feeling giddy with how thoroughly he's going to own the taller boy. Hinata might be small, but like this, they are completely even, and he definitely feels smug about it.</p>\n<p>The smugness wavers a little as Hinata slowly, slowly pulls down Kageyama's sweatpants. He's not wearing anything underneath them, so Hinata is very suddenly faced with Kageyama's morning erection, which seems as pert and awake as he is himself. Under here, the scent of Kageyama that clung to his shirt is very strong and warm, and it makes Hinata feel a little calmer.</p>\n<p>“Good morning,” Hinata says, trying to steel himself by talking to Kageyama's dick. He imagines it saying good morning back and muffles a laugh against his shoulder. This is a little scary, but he is absolutely determined when he thinks about how great it's going to feel when Kageyama grovels and admits Hinata is so much more amazing than he is.</p>\n<p>Hinata experimentally rubs his thumb under the head of Kageyama's cock, testing it out. It's kind of big, but he's watched a few videos (not that he'll ever admit that to Kageyama), and he thinks he can probably do it. No, he's sure he can do it. He tests it by licking the tip with his tongue.</p>\n<p>It's salty and warm and weird, but Kageyama groans in his sleep, and it goes straight to Hinata's dick. Kageyama has never been super vocal, even after the stuff they've done, so this is new. He's eager to draw that noise again, so he squares his shoulders and takes Kageyama into his mouth.</p>\n<p>Kageyama is moaning this time, and one of his knees moves up and knocks into the side of Hinata's head. It's gentle and kind of weirdly comforting; Hinata has always been reassured by physical contact, so he guesses it's not that weird. What is weird, though, is how hot Kageyama is on his tongue. He can only fit a bit of it in, so he brings his hand up to fit around the rest of it. He's read about gagging and he's not too eager to puke all over Kageyama's crotch on the first night he let him sleep over.</p>\n<p>Hinata moves his head a little, taking in more, and then letting it slide out. It's not as bad as he thought it would be, and it's sort of twitching a little and that's kind of hot, that he's making Kageyama do that with his mouth. Kageyama's getting noisier and Hinata doesn't think he has to keep this up much longer. He's feeling so satisfied that he tries going just a little bit too far, and he's suddenly gagging and then Kageyama's dick is pulsing and there's a warm thick liquid filling his mouth and he's coughing and choking and pulling back, and he vaguely registers “Shit, shit, Hinata, what the fuck, oh my god--” before the blanket is thrown back.</p>\n<p>Very much awake now, Kageyama is grabbing Hinata's face. Hinata expected him to look shocked or angry or maybe both, but the majority of Kageyama's expression is worried. Hinata realizes he's still coughing and there's stuff dripping down his chin.</p>\n<p>Kageyama tries to wipe it up with the hem of his own shirt. “You fucking dumbass, what the fuck do you think you're doing?” There still isn't any actual bite to it, so Hinata just grins, still coughing a little.</p>\n<p>“Getting one over on you, stupid, and it totally worked.” He feels way more triumphant than he probably should in this situation. Kageyama's cheeks are red and his eyes are hazy and his hair is all over the place. Hinata thinks it's maybe the best he has ever looked.</p>\n<p>Seeing Hinata isn't about to choke, he sighs and flops back down onto his bed. “I can't believe what a dumbass you are. You almost suffocated yourself to...to suck my dick.” Hinata sees his face flush further. “I'm going to kill you.”</p>\n<p>Hinata just grins, despite the state of his face, and crawls back next to Kageyama, who doesn't even tell him to get back to his futon.</p>\n<p>After a solid week of pleading and hinting and threatening to steal his lunch, Hinata finally gets Kageyama to agree to sleep over on Saturday night.</p>\n<p>He hasn't had a sleepover since middle school, and the fact that his first one is going to be with Kageyama doesn't put a damper on his mood at all. With all the prodding and pulling to get him there, they haven't had any time to continue their little competition, instead preoccupied with who can finish eating their rice first or who can pick up the most balls after practice (Hinata can't help but crack an off-color joke at that one and Kageyama's eyeroll is worth it).</p>\n<p>He spends all of Friday night getting read, making sure his mom won't bug them and Natsu stays out of their hair despite her little tantrum about wanting to be included in Hinata's grown-up activities. She's placated with half of the cookie Hinata is eating and his mom ruffles both their hair and promises to leave the boys to their devices, although Hinata can tell she's excited to meet the Kageyama she's heard so much about.</p>\n<p>Finally, it's Saturday, and Hinata knows he's a little off during practice because of the glares Kageyama keeps shooting him while they're practicing. Hinata just grins and asks him for one more toss and, despite his apparent annoyance, Kageyama relents and gives in as usual. They clean up in record time (mostly because of Hinata's unwavering energy) and soon enough are walking side-by-side, Hinata wheeling his bike.</p>\n<p>“Are you sure you don't want to ride on the back?” Hinata asks while they walk, because it would be a lot faster and last time they'd done it Kageyama had clung on for dear life, which was more than a little hilarious.</p>\n<p>Kageyama shakes his head furiously. “I know how you handle that thing, I've seen you wipe out at least three times and the last time we did that you almost killed us.”</p>\n<p>Hinata can tell Kageyama is nervous about something, and he doesn't think it's the memory of riding Hinata's bike together.</p>\n<p>“Kageyama...could it possibly be that you're worried about spending the night at my house?” He can't help the smile tugging at the corners of his mouth.</p>\n<p>“No! I'm not five, dumbass, and I've spent the night places before, you know that!” Kageyama, despite his assurance that he's not nervous, fiddles with his bag's strap. It's just...you have a little sister, right?”</p>\n<p>Glancing over, Hinata nods. “Yeah, but I made her promise not to bug us and my mom said she'll keep her away from my room. She barges in sometimes but I bought her a coloring book yesterday so she should be busy until she goes to sleep.”</p>\n<p>Kageyama keeps fiddling with his strap. “I'm not...that great with kids.”</p>\n<p>At that, Hinata laughs, because Kageyama isn't that great with anyone. The last time they'd come across a cat and Hinata had urged him to pet it, it had scratched his hand and he'd scared it off yelling obscenities. He ignores the dirty look Kageyama gives him.</p>\n<p>“Natsu is great with anyone, okay? She is my sister, after all! If I can tolerate Kageyama, she definitely will be able to.”</p>\n<p>They fall into a calm, if not comfortable silence (Hinata is used to more bickering, but he'll take it). By the time they reach Hinata's, Kageyama looks like he has steeled himself for a really hard boss fight; his hands are clenched at his sides and he has a really scary look on his face. Hinata parks his bike and grabs Kageyama's hand. The taller boy looks startled but doesn't pull away, and Hinata fits their fingers together comfortably.</p>\n<p>“Come on, my mom was really excited to meet you.” He drags Kageyama to the door, tugging at his arm. They step inside and Kageyama barks out a “sorry to intrude”, but before he can slip his shoes off he's pulled into a hug, courtesy of Hinata's mom.</p>\n<p>The look on Kageyama's face is priceless; he looks torn between shouting and mortification. He keeps stiff and quiet until Hinata's mom pulls away and holds him out at arm's length, looking him over. Hinata stifles a laugh.</p>\n<p>“I've heard so much about you, it's wonderful to finally meet you! Shouyou is always talking about your volleyball club, it's been so long since he's had a friend over--”</p>\n<p>Hinata finally steps in with a cough, tugging on the back of Kageyama's jacket. “Mom, Kageyama and I have a lot of important homework stuff to do, so...”</p>\n<p>“Of course, of course!” His mother finally releases Kageyama, who looks like he's in shock. Really, he should have expected this from Hinata's family. “I'll make some snacks for you boys; it's Saturday so don't work yourselves too hard!”</p>\n<p>They make it up to Hinata's room in record time, Hinata shoving Kageyama inside and closing the door, slumping against it. He's grinning, though, and Kageyama still looks shell-shocked.</p>\n<p>“I told you my mom was excited,” says Hinata, tossing his bag to the floor and walking across the room to flop on his bed.</p>\n<p>“I can see where you get it from.” Kageyama drops his bag next to Hinata's and shrugs out of his jacket. He is looking a little hot, but relieved.</p>\n<p>“At least Natsu was busy doing...” Hinata trails off as he notices his door crack open. There is a tiny eye peeking through it and he rolls his own. Speak of the devil. “Come in, Natsu. You have to get better at pretending you're not listening in on my conversations if you're going to do that at all.”</p>\n<p>Natsu, hair a spitting image of Hinata's own mess, shuffles through the door. She looks so tiny next to Kageyama that Hinata laughs.</p>\n<p>Kageyama is back to looking awkward and petrified, staring down at the little girl who has placed herself next to him.</p>\n<p>“Natsu, this is my friend, Kageyama!” Hinata sits up on his bed and puts his chin in his hands. “He's staying the night like I said, so don't you dare bug us. I'm being nice and letting you meet him so you stop asking.”</p>\n<p>Natsu and Kageyama stare each other down. Kageyama looks like he's fully expecting her to run screaming out of the room. When Natsu finally grins up at him, Hinata finds himself grinning too.</p>\n<p>“Um, hi.” Kageyama glances over at Hinata like he isn't sure what to do.</p>\n<p>“Hi!” Natsu rocks on the balls of her feet. “I'm Natsu!” She holds out her hand like she's learned to do recently; she's been shaking everyone's hand lately. </p>\n<p>Although adorable is a word Hinata would never use with Kageyama under normal circumstances, he allows it to slide this time as he watches Kageyama gingerly shake Natsu's tiny hand with his own big one. Natsu's smile grows bigger and she launches herself at his leg, looking up at him.</p>\n<p>“You're so tall! Shou-chan says that you can hit super high, will you?”</p>\n<p>Uh-oh, she's breaking out the Shou-chan stories. Hinata jumps up from the bed and moves to usher Natsu out of the room. “Okay, okay, Kageyama and I have important stuff to do so you have to leave us alone now!”</p>\n<p>Natsu pouts, and Kageyama looks between her and Hinata like he isn't sure whose side to take. Hinata huffs and puts on his own best pout, even though he knows he's no match for Natsu's baby face. He grabs Kageyama's sleeve. “Don't you dare give in to her or she'll never leave you alone.”</p>\n<p>“Sounds like it runs in the family,” he hears Kageyama grumbling, but he sounds like he's in a good mood, for Kageyama.</p>\n<p>“Wave goodbye to Kageyama, Natsu!” Hinata demands, pushing her towards the door. “Maybe if you're good he'll say hi to you before he leaves.”</p>\n<p>He's almost got her out the door when she turns and waves, smiling. Hinata happens to glance up at Kageyama, when he notices something.</p>\n<p>Kageyama is smiling, too.</p>\n<p>Okay, so it's not exactly a smile, but it's more of a smile than Hinata has possibly ever seen on Kageyama's face except for the rare times when he and Hinata get their quick just right. He waves at Natsu and then Hinata is shutting the door on her, not feeling bad over her “hey!” of protest.</p>\n<p>“Shou-chan, huh?” Kageyama looks so much more at ease now and for some reason it bugs Hinata. He huffs.</p>\n<p>“Shut up. How come you never smile at me like that?”</p>\n<p>The sort-of-smile is wiped off Kageyama's face instantly, replaced with a grimace. “I wasn't smiling.”</p>\n<p>“You totally were!” Reasonably, Hinata knows that it's almost impossible to not smile back at Natsu, but Kageyama is his friend and he thinks he deserves a smile every once in a while. He'd probably even settle for the one that looks like Kageyama just got done murdering someone and Hinata's next.</p>\n<p>“Are you jealous of your kid sister?”</p>\n<p>Hinata freezes, and then he can feel his face turning red. “No! I'm just saying.” He trails off, puffing his cheeks and looking off to the side. “Anyway, she's out of the way now, so...”</p>\n<p>He hears the rustle of fabric and when he looks up, he's shocked to see Kageyama right there, leaning over him.</p>\n<p>“Shou-chan is seriously jealous of a baby?” Kageyama's teasing jerkass demeanor is definitely back, and Hinata regrettably thinks he prefers the nervous, awkward meeting-the-family Kageyama. And the way he says Shou-chan, even if it's mocking, does something weird to his stomach.</p>\n<p>“I told you I'm not!” Hinata shoves at Kageyama's chest, but Kageyama doesn't budge. Instead, he uses his full weight and leans, leans leans, until both he and Hinata are toppling onto Hinata's bed. Hinata yelps, shoving at Kageyama's shoulders.</p>\n<p>“Get off, stupid Kageyama!” Kageyama is heavier than he has a right to be, especially when it seems like he's playing dead weight just to piss Hinata off.</p>\n<p>“Get off?” Kageyama props himself up on his elbows above Hinata. “Or get you off?”</p>\n<p>Hinata blanches. “What are you talking about, I'm not even--”</p>\n<p>He is, though, and he could kick himself for just noticing the stiffness where Kageyama's hip pushes into his groin. He blames it on hormones and Kageyama's sudden attack and tries not to think about Kageyama saying his first name—maybe not Shou-chan, maybe Shouyou. He groans in exasperation and a little something else and pushes at Kageyama again.</p>\n<p>“My mom and my sister are home,” Hinata supplies weakly. He remembers that they haven't done anything all week and it's no wonder he's getting excited like this.</p>\n<p>“We can be quiet.” Kageyama gives him a look. “At least, I can be quiet. I'm still not sure about you.”</p>\n<p>“I can be quiet!”</p>\n<p>“You haven't been quiet any of the other times we've done stuff,” Kageyama points out, and Hinata hates that he's right, but he excuses himself with the reminder that he hadn't really have to be quiet those times. He sets his jaw.</p>\n<p>“Try me.”</p>\n<p>Kageyama's face sets into that determined look he gets when he's playing volleyball, and Hinata shivers.</p>\n<p>“I'm going to destroy you for last week,” he says, leaning up. He cracks his knuckles like he means business and Hinata rolls his eyes.</p>\n<p>“You suck at this, Kageyama, aren't you supposed to be romantic in this kind of thing? No wonder you don't have a girlfriend yet.” Hinata sticks his tongue out but he's immediately sucking it back in along with a deep breath when Kageyama yanks his pants and his boxers down in retaliation.</p>\n<p>Hinata almost yelps, but he hears tiny footsteps patter down the hall and remembers that they are definitely not alone this time, and it probably wouldn't be good if Natsu walked in on this. He considers telling Kageyama, suggesting maybe they should hold off, but the puffs of breath against his dick are going to his head and he doesn't really want to stop Kageyama from whatever he's about to do. Especially not with the way Kageyama is looking at him.</p>\n<p>He can feel his face getting warm as he watches Kageyama's eyes flick from his face to his very-apparent erection, and he starts to fold into himself a little because this is somehow way more embarrassing than all the other times they've done this. It might be because he's in his own room, on his own bed, with his mom in the kitchen. It's certainly more intimate than he's used to. He doesn't think Kageyama's face has been this close yet, either.</p>\n<p>It's taking Kageyama a while to do anything, and Hinata wonders if he was just teasing after all. Or maybe...maybe he's having second thoughts about this whole thing, and he'd give up and Hinata would be the winner, finally. Although that's probably the most desired outcome, Hinata can't help but feel disappointment creeping into his stomach. </p>\n<p>He's about to nudge Kageyama and tell him it's fine if he doesn't want to do this, plus he's the idiot who initiated it, when Kageyama leans down and takes Hinata into his mouth.</p>\n<p>Hinata does yelp, this time. It's not the entire thing, not even close, but it's enough that Hinata's head goes fuzzy and his hips jerk. Kageyama grunts and glares up at him, and Hinata stammers out an apology.</p>\n<p>“It's your fault for doing that so suddenly,” he grumbles after, thinking Kageyama wouldn't hear him, but Kageyama pinches his thigh a little too hard and Hinata squeaks. “Don't be an ass, Kageyama!”</p>\n<p>Kageama doesn't move his mouth and therefore can't say anything, but Hinata swears he can tell by his eyes that Kageyama is looking at him smugly, as much as he can. He's about to push Kageyama off for real, but Kageyama acts first by taking Hinata further into his mouth.</p>\n<p>Hinata's arm shoots up to cover his face and he breathes out into his elbow. He doesn't remember being able to take this much when he did this to Kageyama. Actually, he's kind of shocked Kageyama would do this at all...maybe he's read up on it? Has he had experience? A knot briefly starts to form in Hinata's stomach at the thought of Kageyama doing this to some other guy, but Kageyama is making a noise around him that sounds irritated and feels amazing.</p>\n<p>He glances back down, and Kageyama looks at him as if to tell him to pay attention. Hinata wishes he didn't look so good like that. The hand that isn't covering his face flutters at the sheets of his bed until Kageyama grabs it and drags it down to his hair, and Hinata's fingers sink into smooth silk and his face goes even redder because he's pretty sure he's seen this in a porno, accidentally.</p>\n<p>Reassuringly, Kageyama can't get Hinata completely in at this point, but it's enough and he moves his own hand to deal with the rest of it. His fingers brush against Hinata's balls and he can feel the calluses and he whimpers, trying to be quiet, but he's never really been good at keeping his voice in. He closes his eyes and tries to take deep breaths. He thinks he might actually pass out, but that's okay right now because he's pretty sure his thighs are shaking.</p>\n<p>Kageyama is doing sinful things with his tongue and Hinata hates how good it feels, mostly because Kageyama hadn't even been awake enough when he went down on him to react like this. Suddenly, Hinata feels a pressure, and Kageyama is sucking his dick, he's literally sucking it and Hinata's legs are really shaking now if they weren't before. Hinata tugs at Kageyama's hair, trying to pull him off before he does the unthinkable.</p>\n<p>He comes in Kageyama's mouth.</p>\n<p>“I'm sorry!” Hinata immediately groans, as soon as he catches his breath. He's sure Kageyama is going to kill him.</p>\n<p>However, Kageyama just sits up and shoots him a look, and it kind of looks like he's gloating. Hinata realizes that Kageyama didn't choke, and as he sticks his tongue out, Hinata goes scarlet.</p>\n<p>Kageyama swallowed it all and Hinata swears he hates him.</p>\n<p>His arms go back over his face and he just lies there, horrified and embarrassed and pissed off at Kageyama for beating him at this one. He tells himself he's going to do an internet search as soon as Kageyama leaves tomorrow.</p>\n<p>A sudden knock on the door has Hinata jolting up, realizing his pants are still down, and scrambling to get them over his hips and his softening dick.</p>\n<p>“Shou-chan, are you playing? I want to play too!” Natsu sounds indignant and Hinata is horrified that she heard whatever had just gone down in his room.</p>\n<p>“Go away, Natsu!” Hinata's voice cracks and Kageyama looks back at him, and Hinata swears he's laughing. It's a quiet Kageyama laugh, but he is definitely laughing, and Hinata hates him even more. He can see Kageyama shifting uncomfortably, though, and that's when he knows he can get revenge.</p>\n<p>Hinata manages to get his pants up and stumbles over to the door, trying to smooth his hair down because he feels like it's sticking up more than usual. He cracks it open.</p>\n<p>“Since I'm such a nice brother, I'll let you play with Kageyama just this once.” He opens the door wider, and Kageyama looks shocked and horrified and shakes his head frantically. It's too late, though; Natsu is bounding through the door and yelling and raising her coloring book above her head.</p>\n<p>“Color with me, Yama,” she says, and Kageyama glares up at Hinata. Hinata just smiles innocently and sits down next to him, patting the floor for Natsu to join them.</p>\n<p>Natsu sits herself a little too close to Kageyama, (Hinata is supposed to be the one sitting next to him, it's his friend), but she looks so happy that Hinata can't even complain. Kageyama can't either, apparently, and his face softens just barely as Natsu shows how she's colored the ponies a jarring mint-green. It's kind of cute, actually.</p>\n<p>Natsu, not Kageyama.</p>\n<p>Maybe Hinata doesn't hate him that much after all.</p>\n<p>The rest of the sleepover passes uneventfully, although Hinata can't complain because he hasn't had that much fun in a while, even if it's with Kageyama. Monday arrives, and everything is the same between them; they race to the gym in the morning, they race to lunch in the afternoon, they race to practice after.</p>\n<p>Everything is the same, but Hinata occasionally finds his mind drifting to how it felt to have someone else's mouth on him. Kageyama's mouth on him. He hadn't asked, but he's pretty sure now that Kageyama had been planning that and he's still kind of annoyed that he'd managed to swallow without choking. Every time Hinata things about it, his face gets red and he pretends to be furiously into doing something else to avoid questions.</p>\n<p>They fall into their usual routine of bickering and practice and sometimes walking partway home together after school (they rock-paper-scissors for who has to buy meat buns; Hinata thinks Kageyama is letting him win most of the time).</p>\n<p>Today, though, something is different. After practice, Kageyama tells Hinata he has something to do and to wait for him at the gate. Hinata doesn't ask; he's too busy thinking about what he'll make Kageyama get them as a snack when he inevitably loses rock-paper-scissors. He packs up his stuff and hurries out to get his bike. He doesn't mind waiting, but he is getting kind of hungry.</p>\n<p>Hinata takes his time, but by the time he wheels his bike to the gate, Kageyama still isn't there. Maybe he's meeting with a teacher or something; despite Kageyama teasing him about his marks in class, Hinata knows for a fact that Kageyama is no genius either. If he's too late, Hinata's going to tease him about it later.</p>\n<p>Kageyama comes running up a few minutes later, out of breath. “You didn't actually have to wait, idiot, I thought you'd have gone on ahead of me.”</p>\n<p>“You told me to wait for you!” Hinata huffs, but he thinks Kageyama looks kind of glad he's still there. “Plus, you'd be lonely without me to walk you home.”</p>\n<p>Snorting, Kageyama adjusts his bag and starts for the gate. Hinata's hurrying after him when he sees something pink peeking out of Kageyama's hastily-stuffed bag. He walks faster, having to keep up with Kageyama's longer strides, but his curiosity is piqued. He's sure that hadn't been in Kageyama's bag before practice.</p>\n<p>“Kageyama, what were you doing, anyway?” Hinata settles into a comfortable pace beside him. Kageyama shrugs, but that's not an answer Hinata is satisfied with. He presses. “Come on, what's in your bag? Unless you started liking pink stuff.”</p>\n<p>That seems to get Kageyama's attention, and he shoots a glare at Hinata. “Since when did you become such a busybody? I had to meet up with someone.”</p>\n<p>Suddenly, Hinata gets it. He feels shock settling in his stomach, as well as something he can't quite place, but it feels like when he misses one of Kageyama's tosses. He shrugs it off. “A girl? Did a girl confess to you, really?” A girl confessing to someone like Kageyama, of all people, sounds foreign to Hinata, although he knows Kageyama has been confessed to before. Usually it slips his mind, because Kageyama is such a piece of shit sometimes that he can't see him ever dating a girl, and still can't understand why girls would like Kageyama.</p>\n<p>When Kageyama's face goes red, Hinata knows he's got it and feels a little smug despite the unease in his stomach. “She asked me to meet her after practice. She wanted to give me something, so I accepted.</p>\n<p>“You accepted?!” Hinata's voice sounds a little shrill, even to himself, so he focuses on the wheels of his bike and tries again. “You, dumbass Kageyama who can't even compliment me properly, accepted a confession from a girl? What did you do to her that she didn't run away when confronted with your scary face?”</p>\n<p>“My face isn't that scary!” snaps Kageyama. “You're an idiot, I didn't accept the confession, I accepted the cookies she made me. I figured you might like them, so I decided I didn't have to refuse them. It seemed to make her happy, anyway.”</p>\n<p>Kageyama is looking away, and Hinata's suddenly glad because he can feel his face heating up. The relief flooding his stomach is incredible; he's never actually considered what would happen if Kageyama happened to get a girlfriend. Kageyama is just so unpleasant, Hinata can't really imagine him being romantic with anyone. Kageyama kissing a girl? No way.</p>\n<p>“I guess that means we don't have to get snacks today, huh?” He looks over at Kageyama with a grin, and Kageyama finally looks back at him. Hinata thinks he can see something akin to relief in Kageyama's face as well, before it's overtaken by a roll of his eyes and he's reaching over to yank at Hinata's hair.</p>\n<p>Hinata swats at his arm and Kageyama relents, and they walk in silence for a little while before Hinata thinks of something else.</p>\n<p>“Hey, Kageyama, do you want a girlfriend?”</p>\n<p>Kageyama glances at him again. “Why are you asking that now all of the sudden? It's not like this is the first girl who has bothered me after practice. I guess for some unpopular shrimp like you, it's something to be impressed by.”</p>\n<p>“I'm not unpopular!” Hinata protests, sticking out his tongue. “And you didn't answer my question! Do you want one?”</p>\n<p>“A girlfriend?” Kageyama looks up at the sky. “I don't think so, it sounds kind of troublesome. If I had a girlfriend, I'd have to take her out to do stuff and that would cut into practice, wouldn't it?”</p>\n<p>Nodding, Hinata agrees furiously. “Yeah, me too. Although I wouldn't mind getting sweets from girls sometimes.”</p>\n<p>“I already told you that you can have these. I don't like sweets that much anyway, so it would be a waste for me to keep them.”</p>\n<p>They fall quiet again, Hinata momentarily distracted by the thought of sweets; it's not meat buns, but he isn't exactly complaining. Maybe he'll even treat Kageyama to snacks tomorrow. There's no way a girl would be as tolerant with Kageyama as he is, he thinks. It's taken him this long just to understand how dumb Kageyama is, and he's sure the charm would wear off for that poor girl the second she goes to kiss him and he gives her that scary face of his.</p>\n<p>“Dumbass, I don't look that scary!” Kageyama's ruffled retort makes Hinata realize he's been thinking out loud, and his face flushes, but he persists.</p>\n<p>“You do, you even look scary right now! And when you saw that cat yesterday, you looked even scarier.”</p>\n<p>“Did I look scary when we kissed?”</p>\n<p>Hinata is caught off guard. Had they kissed? He'd honestly forgotten about that, but when he thinks for a moment, it comes back to him. On the floor of Kageyama's room, they had definitely kissed. He realizes why he's tried to forget it when his face turns red.</p>\n<p>“I don't know because that was my first kiss and I wasn't thinking about your stupid face!”</p>\n<p>Hinata expects Kageyama to shoot back with something like “my face isn't stupid, you're stupid,” but when he doesn't, Hinata looks back up at him. He's sort of startled to see Kageyama looking back at him, a weird expression on his face that sort of looks like...guilt? Is Kageyama capable of feeling guilty?</p>\n<p>“I didn't know that was your first kiss.” Kageyama hurriedly looks away and Hinata huffs as he walks faster unconsciously. Sometimes it's hard to keep up with his long legs, not that he'd ever admit it. “Sorry, I guess.”</p>\n<p>Hearing Kageyama apologize for something so stupid when he won't even apologize for normal things throws Hinata off. “It's not that big a deal, it had to happen sometime, right? I guess even if it was with you, it's okay. I don't even really remember it that much.”</p>\n<p>Kageyama is still being weirdly quiet, and Hinata doesn't like it. He likes their usual banter; fighting, talking about volleyball, the way Kageyama actually gets sort of animated when they're discussing a game they saw on TV.</p>\n<p>“Was that your first kiss, Kageyama?” Hinata feels like Kageyama still wants to talk about this, so he pushes forward.</p>\n<p>His curt nod is imperceptible, but Hinata can still see it, and he feels a grin sneaking over his face. “I can't believe with all the girls who like you, none of them have ever been brave enough to actually kiss you.”</p>\n<p>“It's not like you were, either!” Regular annoyed Kageyama is back again, and Hinata feels lighter. “You don't even remember it!”</p>\n<p>Hinata frowns, and falls silent. It's true he didn't really remember it; it hadn't been that long, and other, more memorable things had been happening down below. He remembers it was warm and he was surprised it had happened at all, and now he sort of wishes he remembered it better.</p>\n<p>He sees the park they walk past coming up a little ways ahead, and suddenly has an idea. When they get close enough, he stops and parks his bike. Kageyama is looking at him questioningly.</p>\n<p>“What are you, ten?” says Kageyama. Hinata's too busy grabbing his sleeve and pulling him over to a bench to bother reminding him that they'd played on the swings here just last week, and if he was ten then so was Kageyama.</p>\n<p>The bench is a little further back so you won't see it immediately from the road, and it's shaded enough by the trees that Hinata feels this is an okay location. He pushes Kageyama down on it.</p>\n<p>Kageyama is still looking skeptically at Hinata. “What, you want to eat the cookies now? Do you really have that much of a one-track mind?”</p>\n<p>“Oh my god, would you shut up for like five seconds?” says Hinata with a huff, and then he leans down and kisses Kageyama.</p>\n<p>It's very brief and he doesn't feel much of anything, and he sort of regrets not having looked this up on the internet like he had with other things. He pulls back, and Kageyama, to his relief, doesn't look annoyed or put-out. He looks startled, maybe, but that's not too bad. Hinata thinks that that was Kageyama's second kiss, and both had been with him. He feels weirdly triumphant, and moves in closer.</p>\n<p>“Wait, what are you doing, idiot?” Kageyama, finally having found his voice, grabs Hinata's arm. “Are you stupid?”</p>\n<p>Hinata suddenly feels anxious. “You don't want to?”</p>\n<p>Kageyama stops and studies Hinata's face. Hinata looks back, nervous, until Kageyama seems to make up his mind and tightens his grip on Hinata's arm. “If that's the best you can do, you're a really shitty kisser.”</p>\n<p>Bristling, Hinata glares. “That wasn't the real kiss, okay? And I've never done this before. This is practice.”</p>\n<p>Rolling his eyes, Kageyama starts to get up, but Hinata pushes him back down. This height is way more manageable to him, but there's still too much of a distance for this to be comfortable, so he experimentally straddles Kageyama's lap. There's just enough space on the bench for them so sit comfortably, so he settles himself in and moves both hands to Kageyama's shoulders.</p>\n<p>They sit there like that for a minute, steeling themselves, maybe. Kageyama stares at Hinata and Hinata stares back. He moves his hands up to Kageyama's face, closes his eyes, and leans in.</p>\n<p>This time when their lips touch, Hinata tries to remember what it felt like when neither of them were trying. He shifts a little, and his lips slide to fit nicely on Kageyama's and yeah, this really does feel much better than the last one. </p>\n<p>After a few seconds, Hinata can feel Kageyama's lips pressing against his own a little more, and he breathes out. Kageyama seems to get a little worried and moves back a little, but Hinata follows him, not wanting to quit just yet when he feels like he's starting to get the hang of it.</p>\n<p>Kageyama's lips are chapped but warm, and Hinata thinks it's funny considering how cold and steely he looks all the time. He opens his mouth a little to say so, momentarily forgetting that they're actually pressed to Kageyama's, and then he feels something even warmer and much, much wetter touching his against his bottom lip.</p>\n<p>Hinata's grip on Kageyama's face tightens because that feels a lot nicer than he would ever have guessed. He feels a creeping warmth in his stomach and suddenly wants more, so he opens his mouth a little wider. He jolts when Kageyama's tongue slips in.</p>\n<p>It feels really, really weird. Despite that, Hinata finds himself chasing the feeling, barely registering when Kageyama's hands move to his hips instead of hanging limply at his sides. This is how people kiss in movies, Hinata realizes. He'd never seen the appeal that much before, but now he definitely does.</p>\n<p>Kageyama's tongue is experimentally licking the inside of his mouth when he gasps and moves back, but this time Kageyama is the one chasing him. He can feel a little drool slipping down his chin because breathing in this situation is very difficult to get a handle on, he finds, but his head is getting fuzzy and he doesn't care because Kageyama is so warm and wet. </p>\n<p>Suddenly, to his horror, Hinata feels something stirring down below and jerks back. When he opens his eyes, Kageyama is looking a little disappointed and his face is definitely red. He has a little drool dripping down his chin as well. Hinata feels a little proud of Kageyama's state until he sees Kageyama's eyes drop down to his lap and freezes.</p>\n<p>“Hinata...are you-”</p>\n<p>“Shut up!” Hinata's face is burning, and he glares. He moves to get up, but Kageyama's hands grip him tighter. “You're such a jerk, here I am giving you the great opportunity to practice so you don't screw up with your first girlfriend and-”</p>\n<p>Kageyama is kissing him again before he can finish his sentence. Hinata, fueled by irritation at being made fun of, decides this time he's going to be the one with his tongue in Kageyama's mouth, and he shoves it in unceremoniously. His annoyance fades, though, once he's actually inside Kageyama's mouth; it's hot, really hot. And, to his surprise, Kageyama moans.</p>\n<p>Hinata hates how that makes the heat coil in his stomach. He licks into Kageyama's mouth as it opens wider, and there's definitely drool cascading down his chin now but he doesn't care because his pants are tight and Kageyama's mouth feels way too good. He thinks about how a few days ago that mouth was on him, and he feels his hips twitch.</p>\n<p>A sudden pressure at the front of his pants has him moaning, too, and he pulls back, reluctantly. “Kageyama-”</p>\n<p>“Shut up,” Kageyama says, a bit breathlessly. His hand presses down on the bulge in Hinata's pants. “I wasn't going to make fun of you, stupid. Think before you jump to conclusions.”</p>\n<p>And then Kageyama is kissing Hinata, and grinding his palm down. Hinata's breathing stutters, and he hates how disappointed he feels that Kageyama's gross spitty tongue isn't in his mouth right now, so he opens it, trying to give him a hint. Kageyama takes it; they've always read each other well, and now is no exception, he guesses.</p>\n<p>Hinata feels a heat at his crotch, and realizes through the haze that Kageyama is hard, too. He grips Kageyama's shoulders and grinds his hips down as well as he can, and the friction is well-needed and amazing. This is the second time they've done it like this, but this position is totally different, and Kageyama's tongue slips out of his mouth as he groans and pushes Hinata's hips down with his hands. Kageyama's hands are really good for anything, Hinata finds himself thinking as he ruts down against the hardness in Kageyama's pants.</p>\n<p>They've stopped kissing now, since neither of them can concentrate on that when they're both urging their hips against each other. Hinata smushes his mouth against Kageyama's anyway, though, because he feels the urge to have as much bodily contact as possible. He slips his hands up from Kageyama's shoulders to the collar of his shirt, wiggling his fingers under the fabric to touch his skin, and Kageyama's hips jerk again, once, hard, and Hinata is suddenly moaning loudly and coming undone in his pants for the second time in a situation like this.</p>\n<p>He pulls back, panting, and lets his eyes fall on Kageyama. Kageyama is looking at him, but his gaze is unfocused, and there's spit that has begun to drip down his chin to his neck, and Hinata starts laughing.</p>\n<p>Kageyama glares, but Hinata notices that it doesn't really look as scary as usual. “You don't look that much better, dumbass Hinata. Get off me, my pants feel disgusting.”</p>\n<p>Hinata rolls his eyes and slides off Kageyama, but his pants don't feel that much better. He grimaces at the thought of having to walk home like this, but somehow it still feels like it was worth it even if they both end up walking funny all the way home. </p>\n<p>When he gets into his room to change, bypassing his mother as quickly as possible, Hinata notices the pink sticking out of his bag where Kageyama had at some point slipped the cookies into his bag. Although he feels a little guilty eating them, Hinata's glad it's him eating these stupid girl cookies instead of Kageyama, and not for the reason he would have thought.</p>\n<p>It's a week later, and Hinata still can't stop thinking about that kiss. Or kisses, to be more accurate.</p>\n<p>If he's going to be honest, Hinata hasn't really ever thought about kissing, or making out, or sex. He's mostly caught up in volleyball. His mother calls him a “late bloomer” and talks about how someday he'll have the girls all over him, and Hinata always tunes her out and goes back to flipping through the latest magazine he's got from the corner store.</p>\n<p>It's still mostly true; Hinata doesn't care about girls (or boys?) or kissing or any of that. He's only thinking about it because of Kageyama, and for some reason that annoys him to no end. He feels like Kageyama has gotten the better of him somehow and he hates it. Stupid fucking Kageyama and his dumb mouth and his dumb hands and his stupid broad shoulders that Hinata keeps finding himself staring at during practice.</p>\n<p>He's been off his game for the last week, and on Friday someone finally notices. They're out as a group, a treat courtesy of Takeda-sensei for a particularly hard day of practice. Kageyama and Hinata race there, and Kageyama winning by a hair makes Hinata even more irritated than usual.</p>\n<p>Kageyama seems to notice and stays pretty quiet; that is, he doesn't provoke Hinata about his eating habits and even bumps him with his shoulder once or twice to make sure he's okay, which Kageyama does sometimes and Hinata's not quite sure when it started. He should be mad at him for throwing him off, but somehow the shoulder bumps are okay. He can't bring himself to be annoyed at emotionally-stunted Kageyama actually trying to care about other people.</p>\n<p>When Kageyama gets up to get some juice, Asahi sits down next to him. Hinata almost doesn't notice, because Asahi is like that, despite his impressive stature. Hinata glances over when he hears Asahi clear his throat.</p>\n<p>“Ah, Hinata...” Asahi clears his throat again. “Is everything alright this week?”</p>\n<p>Hinata feels startled briefly; had he really been that off? He regains his composure though and bows deeply. “Sorry! I guess I've just been sort of tired this week...has it really been that noticeable?”</p>\n<p>Asahi chuckles awkwardly. “No, no, it's nothing like that, a few of us have just noticed that you've been a little quieter this week.”</p>\n<p>A few of us? Hinata glances around and sees Tanaka and Nishinoya sneaking a look at him. When they catch his eye, they hurriedly go back to talking too loudly like they'd been preoccupied with a conversation the entire time.</p>\n<p>“Believe me, it was hard enough to get them to settle down and stop threatening to beat someone up for you. Actually, Suga-”</p>\n<p>“Him too?!” Hinata realizes his voice is squeaky and snaps his mouth shut. He can feel his cheeks getting warm.</p>\n<p>Asahi's face starts getting red as well. “No! I mean, yes, but it's really not as bad as you think. We just wanted to make sure you're doing okay.”</p>\n<p>Sighing, Hinata stretches his legs out in front of you. “Have you ever kissed anyone before?”</p>\n<p>Asahi's face turns from slightly red to ashen in the span of three seconds. Hinata feels sort of bad, he should have known this would startle him, but he really had to ask someone before this threw him off any more than it already had.</p>\n<p>“Well, er...” Asahi looks like he's searching for an answer in the dirt. “Is that what this is about?”</p>\n<p>Hinata nods. “What does it mean when you kiss someone? Is kissing something that friends can do, or is that weird? I think there's a thing called 'friends with benefits' but I'm not even really sure that applies here when it's more like, you know,” Hinata motions his hands around in the air, “I have to prove that I'm not a bad kisser, right? How do you even become a good kisser without practice? Have you practiced with someone?”</p>\n<p>Asahi looks like he's about to faint under the rapidfire questions, and glances around worriedly like someone might be hanging around who can take over for him. When he sees nobody, he sighs and seems to shrink forward into himself, and Hinata's always found it weird how someone so big can have such little presence when he does that.</p>\n<p>“I think maybe Suga would be better suited to this sort of thing than me, um...” Asahi looks back to where Sugawara and Daichi are sharing notes on class, or practice, or something. Does Suga have experience in this kind of thing?</p>\n<p>Hinata must be thinking out loud again because Asahi is shrugging and shooting to his feet at the same time. “Good luck!” He pats Hinata on the shoulder and hurries away, leaving Hinata more confused than he had been initially. He looks around for Kageyama, because it sure is taking him a long time to get juice, but he's nowhere to be found.</p>\n<p>Sighing, Hinata gets up. He's finished with his meat bun and he might as well try his luck with Suga since Asahi, predictably, has been absolutely no help. He turns to go and nearly falls on his ass when he comes face-to-face with Suga's unnaturally sunny smile. Hinata has a sneaking suspicion this is a planned attack.</p>\n<p>Suga sits down and pats the seat next to him. “I couldn't help but overhear your conversation with Asahi. Sorry!”</p>\n<p>Hinata knows Suga isn't really sorry at all, and there's no way he could have heard their conversation all the way from over there, but he sits down anyway because he really sort of does need to talk to someone about it.</p>\n<p>“Honestly, we've all kind of missed you and Kageyama bickering this week,” starts Suga, and Hinata flinches.</p>\n<p>“It's not like we had a fight or anything!” he says immediately, and Suga laughs.</p>\n<p>“I know, I know! Actually...” He leans in conspiratorially. “Actually, Kageyama is the one who asked us to talk to you.”</p>\n<p>Now that surprises Hinata, but it's not the first time he's gone to Sugawara for advice. Leave it to Kageyama not to ask outright but to get someone else to do it. He really is the most awkward person Hinata knows, and he snorts before he can stop himself. He decides to just come out with it, like he'd done with Asahi, and maybe it would go better this time around. Hopefully.</p>\n<p>“Have you ever kissed anyone?”</p>\n<p>To his credit, Suga doesn't even look surprised. “Yes.”</p>\n<p>Hinata's not too surprised either, because Sugawara is super nice and he is two years older, after all. He might even have a girlfriend already, but Hinata hasn't heard anything about that.</p>\n<p>“Well, who was your first kiss?”</p>\n<p>Suga hums like he's thinking. “It was a good friend of mine.”</p>\n<p>Somehow Hinata feels incredibly relieved to know other people have gone around kissing their friends for maybe no good reason other than dumb competition. “So it's not weird or anything, it's not like a first kiss has to be absolutely special or anything, right?”</p>\n<p>“My first kiss was pretty horrible, honestly,” Suga says, but he sounds amused. “Neither of us knew how to kiss and I think my lip bled.”</p>\n<p>Hinata is already feeling loads better, because even his first kiss hadn't been that bad, so maybe he's going down the right path to being a master kisser even faster than Sugawara. “Right, so sometimes friends just kiss friends! I figured practice wouldn't be too bad, you know? Like, practicing volleyball but with kissing, you can't get any better if you don't try it!”</p>\n<p>Suga is watching him with a weird expression on his face, and then he laughs. “I guess so. Is that what you were worried about?”</p>\n<p>Now that it's out in the open and he's been validated, Hinata feels a little sheepish that something as dumb as friend-kissing had gotten in the way of his game. “No! I mean, kind of? Not really worried but I was thinking about it, you know?”</p>\n<p>“It's okay to experiment,” says Suga. “We were all worried you were being bullied because of the scary look on your face.”</p>\n<p>Hinata is about to respond when he feels a definite presence behind him, and turns to see Kageyama looming with two boxes of juice in his hands. Sugawara stands up and Hinata turns back to him in time to see a knowing glance on his face.</p>\n<p>“I've got to get back to Daichi to finish talking about next week's practice match, but I'm glad you're feeling better!” Hinata sees him glance up at Kageyama and smile. “You owe me a juice box too,” he says, and then he's off and Hinata and Kageyama are left staring after him.</p>\n<p>Hinata isn't quite sure what happened, but he is sure that he's going to knee Kageyama in the groin for starting it. He twists back around and fixes Kageyama with the meanest glare he can manage under the circumstances. “You are such a dumbass, Kageyama.”</p>\n<p>Kageyama glares back and sips at one of the juice boxes. “I'm not the dumbass who won't talk about stuff when he's feeling off, dumbass.”</p>\n<p>“I'm not the dumbass who can't talk to his friend when he thinks something's wrong, dumbass!” Hinata's up on his feet now and poking at Kageyama's chest, and he feels more like himself than he has all week. “Give me that juice box, all your stupid baby drama made me thirsty.”</p>\n<p>Kageyama fixes Hinata with a long, cold stare, brings the other juice box up to his mouth, and takes a deep sip.</p>\n<p>Before either of them know it, they're rolling on the ground, Kageyama trying to keep the juice boxes out of Hinata's reach while simultaneously trying to keep them from spilling all over himself. It's not working out that well, and by the time Hinata triumphantly wrestles one out of Kageyama's hand, they're both a little sticky with spilled juice and dirt. Hinata is sitting on Kageyama's chest as he takes a deep, long suck on the straw, slurping noises adding insult to injury, when he feels a slap on his back.</p>\n<p>“Seems like someone has finally dethroned the king,” says Tsukishima, and Hinata is too surprised to even be annoyed at him. Apparently even a jerk like Tsukishima had been worried about him...as worried as Hinata believes Tsukishima could get, anyway, which wasn't much. He finally regains himself enough to stick his tongue out at Tsukishima before squirting him with the leftover juice from the juice box in revenge.</p>\n<p>By the time everyone is done trying to squirt each other with their individual boxes (despite protests from Daichi), it's late in the evening, and Hinata pouts as Kageyama pulls him away from his stand-off with Tanaka. He waves after them, turning afterwards to Kageyama, who still has a hand around his wrist.</p>\n<p>“You have dirt on your face.”</p>\n<p>Kageyama grunts. “You have more on your face.”</p>\n<p>“I don't look as dumb as you do with dirt on your face.” Hinata's feeling giddy, so he doesn't even shake Kageyama's hand off. Kageyama seems to have forgotten it's there.</p>\n<p>Or not. His grip tightens and Hinata can tell he's trying to work himself up to say something honest. “Look, if something's bothering you, tell me. Especially if it's about me.”</p>\n<p>Hinata stops walking, and Kageyama follows suit, but doesn't let go of his arm. “How do you know it was about you? Not everything is about you, you know.”</p>\n<p>“Because you started acting weird after the park!” Kageyama's face is turning red again, like he has trouble bringing himself to talk about it. Hinata knows the feeling, and he suddenly feels kind of guilty for making Kageyama worry. He reminds himself that Kageyama wouldn't have been worrying in the first place if he had just asked.</p>\n<p>“That's not why! I was just thinking about stuff, okay? Suga-san said it's normal for friends to kiss each other anyway, so I don't even care anymore.”</p>\n<p>Kageyama looks shocked. “You told Suga-san?”<br>“No! I mean, not exactly? We were just talking about kissing, and stuff. I didn't mention you.”</p>\n<p>There's relief on Kageyama's face, but he still looks kind of scary. “If you don't want to do that stuff anymore, we can stop.”</p>\n<p>Somehow, the idea of stopping is worse than the feeling of thinking about it all week, and Hinata frowns. He's not going to let Kageyama sneak his way out of this one because he's feeling embarrassed, like always. “What, are you trying to get me to give up? Unless it's you who's scared of kissing, huh?”</p>\n<p>“Fuck off!” Kageyama releases Hinata's arm to tangle his hands in Hinata's hair. He shakes it a little. “You're trying to worm your way out of this competition that easily?”</p>\n<p>The knot that had appeared in Hinata's stomach uncoils itself and he grins. “Not if you aren't.”</p>\n<p>“I'm pretty sure I'm still ahead of you anyway,” says Kageyama, releasing Hinata's hair. “So even if you ended it, I'd still win.”</p>\n<p>Honestly, Hinata had begun to forget there had even been a competition there in the first place. Everything had started happening so casually that he kind of looked forward to it, honestly, although it's true he was still sort of spurred on by the feelings of competitiveness. He's been spending class lately thinking about ways to make Kageyama unravel faster, and it's sort of exciting, like volleyball but with a different payoff. Hinata blames his hormones.</p>\n<p>He's not going to tell that to Kageyama, though. “I'll race you home,” he says, and they're both off and it feels so familiar and comforting that Hinata swears he's running even faster than usual, which is pretty fast. He beats Kageyama squarely, who complains that the juice was giving him a stitch in his side, and shoves Hinata roughly but in that dumb affectionate way Kageyama has when he's trying to act like an asshole because it's what he does. Hinata is around Kageyama enough to know when the other boy is feeling as relieved as he is, and it settles comfortably around them as they part ways.</p>\n<p>“I'll see you tomorrow!” Hinata yells after Kageyama's retreating figure, and he feels possibly even better when Kageyama shoots a 'dismissive' wave behind him.</p>\n<p>On Saturday morning, Hinata wakes up hot, bothered, and with an uncomfortable hardness between his legs. It isn't like this hasn't happened before, but it doesn't happen often, and Hinata has never really remembered a dream that caused it.</p>\n<p>This time, though, rather than normal morning functions, Hinata definitely remembers. Bits and pieces, anyway, but it's enough to make him squirm with embarrassment and arousal. He glances at his clock—there's an hour before he's supposed to get ready for school. He considers whether or not he should actually do something about it, or pull the covers over his head and hope it goes away.</p>\n<p>While he's trying to decide, weighing the pros and cons, an image of warm, firm hands flashes across his mind and has done the thinking for him; his hand is slipping into his boxers and pressing against his very alert cock.</p>\n<p>Hinata groans into his pillow; he doesn't remember it being this bad the few times he's had to deal with it like this. He decides to forgo guilt because he is way too hot, allows his mind to drift, and palms himself.</p>\n<p>Kageyama's broad shoulders boxing him in, the way the muscles in his legs bunch as he's about to jump, the way his shirt smells; the way he looks without a shirt, panting and red on top of Hinata. Hinata feels like he should be embarrassed thinking about these things, but it feels way too good when he rubs against his hand, and for the first time, he wants to prolong it.</p>\n<p>He hears Kageyama saying his name, but not in the normal Kageyama way; breathy and needy and a little too low, but also just right. Not just Hinata, either, Shouyou...what would it sound like on Kageyama's tongue? That thought leads to him thinking about Kageyama's tongue on his skin, against his neck, what it would feel like licking along his inner thigh. Hinata rolls over and presses his face into his pillow to stifle the groan bubbling up in his throat.</p>\n<p>Hinata ruts down against his hand and his mattress, finally wrapping his hand around his dick. It's hot and hard and he already feels like he could come, but he doesn't want to. He wishes Kageyama were there because it doesn't feel as good with his own hand compared to Kageyama's bigger one. He doesn't know when it happened, but lately every time Hinata touches himeslf, he thinks about that firm grip, the hands that toss to him and promise to make him invincible. He thinks about those words coming off Kageyama's tongue and suddenly there's warm liquid against his palm and soaking into his sheets and he groans.</p>\n<p>He came embarrassingly fast, and he curses Kageyama into his pillow. He is definitely, absolutely not going to tell Kageyama about this. He is, however, going to get Kageyama alone and pay him back, for this shitty dream and his shitty hands and his stupid lame promise of invincibility.</p>\n<p>Afterwards, although he feels warm and limp, Hinata can't fall back asleep. He's too busy thinking about what Kageyama would be saying if he were here (“You seriously came just from thinking about that, stupid?”). Worse, he's thinking about Kageyama curled up at his back; they've never been like that, but Hinata doesn't think he would mind trying it. Being next to Kageyama is nice, even if he hogs the covers and snores (he swears he doesn't). It's amazing what you can learn about someone in one sleepover session.</p>\n<p>Feeling weirdly energetic despite one hour less sleep than usual, Hinata makes it to school in record time, skidding his bike to a halt outside the gates. They don't have practice this morning, so he doesn't see Kageyama anywhere. He really needs to stop thinking about Kageyama.</p>\n<p>Hinata locks his bike up and spots a group of his boys from his class chatting animatedly by a vending machine. One of them notices Hinata and waves him over. Hinata wouldn't say they're exactly close, but he's friendly with most of the boys in his class, so he trots over. He does have time to kill.</p>\n<p>“Hinata,” the boy is saying, “Look what I found in my brother's room under his bed.” He holds up a magazine and Hinata leans forward, genuinely expecting to see the latest issue of a sports magazine and ready to tell them he's probably already read it.</p>\n<p>It is most certainly not a sports magazine. The only round things on the cover are two very voluptuous breasts, staring Hinata right in the face.</p>\n<p>“That's not volleyball,” he says dumbly, and the boys laugh, assuming he's telling a joke, which Hinata's kind of grateful for.</p>\n<p>“Look, look,” the magazine boy says, flipping open a page to a girl in nothing but the bottom half of a bikini. “She's cute, right?”</p>\n<p>Hinata shrugs. “I guess so.” She's cute, yeah, but he really doesn't see why this was something they needed to call him over for.</p>\n<p>“You guess so?” His classmate flips to another page. “Maybe she's not your type. What about this one?”</p>\n<p>It's a busty brunette with big eyes and long lashes, and again, Hinata admits she's beautiful, but aren't all girls in these magazines? That's what they get paid to do, after all.</p>\n<p>“Seriously, nothing?” The group of boys is starting to look at him skeptically. “What kind of girl do you like, then?”</p>\n<p>“Uh...” What kind of girl does Hinata like? He doesn't think about it much. He likes to think when he finds the right girl, he'll know it, but he hasn't yet. His first real kiss was with a guy, after all. “Well, tall, maybe? And she'd have to be into sports.”</p>\n<p>A few boys in the group roll their eyes.</p>\n<p>Hinata, realizing they aren't satisfied, tries to think of something else. “Maybe a cute girl with...nice hair?” His mind is drifting to Kageyama again, and he wishes it would chill for a minute while he wracks his brain for his type of girl. “Athletic, like...you know!”</p>\n<p>The boys are still staring at him, and Hinata's starting to feel a little panicked. “Um, like, gwaah! You know...uh...” He can feel his face getting warmer. He should have just agreed that the girl in the magazine was totally hot and let it go at that.</p>\n<p>A hand on his shoulder makes him jump. He whips his head around, and up. Yeah, he definitely thought that death grip was familiar; Kageyama is staring past him at the group of boys.</p>\n<p>A few of them glance nervously at each other; Kageyama has a reputation, he's popular with the girls, and his gaze could sometimes freeze lava. But Kageyama looks passive, mostly. Hinata sees that there's a little bit of a weird look in his eyes, but he could be imagining it. He's so relieved to see Kageyama that he doesn't really care.</p>\n<p>“Aren't you guys supposed to be going to class or something?” Kageyama glances disdainfully at the magazine. “No wonder none of you have girlfriends.”</p>\n<p>“I have a girlfriend!” one of them is protesting, although Hinata knows he definitely doesn't or he'd have heard about it by now. Kageyama, however, ignores it and Hinata feels his hand grip his shoulder tighter.</p>\n<p>“Come on, I need your help with that thing we talked about earlier.” He shoots Hinata a scary glare, but he can tell it's not sincere. It's enough to let Hinata escape without question, though, and as he walks quickly away with Kageyama, he feels relief settle onto his shoulders.</p>\n<p>When they're a safe distance away, Hinata sinks to the ground, groaning. “Jeez, that was so scary!”</p>\n<p>“I was doing it to get you out of that stupid situation, idiot!” Kageyama immediately snaps, looking defensive.</p>\n<p>“I'm not talking about you! Actually...” Hinata scratches the back of his head. “Thanks for that. I felt like they were about to shove their dumb magazine down my throat or something.” He grins up at Kageyama.</p>\n<p>Kageyama just shrugs. “You're going to make me late to class. You're going to make yourself late to class and that's basically the last thing you need after those shitty test scores from last week.”</p>\n<p>Hinata jumps up from his seat on the ground, huffing. “Excuse you, Mr. Prodigy, but I think I remember you complaining about failing a group project.”</p>\n<p>He's laughing when Kageyama chases him off to class, and tells himself to remember to treat him to a box of milk at lunch for his admittedly good save.</p>\n<p>By the time lunch rolls around, Hinata's restless and his mind has been wandering for the past few hours, so he's grateful for the opportunity to eat and maybe practice a little with Kageyama, if he's feeling up to it (he pretty much always is). He's heading towards their usual spot, when he remembers the milk box and takes a detour to the vending machine that is Kageyama's favorite.</p>\n<p>Hinata's looking over the selections when he hears someone coming up behind him. It's one of the boys from his class; he thinks he'd been in the group gawking at the magazine earlier and really hopes it's not a repeat of that. Hinata decides to ignore it and slides his money into the machine.</p>\n<p>“Hey,” says the boy, and Hinata turns around.</p>\n<p>“I'm almost done,” he starts, but the boy shakes his head. He's tall, blonde, and Hinata supposes he's good-looking enough for a guy, but he kind of has a shitty personality.</p>\n<p>“Come here for a sec, huh?” He's tilting his head for Hinata to follow him. Hinata glances back at the machine; his money is already in it, and isn't about to let someone else get a free drink out of that. He hastily presses the button for the drink he knows Kageyama likes, twice, and grabs the two that fall into the waiting slot.</p>\n<p>Satisfied Hinata is going to follow him, his classmate turns and starts toward the side of one of the buildings, by a shed used to store sports equipment. Hinata still doesn't really know what he wants, but he guesses he'll find out when he stops at the other side of the shed and cocks his head.</p>\n<p>“Look, I know about you.”</p>\n<p>Hinata just stares. Everyone knows about him, they're classmates, after all, and he's pretty well-known for being the short redhead who gets called on too often for staring out the window.</p>\n<p>“You're not into girls, right?”</p>\n<p>He should have known this was about earlier. “I just don't care about dumb porn magazines, okay? I'm having lunch with someone so can I go now? Is that all you wanted to talk about?”</p>\n<p>The other boy steps forward, and Hinata realizes he has his back to the shed. He glances around; he's pretty sure he can take this guy if he seriously wants to beat him up over a magazine, but he's holding milk and warm milk is kind of gross. He really just wants to go to lunch.</p>\n<p>“You're gay,” his classmate finally states matter-of-factly, and Hinata chokes and nearly drops his milk boxes.</p>\n<p>“I'm what? No, I'm hungry and I want to go eat lunch.” Hinata's starting to feel grouchy; he didn't have an answer about what kind of girl he likes, so he's gay? Hinata likes girls. He thinks girls are cute and smell nice and he wouldn't mind maybe once in a while getting a confession like Kageyama does.</p>\n<p>“Look, it's really not hard to see by the way you're practically joined at the hip with that guy.” Hinata watches his classmate step forward again, and this time he looks sort of nervous. “It's not like you're going to get anywhere with him, you know? So what do you say me and you...”</p>\n<p>Hinata does drop the milk boxes this time. “Me and you what?”</p>\n<p>“Oh my god, I'm trying to proposition you here. You know, sex? Have you done it before?”</p>\n<p>“Sex?” Hinata realizes he's stuttered. “No! What? No!”</p>\n<p>“Do you want to?”</p>\n<p>Hinata realizes he's being inched towards the side of the shed and he wonders if he should just book it right now; he's pretty sure he could outrun this guy and just never talk to him about this again. His milk is on the ground, though, and he doesn't know how long it would take him to recover those and then run for it.</p>\n<p>“Hey.”</p>\n<p>For a second, Hinata's horrified that someone has found him in this weird compromising situation that he really doesn't want to be in in the first place. So does his classmate, as he turns around and fixes the intruder with a glare.</p>\n<p>“This isn't any of your business, okay? Just get out of here-”</p>\n<p>“Kageyama!” Hinata hears the relief in his voice. He ignores the stare of the other kid as runs over to Kageyama and takes cover behind him.</p>\n<p>“Are you guys seriously involved?”</p>\n<p>“I don't think it's any of your business,” Kageyama spits out, and he looks pissed. More pissed than usual, anyway.</p>\n<p>Hinata is looking back and forth between Kageyama, a solid wall in front of him, and the guy who had apparently been trying to pick him up and he hadn't even noticed. They're glaring at each other, and that's when Hinata knows the other kid is done for; he's been in glaring matches with Kageyama often enough to know that it's Kageyama's default expression and he doesn't get tired.</p>\n<p>Sure enough, after a few seconds the other boy glances away from Kageyama to look at Hinata, still hiding behind him. “You don't have to let him speak for you, I'm always available if you want to talk.” And then he's hurrying away and Hinata, still clutching the back of Kageyama's jacket, feels him relax.</p>\n<p>Kageyama turns, and Hinata lets go of his jacket. He's about to crack a joke about that weird situation to dispel the tention, but the look on Kageyama's face stops him short. He's used to Kageyama looking scary, but this is even scarier than usual, and Hinata cringes.</p>\n<p>“Are you an idiot? I mean, you are, but are you that much of an idiot that you'd just go with random guys to the back of a storage shed with nobody else around?” Kageyama's voice is too loud. “You didn't even know what he was asking, did you? What if I hadn't been passing by looking for you-”</p>\n<p>Hinata perks up. “You were looking for me?”</p>\n<p>“That's not the point!” snaps Kageyama, but Hinata sees that he's embarrassed and grins a little. “The point is you can't just walk into weird situations and expect everything to be fine!”</p>\n<p>“But it is, isn't it?” Kageyama's scary face is calming down a little, and it takes the edge off Hinata's stomach. “You ended up being here, so it's fine!”</p>\n<p>Kageyama deflates with a sigh and rubs his hand over his face. “You're such a dumbass.”</p>\n<p>“You're the dumbass who apparently thought I was kidnapped or something when I went to go get you milk...oh!” Hinata remembers the milk he'd come out for in the first place and retrieves them from the ground. They're not as cold as they were, but they're mostly okay. He holds one out to Kageyama. “Here.”</p>\n<p>Staring at the milk, it seems like Kageyama's making a really hard decision. He looks back at Hinata, glances around them, and then grabs Hinata's arm and drags him to the front of the shed. He jiggles the handle and it opens.</p>\n<p>“Aren't these usually locked?” Hinata glances around too, because he's pretty sure they're doing something they shouldn't be.</p>\n<p>“Why do you think that guy came back here?” Kageyama, still holding Hinata by the arm, drags him inside. It's dusty and dirty and Hinata sneezes as their shoes send up a puff of dirt. It's hard to see, but there's a little sunlight filtering in through the small windows near the roof.</p>\n<p>Looking around as his eyes adjust, all Hinata sees is old sports equipment. There are no volleyballs in here, and he's starting to lose interest. It's lunchtime and he's still hungry, and this milk isn't getting any colder. He says as much to Kageyama.</p>\n<p>Kageyama considers him, tilting his head. “I knew you were stupid, but I didn't think you were this stupid.”</p>\n<p>Hinata bristles, but before he can retort, his back is hitting the wall and his mouth is being covered by Kageyama, and anything he'd been thinking of saying is swallowed by him.</p>\n<p>It's short, but it still leaves Hinata's head swimming and his lungs crying for air. He's pretty sure Kageyama has gotten better since last time, and feels a pang of jealousy.</p>\n<p>“How did you get so good in such a short amount of time?” He hears the pout in his voice. “You didn't do it with someone else behind my back, did you? Because that's cheating.”</p>\n<p>“No!” Kageyama looks affronted, like he can hardly believe he's being accused of such a thing. “I did it fair and square.” But he's not saying how.</p>\n<p>Hinata thinks he knows why. “You looked it up on the internet, didn't you.”</p>\n<p>The light is still murky and dusty, but Hinata's eyes have adjusted enough to see Kageyama's face turn red. “I kiss you and you start talking about stupid stuff like looking up kissing on the internet? Forget it, I'm going to lunch.” He turns to go, but Hinata grabs his sleeve and pulls him back.</p>\n<p>“No, come on, don't be a baby. I looked it up too.” He's tugging Kageyama's sleeve to try and get him at a manageable level. Hinata points at his mouth.</p>\n<p>For a moment he thinks he ticked Kageyama enough to make him walk for real, but Kageyama, after a pause, leans in and kisses him again. It's slower this time, and their lips are definitely fitting together much more easily, and Hinata knows why people are always making out on the dramas his mother watches on TV. Kageyama pulls back and Hinata whines, but he isn't going anywhere. Instead, his lips slide across Hinata's cheek, like he's navigating by touch, and down to Hinata's neck. They've never touched this area before, and to Hinata's horror, he chokes back a laugh. His hands tighten on Kageyama's sleeves.</p>\n<p>Kageyama pulls back and stares at him. “Are you ticklish?”</p>\n<p>“No! Maybe? It's not like I have people shoving their face in my neck all the time.” Hinata wants Kageyama to go back to what he was doing. He does not want to discuss how ticklish he may or may not be.</p>\n<p>Kageyama just rolls his eyes (as far as Hinata can tell in the gloom) and drops his head back to Hinata's neck. Hinata bites his lip and wills himself not to laugh. He thinks he's close to losing it and is about to push Kageyama away when Kageyama's tongue darts out across his skin. Hinata gasps and slams his head back against the wall.</p>\n<p>He thinks that will definitely make Kageyama stop, and he's a little disappointed honestly because it didn't hurt that much, but all Kageyama does is move his hand up to the space between Hinata's head and the hard shed wall. Hinata leans his head back against it, and it's nice and warm and he decides he'll keep it there.</p>\n<p>Hinata is just getting used to the strange feeling of Kageyama kissing his neck (weird, but okay, even if it still kind of tickles) when he's caught off guard by an unexpected scrape of teeth and Kageyama's suddenly sucking at his skin and this is so, so much better than him just kissing it. Hinata feels his knees almost buckle and he makes a noise in the back of his throat that he isn't really sure what he means by.</p>\n<p>Kageyama seems to know, though, and gives a harder suck, and this time Hinata moans. He's about to tell Kageyama keep going, keep doing that when he's suddenly pulling back and Hinata is frowning.</p>\n<p>“What are you-”</p>\n<p>The protest is cut short when Kageyama grabs the zipper of Hinata's pants and pulls down. Hinata yelps and slams his hand into Kageyama's shoulder, startled, who finally looks at him. He's not saying anything, but Hinata can just tell he's asking if it's okay, and he doesn't even have to think about it before nodding. Kageyama finishes fumbling with the zipper, grips Hinata's pants, and yanks them down.</p>\n<p>The fabric pools around his feet and Hinata feels suddenly sort of chilly, except for a way-too-familiar heat starting to gather between his legs. His boxers are still providing minimal protection, and he's sort of wondering what Kageyama is planning to do when he drops to his knees and Hinata's eyes go wide with realization.</p>\n<p>“Kageyama!” he manages to get out, “It's lunch!”</p>\n<p>Kageyama just looks up at him stubbornly. “So?”</p>\n<p>“There are people?” Hinata is honestly having a hard time finding a good reason after his outburst, especially with Kageyama looking up at him like that.</p>\n<p>“We're in a shed.”</p>\n<p>At this point Hinata just relents, because he's starting to find it hard to think in a small space that's way too stuffy and filled with Kageyama. The other boy looks smug, and leans forward to drag his mouth along Hinata's growing erection.</p>\n<p>Hinata's hands slam against the wall and he gasps. Kageyama is mouthing at him and he's feeling his knees get weak already and he hates that Kageyama is actually kind of good at this, and his mouth isn't even directly on him yet. Kageyama seems to realize that too, and pulls back long enough to hook his thumbs in the top of Hinata's boxers and shimmy them down over his hips. They stop at Hinata's knees, and then Kageyama's fingers are digging into his hips.</p>\n<p>“This is twice in a row,” Hinata fake-complains, feeling a little antsy.</p>\n<p>“So what, are you going to back out? You're going to eat lunch and go to class like this?” Kageyama pokes at Hinata's definitely-hard dick.</p>\n<p>Hinata glares, but he knows it's half-hearted and his lack of response is answer enough in itself. Kageyama licks his lips, looking up at him, and Hinata just closes his eyes and resigns himself to having his dick sucked by a jerk. Again.</p>\n<p>It feels like ages that he's waiting, eyes closed, just listening to his and Kageyama's breathing. It's really only a few seconds, but the second he feels Kageyama's mouth on him, he groans and curls presses his hands against the wall again. Kageyama's testing the head with his mouth, and Hinata doesn't know how his ass of a partner knows he likes it when Hinata didn't even know he liked it that much himself, until now. He swears he is going to hold out longer this time, just to spite Kageyama. He bites his lip and tries not to concentrate too hard on the feeling of Kageyama slowly sliding his mouth down around him, tongue occasionally slipping up and down. </p>\n<p>He's doing alright, not focusing too much on the wet heat of Kageyama's mouth, until Kageyama actually groans around him. It's sending vibrations through Hinata's dick and he jerks his hips forward involuntarily. His eyes snap opens and he looks down at Kageyama, an apology on the tip of his tongue.</p>\n<p>The apology dies in Hinata's throat when he sees that Kageyama's already gone for his own zipper, slipped his hands inside his pants and is palming himself while he's sucking Hinata off. And it's hot, and Hinata hates that it's hot, and he's biting his lip harder and harder because he's not going to come, he's not going to come, not yet-</p>\n<p>And then Kageyama looks up directly at him, locks eyes, and sucks in and Hinata loses it.</p>\n<p>His knees do buckle this time; his legs jelly and no longer able to support him, he slides down the wall and lands on his ass on the dusty shed floor. He should feel more annoyed that Kageyama somehow got the better of him, but all he's really concerned with is the warm spent feeling he gets when they do this, and the fact that Kageyama's hand is still moving inside his pants. He watches Kageyama trying to swallow, which in itself makes Hinata's face heat up (he'd asked Kageyama last time if it was gross. Kageyama had unhesitantly said yes).</p>\n<p>There's a little bit escaping out of the corner of Kageyama's mouth and before Hinata knows what he's doing or why, he's shoving himself forward and slamming his lips way too hard into Kageyama's and kissing him. He tastes himself on Kageyama's lips and in his mouth and he doesn't even care, and then he's pulling back and shoving Kageyama's hand out of the way. The other boy looks satisfyingly startled, but Hinata doesn't even have it in him to feel smug right now.</p>\n<p>“What are you doing, asshole,” Kageyama's breath is shaky, “Let me finish-”</p>\n<p>“No!” Hinata shoves his hand away again and immediately replaces it with his own. “Let me do it.”</p>\n<p>At that, Kagyama shuts his mouth, probably more complaint than he's ever behaved with Hinata for as long as they've known each other. There's still a little mess on Kageyama's face so Hinata leans forward again, licking at it, then at Kageyama's lips, and Kageyama makes a noise that might be a moan, but a Kageyama-moan, meaning it's as stupid as he is. </p>\n<p>Hinata wraps his hand properly around Kageyama's shaft, feeling it hot and throbbing against his palm, and he vaguely realizes this no longer feels weird to him at all. Tightening his grip, he drags his hand up, slowly, and feels Kageyama's hips twitch. Hinata pulls back from his mouth to look down at where his hand is disappearing into Kageyama's pants; he is still feeling lightheaded and the kissing definitely is not helping. Instead, he concentrates on stroking Kageyama, slow and firm, and soon enough Kageyama is pressing his forehead against Hinata's shoulder and spilling over Hinata's hand with a groan.</p>\n<p>They both sit back, and the shed feels too warm. Hinata realizes his pants are still around his ankles but he doesn't care at this point, and flops back against the dirt-streaked floor. Kageyama seems to still have his senses enough to crawl over to Hinata and try to tug his pants back up for him.</p>\n<p>“Don't just lie there with your ass exposed,” he says, and Hinata sticks his tongue out at him. “Come on, we still have to eat lunch.</p>\n<p>“I don't wanna.” Hinata's feeling warm and lazy and he's pretty sure the milk isn't cold anymore, so he no longer cares. The butterflies in his stomach have replaced hunger, so he's content with lying here in the dust until the bell rings.</p>\n<p>Kageyama, though, has other plans, as he gets to his feet and drags Hinata up. Hinata grumbles but pulls his pants up, because it's more embarrassing when he's standing, and also his butt is sort of getting cold now that he doesn't have all that warmth running through him. He glances at Kageyama, who is shifting uncomfortably in his pants, and looks down at his own dirty hand.</p>\n<p>“I guess we should clean up.”</p>\n<p>Kageyama rolls his eyes and leads Hinata out of the shed, glancing around to make sure they're alone. They clean up in the bathroom with the least foot-traffic and Kageyama ends up buying them milk (to make up for the two Hinata forgot in the shed, he says). The rest of lunch is uneventful, but in a way Hinata is very satisfied with.</p>\n<p>When he gets back to his classroom, he sees the boy he'd had a run-in with glance at him. His face suddenly turns red and takes on a weird expression and he looks away; maybe he's embarrassed about what had happened earlier, but Hinata's in too good a mood to hold it against him. A few other kids in his class look twice when he sits down, and he's briefly worried that he didn't clean up properly; he looks down at himself, but he looks fine, if a little dusty, which is normal for him. There's no way they can tell what he and Kageyama did, so he shrugs it off and thinks about volleyball practice later, and maybe Kageyama.</p>\n<p>It's Saturday afternoon practice, and Hinata is kind of tired of people looking at him weird. He and Kageyama don't even race to the gym; Hinata is too preoccupied asking Kageyama if he has something on his face. Kageyama glances at him, and his eyes flash away and he shakes his head. Hinata didn't much care what people thought about him, but he was honestly getting a little unnerved.</p>\n<p>When they arrive at practice, it's after everyone else. The both of them scramble to get changed and hurry onto the court; Kageyama is griping that Hinata made him late. Hinata is about to wholeheartedly deny it but the second they step onto the court, their teammates' eyes fall on them.</p>\n<p>The gym is absolutely silent. Someone drops a ball, and the sound ricochets off the walls.</p>\n<p>“Kageyama, what did you do?!” Tanaka is crying, running over to them and grabbing Hinata by the shoulders. “Should I kill him? Why did you put your senpai in this situation?”</p>\n<p>Hinata is too stunned to say anything; sure they'd been a little later than usual (they were usually the first there) but that had happened a couple times before and there had been no reaction this dramatic. Nishinoya is whistling and Tsukishima's “disgusting” has Yamaguchi glancing worriedly between the group still on the court and the one forming by the door.</p>\n<p>A loud clapping resonates through the gym. “Can you guys focus? Hinata looks perfectly fine, so I don't know why you're all forgetting that this is practice and not a gossip session.” Daichi is giving them a look that sends Tanaka jumping to attention. “Get to work!”</p>\n<p>Everyone reluctantly resumes their warmups, and Hinata glances at Kageyama, thoroughly confused. Kageyama is stubbornly refusing to look at him and marches onto the court; Hinata shrugs and figures he's mad about being scolded by the captain. Hinata's about to join him, when he sees Suga walking towards him.</p>\n<p>“Ah, Hinata...” Suga looks around to make sure everyone is properly busy under Daichi's watchful eye. He looks back at Hinata and points meaningfully to his own neck.</p>\n<p>Hinata looks, but there's nothing there. Unless...he raises a hand to his neck and feels around, but there's nothing there, either.</p>\n<p>Suga shakes his head and motions Hinata to follow him back into the locker room. Hinata trots after him, and Suga guides him over to a mirror, putting his hands on Hinata's shoulders and positioning him squarely in front of it.</p>\n<p>For the first time that day, Hinata sees what everyone has been staring at. Right on the side of his neck is an angry reddish mark, probably exactly the size of Kageyama's mouth.</p>\n<p>Suga seems to sense the atmosphere and gives Hinata's shoulders a reassuring squeeze. “I can get you a bandaid, if you want. It's not the best fix, but it will work until you can get home and figure something out...on second thought, you should probably keep it on at home as well unless you want your mother asking about it.”</p>\n<p>“Everyone saw this?” Hinata knows his voice is shrill, but it's just Suga so he doesn't really care. Suga nods sympathetically.</p>\n<p>“It's really not that bad, I've seen worse. I think everyone was just surprised to see that you and Kageyama...”</p>\n<p>“Me and Kageyama?” Hinata stares at Sugawara's reflection in the mirror. “Wait, they think Kageyama did this?”</p>\n<p>“Didn't he?”</p>\n<p>“No!” Hinata is horrified. “I mean...no. It's not like that, I was just-”</p>\n<p>Suga's reflection shakes his head. “It's alright, you don't have to explain to me, but it might come up with the others. Um...I'll have Daichi tell them not to ask about it, if you want?”</p>\n<p>Hinata doesn't know if that would help or just make things seem more suspicious. He wants to yell that it's not what they think, it was an accident probably and Hinata hadn't even known it had happened. It had to have been an accident, the shed was dark and Kageyama probably hadn't seen what he had done, and had been too embarrassed by the time he noticed to say anything. Hinata grudgingly understands why; he would definitely have made a scene.</p>\n<p>He finally sighs and nods his head. “Tell Daichi to tell them it wasn't Kageyama! It wasn't, okay? I just....hit myself with a pen...”</p>\n<p>Suga nods, but Hinata can kind of tell he doesn't really believe him. “Let's get back to practice, shall we?” He pulls a bandaid out of his pocket and secures it on Hinata's neck. The bandaid looks kind of conspicuous, but it's a lot better than a hickey. A hickey that all his classmates had seen. Hinata groans.</p>\n<p>“They'll forget about it by the end of the day.” Suga pats his shoulder and steps back.</p>\n<p>“How do you know?” grumbles Hinata, pouting.</p>\n<p>Suga just smiles. “I've had a similar situation happen to me. It wasn't quite...that bad...” Hinata thinks he's trying not to laugh. He slaps Hinata on the back to cover it up. “Anyway, let's get going! You'll be fine.”</p>\n<p>Hinata follows Suga back to the gym. He spots Kageyama watching him, and shoots him the best glare he can manage. </p>\n<p>Throughout practice, Hinata hits Kageyama with the ball twice, and Kageyama hits him back five times. By the time they're done cleaning up (pointedly not speaking to each other), Hinata's chest, arm, and leg are smarting, and none of this is even his fault. Damn Kageyama. He's going to kill him.</p>\n<p>By the time Hinata makes it to the room to change, Kageyama is nowhere in sight. He's still getting a few weird looks from the rest of the team. He tries to change as quickly as possible so he can get out of this; tomorrow is Sunday, at least, so he'll have a day for everyone to forget about this, and maybe this crappy hickey would be gone by then. Hinata doesn't know how long it takes them to fade, but he's praying it's not long.</p>\n<p>He's startled when he feels a hand on his shoulder. Hinata looks over at Nishinoya, who's grinning at him, and feels his heart sink. He'd been doing so well with avoiding anyone talking about this.</p>\n<p>“Whoa, don't give me that look!” Nishinoya removes his hand from Hinata's shoulder to hold both hands up in surrender. “As long as it's consensual it's fine!”</p>\n<p>Hinata's mouth is hanging open in horror but he can't bring himself to shut it and protest that it's not like that. Nishinoya continues.</p>\n<p>“But, the trick is to leave them in places people can't see, you know? Like under your shirt or on legs or something.” He grins. “I've had a little experience with this, and-”</p>\n<p>“What?!” Tanaka's leaping next to them, and Hinata jumps. “You never told me!”</p>\n<p>Nishinoya is laughing and looks a little too proud. “It was nothing big...”</p>\n<p>They're off on one of their tangents, so Hinata takes the chance to hurriedly grab his stuff and sneak out. He's spotted Daichi giving Tanaka and Nishinoya one of his terrifying smiles, and he's glad to get out of there. He does, however, wave at Suga on his way out, who smiles and waves back. It's almost enough to make him forget about the whole Kageyama thing; he's going to spend the night moping around and playing video games, and that's already making him feel a little better.</p>\n<p>And then he spots Kageyama, waiting by the gate with his hands in his pocket, and all his irritation comes sprinting back. Before he knows it, Hinata himself is sprinting, and then he's crashing into Kageyama and tackling him to the ground.</p>\n<p>“You asshole!” he huffs out, sitting on Kageyama's chest. Kageyama isn't even fighting back, he's just lying there and refusing to look at Hinata. “You could have told me!”</p>\n<p>“It was an accident, okay? And what was I supposed to say? 'Oh, Hinata, by the way, the reason people are staring at you weird is because I accidentally sucked on your skinny neck a little too hard.'”</p>\n<p>Hinata growls. “Um, yeah? That's the least you could have done!”</p>\n<p>“Well what do you want me to do about it?” snaps Kageyama, and he's finally looking at Hinata. Hinata guesses that's a little progress, even if it just means Kageyama is glaring at him again.</p>\n<p>“Let me give you one.”</p>\n<p>Kageyama's glare falters. “What?”</p>\n<p>“Let me give you a hickey!” Hinata repeats himself. “It's only fair!” He's sure Kageyama is going to complain, to tell him what a stupid idea that is and the he doesn't want a hickey from Hinata of all people. </p>\n<p>To his surprise, Kageyama just looks at him for a long second. “Okay.”</p>\n<p>Hinata is so ready to fall back into a ranting tirade that he's completely caught off guard and doesn't know what to say. “Okay? That's it? You're not even going to argue?”</p>\n<p>Kageyama shrugs as well as he can as he's lying in the dirt. “You said it's only fair. Unless you don't actually want to, then let me up so I can go home. I didn't wait for you to lie here and get my clothes dirty, dumbass.”</p>\n<p>“Oh.” Hinata stares at him, suddenly unsure of what to do. “Okay.” He's definitely taking too long, but he honestly has no idea how to give a hickey. It should be simple, right? Just do what Kageyama did earlier.</p>\n<p>Kageyama's still looking up at him impatiently, but he's being quiet, for once. Hinata steels himself, nods once, and leans down to shove his face into the juncture between Kageyama's neck and shoulder. He sits there, breathing in. It smells like Kageyama.</p>\n<p>“What the fuck are you doing?” says Kageyama after a minute has passed without Hinata moving an inch. “Do you even know how to do this?”</p>\n<p>“Yes.” Hinata's voice is muffled against Kageyama's jacket. “Shut up. I'm mentally preparing myself.”</p>\n<p>“You have to mentally prepare yourself to suck on someone's neck? How simpleminded are you?” Kageyama knocks Hinata's head gently with his knuckles. “Come on, hurry up or we won't be able to get a snack before it gets too late.”</p>\n<p>Honestly, Hinata just really wants to sit here like he is and not do anything. Being this close to Kageyama feels nice, even when it doesn't involve mouths or teeth or hands. The promise of snacks, though, is enough to spur him on, and he shifts back enough to push Kageyama's collar out of the way. He hesitates another second before leaning forward again, licking a stripe up Kageyama's neck.</p>\n<p>Hinata can feel Kageyama's stomach muscles tighten beneath him, and he suddenly realizes this is kind of a dangerous position. As much as he wants to tease Kageyama like Kageyama had teased him earlier, he restrains himself and just opens his mouth to tentatively suck at a spot on Kageyama's neck.</p>\n<p>The skin is soft and warm and a little salty with the exertion of their earlier practice. It's not bad, though; Hinata feels himself starting to get warm, and grimaces. He sucks a little harder; how hard does he actually have to suck to make this work? How long is he going to have to do this?</p>\n<p>A groan from Kageyama has Hinata pulling back to inspect what he's done. It's a little red, but not enough. Not like what Hinata had seen on his own neck in the mirror. His hand strays up to touch the bandaid Suga had applied for him, and he thinks about looking at it again. It's a mark that says Kageyama has been there, and it's a really weird thought. It's even weirder that he doesn't mind it all that much.</p>\n<p>Hinata leans down again and this time, he scrapes his teeth agains the skin. He feels Kageyama's hands move up hesitantly to his shoulders, like he's not sure what to do. Hinata bites down hard, fast, and then Kageyama's back is rising off the dirt and he's shoving at Hinata's shoulders frantically.</p>\n<p>“Stupid, knock it off! You did it, okay, now get off me!” Kageyama successfully shoves Hinata to the dirt and Hinata stares at him from his side, disgruntled and annoyed at having be interrupted when he'd started making Kageyama react.</p>\n<p>Kageyama notices his expression and looks away. “Don't pout like that, dumbass. You did what you wanted to do, right?”</p>\n<p>Hinata sits up and looks over, and Kageyama tugs his collar back down to show Hinata the dark red mark marring his skin. Hinata feels a swell of pride at having left his first hickey, and pushes himself to his feet to help Kageyama up. There's dirt all over their backs, but he doesn't care because Kageyama has a hickey from him and they're going to get snacks, and Hinata is so far away from being as pissed as he was earlier that he tries to convince Kageyama to get on the back of his bike since they are running kind of late.</p>\n<p>Kageyama looks from Hinata's bike back to Hinata, and frowns. “You remember what happened the last time we did this. I don't feel like being out for a week because of a sprained ankle.”</p>\n<p>“I'll do better this time!” Hinata protests, throwing a leg over his bike to get in position. “Come on, if you do I'll buy the snacks this time. I proooomise I won't go as fast.” He looks innocently at Kageyama, willing him to give in.</p>\n<p>Finally, Kageyama sighs, and his shoulders slump in resignation. “Fine. But if you go even a little too fast, I'm going to kill you.” He slips his own leg over the back of Hinata's bike, positioning himself on spot behind Hinata's seat. Hinata looks back at him because he looks kind of funny, such a tall guy on the back of his bike so that his knees bend a little too much as he shakily balances himself.</p>\n<p>“I'll go slow, I promise.” Hinata's stomach does a little flip as he feels Kageyama's arms circly a little too hesitantly and a lot too tightly around his waist, and then he's kicking off and Kageyama is holding even tighter, and Hinata's finding it hard to breathe.</p>\n<p>The only fall once on the way home; Kageyama gets grass in his hair and complains the rest of the way, but when they part ways, he waves amiably, and as Hinata waves back, he finds himself thinking he wouldn't mind every day being like this.</p>\n<p>Sunday passes uneventfully, with one small exception: Hinata's mother sees the hickey. It slips his mind after his bath, when peels off the band-aid and subsequently forgets about it like he does with most unimportant things. He probably should have classified a hickey as “important”, but it's only when he skids to a stop in the kitchen in front of his wide-eyed mother that he remembers it. She's more surprised than anything, going on about how Hinata is such a late-bloomer and she's happy he's finally becoming interested in girls (he definitely doesn't correct her), but she does sit him down and give him The Talk.</p>\n<p>Hinata leaves the room afterward completely mortified; it's not like this is stuff he hasn't heard before, but hearing it from his mother is something he wouldn't wish on his worst enemy. Mothers are never supposed to mention private bits and the things people tend to do with them. He says a prayer that night for Natsu, that she live a long and happy childhood free of hearing their mother ever utter such things.</p>\n<p>Usually, Hinata falls asleep easily, but that night he's restless. He wonders what it would be like doing that sort of thing with a girl; he tries to think of girls he knows, but all it does it make him uncomfortable. They're cute and everything, but he's never really felt like doing that with any of them. Maybe he's just not imagining it right; maybe instead of imagining jumping straight into things, he needs to think about the small things, like kissing and the sort of things he's only done with Kageyama. It would probably be different doing it with a girl than with Kageyama, but the general principle of kissing has to be the same, right?</p>\n<p>He tries, he really does, but every time he tries to picture a girl in Kageyama's place, it feels wrong. Kageyama is such a distinct presence; he's tall, much taller than any girls Hinata knows, his hands are wide and rough from volleyball and feel nice in Hinata's hair. He's already so comfortable with Kageyama on the court that doing anything else with him feels natural. He guesses eventually that spot would go to a girlfriend, but right now he's perfectly satisfied the way he is. He still doesn't care about doing that kind of thing with girls. It would take time away from volleyball.</p>\n<p>What about doing that kind of thing with Kageyama, though? Hinata hasn't thought about it up to now, because everything they do has been spur-of-the-moment, mostly. Hinata doesn't even know how guys do it, really; thinking about it makes his face feel hot. He already knows what Kageyama looks like when they're touching, but he wonders how different it would be if they were actually having real, genuine sex. In the back of his mind Hinata thinks that might be pushing it a little for a competition, but he squashes that down in favor of thinking about the few times he's been able to make Kageyama be vocal, and he feels warmth coiling in his stomach.</p>\n<p>Suddenly Hinata really, really wants to talk to Kageyama.</p>\n<p>They don't talk on the phone often, but whenever Hinata calls, Kageyama humors him; he wonders if Kageyama would still be awake. He glances at his alarm clock; 12:23. Kageyama's a huge baby so he goes to bed early, but maybe he'd still be awake. Hinata takes ten seconds to debate on whether or not this would be a good idea before grabbing his phone and pressing the contact info for Kageyama (#9, because of his number).</p>\n<p>The phone rings once, twice, three times, four times and Hinata thinks it's a lost cause when it stops ringing and Kageyama picks up. His voice is groggy and Hinata can tell that he's probably just fallen asleep, and feels slightly bad for waking him up, but not bad enough to apologize and hang up.</p>\n<p>“Are you sleeping?” Hinata says, keeping his voice hushed. His parents are in bed and Natsu is already asleep, but he just wants to be sure.</p>\n<p>“What does it sound like?” He can hear Kageyama shifting into a more comfortable position, and pictures the weird sort-of bedhead he gets when he moves around too much at night. “Did someone die? Because if they didn't, I'm going to make sure someone does. That's you, by the way. I'm going to kill you.”</p>\n<p>Hinata rolls his eyes. “If you really didn't want to talk to me, you'd hang up.” He hears Kageyama grunt noncomitally, and hurriedly says “Don't hang up!”</p>\n<p>Kageyama is sighing like he's resigned to being woken up. “This had better be important.”</p>\n<p>It's sort of important, to Hinata, anyway, but he doesn't know how to say 'I really need to know how two guys have sex' without saying it exactly. He decides to just wing it and take the direct approach.</p>\n<p>“I really need to know how two guys have sex,” he says. He hears Kageyama wheeze in surprise on the other end, like he'd been in the middle of a yawn before he'd been rudely interrupted by Hinata's abrupt question.</p>\n<p>“Did you call me in the middle of the night because you had a wet dream?” Kageyama snaps, and Hinata's face flushes.</p>\n<p>“No! It's just that my mom saw that hickey, okay, and she sat down and talked to me about you-know-what and it was really, really horrible, Kageyama. It was so horrible. But she only talked about how you do it with a girl, and I started wondering, how do you do it with a guy? You know? And you're kind of the only person I could ask about this.”</p>\n<p>Kageyama has been quiet through Hinata's entire bubbling speech, to the point where Hinata's not sure whether or not he's even still there, or still awake. Hinata stills, trying to hear breathing on the other end; he's listening so intently that when Kageyama finally speaks, he jumps a little.</p>\n<p>“Yeah.”</p>\n<p>“Yeah what?” Hinata almost forgets the original question. “You know how to do it?”</p>\n<p>“Yeah, I know how. So what? It's not that hard of a thing to find out.” Kageyama sounds kind of defensive, even though it's Hinata who asked in the first place.</p>\n<p>“Okay, so how do you do it?” It was seriously a great idea to call Kageyama, Hinata has already decided. “Is it like...what do you do with the dicks?”</p>\n<p>Kageyama falls silent again, and Hinata almost repeats himself before he talks again. “You're messing with me, right? You stick it up the ass, idiot.”</p>\n<p>Hinata lies there for a minute before it actually sinks in, and then he's feeling the blood rush to his cheeks and he stares into the darkness. “You stick what up the what?” He can hear his voice crack. “That's supposed to feel good?”</p>\n<p>He pictures Kageyama shrugging as he says, “I guess so? You're the one who asked.”</p>\n<p>“I know I asked, but I didn't think it was going to be like that!” Hinata tries to remember what he knows about sex in general; in retrospect, he guesses the dick has to go somewhere. If he and Kageyama did that, whose what would go where? Hinata doesn't think his face can get any warmer.</p>\n<p>Kageyama's sighing on the other end. “I can tell you're freaking out. It's not like it's something you have to worry about so calm down and go to sleep or I'm going to kick your ass at practice tomorrow.”</p>\n<p>“Wait, Kageyama, how would that work?” Hinata doesn't want to hang up just yet. He really needs to know now that he's asked. He thinks about the size of Kageyama's dick. “I don't really know if something that big can actually fit up there, are you sure about this?”</p>\n<p>“You don't just shove it in, dumbass,” snaps Kageyama. “You have to...get ready first.”</p>\n<p>Hinata vaguely wonders why Kageyama knows about all this, but then again maybe he's the only one who doesn't. He's seen stuff on the internet, but he doesn't really pay attention to things that don't interest him and he's never even really watched porn. But what if he ends up needing to know this someday? “How?”</p>\n<p>“Oh my god, for crying out—look, can't you look this up on the internet or something? Why are you even asking me about this after midnight? Why are you asking me about this at all?” Kageyama's sounding definitely cranky, and maybe kind of embarrassed. “Go to sleep.”</p>\n<p>“Not until you tell me how to do it! I'll stay up all night and I'll fall asleep riding my bike on the way to school and I'll die, and it will be your fault and you'll have to tell people you killed me because you didn't want to talk to me about sex.”</p>\n<p>He can hear Kageyama groaning into his pillow, and he thinks he might actually hang up, but Kageyama takes a deep breath instead. “Okay, you have to use your...fingers. You know, but it has to be kind of wet--”</p>\n<p>“Wait, wait, so I just stick my fingers up there?” Hinata doesn't know about this, but he figures if people do it there must be a reason, and now is as good a time as any to test it out. It sounds simple enough, if Kageyama is actually telling it to him right, and if this works out, it's one more thing he can gloat to Kageyama about.</p>\n<p>Plus, he's kind of curious now that the initial shock has worn off, and he still can't fall asleep.</p>\n<p>Hinata shimmies out of his pants and rolls onto his back. He holds his hand up and looks at it, dubious that he's going to even be able to fit a finger up there. His hands are kind of small, but what if someone else, like Kageyama, were doing this? Hinata can hear Kageyama saying something on the other end of the line but he's tuning him out, considering what he has to work with.</p>\n<p>Kageyama had said it should be wet, he thinks, and he knows about lubricant, but he's not sure if that would be safe to stick up there and he doesn't have any on hand anyway. He knows sometimes if he licks his hand while he's touching himself, it works, so he sticks his finger into his mouth. He slips it out when it's sufficiently spitty.</p>\n<p>“Are you really sure this is how it works, Kageyama?” Hinata interrupts Kageyama in the middle of saying something he hadn't been paying attention to.</p>\n<p>“How many times are you going to ask me that? Were you even listening to what I was saying?” gripes Kageyama, but Hinata's busy positioning his hands between his legs. It's kind of an uncomfortable position, one he is definitely not used to. Kageyama is saying something about doing it properly when Hinata touches himself down there, carefully, and it's cold and wet and kind of extremely gross, and he wrinkles his nose.</p>\n<p>He takes a deep breath and pushes his finger in.</p>\n<p>“Oh my god, this feels so weird,” he says, grimacing. “Kageyama, I think you don't know what you're talking about.”</p>\n<p>The line is completely silent for a few seconds, and then Kageyama's nearly busting his eardrums. “You dumbass, what the hell do you think you're doing?! Are you actually sticking your fingers up your ass while you're talking to me?” He doesn't sound tired anymore; his voice is tight and kind of panicky.</p>\n<p>Hinata has to remind himself to breathe because he's almost forgetting to, focusing on the weird feeling of something being where it shouldn't be. “Is this it? Because this sucks.”</p>\n<p>“I'm going to hang up on you,” says Kageyama, but he doesn't. He hesitates for a moment. “What exactly are you doing?”</p>\n<p>“I told you, I stuck a finger up my ass because you said that's what people do when they want to do it, and it just feels really weird and I actually kind of hate you if you were tricking me about this.”</p>\n<p>“Okay, you don't just sit there with your finger, you have to...move it, I guess.” Kageyama's voice sounds sort of strangled, like it does when he's trying to ask someone how they pull off a move. “If you do it right there's supposed to be something that feels really good, but--”</p>\n<p>“Wait, okay, let me try it.” Hinata experimentally wiggles his finger. Nothing, really; it still feels weird. He feels like he's slowly getting used to it, though, so he guesses that's something.</p>\n<p>Kageyama takes a breath. “Okay, what position are you in?”</p>\n<p>“I'm on my back.” Hinata's arm is starting to get tired and he's honestly feeling a little disappointed.</p>\n<p>“Okay, try...getting on your knees, maybe.” </p>\n<p>Hinata can hear Kageyama's sheets rustle as he shifts, and Hinata follows suit, temporarily removing his finger so he can reposition himself. He's on his knees now, using one arm to support himself and the other to hold the phone. “Now what?”</p>\n<p>“Do what you were doing before. Be careful, though, don't just jam it in like an idiot.” Kageyama's voice is gruff, but he's being surprisingly patient for being woken up past midnight on a school night to talk about sex.</p>\n<p>“Wait, I'm going to put you on speaker.” Hinata switches the mode on his phone and sets it next to him on the bed. He braces himself with the arm that's now free and reaches behind himself with the other, testing out his new position. He slips his finger in again, and it's easier this time, although it still feels a little uncomfortable. He slides down and rests his cheek against his pillow, facing towards the phone.</p>\n<p>He feels a little embarrassed with his ass in the air like this, but he concentrates on finding whatever it is that Kageyama says is supposed to feel good. He's not getting anywhere, really, and he says as much out loud. He'd almost forgotten Kageyama was on the other end of the line with how quiet he's being.</p>\n<p>“It would probably be easier if someone else was doing it,” says Kageyama. “Your fingers are tiny.”</p>\n<p>“They're not, yours are just stupidly big,” Hinata shoots back, and he's still moving his finger around inside himself. The weird feeling is gradually starting to feel better as his finger brushes around against his insides, and he lets out a breath he hadn't realized he had been holding. “I guess this isn't that bad.”</p>\n<p>“Touch yourself.” Kageyama is quiet, and Hinata almost misses it, but he can feel his stomach flip when it registers. Kageyama isn't asking, his voice is firm and Hinata feels like he can't say no, and he doesn't really want to.</p>\n<p>He shifts so he can slip his arm free from where it's been trapped between his chest and his mattress, and slids his hand down between his legs. He's not quite hard, but he can tell he's starting to perk up, and doesn't know when that started. He had mostly been paying attention to Kageyama and what was going on behind him.</p>\n<p>Hinata brushes his hand against himself, closing his eyes. It's warm and his hand is kind of cold and he hisses.</p>\n<p>“Are you doing it?” says Kageyama. His voice is hushed and low and Hinata finds himself nodding before he realizes Kageyama can't see him.</p>\n<p>“Yeah,” and he grips himself. His position is a little uncomfortable, his face pressed partially into the pillow underneath him, but when he moves his hand he can feel a pleasant warmth pool in his stomach. He thinks about Kageyama on the other side, listening to him, and makes a noise as he pushes into his hand.</p>\n<p>“Okay.” Kageyama's breathing sounds funny. “Now try moving your finger around more in...you know. There.”</p>\n<p>Hinata complies, and it definitely feels better than when he first started. It's nothing mind-blowing, but he's getting used to it, and touching himself helps ease the tension he was feeling. He experimentally angles his finger a little, trying to push in deeper; he makes it past the knuckle, and sucks in a breath.</p>\n<p>“Are you okay?” On the other end, Kageyama sounds a little concerned. “If it hurts, then say so.”</p>\n<p>“It doesn't hurt.” Hinata shifts again and bends his finger and then he feels something, like he's hit a switch, and he moans obscenely into his pillow. He's definitely hard now, and he's wondering why more people didn't talk about this because it feels incredible.</p>\n<p>He moves his finger again, trying to find where he'd hit before, but he's not having any luck. He huffs and angles his face back towards the phone, about to ask Kageyama if he has any advice or anything, when he hears something very, very suspicious.</p>\n<p>Kageyama is breathing a little too quickly, loud enough for Hinata to hear it clearly through speakerphone. Hinata feels his stomach tighten and he grins, even though he knows Kageyama can't see it.</p>\n<p>“Kageyama, are you jerking off?” he says, smug, if a little breathless.</p>\n<p>“Shut up.” Kageyama's voice cracks and Hinata knows he's right. He's definitely going to count this as a win for him. He's gotten Kageyama to masturbate over the phone listening to Hinata touch himself, and Hinata twitches a little in his hand at how dirty that sounds in his head. He wants to make noise for Kageyama, but his parents are still in the house and he'd die of embarrassment if either of them found him like this. Instead, he shifts closer to the phone, trying to get his mouth as close as he can.</p>\n<p>“I can't believe what a perv you are, Kageyama,” he breathes out, angling his finger to try and hit that spot again.</p>\n<p>“Fuck off, I'm not the one with his finger up his ass,” Kageyama retorts, but Hinata can still hear the arousal in his voice. </p>\n<p>He imagines how hot Kageyama's breath would feel right now, against his skin, and he grips himself tighter with his other hand. He honestly wishes it was Kageyama's hand right now, and he thinks he's said so aloud because Kageyama's groaning by his ear and Hinata can't even feel embarrassed that he admitted that.</p>\n<p>“I can't believe you,” Kageyama grunts, “It's 1 am on a school night and---and you're doing this—-” His voice is getting tighter; Hinata wishes he could see his face. He imagines how red it is, his ruffled hair, the way he looks dazed when he gets far enough into it. Hinata likes seeing Kageyama come undone, unlike the usual sharp-eyed focus he has on the court. He likes that, too, though.</p>\n<p>Suddenly, Hinata bends his finger just right and grazes whatever it is inside him again and he's panting, short moans as quiet as possible without completely muffling himself. “Kageyama--” he gasps out, “Oh, I--Kageyama--” He hits it again and can feel it in the twitch of his dick in his hands, and then his hips are jerking forward and he's spilling all over his hand and a little on his sheets.</p>\n<p>Hinata's legs feel like jelly and he collapses, not caring that he's getting his shirt dirty. He feels warm and sated and wonders why he'd ever even doubted Kageyama about this in the first place. Hinata slids his finger out and wrinkles his nose as he wipes it on his shirt. He's going to have to throw this in the hamper immediately after he hangs up with Kageyama.</p>\n<p>Kageyama. Hinata completely forgot about him for a second there. </p>\n<p>“Are you still there?” he says, and he knows he sounds breathless still. “Kageyama?”</p>\n<p>The line is silent, and Hinata thinks that Kageyama has hung up on him.</p>\n<p>“What,” he finally hears, and Kageyama sounds completely drained. “I'm going to sleep.”</p>\n<p>“Did you come?” Hinata asks, because he hadn't heard anything and he'd been preoccupied with himself. It suddenly feels really, really important that Kageyama felt good too; even though Hinata hadn't been touching him directly, he still felt responsible, especially if he was going to count this as one of his victories.</p>\n<p>“You're such an idiot, I can't believe you kept me up for this.” His non-answer is enough for Hinata, and he grins.</p>\n<p>“You can sleep now, Kageyama,” he says, graciously, and Hinata thinks he feels exhausted enough to sleep now too. He makes a smooching noise into the receiver. “I'll see you at practice tomorrow?”</p>\n<p>“Yeah, you'll see me, and that's going to be the last thing you see before I kill you for this.” Kageyama sounds exhausted too, and Hinata thinks he can hear a twinge of embarrassment in his voice. “Go to sleep, dumbass.”</p>\n<p>“Night, Kageyama,” says Hinata. He can already feel himself starting to doze. He thinks he hears Kageyama say his name before he drifts off, and that night he dreams about fast tosses and silky hair.</p>\n<p>Hinata wakes up Monday morning with his phone next to his face and a mess on his shirt as evidence that what had happened the night before wasn't just the sort of dream he's been having lately. Yes, he really stuck his finger up his ass with Kageyama on the other end of the phone, and he had liked it. Hinata's face heats up, but he feels weirdly excited too. He feels more rested than he probably should be considering how late he was up last night, and he hops out of bed to clean himself (and his sheets) up. He's excited to go to school on a Monday. He feels like a different person; maybe this is what being an adult is like.</p>\n<p>Kageyama, on the other hand, looks like death. Hinata almost laughs when he spots him by loitering by the school gate, dragging his feet, until Kageyama fixes him with a glare that could curdle milk. Hinata raises his hands in defense.</p>\n<p>“I'm sorry!” he apologizes automatically, trying to calm the storm before it hits. “You were into it too!”</p>\n<p>That probably wasn't the best way to calm Kageyama down, because he busies himself tugging on Hinata's hair. Hinata whines, following along as Kageyama drags him to the gym.</p>\n<p>Kageyama is absolutely out of it during practice, and Hinata can't help but feel a little guilty for keeping him up so late. After the fifth missed quick, Hinata whirls on him.</p>\n<p>“Kageyama!” he huffs, putting his hands on his hips. “Come on, I want to actually hit one!”</p>\n<p>“Maybe if you didn't keep me up so late last night, we wouldn't be having this problem!” Kageyama snaps, and his expression is getting darker.</p>\n<p>The gym is so quiet Hinata swears he can hear everyone's breathing. Kageyama suddenly realizes what he just said, and what it sounds like, and his face turns beet red and he's sputtering and trying to backtrack and Hinata would laugh if he wasn't almost doing the exact same thing.</p>\n<p>“Get a room,” comes Tsukishima's expected taunt, and both Hinata and Kageyama whirl on him with a unified “Shut up!” He looks smug, and Hinata's about to give him a what-for when he feels a hand on his shoulder.</p>\n<p>Hinata turns around and sees Daichi smiling down at him, and he freezes. This was definitely not how he saw his morning going; he expected a lot less fear and terror. Daichi leans in, and even Kageyama looks a little unnerved.</p>\n<p>“I don't care what you two want to do in your spare time, but don't bring it to the court, alright?” Daichi pats both of them on the shoulder and they shout “yes!” in unison, they don't even bother telling him that's not what happened because well, that's exactly what happened, kind of, and they don't need a further talking-to from the captain.</p>\n<p>Kageyama does do admittedly better after that wake-up call, but both he and Hinata finish the session even more exhausted than they had been before. They don't even bother racing each other out of the gym and instead end up leaning against each other as they walk; it's warm and nice even if Kageyama is heavy and Hinata suspects he's putting his full weight on Hinata on purpose.</p>\n<p>By the time lunch rolls around, Kageyama looks like he's fallen asleep in class a few times. Hinata goes to drag him to their usual spot, but he shakes his head and grabs Hinata by the arm. Hinata follows him to the side of one of the school buildings.</p>\n<p>“I'm going to get 30 minutes of sleep today at least,” he says, shoving Hinata on his ass and sliding down against the wall himself. “Come here.”</p>\n<p>“What?” Hinata's cheeks puff out because his butt hurts from the rough handling. “Can't you do this on your own time or are you worried someone's gonna see you sleeping and decide you're not as cool as people think you are?”</p>\n<p>Kageyama just grunts and grabs Hinata's knees; he forcibly arranges his legs in a cross-legged position and Hinata wills his face not to flush at the feeling of Kageyama's hands on his thighs. He does flush, though, when Kageyama flops down with his head in Hinata's lap like it's no big deal.</p>\n<p>Hinata guesses it really isn't a big deal, he's seen people do this at school before, but it usually isn't two boys and Kageyama's head has been close to his crotch way too many times doing way too many unsavory things for Hinata to just not think about them.</p>\n<p>The taller boy doesn't seem to be having any of these problems, though, as he settles himself against Hinata. His head's a pleasant weight against Hinata's lap, and he finds himself smoothing his hand along Kageyama's hair.</p>\n<p>Kageyama makes a satisfied noise in the back of his throat and Hinata's glad his eyes are closed so he can't see the pink dusting Hinata's cheeks. This feels so much more weirdly intimate than any of the actually intimate things they've done, but Hinata doesn't feel like removing his hand. He briefly remembers the hickey incident and thinks about what would happen if anyone sees this, and then decides he doesn't care. He never gets to touch Kageyama's hair because he's so much shorter, and he's not going to let this opportunity slip by.</p>\n<p>His hair is soft under Hinata's hand, smooth and tangle-free, unlike Hinata's own. He feels a little jealous because he knows for a fact that Kageyama doesn't even have to do anything to his hair to get it to look like this, whereas nothing Hinata has ever done or will ever do can help his unruly mess.</p>\n<p>“I like your hair,” Kageyama suddenly says, and Hinata's hand freezes because he's not sure if he was imagining that or not; if he wasn't, he's in trouble because Kageyama may have learned how to read his mind.</p>\n<p>“I know what you're thinking, dumbass, you're the most transparent person I know.” Kageyama's eyes slide open and he looks up out of the corner of his eye at Hinata. “I can't imagine you with hair that doesn't look like you came in out of a wind storm.”</p>\n<p>Hinata wants to protest, but it's kind of true and Kageyama is sort of complimenting him. Kageyama really sucks at compliments; he knows this through personal experience. The fact that Kageyama tries at all makes something warm clench in his chest. Kageyama isn't the type of person to say something he doesn't mean.</p>\n<p>“Thanks,” Hinata says uncertainly. “I like your hair too, I guess.”</p>\n<p>They're quiet again for a while, until Hinata speaks up. “Are you asleep?”</p>\n<p>Kageyama makes a noise that could be “no” or “shut up” but he's not asleep, so Hinata keeps talking.</p>\n<p>“Do you want to have sex?”</p>\n<p>Suddenly Kageyama's choking on his own spit and Hinata slaps him on the back to try and help. “I didn't mean with me!” he's saying quickly, because he knows exactly how that sounded and he seriously doesn't mean it that way, intentionally. When Kageyama catches his breath, he continues.</p>\n<p>“I mean like, eventually. With someone.” Hinata's not really sure why he's asking, but he's been thinking about it since last night. Not Kageyama having sex with someone, or having sex with him, or anything having to do with Kageyama and sex at the same time. “Maybe if you get a girlfriend or something-”</p>\n<p>“Haven't I told you before I'm not interested in that?” Kageyama's voice still sounds strained from the coughing, and he rolls over so he's looking up at Hinata. “You can stop worrying that I'm going to stop playing volleyball with you.”</p>\n<p>“That's not what I'm worried about! Well, mostly,” grumbles Hinata. “I was just curious, since you knew about...you know.” Thinking about last night makes his cheeks heat up.</p>\n<p>Kageyama's mind seems to be going down the same path because his face is coloring, too. “What, you don't think you should be prepared if the time ever comes? What are you going to do if one day you're getting into it with someone and then you have no idea what to do, and someone ends up getting hurt because they're and impatient dumbass who doesn't stop and think for a second-”</p>\n<p>“You actually think about how bad you're going to be at sex for the first time? Jeez, Kageyama.” Hinata rolls his eyes. “I mean, I know you'll be awful, but you could at least try to pretend you won't be.”</p>\n<p>“I'm not going to be awful because I know how to do it!” Kageyama snaps, and he's sitting up now, once again taller than Hinata. “You're the one who didn't even know where it's supposed to go!”</p>\n<p>“I do now!” Hinata doesn't question the fact that Kageyama knows how to do it with a guy, he is, after all, the sort of person who wants to be super prepared for any situation. “I'm going to be better than you because I've actually tested it.”</p>\n<p>Kageyama's looking at him smugly. “So you're planning on taking it up the ass? What about girls?”</p>\n<p>Hinata's face goes scarlet. “I'm just saying I'm prepared for either now! I don't even know anyone I'd do it with besides...” He trails off, and Kageyama watching him is suddenly making him self-conscious because really, the only person he can imagine trying it with is Kageyama, because at least he knows Kageyama and he's seen his dick and Kageyama did help him through it last night, kind of.</p>\n<p>They're both quiet for a moment. Kageyama clears his throat.</p>\n<p>“It's just that you'd want to do it with someone you trust, right?” Hinata blurts out. “I trust you, and I'm not saying I want to do it with you, I'm just saying that you're the most likely candidate right now in this situation.” He crosses his arms indignantly. “Plus, that way I could definitely prove I'm better at it than you are.”</p>\n<p>“You've never even done it before.”</p>\n<p>“Neither have you!” Hinata stares at him, hard. “Would you be too chicken to do it?” And Kageyama is gaping at him, like he can't believe where this is going, and honestly Hinata can't either but he doesn't want to stop himself.</p>\n<p>“Of course not,” Kageyama finally snaps at him, leaning in close so their noses are almost touching. “If you can handle it, I can definitely handle it, stupid.”</p>\n<p>“Fine, let's do it.” Hinata's mouth is running on its own now, and Kageyama seems intent on taking the bait. “This weekend. At your house.”</p>\n<p>Kageyama's face seems to falter, finally, and Hinata thinks he might have won whatever he was trying to win, but he feels oddly disappointed until Kageyama's face scrunches into his determined glare he gets whenever he's made up his mind about something.</p>\n<p>“Fine. You're coming over to my house on Saturday.”</p>\n<p>“Get pizza,” says Hinata, trying to mask the nervousness that's suddenly bubbling in his stomach. He has no idea what's just happened, but he thinks he agreed to have sex with Kageyama after his mother explicitly told him not to have sex until he was 18. Neither he nor Kageyama can get pregnant, and that's what his mom mainly seemed to be concerned with, so it was fine, and she never had to know about it. Plus, he'd be getting experience, so he wouldn't suck at it when the real time actually came.</p>\n<p>Hinata's so busy thinking to himself that he doesn't notice Kageyama sliding back down and burying his face in his lap, like he can't believe what he's doing either. He can feel the heat of Kageyama's face through his pants, and knows his face probably matches.</p>\n<p>He sits there quietly as Kageyama settles his face into Hinata's lap, and things should be fine except for the small fact that Kageyama's face is very, very close to Hinata's crotch, and he thinks he can feel his breath against it (wishful thinking, probably), and he seriously needs Kageyama to move his head before he can't stop thinking about how Kageyama looked the last time they were close like this. He screws his eyes closed and tries his best to think about something else. Puppies, kittens, hitting a toss, Kageyama's nose nudging against what is definitely his dick-</p>\n<p>“Kageyama!” Hinata's hands are flying to Kageyama's head to try and move him away. Maybe he doesn't realize how close he is, or he's fallen asleep and is doing it by accident. When Hinata shakes his head, though, he can feel Kageyama pull away from him in a very conscious manner.</p>\n<p>Hinata watches, horrified, as Kageyama rolls so he's on his side, facing Hinata's stomach. He glances up like he's making sure it's alright, and Hinata takes the chance to try and glare at him.</p>\n<p>“We're in the middle of school,” he hisses, looking around after he does so to make sure nobody is watching this. “Someone is going to see this, Kageyaaa-” he trails off into a groan as Kageyama mouths at his growing erection through the fabric of his pants. He hates Kageyama so much right now.</p>\n<p>Kageyama pulls away enough to slide out of his jacket and toss it into Hinata's face, who splutters when his mouth ends up full of cloth. “Pretend I'm sleeping or something,” he says, “I'm going to get you back for last night.” And then he's working down Hinata's zipper and Hinata is hurriedly shoving the jacket over his lap and Kageyama's upper body, trying to make it look like maybe Kageyama's grabbing a nap or something like what he should be doing in the first place.</p>\n<p>“Weren't you tired?” Hinata's voice is strained as he feels Kageyama palm him through his boxers. He knows he could stop him if he really wanted to. He doesn't.</p>\n<p>“I am,” comes the muffled reply, breathed out against Hinata's cock. He shudders and folds in on himself a little, and then looks around again to make sure nobody is walking by. They're still safe.</p>\n<p>Suddenly, he feels a tongue lick up the underside of his shaft and he gasps and his hips jerk and he can feel Kageyama pinching the skin of his stomach. “Don't blind me, dumbass.”</p>\n<p>“Maybe if you weren't such a jerk that wouldn't even be a problem you have to worry about.” Hinata's fingers curl into fists at his side as he tries to look natural, like Kageyama isn't about to give him a blowjob in the middle of lunch period.</p>\n<p>He feels Kageyama shrug, and then there's the wet heat he's starting to get used to feeling, but it's not any less delicious than usual. It's a weird angle, as Kageyama's on his side, and trying to use his mouth as best as he can, and Hinata's thigh twitches. He's still looking around them, but he feels his gaze start to drift as he concentrates more on the feeling of Kageyama's tongue moving over him, open-mouthed, breath tickling his skin. Hinata is absolutely sure this looks exactly like what it is and he prays nobody walks by.</p>\n<p>Kageyama's teeth suddenly scrape the sensitive skin and Hinata gasps and accidentally smacks his head back against the wall. While he's cursing, Kageyama's taking him a little deeper, and then Hinata feels a hand on the base and it feels so good, exactly like he'd wished he had last night, because Kageyama's fingers are long and rough in all the right places and he loves it.</p>\n<p>Hinata curls himself protectively around Kageyama, not really caring what he looks like because he's overcome with the need to get closer and touch, and one of his hands snakes under the fabric of Kageyama's jacket to feel blindly across his face, the smooth skin and his eyes are closed and Hinata can only imagine what he looks like. For the first time he considers Kageyama; he's handsome, maybe, and a little pretty when he doesn't look like he's going to piss in someone's cereal, which is always. He can maybe see why girls like Kageyama.</p>\n<p>But then Kageyama bites down gently and Hinata swears and takes it all back because shit, that feels kind of good but Kageyama is a complete demon. He feels the breath against his abdomen as Kageyama snorts.</p>\n<p>“I hate you so much,” Hinata gasps out, and then the heat of Kageyama's tongue is gone and it's replaced by his hand, working up and down the length with some kind of determination that Hinata isn't used to. It feels really good, honestly, the sort-of-rough handling. He can feel Kageyama's cheek pressing against his thigh.</p>\n<p>There's a sensation against his balls, suddenly, and Hinata has to bite his tongue to keep from moaning because he's sure that's Kageyama's tongue, and his teeth and his lips and this is not fair at all, he has no idea how Kageyama's finding new things to do like this and he's a little jealous that he hasn't had a turn to try it. He's going to get Kageyama next time, he swears to himself, and then Kageyama's callused fingers are teasing the head and he's moaning and pressing his hands against his mouth and his legs are shaking and he thinks he accidentally just came all over Kageyama's face. He's sure Kageyama is going to be pissed but he's too overcome to move, and Kageyama's hand keeps stroking him through it which makes him feel even weaker. </p>\n<p>When he's done, he feebly lifts Kageyama's jacket off to survey the damage. Kageyama's wiping Hinata's come off his face with one of his hands, and his nose is wrinkled; Hinata thinks about how dead he is and starts apologizing as quickly as he can.</p>\n<p>Kageyama just glares up at him. “Shut up, dumbass,” is all he says as he tries to wipe his face. “You're making a way bigger deal of this than it even is. Like always.”</p>\n<p>Hinata's busy shoving using the sleeve of his own jacket to gently wipe Kageyama's face clean, and he doesn't really care that he's going to have to take care of that later. Kageyama stops struggling and just looks up at him, and Hinata's struck again with how nice he can actually look when he's not glaring. He looks away before his cheeks can get too red, any more than he can explain away from just having had his dick sucked.</p>\n<p>Yeah, this is probably weird. Kageyama ends up getting them juice, though, and they spend the rest of lunch seeing who can hold more liquid in their mouths (Hinata ends up laughing and spraying it all over Kageyama's face, which he ends up having to wipe off again.) Maybe weird isn't such a bad thing.</p>\n<p>For Hinata, the week seems to drag by more than usual. He spends the nights at home reading about what he's planning on doing with Kageyama; it sounds way scarier than he'd originally thought and he's starting to feel nervous, but he's definitely not going to back down, and deep down he doesn't think he wants to. It crosses his mind a few times that normally he'd be doing this with a girl, but it's Kageyama and he's trying to make up an excuse for wanting to do it but he can't, he just does.</p>\n<p>Kageyama seems to be his usual self, for the most part, like he's forgotten that Hinata has invited himself over to his house on Saturday so they can maybe have real, serious adult sex. Hinata's annoyed at first that Kageyama's so stoic about everything, but then he startes to notice; Kageyama keeps looking at him out of the corner of his eye when he thinks Hinata isn't looking, and as soon as Hinata turns his attention to see what Kageyama wants, he's suddenly looking away and pretending to be doing something else.</p>\n<p>This happens especially a lot during practice, when Hinata turns to Kageyama to brag about a receive he nailed and Kageyama is already looking at him. The first time he notices it seems to alert him to every other time, and he doesn't know if this is a new thing or something Kageyama does often like when Hinata watches him during practice, the way his muscles bunch when he runs or jumps and the shape of his arms as he reaches up to touch the ball. Every time they touch, Hinata is suddenly hyper aware of it. He's worried Kageyama notices, but if he does, he's not saying anything.</p>\n<p>The week passes slowly, but it's suddenly over before Hinata knows it, and it's Saturday and he can't stop fidgeting all through the day. He's missing tosses in practice in the afternoon, and he knows he probably looks like he's going to be sick because Suga and Daichi are shooting him concerned looks, and Nishinoya is hovering around him more than usual like he senses something is up. Kageyama doesn't even yell at him for missing which is maybe the weirdest and most unsettling thing of all, and it is definitely throwing him off.</p>\n<p>After practice clean-up, they get dressed silently, gather their things, and leave, in sync, to pick up Hinata's bike at the gates. Hinata has already told his mother he's spending the night at Kageyama's (“I'm so glad you're getting out more!” little does she know) and they're walking for five minutes before Kageyama speaks up.</p>\n<p>“We don't really have to do anything,” he says, and he sounds gruff like he's been thinking about this all week and only now has been able to bring himself to say something.</p>\n<p>Hinata's stomach jumps, but he feels more disappointed than relieved. “Are you chickening out?” he grins, but what he's really thinking is 'Please don't let me be the only one who actually wants to do that.'</p>\n<p>Suddenly Kageyama's giving him that glare that is so familiar now it's practically comforting. “Dumbass, I'm giving you a way out so you won't end up crying on me.”</p>\n<p>“You think I'm going to cry?!” Hinata shouts indignantly, and he can already feel his nerves easing. “I'll make you cry!”</p>\n<p>“That's not what you're supposed to tell someone right before you're going to have sex with them.” Kageyama is right, but Hinata pouts anyway because he started it, and suddenly he's dwelling on the word Sex again, a big grownup thing that he'd never even considered before Kageyama. He knows people his age have done it, it's not that uncommon and a few boys in his class have bragged about 'getting some', but Hinata has never placed himself in this situation. Does it even count if you're doing it with boy?</p>\n<p>Hinata can feel anxiety bubbling in the bit of his stomach again and he must be making a weird face because suddenly Kageyama is nudging his shoulder. Hinata nudges back, and then Kageyama's bumping into him too hard so Hinata launches himself and they are tumbling down the grassy embankment by the side of the road.</p>\n<p>They end up dusty , Hinata kneeling over Kageyama and their noses almost touching. They stay like that for a minute, staring at each other, and then Hinata gets the urge to kiss Kageyama, so he does.</p>\n<p>It's different than usual; it isn't hot and fast but small and maybe a little awkward, but Kageyama is kissing back so it isn't too bad. They pull back after a minute, and Hinata can see red on Kageyama's cheeks and wonders if that mirrors his own.</p>\n<p>“I want to do it,” he says, like he's affirming it for himself as well as the boy underneath him, and he feels like he does before a big game.</p>\n<p>“I already said we could,” Kageyama says back, but it also sounds like a kind of reassurance.</p>\n<p>For some reason, the nervousness in the pit of Hinata's stomach is replaced with the kind of excitement he gets when he's about to play volleyball with Kageyama, and he's hopping up and grabbing Kageyama's hand to drag him with him. They retrieve Hinata's bike back on the road, toppled over, and Hinata wants to run all the way to Kageyama's but he has to lug this thing with him, so he settles for gripping Kageyama's hand. Kageyama doesn't shake him off or tell him to let go or call him stupid, either.</p>\n<p>They make it to Kageyama's house in what seems like record time, but is probably the time it normally takes them. Hinata hurriedly parks his bike and then they're racing to the front door and Hinata jumps from foot to foot while he waits for Kageyama to let them inside. They toe off their shoes.</p>\n<p>“Do you...want to order pizza, or something?” says Kageyama once they're both standing there, unsure of what to do now that they've reached their destination. Hinata shakes his head because his stomach is still full of butterflies and for once, he's not hungry.</p>\n<p>“We can get pizza later,” he says, sounding hopeful, like maybe he won't die after having sex like his body seems to be telling him.</p>\n<p>Kageyama nods, but he doesn't move at all. Hinata ends up having to take his hand again and tug him to the bedroom, because he's come this far and he's not backing down now that he's spent all week preparing for this (in more ways than one).</p>\n<p>Inside the room, Hinata flips on the lights and lets go of Kageyama, plopping down on his bed and putting his hands on his knees. “Okay.” He wiggles a little because now that he's here, he's definitely not going to turn back and he's feeling more excited than nervous. “Let's go.”</p>\n<p>Rolling his eyes, Kageyama turns and tosses his bag onto the floor before rummaging around inside it. Hinata watches, waiting, until he stands up and tosses two things at Hinata. Hinata tries to catch them, really, but they bounce off his chest and onto the floor and he scrambles to pick them up.</p>\n<p>He hears a huff and thinks Kageyama is maybe laughing (???) at him, but ignores it to study what he's got in his hands. One is a tube, and he can't really tell what it is so he holds it up and squints. </p>\n<p>“It's lubricant,” says Kageyama simply. “It's for-”</p>\n<p>“I know what it's for!” Hinata's cheeks flush. “I did do some reading, okay?”</p>\n<p>“Sorry, I forget you know how to read sometimes,” Kageyama retorts, and they stare at each other for a few seconds before Hinata grins and throws the lube back at Kageyama. He holds up the other thing, and he knows what this one is because he's seen it and his mom has talked about it endless times and suddenly he's wondering where Kageyama got this stuff.</p>\n<p>Kageyama looks sheepish, and then glances away. “Suga gave them to me.”</p>\n<p>“You told him?!” Hinata feels scandalized. “Kageyama!”</p>\n<p>“No!” Kageyama holds his hands up in defense, frowning. “I'm not stupid, idiot. He just...gave them to me. Without my consent.”</p>\n<p>Hinata does seem to recall Sugawara pulling Kageyama aside and talking to him about something, and Kageyama's face turning distinctly red, but he had thought that was about Kageyama's shitty tosses, maybe. He was apparently way, way off.</p>\n<p>He stares at the foil packet in his hand and then suddenly looks up, remembering something really important.</p>\n<p>“Kageyama, who is going to be on top?”</p>\n<p>Kageyama folds his arms like he was expecting this. “You already stuck your finger up the ass, so you should be on the bottom,” he says, like it's the simplest explanation, and Hinata bristles.</p>\n<p>“That's totally not fair!” Hinata shouts. “I only did that because you brought it up! And...it felt sort of okay, so I mean, I did try it again, but that doesn't mean you can't do it this time!” His face turns red when he admits to having tried it a few more times after he'd done it over the phone with Kageyama, and while Kageyama looks sort of smug, his cheeks are also heating up.</p>\n<p>Hinata is not going to deny that he's really curious about what it would be like with Kageyama instead of just his fingers, but he's also not going to admit it. Instead, he holds out his fist. “Rock paper scissors.”</p>\n<p>“You want to play rock paper scissors for sex?” says Kageyama, and Hinata nods. He thinks Kageyama is going to refuse, but it's also a competition and Kageyama's never backed down from one of those, and they end up going 2-3, with Kageyama winning. Hinata pretends to whine about it, but he actually doesn't mind as much as he probably would have if he'd been going into this blindly.</p>\n<p>“I don't think I'd trust you to do it properly anyway,” Kageyama is saying, and Hinata does get up in arms about that.</p>\n<p>“Like you're going to do any better? You've never done this before!” he gripes, throwing the condom at Kageyama's head. He catches it easily, and Hinata glares.</p>\n<p>“I'm going to do it, and I'm going to do it well.” Like everything, are the unspoken words, because when Kageyama sets his mind to doing something, he does give it 110%. “I'll take care of it.”</p>\n<p>The look Kageyama is giving him sends an unwanted shiver up Hinata's spine, not because he's nervous, but because Kageyama looks so serious and focused, the way he looks on the court, only it's directed at Hinata and it's never been like that before. Hinata feels like he's looking at Kageyama for the first time again.</p>\n<p>They stare at each other for a few seconds, and then Hinata has to look away. Kageyama is really serious about this, and his nerves are starting to come back. What if he messes up, or he's horrible, or Kageyama decides he hates him after this-</p>\n<p>There's a dip in the bed when Kageyama sits down next to him and bumps Hinata's shoulder with his own. “Do you really want to?” Hinata's nodding, because he does, but that doesn't make his nervousness any better. “It'll be fine. If it's not, I'll do anything you want for an entire week.”</p>\n<p>Hinata thinks about this, and finally glances at Kageyama. “Two weeks.”</p>\n<p>Kageyama looks like he's about to argue, but then he nods. “Two weeks.” That's how sure he is that it's going to be fine. And then he leans forward and his lips meet Hinata's and Hinata allows himself to lean into the soft warmth of Kageyama's lips. His shoulders jump when he feels Kageyama's wet tongue slide across his lower lip, but he opens his mouth compliantly because it feels nice. It feels nice when Kageyama's tongue licks into his mouth and he can feel himself getting warm, like the room is getting too stuffy and Kageyama is leaning in and Hinata's leaning back and suddenly he's on his back on Kageyama's mattress.</p>\n<p>At some point along the way Kageyama's crawled between his legs, still leaning over him and trying to pull noises out of Hinata, which he gives away freely since there's no need for him to shut up this time. Kageyama's tongue licks along his teeth and they really have gotten better at this because Hinata can already feel arousal curling in his stomach. Kageyama finally pulls away with a wet sound that goes straight to Hinata's dick.</p>\n<p>“Are you going to keep this on or can I take it off,” Kageyama says, gruff, and his voice is lower than usual. He moves back so Hinata can sit up and shrug out of his jacket, and his fingers definitely aren't shaking at all as he goes to unbutton his shirt. It feels like he's moving through molasses; he realizes this is the first time he'll be completely naked in front of Kageyama, and he freezes.</p>\n<p>Kageyama, who at this point had that unreadable scary Kageyama look on his face, looks a little concerned. “What?”</p>\n<p>“Uh...” Hinata twists one of the buttons with his fingers. “It's just, I've never had my shirt off?”</p>\n<p>They stare at each other, and Kageyama raises an eyebrow. “I've seen you shirtless all the time when we change.”</p>\n<p>“That's different!” says Hinata, because it is, somehow. “You're not actually looking at me then.”</p>\n<p>“I look at you,” Kageyama says like it's natural, but Hinata thinks he can hear a change in Kageyama's voice. “It's not a big deal. Look, I'll take mine off.” And he's tugging off his own jacket and working at the buttons on his shirt before Hinata can say anything else.</p>\n<p>Kageyama looks good. He looks really good. Like he'd said, they've seen each other plenty of times at practice, but he's never really studied the muscles on Kageyama's stomach, or the way his arms look when he's sliding them out of his sleeves. His shoulders are broader than Hinata's own, and he can see the powerful tosses Kageyama's capable of just by looking at him.</p>\n<p>No wonder girls like Kageyama.</p>\n<p>Suddenly there's a throat clearing, and Hinata realizes he's been spacing out and Kageyama's shirt is already crumpled on the floor next to his bed. He flushes, and goes back to undoing the buttons on his own shirt, though he's still feeling a little awkward. When he finally slides it off, he looks up brazenly at Kageyama, trying to dispel his embarrassment by pretending he isn't.</p>\n<p>He can feel Kageyama looking him over and resists the urge to cross his arms over his chest. He feels weird because he's smaller than Kageyama, he's not as thick or as powerful-looking, but Kageyama's too busy pushing him back down onto the bed and reaching for Hinata's zipper, which is starting to press uncomfortably against his dick. He glances up at Hinata like he's asking if it's okay, and Hinata nods.</p>\n<p>The sound of the zipper seems unbearably loud in the suddenly-quiet room, and this is it, Hinata is going to be completely naked in front of someone else for the first time. He feels Kageyama tugging at the material of his pants and shifts his hips up a little to make it easier, and then his pants are sliding off and his boxers along with them. He really, really wants to shove his hands over his crotch because this is ridiculously embarrassing and Kageyama still has his pants on and that's not fair at all, but then Kageyama's gripping him in his hand and Hinata's hips are rising unintentionally.</p>\n<p>“Kageyama,” he grunts, swatting away Kageyama's hand. “Take your stupid pants off too or I'm not doing it.”</p>\n<p>“I'm going to, shut up.” Kageyama looks like he really just wants to keep touching Hinata, but he sits back and reaches for his own zipper. Hinata can see now that Kageyama's getting hard already as well, and he feels a little bit better at the thought that Kageyama's about to be as exposed as he is.</p>\n<p>It takes a little longer for Kageyama to shuffle out of his own pants, but when he does, Hinata takes a moment to admire the view. Kageyama looks a little embarrassed now too, which is deeply satisfying, and Hinata's eyes travel from his shoulders to his chest to his stomach and then, finally, to his dick.</p>\n<p>Hinata whistles comically, fanning himself. “Hey there, Kageyama. I haven't seen you in a while.”</p>\n<p>Kageyama smacks him on the head but Hinata's laughing at his own joke so he doesn't care much. It feels like Kageyama's been getting the jump on him in all things where this is concerned, and his laughing fades away as he suddenly comes up with an idea. He surges forward, using his weight to knock Kageyama down onto his back, and crawls on top of him.</p>\n<p>“What the fuck are you doing?” Kageyama's pushing at his shoulders, but Hinata doesn't want to move, so he isn't. “Get off, this isn't how-”</p>\n<p>“You shut up this time!” Hinata looks at him sternly. “You kept getting to mess with me, and now I get to do something if I'm going to have to have this up my butt.” Kageyama shuts up.</p>\n<p>The truth is, Hinata's been waiting for this. Kageyama has sucked him off not once, not twice, but three times, and Hinata's only done it once. Kageyama looks really good when he's doing it, and he wants to look like that too, so he's been reading up on it, how to take things in deeper, testing his gag reflex to see if he'll die if he goes too far. He thinks he can do better than last time.</p>\n<p>Hinata shimmies himself down so he's settled between Kageyama's legs, face-to-face with his dick, which has seemingly gotten even harder. Hinata's own dick is rubbing against the sheets, but he ignores it for now, because he has more important things to focus on. He licks the tip of Kageyama's dick, and hears his breath suck in. He can do this.</p>\n<p>He takes the tip in his mouth, gently, getting a feel for it again because it's been a while. It still tastes funny, but he doesn't mind because it's Kageyama, and he never really minds when it comes to him. Hinata lets his tongue rub against the soft skin as he moves his head down a little further, and he hears Kageyama make a small noise. Feeling spurred on, he goes even further.</p>\n<p>Kageyama's hand find their way into Hinata's hair, and this time Hinata makes a noise, because it's soft and Kageyama's fingers are pressing against his scalp but not in a bad way. Hinata can feel his fingers shaking, a little, and he feels another swell of confidence in him that pushes his mouth even further along Kageyama's cock, which is getting hotter and harder and Hinata can feel it getting closer to the back of his throat, so he breathes in through his nose, and suddenly he is doing it, Kageyama's all the way in there and he makes a triumphant noise.</p>\n<p>The triumph doesn't last long because in the next second, Kageyama's hips are jerking up and thrusting into Hinata's mouth and he's gagging and coughing and sudden hands at his shoulders are shoving him away and onto his back. He coughs and coughs and there's still a hand in his hair; when he opens his eyes, Kageyama's staring down at him with a really scary look on his face.</p>\n<p>“Are you an idiot?” he says, but he doesn't look mad, exactly.</p>\n<p>“You're the idiot!” Hinata says, feeling sort of upset because he'd been trying to make Kageyama feel good and now he was mad, or something.</p>\n<p>Kageyama's face gets softer, though, catching Hinata off-guard. “I'm sorry,” he says, looking away, and Hinata gapes at him. “I didn't expect that so...but you did...well.”</p>\n<p>Suddenly Hinata feels himself beaming and he can't stop, but he doesn't care to. He shoves himself up and smacks his lips against Kageyama's because it feels right, and he wants to, and they almost tumblr over again before Kageyama's pushing him back down to the bed.</p>\n<p>“Stop shoving me over, dumbass!” His voice is gruff, but it's the gruff it gets when he's feeling embarrassed and doesn't want to admit it. “Are you ready to stop fucking around now?”</p>\n<p>“I thought that's what we were supposed to be doing?” Hinata says back innocently, and enjoys the red that lights up Kageyama's scandalized expression. He wiggles his hips. “Come on, before I change my mind.”</p>\n<p>Kageyama's expression changes from embarrassed to something else, and Hinata immediately backpedals. “I'm not going to! Unless you take like, fifty hours, just because we have to go to school eventually. So hurry up.”</p>\n<p>The taller boy nods and reaches around on the bed for something, sitting upright when he finds what he'd been looking for; the lube and the foil packet Suga had so graciously bestowed. He briefly wonders if maybe Suga knows, but that's not possible, right? He assures himself that it's not, to stave off embarrassment.</p>\n<p>“Lift up your knees,” Kageyama says, shoving at Hinata's leg. He complies, noticing his socks are still on; that's hilariously funny for some reason, and he tells Kageyama. And then suddenly there's something pressing into him and he's not laughing anymore but wincing because yeah, Kageyama's finger is definitely bigger than his own, and it's slick and kind of slimy and really, really cold.</p>\n<p>Kageyama is watching him carefully, so Hinata makes sure his face doesn't look too pained or anything. “It still feels weird.”</p>\n<p>“That's why we're doing this, so it doesn't feel weird.” Kageyama wiggles his finger, and Hinata shifts his hips uncomfortably.</p>\n<p>“I can't believe your finger is up my ass,” says Hinata, and then Kageyama's pulling his finger out and pressing it in, fast, and Hinata's legs jerk.</p>\n<p>“Don't sass the guy with his finger inside of you.” Kageyama moves it out again, slowly, and presses it back in, and it's starting to feel better; actually, it's starting to feel like it isn't enough.</p>\n<p>Hinata takes a deep breath. “Put another one in.”</p>\n<p>“Are you sure?”</p>\n<p>He nods. He's done this a couple times so far, but only with up to two fingers, and it had been weird and he'd gotten kind of embarrassed so he didn't go any further than this. He knows they have to, though, from what he's read on the internet, and he knows Kageyama knows too. It's just a matter of sooner rather than later.</p>\n<p>Kageyama sets his jaw and then Hinata can feel another finger pressing against him nudging in beside the other one and he grits his teeth. He knows it's possible for this to feel good, because he'd done it, but right now it's just uncomfortable. He can't even imagine having something big in him, but he wants it anyway.</p>\n<p>He'd been allowing him to settle, but Kageyama starts slowly moving his fingers apart, and Hinata can feel himself stretching, and it's weird. It's weird that Kageyama is sitting right there, with his fingers up Hinata's ass, looking concerned like he's doing something not right, so Hinata just gives him a thumbs up, and he continues.</p>\n<p>And then there's another finger in him and Hinata whines because it burns a little. His fingers are clenching into the sheets of Kageyama's bed, and then he feels fingers slipping between his own and Kageyama's hand is in his, so he focuses on that instead. He thinks about Kageyama tossing to him, slamming the ball with his hands, and he feels calmer, and before he knows it there's a weird emptiness in him that he hasn't felt before, and he wants it to go away. He wiggles his hips again and looks back at Kageyama.</p>\n<p>“Are you sure?” Kageyama's saying, like he wants to give Hinata one more chance to back out, and Hinata huffs.</p>\n<p>“Yes, I'm sure! Are you deaf?” He kicks at Kageyama with one of his legs. “If you ask me that one more time I'm going to kick you in the dick and then we won't do anything.”</p>\n<p>Kageyama is holding the condom, but he still looks uncertain, like he's doing something he shouldn't be, so Hinata grabs it out of his hands and rips it open. He watched his mom roll one of these onto a banana, so he thinks he can do it, maybe.</p>\n<p>Turns out, it's not as easy as rolling it onto a banana made it look, but he does finally manage, with lots of grunting from both him and Kageyama; lies back and admires his handiwork; Kageyama's dick is at full attention and it's kind of satisfying to know it's because of him.</p>\n<p>He looks up and meets Kagyama's eyes, and they both stare at each other, determined. Hinata feels less nervous now that he's come this far. He feels Kageyama's hands on his thighs, and knows there is definitely no turning back now. It's a good thing he doesn't want to.</p>\n<p>It seems like forever before Kageyama actually tries to do anything, and Hinata has to cover his eyes because he's so embarrassed and if he can't see it, it can't be happening. He's blurting out “Kageyama, do it, hurry up, I'm going to die” and then Kageyama's pushing into him, for real, and he thinks he really is going to die. Kageyama's definitely bigger than his fingers, and warmer, and he is trying really hard not to think about what they're doing right now; the burn makes it easier.</p>\n<p>Hinata's only aware that he's making a weird noise when Kageyama grips his knee hard enough to bruise just to get his attention. It doesn't hurt as much as he was afraid it was, honestly, but it stings and he can't stop thinking about how that's Kageyama's dick in a place dicks aren't usually supposed to be in, and he's having sex with his volleyball partner/rival/whatever they are now.</p>\n<p>“Hinata,” Kageyama is saying, and it finally registers when he basically shouts it. “Forget it, I'm going to-”</p>\n<p>“No!” Hinata's making a weird face and shaking his head. “Just give me a minute. Or maybe you should just shove it in, like pulling off a band-aid or something?” One look at Kageyama's face tells him that's a terrible idea. When he stops to think about it, it probably is.</p>\n<p>Kageyama does give him a minute, though. He actually gives him about five minutes before Hinata feels brave enough to take a deep breath and tell him to keep going. He focuses on Kageyama's hands on his hips and how warm they are, and Kageyama is pressing hard and it will probably leave a bruise but for some reason, that's kind of appealing. Hinata's heart is beating faster as he feels Kageyama moving again, and it's slow and awkward but basically exactly what he expected, so he's okay.</p>\n<p>It feels like hours of stop and go but it's probably only been a few minutes before Kageyama's gone all the way in, and they both breathe sighs of relief that nothing has gone wrong; Hinata appears to still be in one piece. It definitely feels very...full, and he tells this to Kageyama, whose face turns a bright red and he snaps at Hinata not to be stupid when they're doing something like this.</p>\n<p>'Something like this' makes Hinata's heart race again, and he realizes Kageyama is doing this with him for the first time, and it's Hinata's first time, and that's another thing connecting them. He doesn't feel scared anymore, just kind of excited, and he suddenly wants Kageyama to move.</p>\n<p>“You can go now,” he says, looking fiercely at Kageyama. He can tell Kageyama's doing his absolute best to stay perfectly still, and that's nice, but Hinata is tough enough for this; he hasn't been practicing all week for nothing. He experimentally moves his hips a little, and it's still weird, but the grimace on Kageyama's face is worth it. “Are you scared? I'm the one with something up my ass and you're acting like a baby.”</p>\n<p>That seems to work, because suddenly Hinata feels Kageyama moving back and then he's pushing back in, fast and firm and Hinata yelps and grips the sheets. Kageyama does it again, faster and more determined. Hinata is suddenly hyper aware of how warm Kageyama feels inside him, how it's starting to get easier and how it actually is starting to feel good.</p>\n<p>When Kageyama thrusts his hips next, Hinata rocks back to meet him and Kageyama brushes against that spot that Hinata has found before. His back arches off the sheets and he moans, and then Kageyama is stilling and that's not right at all. Hinata looks up at him, a little dizzy but coherent enough to glare.</p>\n<p>“You really suck at this, Kageyama,” he says, “When someone feels good I'm pretty sure you aren't supposed to just stop.”</p>\n<p>“I didn't know you were feeling good, dumbass!” Kageyama sounds a little panicked. “How am I supposed to know if it's feeling good or hurting?”</p>\n<p>“That's not a hurting sort of noise!” Hinata almost can't believe they're arguing in the middle of having sex, but it is Kageyama. “I'll tell you if it hurts so just keep going!”</p>\n<p>With a huff, Kageyama pushes in again, and even though he hasn't hit the right spot, it still feels good. Hinata can feel his breath starting to get heavier as Kageyama finally picks up a decent enough rhythm; it's not perfect, but it's their first time doing this so it's good enough, and he's also secretly satisfied that Kageyama isn't perfect at everything. </p>\n<p>He was planning on keeping that to himself, but apparently he's said it out loud because Kageyama is glaring at him and then suddenly gripping his hips so, so tight and practically slamming into him. The look on his face goes straight to Hinata's dick; his cheeks are red and his hair is sticking to his forehead with sweat like when they're in the middle of a game, but his eyes are dark and the pupils are blown wide and Hinata wishes he could take a picture. Suddenly, Kageyama isn't close enough; Hinata finds himself reaching up like an idiot because he can't find the words he wants to say.</p>\n<p>Kageyama seems to understand well enough, like he always does, because he's leaning in enough for Hinata to wrap his arms around his neck and pull him closer. He breathes hot and wet against Kageyama's shoulder and feels himself getting fuzzy because Kageyama's hitting just right and he wants to cry, and he thinks he might be because there's something warm and wet running down his face.</p>\n<p>They match a rhythm together, just like they're able to on court, and Hinata thinks it's possible they might be perfect for each other because this is incredible, really. He tries telling as much to Kageyama, but it just comes out in short whines and probably isn't coherent at all. He thinks he's just drooled a little, too. He thinks he might be the worst at sex, he's not even able to do anything at this point, but Kageyama's making it work enough that he doesn't care. He's vaguely aware of his dick and how he's desperate to touch it, but he doesn't want to let go of Kageyama, either.</p>\n<p>Hinata can actually feel when Kageyama twitches inside him, and he moans again. That really shouldn't be as hot as it is, but he's beyond caring at this point. Kageyama's hips are starting to move erratically, and Hinata pushes back against him in time with the movements, and suddenly Kageyama's gripping his hips even tighter and making a noise and he hits that spot one more time; Hinata howls against his neck as Kageyama's hand sneaks down to wrap around his very, very aching dick, and then it's over, he's coming all over his stomach and Kageyama's hand and he doesn't even care because he feels amazing and his head is swimming and he feels completely full of Kageyama.</p>\n<p>He's vaguely aware of Kageyama's hand bringing him through it, firm but gentle, and when it's over, he feels like jelly. There's a hand brushing his hair away from his forehead, where it's slick with sweat. He closes his eyes and leans into it as he feels Kageyama pull out and there's a sudden weird emptiness. Hinata hadn't even realized Kageyama had finished.</p>\n<p>Hinata opens his eyes (when had he closed them?) to see Kageyama staring down at him, and he grins sheepishly because he thinks he must look like a mess. Kageyama sort of does, too, which is reassuring. His hair is stuck to his face, and he's sweaty and gross. Hinata really wants to kiss him.</p>\n<p>Before he can, Kageyama is grabbing a tissue and wiping the mess from Hinata's stomach.</p>\n<p>“I can do that,” says Hinata, but Kageyama shoves away his reaching hand and finishes cleaning him up. He's then taking the condom off and tying it up with a grossed-out look on his face, and Hinata laughs.</p>\n<p>“Don't laugh at me, stupid, I'm not the one who looks like he just crawled out of a gutter in the middle of a torado.” Kageyama flicks him on the nose, but he doesn't even sound as grumpy as usual. Maybe a little tired, like Hinata feels. Hinata just keeps grinning.</p>\n<p>“That was almost as good as volleyball,” he says. It's true. It was almost as good. “Even if you suck, you ended up not being that bad.”</p>\n<p>“What a compliment.” Kageyama shoves his side and Hinata scoots over so Kageyama can flop down next to him, graciously not crashing down on top of Hinata like Hinata would have definitely done to him. He closes his eyes.</p>\n<p>Hinata allows himself to study Kageyama's face; it's still flushed, but he looks content for maybe the first time in his life. He also looks like he's about to fall asleep, and Hinata pouts.</p>\n<p>“You can't sleep now, Kageyama.” He feels exhausted, yeah, but also weirdly energetic. It's like he just ran a marathon. “Pillow talk.”</p>\n<p>“What?”</p>\n<p>“Pillow talk,” he repeats, as if Kageyama should know what he's talking about. “I'm pretty sure that's what happens after this. Also, we should probably get dressed in case your mom comes home.”</p>\n<p>“I don't want to.” Kageyama's voice has that tone he gets when he's decided to be stubborn, and Hinata sighs and stares at the ceiling. He feels warm and soft and there's a nice heat next to him from Kageyama's body, and even though he doesn't want to yet, Hinata can feel himself starting to drift. He shifts so that his head fits comfortably in the space between Kageyama's neck and shoulder, and Kageyama doesn't move away; either he's asleep, or he's pretending to be. Hinata doesn't care either way.</p>\n<p>He wakes up to morning light streaming through the window. He's very warm; at some point in the night the covers had been thrown over him. There's a warm pressure against his side, and he tries to turn before he notices there's also an arm draped over his waist. His very naked waist. Hinata can feel his face heating up at this weird position; Kageyama's chin is pressed to the top of his head and he's snoring, a little. Their legs are tangled together because Hinata is a horribly messy sleeper.</p>\n<p>Hinata guesses it's okay as long as Kageyama is still asleep. He feels really cozy, anyway, so he attempts to roll over and get more comfortable, and he also secretly wants to observe Kageyama sleeping.</p>\n<p>He always likes watching Kageyama sleep, which sounds kind of creepy, but he assures himself is completely natural because it's the only time Kageyama's face muscles allow themselves to relax. It is sort of like seeing a rare animal in its natural habitat; Kageyama's brow is unfurrowed and his mouth is relaxed, even if it's opened a little and there's some drool at the corner. Hinata thinks it's kind of cute anyway. He reaches up and wipes the drool away with his thumb. Kageyama stirs, and Hinata freezes because this could end badly, but the taller boy is just repositioning himself, nuzzling his cheek into Hinata's palm and yeah, that is pretty cute. Kageyama has the potential to be cute if his personality wasn't always ruining it.</p>\n<p>Hinata feels his eyes start to grow heavy again, and before he knows it he's drifted back to sleep because he's warm and Kageyama feels nice next to him. The next time he wakes up, it's to gentle fingers against his face. He pretends to still be asleep and leans into them as they trace along his nose and his jaw.</p>\n<p>They're gone almost as soon as he notices them, and the weight next to him lessens. He hears Kageyama padding across the floor; he really wants to just jump up and drag him back to bed, but he's pretending to be asleep. He can hear Kageyama leave the room and then there's water running, so Hinata decides to just get up and survey the damage.</p>\n<p>When he slips the sheets off him, he finds that he looks the same; nothing has magically changed because he had sex, but he can definitely feel it in his lower regions. He feels stiff and sore but it's sort of like when he practices really hard, and he's always kind of liked that feeling. There are bruises on his hips, as he'd suspected, and he touches them gingerly with his fingers. Another reminder. He smiles to himself.</p>\n<p>Hinata isn't sure if he should get dressed or what, but he sort of forgot to bring a change of clothes so he just pulls the blankets back around himself and waits for Kageyama to finish cleaning up. He feels pretty gross and sweaty himself.</p>\n<p>When Kageyama enters the room again, clean and dripping with a towel draped over his head, they stare at each other. Hinata wonders if something is supposed to feel different, because he feels the same as he always does, but there's a warmth in his chest when he thinks about how Kageyama looked at him the night before and he grins and waves. Kageyama rolls his eyes and throws the towel at Hinata's face.</p>\n<p>“Go get cleaned up,” he says, “You look like trash.”</p>\n<p>Hinata moves to get out of bed, but the second his feet hit the floor he knows it's a bad idea because he is seriously, seriously sore. He reaches out to grab onto something, and he's suddenly steadied by Kageyama who definitely wasn't there a second ago. He looks worried, guilty, and mad all at the same time.</p>\n<p>“I'm okay!” Hinata says quickly. “My butt just kind of hurts. That's your fault so you'd better take responsibility.”</p>\n<p>Kageyama's face is flushing and he's punching Hinata in the shoulder. Hinata laughs because that's more like it, and then Kageyama helps him limp out to the bathroom to clean up. The hot water feels so nice as he washes away the sweat and whatever else was on him. Kageyama was right about him looking like trash, with his hair sticking up even worse than usual.</p>\n<p>The rest of the morning passes uneventfully. Kageyama lends Hinata some clothes to wear, which are too big, but they smell like Kageyama so Hinata doesn't complain. He meets Kageyama's mother, who hasn't left for work yet, and is grateful when she doesn't question the fact that there's a small boy with messy hair wearing her son's old clothes. He does his best to walk normally around her, because the thought of Kageyama's mother finding out horrifies him.</p>\n<p>Kageyama actually walks him home that evening, after they've watched a few volleyball games Kageyama has recorded. Hinata definitely does not ride his bike; he doesn't think his ass can handle that yet, so Kageyama offers to wheel it for him. It's kind of weird, Kageyama being actually nice like this, but then he'll do something like he's trying to make up for being nice (he shoves Hinata three times on the way home) and it's relieving, to be honest.</p>\n<p>Everything is the same as it was before they did this, it's not a big deal at all like Hinata had secretly been worrying about. Kageyama says goodbye to him at his house, and Hinata watches him walk home. He has a sort of empty feeling in his stomach, like Kageyama has left too soon, which is ridiculous because he'll see him tomorrow morning.</p>\n<p>He'll see him tomorrow morning, and everything will be like it always is.</p>\n<p>Everything is not like it always is.</p>\n<p>Monday morning starts out fine enough; Hinata can still kind of feel it, but he's good enough to play normally. Kageyama is kind of off, though; he's throwing tosses that Hinata knows he doesn't have a chance of hitting, and when he says as much, Kageyama snaps at him like he's in a bad mood.</p>\n<p>They meet for lunch, like usual, but Kageyama won't sit as close as he usually does, and when Hinata leans over his shoulder to look at a magazine Kageyama's reading, he flinches and shoves Hinata away. Hinata's left staring at him, but Kageyama ignores it and just goes back to reading his magazine.</p>\n<p>By afternoon practice, Hinata definitely can tell something's wrong, because Kageyama's only answering him in short, terse answers, and every time Hinata starts to bicker with him, he says something really, really mean. (Maybe you could hit these if you weren't so damn short. Pay attention for once in your life, dumbass. It's impossible to play with you.) Hinata ends up storming off the court, and he can feel angry tears in his eyes and he hates it because it's not supposed to be like this, Kageyama isn't usually actually mean.</p>\n<p>He sits the rest of practice out, which he hates because he really wants to play, but he's not feeling it at all anymore. Daichi even comes over to him and puts a comforting hand on his shoulder, saying something about how Kageyama's having an off day and not to take it personally. He can't help but take it personally, though, because Kageyama's acting fine to everyone but him. He tries to remember if he's done something to make the taller boy mad, but no matter how many times he goes over the day, he can't come up with anything.</p>\n<p>Kageyama doesn't even wait for him after practice, he's silent when he changes and everyone in the room can sense that something's wrong between them. Nishinoya and Tanaka are particularly boisterous as they try to cheer Hinata up, but it's not working. He needs to talk to Kageyama.</p>\n<p>As soon as he sees Kageyama leave the room, Hinata's rushing out a 'goodbye', grabbing his stuff, and hurrying after. Kageyama's already by the gate and he looks like he's walking as fast as he can without being obvious about it, so Hinata breaks into a run.</p>\n<p>“Kageyama!” Hinata yells after him. “Wait, you jackass! Stop avoiding me!”</p>\n<p>Kageyama flinches but keeps walking. He doesn't even look over his shoulder, and for some reason that small detail just sends Hinata into a fit, he's putting his full speed into his legs despite lingering soreness and he can see Kageyama breaking into a run in front of him, but he's definitely not going to be avoided anymore. He hates it. He hates Kageyama being for real mad at him.</p>\n<p>He chases Kageyama through the gate, past the school grounds, and halfway to his house before he finally catches up with a final burst of speed, launching himself at the taller boy and tackling him to the ground. Kageyama ends up on his stomach with Hinata on his back, and they're both breathing hard.</p>\n<p>It's Hinata who speaks first. “What the fuck, Kageyama, you've been a huge jerk all day, you owe me an explanation! What did I do?!”</p>\n<p>Kageyama just stays silent with his face pressed into the dirt like he has completely given up and if he lies there long enough, his problem will go away. Hinata's not about to leave it like this, though, and he punches Kageyama in the shoulder.</p>\n<p>“If you don't tell me what you're mad about, I'm not going to get up! I can sit here all night, just watch me.”</p>\n<p>Finally, Kageyama rolls himself over, upsetting Hinata in the process, who falls back onto his butt in the dirt. He sits there and stares at Hinata, but it's not his usual petulant glare; he looks cold and closed off and Hinata doesn't like it at all, he doesn't want Kageyama to look at him like this.</p>\n<p>“I want you to just leave me alone,” Kageyama says, and Hinata's heart drops. “I'm tired of playing this stupid game with you, you win.”</p>\n<p>Hinata gapes for a minute, trying to remember what he's talking about. “What game?”</p>\n<p>Kageyama's face twists with something unrecognizable. “Touching. Kissing. I'm done with it. You win, I'm sick of doing this.”</p>\n<p>“Is this...because of what we did on Saturday?” Hinata's finally realizing what Kageyama is talking about, now, and he feels like throwing up because this isn't supposed to be happening. “Are you mad at me for that? I'm sorry, I thought-”</p>\n<p>“Yes, I'm mad at you, stupid!” snaps Kageyama, glaring. “Why did you let it go that far? Are you really that dumb that you'd let someone fuck you just for a stupid competition? You're so stupid that you don't even realize what a big deal that is, this whole thing is and you've just been going through this because of your shitty fucking competitive personality.”</p>\n<p>Hinata feels like he's been slapped. He thought Kageyama had been okay with this; he'd initiated a bunch of it himself, hadn't he? He stares at Kageyama, whose breathing is even harder now like he's running a marathon instead of yelling.</p>\n<p>“If it really disgusted you that much you should have just said so!” Hinata spits out, and he can feel angry tears gathering in the corners of his eyes and he hates it, he hates Kageyama for being such a dumb jerk and leading him on like this.</p>\n<p>“I wasn't disgusted!” Kageyama's reeling forward and shoving at Hinata, who really actually starts crying. “I don't know why you aren't disgusted! Do you even have any realization of what you're doing?!”</p>\n<p>“Yes!” Hinata's hiccuping now. “I'm doing stuff with you because it feels good and I like it and I don't even care about that stupid competition!” It's pouring out of him now that he's this upset; he's just talking without thinking, like he's throwing up everything he's been feeling. “You acted like you liked it and it's not fair that you're acting like this when you should have just told me you didn't want to!”</p>\n<p>Kageyama's gaping, now, and he finally doesn't look enraged. “Hey, stop crying, I-”</p>\n<p>“You're such a stupid jerk!” Hinata doesn't have anything to throw, so he halfheartedly tosses a handful of dirt in Kageyama's direction. “I was happy that you wanted to do that stuff with me, even if it was your stupid competitiveness and I thought you liked it! You can't be mad at me because you were doing it too!”</p>\n<p>He goes to throw another handful of dirt, but someone's gripping his wrists and he feels himself being pulled forward and his face is smashed into Kageyama's shoulder. He's a little stunned, but that only lasts a minute before he's twisting his fingers in Kageyama's jacket and sobbing against his shoulder because of how mad and upset and embarrassed he is, and he really, really hates Kageyama.</p>\n<p>“I'm sorry, stop crying,” Kageyama's grumbling, but he sounds genuine. “You're going to get snot all over my jacket.”</p>\n<p>“You're the one who shoved my face into it.” Hinata sniffles, but he can feel himself starting to calm down.</p>\n<p>When he finally calms down enough, he pushes away from Kageyama and wipes his face with his sleeve. Kageyama is watching him, and he glares back, fighting embarrassment over having just bawled his eyes out.</p>\n<p>“If this is because we had...did that, then just say so and I won't do it ever again.” Hinata stares at Kageyama, hard, who finally looks away. “You're the one who is stupid for letting it go that far.”</p>\n<p>Kageyama's eyes whip back to Hinata's. “You don't understand.”</p>\n<p>“What don't I understand?” Hinata knows his voice is rising again, and he sounds kind of shrill, but he doesn't care. “Tell me! You don't tell me anything, you asshole!”</p>\n<p>“I like you!” Kageyama's spitting out, and Hinata's rant dies on his tongue as he stares at Kageyama's reddening face. “I like you. I want to do all that shit with you. I took advantage of you and that's why I don't want to do it anymore.”</p>\n<p>Kageyama likes him. He likes him enough to want to kiss him and touch him and have real, genuine sex with him and not because of a competition. Hinata feels his own face heating up at the realization.</p>\n<p>For his part, Kageyama looks like he's deflating. He doesn't look mad anymore, just ashamed and resigned. “I liked you before this started, and I thought it would be okay because you wanted to go with it, so I wasn't doing anything wrong. I thought...it would be the only way I'd get to do that stuff with you. So just, that's why I don't want to do it anymore, and I get it if you hate me or something. It's my fault.”</p>\n<p>Suddenly, Hinata's launching himself forward without even thinking about it, and he tackles Kageyama to the ground for the second time that day. He shoves Kageyama's shoulders into the dirt.</p>\n<p>“I can't believe you think I'm stupid enough to go along with stuff just because of a competition,” he says, glaring, but he doesn't feel so upset anymore. There's something really warm and excited bubbling up in his chest, and he has to push himself not to smile because he's still supposed to be mad at Kageyama for being such a jerk. “I mean, I did, but...I wanted to do it. I like kissing you. I like when you touch me.” He flushes. “It feels good and I don't want anyone else to do it, just you.”</p>\n<p>“That's not something friends just do with each other, idiot,” Kageyama says, but his voice is weak. “I don't want-”</p>\n<p>“Yes you do! You just told me you liked it!” Hinata shoves at his shoulders again. “I don't care if it's not something that friends do, you're not a friend! You're...you're Kageyama,” he says, and he can feel his voice faltering, because that's the only word he has for it. Kageyama is Kageyama. He's different, he's someone Hinata trusts wholly and wants to do everything with. “I wouldn't do this with anyone else. I don't want to think about doing it with anyone else. I don't want you to do it with anyone else, either.”</p>\n<p>Kageyama's face is completely red, his eyes are wide, and right now Hinata really wants to kiss him, so he does. It's very hesitant and quick but it's a kiss, a real kiss, and he doesn't know why he hadn't realized what that means to him earlier. He wants to kiss Kageyama all the time.</p>\n<p>“Ususally people confess before they have sex with someone,” Kageyama says when Hinata pulls back.</p>\n<p>“Yeah, I could say the same thing to you.” Hinata sticks his tongue out, feeling like a huge weight has been taken off his shoulders. He can taste salt on his lips from his embarrassing display earlier. “You're such a baby that you let it get this far before you even told me you like me.”</p>\n<p>Kageyama looks away. “I said I'm sorry.”</p>\n<p>That's not right, though, because they're both on the same page here finally. Kageyama's not supposed to be apologizing anymore, even if he was a huge dick about this whole thing and if he'd just said what he was feeling, none of this would have happened. Like usual. If he'd just told Hinata he liked him, then Hinata could have said he likes him too.</p>\n<p>And that's when Hinata realizes. He likes Kageyama. He like likes Kageyama. He feels like the bottom of his stomach is dropping out and filling up with bubbles at the same time, and his cheeks are going red, he's sure, so he throws himself back at Kageyama and shoves his face in the crook of his neck. Kageyama was the dumb one, but maybe Hinata was being kind of a little dumb about this, too.</p>\n<p>Kageyama's hands go to his back, uncertainly, like he isn't sure how to react to this situation and doesn't know if Hinata is upset or okay or what. Hinata doesn't really want to get up, so they just lie there, in the middle of the dirt. A few people pass by but Hinata still doesn't move because this is the way he wants things to be, the way he has wanted them to be for a while now.</p>\n<p>Finally Kageyama's forcing him to sit up and patting the dust off his shoulders. “Come on, people are going to call the cops on us,” he says, and Hinata reluctantly removes himself so they can both stand up. Now that it's done, he's feeling kind of shy, because he's never had to learn how to act around someone who likes him, and who he apparently likes back.</p>\n<p>They stand there in silence for a moment, before Kageyama asks if Hinata wants to come over and Hinata's nodding before he realizes he is. The set off in more silence, and Hinata still doesn't like the awkwardness between them so he reaches out stiffly and grabs Kageyama's hand. It's warm, and Kageyama doesn't move away, and Hinata feels his shoulders relaxing. They probably look like an absolute mess but at this point, he doesn't care. He feels hot and all he can focus on is Kageyama's hand in his, and the face that Kageyama's said he wants to touch him, and kiss him, and everything else flit through his mind and he's walking faster because he knows exactly what he wants to do now. He's going to make up for making Kageyama feel guilty about having sex with him.</p>\n<p>When they reach Kageyama's house, Hinata impatiently waits for him to let them in, and then he's pushing the taller boy through the doorway and they're crashing onto the floor as Hinata crushes his lips against Kageyama's. They've done this before, but this time it feels different. Kageyama likes him. </p>\n<p>“What the fuck, Hinata-” Kageyama's trying to speak, but Hinata keeps pressing their lips together over and over and Kageyama's really trying to reach the door, to at least close it. He finally has to push Hinata off him. “At least take your shoes off.” His voice is gruff, like he's embarrassed, and Hinata's never realized how endearing that actually is.</p>\n<p>Hinata's scurrying to pull off his shoes and then he's trying to take Kageyama's off for him, because he's going way too slow, like he still can't believe what's going on. Somehow they end up off, and Hinata's dragging him to his room and ushering him inside and barely has time to shut the door before he's, once again, tackling Kageyama (he seems to be doing a lot of that today) and they're falling onto the bed and one of them starts up the kissing once more, though neither of them is quite sure who. (Later, they'll blame each other, but Hinata's confident all of this is his fault.)</p>\n<p>“Kageyama,” Hinata finally says, breathless, when they break away. “I want to do it again.”</p>\n<p>“Do--are you serious?” Kageyama's frowning at him, like he's still unsure what's going on. “We don't have to-”</p>\n<p>“I want to!” Hinata tugs at Kageyama's pants; he can see Kageyama's starting to feel it. “We did it last time but I didn't know...you know...I just want to do it again.” Kageyama still looks reluctant, so Hinata adds “please” which he knows Kageyama can't resist.</p>\n<p>With a groan, Kageyama finally relents, and pushes Hinata off him so he can get the stuff they need. Hinata doesn't even know if he has any more condoms, but then Kageyama's pulling off his back and reaching in; he comes out with at least five more condoms. Hinata gives him a look, and he flushes.</p>\n<p>“I told you, Suga gave these to me,” he grumbles, looking away.</p>\n<p>Frankly, Hinata doesn't care where he got them, because he's feeling hot and giddy and excited and really just wants to take his clothes off, so he does. He's shrugging out of his shirt by the time Kageyama finally stops staring at him.</p>\n<p>“Take yours off too,” Hinata says, puffing his cheeks. “It's not fair if I'm the only one doing this, I feel dumb.”</p>\n<p>“You are dumb,” Kageyama retorts, but he's tossing his dirty jacket on the floor and taking off his shirt, and Hinata jumps up and goes for his pants at the same time. Kageyama ends up on the floor on his butt with Hinata in his lap, still working at the zipper. He doesn't know what kind of face he's making but his tongue is poking out of the corner of his mouth when Kageyama grabs his face and kisses him; his hands falter on the zipper and suddenly he's on his back on the floor, staring up into Kageyama's flushed face.</p>\n<p>“I like you,” Kageyama says again, looking determined, and he reaches down to palm Hinata through his pants. Hinata pushes his hips up into the friction, and while they've been doing this for weeks and weeks now, it's different because they're doing it with a completely different purpose. Or rather, Hinata's finally realized the purpose that's been hiding behind it the whole time.</p>\n<p>He jerks when he feels Kageyama's warm hand slide beneath his pants, onto his skin and around his cock and it's definitely starting to feel good, but this time it might feel even better than usual. Hinata closes his eyes and focuses on the feeling; Kageyama strokes him a little before he removes his hand and Hinata whines at the loss of contact. It's not for long, though, because Kageyama's finally tugging his zipper down and Hinata lifts his hips up to help struggle out of his slacks.</p>\n<p>When they're off, he grabs at Kageyama's. They tumble over again and Hinata ends up on top, thigh pressing against the hard bulge in Kageyama's pants as he goes for the zipper with his hands. Kageyama's pressing his head back against the floor and closing his eyes; he looks kind of lost, so Hinata leans down and kisses him again. He can't stop grinning when he pulls back, because Kageyama looks so petulant about being pinned against the floor with Hinata grinding into his crotch.</p>\n<p>“Take the fucking pants off or let me do it,” snaps Kageyama, eyes still closed. Hinata compliantly shimmies back enough to slide Kageyama's pants with him, and they're both naked on the floor and staring at each other.</p>\n<p>“Let me to it for you this time,” Hinata says, finally, trying to sound confident although he knows his cheeks are tellingly red. Kageyama opens his mouth to protest, but Hinata just pushes him back down and reaches into Kageyama's discarded bag. He feels around a little until he finds one out of several tubes of lubricant (his face gets warmer, what was Suga thinking was going on?)</p>\n<p>Kageyama watches as Hinata coats his fingers and then realization crosses his face when the shorter boy reaches behind him and grimaces as he slips a finger into himself. Kageyama looks like he's going to say something, but Hinata just glares at him.</p>\n<p>“Don't you dare say anything or I'll crush your dick,” he says. Truthfully, he likes the feeling of Kageyama's fingers better, but he wants to do this himself. He wants to impress Kageyama.</p>\n<p>While he works, a question crosses his mind, and he decides to ask it. “Kageyama, do you like boys?”</p>\n<p>Kageyama stares at him like he's grown two heads. “What do you think, dumbass?”</p>\n<p>“That's not what I mean!” Hinata adds another finger and bites his lip. “Like, have you liked girls before?”</p>\n<p>He's silent long enough that Hinata thinks maybe Kageyama won't answer, but he does, shrugging. “I don't know. I've never really liked anyone before.”</p>\n<p>For some reason, that makes Hinata falter with unexpected shyness. He's Kageyama's first crush. And then he realizes that Kageyama is probably his, too.</p>\n<p>He nods. “I guess I'm the same.”</p>\n<p>“You always talk about how cute girls are,” says Kageyama, and he sounds a little uncertain and Hinata doesn't like that. How long had Kageyama been worrying about this?</p>\n<p>“Girls are cute, but I don't want to kiss any of them.” Like you, he doesn't say, but he knows Kageyama gets it. “Plus you're kind of cute, I guess, when your face isn't messing it up.”</p>\n<p>Kageyama is bristling and on the verge of arguing so Hinata takes his free hand and grips his cock, firm, and Kageyama's voice dies in his throat. This is a pretty useful thing he's discovered. He's going to have to utilize it more.</p>\n<p>When he adds a third finger, he can feel himself getting excited. He feels really dirty, doing this right in front of Kageyama, but it just makes him more worked up and he grins at the boy beneath him. Kageyama's face is slack, watching him; one of the rare times he isn't glaring and is just observing. He looks really intent, like he's trying to figure out what Hinata does for himself so he can do it next time, and the thought of a next time makes Hinata even warmer. They can do this whenever they want, now.</p>\n<p>Suddenly, Kageyama looks away. “You look good.”</p>\n<p>Hinata's heart jumps like it does whenever Kageyama compliments him. For some reason, that compliment makes him feel shy and he wants to cover himself up, but Kageyama's looking at him again and he pushes through it. He can do this, he's done it before.</p>\n<p>He withdraws his fingers and holds his hand out for one of the foil packets scattered around Kageyama. Kageyama grabs one and pushes Hinata's arms away as he opens it and rolls it onto himself, biting his lip. He's harder than he was before, and he hadn't even been touching himself; Hinata colors with the idea that maybe Kageyama became like that just by watching him. Maybe he's being a little self-centered, but it's a nice thought. His whole body feels warm.</p>\n<p>“Hey, Kageyama,” he says, pausing. “You knew how to do all this stuff even before we did it, right?”</p>\n<p>Kageyama's nodding, so he continues.</p>\n<p>“Does that mean...you thought about doing this stuff before?” It feels kind of like an invasive question, but he really wants to know.</p>\n<p>Kageyama's got a weird look on his face and he's about to turn it away, so Hinata puts one hand on his cheek. “Come on, I don't care, I just want to know.”</p>\n<p>The nod is almost imperceptible. “It's not like I was planning on it, I just...wanted to know, in case.” He looks like he's feeling guilty again so Hinata pounces forward and hugs him; Kageyama jumps as his dick gets sandwiched between them.</p>\n<p>“Watch it, dumbass!” he groans, but he doesn't push Hinata away.</p>\n<p>“Okay, okay.” Hinata leans back and looks down at Kageyama's dick in between them. That is going to go in him, again, and he's going to do it on his own. He's read a little about this, honestly, but only because he wanted to be extra sure about all situations.</p>\n<p>He shuffles forward, thighs on either side of Kageyama's hips, hands braced against his chest. Kageyama, for his part, is looking a little nervous, like he thinks Hinata's going to crush his dick or hurt himself or both.</p>\n<p>Hinata reaches behind him and grips Kageyama's dick in his hand. It's warm and he feels it twitch and he's starting to feel impatient, remembering how it was last time. Slowly, really slowly, he guides it into himself. It's tight, and uncomfortable, so he pauses every few seconds to let himself adjust, but he's doing it and he feels a spike of pride at Kageyama's expression.</p>\n<p>“Kageyama, you're going to let me be on top next time, right?” he grunts out to distract himself. Kageyama snorts.</p>\n<p>“It seems like you enjoy this a lot, so I don't know,” he says, and Hinata sputters, embarrassed. It's not that he enjoys it particularly, but it does feel good, so what? He says as much, and Kageyama just gives him a look that says he's being teased.</p>\n<p>With that, Hinata takes a deep breath and then sinks down the rest of the way, gritting his teeth, and it's completely in and he can feel it. He steadies himself against Kageyama's chest; Kageyama's hands have gone to his hips to keep him upright, and his fingers brush over the bruises from yesterday. Kageyama watches him and then presses down, and Hinata's breath hitches. It feels good.</p>\n<p>Hinata gives himself another minute before he lifts himself up again, and it still feels weird, but he's getting used to it. He sinks back down and it's definitely more pleasant than a minute ago, and he can tell Kageyama's feeling it too because his hands tighten on Hinata's hips and his breath catches.</p>\n<p>Satisfaction wells up in Hinata's chest, and he does it again, faster, more confident; he watches as Kageyama's hands slide down to his thighs where the muscles are bunching and he shudders. Kageyama's hands feel so good on him, all the time but especially right now, and he can feel himself starting to lose focus. It gets worse when Kageyama's hands move back to his hips and he's suddenly gripping hard, bringing Hinata back down onto himself and his hips jerk and Hinata can feel it deep, really deep, grazing the spot that makes him throw his head back and groan out Kageyama's name.</p>\n<p>This angle is weird, but Hinata feels a little more in control than last time and Kageyama's going in so deep that it's hard to catch his breath. They're moving together, and his nails are pressing crescents into Kageyama's chest, and he can feel his dick bouncing against his stomach until Kageyama's hand goes down to stroke it and he's moaning, loud. He feels pent up and his nerves are on fire and he can feel everywhere that Kageyama is touching him, this is even better than last time and he wants to keep doing this, every day, until they're so good that they're both breathless.</p>\n<p>“Kageyama,” Hinata hears himself saying, barely registering what he's doing. “Say Shouyou.”</p>\n<p>Kageyama stills and Hinata's gaze is drawn down to him, and he's starting to feel embarrassed. He's about to take it back when Kageyama looks up at him thoughtfully.</p>\n<p>“Shou-chan.”</p>\n<p>“No!” Hinata yelps. “That's so embarrassing! Shouyou!”</p>\n<p>Kageyama rolls his eyes but Hinata can see the faint signs of a smile, and then he says “Shouyou” and Hinata's heart warms up and he sinks back down, hard, and this time Kageyama moans. Hinata eats it up and stores it away to think about later, but right now he's hot and all he wants is that feeling of going over the edge and to hear Kageyama say his name again.</p>\n<p>When he does, breathing it out, “Shouyou”, Hinata comes, with Kageyama's hand stroking him. He actually comes, all over his stomach and a little gets on Kageyama and he feels absolutely, wonderfully satisfied. He lets Kageyama grip his hips and keep moving, thrusting up into him until Kageyama's hips are jerking and he's twitching inside and then he's coming, too, with a groan.</p>\n<p>As soon as Kageyama lets go, Hinata falls forward onto him. Kageyama slides out with a gross noise but Hinata doesn't care because he feels like he's just won nationals. Kageyama grunts at the weight, but doesn't push him off. His hands slide down Hinata's back to his thighs, and he rubs circles on them; Hinata wonders how he knows they felt kind of strained with the exertion, but Kageyama's always able to tell when something's up. It's another thing that makes it feel perfect when they're around each other.</p>\n<p>“That was good, right?” Hinata finally says when he catches his breath.</p>\n<p>“It wasn't bad,” Kageyama says, and Hinata blows a raspberry against his shoulder in retalliation. “Get up, this floor is going to give me bruises.”</p>\n<p>Hinata really, really doesn't want to get up, but he lets himself be rolled onto the floor and hauled to the bed. Kageyama slides the condom off and tosses it into the trash by his bed; Hinata holds out his arms, and Kageyama comes crashing down on top of him. He graciously doesn't complain.</p>\n<p>They end up falling asleep like that, and when Hinata wakes it's almost 11 pm and he's panicking about getting home. Kageyama tells him to stay the night, sounding groggy and muffled with his face pressed into Hinata's side. Hinata ends up calling his mom and telling her he's staying over at Kageyama's, for homework or something, and then he lets himself be pulled back down and wrapped up and he falls back asleep almost immediately. He thinks maybe this is what he's wanted it to be like all along, warm and easy and with Kageyama breathing softly next to him.</p>\n<p>The next morning they have to scramble to get dressed and ready for school, after cleaning each other up enough so that they looked decent (Hinata's hair is a bit hard to manage, but they don't think anyone will notice). They arrive to practice barely on time, breathing hard, and hustle into the club room to get changed.</p>\n<p>Kageyama's the first to notice everyone staring at them, because he alerts Hinata with a gentle nudge to his side. Hinata glances back and yeah, Sugawara is beaming and Nishinoya and Tanaka are looking at him with what appears to be respect. Hinata looks at himself; surely they can't tell, right?</p>\n<p>His face heats up as soon as he spots the bruises, perfectly suited to Kageyama's hands, and he's struggling to get into his shirt as soon as possible. Kageyama seems resigned to it, because he's going at the pace he usually does, ignoring everyone's stares. Hinata wishes he could be that unruffled, sometimes, but then he remembers last night and yeah, Kageyama isn't always totally unphased.</p>\n<p>Before they head out to the court, Hinata feels a hand clap on his shoulder, and turns around to see Sugawara grinning at them. “Congratulations!” he says, and he's patting Kageyama on the shoulder as well, who bows.</p>\n<p>Hinata doesn't know what's going on but he bows too, as Kageyama belts out a “thank you”. When they straighten up Suga is jauntily walking to the door, like he's just accomplished some great feat, and Hinata thinks that maybe, without their knowing, he has.</p>\n<p>He'll have to maybe thank Suga better later, but for now he just grabs Kageyama's hand and drags him onto the court. It's just like always, he thinks, only better, as Kageyama's fingers fit just right between his own.</p>\n<p>He thinks maybe he's okay with Kageyama winning this competition. They'll just have to see.</p>"
}