{
  "id": "23320117",
  "url": "https://archiveofourown.org/works/23320117?view_full_work=true",
  "author": [
    "snowdarkred"
  ],
  "title": "a nation, held",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen",
    "Multi"
  ],
  "fandoms": [
    "Avatar: The Last Airbender"
  ],
  "relationships": [],
  "characters": [
    "Ozai (Avatar)",
    "Iroh (Avatar)",
    "Zuko (Avatar)",
    "Azula (Avatar)"
  ],
  "additional_tags": [
    "Politics",
    "Worldbuilding",
    "Fire Nation (Avatar)",
    "Fire Nation Royal Family",
    "Ozai (Avatar) Being a Terrible Parent",
    "a useful tag",
    "Ozai (Avatar) is an Asshole",
    "another useful tag",
    "Nationalism",
    "Imperialism",
    "Propaganda",
    "dealing with all sorts of fire nation issues",
    "POV Outsider"
  ],
  "language": "English",
  "series": "",
  "published": "2020-03-26",
  "completed": null,
  "words": "6,086",
  "chapters": "1/1",
  "comments": "591",
  "kudos": "19,312",
  "bookmarks": "5,319",
  "hits": "111,236",
  "summary": "<p>It doesn’t take long for the rumors to start.</p>\n<p>The Fire Nation prides itself on its civilization. It isn’t like the other, lesser, nations who throw their children away by sending them into war. Those uncultured and unfeeling savages who are destroying their own future faster than the Fire Nation can save them from themselves.</p>\n<p>Every Fire Nation child goes to school. They learn reading and writing, the illustrious history of their country, and what will be expected of them as proper, upstanding Fire Nation citizens. They are to be protected, because children are the future glory of the nation.</p>\n<p>The crown prince is thirteen when his father burns his face in front of an audience of hundreds.</p>",
  "notes": "<p>set between Zuko's ill-fated visit to the war room and his sixteenth birthday.</p>\n<p>thanks to ro for giving this a glance over for me!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>let me tell you, naming forty OCs is a pain in the ass.</p>\n<p>you can come talk ATLA to me on my <a href=\"https://snowdarkred.tumblr.com/\" rel=\"nofollow\">tumblr</a> if you want.</p>",
  "text": "<p>It doesn’t take long for the rumors to start.</p>\n<p>The Fire Nation prides itself on its civilization. It isn’t like the other, lesser, nations who throw their children away by sending them into war. Those uncultured and unfeeling savages who are destroying their own future faster than the Fire Nation can save them from themselves.</p>\n<p>Every Fire Nation child goes to school. They learn reading and writing, the illustrious history of their country, and what will be expected of them as proper, upstanding Fire Nation citizens. They are to be protected, because children are the future glory of the nation.</p>\n<p>The crown prince is thirteen when his father burns his face in front of an audience of hundreds.</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>“Did you hear?”</p>\n<p>“Hear what?”</p>\n<p>“About the prince.”</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>Lord Goro returns quickly to his family’s quarters in the palace. He kisses his son and daughter, both of them his pride and joy, on the cheeks before speaking quietly to his wife.</p>\n<p>It is time, he says to her, for their children to learn more about running the family estate. A partition of their family’s farmland was being converted to a more profitable mining operation, and someone should be there to help guide and witness the process. They should begin immediately, and he can think of no better teacher than their own mother.</p>\n<p>His hands shake as he helps his wife pack, not even calling on their servants to help. He can’t meet his wife’s eyes. She had been Lady Ursa’s friend, long ago. He hadn’t listened to her wisdom when he should have.</p>\n<p>The next day, Lord Goro reports to the Fire Lord that, sadly, his wife and heirs were needed at home to manage the workers and learn how to fulfill what will one day be their responsibilities to their people and the nation.</p>\n<p>Regrettably, they are unavailable to be the young princess’s companions.</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>Sixteen is when a Fire Nation citizen passes from child to adult. It used to be eighteen, but that was a century ago.</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>Lady Naimei makes it to her chambers before she starts crying. Her hand shakes as she writes to her twin sister in the code they had developed as children.</p>\n<p>Even in code, she dare not lay out the exact sequence of events or all she felt having been forced to witness them. But she knows her sister, who is the proud captain of a cruiser-class ship and the cleverest person alive, will read between the lines.</p>\n<p>How could General Iroh have allowed someone like his brother to come to the throne? How could he have stood there and watched and done <em> nothing</em>?</p>\n<p>How could she?</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>Jie has been the Fire Lord’s personal tea server ever since the other servants figured out that her hands don’t shake when she’s scared. She attends him at all his meetings, silent and still. Invisible. She never speaks unless directly commanded to, which is just how he likes it.</p>\n<p>Perhaps that is why the Fire Lord and his council have forgotten that she can speak at all.</p>\n<p>Her young cousin Hina has a boyfriend in the 41st Division. They were sweet together, all shy glances and fierce blushes. That night, Jie whispers to her what the generals said at the meeting before the crown prince objected, and she holds Hina through the night as she cries.</p>\n<p>There’s nothing they can do. In a week, maybe two, they will receive news that he’s fallen in battle, dying nobly in service to their country.</p>\n<p>Jie isn’t a firebender, but the heat of her anger could fuel a thousand fireballs.</p>\n<p>The next day, she serves tea during a tense meeting between the Fire Lord and his brother. The Fire Lord doesn’t once glance in her direction, but the General nods tiredly at her as she places the teacup carefully before him.</p>\n<p>Her hands don’t shake.</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>The Fire Lord’s eyes ought to be warm. He ought to be the light of their people, the hearth fire that wards away the darkest night. The sun that touches their lives, even from afar.</p>\n<p>Fire Lord Ozai’s eyes are as cold as a waterbender’s ice as they glance over the crowd. He doesn’t know how everyone else can’t see it.</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>Politics is a frequent topic at the tea shop, but only after hours. Officially, it is merely a few friends of the owner gathering to play pai sho and talk philosophy, but to talk about philosophy is to talk about life, and to talk about life is to discuss politics.</p>\n<p>Nobu keeps a close ear on the conversation, regardless, because Sota has started bringing his sister’s son to their meetings, and the young man can’t be trusted to take their… discussions in the proper spirit of philosophical debate.</p>\n<p>“The prince is a coward! Everyone is saying so,” Shohei says heatedly. In his three visits to Nobu’s shop he has shown himself to be a hothead, constantly arguing positions he doesn’t really understand. At twenty, Nobu barely considers him a man, and he thinks Sota’s sister must wake up every day grateful that her idiot son was born with a leg too weak for military service. If it weren’t for his lameness, he would no doubt be gladly bearing arms for the glory of the Fire Nation up to his inevitable death.</p>\n<p>“A coward,” Shohei repeats, frowning. He’s no doubt puzzled at the lack of approval from his uncle’s friends.</p>\n<p>“Perhaps the prince will grow out of it by the time he reaches adulthood,” Nobu says mildly. A chilly hush falls over the group. Shohei looks startled, and Nobu can only hope that the boy will start <em> thinking</em>. He can’t possibly live his <em> entire </em> life as blind as a flutter bat.</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>The candles at the temple keep going out.</p>\n<p>“I don’t understand,” Airi complains as she relights them. “I’ve checked three times for a draft, and I can’t find one.”</p>\n<p>She’s been a temple attendant for just a few months, and her duties are still limited to lighting Agni’s candles and reading the driest scrolls she’s ever had to endure. She’s starting to think her mother was right and she should have joined the messenger guild instead.</p>\n<p>“How long has this been happening?” Sage Kazuo asks.</p>\n<p>“A week, I guess—” Airi starts to say. She can remember the first time she came in from the dormitory and found the candles extinguished.</p>\n<p>She stops, though, because a week ago the prince had sailed away in disgrace, with no fanfare or warning.</p>\n<p>As a child, Airi had joined the throngs of people cheering General Iroh, then the crown prince himself, as he departed for his next Earth Kingdom campaign. She remembers how bright and happy everyone had been, how there were vendors selling sweet bean buns and paper dragons for children to play with.</p>\n<p>There hadn’t been anything like that for Prince Zuko. She had heard that he had fallen gravely ill under the weight of his father’s disappointment for his actions — whatever they were; the accounts differed — and that he had to be carried onto the ship.</p>\n<p>The Fire Lord sent him away in the middle of the night, under the moon’s gaze, and now the candles in Agni’s temple die almost as soon as they are lit. Sage Kazuo’s eyes meet hers.</p>\n<p>A bad omen.</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>Koji has been on this tiny ship for a month and he has only seen the disgraced brat a spare handful of times. The bandages look gruesome, to be frank.</p>\n<p>His orders are to report the prince’s movements and who the doddering old general meets with. He dutifully writes every week, addressing the letters to his long dead mother, and sends them with the rest of the mail dump. He knows he can’t be the only crew member instructed to write these reports – General Iroh is too politically important to be left to his own devices, and his moody nephew will hardly slow him down if he decides to show flames and spark rebellion.</p>\n<p>He reports their visits to the Air Temples.</p>\n<p>He doesn’t report that the prince had looked faintly sick while they were there. It was probably the unnatural altitude the airbenders seemed to have preferred, and besides, he looks like that almost every time Koji sees him. Maybe that’s just his face.</p>\n<p>Or, well. What his face is now.</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>The harvest is poor. Villages that relied on farming reap a fraction of their past yields. Villages that used to rely on fishing aren’t catching fish.</p>\n<p>More parents send their teenagers into the arms of the military. The military always finds a way to feed itself.</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>“The Fire Lord is the father of our nation,” Warrant Officer Saifei says eagerly, face alight with the bright flame of her Fire Nation education.</p>\n<p>“Aye, he is our father exactly as he is a father to his children,” Katsu says, droll. A few of the others chuckle darkly. Warrant Officer Saifei nods in agreement, missing his tone entirely. Lieutenant Yimou, meanwhile, flinches.</p>\n<p>Katsu recalls that Lieutenant Yimou used to be stationed at the palace before he put in a request for a transfer. Why anyone would give up a cushy position like that to join a reconnaissance squad in the Earth Kingdom, he has no idea. Katsu will have to speak to him later. Maybe he can find out exactly what put that sour look on the man’s face.</p>\n<p>There are rumors that Katsu is inclined to believe, but stationed so far away from their homeland, it’s hard to know what’s true and what’s an exaggeration.</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>It’s an anonymous pamphlet. There are soldiers in the streets, trying to collect all of the copies that had been rained down on the crowd from balloons. Whoever released the things had been smart; with the crowd as thick and rowdy as it was, no one was able to give a description of who was tossing bundle after bundle of anti-war messages onto Harbor City’s busiest market.</p>\n<p>The soldiers order the civilians to hand them over to the military immediately.</p>\n<p>He does so without argument, when the fresh-faced and stuttering recruit asks him to. The recruit doesn’t notice that he has another tucked into his sleeve. He had skimmed the first few lines and decided to keep one of the pamphlets for himself. Just to see.</p>\n<p>\n<em> Brothers and sisters in fire, why do we have to fight this war? Let the barbarians be barbarians. The threat of the Air Nomad army is a century past, and we are the victors. Why must we throw away our sons and daughters, brothers and sisters, husbands and wives? Agni’s light is ours and ours alone. </em>\n</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>Zuojia’s play isn’t about the Fire Lord, ask anyone. It isn’t even set in the Fire Nation.</p>\n<p>It’s about a powerful Earth Kingdom mob boss who hates his eldest son for being everything he isn’t — honorable, just, and a Fire Nation sympathizer. He stands against his father’s cruel treatment of his suffering mother (a Fire Nation bride, of course, tragically forced into marriage by the mob boss in convoluted circumstances) and is abused for it. In his rage, the Earth Kingdom mob boss uses his earthbending to gravely injure his son. The son bravely and defiantly frees his mother, who runs until she meets a Fire Nation squad. She begs them to help, and they arrive in time to stop the cruel Earth Kingdom criminal from even further injuring his eldest son.</p>\n<p>The earthbender refuses to yield, instead reveling loudly in his right to disfigure his children if he wants to. The noble Fire Nation soldiers arrest him and offer comfort to the mother and child. The play ends on a speech extolling the virtues of the Fire Nation, where children are protected and no man would think to abuse his dependents.</p>\n<p>See? Nothing like the Fire Lord at all.</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>Ken motions for Ryuu to be as quiet as possible. Getting caught is an excellent way to get sent to the front lines. Junko and Kiku had been caught during basic training, and they were assigned to the 41st Division together. Ken had even been happy for them, at the time.</p>\n<p>Look how that had turned out.</p>\n<p>There’s a notice, pinned to the message board they're using to block curious eyes. It proclaims that Prince Zuko, son of Fire Lord Ozai, has been forbidden from stepping foot on Fire Nation land or sailing in Fire Nation waters until his quest is complete. Ken turns and finds Ryuu staring at it with a pensive expression.</p>\n<p>“Thirteen is young to be sent on a mission,” he says.</p>\n<p>Ken sighs. “Well, he’s royal. Maybe he’s one of those prodigies, you know, the ones they have to give things to do so they don’t go around burning the city down out of boredom.”</p>\n<p>Normally that would have gotten at least an eyeroll out of Ryuu, since a mutual friend had tried that excuse on a city watchman after he was caught drunkenly trying to burn down a vegetable cart. The watchman had been unimpressed, as had the merchant who owned the stand.</p>\n<p>“Do you think the Fire Lord banished the prince because—”</p>\n<p>“Maybe,” Ken says. He pulls Ryuu in close and lets himself just feel the weight of him. He doesn’t want to think about it. Ken just wants to live in this stolen moment for as long as they can make it last.</p>\n<p>His little brother, ever the budding historian, had told him once that it used to be legal, before Fire Lord Sozin took the throne. Ken doesn’t know how that can be true. Even if it is, it doesn’t matter now. Even princes aren’t safe.</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>Class lets out, but the argument doesn’t stop just because the bell has rung.</p>\n<p>“I’m telling you, the Ishi Pass Massacre would have been avoided entirely if Princess Aterui had inherited and become the fifth dragon,” Ayai says. Lifen nods in agreement.</p>\n<p>“Grand Prince Resak was a master strategist!” Daiki protests in defense of his favorite historical figure. “There was no way to know that the Tricksters were going to be crazy enough to demolish the pass while their own people were in it.”</p>\n<p>Ayai snorts rudely. “Princess Aterui anticipated it. Professor Sugi found an old lamenting ballad about it a few years ago — Princess Aterui sent her brother three messengers to tell him not to underestimate the Tricksters, and he did it anyway. If she had inherited the way she was supposed to–”</p>\n<p>“Lamenting ballads can’t possibly be used as a reliable source,” Daiki interrupts. “She was a woman; women didn’t inherit back then, period.” Lifen coughs under his breath, naming the second dragon, Grand Princess Eztli. Daiki waves him off with a snappish, “She was her father’s only child.”</p>\n<p>“Princess Aterui was born first,” Ayai says bitingly. “That means Agni shined on her first.”</p>\n<p>“The Fire Sages didn’t proclaim absolute primogeniture to be Agni’s will until a century later,” Daiki says, unwilling to concede. “According to the accepted practice at the time, it was right for Grand Prince Resak to become the fifth dragon.”</p>\n<p>“Fat lot of good it did him,” Lifen says. “He had three big military victories, produced one heir, and then died in a mountain pass at the hands of a bunch of crazy airbenders.”</p>\n<p>“Princess Aterui warned him,” Ayai says smugly, “and what do you know, the one who was born first was right, little brother. As Agni intends.”</p>\n<p>Daiki sticks out his tongue at her like a child.</p>\n<p>There’s a man taking a little too much interest in their discussion as they pass the little huddle of food stalls that cater to the ever hungry students and professors. He makes the hair on the back of Ayai’s neck stand up, and Ayai has to clench her hands around her school books to keep from twisting around to look at him over her shoulder.</p>\n<p>She bites her lip. Professor Sugi is right. Outside the university walls, she really needs to watch what she says. People might take it the wrong way.</p>\n<p>Fire Lord Ozai was born second, after all.</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>“Lord Goro says he disrespected his father.”</p>\n<p>Jirou says the most treasonous thing he has ever dared utter:</p>\n<p>“What is there to respect?”</p>\n<p>Stunned silence blankets the room, and Jirou hunches his shoulders defensively. But he doesn’t take it back or stutter out some excuse to soften his question. They’ve been courting treason with every clandestine meeting. He knows they’ve been suspicious of his hesitancy to speak. But his mother’s health is getting worse, and they still haven’t received his brother’s survivor benefits since the 41st Division was wiped out.</p>\n<p>Why shy away from the truth now? The 41st had been lost entirely, and they hadn’t even <em> won</em>.</p>\n<p>“At least General Iroh had military victories,” he adds at almost a whisper.</p>\n<p>After a long moment, they nod in agreement.</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>Her son is shielded by his own obliviousness.</p>\n<p>‘Innocence and ignorance,’ she reminds herself sternly. He’s a child. He doesn’t know. It’s better that he doesn’t, honestly.</p>\n<p>“When can we go see the play again, Mom?” he asks for the sixth time. “I want to see the Fire Nation soldiers kick butt again! Hi-yah!” He jumps in a circle, executing wild approximations of firebending style that make him look more like a spooked ostrich-horse than a soldier.</p>\n<p>“Maybe some other time,” she says…by which she means never. She hates it. It was a mistake to let him see it with his friend’s family, and an even bigger mistake to let herself be talked into seeing it with him again a month later. She’d sat through all five acts with her hands clenched tightly in her lap.</p>\n<p>Her son saw what the innocent and ignorant were supposed to see.</p>\n<p>He doesn’t know, and she dare not tell him.</p>\n<p>This particular playwright had been a favorite of Lady Ursa, she remembers.</p>\n<p>She hopes no one shows up for the playwright’s head.</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>The longer the man speaks of his methods, the more fixed her mother’s expression becomes.</p>\n<p>“What kind of student was the prince?” Emi interrupts. It’s clear that her parents aren’t going to hire him as a tutor, and she might as well find out while she can. Maybe she can impress Keiko tomorrow and she’ll finally lay off about the egg incident. Emi didn’t <em> mean </em> to ruin Keiko’s hairstyle, and she doesn’t know why it matters that the boy from across the street saw. They’re <em> nine</em>; what do they care about boys?</p>\n<p>The man sniffs scornfully. “He was more of a bookworm than a dragon. Perhaps his father’s lesson will make more of an impact.”</p>\n<p>Her mother likes that answer even less. She smiles primly, which Emi knows means that she’s very, very angry. “They used to say the same of his uncle.”</p>\n<p>Fire Lord Ozai’s brother, the Dragon of the West. <em> Everyone </em> knows who he is.</p>\n<p>“That was a foolish thing to say,” her father says once the tutor has left, jobless and huffy about it.</p>\n<p>“I’d rather burn our house to the ground than hire a man who would treat a student that way to teach our daughter.” Mother says. “Letter of recommendation from the Fire Lord or not. If that’s the man that the Fire Lord had teaching the prince, then I’m not surprised—”</p>\n<p>And then she notices that Emi is still listening and shoos her off to play in her room. She pouts. They never let her listen to anything interesting.</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>Bowen is in the meditation garden when Chouko returns home. He turns to greet her with a smile, but his face falls when he sees the serious expression on her face. She sits beside him with the careful grace that had been trained into her from birth and cradles her forced serenity with both hands.</p>\n<p>“How did your meeting with General Ryota go?” he asks cautiously.</p>\n<p>“We had an unexpected honor,” she says in a mostly even tone. “The Fire Lord himself has taken a personal interest in our services to the military.”</p>\n<p>Bowen blinks. “I thought…. The Fire Lord usually delegates such matters to his generals and admirals.”</p>\n<p>“Yes,” Chouko says. “I had always thought that to be a very wise decision on his part.” She pauses. “Considering his lack of experience in these matters. But he wanted to extend his offer to us personally.”</p>\n<p>“A new supply contract?” he asks in surprise. The meeting with General Ryota had been about the difficulty obtaining raw materials their own suppliers were experiencing, since a disease damaged the silkworm production and cotton bales in the Earth Kingdom were being confiscated by the Earth King’s armies before they could be sold to the enemy. A new contract was a surprise indeed.</p>\n<p>“He wishes us to provide the Navy uniforms in addition to our current commitments,” Chouko tells him. She can’t help but clench her fists at the memory of the Fire Lord’s condescension.</p>\n<p>“That’s a lot of fabric to obtain,” Bowen says absently, his mind already turning over the logistics of such an endeavor. “What were the terms of the contract? How much per uniform is the military even able to pay, considering–”</p>\n<p>“There was no payment offered.”</p>\n<p>Her husband gasps, outrage jarring him out of his planning.</p>\n<p>“No payment—”</p>\n<p>“A gesture,” Chouko sneers, “of our eternal loyalty to Fire Lord Ozai.”</p>\n<p>Bowen swallows harshly. “That— We can’t— No one can afford that. We’ll be ruined. How will we pay our workers, how will we buy materials, how will we survive? We’ll be <em> ruined.</em>”</p>\n<p>“You think he cares? He doesn’t even care about—”</p>\n<p>Bowen puts his hand on her shoulder and she falls silent. Their servants are an ever-watching, ever-listening presence, and they would be fools not to assume at least one of them will recount this conversation to a paying ear.</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>“The princess is very like her father.”</p>\n<p>His audience winces. “I see.”</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>“Master Kancho!” Dawei bursts through the door without bothering to knock. It’s only years of experience that keep Kancho from spilling his inkwell across the letter he’s composing.</p>\n<p>“What?” Kancho barks as the youth tries to catch his breath. Young idiot, running about and drawing attention to whatever he’s panicking about. He needs more training; they can’t keep rushing agents into the field if this is the result.</p>\n<p>“The playwright Zuojia has been arrested by order of the Fire Lord,” Dawei gasps out.</p>\n<p>Kancho wants to bang his head against his desk. This would do nothing but encourage the rumors.</p>\n<p>This would be confirmation to anyone paying attention.</p>\n<p>Fire Lord Ozai has no subtlety whatsoever.</p>\n<p>Of course, the man has murdered half his family at this point, the old spymaster acknowledges to himself. He hadn’t even waited in between assassinating Fire Lord Azulon and whatever he had arranged to happen to his wife. Hells, Kancho is halfway convinced that Prince Lu Ten’s death wasn’t just the result of a lucky shot from an Earth Kingdom archer. Not that, at this point, it really matters. They have the Fire Lord they have; the only thing to do is get on with it.</p>\n<p>Kancho misses Azulon. He was a hard man, but at least he <em> listened</em>.</p>\n<p>“I take it there were witnesses to the arrest?” Kancho asks. As expected, Dawei nods. Kancho pinches the bridge of his nose and allows himself one moment of despair. Stupid. If you’re going to disappear your enemies, at least do it quietly.</p>\n<p>“They dragged him out of his house, sir,” Dawei says, which makes Kancho wish he had hair so he could pull it out. Ozai no doubt heard about the play — and more importantly, who wrote it — and let his madness give the orders instead of his reason. Arresting the man in broad daylight, especially considering the talk already circulating about certain parallels between the play’s events and particular rumors….</p>\n<p>If Kancho wasn’t so dedicated to his country, he would retire right now to some tiny island and leave the Fire Lord to clean up his own mess.</p>\n<p>Alas, patriotism.</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>The harvest is poor. They must import more food from the colonies.</p>\n<p>An army cannot march on an empty stomach, and a navy cannot sail on water alone.</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>She doesn’t want to get up. Her husband, firebender that he is, is always up before the first rays of sunlight peer through their windows. She, as someone not chained to a giant ball of light in the sky, would much rather laze in bed for as long as possible. As such, he leaves her with a kiss on the forehead and goes to train.</p>\n<p>“Mistress, you have a letter,” her maid tells her after she’s dragged herself out of bed and donned a morning robe.</p>\n<p>“Addressed to me or my husband?”</p>\n<p>“Just you, mistress,” the maid says.</p>\n<p>“Then I’ll read it at breakfast,” she says. No use waiting on her husband.</p>\n<p>She reads the letter over her arrangement of small traditional dishes. She puts the letter down. She picks it up.</p>\n<p>She’s heard the rumors that leak out of the capital like pus, of course, but many had sounded so extreme. But Lady Naimei is a childhood friend, writing to her in their childhood code, and it is hard to disbelieve her horrified tone. Lady Naimei had left Caldera City abruptly only a few months ago after years of loyal service to the royal family. She doesn’t speak of what prompted her to resign her position at court so suddenly, however, but of something older. Something that had set her on a new path.</p>\n<p>She hadn’t thought the rumors could possibly be true.</p>\n<p>Except….</p>\n<p>She reads the letter again and covers her mouth with her hand as it sinks in.</p>\n<p>“His face?!”</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>“Princess Azula was gifted with a sparrowkeet last week,” Haruna says at dinner.</p>\n<p>“Oh?” her mother asks with interest. “Those are rare outside Ba Sing Se, I heard. Has she decided on a name for it?”</p>\n<p>Haruna hunches her shoulders. “No. She says it interrupted her training and died. She’s going to have what’s left of it stuffed.”</p>\n<p>Her mother and aunt look at each other with worried eyes. They’ve been doing that more and more lately, and it’s only gotten worse since Father had been given command of the Eastern Defense Fleet.</p>\n<p>She wishes her dad were here.</p>\n<p>“Haruna, we’ve been discussing your schooling,” her aunt says the next day. “We don’t think the Royal Fire Academy for Girls is a good fit for you. How would go like to attend Koizumi Finishing School instead?”</p>\n<p>Haruna eagerly agrees. No one can make friends while Princess Azula is around. If you take your eyes off of her for even a moment, you never know what she’s going to do. And whatever it is is always painful.</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>“Why would the Fire Lord arrest Zuojia?”</p>\n<p>“He was telling lies,” Chimi says resolutely.</p>\n<p>“Or maybe he was telling truths,” Ying Su murmurs to Lian.</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>Marrying a Fire Nation soldier had seemed like a good idea at the time. Her parents couldn’t afford to feed any more daughters, and the Earth Kingdom militaries won’t take women who aren’t earthbenders. Chu Ju had had to make a difficult choice, and when a cute foreign soldier had approached her shyly at the marketplace, she had seized her chance. All it had cost her was her homeland.</p>\n<p>Bunta has been nice, nicer than she had expected, and he treats her with respect.</p>\n<p>But it’s hard living in the Fire Nation. She has more freedom in her marriage than she had dared hope, freedom to come and go as she pleases and do as she wishes with her days. But it’s difficult to exercise it when the locals look at her green eyes and round face and sniff at her mere presence.</p>\n<p>She holds her head high, though, because they would respect her even less if she cowers at their disdain like a scared fox antelope.</p>\n<p>Chu Ju may wear their gaudy red clothing and eat their over-spiced food and watch their awful propaganda plays and endure their harsh words, but she has pride their national egotism can’t hope to match.</p>\n<p>Earth endures.</p>\n<p>Her pregnancy makes her husband happy, and she’s happy too, honestly, but it’s hard to shake her worries. Soon she will give birth to a half-Fire Nation child. It could be a firebender, like its father’s mother. The war continues to stretch on with no end in sight, although now that Bunta is stationed within his homeland Chu Ju has to rely on official Fire Nation reports of its progress.</p>\n<p>One day her child could be called on to fight against its mother’s land.</p>\n<p>When her husband comes home one day visibly shaken, she’s naturally concerned. Is it the war? Is he being investigated at work again? Is he being deployed?</p>\n<p>“What’s wrong?” Chu Ju asks.</p>\n<p>Bunta swallows. He works in the intelligence branch now, putting orders into code. He doesn’t talk about it with her and she doesn’t ask. It’s too risky. Chu Ju almost doesn’t expect him to answer at all.</p>\n<p>“I...learned something at work,” he says. He rubs his face with both hands and stares hard at her, searching for something. Even though Chu Ju is as far from the war as she can make herself, even though she cut off contact with her own family when she and Banta moved to the Fire Nation so that no suspicion would fall on them, she still feels the sting of nervousness and miserable doubt in his eyes.</p>\n<p>“I want— I need you to know,” he says seriously, “that I would never hurt our child. Never.”</p>\n<p>Chu Ju blinks in confusion because, well. That had not been one of her many concerns.</p>\n<p>“What—?” she starts to ask, but he shakes his head.</p>\n<p>“Sometimes I wonder what we even stand for anymore,” he says quietly, and that’s the last he speaks of it.</p>\n<p>Chu Ju can only pull him into her arms to comfort him, but her mind is whirling. Something has shaken her husband’s faith in his own country, and anything strong enough to do that could probably bring the Fire Nation to its knees.</p>\n<p>She wants to know what it is.</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>Fire Lord Sozen had ordered all documents about the Air Nomads to be turned over to the government immediately after Avatar Roku’s death. Tu Mu’s grandfather had complied, handing over scrolls of airbending forms, philosophy, and even his spirited letters with a monk named Gyatso about morality. He had kept the copies he’d laboriously made hidden in a false floor underneath his private study. Even when soldiers had come knocking to verify his grandfather had turned <em> all </em> of his materials over, the cache had remained undiscovered.</p>\n<p>He’d given it to Tu Mu shortly after his graduation.</p>\n<p>It’s strange to walk around, respectfully deferred to professionally as the Fire Lord’s court historian, setting the history curriculum for the Nation’s children to learn, and to know that it’s all a lie. He has the documents that prove it, copied in his own grandfather’s hand.</p>\n<p>His most precious hidden document isn’t about the Air Nomads, at least not directly. Tucked away among his grandfather’s stash of forbidden history was the journal he’d kept in the intervening years between Avatar Roku’s death and the genocide of the Air Nomads. An account of a changing nation — and his shame.</p>\n<p><em> You don’t actually need people to believe your propaganda</em>, his grandfather had written in cramped, angry characters. <em> You just need them to go along with it. The belief will come later, once everyone who knows the truth is too afraid to speak it. Like me, coward that I am. </em></p>\n<p>Tu Mu is an old man now, and his granddaughter Ayai is about to graduate university herself. Professor Sugi says she’s too smart for her own good, a flame too bright to be left unsheltered in the current storm. But who else can he entrust this legacy to? Certainly not Ayai’s brother, who Tu Mu wouldn’t trust to keep a plant alive, much less the relics of a lost people.</p>\n<p>He will have to take a chance. There are rumors that the Avatar has returned, and Tu Mu can’t let what their family has preserved of the Air Nomads’ history die with him should he pass before the Avatar has returned the world to its proper balance.</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>Jie’s hands don’t shake when she’s scared. Her heart feels like it’s going to pound out of her chest, and she can’t stop the tears building at the corner of her eyes, but her hands are as steady as always. Her little cousin Hina is free of the palace, safely off to the colonies to start a new life away from her lingering grief over her dead boyfriend. It had taken a lot for Jie to even consider taking this course of action, but weeks and months and years of watching this man who leads their nation destroy them from the inside had driven her to it.</p>\n<p>Her only regret is that she’s been caught.</p>\n<p>She thinks of the young prince who was so brave when he confronted the general and who cried when he faced his father. She thinks of General Iroh, the rightful heir. Maybe he was soft, but he also never raised his hand to his son. Never left the servants so scared they fled in the night rather than face him as their master. Never brushed aside the deaths of his own troops.</p>\n<p>“Did you think I don’t know everything that comes in and out of my palace?” Ozai questions almost softly, his voice creeping and dangerous. “Did you think you could end my reign so easily?”</p>\n<p>She’s served Ozai’s tea for four years. She knows she’s going to die. She knew it before she even heated the water or poured the cup.</p>\n<p>Jie lifts her chin and meets Ozai’s gaze. She picks up the cup she was going to serve him and drinks all its contents in one smooth motion. She swallows.</p>\n<p>She spits in his face.</p>\n<p>“Long live Fire Lord Iroh,” she says, using the voice he didn’t think she possessed, and then the room starts to waver around her.</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>He averts his eyes from the house at the end of the street. The building looks as it should, but it’s still. Empty. The scholar is missing.</p>\n<p>There are scorch marks on the roof.</p>\n<p> </p>\n<p>--- </p>\n<p> </p>\n<p>Kibishi did not become a general by being soft hearted. The surrender should have been humiliation enough. A lesson. In time, when Ozai’s reign ended and his son’s rose, they would have spoken of his passion and boldness, to interrupt so. Praise. That the boy cried as he surrendered was not ideal, but Kibishi knows himself as he was at thirteen — he would have cried too.</p>\n<p>Ozai’s rashness really just emphasized what all the generals and admirals knew but dared not say: Iroh should have followed Azulon. As he was supposed to.</p>\n<p>But Iroh hadn’t been there.</p>\n<p>A man’s grief over his son’s death is understandable, but their country needs their Fire Lords to be more than mere men.</p>\n<p>Kibishi doesn’t really know what’s going to become of them all. Ozai commands them to seize land they can’t hold, to torch crops they could use, to put their war prisoners in red uniforms and force them to the front. He doesn’t care that they will lose every inch they gain if they don’t entrench properly, that their army goes hungry while growing grain burns, that Fire Nation soldiers captured by the enemy face ever-harsher conditions in reaction to the treatment of their own.</p>\n<p>The Royal Family has started a wildfire across the world, and it’s burning out of control while they throw kindling on the flames.</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>The harvest is even poorer. Even the colonies seem to be affected. They buy their grain from those Earth Kingdom merchants unscrupulous and greedy enough to trade with the country’s enemy. The colonies may scorn their lack of honor, but they buy the grain nonetheless.</p>\n<p>The Fire Nation takes half. </p>\n<p>The colonies are hungry.</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>Airi lights a candle in secret on the exiled prince’s birthday. She’s done so every year since his banishment, and it’s affirmed her thoughts every time. Her temple lays in the heart of the Fire Nation, yet the flames flicker weakly. They fade away even in this place where they should burn the strongest. </p>\n<p>The candle she lights for Prince Zuko burns the whole night, long after the others sputtered out.</p>"
}