{
  "id": "23351494",
  "url": "https://archiveofourown.org/works/23351494?view_full_work=true",
  "author": [
    "foxy_mulder"
  ],
  "title": "Tunes Without Words",
  "rating": "Not Rated",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "The Witcher (TV)"
  ],
  "relationships": [
    "Geralt z Rivii | Geralt of Rivia/Jaskier | Dandelion"
  ],
  "characters": [],
  "additional_tags": [
    "Angst",
    "Angst with a Happy Ending",
    "It Gets Worse Before It Gets Better",
    "Insecure Jaskier | Dandelion",
    "Jaskier | Dandelion Whump",
    "Geralt z Rivii | Geralt of Rivia is Bad at Communicating",
    "Post-Episode: s01e06 Rare Species",
    "Emotional Hurt/Comfort",
    "Hurt/Comfort",
    "eventually",
    "Geralt z Rivii | Geralt of Rivia Apologizes",
    "Past Abuse",
    "Pining Jaskier | Dandelion",
    "Pining",
    "Miscommunication",
    "Misunderstandings",
    "Self-Esteem Issues",
    "Self Confidence Issues",
    "Character Study",
    "Not Actually Unrequited Love",
    "Emotional/Psychological Abuse",
    "Mutual Pining",
    "Insecurity",
    "Healing from Trauma",
    "Mental Health Issues",
    "Complete",
    "Consent Issues",
    "Jaskier | Dandelion Has a Past",
    "Verbal Abuse",
    "Happy Ending",
    "Jaskier | Dandelion Has ADHD",
    "Alternate Universe - Canon Divergence"
  ],
  "language": "English",
  "series": "Part 1 of The Thing With Feathers",
  "published": "2020-03-28",
  "completed": "2020-04-19",
  "words": "22,018",
  "chapters": "11/11",
  "comments": "1,357",
  "kudos": "16,233",
  "bookmarks": "2,833",
  "hits": "171,935",
  "summary": "<p>The plan is this: </p>\n<p>He will note all the things that annoy Geralt, and he will stop doing them, and then Geralt will want him around.</p>\n<p> It will work. It has to work, because Jaskier <i>cannot</i> be left behind.</p>",
  "notes": "<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">notes</a>.)\n</p>\n<p>Ok this is the same premise as my other fic \"between speech and silence\", because I was originally going to go a different route plotwise w that one, but realized it would only work in a way longer fic. So, here is the way longer fic! </p>\n<p>Title is a reference to Emily Dickinson's \"Hope is the Thing With Feathers \".</p>\n<p>Comment if you have feelings about it!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">notes</a>.)\n</p>\n<p>Jaskier: yes I sleep alone yes I refuse to accept affection , it's called social distancing sweetie xxx</p>\n<p>Lets play \"spot the miscommunication,\" what are they trying to TELL EACH OTHER</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">notes</a>.)\n</p>\n<p>if y'all dont already project your childhood trauma onto characters and write it into fanfiction, I highly recommend it for therapeutic purposes. I see a lot of comments relating to Jaskier in this fic, and I'm telling you right now that writing about it really makes you feel therepeutized</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_8_endnotes\">notes</a>.)\n</p>\n<p>Next chapter is the one where real eyes realize real lies 😳 i bet you're frustrated they arent talking , well IMAGINE HOW I FEEL, I have the power to fix everything in like 2 sentences but instead there has to be \"buildup?\" Sounds like propaganda to me luv</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_10_endnotes\">notes</a>.)\n</p>\n<p>Some comments asked abt a Geralt POV, I may or may not do a second piece to this w his POV, I actually intended to from the start and wrote a few chapters of it before this became such a long fic, so it depends how motivated I am to work on it when this ones done!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_11_endnotes\">notes</a>.)\n</p>\n<p>And that's it for now! Hope you guys liked it as much as I liked writing it, and if you enjoyed this little ditty you might like my other Witcher fics as well :)</p>\n<p>Also I am officially making a Geralt POV! Probably a one shot. stay tuned</p>",
  "text": "<p>It's with a sick feeling in his stomach that Jaskier realizes things will never ever <i>ever </i>go back to how they were before.</p>\n<p>He’s had breakups, but none had ever hit so precisely at the center of his insecurities, torn so deeply into the very fabric of his life plans. Because everyone he had ever been with before had been fleeting, a bit of passing fun in the aimless frolick that was his oblivious existence pre-Geralt. </p>\n<p>Fun and carefree and exciting.</p>\n<p> Lonely, adrift, shallow. </p>\n<p>Meaningless. </p>\n<p>He fancied himself a lover, back then, but he didn’t really understand love. Had never felt anything beyond the easy nature of courtly affairs. Had certainly never been loved himself, as he flitted between lovers like a butterfly to flowers, never sated. No one could love him anyway. Settling down for forever seemed a distant dream. And then he met Geralt. </p>\n<p>Geralt, with his impossibly tangled hair, surly attitude and feral tendencies. Geralt who loves his horse and is obsessively organized and tries to do the right thing no matter what. </p>\n<p>And gradually, after countless nights spent stitching him up and getting kicked out of inns together, trying endlessly to make him crack a smile, gradually, gradually he<i> did </i>understand. Love. Commitment. Wanting forever with one person. Leaving Geralt behind was never in the books for him, he thought he'd spent the rest of his life with that man.</p>\n<p>And he had thought- Geralt never outright <i>said </i>they were best friends, that he cared, but Jaskier could read him. After 20 years, he could read his tells and he didn’t <i>need</i> to say it, because he and Jaskier were at an unspoken understanding of their mutual affection, however much larger Jaskiers affection was, it was enough to have even a scrap from Geralt. He was truly, genuinely fine with it, happy to care for him and be cared for silently in return, because he knew Geralt. </p>\n<p>Or he thought he knew. </p>\n<p>And yet here he is again, lonely, adrift, meaningless.</p>\n<p>It feels wrong, the way the sun shines bright and cheery in the sky, and the clouds float merrily and the birds fucking chirp, as if Jaskier hasn't just lost everything that meant anything to him, hasn't wasted 20 years. As if life will just … go on.</p>\n<p> His feet burn with blisters, but he cant stop <i>going.</i> He doesnt know what to do but keep walking, because if he stops and thinks about whats next, the gaping loneliness and hurt that await, he doesnt know if he can ever get up and keep walking again. The birds twitter, loud and sweet and mocking.</p>\n<p>20 years. 20 years. 20 years. </p>\n<p>20 years of being an absolute fool. Debasing himself. He thought he knew Geralt, the way his eyes would flick to him over a campfire in amusement disguised as annoyance, or when he would get them just one room and they would wake up curled together, and Geralt would grunt an excuse about saving money but Jaskier would know. He had held those moments tenderly, but with the new knowledge, he sees them in a different light.</p>\n<p> Looking back, he doubts, reevaluates every instance Geralt insulted him and he had brushed it aside as fond teasing. </p>\n<p>When he considers it, he feels his cheeks heat in embarrassment at how utterly obvious it was. How little Geralt has always thought of him as a person, from his music to his abilities to his personality. It's never even been a secret, hes just been an oblivious <i>child. </i></p>\n<p>Had everyone known? In the taverns, could they see how pathetic he was to trail after someone who never wanted him along, and they simply chose not to tell him? He feels the humiliation burn hot in his gut, sour and acrid. </p>\n<p>And still the birds sing sweetly.</p>\n<p>“Shut the fuck <i>UP!</i>” He screams to the woods. “<i>SHUT UP!</i>”</p>\n<p>Fucking birds. Breathing hard, guilt and shame sink through him like a spear- it’s not the birds fault. It's not even Geralts fault, really. How could he have even thought Geralt liked him, unspoken, when all along he had been speaking, insulting him every day, and outright telling him they weren't friends? Geralt couldn't have possibly been more clear about how he felt. How could Jaskier have thought he was<i> ever </i>more than a burden? It's not Geralts fault. He can't let himself be bitter.</p>\n<p>This is all him, and look at him now, moping about it. He just... doesn't know what the fuck to <i>do.</i></p>\n<p>\"Sorry birds,\" he mutters.</p>\n<p>It makes so much more sense than the alternative he had built up in his head, of them being friends. Of maybe one day being more than friends, if Geralt ever rid himself of the witch. Fuck, how could he have been so naive? </p>\n<p>His feet hurt. He can feel the blisters on each toe and his head aches from thirst. Normally Geralt would lend him some salve, and they would make camp. He doesn't want to stop walking, face his first night alone. </p>\n<p><i>It's like your old days, you can go play for the courts once again and sleep with the royals,</i> he thinks, an attempt to rouse his spirits. But it falls flat and empty. He doesnt want to flit and preen and flutter around like a young bird. Hes built a nest in his heart for someone who does not want him, and it<i> hurts. </i></p>\n<p>Geralt's life's blessing is Jaskier's curse, it seems. <i>Shoveling shit. </i>His eyes prick with tears. <i>Take you off my hands. </i>Off his hands, like he was an unruly child, a grand annoyance to be looked after by obligation, not a friend at all. Like it never meant anything. He's always been disposable. His vision blurs with fat tears and still he keeps walking, unseeing. </p>\n<p>In a twisted way, Jaskier is glad he said it. Because otherwise he might have truly stayed by his side forever. If years of hints didnt do it, Geralts only option was to be harsh with him the way he was. He was probably trying to be nice by being subtle before, but after the shitty day he had on the mountain he just snapped and said what he meant, so there could be no qualms about it. With the many heavy burdens he already bears, Jaskier is glad not to be another of them, to add to his hurt. Jaskier understands. Truly, he understands. </p>\n<p>But he doesnt know what hes going to <i>do.</i> Blinded by tears and exhausted, he trips on a rock, shielding his lute in his arms as his knees hit the rocky ground with a crack. </p>\n<p> He wipes his eyes with a wet sniff. His knees are skinned and dusty, bleeding sluggishly where he now kneels in the middle of the path. </p>\n<p>\n<i>What is he supposed to do now?</i>\n</p>\n<p> Hes helpless without Geralt. He can't walk forever. His aching body and scraped knees scream to be acknowledged. He sighs, feeling the fight go out of him all at once. He can stop here for the night, spread his bedroll on the leaves and hope nothing will come and eat him. One thing at a time. He can make it through tonight, at least, and maybe the morning will bring clarity.</p>\n<p>He makes his way to a mossy log and sets up there, the few items he thought to grab lying against a tree and his bedroll against the log. He is terribly visible. If he is eaten by predators, or his few possessions taken by thieves, then so be it. He closes his eyes to rest under the light and birdsong of early afternoon, and he is truly, really alone.</p>\n<p>\n<i>Jaskier is very young, when he makes his first instrument. The children of another noble family have been sent to play with him while their parents have tea in the other room. They are older than him, and he peers up at them in awe, eager to impress. Jaskiers pockets are full of grass, for he has learned to make a little whistle by rolling the grass just so between his fingers and blowing on it. </i>\n</p>\n<p>\n<i>He shows the others, and they are not impressed by this trick. </i>\n</p>\n<p>\n<i>\"That's dirty. Our father said we cant play with dirty children.\"</i>\n</p>\n<p>\n<i>\"Your hands are all muddy now,\" exclaims the girl, scrambling away to keep him from her fine dress. Her brother snatches the grass from his hand and tears it up. </i>\n</p>\n<p>\n<i>Jaskiers eyes well with tears, and he sobs, heartbroken. The two siblings lock eyes nervously.</i>\n</p>\n<p>\n<i>\"Stop it, you're going to get us in trouble. They'll think we pushed you.\"</i>\n</p>\n<p>\n<i>\"You're being a baby.\"</i>\n</p>\n<p>\n<i>He can't stop, and they go to play on the other side of the room, leaving him to wail in the corner, still clutching the scraps of grass like treasures. </i>\n</p>\n<p>\n<i>\"Julian.\"</i>\n</p>\n<p>\n<i>He snatches his hand away as if burned, looking guiltily around the room. His father stands over him, looking cross.</i>\n</p>\n<p>\n<i>\"What's all this?\"</i>\n</p>\n<p>\n<i>\"I was just playing,\" he says in a rush.</i>\n</p>\n<p>\n<i>\"You're too old for crying,\" he raises a brow at the grass stains on his hands and his expensive clothing. \"And you've made a mess. Cant you be a good boy, Julian? The guests can hear you from the other room.\"</i>\n</p>\n<p>\n<i>\"I can't,\" he sniffles. </i>\n</p>\n<p>\n<i> His father kneels beside him to look him in the eyes, and his grip tightens painfully on his shoulders</i>\n</p>\n<p>\n<i>\"Children are meant to be seen, not heard. You want to be quiet for father?\"</i>\n</p>\n<p>\n<i>\"Yes,\" he says obediently. If he resists further he will be punished. Father smiles at him then and hugs him close, because as much as he hates Julian when hes bad, he loves him when hes good. He will just have to work on remembering next time.</i>\n</p>\n<p>\n<i>\nHe wants to be quiet for father.\n</i>\n</p>\n<p>\n<i>He tells himself over and over, but he just can't do it. He doesn't want to be quiet, he likes talking and playing. He likes to sing. He likes grass. </i>\n</p>\n<p>\n<i>His eyes are watery again, and he takes gulps of air to hold in tears. Crying is embarrassing, he must stop crying so much or he will never make friends with the other children. He covers his mouth with a hand to muffle the noise, and turns his back to them so they won't see the silent tears run down his chubby cheeks.</i>\n</p>\n<p>\n<i>He is going to have to change, if he's ever going to have a friend.</i></p>\n<p>Hours into the day, he opens his eyes to the clopping of hooves. He whips around, awake at once, tensed and ready to flee. Someone approaches from the distance, and his eyes widen in horror as the form comes close enough to make out.</p>\n<p>Of course it's the one person he wants to see even less than monsters or bandits, he thinks as he catches a glimpse of white hair.</p>\n<p>Fuck. Fuck. He should just hide until hes gone. But he can't, Geralt has enhanced senses and probably already knows he's here. Okay. Just act normal. Nonchalant. He'll probably just pass by without a glance, pretend he doesnt notice Jaskier is there. Worst case scenario, he will glare and look disgusted and then walk right by. No big deal. <i> You will not grovel,</i> he tells himself firmly. </p>\n<p>Geralt approaches quickly, glancing around with a near frantic look in his eye. Jaskier wonders, in the midst of his own nerves, what's got him in such a state.</p>\n<p> He shifts against the log to scratch at the scab on his knee, and their eyes lock. </p>\n<p>\"Jaskier,\" he breathes, and the tension bleeds from his shoulders. </p>\n<p>\"Geralt,\" he responds tightly. </p>\n<p>For some reason, Geralt is still standing right there on the path. And then he's… walking over. Jaskiers stomach sinks. This can't be good. He has not rehearsed for this outcome in particular. He looks down, picking at his scab again. It's sort of itchy. </p>\n<p>Geralt stands awkwardly by the log, saying nothing for a long moment. </p>\n<p>\"You shouldnt pick at that.\"</p>\n<p> That creates an abrupt spike of annoyance. He knows he shouldn't pick at it, he's picked at scabs before and Geralt says the same each time, citing the fact that if Jaskier gets a blood infection itll be a burden on Geralt's purse when Jaskier's sick and can't work. At the time, he had laughed it off. </p>\n<p>Now, he shrugs tiredly, not bothering to look up. Geralt hardly gets to lecture him on health anymore. He isn't even <i>following</i> him anymore, it won't be Geralts burden to bear, if he decides to get an infection, it's his business alone. </p>\n<p>\"What do you want? I'm busy.\" He sighs. Stupid. <i>Busy? </i>Geralt can see him picking at his knees in the middle of the damn woods. </p>\n<p>\"I see.\" They lapse again into awkward silence, and Geralt doesn't leave. Jaskier's knees are bleeding again. \"I smelled your blood.\"</p>\n<p>\"Well, as you can see, I'm whole. So feel free to go ahead. Shoo.\" He tries to keep the bitterness from his voice. This isn't Geralts fault. but damn if he doesnt want the man to go away and let him stew in peace.</p>\n<p>\"I'm sorry,\" Geralt grits out. Jaskier blinks. </p>\n<p>\"What?\"</p>\n<p>\"You heard me,\" he says, sounding fondly exasperated- no, Jaskier reminds himself firmly, just regular exasperated. Geralt shakes his head. \"Here.\" he sits beside him on the log and opens his bag, pulling out a roll of bandages and a container of salve. </p>\n<p>\"It's really not that serious. I tripped.\" He hopes Geralt can't see the redness of his eyes, hear the residual roughness of his voice from crying. That would be beyond humiliating, and Geralt would be annoyed at him for crying. Or maybe he would feel guilty for making him cry, because Geralt is a good person, and Jaskier would become a burden all over again like he's doing now, taking Geralt's time and supplies and attention. </p>\n<p>Geralt globs a generous amount and massages it gently into each knee. Jaskier's face burns. Geralt takes the bandages next. It's too much.</p>\n<p>\"Stop.\" He snatches the bandage from Geralts hand. \"I can do it.\" </p>\n<p>He wraps the bandage neatly and quickly, practiced from his years of wrapping Geralt when he was too injured to move, or couldn't reach. <i>Don't think about it. </i></p>\n<p>Geralt stands again and walks to Roach, and loiters there, like he's waiting for something.</p>\n<p> Jaskier goes to his bag and retrieves his paper. Perhaps he will write some lines and set them to music later, as he doesnt feel up to playing right now. Though he may be on the road later tonight, now that his feet are a little rested. Just enough to get some distance from Geralt.</p>\n<p>He scribbles a few lines, distracted by Geralts continued presence in his peripheral vision, unmoving, looking expectant. What could he possibly want? </p>\n<p>Okay. He can't take it, the curiosity is killing him. He goes to him, idly stroking Roach with one hand and fixing him with a glare to cover his raw hurt.</p>\n<p>\"Well? What are you waiting on?\"</p>\n<p>Geralts jaw clenches. \"You.\"</p>\n<p>Oh. </p>\n<p>No. He cant let himself get sucked back into this just because Geralt feels generous because his knees are bleeding, or guilty about his outburst, or whatever noble urge has driven him to ask Jaskier along again right after finally ridding himself of him. It's not fair to Geralt to sacrifice his ease of mind so Jaskier can be content. </p>\n<p> He decides to be blunt. \"Look, if this is about what you said on the mountain, I want you to know it's fine. I completely understand.\"</p>\n<p>Geralts face softens in relief and Jaskier cements it in his mind. So his suspicions were correct- He's just as glad to get it in the open as Jaskier is. A bittersweet smile tugs at Jaskiers mouth at the clarity. Geralt clears his throat.</p>\n<p>\"So you'll come?\"</p>\n<p>\"I-\"</p>\n<p>\"There's bandits in this area, you shouldn't walk alone.\"</p>\n<p>Right, because he can't fight, and can't even walk without tripping. He glares at the ground. Of course Geralt is right. He shouldn't stay out here alone. And he doesnt know what to do without Geralt anyway. This will buy him some time to figure out how to endear himself to Geralt, to be useful enough to warrant a second chance. He nods, and picks up his things. Geralt has apparently gathered the rest from camp, and generously takes Jaskiers bag to place in Roach's saddlebags. This should be a happy moment, he is back on the trail with Geralt, but it feels hollow. He needs to fix what is broken.</p>\n<p>The plan begins to shape itself the moment he thinks it. He will let Geralt walk with him until they reach a town, and then he will show him just how unobtrusive and useful he can be if he puts his mind to it. So he nods, and follows Roach as she sets off in a trot.</p>\n<p>Together they make their way through the miles of forest and Jaskiers blisters burst and his knees ache. A week ago he would whine, ask for a break. But not so today. He must be careful, if he is to convince Geralt he can be a good traveling companion, and start to fix things between them. He can't let Geralt leave him again, he just can't; at this point Geralt is a bigger part of him than himself, the only true and long lasting friend he has ever had, even if he is not Geralts friend in return. He can give up a few things for Geralt's sake, become a new version of himself, a version that Geralt can like. He would give up anything for Geralt.</p>\n<p>And he will. He plasters on a smile and walks silently along beside Roach, eyes dry, and feet burning with every step.</p>\n<p>\n<i>\"I cant breathe.\"</i>\n</p>\n<p>\n<i>\"Stop whining. It’s undignified,\" Julian’s mother orders. The servant pulls the corset ever tighter. Now that he is a teenager nearing marrying age, Julian is expected to wear such flattering clothing at the stuffy events he attends. And tonight is important. “I need you to make a good impression.”</i>\n</p>\n<p>\n<i>\"I'll just be myself, I can be friendly.\"</i>\n</p>\n<p>\n<i>She hesitates, choosing her words carefully, a skill Julian has never mastered. </i>\n</p>\n<p>\n<i>\"You should be a more... palatable version of yourself. Be the version of Julian that behaves in a manner fit for your status. And whatever you do, no bursting into song.”</i>\n</p>\n<p>\n<i>\"I don't see how all this is necessary,” he whines. Why should he have to dress up and parade himself around to strengthen political ties that have absolutely naught to do with how 'palatable' he is?</i>\n</p>\n<p>\n<i>\"Don't you want to be esteemed?\" she drawls.</i>\n</p>\n<p>\n<i>\"Yes. You know that I do.\" Of course he does. He craves it as if he were starving, wants her to acknowledge him, or for anyone at all to tell him they like him. Of course, no one does, as he is frequently reminded. No one ‘likes.’ They ‘esteem.’ Friendships are not the way of nobles; they deal in political ties and subtlety, hidden feelings and meanings Jaskier can’t deal in, too open to understand. He's poorly behaved for his station, loud and honest, gawky and unable to be still. Such is the gossip among nobles, which never fails to make him go beet red with humiliation at how he tarnishes the family name simply by being.</i>\n</p>\n<p>\n<i>She scoffs.</i>\n</p>\n<p>\n<i>\"'Why would you be esteemed when you behave this way? It's disgraceful, your lack of etiquette.” she says, and her voice chimes sweetly, but she may as well have spit the words, from the way his face falls.</i>\n</p>\n<p>\n<i>\"I can't help it,” he says, chastised. Is he really that bad? Had someone said something about him again? She takes his face in hand and he flinches instinctively at the feeling. She rarely touches him so gently.</i>\n</p>\n<p>\n<i>\"I'm sorry.\" His mouth clicks shut as he forces himself not to launch into a rambling explanation of how well he will behave tonight and every night, promises he is sure to break. He can't help it. The corset is still too tight. She pierces him with her icy gaze. He wishes he had such eyes. His eyes are soft cornflower, fit for holding tears and longing gazes, nothing so powerful as her glacial pupils which move powerful men with a glance. She is the strength of the ground, he is the weak wisps of a sky. Unbecoming, he is called. And it is true, he knows this deep in his bones.</i>\n</p>\n<p>\n<i>\"There is nothing wrong with being yourself, Julian,” she says softly, stroking his cheek. He closes his eyes and drinks in the touch. She pulls back too soon, face inscrutable as it is when she’s disappointed, and her voice flat. “But you must learn to hide it away. I do not want to have to worry about you during this dinner. Understood?</i>\n</p>\n<p>\n<i>\"Of course. I will make you proud, I promise.”</i>\n</p>\n<p>\n<i></i>\n</p>\n<p> </p>\n<p>The plan is this: He will note all the things that bother Geralt, and he will stop doing them. It will be a cinch, but he will try and ease into it gradually so it’s not too jolting. He doesn’t want this to change anything between them that doesn’t need changing. He wants Geralt to see the fruits of his endeavor and be impressed, but Geralt shouldn’t know how he’s going about it. This whole plan is extremely manipulative and pathetic, both qualities that bother Geralt- the thing he is trying ardently to <i>stop</i> doing. So it’s not a secret per se, but it’s good practice to be subtle. Why would Geralt need to know? He’ll just wake up one day to realize he likes Jaskier after all. By the time he figures out what Jaskier is doing, he will have seen the many benefits of the new Jaskier, and will approve of him, and that will be that.</p>\n<p> He succeeded in staying out of the way on their way down the mountain and it apparently worked, because Geralt has not left him behind yet, hasn't even said a snappish word to him since they met up again. But of course it won’t be enough forever.</p>\n<p>Step one: less whining. He already knows that one is a bother. It’s a tough one, because his knees hurt a lot at the moment. He fills the silence easily to distract himself.</p>\n<p>\"-I have a confession. I took issue with the key of the birdsong before you found me, and I told the birds to shut up,\" he says, feigning dramatic regret over his social misstep with the birds, to cover the way his brow furrows at the sharp pains in his feet. They've been on the road for ages without a town in sight. And Geralt shows no signs of stopping for the night either. \"I apologized of course, but they had already changed their tune. Sparrows are so fickle. If only I could speak the language of birds things would be easier, I bet they’d be sympathetic then. Maybe even teach me some songs.\" </p>\n<p>Geralt doesn't seem to be enjoying this, as a pinched look sits on his face. Jaskiers heart rabbits nervously. They've only been down the mountain less than a week, there's still time. He wishes Geralt would just…. Something. Let him know what his plans are so he knows what to do. tell him if there's even any hope for this venture to begin with, or if he's so fundamentally repulsed by Jaskier that he should drop it now.</p>\n<p>Jaskier feels his smile slipping away and hastily forces his good mood back. It is important that he keep his faith or there's no way this can work. And it must work. </p>\n<p>\"What do you think birds sing about?”</p>\n<p>“Territory. Mating.”</p>\n<p>“All very boring things, maybe I don’t want to know after all.” His feet hurt, they <i>hurt,</i> he wants to get to town. “Where to now?\"</p>\n<p>\"There is a town a few days from here. We can resupply there.\"</p>\n<p>\"Perfectly sensible. Maybe they'll have some jam too, I have some coin and I've been craving jam since this whole mess started.”</p>\n<p>He stumbles on a rock and keeps talking to hide his gasp of pain. <i>Don't complain.</i></p>\n<p>\"-Or… what was I saying? I can get you some jam too, Geralt.\"</p>\n<p>\"No need.\"</p>\n<p>\"Of course there's no need. No one <i>needs</i> jam. But I can't eat a whole jar by myself, much less two, and sometimes vendors have two-for-one prices and we- I can't miss out on that kind of deal.\"</p>\n<p>\"You can eat a whole jar by yourself, I've seen you.\"</p>\n<p>Oh. He remembers that actually. It was Geralt's jam and he had been especially drunk when he did it, figuring Geralt wouldn't really mind. He always gets voracious when he's drunk. It was good jam, blackberry. That’s his favorite kind, and must be Geralt’s as well, because he always has a jar of it amongst his vials of potions.</p>\n<p>He fixes his gaze on the ground in renewed shame. He had taken Geralt's personal food many times, without asking. He had been such a prick this whole time without even thinking about it.</p>\n<p>Well, at least he has a new step for his list. Make your own food.</p>\n<p>\"Sorry,\" he says sincerely. \"Won't happen again. So it's a yes to the jam then, I'll remember to get some for you.” </p>\n<p> </p>\n<p>When Geralt blessedly, blessedly stops at dusk to make camp, and goes out to catch prey in the woods, he sets the next step into action. </p>\n<p>Rooting through his things, Jaskier doesn't have much food left. A strip of jerky and a few chunks of bread, on the moldy side. It will last him until town if he rations carefully. He has done this kind of rationing before, when money was extremely tight and people threw old potatoes at him. This is no different.</p>\n<p>He picks apart the bread into piles. If he has the jerky tonight, he can have a piece of bread tomorrow and two the next day, and then they will be in town. </p>\n<p>With that settled, he lays out his bedroll and gathers firewood. It feels good to be helping, independent. And now that he has a plan he's confident it will all work out. It will be like old times, only not. His eyelids are heavy and his knees quiver in exhaustion as he squats to dig a fire pit.</p>\n<p>By the time Geralt returns from the woods bearing two rabbits, Jaskier has built a small fire and filled up both their waterskins in a nearby creek. He slumps by the fire and watches Geralt skin the rabbits and set them on the fire to cook. It smells divine. He closes his eyes and tries to fill up on just the smell.</p>\n<p> Sometimes he wishes he were a poet and not a man. It feels like he could fill up on the way Geralt looks soft in the firelight, if such abstract dealings could be devoured.<br>\nThey sit in companionable silence, Jaskier half dozing and Geralt sharpening his swords, turning the meat once in a while. </p>\n<p>Geralt shoves at his shoulder and he sits up, rubbing his eyes. He's holding something. The rabbit. Jaskier shakes his head and begins his act. </p>\n<p>\"I have my own food, you should eat both. Keep up that strength and whatnot.\" He gestures to his bag, and when Geralt looks unconvinced, takes out the jerky to demonstrate. Geralt furrows his brow.</p>\n<p>\"That's it?\"</p>\n<p>\"Yes, there's bread too but I'm saving it. I'm not very hungry,\" he lies. Geralt puts a hand to his forehead, and he barely resists leaning into the warmth.</p>\n<p>\"Do you feel ill? Hot?\"</p>\n<p>\"No. Healthy as a horse,\" he says weakly, distracted by the hand, which has not left his forehead. This is not going as intended. He cant have Geralt thinking he's ill, a liability. He would surely leave him in the next town then.\"Just not hungry tonight.\"</p>\n<p>Jaskier imagines a hurt look flickering across his countenance, which is ridiculous. Why would he be upset at not having to share? Perhaps he has sensed Jaskier’s dishonesty. Nonetheless, he drops it, and eats the meat as Jaskier nibbles at his jerky, chewing long and swallowing slowly to make it last. </p>\n<p>He watches the fire and soaks in the warmth, and it's good. Geralt builds better fires, but he will learn. If somehow this plan fails and they part ways, he will at least get a little longer in this warmth. He smiles to himself. It's going to be just fine.</p>\n<p> </p>\n<p>Geralt is up at dawn, clanging around like a loud…something. It's so damn loud, Jaskier can't even think of a proper metaphor. Jaskier manages to rouse himself a half hour later, and by then things are largely packed and ready to go. He groans and rolls out of bed to hastily shove his things into his bag. </p>\n<p>He eats his entire piece of bread in three bites, unable to stop himself, but it does little for his empty stomach. Well, they'll reach town tomorrow and he can eat heartily then on his own dime. </p>\n<p>Geralt is in a mood, he can tell by the way his jaw is tense and he hasn't said a word. Jaskier is feeling tetchy too, but he suspects it's for different reasons. It's overcast, the birds don't tweet today, and the sun doesn't shine, and his body aches all over. But Geralt doesn't get moody about those kinds of things, so it has to be something else. Probably brooding and trying to process his feelings about all that shit on the mountain. </p>\n<p>Jaskier feels for him. Geralt feels so much more than people think, and it tears at Jaskier to think how much of that drivel Geralt has taken to heart. If he's in a mood, Jaskier won't tell him not to be, he will merely offer distraction. </p>\n<p>He wracks his brain for an inoffensive topic, something besides political tensions and the Child Surprise and Yennefer and all that nonsense with the dragon and all those grand huge things that are probably stifling him right now. Jaskier is proud of himself for not adding to the pile of nuisances Geralt deals with. But it's hard to talk about something besides the elephants in the room, when it seems the room is absolutely filled to the brim with elephants. </p>\n<p>\"The, ah, weather, am I right?\"</p>\n<p>Geralt grunts.</p>\n<p>\"If it starts raining while we're out here I will be so upset. These chafe when they get wet,\" he stops, mentally berates himself for whining. \"But it'll do the plants some good. They are looking sort of brown. Except those little white ones. They're… actually really cute, look Geralt.\"</p>\n<p>He points at the tiny star shaped blooms dotting the grass. They sway sweetly in the breeze, innocent for all the world. He nearly wants to pick one, but they look so alive and beautiful that he couldn't stand to watch one wilt in his pocket. He would pick one for Geralt but more than likely he would throw it away. </p>\n<p>\"Did you see that flower? I may need to get a book of flowers to start knowing the names of these. Back at Oxenfurt there was a library section of that sort of thing. I miss it there sometimes,\" he sighs wistfully. \"But not entirely. Academics and rich people can be a cruel and snobby crowd.\" </p>\n<p>He had never fit in there. It's one of the many reasons he can never remain in a court for more than a few months, and why he has refused to return to Oxenfurt as a professor. He could never quite make himself into what they wanted him to be, so he left. </p>\n<p>This time with Geralt is different, of course, he is no caged bird now. Hardly even comparable. This is something he has sought out himself and fought for and <i>loves.</i> This is his choice. He prefers a life slogging through mud with his not-friend Geralt than a life of luxury without him. If he clips his wings it will be because he would walk with Geralt rather than fly alone. </p>\n<p>He sighs again, unable to stop the tiredness coloring his voice.</p>\n<p>\"I just can't stand snobbery. Anyway, do you mind if I play my lute? I've had a new song brewing.\" </p>\n<p>\"Now you ask before you subject me?\" Geralt smiles wryly, hair fluttering over his face. A question is held in his eyes, one that Jaskier can’t quite decipher. </p>\n<p>He’s joking. Teasing. <i>But he isn’t, is he?</i> As much as he is joking at his expense, he is serious underneath. It’s no secret that Geralt functions best when it is quiet. It is a time to contemplate and listen to his surroundings. He doesn’t like Jaskier's music in the first place. </p>\n<p>He smiles back, and doesn’t take out his lute after all. Suddenly, he is not in the mood for noise.</p>\n<p>They finally and gloriously arrive in town. Jaskier gets them a room cheap, and rightly so- the inns walls are thin and the building rickety, symptoms of the poverty which comes with owning an inn in a rural village like this. It’s evident in the innkeepers threadbare shirt and his tired eyes.</p>\n<p>Jaskiers stomach growls and he pointedly does not look at Geralt, who he told less than an hour ago he was not hungry, instead tapping the table and addressing the old man.</p>\n<p>“Can you direct us to the market?”</p>\n<p>The innkeeper squints, hunched and nervous. Geralt is probably doing his whole ‘loom and glare’ thing behind him. </p>\n<p>Or he isn’t, and the man is just afraid of Witchers generally. It’s a fifty-fifty.</p>\n<p>Maybe he’s afraid of Jaskier, he thinks whimsically. No one has ever feared Jaskier, but this man is old and frail; he could blow him over with a gust of breath, a wisp of impassioned song. He wouldn't do that of course, he loves old people, they’re always full of wisdom and-</p>\n<p>“The market? Why, so your Witcher can slaughter the shoppers?”</p>\n<p>-He doesn't love old people, actually. Jaskier takes a deep breath, <i>remember he’s giving you a room for the night, this is the only inn in town,</i> and releases it. He turns on the charm. </p>\n<p>“I am a famous bard, in need of nutrients to sustain my lovely voice.”</p>\n<p>“Famous?” That seems to pique his interest. “Well. You think you could play for us here?”</p>\n<p>“Maybe so. Depends how you treat my good friend-” He winces at the mistake. Shit. Geralt is right behind him, too. He'll forgive him though, since the pretense of friendship might get them a comfortable stay here, if he plays his cards right. “-My <i>compatriot</i> Geralt, the White Wolf, who I might mention is also very famous and influential across the Continent.”</p>\n<p>The old man's eyes sparkle. “Of course. You know, we don’t get many famous visitors here, you could mention this place to your friends. The market is in town square.”</p>\n<p>Jaskier tips generously. </p>\n<p>“I thought you said you weren’t hungry,” Geralt says on their way out the door. </p>\n<p>“I wasn’t. And besides, I didn’t want to waste your supplies, I can provide for myself.”</p>\n<p>Geralt mumbles something unintelligible, and Jaskier can’t be arsed to parse it just now, because he is <i>hungry</i> and he wants <i>food</i>. He tries to pace his footfalls so as to appear less eager than he is, but his stomach growls again, ravenous after three days of near emptiness, and he finds himself speed walking toward the promise of food.</p>\n<p>They arrive at the quaint market and Jaskier darts from Geralt’s side to make a beeline for a stall selling jam, though it is unfortunately not on a two-for-one special. </p>\n<p>\"And you're sure it's not two for one,\" he asks, giving his best and biggest doe eyes to the seller, a young man with the kind of inscrutable, unamused face Jaskier loves in a man.</p>\n<p>\"Pretty sure I'd know,\" drones the seller. Jaskier laughs and buys the jam at the special one-for-the-price-of-one price, and sings the seller a song, which seems to charm the young man a little despite himself.</p>\n<p>He's in a good mood. He flits between stalls, spends the rest of his coin on bread and fruit to go with his jam, and decides he deserves a day of rest. Geralt is nowhere to be seen. He has surely gone to get his armor cleaned, or search out a contract, or something of the like, which does not require Jaskiers presence.</p>\n<p> Normally he would hang around, at least on the first day, to parse out potential contractors and help Geralt with haggling, as well as generally nagging him and causing a scene when someone was rude. But Geralt will seek him out if he needs help haggling or if someone is bothering him. </p>\n<p>Thinking back, Geralt had never asked for his help, and he was likely more of an embarrassment than anything at those errands. He would eventually bore and go off alone to find enjoyment. This way, the going off has just been pushed sooner to give Gerat some space. But he will see him tonight- if he leaves him alone <i>too</i> long he will wise up to how little he misses Jaskier. It’s a fine line he must tread until he can prove himself.</p>\n<p>Jaskier finds a pleasant patch of grass past the marketplace and settles down. He sticks a finger in the jam and eats it with animalistic fervor, with his bare hands, and the cramps in his belly finally ease. He sets aside the other jar of jam for Geralt, and he eats his own lunch, an obscene amount of bread, and fruit.</p>\n<p>Spirits lifted and stomach full, he wanders to sit on a stone wall to compose for a while and idle his day away. He plucks lazily at the strings, and hums, and takes note of the flowers and the birds and the sun and wind and sky. People bustle about, buying from the market, and the breeze ruffles his hair. He likes this place.</p>\n<p>From the corner of his vision, a small flock of children skip down the street, accompanied by a woman who must be their mother. She looks tired. The children stare at him with round eyes, cheeks dirty from play as they tug their mother this way and that.</p>\n<p>Jaskier has no plans for the afternoon, so he waves at them.</p>\n<p>\"You all want to hear a song?\" He grins. </p>\n<p>They clamber over, invading his remaining bread and fruit. He lets them pluck the lute with sticky fingers and rustle around in his things. He wouldn’t let anyone else be so forward, but he’s got a soft spot for children. He knows how it is to be weak and small, starving endlessly for attention. He plays them some songs. None of his famous ones, because he’s not sure if the descriptions of violence would be appreciated by them or their mother.</p>\n<p> Their mother is kind, apologizing for their food-filching behavior, but he waves off the apologies easily. He’s in too good a mood. </p>\n<p>“And you’re sure we don’t owe you anything?”</p>\n<p>“No, I’m rich and famous.” Well, one of those things is true. </p>\n<p>She smiles at him, wide and crinked. She’s beautiful. People are beautiful when they smile. He wishes he could love someone who smiled at him, who looked at him like that, like he’s worth anything at all. He shakes off the thought, because he’s having a good day.</p>\n<p>“You’re a kind man. We must be going soon, but we would have you for dinner, or a bed if you have nowhere to stay,” she says, question in her eyes. Have you for dinner, keep you to <i>stay.</i> He hears what she's asking, his foolish heart unable to accept.</p>\n<p>“Too generous, but I’m afraid I’m quite full.” He takes a chain of flowers the children have woven. “Before you go- may I?” She nods, and turns to give access to her neck, tosses her long blonde hair for him to take in hand. He weaves the flowers in deftly, and it’s easy, no tangles or dirt or viscera in her butter-soft curls. No derision in her gaze, or hate in her words.</p>\n<p>She could have him for dinner, in a bed, to stay, and it would be so <i>easy.</i></p>\n<p>But as much as he pretends to be easy, to want easy, that’s never been the kind of person he is. What he wants is<i> impossible.</i></p>\n<p>“Friend of yours?” she asks, jerking him from his thoughts. He looks up, and there is Geralt, glaring right at him and looking stormy for whatever reason, his ratty hair haloed ethereally in the setting sun. </p>\n<p>His good mood falls away like a curtain. What exactly has he done this time, that Geralt's glare is directed his way? Of course, he will have to figure it out, like some fucked up treasure hunt, where the treasure isn’t treasure at all but a new way for Geralt to be disappointed in him. Because Geralt would never just <i>tell him what he's done wrong,</i> until Jaskier becomes fully unbearable, which is why he’s in this mess to begin with. </p>\n<p>What could he possibly be mad about? He hasn’t even seen him all day!</p>\n<p>“He's an acquaintance, yes,\" he murmurs.</p>\n<p>If anything, Geralt only looks more murderous now, glancing between Jaskier and the braid like the two of them have conspired against him. He pretends not to notice, ties the end and stands to leave. “All done. You’ve been a delightful audience,” he says with a bow. The children clap, the wonderful things, and if they weren’t so messy, he would want twelve or maybe twenty of his own. Perhaps someday. He wonders if Geralt would ever want children. After giving it a thorough three seconds of thought, he comes to a conclusion: No. He’s got too much on his plate for that.</p>\n<p>Jaskier lets out a breath, defensiveness falling away. Geralt had probably had a bad day, and it’s nothing to do with Jaskier at all. He probably hadn’t even thought of him with so much to worry about and people no doubt being dicks to him every step of the way. And Jaskier had expertly removed himself from being a nuisance today. He reminds himself again why his plan is such a great idea, why it’s important to ease Geralt as much as he is able.</p>\n<p>He walks behind Geralt at a distance, not by choice but because Geralt is taking massive strides like he’s in a hurry to be somewhere and can’t spare a moment to walk with Jaskier. Which is stupid, because they are headed to the same inn.</p>\n<p>“How was your day?” he attempts.</p>\n<p>“Hm.”</p>\n<p>“Right.” He sighs. “Not that you care, but mine was grand.”</p>\n<p>Geralt slows his gait enough for Jaskier to catch up at a trot and walk beside him.</p>\n<p>“I care.” </p>\n<p>“Sure.” He waves him off. It’s sweet of him to say that when he’s in a bad mood. Geralt can really be a sweetheart sometimes. Something hard and cold sits in his pocket, and he remembers. “Got you jam.”</p>\n<p>He hands it over, basking in the way Geralt's hand brushes his as he reaches hesitantly for the jar. Geralt looks at him tenderly, holding the jar like he’s not sure what to do with it. He makes an aborted motion toward him and seems to think better of it, placing the jar in his pocket and turning away.</p>\n<p>\"Hm.\"</p>\n<p> </p>\n<p>When they make it back, he plops straight into bed. Geralt comes in later, slipping under the sheets beside him, shuffling around to get comfortable in what Jaskier affectionately and privately refers to as his nightly nesting. </p>\n<p>\"Not enough coin for two rooms,\" Geralt grumbles, shifting closer. Apparently he has no regard for the fact that Jaskier was asleep, and feels free to speak to him anyway. </p>\n<p>\"Mmmph,\" says Jaskier, too tired to process. “Out of coin.” </p>\n<p> \"I’ll search out a contract tomorrow.” He breathes into his neck. Jaskier shivers despite the heat, and the meaning finally clicks in his sleep addled mind. He should’ve expected it. </p>\n<p>\"I can go play at the tavern,\" he yawns. \"Or we can take turns on the floor. You'll go first.\" </p>\n<p>He’s sleepy and irritated that Geralt is bringing this up now. He paid for this room, so if Geralt has an issue with sharing, he can feel free to take the floor tonight or pay up his half.</p>\n<p>\"That's not-\" Geralt stutters and cuts himself off. Jaskier waits, but he doesn't speak again, nor does he move to the floor.</p>\n<p>If Jaskier were more awake, he suspects he would be hurt right now. It sounds like affectionate teasing, when he says it into his neck. If he didn’t know better, it really sounds like... Jaskiers eyes fall closed and <i>what were they talking about?</i> He slips into sleep and doesn’t think about it.</p>\n<p>Jaskier does play at the tavern. He’s a novelty here, and it looks like half the villagers have shown up to hear him, men, women and children alike. The innkeeper was telling the truth, they really don’t get many people traveling through. </p>\n<p>This is an excellent outcome, as he has made it his mission to get them two separate rooms for the night. Either he will make enough to pay, or he will find a willing soul with whom to spend an evening until he can get the money. Anything but another night, warm and relaxed, pressed against Geralt while he tells him how much he would rather be elsewhere. He can't, and won't, take another night of it. Not to save all the coin in the world.</p>\n<p>Many eyes watch him, and he feels himself absorbing the attention, lighting up like a spark given kindling. He stands up on the table to tap out a rhythm, and he begins. <i>This </i>he knows how to do.</p>\n<p> He dances and sings and makes merry, with his clapping songs, his stomping songs. He regales them with true tales of Geralt's heroics, and false ones of creatures and lovers of the imagination. And they throw him coin as he grins wide, heart thundering in his ears. This is how it feels to be loved, to be a version of himself that is himself and loved at once. He holds it close, precious, in his chest, as he sweats from the exertion and joy of camaraderie. </p>\n<p>Geralt approaches him between songs, when he is being handed free drinks, high on the exhilaration of socialization.</p>\n<p>“I found a contract. Drowners to the North. I should be back by midnight.”</p>\n<p>“Oh, alright. Have fun if you’re physically capable of it.” He would ask to come along, but he knows Geralt absolutely hates when he comes on hunts. He’s got a myriad of complaints, Jaskier is too loud, Jaskier slows him down, gets too close to the fight, is generally irritating, et cetera, et cetera. </p>\n<p>And besides, he’s seen Geralt fight Drowners many times. The next time he begs to come along on a hunt, he should save it for something truly impressive and songworthy, something really worth annoying the shit out of Geralt for. Wouldn’t do to risk all his hard work over <i>Drowners.</i> </p>\n<p>Geralt stands there, looking at him like he’s gone insane. He parses what Geralt has said, and his response, and it clicks what he’s waiting on.</p>\n<p>“Midnight, yes? I’ll have them draw a bath in your room.” He tries to turn away, back to the bar. </p>\n<p>Geralt clears his throat.</p>\n<p>“Not going to beg to come along?”</p>\n<p>“I have coin to count. You know I’m ridiculously popular here? I’ve been propositioned by three married couples. Not husbands, nor wives, <i>couples.</i>”<br>\nThat should do the trick, Geralt always storms off in a huff when he brings up his dalliances. </p>\n<p>“Braggart.”</p>\n<p>“You’re just jealous.”</p>\n<p>“Maybe,” Geralt says, and looks immediately surprised he said it. Theres a vulnerable undercurrent to his voice that makes Jaskier uncomfortable. </p>\n<p>“I’ll be sure to defer them to you next,” he says carefully. Maybe that’s just what he needs, some rebound from the witch to get this stick out of his arse. “You’re being weird.”</p>\n<p>“I could say the same for you.”</p>\n<p>“Oh, you could <i>say the same?</i> You <i>say</i> things now?” he tries to say it lightheartedly, but it falls flat.“I’m always weird, unique, individal, special, and one of a kind. Not to mention interesting, and any other synonyms I may have missed. It’s why I’m so unendingly popular.” he gestures to the small crowd in the tavern, who have now begun to call for another song.</p>\n<p>“Hm.” He shifts awkwardly and takes Jaskiers shoulder in a strange half-pat. “Behave,” he says, and then stomps away, presumably to gather his things for the hunt. That gives Jaskier plenty time to gather ample coin for a room and move his things before Geralt returns. He takes up his lute and strums it, ready for the night.</p>\n<p> </p>\n<p>Hours later, when his fingers are raw and his voice raspy and his purse overfull, he pays, drags himself off to Geralts room to retrieve his things and stumbles into his own room.</p>\n<p>He curls up under the thin sheets. He should feel accomplished right now, he played for hours longer than he would normally do. But he's hollow, the cold of the nighttime creeping into the windowsill of the rickety building and up his spine. He hates going to bed cold. It's not like this is the first time they've slept apart, but it does have a certain finality to it, a weight that Jaskier can't budge. Try as he might to hold them in, the tears well unbidden in his eyes.</p>\n<p>He cries there in the bed, all by himself, too drunk to think. He hates crying. What would his mother say, what would Geralt say? Weakness should not be broadcast. He must be happy, appear happy, carefree. But he is alone now, and he allows himself these tears just for him, a private little indulgence to reward himself for working so hard.</p>\n<p>He only wishes he could love somebody who could love him too, as impossible as it is, he wishes someone out there wouldnt mind him and his sensitivity. Maybe someone who could let him cry on their shoulder and-</p>\n<p>But he doesn’t live in that fantasy world. This is real, and it is absurd to think someone like Geralt would ever allow such a display from <i>anyone</i>, much less from Jaskier.</p>\n<p>And yet he wants. His resolve nearly breaks, it would be so easy to move his things back to the other room, comb Geralts hair in the bath and curl beside him to pretend he didn’t get another room in the first place, pretend he didn't hear the grumbling about sleeping together, the years on years of grumbling, pretend they were friends and it was welcomed when he pressed his face into Geralts chest to get warm. </p>\n<p>His whole life is make believe, as he is coming to realize. He allows himself a little self pity as a treat.</p>\n<p>He rolls over, bed creaking loudly and his heart aching with how much he wants Geralt, and he is struck with determination. If he redoubles his efforts, one day, he could have that. Maybe not the “letting him cry into his arms” bit, because he knows that’s not in the cards, and of course none of the more adult things he fantasizes about while watching him walk away. But his respect, his ear. His friendship. Someday, this will pay off.</p>\n<p>His door creaks open just as he drifts off, and he jerks at the noise, fumbling for something to defend himself with. What could it possibly be about <i>this </i>time? He hasn’t even slept with anyone here, who could possibly want to break into his room? </p>\n<p>He groans, clumsy fingers unable to find his knife. “I bite,” he warns, squinting in the dark to make out the intruder. That'll teach him to lock his door next time.</p>\n<p>“You got a room,” growls a familiar voice.</p>\n<p>“Geralt?” He sits up, room spinning just slightly. “No one taught you to knock? Could’ve been naked. With somebody.”</p>\n<p>“I only smelled you.”</p>\n<p>Smelled him. Something about smells rings familiar, and the cogs of his mind turn. He closes his eyes, annoyed at himself for being so out of sorts he forgot to call for Geralts bath. “Are you hurt?</p>\n<p>“No.”</p>\n<p>“Dont lie to me.”</p>\n<p>“Not badly.”</p>\n<p>He leans off the side of the bed, still woozy with drink. But he must see to this, or the fool will go to bed filthy and the wounds will heal with dirt in them, or unstitched because he cant reach and won't say anything. This he can help with. He’s always more comfortable when he sees in person how bad it is. He stands, managing not to stumble.</p>\n<p>“Let’s have a look-see.” </p>\n<p> </p>\n<p>He sits by the washtub, holding the edge as he cleans a long scratch up Geralts spine. He was being truthful for once, it's not very serious, but Jaskier still winces sympathetically as he pours water over the wounds. </p>\n<p>“You've been different lately.”</p>\n<p>His heart skips a beat. So he has noticed. That’s okay, he was going to sometime or another, and the bastard is perceptive- this is a fine time to talk about it, get it in the open.</p>\n<p>“You noticed.\"</p>\n<p>\"Hm.\"</p>\n<p>\"Its just… nothing really. On the mountain I was upset about, y'know, all that stuff you said, and I thought we could never travel together again.\" Geralt nods.</p>\n<p> \"But since we obviously <i>are </i>traveling together, I’m working on it. Really working on it. Things will be fine between us in good time,” he says, feigning casualness. He hesitates, hands catching in a knot of hair. “You understand, don't you, that it will take time?”</p>\n<p>He tries to be brief, because if he isnt he will drunkenly, nervously ramble and tangle himself in his words as he tries to explain why he deserves another chance. But he doesn’t really want to talk about it, not if Geralt is going to tell him hes not changing fast enough, not doing enough. Or worse, that its pointless and he should give up now. But, logically, he wouldn’t do that. Jaskier’s done everything he asked recently, and Geralt sought him out tonight, so surely that means something. Geralt isn’t so cruel as to give him false hope. He brushes the ends of his hair and Geralt speaks. </p>\n<p>“Take all the time you need.”</p>\n<p>“Thank you,\" he lets out a breath he didn't realize he was holding. \"I’ll get there eventually, we’ll be regular traveling companions again, without the same mistakes as last time. It’ll be even better than before. I just need some time to get there. You won't regret this.”</p>\n<p>“Of course, Jaskier, I wouldn’t begrudge you that,\" he rasps, sounding pained.</p>\n<p>\"Thank you. Really, thank you.\"</p>\n<p>Geralt bows his head. Jaskier is pleased. He has noticed the progress and isn’t upset at Jaskiers undertaking, doesn't think the relationship is beyond salvaging. It’s a comfort to know they are on the same page, wanting Jaskier to be the best version of himself. He loves Geralt, he really does, and this is Geralts way of giving him his own type of care. He smiles, relieved at Geralts sheer acceptance and graciousness, and continues his attempts at detangling.</p>\n<p>\n<i>She’s pretty, that's the second thing he notices about her. The first is that she looks very kind.</i>\n</p>\n<p>\n<i> Their eyes meet across the hall and she smiles at him, a sweet smile that reaches her eyes, nothing like the tight, formal smiles so familiar to him, her mouth broad and enthusiastic. And later that night he gets to know just how enthusiastic her mouth can be. </i>\n</p>\n<p>\n<i>When their paths cross again he goes by a different name, a different trade. It is by mere luck that her eye catches his as he plays for the court, a glint of recognition sparking between them as he smiles back at her. They tumble to bed, and the next day is the same, and the next. Soon enough he finds himself writing poetry and music in her praises and practically living in her bed.</i>\n</p>\n<p>\n<i>A lovesick fool, she calls him often. And he is, he’s quite infatuated. It's easy to be with her, she gives him compliments like they're his daily bread. He falls too easily in love, his unguarded heart suggestible by a simple smile. He would do anything she asked. Anything.</i>\n</p>\n<p>\n<i>When she asks him to an upcoming banquet as her guest, however, he cannot contain his aversion. He knows the banquet she speaks of; it is thrown by his own father each year. He never again wants to go to a banquet with his family in attendance. He can’t stand to see them, the way he can feel their judgement cloud the air, pungent even as they carefully pretend he isn't there, as if he is disinherited all over again each time. She knows this, she knows who he was before he was Jaskier. She must sense his hesitation, because she follows with a disappointed sigh. </i>\n</p>\n<p>\n<i>\"You can say no,\" she says in her sweet, breathy voice.</i>\n</p>\n<p>\n<i>He says no. He's never denied her anything before, and it brings him pain to do so when she looked forward to the event, but he's glad that she's so understanding.</i>\n</p>\n<p>\n<i>But the next day she climbs in his lap and asks again. Again, he says no. She kneels before him and takes down his trousers and sucks him off. She just wants to check if he’s certain, because she really wants to go. He is very certain. </i>\n</p>\n<p>\n<i> She sulks the next day, pouting like he’s broken her heart, and asks again. He answers the same, and she asks again as if she hadn’t heard him, because she just knows he would have a wonderful time if he came with her.</i>\n</p>\n<p>\n<i>Later in the week he thinks she's done asking, and he is relieved. But she takes to bringing it up subtly. It would be impossible for her to find someone else to go with, this close to the date, and she already had clothes made for him to wear, so he should probably just go with her. He’s being difficult for no reason, disregarding her feelings, by refusing to come.</i>\n</p>\n<p>\n<i> But of course he can say no. </i>\n</p>\n<p>\n<i>It would only make her very disappointed.</i>\n</p>\n<p>\n<i>And it's not just the banquet. it feels as though all his \"no's\" are wearing thinner over time, from how she thinks he should write more sonnets, how he should stay in more instead of gallavanting around town with his lute, and how he should be rougher when they make love because she likes it that way. </i>\n</p>\n<p>\n<i>He doesnt want any of those things. He doesn’t, he’s sure, but- then he isnt so sure. If he just agrees, just decides he wants what she wants, then she will stop asking. Maybe he doesn't mind, these requests aren't terribly demanding. He writes more sonnets, stays in more. But he doesn't want to go to the banquet.</i>\n</p>\n<p>\n<i> She doesn’t mean to hurt his feelings. He tells himself that often, because he loves her, and he’s well aware he’s an oversensitive person. He says yes to nearly everything, it's easier and it makes her happy.</i>\n</p>\n<p>\n<i>He could say no. For something really important he could, and she would listen. He could, he chooses not to. He could. He could. </i>\n</p>\n<p>\n<i>He goes to the banquet without a fuss.<br>\n</i>\n</p>\n<p> </p>\n<p>They move along, and the days drag on as Jaskier works to make his legs go far beyond their usual rate. He’s getting practiced at this, catching himself before he complains, only stopping for breaks when Geralt wants to. </p>\n<p>He has packed more food this time, and his book of plants, not wanting to subject himself to rationing again. He also took the time to buy a rabbit trap. So far this self sustaining food strategy has been wholly unsuccessful, since he doesn’t know how to use this damn rabbit trap and is awful at identifying plants, so he’s already halfway through his packed food. He is once again having bread for dinner each night, leaving him hungry and strung out in the mornings, even before they begin their daily trek.</p>\n<p>The extra weight is unwieldy. He’s always packed light, since they have always caught food on the trail. He finds his back aching more each minute. And Jaskier-loathe as he is to admit it- is lacking in bulk. It's hardly afternoon and he is wheezing as he concentrates on taking large steps to make up for how slowly he moves. </p>\n<p>Geralt glances at him frequently, probably thinking him weaker than ever, and probably thinking he doesn't notice his pitying stares. He needn't worry about it, Jaskier has got this handled, just a few thousand more steps and they'll stop.</p>\n<p>\"Do you want to take a break?\"</p>\n<p>He looks into those golden eyes, earnest and concerned, and remembers how he would do anything for him. Geralt may have said he could take his time, but he will show him how fast he can make it happen. The sooner he can make it feel normal, the better.</p>\n<p>\"Break?\" He passes off his breathlessness for laughter, \"I'm not some fragile bird, I'm up for a long walk or two, we’ve gone further ways than this,\" he taps his chin in thought. “Further ways… Summer days? ... I feel a song coming on.\"</p>\n<p>He doesn’t, he’s just changing the subject. He couldn’t sing if his life depended on it, can barely even take full breaths at the moment. Geralt stares at him blankly, like he's looking past his muttering and into his soul. Jaskier pointedly doesn’t notice him looking, though his ears go red at the scrutiny. </p>\n<p>Geralt decides they’re stopping only a half hour later anyway, claiming he’s heard running water they could drink from. Then he decides they should also make camp there. So Jaskier is glad he didn’t ask to stop, he will save his requests for if he <i>truly</i> needs it, like if he gets badly hurt, or the more likely scenario where Geralt is badly hurt but still keeps going because he is an idiot with no sense of care for himself. </p>\n<p>While Geralt searches out meat, Jaskier goes off to set up his trap and gather some herbs. The illustrations in the book are only sometimes helpful, as the artist was not very talented and he is no naturalist himself. But he manages to find some mint and fern heads to have with his dinner. Or, at this point, to <i>be</i> his dinner. He really doesn’t understand this rabbit trap thing, and nearly got it stuck on his own hand trying to put it out. As he returns Geralt has already built a fire and skinned his own dinner. He sighs and sinks down to rest his tired feet.</p>\n<p>Something is weird with Geralt. He's still in a mood, it seems, as he sulks by the fire and doesn't even sharpen his blades obsessively. </p>\n<p>\"Coin for your thoughts?\"</p>\n<p>He grunts. That's basically the response Jaskier had expected.</p>\n<p>\"I'll toss one to you,\" Geralt’s mouth forms an unimpressed line, and he cracks up at his own joke. He can't help it. A manic feeling has plucked at him urgently since this morning and it's not even very funny, but he laughs anyway.</p>\n<p>When he wipes his eyes and turns back to Geralt, he looks more settled, gently smiling into the fire. Jaskier tears a piece of mint and chews on it, content even as his stomach growls and his knees feel lamblike and wobbly.</p>\n<p> </p>\n<p>The next city they come across is much the opposite of the backwater rural area of before. This place is swarming with people, and as exciting as it is, he can tell Geralt absolutely hates it, glancing around like someone will attack any moment. He’s always like this in big crowds. It would be funny if he didn’t sympathize so much with <i>why.</i> They’ve bought ingredients for potions, and are on the way back to the inn. Geralt is nervous and wild. He takes pity and as they pass the marketplace he buys him a wide brimmed hat to hide his face, maybe that will keep the stares to a minimum for a semblance of comfort.</p>\n<p>He gasps in delight.</p>\n<p>“Geralt! Geralt, a puppy!”</p>\n<p>“Stay away from that before you-”</p>\n<p>But Jaskier is not listening, already coaxing the mangy creature over with a biscuit. The dog is massive, patches of fur missing from it’s face, where its lips hang low to reveal long yellow teeth. It’s limping, he notes, favoring it’s left paw.</p>\n<p>“Here boy! Come here cutie!” croons Jaskier, waving a piece of bread under it’s nose. It opens its mouth and bites down, jaws closing gently around Jaskiers wrist. </p>\n<p> Geralt stands tense, a hand on his sword, and Jaskier laughs as he pulls his hand loose from the dogs mouth to shake off the slobber.</p>\n<p>“Who’s a good boy? You are!” he reaches out to inspect it’s paw, but it backs away, snarling. It’s probably just afraid. He throws another chunk of bread, feeling a looming presence hover behind him. </p>\n<p>“Geralt, feel free to run along to the inn, I may be awhile at this.” Geralt doesn't want to watch him look at an injured dog in the middle of a crowd.</p>\n<p>Geralt gives a “hm,” hands still on his sword, and Jaskier turns back to his task with complete focus. The dog is skittish, but after several more pieces of bread it’s comfortable enough that he can pet it, and finally he coaxes it into lying its great big head in his lap so he can take a look at it’s paw. </p>\n<p>“Good boy, good boy. You have a splinter don’t you? Oh dear.” He kisses the dogs head. “Physician Jaskier on the case. And you’re assistant dog. Or I suppose you’d be the patient, actually, that’s stupid of me-”</p>\n<p>“Are you done roleplaying with the stray dog?” Geralt says from behind him. He startles, making the dog look up nervously. He hadn’t thought Geralt would still be here, and it’s a bit mortifying that he’s seen him talking to a dog. He tries to keep from talking to animals in front of him because of the inevitable teasing that would follow. Which would be fully hypocritical, because Geralt talks to Roach all the time. He swallows the swell of jealousy at their relationship because <i>really, Jaskier.</i></p>\n<p>“Somebody has to do it,” he mutters, and hands the dog another biscuit to distract him as he pulls out the splinter in his paw.<br>\nThe dog whimpers and he turns back to it, shushing it and trying in vain to unmat it’s fur. </p>\n<p>“We aren’t keeping it,” Geralt says sternly, but his soft, fond expression undercuts the words. Even Geralt can be stirred by a cute puppy, it seems. Though it’s not exactly cute. </p>\n<p>\"Of course not. It shouldn’t be bound to our lifestyle, it would get eaten in a heartbeat. It should be free to roam as it likes.\" He releases the dog and stands. \"Go, dog, live happily and splinter free!\" </p>\n<p>He wipes his hands on his trousers but will certainly still smell like dog for the forest of the day. Geralt’s fists are curled, a tell that he's upset, and Jaskier is about to suggest they go somewhere quiet when a familiar voice pierces the crowd.</p>\n<p>\"Julian? Is that you?\"</p>\n<p>Surely whoever it is means a different Julian, it's a big city after all. Jaskier keeps his head low, to no avail.</p>\n<p>\"It is you! By gods.\" A hand touches his shoulder, tugs him into the throng of people and he winces, spinning around to face-</p>\n<p>Baron Milton. Gods, he hasn't thought about him in years and would have much preferred to keep it that way. </p>\n<p>\"So good to run into you,\" he says with a winning smile.</p>\n<p>\"We must catch up.\"</p>\n<p>\"Actually, I was headed to do some important tasks, so I can't talk,\" the exhaustion from the past few days comes over him like a wave and he does not want to be here, but the Baron is tugging his arm to walk with him.</p>\n<p>\"Nonsense, there's plenty of time left in the day.\"</p>\n<p>\"I'm quite busy.\"</p>\n<p>\"I haven't seen you in years, spare a moment.\"</p>\n<p>\"But-\"</p>\n<p>\"I insist. I simply want to catch up with my old friend.\" Catch up. That’s a laugh. Milton wants talk to bring back with him, he wants to find out the gossip. \"You're still doing the… bard… thing, I take it?\"</p>\n<p>\"Yes, I'm still at it, I've gotten popular. Toss a coin, you know that one? That’s mine.\" </p>\n<p>He must be polite no matter what. He seems to have lost Geralt at some point in the interaction. He scans the crowd for his hair, and then curses himself for buying him that damned hat and making him harder to spot.</p>\n<p>\"Julian, <i>popular.</i> That’s something I never thought I’d hear. We were all so surprised when you ran off, it was the gossip for ages!\"</p>\n<p>He finally sees Geralt by a building with a nervous gleam in his eye, and waves him over frantically. Geralt comes with haste and evident relief, and Jaskier is relieved too, he knows he will be more at ease just by having him at his side for this conversation.</p>\n<p>\"Please, you make it seem so dramatic. And I was already the gossip long before that,\" he says carefully as Geralt comes to stand behind him. The Baron laughs.</p>\n<p>\"True. You were such an easy target, it was pathetic.\" Jaskier shuffles awkwardly, saying nothing, because he’s right. \"Oh, I'm only joking Julian, don't look like that.\"</p>\n<p>\"It's Jaskier,\" he corrects gently, feeling every bit the easy target he had been back then. Milton is never <i>only joking.</i> He always loved making fun of people, Jaskier especially, finding their weak spots and poking them. And every word of what he said was true. It’s what makes him such an effective gossip. \"We truly must be going.\"</p>\n<p>\"Too much of a star for my company? I seem to remember you weren’t so bigheaded when we were younger. Remember when we set a beehive on you as a prank? And afterward you <i>apologized.</i>\" he chuckles. Jaskier smiles, though he remembers it less than fondly. “Perhaps someone should put you in your place. Stay, come play for me for a few weeks, I demand you-\"</p>\n<p>\"He said he wants to go,\" snaps Geralt in an uncharacteristic display of impatience.</p>\n<p>Its then that the Baron seems to notice Geralt for the first time, standing behind him like a shadow, face shadowed by his stupid hat. Jaskier flushes, hating that he’s here. What if the Baron decides to regale them with more stories from their youth? He’ll sink into the floor and die.</p>\n<p>\"You have a bodyguard, the Baron says, impressed. “Can you afford that?”</p>\n<p>\"This is Geralt of Rivia. He’s not my bodyguard. Geralt, this is an...old friend,” he grits out. He will be embarrassed by his conduct later, since rudeness to nobles could cost him work in the future, but he is tired and severely <i>ready to go.</i></p>\n<p>“Pleasure to meet you, I’m sure. Julian, I want you to come play for me. The Countess de Stael speaks highly of you, I want to see for myself that you’re competent at something.\"</p>\n<p>\"Give the Countess my regards,\" he says.</p>\n<p>\"I must say I’m surprised you're not crawling back to her again, the way she had you trained at her beck and call,\" he laughs again, the laugh of a close friend sharing an inside joke, and turns to Geralt. \"Is he the same way with you? Obedient?\"</p>\n<p>Annoyance blooms in his gut at the implication and the fact that he dares to address Geralt at all. </p>\n<p>\"He's not a pet. He does what he pleases,\" Geralt says evenly. </p>\n<p>He meets the Barons eyes and Jaskier pinpoints the moment he sees the yellow eyes and the white hair tucked beneath the hat.</p>\n<p>\"Julian,\" he grabs him by the arm and tugs him aside as if he foolishly thinks Geralt can’t hear them. \"Are you mad? Surely even you know your life is at stake if you travel with… if you don't obey the beast, he might-\"</p>\n<p>“Might what?” he says in a warning tone. “I’ve known him for years, and he treats me well. Have you seriously not heard any of my music at all?\"</p>\n<p>“Come with me instead. You know those things aren’t people.”</p>\n<p>“Shut up,” he glances at Geralt, who is back to glaring suspiciously at bystanders and pretending he can’t hear every word of their conversation. Jaskier tugs his arm out of the Baron’s grasp.</p>\n<p>“It’s not your<i> friend,</i> at any moment it could snap and-”</p>\n<p>He punches him in the jaw before he can finish whatever dehumanizing suggestion he would have made, and the people around them gasp as Geralt lifts him by the armpits and drags him away as he squirms to try and get another hit. </p>\n<p>He doubts the Baron will give his regards to the Countess after all.</p>\n<p> </p>\n<p>\"I hate him, I hate him, I hate him,\" he rants, back at the inn. He turns to Geralt, incensed. \"I hate that people think they can say shit like that right in front of you!\"</p>\n<p>\"He did try to whisper.\"</p>\n<p>\"Hardly relevant! Don't make excuses for him. What a prick. I know I've said it many times before but people<i> cannot </i>talk about you like that, if they do you come get me right away.\"</p>\n<p>This is one place Jaskier knows he is useful. Jaskier can hit someone with fewer reputational consequences, and he is proud to say he has hit many people who deserved it. It seems no amount of music can sway idiocy. Nor can fists, but at least he might have a broken nose. Gods, he hopes the idiot doesn’t send someone to draw and quarter him.</p>\n<p>\"He wasn't exactly polite to you either, and you didn't hit him over it,\" he says, and Jaskier looks at the floor, remembering that Geralt had heard all of that. Great, now Geralt knows that even when he was young and rich he couldn’t make people like him. </p>\n<p>\"Yes, well.\"</p>\n<p>He sits pensively in the chair, good mood thoroughly drained. He feels Geralt’s eyes on him, and then Geralt gets up silently and leaves.</p>\n<p> He stews for awhile and goes to his room for a long nap. He wakes to Geralt shaking his shoulder.</p>\n<p>\"Got a contract. Get ready, you're coming.\"</p>\n<p>He sputters as he is ungraciously yanked to follow Geralt to his room. </p>\n<p>\"You didn’t have to drag me, I'd have come willingly!\"</p>\n<p>He does look a little ashamed at that, crossing his arms defensively.</p>\n<p>\"I need you along in case of-\" his last words are muffled as he reaches under the bed for his supplies. </p>\n<p>\"In case of what?\"</p>\n<p>\"Just... in case.\"</p>\n<p>“Oh, well, if it’s in <i>case,</i>” he scoffs, the discomfort from earlier melting away at the thought of being asked along to spend time together. He’s well aware how ridiculous that is, they’ve been together for decades and he still gets as excited to go out as the first time. </p>\n<p> He gets his coat.</p>\n<p>\n<i>Jaskier stretches out with a groan, waking earlier than dawn. He must get ready. He is booked to play in court for a celebration day. </i>\n</p>\n<p>\n<i>His stomach roils inconveniently, and his forehead is covered in a thin sheen of sweat, chills wracking him even under blankets. He does not want to get up, but he must.</i>\n</p>\n<p>\n<i>He sits up carefully. It is important that he attend today. They have offered to pay him generously. The Countess will be there and she has told him in no uncertain terms that she will be proud of him if he performs well in front of her friends. Besides, it's not so hard, all he has to do is show up and play and- </i>\n</p>\n<p>\n<i>He pitches out of bed and vomits into a pot.</i>\n</p>\n<p>\n<i>That’s alright, that’s good. Now he’s got it out of his system. Staying home is not an option, the Countess hates his excuses and he wants to do well today. No one would believe that he's sick, they would say he's lazy, hungover, trying to stay home rather than work. He knows what they would say, and how they love to gossip. He puts on his shirt and gets ready.</i>\n</p>\n<p>\n<i> </i>\n</p>\n<p>\n<i>He arrives late, palms drenched in sweat and his face pallid, despite his best efforts at looking decent. He's lead in by the servants as they busy themselves preparing food and tables and chairs. The servants enquire about his state, but he waves them off, citing pre-show nerves. As if he would get nervous before performing. Hes fantastic at it. It's the only thing he knows how to do right. He ignores the stomachache. It's only temporary pain, if he ignores it now he can let himself feel it properly tonight, deal with it where no one can see.</i>\n</p>\n<p>\n<i>It's time. He steps out into the center of everything and ripe nausea swirls through him afresh. He shoves it down again, opens his mouth to sing, and snaps it shut as his stomach twists painfully, not allowing him to ignore it. The people stare at him, waiting. He can salvage this.</i>\n</p>\n<p>\n<i>\"Forgive me, I-\" </i>\n</p>\n<p>\n<i>He throws up, unable to hold it in anymore. Humiliation rips through him with the nausea, and his arms are grabbed before hes even finished dry heaving onto the floor.</i>\n</p>\n<p>\n<i>“Drunk already? We haven't even begun the ceremonies,” hisses the servant as he drags him into a side room and slams the door.</i>\n</p>\n<p>\n<i>He doesn't bother denying it. Hes in deep shit either way. The Countess saw him, of that he is certain, and so did her friends and every person in the room and what could possibly be worse? The servant is angry too, and he feels terrible. They've spent all day working to make the event perfect and Jaskier has ruined it. He shakes him.</i>\n</p>\n<p>\n<i>\"Answer me, are you drunk?\"</i>\n</p>\n<p>\n<i>\"He isnt,\" says a kitchen servant who had led him in before. \"He's got nerves.\"</i>\n</p>\n<p>\n<i>\"Is that true?\"</i>\n</p>\n<p>\n<i>“No,” he groans, grateful for the dim light as he sags against the wall. “I’ve been ill since morning.\" </i>\n</p>\n<p>\n<i>The mans face goes from furious to concerned, and he tells the other servant to fetch some water.</i>\n</p>\n<p>\n<i>“Why on earth didn’t you <i>say</i> anything?\"</i>\n</p>\n<p>\n<i>He blinks. How could he? What could he have said that would make anything different, when his words have no meaning and no’s slip easily into yes’s, and explanations into pathetic excuses? He attempts to answer, but his stomach betrays him, and he’s vomiting again. Of all the days to be sick.</i>\n</p>\n<p>\n<i>Everyone is going to be so disappointed in him.<br>\n</i>\n</p>\n<p> </p>\n<p>He doesn't expect a good view of the fight, as he's been instructed to keep his distance. But it's been years since he could truly say he came along to watch, he's seen enough to write songs the rest of his life from the safety of his bed. It's not about that.</p>\n<p> It's about the aftermath, when Geralt is hurt from the attack or beating himself up for not doing enough. It's a matter of being there for Geralt when no one else is, for the hard parts he shouldn't have to see through by himself.</p>\n<p>He strokes Roach’s mane idly, trying to keep quiet. It’s almost too quiet. He can hear Geralt in the distance, and thanks his stars he doesn’t have to fight monsters himself to make a living. He hasn’t the upper arm strength for it. </p>\n<p>They're being loud, if he can hear them from here. The Kikimore is no doubt doing something terrifying and vicious, and Geralt is no doubt deflecting it with majestic ease, muscles glittering with sweat. Jaskier concedes that there may be a point to his attendance besides just the aftermath. It wouldn't hurt to get just a little closer, would it? Just for a peek.</p>\n<p>“Stay here, Roach.”</p>\n<p>She snorts in protest, so like Geralt, and he pats her nose. “I’ll be back, I’m just getting a better vantage point.”</p>\n<p>He climbs up the ridge to look over, making more noise than he had hoped as his feet find every twig on the ground, in a cacophony of crunches. Just as he catches a glimpse of white hair over the edge, he is struck across the back by something heavy and tumbles backward with a gasp, catching himself on a branch. He turns to his attacker.</p>\n<p>Another Kikimore. Fuck. </p>\n<p>He scrambles back and takes out his knife, praying it will be enough to hold it off. From experience, he knows it won't. </p>\n<p>“Geralt!”</p>\n<p> Jaskier is so stupid, he shouldn’t have come so close. Geralt will be angry when they make it out of this, and they <i>will,</i> they have a thousand times, he forces himself to believe it even as his heart rate skyrockets, as the Kikimore launches itself at him and he holds up the knife with his eyes squeezed tightly shut-</p>\n<p>And he doesn’t die.</p>\n<p>Cracking his eye, Geralt stands over him, the Kikimore slain by his blade. When he turns to him, there is somehow no anger in his eyes. </p>\n<p>“You found the other one,” he says, and it's so banal that Jaskier can't help but laugh.</p>\n<p> He runs a hand through his hair, still alive, and shakes it off as he steadies himself. It's not the first time he's skirted death, and it hopefully won't be the last. He must owe Geralt his life seventeen times over, at least. Each time it feels strangely anticlimactic.</p>\n<p>“I guess I did, seems I’ve made a damsel of myself yet again. I'm sorry. Where are you hurt?” Down to business, he spots the blood that seeps through Geralt's clothes. </p>\n<p>“Stomach, I can reach it.” Jaskier frowns. If he tends it himself, Jaskier came along for… what, to keep him company? To get hurt himself when he should have stayed back?</p>\n<p>\"I realize I'm generally useless out here, but that's one thing I can do,\" he says lightly. </p>\n<p>\"Are you fishing for compliments?\"</p>\n<p>\"What? No! I know you'd never compliment me outright.\"</p>\n<p>Geralt raises an unimpressed brow. \"You aren't useless. Otherwise I wouldn't have brought you.\"</p>\n<p>“You really think so?” He smiles into his palm, giddy at the encouragement. “Why did you bring me?”</p>\n<p>“You didn't come on the last one.”</p>\n<p>He just looks at him. Obviously he didn't come, Geralt didn't want him to come. </p>\n<p>Geralt clears his throat awkwardly and continues. </p>\n<p>“I thought it would cheer you up.” He looks at the ground. Jaskier can't help but smile at how charming an action it is, how sweet of Geralt to do such a kind thing. </p>\n<p>But then his face falls again, because he mucked it up by being a complete hindrance when this would have been a perfect opportunity to do as he was asked.</p>\n<p>“Let me stitch it then.” He’ll show Geralt it was worth it after all, to let him be here. This is where he excels, anyway.</p>\n<p>He stands abruptly, and nearly falls down from the shock of pain that runs through him. Glancing over his shoulder a well of red blooms over the torn fabric of his trousers, a slash across the back of his thigh. Geralt looks on with a furrowed brow; he's smelled the blood too.</p>\n<p>“Just a scrape,” he says lightly, and stiffly makes his way to Geralt to sit beside him and sew him up.</p>\n<p>“I’ll clean it for-”</p>\n<p>“No!” he says, sharper than necessary. “I can dress it myself.” </p>\n<p>Geralt doesn't say another word to him as he cleans and stitches him up with care, and quickly packs his own wound with herbs.</p>\n<p> However, Jaskier does continue to talk to him throughout the process, scolding him as he finds another wound on his side that he hadn't mentioned, as if Jaskier wouldn't find it anyway. Really, the nerve. </p>\n<p>They make their slow way back, Geralt riding Roach to keep from aggravating his injuries, and Jaskier proceeding on foot. </p>\n<p>He walks gingerly. More than the sting, he hates how the blood feels as it trickles down his leg, like he’s wetting himself very slowly. It's a gross feeling. But it really is just a scratch, sort of. Mostly. He can tend it on his own when they get back. </p>\n<p>“I appreciated your help tonight,” Geralt says. Jaskier blinks and rights himself.</p>\n<p>“Let it be known, Geralt of Rivia appreciates me! That one will make it into a song, for sure.” </p>\n<p>“I’m trying to-” he rubs his forehead. “You're not useless. I'm thanking you. Don't be a brat about it.\"</p>\n<p>\"I don't need thanks for that, I'd do anything for you, you must know that,\" he says, too earnest. But Geralt must know that he is cared for, it is crucial; even though the feelings aren't returned. \"It's nothing at all.\"</p>\n<p>Geralt's eyes sharpen like some great puzzle has revealed a piece to him.</p>\n<p>\"When that Baron said-\"</p>\n<p>\"Can we not bring up that little incident?\" He laughs nervously, knuckles still swollen from the ordeal. \"I can't stand that bastard, he is a buffoon and rude and a liar. End of story.\"</p>\n<p>Geralt doesn't answer, but that strange expression doesn't leave his face either, and Jaskier doesn't like it one bit.</p>\n<p>Its several days after they've left the city that he begins to worry about the scratch. Its deep, but it’s thin, and will certainly heal over without any bad scarring, as much as it hurts to move his leg in some angles. So he tells Geralt it’s fine, and leaves it be. </p>\n<p>But after a few days on the road, he starts to be concerned.</p>\n<p>He’s hot. His forehead is sticky with sweat, and his nostrils flare on every breath, heavy with the sweet smell of sickness. His thigh throbs, searing and puffy, and that… isnt good.</p>\n<p>He stumbles in his dizziness. He doesn't catch his lute in time, and time slows like thick soup as it hits ground. </p>\n<p>\"My lute,\" he says, forlorn. It sounds distant, like he’s watching this unfold from behind a veil.</p>\n<p>He attempts to sit up, but his head is heavy and everything’s syrup. He makes his way over and cradles it in his arms to caress the small scratch, shallow and tiny, but a blemish nonetheless. He holds the poor thing, and rocks it, soothing it. </p>\n<p>Geralt's hand reaches out, offering a hand up, but his shaky legs won't cooperate. He needs to get up, he can’t waste a request to stop now- he needs to save it for a time he really needs it. He can get up, if he just tries harder. He jerks at his legs to rouse them, frantically attempting to stand, but he cant seem to get his balance. </p>\n<p>\"I'm sorry,\" he pleads. He hates this, he's going to have to ask, to whine. \"Can we stop-just for a little while?\"</p>\n<p>There's no way Geralt will be happy about a delay, especially once he realizes Jaskier is also ill. If he hasn't already. He'll make a jab at how inconsiderate it was for him to get hurt, but he will help Jaskier up anyway. He braces himself for the flash of irritation sure to come, and tries once again to gather strength and pull himself up. Geralt doesn’t say anything, just takes his hand to steady him.</p>\n<p>\"I can keep going, on second thought-\"</p>\n<p>\"Shut up, Jaskier,\" Geralt says bluntly. His jaw clicks shut. They’re not stopping, then. He strains, and finally makes his quivering way back to standing, breathing heavily and probably clutching too tightly at Geralts hand as it holds his weight. He feels shaky but he can walk, probably. He'll have to.</p>\n<p>Yet, Roach is stopped, and Geralt brings his arm to hold him beneath the armpits, half carrying him to sit beside the road. </p>\n<p>\"You're burning up,\" he says, laying a calloused hand across his forehead again and Jaskier is going <i>insane</i>. He needs Geralt to go away for awhile so he can deal with this himself. A splash of water and a fresh bandaging should clear him up well enough until he can make it to an apothecary. This is no time for Geralt to indulge Jaskier’s overly sensitive dramatics, a little cut in the leg is hardly worth all this attention.</p>\n<p>But a feverish part of Jaskier wants to lean up and kiss his hand. Geralt would hate that, he's allergic to Jaskiers affection. Maybe it would get him to back off, though.</p>\n<p>Jaskier shrugs, trying not to go to sleep against the tree, and trying to remember whatever Geralt just said.</p>\n<p>“Burning up?… No, it’s cold.” He sways to the side and Geralt catches him, rights him and does not remove his hand from his back, where it feels like it's burning a hole in him, holding him tenuously to reality. But he doesn’t lean up and kiss his hand, and he’s proud of that achievement. Geralt will appreciate it.</p>\n<p>\"Are you proud?\" He must be. if this isn't enough Jaskier doesnt know what he'll do. He's trying so hard. </p>\n<p>Geralt nods indulgently, still focused on the wound, shoulders taut like hes angry. But his fingers are cool and gentle where they prod at the wound, and Jaskier relaxes, because he <i>is</i> proud of him, and Jaskier gets to <i>rest</i> for a moment, and its glorious. </p>\n<p>“I’m sorry, I think I might have a fever. I didn’t mean to have one, but I cant really help it right now, I think. Everythings fuzzy. Do you…\" he stops, blinking.</p>\n<p>“Do I what?”</p>\n<p>“What?\" He blinks again, as he has forgotten what they were talking about. \"Where’s my horse, her name is… and I...” he trails off, confused. \"I can’t remember her name.\"</p>\n<p>“You don’t have a horse,” he says, tucking Jaskiers head against his neck with such tenderness Jaskier knows he is dreaming. He apologizes again, just in case, though he's not sure if he actually verbalizes the apology. He snuggles into his shoulder and sighs. </p>\n<p>Geralt's hand is too cool on his skin and his movements are too patient. It's all wrong, he's sick to his stomach. He’s drowning in sweat. Something is eating him alive, he needs help. He shivers, can't stop shivering. </p>\n<p>\"I'm going to get water.” He moves to get up and follow, but is set back down against the tree. “Stay. Roach, you're in charge.\" </p>\n<p>He laughs weakly. He <i>knew</i> he talked to Roach. He knew it. </p>\n<p> </p>\n<p>He wakes and the first thing he notices is the <i>dampness.</i> He is drenched in sweat, covered in blankets head to toe and lying by a crackling fire. He hisses as his thigh throbs in protest, hot and swollen under carefully wrapped bandages. Geralts bag sits open beside him, some of the bottles open, and is that Geralts fancy salve? The expensive one?\nHe groans as another wave of pain hits, and Geralt is over in an instant, sitting him back down and passing him a waterskin, which he accepts gratefully. </p>\n<p>\"Why didnt you tell me you had a fucking infection?\" Great, he’s already starting in on him. Not so much as a ‘hello, how are you.’ Typical.</p>\n<p>\"I thought I could handle it.\"</p>\n<p>\"Why?\"</p>\n<p>He feels a rare bout of self righteousness but through him. \"Why? You think I cant handle myself?\" He breathes heavily, from the strain of working himself up and the truth. He does need Geralt. This has shown, if nothing else, that he <i>cant </i>handle taking care of himself. The fight leaves him. \"I got myself hurt. I thought I could deal with the consequences myself.</p>\n<p>\"Obviously you fucking couldn’t,” he snarls. Jaskier closes his eyes. He doesn't want to see how angry he is. “Just because you want distance between us doesn't mean you can-\" He runs a frustrated hand over his face. “I'm leaving you in the next town.\"</p>\n<p>\"But-\"</p>\n<p>\"This clearly isn’t working.\"</p>\n<p>He doesn't know what comes over him, but he's sticky and hot and starving, exhausted to his very bones, and now Geralt is going to <i>leave him</i>. Nothing makes sense to his foggy head, but he knows it’s not fair. Sure, he had fucked up a few times with the hunt and now with this, but he's improving at so many other things! He doesn't know what to do with himself, and now Geralt is saying-</p>\n<p>He wills away tears and he looks him in the eye, face flushed. </p>\n<p>“Please, I'm trying” he manages. \"Let me come with you.\"</p>\n<p>“It's obvious you don’t even <i>want</i> to,” he barks. \"Don't drag this out.\" </p>\n<p>And he must still be feverish, because that makes <i>absolutely no sense.</i></p>\n<p>\n<i>“You know, you’re nothing like I expected.”</i>\n</p>\n<p>\n<i>He tries to stay casual, glances nervously to where the stableboy swings his legs off the railing. He’s taken to sneaking out at night to go sing and talk to people and see the sights, before climbing back in the window at dawn. Tonight he is visiting the stables to befriend the horses and their keepers.</i>\n</p>\n<p>\n<i>“What do you mean?”</i>\n</p>\n<p>\n<i>“You're Pankratz, yeah? The one everyone says is a bumbling idiot who don't do his duties?” He nods, cheeks reddening. Everyone has heard the gossip, it seems. He could reprimand the boy for insolence, but he can see that his inhibitions are loosened from drink, and besides, he only speaks the truth. </i>\n</p>\n<p>\n<i>The boy hiccups. “I don’t think you’re so bad.”</i>\n</p>\n<p>\n<i>“You don't?”</i>\n</p>\n<p>\n<i>“Nah. Or…” he reconsiders, and Jaskiers smile goes stiff. “You’re not a good viscount, they’re right on that count. But you’re a nice lad. You play that thing like nobody I've ever seen.” He gestures to the lute. “Whats it matter what I think? Or anybody? Screw 'em, you got a lot of talent, don’t matter what nobody says.”</i>\n</p>\n<p>\n<i>“You really think so,” he says, tentative. \"You think I'm good enough to be a performer?\"</i>\n</p>\n<p>\n<i>“Sure. Could make a fine coin off it probably.\" He takes a swig from his flask. Jaskier thinks he’s probably too young to be drinking, but he doesn’t want to say anything and risk running off someone who thinks he has talent. Who thinks he’s nice, and thinks that he could make it with that alone.</i>\n</p>\n<p>\n<i>No one has ever told him that before. Something tilts inside him irrevocably, like a final weight placed on a scale so one arm sinks and the other rises high. The boy sees his dazed expression and passes the flask wordlessly. Jaskier drinks, head swirling with possibilities.</i>\n</p>\n<p>\n<i> When he looks back on this night a month or year or decade later, he will pinpoint it as the moment his life really, truly started. </i>\n</p>\n<p> </p>\n<p>The silence holds taut for a long moment, and then at once it snaps. </p>\n<p>“Why would I <i>want</i> to be left?!”</p>\n<p>\"You've been distancing yourself.\" </p>\n<p>He says it like an accusation. Have they not discussed this? He knows what Jaskier wants, if Jaskier <i>wanted</i> them to part he would have put an end to this charade ages ago. But he could never want that. He doesn't know what to say that will make any difference in Geralts verdict, wipe away the frustration that comes off Geralt in waves as he continues to speak.</p>\n<p>“You said-” He looks terribly young as he says it, unsure. \"I didn’t expect immediate forgiveness. I thought you were working on it- but that doesn't mean you should force yourself to be near me when it's clear you can’t stand it.\"</p>\n<p>Geralt's words aren't exactly matching up, but it's likely the fever muddling his mind. He can fix it, Geralt just needs to let him. </p>\n<p>“I’ve been trying-”</p>\n<p>“Shut up.”</p>\n<p>“Don't leave me behind. I’ll try harder, I’ll… I’ll stop talking, whatever you want, is that what you want? I’ll...” He wracks his brain for more ideas.</p>\n<p>“Shut up, you're not making any sense.\" He puts his hand of Jaskiers forehead again and he hates that he flinches.</p>\n<p>\"I'm not feverish.\" Not much, anyway, but he means what he says with absolute, cutting clarity even if it feels like what little filter he had has been torn out. “If you leave me I’ll follow you anyway, I’ll prove to you that I can be worth having around. I fucking <i>swear.</i>\"</p>\n<p>Geralt retrieves a rag and dampens it with the waterskin.</p>\n<p>“Worth having? Did someone say something to you?” His eyes narrow. “That idiot from the other day.” </p>\n<p>\"Yes- No!,\" he says, fixing him with an incredulous look, \"This has nothing to do with him. We talked about this, you and me, about why you shouldn’t leave me behind even though I’m such a terrible companion.” He grimaces. This is perhaps not a good time to remind him of why he thought that in the first place. “Like I said, I'm working on it,\" He finishes hastily, with a dismissive wave that looks more confident than it feels.</p>\n<p>\"Jaskier,\" he says with something dawning in his eyes. \"What did you mean by 'work on it?'\"</p>\n<p>\"We talked about this, you know!\"</p>\n<p>\"Pretend I don't. Humor me.\"</p>\n<p>\"I'm just working to be a better version of myself. I know you've told me you don’t like me many times over the years, but it didn't click until that day when… you know.” he swallows the lump in his throat. This is meant to be a plea to keep him but it feels more like an excuse than anything, because he failed, and the excuses will be just another reason for Geralt to be disgusted by him. “I'm getting there, I’ve been trying to not be such an inconvenience. Staying out of your things, not being so annoying, keeping out of your space. I know I haven't done a great job of it but I've only been at it a few weeks-\"</p>\n<p>“That is not what we talked about,\" Geralt chokes, eyes wide and clutching the damp rag so hard the water runs in fast rivulets to the dust below.</p>\n<p>“What?”</p>\n<p>\"You needed time to forgive me\" he says hoarsely. \"You thought I meant- but I apologized.\" He says it like he's trying to convince himself, a gutted look on his face that shouldn't be there. \"You're no inconvenience to me.\"</p>\n<p>Jaskier wants to scream with frustration. How can he say that? It doesn't make sense, doesn't fit into the finely knit fibers of reality, the groundwork of his life where the very foundation screams that this is impossible. How can it be true? Geralt wouldn't lie to him, but how can he possibly mean that?</p>\n<p>\"Don't say that. I don't know what you want from me,\" he sits, running a hand frantically through his hair and taking gulping breaths. He will not cry. His tender, weak heart is what got him in this mess in the first place and he will not indulge it. \"What do you <i>want </i>from me?\"</p>\n<p>None of this makes sense, it doesn't make sense as Geralt kneels before him, or as he touches his shoulder cautiously, or as he speaks quietly, too close for someone who should be angry. </p>\n<p>\"I want you to be happy.\"</p>\n<p>Jaskier shuffles under the blankets. He is happy. Being around Geralt makes him happy. Geralt doesn't want him to be upset, because he thinks he's useful and he cares about him, and didn't mean it when he said- no, he just can't believe it.</p>\n<p>“Don't make me go.\"</p>\n<p>\"I won't.\"</p>\n<p>\"But you said-\"</p>\n<p>\"Because you've been miserable. I'm making you miserable, it makes sense you’d want to...”</p>\n<p>\"Never,\" he interrupts. Even if he is left, it is crucial that Geralt know he doesn't want to go, that whether he likes Jaskier or not, Jaskier is loyal to him. But he says he is not going to leave. Jaskier wants to believe everything he says, but he can't, his garbled mind mixing the past and present and Geralt isn't speaking, it's <i>the Countess, and his parents and his childhood friends and his lovers, and he can hardly hear Geralt over their disapproving words overlapping against his skull, and he wants to throw up.</i></p>\n<p>\"We're going to have to...talk,\" Geralt says gruffly, \"about this.”</p>\n<p>Jaskiers head reels, overwhelmed. He feels the blood drain from his face as wooziness returns, which is bad timing because he really, really needs to know how this conversation ends, needs to know-</p>\n<p>But he finds his eyes fluttering closed. Geralt seems to notice this, as he follows up with a sigh. </p>\n<p>“We’ll talk more when you’re not out of your mind. Sleep.\"</p>\n<p>“And you won’t leave me?”</p>\n<p>“No.”</p>\n<p>“I can't believe that,\" he admits, though it is hard to focus on the conversation.</p>\n<p>“We’ll work on it,” he says, and it's too gentle. This can't be his life. Geralt lays a hand on his head again, and the other on his side to guide him into lying on the bedroll. </p>\n<p>A damp rag finds its way to his forehead and he knows he has not been left just yet, even as uneasy, feverish dreams overtake him.</p>\n<p>He doesn't know what Geralt meant by ‘work on it,’ because all he had done was work on it up until that harrowing discussion that he only half remembers when he wakes again, fever blessedly broken. And Geralt says nothing about it throughout packing their things in the morning. He says nothing as they walk down the road, Jaskier on Roach to avoid strain. So Jaskier thinks they won't talk about it anymore after all.</p>\n<p>But apparently 'working on it' entails catching Jaskier off guard with strange bouts of awkward confessions followed by silence, as he finds when they settle down to eat dinner.</p>\n<p>Geralt thrusts a cooked squirrel at him with more force than strictly necessary. </p>\n<p>“Eat.” He speaks before Jaskier can even open his mouth to protest. “All of it.”</p>\n<p>He takes the meat and scowls, but his heart isn't in it, because it smells amazing and he <i>did</i> tell him to eat it. Of course Geralt isn't going to talk about this the normal way. He takes a bite, and Geralt watches him like a hawk, as if he’s going to try and throw it away when Geralt isn't looking, or something foolish like that. He turns away only to rifle through his bag and take out a small jar to sit beside Jaskiers bread. </p>\n<p>They sit in silence for a while. Jaskier doesn’t speak for his full mouth, and for the fact that Geralt is wearing his expression that means he has something to say. Finally, he speaks, rough and bashful like he’s dredging up some dark secret that should have remained hidden.</p>\n<p>\"I don't even like jam.\"</p>\n<p>He goes quiet again and Jaskier swallows.</p>\n<p>\"Okay-\"</p>\n<p>\" I only get it because I know you'll find and eat it when you go through my things.\"</p>\n<p>“You don’t think it's sort of… invasive of your space? What if I got into something I shouldn’t and fucked it up?”</p>\n<p>“I like it,” he admits, avoiding his gaze. “I trust you not to fuck up.”</p>\n<p>He knows Geralt would normally rather choke on his own tongue than talk about his feelings, and he looks so <i>small,</i> struggling to admit that he actually <i>likes</i> something Jaskier does, especially something with no actual benefit to Geralt. And <i>no one,</i> much less Geralt, goes out of their way like that for Jaskier unless they want something in return. Jaskiers heart softens. He's making an effort.</p>\n<p>That’s… different. He recalls what Geralt said before, how he doesn’t think Jaskier an inconvenience, a concept he can’t exactly wrap his head around. Even when he had thought the two of them friends for all those years, he had always known he was inconvenient and grating. Yet here Geralt is, admitting to doing a kindness for him without asking anything in return. People don’t just... and Geralt <i>likes</i> that he stole his jam, he left it out just for him, he <i>wants</i> him to eat the food he cooked. He’s definitely never said anything nice like that in all their years together, usually glaring like he thinks the words magically transfer to Jaskier.</p>\n<p>It makes him feel special, like perhaps he's more than an afterthought, something precious. He fumbles for a proper reply and comes up lacking, his tongue unable to quantify the stumbling, open uncertainty that floods him now, and decides to put the feeling away to obsess over later in private.</p>\n<p>\"That's odd, Geralt, you’re being awfully weird tonight. You like a jam thief? Say it aloud.\"</p>\n<p>\"I love a jam thief,\" he says in a monotone, faking a put-upon sign. Jaskier claps in delight at the ridiculous string of words that have exited Geralt's mouth. But Geralt's voice is heavy with meaning, and his eyes lock with Jaskiers, and the warm, uncertain weight hits him again. They speak with their eyes and he tries to understand and be understood wordlessly.</p>\n<p>How easily he could lean forward just so and reach up to trace his face with a hand, or to be held in reassurance. </p>\n<p>But he can’t. This is fragile. If he reaches across the space now, he doesn’t know if Geralt will reach back. He doesn’t know what he would do if he managed to break this after everything, if it turned out it's all as thin as Geralt pretends it's not as they move on.</p>\n<p> </p>\n<p>Geralt pays for one room, looking Jaskier in the eye as if waiting for him to object. Jaskier plays late into the night, stomach clenching at what Geralt might say. Whether he will continue the charade or not.</p>\n<p>When he is finished he comes in quietly, so as not to wake him. Of course, this fails, because of his stupid excellent hearing, and Geralt looks up and smiles a nervous smile as if he is the one with something to be nervous about. </p>\n<p>Jaskier strips down to his smallclothes and lies tentatively at the edge of the bed, still as a board, afraid to cross that vast, insurmountable 2-inch space between them. </p>\n<p>Geralt crosses it for him, rolling over until they touch.</p>\n<p>They curl together and Geralt does not say a word about coin, just presses into his side like he belongs there, heavy and firm with muscle, breath tickling his ear. This feels robust, unyielding. He doesn't know anymore what is real and what is pretend.</p>\n<p> </p>\n<p>Weeks pass and they find themselves passing through towns and once again, Jaskier finishes a night of song, chugging water for his sore throat and making his way to Geralt at the back table and having a sip of his ale.</p>\n<p>\"How was my singing?\" He asks teasingly, fully expecting a dry, sarcastic retort. He tells himself he wouldn’t mind, after all he hadn't truly minded his teasing before all this mess. </p>\n<p>But it's not strictly true. He thinks it will take some time before he can hear that kind of thing from Geralt without taking it seriously. Geralt seems to realize this as well, because he looks conflicted. Jaskier can see the moment he chooses to hold his tongue.</p>\n<p>\"Good.\"</p>\n<p>\"You don’t have to say that just because we’re friends now.\" He loves how the word tastes on his tongue. Friends. Geralt had said it during one of his weird blurting-out-nice-things sessions. And he hardly wants Geralt to start pretending with him, and change himself just to appease Jaskier about his music. \"You could say you hate it, joking or not, I know you don't mean it rudely.\" </p>\n<p>\"It hurts your feelings.\"</p>\n<p>He takes a seat beside him, not bothering to deny it. </p>\n<p>“I’m hardly going to get on your case, it's not your fault I can't take a joke.\"</p>\n<p>\"Whose fault is it?\" Geralt asks sharply.</p>\n<p><i>Mine,</i> he wants to say. Geralt would hate that answer, they've had this conversation before in half-measures these past weeks, with him dancing around Geralt's stilted, endearing attempts at getting him to open up. </p>\n<p>He wants to open up, but it's not a big deal and he can only manage fragments at a time, aware that he can be a bit much once he gets started telling a long story. And Geralt acts like someone has hurt him irrevocably, like he was abused, which is completely untrue. Geralt of all people must know that a few rude words hardly qualifies as abuse. He met the Baron, the man is too scrawny to do much damage.</p>\n<p>Still, it has caused a noticeable bump in the road, and Geralt deems it worth talking about.</p>\n<p>He doesn't know whose fault it is that he is this way, that he is hard to like. It feels like a simple fact of life, something he has always inherently known, which has sculpted every facet of his life. \"It doesn't matter.\"</p>\n<p>Geralt makes a noise of disapproval and leans back, unsatisfied. </p>\n<p>\"Tell me anyway.\"</p>\n<p>The sounds of the tavern drown them out and he relaxes, because he can pretend no one is here to hear, that he is talking only to himself.</p>\n<p>\"I dont know. It's always been like this, no one ever- before I became a bard, no one liked me, even my friends.\"</p>\n<p>\"The Baron.\"</p>\n<p>\"I… yes, when we were younger.\" he admits. \"It was just silly pranks, and teasing-\"</p>\n<p>\"Setting bees on you, I recall.\"</p>\n<p>Oh, he remembers that, does he?</p>\n<p>\"It was only once and it was an accident… well in hindsight, maybe it wasn't, but that wasn't all that bad. Doesn't matter. Usually it was other things, and it wasn't always him, it was just something everyone did. A game. I didn't exactly say no to playing it,\" he laughs.</p>\n<p>\"Did you say yes?\"</p>\n<p>He rolls his eyes and shrugs dramatically, not answering. It's long past. It wasn't a big deal, they told him then. It doesn't even bother him, he tells himself now.</p>\n<p>“Hm.\" He avoids Geralt's eyes, uncomfortable at his disbelieving tone. It had seemed alright at the time. He was used to it. \"I could easily kill him,\" he says darkly. </p>\n<p>\"No, don't.\" He's ready to argue if necessary, because he knows Geralt would do it if he thought Jaskier wanted it. Because Geralt cares about him, somehow, has said so countless times recently and he's starting to reluctantly believe it. And as much as he dislikes the man, he doesn't want him dead. Geralt could easily decide it’s best and growl him into agreement. Or do it anyway. But Geralt only nods.</p>\n<p>\"Let me know if you change your mind.”</p>\n<p>He waits for Geralt to push it, because his hands are still tight around the mug, itching to fight, to take out his restless energy on something. Jaskier knows that when he gets into a mood like this, only a fight can take the edge off. And he knows that Geralt thinks the Baron is a bad person, that what he's done is wrong, even if he is laughably incorrect on that front. </p>\n<p>But he doesn't ask again.</p>\n<p>\"Really? Just like that?\"</p>\n<p>\"You said no,\" he says, like it's the simplest thing in the world. </p>\n<p>He isn't stupid, he knows that if someone says no it means what it means, he just never thought… well, that kind of thing doesn't always apply to him. Because if it did, then what would that say about the people who disregarded when he said it?</p>\n<p>They would be bad people, and that doesn't make sense because he loves them, and he doesn't want to play victim, because he's not, no matter what Geralt thinks.</p>\n<p>But the way Geralt says it makes it seem so straightforward, which is odd, because Geralt is hardly the epitome of social skills himself. </p>\n<p><i>That's not fair,</i> he chastises himself; Geralt may not be socially capable but he is a shining example of common decency, the most decent man Jaskier has ever met by far. </p>\n<p>\"But you understand that was wrong of them.\"</p>\n<p>He phrases it like a statement, not a question, but he's clearly waiting for an answer.</p>\n<p>\"It's silly. It was mostly just talk.\"</p>\n<p>\"You're hardly the first person to be hurt by words.\"</p>\n<p>Fuck. He's being insensitive. Geralt has been hurt far worse than his little stack of issues, he should really keep all this to himself, no matter how Geralt encourages him to tell.</p>\n<p>\"Right.\"</p>\n<p>\"I hate when people say…\" he makes a little gesture with his hand, and Jaskier knows what he means, he hates the things people say to Geralt too, the vicious slander and the lies, the implications that he's no more than an animal. \"But you don't ever do that. You constantly go out of your way to make me comfortable. I don't mind returning the favor.\"</p>\n<p>\"Me doing that is not a favor, I don't need-\"</p>\n<p>\"Jaskier. We're friends, it's not a fucking <i>hardship</i> for me to be nice to you.\"</p>\n<p>He remembers saying those exact words to Geralt years ago, when he had first tried to introduce him to the concept of recieving common decency, and from Geralt's reaction you would think he was being murdered. </p>\n<p>He hadn't called him a friend back then. And his friends before Geralt hadn't abided by that rule, so he had wanted to make sure Geralt knew off the bat that he wouldn't treat him the same, because Geralt wasn't hard to love at all. He wonders when Geralt started considering him a friend.</p>\n<p>\"How long have we been friends?\"</p>\n<p>\"I don't know.\"</p>\n<p>\"I think you're my only friend.\"</p>\n<p>\"You make friends every town we go to.\"</p>\n<p>Bitterness spikes in him. \"How many of those friends stick around?\"</p>\n<p>\"Come on. You know everyone loves you, friends and lovers alike. You charm everyone,\" he says unevenly. \"I know you know that.\"</p>\n<p>\"Oh sure, everyone. Just not you, right?\" He mutters under his breath, and that's unfair of him. He can't expect that. Geralt calls them friends, it should be enough.</p>\n<p>\"Including me,\" he says, and it's so quiet Jaskier may have imagined it. Must have. \"Listen. If I didn't want to be here I wouldn't, no sense of obligation lasts as long as we've travelled together. I like taking care of you, because we are friends, and if I have to tell you that every day then- fuck, I will. So…\" he chugs his ale. \"Fuck off.\" he finishes lamely.</p>\n<p>\"You fuck off,\" he says, and shoves him playfully. Geralt shoves back and they end up spilling ale on both their shirts.</p>\n<p>He doesn't say that Geralt might actually, literally have to tell him everyday. He doesn't say that Geralt doesn't know what he's getting into. Because it's all a bit much, and he's not sure where Geralt's line is.</p>\n<p> </p>\n<p>Jaskier pushes it, just to see what it will take. Everyone has a breaking point, and Geralt pretending he doesn’t is an insult to Jaskier's intelligence.</p>\n<p>\"139 bottles of beer on the wall, 139 bottles of beer,\" he sings, going on an hour as they make their way down the trail. “Take one down, pass it around, 139 bottles of beer on the wall, 140 bottles of-”</p>\n<p>“Jaskier,” Geralt grits out. Jaskier waits for the reprimand. Geralt stares straight ahead, not even looking at him, and he feels childish, chastised. He should have let it be, now he’s just hastening the inevitable when he should be behaving, putting it off. Pretending Geralt isn't lying to himself and Jaskier. But he’s tired of pretending and Geralt keeps saying nice things to him and he's fed up.</p>\n<p>“What? Was I being annoying?” he stares straight ahead too.</p>\n<p>“Very.”</p>\n<p>“Oh. I see.” Part of him wants to get it over with, dive into the next verse and see just how many bottles of beer on the wall it takes to get left, making Geralt admit it was a mistake to keep him. “I guess I was.”</p>\n<p>He gives a knowing sigh, and Jaskier can feel his eyes burning into him. “Jaskier.”</p>\n<p>“What?”</p>\n<p>“I still like you.”</p>\n<p>“Of course you do, I never said you didn’t, I’m above such classifications of like and dislike,” he rambles, but he is immeasurably relieved. \"Naturally, you wouldn't like me if I continued a second longer, but I am generous and will refrain for the sake of-\"</p>\n<p>\"I would.\"</p>\n<p> It's bullshit. Kind, well intentioned bullshit, but bullshit all the same. Slowly, he places his fingers back down on the strings in warning, calling his bluff. Geralt merely raises a brow, daring him to try it. He cannot back down from a dare.</p>\n<p>He makes it past 200 bottles, then 300, before he tires himself out, and Geralt hasn't spoken another word during the entire thing, patiently waiting for him to finish. When he puts the lute away he turns to him in the all-consuming silence, unable to stop his stupid mouth from opening.</p>\n<p>\"Do you-\"</p>\n<p>\"Yes,\" he snaps, \"Ask me at any time and the answer is yes. If I stopped liking you every time you annoyed me I would have killed you fucking years ago.\"</p>\n<p>“I was going to ask if you want to make camp here, but that works too,” he lies, trying to process this new development. Geralt only nods stiffly. Jaskier can't get the song out of his head for the rest of the day.</p>\n<p> </p>\n<p>It's about to rain.</p>\n<p>Jaskier sits outside, thinking, hoping Geralt isn't as upset as he is about the argument.</p>\n<p>He had just finished a few drinks with Geralt and told a funny story of how the Countess would always ask for things when he's drunk, because he's infinitely more suggestible that way. It was only a silly anecdote, about some of the ridiculous things he was convinced to do, things he'd never do sober.</p>\n<p>But Geralt did not laugh. He took it verey poorly, saying a few things about the Countess that were absolutely rude. And that dissipated Jaskiers good humor as well, and he defended her, and then they were fighting, and he didn't want to fight so he left.</p>\n<p>So he sits outside, thinking.</p>\n<p>He loves the Countess still. They can never be together, he is too flawed and flighty and easily upset to be with her, because she's perfect and… well, maybe she isn't, Geralt's voice whispers to him from only an hour ago, using some very colorful phrases. Maybe she isn't. Thinking back, she had been sort of… what had Geralt said? Manipulative? At times, she was, but he had always attributed it to how difficult he was to manage. He is a difficult person to know, he knows that, and it makes sense that she needed to deal with him that way.</p>\n<p> He's been thinking about it a lot actually. He's been thinking about himself and how he fits into things and the way Geralt talks to him and how other people do. Thinking about what he knows about his worth. He is difficult to love, and he must sometimes sacrifice for love, those are facts of life.</p>\n<p>But Geralt said he was no inconvenience. </p>\n<p>And he said it's no hardship to be nice to him, because they're friends, and he stops walking when he asks and he likes Jaskier even when he's annoyed and he understands when Jaskier says no and yes and he <i>listens,</i> now, really listens in a way he hadn't before. Maybe he always had and Jaskier was too blind to see. He thinks he could tell Geralt anything and he wouldn't mock him. He's made it clear he wouldn't. Like it's<i> easy </i>to be Jaskiers friend. like implying that it isn't easy, that Jaskier should be anything but what he is, is an affront in itself. And damn if he hadn't been trying hard to get Jaskier to think so too. </p>\n<p>The foundations of his mind have been chipping away, ever since that day in the woods, and he feels them crumble. He might not understand anything that he thought he did. About the world or about himself and what people are supposed to be to each other, and he thinks maybe- maybe the story about getting drunk with the Countess wasn't so funny after all. </p>\n<p>The rain pours, bringing a clarity with it that soaks his spirit.</p>\n<p>He slams the room door open. Geralt stands silent, changing out of his day clothes. He does not acknowledge the soaking bundle that is Jaskier as he strips and crawls into bed, shivering. Maybe he's angry because they argued. Maybe he's waiting for Jaskier to speak first. </p>\n<p>He's getting the sheets damp. The swishing of clothing is the only sound. Jaskiers teeth chatter but he sits up anyway, because he must say it.</p>\n<p>“You were right earlier,\" he says at the same time as Geralt blurts \"I shouldn't have pushed.\"</p>\n<p>He clears his throat awkwardly, because Geralt is being considerate again and it's only making it more obvious how much this needs saying, how he needs to get it out. </p>\n<p>\"I- I’ve been lying to myself for a very long time. I think the Countess hurt me and as much as part of me thinks I should, I don't forgive anyone for it at all, because they knew I was young and didn't know what love was supposed to be like.”</p>\n<p>He knows now.</p>\n<p>“She was so kind but- This sounds so ungrateful. Please stop me if you don't want to hear-”</p>\n<p>“No, I do,” Geralt trips over himself to sit on the bed, still half dressed, and Jaskier wants to laugh but it's stuck in his throat. </p>\n<p>“I feel like such a fool. I let her do whatever she wanted,\" he runs a hand over his face. </p>\n<p>\"She manipulated you.\"</p>\n<p>\"I suppose so,\" he admits for the first time. \"I think something is wrong with me. I can't even begin to believe you care about me even when I know you’re a good man and you wouldn't lie to me to save my feelings, I can't believe it because I just- I just can't. This whole thing isn't because of you, please understand, I know it started at the mountain but that's hardly where it begins and it's my fault- I mean it isn't- I mean.\" </p>\n<p>\"I know.\"</p>\n<p>\"And you're helping, you're being so fucking calm about this and… I never knew how helpless I felt until I didnt feel that way anymore and that's because of you, you're always saying you like me how I am, and I know it's stupid but that's been a help.\"</p>\n<p>He shakes his head, and Jaskier can see him choosing his words carefully. \"I don't control you. It's not because of me, you did it yourself.\"</p>\n<p>He's looking at him with the same look Jaskier so often gives him, the whole world, and he didn't think it was possible to want Geralt more than he already did but now he knows better, because this is how it feels to be himself and to be-</p>\n<p>He tells him everything. </p>\n<p>They don't leave the bed for the rest of the evening, talking until Jaskier finds himself dozing off, only to jerk awake at the sound of Geralt's voice.</p>\n<p>“You’re clingy when you sleep.” Jaskier stills, apologies on his tongue, but Geralt only pulls him closer. “I can’t sleep without it. I was afraid, when you started sleeping alone.”</p>\n<p>He chuckles at the thought, leaning back to fix him with an incredulous look.</p>\n<p>\"What do you have to be scared of, the dark? You're a monster hunter for a living if I recall.\"</p>\n<p>\"I thought you were going to leave me. You braided someone else's hair.\" He inhales deeply, looking extremely embarrassed. \"You didn't want to accompany me hunting. I came back and all your things were gone.\"</p>\n<p>Jaskier can't help himself, he holds out his arms, and Geralt takes him into an embrace. Geralt didn't want him to leave. He wants him here, the way he is. And Jaskier lets himself believe that he could be cherished this way, be loved as he loves. Only for a moment, but it’s more than he’s ever allowed himself before, and it's a big step for him and he's overwhelmed by emotion.</p>\n<p>Geralt is wound tight, looking so upset because Jaskier is upset, which makes Jaskier even more upset. </p>\n<p>“I’m sorry I made you think that. I wouldn't leave you.”</p>\n<p>“Don't apologize,” he says tersely. “I don't want to hear you apologize to me.”</p>\n<p>“You deserve apologies.” They’ve mucked this one up, haven’t they? It’s not Geralt's fault. He’s been hurt and hurt, left behind by people he loved, and it isn’t his fault that he thought it was happening again with Jaskier. </p>\n<p>“Not from you. You're fine.” The honesty in that statement settles over him like a blanket, and he sags into the embrace, letting Geralt support the entirety of his weight. He's not sure he can endure the difficulty of absorbing and believing it all at once. But the sheer fact that they are here, now, and this is happening, it's enough. </p>\n<p>\"Would it be improper-” he fumbles the words, it’s too fragile, too close, he can’t allow himself to ask. But he must. Geralt has shown his cards, reached across the gap, and he needs to ask this last thing. Geralt won’t put him aside, he’s said as much. And he trusts it is true.</p>\n<p>“Do you mind if I cry?\" He whispers into Geralt's shoulder, where the round of his cheek rests, and it feels like he's placed the world there, entrusted in the nook between jaw and shoulder.</p>\n<p>Geralt gives the smallest shake of his head and Jaskier shuffles closer into his neck, and let's go, heaving great sobs because there's nothing wrong with him the way he is, and he is fine. Geralt rubs comforting circles into his shoulders and he clings, cloying and heavy, as if Geralt were a lifeline. This isn’t a dream, it’s real. </p>\n<p>“I’m-”</p>\n<p>“Don’t say you’re sorry.”</p>\n<p>“You can cry on me too if you want,” he sniffles. </p>\n<p>“Maybe another night.” For the life of him Jaskier doesn't know if he's being sarcastic. Maybe he's joking, but it's true as well. He knows it to be true. Because Geralt does not lie to him. </p>\n<p>He cries and it is a dream come true.</p>\n<p>It’s not a special day when it happens. </p>\n<p>They’re only lounging around on the shore, Jaskier having told Geralt to take a break from fiddling with the swords already, and come lie on the sand. To his surprise, he actually does, setting the gear aside and lying so close that their feet rest against each other as they listen to the oceans tides caress the shore.</p>\n<p>Despite the heat, Geralt does not move away, even as Jaskier squirms to get comfortable, flinging up sand and ensuring they’ll need a swim and a week's worth of baths to get truly clean. Jaskier sneezes as grains go up his nose, and he launches into a meandering ramble about nothing in particular.</p>\n<p>Geralt looks lazily up at the clouds as Jaskier piles sand on his stomach into a castle, completely at ease. He doesn't tell him to stop playing in the sand or to shut up, he only listens intently and talks when he has something to add.</p>\n<p>It occurs to him then that he hasn't been worried that Geralt <i>would</i> do any of those things, because he knows he would not. He can't remember the last time he felt rejected or belittled by Geralt, or by anyone else for that matter, because Geralt would put a stop to that kind of thing as quickly as it started.</p>\n<p>It occurs to him that he doesn't feel unworthy of it. He is a good person most of the time, and Geralt thinks he is a good friend, and he is entitled to ramble and make a sandcastle on his friends stomach if he wants to because they are best friends and that's how people treat one another. </p>\n<p>He smiles at the thought and Geralt smiles back.</p>\n<p><i> That's my best friend, </i>he thinks, and it doesn't even send a spike of disbelief through him like it used to, it feels natural to think it. It's fantastic. </p>\n<p>Maybe it’s the past year that's built this up, or maybe it’s the way the light hits Geralt's hair, but-</p>\n<p>“Don't take this badly, but I must ask.”</p>\n<p>“A promising start,” Geralt says dryly.</p>\n<p>“Do you want to kiss?” he can hear his heartbeat in his ears, but he has to know. And regardless of the answer he knows he will not lose his friend. He reminds himself over and over. He can handle this rejection because he will keep Geralt as a friend no matter what.</p>\n<p>“Yes,” Geralt shrugs.</p>\n<p>And… well, Jaskier hadn't been expecting such a quick response. Normally Geralt needs a few weeks or years to brood on his feelings before he can say them aloud, and that would mean he must have been sitting on this for ages, and wait, <i>yes?</i> He just said yes just like that?</p>\n<p>Like it’s simple. Yes, like it’s common knowledge, not an outlandish fantasy that Jaskier has secretly nursed for years.</p>\n<p>Jaskier emits an undignified squawk. </p>\n<p>\"Really? Like, with <i>me?</i>\"</p>\n<p>\"Yes,\" he says. And then the bastard moves his stomach so the whole sand castle falls down. On purpose. Jaskier makes a face at him, because <i>really?</i> After all his hard work. And if Geralt thinks that will distract him he has another thing coming.</p>\n<p>“Why didn’t you say something?!”</p>\n<p>“I didn't want you to think I expected it from you,” he mumbles. He’s not meeting his eyes. \"You don't have to do things just because I want them.\"</p>\n<p>\"What if <i>I</i> want them too?\"</p>\n<p>\"Then you should have them,\" he says so fast the words tumble over each other and his ears go red. Jaskiers heart melts, because he's being <i>shy,</i> even though he should know by now Jaskier is a sure thing for him.</p>\n<p> “Oh, you can't just say sweet things like that or I'll… come here,” he pulls Geralt up and he goes eagerly to lie in Jaskiers lap, and the remains of the sand castle spill everywhere as he moves to press their lips together.</p>\n<p>It’s an awkward kiss, followed by several less awkward kisses and Geralt does a darling thing where he holds his waist so tenderly that Jaskier can hold no doubt that the two of them <i>must </i>be in love, and he loves him very much and they simply have to stay together forever. </p>\n<p>His lips are chapped with sun and his tongue is soft and gentle, and Jaskier supposes this must be how it feels.</p>\n<p> They will stay here another week and then move on and kiss some more in other places across the land, and things will be the same but better than before.</p>\n<p>He sings and dances and whines about long walks, he's loud and overly emotional and lazy, and Geralt loves him back and he loves himself most of the time. Things are fine, better than fine. He is himself, he is loved and he loves and he is fine.</p>\n<p>They walk down the open road, stopping often to kiss and shake off sand from their boots. The sky is vast and clear and cornflower blue. The lark sings sweetly from the brush, and nothing is as it was before.</p>\n<p>Jaskier laughs and takes up his lute.</p>"
}