{
  "id": "23403196",
  "url": "https://archiveofourown.org/works/23403196?view_full_work=true",
  "author": [
    "whileyouresleeping"
  ],
  "title": "Love Language",
  "rating": "Not Rated",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "9-1-1 (TV)"
  ],
  "relationships": [
    "Evan “Buck” Buckley & Eddie Diaz (9-1-1 TV)",
    "Evan \"Buck\" Buckley/Eddie Diaz (9-1-1 TV)",
    "Evan \"Buck\" Buckley/Eddie Diaz"
  ],
  "characters": [
    "Evan \"Buck\" Buckley",
    "Eddie Diaz (9-1-1 TV)",
    "Henrietta \"Hen\" Wilson",
    "Howie \"Chimney\" Han",
    "Maddie Buckley",
    "Bobby Nash"
  ],
  "additional_tags": [
    "Fluff",
    "seriously so much fluff",
    "Mild Hurt/Comfort",
    "Evan Buckley being Peak Evan Buckley",
    "EDDIE DIAZ IS A CHRONIC PINER",
    "Friends to Lovers",
    "Fluff and Humor",
    "Chimney and Hen are the co-captains of the Buddie ship"
  ],
  "language": "English",
  "series": "",
  "published": "2020-03-31",
  "completed": null,
  "words": "6,459",
  "chapters": "1/1",
  "comments": "190",
  "kudos": "7,226",
  "bookmarks": "1,363",
  "hits": "50,636",
  "summary": "<p>The one in which there's too much pollen around, Eddie pines, and Buck is oblivious. </p>\n<p>Or - Eddie's love language is acts of service, and Buck doesn't totally get it.</p>",
  "notes": "<p>WELCOME TO THE FLUFFIEST FUCKING FIC YOU EVER DID SEE GOTDAMN</p>\n<p>but seriously we have been robbed and i am a clown and i will stop shipping these two when you pry 9-1-1 from my cold rotting hands, bye</p>\n<p>i can be found at www.allyourfandomsbelongtous.tumblr.com and https://twitter.com/redtoblack5</p>",
  "text": "<p>There's a bug going around the firehouse, and Evan Buckley is not fucking here for it.</p>\n<p>First, it starts with the dumb new recruit who can never seem to get the hose fittings right but still somehow passed the fire academy. He turns green on a call and starts puking only he doesn't stop when they get back, so he's sent home.</p>\n<p>And then Bolton gets it, and then Erdhardt gets it, and then Vasquez gets it, and Buck starts keeping little bottles of hand sanitiser in his kit bag like a fucking crazy person, forcing people to use it before they eat and after they use the bathroom.</p>\n<p>\"You have gone completely insane,\" Hen says as Buck accosts her with it the day after. \"We have soap for this-\"</p>\n<p>\"Soap only kills germs if you're washing with hot water for twenty seconds or more, <em>and</em> getting under the nails!\" Buck points his sanitiser at her. \"Are you?\"</p>\n<p>She sighs, accepts she's lost the battle, and takes some. \"Thank you, Buck,\" she says patiently.</p>\n<p>He goes home that night and looks up how long various different forms of bacteria can live on surfaces and still infect people, which leads him to the Wikipedia page of all different kinds of diseases, which leads him to pandemics, which leads him to the Black Death. Before he knows it, it's two in the morning and he has to be up in four hours. Great.</p>\n<p>Still, the next morning he rises easily enough and gets to work right as Eddie and Hen are climbing out of their cars. Hen might roll her eyes but Eddie usually humours him, so he makes a beeline for the other man.</p>\n<p>\"Eddie!\" he calls.</p>\n<p>\"Buck,\" Eddie calls back, lazily. \"Coffee.\"</p>\n<p>\"What?\" Buck takes it. \"Wow, thank you man, how much-\"</p>\n<p>\"You can get the next one.\"</p>\n<p>\"Okay.\" Buck readjusts his bag on his shoulder. \"So I was up late last night, doing some-\"</p>\n<p>\"Research,\" Eddie and Hen finish, perfectly in sync.</p>\n<p>\"Well, yeah,\" Buck says, nonplussed. \"Did you know that the Black Death wiped out fifty million people in Europe in the 14th century?\" he asks, trotting after Eddie and the others. \"Over sixty percent of Europe's population at the time. It took them two hundred years to recover from it, and parts of Italy didn't fully recover until the nineteenth century.\"</p>\n<p>\"Why do you know that?\" Hen wonders.</p>\n<p>\"He researches things when stays up too late and he's worried,\" Eddie says, and then jerks his head up to narrow his eyes at Buck. \"Why are you worried?\"</p>\n<p>\"No reason,\" Buck says evasively, and Eddie gives him this look that says <em>I'll drop it now because there are other people around but you're in trouble once we're in the locker room.</em></p>\n<p>Sure enough, he's just stripped out of his t-shirt when Eddie says, \"Spit it out.\"</p>\n<p>This is the kind of brash affection he's gotten used to, being Eddie's friend. Buck feels things in spades and Eddie buries things with them. That's how it goes. But he knows Eddie really does care - the touchy-feely stuff just doesn't come naturally to him, and that's fine with Buck.</p>\n<p>\"It's dumb,\" he mumbles.</p>\n<p>Eddie raises his hands in an exasperated expression. \"You stayed up late researching the Black Death for no apparent reason, Buck,\" he says. \"Whatever it is, it probably isn't dumb.\"</p>\n<p>\"No, it like, really, really is,\" Buck insists. \"You'll think I'm stupid.\"</p>\n<p>\"When have I ever thought you're stupid?\" Eddie asks sharply.</p>\n<p>Buck takes a deep breath. He doesn't want to annoy Eddie, that's the truth of it - Eddie called him exhausting once and it broke his whole world open and he's still getting used to, well, he's still getting used to the idea that Eddie really didn't mean it, at least not the way Buck took it.</p>\n<p>\"You haven't,\" Buck says sheepishly. \"I'm sorry.\"</p>\n<p>\"C'mon, man,\" Eddie says, almost gently, \"it's just me.\"</p>\n<p>Right. Just Eddie. Eddie who held his hand after the ladder truck crushed his leg and he was pinned there and Eddie who dragged him out and Eddie who used everything he'd learned with Chris to help Buck with his physical therapy. Eddie's seen a lot more shit from him that he could judge for, and hasn't.</p>\n<p>\"You know how there's that stomach bug going around?\" Buck asks.</p>\n<p>Eddie's eyebrows crunch like he knows he's not going to fully comprehend whatever Buck says next. \"Yeah?\"</p>\n<p>Buck rocks on his heels anxiously, and Eddie puts out a hand to force him to stay still. It's warm and comforting and results in Buck saying, \"I'm really scared of puking. Like really scared. I'm worried I'll get it.\"</p>\n<p>So he doesn't think about how fucking lame that sounds when he says it - what is he, five? - he amuses himself by doing a little equation in his head based off Eddie's expression of total bewilderment.</p>\n<p>\n<strong>Buck x some vague traumatic event = fear of puking</strong>\n</p>\n<p>Eddie still says nothing, so Buck reworks the equation. X is the traumatic event, which Eddie is evidently trying to work out, except - well, there's been a lot of them.</p>\n<p>\"Okay,\" Eddie says, his voice a little softer. \"You're worried about getting sick?\"</p>\n<p>\"Yeah, because I can't take any anti-emetics on blood thinners,\" Buck says, \"and when I was recovering from surgery they gave me these meds that fucked me up and I was really sick for-\"</p>\n<p>\"Two days,\" Eddie finishes. \"I remember. You were miserable.\" He looks concerned, and puts his hand back on Buck's shoulder. \"It's not stupid to be scared of getting sick, Buck. Chris is as well.\"</p>\n<p>\"Chris is <em>eight</em>,\" Buck groans. \"I'm an adult.\" He sees Eddie's mouth quirk up into a half smile and says, \"I am!\"</p>\n<p>\"I know, I know,\" Eddie chuckles, and the sound eases something in Buck's chest. \"Okay. Well, look, they've stepped up the cleaning in the firehouse, right? To contain it? What're your chores this week?\"</p>\n<p>\"Cleaning duty,\" Buck moans.</p>\n<p>\"Have you talked to Bobby?\"</p>\n<p>\"I'm not asking Bobby to take me off cleaning detail because I'm scared of puking, Eddie, I'm pretty sure I've lost any cool points I had with you as it is.\"</p>\n<p>\"Can't lose what you never had,\" Eddie grins, and Buck splutters indignantly. \"Okay, look. I'm on cooking duty, and no one wants that - literally no one wants that.\"</p>\n<p>Buck wants to defend him and say Eddie's cooking isn't that bad, but... well, he's right, no one wants that. \"Yeah?\"</p>\n<p>\"How about you go on cooking duty this week and I'll do the cleaning detail?\" Eddie asks. \"We'll have edible food and a sparkling, disease-free firehouse.\"</p>\n<p>Buck blinks. \"You'd do that for me?\"</p>\n<p>\"Of course I would, Buck.\"</p>\n<p>Ugh, he loves Eddie so much he could cry. Instead, he bullies the other man into a hug, clutching him tightly and saying, \"You're the best, Eds, seriously the best, I owe you one - you don't think it's dumb?\"</p>\n<p>\"It's not dumb, Buck,\" Eddie says, his voice muffled in Buck's shoulder. \"I remember those two days. They sucked, especially for you.\" He pulls away, smiles. \"Stop getting your feelings all over me and let's go.\"</p>\n<p>\"Yes, Sergeant Diaz,\" Buck says, snapping a mock salute.</p>\n<p>Eddie rolls his eyes. \"Cabrón,\" he says, but it sounds affectionate, so Buck lets it slide.</p>\n<p>He feels a lot better now anyway.</p>\n<p>~*~</p>\n<p>So he doesn't catch the bug going around, but two days later he wakes up with his nose already stuffed and clogged and peers out his bedroom window to see disgustingly good weather outside.</p>\n<p>Today is going to suck so hard. Today is going to suck so hard that Buck might actually cave and take hayfever tablets.</p>\n<p>Except he's out. His medicine cabinet is full of blood thinners and painkillers and topical pain relief for his leg and no fucking antihistamines, save for a sad, crinkled blister packet sitting on its own on the lowest shelf, where Past Buck - that asshole - undoubtedly left it as a fucked up reminder for Future Buck to buy more, which he didn't.</p>\n<p>So he shuffles into the station that morning, miserable but functional, and is immediately greeted by Eddie in the locker room with a, \"Jesus, what happened to you?\"</p>\n<p>\"Nothin',\" he says thickly, dumping his bag in his locker and starting to undress.</p>\n<p>\"You're not even eating anything,\" Eddie says concernedly.</p>\n<p>\"It's shredding season.\"</p>\n<p>\"You eat every half hour at least.\"</p>\n<p>\"I do not, and can't a guy not eat without it raising suspicion?\"</p>\n<p>\"Not when said guy is a human garbage disposal.\"</p>\n<p>Buck throws him a disgruntled look as he sits down on the benches to lace up his boots. The pressure in his nose and head increases, and he rubs his face artlessly with his fist, sniffling.</p>\n<p>When he looks up, Eddie is standing in front of him, hands on his hips. Before Buck can jerk back or protest or say anything, Eddie's hand shoots out and lands on his forehead.</p>\n<p>\"Are you sick?\" Eddie demands.</p>\n<p>\"Eddie, I'm not sick,\" Buck whines, swatting Eddie's hand away from his forehead. \"I have hayfever, man. You got any antihistamines?\"</p>\n<p>\"I'll trade you for toilet paper,\" Eddie says.</p>\n<p>Buck whines again, sniffles, makes grabby hands towards Eddie's bag. It has the desired effect of making Eddie roll his eyes and mutter in Spanish under his breath - definitely something about Buck being a drama queen - and produce a pack of antihistamines. It's Benadryl even, which is great because Zyrtec doesn't seem to work as well for him.</p>\n<p>\"Keep it,\" Eddie mutters as he hands it over.</p>\n<p>Buck blinks. It's a 48-pack, and the seal is intact. \"Eddie, these are brand new-\"</p>\n<p>\"I got them for you anyway,\" Eddie mumbles, and Buck could swear he's blushing. He grins brightly, shocked and pleased that Eddie got him antihistamines because he remembered that Buck gets hayfever and even remembered he doesn't like Zyrtec.</p>\n<p>\"I'll have your babies,\" Buck offers, and the three new recruits walking past stop and stare at him like he's grown an extra head.</p>\n<p>\"Tan dramático,\" Eddie mutters, and Buck kicks his shin as he turns to leave, which results in Eddie swatting him on the shoulder.</p>\n<p>\"Buck, didn't anyone ever tell you not to pull the pigtails of the girl you liked?\" Chimney asks dryly, having just entered to see their little push-and-shove.</p>\n<p>\"Eddie slapped me back,\" Buck whines. \"Right after I offered to have his babies even.\"</p>\n<p>\"I don't think that's gonna work out the way you think it will, Buckaroo,\" Chimney adds.</p>\n<p>\"What's the commotion?\" Bobby asks. He's just entered the change room, looking at them all bemusedly. \"Buck, are you alright? You look red-\"</p>\n<p>\"Oh, God, I have hayfever, I'm not carrying the plague,\" Buck says.</p>\n<p>\"Let me catch you up, Cap,\" Chimney says. \"Our sweet little Buck here-\"</p>\n<p>Buck splutters at the terminology, and Eddie laughs at him.</p>\n<p>\"Apparently has hayfever. There's been an interesting trade of antihistamines for toilet paper, which concluded with Buck offering to have Eddie's babies and scaring off all the new recruits. We concluded with a childish push-and-shove playground game.\"</p>\n<p>\"I'm not <em>little</em>,\" Buck grumbles, then sneezes.</p>\n<p>\"Of course you aren't,\" Eddie replies soothingly. \"Take your tablets.\"</p>\n<p>~*~</p>\n<p>\"Is the fine art of saving people's lives boring you, Buck?\"</p>\n<p>Bobby's tone is mostly amused, but there's an edge of concern there as well. \"What?\" Buck whines. \"I'm fine, what?\"</p>\n<p>\"You've yawned about three hundred times since we started readout, Buckaroo,\" Chimney says.</p>\n<p>\"Are you sick?\" Bobby asks. \"If you need to go home-\"</p>\n<p>\"He's not sick,\" Eddie cuts in. He's looking at the daily paper, frowning at something that's displeased him - baseball news, probably. \"He took two Benadryl on an empty stomach this morning. They make him sleepy.\"</p>\n<p>There's a long silence. Bobby looks at Buck who looks at Eddie who looks at no one, and Hen and Chim are looking at each other and Chim says, \"Holy <em>shit</em>,\" the same time Hen says, \"Clueless,\" and they high-five each other while snickering.</p>\n<p>\"Okay,\" Bobby says slowly. \"Buck, you gonna be okay out there today?</p>\n<p>\"Yeah, Cap,\" Buck says, trying to ignore how his cheeks are flaming. \"I'm good.\"</p>\n<p>\"The pollen count isn't that bad today,\" Eddie adds.</p>\n<p>\"Why do you know that, Eddie?\" Chim asks slyly.</p>\n<p>\"Okay, okay,\" Bobby sighs. \"I can see this readout is a total failure so I'll keep it short. Chimney, you're on hose detail. Hen, make sure the medical supplies are restocked in the van - Buck...\" He sighs again. \"Well, try not to fall asleep where you're sitting.\"</p>\n<p>\"You got it, Boss,\" Buck says thickly, saluting.</p>\n<p>\"Eddie, kitchen cleanup,\" Bobby finishes. \"Let's go.\"</p>\n<p>\"No, wait,\" Buck says, getting to his feet. \"What's my job actually?\"</p>\n<p>\"Eat something, then help Eddie,\" Bobby says dryly.</p>\n<p>Buck wolfs down a bagel with cream cheese and avocado - which Eddie regards with an expression Buck likes to call his \"why are white people a thing\" expression - then joins him in cleaning up the kitchen. He takes the plates over to the sink, where Eddie's washing them, then picks up a tea towel.</p>\n<p>\"Thanks for the Benadryl,\" he says, sniffling. How the hell is the pollen so bad even in the firehouse?</p>\n<p>\"You're welcome.\" Eddie seems a little distant. \"Feeling okay?\"</p>\n<p>\"Yeah, man, I'm just-\" He sniffles again, and Eddie grimaces - \"I'm just stuffy, that's all.\"</p>\n<p>\"Okay,\" Eddie says. \"If you're sure.\"</p>\n<p>\"I'm sure.\"</p>\n<p>~*~</p>\n<p>Buck's not sure.</p>\n<p>He doesn't believe Eddie knows what the fuck he's talking about when it comes to the pollen count, frankly, because this is bullshit. He's sitting in the back of the truck with Eddie and Hen and his nose is so blocked he has to breathe through his mouth like a dog, and his eyes are streaming.</p>\n<p>\"God, Buck,\" Hen says sympathetically, and she reaches out to pat his knee. Buck is feeling pretty pathetic and touch-starved and shuffles closer hopefully, winning a smile from her as she leaves her hand there. \"You doing okay, baby?\"</p>\n<p>\"I'm okay,\" he snuffles, which comes out more like \"I'b oday\" and makes her laugh a little.</p>\n<p>Bobby's voice crackles over the intercom. \"How's the kid?\"</p>\n<p>\"I'b nod a kid,\" Buck protests. \"Thid id didcrimidation.\"</p>\n<p>The entire truck loses their collective shit at that, and Buck pouts, slumping back in his seat. No one takes him seriously at the best of times, he mourns, and with a blocked nose they take him even less seriously.</p>\n<p>\"Here,\" Eddie says kindly, and Buck turns to him to find the other man holding out a tissue. He takes it with a sheepish smile and wipes his eyes, then his nose, sniffling pathetically enough that Hen makes a vague cooing noise.</p>\n<p>\"Thabks,\" he says.</p>\n<p>Eddie's mouth quirks. \"Don't mention it.\"</p>\n<p>~*~</p>\n<p>He really does try to take a nap when he gets home, only he can't because he's too uncomfortable, so he sits on the ground with his head on his coffee table, hoping the cool wood soothes his itchy nose and headache.</p>\n<p>He takes a photo, wiping his eyes for the thousandth time, and sends it to Eddie.</p>\n<p><strong>To: Edmeister, 2:27PM:</strong> I'm dying :(</p>\n<p>He wishes he had tissues within reach. He doesn't want to move. At least his phone pings with an answer almost immediately, which brightens him a little as he sees Eddie's name.</p>\n<p><strong>From: Edmeister, 2:27PM:</strong> You look like shit.</p>\n<p><strong>To: Edmeister, 2:27PM:</strong> mean :'( :'( :'( :'(</p>\n<p>Eddie sends back an eyerolling emoji, and Buck whines, turning his head until he's pressed flat against the tabletop, nose squashed. Maybe if he stays here he'll suffocate and not have to deal with being stuffed up anymore.</p>\n<p>He's still on the table, twenty minutes later, watching old reruns of the Maury Povich show, when the doorknob to his apartment turns, and a key clicks in the lock.</p>\n<p>\"Don't freak, it's just me,\" Eddie's voice calls.</p>\n<p>\"Eddie?\" Buck asks hopefully.</p>\n<p>Eddie rounds the corner, carrying a pharmacy bag in one hand. He sighs when he sees Buck on the coffee table.</p>\n<p>\"Jesus, Buck.\"</p>\n<p>\"I know.\"</p>\n<p>\"This is sad.\"</p>\n<p>\"Eddie,\" Buck whines.</p>\n<p>Eddie sits down next to him, which is kinda nice. Buck shuffles closer. \"God,\" Eddie murmurs, taking Buck's face in his hands. \"Look at your eyes...\"</p>\n<p>\"Bruised?\" Buck asks miserably. Eddie's hands on his face feel nice, and he sinks into the touch a little.</p>\n<p>\"Yeah. Do you normally get it this bad?\"</p>\n<p>Buck nods, which jostles his head, which makes him decidedly unhappy. \"Where's Chris?\"</p>\n<p>\"It's his night with abuela.\" Eddie starts unloading the pharmacy bag. \"Here, I got you some stuff. The Benadryl doesn't seem like it's working for you.\"</p>\n<p>\"Didn't have to,\" Buck says, trying to sound grateful past his clogged nose.</p>\n<p>\"I know I didn't.\" Eddie smiles at him. \"You seem pretty miserable, though.\"</p>\n<p>Buck rests his head on his arms and nods, sniffling as the change in position irritates his nose all over again. \"Not the plague,\" he insists.</p>\n<p>\"No, I know. No fever.\" Eddie digs out a few little bottles. \"Okay, we have nasal spray, eye drops, stronger Benadryl for tomorrow, eucalyptus scented tissues, and, uh, whatever this is - the pharmacist said it would help, anyway.\"</p>\n<p>Buck grins. \"You're in Dad Mode,\" he accuses.</p>\n<p>\"I am not,\" Eddie grumbles.</p>\n<p>\"You so are.\"</p>\n<p>Eddie takes stock of his face. \"Okay,\" he says slowly. He's clearly ignoring Buck's teasing in favour of actually fixing him. Buck is so, so glad Eddie buys into his bullshit and is actually here. \"Let's do this.\"</p>\n<p>He hands Buck the nasal spray, and Buck uses it - liberally - in both nostrils, coughing with the result each time. Then Eddie breaks out the eye drops, instructs Buck to lean his head back and hold his eye open.</p>\n<p>The eye drops suck. They sting and the taste slides down the back of his throat, and he immediately wants to wipe his eyes with his hands, but Eddie grabs his wrists before he can. \"Go have a shower,\" he orders. \"Steam will help clear it up.\"</p>\n<p>\"You're bossy,\" Buck mumbles, but he does as he's told, and when he gets out he does feel a lot better than he did before.</p>\n<p>When he gets back to the living room, Eddie is sitting at one end of his couch. Buck flops dramatically on top of him - Eddie grunts and calls him something not nice in Spanish - and then rolls so his head is in Eddie's lap.</p>\n<p>He looks up blearily. His eyes are a little watery still. \"Am I still pretty?\"</p>\n<p>\"Yes, Buck, you're still pretty,\" Eddie says patiently. \"Here.\" He leans forward, grabbing a damp cloth on the coffee table, and drops it over Buck's face. \"This should help.\"</p>\n<p>Buck adjusts it blindly. \"With what?\"</p>\n<p>\"All of it, but especially your eyes.\"</p>\n<p>\"Thanks, Eddie,\" Buck mumbles, finally feeling at ease enough to get some damn sleep. \"I feel lots better.\"</p>\n<p>\"I'm glad.\"</p>\n<p>~*~</p>\n<p>He feels like he has a new lease on life when he bounces into work the next day.</p>\n<p>\"Good morning, Cap,\" he sing-songs as he whirls past Bobby to get to the kitchen. \"Looking lovely as usual, Hen,\" he adds, kissing her cheek.</p>\n<p>\"What the hell got into you?\" Hen asks.</p>\n<p>\"Eddie,\" Chimney says, then grunts when Hen kicks him under the table. \"What?\"</p>\n<p>Buck's confused, but happy. He pours himself some coffee and then Eddie one, as well, when he sees Eddie come up the stairs to the kitchen.</p>\n<p>For a moment, stupidly, he wonders what to say. He's never had to wonder anything with Eddie before, and now, he feels a little tongue-tied by his presence. Thankfully, he doesn't have to say anything, because Eddie gets there first.</p>\n<p>\"You look a lot better,\" he offers, smiling.</p>\n<p>\"Thanks to you,\" Buck says cheerfully, and Eddie blushes and Chimney says, \"Wow,\" and then \"hey!\" as Hen kicks him again.</p>\n<p>\"Did he take Benadryl this morning, Eddie?\" Hen asks.</p>\n<p>\"Why would Eddie know if I've had Benadryl?\" Buck wonders aloud, noting that Eddie's turned a little pink.</p>\n<p>\"No reason,\" Hen says, smiling.</p>\n<p>Bobby's hand looms out of nowhere, touching his forehead. \"Sure you're okay, Buckaroo?\" he asks softly. \"You still look a little faded.\"</p>\n<p>(Buck appreciates it, he does. They all care about him so damn much that his need for them to know he loves them seeps through every pore in his body - but sometimes, like now, he really just needs them to believe he's okay. To let him be okay.)</p>\n<p>\"Eddie says I'm still pretty,\" Buck protests, and Chimney spits his coffee all over the table.</p>\n<p>~*~</p>\n<p>Eddie's quiet all day, so much so that Buck corners him in the locker room at the end and says, \"Do you have the plague?\"</p>\n<p>\"What is it with you and plagues, Buck?\"</p>\n<p>\"You're avoiding the question!\"</p>\n<p>\"I obviously do not have the plague. Idiota.\"</p>\n<p>\"Hey!\" Buck protests, following Eddie out of the change rooms. \"Eddie, seriously, you okay? You've been weird since this morning. What's going on?\"</p>\n<p>Eddie stops, then turns to look at him. \"I'm sorry I've been weird, okay?\" he asks quietly. \"It's not you. It's me.\"</p>\n<p>\"Full offence meant, but that's a cop out answer,\" Buck says heatedly. \"What's going on?\"</p>\n<p>Eddie hesitates.</p>\n<p>\"Just tell me, man,\" Buck pleads. \"I mean you looked after me, right? Yesterday?\" Like Buck needs to remind Eddie that he spent all night listening to Buck's theatrics and watching reruns of reality TV. \"Just... I don't know, it's not like you.\"</p>\n<p>\"I'm sorry, Buck,\" Eddie sighs, but he walks back towards him and puts a hand on his shoulder. \"Dios, don't give me the puppy eyes, I can't take it.\"</p>\n<p>Buck is definitely giving him the puppy eyes, which might be a low blow but it almost always gets him what he wants. \"Tell me?\" he pleads.</p>\n<p>\"I'm just rundown, Buck,\" Eddie says tiredly. \"That's all, I swear. It's been a really long week.\"</p>\n<p>Eddie's rundown? And didn't tell him, even though he came over and dealt with all of Buck's bullshit last night?</p>\n<p>\"God, don't look at me like that,\" Eddie groans. \"You're acting like I killed a puppy.\"</p>\n<p>\"You should've told me you were rundown,\" Buck insists. \"I would've helped.\"</p>\n<p>\"Buck, you were so sick last night you couldn't see, smell, taste, or even move your head at certain speeds,\" Eddie says dryly. \"And you still like someone punched you in both pretty eyes.\"</p>\n<p>\"Okay, I wasn't sick, first of all, it's hayfever, that's different.\" He ignores the comment about his eyes even as his cheeks flame. \"Second of all, you should've taken care of yourself before you worried about me, Eds. I was being dramatic.\"</p>\n<p>\"I know, I was there.\"</p>\n<p>\"Rude. Point is, you should let me help you.\"</p>\n<p>\"Buck, it isn't your job to help me.\"</p>\n<p>\"If it's not my job to help you then it's not your job to help me either, but you did,\" Buck says belligerently. \"C'mon, I owe you one.\"</p>\n<p>\"I didn't do it so you'd owe me,\" Eddie mutters.</p>\n<p>\"You know what? Fuck you. I'm coming around and making some fucking chicken soup and you're gonna sit there and enjoy it.\"</p>\n<p>\"Your comforting skills could use some work,\" Eddie says, but he's almost smiling now, and he doesn't look like he's going to argue. \"I guess I'll have to teach you.\"</p>\n<p>\"Over soup,\" Buck says stubbornly.</p>\n<p>\"Yes, Nurse Buckley.\"</p>\n<p>~*~</p>\n<p>Buck does go around, and he does make soup - enlisting Chris both as his helper and his enforcer - and he does make sure Eddie eats it all.</p>\n<p>He also does all the dishes, the laundry, cleans up the living room, helps Chris with his math homework (poor kid is probably gonna get a C at the best, but hey, he tried), makes lunches for Chris for the next few days, and vacuums.</p>\n<p>\"Will you sit?\" Eddie asks, exasperated.</p>\n<p>\"No! I'm helping!\"</p>\n<p>\"Dios mio, este chico es jodidamente real...\"</p>\n<p>\"Hey! Don't cuss at me!\"</p>\n<p>\"I was speaking Spanish, how did you-\"</p>\n<p>\"I've heard you cuss enough times at work to know more or less what you said!\" Buck waves the recently-washed soup ladle at Eddie, flinging bubbles everywhere. \"Accept the help!\"</p>\n<p>\"I don't think I have much of a choice,\" Eddie says, wide-eyed, as Buck scrubs furiously at one of the pans. \"What's gotten into you?\"</p>\n<p>\"You're always doing nice things for me - and for other people, but especially me,\" Buck complains. \"And you never let anyone return the favour and you never ask for help even when you're tired and need a break. So I'm not going to ask you anymore, I'm going to just do it, and you're gonna have to put up with it!\"</p>\n<p>\"... You're the scariest helper I've ever met.\"</p>\n<p>\"You're damn right!\"</p>\n<p>~*~</p>\n<p>So that's how that goes. And then Eddie gets all weird and quiet again and Buck just doesn't get it.</p>\n<p>Naturally, Maddie notices him being even more dramatic and whiny than he usually is when he doesn't understand why someone won't talk to him, and invites him round to dinner with Chimney. Buck resigns himself to having to put up with lovey-dovey couple crap all evening and immediately accepts the wine Maddie pours him when he slumps over her breakfast bar.</p>\n<p>\"I don't know what's wrong with Eddie,\" Buck complains. \"He's been so weird lately, he hasn't even really spoken to me.\"</p>\n<p>\"It's because he's in love with you,\" Maddie says, turning the page of the recipe book.</p>\n<p>Buck chokes on his food, and Chimney turns to her, saying, \"I thought we were gonna ease him into the idea?\"</p>\n<p>\"There's no easing into things with a Buckley, especially not an Evan Buckley,\" Maddie says simply. \"He's in love with you, Buck. People keep calling him out on it and you're just not getting the message, so he feels awkward and he's backed off even though he's probably really lonely without you.\"</p>\n<p>\"You think Eddie is lonely?\" Buck asks, alarmed. He hates the idea of Eddie being lonely, or alone - Buck's worst fear is just that, after all.</p>\n<p>\"Way to miss the point, Buckaroo,\" Chimney says dryly. \"Look, he hasn't said anything, but-\"</p>\n<p>\"He looks at you like you're the whole world,\" Maddie sighs. \"Chim and Hen haven't made it easy for him, always teasing him about it. He probably just doesn't want to make you uncomfortable.\"</p>\n<p>\"Uncomfortable?\" Buck blinks. \"I'm not uncomfortable. Why would he think that?\"</p>\n<p>\"Have you told him you're bi?\" Maddie asks.</p>\n<p>This time, Chimney is the one who chokes a little bit, dribbling water down the front of his shirt. \"You're bi?\"</p>\n<p>\"It's not a secret,\" Buck points out. \"You just never asked.\"</p>\n<p>\"I'm guessing that if Chim didn't know, Eddie didn't either,\" Maddie sighs.</p>\n<p>\"Also,\" Buck says, \"since when has Eddie been in love with me?\"</p>\n<p>\"Pretty sure it was when you saved Chris in the tsunami,\" Chim says.</p>\n<p>\"That long?!\" Buck blinks. \"Wait, has he told you? Like actually told you?\"</p>\n<p>\"No, Buck, but he doesn't have to,\" Chim says patiently. \"He took over cleaning duty for you, bought antihistamines for you, remembered that Benadryl makes you sleepy under very specific circumstances, fed into your dramatic re-enactment of a fainting seventeenth century damsel-\"</p>\n<p>\"I am not dramatic!\"</p>\n<p>\"-and on top of all that, he doesn't even ask for anything back, because he just wants to do things for you,\" Chim finishes.</p>\n<p>\"Eddie's love language is acts of service, Ev,\" Maddie agrees patiently. \"He might not ever say it if you don't make the first move. He's trying to show you.\"</p>\n<p>\"Love language?\" Buck blinks. \"Okay. This has been fun. I have to go.\"</p>\n<p>\"Here!\" Chimney calls, throwing a box at him. Buck catches it on reflex, notes that it's a box of condoms, and pelts them back, causing Maddie to yell something about her kitchen not being a playground and Chim to squawk, \"I'm just trying to make sure you practice safe sex!\"</p>\n<p>\"Fuck you, Chim,\" Buck huffs.</p>\n<p>\"No, fuck <em>Eddie</em>, you've got this all confused-\"</p>\n<p>~*~</p>\n<p>He knocks on Eddie's door and somehow doesn't expect that he'll be home.</p>\n<p>Eddie opens the door, looking alarmed and wearing only sweats and that just does things to Buck that are completely inappropriate and says, \"Buck? and then, \"Are you okay? You look-\"</p>\n<p>\"Your love language is acts of service,\" Buck accuses, which is not really what he meant to say but sort of puts him on the track for saying it.</p>\n<p>Eddie blinks. \"Um... I'm trying <em>really</em> hard, Buck, but I'm not sure I'm following-\"</p>\n<p>\"You've been trying to tell me you love me by doing things for me,\" Buck says, waving his hands and beginning to pace on Eddie's porch. \"Only acts of service isn't my love language, Eddie, it's words of affirmation, so I didn't get it! I've been dumb!\"</p>\n<p>\"... I'm still <em>so lost</em>...\"</p>\n<p>\"Maddie and Chimney said you're in love with me and that's why you've been acting weird because Chim and Hen keep teasing you and you don't want me to be uncomfortable and I'm bi except you never knew that because I never told anyone and no one ever asked and this is bullshit, we've been tiptoeing around for - are you okay?\"</p>\n<p>Eddie's gone paper-white. \"You know?\"</p>\n<p>\"Yes, because Maddie and Chimney told me, keep up,\" Buck says impatiently. \"It just took me forever to work out because of the love language thing-\"</p>\n<p>\"I'm just - I need you to let that one thing go for a second and - why are you here?\"</p>\n<p>Buck stops pacing.\"To ask you on a date obviously.\"</p>\n<p>\"Oh, obviously!\" Eddie says, voice breaking hysterically. \"I completely inferred that from all your pacing and-\"</p>\n<p>\"So will you?\" Buck asks. \"Go on a date with me?\"</p>\n<p>Eddie opens his mouth and closes it a few times, like a goldfish trying to eat food from the surface of the water. It's kinda cute. \"Yes?\" he asks.</p>\n<p>\"Are you sure?\"</p>\n<p>\"Yeah. Yes. Um - that sounds good.\"</p>\n<p>They look at each other for a moment.</p>\n<p>\"Our shift finishes at four on Thursday,\" Buck says. \"I'll pick you up at seven.\"</p>\n<p>\"I - okay.\" Eddie looks flustered. \"Are you sure?\"</p>\n<p>\"Yes, Eddie, I'm sure,\" Buck says patiently.</p>\n<p>\"Okay.\"</p>\n<p>Buck gestures to his truck. \"I'm supposed to be at dinner with Maddie and Chimney,\" he explains. \"So I'm gonna go. Also, you should really wear a shirt when you answer the door, it's super not fair to anyone who might be knocking.\"</p>\n<p>Eddie laughs. \"Goodnight, Buck.\"</p>\n<p>\"Goodnight,\" Buck says, and then kisses Eddie's cheek quickly, before he can react, and walks back to his truck, beaming.</p>\n<p>He can't wait for Thursday night.</p>\n<p>~*~</p>\n<p>He wears his best shirt to their date, a wine-coloured one Maddie says makes his eyes pop, and a tie, because he's dressing to impress.</p>\n<p>When he picks Eddie up, it's only awkward for a few minutes, and then Eddie says, \"I can't believe you know how to tie a tie,\" and Buck says, \"I'm a fucking adult Eddie,\" and they both laugh. Then it's normal, except they're dressed up and Buck's driving them to a fancy dinner place and Eddie puts a hand on his thigh as they talk and it feels like he's branding Buck's leg with it.</p>\n<p>\"This is expensive,\" Eddie says slowly when they pull up. \"Buck-\"</p>\n<p>\"I'm paying,\" Buck says stubbornly, because it's not like he doesn't know the state of Eddie's finances. \"The person who initiates the date pays, that's the rules.\"</p>\n<p>\"There's rules to this now?\" Eddie asks, his eyebrows quirking.</p>\n<p>\"I might have made them up. But yeah, there are rules, and I know you aren't a rule breaker.\"</p>\n<p>They head inside and the waiter escorts them to their table, where Buck graciously gives Eddie the booth seat with the comfy cushions and he folds himself into the chair. The waiter brings wine - Eddie's not much of a wine person really, but he seems to like this one - and Buck finally slows down enough to take Eddie in.</p>\n<p>He's wearing dress slacks, which is more dressed up than Buck's ever seen him, and a dark, dark blue shirt that makes his skin look even more tan than it is, neatly pressed, with the sleeves rolled down. It looks familiar, and Buck places it almost immediately.</p>\n<p>\"You're wearing your good shirt,\" Buck accuses.</p>\n<p>Eddie blinks at him. \"Excuse me?\"</p>\n<p>\"You wore that shirt when you came over that one time,\" Buck says excitedly, then elaborates when Eddie's expression suggests he isn't getting it. \"We talked about that woman who shot her husband then took him back - and something about fighting it out in the ring-\"</p>\n<p>\"Yeah, I was flirting with you, dumbass,\" Eddie says.</p>\n<p>\"Wait, you were?\" Buck preens. \"You wore your good date shirt for me,\" he coos. \"Twice.\"</p>\n<p>\"You're so annoying.\" But Eddie's smiling. \"Besides, you dressed up for me.\"</p>\n<p>Buck puffs his chest out. \"You noticed?\"</p>\n<p>\"Yeah, it's hard not to when you're swanning around like a peacock-\"</p>\n<p>Buck laughs. He's glad that they're still messing around, like they always have, even though their feet are tangled together under the table. He really wants to cross over and sit right next to Eddie in the booth, put an arm around him and cuddle up to him and never leave his side, but he thinks that might be a bit much for a first date. He might do it with a woman - hell, would've done it with Abby even - but Eddie is different. Eddie is made of steel at work and spooked easily when it comes to feelings, so Buck won't push, he'll just wait.</p>\n<p>\"Hey,\" Eddie says, and takes Buck's hand across the table, almost tentatively. Buck laces their fingers together happily, and Eddie's lips quirk into an almost-smile at the action. It's secretive, like he doesn't want Buck to know it makes him happy, but Buck does know. \"You... you really do look beautiful tonight.\"</p>\n<p>Buck blinks rapidly, licks his lips. He's not sure what to say. Nobody's called him beautiful before. They've called him hot and sexy and any variation of the above, but - never <em>beautiful.</em></p>\n<p>Eddie smiles, seeming to realise Buck doesn't know what to say. \"You really do clean up nice,\" he comments lightly. \"Did Maddie dress you?\"</p>\n<p>\"Fuck you,\" Buck says indignantly, but he pours them both some more wine.</p>\n<p>~*~</p>\n<p>\"I can't believe you wore a tie.\"</p>\n<p>\"Shut up, I'm trying to impress you!\"</p>\n<p>Eddie laughs, finally freeing Buck from his tie and pulling it through the collar of his shirt before dumping it on the kitchen counter. \"How did you even knot it that hard?\"</p>\n<p>\"I don't know, okay, I hardly ever have to tie ties so I want to make sure when I do they don't come off!\"</p>\n<p>Eddie smiles. His hands are resting on Buck's shoulders, thumbs rubbing gentle circles into the muscles there. \"You don't have to try and impress me,\" he says. \"I'm already impressed. But it's nice that you did.\"</p>\n<p>Buck swallows. Eddie's hands on his shoulders are so close to his neck, his collarbones, all his erogenous zones. Eddie's eyes flicker down to his Adam's apple bobbing nervously, and then drift over to his collar. Buck sucks in a breath.</p>\n<p>\"This looks kind of uncomfortable,\" Eddie says softly, and slowly unbuttons the top button of Buck's shirt, exposing the hollow at the base of his neck. It's almost like he's trying to see what Buck will do, how much he'll permit. \"Is this better?\"</p>\n<p>Buck nods, mouth dry, wordless. Eddie's fingers slide down, and he deftly picks off two more buttons, exposing Buck's upper chest. The room feels warm and his heart his pounding and he's never wanted anything so badly in his life.</p>\n<p>Eddie pauses, but Buck hasn't stopped him, and his right hand slides slowly down from Buck's shoulder to the base of his throat, where his fingertips slip inside Buck's collar and flutter curiously over his skin, right where he'd sprayed his cologne before leaving the house.</p>\n<p>Buck can't do this - he can't let Eddie touch him and act like it means nothing, because it means everything. Eddie's looking at him like he really sees him, into him, and the thought that someone might do that and not run away-</p>\n<p>He puts his hands on Eddie's face and kisses him, tentatively, in case Eddie doesn't want that. But Eddie kisses him back, soft and smooth and leading until Buck relaxes into it, walks them back until Buck is up against Eddie's fridge with his shirt half-open and his tie abandoned on the counter.</p>\n<p>Eddie's thumb presses lightly into the hollow of his throat, and Buck moans, muffled, into his mouth. He chases Eddie when the other man pulls back, blinking.</p>\n<p>\"Why'd you stop?\"</p>\n<p>Eddie's flushed and his lips are kissed red and his eyes are glinting in the darkness, smouldering. \"If we keep going,\" he breathes, \"we're gonna have sex, and you mean too much to me to have sex on the first date.\"</p>\n<p>Buck nods, trying to catch his breath. \"Yeah,\" he croaks. \"I - yeah, you're right. We shouldn't have sex yet.\"</p>\n<p>Eddie stays close, though, and his eyes travel Buck's body. \"Fuck, you are beautiful, though,\" he murmurs.</p>\n<p>Buck smiles, open-mouthed, toothy. \"You aren't so bad either, Diaz,\" he says.</p>\n<p>Eddie smiles. His eyes crinkle with affection. \"Coffee?\" he asks.</p>\n<p>\"Yeah. Love some.\"</p>\n<p>~*~</p>\n<p>\"Jesus, Buck, you're heavy.\"</p>\n<p>\"Nngh?\" he asks intelligently.</p>\n<p>\"Yeah I'm talking to you!\" Someone is shoving him. \"God, you're like a two-hundred pound heater, what are you eating every day?\"</p>\n<p>Buck yawns, allows himself to be pushed off by Eddie. \"But you're warm,\" he mumbles.</p>\n<p>\"I think you're warm enough on your own.\" He hears Eddie leave the bed, then, distantly, the toilet flushing. Footsteps, and the blankets lift and Eddie's back and Buck rolls to snuggle up to him, tugging Eddie close enough to toss a leg over his hips.</p>\n<p>\"What are you, part koala?\" But Eddie hugs him back. \"Good morning.\"</p>\n<p>\"Morning,\" Buck mumbles sleepily.</p>\n<p>\"No no, no - do not go back to sleep, Buck,\" Eddie says, jostling him rudely. \"If you don't make breakfast, we all starve.\"</p>\n<p>\"You only want me for my cooking,\" Buck accuses.</p>\n<p>\"It's part of the long list of reasons I want you.\"</p>\n<p>He lifts his head, squinting at Eddie in the bright morning light. His hair is all floofy and he's smiling guilelessly at Buck.</p>\n<p>\"Flattery will get you nowhere, Diaz,\" he says, and then sneezes.</p>\n<p>Eddie flinches. \"God, Buck, cover your mouth,\" he complains, then, \"did you take your hayfever tablets?\"</p>\n<p>Buck sniffles, rubs his nose. \"No?\"</p>\n<p>He follows Eddie's gaze, then, to the open bedroom window and the sound of bees buzzing happily in the little flowerbed that lines the side of Eddie's house. \"Crap,\" he says miserably.</p>\n<p>Eddie sighs. \"Gonna be another long day.\"</p>"
}