{
  "id": "23581942",
  "url": "https://archiveofourown.org/works/23581942?view_full_work=true",
  "author": [
    "defractum"
  ],
  "title": "dream of a funeral; hear of a marriage",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "魔道祖师 - 墨香铜臭 | Módào Zǔshī - Mòxiāng Tóngxiù",
    "魔道祖师 | Módào Zǔshī (Cartoon)",
    "陈情令 | The Untamed (TV)"
  ],
  "relationships": [
    "Lan Zhan | Lan Wangji/Wei Ying | Wei Wuxian"
  ],
  "characters": [
    "Lan Zhan | Lan Wangji",
    "Wei Ying | Wei Wuxian",
    "Junior Ensemble (Modao Zushi)"
  ],
  "additional_tags": [
    "Alternate Universe - Canon Divergence",
    "Happy Ending",
    "Domestic Fluff",
    "First Time",
    "Fluff and Humor"
  ],
  "language": "English",
  "series": "",
  "published": "2020-04-10",
  "completed": "2020-05-01",
  "words": "26,566",
  "chapters": "4/4",
  "comments": "952",
  "kudos": "17,855",
  "bookmarks": "4,181",
  "hits": "166,114",
  "summary": "<p>The news spread around the cultivation world quickly: Hanguang-jun would take whomever was skilled enough to take the Gusu Jade Token from around his neck as his cultivation partner and spouse.</p>\n<p>Ten years later, Wei Wuxian is brought back into Mo Xuanyu's body, and he is awfully confused as to why random cultivators keep trying to attack Lan Wangji.</p>",
  "notes": "<p>This is primarily based on book canon with some small tv show/donghua elements.</p>\n<p>Many thanks to <a href=\"https://archiveofourown.org/users/tellthemstories/pseuds/tellthemstories\" rel=\"nofollow\">tellthemstories</a> and Alba for the beta job. :D :D</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>\"I, myself, am only just around twenty! I think, anyway.\" - as far as I know, WWX is around 24 when he dies, and WWX doesn't know the exact age of MXY when he dies, only that he's older than Mo Ziyuan. Given that he's shorter than WWX's original body and is also likely malnourished/smaller, 20 is just a guesstimate on WWX's part</p>\n<p>You may have noticed that this has switched from 3 chapters to 4 - that is because it turns out I am exceptionally bad at guesstimating how many words it takes to write a certain number of scenes, so I've split the last chapter into two for length.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">notes</a>.)\n</p>\n<p>Thanks for sticking with it! I have to tell you all - I was loving the screeching comments that came in after Chapter 2, so thank you so much.</p>\n<p>Come find me on <a href=\"https://defractum.tumblr.com/\" rel=\"nofollow\">tumblr</a>!</p>",
  "text": "<p>When Wei Wuxian is called back to life, to inhabit the shell of a half-starved young man who carved his pain into his own arms and begged a vengeful spirit to take his place, there is a bully of a cousin, and a vengeful arm, and a dozen pristine white junior disciples, and the single white firework of the Gusu Lan signal hanging delicately in the night sky before it fades.</p>\n<p>There is a tetchy donkey that carries Wei Wuxian to the mountain that is not Rice Mountain, to where the cave of the mountain goddess lives, waiting. And there are the reedy notes of an improvised flute call to the sleeping Ghost General, to draw the suspicion of Sect Leader Jiang, and a bad first impression made on an orphaned nephew.</p>\n<p>And Lan Wangji arrives, and he does not say 'come back with me to Gusu' – he does not have to, because Wei Wuxian throws himself behind the man standing tall between him and Jiang Cheng and tells them all that he will stay with Hanguang-jun.</p>\n<p>This is a familiar story, so far.</p>\n<p align=\"center\">*</p>\n<p>Wei Wuxian is in the middle of realising that the Lan disciples are taking him back to Cloud Recesses when their group is attacked. His dramatic flop onto Lil Apple's back goes almost entirely unnoticed as a flurry of pale green robes flies out from the trees that line their path, a sword glare slicing through the air towards Lan Wangji.</p>\n<p>The stab misses. Lan Wangji flows out of the way like water, drawing Bichen in the same breath to parry the strike away. He draws the attacker – there is only one – up the path away from the group. None of the junior disciples follow. In fact, one of them even pulls the reins of Lil Apple close, as if to stop their progress. Wei Wuxian finds it curious. He doesn't expect any of them to be better than Lan Wangji, not if his swordwork is anywhere near as good as it was when they were young, but they don't even make a move to help.</p>\n<p>\"Not even a declaration of intent,\" mutters one of them. The others shush him.</p>\n<p>Wei Wuxian can see some of the fighting still; they're not that far ahead. The assailant is from the Nie clan, if the robes are anything to go by, which is odd. The Nie and Lan sects were on very good terms when he died (and he is still trying to wrap his head around the fact that he <em>died</em>, and now he's no longer dead). It's no one that Wei Wuxian recognises, although admittedly he doesn't know as many of the Nie as he does some of the other sects. They can hear the clangs of swords striking against each other, and there are flashes of white and green as robes whirl. The muted exhalations of breath filter through the leaves.</p>\n<p>And then, silence.</p>\n<p>\"Sounds like it's done,\" says the mutterer, not without scorn. Jingyi, his name is; Wei Wuxian remembers it from when one of the others had said it at the Mo estate. Lan Jingyi tugs on Lil Apple's reins and Wei Wuxian also moves forward by virtue of still being draped across the donkey's back. When they move up the path, they find the unknown Nie cultivator bowing low to Lan Wangji, one of his sleeves torn and now trailing the ground from where it's been slashed open.</p>\n<p>\"I have been bested,\" he says. \"This time. But I may well try again.\"</p>\n<p>Lan Wangji bows back, and says nothing as the man gets on his sword and flies away.</p>\n<p>Wei Wuxian watches him go, with bemusement. \"You're just going to let him leave? After attacking you like that?\"</p>\n<p>Lan Jingyi snorts, and flings the donkey's reins back at him. \"What, you think Hanguang-jun is going to kill him? Now he has to live with the shame of being defeated by Hanguang-jun.\"</p>\n<p>\"Your mind jumped very quickly straight to killing. There's a whole spectrum of things that you can do to a person in between killing and just letting them run off, you know,\" Wei Wuxian says with an exaggerated pout. \"Anyway, there's no shame in being defeated by the illustrious Hanguang-jun; there's rarely someone who can beat him anyway. Or so I heard,\" he adds quickly.</p>\n<p>They pass through the first of the Cloud Recess arches before Wei Wuxian realises that he's been so distracted by the attack that he forgot to throw his fit about coming back here, of all places. It's the sight of the wall of rules that makes him gasp, and hurl himself back towards the warded gate, towards the invisible boundary that establishes the edge of Cloud Recesses territory.</p>\n<p>(The wall is even longer than he remembers it, and that's really just not <em>fair</em>, he's already spent so much time memorising the first three thousand rules.)</p>\n<p>Lan Wangji steps in, arm outstretched, and catches Wei Wuxian around the waist. Wei Wuxian would admire that arm strength, if he weren't too busy wailing and kicking his legs. This body is too weak, its growth stunted by years of malnourishment and trauma, and its golden core barely formed. Lan Wangji hefts him back onto the donkey with one arm, and looks towards where Wei Wuxian knows the main building complex lies, sprawling in among the trees of the mountain.</p>\n<p>\"Take him to the Jingshi,\" he says, and leaves them.</p>\n<p>If someone had asked Wei Wuxian, before he died, as to who would win between him and a gaggle of teenagers, he would have laughed in their face. But now, a half dozen of them crowd around him and wrestle him up the rest of the stairs even as they lean away from his shrieking, and bundle him into a room and slide the doors shut behind him.</p>\n<p>As Wei Wuxian stumbles in, the room feels at once both intensely nostalgic, and entirely anew. I's reminiscent of the guest rooms that he stayed in when he studied here, with the same gentle clouds carved into the wood surfaces and the delicate mountain scenery inked upon the paper screens. But there are hints that this is not a guest room – a guqin stand, though it is empty; a calligraphy set, the ink stone turned upside down to air dry.</p>\n<p>It doesn't feel enough for a personal room either, which unsettles Wei Wuxian somewhat and he feels like he's intruding merely by existing; already, his muddy shoes are the most unkempt thing in the room. He shucks them off, and prowls around.</p>\n<p>After three circuits around the room, he's bored. There really isn't anything of interest out on display.</p>\n<p>He gravitates towards the bathing area instead; he hasn't had a chance to clean himself properly since he came into this body; it's been almost three days, and he's covered in dried sweat, travel dust and the remnants of Mo Xuanyu's make-up.</p>\n<p>He sets up the screen in case Lan Wangji comes back halfway through, and sets to shedding his clothes and heating the water. While that's happening, he rifles through the cupboards until he comes up with the towels he's least worried about completely ruining (they're still a pale blue, instead of stark white, but it will have to do) and wets one to wipe himself down.</p>\n<p>Dried white paint crumbles off the sides of his face; the dried dust, now wetted, turns to streaks of mud. He grimaces, and then catches his expression in the mirror, and laughs at himself instead. Unfamiliar eyes dance with a familiar spark back at him. It's vain for him to feel this disgusted, considering he once lived in an actual cave on the site of thousands of rotting bodies.</p>\n<p>The skin across his back pulls from where Zidian sliced across him; his front aches from where Mo Ziyuan and the others kicked him. The last remaining curse scar on his arm stings when he splashes it. But when the water is ready and he's scrubbed the worst of the dirt off his skin, so none of these things matter as he sinks into the tub gratefully, and the too-hot water envelopes him in warmth.</p>\n<p align=\"center\">*</p>\n<p>Wei Wuxian doesn't remember falling asleep. He startles awake to find himself sliding down the bath in tepid water. In the last few months, or years really, before his death, he could never sleep well; his nights were spent jerking back to wakefulness from the slightest sound, a brisk breeze, the smallest of warning signs that he was under attack.</p>\n<p>So even the sound of socked feet and the rustle of robe hems along the floor on the other side of the privacy screen are enough to make him fling himself upright, sloshing water everywhere. He slips around for a long moment before he throws his arms over the edge, catching himself. His heart thumps painfully against the front of his chest as he blinks water out of his eyes.</p>\n<p>The rustle stills. \"You are awake.\"</p>\n<p>\"Ahahahahaha,\" says Wei Wuxian, although there's nothing funny at all. Nervous response. He clamps his mouth shut. Inhales, and gathers himself. He wants to apologise. He will not, because he's pretending to be a lunatic. \"Yes. How did you know I was asleep? Did you peek?\"</p>\n<p>A moment of silence. Then: \"You were in there for an hour without moving or speaking. I presumed. Forgive me if I was incorrect.\"</p>\n<p>It's a good thing there's a screen between them, or Lan Wangji would have seen the startled grin on Wei Wuxian's face. Humour! Who would have thought? Perhaps the last ten or so years has thawed the stiff Hanguang-jun some.</p>\n<p>\"Haven't you ever heard of meditating in the bath?\" He says, with great dignity. \"It's good for cultivation, you know.\"</p>\n<p>\"Unfortunately, I have not. I would implore you to teach me.\"</p>\n<p>Wei Wuxian laughs for real this time. \"Ah, Hanguang-jun, Hanguang-jun. Have pity on this poor cutsleeve, you would raise his hopes too high.\"</p>\n<p>He stands and lets the water sluice off him, looking down at his new body properly for the first time. Scrawny, underfed. He'd known this. Plenty of old scars and fading bruises, though none as bad as the ones on Wei Wuxian's original body. Long hair, now drenched and matted and dripping down his back. He'll make it work.</p>\n<p>He scrubs himself off, eyeing Mo Xuanyu's clothes with distaste. Now he's clean, he can hardly bear the thought of dragging those dirty robes back on, but it's not like he has any other clothes. He sighs, and pulls them over to himself, when he hears Lan Wangji move again. He watches as a set of neatly folded robes are slid around the screen. Black, with a dark red underlayer, just like the ones he used to wear.</p>\n<p>His eyebrows climb up almost to meet his hairline. \"These don't seem your colour. Although you must look very dashing in red.\" The words are out before he considers the implication of it – red, wedding colours. He bites his lip; perhaps that was too far.</p>\n<p>\"They are not mine.\"</p>\n<p>Wei Wuxian waits for more, but evidently none is coming. He shrugs on the robes anyway. They're heavy, a good quality weight of fabric, and slightly big for him. And – there are lotus flowers embroidered subtly in the black, just on the edge of the sleeves, in the darkest of purple thread. Were these his? From before? He doesn't remember them, and he never had particularly good quality clothing after he removed himself from the Jiang Sect, and he doesn't know why Lan Wangji would have them anyway even if they were his. But then who else wore black and red, and who else would have an association with the symbol of the Jiang clan? Stranger and stranger.</p>\n<p>The sound of the kettle from the other side startles him back into action; he ties the robes shut firmly, hoisting the trousers up and slinging on the outer layer. Lan Wangji is kneeling at the table, brewing the tea for a covered dinner that has probably long gone cold.</p>\n<p>\"Ah, Hanguang-jun, you shouldn't have waited for little old me.\"</p>\n<p>\"I did not want to disturb your meditation.\"</p>\n<p>Now Wei Wuxian can see his face, he is impressed. The man is completely deadpan, and it makes him huff in laughter reluctantly.</p>\n<p>Set on what is evidently Wei Wuxian's side of the table, there is a hairbrush, and a length of red ribbon. Something swells inside of Wei Wuxian unexpectedly, a feeling that starts in his chest and chokes his throat, he stares down at the hairbrush, and finds himself blinking away tears. It's such a small gesture, but this feeling of being taken care of… It reminds him of his sister.</p>\n<p>They sit in silence, Wei Wuxian brushing his hair out and then tying it up, Lan Wangji setting out their bowls, chopsticks, a cup of tea. It's… nice.</p>\n<p>And then Lan Wangji takes the cover off the food and Wei Wuxian sees the steam waft up. He leans forward with interest, and sees the slip of yellow on the inside. \"A heating talisman? For shame, use of cultivation for such a petty reason! Isn't that forbidden in Cloud Recesses?\"</p>\n<p>He's not forgotten the bland food of Gusu either, and he's just resigning himself to it for a couple of meals before he figures out what he's going to do now as Lan Wangji sets the small plates out methodically, and then finally a little jug of chili oil.</p>\n<p>\"Ah, I'm glad you also think the food here needs something more. I guess when you take food in your own quarters, you can add whatever spice you like.\"</p>\n<p>\"No talking during meals,\" says Lan Wangji with the soft tone of someone who has said these words a thousand times, more out of habit now than conviction. He pushes the chili oil towards Wei Wuxian, and doesn't take any for himself.</p>\n<p>Wei Wuxian spends dinner watching Lan Wangji from under his eyelashes, shamelessly stealing food out of his bowl and interjecting random observations into the still air and then falling quiet again before he can be reprimanded for talking. Lan Wangji spends it staring into the middle distance, serene as ever.</p>\n<p>After they've finished and packed all the dishes away to be taken to the kitchens, Lan Wangji rises, folds back the screen. Even Wei Wuxian winces at the mess that he's managed to make in the bathing area, but Lan Wangji doesn't say anything, simply scoops up all the used towels and dirty clothes and starts folding them to put in a hamper for the laundry. It's not until he's folding Mo Xuanyu's filthy <em>underwear</em> that Wei Wuxian lurches to his feet.</p>\n<p>\"Ah, Hanguang-jun! If you wanted to touch my underwear, you only had to ask!\" There is no excuse for what just spills out of his mouth. Wei Wuxian is pretty sure his own face is flaming with the embarrassment of his own words, and he doesn't have any make-up to hide it behind now.</p>\n<p>Lan Wangji sighs, shaking out the sleeves of the outer robes before depositing them too into the basket. A small collection of crumpled talisman paper and the makeshift bamboo flute are in his hands when he returns, placing both on the table. Wei Wuxian reaches for the flute – it's an awful instrument, but it counts as his only weapon aside from his voice for now – but Lan Wangji covers his hand with his own before he can pick it up.</p>\n<p><em>Lan Zhan doesn't like physical contact</em>. The thought bubbles to the top of Wei Wuxian's head unbidden.</p>\n<p>\"I have something for you,\" Lan Wangji says, as if the warmth of his entire palm pressed against the back of Wei Wuxian's hand is not making Wei Wuxian's mind implode right now. He sits back down and reaches inside his sleeve, pulls out a flute that he rolls into both his palms and offers to Wei Wuxian with a slight bow.</p>\n<p>It's certainly not Chenqing. It's lighter, not just the weight but the energy, without the residual demonic energy that lingered around his old flute by the end. It’s made of polished white bamboo with a matching cream tassel and white jade pendant, a mountain scene in miniature carved around the finger holes. Two small rabbits nestle next to where his right little finger would lie. Wei Wuxian runs his fingers over them, remembering the two rabbits that he gave Lan Wangji on a whim once.</p>\n<p>\"For me,\" says Wei Wuxian. \"Er, I don't know if you heard me on the mountain back there, but I'm not very good, and this is a lovely flute. Maybe—\"</p>\n<p>\"Wei Ying.\"</p>\n<p>Wei Wuxian's hands convulse around the flute; his fingers slip and he snatches it out of the air before he drops it. \"Ah! Oh no, not you too. You don't believe Sect Leader Jiang–\"</p>\n<p>\"Wei Ying. You came back to Gusu with me this time.\"</p>\n<p>Wei Wuxian stops, tries to figure out what he means. And then he remembers all the times they had met, after Wei Wuxian had taken the Wen prisoners to the Burial Mounds, and how Lan Wangji would entreat him to come back to Gusu with him. He hadn't then, obviously. Lan Wangji is still staring at him from across the table, as if Wei Wuxian might disappear if he looks away – as if he doesn't quite believe it, that Wei Wuxian has actually come with him this time, asked to come with him, even.</p>\n<p>Wei Wuxian looks down at his robes in the colours he used to wear with the embroidered lotus flowers lying against his wrist, at the tray they'd packed all their dishes on to with the empty jar of chili oil. At the flute in his hands, with the rabbits that he gave to Lan Wangji carved into the bamboo. Try as he might, that's too many signs to ignore.</p>\n<p>\"Lan Zhan,\" says Wei Wuxian, and it's only because he's looking very closely that he sees Lan Wangji's fingers tremble for a moment before he gets them under control. He sighs, and closes his eyes. \"Yes. It's me.\"</p>\n<p>The admission weighs the silence between them, stretching it thin.</p>\n<p>\"Did you know? That I was summoned back?\"</p>\n<p>\"No. Many have tried, but none had succeeded.\"</p>\n<p>Wei Wuxian rolls that around in his head for a moment. So Lan Wangji has these things – the clothes, the flute – ready for him, even though he didn't know about the summoning. Why? Just in case. It doesn't make sense. He doesn't understand, and he has so many questions that are all laced together that he needs time to pick them apart. His body's heavy, after the travelling and the bath and the food, and he's – he's so tired.</p>\n<p>He tips the flute up at Lan Wangji and bows his head. \"Thank you. It's beautiful.\" Everything else can wait.</p>\n<p align=\"center\">*</p>\n<p>The Jingshi is empty when Wei Wuxian wakes. The windows are open in the main area, sunlight streaming in through between the leaves, dappling the floor in shadow that tells him that it's just a little before noon. There's a lidded basket on the table, labelled 'breakfast' in impeccable calligraphy, and he opens it to find another heating talisman keeping some congee warm. He smiles, despite himself, peeling it off. A frivolous use of spiritual energy indeed. Somehow, he's glad that Lan Wangji has learnt - or, perhaps, allowed - himself to bend for small comforts such as these.</p>\n<p>After the bustle of the Mo Estate with livestock, servants and rowdy cousins everywhere, Cloud Recesses is so silent that it makes Wei Wuxian almost uncomfortable, like the inhale before a shout, the calm before the battle. He imagines that everyone is hard at work at this hour if things haven't changed since he studied here, and makes his way towards the back of the mountaintop instead. At least here are the sounds of nature; the birds, the flow of the river.</p>\n<p>It’s strange, to have the time to idle like this. His entire life has been lived between push and pull – the push of the cultivation world's rules and expectations and the pull of what his heart feels is right. Now that there are no expectations of him, it's as if he's been cut loose. Perhaps this is what freedom feels like.</p>\n<p>The peace is momentary.</p>\n<p>That afternoon sees them heading back down the mountain after they spend the morning suppressing the disembodied arm that had appeared on the Mo Estate, Hanguang-jun sent to investigate and Wei Wuxian tagging along for some reason unknown to anyone else. They're headed north-west, in the direction they think will supply answers. He's never travelled along this way before – he's always come to Gusu from Yunmeng, which is largely over water – and he's enjoying passing through the villages and town, watching the people and trying the food. Lan Wangji pays for everything, ready with his money pouch an arm's length away when Wei Wuxian even starts thinking about buying anything.</p>\n<p>\"Ah, Lan Zhan, so generous! I'll share with you, here,\" says Wei Wuxian, tearing a steaming bun in half, and giving the larger half to Lan Wangji.</p>\n<p>Lan Wangji doesn't ask why he's still here, following Lan Wangji on a mission that he doesn't have to be, and Wei Wuxian only thinks about leaving once or twice before dismissing the thought. He doesn't have anything else to be doing, aside from trying to solve the last curse wound on his body, and he has no clues as to who that could be, and he is curious to see who the arm belongs to and why someone released it on the group of Lan juniors.</p>\n<p>Somewhere along the way, they start sharing a room at the inns they come to in the evenings. At first, it's because Wei Wuxian falls asleep at the table after playing Rest and wakes to find himself tucked into the far side of Lan Wangji's bed, only the light indent on the pillow next to him to indicate that Lan Wangji himself had also slept there. And then it's because he has a nightmare and startles the both of them by stumbling around his room, crashing into the furniture and waking up thinking that he's still on the battleground and Lan Wangji bursts in to find him sprawled amongst the remains of a broken chair.</p>\n<p>And then another patron stumbles into the wrong room by mistake and they both remember that Wei Wuxian's main weapon is the flute, and he can't very well use demonic cultivation on random drunk civilians, and the security of Lan Wangji positioned between him and the door is comforting. And then, he finds that the warmth of Lan Wangji's body a hand's width from him lulls him to sleep in a way that no amount of tea and incense does.</p>\n<p>He mentions it only once, and a tiny little furrow appears between Lan Wangji's eyebrows. He drops the subject.</p>\n<p>It's about two weeks of this when they're attacked on the road. Or, more accurately, Lan Wangji is attacked. Again. They're just on the outskirts of the last village before Qinghe, having stopped there for lunch, when someone screams from behind them, \"Hanguang-juuuuuuun!\"</p>\n<p>Lan Wangji uses one arm to shove Wei Wuxian off the path and the other to deflect the sword strike that comes his way using Bichen, still in its sheath. Wei Wuxian raises the flute to his lips when Lan Wangji says sharply, \"Do not interfere.\"</p>\n<p>Right. Wei Wuxian understands that Lan Wangji doesn't need the help, but he's still taken aback for a moment.</p>\n<p>The assailant is wearing robes of a midnight blue – Wei Wuxian doesn't recognise the motifs, so it must be a smaller sect – and her attack style is aggressive; lots of slashes to the chest and straight thrusts that do nothing to calm Wei Wuxian’s nerves. Lan Wangji disarms her with a stab of his fingers to the pressure point on the inside of the elbow, loosening her grip. He catches her sword before it drops to the ground, flipping it in his hand before extending it back to its owner, hilt first.</p>\n<p>\"Well fought, as expected of Hanguang-jun,\" grumbles the woman, taking her sword back and rubbing her arm. She bows to Lan Wangji, hesitates, and then spares a glance and a short bow to Wei Wuxian as well. Lan Wangji bows back, and she departs.</p>\n<p>This incidence reminds Wei Wuxian that this has happened before as well, when they were with the junior disciples. He'd forgotten it, the moment overshadowed by coming back to Cloud Recesses, and then the revelation of his identity, and <em>then</em> the murderous arm overpowering the Lan disciples, but now that it's happened twice, he's starting to wonder what he's missed while dead.</p>\n<p>He steps back onto the path, watching the woman retreat with a dignified scurry. \"I'm not completely useless in a fight, you know. I can help.\"</p>\n<p>\"It is unfair if Wei Ying helps.\"</p>\n<p>\"Unfair? People keep attacking you! If I’d kept to that after the Sunshot Campaign, I’d have been killed within a week. Of course, there wasn’t anyone around to help me apart from Wen Ning anyway, but I would have appreciated the help.” He pauses at the way Lan Wangji has gone still. “Not you, of course! I don’t mean you. I enjoyed all the times we fought, you know.”</p>\n<p>After a moment, Lan Wangji looks away and starts walking again. “These are duels; it is right that they are fair.”</p>\n<p>Wei Wuxian wants to tell him that duels don’t start with a stranger ambushing him when he’s just going along his way, but something else is nagging at him. “So there’s a reason people keep attacking you then?”</p>\n<p>Lan Wangji merely looks at him.</p>\n<p>\"Right, yes, of course there is. Let me change my question – <em>why</em> do people keep attacking you?\"</p>\n<p>\"Pride.\" It is against the Gusu Lan rules to have too much pride, but there’s an air of... <em>something</em> when he says that. He might call it bemusement, if pressed.</p>\n<p>\"What, you're the greatest swordsman in the land, so everyone wants to be able to beat you in a duel?\"</p>\n<p>\"Mn. Something like that.\"</p>\n<p>\"...Really?\"</p>\n<p>When there’s no answer, Wei Wuxian sighs. \"Ah, Lan Zhan, Lan Zhan. You're going to have to give me more context than that.\"</p>\n<p>To his surprise, Lan Wangji looks away, turning his head enough that Wei Wuxian can see that the tips of his ears have gone pink. He stares in astonishment, for longer than is polite.</p>\n<p>It becomes apparent that Lan Wangji is having some sort of internal conversation, because it's a moment before he exhales the smallest of sighs, and nods. \"There was a proposal. To help redistribute the amount of influence between clans. The smaller clans felt that the Four held too much. They wished us to be amenable to auspicious matches for cultivation partners.\"</p>\n<p>\"So – engagements? How very traditional. And how did you end up involved in this?\"</p>\n<p>\"I am the reasonable choice.\"</p>\n<p>Wei Wuxian's eyebrows climb up his face. \"What? That can't be right. So, wait, Yunmeng: Jiang Cheng is the Sect Leader, there are no other direct descendants. I get that you can't just ask the Sect Leader to marry off to some unspecified cultivator. Qinghe, Nie Huaisang—\"</p>\n<p>\"Is Sect Leader now.\"</p>\n<p>\"Really? Nie Mingjue isn't – you know what, never mind. Huh, I can't quite imagine Huaisang as a Sect Leader. And then Gusu, there's Zewu-jun and you. And in Lanling, Jin Guangyao is Sect Leader and Jin Ling…\"</p>\n<p>\"Was too young.\"</p>\n<p>\"Wow. That really is everyone in the main families.\" He carefully avoids the bit where the bloodlines are so scarce partially because of things he was involved in during and after the Sunshot Campaign. \"I guess I'm lucky Mo Xuanyu was never acknowledged, or he might have been up for grabs. He's one of the Jin illegitimate children too. But more importantly, what kind of wedding engagement involves duels?\"</p>\n<p>It takes Lan Wangji longer to respond to this part of the story. It feels like he's picking his words carefully, trying not to offend anyone even when they are not within earshot. Wei Wuxian finds that adorably admirable.</p>\n<p>\"My brother understood my feelings on this matter. He let it be known that I was only open to a cultivation partner who could be my equal.\"</p>\n<p>Wei Wuxian mulls over that. \"I get that. You don't want to be saddled with someone who's bad at cultivating or – ha! – has a weak core, after all. So what, people challenge you and you will only accept someone who can beat you?\"</p>\n<p>\"Mn.\"</p>\n<p>Wei Wuxian stares at him for a long moment, before throwing his head back and laughing. \"That's inspired! And! You'll never have to get married, because no one's going to be able to best you! Oh my, you sneaky Lans! How long has this been going on?\"</p>\n<p>\"Ten years.\"</p>\n<p>\"Ten years? <em>Ten!</em> Lan Zhan, oh that is too rich!\" Wei Wuxian bursts into laughter all over again. \"I can't believe people are still trying!\"</p>\n<p>He has to stop, to wipe the tears from his eyes, and when he looks up, he swears he can see amusement lifting the edge of Lan Wangji's lips. He shakes his head in pity for those poor souls, doomed to forever fail. \"Ah, esteemed Hanguang-jun, I can see why they keep trying though. Who wouldn't want the beautiful, accomplished, clever Lan Zhan as a cultivation partner?\"</p>\n<p align=\"center\">*</p>\n<p>This exchange amuses Wei Wuxian for the next few days, even as he spends most of it running from awful barky dogs and bitter ex-brothers and arrogant nephews and far too much time is spent up to his elbows in dirt and bodies in various stages of decomposition. Lan Wangji remains tight-lipped when he asks who has, over the years, made an attempt for him (<em>no gossiping</em> – he remembers that one).</p>\n<p>Somehow, they actually manage to retrieve the two legs that go with the vengeful arm and, more out of coincidence than not, practically trip over the mysterious gravedigger who is trying to get the torso before they get there. It's an eventful couple of days, and it's not until they're in an inn with most of the body safely in qiankun bags that Wei Wuxian has any time to think more on this engagement business.</p>\n<p>Lan Wangji somehow has not a speck of dirt on his white robes and only the lightest sheen of sweat after what has been a very long day, whereas Wei Wuxian has grime up to his elbows and what is probably rotting flesh stuck under his fingernails.</p>\n<p>They have a pretty good routine going on now. They’ll arrive at an inn, eat in one-sided silence, and play Rest to calm the arm. Lan Wangji will meditate for a bit and then start getting ready for bed and Wei Wuxian will stay up for a few more hours. He actually spends a lot of it meditating.</p>\n<p>The irony of him sitting in the semi-darkness, meditating diligently in silence of his own free will, is not lost on him, but Mo Xuanyu's golden core is weak and he's not wasting the chance to develop one again now he knows what it feels like to have a hollow feeling in his chest instead. He’ll stretch out - his physical body is getting better too, with the amount of walking they're doing each day - and then climb over Lan Wangji to sleep. He’ll wake around mid-morning to the sound of Lan Wangji puttering around with a late breakfast for him after his own meditation and errands, and they’ll set off again.</p>\n<p>Tonight has a different air about it. It’s not quite a victory, since they only have half the body, but it feels as though they’re moving in the right direction, at least. It’s also not until they’re safely in their room that Wei Wuxian realises how rattled he is from encountering Jiang Cheng again, and having his <em>shidi</em> know for sure that he's back.</p>\n<p>He takes over the bathing area first, and scrubs himself until it feels like he’s shaken the nervous energy out of his arms.</p>\n<p>When the food arrives, he’s pleasantly surprised to see five jars of alcohol set on the table. Perhaps he wasn’t as good at hiding it as he thought. He pastes a smile onto his face, and it somehow dissolves into a real one as Lan Wangji pours a bowl out for him. \"Lan Zhan! You spoil me. Are you going to join me?\"</p>\n<p>Lan Wangji folds himself down onto the floor as Wei Wuxian flops down opposite him. \"If you wish.\"</p>\n<p>Well. That's even more of a surprise. He doesn't say anything though, in case he takes it back, but the alcohol goes down easily – it must be particularly smooth, if even Lan Wangji can down a whole bowl of it in one go as if it were water.</p>\n<p>As it turns out, that's all Lan Wangji can do. Wei Wuxian waves his hand in front of his face when his eyes slip closed, incredulous. Even one finger, poked into his cheek, fails to elicit any sort of reaction. That's… that's ridiculous. Wei Wuxian sits back, propping his face on his hand, and just watches him for a moment. Lan Wangji is still sitting upright; all that practice sitting in perfect posture has clearly paid off.</p>\n<p>Wei Wuxian has had a lot of chances to see him asleep in the last fortnight. His face is softer than when he's awake. Wei Wuxian had always thought that he'd had a calm, neutral face awake, but now he knows what it looks like truly relaxed, he can spot the signs of the façade that he maintains during the daytime in the line of his eyebrows, the tension along the jaw. The mere thought of it, particularly to someone who wears his emotions as openly as Wei Wuxian, sounds truly exhausting.</p>\n<p>He leans over to catch a stray lock of hair that is starting to droop forwards, and tucks it behind Lan Wangji's ear.</p>\n<p>\"Ah, what am I going to do with you,\" says Wei Wuxian into the stillness as a fondness threatens to overtake him. \"Maybe I should cultivate this golden core more seriously and challenge you myself one day.\"</p>\n<p>The mood is broken by the appearance of Wen Ning at the window, and Wei Wuxian pulls back into himself. That's right – he does have things he has to take care of.</p>\n<p>There's another mystery to add to the pile in the two long nails he's holding in his hands, the ones that were previously stuck in Wen Ning's head, but as with everything else, first he has to deal with a drunk Lan Wangji bullying Wen Ning.</p>\n<p>\"Aiya, stop that, Lan Zhan,\" Wei Wuxian says, batting Lan Wangji's hands away from where he's about to hit Wen Ning again. He raises the flute to his lips. \"Look, I'll tell him to leave.\"</p>\n<p>Lan Wangji clutches onto his hands, and scowls at him.</p>\n<p>\"Lan Zhan? What? No flute?\"</p>\n<p>\"No.\"</p>\n<p>He sighs, and tells Wen Ning to hide for now. He doesn't <em>technically</em> need the flute to control corpses, and particularly not for the Ghost General. \"Alright, alright, I'll only play the flute for you. Come on, you grumpy little drunk.\"</p>\n<p>He mentally apologises to Wen Ning in his mind; he deserves better than this, especially when it looks like someone's been forcibly controlling him since before Wei Wuxian even died. But right now, he leads Lan Wangji away, their arms crisscrossed and entangled as Lan Wangji refuses to still let go of his hands all the way until they're back.</p>\n<p>\"I'm only going to get some water,\" says Wei Wuxian when he gets Lan Wangji seated on the bed and Lan Wangji finally, reluctantly lets go. He feels Lan Wangji tracking him carefully as he walks away and then back with a basin of warm water.</p>\n<p>\"Let's get you ready for bed,\" he says, dampening a cloth and starting to dab it over his face. It's not as good as a proper wash or bath, but it's something; it reminds him of how his <em>shijie</em> used to take care of him when he got a bump on the head or something.</p>\n<p>He talks, because that’s what he does when there’s silence that threatens to actually make him think about things he doesn’t want to think about. \"What have you got against Wen Ning, anyway? You know he's the nicest man dead or alive, when he's not being controlled by someone else.\"</p>\n<p>Lan Wangji's eyes narrow. \"Wei Ying's favourite?\"</p>\n<p>\"What? Is he my – ah, Lan Zhan, you know you're my favourite,\" says Wei Wuxian, with an easy smile and more uneasy thump in his chest.</p>\n<p>\"…Lying is forbidden.\"</p>\n<p>\"I'm not lying,\" he says, and there's suddenly the realisation that it's true is a painful lump in his chest. \"Lan Zhan is the best at everything, including being my favourite.\"</p>\n<p>He doesn't quite have to courage to look up and see what's happening on Lan Wangji's face but there's a moment of silence and then, almost too quietly for him to hear: \"Good.\"</p>\n<p>His hand trembles. It's been a long day. He finishes with the cloth and sets it aside. \"All done. Let's get you out of these layers, and then you can sleep comfortably. \"</p>\n<p>He reaches out and is met with a hand smacking him in the arm. \"Ow, what are you–\" He huffs as Lan Wangji swats him away.</p>\n<p>\"I'm just helping you get comfortable for bed, Lan Zhan. Nothing inappropriate, you know. Hold your arms out if you want to help,\" he says, feeling a bit like he's talking to a sulking child. He moves slowly, and he can see Lan Wangji's eyes tracking his movements again. He eases the heavy outer robe off, and then the belt, and then the second robe. He was going to leave the under robe, which was probably easier than getting him to change into his night robe, but Lan Wangji remains standing there with his arms outstretched, waiting.</p>\n<p>Oh, well. He takes that one off too, and it's lucky that Lan Wangji's turned away from him when he does because he's suddenly faced with the sheer expanse of Lan Wangji's back – and the ropes of scar tissue crisscrossing it. <em>What</em> – Wei Wuxian reaches out to touch it before coming to himself and pulling his hand back. No, that would be too much. His hand wavers a handspan away, close enough to feel the heat from Lan Wangji's body. They look old, whitened and gnarled with time, but – there are <em>so many</em>. Even looking at it now, through the filter of time, he can scarcely believe that someone, anyone, even Lan Wangji could survive this.</p>\n<p>It takes him a moment to remember what they're doing here, until Lan Wangji moves and Wei Wuxian takes a step back, clutching the underrobe to his chest. \"Ah–\"</p>\n<p>He doesn't even know what silly thoughts were going to spill out of his mouth, because whatever they were, they die in his throat when Lan Wangji turns around and he sees the scar on the front of his chest. A brand. The <em>same</em> brand as the one on his original body.</p>\n<p>\n<em>What happened?</em>\n</p>\n<p>It seems ridiculous that he’s never noticed, considering they've been travelling together and sharing a bed together for so long, but they generally get ready for bed separately. He wants to know, so desperately, and yet… this is the most inappropriate time.</p>\n<p>Lan Wangji notices the staring – of course he does, Wei Wuxian is being far too obvious about it – and follows his eyeline down to his own chest for moment, before picking up the damp cloth and holding it out.</p>\n<p>He shakes it insistently when Wei Wuxian fails to respond.</p>\n<p>\"Ah? You… you want me to wash you?\"</p>\n<p>Lan Wangji stuffs the cloth into his hand, and then turns and drops into a cross-legged position on the floor. He would be unnoticeably drunk, actually, if he weren't listing just ever so slightly to the right.</p>\n<p>Wei Wuxian takes his time getting down there – the sight of the whip scars is still a lot – but he does kneel, eventually, pulling the bowl of lukewarm water over and gently moving his hair out of the way. He wipes away the day's sweat and grime slowly, moving softly over the scars even though they've long healed over. This is… this is very nice.</p>\n<p>It becomes more awkward when he finishes the back and it's evident that Lan Wangji is expecting him to do the front as well. He tries to think of it like helping the Wen elderly with cleaning after he'd rescued them and he and Wen Qing had spent weeks nursing them back to health, but really, it's not like that at all. None of them stared him down impassively from less than one <em>chi</em> away, golden eyes looking out from under dark lashes; nervous laughter bubbles up from his chest despite himself, and he doesn't quite manage to quell it.</p>\n<p>\"Such a straight face, Lan Zhan. No one would ever know that you're drunk.\"</p>\n<p>There's a tug on his elbow and Wei Wuxian finds himself lurching forward – his hand goes out automatically, spread across Lan Wangji's ribs, and then there's a hand behind his head, holding the side of his face to his chest.</p>\n<p>\"The heartbeats.\"</p>\n<p>\"W-what?\" He's pretty sure his own heartbeats are accelerating exponentially at the moment.</p>\n<p>\"Listen to the heartbeats.\"</p>\n<p>He can feel them more than hear them, through the muscle of Lan Wangji's chest. Faster than normal. \"Ah… I see, I see. I can't tell from your face, hmm?\"</p>\n<p>Somewhere above him, Lan Wangji nods. Wei Wuxian extracts himself delicately, finishing the job by wiping a dry towel across him, and then ushers him towards the bed.</p>\n<p>It strikes him, rather suddenly, that they should probably stop sharing a bed now that he knows that Lan Wangji is up for marriage. Not imminently, but well, he's sort of promised to <em>someone</em>, in a vague kind of way. Wei Wuxian doesn't have to worry about his own reputation because realistically, he's never going to get married – who in the land is going to want to marry him?</p>\n<p>But then Lan Wangji is also there squashing his pillow in his arms and waiting for him to take the side nearest the wall, blinking in confusion when Wei Wuxian isn't getting in, and well, one more night isn't going to ruin his reputation even more than he's already done over the last few weeks and honestly, Wei Wuxian is tired.</p>\n<p>He crawls onto the bed and watches as Lan Wangji climbs in after him and then very seriously tucks him in before lying down.</p>\n<p>Wei Wuxian is woken far too early the next morning by the sound of someone falling off the bed, and it's not him. He raises his head just enough to look over, and sees Lan Wangji looking back at him. Even in the dusky light of dawn filtering through the curtains, he can see that Lan Wangji looks pale. They lock eyes for a moment, Wei Wuxian squinting blearily and Lan Wangji eyes wide. He watches as Lan Wangji breaks it off to scrabble around on the floor with no semblance of his usual grace, as if even he's confused as to why he's there, and then Wei Wuxian remembers.</p>\n<p>Ah yes, all of their clothes are still just heaped on the floor where Wei Wuxian had left them last night. He'd meant to fold them, or at least drape them over one of the chairs knowing how tidy Lan Wangji preferred to be, but then he'd been distracted by the scars and had forgotten to come back to it.</p>\n<p>Lan Wangji is getting unsteadily to his feet, and picking his clothes up. Wei Wuxian winces a little when he sees how rumpled the underrobe is. He's half tempted to go back to sleep - neither of them expect him to be up this early anymore, but it would probably be cruel to just ignore the subtle signs of tension he can see gathering around Lan Wangji's eyes right now.</p>\n<p>He sits up, and they're both equally startled when Lan Wangji flinches away from him.</p>\n<p>\"Ah... do you remember last night?\" He asks.</p>\n<p>The tight press of Lan Wangji's lips tells him all he needs to know.</p>\n<p>\"I don't know what you're thinking,\" says Wei Wuxian carefully. He isn't the type to overthink his words anyway, but tact comes even harder at five in the morning. \"But it wasn't like that. You got drunk, I tried to get you to take off your outer robes to get into bed, and you seemed more comfortable taking all of them off.\"</p>\n<p>He wonders, maybe, if he should mention the bathing. Probably not right now, given the harried way Lan Wangji is sliding his robes back on, as if they're some sort of armour that can distance him from this situation he's found himself in.</p>\n<p>\"Why don't you take your time?\" Wei Wuxian slides out of bed, telegraphing his movements as he does so. He doesn't exactly want to – his entire body just wants to flop back down into bed right now, but he figures that whatever emotional breakdown Lan Wangji seems to be on the verge of having is more important, and the least he can do is give the man some space for himself. He shrugs his outer robe on, tying the sash carelessly, and pulls his boots on with a hop. Lan Wangji watches him like even seeing this much movement is painful. He reaches over to pluck the money pouch from Lan Wangji's things, and heads for the door. \"I'll ask the owner to send up some calming tea for your hangover headache, and go find us some breakfast.\"</p>\n<p>The owner is also barely awake, but just about brewing some tea for herself when Wei Wuxian finds her in the kitchen, so he asks her to send some up, and heads onto the street. Most of the people up at this hour are people who have to be, so he wends his way through the streets casually, keeping out of the way of people bustling around for work, and letting the warming sunshine wake him up slowly.</p>\n<p>His stomach is grumbling by the time a couple of <em>dian</em> have passed, especially since the food he's amassing in his arms smells great; he heads back, reckoning that's probably given Lan Wangji enough time to settle himself.</p>\n<p>Lan Wangji is playing Rest when he gets back – actually, Wei Wuxian hears the strumming of the guqin from the common room of the inn and darts up the stairs three at a time. The qiankun bags are thrashing around the room when he flings the door open, with one falling open and an arm starting to claw its way out. It looks like Lan Wangji is just about managing to keep all of them mostly under control for now, but Wei Wuxian is very glad he didn't come back any later.</p>\n<p>He picks up his flute, inhales, and joins in on the next phrase.</p>\n<p>It takes longer than usual and he's starting to wonder whether Rest has started to lose its effect by the time the body parts finally go limp. When the bags stop twitching, they both reach for them, tying deadknots in the strings. \"We got lucky, Lan Zhan. I'd forgotten that we'd forgotten to play it last night.\"</p>\n<p>\"Mn.\"</p>\n<p>Wei Wuxian looks at him – his robes are still more rumpled than a Lan disciple would normally wear them, which is to say more than Wei Wuxian has ever seen on one of them, but decidedly less so than what Wei Wuxian's own look like most of the time. But the tea must have worked some, because he doesn't seem so much in pain anymore. Or maybe Rest helped him too.</p>\n<p>He looks down at the food that he'd unceremoniously dropped onto the table when he'd realised what was happening. It's probably more lukewarm than hot now, and definitely a bit misshapen from being dropped from a height, but he slides it across the table as a silent offering.</p>\n<p>Lan Wangji looks down at the three different kinds of buns, rolls of sticky rice and a greasy paper bag almost falling apart that's full of noodles. He reaches over to the tea tray and takes out a jar of chili oil that he slides over in return, so Wei Wuxian figures he's forgiven.</p>\n<p align=\"center\"><br>\n*</p>\n<p> </p>\n<p>The trail leads them to Yi City, and Wei Wuxian sees Lan Wangji fight for real for the first time since he was brought back. He hadn't realised, really, how much Lan Wangji had been holding back for the duels for his hand in marriage, but it's obvious he's really going for the kill when Xue Yang reveals himself. He almost wishes that the fog would lift so that he can appreciate it more, because he can only see the occasional sword glare from here. </p>\n<p>He itches to pick up a sword and test his skills against Lan Wangji like when they were young, but that's been lost to him now - his mind has the memory of the Jiang forms instilled in him over the years but this body doesn't have that muscle memory or stamina, and the golden core can't sustain the amount of energy needed right now. </p>\n<p>He and the junior disciples are waiting in the funeral home by the time Lan Wangji catches up with them. They don't manage to ensure that Xue Yang is dead, but his arm is lying on the ground, and Lan Wangji seems confident that he won't survive the injuries that he's inflicted. While Wei Wuxian has been apparently playing nursemaid, Lan Wangji has somehow also managed to capture the other corpse arm, which is what they were originally here for anyway. And then there's A-Qing's soul in a spirit capture pouch to take care of, and Xiao Xingchen's, and after they leave Song Lan to his mission, the whole host of distraught teenagers. So Wei Wuxian finds himself with his hands kept full.</p>\n<p>He's looking forward to getting to an inn and throwing himself on some cushions, but right before they enter the nearest one, one of the junior disciples steps out in front of him and Lan Wangji and bows deeply. He must be from one of the smaller clans, since Wei Wuxian doesn't recognise his dove grey robes. The Bai, perhaps?</p>\n<p>\"Excuse me. Hanguang-jun, forgive my impertinence, but would you do me the favour of your time? I know that this one is not worthy, but it would be remiss of me if I did not try. My sect is small, and it would be an honour to align more closely with the Gusu Lan.\"</p>\n<p>It takes them all a moment to realise what he means. Wei Wuxian sees the realisation dawn on everyone's faces at the same time it strikes him. The Gusu juniors are - mostly - too well trained to give off much of a reaction. </p>\n<p>Aside from Jingyi, of course. Wei Wuxian is starting to rely on him to provide the reactions that he sorely wants to give himself: \"But you're only sixteen!\" </p>\n<p><em>And Hanguang-jun is in his thirties</em>, goes unspoken.</p>\n<p>The boy's neck goes red, but he remains in his bow. He has guts.</p>\n<p>\"Ah, Hanguang-jun's not concerned about age! He likes them young!\" says Wei Wuxian breezily, slinging an arm over Lan Wangji's shoulders. \"I, myself, am only just around twenty! I think, anyway.\"</p>\n<p>There seems to be a sudden contagious cough that ripples through the junior disciples.</p>\n<p>There's also a tiny little pinch in Lan Wangji's forehead that Wei Wuxian would probably tease him for, if they weren't surrounded by other people. It's the equivalent of a mental sigh, he's pretty sure.</p>\n<p>Lan Wangji delicately plucks Wei Wuxian's arm off his shoulder using two fingers around his wrist. He bows to the boy. \"I commend your courage. It would be my honour.\"</p>\n<p>The compliment alone is probably enough to fell the kid. He looks stunned that Lan Wangji has even said yes. It's probably an exaggeration to call it any kind of serious duel. The Bai disciple is not bad at all, but he is also sixteen and Lan Wangji is Lan Wangji. The rest of them clear some space to the side of the inn. It starts as a bout, and ends up as more of a lesson as Lan Wangji parries, and demonstrates how to block a particular move at a speed that Wei Wuxian knows is about a third of his actual speed. The kid probably picks up more pointers about practical swordwork than anything else.</p>\n<p>It ends when Lan Wangji twists his hilt on a strike and sends the kid's sword flying into the grass. The Bai kid bows deeply, panting, \"Hanguang-jun, thank you for humouring me. It seems that this one is indeed unworthy.\"</p>\n<p>He's polite, if nothing else, although he does sound a little disappointed. He retrieves his sword and melds back into the rear of the group, which immediately clusters around him, excitedly dissecting the swordplay. </p>\n<p>Wei Wuxian is glad when Lan Wangji gets them a room upstairs in the inn. He enjoys the company of the younger cultivators, but tonight in particular, he's exhausted. He isn't much older than some of them, at least in mind and body, but he feels like he's a world apart from them in lived experiences, and the Empathy from being in A-Qing's head has left him with a maudlin mood. </p>\n<p>The inn brings up their food - \"And wine too! Is this becoming a habit, Lan Zhan?\" Wei Wuxian uncorks a jar and sniffs it. <em>Good</em> wine, if the smell is anything to go by. \"Are you joining me again?\"</p>\n<p>\"If you like.”</p>\n<p>Wei Wuxian is a bit surprised that Lan Wangji is still willing, considering how embarrassed he'd been after the last time. He pours a cup out this time instead of a bowl, curious to see if it makes a difference.</p>\n<p>It does not.</p>\n<p>Lan Wangji falls asleep straight away. Wei Wuxian takes the opportunity to slip out again and finally, finally talk to his old friend Wen Ning. There's too much to be said between them and not enough time; they're both comforting each other, each in the way they best know when Lan Wangji appears this time.</p>\n<p>Wen Ning disappears into the night and any thoughts Wei Wuxian has of figuring out who has kept him alive all these years vanish promptly when Lan Wangji ties his precious forehead ribbon around his wrists.</p>\n<p>In all honesty, Wei Wuxian's not sure what's more embarrassing, Lan Wangji dragging him through the inn common room and past all the junior disciples by the forehead ribbon like a trussed up prize, or the entire table of cups that Jingyi knocks over in his attempt to hide the wine they're drinking. Perhaps it's when Lan Wangji reaches out to tuck an errant lock of Wei Wuxian's hair behind one ear and follows it up with a sweet kiss on his lips only to immediately smack himself in the face and pass out, leaving Wei Wuxian desperately horny and confused in their room.</p>\n<p>Maybe they will just all never speak of this evening again; that would suit him fine, really.</p>\n<p>The next morning, Wei Wuxian is up before Lan Wangji. This is apparently something that only happens when Lan Wangji drinks. He heaves himself up and over Lan Wangi's body. He's quite lucky that the bed is particularly hard and Lan Wangji sleeps in that Lan body formation, because if this were anyone else, he would have stepped on an errant limb for sure. He gets dressed, sort of, and slips out of the door, only to almost be rapped in the face by a fist.</p>\n<p>Three people open their mouths to say something and Wei Wuxian quickly presses one finger against his lips, silencing them all. He shuts the door behind him, and leads Sizhui, Jingyi and Jin Ling away from their room. \"Don't disturb him, Lan Zhan's not awake yet.\"</p>\n<p>\"Not awake! But it's past five o'clock!\" Jingyi stares at him.</p>\n<p>\"Shh, keep your voice down. It was an eventful evening, all right?\"</p>\n<p>They stare at him some more.</p>\n<p>Wei Wuxian sighs, and grabs the edge of his robe where it's starting to slip down his shoulder to hoist it back up. \"Look, go... practice your meditation or sword forms or something for a little bit. Or just eat your breakfast without him. I'm going to ask the innkeeper to get him ready some breakfast and tea for later and I'll bring it up for when he wakes.\"</p>\n<p>The two Lan disciples bow; it looks like politeness is overriding any questions that they might have (or at least, that Sizhui has, as he not-so-subtly takes Jingyi's elbow and steers him away). Jin Ling, however, is not bound by those pesky four thousand Lan rules, and remains where he is, squinting suspiciously at Wei Wuxian.</p>\n<p>Wei Wuxian sighs again, this time mentally. Of all the people he least wants to be stuck alone with, it's Jin Ling. Even Jiang Cheng is better.</p>\n<p>\"You really are Wei Wuxian, aren't you?\" Jin Ling asks, and wow, it is far too early in the morning to have to go into this. He nods, eventually, and watches Jin Ling's lips press together so tightly they turn white. There's a lot of directions this conversation could go in, and the longer the silence stretches, the worse Wei Wuxian's imagination gets. \"...Well, it could be worse than Hanguang-jun.\"</p>\n<p>\"...What?\"</p>\n<p>\"Where are you headed after this?\"</p>\n<p>\"Wherever Lan Zhan thinks is best, I guess,\" says Wei Wuxian, still bewildered. Jin Ling's attitude is terrible, but it's an innocuous question at best. \"What about you?\"</p>\n<p>\"At least you're sticking with him properly,\" mutters Jin Ling, ignoring his question.</p>\n<p>Wei Wuxian waves a hand in front of Jin Ling's face. \"Hello? What are you talking about? I feel like we're having two separate conversations.\"</p>\n<p>\"After last night. I know what the Gusu Lan forehead ribbon means. And since you're now revealed to be a relative of mine–\"</p>\n<p>\"Mo Xuanyu was also already a relative of yours,\" Wei Wuxian points out.</p>\n<p>\"And <em>now</em> you're revealed to be a relative of mine,\" continues Jin Ling, \"and a cutsleeve at that, at least you're not behaving in a manner that brings shame on the family.\"</p>\n<p>He nods, firmly, and stalks off.</p>\n<p>Wei Wuxian has no idea what just happened. He also wants to grab him and ask what he meant by the comment about the Gusu Lan forehead ribbon, but the pesky brat has already whisked himself down the stairs and he doesn't want to keep Lan Wangji waiting too long - he probably will wake soon, by force of habit even if he's hungover.</p>\n<p>When he walks through the main inn area, chirping a 'Good morning!' to all of the junior disciples, they all stare at him. It's a bit unfair, really - here he is, valiantly pretending that last night didn't happen and that at least half of them aren't sporting hangovers and looking pale, and they don't even have the courtesy to pretend the same.</p>\n<p>At the threshold of the kitchen, the Bai disciple from yesterday corners him, bowing deeply. “Master Mo, please forgive me.”</p>\n<p>“I - what?”</p>\n<p>“I did not understand that you had a- a prior claim on Hanguang-jun. I can only apologise for my boldness. And thank you for your tolerance of my behaviour yesterday.” He flees, before Wei Wuxian can demand an explanation. </p>\n<p>Wei Wuxian turns to see the innkeeper looking at him inquisitively, and laughs it off uneasily. “Kids, eh?”</p>\n<p>He moves on swiftly - the innkeeper is more than willing to stack a tray with congee, fried dough and dumplings, as well as a couple of pots of restorative tea. He also offers to carry them up for them, but Wei Wuxian hefts it cheerily, and waves him off.</p>\n<p>(All the disciples stare at him again, on his way back.)</p>\n<p>He pads back into their room, where the light is starting to leak in around the edges of the curtains, bright slivers that slice across the floor. He sets the tray down and adjusts the curtain, turning the room back into a comfortable dimness. It takes a little bit of careful rustling in his sleeves before he can find what he's looking for, but he finds some crumpled talisman paper eventually. It's his turn to slip a heating talisman into their food tray, and then he crawls back into bed.</p>\n<p>The next time Wei Wuxian wakes up, he is entirely certain that Lan Wangji is also awake. The heartbeats, Lan Wangji had told him last time - well, Wei Wuxian can hear them clearly now, so much faster than a sleeping heart rate would be. And the reason he can hear them is because his head is nestled next to Lan Wangji's ribcage.</p>\n<p>He blinks his eyes open when he realises. He must have rolled over at some point after he fell back asleep; his cheek is now pillowed on Lan Wangji's bicep. It is much more comfortable than he might have expected it to be, now that he's seen how much muscle is on it.</p>\n<p>\"Ah, Lan Zhan, I'm sorry. You should have moved me if you wanted to get up,\" he says, scooting backwards. He yawns, and his jaw pops back in place. These couple of days of waking up early have really thrown his sleep behaviour off.</p>\n<p>\"I did not want to disturb you,\" says Lan Wangji from somewhere above his head. The bedcovers next to him move as Lan Wangji gets up, and Wei Wuxian follows him.</p>\n<p>\"I should warn you, it's way past five am, Lan Zhan. The juniors almost came to knock and wake you up, but I thought that after yesterday, you should get the rest you need.\"</p>\n<p>Lan Wangji looks down at the breakfast tray. He touches the edge of the talisman with one finger, and murmurs softly, \"A frivolous use of spiritual energy, Wei Ying.\"</p>\n<p>Wei Wuxian laughs. He knows - assumes, really - that Lan Wangji doesn't remember last night, but he's determined not to be the one to make it awkward.</p>\n<p>They eat, Lan Wangji somehow managing to also get dressed, clean himself and comb his hair back into its topknot in the same amount of time it takes Wei Wuxian to open the curtains and locate both of his shoes. The result is that they're fed and ready to go, mostly, by the time nine am rolls around, if 'ready to go' means Wei Wuxian has shrugged on his outer robe and tied the sash in a rough knot to keep it from slipping around. He's not even going to start on his hair - it's tied up with a ribbon and that's good enough for him.</p>\n<p>When they get downstairs, there is a depleted group of junior disciples waiting for them - mostly the Gusu Lan ones, actually, although there are a couple of others who look like they're about to leave. Most of them look like they've been lounging around and they snap to attention when they see Lan Wangji descend down the stairs with a chorus of hasty 'Hanguang-jun!'s. Wei Wuxian stifles a giggle, but all that does is make them all look at him. Some of them hide their shock better than others. Maybe he should have bothered to comb his hair.</p>\n<p>They find the remaining few disciples actually making use of their time in the inn courtyard, practising sword forms carefully out of the way of the staff and the roaming chickens. Lan Sizhui is, of course, among them. He reminds Wei Wuxian very much of Lan Wangji in their youth, although a touch less awkward with people.</p>\n<p>\"Hanguang-jun,\" Sizhui says, finishing his form and bowing to them both. \"Are you well?\"</p>\n<p>\"Yes. Are you returning to Gusu?\"</p>\n<p>\"Yes. Are you also headed in that way, Hanguang-jun?\"</p>\n<p>Lan Wangji looks at Wei Wuxian, who shrugs in return. \"We might as well. The arm isn't pointing us anywhere, so there must be something blocking it from finding the head. Perhaps if we show our findings to Zewu-jun or Teacher Lan, they might have some thoughts.\"</p>\n<p>Lan Wangji inclines his head in acknowledgement.</p>\n<p>\"In that case, I'll gather everyone to meet out front,\" says Sizhui.</p>\n<p>\"Wait - is Jin Ling gone?\" asks Wei Wuxian, looking up at the sun with the air of someone who doesn't care about the answer but also deeply does.</p>\n<p>\"He left after breakfast, Senior Wei. He said that he missed having his dog around.\" Sizhui bows again, and takes his leave - not quite quickly enough to hide his smile.</p>\n<p>Wei Wuxian watches Sizhui leave, and sniffs. \"That Jin Ling. Couching consideration in an insult. Truly Jiang Cheng's nephew.\"</p>\n<p>“He knows,” says Lan Wangji, tilting his head towards Sizhui. </p>\n<p>It takes Wei Wuxian a moment to catch up with his train of thought - Sizhui had called him <em>Senior Wei</em>. Jin Ling must have said something to him. He drums his fingers on his arm nervously; he's been trying not to get caught out, but there's something about Sizhui that reassures him. “Hmm. Awkward. But he doesn't seem to mind who I am, so… I guess I don't mind that he knows either.”</p>\n<p>The juniors are saying their farewells when Wei Wuxian and Lan Wangji get round to the front of the inn, having stopped by the innkeeper to try and settle their bill. (It turns out that Jin Ling has paid for all of the juniors in either a fit of generosity or an obscene display of wealth - or complete obliviousness at how much a night's stay at an inn costs for one person.)</p>\n<p>They depart too, the junior Lan disciples falling into a two-by-two formation even when they mount their swords. There's a moment of awkwardness when they look back to automatically let Lan Wangji take the lead to see him holding out a hand to help Wei Wuxian mount Bichen. Getting onto someone else's sword is always a bit weird - the resistance, the feel is different - so it takes Wei Wuxian a moment to get his balance, and he looks up to see them all studiously not-staring.</p>\n<p>\"Well, how else am I going to fly?\" Wei Wuxian asks them all. \"I was kicked out of the Jin clan, remember? I don't have a sword of my own. Did any of you others volunteer to carry me? No, I think not.\"</p>\n<p>Sizhui bows. \"If you would prefer to, I would be happy to accompany you for some of the way.\"</p>\n<p>\"Ah, you're a model Lan disciple, Sizhui,\" says Wei Wuxian, as he slides his arms around Lan Wangji's waist and hooks his fingers into his belt. \"But I think we'll be fine.\"</p>\n<p>He's aware that he's putting on a bit of a show mostly to shock the juniors and get their reaction - and he knows that Lan Wangji knows him well enough to know that this is what he's doing - but then he feels a hand on the small of his back to steady him.</p>\n<p>\"You know you don't have to if this makes you uncomfortable,\" says Wei Wuxian quietly, once they're in the air. \"I really am fine to fly with Sizhui or one of the others. Or walk. We could always walk.\"</p>\n<p>\"I know.\"</p>\n<p>Wei Wuxian opens his mouth to protest again, but Lan Wangji tucks him in more securely against his body, and he figures that he might as well just enjoy the show of trust for what it is. As they fly in characteristic Lan silence, he thinks about the kiss last night, and his head on Lan Wangji's arm this morning, and the hand steady on his waist now. They're all loose threads, and he's weaving them together slowly, but it's difficult when he doesn't know what the picture is. </p>\n<p>It's a relatively quick journey back to Gusu. Lan Wangji sets the pace and Wei Wuxian recognises it as brisk. Occasionally, he catches one or two of the juniors wavering on their sword out of the corner of his eye. He considers saying something about slowing down for everyone's comfort, but the way Lan Wangji's eyes deliberately slide away from the juniors when one of them needs help tells him that Lan Wangji is already aware. Even this is a training exercise for them, he suspects. And so, he says nothing for once.</p>\n<p>They're near Caiyi Town when Wei Wuxian pats Lan Wangji on the arm. He recognises the pier from where they would arrive from Yunmeng. \"Can you set me down? There's a few things I want to pick up from the town before we end up in Cloud Recesses.\"</p>\n<p>Lan Wangji slows. \"I will come with you.\"</p>\n<p>\"No need, Lan Zhan. And besides, a man's got to have a few secrets, hmm?\"</p>\n<p>Lan Wangji looks down at him, an eyebrow raising imperceptibly. The hand around his waist tightens, and then unclenches. Wei Wuxian pats it soothingly.</p>\n<p>\"Don't worry, I'll take one of the babies with me, they can make sure I'm not getting up to no good.\"</p>\n<p>\"Mn. Will you eat in Cloud Recesses?\"</p>\n<p>\"I'll pick up something in town and bring it back with me. You head on back first,\" says Wei Wuxian, slipping one hand into the top layer of Lan Wangji's robe and fishing around for his money pouch. \"Hey, Sizhui!\"</p>\n<p>Sizhui flies in closer before addressing him quietly: \"Senior Wei?\"</p>\n<p>\"Catch me!\" Wei Wuxian leaps off Bichen with one stride and uses just enough spiritual energy to fling him to Sizhui's sword. He's close enough to see the young man's eyes widen with alarm, although he does admirably manage not to scream or fall off his sword. He wobbles precariously for a moment as his sword dips, arms rolling in wide circles before he manages to adjust his weight so that they don't both tip over.</p>\n<p>\"WHAT THE HELL!\" That's probably Jingyi. \"THAT WAS SO DANGEROUS! AND COOL.\"</p>\n<p>Wei Wuxian turns, and gives him a thumbs up. He looks dead impressed by Wei Wuxian's unnecessary acrobatics, and Wei Wuxian feels inordinately proud that the teenagers think that he's cool.</p>\n<p>Lan Wangji looks as composed as ever - blank to the point where he's deliberately trying to mask his moment of gutwrenching terror, or so Wei Wuxian assumes. It's considered rude to fly directly over civilians, so they've been skirting the edge of the town; if he'd fallen, he wouldn't have hurt anyone but himself, really, and he has enough spiritual energy that he could have floated the landing. </p>\n<p>\"Nice! Well done, Sizhui. My - Jiang Cheng totally crashed us both the first time I did that to him. Alright, Lan Zhan, we'll see you later!\"</p>\n<p>\"Ridiculous,\" says Lan Wangji, just loud enough that Wei Wuxian knows he was meant to hear it. He looks at the rest of the junior disciples. \"You may take the afternoon off. Be back for dinner.\"</p>\n<p>The junior disciples bow as Lan Wangji peels away from them towards Cloud Recesses, and break into excited chatter.</p>\n<p>\"Are we going somewhere specific, Senior Wei?\" asks Sizhui faintly, probably just getting his heart rate back to normal as Wei Wuxian flings an arm around his shoulder.</p>\n<p>\"Just a little bit of shopping.\"</p>\n<p>The boys land, and they double back towards the town, splitting off easily into groups of three and four, apart from Sizhui who sticks with Wei Wuxian. Despite what he said, Wei Wuxian isn't actually looking for anything in particular. He does pick up food for himself and Lan Wangji as promised, pressing the occasional snack into Sizhui's arms.</p>\n<p>It's after a few detours of side streets and browsing, Sizhui patiently trailing him, that the kid picks up on the fact that he doesn't seem to have a real purpose. They've stopped at a stall selling wind chimes, a blue and white one with pale bamboo having caught Wei Wuxian's eye. It would go nicely in the Jingshi window.</p>\n<p>\"Did Senior Wei perhaps need me to go find something in particular for him?\" asks Sizhui, as Wei Wuxian gently flicks the windchime with one finger. He's a good kid; that's a subtle offer to disappear and let Wei Wuxian get up to hijinks if he ever heard it.</p>\n<p>\"There's something I wanted to ask you, actually.\" He gestures for the stall keeper to wrap the windchime for him and pays. \"About the Gusu Lan forehead ribbon.\"</p>\n<p>\"Oh?\"</p>\n<p>\"Yes, what does it mean?\"</p>\n<p>Wei Wuxian can tell without looking that Sizhui has stopped walking; when he turns back to look at him, he looks like he's trying to swallow his surprise. He's on his way to developing a great straight face, but he's not quite there yet.</p>\n<p>\"But you – you and Hanguang-jun… I mean, do you not know?\"</p>\n<p>Wei Wuxian lets a bit of a whine drag into his voice. \"I do! Or, I thought I knew! And then Jin Ling said something strange about it and now he's making me think I was mistaken! But maybe Jin Ling is the one who's mistaken.\"</p>\n<p>\"Oh, I see. Well, the forehead ribbon is a representation of self-regulation.”</p>\n<p>Wei Wuxian nods along. He knows this bit.</p>\n<p>“And we are only free from regulation when we are with those we most love and cherish. The forehead ribbon is a personal object that can never be touched, apart from by the ones w-who we would… let go of all regulations with.\" It sounds as if Sizhui is reciting the definition from a lecture or scripture, but the slight hitch in his breath and pinkness of his face gives away his embarrassment.</p>\n<p>Internally, Wei Wuxian comes to a halt, unhinges his jaw and screeches like a flustered owl for several long breaths.</p>\n<p>Externally, he clasps Sizhui on the shoulder because it gives his hand something to do other than tremble. \"Aha,\" he says weakly. \"Yes, that's <em>exactly </em>what I thought. Jin Ling must have got it wrong somehow.\"</p>\n<p align=\"center\"><br>\n*</p>\n<p> </p>\n<p>They head back up to Cloud Recesses, leaving behind the other juniors taking advantage of their free hours. Wei Wuxian offers to let Sizhui go ahead, because he remembers in time that carrying two people on a sword, particularly up a mountain, is almost impossible for anyone without the vastness of spiritual energy that Lan Wangji has. Sizhui manages to not only decline, but also out-polite him to the point of offering to accompany him if that is what Wei Wuxian wishes to do. Somehow, it ends up with the two of them walking up the mountain path.</p>\n<p>They're coming up to the first gate when they hear the gentle vibrations of the guqin.</p>\n<p>\"What's that?\" asks Wei Wuxian, breathing deeply and trying to stave off a stitch.</p>\n<p>\"It sounds like Hanguang-jun, but I don't recognise the piece.\" Sizhui is, of course, not even breathing deeply.</p>\n<p>Wei Wuxian <em>does</em> recognise the piece, from when Lan Wangji played it to him in the Xuanwu cave. It must be an obscure piece.</p>\n<p>\"Lan Zhan!\" he calls, rounding the corner. Now he can see Lan Wangji sitting on a rock, guqin out, eyes closed. The last played notes hang in the air as Lan Wangji's fingers still. \"What are you doing here?\"</p>\n<p>\"Waiting for Wei Ying.\"</p>\n<p>\"Aiya, you really didn't have to, you know.\"</p>\n<p>\"I did.\"</p>\n<p>\"Were you worried about me? I only went to get food.\"</p>\n<p>\"Not worried. Just waiting.\"</p>\n<p>Wei Wuxian squints at him for a moment, but he's serene as he stands, stowing his guqin away. \"Lying is forbidden in Cloud Recesses, Lan Zhan.\"</p>\n<p>Lan Wangji looks over at the gate and then back at Wei Wuxian. The implication is clear: <em>they're not in Cloud Recesses, yet</em>. Wei Wuxian can't help but laugh.</p>\n<p>Sizhui looks between them, a small smile on his face, and politely extracts himself. \"Hanguang-jun, Senior Wei. Please excuse me.\"</p>\n<p>\"Ah, did you miss me that much? It was not even a whole <em>shi</em>. Well, I'm here now,\" says Wei Wuxian, suddenly emboldened to loop his arm through Lan Wangji's. \"Let's head up.\"</p>\n<p>They leave Wei Wuxian's food in the Jingshi and go find Lan Xichen.</p>\n<p>The Hangshi is larger than the Jingshi, presumably as is appropriate for the future Sect Leader. Wei Wuxian's never been inside it before, but from the way the junior disciples had reacted when they had first brought him to the Jingshi, it seems that each of the Lan's personal residences are kept very private. </p>\n<p>Lan Wangji doesn't seem to feel awkward about bringing him here though; he knocks on the doorframe once, and waits. When the door slides open, Lan Xichen looks like he's expecting them. Wei Wuxian feels very seen as he watches the two of them enter, arms still entwined. But, well, if Lan Wangji doesn't have a problem with it, then Wei Wuxian doesn't have a problem with it. He can't quite tell if Lan Xichen has a problem with it.</p>\n<p>\"Wangji and Master Wei. Or Mo? Forgive me, I'm not entirely certain which you are going by,\" says Lan Xichen, the epitome of politeness, bringing out a pot of tea and waving them down onto some cushions. Ah, so he knows who Wei Wuxian is. \"Sizhui reported that you wished to see me. You caught me in good time, I was just packing to head out for some night hunting in the Tanzhou area. How may I help you?\"</p>\n<p>Lan Wangji sticks to business: \"We have recovered most of the body. My older brother's insights would be greatly appreciated.\"</p>\n<p>\"I appreciate that you think I can add anything that you won't have already spotted, Wangji. Why don't you set it out in the study area? The protections there are stronger.\"</p>\n<p>Lan Wangji rises, taking the qiankun pouches with him. Wei Wuxian tries to follow, but Lan Wangji pushes him back onto the cushion. \"Rest.\"</p>\n<p>Wei Wuxian rolls his eyes. Of course Lan Wangji noticed him being just a tiny, barely perceptible bit out of breath. Honestly. \"You're too considerate sometimes, Lan Zhan. It was just a brisk walk,\" he complains, but sinks back down anyway.</p>\n<p>Lan Xichen is watching him over his tea as Lan Wangji slips into the other room. \"It seems like much has developed in your time away.\"</p>\n<p>Wei Wuxian sips at his tea – disgusting, herbal, to be expected from Cloud Recesses – in an attempt to stall an answer. Lan Xichen has never seemed the type to have hidden meanings in his words so he takes them at face value for now. \"You could say that.\"</p>\n<p>\"You are… aware of my brother's circumstances?\"</p>\n<p>\"The whole cultivation partner, spouse, duel thing? Yeah, the people who kept attacking him when we were travelling was a giveaway that something was up.\"</p>\n<p>\"And are you planning on challenging him?\"</p>\n<p>\"I—\" <em>don't know</em>. \"don't think it would be appropriate given my circumstances.\" It's ridiculous that Wei Wuxian is caring about what's appropriate now, considering he hasn't done so for the entire previous iteration of his life, but this is different. This is Lan Wangji's future. He tries to stave off the serious atmosphere by parrying with a joke. \"Besides, I don't think I could start off a relationship by attempting to maim my spouse-to-be! I know no one else has managed it yet, but what if I seriously hurt him?\"</p>\n<p>Lan Xichen smiles, but it feels more like an obligatory stretch of his lips; he certainly doesn't seem happy about it. \"Yes, that was a concern. But we would hope that whomever was successful was also skilled enough to take the pendant without harming him.\"</p>\n<p>Wei Wuxian puts his teacup down on the table. \"What pendant?\"</p>\n<p>There's a moment's pause, and then Lan Xichen also puts his teacup down, very carefully. \"The Gusu Lan pendant around Wangji's neck that a cultivator must retrieve to demonstrate their victory.\"</p>\n<p>The Hangshi is... possibly spinning a little around Wei Wuxian's head as he says faintly, \"Lan Zhan doesn't have a pendant around his neck.\"</p>\n<p>Wei Wuxian tries to think back, his thoughts stumbling over each other. He definitely didn't see Lan Wangji wearing a pendant when he had been drunk and had insisted that Wei Wuxian helped wash him – although he's certainly not going to say that out loud in front of his older brother and Sect Leader. None of the cultivators who have challenged him while Wei Wuxian has been around have succeeded either.</p>\n<p>This means Lan Wangji had to have taken it off even before that. But Lan Wangji hasn't mentioned it yet, or even told any of his challengers that they had been beaten to the challenge. It must be this case that they're working on, and the distraction of Wei Wuxian himself appearing thirteen years after his death – they haven't been back to Gusu since they started investigating the disembodied arm, and Lan Xichen hadn't been here at that time, so whoever it was, Lan Wangji must not have had time to let his brother know and discuss logistics yet.</p>\n<p>Lan Xichen would never be so rude as to give a discreet cough or anything like that, but his mere presence brings Wei Wuxian out of his musings and back to where they are in the Hanshi. The way his smile has frozen on his face asks the question of how Wei Wuxian could possibly know this fact more clearly than any words can, and Wei Wuxian admires briefly how the Twin Jades of Lan can be so expressive in completely different ways.</p>\n<p>\"We were in the cold springs together,\" he says, which is a lie. \"Lan Zhan – well, I'm sure he was just waiting on the right time to let you know himself. My apologies, I hadn't meant to spill before he had the chance to speak with you.\"</p>\n<p>\"No issue at all,\" says Lan Xichen, and pours them both a new cup of tea. Unspoken, they both drink simultaneously, grateful for even this brief reprise from this conversation.</p>\n<p>Muffled footsteps from the other room signal Lan Wangji's return. He looks between them, and blinks. Wei Wuxian isn't sure what he's able to discern from just one look, but something in the atmosphere must have changed. When neither of them offer an explanation, he merely says, \"It is ready.\"</p>\n<p>Lan Xichen and Wei Wuxian both rise a little too quickly, teacups clinking on the table, but they're beaten to the punch. There's the sound of something falling over in the next room and the three of them swirl around to find an arm already reaching out through the doorway of Lan Xichen's study area to pull the door back. The entire body, allowed within close proximity of its other parts, has already knitted itself back together, deep gashes in the limbs still showing where the dismemberment happened, and is now lurching towards them.</p>\n<p>Neither Lan Xichen nor Lan Wangji are holding their swords – both their swords had been set near the entrance of Zewu-jun's private chambers – but Lan Wangji simultaneously pulls his guqin from his sleeve with one arm and pushes Wei Wuxian behind him with the other. Wei Wuxian fumbles for his flute in his own sleeves, inhales and joins in just a few measures after that.</p>\n<p>Wei Wuxian expects Lan Xichen to join them. He has never played with Wei Wuxian before, but he is as equally accomplished a xiao player as Lan Wangji is on the guqin, and could fit into the harmony with ease. Instead, Wei Wuxian glances over at him briefly when he hears a choking sound from the older man, and nearly stalls in his playing when he sees glossy tears form in his eyes, before leaking from the corners of his eyes.</p>\n<p>The corpse is already slowing and increasingly sluggish by the time it reaches the reception area of the Hanshi, its footsteps tentative, and as the hands reach out in search of the nearest head that it might try to match onto its body, Wei Wuxian sees Lan Xichen reach out, his fingertips grazing the corpse's in return before aborting the move and pulling his hands back to his side and retreating to the wall, pain drawn across his face.</p>\n<p>By the time the headless corpse has lumbered into the centre of the room, the spiritual energy in the music has had the desired effect; the body slumps over with a thud, and slowly, finally, ceases its twitching. Wei Wuxian reaches out carefully when it's completely still and rolls it over onto its back.</p>\n<p>\"Can I assume that you recognise who it is?\" he asks Lan Xichen softly.</p>\n<p>Lan Xichen nods.</p>\n<p> </p>\n<p align=\"center\">*</p>\n<p> </p>\n<p>There are no other clues to be gleaned from the body over the next few days; Lan Xichen is shaken up about the whole matter and it has raised more questions than answers. He has promised to consider the involvement of his sworn brother, Jin Guangyao, and has asked them for time for this. He spends much of his day playing Rest to the body – re-separated into qiankun pouches for everyone's safety – in his study area.</p>\n<p>It's a subdued party of three that makes their way on foot to the Sect Discussion Conference in Lanling. Lan Xichen is clearly fretting over what he wants to say to Jin Guangyao when he gets there, and Wei Wuxian knows that Lan Wangji still hasn't been able to talk to his brother about the potential marriage candidate because now is clearly not the time, and Wei Wuxian is also trying not to bring it up so that Lan Wangji can break the news to Lan Xichen in his own manner.</p>\n<p>They walk largely in silence, with only Wei Wuxian to puncture it occasionally to the best of his abilities. It's strange; most of the time he finds it effortless to keep up the chatter, but it's as if the addition of Lan Xichen has thrown off their delicate balance. He almost wishes that they'd flown to Lanling, although they surely only haven't because he's the one without a sword.</p>\n<p>The first inn they stop at on their way there, Lan Wangji is about to speak to the innkeeper – as he has done for the last while now – when Wei Wuxian chips in. \"Three rooms, please.\"</p>\n<p>Lan Wangji frowns at him, minutely, but says nothing. Wei Wuxian looks at him, and then his brother, and smiles nervously. Part of it is that it would be difficult to explain to Lan Xichen why they've been sharing, even though it has been, really, completely just bed-sharing. But also, part of it is that it's starting to sink in that Lan Wangji will no longer be single, soon.</p>\n<p>After this horrific butchering of Nie Mingjue is resolved, he will surely discuss the most appropriate way to proceed with Lan Xichen, pick an auspicious date to wed, and no longer be available for Wei Wuxian to plaster himself against the side of.</p>\n<p>It's just that... he thought he had more time. It had all been theoretical, until now. Deep down, Wei Wuxian admits that he had thought that no one would ever defeat Lan Wangji. Perhaps Lan Wangji had thought the same. Perhaps Lan Wangji, too, has been trying to think of a way to break it to Wei Wuxian, that this extended investigation period of the two of them travelling would be the only time they got to do this together. Perhaps he is also taking his time to process it in his own way, and Wei Wuxian wants to make it as easy for him as well, and give him the space to do that.</p>\n<p>\"I'll come by to play Rest after dinner,\" he says. Maybe he will ease into giving him space.</p>\n<p>The second inn they stop at on their way there, the innkeeper tells them regretfully that she only has two rooms left for the evening and wrings her hands in apology, looking like she's hoping they won't go back out and find another inn. It's late enough that Wei Wuxian really just wants to eat and retire for the evening; when the three of them exchange looks, Lan Xichen says, \"Of course, we don't mind sharing rooms.\"</p>\n<p>Lan Wangji heads into the first room, so Wei Wuxian makes for the second. Lan Xichen pauses for long enough after them that Wei Wuxian looks back, to see both Lan Xichen and Lan Wangji looking at him with painfully blank expressions on their faces. \"Zewu-jun? What's the matter?\"</p>\n<p>\"Ah, it's just been so long since I shared a room,\" says Lan Xichen with a strained smile. He makes to step forward but Lan Wangji is still in the doorway; they almost collide, and Lan Wangji looks like he wants to say something, but Lan Xichen gently nudges Lan Wangji in and closes the door after them.</p>\n<p>Wei Wuxian takes a moment to think about it. Huh, that must be true. He probably hasn't shared rooms with anyone since he was a junior disciple.</p>\n<p>He stares at the empty room in front of him, mind whirling. It sounded like Lan Xichen had thought that Wei Wuxian would share a room with Lan Wangji. Wei Wuxian smacks himself in the side of his head – of course it makes sense that Lan Xichen, as the most senior and as the Sect Leader, would take the single for himself. He had just assumed that the brothers would share – he and Jiang Cheng certainly would have – and both Lan Xichen and Lan Wangji are probably just far too polite to correct Wei Wuxian's bad etiquette and demand that Lan Xichen gets a room to himself. Ah, damn it.</p>\n<p>The third night, they manage to make it to Koi Tower without having to stop in one of the nearby towns. Jin Guangyao is there to meet them, and though Wei Wuxian is not nearly as familiar with Lan Xichen's mannerisms as Lan Wangji's, even he can see the Lan Sect Leader pull himself together and square his shoulders as though preparing himself for battle.</p>\n<p>He ignores all the jabs and looks that come his way, and sets his things down in his room before heading next door to knock on Lan Wangji's door. He explains, briefly, what he's going to do, and then releases his spiritual energy into a paperman talisman and lets his consciousness explore Koi Tower.</p>\n<p>The results are, to put it lightly, interesting.</p>\n<p>There's Nie Mingjue's head, a lot of shouting, the disappearance of Nie Mingjue's head, and more shouting; somehow, what was meant to be a relatively straightforward exposure of Jin Guangyao turns into the revelation of Mo Xuanyu as Wei Wuxian, and Wei Wuxian ends up in the midst of dozens of angry cultivators in front of Koi Tower, thinking <em>Ah, this feels familiar</em>.</p>\n<p>Except this time, he's not going to raise an army of fierce corpses to tear them all apart; he can't, he won't. Except this time, he hasn't come to them, looking for a fight, and running down the hundreds of stairs in front of the tower is his only option, and he can only feel thankful that the crowd seems so angry that they're actually running after him on the ground instead of flying ahead to cut him off.</p>\n<p>Except this time, Lan Wangji steps forward and deflects a sword with Bichen as cultivators encircle them. Jin Ling lingers on the side, not sure whether to step in or not; Wei Wuxian's glad he's already discovered who he is and has had the chance to come to terms on it in his own time, instead of having to watch out for the entire cultivation world's reaction when he founds out at the same time as anyone else.</p>\n<p>Wei Wuxian tries, he really does, to convince Lan Wangji that it's better for him to stay on the other side of this, but he stays, with his back against Wei Wuxian's, until there are so many people that one gets by even the esteemed Hanguang-jun and stabs Wei Wuxian in the side. He doesn't even see who it is.</p>\n<p>Everything freezes for a long moment.</p>\n<p>Everyone's fire is up, they're bursting for a fight, but the moment that sword slides out of Wei Wuxian's chest with blood slicking its blade, there is a moment of stillness. It's like they've all just realised that Wei Wuxian is holding back, that he's not called on any corpses or ghosts to defend him, and they're wondering if this will suddenly trigger a reaction from him. A much, much worse reaction.</p>\n<p>In all likelihood, no one is expecting him to faint, least of all Wei Wuxian himself.</p>\n<p><em>It wasn't even a dangerous strike</em>, he remembers thinking just before his knees buckle. Something solid, warm, catches him just before his consciousness disappears completely.</p>\n<p> </p>\n<p align=\"center\">*</p>\n<p> </p>\n<p>Wei Wuxian wakes up in Gusu. This, too, feels familiar. He knows the Jingshi now. He makes to sit up and winces when pain flares up his side, like a single lightning bolt separating into a dozen lances of light. He gingerly peels back the robe he's wearing to see a thick bandage bound to his side that's partially bled through with dark blood. He is lucky, he knows, that it wasn't a lethal strike.</p>\n<p>\"Rest,\" says Lan Wangji as he emerges from the other room holding more bandages and a small washbasin of water.</p>\n<p>\"Lan Zhan. I – thank you.\"</p>\n<p>\"No need.\"</p>\n<p>\"Thank you,\" repeats Wei Wuxian forcefully, because there absolutely is a need. It was fine for them to investigate together, for him to prance around carelessly, when barely anyone knew who Mo Xuanyu really was, but now it's out in the open, someone like Lan Wangji publicly declaring his support for him... that's a lot. \"Are we... how long has it been? What happened?\"</p>\n<p>\"Two nights, one day. There was a fight.\"</p>\n<p>He'd feared as much. He sighs, and then tries to bat away Lan Wangji's hands as they reach for his robe belt. Lan Wangji manages to catch both of his wrists with one hand, and presses them to Wei Wuxian's chest firmly, before peeling open the robe. The blood that's seeped out is tacky, which is good – it means that the bleeding is slowing, even Wei Wuxian knows that much – but he gently cleans the wound before binding a new bandage in place.</p>\n<p>\"Ah, Lan Zhan, you're too good to me. I don't even know why,\" Wei Wuxian says, too tired to fight for now. He's not sure whether he means the fight, or the bandaging. Now that they're close together, he can see the translucent, sunken shadows under Lan Wangji's eyes, and the paleness of his lips. He wonders if Lan Wangji will ever tell him if he spent both nights taking care of Wei Wuxian, instead of resting himself. \"Should we even be in Gusu? Surely they'll all come looking for you here.\"</p>\n<p>\"Let them.\"</p>\n<p>\"I just don't want to put you in a precarious situation. You and Zewu-jun.\"</p>\n<p>\"My brother–\"</p>\n<p>\"Already knows you are here,\" says Lan Xichen. He appears in the doorway of the bedchamber and looks down at the both of them wearily.</p>\n<p>\"Zewu-jun,\" says Wei Wuxian, swinging his legs off the bed so he can bow properly, gasping as it pulls on the wound.</p>\n<p>\"I would like to speak with both of you. If you could join me when you are ready, Master Wei?\" Lan Xichen looks as if he's aged an entire decade since Wei Wuxian saw him last. He leaves them in the bedchamber, where Lan Wangji is already reaching out for Wei Wuxian's robes – cleaned – to help him back into them.</p>\n<p>\"I can't believe I've been out for two nights. It's only a superficial wound,\" mutters Wei Wuxian.</p>\n<p>Lan Wangji tugs his collars straight, and huffs. \"The paperman.\"</p>\n<p>\"That barely even counts as a use of spiritual energy.\"</p>\n<p>\"Empathy. Through the paperman.\"</p>\n<p>\"I... yes, alright, I will concede that one.\" Empathy itself is difficult, and that had been the only time he has tried it while already in the middle of draining his spiritual energy. Besides, the contents of the memory... well, that had a different kind of toll.</p>\n<p>It's just frustrating. Wei Wuxian is not used to having limits of stamina on his ability. His golden core pulses weakly, just right of the wound. He presses a hand to his stomach too; it's starting to rumble, but he doubts that Zewu-jun is willing to wait for him to replenish himself physically as well.</p>\n<p>\"Such a weakling,\" he sighs. \"Even Jiang Cheng could beat me right now.\"</p>\n<p>Lan Wangji's lips press into a flat line, but not before Wei Wuxian spots a curl escaping the corner. He offers his arm, and Wei Wuxian sighs. He'd like to say that he doesn't need it, but he feels woozy the moment he tries to stand, so he tucks his hand into Lan Wangji's elbow and lets him take his weight as they move through to the reception area.</p>\n<p>Lan Xichen is kind, but firm. He'd already known who Mo Xuanyu really was, so at least he hasn't had that sprung on him, and he's willing to hear them – or Lan Wangji, through Wei Wuxian – out about what they'd discovered, but as Wei Wuxian watches him talk, he can see the pain on his face at the thought of his beloved Jin Guangyao committing such a terrible crime.</p>\n<p>They spend the whole day in the Library Pavilion; they find the Songs of Discord; they solve the case of the dismembered arm. A few weeks ago, this would have been the end of it. Except now, Lan Xichen looks equal parts lost and angry and Wei Wuxian is selfishly thinking about how he still hasn't had a chance to be alone with Lan Wangji and ask him about his jade pendant yet.</p>\n<p>Lan Xichen invites the two of them to join him in the Hanshi; they acquiesce. Lan Wangji lets them know that he will join them there and Wei Wuxian walks with Lan Xichen in thoughtful silence. They make a detour, through an area of Cloud Recesses that Wei Wuxian isn't familiar with, to a house that has long stood empty, and tells him about their mother. Wei Wuxian studies his face as he talks, both happiness and sadness evident in the shape of his mouth. And then Lan Xichen tells him about him – about what happened to him just before he died, the last words he spoke to Lan Wangji, and now Lan Xichen's face is more sad than happy. Wei Wuxian scarcely dares breathe in the aftermath.</p>\n<p>“I didn't know,” he can only say. “I don't – I don't remember any of that. You have to know, I didn't mean it.”</p>\n<p>Zewu-jun looks at him with eyes that seem to pierce through his very soul. “I want to believe that,” he says, very gently. The Twin Jades of Lan are used to having complicated feelings about the people they care about.</p>\n<p>They continue on, both mulling over the revelations of their conversation. They've tarried long enough that by the time they arrive at the Hanshi, Lan Wangji is also approaching, holding a jar of Emperor's Smile.</p>\n<p>Dinner is actually eaten in silence, for once. Too much hangs in the air between them, too many emotional discoveries in too short a period of time, all of it too heavy to be discussed right now. Wei Wuxian sips the wine and lets it slide down his throat, mellow and smooth, and watches the two brothers.</p>\n<p>Lan Wangji doesn't offer up what he's thinking, but it's clear from the way that Lan Xichen also looks at him occasionally, opens, and then closes his mouth without saying anything that his opinion is clear, to Lan Xichen anyway. And it's not Wei Wuxian's place to offer Lan Xichen advice on what to do – not as Gusu Lan Sect Leader and certainly not as sworn brother to Jin Guangyao.</p>\n<p>At the end of it, there's a strange noise from inside Wei Wuxian's sleeves. He frowns – he didn't think that there was anything in there anymore that would cause any ruckus. No qiankun pouches full of rioting body parts, in any case. He fishes around until he can feel the vibrations through his fingertips; his hand closes around... his flute?</p>\n<p>He pulls it out. No, the flute is vibrating slightly, but only because it's attached to the item actually making the noise - the white pendant on the end of it. \"What?\"</p>\n<p>\"Wangji.\" Lan Xichen's tone is sharp – sharper than Wei Wuxian has ever heard it. The two of them exchange looks and rise as one, Wei Wuxian half a step behind them. He reckons he's pretty good at reading Lan Wangji by now, but this is some other sibling level as they have an entire conversation between a flex of an eyebrow. Lan Xichen adds, \"You should stay.\"</p>\n<p>They hurriedly – and yet somehow entirely gracefully – sweep all their dinner things into a basket, and wipe down the table, erasing all signs that there had been three people here. Lan Wangji glances around the room, and then shepherds Wei Wuxian behind a bamboo screen.</p>\n<p>\"Lan Zhan... I have to assume you're going to explain this to me afterwards,\" says Wei Wuxian, touching the pendant. It's stopped making noise and vibrating now. He's never noticed it doing anything strange before this.</p>\n<p>He hears footsteps coming up to the Hanshi, and Lan Wangji joins him in a crouch behind the bamboo screen. Alright, Wei Wuxian knows how to read the cues. He settles down to listen in silence, picking a tiny hole in the bamboo to peer through, as Lan Wangji is doing.</p>\n<p>It's Jin Guangyao, and his steady, unassuming mild-mannered manner as he says, \"Er-ge\" in the same breath as \"Allow my men to search Cloud Recesses and prove that Wei Wuxian and Wangji are not hiding here,\" and \"It's time for me to return this.\"</p>\n<p>Suddenly, Lan Wangji's hand is raised, twisting in a familiar way that Wei Wuxian hasn't seen since his school days – it takes a moment to register it as the Lan Silence Spell – it hits just a second before he sees Jin Guangyao pull out his Gusu Lan entry pendant – his white jade pendant that looks exactly the same as the one on Wei Wuxian's flute – and return it to Lan Xichen.</p>\n<p>He swivels to stare at Lan Wangji incredulously. Now? When they're in the middle of unearthing Jin Guangyao's crimes and eavesdropping on his private conversation with Zewu-jun – now is the time that Wei Wuxian has to find out that all this time, he's been carrying Lan Wangji's Cloud Recesses entry pendant on his flute?</p>\n<p>He remembers, vaguely, knowing that Lan Wangji has unfettered access to all parts of Cloud Recesses, that his token is a symbol of both the responsibilities and trust of the Sect laid upon him, that it serves as both key and security, able to notify the owner when there is an unauthorised access to Cloud Recesses. Without any spiritual power at all, it is a piece of white jade so pure that it could have fed the whole of Mo Village for a week. And Wei Wuxian has just been twirling it into the air nonchalontly for the last few weeks!</p>\n<p>He's frozen, staring at Lan Wangji, who is determinedly staring through the bamboo screen at the treacherous Jin Guangyao and not at Wei Wuxian. He can see the furious pink flush of Lan Wangji's ears – not just the tips, but his entire ear, spreading fast down his neck. Oh, well at least he's blushing! He points furiously at Lan Wangji, who can surely see him out of the corner of his eye but is studiously ignoring him, behaving almost as shamelessly as he does when he's drunk. If only they weren't in the middle of exposing a murderer.</p>\n<p>Wei Wuxian barely hears the rest of the conversation. Jin Guangyao leaves, and Lan Wangji immediately releases the Silencing Spell on him and then turns and bows to him, forehead to the floor, and Wei Wuxian is so taken aback that he scrambles to his feet. He has had so many thoughts in the last few minutes, so many words that he thought he was actually going to burst out from behind the screen, hiding be damned, and now they've all abandoned him. He gets up so vigorously that he nearly knocks the bamboo screen over, almost hits Lan Xichen in the face when he flails an arm out dramatically. He splutters, \"You. You!\"</p>\n<p>\"I apologise,\" says Lan Wangji, still facing the floor.</p>\n<p>\"Master Wei,\" says Lan Xichen, looking quite alarmed. And so he should, he completely missed Wei Wuxian having the meltdown of his life just a moment ago, completely unable to make the sounds to appropriately accompany his breakdown. He looks between them, Wei Wuxian almost incandescent and pointing at his baby brother, kowtowing on the floor.</p>\n<p>\"Lan Zhan!\" wails Wei Wuxian then, dashing himself to the floor and prying Lan Wangji off it at the same time only to throw himself on top of Lan Wangji in a smothering hug. \"Don't you dare bow to me like that. How dare you. I'm furious, you explain yourself right now.\"</p>\n<p>\"Master Wei,\" hedges Lan Xichen again, eyes darting nervously around. This is probably more emotion than has been expressed in the Hanshi, ever.</p>\n<p>\"Wei Ying is right to be angry with me,\" says Lan Wangji hesitantly, like he doesn't quite know where to start. His hands hover in the air above Wei Wuxian's shoulders. \"I should not have used the Silence Spell. It was not my place.\"</p>\n<p>\"Forget the Silence Spell,\" says Wei Wuxian, voice muffled from where his face is pressed, perhaps more tightly than is necessary to the side of Lan Wangji's neck. He pulls back, far enough that there is perhaps a moment where Lan Wangji's hands convulse from where they're hovering awkwardly in midair, unsure of whether to touch Wei Wuxian or not, as if to pull him back in.</p>\n<p>But Wei Wuxian only pulls back far enough to rock back on his heels. One hand fist into Lan Wangji's robes. \"Forget the stupid Silencing Spell, what about this thing!\"</p>\n<p>He pulls out the flute with the other hand, dangles the white pendant between them as it oscillates frantically in the air, the only thing to interrupt their eye contact. \"You didn't even tell me it was your Gusu Lan pendant. Lan Zhan, that's so risky! What if I lost the flute? You know I'm terrible with things. And then you couldn't even get back into Cloud Recesses without me! Lan Zhan, what is wrong with you?\"</p>\n<p>Wei Wuxian shakes him, even though Lan Wangji is surely strong enough to push him off if he needed to. But he just sways back and forth as Wei Wuxian shakes him, until – \"Lan Zhan? Are you – are you smiling? Are you <em>laughing </em>at me?\"</p>\n<p>Wei Wuxian stares at him, incredulous, but it's unmistakable. A smile. A tiny one, to be sure, and a muscle in Lan Wangji's cheek twitches, as if it doesn't quite recognise what it's supposed to feel like.</p>\n<p>Wei Wuxian makes a sound like a dying cat.</p>\n<p>Lan Xichen leans forward discreetly, and Wei Wuxian starts – he'd almost forgotten where they were. \"Master Wei. I apologise for my untimely interruption, but I must go to the Yashi to meet with A-Yao – that is, Jin Guangyao. I presume we will leave for Koi Tower immediately, so it would be prudent for you to head to the Burial Mounds as quickly as possible.\"</p>\n<p>Wei Wuxian has... possibly missed what, exactly, is happening at Burial Mounds, but in his experience, it's probably something bad. He straightens immediately, tries to remember that Lan Xichen is here thinking about his sworn brother potentially having killed his other sworn brother, and bows. He'll have to get Lan Zhan to fill him in on the way.</p>\n<p> </p>\n<p align=\"center\">*</p>\n<p> </p>\n<p>They pack light, only the necessities and some spare talismans. Lan Wangji holds out Suibian, recovered from Jin Guangyao's vault, and Wei Wuxian looks at it for a long moment before sliding it into his belt.</p>\n<p>They go via the back hills of Cloud Recesses, making sure they're unnoticed in the shadows, and head in the opposite direction of Jin Guangyao and Lan Xichen also heading out. Wei Wuxian remembers being here as a student – remembers that he hadn't been supposed to be back here, more accurately – and the gentle slopes of grass haven't changed over the years, apart from the white specks that dot it throughout. He looks, and looks again, not quite believing his eyes as dozens of placid rabbits hop about, roaming freely.</p>\n<p>\"So many!\" He's admiring how cute and fluffy they are when Lan Zhan cuts across their meadow and then he gasps as they crowd up to Lan Wangji, sitting on his feet until he gently moves his feet, dislodging them. \"Lan Zhan! Are they yours? I know you aren't allowed pets in Cloud Recesses.\"</p>\n<p>Wei Wuxian leans down and tries to pick one up, but it wriggles away from him, and he's led into gently chasing it.</p>\n<p>\"They are not pets.\" Lan Wangji says, leaning down and scooping up the one that Wei Wuxian is trying to pick up. It settles in his arms, and Lan Wangji holds it out for Wei Wuxian to stroke, which it tolerates for just about a breath before squirming away. It is as soft as he had imagined.</p>\n<p>\"Of course not,\" says Wei Wuxian, hiding his smile. \"Are they – are they from the ones I gave you?\"</p>\n<p> </p>\n<p>Lan Wangji inclines his head, and Wei Wuxian laughs, spreading his arms to encompass the whole field. \"Well, it's like they're our children then! Or grandchildren. How delightful. I never thought I would have such adorable children.\"</p>\n<p>Lan Wangji makes a curious noise then, making Wei Wuxian look over at him. \"Oh, of course any children <em>you</em> have would be delightful anyway. The most polite, the neatest, knows all the Lan rules, with meticulous cultivation, I'll wager.\"</p>\n<p>\"Gambling is forbidden in Cloud Recesses,\" says Lan Wangji, though it looks as though he's about to say something else first. Wei Wuxian tilts his head, waiting for him curiously, but nothing else comes out so they carry on.</p>\n<p>They have to make haste, but Lan Wangji sets them a pace that doesn't aggravate Wei Wuxian's wound. It's in a most inconvenient place for walking – not dangerous, but any small movement pulls at it. Riding Lil Apple is a little bit better; at least the jarring is consistent. Wei Wuxian hands the reins to Lan Wangji, who takes it with no comment bar a raised eyebrow, and slides Suibian into a saddlebag. He draws his legs up, letting Lan Wangji lead the way, and takes the time to take the flute out.</p>\n<p>His original intention had been to perhaps play some music to pass the time, but the moment he touches it, he remembers his recent revelation. He strokes the engravings, particularly the two little rabbits on the end, and then at the dangling pendant. It's really very simply carved, as expected of Gusu Lan, though high quality, as would also be expected. He's never seen the tokens used for access to Cloud Recesses before, so he can't really be faulted for not recognising it; the closest he had come previously was when he tried to steal Lan Wangji's from his discarded robes at the Cold Springs the first time he'd been here. Even an ordinary one is granted only to Clan and Sect members, which emphasises how highly Lan Xichen had thought of Jin Guangyao that he had one, but Lan Wangji's is granted the highest level of clearance. It really is too much responsibility.</p>\n<p>When he touches it now, he can feel the spiritual energy because he's looking for it – just too much to be an ordinary protection or good luck pendant, and he sighs. \"I can't believe you didn't tell me, Lan Zhan. I'll take good care of it now I know. Can't let someone else get their hands on this and be able to get access to the forbidden Library and other secret rooms, you know.\"</p>\n<p>They pick up Wen Ning along the way, and there's something warm in Wei Wuxian's chest that has nothing to do with the sunshine on his face as these two people who have stuck with him stay by his side.</p>\n<p>None of them are entirely sure what to expect when they get to the Burial Mounds, and Wei Wuxian is tickled pink to find out that Lan Wangji had also, for once, been distracted and not been paying his utmost attention. He had done a much better job than Wei Wuxian had at pretending in the Hanshi, at least.</p>\n<p>He suspects, however, that whatever the situation here was meant to be is not what actually transpires when they arrive to find a gaggle of kidnapped teenagers inside what once was Wei Wuxian's workshop and bedroom, now barely more than a dusty cave with decade-old rubbish disintegrating in the corners.</p>\n<p>And then they get trapped between the teenagers and their parents coming to their rescue; somehow that turns into being trapped with the teenagers <em>and</em> parents against a horde of fierce corpses outside. And he gets blamed for it, of course.</p>\n<p>This is, Wei Wuxian suspects, a very good set-up.</p>\n<p>He tries to use his flute to command the corpses, but they must already be under someone else's command, because nothing else is affecting them. There is a moment, when all the adult cultivators discover that their spiritual energy is gone and start to panic, that he's glad, glad that they knew what it felt like, even if only for a moment. The emptiness, the realisation that they were crippingly dependent on access to their golden cores.</p>\n<p>He's glad, for one moment, and then he shakes it off, because that's not a path he wants to go down now.</p>\n<p>It becomes more evident by the moment that Wei Wuxian is not the mastermind behind this, especially when they reveal Su She's secrets, but that doesn't stop the onslaught of corpses trying to get at them. They retreat into the cave with the array, and then even further, and when they think that there's nothing else to be done but draw their swords and die by them, the blood pool cave roils with the bodies of the Wen long dead.</p>\n<p>Wei Wuxian almost chokes when he realises who they are, when he recognises small details - a necklace drooping off a sagging throat, a bracelet clacking against a wrist that's more bone than rotting flesh, and it takes him one, two, three attempts with the flute before his throat is not so dry that he manages to direct them towards the fierce corpses outside, breaking through enough of a passage that the rest of the cultivators trapped in there with him can escape.</p>\n<p>When the last of the Wen disintegrates into dust, it's like the air that Wei Wuxian managed to force through his throat to play the flute disappears from his lungs again. He wants to, like the young disciples and Wen Ning, start gathering ashes, to give them all a proper burial and pay his respects, talk to them all one last time. But – there are still people around, people who don't know what to make of him, people who can't reconcile the pain he's wrought on their families with being saved by him.</p>\n<p>When it comes to a thousand fierce corpses trying to kill him, Lan Wangji can stand between them and him and kill them all, but now, this is a blow that Lan Wangji can't spare him from.</p>\n<p>Fang Mengchen – the one, of countless, whose father he killed – stares at him over the span of the blood pool.</p>\n<p>\"You cannot forgive me. I cannot unkill your father. We are at a stalemate,\" says Wei Wuxian. \"What else do you want from me?\"</p>\n<p>There is no answer that he can give, that any of them can give, to that. And so they march out, defiant and yet with their tail between their legs, an assorted group of cultivators towards Lotus Pier. He and Lan Wangji tag along, neither invited nor disinvited, but no one has heard from Lan Xichen and Wei Wuxian wants him at least to be in the know about that.</p>\n<p> </p>\n<p align=\"center\">*</p>\n<p> </p>\n<p>Wei Wuxian is touched when they're joined on their boat by the young disciples from multiple clans; he can feel the force of their clans' disapproval from across the water, but they're doing a good job of collectively ignoring it. There's something curious happening with Wen Ning and Sizhui that has attracted everyone's attention at the fore of the boat, but once Wei Wuxian sits down, he's tired, so tired. Weariness drags at his eyes, and his head droops enough that he loses his balance, jerking himself upright as he tries to keep himself awake. He hisses, as the stitches pull, and it suddenly feels like his entire left side has been branded by a hot iron.</p>\n<p>\"Rest,\" says Lan Wangji, pulling him back down so that his cheek is pillowed on Lan Wangji's shoulder. In Mo Xuanyu's shorter body, Lan Wangji's shoulder is the perfect height to just list slightly to the side and lean on, and with the knowledge that Lan Wangji doesn't mind, he lets himself close his eyes as Lan Wangji's fingers find his wrist, and pulse enough spiritual energy into him that the pain recedes. He'll savour these moments for as long as they'll last.</p>\n<p>When Wei Wuxian comes to, there are strong arms holding him. Wei Wuxian lifts his head to blink sleep out of his eyes. \"I – did I sleep for long?\"</p>\n<p>\"Not too long.\"</p>\n<p>Wei Wuxian tries to sit up on his own, but Lan Wangji's arms remain around him.</p>\n<p>\"You pulled some stitches free.\"</p>\n<p>He looks down to see one arm around his waist, holding him in place, and Lan Wangji's other hand pressing a wadded up white handkerchief, stained with patches of blood, against his side. Now that he can see the specks of blood, the pain seems to register, and he hisses when he peels his robe away from his chest to see how bad it is. The bleeding has mostly stopped, and he's pretty sure most of the stitches are still in, so not bad at all, and luckily the dark robe hides most of the stain. If he doesn't do anything strenuous, it should be fine until he has a chance to sort it out properly.</p>\n<p>\"Ah, look at me, I'm such a mess, Lan Zhan. I can't believe you have to take care of me even though you fought off more corpses than anyone else.\"</p>\n<p>\"I do not mind.\"</p>\n<p>\"I know, Lan Zhan. You're far too generous to mind. Oh, look, I recognise where we are. We're almost ho– there now.\"</p>\n<p>Lotus Pier floats into view, all at once entirely familiar and all too foreign to Wei Wuxian. Jiang Cheng is studiously ignoring him, so he takes the chance to look around. There are stalls that have been there since he was a child, and have always indulged him, and he wishes with a pang that they would recognise him now. And then there are new ones, that have replaced the ones he's familiar with. The closer they get to the Jiang family home, the more changes he notices.</p>\n<p>There are new sect buildings now, the Jiang Sect expanding out of necessity after it had been razed down to only its Sect Leader. The older buildings are still there, some with additions and repairs done so skillfully to match the original that if Wei Wuxian hadn't grown up here knowing every wall, every hedge intimately, he would never have guessed.</p>\n<p>Once they, and what feels like every major cultivator in the land, are seated, it feels strange to be at one of these Sect discussions with no place for him here apart from at Lan Wangji's side. Once it's clear that the blame has shifted from him to Jin Guangyao, there isn't much more he can add. He slips out of the chamber – less subtly than he had hoped because Lan Wangji immediately follows him out – and walks where his feet take him. He finds himself at the Ancestral Hall without even thinking about it.</p>\n<p>\"I wonder if they'll want to see me,\" he murmurs, mostly to himself. \"Shijie. Uncle Jiang. Well, maybe not Madam Yu.\"</p>\n<p>\"I am sure that they would,\" says Lan Wangji, startling Wei Wuxian. He wasn't expecting an answer to that. He looks at Lan Wangji with wide eyes as he adds. \"They knew you.\"</p>\n<p>Well, Wei Wuxian has nothing to say to that. He busies himself instead, with incense. \"I wish that I could have introduced them to you. You would have thought well of my shijie, I think. She was... very kind. So kind.\"</p>\n<p>Lan Wangji says nothing, merely kneels beside him and bows with him.</p>\n<p>It's with a groan that Wei Wuxian gets up. Lan Wangji is instantly there, taking almost his entire body weight. Wei Wuxian keeps forgetting about this stab wound from Koi Tower. In his old body when he'd had a golden core, he'd never had to worry too much about a serious injury because his level of cultivation was high enough that his spiritual energy would have healed this completely within a few days and then afterwards, when he had no golden core, Wen Qing's medicine would have also had him on the mend. And, in all honesty, he's not used to having to take care of such a fragile body like this. Now, even the amount of spiritual energy he needs to keep the bleeding to a minimum is a slow drain on him.</p>\n<p>They make it outside before they come across Yi Weichun, the man who has one prosthetic leg. Wei Wuxian doesn't remember what happened to him, not exactly and definitely not when there have been so many that he has fought, but he's not here to air those grievances now. He appears to have been waiting for them.</p>\n<p>\"I would not disrespect the Jiang Clan by making a scene within their Ancestral Hall,\" Yi Weichun starts, which is a bad sign. \"But don't think, Wei Wuxian, that I didn't see it when you used your demonic flute earlier – the Gusu Lan pendant. I don't know what trickery you used to gain it, or how you have the audacity to believe that you are worthy, but rest assured that I will defeat you.\"</p>\n<p>Wei Wuxian is about to protest, because of all the things that he has been misaccused of, this is by far beyond the pale, but there's a sword coming towards his chest. He doesn't even have anything to defend himself with because he can't remember where he left Suibian, and if there is, at the moment, the tiniest of uneasy truces between him and Jiang Cheng, the most surefire way of annihilating that would be to use demonic cultivation on the grounds of Yunmeng Jiang and summon a corpse to help him. He doesn't even have any talismans, because he used them all in the Burial Mounds.</p>\n<p>He throws himself to the side just in time – and gasps, as the last few stitches still hanging in there tear apart. He clutches at his chest, thrown for just a heartbeat, but that's long enough to see the sword curve, and slide towards his face.</p>\n<p>Wei Wuxian has nothing to defend with but himself: a quick mind and the muscle memory of good footwork from a body a decade dead that was over a hand's width taller.</p>\n<p>Well, that's what he thinks, until the white glare of Bichen slides in front of him, its owner following to place himself firmly between Wei Wuxian and his attacker. Wei Wuxian can just about see over Lan Wangji's shoulder the flicker of surprise on the man's face before Lan Wangji goes on the attack.</p>\n<p>Wei Wuxian doesn't know what Yi Weichun was expecting – that somehow, Wei Wuxian had managed to get a hold of his pendant and Lan Wangji's sense of honour would be so great that he would feel obliged to side with him against the entire cultivation world? As someone who has tried, in two different lifetimes, to convince Lan Wangji to do something other than what he has decided to do, the idea is laughable.</p>\n<p>Whatever circumstance he had made up in his head, Yi Weichun clearly hadn't expected to have to actually fight Lan Wangji himself. It's obviously not a fair fight – a man with one prosthetic leg could have conceivably won against Wei Wuxian, who doesn't wield a sword and who wouldn't be able to summon corpses here, but he stands no chance against Hanguang-jun.</p>\n<p>\"Yield,\" says Lan Wangji, as he deflects the next blow, and the next, and the one after that, without attempting to strike back. He doesn't raise his voice, and yet it resonates into the night.</p>\n<p>The tip of Yi Weichun's sword wavers, and his breath is heavy. \"I see. I don't know what kind of hold he has over you, but you will not fault me for trying. I leave you to your fate.\"</p>\n<p>He limps away – and as he rounds the corner, Wei Wuxian hears him say, \"Sect Leader Jiang.\"</p>\n<p>From bad to worse. Wei Wuxian winces as Jiang Cheng comes into view.</p>\n<p>\"You couldn't even go one evening without offending someone.\" Jiang Cheng's face says that he's here for a fight too, albeit a very different kind.</p>\n<p>Wei Wuxian isn't entirely sure what emotions flicker across his face just now – he can only blame being tired and in pain for his lack of self-control, because this kind of comment from Jiang Cheng is so commonplace that it shouldn't even register as an insult. But it really wasn't his fault this time, and he resents the implication that it must have been.</p>\n<p>Jiang Cheng scowls even more from whatever he sees on Wei Wuxian's face. \"Lan Wangji, stand aside. This has nothing to do with you.\"</p>\n<p>\"Wei Ying has nothing to do with you,\" says Lan Wangji, ever able to deliver the most devastating blow with the minimum number of words needed. He's right though; Wei Wuxian is no longer of Yunmeng Jiang and Jiang Cheng has no responsibility or control over him now. Jiang Cheng glowers even more.</p>\n<p>Wei Wuxian can feel the blood seeping through his outer robe again, even though his hand is pressed against the wound. It's dark, so it's probably not too visible right now, but he needs to sit down and take a look at it properly soon. He's starting to feel a bit lightheaded. \"Lan Zhan, let's just go. It's not worth it.\"</p>\n<p>\"Not worth it? <em>What's</em> not worth it?\" Jiang Cheng, his voice getting louder.</p>\n<p>\"Jiang Cheng – you know, oh, you <em>know</em> that's not what I meant. Lan Zhan, come on.\" Wei Wuxian sighs, and turns. He's already started to step back when he hears the telltale crackle of Zidian emerging, and there's a flicker of purple lightning out of the corner of his eye.</p>\n<p>It lights up the night air just enough for Wei Wuxian to see the way the back of his hand, pressed to his chest, is now stained red. He takes the next step - and passes out.</p>\n<p>Wei Wuxian wakes up to a gentle rocking motion that he hasn't felt in far too long, and it takes a moment for him to pull himself out of the comfortable haze. Sleep clings to the edges of his mind, and it's not until he tries to stretch out a leg and it hits something that he opens his eyes. So, he's definitely not in a bed. Huh. A boat, maybe? Given the rocking? Also, the pillow under his head seems awfully warm, which makes sense when he looks down and figures out it's Lan Wangji's thigh.</p>\n<p>\"Slowly,\" says Lan Wangji from somewhere above him. There's an arm tucked around his waist and over his chest – which he now realises he's been clutching to his chest with both hands – that gently takes his weight and eases him up.</p>\n<p>Everything feels slightly tingly.</p>\n<p>Wei Wuxian frowns. The last thing he remembers is Yi Weichun, and then Jiang Cheng, and then – oh, that's right. The stab wound, which now feels much better. He looks down at himself and almost doesn't recognise himself in the heavy white robe. He hasn't worn white robes since his days as a student at Cloud Recesses. Even if the clouds embroidered on the hems don't give it away as Lan Wangji's, the gentle scent of sandalwood that envelopes him would. His own robes are neatly folded on a different bench of the boat, and now he knows what he's looking for, he can see the sticky darkness of blood even in the dim light of the lantern.</p>\n<p>\"What–?\" He pulls the robe away from his chest to look down at himself. \"Lan Zhan, did you – how much spiritual energy did you use? This wound looks days old now.\"</p>\n<p>\"Enough,\" says Lan Wangi firmly.</p>\n<p>\"What <em>happened</em>?\"</p>\n<p>\"We fought.\"</p>\n<p>\"You and Jiang Cheng?\" Wei Wuxian sighs, and lets himself lean back against Lan Wangji's side. He feels drained even though he wasn't the one who expended all that energy on his own body. \"I suppose that was unavoidable at the end. I'm surprised he held on to his temper for so long, actually. Where are we now? And where are we headed?\"</p>\n<p>\"Master Wei, we're on the lotus lake. We were waiting for you to wake up to figure out where to go.\"</p>\n<p>Wei Wuxian starts – and in turn, Lan Wangji's hand on his hip also twitches. \"Wen Ning! How long have you been here?\"</p>\n<p>\"I've always been here, Master Wei.\"</p>\n<p>It's dark out, and they must be fairly far from Lotus Pier because its lights are small and in the distance. He could be excused for not having noticed Wen Ning right away, but he's sitting right next to the lantern on the boat, so... there really is no excuse.</p>\n<p>He looks between the two of them, Lan Wangji and Wen Ning. Wei Wuxian had thought that they didn't get along. Not in the same way that Lan Wangji and Jiang Cheng seem to actively dislike each other and struggle to curb their words against each other, but Lan Wangji in particular had never liked to see Wen Ning when he was drunk, and Wen Ning had always been far too intimidated by Lan Wangji. However, they both seem perfectly at peace here with each other. Wei Wuxian smiles; they're two of his favourite people and it had always been a shame that they hadn't got along.</p>\n<p>\"I thought... Well, never mind. The thing I really want to do is get something to eat. We should do that and then think about where to go, since I'm useless at thinking on an empty stomach.\"</p>\n<p>They end up stealing lotus pods on the way to Yunping after Wei Wuxian remembers the title deeds he saw in Koi Tower, something he'd done dozens of times when he was young.</p>\n<p>It's been difficult for Wei Wuxian to think back on Lotus Pier for a long time. His fond childhood memories of the place are tangled up with the bodies of Jiang Fengmian and Yu Ziyuan, broken and discarded on the ground; his times spent with Jiang Cheng and his shijie tainted by Jiang Cheng's later hatred and the guilt of his shijie's death. This is something entirely different.</p>\n<p>The stillness of the night around them is like a protective bubble, with only the gentle rippling of oars through water and their low murmuring in the night to accompany them. Lan Wangji is warm at his side, and every time Wei Wuxian tips his head up for Wen Ning to lob a peeled lotus at his face to see if he can catch it with his mouth, he's reminded that his friend is here, safe and not turned into ashes by Jin Guangshan. He knows that the stiff muscles in Wen Ning's face make it difficult to smile, and Lan Wangji is as unflappable as ever, but he smiles enough for all three of them.</p>\n<p>By the time they arrive in Yunping, it's early morning, dawn seeping through the low-hanging clouds. Workers are already up and about, and the smell of soapsuds and dye is heavy in the air as they approach. Wen Ning heads off to lie low for a bit, and the two of them find an inn where the innkeeper is up for the day already.</p>\n<p>Even though he's the only one who got any sleep that evening, and he's not entirely sure that falling unconscious counts as actually sleeping, Wei Wuxian is ready for a nap.</p>\n<p>The innkeeper unsubtly suggests usage of their baths beforehand – there are plenty of cloth-dying establishments nearby so there's an abundance of hot pipes to heat water – but her face is so earnest about it that Wei Wuxian doesn't even take any offence. \"That's probably a wise suggestion,\" he says, laughing.</p>\n<p>Wei Wuxian eases Lan Wangji's robe off himself, impressed that it still seems clean when everything about him feels entirely grubby, and makes to scrub himself off first. Lan Wangji had obviously taken care of his wound last night, but it had still been in the middle of a lake, in the middle of the night. There are remnants of dried blood flaking on his skin, and he's pretty sure he's still covered in dust from the Burial Mounds at this point.</p>\n<p>\"Wei Ying. Sit. You cannot reach,\" says Lan Wangji, who helps him climb into the tub. Lan Wangji is right – he can manage one side reasonably well, but all of Lan Wangji's efforts will go to waste if he reopens the wound (again).</p>\n<p>\"Ah, I can't wash only half of me,\" says Wei Wuxian, making a face.</p>\n<p>Lan Wangji looks down at him with what is possibly amusement. \"I will help.\"</p>\n<p>\"I – oh.\" Wei Wuxian is too tired to have a witty retort at the moment. He watches blankly as Lan Wangji wets a towel, wrings it out, and gently starts at Wei Wuxian's neck and shoulders, wiping him down. \"I guess it's only right that it's your turn.\"</p>\n<p>Lan Wangji looks at him quizzically. Oh, that's right; he doesn't remember that Wei Wuxian did this for him when he was drunk, and Wei Wuxian has never told him about it.</p>\n<p>\"When you were drunk. Hmm, the first time? I tried to get you to clean yourself before going to bed, but you didn't want to. So, I, you know. Helped.\"</p>\n<p>Lan Wangji's ears go pink, and Wei Wuxian reaches out to touch the shell of his ear before he even thinks about it. In his defence, he is very tired.</p>\n<p>\"I apologise for my behaviour,\" murmurs Lan Wangji. His ear is very warm.</p>\n<p>\"You don't have to apologise,\" says Wei Wuxian. \"You've had to deal with me so much, especially these last few days. I can't believe I've fainted twice in such a short time. So unseemly. I know you must have more important things to think about right now. I hope Zewu-jun is all right.\"</p>\n<p>\"My brother can take care of himself,\" says Lan Wangji, after a moment's pause. He goes to look through the towels, takes one out and regards Wei Wuxian with a narrow look, \"Wei Ying cannot.\"</p>\n<p>Wei Wuxian huffs a soft laugh, and takes the towel. \"Ah, if you had said that to me before, I would have taken so much offence. But I know better now. I'm happy to be taken care of, Lan Zhan. You'll make someone a very good husband.\"</p>\n<p>Even though the day is just starting for everyone else, Wei Wuxian falls asleep almost as soon as his head hits the pillow. The dreams wash over him in a haze, a jumble of memories and things that have never happened in real life – the bodies of the remaining Wen Sect crawling out of its bloody pool, looking as they did in life, asking him with blank eyes why they had never been laid to rest properly; Wen Qing telling him goodbye; Jiang Cheng staring at him, his expression changing from grinning to snarling and back again; Lan Wangji drawing his sword against him in Cloud Recesses, on the Qiongqi path, in the Nightless City.</p>\n<p>Wei Wuxian wakes with a gasp, terror gripping his heart, and nearly headbutts Lan Wangji in the face. He pulls back for a moment, panting at the ceiling, just about registering Lan Wangji hovering over him, his hands still on Wei Wuxian's shoulders. He shivers, and realises that he's covered in cooled sweat, and it takes his throat a few swallows to make a sound again. He sits up slowly. \"Sorry, Lan Zhan. Did I wake you?\"</p>\n<p>His eyes flit to the space beside him, where Lan Wangji has slept in their travels, and notes the fresh pillow, the untouched covers. \"You - did you not sleep?\"</p>\n<p>\"I meditated.\"</p>\n<p>\"You need to sleep too. How long has it been?\" Wei Wuxian asks, his teeth chattering slightly.</p>\n<p>\"Wei Ying needs looking after,\" says Lan Wangji, which Wei Wuxian notes is not an answer to his question. Lan Wangji drapes a blanket over Wei Wuxian's shoulders, and Wei Wuxian burrows into them even though the cold is coming from inside himself</p>\n<p>\"What time is it anyway? Did I waste the whole day away? I feel like I've spent so much time sleeping while you look after me recently.\"</p>\n<p>\"You needed the rest.\" Which is, again, not an answer to his question. But Wei Wuxian can tell from the sunlight that it's fast approaching the evening already. Sure enough, the innkeeper knocks on their door a few moments later with food for them. She's clearly bemused that they've spent the whole day indoors, but the quality of Lan Wangji's clothes probably keeps her from prying, as does the coin that he hands her.</p>\n<p>Wei Wuxian shuffles to the table still swaddled in bedcovers. \"Wine, again? You really have loosened up.\"</p>\n<p>It's Yunmeng wine, familiar and homely, and Wei Wuxian raises an eyebrow when Lan Wangji pours them both a cup. He debates, for a moment, whether to say anything, and then slides his hand over Lan Wangji's cup before he can drink it. \"Lan Zhan... I know I tease you about this, but you really don't have to drink it just because I am, or because I ask you to. You don't even remember what you do when you're drunk, you can't be having a good time.\"</p>\n<p>\"You are having a good time,\" Lan Wangji points out.</p>\n<p>\"<em>Aiya</em>, you <em>definitely</em> don't need to get drunk just because I find it amusing,\" says Wei Wuxian incredulously. \"You really do lose all your inhibitions. It's like drunk you has never heard of any of the Gusu Lan rules. You know, I could really take advantage of you. I could ask you anything, and you wouldn't know.\"</p>\n<p>\"I do not mind.\"</p>\n<p>Wei Wuxian stares at him baffled. He understands, he thinks, that Lan Wangji is trying to say that he doesn't mind losing his inhibitions when he is with Wei Wuxian – what he doesn't understand is <em>why</em>. Especially since Wei Wuxian has in fact already taken advantage of his drunk state to pry answers out of him that he wouldn't have got when Lan Wangji was sober.</p>\n<p>Lan Wangji puts his cup of wine down. \"It distresses you.\"</p>\n<p>\"<em>You</em> distress me, Lan Zhan! You are far too trusting of me! With your drunk self and your Cloud Recesses token, and everything. You'll make me think that I'm a responsible person soon.\"</p>\n<p>Lan Wangji hums, and Wei Wuxian points at him accusingly. \"You're laughing at me again.\"</p>\n<p> </p>\n<p align=\"center\">*</p>\n<p> </p>\n<p>They head out after they've eaten – the food made Wei Wuxian feel a little better, but there's still a vague uneasy feeling lingering after the nightmares, plus the grogginess of having slept at the wrong time, and he hopes the fresh air will help ease it. The day is winding down, with only inns and street food stalls still open, but it becomes apparent soon enough that they seem to be headed for the large Guanyin temple. It appears to be closed already, which is strange. As far as Wei Wuxian is aware – and it's not like he's ever seen one of these in a city before anyway – temples are open at all hours of the day for whenever folk need them, and the hours after people have finished work for the day are particularly popular.</p>\n<p>There's a notice on the door that he hops up the steps to see, but when he's close enough to read the sign that says 'closed for maintenance, please return in three days', he's also close enough to feel the weird aura of spiritual energy surrounding the place. He raises a hand to Lan Wangji and presses a finger to his lips; Lan Wangji silently comes up beside him. \"Can you feel that? There's some sort of array or spell over the place.\"</p>\n<p>Lan Wangji nods, brows furrowed for a moment. \"I am unfamiliar with it.\"</p>\n<p>\"Me too. Let's head up round the back.\"</p>\n<p>They circle to the side of the temple. Lan Wangji holds out his hands, interlaced for Wei Wuxian to step up on and Wei Wuxian uses just enough spiritual energy to boost himself onto the slope of the tiles. (Lan Wangji hops up next to him effortlessly all the way from the ground, of course.) It's a good thing he's had a lot of experience climbing around rooftops he shouldn't have been, because Wei Wuxian feels it the moment he penetrates the perimeter of the spell, and is surprised enough by the suddenly loud sounds from within the courtyard that he might have fallen off otherwise.</p>\n<p>He pulls his head back, and forth, and now he knows it's there, he can feel the thin spiritual membrane that runs along the top of the roof, the edge of the spell keeping the sounds from the temple from carrying into the night air. When he peeks over the edge of the roof, he can see people dressed in monk-garb behaving in decidedly unmonk-like behaviour, shouting and shoving each other, swearing as they try and get something done. What that <em>something </em>is, he can't tell.</p>\n<p>Wei Wuxian cranes his neck further as he catches a flash of the palest blue, and then grabs Lan Wangji's elbow. \"It's Zewu-jun. And Jin Guangyao!\"</p>\n<p>Lan Wangji studies the scene before them, lips pressed together. Eventually, he says, \"My brother is not a part of this.\"</p>\n<p>Wei Wuxian nods. If there were any siblings better at understanding each other when they seemed inscrutable to the world, it is the Twin Jades of Gusu. He trusts Lan Wangji to be able to read Lan Xichen. He's about to suggest that they sneak closer, perhaps by moving over to the corner where there's a tree that reaches up from the courtyard and will cover their entrance, but then there's the barking, and the most unsubtle nephew ever, and somehow they find themselves all clustered on the ground with Jin Guangyao anyway, who looks completely unsurprised to see them all there.</p>\n<p>Lan Xichen's spiritual energy has been sealed away, Lan Wangji seals his own almost immediately, Wei Wuxian has scarcely any to begin with – plus he's still not carrying a sword, he can't even remember where he left it after he got off Lil Apple on his way up the Burial Mounds mountain – and clearly no one thinks that Jin Ling is a threat.</p>\n<p>If it had been just him in this situation, Wei Wuxian would probably have done something stupid and rash, and betted on himself to come out of it alive, if barely. But he can't risk the lives of everyone else here for that.</p>\n<p>\"Are you all right, Master Wei? You look rather pale,\" asks Lan Xichen when they've made their way indoors in an orderly fashion after it started to rain, and have seated themselves in a sensible manner inside the temple. It makes Wei Wuxian want to laugh; if they were ordinary people, they would have been jumping up and down frothing at the mouth, threatening each other, but they're all mannered cultivators here, and so they kneel on cushions and bow to each other when they're prisoners and inquire politely about each other's health instead.</p>\n<p>Wei Wuxian looks at him. No, that's unfair. There is actual concern in Lan Xichen's eyes. \"It's nothing, Zewu-jun. Compared to the situation we're in now, at least.\"</p>\n<p>\"I must... apologise. A-Yao caught me off-guard.\" Lan Xichen looks slightly embarrassed.</p>\n<p>Wei Wuxian rushes to head him off. \"No, no, Zewu-jun, you had – you have always had – the best of intentions.\"</p>\n<p>On his other side, Lan Wangji asks quietly, \"Nothing?\"</p>\n<p>\"Nothing other than the nightmares,\" says Wei Wuxian with a shrug. He tries to smile, even though it hurts his throat where the garotte sliced into him. \"Ah, it's your fault, really. I've got all used to you sleeping next to me to stop the nightmares, I probably won't get any peace when I sleep alone now.\"</p>\n<p>There is a moment, before Wei Wuxian realises how quiet it is in here. Jin Guangyao is standing near them, having snuck close like a silent shadow from whatever he's supervising and both he and Lan Xichen are looking at him with wide eyes.</p>\n<p>Lan Wangji, who surely could not have missed the two grown men staring at them, folds his hands into his lap primly and stares determinedly at him. \"Then Wei Ying should not sleep alone again.\"</p>\n<p>Jin Guangyao laughs, and covers it with a cough. \"I came to see if you were comfortable, but I see I needn't have worried.\"</p>\n<p>\"Comfortable? You're keeping us prisoners,\" says Wei Wuxian incredulously. \"Anyway, Lan Zhan, that's <em>completely </em>unpractical. When you stop travelling with me and get married, of course I'm going to have to figure out how to sleep alone and take care of myself again.\"</p>\n<p>(\"You might be prisoners, but there's no need to be uncivilised about it,\" murmurs Jin Guangyao, unruffled, before he heads into the back of the temple again. He even bows his way out.)</p>\n<p>\"Master Wei – when I told you about our parents,\" Lan Xichen interrupts hesitantly, like he's mortified at his own bad manners, but whatever he has to say is so important that he has to do it anyway, \"I didn't wish for you to get the wrong idea. Male and female cultivators spend their working days in separate parts of Cloud Recesses, true, but wedded couples in Gusu Lan do usually live together.\"</p>\n<p>\"Oh,\" says Wei Wuxian, who isn't entirely clear why Lan Xichen is bringing this up. He thinks about it, and realises that he doesn't actually know anyone in Cloud Recesses who is married. \"I had never thought about it. But anyway, Lan Zhan, I'll know when it's coming because you'll have to ask me for your pendant back.\"</p>\n<p>\"Pardon?\" says Lan Xichen.</p>\n<p>\"It is yours to keep,\" says Lan Wangji.</p>\n<p>\"Wangji!\" says Lan Xichen.</p>\n<p>\"Huh?\" Wei Wuxian.</p>\n<p>\"What the <em>hell</em>?\" yells Jin Ling, and they all start. Wei Wuxian suspects they'd all forgotten that he was there at all.</p>\n<p>Jin Ling points at Wei Wuxian, \"You! Why are you so shameless? Just give it back to him if you don't want it! Didn't you say yourself on Dafan Mountain that you had a reputation to maintain if you wanted a good man?</p>\n<p>\"And <em>you</em>,\" Jin Ling also points at Lan Wangji, even as he pales while doing so, fully aware of his rudeness, and yet barreling on anyway, \"Hanguang-jun, why do you keep accepting challenges if he already has the token?! Is this honourable of you?\"</p>\n<p>Though it is still the middle of the night, there is a dawning. The dawning is inside Wei Wuxian's head. It is slow and creeping like the eventual break after the year's longest night, inching forwards upon the shadows until, all at once, everything is illuminated. He points at Lan Wangji, finger trembling. \"I thought you gave it to me for safekeeping!\"</p>\n<p>\"I wish for you to keep it very safe,\" says Lan Wangji fiercely.</p>\n<p>\"Lan Zhan!\"</p>\n<p>Lan Wangji stares back at him, jaw clenching and unclenching as he struggles to find the right words, and Wei Wuxian can scarcely believe that because Lan Wangji is the most eloquent person that Wei Wuxian knows.</p>\n<p>\"Wei Ying. You have no obligation. I did not, do not, harbour any expectations. Even if you had never known what it was, it is yours to keep.\" Lan Wangji's chest heaves with the weight of his words.</p>\n<p>\"You – how dare you,\" splutters Wei Wuxian. \"Of course I have an obligation! You have been so kind and considerate and beautiful and thoughtful, of <em>course</em> I want to repay that! Of course I also want to hold you when you're cold, and bathe you when you're tired, and feed you when you're hungry, and be by your side when you are sick or wounded – not that anyone is good enough to wound you, I know, I know. You spend all this time taking care of me, who's going to take care of you?\"</p>\n<p>He throws himself at Lan Wangji, wound be damned, and curls his arms around him, pressing his face into Lan Wangji's neck. \"You are the best, Lan Zhan, and you have spoiled me so much and you won't even give me the chance to spoil you back? That's so mean of you.\"</p>\n<p>Lan Wangji's hands settle hesitantly on the small of his back. \"Wei Ying.\" His voice is so uncertain that Wei Wuxian wants to cry.</p>\n<p>He presses himself in closer to Lan Wangji until all his weight is on his lap, his legs wrapped around his hips. \"Do I have to be clearer? I like you. I like you a lot, Lan Zhan. I thought you wanted to never be married, and I want you to get what you want, so I also wanted you to never get married. But I do. I want you to get what you want, <em>and</em> I want you to get married.\"</p>\n<p>Lan Wangji's heart is racing, almost as fast as Wei Wuxian's own. He presses a hand to Lan Wangji's chest, just to check again, and when he looks up, Lan Wangji is staring down at him with eyes wide.</p>\n<p>\"You told me once – you won't remember, Lan Zhan – but you told me once that you don't show your emotions with your face, but your heartbeats always give you away. I can feel them now, Lan Zhan, they've completely betrayed you. And since I seem to always misunderstand your intentions, I suppose I will have to check like this more often.\" He presses his ear, the side of his face, to Lan Wangji's chest.</p>\n<p>The hands at the small of his back fist into his robes, and then Lan Wangji is pulling him in tight until he can barely breathe and when he looks up this time, Lan Wangji dips his head down and he has just a moment to realise what's coming – oh, a kiss – before it arrives, their lips meeting in a rush of clacked teeth and choked gasps and relief.</p>\n<p>Wei Wuxian feels even more faint than before, but Lan Wangji's arms are holding him up, and then he realises it's because he's forgotten to breathe, and so has Lan Wangji, so they inhale sharply and do it all over again.</p>\n<p>In hindsight, it seems appropriate that this kiss happens in the middle of a crime scene in progress, as Lan Xichen and Jin Ling look determinedly at anywhere but at them, as the doors to the Guanyin temple are flung open, the storm and lightning a dramatic backdrop as Jiang Cheng appears, soaked, furious, and wielding a crackling Zidian.</p>\n<p>At the time, neither of them notice any of this, caught up in words unsaid and words unneeded.</p>\n<p>There are other things to wrap up, naturally – how to stop Jin Guangyao, dealing with the simmering rage of Nie Mingjue's corpse, Jiang Cheng's wound when Jin Guangyao manages to stab him, <em>Su She</em>, whatever is going on with Nie Huaisang, and Wei Wuxian has long considered himself a realist rather than an optimist but suddenly it feels as though these are things that will definitely resolve themselves.</p>\n<p>As soon as is appropriate – that is, when the chance arises and neither Lan Wangji nor Jiang Cheng would be put in danger because of it – Wei Wuxian pulls out his flute and calls for some ghosts to come to their aid. He glances at Lan Wangji quickly, because they have been synchronised in their moves when it comes to combat for weeks now, and spots him looking at the white pendant on the bottom of the flute with a look that Wei Wuxian can only describe as <em>smug</em>. He misses three notes, flustered, but he's pretty sure Lan Wangji is the only one who notices.</p>\n<p>Later, when dawn is breaking again, and they have at least some of the answers they've been looking for, when Jiang Sect disciples arrive and start clearing out the temple and Jin Guangyao's men, when Jiang Cheng had looked at Wei Wuxian and then left, when Wei Wuxian pushes his sleeves up and coincidentally notices that the last curse scar on Mo Xuanyu's arm has healed, when Lan Xichen is stood in the middle of the courtyard, quiet heartbreak in his eyes, Lan Wangji and Wei Wuxian walk out of that temple slowly, their hands joined together as they have been for hours now. Lan Wangji keeps looking down at it, as if he can barely trust his own senses, as if the warmth on his hand could be his imagination.</p>\n<p>\"Wangji. Master Wei. Congratulations,\" says Lan Zichen, gracious as ever even now, although his smile doesn't quite manage to reach his eyes. \"Should I let it be known that the challenge is done with?\"</p>\n<p>Lan Wangji inclines his head, but Wei Wuxian shrugs. \"Oh, I don't know.\"</p>\n<p>Lan Wangji's grip on his hand becomes tight, and Wei Wuxian pats it reassuringly. \"I have to admit, Lan Zhan, I enjoyed watching those duels. You so rarely get the chance to see you display your beautiful swordsmanship otherwise, and those cultivators do try so hard. Why don't we see how long it takes for them to work it out?\"</p>\n<p>Wei Wuxian's mischievous grin softens when he sees the torn expression on Lan Wangji's face (his eyebrows, they are the tiniest bit furrowed). \"It'll only be their fault if they don't figure it out when we send out the wedding announcement.\"</p>\n<p>Lan Wangji exhales, nods again. \"Wei Ying.\"</p>\n<p>\"Mm?\"</p>\n<p>\"Will you come back to Gusu with me?\" This time, for the first time, it is a question.</p>\n<p>Wei Wuxian smiles, and wraps his entire body around Lan Wangji's arm. \"Well, how else are you going to get in without me?\"</p>\n<p> </p>\n<p align=\"center\">*</p>\n<p> </p>\n<p>\n<b>Epilogue</b>\n</p>\n<p> </p>\n<p>\"Lan Zhan!\"</p>\n<p>The door to the Jingshi opens forcefully, and a veritable whirlwind makes its way in. Wei Wuxian's hair ribbon is sliding down his ponytail, and his outer robe is escaping the confines of his belt. There's grass in his hair, ink stains on his fingers, and one of his boots is soaked through from when he accidentally stepped into the stream, and it feels like Spring has arrived in Cloud Recesses.</p>\n<p>\"I have heard the most interesting news from the townspeople in Caiyi Town. They told me it's been news for <em>ages</em>, but you'll never guess,\" says Wei Wuxian, hopping as he wrestles the soggy boot off.</p>\n<p>Lan Wangji does not look up from his calligraphy. \"Mn?\"</p>\n<p>\"They told me that one of the Twin Jades of Lan, Hanguang-jun himself, has made a proclamation.\"</p>\n<p>\"Has he?\"</p>\n<p>\"Yes! He is apparently keen to foster relationships between clans, and has offered himself as cultivation partner and spouse to anyone who challenges him and is able to take his Gusu Lan pendant from his body. Can you believe it?\"</p>\n<p>Wei Wuxian arrives in the study area of the Jingshi, a trail of clothes on the floor behind him – a damp sock and its dry twin, a thick sash, an outer robe – and drapes himself over Lan Wangji's back, arms sliding up to wrap around his chest.</p>\n<p>\"Mn, how unbelievable,\" says Lan Wangji. He turns his head slightly, and presses a kiss to Wei Wuxian's temple.</p>\n<p>\"He's such an incredible cultivator, what an opportunity. I bet cultivators will jump at the chance.\"</p>\n<p>\"No gambling in Cloud Recesses,\" Lan Wangji reminds him as Wei Wuxian kisses him back, on the temple, and then the cheek, and then his neck.</p>\n<p>\"That's all right, the line is sure to stretch all the way out of Cloud Recesses and down the mountain. I'll set up my odds at the bottom. I wonder – if I challenged him, what do you think my chances would be?\"</p>\n<p>Lan Wangji reassures him, \"You should not underestimate yourself.\"</p>\n<p>\"Ah, so encouraging, Lan Zhan,\" says Wei Wuxian as he slowly strokes Lan Wangji's chest. \"I don't think I could beat him in an honest duel, he's far too good. I would have to beat him with sneaky tricks and underhanded methods, you know.\"</p>\n<p>\"Sneaky tricks and underhanded methods are a trademark of the Yiling Patriarch,\" says Lan Wangji seriously, putting his calligraphy brush down on the ink slab, just in time for Wei Wuxian to clamber around and slide into his lap, peppering his lips with tiny kisses until Lan Wangji tips his chin up for a proper kiss; Wei Wuxian sinks into it with a delighted groan.</p>\n<p>When they part for air, he sneaks his hand down between their chests towards Lan Wangji's belt, where a white jade Gusu Lan pendant hangs. This one is so new that there are still rough edges on the carving, not yet smoothed away, and it's unmistakeably Lan Wangji's, being the only one in the whole of Cloud Recesses that is on a red and black tassel.</p>\n<p>Wei Wuxian breathes softly into Lan Wangji's ear as he plucks out the pendant, and dangles it in front of Lan Wangji's face. \"Well, he will just have to punish me if I succeed then, won't he?\"</p>\n<p>The tiniest twitch appears in the corner of Lan Wangji's mouth. \"How shameless.\"</p>"
}