{
  "id": "23613328",
  "url": "https://archiveofourown.org/works/23613328?view_full_work=true",
  "author": [
    "pupeez4eva"
  ],
  "title": "A Dramatic Reading",
  "rating": "Not Rated",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "魔道祖师 - 墨香铜臭 | Módào Zǔshī - Mòxiāng Tóngxiù",
    "陈情令 | The Untamed (TV)"
  ],
  "relationships": [
    "Lan Zhan | Lan Wangji/Wei Ying | Wei Wuxian"
  ],
  "characters": [
    "Wei Ying | Wei Wuxian",
    "Lan Zhan | Lan Wangji",
    "Lan Yuan | Lan Sizhui",
    "Lan Jingyi",
    "Jin Ling | Jin Rulan",
    "Ouyang Zizhen",
    "Lan Huan | Lan Xichen",
    "Lan Qiren",
    "Jiang Cheng | Jiang Wanyin",
    "Sect Leader Yao (Modao Zushi)",
    "Sect Leader Ōuyáng",
    "Nie Huaisang"
  ],
  "additional_tags": [
    "Humor",
    "Post-Canon",
    "Public Confessions",
    "oblivious wangxian",
    "The Juniors accidentally write Wangxian fanfiction on a cursed scroll",
    "Everyone suffers the consquences",
    "Getting Together"
  ],
  "language": "English",
  "series": "",
  "published": "2020-04-12",
  "completed": null,
  "words": "5,627",
  "chapters": "1/1",
  "comments": "693",
  "kudos": "8,936",
  "bookmarks": "1,952",
  "hits": "54,075",
  "summary": "<p>Lan Wangji and Wei Wuxian make out in a room full of Sect Leaders, Jiang Cheng tearfully declares his love for his estranged brother, Sect Leaders Yao and Ouyang beg for the Yiling Patriarch’s forgiveness, and Lan Qiren openly welcomes a new nephew-in-law into his family.</p>\n<p>None of them want to be doing any of this. Thanks to the Juniors, they don’t exactly have a choice.</p>\n<p>(Or, wherein the Juniors accidentally write a cursed fanfiction, and everyone has to reenact their parts in it, or potentially cease to exist).</p>",
  "notes": "<p>Hey, just a quick note before we start what is probably one of my craziest ideas so far - while my MDZS fics are generally set in the novel universe, I'm using the ending of the drama for this, where WWX leaves after the Guanyin Temple, and LWJ becomes Chief Cultivator</p>\n<p>Hope you enjoy this! It's...probably one of the craziest ideas I've had so far, and it was definitely fun to write haha</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Hope you guys enjoyed this little piece of insanity my brain decided to spit out.</p>\n<p>So I spent the majority of today trying to get what is probably the worst assignment I have done in my life finished, and I’ve gotten through maybe half of it. I desperately needed a break, and writing usually calms me down, and I somehow ended up coming up with this idea.</p>\n<p>…I usually come up with the most random fic ideas, but I think this might be the weirdest one I’ve thought up so far.</p>\n<p>So, I don’t know if I explained this whole ‘cursed scroll’ idea well enough, so — basically, it’s a blank scroll where if you write something on it, e.g. “[insert name] needs to…” they need to do fulfil whatever the action is, or they cease to exist. The scroll will usually take about a day after the instructions have been written on it to work, and when it does a curse mark will appear on the arm of the person who has been cursed, and the same mark will appear on the scroll above whatever has been written. The mark will grow darker as the hours past, and gets closer to the moment when time will run out, and will only disappear after the action has been carries out.</p>\n<p>…Basically I just made up the dumbest idea I could think of to let me create this monstrosity xD </p>\n<p>Hopefully you guys still enjoy it though xD Let me know what you think!</p>",
  "text": "<p>No one wanted to be on the other end of a cursed scroll.</p>\n<p>Legend said that if someone got a hold of one, they could command a person to do whatever they wanted simply by writing it on a section of the parchment. The person would have to carry out whatever action was written down, or would otherwise cease to exist. Of course, there were ways to render the scroll ineffective, but that was time consuming, and potentially risky. </p>\n<p>Legend would be very accurate in this instance, as the Junior disciples would very soon realise. </p>\n<p>It all began when a sheet cursed scroll somehow got mixed in with Ouyang Zizhen’s things — and he couldn’t figure out just when that had happened, perhaps when he bumped into that strange looking man in Caiyi Town the previous week, or when he had dropped his belongings on the way back from the trip in the busy town area, and had to hastily pick them up. The point was, he had hardly questioned its presence amongst the rest of his school papers and stationary, and had carried on with his day like normal.</p>\n<p>Had he simply used the scroll to write out his class work, or a homework task, or even the long list of Lan rules during his punishment the previous day, perhaps things would have been alright (actually, no, maybe the last one would have been <em>very bad). </em></p>\n<p>Instead, the scroll had slipped in with the rest of the pages of what would be one of numerous stories that he, Lan Jingyi, Lan Sizhui and Jin Ling had written since that disastrous day at the Guanyin Temple.</p>\n<p>And oh, it was disastrous for a number of reasons. Of course, Jin Guangyao holding Jin Ling, Sect Leader Lan, Hanguang-Jun and a range of other people hostage wasn’t great; and then all of those people had nearly died, and then Jin Guangyao <em>had</em> died, and all of that obviously wasn’t the best.</p>\n<p>If you asked the Juniors though, the most tragic part of all of it was that <em>Wei Wuxian had walked away.</em> Instead of staying, and marrying Hanguang-Jun, and having lots of bunny children with him, he had left to go and travel the world <em>alone</em>, and Lan Wangji had stayed behind to become the Chief Cultivator.</p>\n<p>It was ridiculous, really. In their opinion, Wei Wuxian should be here, where he belonged. And so, after one miserable afternoon of ranting and raving, the first story had been written; a short little tale about Wei Wuxian and Lan Wangji eloping after everything at the temple had settled, and living happily ever after.</p>\n<p>After that, the stories hadn’t stopped. It wasn’t that they <em>cared</em>, Jin Ling would vehemently deny, but it was a little hard not to be frustrated by how oblivious they both were. Writing the stories were their way of coping with the general awfulness of being forced to witness pining from two people who <em>really</em> shouldn’t be pining anymore.</p>\n<p>(Honestly, if a bunch of teenagers had realised it, <em>how hadn’t they realised it yet?!). </em></p>\n<p>They had finished the latest story the previous day, a tale of decent length about Jin Guangyao being resurrected as an evil sentiment fierce corpse by a strange woman who would later turn out to be the reincarnation of the evil Wen Ruohan. Senior Wei would team up with Hanguang-Jun to heroically save the day, while receiving praise from all around, reuniting with his brother, and passionately declaring his love for Hanguang-Jun, and eloping soon after.</p>\n<p>Jin Guangyao would die painfully. Jin Ling was still maybe a tad bit bitter about what his uncle had done.</p>\n<p>None of them even spared a second thought that something could be wrong when Ouyang Zizhen hunted down a spare piece of paper from his belongings to finish the final page on. After the story had been completed, they looked down on it with pride in their eyes, ready to hide it away with the rest of their stories so that no one would ever find it. </p>\n<p>Lan Jingyi tucked the pages away in his pocket, and told his friends that he would hide them away under the floorboards of his room with the rest of the goods. His friends agreed, and he promptly forgot about them the second he left the room.</p>\n<p>…</p>\n<p>The Juniors were <em>thrilled</em> when it turned out that Wei Wuxian had arrived for a visit the next day. Of course, that day just happened to correspond with when a discussion conference was being held in the Cloud Recesses, and much to the frustration of pretty much everyone in the room who wasn’t Lan Wangji, Wei Wuxian had decided to attend the meeting too.</p>\n<p>No one bothered to protest it, because Lan Wangji would shoot them a death stare whenever they tried.</p>\n<p>The Juniors were in attendance, Ouyang Zizhen with his father, Lan Sizhui with Lan Wangji, Jin Ling representing his Sect, and Lan Jingyi there because he had somehow managed to sneak in before anyone had realised. Their respective Sect Leaders thought that these meetings would be a good way for the would-be leaders to get some much needed experience.</p>\n<p>Lan Qiren shot Lan Jingyi a beady eyed stare, and Lan Jingyi smiled back unashamedly. Beside him, Wei Wuxian shot him a proud look.</p>\n<p>The meeting droned on, boring as ever, and Lan Jingyi questioned the logic of sneaking in here. Surely, being out <em>there</em> would be so much better.</p>\n<p>Wei Wuxian, sitting beside Lan Wangji, and giving him the most doe-eyed, loved up expression that anyone had ever seen, didn’t seem to notice the looks of anger and loathing being directed his way. Lan Wangji, looking just as besotted (not that anyone but Lan Xichen, who had only just left seclusion recently, could see that), didn’t notice either, which was probably the only reason those people still had the ability to glare.</p>\n<p>Not one person decided to point out that, as Chief Cultivator, Lan Wangji should really focus more on the actual meeting, and less on Wei Wuxian.</p>\n<p>Lan Jingyi let out a bored sigh, and remembered the story he had tucked away in his pocket. Well, it wasn’t like he was doing anything right now. He pulled it out, his eyes flickering over the words they had written. Ahh, truly a masterpiece.</p>\n<p>It wasn’t until midway through the meeting that Sect Leader Ouyang let out an alarmed yell, and pulled back his sleeve to display a strange sigil that had appeared on his arm.</p>\n<p>“What <em>is</em> this?” he demanded.</p>\n<p>After that, many people started to realise that they had similar marks on their own bodies. It didn’t take long for someone to link it back to the cursed scroll — while rare, they weren’t so uncommon that cultivators didn’t know how they worked. When someone’s name was written in one of the scrolls, a mark would appear on their arm, usually the following day, and would grow darker as the hours passed. It was only after the action written on the scroll had been fulfilled that the mark would disappear.</p>\n<p>The darker the mark, the closer you were to running out of time. Distracted by the meeting, no one had noticed the marks that had appeared on themselves, until far too much time had passed.</p>\n<p>This…was really, really bad.</p>\n<p>“We’ve all been cursed!” Sect Leader Yao roared, with panic in his voice.</p>\n<p>“What is this?” </p>\n<p>“Someone needs to find the source right now — ”</p>\n<p>“Ahh, I’m fine,” Nie Huaisang said, checking his bare arm, and sighing in relief. Jiang Cheng shot him a venomous look.</p>\n<p>“Jingyi,” Lan Sizhui said, panic in his voice. Beside them they could hear Lan Qiren’s alarmed voice demanding if Wei Wuxian had done anything, and Wei Wuxian protesting, saying that <em>he</em> had apparently been cursed as well —</p>\n<p>Sizhui pointed frantically to the mark that had appeared at the top of the sheet of paper, that definitely hasn’t been there when they had first written on it. He shot Jingyi a panicked look.</p>\n<p>Oh. Well this was…very, very bad.</p>\n<p>“Sizhui,” Lan Jingyi hissed, trying to remember all he could about cursed scrolls, “If we just ignore this and don’t tell them it was us, what happens?”</p>\n<p>“Everyone dies.”</p>\n<p>Jingyi blanched. “Oh. That’s not good.”</p>\n<p>…</p>\n<p>Telling people that they were to blame for the cursed scroll was a very uncomfortable situation. On the bright side, the people who would usually complain the most were mostly related to the perpetrators, so that got rid of a fair deal of the death threats, and promises to make them pay for this.</p>\n<p>“It was an accident!” Jin Ling insisted, shooting a furious Jiang Cheng a panicked look. “How were we supposed to know it was a cursed scroll?!”</p>\n<p>“It must have gotten mixed in with my things,” Ouyang Zizhen insisted. “Or — I don’t know, but we definitely didn’t know what it was!”</p>\n<p>“Everyone needs to stop panicking,” Wei Wuxian said casually, as if they wouldn’t all cease to exist if time ran out. “They’re a bunch of kids, what could they possibly have written that was so bad? I doubt they were trying to hurt anyone.” He looked at the Juniors, who all nodded their heads frantically.</p>\n<p>Lan Xichen let out a small sigh, rubbing the mark on his own wrist. “Alright then. Why don’t you just read what you’ve written, so we all know what we have to do.”</p>\n<p>For a moment, there was dead silence.</p>\n<p>“Uh…”</p>\n<p>“Jingyi can read it,” Ouyang Zizhen said.</p>\n<p>“Wha — hey! Why do I have to read it?!”</p>\n<p>“You’re holding it.”</p>\n<p>Everyone stared at him expectantly, all looking various degrees of annoyed, frustrated or curious. </p>\n<p>Lan Jingyi glanced down at the paper in his hand, and then helplessly to Lan Sizhui, who was trying his best to look composed.</p>\n<p>“Oh, just read it already,” Jiang Cheng snapped. </p>\n<p>“Jingyi,” Lan Sizhui said, “we don’t exactly have a choice right now.”</p>\n<p>“Jingyi just needs to tell us what they wrote, and then we’ll just do whatever it says, and we can go back to this boring meeting like nothing even happened,” Wei Wuxian said cheerfully. </p>\n<p>“No one asked <em>you</em> to come!” Lan Qiren snapped.</p>\n<p>“I did, Uncle,” Lan Wangji said calmly. Wei Wuxian beamed at him, and Lan Qiren glowered.</p>\n<p>Jingyi swallowed. “Uh — right. Read it. Yes.” He glanced down helplessly at the sheet of paper. “Um — maybe some background first? Sizhui, would you like to do the honours?”</p>\n<p>Sizhui stared at him.</p>\n<p>“Since I actually have to <em>read</em> this thing, could you please give them some background?” </p>\n<p>Sizhui inhaled sharply, and nodded. Looking as if he was readying himself for war, he turned towards Lan Wangji and Wei Wuxian, who were both watching him in confusion.</p>\n<p>“Hanguang-Jun, Senior Wei…I apologise for what we have done.” He met their eyes dead on, his fists tightening. “We have written a story.”</p>\n<p>Lan Wangji blinked. “A story.”</p>\n<p>“Yes.”</p>\n<p>“A <em>story?!”</em> Sect Leader Yao yelled, a vein pulsing in his forehead. “Why were you writing a story about me?!”</p>\n<p>“It wasn’t about <em>you,”</em> Jin Ling said indignantly. “It’s about Senior Wei and Hanguang-Jun!”</p>\n<p>Everyone turned to stare at him. </p>\n<p>“What?” Jiang Cheng said, his voice low and dangerous.</p>\n<p>Jingyi decided that this would be a good time to start reading. “Right,” he said, clearing his throat, “So this is an excerpt from the, uh, final page of the story. The page we accidentally wrote on the scroll — did I mention that this was an accident?”</p>\n<p>“Read, Jingyi,” Sizhui said.</p>\n<p>Jingyi complied.</p>\n<p>\n<strong> <em>“Wei Wuxian gazed into Hanguang-Jun’s eyes, a look of true love on his face. “Oh Hanguang-Jun!” He cried, his warms wrapping around Hanguang-Jun’s strong biceps — “</em> </strong>\n</p>\n<p>“What,” Wei Wuxian choked, “is this?”</p>\n<p>“Senior Wei,” Jingyi whimpered, “please let me finish.” Reading this aloud, he decided, was a very painful experience. These stories were meant for their eyes only, and the floorboards that they hid them under when everything was finished.</p>\n<p>“What exactly have you been writing?!” Wei Wuxian demanded. The Juniors tried very hard not to look at him or Lan Wangji.</p>\n<p>Lan Xichen, standing beside a frozen Lan Wangji, looked like he would very much like to be back in seclusion. “Young Master Wei,” he said, his voice strained, “the requirements of the scroll won’t be fulfilled unless you actually fulfil what is written on the page.”</p>\n<p>Wei Wuxian turned to stare at him. “What?”</p>\n<p>“You will have to complete any actions written on the page,” Lan Xichen said, his voice pained.</p>\n<p>“Xichen!” Lan Qiren snapped in protest.</p>\n<p>Wei Wuxian turned to Lan Wangji, who was looking at him, his expression frozen. </p>\n<p>“He’s going to kill us,” Ouyang Zizhen whispered to Jin Ling, who was busy staring at Jiang Cheng in panic.</p>\n<p>“Right,” Wei Wuxian said. “Okay, yeah, I can do that — uh, Jingyi, can you repeat that please.”</p>\n<p>Jingyi, for once looking like he hadn't the slightest ounce of shame, repeated what he had just read. Most of the room stared at him with loathing in their eyes. Nie Huaisang fanned himself, looking intrigued.</p>\n<p>Wei Wuxian stood up, and walked over to Lan Wangji. He spared the briefest moment to give him an apologetic look, and then moved forward, wrapping his arms around Lan Wangji’s. “Oh Hanguang-Jun,” he said. “I…” He turned back to Jingyi. “I’m sorry, what comes after that?”</p>\n<p>Jingyi glanced down, and swallowed. “Lan — uh, Lan Zhan, you are truly the…the love of my life, and my, uh soul.” </p>\n<p>Wei Wuxian stared at him incredulously.</p>\n<p>“Jin Ling came up with that line, okay?!” Jingyi snapped defensively.</p>\n<p>“That’s a<em> lie!” </em></p>\n<p>“Lan Zhan,” Wei Wuxian said, the words pouring out of his mouth hurriedly, “you are truly the love of my life and my soul.”</p>\n<p>Lan Wangji stared at him, unblinking.</p>\n<p>“Right,” Jingyi said, his voice shaking. “And then, Hanguang-Jun needs to say…uh…” He cleared his throat. <strong><em>“Mn. Wei Ying is my love. Wei Ying is my everything.” </em></strong></p>\n<p>Silence.</p>\n<p>“Hanguang-Jun, you don’t really have to say that,” Jingyi said hurriedly. “Just, uh — Sizhui?”</p>\n<p>“He needs to say it,” Sizhui said, sounding miserable.</p>\n<p>“Yes, but — “</p>\n<p>“Wei Ying is my love,” Lan Wangji said calmly. “Wei Ying is my everything.”</p>\n<p>Wei Wuxian let out a small noise, a strange expression on his face. From beside them, Lan Xichen looked away, pained.</p>\n<p>“Hurry up!” someone snapped at Jingyi, who hurriedly returned his gaze to the story.</p>\n<p>\n<strong> <em>“Oh Lan Zhan, my heart can't take it,” Wei Wuxian cried, swooning into Lan Wangji’s arms.”</em> </strong>\n</p>\n<p>“Just what kind of story were you <em>writing?”</em> Jiang Cheng demanded.</p>\n<p>“We were frustrated, Uncle!” Jin Ling said, his cheeks red. “They’re so annoying!”</p>\n<p>“Of course they’re annoying,” Jiang Cheng snapped. “I find them annoying, a lot of people find them annoying, but we don’t end up going and writing stories about them!” </p>\n<p>“Sect Leader Jiang,” Lan Xichen said, his voice nearly pleading, “Just let them finish.” He was silently dreading the moment his own role would be announced.</p>\n<p>Wei Wuxian, now in Lan Wangji’s arms, thought that the Juniors would be punished very severely for this. He couldn’t help but feel bad for his poor little A-Yuan, who had obviously been dragged into this mess.</p>\n<p>(Little did he know that Lan Sizhui, frustrated at his parents not finally getting their act together and just marrying each other already, had come up for the idea for the very first story).</p>\n<p>Still though, it was kind of nice to have Lan Wangji’s arms around him, even if the other man literally had no choice in the matter. Lan Wangji had very nice eyes, and very nice arms, and a very nice everything.</p>\n<p>Maybe he should thank the Juniors after all…</p>\n<p>“How about I just — read some of this, and then everyone can act it out?” Lan Jingyi suggested. “To make that easier?” </p>\n<p>Everyone stared at him balefully. Jingyi swallowed, and stared down desperately at the sheet of paper in his hands.</p>\n<p>\n<em> <strong>“Wei Wuxian was busy being lost in Lan Wangji’s smouldering eyes. “Lan Zhan,” he said, “why did you never tell me you loved me?”</strong> </em>\n</p>\n<p>\n<em> <strong>“Because I am so oblivious and bad at this,” Hanguang-Jun said, sounding apologetic. </strong> </em>\n</p>\n<p>\n<em> <strong>“Oh Lan Zhan, so am I!”</strong> </em>\n</p>\n<p>\n<em> <strong>“Wei Wuxian and Hanguang-Jun stared lovingly at each other for a moment, their arms wrapped around each other, their bodies pressed close.”</strong> </em>\n</p>\n<p>There was a very awkward silence.</p>\n<p>“…Jin Ling wrote Hanguang-Jun’s line,” Jingyi said, very pointedly not looking in Lan Wangji’s direction. </p>\n<p>“It was a good line!” Jin Ling yelled back, furious. “You wrote that stupid line about his smouldering eyes!”</p>\n<p>“I did <em>not</em>, that was Sizhui’s idea!”</p>\n<p>“Hey!”</p>\n<p>“Just say what you need to say,” Lan Qiren snapped. He was obviously trying very hard not to completely lash out, or perhaps pass out and pretend that none of this was happening.</p>\n<p>Everyone else simply stared forward, feeling as if they shouldn’t be in the room right now.</p>\n<p>Wei Wuxian huffed. “Lan Zhan,” he said, “why did you never tell me you loved me?” He ignored the little twinge as he spoke those words, because if <em>only</em> Lan Wangji felt that way. </p>\n<p>“Love Wei Ying,” Lan Wangji said, his arms tightening around Wei Wuxian.</p>\n<p>Wei Wuxian let out a small sigh, moving closer. “Lan Zhan, that’s the wrong line,” he murmured, relishing their closeness.</p>\n<p>Lan Wangji stared, and then, very slowly and precisely, he said, “Because I am so oblivious. And bad at this.”</p>\n<p>It was obviously the last thing he would ever choose to say himself, and Wei Wuxian decided that Jin Ling was obviously a terrible writer.</p>\n<p>“Oh Lan Zhan, so am I!”</p>\n<p>“Now stare lovingly at each other for a moment,” Ouyang Zizhen called out, ignoring the furious look his father shot him. Wei Wuxian was far too happy to comply.</p>\n<p>Ahh, if only it could really be like this.</p>\n<p>“Has it been a moment yet?” Lan Qiren snapped, turning to Jingyi. “You — hurry up, finish the rest of this madness.”</p>\n<p>“Okay, yeah,” Jingyi agreed. “So — this next part is where the, uh, others come in.” </p>\n<p><em>‘Oh,’</em> Lan Sizhui thought, dazedly, <em>‘They’re really going to kill us.’</em></p>\n<p>\n<strong> <em>“Wei Wuxian!” Sect Leader Yao, who had been standing nearby after Wei Wuxian had dramatically saved him from the sentient corpse of Jin Guangyao, cried — ”</em> </strong>\n</p>\n<p>A number of incredulous looks were directed at Lan Jingyi. </p>\n<p>\n<em> <strong>“ — Please accept my sincerest apologies! I was just jealous of your talent and intelligence and good looks.”</strong></em>\n</p>\n<p>\n<strong> <em>“So was I!” Sect Leader Ouyang cried. “I’m unfortunately reminded of my old age every day when I look at my strong, talented, youthful son Zizhen!”</em> </strong>\n</p>\n<p>“Zizhen!” Sect Leader Ouyang roared.</p>\n<p>“I didn’t write that!” Ouyang Zizhen protested.</p>\n<p>“Then who did?!” Jin Ling shot back. “You definitely wrote it!”</p>\n<p>Ouyang Zizhen shot him a betrayed look.</p>\n<p>“I refuse to say any of that!” Sect Leader Ouyang declared firmly. “I have more dignity than that!”</p>\n<p>“You’ll cease to exist if you don’t,” Nie Huaisang pointed out.</p>\n<p>“Then let me die with honour!”</p>\n<p>“What honour?” Jiang Cheng said with a snort. “Just shut up and say what you need to say, so that we can all move on from this.”</p>\n<p>Neither he nor Sect Leader Yao moved. </p>\n<p>“Oh for — <em>do it now.”</em> Zidian sparked. Sect Leader Yao took a step back, an alarmed look in his eyes.</p>\n<p>“Sect Leader Jiang!” he cried, appalled. “You simply cannot — ” Seeing the annoyed looks he was receiving from the majority of the room, all of whom really just wanted to be done with this, he let out a frustrated huff.</p>\n<p>“Fine! But I absolutely <em>do not</em> agree with any of these words!” He took a deep breath, and looked like a man on death row. “Wei Wuxian, please accept…my sincere apologies,” he ground out. “I was just…I was just <em>jealous</em> of your — intelligence.”</p>\n<p>“And good looks,” Ouyang Zizhen supplied.</p>\n<p>“And good looks,” he spat.</p>\n<p>Sect Leader Ouyang didn’t move for a long moment. When he did, he shot his son the most withering stare he could muster as he spoke. “So was I. I am unfortunately reminded of my old age everyday when I look at my <em>strong, talented, youthful son Zizhen.”</em> There was a look in his eye that promised immense pain, that only seemed to grow with every word he spoke.</p>\n<p>Ouyang Zizhen swallowed nervously, and wondered if he could convince Hanguang-Jun to let him deflect to the Lan Sect.</p>\n<p><strong><em>“Wei Wuxian, as kind and generous as he was, did not tell them to fuck off,”</em></strong> Jingyi read.</p>\n<p>“This is appalling!” Sect Leader Yao snapped. “This — this is a blatant insult! These children have attacked us, threatened our lives — ”</p>\n<p>“Oh, shut up,” Jiang Cheng snapped, coming to his nephew’s defence. As angry as he was at Jin Ling, his punishment would be up to <em>him</em>, not anyone else. “Threatened you? Attacked you? This is merely child play. You — ” He pointed at Jingyi, who looked up in panic, “Hurry up already!”</p>\n<p>Jingyi nodded quickly. <strong><em>“Wei Wuxian,” Jiang Wanyin said, his eyes shining with more emotion than he had ever displayed from the moment his life had so cruelly ruined, and had only ever been displayed around his beloved nephew, who he valued so dearly, “Brother, I am sorry! I have missed you! Forgive this didi of yours, who only wants to be held in the arms of his brother once more!”</em></strong></p>\n<p>There was a moment of dead silence. Jiang Cheng was frozen.</p>\n<p>\n<strong> <em>“A tear ran down his cheek.”</em> </strong>\n</p>\n<p>“YOU!” Jiang Cheng roared, surging forward. Jingyi let out an alarmed yelp, and jumped backwards.</p>\n<p>“Uncle, no!” Jin Ling cried, hurrying over. </p>\n<p>“Jin Ling wrote that line!”</p>\n<p>“Wha — <em>you!</em> I was defending you!”</p>\n<p>“Defending me from your own mistake!”</p>\n<p>“Sect Leader Jiang, we apologise greatly for our mistake,” Sizhui said, his face pale. “However, we — we really do need to need to finish this.”</p>\n<p>For a moment Jiang Cheng remained perfectly still, his chest moving slowly. Wei Wuxian had untangled himself from Lan Wangji’s embrace by this was point, and was watching his brother with a mix of curiosity and apprehension.</p>\n<p>Jiang Cheng stormed forward, heading straight for a terrified Jingyi. When he was right in front of him, he reached out, snatching the paper straight out of Jingyi’s hands.</p>\n<p>“Don’t destroy it!” Sizhui cried in panic.</p>\n<p>Jiang Cheng shot him a withering glance. “If I’m supposed to remember <em>any</em> of that garbage, I’m going to need to read off this.” </p>\n<p>He then walked up to Wei Wuxian, and stood in front of him, meeting his eyes straight ahead. On his face was the most terrifying expression anyone had ever seen.</p>\n<p>“Wei Wuxian,” he said, the words sounding like a death threat. “Brother, I am sorry. I have missed you. Forgive this Didi of yours, who only wants to be held in the arms of his brother once more.”</p>\n<p>The room was dead silent, as everyone waited for Jiang Cheng to attempt to kill Wei Wuxian. </p>\n<p>Instead, he reared back, and slapped himself across the cheek, close to his eye. A tear ran down his cheek.</p>\n<p>“There,” he snapped, while everyone gawked at him, “it’s done. It’s fucking <em>done.”</em></p>\n<p>He glanced down at the sheet of paper, grimaced, and thrust it at Wei Wuxian. “You deal with this.”</p>\n<p>Wei Wuxian glanced down, reading the words. When he looked up again, there was almost a teasing look on his face.</p>\n<p>“Oh, Jiang Cheng!” He said, running forward, and throwing his arms around a furious Jiang Cheng. “Brother, there is nothing to forgive!”</p>\n<p>Jiang Cheng clenched his teeth, wished death upon everyone, and hugged back.</p>\n<p>Lan Qiren, weary and exhausted, snatched the paper from Wei Wuxian's loose grip, and thrust the story back at Jingyi. “Read,” he said.</p>\n<p>Jingyi complied.</p>\n<p>\n<strong> <em>“They held each other close, once again united, as the rest of the room wept at the sheet emotion of it all.</em> </strong>\n</p>\n<p>\n<strong> <em>Hanguang-Jun and Wei Wuxian then started kissing passionately, while everyone else watched on, and wished that it were them.”</em> </strong>\n</p>\n<p>By now, no one was even surprised that the Juniors apparently had very twisted minds.</p>\n<p>“What?!” Wei Wuxian cried, pushing Jiang Cheng away. “I can’t do that!”</p>\n<p>Lan Wangji had gone almost painfully still, his eyes glued to Wei Wuxian.</p>\n<p>“Wait until they get to the wedding part at the end,” Ouyang Zizhen murmured to Jin Ling, who seemed to be questioning his life choices.</p>\n<p>“I’m not doing that,” Wei Wuxian said firmly. “Lan Zhan doesn’t — I’m not going to force him to kiss me!”</p>\n<p>“Not force,” Lan Wangji said.</p>\n<p>“Lan Zhan! I’m not doing that to you! I know we don’t have a choice now, but — it’s not fair to you.”</p>\n<p>Lan Wangji walked forward, and took Wei Wuxian’s hand in his. </p>\n<p>Jingyi leaned towards Sizhui. “That’s not in the story,” he murmured.</p>\n<p>Sizhui winced.</p>\n<p>“Not force,” Lan Wangji said again, his voice firm. “Wei Ying I…”</p>\n<p>Wei Wuxian’s shoulders slumped. “Oh, I know,” he sighed. “We don’t have a choice, those damned Juniors have left us with no choice.”</p>\n<p>Those ‘damned juniors’ couldn’t help but lean forward curiously when Wei Wuxian quickly leaned forward on the tips of his toes, and gave Lan Wangji what was possibly the quickest peck on the lips ever.</p>\n<p>“There,” Wei Wuxian said, leaning back quickly with a pained smile on his lips. “All done, Lan Zhan.”</p>\n<p>Lan Wangji’s brow furrowed slightly.</p>\n<p>“Uh, it was supposed to be a <em>passionate</em> kiss,” Ouyang Zizhen interjected. He swallowed heavily when Lan Wangji shot him a flat look, and quickly amended, “But I suppose passion can mean a lot of different things to different people…”</p>\n<p>“I’m sorry, Lan Zhan,” Wei Wuxian said quietly.</p>\n<p>The Juniors stared at the two of them, feeling waves of disappointment. <em>Surely</em> they weren’t still this oblivious? </p>\n<p>“Is that all?” Lan Qiren demanded. He glanced at his wrist, and grimaced when he saw he mark was still there, albeit a lot paler now that most of the task had been fulfilled. </p>\n<p>Jingyi returned his attention to the page, and finished off the final parts of the story.</p>\n<p>\n<strong> <em>“I was so wrong about him,” Lan Qiren said, eyes shining with regret. “Wei Wuxian, from this day onwards you shall call me Uncle!”</em> </strong>\n</p>\n<p>Lan Qiren remained very still. Lan Xichen shot him a concerned look.</p>\n<p>“I — no.”</p>\n<p>“Uncle, you must,” Lan Xichen murmured, regretfully. </p>\n<p>“Xichen,<em> no!”</em></p>\n<p>“Uncle — “</p>\n<p>“They are both disowned!” He roared, pointing furiously at Jingyi and Sizhui. The Juniors stared back miserably.</p>\n<p>Lan Xichen stared at his uncle, unrelenting, and Lan Qiren let out a shout of distress. <em>“Fine!</em> I was so wrong about him! Wei Wuxian,” he spat, “from this day onwards, <em>you shall call me Uncle.”</em></p>\n<p>Wei Wuxian grimaced, edged closer to Lan Wangji, and decided that he definitely wasn’t calling him uncle.</p>\n<p><strong><em>“Wangji,”</em></strong> Jingyi read, his voice moving at a rapid pace to finish the story of quickly,<strong><em> “Brother is so happy for you!” Zewu-Jun cried out, and hugged him. Jiang Wanyin also joined in, and then Lan Qiren, and it was one big, happy group hug.”</em></strong></p>\n<p>With loathing in the eyes of some (Lan Qiren and Jiang Cheng), exhaustion in the eyes of others (Lan Xichen) and just plain frustration in the eyes of Wei Wuxian, who would very much like this to be over by this point, they all joined in the most unhappy group hug anyone had ever seen.</p>\n<p>They moved apart as quickly as possible, with Lan Qiren pushing himself away from the others almost immediately.</p>\n<p>“Is it done?” someone called out, glancing frantically at their arm. The mark remained.</p>\n<p>Jingyi glanced down at the last line of the story, and paled.</p>\n<p>“Jingyi.” Lan Jingyi glanced up, and felt his nerves spike when he saw Lan Wangji staring straight at him. “Finish the rest of what you have written.”</p>\n<p>Jingyi swallowed. “Uh, you know it wasn’t just me, right? It was also Sizhui, and Jin Ling, and — ”</p>\n<p>“Finish it.”</p>\n<p>“Right,” Jingyi said hurriedly, “Right, yes, I — uh, Sizhui, would you like to read the last — no? No, no, I’ll definitely read it…” He took a deep breath, and prepared himself for his own down fall.</p>\n<p>\n<strong> <em>“And then everyone went to the Ancestral Hall, and Hanguang-Jun and Wei Wuxian completed their bows and got married.”</em> </strong>\n</p>\n<p>Silence.</p>\n<p>“Yeah, no,” Wei Wuxian said flatly. “You can do a lot of things, but you <em>cannot</em> force Lan Zhan to marry someone he doesn’t want to marry.”</p>\n<p>Lan Wangji frowned.</p>\n<p>“Wei Wuxian!” Sect Leader Ouyang roared. “How despicable are you?! We each have to play our part in fixing the mess that these foolish children have started! I have suffered my part, and now you must do the same.”</p>\n<p>“Father, you spoke one line,” Ouyang Zizhen pointed out.</p>\n<p>\n<em>“Zizhen!”</em>\n</p>\n<p>“I’m not forcing Lan Zhan to marry me,” Wei Wuxian said firmly. “It’s not happening.”</p>\n<p>“It is certainly not happening!” Lan Qiren agreed firmly.</p>\n<p>“Uncle,” Lan Xichen said reproachfully.</p>\n<p>Lan Wangji remained unmoving for a moment, his eyes glued on Wei Wuxian, who seemed to be doing everything he could do avoid his gaze. Then, he was moving forward, a determined spark in his eyes, that was lost on everyone who wasn’t Lan Xichen.</p>\n<p><em>‘Oh, little brother,’</em> Lan Xichen thought, <em>‘Good luck.’ </em></p>\n<p>“Wei Ying is not forcing me,” Lan Wangji said firmly. </p>\n<p>“Of course not, Lan Zhan,” Wei Wuxian agreed distractedly. “That stupid scroll is forcing you to do this.”</p>\n<p>“Cannot be forced to do something I want to do.”</p>\n<p>There was a long pause. Wei Wuxian turned slowly to Lan Wangji, while everyone else gawked. </p>\n<p>“Is that in the story?” Jingyi murmured to Sizhui, who shook his head distractedly, his eyes glued to his parents.</p>\n<p>“What did you say?” Wei Wuxian asked Lan Wangji.</p>\n<p>“Wei Ying cannot force me. I…” Lan Wangji hesitated. “I would not want to force Wei Ying.”</p>\n<p>“Force me to marry you?”</p>\n<p>“Yes.”</p>\n<p>“You…” Wei Wuxian swallowed, and sounded almost shy when he continued. “You can’t force me, Lan Zhan. I do…well, I guess…” He shifted nervously. “I <em>like</em> you.”</p>\n<p>Lan Wangji nodded. “Mn. Like Wei Ying too.”</p>\n<p>“Not as a friend!” Wei Wuxian added, a little hurriedly. “I…<em>fancy</em> you. I want you. I whatever you, I guess, and — a lot of other things too. Which is why I am not going to force you to do something you really don’t want to do, just because some dumb cursed scroll might kill us if we don’t.”</p>\n<p><em>“I</em> do not want to die,” Sect Leader Yao snapped.</p>\n<p><em>“You</em> will shut up,” Jiang Cheng retorted, his voice threatening. </p>\n<p>Lan Wangji was frozen in his place. “Wei Ying,” he said, “Want you. Fancy you. It cannot be <em>anyone</em> but you.”</p>\n<p>Wei Wuxian watched him, his eyes wide.</p>\n<p>“I have loved Wei Ying for a very long time.”</p>\n<p>“Lan <em>Zhan!”</em> Wei Wuxian cried, darting forward, straight into Lan Wangji’s arms. Lan Wangji curled his arms around him, holding him close.</p>\n<p>The rest of the room watched in mortified silence. </p>\n<p>The Juniors silently cheered them on.</p>\n<p>“Lan Zhan, Lan Zhan, it’s really too early to get married, isn’t it? I don’t want to rush you into anything!”</p>\n<p>“Have waited for Wei Ying for over twenty years.”</p>\n<p>“Oh Lan Zhan, how is my heart supposed to take this?” </p>\n<p>“Will take care of Wei Ying’s heart.”</p>\n<p>Wei Wuxian let out a muffled scream, burying his face against Lan Wangji’s shoulder.</p>\n<p>Sizhui blanched and looked away. Jingyi watched on, wondering just how things had escalated this quickly. Surely, they might want to take things a bit slower, maybe court each other first…</p>\n<p>Then again, like Lan Wangji had said, he’d been waiting a <em>long</em> time.</p>\n<p>“Perhaps we should go to the ancestral hall then,” Lan Xichen suggested, sounding somewhat pleased as he eyed his brother and his soon-to-be-brother-in-law. After all, regardless of the current circumstances, Lan Xichen would always be the number one advocate for his brother’s happiness.</p>\n<p>“Xichen, no,” Lan Qiren pleaded.</p>\n<p>Lan Xichen ignored him.</p>\n<p>Wei Wuxian pulled away slightly, his eyes wide, his face flushed. \"Lan Zhan, are you <em>sure?\"</em> he asked. \"Are you absolutely sure? Because - I really couldn't take it if you changed your mind...\"</p>\n<p>\"Will never change my mind,\" Lan Wangji said, his voice firm. Then, he was leaning forward, capturing Wei Wuxian's lips with his own.</p>\n<p>This time, the kiss lasted much longer.</p>\n<p>A short while later, everyone looked various degrees of murderous and desperately frustrated, except for Lan Wangji and Wei Wuxian of course, who looked like they were in their own personal heavens. They all trudged over to the Lan Ancestral Hall, all unwilling guests at the Yiling Patriarch’s wedding.</p>\n<p>Many did not want to be there. None of them were willing to leave until the issue of the scroll had been sorted out.</p>\n<p>After the Yiling Patriarch and Hanguang-Jun had been blissfuly wedded, and the curse marks had faded from everyone’s arms, the Juniors decided to get the hell out of there before there were any attempts on their lives.</p>\n<p>(Jiang Cheng had glowered at Wei Wuxian the entire way through, and had absolutely <em>not</em> been secretly pleased that he was attending his brother’s wedding).</p>\n<p>“We should burn the other stories,” Jin Ling suggested, as they hurried back to the safety of the disciple’s quarters. </p>\n<p>“Or at least find a better hiding place for them,” Ouyang Zizhen added.</p>\n<p>Well, at least their mess had bore some positive results. They couldn’t have written that confession better themselves.</p>\n<p>(Later Lan Wangji would tell them to pay better attention to what they were writing on in the future, and pay closer attention to <em>what</em> they were writing. Also, they would all need to write out the Sect rules numerous times.</p>\n<p>Wei Wuxian clung onto his husband’s arm the whole time, beaming widely).</p>"
}