{
  "id": "23647384",
  "url": "https://archiveofourown.org/works/23647384?view_full_work=true",
  "author": [
    "sospes"
  ],
  "title": "The Path Not Taken",
  "rating": "Mature",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Wiedźmin | The Witcher - All Media Types",
    "The Witcher (TV)"
  ],
  "relationships": [
    "Geralt z Rivii | Geralt of Rivia/Jaskier | Dandelion",
    "Eskel & Jaskier | Dandelion",
    "Jaskier | Dandelion/Original Male Character(s)",
    "Jaskier | Dandelion/Lambert"
  ],
  "characters": [
    "Jaskier | Dandelion",
    "Eskel (The Witcher)",
    "Vesemir (The Witcher)",
    "Lambert (The Witcher)",
    "Coën (The Witcher)",
    "Geralt z Rivii | Geralt of Rivia",
    "Cirilla Fiona Elen Riannon"
  ],
  "additional_tags": [
    "Pining",
    "Attempted Kidnapping",
    "Competent Jaskier | Dandelion",
    "Slow Burn",
    "Injury",
    "Canon-Typical Violence",
    "Angst",
    "Geralt z Rivii | Geralt of Rivia is Bad at Feelings",
    "Casual Sex",
    "Geralt z Rivii | Geralt of Rivia is Bad at Communicating",
    "Idiots in Love",
    "Extraordinarily Bad Miscommunication",
    "Hurt/Comfort",
    "Explicit Sexual Content",
    "baths",
    "Found Family"
  ],
  "language": "English",
  "series": "Part 1 of The Path Not Taken",
  "published": "2020-04-14",
  "completed": "2020-04-20",
  "words": "40,149",
  "chapters": "5/5",
  "comments": "1,688",
  "kudos": "10,812",
  "bookmarks": "2,367",
  "hits": "118,191",
  "summary": "<p>Jaskier comes across an injured witcher in a backwoods town, months after the events of the dragon hunt. It all just sort of escalates from there.</p>",
  "notes": "<p>This started out as a one-shot, which then evolved into a post-<i>Rare Species</i> fic, <strike>which then turned into a sort of allusive Callimachean fix-it for one of my other fics lol</strike>, which now seems to be going down the route of... weird witcher romcom? </p>\n<p>Keep an eye on the tags/rating for future chapters!</p>\n<p>I am really enjoying writing this daft little fic, and I'm so glad that you all seem to be enjoying it, too!</p>\n<p>I originally said that this fic was going to be four chapters long, but it turns out I misjudged that slightly - there will be five! I guess that could be a good thing, depending on how you look at it...</p>\n<p>I've just been blown away by all the support I've had on this fic! I literally can't stop writing it because I'm enjoying it so much - so I'm really glad that other people are enjoying it, too! </p>\n<p> </p>\n<p> <strike>And I finally get to crack out my favourite \"Idiots In Love\" tag, excellent!</strike></p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">notes</a>.)\n</p>\n<p>I want to say a massive thanks to everyone who's read, kudosed, bookmarked, and commented! The response has been wonderful, and I'm so grateful. I've enjoyed writing this fic so, so much (evidenced by the fact that I've churned out 40K words in like ten days, whoops), and I found it so difficult to end that I'm very tempted to write more...</p>",
  "text": "<p>“Have you seen that witcher today?” </p>\n<p>Jaskier stops dead in the middle of the street, hand flexing uncomfortably around the strap of his lute case. The marketplace of this out-of-the-way little town is busy enough that his eavesdropping isn’t obvious, but at the same time he doesn’t want to particularly be caught staring at the admittedly very buxom local woman whose gossip he’s just overheard. There are more than enough big, burly men around here who could snap him in half without even thinking about it if he pisses them off, and ogling their wife, girlfriend, sister, daughter, mother, whoever is always a bad way to go. </p>\n<p>“The one who took the contract down by the Saliman farm?” the buxom woman’s friend asks, as Jaskier pretends to be interested in a display of beetroot. “Saw him in the tavern yesterday evening. Barti tried to pick a fight with him, but the Saliman boy stopped it before it started, said he wanted to talk to him.” She shrugs, running her fingers over a bolt of rough linen. “They left soon after.” </p>\n<p>The buxom woman frowns. “He’s not come back yet,” she says, passing a couple of coins over to the stallholder and accepting a length of pale green ribbon in return – and all of a sudden, Jaskier’s mouth is dry. </p>\n<p>Her friend snorts out a laugh. “You worrying about a <i>witcher</i>, Maria?” </p>\n<p>“Not <i>worrying</i>,” Maria answers defensively, tucking the ribbon away in the satchel slung over her shoulder. “Just… wondering.” </p>\n<p>“I’ll have four yards of this,” her friend says to the stallholder, then turns back to Maria, eyebrow raised. For some reason, there’s a golden beetroot in Jaskier’s hand and the greengrocer is staring at him suspiciously. He puts the beetroot back down, and moves on to the furrier next door. “Be honest with me,” Maria’s friend is saying, a lick of humour creeping into her voice. “You just want him to come back so you can shove your tits in his face again.” </p>\n<p>“<i>Jessa</i>,” Maria hisses. </p>\n<p>Jessa snorts. “Come on, Maria, I saw the way you were looking at him,” she teases. “And I don’t blame you. If I didn’t have Barti, well, I’d be doing the same thing. Those <i>muscles</i>, those <i>thighs</i>.” </p>\n<p>“It’s the eyes,” Maria sighs. “Those golden eyes, oh, Jessa, the things I want those eyes to watch me do…” </p>\n<p>Jessa laughs, and pays for her purchased linen. “Mores the pity,” she says, “given that he’s probably not coming back.” </p>\n<p>Jaskier’s fingers freeze, fingertips caressing a mink that’s probably worth more than his entire outfit – and this is one of his better ones, too. The furrier is watching him out of the corner of one eye, but he’s not yet as suspicious as the greengrocer so Jaskier keeps up the pretence. </p>\n<p>Maria’s frowning. “Is that what you think?” </p>\n<p>Jessa shrugs. “I think that if he’d come back, we’d know,” she says. “Barti would have tried to slit his throat, or something equally idiotic. Given that my idiot husband <i>isn’t</i> currently on his arse in a pile of horseshit, the witcher hasn’t come back. And if he’s not back by now, he’s probably not coming back.” Jaskier’s heart thuds so loud in his chest for a second that he struggles to catch his breath. “He’ll be dead in a ditch somewhere – that’s how witchers usually end their lives, isn’t it? It’s a waste of a good pair of delightfully thick thighs, but it’s to be expected.” </p>\n<p>“<i>Bard</i>.” </p>\n<p>Jaskier jumps, his fingers spasming tight around the mink. </p>\n<p>The furrier is looking at him, one eyebrow raised. “You buying that?” he asks, sounding distinctly unimpressed. </p>\n<p>“Ah, no,” Jaskier says, carefully detaching himself from the ridiculously expensive fur. He pats it delicately, smoothes it out, flashes the furrier as much of a smile as he can manage – but by the time he turns back to the market, the two women are nowhere to be seen. “<i>Shit</i>,” he spits, because sure, okay, he knows there are other witchers in the world, knows that it’s not necessarily Geralt, knows that, well, Geralt probably wouldn’t want to see him even if it was him – but at the same time, what if he walks away and Geralt of fucking Rivia is <i>actually</i> dying in a ditch in this poxy backwater? “Shit,” Jaskier swears again, hoists his lute higher on his shoulder, and goes to find out where exactly the Saliman farm is. </p>\n<p>He only has to ask a handful of townspeople before a gruff farmhand points him in the right direction, not without a growled warning about generic monsters and mayhem. Jaskier just nods and smiles, trying to distance himself from this conversation as quickly as he can, then sets off at a brisk walk down the track that leads out to the farm. A brisk walk which becomes a slow jog as the track starts to wind through scraggy woodland, which rapidly turns into a flat-out run when he rounds a final bend in the track and sees what can only be described as pure carnage laid out in front of him. </p>\n<p>“Shit, fuck, <i>bollocks</i>,” Jaskier mutters frantically under his breath, boots slipping on the muddy cart-track, because the building that he’s guessing was once the Saliman farm is in utter ruins, crushed and destroyed beneath the razor claws and lashing wings of two huge wyverns. He can see the beasts’ corpses draped over the ruins of the farmhouse, see their blood splattered across the bricks and mortar – and there, in front of the destroyed building, head and shoulders hidden by the sharp, venomous end of one of the wyvern’s tails, is a body. </p>\n<p>For a second, Jaskier thinks he might vomit. </p>\n<p>He runs as fast as he can towards the devastation, lute case bumping painfully against his back, and all he can imagine is Geralt’s face, slack in death, golden eyes half-lidded, silver-white hair stained with blood and dirt. It hurts worse than any words spoken in anger on the top of a mountain, and there are tears pricking his foolish eyes already, stinging at the back of his throat, spurring him onwards so faster that he almost runs straight into the horse that he hadn’t even fucking <i>noticed</i>, the horse that’s nosing around the bloody grass a few metres away from the witcher’s body.</p>\n<p>The horse that <i>isn’t Roach</i>. </p>\n<p>Jaskier comes skidding to a halt, heels slipping in the gravel, and goes to his knees next to the witcher who isn’t Geralt. “Thank fuck,” he mutters, shrugging his pack and his lute to the ground, then leans forward over the sluggishly-oozing rent in the witcher’s stomach. “Well, that’s not good, is it?” he says, heart still racing, then looks up at the witcher’s face, dark hair, thick scars running down one cheek. “So you don’t all have weird white hair,” he says, falsely cheery, then reaches up, feels for a pulse. It’s weak but it’s there, and he sighs, turns his attention back to the gaping wound. “Took on a bit too much there, didn’t you?” he asks, peeling back the layers of the witcher’s clothes to expose his wound a little more. “Oh, that’s <i>nasty</i>,” he says. “It’s from that lovely beastie’s tail, isn’t it? I remember Geralt getting hit by one a few years ago, took him a couple of days to recover. Lucky for you I was in the area!” The witcher, understandably, doesn’t respond. Blood loss, poison, exhaustion – he’s pretty solidly unconscious. “Right,” Jaskier says brightly. “Where are your potions, my friend? Ah, I’m guessing you’re like Geralt and you keep everything with your horse.” </p>\n<p>The witcher doesn’t answer, but Jaskier goes to fetch the horse anyway.</p>\n<p>He brings the grey gelding closer, lashes its reins to the splintered remains of a tree, then starts searching through its saddlebags. “I’m glad you’re more willing to play with strangers than Roach is,” he says to the gelding, running a soft touch down its nose. “She would have bitten my hand off by now. Ah hah!” He pulls out a secure leather pouch that clanks with the soft noise of vials bumping against one another, then goes back to the witcher’s side, retrieves his own waterskin and rummages around in the leather pouch. “Right,” he says, talking to the unconscious witcher and the grey gelding as much as to himself. “It’s a wyvern, so you’ve been poisoned. I wrote a song about a wyvern once, <i>The Lay of the Dragon’s Tail</i> – well, I made it into a dragon, sounds more intimidating to lay folk. And poison means you need… this one!” He shuffles up to the witcher’s head, tilts his head back, opens his mouth with his thumb and drips the potion slowly between his lips. “Come on, I’m going to need you to drink it,” he says softly, running a comforting hand through the witcher’s hair – and, much to his delight, the witcher’s throat slowly bobs as instinct makes him swallow. </p>\n<p>“<i>Brilliant!</i>” Jaskier says. “We might make it through this after all, my dear witcher. Right, this wound.” He winces, grabs his waterskin. “This is going to hurt,” he says apologetically. “Just… stay unconscious, yeah?” He pours the water over the wound, flooding out as much of the blood and dirt as he can, then goes back into the witcher’s leather pouch. He finds a potion he recognises as an antiseptic, uncorks it, grimaces up at the witcher, says, “Sorry”, and pours the foaming liquid over the gash in his stomach. </p>\n<p>The witcher jolts upright with a cry, eyes as golden-bright as Geralt’s. He casts around himself wildly, hands scrabbling at the dirt, clearly maddened by the pain, and then he catches sight of Jaskier, frozen at his side. His pupils narrow into slits in an instant and he grabs Jaskier’s wrist with all his witcher strength, spits, “Who—”, but then clearly the pain gets too much and he slumps back down to the ground, breathing hard. </p>\n<p>“It’s okay,” Jaskier says, as calmly as the pain in his wrist allows, valiantly—and pointlessly, of course—trying to pry those fingers off himself. “I’m a friend, you can trust me. You’re badly hurt, and I’m going to need my hand back so I can help you, okay?” </p>\n<p>The witcher’s eyes are fixed on him, forehead furrowed, teeth bared – and then Jaskier sees his nostrils flare, sees him scent the air. Confusion flickers across the witcher’s expression, but before Jaskier can give too much thought to it, his eyes roll back in his head and he passes out again. </p>\n<p>“One way to solve <i>that</i> problem,” Jaskier mutters, slipping his wrist free of the witcher’s fingers. He eyes the wound, still foaming with antiseptic, then says, “Right. Where’s your needle and thread? I’ll have to sew this up.” At predictable lack of an answer, Jaskier gets to his feet, goes to rummage in the witcher’s saddlebags again until he unearths a small medical kit: needles, thread, bandages, all the basics. “Excellent,” he says, settling himself back down on the ground, then eyes the witcher’s slack face again. “I’m going to ask very politely that you don’t wake up in the middle of this and break my neck.” He waits for a beat, then shrugs into the silence. “Alright then, I’ll take that as a promise, my friend.” </p>\n<p>It takes him half an hour or so to sew up the wound, thanking whatever gods might be listening under his breath every time he knots off a stitch without getting a witcher’s fist to the side of his head. He washes his hands when he’s done, then rinses as much blood and gore off the closed wound as he can. He’s got a pot of healing salve in his own pack that he fishes out and smears across the ragged edges, then retrieves the witcher’s bandages and pauses for a second, looking between the clean fabric and the wound. “I’d love to wrap this around you,” he says slowly, “but you’re looking pretty heavy, my friend, and I’m not really strong enough to manhandle you.” He puts the bandages back. “We’ll try that when you’re conscious, yeah?” He waits for an answer he knows isn’t coming, then nods sagely. “Glad you agree. I think we’re going to get along just fine.”</p>\n<p>The witcher just lies there, breathing slow, heartbeat even slower. </p>\n<p>It was already midafternoon when Jaskier left town to go witcher-hunting, and the sun is rapidly sliding down the horizon. The wyvern carcasses are also starting to smell distinctly unpleasant, so Jaskier figures he should probably try to find them some shelter a little further away. Once he’s fairly confident the strange witcher isn’t going to die the moment he turns his back, he manages to find a small outhouse that’s not completely destroyed – it’s sheltered from the elements, with most of its roof left and even a couple of bales of hay for the witcher’s horse. “Perfect,” he says to himself, and deposits his lute case and pack by the entrance. “Now I just need to get him all the way from over there… to in here…” Jaskier props his hands on his hips and clicks his tongue against his teeth. “This could prove problematic.” </p>\n<p>In the end, it’s actually not so bad. He obviously can’t actually move the witcher by himself, because, much like Geralt, the man is pretty much wholly dense muscle and therefore weighs an absolute tonne. Jaskier, though, was never daunted by a challenge, and before long he rigs up a passable litter with a couple of straight-ish branches and a blanket out of the witcher’s saddlebags. He manoeuvres the witcher onto the litter with only a moderate amount of heaving and cursing, then lashes the litter to the gelding’s saddle and slowly¬—<i>very slowly</i>—walks the horse over towards the outhouse. </p>\n<p>The witcher twitches and even groans a couple of times as the makeshift litter bumps over the uneven ground, but the wound stays closed and he doesn’t wake, so Jaskier isn’t too worried. He manages to get him into the little outhouse before it’s fully dark, then he plumps a couple of handfuls of hay down in front of the gelding and goes back out to the destroyed farmhouse with the last of the light. He’s pretty sure he’s got most of the witcher’s possessions tucked carefully away, his saddlebags, his potions, but the two items that are conspicuous in their absence are his swords.</p>\n<p>Jaskier knows how important Geralt’s swords are, and he’d wager a guess that this strange wounded witcher is much the same. </p>\n<p>He finds the steel sword fairly quickly, bloody and half-hidden under the wyvern’s tail that’s still red and flaking with the witcher’s blood. He takes that back to the outhouse, carrying it with both hands—“Gods,” he mutters, “no wonder these bloody witchers are <i>heavy</i>.”—and then, after a moment’s pause, ventures into the ruins of the farmhouse itself. </p>\n<p>Looking up at the corpse of a twenty-metre wyvern, eye still half-open in death, the sun setting behind its horned head and shadows stretching long and dark beneath its body, Jaskier feels a thrill of fear flood through his gut. “The things I do for witchers,” he says, trying to force himself to be cheerful, then plunges into the fray. The silver sword takes a little while to find, stabbed through the roof of the wyvern’s mouth and into its brain, and even longer to retrieve – turns out that those witcher muscles are <i>also</i> useful for pulling blades out of monster skulls. Jaskier gets it out in the end, though, by which time he’s covered in sweat and wyvern gore, and returns to the outhouse just as the sun’s last rays disappear beneath the horizon. </p>\n<p>“Great,” he says to himself, depositing the filthy silver sword next to its twin. “Now I have to start a fire in the dark.” </p>\n<p>The witcher, the ungrateful bastard, doesn’t say anything. </p>\n<p>It’s pitch black outside by the time that Jaskier manages to get a fire going, delicate little flames licking up around the sweet-smelling hay that he’s having to use for kindling. He blows them carefully until they catch fully, then adds a couple of twigs and finally a chunk of the tree he tied the witcher’s gelding to earlier. The fire is crackling along merrily before long, and Jaskier goes to check on his patient. </p>\n<p>The witcher seems to have settled into a genuine doze, now, instead of unconsciousness induced by blood loss and shock, which is a good sign. The wound in his stomach is already showing signs of closing, thanks to that wonderful witcher healing, and Jaskier lets out a soft sigh. “Looks like you’ll be staying with me in the land of living a little while longer,” he says, and pats the witcher’s shoulder companionably. He pauses for a second, squints, then leans closer – because the witcher’s medallion must have slipped out of his shirt while he was being dragged behind his horse like a sack of potatoes, and now it lies flat and shining against his bloody clothes, glinting in the firelight. </p>\n<p>It’s an exact replica of Geralt’s.</p>\n<p>“Stands to reason,” Jaskier mutters, returning to his own seat on the other side of the fire. “The eyes are the same, too. I bet you know him, don’t you? I bet you’re just… best friends.” His voice breaks, just a little, so he does what he always does and hides his emotions behind bustle and activity, pulling a couple of strips of jerky out of his pack, settling down next to the merrily crackling fire and laying his lute across his lap. He eats quickly, quietly, keeping up a running commentary on the taste of the jerky, the smell of the merchant he bought it from, the discomfort of the uneven ground under him, the warmth of the fire on his face – and it’s weird, he’s finding, because he never feels the need to talk his backside off like this when he’s by himself, and he’s basically by himself right now. Except he’s not, obviously, because there’s a hulking, over-muscled witcher sleeping like the dead on the other side of his fire.</p>\n<p>It’s not like, in his experience, witchers actually give a shit about his conversation, anyway.</p>\n<p>Jaskier tucks the remainder of the jerky away, then strums the strings of his lute and hums softly under his breath. </p>\n<p>He’s in an isolated outhouse, sitting by a fire that’s probably going to attract all the murderers and predators in the surrounding area, next to a destroyed farmhouse that’s draped in the rotting corpses of two wyverns. There’s a catatonic, injured witcher that he’s never met before in his care, breaths soft and heavy in the cooling night air, and all he has to protect himself is a pair of witcher swords that he can’t lift, a small dagger in his boot, and his lute. </p>\n<p>Jaskier lets out a breath, and keeps playing. </p>\n<p> </p>\n<p>He doesn’t sleep that night, and, surprisingly enough, he doesn’t really get tired. It’s probably the adrenaline, probably the fear, but he spends the dark hours feeding the fire, singing under his breath, plucking chords from his lute. He doesn’t sing anything in particular for a while, just experiments with discordances and awkward harmonies, looking for something that he can’t quite put his finger on, but then he slips into older melodies, easier melodies, stories of heroics and heartbreak, tales of epic deeds and star-crossed lovers. </p>\n<p>The songs hurt, of course, but he’s learning to cope with it. </p>\n<p>“You’re Geralt’s bard.” </p>\n<p>Jaskier nearly jumps out of his skin. </p>\n<p>The witcher is awake and watching him, yellow-gold eyes sharply intent, and Jaskier husks, “Fuck! You scared me.” He puts his lute to one side, gaze going to the wound in the witcher’s stomach, then says, “Try not to move too much, yeah? That wound’s healing, but it was pretty bad.” He gets to his feet, moves around the fire, then pushes witcher flat and studies the gash in his stomach. “Gotta love those witcher mutations,” he mutters, seeing that the horrific injury is already starting to knit itself closed, then sits back on his heels, meets the witcher’s gaze, offers him a smile. “My name’s Jaskier,” he says, going back to his side of the fire. “And you are?” </p>\n<p>“Eskel,” the witcher says, then narrows his eyes. “What happened?” </p>\n<p>Jaskier barks a laugh. “You’re the one with the hole in your gut – you tell me!” </p>\n<p>Eskel frowns, looking down at himself. “There were two wyverns,” he says, plucking at the ruined fabric across his stomach. “Tricky, but not impossible – and the Saliman fella agreed to pay double, so I figured, hey, why not? The first one wasn’t so bad, but then my silver sword got stuck in that motherfucker’s skull and the second was… tough. It’s a bit hazy towards the end, but I think the bastard got a stray hit in just as I took it down. I must’ve passed out.” He slumps back down to the hard ground, wincing. “Fucking <i>hell</i>, that hurts.” He glances over at Jaskier, the scars on his face winking in the firelight. “And how exactly did <i>you</i> get involved?” </p>\n<p>Jaskier’s a little dumbstruck, mainly because this witcher is… well, <i>chatty</i>. “Overheard some of the people in the town talking about a witcher who’d gone hunting and hadn’t come back,” he says, mouth oddly dry. “I thought I’d come check it out. Found you, you know, dying.” </p>\n<p>Eskel frowns at him. “You just came trotting after a strange witcher?” he asks, voice scratchy. “Not knowing anything about the contract, or even about who it was you were tracking?” </p>\n<p>“Are you really complaining?” Jaskier asks, raising an eyebrow. “Pretty sure I saved your life.” </p>\n<p>Eskel grunts, fingers hovering hesitantly over his gut. “Yeah, pretty sure you did,” he says, and the gratitude in his voice isn’t grudging, isn’t hesitant, isn’t awkward. “Thanks for that, Jaskier. I appreciate it.” </p>\n<p>Jaskier blinks, momentarily lost for words. </p>\n<p>Eskel stares at him. “You look like I just spat in your face.” </p>\n<p>Jaskier barks a laugh. “No, it’s just…” He trails off, shakes his head. “I’m used to witchers being all grumpy and monosyllabic. And having to drag thanks out of them with a pair of pliers.” </p>\n<p>Eskel laughs. “That’s what you get for spending time with Geralt,” he says. “He might be very good at killing monsters, but he’s not exactly the continent’s greatest conversationalist.” He shifts a little, glances down at himself again. “I’m assuming that I’ve got Geralt to thank for the fact that you’ve patched me up pretty damn neatly?”</p>\n<p>Jaskier snorts. “I like to think that you’ve got me to thank for that,” he says haughtily, “but if you’re asking if it’s because of Geralt that I know what all your potions are, if it’s because of him that I know how to treat a wyvern’s venom, if it’s because of him that I’m a surprisingly dab hand at sewing up gaping holes in witchers’ stomachs?” He deflates a little. “Then yeah, you’d be right.” </p>\n<p>Eskel’s just watching him, firelight casting deep shadows across his pale face.</p>\n<p>Jaskier grabs his pack, finds the remainder of the jerky, passes it over the fire. “You should eat,” he says. “I know you’re a witcher and all that, but you need to keep up your strength.” </p>\n<p>“Thanks,” Eskel says, and takes a bite. He chews for a second, eyeing Jaskier critically, then says, “Want to tell me why you smell like you want to vomit whenever you say my brother’s name?” </p>\n<p>Jaskier’s heart seizes in his chest. “What?” </p>\n<p>Eskel snorts and chews another mouthful. “You know I can hear that your heart just sped up, right?” </p>\n<p>Jaskier feels his cheeks flushing, and he grabs his lute, hauls it into his lap like a barrier. “I think I prefer Geralt’s monosyllabism.” </p>\n<p>“No, you don’t,” Eskel says, tearing another strip of jerky off with his teeth. He studies Jaskier for a moment, the look in those golden eyes as familiar as it is astonishingly alien. “He talks about you, you know,” he says eventually. </p>\n<p>Jaskier’s head flies up. “Geralt does?” </p>\n<p>Eskel nods, swallowing. “I usually only see him during the winters,” he says. “And don’t get me wrong, bard, it’s not like he’s singing your praises from the rafters.” Jaskier laughs shortly at the mental image, plucks a soft chord from the strings of his lute. “But he’s mentioned you, your songs, your company. He seems to appreciate it.” </p>\n<p>Jaskier can’t hold back a disbelieving snort. “Sure,” he mutters under his breath. </p>\n<p>Eskel’s eyes narrow. “What did he do?” </p>\n<p>Jaskier’s lips are tight. “What makes you think that he did something?” </p>\n<p>“Because I’ve known that man longer than you’ve been alive,” Eskel says flatly. “I know he gives a shit about you. But I also know he has a bad habit of being an emotionally-stunted fuckwit when he wants to be.” </p>\n<p>Jaskier gives Eskel an appraising look, his fingers plucking idly at his lute. “Did I just manage to adopt the one witcher who doesn’t understand how to interact with actual people?” he asks, incredulous. “Isn’t that just my luck.” </p>\n<p>Eskel laughs, then winces, his hand flexing into a fist over his stomach. “<i>Ow</i>,” he says. “Fucking wyverns.” </p>\n<p>Jaskier retrieves the blanket from his own pack and gets to his feet. “Sleep,” he says. “Gather your strength. You might be a magic witcher, but you’ve still got a damn hole in your stomach.” He can see the tiredness in the droop of Eskel’s eyelids, and he shakes the blanket out over him, tucks him in like a mother tucking in her child. </p>\n<p>“You gonna heat up a bottle of milk for me, too?” Eskel asks. “Maybe brush my hair?”</p>\n<p>“That costs extra,” Jaskier says, and pats Eskel’s hair firmly. “Go to sleep, witcher.” </p>\n<p>Eskel closes his eyes, settles back into the hard ground. “Thanks, bard,” he says, and is asleep in moments. </p>\n<p>Jaskier sits with his lute for a long moment, fingertips sliding up and down the strings, listening to the haunting whirr that movement makes. He knows he’s staring at the sleeping witcher, knows that should probably give the injured man whatever modicum of privacy he can, but at the same time there’s a dryness in his throat and a tightness in his stomach that he can’t quite place. </p>\n<p>That’s a lie, of course. He knows <i>exactly</i> where that discomfort comes from, knows <i>exactly</i> when that discomfort started, but he’s not about to tell that to some fucking stranger. Well, actually he’ll sing it to any stranger in a tavern who cares to listen – but this witcher, he’s not a stranger, not really. He’s Geralt’s fucking <i>brother</i>. </p>\n<p>“Shit,” Jaskier mutters under his breath, and bows his head over his lute. </p>\n<p> </p>\n<p>The sun rises over the wyvern’s carcasses with its usual regularity, but Eskel doesn’t wake. Jaskier stays in the little outhouse for a while, then makes the mistake of getting a whiff of himself—sweaty, dirty, still covered in wyvern gore—and vomits a little in his mouth. He leaves Eskel to recuperate while he goes to find whatever water source serves the farm, finds a miraculously untouched well round the back and even a couple of buckets nearby, then draws up enough water to wash off the worst of the muck and even give his doublet and undershirt a rough rinse. He hangs them up next to the front of the outhouse to dry, then goes to fetch another few buckets back for whenever Eskel decides to rejoin the land of the living.</p>\n<p>Which, as it turns out, is when he gets back, shirtless and lugging two buckets of water like a farmhand. </p>\n<p>Eskel eyes him critically, one eyebrow raised. “Excellent service in this inn of yours, Master Bard,” he says, lips quirked in a grin. He’s managed to manoeuvre himself upright, and he’s sitting with his back propped up against the wall of the outhouse, his swords across his thighs, cleaning wyvern innards of the blades with practiced motions. </p>\n<p>“I’m expecting good tipping,” Jaskier says, dumping the buckets down next to Eskel’s horse. He gestures at the weapons in Eskel’s lap. “Sorry for not cleaning them up a bit. Geralt once threw me in a river for trying to help him with them, so I figured the bond between a witcher and his swords was probably not one worth fiddling with.”</p>\n<p>Eskel looks amused. “He threw you in a river?” he asks. “For trying to help with his swords?” </p>\n<p>“It was a small river,” Jaskier says defensively, reaching for his now-dry undershirt. “And, well, it was maybe a bit more complicated than that. I was asking about his swords, and he told me that he didn’t trust me with them as far as he could throw me, which, you know, <i>rude</i>, and he might have been joking but I wasn’t about to let it slide – so I might have flicked some of the oil I use on my lute in his face.” </p>\n<p>Eskel nods, understanding. “So he threw you in the river,” he says, tone light and laughing. “Got to say, Jaskier, it sort of sounds like you brought it on yourself.” </p>\n<p>Jaskier’s smile freezes a little. “Yes, well,” he says. “I am very good at shovelling shit.” </p>\n<p>Eskel gives him an odd look, thoughtful and keen, but Jaskier just bustles through the moment and ignores him. “How’s the stomach?” he asks, crouching down and moving Eskel’s absurdly muscled body around so he can get a better look. </p>\n<p>“Already pretty closed up,” Eskel answers. “I downed another dose of the healing potion while you were gone, should be good to go by tomorrow.”</p>\n<p>Jaskier shakes his head. “You witchers,” he says. “Anyone else would be dead. You? Two days and you just shake it right off.” </p>\n<p>Eskel shrugs, smile playing around his lips. “That’s what the horrifically painful mutagens and Trials are for!” he says, <i>way</i> too bright and cheery. “Two wyverns and a gaping stomach wound is small fry, easily dealt with.” </p>\n<p>“As long as you have a passing bard to patch you up,” Jaskier points out.</p>\n<p>“With some very tidy stitches, too,” Eskel says. “Not just good with a lute.” </p>\n<p>“I have many talents,” Jaskier says, beaming a smile. His doublet is still a little damp so he leaves it for now, just sits down on the ground a few feet away and watches Eskel oil his swords. “You reckon you’ll be able to head back to town today? Might be better for your recovery to sleep in a bed rather than in an outhouse.”</p>\n<p>“Yeah, should be able to,” Eskel says. “See if I can collect payment for the job that nearly killed me, or if that Saliman bastard tries to wriggle out of it. He seemed like a wriggler, not gonna lie.” He glances up at Jaskier, frowning. “Or you could just sing that song of yours, couldn’t you? Geralt always said it’s surprisingly effective.” </p>\n<p>Jaskier preens, just a little. “What can I say? I know how to charm the hearts of the masses.” </p>\n<p>“You know how to write a fucking catchy tune is what you know how to do,” Eskel says bluntly. “First time I heard that damn song, I had it stuck in my head for a week.” </p>\n<p>“I don’t really see how that’s my problem.”</p>\n<p>Eskel laughs. “I see why Geralt likes you,” he says wryly, and it’s probably a good thing that all his attention is focused on his swords at that moment because Jaskier can’t stop the flash of hurt that dances across his expression. “You got business in the town?” </p>\n<p>Jaskier pastes on a smile. “Nothing particular,” he says. “Just making my way to Oxenfurt – I was planning to spend the winter there. Seeing the continent a little on the way, you know how it is.” </p>\n<p>“That I do,” Eskel answers, sliding his swords back in their scabbards. “Hard beds, shitty food, and people who scowl at you whenever you enter a room. What better way to live your life?” </p>\n<p>Jaskier shrugs. “Swap your swords for a lute,” he says. “You’ll get glared at less.” </p>\n<p>Eskel snorts. “Geralt’s told me enough about your… <i>escapades</i>,” he says, “to know that you don’t exactly live the quiet life, bard. What’s the long-standing one, the love of your life – the Countess de Cael?” </p>\n<p>Jaskier’s cheeks flush, and he’s not sure whether it’s because apparently Geralt has been talking about his conquests with his witcher brothers or whether it’s because of the grossly-inaccurate phrase <i>love of your life</i>. “De Stael,” he corrects. “And I’m not sure that’s exactly how I’d describe her. And, I’d like to point out, none of <i>that</i> kind of trouble is because I’m a bard!”</p>\n<p>Eskel cocks a mocking eyebrow. “Why is it, then?” </p>\n<p>“Because I am a man who enjoys fine company,” Jaskier says, aiming for lofty, “who is perpetually misunderstood by those around him.” </p>\n<p>“You enjoy fine company,” Eskel muses, “yet choose to spend your days with Geralt of bloody Rivia, the least <i>fine</i> man on the continent. That’s an interesting life choice, bard.” </p>\n<p>“Geralt’s fine in his own way,” Jaskier says almost on instinct, words leaving his lips even as a sharp pang floods through his heart. “And anyway, it’s not like I’m with him right now, am I? Are you going to criticise your own company now, witcher? Not that you’ve <i>been</i> much company, admittedly – mostly either unconscious or asleep, while I slave away to see to your every need.” </p>\n<p>Eskel snorts and holds up his hands. “Truce, Jaskier,” he says, full of amusement. “I’m just a humble witcher. I don’t stand a chance against a wordsmith of your… talents.”</p>\n<p>Jaskier’s pretty sure there’s an insult in there somewhere, but he’s going to take it anyway. “It’s good to meet a witcher who knows when he’s beaten,” he says primly, not quite able to resist on final jibe. </p>\n<p>Eskel just laughs, and shakes his head. </p>\n<p> </p>\n<p>Jaskier doesn’t know why he’s still so surprised at how quickly witchers heal, because only a little over a day after he crashed to his knees next to his nearly-dead body, Eskel’s up and about, only a little slowed down by the fact that yesterday there was a gaping gash in his body. His first priority is going to the wyverns to take their teeth as proof of the kill—Jaskier stands back from <i>that</i> particular task, unwilling to get himself drenched in wyvern gore <i>yet again</i>—and after that he busies himself with loading up his grey gelding, fingers deft and quick on the buckles of the saddle. </p>\n<p>“What’s his name?” Jaskier asks as Eskel eyes the stirrups, clearly assessing whether or not it’s a good idea to try to mount. </p>\n<p>“Llwyd,” Eskel answers, the word faintly musical on his tongue, then slots his foot into the stirrup and hoists himself onto the horse’s back. His face is twisted in pain as he does so, and for a moment after he seats himself he just sits there, bent forward, catching his breath. “His name is Llwyd,” he repeats finally, straightening up, and Jaskier is relieved to see that there’s no blood seeping through the bandages they finally managed to wrap around his stomach. </p>\n<p>“That’s just Elder for ‘grey’,” he points out, slinging his lute across his back and hoisting his pack onto his shoulder. “Not exactly original.”</p>\n<p>Eskel snorts a laugh, then winces, his hand pressed to his side. “The name came with the horse,” he says wryly. “Some backwoods seller who clearly thought that Elder names would jack up his prices.” </p>\n<p>“Did it work?” </p>\n<p>“Not on me,” Eskel says, and glances down to him. “Well, come on then.” </p>\n<p>Jaskier blinks. “You lead on,” he says, gesturing broadly to the rutted track that will eventually lead them back to the town. “You’re the wounded one, you should probably set the pace.” </p>\n<p>Eskel stares at him for a long moment. “Jaskier, get up here,” he says slowly, like he’s talking to a child. “Llwyd can take both our weight, and I know you didn’t sleep last night – you must be exhausted. Ride with me.” </p>\n<p>Jaskier stares up at him. “Why didn’t I meet <i>you</i> in fucking Posada when I was eighteen and looking for inspiration?” he asks, high-pitched and a little shrill. </p>\n<p>“Because I wouldn’t be seen dead in fucking <i>Posada</i>,” Eskel answers, and pats Llwyd’s flank. “Up you get, bard. I’d offer you a hand, but I think that might make me fall off right now.” </p>\n<p>“We wouldn’t want that,” Jaskier says, scrambling up onto Llwyd’s back behind Eskel. “Then I’d just have to steal your horse and ride off into the sunset with all your belongings – what a <i>shame</i>.” </p>\n<p>Eskel snorts, then twitches the reins and directs Llwyd into a slow walk. “If you were going to rob me, I reckon you would have done it already,” he says, amused. “You know, when I was unconscious and bleeding to death yesterday? Instead of pouring healing potions down my throat and getting me into shelter for the night. You even retrieved my damn swords for me.” </p>\n<p>Jaskier shrugs, then feels as the horse trots over a pothole, feels Eskel sway in the saddle more than he should do, hears the catch in his breath. He steadies him carefully, hands on his sides, then says, “Is it explicitly trained into all you witchers to ignore your serious injuries and just pretend you’re fine when you’re obviously not?” </p>\n<p>Eskel laughs. “Pretty much,” he says, then presses his hand over Jaskier’s. “You do realise that you’re pretty rare in wanting to help us, right? Most people would be <i>much</i> more likely to rob me and leave me to bleed to death.”</p>\n<p>“People are arseholes.” </p>\n<p>“You’re not wrong,” Eskel says, and spurs Llwyd onwards. </p>\n<p>It only takes them a few hours to get back to the town. Eskel perversely seems to gain strength the closer they get, and Jaskier barely has to steady him at all by the time they trot through the marketplace. They get a few strange looks but nothing that Jaskier isn’t used to, and by the relaxed slant to Eskel’s shoulders it seems that he’s not exactly worried, either. Eskel directs Llwyd straight to the local inn, then they dismount as carefully as they can, Jaskier holding the reins as Eskel climbs down. “You good?” he asks, gently stroking the horse’s mane. </p>\n<p>“Yeah, I’m good,” Eskel answers, barely any tightness in his voice. He flashes Jaskier a brilliant smile, bright and beaming. “This is where we part ways, bard,” he says. “I’m going to get a room, a bath, and probably sleep until the morning – and then I’ll be off before first light.” </p>\n<p>Jaskier nods. “I’ll find a tavern,” he says. “Sing a few songs, make some money. I’ll stay out of your hair.” </p>\n<p>“You’re not in my hair,” Eskel says, raising an eyebrow. “You saved my life, Jaskier, and I’m very grateful for it. But the winter’s closing in, and I’ve got a long journey ahead of me.” </p>\n<p>“Kaer Morhen?” </p>\n<p>Eskel nods. “I’ll say hi to Geralt for you.” </p>\n<p>Jaskier can’t quite stop his expression twisting. “You do that,” he says, a little strangled, then pastes on a smile. “Good to meet you, Eskel.” </p>\n<p>Eskel reaches out, grips his shoulder tight, then pulls him into a brief hug. Jaskier is, frankly, a little stunned by this whole business, but he doesn’t object. “I hope we meet again,” he says, a gently formality in his voice, and he grips the back of Jaskier’s neck, presses their foreheads together for a moment before letting him go. “It’s been an honour.” </p>\n<p>“For me, too,” Jaskier says, a genuine smile creeping across his lips. “See you around, Eskel.”</p>\n<p>“See you around,” Eskel answers, and turns back to his horse.</p>\n<p>Jaskier wanders back through the town, a strangely light feeling in his chest, until he finds a tavern, already noisy despite the fact it’s mid-afternoon. He ducks inside, barters with the barkeep, gets a plate of bread and cheese and an ale in exchange for a performance, then leaves his pack behind the bar and takes out his lute. The tavern’s patrons are average at best, some watching him and singing along with moderate enthusiasm, others just carrying on their conversations, but he earns a good double handful of coins, enough to get him a room for the night and keep him in hot meals for the next few weeks. He gets sent a couple of pints of ale, too, which he drinks slowly as the afternoon turns into the evening, then the barkeep offers him a bowl of soup, on the house, and he accepts with a smile. </p>\n<p>He plays until his fingers are numb, until his voice is going hoarse, until it’s getting difficult to keep his eyes open because, well, he has been awake for going on two days now. He bows out with a larger smattering of applause than he expected, collects up his earnings, and steps out of the tavern with a friendly wave from the barkeep. </p>\n<p>It’s cold outside, and getting colder. Jaskier wraps his arms around himself, his breath just starting to mist on the air, and starts back towards the inn, footsteps a little heavier than usual. There’s a part of him that’s sort of hoping he runs into Eskel again before he leaves, but he knows in his heart that that wouldn’t be a good idea – because it’s not <i>Eskel</i> that he wants to see. The man is startlingly good company, easy with his affection, and that’s brilliant, sure, but it’s not what Jaskier actually wants. </p>\n<p>Jaskier sighs, rubs at his eyes. “Fuck,” he mutters to himself and doesn’t think about golden eyes and silver-white hair, about bitter words in the bitter mountain air, about loss and heartbreak and all the other things that he sings about to strangers in taverns across the continent. He hums a few bars of <i>Her Sweet Kiss</i> under his breath as he treads the cobbles of this sleepy backwoods town, then frowns as he glances up at the bright moon overhead – because the edges of its horns are sort of… fuzzy? </p>\n<p>It only takes a moment.</p>\n<p>Jaskier pauses, thinks about the taste in his mouth, soup and ale and something else, bitter across the back of his tongue. “Oh, <i>shit</i>,” he says, comes to a halt on the cobbles—<i>swaying!</i>—and that’s when he hears it, behind him, quiet enough that he didn’t hear it before over his own humming. </p>\n<p>Footsteps. </p>\n<p>Fear slicks cold through his stomach. </p>\n<p>He’s not far from the inn, he’s pretty sure about that, but the streets are unfamiliar in the dark – and add that to the fact that he’s pretty sure he’s been drugged because the houses are currently twisting around the edges, well, it’s not looking good right about now. “Bollocks,” he husks under his breath, tries to grope for the knife in his boot but instead just finds himself on his hands and knees on the cobbles, breath hitching, head inordinately heavy. His lute cases slides off his back, thuds to the ground, and then the footsteps are getting louder, too loud to just be one person, three, maybe even four. He’s being grabbed, hoisted to his feet, held between two men wearing what he’s pretty sure is <i>Nilfgaardian armour</i>, and oh, shit. </p>\n<p>“That’s him,” a voice says, slurred through whatever they’ve drugged him with – he shouldn’t have drunk that fucking ale, Geralt always <i>told</i> him not to drink the ale that strangers bought him. “The witcher’s bard.” </p>\n<p>Jaskier tries to protest, but the only sound that comes out is garbled moaning. </p>\n<p>“Come on,” another voice says in a pronounced Nilfgaardian accent – and, shit, Jaskier knows there’s a war on, knows that Cintra has fallen and everything’s going to shit, but he was hoping that he was far north enough that he was <i>safe</i>. Apparently fucking not, and that voice is saying, “Let’s get him out of here.” </p>\n<p>And then Jaskier’s being dragged away, feet battering limply against the cobbles, barely even able to keep his head up – and he’s been in danger before, sure, faced bandits and monsters and a heartbroken witcher, full of wrath on the top of a mountain, but he doesn’t think he’s ever been this <i>afraid</i> before. The Nilfgaardians—oh shit, what has he done to piss the bloody <i>Nilfgaardians</i> off?!—chat casually over his head, easy, laughing, barely even acknowledging the fact that they’re drugging and kidnapping a humble bard – but he knows this isn’t good. <i>The witcher’s bard</i>, they said, and that was what Eskel said, too: <i>You’re Geralt’s bard.</i> </p>\n<p>Even now, he can’t get away from Geralt of fucking Rivia. </p>\n<p>Jaskier makes a moue of noise in the back of his throat, broken and panicked.</p>\n<p>“<i>Hey!</i>” </p>\n<p>The Nilfgaardians stop in their tracks, but Jaskier’s head is lolling against his chest at this point so he can’t exactly see much. His head is also getting fuzzier and fuzzier, so he’s pretty sure that he’s on the verge of passing out – and all of a sudden he’s falling, slipping, only being held up by one arm anymore and then not at all, he’s on his knees, he’s slumping forward, hitting the cobbles hard, something warm and sticky dripping down the side of his face, and, well.</p>\n<p>Everything goes black for a while.</p>\n<p>Jaskier is woken rudely by his stomach emptying itself into a bucket. He comes to mid-vomit, bile staining the back of his throat, gut tied in painful, angry knots, and curls up as much as he can, spittle hanging thick and slick from his lips. </p>\n<p>“You’re alright, bard,” a gruff voice says, and he absently becomes aware that there’s a hand rubbing circles on his back. “Come on, I know there’s more in there. Keep going.” </p>\n<p>Obediently Jaskier turns his head back to the bucket and vomits again, yellow bile streaked with something ominously black and shiny. He lies there for a second, head hanging off the edge of the bed, panting, then manages a very eloquent, “<i>What?</i>” </p>\n<p>“You were drugged,” that same voice says, and Jaskier is carefully rolled back onto the bed. “And then some lovely Nilfgaardians tried to kidnap you.” </p>\n<p>The first thing Jaskier sees is bright golden-yellow eyes, focused on him sharp and keen, and for a second adrenaline floods through his abused gut. “Geralt?” he asks, muttered and hazy.</p>\n<p>“Not exactly,” the golden eyes say, and the face resolves into Eskel, frowning and concerned. “How you feeling?” </p>\n<p>Jaskier moans, which he figures answers that question eloquently enough.</p>\n<p>“Need to vomit again?” </p>\n<p>Jaskier shakes his head as much as he can. “ ‘M alright,” he says, then refocuses on Eskel. “ ‘S you?”</p>\n<p>“It’s me,” Eskel says, eyebrow cocked. “Happened to be coming back from collecting my fee from the Salimans when I saw some poor drunk fool getting manhandled in the street ahead of me. Didn’t think much of it to begin with, but then I saw the lute and I smelled your scent and the drugs, and I figured I’d get involved.”</p>\n<p>“Th’nks.” </p>\n<p>“You’re welcome,” Eskel says, settling himself into a chair next to the bed that Jaskier’s currently sprawled out across. “Now go to sleep, bard. I’ll be here when you wake up.”</p>\n<p>Jaskier figures he might as well do as he’s told. He sleeps. </p>\n<p> </p>\n<p>When Jaskier wakes again, it’s to the smell of fresh bread and a soft, slightly tone-deaf humming. He lies still for a while, just listening, cataloguing the sick feeling in his stomach, the ache in his limbs, the faint throbbing pain in his head and the bruised tightness in his knees, sorting it all out as much as he can. He opens his eyes eventually, blinking hazily at the ceiling, careful not to move too much because, well, he doesn’t really want to vomit everywhere again. </p>\n<p>“Morning sunshine,” Eskel says, perched in the chair next to him, feet propped on the end of the bed. He’s eating a hunk of bread, dropping crumbs all over himself, and he looks remarkably relaxed given that he’s got a drugged bard in his bed. “How you feeling?”</p>\n<p>“Better, I think,” Jaskier says, pulling himself up against the headboard. He rests his hand on his stomach, then makes the mistake of running his tongue over his teeth, nearly gags again. “<i>Gods</i>, my mouth tastes foul.” </p>\n<p>Eskel roots around in his pocket for a minute, then passes him a sprig of mint. “Chew this,” he says. “Should help.” </p>\n<p>Jaskier accepts the mint and does as he says. It helps a little, and he spits the chewed herb out into his palm, swaps it for the glass of water Eskel offers him next. “What happened?” he asks. </p>\n<p>“A couple of Nilfgaardian soldiers drugged you and tried to kidnap you,” Eskel says, shredding a piece of bread with his fingertips. “I saved you.” </p>\n<p>“Repaying the favour?” </p>\n<p>Eskel doesn’t answer. He flicks a shredded pile of crumbs onto the floor, tosses the rest of the bread into Jaskier’s lap. “I spoke to one of the Nilfgaardians while you were sleeping,” he says. </p>\n<p>Jaskier pauses. “I’m assuming ‘spoke to’ is a euphemism for ‘beat up’?” </p>\n<p>Eskel hums his agreement – and, oh, there it is, <i>there’s</i> Geralt’s brother in arms. “He said some… worrying things,” he says, folding his arms. His eyes are bright and fixed on Jaskier. “You’re a wanted man, bard.”</p>\n<p>Jaskier’s heart seizes in his chest. “I’m a what now?” </p>\n<p>Eskel’s lips press tight together. “You’re wanted by Nilfgaard,” he says. </p>\n<p>“For <i>what?!</i>” Jaskier squeaks. </p>\n<p>“For Geralt,” Eskel answers with a sigh. “Apparently my idiot brother has something that they want, but they’re having trouble finding him.” </p>\n<p>Understanding dawns. “So instead, they look for me,” he says slowly. “Shit, I heard them say something about me being the witcher’s bard.” Fear floods his throat. “They were going to… do what you did to that Nilfgaardian to me, weren’t they?”</p>\n<p>Eskel watches him carefully. “It’s likely.” </p>\n<p>Jaskier lets out a considered breath. “Right,” he says slowly. “And I’m guessing they’re not the only ones looking for me?”</p>\n<p>Eskel shakes his head.</p>\n<p>Jaskier is brave in many ways. He’ll drag a witcher out of the way of a werewolf’s claw, he’ll face the wrath of a jilted spouse, he’ll offer his heart to a friend and hope that it doesn’t get torn apart on the top of a windy, dragon-infested mountain. What he’s not so hot on, however, is violence and torture. “I guess I’ll be lying low for a while,” he says, unable to stop himself from sounding strangled. “I’ll… hide. Somewhere. Should probably avoid Oxenfurt, that’s a fairly obvious place to look for me. And Novigrad, Vizima. Basically all the major cities. I guess I’ll have to stick to little backwoods places like this—”</p>\n<p>“Jaskier.” </p>\n<p>Jaskier knows he’s spiralling. He snaps his jaw shut with a click.</p>\n<p>Eskel’s studying him keenly. “You’re coming with me,” he says, leaning forward, elbows propped on his knees. </p>\n<p>Jaskier blinks at him for a second, not understanding. “But you’re going to Kaer Morhen.”</p>\n<p>“Exactly.” </p>\n<p>“Humans aren’t allowed at Kaer Morhen.”</p>\n<p>Eskel’s lips twist. “That’s… not strictly true,” he says. “If you come with a witcher, you’re fine. The others might be a little frosty at first, but, well, it’s not like you’re a stranger.” </p>\n<p>There’s a bitter taste in the back of Jaskier’s throat that isn’t just the aftertaste of his own vomit. “That’s not a good idea.” </p>\n<p>Eskel shrugs. “I figure it makes sense,” he says. “You’re at risk because of a witcher. It stands to reason that a witcher should protect you. And there’s nowhere safer than Kaer Morhen.” </p>\n<p>“I appreciate the gesture,” Jaskier says, the hunk of bread crushed in his palm. “I really do. But, Eskel, I can’t accept. I can’t come with you.” </p>\n<p>Eskel frowns. “You know I can’t come with you, either,” he says. “I’m a witcher, not a bodyguard. And if you stay in the open, even if I’m here to protect you, it’ll just be attack after attack. Do you want to spend the next however many years of this godsdamned war in <i>hiding</i>?”</p>\n<p>“No, I don’t,” Jaskier says, as level as he can manage. “But please trust me when I say that I am not welcome at Kaer Morhen, Eskel.” </p>\n<p>Realisation spreads slowly across Eskel’s face. “What did my idiot of a brother do?” </p>\n<p>Jaskier grits his teeth and does his best to push the heartbreak down as far as he can manage. “He made it quite clear what he thinks of me,” he says, bright and cheery. “That I might have spent the last few decades of my life thinking that we were friends, that we were…” He swallows down the word more. “Well, that we were friends. But I was apparently reading that whole situation wrong. He… set me straight. Said some fairly explicit things involving me being responsible for everything that went wrong in his life, and about how the one blessing he’d ask from life would be for me… to not be in it.” Jaskier takes a breath. It’s surprisingly steady. “That was, oh, over a year ago now? Haven’t seen him since.” He snorts. “So the Nilfgaardians are barking up the wrong tree anyway – I couldn’t tell them where Geralt is if I wanted to. May as well just leave me to their tender mercies. It’s not like it’ll do Geralt any harm.” </p>\n<p>Eskel just studies him for a long moment, expression unreadable. “Do you know how I knew you were Geralt’s bard before I even spoke to you?” he asks.</p>\n<p>It’s a bit of a tangent, but Jaskier figures he’s probably best to just go with it. “Because of the unrivalled storytelling ability and musicality that’s led to me being famous across the continent?” </p>\n<p>Eskel snorts. “No, not that,” he says. “It’s because of the way you smell, Jaskier.” </p>\n<p>Jaskier briefly remembers Eskel half-conscious, hazed with pain, grabbing at his arm until his nostrils flared wide and he breathed in deep. “How I <i>smell?</i>” he echoes slowly. “Are you saying that I smell like <i>Geralt</i>?” </p>\n<p>“Not exactly,” Eskel says. “It’s actually more like <i>Geralt</i> smells like <i>you</i>.” </p>\n<p>Jaskier’s pretty sure he’s hearing things. “Explain that one more time.” </p>\n<p>“Whenever I see him,” Eskel explains, “whether it’s at Kaer Morhen, or if it’s whenever we bump into each other on the road, he smells like… things a witcher isn’t supposed to smell like. Sometimes it’s lavender, sometimes it’s oranges. Sandalwood, rose oil, honeysuckle.” </p>\n<p>Jaskier frowns. “Those are the scents I use.”</p>\n<p>“I know,” Eskel answers, nodding. “I saw all the little vials of oil in your pack when I dragged you in here, took the liberty of having a sniff. Those are the scents I recognise from Geralt’s clothes, his hair, his… fucking <i>horse</i>, sometimes. Because you know what he’s like, he doesn’t exactly <i>bathe</i> particularly often – so scents like that stick around. I’ve got used to them.” </p>\n<p>“But surely if you can smell them, he can smell them, too?” Jaskier asks. “I know you witchers have weird heightened senses – so if Geralt stinks of my very expensive orange oil, presumably he <i>knows</i> he stinks of my very expensive orange oil?” </p>\n<p>Eskel just looks at him. </p>\n<p>“Oh,” Jaskier says. “Right.” </p>\n<p>“You’re coming to Kaer Morhen,” Eskel says. “Whatever that fucking idiot said to you, I’m pretty sure that he’d never speak to me again if I let you get kidnapped and tortured. And, well, for a witcher, ‘never’ is either a very, very long time or a very, very short time.” </p>\n<p>Jaskier looks down at the mangled bread in his lap. “You should know,” he says, slowly, carefully, digging his thumbnails into what’s left of the crust, “that I’m sort of – kind of – maybe – completely in love with him.” </p>\n<p>Eskel sighs. “I figured as much,” he says. “But you know what, bard? I like you. And I’m not about to let you throw your damn life away just because you want to avoid being in the same room as a bloody fool who isn’t good at emotions and who, I’m guessing from the way you stink of adrenaline and sadness right now, pretty much broke your heart.” </p>\n<p>Jaskier’s smile is twisted. “No ‘pretty much’ about it.” </p>\n<p>Eskel shakes his head and levers himself out of his chair. “We should get going as soon as we can,” he says. “Those Nilfgaardians, they’ll be back – probably with reinforcements. We don’t want to be here when they return.”</p>\n<p>Jaskier shifts against the bed, testing his strength. He’s a little unsteady, yes, but he’s pretty sure that he’s strong enough to ride a horse out of this rickety little town in the middle of nowhere. “You didn’t kill them?” he asks. </p>\n<p>Eskel’s packing his saddlebags, and he glances back at Jaskier. “I didn’t,” he confirms. “Witchers don’t kill humans if we can help it, bard. You should know that.” </p>\n<p>“I do,” Jaskier says, then thinks about the creep of paralytic through his body, the roughness of the hands on his body, the crippling fear. “Just wishful thinking.” </p>\n<p>Eskel just studies him a moment longer. “Gather your things,” he says eventually. “We’ll get some food downstairs, then get on the road.” </p>\n<p>Jaskier nods, and does as he’s told. </p>\n<p> </p>\n<p>For the first day, Eskel hoists Jaskier up in front of him on Llwyd, steadying him whenever he loses his balance – which is fairly regularly, given that he was drugged and also cracked his head pretty solidly on the cobbles when he fell. The wooziness fades eventually, though, and after a night’s moderately decent sleep under the stars, Jaskier’s feeling strong enough to walk. Eskel insists he ride behind him for another day, though, and Jaskier’s not going to argue with a free ride. He says as much to Eskel, who snorts with laughter and says, “And I thought you were supposed to be good with words.”</p>\n<p>Jaskier flushes, and shuts up.</p>\n<p>Travelling with Eskel is remarkably similar to travelling with Geralt, after a while. It’s the same rhythm, the same patterns: moving during the day, sometimes walking, sometimes riding, then finding somewhere to rest at night, an inn or a room above a tavern when they’re in more populous areas, a stable or an outhouse when they’re in farmland, sometimes a fire underneath the open sky. The main difference is that when Jaskier chatters away, Eskel chatters back. When he strums his lute, when he sings, Eskel doesn’t just roll his eyes and ignore him – he listens, he responds, he asks questions. Sometimes he even offers <i>suggestions</i>, which confuses Jaskier so much he has to ask him to stop.</p>\n<p>He does adopt some of the suggestions, though. Eskel apparently has a way with rhymes. </p>\n<p>They’re camping out one night, Jaskier wrapped up in two blankets and lying probably too close to the fire to be strictly safe, when Eskel stirs. “Jaskier?”</p>\n<p>Jaskier opens his eyes, glances up. “Yeah?” </p>\n<p>“Did you and Geralt ever…” He trails off.</p>\n<p>Jaskier frowns. “Ever what?” </p>\n<p>Eskel makes a noise of frustration that’s so startlingly familiar it makes Jaskier laugh quietly. “Fuck,” he says flatly.</p>\n<p>Heat rushes to Jaskier’s cheeks. “Ah, no,” he says. “No, we never did… that.” </p>\n<p>Eskel’s quiet for a moment. “Why not?”</p>\n<p>This is a very surreal conversation. “Because he’s not interested?” Jaskier answers, voice pitching higher. “I’m not even sure he’s interested in <i>men</i> – I’ve only ever seen him with women, whether he’s paying for their company or just… moping after violet-eyed sorceresses.” </p>\n<p>“There’s more than one of those?”</p>\n<p>“I was exaggerating,” Jaskier says with a sigh, then cranes his head up, looks over at Eskel. “You know about Yennefer?”</p>\n<p>Eskel hums. “He’s mentioned her.” </p>\n<p>Jaskier’s heart twists in his chest, and he looks away. “Of course,” he says, and changes the subject. “Why do you ask? Is this your way of flirting with me?” </p>\n<p>Eskel laughs. “Sorry, bard, you’re not my type,” he says. “Missing a few parts, if you know what I mean.” He pauses, and for once Jaskier is content just to listen to the quiet crackle of the fire, the rustle of the leaves in the late-autumn breeze. “Geralt is, though, you know.” </p>\n<p>Jasker blinks. “He’s what?” </p>\n<p>“Interested in men,” Eskel answers. </p>\n<p>Jaskier lies there a second longer, staring at the heart of the fire, then hoists himself up on his elbow and peers at Eskel. Eskel seems unfazed by this whole bizarre conversation, hands tucked behind his head, eyes closed. If not for the fact that he seems to be insistent on discussing Geralt of fucking Rivia’s sexual preferences, Jaskier would think he was asleep. “Why are you telling me this?” Jaskier asks, not even bothering to keep the tightness out of his voice. “You know about Yennefer, you know that he loves her. And if you don’t, well, let me tell you: <i>he fucking loves her</i>. He… bound her to him with a djinn wish, he’s fucked her across the continent, he mopes around after her like a kicked puppy. So why exactly, Eskel, are you telling me this? To, what, mock me? Oh, hey, Jaskier, here’s what you <i>could have had</i>?”</p>\n<p>Eskel opens his eyes and looks over at him. “I’m not mocking you.” </p>\n<p>“Then what <i>are</i> you doing?” Eskel seems lost for words for a moment, which is a witcher state that Jaskier is more than familiar with. He doesn’t give him a chance to answer. “Whatever it is, stop. This whole <i>Kaer Morhen for my own safety</i> bollocks is going to be hard enough for me as it is. I don’t need you trying to make it better but actually just making it <i>worse</i>, okay?”</p>\n<p>“Okay,” Eskel says. “I’m sorry, Jaskier.”</p>\n<p>Jaskier huffs, wraps his blankets tighter around his shoulders, and rolls onto his side, facing away from the fire. He doesn’t sleep for a long while. </p>\n<p>In the morning, Eskel doesn’t bring it up again, and they travel onwards.</p>\n<p> </p>\n<p>Less than a week later, they stop for the evening in a small hamlet right at the edge of the foothills. Jaskier’s been avoiding playing so far, figuring that advertising himself as a bard who tends to sing about witchers is probably a spectacularly bad idea, given that he’s seen Nilfgaardian insignia and heard Nilfgaardian accents pretty much everywhere, even this far north – but here? Here, he must be safe. </p>\n<p>Eskel doesn’t look too convinced. “Are you sure?” he asks.</p>\n<p>Jaskier shrugs, twisting one of his lute’s tuning pegs. “No,” he says. “But aren’t you getting sick of being my only audience?” </p>\n<p>“Not particularly.” </p>\n<p>“Well, <i>I’m</i> getting sick of you being my only audience,” Jaskier says lightly. “Plus, we’re going to need to start heading into the mountains soon, right? If I can earn us a decent amount of money today, then we can stock up on supplies.” He plucks at his doublet, silken and definitely not winter-appropriate. “I will definitely freeze to death if this is all I have.” </p>\n<p>“Okay,” Eskel says. “But I’m not leaving you alone. I’ll be right here.” </p>\n<p>Jaskier flashes him a smile. “It’s almost like you care.” </p>\n<p>“I <i>do</i> care,” Eskel says, eyebrow raised. “Remember: I’m not Geralt. I’m capable of expressing my emotions in a functional way.”</p>\n<p>Jaskier laughs. “Very true.” He slides away from their little corner table, swaggers up to the bar with all the confidence he can and barters with the barman for a while. The man is actually fairly enthusiastic about having a bard play for his patrons, and Jaskier gets set up quickly, starts with a couple of dancingly-quick jigs before sliding into the epic tales of adventure and derring-do that he’s probably best known for. He peppers in love songs and, as the night gets deeper, a few erotic ballads, carefully avoiding the drinks that are sent his way, only drinking what’s given to him directly from the barman or, on a couple of occasions, passed to him by Eskel—he could get used to be treated like this by his witcher—and, to be honest, he’s feeling it, and so is his audience.</p>\n<p>This is why he performs, he thinks absently, grinning into laughing faces, stamping along with dozens of thumping feet, dancing between the tables, all eyes on him. Nights like this, where the ale is sweet and the food is hot and he’s just… <i>happy</i>. </p>\n<p>He glances over at the table in the corner, just once, lips caught in a smile that he can’t control, genuine, ecstatic, wanting to share that joy – and when he sees Eskel’s answering smile, his stomach drops, just a little. His fingers falter and he has to catch himself before he loses the thread of the song, so he turns back, loses himself in his audience, in his performance, in the character that he puts on stage for the whole world to see. </p>\n<p>For the briefest second, he forgot that he wasn’t with Geralt. </p>\n<p>There’s a young man sitting at one of the tables closest to the bar, and Jaskier hasn’t missed the fact that his eyes have been fixed on him, intent and intense, the whole way through his performance. It’s an expression that Jaskier knows very well by now. He’s been mostly ignoring that fact so far because, well, he’s not really been feeling the need for any rough and tumble for a while now – but all of a sudden there’s pain in his heart, sharp and biting, and he wants to lose himself in more than just music. For his last few songs he returns the man’s glances, just enough that it doesn’t look like he’s neglecting the rest of his audience, flashes him smiles and attention and dances his fingers along his shoulders, narrower than he wants but still broader than his own. </p>\n<p>The man’s eyes flare, hungry and bright, and Jaskier feels an answering need start to build in his belly. </p>\n<p>He finishes his performance to applause that borders on the rapturous, then goes to Eskel’s table, lays his lute on the tabletop. “I’m just gonna—”</p>\n<p>“The guy by the bar?” Eskel interrupts. </p>\n<p>Jaskier flushes. “That obvious?” </p>\n<p>Eskel shrugs. “You sure that’s safe?” </p>\n<p>“Who are you, my mother?” Jaskier laughs. “Yes, dear, I’ll be fine. I’m sure I can survive a fumble in the stables. Just keep an eye on my lute?” </p>\n<p>Eskel rolls his eyes. “I’m not your fucking butler,” he mutters, but Jaskier’s spent enough time with him, now, that he can hear the agreement. </p>\n<p>Jaskier flashes him a smile. “Won’t be long.” </p>\n<p>“I’m sure you won’t.” </p>\n<p>Jaskier is going to ignore that.</p>\n<p>The young man is still watching him, green eyes heavy, and Jaskier meets his gaze, cocks his head towards the door to the stable. Something Jaskier can’t quite define flashes in the man’s expression and he gets to his feet, follows Jaskier out. This isn’t actually what Jaskier usually prefers to do, the anonymous shag in the alleyway behind the tavern, he usually likes a little romance, a little flirting, a meeting of minds – but he can still feel that pain in his heart, that fucking <i>heartbreak</i>, and there’s nothing better for heartbreak than to go and fall in love with someone else.</p>\n<p>That ignores the fact that he’s been in love with Geralt for the last few decades of his life, of course.</p>\n<p>The young man grabs him pretty much the second the door shuts behind them, pushes him up against the wall of the stable and kisses him hard. Jaskier gives as good as he gets, chasing the taste of beer on the man’s tongue, carding his hands through his hair, and then the man’s hand is reaching down between them, grabbing at his crotch, squeezing maybe a little too hard – but not hard enough to stop his cock starting to harden. Jaskier groans and the young man laughs, sucks a bruise into the side of his neck as he starts to work on the laces of his trousers. Jaskier lets his head fall back against the stable wall, eyes closed, feeling the young man’s cock rutting hard and rough against his thigh. </p>\n<p>“That’s him.” </p>\n<p>The young man’s fingers still, and he makes a strange gurgling noise in the back of his throat. </p>\n<p>Jaskier’s eyes fly open, and all of a sudden he’s assaulted by the smell of blood, sharp and acrid. The young man whose hand was halfway down his trousers a heartbeat ago is dead on the ground at his feet, a knife clean through his throat, and there are three strangers arrayed in front of him, eyes hard, hands scarred, two men and a woman. Shit, Jaskier knows mercenaries when he sees them – and the woman kneels, tugs the knife out of the young man’s throat, wipes it clean on a nearby haybale. “I recognise him,” she says. “Seen him before with the white wolf.”</p>\n<p>\n<i>Oh, shit. </i>\n</p>\n<p>“I think you must have got me confused with someone else,” Jaskier says, holding up his hands placatingly, trousers still unlaced but erection very much deflated. </p>\n<p>“No, we haven’t,” the man to his right says, shaved head gleaming in the faint light from the tavern. “You’re the famous Jaskier – I saw you perform in Oxenfurt six months ago.” He flashes a wicked smile, studded with gold teeth. “I really admire your musicality, to be honest, but the Nilfgaardian army is offering a <i>lot</i> for your capture.” </p>\n<p>Jaskier licks his lips. “We can come to some kind of arrangement, surely,” he says. “You want money? I can pay you. I’ve got a bag full of gold in there – you can have it.” </p>\n<p>The woman laughs. “Whatever you can give us, bard,” she says, “trust me, Nilfgaard will give us more. They <i>really</i> want your witcher.” She comes forward, grabs him by the neck of his doublet, hauls him forward with a knife to his throat. </p>\n<p>The second man cocks his head, grabs Jaskier’s hands and yanks them behind his back. “I heard that it’s not actually the witcher they want,” he says conversationally, looping rope tight around his wrists. “He’s got something they’re after – something about a lion cub?” </p>\n<p><i>A lion cub?</i> Jaskier thinks, confused, and then: <i>Oh shit,</i> the <i>Lion Cub. </i></p>\n<p>“A lion cub?” the woman asks. “I don’t think Nilfgaard wants a fucking lion cub, idiot. They’re not trying to put together a <i>menagerie</i>.” </p>\n<p>The man shrugs. “That’s what I heard.” </p>\n<p>The first man folds his arms. “I don’t think it really matters,” he says, eyebrow raised. “They’ll pay just the same, either way.” </p>\n<p>“True,” the woman says, and laughs brightly. “We’re gonna be <i>rich</i>.” </p>\n<p>“You’re gonna be something, that’s for sure.” </p>\n<p>All three mercenaries freeze, and Jaskier sags a little. “Thank the gods,” he says. </p>\n<p>Eskel’s standing in the entrance to the stables, steel sword held almost casually in his hand, and to the untrained eye he almost looks relaxed, maybe even a little drunk. Jaskier knows better, though, and he’s pretty sure his would-be kidnappers are the same. “Sorry lads,” Eskel drawls. “I’m going to have to ask you to untie my friend there and then get out of this place pretty sharpish, or I’m going to have to use this.” </p>\n<p>“Shit,” Jaskier hears the woman husk. “There wasn’t supposed to be <i>another</i> witcher here.” </p>\n<p>“And yet, here I am,” Eskel grins at her. He hefts his sword, props it against his shoulder. “What’s it going to be?” </p>\n<p>Jaskier hears the rattle of a sword being drawn from its sheath, and Eskel meets his gaze. “Jaskier,” he says. </p>\n<p>“Eskel?” Jaskier squeaks.</p>\n<p>Eskel’s yellow-gold eyes are bright. “Get down.” </p>\n<p>Jaskier figures it’s probably best to just get down. </p>\n<p>Unsurprisingly, Eskel makes short work of the three mercenaries, sustaining nothing more than a small nick to his right elbow which he actually looks pretty annoyed at himself for letting happen. The woman and the second man die on his sword before the first man throws up his hands in surrender, tosses his sword to the ground at Eskel’s feet – and Eskel levels him with a crack to the back of the head, lays him out cold next to his dead friends and their dead victim. </p>\n<p>Jaskier gets to his feet and picks his way out of the mess of blood and body parts. “We should probably go,” he says quietly. “Before he wakes up. Or before we’re found next to a pile of corpses.” </p>\n<p>Eskel sighs. “Go grab our stuff,” he says. “I’ll get Llwyd.” He pauses, glances down. “Maybe do your trousers up first.” </p>\n<p>They’re on the road within five minutes, taking the darkened road at as fast a pace as Llwyd can manage. They sleep in the woods that night, far away from the road, and they don’t dare light a fire so it’s <i>cold</i>. Eskel drags Jaskier close without a word, wraps an arm around him and drapes his blanket across them both. The extra warmth helps, and Jaskier’s teeth stop chattering enough for him to actually get out coherent words. “I know why Nilfgaard is looking for Geralt,” he says, chin buried in the rough blanket.</p>\n<p>“Yeah?” </p>\n<p>Jaskier nods, then hears Eskel make a noise of annoyance, presumably as his hair tickles his nose. “Those mercenaries said that Nilfgaard is looking for a lion cub,” he says, his heart beating a little faster in his chest. </p>\n<p>Eskel snorts. “Nilfgaard’s trying to start a zoo?” </p>\n<p>Jaskier rolls his eyes. “They made the same joke,” he says dryly. “No, Nilfgaard isn’t looking for an animal, Eskel. They’re looking for the <i>Lion Cub of Cintra</i>.” </p>\n<p>“Isn’t that the Cintran crown princess?”</p>\n<p>“It’s exactly the Cintran crown princess,” Jaskier says, unable to stop a certain amount of affection seeping into his voice. “Her name is Cirilla.” </p>\n<p>“You sound like you know her.” </p>\n<p>“Not well,” Jaskier says, “but yeah, I do. I’ve played at the Cintran court quite a lot over the years, partly because Queen Calanthe actually pays surprisingly well, but also because, well…” He shrugs, and Eskel smacks him in the back. “I wanted to keep an eye on her. <i>Someone</i> had to, and it wasn’t about to be Geralt, was it?” </p>\n<p>Even Eskel’s silence sounds confused. “Why would Geralt need to keep an eye on the Cintran crown princess?” </p>\n<p>Jaskier twists around to face him, pulls the blankets closer around him. Eskel gives him a strange look but doesn’t move away, which Jaskier really does appreciate because, you know, body heat. “Did he not tell you about his Child Surprise?” </p>\n<p>Eskel looks unimpressed but not particularly surprised. “He really didn’t.” </p>\n<p>“Cirilla is his Child Surprise,” Jaskier says. There’s something that might almost be pride seeping into his chest – but then, of course, it fades. He twitches a sad smile. “Something else that’s my fault. And he spent… gods, years and years and <i>years</i> ignoring it, pretending it hadn’t happened, that he <i>hadn’t</i> tied an innocent child to him through Destiny and all that bullshit.” He smiles a little wider, a little warmer. “He must have gone back for her,” he says. “He must have found her.” </p>\n<p>Eskel studies him, yellow-gold eyes bright in the moonlight. “You sound like you’re proud of him.” </p>\n<p>“I think I am,” Jaskier says simply. </p>\n<p>Eskel huffs out a quiet laugh. “You… confuse me, Jaskier,” he says eventually. “I can smell your adrenaline and your hurt every time I so much as <i>mention</i> my brother—with good reason, from what you’ve told me—but here you are, feeling <i>proud</i> of him for, what, demonstrating basic emotional decency?” </p>\n<p>Jaskier smiles. “You know him better than I do,” he says. “You know how hard basic emotions are for him.” </p>\n<p>Eskel hums. “You’re not wrong.” He pauses for a second, then says, “You know that if he gives you any grief when we get to Kaer Morhen, you just tell me and I will kick the shit out of him.” </p>\n<p>Jaskier barks a laugh. “My hero,” he says dryly. “Although I’m offended that you don’t think I can beat him up myself.” </p>\n<p>In the darkness, Jaskier can just about make out Eskel’s raised eyebrow. “Are you saying that you could?” </p>\n<p>“I could definitely write a very rude song about him,” Jaskier tries. </p>\n<p>Eskel snorts. “Go to sleep, bard,” he says. “We need to cover a lot of ground tomorrow, so you’ll need to be well-rested.” </p>\n<p>Jaskier shifts around until he’s back in his original position, back pressed to Eskel’s chest, Eskel’s arm thrown lazily across his waist. It’s strange, really, because he remembers cold nights like this with Geralt, remembers the way that Geralt’s touch would be oddly tentative, the way his breath would pause, stutter on the back of his neck, remembers the intimacy of the gesture, of the physicality – but now he’s in exactly the same position with Eskel, the witcher curled around him, flush to him in pretty much every way he can be, and it’s just… practical. Nothing more, nothing less. </p>\n<p>Jaskier closes his eyes, and tries not to think about Geralt. </p>\n<p> </p>\n<p>They stop in the next town they come across and spend pretty much all the money Jaskier has left. Eskel takes a handful of gold coins to buy as much food as Llwyd can carry, then Jaskier goes and spends pretty much everything he has left on warm clothes. A fur-lined cloak which is pleasantly practical <i>and</i> sharply stylish. A thick woollen jacket and dark woollen trousers. Full-length undergarments that stretch to the wrists and the ankle, which definitely aren’t good for seducing fair maidens but will probably keep him alive on the top of a snowy mountain. He’s midway through bartering for a pair of solid winter boots when Eskel shows up and tosses him a pair that he’s already bought. “These are cheaper <i>and</i> better quality,” he says, eyeing everything on the cobbler’s stall with disdain. “You got longjohns?” </p>\n<p>“<i>Yes</i>, I’ve got longjohns,” Jaskier answers. “I wouldn’t be seen dead in them, but I’ve got them.” </p>\n<p>Eskel snorts and pulls him away. “Come on,” he says. “One last night in an inn, hopefully where I <i>won’t</i> have to save you from getting kidnapped, and we’ll set out for the keep in the morning.” </p>\n<p>Despite everything, excitement starts to bubble up in Jaskier’s chest. “Kaer Morhen,” he says, almost dreamily. “Fuck, I can’t believe you’re actually taking me there.” </p>\n<p>“Blame my brother for that,” Eskel says, amused, and Jaskier tries his best not to flinch. “Although, to be honest, if I was him, I would have brought you there <i>years</i> ago.” </p>\n<p>Jaskier gives him an odd look. “You would have?” </p>\n<p>Eskel shrugs, hefting a bag of dried foodstuffs onto his shoulder. “You’re a part of his life, Jaskier,” he says, “even though he’s doing his best to ignore that. And I’ll be honest – you and your songs have made the last few decades easier for us. Even if some fuckers tend to take the whole <i>toss a coin </i>thing far too literally.” </p>\n<p>Jaskier stares at Eskel a moment longer. “I’ll say it again,” he says. “Why did I have to meet <i>Geralt</i>?” </p>\n<p>Eskel looks at him sideways, an odd light in his eyes. “I’d say it was Destiny,” he says softly, “if I didn’t know how badly Geralt tends to react to that word.” </p>\n<p>Jaskier flashes him a smile. “Thank you,” he says after a moment. </p>\n<p>“For what?” Eskel asks, head cocked to one side.</p>\n<p>“Saving me from Nilfgaardian torture,” Jaskier says, shrugging. “Protecting me. Offering me sanctuary in probably the most precious place in the world to you witchers. Letting me complain about Geralt as much as I want.” </p>\n<p>Eskel raises an eyebrow. “You really don’t complain about him that much.” </p>\n<p>“You know what I mean,” Jaskier says. </p>\n<p>“You saved my life, Jaskier,” Eskel says. “Really, honestly, truly saved my life. Found me bleeding out and unconscious in a fucking wyvern graveyard – and you’d never met me before, probably never even <i>heard</i> of me, given how fucking tight-lipped Geralt can be, but you stitched me up, got me to shelter, and saved my life. I don’t think you realise how much of a debt I owe you.” </p>\n<p>Jaskier blinks. “You don’t owe me anything.” </p>\n<p>Eskel just laughs, and strides ahead to the inn. </p>\n<p>They set off the next morning at practically the crack of dawn, Jaskier grumbling and rubbing sleep from his eyes, Eskel subdued and oddly taciturn. The path into the mountains is steep and winding from the get go, rocky and uneven under Jaskier’s boots, and within a few hours Eskel is on foot next to him, leading Llwyd by his reins. Jaskier’s sweating through his undershirt before long and he’s sure to let Eskel know, keeping up a rambling litany of complaints and observations about the foothills around them—“Is that a bear?” “Gods, when was the last time the local council came up here? This path needs some work.” “Is that a wolf?” “How am I supposed to compose when I’m trying not to trip over my feet every five minutes?” “Is that a snow leopard?”—but, for once, Eskel doesn’t push back. He offers the occasional remark, catches Jaskier by the back of his jacket when he’s about to stumble face-first into a tree, but for the most part, he’s as monosyllabic as Geralt. </p>\n<p>They stop for the night in the first of a series of bothies that’s scattered up the mountainside, and it’s cold, yes, but it’s not unbearable. They eat a meal of dried meat and the freshest bread they’re going to have until they reach the keep, and Jaskier studies Eskel, forehead furrowed. “Is something wrong?” he asks eventually, when the quiet has stretched between them for a few moments too long.</p>\n<p>Eskel glances up at him, offers him a tired smile. “I’ve been quiet today, I know,” he says. “Sorry. It’s not you, Jaskier. I’m just…” He shrugs, pulls his cloak tighter around his shoulders. “It’s been a long year,” he says eventually. “A lot’s happened – and this war…” He shakes his head. “Wintering at Kaer Morhen is when we go home,” he says. “It’s when we get a chance to recover from all the shit that’s been thrown at us during the year. But this year?” He shakes his head again, faster, tighter. “I’m getting the feeling that this winter is just going to make things more complicated.” </p>\n<p>Jaskier’s quiet for a moment. “I was starting to wonder if you were regretting bringing me with you.” </p>\n<p>Eskel flashes him a smile, reaches out and squeezes his shoulder. “Not everything’s about you, bard,” he says, eyes glinting with humour.</p>\n<p>Jaskier scoffs. “<i>Everything</i> is about me, thank you very much,” he says, and they spend the rest of the night in comfortable silence. </p>\n<p>The next few days pass in much the same way. Eskel’s quieter than usual but Jaskier doesn’t push him, just keeps up his usual constant stream of chatter and waits for him to start jibing back with his usual frequency. When it gets to the point that Eskel trips him into a thigh-high pile of rotting autumn leaves and mulch, it all seems pretty much back to normal – but then he’s covered in rotting leaves and mulch, so to be honest he probably preferred it before. He says as much, and Eskel just rolls his eyes and keeps on going up the trail.</p>\n<p>On the morning of the sixth day, Jaskier peers out of the bothy to find that the world has turned white overnight. He kicks at a drift of the soft, powdery snow, arms folded. “Isn’t this going to be a problem?” he asks, glancing back at Eskel.</p>\n<p>Eskel shakes his head. “We’ve done most of the climb,” he says. “From here, it’s pretty flat. Shouldn’t be too bad, as long as it’s not too icy – and given that this is the first serious snow we’ve encountered, it won’t have iced too much yet.”</p>\n<p>Jaskier studies the snow. “How much further?” </p>\n<p>“Three, maybe four more days.” </p>\n<p>Jaskier nods. The cold is seeped into his bones, now, thick and heavy, and he’s glad for the bloody longjohns Eskel made him buy. He wraps himself in as many clothes as he can manage, hood pulled up around his reddened ears and pinked cheeks, and follows in Eskel’s footprints. His lute case is heavy on his back, the boots are heavy around his feet, his head is heavy on his shoulders – and not that he’s going to say this, no, that would be ungrateful to the extreme given that Eskel’s saved him not once but twice, but, <i>fuck</i>, he’s starting to wish he’d just gone to hide out in Oxenfurt. </p>\n<p>Eskel’s hand lands on his shoulder, shakes him a little. “You good?” </p>\n<p>“Fucking brilliant,” Jaskier grinds out through gritted teeth. </p>\n<p>Eskel squeezes his shoulder, and lets go. </p>\n<p>Jaskier doesn’t remember much about those last few days up to the keep. It’s cold, and the path is a mess, and at points he’s so frozen he can’t feel his fingers. He’s pretty sure that Eskel ends up half-carrying him at one point, and he vaguely remembers a conversation that mainly consists of him shouting at Eskel for dragging him up this <i>godsdamned motherfucking arsebackwards bloody wanking mountain</i>, but for the most part, the only thing he really remembers afterwards is the front gate of the keep looming up in front of him, jagged and ragged against the deepening blue of the evening sky. </p>\n<p>“You made it,” Eskel says, hugging him tight against his side, breath frosting in the clear, cold air. “You hear me, Jaskier? We’re here.” </p>\n<p>Jaskier’s teeth are chattering so hard he can’t speak. </p>\n<p>Eskel leads him through the winding corridors of Kaer Morhen with the kind of unerring confidence that only comes from living somewhere for the formative years of your life. Jaskier follows behind, feet still a little numb but getting warmer, hands stripped of their gloves and held in front of his mouth, desperately trying to warm them with his breath – but then Eskel opens a door that leads into a small, surprisingly cosily furnished hall, and all of a sudden Jaskier is just hit by <i>warmth</i>. He makes a little groaning noise in the back of his throat, feels a startling urge to just hurl himself into that <i>roaring fire</i> burning in the grate in front of him – but comes up short, because the hall isn’t empty. </p>\n<p>“Vesemir,” Eskel says, almost as warm as the fire. </p>\n<p>The witcher sitting by the fire can only really be described as <i>grizzled</i>, hair a distinguished salt-and-pepper, skin weathered, eyes bright and wise. He looks up at their entrance, a ghost of a smile crossing his lips at the sight of Eskel – but then his gaze moves to Jaskier, and he frowns, inhales sharply. Understanding blooms in his eyes, and he shifts his attention back to Eskel. “You brought Geralt’s bard?” he asks, no greeting, no warmth. </p>\n<p>Jaskier’s too tired to protest at this point. </p>\n<p>Eskel explains the situation to Vesemir as Jaskier slumps down in front of the fire, closing his eyes as he bathes in the seeping, blazing warmth. His skin prickles with something close to pain as blood rushes back to his extremities, tingling his fingers and toes, sparking in his cheeks and the tip of his nose, and to be honest he doesn’t care if this Vesemir throws him in a bloody dungeon right now, as long as he doesn’t have to go back out into the cold. </p>\n<p>He’s vaguely aware that he’s swaying a little, but there’s a bearskin rug under his knees and a blazing hot fire in front of him so he doesn’t mind if he passes out a little. The world goes deliciously hazy around him and he slumps down further, runs his fingers through the fur, listens to the crackle of the fire and the whisper of voices behind him. He’s so fucking <i>tired</i>, and now here he is, at Kaer Morhen, at the witcher fortress, at Geralt’s home, and all he can think is <i>sleep</i>.</p>\n<p>Jaskier curls up on the bearskin rug in front of the fire, and sleeps.</p>\n<p>Jaskier wakes in a sparsely-furnished bedroom, curled up under a mound of blankets and furs with the distinctive smell of honeyed porridge wafting through the air around him. He doesn’t move for a long time, slowly feeling out the soreness in his limbs, the chapped dryness of his lips, the greasiness of his hair, then eventually sneaks an arm out from his nest of warmth to grab for the bowl of lukewarm porridge that’s been left next to the bed. He eats ravenously, his stomach already clamouring for more by the time the bowl is empty, then pushes himself up into a sitting position, groaning at the ache in his limbs as he does so, and studies the bedroom. It’s small, plain stone with an ochre-coloured tapestry stretched along one wall, a rough wooden table against another with a couple of empty shelves above it. His bag and lute case are stacked in one corner, his boots and his shoes lined up next to the door. </p>\n<p>Jaskier just sits there for a moment, fingers pushed into the fur thrown across his legs, and for the first time wonders what exactly he’s got himself into now. </p>\n<p>When he leaves his room, fur-lined cloak wrapped tight around his shoulders and hair raked into as much of a presentable mess as it can be, the corridors of Kaer Morhen are quiet and empty. When he glimpses the sky outside through a small window, it’s dark – but he has no idea what time it is, whether it’s early morning, late at night, whether he’s slept only a few hours or if he’s slept the whole day through. He also very quickly gets lost, wandering around the echoing stone corridors with little to no idea where he is or how to get back to the bedroom he woke up in, and he’s starting to get frustrated and more than a little worried when he rounds a corner and comes face to face with another witcher he doesn’t recognise. </p>\n<p>Jaskier stops in his tracks, fixed in place by familiar yellow-gold eyes in an unfamiliar face. “Uh, hi?” he says, voice a little hoarse, a little strangled. </p>\n<p>The stranger laughs in the back of his throat. “Jaskier, right?” he says, voice a deeply satisfying bass that rumbles in Jaskier’s bones. His cheekbones are sharp, the line of his jaw is slanting and strong. There’s a scar traced across one eye, and his hair is dark, cropped close to his head. </p>\n<p>“That’s me,” Jaskier answers, trying for bright and cheery. “And thanks for not going straight for <i>Geralt’s bard</i>, like everyone else.” </p>\n<p>“From what Eskel told me, Geralt’s fucked up enough that he’s lost his claim on you,” the stranger says, head tilted, gaze almost… assessing? Curious? Intrigued? Jaskier isn’t sure what the right word is, but he’s saved from having to figure it out. “I’m Lambert,” the stranger says, interrupting his train of thought. “And I’m guessing you’re lost?” </p>\n<p>“Not sure I’d use the word ‘lost’,” Jaskier says, smiling as brightly as he can. “ ‘Turned around’, maybe. ‘Confused’.”</p>\n<p>“Lost,” Lambert repeats, laughter dancing in his eyes. “Hungry?” </p>\n<p>Jaskier’s stomach growls its answer. “Very,” he answers, and follows Lambert down the corridor. “Ah, don’t suppose you know how long I was asleep for?” </p>\n<p>“A day or so,” Lambert answers. “I was about half a day behind you and Eskel, got here about midday. You’ve been asleep since last night, apparently.” </p>\n<p>“So it’s tomorrow night?”</p>\n<p>Lambert glances at him sideways. “You could say that.” </p>\n<p>Jaskier nods. “And I’m assuming I’m not getting kicked out yet?” he asks, voice squeaking a little too high because, well, he’s still half-convinced that that grizzled old witcher is going to grab him by the ear and toss him back out into the snow. </p>\n<p>“You’re good,” Lambert answers. “Eskel’s vouched for you, and for the danger you’re in. Plus, you’d probably die trying to get out of the mountains.” </p>\n<p>Jaskier smiles, a little wan. “I’ve stumbled my way down a hostile mountain before,” he says, pressing the hurt and the heartbreak down as far as he can. Dull pain sits cold in his gut, as ever. “Not going to lie, I’m glad I don’t have to do it again.” </p>\n<p>Lambert’s looking at him again, an expression caught across his scarred features that Jaskier still can’t identify. “In here,” is all he says, though, and pushes open the same door that Eskel lead him to yesterday. The hall is pretty much how he remembers, although the outlines are a little more solid today – probably because he’s actually managed to get some decent sleep that isn’t in a freezing cold bothy on the side of a damn mountain. Eskel glances up as they come in, raises a hand in greeting, and Vesemir’s sitting at the head of the table, expression inscrutable, so Jaskier should probably say something to him, a greeting, flattery, <i>something</i> – but there’s a pot of stew and a couple of loaves of fresh-baked bread sitting on the table and, fuck, the <i>smell</i>. </p>\n<p>Jaskier slides onto the bench next to Eskel, grabs a bowl, serves himself, and eats. </p>\n<p>Lambert laughs, settling across the table from them. “The bard got lost,” he says. “Found him wandering around near the armoury. We’re gonna have to put a leash on him or something.” </p>\n<p>Jaskier should object to that, but his mouth is currently full of mutton so he just makes an incoherently offended noise. </p>\n<p>“Keep your weird fetishes to yourself, Lambert,” Eskel says lazily, mopping up the remnants of his stew with a hunk of bread. He glances at Jaskier. “I’ll show you around tomorrow,” he says. “It’s not the easiest place to get around, but we’ll do what we can. We can draw you a map or something.” </p>\n<p>“No,” Vesemir says, his voice as gravelly and deep as his exterior suggests. Jaskier eyes him, trying not to look too suspicious, but there’s no aggression in his eyes. “I’ll show the bard what he needs to see. You two need to see to the eastern curtain wall: there’s some storm damage that’s too severe for me to fix alone. We’ll need it patched up before the blizzards set in.” </p>\n<p>Lambert glances up. “I thought Coën and Eskel fixed the eastern wall last winter?” he asks. </p>\n<p>“They did,” Vesemir agrees.</p>\n<p>Lambert shoots Eskel a wicked look. “Clearly not very well.” </p>\n<p>Eskel rolls his eyes. “We fixed the damage,” he says flatly, “but the wall’s, what, centuries old? And designed to be maintained by hundreds of witchers, not… well, four.”</p>\n<p>“Excuses, excuses…” </p>\n<p>Eskel throws a morsel of bread across the table and it bounces off Lambert’s head. </p>\n<p>“You’ll be expected to help out, bard,” Vesemir says, apparently quite content to ignore the fact that there’s a minor food fight brewing in front of him. “There’s no room for dead weight at Kaer Morhen in the winter.” Jaskier’s heart twists a little in his chest, but Vesemir’s expression is oddly… kindly? “But I do appreciate that you are human,” he says, the wrinkles deep around his golden eyes. “I won’t ask you to rebuild the eastern wall – although perhaps Lambert and Eskel could benefit from your intelligence.” </p>\n<p>Jaskier can’t help but snort a laugh. There are identical offended expressions on Lambert and Eskel’s faces, and he says, “It’s good to know that there’s at least one witcher here who can appreciate quality when he sees it.” </p>\n<p>Vesemir raises an eyebrow. “Don’t get ahead of yourself, bard,” he says wryly. “Show me how well you can muck out a stable and then I’ll judge your quality.” </p>\n<p>Jaskier wrinkles his nose, and Eskel barks a laugh. “Good luck with that, Vesemir,” he says. “He stepped in a bear’s shit on the way up the mountain and complained about it for two days.”</p>\n<p>Jaskier jabs him with his spoon. “Hey! I saved your <i>life</i>.” </p>\n<p>“And I stopped you getting kidnapped <i>twice</i>,” Eskel points out. “I figure that makes us just about even.” </p>\n<p>“It’s not <i>my</i> fault I was getting kidnapped!” Jaskier protests. </p>\n<p>“I mean, if you hadn’t gone to shag that guy in the stables, you would have been safe the second time,” Eskel points out, grabbing another piece of bread and smearing it with butter. “I get that the whole kidnapping situation is ultimately Geralt’s fault, but you could have done a <i>little</i> more to keep yourself out of harm’s way.” </p>\n<p>Jaskier shrugs. “I was coming to spend the winter at a witcher fortress,” he says lightly. “Figured I’d need one last roll in the hay before a season of celibacy. Not like there’s going to be much by way of anonymous encounters up in the mountains.” – and if the thought of Geralt crosses his mind at that, well, he puts it to one side. </p>\n<p>Eskel rolls his eyes. “Yeah, but did you need to take the whole <i>roll in the hay </i>thing so literally?”</p>\n<p>“Hay can be comfy.” </p>\n<p>“Do you regularly fuck strangers in stables?” Lambert asks, a lick of amusement in his voice. </p>\n<p>“Only when the occasion calls for it,” Jaskier answers, a little snooty. </p>\n<p>“Enough,” Vesemir says, only a little long-suffering. “I don’t want to hear about any of you fucking strangers in stables.” </p>\n<p>“Technically, Jaskier’s the only one who we know for sure has fucked a stranger in a stable,” Lambert points out. </p>\n<p>Jaskier takes Eskel’s lead and throws a lump of crust across the table at him. Lambert catches it out of the air before it hits him then pops it into his mouth, holding Jaskier’s gaze as he does so. There’s something in his eyes that Jaskier doesn’t expect, something almost <i>heated</i> – and Jaskier doesn’t know if it’s because he hasn’t had sex in way too long, if it’s because he’s tired and fractious and on edge, if it’s because he’s wanted golden eyes to look at him with hunger and lust for so many fucking years now, but an answering warmth kindles in his belly. </p>\n<p>He looks away, hands suddenly unsteady. </p>\n<p>Eskel walks him back to his room after they’ve eaten, and Jaskier doesn’t expect to be particularly sleepy given that he’s apparently just slept for a full day but he’s yawning already. “Breakfast will be in the small hall in the morning,” Eskel says, arms folded, pausing outside a door that Jaskier vaguely recognises. “Want me to grab you on the way? Or do you think you can find your way there?” </p>\n<p>“Should be able to find my way,” Jaskier says, flashing him a tired smile. “If I can navigate from Kaedwen to Novigrad without a map, I can probably figure out where to go in a draughty old witcher keep to get food.” </p>\n<p>“You are good at following your nose,” Eskel agrees. “Alright. Vesemir will probably come looking for you if you get too lost, so, you know. Maybe wear a bell.” </p>\n<p>Jaskier laughs. “Lambert wants to put a leash on me, you want me to wear a bell…” He shakes his head. “I’m learning things about witchers that I never really wanted to know.” </p>\n<p>“We both know you did,” Eskel says, light and teasing, but it hits harder than Jaskier expects. His smile slips, and he looks away. Eskel pauses, just for a second, then says, quieter, “Be careful, Jaskier.” </p>\n<p>Jaskier cocks his head. “What do you mean?” </p>\n<p>Eskel gives him a sharp look. “Don’t play the fool with me,” he says. “Firstly, I have <i>eyes</i>. Lambert wasn’t exactly subtle: he was looking at you across the table like you were… a piece of <i>meat</i>. Secondly, I’m a witcher, Jaskier – enhanced senses, remember? Your heart sped up, your pupils dilated, and I’m pretty sure I <i>smelled</i> you getting half-hard in your trousers.” His nose wrinkles. “Not something I particularly want to smell again, if I’m honest.” </p>\n<p>Jaskier flushes. “Are you going somewhere with this?” he says, crossing his arms defensively. </p>\n<p>Eskel sighs. “I’m just asking you to be careful,” he says. “Lambert is my brother, yeah, but he’s not exactly the… romantic type. He doesn’t want to wine and dine you, bard. What he wants…” He trails off, sighs again. “It starts with ‘f’ and rhymes with what Vesemir wants you to do to the stables.” </p>\n<p>Jaskier feels a slow smile spreading across his face. “You’re <i>worried</i> about me,” he says, almost wondering. “You are, aren’t you? You don’t want me to get hurt.” </p>\n<p>“Geralt’s already fucked you over once,” Eskel says flatly. “And you start smelling all bitter and sour when you think about him, so forgive me if I don’t want to have to spend all winter with you smelling like that around <i>Lambert</i> as well.” </p>\n<p>Jaskier presses his lips tight, glances down at the floor. “You do realise that once Geralt gets here, you’re probably going to be smelling that pretty often anyway?” he says softly. </p>\n<p>Eskel huffs out a sharp breath through his nose. “Yeah,” he says. “Yeah, I figured. But I also figured that I can just beat the shit out of Geralt to make myself feel better. I’d rather not have to beat up <i>two</i> of my brothers.”</p>\n<p>Jaskier laughs quietly. “Don’t worry, Eskel,” he says. “I’m not about to go falling in love with Lambert.” His lips twist. “I think that boat has… pretty conclusively sailed for me.” </p>\n<p>“Fuck, Jaskier…”</p>\n<p>Jaskier forces a smile, reaches out and squeezes Eskel’s shoulder. “You don’t have to worry about me,” he says. “I appreciate that you <i>do</i>, but you don’t need to. You witchers might be the experts in monsters and mayhem, but I’m a dab hand at dealing with a broken heart.” </p>\n<p>Eskel sighs. “I knew I shouldn’t have brought a bard to Kaer Morhen,” he mutters. “You’re really fucking with the equilibrium of the place.” </p>\n<p>“You can blame Geralt for that one,” Jaskier says, and smiles despite the sudden stab of pain in his heart. </p>\n<p>Eskel studies him flatly. “Just… be careful,” he says again, after a moment. “And please don’t make me hate <i>another</i> one of my brothers.” </p>\n<p>Jaskier frowns. “You don’t hate Geralt, Eskel.”</p>\n<p>“Maybe not,” Eskel mutters. “But I do want to smack him around the head.” </p>\n<p>“Don’t we all,” Jaskier says, bright and cheery. “I’ll see you tomorrow, Eskel.” </p>\n<p>“Night, Jaskier,” Eskel says, and leaves him to it. </p>\n<p>Jaskier clambers back into the pile of blankets and furs that he only left a few hours ago, nestles himself into the softness and the warmth, and closes his eyes. He doesn’t sleep for a long while, despite his tiredness, just lies there in relative comfort breathing soft and slow, thinking about the spark in Lambert’s eyes and the fury in Geralt’s the last time he saw him. </p>\n<p> </p>\n<p>Jaskier manages to find his way to the small hall without too much incident in the morning. Breakfast is more of the honeyed porridge he woke up to yesterday, and it’s even better when he’s alert enough to actually taste it. He groans and moans as he makes his way through a second bowl, forgetting that these particular witchers aren’t entirely familiar with his specific brand of theatrics, and then looks up to find all three of them staring at him with varying levels of surprise in their identical golden eyes. </p>\n<p>“Sorry,” he mutters around his last mouthful, and washes the whole thing down with a glass of milk. </p>\n<p>If he’s being honest with himself, the look in Lambert’s eyes is actually less surprise and more, well, <i>anticipation</i>, but Jaskier’s not going to think about the implications of that. </p>\n<p>Vesemir holds true to his promise and spends the morning showing him the keep. The halls, the armoury, the kitchens, the library—oh, Jaskier’s eyes practically bulge out of his <i>head</i> when he sees the library—the training ground, the bedchambers, the bathhouse—<i>the bathhouse!</i>—the stables, the granary, the storage rooms, and round and round and round, more and more that he tries desperately and unsuccessfully to cram into his head. </p>\n<p>Vesemir laughs at his astonishment. “This keep is the product of a millennia of witchers,” he says. “You can’t expect to learn its ways in a morning, bard.” </p>\n<p>“I can try,” Jaskier remarks, but he knows he’s out of his depth.</p>\n<p>“Keep to the area around the small hall and the training ground,” Vesemir says. “That’s where we’ll spend most of our time – the bedrooms are all in that area, too. If you’re confident finding some of the more out of the way areas, the library, the bathhouse, you’re welcome to use them – but be warned that you may get lost, and there might not be anyone around to help you find your way.” </p>\n<p>Jaskier wants to say something about how right now, he’d be happy to literally never be found again in these meandering halls if it meant he could wash his fucking hair, but he figures that’s probably not the kind of thing Vesemir wants to hear, so he just nods. “I understand.”</p>\n<p>“Good,” Vesemir says, his eyes bright like he knows exactly what Jaskier’s not telling him. “Come with me.” </p>\n<p>Vesemir takes him to the eastern curtain wall, where Eskel and Lambert are already toiling away, clearing debris away from the sizeable gap that’s been knocked in the old stones by the trunk of a thirty metre high pine tree. Jaskier blinks at the scope of the damage, waves briefly to the other witchers, then follows Vesemir up the narrow flight of stairs that leads to the top of the wall. “How long will it take them to fix this?” he asks on the way up, keeping one hand against the wall for balance. </p>\n<p>“A few days at least,” Vesemir answers. “It’ll be quicker once the others arrive.” </p>\n<p>“How many others will come?” </p>\n<p>“Most likely only two more,” Vesemir answers. “Coën, and Geralt, of course.” </p>\n<p>Jaskier ignores the pull in his heart at Geralt’s name, and just nods. “You said it was a storm that did that?” </p>\n<p>“I did,” Vesemir says, reaching the top of the wall. He turns around, offers Jaskier a hand for the last few feet where the steps are worn smooth as glass – and hauls him up alongside him. “Now hush, bard. I know you like to talk, but there are places where talking isn’t necessary.” </p>\n<p>Jaskier would usually vehemently disagree with that statement, but all of a sudden his words are stolen away.</p>\n<p>The eastern curtain wall stands at the head of a long, snowy glen, nestled in the heart of the mountains all around. It’s a cold, clear day, the sky blue over last night’s heavy snowfall, and for a long, long moment Jaskier just stands there, looking out over the world, the pine forests, the loch gleaming through the distant trees, the winding mountain trails that pick their way through the landscape. The mountains rear high on either side, purple-headed, wreathed in snow, and it’s quiet, so quiet, broken only by the call of the kites circling overhead and the dull grinding of stone down below. </p>\n<p>Jaskier can’t quite breathe. </p>\n<p>“I want you to understand what this place is, bard,” Vesemir says softly. “Kaer Morhen is not just a place for witchers to spend the winter, to throw food at each other in the small hall and bicker over imagined slights – although I warn you, there will be a lot of that. Kaer Morhen is—”</p>\n<p>“Sanctuary,” Jaskier interrupts, gaze still fixed on the sheer beauty of the vista sprawled out before him. “Safety. A moment to catch your breath and just… exist.” </p>\n<p>Vesemir hums. “Ah, you <i>are</i> a poet.” </p>\n<p>Jaskier licks his lips. “Would you allow me to sing of this place?” he asks, his voice oddly hoarse. “I understand that that might not be appropriate, and of course I’ll hold my tongue if that’s what you wish, my lord witcher, but it would be my genuine honour to sing of… <i>this</i>.” He gestures broadly, encompassing the landscape, the keep, the witchers below, the home behind them, all of it. </p>\n<p>Vesemir studies him. “Write your songs, bard,” he says. “But only sing them here.” </p>\n<p>Jaskier nods. “Thank you,” he says, his fingers itching for his lute. “<i>Thank you</i>.” </p>\n<p>“You are a strange one,” Vesemir says, an amused slant to his lips. </p>\n<p>Jaskier shrugs. “It’s been said,” he answers, still not quite able to take his eyes off the glen that rolls out from beneath his feet. “Can I stay here for a while?” </p>\n<p>Vesemir’s hand lands on his shoulder, squeezes briefly. “You can come back later,” he says, a little firmer. “For now, there are other things I need to show you.” </p>\n<p>The yearning that settles deep in Jaskier’s chest is almost strong enough to make him forget the pain in his heart. He goes with Vesemir, learns the rest of the ways of the keep, gets shown how to muck out a stable, mucks out a stable very badly under Vesemir’s unimpressed gaze, but when the day is done, when Vesemir lets him go with an hour or so to go before the evening meal, he goes to his room, grabs his lute, and goes straight to the eastern curtain wall. Eskel and Lambert have disappeared so the world is dead silent, now, only the whisper of the wind and the creak of the old stones – and Jaskier clambers up to the top of the wall, sits on the edge, boots dangling off into the sheer drop below, and watches. </p>\n<p>He watches the sun sink below the horizon, painting the clear sky in golds and oranges and reds and pinks, warm colours that slowly slide into the inky velvet blue of night. He watches the stars come out, pinpricks of brightness in the dark, and then the moon rises into the heavens, shining white, casting its eerie glow across the glens and the mountaintops below. There’s a peculiar shine to the world, Jaskier sees with eyes that are somehow wet with tears, a glimmer that the moon casts across the snow, the trees, the water of the loch, and he sits there with his lute in his lap, fingers unmoving, and lets the mountains fill him with their splendour.</p>\n<p>The wind whispers gently against the taught strings, teasing a quietly musical rustle out into the night. </p>\n<p>The moon is high in the sky when he hears soft footsteps behind him. He glances back over his shoulder, sees Eskel climbing up the narrow stairs with inimitable witcher grace, a bowl in one hand and a tankard in the other. He takes a seat next to Jaskier, offers him the bowl which is full of some kind of pottage, thick and hearty. “You missed dinner,” he says, eyebrow raised. </p>\n<p>Jaskier realises that he must have been up here for much, much longer than he intended. “Ah, bollocks,” he says, suddenly feeling the gnaw of hunger in his stomach. He slings his lute onto his back and accepts the bowl. “Sorry. Time must have got away from me.” </p>\n<p>Eskel hums and looks out across the glen below them. “Don’t worry about it,” he says. “Vesemir knew where you were, said we’d leave you to it.” He pauses, then bumps his shoulder lightly against Jaskier’s. “I think Lambert missed having someone to ogle, though.”</p>\n<p>Jaskier snorts as he spoons down the pottage. “I’m sure he’ll survive,” he says, taking the tankard out of Eskel’s hand and drinking a mouthful. “Besides, if he wants to bed me, he’ll have to work for it.” </p>\n<p>“Fuck’s <i>sake</i>, Jaskier.” </p>\n<p>Jaskier shrugs. “You were the one who brought it up.” </p>\n<p>They sit in silence for a while as Jaskier eats, Eskel taking the occasional sip of his ale, the wind still humming its whisper across the exposed strings of his lute. It’s companionable, it’s easy, and it twists Jaskier’s heart in his chest. He pauses halfway through the bowl, lowers it to his lap, and feels tears sting at the back of his eyes, blurring his vision, just a little. </p>\n<p>“Jaskier?” Eskel asks quietly. </p>\n<p>“Don’t be offended by this,” Jaskier says, barely more than a whisper, “but I really fucking wish you weren’t the one who brought me here.” </p>\n<p>Eskel’s head dips. “Geralt.” </p>\n<p>“Geralt of fucking Rivia,” Jaskier sighs, shaking his head. “I pine after the man for twenty godsdamned years. He breaks my godsdamned heart. And then I run into <i>you</i>, you bastard, and you’re noble and friendly and you can <i>hold a conversation</i> and you aren’t afraid to give a shit about me – and you bring me <i>here</i>, to <i>this</i>.” There are tears on his cheeks, now, freezing in the frozen air. “And all I can fucking think is how I wish you were <i>him</i>.” </p>\n<p>Eskel’s quiet for a moment. “Talk to him,” he says eventually. “When he gets here, and he will, talk to him, Jaskier.”</p>\n<p>“And say what, exactly?” Jaskier scoffs. “He made his feelings <i>perfectly</i> clear on the matter.” </p>\n<p>“You don’t lose anything by talking to him.”</p>\n<p>“That’s very true,” Jaskier agrees, feverbright. “He’s already taken everything, anyway.” </p>\n<p>Eskel sighs. “Fuck,” he says, resigned. “He really did a number on you, didn’t he?” </p>\n<p>Jaskier wipes his eyes with his sleeve, doing his best to ignore the tremble in his fingers. “Unfortunately, yes.” </p>\n<p>Eskel slings his arm around Jaskier’s shoulders, careful to avoid his lute, and pulls him into the side of his chest. “Eat the pottage,” he says, rough around the edges but still achingly kind. “I’d like to be able to say it’s magical pottage that’ll fix everything, but that would be a lie. It’s food, though, and you haven’t eaten properly since midday. Food will help.” </p>\n<p>Jaskier looks down at the bowl in his lap, and does as he’s told. It’s not as good as yesterday’s stew but it’s still more than edible, and Eskel’s right. It helps, and when he’s finished it he puts the bowl to one side, finishes the ale, then folds his hands in his lap and sighs. “Sorry,” he says. “You didn’t sign up for all the dramatics.”</p>\n<p>Eskel hums. “I knew what I was signing up for when I decided to make friends with a bard,” he says wryly, his arm still heavy around Jaskier’s shoulders. “And you’re really not that bad, Jaskier. You haven’t threatened to throw yourself off the wall yet.” </p>\n<p>“Do you want me to threaten to throw myself off the wall?”</p>\n<p>Eskel barks a laugh. “Not really,” he says. “Now come on. You haven’t actually washed since you got here, have you? Let’s get you a bath, and then get you to bed – <i>without</i> Lambert.” Jaskier laughs, the sound a little wet. “You’ll feel better in the morning.”</p>\n<p>Jaskier looks out at the moonlight mountains one last time, feels the serenity of the landscape soothe the gaping wound in his heart, and sighs. “A bath does sound good,” he says, and tugs at a stray lock of his hair. “Will you wash my hair for me?”</p>\n<p>Eskel snorts. “Wash your own fucking hair, bard,” he says, unhooking his arm from around Jaskier’s shoulders. “I’m not your damn manservant.” </p>\n<p>“Pity,” Jaskier sighs. “You’d make a very dashing manservant.” </p>\n<p>“Fuck off.” </p>\n<p>“Draw me a bath and I will.” </p>\n<p>“I will push you off this mountain.” </p>\n<p>“Vesemir would yell at you if you did.” </p>\n<p>Eskel rolls his eyes. “I regret ever meeting you,” he says, warm with affection. </p>\n<p>“No, you don’t,” Jaskier says faux-brightly. “I’m a <i>delight</i>.” </p>\n<p> </p>\n<p>The days settle into a routine surprisingly quickly. The witchers spend most of their time hard at work repairing the eastern wall, and Jaskier does the menial tasks around the keep that Vesemir tosses to him: taking care of the horses, preparing meals, sweeping the dirt and dust out of disused rooms, a dozen other tiny tasks that fill up his days and keep him busy. He comes up to the eastern wall most nights after the work has finished for the day, sits at the top and plucks a new song from the strings of his lute, mumbling words under his breath, testing out rhythms and rhymes, and it’s taking shape but it’s still nowhere near good enough. Eskel joins him sometimes, shares an ale and some good humoured conversation, and Vesemir spends an hour or so with him one evening, standing beside him in silence, the Old Wolf in his mountain fortress. </p>\n<p>Jaskier writes a whole new verse about <i>that</i>. </p>\n<p>And then there’s Lambert, of course, who looks at Jaskier with interest in his eyes and only gets bolder with every passing day. He sits next to him at meals, thigh pressed hard and muscled against Jaskier’s, cracks dirty jokes that somehow aren’t quite jokes, squeezes his shoulder with a light in his eyes that’s just the wrong side of comradely. It’s not disrespectful, no, and if Jaskier’s being honest with himself, the attention isn’t unwanted. It’s just… strange, to be so obviously wanted like that by a witcher. It’s not what he’s used to. </p>\n<p>Eskel just rolls his eyes and keeps on throwing bread at Lambert across the table. </p>\n<p>The fourth witcher arrives a few days later, appearing out of the dimness of a swirling snowstorm like something out of a fairytale. Jaskier’s with the horses when he arrives, feeding Llwyd slices of dried apples that he snuck out of the pantry, and he watches as this new arrival—Coën, he’s assuming—dismounts and leads his horse into the stables. He pushes his hood back, eyeing Jaskier with those oh-so-familiar golden eyes, and says, “You’re Jaskier the bard.”</p>\n<p>Jaskier’s momentarily surprised. “I am,” he answers. “And I’m assuming you’re Coën?”</p>\n<p>Coën nods. “I saw you perform at the midsummer festival in Novigrad a few years ago,” he says, pulling off his gloves with his teeth, running long fingers down his mare’s dun nose. Jaskier offers him a slice of apple and he takes it, feeds it to his horse. “You beat that Marx fella in the final round and he stormed off-stage screaming at you.” </p>\n<p>Jaskier snorts. “Valdo likes to cause a scene,” he says. </p>\n<p>“Your music’s good, I like it,” Coën says, then cocks his head. “Did Geralt finally get the balls to bring you here for the winter, then?” </p>\n<p>Jaskier’s getting pretty good at hiding his slipping smile whenever Geralt comes up in conversation. “Eskel did, actually,” he says. “It’s a whole story.” He holds out his hand. “Give me her reins, I’ll get her settled. You head in, get something to eat. It’s nasty out there.” </p>\n<p>Coën nods, still studying him with that peculiar witcher keenness, and hands him the reins. “Thanks, bard,” he says, and disappears into the snowy wildness of Kaer Morhen. </p>\n<p>Jaskier stands there for a moment, holding the reins of Coën’s horse, and tries not to think about how being called <i>Jaskier the bard</i> instead of <i>Geralt’s bard</i> is simultaneously a relief and somehow a disappointment. </p>\n<p>Coën, as it turns out, is surprisingly interested in music, and one night a few days after his arrival Jaskier ends up having a lengthy conversation with him over dinner about the importance of comparative historiography in songwriting. Vesemir interjects occasionally on a finer point of mythology or creature biology, and somehow the three of them end up taking an after-dinner trip to the library to go through some of the older witcher texts in search of parallels for the monsters described in an obscure Kaedwenian ballad that Jaskier learned one term at Oxenfurt. It’s particularly pertinent because the ballad’s proem states quite definitively that it was written after an encounter with a witcher who Vesemir has actually heard of, but the monster in question doesn’t sound like anything either Vesemir or Coën have come across before. </p>\n<p>“But then again,” Vesemir says, frowning, “it’s an old ballad, and mutation and adaptation have wreaked havoc with the older creatures’ bloodlines.” </p>\n<p>Eskel and Lambert just stare at them like they’re mad, then announce that they’re going to stay in the small hall and get drunk to celebrate the end of the construction work on the eastern wall. </p>\n<p>After a really pretty interesting hour or so in the library, poring over dusty old books and getting precisely nowhere in their inquiries but having a fascinating time doing so, Vesemir sits back and announces that that’s probably enough history for one night. “Go join the others in their celebrations,” he says. “I’ll see you both in the morning.” </p>\n<p>Coën laughs. “They’re probably both already pissed by now,” he says, then flashes Jaskier a smile. “Want to go see how much witchers can drink, bard? That’ll be another song for you.” </p>\n<p>They tread the corridors of the keep together, engrossed in companionable conversation about the annual midsummer festival in Novigrad and the rise and fall of Valdo Marx. When they get back to the small hall, the stink of alcohol hits Jaskier the moment they open the door. He wrinkles his nose, says, “What is <i>that</i>?”, but doesn’t have much of a chance to get his bearings because a glass of something that burns his throat like <i>dragonfire</i> is being shoved into his hand and, well, it looks like he’s got some catching up to do. </p>\n<p>Jaskier gets drunk with a bunch of witchers, which, in retrospect, was never going to end well. </p>\n<p>Somewhere between that first glass of what he thinks is supposed to be vodka and the moment that Eskel upends the bottle over his mouth and nothing comes out, Coën loses his shirt to the fire, Lambert breaks a bench by sitting on it, and Jaskier manages to persuade Eskel to let him braid his hair. It’s too short to be as satisfying as it would be to braid Geralt’s hair, of course, and Jaskier says as much, but then he points out that Geralt is a fucking idiot who wouldn’t know a good thing if it hit him in the face – which makes Coën snort so hard he sprays vodka out of his nose. Lambert comes and physically separates Jaskier from Eskel eventually, bodily carrying him to the bench next to the fire, sprawling them out together, Jaskier’s leg kicked out across his lap, and he sits with his palm pressed flat and warm to Jaskier’s inner thigh as he continues to argue with Coën about the best way to distract a bruxa. </p>\n<p>Eskel sits in an old armchair opposite them, feet propped up on the now-empty barrel of ale they got through with dinner, and meets Jaskier’s gaze, surprisingly coherent given how much he’s drunk. Jaskier knows what the look means—<i>You sure, bard?</i>—and he nods, smiles as soberly he can. </p>\n<p>Lambert laughs at something Coën says, sharp and bright, and his fingers squeeze Jaskier’s thigh with a confidence that feels like a promise. </p>\n<p>The braids are unravelling from Eskel’s hair when they run out of vodka, and he sighs, peers into the empty bottle. “Might be time to call it a night,” he slurs, blinking heavier than usual, and hoists himself to his feet. He sways a little, catches himself against Jaskier’s shoulder, then makes a disconcerted noise. “Ah, shit, Vesemir’s gonna want us to start drills in the morning, isn’t he?” </p>\n<p>Coën barks a laugh. “Don’t worry about it,” he says. “At least you’ll have an excuse for when you lose.” </p>\n<p>Eskel kicks him, but it’s uncoordinated and the blow doesn’t really land. “I’m going to bed,” he says pointedly. “You should do the same before you end up throwing the rest of your clothes in the fucking fire, Coën.” </p>\n<p>“He has a point,” Lambert rumbles, golden-yellow eyes bright and dancing in the light of the fire. </p>\n<p>Coën grumbles something under his breath but follows Eskel out of the small hall nonetheless, catching himself on the doorframe and cursing at the cold air outside. The last thing Jaskier sees before the door slams shut is Coën breaking into a run, making a dash for the warmth of his room as Eskel howls his laughter to the moon – and then the door’s shut, and it’s just him and Lambert, basking in the heat of the fire. </p>\n<p>Lambert’s fingertips press into the soft flesh of his inner thigh. “I’ve got a bottle of brandy in my room,” he says, head tilted. “If you want.” </p>\n<p>Jaskier smiles a smile he’s worn a hundred times before, a warm smile, an easy smile, a smile that says <i>yes, please</i> more than his words ever could. “Sounds good,” he says, and sees an echoing smile curling Lambert’s lips. </p>\n<p>Lambert’s room is larger than Jaskier’s, scattered with years’ worth of trophies and prizes and memories, skins hanging from the walls, elaborately-woven rugs strewn across the floor. There’s a small cabinet in one corner, carefully carved with a repeating wolf motif, the wood polished to a shine by soft rags and the passage of the years. Lambert retrieves the promised bottle of brandy and two glasses from inside, pours a couple of measures and knocks his own back straightaway. “It was part of my payment for a job a few years ago,” he says, dangling Jaskier’s glass in his hand. “Some lord who was a lot more hard up than he wanted to admit.” He shrugs. “It’s good shit.” </p>\n<p>“I’ll be the judge of that,” Jaskier says, eyebrow raised, and reaches for the glass.</p>\n<p>Lambert bats his hand away. “Come here,” he says, voice dropping lower, rougher, and Jaskier feels his heart thudding faster as he obeys. Lambert tilts Jaskier’s head back with his free hand and raises the glass to his mouth, tips the brandy between his lips and catches a stray droplet with the pad of his thumb – and Jaskier’s fingers flutter to rest around his wrists as he drinks, not stopping, not pausing, just touching because that’s what he wants, that’s what he <i>needs</i>. </p>\n<p>The glass is empty, and Lambert puts it down on the cabinet behind him with a soft clink. </p>\n<p>Jaskier isn’t sure who instigates it but all of a sudden they’re kissing, hard and fierce, Lambert’s tongue in his mouth and Lambert’s arms around his waist, hands big and heavy, tugging him closer. Jaskier’s drunk enough that his balance is a little off, and when Lambert takes a step forward, guiding them back towards the bed, he stumbles over his own feet. Lambert catches him with a laugh, kisses him again, deep and sensual, and his hands feel <i>so fucking good</i> against Jaskier’s overheated skin. “Tell me, bard,” he murmurs, nosing against the arch of Jaskier’s throat. “Do you want me to fuck you?” </p>\n<p>Jaskier’s breath stutters in his throat and his gut twists, suddenly painful. </p>\n<p>Lambert stills, pulls back. “Jaskier?” he asks, concern trumping lust and alcohol. </p>\n<p>Jaskier can’t quite meet his gaze. “I’m sorry,” he says, because yeah, okay, he’s drunk and there’s a golden-eyed witcher in his arms asking oh so politely to take him apart and make him scream – but this isn’t right. “I’m sorry, Lambert,” he says again, heart beating so hard it feels like it’s practically vibrating. “I can’t do this. It isn’t fair on you.”</p>\n<p>Lambert loosens his grip but doesn’t move away. “What isn’t fair on me?” </p>\n<p>Jaskier’s heart hurts. “I don’t want <i>you</i>,” he says bitterly, then pauses, rephrases: “It’s not that I don’t <i>want</i> you, don’t get me wrong, I’d really quite like you to fuck me senseless right now – but you’re not the one that I…” He falters, can’t quite bring himself to say the words. </p>\n<p>Lambert’s smile is surprisingly soft. “I don’t need you to love me to spend the night with me,” he says, leans forward slowly enough that Jaskier can back away if he wants to, catches his lips in a kiss. “Hell, it’ll make a nice change for <i>both</i> of us to be thinking about someone else during sex.” Jaskier looks at him sharply, surprised, and for the first time sees a ghost of heartbreak in Lambert’s eyes, too. Lambert smiles, brushes a stray tear off Jaskier’s cheek. “It’s Geralt, isn’t it?” </p>\n<p>Jaskier closes his eyes, nods. </p>\n<p>“I wondered,” Lambert says, tilts Jaskier’s chin up with his fingertips, kisses him slowly, searchingly. “You don’t have to,” he whispers, pressing kisses to Jaskier’s throat. “Just say the word and I’ll stop, no hard feelings. But all I want is to make you feel good.” He laughs, hoarse and throaty. “And to fuck that perfect arse of yours so hard you won’t be able to walk properly tomorrow, but that’s negotiable.” </p>\n<p>Jaskier groans, head falling back. “Are you sure?” he asks, breathless. </p>\n<p>“Very,” Lambert murmurs against the skin of his throat. </p>\n<p>Jaskier brings his hand up, runs his fingertips over Lambert’s close-cropped hair, all of a sudden needing to ask. “Who is it?” </p>\n<p>Lambert pauses, just for a moment, then straightens up and sighs. “No one you’d know,” he says, his words a whisper against Jaskier’s lips. “And the others, they don’t know. So I’d appreciate it if you kept this to yourself.”</p>\n<p>Jaskier kisses him. “Of course,” he whispers, as honest as he can manage, then kisses him again harder, presses closer, feels the hitch in Lambert’s breathing and the slow pound of his heart. “I have to say, I’m interested to see how you plan to fuck me so hard I can’t walk,” he says, breathy and a little drunk, full of the companionship of shared suffering. “I warn you, I’m very resilient.” </p>\n<p>Lambert’s laugh is halfway to a snarl. “You’ve never been fucked by a witcher before,” he says. “More to the point, you’ve never been fucked by <i>me</i> before.” </p>\n<p>“Promises, promises,” Jaskier murmurs, digging his fingernails into Lambert’s shoulders, and kisses him with all the ferocity he can manage. </p>\n<p> </p>\n<p>They gather at the training ground the next morning bright and early, the sun just beginning to top the walls of the keep, painting the old stones in brilliance. Jaskier’s exhausted and hungover, his body sore and, okay, yeah, his gait <i>is</i> a little off – but at least he doesn’t have to jump and leap and parry under Vesemir’s merciless gaze, no, he gets to sit by the side with a large bowl of porridge and offer helpful commentary. He laughs when Eskel has to take a break to go vomit in the corner, but he offers him a waterskin in recompense so, really, he’s a saint. </p>\n<p>Eskel grabs the skin from him and rinses out his mouth, spits onto the stony ground. “Fuck, Jaskier,” he says. “Take a <i>bath</i>. You stink of sex and Lambert, which is <i>not</i> a combination I particularly want to be exposed to.” </p>\n<p>Jaskier shrugs, eats a spoonful of porridge. “And miss all this?” he says, gesturing to where a hungover Coën has just fallen on his arse for the second time. “Never. I’m going to write a song about witchers who can’t handle their vodka. It’ll be my best composition yet. I can’t just <i>leave</i> because you want me to have a <i>bath</i>.” </p>\n<p>Eskel smacks the back of his head lightly and drops the waterskin in his lap. “Just say that you’re too hungover to move and be done with it.” </p>\n<p>Jaskier waves a finger at him. “It’s <i>also</i> because my body aches all over from the sex.” </p>\n<p>Eskel groans. “<i>Don’t</i> tell me that.” </p>\n<p>Jaskier stretches out in his seat, bowl of porridge propped on his belly, fur-lined cloak tucked tight and warm around his ears. “There was <i>a lot</i> of sex,” he says, grinning broadly. “Me and Lambert. All night. <i>Sex</i>.” </p>\n<p>“I’m gonna throw up again,” Eskel mutters, and goes back to Vesemir’s drills. </p>\n<p>Jaskier doesn’t actually spend the rest of his day sitting there, watching the witchers work off their hangovers. He finishes his porridge then takes his bowl through into the keep’s kitchens, tidies up after the mess of breakfast, then notes that the stock of coal and logs for the fire is running low so takes a trip to one of the outside stores to replenish it. He whiles away the morning like that, rebuilding the fire in the small hall, cleaning the dead leaves out of one of the southerly courtyards, then stops by the training ground again, cloak tossed back over his shoulders. “You know,” he remarks, as Coën pauses to catch his breath, “I’m starting to feel like you witchers think I’m a bloody skivvy or something.”</p>\n<p>Coën snorts. “Lambert thinks you’re a <i>fuckable</i> skivvy, if that helps.” </p>\n<p>Jaskier rolls his eyes and goes to get something to eat for lunch. </p>\n<p>He goes back to the training ground in the afternoon, perches on a low wall with his lute and strums jaunty tunes as the witchers hone their skills against their brothers, last night’s excesses long since burned away, light and nimble on their feet, their fighting more like dancing in the cool winter light. He doesn’t watch any of them in particular, just absently studying the patterns of their movements like he’d gaze at ripples in a pond, then starts plucking the chords of the song he works on when he sits on the eastern wall, words about fate and sanctuary and hope sitting silent at the back of his tongue. It’s a very particular focus that he gets when he’s composing like this, intense and narrow to the exclusion of pretty much everything else, and he’s deep in that focus, now, his eyes following the witchers’ pirouettes and parries even as his mind is elsewhere, in the pine forests, in the lochs, in the purple mountains and the achingly empty skies. </p>\n<p>That’s probably why he doesn’t notice the footsteps until it’s too late. </p>\n<p>“<i>Geralt!</i>” Coën calls, full of warmth and welcome, and Jaskier feels the bottom drop out of his stomach. </p>\n<p>His fingers spasm so tight around the neck of his lute that he hears the wood creak, and he half-notices Eskel’s worried glance in his direction but it’s not exactly what he’s focusing on, no, it’s not what he’s focusing on <i>at all</i> because there he is. Geralt of fucking Rivia, tall and travel-worn, saddlebags thrown over his shoulder, swords on his back, a weary expression creasing his forehead and a young girl’s hand held tight in his. Geralt hasn’t seen him. He’s greeting Coën and then Vesemir, introducing them to the girl at his side—ash-blond hair, blazing green eyes, skin so pale it’s barely a shade darker than the snow—and for a panicked second all Jaskier can think is <i>run</i> – but then Geralt’s gaze moves, slides to Lambert and Eskel, standing a little further away, and then those golden eyes flicker once more and, well, there it is. </p>\n<p>A stunned expression unfurls across Geralt’s face. “What the fuck is he doing here?” he snaps, rage and bitterness in his voice – and any tiny, fleeting hope that Jaskier might have nursed deep in the depths of his heart is abruptly snuffed out like a candle in a hurricane. </p>\n<p>He hears Eskel snap something at Geralt, the words too hazy to make out, but that’s okay, that’s alright. Jaskier gets to his feet slowly, carefully, every movement sort of feeling like it’s something out of a dream, and sets the strap of his lute carefully across his shoulder. He crosses the training ground on light feet, presses a reassuring touch to Eskel’s wrist as he passes, doesn’t look at Geralt, <i>doesn’t look at Geralt</i>, crosses the training ground and goes to one knee in front of the young girl with dirty blond hair and a haunted look in her eyes. “Princess Cirilla,” he says, quiet and gentle. “Do you remember me?” </p>\n<p>The girl studies him for a moment, tiredness written in the lines of her forehead, and then recognition blooms across her expression. “You sang at my grandmother’s court,” he says, reaching out to touch the strings of his lute. “Your name is Jaskier.” </p>\n<p>“That’s right,” Jaskier says, and offers her his hand. “It’s good to see you again, princess. You must be hungry after that journey. The food’s not exactly fit for royalty here, but it’ll fill you up. Want to come with me and get something to eat?” </p>\n<p>The princess studies him for a moment, then places her hand in his and nods. “Call me Ciri,” she says, that Cintran regality still strong and clear in her voice. </p>\n<p>“Ciri,” Jaskier repeats, and nods his respect. His hands aren’t shaking, his hearing is clear and sharp, his voice is smooth. “I’m glad you’re here, Ciri. Now, tell me: what do you like to eat?” </p>\n<p>Jaskier’s vaguely aware that Eskel’s grabbed Geralt by the arm and pulled him away, that they’re deep in a quiet, angry conversation that he’s choosing not to listen to, but Ciri’s looking at him with those wide green eyes and talking about pears and figs and honeycakes, about roast pork with apple slices and baked cod, and there’s a nostalgia in her voice that breaks his heart. “Well, I don’t know about the honeycakes,” he says, smiling. “I’m not much of a baker. But I know there’s a jar of dried figs in the kitchen that I’ve been meaning to crack open before these witchers can get to it. Sound good?” </p>\n<p>Ciri looks at him, a warm smile starting to curl her lips, and nods. </p>\n<p>Jaskier abruptly realises that he’d let Geralt break his heart a dozen times over just to see that smile again. “Come on, then,” he says, and squeezes her hand. “Let’s go steal some figs.”</p>\n<p>They don’t just steal figs, in the end. They <i>start</i> with the figs, sure, and Ciri digs a handful out of the jar with delight on her face, shoves them into her mouth as fast as she can manage. Jaskier laughs at that to begin with before he realises that, well, she’s probably had to learn to eat fast or lose her food – and then he just hands her the jar when she’s done, says, “Eat as many as you like. They’re not going anywhere.” </p>\n<p>She glances up at him, gaze sharp, then takes one final fig out and eats it, a little slower. </p>\n<p>After the figs, they find the honey that goes into their porridge every morning, eat spoonfuls of that, and then Jaskier grabs a loaf of bread that came out of the oven this morning and they cover it in freshly-churned butter, eating and eating and eating. It’s excessive and probably wasteful—Jaskier imagines he’ll get yelled at for that later—but it makes the little girl with sadness in her eyes smile like the sun, so frankly Jaskier doesn’t give a fuck about the waste. </p>\n<p>Ciri pauses eventually, sucking butter and honey off her fingers, and looks up at Jaskier. They’re sitting on the floor of one of the pantries, surrounded by crumbs that Jaskier will sweep up later so that Vesemir doesn’t start shouting about rats again, and Jaskier doesn’t know where the witchers are, what arguments they’re having, but right now he’s glad that they’ve left them alone. “Geralt’s mentioned you,” she says, a bright birdlike intelligence gleaming in her eyes. </p>\n<p>“Did he now?” Jaskier says, hoping that his smile comes across as amused rather than devastated. “Well, we used to travel together. I’d be offended if he didn’t.”</p>\n<p>Ciri’s still watching him. “He seemed surprised that you were here.” </p>\n<p>Jaskier snorts. “ ‘Surprised’,” he echoes, smiling a conspiratorial smile. “Ah, I’ve missed that talent for understatement that you only get growing up in a royal court.” </p>\n<p>Ciri flushes, just a little. “He <i>was</i> surprised,” she says, lips twitching at the corners. “He even used the kind of language he always uses when he’s… surprised.” </p>\n<p>Jaskier cocks his head. “What kind of language is that, exactly?” </p>\n<p>“ ‘Fuck’,” Ciri answers, prim and proper.</p>\n<p>Jaskier snorts. “Why, Princess Cirilla, you’ve got a <i>mouth</i> on you.” </p>\n<p>“Blame Geralt,” Ciri says, and swipes another fingerful of honey. Jaskier laughs quietly but can’t quite summon the words to reply, not with that pain still swirling fresh and bloody in his heart, but that’s okay because the princess is still watching him as she sucks the honey off her fingertip, gaze heavy and level. “I haven’t left his side since he found me,” she says eventually. “Not once. I think it’s because he doesn’t trust anyone else enough to be around me without him there.” </p>\n<p>“Sounds like Geralt,” Jaskier says, smiling a lopsided smile. </p>\n<p>Ciri’s eyes are so very bright. “He let me go with you.” </p>\n<p>Jaskier’s smile falters, and she’s just a girl, she’s just a child, but there’s a depth of wisdom and knowledge in her eyes that he can’t deny. “This is his home,” he says eventually, hoping that he sounds wistful and romantic rather than, well, destroyed. “He knows you’re safe here. He knows that there’s nothing and no one here that could hurt you.” </p>\n<p>Ciri’s expression is frozen, her lips tight and thin. She stares at the floor between her feet for a minute, then lets out a long breath, slow and pausing. “My home,” she starts, then stops before she can continue that thought – and, oh, shit, there are tears shining bright in her eyes. “My home is gone,” she says finally. “I saw it burn.” </p>\n<p>Sorrow floods Jaskier’s chest. “I’m so sorry,” he says, barely more than a breath. </p>\n<p>Ciri shrugs with one shoulder, gaze still fixed on the floor. “It’s okay,” she says. “I’m not the only one who lost something.” </p>\n<p>Jaskier frowns, leans forward. “But just because you’re not the only one who’s lost something, it doesn’t mean that your loss doesn’t matter,” he says, insistent. “It’s not a competition, Ciri. There are all different kinds of ways to hurt, and they’re all valid. They’re all important.” </p>\n<p>Ciri looks up at him. “You’re hurting,” she says with the blunt perceptiveness of a child. “Aren’t you? Because of Geralt.” </p>\n<p>Jaskier grits his teeth. “That’s a different kind of hurt.” </p>\n<p>Ciri nods, as if absorbing this. “But just because it’s different,” she says slowly, “that doesn’t mean it’s unimportant.” </p>\n<p>The swell of affection in Jaskier’s heart is almost uncontrollable. “Yeah, that’s right,” he says, nodding, then pauses. “And you know, Ciri, that if you need someone to talk to about… your home, if you want to talk to someone who isn’t Geralt and who can therefore communicate with you in more than just grunts and the word ‘fuck’, I’m here.” </p>\n<p>Ciri flashes him a small smile, thankful, grateful. “Geralt says he’s going to train me,” is what she says, though, adopting what Jaskier recognises as a classic Geralt of Rivia technique and changing the subject when it all gets a bit too emotional. “To be a witcher. To <i>fight</i> like a witcher.” </p>\n<p>Jaskier huffs a laugh. “Better you than me,” he says dryly. “I’ll watch from the sidelines and compose hexameter epics about your prowess with a sword.” </p>\n<p>Ciri shifts, reaches inside her worn brown cloak, retrieves a dagger. It’s small enough that it doesn’t overwhelm her hand, the blade bright and plain, the handle wrapped with surprisingly attractive red leather. “Geralt gave me this,” she says, holding it out to Jaskier. </p>\n<p>He takes it gingerly, watches Ciri’s gaze follow the little knife. “Have you had to use it?” he asks. </p>\n<p>“Not yet.” </p>\n<p>Jaskier silently hopes that she never has to, but there’s a tension in her shoulders and a brightness in her eyes that tells him that’s not the response she wants. “Geralt is a good teacher,” he says, handing the dagger back. “Even if he is grumpy and tetchy and doesn’t really understand the concept of positive reinforcement. Listen to him, and you can’t go wrong.” </p>\n<p>Ciri returns the dagger to wherever she had it hidden inside her cloak. “I remember you,” she says, studying him. “You were at the feast for my tenth birthday, and you sang a ballad about the Lion Cub of Cintra.”</p>\n<p>“I wrote it specially for the occasion,” Jaskier says, nodding. “It was requested by your grandmother’s consort, if I remember correctly.” </p>\n<p>Ciri smiles, just a little. It isn’t a happy smile. “Eist sang that song to me for weeks afterward,” she says – and there it is again, that little painful twist in Jaskier’s heart. “Do you still remember how it goes?” </p>\n<p>Jaskier smiles. “I remember how all my songs go,” he answers. “I can sing it to you sometime, if you want.” </p>\n<p>Ciri nods. “I’d like that.” </p>\n<p>The door to the pantry opens, hinges squeaking softly in the quiet, and Jaskier flinches instinctively, shoulders hunching – but it’s only Vesemir, Eskel a shadow at his shoulder. The grizzled witcher glances at Jaskier briefly, then looks to Ciri, a gentle smile on his lips. “We’re sorting out a room for you, princess,” he says. “Come with me.” </p>\n<p>Ciri gets to her feet, offers Jaskier a smile, and says, “Thank you.” </p>\n<p>“You’re welcome,” Jaskier answers, echoing her smile, and doesn’t move. </p>\n<p>Vesemir takes Ciri’s hand and leads her away, talking to her in a soft voice that Jaskier would almost describe as grandfatherly. Eskel steps back to let them pass, then comes into the pantry, closes the door behind him. He eyes the mess of breadcrumbs that Jaskier’s currently sitting in, then takes Ciri’s spot opposite him and sighs. “You two made a bit of a mess in here.” </p>\n<p>“I’ll clean it up,” Jaskier says flatly. </p>\n<p>Eskel hums. “You alright?” </p>\n<p>Jaskier sighs. “Not really,” he says, letting his head fall back against the barrel he’s leaning against. “Sorry for disappearing with Ciri. It was the only thing I could think to do that didn’t involve just… running away. Figured she’d be hungry and tired after slogging up that bloody mountain, thought I’d get her to eat something before she did what I did and just passed out in front of the fire. Didn’t anticipate that we’d eat half a jar of figs and most of the honey, but, you know, she’s royalty, she’s used to getting what she—”</p>\n<p>“Jaskier,” Eskel interrupts gently, stopping him mid-ramble. </p>\n<p>“Yeah,” Jaskier says, and lets out a sharp breath. </p>\n<p>“I spoke to Geralt,” Eskel says. “Explained why you’re here. Told him in no uncertain terms that it’s his fucking fault, and if he has a problem with it, he can take it up with me.” </p>\n<p>Jaskier laughs. “Defending my honour?” </p>\n<p>“Probably should have stopped you fucking Lambert if I wanted to do that,” Eskel observes wryly. </p>\n<p>“True.” </p>\n<p>Eskel’s quiet for a moment. “He’ll come speak to you at some point,” he says. </p>\n<p>Jaskier rolls his eyes. “Won’t <i>that</i> be a fun conversation.” </p>\n<p>“I <i>told</i> him to come speak to you,” Eskel says, his voice a little harder. “And now I’m going to tell you that, when he does, you’re going to speak to him, too.” He holds up a hand to forestall Jaskier’s protests, yellow-gold eyes flashing a warning. “You’re <i>going to talk to him</i>, Jaskier, if only because the rest of us are not about to spend the whole godsdamned winter tiptoeing around the pair of you.”</p>\n<p>Jaskier eyes him. “I thought you were on my side.” It’s petulant, he knows, but he can’t stop himself.</p>\n<p>Eskel sighs. “I’m on the side of not having a headache until spring,” he says. “Geralt’s an idiot, and he fucked up. He hurt you.” Jaskier opens his mouth to dramatically elaborate on exactly <i>how much</i> Geralt hurt him, but Eskel just rolls his eyes and steamrollers over him: “And yes, I know, he didn’t just <i>hurt</i> you, he <i>destroyed</i> you, he broke your heart, he tore you apart and flung you to the wolves, blah blah blah – I’ve heard your damn songs, Jaskier, you’re not exactly subtle.”</p>\n<p>Jaskier sniffs. “I’ll have you know, I’m praised for my subtlety of touch across the continent.” </p>\n<p>Eskel pulls a face. “I mean, that just sounds like you’re going to start talking about Lambert again,” he says, and Jaskier laughs. “But honestly, Jaskier, Geralt fucked up. Here’s the big surprise, though – he <i>knows</i> he fucked up.” </p>\n<p>“I find that <i>very</i> unlikely.” </p>\n<p>“He told me,” Eskel says, and no, no, Jaskier can’t listen to this, he <i>can’t</i>, because he can feel hope already starting to swell in his chest, foolish, idiotic hope. “I was… pretty pissed, after how he spoke you before. Yelled at him a bit. It was pretty satisfying, to be honest – which was sort of ruined by how he pretty agreed with everything I said.”</p>\n<p>Jaskier closes his eyes, presses the heels of his hands to his forehead. “Eskel…” </p>\n<p>“Just let him say his piece,” Eskel says. “That’s all I’m asking.” </p>\n<p>Jaskier snorts. “It’ll be three words,” he says, then does a passable imitation of Geralt’s rumble: “ ‘<i>Fuck off, Jaskier</i>’.”</p>\n<p>“Well, then you can send him back to me and I’ll smack him in the head until he apologises,” Eskel says. “Or get Vesemir to do it, maybe. He can break out the cane again, beat some sense into him like he used to when we were young.” </p>\n<p>“<i>That</i> I’d like to see.” </p>\n<p>Eskel’s gaze is level. “So?”</p>\n<p>Jaskier understands the unasked question. He looks down, studies his hands, sticky with honey and spattered with bread flour. “I’ll listen to whatever he has to say,” he says finally. “And then I’ll probably go get spectacularly drunk again, follow your lead and throw up in a corner somewhere.” </p>\n<p>“I’ll drink with you and make sure you don’t throw yourself off the eastern wall,” Eskel says, then wrinkles his nose. “Or into bed with Lambert.” </p>\n<p>Jaskier wags his finger. “You really ought to try it before you knock it,” he says, mock-serious, unable to fully stop the smile that twitches at the corner of his lips. “Lambert’s a very generous lover.” </p>\n<p>Eskel mimes vomiting and kicks Jaskier’s ankle. “If you tell me any more details about fucking Lambert, I swear to the gods I’ll throw you off the eastern wall myself.” </p>\n<p>“No, you won’t,” Jaskier says, laughing. “You’d miss my sparkling conversation too much.” </p>\n<p>Eskel hums and levers himself to his feet, brushes breadcrumbs off his trousers. “I’m going to spar with the others,” he says. “Vesemir said that he’s going to talk to Ciri and Geralt in the library, so, you know, maybe avoid that part of the keep for a while.” He offers Jaskier a hand, pulls him up. “You should genuinely clean up in here,” he says. “You know what Vesemir is like about rats.” </p>\n<p>Jaskier nods. “I’ll probably give dinner a miss,” he says. “I ate… quite a lot of figs.” </p>\n<p>Eskel squeezes his shoulder. “You know where I’ll be,” he says. “If you need me.” </p>\n<p>Jaskier nods, all of a sudden not quite able to speak, and flashes Eskel as bright a smile as he can manage. </p>\n<p>It doesn’t take him long to clean up the detritus of his and Ciri’s afternoon snack, but by the time he leaves the pantry, his lute slung carefully across his back, the sky is already dark. He pauses for a moment by the training ground, squinting at the vague shapes of three witchers who are now sparring in the dark, then makes his way through the keep to the eastern curtain wall. He’s still tense as he climbs the steps up to the top of the wall, but by the time he’s perched in his usual place, heels kicking gently at the outside stonemasonry, he can feel a little of the tension seeping away. It’s a cloudy night, the moon only glimmering across the glens in slim slivers, but he doesn’t mind: the darkness is almost relaxing. </p>\n<p>Jaskier sits on the top of the wall, the cold wind curling through his hair, picking absent chords from the strings of his lute until his fingertips are too numb to feel. </p>\n<p>Somewhere far away, hidden by the blackness of the night, a wolf howls in the mountains, long and lonely. </p>\n<p>Jaskier knows that the only reason he hears the footsteps behind him is because he’s meant to. He forces himself not to flinch, not to stiffen, not to let the fear and pain eat him alive from the inside out – and, oh, now that he’s thinking about it, maybe Eskel’s right. That’s not the subtlest image in the world, is it? If he’s going to get a real classic out of his whole fuck-up of a situation, he’s going to have to make sure he’s not so… <i>on the nose</i> with the whole thing. That’s a surefire way to slip into mediocrity.</p>\n<p>“Eskel said I’d find you here.” </p>\n<p>Jaskier blows a breath out slowly, watching as it freezes on the air. “I like it up here,” he answers. “It’s peaceful. And the view is beautiful, especially at sunset.” </p>\n<p>Geralt moves slowly, quietly. He almost seems unsure as he joins Jaskier on the wall, sitting a little further away than Eskel does, and then he says, “It’s a long fall. It’s not safe.” </p>\n<p>Jaskier suddenly remembers another mountain, another cliff-face, another conversation where he talked about everything and anything except what he actually wanted to talk about. “How’s Ciri?” he asks, changing the subject to stop his heart bleeding out in his chest. Again, so <i>literal</i>, so <i>over the top</i>. And he thought heartbreak was supposed to be <i>good</i> for artists. </p>\n<p>“She’s sleeping,” Geralt answers. “The journey here wore her out.” He pauses for a second, then says, “Thanks for feeding her.” </p>\n<p>Jaskier snorts. “It was mostly figs and honey,” he says flatly. “Not exactly a balanced diet.” </p>\n<p>Geralt hums, and doesn’t answer. </p>\n<p>“You went and found her, then,” Jaskier says eventually. “Your Child Surprise.” </p>\n<p>“I did.” </p>\n<p>“That’s good,” Jaskier says, then lapses into silence. </p>\n<p>Here’s the thing: Geralt isn’t particularly good at words. Oh, he’s eloquent enough when he needs to be, he can spin up the perfect words to tell a lord to go fuck himself or to explain in perfect specific detail what a milkmaid needs to do to prevent malicious magical spores from coming back and sending all her cattle into a frenzied rolling-eyed panic every full moon. But when it comes to more delicate matters, to <i>emotions</i>, to <i>feelings</i>, well, he’s borderline useless. And that’s the void that Jaskier always used to fill. He would spill his own leaking heart into the quiet between them, chatter on about everything and nothing, never really expecting to get much of a response and being eternally delighted whenever Geralt saw fit to grace him with a hum or a few words or even just a smile. So this dynamic that they’re resting in now, this quiet, it’s not unusual. </p>\n<p>What <i>is</i> unusual is that Jaskier absolutely fucking refuses to fill it.</p>\n<p>Geralt shifts next to him, clearly uncomfortable. “Can we get down off the wall?” he asks after what seems like an age. </p>\n<p>“Worried I’ll fall?”</p>\n<p>“I want to talk to you,” Geralt says, every word measured and careful, “and I want to be able to see your face when I do.” </p>\n<p>Jaskier has known Geralt in pretty much all emotional states, scared, furious, mocking, even affectionate, even nervous – but he doesn’t think he’s ever heard him sound quite as <i>vulnerable</i> as he does right now. And, fuck it all, Jaskier has never been able to refuse Geralt anything he asks for. That’s sort of part of the problem, of course, but he just sighs, nods. “Sure,” he says. “Sure, that’s fine.”</p>\n<p>Geralt goes first, padding silently down the worn steps that lead to the small courtyard behind the eastern wall. He turns and watches as Jaskier follows him, footsteps heavier, louder, more human, his lute slung across his back and one hand steadying himself against the stones because, well, fuck, apparently he’s a little shakier than usual. Not that surprising, really, given his current situation – and he comes to the bottom, stands a careful distance away from Geralt, crosses his arms. “So,” he says, and doesn’t elaborate. </p>\n<p>“Eskel explained why you’re here,” Geralt says. “He said he had to save you from Nilfgaard twice, that they wanted you to get to me and Ciri.”</p>\n<p>“That’s right,” Jaskier says, flat as he can manage. </p>\n<p>Geralt bows his head. “You shouldn’t have been in danger because of me,” he says, his voice quieter. “That wasn’t supposed to happen.” </p>\n<p>Jaskier shrugs, an uncomfortable one-shouldered affair that jostles his lute more than he intends. “It doesn’t matter,” he says. “I was lucky enough to stumble across another witcher who was kind enough to offer me his protection, so, you know. I don’t need your help.” </p>\n<p>Something sharp and almost <i>painful</i> crosses Geralt’s expression – but Jaskier knows that, to anyone else, Geralt’s face has hardly moved at all, barely a flicker of an eyelid, a twist of the lips. “Eskel seems to like you,” he says. </p>\n<p>“That’s because I’m actually a very likeable person,” Jaskier says flatly, then adds, “And I like him, too. He called me his friend the other day, you know? Didn’t take him, oh, two decades to get to that point. <i>Friend</i>. Pure and simple.” He snorts. “I finally found myself a witcher who isn’t afraid of human emotion. I’m not going to lie, it was a little confusing at first. I didn’t really know what to do with it – but, you know, I coped. I figured it out.” </p>\n<p>The look in Geralt’s eyes is strained, shadowed. He doesn’t speak.</p>\n<p>Jaskier sighs, looks down. This isn’t going well. “I told Eskel I’d listen to whatever it is you want to tell me,” he says. “So go on, Geralt. Talk to me.” </p>\n<p>Geralt takes a step forward. “I wanted to thank you,” he says, quiet and oddly formal. “For saving Eskel’s life. He’s a good man, and it would have grieved us all to have lost him. So thank you for that.” He pauses, giving Jaskier an opportunity to interject, but there’s a strange little buzzing building in the back of Jaskier’s skull that’s stopping him from forming much by way of coherent thought. “He’ll be a worthwhile subject for your songs,” Geralt is saying, his lips quirking bitterly. “Probably better than I ever was. He’s better with people than I am.”</p>\n<p>Jaskier just stares him. </p>\n<p>Geralt looks a little bemused by his continued silence, but he keeps on gamely going. “Ciri will benefit from your presence here, I think,” he says. “She seemed calmer after she spoke to you. She has… nightmares, and she’s human, like you. If you could—”</p>\n<p>“<i>Are you fucking kidding me?</i>” </p>\n<p>Jaskier isn’t sure what broke the dam that was holding back his words, that was keeping him silent and stupefied, but Geralt stops short, surprise flashing bright in his golden eyes, and, well, fuck, Jaskier guesses this is happening now. He takes a step closer, his hands balling into fists at his sides, his shoulders hunching around his ears, and his breath is like fire in his lungs. “Is this how you’re going to do it?” he asks, sharp and shrill, chest heaving. “Is this how you’re going to fucking apologise? By telling me that Eskel will give me plenty of songwriting material and asking me to play nursemaid to the Lion Cub of fucking <i>Cintra</i>?” </p>\n<p>Geralt’s nostrils flare in that particular combination of frustration and anger that Jaskier knows oh so well. “And what <i>exactly</i> should I be apologising for?” he bites off, that strange formality swept clean away. </p>\n<p>Jaskier can’t help it: he laughs. He flat out laughs, borderline deranged. “You cast me away like a dog,” he says, and it’s flat and it’s bitter and it’s full of a year’s worth of pain and heartbreak. “I gave you the best years of my very short human life, and you spat them back in my face. And you don’t think that deserves a fucking <i>apology</i>?” </p>\n<p>Geralt closes the distance between them in a single stride. “You don’t exactly seem to be <i>suffering</i> because of it,” he spits – and wait, what’s that there, in his eyes, underneath the anger and the frustration? Oh shit, Jaskier realises with a start, it’s <i>pain</i>. “You’re here in my home like you’re meant to be here and you’re, what, <i>best fucking friends</i> with my brother now – didn’t take you long to replace me, did it? And with a witcher who’s <i>much</i> better suited to you than I was.” </p>\n<p>There’s a sickness starting to build in Jaskier’s throat. “I’m only here because I have to be,” he says tightly, “and I haven’t <i>replaced</i> you, Geralt, I can be friends with more than one bloody witcher.” </p>\n<p>Geralt’s hand shoots out and grabs him by the front of his cloak, eyes bright, almost maddened. Jaskier doesn’t think he’s ever seen him like this before, driven wild with anger and vulnerability and <i>pain</i>, so much pain, engraved in every line of his face – and why is Geralt looking at him with <i>so much hurt</i> in his face? What the fuck is going on? “You’re supposed to be <i>mine</i>,” Geralt grinds out, every word looking like it physically wounds him to say. “You’re not supposed to be <i>Eskel’s</i>, you’re <i>mine</i>.” </p>\n<p>Jaskier smacks at Geralt’s hand, unsurprisingly doesn’t manage to dislodge him in the slightest. “Yours?” he trills. “<i>Yours?</i> I’m a fucking <i>person</i>, Geralt – and yeah, okay, I get that it’s easiest for your bloody fellow witchers to call me <i>Geralt’s bard</i> but I am <i>not</i> about to take that shit from <i>you</i> as well!”</p>\n<p>Geralt’s grip tightens, and he pulls Jaskier closer, impossibly closer, his golden eyes sparking with something strange, something bright, something heated. </p>\n<p>Jaskier knows that look. Lambert wore that look when he sat across the table from him in the small hall and caught a crust of bread out of the air, ate it with his gaze on Jaskier like he was <i>prey</i>. </p>\n<p>It hits Jaskier all at once. </p>\n<p>He’s pretty sure his mouth literally drops open. “What the <i>fuck</i>, Geralt?” he whispers. </p>\n<p>Geralt snarls at him, wordless and animal, and all that emotion he’s <i>so damn good</i> at bottling up just… overflows. He lunges forward, kisses Jaskier with a vehemence that borders on the violent – and it’s everything Jaskier has ever wanted and it’s so fucking <i>wrong</i> that he doesn’t know what to do, because he loves Geralt, yes, of course he does, he loves him with every fibre of his weak human heart, but Geralt is <i>out of control</i>. He doesn’t know what he’s doing, he <i>can’t</i>, and so Jaskier pushes at his chest, pushes him away as much as he can, and when Geralt’s lips leave his it’s like <i>dying</i> but it’s what he has to do. “Not like this,” he gasps, winding his hands in Geralt’s shirt, trying to calm him, trying to bring him back from whatever precipice of <i>his own heartbreak</i> he’s hurled himself over. “Geralt, please. Calm down, I need you to <i>calm down</i>.” </p>\n<p>All of a sudden, Geralt goes very, very still. </p>\n<p>Jaskier blinks, his heart beating rabbit-fast in his chest. “Geralt?” </p>\n<p>Geralt looks at him, pupils blown wider than Jaskier has ever seen them without a potion, and his nostrils flare in that very, very distinctive way that witchers have when they’re scenting the air around them. </p>\n<p>All of a sudden Jaskier realises that he still hasn’t had a chance to take a godsdamned bath. </p>\n<p>Geralt’s hands drop from his cloak and he steps backwards, steps away, his head held at an angle, chest heaving like he’s just run the whole way here. “You fucked Lambert,” he says, an odd note in his voice, not the strange formality of earlier, no, this is something different. It’s almost disassociated. It’s absent – and, ah, shit, Jaskier gets it. </p>\n<p>“Geralt,” he says, vaguely aware that he’s using the kind of voice he’d use to try to calm a spooked horse. “Geralt, look at me. I haven’t replaced you, I could <i>never</i> replace you.” He reaches out, tries to catch Geralt’s hand – but Geralt just moves away. “Geralt, do you hear me?” </p>\n<p>The absence in Geralt’s expression resolves into a crystalline hardness that Jaskier <i>has</i> seen before. It’s the look he wears when he’s stoned out of small-minded, backwards villages, it’s the look he tries to hide when mayors sneer in his face and ironmongers spit at his feet. It’s hurt and it’s betrayal, and Jaskier never thought he would see that look on Geralt’s face because of <i>him</i>. </p>\n<p>Geralt turns on his heel and takes off through the corridors of the keep. </p>\n<p>“<i>Shit</i>,” Jaskier husks, and runs after him.</p>\n<p>Except Geralt is a witcher, of course, with witcher strength and witcher stamina and, most importantly right now, <i>witcher speed</i>, so Jaskier doesn’t stand a chance of keeping up with him. That doesn’t matter, though, because Jaskier knows where he’s going. It’s the evening, it’s just after dinner, the others will be gathered in the small hall, sharing a drink and their strange witcher camaraderie, <i>Lambert</i> will be sharing a drink and that strange witcher camaraderie, and Jaskier is abruptly very, very glad that Ciri’s already gone to bed.</p>\n<p>He hears shouts of alarm from up ahead, and he runs faster.</p>\n<p>When Jaskier comes skidding into the small hall, lute clutched in his hands in a frantic effort to stop it being bashed to pieces against his back, Geralt has Lambert flat on his back on the floor, hand fisted in his shirt, and Lambert’s bloody nose is spewing across his lips and chin. As Jaskier watches, momentarily speechless, Geralt punches Lambert again, in the gut this time, driving all the wind out of him – and Jaskier spent the morning watching witchers fight each other, watching them dance around each other with grace and precision and perfection, but this is absolutely anything but that. </p>\n<p>“<i>Geralt!</i>” Eskel barks, and in the blink of an eye he’s on him, Coën joining him half a second later, the two of them forcibly dragging Geralt off a very dazed-looking Lambert. “What the fuck are you doing?” Eskel snaps in Geralt’s face, into his snarling, grief-stricken face – and then he looks up, sees Jaskier, glances between him and Lambert, and his expression blossoms into understanding. “I told you to take a fucking bath,” he growls at Jaskier, then shoves Geralt down when he tries to get up again. “Lambert, you should go.” </p>\n<p>“What the fuck did <i>I</i> do?” Lambert snarls, one hand pressed to his nose. “He just fucking <i>leapt</i> at me!” </p>\n<p>“Go,” Vesemir orders, tone brooking no argument. “And you, bard.” </p>\n<p>“But I—” Jaskier tries. </p>\n<p>“<i>Go</i>,” Eskel snaps at him, frustration thick in his voice, and he shoves his knee into Geralt’s chest, uses his bodyweight to pin him to the ground. He glances up at Jaskier. “This is <i>not</i> what I meant when I told you to talk to him.” </p>\n<p>Vesemir strides forward, grabs Lambert by the collar and Jaskier by the arm, guides them both out of the small hall. “Clean yourself up, both of you,” he says. “We’ll deal with him.” </p>\n<p>“Vesemir,” Jaskier starts, but Vesemir closes the door in his face before he can say anything else.</p>\n<p>Lambert swears, dabs tentatively at his nose. “What the fuck got into <i>him</i>?” he asks. “<i>Ow</i>, fuck, this <i>hurts</i>.” </p>\n<p>Jaskier lets out a shaky breath. His heart is pounding in his chest, and he can still feel the ghost of Geralt’s hands in his cloak, the memory of the press of his lips. “He smelled you on me,” he says shortly, holding his lute to his chest, cradling it like he would a child. “He smelled what we did last night.” </p>\n<p>Lambert frowns. “And he reacted like <i>that</i>?” He pauses, and his eyes go wide. “Fuck, Jaskier, you never said that <i>he felt the same way</i>.”</p>\n<p>Jaskier has had about enough of this witcher bullshit for one day. “Right,” he says, rubbing his forehead. “Okay. Thanks for that, Lambert. I’m gonna go take a bath.” </p>\n<p>Lambert eyes him. “You okay?” </p>\n<p>“I’m fine,” Jaskier says, and all of a sudden he’s just so fucking tired. “See you tomorrow.” </p>\n<p>Jaskier leaves Lambert standing outside the small hall, blood dripping into the neck of his shirt, and goes to his room. He leaves his lute, gathers up soaps and oils, then makes his way through the dimly lit corridors to the bathhouse, buried deep in the bowels of Kaer Morhen. It’s more functional than flamboyant, a series of artificial pools carved into the living rock that are fed by the hot springs inside the mountain, lit by flickering oil lamps, but the only thing Jaskier gives a shit about now is getting in that hot, faintly sulphurous water and scrubbing his skin red and raw.</p>\n<p>He strips off his clothes, leaves them in a haphazard pile on the floor and sinks into the nearest pool, submerging himself completely under the water, eyes closed, breath caught tight in his chest. He stays under for as long as he can manage, until his lungs are bursting for air, then breaks the surface, gasps in a breath, slumps back against the edge of the pool and runs a hand through his sopping wet hair. “Shit,” he whispers to the echo of the rocky bathhouse. “<i>Shit</i>.” </p>\n<p>Jaskier washes his hair with quick, jerky motions, then reaches for a cloth and cleans his body as thoroughly as he can, wiping away the sweat and the grime with detached precision. He runs his hands over the finger-shaped bruises on his hips, the fingernail scratches in his thighs, the bitemark dug into his belly – and he breathes out through his nose, fingers clenching in the washcloth, eyes prickling with tears. Fuck, he doesn’t even know why he’s so <i>sad</i> – he should be happy, shouldn’t he? Geralt fucking <i>kissed</i> him. He’s dreamed of that happening for literally <i>years</i>, and now it’s happened and it’s done and it’s over and he’s getting the horrible feeling that he’s managed to ruin everything already. </p>\n<p>“Fuck,” he says, and sinks under the surface of the water once again. </p>\n<p>Jaskier stays in the bathhouse for a long time, curled against the carved side of the pool, doing his best to lose himself in the warmth of the water and the rich, sweet smell of his orange oil. His breathing steadies, after a while, his heartbeat slows – and he starts to feel the ache in his legs from his headlong dash through the keep, feet sore, knees twinging. Combined with the bruises at his hips and the still-lingering echo of the hangover, he feels like, well, shit. </p>\n<p>Footsteps sound in the corridor outside, quick and sharp, and Eskel comes padding into the bathhouse before Jaskier can start to panic. He plumps himself down next to Jaskier’s pool, sighs heavily and says, “Well, <i>that</i> was a fucking mess.” </p>\n<p>“Is he okay?” Jaskier asks. </p>\n<p>Eskel nods. “He’s alright,” he says, softer. “We calmed him down before he broke anything else. Or any<i>one</i> else.” He shakes his head. “He felt like shit pretty much immediately, wanted to come find you. Vesemir said that if he dared come close to you right now he’d kick him out of the keep, and then told him to go to bed.” </p>\n<p>Jaskier laughs faintly. “Geralt of Rivia, sent to bed like a naughty child.” </p>\n<p>Eskel watches him, his eyes a rich, dark gold in the light from the lamps. “What happened?” he asks, incredulous, astonished. “The last I saw him, he was coming to find you to tell you he’s in fucking <i>love</i> with you, not to lose his <i>head</i> like that.” </p>\n<p>Jaskier has had a very long day. </p>\n<p>He leans forward in the sulphur-heated pool, skin raw and over-sensitive from the constant heat, nose full of the smell of oatmeal soap and orange oil, and buries his face in his hands. He stays there like that for a long moment, eyes closed, just breathing, but then he thinks <i>he’s in fucking love with you</i> and it’s way, way too much. He sucks in another breath, short and trembling, and then he just can’t do it anymore and he’s crying, sobbing, struggling to get enough oxygen into his lungs between hoarse, wracking sobs. </p>\n<p>“Fuck,” Eskel mutters, then splashes into the pool next to him without a second thought, fully dressed, boots and everything. He pulls Jaskier to him, strong and solid, wraps his arm around his shoulders and tucks his head under his chin. “It’s alright,” he says. “It’s okay. You’re okay.” </p>\n<p>Jaskier just cries, and he doesn’t even really know what he’s crying for. </p>\n<p> </p>\n<p>Jaskier sleeps until midmorning, curled up in his mound of furs and blankets, surrounded by the familiar, soothing scents of oatmeal soap and orange oil. He misses breakfast, obviously, so when he finally manages to leave his room he goes to root around in the pantry, eats a couple more of the dried figs he plundered with Ciri yesterday—gods, was that only yesterday?—and fights the urge to wash them down with a nip of vodka. He doesn’t have much appetite, which is both unsurprising and frustrating, so he slips a bread roll into his pocket for when he inevitably gets horrifically hungry a few hours down the line. </p>\n<p>He can hear familiar voices coming from the training ground. He takes a breath, steadies himself, and goes. </p>\n<p>Kaer Morhen’s training ground is clearly designed for more witchers than the handful who are currently wintering at the keep, which is a realisation that twists Jaskier’s heart a little more than it probably should. It also means that, even with all of the keep’s current inhabitants occupying that circle of beaten earth, they don’t fill it, not even close – and Jaskier pauses at the edge, arms folded across his chest, surveying. Vesemir is currently showing Ciri something that looks worryingly like a miniature version of a witcher sword, Eskel at his shoulder offering occasional commentary with a wry smile, and Coën seems to be setting up some form of bizarre torture apparatus involving unpadded wooden beams that Jaskier is guessing is actually for agility training. What’s more surprising, though, and what makes Jaskier’s breath catch in his throat a little, is the fact that Geralt and Lambert are currently lounging together on the low bench Jaskier spent yesterday morning on, recovering from his hangover – and they’re not fighting, not arguing, no, they’re just sitting there, knees comfortably butted up against each other in their sprawls, watching as Ciri takes the blade from Vesemir with a serious, intense expression on her young face. </p>\n<p>Something twists in Jaskier’s chest, longing and yearning and grief all tied up together. </p>\n<p>Lambert catches sight of him standing there awkwardly, then elbows Geralt in the side and says something Jaskier can’t hear. Geralt glances over, every line of his body suddenly flooding with tension, and then so does Eskel – who promptly shoots Geralt a look that says in no uncertain terms <i>stay the fuck down</i> and comes to Jaskier’s side. </p>\n<p>This whole thing is so fucking weird that Jaskier sort of wants to laugh, but he figures that really wouldn’t help right now so he keeps it in. </p>\n<p>Eskel cocks an eyebrow at him. “You alright?” </p>\n<p>Jaskier nods, not quite trusting himself to speak just yet. </p>\n<p>“You eaten something?” Eskel asks. “You missed breakfast.” </p>\n<p>Jaskier rolls his eyes. “Yes, <i>mother</i>, I’ve eaten something,” he says, taking refuge in mockery. “I washed behind my ears, too – do you want to check?” </p>\n<p>Eskel’s lips quirk. “I know you did,” he says. “I watched you trying to drown yourself in the baths, remember?” </p>\n<p>Jaskier flushes. “That’s not what I was doing,” he mutters. </p>\n<p>Eskel’s quiet for a moment, and Jaskier is suddenly keenly aware of the fact that Geralt is watching them, laser-focused. Now that Jaskier thinks about it, he can probably hear every word they’re saying, too – godsdamned witcher hearing. “Geralt wants to talk to you,” Eskel says eventually, voice determinedly neutral. “And he promises that he’ll <i>actually</i> talk this time, instead of losing his shit and going to break Lambert’s nose again.” On the bench next to Geralt, Lambert snorts and says something that Jaskier is pretty sure is along the lines of <i>he can fucking try</i> – which just confirms that, well, every bloody witcher on the damn training ground can hear this conversation. </p>\n<p>“Well,” Jaskier says, aiming for bright and breezy. “If he <i>promises</i>.” </p>\n<p>Eskel laughs, then reaches out, grips Jaskier’s shoulder. “You sure?” </p>\n<p>Jaskier lets out a low breath. “I’m sure.” </p>\n<p>“Want me to come along?” Eskel asks, and there’s a seriousness in his expression that seems to oddly settle Jaskier’s nerves. “He’s not going to react like he did yesterday, he’s fucking sworn he won’t, but I understand if it’d make you feel safer.” </p>\n<p>Jaskier blinks. “Are you…” He trails off, clears his throat. “Are you offering to protect me?” he says quieter, stepping a little closer. “From <i>Geralt</i>?” </p>\n<p>“I can if you need me to,” Eskel answers, just as quiet. </p>\n<p>Jaskier’s heart thuds so hard against his ribs it hurts. “Geralt would never hurt me,” he says softly, then laughs, short and a little bitter. “Not physically, at least.” He pauses, remembers the djinn. “At least not on purpose.” </p>\n<p>Eskel doesn’t look convinced. “You sure about that?” </p>\n<p>“<i>Yes</i>, I’m sure,” Jaskier answers, exasperation seeping into his voice. “It wasn’t <i>my</i> nose he broke, was it?” He reaches up, covers the hand that Eskel’s still got gripping his shoulder and squeezes lightly. “And anyway, if he <i>does</i> break me in another fit of jealous, emotionally-repressed rage, I expect you to avenge my death in an appropriately dramatic fashion then get the best bard Oxenfurt can produce to compose an epic ballad about my tragic fate.” He wrinkles his nose. “<i>Not</i> Valdo Marx. I trust Coën’s taste, he can help you find someone suitable.”</p>\n<p>Eskel smiles a little and drops his hand. “Geralt,” he says, not raising his voice in the slightest – but Geralt’s on his feet immediately, covering the space between them in a handful of heartbeats. Vesemir and Coën keep Ciri distracted, fortunately, Coën showing her what looks like basic fencing footwork and Vesemir strategically positioning himself so the bulk of his body blocks off this bizarre tableau Jaskier’s found himself a part of – and then Geralt’s just <i>there</i>, broad and silent, his yellow-gold eyes heavy on Jaskier like he never wants to stop looking at him. </p>\n<p>Eskel puts himself between the two of them and faces Geralt, his jaw set. He doesn’t say a word, just stares Geralt down – and Geralt just takes it, steady, unmoving. Eskel sighs, after a long moment, then punches Geralt’s shoulder and says, bordering on playful, “Don’t fuck this up, brother.” </p>\n<p>“Don’t plan to,” Geralt says, deep and solid in his chest. </p>\n<p>Eskel sighs, glances back to Jaskier one last time, and leaves them to it. </p>\n<p>Geralt just stands there for a moment, looking somewhere between deeply uncomfortable and starkly hopeful. “Would you like to go somewhere else?” he asks, soft and pausing. </p>\n<p>Jaskier eyes the others. “Might be best,” he says, and leads them away from the training ground. It’s a bright but cold day, the sun shining in the pale blue sky with little real heat, and the stones of Kaer Morhen are icy to the touch. Jaskier shrugs his fur-lined cloak closer around himself, buries his chin in the softness of the collar, and just walks. “I don’t know where I’m going, by the way,” he says after a moment. “Just figured that we probably didn’t want to have this conversation where everyone else could hear.” He snorts. “They already know <i>far</i> more about this whole situation than I’d like them to.” </p>\n<p>Geralt hums, low and familiar, and Jaskier can’t help it – something warm and affectionate twists in his heart at the sound. He takes a breath, pushes the feeling to one side. Not now. “I know a place,” Geralt says, apparently unaware of Jaskier’s inner struggle, and takes the lead. </p>\n<p>Jaskier follows, as always. </p>\n<p>Geralt leads him to a small courtyard somewhere in the outer ring of the keep. It’s open to the sky but perfectly positioned to catch the mid-morning sun, and there’s a rectangular stone table sitting in the middle, heavy wooden benches set on either side. Iron trelliswork stretches overhead, laced with bare green vines that, Jaskier’s assuming, flower in the spring, hang heavy with leaves in the summer, drop fruit in the autumn, and there’s traces of ornamental carvings stretching around the courtyard’s walls in a wide band at shoulder height. There’s a little snow on the ground, a few icicles hanging from the trellis, but it’s early enough in the winter that the ice hasn’t had much of a chance to build up yet. </p>\n<p>Jaskier gazes around, borderline wondrous. “I’ve not seen this courtyard before,” he says. “Vesemir must not have brought me here when he gave me the tour.” </p>\n<p>“It doesn’t exactly have a purpose,” Geralt says, taking a seat on one of the wooden benches. “Vesemir likes things that have a purpose. But it’s peaceful.” He shrugs, self-conscious. “I thought it might be appropriate.” </p>\n<p>“It’s <i>beautiful</i>,” Jaskier corrects, wandering over to the carved band, running his fingertips along images that he’s pretty sure tell of witcher history, battles and banquets, monsters and magics. “I’m going to have to try to remember how to get here.” </p>\n<p>“I can show you the way again,” Geralt says, then pauses, adds, “If you like.” </p>\n<p>Ah, yes. There’s a reason they came here. </p>\n<p>Jaskier leaves the carvings, goes to the table, brushes a few flakes of snow off the bench opposite Geralt and takes a seat. The expanse of stone stretches between them, wider than it looks, and all of a sudden Jaskier’s heart is in his throat. Geralt’s watching him, expression still but golden eyes as vulnerable as they were last night, the faint breeze catching loose strands of his silver-white hair, and, fuck, he’s as stupidly beautiful as he always was. </p>\n<p>Geralt clears his throat. “So,” he says. </p>\n<p>Jaskier licks his lips. “So,” he echoes, and spreads his hands palm-down on the table between them.</p>\n<p>“You never had any problem with me fucking other people before,” Jaskier says. </p>\n<p>It’s maybe not the <i>least</i> confrontational opening gambit he’s ever gone for, but, oddly enough, it seems to work. Geralt’s shoulders relax, just a little, and he leans forward, props his elbows on the stone table. “It wasn’t because you <i>fucked</i> Lambert,” he says, golden eyes bright. “It was because you fucked <i>Lambert</i>.” </p>\n<p>Jaskier raises an eyebrow. “So it would be fine if I’d fucked Eskel?” he asks, trying for some reason to keep this whole thing lighthearted because, you know, the last time they got serious Geralt broke someone’s nose.</p>\n<p>Geralt’s lips thin. “That would be worse.” </p>\n<p>Jaskier’s stomach twists, and he remembers that bitter, frantic betrayal in Geralt’s eyes. “To be clear,” he says, shifting a little in his seat, “I don’t want to fuck Eskel. I also don’t really want to fuck any of the other witchers I’ve met up here, including Lambert.” He pauses for a beat, then figures, well, he’s committed now. “I only want to fuck <i>you</i>, Geralt, but that’s just a bit… complicated right now.” </p>\n<p>“I want that, too,” Geralt says, his voice strangled and tight in his chest. </p>\n<p>Jaskier flinches almost violently, then forces himself to take a breath. “Okay,” he says, rubbing at his face to hide the way that his hands are shaking, to disguise the fact that he can’t meet Geralt’s eyes. “Shit. Right.” </p>\n<p>They sit in silence for a long moment. </p>\n<p>Surprisingly enough, Geralt’s the one who breaks it. “I fucked up,” he says shortly, and it’s such a straightforward Geralt of Rivia statement that, perversely, it warms Jaskier’s heart. “After the dragon hunt. I was pissed off with Yen, and with Borch, and with… <i>Destiny</i>. And you were an easy target.” </p>\n<p>Jaskier picks at an invisible spot on the table with his thumbnail. “Speaking of my favourite violet-eyed terrifying sorceress,” he says, and leaves it there. </p>\n<p>Geralt’s lips tighten, and for the first time he looks away. “You heard about Sodden?” </p>\n<p>Jaskier blinks. The question’s a little unexpected, but given the stories he’s heard about what happened at the Battle of Sodden, he thinks he might know where Geralt’s going with this. “I have,” he says. “Big stand off between Nilfgaard and a bunch of scrappy sorcerers, right?” </p>\n<p>Geralt nods. “Yen was there,” he says. “She was hurt, pretty badly.” </p>\n<p>“Is she okay?” Jaskier asks, surprised to find concern needling at his heart. </p>\n<p>“She’s alright,” Geralt answers. “Recovering. We stayed with her for a while, me and Ciri, in this little cottage she had hidden away in the woods.” His lips quirk at the corner, just a little. “It was peaceful, very rustic. You would have liked it.” He pauses, apparently studying the carvings that run around the span of this little courtyard. “We spoke,” he says. “She was… less angry than she was before. And she loves Ciri.” </p>\n<p>Jaskier takes a breath, tries not to think about this as preparing to get his heart broken all over again. “So you’re back together?”</p>\n<p>Geralt shakes his head. “No,” he says, and Jaskier can tell by the flare of his nostrils and the slump of his shoulders that it’s painful for him to talk about. “We agreed that it… wasn’t a good idea. That we aren’t good for each other as lovers, but that we can maybe be better as friends.” He pauses, just briefly, glances up at Jaskier for the first time. “She wants to be a part of Ciri’s life,” he says, something almost <i>nervous</i> in his voice. “The plan is that Ciri will spend the winter here, learning to defend herself, then she’ll go to Yen to train as a sorceress, too.” </p>\n<p>Jaskier’s eyebrows jump. “A princess-witcher-sorceress?” he asks, and all of a sudden his fingers are itching for his lute. “Now <i>that’s</i> going to be a song worth singing.” </p>\n<p>Geralt gives him an odd look. “Would you <i>want</i> to sing it?” he asks, strangely tentative.</p>\n<p>Jaskier scoffs. “Have you ever known me <i>not</i> to want to sing a song like that?” he asks – then realises half a heartbeat too late that, oh, that’s not the question Geralt is asking. “Geralt,” he says, a little breathless. “Just so I’m clear. What you’re <i>actually</i> asking me there is whether I want to be a part of your life again – yours, and Ciri’s? And apparently maybe also Yennefer’s?”</p>\n<p>Geralt nods, wordless. </p>\n<p>“<i>Of course</i> I want that,” Jaskier says before he can think better of it – and then, because obviously he immediately starts overthinking, “If that’s what you want?” </p>\n<p>“I do,” Geralt says. A muscle jumps in his jaw. “I missed you.” </p>\n<p>“Fucking hell, Geralt,” Jaskier says, his voice tight. “You really know how to make a man feel weak at the knees, you know that?” </p>\n<p>Geralt smiles, just the faintest curl of his lips. “Yesterday,” he starts, then stops, exhales through his nose. “I didn’t expect you to be here,” he says, after a long moment of silence. “I didn’t <i>want</i> you to be here.” </p>\n<p>Jaskier huffs a short laugh. “Thanks.” </p>\n<p>Geralt frowns, shakes his head. “Not like that,” he says, voice tight. “I thought you’d be in Oxenfurt, or Novigrad, maybe. Somewhere safe, somewhere far away from the war. I <i>need</i> you to be safe.” Jaskier’s heart thuds louder against his ribs at the sheer <i>fear</i> in Geralt’s voice. “You’re not safe here,” Geralt says, and then, “You’re not safe if you’re <i>with me</i>.” </p>\n<p>Jaskier snorts. “I think I conclusively proved that the safest place for me to be right now is with a witcher,” he says dryly. “I was just lucky that I bumped into Eskel when I did.” </p>\n<p>Geralt’s gaze is steady, no flare of jealousy, no throb of impending violence. “Your smell is all over him,” he says, words clipped and short. “The others, too, but mostly Eskel.” </p>\n<p>“And that’s a problem?” </p>\n<p>Geralt doesn’t answer. </p>\n<p>Jaskier remembers. “Because I’m supposed to be yours,” he says, echoing the words that spilled from Geralt’s lips like venom last night. They’re softer, in the light of day. “You know I am, Geralt. Yours.” </p>\n<p>“I didn’t know,” Geralt says. “I couldn’t tell. I thought…” He trails off, breathes. “I thought I’d lost you,” he says. “I thought you’d moved on. I thought I’d fucked it.”</p>\n<p>“You thought I’d replaced you,” Jaskier says softly. “That’s what you said, that I’d replaced you with Eskel.” – and he doesn’t say it, doesn’t say it because it’s too raw even for this moment, but he knows how hard it is for Geralt to lose people, knows how hard it is when they leave him. It must be so much worse to be left for one of his brothers, one of the few people in this world that he’s supposed to be able to trust without hesitation, without reservation. “And then,” Jaskier says, slower, so careful, “you smelled Lambert on me. And that was <i>another</i> kind of replacement.” </p>\n<p>Geralt drops his head. “I didn’t deal with that well.” </p>\n<p>Jaskier laughs quietly. “No, you didn’t.” He cocks his head. “Looked like you’ve patched things up with him, though.” </p>\n<p>Geralt nods. “We’re good.” </p>\n<p>“Did you… talk to him?” Jaskier asks, fighting the urge to laugh. “Or did you just go down the more witchery route and let him punch you back?” </p>\n<p>Geralt’s lips twitch in a smile. “Very funny.” </p>\n<p>“I think so,” Jaskier says archly. </p>\n<p>Geralt’s quiet for a minute. “I shouldn’t have kissed you like that,” he says, mouth twisting in a sharp slant of distaste. “I didn’t give you a choice. I just… couldn’t stop.” </p>\n<p>“You stopped when I asked you to,” Jaskier says, then he shifts in his seat, tries to smile. “And under different circumstances—just so you know, for future reference—I think I’d really quite like it if you kissed me like that.” </p>\n<p>Geralt studies him, and for a long moment he’s as silent as the mountains around them. “For future reference,” he echoes eventually, his golden eyes bright as the cold sun. </p>\n<p>Jaskier’s heart beats a little faster. “I mean, if I’m not allowed to let your witcher brothers fuck me,” he says lightly, trying not to sound quite as breathless as he feels, “then I figured I should probably be entitled to <i>something</i> from you instead.”</p>\n<p>“You have everything from me,” Geralt says, and it’s so unexpectedly heartfelt that Jaskier <i>does</i> lose his breath. </p>\n<p>They just sit there for a moment, facing each other across a stone table in the icy cold of Kaer Morhen. The sky is blue and wide overhead, and far above a hawk spins in circles, riding the updrafts. </p>\n<p>“How long?” Geralt asks. </p>\n<p>Jaskier understands. He shrugs, leans back, piles his hands in his lap. “I’ve wanted to shag you from the moment I saw you,” he says. Geralt’s wry smile sends a thrill of delight through his heart, and he beams back, then laughs, says, “Oh, and look.” He reaches into his pocket, pulls out the roll he took from the pantry earlier. “I’ve got bread in my pants again.” He rips the roll in two, tosses one half to Geralt and takes a bite out of the other. “If we’re talking about more than just sex, though?” he says, easy and straightforward, around a mouthful of the fresh bread that Coën made this morning. “That took a little while longer.” He nods thoughtfully. “It was probably when you took all that money the kid in Posada gave you to kill their mysterious devil and just gave it away to Filavandrel and his people without a second thought.” </p>\n<p>Geralt, halfway through a mouthful of bread, looks stunned. “That was the day we met.” </p>\n<p>Jaskier smiles. “I know it was, I was there,” he says, laughing, then shrugs. “In my defence, I tend to fall in love pretty quick. It’s just that, well, usually I fall <i>out</i> of love just as quickly. But this time, that never happened.” He pauses, eats another mouthful. “You?” </p>\n<p>“Long enough,” Geralt says. </p>\n<p>Jaskier snorts. “That’s all you’re going to give me?” he asks, incredulous. “ ‘Long enough’? I mean, I know you’re monosyllabic, Geralt, but <i>come on</i>.” </p>\n<p>“ ‘Enough’ is two syllables.” </p>\n<p>Jaskier splutters. “<i>Geralt</i>.” </p>\n<p>The lick of amusement in Geralt’s eyes fades as quickly as it appeared. “I couldn’t let myself feel that way,” he says finally. “It was dangerous. For you.” He pauses for a second, finishes the bread. “People don’t like witchers, Jaskier. They tend not to like witchers’ lovers, either. So I… ignored it. As much as I could.” </p>\n<p>There’s something primal and dark that thrills in Jaskier’s gut at <i>witchers’ lovers</i>, but now really isn’t the time to be focusing on that. “Turns out they’re not huge fans of witchers’ bards, either, if you hadn’t noticed,” he points out. “Fuck knows what would have happened to me if Eskel hadn’t been around to stop me getting taken. Nothing good, I imagine.” </p>\n<p>Darkness flashes in Geralt’s eyes. “Should have been me.” </p>\n<p>“Yes, it should have been,” Jaskier says, open and honest because, well, he’s not wrong, is he? “But I stumbled across Eskel, dying in a ruined farmhouse, and then <i>he</i> stumbled across <i>me</i>, drugged and in the process of being abducted – and we’re all here now, safe and sound in Kaer Morhen.” He lets out a long breath, watches Geralt closely. “So what now?”</p>\n<p>Geralt’s nostrils flare. “What do you want?” he asks. </p>\n<p><i>There’s</i> a question. “I want you,” Jaskier says, then scratches the side of his head. “But I somehow don’t think it’s the best idea for us to just fall into bed, you know?” He grimaces. “You did break my heart, after all. And I <i>want</i> you to, you know, have your wicked witcher way with me in pretty every room in Kaer Morhen, I really do – but I think I need a little more time.”</p>\n<p>Geralt nods. “Whatever you need.” </p>\n<p>Jaskier pauses, doesn’t move. “I love you,” he says, the words like rose thorns on his tongue. </p>\n<p>Geralt inhales sharply. “I love you,” he answers, a confession and an apology all at once. </p>\n<p>Jaskier flashes him a smile. “Now that <i>that’s</i> sorted out,” he says, bright and cheery, “you should probably get back to making sure that Lambert doesn’t corrupt that sweet little Cintran princess any more than you’ve already managed to ruin her.” He gets to his feet, brushes breadcrumbs off his cloak, and Geralt mirrors him on the other side of the table. “Point me in the direction of the eastern wall? I need my daily dose of gazing wistfully at the scenery like the poet I am.” </p>\n<p>Geralt’s lips twitch in that little half-smile of his again. “Follow that corridor,” he says, pointing. “When it forks, go right. That will take you to the stables.” </p>\n<p>“I know the way from there,” Jaskier says, nodding. He pauses for a second, a tightness in his heart like a coiled spring, then moves around the table, purposeful and quick before he can change his damn mind – and he takes Geralt’s face between his hands and kisses him, brief and fleeting and barely more than a press of lips to lips, if he’s honest, definitely not his best work by any stretch of the imagination, fuck, he kissed <i>Lambert</i> with more passion than that. </p>\n<p>Geralt looks like he’s just seen the faces of the gods. </p>\n<p>“Right,” Jaskier says, his heart thundering in his chest, fighting to school his features into the cool, calm, relaxed expression of a world-famous bard who absolutely isn’t going moon-eyed over an emotionally stunted witcher. “Okay. I’ll see you later, Geralt.” </p>\n<p>Jaskier goes, stepping down the corridor Geralt pointed him to with alacrity, the heels of his boots snapping on the cold stone, and winds through the passageways of Kaer Morhen with ease, head held high. He makes it to the eastern wall in short order. He scrambles up to the top of the wall, boots slipping a little in his haste, then takes his usual spot, feet kicking out over the beauty of the continent’s majesty, full of the glens and rivers and lochs and sky, full of the world in its glory, full of life.</p>\n<p>The grin on his face is broad and bright enough to put the sun to shame. </p>\n<p> </p>\n<p>Dinner that night is full of laughter and alcohol, the table groaning under the weight of the haunch of boar that Vesemir spent the afternoon slow-roasting over a spit in the large kitchen. It’s a celebration, Jaskier thinks, a celebration of the fact that they’re all here, that they’re alive, that they made it through another year – but no one says as much, so he figures he won’t bring it up. Ciri plants herself next to him, hair a messy mop that <i>really</i> needs a brush before it starts to tangle so bad it won’t come out, and pretty much narrates her whole day, the training, the drills, the tour of the armoury that Lambert apparently gave her – which, well, Jaskier thinks he’s going to have to talk to these bloody witchers about what exactly is appropriate entertainment for a Cintran princess. </p>\n<p>But at the same time, there’s such bright excitement in her eyes that it makes Jaskier’s heart warm. </p>\n<p>The boar is delicious, the ale is cold, and the fire lights the small hall with its dancing warmth. </p>\n<p>Ciri starts to droop, eventually, tired out by the cold and a long day of the physicality of witchers. The others don’t notice, to start off with, engrossed in a laughingly-loud argument that’s raging between Lambert and Coën. Ciri rests her cheek against Jaskier’s shoulder, eyelids fluttering, and he rests his arm around her shoulders, brushes hair out of her eyes. “Hey, Ciri,” he says softly. “You want to go to bed?” </p>\n<p>She nods, her hand wound into the thick wool of his sleeve. </p>\n<p>He strokes her hair. “I’m going to need you to wake up just a little bit,” he murmurs, and she shakes her head, buries deeper into his jacket. He laughs, presses a kiss to her pale hair. “I don’t know where your room is, darling, you’ll need to show me.” </p>\n<p>“I’ll take her,” Geralt says, his voice little more than a rumble in his chest. He’s crouched down next to the bench, one hand already resting against Ciri’s back, and he gently lifts her into his arms. She protests a little, but then she shifts, nestles into his shoulder, and dozes off once more. Geralt makes sure she’s comfortable, readjusts the wrap of her cloak, then flashes Jaskier a soft smile. “Goodnight, Jaskier.” </p>\n<p>Jaskier feels his heart swell in his chest. “Night,” he says, a smile flickering around his lips, and he watches Geralt carry Ciri out of the small hall. He’s known Geralt a long time, sure, he knows that he’s not the harsh, cruel monster the world wants him to be – but he doesn’t think he’s ever seen this <i>softness</i> to him before. </p>\n<p>He didn’t think that he could love that bloody witcher any more than he did already. </p>\n<p>Across the table, Lambert snorts. “Fucking hell, bard, you are <i>gone</i> on him, aren’t you?” </p>\n<p>Jaskier throws a scrap of oily gristle at him and hits him in the eyebrow, then crows his victory as Lambert pulls a face and wipes grease off his eyelid. </p>\n<p>“Stop it, you two,” Vesemir grumbles, then sighs. “And here I thought that a courtly bard would bring a little <i>dignity</i> to Kaer Morhen.” </p>\n<p>“You’ve got the wrong bard if you’re after dignity, Vesemir,” Eskel jokes. </p>\n<p>Jaskier kicks him under the table. “I’m very dignified, thank you very much!”</p>\n<p>“You slept with Lambert,” Coën says, laughing sharply. “That’s not usually considered particularly dignified.” </p>\n<p>“Hey!” Lambert protests.</p>\n<p>“A moment of madness,” Jaskier dismisses archly. </p>\n<p>Eskel barks a laugh, and Lambert shoots him a look, leans forward with his eyebrow raised, elbow slipping into Geralt’s discarded plate. “You weren’t complaining when I had my cock in your—”</p>\n<p>“<i>Lambert!</i>” Vesemir snaps. </p>\n<p>Lambert flushes bright red, and Coën practically <i>guffaws</i>. </p>\n<p>Once the others have peeled off one by one to bed, Jaskier and Eskel are left to tidy up. They carry the used dishes through to the kitchen, then Eskel washes them as Jaskier runs a broom around the usual mess that’s left in the small hall after meals – crumbs, thrown food, spills of ale. It’s late by the time they’re done, everything spotless and ready for breakfast tomorrow, and they slump down next to the guttering fire, sharing a final drink. “So,” Eskel says, heavy with meaning. “How was your little… <i>talk</i>?” He snorts, sips his ale. “Geralt managed not to punch anyone tonight, which is an improvement, and don’t think I didn’t notice that you basically <i>melted</i> when he picked up Ciri like that.” </p>\n<p>Jaskier sighs. “The talk was good,” he says, nodding. “Surprisingly… verbal? As in, there was actual talking? With words?” </p>\n<p>“Miracles do happen,” Eskel says, mock wondrous. </p>\n<p>Jaskier laughs. “I think we’ve patched things up,” he says. “Sorted some things out.” </p>\n<p>Eskel nods. “Do I need to trip him up when we’re training? Push him down the well? Leave a pile of Llwyd’s shit in his bed?” </p>\n<p>Jaskier rolls his eyes. “You don’t need to protect my damn virtue, Eskel.” </p>\n<p>“Well, as the whole Lambert situation demonstrates, you <i>clearly</i> can’t protect it yourself,” Eskel points out, then cocks his head. “You going to let Geralt have a go at your virtue, too?” </p>\n<p>“<i>Eskel</i>.” </p>\n<p>Eskel raises an eyebrow. “Well, are you?” </p>\n<p>Jaskier squints at him. “You told me in no uncertain terms that you didn’t want to know <i>anything</i> about what happened with Lambert,” he says. “Now you’re asking… that?”</p>\n<p>Eskel sighs, glances at the guttering fire. He’s quiet for a moment. “I don’t want to know if you’re going to fuck him,” he says eventually. “I want to know if you’re going to… <i>be with</i> him.” </p>\n<p>Jaskier’s heart twists. “He asked me if I wanted to be a part of his life,” he says, flexing his fingers around his mug of ale. </p>\n<p>“Do you?” </p>\n<p>“Obviously I do,” Jaskier answers, but his smile is a little sad. “But what’s to stop him just… being an arsehole again?” He’s quiet for a moment. “I love him, sure, and apparently—<i>astonishingly</i>—he feels the same about me, but…” He trails off. </p>\n<p>“Do you trust him?” Eskel asks quietly. </p>\n<p>Jaskier sighs. “That’s the question.” </p>\n<p>Eskel hums. “Well, there’s no rush,” he says. “The snows will set in soon, and then we’re all stuck here until it melts. It’s a good couple of months. Plenty of time.” </p>\n<p>Jaskier thinks about the last year of his life, alone on the road, the quiet days, the silent nights. “I guess.” </p>\n<p>“Or,” Eskel says, studying him carefully, “you could just decide <i>fuck it</i>, and crack on.” </p>\n<p>Jaskier laughs. “I’m sure there’s a happy medium somewhere.”</p>\n<p>Eskel shrugs, and drinks slowly. “You don’t smell afraid,” he says after a moment. “When he got here, when he snapped at you like that, you smelled… gods, Jaskier, it was just this flood of <i>panic</i>. I thought you were gonna pass out. It was like when you nearly got taken by those fucking Nilfgaardians – not good.” He shakes his head, sinks down deeper in his chair. “Last night wasn’t much better, when you came running in here after Geralt. So much <i>fear</i>, Jaskier, <i>fuck</i>. It’s not a good thing to smell on a friend, not good <i>at all</i>. But now you just smell like… you. It’s better.” </p>\n<p>“Not like Lambert?” </p>\n<p>Eskel snorts. “Thank the gods, not anymore.” He wrinkles his nose. “When you do fall into bed with Geralt, <i>please</i> have a bath before you see me. I honestly don’t think I can take that again.” </p>\n<p>Just for a moment, Jaskier thinks about Geralt, about the press of his lips, the brightness of his eyes, the warmth of his body. The winter nights that they spent curled around each other, sharing heat, sharing breath. The play of the scars across his bare chest, the wet heat of his skin in the bath. </p>\n<p>“<i>Stop it</i>,” Eskel groans, pressing his hand to his eyes. </p>\n<p>Jaskier laughs and gets to his feet. “I’m going to bed,” he says, leaving his mug on the end of the table. “Got something to… take care of.” </p>\n<p>“What the <i>fuck</i>, Jaskier!” </p>\n<p>“I’m joking!” Jaskier laughs, then waggles his eyebrows. “Maybe.” </p>\n<p>“Fuck you, bard,” Eskel grouses. </p>\n<p>“You’ll have to talk to Geralt about that first,” Jaskier answers lightly. </p>\n<p>A surprisingly affectionate smile plays around Eskel’s lips. “It’s good to see you happy, Jaskier,” he says. “It suits you better than heartbreak.” </p>\n<p>A wave of warmth floods Jaskier’s chest. He smiles, softer, gentler. “It feels good, too,” he says, then, “I’ll see you tomorrow, Eskel.”</p>\n<p>“Night,” Eskel says, and settles back in his chair. </p>\n<p>Jaskier goes back to his room, padding softly through the quiet corridors of the keep. He crawls into his mound of furs and blankets, buries himself deep, closes his eyes and goes to sleep with the memory of Geralt’s silver-white hair caught in the dance of the breeze, whispering in a carved courtyard with a winter-stripped vine twining the trellis above his head. </p>\n<p> </p>\n<p>Days settle into a routine at Kaer Morhen. </p>\n<p>The witchers train in the mornings, dancing around each other with the kind of speed and agility that Jaskier can only dream of – and in between training with each other, they train Ciri, as well. She takes to it like a duck to water, running their forest trails and leaping their apparatuses with increasing confidence, her long ash-blond hair pulled back in a tangled, knotted plait that Jaskier does his best to untangle every night before dinner. The afternoons are quieter, more relaxed, less structured, and once the day’s maintenance has been finished, Jaskier spends his hours at the eastern wall, or in the library, or in the baths. </p>\n<p>Geralt joins him, sometimes, not all the time, and they talk. It’s comfortable, it’s easy, it’s like they always were before – but there’s a charged undercurrent, too, an intimacy that sets Jaskier’s heart racing, because Geralt keeps <i>touching</i> him. Only lightly, and never without permission, but now there’s a hand pressing against his lower back in the halls, an ankle nudging his under the table, and once, when he was bending over his lute in concentration on a windy day at the eastern curtain wall, Geralt brushed his hair out of his eyes with such tentative, exacting care that Jaskier forgot to breathe for a second.</p>\n<p>They haven’t kissed since that day in the carved courtyard. </p>\n<p>Jaskier’s cleaning out Roach’s stall in the stables one morning, chattering to her merrily about the quantity and quality of her shit, sneaking her apple slices out of his pocket when he thinks the other horses can’t tell – which is ridiculous, obviously, because they’re horses, but he sort of feels bad about not lavishing Llwyd with the same attention. “You’ll keep my secret, though, won’t you, girl?” he murmurs, rubbing Roach’s velvety nose, and laughs quietly when she bumps her head against his shoulder. “You’ve been keeping them for years, after all.” </p>\n<p>“You’ve been telling Roach your secrets?” </p>\n<p>Jaskier didn’t even hear Geralt approach. There’s a bale of hay in his arms and a tiny smile on his lips, and he watches Jaskier as he deposits his burden in the stables. “You talk to Roach all the time,” Jaskier says primly. “Is there a reason I shouldn’t?” </p>\n<p>Geralt runs his hand through Roach’s mane, rubs her forehead, tugs her ears affectionately. “What secrets have you told her?” he asks, something almost nervous in his voice. </p>\n<p>Jaskier smiles, warm in the cold of winter. “Mostly about how I saw your arse when you were bathing in the river a few years ago and I’ve had constant dreams about it ever since,” he says, tapping his chin thoughtfully. “Or how the sunset makes your eyes blaze like fire and it drives me <i>mad</i>. How I watch your hands when you’re sharpening your swords and I want those hands to be doing… other things.” He shrugs, smiles innocently. “Just things like that.” </p>\n<p>Geralt’s gaze is heavy. “Jaskier,” he says, then pauses, just for a moment, cautiously reaches out and brushes his fingers against Jaskier’s cheek. “Can I kiss you?” </p>\n<p>Jaskier’s heart thuds so fucking hard in his chest. “In front of <i>Roach?</i>” he asks, mock-scandalised. </p>\n<p>Geralt laughs, a surprising lightness to the sound, and he takes Jaskier’s hand, pulls him away from Roach and into one of the empty stalls. They’re out of sight of the courtyard, away from the horses, hay caught in Geralt’s hair and horse shit rubbed into Jaskier’s boots. “Is this better?” Geralt asks, soft, intimate, loving.</p>\n<p>“If you don’t kiss me right now,” Jaskier says, voice trembling, “I swear I’ll—”</p>\n<p>But he doesn’t get a chance to finish his threat because Geralt kisses him, long and searching, his hands cupping Jaskier’s face, caressing his neck. Jaskier melts into it, sighs against Geralt’s lips as Geralt presses him up against the rough wood of the stall, body hard and firm and oh, shit, Jaskier thinks he could die like this. </p>\n<p>Geralt breaks away, rests his forehead against Jaskier’s. “You okay?” he asks, concern in his voice. </p>\n<p>Abruptly Jaskier realises that there are tears on his cheeks. “I’m good,” he says, carding his fingers through Geralt’s hair. “Yeah, I’m better than good. I’m <i>great</i>.” </p>\n<p>Geralt smiles and kisses him again, just as intimate, just as perfect. “You should finish mucking out Roach’s stall,” he whispers, after a moment. </p>\n<p>“And you should probably go make sure that Coën doesn’t let Ciri crack her head on that torture beam thing again,” Jaskier answers, just as soft. </p>\n<p>Neither of them moves for a long while.</p>\n<p>Jaskier can’t quite wipe the smile off his face for the rest of the morning. </p>\n<p>Lambert appears in the stables a little before lunch with a sugar cube for his mare, and he eyes Jaskier a little suspiciously. “What are you grinning about?” he asks, tugging a knot out of his horse’s mane with gentle fingers, then he sniffs. A sly smile quirks his lips. “Geralt was here, wasn’t he?” </p>\n<p>Jaskier flushes. “He was.” </p>\n<p>Lambert folds his arms, leans against the wall of Llwyd’s stall. “You two kissed,” he says, and it isn’t a question. “It’s going well then, I take it?” </p>\n<p>Jaskier just glares at him. </p>\n<p>“Want me to give him some tips?” Lambert asks, full-on smirking now. “Get him up to speed with how you like to be fucked before the main event?” </p>\n<p>“<i>Lambert</i>.”</p>\n<p>“Maybe how you like getting your hair pulled?” Lambert says thoughtfully. “Or that you really seemed to enjoy getting thrown around a bit?” </p>\n<p>“You know I’m literally holding a shovel full of shit right now?” Jaskier says. “And I will throw it in your face?” </p>\n<p>“Or how you made the <i>filthiest</i> noises when I twisted my fingers just like—”</p>\n<p>Jaskier throws the shovel full of shit at him. Most of it splatters the ground in front of Lambert’s boots but more than enough splashes up the front of his trousers, a little reaching as high as his thigh, and he splutters, looking suddenly appalled. “The <i>fuck</i>, Jaskier?” </p>\n<p>“I did warn you.” </p>\n<p>Lambert glowers at him. “Come here,” he says, stalking towards Jaskier – who abruptly realises that he just threw a shovel full of horse shit at a witcher, and bolts. He makes it as far as the small courtyard just outside the stables before Lambert tackles him around the waist, bringing him crashing to the paving stones with an undignified yelp. Lambert pins him to the ground with his thighs and traps his hands either side of his head, then snorts, raises an eyebrow. “This feels familiar.” </p>\n<p>“Get off, you bastard,” Jaskier laughs. </p>\n<p>Lambert raises an eyebrow. “You going to throw shit at me again?” </p>\n<p>“Only if you’re an arsehole again.” </p>\n<p>“Fair enough,” Lambert says, and lets him up. He hauls them both to their feet, brushes Jaskier down brusquely, then flashes him a startlingly genuine smile. “I’m happy for you,” he says, quieter. “Honestly.” And then, because he’s Lambert: “But I <i>am</i> very happy to give Geralt some advice. It’ll be hard for him to live up to the standard I’ve set, and I wouldn’t want you to be too disappointed, you know?” </p>\n<p>“There is a lot more shit in that stable, Lambert,” Jaskier says flatly, trying not to smile. </p>\n<p>Lambert shrugs. “Your loss,” he says, and goes. </p>\n<p>That afternoon, Jaskier wraps himself tightly in his cloak, gets his lute, and goes to the eastern curtain wall. It’s even colder than it was when he first arrived here with Eskel, now, and the sky is heavy with snowclouds – but there’s a vibrancy burning in his heart that he doesn’t want to waste. He clears snow off the top of the wall, takes his usual seat, and takes a long breath before his fingers start to dance across the strings. He’s been working on this for a few weeks now, editing and changing, experimenting with keys and tonality, but he thinks he might have finally got it – so he sings it now, sings it for the wilds of the mountains and the stones of the keep, sings it into the snow that’s just starting to fall. </p>\n<p>It’s a song of history and memory, of loss and grief, but it’s a song of today, as well, of Kaer Morhen as it is, as it survives. The stone and the wood, the swords and the horses, the food in the kitchens and the smoke in the fireplaces, it’s everything, it’s everything that Jaskier has found in this place, the safety, the companionship, all of it. It’s a song of the people who spend their winters here, the witchers, their strength, their sorrows, and sometimes it hurts to sing – but it’s a <i>good</i> kind of hurt. </p>\n<p>Jaskier sings to the mountains, the words sweet and heavy on his tongue, and watches the snow fall heavier, and heavier, and heavier. </p>\n<p>And then he remembers that he’s sitting on a very high, very slippery wall with an irreplaceable elven lute that’s rapidly getting covered in snow. He yelps, covers his lute with his cloak, and scrambles down to shelter. </p>\n<p> </p>\n<p>The snow keeps falling for the next four days. </p>\n<p>The witchers keep training as much as before because, as Vesemir tells Jaskier, they need to be able to be at their best in all kinds of weather. At first, they keep Ciri with them, but when her teeth start to chatter and her lips start going blue, Geralt scoops her up and brings her inside. Jaskier’s in the small hall when he does, getting a decent enough fire going to warm the hall for the afternoon, and he looks up when Geralt brings Ciri to the fire, sits down in front of the hearth and wraps her in his warm embrace. “You okay there, Ciri?” Jaskier asks, frowning. </p>\n<p>“I’m <i>fine</i>,” Ciri objects, but there’s a sluggishness to her tone that belies her words. </p>\n<p>Jaskier catches Geralt’s gaze. “There’s hot water in the kitchen,” he says. “I’ll get her something to drink, help warm her up.” </p>\n<p>Geralt nods, his expression worried.</p>\n<p>Jaskier runs to the kitchen, grabs a cup of warm water and brings it back, along with a lump of cheese and a scrap of ham. He gets Ciri to cradle the cup in her cold hands and breathe in the steam before she drinks it, then gives her the cheese and the ham, watches carefully as she eats them both, leaning back against Geralt’s chest. He tucks her hair back behind her ears, takes her hands in his to warm, then asks, “Better?” </p>\n<p>Ciri nods. “Sorry,” she whispers. </p>\n<p>Jaskier frowns. “What for?” </p>\n<p>Ciri twists, looks up at Geralt. “I couldn’t keep up with you,” she says, her voice so damn <i>small</i>. “You and Coën, the daggers, it was so cold, I couldn’t—”</p>\n<p>Geralt shushes her, holds her tighter. “You have nothing to apologise for, Ciri,” he says softly. “<i>Nothing</i>.” </p>\n<p>“But—”</p>\n<p>“No,” Geralt says. “You’re human, Ciri. You can’t deal with the cold like we can, you don’t have our stamina. You have to learn to know your own limits, not <i>our</i> limits. And you have to <i>push</i> your own limits – but not to the point that you harm yourself.” He pauses, holds Ciri’s gaze. “Do you understand?” </p>\n<p>“I understand,” Ciri says, eyes so bright and so young. </p>\n<p>Jaskier looks at them, the witcher and the princess, sitting in front of a crackling fire at Kaer Morhen, snowmelt on their clothes, dripping to the stones beneath them, and abruptly realises that this is exactly where he wants to be for the rest of his life. With <i>them</i>, whatever happens. </p>\n<p>That night, after dinner, Jaskier puts his hand on Geralt’s wrist, lets his touch linger. “Come with me?” he asks softly, aware that his heart has started beating harder in his chest and all these bloody witchers can probably hear it. </p>\n<p>Geralt nods. “Of course,” he says, and follows him out of the small hall. </p>\n<p>The snow is still falling outside, steady and thick, blanketing everything in a thick carpet of impenetrable white. The parts of the keep that aren’t heated are <i>cold</i>, bitterly so, and Jaskier finds himself shivering even in the covered corridors. “Gods, it’s cold,” he says, pressing closer to Geralt. “Really wishing I had your magical witcher body chemistry right now.” </p>\n<p>Geralt just hums, then wraps his arm around Jaskier’s shoulder and holds him close as they walk. “Where are we going?” he asks. </p>\n<p>“Here,” Jaskier says, and stops outside the door to his bedroom. </p>\n<p>Geralt looks at him, what Jaskier thinks might be hope shining in his eyes. “Jaskier?” </p>\n<p>Jaskier’s mouth is oddly dry, and he opens the door. “It’s warmer in here,” he says, tugging Geralt inside. “I keep a fire burning pretty much all day otherwise I can’t sleep, it’s so cold. Come on. No point in freezing our backsides off out in the snow when we don’t have to.” </p>\n<p>Geralt shuts the door behind him, then stands there in the space between the table and the bed, looking remarkably awkward for such a powerful man. Jaskier just looks at him for a long moment, takes him in, broad shoulders and strong arms and so much more. “Geralt,” he says, then pauses, not quite sure what he wants to say.</p>\n<p>Geralt moves. He doesn’t take his eyes off Jaskier, doesn’t drop his gaze at all as he starts to strip, shedding layers of wool and fur and leather, kicking off his boots, tugging the tie out of his hair, stripping down to nothing but skin, scarred and hard in the flickering light of the fire. Jaskier forgets to breathe for a second when Geralt takes a step towards him, then another, crossing the space between them in a handful of heartbeats – and then Geralt’s right there, naked and silent and the most obscenely beautiful thing Jaskier thinks he’s ever seen. </p>\n<p>Geralt doesn’t touch him, doesn’t kiss him, just offers him the smallest, warmest smile and sinks to his knees in front of him. He sits back on his heels, looks up at Jaskier with that same warmth in his eyes, then says, “Everything.” </p>\n<p>Jaskier chokes, falls to his knees, seats himself astride Geralt’s lap and kisses him as hard as he can. “Fuck, Geralt,” he whispers, kisses him again. “I’m going to need you to get me naked <i>right now</i>, okay?” </p>\n<p>The rumble in Geralt’s throat is practically a growl, and his hands move faster than Jaskier thought possible, stripping him down to his skin so fast he’s pretty sure some seams get torn. Geralt pulls him back into his lap, kisses him, one hand on the back of his head, the other around his waist, holding so tight it almost hurts. “Jaskier,” he murmurs, thick with need. “I want to take you to bed.” </p>\n<p>Jaskier doesn’t think he’s never been as hard as he is right now. He makes an unintelligible noise in the back of his throat, kisses Geralt so hard their teeth clash, then says, “Yes, please, <i>gods</i>.” </p>\n<p>Geralt stands and picks him up in one smooth motion, carries him to the bed in two steps and basically drops him in the mound of furs. Jaskier laughs, pulls Geralt down as best he can, kisses him thoroughly, deeply, runs his hands through his silver-white hair and bucks up against him. Geralt breaks the kiss, buries his face in Jaskier’s neck, husks, “Want to mark you.” </p>\n<p>No, Jaskier is pretty sure he’s never been as hard as he is right <i>now</i>. “<i>Fuck</i>,” he spits. “Are you trying to kill me, Geralt?”</p>\n<p>“Is that a yes?” </p>\n<p>“Fuck, yes, <i>right now</i>.”</p>\n<p>Geralt sucks a bruise into his neck where Jaskier knows he won’t be able to cover it tomorrow, bites the flesh gently, laves his tongue over the mark and then presses his knee between Jaskier’s thighs, rolls his hips slowly against him. “Want to touch you,” he murmurs, kissing his throat. “Want to come inside you. Want to make you scream my name.” </p>\n<p>“<i>Geralt</i>.” </p>\n<p>Geralt chuckles. “Yeah, like that,” he says, and claims Jaskier’s lips in a kiss. “Can I?” </p>\n<p>“Geralt, you can do whatever you want to me,” Jaskier gasps. “You don’t have to keep <i>asking</i>.” </p>\n<p>“You seem to like it when I ask,” Geralt says, then all of a sudden his hand wraps around Jaskier’s cock, hot and firm. “Or am I reading this situation wrong?” </p>\n<p>Jaskier groans. “It’s like a sexy threat,” he gasps, doing his best to thrust up into Geralt’s fist. “Fuck, Geralt, <i>get on with it.</i>”</p>\n<p>Geralt hums—because of <i>course</i> he hums—and gets on with it. </p>\n<p>His touch is hot and skilled, taking Jaskier apart with all the experience of his long years, keeping him on the verge of orgasm but never quite spilling over just enough that before long Jaskier’s <i>begging</i> him, incoherent and broken, arching off the bed. Geralt relents, kisses him fiercely, grabs one of Jaskier’s oils—the lavender, as it turns out—and opens him up relentlessly, masterfully, oh <i>gods</i>, and then he pauses, smiles an astonishingly filthy smile and twists his fingers <i>just so.</i> </p>\n<p>Jaskier’s answering whine is high and broken and panting. </p>\n<p>Geralt kisses his hip, wet and open-mouthed. “Lambert was right about that,” he murmurs, laughter in his voice, and Jaskier glares at him, mouth open in outrage – but then Geralt does it again, and whatever he was about say dies on his lips. “The noises you make,” Geralt says, shifting so he’s kneeling between Jaskier’s spread thighs. “Beautiful.” </p>\n<p>Jaskier groans. “Just fuck me, Geralt,” he husks out. “<i>Please</i>.” </p>\n<p>“Yes,” Geralt rumbles, voice cracking just a little, then he’s hoisting Jaskier’s legs up around his waist, sinking into him, rocking his hips in slow thrusts and, shit, fuck, <i>oh</i>, it’s so good. “Shit,” Geralt swears, adjusts the angle, thrusts harder – and okay, wow, now it’s even <i>better</i>. </p>\n<p>Jaskier comes with tears in his eyes and Geralt’s name on his lips. Geralt doesn’t last much longer. </p>\n<p>They lie together for a good while after, just breathing, sticky and sweaty in the fire-warmed air. Geralt shifts, eventually, cleans them up, gathers Jaskier’s discarded clothes and puts them in a slightly neater pile next to the table. Jaskier’s in enough of a dozy, fucked-out haze that it takes him a while to realise that Geralt hasn’t come back, and he opens his eyes, looks up, sees him standing to one side of the bed, that awkward look back on his face. “What are you doing?” Jaskier asks. </p>\n<p>Geralt’s eyes are so bright in the firelight. “Do you want me to stay?” </p>\n<p>Jaskier opens his mouth, closes it again, then hoists himself up on his elbows and reaches for Geralt’s hand. “I didn’t just bring you here to fuck me,” he says softly, pulling him back into the bed. “You said you’d give me everything, Geralt. That’s what I want. <i>Everything</i>.” </p>\n<p>Geralt hums deep in his chest, and smiles. </p>\n<p> </p>\n<p>Jaskier wakes in Geralt’s arms, sore and lazy and so fucking content that he never wants to move again. That plan is disrupted by the grumble of his stomach, unfortunately, and they get up slowly, leisurely, pausing for soft touches and long, slow kisses. Geralt disappears to his own room to grab a change of clothes and Jaskier goes straight to the small hall, finds Eskel there halfway through a bowl of Kaer Morhen’s finest porridge. </p>\n<p>“Morning!” Jaskier says brightly, trying to keep the smile off his face, then slides onto the bench next to Eskel, too close than is strictly necessary given they’re the only people in here.</p>\n<p>Eskel gives him a funny look. “What are you doing, Jaskier?” he asks – but then his eyes flicker to the bruise on Jaskier’s neck, his nostrils flare almost involuntarily, and his expression dissolves into a particularly delightful combination of disgust and despair. “Fuck’s <i>sake</i>,” he sighs. “What is <i>wrong</i> with you?”</p>\n<p>Jaskier laughs and moves to a more normal distance, grabs himself a bowl and starts eating. </p>\n<p>Eskel eyes him dubiously. “Tell me you’re going to take a bath.” </p>\n<p>Jaskier shrugs. “Maybe,” he says around a mouthful of porridge. “Maybe not, though. I’ve got a busy day. Might not have time.” </p>\n<p>Eskel stares at him for a second, then smiles a smile that’s downright <i>evil</i> – and before Jaskier really has time to figure out what’s going on, he’s being tossed over Eskel’s shoulder and bodily carried out of the small hall. “Eskel!” he barks, smacking as much of Eskel’s back as he can manage. “What are you doing? Where are you taking me? <i>Put me down!</i>”</p>\n<p>Eskel just pats the backs of his thighs. “You brought this on yourself,” he says, sweet as honey. </p>\n<p>“Eskel?” Jaskier hears Geralt ask, full of amusement.</p>\n<p>“Morning, Geralt!” Eskel answers, excessively cheery. “I’m just going to go give your bard a bath so I can get the smell of you two fucking out of my nose. Any issue with that?” </p>\n<p>“None at all.” </p>\n<p>“Geralt!” Jaskier yells, but is roundly ignored.</p>\n<p>Eskel pauses a moment longer, sniffs. “And I’m going to politely request that <i>you</i> have a bath too, Geralt,” he says. “Mainly because I can’t just throw you over my shoulder and <i>make</i> you.”</p>\n<p>Geralt just laughs. </p>\n<p>Eskel carries Jaskier to the bathhouse, kicking and shouting, and bodily dumps him in one of the pools, still fully clothed. He tosses a bar of soap at him, says, “<i>Wash</i>,” then bolts when Jaskier tries to splash him. </p>\n<p>Jaskier figures, well, he’s here now, so strips off his sodden clothes and washes. Twenty minutes later, Geralt turns up with a change of clothes for him and, well, they spend a little longer than Eskel probably expected in the sulphur-hot water. </p>\n<p> </p>\n<p>“That song you’ve been writing up on the eastern curtain wall,” Coën says to Jaskier one afternoon as they shovel snow off the training ground. “You ever going to perform it?” </p>\n<p>Jaskier shrugs. “Vesemir said that I could only sing it here,” he answers. “It’s a shame, because I think that the people of the continent really deserve to know the… <i>majesty</i> of this place – but I do get it. Witchers don’t exactly trust humans, and it’s probably best that they <i>don’t</i> know certain things. If I was going to sing of Kaer Morhen in the cities of the world, I’d have to… heavily edit it. If I just sing it here, I mean, you all know far more about this place than I do, anyway. Not like I’m giving any secrets away.” He leans against his shovel, kicks absently at the snow. “Which is all a long way to say that no, I probably won’t ever perform it for an appreciative audience.” </p>\n<p>Coën cuts another swathe through the snow with his shovel. “I meant are you ever going to perform it for us?” he asks, eyebrow raised. </p>\n<p>Jaskier pauses, then smirks. “I did specify an <i>appreciative</i> audience,” he says, and Coën snorts. “I don’t know,” Jaskier says after a moment. “I wasn’t sure anyone here would be interested in listening. Geralt was never traditionally particularly bothered about my music, although I guess Eskel was a little more engaged when I was performing on our way here.” </p>\n<p>“I’d be interested,” Coën answers. </p>\n<p>“That’s because you have <i>taste</i>.” </p>\n<p>Coën laughs. “Vesemir, too,” he says. “He’s mentioned it to me, seems intrigued.” </p>\n<p>“Really?” Jaskier asks, something oddly proud swelling in his chest – which is ridiculous because he’s been a bard for over twenty years now, he’s performed for more audiences than he can count, he’s entertained dukes and countesses, princes and queens. He really shouldn’t be getting excited over the approval of a grizzled old witcher who lives in a crumbling keep in the middle of the mountains. “Well, I suppose I could try it out on a <i>moderately</i> appreciative audience,” he allows. “Ciri’s royalty, she should know a quality composition when she hears it. And hopefully I won’t disappoint Vesemir’s expectations too much.” </p>\n<p> “Finish clearing the snow first,” Coën says, amused. “That’ll set you in good stead.” </p>\n<p>Jaskier grimaces. “I hate clearing snow,” he says, but grabs his shovel again. “We’ll just have to do it again in a few days. It’s <i>pointless</i>.” </p>\n<p>“The faster you shovel, the quicker it’s done,” Coën points out. </p>\n<p>Jaskier grumbles a little more, but shovels faster. </p>\n<p>It’s quiet, that evening, the snow laying thick and heavy over the keep like a shroud, and Jaskier brings his lute with him to dinner in the small hall. He’s played for the witchers and the princess before, of course, a couple of times, jaunty tunes before Ciri’s gone to bed, raunchy nonsense ballads afterwards, usually, but he’s never felt <i>nervous</i> before. He does now, though, and he’s quieter than usual as they eat, only having a <i>brief</i> argument with Lambert over the last slice of bread. </p>\n<p>Eskel’s sat next to him, and halfway through, he nudges him with his elbow. “You good?” he asks, soft enough that the others know to ignore him. </p>\n<p>Jaskier can feel Geralt watching from across the table, and he flashes them both a smile, nods. “I’m fine,” he says, taking a mouthful of ale. “I’ve just got a… debut performance in mind for tonight. Running some of the lyrics in my head.” </p>\n<p>Eskel seems to accept that as an explanation, but Geralt doesn’t look away. Jaskier meets his gaze, sees the concern there, the worry, because Eskel might be warm and easy and astonishingly friendly for a battle-hardened monster killer but Jaskier’s life has been intertwined with Geralt’s for two decades, now. Geralt knows he doesn’t get nervous about new songs. Geralt knows he has more than enough confidence in his own talents that he doesn’t <i>need</i> to get nervous – but here he is, regardless, clammy palms and uneven breaths. </p>\n<p>There’s a trust and a support in Geralt’s gaze that blazes like the fire in the hearth. </p>\n<p>Jaskier takes a breath, and turns his attention to his meal.</p>\n<p>“Go on, then, bard,” Lambert says, slouching back in his seat when they’ve picked the platters and bowls clean. “Sing us a song.” </p>\n<p>Ciri claps her hands loudly. “Yes!” she says. “A dancing song, I want to dance!” </p>\n<p>Coën laughs, ruffles Ciri’s hair. “How do you still have so much energy?” he asks. “Clearly we’re going to have to work you <i>twice as hard</i> tomorrow if you’ve got the strength for dancing.” He looks up at Jaskier, smiles an eager smile. “But I think the bard’s got something else in mind for tonight.” </p>\n<p>“Read my mind, Coën,” Jaskier says, getting to his feet and going to fetch his lute from the sidetable it’s laying on. “It’s <i>almost</i> as if we had a whole conversation about this this afternoon – what a remarkable coincidence.” </p>\n<p>Eskel snorts. “Get on with it, Jaskier,” he says. “At this rate, it’ll be spring before you even start.”</p>\n<p>Jaskier sniffs, strums a chord. “You can’t rush art, Eskel,” he says. “Even a <i>witcher</i> should know that.” </p>\n<p>Geralt is just sitting there, arms folded across his chest, medallion escaping from the neck of his shirt to glint in the candlelight. He’s watching Jaskier with a smile that’s practically fond, eyes bright and golden-rich, and there’s still hurt nestled in Jaskier’s heart, deep down, a hurt that will take a long time to fade away – but it’s moments like this, he thinks, that make it worth it. </p>\n<p>“I call this,” he says, not grand, not bombastic, just as open and honest as he can be, “<i>The Song of the Mountain Cold</i>.” He pauses, waves his hand. “I might change that, haven’t decided yet. An alternative was <i>The Song of the Mountain Wolves</i> but, you know, that’s maybe a bit on the nose, don’t want to be too obvious.” He reconsiders. “But obvious can be good sometimes, I suppose?” </p>\n<p>“Jaskier,” Geralt interrupts, soft and gentle.</p>\n<p>“Yeah,” Jaskier says. “Yeah, okay.” </p>\n<p>And he sings. </p>\n<p>In many ways, it’s not a complicated song. It’s more a simple narrative than a technical showpiece, the rhyme scheme fairly straightforward and the melody more liltingly lyrical than anything that’s going to win any prizes in Oxenfurt competitions – he’s composed far more complex pieces in a far shorter timeframe. But that’s the thing: this isn’t a song for a competition, it isn’t a ballad to be used for victory and glory. </p>\n<p>This is a song of Kaer Morhen, a song of the witchers and their home, of the things they’ve lost and the things they’ve suffered through – but at the same time it isn’t a sad song, no, how could it be a sad song when Jaskier came to this place and found such <i>beauty</i>? And yeah, sure, the landscape is beautiful and there’s more than a few stanzas devoted to the extravagance of the scenery and the quiet majesty of the keep – but what he’s singing about when he sings about the beauty of Kaer Morhen is the beauty of its <i>witchers</i>. Scarred and broken in their own individual ways, heartbroken and heartsick, handy with a sword and a shovel and a broom, full of stories and traumas and suffering – but still welcoming, still friendly, still <i>loving</i>. They’re a study in contradictions, an essay in complexities, and Jaskier would let all the technicians in the world scoff at his easy harmonies and smooth melodies if they’d just take another look at his witchers. </p>\n<p>Jaskier runs out of words before he’s ready to finish singing, so he just plays the notes of the last verse over and over again, hums the melody instead of singing it for as long as his voice holds out, then lets the sound peter out at its own pace until there’s nothing left but silence. </p>\n<p>When he looks up, Vesemir is standing in front of him with tears in his eyes. Jaskier’s too startled to react when he lifts a hand to lay against his cheek, just stands there as still as he can manage, not wanting to ruin whatever witcher ritual he’s found himself in the middle of, and then Vesemir pulls his head forward, presses their foreheads together, and says, “Thank you, bard.” </p>\n<p>A shudder runs through Jaskier’s spine, tremulous and somehow ecstatic all at once. Vesemir releases him, respect and honour and <i>gratitude</i> blazing in his eyes, and then Jaskier looks at the others and there’s a similar weight in all their faces, Geralt and Eskel, Coën and Lambert, even Ciri. </p>\n<p>Jaskier doesn’t quite know what to do. </p>\n<p>“Fuck,” Lambert spits, breaking the silence and wiping at his face with his sleeve. “Play something fucking happy next before we <i>all</i> start bloody crying.” </p>\n<p>“Fair enough,” Jaskier says, trying to suppress the smile that’s desperately twitching his lips, and launches into something a little less serious. He plays a dancing jig for Ciri, watches with a smile as she drags Coën up and whirls him around the small hall, then she demands a pavanne so she can teach him the steps which is just such an absurdly wonderful scenario that Jaskier obeys immediately. After the minuet that Ciri requests next, Coën declares that’s quite enough of that, scoops Ciri up and tosses her into the air, and Jaskier switches to a fast-paced song of martial strife and heroic deeds that seems to suit everyone’s tastes. </p>\n<p>He plays the evening out, fingers sore by the time Ciri’s escorted off to bed, hand in hand with Lambert, then comes to sit next to Geralt, shoulder pressed to shoulder, thigh to thigh. Eskel passes him a mug of ale which he drinks gladly, his throat tired and sore, and nods to him, a gesture of thanks and acceptance and sincerity that makes Jaskier’s heart stutter a little in his chest. He drains the ale slowly, watching Eskel return to his conversation with Coën and Vesemir, then puts the mug down on the table with a quiet thud. </p>\n<p>“It’s a good song,” Geralt says after a moment, his voice a rumble like thunder. </p>\n<p>“I know it is, Geralt,” Jaskier answers, brashness to cover the pride that swells in his heart. “It’s one of <i>mine</i>.” He pauses, sighs. “It’s just a pity it can’t leave the walls of the keep. It’d do well in the towns, maybe less so in the cities, and it would be useful, you know? Maybe get a few more people on the side of the witchers.” He shrugs. “But that’s alright. I have other songs.” </p>\n<p>Geralt doesn’t answer for a second. “You could sing it for me,” he says eventually, an awkwardness in his voice that Jaskier knows is born of trying to peel away years of control and emotional restraint. “And Ciri, I suppose. When there’s no one else around.” He pauses. “I’d like that.” </p>\n<p>Jaskier just stares at him, open-mouthed.</p>\n<p>Geralt looks embarrassed. “You don’t have to,” he starts to say – but oh, no, no, <i>no</i>, there is no <i>way</i> Jaskier is letting him retract that statement. </p>\n<p>He lunges forward, kisses Geralt as searingly hard as he can, winds his hands into his hair and practically climbs into his lap right there at the table in the small hall. Geralt makes a quiet noise of surprise but doesn’t seem averse to the whole situation, hands settling at his waist, holding him steady – and then what feels like a morsel of stale bread hits the side of Jaskier’s face and Eskel barks, “Get a fucking <i>room</i>!” </p>\n<p>Jaskier breaks the kiss but doesn’t leave his newfound position in Geralt’s lap. He finds the stale bread where it fell onto Lambert’s empty plate and throws it straight back, hits Eskel in the chest, laughs at the offended noise that Eskel makes and says, “You don’t like it, Eskel, <i>don’t look</i>.” </p>\n<p>Coën pulls a face. “I’m with Eskel,” he says, laughing. “This isn’t a damn brothel, bard. We don’t need to see that.” </p>\n<p>“We can already <i>hear</i> it well enough,” Eskel grumbles. “You’re not exactly bloody quiet, Jaskier. Geralt, can’t you <i>gag</i> him?” </p>\n<p>Much to Jaskier’s surprise, Vesemir <i>chuckles</i>, shaking his head fondly. </p>\n<p>Geralt hums. “That might shut him up long enough for a little peace and quiet,” he says, mock-thoughtfully.</p>\n<p>Jaskier smacks him in the chest. “Leashes, bells, gags, I am <i>horrified</i> by the things you witchers come up with.” </p>\n<p>Geralt smiles, his hand squeezing lightly at Jaskier’s hip. “You don’t <i>smell</i> horrified.” </p>\n<p>Jaskier’s pretty sure he blushes to his hairline, and Eskel snorts with laughter. “<i>Go</i>,” he says, hurling the tiny piece of stale bread at Geralt, this time. “I don’t want to have to look at you two making eyes at each other anymore. You have rooms, go use them. Or at least don’t use <i>this</i> room, yeah?” </p>\n<p>Geralt noses at Jaskier’s neck. “You did say you wanted me to have my way with you in every room in the keep,” he says, barely more than a breath, and Jaskier feels heat surge in his belly. </p>\n<p>Eskel wrinkles his nose. “I only heard half of that,” he says, long-suffering, “but I’m going to politely request one last time that the two of you fuck off before you start ripping each other’s clothes off on the table.” He shakes his head. “I should have let those Nilfgaardians take you, bard. That would have made my life a whole lot easier.” </p>\n<p>“In which case,” Jaskier answers, lofty and arch, “I should have left you to die with those wyverns, shouldn’t I? Should have just taken Llwyd and left you to bleed to death in the dirt. That would have been a <i>whole</i> lot simpler.” </p>\n<p>Geralt laughs, and Coën whistles admiringly. “You have a vicious tongue.” </p>\n<p>“I’m a bard,” Jaskier says, flashing him a bright smile. “It comes with the territory. Now, Geralt. Shall we go and fuck on Eskel’s bed?” </p>\n<p>“If you fucking <i>dare</i>—”</p>"
}