{
  "id": "23685499",
  "url": "https://archiveofourown.org/works/23685499?view_full_work=true",
  "author": [
    "inexplicifics"
  ],
  "title": "Your Faults Had Made Me Love You More",
  "rating": "Explicit",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "F/M"
  ],
  "fandoms": [
    "Wiedźmin | The Witcher - All Media Types"
  ],
  "relationships": [
    "Jaskier | Dandelion & Original Female Character(s)",
    "Yennefer z Vengerbergu | Yennefer of Vengerberg & Original Female Character(s)",
    "Cirilla Fiona Elen Riannon & Original Female Character(s)",
    "Triss Merigold & Original Female Character(s)",
    "Lambert (The Witcher)/Milena de Roggeven (Accidental Warlord Series - inexplicifics)"
  ],
  "characters": [
    "Lambert (The Witcher)",
    "Jaskier | Dandelion",
    "Eskel (The Witcher)",
    "Geralt z Rivii | Geralt of Rivia",
    "Cirilla Fiona Elen Riannon",
    "Yennefer z Vengerbergu | Yennefer of Vengerberg",
    "Triss Merigold",
    "Original Female Character(s)",
    "background Jaskier | Dandelion/Geralt z Rivii | Geralt of Rivia",
    "Milena de Roggeven (Accidental Warlord Series - inexplicifics)"
  ],
  "additional_tags": [
    "Flirting",
    "Bathing/Washing",
    "Fluff",
    "Menstruation",
    "Found Family",
    "Poetry",
    "Sparring",
    "POV Alternating",
    "Swearing",
    "Kaer Morhen's Fanon Hot Springs (The Witcher)"
  ],
  "language": "English",
  "series": "Part 5 of The Accidental Warlord and His PackPart 9 of The Accidental Warlord and His Pack - Recommended Reading Order",
  "published": "2020-04-16",
  "completed": "2020-04-22",
  "words": "21,467",
  "chapters": "7/7",
  "comments": "1,976",
  "kudos": "13,384",
  "bookmarks": "694",
  "hits": "186,016",
  "summary": "<p>Milena finds her feet in the White Wolf's court. Lambert attempts to figure out how to flirt.</p>",
  "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">notes</a>.)\n</p>\n<p>*<em>Faults</em>, by Sara Teasdale, from whose beautiful poems I have been drawing the titles for this series; all of her work is available on Project Gutenberg.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">notes</a>.)\n</p>\n<p>*<em>The Wanderer</em>, by Sara Teasdale</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_7_endnotes\">notes</a>.)\n</p>\n<p>Thank you all for your absolutely wonderful comments and support; I am so, so happy that this series is getting such a glorious amount of love. The series is not over, but the next installment probably won't start up until next week - I need to finish writing it first! Please feel free to come fling ideas at me either on tumblr or discord.</p>",
  "text": "<p>Milena wakes up on her third morning as part of the White Wolf’s court to a gentle knocking at her chamber door. It’s not long after dawn - the light through her new room’s shuttered window is still grey and dim - and she’s still a little bleary from last night, but if someone’s knocking, it’s probably important.</p>\n<p>It’s a lad in the plain clothing of the keep’s servants, who grins up at her and says, “Bard Jaskier invites you to join him in the hot springs, if you’d like.”</p>\n<p>Even if Jaskier weren’t her friend, such an invitation would be priceless. The White Wolf’s <em>Consort</em> inviting her to...well, anything...is a compliment no noblewoman could possibly turn down. Even if what he’s inviting her to is the absolutely scandalous shared baths of Kaer Morhen.</p>\n<p>“Tell him I am delighted to do so,” she asks the lad, and closes the door to survey her new rooms in a bit of a panic. She has toweling in the chest at the foot of the bed - she saw it last night when she was looking for spare quilts, as Kaer Morhen is <em>cold</em> even in midsummer - but what does one wear to join a Warlord’s Consort in the <em>baths</em>?</p>\n<p>...Nothing at all, presumably. <em>Getting</em> there, though, is going to be cold.</p>\n<p>She puts on her heaviest dressing gown and makes a bundle of toweling and the day’s clothing, and ventures down through the twisting corridors, feet almost noiseless in thick fur slippers - a gift from Jaskier, as it happens. He’s waiting for her at the entrance to the baths, wearing a dressing gown much like her own, with a swatch of toweling thrown over his shoulder and a bright smile on his face.</p>\n<p>“Good morning!” he says, bowing her into the vast cavern ahead of him. “Don’t worry, it’ll be fine. Nobody will give you any trouble, I promise, and it’s not crowded at this time of day. No Witchers at all.” He winks. “If you want to see Lambert naked, you’ll have to come back again later.”</p>\n<p>Milena feels her cheeks go very hot. “You’re <em>dreadful</em>,” she says faintly. Lambert is a very handsome man, and she would almost certainly not be able to look at him <em>naked</em> without dying of embarrassment.</p>\n<p>“So I am,” Jaskier says, chuckling.</p>\n<p>Milena follows him over to one of the warmer pools, where two women are already soaking. One is Triss Merigold, who has already proven to be quite kind when not irritated - she is a delightful tablemate, far more pleasant than Marta ever was. The <em>other</em> is the absolutely terrifying Lady Yennefer. They both smile at Jaskier as he puts his towel down beside the pool, strips off his dressing gown - Milena hastily averts her eyes - and slides into the water.</p>\n<p>“And have you been thoroughly claimed, little flower?” Lady Yennefer asks Jaskier with a wicked smile.</p>\n<p>“Hm,” says Jaskier, sounding <em>astonishingly</em> pleased with himself. “And when have you ever known Geralt to skimp on his duties?”</p>\n<p>“Especially not when they’re so pleasant,” Lady Yennefer says, chuckling, and then looks up at Milena where she’s dithering on the side of the pool. “Oh, come on in, girl, I won’t bite.”</p>\n<p>Milena swallows hard and puts her bundle down, and firmly pretends she’s the only person in the room as she takes off her dressing gown and steps down into the water. Jaskier, bless the man, looks the other way politely, not looking back at her until she’s submerged up to her shoulders. The water is not exactly <em>cloudy</em>, but it’s mineral-rich and opaque enough that she can pretend she’s wearing a particular daring gown and not just - naked. In public.</p>\n<p>“How was the library, the other night?” Triss asks her.</p>\n<p>Milena’s cheeks flush again. “It’s a very nice library,” she says. It <em>is</em> quite a nice library, large and well-cared-for, even if most of the books in it are about war or monsters. She wasn’t there for the <em>books</em>. She was there because Lambert had invited her, and she would have gone almost <em>anywhere</em> he’d asked when he gave her such a hopeful look as he had.</p>\n<p>“How was <em>Lambert</em>?” Jaskier asks, and Milena puts both hands over her bright red cheeks.</p>\n<p>“He was a perfect gentleman,” she says, knowing her voice is squeaky with embarrassment.</p>\n<p>“Our Lambert, a gentleman?” Lady Yennefer drawls.</p>\n<p>“Well,” Milena allows, “he only swore every <em>third</em> word or so. And he <em>did</em> offer me his arm, and said my dress looked nice.”</p>\n<p>Lady Yennefer’s perfect eyebrows go up. “Alright,” she says, sounding a little taken aback. “I stand corrected. For Lambert, that <em>is</em> being a perfect gentleman.”</p>\n<p>“Have you asked him about dagger lessons yet?” Jaskier asks. Milena glances over at him, and sees that he’s not looking at her at all, eyes closed as he soaps up his hair.</p>\n<p>“Not yet. It’s been...a bit hectic since you suggested it,” Milena admits.</p>\n<p>“Oh, just a little stabbing, our Wolf intimidating the entire court of Temeria, a brawl, and then our little songbird being named Consort to the Warlord of the North,” Triss says, grinning. “Practically a quiet week!”</p>\n<p>“Downright boring,” Lady Yennefer says dryly.</p>\n<p>“Speaking as the person who got stabbed <em>and</em> got proposed to, I take offense at that,” Jaskier says, and submerges to rinse his hair. Lady Yennefer chuckles.</p>\n<p>“So you’re to be the little menace’s lady-in-waiting,” she says to Milena.</p>\n<p>Milena nods. Triss hands her a bar of scented soap - very nicely scented rosewater, in fact - and she starts to wash, trying hard not to slosh the water too much and splash her neighbors. “The Warlord was pleased to allow me to serve her,” she says.</p>\n<p>“You’re going to have to get used to calling him something else,” Jaskier says, shaking the water out of his hair and lounging back against Lady Yennefer’s shoulder. She sniffs like she’s offended, but she also curls an arm around his shoulders and scritches her nails through his hair gently. “He’s not terribly fond of that title.”</p>\n<p>“What <em>should</em> I call him?” Milena asks, swallowing hard. She can’t just call him <em>Geralt</em>. Even if she’s sworn herself to him, he’s still <em>far</em> too intimidating to call by his bare <em>name</em>.</p>\n<p>“White Wolf is fine,” Jaskier says, closing his eyes and making a pleased humming noise. He looks very relaxed. Milena can’t imagine how he manages to be so fearless around so many <em>terrifying</em> people. “Or just <em>the</em> Wolf. I called him ‘my lord’ for most of a year.”</p>\n<p>“And then Eskel tells me you called him ‘my Geralt’ instead,” Triss says, winking at Milena. Jaskier’s eyes fly open and he flails, splashing all of them.</p>\n<p>“Dammit,” he says, “that was a <em>slip of the tongue</em>, ooh, when I get my hands on Eskel -!”</p>\n<p>Triss and Lady Yennefer are both laughing, and Milena finds herself giggling too. “You’ll what,” Lady Yennefer teases, “admit that everyone else knew you two were in love <em>well</em> before you ever noticed?”</p>\n<p>“Hmph,” Jaskier says, crossing his arms over his chest and pouting ostentatiously. “You’re dreadful and I don’t know why I like you.”</p>\n<p>“You like us <em>because</em> we’re dreadful,” Triss says. “Except Milena, I suppose. Are you dreadful, lass?”</p>\n<p>“Not usually,” Milena says. “I...could learn?” Because oh, it looks like so much <em>fun</em>, this easy teasing, this happy camaraderie. She’s only a duke’s third daughter, youngest and least-regarded, nothing like as exalted as a sorceress or the Warlord’s own chosen consort, but she’d like to be properly part of this, if she can.</p>\n<p>“That’s the spirit,” Triss says, giving her a warm smile. “Got to have teeth to survive in this court, lass, but so long as you have ‘em, no one will give you too much trouble.”</p>\n<p>“I’ll try,” Milena says. In Redania’s court, a duke’s third daughter who dared to have <em>opinions</em>, much less be <em>snippy</em>, was one who would swiftly find herself married off to a particularly odious nobleman and sequestered at his estate...but she’s not in Redania anymore. As Princess Cirilla’s lady-in-waiting, she can’t be married without the princess’s permission - and everyone in Kaer Morhen seems to <em>know</em> that Lambert is courting her, or at least thinking about starting to court her, and to at the very least be willing to see how that goes.</p>\n<p>“You’ll do fine,” Jaskier says. “You’ve steel in your spine, and you’re clever enough to see past all of Lambert’s...Lambert-ness to the good man underneath. It took <em>me</em> months and months to get my feet properly under me. Don’t worry if it takes you a little while, too.”</p>\n<p>Milena smiles gratefully at him. “I can’t imagine you being uncomfortable here,” she admits. “You’re so happy, and you <em>fit</em> so well.”</p>\n<p>“Oh, I was scared out of my wits when I got here,” Jaskier admits, shrugging. Lady Yennefer wrinkles her nose and nods agreement.</p>\n<p>“Thought you were going to faint at the Wolf’s feet,” she says.</p>\n<p>“So did I,” Jaskier says. “Believe me, no one was more surprised than I was that I managed to keep my wits about me.”</p>\n<p>“Takes more than Geralt glowering to render <em>you</em> witless, bard,” Triss says.</p>\n<p>“Yes, these days he does it by smiling,” Jaskier says. “Or -” he glances at Milena and doesn’t finish the sentence, but by the way he wiggles his eyebrows he was thinking something <em>truly</em> filthy. Lady Yennefer snorts a surprisingly inelegant laugh, and Triss giggles so hard she slips briefly underwater. Milena resigns herself to the fact that living in Kaer Morhen is going to involve being embarrassed a <em>lot</em>.</p>\n<p>It’s worth it.</p>\n<p>She follows Jaskier and Triss and Lady Yennefer to breakfast, which is an extremely informal meal in this odd place, and then Jaskier beckons her to follow him up to Princess Ciri’s room.</p>\n<p>The young princess is...almost as disconcerting as her imposing father, honestly. Milena has heard her referred to more than once as ‘little menace,’ and it seems like a good moniker for a girl who delights in pranks and practical jokes, and also can perform feats of acrobatics and weapons prowess that would challenge most of the trained, adult warriors Milena has ever met. She’s not much like any other princess in the world.</p>\n<p>Then again, if she <em>were</em> much like any other princess, she’d be <em>miserable</em> in Kaer Morhen, so it’s probably just as well.</p>\n<p>“Mornings, I teach Ciri anything academic I can get her to sit still for,” Jaskier says as they climb up and up and <em>up</em> the spiral stairs to the princess’s room. “History, geography, maths, a little bit of music theory, court etiquette, anything else that comes up. She’s <em>very</em> bright, but sitting still is not her favorite thing in the world. Afternoons, she has training with Eskel and Vesemir and Geralt for weapons, and then they turn her over to Yen and Triss for magical stuff. I stay <em>well</em> out of that, and I advise you do the same. She’s not got perfect control yet.”</p>\n<p>“I have no magical talent whatsoever,” Milena says. “Is anyone teaching her embroidery, or painting, or penmanship? What other languages does she speak?”</p>\n<p>“And <em>that</em> is why you’re going to be useful,” Jaskier says, beaming. “I don’t entirely know what noble<em>women</em> learn. She <em>does</em> have a decent grasp of Elder Speech and Nilfgaardian, and can swear in Skelliger.”</p>\n<p>Milena giggles despite herself. “Let me guess - Lambert?”</p>\n<p>Jaskier winks. “You know it.”</p>\n<p>“I speak decent Nilfgaardian, so I can practice that with her,” Milena offers.</p>\n<p>“Lovely!” Jaskier says. “If you want to try to teach her embroidery, be my guest, but I suspect you’ll have more luck if you point out that tidy sewing will be useful for patching up injuries. She’s a bloodthirsty little thing.”</p>\n<p>“Runs in the family?” Milena offers.</p>\n<p>Jaskier frowns. “It doesn’t, actually,” he says. “Geralt’s <em>not</em> bloodthirsty, is the thing. He kills monsters because they’re dangers to other people, but given the choice, he wouldn’t raise a hand against <em>anyone</em>.”</p>\n<p>Milena pauses on the landing and blinks at him, trying <em>desperately</em> to make that sentence make sense. The Warlord of the North, the White Wolf, the terror of the continent, the man whose unstoppable inhuman armies strike fear into the hearts of monarchs from Skellige to Zerrikania, Poviss to Nilfgaard…</p>\n<p>Doesn’t like to kill?</p>\n<p>But then...he hasn’t joined any of the brawls in the great hall - hasn’t even seemed to want to. He’s never less than gentle with Princess Ciri, or with Jaskier, and his interactions with his warriors are <em>friendly</em>, bluff and cheerful as a basket of playful wolf cubs. He <em>does</em> spar with people out on the training grounds, and beats them, too, but that’s…</p>\n<p>Well, that’s <em>duty</em>, isn’t it. It’s his <em>job</em> to be the finest warrior in the world. But aside from that one elk, on that dreadful hunting trip, Milena’s never seen the White Wolf actually <em>kill</em> anything, and the elk died swiftly and as painlessly as possible, and moreover was <em>food</em>, not a trophy slain merely for bragging rights.</p>\n<p>Several things rearrange themselves in her head, like puzzle pieces that have been put in all wrong and need to be flipped around until they fit.</p>\n<p>She’s known Jaskier was really and truly in love for a while, and she’s heard him say a dozen times and more that he considers the White Wolf <em>magnificent</em>, but it’s still been baffling, how someone as lively and cheerful as Jaskier could fall for such a gruff, glowering, <em>threatening</em> man. But if the White Wolf is…</p>\n<p>Is <em>gentle</em>. Is as kind as Jaskier is - kinder, maybe, Milena has no illusions about how much of a nasty streak Jaskier conceals under the sweet smiles, though he only unleashes it at people who have truly wronged him or those he considers his - and as <em>good</em> as Jaskier’s songs insist. If he is, indeed, <em>magnificent</em>…</p>\n<p>Well, Jaskier’s obvious adoration makes a lot more sense.</p>\n<p>“She learned it from Lady Yennefer, then,” Milena says, keeping her voice carefully light, and Jaskier laughs.</p>\n<p>“You know, you might have something there,” he says, and pulls open the princess’s door.</p>\n<p>Watching Jaskier teach is enlightening. He’s a <em>good</em> teacher, though Milena rather expected that: clear and gentle and willing to explain things over and over in different ways until Princess Ciri truly understands. He also very clearly <em>adores</em> the girl, as much as if she were his daughter - more, maybe, than most nobles love their children.</p>\n<p>He pulls Milena in, too, and Princess Ciri seems delighted to have someone else to practice Nilfgaardian with and to help her puzzle over her maths. Milena <em>likes</em> maths - a good trait for a noble daughter, given that she’s always expected she’d have to run a household someday - and manages to coax Princess Ciri into being interested in a particularly thorny problem by talking about how many yards of cloth and thread are needed to make a dress, and working from there. Princess Ciri apparently has <em>never</em> sewn a dress. Milena shows her the difference between seamwork and embroidery, using the hem and decoration of her own dress as examples, and Princess Ciri asks dozens of questions so rapidly Milena can barely keep up, and Jaskier sits back and grins at both of them and hums little snatches of melody now and again.</p>\n<p>They go down to dinner together with Princess Ciri <em>still</em> asking questions nineteen to the dozen, but when they get to the table, Jaskier pauses, looking taken aback.</p>\n<p>Milena eyes the high table, wondering what has startled him. It looks much as it always does -</p>\n<p>Ah. No. Eskel is <em>already</em> at the table, and he’s sitting one chair <em>away</em> from the White Wolf’s tall seat.</p>\n<p>“What the <em>fuck</em>,” Jaskier squeaks.</p>\n<p>“Well, we haven’t gotten the double-wide chair made yet,” Eskel says, smirking. “<em>Consort</em>.”</p>\n<p>“But,” says Jaskier. “You. I.”</p>\n<p>Milena exchanges a look with Princess Ciri, who is clearly having just as much trouble not laughing as Milena herself is.</p>\n<p>“Sit down,” Eskel says, almost gently. It’s hard to reconcile this patient, even-tempered man with the snarling wolf who threw the noblewomen out of Kaer Morhen not two days past. “Our Wolf will be happier if you’re within arm’s reach, and you know it.”</p>\n<p>Jaskier sits down. “You don’t mind?” he says, very faintly.</p>\n<p>Eskel shakes his head. “I really don’t,” he says. “You’re not taking my place.” His smile gets a little toothy. “We’re just keeping you safe between us.”</p>\n<p>Jaskier gets a <em>very</em> strange look on his face and nods. “Alright then. I guess I can’t argue with that.”</p>\n<p>Eskel gives Ciri a conspiratorial half-smile. “Jaskier, if there is one thing I have learned since you got here, it’s that you can argue with <em>anything</em>.”</p>\n<p>Jaskier snorts. “Oh, fuck you,” he says, but he’s smiling.</p>\n<p>Milena curtsies to Ciri and retreats to her own chair, further down the table. Jaskier and Eskel can hash that out on their own, and she’s not <em>quite</em> feeling up to facing the White Wolf today. He may be her new liege lord and her princess’s father and a truly noble man, but he’s also <em>really</em> intimidating.</p>\n<p>Someday, maybe, she’ll be able to jest with him as the sorceresses do. But not today.</p>\n<p>Lambert finishes his dinner <em>far</em> too quickly, and then sits there contemplating his ale mug until Eskel snorts and elbows him - gently, for Witchers - and says, “Go on, then. She keeps looking at you.”</p>\n<p>“She what?” Lambert says, and instantly regrets it. He peers down the table, past Eskel and Buttercup and Geralt and the cub and Yennefer and Vesemir and everyone, and sure enough, Milena is peeking <em>up</em> the table, face half hidden behind a goblet of wine - oh, interesting, Yennefer must like her, that’s new - and her cheeks go pink when she sees Lambert looking, and she ducks her head like she really was just taking a drink.</p>\n<p>And then she puts her goblet down and looks up again, shy and nervous, and meets his eyes, and blushes <em>worse</em>, and smiles.</p>\n<p>Lambert falls back in his chair like he’s just been kicked in the chest by a mule. (An experience he has, regrettably, actually <em>had</em>. Mules are bastards.) <em>Fuck</em>, she’s so - she’s so fucking <em>sweet</em>, what’s she doing smiling at a miserable asshole like him?</p>\n<p>Eskel props his chin on a fist and gives Lambert a thoughtful look. “Damn,” he says after a moment.</p>\n<p>“Fuck you,” Lambert says, mostly on instinct.</p>\n<p>“No thanks, you’re not my taste at all,” Eskel says. “Apparently you’re Milena’s, though, gods know why. She’s got nothing to do this afternoon. You should do something about that.”</p>\n<p>“Fuck you,” Lambert says again, and gets up. What - what the fuck should he <em>say</em>?</p>\n<p>Buttercup leans back and taps his elbow as he goes by. “Want some advice?”</p>\n<p>Lambert nods. He doesn’t <em>think</em> Buttercup will fuck with him. Not about this. Buttercup’s got a perfectly good mean streak, but only when someone’s <em>earned</em> it.</p>\n<p>“Two suggestions,” Buttercup says. “She got moved to a new room; you could ask if she needs anything - furniture moved, that sort of thing.” Lambert nods. Moving furniture is easy. Or he could show her where the big communal linen cupboards are, if she needs more quilts or something.</p>\n<p>“Or, if you <em>really</em> want to get her attention, offer to teach her to use a dagger.”</p>\n<p>Lambert gapes. “She - but - <em>me</em>?”</p>\n<p>“You’re good with Ciri,” Geralt offers. There’s a smile lurking around his mouth, but he’s <em>not</em> teasing, which is so kind it makes Lambert want to hit something.</p>\n<p>The cub nods enthusiastically. “You’re a <em>good</em> teacher, Uncle Lambert!” she says, and then grins, bright and fierce. “You’ve gotta be nice to Milena, ‘cause she’s my lady-in-waiting and I gotta protect her. But I bet she’d like it if you taught her daggers. And she could teach you something! She’s going to teach <em>me</em> embroidery.”</p>\n<p>That’s...a lot of information, right there. “Dunno if I want to learn embroidery, cub,” Lambert says, because that’s the safest bit of that whole pile of words.</p>\n<p>“Aw,” Buttercup says, and hides a grin (badly) behind his hand. Yennefer snorts into her wine goblet.</p>\n<p>“Fuck you,” Lambert tells them, and adds to the cub, “I’ll be nice. Or. I’ll try.”</p>\n<p>“Alright,” the cub agrees, nodding. Lambert heads down the table before that conversation can turn into even <em>more</em> of a clusterfuck. If this is how <em>Buttercup</em> felt when they were all betting on when Geralt was finally going to fuck him, Lambert suddenly has a <em>lot</em> more sympathy for the man.</p>\n<p>Milena looks up and smiles when he reaches her, and rises. She’s so fucking <em>dainty</em>. Her head barely comes to his shoulder, and he could span her waist with his hands. <em>Her</em> hands are slender and elegant and she’s got rings on half of her fingers - little silver things, delicate and pretty - and her dark hair is braided in some sort of elaborate pattern that Lambert couldn’t recreate if he tried, with a ribbon threaded through it that catches the light. She smells like roses. It’s very distracting.</p>\n<p>Teach her to <em>fight</em>? Are they all insane? He’d fucking <em>break</em> her!</p>\n<p>...Though he’s never actually hurt the cub. If he just treated her like she’s as small as the cub is...which she almost <em>is</em>, Ciri’s a tall child and Milena’s <em>not</em> a tall woman...it could maybe work?</p>\n<p>“I,” he says, and runs out of words that aren’t <em>fuck</em> or possibly <em>help</em>.</p>\n<p>Milena cocks her head at him curiously. “Have you perchance a free afternoon?” she asks. Lambert nods mutely. She blushes, but she meets his eyes squarely. “Might you wish to - ah - spend it in my company? Perhaps?”</p>\n<p>Lambert nods again, far too eagerly. Fuck, why can’t he <em>talk</em>? “Buttercup said,” he says, and stops, because <em>fuck</em>, does she even know who he means?</p>\n<p>“Buttercup?” Milena asks, and then giggles. It’s fucking <em>adorable</em>. Lambert is not used to thinking of things as <em>adorable</em>. Adorable is for - for children talking about bunnies, or something like that. But Milena is adorable. Fuck it. “Do you call Jaskier ‘buttercup’?”</p>\n<p>Fuck. “Yes,” Lambert says, and Milena giggles again, hiding it behind a hand, and blessedly doesn’t make a big deal out of it.</p>\n<p>“What did he say?” she asks.</p>\n<p>“Said you - I could - daggers?” Fuck, he’s a <em>lot</em> more eloquent than this, really he is.</p>\n<p>“Oh!” Milena says, lovely dark eyes going wide. “I would very much like to learn to use a dagger, if you wanted to teach me.”</p>\n<p>Huh. That...was a lot easier than Lambert thought it would be. He offers her his arm, because that seemed to please her when they went up to the library the other night, and she tucks her delicate little hand into the crook of his elbow and smiles up at him.</p>\n<p>There’s an indoor training salle that doesn’t get used much - Witchers like to train outside unless it’s <em>truly</em> unbearable - so he leads her that way. They’re halfway there when he looks down at her slender hands and realizes <em>his</em> daggers will be far too unwieldy. Armory, then. They must have <em>something</em> small enough.</p>\n<p>Milena’s eyes go wide when he opens the door to the armory. “That is...a lot of swords,” she says faintly.</p>\n<p>“Yes,” Lambert agrees, and heads for the racks of daggers. The smaller ones - the ones for the younger trainees - are near the front. Most of them are <em>still</em> probably too heavy for her; Lambert doesn’t know if dukes’ daughters get any sort of strength training, but he’s guessing no. But there’s a couple sets that various Witchers have brought back just because they were <em>pretty</em>; especially Crane Witchers, who really ought to be called <em>Magpie</em> Witchers if you ask Lambert, with the way they tend to pick up shiny things and bring them home.</p>\n<p>“Here,” he says, plucking one slender knife off the rack and holding it out hilt-first. “Is this too heavy?”</p>\n<p>Milena takes it warily, like she’s worried it’s going to bite. Lambert shakes his head and reaches out to adjust her grip so the knife won’t just fall out of her hand the first time she does <em>anything</em>, and realizes rather belatedly that he’s just <em>touched</em> her, skin to skin, when he’s already got his hand wrapped around hers.</p>\n<p>“Fuck,” he says, ears burning. Her skin is very soft, and her hand is so much <em>smaller</em> than his.</p>\n<p>“Um,” Milena says, blushing just as hard as he is. “Is this - how I should hold it?”</p>\n<p>Lambert’s horrid, treacherous brain provides him with a <em>completely different</em> context in which she could be asking that, and he wonders if it’s too late to just throw himself off the Trail and pretend he never passed his Trials. “Yes,” he says, sounding rather strangled to his own ears. “You want to grip tight enough you won’t drop it, but not so tight as your fingers cramp up.”</p>\n<p>“I see,” Milena says. Lambert is still holding her hand. He lets go as if burnt.</p>\n<p>“Is it too heavy?” he asks again.</p>\n<p>Milena hefts the dagger thoughtfully, fingers curled in a much better grip now. “I don’t think so,” she says after a moment.</p>\n<p>“Right,” Lambert says, and grabs the matching one off the rack. “We’ll - I can get you sheaths for those. If they work.”</p>\n<p>Milena nods. “Should I -” she says, pauses, frowns a little - oh no, the little crease in her forehead and the way her <em>nose</em> wrinkles, it’s not <em>fair</em> - “At home, I think the guards trained with blunt weapons, or wooden ones. Should I…?”</p>\n<p>Lambert...honestly hadn’t thought of that, because Witchers <em>don’t</em> use practice weapons. They train with live steel. But Milena isn’t a <em>Witcher</em>, and if <em>she</em> gets hurt, she won’t heal in minutes the way Lambert would. “I’ll use a stick,” he says. “I won’t hurt you.” Fuck, the idea of drawing blood - no. <em>Fuck</em> no. Every Witcher in the keep is still recovering from the horrid smell of <em>Buttercup’s</em> blood; Lambert sure as fuck won’t be adding <em>Milena’s</em> to that.</p>\n<p>Milena blinks up at him. “I suppose you aren’t worried about me hitting <em>you</em>,” she says after a moment, with a little smile.</p>\n<p>“Well, you probably won’t,” Lambert says, quite honestly. “And I’ll heal. I mean, unless you get <em>really</em> lucky and hit an artery or something.”</p>\n<p>“I should very much prefer not to do that,” Milena says, looking a little ill at the thought.</p>\n<p>“You won’t hit me,” Lambert assures her. “I mean. To start with it’s all drills anyhow. You won’t actually be <em>trying</em> to stab me for a while. Unless I fuck up, I guess.”</p>\n<p>Milena giggles, which is better than looking ill. “Alright,” she says. “If you’re sure.”</p>\n<p>Lambert nods, and leads her down the corridor to the training salle. It’s a big room, and empty except for the two of them; everyone else is outside. Lambert doesn’t particularly want an audience for this, though. Heckling would be...he would probably lose his temper and punch someone.</p>\n<p>“Alright,” he says, putting the spare knife down on one of the benches. “So. First thing. Don’t stab yourself.”</p>\n<p>Milena blinks at him for a moment, and then, slowly, <em>grins</em>. It’s broad and sweet and <em>oh fuck</em> but she’s beautiful. What else can he say that will make her smile like that? He didn’t <em>mean</em> for that to be a joke - it’s one of the things Vesemir tells the trainees - but if she’s going to <em>smile</em> at him -</p>\n<p>“The pointy end goes in the other person?” she asks. “That’s what I’m told, at least.”</p>\n<p>She’s <em>jesting</em> with him, and smiling. Fuck. Lambert has to clear his throat before he can respond properly. “Yeah, the - the pointy end goes in the other guy. Very important.”</p>\n<p>Milena nods. Lambert swallows. “Second thing is, is stance,” he says. “Balance. If you get knocked over, that’s not good. So. Like this.” He plants his feet the way every Witcher is taught, so that he can move in any direction easily, knees slightly bent, ready for action. They learn this well before the Trials, well before they’re ever given live steel to play with: stand just so, move this way, quick and agile and balanced, because if you get knocked over, it’s fucking hard to get up again before whatever’s trying to kill you gets a chance to finish the job.</p>\n<p>It’s hard to tell if Milena has the stance right, what with her skirts and all. This would be easier if she wasn’t wearing them.</p>\n<p>If she was wearing <em>trousers</em>. Not if she was. If she was.</p>\n<p>Lambert puts his face in his hands and curses quietly. Fuck his <em>brain</em>.</p>\n<p>“Are you well?” Milena asks. She smells concerned. She <em>looks</em> concerned, when Lambert peeks out between his fingers.</p>\n<p>“I’m. Fine.” Lambert says, and hauls his mind back onto <em>dagger training</em> with an effort. “Right. So. If you stand like this, you can go forward or back or sideways easily, see?”</p>\n<p>Milena watches him carefully, and then tries to imitate him. After a moment she frowns, and puts the knife down on the bench, and hikes up her skirts a little, and <em>oh fuck</em> Lambert can see her <em>ankles</em>.</p>\n<p>Lambert has <em>actually fucked whores</em>, alright, he is a grown Witcher and has been on the Path for <em>decades</em> and knows what a naked woman looks like and he should not be <em>completely distracted</em> by the sight of a pair of slender ankles in pretty blue silk stockings. Fuck.</p>\n<p>They’re really nice ankles, though.</p>\n<p>“Like this?” she asks, and Lambert crouches down so he can see properly.</p>\n<p>“Left foot a little more turned out,” he says after a moment. “And bend your knees a little more. Yeah. Like that.”</p>\n<p>Milena tries a couple of steps - forwards, backwards, left, right. “Oh!” she says. “It’s a little like dancing, isn’t it?”</p>\n<p>“I...guess it is,” Lambert says, thinking about Buttercup teaching them how to do courtly dances before that trip to Redania. The stance <em>is</em> a little similar.</p>\n<p>“Well, that helps,” Milena says, and shifts her weight a little, and <em>now</em> she’s moving properly, fluid and easy. “I like dancing.”</p>\n<p>Lambert stands up. “Then think of it like dancing, but with knives,” he says. “And. Well. Stabbing your partner, I guess.”</p>\n<p>“I have had a fair number of dancing partners I would have preferred to stab,” Milena says thoughtfully.</p>\n<p>“Hopefully not me yet,” Lambert says. He’s danced with her a dozen times now, to Buttercup’s pretty music, and she’s always <em>seemed</em> happy about it - has asked <em>him</em> to dance, in fact, and more than once at that. She wouldn’t have done that if she didn’t want to, right?</p>\n<p>“Definitely not you,” Milena says. “<em>You</em> are not a handsy lecher three times my age.”</p>\n<p>“Um,” Lambert says, frowning. “I probably <em>am</em> at least three times your age.” That’s bad, right? That’s probably bad.</p>\n<p>Milena blinks at him. “Really? You don’t look it.”</p>\n<p>“Witchers don’t age much,” Lambert says. “I’m…” he does some quick math in his head; he lost count a while back, since it doesn’t come up much. “Eighty-something?”</p>\n<p>Milena cocks her head and considers him thoughtfully. “More like four times my age, then,” she says at last. “Still not a handsy lecher, though, and I don’t think you’re on the lookout for a third wife to care for you in your dotage.”</p>\n<p>Fuck, Lambert hates everything about that sentence and what it implies about Redania’s court. “Not anywhere near my dotage,” he says at last. “Got another few hundred years to go at least.”</p>\n<p>Milena’s eyebrows go up. “...How old is Master <em>Vesemir</em>?” she asks at last.</p>\n<p>“Not sure,” Lambert shrugs. “Three hundred, something like that?”</p>\n<p>“Gracious,” Milena says. “Well. Alright.”</p>\n<p>“So fighting’s a little like dancing,” Lambert says, attempting desperately to get this conversation back to something a little less uncomfortable than the reminder that Milena is so fucking <em>young</em>, and sweet, and what is she doing smiling like that at a prickly asshole like <em>him</em> anyway? “So. Um. Try and - try and keep the distance between us the same.”</p>\n<p>Milena frowns a little, brow furrowing in concentration - oh no, <em>that’s</em> adorable too - and nods. Lambert steps forward, and she steps back, keeping her balance easily. Forward, back, left, right, varying the distance and the direction at random, Lambert leads her around the salle, and she keeps her eyes on his chest - <em>good</em>, that’s where she <em>should</em> watch, where the first sign will be if he moves his arms - and matches him, stepping light and easy the way she does on the dance floor.</p>\n<p>He stops when her heartrate starts to kick up to what he’s pretty sure is a little too fast, and there’s little beads of sweat along her hairline. She kept up, though. She kept up really fucking well.</p>\n<p>“Good job,” he says, and her cheeks go pink. “Next time, holding the knife. Just to get used to the weight.”</p>\n<p>“That makes sense,” she says, smiling up at him. “No wonder you’re such a good dancer, if you learned to do <em>this</em> first.”</p>\n<p>She thinks he’s a good dancer. She <em>likes</em> dancing with him. Lambert’s ears are burning again. “If dancing’s got anything to do with fighting, you’ll be pretty good with knives,” he offers, hoping desperately that it comes across as the compliment he means it to be. He’s not <em>used</em> to giving compliments.</p>\n<p>Milena gives him such a sweet smile he thinks his heart might stop. “Why thank you,” she says, all courtly poise and delicacy. Fuck, what <em>is</em> she doing spending time with a coarse fucker like him?</p>\n<p>He’s selfish enough not to <em>ask</em>, because then she might realize what a bad idea it is. But he really, really wants to know why - why she’s <em>here</em>, in this cold dark keep, talking to him, learning from him, dancing with him, <em>flirting</em> with him, when she’s so clearly <em>made</em> for southern courts and delicate courtship and the sort of soft-handed noble sons who never learn to use a sword heavier than a rapier and even <em>that</em> only for show.</p>\n<p>Not a Witcher with hard-callused hands and scars too numerous to count and a temper like a short-fuse bomb and a vocabulary <em>far</em> more suited to the gutter.</p>\n<p>She’ll figure that out soon enough. Until then, Lambert’s a bad enough person to hoard her smiles and the touch of her delicate hands on his arms, and the way she leans into his touch when they dance, and the soothing rose scent of her perfume.</p>\n<p>“Will you walk me to my rooms?” she asks, and Lambert offers her his arm and scoops up the daggers as they pass the bench, and escorts her up to her new rooms just like a real gentleman, although presumably a real gentleman wouldn’t spend the entire walk thinking about tucking his nose into the crook of her neck and inhaling the smell of roses and salt-sweat, maybe even stealing a tiny lick, just so he’d know what her skin <em>tastes</em> like.</p>\n<p>She opens the door to her rooms and turns back with a tiny frown. “Would you - I know every skill <em>I</em> have probably seems very silly, here in Kaer Morhen,” she says. “But if there <em>was</em> something you’d like to learn, I’d be happy to - to trade lessons, so I don’t feel so much as though I’m imposing on your kindness.”</p>\n<p>“Not an imposition,” Lambert says, and he <em>means</em> to say he doesn’t need any sort of lessons - certainly not <em>embroidery</em>, no matter what the cub thinks - but his gaze snags on her elaborate braids again. “Maybe - this?” he says, and reaches out, and touches her shining hair.</p>\n<p>“This?” Milena says, reaching up to bring her braid around and blinking at it. “Oh! Braiding?”</p>\n<p>Lambert nods. Fuck, it’s a <em>stupid</em> thing to ask, she’s going to be - horrified, or offended, or something -</p>\n<p>“I would be delighted,” Milena says, smiling that broad sweet smile again. “Shall we plan to train again tomorrow? You could - help me put my hair up before we start?”</p>\n<p>“Yes,” Lambert says, too fast, too eager, but she keeps smiling, and she <em>smells</em> happy, bright and joyful like summer flowers.</p>\n<p>“Thank you,” she says, and Lambert nods, and she slips into her rooms and closes the door, and he realizes he’s still holding the daggers.</p>\n<p>Well. Alright. He’ll go and get sheaths made for them, then. And then he can give them to her tomorrow.</p>\n<p>Oh <em>fuck</em>, if she’s teaching him to braid, he’s going to be touching her <em>hair</em>. That. Oh. Oh <em>fuck</em>.</p>\n<p>He’s so very fucked, indeed.</p>\n<p>“So, how was your afternoon?” Triss asks as Milena sits down for supper, and then chuckles when Milena blushes. “That good, eh?”</p>\n<p>“It was delightful,” Milena says, stubbornly ignoring her own flushed cheeks. “Lambert was the very model of a gentleman, and I learned a great deal.”</p>\n<p>“Oh <em>did</em> you,” Triss says, and waggles her eyebrows outrageously. Milena squeaks and covers her face with her hands, ears burning.</p>\n<p>“Not like <em>that</em>!” she says desperately.</p>\n<p>“Oh, lass, you are <em>far</em> too sweet,” Triss says, patting her on the shoulder. “It’s quite adorable, really. And I’ve never seen Lambert so flustered.”</p>\n<p>“Really?” Milena asks. He’s <em>eighty-something</em>, surely he’s had flirtations before. Though admittedly he <em>did</em> seem rather...out of his depth, perhaps. At least until they started training properly; <em>then</em> he relaxed and stopped looking quite so flustered.</p>\n<p><em>Eighty-something</em>. She wouldn’t have guessed he was more than thirty. Which would <em>still</em> be more than a decade her senior, but - <em>eighty-something</em>, really? Which must mean the White Wolf is that old, too, since she thinks she’s heard he’s <em>older</em> than Lambert, and Eskel’s the same age as the White Wolf, and Master Vesemir is <em>three hundred</em> at least…</p>\n<p>She feels very young, and very small, and very alone all of a sudden. She’s older than the <em>princess</em>, but the princess has been in Kaer Morhen all her life, and is perfectly suited to the keep; and Jaskier is only a <em>little</em> older than she is, but he couldn’t be better matched to this place and these people if it had been <em>designed</em> that way. And she is not a bard, not a Witcher-raised princess, not a sorceress, just - just a noblewoman, meant to be decorative and dainty and <em>delicate</em>. What is she doing here? How could she ever have been so arrogant as to think she could fit in, could earn herself a place among these - these <em>demigods</em> and heroes?</p>\n<p>“Here, lass, you’ve gone white as a sheet,” Triss says gently. “Are you well? <em>Did</em> Lambert do something to harm you?”</p>\n<p>“No, no, nothing like that!” Milena says at once. “He really <em>was</em> a perfect gentleman, I swear it. I just. I’m not sure why Eskel let me <em>stay</em>.”</p>\n<p>Triss makes a thoughtful sound and reaches for the basket of bread rolls, taking one and breaking it open and buttering it before she responds. “Well, first off, because Jaskier asked,” she says. “Do him good to have a friend, and both Eskel and Geralt would happily fetch him the stars if he asked for them. And the little menace <em>does</em> need someone around who can help her learn <em>courtly</em> things, because otherwise she’ll grow up as feral as her father, and she has to be able to at least <em>fake</em> courtesy when she’s older. But the meat of it, lass, is you swore to the Wolf and you meant it. Witchers <em>can</em> smell lies. Wolf’s not got so many allies as we can afford to toss one aside, you know.” She gives Milena a long look. “Having second thoughts?”</p>\n<p>“I don’t want to be a burden,” Milena says quietly. “To be - to be <em>useless</em>.”</p>\n<p>“Then don’t be,” Triss says, shrugging. “You’re clever. And a lady-in-waiting’s not useless at all. ‘S just not something we’ve had a lot of <em>call</em> for, up here in the north. Really just as well Jaskier thought of it; Ciri <em>needs</em> someone like you. Even if she’s never a queen, she’ll need to deal with court politics, and fuck knows Geralt can’t teach her how to be <em>courtly</em>. And she won’t be able to just scare people into submission like he does. Well. She <em>might</em>, actually, girl’s going to be a <em>truly</em> powerful mage. But still. She needs the skills <em>you’ve</em> got, if only so she can choose which weapon to use, eh? Like Witchers use silver <em>and</em> steel. She’s already learning swords and magic. You can teach her to use <em>words</em>, you and Jaskier both.”</p>\n<p>That...actually helps a great deal. It <em>is</em> something Milena can do - skills she <em>has</em>, skills that are <em>important</em> - and it has nothing to do with whether or not Lambert happens to <em>really</em> be in love with her, or if their flirtation turns into anything with time. Milena sits up a little straighter. “Thank you,” she says, and Triss grins.</p>\n<p>“You’re quite welcome, lass,” she says, and pats Milena on the shoulder.</p>\n<p>There’s no dancing after supper that night, alas, but Jaskier <em>does</em> sing a number of very nice ballads, so Milena isn’t repining. Much.</p>\n<p>Even if it <em>would</em> have been nice to dance with Lambert again.</p>\n<p>*</p>\n<p>She’s up with the dawn the next day, and meets Jaskier and Lady Yennefer and Triss down at the baths again. It’s earlier than she usually likes to rise, but she’ll get used to it, and it’s <em>definitely</em> worth the early hour to spend time with - well, with friends, or at least people she’d <em>like</em> to be friends with. Lady Yennefer might still be terrifying, but she’s <em>amazing</em>, too, and Triss is very sweet, and Jaskier is - well, Jaskier <em>is</em> a friend, and a good one.</p>\n<p>“Would I be allowed to write to people in Redania?” she asks as they’re all finishing up their ablutions.</p>\n<p>“You’re not a prisoner,” Triss says. “Though I suppose it’d be wise for someone to read through any letters just to make sure you’re not accidentally giving away secrets.”</p>\n<p>“Of course,” Milena agrees at once. “I wouldn’t want to do any harm.”</p>\n<p>“I’d say I’d do it, but that might be a little awkward,” Jaskier says, frowning a little. “Being as we’re both Redanian, and all.”</p>\n<p>“I’ll do it,” Lady Yennefer says. “Nobody will think <em>I’m</em> letting anything through, and I can send the letters by miniature portal instead of them taking months to get across the continent.”</p>\n<p>“That’s very kind of you,” Milena says, quite startled by the offer.</p>\n<p>Lady Yennefer smiles. “I assure you it isn’t,” she says. “I like having people owe me favors.”</p>\n<p>Well, that’s terrifying. Milena swallows apprehension. “There’s...there’s no need to put me in your debt,” she says carefully. “I swore myself to the Wolf, and you are his councilor and chief sorceress. Whatever you require of me, I shall do most happily.” Please let that not be a very stupid promise to make. <em>Please</em>.</p>\n<p>“Huh,” Lady Yennefer says, considering her for a long moment. Her eyes are quite disconcerting; that shade of violet is unusual, and they seem to glow just a little. “I’ll be damned, you mean that. How the <em>fuck</em> did you survive in Redania, girl?”</p>\n<p>“I was only at court for about a year,” Milena says. Lady Yennefer snorts and nods.</p>\n<p>“Well, that’ll do it; not enough time for them to beat the sincerity out of you. Fine. I’ll <em>still</em> be your letter-checker, and send them for you, too, so long as you’re not sending a dozen every day or something excessive like that. You can help me sort the Wolf’s correspondence.”</p>\n<p>“It would be my honor,” Milena says. It <em>would</em>, too: it’s an astonishing mark of trust.</p>\n<p>“Early afternoons, just after dinner,” Lady Yennefer says, and smiles wickedly. “You’ll have to tell Lambert he only gets you when I’m done with you.”</p>\n<p>Milena blushes. She’s going to have to resign herself to just spending most of her time with her cheeks and ears bright red. “I’ll - I’ll tell him,” she squeaks.</p>\n<p>Lady Yennefer chuckles. Triss sighs and shakes her head. Jaskier snorts.</p>\n<p>“Maybe don’t phrase it <em>quite</em> like that,” he says.</p>\n<p>*</p>\n<p>Princess Ciri is charmingly delighted to see Milena again, and greets her in perfect Nilfgaardian. Jaskier pounces on the opening, and they spend the first hour or so discussing - in Nilfgaardian - the geography and a little of the history of the southern half of the continent.</p>\n<p>When it looks like the princess is getting bored with <em>that</em>, Milena says, tentatively, “Would you like to learn to sew? We could combine that with maths.”</p>\n<p>“How?” Princess Ciri asks, and Milena unfolds the length of linen she brought with her, and unrolls her sewing kit.</p>\n<p>“For a lot of noble ladies, sewing a fine seam is a point of pride,” she tells the little princess. “We compete with each other to see who can fit the most stitches to an inch, or make their stitches the most even, or things like that. Of course, no one <em>calls</em> it a competition.”</p>\n<p>“Because court etiquette is about being rude politely,” Princess Ciri says, grinning. Milena can definitely tell why so many people in Kaer Morhen call the child the little menace. But she’s not <em>wrong</em>.</p>\n<p>“Exactly,” Milena says. “So. This is an ell of linen. If I can sew eight stitches to the inch, how many stitches does it take to hem an ell?”</p>\n<p>She hands Princess Ciri a needle and a length of thread, and shows her how to thread the needle while the girl ponders multiplication. They get through threading a needle, tying a knot, and the most basic straight hem-stitch, and Ciri works out thread-length and fabric dimensions and pricks herself four times and uses a couple of words she <em>must</em> have learned from Lambert. It’s adorable.</p>\n<p>*</p>\n<p>At dinner, Milena spends a pleasant half hour chatting with Triss about the various bases which can be used for salves. And then Lambert <em>does</em> come over, and Milena rises to greet him.</p>\n<p>“Training?” he asks, and Milena swallows.</p>\n<p>“Do you mind terribly if we meet at midafternoon instead?” she asks hesitantly. “It’s just that Lady Yennefer has a task for me.”</p>\n<p>Lambert considers her carefully for a moment. “Not just putting me off,” he says finally, and it doesn’t sound like a question, but Milena shakes her head vigorously regardless.</p>\n<p>“No, no, <em>really</em> I’m not,” she says.</p>\n<p>“Really she’s not,” Lady Yennefer drawls from right behind Lambert’s shoulder. They both jump. “Afraid I’m kidnapping your lady for the next few hours. You can come collect her from my workroom at three.”</p>\n<p>Lambert bristles a bit, crossing his arms over his chest and glowering at Lady Yennefer. “You’re alright with this?” he asks Milena. “She didn’t threaten you or anything?”</p>\n<p>“Aw, how sweet,” Lady Yennefer says.</p>\n<p>Milena reaches out, feeling very daring, and pats Lambert’s arm. “Nothing like that,” she assures him. “Really. It’s fine. And I am very much looking forward to our second lesson.”</p>\n<p>“Alright,” Lambert says, a bit reluctantly. He looks down at her hand where it rests on his arm, and then, moving very slowly like he doesn’t want to scare her, takes her hand in his and - hesitantly, like he’s not sure he’s doing it right - raises it to his lips and presses a kiss to her knuckles. “I’ll come find you at three.” He whirls and stalks away, looking rather like a cat that just fell off a windowsill and is now pretending it <em>meant</em> to do that, all stiff dignity.</p>\n<p>“<em>Awww</em>,” Lady Yennefer says, but quietly, not mocking like it was the first time. “Dear girl, you’ve caught yourself a Wolf, you know.”</p>\n<p>Milena blinks down at her hand. Lambert’s lips were very warm, and it feels like they should have left a mark, a sign that that just <em>happened</em>, but her skin is as pale and unmarked as it ever is.</p>\n<p>“Come along,” Lady Yennefer says, not unkindly, and ushers Milena ahead of her out of the hall.</p>\n<p>*</p>\n<p>The White Wolf gets a surprising amount of correspondence, actually. Cities and towns all over his empire send him reports, and pleas for assistance, and questions about points of law.</p>\n<p>“Anything that looks like it needs a Witcher goes in the box for Geralt,” Lady Yennefer says briskly. “Monsters, bandits, that sort of thing. Anything to do with the Wolf’s laws goes to Vesemir. Eskel gets the boring reports, poor man. Political bullshit goes to Jaskier. And I get anything that requires a mage.”</p>\n<p>That’s simple enough, and most of the heap of parchments covering Lady Yennefer’s desk <em>do</em> fit into one of those categories; Milena only has to set a few things aside for Lady Yennefer to look at more closely. They’re done by two, easily, and Lady Yennefer sits back in her chair and gives Milena a thoughtful look.</p>\n<p>“Who do you want to write to?” she asks.</p>\n<p>“My parents,” Milena says. “I would like to let them know <em>why</em> I’ve chosen to stay. Marta won’t...Marta won’t explain it well.” She considers. “And I’d very much like to write to Hanna and Natalia and Piotr and Dawid, my friends at court, because I think they’d - I think it would be useful to the Wolf if they heard why I’m staying in my <em>own</em> words, not whatever nasty rumors get spread around as soon as Marta and Karolina get back to Tretogor.”</p>\n<p>“And what will you tell them?” Lady Yennefer asks. She sounds genuinely curious, not sarcastic or cruel at all.</p>\n<p>Milena chooses her words carefully. “That...that the White Wolf’s court is nothing like Tretogor. Maybe it’s because Witchers can smell lies - is that too secret to include? - but everyone here is so - so straightforward.” She waves a hand, trying to find the right phrases. “I’m sure you’ve been in other courts, Lady Yennefer, and they’re all full of - of lies, and secrets, and <em>nastiness</em>. Nobody really likes each other, and nobody really <em>trusts</em> each other, and everyone is ready to sell their own children or their own <em>selves</em> for a tiny increase in power, and most people would stab their own grandmothers if they think it’ll get them a leg up.”</p>\n<p>Lady Yennefer snorts. “You have summed it up very accurately, yes.”</p>\n<p>“It’s not like that here,” Milena says. “People here <em>like</em> each other. Even - Lambert’s an <em>ass</em>, I know that, I’m besotted not daft -” Lady Yennefer makes a sort of gleeful inelegant noise. Milena blushes but keeps going. “He’s an ass, but he’s got <em>friends</em>, people who tell him he’s being dreadful and who like him <em>anyhow</em>. And - in any other court, you <em>know</em> the king’s right hand would be plotting, but anyone with <em>eyes</em> can see that Eskel’s as loyal as a midsummer day is long; and the Warlord picked a consort he genuinely <em>loves</em> instead of someone who might have been politically advantageous, and - and I want to be part of a court where people genuinely try to do the right thing and not <em>backstab</em> each other all the time!”</p>\n<p>She’s breathing a little hard when she finishes, and Lady Yennefer gives her a surprisingly sweet smile. “Besotted but not daft, indeed,” she says. “Well. Write your letters, dear girl, and I shall see them delivered. Who knows? Maybe the next generation of Redanian nobles will model their court on the <em>Wolf’s</em>. That would be a sight.”</p>\n<p>“Or maybe the ones who really want a court like that will come <em>here</em>,” Milena says, and Lady Yennefer laughs.</p>\n<p>“Oh gods, if this becomes a haven for nobles with morals, we’ll lose Geralt into the mountains for a <em>month</em>,” she says merrily.</p>\n<p>“We’ll what?” Milena says, baffled. Lady Yennefer giggles and settles back in her chair.</p>\n<p>“So,” she says, “Eskel tells me that the very first time anyone sent Geralt tribute…”</p>\n<p>*</p>\n<p>Lambert shows up at the door to Lady Yennefer’s rooms promptly at three, and stands there in the doorway glowering. Lady Yennefer laughs and shoos Milena towards him. “Go on, go on,” she says. “Same time tomorrow.”</p>\n<p>Milena gives her a proper curtsey and a grin. Lady Yennefer is <em>still</em> terrifying, but she’s sort of nice, too, and sorting correspondence <em>is</em> something Milena can help with, so it feels good to be <em>contributing</em> in some small way to the Wolf’s court. And then she offers her hand to Lambert, who gives her his arm and leads her away a little faster than an easy walk.</p>\n<p>“Really,” she says once they’re a few hallways away, “Lady Yennefer has been nothing but kind.”</p>\n<p>“Fucking sorceresses,” Lambert grumbles, but he slows down, too.</p>\n<p>When they get to the training salle - empty again, which Milena is glad of; she doesn’t particularly want to make a fool of herself in front of anyone but Lambert - she sits down on the bench and combs her fingers through her hair, tugging it out of the loose braid she put it in that morning and parting it neatly. “Come and sit,” she says, and Lambert sits beside her, leaving a fair bit of space as though he’s worried she’ll flinch away if he comes too close. “Have you braided anything before?”</p>\n<p>“Hasn’t come up,” Lambert says. “Not like most of us have long hair.”</p>\n<p>“Fair enough,” Milena says, wondering if she should encourage Jaskier to start braiding the <em>Wolf’s</em> hair. It would look very pretty braided. “We’ll start simple, then. Three strands. I’ll do one side, you do the other.”</p>\n<p>“Alright,” Lambert says, and watches her hands like - well, like a wolf watching its prey, as Milena divides one side of her hair into three thick strands and begins to weave them together, going slowly at first so he can see how it works. Lambert leans in a little closer, and Milena is <em>deeply</em> charmed to hear him muttering, very softly, “Over, and over, and over...alright, that’s easy enough.”</p>\n<p>She finishes the braid and smiles at him. “Your turn.”</p>\n<p>Lambert gulps and moves around to sit on her other side, and Milena holds very still as he <em>carefully</em> gathers her loose hair in his hands. “How...hard should I pull?” he asks, sounding like he’s <em>desperately</em> worried about getting it wrong.</p>\n<p>“Not very,” Milena says. “A little more than that...a little more...there, just like that, that’s perfect.”</p>\n<p>“Alright,” Lambert says, and takes a deep breath, and cards his fingers through her hair to separate it out into three sections. “So this bit goes...over that bit...how do you hang on to both bits at once?”</p>\n<p>Milena <em>doesn’t</em> giggle. “First two fingers and your thumb for one bit, second two fingers around the other,” she says, and he fumbles for a moment, lets go of her hair and re-separates the locks, and tries again.</p>\n<p>“<em>Oh</em>,” he says after a moment. “Yeah, alright, I see. This bit over <em>that</em> bit, and then <em>this</em> bit over that bit…”</p>\n<p>Milena sits quietly and carefully doesn’t laugh when Lambert drops a lock of hair and swears under his breath, nor when he manages to pick it up again without dropping the other two and swears <em>triumphantly</em>. At last he says, “I think that’s got it.”</p>\n<p>Milena takes the braid out of his hands and looks it over. “Very good,” she says, and smiles up at him.</p>\n<p>“It’s not as even as yours is,” he says, rubbing a hand over the back of his neck sheepishly.</p>\n<p>“No, but for a first attempt it’s marvelous,” she assures him. “<em>My</em> first try at braiding hair ended up in <em>knots</em>.”</p>\n<p>Lambert preens. “Well then,” he says, “I’ll get it fucking <em>perfect</em> next time.”</p>\n<p>Milena grins. “And then I can teach you a Toussainti braid,” she teases. “That one’s got <em>four</em> strands.”</p>\n<p>Lambert grimaces. “Cruel,” he says mournfully. “Let me have a <em>little</em> triumph?”</p>\n<p>“I will wear any braids you give me proudly,” Milena says, and Lambert’s eyes light up with such eager joy that her breath catches in her throat.</p>\n<p>“I’ll get them fucking <em>perfect</em>,” he promises. “Anything you teach me.”</p>\n<p>“I know,” Milena says, and rises. “Training?”</p>\n<p>“Training,” Lambert says, and blushes, and takes something from his belt. “I. I got sheaths made for your daggers.”</p>\n<p>The sheaths are plain leather, but well-made and with loops to fasten onto her belt. Milena takes the sheathed daggers carefully, turning them over in her hands. “Thank you,” she says, and draws one of them, holding it the way he taught her yesterday.</p>\n<p>Lambert eyes her fingers and nods. “Just like that,” he says, and stands. “Same footwork drill as yesterday, but hold the knife, like so - keep your elbow loose - yes, like that. Alright.”</p>\n<p>It’s harder to keep up with his movements while <em>also</em> holding a very sharp blade in one hand, but not <em>much</em> harder, and it’s still like dancing. Milena finds she’s grinning, cheeks hurting with it, the pleasure of easy movement and Lambert’s company and the tidy braids in her hair all like a warm coal in her chest, an ember warming her from the inside out. Lambert’s grinning, too, broad and pleased and not even a <em>little</em> bit prickly.</p>\n<p>Staying here was <em>definitely</em> the right choice. Often embarrassing, frequently distressing, certainly <em>nothing</em> like the Redanian court or her own father’s household - but the right choice, and maybe she’s not quite accustomed to Kaer Morhen <em>yet</em>, but she <em>will</em> be, and not too far in the future, either. She’ll be <em>home</em>.</p>\n<p>It’s been five days since Lambert started teaching Milena to use a dagger, and she’s still showing up every afternoon and smiling at him and letting him braid her hair and learning - slowly, but <em>learning</em> - how to hold a dagger and move with it. She hasn’t decided he’s too much of an asshole to spend time with. She <em>wears the braids</em> to supper, holding her head proudly even when Lambert can see the work is lopsided or a little messy, and he <em>still</em> hasn’t gotten used to the sensation of her sleek, soft hair against his own callused hands. She’s danced with him twice more, both of the nights Buttercup has chosen to play dancing music - with him and with no one else but the <em>cub</em>.</p>\n<p>He’s not quite sure what he did to deserve this. He’s pretty sure he’s <em>still</em> a prickly asshole, and he <em>certainly</em> has far too foul a mouth, and Milena just -</p>\n<p>Doesn’t seem to mind?</p>\n<p>It’s baffling, but Lambert isn’t stupid enough to ruin it on <em>purpose</em>.</p>\n<p>So he’s really quite pissed when fucking Clovis accidentally breaks his fucking <em>arm</em>. It’ll heal in two or three days - Witcher healing, it’s a hell of a thing - but he won’t be holding a dagger until then.</p>\n<p>He shows up at the training salle with his arm in a sling - Triss is picky about that sort of thing, and yells at anyone who doesn’t let her patch them up after any injury that won’t have healed by supper - and Milena’s eyes go <em>huge</em>.</p>\n<p>“What <em>happened</em>?” she gasps, and moves towards him with her hands fluttering like she wants to touch him but doesn’t want to make it worse.</p>\n<p>“Fucking Clovis,” Lambert says grumpily. “Tossed me through a fucking wall. <em>Again</em>.”</p>\n<p>“...Again?” Milena asks.</p>\n<p>“I mean, the last time was a decade ago,” Lambert says, because to be perfectly fair it <em>was</em>, but it’s not the sort of thing someone <em>forgets</em>. “I’ll be fine in a couple of days. It’s just fucking <em>annoying</em>.”</p>\n<p>“...Right, Witcher healing,” Milena says slowly. “A broken arm isn’t much more than a hassle to you, is it?”</p>\n<p>“No,” Lambert says. “Not a clean break like this, anyhow.” He shrugs with his good shoulder. “Do you want to do footwork?”</p>\n<p>“It won’t...jar your arm?” Milena asks. “We could just sit and talk, you know. Or walk, or -” She trails off, looking rather lost.</p>\n<p>Honestly, sitting and talking sounds kind of nice. Lambert <em>could</em> do an afternoon of footwork drills, but one of the unfortunate things about Witcher metabolisms is that painkillers just plain don’t work as well, so his arm <em>does</em> ache. “I. We could sit,” he says hesitantly, unsure that Milena will really <em>want</em> to spend a couple of hours talking to a grumpy asshole like him.</p>\n<p>“I’d like that,” Milena says, and then hesitates. “...You can tell me this is foolish,” she says, “but in Redania, sometimes, if two people are...are courting, and they’re spending time just <em>talking</em>, sometimes one will - will sit at the other’s feet with their head in the other’s lap. Would you. Like that?”</p>\n<p>Sit at her feet with his head in her lap.</p>\n<p>Would he <em>like</em> that?</p>\n<p>“Yes,” he says, wondering if this is a trick question, and flops down in front of the nearest bench. Milena sits down behind him and smooths her skirts out, and Lambert leans back, and Milena - oh fucking hell - starts to run her fingers very gently through his short-cropped hair.</p>\n<p>It feels <em>really fucking good</em>.</p>\n<p>Lambert closes his eyes and just fucking <em>basks</em>. No wonder Geralt always looks so damn stupid when Buttercup plays with his hair. This is fucking <em>nice</em>. Milena has beautifully-tended fingernails and they scratch against his scalp just so, and Lambert feels like a fucking cat being scratched behind the ears. He’s not sure if he <em>can</em> purr, but he sort of wants to.</p>\n<p>And Milena smells <em>happy</em>. Like this is making her just as contented as it is Lambert, just sitting here and petting his hair and being quiet together.</p>\n<p>She did say talking, though. And - the other night, she said something about poetry. <em>Lambert</em> doesn’t know any poems, unless he counts the really filthy songs he’s got memorized, which he is <em>not</em> going to quote to Milena; he’s fairly sure there aren’t any books of poetry in Kaer Morhen’s library, either. But.</p>\n<p>“Poetry,” he says, and Milena hums. “I don’t know any.”</p>\n<p>“I know a little,” Milena says. “I’m not like Jaskier, I don’t <em>think</em> in poems, but every noblewoman in Redania is expected to at least have an opinion about poetry. It’s one of the noble arts.” There’s humor in her voice. “Among all the other very useful things we’re taught.” She pauses, fingers still scritching gently through his hair, and then says, “There’s one I read a while back, and thought it was funny. And then I met you, and now it isn’t funny anymore, it’s...sweet.”</p>\n<p><em>That’s</em> frankly worrying. “Go on,” Lambert says warily.</p>\n<p>“Let me see, how did it go,” Milena says, and hums a little. “Right. <em>They came to tell your faults to me / They named them over, one by one / I laughed aloud when they were done / I knew them all so well before - / Oh, they were blind, too blind to see / Your faults had made me love you more.</em>”*</p>\n<p>Lambert blinks up at her, too astonished to say anything at all. She’s smiling down at him, sweet and soft, and her hands are so gentle, and her legs are warm against his back even through her skirts and his shirt, and she smells so <em>good</em>, roses and happiness together. “Fuck,” he says after a long moment. Milena giggles.</p>\n<p><em>Your faults had made me love you more</em>. That’s not ‘you’re an asshole but I guess I like you anyhow.’ That - somehow, incomprehensibly, <em>impossibly</em> - is ‘you’re an asshole and <em>I like it</em>.’</p>\n<p>“I...really like that poem,” he says at last. <em>Really like</em> isn’t quite accurate - it hurts, somehow, but it hurts <em>good</em>, not like a broken arm at all - but it’s the most accurate phrase he’s <em>got</em>, so it’ll have to do.</p>\n<p>“Oh good,” Milena says. “What <em>do</em> Witchers learn, if you don’t have to memorize poetry?”</p>\n<p>Lambert closes his eyes again. It would be harder to talk about this, but her hands are <em>so</em> nice, and he’s remarkably comfortable, and even his arm is hurting less. “We memorize a lot of potions recipes,” he says. “And monsters. What they look like, how they fight, how to kill them.” He pauses, trying to find something in Witcher training that <em>wouldn’t</em> horrify a gently-bred woman. “Languages.”</p>\n<p>“How many do you speak?” Milena asks.</p>\n<p>“Common Nordling, Nilfgaardian, Skelliger dialect, Elder,” Lambert says. “And I can swear in Dwarvish and Gnomish.”</p>\n<p>Milena giggles. “Of course you can.” She sounds <em>fond</em>, like she is amused and delighted by his penchant for learning as many curse words as he can.</p>\n<p>“What else do noble ladies learn?” Lambert asks.</p>\n<p>“Embroidery,” Milena says. “Household management. Basic stillroom skills. Courtesy. I can play a lap harp, but not very well, and paint a little, and judge the price and workmanship of a piece of cloth or jewelry pretty accurately. Dancing, obviously. Formal correspondence - there are books with explanatory tables, you know, telling you exactly how to write a letter for almost any occasion.”</p>\n<p>“That sounds <em>really fucking boring</em>,” Lambert admits. “The letters, I mean.”</p>\n<p>“Oh, it is,” Milena assures him. “But once you get used to the formulae, it’s easier to see what people are <em>really</em> saying, sort of between all the courtesy. There’s a whole second language, almost - everything’s got connotations and hidden meanings, and then there’s <em>flower</em> language, too, so if someone sends a letter with a <em>bouquet</em> it takes half an hour to figure out what they actually meant rather than what they <em>said</em>.”</p>\n<p>“What the <em>fuck</em>,” Lambert says.</p>\n<p>Milena laughs. “To be perfectly honest, that’s part of why I like it here so much,” she says, in the tone of one confiding a secret. “Nobody here hides their lies behind pretty words and flowers. Everybody says exactly what they <em>mean</em>, or near enough. It’s very refreshing.” One of her fingers traces the curve of his ear, and Lambert shivers in astonished pleasure. “<em>You</em> don’t hide anything,” she says, even more softly. “It’s so <em>nice</em>, not having to wonder if you’re spending time with me for some secret reason or other - politics, or wealth, or wanting a titled wife, or what have you. You just - want to spend time with me.”</p>\n<p>Lambert opens his eyes, and the smile on her face, even upside-down, is so utterly <em>besotted</em> that he has to wonder if this whole afternoon is some sort of dream - if Triss dosed him with something that makes Witchers hallucinate. Nobody <em>actually</em> looks at him like that. It can’t possibly be real. But she <em>smells</em> real, and her hands <em>feel</em> real, and even in a hallucination he’s pretty sure he couldn’t conjure up the sweet happiness in those dark eyes. “I. I like spending time with you,” he says, silently cursing his own awkwardness.</p>\n<p>“And I with you,” Milena says, nothing but truth in her scent and her heartbeat.</p>\n<p>Lambert is genuinely not sure what he did right to end up here, but whatever it was, he <em>desperately</em> wants to do it again.</p>\n<p>*</p>\n<p>“Buttercup,” Lambert says, later that same afternoon, and Buttercup makes an agreeable sort of noise from where he’s sprawled on Geralt’s lap across the hot spring from Lambert. “Do you have - do you have books of poetry?”</p>\n<p><em>That</em> gets Buttercup to open his eyes and give Lambert a thoughtful look. “I have a few,” he says. “I could probably get more, if I asked Yen nicely. Why do you ask?”</p>\n<p>Geralt is watching the whole exchange with a tiny, smug smile. Bastard. At least Eskel’s <em>pretending</em> not to listen.</p>\n<p>“Never mind,” Lambert grumbles. He can’t quite figure out how to say <em>out loud</em> that he wants to find a poem that makes <em>Milena</em> feel as - as warm and happy as the one she recited did for <em>him</em>.</p>\n<p>“Nope nope nope, no ‘never mind’ing,” Buttercup says. “You want poetry, I will <em>get</em> you poetry. Epics? Limericks? Love poems? You name it, I will find it for you.”</p>\n<p>It’s really fucking annoying how Lambert can’t actually get <em>mad</em> at Buttercup for the teasing, because then he turns around and says something like <em>that</em>. “Love poems,” Lambert mutters, and Buttercup gives Eskel a <em>look</em> that keeps the other Witcher from saying anything at all.</p>\n<p>“Done,” Buttercup says. “Give me three days, and I’ll have you a selection.” And then, thank the fucking <em>gods</em>, he starts rambling about something else - some lady he knew in Oxenfurt, who had a bookshop with a hidden door that led to an entire room full of bawdy novels. “You should’ve <em>seen</em> it,” he says cheerfully, lounging back against Geralt and gesturing with both hands. Geralt’s got his arms around Buttercup’s waist so the bard doesn’t tip over and slide underwater, and is giving his consort a very silly little smile. “Just - wall to wall <em>smut</em>, it was amazing. Of course she charged through the <em>nose</em>, but!” Buttercup taps his own nose, looking as sly as he can, which isn’t very. Eskel is already snickering. “You can’t get those <em>printed</em>, they’ve got to be hand-copied, because no printer in Redania would risk their machines being confiscated for aiding and abetting such debauchery. So if you were a <em>clever</em> fellow, and had truly elegant handwriting - <em>which</em> I do, of course - you could make a deal with the proprietress!”</p>\n<p>“You copied them for her,” Eskel says, grinning.</p>\n<p>“Oh yes, made half my pocket money every year I was at university by doing so!” Buttercup says proudly. “<em>And</em> I learned a lot. None of it suitable to be <em>graded</em> on, of course, but learning is never wasted.”</p>\n<p>“Hm,” says Geralt, very amused.</p>\n<p>“Hm, yourself,” Buttercup retorts, grinning. “I don’t see <em>you</em> complaining about my vast and varied knowledge.” He turns his head to look at Geralt and wiggles his eyebrows outrageously. Eskel falls over onto Lambert’s shoulder - the good one, thank fuck - and shakes with laughter.</p>\n<p>“Not complaining,” Geralt says, very complacently. “Might take notes.”</p>\n<p>Buttercup goes off into peals of laughter. “You,” he gasps, “you are as much of a menace as Ciri is! <em>That’s</em> where she gets it, isn’t it?”</p>\n<p>“Hm,” says Geralt, smugly.</p>\n<p>Lambert...wants Milena here, actually. She’s much, much too uncomfortable with the communal baths to <em>actually</em> join them in their usual pre-supper ritual, but he wants her here next to him, laughing at Buttercup and snuggling up to Lambert’s shoulder and maybe running her fingers through his hair again.</p>\n<p>Or sitting on his lap, like Buttercup sits on Geralt’s, held close and safe, happy and protected.</p>\n<p>On second thought, he should <em>not</em> be thinking about Milena sitting on his lap. The water muffles smells, but he does not want Eskel to start asking questions about why he’s started smelling <em>horny</em> in the middle of bathing.</p>\n<p>Maybe he <em>won’t</em> ask Milena if she thinks she’ll ever be used to Kaer Morhen’s communal bathing and would like to join him. That...that might not end well.</p>\n<p>How the fuck <em>Geralt</em> manages to not smell like lust all the time, Lambert hasn’t the faintest idea. <em>Buttercup</em> certainly does. But then, Buttercup smells like lust pretty much every moment he’s within sight of Geralt, so every Witcher in the keep has pretty much gotten used to it. Geralt, the romantic fucker, smells like <em>love</em> instead, every time he so much as <em>thinks</em> about the bard. It’s really sweet, which Lambert will <em>never</em> admit aloud.</p>\n<p>Back when Geralt was first pulling all the Witchers together into the unstoppable army that they’ve become, a fair number of Witchers from other Schools thought he was weak because he <em>didn’t </em>constantly smell like anger. Geralt disabused them of that pretty fast - Lambert still cherishes the memories of watching the White Wolf beat the fucking crap out of half a dozen other Witchers, two and three at a time, because it was fucking <em>beautiful</em> to watch - but it’s still fairly unusual, the way Geralt smells like love whenever he thinks of Buttercup or the cub, of happiness around Eskel or Yen or even Lambert himself, of general calm contentment instead of barely-leashed anger. Witchers are <em>less</em> hated, now, than they ever have been before, but it hasn’t even been two decades yet. It’s taking most of them a while to really adjust to being -</p>\n<p>Well, to being the White Wolf’s army, acclaimed as protectors, instead of being derided as only barely more tolerable than the monsters they slay.</p>\n<p>Fuck, if Lambert spends much more time around Milena, <em>he</em> might start being one of the Witchers who mostly smells like happiness instead of rage.</p>\n<p>That...that’ll be a change.</p>\n<p>He’s maybe looking forward to that.</p>\n<p>Milena has been part of the White Wolf’s court for about a week, and is starting to think she’s maybe starting to figure out how everything works, the day she’s following Lady Yennefer and Triss out of the baths and one of the few female warriors in the keep calls, “Girl. New girl. C’mere a moment.”</p>\n<p>Milena goes over to her warily. The woman - Zofia, Milena thinks her name is; she wears a Viper medallion and wields a wickedly curved blade on the practice grounds - beckons her to follow, and walks around a sort of outcropping in the rock, which leads to a little alcove entirely hidden from the main cavern’s view, with a single deep hot spring in it, and a number of ledges on the walls heaped with linen strips and little jars.</p>\n<p>“Not too many women in the keep as get our monthlies, but this is where we come when we <em>do</em>,” Zofia says bluntly. “All the springs are spelled to stay clean, but <em>I’d</em> rather not be bleeding in the water around a bunch of Witchers, y’know?”</p>\n<p>Last month, when she was her sister’s escort, Milena made do with sponge baths in their rooms, which was rather miserable. This looks <em>much</em> more pleasant. “<em>Thank</em> you,” she says, and then grins as the thought hits her. “Nobody showed this to Princess Agata.”</p>\n<p>Zofia snorts. “That prissy bitch? Fuck her. ‘Sides, I dunno that the sorceresses know about it, nor the songbird either.”</p>\n<p>“They don’t?” Milena asks, startled.</p>\n<p>“Sorceresses don’t bleed,” Zofia says. “I think the magic burns out their wombs, or something like that. I’ve never <em>asked</em>, mind you.”</p>\n<p>Milena contemplates asking Lady Yennefer - or even Triss - such a thing, and decides she likes her head <em>attached</em>, thank you very much. “Quite,” she says. “Well, thank you <em>so</em> much for letting me know; I really cannot tell you how much I appreciate it.” She slants a look at the older woman - broad-shouldered, scarred, handsome rather than beautiful and <em>so</em> confident in her stance - and adds tentatively, “Would you - would you mind terribly if I asked you for advice, sometime?”</p>\n<p>“On Witchers?” Zofia asks. Milena nods. Zofia grins. “Yeah, sure. Hells, I’ll give it to you right now.” She leans back against the wall and raises a hand, ticking the points off on her fingers as Milena feels her cheeks grow hotter and hotter.</p>\n<p>“First thing, a Witcher’s the safest fuck you’re going to ever have, girl. Can’t give you a pox <em>or</em> get you with child. Bitey, though, all of ‘em.” Milena <em>has</em> noticed the many lovebites which decorate Jaskier’s throat and shoulders, and which he shows off proudly. “And they’re <em>always</em> fucking up for it, so you gotta be able to tell ‘em to fuck off when you’re tired.” Milena nods.</p>\n<p>“Second thing - you a virgin, girl?” Milena nods again, cheeks flaming. “Huh. Well, gotta start sometime,” Zofia says, shrugging, which is <em>not</em> how anyone at court would <em>ever</em> think of it. “But wait till <em>you’re</em> ready. That asshole’s got two good hands; he can get his own damn self off. Don’t you let him make you feel <em>obliged</em>, girl.”</p>\n<p>“He wouldn’t - he <em>hasn’t</em>,” Milena says, feeling rather as though she ought to defend Lambert’s honor, which is a very strange sensation. “He’s been a perfect gentleman.”</p>\n<p>“That prickly asshole, a gentleman?” Zofia says, eyebrows going up. “Huh. Must be love. Be damned. Well then. My point stands. He can wait till <em>you’re</em> good and ready. Got it?”</p>\n<p>Milena nods. This is - this is not like the talk she <em>thought</em> she would get someday, perhaps the day before her wedding, probably from her mother or an aunt. It’s a lot blunter, and - she is utterly certain - a <em>lot</em> more useful.</p>\n<p>“Third thing. When you <em>do</em> let him under your skirts, girl, you tell him to put that filthy mouth of his to use before he ever gets his prick in you. You <em>do</em> know how fucking works, right? I don’t have to draw a diagram?”</p>\n<p>Milena swallows embarrassment and nods. “The...man’s prick goes in the...the woman’s cunny,” she says faintly. <em>Mouth</em>, though - Lambert’s mouth? If she’s understanding Zofia correctly, Lambert’s mouth <em>there</em>?</p>\n<p>Oh <em>gods</em>, she can’t think about that, she’ll die of sheer embarrassment right here.</p>\n<p>“Oh good,” Zofia says. “I’m shit at drawing diagrams. Anyhow. Make sure <em>you</em> get your pleasure, too. Witchers are mostly pretty good about that, but I know nobles are fucking stupid about - how’s it go - ‘lie back and think of heirs’? And he won’t be getting heirs on you, girl, so you might as well get something <em>else</em> out of it, hey?”</p>\n<p>“I understand,” Milena says. She may actually spontaneously combust from blushing, but she understands.</p>\n<p>“Last thing,” Zofia says, and frowns. “I dunno if the songbird knows about this, actually. How old do you think I am, girl?”</p>\n<p>Milena looks at her carefully. “...Thirty?” she ventures at last. She can’t be <em>much</em> older than that; her skin is still smooth between the scars, her face mostly unwrinkled, her breasts still firm.</p>\n<p>“Forty-six last month,” Zofia says. “I’ve been fucking my Auckes for over a decade now, and I feel younger than when I <em>met</em> him.” She shrugs. “Best we can tell - there’s not a <em>lot</em> of us who’ve taken Witcher lovers, you know - best we can tell, the <em>Witchers</em> get their lifespans from those mutagen things, yeah?”</p>\n<p>Milena nods.</p>\n<p>“Right, well, we figure there’s mutagens in their seed. One or two fucks won’t have any effect, but <em>regular</em> fucking, for <em>years</em>, and it starts to build up. We’ve pretty much stopped aging, those of us who’ve been with our Witchers for a while, even gotten a little <em>younger</em> maybe, and we heal faster, too. Not <em>Witcher</em>-fast, but faster than we ought. And we stay healthy. I haven’t gotten a sniffle in three years. So you start fucking your Witcher, girl, and you’ll stay young and pretty a <em>really</em> damned long time.” She snorts. “Songbird’s fucking the <em>White Wolf</em>, he might actually end up immortal.”</p>\n<p>“Oh,” Milena says, knowing her eyes are wide with astonishment. “Do the <em>Witchers</em> know that?”</p>\n<p>“We’re not sure,” Zofia says, and snorts again. “Truth of the matter is, we’re waiting to see if they <em>notice</em>. Idiots can spot a nekker half a mile away and don’t see what’s under their noses sometimes. And they’re really fucking bad at <em>time</em>. Comes of being halfway to immortal, I guess.”</p>\n<p>Milena grins. “Well then, I won’t tell - except maybe Jaskier,” she says. “Is there a betting pool on when they’ll figure it out?”</p>\n<p>Zofia guffaws. “<em>There</em> we go, girl, there’s your bite,” she says approvingly. “Yeah, there’s a pool; you want in?”</p>\n<p>Milena considers what she knows of Witchers, and says, “Two crowns on another decade at least.”</p>\n<p>“Done,” Zofia says, and holds out a hand. Milena shakes it. Zofia claps her cheerfully on the shoulder and leads her out towards the dressing room, looking very pleased with herself.</p>\n<p>“Thank you,” Milena says, once they’re both clothed and ready to head up for breakfast. “Thank you <em>very</em> much.”</p>\n<p>“You’re welcome,” Zofia says, grinning at her. “Anyone who can turn that asshole into a gentleman is fine in <em>my</em> books. And hey - come find me sometime, and I’ll teach you a couple dirty tricks Lambert won’t. Never know when that sort’ve thing will come in handy.”</p>\n<p>“I will,” Milena says. “And - if you want anything embroidered, or anything like that, I’d be very happy to help.”</p>\n<p>“Huh,” Zofia says. “Wouldn’t mind having a nice bit of embroidery here and there, couple pretty things for feasts and such. I’ll bring a few things by.”</p>\n<p>“I shall look forward to it,” Milena says, quite honestly. She <em>likes</em> embroidery, and if it will help repay the almost certainly <em>priceless</em> advice she’s gotten today, she’s even happier to do it.</p>\n<p>*</p>\n<p>It’s a few days later, and Milena is <em>very</em> grateful to have learned of the private hot spring, if rather sad to miss out on her usual morning gossip sessions with Jaskier and Triss and Lady Yennefer, when she gets to the training salle for her lesson and Lambert shoots to his feet, staring at her in horror, and says, “Are you <em>hurt</em>?”</p>\n<p>“What?” Milena says, rather startled.</p>\n<p>“You smell like blood,” Lambert says, hurrying over to her and holding out his hands like he wants to pat her down and find the injury, palms hovering just above her shoulders. “Where - who hurt you - I’ll fucking <em>kill</em> them -”</p>\n<p>“Lambert!” Milena says sharply, and he stops, blinking at her. “I’m not <em>hurt</em>, I’m - I’m fertile.”</p>\n<p>“What?” Lambert says, blankly.</p>\n<p>“I’ve got my monthlies,” Milena says, blushing hotly. Gods, she’s never had to <em>tell a man</em> this before, but - well, if he can smell the blood, then keeping it private isn’t going to work.</p>\n<p>“Your what now?” Lambert says.</p>\n<p>Milena blinks at him. “You’re eighty-something years old,” she says slowly, “and you don’t know what a woman’s monthlies are.”</p>\n<p>“There’s not a lot of women in Kaer Morhen,” Lambert says, scowling. “What are you <em>talking</em> about, and why are you fucking <em>bleeding</em>?”</p>\n<p>Milena rubs her forehead. This was not how she planned to spend her afternoon, but - well - Witchers. Living in Kaer Morhen <em>definitely</em> teaches one to roll with the punches. “Come and sit down,” she says, and takes his hand and pulls him over to the bench. He follows, looking baffled and unhappy. “Alright. So. Women who can...who can have children, once they’re old enough, every month or so they bleed for a few days. From.” She gestures vaguely at her lap. “Well.”</p>\n<p>Lambert stares at her in something like horror. “Every <em>month</em>? A few <em>days</em>? How do you not bleed <em>out</em>?”</p>\n<p>“It’s not <em>that</em> much blood, really,” Milena says. “And we’re...built for it, I guess.”</p>\n<p>“Built for -” Lambert says, and sort of chokes on the words, staring off into space like he’s been whacked upside the head with a club. “Oh fucking <em>gods</em>,” he says after a moment. “<em>Ciri</em>.”</p>\n<p>“Too young yet,” Milena says promptly. “But I suspect it’s part of why Jaskier wanted me to be her lady-in-waiting, yes; she should have <em>someone</em> around who knows about this sort of thing.”</p>\n<p>“<em>Fuck</em>,” says Lambert, quite fervently, and looks at her with wild eyes. “But you’re - you’re <em>not</em> hurt?”</p>\n<p>“I mean, it aches a bit,” Milena says, putting a hand to her stomach. “But I don’t get cramps as bad as some women do. I <em>can</em> still train today. I’d like to.”</p>\n<p>“Alright,” Lambert says, and rubs the back of his head. “I. Um. I gotta tell Eskel and Geralt, at least. If they smell blood on you, they’ll be worried too.”</p>\n<p>“Why don’t they worry whenever any of the - oh,” Milena says, answering her own question before she finishes asking it. “Because they’re warriors, so getting hurt is fairly normal. And the servants stay out of your way, mostly. But I’m <em>not</em> a warrior.”</p>\n<p>Lambert nods. “You’re not a warrior,” he agrees. “And I’m known to be a fucking asshole, so. Most obvious conclusion is <em>I</em> hurt you.”</p>\n<p>“Oh <em>no</em>,” Milena says, horrified. “You <em>wouldn’t</em>.”</p>\n<p>Lambert blinks at her. “You mean that,” he says at last, and breathes in, slow and thoughtful. “Huh. Yeah. You mean that.”</p>\n<p>“I might still be wary of the <em>White Wolf</em>,” Milena says, a little tartly, “but I stopped being scared of <em>you</em> sometime around the day you carried me down a mountainside so gently I barely even noticed we were moving.” That’s a <em>good</em> memory, in point of fact: his arms were warm and strong and gentle, and the rumble of his voice was oddly comforting, and by the time they got back to the keep, she’d gone from being disturbed by his slitted eyes to thinking the amber shade really quite lovely.</p>\n<p>“Oh,” says Lambert, looking like he’s been whacked upside the head with a club again. “That’s. Good?” He swallows hard and looks down and only then seems to notice that she’s still holding his hand. “You really want to train today?”</p>\n<p>“Moving helps,” Milena says. “And distraction helps, too. And I <em>definitely</em> want to spend time with you.”</p>\n<p>Lambert <em>blushes</em>. “Alright,” he says. “Then - um - footwork? I don’t think I can hold a fucking knife on you when you already smell like blood.”</p>\n<p>“Alright,” Milena says, and rises.</p>\n<p>Lambert leads her back and forth across the salle for a while, and the exertion <em>does</em> help; she feels much better by the time they finally stop, but also very much like she wants a bath. Lambert gives her a <em>very</em> odd look when she falls into step beside him as he heads down to the hot springs.</p>\n<p>“Not that you’re <em>not</em> welcome,” he says slowly, “but I didn’t think you <em>liked</em> the…” he trails off and waves a hand mutely.</p>\n<p>“There’s a side chamber one of the other women showed me,” Milena says. “And I want a bath too much to be scared off by a bunch of naked Witchers.” Big words - with a little luck, she can actually back them up. But she <em>does</em> want a bath quite desperately, and hopefully all the Witchers will be <em>in</em> the water, so she won’t see more than shoulders and heads. She’s gotten quite good at keeping her gaze above the collarbones, these last couple of weeks of bathing with Jaskier and Triss and Lady Yennefer.</p>\n<p>“Mmph,” Lambert says. “Anybody bothers you, let me know, and I’ll deal with them.”</p>\n<p>Milena smiles. “Thank you. Really, nobody’s given me any trouble at all.”</p>\n<p>“Yeah, well, you’re not an idiot out to trap the White Wolf,” Lambert grumbles. “Or. Um. Any sort of idiot. <em>Fuck</em>.”</p>\n<p>Milena chuckles and pats his shoulder gently. “I knew what you meant.” She hesitates, sighs, and says, “You could tell Eskel and the White Wolf while you’re bathing. About. Um.”</p>\n<p>“Why you smell like blood,” Lambert says, grimacing a little. “I <em>really</em> don’t like smelling blood on you. It’s just - I keep thinking you’re fucking <em>hurt</em>.”</p>\n<p>“Unfortunately, it’s going to happen every month,” Milena says. “Is that - can you -” Somehow, nothing in any courtship manual ever covered what to do if your prospective suitor can <em>smell your monthlies</em> and hates the smell of blood on you.</p>\n<p>“I’ll deal,” Lambert says. “I don’t. I just don’t want you hurt.”</p>\n<p>Which is sort of sweet, really. Milena thinks for a moment.</p>\n<p>“How about,” she says slowly, “I promise to tell you at once if I ever <em>am</em> truly hurt. Would that help?”</p>\n<p>“That - that would help a lot, actually,” Lambert says. “Thanks.”</p>\n<p>Milena nods, and Lambert pushes the door to the hot springs open for her. Milena skirts along the side of the room until she reaches the little alcove, and slips into it -</p>\n<p>And turns back, feeling a little wicked, to peer around the outcropping at Lambert as he strips down.</p>\n<p>She’s seen him <em>shirtless</em> before, because Witchers do tend to wander around shirtless even in the cold halls of Kaer Morhen. She’s never really looked her fill, though, because it’s always been in the main hall and she’s felt <em>far</em> too self-conscious to stare. Now, though. Now he’s facing away from her, and no one else is around to see her being so utterly unmannerly as to look.</p>\n<p>Lambert’s back is broad and scarred, tanned from the summer’s training. A man’s bare back is only a <em>little</em> scandalous to look at so hungrily - men might go shirtless for hard labor, or hot weather, or to swim. Wanting to <em>touch</em> is a lot more scandalous, but there’s no one here to know, and Milena - Milena really <em>does</em> want to touch. She knows he’s absurdly strong - all Witchers are - but she wants to know if his skin is soft, if the scars would be rough against her fingers, if he would be furnace-warm beneath her hands.</p>\n<p>And then he kicks off his breeches, and Milena bites her lower lip <em>hard</em>. She’s...well, she’s <em>seen</em> a naked Witcher before, that time the White Wolf walked right past all of them without a stitch of fabric on, but she didn’t <em>look</em>; and she’s bathed with a naked man every morning for a week and more, but she’s never looked at <em>Jaskier</em>, either. Now, looking at Lambert…</p>\n<p>The first thing her eyes light on is, in fact, another scar, one that suggests something with large claws dragged one right down Lambert’s back and over his ass. But apart from that, it’s - well, Milena doesn’t exactly have a lot of other examples to compare it to, but it’s quite a nice ass. Nice legs, too, strong and scarred and well-formed. She really shouldn’t be staring like this.</p>\n<p>She likes looking at him, though.</p>\n<p>She’d kind of like to see his <em>other</em> side.</p>\n<p>Lambert steps into the water, splashing the other Witchers around him and eliciting squawks and a half-hearted punch, and Milena shakes herself and retreats into the little alcove, to the quiet solitary pool and a soothingly hot bath.</p>\n<p>Buttercup comes through with surprising tact: he gives Lambert a little stack of books after dinner several days after their conversation, without saying anything to draw attention to it. Lambert squirrels them away in his rooms and reads through them in spare hours here and there, without much enjoyment. Poetry is <em>not</em> something he understands. Most of it is all impenetrable metaphors and stupid flowery language and idiots swearing dumb oaths that don’t even make sense.</p>\n<p>But there’s one he kind of likes, from a slim book that <em>also</em> has the poem Milena quoted, the one that hurt and felt good at the same time. He memorizes it carefully, tucking it away like it’s an incantation or a list of potions ingredients. There doesn’t seem to be a good time to recite it, really; while they’re training they talk about <em>training</em>, or about Kaer Morhen and the Witchers and the cub, and in the evenings they dance or end up talking with Triss or Buttercup or the cub, and Lambert’s sure as hell not going to recite poetry in front of anyone <em>else</em>.</p>\n<p>Milena stops smelling like blood after four days, which is such a relief Lambert can’t even express it. Blood is just - blood is just a bad smell on Milena. She should <em>never</em> smell hurt.</p>\n<p>(Also that may have been the least comfortable conversation he has <em>ever</em> had with Eskel and Geralt, and there is some <em>serious competition</em> for that spot. But ‘Milena smells like blood because <em>apparently this is a thing human women do</em> and also, just so’s you know, at some point <em>Ciri will too</em>,’ was just...really, really unpleasant. The fact that Geralt and Eskel both reacted with about as much dismay and horror as Lambert had was only a very <em>small</em> counterweight to the general fucking disaster of the whole mess.)</p>\n<p>Milena doesn’t learn as fast as a Witcher trainee, but then, she’s a grown woman and doesn’t have any prior weapons training. She <em>definitely</em> keeps at it with a commendable amount of enthusiasm...at least up until the point that she has to try to stab him.</p>\n<p>The first day Lambert says, “Alright, good - now hit me,” Milena raises the knife, flinches hard, and drops it. Lambert blinks at her in surprise. He can’t smell blood - she didn’t <em>cut</em> herself.</p>\n<p>“I really don’t want to hurt you,” Milena says.</p>\n<p>“You won’t,” Lambert says. “You - there’s really no way you can hit me.”</p>\n<p>Milena swallows. “How can you be sure?”</p>\n<p>Lambert considers that. “Alright,” he says at last, picking up the dropped dagger. “Put the sheath on it, and hit me with the <em>covered</em> blade. And I’ll stop you. Go as hard and fast as you can.”</p>\n<p>Milena takes the sheath off her belt and slides it onto the blade, and gives him a long thoughtful look, and then moves rather faster than he’d expected. He’s genuinely impressed.</p>\n<p>He still catches her wrist, as gently as he can - gently enough not to bruise even very delicate skin - and slides his other arm around her waist, pinning her to his chest so she can’t easily pull away.</p>\n<p>“Gotcha,” he murmurs in her ear. Milena’s heart kicks up, suddenly almost twice as fast, and her scent spikes with surprise but not <em>fear</em>, no fear at all.</p>\n<p>“Oh,” she says faintly. “You’re so <em>fast</em>.”</p>\n<p>She smells so <em>good</em>.</p>\n<p>“Always faster than you,” he says. “Otherwise what’s the point in being a fucking Witcher? You <em>can’t</em> stab me.”</p>\n<p>“I’ve watched you training,” Milena says thoughtfully, “but somehow it’s not quite as obvious how fast you are when I’m up on the walltop.” She staring up at him with enormous dark eyes, and she’s a lithe warm armful tucked against him, and she isn’t struggling - doesn’t seem to want to escape his grasp at all, in fact.</p>\n<p>The temptation to kiss her is very, very strong.</p>\n<p>Milena licks her lips, a tiny little flick of her tongue, which does not help at <em>all</em>.</p>\n<p>But.</p>\n<p>Lambert wants to do this <em>right</em>. He isn’t quite sure what that <em>means</em>, yet, but it almost certainly doesn’t mean kissing her while he’s got her pinned and helpless in his arms. Even if she doesn’t mind being there. Very carefully, he lets go, making sure she doesn’t trip as she steps back out of his embrace.</p>\n<p>“Alright,” Milena says, and takes the sheath off the dagger. “I <em>can’t</em> stab you. Shall I try anyway?”</p>\n<p>Lambert’s pretty sure his grin is somewhere on the wrong side of feral, but Milena doesn’t seem to mind. “Yeah, you should. Come on, then.” He beckons her with an empty hand, and Milena <em>laughs</em> - fuck, but it’s a beautiful sound - and moves just the way he’s taught her, right and left and back and <em>forward</em>, a picture-perfect lunge.</p>\n<p>He catches her wrist and twists away from the strike, and she recovers expertly, light and easy on her feet, grinning fit to match any wolf alive.</p>\n<p>“Just like that,” Lambert says, throat oddly dry. “Just like that, again.”</p>\n<p>She does.</p>\n<p>*</p>\n<p>Milena’s been in Kaer Morhen as the cub’s lady-in-waiting for a month and a half, and Lambert still hasn’t kissed her. Well. He’s kissed her hand, twice, and both times felt like he might fucking <em>die</em> at the taste of her lingering on his lips. He’s held her close as they dance, and closer when she fails to stab him - she’s getting better, but he knows she’ll never manage it, and so does she, and they’re both content with that. He’s had his hands in her hair almost every day, has mastered simple braids and Toussainti braids and fishtail braids and reverse braids and even a complicated updo that involves three ribbons and a pin long enough to almost be a dagger in its own right.</p>\n<p>He’s smelled blood on her, copper-hot and dreadful, twice now, four days each time, and hated every second of it; but it was easier the second time, to accept that she wasn’t <em>hurt</em>, just...human.</p>\n<p>He’s memorized the scent of her, rosewater soap and honest sweat, bright happiness and rich lust and something sweet he doesn’t quite dare name; the scent of her hair stays on his hands, lingering through the dark hours and winding its way into his dreams.</p>\n<p>He’s spent hours upon hours talking to her, teaching her to swear in four languages and listening to her recite poetry (though he hasn’t dared do the same, not yet), discussing Witcher training and noble upbringing, learning which flowers to give people if he wants to be as rude as possible, laughing about the cub’s antics and Buttercup’s ridiculously sweet adoration of the Wolf.</p>\n<p>But he hasn’t kissed her.</p>\n<p>He’s not sure what he’s waiting for.</p>\n<p>He finds out quite by accident.</p>\n<p>Milena shows up for training looking - a little lost, maybe a little sad. <em>Smelling</em> a little sad. Lambert’s bristling immediately. “What’s the matter?” he demands, because if someone has <em>said</em> something to her, he’s going to go punch them right in their fucking <em>mouth</em>, doesn’t matter who it is -</p>\n<p>“It’s nothing,” Milena says, and that’s a lie.</p>\n<p>Lambert scowls at her. “It’s not fucking nothing if you smell like that,” he says. “You promised you’d tell me if you were hurt.” Sad isn’t the same as hurt, but it’s all one; Milena shouldn’t ever smell anything but <em>happy</em>, and Lambert will punch as many people as he has to, to make that true.</p>\n<p>Milena gives him a sort of half smile, sad and amused at the same time. “Really, it’s nothing,” she says, and Lambert scowls harder. She sighs. “Oh, fine. <em>Witchers</em>. Worse than bloodhounds. It’s just - oh, hells, it’s my birthday, and I was hoping my parents would - would have forgiven me at least enough to send a letter.”</p>\n<p>Yennefer might open a portal to Roggeven if Lambert asks politely and tells her it’s for Milena; she <em>likes</em> Milena. He could go punch the Duke de Roggeven right in his stupid mouth. But that’s maybe a project for later. “I didn’t know it was your birthday,” he says. He should’ve asked, but - well - Witchers don’t <em>have</em> birthdays, really; most of them don’t <em>know</em> what day they were born, and celebrating the day they were brought to Kaer Morhen would be really fucking depressing. “I didn’t get you anything.”</p>\n<p>Milena smiles up at him. “I never mentioned it,” she points out. “How could you have known? And you don’t have to get me anything. Just spending time with you is a gift.”</p>\n<p>How the <em>fuck</em> is a man supposed to cope with a statement like that, Lambert would like to know?</p>\n<p>“I. I’d have <em>wanted</em> to get you something, if I’d known,” Lambert says, because it’s true. He’d kind of like to give Milena something, something that would please her, and see her smile. He’s got no idea <em>what</em>, but - he could come up with something. Buttercup would help, if he asked, or the cub, even. “What <em>would</em> you want?”</p>\n<p>Milena looks up at him, long lashes half veiling dark eyes, and Lambert honestly can’t tell what she’s thinking. She starts smelling <em>nervous</em>, though. Which makes Lambert nervous, because <em>fuck</em>, she’s got to know he’d give her anything she wanted, there’s nothing - well, almost nothing - she could ask for that he <em>wouldn’t</em> want to give her. She licks her lips, and Lambert is staring and <em>really</em> should look away, but oh <em>fuck</em> she’s so - so close, and so pretty, and smells so good, and it isn’t fucking fair that she can turn him into a fucking <em>mess</em> without ever saying a word.</p>\n<p>Not that he’d change her even if he could. But still.</p>\n<p>“What would you do,” Milena says, slowly and softly and carefully, every word individually weighed out like golden coins, “if I said I wanted a kiss?”</p>\n<p>“Do you?” Lambert asks. His voice <em>doesn’t</em> break. It hasn’t broken in fucking <em>decades</em>, it certainly doesn’t <em>now</em>.</p>\n<p>Milena reaches up, slowly, to put her hand on his cheek, and meets his eyes. “If,” she says, very quietly, “if it would mean as much to you as it would to me - if you love me, Lambert, because I love <em>you</em>, very dearly - then yes, I would like a kiss. But only then.”</p>\n<p>“I. You. <em>Fuck,</em> Milena,” says Lambert, and loses every word in his fucking idiot head, and then, thank whichever gods look out for fools and witchers, remembers the poem, the one that made <em>sense</em> when all the others were fucking bullshit. She smiles, and there’s a giggle beginning somewhere deep in her throat, one he wants to hear, but not as much as he wants to get this <em>right</em>. He turns his head to kiss her thumb, and she draws in a short breath, surprised, pleased, <em>waiting</em>.</p>\n<p>“<em>But what to me are north and south,</em>” he says, and her eyes go wide. “<em>And what the lure of many lands / since you have leaned to catch my hands / and lay a kiss upon my mouth.</em>”* It’s a proper Witcher’s poem, he’d thought when he first read it. Or - the first bit is a Witcher’s poem. The second bit is - is this, right here, because the world is huge and terrible and full of monsters and the only piece of it he really fucking <em>needs</em> is the woman looking at him, wide-eyed and trembling, not quite yet in his arms.</p>\n<p>“Oh,” she says, soft and wondering, and he kisses her.</p>\n<p>She tastes <em>so fucking good</em>.</p>\n<p>And - look, Lambert hasn’t kissed a lot of people, whores charge extra for it and he’s always had better things to do with his coin, but now he’s thinking he was an <em>idiot</em>, or maybe it’s just this good because he actually <em>wants</em> to kiss Milena, because she’s warm and sweet in his arms (and when did he wrap his arms around her?) and her hands on his cheeks are so fucking soft, and she tastes of mint and cloves, and she <em>sighs</em> like she’s been waiting for this forever, and melts against him, trusting him to hold her up. Lambert would be perfectly happy to stand here kissing her for the next <em>decade</em> if that’s what she wanted. It’s just - her trust, her slight weight and soft warmth, the smell of roses and <em>happiness</em> filling the air, her lips so gentle against his -</p>\n<p>This might <em>actually</em> be a perfect moment.</p>\n<p>She breaks the kiss after - a while, Lambert hasn’t been trying to keep track of the <em>time</em>, alright, he’s been busy trying to memorize the way her eyelashes look against her cheeks and the taste of her mouth - but she doesn’t pull away, just slides her hands down from his cheeks to loop around the back of his neck and smiles up at him. He doesn’t remember doing it, but he’s got both arms wrapped around her waist and has pulled her close so she’s pressed up against him, and he can feel her chest rise and fall against his as she breathes. There are spots of color high on her cheeks and her lips are very pink and she smells like distilled happiness, so strong and sweet Lambert thinks he could probably get drunk off just the <em>smell</em>.</p>\n<p>He has no idea what to say.</p>\n<p>“That was the best kiss I have ever gotten,” Milena says quietly.</p>\n<p>“It. Mine, too,” Lambert admits. He doesn’t want to think about other people kissing her. He doesn’t want anyone else to ever kiss her again. If he keeps doing whatever the fuck he’s apparently doing right, maybe she’ll never <em>want</em> to kiss anyone else.</p>\n<p>Milena licks her lips. Lambert swallows hard. “Would you,” Milena says, almost a whisper, “would you mind very much if I said I wanted another?”</p>\n<p>“Would I <em>mind</em>?” Lambert says, and kisses her again. Oh <em>fuck</em>, it’s better the second time, because now he knows she likes it if he moves his tongue just so, bends his head a little more and gathers her even closer. She makes a tiny sound against his lips, so soft only a Witcher could have heard it, and he wants to hear it <em>again</em>.</p>\n<p>When the second kiss ends, Milena blinks up at him for a long, long moment, and then shifts her weight back. Lambert <em>wants</em> to keep her tucked close, but - no. He loosens his arms, lets her back away as far as she likes. If she’s re-thinking this - regretting it - though she doesn’t <em>smell</em> like regret, she still smells like happiness, sweet and almost overwhelming in its intensity -</p>\n<p>She pushes, very gently, at his shoulders; she couldn’t move him even if she <em>shoved</em>, of course, but he backs up, and she follows, guiding him back again, again, until he’s standing in front of one of the benches lining the walls.</p>\n<p>Lambert sits down, because that’s pretty clearly where this is going, and is promptly astonished when Milena <em>sits on his lap</em>.</p>\n<p>She’s light and warm and soft and <em>right there</em> and -</p>\n<p>Well, Lambert suddenly understands why Geralt is always so pleased to have Buttercup on <em>his</em> lap, because there’s something about having Milena so close, tucked into the curve of his arms and the shelter of his body, that’s so utterly satisfying Lambert can’t even put words to the sensation.</p>\n<p>And then <em>she</em> kisses <em>him</em>, and Lambert can’t help the sound that rises from his chest, somewhere between a possessive growl and a pleased purr. It doesn’t seem to bother Milena; she just snuggles <em>closer</em>, utterly unafraid, and makes a happy little noise in return, and Lambert has no idea how to deal with this except for doing his utmost fucking best to make <em>this</em> kiss even better than the first two were.</p>\n<p>And also somehow <em>not</em> think about the way she’s sitting - straddling him, with her knees on either side of his hips, her skirt puddled around them in heaps of soft deep-brown fabric - she’s pressed up against him and he <em>knows</em> she’s wearing stockings but they’re thin silk and he can feel the heat of her legs through <em>his</em> trousers and if - if they ever do this again, if she ever decides she wants more than <em>kisses</em>, it would be so damn easy to just reach down between them and unlace his trousers and lift her up a little and just -</p>\n<p><em>Don’t think about it</em>. Kissing. Think about kissing.</p>\n<p>Kissing is, in fact, very distracting, and Lambert is going to memorize every one of Milena’s soft happy sounds and how to elicit them if it’s the last thing he does with his long and mostly unpleasant life.</p>\n<p>She finally draws back a little, panting, after what was either a very <em>long</em> third kiss or possibly four or five shorter kisses, and smiles at him so sweetly it makes something in his chest ache. And then she seems to realize the position they’re in - absolutely scandalous, Lambert suspects, in any court but Kaer Morhen - and her ears go pink and she squeaks. Lambert thinks she’ll get up - maybe even flee the room - fuck, he doesn’t want her to go, but he’s sure as fuck not going to <em>grab</em> her -</p>\n<p>And she buries her face against the side of his throat and makes a little giggly happy noise and <em>stays put</em>.</p>\n<p>Lambert is only a Witcher, not a god of self-control, and the way she’s cuddled against him, the back of her neck and the curve of her throat are bared, and he can smell happiness and roses like the best perfume in the whole damn <em>world</em>. He bends his head and buries his nose against her skin, breathing in like he can fucking <em>absorb</em> the smell, can bathe in it, can <em>keep</em> it forever.</p>\n<p>He’s not a good enough man to keep from daring a little, little lick. He’s never <em>tasted</em> happiness before. Or roses, come to think of it. Milena’s breath catches, and Lambert closes his eyes and muffles a curse. That was - that was <em>definitely</em> too much, wasn’t it.</p>\n<p>“What do I taste like?” Milena murmurs.</p>\n<p>Oh fuck, that’s practically <em>permission</em>. “Roses,” Lambert mutters, and presses a kiss to the soft skin beneath his mouth.</p>\n<p>“Huh,” Milena says, and giggles. “You know, Zofia warned me that Witchers were prone to <em>biting</em>, not licking.”</p>\n<p><em>Zofia</em> warned her - Lambert winces. “Oh fuck,” he says. “What...what did Zofia tell you?” Fuck, fuck, <em>fuck</em> - sure, Zofia’s been around Witchers long enough that she probably <em>does</em> have good advice, but she’s not exactly <em>fond</em> of Lambert, on account of him being kind of an asshole - she could’ve told Milena any <em>number</em> of nasty little things, all of which would be arguably true.</p>\n<p>Milena squeaks, and Lambert can feel her skin heat against his as she blushes <em>very</em> dark. “Some very good advice that I <em>really</em> can’t repeat,” she says, voice high and thin, and the smell of embarrassment almost overwhelms the glorious scent of happiness. “I promise none of it was bad?”</p>\n<p>Oh fuck oh fuck oh <em>fuck</em>, how does he get the happiness-smell back? If Milena is embarrassed she’ll move <em>away</em>, and Lambert is not ready to <em>not</em> have her cuddled up on his lap, trusting and warm and safe and <em>his</em>. “It’s fine,” he says desperately. “It’s - I was just curious - <em>fuck</em>.”</p>\n<p>Milena giggles, and relaxes, and the sour smell of embarrassment fades away. Oh thank <em>fuck</em>.</p>\n<p>And really, whatever it was, it can’t have been <em>that</em> bad, right? Not since Milena <em>is</em> here, is in his arms and smelling like roses and happiness, is apparently -</p>\n<p>Is apparently in love with him.</p>\n<p>Lambert has <em>no fucking clue</em> how he got this lucky, but whatever it was, it must’ve been <em>really</em> fucking good, if it earned him this moment - this whole fucking <em>afternoon</em> - fuck, if this is what reciting poetry earns him, he’ll fucking well memorize it <em>all</em>.</p>\n<p>Milena has been part of the White Wolf’s court for two months, and really she thinks she’s settling in quite well. Her days have fallen into a comfortable pattern: get up in the early grey light of dawn and head down to the hot springs to bathe and gossip with Jaskier and Triss and Lady Yennefer and sometimes Zofia. Breakfast in the great hall, followed by morning lessons with Ciri: maths and history and geography, languages and court etiquette and sewing, music theory and household management and anything else that Ciri’s quicksilver mind latches onto; Milena brings her embroidery up and sews while they’re talking, and has so far adorned three tunics for Zofia, four dresses for Ciri, a very nice doublet for Jaskier, three handkerchiefs for Triss, and several scarves for herself, and is working on a belt for Lady Yennefer. She hasn’t quite figured out what to make for Lambert yet, but she’s got time. After lessons, dinner in the great hall again, and then a few hours either helping Lady Yennefer with the Warlord’s correspondence or Triss with her brewing - Milena doesn’t precisely <em>enjoy</em> working with the foul things Triss puts into her potions, but it’s good to feel <em>useful</em>.</p>\n<p>And then the best part of her day: the hours with Lambert. Talking, learning, laughing. <em>Kissing</em>. Since her birthday, they’ve spent a <em>lot</em> of time kissing. Lambert seems astonished and delighted every time, as though he’s <em>still</em> surprised that she enjoys his company - that she loves him.</p>\n<p>Milena still can’t quite believe that she dared to <em>say</em> that to him. Gently-bred young ladies don’t just confess their love like that. But she’s of Kaer Morhen now, and Witchers say what they mean.</p>\n<p>Or just swear a lot. They do that, too.</p>\n<p>So yes, hours with Lambert - she’s getting quite good with a dagger, actually - and then supper, and then dancing or singing or watching the Witchers brawl, which was extremely startling the first few times but is now just...a thing that happens, because Witchers are <em>ridiculous</em>, and then Lambert walks her up to her rooms and kisses her goodnight.</p>\n<p>Milena’s starting to think she might want more than <em>kissing</em>, one of these days. <em>Soon</em>, even. She’s not in Redania any more: her maidenhead is not a bargaining chip, not a way to drive up the price of her inevitable miserable marriage. It’s hers to give wherever she pleases, because Ciri certainly isn’t going to arrange her marriage, and the White Wolf isn’t either. Really, no one in Kaer Morhen cares <em>who</em> she sleeps with - or doesn’t sleep with - as long as no one’s being pressured into anything, as Jaskier quite bluntly informed her some weeks ago.</p>\n<p>Given that her liege lady and liege lords don’t have any particular opinions either way, then, Milena only has two real concerns about - well, about the sorts of things <em>proper</em> young ladies don’t even think about until their wedding nights.</p>\n<p>The first is that she...isn’t entirely sure Lambert <em>wants</em> to do more than kiss. He certainly hasn’t <em>said</em> anything. On the other hand, he always seems so astonished that she wants to <em>kiss</em> him that maybe he doesn’t think she <em>wants</em> anything more, and as prickly and generally crude as he can be, he tries so hard to be a gentleman with her.</p>\n<p>The second is that she doesn’t have more than a very, very broad idea of what to <em>do</em>. She knows only the most basic outline of how bedsport <em>works</em>, because a young noble lady isn’t expected to know more than that. She’d rather like to know at least a <em>little</em> more of what to expect before she...does anything.</p>\n<p>There isn’t, so far as she can tell, anything in Kaer Morhen’s library that’s really relevant. If she wanted to learn to kill any sort of monster, make any sort of potion, or learn any sort of history, she’d be in luck, but alas almost every <em>other</em> subject is utterly lacking.</p>\n<p>She’s not quite bold enough to ask Jaskier and Triss and Lady Yennefer for <em>advice</em>, or not yet at least, though they’ve gotten a lot less careful about how bawdy their jokes and gossip are, and she’s learned several things just from <em>listening</em>. But that’s not <em>quite</em> enough, not really.</p>\n<p>And then one morning Jaskier comes down to the baths bubbling over with glee, and explains that he’s just gotten a crate of books from a very <em>particular</em> bookseller in Oxenfurt. Lady Yennefer’s eyes light up, and Jaskier promises, laughing, that he’ll lend her several.</p>\n<p>Milena swallows hard and says, feeling her ears burning, “Might I borrow one?”</p>\n<p>Jaskier cocks his head at her and smiles, kind and gentle. “Of course you can. Shall I choose one that’s...fairly simple?”</p>\n<p>“Please,” Milena says.</p>\n<p>Jaskier hands her a book after dinner, and Milena squirrels it away in her rooms before going to assist Lady Yennefer and spend her usual afternoon with Lambert. Every time she gets something right in dagger training, he kisses her; every time he gets her braids right, she kisses him. They’re both improving <em>very</em> fast. At fighting and braiding, too.</p>\n<p>Jaskier sings after supper, which is usually enough to keep Milena’s attention, but the thought of the book is like a thorn pricking at her mind. She makes it through three songs before she catches Lambert’s eye and slips away.</p>\n<p>“Are you feeling well?” Lambert asks anxiously as he catches up to her at the door and offers his arm. “You’re not ill?”</p>\n<p>Milena smiles up at him and tucks herself closer, enjoying the heat and strength of his arm under her hand. “No, I’m fine,” she says. “Just a little tired.”</p>\n<p>Lambert frowns at her, and Milena sighs. Witcher senses and the ability to smell <em>lies</em>. “Alright, I’m not tired,” she says. “There’s a book I really want to read.”</p>\n<p>“And you’re blushing,” Lambert observes.</p>\n<p>“Please don’t ask?” Milena begs.</p>\n<p>“Alright,” Lambert says, looking baffled. “I’m not asking.”</p>\n<p>“Thank you,” Milena says, and goes up on her toes to kiss his cheek. Lambert’s cheeks go pink. “I <em>will</em> tell you, I think - just not tonight.”</p>\n<p>Lambert kisses her goodnight at her door, and Milena curls up in bed and opens the slender book. There’s no title on the cover, and no author listed, and it’s hand-written, not printed, in a very pretty copperplate hand.</p>\n<p>It’s also <em>filthy</em>. Milena only makes it through the first three pages before she has to close it and blink at the curtains of her bed in baffled astonishment. Zofia’s matter-of-fact advice about <em>mouths </em>is suddenly <em>much</em> clearer.</p>\n<p>She stays up very late that night, and Jaskier kindly doesn’t tease her at all for her bleary eyes the next morning in the baths. Lady Yennefer laughs at her, not very meanly, and says, “So, planning to trip your Witcher into bed, then, my girl?”</p>\n<p>Milena <em>does</em> blush, but not as badly as she used to two months ago. “Quite possibly,” she says, with as much dignity as she can.</p>\n<p>“Good luck with that,” Triss says, patting Milena on the shoulder. “Have fun!”</p>\n<p>Milena blushes all the way through breakfast, but thankfully, has it under control by the time she heads up the stairs to Ciri’s rooms. She does <em>not</em> want the little princess joining <em>this</em> teasing.</p>\n<p>That night Jaskier plays dancing music, and Milena spends a pleasant hour in Lambert’s arms, whirling around the great hall happily. Lambert has gotten to be a <em>very</em> good dancer, and he’s easily strong enough to lift Milena or twirl her or dip her, and she never fears he’ll drop her.</p>\n<p>He walks her up to her rooms at the end of the night, and Milena takes a deep breath and looks up to meet surprisingly comforting amber eyes. She’s gotten used to the slitted pupils; it’s rather flattering, now, to see them blown nearly round whenever he looks at her.</p>\n<p>“Would you,” she says, and hesitates. A lock of her hair has come loose during the dancing; Lambert coils it around his finger, smiling down at her, waiting.</p>\n<p>Her choice, as it never would have been in Redania; her choice, because asshole though he may be, Lambert won’t ever ask for more than she cares to give.</p>\n<p>Her choice, and she <em>wants</em> him, prickly and foul-mouthed as he may be - because he has never been anything but sweet to <em>her</em>, and she loves him.</p>\n<p>“Would you like to come in?” she says.</p>\n<p>Lambert’s pupils go so wide she can barely see the amber around them, and he makes a tiny squeaking noise that she’s pretty sure he didn’t mean to let out. He takes a deep breath, and licks his lips, and says, “Oh fuck, you’re <em>sure</em>.”</p>\n<p>Milena nods.</p>\n<p>Lambert kisses her hungrily, and fumbles behind her for the door, shoving it open clumsily. Milena laughs against his mouth and backs up, leading him in, and Lambert kicks the door shut behind him.</p>\n<p>*</p>\n<p>Milena’s not sure what she expected, really. The astonishing filthy book had a <em>lot</em> of ideas, and the cheerful gossip she’s heard from Jaskier and Lady Yennefer and Triss has provided a great many more, and of course there’s always Zofia’s blunt advice -</p>\n<p>But really, given how Lambert has treated her pretty much since the day he carried her down a mountain, swearing all the way and holding her like fine porcelain, she should have guessed it would be -</p>\n<p>Gentle and overwhelming and <em>sweet</em>, and full of swearing.</p>\n<p>Lambert helps her undo the long line of buttons down the back of her dress, and fumbles at several of them - his thick fingers are so dextrous with weapons, but her buttons are tiny pearls, slippery and delicate - and he swears in four languages while she laughs. And then, when she turns and lets the dress fall and kicks off her slippers, leaving her in chemise and stockings and underskirt, thin silk and linen that conceals very little, he makes a sound like a wounded animal and buries his face against the curve of her throat, licking at her skin and whispering curses in tones of utter awe, arms tight around her.</p>\n<p>Even six months ago, before the White Wolf came to Redania and Milena met Jaskier, the idea of being wrapped up in a Witcher’s embrace would have been <em>terrifying</em>. The stuff of nightmares. Now - now she’s held safe and warm, and the hands that have slain countless monsters are spread across her back so gently they’re almost hesitant, and she doesn’t want to be anywhere but here.</p>\n<p>And it has to be her leading, because Lambert won’t push - doesn’t dare, and she’s starting to understand that her big strong Witcher who fears nothing is afraid that he’ll manage to scare <em>her</em>, that if he does something wrong she’ll go back to believing that Witchers are terrifying monsters. Darling ridiculous man, prickly and foul-mouthed and so sweet underneath it’s almost painful to see.</p>\n<p>So she hugs him, hard, and steps back, and pulls off her chemise, and Lambert squeaks the way he did the first time she asked him to dance, and his pupils go entirely round and so large she can barely see the amber of his eyes.</p>\n<p>“Now you,” she says, and he tugs off his shirt without taking his eyes away from her, drops it behind him carelessly.</p>\n<p>His chest is broad and scarred, marked by a hundred hunts and battles; any mortal man would have been dead a dozen times over, but on Lambert the scars have healed to pale lines, slight ridges. She wants to trace every one of them with her fingers, wants to kiss them. Wants, maybe, to lick - he seems to like the way <em>her</em> skin tastes, maybe she’ll like his.</p>\n<p>But first, she tugs loose the strings of her underskirt, and lets it fall. Lambert’s eyes follow it down, and come back up again <em>slowly</em>, like he’s memorizing every inch of her.</p>\n<p>“Now you,” Milena says again, more softly than she meant to, and Lambert tries to take off his pants without remembering to unlace his boots first, and Milena has to sit down on the bed and <em>laugh</em> while he sits on the floor and wrestles with his bootlaces and swears.</p>\n<p>She can’t be nervous when it’s just - it’s <em>them</em>. Laughter and kisses and swearing, and Lambert trying so very, very hard not to scare her, when she doesn’t think he even <em>could</em> anymore. Other Witchers, maybe, but she’ll never be scared of <em>her</em> Wolf again.</p>\n<p>A naked man’s not as imposing as she had worried, when he’s on his knees in front of her, looking up at her with blown-dark eyes and grinning like the wolf he is. “You smell so <em>good</em>,” he says, and reaches for her - and hesitates, waiting, until she takes his hands and presses them to her waist, smiles down at him and nods permission.</p>\n<p>Lambert pulls her to the edge of the bed, her knees spread wide by his broad shoulders, and breathes in. “Salt and roses,” he says - <em>growls</em>, really, and Milena shivers at the sound.</p>\n<p>“That’s me,” she says, a little shakily.</p>\n<p>Lambert licks his lips. “Fuck,” he says, and he’s looking at her like he can’t believe she’s <em>real</em>. His hands are broad and warm, almost spanning her waist entirely. The slight roughness of the scars on his arms catches a little against the silk stockings she is still, improbably, wearing.</p>\n<p>Witchers say what they mean, and Milena is learning to do the same. “I don’t entirely know what I’m doing,” she admits quietly. “Is there - what do <em>you</em> want?”</p>\n<p>“Want to taste you,” Lambert rumbles.</p>\n<p>Milena reaches out, slow and careful, to run her fingers through his short-cropped hair, down over the scars on his cheek. He turns his head to kiss her palm. “Go on, then,” she whispers.</p>\n<p>To her surprise, he licks a stripe along her inner thigh, and makes a low pleased noise at the taste. Milena giggles from the sheer <em>unexpectedness</em> of it, and Lambert makes another pleased noise and then leans forward and buries his face between her thighs.</p>\n<p>Milena <em>yelps</em>, shocked and delighted, and says a word she learned from Lambert himself. Lambert laughs, which is a really, truly astonishing sensation just now. And then it’s just - overwhelming, genuinely <em>overwhelming</em>, and Milena makes a fist in the sheets and rests her other hand shakily on Lambert’s head and gasps shocked pleasure to the stone walls. Oh - this - yes, Zofia was <em>completely</em> right in saying this was a good idea - and so was the astonishing book - and - really she ought to have expected this given how much he seems to like <em>licking</em> her -</p>\n<p>Milena surprises herself quite thoroughly with the sound she makes as the warmth in the pit of her stomach turns to shocking, limb-shaking pleasure.</p>\n<p>Lambert looks very, very smug. Milena laughs breathlessly at the smirk he’s wearing, the cocky tilt to his head. “Get up here and kiss me,” she says, and Lambert stands and does so. She can taste what must be her own salt on his lips, and it’s shocking and scandalous and she doesn’t mind at all.</p>\n<p>She runs her hands down his chest, tracing the scars, wondering at the softness of his skin. He twitches, just a little, as she trails her fingers down over his stomach, tracing the line of a particularly nasty scar. Milena pauses, glances up at his face, and moves her fingers again, brushing lightly against his skin. Lambert makes a tiny strangled noise and twitches again.</p>\n<p>“You’re <em>ticklish</em>,” Milena says, delighted.</p>\n<p>“Nonsense,” Lambert says. “Witchers aren’t ticklish, that’s absurd -”</p>\n<p>Milena runs her fingers up over his ribs, and Lambert squawks and flinches.</p>\n<p>“Ticklish,” Milena says, grinning. It makes him far more human, somehow - far more <em>touchable</em>, that he should have so simple a weakness.</p>\n<p>Lambert drops his head to her shoulder. “<em>Please</em>,” he says desperately, “you can’t tell anyone.”</p>\n<p>“No one knows?” Milena asks, startled.</p>\n<p>“I convinced everyone the Trials burned it out of me,” Lambert says. “Fuck, <em>please</em>, Milena. If Eskel or Geralt or fucking <em>Gweld</em> finds out, I’ll never have a moment’s peace.”</p>\n<p>“I promise,” Milena says, firmly suppressing a giggle. “Tell you a secret,” she adds softly, and Lambert hums a question. “I am too.”</p>\n<p>Lambert breathes a laugh against her skin and raises his head to kiss her again. “I’ll never tell.”</p>\n<p>“Our secret,” Milena agrees, and it’s that - that simple silly <em>joy</em>, the laughter and trust that they share even now, that makes it easy and utterly terrorless to look down and reach out and wrap one hand around his prick, just to see how it feels.</p>\n<p>Lambert makes a strangled noise and drops his head to her shoulder again, and his hands to the sheets, and twists the fabric so tightly in his fists she’s a little worried he’ll tear it as she moves her hand in slow, experimental strokes. For long moments he lets her do exactly as she pleases, gasping tiny desperate noises against her skin, and then she must do something <em>very</em> wrong or possibly <em>very</em> right, because he growls, low and loud, and moves so fast it’s a bit of a blur, and she finds herself on her back on the bed with him looming over her, caging her in, broad shoulders and sturdy arms and a look of wild hunger on his face.</p>\n<p>It should maybe be terrifying, but it’s <em>Lambert</em>, and she’s always safe in his arms. He seems to realize what he’s done after a moment, and his eyes go wide and he starts to move away. Milena wraps a hand around his arm - her fingers don’t come anywhere <em>close</em> to reaching around his wrist - and he could break her hold with a thought, but he freezes like she’s pinned him.</p>\n<p>“I like that,” she says, and he swallows hard and settles back into place above her, huge and warm and <em>safe</em>.</p>\n<p>Well. If being about a hair’s breadth from losing her maidenhead counts as safe. Which...in Kaer Morhen...it does. Because it’s hers to give, if she wants, and she <em>does</em> want. And she’s definitely not going to lie back and think of heirs.</p>\n<p>“Tell me,” Lambert says. “Fuck, anything you want, just tell me.”</p>\n<p>Milena savors the word on her tongue before she says it. “Fuck. Yes. That. That’s what I want.”</p>\n<p>Lambert kisses her, breathing curses like love-names into her mouth, and Milena laughs against his lips and wraps her legs around his waist and does not think of heirs at all - does not think of anything but lust, and joy, and love.</p>\n<p>*</p>\n<p>“So,” Jaskier says, propping his elbows on the sides of the pool and giving Milena and Lambert a long look full of affection and amusement. “I’m guessing there’s a reason Lambert is <em>here</em> on this fine morning, and not, say, still in his nice warm bed, hm?”</p>\n<p>Milena blushes. Lambert wraps his arms a little more snugly around her waist and says, “Oh, fuck off, Buttercup. And stop <em>smirking</em>.”</p>\n<p>“Shan’t,” Jaskier says amiably. “I am going to be incredibly smug about having been partially responsible for this absolutely adorable relationship for <em>months</em>, and you can’t stop me.”</p>\n<p>“You’re <em>dreadful</em>,” Milena says, but she can’t help laughing. Lambert’s chest, pressed to her back, shakes with silent laughter too. “Thank you, my friend.”</p>\n<p>Jaskier goes pink. “Oh, that’s not fair,” he says, covering his face with one hand. “You’re not supposed to be all - genuinely grateful! Dreadful woman. Absolutely horrible. You deserve each other.”</p>\n<p>“Yes,” Milena says, and turns her head, and Lambert catches her lips in a kiss. “We do.”</p>"
}