{
  "id": "23720248",
  "url": "https://archiveofourown.org/works/23720248?view_full_work=true",
  "author": [
    "occultings (microcomets)"
  ],
  "title": "come home to my heart",
  "rating": "Mature",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "陈情令 | The Untamed (TV)",
    "魔道祖师 - 墨香铜臭 | Módào Zǔshī - Mòxiāng Tóngxiù"
  ],
  "relationships": [
    "Lan Zhan | Lan Wangji/Wei Ying | Wei Wuxian"
  ],
  "characters": [
    "Lan Zhan | Lan Wangji",
    "Wei Ying | Wei Wuxian",
    "Jiang Cheng | Jiang Wanyin",
    "Jiang Yanli",
    "Lan Huan | Lan Xichen"
  ],
  "additional_tags": [
    "Bodyswap",
    "Mutual Pining",
    "Slow Burn",
    "Alternate Universe - Canon Divergence",
    "First Time",
    "Getting Together",
    "Confessions",
    "Sharing a Bed",
    "there actually IS some plot and lore wonder of wonders",
    "lwj is a service top fight me",
    "WangXian Week 2020",
    "WangXian Week",
    "Misunderstandings",
    "and a little bit of hurt/comfort as a treat"
  ],
  "language": "English",
  "series": "",
  "published": "2020-04-18",
  "completed": "2020-04-27",
  "words": "29,790",
  "chapters": "5/5",
  "comments": "724",
  "kudos": "14,162",
  "bookmarks": "3,402",
  "hits": "149,537",
  "summary": "<p>“Listen. Lan Zhan,\" Wei Ying says. \"I know this whole thing, with — with the soul-switch, it’s upsetting. And believe me, I know my body is the last one on earth you’d want to be inside of.”</p>\n<p>Lan Wangji chokes, then passes it off as a cough.</p>\n<p>—</p>\n<p>On a night hunt, Wei Wuxian and Lan Wangji get cursed and stuck in each other's bodies. As you would expect, shenanigans ensue.</p>",
  "notes": "<p>Hi guys! This fic is set shortly after the events of the Sunshot Campaign, but as if Wen Qing never met Wei Wuxian at Jinlintai (episode 26-ish for the live action people), thus triggering the events of Qiongqi Way/Path onward — the Wen siblings and A-Yuan are hiding safe and happy somewhere in this universe, thank you v much. It has some of the book’s characterization but mostly follows the events of the live action, as Wei Wuxian and Lan Wangji have a better relationship at this narrative point in the show than they do in the book.</p>\n<p>Heads up that there are <b>spoilers for the live action through episode 46!</b></p>\n<p>Content warnings are alcohol usage, canon-typical blood loss (but really not much), and sloppy gay feelings.</p>\n<p>Disclaimer that this is my first fic for this pairing and fandom. Happy to accept feedback or corrections in comments!! Thank you very much to my beta Kelsey also.</p>\n<p>Shout @ me on <a href=\"https://www.mishcollin.tumblr.com\" rel=\"nofollow\">tumblr</a> or <a href=\"https://www.twitter.com/occultings\" rel=\"nofollow\">twitter.</a></p>\n<p> <br><a href=\"https://ficbook.net/readfic/10207912/26266848\" rel=\"nofollow\">Translation in Russian (Русский) available here.</a></p>\n<p>\n<a href=\"https://www.wattpad.com/story/277782723-come-home-to-my-heart?utm_source=android&amp;utm_medium=link&amp;utm_content=story_info&amp;wp_page=story_details_button&amp;wp_uname=GleamlyShadowie&amp;wp_originator=Q2FzUN4uHtrLhltWGclEjXv3PUw9Mf1TVpnmRantC58eo6HNfbcKUiO8rz%2B9UFDdHIvPw548eFW4CtDQioMJRmfWuzwo8EawAYNEEhN3wqE%2BEJpqEE6wwuyBVhZc6dRR\" rel=\"nofollow\">Translation in Turkish available here.</a>\n</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>Hi! This fic is almost totally finished and will probably end up around 25k; I’m still working on adding scenes here and there so I’m posting them chapter by chapter. I just really wanted to help celebrate Wangxian Week once I realized halfway through the week that it was going on. The rest should be up probably this week; thanks for reading!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">notes</a>.)\n</p>\n<p>( ͡° ͜ʖ ͡°)</p>\n<p>One more chapter after this. Thanks for sticking with me this far!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">notes</a>.)\n</p>\n<p>.<br>.<br>.<br>Aaaaand then Nightless City never happens! Jk, jk, canon resumes and it does (or it doesn’t, depending on your angst threshold — up to you to decide).</p>\n<p>Thank you so much for reading this far! If you enjoyed, drop a line down below or shout @ me on <a href=\"https://microcomets.tumblr.com/\" rel=\"nofollow\">tumblr</a> or <a href=\"https://www.twitter.com/occultings\" rel=\"nofollow\">twitter.</a> This is my first fic for this pairing, and hopefully I’ll write more for them because this was so fun. :’)</p>\n<p>I also have a CQL/MDZS-specific sideblog <a href=\"https://wanlangji.tumblr.com\" rel=\"nofollow\">here</a>!</p>",
  "text": "<p>The whole unfortunate ordeal starts out with a night hunt, as most unfortunate things in Wei Wuxian’s life regularly do.</p>\n<p>He and Lan Wangji had been part of a small hunting party in response to some complaints near Caiyi Town of graves being ravaged and upturned. The whole situation was pretty unbecoming, with half-decaying limbs being dragged out of the ground here and there, and the locals were starting to complain about the smell, among other things. </p>\n<p>Wei Wuxian certainly isn’t in Gusu for his health, nor for any night hunts that the GusuLan sect could easily take care of themselves. No, he’d found himself in Gusu with Jiang Cheng and shijie, mostly against his will, for a conference at the Cloud Recesses later in the week, where sect leaders and some select disciples would discuss next steps in the wake of the Sunshot Campaign — and the power vacuum left by the QishanWen sect’s fall from grace. </p>\n<p>All fine, and good. Wei Wuxian isn’t exactly thrilled to be back in the Cloud Recesses, save for the liquor selection, but he far prefers it to Nightless City.</p>\n<p>The corpse-disturber, or whatever it is, was surely nothing that a small group of cultivators couldn’t handle, which is why he, Lan Wangji, Jiang Cheng, and a few others had been deployed to solve the issue.</p>\n<p>Unfortunately, the day’s hunting party included Jin Zixuan, who was steadily tempting Wei Wuxian into committing homicide.</p>\n<p>After seeing the seventh snappy flip of hair over a bow and arrow, Wei Wuxian had decided he’d had quite enough of that, thank you, and had roped a reluctant Lan Wangji into splitting off from the rest of the group to follow a separate trail of tracks, leading south while the rest of the party headed west.</p>\n<p>Which is how the two of them had ended up alone in a small, dank-smelling cave, currently struck dumb by an ear-splitting screech and an explosive flash of light.</p>\n<p>It takes several moments for Wei Wuxian to come back to himself; he blinks hard, but the darkness of the cave doesn’t abate even a little bit, other than the searing white dots flickering in his vision. His ears are still ringing. </p>\n<p>The cave is silent now, aside from their own mingled breathing — the creature, whatever it is, had been effectively spooked off.</p>\n<p>Fine, maybe this hadn’t been one of Wei Wuxian’s brighter ideas, as Lan Wangji had been so fond of reminding him every step of the way here. Not in words, of course, so much as judgy mannerisms and withering squinting. </p>\n<p>“Lan Zhan?” he asks, panting and groping around in the dark. He finds a wiry shoulder under his palm a moment later. “Lan Zhan.”</p>\n<p>“Mn,” Lan Wangji replies, and something sounds — different about his voice. Off. Wei Wuxian doesn’t think much further on it.</p>\n<p>“Are you okay? Ugh, it’s so dark that I can barely breathe. Here.” He sinks his teeth into his thumb, wincing at the sting as he draws blood, and traces a lighting talisman into the space in front of him.</p>\n<p>A gout of orange light flares around them, illuminating Lan Wangji’s tired face before his and it’s — it’s — gray eyes gazing back at him, caught silver in the talisman’s glow, and Wei Wuxian has one stunned, uncomprehending moment to take in his own features gazing back at him before he shouts, and the light snuffs out.</p>\n<p>“Wei Ying,” Lan Wangji’s voice — <em> Wei Wuxian’s voice — </em>rings out in the dark, and he sounds panicked in a way that Wei Wuxian can’t ever recall hearing from him. “My core, it’s — it’s —” He can’t finish his sentence, the words choking off, and Wei Wuxian feels every drop of blood in his body ice over.</p>\n<p>“Oh,” he says, weakly, “about that,” and then conveniently passes out.</p>\n<p align=\"center\">—</p>\n<p>When Wei Wuxian comes to, it’s to the uneven stagger of footsteps beneath him, and he squirms. There’s a sharp huff of effort directly above him, and when he opens his eyes, bleary, he sees his own jawline above him, jutted in concentration. He’s being carried — with considerable strain, given the new size difference — and Wei Wuxian struggles harder as he grips his bearings. </p>\n<p>“Lan Zhan,” he says, “what are you — put me down.” </p>\n<p>Lan Wangji doesn’t answer him, just stubbornly keeps walking without looking down at him, and Wei Wuxian can’t tell if he’s unspeakably angry or just pigheaded.</p>\n<p>“Please,” he adds. “Lan Zhan, what happened?”</p>\n<p>Lan Wangji stops, then sets Wei Wuxian gently on his feet. The change in elevation makes all the blood rush to Wei Wuxian’s head, and he sits with a heavy thud on the ground.</p>\n<p>Wei Wuxian looks around, trying to reorient himself. It seems they’re still some way from the entrance to Cloud Recesses, but still, Lan Wangji had carried him an impressive distance, given he’s bleeding from a head wound and shaking with fatigue.</p>\n<p>Trembling, Wei Wuxian stares at his hands. The fingers are long, beautiful, moon-pale — nothing like his own worn, sun-browned hands. They carry the delicate elegance of a seasoned guqin player and the weathered strength of a practiced swordsman.</p>\n<p>They’re Lan Wangji’s hands. Wei Wuxian would know them anywhere. This is Lan Wangji’s body.</p>\n<p>Apparently seeing his own body before him hadn’t been sufficient for the reality of the situation to set in. <em> Now, </em>he’s beginning to fully panic.</p>\n<p>“Lan Zhan,” he says in a strangled voice, patting down his chest (broader than his own), his arms (much stronger than his own), his waist—</p>\n<p>“Stop that,” Lan Wangji says in a similar tone, and Wei Wuxian looks up at him; his fists are clenched, his lips pressed into a thin white line.</p>\n<p>“What the <em> hell </em>happened?” Wei Wuxian asks, shriller than anything befitting Lan Wangji’s low voice.</p>\n<p>“I don’t know,” Lan Wangji says tightly.</p>\n<p>“How do we fix it?”</p>\n<p>“I don’t know.” Lan Wangji closes his eyes, seeming as though he’s wading through some implacable emotion, before he says, “Wei Ying.”</p>\n<p>“What?”</p>\n<p>“Your golden core.” A slight tremor shakes the composure in Lan Wangji’s voice. He closes his eyes, as though pained. “It’s…”</p>\n<p>“You can’t tell <em> anyone,</em>” Wei Wuxian says, and Lan Wangji’s eyes fly open. “You have to swear to me, Lan Zhan, that no one can know.”</p>\n<p>“Know what?” Lan Wangji whispers. He's still shaking a little; carrying Wei Wuxian all that way must have really sapped his strength.</p>\n<p>Wei Wuxian falls silent.</p>\n<p>“Wei Ying,” Lan Wangji says, much harsher. </p>\n<p>“It’s gone,” Wei Wuxian says, and he feels a hard knot slide up his throat. He swallows around it with difficulty. “I gave it up.”</p>\n<p>Lan Wangji takes a stumbling half-step back, like he’s been dealt an unexpected blow.</p>\n<p>“Who did this,” he says then. His voice is clipped, quiet, dangerous. He’s definitely shaking now, more than before, his expression one Wei Wuxian has never seen. It’s murderous. His fists are clenched at his sides. He asks again through his teeth: “Who.” </p>\n<p>“It was my choice.\" Wei Wuxian is suddenly unable to look Lan Wangji in the eye. He knots his fingers in the grass, roping it around and around his knuckles until the circulation cuts off.</p>\n<p>“Why,” Lan Wangji says, faintly. “<em>How.</em>”</p>\n<p>“Because Jiang Cheng lost his,” Wei Wuxian says. “He’s sect leader now, and — and I had a perfectly healthy core. It wasn’t even a question.”</p>\n<p>Lan Wangji makes this quiet noise like he’s been punched. </p>\n<p>Wei Wuxian swallows the unpleasant emotion welling up in him, fast and thick. “He can’t ever know,” he says. “Lan Zhan, please, I’m begging you — please keep it between us.”</p>\n<p>“You…” Lan Wangji starts, and then is evidently unable to finish whatever he wants to say, because he cuts himself off, goes silent again. </p>\n<p>It’s too intense. Too serious. Too much. With all his effort, Wei Wuxian summons up a thin smile, dons his bravado like armor again. “Ah, Lan Zhan, it’s all fine, really. What did the son of a servant need with all that anyway? Much more fitting that Jiang Cheng has it.”</p>\n<p>“Wei Ying,” Lan Wangji whispers.</p>\n<p>“Enough, enough.” Wei Wuxian’s skin is starting to prickle; he can’t take Lan Wangji’s scolding if that’s what he’s going to do, not on this. Not about this. “Let’s not speak of it, okay? Let’s figure out what we’re going to do. I…I realize this predicament leaves you powerless now, huh? It’s okay, I can teach you some talismans on the most basic things. That way you can protect yourself, just until this situation sorts out.”</p>\n<p>Lan Wangji is still faced away from him, his chin angled in the direction of Cloud Recesses, Wei Wuxian’s crimson hair ribbon flapping in the wind behind him. Is he angry? Wei Wuxian can’t tell. He’s probably angry — a golden core transfer is certainly not orthodox. </p>\n<p>“Thank you for carrying me out of there,” Wei Wuxian begins.</p>\n<p>“Do not thank me,” Lan Wangji says at once. So, definitely angry then.</p>\n<p>Wei Wuxian goes quiet again, uncertain of what to say in the uncomfortable silence that follows. He tries for levity. </p>\n<p>“Consider yourself blessed, Lan Zhan! You’re now <em> much </em>more handsome than you were before,” he says with a forced laugh, and makes a face when he’s stonewalled with Lan Wangji’s cool silence. “Fine, fine, I know I got the better end of the deal here. Who wouldn’t want to be the beautiful, powerful Hanguang-Jun, shining Jade of Gusu and the cultivation world’s most eligible bachelor —” </p>\n<p>“Wei Ying,” Lan Wangji says again, tensely.</p>\n<p>“Okay, okay, I’ll stop teasing.” For now.</p>\n<p>He rustles himself to his feet, tripping for a moment — Lan Wangji’s robes are tighter than his, and his limbs are longer, his feet bigger. He’s surprised to feel that Lan Wangji catches his elbow, propelling them both forward.</p>\n<p>“This isn’t so bad, Lan Zhan,” he says as they start walking again. “It could even be fun. Think about it — when will this kind of thing ever happen to us again?” </p>\n<p>“No,” says Lan Wangji, and that’s all he says, but it shuts Wei Wuxian up, and they’re silent the rest of the way.</p>\n<p align=\"center\">— </p>\n<p>It’s still early afternoon when they finally get back to the Cloud Recesses. Lan Wangji immediately drags him to the <em> yashi </em>before anyone can catch sight of them, Wei Wuxian whining in protest the whole time. The rest of the hunting party must not be back yet, still out looking for the creature; the Cloud Recesses are even more silent and austere than usual.</p>\n<p>He waits around, bored and restless, while Lan Wangji tends to the head wound Wei Wuxian had managed to pick up before they’d been cursed. Wei Wuxian watches as Lan Wangji gingerly dabs at the blood with a wet cloth until it’s just a pink, shallow scratch; he watches him move around in his body for a few moments more, then finally has to look away. The whole thing is too strange and surreal, watching himself with Lan Wangji’s mannerisms and tics.</p>\n<p>Lan Wangji’s pristine white robes have been muddied with dirt and blood, but Wei Wuxian isn’t sure offering to change them will go over well, given Lan Wangji’s stormy expression as he attempts to clean his face. </p>\n<p>Still, the headband is itchy and sticking to his forehead with sweat. How does Lan Zhan <em> stand </em>this all the time —</p>\n<p>“No touching,” Lan Wangji says sharply, seeing Wei Wuxian’s intent — which, of course, means he <em> has </em>to touch it now. </p>\n<p>“Why not?” Wei Wuxian says, his lips creeping up in a mischievous grin. “I <em> am </em> Hanguang-Jun, after all.” He runs a thumb along the fine silk of the headband, smiling wider when Lan Wangji turns a dangerous shade of pink. “What’s so special about it, anyway—”</p>\n<p>“Stop,” Lan Wangji says in a low voice, a vein in his forehead starting to pulse. Wei Wuxian concedes, laughing and throwing his hands up in surrender.</p>\n<p>“Fine, fine. For you, dearest Lan Zhan, I’ll stop.”</p>\n<p>“Stand still,” Lan Wangji orders, crossing to him, and Wei Wuxian gives a mock-serious nod and straightens his shoulders as tight as they’ll go, holding his head aloft and adopting Lan Zhan’s usual deadpan.</p>\n<p>Wei Wuxian squirms in place as Lan Wangji considers him silently, his eyes trailing from head to toe. The metal of his ridiculous headpiece is digging painfully into his scalp, pinching the roots of his hair; he’s sweating like a pig under all these layers, and all the dried sweat and blood from earlier is uncomfortable; his ribs itch from the undershirt stuck to his body — </p>\n<p>“Stand still,” Lan Wangji says again, not harsh but stern, and Wei Wuxian stops fidgeting and starts sulking. “Temper your expression.”</p>\n<p>Wei Wuxian’s lip had been edging toward an instinctive pout; he schools his expression, straightening his shoulders and fixing his features in a neutral, somewhat bored look. He hoods his eyes for extra effect.</p>\n<p>Lan Wangji, with Wei Wuxian’s head, nods once in approval. “Good.”</p>\n<p>“So, what — I just have to not move at all, do nothing, and look like a corpse, and people will believe it’s you?”</p>\n<p>Lan Wangji gives him a look that Wei Wuxian thinks is supposed to be wry and doesn’t deign to respond.</p>\n<p>“What about you?” Wei Wuxian counters. “Nobody is going to believe it’s me for a second if all you do is stand there, look imperious, and say <em> Mn.</em>”</p>\n<p>Something fleets across Lan Wangji’s (Wei Wuxian’s?) face — embarrassment, maybe — before it passes just as quickly, and Lan Wangji returns to glaring at him.</p>\n<p>Wei Wuxian feels a helpless grin steal over him again. He bounces forward into Lan Wangji’s space, the becoming-Hanguang-Jun lesson forgotten at the prospect of merciless teasing.</p>\n<p>“What do you know about being shameless, Lan Zhan? Have you ever tried it?” </p>\n<p>Wei Wuxian is perhaps a little too thrilled to see a low flush start at the base of Lan Wangji’s neck. Lan Wangji’s gaze cuts away, purposefully avoiding eye contact as he practically simmers with discomfort.</p>\n<p>Wei Wuxian leans closer, and it’s <em> strange </em>to be this close to his own face and features, to see them move independently in a manner that’s nothing like he would recognize of himself.</p>\n<p>“It’s okay,” he hears himself saying, before he can stop himself. “I can teach you. I’m an expert on this topic.”</p>\n<p>Lan Wangji tenses further, his gaze fastened to some apparently fascinating speck of dust on the floor. “No need.”</p>\n<p>“Ah, Lan Zhan.” Wei Wuxian’s voice borders on a whine, which is both hilarious and surreal, hearing it in Lan Wangji’s low baritone. “Make this a little fun for me, will you? It’s the least you can do, seeing I’m stuck as the venerable Hanguang-Jun with all his boring, insufferable duties and rules for the foreseeable future.” </p>\n<p>Lan Wangji’s expression doesn’t change, but Wei Wuxian sees the bob of his throat as he swallows. </p>\n<p>“What would you…have me do,” he says quietly.</p>\n<p>Wei Wuxian counts this as a small victory, and he feels a huge grin split his face. It feels different from smiling with his own — more wooden, less natural, like Lan Wangji’s facial muscles aren’t accustomed to the expression.</p>\n<p>“Well, first off, you can drink as much as you want to now,” he says, and Lan Wangji starts to glare again. “No, really, I mean it! My body has the tolerance of a horse. Two horses, probably. You can tease Jiang Cheng as much as you want to — in fact, I’d encourage you to, to fully sell the part. Pranks are good, breaking rules is good.” He pauses. “What do you know about flirting?”</p>\n<p>Lan Wangji full-body flinches like he’s been scalded. “Ridiculous,” he snaps.</p>\n<p>“I’m just being thorough! Wei Wuxian is well-known among young cultivators as being a shameless flirt, and good at it,” Wei Wuxian insists, ignoring the way Lan Wangji’s starting to look like he swallowed something extremely sour. “You can practice on me, if you’d like. Friend to friend.”</p>\n<p>Lan Wangji takes a step back, like he’s unconsciously trying to flee.</p>\n<p>“See, that’s exactly what you <em> won’t </em>do,” Wei Wuxian says disapprovingly. “Lan Zhan, you’ve faced down vengeful spirits, fierce corpses, and a mythical, murderous turtle. What could possibly be so scary about this, eh? It’s just talking.”</p>\n<p>“I…do not know how to,” Lan Wangji says, then looks furious at himself for the admission, his brows pulling together.</p>\n<p>“Sure you do. I’ve been flirting with you for ages. Just copy what I’ve been doing.”</p>\n<p>Lan Wangji’s head snaps up. He stares at Wei Wuxian with a slapped expression. “You…”</p>\n<p>“Me…?” Wei Wuxian prompts.</p>\n<p>The blush is crawling up steadily toward Lan Wangji’s jaw. “You…flirt. With me.”</p>\n<p>Wei Wuxian arches his eyebrows. “…yes? You can’t mean that you haven’t noticed.” Subtlety is not one of his strong suits, as he’s so endlessly been informed.</p>\n<p>Lan Wangji appears to visibly struggle with digesting this information. Finally, in a quieter voice, he says, “Why.”</p>\n<p>“Because it’s fun,” Wei Wuxian says with a shrug. “You’re so easy to rile up. Your ears get all red; it’s cute.”</p>\n<p>Lan Wangji's expression shifts — if Wei Wuxian didn't know better, he'd say he looks crestfallen. Abruptly, though, the expression shifts to a scowl, too quickly for Wei Wuxian to question anything else.</p>\n<p>“Lan Zhan ah, if you keep doing that with my face, it’ll get stuck like that,” Wei Wuxian chides.</p>\n<p>“This will not work,” Lan Wangji mutters, more to himself than Wei Wuxian. “Xiongzhang will take one look and know the truth.”</p>\n<p>“You underestimate my acting abilities,” Wei Wuxian says, who thinks he’s quite good at pretending to be things he’s not, when there’s suddenly a knock at the door. Both of them jump.</p>\n<p>“A-Xian,” shijie says at the door with a warm, dimpled smile, and Wei Wuxian says brightly, “Shijie!” before remembering that’s exactly what he’s not supposed to do. </p>\n<p>Shijie’s gaze flits away from Lan Wangji to him, her brow creasing in confusion.</p>\n<p>“…Wei Ying’s shijie,” he scrambles to recover. “Wei Ying, your shijie is here.”</p>\n<p>Shijie still looks puzzled, possibly at the prospect of Hanguang-Jun speaking more words to her than he collectively ever has, but she sets the pot of soup on the ground to salute him. “Lan er-gongzi.”</p>\n<p>Wei Wuxian remembers himself; he salutes back, keeping his back stiff and his features as neutral as Lan Wangji would. “Jiang-guniang.”</p>\n<p>“A-Xian, I thought I’d find you here,” shijie says, turning back to Lan Wangji, who’s starting to look like ants are crawling up his spine. “The hunting party returned and they asked after you. They haven’t located the creature yet, but everyone said you did well today.” </p>\n<p>“He did,” Wei Wuxian says, crossing his arms proudly, and Lan Wangji shoots him a Look.</p>\n<p>“Ah…yes,” Lan Wangji says, and just the two words alone are enough to sound the alarm bells in Wei Wuxian’s head. He watches, with rising concern, as Lan Wangji attempts to make expressions with his face. “Yes, I performed…admirably. I am certain that...several maidens would be impressed.”</p>\n<p>Wei Wuxian covers his face with one hand.</p>\n<p>Shijie stares at him, faltering more uncertainly by the moment. “A-Xian, are you feeling well? You look….” She, understandably, can’t seem to find a word to describe exactly how Lan Wangji looks, as Wei Wuxian doubts anyone would.</p>\n<p>“I’m fine, shijie,” Lan Wangji says, more animated than before, and Wei Wuxian peeks out from between the slats of his fingers, surprised. “You brought pork ribs and lotus root soup?”</p>\n<p>Shijie visibly relaxes; Wei Wuxian frowns. How does Lan Wangji know his favorite soup?</p>\n<p>“I couldn’t find lotus here in the Cloud Recesses,” shijie admits, stooping to pick it up, “but I made the next best thing. I even added extra spice for my Xian-Xian.” She reaches out to affectionately tweak his nose. Wei Wuxian watches as Lan Wangji physically struggles not to reel backward at the familiar touch.</p>\n<p>“Thank…you,” he says, and Wei Wuxian has to bite his lip to keep from jumping in.</p>\n<p>Usually, he and shijie would spend another several minutes talking and teasing, catching up, eating together. But Wei Wuxian is familiar with Lan Wangji’s tolerance for spice — shijie will know immediately that something is amiss if he starts to gag on her soup. </p>\n<p>“Jiang-guniang,” he says, quieting his voice in the way that Lan Wangji does, and Lan Wangji flares a look of disgruntled surprise in his direction. “Please forgive the imposition, but I need to discuss certain matters with Wei Ying in private.”</p>\n<p>Shijie can hardly contain her surprise. She darts another glance back to her presumed brother, who is watching her with all of Lan Wangji’s characteristic, face-melting intensity. </p>\n<p>“I, ah—of course, Lan er-gongzi.” She looks at Lan Wangji again, confusion clear in her face, before she says, “I hope A-Xian will enjoy his soup, and that we’ll talk later.”</p>\n<p>Lan Wangji nods once. “Yes. Of course.”</p>\n<p>Shijie salutes Wei Wuxian one more time, and casts another searching glance at Lan Wangji, clearly trying to catch his eye to communicate something, but Lan Wangji keeps staring into his soup, his head down.</p>\n<p>The moment shijie leaves, Wei Wuxian says with a gusty sigh, “Well, that could have gone better.”</p>\n<p>Lan Wangji surprises him, then — he tentatively sniffs at the soup, then takes a sip.</p>\n<p>“Hey!” Wei Wuxian darts forward to snatch the bowl from him. “That’s for me!”</p>\n<p>Lan Wangji makes a slightly pained expression, then pauses to consider. Then he says, near-thoughtful, “Your tastebuds have evidently become numb to extreme spice, after years of regular destruction.”</p>\n<p>“Thank you,” Wei Wuxian says with a sniff, then takes a sip for himself. He immediately chokes and sucks in a breath, Lan Wangji’s bland, virgin palate rebelling at the overwhelming burn of the spices, but he’s determined to enjoy this one good thing left to him, in these circumstances, so he continues to eat, tears streaming down his cheeks.</p>\n<p>“Jiang-guniang,” Lan Wangji says after another moment. He stares at the doorway, looking uncertain. “She knew. That something was wrong.” </p>\n<p>“Ah, it’s fine. Shijie knows me better than anyone, so of course she would realize something is off,” Wei Wuxian tells him, slurping down the soup noisily in a way that would surely make any member of the GusuLan sect keel over in shame. “I don’t expect you to know exactly how to be me, after all.” </p>\n<p>Lan Wangji pauses, then after a quiet moment, begins to speak, with a lilting hesitancy. “You…have a furrow between your brows when you are focused, or cultivating.” </p>\n<p>“Hm?” Wei Wuxian pauses in his soup-slurping.</p>\n<p>“Sometimes you stick your tongue out, too, when you concentrate,” Lan Wangji says, still in that soft, reflective voice. “When you laugh, you throw your head back; sometimes you clutch your own arms, or sides, when you cannot stop. You stroke your nose twice, when you are thoughtful or irritated. Your nose crinkles when you smile with all your teeth; you have a dimple on one side. You always push your hair out of your face, like you need to see things more clearly.”</p>\n<p>Wei Wuxian stares at him, soup forgotten. That’s more words than Lan Wangji has said to him in…well, ever.</p>\n<p>“You notice a lot of things, huh?” he says after a moment, recovering from his surprise. There’s a weird flush of warmth in his belly that’s surely from the spice of the soup. </p>\n<p>“Mn,” Lan Wangji says. Then, like a punctuation mark, “I do.”</p>\n<p align=\"center\">—</p>\n<p>An hour later, Wei Wuxian is napping, sprawled out on the steps of the <em> jingshi </em> to soak in some of the late afternoon sunlight, when he’s rudely awoken by someone hitting his knee.</p>\n<p>He jolts into consciousness. “Aiyo!”</p>\n<p>“Sit up straight,” Lan Wangji orders, and Wei Wuxian takes a few moments to blink, dizzy and disoriented, at his own angry face swimming before him. “If anyone were to see…”</p>\n<p>“See what?” Wei Wuxian says petulantly, then looks down at himself. Lan Wangji’s body is draped over the steps, his white-clad legs akimbo and spread, one knee cocked up on a different step than the other, his head resting on one of his hands.</p>\n<p>“You must meditate at least three times a day to maintain core and <em> yang </em> energy,” Lan Wangji instructs. “My body, it’s…”</p>\n<p>“Built?” Wei Wuxian suggests, running an interested hand over the sharp, lean cut of Lan Wangji’s ribs, his hips. “I must say I’m impressed, Hanguang-Jun. No one would guess at all this muscle under all those stuffy, needless layers.”</p>\n<p>“Stop at once,” Lan Wangji grits out, and Wei Wuxian bursts into a loud, delighted peal of laughter to picture the image that’s eliciting the horror mirrored back on his own face — the esteemed, pearl-white Hanguang-Jun, sprawled out in overly formal attire, still muddied and bloodied, feeling himself up in broad daylight. </p>\n<p>“I’m sorry, I’m sorry,” Wei Wuxian chuckles, clambering to his feet. “But learn to take a compliment, will you? You have nothing to be ashamed of. In fact, I —”</p>\n<p>“Enough.” Lan Wangji is turned profile to him now, staring off with a fixed, steely expression, a muscle in his jaw working. His ears are red. Wei Wuxian’s never seen his own body blush before, obviously, so it interests him. “This is an unfortunate enough predicament without you…you…”</p>\n<p>“Aren’t you a <em> little </em>curious?” Wei Wuxian teases, drawing closer. Lan Wangji takes a responding step backward. “It isn’t every day you get to wake up in a body that’s not your own. It’s okay to have questions.”</p>\n<p>The second the words leave his mouth, Wei Wuxian has an unbidden image of Lan Wangji touching Wei Wuxian’s own body, running his hands over it the way he himself just had — undressing himself, staring in the mirror and — his mouth immediately dries out, heat buzzing through his head.</p>\n<p>Lan Wangji’s lips are pinched with tension, his shoulders rigid at Wei Wuxian’s implications. His fists are so tight that his knuckles whiten.</p>\n<p>“No,” he hisses, and that’s all he says.</p>\n<p>“Okay, okay,” Wei Wuxian says, putting his hands up in concession. He’s admittedly a little unbalanced by the very thought that’s perhaps troubling Lan Wangji so much. “I promise I’ll behave. I won’t take advantage of you, Lan Zhan, I swear. I wouldn’t do that.”</p>\n<p>His tone must be severe enough because Lan Wangji relaxes an increment, but not completely.</p>\n<p>“But you do have a nice body,” he can’t resist adding, all in one breath, and Lan Wangji says, near-spluttering, “You —” then nothing else.</p>\n<p>“Here,” Wei Wuxian says, “come here,” and turns Lan Wangji by the shoulder. “I haven’t gotten to see my own face up close yet.” He grabs Lan Wangji with one hand by the jaw as Lan Wangji startles backwards, and intensely peruses his own features as Lan Wangji struggles in his grip — but for once, he has the upper hand on physical strength and height, thanks to Lan Wangji’s stature.</p>\n<p>“Hmm,” he says, examining each feature while Lan Wangji freezes in his grip, mute with what Wei Wuxian can only assume is fury. “All of my features are backwards than how I usually see them. Ah, you know, I don’t think I’m as handsome as people say I am. At least, not anywhere as handsome as Hanguang-Jun.”</p>\n<p>“Hey!” calls out a harsh, familiar voice, and both of them go very still. “Lan Wangji, what the hell do you think you’re doing?!”</p>\n<p>Realizing how the situation must appear to an outsider, Wei Wuxian lets go of Lan Wangji at once. They both turn.</p>\n<p>“Jiang Ch — Jiang-zongzhu,” Wei Wuxian says hastily, with not even a scrap of Lan Wangji’s usual composure. He salutes.</p>\n<p>“What the hell were you doing?” Jiang Cheng demands, stalking over to them and casting a frank once-over to Lan Wangji. “Wei Wuxian, is he bothering you?”</p>\n<p>“Yes,” Lan Wangji says, honestly, and Wei Wuxian makes an affronted noise. “No. We were talking.”</p>\n<p>“That looked very touchy for talking,” Jiang Cheng says, and crosses his arms with a suspicious scowl to Wei Wuxian. “I don’t care if you’re a precious Jade of Gusu, Hanguang-Jun, if you lay a hand on my brother—”</p>\n<p>“That’s enough, Jiang Cheng. You look like a puffed-up grape when you make threats,” Wei Wuxian says, and really, he has fraternal reflex to blame more for that than anything, but Lan Wangji makes a hissing sound through his teeth and Jiang Cheng’s jaw drops open in comical shock.</p>\n<p>“What — what did you just say to me??” he splutters, uncoiling his hand at once. Zidian crackles with a flash of electric purple. “Just what are you trying to start, Lan Wangji?”</p>\n<p>“Wei Ying,” Lan Wangji says with Wei Wuxian’s mouth, and Jiang Cheng looks at him so fast his neck nearly cracks.</p>\n<p>“What the hell is going on?” he shouts, and Wei Wuxian knows very well that firstly, Jiang Cheng is going to start whipping people, probably, until he gets a coherent answer, and secondly, it’s going to make a public scene.</p>\n<p>“Jiang Cheng!” he says, at the same moment that Lan Wangji says, firmly, “Jiang Wanyin, control yourself.”</p>\n<p>Jiang Cheng’s head whips back and forth between them like he’s following a particularly zippy and irritating fly.</p>\n<p>“Don’t call me Jiang Cheng!” he blusters, pointing an accusing finger at Wei Wuxian. “Lan Wangji, where’s your sense of propriety?”</p>\n<p>“Where’s yours?” Wei Wuxian returns. “Jiang Cheng, Jiang Wanyin — put Zidian away and let us explain, please?”</p>\n<p>Jiang Cheng hesitates, clearly torn, before his confusion wins out, and then Zidian recoils, curling around his finger into its resting serpentine shape. “Talk. Now.”</p>\n<p>“So, the night hunt,” Wei Wuxian begins, and Jiang Cheng turns to stare at him, visibly baffled to hear Lan Wangji speaking so informally — or at all, for that matter. “There was a…small setback. Lan Zhan and I, we separated from the group because we had a lead — don’t look at me like that, I would have brought you with us if I didn’t know you would react like this — and the creature lured us into a cave; things got very loud and very bright all of a sudden, and when we woke up, everything was dark and the creature had vanished, and —”</p>\n<p>“I am in Wei Ying’s body, he is in mine,” Lan Wangji says, more succinctly than anything Wei Wuxian’s continued rambling would offer.</p>\n<p>Jiang Cheng gapes at them for another moment before he turns to Wei Wuxian, wearing Lan Wangji’s face, and says, “You deserve this.”</p>\n<p>“Hey!” Wei Wuxian protests. “Well, I mean. I’m not complaining too much. Look how cute he is, no?” He pinches Lan Wangji’s dirtied sleeve and then winks at Lan Wangji, who’s glowering at him and flushing to his roots. </p>\n<p>“Only you could be so shameless wearing the skin of <em> Hanguang-Jun,</em>” Jiang Cheng says through his teeth. “This is bad. Very bad. You do realize that the rest of the sect leaders are gathering here in three days’ time? If that display just now was the best you’ve got, they’ll immediately know something is wrong. The GusuLan sect will have your head for defiling their most precious disciple with your demonic tricks.”</p>\n<p>“Hey,” Wei Wuxian says again, much more weakly than before, because no, he hadn’t considered that possibility, and yes, Jiang Cheng is absolutely right.</p>\n<p>“Wei Ying didn’t do anything wrong,” Lan Wangji cuts in, to Wei Wuxian’s relief. “It was an honest mistake. I will see if the library can provide answers for how to switch back.”</p>\n<p>Wei Wuxian groans at that and stretches. Lan Wangji’s body is much suppler than his, given all his rigorous training and the abundant golden core energy flowing through him. When he gets back to his own body, he won’t have that anymore.</p>\n<p>Wei Wuxian viciously shoves the last thought down, and the sharp ache that accompanies it.</p>\n<p>“You can go to the boring library,” Wei Wuxian tells Lan Wangji. “I was thinking of going to Cold Spring.”</p>\n<p>“No,” Lan Wangji says, in such a frightful voice that it brings Wei Wuxian up short.</p>\n<p>“What? I’m not trying to be inappropriate. You told me to meditate, and you’re right — Cold Spring is the best place to do it.”</p>\n<p>“No,” Lan Wangji repeats, and Wei Wuxian sulks at him.</p>\n<p>“Can you stop thinking about getting undressed for two seconds?” Jiang Cheng asks Wei Wuxian, exasperated. “You’re an embarrassment.” </p>\n<p>“I wasn’t! Thinking about that, I mean—” Was he? He certainly is now. Wei Wuxian is shocked to find his ears are hot. </p>\n<p>Hmm. Maybe not so shameless, after all.</p>\n<p>Lan Wangji, without so much as a by-your-leave, turns and stalks off toward the library, his black-clad shoulders a stiff line and his arms clasped behind his back. </p>\n<p>“Hey, Lan Zhan!” Wei Wuxian calls after him, disappointed, then bites out, <em> “Ow,</em>” when Jiang Cheng elbows him hard in the ribs.</p>\n<p>“What’s wrong with you? Can’t you leave him alone?” Jiang Cheng demands. “This situation is humiliating enough for him without your torturing him.”</p>\n<p>“I’m not torturing him,” Wei Wuxian protests, wincing and rubbing the tender spot on his ribs.</p>\n<p>Jiang Cheng huffs. “Imagine being trapped in the body of the person you hate the most. No wonder he can’t stand the sight of you, parading his body around and acting like that!”</p>\n<p>Wei Wuxian stares after Lan Wangji’s receding form, a tightness lodging in his throat. He knows he’s irritating, usually deliberately so, but does Lan Wangji still really dislike him so much? Even after everything?</p>\n<p>“—time to act like a fool about your giant crush on Lan Wangji,” Wei Wuxian tunes back in to Jiang Cheng saying. “Have a little decency, for my sake if not your own.”</p>\n<p>“I don’t — I don’t have a —” Wei Wuxian stammers, unbalanced by this unexpected affront, and he grapples for words for the next few seconds while Jiang Cheng watches, his eyebrows creeping closer and closer to his hairline. Eventually, all Wei Wuxian can summon is, “Jiang Cheng, what are you saying?” </p>\n<p>Jiang Cheng rolls his eyes upward as though seeking answers from the heavens. “Crush, infatuation, whatever it is. Just leave him alone until we get this sorted out.”</p>\n<p>“I don’t like him!” Wei Wuxian protests, still stuck on this heinous accusation. “I mean, I like him just fine, but a <em> crush, </em> I mean, he’s—he’s so boring, and stuffy, and <em> mean.</em>”</p>\n<p>“You like mean,” Jiang Cheng points out.</p>\n<p>Wei Wuxian has never felt so attacked in his short, painful life. </p>\n<p>“Believe me, I don’t pretend to understand,” Jiang Cheng says, with a properly nauseated expression. “But we’re wasting time. Let’s follow him to the library and look for answers.”</p>\n<p>They walk together in uncharacteristic silence, and surely an odd sight they’d make to any Lan disciples walking by—the impervious, tall, reserved, dove-white Hanguang-Jun, still dirtied and bloodied from today’s night hunt, side by side with the scowling and colorful Sandu Shengshou.</p>\n<p>Wei Wuxian can’t shake Jiang Cheng’s words, even though they’d clearly only been meant to nettle him. They shouldn’t — Jiang Cheng has historically said far, far worse.</p>\n<p>Wei Wuxian had, admittedly, been somewhat obsessed with Lan Zhan in his early days at Cloud Recesses. Fine. But it was only because he was entertained and fascinated by Lan Wangji’s clear, unadorned hatred of him. As the weeks had gone on, it had turned into a fun challenge, or a particularly frustrating riddle, to try to get Lan Wangji to like him, to make him stammer and blush, to watch his gold eyes spark like molten metal when his temper flared. </p>\n<p>Wei Wuxian has long made a sport of being annoying, but so far, he’s charmed his way out of every instance where exasperation toed the line of ill regard. There hasn’t been anyone, as far as he’s known, who has genuinely disliked him in spite of his best efforts. Except for Lan Wangji. (Well, and Madam Yu, but she doesn’t count.) </p>\n<p>It had been funny, at first, and then a private thrill to attempt to charm him, and Lan Wangji certainly isn’t hard to look at. Wei Wuxian has always been unabashedly hedonistic, admiring beautiful things and beautiful people in all forms, and there is no finer specimen in the cultivation world than the jade-edged Hanguang-Jun. </p>\n<p>Who could blame him if he <em> is </em> a little infatuated, after all?</p>\n<p>But Jiang Cheng is right. To Lan Wangji, Wei Wuxian knows he’s brash, loud, crass, intolerable to his very idea of existence. Over time, the more experiences they’d shared together, he’d thought that maybe…<em>maybe </em> he hadn’t imagined the way he’d caught Lan Wangji looking at him when he thought Wei Wuxian wasn’t paying attention. But likely, he realizes, it had been wishful thinking, because he wants Lan Wangji to like him. He really does.</p>\n<p>He wants Lan Wangji to <em> really </em>like him.</p>\n<p>“Are you listening to me, Wei Wuxian?” Jiang Cheng snaps, and Wei Wuxian comes back to himself, blinking. They’re in front of the Library Pavilion now, and Jiang Cheng is scowling at him.</p>\n<p>“What?” he says, succinctly.</p>\n<p>“I said, once we get in there, leave Lan Wangji alone,” Jiang Cheng says, and Wei Wuxian sighs and nods.</p>\n<p>He will, he’ll be nice. He’ll be good. He’ll try.</p>\n<p>Lan Wangji does not go to the Library Pavilion, as he said he would. Instead, once he gets there, he heads right back to the <em>jingshi, </em>the long way around, to clear his head. He’s far too scrambled at the moment to sit in the heavy, enfolding silence of the library, to focus his energy for hours on end on the neat lines of texts and scrolls.</p>\n<p>For a moment, once he steps into the <em> jingshi, </em>Lan Wangji just breathes, closes his eyes, and tries to allow the familiar aromas of incense and sandalwood to calm his mind. </p>\n<p>Then Lan Wangji stares down at his hands — Wei Ying’s hands. He has always thought them beautiful in their own way, somewhat smaller and darker-skinned than his own, rough with calluses from sword-fighting and archery and climbing trees and—whatever else Wei Ying had done in Yunmeng. Nonetheless graceful, and nimble, and sure.</p>\n<p>Wei Ying talks a lot — almost anyone, other than Lan Wangji, would say too much — but Lan Wangji is always listening, hoarding pieces of information like a crow with pieces of scrap metal. He’s hungry to know every detail of Wei Ying’s life, his passions, his interests, what makes him laugh, what makes him upset or sad. At first, his dedicated interest in this matter had confused and infuriated him, but he had long ago given up his resistance to liking Wei Ying, helplessly and adoringly. </p>\n<p>Now that he’s alone with Wei Ying’s body, his thoughts are deafening, too loud for his head. Far, far too often than he would ever allow himself to admit, he had imagined, dreamed about what Wei Ying would look like, with the layers all gone, but <em> this </em>— this is not what he envisioned. This is never something he would have asked for, or desired for either of them. It feels horrifically invasive, and shameful, and —</p>\n<p>Lan Wangji locates the single, floor-length mirror in the room and for a moment, just stares, his breath catching. </p>\n<p>He can never let himself look at Wei Ying for too long, so he can never drink his fill of Wei Ying’s features the way that he’d like to— he stores flashes of Wei Ying’s expressions and features away, guards them jealously to turn over later in the most private corners of his thoughts. He isn’t sure what to do now that he’s allowed to....look, for as long as he wants to.</p>\n<p>Lan Wangji sits, his legs crossed, and leans closer to the bronze glass.</p>\n<p>Wei Ying is handsome, of course — unmistakably beautiful, no matter what self-deprecating, laughing remarks he throws away. The most beautiful person Lan Wangji has met in his life — as he’d known, unfortunately and immediately, from their first moonlit fight on the rooftops of Cloud Recesses. It had angered him, flustered him, and…</p>\n<p>He raises a shaking hand to Wei Ying’s cheek, catches one brush of soft, warm skin before he yanks away as though he’s been burned.</p>\n<p><em> No.</em> </p>\n<p>He isn’t allowed this. It’s not the same as if — as if he himself were to touch Wei Ying, like this. Would he be allowed to? Would Wei Ying let him? </p>\n<p>Still, he can’t resist drawing one finger, feather-light, over the bow shape of Wei Ying’s lips, so often curled up in a coy or delighted smile. He tries to smile to replicate the expression, but it feels wrong, lifeless, hollow. He suddenly, fiercely misses Wei Ying in his own body; Lan Wangji is a trespasser here, taking up space somewhere where he doesn’t belong.</p>\n<p>And…</p>\n<p>He drops one hand to cup Wei Ying’s sternum, feeling the emptiness there like a dark void. Wei Ying’s golden core, surgically and cruelly hacked out — with a knife? With a scalpel, a hand? There's nothing left behind except a carved-out space that Lan Wangji can feel like a drumbeat.</p>\n<p>He feels sick. He thinks, for one sure moment, that he’s going to be physically ill, when he hears a single knock and a clatter of feet at the door, and — it’s Wei Ying, awkward and clumsy in his too-big body, who stops and stares in confusion at the sight of Lan Wangji on the ground.</p>\n<p>Lan Wangji jerks back from the mirror, his stomach still twisting.</p>\n<p>Wei Ying keeps staring, and asks, “Lan Zhan, are you okay? I couldn’t find you in the library, so I thought that’d you…”</p>\n<p>It takes a blink for Lan Wangji to realize there are tears in his eyes, and that’s why Wei Ying is looking at him with such perplexed concern. He stands abruptly, almost stumbling as Wei Ying’s feet get tangled together beneath him.</p>\n<p>“Yes,” he says. “What do you need?”</p>\n<p>Wei Ying is still staring at him, through Lan Wangji’s own features, with an unbearably soft expression, and Lan Wangji feels that sick, tilted lurch again like the ground dropping out under his feet. Is this what he looks like, when he looks at Wei Ying? Is it so obvious?</p>\n<p>“Here, sit,” Wei Ying says, taking Lan Wangji by the wrists and leading him to sit on the bed. “Listen. Lan Zhan. I know this whole thing, with — with the soul-switch, it’s upsetting. And believe me, I know my body is the last one on earth you’d want to be inside of.” </p>\n<p>Lan Wangji chokes, then passes it off as a cough.</p>\n<p>“I know I haven’t made this easy,” Wei Ying continues, looking so earnestly remorseful that Lan Wangji’s heart gives a pathetic little kick. “But I promise, it’s not forever. We’re going to find a way back, especially with Jiang Cheng helping us now.” He frowns, thinking seriously on something for a moment, before he adds, “I’m sorry it had to be me.”</p>\n<p>Lan Wangji is a step behind, but doesn’t say anything, waiting for Wei Ying to clarify.</p>\n<p>Wei Ying correctly interprets the silence and clarifies, “I’m sorry I was with you for the curse, when it happened. I’m sure you’d prefer to be stuck in this with anyone else, and I don’t blame you.” </p>\n<p>He scratches the back of his head, looking sort of forlorn and so unlike himself that Lan Wangji fights the bizarre urge to place a hand on his own shoulder. </p>\n<p>Still, he cannot allow Wei Ying to get this so wrong, as he does with so many other things between them.</p>\n<p>“No,” he says, firm. </p>\n<p>“No?” Wei Ying echoes.</p>\n<p>“You are wrong,” Lan Wangji says quietly. “Wei Ying is the only person that would make this tolerable.”</p>\n<p>Wei Ying’s eyes widen, and then brighten, and then he smiles, an expression so unfamiliar on his own face and so very <em> Wei Ying </em> that Lan Wangji stares. </p>\n<p>“Well, good, because I feel the same way,” Wei Ying says, leaning one shoulder familiarly into Lan Wangji’s. Lan Wangji’s toes curl in his shoes. “Can you even <em>imagine </em>if I had swapped with Jiang Cheng? Or <em>Jin Zixuan</em>? I would do everyone a favor and throw myself off a cliff.” </p>\n<p>“Wei Ying,” Lan Wangji is horrified into saying.</p>\n<p>“Kidding, kidding,” Wei Ying says, backtracking with a chuckle. “Aiya, so serious, Lan Zhan. I’m almost never serious, you know?”</p>\n<p>“I do,” Lan Wangji mutters, and Wei Ying laughs openly and throws an elbow into his ribs. </p>\n<p>“Okay, okay. I know you’re going to be angry with me for this suggestion, but really, Lan Zhan, look at my clothes.” </p>\n<p>Lan Wangji does look. The usually-spotless white is faded with dust, streaked here and there with dried blood and mud. It’s a rare occurrence, maybe nonexistent, that anyone should see Hanguang-Jun in such a state, and of course, in any other situation he would change clothes the moment he returned from the hunt, but… </p>\n<p>He swallows with discomfort. </p>\n<p>“And yours,” Wei Ying says, tugging at his black lapel. “I know you have a strong sense of modesty, but something must be done.”</p>\n<p>Wei Ying is right — of course he is. And yet Lan Wangji still feels a crimson flush starting at the base of his throat, spreading up like wildfire.</p>\n<p>“I know you Lans are — ah, private folk,” Wei Ying says, his eyes tracking the vertical progress of the blush. “But bodies are just bodies. I promise I’ll be as respectful as possible.” </p>\n<p>Lan Wangji wants to tell him it’s fine, that he trusts him — that he’s right — but of course, he can’t say any of that. He doesn’t trust himself to say anything at all.</p>\n<p>“How’s this — I can change clothes here, if you like,” Wei Ying suggests. “We’re already in the <em> jingshi, </em>and that way you can look at me, and I’ll keep my eyes on you.”</p>\n<p>That does make Lan Wangji feel somewhat better. He relaxes and gives a slight nod. Wei Ying smiles in response.</p>\n<p>“Thank heavens,” Wei Ying groans, rolling away from him and stretching his arms above his head. “I thought I was going to die if I stayed in these any longer. Okay, help me. I don’t know how to get any of this off.”</p>\n<p>Lan Wangji’s pulse crashes in his throat, in his ears, but he rises without a word and helps Wei Ying with the outer two layers with practiced ease, folding each one neatly on the bed.</p>\n<p>“Oh, this is strange,” Wei Ying says, with a faint laugh, “looking at my own face while you do this.”</p>\n<p>Lan Wangji resolutely ignores the itchy heat in his ears and helps untangle the other layer until it’s just the inner robe left, and his pants. He’s never seen his own body from the outside, and of course doesn’t think much of it either way, but he does wonder what Wei Ying truly thinks of it — what it would look like to him.</p>\n<p>“Do you want to take things from here?” Wei Ying asks, staring at him uncertainly. </p>\n<p>“Leave the pants on,” Lan Wangji says, and swallows hard. “I’ll get clean clothes for the rest.”</p>\n<p>“Lan Zhan, I’m going to have to bathe at some point,” Wei Ying calls after him, as if Lan Wangji needs any reminder of that excruciating fact. “Hanguang-Jun is well-known for his fresh, aromatic musk. You can’t have him walking around looking and smelling like this.”</p>\n<p>“Enough,” Lan Wangji says, hearing the laugh in Wei Ying’s voice and feeling ridiculously flustered.</p>\n<p>“It’s okay, Lan Zhan. I understand,” Wei Ying says, more thoughtful than before. “Being in another man’s body repulses you, of course.”</p>\n<p>That is certainly not the problem. Lan Wangji suddenly wonders, with a flash of dread, <em> Is that how Wei Ying feels about it? </em></p>\n<p>“But I swear, my body’s not that bad! Other than, ah, the lack of spiritual power. It’s probably not even that much different than yours.” </p>\n<p>Lan Wangji wishes he would just stop talking. He returns and drops the fresh robes at his feet, glaring up at Wei Ying — rather than glaring down, as is usual.</p>\n<p>Wei Ying smiles at him, sunny and beatific. He pitches his voice low, gazing at him from underneath dark lashes. “Thank you, Wei Ying.”</p>\n<p>Lan Wangji can’t help it — he scoffs. It’s not quite a laugh, but Wei Ying perks up regardless.</p>\n<p>“Now you,” he says, then begins quickly and effortlessly stripping Lan Wangji before he can blink.</p>\n<p>Lan Wangji makes an instinctive noise of protest and rears back, but Wei Ying frowns at him and says, “It’s only fair,” so Lan Wangji just stands there, numbly, dumbly, as Wei Ying uses Lan Wangji’s own hands, fingers, arms to divest him of his clothes.</p>\n<p>“My body can just borrow some of your training robes while I clean my usual clothes, if that’s alright,” Wei Ying is chattering, the cadence of which sounds strange in Lan Wangji’s voice. “I’m sure you’ve got them stored away in the back of your closet somewhere.” </p>\n<p>Lan Wangji feels cool air brush against his chest as Wei Ying pushes off his red inner robe, and he closes his eyes. The heat is back, everywhere, making him feel flushed all over. He will not look. </p>\n<p>“Lan Zhan, it’s fine,” Wei Ying says, sounding amused. “I appreciate your chivalry, I really do, but I have nothing to hide.”</p>\n<p>When Lan Wangji opens his eyes, Wei Ying is similarly bare before him. He maintains determined eye contact with Lan Wangji, as if to prove true on his word.</p>\n<p>“See? Not so bad at all,” Wei Ying says, gentler now, and Lan Wangji looks away.</p>\n<p>“We can bathe in Cold Spring later,” Lan Wangji tells the wall. “That way we can keep undergarments on.”</p>\n<p>“Whatever makes you comfortable,” Wei Ying says, and then he pauses, and Lan Wangji jumps when he feels the tentative brush of fingers across his abdomen. On reflex, he catches Wei Ying’s hand to stop him, and then the two are caught as though in amber, staring at each other.</p>\n<p>“Sorry,” Wei Ying says, swallowing. “It’s just, aha — it’s my body, and from the outside, I hadn’t seen…”</p>\n<p>Lan Wangji can’t help it; he looks down, where his fingers are still wrapped around Wei Ying’s. A large, pink scar blooms below Wei Ying's navel, the skin raised and puckered, and it still looks somewhat new, as though it recently finished healing.</p>\n<p>Lan Wangji stumbles at the sight of it, his head spinning with imagery of what it means, of what Wei Ying had endured to get it.</p>\n<p>“Lan Zhan,” Wei Ying says, steadying him with large, cool hands. “Ahaha. I know I have a nice body, but fainting is a little dramatic, don’t you think?” </p>\n<p>Like a man possessed, Lan Wangji forgets his promise to himself: He drops his hand to the scar and traces two gentle fingers over the shape of it. As though his touch could absorb the pain, the memory of it into himself.</p>\n<p>He hears Wei Ying’s sucked-in, choked breath as though from far away.</p>\n<p>“I’m sorry,” Lan Wangji says, his hand jerking away as though burned. He closes his eyes, unable to look Wei Ying in the face. “I’m sorry.” </p>\n<p>“Hey, no apologizing,” Wei Ying says. His voice sounds fainter than before. “I told you it’s okay to be curious. It’s ugly, isn’t it?”</p>\n<p>Lan Wangji chokes on his words again. He wants to say that no part of Wei Ying could ever be ugly, never, never — but he doesn’t, just breathes. He could drown in unspoken words, in the sea of everything he hasn’t said. </p>\n<p>“You know, Hanguang-Jun, you’re surprisingly sweet,” Wei Ying says, his eyes sliding over Lan Wangji’s face thoughtfully. “Such a gentleman, as they all say.”</p>\n<p>Lan Wangji shoots him a half-hearted glare, certain he’s being teased again, but Wei Ying just smiles back at him, his expression open and bemused. </p>\n<p>“You’re always doing that, surprising me,” Wei Ying says, and then his smile falters into a serious line, and he stares at Lan Wangji, more intently than before, like he’s trying to parse something out from him.</p>\n<p>Lan Wangji takes a step back, putting more space between them. Wei Ying’s expression shutters at once, and he picks up the clean inner robe from the floor.</p>\n<p>“Only three layers, Lan Zhan? Won’t people think you’re a tease?” Wei Ying says, and Lan Wangji ignores him, just focuses on putting on his own clothes while trying to see as little of Wei Ying’s body as possible. Trying to burn the image of the scar from his mind.</p>\n<p>“It’s been a long day,” Wei Ying continues once he’s fully dressed. He adjusts his forehead ribbon with a casualness that makes something in Lan Wangji lurch with both horror and something else that he can’t decipher. It might be longing, which he’s discovered takes infinitely painful forms. “I’d say it’s time for a drink, wouldn’t you, Lan Zhan?”</p>\n<p>“No,” Lan Wangji replies at once, and he tries not to envision the horrors of a rowdy Wei Ying getting drunk in his body.</p>\n<p>“Lan <em> Zhaaaan,</em>” Wei Ying whines, crowding closer to him and taking both of his wrists. He starts to lightly swing their hands from side to side. “Lan Wangji, Hanguang-Jun, Ji-xiong, Lan er-gege—”</p>\n<p>“Stop that,” Lan Wangji says quietly. He deflects the warmth of Wei Ying’s teasing, probing gaze, and focuses on fixing one of his sleeves.</p>\n<p>“Surely you won’t deny me this?” Wei Ying continues, wheedling and relentless. “I still have some Emperor’s Smile back in my room. Think of how traumatic today has been for both of us. Let me have a little happiness, yeah? There’s nothing else to do in the Cloud Recesses. I’ll stay right here in the <em> jingshi </em>with you; no one will see Hanguang-Jun getting drunk, I swear on the Heavens and Earth.”</p>\n<p>Lan Wangji has quickly come to discover that he can’t resist Wei Ying a single thing, especially where his happiness is involved, and the revelation has been somewhat unfortunate. It does not bode well for him, given the force of Wei Ying’s will could rival that of a noonday sun’s.</p>\n<p>He sighs, and looks up into Wei Ying’s pleading eyes, the gold there lighter and warmer than it’s surely ever been.</p>\n<p>“Fine,” he says.</p>\n<p>Wei Ying brightens even further, the wattage on his smile doubling. Lan Wangji can’t look at it directly, even on another’s face.</p>\n<p>“Wow, wow,” Wei Ying says musingly, still grinning. “I really didn’t expect you to say yes! You’ve changed from the boy I met on the rooftop, Lan Zhan. I like the new and improved you.”</p>\n<p>Lan Wangji tries to ignore the pleased warmth that gutters to life in him at these words, like a candle flaring up.</p>\n<p>“Don’t move,” Wei Ying says, squeezing his wrists before letting them go. “I’ll be right back.”  </p>\n<p>Lan Wangji tries to say, “No running,” but Wei Ying is out the door before the words have left his mouth. He sighs, and stares uncertainly after him. Although they had managed to keep the secret from Jiang Yanli, it’s only a matter of time before everyone else knows the truth, including his brother. The ruse is seemingly too impossible for both of them to keep up.</p>\n<p>Lan Wangji closes his eyes, feeling weary to the bone. He sits on his bed, soaking in the quiet, the gentle rustle of the trees outside his window. Wei Ying will be back soon with alcohol, which Lan Wangji, at one point not so long ago, never would have permitted. Wei Ying will cozy up into his space, and touch him with casual, teasing hands, and Lan Wangji will burn, as he has for what feels like a lifetime.</p>\n<p>Heavens help him, he thinks.</p>\n<p>When Wei Ying returns, he finds Lan Wangji upside down, his heels against the <em> jingshi’s </em>wall and his arms shaking with strain beneath him.</p>\n<p>Lan Wangji sees Wei Ying pause and set the two jars of Emperor’s Smile on the table, then he ducks his head upside down to grin at him. “Lan Zhan. What are you doing?”</p>\n<p>It’s pretty self-evident what Lan Wangji is doing, so he doesn’t bother to answer.</p>\n<p>“Ah, Lan Zhan, I think you’ll find my body lacks the upper strength of yours,” Wei Ying says with a chuckle, sitting cross-legged at the table and giving him a delighted look.</p>\n<p>“...Mn,” Lan Wangji concedes, because it is true.</p>\n<p>“Although my core strength can’t be beat. <em> Ha</em>!”</p>\n<p>Lan Wangji does his best from his current position to scowl unappreciatively at him.</p>\n<p>“Too soon for core jokes, I see. That is noted. Why are you doing handstands, Hanguang-Jun?”</p>\n<p>“Focus,” Lan Wangji says through gritted teeth. He can feel all of the blood in his face pounding from the effort of keeping himself upright. “And restraint.”</p>\n<p>“Neither of which I have,” Wei Ying points out. He tilts his head, his eyes gleaming with mischief. “Is there someone specific who has tested your focus and restraint, Hanguang-Jun?”</p>\n<p>“Ridiculous,” Lan Wangji retorts on reflex, but it comes out sounding very wheezy and weak.</p>\n<p>Wei Ying laughs at him, clutching his sides as he does so. Lan Wangji finally gives in, kicking off from one of his heels so that he’s upright again. Wei Ying politely applauds him.</p>\n<p>“Maybe if you stay in my body longer, I can be as fit as you are,” Wei Ying teases. “You’re welcome to wear it out all you want, you know.”</p>\n<p>Lan Wangji has no reply to that, so he sits down across from Wei Ying at the table in lieu of a response.</p>\n<p>Wei Ying nudges one jar of the Emperor’s Smile at him across the table. “For you.”</p>\n<p>Lan Wangji says nothing in reply, but nudges it back in a clear rebuttal.</p>\n<p>“Fine. More for me, then.”</p>\n<p>“Wei Ying,” Lan Wangji says, and Wei Ying pauses just as he leans his head back to take a swig. “Be careful.”</p>\n<p>“I’m always careful,” he answers with a wink. He starts to earnestly gulp the liquor with such a fixed eagerness that for some reason Lan Wangji looks away, feeling hot and embarrassed. </p>\n<p>“I don’t understand why you react to this so strongly,” Wei Ying says after he finishes the first bottle, reaching over to grab the second. “I don’t even f—” His shoulders suddenly sag, his eyelids drooping. “Oh.”</p>\n<p>“Wei Ying,” Lan Wangji says.</p>\n<p>“Mmmmm. I’m — <em> tired</em>, Lan Zhan,” Wei Ying murmurs, sounding confused, and then his head lolls, and he’s out.</p>\n<p>Lan Wangji stares in disbelief for another moment — never, in their entire relationship, has he witnessed Wei Ying rendered so obsolete by liquor — before he sighs, crossing to him to help him lay down. It will only be a matter of time before he wakes.</p>\n<p>In the meantime, Lan Wangji practices the guqin. Without spiritual power, the notes ring quite hollow, and they’ll have no effect on Wei Ying either way, but his fingers are true to the melody, and it sounds pleasant regardless. After only a few minutes, his fingertips ache against the strings; Wei Ying has none of the calluses that he’s built over thousands of hours of practice, over the years.</p>\n<p>Eventually, after about two joss sticks’ time, Wei Ying starts to stir, mumbling to himself and clutching his head. Lan Wangji rests his palms on the strings, then crosses back to join him.</p>\n<p>Lan Wangji helps him into a sitting position, his hand lingering in the crook of his elbow. “How do you feel?”</p>\n<p>“I feel…” Wei Ying pauses and frowns, as though searching hard for a word, before he settles on, “<em>Very </em>drunk.”</p>\n<p>Lan Wangji huffs a quiet breath.</p>\n<p>Wei Ying casts about for a moment, then latches on to Lan Wangji’s arm. “Lan Zhan, how can someone with your body and your constitution be such a lightweight? I don’t understand it.”</p>\n<p>“Xiongzhang is the same way,” Lan Wangji replies, trying to conceal the amusement in his voice. “You were warned.”</p>\n<p>“I was,” Wei Ying says. “I feel like it’s — like it’s hitting more by the second, <em> oh.</em>”</p>\n<p>“Mn,” Lan Wangji says, and suppresses the fond tilt of his mouth.</p>\n<p>“Are you laughing at me?” Wei Ying peers at him suspiciously through red-tinged eyes. “That’s your laughing, <em> Wei-Ying-is-so-stupid </em>‘mn.’”</p>\n<p>“A little,” Lan Wangji admits, and Wei Ying’s eyes widen in surprise, and then delight.</p>\n<p>“Fine, I deserve it,” he says, and as though encouraged by the way Lan Wangji is looking at him, he scoots closer to Lan Wangji’s side so they’re shoulder to shoulder. “Laugh at me, Hanguang-Jun, I want to hear you laugh.”</p>\n<p>Lan Wangji presses his lips together against another small smile. He does not laugh, because he never does, but Wei Ying’s face grows softer at the expression, his eyes widening.</p>\n<p>Lan Wangji lets go of his arm, and sits across from him, cross-legged at the table, and sets out a cup for himself, and one with water for Wei Ying.</p>\n<p>Wei Ying hazily watches him for a moment before he speaks.</p>\n<p>“Tell me, ah — Lan Zhan,” he slurs, then blinks at him. “Have you ever liked someone?”</p>\n<p>Lan Wangji hesitates in his tea-pouring, probably for too long. Then he resumes and gives one nod.</p>\n<p>“Oh,” Wei Ying says. “Wow! I can only imagine the type of person to capture Hanguang-Jun’s attention.” He laughs, but the sound is strangely brittle.</p>\n<p>For a conflicted moment, Lan Wangji wages an inner battle — fighting not to ask the question he knows will only torment him, but that he’s dying to know the answer to.</p>\n<p>After another few beats of silence, he gives in. Asks, quietly, “And you?”</p>\n<p>Wei Ying stares at him with a glassy, slightly unfocused expression. He nods then, unusually serious.</p>\n<p>A crosswind of emotion tears through Lan Wangji, jealousy and despair vying for dominance. Of course Wei Ying has liked people — Lan Wangji already knew this. Wei Ying flirts and charms and loves with a crushing force; it’s only the natural assumption that Wei Ying has fallen for someone, maybe multiple people. But to hear it confirmed — to know there’s another, even at some point in the past — settles like an ulcer in Lan Wangji’s stomach.</p>\n<p>Wei Ying blinks at him sleepily, then props his chin on his hand, almost missing it. He sways a bit in place. “Can you tell me about her, Lan Zhan? I’m curious.”</p>\n<p>Lan Wangji keeps his eyes down. Surely, the truth is glaringly obvious, just by looking at his face.</p>\n<p>“Brave,” he answers, after another moment. “Clever. Brilliant. Warm. Caring. Funny. Selfless. Beautiful.” </p>\n<p>The paltry handful of words seems almost unfair in their lack, so woefully inadequate. Lan Wangji doesn’t spill out the words that he could say: that before Wei Ying, his life had felt like an unending, gray rain, and Wei Ying had been like the first ray of sun fracturing through the gloom, incandescent and revelatory and impossible to resist.</p>\n<p>Wei Ying is staring at him with a strange expression. Lan Wangji can’t quite decipher it.</p>\n<p>“Such a romantic after all, Lan Zhan ah,” he says softly after another minute. “She sounds like quite the person indeed, to have won the heart of Hanguang-Jun.”</p>\n<p>Lan Wangji glares at him in exasperation, but Wei Ying is looking at the floor now, his expression closed off, uncommonly quiet. Lan Wangji was expecting more teasing, so the reticent reaction surprises him.</p>\n<p>Wei Ying’s eyes flutter closed, and he sways again.</p>\n<p>“Wei Ying,” Lan Wangji says, standing to cross over to him. “You should sleep.”</p>\n<p>“Don’t want to,” he mumbles, leaning into Lan Wangji’s touch. “Wanna do something with you.”</p>\n<p>“Do something,” Lan Wangji echoes, a question for clarification.</p>\n<p>“Something fun.” Wei Ying lurches to his feet, planting a hand on the table to steady himself even as Lan Wangji keeps a firm grip on his opposite arm. “Let’s break rules. It’s so <em> boring </em> here.”</p>\n<p>“Wei Ying promised to stay in the <em> jingshi,</em>” Lan Wangji reminds him, with absolutely zero faith in this tactic.</p>\n<p>Wei Ying frowns, his brows scrunching together and his lip pushing out slightly. “Never did.”</p>\n<p>“Your memory is poor,” says Lan Wangji.</p>\n<p>“I’m tired of being dirty, Lan Zhan,” Wei Ying complains, and holds out his arm demonstratively. “Look how dirty.” A despondent look crosses his face. “I’m in Hanguang-Jun’s body and I’ve made him so dirty.”</p>\n<p>“Wei Ying,” Lan Wangji says, not entirely sure if they’re having a conversation with a double meaning. “It is fine.”</p>\n<p>Wei Ying groans, then shrugs out of one of Lan Wangji’s outer layers. It crumples to the floor. His brow is dewed with sweat. “Let’s go to Cold Spring, Lan Zhan. I’m so hot and dirty.”</p>\n<p>“No Cold Spring,” Lan Wangji says firmly. He cannot even fathom the repercussions of someone finding his intoxicated body trawling through Cloud Recesses. </p>\n<p>This had, indeed, been a spectacularly awful idea.</p>\n<p>“I’ll be so quiet,” Wei Ying whispers, clinging onto both of Lan Wangji’s arms. Lan Wangji wilts a little. “I’ll be so good, Lan Zhan, I promise, <em> please.</em>”</p>\n<p>“No,” Lan Wangji repeats, with wavering certainty. </p>\n<p>Wei Ying, even drunk, smells a victory and presses his advantage. “It can’t be comfortable for you either, having all that muck and dirt and sweat from earlier on your skin. If anyone sees us, you can talk for us, okay? I’ll be my best Hanguang-Jun and be totally quiet.”</p>\n<p>Lan Wangji sighs. He doesn’t believe Wei Ying is fundamentally capable of being quiet in any circumstance. However, Cold Spring does sound appealing at the moment, even if just to clear his addled mind. And it will perhaps help Wei Ying calm down from whatever state he’s working himself toward.</p>\n<p>“Do not leave my side,” he warns, and Wei Ying beams and affectionately pets his cheek.</p>\n<p>“Good boy, Lan Zhan, you’re so good to me,” Wei Ying mumbles, listing sideways a bit, and Lan Wangji once again has to question his own soundness of mind. </p>\n<p>He leads Wei Ying toward the entrance of the <em> jingshi, </em>and then they’re out into the fresh evening air, cooler than inside but still warm enough to warrant a trip to the springs. Wei Ying sighs contentedly, then slips his hand into Lan Wangji’s and squeezes. Lan Wangji almost physically starts, heat blazing in his cheeks at the casual gesture.</p>\n<p>Keeping an iron grip on his hand, Wei Ying leans his body into Lan Wangji’s, a warm press at his side. “Nice night.”</p>\n<p>“...Mn,” Lan Wangji says, sensing that his input is desired.</p>\n<p>“Look at the moon,” Wei Ying says in a low, singing voice, tipping his chin upward to stare with an awed expression. “So strong and devoted and handsome.”</p>\n<p>Lan Wangji looks at him strangely, then replies, for lack of something better to say, “Yes.”</p>\n<p>Wei Ying closes his eyes and hiccups, still gripping onto him as they walk. “I’m gonna regret this tomorrow, aren’t I, Lan Zhan? Am I acting foolish?”</p>\n<p>“No,” Lan Wangji says kindly.</p>\n<p>“Yes I am,” Wei Ying sighs. “I’m an embarrassment to the GusuLan sect.”</p>\n<p>“No,” Lan Wangji repeats, with more force.</p>\n<p>“Hm. If you say so,” Wei Ying says, complacent again. “It’s no wonder you don’t drink, Lan Zhan. I’ll never pass judgment on you again, I promise. This is very tragic for you.”</p>\n<p>Lan Wangji is content to let Wei Ying babble as they make their way along the wooded path to Cold Spring. He keeps a keen eye out for anyone who may be out walking and see them, but Wei Ying’s senses are duller than his own, with his lack of spiritual power. The moonlight illuminates their way along the steep path, at least, the surrounding trees tipped in silver like a colorless painting.</p>\n<p>When they reach Cold Spring, Lan Wangji helps Wei Ying pick his way down the slippery rocks — and once they reach the water, Lan Wangji hesitates. Wei Ying doesn’t; he lets go of Lan Wangji and begins peeling off the rest of his layers, his expression slightly vacant but still set with concentration.</p>\n<p>Wei Ying glances over to him, finally seeming to notice that Lan Wangji has frozen in place. “You can take my clothes off. I don’t care if you see me.”</p>\n<p><em> I do, </em> Lan Wangji wants to say, unsure how to proceed.</p>\n<p>Wei Ying sheds his last layer, leaving Lan Wangji’s pale chest bare, nearly luminescent under the bright cast of the moon. He rolls his shoulders and his neck, then hooks his thumbs in Lan Wangji’s waistband —</p>\n<p>Lan Wangji’s hand shoots out to stop him.</p>\n<p>“What—?” Wei Ying frowns down in confusion at it, then says, “Oh, right. Why are you still dressed?”</p>\n<p>Lan Wangji swallows, then squeezes his eyes shut when Wei Ying starts to undress him, his hands moving with quicker certainty than he would expect from his current state of inebriation.</p>\n<p>“You’re so strange, Hanguang-Jun,” Wei Ying murmurs, and Lan Wangji feels the brush of night air against his exposed chest. “But I still like you.”</p>\n<p>Wei Ying’s hands move to his waistband with intention, and again, Lan Wangji stops him, keeping his eyes closed. He can feel the hot throb of his pulse through every limb in his body, and he is suddenly very desperate to be in cold water, away from Wei Ying’s closeness and heat.</p>\n<p>“What’s wrong with this?” Wei Ying asks in a low voice. The glassy, hollow look in his eyes gives away his drunkenness, but he sounds very much not so, and Lan Wangji swallows hard. “Are you really so disgusted by my body that you won’t look at me or touch me, Lan Zhan?”</p>\n<p>Lan Wangji turns his face away, not possessing a single response to that. To deny it as emphatically as he feels would no doubt give him right away.</p>\n<p>“Okay,” Wei Ying says, taking a step back. The moment he does, Lan Wangji aches for him closer. “Let’s swim.”</p>\n<p>“Stay above water,” Lan Wangji tells him, suddenly alarmed, and Wei Ying waves him off with a hand.</p>\n<p>“I’ve been swimming my whole life,” he says, dipping a toe in the water and recoiling from the temperature at once. “Could swim in my sleep.”</p>\n<p>Wei Ying wades in waist-deep, visibly shivering, and Lan Wangji watches him from behind, again feeling strangely out-of-body — seeing his own half-naked form moving about the water, independently of himself.</p>\n<p>After another moment of hesitation, Lan Wangji follows after Wei Ying, the chill lancing straight through him to the bone. Wei Ying’s body is unused to the conditions of Cold Spring, especially without a core to mediate the effects, so he shakes at the cold, shakes so hard that Wei Ying turns and notices.</p>\n<p>“I think it’s warmer by you,” he says, drifting over with a mischievous smile, and Lan Wangji tries to take a stumbling step back but nearly hits a sharp rock with the heel of his foot. Steam curls up from both of their bodies, and for a long time, they just stare at each other, perhaps both absorbing the sheer oddness of their situation.</p>\n<p>Lan Wangji does feel better in the water — more focused, less aroused and flustered. The chill drives out any distracting sensation; the pain of coldness is the only thing his mind can focus on. He had come here often when Wei Ying first arrived at the Cloud Recesses for these same results, meditating and reciting the Lan sect rules until he could no longer hear Wei Ying’s shimmering laughter, see his eyes or his smile or the curve of his narrow waist.</p>\n<p>“Lan Zhan,” Wei Ying says, much closer now, and Lan Wangji’s eyes flare open. Wei Ying stands before him, taller, more muscular, paler, light-eyed, but the same person regardless, looking at him.</p>\n<p>“I feel sober,” Wei Ying says, still slurring his words.</p>\n<p>“You are not,” Lan Wangji informs him.</p>\n<p>“The cold, though, it — it’s cleared my head a little,” he says, then frowns at him. “Lan Zhan, you look blue.”</p>\n<p>“I’m f-fine,” Lan Wangji says, surprised and disgruntled to feel his teeth chattering.</p>\n<p>Cold fingers find his chin and gently tilt his head up, and Lan Wangji steels his nerve and meets Wei Ying’s gaze without looking away. </p>\n<p>In the endless reading of his youth, Lan Wangji had read reports and stories in the library’s archives of Tao masters bursting suddenly into flame, withering up into ash within moments, seemingly with no explanation aside from some mysterious, esoteric form of spiritual ascendance. He had always scoffed with disbelief at the outlandishness of the stories. </p>\n<p>Now, he thinks he understands how it would feel.</p>\n<p>Wei Ying’s eyes flicker across his face, as though intently searching for something, and after a moment, he smiles.</p>\n<p>“I can still see you,” he says. “Even in my own face. Your eyes are the same.”</p>\n<p>Lan Wangji shakes harder, not entirely from the cold. He starts to feel dizzy again. He should put a stop to whatever strange alchemy is unfolding between them — not like this, not when they don’t have their bodies and Wei Ying is too drunk to know left from right. Not like this.</p>\n<p>“Can you see me too?” Wei Ying asks. </p>\n<p>His hand finds Lan Wangji’s chest, palm laying flat over his racing heart; it’s the only point of warmth in his entire body. Wei Ying reaches for Lan Wangji’s hand, now almost numb of feeling, and places it over his own chest, over the heart beating in Lan Wangji’s body. His own pulse also thunders there, much quicker than normal.</p>\n<p>Lan Wangji tries to breathe.</p>\n<p>Wei Ying looks down at himself then, as though drinking in the sight of Lan Wangji’s body, of their joined hands, before he murmurs, “All of this, and what do you do with it, Lan Zhan? Keep it selfishly stored away?”</p>\n<p>“Stop,” Lan Wangji whispers, all the force and heat to the command gone. He isn’t sure what he’s asking anymore, or what he wants in this moment.</p>\n<p>Wei Ying playfully skims a thumb over his nipple, stiff with the cold, and Lan Wangji returns to himself with the bolt of desire that cracks through him, weakening his knees. He pulls away at once, breathing raggedly. He wants desperately to touch himself, to quell the ache between his legs and make it disappear, but he <em> can’t, </em>not when —</p>\n<p>Wei Ying blinks at him a few times, as though confused. He licks his lips and takes a step back of his own. Then, as if nothing had happened, he sets about washing his limbs in a methodical manner, scrubbing off the dirt and sweat off Lan Wangji’s body with an empty expression.</p>\n<p><em> Still drunk, </em> Lan Wangji reminds himself as he stares, his heart still galloping madly. Wei Ying won’t remember any of this, come tomorrow. </p>\n<p>He woodenly follows Wei Ying’s example, sluicing icy water over his arms and chest and face. He tries to ignore the gnarled knot of scar tissue in the center of Wei Ying’s abdomen, the sun-shaped brand seared into his pectoral, the roping burn scars from Zidian snaking along his sides and ribs. A physical topography of self-sacrifice — permanent reminders of Wei Ying’s opinion of himself when weighed against others’ needs. </p>\n<p>Lan Wangji wonders if one day, he can return the favor for Wei Ying with his own body.</p>\n<p>“Let’s go back,” Wei Ying announces, abruptly moving toward the shore, and Lan Wangji blinks after him.</p>\n<p>Wei Ying stumbles as he shrugs into Lan Wangji’s clothes, but is otherwise quiet and composed as Lan Wangji dresses alongside him. His old clothes feel grimy on his newly clean skin.</p>\n<p>Wei Ying takes Lan Wangji’s arm again in a dutiful manner, as though Lan Wangji is the one who needs assistance, and pulls him up the wooded path, their shoes squelching beneath them.</p>\n<p>For a long moment, there’s silence between them before Wei Ying speaks again.</p>\n<p>“You know what, Lan Zhan,” Wei Ying says, drooping heavily into his side. “I think liking someone is the worst thing that can ever happen to a person.”</p>\n<p>This conversation again. Lan Wangji experiences that same acidic sensation as he did before, eating away at his insides. To have to listen to this seems like a unique form of karmic punishment.</p>\n<p>“It feels good, but it hurts,” Wei Ying whispers, staring off with a faraway expression, eyes hazy. “It feels like being sad, the ache of it, then it feels all warm and mushy when you see them, too. And it feels like...even the hurt is worth it, to know they exist. Do you know what I mean?”</p>\n<p>Lan Wangji does. Oh, he does.</p>\n<p>“No,” he says coldly, hoping to put a fast end to this discussion.</p>\n<p>“Don’t ever like someone,” Wei Ying says mournfully. “I think I would rather get beaten up than feel this way even one second longer.”</p>\n<p>Lan Wangji wants to ask just who it is that’s reduced the dauntless, shameless Wei Wuxian to such a state, but he doesn’t dare, for fear that once he has a name, he might track the person down and do something he regrets.</p>\n<p>“Oh, it’s Zewu-Jun,” Wei Ying says, which snaps Lan Wangji right back to the situation at hand.</p>\n<p>It is, indeed, his xiongzhang, moving toward them quickly and silently in the cover of the night, his multi-pronged headpiece glinting as it catches different shafts of moonlight through the trees. His hands are clasped behind his back, and his eyes are fastened to Wei Ying — to Lan Wangji’s form.</p>\n<p>“Zewu-Jun,” Lan Wangji says respectfully, trying to salute while also keeping Wei Ying upright.</p>\n<p>“Zewu-Jun,” Wei Ying repeats, clumsily doing the same. Lan Wangji closes his eyes and tries not to sigh through his nose.</p>\n<p>Lan Xichen takes one look at Wei Ying and his nostrils flare. He turns to stare accusingly at Lan Wangji — with exasperation, not quite angry but his patience clearly tested. </p>\n<p>“Alcohol?” he says, lips pursed. “I assume this is your doing, Wei-gongzi?”</p>\n<p>“Wei Ying did nothing,” Lan Wangji says in an immediate instinct to protect Wei Ying’s reputation, only to realize how stilted and formal the comment sounds coming from Wei Ying’s own mouth.</p>\n<p>Lan Xichen stares at him, then back to Wei Ying, who’s still lilting suspiciously to one side.</p>\n<p>“I...found him like this, in the <em> jingshi,</em>” Lan Wangji says. “I thought I would take him for a walk.”</p>\n<p>“This behavior is not like Wangji at all,” Lan Xichen murmurs, staring at Wei Ying through his eyebrows with worry. “I fear something must have happened to deeply upset him.”</p>\n<p>Lan Wangji stays silent; his brother’s concern touches him and discomforts him in equal measure.</p>\n<p>“Wei-gongzi is...returning from Cold Spring?” Lan Xichen guesses, taking in the two of them still soaking wet. </p>\n<p>“Yes,” Lan Wangji says, trying to speak as Wei Ying would. “I thought it might — clear Lan Zhan’s head.”</p>\n<p>Lan Xichen sighs. “That was thoughtful of you,” he says. </p>\n<p>“Mn,” Lan Wangji says, then catches himself and adds, “Yes.”</p>\n<p>Lan Xichen takes a deep breath again, transferring his gaze from his brother to the real Lan Wangji before him. He hesitates, as though carefully picking his words, before he speaks.</p>\n<p>“Wei-gongzi,” he says. “I trust you will be mindful of Wangji’s...feelings, in the future. I do not want to see him this way again.”</p>\n<p>Lan Wangji feels heat itching in his throat. He has never tried to hide his feelings for Wei Ying from his brother, but to know he would speak to Wei Ying about it in such a way is mortifying.</p>\n<p>Wei Ying, of course, chooses that moment to speak up.</p>\n<p>“Zewu-Jun,” he says with a wet hiccup. He locks one hand onto Lan Wangji’s elbow. “Zewu-Jun, I like your Hanguang-Jun so much. I think I might keep him.”</p>\n<p>Hearing this from his brother, Lan Xichen’s expression of perplexed concern returns at once.</p>\n<p>“Wei-gongzi, please take Wangji discreetly to the <em> jingshi,</em>” Lan Xichen says. “And please ensure that no one else sees him like this.”</p>\n<p>Lan Wangji nods, relieved to see the end of this horrible conversation. “Of course, Zewu-Jun. Thank you.”</p>\n<p>“I think that went well,” Wei Ying muses, far before they’re out of earshot, and Lan Wangji walks faster, almost dragging Wei Ying behind him in his haste.</p>\n<p>“Lan Zhan,” Wei Ying whines at him as Lan Wangji pulls him into the <em> jingshi </em> at last<em>. </em>“Don’t be angry with me, please.”</p>\n<p>“Not angry,” Lan Wangji replies, meaning it.</p>\n<p>“Are you sure? It seems like you’re angry at me. Then again, it always seems like you’re angry at me. You’ve never really liked me much, have you?”</p>\n<p>“Wei Ying,” Lan Wangji says, both surprised and pained by the question. He has been informed by others, countless times, of his own ambivalence, that his cold exterior is like an impenetrable fortress, but to know Wei Ying thinks his regard for him so low sends a sharp, shooting pain through his chest. He’s upset with himself, incapable as he is of saying and doing as he means.</p>\n<p>“Lan Zhan,” Wei Ying murmurs, seeming to sense his sudden inward retreat. He cups one of Lan Wangji’s cheeks, turning his face so they’re closer. “Don’t listen to me when I’m like this, I just say anything. I don’t know what I’m saying. Come to bed with me.”</p>\n<p>Lan Wangji heaves in a breath, his instincts screaming at him to recoil, to shy away from this directness, but he swallows it down. How often has he gotten in his own way, when it comes to what he truly wants?</p>\n<p>Still, he hesitates.</p>\n<p>Then:</p>\n<p>“Okay,” he hears himself say, and Wei Ying’s smile lights up the room.</p>\n<p> </p>\n<p align=\"center\">—</p>\n<p align=\"center\"> </p>\n<p>At last, Wei Wuxian thinks, he’s gotten Lan Zhan in bed with him — although, of course, it’s not quite in the context he wants. And it’s a distinctly less sexy context than his alcoholic alter-ego has been fantasizing about.</p>\n<p>Lan Wangji is as stiff as a board next to him, his spine rigid and his eyes fixed to the ceiling. His hands are clenched to his chest in a facsimile of the Lan sleeping position, and he’s breathing shallowly through his flared nostrils.</p>\n<p>There’s also the unignorable fact that he’s in Wei Wuxian’s own body, which is still too strange to reckon with.</p>\n<p>“Lan Zhan,” Wei Wuxian murmurs, still sluggish with the alcohol. It makes his tongue thick in his mouth. “Calm down. I won’t do anything to you. I just wanted someone to lay down with me, okay?”</p>\n<p>Lan Wangji looks like he wants to squirm but remains still, a pretty red flush climbing up his neck. Wei Wuxian reaches out a hand, splays his fingers across his chest, where he can feel Lan Wangji’s heartbeat rabbiting frantically against his palm.</p>\n<p>“Lan <em> Zhan,</em>” he teases, curling in even closer. “Are you nervous?”</p>\n<p>He watches Lan Wangji’s rigid profile, the way his throat gives a bob and dry click as he swallows. His breathing sounds quicker than before.</p>\n<p>Right, right, Wei Wuxian remembers, somewhat woozy. Lan Zhan and his thing with touching people. He’s not sure they’ve ever been so close for so long; he can feel the solid warmth of Lan Wangji radiating into him.</p>\n<p>The alcohol fogs everything in his brain, everything sensible and rational and responsible — he leans forward and presses his nose to the side of Lan Wangji’s neck, burying his face in the warm hollow between neck and shoulder. Lan Wangji jerks beneath him, his breath hitching.</p>\n<p>For the first time that Wei Wuxian can recall, Lan Wangji doesn’t smell like his crisp, familiar sandalwood. He smells…earthy, sort of smoky, like the heat from a bonfire. Also sort of cold, from the spring. Is that his own scent?</p>\n<p>“Is this fine?” Wei Wuxian mumbles, closing his eyes. “Please don’t get up and go. I don’t want to be alone.” </p>\n<p>There’s a beat of silence, and then Lan Wangji says, low, “I will not leave.” </p>\n<p>Wei Wuxian briefly smiles, wriggling in closer. When he’s sleepy, he latches on to everything in immediate vicinity and clings like his life depends on it — liquor, it would seem, has much the same effect. </p>\n<p><em> Poor Lan Zhan, </em> he thinks as he drifts in and out of consciousness, fading between murky layers of blacks and grays. Forced into his body, forced into closeness with him. He’ll make it up to him one day. He will. He will, he’ll take him back to Yunmeng and buy him something nice, maybe a meal, take him out in a rowboat on the lakes when the day is sunny, put a lotus in his hair… </p>\n<p>The next thing he knows, Wei Wuxian is jerking awake into darkness on a stifled scream, his thin inner robe plastered to his skin with cold sweat, his pulse beating a fast, thready staccato into all his limbs. He’s thrashing, fighting, resentment spindling all around him in black-red coils, seeping into his body, his empty core, sucking everything out of him until there’s nothing but desiccated flesh—</p>\n<p>The resentment crowds greedily around the cavity of his empty core; like a rotten tooth torn out from the root, blood filling the space behind. </p>\n<p>\n<em> Do you want revenge, Wei Wuxian? Stay.  </em>\n</p>\n<p>\n<em> You can have revenge.  </em>\n</p>\n<p>\n<em> Stay with us. </em>\n</p>\n<p>“— Wei Ying,” he hears a frantic voice say, close to his ear, and yes, sometimes Lan Zhan had spoken to him there; had reprimanded him, scorned him, spat on him, told him how reviled he was, told him he deserved to die alone, and he knows that, he knows — </p>\n<p>\n<em> I’m sorry, Lan Zhan, I’m sorry, please, please, please — </em>\n</p>\n<p>\n<em> Stay, Wei Wuxian. </em>\n</p>\n<p>\n<em> Stay. </em>\n</p>\n<p>“<em>Wei Ying!</em>” Lan Wangji repeats, more sharply than before, and it takes hearing it in Wei Wuxian’s own voice to realize he’s not in the Burial Mounds, not among corpses and seething resentful energy and the screams of the dead. He’s in a bed and a body that aren’t his own, his unfamiliar chest heaving for breath, and Lan Wangji’s fingers are encircled around both of his wrists, where he can feel his heartbeat sickly pounding.</p>\n<p>“What —” he tries to say, heaves for air.</p>\n<p>“A nightmare,” Lan Wangji says, simply, but the two words are so soft and concerned that it’s strangely grounding.</p>\n<p>“I’m s-sorry,” he says, his teeth chattering. He’s so deeply, achingly cold, down to the marrow of his bones, and he’s shivering violently, great shudders racking his frame. </p>\n<p>He’s not there, Wei Wuxian tells himself. Just this again. Just another memory. His head still feels strangely woolly with the leftover alcohol, leaving a cottony taste in his mouth.</p>\n<p>“Tea,” Lan Wangji says quietly, and goes to move, but Wei Wuxian grips onto his wrist so hard he feels the bones creak.</p>\n<p>“Don’t,” he whispers, not entirely sure what he’s asking for—don’t pity me, please, not you? Don’t be kind to me, when I deserve it least? Don’t leave? He thinks it may be all of them at once.</p>\n<p>Lan Wangji hesitates, his intense gaze scrutinizing, before he gives one nod and settles back into bed, then continues to stare at him. It’s odd seeing that appraising expression in his own eyes; with a sudden, fierce ache, Wei Wuxian misses the cool steadiness of Lan Wangji’s golden gaze, how warm the hues can be when they take him in.</p>\n<p>Wei Wuxian can feel Lan Wangji’s core pulsating with energy, activated to the perceived danger. It shakes through him with a strength that has for some time been unfamiliar to him. He takes a deep breath, into his belly, and reigns it in with effort.</p>\n<p>He can feel his brow still dripping with sweat. Lan Wangji reaches out with a sleeve and dabs it away.</p>\n<p>“I’m sorry to wake you,” Wei Wuxian whispers, recoiling from the gentleness of the touch. All the moisture in his mouth is gone.</p>\n<p>“No need,” Lan Wangji replies, just as quiet. “What can I do?”</p>\n<p>Wei Wuxian drops his head into his hands. “Just…stop looking at me like that. Please.” His skin crawls at the prospect of being pitied, of being seen.</p>\n<p>“Mn. No more looking,” Lan Wangji says, in such a serious, considerate voice that Wei Wuxian gives a sniffled, helpless laugh. </p>\n<p>“Lan Zhan,” he says, before he can stop himself. “I miss seeing you in your body. I miss your face.” Lan Zhan had always felt…big, solid, safe. Wei Wuxian had felt protected near him, no matter what. That, he doesn’t say.</p>\n<p>Lan Wangji says nothing, but Wei Wuxian thinks he hears him inhale, sharp and quiet.</p>\n<p>“Lan Zhan,” he says again, his voice hushed. “You’re a good person, you know that?”</p>\n<p>Again, Lan Wangji says nothing.</p>\n<p>“I’m sorry I tease you so much,” Wei Wuxian continues. “It’s just that I…” <em>Like you so much I can’t stop myself. </em>That, he also doesn’t say. He’d never dare. Even thinking it tears through him, brazen. </p>\n<p>“Stop apologizing,” Lan Wangji says, firm and terse. “Between us, there’s no need.”</p>\n<p>“Okay,” Wei Wuxian says, and exhales shakily.</p>\n<p>“Wei Ying.\" Lan Wangji hesitates again, gauging Wei Wuxian’s expression. “You dreamt of the Burial Mounds?”</p>\n<p>This time, Wei Wuxian doesn’t answer, unsure that he’s able to. He’s suddenly terrified to think what his unconscious self had spoken, with Lan Wangji’s mouth. </p>\n<p>“It’s not important,” Wei Wuxian says, and Lan Wangji makes an impatient noise.</p>\n<p>“This happens often?” he presses.</p>\n<p>Wei Wuxian doesn’t say anything to that. He’s certain that his silence confirms it, as well as the fact that he starts shivering violently again. </p>\n<p>“Lay down,” Lan Wangji says abruptly, and after a moment of hesitation, Wei Wuxian does as he’s told, too tired to make any weak quips or innuendos about Lan Wangji bossing him around in bed.</p>\n<p>He’s shocked to feel Lan Wangji turn him by the shoulders, his back to Lan Wangji’s front, despite Lan Wangji’s currently smaller frame.</p>\n<p>He hears Lan Wangji take a deep breath, and then tentative, warm arms pull him in, flush to the body behind him.</p>\n<p>“Lan Zhan,” Wei Wuxian says, stiffening despite the way his own body wilts welcomingly into the warmth. “You don’t have to touch me, I wouldn’t force you to —” </p>\n<p>“Not forcing,” Lan Wangji says, so close to his ear that heat zips up his spine. Wei Wuxian’s mouth dries out even more, if possible, chalky as desert sand. He’s still shivering with the cold, but warmth from Lan Wangji’s body heat creeps slowly into him, and he sighs.</p>\n<p>“Sleep, Wei Ying,” Lan Wangji whispers, and Wei Wuxian fights against the tide of exhaustion that threatens to tug him under. He wants to stay awake for this, to stay awake for Lan Zhan holding him like this, as he never will again, and he thinks he feels Lan Wangji’s face pressed, ever so lightly, into the base of his neck, but surely he’s already dreaming — surely he dreams it.</p>\n<p>When Wei Wuxian wakes up the next morning, with an awful, dark headache clustering around his temples, the bed is empty. </p>\n<p>For a moment, he blinks into the painful, white morning light of the <em> jingshi </em>and lets his head pound as though in punishment, blood pulsing thickly against his skull. Wasn’t Lan Zhan here before? He’d had a nightmare — he was drunk?</p>\n<p>When he shifts, floundering about for his bearings, a jolt of arousal zings through him, hard and insistent. Sighing, his hand drops to his lap to quickly take care of it, as he usually does when he wakes up like this, but his hand freezes at once. </p>\n<p>It’s not his hand; it’s not his clothes, and it’s <em> certainly </em>not —</p>\n<p>In one hot, mortifying swoop, the past few days rush back to him; the soul-switch, the scars and the drinking. He can feel heat climbing to his face, which doesn’t do anything to help the arousal situation — in fact, imagining being in Lan Wangji’s body, doing intimate physical things, is rapidly escalating the situation.</p>\n<p>His hand lingers, staring down in complete bafflement at the tented shape pushing at the front of Lan Wangji’s trousers.</p>\n<p>And just keeps staring. <em> Big, </em>is the only thing his dumb, hormone-addled brain can summon at the moment.</p>\n<p>Wei Wuxian covers his burning face with his hands.</p>\n<p>...he <em> can’t</em>, right? Does Lan Wangji even know how to do that? <em> Has </em> he ever done it before? No, he could never do that to Lan Zhan — he would feel horrible all his life for taking advantage of such a situation.</p>\n<p>But still —</p>\n<p>Wei Wuxian groans and flips over, his hips canting up once, twice into the mattress. He’s throbbing all over, his face splotchy with heat like a rash. This needs to go away, <em> now, </em>before Lan Wangji gets back here and bursts an artery. He thinks of various unpleasantries — old toe gunk, Jiang Cheng’s smelly armpits, Jin Zixuan’s face, Lan Qiren naked.</p>\n<p><em>This is fine,</em> Wei Wuxian thinks, as the arousal slowly, reluctantly starts to recede. It’s just bodies, as he told Lan Wangji earlier. He’d be okay with it if Lan Wangji woke up in a similar situation, although he admits the thought does make him feel even more hot all over.</p>\n<p>Cold Spring, Wei Wuxian thinks, would be perfect for this. Is that why Lan Wangji had spent so much time there early on in their days at Cloud Recesses? It seems like a good place for the Lans to suppress any wayward, raging hormones.</p>\n<p>Cold Spring...had they gone there, last night? He thinks they must have, given the dirt from his skin is gone. His memory of the night is a void, as though he’d been asleep for it. What did he say — what did he <em> do</em>? It feels absolutely horrible to be on the other end of this, Wei Wuxian realizes, feeling bad for Lan Zhan in a way he hadn’t appreciated before.</p>\n<p>The dread from this train of thought kills most of the arousal issue, although not completely. Wei Wuxian buries his warm face in a pillow, guilt gnawing away at him. </p>\n<p>Lan Wangji is just so... reserved, prudish, stoic, that it feels especially wrong to even be thinking about such things. Lan Zhan had barely been able to undress around Wei Wuxian without passing out; he’s already repulsed to be in Wei Wuxian’s body. The thought of his reaction to this makes Wei Wuxian feel awful and ashamed, even though it hadn’t technically been his fault.</p>\n<p>Lan Wangji <em> had </em> held him last night, hadn’t he? He thinks back to the warm, comforting press of Lan Zhan curled up around him and thinks that, actually, this whole thing may be <em> his </em> fault, and he should answer for it.</p>\n<p>“Wei Ying,” Lan Wangji says from the entryway, as though summoned, and Wei Wuxian almost jumps out of his skin.</p>\n<p>Wei Wuxian flips himself over and nestles himself down into the sheets more securely, just to be safe. “Lan Zhan! Wow, you look handsome this morning.”</p>\n<p>Lan Wangji visibly suppresses an eye-roll at this, crossing over to him with his hands behind his back. His guqin is strapped to his shoulders, which looks...strange, to say the least, on Wei Wuxian’s body.</p>\n<p>“Did you, ah, sleep okay?” Wei Wuxian asks, his voice pitched higher in his nervousness. He tries to look natural, levering himself up onto his elbows.</p>\n<p>“Mn,” Lan Wangji says. His gray eyes are clear and piercing, like frozen water as they take in Wei Wuxian. “And you?”</p>\n<p>“I slept fine,” Wei Wuxian lies.</p>\n<p>Lan Wangji clearly doesn’t believe him, but lets it go. He smoothly transitions subjects. “I spoke to xiongzhang just now. After my explanation, he believes he may be familiar with the curse.”</p>\n<p>Wei Wuxian sits up straighter in bed, his focus completely redirected. “He does? What did he say? Does he know how to fix it?”</p>\n<p>“He believes the curse is one called <em> Linghun-jiaohuan</em>. He has heard many in the area call the monster by the same name, and we are evidently not its first victims,” Lan Wangji says. “Xiongzhang has suggested that if we can track and kill the creature, we will return to normal.”</p>\n<p>“Ah, a monster with at least some intelligence, like the Tusha Xuanwu. As I suspected.” Wei Wuxian pauses, rubs at a spot on his chin, and then smiles. “I bet Zewu-Jun was pretty confused when you showed up in my body this morning.”</p>\n<p>Lan Wangji’s expression doesn’t change except for a small tilt of his mouth; it’s the ghost of a smile, which Wei Wuxian tucks away into his memory bank with a small rush of triumph. “Let’s say that after last night, it did not take long to convince him of the situation.”</p>\n<p>Wei Wuxian laughs at that, then lightly punches Lan Wangji’s shoulder. “Who ever said you weren’t funny, Lan Zhan? You’re a master of wit.”</p>\n<p>Lan Wangji looks at him wryly, but Wei Wuxian thinks he can detect something warm and fond in his gaze, and his insides start to feel all dangerously gooey. He beams at him.</p>\n<p>“We should go to Cold Spring to bathe and meditate,” Lan Wangji says then, rising from the bed, and Wei Wuxian remembers his earlier predicament at once and feels new dread swell up in him. Of course, <em> now </em>Lan Wangji is on board with flagrant stripping.</p>\n<p>“What’s the rush?” Wei Wuxian parries with a nervous laugh. “I mean, we just went last night, didn’t we? I only just woke up.”</p>\n<p>“You smell like liquor,” Lan Wangji says, curtly. “Alcohol is forbidden in the Cloud Recesses.”</p>\n<p>“Right, right,” Wei Wuxian mutters. “Ah, I’m sorry for any of my conduct last night, Lan Zhan. Alcohol <em> really </em> does hit you like a runaway boulder. I’ll be more careful from now on.” The fact that they had encountered Zewu-Jun is news to him. That he can’t remember it at all feels incredibly ominous. “I didn’t, ah...<em>do </em>anything to you, right?”</p>\n<p>Lan Wangji blinks at him for a moment. His silence is not promising.</p>\n<p>“No,” he eventually says, with such hesitation that it does little to restore Wei Wuxian’s confidence. “Wei Ying did not do anything.”</p>\n<p>“It’s just that I…” Wei Ying scratches the back of his head. “Sometimes, when I have too much to drink, I…”</p>\n<p>“Wei Ying,” Lan Wangji says. “It is fine. And if you had misbehaved, it would be forgiven.”</p>\n<p>“Did I embarrass you in front of Zewu-Jun?” Wei Wuxian asks; he still feels vaguely guilty, as though he subconsciously knows he did something inappropriate and needs to apologize for it.</p>\n<p>“No more so than you usually do,” says Lan Wangji with a straight face, and Wei Wuxian snorts.</p>\n<p>Still, if they really had gone to Cold Spring...Wei Wuxian does not trust himself with alcohol and an undressed Lan Zhan even a little bit.</p>\n<p>“If you say so,” he says, still feeling uneasy.</p>\n<p>“I do,” Lan Wangji replies. “Cold Spring?”</p>\n<p>Wei Wuxian hesitates, then nods; to tell the truth, he <em> does </em>feel pretty gamey. He had sweated through most of the night thanks to the liquor and the nightmares, and his head and mouth feel fuzzy with the hangover. The cold water could do him well.</p>\n<p>Sternly, he tells Lan Wangji’s lap, <em> Behave, </em>then he gets to his feet, and groans when all his headache pounds in protest at the change of elevation.</p>\n<p>“I’m never drinking again,” he mutters, closing his eyes against the throbbing pain.</p>\n<p>“Mark your words,” says Lan Wangji.</p>\n<p>“Three jokes in one morning, Hanguang-Jun!” Wei Wuxian is delighted. Lan Zhan being a secret wit is delightful. He’d realized some time ago that the droll, rigid impression he had of Lan Wangji from their first days wasn’t entirely correct — well, it was in part, but now he looks back on those qualities with fondness, now that he understands Lan Wangji more. But the more layers Wei Wuxian knows of him, the more he...</p>\n<p>They’re interrupted by a sudden patter of running footsteps, and then two fast knocks at the door.</p>\n<p>“Lan er-gongzi,” Jiang Cheng says, not bothering to salute, then double-takes and gawks when he sees Wei Wuxian, mostly undressed and directly behind him. “<em>You</em>! I’ve been looking for you! What are you doing in Lan Wangji’s —” Jiang Cheng seems to think better of the question, then closes his eyes as though summoning peace of mind from somewhere deep within. “I actually don’t want to know.”</p>\n<p>“Is there something I can help you with, Jiang-zongzhu?” Lan Wangji says, sounding more martyred than he has any right to.</p>\n<p>Jiang Cheng scoffs at his tone. “<em>I </em> came to help <em> you, </em> not that I’ll get any thanks for it.<em> </em>This morning’s patrol found traces of the creature. By its tracks, they think it’s headed toward Caiyi Town.”</p>\n<p>Wei Wuxian brightens at once, and he starts to sloppily (and almost definitely incorrectly) throw on various layers of white clothes while Jiang Cheng looks on in abject horror. </p>\n<p>“We should go right away,” he says as he flings robes on. “Jiang Cheng can lead the way.”</p>\n<p>The second he’s finished, Wei Wuxian darts out the door, grabbing Lan Wangji’s wrist as he goes.</p>\n<p>“You’re forgetting something,” Lan Wangji says behind him.</p>\n<p>Wei Wuxian flips a frown over his shoulder. “What?”</p>\n<p>“Bichen?” Lan Wangji asks, patient as ever, one eyebrow slightly aloft. </p>\n<p>“Oh, right, right, right.” Wei Wuxian ducks back inside the <em> jingshi </em>to pick it up from the bedside, as well as Chenqing while Jiang Cheng shuffles restlessly from foot to foot outside.</p>\n<p>“And you’ll need this,” Wei Wuxian says with a wide grin, patting Chenqing to Lan Wangji’s chest with a thump.</p>\n<p>Lan Wangji just looks at him with a small, pinched frown, and gives Chenqing back to him.</p>\n<p>“Fine. What about your guqin?”</p>\n<p>“Almost useless, without…” Lan Wangji’s voice trails off.</p>\n<p>“Right, right. Well, you can take Suibian for insurance if you want, although I think it’ll <em> also </em> be mostly useless to you given—” Wei Wuxian catches himself before his next words, and then flinches as Jiang Cheng turns toward him in his periphery.</p>\n<p>“Can you two hurry up?” Jiang Cheng snaps, blessedly seeming to notice nothing amiss. “The creature’s not going to lie around and wait for us to kill it.”</p>\n<p>“You’re right, Jiang Cheng,” Wei Wuxian says, magnanimous in his relief for having gotten away with that near-misstep. “We’d be lost without you.”</p>\n<p>“You smell ungodly,” says Jiang Cheng, and they set out.</p>\n<p>Once they reach the border of Cloud Recesses, Jiang Cheng sets Sandu on the ground, then stands on top of it. After a moment, it begins to levitate, hovering close to the ground. He looks impatiently over to Wei Wuxian, who has frozen in place.</p>\n<p>“Well?” Jiang Cheng says, testy. “Caiyi Town is more than sixty li from here. Surely you’re not expecting to walk all the way there?”</p>\n<p>“Of course not.” Wei Wuxian swallows. “It’s just that — Lan Zhan and I, we don’t have our own swords.”</p>\n<p>“So what? Use Bichen. Hanguang-Jun can make do with Suibian for now.”</p>\n<p>Lan Wangji slants a look sideways at Wei Wuxian, as though appraising how he wants to approach the situation. Obviously, given Wei Wuxian’s complete dearth of spiritual power, Lan Wangji can’t do anything at all with Suibian, let alone ride it.</p>\n<p>Wei Wuxian sighs, thickens his face, and looks solemnly at his brother. “I want Lan Zhan to ride with me.”</p>\n<p>Jiang Cheng splutters, nearly falling off his sword. “<em>What</em>? What the hell do you mean?”</p>\n<p>“I won’t feel safe unless he’s on Bichen with me,” Wei Wuxian says, still in that deathly serious tone of voice, while Jiang Cheng slowly starts to turn a bright shade of cherry-red. It compliments the hue of his clothes rather nicely.</p>\n<p>“You’re joking, right? Please tell me you’re joking. Did that curse knock your brain out of your head?”</p>\n<p>Wei Wuxian makes a show of gripping onto Lan Wangji’s arm, then clinging to his side. He hears Lan Wangji take a breath, then hold it. “I only feel comfortable riding Hanguang-Jun’s sword if he’s holding onto me.”</p>\n<p>Jiang Cheng covers his ears and groans. “Enough, enough. Do what you want, don’t involve me. Ugh.” He righteously flies away.</p>\n<p>Wei Wuxian grins, tilting his head down to meet Lan Wangji’s gaze. “I think I handled that well.”</p>\n<p>Lan Wangji just sighs, gently shaking his arm from Wei Wuxian’s grasp, and goes to stand in front of him, their feet aligned on Bichen.</p>\n<p>Wei Wuxian takes a breath to steady himself, then his arms snake around Lan Wangji’s waist, pressing the lines of their bodies together. Some small, treacherous part of him voices how nice the position would be in their real bodies; how secure and warm he’d feel, with Lan Zhan in such a position behind him. </p>\n<p>Lan Wangji tenses for a moment at the contact, then relaxes.</p>\n<p>“Hold onto me, Hanguang-Jun,” Wei Wuxian says, close to his ear. “Don’t let me fall, okay?”</p>\n<p>“Will not,” Lan Wangji agrees, tightening his grip on where Wei Wuxian’s arms are wrapped around him, and with another intake of breath, Wei Wuxian guides them upward, siphoning off Lan Wangji’s spiritual power to do so.</p>\n<p>By sword, it doesn’t take them long at all to reach the forested outskirts of Caiyi, removed from the teeming bustle of the town. Wei Wuxian follows the lead of Jiang Cheng, who’s maintaining an indignant distance from them. Jiang Cheng eventually directs them down into a more heavily wooded area, where they land and sheath their swords.</p>\n<p>“So what exactly is this thing?” Jiang Cheng asks as they start walking.</p>\n<p>“Hmm...not entirely sure,” Wei Wuxian says. “I would say it’s non-human, which would make it a monster, but a cognizant one, with real intelligence. My guess is that the creature is either itinerant or some poor soul awoke it accidentally, as the incidents are so recent. We know that it feeds on human flesh, whether dead or alive.”</p>\n<p>Jiang Cheng wrinkles his nose. “What will get rid of the curse?”</p>\n<p>“Zewu-Jun thinks that killing it will,” Wei Wuxian says. “I agree with him. Once the monster is dead, its power over the spiritual energy of the physical world will vanish.”</p>\n<p>“If you say so,” Jiang Cheng mutters.</p>\n<p>“I do say so,” Wei Wuxian replies sunnily.</p>\n<p>“Tracks,” Lan Wangji says, diverting their attention. There are, indeed, large scrapes of tracks nearby, scored into the earth in long, dragging shapes. Certainly not human, or from any animal that Wei Wuxian is familiar with.</p>\n<p>The trail leads the three of them into a denser part of the trees, darker and cooler as the leaves overhead crowd out the white glare of the midday sun. Wei Wuxian sticks close to Lan Wangji’s side, keeping his hand firmly planted on Bichen’s hilt.</p>\n<p>Lan Wangji holds up a hand to stop them as he kneels in the dirt. Wei Wuxian hesitates, the pad of his thumb stroking over the white engravings in Bichen’s hilt.</p>\n<p>“The tracks stop here,” Lan Wangji murmurs after another few moments of searching.</p>\n<p>“How can they?” Jiang Cheng demands. “It can’t have just disappeared into the air.”</p>\n<p>“Maybe it knows we’re following it,” Wei Wuxian suggests. “Its sense of smell is probably keen.”</p>\n<p>“Stay close to me,” Lan Wangji tells him quietly.</p>\n<p>It’s at that moment that a familiar screech rings out, and the three of them clap their hands over their ears in pain. Wei Wuxian recognizes the sound as the same scream he’d heard in the cave, right before he and Lan Wangji had been cursed.</p>\n<p>There’s the sound of bark scrabbling, and then the creature lands in front of them, snarling.</p>\n<p>“Of course it climbs trees,” Jiang Cheng snaps, unsheathing Sandu.</p>\n<p>Wei Wuxian stares at the creature, trying to comprehend exactly what he’s seeing. He hadn’t gotten a good look at it before, as the cave had been so dark and both he and Lan Zhan had been blinded. </p>\n<p>It looks...like somewhat humanesque in shape, but it walks naked on all fours, its limbs spindly and long and the flesh graying and peeling. Its teeth have been filed into yellow points, each separated by rotting gums; its fingernails have long been warped into gnarled claws. It has no eyes, and the skin drawn over the sockets is puckered.</p>\n<p>Wei Wuxian feels Jiang Cheng yank on his arm, hauling him away from both the creature and from Lan Wangji’s side.</p>\n<p>Although the creature has no nose, it has slits for nostrils, which flare as it turns its head toward Lan Wangji and snarls.</p>\n<p>When Wei Wuxian looks over to him, Lan Wangji’s expression is hardened with concentration, his mouth drawn into a tight line. He throws two talismans, but they do little to distract the monster. It rears back, hissing and spitting, while Lan Wangji unsheathes Suibian, but Wei Wuxian can tell even from here that without a core, it will have little effect.</p>\n<p>“Lan Zhan!” he calls, unsheathing Bichen. He feels power arc through his limbs at the contact, crackling through him as cold as frost. “Get behind me!”</p>\n<p>Lan Wangji looks to the sound of his voice for only a moment, but the lapse is all the monster needs to spring, locking its claws into Lan Wangji’s shoulder and slamming him to the ground. </p>\n<p>Then it takes off at a dead sprint, dragging Lan Wangji with it.</p>\n<p>The world goes white around Wei Wuxian, narrowing to a singular focus.</p>\n<p>“<em>Lan Zhan!</em>” Wei Wuxian takes off after them, ignoring Jiang Cheng’s cry behind him of “Wei Wuxian!”</p>\n<p>Lan Wangji’s legs are longer than his own, but he’s not as lithe or compact as Wei Wuxian, who had come first in every race among his peers at Lotus Pier. He’s barely caught up in time to see the creature dragging Lan Wangji down into a hole in the large, twisted roots of a tree, both vanishing from view.</p>\n<p>Wei Wuxian skids to a stop at the hole and stares down into it, panting, his heart crashing with panic. Lan Wangji is completely defenseless in his stupid, broken, helpless body. If anything happens to him — if anything happens to him —</p>\n<p>Wei Wuxian sheathes Bichen so he can shimmy down the hole, which it turns out is the creviced entryway to an underground cave. The entrance is slick with mud, chafing around him. </p>\n<p>He can hear the echoes of the creature snarling, but nothing from Lan Wangji which — it’s not like Lan Zhan makes a lot of noise anyway, but Wei Wuxian is still panicking.</p>\n<p>The drop from the hole to the cave floor is about three chi. He lands easily on his feet, but starts shaking when he sees blood coating the rock beneath his white shoes. If Lan Wangji had landed wrong from that height, he could be unconscious, he could be dead —</p>\n<p>He strikes up a lighting talisman and the creature, not ten strides away, snarls and skitters back. Hadn’t he thought it was intelligent? It acts completely feral, like a mindless animal. </p>\n<p>Wei Wuxian’s — <em>Lan Zhan's — </em>body is a black, crumpled shape next to it, and Wei Wuxian suddenly has trouble seeing, a red aura of rage clouding the corners of his vision.</p>\n<p>He unsheathes Bichen and a ray of blue light slices out from the blade, sharp as the cut of a guqin string, and the monster screams, cowering away from the brilliance of the light and the pain. It growls at him, spittle flying.</p>\n<p>“You should not have taken what isn’t yours,” Wei Wuxian snarls back at it, and then begins to whistle, the sound pitching high and eerie in the echo of the cave. At once, shadows unspool around him, curling up his body with familiar affection before they turn with the sharpness of a knife, pinpointing the creature.</p>\n<p>The shadows spring at Wei Wuxian’s command almost too quickly to see, entangling the monster in a black cloud of writhing beings, and the creature starts to scream — high-pitched, pathetic, desperate shrieking as they tear at its flesh.</p>\n<p>With the creature at last subdued, Wei Wuxian throws Bichen the way he’s seen Lan Wangji do, with a sure target in mind and with the certainty that it will come spinning back to him.</p>\n<p>His aim is true; the blade pierces the monster straight through the heart, and it gurgles and slumps, its mouth dribbling blood and drool.</p>\n<p>The shadows dissolve back into the earth as Wei Wuxian slumps with sudden fatigue. Belatedly, he realizes Lan Wangji may not forgive him for using his core to practice dark cultivation, but he can worry about that later — for now, he runs to Lan Wangji’s side and falls on his knees beside him.</p>\n<p>He barely touches Lan Wangji before a blinding flash envelops both of them, the same as before, and Wei Wuxian feels the oddest sense of getting yanked around and twisted, like getting caught and spat up in a riptide. He doesn’t know which way is up from down, and he can’t breathe, like he really <em> is </em>drowning —</p>\n<p>— and then he’s blinking up at Lan Wangji, who’s hovering over him and looking down at him with a dazed expression.</p>\n<p>“Wei Ying,” he says in his low, beautiful voice, and despite the twist of pain in his shoulder, Wei Wuxian reaches up and pulls him down against him. Lan Wangji huffs in surprise when their bodies slam together.</p>\n<p>“Don’t ever do that to me again,” Wei Wuxian says through gasps, pulling back, and he can’t stop himself from grabbing Lan Wangji’s handsome, precious face and kissing him once, hard, on the cheek, and then on the nose.</p>\n<p>Lan Wangji stares down at him, his mouth slightly parted.</p>\n<p>“I,” he tries to say, then nothing further.</p>\n<p>“I saw you lying there and the blood and I thought — I thought you were dead,” Wei Wuxian chokes out, still heaving for air. All of the spiritual power that had poured through him moments before is gone; he’s bereft again, returned to his old familiar creaks and aches. And a brand new bloody wound on his shoulder, another scar for the collection.</p>\n<p>“Pretending to be,” Lan Wangji explains. “To catch it off guard, kill it then.”</p>\n<p>Wei Wuxian closes his eyes, trying to just <em> breathe </em>for a moment. Trying to catch up with having his soul sucked out and crammed back into a different vessel, with the fact that Lan Wangji is alive and uninjured.</p>\n<p>“You’re hurt,” Lan Wangji rasps, and he cups one hand to Wei Wuxian’s shoulder.</p>\n<p>“Yeah,” Wei Wuxian agrees.</p>\n<p>Lan Wangji’s face darkens. “My fault.”</p>\n<p>“No,” Wei Wuxian disagrees.</p>\n<p>“Wei Wuxian!” Jiang Cheng’s voice rings out in the cave, echoing loudly. “<em>Wei Wuxian!</em>”</p>\n<p>“I’m alive,” Wei Wuxian calls back, and he hears Jiang Cheng curse. </p>\n<p>A moment later, a single purple leg appears through the hole in the cave ceiling, to which Wei Wuxian exclaims, “Aiya, stay right there! We’ll need your help getting up out of here.”</p>\n<p>The leg hesitates, then disappears again.</p>\n<p>“Can you walk?” Lan Wangji asks, running his hand up Wei Wuxian’s side like it’s the most casual thing in the world, and Wei Wuxian tries very, very hard not to think too much into it.</p>\n<p>“Won’t know until I try,” he says with a grunt and a wince. “Help me up?”</p>\n<p>Lan Wangji stands, sheathes Bichen, and pulls Wei Wuxian up by the other arm.</p>\n<p>They manage to get Wei Wuxian out of the cave with some careful negotiating, which involves Wei Wuxian clambering up until he’s seated on the top of Lan Wangji’s strong shoulders so that he’s tall enough for Jiang Cheng to grab his good arm and haul him up.</p>\n<p>Jiang Cheng and Wei Wuxian peer back down into the hole, where Lan Wangji’s face tilts up at them, smooth and expressionless.</p>\n<p>“I could leave him down there,” Jiang Cheng muses to himself, and Wei Wuxian uses his same good arm to smack him. “<em>Ow! </em>Ugh, you’re so sensitive these days.”</p>\n<p>“Pull him up before I beat you up,” Wei Wuxian threatens, and Jiang Cheng sneers at him and retorts, “As if you could,” but reluctantly extends an arm down into the hole anyway.</p>\n<p>Lan Wangji is covered from head to toe in dark mud when he emerges, his silken white robes ruined beyond repair — which is weirdly hot — and he doesn’t spare Jiang Cheng a thanks, which is very rude, especially for Lan Wangji standards. Lan Zhan being an asshole is <em> also </em>kind of hot.</p>\n<p>Wordlessly, Lan Wangji crosses over to Wei Wuxian and picks him up, one hand to the back of his knees and the other securely locked around his waist. Wei Wuxian settles more comfortably into his arms and ducks his head to hide his grin, as well as the blush he can feel starting to warm his cheeks.</p>\n<p>Without a second glance at Jiang Cheng, Lan Wangji starts off in the direction of Cloud Recesses.</p>\n<p>“I’m not sure all of <em> that </em>is necessary, Lan er-gongzi,” Jiang Cheng calls after them, exasperated.</p>\n<p>“It’s completely necessary,” Wei Wuxian says, glowering back at Jiang Cheng around Lan Wangji’s shoulder as he clings. “I’m an invalid.”</p>\n<p>“You can <em> walk,</em>” Jiang Cheng says, at his wit’s end. “You are so perfectly capable of walking.”</p>\n<p>“My legs are numb,” Wei Wuxian protests, and Jiang Cheng storms after them, muttering this and that about fraternal regard.</p>\n<p>Whether it’s the wound, the soul-switch, or the comedown from the fight, Wei Wuxian does genuinely start to feel woozy halfway back, drifting in and out of a doze. Lan Wangji’s steps don’t falter for a moment; he keeps up an easy clip, his breaths effortless.</p>\n<p>“I’d really lose face if someone saw me like this, you know,” Wei Wuxian mumbles into Lan Wangji’s chest.</p>\n<p>“Mn,” Lan Wangji says, but says it more like he’s placating Wei Wuxian and doesn’t actually care.</p>\n<p>“Lan Zhan,” he says, his eyes drifting shut. “I’m sorry I used your core for crafty tricks. I wouldn’t have done it if I had any other choice, okay?”</p>\n<p>Lan Wangji hesitates, then replies, “It is fine, because it is Wei Ying.”</p>\n<p>Wei Wuxian closes his eyes and rests his temple against Lan Wangji’s chest. His steady heartbeat, the slightly uneven cadence of his steps beneath Wei Wuxian — it's comforting, like the rocking of a boat on the waves. </p>\n<p>“I really should walk,” he murmurs to himself, with absolutely no intention of doing so, and the next thing he knows, he’s back in the <em> jingshi, </em>blinking as Lan Wangji sets him down with gentle motions.</p>\n<p>Jiang Cheng hovers like a dark cloud in the doorway, scowling at them. Lan Wangji does nothing to invite him in, so Jiang Cheng just watches them with an air of angry uncertainty, his jaw working.</p>\n<p>“I guess I’ll just go, then,” he says bitterly. “You’re welcome, I guess.”</p>\n<p>“Hey, Jiang Cheng,” Wei Wuxian says. “Don’t go, okay? Thanks for your help today, really. It means a lot that you were there.”</p>\n<p>“Whatever,” Jiang Cheng says, but the hard edge to his expression eases. Suddenly, looking at Lan Wangji, it returns, and twists. “I’d offer to look at your shoulder, but Hanguang-Jun might bite me if I try.”</p>\n<p>“Jiang-zongzhu,” Lan Wangji says, toneless, but it sounds like a warning.</p>\n<p>“Aren’t you tired of cleaning up all of your brother’s scrapes, Jiang Cheng?” Wei Wuxian asks genially, in a feeble attempt at peacekeeping. “You’ve had a lifetime of it by now. Don’t worry about me. Hanguang-Jun has his guqin; I’ll be better in no time.”</p>\n<p>“Sure,” Jiang Cheng scoffs, and leaves. Wei Wuxian stares after him, biting down on his lip and feeling guilty.</p>\n<p>“Since when do you two dislike each other so much?” Wei Wuxian wonders aloud. “Did I miss something?”</p>\n<p>“It is Wei Ying who should be tired,” Lan Wangji says.</p>\n<p>“What?”</p>\n<p>“Of cleaning up his brother’s scrapes.” Lan Wangji’s golden eyes search his; not reproachful, but something softer than it. More like regret.</p>\n<p>Wei Wuxian’s skin prickles at the reference, suddenly uncomfortable. “We’re brothers, Lan Zhan. You would do the same for Zewu-Jun. We don’t tally or keep score. I cover him, he covers me.”</p>\n<p>“Mn,” Lan Wangji says, sounding like he disagrees. Only Lan Zhan could infuse one syllable with a universe of various inflections.</p>\n<p>“You can’t resent him for a choice that I made,” Wei Wuxian points out. “A choice I made very willingly and which he has no knowledge of.”</p>\n<p>Lan Wangji sighs through his nose, and seems like he wants to say more on the subject, but the wince on Wei Wuxian’s face stops the conversation in its tracks, and he says, sternly, “Sit.”</p>\n<p>Too worn to argue, Wei Wuxian sits, and closes his eyes, and for a moment just remains like that. He leans into his own heartbeat, his familiar muscles and bones, and finds that despite the gaping absence of his core (which he’s not sure will ever feel normal), he’s glad to be back in his body. It’s battered and powerless and riddled with scars, but it’s a home to him.</p>\n<p>The silence in the room feels strange and billowing, with none of Wei Wuxian’s teasing chatter to fill it for once — in the past, he’s found that he usually can’t let himself just sit wordlessly with another person. Something in him always itches to fill space with presence. But he doesn’t feel that same pressure with Lan Zhan, as Lan Wangji putters quietly around the room, fetching some herbs and bandages from a drawer, a wet cloth.</p>\n<p>He feels a cool rush of air as Lan Wangji settles beside him, rock-steady, and says, “Wei Ying.”</p>\n<p>“Mn,” Wei Wuxian murmurs, not opening his eyes.</p>\n<p>“How do you feel?”</p>\n<p>“Good,” Wei Wuxian says, and is surprised to find he means it. “I feel okay.”</p>\n<p>When he opens his eyes, Lan Wangji is staring at him with an expression that Wei Wuxian doesn’t know how to name, but it makes a strange hunger cavern out inside of him. The candlelight flickers with the breeze from the open windows, and in the low, warm glow, Lan Wangji’s eyes burn like embers. He’s so beautiful that Wei Wuxian hears himself take a hitched, unsteady breath.</p>\n<p>“Your wound,” Lan Wangji eventually says, and Wei Wuxian realizes he’d been waiting for his permission to begin.</p>\n<p>“Ah,” he says, feeling stupid. “Right.”</p>\n<p>Wei Wuxian unbuckles his belt so that his top layers loosen, and with some grimaced struggling, he shrugs his injured shoulder out of his clothes. The scrapes and puncture wounds are marked almost behind the upper bridge of his shoulder, so he has to twist his head to examine it. Clots of dry blood are caked and crusted all along his skin, but it doesn’t look too serious.</p>\n<p>“I think it just bled a lot,” Wei Wuxian says. “It looks pretty shallow to me.”</p>\n<p>He could probably attempt to clean it on his own, but it’s at an awkward enough angle that it would be far easier for someone else to.</p>\n<p>Lan Wangji extends one uncertain hand with the cloth, and then hesitates.</p>\n<p>“May I…” he starts, then swallows. His ears are pink, Wei Wuxian notices with weary fondness. </p>\n<p>“You can touch me,” he replies, trying to keep the amusement from his voice so Lan Zhan won’t think he’s being teased. He had spent most of his youth in Yunmeng tearing around half-clothed with a gaggle of boys his age, so to see the Lans get so flustered over a bit of exposed skin is still a funny novelty to him.</p>\n<p>Lan Wangji nods and moves behind him, hesitating a moment more before the wet cloth touches his skin. The friction stings a little, but mostly, it feels good to have the congealed blood off of him, so he closes his eyes, rocking his shoulder lightly into Lan Wangji’s steady ministrations.</p>\n<p>“Does it hurt?” Lan Wangji asks quietly, and oh, he’s closer than Wei Wuxian thought. He feels a tingle at the base of his neck, and he squirms a bit in place.</p>\n<p>“No,” Wei Wuxian answers. “I’m tougher than I look, Lan Zhan. I won’t break so easily.”</p>\n<p>“I know,” Lan Wangji murmurs, and <em> this, </em>for some reason, is what makes a zing of heat circuit through Wei Wuxian. </p>\n<p>For a minute, he thinks he feels Lan Wangji’s fingertips brush against the nape of his neck, but maybe it’s just the goosebumps prickling his skin. He suddenly realizes that he’s on edge, but not in a tense way, more in the sense that — he’s hyper-aware of Lan Wangji’s every movement, his every breath. The sensation is taut, electric, like the gathering, building hum of a summer storm.</p>\n<p>Lan Wangji presses some medicine into the wound, which does draw a quiet hiss from Wei Wuxian, before he begins wrapping his shoulder with a nimble expertise that somehow surprises him, as if Lan Wangji isn’t proficient at literally everything he does.</p>\n<p>“So gentle, Lan er-gege,” he murmurs, the endearment slipping from him before he can stop himself, and he knows it was the wrong thing to say by the way Lan Wangji stiffens slightly behind him, the relaxed ease between them suddenly tightening. </p>\n<p>To cover for it, he layers on some desperate flirting. “Now that I’ve wielded Bichen for myself, I know the strength in those hands. Thank you for going easy on me.”</p>\n<p>Lan Wangji steps away. </p>\n<p>“You can bathe here,” he says a moment later. “In the adjoining room. I’ll have hot water brought in.”</p>\n<p>A warm bath, after a few days without one and the day he’s had, sounds absolutely heavenly. He shrugs his robe back on and thanks Lan Zhan for his help, and Lan Wangji nods and steps away, giving him some privacy as he goes to prepare.</p>\n<p>When he does bathe, Wei Wuxian is careful not to get his fresh bandages wet, lowering himself with a soft moan into the warm water. Chunks of dirt and dust slough off his skin like ashes, and for a long time, he just sits with his eyes closed, almost nodding off, before he attempts, poorly, to wash his hair, and then experiences an idiotic moment where he wishes Lan Zhan would do it for him. He would be so gentle and methodical about it, and Wei Wuxian suppresses a quiet ache when the image comes to mind, unbidden.</p>\n<p>He swallows it down, banishes it into a tarry pit where he has buried these errant thoughts with a growing regularity.</p>\n<p>Lan Wangji had hung a clean white inner robe on the side of the privacy screen, and Wei Wuxian slips into it gratefully, shivering in place for a moment, before he pads over into the next room, where he can hear Lan Wangji practicing the guqin.</p>\n<p>Lan Wangji glances up at his entry, and then he does something that Wei Wuxian has never, in the entirety of their acquaintance, witnessed — he messes up, a discordant note pinging from the strings. It’s so startling in contrast with the gentle melody of the piece that Wei Wuxian almost flinches. </p>\n<p>Lan Wangji is looking at him, fathomless in a way that makes Wei Wuxian stop short, uneasy. Surely they’re close enough by now that he doesn’t need more layers to be considered decent? The Lans are such a weird, stiff bunch.</p>\n<p>Lan Wangji drops his gaze back to the guqin, laying his palms over the strings. “I have spare robes you can borrow while your others are cleaned.”</p>\n<p>“Okay,” Wei Wuxian says, rubbing his big toe against his bare heel.</p>\n<p>Lan Wangji excuses himself to bathe then, leaving Wei Wuxian to get dressed and nap for a while until he’s done. The borrowed robes smell like Lan Zhan, crisp sandalwood and some other aroma he can’t quite name. He feels clean and fresh and he <em> finally </em>smells good, and in this honey-warm state he floats in and out of a light sleep, and thinks that Lan Zhan’s bed might be one of the most comfortable he’s ever slept in.</p>\n<p>When Lan Wangji returns, he smells equally good, his pale skin free of blood or mud. It’s sort of oddly shocking, to see him so immaculate again, as if Wei Wuxian has regularly seen him any other way. It makes him look, unfairly, even more like a deity than he did when blood-flecked and mud-soaked.</p>\n<p>Wei Wuxian shakes himself awake, not wanting to be rude, but Lan Wangji softly says, “Wei Ying, sleep.” </p>\n<p>He’s almost tempted to, but Wei Wuxian actually, very much does want to hang out with Lan Zhan, in their time together. Between battles, sect drama, and family spats, it feels like they never have time like this — just to be with each other, the way friends should be.</p>\n<p>“Not tired,” Wei Wuxian says, which is so obviously a lie that Lan Wangji’s eyes narrow a little, but Wei Wuxian stubbornly moves to the table across the room, where a pot of steaming tea is already prepared. The tea of Gusu is too acrid, too medicinal for Wei Wuxian's tastes, but Lan Zhan likes it, and so Wei Wuxian resolves to make himself like it as well.</p>\n<p>Lan Wangji joins him, sitting at the nearest corner of the table rather than directly across from him so that their crossed legs are almost brushing. Then Wei Wuxian kind of just props his chin on his hand and stares while Lan Wangji does things, like holding his white sleeve so it doesn't trail across the table, like pouring two hot streams of tea into their cups. His hair, still damp and raven-black, clings in places to his neck, the silky wet strands framing his face.</p>\n<p>“Your shoulder?” Lan Wangji asks, serving him first.</p>\n<p>“Feels fine,” Wei Wuxian answers, taking the tea. “I kept the bandages dry.”</p>\n<p>Lan Wangji nods. </p>\n<p>“Thank you for, ah,” Wei Wuxian says, and blinks when Lan Wangji gives him a frank look, like he’d said something to displease him. “For today.” </p>\n<p>He doesn’t have the face to say what he really means, which is that it’s been a long time since anyone besides shijie has cared for him like this. Or cared about him at all, really.</p>\n<p>“You are welcome,” Lan Wangji says after another moment, then sips his tea.</p>\n<p>“Now that...now that we have our bodies back, you won’t have to be stuck near me all the time,” Wei Wuxian jokes. His heart kind of hurts when he says it. “You’re finally free, Hanguang-Jun! What will you do with all your newfound liberty?”</p>\n<p>He expects Lan Wangji to scoff a little, to give him a narrow look or roll his eyes, but instead a corner of his mouth turns down. He keeps his eyes lowered. Asks quietly, “Is that what Wei Ying wants?”</p>\n<p>Wei Wuxian blinks. He hasn’t even considered for a moment what he wants. His tired brain hasn’t even really made it past this afternoon.</p>\n<p>“Oh,” he says. “Ah. I just meant — for most people, a little of me goes a long way.”</p>\n<p>“I am not,” Lan Wangji says, coolly as he sets his cup down with a clink, “most people.”</p>\n<p>Wei Wuxian stares. Surely, he’s misinterpreting. There’s no earthly reason why Lan Wangji, who had told him to piss off then threatened to beat his ass within their first few weeks together, wants Wei Wuxian hanging around him like a bad smell, after days of him doing just that.</p>\n<p>But Lan Zhan does not mince words, and he doesn’t lie. </p>\n<p>Wei Wuxian brings the teacup to his lips, and finds his hands are trembling a little.</p>\n<p>“Lan Zhan ah, what a person you are,” he says, weakly. “Saying such sweet things with such a grave face. It’s nice to know you care, after all.”</p>\n<p><em> That </em>was certainly the wrong thing to say. Lan Wangji’s face darkens at once, as close to true anger as Wei Wuxian has seen directed at him in a very long time.</p>\n<p>“Is everything a joke to you?” Lan Wangji says through his teeth.</p>\n<p>Wei Wuxian gapes at him, speechless.</p>\n<p>“When you were missing, I —” Lan Wangji tears his gaze away. Then he says, with the cadence of two punches, “I cared.”</p>\n<p>He adds then, quieter, “It wasn’t enough.”</p>\n<p>“I — I’m sorry,” Wei Wuxian stammers, somewhat appalled by his own callousness. Lan Wangji <em> had </em> searched for him alongside Jiang Cheng, in those three months, at great personal inconvenience. What a tactless, unappreciative thing to say. He curses his own stupid mouth. “It’s just that I — that you —” </p>\n<p>“I thought I lost you,” Lan Wangji whispers. “In the Burial Mounds.”</p>\n<p>The words are a blow Wei Wuxian wasn’t expecting at all. Tears spring to his eyes immediately at the force of it.</p>\n<p>It takes him a moment before he’s capable of responding.</p>\n<p>“Hey, you didn’t,” Wei Wuxian says weakly, swallowing thickly and taking Lan Wangji’s hand in both of his. Lan Wangji doesn’t seem to notice, his eyes haunted and faraway. “Lan Zhan, I’m right here. I’m not going anywhere.”</p>\n<p>Lan Wangji closes his eyes and gives a hard swallow, his long, dark lashes fluttering. He looks ten years younger and ten years older at once. He looks beautiful, open, irresistible.</p>\n<p>Wei Wuxian leans in, before he can stop himself, and kisses him. </p>\n<p>He almost doesn’t mean for it to happen, but then it does — it’s his first kiss, so it turns out sort of shy and chaste, just a warm, clumsy brush of their mouths together, but he feels a molten heat flare through him at the contact.</p>\n<p>Lan Wangji gasps against his mouth, and Wei Wuxian remembers himself, yanks his body back. </p>\n<p>Lan Wangji is staring at him with a stunned, wrecked expression, his light eyes wide and lips parted like he’s just been shamelessly debauched, not barely-kissed.</p>\n<p>Wei Wuxian knows at once, by Lan Wangji’s face, that he’s missed the mark. He’s misunderstood everything. He frantically starts to backtrack, horror and shame welling up from a deep place. </p>\n<p>“I’m so sorry, Lan Zhan,” he begins while Lan Wangji keeps staring at him like that. He ruins everything, he ruins everything, how could he ruin this one shining, important, untouchable thing? “I didn’t mean to — I thought that —”</p>\n<p>His words die at once when Lan Wangji firmly takes the lapel of his robe and pulls him back in, and Wei Wuxian’s startled gasp is swallowed, as well as whatever else he was thinking of saying. This kiss is not so chaste, open-mouthed and wet with a hint of teeth, and so, so good that Wei Wuxian feels the power sapped straight from his limbs. The shock of its rightness feels cosmic. </p>\n<p>After another helpless moment, Wei Wuxian raises his hands, where they’re paralyzed at his sides, to tentatively touch, to cup Lan Wangji’s neck (surprisingly warm), to slide up into his hair, still damp and slightly curling from the bath. He drops one hand to place a palm over Lan Wangji’s heart, where he can feel a pulse hammering frantically against his skin.</p>\n<p>Lan Wangji’s own hands seem frozen, as though he’s not sure what to do, not sure what he’s allowed. <em> Touch me, </em>Wei Wuxian can’t bring himself to beg out loud, but Lan Wangji seems to hear him anyway; his own hands come up, wonderingly, to palm the nape of his neck, then he thumbs his cheekbones, either side of his jaw with such a tenderness that Wei Wuxian's eyes sting. Lan Wangji's hands trail down to his back, along his shoulder blades, his waist, his hips. Wei Wuxian hums an encouraging sound against his mouth, wanting more, and Lan Wangji’s motions grow rougher, nails digging into his skin, dragging him closer, teeth sinking into his lower lip.</p>\n<p>Eventually, the kneeling and the crane in his neck become stiff and awkward, so Wei Wuxian walks himself forward on his knees without breaking the kiss, and almost passes right out when he feels Lan Wangji’s large hand cupping the juncture where the back of his knee meets his thigh, a tentative question. Then he pulls — an invitation. </p>\n<p>Barely breathing, Wei Wuxian allows himself to be manhandled into Lan Wangji’s lap, the change in position effortless with Lan Wangji’s strength lifting him by the backs of his thighs. Wei Wuxian’s legs wrap around Lan Wangji’s waist—<em> much better, </em> he manages to think, with the very few words he still can still process. The new position allows him better leverage, so he deepens the kiss as best as he knows how, his hands sealed fast to either side of Lan Wangji’s face so that no spaces remain between them.</p>\n<p>What both of them lack in experience, they clearly make up for in eagerness; when Wei Wuxian finally pulls himself back for air, his head is whirling with giddy adrenaline, a high more intoxicating than the finest liquor. Lan Wangji nips lightly at his jawbone, his teeth grazing down his neck, and Wei Wuxian’s eyes fall shut, his head tipping back to allow him more access, his breaths embarrassingly loud and jagged in the quiet room. He feels alight in ways he never has, never imagined he could be.</p>\n<p>He lets out an embarrassing sound when Lan Wangji’s teeth find his collarbone, where his robes have slipped down to skin. “Does — does this mean that—” God, his voice is embarrassing. “— does this mean that you have a crush on me?”</p>\n<p>What a stupid question, he thinks later. But it feels strangely important in the moment, and Lan Wangji pauses what he’s doing.</p>\n<p>“Mn,” he says into Wei Wuxian’s shoulder — then, as if he’s afraid he’ll be misunderstood, he adds, more clearly, “Yes.”</p>\n<p>Wei Wuxian is overcome by this. He buries his blushing face into Lan Wangji’s shoulder, grinning madly from ear to ear. “Okay.”</p>\n<p>“Okay,” Lan Wangji repeats, sounding bemused. His hands rub wide circles on Wei Wuxian’s back, which feels heavenly.</p>\n<p>“It’s just that I also have a crush on you,” Wei Wuxian says, keeping his face hidden as he says it, and he feels Lan Wangji go still beneath him. They’re pressed chest to chest, so he can feel Lan Wangji’s breathing stutter, his heart skipping faster in his chest.</p>\n<p>Surely this can’t come as a <em> huge </em> surprise to anyone — again, Wei Wuxian cannot emphasize enough his artless lack of subtlety — but Lan Wangji crushes him tighter to his chest and breathes into his neck, shaking slightly beneath him.</p>\n<p>If Wei Wuxian is being fully honest with himself (which he rarely is), <em> crush </em>doesn’t really begin to cover it, although he has dismissed it as such for a while now because it was easier, less painful. In fact, his poor heart is currently swooning like a lovestruck loon, but he doesn’t want to push it, not when he’s unsure the depth of his feelings will be matched — not when he’s already gotten this. </p>\n<p>“Are you okay?” Wei Wuxian asks after a few moments, growing concerned as the silence and hug stretch on without any hint of stopping. “Did I break you?”</p>\n<p>“Mn,” Lan Wangji mumbles, and Wei Wuxian laughs and presses a kiss to his temple. <em> I love him, </em>he thinks, and the immediacy, the fondness of the thought are as flattening as they are natural, like he’s drawing a breath, like his heart is beating.</p>\n<p>“Lan Zhan, you're so cute like this,” he says instead, cupping both of Lan Wangji’s cheeks so he can properly look at him, so he can drink his fill of Lan Wangji's mouth swollen and wine-red, the gold in his eyes eclipsed by black, his forehead ribbon askew. The unfair, improbable beauty of him. He had missed this face just in the past couple of days more than he ever imagined he could.</p>\n<p>“I missed seeing you,” Lan Wangji says, unconsciously echoing his thoughts as he lays his hands on top of Wei Wuxian’s. He adds, almost inaudible, “I always miss Wei Ying.”</p>\n<p>Wei Wuxian exhales for a long beat, trying to breathe around those words. “All of this endearing honesty, er-gege. Where did it come from all of a sudden?”</p>\n<p>“I couldn’t say it before,” Lan Wangji whispers, his eyes on the floor, and the words feel confessional.</p>\n<p>“Why not?” Wei Wuxian asks, just as quiet. </p>\n<p>“I was afraid,” Lan Wangji says. He adds, impossibly softer, “I couldn’t bear if you hated me.”</p>\n<p>The thought is so inimical to his very core that Wei Wuxian physically starts. “<em>Hate you</em>? Lan Zhan, I could never. <em>Hate you</em>, psh — I’ve always thought you were the smartest person I’ve ever met but I guess I was wrong. That is so dumb. I would beat up any version of me who hated you. I want to beat you up a little bit for even thinking that.”</p>\n<p>Lan Wangji makes a noise into his hair, and Wei Wuxian realizes with a belated thrill that it <em> might </em>have been a half-laugh.</p>\n<p>“Hate you,” Wei Wuxian mutters, still mortally offended. He kisses the spot between Lan Wangji’s eyebrows as though he’s been doing it every day of his life. His nose brushes against the ribbon. “Ridiculous.”</p>\n<p>Then he pulls at Lan Wangji’s robes, topples them both backwards until he’s flat on his back and Lan Zhan is hovering over him, his long hair swinging down and tickling his face. Wei Wuxian tugs his clothes again, insistent, until Lan Wangji understands and carefully lowers his body weight against his, a warm and steady press into the ground. He’s careful to bear down more on the left side, mindful of the twinge in Wei Wuxian’s shoulder.</p>\n<p>Wei Wuxian makes a contented humming noise, wrapping both his arms around Lan Wangji’s shoulders so that he’s hugging him, tight enough that their heartbeats clash against each other’s chests. He kisses the underside of his chin while Lan Wangji just gazes down at him, half-fond, half-mystified, like he’s not quite sure what to do with him.</p>\n<p>“You feel good like this,” Wei Wuxian explains, and kisses him again. Lan Wangji leans into it eagerly, his thigh shifting between both of Wei Wuxian’s, and both of them pull back to take staggered breaths at the sensation.</p>\n<p>“Maybe…” Lan Wangji says slowly, and Wei Wuxian watches with delight as his ears start to glow pink. “This...may be more comfortable on a bed.”</p>\n<p>Wei Wuxian’s mouth falls open in mock-astonishment even as an excited heat bursts through him. “<em>Lan Wangji. </em>So shameless! Is Lan er-gongzi really offering to throw me over his shoulder and bed me? By the heavens, my virtue has never been so besmirched. Such a wicked proposition to defile my temperance and <em>restraint</em>—”</p>\n<p>“Wei Ying,” Lan Wangji says, sounding pained. “I only meant that…” He struggles for a minute, and Wei Wuxian almost feels bad for him. Almost. </p>\n<p>“I’m joking, of course,” Wei Wuxian says with a grin. He loops his arms around Lan Wangji’s neck. “Fine, have your way. Ravish me, Hanguang-Jun.” </p>\n<p>Lan Wangji is unconscious. </p>\n<p>Surely that’s the only rational explanation for how any of this can be happening — he'd knocked himself out fighting the creature earlier, and his subconscious is being extraordinarily cruel in its realism, even crueler than usual, or —</p>\n<p>“Lan Zhan,” Wei Ying says, a hot thrum against his ear. “I can hear you overthinking. Stop it.”</p>\n<p>They’re still standing in the middle of the <em> jingshi</em>, where Lan Wangji had frozen the second they’d pulled themselves up. Wei Ying’s arms drape over his shoulders, and he’s gazing up at him with his cheeks flushed and his lips slightly swollen and his eyes uncannily bright.</p>\n<p>Lan Wangji blinks down at him, and tries to recalibrate.</p>\n<p>“Was the ravishing bit too much?” Wei Ying asks, looking genuinely worried for Lan Wangji’s health. “I was only kidding, really. Sometimes my mouth just starts and I can’t stop it for anything.”</p>\n<p>“I am fine,” Lan Wangji says, returning to the earthly plane.</p>\n<p>“We don’t even have to do anything,” Wei Ying says, taking both of his hands and looking up at him with such sweet earnestness that Lan Wangji’s heart constricts in his chest. “I just want to be close to you. We can just lay down and do nothing, I don’t care. Whatever you want.”</p>\n<p>What Lan Wangji wants could fill this room tenfold. His fear is that he wants too much.</p>\n<p>“I want…” Lan Wangji tries to say, but his mouth has always failed him, when it comes to Wei Ying. He makes a frustrated sound, then finishes, or perhaps supplicates, “Wei Ying.”</p>\n<p>That will have to suffice; it’s not technically incorrect.</p>\n<p>“You have me,” Wei Ying says, easy as anything, and Lan Wangji buries his face in Wei Ying’s shoulder at that, even as Wei Ying huffs a quiet sound of surprise.</p>\n<p>“Ah, poor Lan Zhan,” he says softly, petting his hair, petting his back. “You’re far too good.”</p>\n<p>“Stop,” Lan Wangji says, and Wei Ying laughs, not a trace of mockery in it.</p>\n<p>“Come, come,” Wei Ying says, and Lan Wangji lets himself be guided toward the bed, where Wei Ying lets go of his hands and perches on the edge of the mattress to gaze up at him through his lashes, coquettish.</p>\n<p>“What do you think, Lan Zhan?” Wei Ying leans back in a coy stretch. “I’m far less pretty now than I was yesterday, but you still like me, right?”</p>\n<p>“I would love Wei Ying in any body,” Lan Wangji says, words almost stumbling in his sincerity.</p>\n<p>Wei Ying’s mouth drops open, blood rushing to his face. Then he buries his face in his palms and says several mushed, unintelligible things there. Lan Wangji waits patiently.</p>\n<p>“You can’t say things like that to me, Lan Zhan,” Wei Ying whines a moment later, when he’s finally coherent. He looks at Lan Wangji with something bordering on despair. \"<em>Please, </em>I really can’t handle it at all.”</p>\n<p>Had it been too much to say out loud? It’s only true. Lan Wangji feels a great sense of unburdening — the weight of those unspoken truths had crowded his throat until he couldn’t breathe, and now, Wei Ying will know it all. As he deserves to.</p>\n<p>“Lan Zhan.” Wei Ying is staring at him, a strange glow in his face. “Come here.”</p>\n<p>Lan Wangji does.</p>\n<p>Wei Ying scoots to the edge of the bed so that his knees fall apart, and he takes Lan Wangji’s hands again and tugs him so that he’s standing between his open legs. He only has two of Lan Wangji’s lighter robes on, cinched at the waist by a simple cloth belt, and he gently guides one of Lan Wangji’s hands to his hip. It’s a tentative question, and an invitation.</p>\n<p>Lan Wangji takes a steadying breath, heart in his throat, and pulls at the belt so the robes loosen, slackening so they spill off of Wei Ying’s shoulders and collarbones. Wei Ying’s eyes are closed, his eyelashes a sooty sweep against his cheekbones. As though he’s waiting for something with bated breath.</p>\n<p>Lan Wangji wants to push him down into the bed and take him apart until he cries, tear off the rest of his clothes with his teeth, if he needs to, but he can’t — he isn’t sure what he’s allowed to — what Wei Ying prefers — He nearly shakes with the restraint of it.</p>\n<p>Wei Ying opens his eyes to gaze up at him through his lashes; pupils wide and dark, thin rings of silver like a lunar eclipse.</p>\n<p>“Are you really going to make me beg, Hanguang-Jun?” he asks in a low voice, bunching his fingers in the front of Lan Wangji’s robes. “What more can I do to persuade you to touch me?”</p>\n<p>This, finally, is all Lan Wangji needs to hear. </p>\n<p>In one smooth movement, he pins Wei Ying’s shoulders to the mattress, tipping them both so fast that Wei Ying yelps in surprise. He gathers Wei Ying’s wrists in one hand and anchors them above his head as Wei Ying sounds his approval and looks up at him with his lips curving, his eyes rapt with anticipation and — and something else more intense. The edge of something tender and hungry in equal measure. Lan Wangji inclines his head to drag his teeth along Wei Ying’s neck, keeping his wrists firmly planted into the mattress as he does, and Wei Ying shudders out a breathy, high-pitched sound and rolls his hips into him.</p>\n<p>“Too many clothes, Lan Zhan,” he whispers then, and Lan Wangji doesn’t hesitate to comply.</p>\n<p>His hands make surprisingly fast work of Wei Ying’s robes, as though he’s been doing this for years, and Wei Ying murmurs encouragement to him, lifting himself to one elbow and wriggling a little to help with the process.</p>\n<p>Lan Wangji has caught glimpses, flashes, pieces of Wei Ying’s exposed skin over the years — a wrist here, a collarbone there, the nape of his neck when his hair is tucked up into a bun or parted to one side. Each one had seared itself into his memory, had shot him through like an arrow with helpless, crazed longing that he could never rationalize or meditate away. </p>\n<p>So for a moment, at the sight of Wei Ying almost all but bare to him, he can do nothing but sit back and stare dumbly, his breath tight in his throat and his fists clenching. Again, he takes a moment to wonder if he's dreaming. </p>\n<p>“Help me,” Wei Ying says with a laugh as he struggles with his tangled trousers, oblivious to how he’s being looked at, and like a man possessed, Lan Wangji allows himself to reach out. </p>\n<p>Finally, it’s his own hands on Wei Ying’s body, peeling away layers. Lan Wangji can’t stop looking, committing everything to memory, starving like a caged animal to feel, consume. He aches to touch, but slows his trembling hands until Wei Ying catches them in his.</p>\n<p>“Er-gege,” Wei Ying croons, and Lan Wangji’s breathing stops in his chest. Wei Ying lays back against the pillows, his hair an inky spill behind him, looks Lan Wangji in the eye and says, equally breathless, “Kiss me.”</p>\n<p>Lan Wangji doesn’t need to be asked twice. In one surge, his mouth finds Wei Ying’s, a warm press that opens up into something harder, deeper, filthier. Lan Wangji drinks in every sound from him, every stuttered breath and soft gasp as their tongues tentatively, then more earnestly explore each other. He hadn’t imagined — when he did allow himself to imagine it — that such a sensation could possibly be enjoyable, but Wei Ying is in the habit of proving him wrong in only the best of ways. This feels like a staked claim. </p>\n<p>They kiss for what could be hours. Time seems to warp, soften, bending around them like river currents. Wei Ying occasionally breaks apart to murmur something tender against Lan Wangji’s mouth before he pulls him back in, as if unable to stop. </p>\n<p>When Lan Wangji at last pulls away to catch a full breath, he finds himself light-headed, his mouth slick and bruised, kiss-swollen. Wei Ying’s eyes devour every pore of his face, night-dark and ravenous, and for the first time, Lan Wangji can see clearly his own desire mirrored back at him. He wouldn’t have thought it possible before, but the hard, hot press of Wei Ying into his hip confirms the unbelievable — that Wei Ying wants this, wants him in turn.</p>\n<p>“You’re so…” Wei Ying whispers, a hand drifting up to frame his cheek, stroking a thumb there. Lan Wangji ducks his head to press a gentle kiss into his palm, and Wei Ying sucks in a fast, sharp breath. </p>\n<p>He pulls Lan Wangji down then, closer until their foreheads are resting against each other, the ribbon pressing into his skin.</p>\n<p>“I think I really love you,” Wei Ying whispers into the space between them. “I think I’ll love you for my whole life.”</p>\n<p>Something breaks in Lan Wangji at those words, like ice floats cracking and giving way into summer warmth. The water roars around him, over his head, and it takes Wei Ying’s laughter into his mouth to realize he’d started kissing Wei Ying frantically again, pulling kiss after kiss out of him.</p>\n<p>“Is that a ‘me too?’” Wei Ying asks when he pulls back, only a sliver of uncertainty in his voice.</p>\n<p>“Yes,” Lan Wangji whispers, so earnest that Wei Ying’s face breaks into a smile like the sun from behind a cloud. “This life and the next, and the next.”</p>\n<p>Wei Ying’s eyes widen, and he starts muttering again as he presses his burning face into Lan Wangji’s bare shoulder.</p>\n<p>“I can’t take it at all when you talk to me like that,” he says, muffled. “Hanguang-Jun, warn me first, please?”</p>\n<p>In place of an answer, Lan Wangji pulls back and kisses Wei Ying’s forehead. Then both of his closed eyelids, his nose, a chaste brush to his lips, his jaw. Wei Ying starts to squirm, ticklish under Lan Wangji’s touches, then swallows a gasp as Lan Wangji kisses behind his ear, sinks a light bite into his earlobe, then nips downward, down the graceful lines of his neck.</p>\n<p>“Lan Zhan — ” he says faintly, but Lan Wangji doesn’t stop, sealing kisses to his collarbones, over his heart. He sinks his teeth with the lightest pressure over one of Wei Ying’s dark nipples, and Wei Ying groans in shock and rocks his hips against him in small, circular motions. </p>\n<p>All of this, every touch — shameless, <em> forbidden, </em>but Lan Wangji would take a stroke of the discipline whip for each kiss he can press into Wei Ying’s skin. Nothing else in the world matters besides this.</p>\n<p>After the buds of Wei Ying’s nipples are slick and hard, after Wei Ying is panting raggedly, Lan Wangji kisses the Wen brand, a reclamation of that sun for himself, and as though he understands, Wei Ying digs his fingers harder into Lan Wangji’s shoulders. Lan Wangji dips lower then, traces the shape of the large, welted scar under his navel with his tongue. Wei Ying’s responding whine rips through him like a bolt of lightning.</p>\n<p>“You don’t have to—” Wei Ying protests, his abdominal muscles twitching under his mouth, but Lan Wangji ignores him and continues what he’s doing until Wei Ying is making these soft, wounded sounds, interspersed with whispers of his name.</p>\n<p><em> Beautiful, </em> Lan Wangji thinks, and he must murmur it out loud because Wei Ying gasps, “<em>Don’t— </em>” and buries his fingers in Lan Wangji’s hair.</p>\n<p>It isn’t often that Wei Ying is rendered speechless, and Lan Wangji takes a private moment to feel smug about it as he dips lower, where he can feel heat and hardness and Wei Ying's scent, earthen and heady.</p>\n<p>Wei Ying props himself up on his elbows to stare down at Lan Wangji, eyes wide in the muted silver of the moonlight through the <em> jingshi </em>windows, his chest heaving. Good. Lan Wangji wants him to look for this. Wei Ying watches him down the length of his body, his expression warring between nervous anticipation and a hungry yearning that makes Lan Wangji’s blood hot as sunlight, thrumming through him.</p>\n<p>Lan Wangji locks eyes with him so that he has the privilege of watching Wei Ying’s head tip back, his eyes screwing shut and his mouth falling open as Lan Wangji takes him in his mouth. <em>Finally, </em>is all he can think.</p>\n<p>Wei Ying makes a strangled, wild sound and his hips jolt at the sensation; Lan Wangji chokes immediately, pulling off for air and eyes watering as Wei Ying pets at his hair and murmurs, “Sorrysorrysorrysorry.” Lan Wangji shakes his head at him, a wordless reminder that apologies aren’t needed, and Wei Ying’s hands slow, stroking his cheek until Lan Wangji resumes what he was doing with renewed vigor. He palms the inside of Wei Ying’s knee with one hand, using the other to neatly tuck his hair and the tail of his forehead ribbon away from his face, where they won't get in the way.</p>\n<p>Lan Wangji is nothing if not a fast and studious learner, and he soon finds a rhythm and position that draw the most vocal reactions. Wei Ying’s fit of apparent speechlessness passes, as does Lan Wangji’s smugness over the matter — Wei Ying soon starts babbling, one rushed and breathy sentence after the next.</p>\n<p>“You’re so good at this, how are you so good at this like you are — <em> hah — </em> at everything else, Hanguang-Jun? <em> Ah, </em> mercy, mercy<em>, </em> please — what would others say, Lan er-gege, if they saw you like this? <em> Fuck — </em>” The first curse word is wrung from him as Lan Wangji takes him deeper, slower. “You’re too much, you’re too much, please — L-Lan Zhan, did you know I thought about this, back in our early days? Except it was reversed, I would kneel for you in the library and take you apart —”</p>\n<p>This Lan Wangji cannot abide; he pulls off with a <em> pop </em> and says, hoarsely, “Wei <em> Ying</em>,” but it comes out much more a plea than a protest.</p>\n<p>Wei Ying, full-body flushed even in the low light, smirks at him and reaches down, gently thumbing the shell of his ear, which is of course on fire. “Such an upright gentleman, Hanguang-Jun — I would have never thought that you’d be so — <em> agh!</em>”</p>\n<p>Lan Wangji had bent his head to nip at the soft inside of Wei Ying’s thigh in admonishment, then again, sinking his teeth in lightly.</p>\n<p>“Biting, Lan Zhan?! So <em> uncivilized,</em>” Wei Ying gasps between breathless giggles. “Okay, okay, I’ll be quiet if you get back to what you were doing — I’ll be so quiet and good — <em> yes</em>, right there, <em> please — </em>”</p>\n<p>Wei Ying is far from quiet, but Lan Wangji drinks in each of his words and sounds like a willow parched of water. On a particularly sharp cry, Lan Wangji pulls off again, ignoring Wei Ying’s outraged, feral noise of protest, to whisper, “Quieter, Wei Ying,” because the <em> jingshi </em> is not so far from the <em> hanshi </em>or from shufu’s quarters, and Wei Ying is currently breaking several noise prohibition rules.</p>\n<p>“Make me,” Wei Ying throws back, and grins crookedly when Lan Wangji glares at him without any heat. His eyes suddenly widen, as though he’s discovered something new about himself. “...Could you really make me, Lan Zhan?”</p>\n<p>“Later,” Lan Wangji says, already distracted by the view and the primal need to get back to the task at hand. He is not, in fact, made of hard jade as everyone claims.</p>\n<p>Wei Ying is still trembling with sensation, his thighs already shaking when Lan Wangji swallows him down again. The renewed effort starts up another round of Wei Ying’s soft cries, and Lan Wangji is far too turned on to stop him again. Despite the soreness in his jaw, he works Wei Ying more earnestly when his stammered words become less and less intelligible.</p>\n<p>“I’m going to —” Wei Ying eventually says in a wild voice, trying to push Lan Wangji’s shoulder in a feeble attempt to warn him. “Lan Zhan, you don’t have to —”</p>\n<p>Lan Wangji steels his hands in an iron grip to Wei Ying’s hips, pinning him to the bed so he won’t buck. When he fixes his gaze to Wei Ying’s, Wei Ying’s eyes are glazed, his mouth ajar, and Lan Wangji makes his intentions clear there.</p>\n<p>“<em>Fuck</em>,” Wei Ying says, heartfelt, and he comes. Lan Wangji almost gags and chokes at the suddenness of it, but presses Wei Ying down firmly as he swallows, evening out the stuttering thrusts of his hips.</p>\n<p>Lan Wangji keeps going until Wei Ying is spent, until he collapses back boneless on the mattress, thighs intermittently jerking with the overstimulation, and he whispers, “Mercy, Lan Zhan, mercy,” and only then does Lan Wangji pull away, sealing a kiss to his hipbone.</p>\n<p>“Come here right now,” Wei Ying demands when he can speak again, grabbing for him, and then he hugs Lan Wangji’s head so that his face is buried in his chest. Wei Ying presses a tired kiss to his hair. “So good, my Lan Zhan. I concede, I concede graciously — you win, even at this.”</p>\n<p>“Good?” Lan Wangji asks, curious for feedback. His voice is muffled into Wei Ying’s overheated skin. </p>\n<p>“<em>Good? </em>I think you’ve ruined me for life,” Wei Ying wheezes. “This is all I’m ever going to want until I die.”</p>\n<p>Lan Wangji hums into Wei Ying’s chest, ignoring the bird wing flutter in his ribcage at the inherent promise there. It feels dangerously like hope, so dizzying in scope that he can hardly fathom it, so he tries to push it down and bury it.</p>\n<p><em> For life, </em>he keeps hearing in Wei Ying’s voice, echoing like thunder in his ears.</p>\n<p>After another moment like this, Lan Wangji shifts with discomfort. He’s so hard that a pointed ache throbs behind his navel, a concentrated heat, but he can’t care, not being pressed so close to Wei Ying so loose and affectionate like this. His pleasure is secondary, and that’s exactly how he wants it.</p>\n<p>Wei Ying evidently doesn’t think so, because he pushes at Lan Wangji’s shoulder and says, “Hey, you’re not falling asleep, are you? Surely you don’t think I’m so heartless?”</p>\n<p>“Wei Ying,” Lan Wangji says, half-wry as Wei Ying flips them so Lan Wangji is on his back, but despite himself, his breathing staggers, his heart pounding against his ribs at the thought of Wei Ying touching him. Wei Ying settles so that his knees are bracketed around Lan Wangji’s hips, their laps flush together.</p>\n<p>“You’re far more dressed than I am,” Wei Ying complains, starting to tear at the layers. “Tell me how that’s fair? I haven’t spent days inside this body trying to avoid looking or touching only to be denied so cruelly now.”</p>\n<p>Lan Wangji reaches up to help, their trembling hands knocking and brushing together as they both work at Lan Wangji’s layers until his chest is fully exposed to the night air, humming with the whir of crickets and their shared breaths. Wei Ying runs his hands greedily over his collarbones, his pectorals, across the flat and hard expanse of his abdominal muscles to the trail of hair that leads to his waistband.</p>\n<p>Then, to Lan Wangji’s surprise and dismay, Wei Ying starts laughing, and stops what he’s doing to bury his face in his hands.</p>\n<p>“Wei Ying?” he says, uncertainly. He can’t tell if he’s being laughed at, and if so, how he should feel about that.</p>\n<p>“I’m sorry,” Wei Ying says, resurfacing. “Oh, I’m sorry, it’s not you at all, that timing was so rude of me, you’re just — so perfect that it feels fake. And I’m marveling at my luck, and also your judgment by having anything to do with me.”</p>\n<p>Lan Wangji starts to sit up, determined to flip Wei Ying back over and show him, <em> again, </em>exactly why he’s wrong, but Wei Ying pushes his shoulders back to the bed and says, “No. My turn.”</p>\n<p>His hand picks up where he left off, trailing down his chest and torso, then lower. The touch leaves fire in its wake, a burn that stings on Lan Wangji’s skin. Lan Wangji tries to control his breathing, bites down on his lip to keep from making any noise. </p>\n<p>Then, as if he doesn’t think anything of it, Wei Ying spits into his palm, twice for good measure, before his fingers dip below Lan Wangji’s waistband, taking him in hand. </p>\n<p>Lan Wangji arches into the touch, breathing out hard through his nose. Even in the darkness, he can see how red Wei Ying has become, touching him this way.</p>\n<p>“I see that Hanguang-Jun is well-endowed in every respect,” Wei Ying murmurs, flushing more even as he offers Lan Wangji a wide, teasing smile.</p>\n<p>“Shameless,” Lan Wangji whispers, and Wei Ying grins harder.</p>\n<p>“Ah, Lan Zhan, you like that about me,” he says, and with his free hand, finally strips Lan Wangji of the last of his clothes. The cool evening breeze sweeps over his exposed skin, and he tries to breathe evenly through the onslaught of sensation, of the physical weight of Wei Ying’s burning gaze on him.</p>\n<p>Wei Ying, for a moment, just sits back on his heels and stares, until Lan Wangji cannot bear the heat of it a moment longer and implores, “Wei Ying.”</p>\n<p>Wei Ying visibly shakes himself, then leans forward so that he lowers himself on top of Lan Wangji, chest to chest. This close, Lan Wangji can feel the searing heat of Wei Ying against his stomach, already half-hard again, but Wei Ying doesn’t seem to notice. He kisses Lan Wangji with an intensity that steals the breath from him, a warm rhythm of teeth and tongue. As he does, his hand finds Lan Wangji again, and aligning their hips, he strokes the two of them together in hand. </p>\n<p>Lan Wangji jerks into Wei Ying, skidding against his bare stomach with a force that judders the both of them. He bites off sounds into Wei Ying’s mouth, and Wei Ying whispers, “Lan Zhan, I want to hear you,” and at this, Lan Wangji can’t help but make a small noise, a near-whimper. Wei Ying’s eyes darken at the sound, and he lowers his head to murmur to him.</p>\n<p>“You’re so good,” Wei Ying rasps, low into his ear, and he sucks at the skin just below, marking it with teeth. “You’re so, so good, Lan Zhan, no one deserves you —”</p>\n<p>Lan Wangji tries to protest, but Wei Ying fists them then in a way that makes them both groan, a vocal hum against each other’s skin.</p>\n<p>Every point of contact between their body sparks. Lan Wangji has never been so painfully hard in his life, so dizzying close to coming that it nearly hurts, a jagged edge. He can’t help but stagger his breathing into Wei Ying’s hair.</p>\n<p>“Does it feel good?” Wei Ying keeps going, teeth skimming Lan Wangji’s earlobe. “I want you to feel good, I want to see you —”</p>\n<p>“Yes,” is all Lan Wangji can gasp out. “Wei Ying.”</p>\n<p>Wei Ying ducks his head to look down at their bodies, his breaths accelerating at the sight.</p>\n<p>“<em>Fuck,</em>” he whispers again, sounding dazed. “You feel so good, you feel so — <em> Lan Zhan — </em>”</p>\n<p>It’s only Wei Ying’s hand on him, and it’s only been a few moments, but Lan Wangji can feel some sweet edge cresting within him, so intense he feels the shock of it in his throat, in his teeth. He had already been close before — just the experience of bringing Wei Ying off had done that. As though to anchor himself, one of his hands twists into the sheets, the other clawing into Wei Ying’s shoulder, sure to leave a mark. Wei Ying’s hand speeds up, his words faster and dirtier in Lan Wangji’s ear, until Lan Wangji arches with a snap of his hips, gasps and chokes out his name, and then it’s over in a starburst of white, seemingly as fast as it had started. </p>\n<p>Through the rush of sensation, he is dimly aware that Wei Ying follows, coming for the second time with a muffled cry into his neck, shuddering in violent tremors. Wei Ying kisses him through the aftershocks of it, his motions slowing as Lan Wangji wilts bonelessly back into the bed. </p>\n<p>Lan Wangji is shaking, his breaths labored against Wei Ying’s mouth. Both of their bodies are a slick tangle, between the sweat and other fluids.</p>\n<p>Wei Ying breaks away from the kiss to sink lower down his body, his tongue lapping at the mess on his stomach even as Lan Wangji wheezes both in protest and a new spike of arousal, despite how spent he is. “Wei <em> Ying</em>.”</p>\n<p>“What?” Wei Ying asks, frowning up at him. His cheeks are still rose-patched, his eyes dazed and bright. “You did it for me. It’s only fair.”</p>\n<p>Lan Wangji is utterly incapable of saying a single thing. He can hardly think. Everything is starting to catch up to him in wave after sensory wave, now that the haze of lust is fading, and he can barely begin to process it.</p>\n<p>Wei Ying crawls back up to lay their sticky chests together again, tucking his head comfortably under Lan Wangji’s chin.</p>\n<p>“Good for you, too?” he asks, sleepily.</p>\n<p>“Mn,” Lan Wangji whispers, afraid to say anything else at the moment.</p>\n<p>“Your poetry astounds, Hanguang-Jun.”</p>\n<p>“Can write Wei Ying poetry, if he wishes,” Lan Wangji murmurs, kissing the top of his head.</p>\n<p>“I would <em> die,</em>” Wei Ying informs him, his arms curling closer around Lan Wangji’s sides. “I would perish on the spot.”</p>\n<p>“Hm. No poetry, then.”</p>\n<p>For several moments, they just lie together, their breaths gradually slowing to match each other’s. Lan Wangji strokes a hand through Wei Ying’s hair, still silken from the bath and damp with sweat, and Wei Ying hums and nuzzles into the touch like a cat.</p>\n<p>Then Wei Ying reaches one tentative hand toward Lan Wangji's forehead, offering a quiet laugh. \"I can't believe you kept this on the whole time. It's all crooked and, ah...stained now.\"</p>\n<p>\"I forgot,\" Lan Wangji says honestly. He would clean it later.</p>\n<p>He keeps his breaths even as Wei Ying's hand hesitates, then stills.</p>\n<p>\"Can I...\" Wei Ying asks, quietly and with an endearing (and unusual) level of deference, and Lan Wangji suppresses a smile, barely.</p>\n<p>\"You may,\" Lan Wangji replies, and is somewhat surprised to see that Wei Ying's fingers are trembling as he tugs at the silken band, freeing it from the loose knot that had only grown looser from their activities.</p>\n<p>\"Wo-ow,\" Wei Ying says, holding it in his hands while Lan Wangji's traitorous heart thumps, thumps, thumps madly. \"I really thought with all that fuss that I would at least get special powers from this or something.\"</p>\n<p>\"Not quite,\" Lan Wangji says, amused despite himself.</p>\n<p>Not being Lan, Wei Ying can't possibly understand the true meaning of what it means for Lan Wangji to give him the ribbon, even if Wei Ying does know in a roundabout way that it is significant. Although Lan Wangji had reacted with appropriate outrage whenever Wei Ying did mess with it during their time together, the forehead ribbon in truth has belonged equally to Wei Ying for a long time. In Cold Pond Cave, Lan Wangji had known fully the pact he was entering into by handfasting with Wei Ying, according to rules etched into him for as long as he can remember. He'd known it meant that there could never be another. He had done it anyway, with no hesitation.</p>\n<p>As though echoing his thoughts, Wei Ying ties one end of the ribbon to his wrist, then almost shyly, like he's not sure he's allowed, he takes Lan Wangji's wrist and does the same. Lan Wangji's whole being aches with a fierce joy.</p>\n<p>“Okay, so, no poetry,\" Wei Ying says, curling back into Lan Wangji's chest and closing his eyes. \"Can you sing for me instead, Lan Zhan? That one you sang for me in the cave?”</p>\n<p>After a moment, in a low, melodious hum, Lan Wangji does.</p>\n<p> </p>\n<p align=\"center\">—</p>\n<p align=\"center\"> </p>\n<p>So, once again, Wei Wuxian had finally gotten Lan Zhan in bed — this time in the <em> proper</em>, sexy context — and it had absolutely wrecked his poor, virginal, unsuspecting mind.</p>\n<p>Lying there with Lan Zhan, he still feels flush with sense-memory, sort of disbelieving at his own wantonness as he replays the scenes, but — well, actually, no, he believes it. He’s mostly wondering how he’s ever going to occupy the same space as Lan Zhan and not immediately jump him, regardless of their audience. Now that this door has been cracked open, Wei Wuxian wants with a fierceness that aches down to his marrow; he wants and wants and wants.</p>\n<p><em> Is that what it feels like for everyone</em>? he wonders as he draws light circles around Lan Wangji’s nipple with his thumb. It can’t be that good for everyone. How on earth would anyone get anything done? Already, he’s plotting out his next week so that he won’t have to leave the <em> jingshi.  </em></p>\n<p>Oh, there’s the big conference with the different sects tomorrow morning, but Wei Wuxian has never felt less inclined to attend. He thinks that despite Lan Wangji’s rule-following streak, he might actually agree. Lan Qiren might bastinado Wei Wuxian out of existence if he suspects him of keeping GusuLan’s shining disciple away from important sect duties, especially to go off and deflower himself with the cultivation world’s current least favorite person, but Wei Wuxian thinks it might be worth it.</p>\n<p>Lan Zhan had very considerately cleaned them up with a wet cloth, so now Wei Wuxian is curled up into his side, his arm thrown over his chest and his ear pressed to the rhythmic drum of Lan Wangji’s heartbeat. The windows are still open in the <em> jingshi</em>, and rain has started to fall in the Cloud Recesses, pattering in the leaves of the trees. A crisp breeze gusts over them every so often, cooling the sweat on their bodies. </p>\n<p>Wei Wuxian thinks that he could die happy like this, except then he wouldn’t get to try out other things on Lan Zhan, which he’s very much looking forward to as soon as his energy returns.</p>\n<p>“Lan Zhan,” he murmurs, brushing lips over his skin. “Are you happy?”</p>\n<p>Lan Wangji's answer is immediate and steady. “The most.”</p>\n<p>Wei Wuxian tucks into him closer, squeezing his eyes shut against a smile. “Me too.”</p>\n<p>One of Lan Wangji’s graceful hands idly strokes up and down Wei Wuxian’s back, occasionally pausing to trace the figure for <em> ai </em>with his fingertip. The other is still tied to Wei Wuxian's, their fingers intertwined.</p>\n<p>“Lan Zhan,” Wei Wuxian says again, his eyelids drooping. “How long?”</p>\n<p>“Hm?” Lan Wangji answers a moment later, as though pulled from thought.</p>\n<p>“When did you start liking me?” Wei Wuxian says, unsticking his cheek from Lan Wangji’s chest to look up at him. “Tell me, I’m curious.”</p>\n<p>If Wei Wuxian didn’t know any better, he would say it’s a half-smile that pulls at the corner of Lan Wangji’s mouth. </p>\n<p>“Guess,” he says.</p>\n<p>Wei Wuxian grouses for a moment. Patience is not one of his virtues, and of course Lan Wangji wants to play games like this. </p>\n<p>“Fine. Was it…” He thinks for a moment, mentally flipping through their interactions. “After we spoke on the roof, that night in Qinghe?”</p>\n<p>Lan Wangji huffs, as though incredulous. “No.”</p>\n<p>“Later than that?”</p>\n<p>“Earlier.”</p>\n<p>Wei Wuxian is more alert now, suddenly very keen on getting the answer. “When we were apart for all those months, you realized in a fit of passion that you loved me for my body, and I was the only one you could ever love forevermore?”</p>\n<p>Lan Wangji still sounds amused. “No.”</p>\n<p>“<em>Still </em>earlier than that?”</p>\n<p>“Mn.”</p>\n<p>“Lan Zhan,” Wei Wuxian says, surprised. “Who knew your face was so thick? I really thought you didn’t like me at all.”</p>\n<p>“Wei Ying is oblivious,” Lan Wangji replies, which is rude but completely called for.</p>\n<p>“Fine, fine. <em> Oh, </em> I know — when we were trapped in the cave for all those days with the Tusha Xuanwu. You sang me your song you like so much; you were <em> so </em>angry when I brought up Mianmian, hahaha —”</p>\n<p>“No,” Lan Wangji says, and Wei Wuxian sits up. The urge to tease is gone; something new has replaced it, a sudden desperation to know the truth.</p>\n<p>“When I offered to carry you?” he tries, weakly.</p>\n<p>“No.”</p>\n<p>Wei Wuxian thinks harder, his heart pounding. “Cold Pond Cave, and then the lanterns —”</p>\n<p>“No.”</p>\n<p>“Lan Zhan,” Wei Wuxian says, his treacherous voice starting to shake a little. “You can’t mean that —”</p>\n<p>“Keep guessing,” Lan Wangji says softly, rubbing his hand up and down Wei Wuxian’s arm in soothing circles.</p>\n<p>“Surely it can’t be that month in the library, or in class,” Wei Wuxian says. “I was such a shit to you.”</p>\n<p>“You were,” Lan Wangji agrees, “and the answer is still no.”</p>\n<p>“Is this fun for you?” Wei Wuxian says in a wobbly voice. “Are you trying to make me cry?”</p>\n<p>Lan Wangji gazes at him with heartbreaking fondness. His thumb sweeps tenderly under one of his eyelids. “Please don’t cry.”</p>\n<p>“The roof,” Wei Wuxian whispers. “Here in the Cloud Recesses, that first night?”</p>\n<p>Lan Wangji doesn’t say anything to this, but his silence answers him. Wei Wuxian feels like an earthquake has rocked him to the core.</p>\n<p>“Lan Zhan, since then?” he asks. It comes out choked. “But — but you — you were so angry that night, you hated me so much —”</p>\n<p>“Wei Ying is oblivious,” Lan Wangji repeats, but he says it so gently that it sounds like a love declaration.</p>\n<p>“Lan Zhan, you...ridiculous…” Wei Wuxian kisses him again, a fierce press to his lips, and Lan Wangji sways into it with a soft noise. “What were you going to do about it if this hadn’t happened, huh? Stay silent forever while I stupidly missed out on all of this?”</p>\n<p>“I did not think…” Lan Wangji says, then closes his eyes, a furrow drawing between his brows. “I did not think it was a possibility. I couldn’t...imagine that you...”</p>\n<p>“Lan <em> Zhan,</em>” Wei Wuxian protests. “I like you so much! I’ve never kept that a secret. I’ve had a crush on you for ages — you know that’s what people mean when they flirt, right?”</p>\n<p>“Wei Ying flirts with everyone,” Lan Wangji points out, again fairly.</p>\n<p>“But I flirt with you the <em> most. </em>Obviously.” Wei Wuxian sniffs, his eyes still feeling watery. “No, it’s my fault. I’m bad at this kind of thing, I’m really awful at it.”</p>\n<p>“No,” Lan Wangji says firmly, which is so obviously untrue, but the fact that he says it anyway makes Wei Wuxian’s heart swell. He squishes Lan Wangji’s cheeks in a sudden fit of affection, then kisses his nose like he did earlier in the cave.</p>\n<p>Lan Wangji just gazes at him patiently as he does it, his gaze so hearth-warm that something melts in Wei Wuxian like butter in the sun.</p>\n<p>“You should mark your words, Lan Zhan,” Wei Wuxian warns, nestling his face into Lan Wangji’s neck. He latches on to him with all four limbs to illustrate his next point, tangling their bodies together even further. “You’re going to end up stuck with me forever, and then you’ll regret it when I cling like a burr to you and won’t leave you alone.”</p>\n<p>“Please,” Lan Wangji says, heartfelt, “never leave me alone,” and Wei Wuxian obviously can’t do anything else in response to that but kiss him again, and again.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p align=\"center\">—</p>"
}