{
  "id": "23725510",
  "url": "https://archiveofourown.org/works/23725510?view_full_work=true",
  "author": [
    "FoiblePoibleNoibleWoible"
  ],
  "title": "Unwanted Friends",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "Avatar: The Last Airbender"
  ],
  "relationships": [
    "Aang & Zuko (Avatar)",
    "The Gaang & Zuko (Avatar)"
  ],
  "characters": [
    "Aang (Avatar)",
    "Zuko (Avatar)",
    "Katara (Avatar)",
    "Sokka (Avatar)"
  ],
  "additional_tags": [
    "Platonic Soulmates",
    "Soulmates",
    "Episode: s01e13 The Blue Spirit",
    "Angst I guess",
    "Implied/Referenced Child Abuse",
    "i haven't written that bit yet",
    "but its zuko so",
    "wow i wrote it anf its not implied",
    "Child Abuse",
    "Ozai (Avatar) is an Asshole",
    "someone needs to punch ozai",
    "in the dick",
    "Panic Attacks",
    "discussions of treason"
  ],
  "language": "English",
  "series": "",
  "published": "2020-04-19",
  "completed": "2020-05-24",
  "words": "16,840",
  "chapters": "6/6",
  "comments": "826",
  "kudos": "15,530",
  "bookmarks": "3,726",
  "hits": "169,176",
  "summary": "<p>Aang knew those swords. He’d seen them every day, felt the warm, if rough, presence of their owner in all his hardest moments and coldest flights. He was a strong figure, gentle in his own way. A Firebender who still used swords.</p>\n<p>***</p>\n<p>There needs to be more platonic soulmate AUs, you guys. Come on. Who wants to see Zuko get dragged into his redemption arc by his soulmates?</p>\n<p>jesus fucking christ i acually finished it<br>i wasn't expecting it to ever happen but it happened</p>",
  "notes": "<p>im gonna go ahead and assume you've already read the fic this was inspired by (if not then do that and come back here later it's amazing and also i don't provide context) but if you haven't then it's the gaang as time travelling soulmate ghosts. The only big official detail i changed from the au it was inspired by was Zuko's mark</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>kudos comment subscribe this was meant to be a two-shot will this nightmare ever end</p>\n<p>this'll update on Sundays i think (it has been Sunday for 17 minutes but oh well that counts) (this depends on when i finish the rest of it and also how much restraint i have but every Sunday is the longest it should take so)</p>\n<p>okay so i just really wanted to watch someone watch zukos agni kai so i did that</p>\n<p>(a lot of details about zukos childhood came from TunaFishChris's fic btw, as you may have already noticed but still i gotta credit properly right?)</p>\n<p>(shameless self-promotion: if this made you sad, I've got a series where Zuko convinces the gaang he's actually his twin brother Li i promise it's very dumb)</p>\n<p>i have a Tumblr if y'all care. I've not got anything about this series there, but if you wanna drop me an ask about it or whatever... https://www.tumblr.com/blog/foiblepnoteworthy</p>\n<p>first of all im sorry that i keep just adding more chapters to my estimate. this is a problem for me as much as it is for you. i think its gonna stay where it is now tho, if its any consolation.</p>\n<p>also warnings for a panic attack btw</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>kudos comment subscribe because This Will Not End and was meant to be finished already but oh well</p>\n<p>(*bats eyelashes at regulars with an expression that verges on inappropriate but isn't /quite/ inappropriate enough that you can call me out on it* Hello, my darlings.)</p>\n<p>oh yeah and I'm pretty sure that you're not meant to do what katara did if someone's having a panic attack (like yeah untying him is a good move but she should probably have stayed out of his space). I just took authorial liberties and also they're soulmates and identify each other by touch so...</p>\n<p>I have strict enough plans for the next 2 chapters that they should be all i need and i wont have to add any more but who even knows anymore. maybe I'll end up squishing the two chapters into one, idk what im doing anymore</p>\n<p>hey. hey. look at the chapter count. it hasn't changed for once. i might actually only have one chapter left. that's so soothing</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">more notes</a>.)\n</p>\n<p>kudos comment subscribe we have one chapter left yo guys just ONE MORE CHAPTER AND THEN I'M FREE WHY DID I DO THIS<br>(hello my regulars i see you and i love you and i cherish you and i will answer comments this time i swear I'm getting better at it)</p>\n<p>next chapter will be Sunday or sooner depending on when it is written (but latest is Sunday don't worry)</p>\n<p>In other news i went back to updating the guilt series every two weeks instead of weekly and this thing is almost finished which means I'll finally get back to the non-evil twin woot woot (the first series mentioned is soft emotions, trauma, and theatre and the second is the dumbest funking comedy istg you'll like it i promise) because otherwise I'll run out of new content and therefore validation from comments</p>\n<p>Tumblr, where i really need to do some sort of art for this (what should i do please tell me i cant think of anything): https://foiblepnoteworthy.tumblr.com/</p>\n<p>*inhales* *screams internally*<br>Two reasons to be screaming today. The first one you've probably already noticed. There is still another chapter to go. I am losing all faith in everything. I swear this is an accident.<br>The second scream is actually a good one: This fic got recced by aloneintherain/captainkirkk and so I am going to die. Let me know if you came here from that I'm just hella curious.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">more notes</a>.)\n</p>\n<p>kudos comment subscribe because its still not done and I'm going to murder something<br>(I'm going to murder Zuko i feel like this is his fault somehow)</p>\n<p>(Hello my regulars I'm sorry about all this How are you doing today You've been here a while would you like any refreshments?)</p>\n<p>IMPORTANT QUESTION: what should I work on when this is finished? I have a few nice ideas for (hopeful) one-shot fics, but i also need to finish a wolf in wolf and the non-evil twin series in general. I've been thinking about going back to the turtleduck fic also, maybe making a little season one shaped arc and finding some way to call it finished. Or should i be looking at guilt and making sure I've got enough pre-written chapters to avoid a haitus?</p>\n<p>tldr what do you want me to work on after I finish this fic, which will update on sunday/every Sunday (i want there to be one chapter but i am not a complete idiot so)<br>(Yes that is also me plugging my other works; almost everything I write is avatar so there's stuff you'll like there, i promise. it ranges from comedy to found family to romance and Zuko is always the main character)</p>\n<p>Here is my Tumblr it's just doodles of my fics and occasional updates on my works. Come yell at me there: https://foiblepnoteworthy.tumblr.com/</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">notes</a>.)\n</p>\n<p>kudos comment bookmark check out my other stuff because this thing is finished!!</p>\n<p>(hello my charming regulars, you beautiful sunfish, you majestic musk-oxen, you gorgeous...)</p>\n<p>Okay so like i was editing this and i went 'yo i kinda wanna see some dadkoda stuff in this' so *sigh* i might write a lil follow up sometime. Like in a few months or something. i really need to get back to the non-evil twin (which i hope to have an update for within two weeks :) it will be more fucking with jet but that's what y'all want anyway so...)</p>\n<p>seriously tho its been so cool to have so many readers on this; this is my most popular fic at time of writing and the response i got was actually insane. I love you guys and i want you to stick around and i swear i mostly just do avatar so...</p>\n<p>come and tell my what scenes i should illustrate on my Tumblr: https://foiblepnoteworthy.tumblr.com/</p>\n<p>Hi there! I soft-orphaned this (moved it to another account) bc it’s a lil old. If you want my new works, check out FoiblePNoteworthy! &lt;3</p>",
  "text": "<p>Aang was born with five marks on his forearm. He grew up with five ghosts protecting and comforting him in equal measure, and eagerly awaited the day he would finally meet them.</p>\n<p>He found two of them – the boomerang and the strange swirls - the day after he came out of the iceberg. His soulmates both bore the same fan, eye and crossed swords as him.</p>\n<p>Sat in a bison saddle, high up above a wrecked Fire Nation ship, the trio knew that it would only be a matter of time before the six of them were together.</p>\n<p>***</p>\n<p>Zuko resisted the urge to hum the Blue Spirit theme as he clung to the bottom of a cart entering the Pohuai Stronghold. He was a professional, and that would definitely get him caught.</p>\n<p>It didn’t help that one of his soulmates was tapping out one of the beats on his arm. He wasn’t exactly sure what they were doing there in the first place.</p>\n<p>(He was glad for the company, much as he pretended otherwise, even to himself. If he failed or was <em>caught</em>… It was always nice to have a constant assurance that he wasn’t minutes away from dying.)</p>\n<p>It was child’s play to slip past the guards, and only a little harder to take out the quartet guarding the Avatar’s cell. He wasn't sure whether to take pride in his abilities or to fear for the safety of his nation.</p>\n<p>He entered the cell to the oh-so-satisfying sight of the Avatar in chains. He only allowed himself aa half-second to savour it, not wanting the boy to guess his intentions, before leaping to free him – with a little flair thrown in to scare the slippery brat.</p>\n<p>The Avatar, strangely enough, was more awed by than scared of his swords. Zuko hid his irritation; it was better that he trusted him, for the moment at least. It shouldn't matter that he couldn't even scare a twelve-year-old right.</p>\n<p>“Are you here to rescue me?” the boy asked, head tilted up to see him, eyes overlarge in his small body.</p>\n<p>Zuko stayed silent – he’d recognise his voice – and gestured for him to follow him with his swords. The Avatar followed the movement a little too closely, and went with him without protest.</p>\n<p>“Wait!” The boy knelt in the next room, already becoming a problem. “My frogs!”</p>\n<p>\n<em>What? </em>\n</p>\n<p>“My friends-” the boy cut himself off abruptly, looking between Zuko and the frogs. Zuko took advantage of his hesitation and dragged him away, ignoring his protests. They needed to get out of there.</p>\n<p>(Was he was always like this around 'allies'?)</p>\n<p>***</p>\n<p>Aang knew those swords. He’d seen them every day, felt the warm, if rough, presence of their owner in all his hardest moments and coldest flights. He was a strong figure, gentle in his own way. A Firebender who still used swords.</p>\n<p>The stranger hadn’t acknowledged their bond, but why else would he be there? It couldn’t be a coincidence that someone with those swords – dual dao, Sokka had called them, with blue handles – had appeared out of nowhere to rescue him.</p>\n<p>Maybe the stranger wanted to wait until later. Maybe he somehow hadn’t realised that the arrow was Aang – it had taken Katara and Sokka a minute too.</p>\n<p>(<em>It was in the middle of his forehead,</em> he couldn't help but grump.<em> It wasn’t exactly subtle.</em>)</p>\n<p>Maybe the stranger wasn’t his soulmate. But maybe he’d know someone else with swords like that? Somehow?</p>\n<p>Hidden in a water system beneath the prison, the pair had a minute to talk while that waited for a patrol to move.</p>\n<p>He had to at least<em> ask,</em> even if the stranger wasn't going to mention it.</p>\n<p>Aang pulled up his sleeve to reveal the familiar marks. He traced Katara and Sokka; promised himself he wouldn’t be much longer in getting back to them.</p>\n<p>The stranger had turned his head away the second Aang revealed his marks. That was polite but it wasn't what Aang wanted.</p>\n<p>“Hey,” Aang whispered, pointing to the swords. The stranger turned; reluctance clear in the set of his shoulders.</p>\n<p>He froze, masked head tilted towards Aang's arm.</p>\n<p>(He generally seemed to move very cautiously, but the complete stillness was unusual for him, Aang thought.)</p>\n<p>The silence stretched on as the stranger stared at the swords.</p>\n<p>“Do you have an arrow?” Aang asked, when it became clear that the stranger wasn’t going to react.</p>\n<p>Trembling fingers untucked a black tunic, pulling it up to reveal-</p>\n<p>Aang felt sick. The scar ran from his ribcage to beneath his waistband. It was vaguely hand-shaped, but no hand would be <em>that</em> huge, how could… who did that?</p>\n<p>The scar was pink and faded; long since healed.</p>\n<p>“How old were you?” Aang asked.</p>\n<p>The stranger looked away, tucking his tunic back in and hiding the scar.</p>\n<p>Aang still didn’t know if he’d had the arrow or not. He had to have seen them before he... <em>before.</em> He had to know what they looked like. No one would do that to a little kid. </p>\n<p>But two minutes ago he would never have guessed that someone would burn off someone’s soulmarks.</p>\n<p>There had to be a reason why he had shown Aang his scar.</p>\n<p>“You don’t know what they look like.”</p>\n<p>He looked at the stranger, silently begging him to prove him wrong.</p>\n<p>The stranger shook his head.</p>\n<p>Aang did the only thing he could think of.</p>\n<p>***</p>\n<p>The Avatar was <em>hugging</em> him.</p>\n<p>The Avatar. Hugging.</p>\n<p>His mortal enemy.</p>\n<p><strike>His soulm-</strike> No. He couldn’t be.</p>\n<p>He couldn’t be such a terrible soulmate that he would… He hadn’t been <em>hunting </em>his <em>soulmate</em>.</p>\n<p>(Soulmate<em>s</em>, plural. The boomerang and the swirls; they had to be the Water Tribe peasants.)</p>\n<p>The Avatar touched his swords.</p>\n<p>Zuko recoiled, his mind finally having caught up enough to push the boy away.</p>\n<p>“We can touch blood,” the boy said, promises and pity and care in his eyes and Zuko didn’t <strike>deserve</strike> <em>want</em> any of it. “Then you’ll know.”</p>\n<p>He reached for his swords again, ignoring Zuko’s shaking head.</p>\n<p>“I know it’s you,” the boy insisted. “There are six of us, right?”</p>\n<p>\n<em>\n<strike>(Five bodies held him on his worst nights.)</strike>\n</em>\n</p>\n<p>Zuko stepped back.</p>\n<p>“You know you’ll do it eventually.”</p>\n<p>Not with <em>him</em>. Not with his enemy.</p>\n<p>(What would he even do if it <em>was</em> him? He couldn’t hunt his soulmate – couldn’t <em>have been</em> hunt<em>ing </em>his soulmate either. Surely fate wouldn’t be so cruel.)</p>\n<p>The boy looked at him with stars in his eyes. He was standing too close, but Zuko didn't find it in himself to mind.</p>\n<p>“After,” he heard himself say in a roughened voice.</p>\n<p>The boy nodded. “Okay, that’s fair, it’s <em>exhausting</em>. But you have to <em>promise</em> you’ll at least try it.”</p>\n<p>The boy held one of his hands between his two, eyes beseeching.</p>\n<p>Zuko nodded, then, before the boy could say anything more, pulled them up and out of the tunnel to make their escape.</p>\n<p>He’d have to find some way out of their promise. But later.</p>\n<p>***</p>\n<p>Those familiar swords were cold against his throat. Aang swallowed, unsure of whether or not he should look afraid – unsure of whether or not he <em>felt</em> afraid. His soulmate could kill him with a slip of his hand, and they needed that Zhao guy to believe that he would.</p>\n<p>But they were out the doors. It wouldn’t be much longer before they could join blood and he could get to know his soulmate.</p>\n<p>(It was him; he could <em>feel</em> it.)</p>\n<p>Aang didn’t see the arrow coming until it was too late.</p>\n<p>He <em>did</em> see the face beneath the mask.</p>\n<p>***</p>\n<p>Zuko dealt with a lot of terrible things - that was just his life. It made him an expert in awful. He had a phD in getting punched in the face both physically and metaphorically. He’d practically made a career in falling down hills only to land in rivers only to be attacked by hippogators.</p>\n<p>This meant that he could certifiably say that his current situation was the absolute <em>worst</em> without anyone being able to refute it.</p>\n<p>First off, he had a headache. A really bad one too, the kind that made you almost throw up but you never actually do so you’re just anxious and uncomfortable for several hours without the relief of just <em>ending</em> it.</p>\n<p>Secondly, his wrists and ankles were bound. With <em>rope</em>. He’d be even more offended if they hadn’t tied his palms on his elbows, so he couldn’t actually burn them off without setting himself on fire.</p>\n<p>(The fact that the good knotmanship and clear effort in his captivity sated his ego was a smaller, but no less awful, thing he had to deal with.)</p>\n<p>Thirdly, and most importantly, The Avatar was a scant three feet away from him, and he had no way of getting to him. Every time he spotted him, some reflex tripped in the back of his mind telling him to <em>go</em> and <em>hunt</em> and <em>catch that tiny child</em>. This happened every few minutes.</p>\n<p>(The fourth and actual worst part of all of this was the part where the child he had been hunting could be one of his soulmates. If Zuko couldn’t get out of there quickly enough, there was a not-insignificant chance that the Avatar would force them to join blood to try and make him switch sides.</p>\n<p>He didn’t know what he’d do if he had to make that decision.)</p>\n<p>Eventually, the Water Tribe siblings came to, spluttering and yelling at Aang.</p>\n<p>First about the frogs.</p>\n<p>Then about Zuko and his general existence.</p>\n<p>(Zuko kept his eyes shut. Better they think he’s not listening. Maybe he could get a clue about where they were going next.</p>\n<p>Or about what they thought of him as their potential soulmate.)</p>\n<p>“Aang, that’s rope!” the brother exclaimed.</p>\n<p>“I know.”</p>\n<p>“He’s a <em>firebender</em>!”</p>\n<p>“I know.”</p>\n<p>“Why did you kidnap Zuko?” the waterbender asked, only confusion in her tone. “It’s a little… backwards.”</p>\n<p>\n<em>Thank you!</em>\n</p>\n<p>“It’s a lot backwards,” Sokka agreed. “What would we even <em>do</em> with a Fire Prince?”</p>\n<p>“I was captured by Zhao last night,” The Avatar told them. “Zuko broke me out.”</p>\n<p>The siblings paused.</p>\n<p>“That doesn’t make him your friend, Aang,” the boy said, cautious.</p>\n<p>“No,” Aang agreed, “But these might.”</p>\n<p>Zuko heard a clink of metal. The siblings let out small noises of shock and dismay.</p>\n<p>There was a rustling as the waterbender climbed out of her sleeping bag to look closer. “These are his?” There was no mistaking the awe in her voice - nor the bizarre hope.</p>\n<p>“<em>Pshaw</em>,” her brother scoffed, unconvinced. “They’re good fakes, but he must have seen our marks at some point. He’s just trying to trick us.”</p>\n<p>“He didn’t use firebending at all last night,” the Avatar said. “Just his swords. He was pretending not to be Zuko – he had a mask and everything. And he knew how to fight with them.”</p>\n<p>“Aang…”</p>\n<p>“We fought well together.”</p>\n<p>“Did you try to join blood?”</p>\n<p>“He wanted to wait ‘til after.”</p>\n<p>“He didn’t want you to know that you’re not soulmates and he’s trying to manipulate you. It’s a dirty trick; but I wouldn’t expect anything less from the Fire Nation.”</p>\n<p>\n<em>How dare he-</em>\n</p>\n<p>Zuko was so sick of this. He just wanted to go back to his ship.</p>\n<p>“That,” Zuko said, pulling himself halfway upright (which here means <em>‘onto his side because that really was some quality knotwork’</em>) and glaring at them, “would be in no way honourable. Just because we’re mortal enemies doesn’t mean you have to insult me like that.”</p>\n<p>The Water Tribe boy blinked at him. “Yes, it does. What’s the point in having a mortal enemy if you don’t make fun of his terrible awful ugly ponytail?”</p>\n<p>“I’ve resisted the urge with you so far.”</p>\n<p>He squawked, sputtering incoherently. “This is a warrior’s-”</p>\n<p>“Sokka,” his sister placed a comforting hand on his shoulder, though her expression was unsympathetic.</p>\n<p>The boy – Sokka – reeled on him again, his voice only getting higher and louder and worse on Zuko’s headache. “Stop trying to distract us!”</p>\n<p>“You’re the one who insulted my Phoenix Tail.”</p>\n<p>“You’re pretending to be our soulmate!”</p>\n<p>Zuko flinched. The fact that they thought the swords matched their mark was… not good for him. Maybe he could convince them it was on purpose and they wouldn’t try anything – but faking a soul connection was just… what kind of person would do something like that? He wouldn’t even pretend to stoop that low.</p>\n<p>(And what if it<em> was</em> them? Shouldn’t he try to fix things now, before he wronged them even more?)</p>\n<p>“I’m not,” he protested. “Those are <em>my</em> swords. They just happen to look like your soulmarks. I wasn’t trying to trick you – give me <em>some</em> measure of credit.” They looked unconvinced.</p>\n<p>“I didn’t even know about your marks until the Avatar showed me last night,” he added.</p>\n<p>The waterbender got a strange look in her eye. She stepped forwards, and sat cross-legged a few feet from Zuko. Even sitting down, she was a lot higher up than he was comfortable with in his vulnerable position.</p>\n<p>He puffed out a mouthful of flames in warning, and got a raised eyebrow in return.</p>\n<p>(Her brother waved his arms in frustration and panic behind them, but didn’t intervene. The Avatar watched with undisguised fascination.)</p>\n<p>“You didn’t know they would match our marks?” she asked. “It really <em>was</em> a coincidence?”</p>\n<p>He snarled. “I may be your enemy, but I still have lines I wouldn’t cross. I’d appreciate it immensely,” and how it stung to ask a favour of his enemies, “if you would just let this go – and let <em>me</em> go while you’re at it.”</p>\n<p>He gave a half-hearted tug at his bonds for emphasis. His shoulders were starting to ache.</p>\n<p>She moved closer. “Where are your soulmarks?”</p>\n<p>His blood froze. He bared his teeth and said in a hiss, “Don’t you <em>dare</em> touch me.”</p>\n<p>He wrestled with his bonds again; to no avail, as before. She placed a hand on his shoulder.</p>\n<p>“Do you have matching marks?”</p>\n<p>“No!” He pulled back, trying to free himself from her grip or the rope. Both held tight. “I don’t-”</p>\n<p>“They’re scarred over,” the Avatar said. “He doesn’t know.”</p>\n<p>\n<em>“You shut up!”</em>\n</p>\n<p>Sok- the Water Tribe boy looked over in half-interest, half-horror, eyes wide and brow furrowed. “What does that even <em>mean</em>?”</p>\n<p>“He showed me last ni-”</p>\n<p>Zuko let loose a stream of fire from his mouth, cutting off the conversation.</p>\n<p>The trio continued talking quietly, at a safe distance. Try as he might, Zuko couldn’t make out what they were saying.</p>\n<p>The fact that they were even <em>considering</em> it made his stomach churn.</p>\n<p>(It couldn’t be them. He wouldn’t <em>let it</em> be them.)</p>\n<p>The Avatar and the waterbender both seemed in agreement about something, nodding when the other spoke and standing shoulder to shoulder; but the Water Tribe boy was vehemently against whatever it was, with dramatic head shaking and arm flailing. Either the group worked unanimously, or the boy had some sort of leadership role given by his age or gender.</p>\n<p>Zuko knew that if the trio offered hi some sort of peace based in these soulmarks that would only aid him in his goal to capture the Avatar. That idea should be the only thing he thought about.</p>\n<p>He was far more concerned about what might happen if they did force him to join blood.</p>\n<p>(What if it really was them? If they’d found him against all odds? The fact that they were discussing it surely meant that he would have a chance, right?)</p>\n<p>Eventually, the waterbender broke off from their group, ignoring their protests, and grabbed a small knife from a huge selection of random objects that he could only assume they’d stolen, for whatever reason.</p>\n<p>She was walking towards him holding a knife. That wasn’t good.</p>\n<p>He managed not to flinch when she sat next to him again, but it was a near thing. Her knife sliced into her palm first, before she reached for his arm, throwing a handful of water in his face when he tried his breath of fire again.</p>\n<p>The knife dug in. There was a hand, soft and soothing on the wound.</p>\n<p>His vision was overwhelmed by white.</p>\n<p> </p>\n<p>The bright white of the blood joining faded quickly, as it always did, and Katara found herself in a strange red room. Women bustled around her, disguising panic under strenuous work, while another was laid out in a hospital bed, a bundle clutched to her chest. The white sheets were stained a stark red.</p>\n<p>Katara crouched, looking for any figures she could see at knee height, presuming Zuko to be quite short and at a young age. She knew she was there for a reason, and knew he must have been there a well, but she couldn’t-</p>\n<p>The bundle gave out the sharp cry of a newborn, startling Katara. She’d never heard of someone meeting their soulmate at such a tender age, but there was no other sign of little Zuko.</p>\n<p>He was quickly soothed by the woman - his mother, she had to be – and burbled, wriggling to try to sit up and look around the room. He was curious; bright-eyed and smiley. Sweet.</p>\n<p>Katara looked at the baby, and couldn’t withhold a rush of emotion. There was no way this baby could ever turn evil.</p>\n<p>(So what had happened?)</p>\n<p>He was Zuko, and Katara should probably actually think about that. But what was there to say? He’d been hunting them like animals halfway across the world, but had also rescued Aang last night, but was the <em>Firelord’s</em> son, but used to be a teeny tiny baby and kept her warm in the winter.</p>\n<p>He spoke a lot about honour. Maybe he really did think he was doing the right thing?</p>\n<p>(He’d struggled, desperate, his good eye white all around with fear, when he saw the knife and realised what she was going to do. She couldn’t shake the image, even watching his unrecognisable infant self. But how else could she have verified their bond?)</p>\n<p>The door slid open, unheralded by any knock, and two men stepped inside: one wizened and stern in his expression, beginning to hunch over with age; the other far younger, head high and hair perfectly groomed.</p>\n<p>All the women, Zuko’s mother included, bowed towards the men, several kneeling. There were reverent greetings of “Your Majesty” and “Your Highness,” explaining why those men thought they were allowed in a women’s space.</p>\n<p>Katara looked with new eyes at the Firelords of past and present. Their expressions betrayed no joy at the birth of their son and grandson. The younger man - <em>Ozai</em>, wasn’t it? – stepped forwards to inspect Zuko, not bothering to take him from his wife’s arms.</p>\n<p>“Boy or girl?” he asked, no interest in his tone. Was this some bizarre Fire Nation custom? Perhaps Zuko was born weak, and they were trying not to get attached in case he didn’t make it. He did look a little smaller than most new babies she had helped Gran-Gran deliver, and there was far more blood than Katara was used to seeing after births.</p>\n<p>Behind them, the nurses and medics scampered out of the room, even though the woman was clearly still weak from her ordeal.</p>\n<p>“Boy,” the woman replied, warmth at war with something else in her expression. It made Katara shiver, despite her half-incorporeal form.</p>\n<p>Ozai leaned over to look at Zuko again, this time taking him from his wife’s arms. Her smile froze, watching him hold their son. Ozai didn’t seem to know how to hold a baby – either that or he didn’t care. He held Zuko under his arms, studying his face intently.</p>\n<p>Zuko reached for his nose with one little chubby hand, gurgling happily.</p>\n<p>“I was thinking of calling him Zuko,” the women said, “For my father.”</p>\n<p>The older Firelord approached, scrutinizing tiny Zuko. He let out a little <em>hmph</em> of disapproval.</p>\n<p>“Any marks?” he asked.</p>\n<p>The women took a short fortifying breath, struggling to hide her confusing fear in her own exhaustion. “He has five of them.”</p>\n<p>Ozai turned his gaze from Zuko to his wife. “Then they’ll make do easily without him,” he said, and walked around the bed to a small window, most likely there to provide ventilation in the Fire Nation’s muggy heat.</p>\n<p>He showed Zuko the outside – showed him the sun, perhaps? Another Fire Nation custom? – then held him out just a little too far.</p>\n<p>\n<em>(No.)</em>\n</p>\n<p>The woman lurched upwards, struggled to her feet. She swayed, clutching the bed posts for support, and would surely collapse if she took a step closer to Ozai.</p>\n<p>“Please,” her tone was polite and gentle, completely opposed to her deathly pale skin. “You’ll give me a heart attack holding him like that.”</p>\n<p>She forced a small chuckle, reaching out her hands for Zuko, who made grabby hands back at her. Ozai didn’t return him to her increasingly insistent arms.</p>\n<p>“There is no spark,” Ozai said, cold. “In his eye nor his spirit. I doubt he will be a Firebender. His birth disgraces us.”</p>\n<p>The woman gasped – not in shock, she had clearly seen this coming, but because she seemed to have been holding her breath in fear.</p>\n<p>Her legs shook at the effort of keeping her upright. Ozai was stood six paces away from her, well out of arm’s reach.</p>\n<p>Zuko reached for his mother again, beginning to fuss when he wasn’t handed over.</p>\n<p>Katara soothed him with a gentle hand on his forehead, and told herself that he had to survive this, because otherwise she’d never have met him.</p>\n<p>She wondered again why she was being shown this. She swallowed and watched Ozai, tall and cold and intimidating even when carrying his infant son, and dreaded to think what Zuko’s childhood had been like – she’d find out soon enough, she supposed.</p>\n<p>“There is little point in wasting an heir now that he’s here,” The older Firelord said, admonishment in his otherwise indifferent tone. He didn’t look the slightest bit perturbed by Ozai’s intentions. “We shall see whether or not he is worth keeping when he is older. He may still be a bender.”</p>\n<p>The woman almost collapsed onto the bed, settling herself against the headboard so she could watch both the Firelord at the window and the Firelord at the door.</p>\n<p>“It is his marks,” the old man said, his lip raised in a sneer, “That I take issue with. Connections like that only make a person weak. Give him here,” he crooked a finger at his son, who came over to him and held Zuko within his reach.</p>\n<p>He began undoing the bundle of blankets that held baby Zuko.</p>\n<p>“Where are the marks?”</p>\n<p>“His stomach,” the woman answered, trying again to stand up, craning her neck to see what they were doing to her baby.</p>\n<p>Or maybe just to see the marks one last time.</p>\n<p>Zuko cooed at the flames in his grandfather’s hand.</p>\n<p>Everything went white again at the first hiccupping wail.</p>\n<p>***</p>\n<p>Zuko was four-ish and climbing a tree. The stubborn pout was so charmingly familiar. It seemed that Zuko brought his determination to everything he did.</p>\n<p>He also brought his recklessness by the looks of things – he was way too high up. Shouldn’t there be someone watching him? What if he – there it is.</p>\n<p>Tiny Zuko sniffed on the ground. Someone came forward to check on him, gently helping him up and checking him over. Katara gently rubbed at his cheek, to his evident confusion. (Did he know he had soulmates? Did he even know what soulmates were?)</p>\n<p>His father came outside and watched his son with an irritated expression.</p>\n<p>Katara couldn’t attack anyone like this, couldn’t do anything to protect Zuko – technically her mortal enemy, but also her soulmate and <em>a baby</em> – so she just did what she could to comfort him and pushed down her anger. It wasn’t what Zuko needed right now.</p>\n<p>Zuko ran off and the world glowed again.</p>\n<p>***</p>\n<p>She watched him in little snippets, often there to cool his injuries brought about by childish exploration and dangerous training alike. He chattered to her whenever they were alone, sometimes about a pretty bug he saw that day, sometimes about the ways he wanted to help his people when he was older.</p>\n<p>More than once she found him sneaking turtleducks into his room or trying to coax the lizard dogs into games of fetch.</p>\n<p>He grew older and his face and mannerisms took shape – he looked more and more like the person she knew, but was still so alien at times. He was a very expressive child, and she recognised his older self in that; he liked to study theatre scrolls long after he should have been asleep, and practise saying the lines dramatically. Once or twice she recognised a line from something he’d said while hunting them, and couldn’t supress a giggle.</p>\n<p>(How had she never seen it before? Zuko was a <em>dork</em>.)</p>\n<p>He tried hard at everything he did, even as his younger sister outpaced him with ease. He never gave up, regardless of everything that stood between him and his goals. She recognised that trait easily.</p>\n<p>Some things – most things, admittedly – she learned were new. He loved his father dearly, despite his numerous and well-documented flaws, but he was definitely a mama’s boy.</p>\n<p>His mother – Ursa – was an interesting person. She absolutely doted on Zuko, but struggled to make time for Azula (and who knew that Zuko had a <em>sister</em>?) despite her clearly needing more affection than she was getting. Katara suspected this had something to do with her being Ozai’s favourite, even though this only meant Azula was more at risk than Zuko in several ways.</p>\n<p>Katara wouldn’t deny that the little girl unsettled her, and fit her mental image for Fire Nation far better than Zuko ever could have hoped to (even before she saw him get stuck up a tree trying to help a raccoon cat get out); but none of that would justify leaving her to Ozai’s rare smiles and sinister encouragements.</p>\n<p>Katara tried to ignore the selective parenting in favour of just being thankful that someone was looking out for Zuko.</p>\n<p>And then, suddenly, nobody was.</p>\n<p>She’d thought the worst part of that day was watching Zuko break down over the death of his cousin. Several other hands joined her in comforting him.</p>\n<p>She was confused but grateful when she wasn’t dragged away to see the next incident; to see the next horrible thing that happened to him (because she’d found, increasingly soas he grew taller and smiled less, that she was always sent to Zuko when he was hurt and upset and injured, and rarely saw him just to visit him).</p>\n<p>She rather missed watching him cuddling turtleducks and reading out villainous lines.</p>\n<p>She saw his grandfather, Azulon, again, for the first time since Zuko’s birth, and wondered how many times Zuko had seen him in that time span.</p>\n<p>(She thought back to her village, where a day wouldn’t go by without her seeing Gran-Gran.  </p>\n<p>Zuko seemed to only see his father every few days, and never received a kind word from him.)</p>\n<p>She found herself surrounded by her soulmates again, as Zuko curled in a ball on his bed, chanting, “Azula always lies,” as if the evil of his sister would become a comfort, instead of trying to do something to protect himself from a threat he refused to believe in.</p>\n<p>(She felt Sokka pushing Zuko towards his window, the two soulmates she hadn’t met yet each tugging on his arms, but he was unmoved.)</p>\n<p>He had to survive, she reminded herself, just as she had at his birth, because she had met him.</p>\n<p>He would be okay.</p>\n<p>***</p>\n<p>His mother was missing and his grandfather was dead. Zuko refused to look into that, to look at what they meant, and asked again where his mother had gone.</p>\n<p>His sister’s words were happy in the face of his dismay; his father ignored him unless berating him for one ‘failure’ or another.</p>\n<p>Zuko tried harder and slept less and didn’t eat if he didn’t master his katas and lessons. Whenever he learned to manage his workload, it doubled spitefully.</p>\n<p>He didn’t complain.</p>\n<p>He received only harsh words.</p>\n<p>He tried harder.</p>\n<p>***</p>\n<p>Katara hadn’t thought much about the old man who followed Zuko around like a fussy mother turtleduck. He seemed a strong fighter, from the few occasions he got involved; and was gentle in his tone, with a sense of humour Zuko lacked.</p>\n<p>His soothing aura was in perfect balance to Zuko’s own temper, she saw in reflection.</p>\n<p>The man lacked Zuko’s predatory presence, and thus was never Katara’s focus when she saw him, but she knew him to be sturdy and reliable - everything Zuko needed from an adult. She’d rather been looking forward to seeing him when she realised he was Zuko’s uncle; when she realised he was coming home to him at a time that Zuko desperately needed a real parent.</p>\n<p>She hoped what she’d thought she’d seen, in uncaring glances between battles, was what Zuko would get.</p>\n<p>The small man – always short, but he’d been stout and solid – was made of tissue paper and steam. He was a bad day away from collapsing completely.</p>\n<p>He watched Zuko with undisguised pain during their few tea picnics, friendly and happy and kind until he remembered who he was talking to – who he <em>wasn’t</em> talking to – and went silent and empty again.</p>\n<p>Iroh had lost his son at the front. Might have seen it happen. He was entirely justified to be lost in grief. She’d seen the same thing in her father after her mother’s death – she and Gran-Gran had held the family together on those days dad just couldn’t get out of bed.</p>\n<p>Not to mention that she hadn’t seen the old man interacting with Zuko before; it was entirely possible that they weren’t close when Zuko was younger.</p>\n<p>Iroh wasn’t obligated to Zuko, and he really was doing better with him than Ozai was. It had to hurt to spend time with someone who must resemble his own son, like rubbing salt in an old wound.</p>\n<p>Zuko left another picnic despondent and lonelier than before he’d gone, and Katara vowed to punch the old man in the face.</p>\n<p>***</p>\n<p>Zuko, Katara had been surprised to find, was an idealist. He wanted to make everybody happy, and believed he could find some way to do it, if only he was ‘better’.</p>\n<p>He was shocked, that day in the War Room, to find that others, his elders and leaders and apparent ‘betters’, were not the same.</p>\n<p>Zuko did as Zuko would always do: He tried to fix things, had limited success, and made things difficult for himself.</p>\n<p>***</p>\n<p>The Agni Kai arena was filled to the brim with curious spectators, lit from above with a glaring sun.</p>\n<p>Zuko was thirteen, and set to battle a general. His competitor would be past his prime, for sure, but prowess in bending related to skill far more than it did to health. Zuko’s youthful ease of movement would be of limited help, and his inexperience would be a hindrance against his expert opponent.</p>\n<p>Zuko was thirteen. His scar was years old.</p>\n<p>She placed a hand on his shoulder, joined by everyone else, and told herself that he would need her, that she couldn’t look away.</p>\n<p>His competitor stood. It wasn’t the old man.</p>\n<p>Of course it wasn’t.</p>\n<p>Zuko shuddered in her grip, knelt, and begged for mercy.</p>\n<p>She protected his face with formless hands.</p>\n<p>He screamed.</p>\n<p>***</p>\n<p>Three years of injuries and failures and missions and anger lead him to the South Pole.</p>\n<p>Iroh was there, finally, as Zuko needed and as she had seen. He should have been there before, but he had clearly recognised that himself. He channelled his new grief into Zuko’s happiness, fleeting as it was.</p>\n<p>Maybe she didn’t need to punch him; he beat himself up enough on long nights, watching over Zuko and soothing him through nightmares.</p>\n<p>In the early days and weeks when his scar was raw, Zuko leaned into her cooling touch. But as time passed and the relief was no longer useful, he seemed to only feel a hand over his eye. He</p>\n<p>flinched at her lightest touches.</p>\n<p>She shook out the sting, stayed away from his face, and held him tighter on the harsh nights.</p>\n<p>She saw the South Pole, saw his mad chase across the Earth Kingdom; his desperate panic when Aang was captured. She gave him a little push when he snuck out the porthole, and he gave her a smile in return.</p>\n<p>The world faded into white. </p>\n<p>Katara was stood over Zuko’s prone form. The shock of returning to her body was always the same, but she was accustomed enough to shake it off easily; rubbing down her limbs and pushing away the imaginary pins and needles.</p>\n<p>(She’d been kneeling for a few seconds at most, even as she’d been in there for months.)</p>\n<p>The shock of emotion, when she finally processed everything and felt things properly, would take a little longer to come.</p>\n<p>She looked down at Zuko, who was taking a little longer to come back to himself. Laid on his right side, his scar was bright and angry and clear.</p>\n<p>Perfectly preserved in her mind’s eye – she’d refused to look away, felt she owed him that at least – was the screaming child she couldn’t protect. She saw the bright-eyed boy who wanted to do everything and help everyone and go everywhere.</p>\n<p>She knew who he was, at his centre: a good person who’d been bullied out of doing the right thing. He was her soulmate, <em>their</em> soulmate, even if he wasn’t ready to be.</p>\n<p>She would help him get there.</p>\n<p>She could barely recognise that little boy, cheerful and sad according to his parents’ whims. He was <em>angry</em>, burning and overflowing with it. He couldn’t risk a more vulnerable emotion.</p>\n<p>He blurred before her eyes; sobs caught in her throat.</p>\n<p>Zuko came back to himself with a cut-off gasp, enough to start cursing and struggling again, more desperate than before. He screamed and fought, good eye red with emotion, and Katara fumbled with the knife, holding his shoulder gently. She’d have to hold him still before she could cut the ropes.</p>\n<p>Someone took the knife from her hand, while gentle arms wrapped around her and pulled her away. She didn’t want to leave Zuko while he was so upset, but figured it was best to let one of the boys untie him instead. She wasn’t too prideful to admit that it would take her too long in her state. (At least, not to herself.)</p>\n<p>She and Aang curled up against Appa as Zuko raged and Sokka spoke to him quietly. Flashed of flame appeared occasionally, accompanied by shouts from both boys, as Zuko refused to calm.</p>\n<p>***</p>\n<p>Sokka was <em>touching him</em> and Katara was gone and she didn’t matter anyway but he needed Sokka to just <em>leave him alone</em>.</p>\n<p>Another burst of fire pushed the boy away, finally, to talk with the others next to Appa. Zuko took advantage of the relative safety to relax against the cool stone and catch his breath. He took stock of the situation; it was awful.</p>\n<p>Katara was upset. She was sobbing, bawling, in complete misery. It shouldn’t matter to him, but she was upset and it was his fault for landing her with a soulmate like him.</p>\n<p>It wasn’t like he could help it! It wasn’t his fault that she had to deal with him – he hadn’t wanted to soulbond in the first place. She forced them to be soulmates.</p>\n<p>(He was careful not to think too much about what he had seen in her life – her protective brother and caring grandmother and loving father. Her father never struck her or her brother, and always had a kind word and a hug for both of them, regardless of their achievements or failures. It was like their abilities didn’t even matter to him.</p>\n<p>He didn’t like to think of their village either – he’d assumed it was some sort of minor outpost when he’d been there before, rather than one of a few scattered remnants of the Water Tribe. No one had told him she was the last Southern Waterbender.</p>\n<p>The Fire Nation was supposed to be sharing their greatness with the rest of the world, but the Water Tribe was struggling to survive.</p>\n<p>He didn’t understand.)</p>\n<p>It had to be some sort of trick – some Avatar magic to make their enemy believe they had to be allies. Somehow.</p>\n<p>(He knew no magic could imitate a soulbond, not even the immense power of the Avatar.)</p>\n<p>He couldn’t – they couldn’t actually be…</p>\n<p>Leaving. They were leaving and he was still trapped there and he didn’t know what to say to them.</p>\n<p>“Where are you going?” he tried, forcing rage into his tone to cover anything else he may have been feeling.</p>\n<p>“Like we’d tell you,” Sokka scoffed. Zuko was hurt by his disgust, flinching minutely, then surprised with himself for caring.</p>\n<p>“Sokka?” Katara turned to him, pausing in packing up their sleeping bags. “Why would it matter – he’s coming with us, isn’t he?”</p>\n<p>Zuko froze. They… they wanted him?</p>\n<p>\n<em>It couldn’t be that simple.</em>\n</p>\n<p>Sokka looked at him, brow furrowed. “Are you?”</p>\n<p>\n<em>Was he?</em>\n</p>\n<p>“Let me up,” he ordered, “And then we can talk.”</p>\n<p>“And then you can fry us to a crisp – no thanks.” Sokka held his boomerang loosely, but defence was clear in his posture. “Do you <em>want</em> to come with us?”</p>\n<p>Zuko hesitated.</p>\n<p>“It’s a simple enough question.”</p>\n<p>It was not a simple question.</p>\n<p>(He knew the soulbond was real, but that didn’t mean he had to accept it – or admit it.)</p>\n<p>“Let me up,” he tried again, unable to hold his gaze.</p>\n<p>“No.”</p>\n<p>The Avatar looked between them as they argued. “Sokka, shouldn’t we-”</p>\n<p>“We can’t trust him Aang.” And those words were damning, mostly because they were true. “I know he’s our soulmate but he’s hurt us too many times-”</p>\n<p>“He saved my life last night!”</p>\n<p>“And I’m sure he had a perfectly evil explanation for that.” Sokka turned back to him. “Why did you help Aang?”</p>\n<p>Zuko scowled and said nothing.</p>\n<p>“He’s banished.”</p>\n<p>The three of them turned to look at Katara, who watched Zuko with a mystifying calm, even as she rubbed at her eyes.</p>\n<p>\n<em>“Shut up!”</em>\n</p>\n<p>“He can’t return to the Fire Nation unless he captures Aang.”</p>\n<p>Sokka nodded. “So he was keeping him on the market.”</p>\n<p>“Was that it?” Aang sat down in front of Zuko. “Is that why you helped me?”</p>\n<p>Zuko looked away.</p>\n<p>“What would you have done if I hadn’t found out it was you?”</p>\n<p>Zuko grit his teeth, fully turning his head away. Aang scooted a little closer.</p>\n<p>“You promised we’d try to join blood after,” he pressed. “Would you have used our bond to trick me into going with you?”</p>\n<p>“I-” Zuko started, unsure of where he was going, “I would have…”</p>\n<p>Aang sat closer. He stared.</p>\n<p>Zuko‘s voice dropped lower. “I have a mission to complete.” Aang’s face fell. “I won’t betray my country.”</p>\n<p>“Not even for your soulmates?”</p>\n<p>Zuko hissed, rearing up as high as he was capable. He spat sparks. “You are <em>not</em> my soulmate!”</p>\n<p>Aang jumped away from a rush of fire.</p>\n<p>“Great!” Sokka clapped his hands together. “Zuko is still evil. Glad we’ve figured that out.”</p>\n<p>He grabbed Aang and shoved him into Appa’s saddle.</p>\n<p>“Sokka…” Katara looked reluctant, but could barely muster an argument. “This… this has to be a shock to him.”</p>\n<p>Sokka shooed her into the saddle and she didn’t fight him.</p>\n<p>“He made his choice.”</p>\n<p>Zuko flopped back to the ground again and closed his eyes. Best to make this easiest on whichever one of them would come over to untie him.</p>\n<p>“And he might change it.”</p>\n<p>His eyes snapped open again. Katara was still watching him, that same sad expression on her face.</p>\n<p>Maybe she <em>hadn’t</em> been crying because she was stuck with a terrible soulmate. He couldn’t guess why else she would be that upset though. He was certain Sokka would delight in seeing all the times he’d been hurt over the years.</p>\n<p>Sokka leapt onto Appa, settling on the bison’s head with a hold of the reigns.</p>\n<p>\n<em>Wait a minute-</em>\n</p>\n<p>“You can’t leave me like this!”</p>\n<p>“Sure we can,” Sokka smirked at him. “I’m sure some of your men will find you… eventually.”</p>\n<p>Zuko struggled with his bonds again, as if the hundred times he’d tried before weren’t proof that he wasn’t getting out without help.</p>\n<p>He threw out a desperate plea, “If Zhao’s men find me like this they’ll know what I did and-”</p>\n<p>“You’re the Prince,” Sokka shrugged, unconcerned by Zuko’s tone. “I’m sure if anyone can get away with a little treason, it’ll be you.”</p>\n<p>Zuko couldn’t breathe.</p>\n<p>“You can’t – you don’t understand-” the world went dark, his vision reduced to a pinprick. He was too hot and too cold and too still. Burnt flesh seared his nostrils.</p>\n<p>He couldn’t move. Couldn’t breathe. There wouldn’t be much of him left to go back to his father at this rate. Maybe it would be easier that way.</p>\n<p>A cool, <em>familiar</em> hand stroked the skin on his neck and he arched into the soothing touch.</p>\n<p>“Just breathe slow, okay?” came a gentle voice. “You’ll be okay, just take in a deep breath…” after a few tries he managed it, “And hold it for a few seconds… and now let it out.”</p>\n<p>The voice told him to breathe again, and he found it easier that time.</p>\n<p>The hand constantly touched him, grounding him, as he was untied and manoeuvred upright. He was kneeling, hands clasped with someone else’s; cold in a way he recognised as <em>safe</em> but couldn’t place.</p>\n<p>“You’re okay, Zuko.”</p>\n<p>He took in air and the world came together again in syrupy fragments. He realised too late that he was holding hands with Katara.</p>\n<p>He scrambled back, finding all his limbs to be his own, if a little wobbly. Red marks ringed his wrists; a few layers of skin were missing. His breath came a little too quickly, but that was far better than not at all.</p>\n<p>Katara hadn’t moved, still knelt on the ground. Vulnerable.</p>\n<p>“Are you feeling better now?”</p>\n<p>Zuko couldn’t meet her eye. He hadn’t had an episode like that in… it must have been over a year.</p>\n<p>(And he knew who had helped him through them in the past.)</p>\n<p>“I’m fine.” His throat was rough from abuse.</p>\n<p>“We have to go now,” she said, slow and soft like he was an injured animal, and he nodded, disgustingly appreciative of her gentle tone, “But you can come with us, if you want.”</p>\n<p>He shuddered. His scar prickled with phantom pain. “That’s treason.”</p>\n<p>“I understand,” she said, and he thought she really might. “But can you think about it?”</p>\n<p>He would, but he couldn’t admit to that. “Promise me one thing,” he said instead.</p>\n<p>She nodded.</p>\n<p>“Don’t tell them about what you saw.”</p>\n<p>“I’ll need to-”</p>\n<p>“Just. Just not the worst parts.” Some flare of anger spiked in the back of his mind, hardening his next words, “The things you saw were private in the first place, and you forced your way in anyway. The least you can do is keep from <em>gossiping</em> about my scar.”</p>\n<p>“I – I’ll keep it a secret. But please, just think about it, okay?”</p>\n<p>“It’s not like I don’t think about the Avatar and his friends all the time anyway.”</p>\n<p>It wasn’t a promise, but it was the best he could offer her.</p>\n<p>She dared to shuffle closer and take his hand. She squeezed it once, quick but not clinical. No one could prove it if he squeezed back, just a little.</p>\n<p>She stood and walked towards the bison and a thought struck him.</p>\n<p>“Your necklace!” He stood, bracing himself against the rush of pins and needles. Nothing was quite working right, it seemed.</p>\n<p>She turned, that strange sadness turning into warmth. He wasn’t sure which expression he hated more.</p>\n<p>\n<em>(Anger - that had to be the hot feeling that swelled behind his eyes.)</em>\n</p>\n<p>“I – I didn’t realise.” He felt himself flush, and couldn’t look her in the eye. “I’ll get it back to you.”</p>\n<p>She smiled, uncaring of his awkward fumblings, and gave him a nod. He returned the expression, turning a nod into a slight bow. (If she saw it as an apology, he wouldn’t have reason to correct her.)</p>\n<p>She climbed on Appa’s back and waved as they flew away.</p>\n<p>He didn’t return the gesture.</p>\n<p>Nor did he move until they were less than a dot in the sky.</p>\n<p>It had been almost an hour since they left Prince Too-Good-For-His-Soulmates behind, and Katara still seemed shaky.</p>\n<p>Sokka looked back at her from Appa’s head as often as he thought he could get away with, only to see her moping and staring off into the distance, as if she could still see Zuko. Her soulmate.</p>\n<p>Their soulmate. <em>His</em> soulmate.</p>\n<p>Zuko was an asshole. He’d been hunting them for months, trying to capture Aang and destroy their last hope for peace. He’d burned Kyoshi Island and stolen Katara’s necklace.</p>\n<p>He’d also rescued Aang – even if he had his own motivations – and promised to give Katara’s necklace back. It could just be a ruse to get closer to them again, but, as much as Sokka hated to admit it, Zuko had a strong belief in honour. He wouldn’t go back on his word like that.</p>\n<p>As for why he was trying to kidnap Aang… if Sokka had been kicked out of the Water Tribe, he couldn’t imagine what lengths he’d go to so he could go back home.</p>\n<p><em>Then again</em>, no one would kick him out unless he did something really terrible. Just because Zuko’s punishment kinda sucks doesn’t mean he doesn’t deserve it. His dad ran the entire country; it must have been his decision. If even his father thought he deserved it… well, Sokka couldn’t even think of something he could do to make <em>his</em> father kick him out.</p>\n<p>He looked back over his shoulder. Katara was still moping, but that probably wouldn’t change for a while. He might as well try to get some answers out of her while everything was still fresh.</p>\n<p>“Katara,” he called, and was gratified when she stopped staring into the abyss as if Zuko would show up out of nowhere. She turned to look at him, and seemed mostly okay. “Did you see anything useful in Zuko’s memories?”</p>\n<p>She glared at him. “He deserves his privacy, Sokka.”</p>\n<p>He held up his hands defensively. “You’re the one who wants us to give him a chance. <em>Come on</em> - sell him to me.”</p>\n<p>***</p>\n<p>Zuko returned to his ship just as the sun came up. Uncle was waiting for him on deck.</p>\n<p>He’d been out all night and also for three months or so, and his headache had come back the second he returned to his body. The attack he’d had afterwards hadn’t helped him much either, especially since it had been so long he’d rather thought he was done with them. He was completely shattered, physically and mentally, but, most of all, emotionally.</p>\n<p>But he knew he’d never be able to sleep unless he figured something out.</p>\n<p>Uncle would know what to do – he’d have suggestions of how to use their bond to capture the Avatar if he thought it was the best course of action, or advice on what to do if he decided to… not do that. And, of course, he would never tell his father that Zuko was soulmates with the Avatar.</p>\n<p>Just having the bond was treasonous – it didn’t matter that he hadn’t wanted it in the first place.</p>\n<p>“Prince Zuko, where have you been?” Uncle called in his pretending-he-hadn’t-been-worried tone. “You missed music night.”</p>\n<p>\n<em>At least something good came out of this mess.</em>\n</p>\n<p>“I need to speak with you, Uncle.”</p>\n<p>“Of course.” He stood, but retained the faux-jovial tone.</p>\n<p>“Not here.”</p>\n<p>Zuko gestured for his Uncle to follow him, and led him to his room.</p>\n<p>He locked the door after checking the corridor was empty.</p>\n<p>“I heard,” Uncle said, “That someone rescued the Avatar from Zhao last night.”</p>\n<p>Zuko wondered if it was treason to call it a ‘rescue’ instead of a ‘theft’.</p>\n<p>“Uncle,” Zuko knew to his bones that uncle would never do anything to betray him, but needed to hear it in words, “What I am about to say is to stay between us.”</p>\n<p>“I would never to anything to cause you harm, nephew, you know that.”</p>\n<p>“Uncle…”</p>\n<p>“I give you my word that everything you say will stay between us. On my honour.”</p>\n<p>Zuko let out a little sigh at hearing what he already knew to be true. Then: “The Avatar and his friends are my soulmates.”</p>\n<p>Uncle blinked, a complex expression passing across his face too quickly for Zuko to interpret before it was smoothed over. “I see. You are certain of this?”</p>\n<p>“They each have a mark that matches my broadswords. Katara touched blood with me and… it worked.”</p>\n<p>Something he’d never shared with anyone, even with his soulmates when they visited before all this started, was that he had never trusted that the soulbond would work. His marks were burned off mere minutes after he was born – and it was well known that a baby’s marks were only formed during their birth. (Stillborns, for example, never had any marks at all; and babies born early were sometimes said to have their marks appear a few seconds after they came out.)</p>\n<p>The marks were as new as him when he was born, and the soul connection could have still been creating itself. And he’d never heard of anyone else losing their soulmarks.</p>\n<p>(It seemed barbaric, in hindsight, to keep someone from the people fate had bound them to.</p>\n<p>He was pretty sure that thought was treason.)</p>\n<p>He’d long since resigned himself to the possibility that he would never touch blood and have it work perfectly, and the fact that everything had gone so smoothly that day was… to be honest, he wasn’t sure what to think about it.</p>\n<p>He liked to think it was a good thing that he could still have soulmates, even though he would have preferred for them to be <em>literally anyone else</em>.</p>\n<p>Uncle nodded, his expression giving away none of his inner thoughts. “And how do you feel about this development, Prince Zuko?”</p>\n<p>Zuko froze. “How <em>should</em> I feel about this?”</p>\n<p>“That is up to you.”</p>\n<p>Zuko was unconvinced. He knew he could trust Uncle, but he didn’t like how he chose not to take any side. Maybe he was trying to avoid nudging Zuko into a direction he wouldn’t have otherwise gone in – trying to make sure this was Zuko’s decision and no one else’s – but he had come to him for advice, not this… introspection.</p>\n<p>(If he made the wrong decision, all the fault would lay with him. And it wasn’t as though he wanted to think about the things he’d done, the people he was stuck with, all that he’d have to do if he wanted to make it up to them…</p>\n<p>He didn’t like that he was thinking about trying to fix things with them either, but something inside him balked at the image of the Avatar in chains.</p>\n<p>The Fire Nation would have no reason to keep Sokka and Katara alive. He didn’t like that notion either.)</p>\n<p>“No one,” Uncle said, “Has the right to tell you how you should feel – especially when it comes to your soulmates. If you want to be with them, then you should; and if you don’t, then nothing needs to change.”</p>\n<p>Zuko nodded as if that was helpful.</p>\n<p>“So, Nephew,” Uncle said again, “how do you feel about this development?”</p>\n<p>“Katara’s mother was killed by the Fire Nation,” he found himself saying. “She hadn’t done anything wrong, wasn’t even a fighter, but they killed her. Katara is the last waterbender in the entirety of the South Pole. And their village… I hadn’t realised, but that’s basically all that’s standing between the Southern Water tribe and extinction. Just a handful of outposts like that.”</p>\n<p>Uncle nodded. “It is a shame that that has happened.” His tone and expression remained neutral, but there was something encouraging in his nod, so Zuko continued.</p>\n<p>“It’s not right. We… we shouldn’t have done that. The Fire Nation is supposed to be sharing our greatness, but instead,” he took a deep breath, unable to look his Uncle in the eye. He might have been making a huge mistake. “The war isn’t what we think it is, Uncle.”</p>\n<p>***</p>\n<p>Sokka really was infuriating sometimes. Mostly when he was right.</p>\n<p>Katara nodded at his suggestion – it would be best to give him some impression of Zuko, aside from what they already knew of him – and paused to think. It would be best not to talk about anything too traumatic; Zuko had specifically asked her <em>not</em> to do that and she felt that she’d cried enough that day, besides.</p>\n<p>He wouldn’t want her to talk about anything embarrassing either, but, from what she’d seen of his childhood, his past was made up almost entirely of trauma and adorableness. She didn’t have many other options. He’d forgive her.</p>\n<p>“Okay, so. You know his intimidating faces and monologuing shtick, right?”</p>\n<p>Sokka nodded, his eyebrows scrunched in confusion. That probably wasn’t the <em>best</em> opener when she was trying to convince Sokka that Zuko wasn’t evil, but…</p>\n<p>“It’s totally rehearsed,” she said, watching Sokka freeze. She grinned, “Zuko’s a little nerd. He doesn’t even come up with half of it, he just loves theatre.”</p>\n<p>Sokka expression of pure glee was something Katara would treasure more than she would ever admit. “So what’s he like when he’s not pretending?”</p>\n<p>“He’s so awkward. He pretends he’s being angry but really he just doesn’t know what to do. I can’t take him seriously anymore. He’s like a little turtleduck – he loves them by the way.”</p>\n<p>“Turtleducks?”</p>\n<p>“When he was little he would sneak them into his room and make nest for them – and he was such a cute kid.”</p>\n<p>Sokka frowned. Katara couldn’t blame him; until she’d seen baby Zuko herself she couldn’t have pictured it either. The way he acted, it was like he’d blasted his way out of the womb, screaming.</p>\n<p>“He grew up though,” Sokka said, unconvinced. “What changed?”</p>\n<p>Katara hesitated. “He asked me not to talk about <em>that</em>, specifically, but…” she paused.</p>\n<p>“Okay so think about it this way,” she said. “Zuko was raised by the worst person on earth, right?”</p>\n<p>Aang and Sokka nodded immediately. No trace of argument there.</p>\n<p>“Do you think Ozai would approve of Zuko doing anything that we would approve of?”</p>\n<p>***</p>\n<p>Iroh watched his nephew list to the side, almost falling asleep sitting upright, only to correct himself with a scowl. This had happened seven times, now.</p>\n<p>Iroh got up to retrieve and brew some chamomile and lavender tea, sitting down at his nephew’s side as it stewed. Zuko instantly leaned into him, the smell of the tea enough to make him drowsy.</p>\n<p>Well, drowsi<em>er</em>.</p>\n<p>It wasn’t long before his nephew finally dropped off to sleep. Since they were already in his chambers, it was easy enough for Iroh to settle him in his bed. Zuko, normally an extraordinarily light sleeper, didn’t react once throughout the process.</p>\n<p>Iroh knew it would be best to leave him for the moment and organise the ship’s departure. Regardless of what Zuko’s chose, he would want to be following the Avatar.</p>\n<p>Instead, he knelt beside his bed, watching the rare calm across his nephew’s face, and ran a gentle hand over where his hair should have been.</p>\n<p>Zuko’s soulmates were the Avatar and his friends. It was likely that he was destined to be the Avatar’s firebending teacher.</p>\n<p>If anyone were to find out, Zuko would be executed. Some part of Iroh couldn’t help but be grateful that there was no evidence of their bond on Zuko’s body, even as he shuddered to remember why.</p>\n<p>(He remembered all too well the struggle he went to to keep Lu Ten’s soulmarks hidden from his father and brother. He knew that Ozai would have never even <em>considered</em> protecting his son’s soulbonds.)</p>\n<p>Iroh tried to be optimistic about the situation; it now seemed quite likely that Zuko would join the Avatar of his own accord, especially considering the way he’d been speaking. It was the first time Zuko had said anything treasonous on purpose, it seemed.</p>\n<p>Perhaps his adventure the previous night had broken the seal on treason.</p>\n<p>Zuko was normally a stubborn and decisive boy, but his worldview had changed drastically since he last saw him, and he was, for once, unsure as to what the right thing to do was. Iroh knew that whatever he suggested, be it to join the Avatar or to fight him, would be the only thing that could sway him to either side.</p>\n<p>He shouldn’t have been hesitating. It was the right thing to do – encouraging his nephew to seek out the people who would, given a little more time, love him as much as Iroh himself did; not to mention that the Avatar needed all the help he could get, and that Zuko would be an invaluable addition to his team.</p>\n<p>Zuko’s scar was huge and angry and likely still painful; it was the only reason Zuko was hesitating. He knew the consequences for displeasing his father all too well. He needed to be sure before he committed.</p>\n<p>***</p>\n<p>Aang would be the first to admit that he didn’t quite grasp the bond that came from shared blood, having never known himself to share blood with anybody. Despite that, he knew - mostly from watching Sokka and Katara, who, despite their widely differing personalities and many arguments, cared for each other deeply - that family, to those who had it, would always be incredibly important. As much as soulmates, even, as mad as that seemed.</p>\n<p>“Ozai wouldn’t hurt Zuko though?” Aang asked, looking between his friends. “He’s his son. That’s important, isn’t it? Zuko should be able to do as much treason as he wants.”</p>\n<p>Katara flinched at his question, and very deliberately turned her head away.</p>\n<p>“Katara?” Sokka asked, attention firmly fixed on her.</p>\n<p>She didn’t respond.</p>\n<p>Aang had a very bad thought. “Katara, do you know how Zuko got his scar?”</p>\n<p>She swallowed. “He asked me not to talk about that.”</p>\n<p>“Kat-”</p>\n<p>“Don’t ask me about that,” she said, sharper than she needed to. “Please.”</p>\n<p>“You said he might change his mind,” Sokka said, out of nowhere. “About coming with us. Why?”</p>\n<p>Katara gave Sokka a small smile, looking at him and not seeing Aang’s pleading expression. “We just turned his life on its head, Sokka. Imagine how you’d feel if you found out you’d been fighting your soulmates. He just needs some time to figure things out.”</p>\n<p>Sokka raised one sceptical eyebrow. “How sure are you about that?”</p>\n<p>“He’s a good person at heart,” Katara insisted. “But he knows the price of treason, and he knows the Firelord wouldn’t be lenient with him. His whole crew would be in danger if he switched sides – his Uncle especially.”</p>\n<p>Aang blinked. “The old man who follows him around all the time?”</p>\n<p>Katara grinned at him. “He’s pretty awesome. I’m hoping that Zuko will talk to him about this instead of just freaking out about it in private. Uncle cares <em>way</em> more about Zuko than he does about the Fire Nation, so if anyone’s gonna encourage some treason it’ll be him.”</p>\n<p>Aang nodded. That fit with what he’d been told about blood family a lot better than everything with Zuko’s father. Maybe Zuko should just make his Uncle his dad. Is that allowed?</p>\n<p>“That depends,” Sokka said, “On what he values most-”</p>\n<p>“It’s <em>Zuko</em>,” Katara huffed, “I just told you.”</p>\n<p>“Yeah, but his happiness or his safety?”</p>\n<p>Katara paused. “If he thinks we have a chance at winning the war…”</p>\n<p>They exchanged a look that Aang pretended not to see.</p>\n<p>“Someone has to be the sceptic here,” Sokka said eventually, “But… I’m willing to wait and see with him.”</p>\n<p>“Yes!” Aang shouted. “Soulmate Zuko! And he can be my firebending teacher, too!”</p>\n<p>Sokka nodded, something going on behind his eyes. “Yeah, I can’t deny that having a Fire Prince on our side could be <em>very</em> useful.”</p>\n<p>Aang bounced in his seat. Knowing Zuko, it wouldn’t be long before he showed up again. It was strange to be looking forward to it.</p>\n<p>Katara found it morbidly appropriate when Zuko’s mark started flickering during her healing lesson.</p>\n<p>Okay, fine, that was a lie - Sokka called it morbidly appropriate when she saw him later on. The only thing Katara had felt at the time was frustration and panic. This was the first she had heard from Zuko after he rescued Aang, and it was because he was dying.</p>\n<p>(When she got to know him even better, this type of thing became the norm. Despite her objections.)</p>\n<p>She’d seen enough of Zuko’s stubborn determination to survive that she wasn’t too worried that he would actually die, but was concerned about what this meant for his general health. He’d probably have a new scar or two the next time she saw him.</p>\n<p>But he would be fine. If there was one thing about Zuko she could trust, it was that he would always turn up at the most inconvenient time. He would be fine.</p>\n<p>Her wrist throbbed.</p>\n<p>She couldn’t remember much about her lesson after it finished.</p>\n<p>***</p>\n<p>Zuko stood on the sand and watched his ship burn. She was useless - a tiny, ugly thing made mostly of rust rather than real steel - but she had served him and his crew to the best of her abilities for almost three years. She had been his home.</p>\n<p>He was lucky that he’d already been preparing for his trip to the North Pole and so had managed to save most of what he’d need in the next few days. He’d begun preparations as soon as Zhao had stolen his crew and he’d realised that he’d have to steal aboard one of his ships if he wanted to reach the North Pole.</p>\n<p>Which he most certainly did. Zhao was up to something worse than usual, and the North Pole would be where all the action was. Regardless of what he chose to do about his soulmates – and he <em>was</em> still questioning it, no matter what the swords and mask at his hip<em> (what the necklace tied firmly to his wrist)</em> suggested about his intentions – he would have to be where they were.</p>\n<p>Uncle stepped up beside him, standing a little closer than Zuko would normally have permitted. Uncle had thought him dead for a few minutes.</p>\n<p>Zuko <em>had</em> almost died. His hands trembled with leftover adrenaline. He shifted just a little closer to Uncle in case he wanted to hug him.</p>\n<p>“Unless you declare otherwise,” Uncle said, steadfastly not hugging him. (It wasn’t like Zuko could outright give permission; Uncle would get the wrong idea.) “The Fire Nation will believe you dead.”</p>\n<p>The Fire Nation – his father – would have no reason to target <em>him</em> specifically, if he chose his soulmates; they would only know this mysterious Blue Spirit figure. If he chose treason and didn’t enjoy it, it would be simple enough to disappear somewhere in the Earth Kingdom. No one would even know to look for him.</p>\n<p>This would be his best opportunity if he wanted to switch sides.</p>\n<p>His scar prickled, irritated by the heat of the explosion. He inched just a little closer to Uncle, who wrapped a careful (grounding) hand around his waist.  </p>\n<p>His ribs ached, and he reassured himself by pressing on the wound. The remainders of his marks weren’t the cause of the aches.</p>\n<p><em>They weren’t hurt</em>, he promised himself amid the pain, <em>I’m the only one that’s hurt. No matter what I choose to do, I’ll protect them.</em></p>\n<p>He didn’t know why he kept pretending to himself.</p>\n<p>***</p>\n<p>The siege had started and Zuko was flickering again. Katara anxiously kept watch over the mark as Aang struggled to fall into a meditative state.</p>\n<p>It seemed silly, even selfish, to be worrying about the Prince of the Fire Nation at a time like this, but she <em>knew</em> him now. He might not have been her ally, not yet, but she liked to think he was her friend.  </p>\n<p>She was certain Aang thought the same; even though he hadn’t seen Zuko’s memories like she had  (and <em>dear sweet Tui</em> it would tear him in two if he saw them) he spoke fondly of how they had fought together.</p>\n<p><em>We were a good team</em>, he’d told them over and over. Even when they met Jeong Jeong he’d refused to consider having anyone else as his firebending teacher.</p>\n<p>Katara had encouraged him, if only to see the frustration on Sokka’s face.</p>\n<p>(He was gonna feel like such an asshole when he saw.)</p>\n<p>Katara let herself relax a little as Aang began to glow.</p>\n<p>“Is he okay?” Yue asked.</p>\n<p>“He’s crossing into the Spirit World,” Katara explained. “He’ll be fine so long as we don’t move his body.”</p>\n<p>“Maybe we should get some help?”</p>\n<p>“No. He’s my friend – my soulmate, actually,” Yue’s eyes widened a little. Apparently Sokka had neglected to mention that during their talks together.</p>\n<p>(Then again, soulmates had been a sore spot for him lately. No one wanted to say it, but Sokka – the ‘rational’ member of the group - seemed almost hurt that Zuko had rejected them, despite there being multiple reasons for him to do so.)</p>\n<p>“I’m more than capable of taking care of him,” Katara finished. It had been a struggle to get herself the waterbending lessons she’d wanted, but, through a combination of showing up to watch the lessons uninvited and repeatedly challenging Pakku to fights so she could get her practice in, she’d worn Pakku down enough that he just ignored her when she showed up.</p>\n<p>“It’s easier with help though, isn’t it?” A voice cut across the oasis. A masked figure, clothed in white with a familiar set of swords swinging at his hip, strode towards them.</p>\n<p>\n<em>(How did he even get in here?)</em>\n</p>\n<p>Katara rushed forwards to hug him, but hesitated when she got a closer look at him.</p>\n<p>She immediately noticed his odd way of moving – it wasn’t a limp, nor did he appear to favour any injury, but he definitely wasn’t at a hundred percent. She had suspected he was injured earlier, considering how his marks had been flickering recently, but had unconsciously dismissed the notion when she realised he was coming to join them, assuming he wouldn’t be throwing himself into a dangerous situation while injured.</p>\n<p>She realised what a stupid thought that was the second she stopped to think about it. Uncle was the only person who cared enough to keep him out of trouble, but Zuko wouldn’t listen to him, especially when it came to his own safety.</p>\n<p>She was going to heal him, then smack him, then heal <em>that</em> and then lock him in a block of ice so he wouldn’t get hurt again.</p>\n<p>The idiot.</p>\n<p>“You’re injured,” she told him, unsure if he actually cared enough to do anything about it.</p>\n<p>He waved her concerns away with a gesture, but elected to sit on a rock when he reached them. Katara was going to be generous and call that a concession.</p>\n<p>She wreathed her hands in water and sat down in front of him. He tilted his head in confusion, expression still hidden behind his mask.</p>\n<p>As if she didn’t know it was him somehow.</p>\n<p>“Will you take that thing off?”</p>\n<p>He glanced towards Yue and Katara felt her eye twitching. Would dealing with Zuko always be immediately infuriating?</p>\n<p>“Yue can keep a secret.” Katara scowled. “Take it off.”</p>\n<p>Zuko didn't take it off. </p>\n<p>\"If it's your identity that concerns you,\" Yue said, \"Then I give my word not to reveal it.\"</p>\n<p>He paused in thought for an insulting amount of time, then pulled it off and – yep, that was a black eye.</p>\n<p>Katara raised her water-wrapped hands to his face unthinkingly and Zuko – <em>of course</em> – flinched, falling off his perch to land flat on his back.</p>\n<p>She pulled back, dropping her water, and lowering her hands into a non-threatening posture.</p>\n<p>She gave him a moment to gather himself, then: “Sorry.”</p>\n<p>He looked up at her. He hadn't moved from where he'd landed, but otherwise seemed okay enough. She continued, keeping her voice low and soothing, “I can heal you, if you want me to.”</p>\n<p>He looked at the spilt water at her feet.</p>\n<p>“That’s all I was going to do.”</p>\n<p>Zuko sat up but stayed on the ground. “I know.”</p>\n<p>She offered him a hand up. “Will you let me heal you?”</p>\n<p>He stared at her hand. “...Could you just do my ribs?”</p>\n<p>That bruise looked painful. It was a shame it was directly over his eye.</p>\n<p>“Whatever you want,” she promised. </p>\n<p>He accepted her hand and sat back on the rock. He didn't let go, after, nor did he stop staring at it.</p>\n<p>“I’m sorry,” she said, pushing down frustration at his immediate look of confusion. “About that, again, but also… I shouldn’t have forced you, last time I saw you. I had no right to that and I just wasn’t thinking and that’s no excuse, but-”</p>\n<p>“It’s okay, Katara.” He squeezed her hand gently. “It – it wasn’t <em>right</em> of you to force me to soulbond, but it was necessary. I wouldn’t have believed it otherwise, and the things I saw… nothing matched what I’d been told about the war. I needed to see it – and I <em>needed</em> the proof that we were soulmates.”</p>\n<p>He let go of her hand and turned his head away, ending the conversation. He then pulled up his tunic, watching her wrap her hand in glowing water with a twitch of her fingers.</p>\n<p>“You’ve found a Master,” he commented, while she tried not to stare at the pale pink skin on his stomach where his soulmarks used to be.</p>\n<p>“Mm. Mostly.”</p>\n<p>He cocked his head as she placed her hands over his ribs. She opened her mouth to explain, but then-</p>\n<p>\n<em>“Are these broken?”</em>\n</p>\n<p>“Cracked,” he corrected, as if the distinction mattered when he was throwing himself into a fight with <em>broken ribs</em>. “At worst. They might just be bruised.”</p>\n<p>“They’re broken.”</p>\n<p>“I’m pretty sure they’re cracked. They’re <em>my</em> ribs,” he sounded almost indignant, “I’d know.”</p>\n<p>“<em>I’m</em> the healer here-” and if she hadn’t almost sent him into another panic a minute ago she’d have smacked him for that comment, “-and <em>I </em>say they’re broken.”</p>\n<p>“I’m fine. I’ve fought with worse before.”</p>\n<p>“You didn’t even know I could heal,” she moaned, dropping her water to bury her head in her hands. “Were you planning to fight with broken ribs?</p>\n<p>“I’ve done it before,” Zuko repeated. Then, just to be an asshole, he added, “I was more worried about the probable concussion, honestly.”</p>\n<p>She stared up at him. “You are just the worst person.”</p>\n<p>“I am well aware of that.”</p>\n<p>“You need to take better care of yourself.”</p>\n<p>“You need to stop imitating Uncle.”</p>\n<p>“This is just what caring sounds like, Zuko,” she glowered. “Now let me see your concussion or you’re not allowed to fight in anything.”</p>\n<p>“If you bench me I’ll kidnap Aang again.”</p>\n<p>“You say ‘again’ as if you ever actually succeeded,\" she scoffed, waggling a finger at him. \"He’s kidnapped you more often than you’ve kidnapped him.”</p>\n<p>“That is not accurate.”</p>\n<p>“That’s what happened.”</p>\n<p>“I captured him the day we met.”</p>\n<p>“He turned himself in and escaped half an hour later. We <em>let you go</em> at least six hours after he caught you.”</p>\n<p>“…That’s not how I remember it.”</p>\n<p>“That’ll be the concussion. Are you going to let me check on it?”</p>\n<p>Zuko grumbled but didn’t actually protest, and Katara took at it the agreement that it was.</p>\n<p>…it was definitely a concussion.</p>\n<p>Katara gritted her teeth and resisted the counterproductive urge to smack him upside the head.</p>\n<p>***</p>\n<p>It was so weird having a friend.</p>\n<p>Zuko was soothed by his soulmates’ mere presence, and there was something pleasant about the way she fussed over his injuries.</p>\n<p>Katara stuck her tongue between her teeth in concentration as she numbed his headache and whisked the fog from his thoughts. Aang gave out a gentle glow where he meditated on the ground, his lemur curled in his lap.</p>\n<p>Zuko couldn’t understand why he’d ever thought he could value his own self-preservation over the happiness of his soulmates. He couldn’t believe he’d ever done anything to hurt them.</p>\n<p>He was going to make it right.</p>\n<p>***</p>\n<p>The siege had started and Zuko was flickering again. Sokka took that as a sign that he was in the North Pole somehow.</p>\n<p>He’d meant what he’d said when he’d promised Katara and Aang that he would give Zuko a chance, but unless the guy came in with an apology and a promise to work with them from here on out, offered completely upfront without prompting, Sokka was unlikely to give him any more chances.</p>\n<p>He wasn’t feeling particularly charitable at the moment either, dealing with Hahn and getting kicked off the mission would do that to a guy, and watching the destruction of the last real stronghold of his people wasn’t all that great for his mood either.</p>\n<p>He wasn’t all that sure how to feel when he found Katara healing Zuko in the middle of the secret spirit oasis not two feet away from Princess Yue the beautiful and elegant and not-even-<em>slightly</em>-a-warrior.</p>\n<p>He hoped Katara had made Zuko swear himself to their side before she made him less vulnerable.</p>\n<p>(<em>Hoped</em> has a very different meaning to <em>believed</em>.)</p>\n<p>“How did you even <em>get</em> here?” he asked, walking towards them at an <em>un</em>hurried pace - <em>no</em>, he was <em>not</em> panicking - instead of voicing all of his other concerns. His low-level hostility was perfectly appropriate, and Katara had no right to be making <em>that</em> face when she was <em>healing their mortal enemy</em>.</p>\n<p>It was so hard, sometimes, being the only member of Team Avatar that actually wanted to live.</p>\n<p>“Turtle-seal tunnels,” Zuko said, as if that made sense.</p>\n<p>Sokka’s step faltered for a moment. “You<em> swam</em>? You, a <em>firebender</em>, swam in the arctic ocean long enough to reach the city centre?”</p>\n<p>“With a concussion,” Katara added.</p>\n<p>“And broken ribs,” Yue said.</p>\n<p>“<em>Cracked</em> ribs.”</p>\n<p>Katara buried her head in her hands. The gesture seemed well practised.</p>\n<p>“Katara, I know what broken ribs feel like and this isn’t that.”</p>\n<p>And <em>Zuko the Determined Crazy Persistence Predator </em>suddenly became <em>Zuko the Self-Destructive Idiot</em>. It should have been reassuring, but somehow wasn’t.</p>\n<p>(Sokka was destined to forever remain the only member of Team Avatar that actually wanted to live.)</p>\n<p>Sokka sat down with the group, keeping a casual hold on his boomerang that felt irritatingly unnecessary when Zuko was so bruised.</p>\n<p>At least he knew why his mark was flickering before.</p>\n<p>Zuko didn’t even seem to realise that what he’d done was a big deal.</p>\n<p>“How are you not dead?”</p>\n<p>Zuko gave him a slow blink. Was that a bruise under his eye or was he just <em>that</em> tired?</p>\n<p>“I <em>am</em> dead, actually.”</p>\n<p>\n<em>What?</em>\n</p>\n<p>Katara flinched.</p>\n<p>“Or, rather, Prince Zuko is dead.”</p>\n<p>Sokka raised an eyebrow when he didn’t elaborate. “I think you’ll need to explain it better than that.”</p>\n<p>Zuko gave a slow smirk and sat back a little and <em>Tui and La he’s rehearsed this</em>.</p>\n<p>“Prince Zuko, Agni bless his soul, was <em>tragically</em> slain by pirates, who blew up his ship with him on it. The explosion was so huge, so disastrous, that Zuko's body was destroyed beyond all chance of finding him. By the Grace of Agni, his crew had all left to join the invasion, and his Uncle wasn’t on the ship at the time, making Zuko the only casualty.”</p>\n<p>Katara was completely right: Zuko was a little nerd. How did he manage to make something as metal as <em>faking your death</em> seem dorky?</p>\n<p>Katara frowned next to him. “Uncle knows you’re alive, right?”</p>\n<p>Zuko scrunched up his nose, affronted. “Of course Uncle knows. Even if I hadn’t needed his help breaking into one of Zhao’s ships, I could never have done that to him-” Katara nodded, and Sokka got the impression that he was missing something, “- and the few seconds when he thought I was dead was just painful to listen to.”</p>\n<p>Katara threw her hands up, clearly wanting to slap him. “You didn’t <em>tell him </em>before you did it? What if something went wrong and he was on the boat?”</p>\n<p>Zuko blinked. “It’s not like I was <em>expecting</em> someone to try to kill me – well, more than usual, at least…”</p>\n<p>So it was less of a faked-death and more of him capitalising on people trying to kill him. Zuko didn’t seem to think the distinction was important – no, he didn’t think the distinction needed to be made; it was <em>obvious</em> that people were trying to kill him. The alternate explanation involved him <em>thinking ahead </em>and<em> making plans </em>and<em> being clever</em> and Zuko didn’t know how to do any of those things. It made much more sense that he'd just pissed someone off.</p>\n<p>Sokka resisted the urge to stick his head in the pond and <em>scream</em>, instead just sharing a commiserating look with Katara.</p>\n<p>Sokka made the executive decision to not hear more about Zuko almost dying and ask the important question, “You<em> are</em> on our side here, right?”</p>\n<p>“The Blue Spirit is on your side, as he has proven to be before.” That <em>almost </em>counted as an answer, but became less useful when one remembered that the Blue Spirit was in no way real, nor was he connected to Zuko. “Zuko, of course, is dead, and so has nothing to do with anything that happens from here on out.”</p>\n<p>Sokka sighed. “I respect the bit that you’re doing right now, but I really need a more concrete answer here.”</p>\n<p>Zuko nodded, “That’s fair,” and pulled a knife out of nowhere.</p>\n<p>Sokka flinched back. (<em>Why would a firebender even </em>need<em> a knife in the first place?</em>) “What are you-”</p>\n<p>Zuko cut off his stupid ponytail.</p>\n<p>Katara gasped, hands covering her mouth.</p>\n<p>Yue looked just as baffled as him, though that was fair considering she didn’t even know who Zuko <em>was</em>.</p>\n<p>Katara leapt up and threw her arms around Zuko, pulling him into a hug that he clearly didn’t know what to do with, not letting go even when he started to flail a little, the few patches of unmarred skin on his face bright red.</p>\n<p>He eventually pushed her off and she sat back in her seat, eyes bright and shining.</p>\n<p>“I get the feeling,” Sokka said, pushing down hopeful suspicions, “That I’m missing something here.”</p>\n<p>Zuko sliced open the edge of his palm, then flipped the knife and offered the handle to Sokka. “Do you want the explanation?”</p>\n<p>Sokka remembered how Katara had cried most of the day after she watched his life, tears coming in starts and stops whenever she was left alone with her thoughts for too long. None of them had managed to sleep through the night, listening to her nightmares over and over again.</p>\n<p>Sokka would need all his wits about him for the siege.</p>\n<p>But this was an olive branch and Zuko had always been a curiosity and he almost seemed to be <em>smiling</em> at him. It suited him.</p>\n<p>Sokka took the knife, made his own cut over the scar from the last two he’d done, and took Zuko’s hand.</p>\n<p>Zuko was <em>tiny!</em> He was small and round and constantly asking questions and running into walls in his excitement. He was a little boy.</p>\n<p>Katara hadn’t mentioned how tiny he was as a baby - but, then again, <em>everyone</em> was that tiny as a baby. She must have thought it was obvious - and really it was – but he hadn’t been prepared for this bright-eyed grubby handed version of his mortal enemy/destiny-recommended friend.</p>\n<p>He was, in the first memory Sokka was shown, pacing his room reciting something from a scroll on his bed. He was exactly as dramatic as he always had been, and Sokka didn’t understand how he’d never realised that all his dramatics and monologues and intimidating faces were all smoke and mirrors.</p>\n<p>Tiny Zuko played games with his mother and chatted with the palace guards and pspsps-ed at the local owlcats. He tripped as he ran through hallways, and Sokka rubbed his shoulder as he sniffed over grazed knees.</p>\n<p>***</p>\n<p>Sokka learned a lot about the Fire Nation via Zuko. During his fifth vision he learned about the significance of their topknots, and what it had meant that Zuko had cut his. It took twelve visions (of a gap-toothed Zuko smiling at pretty flowers his mother grew and asking for hugs when he fell over) before a five-year-old Zuko was considered old enough to begin his training, and Sokka saw the best and worst parts of the Fire Nation.</p>\n<p>The soldiers that trained in the barracks were just… people. They cooed over baby Zuko when no one was watching, and helped him with his sword stances. Even the benders were gentle with him, wrapping him in encouragements and keeping quiet about the dangers of being non-bending nobility.</p>\n<p>Sokka was surprised to learn that Zuko had been a late bloomer. This little fact showed Sokka the worst parts of the Fire Nation.</p>\n<p>Well, the worst part. Singular.</p>\n<p>It was Ozai.</p>\n<p>And Sokka was going to kill him one day.</p>\n<p>***</p>\n<p>\n<em>“Your sister mastered those forms six months ago, Prince Zuko.”</em>\n</p>\n<p>His sister liked to push Zuko into the pond and delay him on his way to training.</p>\n<p>\n<em>“Your tutors have been ordered to use whatever means they find necessary to made this knowledge stick in your empty head.”</em>\n</p>\n<p>Sometimes Sokka found fingertip bruises around his pale wrists. He could only hope that someone has been there when they first appeared.</p>\n<p>\n<em>“Prince Zuko, I strongly suggest you find whatever traces of Fire exist within you before the end of the month. Your existence as it is disgraces me, disgraces our Nation, and I can’t imagine what use I would have for a non-bending heir.”</em>\n</p>\n<p>Sokka knew it was his duty, as soulmate, to comfort Zuko through these times. He also knew that he’d never be able to grab Ozai by his stupid goat beard and give him the pummelling he deserved in his ghostly form. This did not mean it was not difficult for him to restrain himself from throwing hands every time he saw Ozai.</p>\n<p>***</p>\n<p>Sokka wondered how many people could get away with branding a Prince, wondered how likely it was that some assassin or kidnapper had managed it, considering how well Zuko fought. The edges of his scar were almost neat, and the wound itself was deep, as though he had been still when it had happened.</p>\n<p>Sokka had seen Zuko in action. He was quick as a blink and constantly on guard.</p>\n<p>It wasn’t a fight.</p>\n<p>***</p>\n<p>Sokka was man enough to admit that he’d become fond of Zuko the second he started acting like a dramatic little nerd in the Spirit Oasis. He couldn’t help it; everything he thought he knew about the guy was completely unravelled by this absolute <em>dork.</em> It only got better when he watched Zuko reading out his scrolls, and nothing could have prepared him for the joy of going to the theatre with him.</p>\n<p>Together, they ripped into the sacrilege that was The Ember Island Players’ rendition of ‘Love Amongst the Dragons’. Sokka expressed his disgust by squeezing Zuko’s arm, his laughter with an arm around his shoulders. (Zuko needed more casual touch in his life, and Sokka was more than willing to supply that.) Zuko’s face was a sight to behold on those nights, and it was always fun when he corrected the actors getting their lines wrong.</p>\n<p>Sokka thought back to Zuko’s missing ponytail in the real world, to his steady hand as he offered him the knife. The calm and sureness in his expression as he offered Sokka his soul.</p>\n<p>His tiny baby nerd friend, who looked at him (a little to the left but close enough) with wide eyes and called him ‘Brother’, had pledged himself to them. He was theirs, and Sokka couldn’t wait to get back to his body and give him a real hug.</p>\n<p>***</p>\n<p>A six-year-old Zuko promised his father with a determined pout and shaking knees that he would do better.</p>\n<p>There was nothing but conviction in the week that followed, his days full of failed katas and nights spent staring into candles until he finally managed a few weak sparks.</p>\n<p>His expression of sheer joy was not worth the preceding weeks of fear and exhaustion, but it did soften them.</p>\n<p>***</p>\n<p>Zuko had only defected a few days ago – and that was, as far as Sokka could tell, mostly because of their bond, rather than a genuine belief in their cause or a hatred for his father.</p>\n<p>Did Zuko even know how messed up this was?</p>\n<p>***</p>\n<p>Zuko’s face was starting to look like Zuko’s face. This was a problem. At least, it would be soon enough.</p>\n<p>Their was a cold pit of dread in his stomach every time he looked at Zuko, every time he was brought to a new incident in his childhood, and he wondered if this would be the last time he’d look like <em>that</em>, all round faced and happy-ish and with all his face where it was meant to be. He only scowled when he chose to, a luxury the Zuko he knew was not afforded .</p>\n<p>Why couldn’t Katara have told him what to look out for? At least then his visits with his baby nerd brother wouldn’t have been marred with ‘what-if’s.</p>\n<p>(It wasn’t that he didn’t know exactly why Katara hadn’t told him – Zuko’s scar was his business until he decided otherwise, and if he’d wanted Sokka to know about his scar ahead of time he’d have said something.</p>\n<p>(It was not only possible but actually quite likely that Zuko simply hadn’t thought that far ahead but he liked to give the guy some credit where he could.))</p>\n<p>He’d though it might have been the incident when he was nine and his father was ordered to kill him.</p>\n<p>(Sokka had tried with all his might to push him out of his ball of panic and force him out the window; a terrible fear that if he didn’t Zuko would actually <em>die</em> guiding his hands. Zuko was alive in their time, but was that only because Sokka had dragged him out of danger? Time travel was tricky business.)</p>\n<p>He’d wondered if the the burn was meant to kill him, and he’d been allowed his life when he survived the infection, but Zuko got out of that incident suspiciously unharmed with his grandfather suspiciously dead and his mother suspiciously missing and Zuko not suspecting there was anything wrong with that <em>for the love of the spirits, Zuko.</em></p>\n<p>Willful ignorance was a powerful thing.</p>\n<p>Time moved on and training got harder. Sokka nudged him into his proper stances when his Sifus refused to demonstrate a second time just so they had an excuse to burn him. Ozai turned an irritated eye on Zuko’s injuries, only making things worse for him the more he struggled to keep up out of some sick belief that he would gain strength through trauma.</p>\n<p>Or maybe he was hoping Zuko would die one of these days, and Ozai would be done with his ‘weaker’, more compassionate, heir.</p>\n<p>Either way, it didn’t bode well.</p>\n<p>***</p>\n<p>Four spirits brushed hands with him when they entered the war meeting. Sokka pulled a deep breath into his non-existent lungs and closed his eyes for a second. Just a second, so he could prepare himself.</p>\n<p>He sat in front of Zuko in the meeting, their knees touching, drinking in his unblemished face.</p>\n<p>In the back of his mind, he wondered if he shouldn’t be paying more attention to the meeting itself. He listened to every other word but he was in a <em>Fire Nation war meeting</em> and instead of dissecting their tactics, the ways they made their decisions; instead of memorising the Generals’ faces for future reference, he was totally-not-crying at Zuko’s face.</p>\n<p>(He wished he could just be angry; at least he’d know what to do with that.)</p>\n<p>Zuko stood with a stomp and yelled about honour and justice and betrayal and looked just like himself in every way that mattered.</p>\n<p>Zuko was ordered to fight in a duel. He set his jaw and squared his shoulders and clenched his hands into fists that might not have been shaking.</p>\n<p>Sokka squeezed his shoulder and hoped it would be quick.</p>\n<p>***</p>\n<p>It wasn’t quick.</p>\n<p>***<strike></strike></p>\n<p>Sokka was so ready to kill the Firelord.</p>\n<p>Zuko was so ready to capture the Avatar so he could go home and meet his soulmates.</p>\n<p>(Sokka was sure his forehead would hurt from all the slapping if he actually had a physical form.)</p>\n<p>Zuko refused to slow down, to take a minute to heal. He raced across the globe, throwing himself headlong into danger chasing the chance of a lead.</p>\n<p>Uncle really was an awesome dude – he was chill and clever and gentle and Zuko listened to almost half the things he said – but he should have tied Zuko down and force fed him sweet bean buns and nice words every once in a while.</p>\n<p>It probably wouldn’t have worked, but Sokka would have liked to see it happen.</p>\n<p>***</p>\n<p>Zuko found them. He did increasingly stupid things trying to capture them, and he did it so he could meet them.</p>\n<p>Sokka wondered if Zuko had pissed off one spirit too many while hunting down leads, and now the spirit was laughing at them.</p>\n<p>Zuko teamed up with pirates and threw himself into fights and crept aboard one of Zhao’s boats. He swam in arctic waters with broken ribs.</p>\n<p>***</p>\n<p>Sokka was sitting on a rock in an oasis in the middle of the North Pole. The invasion was still on. He still had to deal with that.</p>\n<p>He was so spirits-damned <em>tired</em>.</p>\n<p>Zuko looked similarly exhausted, unfocused eyes staring at the ground, a slump in his shoulders that he usually tried to keep hidden. He gripped his seat tightly, blood oozing from the cut on his palm.</p>\n<p>His breaths heaved in and out slowly. Like someone with asthma trying to meditate.</p>\n<p>“Zuko.”</p>\n<p>He was pale as a corpse, his eyes heavy somehow. His ponytail, held in place by remnants of ribbon, sat by his feet like a dead mouse-sparrow.</p>\n<p>Sokka stepped over the ponytail, grabbed Zuko shoulders and pulled him into a hug. He was stiff and unresponsive, confused and concerned in equal parts, eventually moving his arms up and around in an attempt at returning the gesture.</p>\n<p><em>Dear sweet Tui and La</em> the kid didn’t know how to <em>hug.</em></p>\n<p>Katara smugged at Sokka over Zuko’s shoulder and he couldn’t quite find it in himself to be annoyed at her. It may have been one of those rare occasions in which Katara was right.</p>\n<p>Zuko eventually softened in his arms, leaning into his hold and <em>oof</em>, he was heavy. Sokka shifted them so they were sat down again, keeping an arm firmly around Zuko’s shoulders.</p>\n<p>Sokka wasn’t sure how much Zuko had slept over the last few days. He’d only really seen snippets of his various ridiculous schemes, often just being brought in to tap a tune on his shoulder in reassurance that he wasn’t about to die – and Sokka was very annoyed when he realised that that’s what destiny had been having him do – but he was fairly sure that he’d spent the last few nights hiding on one of Zhao’s ships, recovering from explosions, before he broke in to the North Pole using turtle-seal tunnels and Sokka would have to punch him for that after he healed up because-</p>\n<p>“You know turtle-seals can hold their breath for like, two hours, right?”</p>\n<p>Zuko gave him a sleepy blink and leaned further in to his shoulder. He didn’t even care that his plan should never have worked in the first place and he should have drowned underneath the North Pole and no one would have known.</p>\n<p>Well, they would have known he was <em>dead</em> but not how or when or why; they wouldn’t have known he was coming to help them. Sokka might not have believed he had been.</p>\n<p>Sokka tightened his grip, startling him out of his half-nap. He hadn’t meant to do it, but he couldn’t let him fall back asleep, regardless of how much as Zuko needed it - they really couldn’t afford to have one of their teammates napping, not right then. There was the Siege to think about, after all.</p>\n<p>Zuko shook himself more awake, scrubbing a hand under his good eye, his other hand hovering near his bad eye like it didn’t know what to do. He didn’t touch his bad eye much.</p>\n<p>(Sokka would be eternally grateful that he couldn’t smell things during a soulbond; he didn’t want his nightmares getting more detailed than they already would be.</p>\n<p>Closing his eyes hadn’t done anything to block out the screams. He could have used his hands but… Zuko needed them more right then.)</p>\n<p>Zuko pulled halfway out of his grip and Sokka took his arm back, careful to press their sides together. No way Zuko was getting out of physical affection that easily.</p>\n<p>Zuko fiddled with something under his sleeve, cursing under his breath at whatever it was, before (with a little “ah-hah”) he pulled out Katara’s necklace.</p>\n<p><em>Mom</em>’s necklace.</p>\n<p>Katara and Yue gave out delighted gasps (both for <em>very different reasons</em>), as Katara eagerly took her necklace back and tied it around her neck. As soon as it was secure she dragged Zuko into a hug, wherein he did a very good impression of a block of wood.</p>\n<p>She pulled back with a steady smile, expression calm, and gave Zuko a little kiss on the cheek before she sat back down. Zuko returned to his place next to Sokka, and Sokka soaked in his firebend-y warmth.</p>\n<p>Yue looked between Zuko and Katara, expression charming and beautiful and ethereal in her mistaken delight.</p>\n<p>Sokka caught her eye and gave a very firm shake of the head, his lip curling. She cocked her head, and her sunbeam smile dimmed to its normal radiance. Sokka let out a small sigh, prompting a nudge and awkward smile from an <em>oh-no-he-knows-everything</em> Prince Zuko.</p>\n<p>Sokka narrowed his eyes. “What, exactly, did you see in there?”</p>\n<p>Zuko had a little shit-eating grin. “<em>Two</em> fishhooks?”</p>\n<p>\n<em>Dear Sweet Spirits, why?</em>\n</p>\n<p>“How many times did your sister push you into the turtleduck pond?”</p>\n<p>Zuko shrugged. “Like, a hundred or something. Little sisters are terrifying, huh?”</p>\n<p>Sokka did not want to answer that when Katara was sitting across from him. There was no right answer there. “Speaking of family,” he said instead, “did you see about the Water Tribe tradition-”</p>\n<p>“The one where I get to steal your dad?” Zuko asked, and <em>wow, he really was a different person when he smiled.</em> “Yeah, I’m gonna steal your dad. He seems pretty cool.”</p>\n<p>“I was gonna say the one where we get to be brothers-”</p>\n<p>“Yes, yes,” Zuko pushed his words aside with a wave of his hand, “But, more importantly, I get your awesome dad.”</p>\n<p>Ozai, Sokka knew, was objectively the worst person on the planet. There was no one in existence worse than Ozai, and there never had been nor would there ever be one in the future.</p>\n<p>Zuko, in the visions Sokka had seen, had been struggling with that fact. He’d come to terms with the war crimes shortly after seeing their village through Katara’s eyes, but the way his father had treated him never came up in his conversations with Uncle.</p>\n<p>The Zuko he saw now, however, had seen their village and Sokka’s family through the eyes of the under-appreciated somewhat-less-obviously-talented older brother, and saw that Hakoda gave both his children their love equally, and without stipulations.</p>\n<p>Zuko had seen what he needed to see. He understood, he knew what he wanted and he wouoldnt hesitate to go and get it.</p>\n<p>Sokka wrapped his arm back around his shoulder, and Zuko didn’t try to shrug him off.</p>\n<p>***</p>\n<p>Their little peaceful bubble cracked the second Aang woke up, shouting about spirits and Zhao and <em>could someone please explain</em> <em>why the moon was a fish?</em></p>\n<p>Zhao appeared, made an attempt at killing the moon – and, like, Sokka was not the most spiritual guy but that seemed like a bad idea – failed in his attempt at killing the moon, and was attacked – and hopefully killed but don’t tell Aang – by a giant spirit Koi monster and also Aang.</p>\n<p>Sokka slept amazingly well that night, and not just because it was in a pile of soulmates-plus-Yue on the comfiest polar-bear-goose blankets in existence.</p>\n<p>Being royalty seemed pretty great. Maybe it would be worth leaning into the whole Technically-A-Prince thing he had going on, but then he remembered how that had worked out for Zuko.</p>\n<p>Zuko, who was currently curled half into a ball, his back pressed to Sokka’s side, his arms wrapped firmly around Aang in a way that Sokka couldn’t help but laugh at – <em>he finally caught the Avatar!</em> – breathing deeply and pushing out steady warmth to fill their little ice room.</p>\n<p>Aang had been so pleased when he woke up to find Zuko there, and had immediately demanded a soulbond. Zuko, insane that he was, was perfectly willing to go along with that despite having only just done one and also being the most tired person in existence.</p>\n<p>\n<em>(“That’s like, the worst way to show up to a fight, Zuko.”</em>\n</p>\n<p>\n<em>“I’ve done worse before.”</em>\n</p>\n<p>\n<em>“Please stop saying that.”</em>\n</p>\n<p>\n<em>“Have you ever fought a moose-lion with no swords, no armour and a hangover before?”</em>\n</p>\n<p>\n<em>“I hate you. So much.”)</em>\n</p>\n<p>Sokka managed to get them to Not Do That, You Idiots, but Aang was adamant that they do it first thing in the morning. Zuko had grumbled about it, but had also stood directly in front of Aang when Zhao appeared, hackles and swords raised, and had only calmed down when Zhao was definitely dead – and, seriously, <em>don’t tell Aang</em> – and the invasion had been scared away by Aang’s giant Koi spirit monster.</p>\n<p>Well, Zuko had calmed down if by ‘calmed down’ one meant ‘passed out because of these seven different reasons and <em>there really shouldn’t be more than one reason, Zuko.’</em></p>\n<p>(There shouldn’t have been any reasons at all, because Zuko should not be passing out, but Sokka was a realist, not an optimist.)</p>\n<p>Aang had also passed out due to something something spirit-magic, so the group had shoved the two of them somewhere to sleep where they could both be watched together and <em>gee,</em> <em>they did look comfortable.</em></p>\n<p>Sokka was very tired. He was willing to put up with Katara’s silent smirks and her legs on his stomach if it meant he got to be warm and asleep and Yue was there too.</p>\n<p>Sokka wasn’t sure if it was a lie to say he slept well or not. He woke more times than he could count in the night with his face burning and his not-mom disappearing and his boat exploding. Zuko floated slowly in the ice tunnels beneath the North Pole, and Sokka thought he had a hand cramp.</p>\n<p>But every time he woke up Zuko was there, next to him, alive and safe and hopefully not going to do anything stupid now that he had them – or, Sokka, at least – to corral him into being safe.</p>\n<p>It was easy to get back to sleep when everyone he cared about was within touching distance.</p>\n<p>***</p>\n<p>Zuko opened his eyes the second the sun came up over the horizon. He was surprised to find that he had captured the Avatar, and was confused by the lemur draped across his exposed throat, purring at his natural warmth.</p>\n<p>He turned his head slowly so as to not disturb it, and found his soulmates draped across and around him like they were a litter of puppy-kittens.</p>\n<p>He was unarmed and surrounded and warm and safe. He couldn’t count the number of times he’d crossed weapons with these people, nor how many times they’d covered his back the night before.</p>\n<p>He was still tired. He adjusted his grip around Aang’s waist and leaned just a little back into Sokka, close enough that Katara’s foot poked his side, and let himself drift back to sleep.</p>"
}