{
  "id": "23953027",
  "url": "https://archiveofourown.org/works/23953027?view_full_work=true",
  "author": [
    "Haicrescendo"
  ],
  "title": "For Hearth And Home",
  "rating": "General Audiences",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "Avatar: The Last Airbender"
  ],
  "relationships": [],
  "characters": [
    "Zuko (Avatar)"
  ],
  "additional_tags": [
    "Fire lord Zuko is doing his best",
    "Disordered Eating",
    "gentle and well-intentioned manipulation",
    "Dadko 2020",
    "tiny children are delightful",
    "and also horrifying",
    "fire lord zuko learns all about it",
    "in which fire lord zuko suffers from sleep deprivation",
    "and a case of debilitating responsibility",
    "fire lord zuko discovers self care",
    "by force",
    "learning to care for yourself through caring for others",
    "the fact that anyone on the planet could be afraid of this teenage kid is astounding",
    "the softest and sweetest fire lord"
  ],
  "language": "English",
  "series": "",
  "published": "2020-05-01",
  "completed": null,
  "words": "5,747",
  "chapters": "1/1",
  "comments": "759",
  "kudos": "23,094",
  "bookmarks": "5,374",
  "hits": "129,646",
  "summary": "<p>[There’s a child underneath Fire Lord Zuko’s desk.</p>\n<p>He doesn’t realize this until he sits down and tiny hands wrap themselves around his ankles, and Fire Lord Zuko definitely does not shriek and backpedal away at the unexpected touch. </p>\n<p>He definitely does do that but Gou, the single guard he’s agreed to let shadow him, is kind enough not to mention it.]</p>\n<p>Or,</p>\n<p>In which Fire Lord Zuko is a total mess and somehow people manage to love him for it anyway.</p>",
  "notes": "<p>This fic has been written for, like, a month, and I am so happy to finally be posting it.</p>\n<p>If you liked this, please leave a comment and let me know! As always, I can be found screaming about fictional characters on tumblr @sword-and-stars.</p>",
  "text": "<p><br>There’s a child underneath Fire Lord Zuko’s desk.</p>\n<p> </p>\n<p>He doesn’t realize this until he sits down and tiny hands wrap themselves around his ankles, and Fire Lord Zuko definitely does not shriek and backpedal away at the unexpected touch. </p>\n<p> </p>\n<p>He definitely <em> does </em> do that, but Gou, the single guard he’s agreed to let shadow him, is kind enough not to mention it.</p>\n<p> </p>\n<p>Zuko likes Gou, he decides. He might promote him, even if his reflexes are slow to the point that if this was an assassination, Zuko would have to save himself.</p>\n<p> </p>\n<p>Zuko does not have to save himself, because when he kneels down and peers underneath his desk, a small child, practically a baby— a <em> mobile </em> baby, peers right back at him.</p>\n<p> </p>\n<p>“Who are you?” He asks.</p>\n<p> </p>\n<p>The baby makes grabby hands at him and replies but not in human words that Zuko can understand. </p>\n<p> </p>\n<p><em> Spirits</em>. A baby? Zuko has no idea what to do with a baby. Is he stuck with it? Is this how fatherhood approaches him at his virginal age of seventeen?</p>\n<p> </p>\n<p>It does not occur to Fire Lord Zuko, not even a little bit that he can, in fact, foist the infant off onto somebody else. Literally anybody else. He’s the Fire Lord, he could hand the child over to Gou and the man would be legally obligated to change his job title to babysitter.</p>\n<p> </p>\n<p>Zuko does not do this.</p>\n<p> </p>\n<p>Instead, Zuko holds out his hands and the kid makes a trusting beeline for him, crashing into his robes with the full force of a toddler with minimal gross motor control. Zuko rocks back on his heels, lifts the child by the armpits, and looks them in the eyes.</p>\n<p> </p>\n<p>“Hello,” he says, not entirely unlike the way he greets the resident pygmy-pumas, “Where did you come from?”</p>\n<p> </p>\n<p>“Pardon my interruption, Your Majesty,” Gou interjects, “But she probably belongs to one of the staff. It’s not, uh, my place to say, but one of your housekeepers, Missus Sayaka, mentioned that she was unable to get her usual babysitter this morning over breakfast.”</p>\n<p> </p>\n<p>Zuko frowns a little bit.</p>\n<p> </p>\n<p>Not to say that the palace isn’t a place for children, but it’s not really a good place for unsupervised children. A hypocritical thing to think, really, considering just how much of his childhood Zuko himself spent unsupervised, but he was probably at least a little older than this. Mom would have had a heart attack.</p>\n<p> </p>\n<p>The child kicks her legs and laughs brightly at being picked up. Zuko’s stomach twists.</p>\n<p> </p>\n<p>“...Do you have any children, Gou?”</p>\n<p> </p>\n<p>“No, Your Majesty. Shall I go fetch her mother?”</p>\n<p> </p>\n<p>Zuko shakes his head.</p>\n<p> </p>\n<p>“No, it’s not a problem. I wouldn’t want her to miss out on work, but I’m sure that she’s worried. If you could send for someone to let her know that I’ve got the kid—what’s her name? Do you know?”</p>\n<p> </p>\n<p>“I believe that her name is Rin, Fire Lord Zuko.”</p>\n<p> </p>\n<p>“Please let Missus Sayaka know that I’ve found Rin and that she’s with me.” Zuko stands up and settles the baby against his chest so she can peer over his shoulder. “Rin, is it? I’m Zuko.” He doesn’t know much about kids but it’s good to talk to them, right? Can babies talk when they’re this old? At all?</p>\n<p> </p>\n<p>“‘Uko!” She squeals happily, “‘Uko, up!”</p>\n<p> </p>\n<p>“You’re already up,” Zuko tells her. “And I have a meeting. Right? That’s a thing I have today?” It’s a fairly safe bet that Zuko <em> always </em>has a meeting of some kind and if he doesn’t, something will pop up. Or it’s reading, or signing something, or screaming at a general or two.</p>\n<p> </p>\n<p>You know, a Tuesday.</p>\n<p> </p>\n<p>Uncle’s always telling him that he needs to take a break.</p>\n<p> </p>\n<p>Well, he can’t. He’s only been Fire Lord for six months. That’s <em> nothing </em> , that’s a drop in the bucket, and Zuko can’t afford to take a break. The world is delicate, and fragile, and the Fire Nation is not <em> safe.</em></p>\n<p> </p>\n<p>Zuko’s already lost his country once; he won’t do it again.</p>\n<p> </p>\n<p>But sometimes, late at night when he’s not sleeping, because sleep comes in catnaps these days, Zuko can’t imagine doing this for the rest of his life. He’s lonely all the time. He has no family here and his friends are scattered. It’s supposed to get easier, right? When does it get easier?</p>\n<p> </p>\n<p>He can’t ever tell Uncle Iroh, so far away in Ba Sing Se, and so <em> happy</em>, that sometimes he just wants all of it to stop.</p>\n<p> </p>\n<p>...Gou’s talking. Zuko should probably listen.</p>\n<p> </p>\n<p>“—with the minister of Agriculture. Do you need anything beforehand?”</p>\n<p> </p>\n<p>Zuko’s sure that he probably does but spirits know that he can’t think of anything. So he adjusts Rin in his arms because she’s squirming, fits her so she’s scooped comfortably into the crook of his arm. One chubby hand twists in the collar of his robes, the other pats his cheek. The baby coos at him.</p>\n<p> </p>\n<p>Gou looks like he might say something, but Zuko finds himself smiling back at her like there was no other option. How could he not?</p>\n<p> </p>\n<p>Gou closes his mouth.</p>\n<p> </p>\n<p>“‘Uko <em> ‘all</em>,” Rin tells him.</p>\n<p> </p>\n<p>“Not that tall,” Zuko says. “You’re just tiny. Like a little tiger-shrimp. Are kids supposed to be this tiny? How long do they stay this tiny?” Zuko’s not that big but he <em> feels </em> big, and has the sudden, misplaced fear that he’s definitely going to drop her or break her.</p>\n<p> </p>\n<p>“...are you certain that you’d rather not send for Sayaka?”</p>\n<p> </p>\n<p>“Please just go tell her before she has a breakdown over missing her kid,” Zuko snaps. His voice sharpens in a way he doesn’t mean, and Rin buries her face in his neck. He sighs in apology. “Please. I know that she has to be worried. The longer you wait, the more she’ll worry. I’m pretty sure that this is something I can handle.”</p>\n<p> </p>\n<p>“Of course, Your Majesty.” Gou bows and exits the room faster than Zuko’s ever seen.</p>\n<p> </p>\n<p>If Zuko had slept for more than two hours over the past two days, he would have remembered several things.</p>\n<p> </p>\n<p>[1] He would have remembered that most of the house staff is terrified of him. A few who spend more time around him, like Gou and Chef Bon and his stylist Hanako (why does he even have a stylist? He can brush his own damned hair and dress himself, even if he does still struggle with getting the crown to sit straight on his head.) are less afraid, but for the most part, he’s avoided at all costs. Zuko tries to not think about how that adds to the unmoored feeling of being lost at sea.</p>\n<p> </p>\n<p>[2] He would have remembered that he <em> did </em> actually need a particular scroll for this meeting, and he does not currently have it.</p>\n<p> </p>\n<p>[3] He would have remembered that hearing the words ‘the Fire Lord has your baby’ sound way scarier when most everyone’s Fire Lord experience consists of his father.</p>\n<p> </p>\n<p>Unfortunately, because Fire Lord Zuko has only slept about two hours in the past two days, he does not remember any of those things.</p>\n<p> </p>\n<p>\n<br>\n<br>\n</p>\n<p>Zuko tries to do the best job he can with what he’s given.</p>\n<p> </p>\n<p>It’s a little thankless and his entire life, personal or otherwise, has suffered for it, but it’s important and Zuko knows this. He really does know this, but Minister Jing is <em> so boring </em> that Zuko can barely keep his eyes open.</p>\n<p> </p>\n<p>The only thing keeping people from talking is the fact that they’re afraid of him, Zuko thinks with no small amount of resentment.</p>\n<p> </p>\n<p>No one dares mention the toddler supported carefully in Fire Lord Zuko’s lap, nor the way that he alternates his questions, even when he accidentally asks Rin her opinions on prospective rice yields and Minister Jing whether he can say the word ‘blue’.</p>\n<p> </p>\n<p>Rin does not have an opinion on the rice yields or the color blue but she does have a very strong opinion on the length of Zuko’s meeting. He agrees with her, silently, and tries to balance entertaining her with his productivity for as long as she’ll have it.</p>\n<p> </p>\n<p>A baby can only tolerate it for so long, it seems. </p>\n<p> </p>\n<p>Rin fusses, settles for a moment, and then opens her mouth, and the loudest wail that Zuko’s ever heard comes out. Big, fat tears roll down her cheeks and she bangs her tiny fists on his chest and kicks her feet. Zuko would not mind the opportunity to kick his feet a little and scream about it with her. </p>\n<p> </p>\n<p>Unfortunately, he’s the Fire Lord so Zuko does not do this.</p>\n<p> </p>\n<p>What he <em> does </em> do, however, is get to his feet and bounce Rin a little in his arms to try and calm her because spirits, <em> that noise is unholy</em>, and bow a little bit.</p>\n<p> </p>\n<p>“Let’s take a rain check,” he says like it’s an option when he means that it’s a requirement, firmly and with little room for argument. “You were mostly done, weren't you?” Minister Jing was not mostly done if the look on his face is any indication, but Zuko finds, for once, that he can’t make himself care.</p>\n<p> </p>\n<p>He shuffles out of the room and heads for his office. Zuko’s head throbs as much from Rin’s crying as from sleep deprivation, and all he wants to do is lay down. He can’t do that, exactly, but he can at least take a moment and let Rin run around his office. Inactivity isn’t good for little kids, right? There’s not anything she can really get into in there, anyway.</p>\n<p> </p>\n<p>Zuko’s thinking so hard that he almost runs headlong into Fuyumi, the head of house staff. In fact, be barely avoids hitting Fuyumi and in doing so nearly careens into a wall.</p>\n<p> </p>\n<p>“Your Majesty! Are you alright?” She asks with more concern than he deserves.</p>\n<p> </p>\n<p>Zuko groans a little. Whacking a wall has done nothing for the mood of the toddler he’s put himself in charge of.</p>\n<p> </p>\n<p>“I’m fine, thank you. Just...need a moment.”</p>\n<p> </p>\n<p>Fuyumi, blessedly, is one of the few people in the palace who makes no indication of having been afraid of anything or anyone, ever. She’s a firm and no-nonsense woman in her forties, and generally makes it her personal responsibility for bringing Zuko meals and generally making sure that he’s still alive at the beginning and end of each day even though he’s sure that she has better things that she could be doing.</p>\n<p> </p>\n<p>“How do you make kids stop crying?” He asks her tiredly.</p>\n<p> </p>\n<p>Fuyumi clucks at him a little and takes Rin from him, ignoring her wailing to check her bottom.</p>\n<p> </p>\n<p>“She’s dry, but when was the last time you fed her?”</p>\n<p> </p>\n<p>“....uh.”</p>\n<p> </p>\n<p>That’s answer enough, and Fuyumi sighs and hands her back to him.</p>\n<p> </p>\n<p>“I’ll go fetch a meal for her,” she says. “Try and keep her distracted until then, Your Majesty.” </p>\n<p> </p>\n<p>Fuyumi must think that Zuko is, like, the most useless Fire Lord in existence. She’s not wrong either, especially if Zuko can’t even remember that babies need to <em> eat </em>.</p>\n<p> </p>\n<p>Rin has no interest in the papers that litter Zuko’s desk but she does like the little model of a turtleduck that Toph made him, bent out of smelted metal that Zuko likes to use as a paperweight. So instead of getting any actual work done, Zuko ends up on the floor while the toddler alternates between gnawing on his things and scuttling around underneath his couch. She’s still cranky but seems happier to at least have some freedom.</p>\n<p> </p>\n<p>Coincidentally, so is Zuko.</p>\n<p> </p>\n<p>It’s not too long before there’s a knock on the door.</p>\n<p> </p>\n<p>Fuyumi’s back with a tray in her hands, and Zuko can’t interpret the look on her face when she sees him on his belly on the floor with a toddler sitting on the flat of his shoulders and mercilessly tugging his hair out of order. It’s too soft of a look to be judgement. If Zuko didn’t know better, he’d think it was a look of affection.</p>\n<p> </p>\n<p>“Here, Your Majesty. Children are messy.” She hands him a napkin and ties another loosely around Rin’s neck for a bib. “Would you like anything from the kitchens?”</p>\n<p> </p>\n<p>Zuko waves her off.</p>\n<p> </p>\n<p>He’s very rarely hungry, lately. He can eat later when he has more time.</p>\n<p> </p>\n<p>(Zuko doesn’t realize that he’s been telling himself that for months now, and that Chef Bon has been sending meals up to him whether he asked for them or not. He also doesn’t realize that they’ve shifted from hot food to things that can be eaten cold, because it usually takes at least an hour for him to remember that there’s food in front of him.)</p>\n<p> </p>\n<p>“I’m fine, thank you.”</p>\n<p> </p>\n<p>Fuyumi bows and leaves.</p>\n<p> </p>\n<p>The tray is all easy food cut up into small pieces that can be eaten by hand. There’s a little pile of cubed komodo-chicken, some sticky rice, and cut up straw-banana, and Rin immediately clambers off of him to sit on the floor next to the tray. She goes for the fruit first, popping a few pieces into her mouth with gusto, then looks at Zuko.</p>\n<p> </p>\n<p>“‘Uko,” she says with her mouth full, holds out a slightly smushed piece of straw-banana. “‘Uko <em> eat</em>.”</p>\n<p> </p>\n<p>Zuko’s done a lot of things in his life that he’s not proud of but he’s not an <em> asshole</em>. He could no more reject that offering than he could stop breathing. He doesn’t really want it but that’s overruled by his absolute refusal to hurt the feelings of a baby.</p>\n<p> </p>\n<p>“Thank you,” he says, and eats the offered fruit, determinedly not thinking about where Rin’s hands have been. Zuko’s got the immune system of a tank and he’s eaten way worse things than food that’s touched an unwashed baby hand.</p>\n<p> </p>\n<p>The worst thing is that she only eats about half of what Fuyumi brought because she keeps handing food to Zuko, who is a sucker and doesn’t know the meaning of the word ‘no’. Well, he knows it.</p>\n<p> </p>\n<p>He’s just not used to using it as of late.</p>\n<p> </p>\n<p>“Are you still hungry, Rin?” Zuko asks. He doesn’t really expect an answer and he doesn’t get one. Well, he gets a pleased <em> ‘Uko </em> for his trouble, but that doesn’t tell him if the kid’s still hungry. How much are kids supposed to eat? He eyes the empty plate with some scepticism and eventually pops his head out of his office to call for another plate.</p>\n<p> </p>\n<p>Fuyumi shows up with it, again, looking like the pygmy puma that ate the canary-mouse.</p>\n<p> </p>\n<p>Zuko eyes her offering.</p>\n<p> </p>\n<p>“...this doesn’t look like kid food,” he says. “I don’t think babies like spicy peanut noodles? Can babies even eat those?”</p>\n<p> </p>\n<p>“It’s on a baby plate,” Fuyumi tells him, grinning. It <em> is </em>on a baby plate. It’s sectioned off and everything.</p>\n<p> </p>\n<p>“I don’t think babies eat this.”</p>\n<p> </p>\n<p>“Oh, here.” She hands him the plate and a pair of chopsticks, and then a little bamboo steamer basket. “Chef Bon sent these too. For babies.”</p>\n<p> </p>\n<p>To Zuko’s consternation, inside the basket is an assortment of bao and, gratifyingly, some steamed sweet potato-choke with cinnamon butter.</p>\n<p> </p>\n<p>“Fuyumi, I don’t think—“</p>\n<p> </p>\n<p>But Fuyumi is already bowing deeply to him and out the door, and Zuko feels, somehow, that he’s just been played.</p>\n<p> </p>\n<p>It turns out that Zuko is right and that babies do not, in fact, like spicy peanut noodles. Babies will eat exactly one noodle and make a face and proceed to give the rest an impressive stink eye. Babies also eat only part of the bread of one pork bao and the butteriest parts of the sweet potato-chokes and leave the rest for Zuko, who isn’t hungry but also hates the idea of wasting food.</p>\n<p> </p>\n<p>He hasn’t forgotten his time as a refugee.</p>\n<p> </p>\n<p>He hasn’t forgotten any of it at all.</p>\n<p> </p>\n<p>So Zuko eats the spicy peanut noodles <em> and </em> the pork bao <em> and </em>the rest of the sweet potato-chokes. At first he’s sure that he can’t, because his appetite feels nonexistent and the idea of eating right now makes him feel vaguely nauseated. </p>\n<p> </p>\n<p>He manages, though, and when he’s finished he feels...better.</p>\n<p> </p>\n<p>He still feels tired and rundown but less hollow, only flinching a bit when little Rin throws herself into his lap, knees first into his shins. Looking at her now, Zuko would never have guessed that she’d been screeching like an angry leopard seal not even an hour ago. She’s certainly cheerful enough now.</p>\n<p> </p>\n<p>Zuko looks at Rin and then around at his office. It’s sparsely decorated and formal, with no indication of Zuko’s personality. Or <em> anyone’s </em> personality at all, in fact.</p>\n<p> </p>\n<p>A child can’t possibly be happy in here.</p>\n<p> </p>\n<p>Zuko drags the plush, woven blanket off of his sofa, tosses it over his shoulder, and offers Rin his hand. She curls her whole hand around two of his fingers and Zuko makes himself hunch over so that she doesn’t have to stretch her arm too much.</p>\n<p> </p>\n<p>“Let’s take a field trip. I think you could use some sun.”</p>\n<p> </p>\n<p>\n<br>\n<br>\n</p>\n<p>Rin bounces the entire way to the gardens and nearly falls on her face more than once. Zuko offers to scoop her but it seems that she’d rather go at her own babyish walk-run and Zuko figures that it’s fine. If she can walk herself, she should. It’s not that far and it’s a pretty day, and the combination of food and sunshine do more to lift his mood than he could have thought possible.</p>\n<p> </p>\n<p>Maybe he should just start taking all of his meetings outside. </p>\n<p> </p>\n<p>Sitting in the sun and keeping a careful eye on the toddler running amok through his mother’s long-tended flowerbeds is a thousand times more pleasant than talking rice yields and international reparations, but even rice yields and reparations might be easier to handle if he could do them out here instead of inside, where even the large throne room makes him feel trapped and cornered.</p>\n<p> </p>\n<p>Sitting on his blanket and half dazed with the warm feeling of the sun on his face, Zuko stifles a yawn so big that his eyes water.</p>\n<p> </p>\n<p>“‘Uko!”</p>\n<p> </p>\n<p>He blinks and immediately has a cluster of plants shoved into his face.</p>\n<p> </p>\n<p>Rin hasn’t touched the massive rose blossoms or the spears of bright gladiolus, or the veritable rainbow of daisies. Instead, she’s dug up a good handful of flowering weeds from the edge of the pond, the roots still attached.</p>\n<p> </p>\n<p>She shakes them at him and showers the blanket with dirt.</p>\n<p> </p>\n<p>“Those are very pretty, Rin,” Zuko says, and takes them carefully from her when it becomes clear that she’s offering them as a gift. The day is still young but it’s clear that she’s wearing herself out.</p>\n<p> </p>\n<p>Babies take naps, right? That’s a thing?</p>\n<p> </p>\n<p>“Are you tired?”</p>\n<p> </p>\n<p>“<em>No</em>.” </p>\n<p> </p>\n<p>That’s a word that Rin knows, clear as anything, and Zuko’s not sure whether he wants to laugh or sigh. In the end, he does both, one right after the other.</p>\n<p> </p>\n<p>“Naptime?” He offers.</p>\n<p> </p>\n<p>“No! No night-night.” Rin scowls at him, juts out her lower lip and <em> pouts</em>. Despite the determined attitude, she’s squinting a little. Zuko has to cover his mouth to hide his smile.</p>\n<p> </p>\n<p>“Not even a little one?”</p>\n<p> </p>\n<p>“No.”</p>\n<p> </p>\n<p>“Oh well,” Zuko says, light and breezy, “Guess I have to do it all by myself, then. You’re in charge, now. Night-night, Rin.” With plenty of pomp, he flops over onto his side and lounges dramatically on top of his blanket, making a show of closing his eyes and pretending to snore.</p>\n<p> </p>\n<p>For a good thirty seconds, there’s silence. Zuko is pretty sure that Rin’s still pouting at him.</p>\n<p> </p>\n<p>Then there’s a quiet, diabolical little cackle and then there’s a child burrowing her way underneath Zuko’s arm. He props himself up on his elbow and tries very hard to ignore the way his feelings all suddenly feel too big to fit inside his body.</p>\n<p> </p>\n<p>It feels like it’s been <em> forever </em> since anybody’s dared to touch him in any way and Zuko, out of nowhere, suddenly misses his uncle with an intensity that physically hurts. They write often but it’s not the same, and it’s too easy for Zuko to omit what he doesn’t want to say—that he’s lonely, and unhappy, and that he wishes that he’d come back. Zuko <em> understands </em> but it doesn’t make him feel better. He understands, and that’s why he can’t say it.</p>\n<p> </p>\n<p>“Night-night, ‘Uko,” Rin orders and sleepily slap-pats at his cheek. “Night-night.”</p>\n<p> </p>\n<p>“As Her Majesty commands,” Zuko teases, and closes his eyes at first just for pretend, but the sun feels <em> so good </em> on his face and on his spirit that within minutes he’s asleep himself.</p>\n<p> </p>\n<p>\n<br>\n<br>\n</p>\n<p>“The Fire Lord found Rin in his office,” Gou says, and Sayaka feels like she’s having a panic attack.</p>\n<p> </p>\n<p>Bad enough that she had no choice but to bring Rin to work in the first place. Worse still that her wily toddler wandered off the moment Sayaka wasn’t actively watching her. And absolute worst of all: the Fire Lord had <em> found </em> her. In his <em> office.</em></p>\n<p> </p>\n<p>Sayaka needs to sit down.</p>\n<p> </p>\n<p>Gou continues as if he’s talking about the weather instead of Sayaka’s <em> only child</em>. Maybe it’s because he hasn’t been in the palace for very long—Fire Lord Zuko hired him after his coronation so maybe he just doesn’t know. But Sayaka’s been working in the palace for a year and a half and she’s seen the kinds of things these royals do—Princess Azula’s last few days with a crown were some of the most terrifying in Sayaka’s life and she’s heard plenty of stories from some of the more senior staff about Ozai.</p>\n<p> </p>\n<p>Sayaka hasn’t even <em> seen </em>Fire Lord Zuko since his coronation; she doesn’t have a reason to cross his path and even if she did, he always seems to be holed up in the throne room or his office with the door shut.</p>\n<p> </p>\n<p>Everyone says, when his hair gets pulled back and out of his face, how much the Fire Lord resembles his father.</p>\n<p> </p>\n<p>Remembering that makes Sayaka’s bones shake.</p>\n<p> </p>\n<p>“Was...was he angry?” She manages to ask, finally. Gou still doesn’t seem worried. <em> Why </em>isn’t he worried? Sayaka likes Gou, so why doesn’t he seem to understand why this is a big deal?</p>\n<p> </p>\n<p>“Nah, he was fine.”</p>\n<p> </p>\n<p>Fine? <em> Fine? </em></p>\n<p> </p>\n<p>“He says that you can finish your shift and then pick her up when you’re done.”</p>\n<p> </p>\n<p>Sayaka slides down the wall when Gou leaves to complete the rest of his duties, and buries her face in her hands. This feels like a nightmare. Is making her finish her shift some kind of awful kind game that the Fire Lord is playing? Is this her punishment, to run every terrible scenario through her head all day while her baby is…</p>\n<p> </p>\n<p>Spirits.</p>\n<p> </p>\n<p>What’s he going to do to her? Rin’s just a baby. He wouldn’t <em> hurt </em> a baby, would he? Sayaka cuts off that line of thought. She can’t think that or she’s going to melt down.</p>\n<p> </p>\n<p>She somehow manages to make it through several, agonizing hours of work before she can’t handle it anymore.</p>\n<p> </p>\n<p>Maybe Sayaka’s going to lose her job. Maybe the Fire Lord will decide that that’s not good enough, and just banish her. The Princess had gotten rid of a good chunk of her own staff. Most of them had refused to come back.</p>\n<p> </p>\n<p>Sayaka feels cold all the way down to her feet when she finds the head of staff, Fuyumi, and demands to see her daughter. Fuyumi’s worked in the palace for almost twenty years and acts like it, but she’s kind and professional and more likely to understand Sayaka’s fears. Fuyumi interacts more with Fire Lord Zuko than almost anyone else. </p>\n<p> </p>\n<p>She’ll understand.</p>\n<p> </p>\n<p>Fuyumi <em> does </em> understand, and places a steady, comforting hand on Sayaka’s shoulder.</p>\n<p> </p>\n<p>“You know that His Majesty wouldn’t hurt a child, right?” she asks kindly.</p>\n<p> </p>\n<p>Sayaka does not know this and keeps her thoughts about it to herself.</p>\n<p> </p>\n<p>Fire Lord Zuko is not in his office where Fuyumi left him about an hour ago. He’s not in the throne room, and he’s not wandering the halls.</p>\n<p> </p>\n<p>Fire Lord Zuko is found in the royal gardens. Fuyumi announces herself but there’s no response, and Sayaka nearly slams into her back when she stops dead in her tracks.</p>\n<p> </p>\n<p>Curled up on a blanket is the Fire Lord himself, looking younger and smaller with his hair loose and wearing casual robes. He’s motionless in sleep, and tucked carefully into the crook of his arm is—</p>\n<p> </p>\n<p>“<em>Rin,</em>” Sayaka breathes and feels so relieved she wants to cry. </p>\n<p> </p>\n<p>The look on Fuyumi’s face is warm.</p>\n<p> </p>\n<p>“I told you, didn't I?” She asks. “That boy would never hurt a kid.”</p>\n<p> </p>\n<p>Sayaka wipes at her face and sniffles. At the noise, Rin stirs and sits up, rubbing the sleep out of her eyes.</p>\n<p> </p>\n<p>“Mama!” She exclaims with a squeal and scrambles out of the Fire Lord’s easy hold, making a beeline for her mother. Sayaka kneels and catches her. “Mama okay?”</p>\n<p> </p>\n<p>“I’m fine, darling. Just happy to see you. I was worried.”</p>\n<p> </p>\n<p>Fire Lord Zuko begins to stir the moment his arm slips and it’s with a quiet groan that he sits up and rubs at his own eyes. Like a flipped switch, Sayaka’s relief turns to fear.</p>\n<p> </p>\n<p>“Did you have a good rest, Your Majesty?” Fuyumi asks him.</p>\n<p> </p>\n<p>The moment that the Fire Lord realizes that he got caught taking an afternoon nap in the sun is a visible one. He goes red and twists his hands awkwardly, like he doesn’t know what to do with them, and suddenly Sayaka can’t see Ozai in him at all. </p>\n<p> </p>\n<p>All she can see is a tired kid.</p>\n<p> </p>\n<p>Rin points at him.</p>\n<p> </p>\n<p>“‘Uko!” She says.</p>\n<p> </p>\n<p>“<em>Fire Lord Zuko</em>,” Sayaka says hurriedly, “Be polite, honey.”</p>\n<p> </p>\n<p>“She can call me what she likes,” Fire Lord Zuko says softly. “I’ve been called way worse.”</p>\n<p> </p>\n<p>Sayaka sets Rin down on the ground and kneels, so low that her forehead touches grass.</p>\n<p> </p>\n<p>“Fire Lord Zuko, I’m <em> so sorry,</em>” she says. This is it. “If there’s anything I can do to make up for the inconvenience she’s caused you, please—“</p>\n<p> </p>\n<p>“Please don’t bow to me like that. Okay? Sit up.”</p>\n<p> </p>\n<p>Fire Lord Zuko rubs his temples like he’s trying hard to fend off a headache. Rin, socially oblivious as very small children tend to be, dodges her mother’s grab and trots right back up to him, patting his scarred cheek with a hand. Fire Lord Zuko allows it with grace, and his whole posture softens.</p>\n<p> </p>\n<p>Sayaka can’t see, but Fuyumi is trying desperately to not smile behind her back.</p>\n<p> </p>\n<p>“It was—it was no trouble,” he finally manages. “I didn’t—<em> she </em> was no trouble.” Fire Lord Zuko is painfully awkward and looks uncomfortable, almost shy. A seventeen year old boy is still, apparently, a seventeen year old boy, crown on his head or not. Weirdly, it makes Sayaka feel better about it all.</p>\n<p> </p>\n<p>Suddenly, watching the way her little daughter bounces happily around him, it’s obvious that there’s no way in a frozen volcano that Fire Lord Zuko would allow any harm to come to Rin, much less from his own hand. Fire Nation royalty, historically, have always been dangerous. It’s part of what has made them so powerful, as a country. </p>\n<p> </p>\n<p>But what Ozai had forgotten that Fire Lord Zuko clearly has not, is that that danger is for <em> others</em>.</p>\n<p> </p>\n<p>It’s said that the royal bloodline contains the blood of dragons. It’s what gives them the right to rule and the strength to hold onto the throne and the determination to take down anything that stands in their way. Dragons protect their hoard.</p>\n<p> </p>\n<p>Dragons are not <em> safe...</em>except to those they care for and it’s clear that under Fire Lord Zuko’s careful watch, Rin could not be safer.</p>\n<p> </p>\n<p>And Sayaka remembers, out of nowhere, that Fuyumi <em> knew </em> this. Twenty years working in the palace meant that she’d seen plenty and not only that, had seen plenty of Fire Lord Zuko.</p>\n<p> </p>\n<p>No wonder she’d been so calm.</p>\n<p> </p>\n<p>Sayaka drops her face into her hands and drags in a long, shaky breath.</p>\n<p> </p>\n<p>She knows, deep down, that after this she won’t ever be able to be afraid of him again.</p>\n<p> </p>\n<p>“Thank you very much, Fire Lord Zuko,” she tells him. “Thank you for taking such good care of my baby. Thank you for looking after your people so well, Your Majesty.”</p>\n<p> </p>\n<p>The smile he gives her is still awkward and shy, but warm and very sweet.</p>\n<p> </p>\n<p>“It’s what I’m supposed to do, isn’t it?” Fire Lord Zuko asks. Quietly, like he’s unsure of the answer.</p>\n<p> </p>\n<p>“That’s exactly what you’re supposed to do, my lord.” Sayaka bows to him once again, and he <em> matches it </em>with one of his own, lower than his station requires towards someone like her. Rin takes advantage of his lowered head to grab him around the neck in a hug that Sayaka knows from personal experience is tight and difficult to dislodge. </p>\n<p> </p>\n<p>“Gently, dearest,” she says pointlessly. Fire Lord Zuko doesn’t seem to mind; on the contrary, he wraps an arm around Rin and squeezes her gently, then lifts her to place her in Sayaka’s arms. “Thank you, Your Majesty.”</p>\n<p> </p>\n<p>“It was nothing,” Fire Lord Zuko tells her.</p>\n<p> </p>\n<p>It wasn’t nothing and everyone knows it, except for Fire Lord Zuko.</p>\n<p> </p>\n<p>\n<br>\n<br>\n</p>\n<p>Zuko can’t sleep.</p>\n<p> </p>\n<p>He can remember very distinctly the last time he truly slept well: immediately following Sozin’s Comet, and he’d finally gotten proof that all of his friends had survived. Chef Bon had crawled out from inside the hideaway wall and started cooking for everyone, and Zuko had fallen asleep at the kotatsu between Toph and Uncle Iroh. He’d felt safer than he had in years and when he woke up, he’d been moved to bed and he’d found out that he’d slept for nearly fifteen hours.</p>\n<p> </p>\n<p>He hasn’t rested like that since he’d been crowned.</p>\n<p> </p>\n<p>He might never rest like that again.</p>\n<p> </p>\n<p>Zuko’s head hurts.</p>\n<p> </p>\n<p>He doesn’t think about what he’s doing when he tugs the overrobe on over his pajamas, and can’t manage to make himself care that he’s wandering the palace barefoot. It’s unseemly, his father’s voice scolds in the back of his head. Unseemly and pathetic. What does he think he’s doing, giving the night shift a show?</p>\n<p> </p>\n<p>Zuko ignores it.</p>\n<p> </p>\n<p>Anyone awake at this hour deserves any show that they get.</p>\n<p> </p>\n<p>Zuko pushes open the door to the kitchen and nearly frightens Chef Bon into throwing the dough he’s kneading at him.</p>\n<p> </p>\n<p>“Your Majesty!” The man exclaims, “I’m sorry! If you needed something, you should have called for someone.”</p>\n<p> </p>\n<p>Zuko waves off his concerns with a tired hand wave.</p>\n<p> </p>\n<p>“It’s...it’s fine. I didn’t know that anyone would be awake. I’m sorry.”</p>\n<p> </p>\n<p>Chef Bon shoots him a look of concern and clicks his tongue.</p>\n<p> </p>\n<p>“It’s time to start the morning’s bread, Your Majesty. Someone’s always awake. You haven’t slept yet?”</p>\n<p> </p>\n<p>“It’s fine.”</p>\n<p> </p>\n<p>Chef Bon clearly thinks that it’s not fine but says nothing, instead simply pushing a stool in Zuko’s direction.</p>\n<p> </p>\n<p>“Let me make you something, my lord. Please sit down.”</p>\n<p> </p>\n<p>“You really don’t have to—“</p>\n<p> </p>\n<p>Protesting is useless, Zuko discovers, and sits where he’s directed. Kitchens are never quiet either, and Zuko finds himself soothed by the noises and shuffle of Chef Bon’s bustling around, and in the end he folds his arms on the counter and rests his head on them.</p>\n<p> </p>\n<p>He doesn’t remember falling asleep but the next thing he knows he’s jerking awake at the sound of a plate being set down next to his head. He smells ginger, honey, and grass-garlic and when Zuko opens his eyes all he can see is a small mountain of sauced noodles, sprinkled with peanuts and sliced chilis. </p>\n<p> </p>\n<p>Chef Bon sets a cup of tea down next to him as well.</p>\n<p> </p>\n<p>It’s <em> jasmine, </em>and to Zuko’s absolute horror he feels his eyes start to burn.</p>\n<p> </p>\n<p>“My lord?” Chef Bon asks with open alarm. Zuko doesn’t want to know what his face looks like. “I’m sorry, is it not—“</p>\n<p> </p>\n<p>“<em>It’s fine,</em>” Zuko snaps harshly, and then immediately feels bad when Chef Bon’s mouth shuts abruptly. “I’m sorry. It’s fine.”</p>\n<p> </p>\n<p>“Would you prefer another kind of tea?” The man asks, very gently.</p>\n<p> </p>\n<p>Zuko shakes his head.</p>\n<p> </p>\n<p>He doesn’t want another kind of tea. He just doesn’t want this one. He doesn’t want any tea at all.</p>\n<p> </p>\n<p>Zuko drinks his tea.</p>\n<p> </p>\n<p>It’s hot and well-brewed but <em> wrong </em>, and Zuko smothers the taste with the noodles, pretends that his burning eyes and throat are from heat and spice instead.</p>\n<p> </p>\n<p>“Can you—“ Zuko’s voice cracks a little and he clears his throat, “Can you get me some paper and something to write with, please? I need to write my uncle.”</p>\n<p> </p>\n<p> </p>\n<p>It’s mid-afternoon and the <em> Jasmine Dragon </em> is bustling in its lunch rush when the hawk perches itself in the window and screeches its presence to all and sundry, scaring a pai sho tile right out of a customer’s hand.</p>\n<p> </p>\n<p>“Letter for you, boss!”</p>\n<p> </p>\n<p>Iroh’s not expecting a letter from Zuko for a few more days yet, but that is definitely a palace hawk and that’s definitely Zuko’s seal on the rolled up paper Meilin hands him. He pops the seal and scans the letter.</p>\n<p> </p>\n<p>It’s normal at first read, innocuous and unobtrusive. But something about it isn’t right.</p>\n<p> </p>\n<p>Maybe it’s how many words and phrases, whole sentences, are scratched out to the point that Iroh can’t even hope to read them. Maybe it’s that it’s arrived off schedule and Zuko’s communications have been coming like clockwork, every week. Or maybe it’s the way Iroh can barely recognize Zuko’s writing. He’s got lovely penmanship, but this is shaky and lacks composure.</p>\n<p> </p>\n<p>Something is <em> wrong </em>.</p>\n<p> </p>\n<p>One phrase sticks out from the rest, repeated multiple times throughout Zuko’s letter:</p>\n<p> </p>\n<p>\n<em> I miss you.</em>\n</p>\n<p> </p>\n<p>It’s not like Zuko to be so openly vulnerable, and that combined with the rest of it sends off warning bells in Iroh’s head. </p>\n<p> </p>\n<p>\n<em> I miss you.</em>\n</p>\n<p> </p>\n<p>Iroh wasn’t going to take his break until after the lunch crowd was done, but he takes off his apron and heads upstairs to his living quarters. Iroh has to pack, and he has to decide whether he wants to close the shop for a bit or leave it to his staff to manage while he’s gone.</p>\n<p> </p>\n<p>He’s got a nephew he needs to go see.</p>\n<p> </p>\n<p>\n<br>\n<br>\n<br>\n</p>"
}