{
  "id": "24177838",
  "url": "https://archiveofourown.org/works/24177838?view_full_work=true",
  "author": [
    "aloera"
  ],
  "title": "come home to me",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
  ],
  "relationships": [
    "Bakugou Katsuki/Kirishima Eijirou"
  ],
  "characters": [
    "Bakugou Katsuki",
    "Kirishima Eijirou",
    "Class 1-A (My Hero Academia)",
    "Aizawa Shouta | Eraserhead",
    "Kaminari Denki",
    "Ashido Mina",
    "Sero Hanta",
    "Midoriya Izuku"
  ],
  "additional_tags": [
    "this is honestly just 5k words of fluff bc its what we deserve",
    "Tooth-Rotting Fluff",
    "Secret Relationship",
    "Established Relationship",
    "Relationship Reveal",
    "does it count as secret if u never mention it but ur classmates drink their dumb bitch juice",
    "this is so self indulgent and u know what thats okay!!",
    "Love Confessions",
    "bakusquad is on first name basis bc they loVE each other",
    "Class 1-A Shenanigans (My Hero Academia)",
    "Shinsou Hitoshi is in Class 1-A",
    "he's there for like one sentence but its important to me that you know that",
    "Soft Bakugou Katsuki",
    "Soft Kirishima Eijirou",
    "Telepathy",
    "Quirk Accident (My Hero Academia)"
  ],
  "language": "English",
  "series": "Part 1 of come home to me",
  "published": "2020-05-14",
  "completed": null,
  "words": "5,428",
  "chapters": "1/1",
  "comments": "480",
  "kudos": "17,032",
  "bookmarks": "2,478",
  "hits": "94,624",
  "summary": "<p>“I shouldn’t have moved out of the way,” Katsuki sighs. “I should have let that fucking asshole hit us, honestly, a broken back would be better than this.”<br><i>Masochist,</i> Eijirou thinks and, in the second right before Katsuki chokes and focuses intensely on salvaging what's left of their midnight haul, he realizes that this might be a problem.</p>\n<p>Bakugou and Kirishima get hit by a quirk that lets them hear each others' thoughts. It goes much better (and much worse) than either of them expect.</p>",
  "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>lmao i made all their thoughts sound so sweet but u know 90% of the time its just</p>\n<p>\"if i blasted myself hard enough could i fucking rocket ship myself into space? i should try that. im gonna try that\"<br>\"please do n oT\"</p>\n<p>i headcanon kiri \"bro/dude/man\"-ing baku so hard even when they're together bc its what my gf and i do and idk i think were cute so!! self projection it is!! also also quarantine has me lonely and u can tell bc i wrote this in a dAY so if u would like to interact in the comments discuss our hopes and dreams and days and headcanons i would love that very very much ok!! hope u enjoyed!!</p>\n<p>(if anyone wants a rating change lemme know nd ill get on that asap!!)</p>\n<p><a href=\"https://twitter.com/aIoera\" rel=\"nofollow\">twitter</a> <a href=\"https://aloera.tumblr.com/\" rel=\"nofollow\">tumblr</a></p>",
  "text": "<p align=\"left\">The bell rings, class starts, and Katsuki and Midoriya are inexplicably absent. Back in first year, this would have been considered a disaster that was deserving of UA going into full lockdown and a PR backlash that would last for months. Eijirou shivers, remembering the fight at Ground Beta, Katsuki climbing into his bed late at night, face wet with tears, limbs shaking with something Eijirou never wanted anywhere near his boyfriend <em>ever</em>. But it’s second year now, and things have calmed down. The atmosphere in the classroom is… mildly unsettled, as opposed to reeking of abject panic.</p>\n<p align=\"left\">“Where are problem children one and two,” Aizawa sighs. Eijirou can almost see the new hairs turning grey as the man finishes his headcount coming up two short. They really don’t pay Aizawa-sensei enough. Should they talk to Nedzu about this? Maybe organize an Aizawa-sensei Appreciation Day where they all leave him alone for 24 hours and nobody almost dies/gets kidnapped/destroys the school//harasses the girls–</p>\n<p align=\"left\">He’ll figure out the logistics later.</p>\n<p align=\"left\">“Bakugo wasn’t in his room this morning,” Eijirou says, eventually. “I thought he was just out running, though…?”</p>\n<p align=\"left\">His boyfriend runs himself like a military base and it’s equal parts worrying and impressive. Running first thing in the morning, Katsuki has told him, quiets his mind. For someone whose brain is so loud all the time… Well, Eijirou is glad that he’s found a healthy coping mechanism, even if he does have to lay down the law on how many laps are considered enough and how many laps make his lungs burn just thinking about them.</p>\n<p align=\"left\">“You’re saying you checked?” Denki turns to him, wiggling his eyebrows.</p>\n<p align=\"left\">“Dude, you know it’s not like that!”</p>\n<p align=\"left\">It’s exactly like that.</p>\n<p align=\"left\">“And Midoriya?” Aizawa swiftly changes the topic with the desperation of a man who has been friends with Present Mic and Midnight long enough for them to break him.</p>\n<p align=\"left\">“I heard him leave early this morning,” Tokoyami offers. “A little after sunrise.”</p>\n<p align=\"left\">“That’s so early,” Uraraka says, eyes furrowed. “Unless…” she turns to Iida. “Didn’t Deku say he and Bakugo were starting to work on some new combos?”</p>\n<p align=\"left\">The class is silent as they absorb this new information. Individually, Aizawa’s so-called problem children are more than well-deserving of their names. Together–</p>\n<p align=\"left\">“We’re fucked,” Denki whispers.</p>\n<p align=\"left\">As if on cue, Midoriya bursts through the door, already babbling apologies. Katsuki strides in behind him, his movements languid, relaxed. Eijirou feels the corners of his lips quirk up, unbidden. Whatever the two of them were working on was going well, if it has Katsuki that calm.</p>\n<p align=\"left\">“You’re late,” Aizawa drones, but it’s drowned out by the class’ exclamations.</p>\n<p align=\"left\">“Holy shit, what happened to you guys?”</p>\n<p align=\"left\">“Deku, your face!”</p>\n<p align=\"left\">“Bakubro, are you okay, dude? Your arms are shaking–”</p>\n<p align=\"left\">“Go stick your dick in a blender,” Katsuki bites out, dropping into his seat. Hanta almost looks considering for a moment, before shaking himself out of it.</p>\n<p align=\"left\">“I know you love those protein shakes, bro!”</p>\n<p align=\"left\">“I’ll kill you.”</p>\n<p align=\"left\">“It’s too early for this,” Aizawa-sensei says, finally. “We will be discussing this later.”</p>\n<p>With that, class starts, and Eijirou does his best to pay attention to the progression of hero policy and not his boyfriend who is in desperate need of an arm massage.</p>\n<p> </p>\n<p>A few minutes before the end of class, Aizawa-turns to Katsuki and Midoriya expectedly. </p>\n<p>“Midnight supervised us,” Midoriya says, rushed, “She had prep first and we made sure it was okay with her and we won’t be late again, we’re really sorry about that–”</p>\n<p>“So it was training,” Aizawa checks. “The reason you both look… like this, is because you’re developing your combo moves.”</p>\n<p>Katsuki stares at him. “Are you asking if me beating up Deku was safe, sane, and consensual? Because it was safe, sane, and consensual.”</p>\n<p>Denki wheezes. Iida looks like he’s in the beginning stages of a heart attack.</p>\n<p>“Get out of my class,” Aizawa monotones, with the eyes of a dead man.</p>\n<p>“I cannot fucking win with you assholes,” Katsuki mutters, turning for the door. Behind him, Midoriya’s face is bright pink, but the guy looks ludicrously happy for someone with heavily-charred arm hair. Even with Eijirou’s vague, spotty knowledge of their history, it makes sense. Training with Katsuki is like cliff jumping. He pushes, pushes, pushes until you’re drowning.</p>\n<p>But the <em>fall</em>. </p>\n<p>It’s exhilarating.</p>\n<p>Eijirou isn’t a poet, but he imagines his boyfriend makes him one. Midoriya would understand what he means but, privately, Eijirou thinks, no one will ever fall as fast, as hard as him. When it comes to Katsuki, Eijirou is untameable. </p>\n<p>“I, for one, respect a man with good BDSM etiquette,” Denki announces, the minute they’re out of earshot of Aizawa’s disapproving ears. It’s enough to break Eijirou out of his reverie and he laughs, laughs harder when Katsuki lunges at Denki without Eijirou to hold him back.</p>\n<p>It’s fine. He deserves it. </p>\n<p> </p>\n<p>The soft knock on his door that night isn’t unexpected. Eijirou turns to his mirror one last time, smoothes down his shirt before opening the door.</p>\n<p>“You ready to go?” Katsuki asks, his eyes soft. It does something to Eijirou, knowing that this sweetness, this gentleness, is something special, something reserved for him. He doesn’t have experience with good things, permanent things, but this–</p>\n<p>“Hey, dumbass,” Katsuki interrupts, one hand cupping his jaw. “If you’re tired or whatever we don’t need to–”</p>\n<p>“No, no.” Eijirou snaps out of it. “I’m all good, I just–”</p>\n<p>\n<em> I just really love you. I just can’t believe how lucky I am to have you. I just want to have this forever and, for the first time, I think that I might actually get to.  </em>\n</p>\n<p>“–got distracted! But I’m good now, dude, promise.”</p>\n<p>Katsuki huffs a laugh. “Let’s go then.”</p>\n<p>Their footsteps are quiet as they sneak out of the dorms, past the gates, and out into the streets of the city. Eijirou reaches out for Katsuki’s hand and the weight of it is warm and familiar. Nights like these are the reason why their relationship is a secret. He’s not ashamed of Katsuki, never could be, and it’s taken a while but he knows Katsuki feels the same about him. It’s just that their world is so <em> public </em>, between their friends, the school, the media, and their burgeoning careers. It’s nice to have something to keep for themselves.</p>\n<p>He echoes this last statement out loud and Katsuki hums in agreement.</p>\n<p>“I think I’m craving mochi,” Eijirou offers delicately, eyes fixed straight ahead, as they turn the corner towards the nearest 7-11. </p>\n<p>“It’s like I’m with fucking Round Face,” Katsuki says, huffing, but his hand still squeezes Eijirou’s because half the reason why he and Uraraka have become such great friends despite her cemented place in the Izucrew is that they both absolutely love the sweet treat (although nobody is quite on Uraraka’s level.) Then, “If you suggest getting fucking lame-ass packaged ramen, I’m breaking up with you.”</p>\n<p>“Even if it’s the super spicy version?”</p>\n<p>“Especially then, asshole, it’s a fucking insult.”</p>\n<p>Eijirou is still laughing when they leave the conbini, arms laden down with mochi and caramel corn and spicy squid chips. </p>\n<p>“You know,” Eijirou starts, “maybe you’ve got more in common with Uraraka than just the mochi?”</p>\n<p>Katsuki raises an eyebrow. “Excuse me?”</p>\n<p>Eijirou grins. “Well, you both have super soft cheeks, and near the end of training, they get really pink–”</p>\n<p>“I’m going to explode your fucking caramel corn if you don’t stop right now at this fucking instant.”</p>\n<p>“I mean, it’s exploded corn already, isn’t it?”</p>\n<p>“Do you want to fucking find out?”</p>\n<p>“Wait, bro, we should totally try that!”</p>\n<p>“Try what? Me exploding your fucking food?”</p>\n<p>“No like, making popcorn! If I hardened my hands around some kernels and you like, exploded them! We could make popcorn!”</p>\n<p>There’s a contemplating silence.</p>\n<p>“You thought about it for a second there,” Eijirou prods.</p>\n<p>“I was thinking about pushing you into the fucking street,” Katsuki replies.</p>\n<p>“There aren’t any cars out, what would even be the point?”</p>\n<p>Katsuki growls. “It’s the fucking <em> principle </em> of the thing.”</p>\n<p>A giggle builds up in Eijrou’s throat. “You’re such a nerd, babe.”</p>\n<p>His boyfriend turns to him, his eyes bright and so, so beautiful. “Yeah? This is big coming from the guy who can recite the location and purpose of every fucking muscle in the human body. The guy who remembers the dates and details of every Crimson Riot fight. The guy who forgot to come down for dinner yesterday because he was too busy designing our hero agency–”</p>\n<p>“I love you so much.”</p>\n<p>It’s not the first time he’s said it, but it falls out of him with the same desperation. Katsuki stops. Flushes that soft, pretty pink that has Eijirou wrapped around his pinky finger.</p>\n<p>“You’re so fucking gay.” He squeezes Eijirou’s hand. “I love you so much too.”</p>\n<p>Eijirou grins. “See? Nerd.”</p>\n<p>“<em> Oh my fucking god </em>–”</p>\n<p>“Bakugou? Kirishima?”</p>\n<p>They both freeze. On the other side of the crosswalk is one of the second-year Business students, Kobayashi Aia. Her sharp eyes have already picked up the hundred suspicious things about the scene; their interlaced fingers, their matching blushes, their faces that are so, so close. Hearing Red Riot saying “I love you so much” to someone who replies in kind. Having that someone be the Beast of 1-A, Ground Zero. Eijirou can’t say “It’s not what it looks like” because it <em>is</em>.</p>\n<p>“We won’t tell anyone we saw you out here,” Katsuki says. Eijirou turns and his heart breaks because his boyfriend is so tense, so nervous, and his grip on Eijirou’s hand is near-crushing. “If you don’t tell anyone you saw us. Deal?”</p>\n<p>Kobayashi nods, slowly. She starts to cross, and so they do as well. The air is colder than it was a minute ago but at his side, Bakugo is warm, and it’s enough to keep Eijirou from drowning.</p>\n<p>It all goes to shit so quickly.</p>\n<p>In front of them, the harsh lights of a convertible glow, the engine loud and bright. The driver either doesn’t see them or is going too fast too stop, and the noise of it all is deafeningly terrifying. Eijirou hardens on impact, pushing Kobayashi behind him, while Katsuki drags both of them out of the way. As quick as it had appeared, the car passes them, leaving ugly skid marks on the asphalt.</p>\n<p>“Asshole,” Katsuki mutters, before turning to Kobayashi. “Are you okay? Does anything hurt?”</p>\n<p><em> Look how much you’ve grown</em>, Eijirou thinks, fondly. This Katsuki that immediately checks on the civilian in the wake of an incident makes a beautiful contrast to the one that had failed his first Provisional License Exam on account of a horrifying bedside manner. Eijirou had loved him then, but now… <em> You’re amazing. </em></p>\n<p>“Jesus, Ei, she’s right here,” Katsuki hisses, his voice stuttery and breaking. </p>\n<p>Kobayashi inhales. “Oh no… I’m sorry, I’m so sorry, I didn’t mean to, I was just so scared and I lost control–”</p>\n<p>“Hey, hey, it’s okay,” Eijirou reassures, despite his heart spiking. “What’s wrong? What happened?”</p>\n<p>“My quirk,” Kobayashi mumbles miserably, looking at the ground. “When I… release it on two people, they can hear each others’ thoughts.”</p>\n<p>Well. That explains why his boyfriend is currently the colour of a cherry tomato.</p>\n<p>“How long will it last?” Eijirou asks.</p>\n<p>“Around two weeks, give or take a few days,” Kobayashi says, exhaling shakily. “I’m so sorry, I completely understand if you tell the teachers.” She groans, smacking herself in the face. “I just wanted some ice cream, how did this end up happening? I’m so sorry.”</p>\n<p>“Stop fucking apologizing,” Bakugo rumbles. “You’re okay, we’re all fucking okay, everything’s fucking fine or whatever.” <em> If it has to be anyone, I’m glad it’s Eijirou.  </em></p>\n<p>Eijirou looks down at him, grinning. “Aww Katsuki, you really mean that?”</p>\n<p>His boyfriend groans. “Shut the fuck up. Shut the fuck <em> up </em>.”</p>\n<p>“You looooove me. You have a cruuuuush on me. You wanna share your super gay thooooughts with me~”</p>\n<p>“I shouldn’t have moved out of the way,” Katsuki sighs, hauling Kobayashi up. “I should have let that fucking asshole hit us, honestly, a broken back would be better than this.”</p>\n<p><em> Masochist</em>, Eijirou thinks and, in the second right before Katsuki chokes and focuses intensely on salvaging what's left of their midnight haul, he realizes that this might be a problem.</p>\n<p> </p>\n<p>Kobayashi explains the rest on their way back to Heights Alliance. It’s not a constant stream of thoughts, but the more prominent feelings, words, and ideas will make themselves known. Dreams and nightmares can be shared occasionally, but it’s not an absolute rule. Distance shouldn’t have an impact. If they practice, they can probably shut the other out with minimal discomfort.</p>\n<p>By the time he and Katsuki are back on their floor, Eijirou thinks he’ll be able to handle this.</p>\n<p>“Are you okay with this? I know privacy is a big thing with you.”</p>\n<p>\n<em> He’s so caring what the fuck, how is he still thinking about how I feel, I love him so much how fucking dare he be this easy to love? </em>\n</p>\n<p>“Katsuki,” Eijirou sniffles. “If you’re gonna be this gay for the whole two weeks I’m not going to be able to make it.”</p>\n<p>The door slams shut in his face.</p>\n<p>Moments later, when Eijirou is lying down, ready to go to sleep, he feels a <em> Goodnight, I love you</em>, <em> even if you’re a shithead </em>and he hopes Katsuki can feel the luminous happiness that consumes him.</p>\n<p><em> I’m so lucky</em>, he thinks. <em> So, incredibly lucky. </em></p>\n<p> </p>\n<p>Katsuki is the unluckiest bastard alive. </p>\n<p>His joint training with Deku wasn’t a total fucking dumpster fire, they were patching up their relationship, he and Eijirou were going strong, none of the nosy, hobbyless chucklefucks they called their friends had found them out… All things considered, he should have expected this. </p>\n<p>Ever since the Sports Festival in their first year, he’s been training with Shinsou to block off his mind. He picks up the mental exercises that Kobayashi explains faster; by all accounts, he should be able to close that door. Hide himself from Eijirou, and lock him out in return.</p>\n<p>He just can’t.</p>\n<p>Hearing Eijirou’s thoughts is like having his ear pressed up against his boyfriends’ solid chest and hearing his steady heartbeat. It’s reassuring, to have the warmth of it grounding him throughout the day. Something strong, to lead him through. A mental version of Eijirous’ Unbreakable in his mind; a protector.</p>\n<p>“Kirishima, dude, are you okay?”</p>\n<p>Beside him, Eijirou’s eyes are wide as he tries to choke down his rice. Sparky gleefully takes the opportunity to whack him on the back.</p>\n<p>“Idiot, drink some water,” Katsuki grumbles, pushing a glass in his direction. Eijirou looks at him with watery eyes and Katsuki does his best to pretend the tears are because of the choking and not because of the massive amounts of sappiness his boyfriend had just borne witness to. He is Bakugo Katsuki, future Number One Pro Hero, he has a fucking <em>reputation </em>and now all of that is going up in smoke. Here lies Katsuki, he died as he lived, disgustingly sappy to the point that it fucking killed him because he’s a loser and deserves a losers’ death.</p>\n<p><em> I love you so much, </em> Eijirou thinks. <em> Do you know how cute you are? It should be illegal. </em></p>\n<p><em> Shut the fuck up</em>, Katsuki replies. <em> I abhor you. </em></p>\n<p>Eijirou smiles and Katsukis’ eye catches it.</p>\n<p>\n<em> His smile is so fucking beautiful. </em>\n</p>\n<p>“Kiri, dude, seriously, you’ve gotta start eating slower!”</p>\n<p> </p>\n<p>Despite Kobayashi’s assurances, they make the decision to keep the secret from Aizawa. Explaining their predicament would mean explaining why they were out in the first place and, while Katsuki doesn’t give two shits about whether or not his teacher knows he’s in a relationship, he refuses to get in trouble over a fucking mochi craving, of all things.</p>\n<p>He’s not Round Cheeks. He’s <em>not</em>.</p>\n<p>Beside him, Eijirou does a poor job of hiding his laughter. Katsuki is not the only one who notices this.</p>\n<p>“Kirishima!” Present Mic calls from the front of the room. “Would you mind sharing what you find so funny to the rest of the class!”</p>\n<p>“I was just thinking about that story you told us about Aizawa-sensei, sir,” Eijirou responds, smoothly.</p>\n<p>Present Mic preens. “Baby Eraser was hilarious, I agree. Still think he could stand to loosen up sometimes, but things take time…”</p>\n<p>There’s a fond look in his eyes, Katsuki realizes. Fuck, is Present Mic in love with Aizawa? Are they together? They’re old as fuck, are they <em> married? </em></p>\n<p>“Katsuki I’m begging you to stop,” Eijirou murmurs, his voice strained. </p>\n<p>He loves his idiot so much. If there’s one good thing about this whole thing, it’s that Eijirou knows, now, wholeheartedly. Katsuki’s not good with words, can’t express just how much of his world revolves around Eijirou but now, it’s been made embarrassingly clear. It would be humiliating if he didn’t love him so much. If some part of him wasn’t overwhelmingly glad for it to be made transparently obvious.</p>\n<p>“Sensei, can I go to the bathroom?”</p>\n<p>“Go right ahead, listener!”</p>\n<p>His boyfriends’ face is so, so red. It’s the cutest fucking thing Katsuki’s ever seen. </p>\n<p>“Huh, I hope Kiri’s okay,” Mina whispers from behind him. “He’s been off since yesterday. Do you think something’s happened?”</p>\n<p><em> Your friends are worried about you</em>, Katsuki thinks.</p>\n<p>\n<em> This is all your fault. </em>\n</p>\n<p>\n<em> Shitty Hair it’s not my fault that you’re a fucking homosexual. </em>\n</p>\n<p>\n<em> I hate you. </em>\n</p>\n<p>Pause.</p>\n<p>\n<em> Tell them I’m nervous about the math test. </em>\n</p>\n<p>“Dumbass is nervous about the fucking math test later,” Katsuki grumbles. “If he gets below an 80 they’re never going to find his body.”</p>\n<p>“Aww, look at you being a supportive boyfriend,” Raccoon Eyes coos. “Kiri’s so lucky to have you, Bakugou!”</p>\n<p>“I will pull out your toenails and stick them in your mouth.” <em> I’m the lucky one</em>.</p>\n<p>\n<em> KATSUKI, PLEASE! </em>\n</p>\n<p> </p>\n<p>Eijirou is trying so, so hard not to burst into flames every time Katsuki looks at him, but it’s getting increasingly difficult. How could anyone not know we’re together, he wonders, when he looks at me like that? His boyfriend is many things, but subtle isn’t one of them. Maybe their class is just cripplingly oblivious? That’s… not a great trait to have in so many of Japan’s rising heroes.</p>\n<p>“Pot meet kettle,” Katsuki mutters, capping his eyeliner.</p>\n<p>“Do you need help with your mask?” Eijirou asks, because one of them might as well showcase regular, romantic, non-asshole behaviour.</p>\n<p>\n<em> I thought you said me being all sappy and shit was killing you. </em>\n</p>\n<p>\n<em> Only because I’m not used to it. </em>\n</p>\n<p>Katsuki looks up at Eijirou and his eyes are so wide, so vulnerable; Eijirou can see the little golden flecks in his iris and it reminds him of victory.</p>\n<p>“I should say it more, then,” Katsuki says, softly.</p>\n<p>“You don’t need to,” Eijirou replies. He’s not lying. Katsuki shows love in his actions and it’s one of the reasons why Eijirou loves him. Cooking his favourite meals, patiently reviewing concepts, sneaking out at midnight; Katsuki doesn’t have anything to prove. Not to him. Not to someone who understands him the way he is, loves him the way he is.</p>\n<p>“If my eyeliner runs, I’m going to shank you in your sleep.” The threat would be scarier if Katsuki didn’t stutter his way through it.</p>\n<p>Eijirou gasps, because his asshole boyfriend is rubbing off on him. “Babe, did I make you cry?”</p>\n<p>“No,” Katsuki growls, shoving him out of the way. “Fucking control yourself.”</p>\n<p>They’re the last ones out of the locker room and Eijirou resolutely ignores the wide, Cheshire Cat grins from Denki, Hanta, and Mina. It’s nice to have supportive friends, but he shies away from imagining how enthusiastic they would be if they found out that he and Katsuki are actually a couple. It’s daunting. To be this vulnerable in his head, with Katsuki, really isn’t difficult. To showcase his heart so boldly, to everyone around him, is another thing entirely.</p>\n<p>As the thought gains traction in his head, Eijirou feels a wave of something buttery and comforting wash over him. It feels like stepping into a warm shower after a workout, the hot water running over him, reaching every dip and corner, soothing his aching muscles and relieving his skin. It feels like Katsuki. He turns. His boyfriend is all tense shoulders and furrowed brows, but there’s a certain looseness in his hands that tell Eijirou all he needs to know.</p>\n<p>\n<em> I love you. </em>\n</p>\n<p>\n<em> Love you more. </em>\n</p>\n<p>“We’ll be fighting in pairs today,” Aizawa announces. He sighs, looking like he would rather be decomposing in a landfill overrun by raccoons than speaking to his class. “I’m allowing you to choose your partners.\" The class looks warily between Katsuki and Midoriya. They’re unpredictable at worst, unbeatable at best. Eijirou feels the excitement thrumming in his chest, excited to see what his boyfriend had come up with–</p>\n<p>“Kirishima.” Katsuki is looking at him, something sharp and dangerous in his grin. <em> We’re going to wipe the fucking floor with the rest of these extras. </em></p>\n<p>Eijirou feels that same sharpness in the pit of his stomach and bares his teeth. <em> Fuck yeah. </em></p>\n<p>“This is extremely unsettling,” Todoroki says. No one disagrees with him.</p>\n<p>Eijirou almost feels bad. Almost. </p>\n<p> </p>\n<p>“We are in the presence of demons, reborn,” Tokoyami solemnly declares. A sore, groaning, wishing-they-were-dead Class 2-A agrees.</p>\n<p>“It was like they were one person,” Uraraka whispers.</p>\n<p>“I’ve never seen Kacchan move like that with someone else before,” Midoriya mutters.</p>\n<p>“I’m going back to France,” Aoyama groans.</p>\n<p>“Everyone go get changed,” Aizawa says, his voice embarrassingly close to something resembling amusement.</p>\n<p>“Sensei, please,” Denki whines. “Have some sympathy for the broken, the beaten, and the damned.”</p>\n<p>For a moment, Eijirou thinks Aizawa-sensei looks torn between painstakingly making a Denki skinsuit and zipping himself up in his sleeping bag until he suffocates. Katsuki chokes and tries his pass it off as a cough. The end product is enough to make Yaomomo look steps away from offering him her fancy, significantly-higher-tax-bracket tea.</p>\n<p>Katsuki doesn’t get sick. No, he thinks Eijirou’s <em>funny</em>.</p>\n<p><em> I’m breaking up with you</em>.</p>\n<p>“Kirishima and Bakugou, stay behind. Those who join them will be forced to fight them. Again.”</p>\n<p>Somehow, Kaminari Denki, the broken, beaten, and damned, finds it in himself to sprint to the locker room, wailing in pain the whole way. The rest of the class follows him, though with noticeably more dignity.</p>\n<p>Without the rest of their classmates to shoulder the weight of it, Aizawa’s gaze cuts through Eijirous’ composure like a particularly disgruntled kitchen knife. </p>\n<p>“Would either of you like to explain to me what I just saw?”</p>\n<p>“We’ve been practicing,” Katsuki replies, staunchly.</p>\n<p>Aizawa turns to him. Thank you, kitchen knife, Eijirou praises. </p>\n<p>Katsuki stomps on his foot.</p>\n<p>“After class,” he continues. “During weekends. On our own time. Our quirks are compatible as fuck.”</p>\n<p>“We work well together,” Eijirou says, trying to unstick his voicebox from his intestines. “And we figured out some super cool things that we can do, together, and we’re going to make this work, we’re going to go Plus Ultra–”</p>\n<p>His teacher squints at him. “How long have you been working on this?” </p>\n<p>“Three months.”</p>\n<p>“Not too long.”</p>\n<p><em> We’re telepathic, </em> Eijirou despairs<em>, how did we fuck that up. </em></p>\n<p>“We’ve been planning it out for three months,” he stumbles, “but we’ve only started actually training for the last few weeks.”</p>\n<p>Aizawa-sensei looks up at the ceiling like he’s begging it to come crashing down on him. Eijirou can relate.</p>\n<p>“You two did well today,” he says, finally. “If you need any help, or ideas for strategies, my door is open.”</p>\n<p>“Thank you, sensei,” Eijirou says. Katsuki echoes him.</p>\n<p>“Please go change,” Aizawa-sensei says, sounding like he’s on the verge of tears.</p>\n<p>“Yes, sensei,” they chorus.</p>\n<p>Eijirou wonders how stupid the two of them look, two hero students powerwalking away from a man who has to depuff his eyebags before weighing himself at the doctors’ office.</p>\n<p>“So fucking stupid,” Katsuki groans. </p>\n<p>“But it was worth it,” Eijirou says.</p>\n<p>Katsuki turns to him, eyes blazing. “So fucking worth it.”</p>\n<p> </p>\n<p>They settle into the whole thing, after that. Eijirou thinks about his moms, their movie nights, how competitive their family game nights would get. Katsuki pretends something in the cracked Wii remote that is his heart doesn’t melt. Eijirou suggests he come over sometime. Katsuki says okay.</p>\n<p>In Ectoplasm’s class, Eijirou zones out during the lesson, letting Katsuki's voice explain the concepts to him instead. When he's called on, he actually gets the answer right! Ectoplasm says, “Correct, Kirishima,” a series of sounds nobody has ever heard from the math teacher before. (Katsuki is <em> spoiled </em>that night.)</p>\n<p>During lunch, Katsuki looks out the windows. The sun tugs at something inside him and he remembers the days he used to spend hiking with his dad, the two of them climbing in silence, breaking the calm to point out vibrant leaves, rare bird species, a riveting snail shell. </p>\n<p><em> It sounds nice</em>, says Eijirou. He feels the switch in the energy, the nervous tick, Katsuki's tense inhale, the wanting so heartbreakingly sweet–</p>\n<p>\n<em> Mind taking me along sometime? </em>\n</p>\n<p>And Katsuki exhales. Thinks that maybe this quirk is good for some things. Dispels the thought as soon as he thinks it. The only real constant in Katsuki’s happiness is Kirishima Eijirou. </p>\n<p>They start practicing on the weekends, in their spare time. Neither of them likes lying to their homeroom teacher and both of them are determined to maintain their impossible synergy, quirk or no quirk. Katsuki always wins. Eijirou is unshakeable. Together, they bring down the sky.</p>\n<p>Their class congratulates them. Kobayashi stops looking terrified every time they make eye contact. Things start settling.</p>\n<p>Katsuki and Eijirou have never been good at settling.</p>\n<p> </p>\n<p>Depending on who you ask, everything comes around in either the sweetest way or the most humiliating way. Eijirou will always see it as a memory shrouded in rose petals and honey. If Katsuki drinks enough white wine, then exactly two cosmos, and has been awake for over 24 hours prior, he might admit something similar. </p>\n<p>What happens is this:</p>\n<p>It is Saturday morning and Eijirou is still blinking sleep from his eyes as he sleepily shuffles into the common room. Midoriya and Iida discuss a comic book series in the corner and Uraraka, Tsuyu, and Yaomomo are engrossed in a braiding chain in front of the sofa. Shouji and Tokoyami play cards at the table. Jirou reads quietly.</p>\n<p>It’s peaceful.</p>\n<p>Eijirou grins at his friends, pads past them towards the kitchen. Looks up. Has the breath knocked out of him.</p>\n<p>Katsuki’s cracking eggs into the pan, mentally humming a song Eijirous’ been singing non-stop, just to see if it would stick. He looks soft and snug in the hoodie he’d stolen back in first year, once it had outgrown Eijirou but not his own smaller frame. His arms are steady and sure as he flips the tamagoyaki, the smell of it already mouthwatering. There are enough for two, Eijirou notices. Katsuki is cooking for him too.</p>\n<p>In the end, it’s the culmination of all those things. Katsuki, always enduring. Katsuki, wearing his clothes. Katsuki, always thinking of Eijirou. Katsuki, looking like something perfect, something otherworldly, something exquisite. <em> I want to come home to him for the rest of my life</em>, Eijirou thinks. <em> He’s it for me. My Symbol of Victory. My reminder to breathe. The love of my life. Bakugou Katsuki. </em></p>\n<p>What happens is this:</p>\n<p>Katsuki turns off the stove and is very, very still. Eijirou only registers a shocked silence, before his boyfriend raises his fist to his mouth, attempting to muffle a choked sob.</p>\n<p>“Kacchan?”</p>\n<p>“Bakugou, are you okay?”</p>\n<p>“Are you hurt? Did you burn yourself?”</p>\n<p>“I’m fine,” Katsuki whispers. There are tears tracing their way down his face. </p>\n<p>Eijirou can’t help himself.</p>\n<p>“Oh, <em> baby</em>,” he murmurs, wrapping his boyfriend in his arms. “Is this because of–”</p>\n<p>Katsuki drops into him with a shaky breath, seemingly forgetting their wide-eyed, drop-jawed audience. </p>\n<p>“You fucking asshole,” he says. “You make me feel so– so–”</p>\n<p>\n<em> So loved. You make me feel so goddamn loved and I want to spend the rest of my fucking life making you feel the same way. I want to open a fucking hero agency together and become number one together and challenge each other every day of our lives and I want to come home to you, at the end of it all. I want to build a fucking house together, with room for your million and one weights and all my knives. I want to be home for you. </em>\n</p>\n<p>“I love you,” Eijirou breathes. “I love you so much.” It doesn’t feel like enough. Nothing he could say to Katsuki will ever be enough.</p>\n<p>“Ei,” Katsuki says, “you just made me fucking cry because of how fucking gay you are. Stop with that bullshit. Everything you do is enough for me. More than enough, even, you fucking overcompensater.”</p>\n<p>“But you understand, right?” Eijirou checks. “You understand how much I love you.”</p>\n<p>Katsuki kisses him, soft and sweet. “Believe me, Ei,” he says, the words dripping with fondness. “You’ve made it impossible for me to ever fucking forget.”</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Later:</p>\n<p>“Let me recap, for everyone whose brain just melted out of their ears,” Mina chirps. “You two,” she turns, stabs two aggressive “I’m-Watching-You” fingers at Eijirou and Katsuki, “are fucking telepathic.”</p>\n<p>Eijirou nods. </p>\n<p>“You have <em> been </em> telepathic for the past week and have told <em> none </em>of us, choosing instead to annihilate us without mercy and have Aizawa-sensei think you’re actually practicing.”</p>\n<p>“Stop blaming us for the fact that you fucking suck,” Katsuki snaps. </p>\n<p>“I mean, we have started practicing,” Eijirou sighs.</p>\n<p>“Shut up, you’re telepathic, you have no say,” Mina argues. The class agrees with her. Vocally. With anger. Katsuki’s pretty sure three-fifths of the fucking idiot parade is the reason why theres a giant intervention banner strung across the common room. Ponytail is selling “I’ve Been Personally Betrayed By KRBK” buttons. He doesn’t know what KRBK stands for and does not fucking want to.</p>\n<p>“And moving past the telepathy thing, which, again, <em> what the fuck</em>,” Jirou interjects. “You have been dating since fucking <em>first year</em>. And didn’t tell <em> anyone </em>.”</p>\n<p>“Look, we just wanted privacy–”</p>\n<p>“Actually, no, what the fuck,” Katsuki says. And again, “<em>what the fuck. </em> Sure, we didn’t tell any of you zero-IQ pussyfooters but how much more fucking obvious does it need to be? Asshole grabbed my hand at Kamino! We sleep in the same fucking bed half the time. Sometimes we eat lunch alone in the goddamn courtyard. <em> I cook for this fucking shithead. </em>”</p>\n<p>“You call each other bro and dude all the time!” Denki wails.</p>\n<p><em> “I also have fucking hickeys because I’m dating a goddamn shark furry does that scream bromance to you?” </em>Bakugo yells.</p>\n<p>“Shark furry,” Hanta wheezes.</p>\n<p>“Hickeys?” Deku asks.</p>\n<p>\n<em> This is why I didn’t want to have any fucking friends.  </em>\n</p>\n<p>\n<em> Babe, I can hear your inner monologue first-naming them. </em>\n</p>\n<p>\n<em> I take it back, I don’t want to spend the rest of my life with you. </em>\n</p>\n<p>“THEY’RE DOING IT AGAIN!” Mina shrieks. The room erupts with noise and Katsuki decides that he has had <em>enough</em>. By the small smile on Eijirous’ face, his boyfriend knows exactly where this is going and, Katsuki smirks, is overwhelmingly okay with it.</p>\n<p>They both stand up and the room goes quiet.</p>\n<p>“Okay,” says Eijirou. “We’ll be telepathic for the next week. We’ll be dating for… much longer than that.” He winces. “Honestly, we’re not really sorry about not telling you, being a secret was kind of fun.”</p>\n<p>“We will now be going upstairs to have sex,” Katsuki deadpans. “If you follow us I will throw you out the window. Don’t attempt to contact us for the next three hours.”</p>\n<p>“<em> Three hours </em>?” Shinsou hisses. </p>\n<p>Right as the elevator door opens, Aizawa-sensei’s dark, deadened, blunt kitchen knife voice reaches all twenty students of 2-A.</p>\n<p>“I will pretend to have heard none of that. However, rest assured that we will be having a conversation and Mondays’ lesson will cover <em> discretion </em>.”</p>\n<p>Katsuki flushes. Eijirou blanches.</p>\n<p>The rest of 2-A stares at the wall as if they are each of them Edward Cullen and the neutral paint is the beautiful shell of an effervescent snail. Twenty students and one teacher stand in a soul-sucking silence, until they hear the faintest sound of a door slamming.</p>\n<p>“Three-hour field trip,” Aizawa sighs. “Everybody out.”</p>"
}