{
  "id": "24216658",
  "url": "https://archiveofourown.org/works/24216658?view_full_work=true",
  "author": [
    "Billy_and_Friends"
  ],
  "title": "Billy Batson: The Patron Saint of Child Heros",
  "rating": "Not Rated",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen",
    "Other"
  ],
  "fandoms": [
    "Shazam! | Captain Marvel (Comics)",
    "Young Justice - All Media Types",
    "Justice League - All Media Types"
  ],
  "relationships": [
    "Billy Batson & Justice League",
    "Billy Batson & Jason Todd",
    "Billy Batson & The Team (Young Justice)",
    "Billy Batson & Tim Drake",
    "Tim Drake/Kon-El | Conner Kent"
  ],
  "characters": [
    "Billy Batson",
    "Jason Todd",
    "Kon-El | Conner Kent",
    "Tim Drake",
    "Bruce Wayne",
    "Clark Kent",
    "Dick Grayson",
    "M'gann M'orzz",
    "Damian Wayne",
    "Bart Allen",
    "Cassandra Cain",
    "Kaldur'ahm (DCU)"
  ],
  "additional_tags": [
    "Implied/Referenced Child Abuse",
    "Lazarus Pit",
    "Bruce Wayne is a Good Parent",
    "Homework",
    "Identity Reveal",
    "5+1 Things"
  ],
  "language": "English",
  "series": "Part 4 of Billy Batson is Tiny",
  "published": "2020-05-16",
  "completed": "2020-07-16",
  "words": "8,963",
  "chapters": "7/7",
  "comments": "418",
  "kudos": "6,847",
  "bookmarks": "682",
  "hits": "63,365",
  "summary": "<p>We all know Captain Marvel is just a kid, but the League doesn't.<br>Sometimes the only people who understand are people in your age range.</p>\n<p>Cap can't imagine thinking his parents weren't proud of him, so when he finds out Tim doubts it sometimes he has to take action.</p>\n<p>The team has a sleepover and Cap's invited. To bad Cap doesn't sleep much</p>\n<p>Billy knew that it wouldn't be good for the League to figure out his identity but he didn't think it would be this bad.</p>",
  "notes": "<p>Hi! This is my first time writing anything but at least I'm trying. Also I only know most of the characters from this site, so don't be upset if they seem ooc. Also I made up the Lazurus Pits stuff. There is a tiny bit of Language but it's Jason what else could I do.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Hey! I'm glad y'all like chapter one so much, it means a lot to me. This one is a bit longer, it also refused to work with me, hence the little bit of a wait. And a quick disclaimer, I only know these characters from other fics, but I tried my best. Hope you enjoy!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>I'm sorry if I didn't explain stuff well, but if you have any questions comments or concerns, feel free to ask!</p>\n<p>I don't like the way this turned out but I also couldn't do any better so √(°¢°)√ That was my best attempt at a shrug. Also ignore the fact that Canary bringing in homework doesn't really make sense.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>I hope you liked it!</p>\n<p>Hey y'all! I really thought this would take a while to write but nope, I wrote almost all of it super quick. There is a bit of language in this chap and this is the one involving the implied/referenced child abuse so stay safe.</p>\n<p>Also this was inspired by Vic_Kama's fic Divided (which you should definitely read)</p>\n<p>Hey sorry this chapter took a while, I couldn't figure out exactly where I wanted it to go. This isn't the 5th of the 5+1, just an extra bit of the last chapter.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">more notes</a>.)\n</p>\n<p>Was anybody going to tell me that Starkvenger has a tumbler with even more Billy content or was I supposed to find out myself? Sorry that's just my Billy-content deprived self peeking through.</p>\n<p>Also if you read this could you comment where you're from? I just want to see where y'all are at, I'm in West Virginia</p>\n<p>Hey I don't really know what happened when I wrote this chapter. Like I sat down with nothing but the idea of a sleepover with Cap and came out with this. Also I didn't even proof read this one either but Hope you enjoy!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">more notes</a>.)\n</p>\n<p>In case it wasn't obvious M'gann is talking about the whole white Martian thing.</p>\n<p>Also I want to know your favorite books cause I need recommendations.</p>\n<p>Hey y'all! Sorry for the wait, nothing I wrote seemed good enough to post but I am actually kinda proud of this one, so I hope you enjoy it!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_7_endnotes\">more notes</a>.)\n</p>\n<p>Sorry that the end is so blunt but that's where the flow stopped and I thought you guys had waited long enough. Hope you enjoyed!</p>\n<p>Also!!!!! First multi chapter fic finished!!!!</p>\n<p>Constructive criticism us appreciated, just make sure it's constructive!</p>",
  "text": "<p>Captain Marvel has had a long day, which turned into a long night, so sue him if he decides to hang around the watchtower instead of in his usual hideouts. It was around four in the morning which meant it was too late for most night-owls and too early for most of the early risers.</p>\n<p>Usually when Cap was up at this time (which happens quite often) the tower was pretty much abandoned, so he didn't even look around before making himself some coffee. Billy wasn't a big fan of the stuff but he needed a quick pick me up so coffee it was.</p>\n<p>\"Would you make me a cup while you're at it?\" The tired voice startled Cap to the point that it took him longer then usual too connect the voice to the recently returned Robin. Which totally didn't fill him with nerves, I mean it's just a guy who's been trained by /the/ Batman and also has no qualms about killing.</p>\n<p>He decided a verbal response wouldn't be necessary but the Champion of magic did take a moment to observe the vigilante.</p>\n<p>Jason seemed older than he does most days and ragged, more so then usual, and was staring at the table as if it had personally offended him. His clothes were a mess and his eyes were a little red, almost like he'd been- nope. Billy immediately ditched that train of thought, the murderous Red Hood crying? No way.</p>\n<p> Now that both cups were full (just by looking at the bird Billy could tell he wanted straight black coffee) Cap decided it would seem weird to move away from Jason so even though Billy was kind of scared of the man he sat across from him.</p>\n<p>They sat in silence for a few minutes, causing Billy to regret his decision and Jason to nearly chug all of the coffee. Billy had almost decided to abandon the coffee and get out of the tense room when Jason started speaking.</p>\n<p>\"I suppose you're going to ask what I'm doing up here?\" The Captain was pretty confused by this till he remembered he was supposed to be the adult in the situation and a teen up at four in the morning looking like trash was probably concerning.</p>\n<p>\"Oh-uh Do you want me too?\" Billy inwardly began to curse himself, how awkward can he make it? Instead of laughing at the Captain, Red Hood seemed to consider the offer. Whatever was on his mind must have been important.</p>\n<p>Jason seemed to stare into Cap's soul before saying, \"Damn, you are as weird as they say.\" The first thing Billy thought was to ask who was talking about him but was cut off by Jason continuing the conversation.</p>\n<p>\"What the hell, Dick said you were pretty good at advice or whatever so here we go.\" Once again Billy was panicking, how the hell do you give advice to /the/ Red Hood. It was too late to back out now as Jason seemed to have made up his mind about telling Cap about whatever was going on.</p>\n<p>\"Look, you know how I died and came back under weird circumstances?\" Jason received a nod from Billy, even though Batman had tried to keep it under wraps rumors had spread. </p>\n<p>\"Well, I came back through these things called the Lazarus Pits and-\" the teenager didn't get a chance to finish before being cut off by a gasp.</p>\n<p>\"The Pits?! I've heard of those that's crazy, to be honest I thought they were a myth, but- wait a minute don't they make you go a little, you know, rage-y when you use them?\"</p>\n<p>Almost immediately after the words had left his mouth Marvel clapped his hand over his mouth and started apologizing, but Jason cut him off, \"Yeah, those are the ones and yeah that's the problem. Bruce just doesn't seem to understand that I can't control the anger sometimes\"</p>\n<p>He took a second to finish his coffee before continuing, \"Like I don't want to hate the new kid, honestly Tim's pretty cool, but sometimes I look at him and all I can see is red, you know\" Cap nodded even though he didn't really get it.</p>\n<p>\"Does Batman know about the anger part of the whole resurrection thing?\" He waited till he got a shake of the head from Jason before continuing, \"Why don't you tell him?\"</p>\n<p>Jason seemed even more upset at this, \"It's not that easy! I try but whenever I bring it up he turns into this stone wall and refuses to talk about anything.\" Billy could see how hard that would be to get around. </p>\n<p>It was silent for a minute, while Billy contemplated. The older of the two seemed to get antsier the longer it was quiet. </p>\n<p>\"Ah-ha!\" The Captain's outburst startled Red Hood to the point that he almost dropped his empty coffee cup, \"If Batman shuts off when you talk too him, then I'll talk to him!\"</p>\n<p>Billy was feeling pretty proud of himself until he noticed Jason staring at him as though he had lost his mind. </p>\n<p>\"Are you serious? Bruce won't even talk to me, his so -his ex-robin , what makes you think he'll talk to you?\" </p>\n<p>\"Oh no, I won't actually talk to him, that man scares the crap out of me. No, I'll talk to somebody else, who doesn't look like they want to kill me while he's in the room. It'll work, he's constantly easedropping on me trying go figure out who I am.\"</p>\n<p>Jason appeared to be impressed by the Captain's plan, \"That might just work, but who could you talk to without it being out of place?\"</p>\n<p>\"Diana, she enjoys talking about magic. Trust me, man, this will work.\" It was silent for a while after that, but not nearly as awkward as before. It still wasn't long before Billy was making up an excuse to leave though.</p>\n<p>And if the Bat walk in on a strange conversation about the side effects of the Lazurus Pits, causing him to be much more understanding of his sons behavior, well it's just one child superhero helping another.</p>\n<p>Captain Marvel was easedropping, if questioned he would say they were being to loud for him not to listen, but still he was listening to Bart and Tim rant about their mentors.</p>\n<p>\"I'm just saying at least Bruce knows you're capable of doing stuff on your own! Barry hardly lets me go anywhere without some kind of babysitter,\" Bart was clearly upset about this, but Billy couldn't help but think that, however annoying, at least he was showing he cared.</p>\n<p>Evidently, Tim felt the same way, \"Yeah, that's awful but with Bruce you just have to guess his emotions! Like half of the time I'm not even sure if he likes me, like does that huff mean 'good job, Robin' or 'get out of here Tim'. \"</p>\n<p>After he said this the conversation quieted down so Billy could no longer hear them. This did get him thinking though. Batman was constantly bragging about his kids, how could they not know how proud he was?</p>\n<p>Even though Captain no longer had loving parents didn't mean he could imagine thinking they weren't proud of him. Right then he decided that he would find away to prove to Tim and the others how much their dad cared about them.</p>\n<p>It took a while of contemplating but eventually Billy had a plan. After a quick talk with Victor, he had everything he needed to get started.</p>\n<p>---------------------------------------------------------------------------------------</p>\n<p>It was a few weeks later when Tim found a flash drive and a note telling him to gather his siblings and watch the contents of the drive.</p>\n<p>Normally this would have sent Tim into a panick but he recognized Marvel's messy scrawl, not to say it wasn't worrying as the note did say that Bruce wasn't allowed to see it.</p>\n<p>It took another while to get everyone together without Bruce or Alfred sneaking in but they managed.</p>\n<p>\"This better be worthwhile, Drake\" Tim had interuppted Damien while he was working so for his own sake Tim hoped it was worth it too.</p>\n<p>Everyone seemed skeptical when he explained and both Dick and Cassandra wanted to consult Bruce before opening the files. It was hard work but eventually they all settled down and put on the first clip.</p>\n<p>The video seemed to have came from the security camera in one of the meeting rooms. Judging from the time stamp and the people leaving the room the Batboys and Cass could assume that it was just after their monthly meeting.</p>\n<p>Soon the only ones left were Cyborg, Wonder Woman, Marvel, and Batman. Bruce was chatting with Diana, too quite for the speakers to hear, when Marvel and Cyborgs conversation got a little too loud.</p>\n<p>\"All I'm saying is that Canary has been a hero for longer and therefore has more experience which would give her the upper hand!\" Victor seemed exasperated, like he didn't quite understand why Marvel was so invested in this conversation.</p>\n<p>It was safe to say that everyone was very confused, why did Marvel want them too watch this? They didn't have long to think about it before Cap's response began too play, \"But this is Nightwing! He has been doing this kind of stuff since he could walk!\"</p>\n<p>Bringing up Batman's oldest son certainly got Bruce's attention, \"What are you two debating about this time?\" </p>\n<p>Marvel and Cyborg shared a look. Before their response was heard Cass paused the video, \"Planned. Set up.\" The boys took a moment to rethink what they had saw before realizing that she was right, this interaction was planned, at least Marvel's and Cyborg's part was.</p>\n<p>\"Whatever, let's keep watching.\" Tim repressed the play button.</p>\n<p>\"We were just thinking, if Nightwing and Black Canary would be put in a gymnastics competition who would win?\" Marvel's remark gave the Bats more questions than answers.</p>\n<p>Diana seemed amused, but Bruce almost looked... offended? \"What are you talking about? Of course Nightwing would win.\" Bruce's comment seemed out of place for the man but he wasn't done yet. \"Dinah is talented, but Nightwing grew up training. He is, without a doubt the best acrobat in the JL, I've seen him in action enough to know that.\"</p>\n<p>That is where the first clip ends, leaving most of the children stunned. Dick looks happy enough to burst.</p>\n<p>\"Tt- Why are we suprized? Grayson is a half decent gymnast.\" Unsurprisingly, Damien didn't seem to care, but if you looked closer there was a trace of jealousy on his face.</p>\n<p>Then again, if you studied any of the kids' faces, barring Dick, you would find a bit of jealousy. However, they were considerably more interested in the videos now. With Dick still beaming the next video was played.</p>\n<p>This time they were watching one of the break rooms but Marvel and Cyborg were still onscreen. The heros were talking quietly.</p>\n<p>\"Are you sure this is gonna work because if it doesn't-\" Victor's concerns were never heard as Marvel seemed to panick and cut him off.</p>\n<p>\"I mean it isn't the best way to deal with criminals but at least it's working, you know?\" Victor seemed just as lost as the Bats until he noticed Batman had entered the room.</p>\n<p>Even though Bruce looked like he was just passing through the bit of conversation he heard had caught his interest.</p>\n<p>\"I hope you know how concerning that is to hear from a member of the League.\" Even though he didn't ask the question, the implication of the sentence were clear. </p>\n<p>Oddly enough, Marvel looked almost relieved at Bruce's non-question. \"We were just talking about Red Hood,\" Todd stiffined at the mention of his alter ego, \"And how even though he's violent, he's getting his job done.\"</p>\n<p>Batman seemed to puff up with pride, \"Of course he does. Not only is he stopping crime, he is doing more for Crime Alley then anyone else ever has. He is doing something most people couldn't dream of and he is doing it well.\"</p>\n<p>With that Bruce left the room and the video ended. Jason looked shocked, the rest of the kids were getting excited. If the first two videos were Bruce complimenting his kids, what if the others were about them?</p>\n<p>Cass was getting excited, \"Continue?\" Without response, Tim hit play.</p>\n<p>This video was taken from the corner of the monitor room but this time the only ones present were Clark and Bruce. They were both looking at newspapers from their respective cities.</p>\n<p>It wasn't long till Victor came in looking a little frustrated, \"Hey Batman, you said one of your kids was a computer whiz right? I need some help with this project of mine.\" Tim almost couldn't believe it, was Batman really telling the League he was a 'computer whiz'?</p>\n<p>\"First of all, Tim is a computer genius not a 'whiz'. He can do just about anything with any kind of tech, so using the word 'whiz' is a bit of an understatement and almost looks like an insult.\" Bruce did look a little offended on Tim's behalf.</p>\n<p>\"And second of all Tim is very busy with his own League work, so consider that before you ask him to do yours.\" Batman had raised an eyebrow in clear disapproval of Victor pushing his work on someone else.</p>\n<p>Cyborg got the message loud and clear, \"Alright, jeez, I'll do it myself.\" The clip cut off right after that, leaving Tim with a small smile and struggling to keep some tears in. </p>\n<p>\"Go ahead. \" They didn't need more then that to get the next video going. They were back in the meeting room, but it appeared to be before the meeting instead of after.</p>\n<p>Once again Cyborg and Marvel were talking, and yet again their conversation caught Bruce's interest. \"You honestly think the Rogues would beat the Birds of Prey? That's the dumbest thing I've ever heard.\"</p>\n<p>Victor was getting annoyed, \"I'm not saying they'd win I just think the Rogues might take a couple of the Birds out!\"</p>\n<p>Cass looked amused but all she said was, \"No.\" Evidently Bruce felt the same way. </p>\n<p>\"You can't seriously believe that a team of petty criminals with fancy guns could beat a team with Orphan on it. Even if the rest of the team was tied up, Cassandra would beat them in an instant. She could beat them with her eyes closed and her hands tied up!\"</p>\n<p> Cass lit up with pride and happiness at hearing her chosen father compliment her. \"I guess you're right, the Rogues wouldn't stand a chance.\" Victor's defeated tone got a laugh from Marvel before the footage cut out.</p>\n<p>This time there was no pause before Damien hit the next play button. This was the last video and it started in the dining area.</p>\n<p>The heros weren't talking this time, instead they were staring intently at a computer. The camera that the Bats were watching from didn't let you see the screen but you could hear just enough sound to figure out it was a news report.</p>\n<p>Bruce, as he was always spying on Marvel, seemed just as confused, as much as he gets that is, as his kids. \"Finally paying attention to something other then sports?\" His question snagged Marvel and Cyborg's attention.</p>\n<p>\"It's Gotham news actually. Apparently your kid, the newest one, has 'gained more then a few new manners' Victor's tone made it obvious he was mocking the reporter.</p>\n<p>At the mention of his youngest son Bruce softened, \"He has. Despite his... unstable upbringing he is overcoming his aggressiveness. I am quite proud of his progress, he no longer attempts to threaten Alfred when I'm not looking.\" </p>\n<p>\"Is Dami... smiling? Mark the calendar!\" Dick's voice broke the silence brought on by the end of the video.</p>\n<p>Of course his comment made Damien put a scowl on his face, \"Tt- Of course not, I know that my 'manners' have grown.\"</p>\n<p>Jason rolled his eyes, \"Did they now?\"</p>\n<p>This, logically, started a small wrestling match but for the first time in a long time the fighting felt friendly. And if the kids went to bed feeling a little bit lighter, or even a bit happier than before? Well I guess that was the Champion's goal, even if he did owe Victor several favors now.</p>\n<p>Billy was all alone in the Titans Tower, the entire team had gone on some big space mission and they had already been gone for a week. Honestly Billy didn't really know why he had came, he knew they weren't back yet.</p>\n<p>He was just turning to leave when he heard Dinah walk in. Even though he couldn't see her they were close enough for him to hear her voice.</p>\n<p>\"I know Ollie, I'll be home in just a second.\" She paused, obviously listening to her husband, \"I'm just dropping off the kids' work, poor things. I mean a week in space and they come back to a homework pile? Can't imagine.\"</p>\n<p>After this her voice faded away, even though the Captain no longer had to worry about running into someone he stayed still. Homework after a week of working? No, he can't let that happen.</p>\n<p>Billy sighed, he didn't want to leave them with the work but the only way to fix that wasn't very appealing. He sighed again before heading into the common room and sitting down.</p>\n<p>He wasn't looking forward to this but if someone has to do the work then he'd rather it be him. Besides it's been a long time since he did homework, since he usually just taught himself at the library.</p>\n<p>Billy decided it would be easiest to organize first and start working in a second. He definitely wasn't procrastinating when he separated the papers into more piles then was strictly necessary. </p>\n<p>After a bit of fidgeting he started to work, however it only took a few moments to realize he didn't know any of this stuff. He probably should have known he wouldn't, considering the age gap but still. It's a good thing the tower has all kinds of extra tech just laying around because Billy was going to need the help of a trusted friend, Google.</p>\n<p>With the help of the internet the math homework was quickly demolished but the English was where the problems began. Who assigns two essays in a week? Once again Billy got lucky and found several free versions of the essays that he was trying to write.</p>\n<p>With the help of Google, sparknotes, and Billy's oddly good forgery skills he was able to finish all of the work. Sure, it took hours and three cups of coffee for it too happen but at least he was finally done. The team better be happy I care, Marvel thought, ignoring the part of him that was ecstatic at the time spent feeling like a normal kid.</p>\n<p>He couldn't believe he had missed being forced to do schoolwork, but somehow he did. He took a second to think about it as he was straightening the papers and realized that the oddly happy feeling in his chest wasn't going anywhere.</p>\n<p>For a minute he considered a heart attack but then he came to the conclusion that he missed learning. With League business taking up most of his time he hadn't been in the library for a long time. Quietly deciding to get back into his studies the man finally began to head home.</p>\n<p>Home was a loose term, he was currently camping in an abandoned building that had been partially smashed by one of Sivanna's attacks. The thought of that less than homey room dampened his mood a little bit but not enough to wipe the satisfied smile off if his face.</p>\n<p>-----------------------------------------------------------</p>\n<p>\"Touch me again, Bart, and I will no longer be responsible for my actions.\" Tim was usually more polite but after a week in space, Bart's jitteryness was getting to him.</p>\n<p>The speedster just made a face and said, \"What's got your panties in a twist, we won.\" This got several groans from the rest of the team.</p>\n<p>Tim could feel his eye twitch, \"Not everyone has an endless amount of energy and, unlike you, I have already realized that going home is just going to be more work.\" Once again there was a round of groans from the team, the reminder of homework annoying them.</p>\n<p>The rest of the trip home was basically silent, so was entering the building. It wasn't until they hit the common room that they started talking again.</p>\n<p>Unsurprisingly, it was Bart who started the conversation, \"I'll trade my science homework for someone's math.\" This comment immediately started severall trade offs but before anyone finished trading out their work Tim found something... interesting.</p>\n<p>\"Guys!\" He waited but got no response, \"Guys, shut up!\" Finally the team quieted.</p>\n<p>\"Are you gonna lecture us about cheating, cause if so, I'm out.\" Tim just rolled his eyes before continuing.</p>\n<p>\"No, someone already did it. It's pretty good forgery too, good enough to fool a teacher. And the work isn't half bad either, honestly it looks like it would get at least a B.\" Tim continued to read through the papers as the team comprehended what he meant.</p>\n<p>\"Are you serious? Who would do that, it's a full week of homework for all of us.\" Connor did have a point but no one could figure out who would take the time to do this for them.</p>\n<p>Nobody was surprised, however, when they checked the cameras and watched Marvel glare at the papers till he was done.</p>\n<p>Connor and Superman were sparring, sure they were having another argument while sparring but that was to be expected. After all Clark still couldn't stand the idea of Connor, he had lost a bet and that was the only reason he was here.</p>\n<p>It hurt Connor when he found out about the bet, he thought that maybe Clark was coming around to him. But no, he was just there because he had to be. And whenever Connor was hurt it came out one way: anger.</p>\n<p>So now they were practically yelling while fighting. They were both yelling their side of the cloning experience, but neither cared enough to listen to the other side. Connor didn't think he needed to, he got it. Somebody stealing your dna was scary but they couldn't change that now, he was already here!</p>\n<p>Clark, on the other hand, couldn't bring himself to see Connor as anything more then a clone. Even with all of his colleagues telling him different, he just didn't see Connor as what he was. A child in need of help.</p>\n<p>So they kept fighting, it was getting loud too, the yelling broken up by the sounds of one of them landing a hit. They had been going at it for close to an hour when the doors were nearly knocked off if their hinges.</p>\n<p>Neither Kryptonian had time to figure out what had happened before Clark was pressed up against the wall. When Connors eyes caught up to the noise he saw... an angry Marvel?</p>\n<p>No that doesn't make any sense, Captain never got angry. Not even when they had went out of their way to make him angry, it was a bet that nobody had won.</p>\n<p>\"What the hell?! Connor's a kid, what were you thinking!\" Marvel's sentence didn't make sense, if anything it farther confused the Supermen. </p>\n<p>Clark was stunned into silence, he's seen the man take down villains without losing his easy smile and forgiving gaze but now? Marvel was furious, if he didn't know the man Clark would have assumed he was about to be killed.</p>\n<p>Connor might not have known what was happening but he couldn't let it continue. \"Cap! What's happening? Why are you attacking him?\"</p>\n<p>Marvel's gaze slid over to Connor, who at this point was more than scared. All of the anger fell from his gaze as the looked at Connor. \"He can't treat you like that Con, I knew he was being a dick to you but he can't just abuse you whenever he's angry.\"</p>\n<p>Neither Kent was sure what was more confusing; Marvel's calm voice, the swear in his sentence, or the use of the word abuse. \"Abuse? What are you talking about, we were sparring but it wasn't like he was just attacking me.\"</p>\n<p>Understanding dawned on the Captian, but he still didn't let go. \"He's never hit you outside of this room?\" His tone was so serious Connor almost forgot how to respond.</p>\n<p>\"No, of course not!\" Marvel studied him for another minute, making sure he was telling the truth before letting go of Superman.</p>\n<p>Even though he was free now he still didn't move, \"You think I would hurt him? Jesus, I would never!\" </p>\n<p>Marvel didn't look sorry in the slightest when he said, \"By the Gods, I hoped not but with the way you treat him I couldn't be sure.\" This forced Clark into silence, sure other heros have brought up concerns about the way he handled Connor but never so... bluntly.</p>\n<p>It made him think about what he could have done that made Captain Marvel, the man who saw the best in everyone, worry for Connor. It didn't take long for him to realize exactly how horrible he had been to the clone- no not a clone, a child.</p>\n<p>\"I'm so sorry, I didn't realize...\" Clark's words were confusing to Connor, who had lost track of the conversation. He was lost when tears came to Clark's eyes and he was even more lost when Marvel said, \"Holler if you need me but I think this is personal.\" before leaving.</p>\n<p>Needless to say there was a very long and very tearful conversation between the Kryptonians that ended with a promise to try again, without focusing on the clone part.</p>\n<p>------------------------------------------------------------</p>\n<p>(Cap's perspective, but it's before he came in)</p>\n<p>Marvel was almost done with monitor duty, but instead of looking at a clock he was staring at a note book. A passerby wouldn't know it but the page he was staring at was quite concerning; it was a list of all the reasons to suspect Superman of hurting Connor.</p>\n<p>The list was set up as a pros/cons list. The for first item defending Clark was the fact that he's a hero. That point was cancelled by a point in the cons side that said not all heros are heroic. Marvel had seen to many good people do bad things to fall for a good guy act.</p>\n<p>The next was that Clark wasn't violent towards anyone else, just bad guys. This point was also cancelled by the fact that Clark occasionally acted like Connor was a villain, just for being a clone.</p>\n<p>The next defense was that Connor rarely had unexplained bruises, it takes a lot to hurt the Kryptonian though so maybe that wasn't quite fair. Also Billy knew how smart some abusers could be, from his own experience sadly.</p>\n<p>The next was that, while annoyed and frustrated, Clark was never violent towards his clone when Billy was around. This item was marked out almost as soon as it was written, again from Billy drawing from his own experiences.</p>\n<p>In the end the list didn't really help, so the Captain had to decide. Talk to Connor and risk freaking him out or scaring him away, or hope for the best and believe that Clark was a good guy.</p>\n<p>But then again how many times had he wished for someone to just ask or help when he was hurt? That made up his mind, he would take the risk and talk to Connor as soon as his monitor duty was over.</p>\n<p>Eventually the time came and Billy had talked himself up enough to have what was most definitely going to be a hard conversation.</p>\n<p>\"Come on, what if he's in danger?\" He whispered to himself when he hesitated at the door. Most of the team was busy so it shouldn't be hard to find him.</p>\n<p>Despite this he didn't see Connor in any of the usual hang outs. He decided to check the training rooms, maybe he was working out? Captain was just beginning to lose his nerve when he heard the noise.</p>\n<p>There was yelling coming from the room, seemed like Connor and Clark were having one of the arguments that made Cap worried in the beginning. He was just gonna wait till Clark left so he could ask Connor when he was alone but then he heard it; the sound of someone getting hit.</p>\n<p>Cap was in the room before he could fully digest what that noise meant, he had Clark pressed against the wall. Damnit, why was this the time he was right. He ignored the hurt that came from the realization that his hero was a bad guy, he had bigger fish to fry.</p>\n<p>Billy didn't hear the words that came out of his own mouth, he was to focused on the rage that seemed to control him.</p>\n<p>\"Cap! What's happening? Why are you attacking him?\" Connor's voice drew his attention away from the man in front of him. Looking at the frightened boy reminded Cap why he was here, to protect his friend. He didn't deserve this, nobody does.</p>\n<p>Once again Billy misses his own words, hopefully they were considerate and not aggressive. Whatever had came out of his mouth made both Kryptonians confused.</p>\n<p>\"Abuse? What are you talking about, we were sparring but it wasn't like he was just attacking me!\" Wait, this was the training room, wasn't it? Oh, that made much more sense but he still needed to make sure.</p>\n<p>\"He's never hit you outside of this room?\" Connor almost looked more shocked then before.</p>\n<p>\"No, of course not!\" The honesty in his tone made Billy back down. Thank God, he doesn't know how well he could have controlled himself if he found out what he had believed was true.</p>\n<p>Clark's sputtering gained his attention, \"You think I would hurt him? Jesus, I would never!\" Even if he would regret it, Billy couldn't sweep Clark's actions under the rug, the way he treats Connor is wrong.</p>\n<p>\"By the Gods, I hoped not but with the way you treat him I couldn't be sure.\" Honesty is the best policy, right?</p>\n<p>He could see the blood drain out of Clark's face as he realized the full extent of his actions.</p>\n<p>\"I'm so sorry, I didn't realize...\" With the confirmation that Clark meant no harm, he figured he was no longer needed and headed out, but not without telling Connor that he would help if needed.</p>\n<p>As he was leaving he realized exactly what his actions meant, he had attacked Superman! He would never be trusted again he might even get kicked out of the League! </p>\n<p>No, he couldn't be sorry. Clark shouldn't have given him reason to doubt, if his suspicions had been right he wouldn't have hesitated to put Clark in jail. Nobody gets away with child abuse, not if he can help it.</p>\n<p>Billy hadn't been this nervous since originally joining the league. Did he regret his actions? Not at all, if Clark didn't want to get body slammed against a wall he shouldn't have treated Connor that way.</p>\n<p>That would be how they saw it too, right? But what if they saw how quickly he jumped to conclusions and decided he wasn't fit for the league, that would destroy him. Plus even if they did kick him out they now knew he was strong enough to beat Superman, Batman would never leave him alone!</p>\n<p>\"You good there, Cap?\" The Flashes voice jarred him out of his thoughts. Billy hadn't even noticed that he had made it all the way to his seat at the table. But Flash didn't look angry or even upset, just a tad concerned. </p>\n<p>\"Yeah I'm fine.\" Cap could tell his voice was lacking it's usual tone, worry made it impossible to seem completely normal. Flash still looked concerned but Batman was ready to start the meeting so there was no more room for talking.</p>\n<p>Despite Cap's fidgeting and internal panick, nothing was said through out the entire meeting. Maybe Batman was waiting to keep Billy on his toes? No that didn't seem like a Batman thing to do.</p>\n<p>His odd behavior had attracted a few questioning glances but nobody said anything, well until Batman got fed up with it.</p>\n<p>\"Captain, is there something you'd like to add or are you going to continue being a distraction?\" What was he supposed to say, 'Sorry, just thinking about body-slamming Superman.' That'd be horrible.</p>\n<p>But before Cap could stammer out some kind of excuse, Superman stood up. \"I'm sorry, may I but in here? I was going to wait till after but clearly that has put some of us at unease.\"</p>\n<p>His statement made confusion appear on every face in the room, even Batman quirked an eyebrow but allowed Superman to take the floor.</p>\n<p>\"Recently I was made aware of my actions towards Connor,\" the clones name was almost more shocking then the rest of the conversation, Clark always avoided talking about Connor.</p>\n<p>\"While I knew I wasn't being kind to him, I wasn't aware that some of my actions could have been interpreted as abusive.\" This drew several gasps from the usually unshakable heros, sure they knew Clark was mean to the boy but, abuse?</p>\n<p>\"I would like to take this time to apologise for my actions and thank Captain Marvel for showing me how wrong I was.\" With that he sat back down leaving a silence in his wake.</p>\n<p>Most of the heros had turned to Marvel for an explanation, but he was just as confused as the rest of them. Why had the Kryptonian thanked him, Billy had attacked him! \"Me? But I-\" </p>\n<p>Superman cut him off. \"You did the right thing, Captain, even if you were a little aggressive about it.\" </p>\n<p>\"Aggressive? The Captain, no way, he's the least aggressive out of all of us!\" Hal voiced everyone's thoughts, but Batman had, evidently, had enough of this conversation and went back to the meeting.</p>\n<p>The rest of it didn't accomplish much as most people were staring at Cap and Cap just looked bewildered. Soon it was over and people were finally free to ask their many questions.</p>\n<p>\"What the hell was that about, Cap?\"</p>\n<p>\"What did you do?\"</p>\n<p>\"Come on, tell us!\"</p>\n<p>Thankfully the Black Canary came to his rescue, \"If he doesn't want to talk he doesn't have to.\" Something in her eyes made Billy think she already knew what happened but he couldn't let this perfect escape go to waste so he didn't ask.</p>\n<p>\"Thanks Dinah, I think I'm gonna head home now, uh ask Superman if you really want to know.\" That last bit was tacked on as he knew nobody would actually do that.</p>\n<p>As Marvel was leaving the only thing he could feel was relief. How he was still in the league was beyond him, but he was never one to look a gift horse in the mouth.</p>\n<p>-----------------------------------_-------------------------</p>\n<p>\"Are you going to explain, or am I going to watch the cameras?\" Bruce's voice shook Clark from his thoughts. The Kryptonian didn't really feel like sharing but he also knew that Bruce would be filled with suspicions if he just watched the tapes.</p>\n<p>\"Marvel put Connor's well being in front of his own, that's all.\" Clark knew it wasn't enough to satisfy the man but it's all he'd get. It wasn't like anything Clark said could stop him from checking the cameras anyways.</p>\n<p>The team was having a slumber party. Technically it was a team bonding exercise but really it was just the group getting together and watching movies.</p>\n<p>Usually Billy wasn't invited, seeing as he was supposed to be the 'adult', but this time he had let it slip that he'd never seen Finding Nemo. According to Bart, this was practically a cardinal sin. </p>\n<p>After a quick conversation via mind link, it was decided that Cap could come as long as he promised that he would abide 'Vegas rules'. Which apparently meant he wasn't allowed to tell anyone what happened during it.</p>\n<p>They also asked him to come out of costume, which was the current problem. What does a normal human man wear to a sleepover? Surely he wasn't supposed to show up in pajamas, they weren't going to bed instantly right?</p>\n<p>That was the second problem; Billy had never been to a sleepover. Sure he'd stayed with Freddy before but that was different as Freddy knew he only had one set of clothes! Actually, that wasn't quite true. As Captain Marvel he could change his suit into anything he wanted but what would make sense?</p>\n<p>Screw it, Vegas rules right? If he looked stupid they couldn't tell anyone, at least that's what he told himself as he changed into, a cleaner and much bigger version, of his usual red hoodie and jeans. </p>\n<p>Walking into the tower felt odd, Billy'd never been anywhere League related without his usual suit. All other teams and heros had been banned from this floor of the tower so.</p>\n<p>He hesitated before heading into the common room, what if he looked stupid? No, he can't think like that. Billy headed on in.</p>\n<p>Only to receive a gasp from Bart. \"Woah, dressed down Cap!\" His remark gained the attention of the rest of the team. A blush overtook Cap's face as the team stared. He must have chosen the wrong thing to wear.</p>\n<p>\"I gotta say seeing you out of costume is a little odd.\" Thank the gods, they weren't staring cause he looked dumb, they were staring cause it was different.</p>\n<p>\"This is kinda what I wear all the time.\" Hopefully that would finish the subject. After moment everyone went back to their conversations, everyone but Bart that is.</p>\n<p>\"Come on, I need help with the snacks.\" The boy darted into the kitchen, followed by the Captain. As soon as Billy got in the room his arms were being loaded up with food.</p>\n<p>\"Is this necessary?\" The part of Billy that was focused on survival was screaming, this much food for one night! Bart just looked at him like he was dumb.</p>\n<p>\"Yeah, duh. This is a full night of movies and games who wants to have to get up in the middle of it?\" Still that was a lot of food, but Billy let it drop and went to put the food on the coffee table. </p>\n<p>\"So seeing as this is Cappy's first time, we gotta go over the rules.\" Rules? Cap thought this was just for fun. Tim pulled up a document on his computer, geez they took this stuff really serious.</p>\n<p>\"Here this is our list, these are just to avoid fighting and stop us from tearing each other apart.\" </p>\n<p> 1. No antagonizing each other. (It took Billy a second to understand that one.)<br> 2. No referencing the Ostrich Incident<br> 3. No phones unless it's important<br> 4. If there's an argument about the movie, Google chooses<br> 5. No lying during games</p>\n<p>There were several more but before Billy could read them the computer was snatched away. </p>\n<p>\"Alright let's get this started! Game or movie?\" Cap found himself a seat on the ground (the actual seats were taken up by the teenagers practically laying down on them) as it was decided that they would start with a game.</p>\n<p>\"Can we do Never Have I Ever?\" M'gann's choice was accepted but Cap was already lost.</p>\n<p>\"Um- how do you play?\" His statement got him several shocked stares but Tim did explain and soon they started.</p>\n<p>\"I'm going first!\" Bart's voice gained everyone's attention, \"Never have I ever.... been adopted by a billionaire!\" This got several pieces of popcorn thrown at the teen, but Tim did put a finger down.</p>\n<p>They decided to go in a circle so M'gann was next. \"Hmm. Never have I ever stolen something.\" Conner put a finger down, which caused such a big commotion that nobody noticed Cap's finger go down too. Or he thought no one noticed.</p>\n<p>\"Seriously? You, Captain Marvel, have stolen before?\" Kaldur's incredulous tone brought another blush to Cap's face.</p>\n<p>\"Yeah, I mean, it was a long time ago. Connor your turn!\" Switching the subject should work.</p>\n<p>\"Oh-uh. Never have I ever lied to get out of monitor duty.\" Everyone but Cap and Kaldur put a finger down.</p>\n<p>Next was Tim, seeing as he was almost on top of Connor. \"Never have I ever gotten powers just by existing.\" The game continued, Kaldur ended up winning, but soon the game was over.</p>\n<p>The night continued and Cap had to admit he was having a good time. It seemed like seconds but soon it was nearing one in the morning and Billy was the only one left awake, Finding Dory playing in the background.</p>\n<p>Billy was never an easy sleeper, with the addition of nightmares he tended to just stay awake till he actually passed out, or got close, so he decided to get the others some blankets. It was decently cold in the room. After tucking the kids in, Tim and Connor were so overlapped that they only needed one, Cap headed to the kitchen so he could get himself so tea going. The tower usually had piles of tea bags, and Billy had realized it was much better than coffee.</p>\n<p>His water was beginning to boil when he heard a shuffling from the common room. Billy headed back just to make sure everyone was alright.</p>\n<p>Bart was the source of the noise, he was still asleep but seemed distressed. Shoot, how do you do this. Billy decided that touching him wouldn't be well received so he started talking.</p>\n<p>\"Hey, Bart, dude. It's, uh, it's fine nothings happening, you're fine.\" His words seemed to pull Bart out of his dreams a little.</p>\n<p>\"Safe?\" Geez, what had the poor guy been dreaming about.</p>\n<p>\"Yeah, buddy, go back to sleep, everything's ok.\" This seemed to work as after a second Bart fell back on the couch, hopefully having happier and safer dreams.</p>\n<p>Deciding his job here was done, Billy went back to the kitchen unaware of the pair of eyes that followed him. </p>\n<p>Billy went on making his tea, putting way more sugar than strictly necessary. It had finally cooled down when Billy heard someone enter the room. Looking back he saw M'gann, odd she was normally a sound sleeper.</p>\n<p>\"Would you like some?\" M'gann shook her head, she looked concentrated like she was trying to make up her mind about something. This was weird, M'gann was normally pretty light hearted but she seemed very serious right now.</p>\n<p>\"Can I ask for some advice?\" At his nod the Martian continued, \"Say theoretically I had something tell some friends, and it's really important to me, but I know it would really mess with them and they might even get mad at me, what do I do?\"</p>\n<p>Her words came out in a rush like she couldn't quite stop once she had started. Billy took a minute to think about what she had asked and couldn't help but reflect on his own hidden age issue. </p>\n<p>\"Is it something you went out of your way to hide?\" She nodded, \"Well, do you regret hiding it?\" There was a long pause before she decided to say no. \"Do you have a good reason for hiding it?\" Another nod.</p>\n<p>\"Then as far as I can see, your friends shouldn't be upset. If you had a good reason and you don't regret doing it then they should understand and if they don't, well that's on them. If you felt the need to hide something, that's not really on you.\" This must have been the right thing to say as she seemed much more at ease.</p>\n<p>\"But what if they hate me for it?\" Clearly this had been in her mind for a while.</p>\n<p>\"It's their loss, which I know isn't the most satisfying answer but it's the only one I have. But you know you'll always have us, right?\" Her worried expression told him that the team was who she was worried about. </p>\n<p>\"How do you know that?\" Her tone was almost accusatory.</p>\n<p>\"I guess I don't know about them but I guarantee you I will always be in your corner.\" Cap meant it, this team was important to him, the kids practically being family.</p>\n<p>She didn't respond but she looked mollified. They sat in silence for a while before M'gann got up and excused herself. But before she left she decided to shock the Captain one more time by slamming into him with a hug.</p>\n<p>\"Thank you.\" The tears in her voice frightened Cap but he still hugged back.</p>\n<p>\"Anytime M'gann.\"</p>\n<p>She left afterwords leaving Billy with his thoughts. How long had it been since he'd been hugged like that</p>\n<p>This mission couldn't have gone worse. Black Adam had destroyed a small neighborhood in an attempt to hurt Marvel. Thank the gods there had been no casualties and few injuries. But Adam had bigger plans and Cap unfortunately didn't see them till the lighting had come down and by then it was too late.</p>\n<p>Adam vanished leaving a human Billy surrounded by shocked teammates and and crumbling buildings. Billy should have called Shazam again and escaped while he still could but the hurt and confused stares from his team left him frozen.</p>\n<p>\"Get to the tower, now.\" Superman's tone was furious and left no discussion. So all the heros, Billy included, quickly followed the order. </p>\n<p>Shit! Any respect and trust Billy had earned from the heros would surely be gone now. Good gods, they would kick him from the league! What if they figured out he was homeless? They would send him back for sure! </p>\n<p>The threat of going back to foster care with the addition of his biggest secret being revealed was almost enough to send Billy into a full blown freakout. What had Freddy called them? Panic something but Billy couldn't remember and didn't have the time to figure it out as the group of heros had finally reached the meeting room.</p>\n<p>The silence was unbearable, everyone staring at him with all kinds of emotions written on their faces. The scariest ones were those with anger in their eyes. Never once had Billy seen an adult with that look in their eyes and not been badly hurt soon after.</p>\n<p>Shut up Batson! These are your teammates, they wouldn't hurt you. Right? Billy wanted to disappear, or pass out at least but he had no such luck as the yelling began.</p>\n<p>In a few seconds the heavy silence had exploded into noise. It seemed like everyone was yelling at him with everything from accusations to demands for an explanation. The few who weren't yelling at him were yelling at each other, which just caused more and more arguments.</p>\n<p>Don't cry. Don't cry. They already think you're a baby if you start crying they'll know for sure that you are. It's fine, soon they'd shut up and you'll be able to leave. It's fine! You're just freaking out Batson, this is fine.</p>\n<p>This was not fine. Why can't Billy breathe? Why was it still so loud? What the fuck is happening? Billy needed to leave and he needed to leave right now.</p>\n<p>The kid was gone in seconds, years of running from other adults kicked in and soon Billy found himself back home in Fawcett. Too bad the league was so busy yelling at each other that not even Batman noticed his absence.</p>\n<p>-------------------------------------------------------------</p>\n<p>The Titans were in their part of the tower when they heard the yelling. It took a little digging but with Tim's help they were able to piece together what had happened.</p>\n<p>Cap's a kid? Actually not the strangest thing, in fact it made a lot of sense. His immature behavior and his ability to fit in perfectly with the team of teenagers.</p>\n<p>\"They're really going at him aren't they?\" Bart's usual cheery tone was worried as it came close to an hour of yelling. Honestly what else did they have to say to the Captain?</p>\n<p>\"Yeah... He's not going to get kicked is he?\" Connor was also very worried, even if Cap was a kid he was still a good person and a great teammate.</p>\n<p>The lapsed into silence for a while before Kaldur stood up, \"We can't let this happen, Captain has done nothing wrong! They never said we had to disclose our identities.\"</p>\n<p>The rest of the team shared his sentiments, but still what could they do scold the Justice League? Well they could try but it probably would not end well. Through the mind link they came to a decision.</p>\n<p>If they couldn't stop the league from yelling or kicking Cap from the league then they could, at least, show him that they were on his side.</p>\n<p>So despite the gut feeling telling them to avoid the yelling they went to the meeting room. Surprisingly the door was cracked open, like someone had left in a rush and forgot to close it.</p>\n<p>The yelling was almost unbearably loud in the room, Connor had to put his hands over his ears not that it did much to help. Thank God for the mind link, they wouldn't have been able to hear each other without it.</p>\n<p>'They aren't even yelling at him, just each other.' Bart had a point. Every hero was yelling at another person but no one was directly talking to the Captain. Actually, they couldn't see the Captain.</p>\n<p>'He's not here, no random kid either.' Connor's confirmation had the team leaving the room. They went a little ways from the room so they could hear each other talk.</p>\n<p>\"Where'd he go?\" M'gann's question was aimed at Tim so he took that as a signal to pull up the security cameras.</p>\n<p>Skipping back to before the league had arrived, Tim started the video. The team was silent as they watched the boy, their Captain, come close to tears before running from the room.</p>\n<p>\"Those idiots! Captain was clearly freaking out and they didn't even notice!\" Despite her usually happy demeanor, seeing her Captain in such a situation made M'gann upset.</p>\n<p>She started to march towards the meeting room, but Bart stopped her before she could get far, \"What are we gonna do, I mean there the Justice League.\"</p>\n<p>This made everyone pause. Despite the want to go in there and yell and scream at the adults for being idiots, they were still only kids. And no one listens to kids, not even superhero kids. No wonder Captain kept his identity a secret.</p>\n<p>\"I believe the best plan would be to find Cap and let him know we're on his side.\" Kaldur was right, that was probably all they could do but where would Captain go? </p>\n<p>The team ended up going to Fawcett, figuring that if they all split up then they'd find him eventually. It was M'gann who ended up finding him.</p>\n<p>She was flying over a neighborhood that seemed mostly abandoned, many of the buildings were empty and falling apart. M'gann heard the harsh breathing first but followed it to find the same boy from the cameras curled up in a little ball with tears on his face.</p>\n<p>After telling the rest of the team via mind link she began to make her way towards him. \"Captain?\" Judging by the way he jumped he hadn't heard her approach.</p>\n<p>He was on his feet in a instant and was wiping his eyes as he looked for the source of the noise. \"Oh, M'gann-I mean Miss Martian, uh who's Captain? I'm not a Captain.\" </p>\n<p>The Martian had to appreciate his attempt at seeming inconspicuous but it was far too late for it to work. \"It's alright, Cap. We know who you are.\"</p>\n<p>His eyes dropped to the floor, it's weird to see the usually happy Cap so subdued. Then again it was weird to see him so young. \"All of you?\"</p>\n<p>M'gann's heart broke a little bit when she heard the defeat in his tone, \"Yeah, at least the team does, but it's fine. You're still our Captain.\" Confusion took over the boys face but he didn't have a chance to question it.</p>\n<p>\"Yeah man, I don't care what the League thinks you're stuck with us.\" When had Bart gotten here? Actually, looking around she saw the full team, they must have snuck up here.</p>\n<p>\"Is that really up to you guys?\" There was spark of hope in his tone.</p>\n<p>\"It is now. Even if they kick you out we'll just add you back to our team as a member instead of a leader. That's completely out of their control.\" Tim's statement clearly did more to ease Cap's mind then anything else did.</p>\n<p>\"Yeah screw them, honestly we should have known you were a kid. No adult is as cool as you, Cap.\" Conner was right looking back at most memories it was pretty obvious Cap was very young. Like what kind of adult does someones homework for them? Wait a minute...</p>\n<p>\"Holy shit, a child did our schoolwork.\" Bart's exclamation made Cap laugh a little.</p>\n<p>\"Yeah, google really did most of the work though.\" It was clear that the Cap they were used to was already coming back. \"Thanks guys, you know, for not freaking out like everyone else did. And uh I guess I should re-introduce myself. Hi, my name's Billy Batson.\"</p>\n<p>Tim choked on air, \"Bat-son? Good God, B's gonna have a field day with that.\"</p>"
}