{
  "id": "24273403",
  "url": "https://archiveofourown.org/works/24273403?view_full_work=true",
  "author": [
    "ohwickedsoul"
  ],
  "title": "landscape after cruelty",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen",
    "M/M"
  ],
  "fandoms": [
    "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
  ],
  "relationships": [
    "Bakugou Katsuki/Midoriya Izuku"
  ],
  "characters": [
    "Midoriya Izuku",
    "Bakugou Katsuki",
    "Kirishima Eijirou",
    "Todoroki Shouto",
    "Shinsou Hitoshi"
  ],
  "additional_tags": [
    "Quirkless Midoriya Izuku",
    "Support Department Midoriya Izuku",
    "Bakugou Katsuki is Bad at Feelings",
    "Bakugou Katsuki Swears A Lot",
    "Slow Burn",
    "Bakugou Katsuki Gets Therapy",
    "Kirishima Eijirou is a Good Friend"
  ],
  "language": "English",
  "series": "",
  "published": "2020-05-19",
  "completed": "2020-09-17",
  "words": "19,105",
  "chapters": "9/9",
  "comments": "994",
  "kudos": "29,454",
  "bookmarks": "6,564",
  "hits": "283,630",
  "summary": "<p>“Bakugo, you need to update your costume.” Kirishima said, “There’s this one dude in the support class- he’s got a literal waiting list, that’s how good he is- but he did my new upgrade.\"</p>\n<p>“Yeah,” Bakugo sighs and leans back on his hands, staring at the bracer. “I know. I’ll go,” his mouth twists a little. “I’ll go tomorrow. This is just- this is my design you know?” he’s not explaining himself very well, and refuses to look at Kirishima.</p>\n<p>“It can be hard to give up your first hero design, and you did a great job,” Kirishima said. “You definitely had the best one out of all of us when we first got our costumes.\"</p>\n<p>Bakugo hunched his shoulders. “I didn’t design it,” he grumbled.</p>",
  "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">notes</a>.)\n</p>\n<p>yes i have been WAITING for this one. </p>\n<p>I try not to work on more than one multi-chap fic at a time and i had to finish landmarks, and then i had to write this dabi/hawks thing and then there was a new chap of you the moon due but FINALLY IT IS TIME FOR MORE QUIRKLESS DEKU</p>\n<p>i decided i needed to write a bkdk thing that a) wasn't fucked up emotionally and b) wasn't just porn because i wanted to try my hand at figuring out their dynamic and how they could work through their issues- and i decided it would be using my favorite au which is quirkless!supportclass!deku bc i LOVE it</p>\n<p>we're looking at around 7 chapters right now based on my outline!</p>\n<p> </p>\n<p> <a href=\"https://ohwickedsoul.tumblr.com/\" rel=\"nofollow\">you can find me on tumblr </a><br><a href=\"https://twitter.com/ohwickedsoul\" rel=\"nofollow\">and on also on twitter (18+ only please!)</a></p>\n<p> </p>\n<p>as always, your comments are the best thing about writing and really keep me going!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>hi kids!</p>\n<p>the response to this fic has been absolutely shocking and all i can say is thank you from the bottom of my heart!</p>\n<p>starting to get into the nitty gritty character stuff, and i think kirishima is really emotionally intelligent, because he himself put in the work pretty early on, what with the whole middle school development we had with him. best boy! bakugo is such a piece of fucking work lmao but we'll ge more into that in further chapters and WHY HE IS LIKE THAT.</p>\n<p>this is shaping up to be abouuuuut 8 chapters acc. to my outline, but it really depends on if i decide we need more talking about our feelings or not lmao.</p>\n<p> <a href=\"https://ohwickedsoul.tumblr.com/\" rel=\"nofollow\">you can find me on tumblr </a><br><a href=\"https://twitter.com/ohwickedsoul\" rel=\"nofollow\">and on also on twitter (18+ only please!)</a></p>\n<p> </p>\n<p>as always, your comments are the best thing about writing and really keep me going!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>hi kids!</p>\n<p>FUCKING HELL THIS WAS A PUSH TO WRITE. but it's here!! mostly on time!! let's do some ~character work~ amirite. </p>\n<p>some quick plugs: </p>\n<p> </p>\n<p> <a href=\"https://twitter.com/ohwickedsoul\" rel=\"nofollow\">you can find me on twitter (18+ only please) where</a></p>\n<p> </p>\n<p> <a href=\"https://twitter.com/ohwickedsoul/status/1268384625094688770\" rel=\"nofollow\">I currently have a poll open about the subject of my next one-shot</a></p>\n<p> </p>\n<p> <a href=\"https://ohwickedsoul.tumblr.com/\" rel=\"nofollow\">you can also find me on tumblr</a></p>\n<p> </p>\n<p> <a href=\"https://archiveofourown.org/works/23797033/chapters/57170461\" rel=\"nofollow\">and finally, i updated you the moon, which is a fantasy au that you might like!!</a></p>\n<p> </p>\n<p> stay safe, healthy, and smart out there. i hope this is a moment of respite for you. as always, your comments keep me writing and really make my day.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">notes</a>.)\n</p>\n<p>hi kids!</p>\n<p>long time no see! i've been having Bad Brain recently, only able to focus on IRL stuff so i can like. survive. though i woke up today and felt much much better so hopefully that's over for now. </p>\n<p>there's a couple of fun little references in this chapter i hope you enjoy, and the elbow thing is real- though not QUITE as cool as i'm imagining, tbh. but that's the nature of cool mecha anime stuff vs. real life progress, right? <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5660967/\" rel=\"nofollow\">it's from this NIH article which i enjoyed reading.</a></p>\n<p> <a href=\"https://youtu.be/5Rb9hAHifFA?t=177\" rel=\"nofollow\">i picture all the blueprints sort of like the first iron-man blueprints.</a></p>\n<p>the workshop is based off the sculpture department at my alma mater, lmao.</p>\n<p><a href=\"https://ohwickedsoul.tumblr.com/\" rel=\"nofollow\">as always, you can find me on tumblr</a> <a href=\"https://twitter.com/ohwickedsoul\" rel=\"nofollow\">and on twitter. (18+ only please!)</a></p>\n<p>your comments make my day and really keep me going, and i love every single one!</p>\n<p>stay safe, stay healthy, be good. love y'all.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">notes</a>.)\n</p>\n<p>hi kids!</p>\n<p>i'm not at all sorry that the chapter count keeps going up, because believe it or not there's like, a real plot beyond bakugo and deku talking about therapy and their feelings that i kind of want to get back to at some point. </p>\n<p>i feel so good for having gotten this to a place where i think these two idiots could maybe- possibly- perchance- get together and it wouldn't be a disaster. ugh. </p>\n<p>in more exciting news: landscape after cruelty is officially my first fic to hit one thousand kudos and i'm still blind sided by it. </p>\n<p> <a href=\"https://twitter.com/ohwickedsoul/status/1277750233582075904\" rel=\"nofollow\">to celebrate, i put a poll up on twitter to pick the next one shot i write! two are BNHA, two are Haikyuu. i hope you vote!!</a></p>\n<p> <a href=\"https://archiveofourown.org/works/24616045\" rel=\"nofollow\">the last poll i put up, without apology won and i do love that one to pieces.</a></p>\n<p> <a href=\"https://ohwickedsoul.tumblr.com/\" rel=\"nofollow\">you can find me on tumblr,</a>. <a href=\"https://twitter.com/ohwickedsoul\" rel=\"nofollow\">and also on twitter (18+ only, please!)</a></p>\n<p>as always, your comments are the best part of my day and really keep me going. be healthy, be safe, and be good.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">notes</a>.)\n</p>\n<p>hi kids!</p>\n<p>a delayed chapter, i know, but never fear! we're back to kicking 'em out. </p>\n<p>i actually managed to get plot in this chapter instead of just emotional healing. will wonders ever seize. i also threw in the inevitable reference (that i do in literally ever multi chapter i write) to my favorite joke in mha: MY QUIRK IS GUN. god damn. never gets old. </p>\n<p> </p>\n<p> <a href=\"https://twitter.com/ohwickedsoul\" rel=\"nofollow\">you can find me on twitter where i'm freaking out about haikyuu ending and writing weird threads. </a></p>\n<p> </p>\n<p> <a href=\"https://ohwickedsoul.tumblr.com/\" rel=\"nofollow\">and you can also find me on tumblr</a></p>\n<p> </p>\n<p>as always, your comments make my day and really keep me going. stay safe, stay healthy, and be good.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_7_endnotes\">notes</a>.)\n</p>\n<p>hi kids!!</p>\n<p>the nickname ripley for mina is a reference to alien, ofc. not a ton else to say about this chapter, other than i love shinsou and miruko and was happy to bring them in, however briefly. </p>\n<p>in an earlier chapter i mentioned a twitter poll to celebrate landscape getting 1k kudos, and i'm happy to say the one shot that won has finally been published, <a href=\"https://archiveofourown.org/works/25583548\" rel=\"nofollow\">and you can check it out here.</a></p>\n<p> </p>\n<p> <a href=\"https://twitter.com/ohwickedsoul\" rel=\"nofollow\">you can find me on twitter (18+)</a></p>\n<p> </p>\n<p> <a href=\"https://ohwickedsoul.tumblr.com/\" rel=\"nofollow\">and on tumblr</a></p>\n<p> </p>\n<p>as always, your comments really make my day and keep me writing. stay safe, stay healthy, and be good.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_8_endnotes\">notes</a>.)\n</p>\n<p>hi kids! </p>\n<p>we're back with a whole new chapter that includes a thousand words of me putting way too much thought into support hero items. most of these are based off real life innovation bc i am not terribly creative in terms of science engineering, so have some quick links:</p>\n<p> <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5660967/\" rel=\"nofollow\">the elasometric elbow brace i mentioned back in chapter four</a><br><a href=\"https://www.americanrifleman.org/articles/2016/4/11/10-ways-to-manage-recoil/\" rel=\"nofollow\">managing recoil for bakugo's bracers </a><br><a href=\"https://safelifedefense.com/body-armor-guide/#tab-con-5\" rel=\"nofollow\">nij levels of protection for body armort</a><br><a href=\"https://www.sciencemag.org/news/2017/11/fabric-can-give-you-your-own-personal-climate-control-system\" rel=\"nofollow\">article about the material todoroki's new suit is made of</a></p>\n<p>i can't believe this is the penultimate chapter of landscape!!!! really excited to see you guys the next go round when this'll be FINISHED.</p>\n<p> <a href=\"https://twitter.com/ohwickedsoul\" rel=\"nofollow\">you can find me on twitter, where i scream pretty much 24/7</a></p>\n<p> </p>\n<p> <a href=\"https://ohwickedsoul.tumblr.com/\" rel=\"nofollow\">and also on tumblr. </a></p>\n<p> </p>\n<p>as always, your comments really make my day and are the best part of writing. stay safe, stay healthy, be good.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_9_endnotes\">notes</a>.)\n</p>\n<p>hi kids.</p>\n<p>i can't believe we're done? i've been working on this fic since april, actually, tho i only started publishing in may. i'm almost sorry that this is the end, i'm gonna miss you guys going \"!!!\" in my inbox!!! though, of course, if you like this fic i welcome you to check out my other works. this is by far my most popular fic and i have always been shocked by the outpouring of love and support for it. </p>\n<p>i read every single comment i get on this but i do struggle to reply via ao3 sometimes, i'm much more active/conversational on both twitter and tumblr, and i encourage you to come talk to me there. </p>\n<p> <a href=\"https://twitter.com/ohwickedsoul\" rel=\"nofollow\">twitter</a><br><a href=\"https://ohwickedsoul.tumblr.com/\" rel=\"nofollow\">tumblr</a></p>\n<p>thank you so much, again, for coming on this journey with me! i would love to know what you thought. </p>\n<p>for the last time, as always: stay safe, stay healthy, be good. i'll see you soon.</p>",
  "text": "<p>“Dude, you really need to update your hero costume.”</p>\n<p>Bakugo gives a half-hearted snarl in response. He’s hunched over one of his bracers, trying and failing to pop one of the tiny screws out of one of the eight million plates it’s made of. He gives up with a half-muttered curse and sits back, catching himself on his hands. </p>\n<p>He glares up at Kirishima, who is still standing above him, hands on his hips. Kirishima doesn’t glare back at him. He never really does. Just gives a sad, disappointed shake of his head that is somehow a thousand times worse.</p>\n<p>“I fucking know,” Bakugo mutters eventually. “I just-” like every time, his reasons catch and die in his throat. </p>\n<p>“It’s okay if you want to keep the design!” Kirishima says, sort of but not really reading his expression. “That’s important, and you want to stay at least sort of consistent, you know? But it’s been almost two years since you had any sort of update.”</p>\n<p>“I <i>know</i>,” Bakugo says. It’s gritted out through clenched teeth. </p>\n<p>Kirishima frowns down at him, and then crouches on his haunches next to Bakugo. “What is it, bro? What’s so important that can’t be changed? Because I’ll be real with you, man,” he reaches out one hand and pokes a bracer gingerly. It wobbles, and he and Bakugo both stare as a stray spark suddenly floats out.</p>\n<p>“Those things are less and less reliable as the years go on,” Kirishima says, and his face is set in such a way that Bakugo knows he’s serious, and that means Bakugo should probably listen. Damnit. </p>\n<p>“And there’ve been crazy advances in body armor and other tech recently, and like, if you get hurt, you can’t do your job.” Kirishima claps a friendly hand onto Bakugo’s shoulder that nonetheless is a little like a boulder coming down. </p>\n<p>“The support class is killer, dude. There’s this one dude there- he’s got a literal waiting list, that’s how good he is- but he did my new upgrade, and even you thought it was sweet.” Okay, yes, Kirishima’s new costume was pretty good. He had these new gauntlets that-</p>\n<p>“Bakugo,” Kirishima interrupted his thoughts, a little exasperated. He had a small smile on his face however, as he said, “Seriously, this guy will change your life. You can’t tell me you won’t do something that’ll make you a better hero.”</p>\n<p>“Yeah,” Bakugo sighs and leans back on his hands, staring at the bracer. “I know. I’ll go,” his mouth twists a little. “I’ll go tomorrow. This is just- this is my design you know?” he’s not explaining himself very well, and refuses to look at Kirishima. </p>\n<p>“It can be hard to give up your first hero design, and you did a great job,” Kirishima said. “You definitely had the best one out of all of us when we first got our costumes.”</p>\n<p>Bakugo hunched his shoulders. “I didn’t design it,” he grumbled. </p>\n<p>Kirishima blinked. “Wait, what? But you came in with-”</p>\n<p>“And it wasn’t my fucking design, damnit,” Bakugo snarled. His shoulders are still up around his ears. “My- an old- god damnit, someone else designed it for me in middle school.”</p>\n<p>“Jeez,” Kirishima said. “That’s a hell of a design for a middle schooler.”</p>\n<p>“Yeah, and I-” Bakugo cuts himself off. </p>\n<p>“Can I ask-”</p>\n<p>“No,” Bakugo says, feeling his palms start to sweat. “No, you can’t. I don’t want to talk about it.” He pushes a hand through his hair, grimacing at how the thick, globby sweat pushes his hair up into crazier spikes.</p>\n<p>“Hey,” Kirishima says gently. “Do you still have the original plans?” Bakugo gives a short, frustrated nod. “Then bring those into the support department. Say you’d like to stick to those as closely as possible with new tech developments. They’ll work with you man,” Kirishima gives a short little laugh. “It’s literally their job.”</p>\n<p>“Yeah,” Bakugo says, thinking about four year old blueprints, worn soft by constant handling, the creases deep as valleys. “Okay. I’ll go.”</p>\n<p>Bakugo pulls the blueprints out again that night. It’s late- for him- and the lamp in the corner of his room makes the room warm and gold, with long shadows for things to hide in. Bakugo wants to be one of those things, for a split second. </p>\n<p>But that’s not hero behavior, that’s not number one behavior, and so Bakugo grits his teeth and pulls out a cardboard tube used to store posters. He bought it sometime early in his first year, after a tear began to wear in one of the creases from constant refolding. </p>\n<p>He pulls the blue prints out gently, sheets and sheets of thin, translucent paper, covered in scratchy, near schizophrenic writing, like the author couldn’t contain themselves. </p>\n<p>As sheet after sheet settles on top of the other, a clear, comprehensive guide to Bakugo’s current hero costume builds. </p>\n<p>There’s a comically angry glare where the eyes are, but a wide smile with too many sharp teeth doodled underneath it. Bakugo meets the drawing’s gaze with an scowl of his own. Even as he stomach roils at the thought of showing the plans to someone else- anyone else- his hands stay gentle, tucked inside latex gloves to protect the plans from stray nitroglycerin. </p>\n<p>He lays the last sheet on top, and stands back. Grenade bracers, steel knee pads, thick soled boots. It’s good. It’s really good. </p>\n<p>But Bakugo’s older now, less than a year out from graduation and the real world, and he’s got the experience and the critical eye of a near pro, and even he can admit to himself- but only himself- that it can be improved upon. </p>\n<p>The bracers are too big, unwieldy in small urban spaces that most heroes work in. The gloves don’t have quite enough padding or cover the knuckles in a way that he’d prefer. His shoulders are bare and unprotected, as is his back. The mask is just…</p>\n<p>Bakugo’s face twists. The mask is something a middle school boy would draw, thinking it was the coolest thing ever. </p>\n<p>Bakugo lets out a tiny, quiet sigh he would deny to his dying day. His hand hovers over the afterthought of a signature, scrawled onto the lower right corner of the top most page. </p>\n<p>Even with gloves on, his fingers don’t dare touch the characters that make up Izuku Midoriya’s name.</p>\n<p>Bakugo gets up at six the next morning and goes for a six mile run. As the distance peels away, he keeps his focus on his breathing and on the slowly growing burn in his legs, and not on the fact that today he has to go to the support department. </p>\n<p>He brushes even the thought of the thought away and pushes hard through his last mile, finally slowing to a walk and panting. The sun is limming everything a pale gold of early morning, and the grass is damp. </p>\n<p>Bakugo rolls his shoulders and heads inside. </p>\n<p>The support department workshop opens up at seven thirty, but it’s a Saturday. So there really should be no one there. This thought is not Bakugo trying to hide or get out of his promise to Kirishima. Absolutely not. </p>\n<p>He’s going to the support department to give them his plans and talk to Kirishima’s wonder guy- who, fucking hell, never told him the dude’s name. Great.</p>\n<p>So Bakugo’s pissed off, hair still damp from a shower, as he walks across campus in the quiet of still early morning. His left hand is popping a little, sparks showering the concrete as his fingers twitch. His right is clothed in a heavier duty work glove, and it carries the cardboard tube with the blueprints secured safely away. </p>\n<p>When he enters the building, it’s a ghost town, no one in sight. There’s a faint sizzling sound deep in the building however, and Bakkugo frowns. It sounds like bacon? Maybe someone is cooking? </p>\n<p>He’s made it to the main workshop, however, the one that only the third years can use, and the sizzling sound he can hear is now punctuated by small pops. Great. What freak is up and working at seven thirty on a Saturday morning?</p>\n<p>Bakugo ignores the fact that he is preparing to go see said freak at seven thirty am on a Saturday.</p>\n<p>He shoves the door open with his shoulder, not wanting to get nitroglycerin on the door. It’d probably explode with some support class idiot tried something out if he did. </p>\n<p>There’s only one person in the workshop- it’s clean and bright and expansive, wide metal tables in the center and tools and machines crowding the edges. </p>\n<p>The only guy in there- and it is a guy, based on the frankly amazing arms he’s got. Who knew the support class was built like that? Like a fucking blacksmith. </p>\n<p>He’s bent over, welding something, curly hair almost black with sweat still managing to escape from behind the full face mask. He’s got gloves up just past his elbows, but the rest of his arms and shoulders are exposed by the tight black tank top.</p>\n<p>Bakugo wipes his dripping hand on a handkerchief, scowling. He’s pretty sure his face is red. He came here to hopefully not find anyone, not to fucking ogle some built engineer. </p>\n<p>“Hey,” he says, and thank god his voice doesn’t crack like he’s some pubescent teenager. “I’m looking for the guy who made Kirishima Eijorou’s hero costume.”</p>\n<p>“That’s me,” the guy says, not looking up, voice muffled from the mask. “One sec.”</p>\n<p>Oh, fucking great. First try too. Bakugo sighs, leans against the doorframe, scowling at the welder as he finishes up a bead on...whatever’s he’s working on. </p>\n<p>The dude flicks his torch off, puts it to the side, and stretches his arms above his head. Bakugo has to avert his eyes away from the sight of his shoulders bunching up under his tank top. “Right,” the engineer says, turning towards Bakugo and shoving his mask up on top of his head, “what can I-”</p>\n<p>He freezes. </p>\n<p>So does Bakugo. </p>\n<p>The mask pushes the dark curls out of his face, where it’s red and sweating from the heat. The face beneath the mask has very green eyes, and is scattered with freckles, concentrated on the nose and high tips of his cheekbones.</p>\n<p>It’s also the face of a very cute, very surprised Izuku Midoriya.</p>\n<p>“No fucking way,” Bakugo blurts out, eyes wide.</p>\n<p>Midoriya looks back up at him with some undefinable emotion on his face. There’s shock, yeah, but it’s not as overwhelming at Bakugo would’ve expected. His mouth is a little open, eyebrows drawn together, and his eyes-</p>\n<p>Midoriya looks like he’s just been punched in the gut, like he can’t breathe. </p>\n<p>Then he swallows, and his shoulders straighten, and it all washes off his face like nothing, and now Bakugo is the one who can’t breathe. </p>\n<p>“It’s been a while,” Midoriya says, and his voice is wary, mouth pressed tight. </p>\n<p>“What are you doing here?” Bakugo asks, still bewildered, past the tightness in his throat rising up. </p>\n<p>“I go here,” Midoriya’s eyes narrow, like he’s expecting a fight and is- willing? To fight Bakugo? What-</p>\n<p>“Since when?” Bakugo says, and he can’t seem to conjure the usual anger, the so familiar scowl that feels like he can’t get rid of sometimes. Because he’s just staring at Midoriya with an open, blank expression, because-</p>\n<p>Fuck, he can barely get his thoughts together, because, what the fuck is Deku <i>doing</i> here? </p>\n<p>There’s also the fact, a voice traitorously whispers in the back of his head, insidious and somehow heard over the loud screaming of <i>what the fuck</i> is that, well, Deku still looks like Deku, still freckled and green and lamb headed, but he also looks like-</p>\n<p>Well, he looks older than the image of a thirteen year old boy that Bakugo had kept wrapped up in his head, guarded like a dragon with a treasure, a secret, shameful thing that he allowed himself to think about only sometimes, when hero training went poorly or he couldn’t get his rescue exercises finished perfectly. </p>\n<p>His round face has slimmed out somewhat, mouth wider and he’s shot up in height- not by a lot, not close to Bakugo’s insane growth spurt these past few months, but enough. And he’s built now, like he does manual labor ever day, like he’s worked for it, not just spent time in the gym. </p>\n<p>What Bakugo really keeps catching on, however, are the scars. Deku is <i>littered</i> with them. Shiny burn marks on his forearms, a spatter of little pink dots on his collarbone like he caught sparks, a nasty bit of mangled scar tissue on his elbow, but his hands are the worst. They’re coated in them, little burns and old cuts and white marks of paper thin slices, but they don’t take away from the fact that his hands are as long and fine-boned as ever.</p>\n<p>Despite the new acquisitions, they’re the thing that is still the most, well, Deku.</p>\n<p>“I transferred in last year, from Hapes High in Tokyo.” Deku’s watching Bakugo warily, and he hasn’t bothered to pull the welding mask off the top of his head, though he pulled off his gloves as soon as he possibly could. </p>\n<p>“I didn’t know you went to Tokyo,” is all Bakugo could think to say.</p>\n<p>He didn’t know anything. After the- after the incident, Bakugo didn’t know what happened to Deku. Didn’t know a goddamn thing. Wasn’t allowed to know. </p>\n<p>Deku doesn’t even fucking acknoledge this, just gives him a shrug. “I did a year there, then transferred into UA. Support department.”</p>\n<p>“Fucking a,” Bakugo says. </p>\n<p>Deku gives him a concerned look, some of the color back in his face now. “Do you- do you need to sit down?”</p>\n<p>“Fuck off,” Bakugo snaps, though he’s locking his knees pretty hard so they don’t tremble. “I don’t need your fucking help.”</p>\n<p>There’s a pause, and then Deku’s face curls into a slow grin. It’s a very different expression than Bakugo remembers, and there’s a lot of white teeth in that mean little smile. “I beg to differ,” Deku says. “You came in here looking for the guy who did Eijirou’s costume.” Deku spreads his arms wide, and Bakugo’s eyes dart over them, the muscled, scarred expanse. Who the fuck <i>is</i> this guy? “You found him.”</p>\n<p>“Fuck no,” Bakugo says without thinking.</p>\n<p>Deku’s hands drop. “Too good for my designs now?” he says, and Bakugo’s blood runs cold in his veins. </p>\n<p>There’s no way Deku could know that Bakugo was still using- still wearing- the design he had made up for him in the beginning of middle school. It wasn’t possible. </p>\n<p>“Let me see what you’re working with now, and we’ll take a look,” Deku’s saying. “Do you have your current design with you?”</p>\n<p>Bakugo panics.</p>\n<p>“Fuck no,” he snarls again, taking a half step backward. His hand tightens hard around the poster tube, instinctual. “You think I want your designs, shitty Deku?” he hears himself say it as though from very far away. </p>\n<p>“My designs got me into UA,” Deku says, eyes narrowed.</p>\n<p>“As a transfer,” Bakugo sneers.</p>\n<p>“You came in looking for me!” Deku says, exasperated. He reaches up like he’s going to run his hands through his hair and hits the mask. He makes a small, frustrated growl and grabs the mask and tosses it on the table. It makes a loud, clanging sound in the still empty workshop. “You literally asked for the guy who made Eijirou’s costume!”</p>\n<p>“And who are you to call Kirishima by his given name, hah?” Bakugo yells. “I don’t want your fucking designs, you shitty-”</p>\n<p>“Get the hell out of my workshop,” Deku snaps, sudden and furious. </p>\n<p>Bakugo takes another half step backward. Deku is- mad? “What?” he says, dumbly.</p>\n<p>“Get the fuck out!” Deku says, louder now. “I won’t stand for this kind of thing in here. I won’t. <i>Leave</i>.”</p>\n<p>Bakugo makes an inarticulate sound of rage, spins on his heel, and does what he’s told.</p>\n<p>He hears the heavy door of the workshop slam behind him, and manages to make it around the corner before his elbows are on his knees and he’s having to take huge, heaving breaths of air. His thoughts flit around wildly, bang around into each other, spark off and die like shooting stars. </p>\n<p>What the fuck. What the fuck. What the fuck.</p>\n<p>“You did <i>what</i>?” Kirishima sounds horrified, staring at Bakugo with wide eyes. His face is almost as white as the little gnarled scar bisecting his eyebrow.</p>\n<p>“I’m not fucking working with him,” Bakugo snaps, hunching over his insurance homework. Fucking hell, the extra class of how to deal with and fill out damage insurance is probably one of the only downsides of his quirk. </p>\n<p>“No, dude, shut up and listen to me for a second,” Kirishima says, a little frantic. </p>\n<p>Bakugo looks up and frowns more deeply. Kirishima actually sounds horrified, his hands twisting together in a way that Bakugo doesn’t see him do often. “What?” he says begrudgingly. </p>\n<p>“Midoriya is like…” Kirishima waves his hands a little as he tries to find words. “He’s really popular?” It sounds like a question.</p>\n<p>“He’s fucking what.” Bakugo says flatly.</p>\n<p>“I’m kind of surprised you haven’t heard or run into him?” Kirshima says. “Like, I know you’re sort of introverted and shy-”</p>\n<p>“I’m not fucking shy!” Bakugo barks, slightly ruined by the way his voice almost cracks at the last word.</p>\n<p>Kirishima waves off that remark. “Well, you don’t really talk to anybody but the teachers and me and Uraraka and Sero,” he says.</p>\n<p>“That’s like four people,” Bakugo frowns. “That’s plenty.”</p>\n<p>Kirshima looks like he might start to tear his hair out, if it weren’t gelled into perfectly straight spikes. “Bakugo,” he says, nearly begging. “You are introverted. That’s okay. What’s not is being so, so, god, <i>pig-headed</i> that you got the number one support department engineer to ban you from the third year workshop!”</p>\n<p>“He’s number one?” Bakugo lasers in on that. </p>\n<p>Kirishima might cry. “Bakugo, he has had so many offers from different companies already, he has a waiting list a mile long that I had to do some questionable things to get you bumped to the top, he’s one of the most popular people in this whole <i>school</i>.” </p>\n<p>Bakugo’s still stuck on the number one comment. Deku, number one? It makes Bakugo’s stomach twist uncomfortably, because, despite his work ethic and his perfect quirk and his intelligence, he still trades placements with fucking Icy-hot constantly. Not to mention Ponytail, Bird-guy, and Uraraka as constant dogs nipping at his heels. But Deku is already number one, so much so that someone outside his department says it like it’s fact.</p>\n<p>Kirishima rubs at his scar a little. “Dude, you just committed like, social suicide.”</p>\n<p>“Whatever,” Bakugo grumbles, turning back to his fake paperwork.</p>\n<p>“Not whatever, dude!” Kirishima’s voice is shrill. “How are you gonna get a new costume now?”</p>\n<p>“I’ll ask someone else, fucking hell,” Bakugo says, and marks in a number with a little too much force.</p>\n<p>“You’re not gonna be able to get anyone else,” Kirishima says. “They’re gonna close ranks like no one’s business.”</p>\n<p>Bakugo looks up and glares at him from under drawn together eyebrows, doesn’t say a word.</p>\n<p>Kirishima stands up, sighs, puts his hands on his hips. “What the hell’s your problem with this guy, anyway? Midoriya’s really nice, and he’s number one for a reason, you know. He knows his stuff.”</p>\n<p>“None of your fucking business,” Bakugo snaps.</p>\n<p>Kirishima lets out another sigh, picks up his bag. “Bakugo, I love you dude, and I think you’re super manly with your drive to be the best and push yourself so hard.” Kirishima pauses for a second. “But like. Your interactions here matter, you know? All of these guys are gonna be people you have to work with in the future.”</p>\n<p>“Like, all the people in our class are gonna be heroes we’ll have to collaborate with. You can’t take down every villain by yourself, you know? And Best Jeanist likes you enough that we all know you’re gonna get an offer from him after we graduate but you’ll still just be a sidekick helping out more experienced heroes. And you need gear, and you’ll need a PR manager and maybe an agent and eventually you might want a sidekick of your own, and you’ll have to work with somebody just like us now.” </p>\n<p>Bakugo’s hand is tight around his pencil, the other under the table, nearly dripping with nitro-sweat. Kirishima takes a deep breath, like he had to get that speech out in one breath before he lost his nerve. </p>\n<p>Bakugo stays silent, staring at the boxes on his paper. His vision blurs as he doesn’t blink. </p>\n<p>“I just- I don’t understand why you want to be a hero sometimes. Because I can’t explain to you why you should care about other people.” Kirishima shoulders his bag, gives Bakugo a half-smile he doesn’t see, and leaves the library.</p>\n<p>Bakugo stays bent over his table, staring at nothing, for a long, long time.</p>\n<p>Bakugo will never, ever tell Kirishima this. </p>\n<p>But Kirishima...might be right. </p>\n<p>About the support department thing. The other stuff Bakugo has shoved into a box that is labeled “Do Not Even Think About Thinking About This” and has been duct taped shut. With padlocks. And fire surrounding it. </p>\n<p>When his request for bracer repair comes back, it’s only been half-fixed. It’s a sloppy, lazy job, and he nearly blows the whole thing to smithereens in a training exercise. Bakugo rages for a while, then grits his teeth and submits another one.</p>\n<p>This one, apparently, gets lost. </p>\n<p>He submits a third, but there’s a training exercise with Shiketsu coming up next month, and he’ll be damned if fucking <i>Camie</i> of all people is able to look down at him. He needs, if not an whole ass upgrade, at least his fucking bracers fixed. </p>\n<p>And, well. </p>\n<p>The things, the box that he’s got in his head, the box of things he can’t think about. It’s been fucking leaking, and it won’t stop, and even when Bakugo manages to fall asleep easily he’s up hours later, staring at the dark grey ceiling, moonlight splashing across the room. </p>\n<p>Bakugo knows he’s not...good with people. He’s never had to be. He could bulldoze his way into anything, into UA, into one of the top spots of the hero course because he’s fucking smart, and determined, and has a great fucking quirk. </p>\n<p>He’s always had a great quirk. Everyone’s always told him that. He’s always been the best, ever since he was four and his palms started to spark. A quirk for a hero. </p>\n<p>And being a hero was great, right? It was the only job someone like Bakugo <i>could</i> do. They were in the top echelon of society, loved by all, and they were necessary. Needed. Bakugo could be needed. </p>\n<p>Bakugo was needed. And that was the thing, because Bakugo had always been told he was the best, and he was going to be a great hero, and that he was needed, and so Bakugo had done whatever it fucking took to make sure that came through. Because if he wasn’t what everyone said he was, then who the fuck was he? </p>\n<p>Light moves slow across his room, shadows deep, and Bakugo’s eyes are dry with lack of sleep.</p>\n<p>Quirks were what made people great, gave people purpose, and Bakugo had always thought- that was the whole problem with fucking <i>Deku</i>. Quirkless, useless, and never had the good sense to fucking know it. </p>\n<p>But that was the other thing. Bakugo pressed his palms to his eyes with a quiet groan that still managed to echo in the silent room. </p>\n<p>Deku wasn’t useless. Had done a better fucking job on Bakugo’s hero costume at fourteen than second year UA students. Was now the top fucking student in the support course, was <i>number one</i>, without a quirk to help him. </p>\n<p>How the fuck did Deku know what to <i>do</i>, without a quirk or a platoon of people telling him what he was born for, what he had to do or he’d be a-</p>\n<p>Bakugo sat upright in bed, swung his legs out. He had to move, had to quit this line of thought before the box threatened to overflow it’s slowly weakening walls all together. </p>\n<p>When he flicked on the light of the bathroom, his lips are pale and his eyes are red-rimmed. He stares at himself, barely recognizing his own reflection. </p>\n<p>He’s graduating in less than a year. He’ll have to be out there, like Kirishima says, working with other people and interacting with the public and god damnit, Kirishima was fucking right. He watches his mouth twist in the mirror as it hits him, and the box fucking <i>collapses</i>. </p>\n<p>Because, god damnit. Kirishima was right, and Bakugo doesn’t know who he is without a quirk, not like Deku’s unshakeable sense of self, and he hates himself for it, and Deku too. It’s all his fault, and it always comes back to him, and no matter what the fuck he does he will never get him out of his head. </p>\n<p>Deku’s had real estate in this box for far too fucking long. </p>\n<p>Bakugo’s not an idiot. He’s angry and insecure and desperate sometimes, but like. He gets why he can’t fucking deal with Deku, the literal embodiment of everything Bakugo has ever been insecure about. He can also understand a lot of it has to do with guilt, the thing in the deepest layers of the box. </p>\n<p>He can remember being at an ethics course sometime freshman year, and just sinking lower and lower in his seat with every passing minute, his stomach roiling and mouth pressed tight. It’s just so fucking hard, and he’s so angry all the <i>time</i> and-</p>\n<p>It just turns out that that’s no longer a strategy he can rely on. </p>\n<p>Bakugo takes a long, slow deep breath, resists the urge to punch his pallid reflection in the face, and flicks off the light in the bathroom. Heads back to his room. His phone lights up his little corner, friendly and bright, and he types a short message before flicking it on do not disturb and shoving it under his pillow. </p>\n<p>Sleep doesn’t come easy, but it does come.</p>\n<p>\n<b>To: Shitty Hair</b>\n</p>\n<p>Shoot me the fucking number of the lady you were talking about.<br>\n<i>2:45am</i></p>\n<p>\n<b>From: Shitty Hair</b>\n</p>\n<p>Bro!!!</p>\n<p>Yes!!!</p>\n<p>TTLY SUPPORT U IN THIS JOURNEY IM PROUD OF U BOR</p>\n<p>***BRO<br>\n<i>6:39am</i></p>\n<p>\n<b>To: Shitty Hair</b>\n</p>\n<p>Fucking whatever.<br>\n<i>7:15am</i></p>\n<p>\n<b>From: Shitty Hair</b>\n</p>\n<p>[Contact: Nakamura Aoi, LCSW]<br>\n<i>7:17am</i></p>\n<p>Bakugo slinks into the support department early on another Saturday morning. It’s been about three weeks since his disastrous first outing, and he’s not keen to have any more people witness it if he gets kicked out again. </p>\n<p>His steps don’t slow as he approaches the heavy metal door of the third year’s workshop, but they sure as hell want to. But he’s Bakugo fucking Katsuki, and that means powering through whatever the fuck is going on, through sheer arrogance and a desperation to not fail if anything else, so he pushes open the metal doors while his gut screams at him in protest and his palms nearly drip with sweat. </p>\n<p>Deku’s in there, like the fucking nerd he is. He’s wearing a real shirt this time, however, and his hair’s being held back by a tie, long curly hair into a too-small bun. It looks dumb. </p>\n<p>Todoroki is also in there, taller than Deku by quite a lot- and taller than Bakugo too, not that that fucking <i>matters</i>- and the look on his face is. </p>\n<p>Well. It’s a neutral face. Bakugo’s not sure Todoroki has any expressions other than “neutral, coldly furious, and vague concern for others intelligence.” But this is soft around the eyes and the mouth, like he’s been...smiling? Which is a cause for concern in itself. </p>\n<p>Todoroki looks up when he enters, and any softening tightens back up immediately, and he gives Bakugo a cold look. </p>\n<p>“Bakugo,” he says with a nod. </p>\n<p>“Half and half,” Bakugo says, and he doesn’t growl it. That’s progress, right? It actually makes Todoroki’s expression move a tick towards the coldly furious, and that’s a victory in itself. </p>\n<p>But also. Fucking <i>Todoroki</i> gets his gear from Deku? </p>\n<p>If Bakugo needed another reason, or, fuck, any reason at all, to make amends, it’s standing right in front of him. Fucking icy-hot bastard, the bane of Bakugo’s entire existence. He’s been swapping ranks with Todoroki since the very beginning, and his gear recently has been more suited to him, actually fucking useful. </p>\n<p>“What are you doing here?” Deku asks, and he’s glaring a little at Bakugo, and well. It’s kind of adorable, the way he thinks he can intimidate <i>Bakugo</i>, with his dumb little bun and freckles. But the angry slant of his eyebrows and the way he crosses arms built with muscle from hauling equipment and metal around do help the image. </p>\n<p>Todoroki’s expression slides towards the other end of the scale: vague concern. “What is happening.” he says flatly. </p>\n<p><i>This</i> is the guy Bakugo fights for the number one spot? Jesus Christ. </p>\n<p>Deku turns that glare on Todoroki now, which apparently has much more of an effect. Todoroki’s eyebrow almost moves. “Shouto, I will see you in three days, don’t break any of my shit. Get out.”</p>\n<p>Todoroki’s eyebrow does tick up at that, and Bakugo makes a noise in his throat without meaning to. </p>\n<p>Because, well, damn. That was a real life facial expression, but also, <i>Shouto</i>?</p>\n<p>Todoroki gives one of those polite little nods, face smoothing back out, and then manages to shoulder past Bakugo like he didn't even realize he was even in the doorway. Fucking bastard. </p>\n<p>Bakugo still hasn’t really said a word, and Deku is just standing there, arms crossed and doing something Bakugo doesn’t really want to call pouting. </p>\n<p>“I banned you from my workshop,” Deku says. </p>\n<p>“I know,” Bakugo says, and swallows. </p>\n<p>He and Nakamura have had a few phone calls, and this was one of the things they had really talked about. Well. Bakugo had yelled, for a while, and then Nakamura’s voice, firm and like silk wrapped in steel, had shut him up and made him talk about why he was yelling, and then why he felt better yelling, why he didn’t want to talk about-</p>\n<p>Anyway. </p>\n<p>Bakugo takes a deep breath. </p>\n<p>“I’m sorry.”</p>\n<p>Bakugo can literally see the shock hit Deku’s face. His mouth drops open as his eyebrows shoot up, and he looks like he just got sucker punched. </p>\n<p>“You’re fucking what?” Deku says, voice shooting up an octave, and. Huh. Deku can swear now. Bakugo shoots him a glare under lowered eyebrows. </p>\n<p>“You heard me.” it comes out angry, but fuck it. He is angry. He fucking apologized. </p>\n<p>“Say it again,” Deku commands, and there’s something twitching at the corners of his mouth. </p>\n<p>“Fuck you,” Bakugo spits. </p>\n<p>Deku raises an eyebrow, and then looks pointedly at the door. Bakugo wants to slam his fist into his smug ass freckled face, but then looks at the curling blueprints on the table, looks at Todoroki’s belt laying splayed open on the table, like some weirdly blooming flower. </p>\n<p>“I’m fucking sorry, okay?” Bakugo hunches his shoulders forward when he says it, and his stomach hurts the way it always does when he has to think about this shit. </p>\n<p>He had thrown up after Nakamura’s first phone call. </p>\n<p>He’s still watching Deku when he says it, however, and he gets to see Deku fucking <i>glow</i>. Like light up from the inside. It shouldn’t be possible for a person to do that, and Bakugo wonders for a split second if they fucked up all those years ago and that maybe this is Deku’s quirk. </p>\n<p>“I’ve been waiting for you to come in,” Deku says, and fuck if his eyes aren’t green as hell, <i>happy</i>. </p>\n<p>Deku leans forward onto the blueprints, propping his forearms on his elbows. It makes him even shorter than Bakugo, makes him look at Bakugo through his eyelashes when he says, “I’ve been working on your costume for <i>years</i>, Kacchan.”</p>\n<p>Bakugo’s heartbeat stutters, and he thinks, </p>\n<p>Oh, <i>fuck</i></p>\n<p>\"You what?\" Bakugo says, and even he can't control how fucking dazed his voice sounds. Jesus christ. Sounds like he got hit by a fucking two by four, and honestly, he feels like it. </p>\n<p>Deku's just- bright, and happy, and he's been <i>working on his costume</i>. Still. Even now. Even after-</p>\n<p>\"Well, yeah,\" Deku says, a pink flush alighting on the tops of freckled cheekbones. \"I mean, it's- whatever.\" he bites his lip for a second, just a brief press of white teeth, and Bakugo swallows. What the <i>fuck</i>. \"Can I see your costume now? We can start with that and then take a look at how my improvements-\" </p>\n<p>Bakugo panics. </p>\n<p>\"No!\" he says. Deku's eyebrows go up. Bakugo flails. Mentally. Mentally! \"Let me see what you've been working on for so many years. My old costume isn't- I'd rather start fresh.\"</p>\n<p>\"No preconceptions, right,\" Deku said, nodding like the words that just came out of Bakugo's mouth made any goddamn sense. \"That makes sense, I wouldn't want to be influenced by another designer.\"</p>\n<p>Bakugo pressed his mouth together and sent up a silent prayer. <i>Or influenced by your fucking twelve year old self.</i> \"Exactly,\" he said, hoping he sounded sage and not just anxious. </p>\n<p>\"Right,\" Deku stood up straight and clapped his hand like some sort of kindergartner. \"I'll go look for my notebook, take some measurements, and we can talk for a bit about needs vs wants, kay?\"</p>\n<p>\"Whatever,\" Bakugo grunted, desperately trying to wrestle his still pounding heartbeat under control. </p>\n<p>Deku flashed him something that Bakugo categorically refused to call a smirk, and disappeared further into the depths of the workshop. Bakugo let out a near silent breath and slumped- just a little- against the heavy metal table. </p>\n<p>Fucking hell. This whole thing was set up to be a god damn trainwreck. Fuck Eijirou. Fuck Nakamura. Fuck <i>Todoroki</i>. He glared at the belt, splayed open like a carcass, like he could set it on fire with his gaze alone. </p>\n<p>Bakugo chews on his lip. His stomach is still roiling, only now starting to settle, but this whole ordeal isn't as bad as he thought it would be. He's getting a new costume. Deku let him back in the workshop. Deku-</p>\n<p>He doesn't want to say Deku forgave him, because Bakugo doesn't think he did or fucking should, really. But-</p>\n<p>Bakugo wants to know where the hell he'd been. Wants to know what the year at Hapes in Tokyo was like. Wants to know how the hell Deku slipped under the radar their second year, when apparently they'd been going to the same fucking school and Bakugo had no idea. Wants to know how he and Todoroki met, wants to know when everyone else figured out that Deku was way fucking smarter than he-</p>\n<p>\"Okay!\" Deku chirps, popping up behind him and <i>not</i> startling him, fuck. \"Found my stuff.\" he hefts a stack of what look like five or fourteen fucking notebooks in his arms. \"These go back years,\" he says fondly.</p>\n<p>\"Yeah, I fucking remember,\" Bakugo snorts without thinking, and then freezes. So does Deku, but it only lasts a split second before he huffs out a soft laugh.</p>\n<p>\"Yeah, I bet you do,\" Deku says, but the brightness of his smile has ticked down a couple notches, become smaller, a little sad around the edges. He blinks and it's like the lights turn back on, because he lifts his head and says, \"Okay! Let's get your measurements! Take off your clothes.\"</p>\n<p>\"What?\" Bakugo's voice doesn't go high. It doesn't.</p>\n<p>Deku doesn't seem to even notice his discomfiture, the bastard. Though the tips of his ears are kind of red. \"At least your jacket and shoes,\" he says. \"Though I'd be able to get more accurate measurements if your shorts were off too.\" He nods at Bakugo's legs. \"I can see you're wearing leggings.\"</p>\n<p>It's not….inaccurate. Bakugo's dressed in leggings- to keep his fucking hamstrings warm so he doesn't pull a muscle again, fuck you, with basketball shorts over top, a tank top, and a bulky, zip up hoodie. </p>\n<p>So he dressed for comfort. And so he could hide his hands in his pockets. What the fuck ever. </p>\n<p>He also knows it really is necessary if he wants his shit to fit right, like visiting a tailor for a suit, though infinitely more important. His stupid designer parents had lectured him about measurements more times than he could fucking think. </p>\n<p>\"Fine,\" Bakugo says, rolling his eyes, hoping his face isn't as red as it feels. </p>\n<p>He unzips his jacket first, folding it neatly and placing it on the table, then toes his sneakers off one by one. Hooks his thumbs into the waistband of his shorts and pulls, bending over to free his foot from the leg hole.</p>\n<p>He folds this just as neatly, on top of his sweatshirt, then turns back to Deku. Deku is turned away from him, rummaging for something under a table. \"Right!\" and his voice is high as Bakugo's was now. </p>\n<p>His face is as red, too. </p>\n<p>\"Stand on this,\" he says, and slides a short step stool over to Bakugo. Bakugo tsks, and steps onto the small platform. </p>\n<p>It gives him almost a foot of extra height on Deku, and he can look down and see how red the tips of his ears are, poking out from beneath green curls. \"You let your hair grow out,\" Bakugo doesn't realize he said out loud for a brief moment till Deku pauses with the tape measure in hand. </p>\n<p>\"Oh,\" Deku says, and tucks a stray curl back behind his ear. Most of it is still tucked back into that dinky little bun, but a few tendrils have come loose around his face. Down, it's probably a couple inches past his chin. \"Yeah, I did.\"</p>\n<p>\"It's...curlier.\" Bakugo wants to kick himself. What the fuck is he saying? He wouldn't call himself a fucking master conversationalist- most people are too fucking useless to have conversations with- but he's at least not usually an idiot.</p>\n<p>\"Oh, yeah!\" Deku brightens up at this for some fucking reason. \"Yeah, when I started growing it out it became less 'untameable fuzz' and more real curls, you know? So I just kept letting it, and people said it suited me, and it's kind of pain now at this length, but once it's long enough for me to like, braid back and put into real ponytails and stuff, it'll be better, you know?\"</p>\n<p>Bakugo lets more of this vaguely inane chatter wash over him and relaxes, something in between his shoulder blades going soft. It reminds him of when they were kids, when Deku would get on some tangent or another and go for hours if Bakugo didn't change the subject or shove his own opinion in there somewhere. </p>\n<p>When Deku grabs his wrist he startles, just a little. But he just holds it out to the side, barely pauses his rambling to say, \"hold your am out, please,\" and then goes back into talking about- keratin, maybe? Whatever. </p>\n<p>It's difficult to concentrate when Deku's face is focused, when his fingers barely skate the tape along the underside of his arm, and then around his wrist, around his bicep, the curve of his collarbone. </p>\n<p>Bakugo can barely breathe with it, not expecting it to be this- like this. Whatever this is. </p>\n<p>Deku drops to his knees suddenly, starts running the tape up the outside of his leg, and Bakugo struggles not to choke on his own spit. </p>\n<p>\"You got tall, huh, Kacchan?\" Deku says cheerfully, and Bakugo looks down, at his open, freckled face on his knees in front of him, abruptly remembers he's only wearing thin compression leggings, and immediately looks up at the ceiling. </p>\n<p>\"Yeah,\" he grinds out in a voice that sounds like fucking rocks. \"Growth spurt last year.\" </p>\n<p>Bakugo feels Deku's hand run up to measure his inseam, light and sure and professional, god damnit, he's being professional, and starts silently reciting hero rankings in his head. </p>\n<p>What the <i>fuck</i>.</p>\n<p>Bakugo makes it all the way to number 222 (Normal Hero: Manual) before his torture is ended and Deku sends him off, telling him to come back in a few days and they can start looking at sketches. </p>\n<p>Bakugo collapses on his bed, texts Kirishima that everything wrong in the world is his fucking fault, and buries his face into a pillow and screams. </p>\n<p> </p>\n<p>\n<b>\nFrom: Shitty Hair</b>\n</p>\n<p>Bro why :-((( </p>\n<p>ididnt know sero ate ur protein bars bro :-((</p>\n<p> <i>5:39pm</i></p>\n<p>\n<b>To: Shitty Hair</b>\n</p>\n<p>Sero did what</p>\n<p>\n<i>6:15pm</i>\n</p>\n<p>\n<b>From: Shitty Hair</b>\n</p>\n<p>What</p>\n<p>Nothing</p>\n<p>Wat did i do ;-((((</p>\n<p>\n<i>6:17pm</i>\n</p>\n<p>\n<b>To: Shitty Hair</b>\n</p>\n<p>I went and saw Deku.</p>\n<p>\n<i>6:22pm</i>\n</p>\n<p>\n<b>From: Shitty Hair</b>\n</p>\n<p>BRO!!</p>\n<p>HOW DID IT GO</p>\n<p>OH NO DID IT GO BAD</p>\n<p>BRO</p>\n<p>BRO WHAT HAPPEND</p>\n<p> <i> 6:39pm</i></p>\n<p>\n<b>To: Shitty Hair<b></b></b>\n</p>\n<p>\n<b>\n<b></b>\n</b>\n</p>\n<p>\n<b></b>\n</p>\n<p>He's making my costume.</p>\n<p>\n<i>6:40pm</i>\n</p>\n<p>\n<b>From: Shitty Hair</b>\n</p>\n<p>BRO</p>\n<p>FUCK YEAH</p>\n<p>THAT'S SO GREAT</p>\n<p>WAIT WHY AM I THE WORST THEN</p>\n<p>&gt;</p>\n<p>\n<i>6:42pm<i></i></i>\n</p>\n<p>\n<i>\n<i></i>\n</i>\n</p>\n<p>\n<i>\n<i></i>\n</i>\n</p>\n<p>\n<b>To: Shitty Hair</b>\n</p>\n<p>He's making my COSTUME, SHITTY HAIR. </p>\n<p>HE HAD TO TAKE MY MEASUREMENTS.</p>\n<p>\n<i>6:44pm</i>\n</p>\n<p>\n<b>From: Shitty Hair</b>\n</p>\n<p>Uh yeah??</p>\n<p>That's hwo costumes are made</p>\n<p>***how</p>\n<p> <i> 6:46pm</i></p>\n<p>\n<b>To: Shitty Hair</b>\n</p>\n<p>Kirishima.</p>\n<p>\n<i>6:48pm</i>\n</p>\n<p>\n<b>From: Shitty Hair</b>\n</p>\n<p>Oh.</p>\n<p>OH.</p>\n<p>BAKUBRO ARE YOU GAY FOR DEKU</p>\n<p>THAT'S SO MANLY</p>\n<p>ALSO IT MAKES SO MUCH SENSE</p>\n<p>WHY DIDNT I THINK OF THAT BEFORE</p>\n<p> <i> 6:49pm</i></p>\n<p>\n<b>To: Shitty Hair</b>\n</p>\n<p>What the fuck do you mean that makes so much sense.</p>\n<p>\n<i>6:52pm</i>\n</p>\n<p>WHAT THE FUCK.</p>\n<p>\n<i>7:15pm</i>\n</p>\n<p>KIRISHIMA, I WILL FUCKING COME FIND YOU.</p>\n<p>\n<i>8:30pm</i>\n</p>\n<p>So. Whatever. Maybe he's a tiny bit gay for Deku. It's not a big fucking deal. Deku's...good looking. He guesses. And he's known him for a long time. Knows he's not a complete fucking idiot like most of these fucking extras out there, so that's a plus. </p>\n<p>What the fuck ever. </p>\n<p>(\"Bro, you know you tend to curse more when you're stressed?\"</p>\n<p>\"Shitty hair, I will fucking end you right this fucking second.\")</p>\n<p>It's fine. It's <i>fine</i>.</p>\n<p>The problem is-</p>\n<p>Well, the problem is half the fucking school seems to be a tiny bit gay for Deku too. </p>\n<p>Or straight for him? What the fuck ever. This isn't making any fucking sense. </p>\n<p>Bakugo's taken to spending a couple afternoons a week in the support department. Not like, every day. He's got shit to do- homework, and extra training, and some awful mind control exercises he swears to fucking god that asshole Shinsou definitely used his quirk on him to agree to-</p>\n<p>But he does spend one or two afternoons, in his increasingly spare free time, hanging out in the third year workshop. With Deku. </p>\n<p>It starts when he comes back to look at his sketches, and they're- fuck, they're good. Really fucking good. </p>\n<p>\"What do you think?\" Deku says, voice more nervous than Bakugo's ever heard it. Reminds him of when they were kids. </p>\n<p>Bakugo traces a finger over parchment like paper, over the sleek, clean lines of new gauntlets, the bright colors seeming brighter with the light shining through. They're bent over a light up table, pages and pages of different sketches, designs spread out around them. </p>\n<p>Some are just that- designs, more like illustrations, just an idea, reminding Bakugo of his dad's office when he starting to think about a new collection. Just swatches of color, the way a sleeve fits into a bodice, the turn of a heel in a shoe. </p>\n<p>Some are more what he expects, mechanical drawings, notes on pneumatic actuators and surface EMG sensors. </p>\n<p>\"What's that?\" he says, pointing to a particularly detailed elbow brace. It looks half robotic, complicated and- is that tubing?</p>\n<p>\"Ah!\" Deku brightens, and bends further over it. The blue light shining through the table turns his eyes from green to teal, washes his pupils out into something alien. \"It's an elastomeric construct, I decided that a fiber-fabric-reinforced approach might be best to help take some of the strain off your elbows, adapted it from Polygerinos-\" </p>\n<p>\"Deku!\" someone says, a tiny thing with huge, multi-faceted fly eyes. She's got wings to match, and they flutter anxiously. \"Can you come look at this really quick? I'm sorry,\" she says, swallowing and bowing rapidly to both of them. \"I just- it might explode-\"</p>\n<p>The soft little smile drops off Deku's face and he almost vaults over the table. \"What!\" he squawks, and hurries after fly-girl. </p>\n<p><i>That's</i> the fucking problem. So Bakugo's here a lot, right, and every fucking time, multiple fucking times, there are so many people around, people who need Deku's advice, or his thoughts, or even just want his fucking attention, that bright smile turned on them for a half a second. </p>\n<p>It looks like shitty hair was right, that garbage protein bar thief enabling bastard. Deku is really, really popular. </p>\n<p>It makes something in Bakugo's stomach shift, something different from the usual roiling anxiety and guilt that he deals with near constantly. </p>\n<p>It's only when Deku's back, eyebrows not singed through the sheer grace of god, laughing and saying, \"but I really want to give you more shoulder support, the force of your blasts-\" that the feeling in his stomach calms down. </p>\n<p>Only settles when Deku's tucked up right next to him, reaching across him to snag a little scrap on the far side of the table, when he's asking Bakugo a question, freckled nose a little scrunch. </p>\n<p>Oh hell, Bakugo thinks with a sinking feeling, oh fuck. He's <i>jealous</i></p>\n<p>Alright, fuck it, he's jealous. </p>\n<p>Nakamura says even admitting how he feels, even if it's just to himself, is an excellent step in the right direction. </p>\n<p>So it's late, and Bakugo's got the box of things he doesn't like to think about in his hands, and he takes a deep breath and says, out loud in the empty dorm, \"I'm jealous.\"</p>\n<p>It doesn't do anything- weird. It doesn't hang in the air, or have some sort of echo, or whatever. It's just Bakugo talking to himself in his dorm room, with the air conditioner hissing quietly under the window. He could've said anything. </p>\n<p>But he didn't, and he sighs, a little, and thinks, okay. He can do this. He can just- live with that. He throws himself back into pillows, stares at the water damaged ceiling. It feels. Better. Being out in the open. </p>\n<p>Even if the open is just his bedroom at ten thirty in the evening, orange glow from the lamp and a math textbook precariously balanced at the foot of his bed. Bakugo sucks in a long, slow breath, and thinks about chess. Well. Maybe more like checkers. He's impulsive, he knows this, but he's not- he's not <i>dumb</i>. He can plan stuff out, sometimes. </p>\n<p>Because underneath a lot of the anger, and the fear, and the superiority/inferiority- and Bakugo didn't even know that was a thing, that you could have, simultaneous and terrifying- Bakugo is driven. And determined. And he's maybe not willing to do something ridiculous like-</p>\n<p>\n<i>confess-</i>\n</p>\n<p>A voice in his head says cheerfully, sounding too much like Kirishima to be comfortable. Bakugo scowls. He wouldn't say a damn word, it's not like he knows the fucking nerd well enough even to- </p>\n<p>But he can. Make things easier in the long run. Even if it's going to suck so, so bad right now. </p>\n<p>But Bakugo can work past burnt open palms, and stress fractures, and texting a therapist, and- it turns out he can ask for help. He can probably do this, too. </p>\n<p>Underneath his bed, the poster roll with his old designs sits.</p>\n<p>It's late again. </p>\n<p>Bakugo's not in his room, though. He's back in the fucking third year workshop, because of course he is. Of course. </p>\n<p>He's actually working, though- right now he's in a semester-long elective on insurance law and heroics, and it's boring, it's awful, and it's one of the most useful things that Bakugo's been taught at UA. He can't imagine trying to figure this shit out on his own as a young sidekick. </p>\n<p>As it is, he's swearing quietly under his breath as he tries to figure out which forms he should be filling out for a \"property damage liability insurance due to villain quirk use (physical only).\"</p>\n<p>Bakugo wonders, semi-absently, if there can be property damage for mental quirks. </p>\n<p>He looks up only when Deku swears, low and a little vicious. \"Damn,\" Bakugo says, eyebrows up. \"What crawled up your ass and died?\"</p>\n<p>Deku's mouth twists into a pout and Bakugo's mouth goes a little dry despite himself. It's just not <i>fair</i>. Deku's mouth is a pretty little thing at the best of times- he's not a feminine person, not really, but his mouth is plush and soft and pink and Bakugo really needs to stop fucking looking at it, god damnit. </p>\n<p>\"Shinsou's stupid wiring is giving me problems,\" Deku's whining. </p>\n<p>\"You know the mind freak?\" Bakugo says, surprised. </p>\n<p>\"You know Shinsou?\" Deku says, in the same tone. </p>\n<p>\"We...train together. Sometimes.\" Bakugo says, reluctant. \"I don't. Like. Mental quirks.\" he says, forcing the words. </p>\n<p>It's a little bit of an understatement. Bakugo fucking <i>hates</i> mentalist quirks, hates the loss of control and the slimy feeling of someone else in his brain. He spars with Shinsou so he can build up his mental walls and Shinsou can practice breaking them down. It's mutually beneficial. </p>\n<p>\"Yeah, I can see that,\" Deku says, and he's got a weird little smile on his face. \"Probably hate all that feeling stuff.\" </p>\n<p>Bakugo glares at him for that because- when the hell did he say anything about feelings. \"What the hell is that supposed to mean?\" he demands. </p>\n<p>Deku turns back to wiring, lower lip still pushed out. \"You're not great with the whole emotional thing, Kacchan,\" he says, and the way it sounds riles Bakugo. </p>\n<p>It's so fucking dismissive, like Bakugo couldn't possibly <i>understand</i> emotions, or feelings, or what people think about. </p>\n<p>And maybe he can't, okay? Maybe he does have issues with empathizing, and talking about that bullshit but he's fucking working on it, and it makes him suddenly, abruptly furious that Deku just said it, offhand and uncaring. </p>\n<p>\"I'm fucking working on it, okay?\" Bakugo growls, glaring down at the forms. Fuck insurance. Fuck Deku. Fuck thinking that-</p>\n<p>\"What?\" Deku says, and when Bakugo glares up at him Deku looks. Taken aback. Same way he did when Bakugo stumbled into the third year workshop for the first time, like Bakugo's a stranger, someone he doesn't recognize. </p>\n<p>\"I said I'm fucking working on it, is your fucking hearing going?\" Bakugo scowls. When Deku just stares at him, green eyes wide, he hunches his shoulders and snaps, \"What, you want my fucking therapist's number? Want some fucking status reports? 'Oh, today Bakugo identified a positive emotion that didn't relate to wanting to punch some stupid nerd-'\"</p>\n<p>Deku holds up his hands, interrupting the scathing tirade Bakugo was working himself into. He was doing voices and everything. \"You see a therapist, Kacchan?\" is what he says, voice suddenly a lot softer. </p>\n<p>Bakugo stiffens. \"I- yeah.\" he stares down at his forms again, but the boxes of A-F aren't being very helpful. \"It's- not for long.\"</p>\n<p>\"Oh,\" Deku says, and his wiring is totally forgotten in front of him. Instead, he's staring at Bakugo like he's got a few wires loose that he needs to solder back into place. Bakugo <i>feels</i> like he's got a few wires loose. </p>\n<p>Bakugo sighs, and tamps down on the anger that he can feel roiling under his skin. He imagines it's a campfire- not an inferno, not a forest fire, raging out of control- but something contained, in a fire pit, a circle of stones. Then, he puts a lid on it, watches the flames flicker out, slow and steady, as the oxygen leaves. </p>\n<p>He opens his eyes after a second, when his imaginary campfire is just embers and smoke, and he thinks he can speak without just. Screaming. It's a visual technique Nakamura had been having him practice, and damn the bitch if it doesn't work. Sometimes. Sometimes it doesn't. Sometimes he just has to leave, and and that's- it's not <i>okay</i>, but it's better. </p>\n<p>\"I know I have- issues, Deku.\" is what he says, and he sounds tired and bitter and angry to his own ears. \"It's not an excuse, but it's not like- I'm cracked up here, I fucking <i>know</i>\" he says, and taps the side of his head. </p>\n<p>He lowers his head into his hands for a brief moment and breathes out. Thinks about the smoke from his campfire rising up, thinks about checkers, thinks about boxes under his bed. </p>\n<p>\"It's not an excuse for telling a thirteen year old to go kill himself,\" he says to insurance form 14-A (damage from earth or nature based quirks involving foundational vulnerability), and then looks up at Deku.</p>\n<p>That was a mistake. </p>\n<p>Deku looks shell-shocked. Like, really, really bad.</p>\n<p>When Bakugo had told him sorry before, Deku had- known that it was for being a dick in the third year workshop, had just teased him a little and let him in, let him back into his life and his home and his work, and that was- incredible. It was unbelievable. </p>\n<p>It was surface level though, shallow. Bakugo's not stupid, okay? Though he feels like he spends a lot of time being stupid, or convincing other people he's not stupid, or convincing himself. He's <i>not</i>. Knows that whatever the fuck he's- feeling- about Deku isn't gonna go anywhere if they don't talk about the giant elephant in the room. </p>\n<p>Now, though, Deku's pale underneath his freckles, the whites of his eyes almost too visible, like a spooked horse. His hands- scarred and awful and talented and fucking gorgeous- are clenched into fists, shaking. </p>\n<p>This- may have been a mistake. This was definitely a mistake. Oh fuck, was this a bad idea, when would he fucking learn, <i>stupid</i>-</p>\n<p>Bakugo freaks. </p>\n<p>\"Fuck- I- I shouldn't have, god damnit-\" cuts himself up, scrambles a little to stand, nowhere near his usual agility. Panicked and angry and-</p>\n<p>Deku's hand clamps down on his wrist, <i>hard</i>.</p>\n<p>Bakugo freezes. </p>\n<p>They pause there like for a second, just staring at each other. Bakugo's stomach fucking hurts, and he's furious, fire licking at the edges of his mind in a desperate attempt to just- not be scared. Not be worried. He grits his teeth and stays, despite the overwhelming urge to <i>go</i>. </p>\n<p>His fight or flight instinct has always been fucked, off kilter. Bakugo doesn't know how to run, until he does. Until now, when he can feel every little shiny burn scar and ropey slice on Deku's scarred knuckles.</p>\n<p>Deku's still looking at him, nostrils still a little flared like he needs the extra room to breathe. \"I-\" and he pauses, looks down for the first time. \"Yeah, I went to therapy too.\"</p>\n<p>Bakugo sits down, heavy. \"In Tokyo?\"</p>\n<p>Deku nods. \"Yeah.\" </p>\n<p>There's a moment of quiet, and Bakugo remembers all over again how late it is, how the white light above them forms a puddle of stark illumination on the stainless steel table, how it carves deeper shadows than normal into Deku's cheekbones, in the hollows under his eyes. How it catches the wet look of his eyes, turns them glassy and almost inhuman, pupils caverns. </p>\n<p>\"How can you even stand to sit next to me?\" Bakugo doesn't mean to say it, is just looking at the way Deku's still looking at him. </p>\n<p>Deku tilts his head. \"I never hated you,\" is all he says. </p>\n<p>\"I did,\" Bakugo said, too raw and too real, voice rough in his throat. His stomach is in knots. Once he says it, he can't stop saying it, spilling over his lips like water. \"I did. You were able to - be- without your quirk, and I couldn't, couldn't fathom how you could live like that, because you were- something, and I was- I was never going to be anything- without it, who the hell was I and you- you just were better. Than me. At being you.\"</p>\n<p>It's stuttered and awful and Bakugo has to choke half the words out and it doesn't even make sense, not really, but Deku just keeps looking at him with those big eyes. </p>\n<p>\"Of course I'm gonna be better at being me than you are,\" Deku says, gentle and awful. \"But you were always gonna be the best at being, um. You.\"</p>\n<p>Bakugo breaks eye contact, finally, and presses the heels of his hands into his eyes. \"I'm sorry.\" and his voice doesn't break, but he doesn't look up, not even when Deku lays a hand on his shoulder, fingers close enough to his collar than he can feel a fingerprint like a brand on the nape of his neck. </p>\n<p>\"Thank you,\" Deku says, after a minute. </p>\n<p>He doesn't say it's okay. Doesn't say it's alright. Doesn't prevaricate or pretend that it didn't fuck him up, that it was an awful thing, a cruel thing said for the sake of hurting. Bakugo wouldn't believe him if he did, would snap and yell and his palms would get slick and spark heavy and then- where would they be. </p>\n<p>But Deku doesn't say it's okay, just thanks him for his apology, nothing more, an acknowledgement. </p>\n<p>That, Bakugo can accept. So he does, and they sit there like that, under the pool of light, the creak of the school settling around them, for a very long time.</p>\n<p>After that night, there is a shift. </p>\n<p>It's not anything Bakugo can really put his finger on at first. Eventually they break apart at their point of contact and politely ignore the fact that both of them are tear-stained and red eyed and they just sort of don't talk about the fact that they talked about it.</p>\n<p>Bakugo sleeps like the dead that night, eyes stinging and dry and bones slack with exhaustion.</p>\n<p>It's better, though, the shift. Like they've learned how to drive stick shift, like they're not burning out the clutch every time they shift gears. </p>\n<p>Bakugo is hanging out in the third year workshop- again- when Kirishima comes to fetch him for sparring. Kirishima flings the door open and pauses for a second, leaning against the jamb. Bakugo sees him and gives him a nod that's more like a jerk of his head. Kirishima grins back at him and just watches.</p>\n<p>Bakugo's got an unimpressed eyebrow up sky high and is holding a square piece of glass up for Deku to inspect. Deku's working on perfecting his glass blowing for some god forsaken reason and is horrifically ruthless in his quest for perfection.</p>\n<p>\"I don't know,\" Deku says, frowning. He's got a pair of goggles that make him look like the frog chick in Bakugo's class. \"I think there's a flaw.\"</p>\n<p>\"It's literally perfect,\" Bakugo says flatly. \"There's no flaw.\"</p>\n<p>\"That might be a bubble.\" </p>\n<p>\"There's no bubble.\"</p>\n<p>\"I think there is.\"</p>\n<p>\"You're a fucking idiot. It's fine.\"</p>\n<p>\"Midoriya!\" Kirishima finally calls from the entryway. \"It's time for sparring! Give me my Baku-bro back!\"</p>\n<p>\"Kirishima, I'll kill you if you call me that again,\" Bakugo snarls, but he doesn't move. He's still holding the glass. </p>\n<p>Deku takes it from him, flashing Bakugo an evil little grin that doesn't make his heart skip a beat. \"You got it, Kiri!\" he chirps. \"Kick Kacchan's ass for me, I want to know how your new gauntlets are working out.\"</p>\n<p>\"I'll kick your ass,\" Bakugo grumbles, and he makes a half-hearted swipe at Deku that is really more of a goodbye pat. </p>\n<p>\"Get out of here and Baku-<i>go</i>.\" Deku says.</p>\n<p>Bakugo blinks at him for a second and then makes a much more motivated swipe at Deku's head. </p>\n<p>Deku dodges anyway, and waves them both off, </p>\n<p>Thankfully, it's only when the door to the workshop has shut and they're far down the corridor that Kirishima says, \"So-\"</p>\n<p>Kirishima's a fucking <i>gossip</i> but he can be tactful. </p>\n<p>\"Was your whole thing against Deku the fact that you're totally in love with him?\"</p>\n<p>Actually, fuck Kirishima, Kirishima's an asshole and Bakugo doesn't know why he's friends with him. </p>\n<p>\"What!\" Bakugo says. \"Fuck you.\"</p>\n<p>\"That's not a no, bro,\" Kirishima says. He's a monster in human form. </p>\n<p>\"It's a no, asshole.\"</p>\n<p>\"You didn't even try to hit him back there. That was like, a kitten punch.\"</p>\n<p>\"I'm going to kick your ass.\" Bakugo threatens.</p>\n<p>\"Sure,\" Kirishina says, nodding patronizingly. </p>\n<p>\"I'm going to murder your whole bloodline.\" </p>\n<p>\"Of course!\"</p>\n<p>\"I'm going to put fucking Nair in your hair gel.\"</p>\n<p>\"Bakugo! There's no reason to get mean!\"</p>\n<p>So they spar, and Bakugo thoroughly kicks Kirishima's ass and gets his ass kicked in return. It's only when they've finished up their last fight- which Kirishima won, the fuck- that he brings the topic up again. </p>\n<p>\"Seriously,\" Kirishima says. \"He's a good dude. We should all hang out more.\"</p>\n<p>Bakugo clamps a hand over his ribs. Fuck, Kirishima got him <i>hard</i> with that last kick. \"What the fuck do you mean, we.\" he pants. </p>\n<p>\"You know, the gang!\" Kirishima says. He hesitates a second and then plops down on the mat next to Bakugo. He offers him his water bottle and Bakugo happily tries to drown himself for a second. </p>\n<p>\"You're doing a lot better, dude.\" Kirishima says, quietly. \"Everyone's noticed, and we're all really happy for you. Like, you're just- I'm so happy that you put in the effort dude, and it's really paying off.\"</p>\n<p>Bakugo slugs him in the shoulder with a hand hot enough to make the water bottle plastic go soft, but Kirishima goes unbreakable by habit and just grins at him, shark teeth gleaming in the fluorescents. </p>\n<p>\"Yeah,\" Bakugo says. A moment passes, and Bakugo just breathes in deeply, thinking about campfires where the coals aren't even smouldering anymore, and how his ribs ache in a good sort of way, and the way Deku doesn't flinch when Bakugo moves his hands anymore. \"Thank you,\" he says to Kirishima, and means it. </p>\n<p> Bakugo is something close to happy when he goes to bed that night, hair still dripping water on his shoulders and something warm in his chest.</p>\n<p>Deku's stressed. </p>\n<p>Bakugo can see it in the dark bags under his eyes, the ones that make them look greener because of how fucking purple they are. The way his mouth is chapped, the way his hair is, frankly, a disaster. </p>\n<p>Bakugo has been idly toying with the idea of introducing him to like, real adult shampoos and conditioners, ones meant for curly hair because Bakugo is absolutely positive that he's using some two-in-one bullshit, probably All Might themed.</p>\n<p>Anyway. </p>\n<p>Deku's stressed and starting to look more like delicate china than a human being, and Bakugo has put too much fucking worth into this- this- this <i>thing</i> for Deku to self-destruct because of-</p>\n<p>Well, that's part of the problem. Bakugo has no idea why Deku's starting to do an impression of some sort of shivering chihuahua. Except with more tricep definition. </p>\n<p>\"Nerd, what the fuck is your problem?\" is what comes out of his mouth when they're sitting there one evening in Bakugo's dorm. Bakugo's got most of a history essay completed on his desk. It's actually a pretty decent analysis of the US's response to the prevalence of propulsion based quirks in comparison to other countries. Bakugo's not unhappy with it. </p>\n<p>Deku's at Bakugo's desk, the orange light of his desk lamp almost making him look like he's on fire. He's got forms of some kind spread all over the desk, and has brought not one but three of his notebooks to reference. </p>\n<p>Bakugo asks his question and Deku honest-to-god jumps in his seat. Okay, maybe rephrase that. </p>\n<p>\"You're jumpy as hell and super stressed. What gives?\"</p>\n<p>Deku sighs and rubs a hand over his face, disrupting his glasses. It hadn't been like, a shock to see that he wore them but it had certainly been <i>something</i>. They're annoyingly thick framed and if Bakugo had semi-weird fantasies about replacing Deku's shampoo, they were nothing in comparison to his thoughts on getting him a decent pair of frames. </p>\n<p>\"Showcase is coming up,\" Deku says, finally righting his glasses. </p>\n<p>\"Showcase?\" Bakugo says intelligently.</p>\n<p>Deku's patient with him, as always, and just says, \"Third-year support class showcase, yeah. It's like- you know the sports festival? How it's a way to really show off your stuff and get noticed and internships?\"</p>\n<p>\"Yeah?\" Bakugo says. \"But the support class students participate in the sports festival too.\"</p>\n<p>\"But it's mostly marketed towards the hero student and the rare gen-ed student,\" Deku says. \"There's not really a place for us or the business class.\"</p>\n<p>\"Mind freak made it pretty fucking far,\" Bakugo says. \"And he was gen ed.\"</p>\n<p>\"Was being the operative term,\" Deku says. \"We all know Shinsou should've never been in the gen ed class, he got screwed over by the entrance exam. And he was the first gen ed student since Aizawa won the whole damn thing to even make it to the third round.\"</p>\n<p>\"That's fair,\" Bakugo admits. Shinsou is damn talented. Shinsou also spends a lot of time in Bakugo's head due to their sparring sessions and Bakugo is only a little bit scared of him because of that, so he really is a good dude, as far as these things go.</p>\n<p>Bakugo winces. He spends too much time with Kirishima and the rest of those blockheads, if he's thinking the word dude now.</p>\n<p>\"Anyway,\" Deku continues, \"the support showcase is basically our sports festival, except we only get one shot at it.\" He's tight around the eyes. \"We spend the second semester of our third year working on several different hero costumes and then show them off and try to get internships or hired or whatever.\" </p>\n<p>\"Damn.\" The second semester is coming up fast. The break between semesters is coming up fast, only a few weeks. \"So what're you working on now?\"</p>\n<p>\"Paperwork,\" Deku says, and smiles a little. \"I have to get permissions and waivers from whomever will be wearing my work and then submit all these forms and get them approved and then they go before committee, and then once I have my three to showcase I have to start petitioning for space to show, and then-\"</p>\n<p>\"Hold the fuck up,\" Bakugo says. \"Just- slow down a sec. What do you have to do first?\"</p>\n<p>\"Permissions and waivers from the models.\" Deku says immediately. </p>\n<p>Bakugo raises his eyebrows. \"Models?\"</p>\n<p>Deku goes <i>pink</i>, which is charming and an interesting reaction. \"It's just course parlance! Jargon!\" he says, waving his hands. </p>\n<p>Bakugo smirks. \"Sure,\" he allows. \"Okay. Three of them? Who are you asking?\"</p>\n<p>He's honestly shocked at how casual this is coming out, how relaxed his voice sounds, how his shoulders are still loose. Because, if Deku doesn't ask him, if Deku doesn't <i>want</i> to ask him-</p>\n<p>\"Well, I asked Todoroki-\"</p>\n<p>Hold the fuck <i>up</i>.</p>\n<p>\"You asked fucking Icy-hot?\" Bakugo interrupts, incredulous. </p>\n<p>\"Well, of course,\" Deku says, frowning a little. \"The work I did to integrate the super-coolant in his bracer was like, inspired.\" </p>\n<p>Bakugo grinds his teeth. \"Who else?\"</p>\n<p>\"Shinsou.\"</p>\n<p>Fucking mind freak. God damnit. \"What do you even design for him?\"</p>\n<p>\"A lot of body armor,\" Deku says thoughtfully, like Bakugo didn't mean it sarcastically. \"We're working out the tweaks in his voice changer right now, of course, but if he really wants to go head to head physically with all these other quirks he has to protect himself. There's also this idea I've got about a-\"</p>\n<p>\"And?\" Bakugo interrupts again. </p>\n<p>\"Well, you.\"</p>\n<p>Bakugo sort of freezes for a second, long enough for Deku's eyes to go wide and him to stutter, \"I mean! I wanted to ask you tonight, I brought over the paperwork, and the waivers, but I don't know if you'd want to, I mean-\"</p>\n<p>\"You want me to be the third person to show off your stuff?\" Bakugo asks, just to hear him say it. For real. </p>\n<p>Deku's face softens, and he smiles at Bakugo, that wide, almost dopey grin. \"Of course,\" he says. \"You're my best creation.\"</p>\n<p>Bakugo's heart feels like an engine turning over in his chest. \"Of course,\" he parrots. \"I'm the best, after all.\"</p>\n<p>Deku laughs again, and tosses a packet of papers at Bakugo on the bed. \"Sign here please,\" he says, and he's so fucking happy, sitting there in Bakugo's room, that Bakugo feels like whatever he's done to deserve this back, it won't ever be enough. </p>\n<p>\"Alright, alright,\" is what he says instead of anything of the other things on his tongue, things like 'thank god I didn't fuck this up', or 'thank god you were better than me after all', things like 'thank god.'</p>\n<p>He shoves his laptop to the side, curls up to fill out the veritable mountain of paperwork Deku gave him so cheerfully. Deku's shoulders have fallen, no longer living around his ears. He's idly working on something in one of his drawing sketches, and around the curve of his wrist Bakugo can see something orange and black and green. His colors. </p>\n<p>Something taking shape in the orange light. Deku's designing for him again, and it suddenly feels so real, in a way that it almost hadn't hit Bakugo before this. </p>\n<p>Bakugo bends his head to write his full name on the first blank, and he thinks about the poster tube sitting under his bed, and he wonders.</p>\n<p>Bakugo tenses. This could make or break this whole damn thing- if even one person spots him, it's all over. He's dead fucking meat. </p>\n<p>\"Bakugo, what are you doing behind the couch?\"</p>\n<p>Fucking hell, Kirishima. Bakugo dives into a roll and pops up, arms crossed. \"I don't know what you're talking about.\"</p>\n<p>Kirishima stares at him. He's in one of those stupid muscle shirts he started favoring in second year. Mina peeks over his shoulder. \"Whatcha doin down there, Blasty?\"</p>\n<p>\"I'll kill you,\" he threatens, but it's ruined by the way Bakugo tries to peek over their shoulders to look at the door. </p>\n<p>\"There you are, Bakugo.\" Bakugo doesn't jump several feet in the air like a cat. That would be ridiculous. </p>\n<p>Mina's eyebrows say otherwise. \"Icy-Hot,\" Bakugo says reluctantly, turning around to face him. Where the hell had he come from, anyway?</p>\n<p>Todoroki Shouto stands there, one eyebrow barely ticked up. His long hair is pulled back into a braid today, flopping over his shoulder. \"Are you ready to go?\"</p>\n<p>Bakugo tsks. \"I don't see why we all have to go at once,\" he grumbles. \"I could just come by later.\"</p>\n<p>\"In terms of time management, it's smartest for us to be there all at once,\" Todoroki says. \"So Midoriya can go over everything once instead of three times.\"</p>\n<p>\"Whatever,\" he says. \"I'll see you around, Red, Ripley.\" </p>\n<p>Mina and Kirishima watch the pair leave, Todoroki trying to make stilted conversation while Bakugo muttered angrily. \"That is...so weird.\" Mina said. </p>\n<p>Kirishima grins, all sharp teeth. \"I'm so proud of him.\"</p>\n<p>Deku's rented out a classroom for them to work this evening. When Todoroki and Bakugo pull up in front of it, Hitoshi Shinsou is already waiting outside, leaning against the wall and staring at the ceiling. </p>\n<p>He rolls his neck to look at them, and that creepy little smile that makes everyone think he's the second coming of Aizawa crosses his face. \"King Explosion Murder,\" he says. </p>\n<p>\"Parasite,\" Bakugo says, giving him a short nod. </p>\n<p>Shinsou's gaze shifts to Todoroki. \"Todoroki.\" </p>\n<p>Todoroki is stiff next to Bakugo, to the point where Bakugo shoots him a weird look. \"What's the deal, Katy Perry?\" Bakugo says. </p>\n<p>Shinsou's smile widens. \"Yeah, Todoroki, what's the <i>deal</i>?\" there's something a little vicious in Shinsou's tone that Bakugo picks up on. </p>\n<p>Todoroki doesn't say a word, and it clicks. \"Don't be a dick, icy-hot,\" Bakugo snorts. He goes and knocks on the door to the classroom, three times. \"Red wants to come spar with us next time,\" he says to Shinsou.</p>\n<p>Shinsou finally breaks his one-sided staring contest with Todoroki. \"Yeah? What time is good for you next week?\"</p>\n<p>Bakugo frowns. Test on Monday that he has to make sure his idiots don't fail, essay he'd like to clean up more on Wednesday…\"Thursday work?\"</p>\n<p>Shinsou shrugs. \"Good for me.\"</p>\n<p>Todoroki is wearing his 'I find this human interaction puzzling, for some reason' frown. Bakugo ignores him, and the door swings up. </p>\n<p>Deku stands in the doorway, his hair pulled back into a sloppy bun and an open neck henley on. His grin is excited, sharp. \"I am so happy to see you all,\" he says, and stands aside to usher them in. </p>\n<p>It makes Bakugo grin, a little, at the way they all just tower over poor Deku, though Shinsou might be the tallest. He's definitely the lankiest of them, however, and Bakugo makes a mental note to bring that up in the next sparring session. Skinny bastard needs to bulk up a little more or he'll get snapped like a twig.</p>\n<p>They all drop into chairs without being told, Bakugo and Shinsou relaxed and splaying out their legs and Todoroki tight and controlled. Deku stands in front of the teacher's desk at the front of the classroom, almost vibrating. </p>\n<p>\"Okay,\" Deku says. \"First things first, I can't tell you how much it means to me to have you three showing off my designs for the showcase. It's just-\" he waves his hands. \"You three are the perfect group, and I'm so happy and excited to work with you.\"</p>\n<p>He grins. \"As I'm sure you've figured out, all my paperwork got approved. For the next semester, I'm in charge of any and all of your costuming and support needs.\" </p>\n<p>\"Congrats,\" Shinsou offers, his weird smile taking on something warmer, more real. \"I'm excited to see what you'll come up with.\"</p>\n<p>Deku beams at him. \"Thank you! So, basically, we're going to work on refining your costumes slash support items for the next good while, working through any and all kinks that might show up. Fit, comfort, power- whatever it is. Then, at the end of the semester, you'll be put through a...obstacle course of sorts to basically show off the gear to a panel of judges.\"</p>\n<p>\"Obstacle course?\" Bakugo asks. </p>\n<p>\"It's a good way to show off how the support gear works in real life, versus laboratory conditions,\" Deku explains. \"It won't just be the judges panel, of course- there's an audience with companies and agents and spectators too.\" He smirks at the three of them, looking mischievous. \"I know you guys have a big stage fright problem, so maybe work on that.\"</p>\n<p>The three boys sitting in front of Deku grin like wolves. Well, Todoroki's mouth ticks up, which is basically the equivalent. None of them have ever had a problem with showing off. </p>\n<p>\"That's basically it,\" Deku shrugs. \"I'll have a schedule that I'll send to the three of you about fittings and lab testing and everything, but those are the basics. I'm really excited, you guys.\" he says. </p>\n<p>\"Of course, Midoriya,\" Shinsou says. \"It's no trouble.\"</p>\n<p>\"Well, it's a little bit of trouble,\" Bakugo says, smirking at Deku. </p>\n<p>Deku rolls his eyes. \"Your whole life is a little bit of trouble, Kacchan.\"</p>\n<p>Shinsou barks out a laugh, one of the hoarse, hyena ones that he only does when he genuinely finds something funny. \"Kacchan?\" he grins. </p>\n<p>Bakugo glowers. Oh, fucking hell. \"Shut the fuck up, brain rot,\" he says, and shoves Shinsou.</p>\n<p>Shinsou just moves with the push, still grinning. \"Where the fuck did that come from?\"</p>\n<p>\"We grew up together,\" Deku says, pink under his freckles. \"It's a, um- childhood nickname.\"</p>\n<p>Shinsou's laughter stops a little too abruptly for it to be natural, and his gaze cuts towards Bakugo. Oh, fuck. Shinsou's spent way too much time in Bakugo's head for him not to suddenly and completely understand what the hell's going on here. </p>\n<p>\"Are you,\" he says, his voice light. \"Imagine that.\" he stands, then, and says, \"Midoriya, send us the schedule and everything. I really am excited to get to work.\" He tilts his head then. \"Bakugo, let's take a walk.\"</p>\n<p>Bakugo grits his teeth and stands, hands clenched into fists. Deku's frowning now, looking between the two of them like he's not sure what's going on. \"Whatever,\" he says, scowling. Shinsou's at the door waiting already, and Bakugo pauses in front of Deku. \"It's fine,\" he says directly to Deku, a little quiet. \"Thank you for asking me, again.\" and he squeezes Deku's shoulder as he passes. </p>\n<p>Deku's eyes are wide and his pupils are blown. \"Kacchan-\" he says, his voice a little higher than normal, but Bakugo's already at the door with Shinsou, shoulders hunched. </p>\n<p>\"Let's go,\" he says, not looking back, and so he doesn't see the way Deku watches him go with a soft, open mouth, and the way Todoroki looks between the two of them with a furrowed brow.</p>\n<p>The ensuing conversation with Shinsou is not fun. Bakugo regresses so hard during it Shinsou threatens to put him under and pull the necessary details out of him, which finally makes Bakugo start talking. </p>\n<p>Shinsou, apparently, has been friends with Deku since he transferred, and has a very good idea of Deku's past. </p>\n<p>He's also been inside Bakugo's head a lot more than anyone else, and even though Shinsou is a good man who respects Bakugo's privacy, sometimes things leak through despite all efforts. </p>\n<p>\"Right,\" Shinsou says, and his eyebags look darker than ever. \"I don't know why I never made the connection before.\"</p>\n<p>Bakugo shrugs, uncomfortable. \"It's not something I'm proud of.\"</p>\n<p>Shinsou tilts his head. \"No, I see that.\" Bakugo represses a shiver. Shinsou sees a lot more than that, the creepy fuck. \"So, what're you going to do?\"</p>\n<p>Bakugo scowls. \"What do you mean?\"</p>\n<p>\"Well, you should probably tell him about using his hero design at some point,\" Shinsou points out. </p>\n<p>\"I can't do that,\" Bakugo says immediately. </p>\n<p>\"Why not?\"</p>\n<p>\"It's fucking <i>creepy.</i>\"</p>\n<p>\"It's...not that creepy.\"</p>\n<p>\"It <i>is</i>.\"</p>\n<p>\"What-\" Shinsou says, a little exasperated. \"I honestly don't think it is? You used a pretty decent hero design for a couple of years, and yeah it's not like you guys were on, uh, good terms-\" Bakugo rolls his eyes at that prevarication, but Shinsou bulldozers ahead. \"But it's also not the end of the world. And I don't think <i>Midoriya</i> of all people would be mad.\"</p>\n<p>Shinsou's mouth is soft. \"I'm pretty sure he thinks you walk on water, so he'd probably be ecstatic.\"</p>\n<p>\"It's not right,\" Bakugo says, a sour taste in his mouth and a familiar twisting in his gut. </p>\n<p>The reason Bakugo likes Shinsou is because he always knows when to back off. \"Alright,\" he sighs. \"Have it your way. But think about it.\"</p>\n<p>And Bakugo does. Bakugo thinks about it a <i>lot</i>, over the next month and a half. </p>\n<p>He thinks about it through essays and tests and meetings with his advisor about career paths. He thinks about it through every late night he spends with Deku in the third year workshop, at the table that's been colonized as not just Deku's, but as theirs. </p>\n<p>Theirs because it has rows of perfect glass squares from Deku's experimenting, a rough cartoon from Kirishima of Bakugo as a human firework taped to the surface, piles of applications and research on hero agencies, a growing collection of half-melted plastic water bottles because Bakugo had accidentally made a bomb the one time he used a metal one, and stacks and stacks of sketchbooks and notebooks and the occasional legal pad of Deku's, going back years. </p>\n<p>\"Hey,\" Bakugo says one night. It's three weeks till the showcase, and Deku's eyebags are back but his eyes are so, so bright. It's another one of those late nights Bakugo couldn't have dreamed of back in his first year, ten thirty on a Thursday. </p>\n<p>Bakugo's got two agency profiles scattered in front of them, his own scathing notes in red pen joined by Deku's analysis in blue. He likes the sight of more than is probably okay. </p>\n<p>Deku's got an impossibly tiny screwdriver in hand, tightening up something to do with the microphone in Shinsou's mask. The rest of the mask is in three or four pieces, innards splayed to the sky. \"Yeah?\" he says. He sounds distracted. A green curl falls in front of his eyes and he blows it out of the way, making a small, frustrated noise when it bounces back into place. </p>\n<p>Without thinking, Bakugo reaches out and tucks it behind his ear. </p>\n<p>Deku freezes, still staring down at the screw he's yet to finish tightening. </p>\n<p>Bakugo swallows, hard. \"You have an idea of where you're gonna go after this?\"</p>\n<p>Deku looks up, slowly. His eyes reflect the light a little funny in the bright overhead fluorescents, make his pupils look grey, eyes like marbles. \"Some,\" he says. </p>\n<p>It's one of the things they haven't talked about, really- which is odd, in retrospect. Where they'll go after, what they want to do, specifics beyond 'be a hero' and 'help people.'</p>\n<p>Bakugo waits. He's learned, over the months, that Deku is the king of muttering and talking non-stop about things that don't matter. To actually get what he feels, however, can be like pulling teeth. </p>\n<p>\"I might go back to Tokyo,\" Deku says, and Bakugo's heart pinches a little. </p>\n<p>\"Yeah?\"</p>\n<p>\"There's some research labs that are doing amazing work, there,\" he says. \"And there's always the Island.\"</p>\n<p>The Island is even worse than Tokyo- at least Tokyo's only a train ride away. Bakugo shies away from the thought that he's already thinking in terms of visiting Deku after graduation, that their- friendship? He thinks he can safely say friendship- will survive beyond this. </p>\n<p>\"What about you?\" Deku asks carefully, watching Bakugo with the same keen eyed gaze that makes him so good at what he does. </p>\n<p>\"I've got a few offers,\" Bakugo says. \"Best Jeanist. Endeavour.\" His mouth curls. He still doesn't really like Todoroki, though they've spent more time together in the past month or so. Bakugo can at least admit that a lot of what he thought of as Todoroki being an asshole is really Todoroki having like, zero social skills. But Endeavour is a straight <i>bitch</i>.</p>\n<p>\"Ew,\" Deku says, wrinkling his nose. \"Now tell me who you're actually considering.\"</p>\n<p>Bakugo gives him a half-grin at that. \"God damn, nerd, stop reading my mind or I'll think you're cheating with mind freak somehow.\" Deku just raises his eyebrows at him, but there's a little tilt to his mouth. </p>\n<p>Bakugo sighs, rubs a hand on the back of his neck. \"Miruko wants me,\" he admits. </p>\n<p>Deku makes a little squeak. \"She's never taken a sidekick,\" he says. \"She's not even at an agency or anything.\"</p>\n<p>\"I know,\" Bakugo says. \"I think- I think she wants to start one. With me.\"</p>\n<p>Deku sits back, eyes wide. \"Kacchan, that's incredible. That's <i>insane</i>.\"</p>\n<p>\"Yeah,\" Bakugo says, he can feel that he's going red. \"I'm. It's kinda unbelievable.\"</p>\n<p>\"Nah,\" Deku says, easily, like he didn't just gut punch Bakugo with that one word. \"It's you, Kacchan. I'd believe anything when it came to you.\"</p>\n<p>Bakugo stares at Deku. Deku grins at him, and he looks a little pink at his own daring, but there's something confident in the tilt of his mouth. Something that wasn't there a few months ago. Jesus, Bakugo thinks, dizzy. There's no way I can have all this. </p>\n<p>Bakugo stares at Deku, and waits for the rug to be pulled out from under him, and it doesn't come. There's just Deku, giving him that fucking smile.</p>\n<p>\"You have to keep designing for me,\" Bakugo blurts out. \"No matter what. If you go to- to Tokyo, or to the Island, or to fucking America. You have to.\"</p>\n<p>Deku's smile only grows wider. \"You couldn't stop me, Kacchan.\"</p>\n<p>Bakugo shakes his head in something almost like wonder, stares down at the letter he got from Rumi Usagiyama, detailing her ideas for something new, an agency that did things differently, everything he ever wanted. </p>\n<p>Then he looks up at Deku, who's fiddling with the screws again, a soft smile still tilting his face towards happiness, and wonders if what he wants isn't just sitting in front of him, instead.</p>\n<p>The day dawns bright, and for Bakugo, early. </p>\n<p>For Shinsou, it is not so much day as it the liminal space of very very late night, and he will not stop complaining about it. </p>\n<p>\"Buck the fuck up, brain rot,\" Bakugo says, shoving him to the side. \"It's your own fault for not going to bed earlier.\"</p>\n<p>Shinsou shoots him a poisonous glance. \"Sorry that we can't all go to bed at eight am like some decrepit old man,\" he hisses. \"I have <i>insomnia</i>.\" </p>\n<p>\"Pop a fucking Ambien next time, I'm about to find you a caffeine IV,\" Bakugo threatens. </p>\n<p>Shinsou actually brightens at that, the freak. \"Would you?\"</p>\n<p>\"That...does not sound healthy,\" Todoroki says, looking very slightly askance at Shinsou. Bakugo will take that improvement with both fucking hands however, because Todoroki is actually answering Shinsou now. Shinsou looks vaguely gratified by that as well, if you look past the black eye bags and general hatred for being awake. </p>\n<p>\"Okay!\" a new voice pipes in. \"Thanks for being here, I know it's really early but I really want to go through a last test and-\"</p>\n<p>\"Calm down, Deku,\" Bakugo rolls his eyes fondly. \"We're all here and willing to go along with your thousandth check even though we know your equipment is perfect.\"</p>\n<p>Shinsou gives him a sly smirk at this declaration, and honestly, fuck him. </p>\n<p>If it wakes him up, however…</p>\n<p>And Deku does look a little more settled, his eyes no longer looking like a spooked horse. His hair is in complete disarray, pulled back sloppily into a short ponytail. \"Right,\" he says. \"Okay. Great.\"</p>\n<p>\"You're doing amazing, sweetie,\" Shinsou drawls. </p>\n<p>\"Should we get started?\" Todoroki says, and that thankfully spurs everyone into action. </p>\n<p>\"Yes,\" Deku latches onto the suggestion like a lifeline. \"Can I see you move through your paces first, Shouto?\"</p>\n<p>\"Like we're fucking show ponies,\" Bakugo grumbles. </p>\n<p>\"We <i>are</i> show ponies,\" Shinsou says. \"At least for this. If I'm not first can I run and grab a cup of coffee?\"</p>\n<p>\"You have seven minutes,\" Deku says, not looking away from where Todoroki is strapping on a gauntlet. </p>\n<p>\"Shit,\" Shinsou swears, and darts out of the room with surprising speed for a man who claimed to have only gotten two hours of sleep. </p>\n<p>Bakugo just leans back and watches as Todoroki finishes dressing in his hero costume. Deku's done a hell of a fucking job, Bakugo thinks. </p>\n<p>Gone is the baggy boilerman suit- Bakugo called Todoroki Mario for a solid month the first time he'd seen it. Instead, Deku had designed a sleek costume in the same dark blue and silver as his first, but it actually <i>fit</i> and was made of polyethylene. </p>\n<p>\"It's got nanometer sized holes to help the body's natural infrared radiation to pass through,\" Deku had explained one late night. \"I ran some tests, and Shouto's are actually way higher than the average persons.\"</p>\n<p>\"Icy hot is fucking radioactive?\"</p>\n<p>\"No,\" Deku laughed. \"Wrong kind. It actually makes sense about why he's got such control over temperature- but his biggest problem is the overuse, when his body stops being able to handle such fluctuations.\" He pulled over several swatches, reminiscent of the ones that hung in Bakuogos father's studio. </p>\n<p>\"Here there's a double layer of black carbon and copper in between the polyethylene that should help keep that IR in or out, depending on the side,\" Deku explained. \"I'm literally just going to split his costume down the middle and flip whether it should have an endothermic or exothermic effect.\"</p>\n<p>The effect, Bakugo thinks as he watches Todoroki run through some short exercises, was that Deku had made Todoroki an even scarier motherfucker. Gone were the days where Todoroki would start to sputter out with simultaneous frostbite and heat exhaustion- the suit managed to keep his core temperature stable enough that he was able to use his quirk for almost an hour longer, right off the bat. </p>\n<p>Shinsou pops back in, the coffee in his hands steaming up into his face. \"Is it my turn to show pony?\" he says. </p>\n<p>\"Yeah, I'll take a look at you next,\" Deku says. </p>\n<p>Shinsou's costume is less flashy than Todoroki's. Deku had made some improvements to the voice changer, but the major change was the addition of body armor. </p>\n<p>Deku had managed to manipulate the stuff to be more flexible than the usual steel plate, letting Shinsou have the range of motion he required to fight with any hope of success while still maintaining a NIJ rating of three. </p>\n<p>Bakugo had watched Deku shoot the damn thing with an AK-47 and it hadn't pierced the armor. If anything, heroes without protective quirks were going to be fucking <i>clamoring</i> for the stuff. </p>\n<p>After watching Shinsou's fancy gymnastics routine- he still regularly trained with Aizawa, the bastard- Bakugo steps up to bat. </p>\n<p>Deku's face <i>glows</i> every time Bakugo dons his hero costume, and it embarrasses and delights Bakugo in equal measure. </p>\n<p>Bakugo's new costume also had more body armor- Deku had been scathing about the fact that he hadn't had anything protecting his vital organs or supporting his shoulders more. Bakugo had remained silent, deciding that discretion was the better part of valor in this instance. </p>\n<p>Shinsou had called him a coward. </p>\n<p>The elbow brace Deku had first sketched out for him so many months ago was still there, along with an added shoulder plate. </p>\n<p>The gauntlets, however, were the absolute show stopper. </p>\n<p>They were sleeker, better for the urban guerilla fighting that so much hero work was. They were built entirely to minimize the recoil of Bakugo's blasts, were actually heavier than his old ones with ports cut into the barrel. Deku had somehow managed to install muzzle breaks into the damn things, the result being that Bakugo wasn't on the verge of dislocating all his joints every time he let off a larger than average blast. </p>\n<p>This just meant, however, that Bakugo's average blast just got larger and larger. </p>\n<p>\"Fantastic,\" Deku breathes when Bakugo lands lightly on his feet in front of him. \"If there was a way to-\"</p>\n<p>Bakugo slaps a hand over his mouth. \"Nope,\" he says, popping the p. \"Shut the fuck up. We're not nit picking the morning of the showcase.\"</p>\n<p>Deku's eyes are wide and green above Bakugo's black glove. Bakugo gives him another second and a stern eyebrow, and only takes his hand away when he's sure he's not going to argue. </p>\n<p>\"But for the next one-\"</p>\n<p>\"Fucking hell, nerd, don't you have to go get cleaned up or something?\" Bakugo says, exasperated. </p>\n<p>Deku looks down at himself. His t-shirt is streaked with oil from where he had loosened one of Shinsou's shoulder plates, his jeans have a hole in the knee, and his sneakers-</p>\n<p>Well, that was enough said about them. </p>\n<p>\"Oh, do you think I should change?\" Deku says, blinking up at Bakugo.</p>\n<p>There is a pause. </p>\n<p>\"Deku, please tell me you weren't planning to go like that.\" Bakugo says, closing his eyes. </p>\n<p>\"Go change. Now. Before the fashion plate has a heart attack,\" Shinsou says, spinning Deku around by the shoulders. \"And take a shower.\"</p>\n<p>\"Wear the white button down with your good black pants,\" Bakugo hollers after Deku's retreating back. \"And do not fucking brush your hair while it's wet!\"</p>\n<p>\"You certainly have an intimate knowledge of Midoriya's wardrobe,\" Todoroki says. </p>\n<p>Shinsou whirls on him. \"Was that a fucking <i>joke</i>, Todoroki?\" he demands.</p>\n<p>For the first time ever, Bakugo watches something close to a smirk crawl across Todoroki's face. </p>\n<p>\"I'm so proud of you,\" Shinsou says, hand over his heart, and he actually sounds a little choked up. </p>\n<p>\"Fuck both of you,\" Bakugo grumbles, but he's fighting a smile too, though he would kill them both before admitting it. </p>\n<p>He spares a thought to Aoi Nakamura, his therapist. They had had one of their conversations last night, and she had complimented him on his progress. </p>\n<p>\"You're doing well, Katsuki,\" she said, her calm voice only a little staticky over the phone speaker. \"I'm really pleased with your progress.\"</p>\n<p>\"You- you think I'm better?\" Bakugo had said. He was tucked into the corner of his bed, knees up. It was a vulnerable position he didn't really indulge in outside of his room, outside of these meetings. </p>\n<p>\"I think you're making great strides,\" Nakamura had said gently. \"I think you started to get better the instant you decided to ask for support.\"</p>\n<p>\"Right,\" Bakugo had said, burying his face in his arms. His stomach still hurt, like it did every time they had to talk, but it wasn't so bad anymore. Didn't feel like he had Raccoon Eye's acid boiling away in there. </p>\n<p>\"..Thanks,\" he said, quietly, but enough that the phone would pick it up. </p>\n<p>\"It's been my pleasure,\" Nakamura said. \"Do you wanna talk about how you feel about the showcase?\"</p>\n<p>Bakugo had <i>not</i>, not really, but he did anyway. </p>\n<p>Now it was the morning of, and Bakugo didn't feel bad, exactly. They had tucked themselves into one of the many rooms clustered around the UA stadium. Bakugo was pretty damn familiar with the thing- it was where the sports festival was held. The sun rose higher in the sky as the three of them waited for Deku to come back.</p>\n<p>Bakugo is staring out one of the wide windows, idly thinking about ribbing Shinsou for his semi-anxious pacing, when the door creaks back open. </p>\n<p>\"I didn't brush it like you said but I don't really get what I'm supposed to do-\" Deku says as he enters, fiddling with his cuffs, and Bakugo is an absolute fucking <i>goner</i>.</p>\n<p>The white shirt stretches over the blacksmith's shoulders that Deku's managed to build up despite his small frame, his hair is loose and damp, leaving watermarks around his collar, his fucking legs-</p>\n<p>Well, they're fucking gorgeous but they end in those horrific red sneakers. </p>\n<p>\"Todoroki!\" Shinsou says, suddenly very loud, and Bakugo has no idea what his face is doing but Shinsou doesn't even wait for an answer before he's catching Todoroki with an iron grip on his bicep. \"I need to talk to you outside.\"</p>\n<p>\"What?\" Todoroki says, looking baffled. \"What do we need-\"</p>\n<p>\"Right now!\" Shinsou says, and pulls Todoroki out the door past a confused Deku. </p>\n<p>\"Wh-\" Deku gets out before the door bangs shut, and now it's just Bakugo and Deku, alone in this quiet room. </p>\n<p>Bakugo still has no fucking clue what expression he's making, but he manages to say, quiet and too rough, \"You look good.\"</p>\n<p>Deku looks right back at him though, and his eyes widen. \"Th-thanks.\"</p>\n<p>Bakugo takes a hesitant step forward, manages to gain speed and fake confidence on his way over. \"You're not supposed to brush curly hair,\" he says. \"Make it fuzzy and lose the curl. Just...just let it air dry. It'll be fine.\"</p>\n<p>\"You know a shocking amount about how to take care of curls for someone with pin straight locks,\" Deku says, and Bakugo's close enough now to hear him audibly swallow. </p>\n<p>\"Well, someone has to take care of your dumb ass,\" Bakugo says without thinking, and then flushes bright red. He drops his gaze, unable to look Deku in the eye after that, and plucks at his sleeve. </p>\n<p>\"You can't even roll up your sleeves without help,\" Bakugo huffs, and starts to carefully fold the unbuttoned white cuffs past Deku's wrist, past the burn scar still shiny on his forearm, right up till it sits, tight and perfect, just below his elbows. </p>\n<p>He reaches for his left and does the other sleeve, while Deku stays silent. The whole room is very quiet, just a murmuring air conditioner disturbing the air. The sun on Deku's white shirt makes it almost glow, bright with bleach and light. </p>\n<p>Bakugo swallows, and runs both thumbs over another perfect fold, a little unwilling to let Deku go. He finally does, however, drops his arm and raises his gaze in one motion. </p>\n<p>Deku's face is like a punch to the throat, it's so open and soft and Bakugo's stomach clenches, kind of in the way it does in his therapy appointments but also something different, something-</p>\n<p>\"You're going to kill this thing, you know.\" Bakugo says, because past the softness of Deku's gaze is something nervous, showing in the clench of his jaw and the faint trembling of his hand. </p>\n<p>'You're so fucking talented. And amazing, and-\" Bakugo cuts himself off as Deku's eyes get impossibly wider. </p>\n<p>\"Kacchan-\" Deku says, and Bakugo opens his mouth to tell him, to fucking confess-</p>\n<p>\"I used your hero design till this year.\"</p>\n<p>That is not what he meant to confess. </p>\n<p>Deku goes very still. \"What?\"</p>\n<p>Bakugo wants to take a step back, give them some space, but he's tucked himself right against a fucking table and there's nowhere to go, the edge of the table pressing into his back and Deku in front of him, impossible barriers. \"I-\" Bakguo says. <i>Fuck</i>.</p>\n<p>\"The reason I wouldn't let you see my costume was because it was the one you fucking designed for me in middle school.\" Bakugo says. \"That's how fucking good you are. Even when I was still- having issues- with the. Fuck. With the whole damn thing, I fucking <i>knew</i> you were the best out there. Fucking knew no one could design for me better than you could, not a single fucking person.\"</p>\n<p>Deku lets out a long, shaky breath. \"Fuck,\" he says, and Bakugo catches his own breath. It's so fucking rare for Deku to swear, to-</p>\n<p>\"Thank you,\" Deku says, and there's a sort of helpless smile pulling at his mouth. \"Kacchan, thank you.\"</p>\n<p>Bakugo's already shaking his head, says, \"No, you can't- I shouldn't have-\"</p>\n<p>Deku catches his hand in both of his own, wraps his scarred fingers over the material of Bakugo's glove, the one that Deku designed for him. \"I'm not nervous anymore.\"</p>\n<p>\"Yeah?\" Bakugo croaks, and Deku still hasn't let go of him, and his freckles scrunch up around his eyes when he smiles, and his hair is starting to curl around his face and shoulder as it dries. \"Deku, I-\"</p>\n<p>The door opens. </p>\n<p>\"We have to go,\" Todoroki says. </p>\n<p>From out in the hall, Bakugo can hear Shinsou say, \"For fuck's sake, have you no romance in your fucking soul?\"</p>\n<p>Bakugo flushes dark red and watches as Deku does the same. Well, that-</p>\n<p>The blood just as abruptly drains out of Deku's face. \"Is it really time to go?\"</p>\n<p>Todoroki nods. \"Yes. Sorry,\" he adds on, awkwardly. The guy does everything awkwardly. Bakugo thinks it's a wonder he even managed to pick up on the mood of the room. </p>\n<p>\"Okay,\" Bakugo says, as Deku is still alarmingly pale. \"Let's fucking go.\"</p>\n<p>They make their way out of the room, head down to the floor of the stadium where Deku will make the last stand of his time at UA. In the dark tunnel, right before they head out into harsh sunlight and even harsher judgement, Bakugo turns back to Deku. </p>\n<p>\"Hey,\" Bakugo says. \"We're gonna fucking kill this thing for you, okay?\"</p>\n<p>\"Can't lose with gear like this,\" Shinsou says, slinging an arm around Bakugo's shoulders. Bakugo doesn't shove him off immediately. Only to reassure Deku, of course. </p>\n<p>\"We're going to win,\" Todoroki chimes in like the champ he is, but he doesn't try to touch either of them. Baby steps. </p>\n<p>\"Hell yeah,\" Deku says, and his freckles might still be a bit too prominent but his hands are steady. \"Let's go. Good luck out there,\" he adds on. </p>\n<p>It's only as they step into the sunlight that Bakugo releases his hold on Deku's scarred hand, and he feels like he could take on the fucking world.</p>\n<p>They fucking <i>kill</i> the showcase. </p>\n<p>The crowd's roars are still ringing in Bakugo's ears when he steps into the cool tunnels, out of the blazing sun of the arena. There's spots before his eyes as they walk into the dark, his eyes struggling to blink past the sunspots. He feels like he just killed a lion, a gladiator proving his worth before the world. Proving Deku's worth. </p>\n<p>Todoroki and Shinsou have the vaguely wild eyed look of the over-adrenalined, and Bakugo's sure that his are the same. The vicious grin on his face feels like it'll tear open his face if it stretches any wider, like his teeth are made of diamond. </p>\n<p>Shinsou's pale violet eyes are brighter than Bakugo's ever seen them, the ever present slump to his shoulders gone. </p>\n<p>Todoroki's braid has gone loose in the demonstration and flows over his shoulders like he's on the cover of some romance novel or some bullshit, the fucker. There's a small, smug curl to his lip that Bakugo keeps shooting glances at just because- that's. That's <i>weird</i>.</p>\n<p>\"You guys,\" a choked voice comes from before them, and Bakugo's eyes finally adjust to the dimness of the tunnels. </p>\n<p>Deku stands there, hands clasped so tightly in front of himself that his knuckles are white. He's grinning at them, wide and a little helpless, and he's got tears just streaming down his face. </p>\n<p>Bakugo just- stares. He can't really do anything else, just struck absolutely dumb with the sight of him. </p>\n<p>Shinsou clamps a heavy hand on his shoulder, manages to shove him forward a step. \"Look at what you <i>did</i>,\" he says to Midoriya, his deep voice warm and lilted higher than normal with exhilaration. \"Jesus, you can still hear them-\"</p>\n<p>Deku gives this half-laugh half-sob and stumbles forward into Bakugo, his hand coming up and clutching at Bakugo's shoulder with an iron grip. His other hand reaches out and grabs Todoroki's shoulder. </p>\n<p>Todoroki doesn't look as alarmed as Bakugo expects. </p>\n<p>They stand there like for a moment, Deku laughing and crying and the three of them wide eyed and shaking from the comedown, connected by hands on shoulders and some sort of camaraderie exacerbated by the fact that they really. Did that. They really fucking did. </p>\n<p>After a second Deku huffs out a breath and presses his tear stained face into Bakugo's shoulder, on top of his own hand, and Bakugo does his best not to just short circuit. Shinsou's still got his hand on Bakugo's shoulder, Deku's still got his death grip on Todoroki. </p>\n<p>Bakugo reaches up anyway with a black gloved hand and puts a hand on Deku's hip, firm and grounding, and his hands don't shake. </p>\n<p>They're only in the tunnels for another minute, and then someone comes and finds them and makes noises about the three of them going somewhere so people can take a close up look at the costumes, and Deku has to be available for questions and interviews and could they come up here, and is he okay, he's still crying-</p>\n<p>And so it's a few hours later by the time the three of them are back in a locker room, stripping off body armor and bracers with slow, exhaustion numbed fingertips. </p>\n<p>\"Jesus,\" Shinso says. He's managed to get most of his costume off, but now he's sitting on a bench shirtless in his leggings, boots and bracers, staring at the lacing like it's a math puzzle he doesn't know how to solve. \"That was fucking exhausting.\"</p>\n<p>\"I suppose it's something that we as professionals will have to become used to,\" Todoroki says, but even his hands are fumbling with the zipper at his throat. </p>\n<p>\"Fuck that,\" Bakugo snorts. \"If we have to go and have a battle, do an interview, and then submit to more fucking lab testing for two hours, then <i>another</i> interview as pros, I'm quitting.\"</p>\n<p>\"Yeah right,\" Shinsou snorts. \"What the fuck else would you do?\"</p>\n<p>Bakugo tenses, the unexpected shot to his sore spot hitting harder than it would normally. He feels his temper rise, more poisonous than normal due to exhaustion. \"Fucking-\"</p>\n<p>\"Goat herder,\" Todoroki suggests. He looks like he's given up on his zipper, and is currently on the floor unstrapping his boots. </p>\n<p>Shinsou and Bakugo both pause and look at him. \"...What?\" Shinsou says after a second.</p>\n<p>\"As an alternate profession,\" Todoroki says. His hair has finally been pulled back and it's a goddamn disaster. A long hank of it hasn't been caught up in the bun on top of his head and it trails over his shoulder. \"Perhaps some sort of metal or punk genre singer. They yell a lot.\"</p>\n<p>\"Icy hot, who the fuck taught you to be funny?\" Bakugo says, glaring at him in bewilderment. \"Who let you do this?\"</p>\n<p>Shinsou has his face in his hands, his shoulders shaking with silent laughter. He's pretty much done for.</p>\n<p>Todoroki Shouto goes honest to god <i>pink</i>. </p>\n<p>Bakugo isn't proud of what he does next, but he loses words and just starts slapping Shinsou's shoulder rapidly. \"Fucking- look up, Brain rot!\" he finally manages to get out through his slack, shocked mouth.</p>\n<p>Shinsou's still grinning, helpless and tired, but his eyes zero in on Todoroki's disappearing blush and his mouth drops open too. \"Holy fuck, Todoroki,\" Shinsou says. Shinsou is an unmitigated gossip hound and he sounds delighted. \"Who <i>have</i> you been talking to?\"</p>\n<p>Todoroki's blush comes back even darker. </p>\n<p>They finish packing their costumes away with some second wind stemming from bothering Todoroki, for Shinsou and Bakugo, or trying to get away as fast as possible, for Todoroki. </p>\n<p>\"You can introduce me at the party,\" Shinsou declares, throwing an arm over Todoroki's shoulders. Todoroki looks alarmed. </p>\n<p>\"Fuck, I forgot about that,\" Bakugo groans. \"God damnit.\"</p>\n<p>Deku's popularity strikes a-fucking-gain, and Bakugo doesn't want to go as far to say that it's ruining his life, but it definitely fucking is. This stupid party is so everyone can congratulate him, and it is kinda nice that so many people like him and are so sure he was gonna do well in this stupid show case. </p>\n<p>But Bakugo is fucking <i>tired</i>, and he doesn't want to go talk to a bunch of fucking extras, all of whom are gonna want Deku's attention, and it's just gonna. Fucking suck. For multiple reasons. </p>\n<p>Shinsou shoots him a glance. \"Why don't you put the costumes back in the workroom,\" he suggests, his gaze understanding. \"Todoroki and I have to go talk about his funny new friend.\"</p>\n<p>\"He's not a new friend,\" Todoroki says, and then gets this look on his face that suggests he wishes he hadn't said this. </p>\n<p>\"So it's someone we know!\" Shinsou says, delighted, and drags Todoroki out of the locker room, leaving Bakugo by himself with three boxes of award winning hero designs. </p>\n<p>He takes a deep breath, presses the heels of his hands into his eyes. Shinsou, the all knowing rat bastard, has done him a major favor by giving him these precious few moments by himself to decompress before having to go talk to a bunch of fucking extras who are gonna go fawn over Deku. Bakugo hates him.</p>\n<p>In another moment, Bakugo shrugs on a tank top and hoists the boxes in his arms. They're heavy, but he's not too far from the third year work room. Bakugo starts to walk. </p>\n<p>When he reaches the work room, he kicks open the door maybe a little louder than he meant. Whatever, there shouldn't be anyone in here anyway, what with the showcase and the parties and-</p>\n<p>\"Kacchan?\"</p>\n<p>Bakugo does his level best not to let his suddenly nitroglycerin-slick hands slip on the boxes. \"Deku?\" he asks, and his voice sounds bewildered to his own ears. There's a scrambling sound, and Bakugo knows that Deku's making his way over to him. \"What the hell are you doing here?\"</p>\n<p>The third box obscuring most of his vision of the room disappears, and Deku's green eyes are suddenly in view. \"Let's put these down,\" Deku says. \"Did you bring everyone's back?\"</p>\n<p>\"'Course,\" Bakugo says, following him over to their table and putting the boxes down gently. Deku put his box down and sits back down on his stool. His hair is pretty and curly but pulled back from his face now, and there's a streak of oil and grime on his neck and on the inside of his collar, probably from where he rubbed it. </p>\n<p>\"Why are you here?\" it sits in the quiet of the work room with a gravity it doesn't deserve, and Bakugo hastens to follow it up with, \"Why aren't you with your fucking, eight million friends? Like, celebrating?\"</p>\n<p>Deku looks happy but tired around the eyes, his dark circles more apparent than ever, and he smiles up at Bakugo. \"Just needed a breather.\"</p>\n<p>Bakugo swallows. \"Right, yeah, I get that.\" He was just thinking about how much he needed one, before he had to go deal with so many people. Jesus, can he ever not act like a jackass in front of Deku? \"I can head out-\"</p>\n<p>Bakugo turns to go and feels a very familiar scarred hand close around his own. This time, however, it's skin on skin, not blocked by the carbon fiber glove of Bakugo's hero costume. </p>\n<p>When Bakugo looks back, Deku's mouth is a little tight but his eyes are earnest. \"Not from you.\"</p>\n<p>Bakugo takes a deep breath. </p>\n<p>Turns fully to face him, and interlaces their fingers and hopes to god that Deku doesn't mind how fucking sweaty his hands are. </p>\n<p>\"I'm sorry, again,\" Bakugo says, swallows. \"For just. Everything. Before.\"</p>\n<p>Deku's eyebrows draw together. \"You already apologized for this, Kacchan.\"</p>\n<p>Bakugo nods, feeling like the movement is too fast, too frenetic. \"I know, and I won't- again. I won't apologize for it again, because I don't want to keep bringing it up or having it fucking hang over my head but I just. I need you to really know. I need you to know it for sure.\" </p>\n<p>Deku's eyes are very, very green. Bakugo bites his lips, forces air into his lungs- god, his stomach fucking <i>hurts</i>- says, \"I really, really need you to know it before I do this, Izuku.\"</p>\n<p>Bakugo watches Deku's green eyes go wider than he's ever seen them, wider than when Bakugo walked back into his life with a bad attitude and a worse problem, but then Bakugo can't see them anymore because he closes his own eyes and kisses him. </p>\n<p>Bakugo kisses him because, well. When else is he supposed to? What else is he gonna do? He kisses him because it's the only thing he's thought about for fucking weeks. He kisses him because god's let him get away with a lot of fucking shit these days, and Bakugo has never not grabbed life with both hands even when he's been scared to fucking death, like he has been right now. Bakugo kisses him because he can't imagine doing anything else.</p>\n<p>His imagination has failed him, however, because Deku- Midoriya- Izuku- does the impossible and fucking <i>kisses him back</i>. </p>\n<p>Deku's hand is fisted in the collar of his tank top, stretching it out when they pull away, and Bakugo's free hand has messed up his curly hair even further. Their other hands are still interlocked. </p>\n<p>Deku is blinking and kind of teary and grinning so wide that Bakugo could probably do something weird like count his teeth. Bakugo's smile is smaller, just from. Pure shock. He might have tears in his eyes too, but he's not thinking about that. </p>\n<p>\"You called me Izuku,\" Deku says, not letting go of his death grip on Bakugo's collar. </p>\n<p>Bakugo colors. \"Uh. Yeah.\"</p>\n<p>Deku's smile- Bakugo can't do anything but look at him, at the purely happy look on his face because. Damn. He put that look there. He did that. \"Does that mean I should call you Katsuki now?\" </p>\n<p>His voice is teasing, and Bakugo's brain just- short-circuits. \"Um.\" he croaks, his throat suddenly dry. </p>\n<p>Deku's eyebrows go up, and his grin widens impossibly. \"Got it,\" he chirps, and slides off his stool, finally letting go of Bakugo's poor tank top. He doesn't let go of Bakugo's hand. \"We should go to the party now.\"</p>\n<p>Bakugo looks down at their interlocked hands, looks down at Deku's beatific face. \"Yeah?\" </p>\n<p>Deku squeezes his hand. \"Yeah.\"</p>\n<p>And there will be time, later, to sit down and talk about what they'll do after, where they'll go. Whether Bakugo will take Miruko's offer to try and build a hero agency. Whether Deku will apply to university or start work. </p>\n<p>Time to go to graduation and see the other walk down the aisle, to realize that they've done it, made it through three years of blood and sweat and tears to become this. </p>\n<p>Time to go to the party and see Shinsou looking smug and sly as he flirts indiscriminately with Kaminari, Uraraka, and Monoma. Time to go and exchange flabbergasted glances with him as Sero Hanta drapes a friendly arm around Todoroki's shoulders while Todoroki goes pink. Time to walk in hand and hand and have the party just <i>explode</i>, Deku's friends chirping and fluttering around him as he goes pink. </p>\n<p>Time for Kirishima to pull Bakugo aside and tell him how proud he is, time for Bakugo to definitely not cry as he thanks Kirishima in a grumbling, choked up sincere way. Time for Kirishima to definitely cry. </p>\n<p>Time for them to circle around each other at the party like satellites, bumping into each other again and again till their hands are interlinked again, till exhaustion hits and they end up passing out on a couch in the corner, slumped together but still interlocked. </p>\n<p>But that is for later, and there will be time for that. For now-</p>\n<p>For now.</p>\n<p>For now, Deku squeezes Bakugo's hand and Bakugo leans down and kisses him again with a sort of helpless smile splitting his face, trying to push his disbelief and his thanks and something like joy into it, and Deku-</p>\n<p>Deku just kisses him back.</p>"
}