{
  "id": "247757",
  "url": "https://archiveofourown.org/works/247757?view_full_work=true",
  "author": [
    "thehoyden"
  ],
  "title": "Not So Much the Teacup",
  "rating": "Explicit",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "X-Men: First Class (2011) - Fandom"
  ],
  "relationships": [
    "Erik Lehnsherr/Charles Xavier"
  ],
  "characters": [
    "Erik Lehnsherr",
    "Charles Xavier",
    "Raven",
    "Emma Frost",
    "Sebastian Shaw",
    "Hank McCoy",
    "Logan (X-Men)"
  ],
  "additional_tags": [
    "Alternate Universe - Modern Setting",
    "wedding planner",
    "architect"
  ],
  "language": "English",
  "series": "",
  "published": "2011-08-31",
  "completed": null,
  "words": "9,073",
  "chapters": "1/1",
  "comments": "269",
  "kudos": "15,598",
  "bookmarks": "2,887",
  "hits": "176,917",
  "summary": "<p>“Charles is basically the bride whisperer. It’s like he can read their minds.” (wedding planner AU)</p>",
  "notes": "<p>\n<i>Architecture is basically a container of something. I hope they will enjoy not so much the teacup, but the tea. --Yoshio Taniguchi</i>\n</p>\n<p>Thank you to Lynnmonster for the beta, Shayheyred for the beta and event planning advice, and Rageprufrock, who helped dream up the outline and then continued to egg me on.</p>",
  "text": "<p>Charles had done some wedding planning consultations in some strange places -- in a hospital, at a chef’s table in the middle of evening service, in an FBI interview room -- so outside the Sackler Wing in the Metropolitan Museum of Art wasn’t completely ludicrous. In fact, he was maybe a little charmed that his latest client wanted to meet him in a public place, instead of throwing all his wealth at Charles in an ostentatious display, like so many of his peers did.</p>\n<p>Still, there was no mistaking the elegant figures of Sebastian Shaw and his fiancée, Emma Frost, standing apart from the tourists and the security guards and the people who visited the Met on their lunch hour. Charles was belatedly glad that Raven had refused to let him go out the door in his customary tweed jacket with elbow patches.</p>\n<p>“Mr. Shaw, Ms. Frost,” Charles said, stretching out his hand. “Charles Xavier. How do you do?”</p>\n<p>“Mr. Xavier, I’ve heard so much about you,” Shaw said, shaking his hand firmly.</p>\n<p>Charles smiled politely, and offered his hand to Frost as well, who shook his hand briefly and with some delicacy. “And of course I’ve heard of you. May I congratulate you on the completion of MacTaggert Wing?” The MacTaggert Wing was a terrible Brutalist monstrosity grafted onto the Sinclair Gallery, but it didn’t seem the time to air his architectural opinions.</p>\n<p>“All due to my lead architect, I assure you,” Shaw said. His tone was warm, but there was something about him that Charles found unsettling. “Let’s get down to business, shall we? You have quite a reputation for knowing just what a bride wants.”</p>\n<p>Charles smiled in Emma’s direction. “We do our best,” he said. She gave him a polite smile, something artificial but pretty enough, but when she looked at Shaw out of the corner of her eye, it transmuted into something a little more real, more graceless and giddy and true.</p>\n<p>“Well, perhaps we ought to start with the big picture -- how many guests were you thinking?” Charles asked, following Shaw and Emma into the closed-off Sackler Wing.</p>\n<p>“Seven hundred,” Shaw said promptly.</p>\n<p>Charles did not raise his eyebrows, but settled for saying, “That’s going to be challenging in terms of event space, but I’m sure we can make something work.”</p>\n<p>“Could you do it in this space?” Shaw asked.</p>\n<p>Charles looked around the gallery housing the Temple of Dendur, trying to do some mental calculations even with half the room obscured in white plastic and scaffolding. “In a room this size? Certainly. But I must be honest with you, Mr. Shaw, space like this is going to be hard to come by on such relatively short notice, and will almost certainly delay your desired wedding date.”</p>\n<p>“You misunderstand,” Shaw said, smiling in his unsettling way again. “We don’t want to get married in a place like this. We actually want to get married here.”</p>\n<p>Charles opened his mouth for a moment, and then shut it. “Mr. Shaw, please understand that I want to make this day everything the both of you want, but there are some limits.”</p>\n<p>“Oh, if it’s access you’re worried about, it’s not a problem,” Shaw said breezily. “My firm is renovating this wing. I’m certain it can be made available for our use before the re-opening.”</p>\n<p>“Oh, wonderful,” Charles said, hoping his smile adequately concealed his anxiety.</p>\n<p>***</p>\n<p>“Seven hundred guests. In the <i>Metropolitan Museum of Art</i>. In a wing that is the process of being renovated, so who knows when it will actually be ready. You may as well just set me on fire now and get it over with,” Charles moaned to Raven.</p>\n<p>She put a cup of coffee down in front of him, and he took a sip. It was terrible -- Raven’s coffee was always terrible -- but he couldn’t really face life without more caffeine and so he drank it anyway.</p>\n<p>“It’s our big break,” Raven said. “We’ve done pretty well until now, but this is going to open so many doors for us, Charles.”</p>\n<p>Charles put his head down in his arms. “I just want to make people happy,” he said.</p>\n<p>“If it doesn’t work out, you can always go back to living off your trust fund and sleeping with Tony Stark.”</p>\n<p>“Ugh,” Charles said. “I thought you forbade me to sleep with him.”</p>\n<p>“I did, and for your own good,” Raven said. “So don’t screw this up.”</p>\n<p>“<i>Ugh</i>,” Charles said, and drank his coffee in misery.</p>\n<p>***</p>\n<p>Shaw secured some kind of terrifying pass for him to get into the Sackler Wing whenever Charles wanted, even though it was closed to the public and security made terrible faces at Charles when he first showed the card to them. Inside, the scaffolding had seemingly bred like rabbits -- what were they even <i>doing</i> -- and there were people in hard hats who didn’t seem to be working so much as pointing at things vigorously and talking a lot.</p>\n<p>“You can’t be in here,” someone said behind Charles, voice authoritative and sharp with German consonants.</p>\n<p>Charles clutched his pass in his hand, and turned around to explain himself, and then utterly failed to do so, because the man behind him had stern eyes and sterner cheekbones, and wore his perfectly tailored suit as easily as breathing. “Er,” Charles said.</p>\n<p>The man looked completely unimpressed. He had an iPad in one hand, with which he made a short shooing gesture. “This wing is closed for renovations,” he said dismissively. “I don’t know how you got in, but you need to leave.”</p>\n<p>“You don’t understand,” Charles said, finally recovering himself enough to drag his pass up into the man’s line of sight. “I’m supposed to be here. I’m Charles Xavier--”</p>\n<p>“I don’t care if you’re God Almighty,” the man interrupted. “Out. Or I’ll have you escorted out.”</p>\n<p>“Wait,” Charles said. “Please listen to me, I’m a wedding planner--”</p>\n<p>The man looked heavenward and then seized Charles by the elbow. “I really don’t care--”</p>\n<p>“--and I’m working for Mr. Shaw,” Charles finished, feeling as if he’d run out of breath all at once.</p>\n<p>The hand on his elbow tightened, and the man drew him just a little closer, staring at Charles as if he could verify this information if he looked intently enough. Charles was so close he could smell the man’s aftershave and see the suspicious narrowing of his eyes. “There’s one way to solve this,” the man said finally. He pulled his phone out of his pocket, and Charles heard the phone ring on speaker.</p>\n<p>“Yes?” came the voice of Sebastian Shaw.</p>\n<p>“You have a wedding planner?” the man said flatly.</p>\n<p>“Oh, yes. Xavier. He should be down there sometime today.”</p>\n<p>“What for?” the man demanded crossly. “You’ve been married three times already. Don’t you know how to do it by now?”</p>\n<p>“Lehnsherr,” Shaw said, but it wasn’t exactly a chastisement. “Some things are better left to professionals.”</p>\n<p>Lehnsherr’s once-over of Charles made his opinion of Charles’ profession abundantly clear. “I won’t have outsiders underfoot in my renovation.”</p>\n<p>“I’m sure Mr. Xavier will be perfectly cooperative,” Shaw said, and the way he said it made Charles feel infinitely filthier than any time spent in Tony Stark’s company, which was really saying something. “Play nice.”</p>\n<p>Lehnsherr hung up then, which Charles thought was pretty ballsy for a subordinate, but Lehnsherr didn’t look remotely concerned. He did let go of Charles, although he had the gall to straighten Charles’ lapel just so. “You’ll wear a hard hat at all times,” Lehnsherr said. “I’ve no intention of being sued for liability just because you didn’t want to muss your hair.”</p>\n<p>Charles looked at him in disbelief, and then took a deep breath. “Look, I think we’ve gotten off on the wrong foot. Perhaps we could get a cup of coffee and--”</p>\n<p>“Mr. Xavier,” Lehnsherr said coolly, using polite social distance like a lance, “I have neither the time nor the inclination. Be here if Shaw says you must, but stay out of my way.” He turned away, the heels of his shoes clicking across the gallery floor.</p>\n<p>“Well,” Charles said to himself, “this is going to go very well indeed.”</p>\n<p>***</p>\n<p>Charles had every intention of staying out of Lehnsherr’s way, except that it quickly became evident that he couldn’t rely on the past layout of the Sackler Wing for the wedding. He only had two months to pull off the most elaborate wedding of his career, and he didn’t have any time to lose.</p>\n<p>And because Charles hadn’t gotten to where he was without knowing a thing or two about how to butter someone up, he went back to the Sackler with two coffees in hand from a coffee shop run by an Austrian couple, put on a too-big hard hat and went off in search of Erik Lehnsherr.</p>\n<p>Lehnsherr had blueprints in one hand, his iPad tucked under his arm, and had clearly just finished conferencing with a group of men who were departing, presumably to do his will. He spotted Charles and his mouth creased into an unfriendly line, but Charles persevered.</p>\n<p>“Mr. Lehnsherr,” Charles said, offering a smile that Raven had told him had probably saved him from being punched any number of times. “If I could have a few moments?”</p>\n<p>Lehnsherr’s eyes narrowed, but he sniffed the air instead, and said, “Is that from Elsa’s?”</p>\n<p>Charles handed a cup to him, and Lehnsherr took one long, appreciative sip, and then said, “Five minutes.”</p>\n<p>“Right,” Charles said, and looked out over the gallery, obscured by plastic and scaffolding and god knew what else. “I -- do you suppose I could have a copy of those blueprints?”</p>\n<p>It was possible that both the coffee and the smile were working, because Lehnsherr only frowned severely and said, “You wouldn’t know what to do with them.”</p>\n<p>“I may not have your extensive training, Mr. Lehnsherr, but surely I can divine a layout and electric outlets,” Charles said, fighting to keep a smile on his face.</p>\n<p>Lehnsherr took another thoughtful sip of coffee. “And if you make a critical error, what impact will that have on the wedding?”</p>\n<p>Charles bristled at the insinuation.</p>\n<p>“This is no place for amateurs, Mr. Xavier,” Lehnsherr said. “I’ll give you the blueprints on the condition that you don’t let your arrogance prevent you from asking questions.”</p>\n<p>“My <i>arrogance</i>?” Charles said, genuinely taken aback.</p>\n<p>“Your naiveté, perhaps,” Lehnsherr allowed, and the cool disdain in his voice raised all of Charles’ hackles. “You swan into my renovation and demand the fruits of six months of my labor, confident that you can visualize and understand what I’m doing with no formal training whatsoever?”</p>\n<p>Charles licked his lips once, and took a calming breath. \"You wouldn't be the first man to find no value in my work, but I assure you that I take both it and my clients' happiness very seriously.\"</p>\n<p>\"Happiness,\" Lehnsherr echoed, as if tasting the word in his mouth and not being entirely certain what to make of it.</p>\n<p>\"Please, Mr. Lehnsherr,\" Charles said softly.</p>\n<p>Lehnsherr abruptly handed Charles his coffee. \"Give me your email address,\" he said, bringing up his iPad. His long fingers tapped on the screen for a few moments. Without looking up, he said, \"And call me Erik.\"</p>\n<p>***</p>\n<p>Raven coordinated the wedding dress shopping, thank the good lord. Charles had only once gone to an appointment with one of the exclusive bridal designers in the city, and the experience had been full of so much terribleness and crying and violently ugly couture that Charles had henceforth assigned himself to only bargain basement shopping if the bride so desired. His TJ Maxx skills were pretty astonishing, if he said so himself.</p>\n<p>The Shaw-Frost wedding was, happily enough, not the only event on their plate, which boded well for the continued success and growth of Xavier Events. There were three other, smaller weddings coming up, a bar mitzvah in a month, and an imminent retirement party that was already making Raven hyperventilate.</p>\n<p>“He’s eighty-six and just <i>now</i> retiring from Columbia,” Raven said. “Who does that?”</p>\n<p>“A man who clearly enjoys his work,” Charles said, punctuating his words by scribbling down a few more notes on his preliminary catering menu. “In another life, I think I might have done the same.”</p>\n<p>“You certainly dress for it,” Raven said, but it was an old, affectionate jibe that Charles paid no mind. She stopped typing on her laptop, then, and looked at Charles pensively. “Do you wish you had?”</p>\n<p>There was a note of uncertainty in her voice that he hadn’t heard in quite a while.</p>\n<p>“Raven,” Charles said, reaching forward to cover her hand with his, “I’m happy right where I am, with you, working together. I wouldn’t trade my life for anything.”</p>\n<p>She smiled, and Charles did her the favor of pretending that her eyes weren’t watery, and that he was being entirely truthful.</p>\n<p>***</p>\n<p>Charles had planned his mother’s second wedding, mostly because there was no one else to do it, and he’d read a few magazines and decided he could handle it.</p>\n<p>Also, it had made his mother smile, which she did rarely, even in the company of her fiancé.</p>\n<p>It had been a small wedding at the mansion in Westchester, and his mother was so weak from the chemo that she had to sit during the whole ceremony. Charles had picked out her dress, which mostly camouflaged how thin she’d grown, and the wig was a good approximation of her formerly lustrous golden curls.</p>\n<p>Charles remembered the mistakes -- the cake had been dry, the food not as good as he’d hoped -- but he remembered most how truly happy his mother had looked when she’d said her vows.</p>\n<p>She’d died six months later, and his stepfather had followed two years after that, and left Raven and Charles alone together. Charles had been planning on Oxford, but he couldn’t leave Raven behind. He’d gone to Columbia instead, and their business had been hatched during his first year. A degree in genetics would have been all very well and good, but the first time Charles saw a bride beam at a wedding he had planned, he could only see his mother in her smile. After that, genetics could hardly compare.</p>\n<p>***</p>\n<p>Hank and Alex were young, but tremendously talented, and just as a few people had done Charles a good turn while Xavier Events was getting off the ground, Charles wanted to nurture their fledgling catering business. Also, they made a salmon appetizer that was like a mouth orgasm every time Charles ate it, so he figured it was a good bet.</p>\n<p>“I think you’ll like them,” he assured Emma. “We’ll be doing a tasting menu today so that you can make some decisions. If you don’t care for them, we can use one of the approved caterers, but I think they’re worth persuading the Met to let us use them.”</p>\n<p>Emma nodded, and Charles tried not to sigh. She didn’t talk very much, and Charles worried that she either had no opinion or was suffering this exercise mutely. He didn’t like either possibility.</p>\n<p>Hank and Alex had come through once again, though, and had even prepared extra salmon.</p>\n<p>“No, really, you have to try this one, I insist,” Charles said, pushing it Emma’s way.</p>\n<p>She tried it, and her eyes went wide, fingers fluttering in front of her mouth like she would say something if it wouldn’t require her to talk with her mouth full.</p>\n<p>“I know,” Charles said, waggling his eyebrows before popping the salmon in his mouth and making a really indecent noise that made Hank go red in the face.</p>\n<p>“I don’t know,” Emma said, looking doubtfully at all of the demolished sample plates. “What should I pick?”</p>\n<p>Charles looked at his notes. “Well, you liked the salmon, obviously, but I think the mushroom and the liver pate will be good accompanying hors d’oeuvres.” He looked up again, and Emma’s mouth was twisted into an unhappy frown, even as she twisted her engagement ring with its ludicrously large diamonds on her finger.</p>\n<p>“I don’t want to disappoint anyone,” she said, voice low.</p>\n<p>“Well,” Charles said carefully, “what about what you want?”</p>\n<p>She looked even more miserably indecisive, and Charles could tell it was going to be a very long afternoon.</p>\n<p>***</p>\n<p>Lehnsherr -- <i>Erik</i>, Charles reminded himself -- looked distinctly displeased to see him.</p>\n<p>“You’re not the city inspector,” Erik said shortly.</p>\n<p>“I’m afraid not,” Charles said lightly, handing Erik a coffee from Elsa’s. “Late, I take it?”</p>\n<p>Erik looked so fantastically grim and murderous that Charles would laugh if he didn’t think that Erik would strangle him for it. “Forty-five minutes late, and everything’s waiting on him. That man is the devil,” Erik said savagely, and sipped his coffee with a scowl.</p>\n<p>Charles tried very hard not to watch the line of his throat as he swallowed, and failed miserably.</p>\n<p>“I assume you didn’t come here just to bring me coffee,” Erik said.</p>\n<p>Privately, Charles thought a little thanks wouldn’t go amiss, but he said mildly, “I had a question about the fountain, actually. Do you think I could put lights in the water?”</p>\n<p>“No,” Erik said instantly.</p>\n<p>“You didn’t even think about it,” Charles accused.</p>\n<p>“I don’t need to think about it, because you’re not doing it.”</p>\n<p>Charles straightened to his full height, which was unfortunately still a head shorter than Erik. “Look, I understand that you may be in a bit of a mood--”</p>\n<p>“A mood?” Erik said, all silky threat, too close and looming.</p>\n<p>Charles lifted up his chin. “You heard me.”</p>\n<p>Erik narrowed his eyes. “I thought you promised Shaw you were going to be cooperative.”</p>\n<p>“And I thought you promised him you were going to <i>play nice</i>,” Charles shot back.</p>\n<p>There was a sudden clatter of sound from the gallery entrance, and they both looked over to see a red-faced man in a bland suit -- and judging by all the sour looks from the rest of the workers, he could only be the overdue city inspector.</p>\n<p>“I’ll think about it,” Erik said, and started to walk toward the inspector.</p>\n<p>Charles had to hustle to catch up to Erik’s long-legged stride. “Does this mean you’re really going to think about it, or are you just going to blow me off?”</p>\n<p>“Charles,” Erik said, voice pitched for his ears alone, “When I blow you off, you’ll know it.” He handed Charles his empty cup then. “Thanks for the coffee,” he said, and then left Charles behind to greet the city inspector with a cool smile that managed to disguise the part where Erik probably still wanted to have the man drawn and quartered.</p>\n<p>Charles stood there for a few moments, still holding the two empty coffee cups, before he decided that regrouping was the order of the day.</p>\n<p>***</p>\n<p>“He is an unmitigated <i>ass</i>,” Charles ranted a few weeks later.</p>\n<p>“What did the famous Erik Lehnsherr do today? Tell me everything,” Raven said, which might have been sarcasm except that she was pouring them both extremely generous glasses of wine and had never disguised the joy she took in Charles’ social flailings.</p>\n<p>“I asked him a perfectly simple question about ventilation and the fire alarm system--”</p>\n<p>“Why do you need to know that?” Raven said suspiciously.</p>\n<p>Charles lifted his chin with righteous anger. “That’s exactly what he said, and where does he get off criticizing my ideas? Just because a person has some creative passion in his soul doesn’t make him <i>wrong</i>.”</p>\n<p>“Okay, I might actually have to go with Lehnsherr on this one.”</p>\n<p>“Traitor,” Charles said, and took a sip of wine that was really more of a gulp.</p>\n<p>Raven put her feet in his lap. “I’m just saying, remember Mrs. Schwartz’s thing with the candles--”</p>\n<p>“I thought we agreed never to talk about that again,” Charles huffed.</p>\n<p>“Right,” Raven said cheerfully. “So, in conclusion: Erik Lehnsherr doesn’t want you to burn down the Metropolitan Museum of Art. Also, you want him real bad.”</p>\n<p>“I most certainly do <i>not</i>,” Charles said, completely horrified.</p>\n<p>***</p>\n<p>So far, that morning, Charles had fielded no less than six phone calls from Emma Frost, all in regard to the wedding cake, and so he was not precisely at his best when he arrived at the Met for his appointment with Shaw’s security expert.</p>\n<p>“Oh my god, are you <i>smoking</i> in here?” Charles said, horrified by the scruffy man in plaid lingering outside the door to the Sackler Wing. “Put that out <i>at once</i>, this is a museum, what are you thinking?”</p>\n<p>The man looked completely bemused by Charles’ outrage, but obediently stubbed out the cigar on the back of his shoe.</p>\n<p>“Now you’ve made me late,” Charles muttered, and looked around in vain for someone who probably had impossibly broad shoulders and a terrible suit.</p>\n<p>“You Charles Xavier?” the man said.</p>\n<p>Charles looked at him suspiciously. “Yes?”</p>\n<p>He held out his hand. “Logan. Mr. Shaw sent me here to go over things with you.”</p>\n<p>Charles shifted the bag in his hands and decoration samples to free himself to shake his hand. “How do you do, Mr. Logan,” he said.</p>\n<p>“Just Logan,” he said. He gave Charles a look up and down. “Nice purse,” he said.</p>\n<p>“<i>I beg your pardon</i>,” Charles said, all of his outrage back.</p>\n<p>Logan grinned then, and it was surprisingly charming even though Charles knew that meant Logan had just been fucking with him.</p>\n<p>“So, walk me through this shindig,” Logan said, pulling the door open and ushering Charles through -- with a hand on the small of his back, good Christ.</p>\n<p>As it turned out, Logan had some admittedly excellent suggestions about crowd control in between horrifying Charles with off-handed comments about snipers.</p>\n<p>“Really, Logan, I don’t think anyone’s going to assassinate Mr. Shaw,” Charles said firmly.</p>\n<p>Logan raised an eyebrow. “You’ve met him, right? Ain’t nobody who’s met him that hasn’t wanted to kill him.”</p>\n<p>“He’s getting <i>married</i>,” Charles said defensively.</p>\n<p>“For the fourth time. Like I said.”</p>\n<p>“What are <i>you</i> doing here?” Erik said from behind them, sounding very cross indeed.</p>\n<p>Charles and Logan turned. “I’m supposed to be here, as you’ll recall,” Charles said, affronted.</p>\n<p>“Not you,” Erik said, stepping close. He looked down at Charles and his lips quirked into something that verged on disappointment. “You didn’t bring me coffee today?”</p>\n<p>And it was completely stupid -- Charles had only started bringing coffee to sweeten Erik’s disposition a little, to at least associate Charles’ visits with something he liked. It was social bribery, and therefore there was no good reason for Charles to feel guilty at having let Erik down.</p>\n<p>“I--I thought I might be able to persuade you to come out for coffee with me. After we’re done here,” Charles said, the invitation out of his mouth before he could think better of it.</p>\n<p>Erik’s gaze was considering, and then he looked sharply at Logan. “That doesn’t explain what Shaw’s pit bull is doing here.”</p>\n<p>“Just doing my job, Lehnsherr,” Logan said, giving him a smile that was all teeth.</p>\n<p>Erik’s lip curled, and Logan’s frankly terrifying grin got wider, and Charles was honestly worried that violence was a real possibility. He touched Erik’s elbow to get his attention. “We’ll be done in about ten minutes. Can you spare me some time then?”</p>\n<p>Erik didn’t shake him off, surprisingly enough. “Ten minutes,” he said, and then aimed one last glare at Logan before stalking off in the direction of some of his employees.</p>\n<p>Charles and Logan watched him go, and then Logan let out a low whistle. “You some kind of miracle worker?”</p>\n<p>“I’m happy to say I’ve been called that on occasion, but I don’t see how it applies here,” Charles said.</p>\n<p>Logan let out of a huff of a disbelieving laugh. “Lehnsherr wouldn’t spit on a man if he were on fire.”</p>\n<p>“Yes?” Charles said uncertainly. “By which I mean, I agree with that assessment entirely.”</p>\n<p>“I’m just saying,” Logan said, tilting his head in Erik’s direction -- Erik, who was still watching them even as he talked to a foreman.</p>\n<p>“He’s just worried I’m going to burn the museum down,” Charles said.</p>\n<p>Logan snorted. “Sure he is.”</p>\n<p>***</p>\n<p>Erik came back precisely ten minutes later and chased Logan away, before escorting Charles out of the museum. It was a crisp autumn day outside, and a beautiful morning for a walk.</p>\n<p>Erik didn’t say much as they walked, but he was looking at the buildings as they passed with an assessing eye, before coming to a stop outside Elsa’s.</p>\n<p>“Oh,” Charles said. “We could go someplace else if you wanted. I only -- it was just clear. That you liked it.”</p>\n<p>“And you pay attention to what people like.”</p>\n<p>“I wouldn’t be good at my job if I didn’t,” Charles said wryly.</p>\n<p>“How does a person even become a wedding planner?” Erik said, claiming a table and ordering them both coffee and something else in low, angular German without looking at the menu.</p>\n<p>Charles raised an eyebrow but forbore commenting on Erik’s presumption. “Perhaps you ought to tell me how you become an architect.”</p>\n<p>“I earned my Masters of Urban Design from ETH Zurich,” Erik said. “And then I came here.”</p>\n<p>Charles smiled encouragingly, but Erik didn’t seem to feel the need to elaborate. Their order came then, coffee cups and some sort of cookies on twin stainless steel servers.</p>\n<p>“And do you enjoy it?” Charles asked, before taking a bite of one of the cookies. He made a shocked, indecent noise at the combination of almond paste and raspberry and chocolate.</p>\n<p>Erik’s eyes lingered on his face. “It’s satisfying.”</p>\n<p>Charles sipped his coffee to wash the crumbs down. “Am I allowed to ask you terribly clichéd questions, like what your favorite building here is?”</p>\n<p>“The Citigroup Center,” Erik said blandly.</p>\n<p>“Oh dear god <i>why</i>,” Charles said, entirely unable to help himself.</p>\n<p>But clearly, Erik was having him on, because his mouth twitched into something that suggested a smile. “Not really -- that thing is as ugly as sin.”</p>\n<p>Charles kicked him lightly in the foot. “I was about to think terribly of you.”</p>\n<p>“Will you think terribly of me if I tell you that my favorite is the Chrysler building?” Erik asked, something a little more intimate, almost confessional in his voice.</p>\n<p>“Everybody says that.”</p>\n<p>“Doesn’t make it less true,” Erik said, and handed Charles the little plate of cookies off his own tray.</p>\n<p>“Oh, I couldn’t, those are yours,” Charles said, still a little astonished that his plateful had disappeared so quickly.</p>\n<p>Erik pushed them into his hand anyway. “You may as well. I have to get back to the museum.”</p>\n<p>“So soon?” Charles said, and nearly winced at how plaintive he sounded.</p>\n<p>Erik put a crisp twenty on the table and stood. “We’re getting down to the wire, as I’m sure you’re aware. Unless you don’t want the Shaw wedding to go as planned.”</p>\n<p>“Please don’t say things like that, it does alarming things to my blood pressure,” Charles scolded.</p>\n<p>Erik brushed his fingers against Charles’ shoulder. “See you around, Charles.”</p>\n<p>“Until then,” Charles said reflexively.</p>\n<p>Charles thought for approximately five seconds about taking the rest of the cookies home to Raven, but he was sure they wouldn’t be as good at the end of the day, so really, he had no choice but to eat them.</p>\n<p>***</p>\n<p>The Pennington wedding was over, as was the retirement party, which was good, because the Shaw-Frost wedding went from minor shitshow to DEFCON HOT FUCKING MESS in the space of ten minutes.</p>\n<p>“Emma,” Charles said carefully, refraining from making any stabbing motions on the phone, “What brought this on?”</p>\n<p>“Everyone’s going to accuse me of being a gold-digger,” she said. “It doesn’t matter how much I -- it doesn’t matter. That’s what they’re going to say, isn’t it?”</p>\n<p>Charles sighed. “They may, but there’s nothing you can do about tongues wagging. People will say what they want. The important question here is, what do you want? If you say you’d rather have a small wedding with family only, I will make that happen.”</p>\n<p>“Even after everything you’ve done?” Emma asked doubtfully.</p>\n<p>“Even then, if it’s what you really want,” Charles said. Something was niggling at him, though, and so he said, “I don’t think it’s the potential gossip that’s bothering you, is it?”</p>\n<p>“What?”</p>\n<p>“Emma, it’s normal to be nervous,” Charles says, trying very hard to sound soothing and not patronizing. “Weddings, no matter the size, are a nerve-wracking business. Why don’t you take the weekend to think it over?”</p>\n<p>There was silence at the other end, and then a noisy exhale. “You’re right. I’ll just -- I’ll call you on Monday.”</p>\n<p>“I look forward to it,” Charles lied neatly, and resigned himself to a weekend of waiting on tenterhooks.</p>\n<p>***</p>\n<p>“What do you mean, you don’t know what she wants?” Raven demanded. “That’s ridiculous. You know what everyone says about you?”</p>\n<p>“That I’m abnormally patient while my sister is haranguing me?” Charles said, rubbing his temples in a slow, circular motion.</p>\n<p>“<i>They say</i>,” Raven ground out, “that it’s like you’re fucking <i>psychic</i> and you always know what the bride really wants, even if she doesn’t. Charles, you’ve got to pull it together.”</p>\n<p>“I’m trying!” he snapped. “It’s not that I don’t understand how important this is for us, Raven. I just can’t get a read on her, for some reason.”</p>\n<p>“Maybe you’re distracted,” Raven said flatly. “Maybe if you spent a little less time making doe-eyes at Erik Lehnsherr and a little more time listening to Emma, you’d have this figured out.”</p>\n<p>Charles took in a sharp breath and counted to ten, and then said evenly, “You really think you’re one to talk about distractions of a personal nature, Raven?”</p>\n<p>She went red, not a pink, embarrassed blush but an angry, blotchy red. “Don’t you dare,” she said. “Don’t you dare, Charles.”</p>\n<p>He could make a case that Raven had nearly cost them a lucrative catering contact when she’d taken up with Hank and then, just as abruptly, broken his heart, but he held his tongue.</p>\n<p>“I’m going out,” she said after a tense, terrible moment, and Charles didn’t call after her.</p>\n<p>***</p>\n<p>He met Emma for breakfast on Monday morning, and over coffee and a passable soufflé, he made small talk until he thought they were ready to tackle more emotional topics.</p>\n<p>“Tell me, what non-wedding things have you been up to in the last two weeks?” Charles asked.</p>\n<p>Emma dabbed at her lips. “Work, mostly. I handle a lot of contracts for the city -- that’s how I met Sebastian.”</p>\n<p>Charles rested his chin on his hand. “Swept you off your feet, did he?”</p>\n<p>And there was that smile again, the one that Charles had been waiting to see. “I didn’t -- I didn’t used to think that really happened. That you could just meet someone, and -- you know.”</p>\n<p>Charles didn’t know, exactly, but he’d seen enough people in love -- and enough people who were close enough to round up to being in love -- that he recognized the signs. But he also recognized something else. “I hope you’ll forgive me an intrusive question, but how did Sebastian propose?”</p>\n<p>Emma twisted the rather overdone ring on her finger. “He -- he came into the office, actually. I thought he was just taking me to lunch, but he proposed.”</p>\n<p>“Heavens, in front of all your coworkers?” Charles said, taking care to keep his tone light. But a public workplace proposal said two things to Charles -- one, that Sebastian Shaw had been confident in her reply, and two, that Emma hadn’t really had a chance to think it over in private before accepting.</p>\n<p>Emma’s smile faltered. “It was a joke around the office -- that he was just trying to sweeten me up for the contracts to go through. It shut everyone up when he proposed.”</p>\n<p>But Charles would lay money that it hadn’t shut up Emma’s doubts. No <i>wonder</i> she was dragging her feet now.</p>\n<p>“Emma, if you still want to make changes to the size and scope of the wedding, we can do that. But I think you need to do something first.”</p>\n<p>“What’s that?”</p>\n<p>“I think you need to have a talk with Sebastian. A real talk, about all of thing things you’ve been pushing aside. I know you love him, but you’ll never rest easy until you get everything out in the open.”</p>\n<p>Emma opened her mouth, presumably to protest that she hadn’t been suppressing anything, and then shut it. And that didn’t surprise Charles at all, because it was what he’d known from the beginning -- Emma’s edges might have been blunted by emotion, but underneath it, she was sharp and smart and he knew she’d pin Sebastian down the first chance she had. She’d just needed a little nudge.</p>\n<p>“Call me after you’ve talked,” Charles said, laying his napkin next to his empty plate. “And good luck.”</p>\n<p>***</p>\n<p>Charles ended up back at the Met, because either he was totally fucked or this thing was still going forward, and if it was going forward, he needed to go over reception service with Hank.</p>\n<p>“You promised me you wouldn’t freak out,” Charles reminded him.</p>\n<p>“I’m not freaking out, I’m wondering how we’re going to coordinate that many servers,” Hank said, carefully wiping his glasses off in a bid to demonstrate that he was not freaking out when he so obviously <i>was</i>.</p>\n<p>Something gently tapped against Charles’ head -- when he looked back to see what it was, Erik was holding a hard hat that he had apparently just thunked against Charles’ skull. “I wasn’t actually joking when I told you to wear one of these,” he said gruffly, settling it on Charles’ head. He tossed the other to Hank.</p>\n<p>“My brain is already soft,” Charles muttered. “I don’t see that getting clobbered is going to hurt me, at this juncture.”</p>\n<p>Erik’s eyebrows rose. “How’s that?”</p>\n<p>\"I may have just talked Emma out of going through with the wedding,\" Charles said.</p>\n<p>“She’s going to go through with it,” Hank said, and then to Erik, “Charles is basically the bride whisperer. It’s like he can read their minds.”</p>\n<p>“Bride whisperer,” Erik repeated flatly, but he looked very much like he was trying not to laugh.</p>\n<p>“Stop talking, Hank,” Charles suggested, scowling. He turned back to Erik, and said, “Can I test the sound equipment this afternoon?”</p>\n<p>Erik shook his head. “Not today. Maybe tomorrow.”</p>\n<p>Charles would have tugged at his hair if it weren’t currently covered by a hard hat. If he couldn’t get it done today, he’d have to push back his meeting with the DJ, which was going push another six things back, and rescheduling was going to be almost impossible. Not to mention, <i>they only had five days until the wedding</i>.</p>\n<p>A warm hand squeezed his shoulder. “Charles?” Erik said, eyes narrowing in something like concern.</p>\n<p>“He’s just going to hyperventilate,” Hank said helpfully.</p>\n<p>“That happened <i>once</i>,” Charles said, but took a few deep breaths anyway. And then his phone vibrated in his pocket. When he took it out, there was a text from Emma.</p>\n<p>“Something up?” Hank asked, shifting his weight from one foot to the other and still looking nervous in general.</p>\n<p>“The wedding’s on,” Charles said slowly, not entirely able to believe it.</p>\n<p>“Bride whisperer strikes again,” Hank said reverently, and Charles felt totally justified in smacking him upside his hard-hatted head.</p>\n<p>***</p>\n<p>Charles waited until the workers went home for the evening, and then managed to slip into the Sackler Wing. He didn’t even have to flash his badge -- a security guard who was obviously on his way out for the night recognized Charles and waved him through.</p>\n<p>He was in luck, because the door to the newly installed sound booth was open. There were plenty of wires all over the place, but Charles had worked with AV setups more chaotic than this. At least this sound booth was clearly state-of-the-art, and not dodgy wiring held together with duct tape and a prayer.</p>\n<p>The door to the booth clicked shut behind him, and Charles jumped, startled.</p>\n<p>“How did I know?” Erik said wryly. “I tell you not to do something, and you do it anyway.”</p>\n<p>“I’m on a schedule,” Charles said. “And you told me not to do it this afternoon, which is why I am here when normal people might be thinking about a nightcap.”</p>\n<p>“I told you not to do it <i>today</i>, which actually still includes now,” Erik said, tone disapproving.</p>\n<p>Charles turned sharply to look at him, and promptly lost his footing on some of the wiring. He pitched forward and saw what looked like a very important cable being ripped out of the wall, and that was when there was a terrible noise and everything went dark.</p>\n<p>There was the click of the door handle, and then a scuffling noise like a push. “We’re locked in,” Erik said, his tone clipped.</p>\n<p>Charles dug out his phone, momentarily filling the sound booth with some light. “No signal. You?”</p>\n<p>Another flash of light and a disgusted noise. “Not this far into the interior of the museum. Especially not this corridor.”</p>\n<p>“<i>Bugger</i>,” Charles said feelingly, and slid down the wall to sit on the floor.</p>\n<p>***</p>\n<p>Surprisingly, Erik didn’t actually castigate him for getting into this mess, but he did tell Charles to shove over so that he could sit down next to him.</p>\n<p>Which was fine, because Charles was plenty capable of castigating himself. “Why do I do these things to myself? I could be doing any one of the approximately six billion items on my to-do list, but no.”</p>\n<p>“Or you could be sleeping,” Erik said.</p>\n<p>Charles scoffed. “Please. There’s no sleeping a week before a wedding like this.”</p>\n<p>It was completely dark in sound booth, but Erik’s assurances of proper ventilation and the warm press of Erik’s body all along his left side went a long way toward preventing any panic attacks. All his senses had to focus on was the steady movement of Erik’s breathing and the increasing rasp of his voice.</p>\n<p>“Do you even like this wedding?” Erik asked suddenly.</p>\n<p>Charles squirmed a bit, his backside starting to go numb. “Like it?”</p>\n<p>There was a pause while Erik thought it over, and then he said slowly, “Is it the kind of wedding you would want?”</p>\n<p>Charles snorted. “Oh good lord, no. Weddings like these are about public spectacle, about demonstrating power and wealth.”</p>\n<p>There was a hum of agreement from Erik. “I’ve been to all three of Shaw’s previous weddings. They were all like this, a gaudy circus.”</p>\n<p>Charles’ lips twitched into a smile he knew Erik couldn’t see, but could probably hear in his voice. “Watch whose work you’re calling a ‘gaudy circus,’ Erik.”</p>\n<p>“If you’re implying anything about the refurb on this wing, I’ll have you know that I had to design under some very strict parameters not of my own choosing,” Erik said coolly.</p>\n<p>Charles reached over to pat Erik’s knee in consolation, but misjudged and ended up sort of feeling up his thigh. It was distressingly well-muscled and suggested Erik probably ran a fair amount. “I knew that. But there are still parts of you in it, aren’t there? The columns on the side and the glasswork, I thought.”</p>\n<p>Erik was silent for a long moment. “How did you know?”</p>\n<p>“You’re a man who loves the beautiful details and the sleekness of the Chrysler building. There’s nothing of Shaw’s overwrought aesthetic there.”</p>\n<p>Erik seemed to relax a little, body settling more comfortably against Charles. Which was just as well, because it was distinctly on the chilly side inside the sound booth, cool air being over-efficiently pumped into the room. He was entirely unable to prevent the shiver that wracked his body -- Raven had often called him a delicate, climate-controlled flower, which was unfortunately pretty accurate.</p>\n<p>“Cold?” Erik asked. Charles was uncertain whether he was being patronized, but Erik just said, “Here, let me--” and then wrapped one warm arm firmly around Charles’ shoulders, pulling him closer still.</p>\n<p>“Really?” Charles said skeptically. “I’m not a girl, you know.”</p>\n<p>Erik’s breath teased at his ear. “I’m quite aware.”</p>\n<p>In the rearrangement of their bodies, Charles hadn’t exactly let go of Erik’s thigh -- and in fact, his grip had slid further away from Erik’s knee, to the point where if he moved his hand just a little more, he’d have incontrovertible evidence that Erik was most definitely not a girl, either. Charles swallowed, feeling like his throat had gone dry.</p>\n<p>“Charles,” Erik murmured, his lips -- oh god -- brushing Charles’ ear, and Charles couldn’t help the thready sigh he made, the shiver running down his spine that had nothing to do with the temperature.</p>\n<p>Erik froze against him for one terrible moment, and then he deliberately licked the curl of Charles’ ear before taking the lobe in between sharp teeth, and the moan that Charles made at that couldn’t leave anyone in the booth with any doubt that he was ripe for the taking.</p>\n<p>The next moments were madness, a blur of sucking kisses against Charles’ too-sensitive neck that left him gasping before Erik relented and pressed their lips together, and that made things more out of control, not less, and all he could do was open his mouth to Erik and suck on his tongue and make more of those terribly unmanly gasps when Erik nibbled at his lips and tried to press their bodies closer still. The angle was awkward, though, and giving him a bit of a crick in his neck, so the only answer -- obviously -- was to raise himself up on his knees and swing one thigh over to straddle Erik’s lap, and, <i>oh</i>, there was his proof that Erik wanted him very much, indeed.</p>\n<p>He ground his hips down in Erik’s lap, moving his hips in a tight, slow circle that had Erik gasping against Charles’ mouth for a change, and he was hard and hot against Charles, still in that damnably sleek suit that Charles wanted nothing more than to wrinkle up, even if he couldn’t see it. Erik evidently felt likewise, because he made short work of the buttons on Charles’ cardigan before pulling it off and shoving his hands up Charles’ shirt to skate over his ribs and rub against his nipples. “Oh god,” Charles breathed, and he was just at the right height now to learn forward to learn the strong slope of Erik’s neck with his lips, and felt Erik push his hips up when Charles lingered on the tender patch of skin under his ear.</p>\n<p>And then Erik was scrambling to open their belts, like he couldn’t <i>wait</i>, and Charles obviously couldn’t wait either, because he kept rubbing against Erik even though it was obviously impeding Erik’s progress toward getting their trousers open, and Erik said something low and impatient in German, before succeeding in dragging Charles’ waistband down and getting a good handful of his ass through what Charles belatedly realized were not his everyday underwear.</p>\n<p>“It is a crime that I can’t see these on you,” Erik said vehemently before yanking them down.</p>\n<p>“Could turn on your phone,” Charles said, popping the button on Erik’s trousers and undoing the zip with triumph, before raising himself up on his knees again so that Erik could lift his hips enough for Charles to shimmy everything out of the way.</p>\n<p>Erik growled something in reply, and Charles didn’t care what it was, because Erik curled his large, square palm around the both of them and all Charles could do was clutch at his shoulders and ride his lap while Erik stroked them together. They were both already a little slick, but Charles pulled Erik’s hand up to drag his tongue wetly over Erik’s palm and fingers before pushing it back down, and Erik said, “<i>Fuck</i>, Charles,” before stroking them together in earnest.</p>\n<p>And since Charles was the precise opposite of subtle when there was something he wanted in bed, he writhed shamelessly to meet the exploring finger that Erik was drawing down from the small of his back, and Erik only pulled it away to press it against Charles’ lips, and Charles sucked his finger in, going down on it like he would go down on Erik’s cock if they only had the room to maneuver, and then Erik drew his hand away and let his spit-slick finger rub against Charles’ hole before gently pushing in. Or at least, he probably meant to go gently, slowly, except that Charles moaned and thrust back greedily, and Erik ground out, “<i>Liebling</i>, the things I want to do to you--”</p>\n<p>“Oh god, <i>fuck me</i>,” Charles begged, and he didn’t know how he’d ever been cold, not with Erik’s hand wrapped around them and his finger tapping out a maddening rhythm against Charles’ prostate, their skin hot and damp with sweat where it touched around their rucked-up shirts.</p>\n<p>Charles reached down to touch Erik’s cock, to feel the heft of him, and moaned against Erik’s lips, “I want this, I want all of this, <i>Erik</i>--”</p>\n<p>“Later,” Erik promised, voice a gritty rasp. “Later, <i>Schatz</i>, I’m going to open you up so slow and give it to you--”</p>\n<p>“<i>Yes</i>, oh, oh <i>god</i>,” Charles gasped out, forehead resting on Erik’s shoulder as he came all over Erik’s hand, shuddering when Erik slowly fingered him through the end. “Ah -- no more, let me--”</p>\n<p>Erik eased his finger out, and Charles swept his hand through his own come and wrapped it firmly around Erik’s cock, stroking him quickly. He thought Erik was close, so Charles murmured in his ear, “You will, won’t you, you’ll fuck me so well you’ll <i>ruin</i> me for anyone else, I’ll only want you--”</p>\n<p>Erik gripped his hips hard, then, shaking apart in Charles’ grasp.</p>\n<p>Charles slumped forward in Erik’s arms, both of them trying to catch their breath. “Good lord, Erik,” Charles said eventually, still feeling dazed.</p>\n<p>Erik just ran his fingers soothingly up and down Charles’ spine, and then after a time, he said, “I bet you can sleep now.”</p>\n<p>Charles made a dissatisfied noise. “I’d love to, but there’s hardly any room.” That, and he was loathe to move from the warmth of Erik’s embrace.</p>\n<p>Erik shifted a little in the dark, and then said, “Here, between my legs--”</p>\n<p>“Erik, darling, I told you, we really don’t have room for <i>that</i>.”</p>\n<p>“To sit, Charles,” Erik clarified, sounding very much like he was rolling his eyes. “And lean back -- there.”</p>\n<p>“Are you comfortable?” Charles said doubtfully.</p>\n<p>There was a small flash of light as Erik checked his cell phone. “We have six hours until the first crew comes in,” he said, stealing Charles’ cardigan and shoving it behind his back. “Get some sleep.”</p>\n<p>“Mmm, all right,” Charles said, and dropped off before his brain could offer any opinions on the wisdom of the past hour.</p>\n<p>***</p>\n<p>Erik nudged him awake the next morning, and Charles blearily opened his eyes to the artificial glow of Erik’s cell phone. “Come on, let’s make ourselves presentable,” Erik said, his voice a low rumble.</p>\n<p>“I don’t think I’m going to look like anything except shagged rotten in a closet,” Charles muttered, but made an effort to drag himself away from the warm of Erik’s chest and tried to put himself together. He was deeply thankful that Erik had taken off his cardigan early in the proceedings, because it was going to hopefully hide the apocalyptic disaster that was his shirt, which they’d evidently used to mop up the night before. “What time is it?”</p>\n<p>“Half-six,” Erik said, squinting at his phone.</p>\n<p>“Okay,” Charles said, taking in a deep breath. “This is not terrible. I can make this work. No panic attacks, no hyperventilating.”</p>\n<p>“I thought you were joking about that,” Erik said, concerned.</p>\n<p>“Mostly,” Charles admitted. “But I make no promises for Saturday morning.” He ran his hands through his hair, aware it was probably a lost cause. “How do I look?”</p>\n<p>Erik tilted the phone in his direction. “Like you were shagged rotten in a closet,” he said, and pulled Charles close for a thorough kiss. “When can we do it again?”</p>\n<p>“If the closet part is optional, I have--” Charles scrolled through the calendar on his phone. “An hour, starting at 5:30.”</p>\n<p>“An hour?”</p>\n<p>“It is the <i>week before the wedding</i>,” Charles said, trying to be patient but failing completely. “It’s that or nothing today, I’m afraid.”</p>\n<p>“Oh, I’ll take it. It seems I have a few promises to keep,” Erik said, and the tone in his voice made Charles shiver in anticipation.</p>\n<p>“I look forward to it,” Charles said, and banged on the sound booth door, calling for the work crew to let them out.</p>\n<p>***</p>\n<p>“Okay,” Raven said, juggling her phone and three to-do lists and her handbag. “One bridesmaid crisis down, probably another three to go. How was your last meeting with the DJ?”</p>\n<p>“Sean will be fine,” Charles said, carefully carrying the sample centerpiece into their offices. “Where are we with the photographers?”</p>\n<p>“Official or unofficial?” Raven said, eyes a little wild. “I can’t believe we’re doing a wedding that actual newspapers want to cover,” she marveled.</p>\n<p>“The first of many, let’s hope,” Charles said, trying to be cheerful even though he wanted to sleep for three days straight, preferably in Erik’s bed.</p>\n<p>Charles’ phone buzzed then, with a text from Erik: <i>I’m starting to think you’re an incubus.</i></p>\n<p>He turned away from Raven to answer, because he knew very well that he had an impossibly self-satisfied smile on his face. <i>Why, Erik, anyone would think you didn’t appreciate my commitment to preparation.</i> He’d managed to track Erik down for an incendiary quickie in the middle of the afternoon the day before, when he’d had one appointment over early and another delayed, and basically yanked Erik into his office, locked the door, and said, “I’m ready, get in me now,” and watched Erik’s eyes go dark and crazy with lust.</p>\n<p>\n<i>I’m full of admiration for your attention to detail, Mr. Xavier. I suppose I won’t be seeing you again until the wedding?</i>\n</p>\n<p>Charles smiled regretfully at that. <i>What I wouldn’t give for a spare hour or six today, Mr. Lehnsherr. I’ll see you tomorrow.</i></p>\n<p>“Okay, seriously, if you are sexting that architect right now I am going to kill you,” Raven said, but since she didn’t actually sound angry about it, Charles just stuck his phone in his pocket and went to help her with the newest snag in the hotel reservations.</p>\n<p>***</p>\n<p>The reception was almost over, and Charles felt, well, triumphant and <i>destroyed</i> and so tired that he was actually edging toward giddiness. Probably drinking straight out of a champagne bottle was not going to improve matters, but Charles figured he deserved it.</p>\n<p>The wedding party was gone, as were the majority of the guests. At this point, Charles just wanted to kick all the stragglers out, manners and reputation be damned.</p>\n<p>“What are you still doing here?” Erik asked, looking as devastatingly delicious in his tuxedo as he had all night.</p>\n<p>“Part of the job,” Charles said. “I have to stay until the end.”</p>\n<p>“Where’s your sister?”</p>\n<p>Charles took another swig of champagne. “Gone to, er, assist the caterer with something I don’t want to know anything about, I think.”</p>\n<p>“Ah,” Erik said. And then he held out a hand. “Dance with me?”</p>\n<p>Charles looked at him dubiously. “It’s charming that you think I can even stand at this point.”</p>\n<p>“I had wondered,” Erik said, all smug innuendo, and Charles snorted in response and accepted the hand up.</p>\n<p>He let Erik lead, mostly because Erik was taller and of the two of them, could actually be trusted not to navigate them into a table, which was more than Charles could say of himself at this point. Also, there was something very nice about being able to just to lean into Erik and just <i>be</i>, for awhile.</p>\n<p>“Come home with me,” Erik murmured in his ear.</p>\n<p>“I really might fall over dead,” Charles warned him.</p>\n<p>Erik laughed a little at that, and then pressed a terribly tender kiss to Charles’ neck. “If you don’t come home with me, this will make the first of Shaw’s weddings where I didn’t get laid.”</p>\n<p>“I’m fairly certain I saw at least three unattached bridesmaids,” Charles said, fighting down a smile. “You’re not telling me a disheveled wedding planner will do, are you?”</p>\n<p>“<i>Schatz</i>, I’m not settling,” Erik said, and kissed him, slow and deliberate and wonderful.</p>\n<p>Charles looked him in the eye, feeling a little shaky but also deeply, irrationally <i>sure</i>, remembering Emma saying, <i> I didn’t used to think that really happened, that you could just meet someone--</i></p>\n<p>“Help me politely kick everyone out, and then take me home,” he said.</p>\n<p>“With pleasure,” Erik said, a sharp smile filling his face.</p>\n<p>***</p>\n<p>“Charles, leave it,” Erik said sternly.</p>\n<p>“But--”</p>\n<p>“You promised,” Erik said.</p>\n<p>“It’s only the <i>opening of your own firm</i>,” Charles said sarcastically. “I can’t believe you want me to just sit back and have Raven do everything. I don’t know if you’ve noticed, but it is actually my job to do these things, and furthermore, I’m really quite good at it.”</p>\n<p>“Which I am not arguing, but you promised.”</p>\n<p>“Fine,” Charles said, sulking and fiddling with his cufflinks. “I’ll be uselessly decorative on your arm, as promised, and not deal with any one of the twenty things that are bound to blow up in Raven’s face.”</p>\n<p>“Which she can handle, and I wouldn’t call your decoration useless,” Erik said, and kissed him. “Call it an anniversary present to me, if you like.”</p>\n<p>Charles blinked at him. “A few days late, aren’t you?”</p>\n<p>Erik sighed, sounding less exasperated and more fond. “I’m counting from the wedding, which was the first time you actually let me be a gentleman and feed you and put you to bed.”</p>\n<p>Charles felt his face flush. “Oh. Well. Anniversary present it is. Just let me--”</p>\n<p>“<i>Charles</i>.”</p>\n<p>“All right, all right. Let’s go win you some new clients, shall we? By which I mean, of course, that I’m going to be charming in their direction and you’ll be terrifying, and they’ll fall all over themselves to give you their business.”</p>\n<p>“Is that really how it works?” Erik said, brow furrowing.</p>\n<p>“Trust me, darling,” Charles said, beaming. “Haven’t you heard? It’s like I can read people’s minds.”</p>"
}