{
  "id": "2482184",
  "url": "https://archiveofourown.org/works/2482184?view_full_work=true",
  "author": [
    "Aza (sazandorable)"
  ],
  "title": "Those walls I built didn't even put up a fight",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "The Heroes of Olympus - Rick Riordan",
    "Percy Jackson and the Olympians - Rick Riordan"
  ],
  "relationships": [
    "Nico di Angelo/Will Solace",
    "Nico di Angelo & Will Solace",
    "some Nico & Jason friendship",
    "Nico di Angelo & Jason Grace & Percy Jackson"
  ],
  "characters": [
    "Nico di Angelo",
    "Will Solace",
    "and a whole bunch of other campers"
  ],
  "additional_tags": [
    "Those Three Days At The Infirmary",
    "Slow Build",
    "a little gayngst but Nico's working on it",
    "Getting Together",
    "Nico's shirt",
    "Discussion of Death",
    "Jason is an embarrassing very supportive ally",
    "Nico Has Friends",
    "flirting through snark",
    "and bad poetry",
    "very much one-sided and past Nico/Percy - Freeform",
    "Internalized Homophobia",
    "mentions of societal and historical violent homophobia",
    "(nothing on-screen and nothing happens in the fic)"
  ],
  "language": "English",
  "series": "",
  "published": "2014-10-20",
  "completed": null,
  "words": "14,214",
  "chapters": "1/1",
  "comments": "353",
  "kudos": "17,813",
  "bookmarks": "3,513",
  "hits": "218,605",
  "summary": "<p>\"Is it morally okay to stab a medic with their own scissors?\" Nico asked Cecil. (Not that he usually cared about morally okay, as Octavian might demonstrate.)</p>\n<p> </p>\n<p>Nico's three days in the infirmary go by faster than he'd thought, and Will just won't stop flirting.</p>",
  "notes": "<p>I do not consent to have my work hosted on any third party app or site. If you are reading this fanfiction anywhere but on the website of archiveofourown, it has been reposted without my permission.</p>\n<p> </p>\n<p>Ok, so obviously, everyone and their mortal parent has written the Three Days At The Infirmary already by now, but I started this because I hadn't yet seen anyone address or remember the following facts:</p>\n<p>• Will is actually <i>bad</i> at everything Apollo except for healing. He doesn't even fight. He's not even good with his bow. He specifically says he isn't a good musician nor singer.<br>• Nico's shirt<br>• that little murder/assisted suicide thing</p>\n<p>So here's my take on it because alzejalzkjslkajdqazs I'm still so happy for Nico, let's make him even happier.<br>I've no idea how this got this long, I'm sorry, nothing even really happens, but oh gods these two.</p>\n<p>(And yes, most of this was written to a song from Glee.)</p>\n<p>---------------</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>",
  "text": "<p>            \"So that's dealt with,\" Will said. His tone sounded a little odd; carefully neutral, halfway between observation and interrogation, as if he was expecting an answer but leaving Nico the liberty not to give one.</p>\n<p>            For a second, Nico's beautiful new resolve wavered as it occurred to him that Will <em>knew</em>.</p>\n<p>            He mentally grabbed himself by the collar; breathed in, out, repeated in himself: getting a second life, making it a better life. Jason had called him brave once. He was Nico di Angelo, the son of Hades, the Ghost King; he'd just helped reunite Romans and Greeks and defeat the Earth Mother and confessed to Percy Jackson (and let him go). The hardest part was done. He was capable of not chickening out now. He was <em>counting</em> on the possibility that Will knew, that Will was acting like this because he knew.</p>\n<p>            He'd handled Titans, giants and Tartarus, he could handle one son of Apollo.</p>\n<p>            Hopefully.</p>\n<p>            He looked up to meet Will's pale, calm eyes and said, \"Yeah.\" Nothing groundbreaking, but his voice hadn't shaken much, and he'd managed to hold eye contact. This would do for now. This was enough.</p>\n<p>            At least, Will seemed to think so, too. He hummed noncommittally and uncrossed his arms, and reached out.</p>\n<p>            So much for his new bravery; Nico couldn't help but flinch. Hugs from friends he'd spent days fighting for his life with, he could accept, but two in as many days had already been a lot to take in. Will Solace's touchy-feely tendencies were a little harder to stomach to start with.</p>\n<p>            Fortunately, Will just poked at the collar of his shirt, leaving Nico to feel possibly rude and definitely stupid.</p>\n<p>            \"First things first,\" Will said, \"you're getting out of these clothes.\"</p>\n<p>\n<em>            \"Excuse me—\"</em>\n</p>\n<p>            \"Like, <em>believe me</em>, I understand the rush and rearranging of priorities, what with war efforts and aftermath and all, and I guess the cleaning harpies are too busy right now to tear you to shreds for this, but I <em>distinctly</em> remember you were still wearing this... particular shirt last time I saw you, and it was already filthy. That's not really compliant with basic hygiene rules. So, you're getting a shower and fresh clothes before you set one foot in the infirmary.\"</p>\n<p>            Nico stared at him, then glanced down at his own outfit eloquently, but Will didn't seem to get the message that this comment, coming from a guy wearing his surgeon's shirt 1) around camp, 2) with jeans and flip-flops, didn't come across as professional as he seemed to think. So he just replied, \"I don't have another.\"</p>\n<p>            Will stared back. \"What?\"</p>\n<p>            \"Why do you <em>think</em> I'm still wearing this thing?\"</p>\n<p>            \"Nico 'a study in black and punk prints' di Angelo doesn't own another shirt than <em>parrots and palm trees print</em>?\" His tone was, incredibly enough, serious, but his eyes were twinkling and his lips were twitching. It really wasn't this funny.</p>\n<p>            \"War with giants doesn't really leave a lot of time to do much shopping, okay!\"</p>\n<p>            Will laughed. He was notorious around camp for being that one Apollo kid with a terrible singing voice (and that was not even getting into the ultrasonic whistles), but the sound of his laughter was all right.</p>\n<p>            \"Go get un-disgusting, I'll bring you something,\" he promised, still snickering.</p>\n<p>            \"Please, nothing orange.\"</p>\n<p>            \"Can't guarantee that. We don't have much else than camp shirts in size ten.\"</p>\n<p>            \"Twelve!\" Nico protested before he could think better of it. Then he decided to take the burning of his cheeks as a signal to run away now.</p>\n<p>            Will's actually-pretty-okay laughter chased him all the way to Hades cabin.</p>\n<p> </p>\n<p> </p>\n<p>            Nico heard Will come in the cabin. His knocking on the door of the bathroom was really unnecessary. Somehow Nico wasn't really surprised, though.</p>\n<p>            At least he just called out \"I'm leaving the clothes on your bed!\" and left, instead of asking that Nico unlock the door to give him the stuff. (Nico hadn't bothered to lock it. Hazel was currently using the other uselessly big bathroom the cabin had been built with.)</p>\n<p>            Nico wrapped his damp hair in a towel and carefully tied another around his waist before walking back into the dorm space, and quickly got dressed. The top <em>was</em> an orange Camp Half-Blood shirt (and a perfectly fitting size twelve), but at least the jeans were black and fit acceptably. Nico slipped on his usual belt with the silver skull buckle anyway, and felt mostly himself. Certainly an improvement on the tropical print, anyway. That was going into the trash immediately.</p>\n<p>            Hazel came out of her bathroom, still looking a little sleepy but fresh-faced. With the tear tracks washed off her cheeks, the red rimming of her bleary eyes might have been simple weariness.</p>\n<p>            At this point, Nico figured, there wasn't a big difference between two and three hugs in twenty-four hours, and it wasn't like Hazel had not always been the exception to his problem with touching. Opening his arms wasn't even awkward, and even if it had been, her smile would have been worth it. She was both fresh and warm, and when Nico burrowed his nose in her hair, he recognized the scent of her shampoo as being the same as his. (It was quite likely all of Camp Half-Blood used the same shampoo, except for the Aphrodite kids probably, but still. Familiarity was weirdly comforting. This wasn't a thing Nico had known.) Also, she didn't try to break his ribs like Jason, even though she could have.</p>\n<p>            \"Take care, brother,\" she murmured in his neck.</p>\n<p>            \"You too. And look after Frank,\" he added, making her laugh.</p>\n<p>            \"Don't worry, I'll monitor him and Reyna,\" she assured. \"Since we both know they're completely inadequate and incapable.\"</p>\n<p>            \"More seriously, obviously Reyna can deal on her own, but I'd like it if she didn't have to,\" Nico admitted. \"So, please, do look after her too.\"</p>\n<p>            She kissed his cheek. \"You can count on me.\"</p>\n<p>            \"I know. Thanks.\" He squeezed her hand. \"See you, sis.\"</p>\n<p> </p>\n<p> </p>\n<p>            Hand-in-hand, Hazel walked him to the Big House, before continuing on her way to the strawberry fields to join up with the last of the Romans that were still packing up. Nico stood on the porch to watch them go. Satyrs and wood nymphs were already starting to fill in the trenches; soon the last traces of the field camp would be completely erased. It had only been there for a few days, yet the empty space already looked weird. Nico easily picked out Frank's bulky silhouette amongst the small crowd, but it took him a few seconds to realize the prætor was waving at him and not Hazel. Nico waved back, then recognized Reyna and a few of the centurions, and waved at them too. He smiled as Reyna answered with — as far as he could tell from this distance — a perfectly proper Roman military salute. Dakota seemed to almost drop something, but he saluted as well.</p>\n<p>            Then everyone turned around and started trudging up the hill to the SUVs, and Nico walked inside the house.</p>\n<p> </p>\n<p> </p>\n<p>            Nico had never been in the infirmary. The door squeaked awfully when he pushed it. A half-dozen blond heads immediately peeked out of white draperies and he had to crush the urge to apologize for the disturbance and run away.</p>\n<p>            Then Will Solace's mop of sunny hair and scowling face emerged as well from between draped sheets in the back of the room.</p>\n<p>            \"<em>How's it going, Will?</em>\" Nico deadpanned.</p>\n<p>            \"About time,\" Will snapped, then gestured vaguely in the direction of a table crumbling under supplies, across the aisle from him. \"Get me a roll of bandage, will you?\"</p>\n<p>            Every single one of his siblings was closer to him than Nico was, but they were also clearly much busier. Staring notwithstanding. So Nico trudged across the room, trying not to trip on boxes of supplies and empty medicine bottles and not to feel self-conscious about all the eyes fixed on him, not to brace himself for the incoming nervous comment that maybe it wasn't very wise to let a child of Hades in an infirmary full of wounded people.</p>\n<p>            Except one by one, each of the medics seemed to lose interest in him once it was clear he wasn't bringing any particular news or in need of urgent attention. Nobody said anything, nobody glared; only a couple of girls watched with curiosity as he did as he was told and slipped between the white sheets.</p>\n<p>            Will didn't look up from his work and almost snatched the roll out of Nico's hand.</p>\n<p>            \"Give me a couple minutes to wrap this up — so to speak,\" he muttered as he finished bandaging his patient's elevated leg at an impressive speed, \"and I'm all yours.\"</p>\n<p>            The wounded boy — Cecil from Hermes cabin — grinned at Nico.</p>\n<p>            Nico kept carefully quiet.</p>\n<p>            \"Cut this.\"</p>\n<p>            Nico looked around for the scissors and cut the bandage between Will's hands.</p>\n<p>            Will finished up, slapped Cecil's thigh lightly in a <em>There, all done, you idiot</em> manner, and spun around on his spinny stool to face Nico.</p>\n<p>            \"All right,\" he said. \"Now, let's make a bullet list of everything you need fixed, aside from the attitude.\"</p>\n<p>            \"Is it morally okay to stab a medic with their own scissors?\" Nico asked Cecil. (Not that he usually cared about morally okay, as Octavian might demonstrate.)</p>\n<p>            Cecil grinned even wider, then winced; the bruise on his face was starting to fade, but clearly it still hurt. \"I'd tell you <em>sure</em>, but this one curses.\"</p>\n<p>            \"Hey, man, don't you go giving away my secrets,\" Will protested, rising from his seat.</p>\n<p>            \"How is the rhyming for a week a secret? It's kind of hard not to notice!\"</p>\n<p>            \"Ah, but I've got more than just the rhyming string to my bow,\" Will said lightly. \"C'm'on, Nico.\" He put a hand on Nico's shoulder and veered him away from the sickbed.</p>\n<p>            \"The gods be with us,\" Cecil prayed, dramatically. He did the three-clawed sign of warding evil. \"That we may be spared from haikus.\"</p>\n<p>            Nico shuddered, but let Will lead him away.</p>\n<p> </p>\n<p> </p>\n<p>            There was worse than haikus. Worse even than fighting armies of monsters.</p>\n<p>            There was hands-on medical care.</p>\n<p>            \"And what in Hades is <em>this</em>?\" Will sounded personally offended.</p>\n<p>            \"Werewolf scratches,\" Nico muttered. He tried to pull his arm back. Will did not budge. For a non-fighter, he had surprisingly strong hands. Nico wondered if that came with being a medic.</p>\n<p>            \"<em>Scratches</em>,\" Will repeated coldly. \"I see. 'Tis but a <em>scratch</em>. Now, I'm only a humble son of the god of medicine with a mere few years of training as a healer, but I could've sworn the word for this was <em>lacerations</em>. Perhaps <em>gashes</em> or <em>gouges</em>. Alternately, <em>freaking serious wounds</em>. Of course, if you <em>assure </em>these are <em>scratches</em> —\"</p>\n<p>            \"Well, they're not bites, at least! We stitched them up and I barely feel them anymore!\"</p>\n<p>            \"Yeah, I guess you <em>could</em> call that <em>stitching</em>.\"</p>\n<p>            Will finally let go of his biceps to rummage amongst his supplies and Nico contained a sigh a relief. He didn't know if it was a child of Apollo thing, a Will thing, or a <em>Nico's problem </em>thing, but the tingly warm feeling like an electrical current whenever they touched didn't pass.</p>\n<p>            Three days, Nico remembered.</p>\n<p>            The infirmary wasn't at all as bad as the idea of hospitals he'd formed from his childhood. It was a large, airy room, with plenty of space around the sickbeds and lots of natural light from the wide windows. Nico was sitting on a chair right next to one open window; he wasn't even lying in bed yet, the drapes weren't even drawn, but he felt cornered. Trapped.</p>\n<p>            Will's fingers passed through his fading hand, but caught his wrist. \"Ooh no you're not. You promised on the Styx.\"</p>\n<p>\n<em>            Damn it.</em>\n</p>\n<p>            \"I'm keeping you five more days for every time you try that again,\" Will said, very seriously, looking him right in the eyes. Nico avoided his gaze.</p>\n<p>            \"You'd need to find me first,\" he grumbled, very aware of how petulant he sounded and not at all caring. Will's hand was <em>too warm</em>.</p>\n<p>            \"I'd find you.\"</p>\n<p>            He didn't know how to respond to that.</p>\n<p>            \"Nico, you promised,\" Will repeated, more quietly.</p>\n<p>            \"I didn't promise <em>this</em>, technically,\" Nico muttered. \"I only promised I'd be back.\"</p>\n<p>            He couldn't look at Will's face, much less his eyes, but he could feel Will's pale blue gaze on him anyway.</p>\n<p>            \"I'd like you to stay,\" Will whispered, his warm, warm hand holding (anchoring) Nico's barely-there wrist.</p>\n<p>            There was really already no helping Nico, was there.</p>\n<p>            Nico swallowed and nodded wordlessly. Will held on to his wrist for a few more seconds, before nodding as well, shakily, and finally letting go.</p>\n<p> </p>\n<p> </p>\n<p>            Will busied himself immediately with getting to work on Nico's werewolf scratch-slash-serious-wounds. They were both pretty badly infected, unsurprisingly, but nothing a son of Apollo couldn't handle.</p>\n<p>            \"It'll scar,\" Will warned while cleaning up the gashes with nectar. \"I'll give you some ambrosia if necessary, but even if you'd had proper treatment at the time, it would have.\"</p>\n<p>            Nico shrugged with the shoulder that wasn't currently being poked at with a swab of cotton. There was little he cared about less than some wound scars, as big as they were likely to end up. They weren't really ruining much.</p>\n<p>            \"Had worse, huh?\"</p>\n<p>            \"Not in terms of scars, actually, no.\"</p>\n<p>            Will smiled, though since he wasn't looking up, he made a slightly disturbing picture, grinning at an open, oozing flesh wound. \"Yeah, you're usually too good to let any hits land. You came out of Manhattan with barely a scrape. How did this even happen?\"</p>\n<p>            Nico coughed. \"I kind of strategically let it happen.\"</p>\n<p>            At this, Will did look up and gazed at him, sublimely unimpressed. \"Have I ever told you you've got a serious self-preservation problem, di Angelo?\"</p>\n<p>            <em>Tell me something I don't know</em>, Nico thought, but didn't say — Will jabbed his nectar-imbibed cotton swab on an already particularly painful part of the wound and the additional burning drew a sharp hiss past his gritted teeth. Will focused on his task again.</p>\n<p>            A few minutes passed in silence. Will moved his stool to Nico's other side to take care of his second arm. Finally, he straightened up.</p>\n<p>            \"Here.\" He did the <em>all done </em>slap thing again — the back of his hand against Nico's biceps, well under his wounds. \"Let this air out a little, I'll come back and put salve on it in a bit, and redo the stitches properly later. Now, start by trying and getting some rest!\"</p>\n<p>            \"I'm fine,\" Nico protested. Will stared down at him critically and Nico got the sudden feeling that he was counting the hours since Nico had last gotten any sleep. (Only a handful of days. He'd caught some Z's on pegasusback, on the way to the battlefield.)</p>\n<p>            \"Do I have to put you in bed myself, di Angelo?\"</p>\n<p>            Nico flushed.</p>\n<p>            It'd been a while since he'd been treated like this. People usually didn't know how to deal with his scrawny appearance and general Hades aura, and either treated him like a child (which he hadn't been for a long time), or like some sort of non-human monster. His friends were different (and nice. Really nice.), but Will's approach to Nico wasn't like that either. Will apparently just considered him to be a regular idiot.</p>\n<p>            He was wrong, of course, and pretty infuriating, but Nico appreciated the 'regular' part.</p>\n<p>            He got in bed. Will adjusted his arms to make sure the wounds didn't rub on the mattress, flicked a strand of Nico's still slightly damp hair out of his eyes with one finger, and got up and walked away just like that before Nico even had the time to process the gesture.</p>\n<p>            He burrowed into his pillow, fully intending on sulking visibly for a few long hours of insomnia.</p>\n<p>            And sank into darkness like a stone in a lake.</p>\n<p> </p>\n<p> </p>\n<p>            He dreamed, of course. His limbs turned to smoke and tendrils of darkness and he liquefied and spread into the dark realm of Hypnos.</p>\n<p>            It looked as usual, dry, cracked earth, dead trees, empty. At least there wasn't any flashback or vision this time. Some people found it hard to sleep well after a battle, but perhaps for demigods the aftermath of war meant a temporary break. Time-out while monsters, too, recovered, and gods thought up new prophecies and curses. There were just harmless fragments of scenes here and there, flashing on the grey sky like a giant movie screen — Reyna driving one of the SUVs down a highway, Michael Kahale sitting shotgun with the map like Octavian had never existed. Frank and Hazel sleeping in the back of another car, arms tucked around each other. Sun-speckled woods, Artemis running amongst her hunters, Thalia Grace right behind her, their numbers drastically reduced but their prey just the usual, normal huge monstrous boar. Rachel Elizabeth Dare sitting on the floor before a statue of Apollo, surrounded with blank canvases. Percy and Annabeth sitting together in front of the fountain in the Poseidon cabin, holding conference Iris-Messages with both their mortal families through two separate rainbows. Jason and Piper lying side by side on a roof Nico didn't recognize, under the night sky, she pointing out Cherokee constellations and he straightening his glasses to see. Leo, standing in the Underworld, still burning.</p>\n<p>            Clovis drifted by, muttering something about Roman couches. Nico wasn't even sure Clovis had been awake to <em>meet</em> any of the Romans.</p>\n<p>            The sun came up. Light rippled on the waves of vibrant green tall grass that now suddenly covered the ground. Nico shielded his eyes on instinct, expecting to be blinded, but he wasn't. He felt the warmth of the rays of light on his arms — his arms were back, finding their shape again and solidifying into it — but he could face the sun straight on and not have to look away.</p>\n<p> </p>\n<p> </p>\n<p>            \"Wake up, sunshine!\"</p>\n<p>            Nico jerked awake reaching for his sword, as per the standard demigod procedure. The warm hands left his cheeks and were put up in the air.</p>\n<p>            \"Whoah there! Calm down, just a harmless son of Apollo here. No need to get violent.\"</p>\n<p>            \"Please stop doing that,\" Nico groaned.</p>\n<p>            \"Sorry, I'm a healer, personal space is a hindrance to treatment, deal with it,\" Will recited cheerfully, and patted his cheek again. Shame Nico didn't have his sword. \"Did you sleep well?\"</p>\n<p>            The infirmary was much quieter than it had been... whenever Nico had dozed off. The drapes around his bed were now drawn, but only on his left side; on his right, Will had pulled them back and Nico could see out the window. The sky was an eerie, fragile shade: delicate blue, very lightly tinted with shy hints of yellow. Looking at Will's sun-dark face against that backdrop, it occurred to Nico that his eyes were the same color, like they were just another window Nico was looking at the sky through. He pushed away that thought and blinked. \"How long...?\"</p>\n<p>            \"The entire day and right through the night, apparently. It's dawn. I think you'd have happily snored right on to tomorrow morning, but it's really about time I stitch you back up.\"</p>\n<p>            Nico glanced down at his arms. Both of his biceps were covered in a shimmery light-green paste of some sort — he'd slept through that, unsurprisingly. He was pretty sure he could have slept through the stitching, too.</p>\n<p>            Will set about rinsing off the salve. This apparently necessitated plopping down on the bed, grabbing Nico's arm, and putting it on his thigh.</p>\n<p>            Nico was probably going to get used to it <em>eventually</em>, but Will was wearing cut-off shorts today and his thigh was even warmer than his hands and Nico wasn't quite as ready for this as he'd honestly thought.</p>\n<p>            \"Sorry,\" Will said again suddenly, without looking up, as he removed Nico's arm and rose. \"Did I spook you?\"</p>\n<p>            Nico blinked again, not that the other boy saw it. \"I thought <em>I</em> spooked you.\"</p>\n<p>            \"What?\" Now Will looked up, and it turned out he resembled a puppy when he was confused. A big puppy. Not a hellhound puppy, though, more like a golden Labrador.</p>\n<p>            And <em>that</em> was not a thought to linger on right now either.</p>\n<p>            \"Well, you know,\" Nico muttered. \"The Octavian... thing.\" World-saving. Murder. Assisted suicide. Whatever.</p>\n<p>            \"Oh.\" Will fell silent and looked away again. He walked around the bed, a little more slowly than his usual springy gait, and didn't speak again until he'd sat back down on Nico's other side. He left Nico's arm on the mattress this time. \"Well,\" he eventually said as he finished cleaning up and opened another jar. \"We'll definitely have to talk about Octavian, but honestly, I can already kind of get why you did that. I... <em>don't </em>understand, or approve, but I'm guessing it's a Hades thing. I can see how it could make sense to you. Anyway. It's not like the bastard didn't deserve it.\"</p>\n<p>            Nico snorted. Will smiled, wryly, with just of one corner of his mouth. It wasn't a very Apollo expression, but it reminded Nico of the god all the same. A little. Will had his moments, but he wasn't <em>that</em> bad.</p>\n<p>            Will dabbed an<em>other</em> glittery cream on each of his biceps. Little by little, the sensation of his warm fingers on Nico's skin started slowly fading.</p>\n<p>            \"What I meant,\" he resumed, then turned quiet again. \"I thought I'd weirded you out when you disappeared after the battle. Sorry if you... if I...\"</p>\n<p>            Nico had no idea how he worked the words out of his dry sandpaper mouth. \"So, you really...\"</p>\n<p>            Will shrugged. \"I thought it was pretty obvious.\"</p>\n<p>            It was, really. It made sense. It was basically written all over him. Nico had <em>known</em>. But it was the hardest thing in the world to believe <em>because</em> Nico could tell; because Will wasn't hiding it. That he could look this at ease, be this comfortable, letting everyone he knew know this about him, not being ashamed at all and not being<em> scared</em>. Jason had said, back in Croatia, that all his friends would support Nico, and Nico had wanted to tear him apart for even saying that, incapable at the time to believe even Jason wasn't thinking about putting him down like a degenerate dog.</p>\n<p>            Yet here was Will, just shrugging, smiling somehow his sun-god smile.</p>\n<p>            He realized he'd been silent too long when Will stood. \"I'll go wash my hands while the anesthetic gets to work,\" he said abruptly. \"Be right back.\" There was a beat during which Nico saw him breathe out like he was deliberately thinking about it, before he turned and walked away, disappearing behind the hanging sheets.</p>\n<p><em>            It's <strong>fine</strong></em>, Nico had to remind himself when he could think again. <em>It's fine. Breathe.</em></p>\n<p>            He had use at this, at controlling this, at hiding this, and apparently he did it pretty well too. Breathing in, breathing out was such an old trick he barely even thought about it anymore, kicked into the habit on autopilot like a defense mechanism.</p>\n<p>            It was still sheer, instinctual panic that he dealt with, every time. His sight going dark for a moment (one year of confusion, lost in darkness with only ghosts and hatred for company and Minos' venomous whispers hissed into his ears), his hands and arms and legs shaking (one year of knowing exactly what was wrong with him and being paralyzed with the terror of being found out), wave after crushing wave tipping him over, sweeping his feet under him, leaving his head spinning (one year of Percy Jackson being the single thing left in his entire world that mattered anymore), his heart collapsing in on itself, crushing him from inside, his body stopping to function for the span of a beat in the hope of just dying now and sparing himself the pain. That didn't disappear with a few words and a good night of sleep. Just because when he was taken out of the Lotus Casino, political debates around the world were starting to entertain the notion that love might not be monstrous, didn't erase the hard fact that when he'd walked in, seventy years earlier, people like Nico were being rounded up in his country of birth like cattle to be butchered.</p>\n<p>            Of course Will wouldn't do that to him, Jason wouldn't do that, even Percy wouldn't do that. He knew this, intellectually. He also knew, factually, that his mother had said <em>The gods wouldn't do that to us </em>barely a minute before Zeus burned down an entire hotel trying to kill Nico and his family.</p>\n<p>            There was a world of difference between telling Percy about a finally dead and gone crush, and taking <em>this</em> leap. He hadn't expected anything from Percy in return. He'd wished, perhaps even hoped, stupidly, for years, sure; but he had never expected anything from him. He'd never <em>had</em> Percy, never had any chance to have him, didn't have anything to lose or keep.</p>\n<p>            Will was offering <em>something</em>. There was a possibility, there, hanging ripe like the fruits over Tantalus's head back down in Tartarus, right in front of his mouth, and the only thing as ravaging as Nico's want to bite into it was the fear of doing so. The branches didn't even have to inch away because Nico couldn't even bring himself to reach out.</p>\n<p>            But then again, just a few months earlier he couldn't have imagined ever telling Percy anything at all. Telling anyone.</p>\n<p>            He breathed in again.</p>\n<p><em>            The people who matter are okay with this,</em> he hammered into himself. Breathed out.<em> And you're okay with this.</em></p>\n<p>            Well, he would be, one day, maybe.</p>\n<p>            Definitely.</p>\n<p>            He breathed in a third time.</p>\n<p>            \"It's fine,\" he said when Will slipped back through the sheets.</p>\n<p>            Will met his gaze head-on. \"Really?\"</p>\n<p>            Not just yet. Those years and those facts were never going to not be there, to not have happened, never going to not matter. But one day, they wouldn't hold him back anymore at all, just like they hadn't held him back, the morning before, from looking Percy in the eye and just spilling out, tongue and heart and guts and the shaking inside his bones.</p>\n<p>            Just like Will, who wasn't alive in nineteen forty, who was not only telling him but showing him that in this century, he could stand in the sun and survive, maybe even live.</p>\n<p>            \"I'm working on it,\" Nico admitted. \"But yeah, really.\"</p>\n<p>            Will nodded and sat back down on the side of the bed, close again, but not too close, and whipped out a sewing needle and some more disinfectant. Nico closed his eyes and gritted his teeth on instinct, but he didn't feel anything. Eventually, he opened his eyes and watched, disconnected, Will slowly weave his skin back together.</p>\n<p> </p>\n<p> </p>\n<p>            After that, Will brought him a Nintendo DS with a game of Pokémon and Nico discovered that he'd missed two whole generations since the Lotus Casino, so Infirmary Day 2 was starting out pretty well after all.</p>\n<p>            The rival character was a little piece of self-centered crap, though. Will laughed to his face when Nico mentioned this.</p>\n<p>            Around him, the infirmary woke up slowly. He couldn't see, but he could hear: moans, groans, hushed whispers, the shuffling of feet and the ruffling of bed sheets and surgeon shirts, the uncapping of bottles and jars and the spilling of pills or nectar. Will dropped something and swore under his breath, and someone tried to smother their laughter.</p>\n<p>            Nymphs brought breakfast and Will popped by again to give Nico some ambrosia with that and verify that he ate more than a few grains of cereal — which he happily did, thank you very much. His appetite had almost returned to what it had been before the bronze jar and the death trance-induced diet. People could stop obsessing over that anytime now.</p>\n<p>            Around Nico's third Gym, the Aphrodite kid who'd been complaining about his injury (from just the conversations it was hard to tell whether he was really overblowing it, or the medics were all really nonchalant) started mysteriously talking in limericks. That succeeded in shutting him up pretty fast.</p>\n<p>            Then a competition to annoy him into speaking again sprang up in that corner of the room. Turned out there were a <em>lot</em> of children of Nike and Nemesis in the infirmary. (Apparently he, and everyone else in the room, 'had it coming'.)</p>\n<p>            The Apollo cabin's questionable response to that was to start dealing out <em>more</em> curses, and get creative about it. Cecil did get the haikus (Nico suspected he'd started making a nuisance of himself solely in the hope of this), and a daughter of Athena was so delighted to get afflicted with elegiac couplets that they changed it to beatboxing. A poor shy ten-year-old kid from Hephaestus cabin was cursed to spout out what Nico was pretty sure were entire Shakespearean sonnets every time he wanted to ask for a glass of water. Some were harder to identify, though.</p>\n<p>            \"What's Butch speaking in?\" Nico asked discreetly when Will next checked up on him.</p>\n<p>            Will grinned and whispered in his ear, \"Acrostic. Butch's pretty nasty.\"</p>\n<p>            Nico mentally replayed the last sentence he remembered. \"... <em>Gods.</em>\"</p>\n<p>            Will laughed and ruffled his hair.</p>\n<p>            All in all, it was a pretty okay day.</p>\n<p> </p>\n<p> </p>\n<p>            On the third day, he woke up suddenly, in the wee hours of the morning, completely unbalanced. Physically, he was as okay as he'd been the last few days, he could sit up just fine, but there was something <em>wrong </em>— no, not wrong. <em>Different</em>. There was something <em>different</em> but very right with the world as he sensed it.</p>\n<p>            The underworld population, he realized. Of course, it expanded every second, and he didn't usually keep track of it, but even without doing any calculation, he could feel that the headcount had shifted in a completely unnatural way.</p>\n<p>            There was one less dead than there had used to be.</p>\n<p>            \"Leo Valdez,\" he said aloud.</p>\n<p>            \"Seriously?\" Will's voice said.</p>\n<p>            Nico really should have jumped. He didn't. He looked to his right and was not surprised at all to see Will sitting at his bedside, in front of the window, his dark silhouette detached on the paling sky. It was strange to see him bathed in shadows for once, instead of the usual all-but-literally-glowing, but it didn't look bad.</p>\n<p>            \"What are you talking about?\" Nico asked as if there was nothing unusual about this situation.</p>\n<p>            \"I look after you tirelessly day and night and you reward me by saying another guy's name in your sleep? I'm wounded, di Angelo.\" Will's pout was visible in the dark. It would probably have been visible from the moon.</p>\n<p>            Nico felt the tips of his ears burn, but nothing more. He just rolled his eyes. \"It's not that. I just felt Leo Valdez leave the Land of the Dead.\"</p>\n<p>            Will's eyes were so pale it was also easy to tell when he blinked. \"Huh. Why am I not even surprised?\"</p>\n<p>            Nico snorted and tried to shuffle out of bed. \"I should go tell Jason and Piper.\"</p>\n<p>            \"You're staying right where you are, young man, you still owe me one day. I'll wait till it's decent o'clock and send somebody to tell them. Or to call them here, if you want to drop the bomb yourself.\"</p>\n<p>            \"I've been here two nights, isn't that three days?\"</p>\n<p>            \"Three full days. I'm checking you out this evening.\"</p>\n<p>            \"The details of this deal keep changing,\" Nico pointed out, but he didn't even try to sound like he minded.</p>\n<p>            Will reached over and patted his head, the tips of his fingers brushing along the shell of Nico's ear. \"Shh, I might suddenly discover you have a very serious condition that requires one more week of rest and round-the-clock personal supervision.\"</p>\n<p>            Nico felt his flushing reach well past his ears and hoped Will couldn't see that. He swallowed and only said: \"I'm sure your other patients would miss you.\"</p>\n<p>            There was a beat, during which Nico tried and failed to decipher Will's expression in the dark, then Will got up and pulled his bed sheets back to his neck. \"Let's see if we can get you some more sleep, and I'll take a look at your arms when you wake up.\" A grin, that was what it was. Nico still couldn't make out his mouth for sure, but he could hear it, clear as crystal, in Will's voice.</p>\n<p>            Nico nodded and closed his eyes.</p>\n<p>            It may have just been a variation on an apollonian hymn, or perhaps Will was simply humming too quietly to hit shrill notes. Either way, the lullaby didn't sound terrible at all, and Nico was back into the arms of Morpheus in seconds.</p>\n<p> </p>\n<p> </p>\n<p>            The drapes rustled. One particular mop of shaggy sunny hair popped through the slit.</p>\n<p>            \"You awake, Skull Kid? Here comes Captain America,\" Will announced, then slipped out of sight again.</p>\n<p>            Nico sat up, rubbing his eyes, as Jason maneuvered his bulky frame through the sheets. \"So this is where you've been!\"</p>\n<p>            Oh. \"Sorry, I didn't say...\"</p>\n<p>            \"No, no!\" He was grinning. \"I'm glad you're getting rest.\"</p>\n<p>            Was <em>everyone</em> in on the Fuss Over Nico Like A Child plan? He preferred not to ask. \"I've got good news,\" he said instead. \"Where's Piper?\"</p>\n<p>            \"Taking care of some cabin trouble. Drew got in a love rivalry over a son of Mars, they're having a duel to the death to decide who'll get to chase after him to Camp Jupiter.\"</p>\n<p>            \"Didn't Chiron forbid duels to the death?\"</p>\n<p>            \"Yeah, but Dionysus is back and thinks it sounds like a fun idea. Piper is trying to get them to make friends and go together instead, I think.\"</p>\n<p>            Nico snorted. \"Let's hope they don't kill each other on the way anyway.\"</p>\n<p>            Jason looked around for a seat and eventually borrowed a stool from the neighbor. \"So, what's the big news?\"</p>\n<p>            Nico told him. Jason Grace, only known mortal son of the ruler of the gods, ex-prætor of the Twelfth Legion Fulminata and basically every fantasy of the perfect man rolled up together and incarnated into one sixteen-year-old powerhouse fighter, who had managed with difficulty to keep a manly composure all through the last few days of grieving for his best friend, cried like a baby and had to take off his glasses. It was embarrassing for the both of them and Nico didn't regret it for a second.</p>\n<p>            Of course, since this was about Leo Valdez, once the shock wore off, the crying and laughing quickly turned to frustrated annoyance.</p>\n<p>            \"Okay, but what did he <em>do</em> and where in <em>Hades</em> is he now?!\" Jason griped.</p>\n<p>            \"<em>Not</em> in Hades anymore, at least,\" Nico shrugged. \"But I can't feel him anymore at all, and that's a pretty good sign.\"</p>\n<p>            Jason sighed loudly, but he couldn't seem to stop himself from smiling. \"What could that idiot be up to now?\"</p>\n<p>            \"Hopefully not pissing off another primordial divinity. I don't doubt he'd be capable, but I've been thinking of catching up on sleep for the next year.\"</p>\n<p>            \"You, sleep? Perish the thought.\" Jason's new permanent smile extended into a grin, then softened again. \"That aside, are you feeling okay?\"</p>\n<p>            \"I'm <em>fine</em>,\" Nico sighed for probably the hundredth time this month. \"I'm only here with orders to rest, and I'm getting it.\"</p>\n<p>            \"No — I mean, that's good, but I meant...\" Jason looked around a little nervously. The neighbor (Nico was pretty sure it was an Ares girl, but whoever it was hadn't spoken since he'd been there) shifted around in their bed and let out a small whine; the drapes rustled as a medic rushed to their side. \"You're okay here?\" Jason whispered.</p>\n<p>            Nico blinked.</p>\n<p>            \"Since you're fine,\" Jason trudged on awkwardly. \"Wouldn't you be better in your cabin? All the wounded aren't bringing you down? It's... I mean, even for <em>you</em>, isn't it a bit suffocating?\"</p>\n<p>            \"What?\"</p>\n<p>            \"Like. The atmosphere? The noise?\"</p>\n<p>            \"What's wrong with the noise? It's better than having no one around, and still pretty quiet. You know how Leo says he loves the sounds of machines, how white noise is more comforting than silence?\"</p>\n<p>            \"But these are...\" Jason looked in <em>pain</em>. Nico watched him fidget uncomfortably for a few more long seconds before the penny <em>finally</em> dropped.</p>\n<p>            \"Nobody here is close to death,\" he clarified, waving his hands. \"These are the sounds of people healing, not dying.\"</p>\n<p>            Jason's mouth did a little <em>o</em> shape.</p>\n<p>            \"That's good to hear,\" Will noted. He slipped between the drapes; Jason started and made to rise from his stool, but Will just stepped around him and casually sat down on the edge of Nico's bed.</p>\n<p>            \"I suppose I should've mentioned it earlier,\" Nico muttered. He both knew very well that other people didn't sense the same things he did, and kept forgetting about it, because... how <em>did </em>people <em>not</em> sense and know that stuff?</p>\n<p>            \"Better late than never,\" Will said with a wave of his hand. \"Maybe Clarisse will finally believe now that Chris won't die from a broken arm.\"</p>\n<p>            \"And you'll believe that I won't turn to smoke if you look away for a second?\"</p>\n<p>            \"Nah. Give your arm here.\"</p>\n<p>            Jason's gaze jumped back and forth between them as Will observed the wounds critically and changed the bandages. Nico scowled at him. Jason remained silent, but he looked very, very pensive.</p>\n<p>            <em>Don't</em>, Nico mouthed.</p>\n<p>            He did <em>not</em> like Jason's sly grin.</p>\n<p>            \"I'm glad,\" Jason whispered when Will had left.</p>\n<p>            Nico gave into the urge to burrow his face in his hands. \"Shut up.\"</p>\n<p>            \"Good luck!\"</p>\n<p>            \"Shut <em>up</em>, Grace.\"</p>\n<p>            \"If you need me to beat him up for any reason —\"</p>\n<p>            \"I swear on the Styx, Grace — like I couldn't beat him up myself, anyway!\"</p>\n<p>            Jason looked positively <em>giddy</em>. \"True, true. I can trust you to take care of yourself. But I <em>like</em> taking care of you!\"</p>\n<p>            Oh, gods. It was true. Reyna had officially handed Nico-babysitting duty over to Jason before leaving.</p>\n<p>            \"Go away and go tell Piper and Hephaestus cabin,\" Nico said haughtily.</p>\n<p>            \"You got it. I'll Iris-Message Hazel and Frank, too.\"</p>\n<p>            \"She's probably felt it, too, but yeah, thanks. Tell her I said hi.\"</p>\n<p>            \"I'll tell her you're doing <em>great</em>.\"</p>\n<p>            \"Don't you dare, Grace.\"</p>\n<p>            Jason ruffled his hair before leaving. What was <em>up</em> with that.</p>\n<p> </p>\n<p> </p>\n<p>            \"So, you a Pokémon Master yet?\" Will asked, plopping down next to him at the end of the afternoon.</p>\n<p>            \"Not yet,\" Nico muttered, ashamed to admit it. He remembered finishing version Blue a lot faster than this. \"I'm almost to the League. But I slept a lot...\"</p>\n<p>            \"Dude, I'm kidding!\" Will rolled his eyes. \"There are like, almost five hundred in this one, and you were <em>supposed </em>to sleep a lot! In two days, that's pretty impressive. I never got that eighth badge.\"</p>\n<p>            A part of Nico that he'd thought had died a long time ago uncoiled inside of him like a tightly-wound spring and filled his head with screams: <em>What do you mean, you started playing a game and stopped before finishing it 100%?!!</em></p>\n<p>            Maybe he couldn't get along with Will after all.</p>\n<p>            \"You can keep it if you want to finish it,\" Will offered. \"Hopefully it'll keep you still and calm for a few more hours.\"</p>\n<p>            Orrr maybe Will was pretty okay.</p>\n<p>            \"Thanks,\" Nico said, controlling his voice to hopefully not sound as pathetically thrilled as he felt. One thing that had never changed since nineteen thirty-eight, even in the Casino: overenthusiastic geeks and nerds weren't cool.</p>\n<p>            Will smiled, though, so maybe he had as terrible taste as Nico did. \"A'right, so. You're officially discharged. Do shower, but no swimming, no soaking your arms in water for at least a week. Drop by in a few days to change the bandages, we'll see when we can take them off for good. Avoid stretching those muscles, and if at all possible, try to avoid Underworldy stuff and getting killed for a few more days, 'kay?\"</p>\n<p>            \"I'll do my best,\" Nico rolled his eyes. \"And it's called 'powers of the dead', thank you very much.\"</p>\n<p>            \"Whatever, Death Boy.\"</p>\n<p>            Nico was too busy being pissed at him to remember he hadn't stood up since his last bathroom break, over twenty-four hours ago; his legs slipped out from under him, smoothly as sliding into shadows. For a fraction of a second, he actually thought he'd accidentally shadow-travelled again, but then Will's unfairly-strong-and-warm hands caught him under the armpits and the dizziness and sensation of free-fall didn't stop, so it couldn't be that.</p>\n<p>            \"You're good at swooning. You should do it more often,\" Will chirped in his ear.</p>\n<p>            It deserves to be noted that Nico did not, in fact, punch him in the face. Whether or not it was only because his arms were also currently jelly remains up in the air to this date.</p>\n<p>            \"Okay, I've met your dad, and you <em>did</em> inherit some other stuff from him than healing abilities,\" he said instead.</p>\n<p>            Will clutched at his heart and said, \"<em>Aouch</em>,\" but not before making sure Nico was stable on his legs again.</p>\n<p> </p>\n<p> </p>\n<p>            And so off Nico went, back to his empty vampire cabin, which was <em>definitely </em>in need of serious redecorating, but he had about three hundred more critters to collect first.</p>\n<p> </p>\n<p> </p>\n<p>            On August 8, Chiron decided the heads of the cabins had had time to get over their various scrapes and the most urgent post-war issues, and called a counselors meeting. Clarisse La Rue and Will Solace were dragged out of the infirmary, and Jake Mason attended for the Hephaestus cabin once more, looking a lot better now that he knew he was only representing and not taking over for another dead counselor after all.</p>\n<p>            The main points of discussion were of course the friendship programs with Camp Jupiter (Percy and Annabeth were appointed, obviously), the fact that the Apollo powers of divination still weren't working (Rachel went red as her hair, but everyone comforted her and repeated that they weren't holding her accountable), and an oath Jason had apparently made to build shrines to all minor gods and goddesses, which quickly brought up the question of whether cabins should also be built for all concerned parties.</p>\n<p>            \"Has Kim ever even <em>had</em> mortal children?\" Percy wondered aloud. Nico had no idea who he was talking about, but nobody else aside from Jason seemed to, either.</p>\n<p>            \"Does it matter? Hera and Artemis have always had cabins to their names,\" Lou Ellen pointed out. She didn't add <em>unlike <strong>some</strong> people</em>, but she may as well have, with how loud and clear everyone got the message and how high her cocked eyebrow went.</p>\n<p>            \"Should we make fifty shrines and cabins for all the Nereids?\"</p>\n<p>            \"Right, the Morpheus and Nyx kids are still asking for their own cabin, too,\" Clovis yawned. \"It'd be better than keeping them in ours. The son of Nyx is awake at night, so...\" He made a vague gesture and dozed off before finishing his sentence.</p>\n<p>            Clarisse insisted that Ares cabin had <em>no problem at all</em> dealing with children of Phobos and Deimos, but they probably would like a cabin of their own as well. Hasty plans for a new wing were drawn. Mr. D grumbled something about prices and having to double the strawberry production and how much he hated being back already. Everyone agreed to help with the construction; Nico promised to summon some undead builders (\"But not too many,\" Will added with a severe glare.). The meeting started getting wrapped up.</p>\n<p>            \"I think that's all we can do for today,\" Chiron declared. \"Does anyone have something else to say before we adjourn?\"</p>\n<p>            \"Actually,\" Jason coughed, \"yeah, I've got another request.\"</p>\n<p>            The Stoll brothers groaned in unison. Long meetings took away from their 'arts and craft' time. Jason smiled at them awkwardly in apology, but stood up to speak again anyway.</p>\n<p>            \"I think we should change the rule about not leaving a boy and a girl alone in a cabin,\" he announced clearly, \"and extend it regardless of genders.\"</p>\n<p>            Nico choked and spluttered, but thankfully, so did half the room. Jason didn't even blink.</p>\n<p>            \"I mean, it doesn't even make any sense,\" he continued without missing a beat. \"Like, we're <em>Greek</em>.\"</p>\n<p><em>            <strong>You</strong>'re not!!</em> Nico thought passionately.</p>\n<p>            Chiron frowned and opened his mouth, but before he could say anything, Will Solace chimed in casually: \"If you need a minimum number of petitioners or something, you can already count on <em>at least</em> half of Apollo cabin. And we can probably get the Aphrodite kids to support, right, Piper?\"</p>\n<p>            Piper was still staring at Jason in bewilderment, but nodded without apparently even thinking about it.</p>\n<p>            Will turned to the fourth side of the ping-pong table, but it wasn't Nico he looked at. \"And Iris?\"</p>\n<p>            \"I am <em>not</em> letting you guys call it The Rainbow <em>Anything</em>,\" Butch warned with a scowl, \"but aside from that, sure. Good idea.\"</p>\n<p>            Next to Jason, Percy found his tongue again and stammered weakly, \"Wait —\"</p>\n<p>            \"That does sound like a fair suggestion,\" Chiron said loudly, finally managing to make himself heard over the chattering, \"but... what rule are we talking about? I do not recall stating anything about that, and if I did I'd certainly not restrict it to opposite sexes...\"</p>\n<p>            \"Oh?\" Jason's cheeks turned pink. \"I thought we might have some trouble getting you to...\"</p>\n<p>            \"Please,\" Chiron scoffed, rolling his eyes. \"I raised Achilles, remember.\"</p>\n<p>            \"... Right.\"</p>\n<p>            \"It started up on its own last year, when Aphrodite cabin got all over Silena and Beckendorf,\" Clarisse explained, boredly balancing a machete on her index finger. \"Nobody really thought of coming to you to officially write it down in the rules book or anything.\" She shrugged. \"Sounds fair to me.\"</p>\n<p>            Percy probably didn't even realize how rudely he was staring at her. \"I thought <em>you</em> of all people would have something mean to say against this,\" he fumbled.</p>\n<p>            Clarisse <em>usually</em> looked at Percy like he was a piece of trash on the sole of her shoe, but right then she eyed him more like a madman. \"Dude, what? I'm bi.\"</p>\n<p>            \"You're <em>what?!</em>\"</p>\n<p>            \"How do you <em>not know</em> that I'm bi?!\"</p>\n<p>            Percy tried to say something, but couldn't find words and just opened and closed his mouth a few times like a fish. Annabeth elbowed him in the stomach anyway, muttering something about how he was an embarrassment and she really couldn't take him anywhere in public.</p>\n<p>            Amongst the small-scale chaos, Nico found he was breathing normally. He wasn't shaking, his face felt normal. Nobody was even looking at him in the turmoil; only Jason caught his gaze for a second, and winked at him quickly, discreetly.</p>\n<p>            Nico couldn't decide between mouthing <em>I hate you</em> or <em>Thank you</em>, so he settled for just squinting at him in annoyance. Mr. Perfect Golden Boy just grinned wider.</p>\n<p>            Twenty-first century, huh.</p>\n<p>            \"Right,\" Chiron added as everyone finally stood, \"and one <em>last</em> thing: how about a friendly game of capture the flag tomorrow afternoon, to raise everyone's spirits?\"</p>\n<p>            \"<em>Friendly</em>?\" Clarisse, Percy, and the Stoll twins repeated in unison and the same disgusted tone.</p>\n<p>            \"Great, another week of infirmary duty,\" Will sighed.</p>\n<p> </p>\n<p> </p>\n<p>            The extent of Nico's thoughts of the topic of the game was that he'd have a quiet afternoon alone in his cabin. If asked, he half expected Jason and Percy to lead opposing teams, probably, because they were <em>kind of </em>best of friends but also had this alpha male competition going, but he wasn't especially intent on seeing it.</p>\n<p>            What he did <em>not </em>expect was for the two of them to ambush him as soon as he walked out of the Big House, coming up at him from each side and throwing their arms around his shoulders conspiratorially.</p>\n<p>            \"Strategy meeting,\" Jason said on his left.</p>\n<p>            \"Do we even <em>need</em> a strategy?\" Percy protested on his right. \"What's wrong with 'let's beat up everyone, it'll be awesome'?\"</p>\n<p>            \"Dude, we'll be going up against your girlfriend. We <em>need</em> a strategy.\"</p>\n<p>            \"Wait, you seriously think we can come up with a plan that'll stand a chance in Hades to whatever Annabeth and her whole cabin cook up?\"</p>\n<p>            \"... 'Let's beat up everyone' it is then.\"</p>\n<p>            \"I'm on doctor's orders to rest,\" Nico deadpanned, just in case.</p>\n<p>            \"We'll go on the offense and leave you the defense, then,\" Jason promised magnanimously.</p>\n<p>            \"Geez, thanks.\"</p>\n<p>            Thus was Nico di Angelo roped into a Big Three Kids Versus The World fight to the death (or at least to the flag).</p>\n<p> </p>\n<p> </p>\n<p>            The strategy lasted about ten minutes.</p>\n<p>            Jason and Percy stationed him near the flag as agreed, then split off, Percy following the creek to patrol the border and Jason crossing it to directly invade the opposing team's turf. Nico took out his sword for appearances' sake, then yawned, got rid of the heavy helmet and crouched down on the forest floor as soon as they'd vanished from his sight. He could hear the occasional splash of Percy's wading in the water, but that was about it for a while.</p>\n<p>            He was <em>probably </em>supposed to pay more attention, but what the heck, it hadn't yet been ten days since the last battle, which, okay, was actually a lot for a demigod, but organized large-scale battles were different from the regular daily run-in with a monster. He wasn't about to overdo it. He'd gotten used to napping his afternoons away, godsdamnit.</p>\n<p>            He did find it weird for Jason to come back so quickly, but the figure was tall, tan and blond and came from the way Jason had left and he had to close his eyes on another yawn, whatever.</p>\n<p>            \"Yo!\" Will Solace said. \"There you are!\"</p>\n<p>            Nico finished yawning abruptly and stared at him.</p>\n<p>            Will wasn't a <em>threat</em>, of course. He had a bow and quiver slung across his back, but Nico had seen him train in the arena: he could barely hit a target from thirty feet away, much less a moving one from this distance. But. \"What in Hades are you doing all the way over here already?!\"</p>\n<p>            Will beamed. \"I run pretty fast, remember? One more thing I did get from Dad, I guess.\"</p>\n<p>            Huh. Right. That could be a problem. Nico eyed the distance between them, trying to recalculate the danger with Will's speed that he remembered seeing in battle and evaluate if Will could possibly get close enough fast enough to take him by surprise. Will sighed and raised his hands.</p>\n<p>            \"I'm not here to try and take you on, don't worry, I'm not crazy. Look, I'm not coming any closer to your flag. Can you just come with me real quick?\"</p>\n<p>            Nico glanced around, even instinctively checked on the shadows in the perimeter (Will rolled his eyes in offense), but there were no traces of anyone around, so no, it didn't seem to be a distraction strategy to get Nico's attention off the flag and he didn't have to go bash Annabeth or Piper's faces in for a <em>frankly disgusting</em> plan.</p>\n<p>            Meaning he could afford to get distracted.</p>\n<p>            Will Solace was a stubborn and annoying guy, anyway, no point in trying to resist, right.</p>\n<p>            \"Sure,\" Nico shrugged. He summoned a half-dozen of skeletons warriors as he got up, to take over. It wasn't until he'd crossed all the way over to Will and noticed the guy was <em>glaring </em>at him that he realized what he'd just done. \"It's not very demanding!\" he justified himself, vaguely panicked.</p>\n<p>            \"Raising the dead is not very demanding?\"</p>\n<p>            \"It's just skeletons, no souls,\" Nico muttered. \"I barely had to think about it. It's just so, you know, they keep some sort of watch on the flag.\"</p>\n<p>            Will squinted at him for a moment, fists on his hips. \"<em>Mmm</em>. You're still standing, so I suppose I'll let you get away with it <em>this once</em>, for the sake of your reputation as reliable team defense.\" Then he whirled around, grabbing Nico's wrist smoothly in the same movement and pulling him along.</p>\n<p>            Nico let him.</p>\n<p> </p>\n<p> </p>\n<p>            Will didn't take him very far. They just followed the creek for a few hundred feet, not even far enough to lose sight of the blue flag, until they reached a spot where the stream made a turn around a big white rock that lay there like it'd just been dropped there by a forgetful deity. It didn't quite earn the name of 'clearing', but there was an opening in the overhead canopy, so that the sun found its way to light and heat up the rocky formation, tinting the normally white stone with a warm yellow glow. The campers called it anything from Zeus's Other, Smaller Fist to The Nugget. To Nico, it just looked like a cheap wannabe-contender to the color of Hazel's eyes.</p>\n<p>            Will climbed up in what seemed like half a second, with the bow and all, all quick long limbs and easy pulls like he weighed nothing, which was ridiculous because he was almost an entire foot taller than Nico and much more healthily fed. He looked down at Nico from atop the rock, bathed in golden sunlight, his shaggy hair making a good stand-in for the halo Nico remembered his father radiated, and extended a hand. \"Hey, come on up here.\"</p>\n<p>            Nico complied, because what else could he possibly do. Will grabbed his hand and heaved him up next to him easily. Nico told the skeletal butterflies in his stomach to calm down and added surfer dudes to his mental list of boys whose existence was totally unfair, after sons of the Big Three, heroes, and taller boys in general.</p>\n<p>            Will said nothing, just took off his red-plumed helmet and slung his bow off his back and sat down on the warm rock, legs pulled up and his arms crossed on his knees, looking immensely pleased with himself. Nico's throat went dry, because there was nothing around to warrant this expression on his face, nothing except Nico's presence, and that was new, all right. Even Hazel's face didn't light up like this when she saw him (and, well, hopefully this was much different from Hazel).</p>\n<p>            \"So,\" Nico said, sitting next to him gingerly (close, but not too close).</p>\n<p>            \"So,\" Will agreed. \"How're your arms?\"</p>\n<p>            \"Fine. Just tingle a bit when I think about it.\"</p>\n<p>            Will hummed, and that was apparently the end of that conversation.</p>\n<p>            \"... Didn't you want to talk about something?\" Nico prodded, uncomfortable.</p>\n<p>            \"Oh, sure. I figured, since I'm here and you're here and we both hate this game, we could have a chat.\" That instant cheery smile was a serious problem.</p>\n<p>            \"You seriously dragged me away from my post on the battlefield to have a chat?\" And the smile tugging at Nico's own lips was a problem as well.</p>\n<p>            \"The strategy,\" Will explained very seriously, \"is twofold: keep you from exerting yourself with <em>Underworldy stuff</em>,\" pointed glare, \"and keep <em>me</em> from putting anyone's eye out. Have I mentioned I can't shoot a bow, either?\"</p>\n<p>            \"I know.\"</p>\n<p>            \"Like, I <em>can</em>, but it's better I don't.\"</p>\n<p>            \"I <em>know</em>.\" He lost his battle to resist the smile. Will's broadened.</p>\n<p>            \"Wait, were you there that time I —\"</p>\n<p>            \"<em>Yeah</em>. Clarisse's face, man.\"</p>\n<p>            Will sighed blissfully. \"Obviously, it wasn't on purpose, but dude. So, so worth it.\"</p>\n<p>            \"Does the Hermes cabin still worship you for that?\"</p>\n<p>            \"Of course. I'll forever be remembered as their hero.\"</p>\n<p>            Nico licked his lips, fidgeted with his silver ring.</p>\n<p>            \"Right,\" Will resumed, suddenly sobering up. \"There were two things I wanted to talk with you about, actually. About heroes forever remembered...\"</p>\n<p>            \"Octavian,\" Nico allowed.</p>\n<p>            \"Yeah.\" Will was looking straight ahead of him, at the skeletons that wandered aimlessly around the flag below, but Nico would've bet he wasn't really seeing them. \"I'd like to hear you explain why you did what you did,\" he said. \"Or rather, what you didn't do.\"</p>\n<p>            One of the skeletons tripped. Nico chewed his lip, looked at his worn-out sneaker, next to Will's feet (he'd traded the flip-flops for open sandals and his toes were spotted with green grass stains and dirt). \"You're a healer,\" he finally sighed, hating how that sounded exactly like how he might have said <em>Thou art a Capulet </em>or <em>You're the sun and I'm a lowly cockroach</em>. \"You wouldn't understand.\"</p>\n<p>            \"You'd be surprised.\"</p>\n<p>            \"I didn't prevent Octavian's death because <em>some deaths shouldn't be prevented</em>,\" Nico recited harshly. \"Could you possibly ever fathom that?\"</p>\n<p>            \"Yeah.\" Will shrugged, unbothered. \"You know, when Mellie was about to give birth, it looked like it might go badly at first.\"</p>\n<p>            \"Really?\"</p>\n<p>            \"Well, it looked like it to us, anyway. Here I was with a non-human mother about to deliver an interspecies child, and I couldn't stop thinking about how many mothers in mythology died in childbirth, and we couldn't even call on Hera for help, and I'd never done this before, obviously, and what if it turned so bad that only one of them could be saved and it came down to me to choose which? Being a medic is as much about death as it's about life, you know.\"</p>\n<p>            \"It... hadn't occurred to me, no.\"</p>\n<p>            Will never looked like he thought about any of that, much too alive and bright and energetic to possibly have ever been brushed by death. Which was <em>stupid </em>— Nico had seen him in Manhattan: if he was first to know exactly how many demigods had died on that battlefield, Will Solace had to be second.</p>\n<p>            It made sense, though; it threw open and into the sunlight a side of Will that Nico hadn't suspected, but which fit him and made the picture a little more complete, a little more human. <em>This is a person, this is how this person thinks, this is how this person goes through life.</em></p>\n<p>            With just this, he felt like he <em>knew</em> Will better, the inside of him, perhaps even understood him, a little bit.</p>\n<p>            Will glanced at him, half-smiling. \"So yeah, I do get how you could say that <em>some deaths shouldn't be prevented</em>. That helps a lot, actually. I think I understand you a little better now.\"</p>\n<p>            Nico started.</p>\n<p>            In the distance, something very heavy fell in the water with a very loud splash. A few voices resonated, Ares and Athena war cries.</p>\n<p>            Will unfolded, extended his legs and threw them off the edge of the low cliff, crossed at the ankle, put his hands behind him to lean on them.</p>\n<p>            \"I would like to understand you,\" he confessed casually.</p>\n<p>            The tips of his fingers almost touched Nico's thigh; he did not, for once, have the urge to crawl away. He stayed there, curled up crouched near the ledge, one leg hanging off, with that warm tingle hovering near his skin. That tiny ghost of a contact, barely a brush, anchored him in this place, in this moment, in this realm of existence, as surely as Will's fingers wrapped around his wrist had, five days before: Camp Half-Blood, end of the afternoon, almost ten days since the defeat of Gaia, land of the living, under the sky, a mile from the beach, miles and miles from death, a beautiful living boy systematically sapping down his walls and trying to reach him.</p>\n<p>            \"All mortals die,\" Nico said, because he was romantic like that.</p>\n<p>            \"Obviously,\" Will commented, but not mockingly.</p>\n<p>            \"It's not a matter of <em>whether</em> a person gets to die or not,\" Nico insisted, because Will had asked, because Will wanted to understand, \"it's just a matter of <em>now</em> or <em>later</em>. And sometimes, one early death, or even ten or a hundred deaths that are permitted to happen earlier or in uglier ways than we'd like, can allow good things to happen for the ones who survive, and that's all that matters, because the ones who live on, the next ones, are the ones who matter. I don't feel bad about Octavian. I only hesitated because I didn't know if it would kill Jason, Piper and Leo. And I decided that even if it did, it had to happen, I had to let it happen, for the sake of everyone else. Of our world, of their world. Everyone has a role in life and in death, and I decided the Fates knew what they were doing and I wouldn't step in, even to save one or four lives.\"</p>\n<p>            \"You could have.\"</p>\n<p>            \"We could have stopped him, yeah. Me, you, Kahale. Octavian could have listened, or just glanced down and saved himself. I decided not to, and so did Kahale.\"</p>\n<p>            Will stayed silent for a while, still staring in the distance. His heels kicked the face of the rock, lightly, in a slow rhythm, as if to punctuate his thinking. A few pebbles fell off the cliff and into the river.</p>\n<p>            \"And so did I, after I heard you,\" Will whispered.</p>\n<p>            Up the stream, Piper's voice rang clear among the tumult, closely followed by a sound strangely evocative of Jason falling face-first on the ground after forgetting how to fly. Nico couldn't bother going to the rescue. His skeletons continued playing Jacks with their own knucklebones.</p>\n<p>            \"See,\" Will started again, \"I've never killed anyone. Routed a few monsters, that's about it. I was a field healer in Manhattan. I trained with a bow afterwards, but everyone agreed I was more useful as a medic. I don't know about killing. But I do know about death, and I know about choices. Like, if Octavian had been wounded, I'd have healed him, of course I would have. But at war or in the infirmary, it's always a matter of prioritizing and timing, and if I'm wrong someone dies that would have survived otherwise. So,\" he concluded, looking back up at Nico and meeting his eyes, \"yes, I can fathom, somewhat.\"</p>\n<p>            \"I'll make sure you never have to kill someone in battle.\" The words were out of his mouth before he could think them.</p>\n<p>            Will's face lit up like the sky at dawn. It probably wasn't surprising or even exceptional, but it was mesmerizing all the same.</p>\n<p>            \"Thanks, Nico.\"</p>\n<p>            He'd never felt this way before. Percy had never needed defending, gods forbid sheltering; the Styx had been as much about ensuring his survival as it had been about throwing him into battle and danger. Most people Nico had cared about could take care of themselves better than he could and trusting them to was the best he could do. At most, he'd been able to <em>help</em>, sometimes (only sometimes), but he'd never been in the position of <em>protecting</em> someone, being their sword and shield.</p>\n<p>            This idiot whose most effective battle-strategy was to run around, though, he wanted to protect, and he knew he <em>could</em> protect because what the hell, they'd just defeated the Earth Mother and right now Nico was pretty sure he could take her on again one-on-one if a particular stubborn son of Apollo was at stake.</p>\n<p>            The values of lives and deaths.</p>\n<p>            He liked this feeling.</p>\n<p>            \"So,\" Nico cleared his throat, embarrassed at himself, \"you got your answer? What was the other thing?\"</p>\n<p>            \"Right. Gimme a sec.\"</p>\n<p>            Will leaned away, inspecting him thoughtfully from head to toe. Nico had kind of been a champ at handling feeling self-conscious for years, so used to it that he went all the way around back to not caring a damn how people looked at him. Will, of course, as the past week had insisted on demonstrating, was a different story.</p>\n<p>            \"Yep,\" Will declared, as if he were commenting on the weather, and leaned back in, and then closer. \"As I thought, I still like you a lot.\"</p>\n<p>            Nico breathed in, breathed in, breathed in, the way one breathes in before hurling themselves from the highest springboard or dunking their head under water, the way one breathes in before convincing their body to do something against their rebelling brain's every survival instinct, he breathed in the way one breathes in before doing something extremely stupid and supremely satisfying, he breathed in right up until he was breathing against Will's lips and then from inside Will's mouth, and yeah, it was a lot like all of those things.</p>\n<p>            He reached out, grabbed the low-hanging fruit of Will's hand next to his thigh, closed his fingers on it — and it squeezed back, hard, so hard his fingers might break but they couldn't possibly slip away into shadows.</p>\n<p>            In the distance, Percy screamed like a gored pig.</p>\n<p>            Will kissed him again pointedly before letting him go. \"Chiron's beard, I thought the battle would be near our flag,\" he sighed, turning to where red-plumed fighters were starting to appear between the trees. \"Should have dragged you further.\"</p>\n<p>            \"Hey, I'm not a deserter.\"</p>\n<p>            \"That you're not,\" Will agreed amiably.</p>\n<p>            They watched dispassionately what they could see from the skirmish — mostly, Jason and Percy getting beaten up by their girlfriends and their team by way of various smoke bombs, itching potions, archers ambushed up the trees, and good ol' weapon-swinging.</p>\n<p>            \"<em>Nico!</em>\" Jason yelled. Nico sighed and nudged his skeleton warriors to his rescue. In their own time.</p>\n<p>            \"Should we go and help?\" Will commented.</p>\n<p>            Since their fingers were still clutching at each other's (it would probably take a while to untangle them, Nico had never been good at knots after all), their shoulders were touching. Moving was just about the last thing Nico wanted to do.</p>\n<p>            \"Well,\" he said, thoughtfully. \"We wouldn't want you to take out somebody's eye, and I'm still recovering.\"</p>\n<p>            Will grinned. His lips were a little red, from where they'd been pressed against Nico's. Nico had <em>kissed </em>those lips. Could do it again, even, as soon as his legs stopped shaking and melting off his bones, maybe, definitely.</p>\n<p>            \"<em>Nico, c'm'on! Dude, why?!</em>\" Percy shrieked in the distance, right before Clarisse La Rue tackled him.</p>\n<p>            There were no skeleton warriors left to help him.</p>\n<p>            \"You know, I think I actually <em>love</em> this game,\" Nico confessed.</p>\n<p>            Will laughed, his shoulder pressed into Nico's as his body shook. The skeletal butterflies had filled Nico's stomach and chest and risen into his throat and mouth, fluttering in an elated dance. There were worse ways to spend an afternoon.</p>\n<p> </p>\n<p> </p>\n<p>            \"You're lucky I still owe you for the Doors of Death and transporting the Athena Parthenos, 'cause else I'd never forgive you,\" Percy whined.</p>\n<p>            And <em>that</em> was Percy Jackson in a nutshell. Gets your sister killed, figures you forgave him. Tells everyone for a year about that one time you accidentally sold him out to your dad even though you made up for it, turned him invulnerable and joined in the world-saving. Saves you from certain death by slow asphyxiation in a jar, forgets about it. Gives you a free pass for everything forever because you didn't sit on your rear when you were the only one who could do a specific thing necessary to preventing the end of the world. Sometimes Nico wondered if Percy remembered that Nico lived in this world, too. He wasn't dead yet.</p>\n<p>            \"You're welcome,\" he said, since Percy apparently didn't understand <em>Thanks</em>.</p>\n<p>            \"I hope you didn't come to laugh at me, though.\"</p>\n<p>            \"Oh, I'm not here for you.\" He threw Will the chocolate muffin he'd brought over from dinner. \"<em>How's it going, Will?</em>\"</p>\n<p>            Will shrugged, but his eyes twinkled as he dug into the muffin like a starving man. The nymphs brought only healthy food to the infirmary, naturally. It was awful. \"Eh, could be better,\" he replied nonchalantly. \"We're going to be busy for at least three more days with all the casualties. Your friends are barbarians.\"</p>\n<p>            \"<em>Græci</em>,\" Jason muttered from the next bed over.</p>\n<p>            \"Dude, in the last Roman war games I saw, someone died,\" Percy rolled his eyes.</p>\n<p>            Whose brilliant idea had it been to put those two in beds next to each other?</p>\n<p>            Will finished his bite of muffin and poked Nico in the arm (under the bandages). \"Hey, can you go get me some ambrosia?\"</p>\n<p>            \"Ambrosia for <em>that</em>?\"</p>\n<p>            \"Jackson is a big baby.\"</p>\n<p>            Well, no arguing that. Nico complied. Percy complained some more, completely disregarding the fact that he'd suffered <em>much</em> worse than a broken arm in the past few years. Luckily for him, most of the war wounded had been discharged over the last couple days.</p>\n<p>            After feeding Perseus 'Actual Six-Year-Old' Jackson his ambrosia, Will moved to take care of Cecil, who'd managed to get himself discharged that morning just in time for capture-the-flag and promptly gotten his other leg slashed. Nico was going to follow him, or at least go check on Jason, but Percy grabbed his tee-shirt and gestured at him to sit and come closer.</p>\n<p>            \"What?\"</p>\n<p>            \"What did you mean,\" Percy hissed in a low voice, \"I'm not your type?\"</p>\n<p>            Nico stared at him.</p>\n<p>            \"No,\" he said, slowly, so that Percy's brain could follow despite being clearly full of kelp. \"You do <em>not</em> get to resent that I'm not crushing on you anymore.\"</p>\n<p>            \"It's insulting, okay!\" Percy pouted, crossing his arms. \"Like, what, I wasn't good enough?\"</p>\n<p>            Nico could probably succeed in strangling him right there. Nobody would stop him. Jason might crawl out of bed to help. \"Let's say my '<em>type</em>',\" he sighed instead, because there was no reasoning with babies, \"is taller, older, stupid, annoying blond guys that I could beat up. You only meet five out of six requirements, sorry.\"</p>\n<p>            Percy frowned for a little longer. \"You couldn't beat me up,\" he muttered after a suspiciously long pause.</p>\n<p>            In the next bed, Jason burst into disbelieving snickers, and this was why Nico was friends with him.</p>\n<p>            \"I totally could. I could right <em>now </em>for <em>sure</em>,\" he pointed out. \"You couldn't do <em>anything</em> about it right now.\"</p>\n<p>            \"You didn't even bring <em>me</em> any muffin,\" Percy ranted on without any segue, glaring at the foot of his bed like the world's tallest and grumpiest <em>child</em>. \"You're a terrible friend, dude.\"</p>\n<p>            Nico blinked, tried to figure out how to react to <em>that</em> from <em>Percy Jackson</em>, and failed, resorting to laughing helplessly.</p>\n<p>            Will materialized at his shoulder and chimed brightly, \"Are you guys talking about how much you love me?\" There were some muffin crumbs left around his mouth. Nico fought back the urge to wipe them off, then remembered he didn't have to.</p>\n<p>            Percy made a gagging sound, like he and Annabeth hadn't sucked face for the first time in front of the entire camp, so Nico made a point to answer, \"Yeah,\" before getting up and going to talk with Jason and ignore both of the idiots for the next hour.</p>\n<p> </p>\n<p> </p>\n<p>            Nico spent the rest of the evening and most of the following day finishing Pokémon and napping in various spots around camp, mostly trying to avoid Rachel who wanted him to trade her the shiny Gastly he'd caught two days earlier and had no qualms about bursting into the Hades cabin to hound him out. The next evening, though, Will managed to get out of the infirmary for the bonfire and sing-along, and was <em>really excited</em> about it. This meant Nico simultaneously had even less desire to attend, and no choice but to.</p>\n<p>            Will zeroed in on him the second Nico stepped into the circle of light from the fire and patted the ground next to him enthusiastically. He was surrounded by most of the Apollo cabin and a few Hermes and Aphrodite kids, as well as Butch and Lou Ellen, who were the only ones whose faces Nico could put a name to. Then again, of the other people he might have considered hanging around awkwardly, only Annabeth and Piper were present, and that was not a pair Nico wanted to come between. Nico gave in.</p>\n<p>            Endless list of things about Will Solace that made his parentage obvious, item number fifty-two or something by now: the warmth in the grins he sent Nico. Number fifty-three (or something): the warmth of his breath and shoulders as he leaned in to whisper, almost vibrating with giddiness, \"We got to have open mic night!\"</p>\n<p>            Nico kicked his brain into whirring, fast, but he floundered. They didn't have mics at camp. How did you even open a mic? What did you do with a split-open mic? Did the twenty-first century ever stop coming up with weird new things?</p>\n<p>            \"Anyone from the audience can 'take the mic', meaning, get to speak in front of everyone,\" Butch explained in his deep, gravelly voice. \"Usually it's still scheduled, but we don't really bother, so think of it like free-form karaoke.\"</p>\n<p>            \"Right. It's awesome,\" Will added, \"because it doesn't have to be singing, and you can do your own stuff if you want.\"</p>\n<p>            \"Yeah, we Hecate kids cook up illusion tricks, and you can usually count on stand-up comedy from Hermes. Will loves it,\" Lou Ellen added with a smile.</p>\n<p>            \"I do.\"</p>\n<p>            \"He also sucks at whatever he comes up with for it.\"</p>\n<p>            \"I most definitely do!\" he laughed and high-fived her. Will wore self-deprecation like everything else: easily and proudly, and making it look good.</p>\n<p>            \"So do you have anything planned for tonight?\" Nico asked.</p>\n<p>            \"I haven't quite mastered my latest trick,\" Lou Ellen admitted, a little flushed, \"but Vivian has something ready, I think.\"</p>\n<p>            \"Puns,\" Butch said.</p>\n<p>            \"I wrote a song,\" a tiny boy from Aphrodite piped up.</p>\n<p>            \"Improvised poetry,\" Will announced cheerfully.</p>\n<p>            Everyone in hearing distance cringed or made agonizing sounds, except the Apollo kids, who looked excited, explaining how Will was still head of their cabin (natural age succession order aside). Nico wondered if he should try and shadow-travel away now, before it was too late, but Will had discreetly grabbed his fingers and that was apparently Nico's fatal weakness.</p>\n<p>            Then the Hephaestus cabin opened the show with a fire-breathing number, and Nico forgot about leaving.</p>\n<p> </p>\n<p> </p>\n<p>            Lou Ellen's younger sister was clearly a beginner at Mist manipulation, but she was <em>good</em>. Because she wasn't aiming for realism, the shapes she created out of the pearly swirls of smoke were expressive and eerily beautiful, as if right out of a dream. \"Do an elephant!\" Rachel shouted, which she did happily. \"Do me!\" one of the Stoll twins of course followed, to which she responded by smiling politely and quickly twisting the Mist into a striking caricature of him, then a bunch of Maenads tearing apart specific body parts of his. The audience laughed and the other twin patted his brother's back with exactly zero visible sympathy.</p>\n<p>            Annabeth had a few fun riddles, to which a Hermes boy retorted with nonsensical punny ones until it devolved into a riddle duel.</p>\n<p>            <em>Butch's </em>puns, on the other hand, were really a straight-faced, fast-paced storm of downright filthy spoonerisms and double-entendres that left Nico reeling and blushing hotly — and he only caught maybe half of them, judging by the timing of the horrified cries and giggles from the rest of the audience. Will had laughed himself out of breath after the first few lines and had tears in his eyes by the time he finished. As Butch sat back down, cool as an Hyperborean, next to a crimson-cheeked but sparkly-eyed Lou Ellen, Mr. D nodded at him begrudgingly from across the fire and mouthed something that may have been:<em> You're all right, kid</em>.</p>\n<p>            The Aphrodite boy's<em> lyrics</em> were terrible, but his voice was heavenly. The laughing around the bonfire subsided and the entire camp (minus the heroic victims of capture-the-flag) listened to his cheesy love song in religious silence. Piper quietly joined in the chorus the second time, and by the third, so did most of the audience. Will didn't, but he squeezed Nico's hand.</p>\n<p>            \"You're a sap,\" Nico informed him in a low voice.</p>\n<p>            Will squeezed again, so Nico squeezed back.</p>\n<p>            Thankfully, Malcom from Athena started a little obscure trivia quiz, providing the perfect distraction from Will's very distracting happy sappy face. Literal brownies baked by the Demeter cabin were handed (or thrown) out for correct answers. Nico knew most of them, but only said them under his breath, refusing to volunteer despite Will's attempts to force him to stick up his hand. Finally, the last question — what was responsible for scaring racing horses — had even Annabeth stumped, and the last brownie happened to have pistachio crumbs topping it. Someone yelled, \"<em>Clarisse's face!</em>\", but godmotherhood had brought her self-control and she only maimed the offender a little, real quick. The incident passed and since nobody had any better answer, Malcolm looked about to give out the last brownie to the (bleeding) smartass for his efforts.</p>\n<p>            \"<em>Taraxippoi</em>,\" Nico blurted out. Annabeth slapped her own forehead, mouthing, '<em>That was it!'.</em></p>\n<p>            \"Aaand that is cor-<em>rect!</em> Have a brownie!\"</p>\n<p>            Will punched him in the shoulder — lightly, and carefully above the bandages, but still. \"For a healer, you're really violent,\" Nico grumbled, nibbling on his reward.</p>\n<p>            \"And you're really cool. How the hell did you know all that?\"</p>\n<p>            Nico admitted in a half-hearted whisper: \"I played Mythomagic when I was a kid.\"</p>\n<p>            Will stood up abruptly, cleared his throat and laid a hand on his heart. <em>Oh no</em>, Nico thought, <em>here it comes, and it's coming for me</em>.</p>\n<p>            \"<em>The night is chilly / Playing games around campfire / I'm dating a nerd.\"</em></p>\n<p>            There was as much laughter and cheering as there were loud groans. Aphrodite kids cooed, Ares whistled, Apollo cabin even <em>clapped</em> and Will bowed to traitorous applause.</p>\n<p>            \"I really don't know why I like you,\" Nico muttered as he sat back down.</p>\n<p>            Will blew him a kiss and reached for the rest of the brownie. \"It's 'cause I'm hot.\"</p>\n<p>            \"No,\" Nico refuted distractedly, handing him a bit that didn't have much pistachio on it, \"that's not why.\"</p>\n<p>            And somehow <em>that</em> was what got Will Solace to blush. Luminously.</p>\n<p>            Then a duo of Ares boys started yelling heavy metal and he joined in the fierce protests from Apollo cabin, as if he had any leg to stand on about what constituted singing.</p>\n<p> </p>\n<p> </p>\n<p>            Nico collapsed onto his bed face-first like a corpse with its reanimation spell broken. How in Hades had he used to go by for days without sleeping? Social events were exhausting. <em>People </em>were <em>exhausting</em>.</p>\n<p>            Not bad aside from that, though.</p>\n<p>            Well, not all fantastic either. He rolled onto his back and wondered if his first nightmares after the war would be about the Stoll twins' rendition of the Golden Ass song they'd learned from the Romans. (The original version was about a donkey.)</p>\n<p>            Over the last few weeks, he'd contracted the habit of falling asleep on the spot without a second thought. He hadn't realized he'd been dozing off, so when he jerked awake, he was more disoriented, at first, to be in his bed but still in day clothes and atop his covers than about the voice that had woken him to start with. He groped about groggily for his blanket and curled up under it, shivering.</p>\n<p>            \"Hey,\" Will whispered again, loudly, and next to his bed, his dawn-colored eyes visible in the dark. \"It's glacial in here, make me some room?\"</p>\n<p>            Nico froze.</p>\n<p>            \"New rule,\" he whispered back, trying to control his voice. \"Two campers of the same sex can't be alone in a cabin either anymore.\"</p>\n<p>            Will wriggled in next to him, under the blanket. \"I won't tell if you won't tell.\" There was a cheeky grin audible in his voice.</p>\n<p>            Right. Will was older. Two, three years? (Gods, Nico didn't even know his age for sure.) And he looked so at ease, so comfortable about the whole thing, surely he'd had boyfriends before, right? Nico was stupid, stupid, of course he probably wanted —</p>\n<p>            Will flopped over on his belly — his knees hitting Nico in the shins —, turned on the lamp on the nightstand, and dug for something in his shorts pockets. \"After what you said at the bonfire, I remembered I had this. Sorry to come in so late, it took a while to find it, but I had to show you.\"</p>\n<p>            He brandished a Game Boy Advance cartridge with a familiar design on it. Nico could barely remember his mother's face, but he'd recognize this design anywhere.</p>\n<p>            \"Rhadamanthus in Elysium, I love you,\" he gasped, fumbling to turn around on his belly as well and grasping for it like Icarus for the sun. \"<em>Oh my gods.</em>\"</p>\n<p>            Will's grin could probably power all of Long Island for a few days. \"You can read it on the DS, and it should still be working. You can erase my old save.\"</p>\n<p>            \"Oh my gods, I didn't even know they made a game! I figured this franchise died in, like, the nineties!\"</p>\n<p>            \"It kind of did,\" Will admitted, laughing. \"I only bought it because I got my hands on everything about mythology that I found, but nobody else at mortal school had it. Pretty sure this was the first and last videogame they ever made.\"</p>\n<p>            Nico may have been hyperventilating, but whatever, Will clearly really did have a thing for geeks.</p>\n<p> </p>\n<p> </p>\n<p>            Nico still had problems with time. He still had to catch himself, evaluate time lapses, calculate what a date represented relatively to people's ages — remember that <em>the nineties</em> probably didn't mean much to a sixteen-or-seventeen-year-old, that games he'd played one after another at the Lotus Casino had actually come out with sometimes a full decade between them, that the length of days varied dramatically whether he slept or not and sometimes entire ones passed while he thought he'd only conked out for bare minutes.</p>\n<p>            Perhaps predictably, games were still his worst time-sink, though.</p>\n<p>            Will walked him through the poorly-thought-out commands to figure out how to build a deck, pointed out opponents that he vaguely remembered dropped 'good cards' and squeaked and laughed when Nico got horrified at what his idea of 'good cards' were, laughed when Nico insisted the game was using the outdated set of rules, laughed when Nico finally got the last card he needed for a combo that obliterated the first boss. It was only when Will started yawning that Nico finally thought to save, and realized with complete incomprehension that his playtime clocked well over one hour already.</p>\n<p>            Also, Will had wrapped one arm around his waist.</p>\n<p>            \"Oh, you're stopping?\" he noted plaintively, then started yawning again.</p>\n<p>            \"You should go to bed,\" Nico admitted.</p>\n<p>            Will finished yawning and smacked his lips contentedly. \"I am in bed, though.\"</p>\n<p>            Nico fought his blush desperately, but Will's arm was, as always, warm, and he couldn't tell if his eyes were half-lidded in sleepiness or an attempt at seduction. \"It'll definitely be noticed if I let you stay,\" he floundered.</p>\n<p>            \"Hmm, I dunno, there's no head counselors to check up on us.\"</p>\n<p>            \"Yeah, and your cabin mates aren't gonna notice you're not there to wake them up tomorrow morning, maybe?\"</p>\n<p>            Will groaned.</p>\n<p>            \"Also, aren't you supposed to go back to infirmary duty tomorrow?\"</p>\n<p>            Will groaned louder and burrowed his face into Nico's pillow, his blond hair like gold leaf embossing on the black pillowcase. \"I need to check on your stitches again tomorrow, but Jackson and Grace can suck it,\" he declared.</p>\n<p>            Nico snorted. \"Is that an important educated decision you're making as a healer?\"</p>\n<p>            Will made a sound. It was hard to describe, muffled as it was in the pillow, but it was a sound. \"Okay,\" he said brusquely, raising his head, \"I'll go, <em>but</em> on one promise-on-the-Styx condition.\"</p>\n<p>            Nico shifted, uncomfortable, braced himself. Will's arm was still around his waist. \"Yes?\"</p>\n<p>            \"As soon as I can leave the infirmary again, next week at the latest, we ask Chiron for permission to go in the city, you come with me to Ikea, and we get you something to replace those blasted curtains.\"</p>\n<p>            \"Dude, I'm offended.\"</p>\n<p>            \"Those <em>curtains</em> are offensive!\"</p>\n<p>            \"I was already planning on doing that anyway, thank you very much for doubting me. I'll be the one taking you out,\" he soldiered on bravely. \"For moral support and help.\"</p>\n<p>            \"Ah, thank the gods,\" Will sighed in relief, dropping back down on the mattress, on his back this time. \"I'm dating a morbid nerd with no sense of self-preservation, but at least he has some taste.\"</p>\n<p>            \"I'll get some new clothes, too.\"</p>\n<p>            \"Ah, we'll see, then, I might have to take that back.\" Nico jabbed him in the lower ribs. Will chortled, breathlessly. \"Okay, off to bed I go, now,\" he acquiesced.</p>\n<p>            \"Thanks for the game,\" Nico said, watching him stand and slip back into his flip-flops. \"And for dropping by.\"</p>\n<p>            \"My pleasure, honest.\" He stretched, popped a few bones, and cocked his head. \"Can I get a goodnight kiss?\"</p>\n<p>            It was infuriating, how natural and inconsequent he acted and then did something like this, how he assumed Nico wanted him until it mattered, how he'd bared his soul and asked to see Nico's and kissed him slowly anyway, but then apparently didn't consider that to mean what Nico thought it meant.</p>\n<p>            Nico breathed in, willed his hands not to shake on the DS.</p>\n<p>            \"Why wouldn't you? You're the one who keeps saying we're dating,\" he pointed out.</p>\n<p>            \"Exactly. I'm the one who's saying it. I've kind of been running with it. But what are <em>you </em>saying?\" Will insisted, kneeling down next to the bed again and crossing his arms on the mattress. \"Are we, Nico?\"</p>\n<p>            Nico breathed in, breathed in.</p>\n<p>            \"Yeah,\" he whispered. \"Yeah, we're dating, and you can get a kiss.\"</p>\n<p>            Will smiled and didn't move and made Nico lean over and kiss him himself, the smug bastard.</p>"
}