{
  "id": "25569982",
  "url": "https://archiveofourown.org/works/25569982?view_full_work=true",
  "author": [
    "jennylarner"
  ],
  "title": "Definitely Worth It",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [],
  "fandoms": [
    "Spider-Man (Tom Holland Movies)",
    "The Avengers (Marvel Movies)",
    "Marvel Cinematic Universe"
  ],
  "relationships": [
    "Peter Parker & Tony Stark"
  ],
  "characters": [
    "Peter Parker",
    "Tony Stark",
    "Ned Leeds",
    "Michelle Jones",
    "Flash Thompson",
    "Mr Harrington",
    "Mr Warren",
    "Abe Brown",
    "Betty Brant"
  ],
  "additional_tags": [
    "Field Trip",
    "Peter Parker's Field Trip to Stark Industries",
    "Tony Stark Has A Heart",
    "Tony Stark Acting as Peter Parker's Parental Figure",
    "Protective Tony Stark",
    "Embarrassed Peter Parker",
    "Angry Peter Parker",
    "Ned Leeds is a Good Bro",
    "Good Friend Ned Leeds",
    "Precious Peter Parker",
    "Michelle Jones Is a Good Bro",
    "Flash Thompson Being A Jerk",
    "Bully Flash Thompson",
    "Internship",
    "Peter's Internship at Stark Industries"
  ],
  "language": "English",
  "series": "",
  "published": "2020-07-28",
  "completed": "2020-07-28",
  "words": "16,840",
  "chapters": "2/2",
  "comments": "203",
  "kudos": "15,918",
  "bookmarks": "3,082",
  "hits": "144,961",
  "summary": "<p>Peter doesn't want to go on a field trip to Stark Tower. It's a recipe for disaster. His class doesn't believe him, his teacher doesn't believe him. If he makes it through the entire day without being suspended, it'll be a miracle. Unfortunately for Peter, he's never much believed in miracles. </p>\n<p>... </p>\n<p>“This is a goddamn disaster.” Peter declared miserably. At least he hadn’t thrown up his food. </p>\n<p>“Could be worse.” MJ said across from him. Peter lifted up his head.</p>\n<p>“Oh yeah, how?”</p>\n<p>MJ shrugged. “They could have expelled you instead.”</p>\n<p>Peter gaped at her. “Thanks MJ, that’s really helpful. I feel so much better now.”</p>",
  "notes": "",
  "text": "<p>“Quiet please, quiet down!” Mr Harrington stood at the front of the class, waving his arms, and desperately trying to maintain control of his students. Peter watched with sympathy as Flash ignored the order and continued to snigger with his cronies. MJ began to sketch the teacher’s face in her notebook. “For the love of all that’s good – be quiet immediately or you will all be banned from the field trip on Friday!”</p>\n<p>The class was silenced at once. Even Flash swivelled in his chair and turned to stare. “Did he say field trip?” Ned whispered excitedly, grabbing onto Peter’s arm.</p>\n<p>Peter muttered a nondescript response to Ned’s question, eyeing Mr Harrington with wariness. Who could blame him? He’d never had good luck with field trips. Between Oscorp, Washington, and even the Homecoming… well, suffice to say he had decided that class events just didn’t seem to suit him.</p>\n<p>Mr Harrington exhaled, relieved at the sudden lack of noise. “Good, thank you. As I was saying –”</p>\n<p>“Are we really going on a field trip?” Abe cut in. “Where to?”</p>\n<p>“Abe, really. Please be quiet whilst I –”</p>\n<p>“Is it somewhere better than Oscorp?” Betty interrupted. “That trip was so <em>strange</em> –”</p>\n<p>“If you were all quiet I would have told you by now!” Mr Harrington snapped, frustration and anger suddenly seeping his tone. Abe and Betty went still. Ned stopped whispering, having previously been guessing where they would be going. “As I was saying. Our class has been invited on a tour of a very prestigious organisation, so I expect everyone to behave much better than you just exhibited.”</p>\n<p>There were mutters of apologies. Flash rolled his eyes. MJ snorted. Peter and Ned shared a look.</p>\n<p>“I will be handing out non-disclosure agreements and permission slips, both of which absolutely must be signed by both yourself and your parents or guardians by tomorrow morning and handed back to me.” Mr Harrington continued. “The trip will, as I have said, be on Friday and last all day. You must be at school by 8am when the bus leaves. If you are even a minute late, we will leave without you. We will have lunch on site, and there will be a bus back to school at 4pm.”</p>\n<p>“Where do you think it’ll be too?” Ned leant over, whispering to Peter. Peter only shrugged. He wondered whether he could skip the trip and spend the day at his internship instead.</p>\n<p>“I don’t know.” The young vigilante said honestly. “Could be anywhere. You know I don’t like field trips Ned. I mean… come on.” He made a subtle hand gesture, pressing two fingertips to his wrist.</p>\n<p>Ned winced. “I know, I know. You have to admit though that’s had its upsides I mean you get to swing from buildings, and you have super strength and your spidey senses –”</p>\n<p>“Shhhhh!” Peter hushed, widening his eyes at Ned with what could only be described as pure exasperation. “Ned you know you shouldn’t –”</p>\n<p>“Sorry, sorry –”</p>\n<p>“Parker, Leeds! For goodness’ sake what have I just said!”</p>\n<p>Peter and Ned jumped to attention. “Sorry.” They mumbled, both of their cheeks tinting red at being caught whispering.</p>\n<p>Mr Harrington let out another long sigh, pinching the bridge of his nose between his thumb and forefinger. “You have to behave on Friday, boys. I can’t have any single member of this class disgracing the school with less than their absolutely best behaviour. This is the first time we’ve been invited to such a prestigious company, and we need to make a good impression if we want other classes to be invited back.”</p>\n<p>“Invited where?” Betty asked impatiently. “Where are we going, Mr Harrington?”</p>\n<p>The teacher smiled. “It’s very exciting actually. I mean, it’s really exciting.” He was starting to show it, the smile turned into a beam. He clapped his hands together, bouncing on the balls of his feet. “You’re going to be so pleased. It’s so much better than anywhere else we’ve ever been before –”</p>\n<p>“Tell us, tell us!” Came the eager chorus of the class.</p>\n<p>Mr Harrington chuckled. He let the silence hold for a second, waiting for the tension to rise. “Class… We’re going to Stark Industries!”</p>\n<p>There was only a second of shocked silence before the instant uproar. Shouting, cheering, whooping – Betty was grabbing Abe’s arm and shaking it so hard he almost fell from his seat. Flash and his minions were high fiving. There were comments all around the class. <em>“Oh my gosh, that’s amazing!” “Working for Stark Industries is my dream!” “Do you think we’ll see one of the Avengers?” “Screw the Avengers, do you think they’ll let us see the biomedical labs?” </em></p>\n<p>Meanwhile, Ned stared at Peter. Peter stared at Mr Harrington. “You have <em>got</em> to be kidding me.”</p>\n<p>“You didn’t know?” Ned asked. Peter turned his head and gave him a dead stare. “No, you didn’t, obviously you didn’t, or you would have told me wouldn’t you and you said at the beginning of the announcement that you didn’t know where we were going it could have been anywhere –”</p>\n<p>“Ned this is a disaster.” Peter’s heart was in his stomach. Tony was going to think this was hilarious. Maybe he could get away with not telling his mentor? Or was Tony the one to arrange it? No, the billionaire might be generous, but Peter didn’t think Tony would think that far ahead. Probably? “Flash already thinks I’m lying about the internship.”</p>\n<p>“But you’re <em>not.” </em></p>\n<p>“I know that, obviously. I just think this trip is asking for trouble. Maybe I shouldn’t go. May wouldn’t mind.” Peter ran a hand through his hair, grasping at the strands as if it were the metaphorically straws of his ideas. “I’ll just spend the day holed up in Tony’s lab or something, he’d probably barely notice it was the daytime instead of the evening, his sleep schedule is really messed up.”</p>\n<p>“You have to go!” Ned argued at once, horrified. His fingers clenched down on the edge of the desk they shared, and Peter couldn’t help but flinch at the hurt expression his best friend was sporting. “Working for Stark Industries is our collective dream. We have to go. Anyway, I think it’ll be cool. You’ll have a million opportunities to prove Flash wrong about the internship, that’s got to be a bonus.”</p>\n<p>Peter began to respond but Mr Harrington arrived at their desk, handing them their permission slips and lengthy non-disclosure agreements. Peter couldn’t help but smile as he recognised Pepper’s ironclad protection of the company in the wording. Mr Harrington cleared his throat above them, and Peter and Ned both looked up to see the teacher’s stern look.</p>\n<p>“I hope I don’t have to remind you both about the necessary good behaviour when we go on the trip.” He said, looking pointedly at Peter. “That means no sneaking off, Parker, and no causing trouble of any other kind, for that matter.”</p>\n<p>Peter’s eyebrows drew together. “Trouble, sir?” He didn’t cause trouble. Not purposefully, anyway, though it did seem to have a habit of finding him at the worst possible moments. He’d admit to the sneaking off, sure, but again that hadn’t really been his fault. He was never the <em>cause </em>of the trouble<em>. </em>In fact, usually he was the solution. Usually.</p>\n<p>“Yes, trouble, there will be none of it. Am I understood?”</p>\n<p>“Of course.” Peter and Ned parroted back, trying their best to look innocent. They instantaneously shared an incredulous look the moment Mr Harrington moved on, raising their brows in sync.</p>\n<p>Ned tried his best to cheer Peter up the rest of the day, attempting convince him that a trip to Stark Tower would not only be educational but entertaining. He stopped trying after Flash knocked into Peter’s shoulder in the corridor, mocking, “You ready for everyone to see what a liar you are Parker? Hah! Friday can’t come soon enough.”</p>\n<p>Instead, Ned asked Peter a thousand questions about which Avengers remained living in the Tower, which were away on missions, which they were most likely to see. Peter didn’t want to disappoint his friend by telling him that none of the Avengers team were particularly interested in chaperoning a group of school kids on a tour, so he barely responded, and let Ned chatter on.</p>\n<p>When he returned home later that night, and solemnly passed the permission slip to May, he couldn’t help but groan at the amused press of her lips, the way she was trying not to laugh, the light in her eyes as she looked at him. “It isn’t funny, May.”</p>\n<p>“Oh no, I know, of course not. It isn’t.” May said, but her lips were still tweaking at the corners.</p>\n<p>“It’s <em>not</em>.”</p>\n<p>“I know, I know!” May said again, holding her hands up in surrender. The permission slip fluttered between her fingertips before she brought it down to examine the words a second time. There was still a little bit of faint amusement stretching her lips. “Does Tony know about this?”</p>\n<p>Peter scoffed. He dropped his bookbag on the coach and threw himself down in defeat. “He hasn’t said anything, but he knows about everything that happens in Stark Tower, no matter how much he likes to pretend he’s completely uninterested and above it all. And, even in the smallest possible chance that he didn’t know, Pepper defiantly does.”</p>\n<p>May hummed in response. She set the slip down on the kitchen counter, and scrambled around for a pen before lavishly signing her signature scrawl. “There, you’re going. End of.”</p>\n<p>“I don’t think I should go, if I’m honest, I just think this trip is asking for trouble.” Peter told her, repeating what he had told Ned. Part of him wanting her to take up the permission slip, rip it swiftly in half and throw the pieces in the air, ruining all possibility that he would be allowed on the trip.</p>\n<p>“Doesn’t matter.” May said stoically, ending his dream as quickly as it started. “Tony would be very upset to know you aren’t interested in a tour of his company. You’re going.”</p>\n<p>“But Flash –”</p>\n<p>“Is a nuisance, and you should have told him where to go a long time ago.” May interrupted.</p>\n<p>“But –”</p>\n<p>“No more buts, Peter. You’re going on that trip, so don’t even think about not handing in your permission slip. I’ll know, and you know that I’ll know.”</p>\n<p>Peter began to reply, began to argue that he really didn’t think Tony would care all that much if he found out later that Peter had skipped the tour, but May was throwing takeaway menus at him and asking him to pick dinner, effectively ending the conversation. Peter flicked through them absentmindedly. He picked the Thai place they loved, and they spent the rest of the evening with their crossed over each other on the couch, swapping gossip from the hospital and school.</p>\n<p>Once Peter had gone to bed, May quietly stepped out into the hallway and took out her phone. She needed to be far enough from Peter’s room that he couldn’t overhear her with his spidey senses. The dial rang three times before clicking on. “May? Is everything alright? Is the kid okay?”</p>\n<p>“He’s fine Tony. But… I have a favour to ask.”</p>\n<p>“Ominous, but as always your wish is my command Aunt Hottie. What do you need?”</p>\n<p>…</p>\n<p>When Friday morning came, Peter dragged himself out of bed with a groan, ignoring May’s teasing through the walls about his reluctance. If he could get up for school after a patrol, she said, he could get up for this. She gave him a knowing grin and a kiss on the top of his head as he left. It would usually make him feel so much better, he was an affectionate kid after all, but today it made him scowl – prompting May to laugh harder, and him to slam the door a little too hard on the way out.</p>\n<p>It wasn’t that he didn’t want to tour Stark Tower. Stark Tower was incredible, as was the company that resided in it, and Ned was right in saying that it had always been their joint dream to work there side by side. The labs were unbelievable, and he had spent a little time there but not much since he was always with Tony on his personal floor. It would be amazing to see more of the other intern’s work. They would probably tour the Avengers exhibition, and Peter always enjoyed that.</p>\n<p>But between the chances of Tony butting in and doing something embarrassing or stupid or over the top, and the fact his classmates didn’t believe he worked as an intern in the first place, it seemed like to perfect recipe for Parker-luck to strike and mayhem to descend.</p>\n<p>Peter could only hope he was wrong.</p>\n<p>He trudged to school, meeting Ned in the parking lot with the rest of their class. MJ jutted her head at him and after a minute of inspecting his expression, withdrew her notepad and began to sketch. Peter began to question it when another voice called out –</p>\n<p>“Hey Parker, yo Parker!” Peter groaned as Flash’s hand shoved his shoulder. It took all his lacking energy to not move on instinct and instead take the hit. “How are you feeling this morning Puny? You know, now all of your lies are gonna unravel. You can’t expect to keep them up now we’re <em>actually</em> going to Stark Industries.”</p>\n<p>Peter hoisted his bag back up his shoulder. “Piss off Flash.”</p>\n<p>“Ooh tough words Parker.” Flash taunted, as the rest of the class slowly tuned into their conversation. Flash revelled in the attention of an audience, chest puffed out as he looked around, grinning widely. Peter was almost surprised the bully wasn’t filming the confrontation for a vlog. “Look. Just give it up now and I might let you off. We all know Stark doesn’t take high schoolers as interns. Tell the truth and we’ll all accept that your pathetic attempt at popularity was just because of your sad little life and move –”</p>\n<p>“Thompson! What do you think you’re doing!” Flash jumped back as Mr Harrington walked towards them, a clipboard in his hands. He was tapping his pen against it with impatience, his lips turned downwards as he observed the group.</p>\n<p>“Nothing Sir!” Flash said quickly, throwing Peter a murderous look before re-joining his friends, hovering a short walk away. They circled up immediately, and Peter could see Flash’s arms waving sporadically, his face making bizarre expressions and the cronies all laughing at what could only be more taunting at Peter’s expense. Peter didn’t know what else he would have expected.</p>\n<p>Mr Harrington watched Flash leave, before his eyes rested on Peter, narrowing with suspicion. Peter gulped. Mr Harrington didn’t look away as he addressed Ned and MJ. “Leeds, Jones. Please go line up with the rest of the class, the bus is just coming through the gate. Parker, a word?”</p>\n<p>Ned seemed concerned, and backed up only a few steps until MJ grabbed the strap of his backpack and forcibly hauled him across the carpark. Peter turned to face his teacher with dread pooling in his stomach. “Yes, Mr Harrington?”</p>\n<p>Mr Harrington let loose a long sigh. That probably wasn’t a good sign. “Peter. This isn’t going to be a comfortable conversation. I was hoping to avoid it, truly, but after overhearing what Mr Thompson just said…” Peter winced. He felt sick to his stomach, staring up and waiting for his favourite teacher to finish his sentence. “Peter. I think most of the school has heard the rumours that you have an internship at Stark Industries.”</p>\n<p>“Yes that’s corr–”</p>\n<p>“Despite the fact,” Mr Harrington continued. “That it is common knowledge Stark Industries do not allow high schoolers to intern for them. In fact, you must have completed your first year of a relevant degree before they will consider an application. And even then they only accept five interns per department per year. It is a highly coveted position.”</p>\n<p>Peter blanched. He felt the sharp sting of bile at the back of his throat. This was so much worse than anything he could have imagined. “Mr Harrington if you’d just let me –”</p>\n<p>“Now I understand you’ve had a tough couple of years, what with your Uncle passing.” Mr Harrington said, and though Peter knew his teacher was trying to be kind, the words crawled over his skin like ants. A shiver swiftly followed as he tried to dispel the feeling. “But I cannot allow you to spread these lies. It’s gone on long enough Peter. I understand, I really do, and I won’t force you to confront your classmates. Saying that, I would advise you to come clean sooner rather than later. You don’t want this hanging over your head for the rest of your school days.”</p>\n<p>Peter didn’t say anything. He trained his gaze on the gravel underneath his feet, his sneakers shifting between the stones, unable to look Mr Harrington in the eye. There was a hollowness inside of his chest that felt bottomless. For Flash, his bully, to think he was a liar was one thing. For one of his teachers, one of his <em>favourite</em> teachers, to not think him capable enough to hold an internship, to think him a liar and not allow him to prove his innocence, was crushing. He remained silent.</p>\n<p>Mr Harrington shook his head, arms falling to his side, clipboard hanging by his thigh. “Peter I can’t have you saying anything about working for Stark Industries today, is that understood? We are representing the school and if a member of the Stark Industries team were to overhear your lies, and report it, we would be in serious trouble. Do you understand Peter? If you don’t, I can’t let you on the trip.”</p>\n<p>Peter replied, completely monotone. It was eight am and he felt exhausted already. They weren’t even on the bus yet. “I understood, Sir, is that all?”</p>\n<p>Mr Harrington narrowed his eyes further. “I need you to look me in the eye and tell me that Peter, so I <em>know</em> that you understand. No more lies, okay?”</p>\n<p>Peter pulled his gaze up off the ground, and tried to quell the anger in him. “Understood, Sir, is that all?” He repeated, fisting the bottom of his hoodie between his fingers to stop them shaking.</p>\n<p>Mr Harrington smiled sadly, seeming on the verge of pity for the teenager. “Thank you Peter, that’s all. We will discuss the rest on Monday morning. Go line up with your classmates.” Peter did as he had been instructed, turning on his heel and stalking away.</p>\n<p>Walking towards Ned and MJ, he felt like turning and spitting at Mr Harrington’s feet, the anger in his chest hot like a fire, burning around his ribs like a flame. He took several deep breaths and refused to meet or acknowledge Ned’s troubled expression as they waited to board the bus, only shook his head minutely, and Ned immediately began to glare at Mr Harrington’s back. Peter didn’t deserve Ned’s unending dedication to their friendship.  </p>\n<p>Flash and his cronies had pushed to the front of the line and automatically took up the back of the bus. Peter and Ned silently agreed to seat themselves at the very front. MJ sat across from them, and no one dared to ask her to share the two-seater.</p>\n<p>They were still three seats behind Mr Harrington and Mr Warren, on the opposite side, so Ned felt comfortable enough to quietly lean over and ask, “What happened? What did he say?” Knowing Peter’s senses could pick up his voice even above the clattering of noise at the back of the bus.  </p>\n<p>“Doesn’t believe me about the internship. Told me not to spread lies.” Peter muttered, pulling his backpack onto his lap, and collapsing back against the seat, a hand over his eyes but with enough gaps between his fingers that he could see Ned’s mouth pop open in shock.</p>\n<p>“He can’t say that!” Ned immediately defended, voice raising. At Peter’s hush, he lowered it again. “Peter that’s really out of order. He can’t accuse you of lying without proof. Didn’t Stark Industries register some kind of paperwork with the school when you started the internship?”</p>\n<p>Peter moved his fingers to rub at his temples. “I’m not sure.” He admitted. “Pepper said she would send something along, to see if I could gain any extra credits for doing additional work, but it doesn’t sound like they have anything.”</p>\n<p>Ned frowned. “It doesn’t sound like Ms Potts to forget something like that.”</p>\n<p>Peter hummed in agreement. It didn’t sound like her at all. “Which means…”</p>\n<p>Ned’s eyes widened. “The school saw it, but they didn’t believe it was real.”</p>\n<p>“That’s bullshit.” Peter and Ned both jumped and stared at MJ, who shrugged, the page of her book held down by her palm. “The school, I mean, not your idea. Dork is way smart enough to hold an internship like that. They should have at least checked if the paperwork was real, any idiot can do that.”</p>\n<p>Peter felt his chest swell at her words. “Thanks MJ.”</p>\n<p>MJ only shrugged again, raised her feet to press against the chair in front of hers, and continued to read. The drive from Queens to the centre of New York City and the location of the Stark Tower dragged by, minute after minute after minute, with Peter and Ned talking under their breath whilst the cackles at the back of the bus never seemed to stop, and only got louder as they finally pulled up to the entrance of Stark Tower.</p>\n<p>As the bus came to a slow stop, and everyone rushed to undo their seatbelts, Mr Warren stood up and held out his hands. “Slow down there boys and girls. Before we go in I just want to remind everyone to be on your very, <em>very</em> best behaviour. This is the big leagues right here guys. One wrong move, you might never be allowed back in. You need to follow everything our guide says, everything the security team says, and for goodness sake don’t touch anything unless given absolutely explicit permission to do so. Am I clear?”</p>\n<p>There was a chorus of “Yes Mr Warren!” in return, and they all made their way off the vehicle and onto the hot concrete of the city. Peter had been enough times now to not revel in the sight of Stark Tower the same way his classmates were, but he still admired how impressive it was, a feat of modern architecture only possible for a genius team such as Tony Stark and Pepper Potts.</p>\n<p>Mr Harrington led the way inside whilst Mr Warren walked behind the class and made sure no one strayed. Everyone seemed as equally impressed with the lobby, a wide and open space the curled around the reception desks, with light floors and lots of natural light streaming through floor-to-ceiling glass windows. “You can see Ms Potts influence.” Betty was mumbling. “It’s all so sleek and sophisticated.”</p>\n<p><em>She isn’t wrong</em>, Peter though with a wry smile, <em>if it were up to Tony, the entire place would end up looking like a mechanics’ garage.</em></p>\n<p>Mr Harrington walked confidently up to the receptionist, a kind-looking woman in a black skirt-suit and her blonde hair pinned in a bun at the nape of her neck. <em>Sarah</em>, Peter’s brain reminded him. She had been at Stark Industries for at least three years. They had got chatting the first time he had ever come through the main entrance and they were waiting for Happy to approve of his entry, since he hadn’t had a badge at that point. He’d always made a point to smile at her, and sometimes wave, when he saw her after that.</p>\n<p>Sarah looked up as she saw Mr Harrington approaching, turning away from her conversation with another receptionist. “Can I help you?” She asked politely, eying the class hovering behind the teacher. “Are you here for a tour today?”</p>\n<p>“We are indeed!” Mr Harrington said brightly, bringing out some kind of paperwork to show her. Sarah took it and began to review it meticulously, taking her time to flick through the pages. Mr Harrington grew a little nervous, trying to peer over the desk at the folder. “We’re, uh, from Midtown Tech? Forrest Hills, Queens? I hope we’re on time –”</p>\n<p>Sarah snapped the folder shut. “Perfect! Yes we were expecting you at nine am, you’re right on time. If you could just wait here I will retrieve your badges and then escort you to your security briefing.” She passed the folder back to Mr Harrington and walked into the office Peter knew was behind the desks. When she returned, it was with a small box in her hands. “If your class could each approach one by one, and I will take note of their names and give them each a badge. Are you Mr Harrington or Mr Warren?”</p>\n<p>“Harrington.”</p>\n<p>Sarah nodded and made a note, presumably ticking off their names on a checklist. “Here you go then.” She said brightly, handing a plain white badge over the desk, hanging on a red lanyard. “And Mr Warren I presume?” Mr Warren stepped up, taking his own badge, and hanging the lanyard around his neck. “Please ensure your students do not take these off at any point, or they will be removed from the building.”</p>\n<p>One by one Peter’s classmates stepped up and accepted their badge, each looking exciting and thanking Sarah profusely. Flash snatched it from her hand with a greedy expression. Sarah only raised an eyebrow.</p>\n<p>Peter waited until Mr Harrington and Mr Warren were turned away and talking to other students before darting up to Sarah, planting his hands on the desk. Her eyes widened when recognised him, lit with curiosity and confusion. “Peter? What are you doing he–”</p>\n<p>“Just give me a lanyard cord, but not the badge.” He said quickly. “Please, just pretend to give me a badge.”</p>\n<p>“Is this your –”</p>\n<p>“Yeah this is my class, I should be on the list, but they don’t really know I work here. Please?”</p>\n<p>Sarah’s expression schooled into one of surprise before she plastered the biggest, most professional smile possible onto her face, leaning down to check off his name. At the same time, she covertly snapped a badge off its lanyard and slide the red cord over the desk. “There you go, all done. Are you excited for the tour?” She continued their conversation amicably, watching the other students whilst Peter brought his own badge out of his pocket, stuffing the gold-coloured cord it had previously been attached to back into his hoodie.</p>\n<p>“Super excited.” He replied, clipping the badge into place, and placing the red cord around his neck. He looked up at the receptionist, relieved. No one had noticed. “Thank you, so much.”</p>\n<p>“You’re welcome.” She whispered conspiratorially, winking. Peter grinned, subtly returning to Ned’s side. “Right, is that everyone?” Sarah called, drawing the class’ attention back to herself. “Wonderful. If you will all follow me, our deputy head of security will give you a brief regarding safety whilst within the tower, and then your tour can begin. You’ll need to go through the metal detectors first, so please place your bags in the trays along with your shoes and anything inside of your pockets.”</p>\n<p>Once again, Flash pushed to the front, throwing down his things and ignoring the directions of the security guard waiting by the metal detectors. As there were two, Abe made his way through the other, listening kindly to the advice of the guard, and snickering when the alarm rang out for Flash, and the other boy sheepishly had to remove things from his pockets and be inspected before continuing.</p>\n<p>Peter listened to the guard’s instructions. As he was an employee he would usually go through the fast-tracked entrance, rather than the ones with guards whereby all of your possessions needed to be looked through. He could hear Flash sniggering with his friends. “Why does Puny Parker have to go through security? He works here right, surely he should be allowed to just breeze past!”</p>\n<p>Ned whispered beside him, as they shouldered their bags, “Just ignore him Peter. You’ll get the chance to prove them all wrong, I know you will.”</p>\n<p>“I don’t care anymore Ned.” Peter said, even though the heat in his chest was beginning to build again, and the red on his cheeks was burning. “I just want to get this whole day over with.”</p>\n<p>They were shown into a small conference room and took their seats. After a few minutes of waiting, a tall, dark-haired man in a crisp black suit walked in and stood in front of them. Peter had only had a few interactions with Charles Mason, Happy’s deputy, but they seemed similar. Charles certainly never smiled at him either.</p>\n<p>“Good morning, students, teachers. I am Charles Mason, the deputy-head of security here at Stark Tower, and therefore responsible for ensuring each and every one of you is aware of the rules regarding safety during your tour today.” Charles gave the room a hard, sweeping look, his eyes only settling a second too long on Peter. He continued, “This will include the itinerary of your day, the safety precautions and requirements of each division and department you will be visiting, and a recap of your non-disclose agreements.”</p>\n<p>Charles’ stern lecture lasted just over fifteen minutes, and Peter knew that by the end almost everyone in the room was partially scared of the man. At the end, Charles gestured towards a young woman perched on the wall besides the door. “Now, may I introduce your tour guide, Amy Curtis. She will take it from here.”</p>\n<p>Amy practically bounced to the front of the class. Peter had seen her around, could vaguely recognise her face, but they’d certainly never had a conversation. He didn’t run into the tour guides often, only when they were serving in other capacities. He knew there were only a couple. Stark Industries had drastically cut down on how many tours they allowed through their doors the past couple years. School tours were booked two years in advance. Which only made the fact they were here right now more suspicious.</p>\n<p>“Good morning everyone!” Amy said chirpily. Peter saw several classmates giggle at her childish glee. “How are we all? Are you excited to begin?” After the general noise of concession amongst the cohort, Amy laughed. “Oh dear, has Charles exhausted you already? Come on, let’s get moving, we have a lot to see! First off, the Avengers exhibition! You’re going to love it.”</p>\n<p>The class scraped back their chairs and followed her from the room, leaving their bags and electronics behind as instructed by Charles. The door was locked behind them and the entire class piled into a large service elevator, all the while with Amy chattering away about each member of the Avengers team who’s exhibit they could expect to see.</p>\n<p>“Good morning, Midtown High School of Science and Technology.” A methodical voice rang out as the elevator doors slid shut. Everyone except for Amy and Peter jumped, Ned twitched but smiled, and MJ looked upwards with disinterest.</p>\n<p>Amy laughed at their expressions. “That’s F.R.I.D.A.Y.” She explained. “The artificial intelligence system Mr Stark personally designed to run the Stark Tower, after the previous AI, JARVIS, was… well, you can read all about it in the exhibit! Floor eight, please F.R.I.D.A.Y.”</p>\n<p>“Enjoy your tour, Midtown.” F.R.I.D.A.Y said politely.</p>\n<p>“The exhibit shows all of the original Avengers, including Mr Stark’s Iron Man at the forefront of course and the history of his father with the creation of Captain America, but also all the members of the team such as War Machine or the Scarlet Witch who have since trained or fought with them.” Amy continued, even whilst some of Peter’s classmates continued to stare at the ceiling of the elevator, trying to decipher where the voice had come from. “The exhibit is forever growing, that way! Isn’t that nice?”   </p>\n<p>They arrived at the correct floor and Amy threw her arms wide. “There we go! Okay, I’ll do a quick tour all the way through, then the next section on the history of Stark Industries, and then I’ll give you an additional half hour to explore any particular exhibit that interests you.”</p>\n<p>Peter had been to the Avengers exhibit a couple of times, mostly on boring afternoons when Tony had left him alone in lieu of an emergency meeting and he had a few hours to kill. Still, it was nice to see the additions. Since the reconciliation of the Rogues and those who had been in agreement with the Accords, more information had been added, but Amy wasn’t saying anything he didn’t already know from Tony telling him so.</p>\n<p>“Parker, oi, Parker! Why aren’t you telling us all of this eh, since you’re such good friends with Stark? I bet you’ve made Leeds believe you’re mates with the whole Avengers team.” Flash laughed from his place a few metres away. Peter kept walking, ignoring him, though his hands were twisting against his jeans. “How <em>was </em>dinner with Captain America last night, does he cook well? I always wanted to know!”</p>\n<p>Peter knew that Steve Rogers did in fact cook abysmally, having grown up in an early-1900’s and then a war-rationed world, and that the first time he’d tried cooking for the team post the Avengers forming, he’d almost set the kitchen alight. <em>And he’d only been trying to boil rice. </em></p>\n<p>Flash’s cronies, on the other hand, thought the imagine of Peter having dinner with Captain America was the most hilarious thing in the world, and fell apart, laughing hysterically. Mr Warren threw them a terrifyingly dark look once he’d clocked the commotion. The laughing ceased, but Peter could feel Mr Harrington’s eyes sweep over him, lips pulled down in a frown. Peter winced.</p>\n<p>As soon as they were left to explore on their own, Peter and Ned hightailed it to the newest additions to the exhibit – Spider-Man, Ant-Man, Scarlet Witch and Vision. All of the non-original Avengers who fought in what the media had dubbed ‘the Civil War’. There had been no new information added to Spider-Man’s display, which Peter found vaguely disappointed, but since the rogues had returned and supplied Tony with more information regarding their powers, the others had been updates.</p>\n<p>Ned was fanboying over Wanda’s display when Mr Harrington tapped Peter on the shoulder, a steely look in his eye. Peter sighed. “Sir, I know –”</p>\n<p>“I thought we understood each other, back at the school, Peter. I asked a very simple request of you.” Mr Harrington interrupted him, tersely.</p>\n<p>“Perhaps you should have also spoken to Flash.” Peter replied hotly, anger bubbling. “He didn’t seem to get the same memo.” He turned away from his teacher, furious, and dragged Ned away from the displays in front of them and into an unoccupied corner nearer to the entrance for the History of Stark Industries hallway. “I’m going to scream.”</p>\n<p>“Please don’t.” Ned begged immediately. “You know I have weak ears.”</p>\n<p>“I’m serious Ned. This is <em>awful. </em>Why did I even come.” Peter slumped against the wall in defeat, even as Ned called him dramatic, and they watched as their classmates ran around excitedly, pointing out random facts and giggling and guessing whether they were real or not.</p>\n<p><em>That’s made up</em>, he heard Abe saying, <em>Spider-Man can’t be afraid of spiders!</em></p>\n<p><em>Think again</em>, Peter thought wryly.</p>\n<p>“I think I’m gonna bail.” He said to Ned. “Wait till lunch, pretend I ate something bad and feel sick, head home. Mr Harrington will be so relieved he’ll probably let me leave without even trying to call Aunt May.”</p>\n<p>“You can’t bail!” Ned squeaked. “Besides, isn’t today a lab day with Mr Stark? And you can’t even get sick anymore so no one’s going to believe that.”</p>\n<p>“Mr Harrington doesn’t know that.” Peter pushed himself off the wall and dusted down his jeans, just as Amy called for them to regroup. They followed the sound of her cheery voice, Ned looking devastated.</p>\n<p>Amy clapped her hands together. It seemed to be one of her main forms of communication. Peter couldn’t help but love the enthusiasm she had for her job. “Okay guys, we’re going to do a brief hour-long tour of the building, just a walk around, until we hit midday. You’ll see all the different company departments that don’t involve practical experimentation – HR, public relations, legal, marketing, etc. Then we’ll go for a half hour lunch… and this afternoon the exciting stuff happens! That’s right, the lab tours!”</p>\n<p>She beckoned them along, and Peter, having seen all of this before, followed with complete disinterest. Ms Potts had personally given him this tour when he had been officially employed as an intern. Not that he could tell anyone that.</p>\n<p>He did enjoy the public relations office (which, as he already knew, Amy informed them had grown by ten times since Tony Stark revealed himself as Iron Man, and another five times since the forming of the Avengers). Half dealt with company-specific information; the other half dealt with superhero-logistics. Peter mostly enjoyed the space for the snippets of conversation you could overhear. He and Tony had sneaked down here one day and tried to guess what situations the employees were trying to diffuse before they ever reached Pepper’s ears.</p>\n<p>They moved on and Peter couldn’t help but wish he hadn’t left his phone behind. As an employee he would have been allowed to keep it on him, even if his classmates hadn’t. But it wasn’t as if he could explain that to Mr Harrington.</p>\n<p>The hour dragged by, but eventually Amy led them to the cafeteria. Well, it was more of an over-sized food court. There were three throughout the Tower, all situated on different floors to try and quell over-crowding during lunch hours. This particularly floor hosted a McDonalds, a Taco Bell, as well as many smaller, independent stores. Peter had almost convinced Tony to let Delmar’s move in.</p>\n<p>Mr Harrington and Mr Warren did a last headcount and instructed them not to stray out sight before everyone fanned out to get there food. They only had half-an-hour until they would be leaving for the lab tours. Peter immediately headed for the hole-in-the-wall Indian place in the corner of the food court, his favourite takeaway during a late-night stint at the Tower. The owner immediately brightened when she spotted Peter walking her way.</p>\n<p>“Pete!” She greeted as Peter stepped up to the window. Two chefs waved from the back. “How are you? What are you doing here in the middle of the day, I don’t think I’ve ever seen you in the sunlight before!”</p>\n<p>Peter laughed, scratching the back of his neck. “Hey Aadhya, I’m good thank you, I’m actually on a field trip with my school class.” He jerked a thumb in the direction of his teachers, and Aadhya popped her head further through the window to take a look.</p>\n<p>“Ah, school, the good old days.”  Aadhya grinned. “Is it the usual then? I’ve just put a fresh batch of bhaji’s in the fryer. They’ll be all crisped up, just how you like them.”</p>\n<p>“Yeah that sounds amazing thanks, but only a half portion of what I usually get, please.” At Aadhya’s curious glance, he clarified. “Big breakfast, and to be honest, I’ll probably be back this evening.”</p>\n<p>Aadhya laughed at the admission, disappearing into the back. Peter leant on the railing and observed the canteen, watching the employee’s go by to see if he knew anyone. It probably wasn’t a good idea. If someone recognised him, Flash would only –</p>\n<p>As if on cue, his senses blared, and a hand shoved his shoulder. Before the spider bite it might have been hard enough to knock him to the floor. Now it barely made him stumble. He made a show of it, anyway, stepping a couple feet forwards as if Flash really did have the strength to move him. He heard the guffaws behind him. “So how’d you get the lunch lady to pretend to know you Parker?”</p>\n<p>Peter turned, raising his eyebrows at Flash and the two friends stood behind him. “I don’t know what you’re talking about.” He said, hoping that Aadhya would return with his food in just a second. In his peripheral, he could see Ned and MJ making their way to the class’ tables with food bags in hand, having stepped away from the Thai place Ned loved to visit.</p>\n<p>“Look, just admit this whole thing is a sham. Honestly, I just feel sorry for you at this point.” Flash said, and started to pretend to cry. “Oh, oh puny Parker lost his parents and he just can’t cope!” The other classmates roared with laughter. Peter didn’t see the funny side. “That’s why you’ve made up this ridiculous lie about knowing Tony Stark, right? To compensate? Honestly could you be more pathetic if you –”</p>\n<p>“Would you just <em>shut up</em>?” Peter snapped, rage boiling up within his chest as he stepped forward and slammed his hand down on the rail he had previously been leaning against. It dented underneath his hand. He went shock still, his entire body shaking.</p>\n<p>Flash stared at him in shock. He tried to recover. “Oh so Puny Parker does have a spine–”</p>\n<p>“I’m so goddam sick of yo–”</p>\n<p>“Here you go Peter!” Aadhya reappeared at the counter with a wide smile and a brown paper bag filled with all of Peter’s favourite Indian snacks. She froze at the stand-off between the two boys. “Is everything okay?”</p>\n<p>Peter was breathing heavily. He pulled his hand up, trying to re-form the railing he had bent out of place, and then snatched the food off the counter. He gave Aadhya a strained smile. “Thank you, Aadhya, I’ll see you around.”</p>\n<p>Aadhya wouldn’t take her eyes off Flash for a second, and when she dragged her gaze back to Peter, her look was concerned. “You too Peter, I put extra sauce in there, just how you like it, and an extra lamb starter. I know it’s your favourite. You have a good tour okay? You know who to call if you need anything.”</p>\n<p>“Yeah, trust me I know.” Peter whispered, and then added, more sincerely. “Thank you.”</p>\n<p>She winked at him, before turning to Flash and the two boys beside him, who all remained looking shell-shocked at Peter’s shouting at them. Peter heard her snap as he walked away, “Well? Are you going to stand there staring or are you going to order something?”</p>\n<p>He plonked down next to Ned and tore into his food, bringing out the first of the four containers Aadhya had given him and smothering the lamb chapati starter in minted yogurt sauce. Ned stared at him. <em>“Dude.”</em></p>\n<p>“What, Ned?” He said, already shovelling the delicious food into his mouth. If he wasn’t so angry, he might have moaned from how good it was.</p>\n<p>Ned shoved his arm, almost causing him to choke, and Peter raised his head in irritation to find half the class stealing glances at him. His cheeks burned red, for what felt like the hundredth time that day. He took another bite of lamb. “What the hell did Flash say to you?” Ned asked. “You never fight back. Don’t get me wrong, I’m impressed like I’m super impressed like seriously we all saw his face go blank and he definitely deserved whatever you did –”</p>\n<p>“Ned, it doesn’t matter.” Peter said. “He made a stupid comment about my parents. Let’s just have our lunch okay. We only have twenty minutes before the tour keeps going. I want this day over as soon as possible.”</p>\n<p>The hacker’s mouth had shut abruptly closed at the mention of Peter’s parents. “I’m sorry.” He said quietly. Peter only shrugged in response, already finished with the first container of food, and bringing out two more. “Hey, are these the bhajis you’re always talking about? Can I try one?”</p>\n<p>“Go for it.” Peter shoved the container towards Ned, glad his friend understood.</p>\n<p>They ate the rest of their food in companionable silence. As their time for lunch drew to a close, Peter watched as Amy turned to Mr Warren and tapped her watch. Mr Warren, in turn, said something to Mr Harrington, and Mr Harrington…</p>\n<p>Mr Harrington looked at Peter.</p>\n<p>The teen avoided the stare of his teacher, already knowing where this was going. He tried to distract himself from the sinking feeling inside his stomach, threatening to expel the food he had just ingested. He took up his containers, Ned’s, and MJ’s as well, and made his way to the garbage. If he was about to be chewed out by his teacher for the third time in the same day he’d rather it be away from the rest of the class. Sure enough, Mr Harrington stood from his seat and made his way over to where Peter was shovelling rubbish into the bin.</p>\n<p>“Peter.” Mr Harrington said. His tone was low, grave. Peter felt numb, uncaring, even though on most days a tone such as that from his favourite teacher would send him into a spiral. “Would you like to explain to me what your confrontation with Mr Thompson was about earlier? Hm? Over in the corner? Because I just overheard Mr Thompson telling his friends that you were <em>bribing </em>a member of staff to say they knew you.”</p>\n<p>“That’s ridiculous.” Peter said stiffly. “I was having a conversation with her, you know, being polite. Flash took it the wrong way and decided to use it to try and incriminate me in something.”</p>\n<p>Mr Harrington took of his glasses and pinched the bridge of his nose. “Peter you’re putting me in a very difficult position right now. You know that, don’t you. I saw the way you walked around so disinterested today, as if you were above it all. I don’t… I just don’t know where this attitude of yours has suddenly come from.”</p>\n<p>“With all due respect Sir, I have followed all the rules you gave me. I haven’t said a word all day about the internship.”</p>\n<p>“You could have told Flash the truth, right there and then.” Mr Harrington said. “You chose not to do that. Can you explain that to me Peter, why it is that you let this ridiculous lie you’ve made up continue on in such a way? Do you enjoy the make believe? Does it not give you any kind of stress? You’re a smart kid Peter, a really smart kid. I’m trying to understand.”</p>\n<p>Peter felt tears of anger prick at his eyes. “It isn’t a lie, Sir.” He said very quietly.</p>\n<p>Mr Harrington gaped down at Peter for a moment, utterly disbelieving, before his lips pressed into a hard line. “Very well Parker.” He said, quietly. “I didn’t want to do this. You are, as I said, a smart kid, but you’ve brought this on yourself. I’ll be calling your Aunt to pick you up from the trip early and first thing Monday morning, I will be speaking to the Principal regarding a suspension.”</p>\n<p>“Mr Harrington –” Peter heard the words like ice splintering inside his mind, pure panic spiking in his chest. He began to argue, already regretting standing up for himself.</p>\n<p>“I said no more lies Parker!” Mr Harrington thundered, his resolve breaking. The entire class sat up like meerkats and stared at them, wide eyed. Mr Harrington could barely keep a class in check on a good day. He never s<em>houted</em>. Peter felt his chin wobble. “Sit with your friends whilst I was call your Aunt. To come here, of all places, and tell these <em>fibs</em>… I’m incredibly disappointed in you.”</p>\n<p>Peter watched, frozen, as Mr Harrington walked away. He felt like he was about to throw up as Mr Harrington clearly recapped the conversation with Mr Warren, and the other teacher only shook his head. Mr Harrington was taking out his phone when Peter finally got his legs to move, walking under the stare of his entire class and Flash’s endless chortles of laughter, back to his table. There was a lump in his throat and his hands were still shaking, the aftermath of his panicking realisation and regret.</p>\n<p>“Peter…” Ned murmured. “I’m so –”</p>\n<p>“Don’t Ned, it’s fine.” Peter could only choke out.</p>\n<p>“I should have said something to him –”</p>\n<p>“Don’t, you’ll only get suspended too.”</p>\n<p>“<em>You got suspended?! Oh my god what are you going to do this is insane holy sh</em>–<em>”</em></p>\n<p>“Ned, <em>please</em>.” Peter pleaded. He willed the tears in his eyes to retract. He couldn’t afford to let anyone see him upset. “Just leave it. Mr Harrington’s calling Aunt May to pick me up, I’m not allowed to stay for the rest of the trip. She’s going to so angry I don’t even want to think –”</p>\n<p>“Mr Parker.” Mr Harrington said from above them. Peter’s head shot up. “Your Aunt is not picking up her phone. Do you have any idea why that may be?”</p>\n<p>Peter paused, heart thumping. “I, uh, no, no I don’t.” He stuttered, truthfully. “She was due on shift at the hospital this morning, but she should still have her phone on her. If she’s been drafted into an emergency it will be switched off though. That’s really the only time she’ll ever turn it off completely.”</p>\n<p>Mr Harrington made a huffing sound. “Let me speak to Amy about what we can do with you, then. You’ll simply have to wait downstairs in the lobby for us all to be finished if need be.” He stalked away, motioning to Amy. They stood in a corner, whispering, and then Amy took out a small device that looked similar to a walkie-talkie.</p>\n<p>“This is a goddamn disaster.” Peter declared miserably. At least he hadn’t thrown up his food.</p>\n<p>“Could be worse.” MJ said across from him. Peter lifted up his head.</p>\n<p>“Oh yeah, how?”</p>\n<p>MJ shrugged. “They could have expelled you instead.”</p>\n<p>Peter gaped at her. “Thanks MJ, that’s really helpful. I feel so much better now.”</p>\n<p>She grinned at him, jutting her head as Mr Harrington approached them for the second time, looking frustrated. Peter readied himself for the worst. Mr Harrington came to a firm stop. “Amy has spoken to the security department and they have refused to let you sit in the lobby until such a time as the rest of the class has finished with the tour.” He said, lips still pulled down in an infuriating frown. “The coach is not returning until four pm and we cannot let you leave the building unattended without your Aunt’s expressed permission. You will therefore be allowed to remain with the class on the tour for the rest of the day, <em>under close supervision</em>, or until such a time as your Aunt returns our call, as is the recommendation of the security team<em>.</em> I don’t want even one more peep out of you, and I’ll still be speaking with the Principal when we return to school. Is that clear, Parker?”</p>\n<p>“Yes, Mr Harrington.” Peter said, seeing how Ned’s face brightened at the prospect of Peter remaining on the tour.</p>\n<p>“You are in serious trouble young man; I hope you know that. Having to involve the security team in this nonsense means we will almost certainly not be allowed back to Stark Tower.”</p>\n<p>“I understand, Mr Harrington.”</p>\n<p>“I’m very disappointed in you Peter. I thought you were one of our brightest students.”</p>\n<p>Mr Harrington strode away, motioning to Amy. The tour guide gave Peter a sympathetic look, though her head cocked to the side as if confused. She seemed to shake it off, and called to the rest of the class, “Okay guys, I hope you all enjoyed your lunch. The canteen is a great place for Stark employees to integrate with members of different departments, but they can’t stay here forever! They’ve got work to do! Midtown… It’s time for the lab tours!”</p>\n<p>The laboratories were on floors ten through seventy, Amy explained. “Floors zero through nine are for entrances, admin, and exhibitions, as well as conference rooms for press statements.” She said, as they climbed into the elevator. “Floors ten through sixty-nine are the labs, ranging in department, expertise, and research or practical focus. Floors seventy through seventy-nine are, as we saw earlier, for marketing and human relations departments etc. Floors eighty through eighty-nine are meeting rooms and offices of high-level employees, such as Ms Potts and the board of directors. There is security on every floor.” The doors of the elevator opened, and Amy strode out, beckoning them down a corridor. “Floors ninety through one hundred, are, of course, the personal floors of Mr Stark and the Avengers team, including their living quarters and personal work spaces. Apparently an entire floor is dedicated to Mr Stark’s personal lab, but I can’t confirm that for certain. No employee is granted access.”</p>\n<p>Peter could have confirmed it. Tony’s personal lab on the ninety-third floor, and it was indeed the entire floor, but Tony predominantly remained in the same section. It was used for theory, smaller practical work, or adjustments on the suits or Avengers tech. Peter had his own workstation in there, an entire corner dedicated to the improvement of the Spider-Man suit and whatever other projects Tony deemed suitable to task him with – just opposite Tony’s own desk, making him the only person in the world allowed to be so close to the genius while he worked.</p>\n<p>But the billionaire-genius-philanthropist also had a second lab in the basement of Stark Tower, where he built the Iron Man Suits and was currently used for all major modifications and testing runs. He split the storage of the now over-forty Iron Man suits between the two spaces. For security reasons, and access during an emergency. He wondered if Amy knew that.</p>\n<p>Peter wasn’t asked, so he didn’t say anything.</p>\n<p>“So, we’re going to have a tour of the biology labs first, then go on up to robotics section of research and development, and then proceed to chemistry and physics. You’ll be able to do some exploring in each, and we have a practical set up for you in robotics and another in chemistry!” Amy’s cheerful disposition, which Peter had admired at the beginning of the day, was grating on him. There was static in his head, the possible beginnings of a sensory overload. He couldn’t wait for the day to be over.</p>\n<p>If he weren’t already in so much trouble, he’d consider sneaking upstairs to Tony’s private living quarters and retrieving the specialised headphones Tony had designed for him. They were going to be marketed for Stark Industries soon enough – noise-cancelling headphones particularly useful for anyone who suffered sensory overloads or panic attacks.</p>\n<p>“Keep walking Parker.” Mr Warren said gruffly from behind him, and Peter startled. That shouldn’t be possible. “You don’t wanna be in any more trouble. Get.”</p>\n<p>Peter followed the class into one of the biology labs. The other students were ogling the workspaces with something akin to awe, eyes wide and mouths open (never recommended in a biology lab). Amy reminded them not to touch anything but allowed them to tour the lab, asking questions of the employees who waved and seemed interested in their presence. They were staunchly reminded to leave the others alone. “This is a place of work, remember.”</p>\n<p>Flash did not seem to receive <em>this</em> memo either. He strode right up to a young intern (Peter didn’t recognise her, but she was wearing a green cord around her neck, which tended to imply the worker was an intern) and began to question her about her work.</p>\n<p>“What’s that?” Peter heard Flash demanding. He was pointing at the intern’s desk.</p>\n<p>Peter watched the intern’s head pop up with surprise. “Oh, I’m sorry, I’m too busy to talk at the moment. I’m sure there are other employees happy to speak with you.” Her head bowed back down to her work.</p>\n<p>“I was only curious about what you were doing.” Flash defended himself.</p>\n<p>The intern’s head turned to the side slightly, looking confused as to why Flash had not yet left her alone. Peter edged closer. “That’s kind of you, but I’m very busy. As I said, I’m sure other employees are willing to speak with you.”</p>\n<p>“What project are you working on?”</p>\n<p>“Young man, I’ve told you twice that I’m busy, so please return to your class. I am not obligated to explain my work to you.” The intern said, her voice terse. She had begun to look nervous, but was standing her ground.</p>\n<p>Peter looked around. No one else had noticed. Amy was chaperoning a large group of the class, along with Mr Harrington, in a Q&amp;A with a couple of the biology majors. Mr Warren was happily talking to who Peter thought might have been head of the department.</p>\n<p>He made his way over to Flash. The intern eyed him even more warily, clearly worried that he was going to join the other boy in his pestering of her. “Flash, come on man, she’s busy. You heard what Amy said. You gotta leave her alone.”</p>\n<p>The intern, Peter could see her lab coat said ‘Penny’, breathed a visible sigh of relief.</p>\n<p>Flash on the other hand, just scoffed. “Sod off Parker. Like you’d risk getting into even more trouble today. I’ve practically got you expelled already.” He threw a wicked grin over his shoulder. “Serves you right for lying.”</p>\n<p>Peter gripped the edge of the work table and promptly let it go again when he remembered what happened to the canteen rail. “Just piss off Flash.” He bit out; teeth gritted. “She clearly doesn’t want to talk to you. Who would?”</p>\n<p>“Haven’t you two caused enough trouble today?” Mr Warren appeared at their sides. They both jumped back. “Really, Parker, after everything that’s already happened? Get away from this poor employee, now.”</p>\n<p>Flash stalked off, looking smug, but Penny caught Peter’s arm before he could go. “Thank you, for that.” She said warmly. Mr Warren’s eyebrows raised. Peter looked his way, worriedly. “I wasn’t sure he was going to leave me alone.” She looked up at the teacher. “Please don’t be angry at…” She trailed off, but looked expectant.</p>\n<p>“Peter.”</p>\n<p>“Peter!” Penny smiled. “He was only trying to get that other boy to leave me alone.”</p>\n<p>Mr Warren snapped his head to the side, but Peter kept his eyes on the floor. He heard Mr Warren clear his throat, the air thick with awkward tension. “Right, well, thank you for that Peter, let’s move along now. We must let the young woman get on with her work. I’m so sorry for the disturbance.”</p>\n<p>“That’s okay, really. Hey, Peter,” Peter turned back around. Penny’s eyebrows were creased. “Do I… do I know you from somewhere? You look so familiar.”</p>\n<p>Mr Warren made an indignant noise in the back of his throat, shooting Peter a worried look. Peter cut in before the teacher could. “No, Penny. I don’t think so. It’s been nice to meet you though.”</p>\n<p>“Nice to meet you too.” Penny said slowly, still seeming unsure.</p>\n<p>“That was good of you.” Mr Warren murmured as they returned to the group. Peter stood stiffly beside him. “I’ll make sure Mr Harrington knows what you did, it should go in your favour after…” Mr Warren trailed off.</p>\n<p>Peter did not say anything in return. Three employees were lined up at the front of the lab, and Amy was checking her watch. “Well, we aren’t expecting in the robotics labs for a while yet,” She was saying. “So I was suppose we have a little bit of time for a question and answer session with the whole class!”</p>\n<p>Hands immediately shot up. “Let’s have them introduce themselves first, shall we!”</p>\n<p>“Hello students, I’m Dr Tarquin, I’m the head of the biology department here at Stark Industries. I oversee all ongoing projects with the help of several supervisors and report them to Mr Stark and the board of directors, whilst also conducting my own research primarily within the field of genetics and specifically it’s relation to medical innovation.”</p>\n<p>“I’m Dr Eden, I’m one of the supervisors working under Dr Tarquin. I help him to manage biological projects under the medical innovation field, and I also supervise the internship programme for the biology department.”</p>\n<p>“And I am Dr Marsedon. I have only been here at Stark Industries for two years so I’m still making my way up the ranks! My speciality is medical technology, so I spend my time split between this lab and several others including robotics and development, researching what technology and equipment Stark Industries may bring to the medical field in the next twenty years.”</p>\n<p>Amy led the class in clapping for them, Dr Marsedon bowed a little. Dr Eden shook her head at him, but the smile on her face was fond. “Please, ask us any questions you may have.”</p>\n<p>“How long did it take for you to progress from employee to supervisor, and from supervisor to the head of department?” Betty cuts in first.</p>\n<p>Dr Eden answers first. “It took me six years to progress to supervisor, after finishing my initial training years. There’s a lot of tough competition here at Stark Industries. It takes a lot of determination to progress through the ranks.”</p>\n<p>Dr Tarquin nodded. “I completely agree.” He said. “I’ve been here since I graduated from University with my doctorate. You begin as an entry-level employee, learning the ropes, that’s a three-year course. Then it took me seven years to progress to being a supervisor, another four until I was named a lead researcher, and then an additional eight until I was made head of department. Though, I wouldn’t change any of that experience for the world.”</p>\n<p>“That’s a twenty-two year wait though!” Flash argued. He looked entirely scandalised. “Didn’t you ever think of leaving, going somewhere where you would have been allowed to progress quicker?”</p>\n<p>Dr Tarquin raised an eyebrow. “There is nowhere better than Stark Industries, young man.”</p>\n<p>Flash blushed. “Right.” He muttered. “Don’t think I’d wait that long though.”</p>\n<p>Dr Tarquin chose to ignore the comment and continued taking questions, whether that be on application and internship process’ (Peter was shocked Flash managed to keep his mouth shut and not ask about Peter’s internship), Ned’s question on their genetics projects, and MJ’s question on female leadership within a science and technology company.</p>\n<p>“Just look at Ms Potts.” Dr Eden said, ending her speech on the topic, throwing her hands up. “I mean… What a role model!”</p>\n<p>“I couldn’t agree more.” MJ nodded. Peter thought she might actually have been smiling.</p>\n<p>“Right then… It’s probably best we get to the robotics lab in the research and development facility.” Amy said, looking worriedly at her watch. “We’ve got a practical session all set up for you, so we really shouldn’t cut into our time there.”</p>\n<p>They said goodbye to the biology department, and Peter ignored Penny’s curious look as he filtered out of the doors with the rest of his classmates. He snorted when one of them whispered, <em>this place is such a maze. I’d get lost every single day if I worked here!</em></p>\n<p><em>You should see floor forty-five. </em>Peter thought, as Ned babbled at his side. <em>That place is a mess. Tony’s been saying for months it needs to be reconfigured. Maybe that could be my project over spring break…</em></p>\n<p>He let his feet lead him to the robotics labs on instinct, more so than following Amy or the rest of the class. He would often duck into the department for materials and on errands for Tony. Luckily, they had been given an empty space for their practical session and there were no employees who would recognise him here, only two training employees tasked with supervising them. “Okay! There are instructions on the tables, you may work in groups of two or three or by yourself if you would prefer, you may use any materials you can find within the room. Go ahead!”</p>\n<p>“So tell me again what Mr Harrington said.” Ned questioned as soon as they were left to their own devices. He, Peter, and MJ had set themselves up on a steel table at the front of the room – once again silently agreeing to station themselves as far away from Flash as possible. MJ had joined them without fuss, which Peter found odd (because she so often liked to work alone and had been given the choice too) but wasn’t by any means complaining.</p>\n<p>Peter smiled at the constant protection Ned afforded him. He repeated Mr Harrington’s words, trying to ignore the way they still created a gaping feeling between his ribs. “And then he told me I’d be suspended, and I would need to go see the Principal first thing Monday morning.”</p>\n<p>Ned was red in the face. “He’s awful.” He declared, quietly, because Mr Harrington wasn’t stood too far away. “I wish you’d just do what I said and prove to them all that your internship is real. Mr Stark would be so angry to know –”</p>\n<p>“Which is exactly why I’m not including him.” Peter said resolutely.</p>\n<p>“He’d want to know –”</p>\n<p>“That doesn’t matter Ned. I mean, it does, I don’t ever want to keep anything from Mr Stark, but he really doesn’t need to know about this, he’d just worry you know what he’s like.” Peter whispered back. He went to continue –</p>\n<p>MJ smacked the instructions down in front of them. They jumped, staring up at her with surprise. “We have to build something.” She told them. “I’m not doing it by myself.”</p>\n<p>They stopped talking. “Sorry MJ.” Peter mumbled. “Uh, what shall we build?”</p>\n<p>They settled on building a small robot that could dance. They only had an hour after all – even though Ned’s idea to include voice recognition would have been amazing. MJ and Peter collected their materials and Peter felt his worries about the day slowly melting away with her quiet presence. Moving his hands gave him the clear mind and satisfaction he had been so far from the past few hours.</p>\n<p>Just over half-way through their time, the hairs on the back of Peter’s neck stood up. <em>Nope. No. I don’t need any more of this today. I’m already suspended. Just keep walking just keep walking</em> –</p>\n<p>Flash hovered just behind their table, pretending to look through materials. “You’re gonna pay for what you did earlier, Puny.” He muttered, loud enough for Peter to hear even without his hearing abilities. “Not that it’s gonna matter come Monday. You remember my Mum’s on the board of directors don’t you. By next week she’ll have turned that suspension into expulsion and I’ll never have to look at your stupid lying face ever again.”</p>\n<p>“And I’ll never have to look at your scrawny squirrel face ever again. What a miracle.” Peter drawled.</p>\n<p>Ned pressed his lips together to keep from laughing, holding a hand up against his mouth. MJ smirked. Flash went red and in one swift move, turned on his heel and purposefully shoved into Peter, who was holding the almost-assembled robot in his hands.</p>\n<p>If Peter were normal, if he were a regular teenager, he would have gone flying to the floor at Flash propelling his body into Peter’s. That did not happen, but it was enough for Peter to jolt, dropping the robot down onto the table. And because Peter had super-strength – and no time to moderate what was happening, the robot made a large <em>crash</em>, denting downwards into the steel.</p>\n<p>The robot cracked. A piece of metal sliced down Peter’s arm, drawing blood, not to mention a hiss of pain from between his teeth. The entire class was staring at him again, Ned and MJ were staring at the dent in the table, where their robot lay with a crack splintering down its side, and it took all of Peter’s power to not turn around and <em>throw </em>Flash across the lab.</p>\n<p>“PARKER.” Mr Harrington’s voice thundered. <em>“I leave you alone for five goddamn minutes –”</em></p>\n<p>A low, beeping tone cut through Mr Harrington’s curse.</p>\n<p>“Three-strikes-and-you’re-out protocol has been initiated.” F.R.I.D.A.Y’s voice sounded out across the room. Peter froze. Mr Harrington jerked his head upwards to look at the ceiling. “Alerting the appropriate authority. Please remain where you are until they have arrived.”</p>\n<p>“Three strikes? Authority?” Mr Harrington squawked. “What does that mean?” He turned to Amy; a pleading expression plastered across his face. “I’m so sorry for the behaviour of this student Miss Curtis, I know he’s been a nuisance, but both myself and my colleague will personally escort him off the premises if the rest of the class is allowed to –”</p>\n<p>But Amy was suddenly staring at Peter, her eyes narrowed in curiosity rather than anger. Peter stared back, raising an eyebrow. Amy dragged her gaze away, saying slowly. “No, Mr Harrington I don’t think that will be necessary. We should wait for the appropriate authority to arrive, as F.R.I.D.A.Y stated. Your student would be better off staying here, as would you.”</p>\n<p>“The appropriate authority has been alerted.” The AI declared. “They will arrive in an estimated fifteen minutes, when their meeting has finished. Please remain where you are. The class may continue with their work in the meantime.”</p>\n<p>There was a second’s silence, before Amy said, “You heard the woman, continue your work.”</p>\n<p>The class quickly bowed their heads. Ned looked at Peter, looking pale. “Are you okay dude?”</p>\n<p>Peter heard Mr Harrington and Mr Warren approaching, the sound of their breath, the heavy beating of their hearts, all amplified. He heard F.R.I.D.A.Y’s announcement in his head. The AI adored him. He would bet his life that it wasn’t his three strikes that were about to be called out.</p>\n<p>“Mr Parker.” Mr Warren said gravely. “I thought we were past this.”</p>\n<p>“He was shoved!” Ned immediately tried to defend him. “Flash shoved him!”</p>\n<p>The bully in question had retreated back to his workspace when the AI’s announcement had rung out and was now looking particularly gleeful. His eyes kept flicking to the door, waiting for Charles Mason to stalk through the door and arrest Peter for damaging Stark Industries property.</p>\n<p>“Shoving someone would not create this!” Mr Harrington jabbed his finger down on the table in front of them, where MJ had lifted up the robot to examine it, leaving the robot-shaped dent behind. “This is the work of careless handling of expensive materials. Peter… Even after everything that’s happened today, you astound me in your recklessness and negligence. This is unacceptable behaviour for anyone, never mind a student already facing suspension.”</p>\n<p>Peter looked up. He could feel like slick slide of blood rolling down his arm, underneath his hoodie, where his teacher could not see. “Mr Harrington I didn’t mean to do any damage –”</p>\n<p>“Just like you didn’t mean to tell lies or bribe a Stark Industries employee or disturb an intern in the biology labs.” Mr Harrington shook his head. Peter went to argue. “Enough, Parker. Sit still and quiet and wait for Mr Mason to arrive, and try to think of ways you can apology to the entirety of your class for your inexcusable behaviour today.”</p>\n<p>Peter stared at his teacher, <em>his former favourite teacher.</em> Wordlessly, he turned away. There was no longer a fire in his chest, only a hollow, empty sort of feeling and a lump in his throat that made him feeling like he might choke. “Okay Sir. I’ll wait for Mr Mason then.” He took the robot from MJ’s hands when she offered it to him. “We need to find a way to fix the robot.” <em>He had wanted to give it to Mr Stark, but he couldn’t do that with a crack running through it. </em></p>\n<p>“No, you won’t be continuing the practical. Leave the materials on the table.”</p>\n<p>“Oh, I don’t think that’s necessary.”  </p>\n<p>Someone squeaked – Peter thought it might have been Amy – as the class turned to gape at the figure leaning against the doorway, his arms crossed, eyebrows raised, and his Armani suit ever so slightly wrinkled. Dark sunglasses were removed by oil-stained fingers and tucked into the V-neck of the man’s t-shirt, leaving his narrowed eyes visibly surveying the class.</p>\n<p>Mr Harrington and Mr Warren had gone white. Flash had gone red. Betty and Abe were gripping each other’s and whispering, ‘<em>oh my god oh my god oh my god’. </em>Others had either frozen or were practically bouncing in their seats. Flash’s cronies had sat up to get a better look. Ned was staring. MJ was smirking. Peter sighed and continued to fiddle with the robot in his hands, not even bothering to look up. <em>This was just the cherry on top of the cake. </em></p>\n<p>“Mr Stark!” Amy dropped her clipboard with a clutter. Luckily, it landed on the desk next to her and not the floor. Tony turned his head and stared at her, unimpressed. “We weren’t aware that you would be visiting this tour.”</p>\n<p>“I didn’t plan on it, but I got an alert from a protocol I set up with F.R.I.D.A.Y so I left my meeting early.” The owner of Stark Industries drawled, pushing himself off the doorway. “Thought I’d come down and check it out for myself.”</p>\n<p>“Your… Your protocol?” Amy spluttered.</p>\n<p>Tony hummed with agreement, and turned to Mr Harrington and Mr Warren. “I assume you are the two teachers escorting this group of students. Midtown Tech, right?”</p>\n<p>Mr Harrington seemed unable to move, so Mr Warren stepped forward, hand outstretched. “Yes, yes Mr Stark, I’m Mr Warren and can I just say it’s an absolute honour to meet you –”</p>\n<p>“Mr Warren are you aware that one of your students is bleeding?”</p>\n<p>Mr Warren blanched, snapping his hand back. “Excuse me?”</p>\n<p>“Your student is <em>bleeding.</em>” Tony stressed. “Bleeding, as in <em>leaking blood.</em> Were you aware?”</p>\n<p>“I… I…” Mr Warren stared around the class. “I wasn’t um, how do you –”</p>\n<p>Tony tutted. <em>Actually tutted, </em>before he directed his gaze past the two teachers as if they had simply ceased to exist. Mr Warren gaped, clearly unsure how to proceed. “You alright kid?”</p>\n<p>“Fine.” Peter replied, monotone, still not looking up from the robot in his hands. He had almost fixed the crack. The eyes of the class snapped from Tony to Peter. Flash’s mouth popped open. Mr Harrington blanched. “Just a scratch.”</p>\n<p>“I’ve heard that before.” Tony scoffed. He stepped away from the teachers and strode to the corner of the room, pulling down a first aid kit and making his way over to Peter’s table. He jutted his head at Ned and MJ as he pulled up a stool. He set the first aid kit on the table and opened the lid. Peter didn’t look at him. “Arm.”</p>\n<p>“It’s only a –”</p>\n<p>“I wasn’t asking you; I was telling you. <em>Arm.</em>” Tony repeated, teeth gritted. Peter held out his left arm. Tony laid it on the table in front of him, gently peeling back Peter’s hoodie to reveal where metal had sliced through skin. Everyone watched with bated breath as Tony examined the wound. “What happened?”</p>\n<p>“Accident.”</p>\n<p>“That’s bullshit.” Tony scoffed again. He took out a wipe from the kit and began to clean away the blood. Peter hissed at the sting. Tony’s grip tightened, keeping Peter’s arm in place, but his voice softened. “Sorry kid.”</p>\n<p>“It’s fine.” Peter murmured. He rested his elbow on the table and propped his chin in his hand, watching Tony clean out the wound. It wasn’t the first time the man had done this for him, they were well past that, but it was the first time Tony had cleaned one of his wounds in the view of other people. Tony didn’t seem to mind.</p>\n<p>“I gotta disagree with you on that bud, the whole fine thing, you know, considering the blood on your arm and your hoodie and your jeans.” Tony finished cleaning his arm and pointed down at the stain on his edge of his hoodie. “Wanna tell me what actually happened?”</p>\n<p>“I already told you it was an accident.”</p>\n<p>“Mr Parker do not sass Mr Stark, show some respect.” Mr Warren admonished suddenly, expression shell-shocked, and Peter lifted his head to see Mr Harrington looking two seconds away from his heart failing, totally white in the face. “Mr Stark I can only apologise for his behaviour it’s been a troubling day –”</p>\n<p>“Oh, you don’t need to tell me. I already know. My AI has eyes everywhere. She’s been following your tour.” Tony interrupted Mr Warren for the second time. He had begun to wrap Peter’s arm in a bandage. He stuck the edge down with gauze, and inspected his work. He patted Peter’s arm. “All done kid. Make sure that stays stuck down, alright.”</p>\n<p>“Thanks. You’ve been watching the tour?”</p>\n<p>“Welcome. And yes.” Tony swivelled round on his stool, pushing back slightly so he was in line with Peter, elbows on his knees, fingers clasped under his chin. He raised his eyebrows once again at the two teachers. He pointed. “Mr Harrington, I presume?”</p>\n<p>Mr Harrington seemed to snap out of his comatose state, having watched unbelievingly as Tony bandaged Peter up. Peter almost laughed. “Yes, yes that’s correct.” Mr Harrington stood up straighter, holding out a quivering hand for Tony to shake. Tony ignored him. “It’s uh… well, very good to meet you, Mr Stark, we’re honoured. Thank you for allowing us to tour your company, it’s been very insightful.”</p>\n<p>“So I hear.” Tony drawled. “May I ask how you failed to notice one your students was bleeding?”</p>\n<p>Mr Harrington flinched, eyes flickering over Peter. “Mr Parker didn’t inform us of an injury –”</p>\n<p>“Mr Parker should not have to inform you.” Tony interjected. “He is a minor under your care. You are responsible for his safety and security during school hours and during excursions outside of the classroom such as this. I assume, considering your tone towards him, you were aware of an incident. Did you not think to check he was unhurt?”</p>\n<p>“Tony… don’t do this –” Peter whispered.</p>\n<p>Mr Warren snapped towards him. “Peter! Do not address Mr Stark like that!”</p>\n<p>Tony’s eyes narrowed dangerously; his mouth set in a grim line. “I don’t think you have the deciding say over what Peter calls me, Mr Warren.”</p>\n<p>“Mr Stark –”</p>\n<p>“And besides, I’ve been trying to get him to call me that for a year. Don’t ruin it for me now.”</p>\n<p>The class froze, as if a sudden artic chill had spread through the room and nailed them to their seats. They stared at Peter, wide-eyed, who grimaced and groaned from his seat next to Tony. Tony smirked a little, nudging Peter’s shoulder with his own before turning his unimpressed look back on Mr Harrington.</p>\n<p>“Excuse me?” Mr Warren spluttered.</p>\n<p>Tony cocked his head. “Peter.” He clarified. If possible, Mr Harrington turned even paler at the falling of Peter’s first name from Tony Stark’s lips. “I’ve been trying to get him to call me Tony for the entire year that I’ve known him, ever since he started working as my personal intern. Took for-bloody-ever. Kid’s a freak about manners, insisted on calling me Mr Stark no matter how many times I complained about it.”</p>\n<p>“I can go back to calling you Mr Stark if you like.” Peter mused, and Tony reached out to ruffle his hair. Peter ignored the stunned looks of his classmates as he leaned into the affectionate gesture.</p>\n<p>“No thank you, mister.” Tony said, a small smile on his face. He curled his fingers and tugged sharply on Peter’s locks, and the young boy let out a small yelp. “And if you dare do it again, I’m restricting your lab time by fifty per cent. No more experimentation for you kid, only theory work, for the rest of the month.”  </p>\n<p>“That’s not fair! You know how close I am to finishing the Polaroid Project!” Peter objected, ducking away from Tony’s clutches.</p>\n<p>“Sorry, sorry may I just –” It was Amy who cut in. Peter and Tony turned to her, pausing their play fighting. Mr Harrington and Mr Warren were staring at them both, horrified expression marring their faces. Peter felt like the weight on his chest had begun to lift. Being around Tony usually did that. “So… this young man, he really does work for you Mr Stark?”</p>\n<p>“Of course he does, for months and months now.” Tony chuckled, but Peter could sense the aggravation underneath it. His hand had come to rest on Peter’s back, tugging the younger boy a little closer to him. “Brightest kid I’ve ever met, brighter actually than most <em>anyone </em>I’ve ever met. <em>And</em> as I’ve frequently told him, he happens to be my favourite young adult in the whole world. Not many teenagers have the highest-level clearance provided by Stark Tower. Actually, he’s the only teenager to have that. Huh.” Tony grinned cheekily at Peter. Ned stifled a laugh at the young vigilante’s blush. “Guess I really do like having you around.”</p>\n<p>“So, the protocol? Three strikes and you’re out?” Amy prompted. Mr Harrington seemed seconds away from throwing up. He had changed colour, from white to green. “We were under the impression that this young man was in trouble for lying, but, if that isn’t the case…”</p>\n<p>“Ah yes, that.” Tony said. He directed an unimpressed look at Mr Harrington. “The protocol wasn’t for Peter. It was for his teachers, and a certain Eugene Thompson.”</p>\n<p>Mr Harrington choked. He had begun to sway on his feet. Peter briefly wondered whether he was going to faint. “Teachers?”</p>\n<p>“Three strikes.” Tony held up three fingers. “Strike number one, calling my intern a liar, despite the fact that he’s a good kid who would never do such a thing.” He dropped one of his fingers. “Strike number two, accusing my intern of and threatening to <em>suspend </em>my intern for lying and bribing a staff member, despite the fact he’s a good kid and would never do such a thing.” He dropped another finger, and wiggled the last one in the air. “And strike number three, accosting him and accusing him of carelessly damaging Stark Industries property despite the fact <em>he’s a good kid and would never do such a thing.</em>” He dropped the last finger, and held his arms up in the air, a half-shrug. His lips pulled to the side in a show of <em>well, that’s that. </em>“Three strikes, Mr Harrington, Mr Warren, Mr Thompson. You’re out.”</p>\n<p>There was a spluttering from the back of the class. Tony swivelled on his seat, spinning around to find Flash at the back of the lab, jaw practically on the floor. “But… but –”</p>\n<p>“No buts.” Tony said sharply. “Mr Thompson you may be a child, but you are also old enough to know better. Despite this, you have been a bully to your classmates, and a nasty one at that. I do not tolerate bullies.” He cast a meaningful look at Peter. “Especially against this particular kid, who I happen to be <em>rather</em> protective of.”</p>\n<p>“Mr Stark –” Flash’s voice was several octaves higher than usual, his eyes bugging from his head as his eyes flickered rapidly between Peter and Tony.</p>\n<p>“Uh, uh, uh!” Tony refused to let himself be talked over. “Mr Thompson you will be allowed to finish the tour with the rest of your classmates, but rest assured you will not be invited back in the near future, so you should look elsewhere for internship and employment opportunities. If you continue to bully Peter, however, please rest assured you will find yourself blacklisted from every college and University in the country and every respectable employer to boot. Don’t test me. Are we clear?”</p>\n<p>Flash gulped, his Adam’s apple bobbing nervously. “Yes, Mr Stark.”</p>\n<p>“Excellent.” Tony’s stool creaked as he turned back to Mr Harrington and Mr Warren. “As for yourselves – as teachers it is your job to create a safe environment for your students. You made grave accusations against Peter with no proof apart from your own assumptions, you made him out to be an instigator when he was in fact the victim, you threatened his education with suspension and let’s just be honest, you’ve treated him goddamn appallingly. I will be in touch with the headmaster of Midtown so rest assured that ‘meeting’ you were going to try and haul Peter in for on Monday morning, will have a very different tone to what you first thought. Capiche?”</p>\n<p>“Capiche.” Mr Harrington whispered back, as if in shock.</p>\n<p>“Excellent!” Tony brightened immediately. He turned to Peter with a Cheshire-cat grin spread across his face. “Now, that wasn’t so hard was it?”</p>\n<p>Peter groaned, edging away from his mentor. “You’re so <em>embarrassing. </em>You were seriously watching us the whole time? You were listening in? Tony that’s so <em>weird?” </em></p>\n<p>Tony only laughed, his smile playful and teasing. He stood and pulled Peter into his side, and despite his complaint Peter went willingly, tucked under the billionaire’s arm. The class watching seemed less confused and more bemused at this point. “I know, I know. I’m the worst. But May made me promise to look out for you today and intervene if, and only if, things got rough. I think the threat of suspension qualifies as rough kiddo. Don’t worry, I’m leaving now. What’s this though?” He tapped the bitesize robot in Peter’s hands.</p>\n<p>“They gave us a practical, build anything we wanted. It got cracked though.”</p>\n<p>“No bother. Want me to take it to the lab? We can fix it together.”</p>\n<p>“Okay.” Peter muttered. “I suppose. Thanks, Tony, for you know, everything.”</p>\n<p>Tony looked surprised for a moment, before reaching out to ruffle the kid’s hair again. His go-to action when he wasn’t sure how to express himself. “Anytime, pipsqueak. Always here if you need me. You gonna stay after the tour and join us for dinner? May already said it was alright.”</p>\n<p>“Who’s cooking?”</p>\n<p>“Meant to be Rogers, which means we’ll definitely be ordering takeout.”</p>\n<p>“Yeah okay.” Peter scratched the back of his neck, cheeks still a faint pink. He was going to get asked so many questions. He just couldn’t find it in himself to care. He smiled slightly. “Tour finishes at four, I have to go get my back from security then I’ll come straight up. You gonna be in the lab?”</p>\n<p>“Amazing. Yeah, that leaves us a couple hours to tinker before we eat so head straight there. I’ve got some new ideas for Natasha’s widow bites, could use the assist of my favourite young adult.” Tony stretched his arms and clicked his shoulders. He made his way to the door, holding their dancing robot in his hands, inspecting it as he went. “See you in a few then, kiddo. Behave, listen, learn, all of that malarkey.”</p>\n<p>“Malarkey?”</p>\n<p>“It’s a great word.”</p>\n<p>“Sure. Sure it is.”</p>\n<p>“Don’t knock it till you’ve tried to bambino.”</p>\n<p>“Just get out.”</p>\n<p>“Oof, kicking me out of a lab that I built, paid for and own. Harsh.”</p>\n<p>“I’m only sorry it didn’t work sooner.”</p>\n<p>Tony’s laugh echoed down the corridor as he ducked out of the lab, departing as suddenly as he had arrived, leaving a stunned class of fifteen-year-olds, two white-in-the-face teachers and one bemused tour guide in his wake. There was silence for a moment. “So… So you really do work here then?” Abe said faintly.</p>\n<p>Peter shrugged. Ned was practically vibrating in his seat. Peter could tell his friend had a hundred and one questions. He really should have asked Tony whether Ned could stay for dinner. Next time, maybe. MJ was watching him curiously. He was surprised she hadn’t taken out her notebook to sketch the entire class, given the looks on their faces. “Yep.” He looked up, and couldn’t help but smile feebly at Mr Harrington. “I told you – it wasn’t a lie.”</p>\n<p>“Peter…” Mr Harrington choked, but didn’t continue.</p>\n<p>Peter shrunk in his seat, awkward under the gaze of his classmates. His confidence was diminishing quickly now that Tony had left the room. He was immensely grateful when Amy clapped her hands together and garnered everyone’s attention. “Well… I know it’s been a surprising afternoon, but you can happily say you’re one of the only tour groups ever to see Tony Stark in the flesh! He very rarely makes an appearance. We’re out of time on our practical but feel free to take your creations with you. We’ve got a final visit to the chemistry labs and then you’ll all be on your way.”</p>\n<p>Peter trudged out of the lab with Ned and MJ flanking him on either side, both of them teasing him for giving away their robot without their permission. His enhanced hearing still picked up the quiet whispers of the rest of the class.</p>\n<p>\n<em>“Holy shit. I can’t believe Puny Parker was telling the truth this whole time.”</em>\n</p>\n<p>\n<em>“Don’t call him that! You heard how Stark threatened Flash. He has eyes everywhere… </em>\n<em>I want to get into Harvard, man.”</em>\n</p>\n<p>\n<em>“He’s the luckiest person in the whole world.”</em>\n</p>\n<p>\n<em>“Didn’t Stark say that Rogers was cooking? Peter’s having dinner with Captain America!” </em>\n</p>\n<p>\n<em>“Why him?”</em>\n</p>\n<p>\n<em>“What makes him so special?”</em>\n</p>\n<p>\n<em>“Are we sure this isn’t some kind of a trick, a simulation?”</em>\n</p>\n<p>\n<em>“Shut up, don’t be stupid.” </em>\n</p>\n<p>\n<em>“Christ… Look at Flash, guy looks like he got hit by a bus. Kinda deserved it, though, don’t you think? He shouldn’t have bullied Parker all these years.” </em>\n</p>\n<p>\n<em>“How do you think they met? Parker and Stark?”</em>\n</p>\n<p>\n<em>“Probably just felt sorry for him.”</em>\n</p>\n<p>They filed into the chemistry labs, and Peter could not help but appreciate how Flash was now avidly keeping his distance, immediately finding the furthest possible seat away from Peter. Ned and MJ seemed to realize that he wasn’t all that interested in the practical work and silently picked up the slack, discussing amongst themselves what they wanted to experiment with. Peter almost regretted his decision to take a backseat when Mr Harrington and Mr Warren walked towards him, wearing identical expressions of regret.</p>\n<p>“Mr Parker.” Mr Warren said quietly. “We wanted to express how incredibly sorry we are. We have treated you, as, uh, Mr Stark quite rightfully said, very badly. We should have believed you from the offset, or at least done our part in listening to your side of the story.”</p>\n<p>“Yes, yes exactly.” Mr Harrington cleared his throat, bouncing on the balls of his feet. “Incredibly sorry. I… The way I spoke to you, Peter, and the things that I accused you of… I’m very sorry. Incredibly sorry. I just never thought it would be possible for…”</p>\n<p>Peter nodded. He still felt numb. “That’s okay.” He murmured, wanting to escape this conversation as soon as possible. “Don’t worry about it, Sir. I get it. It seems crazy. It’s been a year and it still seems crazy to me.”</p>\n<p>“But clearly Mr Stark has taken a keen interest in you, and I applaud you for that accomplishment. I am sure he will help you go very far indeed.” Mr Warren added. He nodded again, and his teachers retreated, heads bowed together. Peter wondered whether they were worried for their meeting on Monday. He would be if he were them. He continued to fiddle with the items on the desk, trying to keep his hands busy with no real purpose.</p>\n<p>“That was kind of a half-assed apology.” Ned muttered, drawing a small smile from Peter. “You alright dude? I mean, I wanted everyone to find out but you kinda look like a ghost right now.”</p>\n<p>“Just looking forward to the tour ending.”</p>\n<p>He didn’t have to wait long. Tony’s presence had extended their time in the robotics department, leaving them with less time to experiment in the chemistry lab. There was some mutterings and complaining but Amy didn’t let it faze her, only reminding them that they’d been privileged enough to see the head of the company, and with a look at Peter slyly reminded everyone about the NDA’s they had signed.</p>\n<p>They were led back downstairs, where Charles Mason was waiting to let them back into the room their bags had been kept in. Peter had just shouldered his backpack, fishing out his phone and checking for notifications when Flash cleared his throat behind him. “Hey Parker.”</p>\n<p>“I’m not interested, Flash.”</p>\n<p>“I know, but I wanted to apologise.”</p>\n<p>Peter stilled. He turned slowly on his heel to face Flash; his eyes narrowed with suspicion. Ned and MJ hovered by his side, watching the interaction, ready to jump in should they need to. MJ had her sketchbook tucked under one arm and was tapping her nails against it. Flash fidgeted uncomfortably, wringing his hands together in front of them with his lips pressed together. “Okay…”</p>\n<p>Flash cleared his throat again. “Mr Stark was right.” He began, through gritted teeth. “I was a bully and a nasty one. I said things about you and spread rumours and lies that weren’t true. I’m sorry I did that.”</p>\n<p>“You’re only saying this because you’re afraid Tony’s going to stop you getting into MIT.”</p>\n<p>“Maybe.” Flash shrugged. “Look, I was wrong, I’m apologising. Take it or leave it. But I am sorry.”</p>\n<p>Peter couldn’t help but feel sorry for Flash. He knew exactly what had turned the boy into a bully – he had an unkind, unpleasant, and often verbally-aggressive father, who had taught Flash his whole life that power was rooted in fear, and fear came from bullying other people. Peter could only hope that this changed Flash for the better. “Okay, thanks.”  </p>\n<p>Flash nodded and turned away, scooping up his bag. Mr Harrington led them out of the room, thanking Amy profusely for her help and hospitality during the day, encouraging the students to do the same. They were walking towards the reception, Peter just getting up the nerve to remind Mr Harrington he wouldn’t be joining them on the coach back to school, when Betty’s voice rang out.</p>\n<p>“Look, there’s Mr Stark again!”</p>\n<p>Peter perked up, and sure enough Tony was leaning against the desks at reception, having a seemingly pleasant conversation with one of the staff. He spotted the group and bid the woman goodbye, making his way over. He smiled at the class. “Hey again everyone.” He greeted, and then winked at Peter. “Thought I’d come and collect you myself kid, make sure there was no more trouble.”  </p>\n<p>“No trouble.” Peter said, weaving through the class until he came to stand at Tony’s side.</p>\n<p>“Glad to hear it.” Tony said, a fond look in his eye. He addressed the class, ignoring their stares as he wound an arm around Peter’s shoulder. “I’m sorry for the interruption earlier, I hear I cut into your time in the chemistry labs. I hope you all still enjoyed the day.”</p>\n<p>“It was great Mr Stark Sir!” Abe gushed immediately.</p>\n<p>“Amazing!” One of Flash’s cronies added. The one who wanted to go to Harvard. “Your biology labs are brilliant.”</p>\n<p>“Thank you.” Tony smiled. “I’m glad you enjoyed it. Now, Mr Harrington, Mr Warren, I’m sure that after the events of the day you won’t mind if I keep Peter with me instead of sending him back on the bus with you. He’d only be coming straight back here to the Tower. Seems a little wasteful, don’t you think?” There was a lilt to his voice that suggested challenge, as if daring the two teachers to disagree with him. </p>\n<p>“Of course, of course.” Mr Warren conceded immediately. Peter thought Tony might have deflated just a little – the man did love a challenge. “We’ll see you on Monday, Peter.”</p>\n<p>“You’ll see both of us.” Tony corrected. Mr Harrington, who had only just regained the colour in his cheeks, began to pale again. “Say sayonara to your friend’s kiddo, we’ve got work to do.”</p>\n<p>Peter shuffled his feet and avoided the eyes of his staring classmates, awkwardly muttering goodbye from beside Tony. Ned strode up and clapped him on the shoulder, MJ smirked at him and held up a hand in goodbye, and luckily the class began to disperse before Tony began to steer him in companionable silence to the private elevator, tucked into the corner of the lobby. There were calls behind them, “have an amazing time Peter, you’re gonna have to tell us all about it on Monday!” from his classmates.</p>\n<p>The elevator doors closed, and Peter let himself fall against the back wall, eyes sliding shut as they were propelled towards the ninety-third floor, groaning loudly. “Thank God that’s over.” He muttered, backpack slipping down his arm and hitting the floor with a thump.</p>\n<p>They were quiet for a moment, Peter enjoying the absence of staring classmates for the first time all day. “So.” Tony said eventually.</p>\n<p>“So.” Peter echoed.</p>\n<p>“You know I’m gonna ask kid.”</p>\n<p>“Yeah, I know.”</p>\n<p>“Why didn’t you tell me about the trip?”</p>\n<p>Peter glanced up. Tony was smirking, his eyes alight with humour, or what probably seemed like humour to those who didn’t know Tony better. There was a lining of hurt in the crow’s-feet by his eyes, a questioning as to why Peter had not trusted him, a wondering of what he might have done wrong. Tony always wanted to be wanted by the people in his life. He wanted to be needed. Peter shuffled closer, pressing himself into his mentor’s side, and was immediately welcomed into the warmth of Tony’s arms. Thoughts of his classmates astonished looks quickly faded.</p>\n<p>“I thought… Well, I knew Flash was probably going to act out, do something stupid, or say something. You know, him not believing my internship was real and all.” Peter told him. Tony listened respectively, only humming in agreement. “And I knew how you’d feel about that. So I just didn’t…”</p>\n<p>“You thought I’d embarrass you, or get all angry and protective and involved.” Tony chuckled, one hand lifting to scratch the back of his neck, expression sheepish. “I guess I lived up to expectation. Was it, uh, too much, what I did? May made me promise not to go overboard.”</p>\n<p>Peter thought for a moment. Thought about all the things Tony had said, the way he had bandaged his arm and protected his integrity and defended him bitterly against the people who had doubted him. How he had never thought, even for a second, that Peter would ever do any of the things he had been accused of.</p>\n<p>“No.” Peter said honestly. “Actually… It was kinda perfect. Thank you, Tony.”</p>\n<p>And Tony <em>beamed</em>. He tucked Peter closer still and pressed a hesitant kiss to the kid’s crown. Peter blushed at the affectionate gesture, it was something Tony had only just started doing with him, and it made him feel warm every single time. “I’m really glad kid, you’d tell me though, right? If I made you uncomfortable? I can always go in and apologise on Monday, swallow my pride and all.”</p>\n<p>“I’d tell you, but you didn’t, and I don’t want you to apologise. Are you really going to go into the school on Monday?”</p>\n<p>“Hell yeah I am. Like I’m going to let them get away with the things they said to you, the things they accused you of! They should know better.” Tony shook his head, hands drawing patterns on Peter’s shoulders. “They’re teachers for god’s sake. I know you don’t like to be called a kid, but you are a minor after all and under their care, they didn’t even notice you bleeding Peter I mean what kind of teacher doesn’t even –”</p>\n<p>Tony continued to ramble on, even after the elevator came to a stop at floor ninety-three and the engineer was steering Peter towards their shared workspaces. Peter found himself not minding all that much – in fact, he didn’t mind at all. Watching Tony get all het up about his wellbeing was making his heart beat just a little bit quicker than before, and his cheeks were definitely a dark shade of red, but it was a far cry better than the hollow feeling he’d experienced earlier.</p>\n<p>His classmates might spend the next few weeks whispering about him, and Mr Harrington and Mr Warren were definitely going to spend the next couple weeks avoiding him, but, Peter supposed, it might just be worth it for the care and the love in Tony’s voice as he described what a good kid Peter was, shook his head at the absurdity of Peter doing anything remotely like what he had been accused of.</p>\n<p>“And another thing Pete, that Flash kid is a certified pain in the –”</p>\n<p>Definitely worth it.</p>"
}