{
  "id": "25704313",
  "url": "https://archiveofourown.org/works/25704313?view_full_work=true",
  "author": [
    "Gotcocomilk"
  ],
  "title": "In Search of an Answer",
  "rating": "Explicit",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "전지적 독자 시점 - 싱숑 | Omniscient Reader - Sing-Shong"
  ],
  "relationships": [
    "Kim Dokja/Yoo Jonghyuk"
  ],
  "characters": [
    "Kim Dokja",
    "Yoo Jonghyuk"
  ],
  "additional_tags": [
    "Angst and Fluff and Smut",
    "Light Bondage",
    "spoilers up through 188",
    "Biting",
    "you cannot convince me YJH doesn't have a neck kink",
    "Strength Kink"
  ],
  "language": "English",
  "series": "",
  "published": "2020-08-04",
  "completed": null,
  "words": "7,848",
  "chapters": "1/1",
  "comments": "204",
  "kudos": "14,408",
  "bookmarks": "1,812",
  "hits": "171,452",
  "summary": "<p>Kim Dokja had spent years walking beside this character and understanding the soul that shone from the page. He had watched Yoo Jonghyuk grow and fall, kill and die, break and regress. He’d watched until the world came alive, and the the reader could walk beside the protagonist.</p>\n<p>He thought he understood Yoo Jonghyuk, but the message flashing in the air said he’d clearly been mistaken.</p>\n<p>Kim Dokja didn’t understand Yoo Jonghyuk at all.</p>\n<p>「 I want to fuck him. 」</p>",
  "notes": "<p>HAPPY BIRTHDAY YOO JONGHYUK IM SO GLAD I MADE IT IN TIME!!</p>\n<p>This is horny for the first 90% and then 10% (non-permanent) sad because it fits in directly before chapter 188 and has spoilers related to it. Sorny, its a sorny fic. Also, waves hands, pretend they spent a long time in the castle wandering around and chilling.</p>\n<p>ENJOY!</p>\n<p>Translation into Russian <a href=\"https://ficbook.net/readfic/0189d485-5c7a-78f1-a759-6b052f464156\" rel=\"nofollow\">here</a>.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>I love to hear if I wrote a particularly captivating or interesting line-- feel free to include it in a comment to feed your friendly neighborhood writing monster.</p>",
  "text": "<p>The first time he heard it was simple. It was clear too, like Kim Dokja was reading from a cracked phone screen under the lights of a subway.</p>\n<p> </p>\n<p>That first thought was so loud.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>It was too bright and too strong, in a way that burned into his mind. It was an unavoidable thought, because the shadows of Yoo Jonghyuk’s mind were unavoidable. Kim Dokja had spent years walking beside this character and understanding the soul that shone from the page. He had watched Yoo Jonghyuk grow and fall, kill and die, break and regress. He’d watched until the world came alive, and the the reader could walk beside the protagonist.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>He thought he understood Yoo Jonghyuk, but the message flashing in the air said he’d clearly been mistaken.</p>\n<p> </p>\n<p>Kim Dokja didn’t understand Yoo Jonghyuk at all.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>「<span class=\"Apple-converted-space\">  </span>I want to fuck him. 」</p>\n<p> </p>\n<p>It hit him like a blow to the head, stunning him into quiet, careful, silence. He must have misread. Read it again, he had been told once, when gentle hands still ran through his hair.</p>\n<p> </p>\n<p>Maybe if he read it again it would make sense. <span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>So Kim Dokja turned his eyes to the message, and read it again. It was unchanged. He blinked, missed a step, foot catching on air for a quiet moment that was too loud among fighters. He corrected it quickly, but the damage was done. Yoo Jonghyuk had noticed, surely. The man was the protagonist after all, with the sharp eyes of a wolf.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>With the eyes of a wolf that wanted to fuck him, apparently.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Kim Dokja triple checked the message, just to be sure. The inked characters hadn’t changed, just like Yoo Jonghyuk’s stare hadn’t changed. The man was looking at him now, intense as a blow that could shatter the heavens. Kim Dokja wondered, for a disbelieving moment, if he was going to be devoured.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“What,” he said, before he could stop the word. A hundred possibilities were spiraling through his mind, but he examined and discarded them as quickly as they came. It couldn’t be another person— Yoo Jonghyuk had to be thinking of him for his attribute to work at all. The thought that had filtered across his mind, quick and decisive and brutal, was real.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Yoo Jonghyuk wanted to fuck him, Kim Dokja. Maybe if he said it out loud it would seem more believable, but that would earn him a sword to the gut.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>He kept his mouth careful shut, even as his mind whirled.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p><em>Are you sure, </em>was his first thought, and he laughed it breathless. <em>Why</em>, was his second, and he picked the reasons apart as he steadied his steps. Was it from anger? Maybe the rage at the changed regression was causing Yoo Jonghyuk’s libido to run out of control. It certainly made some sense— nothing had gone according to Yoo Jonghyuk’s plans, because everything had gone according to Kim Dokja’s instead.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>So, maybe this was anger. Maybe Yoo Jonghyuk wanted a rough and furious fuck, something to ease the rage. For all the pages dancing through Kim Dokja’s mind that could support that, he wasn’t entirely sure.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>This type of situation hadn’t happened before. The protagonist hadn’t shown signs of sexual interest in people who frustrated him before. Kim Dokja should know— he’d read over three thousand chapters about Yoo Jonghyuk’s life, after all. Again and again he’d scrolled through the chapters, until most details he could recall from memory and the scenarios fit in his mind like puzzle pieces. The Ways of Survival may be Yoo Jonghyuk’s story, but it was Kim Dokja’s to read and treasure.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Still, there had been nothing like this. So maybe it was a possibility, but an unlikely one. That left Kim Dokja with little to help him understand, and a mystery blinking before him.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>The thing was, he couldn’t figure out why else Yoo Jonghyuk, the protagonist of this book, would want to fuck him. Sure, the man’s personality was poor, but his face was handsome enough to make up for it. Kim Dokja knew plenty of people who’d swooned over it in the novel, and plenty more who would swoon in this current regression.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Yoo Jonghyuk wasn’t lacking in options, so why was he daydreaming about fucking Kim Dokja?</p>\n<p> </p>\n<p>It couldn’t be Kim Dokja’s looks— really, they were average in comparison to the beauties around him. His face wasn’t bad, to be sure, but it wasn’t as stunning as the others. Yoo Sangah alone could rival some of the finest looks in the long pages of Ways of Survival, and they still had Lee Seolhwa with them.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Yoo Jonghyuk wasn’t lacking in options. It couldn’t be Kim Dokja’s personality either, not when he’d ruined so many of Yoo Jonghyuk’s plans, and the man wanted to kill him more often than not.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Then, what was it? Was Yoo Jonghyuk secretly into fucking his enemies the whole time? Were they even enemies anymore? The man hadn’t wanted them to be called companions, especially when Kim Dokja had first said it. But he’d thought the man had gotten over that months ago. He thought they’d moved past it together, and fought for a new future together.</p>\n<p> </p>\n<p>So, why?</p>\n<p> </p>\n<p>Kim Dokja, for all the pages he’d read and all the scenarios he’d imagined, didn’t know. And really, he didn’t need to find out. It was surely just a one off, and Kim Dokja could continue his plans without worrying about the protagonist acting out of character.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>It would be fine, he thought, as long as the messages didn’t show up again.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p> </p>\n<p align=\"center\">⊱ ━━━━.⋅❈⋅.━━━━ ⊰</p>\n<p> </p>\n<p> </p>\n<p>The messages showed up again. They followed him through scenario after scenario, first tinted black with a sharp glare, and later red with a sharper stare.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Yoo Jonghyuk had no mercy, not even here.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>「<span class=\"Apple-converted-space\">  </span>I want to mark him. 」</p>\n<p> </p>\n<p>Kim Dokja pretended he hadn’t heard that thought, as he pretended at all the others. He stepped faster through the castle, and didn’t think about the message floating beside him. The attribute seemed to be activating more frequently, and he thought he might know why.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>The damn attribute was ratting him out.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>「 I want to pin him down and keep him quiet. I want— 」</p>\n<p> </p>\n<p>Kim Dokja moved before that thought could finish, blood rushing up his neck and down his spine. The others looked around as he moved, half in surprise and half in wariness.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“Are there enemies?” Jung Heewon asked, half standing to reach for her sword.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“No, it’s fine. Rest,” he said, and pulled his coat closer to his body. Damn it, there was no way to leave surreptitiously, not now that everyone was staring at him.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Kim Dokja had not been prepared for this. 4000 chapters had not prepared him for this. A life lived through his phone screen, through the novels and stories of other people, had not prepared him for this.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>He thought that maybe nothing could have prepared him for this. Slowly, he walked to the edge of the camp and stared out, into the night sky that was filled with stars. He could hear the shifting whispers of the others speaking behind him, the curious murmurs and the hushed tones.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>They were worried there might be a problem. They were right, but not in the way they thought they were.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Kim Dokja had a problem, and it was one of the hardest he’d ever faced. A good thing then, that no one else was facing it. He pulled his coat closer, and watched the glint and gleam of stars high above.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>[The constellation ‘Secretive Plotter’ is wondering what incarnation ‘Kim Dokja’ is planning.]</p>\n<p> </p>\n<p>[The constellation ‘Prisoner of the Golden Headband’ is yawning.]</p>\n<p> </p>\n<p>[The constellation ‘Demon-like Judge of Fire’ is worried about incarnation ‘Kim Dokja.’ ]</p>\n<p> </p>\n<p>[The constellation ‘Demon-like Judge of Fire’ has sponsored 500 coins for the incarnation to sleep. ]</p>\n<p> </p>\n<p>“It’s fine, Uriel,” he said, and shifted again. His neck felt like it was on fire. Damn Yoo Jonghyuk for staring at him with such hot eyes, the kind that burned and seared. Damn Yoo Jonghyuk for thinking such thoughts, and damn his traitorous body for wanting to know what the man’s cock tasted like.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>How much must the man hate him, to look so closely? How much must he want? Kim Dokja looked up at the stars, and tried not to know. It wasn’t good for him to hear these kind of thoughts. They were distracting.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>But Yoo Jonghyuk didn’t give him the mercy of ignorance.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>「<span class=\"Apple-converted-space\">  </span>His lips would look good stretched out around me. Red, but stained white. 」</p>\n<p> </p>\n<p>There was no way to not run, now. Kim Dokja was going to die, from the hungry thoughts of a man who he’d known his entire life.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>[The constellation 'Demon-like Judge of Fire' is looking at Incarnation 'Kim Dokja' closely.]</p>\n<p> </p>\n<p>[The constellation 'Demon-like Judge of Fire' is wiping blood from her nose.]</p>\n<p> </p>\n<p>[The constellation 'Secretive Plotter' recommends the incarnation close his coat.]</p>\n<p> </p>\n<p>Kim Dokja looked at the stars and sighed. He tied his coat shut, and pretended the back of his neck wasn’t red and damning. He didn’t care about the lost dignity— it was hard to have dignity at all, when he’d spent so much of his life failing to achieve— but really, he could do without the voyeurism.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>From that night on, it only got worse. The attribute activated when he was least expecting it, and each thought was hungrier than the last.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>「<span class=\"Apple-converted-space\">  </span>His legs would look good wrapped around me. 」</p>\n<p> </p>\n<p>「<span class=\"Apple-converted-space\">  </span>I’ll fuck him hard enough that he won’t be able to die. 」</p>\n<p> </p>\n<p>「 He’d look good whimpering. 」</p>\n<p> </p>\n<p>「<span class=\"Apple-converted-space\">  </span>Maybe if I fuck him, he won’t leave. 」</p>\n<p> </p>\n<p>That last thought made Kim Dokja pause for long enough the others noticed, feet still on the cracked ground beneath him. Was that what this was all about? Did Yoo Jonghyuk think he needed to sleep with Kim Dokja to make him stay? Was he thinking sex would be a bartering tool? Certainly, Kim Dokja’s knowledge was useful, incredibly valuable to a regressor. But Yoo Jonghyuk didn’t know how much he actually knew.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>No, something about this didn’t sit right with him. It was strange and out of character for Yoo Jonghyuk, the man who would go down fighting before admitting to anything.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>It must be wrong, Kim Dokja thought, and kept walking. It didn’t matter, anyway— he would do what needed to be done. Yoo Jonghyuk would have his knowledge anyway, even if it might not be how the man wanted it.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>It didn’t need to be fucked out of him.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>It was a week later, when they had settled into camp for the night and the thoughts had died from a wildfire to a simmer, that Kim Dokja heard the quietest thought yet.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>「<span class=\"Apple-converted-space\">  </span>If I tie him up, will he stop dying? 」</p>\n<p> </p>\n<p>He didn’t stumble at that thought, but he did laugh. That almost sounded like Jonghyuk cared if he died, but that was impossible. The man knew his deaths weren’t permanent, even if he might not know how long that would last. It must be annoying to have to drag a body around.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>If they stopped putting him in a coffin, things really would be easier.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“Don’t be so annoyed, Yoo Jonghyuk. You won’t have to carry my body if I die,” he said, and watched a dark expression build like a storm across Yoo Jonghyuk’s face. He felt a flash of something strange trickle up his spine, ink painted thick and confused. He didn’t understand. Shouldn’t that have helped?</p>\n<p> </p>\n<p>[The constellation ‘Demon-like Judge of Fire’ is sighing sadly.]</p>\n<p> </p>\n<p>[The constellation ‘Secret Plotter’ wonders where the incarnation ‘Kim Dokja’ left his mind.]</p>\n<p> </p>\n<p>[The constellation ‘Demon-like Judge of Fire’ hopes the incarnation retrieves it and displays deep companionship with the incarnation ‘Yoo Jonghyuk.’]</p>\n<p> </p>\n<p>But Yoo Jonghyuk’s expression only grew darker, and the edge of his mouth twitched like he was frustrated. Kim Dokja didn’t know how to describe it himself, but he remembered the words tls1213 had used from the many times he had read through Yoo Jonghyuk’s lives. <span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>‘Yoo Jonghyuk’s eyes never changed when a knife came for his heart, but his lips would tremble.’</p>\n<p> </p>\n<p>Yoo Jonghyuk was hurt. But why?<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>「<span class=\"Apple-converted-space\">  </span>He thinks I—? 」</p>\n<p> </p>\n<p>There was a pause, and the storm in Yoo Jonghyuk’s eyes shifted and broke. It looked hot, and Dokja watched it spark and burn as Jonghyuk stepped closer. He remembered the thoughts he’d heard on and off for the last few months, running through his blood like fire. He remembered that Yoo Jonghyuk could throw anyone across the Seoul, let alone this single scenario. He shifted, and didn’t glance down to see if his blood had gone somewhere else entirely. Try as he might, Kim Dokja hadn’t been entirely unaffected by Yoo Jonghyuk’s stare.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>The man was far too attractive, and the thoughts had been <em>loud.</em><span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>「<span class=\"Apple-converted-space\">  </span>I’m going to tie him up. 」</p>\n<p> </p>\n<p>Kim Dokja took a step back when that message flashed next to his face, but Yoo Jonghyuk was stepping forward faster. The man’s eyes were sharp, like the sword that hung at his waist and the merciless tone of his words.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Kim Dokja took another step back. It wasn’t going to be enough. Damn this protagonist and his unreliable mind. Damn him, and every horny thought the man had had for weeks.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“Hey, wait a minute Yoo Jonghyuk, what are you doing?”</p>\n<p> </p>\n<p>“I’m going to tie you up,” the man said, and a hand curled around his wrist before Kim Dokja could process that yes, Yoo Jonghyuk had said that aloud. Calloused fingers were warm against his skin, pressing over his pulse like ropes come to bind him.</p>\n<p> </p>\n<p>[The constellation ‘Demon-like Judge of Fire’ is holding a hand to her nose again.]</p>\n<p> </p>\n<p>[The constellations ‘Secretive Plotter’ is looking away.]</p>\n<p> </p>\n<p>Kim Dokja wasn’t afraid, but he was wary. Yoo Jonghyuk deciding to intervene now was strange, because they both knew it cost him nothing to die now.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Was Yoo Jonghyuk annoyed that this life had gone so astray?</p>\n<p> </p>\n<p>「<span class=\"Apple-converted-space\">  </span>He’s going to look good tied up and naked. I’ll make his legs shake with every thrust. 」</p>\n<p> </p>\n<p>Kim Dokja felt a flush crawl up his neck, hot and furious. It wasn’t as hot as the fire pooling in his stomach, or the electricity that seemed to dance from Yoo Jonghyuk’s touch.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>He didn’t need to look down to know he was hard from just a few thoughts.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“There are people who would look better—“</p>\n<p> </p>\n<p>The fingers on his wrist stopped. Then they wrapped tighter, hard and bruising. A normal incarnation’s bones would be creaking and cracking at the pressure, with how hard Yoo Jonghyuk was pressing down. But really, it was his eyes that caught Kim Dokja and made him stay still.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>They looked knowing.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>He felt a warm thrill run down his spine, anticipation and fear and lust wrapped into a single, terrible, brush stroke. Damn it, Yoo Jonghyuk really had no right to be so beautiful, and had no right to think such devastating thoughts.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>He especially had no right to be so clever.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>「<span class=\"Apple-converted-space\">  </span>He— 」</p>\n<p> </p>\n<p>Yoo Jonghyuk’s eyes were dark, dangerous in a way Kim Dokja hadn’t seen in a while. Strange, that the protagonist’s eyes hadn’t been so dark recently. Kim Dokja wanted to make plans to make them darker. He wanted to make sure Yoo Jonghyuk didn’t have to clench his jaw so tightly, or look so furious.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Wouldn’t it be alright, this time, for him to be happy?<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>They stood like that, in a silence that Kim Dokja didn’t try to break, and a grip that wouldn’t shift. He didn’t move, not when he wasn’t sure how much he’d given away. It was better to wait and see how bad the damage was.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Then, slowly and deliberately, a thought crossed the man’s mind.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>「 You heard that. 」</p>\n<p> </p>\n<p>Kim Dokja kept his face as calm as possible. He raised his wrist, moving as much as he could with the iron pressure of Yoo Jonghyuk’s grip on his skin. He didn’t run, even though he wanted to.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“Hey Yoo Jonghyuk, you can let me go.”</p>\n<p> </p>\n<p>It would have been impossible to break free without the power of a constellation at his fingertips. Yoo Jonghyuk was far too strong to let just any incarnation go, and his grip was strong from holding a sword.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Kim Dokja, a constellation with many stories, could have broken it. He didn’t. He needed to see how much Yoo Jonghyuk had guessed, needed to plan for this too. It was a case of need, rather than want.</p>\n<p> </p>\n<p>But Yoo Jonghyuk ignored the words, and ignored Kim Dokja. The edge of his mouth went tight, fury and worry and a thousand things Kim Dokja had read of but never seen flashing across his face.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>If this was a key moment in another novel, there would have been someone to soothe away that stress. There would have been a friend to push Yoo Jonghyuk onwards, or a lover to kiss away the frown, or a parent to pull the man forward.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>But Ways of Survival had never be kind to its protagonist, and it wouldn’t start now. In these moments, Yoo Jonghyuk was and had always been alone.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Kim Dokja resisted the urge to reach up.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“Can you read my mind?” Yoo Jonghyuk asked at last, voice like steel and grip too hot.</p>\n<p> </p>\n<p>“If I could, do you think we’d be in this situation?” Kim Dokja answered, letting his tone go wry. He tried to keep his pulse steady, but it was a lost cause with Yoo Jonghyuk standing so close.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>At least the damningly hungry thoughts had quieted for a moment. Kim Dokja was still about to be gutted, but that was something he could deal with. Death was so much easier than Yoo Jonghyuk’s desire.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>[The character ‘Yoo Jonghyuk’ has used the ‘Lie Detection’ skill.]</p>\n<p> </p>\n<p>[Lie Detection can’t determine if your words are true or false.]</p>\n<p> </p>\n<p>But Yoo Jonghyuk wasn’t deterred. The man shifted closer, gripped tighter, stared harder. Kim Dokja spared a moment to regret not tying his coat closed, as the notifications for indirect messages flashed past.</p>\n<p> </p>\n<p>Uriel was probably having a field day. <span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“Answer the question or I will kill you. How much have you heard?”</p>\n<p> </p>\n<p>Damn it, Kim Dokja thought. There would be no escaping this now.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>「 Did he hear— 」</p>\n<p> </p>\n<p>Thoughts spilled out, of the times Yoo Jonghyuk had thought about bending him over and fucking him until he cried, of the days that the man had looked at his lips and imagined slipping a cock between them, of the nights when Kim Dokja had been woken up to the attribute slipping images of him tied down and spread open for Yoo Jonghyuk.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Kim Dokja had been desperately trying not to think of those thoughts. He had been putting them out of his mind for weeks, even when he caught the sight of Yoo Jonghyuk’s jaw or the broad scope of his back or the strength of his arms.</p>\n<p> </p>\n<p>Kim Dokja had tried so hard to not want this. He shifted against the hand on his wrist, and hoped that his pants would hide what they needed to for now. Damn Yoo Jonghyuk for being too attractive, and damn him for this.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>The man’s eyes slid down with Kim Dokja’s motion, tracing the lines of his body like they were about to glow gold and powerful.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>There was no way Yoo Jonghyuk didn’t see.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>「 Is he—<span class=\"Apple-converted-space\">  </span>」</p>\n<p> </p>\n<p>The fingers on his wrist went tighter, for a single painful second, and Kim Dokja thought he might be about to die at the protagonist’s sword. It hadn’t been a good life, but at least the death wouldn’t be permanent, and the boosts to his stats alone would be worth it for the coming scenarios.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Then Yoo Jonghyuk pulled him forward, and Kim Dokja pulled to a stop. That didn’t feel like a threat.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“Where are we going?” He asked, wary. Yoo Jonghyuk didn’t answer, but the man’s grip was rough, and his jaw was tight with a tension Kim Dokja didn’t have the right to soothe away.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“I’m not just going to follow you without an explanation, Yoo Jonghyuk. What are you doing?”</p>\n<p> </p>\n<p>Slowly, deliberately, Yoo Jonghyuk looked at him. His eyes were dark, but a hint of gold lurked under the glare. If Kim Dokja didn’t have the Fourth Wall, that look might have stolen his breath away. It was making a solid attempt, even with the lines of characters shielding him from the world.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>「<span class=\"Apple-converted-space\">  </span>I’m going to fuck you until you can’t stand, and then I’m going to keep doing it, until you learn not to listen to thoughts that aren’t yours. 」</p>\n<p> </p>\n<p>Kim Dokja had never felt his blood rush south faster than in this moment.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“You—“ He stopped, swallowed against a dry throat. He’d known the man wanted to fuck him, how could he not? The thoughts had been broadcasted into his mind, clear as if he was reading them on a page.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>He just hadn’t thought it would actually happen.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“Now, Kim Dokja,” the man said again, pulling at his wrist until he almost stumbled. Thoughts whirled out at the same time, of hauling him up against a wall and sinking in deep, of pressing him down and riding him until they were both panting and filthy and trembling.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>If Kim Dokja’s problem hadn’t been obvious before, it definitely was now.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>[The constellation ‘Demon-like Judge of Fire’ is jumping up and down.]</p>\n<p> </p>\n<p>[The constellation ‘Prisoner of the Golden Headband’ is tugging the ends of his hair and asking why the incarnation is like this.]</p>\n<p> </p>\n<p>[The constellation ’Secretive Plotter’ is looking away.]</p>\n<p> </p>\n<p>“Do I have to follow you if I want to survive, Yoo Jonghyuk?” He asked, and tried to keep his voice steady against the heat flaring up his spine. It was an impossible chore, but he did make an attempt.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>The grip on his wrist tightened for a quiet moment, sharp and almost desperate. Could Yoo Jonghyuk feel his pulse? He wanted to know.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>「 Kim Dokja. Do you get off on hearing my thoughts? 」</p>\n<p> </p>\n<p>“What? No!”</p>\n<p> </p>\n<p>[The character ‘Yoo Jonghyuk’ has used the ‘Lie Detection’ skill.]</p>\n<p> </p>\n<p>[Lie Detection has confirmed that your words are false.]</p>\n<p> </p>\n<p>Damn it, and damn the smirk that was creeping up Yoo Jonghyuk’s face. It was beautiful enough to be deadly, glinting under the sunlight. It would have been playful, if the man’s eyes hadn’t looked so sharp.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“Then yes,” the man said, and let him go to step away. The glare he shot backwards was brutal, but it was the words that Yoo Jonghyuk thought that made Kim Dokja step forward.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>「<span class=\"Apple-converted-space\">  </span>If you don’t follow, I won’t fuck you. 」</p>\n<p> </p>\n<p>He followed, but not because he wanted to be fucked. Well, not only that. Kim Dokja wasn’t made of stone after all, and Yoo Jonghyuk was so very beautiful. The idea of the protagonist pinning him down was enough to ink fire across his skin, and the thought of more, well. <span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Kim Dokja was a weak man.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“I bought the rights to the channel for two hours,” he said as they stepped into the shelter of a tent. There were indirect messages flashing beside him, but he muted them before they could complain anymore. Whatever happened here, Kim Dokja wanted to be able to ask frank questions. He still wanted answers to the why of this whole thing, and while Yoo Jonghyuk had never minced words or hidden from the stars above, the man hated constellations. Besides, Kim Dokja was eliminating other motives too.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>No, for all of these reasons, it was better if this was a conversation between them.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“You can—“</p>\n<p> </p>\n<p>The kiss cut him off before he could say anything more. Kim Dokja’s eyes were open, and he tried to catalogue the expressions flashing over Yoo Jonghyuk’s face. But he couldn’t see enough, not when shadows played over the curve of Yoo Jonghyuk’s cheek, tracing down the protagonist’s jaw and dripping to the floor.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Yoo Jonghyuk was kissing him, and Kim Dokja didn’t know why.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Desperately, he tried to think of other reasons. Was it for the coins? If it was for the coins, Kim Dokja should have stopped that motivation. That’s why he’d had the channel closed, for all that he didn’t really want anyone to see Yoo Jonghyuk like this either.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>But instead of putting Yoo Jonghyuk off, it only made him move faster. The man bit at his lip until Kim Dokja could only groan, and calloused hands tore off his coat like it was an enemy to be defeated. He was kissed until he was lightheaded and breathless, and the entire time thoughts flooded into his mind, strong and vicious.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>「 Your taste isn’t bad. 」</p>\n<p> </p>\n<p>「 I want to make you moan for me. 」</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\"> </span>「 I’m going to take you to pieces, Kim Dokja. 」</p>\n<p> </p>\n<p>Kim Dokja didn’t really understand why Yoo Jonghyuk wanted to, but he wasn’t going to complain.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Yoo Jonghyuk ripped open his shirt, running a hand across across Kim Dokja’s ribs to cradle his hip. Warm fingers seemed to sear his skin, but he couldn’t even take a breath, couldn’t even think past the lips pressed against his.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Yoo Jonghyuk, true to form, was devouring him.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Damn greedy protagonist, he thought, and had the thought kissed out of his mind with the last of his self control. Then the hand on his side gentled, tracing careful circles over the curve of hip and the skin of his stomach.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>「<span class=\"Apple-converted-space\">  </span>He’s too thin.」</p>\n<p> </p>\n<p>Damn it, not every man could be muscled like a protagonist. Kim Dokja had a healthy amount of muscle, but he wasn’t made of it like Yoo Jonghyuk. It didn’t help that he’d only started gaining it during the scenarios.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Cold offices with colder paychecks didn’t lead to a life of good nutrition. Kim Dokja survived, and that’s what mattered.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>He bit the man’s lip back, and the fingers on his hips tightened again.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“Kim Dokja,” the man said, pulling back enough to make it a quiet growl. The air still bushed across his lips, and he couldn’t help but shiver.</p>\n<p> </p>\n<p>Yoo Jonghyuk’s voice was dark and gentle at once, like the final blow in an uneven fight. Kim Dokja thought he might be losing this battle, but he was good at finding clever paths out of sticky situations.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>This situation wasn’t sticky yet but he thought it might get there soon.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“That’s my name,” he responded, and the fingers on his hip slid down and squeezed. A strangled groan worked through his throat, teased out by the mark of Yoo Jonghyuk’s fingers on his ass.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>The man was really going for this, huh?</p>\n<p> </p>\n<p>He shifted forward before he could think, and his chest brushed the thick cloth. The clothes were reinforced and lined with metal, not that Yoo Jonghyuk really needed it. They felt rough across his nipples, catching on sensitive skin and making him hiss.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“You know you don’t need to do this. There are other ways to achieve what you want,” he said, and didn’t think about how he had no idea what Yoo Jonghyuk wanted to achieve here.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Yoo Jonghyuk didn’t respond, but a single icy thought cut into Kim Dokja’s next sentence.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>「 Don’t doubt me, Kim Dokja. 」</p>\n<p> </p>\n<p>“It’s not doubt,” he answered, and felt fingers bruise into his skin. “It’s offering alternative options.”</p>\n<p> </p>\n<p>It was definitely doubt.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>To that, Yoo Jonghyuk said nothing. Instead, he lifted Kim Dokja up, stripped him with quick motions, and thought merciless things.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>「<span class=\"Apple-converted-space\">  </span>I am going to bend you over and fuck you.」</p>\n<p> </p>\n<p>「<span class=\"Apple-converted-space\">  </span>You are going to feel me for days.」</p>\n<p> </p>\n<p>The man pulled the shreds of his shirt off, motions sharp and controlled. Kim Dokja decided that he really didn’t care if any of his clothes survived this, and let Yoo Jonghyuk rip his pants too.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>The man hadn’t taken the other options.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“As you said. I didn’t think you were so repetitive, Jonghyuk-ah.”</p>\n<p> </p>\n<p>The hand that flicked his nipples was annoyed, but the fingers hauling him up and towards the bed were sure and steady. As the man had said, there was no doubt, and no hesitation.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Yoo Jonghyuk, protagonist and regressor, wanted him. Kim Dokja wasn’t sure he’d ever understand that, even if he read it a hundred times.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Some people just had strange tastes.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>「<span class=\"Apple-converted-space\">  </span>You won’t be able to walk.」</p>\n<p> </p>\n<p>Yoo Jonghyuk thought, and manhandled him until he was kneeling on soft sheets. It was embarrassingly easy, but well, Yoo Jonghyuk was the protagonist. Lifting Kim Dokja around was hardly hard work, and neither was moving his body into the perfect, lewd, position.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Kim Dokja almost didn’t want that grip to move off his hips, even if it would feel better around his cock. He hadn’t had time to appreciate it earlier, but Yoo Jonghyuk’s hands felt different on bare skin. Maybe it was the callouses, rough and hard earned. Maybe it was the scars, layering up more and more with each day.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Maybe it was the hunger. Really, Kim Dokja didn’t know.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“Don’t move,” Yoo Jonghyuk said, and Kim Dokja was almost surprised to hear the words out loud.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>He was surprised by many things today, in retrospect. He hadn’t planned for this. He hadn’t thought it would happen, but here he was, face first on a bed that wasn’t his, legs spread and cold air catching at the skin of his ass. If this were before, his knees would soon be bruised and marked, stained red by Yoo Jonghyuk’s weight.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>But this body could take so much more. There was stamina supporting his skin, bought with coins and the hard work of survival. This body had faced off against the scenarios and broken them, with fresh skin and only a few deaths.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>It was certainly sturdy, but somehow, he didn’t think it could take the full force of the protagonist’s anger.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Could it take the full force of his cock?<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Kim Dokja half-frowned against the sheets, and didn’t know. There was nothing in the novel to guide him now, not with Yoo Jonghyuk’s palm resting on the base of his spine. The future was, for the first time, murky. It would have been almost refreshing, if it didn’t make his skin prickle with something like fear.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“Next time, don’t listen to what isn’t for you.”</p>\n<p> </p>\n<p>Kim Dokja thought those thoughts <em>had</em> been for him, actually. They had all been about him, every lewd heartbeat and hungry stare.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“You seem to be misunderstanding something, Yoo Jonghyuk,“ he began, and stopped as Yoo Jonghyuk’s fingers dug into his inner thighs, tracing up and up and up—</p>\n<p> </p>\n<p>Yoo Jonghyuk pressed a slick finger into his ass, and seemed determined to keep Kim Dokja from finishing sentences. He might even succeed, because Kim Dokja was blinking down at the sheets and trying not to gasp.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“You activated it, not me,” he said, and ah yes, Yoo Jonghyuk’s fingers felt so much longer than his own, and could reach so much farther. Kim Dokja felt warm breath against his neck, and knew it was Yoo Jonghyuk’s. He felt rough cloth press against the back of his thighs, and knew it was Yoo Jonghyuk’s. He felt clever fingers twist inside him, and knew they were Yoo Jonghyuk’s.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Dying might be easier than keeping quiet now.</p>\n<p> </p>\n<p>“How?” The man asked against his neck, biting a mark there. <span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“Your thoughts were too strong,” he said, instead off <em>you were thinking of me</em>. It was better to not give too many details of his skills, especially to the protagonist with a thousand skills and fingers in his ass.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>[The character ‘Yoo Jonghyuk’ has used the ‘Lie Detection’ skill.]</p>\n<p> </p>\n<p>[Lie Detection has confirmed that your words are true.]</p>\n<p> </p>\n<p>With a lewd sound Kim Dokja had only heard in porn before, Yoo Jonghyuk’s fingers pulled out. Kim Dokja shivered against the emptiness, against the lack of sensation when he’d felt full. Less than thirty minutes, and his body was already addicted to Yoo Jonghyuk.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>This wasn’t going to end well.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>The fingers trailed up, too firm to be playful and too strong to be ignored. They bruised into his skin, the stinging sensation running up his spine to match the chill and slick sensation of lube. They danced across his chest like it was a battlefield, pressing into every groove and conquering every piece of him.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>When they finally reached his nipples and began to twist, Kim Dokja decided that there was no point in trying to stay quiet.</p>\n<p> </p>\n<p>He moaned, loud and breathless. Yoo Jonghyuk’s hands stilled for a moment, just as the man’s body stilled above him, before they twisted even harder.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Kim Dokja shuddered until he almost fell, shoulders shaking. Yoo Jonghyuk didn’t let up, curling over his back and pressing his hips to Kim Dokja’s ass.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>His hole, still wet and stretched, twitched. His cock twitched too, but that wasn’t a surprise. He’d been achingly hard for a while, body twisted to pleasure by the protagonist.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>And really, wasn’t that the strangest thought of all?</p>\n<p> </p>\n<p>Eventually, Yoo Jonghyuk’s hands slid away, and Kim Dokja could breathe again. He should have known that wouldn’t last for long.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>「<span class=\"Apple-converted-space\">  </span>Do you want to come around my cock, or around my tongue? 」</p>\n<p> </p>\n<p>Kim Dokja turned his face to see the lethal hunger of Yoo Jonghyuk’s eyes, and groaned.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“Both,” he said, and pushed back before he could help himself. The body above him was almost strong enough to keep him still, almost strong enough to keep him from moving at all.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>He liked that.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“I have a greedy heart, you know. Give me both.”</p>\n<p> </p>\n<p>“No,” the man said, and pulled rope from thin air. Kim Dokja, with a sinking feeling, knew where he’d gotten it.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>That damn Bihyung was a traitor to the cause.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Yoo Jonghyuk waited, giving him a long moment to move away, intentions clear and rope gleaming over his knuckles. Kim Dokja only looked at the rope until his vision was strained and his body was shaking.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>The threads were a vicious, beautiful, red. Kim Dokja didn’t break free, and Yoo Jonghyuk’s breath caught above him.</p>\n<p> </p>\n<p>Maybe they were both surprised by this. <span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“Learn the meaning of privacy, Kim Dokja,” the man said, and cracked the rope like a whip.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>There was really nothing he could say to that except—</p>\n<p> </p>\n<p>“My instruction is in your hands then.”</p>\n<p> </p>\n<p>He didn’t struggle as the rope threaded around his wrists and up his arms. Yoo Jonghyuk’s hands moved steadily, smooth with a practice Kim Dokja knew he’d gotten from the years of survival. Though, really, was it fair for him to be so good at tying people up? Yoo Jonghyuk was more likely to kill his enemies than bind them.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Well, it didn’t matter. The protagonist’s fingers were nimble, and it only took long enough for Kim Dokja to think of how bad an idea this was for his arms to be tied behind his back in perfectly tight red rope.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Kim Dokja pressed his forehead against the ground and couldn’t think of a plan to escape this. He didn’t even want to.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Some part of him still couldn’t believe the thoughts that he’d heard for weeks, the slow book of denial refusing to shut its covers.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>But it was hard to deny that Yoo Jonghyuk wanted him when the man’s cock was pressed against the back of his thighs and Kim Dokja was naked and tied up on his bed. It was hard to doubt, when Yoo Jonghyuk had kissed his lips red and bruised and told him not to.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Something in him still wanted to delete it all, but he was no fool. Kim Dokja knew how to read the obvious, inked into the body pressed against his back.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>He was still looking for a third option, but there had only been one answer. This bastard was really going to fuck him.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>A hand settled across the ropes on his arms, callouses rough on his skin. They weren’t as rough as the ropes, or the fingers that had twisted his nipples red and puffy, or the scenarios that paid handsomely for cruelty. They weren’t as rough as Kim Dokja had wanted and expected, shoved down into Yoo Jonghyuk’s bed.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Maybe this would actually break him.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Another hand reached down and pulled his bodyup, until he was settled back against Yoo Jonghyuk’s chest and his legs were spread wide over a broad lap. Armored fabric grazed his skin, brushing the helpless twitch of his fingers, but it was the mouth on his neck that really made him moan.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Yoo Jonghyuk was marking him again, it seemed. Kim Dokja didn’t have the luxury of a turtleneck to hide this, but that was alright. He was rich enough to buy one. Maybe he’d buy one to match the protagonist too, but Kim Dokja didn’t know if he was sleek enough to pull it off.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>He could still try, and with the teeth nipping at his skin, he’d probably have to. Han Sooyoung would give him grief otherwise.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Yoo Jonghyuk bit down, and he twitched, body shifting across the legs below him. Kim Dokja felt wide and exposed, like a toy for Yoo Jonghyuk to move and fuck. With every breath, he could feel a thick cock pressing against his back, the warmth of Yoo Jonghyuk’s breath against his ear, the comforting weight of the hand on his arms.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>He couldn’t find enough leverage to move. And yet, the man hadn’t fucked him yet.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“Has the lesson started? It doesn’t seem so to me,” he said, and felt the body below him shift in the lethal movements of a predator.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>「<span class=\"Apple-converted-space\">  </span>You want me that much, Kim Dokja? 」</p>\n<p> </p>\n<p>It seemed like the man was only thinking that so he could suck a new bruise into Kim Dokja’s shoulder instead of speaking.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>It was an efficient use, honestly. Kim Dokja wished it wasn’t.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“I think you can tell how much I want you,” he said, instead of a resounding, hungry, <em>yes</em>.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“Good,” Yoo Jonghyuk replied, and lifted him up by the ropes on his arms. Kim Dokja sank down around a cock, and felt the breath fucked out of him.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Yoo Jonghyuk was big.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>This wasn’t really a surprise— protagonist, and all that— but it was one thing to know and another to feel every ruthless inch sink into him. Kim Dokja didn’t even have the leverage to control the pace or shift around it, not with his arms bound. All his weight was held in the protagonist’s hands, and they were pulling him down at once too slow and too quickly.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Kim Dokja might die, split around a single, monstrous cock. He wasn’t even sure he’d mind— he had a few deaths left to spare, after all.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“This seems inefficient,” he said, after he’d taken everything Yoo Jonghyuk had and felt it break him. It was speak like this or pant and moan until Yoo Jonghyuk put fingers in his mouth to quiet him.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Kim Dokja had never been a talkative man, but face with this, the choice was simple. Or so he thought, but well, many things had surprised him today.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>He slammed his mouth shut against a moan, as the man started to move him by the ropes, fucking up into his body in quick snaps of lean hips.</p>\n<p> </p>\n<p>Once, twice, five times, Kim Dokja lose count of how quickly Yoo Jonghyuk moved. His skin felt like it was on fire, his body felt like it was used, and he felt wanted.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Kim Dokja wondered if he could cum just like this. His blood was too hot for him to care if it was humiliatingly fast, and really he’d never cared about embarrassment anyway.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>How could he now, when Yoo Jonghyuk was fucking him?<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>No, there was nothing to be embarrassed about except how much Kim Dokja liked this. Yoo Jonghyuk didn’t pull his punches or his cock, apparently. Kim Dokja hadn’t expected otherwise, in the quiet nights when he’d thought about this.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Not that it was a thing he thought about often.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“Shut up Kim Dokja,” the man said, fucking into him and going taut and still. Kim Dokja hadn’t known what the feeling of being filled with cum was like, and he hadn’t known it was something he’d enjoy.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Yoo Jonghyuk seemed determined to show him new things today, he thought, leaning back further and panting against the feeling. He felt full, like he’d been marked inside and out until there was no room in him for anything but Yoo Jonghyuk. The man was still inside him, still holding him by ropes and with strong fingers. He hadn’t even gone soft, even though Kim Dokja could feel cum dripping out of him, slick and damning.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Was this the protagonist’s stamina too? If so, Kim Dokja thought it wasn’t fair to Yoo Jonghyuk’s partners. He thought it wasn’t fair to him, specifically, but then again, the world had never been fair.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>A hand spread across his neck, pulling him around for a hungry kiss. Kim Dokja lost himself in the feel of Yoo Jonghyuk’s lips, in the kiss that seemed to speak words better than any thoughts.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>No, it really wasn’t fair at all.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Kim Dokja didn’t know how long they stayed like that, but he knew when Yoo Jonghyuk pulled out for the last time. It was with a slick sound, and the slow slide of cum out matched it.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>It dripped down his thighs like snow, and Kim Dokja shivered as he was laid down on the bed. The sheets were soft, brushing his cheek and cooling the heat of his skin. <span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>His arms were sore but not numb, the Dokkaebi ropes binding but not bruising him. Had they been specifically designed for this? Kim Dokja wouldn’t be surprised. Surely, there was a market for this too, and where there was a market, the Dokkaebi would capitalize on it.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>He almost didn’t register the ropes coming loose, but he heard the thoughts trickling into his mind again anyway.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>「<span class=\"Apple-converted-space\">  </span>I need to clean him up. Should hold him too. 」</p>\n<p> </p>\n<p>How strange, he thought. Holding, that— it made something twist in his stomach, and even through the trembling in his legs, he tried to push himself up.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>He still had things to do, after all, and he didn’t want to waste more time. And the broadcast would start soon again. Kim Dokja didn’t really mind the voyeurism, but he’d prefer to not show an obvious weakness to potential enemies. It was bad practice to show all the threads of plot too soon. <span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>He tried to push himself up and away, but Yoo Jonghyuk only glared and pulled him into his lap. He fell against Yoo Jonghyuk’s chest, faster than he really should have.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>It was so warm. It was calming too, and he let himself stretch out his arms for a quiet moment. He could move soon. He would move soon.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\"> </span>An arm curled around him too, one holding him steady in the man’s lap while the other rubbed at his fingers. His arms wasn’t even sore, and yet Yoo Jonghyuk seemed determined to work out every kink.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>What was the man doing? This was too soft for the Yoo Jonghyuk he knew, who was only ever gentle with children and a few lovers. Did Kim Dokja count as a lover now? He wasn’t sure he should. <span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“Yoo Jonghyuk…” He started, and if he’d had the strength it would have sounded calm. It just sounded rough instead, like his throat had been moaned hoarse.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Damn, this protagonist didn’t go easy.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“Forget it,” he said instead. Today it would be enough to relax into Yoo Jonghyuk’s arms, and let the exhaustion sweep him away. There were new scenarios to face tomorrow, and the rest of the castle waited for them. Tomorrow, Kim Dokja would read through the Way of Survival, and search for clues.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Today he didn’t need an answer. <span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p align=\"center\">⊱ ━━━━.⋅❈⋅.━━━━ ⊰</p>\n<p> </p>\n<p>He should have known, really. The &lt;Star Stream&gt; was a place to live as fodder for the greater stories.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>It wasn’t a place to find answers. It wasn’t a place for quiet nights either, but they carved out those anyway, Yoo Jonghyuk hauling him around with gentle hands and protecting him with a brutal sword.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Kim Dokja still didn’t know why.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p align=\"center\">⊱ ━━━━.⋅❈⋅.━━━━ ⊰</p>\n<p> </p>\n<p> </p>\n<p>「 I don’t want to kill him. 」</p>\n<p> </p>\n<p>It sounded tired. It sounded small too, in a way that was almost like the later regressions, when the weight of good memories grew too heavy and Yoo Jonghyuk’s shoulders weren’t strong enough to bear them.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>It was strange, that Yoo Jonghyuk sounded like that now. Had there been so many good memories? Kim Dokja hoped there had. Was it selfish of him, to wish some were theirs?<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Maybe, but he thought he could be selfish now, with Yoo Jonghyuk’s eyes boring into him.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>「<span class=\"Apple-converted-space\">  </span>You can hear me, Kim Dokja. You are listening. 」</p>\n<p> </p>\n<p>Kim Dokja nodded, and felt his body sting with the motion. Jung Heewon’s sword had cut deep, justice burning fresh wounds across his body. There were hints of fire burning over his skin, deep cuts of angels on a demon.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Only in the scenarios could someone become a demon so quickly.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>He met Yoo Jonghyuk’s stare with a smile, anyway. The others were still here, and even if Yoo Jonghyuk could do what needed to be done while he cried, they shouldn’t have to see this. They shouldn’t see his pain, not when it wouldn’t last for much longer.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>It would make it harder for the rest of them to move on, but it wouldn’t dull Yoo Jonghyuk’s sword. The protagonist always killed the villains, in the end.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Kim Dokja spread his arms and wings wide, and smiled like a villain.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>“Kill me, Yoo Jonghyuk,” he said, and the man’s expression twisted. Kim Dokja wasn’t sure if he could identify all the emotions inked into Yoo Jonghyuk’s eyes, and he’d spent weeks sleeping in the man’s bed. <span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>He’d spent too long as a reader, maybe. It made it hard to separate out the pieces of hurt.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>「<span class=\"Apple-converted-space\">  </span>I’ll do as you ask, but you will come back. 」</p>\n<p> </p>\n<p>The man’s arm raised, and the one weapon that could actually kill him raised with it.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>「<span class=\"Apple-converted-space\">  </span>You have to come back. 」</p>\n<p> </p>\n<p>The sword gleamed, sharp as a snake’s teeth. It looked brilliant, and its story shone even brighter. Kim Dokja watched it shake, and wondered if he was shaking too.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>Why was the protagonist’s hand shaking? This was a good story. Yoo Jonghyuk could walk away from here, having lost only one life.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>It was such a good story.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>「<span class=\"Apple-converted-space\">  </span>I’ll hunt you down if you don’t. 」</p>\n<p> </p>\n<p>A sword slide into Kim Dokja’s heart, and even through the Fourth Wall he’d never felt sharper pain. He smiled. Darkness crept in across his vision, bleeding black and washing away Yoo Jonghyuk’s eyes.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>That was good. Kim Dokja hadn’t understood what he saw there.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>「 You are my only companion. 」</p>\n<p> </p>\n<p>He couldn’t breathe, not anymore. The messages tried to glimmer into his sight, but they were too faint to see. <span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>「 I—<span class=\"Apple-converted-space\">  </span>」</p>\n<p> </p>\n<p>Had that been the answer?</p>\n<p> </p>\n<p>\n<b>[You have died.]</b>\n</p>"
}