{
  "id": "25757818",
  "url": "https://archiveofourown.org/works/25757818?view_full_work=true",
  "author": [
    "surveycorpsjean"
  ],
  "title": "We Wear Chains on the Weekend",
  "rating": "Explicit",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
  ],
  "relationships": [
    "Bakugou Katsuki/Midoriya Izuku"
  ],
  "characters": [
    "Bakugou Katsuki",
    "Midoriya Izuku"
  ],
  "additional_tags": [
    "Getting Together",
    "Friends With Benefits",
    "Friends to Lovers",
    "Dom/sub",
    "Service Top Bakugou Katsuki",
    "Aftercare",
    "Subspace",
    "Sexual Content",
    "Characters Are Pro Heroes (My Hero Academia)",
    "Master/Pet",
    "Subdrop"
  ],
  "language": "English",
  "series": "",
  "published": "2020-08-07",
  "completed": "2020-08-21",
  "words": "35,088",
  "chapters": "6/6",
  "comments": "999",
  "kudos": "24,414",
  "bookmarks": "5,583",
  "hits": "355,011",
  "summary": "<p>Well, in a day of revelations, it turns out that Izuku isn't as vanilla as Katsuki previously thought. Unfortunately, that fascinating discovery is overshadowed by Izuku's dumbassery, because he has zero concept of aftercare. </p>\n<p>\"Don't go to anyone else,\" Katsuki says, because screw it. He can do a better job anyways. </p>\n<p> </p>\n<p>Or; Katsuki finds Izuku on a bad drop.</p>",
  "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">notes</a>.)\n</p>\n<p>ayeee haha, here i am again on my bs. i wanted to give my own take on some bkdk d/s, if this isnt ur thing thats fine haha. i just wanted to make something a little different. </p>\n<p>thanks guys :)</p>\n<p>it begins</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>wow, im shocked that this was so well received. i thought ppl were gonna hate this, adsfadsf. thank you guys ;-;</p>\n<p> </p>\n<p>small disclaimer, this is my own take on d/s, so don't use this as anything educational ahaha.</p>\n<p> </p>\n<p>\n<a href=\"https://zanimez.tumblr.com/\" rel=\"nofollow\">tumblr</a>\n<br>\n</p>\n<p>strap in....this is a long one</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">more notes</a>.)\n</p>\n<p>i hope this is okay...i spent too long looking it over and now im like dfhasdfasdf</p>\n<p>thanks for all the nice messages! :)</p>\n<p>if you have spotify <a href=\"https://open.spotify.com/playlist/0AVvoQ1l5QuC95hVuAEA7G?si=6s4oLHkpTfqNRNVaauLk7A\" rel=\"nofollow\">here</a><br>is a bkdk playlist i made that ive been listening to alot LOL</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">notes</a>.)\n</p>\n<p>this chapter doubled in size bc i ended up wanting to flesh it out more, haha. i hope it made sense. also dhfasdf thanks for the comments! the last chapter will be a bit of an epilogue to wrap everything up. I can never bring myself to end something right after the ship gets together LOL</p>\n<p> </p>\n<p>\n<a href=\"https://zanimez.tumblr.com/\" rel=\"nofollow\">tmblr</a>\n<br>\n<a href=\"https://twitter.com/zanzimez\" rel=\"nofollow\">twt</a>\n<br>\n</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">notes</a>.)\n</p>\n<p>a big thanks to everyone who stuck with me thru this :) i hope it was okay, i had fun writing it, i might do some similar stuff in the future. I still have a few more ideas, haha. </p>\n<p>have a good one!</p>",
  "text": "<p> </p>\n<p>Katsuki is about five milliseconds away from blasting a hole in this door.</p>\n<p> </p>\n<p>He’s really really thinking about it – weighing both sides seriously, all the pros and cons. On one hand, he gets to stop standing out in the hallway while Izuku continues to flutter around and ignore his phone like a fucking moron – and future cons;  Katsuki gets chewed out for the broken door.</p>\n<p>Ah, well.</p>\n<p>“Deku!” Katsuki kicks the door with his foot. “Open the damn door before I blow the hinges off!”</p>\n<p>Who even let Izuku get his own apartment in the first place? Yeah yeah top ten hero this blah blah strongest that, <em>what the fuck ever, </em>Izuku barely knows how to make rice. This man should not be allowed to live alone, period.</p>\n<p>Aghh, why the hell did Katsuki ever agree to partner up Izuku in the first place? They’ve worked as pros for almost three years now, and sure Deku can throw down in a fight, but Katsuki has about two dozen reports that need Izuku’s statement and if Katsuki gets <em>one more </em>phone call from the hero commission, Katsuki is going to throw someone off a bridge (metaphor, metaphor! Jesus Christ, don’t send him back to counseling).</p>\n<p><em>“Deku!!!</em>” Katsuki hisses. “I’m gonna’ strangle you for this!”</p>\n<p>One more kick, and the lock gives.</p>\n<p>“Fuck me,” Katsuki curses, and steps in to close the door behind him. “Your apartment is a piece of shit. You’re on a pro salary; it’s time you damn well use it!”</p>\n<p>He doesn’t get an answer. Katsuki squints suspiciously, and checks his watch. Izuku’s dumb red shoes are in the hall, and it’s ten pm on a Saturday, so Izuku <em>should </em>be home. Well – unless he’s out with his annoying friends, but that nerd never goes anywhere without attempting to drag him along, or without telling Katsuki about it in a billion texts. His phone hasn’t blown up, so – he’s definitely not out drinking.</p>\n<p>“Yo, Deku? You home?”</p>\n<p>Damn, Izuku will kill him if he finds out he broke into his apartment. Eh, whatever, he’ll replace the lock later. Katsuki sets down his bag and wanders further in. It’s the same as the last time Katsuki saw it; the All Might obsession is less severe, but Izuku still has a few choice posters framed on the wall. Photographs, fanart, a shelf of their team’s first gen of figurines. Kinda’ creepy, but Katsuki won’t pretend he doesn’t have the pre-productions hiding in a bin under his bed.</p>\n<p>Katsuki blinks heavily when he finds Izuku standing in the middle of the kitchen, staring into the sink.</p>\n<p>“Aye!” Katsuki shouts, stomping towards him. “Why the hell’re you ignoring me! I need your sig-”</p>\n<p>Izuku suddenly jumps out of his skin; a full startle, like Katsuki had jabbed him with an electric baton. It’s so sudden that it (almost) scares Katsuki shitless.</p>\n<p>“Oh –” Izuku shakes. “You’re – oh.”</p>\n<p>“Holy shit dude, what the hell is your problem?” Katsuki throws up his arms. “How the fuck did you not hear me?”</p>\n<p>Izuku doesn’t look right. Well – he looks fine physically but – he’s looking at Katsuki like he’s a total stranger. Katsuki leans closer, and Izuku’s eyes don’t track him. Mentally, he’s somewhere far away.</p>\n<p>“Um,” Izuku blinks, and it looks like he’s trying to shake himself out of it. “Sorry. I was – I’m. Kacchan?”</p>\n<p>Okay, that’s weird. Some of Katsuki’s anger ebbs into concern.</p>\n<p>“Oi, what’s wrong? Did you get hit with a weird quirk or something?”</p>\n<p>Wouldn’t be the first time, but hello, it’s their day <em>off. </em>He steps closer, checking Izuku for injuries, but Izuku trembles and slams his back into the pantry cabinet. It rattles and shakes, because Izuku is almost two-hundred pounds of muscle, not unlike Katsuki himself. But the <em>symbol of peace </em>shouldn’t tremble like that. It’s – <em>wrong. </em></p>\n<p>“I’m okay,” Izuku says, and he repeats it like he’s trying to convince himself. “I’m okay, I’m okay.”</p>\n<p>Katsuki snarls, and grabs him by the back of the neck. He tries to get Izuku to look him in the eye, but he’s jerking out of his grip like a disoriented spaz.</p>\n<p>“If you’re on drugs I’m gonna’ be so fucking pissed at you.”  </p>\n<p>“No!” Izuku flinches. “Don’t touch me!”</p>\n<p>That’s…also strange. They’re partners. Katsuki has carried this guy to the hospital on his back more times than he’d like to admit.</p>\n<p>Katsuki grips Izuku’s head like a dog, and pries open one of his eyes by the bottom lid. Izuku is too out of it to fight him, but he’s still naturally strong and a pain in the ass, so Katsuki hisses <em>“Stay still!” </em>and Izuku freezes full stop.</p>\n<p>Well, his pupils aren’t dilated, but they’re not tracking movement. He looks foggy and…</p>\n<p>Katsuki pushes up his bangs to check his temperature. Izuku <em>shivers. </em>Not a flinch, not a fight – but a full body shudder, like Katsuki just scratched down his back with his nails. He makes a short, breathy sound, and Katsuki feels dread squeeze in his stomach.</p>\n<p>“Kacchan,” Izuku exhales. “Sorry. I’m sorry. Don’t touch me – I don’t deserve it – I can handle this, please.”</p>\n<p>\n<em>Don’t deserve it? </em>\n</p>\n<p>Katsuki’s eyes snap wide open.</p>\n<p>There’s no way, right? No way – it has to be something else. Katsuki tries desperately to convince himself, but all the signs are there.</p>\n<p>Katsuki grabs Izuku’s shirt sleeve and pushes it up to his elbow. Sure enough, there are rope burns on his wrists.</p>\n<p>“Well isn’t that a surprise,” Katsuki murmurs. “I didn’t think you had it in you.”</p>\n<p>“Don’t look,” Izuku squirms. “I’m dirty. <em>I’m bad – </em> I was bad – that’s why –” Izuku slams a hand over his mouth, like two sides of his brain are arguing with each other. The reality of the situation hits Katsuki like a bullet train, and his morbid fascination is derailed right out the window.</p>\n<p>“You’re dropped.”</p>\n<p>“Ah. I’m – I’m okay. I deserve it.”</p>\n<p>“Who did this?!” Katsuki growls, grabbing Izuku’s wrist, which has been reddened on top of old scars. He brings it up to Izuku’s field of view. “Deku, tell me their name. Where did you meet them?”</p>\n<p>Izuku struggles to speak.</p>\n<p>“It – doesn’t matter –”</p>\n<p>“Doesn’t matter my <em>ass!</em>” Katsuki shouts, and Izuku flinches hard against the wall, and Katsuki internally kicks himself in the face. He knows he can’t yell right now (no matter how much he wants to), so Katsuki forces himself to be calm, pushes down all the uncanny rage and the desire to explode everything in a ten-mile radius. Katsuki presses his hand to Izuku’s cheek, and tries to speak evenly. “Deku, you’re in subspace right now. Whoever you were with should <em>not </em>have left you like this.”</p>\n<p>“Master was good to me. It isn’t his fault!” Izuku cries, and his voice begins to crack, and Katsuki internally curses this guy to hell and back. Izuku looks embarrassed, like he’s semi-aware of what he’s saying, but can’t stop.</p>\n<p>Alright, one problem at a time. Katsuki pets softly over Izuku’s cheek, and asks, “Does he always leave you like this?”</p>\n<p>Izuku shivers like he’s never been touched in his life.</p>\n<p>“Ye-es sir.”</p>\n<p>\n<em>Sir. </em>\n</p>\n<p>“You’re stuck,” Katsuki notes. He pets across Izuku’s sweaty bangs, and distracts him as he pulls his shirt collar away to see how fucked up his neck is. He can’t see much like this, damn. “Izuku.”</p>\n<p>Izuku’s eyes look up, still blinking like he’s trying to see in the dark.</p>\n<p>“Yes.”</p>\n<p>“You need to go back in.”</p>\n<p>“No no no! I just need some water, please. <em>Please.</em>”</p>\n<p>Katsuki rolls his knuckles over his cheeks, up to his temple, and down to Izuku’s ears. He can feel a possessive instinct taking over, but Katsuki knows he needs to keep a level head about this. Izuku is not <em>his</em> sub.</p>\n<p>“Listen very carefully. I’m going to tell you everything I do before I do it,” Katsuki says. “I’m going to coax you back in there, you’re going to ride out the rest of your drop with me – and then I’m going to pull you back out. Do you understand? I’m going to catch you.”</p>\n<p>Izuku cries, but it doesn’t even look like crying. Water just falls out of his eyes, off his cheeks and to the floor – as if he doesn’t even notice.</p>\n<p>“Ka-cchan?”</p>\n<p>Katsuki could level a town right now. Whoever did this is going to wish they were never <em>born. </em></p>\n<p>It’s eating him up inside – the overwhelming desire to calm and hold and <em>kiss – </em>but this isn’t his – Izuku is <em>NOT </em>his – and Katsuki has to keep those two thoughts entirely separate.</p>\n<p>“I’m going to take care of you,” Katsuki presses.</p>\n<p>Izuku sways a little, and brings a hand to rest at his elbow.</p>\n<p>“Okay.”</p>\n<p> </p>\n<p align=\"center\">~</p>\n<p> </p>\n<p>Katsuki has seen Izuku naked a thousand times, but he doesn’t want to push any boundaries right now (nothing irreparable, nothing that’ll burn this feeble friendship they’ve molded from ash), so Katsuki places Izuku in the tub in his underwear.</p>\n<p>He’s still fighting the drop – Katsuki can see it in his eyes. He gets the bath good and hot, and nudges Izuku by the shoulder.</p>\n<p>“Lay down with your head on the rim.”</p>\n<p>Izuku follows without question.</p>\n<p>“Good boy,” Katsuki blurts, and then flinches. But Izuku’s chest shudders, so Katsuki plays it off. “Quit fighting it. I told you I was here for you, didn’t I?”</p>\n<p>“Yes sir,” Izuku says, and then frowns, like he knows something isn’t right. Obviously, it would be disorienting to receive aftercare from someone you <em>didn’t </em>sleep with, so Katsuki grabs the empty cup off of Izuku’s sink and sits on the rim of the tub.</p>\n<p>“You can call me sir,” Katsuki says, fitting his fingers against Izuku’s forehead. “You can call me whatever you’d like, okay?”</p>\n<p>“Okay.”</p>\n<p>It should be awkward. Katsuki should feel sick and gross – this is his <em>best friend, </em>fuck, but it’s like the other part of his brain has stepped in, and he just wants to be what Izuku needs right now. Whatever the fuck that is.</p>\n<p>“I’m going to pour water on your head.”</p>\n<p>“Okay.”</p>\n<p>Katsuki scoops up water and drizzles it slowly, flattening down curls section by section. He lets it run like a stream, gentle and calming. Water drizzles down wide, firm shoulders, down muscle and scars and scars and more scars.</p>\n<p>Katsuki has done this particular trick on hard cases in the past – and after the third cup of water, Izuku’s eyes slide shut.</p>\n<p>Now, Katsuki can peek at his injuries. He pours another cup of water off of Izuku’s wet hair, letting it run down his back in droplets, and Katsuki studies the rope burns on Izuku’s wrists and throat. They aren’t bloody, but Katsuki can see open wounds on his thighs, leading up and under his boxers – and Katsuki scowls, because he would’ve treated those before letting a partner walk out the door.</p>\n<p>Izuku has had much worse in battle, <em>obviously, </em>but this is different. This is sex, not crime fighting, and if Izuku doesn’t know the difference, Katsuki is about to give him the lecture of a lifetime.</p>\n<p>“Idiot,” Katsuki whispers, then bites his cheek. Luckily, Izuku didn’t hear it, so Katsuki grabs the shampoo and lathers it in his hands. “Izuku, are you with me?”</p>\n<p>“Yes.”</p>\n<p>“Good,” Katsuki says, and leans forward to lather up his hair. “I want you to feel good, but I want you to stay with me.”</p>\n<p>“I’m with you,” Izuku repeats, and Katsuki’s chest rolls around in content. This is difficult because Katsuki doesn’t know <em>what </em>their scene was, and has no idea what Izuku is into, or what is comforting in the first place. Fuck, this is <em>Deku. </em>As of thirty minutes ago, Katsuki thought he was as vanilla as they came.</p>\n<p>Alright, well. Praise has gotten him this far, let’s throw shit at the wall and see what sticks.</p>\n<p>“You’re doing perfect, this is exactly what I asked. I’m very proud of you for sticking it out this far.”</p>\n<p>Izuku gasps, and when his eyes open, they’re what Katsuki was looking for; fuzzy and far away and <em>calm. </em>He’s under again.</p>\n<p>“Thank you.”</p>\n<p>Hmm, so he’s a baby, not a brat. Alright, praise it is then. Shoulda’ known, damn Deku.</p>\n<p>“Still polite as ever,” Katsuki says, and rises the shampoo out of his hair. “Tip your head back like – mhm, like that. Someone trained you well.”</p>\n<p>Izuku looks at him happily, puffed up and proud, and Katsuki is relieved, because that’s what he <em>should </em>look like right now. He’s staring at Katsuki all fond, and this is what Izuku’s caretaker would be receiving, if he’d done his fucking job right.</p>\n<p>With time, Katsuki notices that he’s pulling Izuku’s attention. He’s no longer floating in the middle of nowhere, but is focused on Katsuki as he finishes washing his hair. It feels good. Like he’s stealing precious treasure from a huge dickwad.</p>\n<p>“Yes,” Katsuki praises. “Keep watching me. Good <em>boy, </em>Izuku.”</p>\n<p>He rubs his knuckles into Izuku’s cheeks. Circles and circles, he pets up to his scalp, then under his chin like a dog. Izuku turns his head this way and that, eager to please – which are all good signs. Katsuki wants to keep him under just a little while longer, until it’s safe to bring him back.</p>\n<p>“Does this feel good?”</p>\n<p>“Yes sir.”</p>\n<p>“Are you happy?”</p>\n<p>“Yes sir.”</p>\n<p>“Are you telling me the truth?”</p>\n<p>Izuku hesitates. He stares through the haze, but grounds himself in Katsuki’s hands.</p>\n<p>“I was hurting earlier. But I’m happy now.”</p>\n<p>“Good. Stay here.”</p>\n<p>Izuku jerks to grab at the front of his shirt, and Katsuki damn near falls in.</p>\n<p>“No! Please!”</p>\n<p>“Oi,” Katsuki huffs, steading himself. “I’m grabbing your clothes, calm down. Count to twenty, and I’ll be back.”</p>\n<p>“Twenty?”</p>\n<p>“Yes.”</p>\n<p>Izuku lets go, and Katsuki stands to go hunt through Izuku’s bedroom. He finds boxers and a t-shirt, which is just about all he’ll be able to wrestle Izuku into right now. Under any other circumstance, he’d keep a sub naked to avoid over-stimulation and promote more skin-on-skin contact, but he’ll have to make do.</p>\n<p>Izuku has just reached twenty when Katsuki comes back.</p>\n<p>“Well done. Now do exactly as I say.”</p>\n<p>He gets Izuku out of the bath and into dry boxers. He tries not to look, holding up the towel – but he has to keep Izuku upright, and he gets a glance at how <em>badly </em>Izuku’s ass is bruised, and Katsuki feels rage all the way up to his eyes.</p>\n<p>They’re messy bruises. Like the slaps were random. They’re not the marks of a hand, either – likely a belt, and they’re way too high, not at all where someone should be spanked. This guy was sloppy.</p>\n<p>Katsuki would <em>never </em>make a mark that didn’t have meaning. Each bruise is deliberate and planned like a brush stroke. Izuku just looks like he lost a fight. It <em>disgusts </em>him.</p>\n<p>Izuku wiggles the shirt on, and Katsuki has to refocus himself.</p>\n<p>“Okay, well done. Now c’mere you.”</p>\n<p> </p>\n<p align=\"center\">~</p>\n<p> </p>\n<p> </p>\n<p>Izuku’s room is a fuckin’ mess, but Katsuki throws aside shit and clears a space so he can pull Izuku’s head in his lap. Izuku goes like a natural, curls right up on his thighs like he belongs there.</p>\n<p>Katsuki feels shitty, because Izuku would never, under any circumstance, <em>ever </em>do this with him. But this isn’t his Izuku right now – and Katsuki tries to remember that.</p>\n<p>Katsuki pets through damp hair, twisting the strands around his fingers and creating movements that will be easy to predict and focus on.</p>\n<p>“I want you to come back now, okay?”</p>\n<p>“Mmm.”</p>\n<p>“I’ll talk you through it,” Katsuki sighs, setting his head back against the headboard. “It’s going to hurt at first. Like shining a flashlight in your eyes. But it’ll be warm, real fuckin’ warm. Just walk that way and keep going, I’ll catch you.”</p>\n<p>“Warm,” Izuku sighs, and they lay there for a long time. Enough that Katsuki memorizes the posters on Izuku’s wall, so much that he sees them when he closes his eyes.</p>\n<p> </p>\n<p>It’s the calm before the storm.</p>\n<p> </p>\n<p align=\"center\">~</p>\n<p> </p>\n<p>Izuku ends up dozing, and comes to after another half hour. He stirs suddenly, rolling out of Katsuki’s lap and rubbing at his eyes.</p>\n<p>“Ahh god,” Izuku groans. He thumbs over his wrists, then his shoulder, and Katsuki can see that he’s physically feeling again.</p>\n<p>“Welcome back,” Katsuki snaps.</p>\n<p> </p>\n<p> </p>\n<p>Izuku jolts.</p>\n<p> </p>\n<p>Katsuki stares him down.</p>\n<p> </p>\n<p>The air conditioner kicks on.</p>\n<p> </p>\n<p>“Oh, fuck,” Izuku breathes.</p>\n<p>“Hi.”</p>\n<p>“Oh, fuuuck,” Izuku slaps his hands over his eyes. “I didn’t dream that up, did I?”</p>\n<p>“Nope,” Katsuki growls, and swings his legs out of bed. “Put on some fuckin’ pants. You’ve got some explaining to do.”</p>\n<p>“Kacchan, I…I don’t even know where to begin, I’m so sorry—”</p>\n<p>“Pants!” Katsuki snaps with his fingers, and Izuku groans loudly.</p>\n<p>Katsuki prepares tea in the kitchen, slamming cabinets and rattling the teapot on the stove. His heart is split in two directions – the hidden side that still wants to coddle and protect, and the self that is <em>livid </em>right now.</p>\n<p>Izuku waddles into the living room, jumping into a pair of sweatpants, and Katsuki crosses his arms.</p>\n<p>“Name. Now.”</p>\n<p>“It was just a hookup,” Izuku rubs his eyes. “Nobody you know.”</p>\n<p>“Don’t care, give me a fucking name.”</p>\n<p>“Kacchan,” Izuku frowns. “It’s not – it’s not like that. I just – I got too into it. It was my fault.”</p>\n<p>“Please tell me you didn’t drive home.”</p>\n<p>“I didn’t, I took a taxi.”</p>\n<p>“That guy sent you home <em>in a taxi,</em>” Katsuki shouts, getting louder. “<em>Alone. </em>While you were <em>fucking dropped, </em>Deku!”</p>\n<p>Izuku’s face reddens, and he looks at the counter bashfully as he takes a seat at the barstool.</p>\n<p>“It was only my third session with this new guy and um, I should’ve set more boundaries. It’s really no big deal. I’m really sorry you had to see me like that.”</p>\n<p>“New guy, huh?” Katsuki crosses his arms. “This is all news to me. Did your old squeeze give you aftercare?”</p>\n<p>“Well…no,” Izuku scratches his chin, which has gotten a little stubbly this late at night. “I never really needed it. Felt uh – too personal and <em>ack! </em>Why are we talking about this?!” Izuku presses his face in his hands. </p>\n<p>“Because apparently, you’re a moron.”</p>\n<p>“Hey!”</p>\n<p>“You never told me any of this,” Katsuki frowns, pulling off the tea when it screams. “You tell me everything. You tell me about every new freckle on your ass. You tell me about your <em>pet rock.</em>”</p>\n<p>“It’s a cactus,” Izuku frowns.</p>\n<p>“How long have you been into SM?”  </p>\n<p>“Uhh, maybe a year?” Izuku rubs his head. “And how would I even tell you?! <em>Hey Kacchan, I like to have my ass slapped in bed – </em>yeah right, you’d chew me apart.” Izuku blinks. “Well. I thought…you would.” A beat. Katsuki can physically see him put the pieces together. “You knew what had happened, just from looking at me.”</p>\n<p>“Same coin, different side,” Katsuki sneers. Izuku pales and looks away.</p>\n<p>“Ah.” Izuku sets his elbows on the counter, and presses his forehead to his hands. “Damn. For me…it’s just a stress reliever. I like to, um, not think about life for a minute. Please don’t worry about me.”</p>\n<p>“Oh, I’m not worried,” Katsuki says, angrily sliding tea across the counter. “I’m fuckin’ pissed. You just let any asshole out there tie you up? Do you know how dangerous that is?”</p>\n<p>Izuku scowls, and slams his hand on the counter.</p>\n<p>“I’m not a whore!”</p>\n<p>“Then don’t let people treat you like one!”</p>\n<p>“I don’t! Do you really think I’d do that? I run background checks, I -”</p>\n<p>“I don’t care if they’re a fuckin’ <em>saint. </em>If they let you walk out the door like that, then they’re a pathetic waste of a human not worth your time.”</p>\n<p>“I don’t need to be babied!”</p>\n<p>“Obviously, you do!”</p>\n<p>Izuku flinches. Katsuki’s chest tightens, and he feels sick, fuckin’ <em>sick, </em>because the switch between whatever happened an hour ago and this fight right now – it hurts his brain. It’s all out of sequence, it’s all <em>wrong. </em></p>\n<p>Izuku breathes in and out, and then folds his hands and bows his head.</p>\n<p>“Thank you for taking care of me.”</p>\n<p>Katsuki swallows. He then glowers and jerks his chin away.</p>\n<p>“Tch. Don’t let it happen again.”</p>\n<p>Izuku nods, and he fiddles with his fingers around the cup of tea, and the distance between them feels a million miles long. Katsuki’s fingers are still pruney from the water. He can still feel Izuku’s hair in his hands, if he thinks about it.</p>\n<p>Izuku speaks again, and this time it’s infuriatingly soft.</p>\n<p>“Are we okay?”</p>\n<p>Katsuki’s heart wrings, but he doesn’t let it show on his face.</p>\n<p>“Why wouldn’t we be? You think I’m gonna’ look at you different, now?” The look on Izuku’s face tells Katsuki <em>yes, </em>and Katsuki sighs. “Dumbass. I’ve seen you do too much stupid shit to be thrown by now.” Another sigh. “And obviously, I’m no different.”</p>\n<p>Izuku breathes a laugh out of his nose, and looks up at Katsuki through his eyelashes.</p>\n<p>“Right, you’re a dom. I remember bits and pieces – you were good at it.”</p>\n<p>“I’m a good master,” Katsuki replies coolly, and Izuku’s eyelashes flutter.</p>\n<p>“Ah. Haha. Guess I should’ve known.”</p>\n<p>They’ve been friends for twenty years (minus about five in the middle there). Katsuki has dragged this man back from the brink of death. Izuku has given him CPR three (four) times. They’ve shared hospital beds and cried in each other’s arms and they beat the everliving shit out of each other at least once a year. Katsuki can’t let this person leave – he’d kill Izuku himself before he ever let him walk out of his life.</p>\n<p>What’s one more layer?</p>\n<p>“Don’t go to anyone else,” Katsuki says, and Izuku’s head snaps up so fast, it’s impressive that it doesn’t fly clean off his shoulders.</p>\n<p>“Wh-what?”</p>\n<p>“I dumped my last sub a month ago,” Katsuki shoves his hands in his pockets. “I can take care of you.”</p>\n<p>Izuku looks like he’s seen a ghost.</p>\n<p>“Are you – are you talking about sex?!”</p>\n<p>“Yeah? What about it?”</p>\n<p>“Sex with <em>me?!” </em>Izuku points at his chest. “<em>Me?!!” </em></p>\n<p>“Oh my god yes, <em>you, </em>you fucking dumbass,” Katsuki scowls. “Do I gotta’ spell it out for you? Let’s make a contract.”</p>\n<p>Izuku flounders, waving his hands around.</p>\n<p>“Wh-wh – <em>why?!” </em></p>\n<p>“Because <em>obviously </em>you’re too irresponsible to scout doms yourself,” Katsuki hisses. “You think I’m gonna’ let my hero partner run off and get his ass killed ‘cause he tried to walk home on a bad drop? Hell no, not while we’re in the top ten.” </p>\n<p>“It won’t happen again!”</p>\n<p>“Bullshit!”</p>\n<p>“Don’t make fun of me, Kacchan,” Izuku frowns. “You’ve made your point, okay?”</p>\n<p>“I can take care of you,” Katsuki reiterates. “I’ll make it good, better than that sloppy bastard.”</p>\n<p>The room comes to a chilly standstill. </p>\n<p>Izuku swallows thickly. He rubs absently at his wrists.</p>\n<p>“Don’t I…disgust you?”</p>\n<p>That pisses him off. </p>\n<p>“Why the fuck would I think that?”</p>\n<p>“Well…”</p>\n<p>“Look, we’re friends,” Katsuki grips the counter from across the bar, and leans closer. “It ain’t gotta’ be serious, it’s just sex. Tell me one good reason why not – a <em>good </em>one. I know I’m hot, so don’t lie to my face.”</p>\n<p>Izuku sinks back and presses his hands to his reddening cheeks.</p>\n<p>“Kacchan! This is crazy!”</p>\n<p>“So? We’re crazy.”</p>\n<p>“I know,” Izuku sighs, and then laughs. “I know.”</p>\n<p>Katsuki doesn’t quite smile, but his eyes squint.</p>\n<p>“Send me your list. I’ll come up with some terms and – fuck, see if we’re compatible.”</p>\n<p>Izuku snorts and sets his head in his hand. “Probably are, if our history is anything to go by.” He hesitates, and looks up at Katsuki with those big puppy eyes that betray his stature. “Kacchan?”</p>\n<p>“Hm.”</p>\n<p>“Just…promise me if this doesn’t work out, that we’ll still be okay.”</p>\n<p>“You’ve thrown up in my lap before,” Katsuki says. “If anything was gonna’ be the dealbreaker, it was that.”</p>\n<p>“I apologized!”</p>\n<p>“Yeah, and you’re off whisky for life. Where the fuck do you keep your weed?”</p>\n<p>“Cookie jar top left.”</p>\n<p> </p>\n<p align=\"center\">~</p>\n<p align=\"center\"> </p>\n<p align=\"center\"> </p>\n<p> </p>\n<p>Everything is about to change.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Everything is normal on patrol the next day.</p>\n<p>Almost…too normal.</p>\n<p><em> So </em> completely and utterly <em> normal, </em>that towards the end of their shift, Katsuki starts to question if the previous night even happened at all.</p>\n<p>Izuku is at the top of his game today, and it’s pissing Katsuki off. They have a minor altercation with some drug dealers, and Izuku deescalates the situation before they even come to blows. Kind of a blue-baller. Katsuki wanted to break a few teeth, at the least.</p>\n<p>Well – they’re seasoned at playing good cop bad cop, so when Izuku turns his back, Katsuki gets up in their faces and sneers, popping explosions off his hands.</p>\n<p>“If I find out you’re sellin’ any more drugs to kids, you fucks are gonna’ wish you were never born.”</p>\n<p> “Give them a break, Kacchan,” Izuku says sweetly, and damn him, he never remembers to use his fucking hero name. “Help me cuff these guys, please?”</p>\n<p>Katsuki huffs, but stomps over to help. He <em> swears </em>one of the villains starts to laugh at him, and Izuku is forced to use his black whip to hold Katsuki back, which is satisfying.</p>\n<p>“Shoulda’ let me knock a few heads,” Katsuki says later, while undressing in the locker rooms.</p>\n<p>“They’re just a crowd that got into some bad business,” Izuku says, pulling off his gloves. “I think they’re good people, deep down.”</p>\n<p>Endeavor can be a dick, but he’s got a nice agency. The faculties are fancy, and Katsuki doesn’t mind mooching off him, or stealing the soaps in the bathroom (shh).</p>\n<p>“Tch. You think everyone is <em>good inside</em>. It pisses me off.”</p>\n<p>Izuku smiles at him, and it’s so alarmingly <em> cute </em>that Katsuki ends up throwing his gauntlets into his locker a little too roughly. Something definitely broke, but that’s a future problem.</p>\n<p>He’s shaking into a pair of jeans when Izuku approaches him. His face is a little pink, but the look in his eyes is solid with determination.</p>\n<p>“Um. This is for you, before I forget.”</p>\n<p>Katsuki raises an eyebrow, and looks at the folded piece of paper Izuku is handing him. Katsuki snatches it, and his entire demeanor changes as he registers what it is.</p>\n<p>Alright. So it wasn’t a dream.</p>\n<p>The paper looks like it’s been photocopied — like Izuku has handed it out before – and that particular detail makes his mouth burn. <em> But, </em> he’s distracted by the fully detailed kink list, with little checkmarks and handwritten notes like ‘ <em> yes please’ </em> and ‘ <em> only if i’m informed beforehand’ </em> and ‘ <em> absolutely not xx’ </em>.</p>\n<p>“Hmm.” Katsuki skims the list. “So you haven’t changed your mind yet.”</p>\n<p>“Uh. No.” Izuku rubs his hair, which has long been caked in sweat and dirt. He keeps it shorter these days, in an attempt to look more mature for his branding. “Unless you’ve changed <em> yours </em>?”</p>\n<p>“Hmph, it’s like you don’t even know me. I don’t half-ass shit, <em> Deku. </em> ” He grins at some of the kinks checked <em> yes, </em>and then carefully folds the paper and tucks it in his front pocket. “Looks like we’ll be getting along.”</p>\n<p>Izuku quickly turns back and marches to his locker, and the stiffness in his shoulders is also kind of cute.</p>\n<p>“Okay! Good, good good.”</p>\n<p>“I’m free on Friday. Half n’ Half is teaching the interns and I want to be faaar away from this hellhole.”</p>\n<p>Izuku laughs, and he looks a little less freaked out.</p>\n<p>“Okay. I can do Friday.”</p>\n<p>“My house <em> only,” </em>Katsuki points. “I hate your apartment.”</p>\n<p>“It’s not that bad!”</p>\n<p>“Don’t care, your neighbors suck and the hallway smells like cheese.” Katsuki throws on a shirt. “Block out a good few hours, and turn your pager off before you come.”</p>\n<p>Izuku flushes again, and he laughs as he ties his shoes.</p>\n<p>“Oh, okay. It’s going to take that long?”</p>\n<p>“Don’t make that face, nerd. A written list is one thing, but I gotta’ figure some shit out myself.” Katsuki slams his locker shut. “Count it as a trial run.”</p>\n<p>Izuku makes a thoughtful face. “Hmm, well that would make sense. No hard feelings if I don’t like it?”</p>\n<p>“Nah, but I’m the shit, so that won’t happen,” Katsuki grins, and Izuku rolls his eyes, nosing back into his locker. Katsuki shoves his keys in his back pocket and asks, “By the way, do you jack off?”</p>\n<p>Izuku damn near falls over. He scrambles upright, blinking rapidly and gaping like a fish.</p>\n<p>“Uhhhhh. Well, <em> yeah. </em>”</p>\n<p>“Cool,” Katsuki says, checking his phone. “You’re gonna’ have to quit that.”</p>\n<p>“<em>What?” </em></p>\n<p>Katsuki grins, and steps closer. Izuku presses his back to the lockers, and Katsuki stays on the other side of the bench, threatening, but an arm’s length away.</p>\n<p>“Hmm, you thought this would be easy? As of right now, your orgasms belong to <em> me. </em>Do I make myself clear?”</p>\n<p>The heavy swallow in Izuku’s throat is attractive and pleasing. His gaze drops down and up, before looking Katsuki in the eye.</p>\n<p>“Yes.”</p>\n<p>“Sweet,” Katsuki says, and flips his phone around his fingers. “See you tomorrow, dipshit.”</p>\n<p> </p>\n<p align=\"center\">~</p>\n<p> </p>\n<p>Katsuki has one quick stop before he goes home.</p>\n<p>He cornered one of their techs earlier in the day, and convinced her very kindly to do a little digging for him (only a few minor death threats, nothing to worry your pretty little head over).</p>\n<p>He received the details on his phone thirty minutes ago. IT might’ve been forced to do a little hacking into Izuku’s email — but it’s for the better good (It was also a relief to find out that Izuku was known only under a code name. At least he’s not a complete moron).</p>\n<p>The roads are empty post rush hour, and Katsuki walks in the streetlights as he detours downtown. He took a taxi partway, and now looks up and down for the specific apartment address. A dog barks behind a chain link fence, and the background noise gets quieter as Katsuki ascends up a stairway.</p>\n<p>The door is old and chipped and has water damage at the corner. The whole place smells like trouble, and it pisses Katsuki off even more.  </p>\n<p>He knocks three hefty times, and it rattles the hinges. When he gets no response, he knocks again; the door flies open quickly. The man is a wolf hybrid, big and grey and intimidating to someone else, maybe.</p>\n<p>“Hey! What the hell do you want? Do you have any idea what time it is?”</p>\n<p>“Sure do,” Katsuki says, and steps forward, up to the line of his door. “I have a delivery for you.”</p>\n<p>“Eh? You don’t look like amazon.”</p>\n<p>“Nope. It’s a message.”</p>\n<p>Katsuki grabs him by the front of his shirt, and slams the wolfman up against the outer wall of the apartment. Katsuki gets right in his face, so close he can feel his breath.</p>\n<p>“You won’t be seeing Bunny anymore.”</p>\n<p> </p>\n<p align=\"center\">~</p>\n<p> </p>\n<p>Katsuki pins Izuku’s list to the corkboard in his office. He’s definitely got some thinking to do. Just like anything else – if Katsuki is going to do this, he’s damn well going to do it right.</p>\n<p>This is nothing he can’t handle. Poor Izuku has no idea what he’s in for.</p>\n<p> </p>\n<p align=\"center\">~</p>\n<p> </p>\n<p>Izuku is a little grouchy the next day. Katsuki has a few guesses why.</p>\n<p>He corners him in the agency hall and frowns. Izuku has a cute face by nature, but it can look so <em> mean </em>when he scrunches it up like that. Katsuki also knows he has the physical ability to pop Katsuki’s head off his shoulders like a barbie doll — not that Katsuki is intimidated by that. Just mindful. </p>\n<p>“You did something, didn’t you?”</p>\n<p>“Fuck off, I do lots of shit,” Katsuki says. “I’m a busy guy.”</p>\n<p>“Fang-san called and dumped me. He sounded very distressed.”</p>\n<p>“Good, don’t need ‘em anymore, right?” Katsuki flicks Izuku’s nose, and passes him on the way to their office. “C’mon, quit slackin’, there's work to do.”</p>\n<p>Izuku puts his hands on his firm, round little hips and marches after him, and Katsuki feels smug, so he grins at the intern getting coffee, and nearly scares the shit out of her in the process.</p>\n<p> </p>\n<p>\n<br>\n<br>\n</p>\n<p align=\"center\">~</p>\n<p> </p>\n<p>By Thursday, Katsuki texts Izuku a contract. Nothing fancy — just a refined list of everything he’s willing to perform — and Izuku gives him the okay. </p>\n<p> </p>\n<p> </p>\n<p>The game begins.</p>\n<p> </p>\n<p align=\"center\">~</p>\n<p> </p>\n<p> </p>\n<p>Friday rolls around, and Izuku shows up in a vintage All Might hoodie and donut socks, so, we're off to a great start. Katsuki isn’t nervous because he doesn’t <em> get </em>nervous – this is old hat by now – but Izuku looks like a bag of internalized stress, and fuck if that isn’t Izuku in a nutshell anyways.</p>\n<p>“It smells so nice in here,” Izuku chirps, toeing off his dumb shoes.</p>\n<p>“Yeah, see what happens when you clean?”</p>\n<p>“I clean! Just uh – not like this. How do you find the time?”</p>\n<p>“You make time,” Katsuki says, and leads him through the living room.</p>\n<p>Katsuki bought a townhome the very minute he could afford it, because he hated having neighbors on top of him, and fuck the broken apartment elevator. He takes good care of his place because he’s not a slob, and also ‘cause he was used to weekly visitors for a while there (if you know you know).</p>\n<p>Izuku might sound relaxed, but Katsuki can see tension from his feet to his damn ears. That’s fine; technically, it will be Katsuki’s job to get rid of it.</p>\n<p>He’s tamed worse, anyways. Nothing so personal, but Katsuki can cope. Izuku on the other hand…</p>\n<p>“Set your shit wherever.”</p>\n<p>“Okay.”</p>\n<p>Izuku has never been in his bedroom before (err, not since he moved). Izuku’s eyes immediately snap to his bedposts, and Katsuki watches him nose around, like he’s trying to find out where all the toys are hidden. Katsuki won’t say, because that’s part of the fun.</p>\n<p>Katsuki starts to rummage around in his walk-in closet, and he barks impatiently.</p>\n<p>“Sit already, Jesus. You’re acting like a friggin’ virgin.”</p>\n<p>“Sorry!” Izuku forces a smile, and sits on the edge of the bed. “This is just kinda’…weird, you know?”</p>\n<p>“You’ll get over it.”</p>\n<p>A raw silence passes. Izuku digs his finger into the carabiner hooked on one of the bedposts.</p>\n<p>“Jeez. Is your whole room outfitted for this?”</p>\n<p>“That’s for me to know and you to find out,” Katsuki sneers. He finds the gloves he was looking for, and tucks them in his back pocket. “You’re stiff as a board, so we gotta’ fuckin’ talk.” </p>\n<p>“I’m not —!” Izuku bites off, and then flounders. “I mean, it’s just been a long week, it has nothing to do with <em> you — </em>“ </p>\n<p>“Hey.” Katsuki crosses his arms, and Izuku looks up at him, finally. “If you want to walk out the door right now, I’ll never bring it up again.” </p>\n<p>Izuku actually looks concerned. At least he no longer looks like he’s going to barf. </p>\n<p>“Why would I do that?” </p>\n<p>Katsuki chews on his tongue, flicks it around in his mouth, and figures he owes Izuku this, at the least. </p>\n<p>“It was marked on your list, but I dunno’ if me hitting you is going to be such a good thing, considering our history.” </p>\n<p>Izuku’s eyes gloss over, and his voice sounds touched. </p>\n<p>“Oh, Kacchan. That was so long ago, please don’t worry about anything like that.” </p>\n<p> Izuku is an adult who can handle himself, so Katsuki shrugs and says, “Your call.” </p>\n<p>“Thank you. I um, I appreciate that.” </p>\n<p>Alright, let's get a move on. </p>\n<p>“I’m going spell out everything for you, so pay attention.”</p>\n<p>Izuku looks him up and down, and then nods shallowly. Katsuki stares back neutrally. </p>\n<p>“Good. To start out, you can undress to your comfort level. For today, I won’t take off anything that you don’t remove yourself.”</p>\n<p>Izuku has the nerve to look surprised. Tch, Katsuki knows he isn't virgin mary, but he's not a <em>complete </em>asshole. </p>\n<p>Izuki relaxes slightly, “Okay.\"</p>\n<p>“Don’t call me by my name, that’s an obvious one,” Katsuki says, stepping closer. Izuku reaches for his hoodie and pulls it off by the back, but Katsuki can see that his hands are unsteady. “What’s your safeword?”</p>\n<p>“Um. I use the stoplight.”</p>\n<p>“Fine.” Katsuki slides on one glove, and watches Izuku tense even further. They fit snug, without a single wrinkle, perfectly tailored to Katsuki’s hands. “This will be a skin barrier to help you disconnect. Familiar?” </p>\n<p>Izuku wets his lips nervously, and nods at the floor. </p>\n<p>“Yeah.” </p>\n<p>“Izuku.”</p>\n<p>His head jerks up, and Katsuki scowls at him. “Stop freaking out. Trial run, remember?”</p>\n<p>Izuku nods, and twists his fingers in the hem of his t-shirt.</p>\n<p>“Right.”</p>\n<p>He’s too tense. Katsuki sighs out of his nose, and steps to close the door and lock it.</p>\n<p>“Tell me what you’re thinking.”</p>\n<p>Izuku exhales. He presses his hands to his face, breathes in and out, and attempts to level his voice.</p>\n<p>“Sorry. I just…can’t wrap my head around the fact that you want to do this with me.”</p>\n<p>Hmm. Katsuki flicks on the LEDs under his bed, and Izuku startles as the room glows a deep purple.</p>\n<p>“It’s the same as you, isn’t it?” Katsuki approaches, and Izuku nervously folds his shirt in his lap. “Some people like to give up control. I like to take it.” Izuku’s breath hitches, and Katsuki stares down at him. “I know you, Deku. You’re stubborn as an ass and you fight me tooth and nail every damn day – but this ain’t that. We’re not heroes right now. I know you’ll be good, and do exactly as I say, won’t you?”</p>\n<p>Izuku looks out of place on his bed, glowing purple from the neon, his eyes unsteady on the floor. For a moment, he looks years younger. Like the big-eyed, naive little dork that broke bones just to pass class.</p>\n<p>Izuku swallows thickly, his face going through several emotions, before he nods obediently. He ages again, this moment. The surefire gaze of a man who's stood next to him through hell. </p>\n<p> </p>\n<p>Katsuki internally grins.</p>\n<p> </p>\n<p>\n<em> Got him.</em>\n</p>\n<p> </p>\n<p>Katsuki gestures to Izuku’s state of undress.</p>\n<p>“Is this it?”</p>\n<p>“Yes sir.”</p>\n<p><em> God. </em>The title rolls down Katsuki’s back like a friggin’ chill. He doesn’t let his face show it; instead, he studies Izuku, cross-legged on his bed, shirtless and in dark jeans. Hmmm, Katsuki can make do with this.</p>\n<p>“Give me your clothes.”</p>\n<p>Izuku hands them over, and Katsuki sets them on his side chair. He doesn’t make any unnecessary motions, doesn’t move out of Izuku’s field of view, doesn’t walk too quickly.</p>\n<p>There’s a chance that they won’t be a good matchup; that no matter what, Izuku won’t be able to get out of his head. But Katsuki has too much pride to let that happen, so. </p>\n<p>“I’m going to teach and you’re going to listen, because obviously nobody did you right in the first place,” Katsuki says. Izuku looks like he wants to argue, but he sits on his hands and nods. “Good. Submission is a mental game.” Katsuki stands at the foot of the bed, and gestures for Izuku to slide closer. “It’s not always about getting your rocks off – it’s about <em> going </em>somewhere. About placing a hundred percent of your trust into someone else’s hands.” When Izuku is close enough, Katsuki reaches out and drags two fingers along the line of Izuku’s cheek. His eyelashes flutter, and Katsuki presses his leathery fingerpads into the pressure points on his jaw. “That’s what you like, right? Tell me.”</p>\n<p>“I don’t want to think,” Izuku agrees, closing his eyes. “I don’t want to be in control.”</p>\n<p>“Perfect, because that’s my job.” Katsuki maps out his nose, his forehead, his ears, like he’s measuring Izuku to see if he’s up to snuff. “I don’t give punishments, I give rewards. Please me, and you’ll be rewarded. Do as I say, and maybe I’ll smack that fat ass of yours.”</p>\n<p>Izuku’s breath comes out uneven and soft and it’s <em> perfect – </em> just what Katsuki is looking for. He wants Izuku to feel breathless, wants him to give up the tension in his shoulders and let Katsuki just <em> take – </em>take all that and throw it away.</p>\n<p>The mood has shifted already.</p>\n<p>Izuku is sitting back on his heels, and Katsuki will admit, the idea of such a powerful person kneeling in front of him is attractive. But it’s different, too. This is <em> Izuku, </em>his hero partner, the person he might just hold the highest amount of respect for; and now he has chosen to let Katsuki take the reins. It feels good. It’s what gets Katsuki off.</p>\n<p>“Open your mouth,” Katsuki says. Izuku parts his lips, watching him curiously. Katsuki pets over the shiny swell of his lips, before sticking one gloved finger over his tongue. Izuku makes a surprised <em> mm! </em>sound, and Katsuki hums back. “Good. Do as you’re told, and I’ll be satisfied. You’re safe with me, sweetheart.” </p>\n<p>The watery look in Izuku’s eyes makes his chest hurt. </p>\n<p>There is a bigger game at play here. Deku the <em> hero, </em>the man who fights fires, who breaks bones and sees death on the daily. He’s here, and he wants to be free of that weight, and Katsuki can’t blame him ‘cause fuck, he’s got his own problems, too. </p>\n<p>He pets two fingers deep into Izuku’s mouth. Drags them long and slow. Katsuki pinches his tongue, pulls a little, but gets no verbal response. Izuku is quiet, only gagging softly when Katsuki pets too far. He’s methodical, choosing to rub on the hooks of Izuku’s teeth, and he eventually strokes the roof of his mouth like a dog.</p>\n<p>Izuku’s face is pink, but he dutifully stays still, pretty and shirtless and oh, he’ll look so good when Katsuki is done with him.</p>\n<p>Katsuki fucks his fingers in his mouth, slow and fast like it’s his own cock, and Izuku looked tolerant at first, but now his eyes are squeezed shut, lips stretching to fit three of his fingers, and watching him squirm makes Katsuki feel gratification in his bones.</p>\n<p>“It’s just my fingers,” Katsuki reminds. “Does that get you hot already? So <em> easy</em>.”</p>\n<p>Izuku makes a noise in complaint, so Katsuki suddenly shoves his fingers as far as they’ll go, and Izuku’s eyes water heavily; but he takes it, wiggling his tongue between leather. In and out, back and forth, Katsuki hooks his fingers down and peels his mouth open wide. He lets Izuku get used to his presence, lets him adjust to the power shift. Izuku is still tense, but he’s listening.</p>\n<p>“Very nice,” Katsuki observes, and pulls out. “Your compliance pleases me. Say thank you, Master.”</p>\n<p>Drool slips down Izuku’s chin, but he doesn’t hesitate to look up and say, “Thank you, Master.”</p>\n<p><em> He’s fucking perfect, </em>Kastuki thinks, with a little bit of dread. One of the most powerful heroes in the world, vulnerable in his hands.</p>\n<p>Whatever. Katsuki is <em>stronger. </em></p>\n<p>His gloves are slick with drool, so Katsuki holds out his hand and says, “Lick them clean.”</p>\n<p>Izuku reaches for his wrist, and Katsuki yanks back his hand.</p>\n<p>“I did <em> not </em>say touch me. Apologize.”</p>\n<p>“Sorry, sir,” Izuku fidgets. Katsuki nods, and gives him his hand back. Izuku has to sit up higher to reach, and he licks like a dog, steady circles around each digit, swallowing spit and the taste of leather, and when Katsuki says <em> good boy, </em>Izuku groans soft in the back of his throat. It’s musical. It makes him hard – which is a separate revelation. Katsuki didn’t have doubts, but. He didn’t think it would happen so quickly.</p>\n<p>Izuku is surprisingly erotic. Pink tongue, sparkly freckles and deep, feeling eyes. He’s masculine, too – a fine line of both. Hmmm. </p>\n<p>“Well done. I want to tie you now, tell me how much you want it.”</p>\n<p>“I want it very badly, sir,” Izuku says, and looks up through those damn eyelashes. “Please, tie me up.”</p>\n<p>“See how easy that is? You’ve already earned a reward,” Katsuki says, dragging his wet glove down to the knot in Izuku’s throat. He pushes with his thumb, and Izuku chokes just a little. “Do not move.”</p>\n<p>Katsuki steps away to find his red rope. Izuku stays perfect on his knees, staring blankly at the wall, but his eyes are still tracking when Katsuki returns, so that’s good. He doesn’t want to drop him into subspace today – he just wants to push a few buttons, and see what clicks.</p>\n<p>“Turn around with your arms behind your back, wrists together.”</p>\n<p>Izuku follows suit. Katsuki works through a simple knot, winding the rope under Izuku’s armpits, building several layers before threading a large sequence of knots down Izuku’s spine.</p>\n<p>“I’m binding your arms,” Katsuki explains clearly. “It pushes out your chest, makes you look very pretty.”</p>\n<p>Izuku’s breath catches.</p>\n<p>“Pretty?”</p>\n<p>\n<em> Right. Praise. </em>\n</p>\n<p>He binds his arms tight, testing the hold and the release before he’s satisfied. The muscles in Izuku’s arms are thick, and this position pushes out his pecs and strains the tendons in his arms.</p>\n<p>“Stunning,” Katsuki says. “Turn around.”</p>\n<p>Izuku looks like a <em> treat. </em>His strong, thick pectorals are squished like tits, and his arms are pulled fully behind his back. He’s off balance, which is exactly what Katsuki wanted. Izuku blinks at him, captivated by Katsuki’s unwavering confidence. </p>\n<p>“Sit on your knees and spread them. Mm, yes – fuck, you were made for this, baby.”</p>\n<p>Izuku’s eyelashes flutter, but he keeps his chin held up. Katsuki places a finger under his jaw to lift his head higher, then runs it down to his collarbones, watching his skin prick with goosebumps.</p>\n<p>“Master,” Izuku speaks.</p>\n<p>“Yes, pet<em>?” </em></p>\n<p>Izuku gasps, and chews on his inner cheek. He forces his face neutral again, like he’s trying to look cool for their first time.</p>\n<p>“It doesn’t hurt, Master.”</p>\n<p>“Mmm, it shouldn’t.” Katsuki grabs a nipple and twists, and Izuku doesn’t react, but his eyes light up. “Only an idiot would tie someone so tight it hurts. The rope isn’t for pain, it’s to put you exactly where I want you.” Katsuki twists harder, aware of Izuku’s pain tolerance, and Izuku grunts a noise. “Remember, <em> I </em>decide if you get rewarded.”</p>\n<p>“Yes sir.”</p>\n<p>Izuku’s list was marked very, very high on the pain meter. Katsuki has a few theories, but he thinks he can manipulate the situation for Izuku to feel more pleasure from less pain. It’s a work in progress, obviously.</p>\n<p>Katsuki studies him further. Izuku is faring well – they haven’t done much, but he <em> is </em>hard, and that’s something Katsuki is curious about.</p>\n<p>It’s a line in the sand, but someone’s gotta’ cross it.</p>\n<p>Even if it’s late in the game, Katsuki will still say it. Izuku has sex appeal, especially now in adulthood. In the back of his mind, he always figured they’d hook up drunk one night and then never talk about it. This is infinitely better. </p>\n<p>Katsuki drags his fingers over the scars on Izuku’s chest. Some are nastier than others - grafted skin, thin lines, some near-invisible and others a raw pink. Skin on skin would be nice, but the gloves are fine. They’re still friends, and there needs to be some boundaries. </p>\n<p>“Tell me how you’re feeling.”</p>\n<p>“Good,” Izuku says. A moment later. “Safe.”</p>\n<p>Izuku might as well have reached straight into Katsuki’s insides and <em> squeezed. </em>His heart throbs, and he has to chew through the power rush.</p>\n<p>“Very good.”</p>\n<p>Katsuki turns on his magic wand, and Izuku startles upright.</p>\n<p>“Oh!” He gasps, eyes snapping to the vibrator. “Th-that’s –”</p>\n<p>“Not your concern, huh baby?” Katsuki presses it right to the bulge in his jeans, and Izuku jolts on his knees. “You’re just my little toy right now. Pretty, silent, and <em> still.</em>”</p>\n<p>Izuku gets the hint. He bites on his lower lip and screws his eyes shut, but doesn’t make a peep as Katsuki digs the wand against his cock. Katsuki can see him get harder, and he rolls it down to his balls, watching Izuku’s face curiously. He’s straining against the rope in an attempt to stay still, and his lips get redder as he continues to chew on them.</p>\n<p>Katsuki purrs happily, and shoves Izuku back by the chest. Izuku inhales as he lands on his arms, but Katsuki keeps his knees under him. He knows it’s a stretch but he’s also aware that Izuku can do worse, because he’s always been a bendy little fuck. He spreads his knees wider, and the position would be lewd, if it wasn’t for Izuku’s jeans. Still – Katsuki can see his erection plain as day. So responsive. </p>\n<p>“Cute and small,” Katsuki notes, massaging the head lazily with his vibrator. “Just like you.”</p>\n<p>Izuku scoffs – and he’s really not that small, but Katsuki teases him further to see if he’ll react. On and off, hard and gentle, he runs the wand up and down his inseam, along his inner thighs, up his bellybutton and against his cock again. He knows it’s torture; he can see it in Izuku’s face. </p>\n<p>“Do you like that? I’m not even touching you – you gonna’ cum in your pants, sweetheart?”</p>\n<p>“Yes,” Izuku gasps. “Aah, ye-es!” </p>\n<p>“Too bad,” Katsuki says, and turns the wand off. Izuku sags back onto the bed with a groan, and Katsuki presses his gloved hand over his erection and squeezes <em> hard. </em>“I decide these things, not you.” Izuku flinches in pain and squirms uncomfortably, and Katsuki digs his palm in harder, so it hurts. “You’ve been good, so I’m rewarding you. Say thank you.”</p>\n<p>Izuku gasps and gasps again, off balance with his shoulders drawn back so tight, and he throws his head back on the pillows so <em> nicely. </em></p>\n<p>“Thank you! <em> Ah! </em> Thank you!\" </p>\n<p>Katsuki lets go. “Does it hurt?”</p>\n<p>“Yes, I love it sir.” </p>\n<p>This is going alarmingly well. Almost <em> too </em>well. It doesn’t feel like a first session at all. Izuku has fallen into his role easily, and Katsuki feels optimistic about it.</p>\n<p>Katsuki runs his gloved hands up Izuku’s bare chest, now kneeling between his thighs. Izuku twists and squirms from the uncomfortable over-stimulation of scratchy, damp leather. They’ve worked up this far, and Izuku is reacting well. Heavy breathing, sweat at his temple, flushed red and entirely focused on Katsuki’s every move. It makes Katsuki feel fucking powerful.</p>\n<p>“Good. I want to give you ten strikes. Will you take them for me?”</p>\n<p>Immediate.</p>\n<p>“Yes sir.”</p>\n<p>Katsuki helps roll Izuku to his stomach, face down ass up. The position will be hard on Izuku’s neck, so Katsuki has to work fast.</p>\n<p>“Will you tell me why, darling?”</p>\n<p>“Because it pleases you.”</p>\n<p>“And?”</p>\n<p>“I want to feel your hands on me,” Izuku chokes. Katsuki purrs, running smooth circles over Izuku’s ass. The denim stretches tight. It won’t hurt as badly through his jeans, but Katsuki made a promise, and he doesn’t want to take this too far anyways.</p>\n<p>“Count them.”</p>\n<p>Izuku does, one by one. Katsuki slaps that thick, pert little ass, and watching Izuku shiver and gasp makes him hard as fuck. Katsuki puts his full strength into it, and Izuku takes it, short of breath and rolling with each spank. He tries to rut against the bed – but Katsuki catches him in the act, and pulls him up on his knees, forcing his cheek to take the full of his weight. Katsuki slaps him hard on his upper thighs as a warning.</p>\n<p>“I didn't permit that.\" </p>\n<p>“Sorry,” Izuku squeaks. “Ahhhn, nine! Sorry, Master!”</p>\n<p>So eager to please. He’s getting a little louder. It’s sweet, and very tasty.</p>\n<p>Katsuki swats his ass one more time, and the way it <em> jiggles, </em>ugh, what Katsuki wouldn’t give to see it bare right now. But Katsuki completed his anger management; he can be patient.</p>\n<p>“You’ve made me proud,” Katsuki says. He kinda’ wants to jack off into the drain right now, but it’s much worse for Izuku, poor thing throbbing against his zipper. He feels over Izuku’s bound hands with his own, and Izuku squeezes his fingers like a lifeline. “How do you feel?”</p>\n<p>“Awesome,” Izuku exhales. “Floaty. Numb.”</p>\n<p>Sweet. Katsuki checks his watch, and sees that they’ve hit the hour mark. That’s enough for today.</p>\n<p>“I’m glad, baby. I’m going to undo your arms, and then I’m going to roll you to your back, and I want you to soak in that feeling.”</p>\n<p>Izuku makes a sharp whine in his throat, and it pulls at Katsuki’s heart.</p>\n<p>“But! I…” He wiggles his hips, obviously still hard and aching. “Master…please.”</p>\n<p> Katsuki pulls the ropes loose and rubs at his muscles to get the blood flow back.</p>\n<p>“This isn’t a means to an end, this is about how you’re feeling right now. You still feel good, yeah?”</p>\n<p>“Ugh...yes sir.”</p>\n<p>“Focus on <em> that.</em>” Katsuki squeezes his shoulders, and throws the rope off the edge of the bed. He rolls Izuku over and massages his limp wrists, and Izuku looks up at him with bleary eyes. “You’ll finish when I tell you to. You don’t need to worry about anything else while I’m here.”</p>\n<p>Izuku stares a moment longer, before he nods and closes his eyes. Katsuki winds him down slowly, and they stay like this for a while.</p>\n<p> </p>\n<p align=\"center\">~</p>\n<p> </p>\n<p>It’s finally quiet enough to hear the white noise of the ceiling fan.</p>\n<p>He takes off his gloves so Izuku can feel his hands, and Izuku makes a happy noise when Katsuki holds his wrist, and then kisses into his palm. He’s curious of where the line is – what’s too intimate, or too familiar. </p>\n<p>“Mmm…feels nice.”</p>\n<p>“You did good,” Katsuki tells. “You're a natural. Fuck, who knew.” He pushes his fingers into Izuku’s biceps, drawing out the stress in sweeping motions. Izuku is like putty in his hands, entirely limp and shivering as Katsuki sits up by the headboard and pets into his sweaty hair. Katsuki feels possessiveness in his damn <em> toes, </em>but he keeps a reign on it, for now.</p>\n<p>“You’re…amazing at this…” Izuku mumbles.</p>\n<p>“Yup. ‘Cause I’m the best at everything.”</p>\n<p>Izuku opens an eye. Katsuki can tell that he wants to say something, but isn’t sure if he can, so Katsuki nods, “Scene’s over, you’re good.”</p>\n<p>“How did you do that?” Izuku breathes. He lets Katsuki continue to pet into his hair. It’s probably a touch too intimate for what’s supposed to be <em> casual ‘sex’, </em>but Katsuki is thorough with all his subs, so he’s definitely going to follow through with his hero partner.</p>\n<p>“Do what?”</p>\n<p>“You didn’t go that hard and, I – I didn’t even finish,” Izuku flushes. “Normally, I just ask a dom to hit me as hard as they can, and I’ll get off on it. This was…different. It felt so natural.”</p>\n<p>Tch, barbarians. Anger boils in his chest. </p>\n<p>“That’s because they ain’t service doms, they’re fuckin’ posers,” Katsuki curses. He kneads his dull fingernails into Izuku’s scalp, and Izuku purrs like a cat. “You have to keep a balance. Sweet for all the sour – if you don’t follow through with some downtime, you’re not getting the full experience.”</p>\n<p>“I always knew you’d be good at being rough,” Izuku mumbles. “But I didn’t know you could be so...nice.” His fingers seek out Katsuki’s sweatpants, and twist in the fabric. It’s an innocent reach for comfort; a good sign, and Katsuki allows it. He keeps his tone light. </p>\n<p>“Hey, what the hell is that supposed to mean?”</p>\n<p>Izuku laughs, and it sounds <em> weightless, </em>utterly free, and Katsuki is immediately satisfied knowing he did his job right. Damn right he did.</p>\n<p>“Nothing. Did you get some good data?”</p>\n<p>“Yup,” Katsuki nods, and pinches his nose lightly. “Interesting stuff. I won’t go so easy next time, you damn Deku.”</p>\n<p>\n<em> Next time. </em>\n</p>\n<p>Izuku perks up and smiles at him.</p>\n<p>“I’m looking forward to it.”</p>\n<p> </p>\n<p align=\"center\">~</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Okay, so, that went well. </p>\n<p> </p>\n<p>Uh, so well, that Katsuki spent the night jerking off in the shower. He didn’t realize how turned on he was until Izuku was waddling out the door, flowery soft and satisfied and a little needy. </p>\n<p>Heh. Good. Katsuki is going to <em> ruin </em> Izuku for anyone else. </p>\n<p>\n<br>\n<br>\n</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Izuku is back to his annoying, bubbly self come Monday. Katsuki always shrugged it off as Deku being Deku, but now Katsuki can see that maybe there was a pattern in there.</p>\n<p>It kinda’ pisses him off.</p>\n<p>Thankfully, some villain asshole decides to go rampaging down the street, so Katsuki gets to take out some aggression by Howtizer-ing his ass into the pavement. Izuku is always at his back, ping-ponging off the buildings, jumping like a rabbit and kicking the other villain square in the face, and when the crowd of civilians come out to cheer, Katsuki feels smug knowing that their beloved <em>Symbol of Peace </em>checked ‘yes’ on the asphyxiation box.</p>\n<p> </p>\n<p align=\"center\">~</p>\n<p align=\"center\"> </p>\n<p> </p>\n<p>\n<em>“—and that’s it for the weather! Stay tuned for our exclusive Primetime interview with Wonder Duo Deku and Ground Zero –”</em>\n</p>\n<p>“Turn that shit off, Suds,” Katsuki grunts, stirring the ice in his drink.</p>\n<p>The bartender, a tall dude with bubbles for hair, rolls his eyes and turns down the volume.</p>\n<p>“Hey man, I was watching that,” Eijirou teases, and elbows Katsuki lightly. “What crawled in your cereal this morning?”</p>\n<p>“Nothin’, I got the shit kicked out of my shoulder today and I’m fucking sore, so <em>please forgive </em>my lack of patience.”</p>\n<p>Eijirou shudders, “Ugh, don’t say the word <em>please</em>, it sounds weird coming from you.” He chews on the straw of whatever fruity crap he’s drinking, and looks up at the TV as it replays footage from the earlier fight. The news shows one of their combo moves in slow motion, and Eijirou whistles. “Damn, dude. The way you caught Midoriya in mid air like that…you two are on a different level, lately.”</p>\n<p>Katsuki sneers, “Haah? Just lately?”</p>\n<p>“No! You guys make a sick team! I just mean – you gotta’ admit, that fight was super smooth.”</p>\n<p>Hm. Katsuki knocks back the rest of his drink, and slides the empty glass towards Suds.</p>\n<p>“Deku and I are in a weird place right now.”</p>\n<p>Eijirou looks at him. While he <em>does </em>know what kind of shit Katsuki likes to get into, it still ain’t right to tell him about this new thing with Izuku just yet.</p>\n<p>“Is that right? You guys okay?”</p>\n<p>“We’ll find out,” Katsuki says, and catches the glass when Suds slides him a second round.</p>\n<p> </p>\n<p align=\"center\">~</p>\n<p> </p>\n<p>It’s a week of heavy hitters. Fight after fight, it feels like every villain and their fuckin’ uncle decided to come crawling out of the sewers.</p>\n<p>More fights equal more paperwork, and Katsuki already knows it's going to be a long night when Thursday rolls around.</p>\n<p>They’re pros still working under Endeavor’s name, so they have a nice office up on the higher floor of the agency. They share a room; a spacey one, thank fuck, with ceiling to floor windows, and corkboard walls tacked with red string and photographs.</p>\n<p>Izuku is looking a little haggard today, but fuck if Katsuki isn’t the same. Izuku has a bruise on his cheek that is still healing, and he’s wearing a wrist support for the arm he pushed a little too hard yesterday.</p>\n<p>Izuku sighs suddenly, and bonks his forehead with his stack of papers.</p>\n<p>“Goodness, I cannot get my head together today.” </p>\n<p>Katsuki slides his gaze across the room.</p>\n<p>“Did you have coffee?”</p>\n<p>“Uh…maybe.”</p>\n<p>“Fucking dumbass, you know caffeine fucks with your anxiety.”</p>\n<p>“I know!” Izuku whines, and slides back in his chair. “I was just tired from the late shift and I thought it would help…”</p>\n<p>“Drink water, moron,” Katsuki says. He flips his pen around in his fingers, and then stops when Izuku laughs lightly.</p>\n<p>“You’re right, sorry.”</p>\n<p>Katsuki pauses. He thinks a lot about Izuku’s list, these days. Vulnerability is written in that paper– but his brain fixates on a specific section. The part that checked <em>yes </em>for praise, and <em>no </em>for degradation.</p>\n<p>Is that…his fault?</p>\n<p>Suddenly, his throat is too tight. Izuku yawns, stretches his arms out like a cat and sticks his nose back in his paperwork, but Katsuki’s stomach starts to eat itself over and over.</p>\n<p>“Deku.”</p>\n<p>Izuku looks up immediately, tired but with his full attention.</p>\n<p>“Yes?”</p>\n<p>How does he even say it? Katsuki squeezes the pen in his hand, and fiddles with the clip.</p>\n<p>“You know I… I’m usually just fuckin’ around when I…” Katsuki scowls, and then sits upright. “If you’ve got a problem with the shit I call you, then you can just man the fuck up and say it to my face.”</p>\n<p>Izuku looks totally lost. Thankfully, he has years of experience dealing with Katsuki, and after a short face journey, he blinks, and then smiles.</p>\n<p>“Oh, Kacchan. You’re thinking about my list, aren’t you?”</p>\n<p>“If it upsets you that much…”</p>\n<p>“It doesn’t,” Izuku says, and the knot in Katsuki’s chest loosens. It must show on his face, because the damn nerd laughs at him. “Kacchan, really. I’ve known you for so long – if I didn’t have thick skin by now, then I wouldn’t be fit to be a hero.” Izuku plays with the velcro on his wrist, and doesn’t meet Katsuki’s eye. “I guess I just…don’t like being talked to that way in bed. It messes with my head.”</p>\n<p>Ah.</p>\n<p>Katsuki kicks his feet up on his desk and pulls his laptop into his lap.</p>\n<p>“Good. Dunno’ if I could give up calling you <em>nerd.</em>”</p>\n<p>Izuku giggles, and spins his chair in a circle.</p>\n<p>“Are we going to um – do another session this weekend?”</p>\n<p>Katsuki grins.</p>\n<p>“Why? Eager already?”</p>\n<p>“Maybe.”</p>\n<p>“You haven’t got off yet, right?”</p>\n<p>“Kacchan!” Izuku whisper-yells. “The walls are thin!”</p>\n<p>“So? Answer the question.”</p>\n<p>“Well. <em>No.</em>”</p>\n<p>“Good,” Katsuki says smugly. “Come over Saturday.”</p>\n<p>He looks out of the corner of his eye, and watches Izuku straighten up by the shoulders, and jerk his gaze back down to his desk. He mutters continuously for the rest of the evening, and Katsuki chews back the victorious feeling in his mouth.</p>\n<p>Soon.  </p>\n<p>\n<br>\n<br>\n</p>\n<p align=\"center\">~</p>\n<p> </p>\n<p>Katsuki spends a lot of his time with Izuku. Most hero work, lunch breaks, the occasional movie night (when something particularly interesting has hit the theaters), and now part of the weekend. </p>\n<p>Fansites are always arguing over Katsuki and Izuku’s partnership. Fans are batshit crazy — and they act like they know everything about a hero, just from what they see on TV. </p>\n<p>\n<em>‘Ground Zero should just get a new partner if he hates Deku so much!’ </em>\n</p>\n<p>They’re fuckin’ stupid, because there is absolutely no way on God’s green earth that Katsuki could spend six days a week in the constant presence of someone he couldn’t stand. Get your eyes checked. </p>\n<p> </p>\n<p>On Saturday, he tells Izuku to come showered. He shows up with frizzy damp hair, pink cheeks and an eager look on his face, and Katsuki thinks <em>oh, this’ll be fuckin’ fun.</em></p>\n<p>“I saw your new magazine,” Izuku bounces, flopping back on his bed. “Mister <em>I’ll Never Be a Model, </em>I liked the makeup.” He already looks way more at ease than last time.</p>\n<p>Katsuki scoffs, “Shut the hell up, only an idiot would’ve passed up that much cash.”</p>\n<p>“What was it again?” Izuku poses back on the bed. “Oh yeah! <em>Caramel Old Spice.\" </em></p>\n<p>“You’re not making me want to be very nice to you,” Katsuki says, and Izuku straightens up as soon as he slides on a glove. Izuku laughs, and then bows his head.</p>\n<p>“Sorry, sorry.”</p>\n<p>“Hm.”</p>\n<p>Everything changes when he flicks on the neons, and suddenly Izuku is glowing purple and blue. Reverence falls on the room, anticipation and unease. The tension is therapeutic.  </p>\n<p>It’s been a long week for both of them. Neither says it, but they’re both excited for this.  </p>\n<p>“I’m going to lay everything out for you again,” Katsuki says.</p>\n<p>He sets out his supplies on a black towel; leather cuffs, a riding crop, a few straps, cock rings and a silver plug. “If you’ve got any objections, speak up now.”</p>\n<p>Izuku wets his upper lip, and the sudden look of <em>hunger </em>is attractive.</p>\n<p>“Wow. Yeah, this is fine.”</p>\n<p>“We’re going to get into the real sex, now. You’re still down for this?”</p>\n<p>Izuku stares up at him through those effing longass lashes, and the way he looks Katsuki up and down – for a second, it feels like he’s the meal instead.</p>\n<p>“Yeah. I mean – yes sir.”</p>\n<p>Damn. Well, at least Katsuki doesn’t have to worry about a lack of attraction (not that he was worried, he fucking wasn’t).</p>\n<p>“Hm. I want you naked this time. Fold your clothes and sit on your knees.”</p>\n<p>Izuku swallows, and follows his instructions. Katsuki doesn’t touch – just watches as Izuku unbuttons his shirt, then his trousers, and folds them one at a time. He pulls off his socks, and after a moment of hesitation, his briefs. Katsuki doesn’t hide the fact that he’s watching.</p>\n<p>Izuku’s body is toned and strong and striped with scars. Katsuki has seen him naked a million and one times, but this time he doesn’t have to look away. Izuku’s cock is soft, but Katsuki thinks its cute. Cut and thick and short, just like the rest of him. He’s shaved, and Katsuki wants to rub his face against his navel, but that’s for another time.</p>\n<p>Katsuki holds out his hand.</p>\n<p>“Come here, baby. Greet me.”</p>\n<p>With just one petname, it starts.</p>\n<p>Izuku sits up on his knees and kisses at his glove immediately. He’s less hesitant this time. His face is still red – but he’s willing to meet Katsuki’s eyes, waiting for the next order. When Izuku has licked between each finger, Katsuki wipes his hand off on his cheek, and grips him hard by the chin.</p>\n<p>“That was a nice hello. Let me return the favor. Open wide for me, please.” </p>\n<p>Izuku does, and Katsuki leans over him, hovering like they’re about to kiss (never ever, impossible), and when Izuku looks like he’s about to panic, Katsuki rolls his tongue around his own teeth, and then spits right in Izuku’s mouth. Izuku <em>shudders, </em>closing his lips and swallowing, and Katsuki considers him good and under.  </p>\n<p>“There you are, taste good baby? We’re going to need that mouth today. I want you to prove yourself to me.”</p>\n<p>“How?” Izuku whispers eagerly. </p>\n<p>“Stay still,” Katsuki says, and reaches right between his legs. He grabs his soft cock – but it hardens almost immediately, and Izuku squeaks a noise behind his clenched teeth. Katsuki pumps him hard, the wet leather torturous and rough. Katsuki reaches for one of the rings, and slides it on to the base. Izuku jerks from the cold metal, and Katsuki clicks a second one around his balls. “Perfect,” Katsuki says, and pulls his hand away. “This will keep you from finishing.”</p>\n<p>“But – Master,” Izuku objects, and his eyelashes are wet already. “I want to cum.”</p>\n<p>“What have I told you? Tell me you haven’t forgotten.”</p>\n<p>“It’s not my concern,” Izuku repeats, breathless.</p>\n<p>“Exactly. Now touch yourself.”</p>\n<p>Izuku looks confused, but reaches for his cock. Katsuki slaps his hand away, and Izuku startles.</p>\n<p>“Not there.”</p>\n<p>Izuku’s eyes widen, and he extends his palm out when Katsuki asks. He pours lube on Izuku’s fingers, and says, “Make this enough.”</p>\n<p>“But Master,” Izuku lowers his head, ears pink. “I want to please you.”</p>\n<p>“This will please me. Tell me when you can take four fingers.”</p>\n<p>Izuku gapes, “Four?!”</p>\n<p>“Are you doubting me?”</p>\n<p>“No! No, sir.”</p>\n<p>“Good. Roll to your stomach.”</p>\n<p>Izuku turns to his hands and knees. Katsuki forces his shoulders down, and Izuku reaches back and thumbs over his hole. Katsuki spreads his knees wider so he’ll feel the stretch, and forces Izuku to put on a show. </p>\n<p>His fingers are wide and thick, and the way Izuku moves looks practiced. It makes him hard, and Katsuki feels himself twitch. </p>\n<p>“How do you feel?”</p>\n<p>“Exposed,” Izuku whines, now up to two fingers.</p>\n<p>“Good. You exist for my viewing pleasure alone. Do you understand?”</p>\n<p>“Yes sir.”</p>\n<p>Katsuki works at prepping a few straps while Izuku fingers himself open. Katsuki could sit and watch all damn day, but he has to keep a cool head. Izuku looks overwhelmed already, his neck red and his arm straining at the angle, but this is nothing yet.</p>\n<p>“Beautiful,” Katsuki says, clicking a strap to the carabiner in his bedpost. “You look like art.”</p>\n<p>Izuku presses his face to the pillows, but spreads his fingers wide, eager to please. His hole is puffy and pink and wet and a fucking temptation. </p>\n<p>“Will you fuck me, sir?”</p>\n<p>\n<em>Fuuuckkk –</em>\n</p>\n<p>Katsuki nearly breaks character, for a second. He grinds his teeth, and squeezes his hand tight into Izuku’s bare thigh. There’s so much <em>muscle </em>here – especially in this freckled, perky ass. The back of his mind is still reeling over the fact that he gets to touch Japan’s beloved <em>Deku</em> like this — but there’s no time for hesitation right now.</p>\n<p>“How dare you make demands, <em>pet</em><em>.</em>”</p>\n<p>Izuku gasps, and his fingers pull back to the second knuckle.</p>\n<p>“I wasn’t --! Please forgive me. I was only curious.”</p>\n<p>“No more questions.” Katsuki squeezes his ass, prying his cheeks open with his full grip strength so it stings. “Do as I say, and you <em>might </em>be rewarded.”</p>\n<p>“Yes sir.”</p>\n<p>When Izuku has four fingers in, Katsuki drags the plug up Izuku’s inner thighs, letting him adjust to the feeling of cold silicone. He presses his gloved thumb alongside Izuku’s fingers, and revels in the way he clenches around him.</p>\n<p>“Hm, wet and needy, just like I asked. You might be on the road to impressing me.”</p>\n<p>Izuku’s fingers fall back to the bed, and then grip tightly when Katsuki pushes the full plug in.</p>\n<p>“Nghh!” Izuku grits, hips shoving backwards – and Katsuki forces him back with his arm. Katsuki surprises him by flicking the <em>on </em>switch on the vibrator, and Izuku suddenly thrashes, his spine arching gorgeously. Katsuki slams him back down against the sheets, and leans close enough to whisper in his ear.</p>\n<p>“Now, we can begin.”</p>\n<p>Izuku looks back at him, eyes wide and excited, and it makes Katsuki yearn for all the lost years they could've been here. </p>\n<p> </p>\n<p align=\"center\">~</p>\n<p> </p>\n<p>“This will be a fun little game,” Katsuki says, petting over Izuku’s lips. “Please your Master before your brain loses oxygen.”</p>\n<p>Izuku gasps, as his face is already turning red. His head is forced upside down off the side of the bed, arms cuffed to the straps on each post. Izuku’s legs are left free in order to safeword. Katsuki is aware that Izuku could snap the cuffs if he wanted to – but he’ll be fucking pissed if he does, because these were expensive.</p>\n<p>For a second, a voice in Katsuki’s brain asks <em>are we really about to do this?</em></p>\n<p>He takes one look at Izuku, tied and naked on his bed, and goes <em>fuck yeah, I am.</em></p>\n<p>Katsuki unzips his jeans; it sounds especially obscene, and Izuku groans, his arms pulling at the restraints. Katsuki has long been hard, and he drags his cock along Izuku’s cheeks, the left then the right, not quite meeting his lips yet, grinding against him like an object, not a man.</p>\n<p>“Wider. Yes – aren’t you a sweet little toy. That surprised look on your face is very cute.” Katsuki pushes against his lips, and Izuku doesn’t fight him, licking eagerly from this strange angle. “<em>Fuck yes, </em>just like that. Focus on breathing, don’t choke just yet.”</p>\n<p>The command is difficult because upside-down like this, Izuku doesn’t have much of a choice but <em>to </em>choke. Katsuki slams his hips forward, and Izuku gurgles, feet pushing up the sheets in the bed as he bucks – and Katsuki grins.</p>\n<p>“Keep squirming. That vibe is hitting your spot, isn’t it? You won’t be able to cum with those rings on, silly boy.”</p>\n<p>Izuku whines in complaint, and Katsuki starts to fuck his mouth in earnest. Izuku’s face is glowing red from the bloodrush, but Katsuki is keeping track of the time. He knows how long he can push before it’s too dangerous. Izuku doesn’t know that – so the longer Katsuki fucks his mouth, the more desperate Izuku gets. He gags when Katsuki hits his throat, and Katsuki laughs at him, pulling out.</p>\n<p>“Aww, poor thing. I really thought you could do better.”</p>\n<p>“No,” Izuku rasps, broken and gritty. His tone is desperate. “Sir, <em>please, </em>I can take it.”</p>\n<p>Katsuki reaches down and holds him by the throat. Izuku inhales raspy, but Katsuki doesn’t squeeze; just holds, like a comfort as he fucks his mouth again, this time in steady, predictable thrusts. Izuku’s lips are wet and sticky and his mouth is <em>hot, </em>and Katsuki feels himself throb at the broken, needy sounds Izuku is making. He drags his wet cock back across his cheeks, and forces Izuku to suffer more headrush. This is about Izuku placing his trust in him, Katsuki can’t forget that.</p>\n<p>“Is that it? I thought you wanted to impress me.”</p>\n<p>Izuku begs in broken gasps, and Katsuki wipes away his tears.</p>\n<p>\n<em>“Ah! Ngh! Puh-please!”</em>\n</p>\n<p>“What is it you want?”</p>\n<p>“To please Master!” Izuku cries. His arms flex in the cuffs, and for a moment, Katsuki fears for the integrity of his bedpost, but Izuku reigns in control and bucks his hips, cock leaking all over his stomach. Buzzing fills the air with white noise. </p>\n<p>“Beg for it,” Katsuki demands.</p>\n<p>“I can do it, please – let me suck your cock.”</p>\n<p>Katsuki is pretty helpless against that one. He pries Izuku’s lips back open and starts thrusting into his mouth again, and Izuku <em>moans, </em>like he’s the one getting his dick sucked, and that’s exactly what Katsuki wanted to hear. His tongue rubs the topside of his cock and Katsuki hits it so deep his balls slap his nose.</p>\n<p>“That’s it, <em>fuck, </em>you feel so good,” Katsuki grits. “You’ve made me so happy, sweetheart. I’m going to squeeze your throat in five second increments. Don’t stop sucking me.”</p>\n<p>Water rolls down Izuku’s cheeks, but he nods eagerly. Katsuki holds down his throat and applies pressure very carefully, and Izuku’s face gets redder, if possible. He’s on a time restraint here – but Izuku is clever with that tongue of his – and watching Izuku’s eyes roll back in pleasure is enough to get Katsuki off, alone. It tingles in his spine, his stomach, his toes; <em>I made you like this. Me, and no one else. </em></p>\n<p>Each second feels like an hour. One. Two. Three. Four. Five.</p>\n<p>Katsuki lets go. Izuku inhales loudly through his nose, and his cock drools all over his bellybutton. Katsuki feels the rush of adrenaline; powerful and better than any high. Izuku looks wrecked already, and it’s <em>art, </em>it’s fucking art.</p>\n<p>“Shit. Very good,” Katsuki pets his face with his free hand, thrusting shallowly against his tongue. “I’m close. Can you take one more squeeze?”</p>\n<p>Izuku kicks the headboard once. That’s a yes.</p>\n<p>Katsuki plugs his mouth and squeezes his throat, counting aloud. Izuku chokes around his cock, gargles spit down the side of his lips, flexes at the cuffs and lets go, thrusts his hips and squirms, and when Katsuki releases he’s over the edge already, just from watching Izuku cry big, heavy sobs. He pulls out to paint white stripes across his wet cheeks, and Izuku moans from it, moans like he’s the one getting off, his little toes twisting and curling in the sheets.</p>\n<p>\"Fuck,” Katsuki exhales, tingling up his spine. It hits him so hard it damn well hurts, and Izuku’s face is almost purple, but he looks absolutely enamored, eyes wide and not leaving Katsuki’s face. Katsuki feels completely winded. “Good job baby, good fucking job, that <em>mouth </em>of yours, my god. You won darling, I’m so fucking proud.”</p>\n<p>Izuku throbs harder, and Katsuki helps him sit upright, undoing the clips on the cuffs and pushing him up to his knees. Izuku nearly falls face forward, and Katsuki catches him with an arm around his waist, sitting up behind him.</p>\n<p>“No, no. We need to sit upright, need to get all that blood back into your heart.”</p>\n<p>Izuku hiccups, “Sir, please. My ass – I can’t – it won’t <em>stop.</em>”</p>\n<p>“I know,” Katsuki sooths, rubbing his hands up and down Izuku’s sweaty chest. “You can take it, I believe in you.”</p>\n<p>Izuku knocks his head back against his shoulder and cries. His cock twitches and throbs but gets nowhere, and Katsuki keeps petting him, until his face is a healthy shade of pink. He pushes Izuku up enough to click off the vibrator, and Izuku sags in his arms.</p>\n<p>“You’ve pleased me, slave. Do you want your reward?”</p>\n<p>Izuku hesitates. Katsuki keeps petting him, and waits. He knows that he’s overwhelmed right now, so he won’t be upset if Izuku is unwilling to continue. Katsuki is in control, but Izuku is the one calling the shots. It’s important that Izuku remembers that.</p>\n<p>A moment passes. Izuku swallows, clears his throat, wipes his eyes on his shoulder and nods.</p>\n<p>“Yes sir.”</p>\n<p>“That’s a good boy. Stand up off the bed, hands on the mattress please.”</p>\n<p>Izuku is wobbly, but manages to do as he’s told. Katsuki wouldn’t push another sub to move so soon, but this case is different, because Katsuki <em>knows </em>Izuku’s limits. He knows how far this body can go, how much it can take, and sure enough, Izuku is steady as a rock as he bends over and plants his hands on the bed.</p>\n<p>The plug is still sitting pretty between his cheeks, and Katsuki gently pulls it out. Izuku groans, but Katsuki ignores him as he sets it aside on the bed and grabs his riding crop. He wants to feel skin on skin - to taste sweat and lick down his spine - but he can't. Not now.</p>\n<p>“You’ll enjoy this prize,” Katsuki says, dragging the end up Izuku’s sculptured back. He lightly taps Izuku’s left cheek, then his right. “I will give you three lashes, and then a thirty second break, and then three again. Do you want them?”</p>\n<p>“Yes,” Izuku croaks.</p>\n<p>“Why?”</p>\n<p>“Because it pleases you.”</p>\n<p>“It does,” Katsuki plans out his strokes lightly, deciding exactly where he wants the lines to be. Izuku’s ass is like a sculpture – and Katsuki wants this to be exactly right. “I care about your happiness. Will this make you happy?”</p>\n<p>“Yes yes yes, sir.” </p>\n<p>“This’ll hurt. Clench your teeth, and don’t bite your tongue.”</p>\n<p>Katsuki cracks the first one along his left cheek. Izuku jerks, crying out and then moaning from the heat. Katsuki is a big guy, and he’s mostly upper-body strength these days, so he knows the full force of his hits can be excruciating, if Katsuki doesn't prepared the receiver right. </p>\n<p>Katsuki gives a second strike with the crop, alternating to the other side, and then one last one right at the top of his thighs, where he’ll feel it for a few days. He's building him up further - pushing his limits <em>just </em>to skim the edge of what feels impossible. Izuku bites into his hands and screams, and Katsuki pets over the welts with his glove, soothing the pain.</p>\n<p>“Shhh, you're okay. You’ll look so beautiful when I’m finished.”</p>\n<p>Izuku wipes his eyes and sniffs, “I will?”</p>\n<p>“Of course you will,” Katsuki continues to keep time in his head, rubbing the burn away. “I’m so proud of you, will you let me count three more?”</p>\n<p>Izuku is a mess. Dark hair stuck to his forehead, his muscles straining to <em>obey. </em>But he gives it up easily. He gives it all to Katsuki - his beloved <em>Kacchan. </em></p>\n<p>It's a power rush. It's a hard drug, and it hits hard when Izuku says,</p>\n<p>“Yes.”</p>\n<p>Katsuki doesn’t hesitate, because that would make it worse. Izuku is at a pinnacle right now – and Katsuki needs to see him through it.</p>\n<p>Instead he deals out the last three lashes quickly, one after the other, right where he initially planned. He purposefully breaks the skin on the last one, but it isn’t deep, just puffy and aggravated, and he looks fucking <em>amazing – </em>enough for Katsuki to get hard again.</p>\n<p>Izuku is babbling into his fingers, hiccupping and crying, having long forgotten about his weeping cock, and Katsuki drops down to kiss the puffy red skin on his ass cheek. It’s so hot against his mouth. Incredible.</p>\n<p>“You’re finished. Well done, baby.”</p>\n<p>Izuku sighs happily. Katsuki helps him roll to his side, and Izuku pants as he tries to catch his breath. He’s sticky all over, sweaty and flushed, and Katsuki’s heart suddenly hurts for him.</p>\n<p>He rips off his gloves, and allows Izuku to feel bare skin. Izuku utterly <em>curls </em>into his hand, pulls it to his cheek and sighs.</p>\n<p>“You’re perfect,” Katsuki blurts. He winces, then says, “Uh, how do you feel?”</p>\n<p>“So, so good. I can’t even – there aren’t the right words to say. I’m floating. Thank you, sir.”</p>\n<p>Katsuki puffs up with pride. His Izuku has done so well, exactly as he asked and –</p>\n<p>\n<em>His?</em>\n</p>\n<p>Katsuki swallows thickly. The possessiveness in his chest has him leaning down to nose against Izuku’s cheek, kissing his forehead lightly and breathing in his scent. He smells like electric storms and salty sweat, just like he always has. </p>\n<p>He’d never admit it, but Katsuki needs the cooldown just the same — if not more — than his partner does. It burns him from the inside out, this overwhelming desire to soothe and protect — like he might die if he doesn’t get the chance. It’s a momentary lapse in control, a moment of weakness that he hates more than anything, but is powerless to stop.</p>\n<p>“Look at me?”</p>\n<p>Izuku does. His eyes are clear – so he hasn’t dropped. Good, good. He <em>does </em>look like a well-fed cat, however; spread out and bone tired, and a little flustered from Katsuki’s attention. Katsuki noses again at his other temple, and Izuku tries to curl away.</p>\n<p>“Nuh huh,” Katsuki clicks his tongue. Izuku giggles and rolls to his back, but flinches at the soreness.  Katsuki sits back to look at him. “Hey, careful. Lay on your stomach, I’ll be right back.”</p>\n<p>Izuku’s eyes are puffy, and they grow big and nervous.</p>\n<p>“You’ll come back?”</p>\n<p>Katsuki's voice comes out more hoarse than he'd like. “Yeah. Count it out, twenty seconds.”</p>\n<p>Izuku nods. Katsuki slips out of bed and jogs into the bathroom. He wets a hand towel and digs for his jar of ointment, and Izuku is laying on his stomach when Katsuki comes back. The lines on his ass are more prominent now – but no blood, meaning Katsuki did his job right.</p>\n<p>“I’m going to treat this,” Katsuki says. “That okay?”</p>\n<p>“Yes sir.”</p>\n<p>“You can call me Katsuki,” he says, and then pauses. “Or uh. Fuckin’ Kacchan, or whatever.”</p>\n<p>“Mmm, Kacchan,” Izuku mumbles into the pillow, hugging it in his arms. “I feel good.”</p>\n<p>Katsuki wipes him down, and then gently massages the sore spots with balm. Izuku doesn’t flinch — a testament to how strong this guy is – but he makes a happy humming sound that settles deep in Katsuki’s bones.</p>\n<p>He massages up Izuku’s back, dragging out any tension that might be left. He’s all muscle and healthy fat, built as a killing machine, yet soft and sweet and so fucking gentle. </p>\n<p> </p>\n<p>\n<em>When did you become so cute? </em>\n</p>\n<p> </p>\n<p>He can see Izuku drifting a little, so Katsuki kneads at the back of his skull.</p>\n<p>“Don’t get in your head. Tell me what you’re thinking.”</p>\n<p>“It feels like I finished,” Izuku mumbles. “But I didn’t.”</p>\n<p>“That’s ‘cause I know what the fuck I’m doing,” Katsuki says lightly. He presses his mouth to the knobs at the back of Izuku’s neck, and Izuku breaks out in goosebumps. His shivers, and his voice sounds wobbly. </p>\n<p>“Mmm. Thank you. I needed this.”</p>\n<p>So did he, but Katsuki doesn’t want to admit that.</p>\n<p>“You’re welcome.”</p>\n<p>Izuku turns his head the other way in the pillows, and his ears are pink.</p>\n<p>“I want to touch you so bad. Isn’t that weird?”</p>\n<p>“Not weird,” Katsuki says. “It’s part of the process. You can touch me.”</p>\n<p>Izuku carefully rolls to his back, and extends a hand. His hands are thicker than Katsuki’s, shorter and rougher, and Katsuki takes it. Izuku feels around his wrist, up his bare arm and then tugs. Katsuki humors him, lying down at his side and pulling Izuku close to him. Izuku is still a little stiff and nervous, so Katsuki reminds him, “It’s fine,” and Izuku breaks like a dam.</p>\n<p>He rolls right into his arms, digs his face in Katsuki’s firm chest and holds onto the back of his shirt. His skin is sensitive, so Katsuki is mindful of where they’re touching.</p>\n<p>Izuku breathes in and out, and holding him like this – his damn heart beats too fast. Almost out of control, and for a moment, Katsuki feels like he’s lost his grip on the whole situation.</p>\n<p>“You smell amazing,” Izuku whispers.</p>\n<p>The clinginess is just a side effect, Katsuki reminds himself. He’s got this. It’s fine.</p>\n<p>He pets Izuku’s hair in silence, and lets him ride out the rest of his high. Katsuki takes the rings off when he’s gone soft again, and watching Izuku shiver and cling to him does something terrible to his insides.</p>\n<p> </p>\n<p> </p>\n<p><em>I'm weak</em>.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>“I don’t know what you guys are on,” Denki says, lifting his visor. “But you should keep smoking it.”</p>\n<p>“Fuck off, Dunceface,” Katsuki pops a small explosion to land upright without breaking the concrete. “Anyone left?”</p>\n<p>“Nope!” Mina waves, kneeling on the back of a downed villain. “You two cleaned up pretty good.”</p>\n<p>This part of the street is smoking, but in one piece, more or less. The smell of burnt rubber is still nasty as hell. Katsuki could’ve easily handled the threat on his own, but you know how extras are. </p>\n<p>Izuku lands next, a few bunny hops before the dust settles. He wipes his gloves off on his pants and grins, “Hey, that wasn’t so bad.”</p>\n<p>“Damn, at this rate, you two are gonna’ take the top spot before me,” Denki whines.</p>\n<p>“You’re the one on crack if you think <em> your ass</em> stands a chance at Number One,” Katsuki growls. Denki raises his hands in surrender. Izuku pats Katsuki’s back in consolation. </p>\n<p>“There there. Is your hand okay?”</p>\n<p>“Fuck off, it’s fine.”</p>\n<p>“Let me see.”</p>\n<p>Katsuki sighs, and shows him his palm anyways, where his glove is ripped down the middle. It’s bleeding sluggishly — he won’t even need a healer. Izuku studies the wound and hums.</p>\n<p>“You’ll live.”</p>\n<p>“Effin’ told you.”</p>\n<p>Denki makes a stupid face, like he can’t believe Katsuki just let Izuku live.</p>\n<p>“Kyokaaa, how come you never check my wounds like that?” Denki whines.</p>\n<p>Jirou dusts off her hands and huffs, standing up from the rubble.</p>\n<p>“I just don’t love you that much, sorry.”</p>\n<p>“Hey!”</p>\n<p>Izuku laughs, and steps away from Katsuki with forced casualness, and Katsuki glares holes into the side of Denki’s dumb head.</p>\n<p>Another explosion ricochets down the street, and they’re off again.</p>\n<p> </p>\n<p align=\"center\">~</p>\n<p> </p>\n<p>They have a rough start to the week – and not the good kind. The media decided to drill into them about the collateral on one of their more recent fights, and they’re all feeling the pressure from it, god damn it. Katsuki knows they’re in deep water when their annoying manager gets involved in damage control. </p>\n<p>Izuku always pushes forwards, even when he’s got one foot in the grave. He looks tired, and he definitely hasn’t eaten, because Katsuki watched him skip lunch to go help old ladies or some shit, and Katsuki can tell he’s running on fumes by the time they’re changing out of uniform.</p>\n<p>“Oi,” Katsuki calls, and Izuku blinks up at him. “You’ve still got soap in your hair.”</p>\n<p>“Oh,” Izuku feels over his damp hair, and towels off the rest. He gives that stupid smile – the one that’s posted all over the billboards. “Thanks.”</p>\n<p>That’s not what Katsuki was originally going to say. He sits to tie on his boots, and sighs.</p>\n<p>“Lemme’ buy you dinner.”</p>\n<p>Izuku looks like a confused puppy.</p>\n<p>“Huh?”</p>\n<p>“Whataya’ mean <em> huh??</em>” Katsuki barks. “It’s fuckin’ dinner, I know you damn well don’t have any food at home.”</p>\n<p>Izuku coughs, so a bullseye, obviously.</p>\n<p>“You don’t have to.”</p>\n<p>“Damn right I don’t have to<em>.</em>” Katsuki slaps him hard between the shoulder blades, and Izuku grunts. “I bet Konos is still open.”</p>\n<p>“Konos is always open.”</p>\n<p> </p>\n<p>Katsuki is reminded of their height difference when they walk side by side like this. Yeah yeah, Izuku can kick ass, but at least Katsuki still won in size (ha, loser). </p>\n<p>Izuku has a talent for hiding his strong stature behind big sweatshirts. Katsuki knows he has a bad rep for never wearing a belt, but come on, at least his shirts fit. Izuku looks snuggly, but the cuteness is overshadowed by the damn <em> Icyhot </em>colors split down the middle.</p>\n<p>“Why the hell are you wearing this?” Katsuki yanks on his hood, and Izuku fakes a choking sound.</p>\n<p>“Hey! I like this hoodie!”</p>\n<p>“My series was way cooler,” Katsuki snuffs, and Izuku laughs at him, sticking his hands back in the kangaroo pocket.</p>\n<p>“What, are you jealous?”</p>\n<p>“Pfft, <em> no. </em>I’m just saying you have no taste.”</p>\n<p>Izuku hums, and his little nose is pink from the cold, and he looks up at him through his lashes and it’s like Katsuki is transported into last week, where Izuku was melted and sticky in his hands, and Katsuki has to force himself back into the present.</p>\n<p>He yanks open the door for him; Izuku mumbles <em> thank you, </em>and they take their usual seat in the back by the giant houseplant. It’s usually just third-shifters this late at night, and the waitress already knows their orders.</p>\n<p>“So what’s with this?” Izuku stirs his sweet tea, which is a disgrace, by the way, because Izuku always adds more sugar. “We haven’t been here in a while.”</p>\n<p>Katsuki shrugs; he leans back in the chair and crosses an ankle over his knee. They’re hidden by the bigass plant, so Katsuki isn’t worried about being recognized.</p>\n<p>“We’ve had our asses handed to us this week, so I wanted to check in.”</p>\n<p>Every once in a while, Izuku looks at him like he’s a total stranger. Katsuki thinks that he’s seeing the old him. The one that said things that Katsuki wishes he could take back, chew up and swallow. They’re past that, Izuku doesn’t even <em> care, </em>but sometimes he’s surprised when Katsuki does.</p>\n<p>“I’m…okay,” Izuku settles. “Some stuff has been overwhelming, but it’s nothing I can’t handle.”</p>\n<p>“Work stuff,” Katsuki raises an eyebrow. “Or <em> our </em>stuff?”</p>\n<p>Izuku looks around the restaurant, like he’s checking to see if he’ll be overheard. He pinches his straw, and sips quickly.</p>\n<p>“Both, I guess.” Katsuki waits to see if he’ll continue, and Izuku does. “Our um – <em> sessions. </em>They’ve been good for me. I come out thinking clearer than before. It’s like getting a full body massage.”</p>\n<p>Katsuki’s chest vibrates with satisfaction, but he keeps his face blank.</p>\n<p>“Mm, still sore?”</p>\n<p>“I’m always sore,” Izuku smiles, and Katsuki feels it go right through him. “This is the good kind. They’re just bruises now, god knows I have enough of those.”</p>\n<p>Katsuki nods, and plays with one of the sugar packets on the table, flipping it between his fingers like a pen. He suddenly wants to see them; the yellowish bruises healing on his backside. </p>\n<p>The lighting is blue and red in here; Izuku glows like the neon in his bedroom, and that’s a thought he can’t follow.</p>\n<p>Izuku laughs nervously, and rubs his nose. “I know this is probably weird to say but – you’re like an entirely different person in there. I don’t know how you pull it off.”</p>\n<p>Katsuki shrugs, “Isn’t it the same for you? I don’t have to worry about shit in a scene – I don’t even have to think about bein’ myself. S’ good for me too.”</p>\n<p>Izuku seems to light up.</p>\n<p>“That – that makes me relieved to hear. I’ve kinda’ felt…bad. Like I’m the only one receiving.”</p>\n<p>That’s definitely <em> not </em>what’s been happening, but interesting to know.</p>\n<p>“Obviously not, ‘cause you sucked me dry last week.”</p>\n<p>Izuku gasps, and jumps across the table to flatten a hand to his mouth.</p>\n<p>“Kacchan! Seriously!”</p>\n<p>Katsuki rips his hand off and shoves Izuku back down into his seat.</p>\n<p>“No one can hear, stupid!”</p>\n<p> “They can if you shout like that!” Izuku whisper yells, and sinks down in his chair. He rubs at his red face, but exhales steadily, and steers his voice level. “I guess I was just trying to say that – I enjoyed myself.”</p>\n<p>That makes Katsuki more relieved than he’d like to admit. </p>\n<p>Hey, this friends-with-benefits shit is easy peasy. Why the hell is dunce-head always complaining about it so much?  </p>\n<p>“Then you wanna’ keep going?”</p>\n<p>Izuku stares, and then grins.</p>\n<p>“Yeah. Thanks for being so patient with me. I can’t help but feel spoiled, Kacchan.”</p>\n<p>The look Izuku is giving him feels a touch too intimate for <em>just</em> <em>friends, </em>but Katsuki won’t let himself fall down that rabbit hole, no fucking sir. Katsuki kicks him from under the table.</p>\n<p>“Dumbass, go get your head checked.” </p>\n<p>Izuku isn’t afraid to laugh and kick him back, and the waitress comes with their food saying, “Now now, boys. I can’t be patching up any more holes in our walls.”</p>\n<p>“Yes ma’am.”</p>\n<p> </p>\n<p align=\"center\">~</p>\n<p> </p>\n<p>\n<em> “--in other news, stay tuned for our exclusive play by play footage of the Wonder Duo’s smackdown in Nara –” </em>\n</p>\n<p>“Suds!” Katsuki snaps, and the bartender is already turning it down.</p>\n<p>“Brooo, relax,” Eijirou digs into his shoulder with his hand. The damn guy is strong, and Katsuki grunts as he hits a muscle. “Holy shit, you’re like a bag of rocks. You feel like <em> me.</em>”</p>\n<p>“Hands off, shitty hair.”</p>\n<p>Eijirou doesn’t stop, but Katsuki is too tired to fight him (tell anyone he said that and he’ll kill you).</p>\n<p>“Hey man, if something is bothering you, you can tell me.”</p>\n<p>Yeah yeah, Katsuki knows. Eijirou is probably the only dumbass on this planet <em> other </em>than Izuku that Katsuki would trust to like, tell his feelings to or what the fuck ever. And seeing as Izuku is obviously out of the question right now…</p>\n<p>“You ever slept with a friend?” Katsuki asks. Eijirou’s eyes snap wide open, and he looks like he’s about to make a scene, but he quickly reels himself in, and pulls away his hand just in case.</p>\n<p>“Shit, dude. Yeah. Did something happen?”</p>\n<p>“Nothin’ bad,” Katsuki fits his head in his hand, and watches the TV. “Just different.”</p>\n<p>Eijirou stares. His hair is long, but he buzzes the underside, and he looks even more wild than in their highschool years. Katsuki is probably no different, because everyone says he looks scary no matter how short Katsuki cuts his hair. His manager calls it <em> branding. </em>Katsuki calls it a waste of his goddamn time.</p>\n<p>“Change can be good,” Eijirou offers.</p>\n<p> “Change can kill you,” Katsuki replies, and they both take a shot together, tapping their glass upside down on the bar.</p>\n<p> </p>\n<p align=\"center\">~</p>\n<p> </p>\n<p>Like a time bomb, the week gets worse before it gets better.</p>\n<p>Katsuki would really prefer to be out doing field work, but it’s their office day – and after four straight hours Katsuki is going to <em> kill </em>Izuku in cold blood.</p>\n<p>“If you don’t stop clicking your pen I’m going to hurl you into the sun,” Katsuki hisses. Izuku pauses, and clicks his pen <em> one </em>last time before setting it down slowly on his desk. Katsuki’s temple throbs.</p>\n<p>“Sorry.”</p>\n<p>Katsuki goes back to reading through bullshit, and he’s not sure how much time passes, but it ain’t long enough. He notices his desk shaking slightly.</p>\n<p>Izuku is bouncing his leg, attempting to focus but cannot <em> sit still. </em></p>\n<p>“Deku, I swear to god.”</p>\n<p>Izuku stops. He looks a little sheepish as he slides down in his chair, and pulls his laptop closer. Katsuki breathes in and out. He’d ditch, but this shit really needs to get done, because uh, a chunk of his weekends are now busy again. Not that it’s a problem, it just is what it is.</p>\n<p>Five minutes later, when Izuku begins to squeak his chair back and forth, Katsuki’s lid finally pops.</p>\n<p>“That’s it, I’m going to find the intern that gave you caffeine and <em> skin them alive –” </em></p>\n<p>“No no no, wait!” Izuku stands up after him, setting out his hands like Katsuki is a wild dog. “I didn’t have any coffee!”</p>\n<p>“Then what the <em> fuck </em>is your problem?!”</p>\n<p>“Nothing! I’m just trying to focus!”</p>\n<p>“Well sit the hell down and <em> shut up!” </em>Katsuki barks back, and to his own surprise, Izuku follows his command immediately. </p>\n<p>Katsuki squints. He slowly sits back in his chair, and watches as Izuku stares down at his computer, ears burning.</p>\n<p>Weird…but okay.</p>\n<p>Katsuki is able to get a good chunk of work done in the quiet thirty minutes that follow. It becomes…<em> too </em>quiet, and Katsuki looks back over to check on Izuku. He’s still working, but he’s stiff and sweating, and honestly, he doesn’t look too hot.</p>\n<p>“Hey,” Katsuki snaps. Izuku jerks his head up.</p>\n<p>“Yeah?”</p>\n<p>“You okay?”</p>\n<p>Izuku blinks his dumb little eyelashes.</p>\n<p>“Huh? Yeah, I’m fine.”</p>\n<p>Katsuki looks him up and down. Izuku shifts, fwapping his pen against his lips, and then stops when he notices the repetitive noise, trying to focus back in on his work. Katsuki’s seen that look on his face before – but only recently, and it raises his suspicions.</p>\n<p>“Deku, stand up.”</p>\n<p>Izuku does without question– and then he looks embarrassed about it.</p>\n<p>“Uh, why am I standing?”</p>\n<p> Katsuki sighs, and leans back in his chair.</p>\n<p>“Come here.”</p>\n<p>Izuku is confused, but he crosses the distance between their desks without asking why. Katsuki doesn’t like it. Sure, it’s fun to boss him around in the bedroom, but it’s just <em> weird </em>to see Izuku so compliant in broad daylight. Something’s up.</p>\n<p>“Alright, spit it out. You can’t blow smoke up my ass without me knowin’.”</p>\n<p>Izuku lets out a breath. He looks to the closed office door, and then circles his finger around the corner of Katsuki’s desk.</p>\n<p>“Do you think you could…well. Just for a minute – real fast – just. Um.”</p>\n<p>“Oh my god, come on<em> .</em>”</p>\n<p>“Just tell me to do something,” Izuku begs. “Anything, please.”</p>\n<p>Katsuki frowns.</p>\n<p>“Deku, we’re not doing that shit right now. I’m just Katsuki.”</p>\n<p>“I know,” Izuku whines. “But this week – my head’s been all effed up. I can’t think right, and my brain is always super clear after you boss me around so I was hoping just – we can lock the door –”</p>\n<p>“We are <em> not </em>fucking in our office.”</p>\n<p>“Why not?”</p>\n<p>“<em>Deku.</em>”</p>\n<p>Izuku huffs, and leans his butt up against the edge of his desk, crossing his arms tightly. The motion pulls at his jumpsuit, and it’s way too much of a temptation. </p>\n<p>“Please? I want to get my work done but all I can think about right now is <em> you.</em>” Izuku says it, and then goes red, like the words hadn’t processed yet. “I mean! I haven’t broken any rules and the d-denial has been difficult and I k-keep getting <em> hard </em> all the time and <em> agh! </em> I’m going to stop talking now.” Izuku bites his lip.</p>\n<p>Katsuki raises his eyebrows.</p>\n<p>“You need to learn to self soothe. If I sweep in whenever you get like this, it could fuck with you mentally. I ain't gonna’ let this screw up our careers — our sessions are <em> strictly </em>once a week.”</p>\n<p>Izuku looks genuinely upset. It tugs at the part of Katsuki’s soul that wants to please and hold.</p>\n<p>“Right. I get it – sorry I asked. I don’t know what’s wrong with me.”</p>\n<p>Katsuki knows exactly what is wrong with him. <em> He’s </em> the one that’s been conditioning Izuku, sculpting their scenes a specific way, leaving Izuku needy and hard for a reason. He just wants to push him a <em> little </em>further. Just wants to see his breaking point – and from the way Izuku is fidgeting, obviously turned on and distracted – it looks like Izuku is almost there.</p>\n<p>It doesn’t sit well to have Izuku just slump back to his desk. But there needs to be a fine line between what happens in Katsuki’s bedroom, and their work life.</p>\n<p> Katsuki jerks Izuku to stand between his legs. He goes so easy, and the way their hero costumes bump and grind is oddly erotic. Izuku yelps, and Katsuki reaches up to drag Izuku’s head down by his hood. Katsuki speaks against his ear, firm and lowered so no one will hear his voice carry from under the door.</p>\n<p>“You’re going to go back to your desk, and you’re going to finish your work like a good boy, because I told you so.” Katsuki rubs the heel of his hand between Izuku’s legs, and he nearly buckles, arms shooting out to brace himself on Katsuki’s chair. “Then,” Katsuki purrs, “You’re going to spend the rest of the night thinking about how good it’s going to feel to finally come on my cock this weekend.”</p>\n<p>The little gasp from Izuku is so satisfying. He looks needy, like he could make the switch at any second, and <em> fuck </em>if that isn’t a sight to see in full Deku costume.</p>\n<p>“Please don’t lie about that. It’s – it’s all I’ve been thinking of.”</p>\n<p>Katsuki grins, now running softer, more teasing circles against Izuku’s erection.</p>\n<p>“Is that right? You want me to stuff you that badly?”</p>\n<p>Izuku chews on his cheek, but his response is surprisingly straightforward. “<em>Yeah.</em>”</p>\n<p>Fuck, they <em> can’t </em> do this in their freaking office, holy shit – Katsuki’s patience is so fucking thin right now, and his brain shows him vividly how nice Izuku would look spread over his desk and <em> no. </em>No no no. Absolutely not.</p>\n<p>Katsuki gives him a firm slap on the hip, and points to Izuku’s desk.</p>\n<p>“Your feedback is appreciated. Now go.”</p>\n<p>Izuku looks a little dazed, but he resumes his work without any more fidgeting for the rest of the night, so Katsuki considers the situation officially handled.</p>\n<p> </p>\n<p> </p>\n<p align=\"center\">~</p>\n<p> </p>\n<p>If Katsuki was momentarily worried that Izuku wouldn’t be able to handle this double (triple?) life they’re living — well, his doubts are gone by the next day. If anything, Katsuki thinks he might’ve thrown gas on the fire. </p>\n<p>Izuku is back to arguing with him over every fuckin’ crack in the road, and as much as it pisses him off, Katsuki enjoys it equally so. </p>\n<p>“I know what I saw!” Izuku hisses, chest pressed flat to the building roof. “Six in the back, two guarding the front door.” </p>\n<p>“And I’m <em> telling you </em>we can take them!” </p>\n<p>“What if they attack the hostages?!” </p>\n<p>“They won’t, because I’m gonna’ kill ‘em all before that happens.” </p>\n<p>“I’m done with this — we’re going through the roof!” </p>\n<p>“<em>No, dipshit,  </em>we’re going through the front door!” </p>\n<p>“This is why we get busted up so much!” Izuku whisper-yells, “Because you can’t control your massive ego!” </p>\n<p>There’s a distant <em> oooooooh </em>in his earpiece from the squad. Katsuki rips his out in frustration. </p>\n<p>“And you have the espionage skills of a fucking elephant! I’m not going through with a plan that won’t <em> work, </em>you stupid son of a bitch.” </p>\n<p>Izuku gasps, and the voices come in muffled and quiet through his yanked-out ear piece. </p>\n<p>\n<em> “Come on guys, we’re running out of time here.”  </em>\n</p>\n<p>\n<em> “Ground Zero, just go with Deku’s plan, Jesus Christ.”  </em>\n</p>\n<p>\n<em> “Hahaha, this feels like old times.”  </em>\n</p>\n<p>Katsuki breathes out of his nose like a bull. Izuku gets a satisfied look on his face, and phones in, “Alright, we’re going through the roof.” </p>\n<p> </p>\n<p>They set off the alarm, and end up fighting everyone head-on anyways, just like Katuski said they would. Although, Katsuki <em> will </em>say, they had a better vantage point to grab the hostages and yank them to safety, but Katsuki will take that admission to the grave. </p>\n<p>“What a moron,” Katsuki huffs, wiping soot from his face. </p>\n<p>“Would it kill you to be a little nicer to him?” Sero laughs, slapping him on the back. “Deku’s such a sweet guy. You’re the only person that can piss him off that much.”</p>\n<p>“Yeah!” Mina agrees. “You guys are <em> the wonder duo! </em>Stop being such a meanie.” </p>\n<p>Pfft. Katsuki looks across the road, where Izuku is getting his forehead dabbed with a swab. He meets Katsuki’s gaze and sticks out his tongue, and Katsuki rolls his eyes. </p>\n<p>“If you don’t think that nerd can handle himself, then you need to get your head checked.” </p>\n<p> </p>\n<p align=\"center\">~</p>\n<p> </p>\n<p>Katsuki probably had it coming, considering their argument at work — but it still surprises him so badly, that he drops his phone. </p>\n<p>He made a massive beef bowl last night, so Katsuki is heating up leftovers when his phone buzzes. He pats around his pockets, and puts his spoon in his mouth to wipe his hands off on his apron before unlocking his phone. </p>\n<p>It’s a text from Izuku that just says <em> &gt;[See Attachment] </em></p>\n<p>The photo opens, and Katsuki ends up fumbling both the spoon and his phone; he barely saves himself a shattered screen. </p>\n<p>A second text goes <em> ding~ </em>all sweet and innocent like. </p>\n<p> </p>\n<p>\n<em> &gt; kinda sad they’re almost gone (´ﾟωﾟ｀) </em>\n</p>\n<p> </p>\n<p>The cutesy way that Izuku texts always ticks him off — especially now, that little <em> brat.  </em></p>\n<p>The photo is of Izuku in the bathroom mirror. It’s foggy, like he just got out of the shower, and the way he’s posed shows off the perfect curve of his ass, speckled yellow and purple with old bruises. He’s <em> naked, </em>covering his face with a little heart sticker, like he doesn’t have one of the best bodies Katsuki has ever seen. </p>\n<p>Izuku’s ass has healed <em> perfectly — </em> way better than Katsuki could’ve dreamed of. He can still see the crop lines across his thighs, and Katsuki’s mouth waters with the desperation to <em> bite.  </em></p>\n<p>Katsuki has a million emotions running through his head, but the distant, rational part of his brain notes that this is a big step for Izuku. He’s becoming more confident. Katsuki wants him to feel comfortable, but also...isn’t this a little too casual? </p>\n<p>Maybe this is how Izuku interacted with doms in the past. Katsuki scowls. </p>\n<p>Izuku is still waiting for a response, so Katsuki types back. </p>\n<p> </p>\n<p>\n<em> ur a fukin tease &lt; </em>\n</p>\n<p>\n<em> u want more? &lt; </em>\n</p>\n<p> </p>\n<p>Ding! </p>\n<p> </p>\n<p>\n<em> ᕕ( ◔3◔)ᕗ maybe &lt;  </em>\n</p>\n<p> </p>\n<p>Katsuki reads the text and laughs, before chewing down on his cheek and looking around, as if someone caught him. Katsuki leaves him on read, and considers cleaning tonight so he can have Izuku over early tomorrow. This is going to take some time. </p>\n<p>\n<br>\n<br>\n</p>\n<p>He saves the photo. </p>\n<p>\n<br>\n<br>\n</p>\n<p align=\"center\">~</p>\n<p> </p>\n<p>Izuku has been to his house more times this month than he has in the last six, and it’s strange, because they’re <em> both </em>becoming accustomed to it. </p>\n<p>Katsuki was out fixing up his lawn when Izuku showed up early, having some excuse about already being on this side of town for an errand, so Katsuki lets him sit on his brick wall and hang out while Katsuki finishes watering his small lawn (still better than everyone else’s, fuck you). </p>\n<p>Izuku is talkative today, but it’s not as annoying as usual. Izuku follows him into the house, and kicks off his shoes while Katsuki washes his hands in the kitchen sink. </p>\n<p>“I had no idea how to handle it!” Izuku laughs, “They told me they were looking for a broom. Like — okay, I know I’m kinda’ thick sometimes, but I was seventeen once, too.” </p>\n<p>“Interns,” Katsuki rolls his eyes, but the mental picture still makes him snort a laugh. “They’ve got guts, I’ll give ‘em that.” </p>\n<p>“I pretended to buy into their lie because I didn’t want to embarrass them,” Izuku rubs his nose. “Maybe I should’ve corrected their behavior. I know the hormones are terrible, but the agency closet just isn’t the time or place.” </p>\n<p>“Look who’s talking,” Katsuki says, and Izuku squeaks, waving his hand around. </p>\n<p>“Shut up! Let’s forget that happened.” </p>\n<p>Hm. Katsuki wipes his hands off on a towel, and comes around to the barstool, where Izuku has planted himself. </p>\n<p>“You probably did the right thing. Getting caught is enough punishment, for now.” </p>\n<p>Izuku giggles, and his knees part naturally when Katsuki comes to stand between them. It’s almost enough for Katsuki’s heartrate to pick up. </p>\n<p>“You’re right. They’re lucky it wasn’t <em> you </em> who found them <em> . </em>” </p>\n<p>“Oh, I woulda’ milked the fuck out of that. They wouldn’t show their faces around here for weeks.” </p>\n<p>“Don’t be a bully,” Izuku coos, and something about his tone makes Katsuki’s ears prick. Izuku is staring down at him, and Katsuki sets his hands safely on Izuku’s outer thighs. </p>\n<p>“Speaking of seventeen. Still poppin’ boners?” </p>\n<p>Izuku jerks his chin away, but his voice comes out steady. </p>\n<p>“Err...more often than I’d like to admit. That’s your fault, by the way.” </p>\n<p>“I know,” Katsuki says, rubbing at his knees. “I’ll fix it. You ready to be good?” </p>\n<p>The needy, excited look on Izuku’s face makes him feel breathless. </p>\n<p>“Yes please.” </p>\n<p> </p>\n<p align=\"center\">~</p>\n<p> </p>\n<p>Katsuki tugs his gloves on, and the game starts. </p>\n<p> </p>\n<p>He sets aside a good half-hour to get Izuku warmed up. His hands start off soft before he gets rough. It doesn’t take long to get Izuku tied up how he’d like, a vibe stuffed up his ass and a black blindfold around his eyes. </p>\n<p>Katsuki sits on his side chair and casually scrolls through his social media, while Izuku squirms and whines and struggles on his bed. </p>\n<p>He’s stuck in the leapfrog pose, and Katsuki busted out the leather cuffs instead of the rope, because he plans on clipping Izuku into multiple positions. His face is forced down in the bed, his hands tucked between his legs and clipped to the bar spreading his ankles apart. Iuku is wearing unused belts on his thighs, and the clips jingle and click as he shakes. </p>\n<p>“Master,” Izuku begs, his teeth chattering in his skull. <em> “Please, </em> I can’t — I can’t take anymore — I won’t  — <em>ahn! </em>” Izuku digs his forehead into the pillows and keens, and the vibrator buzzes distantly. </p>\n<p>Katsuki checks his timer. </p>\n<p>“Six more minutes. You can do it, baby. Remember the rule?” </p>\n<p>“No cumming,” Izuku whines. </p>\n<p>“Yep. Try to relax for me.” </p>\n<p>The cuffs click and grind, and the bar between his ankles goes <em> clang! </em>as Izuku struggles. </p>\n<p>“It’s too <em> hard. </em> I — I can’t.” </p>\n<p>Katsuki quietly locks his phone. </p>\n<p>“I would never give you a command you aren’t capable of. You trust me, don’t you?” </p>\n<p>Izuku gasps, and turns his head as he hears Katsuki’s voice move somewhere else in the room. </p>\n<p>“Yes.” </p>\n<p>“Then relax for me, darling.” </p>\n<p>Izuku physically tries. Gods, he looks <em> gorgeous, </em>dark hair sticky against his forehead, face down and ass up, the tips of his pink ears covered by the blindfold. Katsuki is quiet as he picks up a toy and places it in his back pocket. </p>\n<p>He counts out another minute, and then presses his hand to the base of Izuku’s spine. His skin is damp and hot under his gloves. Izuku <em> caves, </em>like a single hand is enough to get him off. </p>\n<p>“Ah! Sir, <em> please.</em>” </p>\n<p>“You did it, thirty whole minutes, baby I’m so proud,” Katsuki unclips his wrists, and Izuku sighs happily as he’s allowed to sit upright. “Well done.” </p>\n<p>“Thank you, master.” The change in position rubs the toy deeper, and Izuku chokes, clenching his thighs together. <em> “Ah! </em> I can’t — it’s still going — mm! <em> ” </em></p>\n<p>“Does it feel good?” </p>\n<p>“I’m too close,” Izuku hiccups. “I won’t, I won’t make it.\"  </p>\n<p>The desperation in his voice is nice. Katsuki reaches between his cheeks and clicks the toy off, and Izuku goes limp. </p>\n<p>“Thank you for telling me. I’d rather stop than have you break a rule, okay?” </p>\n<p>“Yes sir.” </p>\n<p>“I’m going to cross your arms behind your neck and clip you into place.” </p>\n<p>Izuku nods blindly, turning his head to listen. </p>\n<p>“Yes sir.” </p>\n<p>Katsuki stands up on the mattress to grab the cord he has hanging from the bolted carabiner in the ceiling. He positions Izuku’s hands up and over his back, crossed at the wrists and elbows outward; Katsuki nudges him up to sit on his knees so the cord will hold him. The coils are strong, meaning it’ll take effort for Izuku to stay sitting. </p>\n<p>“This bungee can take about three hundred pounds,” Katsuki explains. “But any more than that, and you’ll break the ceiling in. I’ll be very upset, okay? Give me a color if something is too much.” </p>\n<p>Izuku almost laughs — and Katsuki forgives the character break, just this once. </p>\n<p>“Yes master.” </p>\n<p>Katsuki swats his hip for the attitude, and Izuku makes a happy sound. He decides to step off the bed and let Izuku sit there for a minute. He looks pretty, and Katsuki chooses to stare as he wiggles and adjusts to get comfortable. The position is going to ache eventually, but that’s what Katsuki wants. </p>\n<p>He doesn’t let Izuku know where he is. Izuku has hero-trained hearing, so he probably has a good idea, but Katsuki still keeps his footsteps quiet. He pulls the flogger out of his back pocket. </p>\n<p>“Sir?” Izuku tips his head. </p>\n<p>“Did I give you an order?” </p>\n<p>“No.” </p>\n<p>“Then stay there.” </p>\n<p>Izuku nods, and Katsuki twirls the handle around in his fingers. He decides to drag the end of the toy up between Izuku’s legs, and Izuku startles, jerking to sit up higher. </p>\n<p>“You’ll find this to be similar to the crop,” Katsuki explains. “But the end has tassels, like a whip. It’s an increase on the pain scale.” He pets down Izuku’s backside, rolling the handle along his spine, light enough to tickle. Izuku’s breath quickens. </p>\n<p>“Oh.” </p>\n<p>“If I give you lashes now, then your ass is going to hurt even more when I fuck you.” Katsuki feathers between his shoulder blades, then under his armpit. Izuku squeaks and thrashes, and Katsuki drags up and down, torturing him further. “Do you want that, pet?” </p>\n<p>“Oh my god <em>yes! </em>” Izuku begs. He continues to flinch, and Katsuki walks around to tap the tassels lightly against Izuku’s chest, rubbing over his nipples. “Ngh! I want it badly, sir.” </p>\n<p>“Tell me why?” </p>\n<p>“Because it will please you,” Izuku repeats. </p>\n<p>Katsuki decides to tease him further. </p>\n<p>“Why will it please me?” </p>\n<p>“Ah,” Izuku bites his tongue, and wiggles as Katsuki pets across the head of his cock. It’s standing completely upright, and it twitches as Katsuki teases him. So pretty, so obedient. “Um.” </p>\n<p>“Baby?” </p>\n<p>“I don’t — know,” Izuku flushes. “Master, I’m sorry.” </p>\n<p>Katsuki presses the flogger handle under his chin and lifts his head up. The mattress squeaks as Katsuki presses a knee in the bed, and he lets Izuku feel his breath against his ear as he leans closer. </p>\n<p>“You don’t know why?” </p>\n<p>“No, sir.” </p>\n<p>“Because you will look <em> beautiful,</em>” Katsuki grips his hair and tugs, “with the marks I’ll give you.” </p>\n<p>Izuku inhales sharply. He’s responsive as Katsuki gets in his face, breathing heavy, but blind to how close Katsuki is. The air feels charged, electric, tangible, like Katsuki could bite it and feel the electricity with his teeth. </p>\n<p>“The sounds you’ll make,” Katsuki continues, “will be beautiful.” </p>\n<p>For a single, terrible moment — Katsuki wants to kiss him. Izuku’s lips are parted and wet and bitten and Katsuki wants to, he fucking <em> wants.  </em></p>\n<p>“The way your body responds, against your own will.” Katsuki flicks the head of his cock so it’ll hurt, and Izuku yelps, twitching. “It pleases me.” </p>\n<p>Izuku is breaking apart. His erection twitches insistently, and Izuku looks embarrassed about it, but to Katsuki, it’s the highest compliment he could get. </p>\n<p>“I want it, please.” </p>\n<p>Katsuki gets up off the bed to stand behind him. </p>\n<p>“I’ve chosen ten for you. No breaks.” </p>\n<p>“Thank you,” Izuku begs, and with the first whip, he sobs. “<em>Thank you!”  </em></p>\n<p>Katsuki feels drunk with it. Two, three, four, five. One after the other, perfect lines exactly where he wants them, new marks on top of fading, old bruises; he’s <em> stunning, </em>like every dominant’s dream. The way his body shivers, how his spine arches and his arms fight against the bungee — Katsuki could just float off into space. Izuku’s cries are painful, but happy, and Katsuki is eating it up. </p>\n<p>Six, seven, eight. The slaps are loud in his ears, and Izuku’s ass is pink and hot to the touch, even through his gloves. </p>\n<p>He’s perfect, he’s <em> perfect. </em> Screeching <em> master, yes! Yes!  </em></p>\n<p> </p>\n<p>\n<em> Mine! He’s mine!  </em>\n</p>\n<p> </p>\n<p>Nine, ten. </p>\n<p> </p>\n<p>Katsuki suddenly can't take it. </p>\n<p> </p>\n<p>“God, Izuku,” Katsuki chokes. “That was amazing. Fuck — I have to have you.”</p>\n<p> </p>\n<p>Izuku gasps, hanging his head heavy and pulling against the bungee, and suddenly he’s <em> loud. </em>His filter has been beaten out of him. </p>\n<p>“Please! Please! <em> Master please! Fuck me — I need it, I can’t wait any more — please, sir!”  </em></p>\n<p>Katsuki can no longer tolerate the leather barrier. He <em> needs </em> to feel Izuku’s skin<em>. </em>Suddenly he is up on the bed, pulling out the toy and ripping off his gloves. Izuku moans at the feeling of his bare hands, and Katsuki pulls and kneads at his stinging behind. </p>\n<p>“Ugh, you sound so sexy,” Katsuki tells him, at the back of his ear. “So perfect for me. This cable will hold your weight, I want you to bounce in my lap for me, okay?” </p>\n<p>“Yes!” Izuku sobs happily. “Yes! I will!” </p>\n<p>Katsuki burns to bite his neck, suck on his tongue, kiss him until his mouth is numb — but he has to keep barriers (fuck, it’s torture), or the spell will be broken. </p>\n<p>Katsuki is so hard it hurts; he yanks down his jeans and grinds his cock against Izuku’s sore ass — and Izuku is shivering, clenching his fingers and rubbing back against him so needy, Katsuki misses his hole twice before slipping in. (The kink list had checked bareback, and fuck if Katsuki hadn’t been thinking about that every night for weeks).  </p>\n<p>The toy stretched him perfectly, and they both make a relieved sound when Katsuki bottoms out — like they’ve both been waiting for this. Like it means more than it does. But Katsuki can’t even begin to spare the braincells to think about that. Izuku is wet and burning hot, and in this position, Izuku’s bodyweight forces him all the way down until their thighs meet. Izuku’s head cracks back against his shoulder, and he <em> screams.  </em></p>\n<p>It actually startles Katsuki for a moment. Izuku is sweating worse than Katsuki.  </p>\n<p>“I can’t! I can’t!” Izuku wheezes. “I’ll finish, <em> wait, please.”  </em></p>\n<p>“You can hold it,” Katsuki urges, and holds him by the waist. “Come on, bounce for me, baby.” </p>\n<p>Izuku is <em> loud. </em>Katsuki didn’t know he had it in him. He openly moans as he sits up on his knees, and the sound reverbs right into his fucking core. Everything has built into this. Katsuki wants to grip him by the throat and nail him into oblivion, but he needs Izuku to feel comfortable setting the pace first. </p>\n<p>Izuku takes a moment to get moving, but once he does, Katsuki feels his eyeballs roll into the back of his skull. He grits his teeth and helps Izuku with part of his weight, squeezing hot into his bare thighs; and the sounds that come out of this guy — holy fuck. Short, loud whines of <em> ah! ah! ah! </em>And Katsuki has never felt his patience rub so damn thin. </p>\n<p>He’s fucked his own share of subs, but Izuku has the body to meet all of Katsuki’s impossible demands, and he looks like an <em> angel </em>in his lap, sweaty and burning and crying out whenever his beaten ass hits Katsuki’s thighs. The slapping sound is obscene, and Katsuki can hear Izuku’s cock hitting his stomach as he rides. </p>\n<p>“That’s it, bunny,” Katsuki praises, petting him, all skin on skin, (finally fucking finally). “You feel so good baby, god you look like <em> porn, </em>sweetheart.” </p>\n<p>Izuku sobs. The blindfold is getting wet, and a terrible part of Katsuki’s ego just loves it. </p>\n<p>“You’re so big,” Izuku whines, “It’s — Master, I w-won’t make it.”  </p>\n<p>“Thirty seconds,” Katsuki tells him. “Then I want you to come when I tell you.” </p>\n<p>Izuku shakes with effort. Katsuki keep his hands clear from Izuku’s cock, and his pace slows as he gets closer. He’s trying so hard, the poor thing, and Katsuki mouths right over his freckled shoulder in a momentary loss of control. </p>\n<p>He wants Izuku’s world to explode. Katsuki wants it to be because of <em> him. </em></p>\n<p><em> “Now, </em>baby — right now.” </p>\n<p>And on command, Izuku makes a high keening sound, before he clenches down and <em> moans. </em>He shakes so violently, that Katsuki stops fucking him to keep him conscious. Katsuki looks over Izuku’s shoulder to watch him soak the sheets. It’s incredible, and Izuku just keeps going — keeps crying and jerking in his lap, riding back on him and whining and it’s so much, it’s so fucking much, Katsuki has to grit his teeth to keep himself from following. It looks like the orgasm of the century, and Katsuki’s ego is officially stroked. </p>\n<p>Katsuki coos at him, rubbing into his thighs until Izuku is breathing normally again. </p>\n<p>“Stunning, just fuckin’ gorgeous. All better, yeah?”</p>\n<p>“Thank you, sir,” Izuku rasps. His voice is raw. </p>\n<p>“Oh, you’re not done,” Katsuki says. He reaches around to squeeze his cock and tug, and Izuku nearly screeches. “Hey now. I denied you three times, didn’t I? That means I owe you three more.” </p>\n<p>Katsuki can physically see him pale, even through the blindfold. He turns his head to try and look over his shoulder. The shocked look on Izuku’s face is gratifying. </p>\n<p>“Master, I — <em>ah, </em>I can’t do that!” </p>\n<p>“What did I say about the word <em> can’t </em>?” </p>\n<p> </p>\n<p align=\"center\">~</p>\n<p>\n<br>\n<br>\n</p>\n<p>Izuku sounds like he’s being strung alive and left for dead. It’s kind of incredible. </p>\n<p>Katsuki unhooks Izuku to give his arms a rest, and re-clips his wrists to his thigh belts, so he won’t thrash too much as Katsuki fucks him on his back. He tries to commit him to memory, wishes he could slow down time to etch this picture into his skull.</p>\n<p>He desperately wants to rip off Izuku's blindfold, but it would be too much face-to face like this. Not yet, at least. </p>\n<p>Katsuki continues to jerk him off as he pounds into him, and Izuku cries and cries and cries. </p>\n<p>\n<em> “It hurts! It hurts!”  </em>\n</p>\n<p>“It’s called post-orgasm torture for a reason, baby.” </p>\n<p>Izuku is openly sobbing, and Katsuki wants desperately to swallow his cries, but they also fill him up like a bowl. He’s hot all the way down to his toes, and when Izuku cries so hard he gags, Katsuki feels his stomach <em> curl.  </em></p>\n<p>“Give me a second one, darling,” Katsuki urges, close enough to brush his lips against his cheek. “It’s your reward. Isn’t this what you wanted?” He keeps his other hand planted in the sheets for balance, and he jerks Izuku off at a terrible pace. Izuku is completely oversensitive, and Katsuki warms his hand to burn a little, and Izuku almost breaks his own leg as he thrashes. Katsuki won’t have that. “Hey!” Katsuki barks, and Izuku straightens up. “That was an order.” </p>\n<p>“I can’t! It’s — you’re so deep! It hurts! <em> It hurts! </em> I can’t! <em> ”  </em></p>\n<p>“No more of that word, or you’ll be in trouble.” </p>\n<p>Katsuki fucks him long and hard, the headboard slamming on every other thrust, and Katsuki <em> barely </em>keeps his shit together when he grinds into Izuku’s prostate, and Izuku comes a second time. It’s violent, and Izuku screams silently, and Katsuki stills his hips to work Izuku through it. He spills less this time, but he still coats Katsuki’s hand. </p>\n<p>“<em>That’s </em>it baby, only two more to go. Don’t you feel better already?” </p>\n<p>Izuku knocks his head back against the pillows and whines weakly. He’s going nonverbal, and Katsuki watches to make sure he’s still listening. </p>\n<p>“Are you with me, baby?” </p>\n<p>\n<em> “Nnh.”  </em>\n</p>\n<p>“You still know your colors, right?” </p>\n<p>Izuku nods shakily. Katsuki sits back on his heels and slips out just long enough to grab his wand. </p>\n<p>“Alright, good.” </p>\n<p>He flicks it on and presses it to Izuku’s soft cock, and Izuku’s previously limp body goes tight as a bowstring, and uh. Hope the neighborhood isn’t home, because Iuzku screams bloody murder — and Katsuki spreads his sore cheeks and slips back in, only to do him slow and drawn out, a different type of torture as Izuku’s back stays arched off the bed, wrists clinging and twisting against the restraints on his thighs. </p>\n<p>Katsuki pushes up a flexible leg burned with freckles and scars — and just watches, like a king on his throne. </p>\n<p>\n<em> More. You can take more, baby. Trust me, I’ve got you — I won’t let you fall. </em>\n</p>\n<p>Izuku is a <em> mess. </em> His mouth pools with drool, and he chokes and cries and struggles as Katsuki forces him to get hard a third time. Izuku keeps trying to beg — trying to form words like <em> Master! Master! </em>But it's raspy and gargled and gone, just gone. </p>\n<p>Everything slows down, to this. Izuku is breaking apart underneath him, and Katsuki feels his emotions run high, and his eyes start to burn against his own will. </p>\n<p>“So good,” Katsuki praises, ignoring the crack in his voice. “You’re so <em> good. </em>Fuck, fuck I’m so proud of you.” </p>\n<p>Izuku is slipping. He’s hiccupping so bad, his chest just wretches. </p>\n<p>“Y-yellow!” </p>\n<p>Katsuki understands that Izuku is reaching subspace. It’s probably scaring him. </p>\n<p>Katsuki rocks in and out, a slow pace for Izuku to focus on. Katsuki can’t even process his own pleasure right now — he’s living for Izuku, hanging off his every cry, holding his breath for his next moan. </p>\n<p>“Come on, you’re doing so well. I know you’re scared — but you can go in there. I’ll catch you. Don’t worry about limits, don’t worry about can or can’t — <em> I’m </em>in charge, not you.” </p>\n<p>Izuku’s spine lifts off the bed again, and Katsuki just grinds and grinds and grinds. </p>\n<p>\n<em> “Ah! Ahh!”  </em>\n</p>\n<p>“Let go,” Katsuki coos, his throat tight. “You’re safe. Let go.” </p>\n<p>Izuku comes dry. He’s so beautiful, that Katsuki gets kicked by his own orgasm. He curls over him, setting aside the wand and fucking jerkily through the endorphins. He feels cross-eyed, and can barely spare the brainpower to watch Izuku seize. And then drop. </p>\n<p>Just like magic, all that tension, the wiggling and the squirming and the wailing; it stops. </p>\n<p>The blindfold got rubbed off, and now Izuku is just watching him. His eyes are gone, his voice is gone — he’s just <em> gone.  </em></p>\n<p>Katsuki shakes. Adrenaline hits him, and the rational part of his brain flies out the window. </p>\n<p>\n<em> His. His. His.  </em>\n</p>\n<p>\n<em> His sub. His baby. He needs Katsuki — he needs him.  </em>\n</p>\n<p>Katsuki slips, too. </p>\n<p>He breathes out steady, hyper focused and numb to the world. Izuku is just staring. </p>\n<p>“I want one more orgasm from you,” Katsuki states clearly. Izuku just nods. </p>\n<p>He pulls out and stuffs Izuku with his fingers. Izuku closes his eyes and hums. </p>\n<p>Right now, to Izuku, any stimulation — any pain — it’s just going to feel like pleasure. He won’t be able to feel much, and Katsuki has to keep the experience positive. He’s working on instinct, now. The world could burn, and they wouldn’t know it. </p>\n<p>“Keep your eyes on me,” Katsuki says coolly. He leans down, right between Izuku’s legs, and presses his mouth to his inner thigh. Izuku shivers, but doesn’t react. Katsuki bites down, and Izuku makes a happy trilling sound. </p>\n<p>“Master.” </p>\n<p>“Yes?” </p>\n<p>No response. Izuku blinks sleepily, and his eyes are full of <em> adoration — </em> all spiked right at Katsuki. He fingerfucks Izuku slowly, and he spends his time working a fourth orgasm out of him. He nips up into his hip, licks across the stubbly hair on his navel, works Izuku’s hole slick with his own cum, and Izuku just purrs and purrs and <em> purrs.  </em></p>\n<p>When he finally falls over the edge, he whines quietly, and comes dry and soft. Katsuki’s heart rattles in his chest. He’s so proud he can’t even <em> take it.  </em></p>\n<p>“You did it, sweetheart.” </p>\n<p>Izuku’s hands reach for him. Katsuki lets him pet his hair, and he feels himself vibrate as Izuku keeps making happy humming noises. </p>\n<p>“I’m gone.” </p>\n<p>“I know you are. You were so good for me. I’m going to take care of you.” </p>\n<p>Izuku’s eyes water. </p>\n<p>“I was good?” </p>\n<p>Katsuki leans up far enough to kiss his cheek, because he’s going to die if he can’t. </p>\n<p>“Perfect. You stay in there until you feel okay to come out, alright?” </p>\n<p>“Yes sir.” </p>\n<p>Gods, Katsuki could <em> cry. </em>This is why he doesn’t drop subs often — their emotions always rattle his core, and he’s left feeling overstimulated for days. </p>\n<p>But that’s a future problem. Izuku's well being is his only priority (and how long has that been true? Katsuki won't think about that either). </p>\n<p>\n<br>\n<br>\n</p>\n<p align=\"center\">~</p>\n<p>\n<br>\n<br>\n</p>\n<p>Katsuki undoes the buckles on the leather cuffs one by one. Izuku is pure jelly, his arms limp like noodles as Katsuki releases his wrists. </p>\n<p>Poor Izuku is so out of it, that he doesn’t even startle when Katsuki dips to grab a damp towel. This time Katsuki is the one that doesn’t want to stray too far. The idea of Izuku leaving his sight makes him sick right now. </p>\n<p>He strips down to his underwear on his way back into the bedroom, and Izuku is making grabby hands when Katsuki kneels back on the mattress. </p>\n<p>“Okay?” </p>\n<p>“Mmmm.” </p>\n<p>Jeez, Izuku is a disaster. His eyes are puffy and swollen from crying, and he’s covered in <em> many </em>various liquids, and Katsuki gets started on wiping him down. Izuku whines from the texture of the towel, and Katsuki clicks his tongue and pulls away. </p>\n<p>“Sorry, I’ll go slower.” </p>\n<p>He starts at his inner calves again, wiping up in circular motions that get him used to the oversensitivity. Izuku twitches away when he cleans between his legs, and eventually the mess on his chest. </p>\n<p>“Well done, you. Can you talk yet?” </p>\n<p>Izuku just stares at him. Katsuki waits a hot minute for an answer, like Izuku’s brain is running on power saving mode. </p>\n<p>“Mhmm.” </p>\n<p>“So that’s a no, that’s fine,” Katsuki rubs his thumb into his hip. “Can you roll over? I’ve got balm for the bruising.” </p>\n<p>Izuku nods, and rolls obediently onto his stomach. He’d walk right into traffic if Katsuki asked him to — and that power — it makes him <em> sick </em>thinking that someone else could have it. </p>\n<p>Izuku is <em> his.  </em></p>\n<p>The whip left claw-like marks on his skin, and Izuku’s ass continues to look like a painting. It’s pink and irritated, and Izuku sighs a happy sound when Katsuki rubs over an ointment for the sting. </p>\n<p>“Feels good?” </p>\n<p>“Yes, sir.” </p>\n<p>Words are a good sign. Katsuki wants to feel the heat with his mouth, so he leans down to kiss at one of the swollen lines. Izuku stretches out and purrs, pushing his ass out further, and Katsuki’s heart rolls right into his stomach. </p>\n<p>“Can I hold you?” Katsuki asks. Izuku nods furiously, so Katsuki nudges them over to the dry part of the bed, and hauls Izuku over him. He locks him in with his arms, gets their knees to knock and their elbows to rub and <em> this </em>is what gets a reaction out of Izuku. This is what Katsuki was looking for. </p>\n<p>Izuku clings onto him suddenly, like he’s been waiting all along for permission to touch. He wraps his arms around Katsuki’s neck and jams his face right in his throat, and Katsuki locks him in like a seatbelt. The hug is tight and safe. Izuku takes his first full breath, and it warms Katsuki from the inside out. </p>\n<p>Izuku wiggles into him like a snuggly bear, and says,</p>\n<p> </p>\n<p> “I love you.” </p>\n<p> </p>\n<p>And then Katsuki’s heart falls out of his ass. </p>\n<p> </p>\n<p>His eyes sting, and Katsuki has to kick his ass back to the freakin’ present. <em> Hello </em>real world, holy fuck. A thousand and one alarms go off in his head, and Katsuki feels like he’s been dumped in cold water. </p>\n<p>\n<em> Best friend. Best friend. Best friend. This is your fucking best friend.  </em>\n</p>\n<p>Katsuki bites his tongue until it hurts. He rubs his hand up and down between Izuku’s shoulder blades, swallowing thickly. </p>\n<p>Deku is in subspace right now. It’s the endorphins talking, so whatever Izuku blabbers about is not his fault. Katsuki repeats this like a prayer. </p>\n<p>Izuku makes a sound in complaint, and Katsuki pets his hair. </p>\n<p>“Shhh, just focus on you right now. How do you feel?” </p>\n<p>“Mmm. Good. Sleepy.” </p>\n<p>“You can sleep.” </p>\n<p>Izuku has never spent the night, but he’s not sending Izuku home like this, even if he comes out of it within the hour. </p>\n<p>“Noo. Wanna’ stay with you.” </p>\n<p>“I ain’t goin’ nowhere,” Katsuki reminds. “Do you feel sore?” </p>\n<p>“Nuh huh. Just floaty.” </p>\n<p>Katsuki knocks Izuku’s hip with his knee, and buries his nose in his hair. He smells like any other sweaty adult man — but he likes it; it’s grounding. </p>\n<p>“Focus on my breathing, okay? You’re safe here.” </p>\n<p>Izuku cuddles further into him, and Katsuki’s throat is full of cotton. <em> Stop stop stop.  </em></p>\n<p>Katsuki is only able to fall asleep when Izuku is totally out, nothing but dead weight on his chest, heavy over his heart. His brain has too much to process right now — so Katsuki chooses to think about absolutely none of it. </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>When Katsuki wakes, he feels like he’s been run over by a bus. But like, an emotional one. Damn, if Katsuki is exhausted, he can only imagine how the nerd feels. </p>\n<p>\n<br>\n<br>\n</p>\n<p>His eyes snap open. </p>\n<p> </p>\n<p>\n<em> Fuck! Deku!  </em>\n</p>\n<p> </p>\n<p>Katsuki slams his hand out on the sheets, and panics when he meets an empty space. Jerking upright in bed, he rubs furiously at his eyes, looking around the bedroom. Izuku’s clothes are still folded on the desk, but his phone is gone. </p>\n<p>\n<em> Don’t tell me this asshole walked out the door naked — I swear to Christ I’ll kill him— </em>\n</p>\n<p>The door squeaks. </p>\n<p>Izuku comes waddling back into the bedroom, butt naked and with tea in hand. He pauses when he sees Katsuki sitting up in bed. </p>\n<p>“Oops,” Izuku blinks. “Busted.” </p>\n<p>Katsuki is disgusted at how relieved he feels. He flops back onto his pillow and rubs the sleep out of his eyes. </p>\n<p>“Holy hell, I thought I was gonna’ have to bail you out for streaking.” </p>\n<p>“You give me a lot of credit,” Izuku says, and crawls back in his bed. Everything about this is so completely new — so why does it feel so natural? </p>\n<p>Katsuki watches him with one eye open, and Izuku pulls the sheets politely over his lap, like Katsuki didn’t fuck his brains out last night. </p>\n<p>Izuku takes a sip and flinches from the heat. He blows the top of his mug and tries again, and Katsuki watches the way he shifts stiffly. His side profile is lit from the window, like a stupid angel or something. </p>\n<p>“So um...last night.” Izuku clicks his nails on his mug. “That was intense.” </p>\n<p>That’s certainly one way to put it. Katsuki hums in agreement. </p>\n<p>“Sore?” </p>\n<p>“Err...yeah. In more ways than one.” </p>\n<p>Katsuki chews on the inside of his cheek, and props his head up on one arm to look casual. </p>\n<p>“You alright?” </p>\n<p>Izuku laughs, and his voice sounds raspy from all the crying. </p>\n<p>“Okay, um. I hate to stroke your ego like this, but that was the best sex I’ve ever had. I’ll never doubt you again.” </p>\n<p>Katsuki grins at him, and pokes at his thigh. </p>\n<p>“Told ya’ I’m the shit<em>.</em>” </p>\n<p>Izuku snorts, and leans back against the headboard. He doesn’t appear to have any memory of his confession last night, and Katsuki tells himself he’s glad about that. </p>\n<p>“I have no idea how you do it, Kacchan.” For just a second, Katsuki thinks he might’ve seen Izuku’s eyes shine over, his face falling sad and distant — but it’s gone before Katsuki can blink. “I guess I should go home, huh.” </p>\n<p>Katsuki groans as he stretches, popping his shoulder and his neck, before sitting up again. </p>\n<p>“Well shit. I’ll at least make you breakfast.” </p>\n<p>“You don’t have to do that.” </p>\n<p>“Fuck you, you’re helping.” </p>\n<p>“Aww, but I’m <em> sore </em>Kacchan.” </p>\n<p>“Boo fucking hoo, do you want pancakes or what?” </p>\n<p>“Wait, do you have strawberries?” </p>\n<p>“Do I look like a barbarian?” </p>\n<p> </p>\n<p align=\"center\">~</p>\n<p> </p>\n<p>Katsuki digs out his bluetooth speaker, and Izuku is given the very easy and simple task of cutting strawberries, while Katsuki flips pancakes in the pan. </p>\n<p>They’re only half-dressed, and Izuku makes it clear that he’d rather stand than sit, and Katsuki takes the opportunity to smack his butt with the spatula, and gets an egg thrown at his face for the trouble. </p>\n<p>“You are <em> so </em>freaking lucky this didn’t break,” Katsuki says, lifting the egg he caught. “Or you’d be six feet under right now.” </p>\n<p>“But it would’ve been pretty funny,” Izuku admits, rubbing his sore butt. Katsuki tries to smack him again, but Izuku dodges this time, and Katsuki is forced away when his pancake starts to bubble. </p>\n<p>“Quit eating all strawberries.” </p>\n<p>“No.” Izuku pops another in his mouth and laughs, and Katsuki wants to be mad, but he can’t.</p>\n<p> Izuku keeps staring at him, and it makes Katsuki want to touch him, even if they’re not in a scene and — <em>no, </em> no way. <em> Friends with benefits, hello. </em></p>\n<p>“Hey Kacchan?” </p>\n<p>“What.” </p>\n<p>“We used to hang out like this a lot, didn’t we?” Izuku slips another strawberry in his mouth, painting his lips pink. “Well, I guess — not <em> a lot </em>a lot, but, when did we get so busy?” </p>\n<p>“When we hit the top ten, probably.” </p>\n<p>“Yeah. We’re so close to our goal...but I still missed hanging out with you outside of work. I mean —” Izuku flushes. “I’m glad we can still um. Be like this.” </p>\n<p>Katsuki squeezes the spatula and stares at the pan. This is too much. </p>\n<p>“Go catch butterflies with your nerd friends if you want someone to <em> hang out </em>with. I ain’t the guy.” </p>\n<p>Izuku isn’t bothered by his attempt to shrug him off. </p>\n<p>“Oh stop that, yes you are. Remember when we did eighteen shots for my birthday and then stumbled into that paintball arena?” </p>\n<p>Katsuki cracks a smile, and flips a pancake in Izuku’s direction. He catches it on the plate with one hand. </p>\n<p>“Fuck yeah I do. Whooped your ass so bad you cried.” </p>\n<p>“I cried because I was <em> drunk </em>and I saw a duck crossing the road,” Izuku points. “Don’t get it twisted.” </p>\n<p>Katsuki laughs, and Izuku smiles at him — and Katsuki is left to wonder what the hell he’s doing. He would’ve shoved any other sub out the door first thing in the morning; but this isn’t a normal hookup, it’s freaking Deku. The lines in the sand are getting blurry. </p>\n<p><em> Don’t shit where you eat, </em>Mom used to say. Ugh, shut up Mom. </p>\n<p>Katsuki keeps making pancakes, and Izuku finishes off the strawberries. They stand as they eat, and it gets quiet, so all you can hear is Katsuki’s alternative music, and the sound of the ice machine running in the fridge.</p>\n<p>Izuku decides to be shy when he says goodbye, flipping his phone in his hands and staring at the floor. </p>\n<p>“Um. So we’re okay, right?” </p>\n<p>Katsuki rolls his eyes and leans up against the doorframe, arms crossed. </p>\n<p>“Dumbass, again with this. I think our friendship is sealed in blood by now.” </p>\n<p>Izuku’s gaze turns away. He bites his lip, and his smile doesn’t quite reach his eyes. The distant look on his face is gone so fast that Katsuki misses it.  </p>\n<p>“You’re right. See you on Monday, Kacchan.” </p>\n<p>“Later, nerd.” </p>\n<p>Something feels off, but Katsuki doesn’t have the brainpower to compartmentalize the last twenty-four hours right now. He has a lot of toy cleaning left to do. The monotony will be good for his head, anyways. </p>\n<p> </p>\n<p align=\"center\">~</p>\n<p> </p>\n<p>Izuku isn’t doing so hot this week, and it’s pissing Katsuki off. </p>\n<p> </p>\n<p>They’re normally a well-oiled machine, crafted through years of vigorous training and practice, but Izuku is making rookie mistakes, and if it gets any worse, it could cost them lives. </p>\n<p>So far they’re only little things; breaking a few windows on accident, smashing into a bus, pushing his quirk too far and straining his ankle. It’s not the end of the world, but it <em> does </em>piss Katsuki off to no end. </p>\n<p>Katsuki can see the frustration on Izuku’s face, so he chooses not to drill him on it (this time). Nobody is harder on Izuku than himself.</p>\n<p>“Morning,” Izuku greets, perched right where Katsuki expected him to be. The bunny ears catch in the wind, and his hair tosses around his forehead. He really looks like a hero, when he crouches like that. Probably ‘cause it’s the pose most of his merch is made in. </p>\n<p>Katsuki grunts, chewing the rest of his bagel and locking his gauntlet in place. He looks Izuku over — takes note of the eyebags and yesterday’s scratches from the broken glass.</p>\n<p>“Ready for a fresh start?” </p>\n<p>Izuku looks relieved. He nods, and then they’re off jumping rooftops again. </p>\n<p>\n<br>\n<br>\n</p>\n<p align=\"center\">~</p>\n<p> </p>\n<p>Ugh, Katsuki is wiped out, come Friday. He won’t admit that to nobody but God, but <em> fuck, </em>these twenty-four-hour overnight calls have been a pain in his ass. Katsuki keeps getting paged at the worst times, and he is one more three-am call away from wringing his assistant’s neck. </p>\n<p>“She’s just doing her job,” Izuku reminds him tiredly, scooping up a bus and rolling it back on it’s wheels. “Don’t shoot the messenger.” </p>\n<p>“Fuck off, I <em> know.</em>” Katsuki grunts, and sets down a concrete slab. “I’m just sick of these cleanup calls.” </p>\n<p>He’s usually not on the search and rescue team, but this whole section of the city lost power during an attack, so the association called all hands on deck to clear the roads before the eight-am rush. The only solace Katsuki has is knowing that dumbass Denki got ripped out of bed to be a human jumper cable again. </p>\n<p>Izuku flips over another car with one hand, and then dusts off the hood, like that’ll make a difference. Katsuki stops to wipe his forehead, pushing up his mask in the process. Izuku powers down before he offers a waterbottle, and Katsuki waves him off. Izuku shrugs and takes his own sip. </p>\n<p>“I’m going clubbing with Shouto and Ochaco on Sunday.” </p>\n<p>Katsuki looks at him. </p>\n<p>“No thanks.” </p>\n<p>“I wasn’t inviting you,” Izuku teases, and Katsuki rolls his eyes. </p>\n<p>“Fine, then I won’t wait around.” </p>\n<p>“Well…” Izuku leans up against the car, and the hood creaks. “I was wondering if you just wanted to come over and smoke tomorrow. I’ve uh. Had enough beatings this week.” </p>\n<p>So, no session. It’s not like it’s a big deal, but Katsuki still raises his eyebrows. Izuku looks sheepish, so Katsuki was correct in assuming that Izuku has been kicking himself over the random mistakes this week (of course he was right, he’s right about everything, duh). </p>\n<p>“We haven’t done that in a while,” Katsuki notes. Izuku shrugs. </p>\n<p>“You don’t have to.” </p>\n<p>Katsuki would like to point out that they could just <em> not </em>hang out this weekend, but that makes his chest feel all tight and gross, and Katsuki hates it, so. </p>\n<p>“I ain’t bringing anything.” </p>\n<p>“Fine with me,” Izuku laughs, dusting off his hands. “Consider us even.” </p>\n<p> </p>\n<p>\n<em> He really doesn’t remember, does he?  </em>\n</p>\n<p> </p>\n<p>“Whatever.” </p>\n<p> </p>\n<p align=\"center\">~</p>\n<p> </p>\n<p>Katsuki lied. He brings takeout, because he knows he’s going to get hungry, and all Izuku keeps are those disgusting gluten-free barbeque chips and a fridge full of protein shakes, and Katsuki will never stoop so low to torture his stomach with that crap. </p>\n<p>The hallway still smells like cheese, and a familiar herd of elephants is stomping around on top of them, but Izuku busts out the bong and an old <em> All Might </em>movie, so Katsuki tones the annoyances out. </p>\n<p>Izuku looks warm in sweatpants and a long sleeve shirt. The sleeves are rolled up to his elbows, and when he stands up to grab Katsuki’s Chinese food out of the fridge, Katsuki notes how <em> long </em>those joggers are on him. </p>\n<p>“Are those mine?” </p>\n<p>“Uhhh,” Izuku looks around the takeout in his arms, down to his toes. “Hah, yeah.” </p>\n<p>“<em>How?”  </em></p>\n<p>“Well, I stole them.”</p>\n<p>Of course. </p>\n<p>Katsuki trades him the bong for the food, and Izuku takes another hit while Katsuki opens the rice container. </p>\n<p>“You rat bastard, right from under my freakin’ nose.” </p>\n<p>“They’re the <em> Plus Ultra All-Might </em>line from UA! They’re comfy and so hard to find!” </p>\n<p>“I know! I <em> like </em>those!” </p>\n<p>“They fit me better,” Izuku argues. Katsuki reaches over and yanks at the waistband, and they fall to his knees. Izuku squeaks and tugs them back up, and Katsuki laughs. </p>\n<p>“Yeah, that’s bullshit.” </p>\n<p>“I can’t believe you just pantsed me.” </p>\n<p>“I’ve done a lot worse,” Katsuki says, and that shuts him up. </p>\n<p>Nothing about this is even remotely sexual. Izuku sits cross legged on the couch and shovels food in his mouth with those crappy splinter-inducing chopsticks, and he’s using a pink hair clip to tie back his bangs, and the pushed-up sleeves of his shirt show off the gnarliest scars on his body, and Katsuki feels <em> hot. </em>Like, turned on, hot. </p>\n<p>It’s disgusting, and Katsuki blames the high. </p>\n<p>Izuku’s apartment smells like food and weed and <em> Izuku; </em>and it’s homey and warm. The lighter got kicked somewhere, so Katsuki uses his fingers to light the end, and Izuku slaps his thigh hard enough to sting. </p>\n<p>“If you blow that up I’m going to be <em> very </em>upset with you, Kacchan.” </p>\n<p>“I’ll buy you a new one.” </p>\n<p>“Just like the lock on my door?” </p>\n<p>“Yeah,” Katsuki grins. “Exactly like that.” </p>\n<p>Izuku shakes his head and laughs, and <em> why, why — why doesn’t he remember —  </em></p>\n<p>Katsuki’s chest squeezes. </p>\n<p> </p>\n<p>\n<em> Why do I want him to?  </em>\n</p>\n<p> </p>\n<p>Izuku is looking at him, instead of the movie. He’s dazed, a bit out of it, but not enough that he couldn’t respond to an emergency call if he needed to. His eyes are fuzzy, but they always hold this finer intelligence in them. This intellect that pisses Katsuki off — (<em> don’t look down on me, nerd! Nerd! You nerd — ) </em> and maybe that’s why it’s so frustrating. Katsuki always, <em> always </em>knows what Izuku is thinking. </p>\n<p> </p>\n<p>But he can’t right now. </p>\n<p> </p>\n<p>Crooked fingers caress his cheek, and Katsuki’s soul leaves his body so rapidly, he can’t even react. </p>\n<p>Izuku’s thumb wipes the corner of his mouth, and for a moment, Katsuki can taste his own heartbeat. Izuku’s eyes are so impossibly <em> green; </em> Katsuki is reminded of the hands tied like a bow, the eyes that cried and sobbed and the mouth that <em> begged so sweetly…  </em></p>\n<p>“Sorry,” Izuku mumbles. He pulls back and shows off his finger, “You had rice on your face.” </p>\n<p>Katsuki grinds his teeth and slaps Izuku’s hand away. </p>\n<p>“Don’t baby me.” </p>\n<p>“Why?” Izuku giggles, flopping backwards. “It’s fun, sometimes.” </p>\n<p> </p>\n<p>Katsuki wants to bite his mouth until it bleeds. Kiss it until it feels better. </p>\n<p> </p>\n<p>\n<em> I’m an idiot.  </em>\n</p>\n<p>\n<br>\n<br>\n</p>\n<p align=\"center\">~</p>\n<p>\n<br>\n<br>\n</p>\n<p>Katsuki had hopes for a better week. Honestly, in their line of business, he should’ve known better. </p>\n<p>Izuku is able to reverse-solve a murder mystery just off of the smell of patrolium and a pair of footprints, and typically Katsuki <em> loves </em>to one up the police, but the success is short lived. </p>\n<p>Their teamwork is clunky this week. Butting heads is typical, but fucking up <em> this </em>bad? It doesn’t happen.</p>\n<p>Long story short, Izuku misses Katsuki’s hand in one of their combo moves, and Izuku ends up with four broken ribs and a dislocated shoulder, and to make it all worse, the villain gets away. </p>\n<p>Eri is on duty as an intern that day, so Izuku can thank his lucky fucking stars that he doesn’t have to sit through two months of healing ribs. </p>\n<p>Only once they’d reached the safety of the agency locker room did Katsuki grab Izuku by the shirt and slam him up against the wall. </p>\n<p>“What the <em> hell,</em>” Katsuki sneers, “is your problem?” </p>\n<p>Izuku is grimy and tired and bruised, but he still has a fire in his eyes. </p>\n<p>“Give me a break, it was just an accident!” </p>\n<p>“You don’t <em> make </em>mistakes, Deku,” Katsuki hisses, getting close enough to almost be nose to nose. “You might’ve been a fuckup in UA, but you’re a pro now. Get your shit together and act like it, ‘cause I’m not tolerating another week of this bullshit.”</p>\n<p>“Get off me,” Izuku shoves him, and Katsuki stumbles back. “I don’t need this right now.” </p>\n<p>Izuku is aware that he screwed up. But Katsuki’s anger simmers, and he clenches his fists to keep his quirk from popping. </p>\n<p>“Fuck you. If you miss my hand again, I’ll never forgive you.” </p>\n<p>The angry look on Izuku’s face gradually shifts into understanding, and then guilt. Izuku rubs at his sore shoulder. </p>\n<p>“I really am sorry.” </p>\n<p>Katsuki spits old blood into the drain, and turns his back towards Izuku, facing his locker. </p>\n<p>“Whatever. Thought I fuckin’ killed you — gave me a goddamn heart attack, I swear to god I’ll make you wish I did.” </p>\n<p>Izuku sighs out of his nose, and doesn't reply. When he starts undressing again, Katsuki gets a view of his bare, unmarked ass, fully healed as a side effect of Eri’s quirk, and it’s disappointing. Like someone painted white over his canvas. </p>\n<p>Katsuki’s brain chooses to remind him of how Izuku looked in his arms, cuddly and content and oozing happiness out of every pore, and Katsuki slams his locker shut. </p>\n<p>“You comin’ over this weekend?” </p>\n<p>Izuku doesn’t respond at first — but he looks at Katsuki out of the corner of his eye and says, </p>\n<p>“I’ll be there.” </p>\n<p> </p>\n<p align=\"center\">~</p>\n<p> </p>\n<p>\n<em> “--thank you for that uplifting message. To donate please call XXX-XXXX and dial two. Next, in our top story, the Wonder Duo falls from fame? Channel Three has brought on two hero experts to discuss collateral on --” </em>\n</p>\n<p>Katsuki doesn’t even have to ask this time. Suds turns the TV off entirely, and Eijirou gives him a grateful half-smile. Katsuki grinds his teeth and throws back his drink. </p>\n<p>“Hey man, go easy on Midoriya. It happens, I got absolutely roasted by the paps last week.”</p>\n<p>“Ain’t all his fault,” Katsuki admits with frustration. “I have to get stronger. Better.” </p>\n<p>“Don’t push yourself too hard. Hey, maybe I can switch my gym days around and we can go together?” </p>\n<p>Katsuki shrugs, and Eijirou knows it’s the best answer he’s going to get, so he grins and slaps Katsuki on the back. Katsuki traces the edge of his glass with his thumb, and frowns. </p>\n<p>Denki and Sero tagged along today, but they’re off playing pool in the corner; Katsuki drops his voice so they won’t hear. </p>\n<p>“It’s Deku.” </p>\n<p>Eijirou tips his head. </p>\n<p>“Huh?” </p>\n<p>“The friend.” </p>\n<p>Eijirou has, in hindsight, a pretty hilarious face journey. Confusion, realization, shock, and then acceptance. </p>\n<p>“Wait. The one you’re…” Eijirou lowers his voice. “You’re hooking up with Midoriya?!” </p>\n<p>“Yup.” </p>\n<p>“Oh my lord.” Eijirou wipes across his mouth and stares. “I’m surprised and… also not surprised. Uh, how’s that going for you?” </p>\n<p>“I <em> thought </em>it was fine,” Katsuki huffs. “But I have a feeling that these fuckups might’ve been my fault.” </p>\n<p>“Hm. I know Midoriya is nice and all, but he’s a tough guy. I’m sure it’s not all you.” Eijirou bumps their knees together. “Um, do you like him?” </p>\n<p>“I am going to spare your life and pretend you didn’t just ask me that.” </p>\n<p>“Aww, you really are a bro.” </p>\n<p>“Hey dudes!” Denki waves from across the bar. “Come play! We’ll do doubles.” </p>\n<p>“I’m game. Katsu?” </p>\n<p>“No.” </p>\n<p>“I guess we win by default then,” Sero grins, and Katsuki is already off the barstool, grabbing a pool cue and forcing Sero to duck as he moves to smack him with it. </p>\n<p>“Don’t break my shit!” Suds calls, and Eijirou bows and apologies for him. </p>\n<p> </p>\n<p align=\"center\">~</p>\n<p> </p>\n<p>The rigorous gym routine helps, but not enough. </p>\n<p>Katsuki stands in the shower with his head dunked under the water, watching it spin in mindless circles around the drain, his wet hair hanging in his peripheral. He can hear Izuku’s voice in his head, crystal clear, rasped and soft and a little deep in his maturity. </p>\n<p> </p>\n<p>\n<em> “I love you.” </em>\n</p>\n<p> </p>\n<p>It’s not real, you idiot. You fool. You moron.</p>\n<p>Katsuki’s heart is in his ears, and he punches the shower wall to make it stop. The pain in his knuckles is a good enough distraction. At least his blood is pulsing in his hand, instead of his chest. </p>\n<p> </p>\n<p>It’s fine, it’s fine. They’ll fuck this weekend, he’ll tie Izuku up all nice, and everything will go back to normal. </p>\n<p> </p>\n<p>It’s fine. </p>\n<p> </p>\n<p align=\"center\">~</p>\n<p> </p>\n<p>Izuku is practiced in the art of minding his own dang business. </p>\n<p>He always keeps an ear open for trouble, but he tries to avoid starting fights if necessary (although his friends will disagree). If he passes a few weirdos on the train, then hey. You do you, man. </p>\n<p>Izuku is already feeling strange when he goes to Katsuki’s house. It always smells nice in here, a house full of <em> Kacchan, </em> but it doesn’t ebb his anxiety today. His heart has been in his stomach for the last two weeks, and he’s been a wreck because of it. </p>\n<p>Skipping a session did not help whatsoever. Now, Izuku is going for the opposite approach. </p>\n<p>Izuku hopes, maybe, that Katsuki can screw his head back on. He knows how to do it verbatim, like he’s is reading out of an Ikea instruction manual. It doesn’t feel real — like the past month has been a dream. </p>\n<p>Izuku needs this today. He needs to forget. </p>\n<p>Kacchan says he’s going to take a quick shower before they start, because he was out helping his parents fix their roof this morning. </p>\n<p>“I’m sad I missed that,” Izuku says. Katsuki flips him off and barks <em> just stay put, </em>then slams the door shut. </p>\n<p>Izuku still feels bad about their previous argument in the locker room. An angry Kacchan isn’t anything to write home about, but this was a different kind of anger. It was a furious worry. Izuku is slipping.</p>\n<p>He presses his face into his hands and groans. None of this is very hero-like. These feelings are all so terribly human. </p>\n<p>Five minutes into Katsuki’s shower, a knock raps on the front door. Izuku looks around twice. A delivery, maybe? But the knocking persists, and Izuku tiptoes down the hall. </p>\n<p>“Hey Kacchan? Someone’s at the door.” </p>\n<p>\n<em> “Then fucking answer it, dumbass.”  </em>\n</p>\n<p>Alright then. </p>\n<p>Izuku peeks through the peephole, and then throws the lock. A shorter, thin looking man, with fluffy white hair and big brown eyes is standing on Kacchan’s porch. He looks young, maybe twenty. </p>\n<p>“Oh,” the man blinks, like he wasn’t expecting Izuku. “Hello.” </p>\n<p>Izuku raises his eyebrows. “Hi?” </p>\n<p>“Uhhh, my name’s Kito. Is Katsuki home?” </p>\n<p>Izuku is surprised by the casual use of Kacchan’s name. Izuku has never seen this man in his life. </p>\n<p>“...Yes, he is. Can I help you?” </p>\n<p>Kito takes one long look at him, and it makes Izuku feel scrutinized. </p>\n<p>“Err...no. Wrong house, sorry.” </p>\n<p>“Hey,” Izuku frowns. “I can go grab him if it’s important. He’s just in the shower.” </p>\n<p>“You’re his new sub, aren’t you?” </p>\n<p>Izuku nearly chokes. He folds his arms in front of his chest protectively and squeaks, “Excuse me?!” </p>\n<p>\n<em> How the heck... </em>\n</p>\n<p>“Sorry, sorry,” Kito waves. “I’m an empath. I was Katsuki’s old sub.” Izuku tenses, his defenses flying up like walls, and Kito has the nerve to laugh at him. “Hey, my bad. I didn’t know he picked up someone new. I just came by to see if he would work me over for old times sake.” </p>\n<p>Izuku’s heart sinks.</p>\n<p>\n<em> Kacchan had sex with this man.  </em>\n</p>\n<p>“Oh.” Izuku tries to play nice and ignore how desperately he wants to slam the door. “Well...he’s taken, sorry.” </p>\n<p>\n<em> A lie.  </em>\n</p>\n<p>Izuku is very aware that their contract has nothing about exclusivity. Izuku isn’t even sure why he said it. He just wants this man to <em> leave.  </em></p>\n<p>“I get it.” Kito presses his lips together, and a darker, more serious look falls on his face. “Hey, watch yourself with that one. He’ll drop you the second he gets bored.” </p>\n<p>Izuku puffs up defensively. </p>\n<p>“Kacchan isn’t like that.” </p>\n<p>Kito’s eyebrows raise at the nickname, and Izuku must look pathetic in his eyes — but this man knows nothing, absolutely <em> nothing. </em> No one will ever know Katsuki like Izuku does. <em> No one.  </em></p>\n<p>“Alright. I’m just saying. We had a thing for three months, and the second I asked about going serious, he dumped me the next day.” </p>\n<p> </p>\n<p>The world falls out from beneath his feet. Izuku feels numb in the doorway, a terrible dread swallowing him whole. His voice cracks. </p>\n<p> </p>\n<p>“Oh. Um. Thank you for telling me.” </p>\n<p>Kito gives him a look of pity, and waves his goodbye.  “Sure. Don’t bother telling him I stopped by. Have a good one.” </p>\n<p>Izuku waves back. He’s sluggish to close the door. By now the shower has turned off, and Katsuki yells from the bathroom. </p>\n<p>\n<em> “Oi!! Who was it?”  </em>\n</p>\n<p> </p>\n<p>Izuku smooths his hand over his mouth, completely horrified. </p>\n<p> </p>\n<p>“Um. Jehovah’s witness.” </p>\n<p> </p>\n<p>Katsuki laughs; it’s the first laugh Izuku has heard from him this week. Izuku’s fault, of course. </p>\n<p>\n<em> “Should I fly a pride flag out there? I’ll add a pentagram for good luck.”  </em>\n</p>\n<p> </p>\n<p>Izuku presses the heels of his hands into his eyes and internally <em> screams, </em>before he clears his throat and calls out sweetly. </p>\n<p>“Yeah, that would do it!” </p>\n<p> </p>\n<p align=\"center\">~</p>\n<p> </p>\n<p>Katsuki hasn’t seen Izuku be this stiff since their first session. </p>\n<p> </p>\n<p>He’s petting up and down Izuku’s throat, pressing into his chin and digging into his jaw, but Izuku isn’t responding the way he has come to expect.</p>\n<p>“Kneel for me?” </p>\n<p>Izuku doesn’t move, as if he didn’t hear the command.  </p>\n<p>Katsuki grips his face tight, and the leather digs into his skin. </p>\n<p>“Hey. I told you to get on your knees. That was an order. ” </p>\n<p>Izuku looks up at him, and his eyes narrow. </p>\n<p>\n<em> “No.”  </em>\n</p>\n<p>\n<br>\n<br>\n<br>\n</p>\n<p>Katsuki blinks <em> slow.  </em></p>\n<p>\n<br>\n<br>\n<br>\n</p>\n<p>Well, this is new. Izuku looks serious, so Katsuki rolls with it. </p>\n<p>“Oh, is that right?” Katsuki jerks his head roughly, left then right, and then forces Izuku to look him in the eye. “You want to piss me off this week, is that it?” </p>\n<p>Izuku breathes out forcefully through his nose. </p>\n<p>“No sir.” </p>\n<p>Katsuki shoves him back to the bed. </p>\n<p>“I don’t like your attitude. Arms behind your back.” </p>\n<p>Izuku doesn’t listen. Katsuki thinks about Izuku missing his hand, his fingers slipping out of his grip and his shoulder crashing into the concrete, and it pisses him off because the memory hurts. </p>\n<p>Katsuki grabs him roughly, yanks his arms backwards and squeezes so it stings. </p>\n<p>“You will <em> listen to me, </em>or you will forfeit your reward.” </p>\n<p>Izuku grunts and squirms, and Katsuki digs out his handcuffs; the metal ones that hurt. He locks Izuku’s wrists in place. </p>\n<p><em> “Bad boys </em>have to sit and think about what they’ve done.” </p>\n<p>“I’m not bad!” Izuku argues. </p>\n<p>Katsuki flips him on his stomach. He hasn’t gotten Izuku out of his boxer-briefs yet, and Katsuki cracks his hand against his clothed ass. Izuku gasps. </p>\n<p>“Yes you are. Look at you — already pushing back against me like a <em> slut. </em> ” Katsuki digs his hands <em> hard </em>into Izuku’s thighs, because he’s out to bruise. “Good boys don’t talk back.” </p>\n<p>“No!” Izuku squirms, and Katsuki finally gets a proper reaction. His voice catches. “I’m <em> not a slut.”  </em></p>\n<p>“You don’t get to decide that, now do you? I bet you begged so sweetly for your old masters to fuck you. Just can’t get enough <em>cock, </em>can you<em>?</em>” </p>\n<p>“No—!” Izuku squirms, voice straining. </p>\n<p>“I don’t fuck whores,” Katsuki says, squeezing harder, <em> harder, harder. </em> The leather heats from his quirk. “And I don’t fuck <em> brats </em>who can’t keep their mouths shut.” </p>\n<p>Izuku shoulders shake, and Katsuki can hear his voice crack. </p>\n<p>“I’m not! Master <em> please. </em>” </p>\n<p>“You started this. I’m only following your lead—yeah, keep squirming, you look like a bitch in heat. Nothing but a hole, aren’t you?”  </p>\n<p>“No! <em> No!”  </em></p>\n<p>“Maybe I’ll leave,” Katsuki mulls. Izuku is still fidgeting, so Katsuki spanks across his upper thighs. “If you won’t respect your <em> master, </em>then I won’t stick around.” </p>\n<p>\n<em> Slap!  </em>\n</p>\n<p> </p>\n<p>Izuku sobs. His head rolls out on the pillows and his knees curl under him and he <em> bawls.  </em></p>\n<p> </p>\n<p>\n<em> “Red!!”  </em>\n</p>\n<p> </p>\n<p>Katsuki’s entire world stops spinning. He stares in horror as Izuku folds in on himself, crying his eyes out in painful sobs, and Katsuki’s heart fucking <em> breaks.  </em></p>\n<p>He jerks to undo the cuffs. He can’t move fast enough, and he’s mortified as he gets Izuku on his back. Izuku just curls into his hands and cries. </p>\n<p>“Oh my god,” Katsuki checks him over. “Shit, are you okay?” </p>\n<p>“I can’t do this,” Izuku weeps. “Kacchan I’m sorry, I can’t, <em> I can’t.”  </em></p>\n<p>“I thought — you were acting like you wanted—” Katsuki drowns in wave after wave of self hatred. “I’m sorry. I thought that’s what you were asking for. <em> Fuck </em>I should’ve never…” </p>\n<p>“We have to stop this,” Izuku says, wiping his eyes furiously. His cheeks are damp and sticky, but these tears make Katsuki feel like throwing himself in a ditch. “It’s my fault, I know it’s my fault. You were just so <em> good </em>to me and, and it was everything I wanted, and. I’m sorry.” </p>\n<p>Katsuki is confused. He slowly pulls off his gloves one by one, and tosses them over the bed. </p>\n<p>He thinks about how strange Izuku has been acting. He thinks about when it started. And it’s not so much of a lightbulb, rather than a slow dawn of a dimmer. </p>\n<p>“Deku. What’s going on with you?” </p>\n<p>“With me?!” Izuku barks, and Katsuki reels back. He hiccups, and pulls the sheet up to wipe his eyes. “I told you <em> I loved you, </em>asshole. And then you acted like it never happened.” </p>\n<p>Katsuki gapes. It’s a revelation that makes his head spin. He can taste his heartbeat, for fucks sake. </p>\n<p>Katsuki’s voice comes out rasped as he argues, “Wh— you were dropped! The endorphins were fucking with your head. What you were feeling wasn’t <em> real.”  </em></p>\n<p>“How dare you,” Izuku snarls. “You don’t have to return my feelings, but how <em> dare </em>you invalidate them like that.” </p>\n<p>Katsuki snatches his wrist and holds on tight. </p>\n<p>“<em>Izuku. </em>The person you love isn’t me. It’s an imaginary persona.” </p>\n<p>“Can’t I love both?” Izuku asks, and Katsuki is stunned silent. Izuku swallows, and pulls his knees to his chest, yanking his wrist free. “It’s still you in those scenes, Kacchan. Just like — how I’m still <em> me.</em>” Izuku hides his face. “Fuck, I should’ve never agreed to this.” </p>\n<p>That hurts the most. Katsuki sits back and stares at the wall. His stomach feels like a black pit. </p>\n<p>The ceiling fan goes <em> click, click, click.  </em></p>\n<p>“S’ that right?”</p>\n<p>Izuku’s voice is muffled in his knees. He’s just a fluffy head of dark hair, the neons picking up green highlights. The air feels cold. </p>\n<p>“The truth is...I loved you before we started all this. I’ve loved you for a long time. When you offered a contract with me, I was just being selfish — I should’ve said no, I’m sorry.” </p>\n<p>Katsuki scratches through his hair and sighs. Izuku looks like he wants to disappear, and Katsuki <em> loathes </em>it. He wants the man that doesn’t hesitate to throw himself on the front line, the one who rescues people with a smile, the man that can carry a building on his shoulders. Only Katsuki can make Izuku small like this, and he hates it right now. </p>\n<p> </p>\n<p>They’re always changing, aren’t they? Can’t just stay the same, for five damn minutes. </p>\n<p> </p>\n<p>“You know…” Katuski starts. “I’d burn down the whole fuckin’ world, if you asked.” Izuku peeks up at him. Katsuki is the one to look away. “I never let myself think about how I felt. I didn’t wanna’ waste my time entertaining something that was damn near impossible to begin with.” </p>\n<p>“That doesn’t sound like the Kacchan I know.”</p>\n<p>Katsuki shrugs. “You bring out the worst in me.” </p>\n<p>Izuku laughs humorlessly. “Thanks.” </p>\n<p>“And the best,” Katsuki adds. “It’s a tradeoff.” </p>\n<p>Izuku stares at his feet. The air conditioning rattles, and the LEDS shift hues at a gradual pace, casting different shadows across the room. Katsuki doesn’t move, and neither does Izuku. </p>\n<p>“What now?” Izuku whispers. </p>\n<p>Katsuki picks at his thumbnail. </p>\n<p>“Can I kiss you?” </p>\n<p>“That isn’t funny.” </p>\n<p>“I’m being serious, dumbass.” </p>\n<p>Izuku rubs his nose, and pets his hand over the sheets. </p>\n<p>“But you don’t love me.” </p>\n<p>“You know I do.” </p>\n<p>Izuku’s head whips up. The surprised look on his face hurts his heart. Katsuki shakes his head, and extends a hand. </p>\n<p>“Come here.” </p>\n<p>Izuku doesn’t move at first. He wipes his face with his forearm, and after a moment of hesitation, he scooches closer on the bed. Katsuki doesn’t reach out to touch him. He just crosses his legs, Izuku doing the same, and the LEDS shift to a pinkish color that catches on all the features of Izuku’s face. Their knees bump. Izuku looks at him, and Katsuki shrugs a shoulder. </p>\n<p>“Your call.” </p>\n<p>Walk out the door, or give them a chance. </p>\n<p>“You would want that with me?” Izuku asks. </p>\n<p>Katsuki rolls his eyes. </p>\n<p>“I already have everything else.” </p>\n<p>Izuku’s ears go pink, but he presses his lips together, and eventually the corners creep into a smile. </p>\n<p>“I guess we do, don’t we?” </p>\n<p>Katsuki doesn’t move. He watches Izuku’s eyelashes cast shadows over the freckles on his cheeks; and when he waits long enough, he sees them flutter closed. Izuku leans bravely between them for a kiss. Katsuki meets him partway.  </p>\n<p>The kiss is ironically, almost hilariously innocent, in comparison to everything else they’ve done together — but this isn’t <em>a</em> <em>master and his plaything, </em> it’s just them, right now. He’s kissing a snot nosed nerd, borderline child-genius, Japan’s strongest <em> Deku.  </em></p>\n<p>Izuku cradles the back of his head and Katsuki melts entirely. That’s the last straw; he’s done for. Katsuki deepens the kiss with a turn of his head and Izuku makes a pleased humming noise, and it buzzes in Katsuki’s ears. </p>\n<p>Izuku’s lips are soft, but cracked from insistent biting, and Katsuki tries biting it for him — and Izuku parts his lips without being asked. Katsuki cups his jaw and there’s no leather barrier, nothing stopping him from feeling over old acne scars and high cheekbones. The tales about fireworks and butterflies are such horseshit, because nobody told him it was real. </p>\n<p>They’re still leaning over their crossed laps. Eventually Izuku leans away, just enough so Katsuki can straighten his spine. The sticky sound is erotic. </p>\n<p>“Can I just have <em> you</em>?” Izuku asks gently. He chews his cheek and blinks as his face reddens. “I mean, can it just be us right now?” </p>\n<p>Katsuki wants that so badly, he doesn’t even have the words to describe how much. </p>\n<p>“Yeah. God yeah.” </p>\n<p>Izuku smiles against his mouth and tugs at his shirt, and Katsuki leans back long enough for Izuku to pop it off. </p>\n<p>“I love what you do to me, but — lately all I ever think about is touching you.” </p>\n<p>Katsuki does <em> not </em>blush. He doesn’t. Get your eyes checked.</p>\n<p>He growls back. “Whatever you want, you can have it.” </p>\n<p>Izuku takes him up on that offer. They readjust so Katsuki is leaning back against the headboard, and Izuku crawls to straddle his lap, and Katsuki’s pulse is pounding in his ears, but the adrenaline makes him feel high. </p>\n<p>Izuku kisses him again. Katsuki holds him steady by the waist, and when their tongues meet his heart does backflips like a fucking teenager. Izuku’s sudden moan vibrates into his teeth, and by <em> god </em>does it turn Katsuki on. </p>\n<p>Having Izuku touch him is a religious experience. Katsuki is the one usually doing the work, so he has a hard time focusing as Izuku feels up his chest, mapping out reverent circles with his knobby fingertips. He squeezes his pecs, his shoulders, his arms. </p>\n<p>“I sweat a lot,” Katsuki admits, stomach clenching when Izuku pets down his abdominal muscles. “Fair warning.” No biggie, it’s not like his sweat is an explosive material, or anything. </p>\n<p>“I know that,” Izuku giggles, and the kiss to his temple is so sweet it rots his teeth. “Is it weird to say I like it?” </p>\n<p>“Come here, you,” Katsuki growls, and he gets a firm grip on the back of Izuku’s unruly hair. </p>\n<p>Now that they’ve crossed that line, it’s like they can’t stop kissing. Katsuki gets his left hand down the back of Izuku’s underwear, but their lips don’t stop, and it’s a whole other sensation he has to process. The sound of Izuku pulling the zip on his jeans is oddly arousing, and Katsuki is on <em> fire — </em>he must be, because he’s burning alive. </p>\n<p>“You’re so,” Izuku kisses, “so, <em> so </em>attractive, Kacchan. I love that you’re so much bigger than me. I love how strong you are. I love everything about you.” </p>\n<p>That’s the most <em> Izuku </em>compliment that Katsuki has ever received, and it makes him snort. Izuku’s eyes roll back when Katsuki kneads his fingers into the meat of his ass, and Katsuki feels drunk when he licks into the side of Izuku’s neck and bites down. His skin tastes good; salty and human. </p>\n<p>“You don’t need me to tell you what I think of you, nerd.”</p>\n<p>All the praise, the compliments, the sweet nothings; of course they were true. </p>\n<p>Izuku has the nerve to blink those big bambi eyes at him, while having the body of an Adonis god.</p>\n<p>“You meant all that?”</p>\n<p>“I swear to — fuck off, just kiss me, asshole.” </p>\n<p>They don’t have the patience for tricks tonight. Izuku pulls them out of their underwear and jacks them off in one hand, and Katsuki gets to spend his brainpower working a very complicated network of bruises into Izuku’s shoulder.</p>\n<p>Izuku leans over long enough to grab lube, and when Katsuki asks about a condom, Izuku shakes his head. </p>\n<p>“No, it’s — it’s fine, just let me ride you, <em> please.</em>” </p>\n<p>Katsuki’s head thunks against the headboard when Izuku sinks down onto him. Katsuki has zero control over the groan he makes; it’s guttural and loud. Izuku is tight from the sloppy prep, but he doesn’t even flinch — just rocks back and forth and begs for Katsuki’s mouth on him, so he dives to kiss him again. </p>\n<p><em> “Ngh! </em>Fuck me,” Katsuki grits. “You’re tight as all fuck, Deku.” </p>\n<p>Izuku laughs shallowly, and flicks his hair out of his eyes as he rides. </p>\n<p>“<em>Ahh. </em>I-I never thought I’d hear that name in bed.” Izuku bounces, purring, “Mmm, damn your dick is fat, I can feel it in my stomach.”</p>\n<p>Katsuki growls into his ear, biting the cartilage and pulling, and Izuku grips his biceps and moans. </p>\n<p>“Who taught you to talk nasty like that?”</p>\n<p>“Hah… I wonder?”</p>\n<p>It’s sloppy and slow, Izuku sitting up just enough for his cock to catch on his rim, then sliding back down to his thighs, and Katsuki’s eyes are going to roll out of his fucking <em> skull, </em>it’s so excruciatingly good. The slapping sounds are loud, sudden, erotic, spaced out slow and deep, and Katsuki can feel their skin sticking together from the sweat. </p>\n<p>Izuku is taking what he wants, Katsuki realizes. He’s being used, he’s actually <em> wanted — </em>and it’s overwhelming. Katsuki can’t kiss him enough. </p>\n<p>Izuku’s noises are soft and so overwhelmingly genuine that Katsuki realizes that he’s not going to last.  He covers Izuku’s hand with his own, and pumps him fast enough to get Izuku to cry out and finish not a second before him, crying <em> ah, ah, Kacchan — </em>and Katsuki will never be able to hear that nickname again. He doesn’t have enough walls up right now to tamper down the low sound he makes as he orgasms, and it hits so hard his heels dig out into the mattress. </p>\n<p>All the skin-on-skin is simultaneously overwhelming, and anti-climatic. Like a stupid realization of <em> oh, they could’ve been doing this the whole time, huh?  </em></p>\n<p>Izuku smiles into his lips again and Katsuki doesn’t comment on how wet both their lashes are. </p>\n<p>“I like your voice. You should let go more often.” </p>\n<p>Katsuki pinches his nose and squeezes hard. </p>\n<p>“You better shut up before I kill you.” </p>\n<p>Izuku laughs nasally, and it sounds relieved. Very relieved. </p>\n<p> </p>\n<p align=\"center\">~</p>\n<p> </p>\n<p>Katsuki wipes them down with a discarded shirt. They both get up long enough to take a piss and wash up; then they throw on boxers, before crawling right back in bed.</p>\n<p>Izuku lays against his side while Katsuki scrolls through the TV guide. They end up on some shitty baking channel, but Katsuki is only half focused, his brain fuzzy and distracted by the circles Izuku is tracing lazily against his sternum. </p>\n<p>“Kacchan?” </p>\n<p>“Hm.” </p>\n<p>“Does this mean we’re dating?” </p>\n<p>Katsuki turns his head to raise an eyebrow at him. Someone on TV burns their souffle. It cuts to a commercial with stupid Half n’ Half talking about soup kitchens for brats, so Katsuki mutes it.</p>\n<p>“Is that what you want?” </p>\n<p>“Well — do you?” </p>\n<p>Katsuki looks back to the television. Izuku’s fingers stall, so Katsuki covers them with his own to keep his hand there. </p>\n<p>“Thought I was aro for a long time,” Katsuki admits. “But I — dammit. Everything’s always different when it comes to you anyways.” </p>\n<p>Izuku threads their fingers together. Katsuki can feel scar tissue and crooked fingers, long broken and healed (a bit like them, Katsuki would say, if he was the poetic type). </p>\n<p>“Do you want to try?” </p>\n<p>There are a million ways this could blow up in his face, but Katsuki is anything but a coward. He’ll face that shit head on, when they get there. </p>\n<p>“Yeah. Go out with me.” </p>\n<p>Izuku grins and hooks a thick thigh over his own, crossing his ankle around Katsuki’s calf because he can’t quite reach his toes. Their legs are fuzzy and covered in scars, and this all feels alarmingly intimate.</p>\n<p>“Thank you, Kacchan.” </p>\n<p>“Whatever you want, baby,” Katsuki blurts, and then pauses with embarrassment. Izuku snickers, and flops his head onto Katsuki’s shoulder. </p>\n<p>“See, I told you. It’s all the same person in there.” </p>\n<p>Katsuki rolls his eyes. </p>\n<p>“Shut up, if I want to be psychoanalyzed I’ll go back to therapy.” </p>\n<p>Izuku hums. The feeling of Izuku’s thumb petting over his own gives Katsuki goosebumps, which is stupid in retrospect, but Katsuki is weak right now. </p>\n<p>“Kito-san stopped by, earlier.” </p>\n<p>Record scratch. Katsuki starts to hack and cough. </p>\n<p>“<em>Fucking what?!”  </em></p>\n<p>“I told him we were dating to scare him off,” Izuku admits. “I guess it’s not a lie anymore.” </p>\n<p>“Kito came <em> here? </em>What the hell did he want?” </p>\n<p>“He was trying to get you back,” Izuku frowns, and the possessiveness in his voice is suddenly very hot. “He was nice but I don’t like him by principle.” </p>\n<p>“I wasn’t into him like that,” Katsuki says. “It was just sex.” </p>\n<p>“Hm. Maybe I should have you give him Fang-san’s number.” Izuku rolls over onto his chest, and blocks his view of the TV as he peers down at Katsuki. “What did you do to him, by the way?” </p>\n<p>Katsuki grins. </p>\n<p>“Nothing permanent.” </p>\n<p>\n<br>\n<br>\n</p>\n<p align=\"center\">~</p>\n<p> </p>\n<p>\n<em> “--fight of the century! They’re calling you guys the Symbol of Victory and the Symbol of Peace. How do you feel about that?” </em>\n</p>\n<p>\n<em> “Oh? T-That’s really flattering, haha! We were just focused on minimizing casualties—”  </em>\n</p>\n<p>\n<em> “And making those [beep] [beeep] pay for what they did! Nobody [beep] around in our precinct!”  </em>\n</p>\n<p>\n<em> “Thank you for that, Ground Zero.”  </em>\n</p>\n<p> </p>\n<p>“Heh,” Katsuki grins, and sips his beer. “You can leave that one on.” </p>\n<p>Suds raises his bubbly eyebrows, but sets the remote down and resumes cleaning his shot glass. </p>\n<p>\n<br>\n<br>\n</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>\n<br>\n<br>\n</p>\n<p>Their manager is a good-looking woman.</p>\n<p>She’s tall, with dark hair and full lips, and her adorable quirk of subconsciously growing flowers out of her fingers betrays the fact that she has the ability to be a complete and utter <em> bitch. </em> Katsuki likes her, but only when she’s screaming at paps to <em> ‘take a fucking hike!’ </em></p>\n<p>“You know this is going to be a PR nightmare,” Triss says. </p>\n<p>Katsuki cackles, and Izuku raises his eyebrows, crossing one leg over the other. Izuku is sweet, but he carries that <em> tell me no and find out the consequences </em> kind of energy. He really would be a good brat, but he’s too much of a people pleaser.  </p>\n<p>“Like we aren’t already?” </p>\n<p>A heavy sigh follows, and their manager shakes the flower petals off her fingers to pick up her pen. </p>\n<p>“Give me a week, and a raise.” </p>\n<p>“You’re only getting one of those.” </p>\n<p>“Aww thank you. I can’t wait to get those new redbottoms.” </p>\n<p>\n<em> “Triss.”  </em>\n</p>\n<p> </p>\n<p align=\"center\">~</p>\n<p> </p>\n<p>Things are different between them, because no fucking duh. But they’re always changing these days, call it character development or getting older. Your choice. </p>\n<p>Neither of them are the fancy restaurant type, so for The First Date they end up eating noodles at Kono’s again. </p>\n<p>“I wore your hoodie this time,” Izuku beams. </p>\n<p>He shows off an orange and black <em> Ground Zero </em> hoodie. Izuku’s hair is all fluffed out from the post-shift shower, and his lip is split from a fight earlier that day (not like Katsuki can ignore the swollen elbow and the black eye he earned, but they’ve been busy as hell, so midnight noodles are the best they can do right now). </p>\n<p>Izuku is still smiling at him. The painful way that Katsuki’s chest tightens is a sure confirmation that he is very capable of romantic attraction. Er, not like he’ll say that out loud. </p>\n<p>“Good. You can throw the other ones away.” </p>\n<p>“I’m not going to do that.” </p>\n<p>“What if I demand it?” Katsuki asks, raising his eyebrows. Izuku narrows his eyes and stirs his straw in his glass in a way that could be described as menacing. </p>\n<p>“Then I’ll demand my foot up your butt.” </p>\n<p>That catches Katsuki so off guard that he laughs. Izuku immediately softens and giggles, leaning back so that he’s still hidden by the giant houseplant. </p>\n<p>“This doesn’t feel any different from how we usually hang out.” </p>\n<p>“Is it supposed to?” </p>\n<p>“I don’t know, I’ve never dated my best friend.” </p>\n<p>“Hm.” Katsuki hooks his ankle around the leg of Izuku’s chair and yanks, and Izuku yips as he’s hauled closer. Gripped by the chin, Katsuki turns his head and forces a quick kiss, before scooting backwards again. The waitress stops by to refill their drinks, and Izuku sizzles pink from across the table. “Feel like a date <em> now?”  </em></p>\n<p>Izuku presses his hands to his face and gurgles a sound.</p>\n<p>“You’re terrible.”</p>\n<p>Katsuki rolls his eyes.</p>\n<p>“And you are fucking ridiculous. I’ve had four fingers up your ass.” </p>\n<p>“Kacchan, I <em> swear. </em> I’ll never take you out in public again.” </p>\n<p>Katsuki snorts, and decides to spare him, picking at his teeth with a toothpick. He rolls it around his tongue for a moment, until Izuku is no longer a primary color. </p>\n<p>“What about our contract?” </p>\n<p>“Um, what about it?” </p>\n<p>“You still wanna’ sub?” </p>\n<p>Izuku scratches his cheek. He’s a little stubbly, like he forgot to shave this morning, and it’s endearing (also frustrating, because Katsuki can’t grow anything other than a fuzzy chin, so thanks for the shit genes, dad). </p>\n<p>Izuku lowers his voice, “Well, I don’t want to <em> stop. </em>But um, it doesn’t have to be every time, you know?” </p>\n<p>“Mm. I agree.” </p>\n<p>“I’m also…” Izuku hesitates. He rubs his nose. “I’m not against trying some new stuff.” </p>\n<p>Katsuki raises his eyebrows. </p>\n<p>“Really.” </p>\n<p>“Yeah. I trust you.” </p>\n<p>Katsuki thinks about how painful it was to hear Izuku call his safeword. He’s not <em> afraid </em>(he ain’t afraid of nothing, got it?!) but he’s definitely hesitant. </p>\n<p>“Even after last time?” </p>\n<p>“That was...different. I wasn’t in a good place.”</p>\n<p>That eases Katsuki’s worries (not that he had any). </p>\n<p>“You need to communicate that to me if it happens again, dumbass.” </p>\n<p>“I know, I know. I’m sorry.” </p>\n<p>Katsuki pets over his front teeth with his tongue, and after a moment, he hooks his ankle around Izuku’s under the table. Watching Izuku’s hands fiddle with his drink is getting Katsuki hot, for some reason. </p>\n<p>“You wanna dip after this?” </p>\n<p>Izuku smiles bashfully. </p>\n<p>“Yeah.” </p>\n<p> </p>\n<p align=\"center\">~</p>\n<p> </p>\n<p>Spread out and in the afterglow, Izuku crawls over him to look Katsuki right in the eye. </p>\n<p>“Actually, there’s something I’d really like to try.” </p>\n<p>Katsuki raises his eyebrows, but stays where he is. </p>\n<p>“And what is that?” </p>\n<p>“Um, flex your arm for me?” </p>\n<p>Katsuki blinks slowly, waiting to see if Izuku will go <em> ha ha, sike! </em>But Izuku is leering down at him with a very serious expression, so Katsuki sighs and flexes his right arm. </p>\n<p>Izuku swiftly leans down, and takes a big chomp out of his bicep. </p>\n<p>“Ow!” Katsuki startles. “What the hell was that?!” </p>\n<p>“You have the best arms,” Izuku whines. “They’re so big I just want to—” He takes a second bite into the muscle, and Katsuki struggles to throw him off. </p>\n<p>\"That <em> hurts, </em>you fucker!” </p>\n<p>“It’s like an apple!” </p>\n<p>“Get off me!” </p>\n<p>“No! I have to do the other one!” </p>\n<p> </p>\n<p>\n<em> Bzzzt bzzzt bzzzzt!  </em>\n</p>\n<p> </p>\n<p>Their pager goes off on the bedside table. Izuku pauses, and Katsuki glares back. </p>\n<p>“Asshole. Now I gotta’ show up with a damn hickey on my arm.”</p>\n<p>Izuku rolls his eyes and points to the bruising handprint around his neck.</p>\n<p>“And how do I explain this?”</p>\n<p>“It’s a fashion statement. They call it a collar.”</p>\n<p>“Oh heck off, just let me bite your other arm.”</p>\n<p>“<em> No—! Ow ow fuck! </em>Why you gotta’ be so damn strong?” </p>\n<p>“One more!” </p>\n<p>\n<em> Bzzzzt bzzzzt --  </em>\n</p>\n<p> </p>\n<p align=\"center\">~</p>\n<p> </p>\n<p>Katsuki thought they had long outgrown house parties. Some of the extras are married and shit, and hero work is a full time job, you know. </p>\n<p>Their old class still makes an effort to gather every once in a while, and Katsuki is usually dragged along kicking and screaming, but he’ll never admit that he doesn’t mind it. </p>\n<p>Izuku is currently refereeing a game of beer pong with his nerd friends, and he’s not allowed to play anymore, because they discovered in their third year that Izuku has the ability to drink anyone under the table. Icyhot is convinced that it’s another quirk of his, but Katsuki knows it’s his overdrive metabolism. Katsuki will not admit that it’s sexy. </p>\n<p>“I can’t do this,” Ochaco groans. “Izuku, can you just take mine for me?” </p>\n<p>“That’s cheating!” Aoyama points. </p>\n<p>“I’m going to <em> throw up </em>if I drink one more.” </p>\n<p>“Give it here,” Izuku laughs, and knocks back the beer for her. Katsuki feels his mouth water. </p>\n<p>Mina is currently kicking ass at a FPS, and all the shouting is a good distraction for Katsuki to beckon Izuku over. He looks like a little frat boy in his socks and slides, gym shorts and a hoodie, and Katsuki could just eat him. </p>\n<p>“Hiii,” Izuku sings. </p>\n<p>“Come sit.” </p>\n<p>“Why?” </p>\n<p>“Cause you’re the one that made me waste my Saturday night,” Katsuki says, tugging him sideways into his lap. Izuku laughs, and slings an arm over his shoulders. “I could be fucking you stupid right now.” </p>\n<p>“Shhh!” Izuku slaps a hand over his mouth. “Oh my gosh, Kacchan.” </p>\n<p>“We all heard that,” Shouto says, and Katsuki ignores him. </p>\n<p>“I’ll bite your hand off if you touch my face again.” </p>\n<p>Izuku pats his head in a <em> yes yes I know, down boy </em>motion, and Katsuki snaps his teeth at him. </p>\n<p>“You amaze me, Midoriya,” Eijirou laughs. “I have no idea how you tamed him.” </p>\n<p>“We have a system,” Izuku says, and Katsuki thinks about how good it’s going to feel to slap his ass until it glows red. </p>\n<p>“Badabing badaboom,” Mina sings, setting down her controller and cracking her fingers. “Who’s next?” </p>\n<p>Eijirou slides off the couch and onto the floor. “Uhh, I’ll try.” </p>\n<p>“Don’t do it dude,” Denki warns, rubbing his eyes. “She just rawdogged me.” </p>\n<p>“I got the strap,” Mina mimes. “I keep that shit on me,”  </p>\n<p>Katsuki and Denki roll their eyes simultaneously. </p>\n<p>“You’re a bottom.” </p>\n<p>“Hey! Nobody else needs to know that.” </p>\n<p>“Everyone knows that.”</p>\n<p> </p>\n<p align=\"center\">~</p>\n<p> </p>\n<p>Many lines have been drawn in the sand, but they continue to cross them with one foot over the other.</p>\n<p>Every new step is messy, like two cogs that don’t quite meet — but with some elbow grease and a little patience, they turn in time. Best Jeanist used to say <em> ‘everything needs some kind of balance’, </em>and it’s true, may the bastard rest in peace. </p>\n<p>Sometimes they’re master and pet, sometimes they’re lovers, sometimes they’re Kacchan and Deku, and sometimes they’re none of that, and that’s okay. If the wonder-duo can pride themselves on anything, it’s the ability to <em> adapt.  </em></p>\n<p>But still. Katsuki is a little ticked off, because he had a very serious plan to hang Izuku by the ceiling and overstim him until he passed out — and now that’s gone out the window, because he’s been thrown through a six-story building and broke both legs. </p>\n<p>“Dammit,” Katsuki spits, slamming his fist against the ground. “What a shit Friday.”  A foot steps on his sternum, Katsuki coughs, and the villain laughs. </p>\n<p>“<em>This </em>is the mighty Ground Zero? A lot of bark, for a dumb dog.” </p>\n<p>“You need to learn some bedside manners,” Katsuki grits. </p>\n<p>“Any last words?” </p>\n<p>“Yeah, enjoy your funeral, asshole.” </p>\n<p>And on cue, the villain is tackled right off of Katsuki’s chest, then kicked straight into the ground so deep it creates a human-sized crater. The rest of the gang-members stop to stare, pausing their raid on the city. </p>\n<p>“What the hell?!” </p>\n<p>“Boss!”</p>\n<p>Izuku is back at Katsuki’s side, crouched defensively and nearly foaming at the mouth. Katsuki can almost taste the green lightning hissing around the air. The killing intent makes all the hair on his arms stand on end. </p>\n<p>Izuku’s voice drops to a growl. </p>\n<p>“Do <em> not </em>touch him.” </p>\n<p>“So predictable,” Katsuki sighs. His in-ear buzzes to life with laughter. </p>\n<p>\n<em> “Ayo dude, you cool?”  </em>\n</p>\n<p>\n<em> “He’s fine, I’m just reading a few broken bones, no internal bleeding.”  </em>\n</p>\n<p>\n<em> “Bastard, you scared us!”  </em>\n</p>\n<p>Izuku turns, and the terrifying look on his face melts into soft concern. </p>\n<p>“Kacchan, are you okay?” </p>\n<p>Katsuki flops back on the pavement and rolls his eyes. </p>\n<p>“Fine, fine. Just finish up before the cameras get here.” </p>\n<p>\n<em> “Backup is on the way.”  </em>\n</p>\n<p>\n<em> “Pfft, like they’ll need it. Fuck ‘em up, Deku!”  </em>\n</p>\n<p>Izuku shoots off, and Katsuki grunts as he rocks himself into a sitting position. It hurts like all hell, but he isn’t about to give up the opportunity to watch an unhinged Deku kick ass without restraint. He’s hot when he’s mad. Oh yeah, he’s definitely got plans for next weekend. </p>\n<p>\n<em> “That’s so romantic. Hey Cellophane, how come you never go on a murderous rampage when I get hurt?”  </em>\n</p>\n<p>\n<em> “Sorry, I just don’t love you that much.”  </em>\n</p>\n<p>“You’re all dead,” Katsuki says, and he flips off the news helicopter that zips by. Ice creeps up the side of the building, so he flips Half-n’-Half off too, while he’s at it.  </p>\n<p> </p>\n<p align=\"center\">~</p>\n<p> </p>\n<p>Somehow, he missed the click of the windowsill. Katsuki chooses to blame it on whatever drugs they’re pumping him with. </p>\n<p>He stirs to the feeling of fingers in his hair. Katsuki tenses, then relaxes immediately. </p>\n<p>“Well,” Katsuki mumbles. “Isn’t this ironic. You here to break me out?” </p>\n<p>“Yeah,” Izuku whispers. “Even though we really shouldn’t…” </p>\n<p>“I’m good as new anyways,” Katsuki slaps his leg. It <em> hurts, </em> but it ain’t broken anymore. “Overnights are such BS. <em> ‘Monitor your health’ </em>my ass.” He hates the smells of hospitals, too. Floor cleaner shouldn’t make your damn eyes burn. </p>\n<p>“Tell me about it and — <em> don’t </em>hit your leg like that. Keep your voice down, I think the nurses are still doing wellness checks.” </p>\n<p>Izuku pulls a change of clothes out of his bag, and Katsuki wads up the hospital gown and stuffs it under the sheets. When he’s got his pants on, Izuku holds out an arm, and Katsuki narrows his eyes. </p>\n<p>“No way.” </p>\n<p>Izuku pouts. </p>\n<p>“Kacchan, come on. You can’t run off barefoot and I didn’t have time to —” a noise clatters outside, and Izuku ducks down, lowering his voice even further. “I didn’t have time to grab your shoes. Just get on!” </p>\n<p>Katsuki glares long enough to tell him how <em> not </em> happy he is about this — but he’d much rather sleep in his own room than this piece of shit cardboard they call a <em> hospital bed.  </em></p>\n<p>Izuku carries him like he’s nothing but a backpack. Katsuki grips around his neck, and Izuku slips them out the window, landing light on his feet and jumping back up to the rooftop to stay out of sight. </p>\n<p>Izuku <em> ‘flies’ </em>differently than Katsuki does; more of his balance resides in his legs, in comparison to Katsuki’s explosions emitting from his hands — and if you aren’t used to it, riding along can give you whiplash. Katsuki just laughs. </p>\n<p>“Triss is gonna’ be <em> so </em>pissed tomorrow.” </p>\n<p>Izuku grips him tighter by the thighs, and hops the gaps between rooftops. The wind rustles their hair, and blows through their clothes. </p>\n<p>“Oh yeah. You’re dealing with that one.” </p>\n<p>“Me?! You’re the one that broke me out.” </p>\n<p>“I’m the <em> favorite,</em>” Izuku says over the wind, and Katsuki pinches his ribs with his knees. </p>\n<p>“You are <em> so </em>in trouble. Ten strikes for you.” </p>\n<p>“How about a <em> thank you Izuku, for breaking me out of health prison.”  </em></p>\n<p>Katsuki bites the back of his ear, which might as well mean the same thing. Deku ain’t gotta’ know that, though. He swats back at Katsuki like a mosquito and laughs, and Katsuki bites his other ear, to match. </p>\n<p> </p>\n<p align=\"center\">~</p>\n<p> </p>\n<p>Katsuki spent all week waiting for his package to come in, and an additional three days for their schedule to clear up. </p>\n<p>They’ve had sex, but they haven’t had a serious session since Katsuki busted his legs (roughly two weeks ago, the healers fixed ‘em, it’s fine), and Katsuki wants to try a different approach this time. </p>\n<p>It’s torture sitting in the same office as Izuku for six hours, but he’s not going to be the one to break first. Katsuki knows that Izuku is shooting him frustrated looks, but Katsuki refuses to let this affect his work. </p>\n<p>When they’re changing out of uniform to go home, the locker room is full of heroes, so Katsuki can’t squeeze his ass like he wants to. Instead he bumps Izuku by the elbow, and sits at the bench to tie his shoes. </p>\n<p>“Tomorrow?” </p>\n<p>Izuku already knows. </p>\n<p>“Yes please.” </p>\n<p> </p>\n<p align=\"center\">~</p>\n<p> </p>\n<p>Izuku was given a house key weeks ago, so Katsuki is on him the very second he walks through the door. </p>\n<p>This relationship has made him fucking pathetic<em>, </em>and Katsuki can’t stand it, but also, a part of growing up has been learning that it’s okay to be weak sometimes, and fuck if Izuku isn’t one of the better things in his life right now. </p>\n<p>Katsuki wraps his arms around Izuku, bends down to jam his face in his throat, and Izuku makes a happy sound, dropping his bag to the floor. </p>\n<p>“Mmmm, I missed you too.” </p>\n<p>“I got you something, baby.” </p>\n<p>With just one pet name, Izuku’s back straightens. He rolls his head to the side, inviting Katsuki to nip and suck and kiss behind his ear. </p>\n<p>“For me?” </p>\n<p>“Mhm, you wanna’ try it on for me, sweetheart?” </p>\n<p>Izuku smiles and nods, and Katsuki leads him away by the hip. </p>\n<p>It fits tight in some places, but Katsuki thinks that just makes it better. </p>\n<p>“C’mon, give me a twirl.” </p>\n<p>Izuku turns for him. Leather straps hook around his waist, down his thighs, across his chest and up to the collar at his neck. Cuffs fit snug around his wrists and his ankles, with little dangly clips just waiting to be used. Katsuki likes the sheer black miniskirt in particular, it goes with the lingerie — and the way Izuku’s body fits it is both masculine and feminine. </p>\n<p>He has some old bruises from work, but that’s okay. Katsuki will paint him some new ones.</p>\n<p>“Damn, that was made for you.” </p>\n<p>“Thank you, master,” Izuku smiles. “I love it.” </p>\n<p>“Bend over for me? Hands on the floor.” </p>\n<p>Izuku does, and <em> fuck. </em>Fuck. It doesn’t look like much of a stretch for him, but it forces his thighs to squish around the straps, and Katsuki pinches the skin there. </p>\n<p>“That’s beautiful, babydoll. I want you to stay like that for me.” </p>\n<p>Izuku gasps, holds his breath and then nods, and Katsuki kneels down to clip Izuku’s wrists to his ankles. He makes a startled sound, and Katsuki hums at him. </p>\n<p>“What? You can hold that for me, can’t you?” </p>\n<p>The chain doesn’t give Izuku much room. He’s forced to keep his palms flat to the floor, right between his feet. </p>\n<p>“Yes sir.” </p>\n<p>“Perfect,” Katsuki says, and kneels behind him to yank aside the lingerie and eat him out for half an hour. It’s a good use of his time, and Katsuki waits until Izuku is shaking like a leaf and on the border of collapse before he stops. </p>\n<p>“Sir please — please <em> please </em> touch me, <em> please!”  </em></p>\n<p>“I don’t like brats,” Katsuki reminds nicely, and takes a fat bite into his ass. Izuku yips. “You don’t decide when I touch you.” </p>\n<p>“Ah! Yes sir!” </p>\n<p>He gives Izuku’s back a break by reclipping him to the bed, spread eagle and laid out like a meat platter, and Katsuki tugs on his straps and plays with his mouth and teases him until he’s putty, and it's therapeutic for both of them. </p>\n<p>Katsuki decided to ditch the gloves from the get go, and it’s different because Katsuki can kiss him now, slow and deep and tortuous, keeping him hard for hours on end, until Katsuki decides to strip off his own clothes and straddle his lap, rubbing Izuku’s swollen cock against his ass. The downright shocked look on Izuku’s face is amazing. Izuku had no idea that he’s stretched, and his bedposts go <em> creeeeak </em>as Izuku yanks suddenly. He lights up in teal lightning. </p>\n<p>“<em>No! </em> Master I can’t — I won’t last! <em> Ah! Ah! </em>” </p>\n<p>“That’s okay baby,” Katsuki sinks down, forcing back the strain in his voice. Ah, it’s been a while.  “You can cum in your master, I’m telling you it’s okay sweetheart.” </p>\n<p>Izuku <em> sobs, </em>and one of the buckles snap on his wrists, and Katsuki only gets a dozen bounces in before Izuku curls up and orgasms, his spine arching up off the bed. Katsuki quickly jacks himself off, gasping as Izuku’s hips jerk up sporadically, and Izuku breaks the rule and uses his freed hand to help finish Katsuki off. He shoots right up between Izuku’s tits, right across the leather straps and jagged pink scars. Hell yeah. </p>\n<p> </p>\n<p>Izuku is repeating <em> oh my gosh, oh my gosh </em>over and over, and Katsuki grins down at him. </p>\n<p>“Gotcha’.” </p>\n<p>Izuku flops his head back and squeezes his eyes shut. Katsuki runs his fingers through the cum on Izuku’s chest, and forces it into his mouth. Izuku complains at first, but Katsuki forces him to comply, and eventually Izuku relaxes, licking slowly between each finger until Katsuki’s hand is clean. Katsuki finally slips off him and winces at the twinge in his back. He sits on Izuku’s thighs, and rubs his sides soothingly. </p>\n<p>“Good job, baby.” </p>\n<p>“I’ve died.” </p>\n<p>“I’m glad.” </p>\n<p>When Katsuki has clicked all the straps off, Izuku hauls him down by the shoulders, cuddling Katsuki to his chest like a teddy bear. </p>\n<p>“Hey,” Katsuki snaps. </p>\n<p>“Mmmm, you taught me this,” Izuku mumbles. <em> “Aftercare is important </em>, you said.” </p>\n<p>Katsuki goes <em> hmm</em>, but allows Izuku to snuff and purr into his neck. </p>\n<p>“You okay?” </p>\n<p>Izuku’s voice is distant and floaty, but he’s conscious.</p>\n<p>“Yeah. That outfit is going to make for some really interesting bruises tomorrow.” </p>\n<p>“Too tight?” </p>\n<p>“Mmmm, yeah. Felt good. Thank you, daddy.” </p>\n<p>Katsuki’s stomach clenches so hard, his dick twitches. </p>\n<p>“Oh <em> god. </em> Deku don’t.” </p>\n<p>Izuku grins sleepily. </p>\n<p>“Really? That gets you?” </p>\n<p>“Shut up.” </p>\n<p>“I don’t mind, I’ll call master whatever he likes~” </p>\n<p>Katsuki muffles his mouth with his hand, and Izuku giggles insistently, licking his palm until Katsuki’s patience runs out, prying open his lips and spitting in his mouth. Izuku squeaks and thrashes, and it quickly turns into a round two.  </p>\n<p> </p>\n<p><em> Mine, </em>Katsuki’s lizard brain repeats. </p>\n<p align=\"right\">\n<br>\n<br>\n</p>\n<p align=\"center\"> ~</p>\n<p align=\"center\"> </p>\n<p align=\"left\">\n<em>\"-scandalous photos leaked of Heroes Ground Zero and Deku perched on a rooftop. The question remains; is this setting a bad example for youth?  Channel Three took to the streets to find out.\" </em>\n</p>\n<p align=\"left\">\n<em>\"Uhhh - well. Not really? I mean, they'd just kicked [beep] in Shibuya. I don't really care what -\" </em>\n</p>\n<p align=\"left\">\"Damn right we did,\" Katsuki grits, and Suds turns off the TV.</p>\n<p align=\"left\">\"Well,\" Eijirou grins, leaning over the bar, face flushed. \"Alls well that ends well, right?\" </p>\n<p align=\"left\">\"Fuck you, I had it under control.\" </p>\n<p align=\"left\">\"Uh huh. Just watch your back, you've got the whole country watching your every move right now.\" </p>\n<p align=\"left\">Katsuki huffs, \"Ain't that what I got you for?\" </p>\n<p align=\"left\">Eijirou pauses, and then his eyes go all big and sparkly. </p>\n<p align=\"left\">\"That's the sweetest thing you've ever said to me.\" </p>\n<p align=\"left\">\"I <em>hate </em>you, wipe that stupid look off your face or I'll do it for you - what's this?\" Katsuki looks up, as Suds passes him another shot. </p>\n<p align=\"left\">\"On the house,\" Suds says. \"For taking that hit in front of the bar. Don't think I didn't notice, I still watch the news behind your back, kid.\" </p>\n<p align=\"left\">Katsuki looks down at the shot, then raises his eyebrows.</p>\n<p align=\"left\">\"Don't think this means I like you.\" </p>\n<p align=\"left\">\"Uh huh.\" </p>\n<p align=\"left\">Katsuki drinks it, and Eijirou laughs all bubbly. </p>\n<p align=\"left\">\"Don’t mind him, Suds. Kats is a real friendly guy, once you get past the first hundred layers of bullshit.\" </p>\n<p align=\"left\">\"Jeez. How many layers are there?\" </p>\n<p align=\"left\">\"Definitely more than a hundred. I'm twenty-years in and still working my way through them all.\" </p>\n<p align=\"left\">They turn at the sound of a new voice. Izuku waves, and Katsuki pouts as Izuku worms an arm around his shoulders. </p>\n<p align=\"left\">\"What are you doing here? I told ya' I'd meet you at home.\" </p>\n<p align=\"left\">\"Sorry to intrude on your <em>guy time. </em>I was just passing by on the way to the grocery store.\" </p>\n<p align=\"left\">\"First of all,\" Katsuki raises a finger. \"Don't call it that ever again and second, <em>what? </em>The hell? Are you buying at the grocery store?\" </p>\n<p align=\"left\">\"Well. I was going to try making Udon... Hi Kirishima!\" </p>\n<p align=\"left\">\"Yeah, no. That's not happening.\" </p>\n<p align=\"left\">\"Hey Midoriya!\" Eijirou talks over Katsuki, clapping Izuku's hand in a hello. Suds waves, and Izuku waves back, still leaning on Katsuki's shoulders. </p>\n<p align=\"left\">\"Hi! I'm Izuku.\"</p>\n<p align=\"left\">\"Oh, I know who you are.\"</p>\n<p align=\"left\">\"Awww Kacchan, are you out here making friends?\" </p>\n<p align=\"left\">\"No. Shut up.\" </p>\n<p align=\"left\">\"Of course he is, the little social butterfly~\" Eijirou coos. </p>\n<p align=\"left\">\"You're all dead to me. Deku, we're leaving and I’m doing your grocery shopping.”</p>\n<p align=\"left\">Suds’ hair bubbles, and he taps the counter. </p>\n<p align=\"left\">\"Hey, let me get you a drink, at least.\" </p>\n<p align=\"left\">\"Oh! Is that alright? Kacchan looks like he wants to leave.” </p>\n<p align=\"left\">\"He's just embarrassed,\" Eijirou pokes Katsuki, like a bear. \"He was telling us how much he <em>wuuuved you.\" </em></p>\n<p align=\"left\">Katsuki explodes, popping off the barstool and igniting his hands. </p>\n<p align=\"left\">\"<em>I was not you little dirty fucking liar!!\" </em></p>\n<p align=\"left\">Izuku laughs, and accepts the drink from Suds. Eijirou hardens to shield himself from the blows, and Suds slaps the counter and says, <em>\"Aye! No strangling people in my damn bar!\" </em></p>\n<p align=\"left\"> </p>\n<p align=\"center\">~</p>\n<p align=\"center\"> </p>\n<p>Learning to accept love and affection in his day-to-day life is a boundary that Katsuki is still trying to cross. Izuku is one of the strongest men on planet earth, so it can’t <em> possibly </em>be a weakness, but an old, damaged part of Katsuki’s brain still tells him it is. </p>\n<p>Mentally, Katsuki is stronger than most. You see a lot of fucked up shit in hero work — and it ain’t good for the squeamish, that’s for sure. UA exposed him to enough nightmares to last a lifetime, so most crap Katsuki can handle. </p>\n<p>Izuku is good at search and rescue — that dumbass smile plastered on his face, his sweet way of talking someone down from shock like <em> no, no don’t look down, just look at me, I’ve got you, okay? </em> And Katsuki isn’t so great at being that nice, but he’s damn good at his job, so he takes the <em> win to save, save to win </em>very seriously. </p>\n<p>Unfortunately, Katsuki was never mentally prepared for the day he’d have to rush in to save his parents. </p>\n<p>He hasn’t seen them since the holidays; they ain’t that kind of family to begin with, but they’re still his folks, and seein’ them held up at gunpoint is traumatizing enough as it is. Thankfully his training kicks in, and by the time Izuku is done talking down the shooter, Katsuki has enough time to grab the hostages and hightail it out of there. The following fight is a bit ugly. </p>\n<p> </p>\n<p>Dad is a little bruised, but fine. Mom is just pissed, but that’s how it goes. </p>\n<p> </p>\n<p>“Sorry for getting in the way, kid,” Mom pats his hair. </p>\n<p>Katsuki shrugs off her hand, “Mah, fuck off. Don’t get into any more trouble.” </p>\n<p>Dad laughs, and Mom digs her knuckles into the top of his head. </p>\n<p>“Ha! We should be sayin’ that to you, dumbass.” </p>\n<p>Katsuki should’ve known that his parents wouldn’t be shaken up so easily, but Katsuki is tired, he’s fucking <em> tired, </em>and Izuku swoops in to save the day, setting a hand at Katsuki’s shoulder and bowing to his parents. </p>\n<p>“Mr and Mrs Bakugou! I’m so sorry for the trouble! Are you both alright?” </p>\n<p>“Yes yes, of course!” </p>\n<p>“Barely a scratch. We’re so honored to be rescued by the <em> pros, </em>haha. How’ve you been, Izuku? Katsuki hasn’t been too much of an ass, has he?” </p>\n<p>“No — no, not at all!” </p>\n<p>Katsuki zones out. He’s not mentally present for much of the police report, and when his parents say goodbye, he can barely get it together long enough to see them off. Izuku gives them the rundown about a trauma counsellor and blah blah blah, Katsuki just can’t stop seeing the <em> gun, </em>and it’s pissing him off that he is this shaken up by a villain that didn’t even take casualties. </p>\n<p>Katsuki has seen arms ripped off, has seen skin melt off bone, has stopped mass <em> murderers </em>in broad daylight, but something about today has just tipped him over that edge. Izuku looks worried, and it makes Katsuki mad. </p>\n<p>“Hey. Are you okay?” </p>\n<p>“Fine,” Katsuki shrugs him off. “I’m goin’ home. M’ tired.” </p>\n<p>Izuku frowns, “Okay. I’ll finish up here, so don’t worry about the report.” </p>\n<p>“Mmm.” </p>\n<p>They’re careful about PDA on the job, but Izuku gives him a firm squeeze on the shoulder, and Katsuki barely feels it. </p>\n<p> </p>\n<p>He’s not even sure how he gets home. He doesn’t even shower. Katsuki’s head is just up and gone, and it must’ve been hours by the time he hears a key turning in his door. </p>\n<p> </p>\n<p>“Kacchan?” Izuku whispers. “Are you still awake?” </p>\n<p> </p>\n<p>Hmm. It’s late, isn’t it? Katsuki checks the time and yeah, neary one in the morning. </p>\n<p>“Whataya’ want?” Katsuki calls from the kitchen. Izuku wanders in and shuts the door behind him. </p>\n<p>“Sorry I just — I wanted to check on you, and you weren’t answering your phone and I could tell you were a little uh...well, of course you handled everything just fine, you’re a professional! But um, you just looked...<em> upset?” </em>Izuku flinches. </p>\n<p>Katsuki digs his butterknife into a tub of frosting, and licks it off the end. </p>\n<p>“Go home, I don’t need your pity.” </p>\n<p>“It’s not pity. It's concern, because I love you.” </p>\n<p>Katsuki pauses. Izuku sets down his bag, and approaches his spot on the barstool. </p>\n<p> </p>\n<p>They’re coming up on four months since the contract began. It feels like a lifetime ago, but also just yesterday. Katsuki hates how much better he feels, just by seeing Izuku in front of him. He fucking hates it so much, his chest burns and crushes his lungs. Katsuki jams his knife in the tub and shoves the chocolate in this mouth. </p>\n<p>Izuku approaches, “Oh honey, let's put down the frosting, okay?” </p>\n<p>Katsuki growls, yanking the frosting away from his grip. </p>\n<p>“Fuck off! Don’t tell me what to do.” </p>\n<p>“Kacchan,” Izuku frowns, and Katsuki tries to push him away. </p>\n<p>“I’m not in the mood right now. I’m fine, so just go home.” </p>\n<p>Izuku isn’t fazed, because of course he isn’t. His eyes get big and sparkly, like he knows it’s Katsuki’s weak point. </p>\n<p>“Okay. You don’t have to talk about it, but...you’re still a mess. Will you let me clean you up?” </p>\n<p>Even with his head as fuzzy as it is, Katsuki’s defenses still fly up like a shield. </p>\n<p>“I don’t <em> need —</em>” </p>\n<p>“I know,” Izuku says, and his eyes water, and Katsuki’s heart clenches. “Trust me, I know. But you take such good care of me, and I can see it in your face, Kacchan, you’re exhausted. Just let me — let me do the same for you. I know how you feel, I <em> really </em>do.” </p>\n<p>Katsuki didn’t even realize that the terrible pressure in his chest was the verge of a panic attack. He swallows it back, doesn’t let it crack on his face, but Izuku’s hands rest at his outer thighs, and the warmth spreads up his leg and into his sternum. Katsuki’s voice cracks. </p>\n<p>“I’m not weak.” </p>\n<p>“Do you think I’m weak, when you take care of me?” Izuku asks. Katsuki swallows, and sticks the knife back in the frosting very slowly. </p>\n<p>“No.” </p>\n<p>“Then why would I think that way about you?” </p>\n<p>Katsuki doesn’t answer. Izuku prods the tub out of his hands, and sets it on the counter. </p>\n<p>“I’ll run a bath for you. Come on.” </p>\n<p>Izuku’s hands are familiar in his. Katsuki allows himself to be tugged into the bathroom. He feels drugged, oversensitive, sore and annoyed and his <em> brain </em>won’t stop running all the stupid what if’s. </p>\n<p>Izuku gets him out of his clothes, and convinces Katsuki to sit in the bathtub. He drags out the soaps from under the sink, and makes it smell nice and sweet before shucking his own clothes and crawling in behind him. </p>\n<p>Katsuki thinks about the last time he did this for Izuku, and how much has changed since then. Izuku’s legs bracket him in and it’s <em> comforting, </em>it feels safe, and Katsuki can hardly believe it. </p>\n<p>Izuku doesn’t ask him to talk. He just washes his hair in sections, scooping water with his hands scrubbing with his blunt nails, and eventually the anger in his mouth pools out and is lost to the soapy water. </p>\n<p>“You can lean back on me,” Izuku prods gently. Katsuki lets Izuku take his weight, and the water sloshes over the edge. They’re both too big for his dumb bathtub, but Izuku wraps his arms tight around his waist, and Katsuki forgets who he is, lulled completely out of his own mind. Katsuki’s voice comes out raw. </p>\n<p>“I don’t know why this is fucking me up so bad.” </p>\n<p>“You’ve had to be strong for weeks,” Izuku pets his damp hair, pushing it away from his forehead. “We’ve been working forty-eight hour shifts. It rubs down anyone.” </p>\n<p>“But not me,” Katsuki mumbles. “Shouldn’t be me. I’m gonna’ be number one.” </p>\n<p>The echo makes the bathroom feel bigger than it is. Katsuki’s feet cram up against the edge of the tub, and Izuku’s bodyheat is warmer than the bathwater. </p>\n<p>“I’ve only stayed sane because of my friends, my mom, and the fact that you’ve been there to support me,” Izuku says. “I want to be that for you too. A relationship goes both ways.” </p>\n<p> </p>\n<p>\n<em> A relationship.  </em>\n</p>\n<p> </p>\n<p>The word still tastes new. Out of all the people Katsuki has fucked, has strung up in rope and forced on their knees — Izuku is his first <em> boyfriend. </em>It’s strange, but it could never be anyone else, except him. </p>\n<p>Katsuki doesn’t reply at first. He looks at where their knees jut out of the water. Where an old scar crosses Katsuki’s thigh, and starts up again on Izuku’s calf. </p>\n<p>“My parents shouldn’t have been there,” Katsuki mumbles. “They should’ve been at home, watching Jeopardy and eating crap TV dinners.” </p>\n<p>“You handled everything perfectly<em>, </em>” Izuku assures patiently, but without the bullshit. “Right to code, like a real pro. I’d call you out, if you didn’t.” </p>\n<p>His words feel nice, and soothing. Is this how it feels, for Izuku? The loss of control is scary, but Katsuki is no longer on the edge of a breakdown. </p>\n<p>“Shut up,” Katsuki mutters. He gets Izuku’s fingers threaded in his own, and the knot in his stomach unravels a little. “Don’t tell anyone about this.” </p>\n<p>“Why would I do that?” Izuku teases. “Especially when you have so much dirt on <em> me. </em>” </p>\n<p>Katsuki cracks a smile. </p>\n<p>“Damn right I do.” </p>\n<p>“I love you so much,” Izuku says. “So so much, I feel like I’m going to burst sometimes, even when you’re driving me crazy.” </p>\n<p>Katsuki turns his head on Izuku’s shoulder. He can see the line of his jaw, the curve of his nose and all the old acne scars, and Katsuki gets close enough to mouth over the mole on his neck. </p>\n<p>“Don’t leave me.” </p>\n<p>Izuku swallows, and squeezes his fingers. “That’s silly. Where would I go?” </p>\n<p>“Dunno. I love you too.” </p>\n<p>Izuku freezes, rigid against the tub, before he jerks to squeeze Katsuki so tight his ribs creak. He hates that he can hear the tears in his voice. </p>\n<p>“Thank you — thank you for telling me.” </p>\n<p><em> “Shut up, </em>god. We’re not making a habit of this.” </p>\n<p>“I’m always going to protect you, in the same way you protect me,” Izuku tells him. “Sorry, but it’s who I am.” </p>\n<p>Katsuki knows. Oh, does he. The sludge monster comes to mind — a quirkless, fourteen year old boy running right to his death. Katsuki settles back into his shoulder, turned where he can jam his nose in Izuku’s throat, where it smells the most like <em> him.  </em></p>\n<p>“Guess we ain’t partners for nothing.”</p>\n<p>“Of course, daddy,” Izuku says, and Katsuki jolts to squeeze him by the nose, jamming his fingers in Izuku’s armpits and making him squeal until he apologizes properly, like a good boy. </p>\n<p>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n</p>\n<p>Katsuki loses some walls that day, but it’s not necessarily a bad thing (or so his therapist says).</p>\n<p>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n</p>\n<p align=\"center\">~</p>\n<p>\n<br>\n<br>\n</p>\n<p>“Yo, Deku.” </p>\n<p>“Hm?” </p>\n<p>“Do you think we could use black whip in a scene?” </p>\n<p>“Absolutely <em> not, </em>are you serious?” </p>\n<p>“It was just a fuckin’ question, damn.” </p>\n<p><br>.<br><br></p>\n<p> </p>\n<p>.</p>\n<p> </p>\n<p>.</p>\n<p> </p>\n<p>“I mean.... logistically we could if... <em>hey! Put me down!” </em></p>\n<p><em><br></em> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>\n<br>\n<br>\n</p>\n<p> </p>\n<p> </p>\n<p> </p>"
}