{
  "id": "25814023",
  "url": "https://archiveofourown.org/works/25814023?view_full_work=true",
  "author": [
    "aworus"
  ],
  "title": "next time, next time",
  "rating": "Mature",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
  ],
  "relationships": [
    "Aizawa Shouta | Eraserhead & Midoriya Izuku"
  ],
  "characters": [
    "Midoriya Izuku",
    "Aizawa Shouta | Eraserhead"
  ],
  "additional_tags": [
    "Time Loop",
    "Angst",
    "Hurt/Comfort",
    "Protective Aizawa Shouta | Eraserhead",
    "Parental Aizawa Shouta | Eraserhead",
    "Hurt Midoriya Izuku",
    "Depressed Midoriya Izuku",
    "Temporary Character Death",
    "Suicidal Thoughts",
    "let aizawa say fuck",
    "no beta we die like izuku in this fic",
    "Blood and Gore",
    "theres cursing bc this is in aizawas pov",
    "i have been informed that this is a bit of a horror fic so... beware",
    "Implied/Referenced Child Abuse",
    "sorry theres vomit ewwie ewwie"
  ],
  "language": "English",
  "series": "",
  "published": "2020-08-10",
  "completed": null,
  "words": "10,054",
  "chapters": "1/1",
  "comments": "285",
  "kudos": "11,564",
  "bookmarks": "2,601",
  "hits": "101,806",
  "summary": "<p>Over and over again, Aizawa Shouta is woken by the same alarm, at the same time, on the same day.</p>\n<p>The roof access door alarm is triggered. It is 7:56am. It is Saturday.</p>\n<p>And over and over again, Aizawa Shouta is just <i>barely</i> too late to stop Midoriya Izuku from stepping off of the ledge and splattering onto the concrete below.</p>",
  "notes": "<p>Hello! This piece is inspired by aloneintherain’s absolutely <i>phenomenal</i> fic, a lesson you should heed (try, try again).</p>\n<p>While you don't have to have read that fic in order to enjoy this one, I highly recommend reading it anyway! Firstly, reading that fic will aid in your understanding of this one, and secondly, it’s just a great piece!!</p>\n<p>This was not originally intended to be a whole rewrite, but that is... exactly what it turned into?? Anyway, the key difference between this fic and the orig is that; instead of only Izuku being involved in a time loop, Aizawa is as well! This fic is about the both of them trying to find a way to save the other, while refusing to communicate the full extent of what they’re really going through. (spoiler alert: that doesn’t work.)</p>\n<p>Also if you’ve read aloneintherain’s fic, you’ll see that I completely disregarded Shinsou’s involvement in the story. I swear I don't hate him, I just really wanted to focus on Aizawa and Midoriya's relationship! Also there was literally no way that I could add yet ANOTHER overlapping time loop without the story being completely incomprehensible.</p>\n<p>Remember to check the tags for possible triggers! Stay safe friends!!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>yea maybe both of them are OOC but you know what??? trauma changes ppl and that's VALID!!</p>\n<p>also whats UP can you tell im a psych major by my schrodinger's cat reference</p>\n<p>i have three other dadzawa fics that have been in progress for months but for whatever reason i was able to finish this one in a week. we love the power of hyperfixating.</p>\n<p>depending on the feedback i get on this fic i might actually work harder to finish my other wips + post them here!</p>\n<p>i make art!!! follow my art tumblr @aworus and my main tumblr @erentzia (if u want!)</p>\n<p>also blease.... leave.comment</p>",
  "text": "<p>Shouta wakes to the grating tone of an automated voice.</p>\n<p>\n<em>“Roof access door alarm has been triggered. Investigate immediately. Roof access door alarm has been triggered. Investigate immediately.”</em>\n</p>\n<p>He regards the message with a grunt as he begrudgingly swings his legs over the side of his bed. The security bot knows well enough to take this as a confirmation, and promptly shuts off. He stands, knees popping, and spares a glance at the clock beside his bed.</p>\n<p>7:56am</p>\n<p>\n<em>Disgusting.</em>\n</p>\n<p>It’s a <em>Saturday.</em> On weekends, he typically doesn’t see hide nor hair of a single student before 9am. He silently laments the hour of sleep he’s going to lose because of whatever shenanigans his students are taking part in as he grabs his scarf and heads out of his dorm.</p>\n<p>As expected, the common room is empty, so he moves on. He stalks through the halls, listening for any sign of life as he passes each room. He hears some snores and the occasional quiet murmurs. He knows there are a few students who tend to seek out the help of a friend during rough nights. It’s none of Shouta’s business. So when he hears soft voices coming from Jirou’s room, and again at Sero’s, he elects to leave them and whoever their… <em>partners</em> are, alone.</p>\n<p>So far, nothing is amiss.</p>\n<p>While relieved by the fact that nothing is visibly out of place, Shouta’s anger doesn't quell. He’s still ready to expel the <em>hell</em> out of whoever he catches smoking on the roof, because these are high schoolers, why else would one of them be up there?</p>\n<p>Shouta stomps up the stairs to the roof, purposefully loud as to startle whoever is at the top. There's no way to get down from the roof aside from the door directly in front of him, so it’s not like they could escape upon hearing the noise. He opens the door with more force than necessary, causing it to slam loudly against the adjacent wall.</p>\n<p>The roof is absent of any student, but not empty entirely.</p>\n<p>A pair of obnoxiously vibrant red sneakers are neatly lined close to the ledge. Shouta catches a glimpse of something white inside of the right one.</p>\n<p>Shouta’s heart drops to his stomach, because he knows <em>exactly</em> what that means.</p>\n<p>Breath caught in his throat, he sprints towards the shoes, and then past them to the ledge of the roof. He <em>slams</em> into the railing, gripping it with white knuckles as he leans over it. One of his legs is already over when he sees him.</p>\n<p>\n<em>Midoriya</em>\n</p>\n<p>Shouta can't see his face; the kid’s head is angled downward, but he sees the wild bush of curly green hair and he knows.</p>\n<p>His student is in freefall for only another millisecond before he meets the concrete below with an absolutely horrifying <em>crunch</em>, resounding in Shouta’s ears and jarring his entire <em>being</em> even from over sixty feet away.</p>\n<p>Shouta takes no time in using his capture weapon to propel himself fully over the railing and towards the ground below.</p>\n<p>The wind roars in his ears and his blood burns in his veins as he falls. He uses his scarf once again to slow his descent, one end wrapping tightly around the branch of a tree and the other onto the handle of a random window attached to the building that he just <em>jumped off of.</em></p>\n<p>Even with the assistance of the capture weapon his impact with the ground <em>hurts.</em> He lands on his feet but it makes something in both of his knees <em>crack</em> and something in his left leg <em>shift</em> in a way he doesn’t think it’s supposed to.</p>\n<p>He pays it no mind, because the body of Midoriya Izuku lies motionless directly in front of him.</p>\n<p>Blood is already soaking the concrete below, mostly from where the boy’s head is.</p>\n<p>Or rather, <em>was.</em></p>\n<p>The sixty foot drop directly onto his skull left very little of it.</p>\n<p>Shouta drops to his knees next to the boy, expertly detaching himself from the situation as he reaches for his wrist—god <em>knows</em> there's no way he’d be able to use his neck when it's twisted like <em>that—</em>and uses his index and middle finger to feel for a pulse.</p>\n<p>He knows before his hand even makes contact that it’s useless.</p>\n<p>He sets the boy's wrist gently back onto the ground when he inevitably does not detect a heartbeat. He feels wetness seep into the fabric of his pants where he kneels in the puddle of blood.</p>\n<p>His student’s blood.</p>\n<p>No, it’s not his student’s. It <em>can’t</em> be his student’s. His student would never kill himself, <em>Midoriya</em> would never kill himself.</p>\n<p>Shouta reaches forward—<em>are his hands shaking? why are they shaking?—</em>and grabs the mangled jaw of the body. He turns the head so it faces him, because the fragments of skull and splatters of brain matter and clumps of blood-matted hair on the back of its head aren't enough to identify the body, he needs to see the <em>face.</em></p>\n<p>And he soon does. The sight of a single (green, green, <em>green</em>) eyeball hanging pathetically by a mere string of tissue out of its crushed socket is enough to make Shouta immediately gag. He pitches to the side, just barely avoiding the body <em>(Midoriya, it’s Midoriya,)</em> in front of him, as he throws up nothing but water and bile. The sick mixes with the blood on the ground. The smell makes him vomit again.</p>\n<p>He stops heaving eventually, if only because his body has nothing left to give up. He turns back to his <em>(former)</em> student. He reaches out to the hand closest to him, taking it in his own. It’s so cold. It’s so <em>small.</em> He clutches it close to his chest.</p>\n<p>He hears screaming. His throat aches. He thinks distantly that the sound might be coming from him.</p>\n<p>Through tear-blurred eyes, he sees something yellow growing in size—getting closer, maybe?—before everything goes black.</p>\n<p>\n<em>“Roof access do—”</em>\n</p>\n<p>Shouta wakes with a shout.</p>\n<p>He bolts upright in his bed. Both of his hands are clutched to his chest in the way they had been in his dream, though there is no smaller, colder hand in between them now. Whatever roused him promptly shuts off upon hearing him wake.</p>\n<p>Now in the quiet, he attempts to tame his breathing as he wonders where the actual <em>fuck</em> that dream came from.</p>\n<p>Shouta is certainly no stranger to nightmares. Whether it be by visions of worst-case potentialities of missions going horribly wrong, or by dredges of distant memories he’d rather have long forgotten, he rarely finds his sleep to be fitful, these days.</p>\n<p>Though, while nightmares have found themselves to be a near-nightly occurrence, rarely are they as… <em>vivid</em> as that last one. He remembers the horrifying clarity with which his brain conjured the image of Midoriya’s freshly-dead body. He figures that the fact that he’s seen the boy bleeding and broken and nearly dead half a dozen times <em>outside</em> of his nightmares is the reason for it.</p>\n<p>Even as his body and mind calm he finds he doesn’t want to return to sleep. So he drags himself out of bed, and towards the door. Before leaving, he flicks his gaze to the alarm clock adjacent to his bed.</p>\n<p>7:57am</p>\n<p>Saturday</p>\n<p>Shouta feels… <em>something</em> tug at his mind as he looks at the time. He squints at the numbers, causing the neon green digits to blur together. He shrugs, and walks out the door.</p>\n<p>For once, the first thing Shouta does is not make coffee. Instead, his legs carry him to stand in front of a certain Problem Child’s door. He has his hand poised to knock before he stops himself, feeling more than a little ridiculous. There's no reason to interrupt the kid's sleep because he had a little nightmare. He scoffs at himself and turns to leave.</p>\n<p>He doesn't make it one step before he is assaulted with the memory of Midoriya’s face, one eye hanging pathetically out of his crushed skull and the other gone entirely.</p>\n<p>He turns back around and knocks.</p>\n<p>There is no sound from the other side of the door.</p>\n<p><em>He’s sleeping,</em> Shouta tells himself, <em>he’s just sleeping.</em></p>\n<p>He remembers being able to see something pink and gelatinous leaking out of the massive cracks in Midoriya’s skull— <em>his brain.</em></p>\n<p>He knocks again, louder.</p>\n<p>Still, there is silence.</p>\n<p>He remembers how Midoriya’s head had looked nearly backwards with how his neck had twisted and warped from the impact.</p>\n<p>Shouta hates the idea of invading his student’s privacy but...</p>\n<p>He takes out his master key card, slides it in the door, and cracks it open just slightly so as to not wake the boy inside.</p>\n<p>He is greeted with the sight of an empty bed.</p>\n<p>Shouta is down the hall and up the stairs in seconds.</p>\n<p>He feels an <em>awful</em> sense of deja vu as he slams open the roof access door just in time to see a body tip off the edge.</p>\n<p>Just like in his dream, Shouta runs to the ledge, jumps over it, and is too late. He fumbles for a pulse and doesn’t find it.</p>\n<p>Though <em>unlike</em> in his dream, the head of the body is already facing him.</p>\n<p>And unlike in his dream, <em>both</em> eyes are gone, and its mouth is open in a silent scream, showcasing broken teeth and a bitten-through tongue.</p>\n<p>Shouta doesn’t even have time to vomit before he passes out this time.</p>\n<p>\n<em>“Roof access door alarm has been triggered. Investigate imme—“</em>\n</p>\n<p>Shouta bolts upright with a gasp.</p>\n<p>What the fuck?</p>\n<p>He looks around a little frantically, taking in the fact that he is in his bedroom, and not on the ground outside of the dorm building. A glow in his peripheral catches his attention, his gaze snaps to it— his alarm clock.</p>\n<p>7:56am</p>\n<p>Saturday</p>\n<p>What the <em>fuck?</em></p>\n<p>He throws his covers off and sprints out the door. He skips three, four steps at a time on his way to the roof. He flings open the door and sees a pair of red shoes. He runs past them and towards the ledge, leans over it to look at the ground below.</p>\n<p>The eyes of his freshly-dead student—already on the ground this time—stare back up at him.</p>\n<p>Shouta blacks out right there on the roof.</p>\n<p>\n<em>“Roof access door alarm has be—“</em>\n</p>\n<p>Shouta wakes, immediately looks at the clock.</p>\n<p>7:56am</p>\n<p>Saturday</p>\n<p>He is out the door and down the hall in record time.</p>\n<p>Because now he <em>knows</em> something is wrong.</p>\n<p>Shouta had just seen Midoriya die for the third time, and is now—presumably—being given a fourth chance to stop it.</p>\n<p>This is no longer a freak accident, nor a coincidence; this is a <em>pattern.</em></p>\n<p>This time around, he is early enough to watch as Midoriya steps off of the edge. He even has the time to throw out his arm and send his capture weapon shooting to grab the boy around the torso. But he is still <em>too late.</em></p>\n<p>As he sees and hears the boy's body slam against the concrete, he prays that he’s right- that something more <em>is</em> wrong, and that he’ll wake up to a fifth Saturday.</p>\n<p>Lo and behold, he does.</p>\n<p>The Saturdays begin to blur together, after that. With every one, he learns something new.</p>\n<p>If Midoriya hears him coming up the stairs, he will jump before Shouta can even open the door.</p>\n<p>If Midoriya does not hear Shouta coming up the stairs, but hears him open the door, he will still fall off of the ledge in one of two different ways:</p>\n<p>If Shouta opens the door too loudly, Midoriya will startle badly enough to fall.</p>\n<p>If Shouta opens the door not <em>too</em> loudly but loud enough to hear, Midoriya will immediately step off the ledge.</p>\n<p>If Midoriya does not hear Shouta coming up the stairs, and does not hear Shouta open the door, he will still be on the ledge when he arrives.</p>\n<p>If Shouta immediately runs towards Midoriya, he will hear him and jump.</p>\n<p>If Shouta does not move towards his student, but speaks too loudly or too suddenly, Midoriya will startle and fall.</p>\n<p>If Shouta speaks quietly enough, but doesn’t say the right thing, Midoriya will step off the ledge.</p>\n<p>Don’t ask what he’s doing. Don’t ask why he’s doing it. Don’t ask him any questions. He won’t answer, he will jump.</p>\n<p>Every Saturday, he wakes with a longer list of what not to do.</p>\n<p>But it’s not <em>enough</em> to know what <em>not</em> to do, he needs to know what <em>to</em> do.</p>\n<p>He doesn’t though, not yet.</p>\n<p>A Saturday will come, he tells himself, where he does.</p>\n<p>Even on his dozenth Saturday, Shouta can’t help but be afraid. It’s irrational, he knows, but there's a difference between your brain knowing something, and your body accepting it. He is still stuck in between the two. His mind tells him, every time he sees his Problem Child bloody and broken on the concrete, that it’ll be fine. Saturday will come again, and if tomorrow’s Saturday does not yield the sight of Midoriya alive, then there is always the next Saturday, and then the next and the next.</p>\n<p>Even so, his body is constantly on edge. Every Saturday he spends absolutely <em>terrified</em> from the abrupt start to inevitably horrifying finish.</p>\n<p>He is terrified of the potentiality of a Saturday continuing after Midoriya’s body hits the concrete. He fears kneeling by his student’s side, checking for a pulse just as he’s done time and time again, and when he doesn't find it, staying horribly awake. He fears living on with the weight of knowing that, even when so generously given multiple attempts, he <em>still</em> failed to save him.</p>\n<p>Along with the fear, is the guilt. That one happens in his mind and his body, weighs at his entire being.</p>\n<p>Because <em>how did he miss this?</em></p>\n<p>Shouta is very aware of how such thoughts can sneak up on a person, take advantage of them in the most vulnerable of moments. But Shouta knows Midoriya.</p>\n<p>Sure, the boy has shown to have a sort of self-sacrificial streak when the safety of another party is involved, but never before have his actions crossed the line into suicidal tendencies. Midoriya <em>knows</em> that he can use his own life to help those around him, and has shown time and time again that that is exactly what he intends to do with it.</p>\n<p>The boy walks Mina and Kaminari through their English homework every night with patience befitting only the holiest of matron saints. He walks with Todoroki, hand in hand, every Sunday to visit the heterochromatic boy’s mother. He sits perfectly still as Tsuyu braids his hair when she misses her family. He doesn’t even flinch when Mina joins in to destroy his face with makeup simply for her own amusement. He slips apple crisps into Eri’s little backpack even after Shouta makes it <em>extremely</em> clear that she has had plenty.</p>\n<p>It is only as he thinks back on these moments that he sees the warning signs.</p>\n<p>Shouta has seen Midoriya do all of these things for others, but when was the last time the boy did something for himself?</p>\n<p>In that moment, Shouta can’t help but think that committing suicide might be the first time his student decided to do something selfish.</p>\n<p>It is on Saturday number fourteen, after he watches Midoriya jump off of the roof upon hearing Shouta fumble with the door latch, that he begins to think that he’s been going about this all wrong. Maybe, if Shouta doesn’t show up to interrupt Midoriya, the boy won't even jump. Maybe the silence of the rooftop is enough to make the boy truly reflect upon the decision to end his life. Without Shouta’s interruption, maybe Midoriya would work through it on his own.</p>\n<p>Shouta has seen firsthand the things that Midoriya’s mind is capable of. It became very clear to him within the first week of school that the boy's power does not start nor end at his physical abilities. The kid can analyze his way through just about anything. Surely, if left to his own devices, he is capable of making the right decision—the <em>logical</em> decision—to stay alive.</p>\n<p>Shouta absolutely loathes the idea of just <em>laying there,</em> but that is what he does. On Saturday number fifteen, he stays in bed. He lays there on his back, completely alone, and he prays.</p>\n<p>Shouta has never cried <em>before</em> Midoriya's death. The urgency of reaching the boy dulled all emotion aside from determination as he ran, skipping as many steps that he could physically manage at once in order to reach the roof.</p>\n<p>This time though, he cries.</p>\n<p>Right now, Midoriya is Schrödinger’s cat, just as dead as he is alive, and Shouta <em>hates</em> the ambiguity of it. At least, when he would trip on the stairs, fumble with the doorknob, slam into a wall, he knew. He knew that the half-second slip-up meant that Midoriya was dead. Of course, he would continue anyway, knowing that the attempt would only yield the sight of an empty rooftop.</p>\n<p>But right now? He <em>doesn't</em> know. And for some reason, the uncertainty is what gets him.</p>\n<p>So he lays there, and he cries.</p>\n<p>He doesn't move even when the sun begins to cast rays of light through the gaps in his blinds and onto his face. Any other morning, he would shy away from them with a grumble. Today, he can’t find the energy. He simply lays in the silence.</p>\n<p>The quiet is only broken at 8:34am by Yagi Toshinori’s screaming sobs and echoing calls for his son.</p>\n<p>Shouta welcomes unconsciousness.</p>\n<p>Shouta’s nineteenth Saturdays isn't the first one where he broke down (see: Saturdays number one, six, eight, nine, and fifteen), but it's the first time he does it in Midoriya’s presence.</p>\n<p>It happens as he stares at his student’s back, seeing the way his All Might sock clad toes are already over the edge. It happens as he stands rooted to the ground with the knowledge that even the slightest movement will startle the kid enough to tip him over the edge, that even if he starts running as fast as he possibly can right now, he <em>still won't make it.</em></p>\n<p>Right now, his words are all he has. So he talks, just as he’s tried so many times, praying that somehow this one turns out differently.</p>\n<p>“I’m sorry,” He chokes. His voice is scratchy in a way that isn’t particularly uncharacteristic of him, but it now harbors a tightness that he’s never let his students hear. It’s fine though, it’s not like Midoriya will remember by the time Saturday number twenty rolls around.</p>\n<p>“I’ll save you,” He insists, voice cracking. “One of these tries, I’ll save you.” He squeezes his eyes shut, his chest <em>burns.</em></p>\n<p>“I swear,” He says. “We’re going to get to Sunday.”</p>\n<p>Shouta hasn't yet heard Midoriya’s body hitting the ground, but that doesn't mean his words meant anything, it doesn’t mean his student isn't in freefall right now, it doesn't mean that Midoriya isn't still going to die. So Shouta keeps his eyes tightly closed as he waits. He waits and wonders; will the day reset if he doesn't see the body? In the past, it had usually been the sight of Midoriya on the ground that triggered Shouta into passing out, into waking up to the next <em>(same)</em> Saturday.</p>\n<p>The desire to just get this attempt <em>over with</em> is what has him opening his eyes.</p>\n<p>He sees Midoriya. Standing. <em>Alive.</em></p>\n<p>\n<em>He hasn’t jumped.</em>\n</p>\n<p>Shouta sucks in a sharp breath at the sight of Midoriya still on the ledge. Is he doing something <em>right?</em></p>\n<p>His student doesn’t face him, he never does. He stares at the ground below with the same intensity that Shouta watches the green curls nearly fifteen feet in front of him, the red shoes with a note tucked inside only ten. But he doesn't jump.</p>\n<p><em>Not yet,</em> Shouta’s brain mocks.</p>\n<p>Above the blood rushing in his ears he hears the smallest, “What?”</p>\n<p>Midoriya just <em>responded</em> to him. It wasn’t the most eloquent of responses, but it was a response nonetheless. It was something more than the loud sobs and near-incomprehensible apologies that the boy had provided during any of the Saturdays that he vaguely registered Shouta’s presence before. This time, he didn’t only register the fact that he’s there— he <em>heard</em> him, he <em>replied.</em></p>\n<p>Shouta works his jaw, tries to think of something, <em>anything</em> to say. Anything to keep his student alive for just a second longer. Any words he can come up with die in his throat once again as Midoriya moves.</p>\n<p>He turns around and <em>faces</em> him.</p>\n<p>A tear escapes Shouta’s eye, trails over his scar and down his cheek. In Midoriya’s eyes are so much <em>hurt</em> that it makes Shouta physically ache. But they're alive. Midoriya is still alive. His student’s eyes meet his own as he says again, louder this time, more demanding, <em>“What?”</em></p>\n<p>With that question, Midoriya steps <em>off the ledge</em> and onto the lower platform of the roof.</p>\n<p>\n<em>Towards Shouta.</em>\n</p>\n<p>The shock has the hero’s mouth hanging open, eyes wide, hands trembling as they reach out pathetically towards his student. His feet remain rooted to the ground.</p>\n<p>Midoriya stalks closer, eyes red and puffy and <em>blazing.</em> Shouta’s instincts urge him to take a step back. The Midoriya walking towards him is a foreign one. Desperation and determination and something akin to <em>fury</em> dance in his eyes. Each of these emotions on their own would have been familiar enough, but not together, not at him. He does not move. He stands in place and watches as—for the first time in eighteen horrible, gruesome Saturdays—Midoriya <em>comes to him.</em></p>\n<p>He reaches Shouta and he grips the man's wrists. Shouta startles at the contact and the fact that Midoriya is <em>right here</em> and he’s <em>touching him.</em> Midoriya speaks again, his eyes frantic as he digs blunt nails into Shouta’s wrists.</p>\n<p>“What do you mean, <em>‘get to Sunday.</em>’” The sentence is worded in the form of a question but it is not spoken like one; it is demanded.</p>\n<p>Shouta, in turn, finally gains control of his movements, and plants both hands firmly on Midoriya’s shoulders. He finds himself mesmerized with the feeling underneath his fingertips. He grips the fabric tightly. His breath stalls in his throat, his heart stutters in his chest. He still doesn't speak. Another tear falls.</p>\n<p>Midoriya is still staring at him with hardly veiled desperation. The boy lets out a long breath, tightens his hands where they are clasped around Shouta’s wrists.</p>\n<p>“I think…” Midoriya swallows, “I think... I <em>know</em> what you mean…” his student says, voice shaky, and Shouta wants so badly to believe him but he <em>can't.</em></p>\n<p>So he shakes his head, finally finds his words. “No,” he spits, probably too harshly. Miraculously, considering the kid’s tendency to shrink away from any raised voice even on days <em>other</em> than Saturdays, Midoriya doesn't flinch. “No, you <em>don’t”</em> he shakes his student a little frantically.</p>\n<p>Midoriya squints, searches his eyes. Perhaps he finds what he’s looking for, because he then replies quietly, “Yes, I <em>do,</em> sensei.”</p>\n<p>And that tone is... <em>almost</em> enough to make him believe his student but Shouta is <em>logical.</em> And logically, there's <em>no way</em> that Midoriya could <em>possibly—</em></p>\n<p>“Because I’m on my twenty-fifth Saturday in a row.”</p>\n<p>The words make Shouta immediately collapse to his knees, flooded with an emotion he could never understand. His grip on Midoriya’s shoulders causes the boy to fall as well. For a single, terrifying second, he thinks he's about to pass out.</p>\n<p><em>God, no,</em> he thinks, <em>please, I’m so close, he’s right here.</em></p>\n<p>But no, Shouta stays awake. He stays awake and so does Midoriya and they both just sit there staring at one another and gripping each other and crying.</p>\n<p>Shouta still doesn't speak, what can he possibly say?</p>\n<p>Midoriya, as he always tends to do, fills the silence.</p>\n<p>“Sensei,” he starts, voice small and scared and <em>young.</em> “I don't know what's <em>happening</em>.”</p>\n<p>Shouta swallows, takes in the boy's face through blurry eyes and <em>god,</em> he's <em>still crying.</em> He feels ridiculous, he feels like a child.</p>\n<p>It's not funny, nothing about this is funny, but for some reason, he huffs out a barely-there laugh as he replies. “Me neither, Problem Child.”</p>\n<p>Midoriya's sobs begin anew at this, but he smiles. For the first time in eighteen Saturdays for Shouta, twenty-five for the boy himself, he smiles. He lets go of Shouta’s wrists, causing his own grip to tighten on his shoulders because <em>no, please don't let go, please don't make me go through it agai—</em></p>\n<p>And he wraps his hands as far around Shouta’s torso as he can manage, and he weeps into his chest. The hero hesitates only for a second, only because of the shock of it all, before he returns the embrace. His arms circle around his student tightly, pulling him almost completely onto his lap as he buries his face in his hair.</p>\n<p>If Shouta had been presented with an armful of sobbing child before this whole ordeal, he thinks the awkwardness of it all would have launched his consciousness straight into the lithosphere. Honestly, he thinks it still would if it were any student other than Midoriya.</p>\n<p>But it <em>is</em> Midoriya, and it's Saturday, so he allows the boy to heave loud sobs into the fabric of his jumpsuit as he rocks him back and forth gently, letting his own tears soak into his student’s hair.</p>\n<p>“It’s okay, Izuku,” he says, <em>insists,</em> because it <em>has</em> to be, because his kid is right here and Shouta is holding onto him. “We’re going to get to Sunday.” Shouta feels Midoriya nod, shaky and a little frantic, before he hears the quivering voice of his student.</p>\n<p>“We’re going to get to Sunday, sensei.”</p>\n<p>Shouta squeezes his eyes shut, just feeling Midoriya in his arms, and lets out an affirmative hum, he knows his voice will break if he speaks again.</p>\n<p>Midoriya seems to be significantly less comfortable with the silence than Shouta.</p>\n<p>“Sensei,” He breathes, “What do we <em>do?”</em></p>\n<p>And <em>God</em>, Shouta doesn't <em>know.</em> Sure, this is the most progress Shouta has ever made during a Saturday but he’s still scared, Midoriya could still die. But he knows he can't be scared in front of his student, the look of desperation and thinly veiled terror on the boy’s face as he faced Shouta for the first time in eighteen Saturdays still fresh in his mind. Midoriya needs confidence right now, not fear.</p>\n<p>He licks his lips. “Izuku,” He says quietly, and the boy stills. It's not the first time he’s called his student by his given name today, but it’s the first time the boy fully registers it. Shouta slowly, <em>very slowly,</em> pulls back from the embrace. For a split second, Midoriya’s fists tighten in the fabric of his shirt, but he quickly lets go. Shouta keeps his hands on the boy's shoulders, but Midoriya shrinks backwards. He pulls his hands close to his chest and ducks his head and looks as if he expects to be scolded.</p>\n<p><em>Oh no,</em> Shouta thinks, <em>that won’t do.</em></p>\n<p>The teacher removes his hands from the boy's shoulders to clasp his hands, pulling them away from where they had begun nervously wringing together. He squeezes them in a way he hopes is reassuring.</p>\n<p>“You said you're on your twenty-fifth Saturday, correct?” Shouta asks. Midoriya, lips pursed and eyes averted, nods, curls bouncing with the movement. The boy is still withdrawn. Shouta didn’t mean to frighten him by pulling away, but he needs to <em>look</em> at Midoriya. He needs the visual reminder that Midoriya is alive and right here or else he won’t be able to think straight.</p>\n<p>He rubs his thumb gently over the boy's knuckles. Green eyes snap down to track the movement. Shouta feels something drip onto the back of his hand. Midoriya sniffles.</p>\n<p>Shouta hums, absently rubbing the boys hands, tracing over his scars.</p>\n<p>“I’m on my nineteenth,” he says. His student’s wide-eyed gaze snaps back up to his face. Before he can come up with any ideas as to what Shouta means, the man continues. “I <em>believe</em> you, Midoriya, and I don't think you counted wrong or anything.” He allows his student to pull one of his hands from Shouta’s own to wipe at his face as the words, <em>I believe you,</em> cause him to begin crying anew. He must realize quickly that nothing is going to stop the tears from falling, because he grabs Shouta’s hand again seconds after, and simply lets it happen.</p>\n<p>Shouta stays silent for a few minutes, alternating between squeezing the boys hands and gently thumbing over the scars that adorn them. He waits until the boy's soft cries quiet entirely before he continues. “What,” he starts, trying his best to tread carefully. But he can only mince his words so much before they lose their meaning entirely, and he <em>needs</em> Midoriya to understand.</p>\n<p>“Izuku, what… triggers your time loops?”</p>\n<p>He expects the sobs that follow that question. Their time loops can’t possibly be the same, or at least, they can’t feasibly be triggered by the same event. Shouta’s loop is triggered by Midoriya’s suicide. If Midoriya’s loop is <em>also</em> triggered by his suicide, he could have made it stop. The boy certainly seems like he <em>wants</em> to make it stop. There must be another event in Midoriya’s… timeline(?) that's being repeated. An event traumatic enough to bring his student to think that suicide is a favorable outcome to having to live through it again.</p>\n<p>So yes, Shouta expects the crying. It doesn't make the sound any easier on his aching heart.</p>\n<p>He allows his student to pull his knees up to his chest and duck his head as he gasps out desperate sobs. He draws the line as Midoriya begins to pull his hands away from his own. Shouta tightens his grip when Midoriya tries to wriggle away. “Izuku,” he says, repeats it with more urgency when the boy’s breathing picks up to an alarming rate, again when he shakes his head frantically and the sharp movements make him cough and tremble. Shouta does remove his hands from the boys then, though only to tightly grip his upper arms as he tries to keep his kid from falling apart.</p>\n<p>The man's eyes widen as thick pink veins flow into the boys arms and green lightning begins to crackle around them. Shouta doesn't even have the time to <em>think</em> about erasing his quirk before the kid throws his hands off of him and scrambles backwards.</p>\n<p>And oh <em>god,</em> does that make Shouta’s panic flare. Out of every Saturday, he doesn’t think he’s ever been so scared. He’s gotten so far this time, Midoriya was <em>in his arms,</em> just a second ago, but now he’s going to die <em>again.</em></p>\n<p>But Izuku doesn't go to the ledge, and the lightning dies out as quickly as it appeared, leaving the boy a crumpled heap on the roof, a mere few feet away from Shouta. The man reaches his hand out, he's trembling.</p>\n<p>“It’s okay, Midoriya.” He doesn't want to startle the kid. He doesn’t move, resorts to using his surname.</p>\n<p>It turns out that Shouta doesn’t need to worry about startling the kid; the kid is the one to startle him when he immediately yells, “No, it’s <em>not!”</em></p>\n<p>Midoriya is <em>still</em> shaking his head, his hands reaching up to grab at his hair and pull-<em>hard</em>-as he sobs. “It’s <em>not</em> okay!” At this point, Shouta’s afraid he’s going to wake the other students, and surely the presence of anyone else would tip Izuku over the edge-literally. The man begins to scoot over to where the boy has adopted the fetal position. He freezes when his student yells, “You keep <em>dying!”</em></p>\n<p>Shouta feels icy tendrils of dread shoot out from the center of his chest, wrap around his ribcage, flow through his veins, make his fingers uncomfortably numb.</p>\n<p>“You keep dying <em>over</em> and <em>over</em> again and I just want it to <em>stop!”</em></p>\n<p><em>God,</em> Shouta <em>hurts.</em> He <em>hurts so bad.</em></p>\n<p>“Oh, kid.” Is all he says, low and achy. He slowly closes the distance between them. The boy flinches but doesn't pull away as Shouta pries his fingernails from his scalp. He becomes malleable and pliant to his teacher’s touch as all of the fight from before drains pathetically out of him. Shouta drags the kid closer, positioning him to sit in the space between his legs, allowing his ear to rest against his chest directly above his heart.</p>\n<p>“I’m sorry Izuku,” he says, “I’m sorry.” Midoriya scrabbles to grip the material of Shouta’s jumpsuit, crying into his sleeve.</p>\n<p>In between gasps, his student quietly pleads, “Please, <em>please</em> don't die again.”</p>\n<p>Shouta’s lucky that neither Hizashi or Nemuri are around, because as he presses his lips to the boy’s forehead, he knows he’d never be able to live this down.</p>\n<p>“I won’t.”</p>\n<p>Shouta is perfectly content to just sit there on the roof with his kid in his arms. More than content, actually; with the past eighteen Saturdays still fresh in his mind, this is all he’s wanted to do for a <em>long</em> time. So he does. He sits there and allows himself to have this, allows Midoriya to have this as well.</p>\n<p>But it doesn’t take long before Midoriya starts to fidget. His eyes lift from where he had buried them in Shoutas sleeve, and his hands start to lightly but incessantly pull at the fabric. He’s getting anxious, Shouta quickly realizes. While Shouta has achieved his objective of keeping the boy from killing himself, for Midoriya, this is just another Saturday, isn’t it? To him, Shouta is still going to die.</p>\n<p>The thought of that going through his students head spurs him to speak.</p>\n<p>“Kid,” Shouta says finally, “What do you want to do about it?”</p>\n<p>The boy goes still, his confusion is palpable. “What?” He breathes.</p>\n<p>Shouta sighs, he runs his fingers through evergreen locs. He says, “You told me what’s happening, and now we can do something about it. I trust you to make that decision. What do you want to do?”</p>\n<p>He doesn’t say <em>you've already broken my trust eighteen times by ending your life.</em> He doesn’t say <em>the only reason I am trusting you now is because I am able to physically restrain you if needed and thus suicide is currently off the table.</em> Because that wouldn’t be fair to Midoriya. <em>Technically,</em> this Midoriya <em>hasn’t</em> tried to kill himself-at least, not yet. Though, Shouta does have eighteen cases to attest to the fact that the boy <em>was</em> going to.</p>\n<p>Midoriya seems to ponder his words for a minute.</p>\n<p>“The bunker,” He decides, fully un-burying his face from Shouta’s sleeve to pin him with a determined but still teary gaze. “Let’s go to the bunker.”</p>\n<p>Along with the development of the dorm system was the construction of the underground bunker below each building. As a precaution, students were not informed of their existence, seeing as a student could very well become the reason they would need to hide away. These bunkers have yet to be used.</p>\n<p>The fact that Midoriya knows about the bunkers is… interesting. He must have used them in previous attempts to keep his teacher alive.</p>\n<p>Shouta can’t help but wonder how many times Midoriya has led him to the bunker, only for him to die on the way. How many times Midoriya has gotten him to the bunker, only for him to somehow die inside.</p>\n<p>Shouta’s thoughts—as they often tend to do-quickly escalate.</p>\n<p>How many times has he died in front of his student? How many times has Midoriya <em>seen</em> the life leave his eyes? How many times has Midoriya kneeled in a puddle of <em>his</em> blood and felt for a pulse that wasn’t there? How many—</p>\n<p>Midoriya shifts, the movement effectively halting his train of thought. He slowly retracts himself from Shouta’s lap and stands on shaky legs. He then helps Shouta up as well.</p>\n<p>When he is on his feet, Midoriya turns and walks towards the ledge. Shouta is lightning quick in grabbing the boy's shoulders and pulling him back towards himself and away from the edge because <em>hell. no.</em> He’s gotten too damn far this Saturday to let the boy go now.</p>\n<p>Midoriya reacts to being jerked backwards with a yelp. He wriggles uncomfortably in Shouta’s grip and fixes his teacher with a confused and alarmed look. A flicker of understanding enters his eyes a split second later, and he hastens to explain his actions.</p>\n<p>“I- um… my shoes.” He stutters quietly, pointing at the sneakers that very obviously do <em>not</em> adhere to the UA dress-code but have yet to be purged from the boys daily attire, still lined neatly close to the edge of the roof.</p>\n<p>Shouta clenches his jaw, weighing his options. He finally elects to remove his hands from the boy's shoulders, instead offering one for his student to hold. Midoriya stares at it with enough suspicion that it makes Shouta hurt. The boy slowly lifts his hand-scarred and trembling-and reaches towards Shouta’s. Feather light fingers ghost over his palm, hesitant as if he expects to be struck the second they meet. When Shouta makes no move to do so, Midoriya allows his hand to rest in his. Shouta squeezes lightly. They walk towards the shoes together. Shouta’s grip gets tighter the closer they get to the ledge. He has no intention to risk the boy making the impulse decision to rip himself free and take a swan dive.</p>\n<p>Shouta is the one that grabs the shoes, mindful of the note carefully tucked into the right one. Hands still interlocked, they leave the roof.</p>\n<p>He is eternally grateful that the way from the roof to the bunker does not pass the common room. Especially as he hears the telltale commotion coming from that direction meaning that many of the class have woken up and have begun causing trouble.</p>\n<p>On the way, Shouta asks Midoriya if he wants to grab anything from his room before they go underground. The boy’s natural instinct seems to urge him to shake his head, but he stops himself and actually ponders the question. He eventually nods. They stop at the boy’s room, and Midoriya is quick in grabbing a worn notebook and a handful of pencils.</p>\n<p>The two miraculously make it to the entrance of the bunker uninterrupted. Shouta halts in front of the door and sets Midoriya’s shoes on the floor between them.</p>\n<p>“Put those on. I don’t know when the bunker was last sweeped, it may be dusty,” He says, nodding down at the sneakers.</p>\n<p>In response, Midoriya slips his hand from his and crouches down to do what he asked. Shouta pulls out his phone.</p>\n<p>“I am going to send a message to the class,” He says. His student’s head snaps up. Terrified and <em>betrayed</em> eyes meet his own. The boy’s mouth opens as if to object, but Shouta beats him to it.</p>\n<p>“Relax. I currently have no intention of informing them of the situation. From what you’ve told me, it seems that <em>I</em> am the only one in danger. It would be illogical to drag them into this.”</p>\n<p>Midoriya seems relatively calmed at that, but his hands still fumble and shake as he returns to tying his shoelaces.</p>\n<p>Shouta continues, if only with the intention to ease his nerves. “I am simply going to tell them that the both of us will be gone for the remainder of the day, and that Iida and Yaoyorozu will be in charge in my absence.”</p>\n<p>The boy stands after he says this, providing no response aside from a single subdued nod. Shouta pockets his phone after sending the message. He holds out his hand. Midoriya doesn’t hesitate for quite as long as he previously had before taking it. Shouta takes it as a win. They descend the stairs together.</p>\n<p>While informed of its existence, Shouta hasn’t actually seen the bunker in person. Seeing it now is a little surreal. It’s certainly no luxury suite, but he is still pleasantly surprised by the quality of the space. By the number of beds, it seems the bunker was built with the intention of holding a maximum of thirty people. There is a decently-sized kitchenette off to one side of the front room, cabinets filled with basic cookware and a more than generous supply of non-perishable foods. At the other side is a hallway leading to what Shouta assumes would be the bathrooms. He’s also surprised to see everything in immaculate condition. There is not a speck of dust to be seen. He figures the space must be cleaned relatively frequently.</p>\n<p>He stops to stand in the middle of the room, surrounded by fifteen bunk beds. He looks at his student and gestures vaguely to them, letting go of the boy's hand in the process. The kid must get the hint because he looks around for a second, before slowly walking to the closest bed and stiffly sitting down.</p>\n<p>Midoriya looks surprised when Shouta follows and sits on the opposite edge of the bed. He really shouldn’t be. If that boy thinks Shouta’s going to let him out of his sight after what he nearly did then he’s <em>sorely</em> mistaken.</p>\n<p>He kicks off his boots and sits cross legged, leaning against the headboard. Midoriya takes his own sneakers off and shifts to sit at the foot of the bed, knees tucked close to his chest. Shouta doesn’t look directly at his student, but Midoriya still squirms under the weight of his very presence. The boy places his notebook in front of him and reaches into his pocket, pulling out a piece of paper. His suicide note. He tucks it in between two pages and closes the book, seemingly content to not address it. Actually, he seems awfully intent on not talking about what happened at <em>all.</em></p>\n<p>“Midoriya,” he says, not <em>quite</em> with the intention of scaring him but to simply intimidate. It seems he failed when his student flinches. Hands fist themselves in the bed sheets to keep from trembling.</p>\n<p>He attempts to amend his mistake by continuing in a gentler tone.</p>\n<p>“Is… Is this the <em>first time</em> you’ve told me?”</p>\n<p>Midoriya looks up abruptly, and fear gives way to a sort of timid anxiety.</p>\n<p>“Um…” the boy fidgets, picks at a hangnail on his thumb, looks anywhere <em>but</em> at Shouta. “Yeah this is… this is the first time.”</p>\n<p>\n<em>God.</em>\n</p>\n<p>At a loss for words, Shouta simply stares. The boy looks rightfully abashed and a little frightful under his gaze. He hastens to justify his answer.</p>\n<p>“I- sensei, you kept <em>dying</em> and… and there was no time to tell anyone! I had to save you!”</p>\n<p>“You—“ Shouta sputters, eyes wide. “You were going to <em>kill yourself</em> before telling me—or anyone else, for that matter—what was going on?”</p>\n<p>Midoriya waves his hands frantically. “I didn’t think— how was I supposed to know that you would believe me?”</p>\n<p>He states the question like it’s rhetorical, like there isn’t an answer, but there <em>is</em>. One so easy that Shouta flails to think of the reason why the option wasn’t even on the boys radar.</p>\n<p>“By talking to me, Izuku! By telling me what was going on!” He says vehemently. He takes his student by the upper arms and shakes him in his urgency. Willing the <em>simple</em> concept to find purchase in that big brain of his.</p>\n<p>Midoriya’s fear at being grabbed seems to ebb as Shouta makes no further move to physically harm him. His expression morphs quickly into what the hero recognizes as defensive, and <em>angry.</em></p>\n<p>The boy tears his arms from Shouta’s white-knuckled grip, standing up from the bed and taking a few steps back.</p>\n<p>“And what about <em>you?”</em> Midoriya spits.</p>\n<p>If it were a different student using that tone with him, Shouta would have given them detention on the spot. If it were the same student, but a different day, Shouta might have been a little thrilled at the boy’s uncharacteristic act of defiance. But it's not a different student, nor is it a different day.</p>\n<p>It is Midoriya, and it is Saturday.</p>\n<p>So he’s not angry <em>or</em> thrilled, he’s just… confused.</p>\n<p>He squints at his student and asks, “What <em>about</em> me?”</p>\n<p>Midoriya, in a very un-Midoriya-like fashion, does not back down. Shouta wishes he were proud.</p>\n<p>“You said you’re on your nineteenth Saturday, right?”</p>\n<p>Shouta nods.</p>\n<p>“Well how many times have <em>you</em> told someone?”</p>\n<p>And that... gives Shouta pause. But he recovers quickly.</p>\n<p>“That’s,” He shakes his head, “That’s <em>different,</em> Midoriya.”</p>\n<p>“So you’ve never told anyone,” Midoriya says, crossing his arms. He sounds like he thinks he's won some kind of argument, like he’s making some irrefutable point, but he's <em>not.</em></p>\n<p>“<em>I’m</em> the one in charge, there was no reason to tell anyone else when they couldn't help.”</p>\n<p>“Exactly!” Midoriya exclaims and <em>why</em> can’t this kid just <em>understand?</em></p>\n<p>“No!” Shouta almost-yells in response, finally standing. Midoriya takes another step backwards. “<em>I</em> am the adult. <em>I</em> am the one that’s supposed to solve the problems! <em>I</em> am the one you’re supposed to go to!”</p>\n<p>“You. Kept. <em>Dying!”</em> His student responds, enunciating each word.</p>\n<p>“So, what, instead of talking to me about it you were going to kill yourself?”</p>\n<p>Midoriya throws up his hands exasperatedly, turning around. “What does it matter now? You were there and I didn’t die so let’s just <em>drop it.”</em></p>\n<p>For some reason, the boy's flippant attitude is what makes something in Shouta <em>snap.</em></p>\n<p>“But you <em>did!”</em> He yells before he can even consider controlling his words or volume. <em>Shit.</em></p>\n<p>At that, Midoriya freezes and turns slowly back around to face him. The kid is smart, too smart to brush off Shouta’s outburst as a simple slip of the tongue. The man can practically see him putting the pieces together in his mind.</p>\n<p>Infuriatingly, Shouta’s eyes begin to water, as if he hasn’t made enough of a fool out of himself today. He stubbornly presses the heels of his palms against them, half as an attempt to stop the tears, half because he doesn’t want to see the look on Midoriya’s face when he makes the connection.</p>\n<p>Shouta collapses back onto the edge of the bed, elbows resting on his knees as he defeatedly scrubs at his face.</p>\n<p>He is keenly aware of the slowly approaching footsteps that mean the boy is walking towards him. He is also aware of the way the bed dips as a result of the boy taking a seat to his left. He doesn’t open his eyes.</p>\n<p>Midoriya speaks into the silence, “That’s your… loop, isn’t it?” Shouta can hear the boy’s knuckles cracking, can imagine the way he's wringing his hands and pulling his fingers in order to make those sounds.</p>\n<p>“I keep… um… killing myself…”</p>\n<p>Shouta feels a very odd sense of gratification at the way Midoriya seems to be uncomfortable with the subject. Because he <em>should</em> be. His student <em>should</em> be uncomfortable, he <em>should</em> be ashamed. As much as Shouta wants to sympathize with him, Midoriya is <em>wrong</em>. It is <em>beyond</em> baffling to him how his student-whose mind seems to constantly function at a level beyond the majority of those around him-can possibly be convinced that <em>suicide</em> was the most logical solution to his problem.</p>\n<p>How can Midoriya think that it’s even <em>remotely</em> okay that he was going to kill himself before even attempting to talk to a <em>single</em> adult about what was happening?</p>\n<p>Shouta removes his hands from over his eyes when he is finally sure the action won't cause him to immediately burst into tears. A glance at his student reveals that the boy is about as far away from him as he can possibly be while still sitting on the same bed. Under his gaze, Midoriya winces and ducks his head. He averts his eyes and pulls his hands close to his chest in a way that seems almost subconscious. It’s as if his natural instinct is to make himself as small as possible. <em>Interesting.</em></p>\n<p>As he watches the boy’s body tense as if preparing for a physical blow, Shouta finds that his anger wanes. Sure, Midoriya’s entire thought process is <em>beyond</em> wrong, and something that needs to be changed <em>immediately,</em> but mentalities like that are <em>learned.</em> <em>Behaviors</em> like that are <em>learned.</em> The way he cowers when Shouta—or <em>anyone,</em> now that he thinks about it—so much as breathes too heavily in his direction was <em>learned.</em></p>\n<p>That fact paints a pretty horrifying picture for Shouta. Something in Midoriya’s past has <em>conditioned</em> him to cower.</p>\n<p>And what could it have been, but abuse?</p>\n<p>How else could Midoriya be so stead-fastly convinced that no one would ever help him, if not as a result of experience? If not from asking for help again and again, and repeatedly being denied?</p>\n<p>Shouta wonders then, how many times was Midoriya outwardly withheld the help that he needed before the boy stopped asking entirely? How often were his problems minimized by those around him for him to truly be convinced that he need not tell a single soul before committing suicide?</p>\n<p>“Sensei, I… are you… okay?” Midoriya timidly asks once it becomes clear that Shouta has no intention of providing a verbal answer.</p>\n<p>Shouta looks at Midoriya then, and sees nothing but outward concern, as if <em>he’s</em> the one with the problem.</p>\n<p>“<em>No,</em> kid.” Shouta sighs, scrubs his hands over his face.</p>\n<p>“While yes, you <em>are</em> alive right now. I still saw you commit suicide eighteen Saturdays in a row, and I know <em>damn</em> well you’d’ve done it again today, had I not said the right thing.”</p>\n<p>Midoriya’s eyes are wide. He lowers his gaze when Shouta tries to meet it.</p>\n<p>“I’m... I’m sorry, sensei.”</p>\n<p>And <em>of course</em> the kid’s sorry. Shouta has no doubts about that.</p>\n<p>“I know you are.” Shouta sighs, “The problem is that you’re not sorry that you were <em>going</em> to do it, or that you <em>did</em> do it. You’re only sorry because you think you’re burdening me.”</p>\n<p>Midoriya doesn't even attempt to object. He looks nothing short of absolutely <em>mortified</em> at being read so easily. Shouta supposes he’s not used to being given a second glance, not used to being paid attention to. Shouta reaches out slowly.</p>\n<p>“And that isn’t <em>right,</em> Izuku.”</p>\n<p>Midoriya watches Shouta’s hand with such a fearful intensity that speaks of years of being on the receiving end of physical blows.</p>\n<p>He lays his hand on his student’s shoulder.</p>\n<p>“<em>I’m</em> sorry,” Shouta breathes. Midoriya looks like his entire world is crumbling around him. It probably is.</p>\n<p>“This mindset that you have… that no one will help you, is <em>wrong.”</em> He tries to look Midoriya in the eye, but his student’s gaze is clouded. Shouta can only hope that he can still hear him from the corner of his mind that he’s retreated to.</p>\n<p>“And while I <em>personally</em> may not have been the person to instill that mindset, I allowed it to continue without intervention, and that was wrong of me.” Shouta allows the words to settle, watches as each one chisels minutely away at a mindset borne from years of abuse.</p>\n<p>“Izuku, you <em>need</em> help.” He continues, voice low. “Not only that, but you <em>deserve</em> help.”</p>\n<p>Midoriya doesn't move, doesn’t even seem to breathe. Shouta fears that he isn’t hearing him, but then the boy’s eyes begin to water.</p>\n<p>“You deserve care. You deserve love.” Shouta says. Midoriya’s breath hitches.</p>\n<p>“And I’m sorry that no one has been there to provide that for you. I’m sorry that <em>I</em> haven't been there to provide that for you.”</p>\n<p>Midoriya’s body starts to tremble. He blinks a couple times. Shouta can only hope that he’s coming back to him.</p>\n<p>“I want to be there for you. I want to help you, if you’d just <em>let me.”</em></p>\n<p>Midoriya lets out a single sob. As if ashamed, he immediately clamps a hand over his mouth to muffle the sound.</p>\n<p>Shouta leans forward slightly before he says, voice soft. “But you <em>have</em> to <em>talk</em> to me, kid.”</p>\n<p>Midoriya’s eyes finally gain the clarity that Shouta’s been waiting for. The one that means that he actually <em>sees</em> him. Shouta watches as tears flow down the boy's cheeks and over the hand covering his mouth. For what seems to be the thousandth time, his heart breaks for this kid.</p>\n<p>He slowly leans further forward, allowing his forehead to rest on the boy's shoulder.</p>\n<p><em>“Please</em> talk to me,” he whispers.</p>\n<p>And Midoriya does.</p>\n<p>Midoriya’s retelling of what is basically his entire life story has Shouta torn into two equal segments.</p>\n<p>One wants to physically tear Yagi Toshinori into literal pieces.</p>\n<p>One wants to expel the absolute <em>fuck</em> out of Bakugou Katsuki.</p>\n<p>Unfortunately, with his current situation, Shouta is unable to do either of those things at this moment. He settles for comforting the victim of their actions.</p>\n<p>By the time the two have worked through everything, the day is only halfway over.</p>\n<p>Honestly? He’d never have guessed how boring a time loop could be. But hey, Shouta will take boring over the adrenaline rush <em>chaos</em> of the last eighteen days.</p>\n<p>The center of the front room is open enough for them to practice sparring. They manage to kill a few hours that way.</p>\n<p>Midoriya seems relatively content in busying himself with the notebook he brought. Shouta’s curiosity has him frequently peeking over the boy’s shoulder to read his work. He finds himself impressed—astounded, actually—at the boy’s analytical abilities. Sure, he knew Midoriya was smart, but his diagnostic writings are something on the borderline of genius-level. He makes a mental note to contact Nedzu about the potentiality of further cultivating these abilities.</p>\n<p>Even as the daylight wanes, Midoriya remains averse to the idea of falling asleep, but the exhaustion of the day’s events does take its toll eventually. It is only after he hears Midoriya’s breaths begin to shallow with sleep that Shouta feels at ease enough to do the same.</p>\n<p>Shouta wakes without the assistance of an alarm. He bolts upright and, upon the realization that he is not in his own room, and the subsequent remembrance of the events that occurred the Saturday before, quickly pulls out his phone.</p>\n<p>6:52am</p>\n<p>\n<em>Sunday</em>\n</p>\n<p>Shouta could cry.</p>\n<p>He looks over to Midoriya, still curled up on the bed next to his. It is then that he takes notice of the dust. A thin layer coats not only the two of them, but nearly the entire surface area of the room around him. The powder weighs at his eyelashes and rains down from his hair with every movement of his head.</p>\n<p>The sight takes him back to twenty Saturdays ago. To Friday.</p>\n<p>It had been Midoriya’s turn to accompany Shouta on patrol, something he’d been doing with each individual student to give them the smallest taste of what it would be like to be an underground hero. The patrol had been largely uneventful, but of <em>course</em> something had to go wrong. Midoriya was involved, after all.</p>\n<p>The silence of the night had been shattered by a scream that shook him straight to his core. In the moment, he had half a mind to tell his student to stay put, but he figured the kid was probably better off as long he stayed within his sight. They sprinted together towards the approximate origin of the noise, and were brought to an alleyway. A woman was sprawled awkwardly on the ground.</p>\n<p>“Don’t look,” Shouta had said, on instinct. Midoriya looked anyway.</p>\n<p>He strode briskly over to the woman, crouched next to her to take her pulse. It was only as he shifted her wrist that he noticed the very fine layer of dust coating her skin. No, not only her skin; her hair, her clothes, and the <em>entire</em> alleyway around them.</p>\n<p>He had set the woman's arm back down on the ground after he failed to find a heartbeat. The action caused the powder to billow upward, float weightlessly in the air, catch the rays of moonlight and reflect it back outward, giving the alleyway a sort of iridescent glow.</p>\n<p>He had stood, turned to look at Midoriya. His student had been standing with his head angled towards the mouth of the alley and away from him. He held a worn tennis ball in his hand, coated with the same shimmery powder as the rest of the scene.</p>\n<p>Satisfied that Midoriya hadn’t gotten too overwhelmed and fled the vicinity, (something that happened during <em>multiple</em> other student-accompanied patrols,) he called Tsukauchi to take care of the body. After taking Shouta’s statement, the detective had given him a brief rundown of the case. It was the fifth of a string of unexplained deaths—the only connection between them all being the fine layer of dust coating each of the bodies. They had no leads.</p>\n<p>Frowning, Shouta had simply nodded in response, eager to herd Midoriya away from the scene.</p>\n<p>While undoubtedly shaken, the both of them left largely unaffected. Or so he had thought, until now.</p>\n<p>He silently stands. He ruffles his hair and shakes the fabric of his clothes, watching as the dust unlatches from his form and sifts through the air.</p>\n<p>Just as he begins to debate the merits of leaving the bunker to call Tsukauchi, he hears movement from behind him. He turns around just in time to see Midoriya’s face scrunch up slightly, before he wakes with a sneeze, unearthing the dust from his nose and cheeks into a luminescent cloud.</p>\n<p>For a second, the boy’s eyes remain hazy with the remnants of sleep, but they soon burst alight with clarity. His gaze locks with Shouta’s and the boy <em>launches</em> himself forward with a quirk-powered leap, yanking the phone right out of his hand.</p>\n<p>At the screen that greets him, Midoriya immediately crumples to the floor. The movement causes the dust on the ground to billow upwards, shaping into a shimmery plume around him. The sight is almost ethereal.</p>\n<p>Shouta drops to his knees next to him, hand ghosting over his student’s back as he chokes on fresh sobs.</p>\n<p>“It’s okay,” Shouta says. “It’s Sunday. We made it.”</p>\n<p>Midoriya gasps out somewhat of a hysterical mix between a laugh and sob. Still bent over his knees, the boy reaches out blindly. When he finds Shouta’s hand, he grasps it tightly in both of his own and pulls it close to his chest, holding onto it like a lifeline as he rocks back and forth. Shouta allows it, using his unoccupied hand to gently pet the boy's hair as he cries.</p>\n<p>It takes time, but Midoriya’s chokes and gasps eventually quiet. He continues to clutch Shouta’s hand as his whole body trembles.</p>\n<p>“What was it?” Midoriya whispers, perhaps more to himself than to Shouta. “After everything I tried, why did the loop finally stop?”</p>\n<p>Shouta hums quietly. “You told me. You told me everything.”</p>\n<p>His student finally looks up at that. Eyes, bloodshot and swollen, bore into his own. Midoriya huffs out a bitter sounding laugh.</p>\n<p>“God,” He says, removing one hand from Shouta’s to ruffle his own hair, causing a new dust shower to cascade down and onto the floor. “I feel so <em>useless.</em> I can’t believe, after <em>everything—</em> I can’t believe that was the way out.”</p>\n<p>Shouta shakes his head. “We don’t know how this quirk works. We’ll figure it out.”</p>\n<p>Midoriya doesn't seem comforted by his words. His shoulders hunch and he averts his gaze. He’s ashamed.</p>\n<p>“Izuku, listen.” Shouta starts. He moves his hand slowly to tap the underside of the boy’s chin, gently urging him to tilt his head upwards and meet his gaze.</p>\n<p>“You can come to me,” He says quietly. “No matter what, I will <em>always</em> help you. Do you understand?”</p>\n<p>Midoriya squeezes his eyes shut when they begin to water anew. Shouta can't help but wonder <em>how</em> on <em>Earth</em> the boy can fit so many tears in such a small body.</p>\n<p>But then the kid smiles, small but no less boyish and bright, and he says, “I think I’m starting to.”</p>"
}