{
  "id": "25819429",
  "url": "https://archiveofourown.org/works/25819429?view_full_work=true",
  "author": [
    "ShanaStoryteller"
  ],
  "title": "when life gives you lemons",
  "rating": "Not Rated",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "The Witcher (TV)",
    "Wiedźmin | The Witcher - All Media Types"
  ],
  "relationships": [
    "Geralt z Rivii | Geralt of Rivia/Jaskier | Dandelion"
  ],
  "characters": [
    "Geralt z Rivii | Geralt of Rivia",
    "Jaskier | Dandelion"
  ],
  "additional_tags": [
    "Alternate Universe - Different First Meeting",
    "Scent Kink",
    "Explicit Sexual Content",
    "sorry the only way i can write sex scenes is as character studies",
    "Insecure Geralt z Rivii | Geralt of Rivia",
    "Misunderstandings"
  ],
  "language": "English",
  "series": "",
  "published": "2020-08-10",
  "completed": null,
  "words": "7,867",
  "chapters": "1/1",
  "comments": "272",
  "kudos": "6,558",
  "bookmarks": "1,484",
  "hits": "33,176",
  "summary": "<p>The only good thing about Oxenfurt is the brothels. </p>\n<p>~</p>\n<p>Geralt thinks Jaskier is a whore, but really he's just an opportunist.</p>",
  "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>i hope you liked it!</p>\n<p>feel free to follow / harass me at: shanastoryteller.tumblr.com</p>",
  "text": "<p>The only good thing about Oxenfurt is the brothels.</p>\n<p>Geralt tries to avoid it. The whole city is too noisy and too bright and just <em>too much</em>, even more than most cities. But there’d been a big contract to clear out group of drowners and a griffin that’s been killing people and leaving them in pieces in the surrounding forest.</p>\n<p>The mayor paid Geralt half up front. He should be grateful, he knows, but it just makes him suspicious. He’s not even sure of what, specifically. Possibly he’s just suspicious of everyone these days. Not that it matters.</p>\n<p>He has the coin and absolutely no reason not to spend some of it on the city’s one redeeming feature. The brothels have nice, clean rooms and pretty girls who are very good at pretending and not flinching when they see him.</p>\n<p>He doesn’t go to brothels with swords on his back, he doesn’t go in armor, he doesn’t go with his hair uncombed. He hates the sour milk smell of fear they get, and he does what he can to mitigate it. It doesn’t matter if they know he’s a witcher, although they figure it out quickly enough between the medallion and the eyes. He’s off-putting frightening all on his own. There’s something in humans’ often ignored instincts that tell them he’s dangerous and they’re right. They start afraid, but if he softens himself just a little then they’re not terrified, and by the end when they’re <em>both</em> sated, they’re just nervous, which smells like bitter root but is tolerable.</p>\n<p>Sometimes, in Oxenfurt, the girl will start at nervous and end at wary, an almost ignorable mulch scent, and she won’t smell of anxiety when Geralt tugs her into his side, sometimes he can just hold someone for a while and not feel like he’s actually holding them hostage.</p>\n<p>Usually, he’s not that lucky. Usually, the smell of their fear makes him as eager as they are to get it all over with. Usually, when he does get lucky, it’s in Oxenfurt.</p>\n<p>This time he gets very lucky.</p>\n<p>The madame doesn’t hesitate to take his coin, although she does look him over in a way that’s not even slightly sexual and say, “Upstairs, first door on the right. Should be ready, but you might have to wait.”</p>\n<p>That she has someone in mind and isn’t just throwing him at the first free girl means it’s probably worth having to wait for the previous customer to finish. Usually when that happens, he gets to skip over the sour milk fear scent all together.</p>\n<p>Usually.</p>\n<p>But the first door on the right isn’t closed, is already half open, so he pushes it open the rest of the way. He means to clear his throat and ends up swallowing his tongue partway through.</p>\n<p>The whore is a man.</p>\n<p>He’s young, in nothing but his smallclothes and the billowing shirt that goes to the top of his thighs and is open at the chest revealing a chest of thick hair, so he can’t be <em>that</em> young. His skin is tan and unscarred and his hair is thick and deep brown.</p>\n<p>Geralt must make some sort of noise, because the man looks up and Geralt finds himself the subject of two bright, perfectly blue eyes. The smile that steals across the man’s face has to be a reflex, but it looks so genuine that Geralt can’t help but flinch.</p>\n<p>“Well, look at you,” he says, dropping the pair of pants he’d been holding. He crosses the room without hesitating, reaches out a hand and cups Geralt’s face and tilts it to the side.</p>\n<p>Geralt can only stare. People never touch him first, and especially not like this. Not even in a brothel.</p>\n<p>They’re nearly the same height. The look on the man’s face is admiring, and he drags a calloused thumb down Geralt’s cheekbone, ending with it pressed against Geralt’s bottom lip.</p>\n<p>This close, with the man’s wrist practically pressed against his nose, he should be able to smell his fear, it should be overpowering.</p>\n<p>There’s none of it.</p>\n<p>Not the spoiled milk scent, no bitter root, no mulch. Just the thick spiciness of arousal and hints of lemon.</p>\n<p>Lemon is for happiness, for delight. No one smells like lemons around Geralt.</p>\n<p>Even Renfri had smelled of mulch, her wariness sharp in his nose, although he doesn’t know if that had anything to do with him. She’d always smelled like that, no matter where she was or who she was with.</p>\n<p>He’s so thrown that he doesn’t even hear someone behind him until a woman voice says, “Um, are you-”</p>\n<p>“Mariel, I think we’re both all set here,” the man says confidently. “Aren’t we, darling? I’ll do, won’t I?”</p>\n<p>It takes Geralt a long moment to figure out that the man’s talking to him, the endearment distracting him from the actual question.</p>\n<p>The bitter root smell is in the room now, but it’s coming from the girl behind him, not the man in front of him.</p>\n<p>“Yes,” he says, and nearly forgets to breathe when the man uses the opportunity to slip his thumb into Geralt’s mouth. The sting of salt from dried sweat dissolves against his tongue and Geralt is so painfully hard that it’s embarrassing. The man’s barely touched him, but in some ways he’s already touched him so much more than he’d expected to be touched.</p>\n<p>Mariel fidgets, the bitter root souring to something deeper and more unpleasant. “He’s a <em>witcher</em>, Jaskier.”</p>\n<p>Geralt tenses, waits for the man, for Jaskier, to do the same, for his sweet sent to sour.</p>\n<p>He blinks, eyes flickering to Geralt’s chest, to his wolf medallion, but he just shrugs. “Explains the pretty eyes. All witchers have eyes as pretty as yours?”</p>\n<p><em>Pretty</em>? His eyes aren’t pretty, for fuck’s sake. They’re inhuman. He has sickly yellow eyes, just like the eyes of so many beasts he’s killed. There’s nothing pretty about them. Which means he has no idea what to say to that, so he just sucks on the thumb in his mouth instead. Jaskier’s breath hitches and his eyes darken and his scent stays sweet, so Geralt supposes it was the right thing to do.</p>\n<p>“If you’re sure,” she says slowly, but when neither of them answer her, she just sighs and leaves, closing the door behind her.</p>\n<p>The man smiles and drags his thumb against Geralt’s teeth as he pulls it out of his mouth and he tries not to mourn the loss. “You got a name, witcher? Or should I guess? I’ve only heard of one white haired witcher, but I suppose that doesn’t mean there is only one white haired witcher.” Jaskier’s hands reach under his shirt and press against his ribs, dragging rough fingertips over his skin.</p>\n<p>“Guess,” he says, trying not to growl. The only story people tell of him is of the Butcher of Blaviken. If Jaskier’s heard about him, it’s nothing good. He regrets it as soon as he says it, he should have just told him his name, because Jaskier will call him the butcher and he’ll say he’s Geralt and maybe he won’t know that they’re the same person or maybe he will but either way it’s not going to end well.</p>\n<p>If Jaskier notices the downturn in his mood, he doesn’t show it. Instead he steps even closer, pushes himself up to lick up the shell of Geralt’s ear, and says, “Geralt of Rivia, my very pretty witcher, how do you want me?”</p>\n<p>The shock of it is enough that Geralt’s mouth parts as his eyes widen. Jaskier makes a pleased sound and turns Geralt’s face towards him, slipping his tongue into his slack mouth while dragging his hand down his spine. Geralt’s incisors are slightly longer than a human’s, not enough for people to notice normally, but people do usually notice when they’re kissing him, it makes the sour scent thicken before it softens. Sometimes whores don’t kiss him at all, simply turn their faces away, and he doesn’t insist.</p>\n<p>Jaskier either doesn’t notice or doesn’t care, widening his mouth and kissing him more deeply and Geralt shudders and kisses him back, as skillfully as he knows how, and can’t help the smirk curling the edge of his lips when Jaskier moans into his mouth. Jaskier pulls back, but he trails kisses along the edge of Geralt’s jaw, so he can’t really bring himself to mind. “Are you going to touch me, Geralt? Or should I just continue doing to you as I please?”</p>\n<p>He realizes with a start that his hands are still by his sides. “I-” He doesn’t know what to say. Part of him wants to just let Jaskier do as he pleases, wants him to touch him as if he wants him. He’s slept with plenty of people, but no one who’s reacted like this, who’s so blatantly interested and unafraid. He knows Jaskier is only touching him because he’s paying for it, but he can’t hide his scent, he really is enjoying this.</p>\n<p>“Well, I’m going to touch you,” Jaskier declares, sliding a finger in the waistband of his pants and tugging. “It would be a bit easier if you weren’t wearing quite so much, darling. Care to make this easier for me?”</p>\n<p>Unbelievable.</p>\n<p>He kicks off his boots while he pulls his shirt over his head. Jaskier makes a startled sound and he tenses. His torso is littered with scars, evidence of exactly who and what he is, and he expects this to be the point when Jaskier’s starts to second guess all of this.</p>\n<p>But he’s grinning, head tilted to the side as he looks him up and down. “I must have been a very good boy this year,” he says nonsensically, stepping forward to spread his hands over Geralt’s chest, flicking his nipples almost absently. “Can I mark you or will your witcher healing spoil all my fun?” His wariness must show on his face because Jaskier rolls his eyes and clarifies, “If I suck a bruise into your skin will it even show up?”</p>\n<p>No one has ever tried, but he’s been hurt enough to know the answer to that. “An hour, maybe, if you make it deep enough. A couple minutes otherwise.”</p>\n<p>For some reason Jaskier seems delighted. “Sounds like a challenge. I love those.” He undoes Geralt’s pants, pushing them down, and there’s a spike in the spiciness in his scent as he looks Geralt over, his eyes lingering on his cock. “Oh, I’m going to enjoy this,” he says, and everything from his scent to his tone to his face seems to imply that he means it. “Are you going to fuck me? Because I would like that, quite a lot, I think.”</p>\n<p>His cock twitches. That’s not always on the table with men, even if he’s paying for it. At least if he doesn’t want them to be scared. But Jaskier is grinning and eager so he says, “Yes.”</p>\n<p>“Excellent,” he says, grabbing Geralt’s hand and dragging him over to the bed. He makes a detour to toss a bottle of oil onto the mattress and then pushes Geralt onto it. He lets him, lets Jaskier guide him until he’s lying back with Jaskier leaning over him.</p>\n<p>“Seems you have me at an unfair advantage,” he says, tugging on Jaskier’s shirt.</p>\n<p>He blinks. “Oh, right! Should have thought of that, you’re just so distracting.” He pulls his flimsy shirt over his head, and his arms and waist are thick with muscle, just like the gorgeous thighs bracketing Geralt’s hips. “Should we get down to business or can I blow you first? Also I need a bit of stretching if I’m going to be able walk right tomorrow. Unless you’re into that kind of thing, in which case I suppose walking is overrated.”</p>\n<p>Geralt has never had someone talk so much while in bed with him. It’s not unpleasant, exactly, but it’s hard to focus. “I don’t want to hurt you.” That’s familiar territory at least. It’s usually something he has to say more than once when he’s in a whore’s bed.</p>\n<p>Jaskier pauses, his grin softening, and when he leans over to kiss Geralt that’s soft too. “Well aren’t you sweet,” he mutters, kissing the corner of Geralt’s mouth. “Sweet and pretty and all for me.”</p>\n<p>He doesn’t understand anything that’s happening right now, so he just kisses him back.</p>\n<p>Jaskier cups his face while he kisses him, which isn’t something people usually do. He can’t tell if he likes it. Eventually Jaskier kisses lower, dragging his teeth down Geralt’s neck with just enough pressure to make him hiss, and then across his chest. He pauses at his sternum, and Geralt thinks for a moment that he’s looking at the amulet, but then he nudges it aside with his nose and says, “Just, sorry, one minute,” and Geralt thinks he’s going to get up for something but just presses his face into Geralt’s chest, opens his mouth, and starts kissing and licking and sucking one spot.</p>\n<p>He’s trying to give him a damn love bite in the middle of his chest.</p>\n<p>Geralt laughs, but Jaskier just lifts a flailing hand up to smack it over his mouth. He’s smiling, not able to dredge up any irritation, and tilts his head just enough to take three of Jaskier’s fingers in his mouth at once.</p>\n<p>Jaskier groans, but doesn’t pause in what he’s doing, so Geralt sucks on his fingers and moves his tongue between them, careful to keep them out of the way of his too sharp teeth.</p>\n<p>Finally he lifts his head and demands, “For fuck’s sake, Geralt, can I get my mouth on your cock or can’t I?”</p>\n<p>“Not stopping you,” he answers, startled at the force of it. Jaskier is the strangest whore he’s ever slept with. Not that he’s complaining.</p>\n<p>He rolls his eyes then glares at his chest. Geralt looks down and sees a bruise that’s already faded to pale lavender and dark red. “That didn’t last very long at all,” Jaskier huffs. “This really is a challenge.”</p>\n<p>Apparently the only part of Geralt being a witcher that Jaskier finds offensive is his inability to leave marks on him. This man is ridiculous.</p>\n<p>Jaskier lets out a disappointed hum before continuing his trail of kisses down his chest, stopping at his cock. He hums, tilting his head to the side, and says, “I don’t know if I can manage to get all that down my throat.”</p>\n<p>Most people can’t. “Don’t worry about it.”</p>\n<p>“Oh, I’m very worried about it,” he says, patting Geralt’s thigh. “I told you, I like a challenge.” He spreads Geralt’s legs a little wider to make room for himself between them, wraps his fingers around the base of his cock, then leans over to slide his lips over it until the head hits the back of his throat. He adjusts his position so he can start nudging it down his throat before pulling back and doing it all again.</p>\n<p>“Jaskier!” Geralt fits his hands in the sheets to keep from grabbing onto Jaskier. He looks up at him from between his thighs, mouth obviously occupied but his bright blue eyes crinkled in the corners like he’s smiling. He reaches out and grabs Geralt’s hand, tugging at until he lets go of the sheets, and then places it against the back of his head. He curls his fingers into Jaskier’s hair, trying to still be gentle and biting his bottom lip to muffle his groans and gasps.</p>\n<p>Jaskier is good at this. Most whores are good at it, but Geralt doesn’t usually enjoy it this much. He’s had more experienced blowjobs, once a girl took him down to the root on the first try and her smugness at his surprise almost made up for the bitter root scent on her skin, but he’s never had a more enthusiastic one. Jaskier really seems like he’s enjoying this, and Geralt doesn’t know if it’s because it’s still early in the night so he hasn’t tired himself out yet or something else, but he knows it’s not fake, not entirely. Every time he ducks back down he takes Geralt a little deeper, just that much more down his throat, and it takes everything he has not to rock his hips into it, not to choke Jaskier by moving too fast. He’s clearly working up to it, and Geralt getting impatient won’t get him there any faster.</p>\n<p>It takes several long minutes, but then Jaskier’s nose is pressed to his skin, his cock nestled in the warm heat of his throat as he swallows around him, and Geralt honestly doesn’t know what’s more arousing – the tight, wet heat or the way Jaskier’s doing his best to smirk around his cock. “If you want me to fuck you,” he says, strained, “this is the wrong way to go about it.”</p>\n<p>Not that it’ll really be a disappointment if he’s changed his mind, not that Geralt is at all upset at the idea of coming in his smirking mouth.</p>\n<p>Jaskier pulls himself off with an obscene sound that almost makes Geralt want to yank him back into place. He rests his cheek against Geralt’s thigh, lips red and shiny with spit, his mouth looking faintly used in a way goes straight to his cock. “Fuck,” he rasps, “Essi is going to kill me for fucking up my voice. Worth it.”</p>\n<p>“Your voice?” he asks, because if he doesn’t focus on something else, he’s going to come the moment Jaskier touches him, which obviously isn’t what he wants. He wants to enjoy this while he has it, wants to enjoy Jaskier while he has him.</p>\n<p>“I sing,” he says absently. “I don’t usually do that, but just look at you, how could I not?”</p>\n<p>Geralt doesn’t know for sure if he’s lying, but if he is then he’s doing an exceptional job at it. He doesn’t know what to say in response. “Oh.”</p>\n<p>He hauls himself up. “You going to fuck me now?”</p>\n<p>His cock gives in interested twitch at that. “The oil?”</p>\n<p>“Taken care of,” he says, getting to his knees, and Geralt’s sucks a breath in. The hand Jaskier hadn’t been using to keep his cock steady is glistening, and he can see hints of that same oil between Jaskier’s thighs.</p>\n<p>Jaskier had been working himself open while he’d worked Geralt down his throat.</p>\n<p>It’s probably for the best he hadn’t known that, actually, because he would have come far before he’d wanted to.</p>\n<p>Jaskier grins, something knowing in the glint of his eyes. “Like that, do you?”</p>\n<p>“Come here,” he growls, tugging Jaskier up to kiss him.</p>\n<p>He reaches between Jaskier’s legs, because he wants to be sure, but he slips two fingers in easily and a third with only a token resistance and a groan into his mouth. “Do I pass inspection?” Jaskier pants, licking the tip of his nose in a way that’s clearly supposed to be annoying but Geralt thinks is actually kind of adorable.</p>\n<p>“I don’t want to hurt you,” he repeats, because he doesn’t, he never does with anyone, but especially Jaskier, especially now. He’s seemed to enjoy this so far, seemed to enjoy Geralt so far. He doesn’t want that to change, he wants to continue to melt into the scents of spice and lemon, of arousal and pleasure.</p>\n<p>There’s a pause, and then Jaskier kisses his forehead, so unexpectedly tender that Geralt can’t help his surprised intake of breath. “So sweet,” he mutters, and for some reason that’s what causes heat to flush across Geralt’s cheeks. “Is like this okay or do you want me under you?”</p>\n<p>“Like this,” he says. That way Jaskier will control the pace and Geralt won’t have to pay attention or worry about going too quickly like if it was the other way around. Jaskier leans back, sitting upright with his knees squeezing Geralt’s hips as he reaches beneath him, feeling for Geralt’s cock and nudging it against his entrance.</p>\n<p>The sound Jaskier makes as he sinks down onto his cock is going to be seared into his head for the rest of his life.</p>\n<p>He doesn’t know how he’s ever going to manage to be with another person soaked in fear after this, when he has the memory of his nose filled with the scent lemons and Jaskier taking him so perfectly, his head thrown back and his thighs trembling with effort as he takes him inch by inch. When he’s fully inside him, Jaskier shifts his hips, getting used to the feeling, and Geralt asks, his voice hoarse, “Okay?”</p>\n<p>“Oh, we are so past okay,” he says breathlessly, his voice still with that hint of raspiness. He rides him, moving slowly, and Geralt raises his hands to grip Jaskier’s thighs, digging his fingers into the muscles just shy of bruising. Jaskier gasps, then pauses and says, “I have an idea. A girl did this to me once and I loved it. Bend your knees.”</p>\n<p>Geralt raises an eyebrow, but does it, pressing his feet flat against the bed and pushing his knees up. Jaskier grins and leans back, pressing the smooth skin of his back against Geralt’s thighs, changing the angle so Geralt is impossibly even deeper inside him and forcing a groan from his mouth that Geralt tries and fails to choke back.</p>\n<p>Jaskier grins, a sheen of sweat all over his body, and starts twisting and rocking his hips, short little movements that shouldn’t amount to much but make Geralt’s blood feel like it’s on fire. “Fuck!” he shouts, and he’s definitely going to leave hand shaped bruises on Jaskier’s thighs, but Jaskier doesn’t seem to mind, too busy making breathy little gasps as he fucks himself onto Geralt’s cock.</p>\n<p>Geralt doesn’t thrust into him, even though he desperately wants to. Instead he just holds on, lets Jaskier does what he wants and tries to survive it. He could come right now but he does everything he can not to, not wanting this to be over.</p>\n<p>Jaskier slows and Geralt growls, a sound he regrets making, but Jaskier only laughs and says, “Darling, if we keep going, I’m going to come.”</p>\n<p>“Like this?” he asks, taken aback.</p>\n<p>Jaskier’s skin is all flushed as he nods jerkily. “Like this. You feel amazing.”</p>\n<p>“Then do it,” he says, part challenge and part plea. He jerks his hips up just once, just to get Jaskier moving again.</p>\n<p>“Ah!” he cries, blue eyes wide, and Geralt worries for a moment but nothing about him smells like pain and he goes back to what he was doing, leaning back against Geralt’s thighs and writhing on his cock. He can tell when Jaskier is close by the way his movements go from smooth and controlled to jerky and uncoordinated, and then he’s coming with a keen, covering Geralt’s hands with his own and his come striping over Geralt’s stomach, his cheeks an attractive shade of red and his eyes unfocussed.</p>\n<p>His movements slow as he takes in great gasps of air, trying to catch his breath, and Geralt is so fucking hard and wants to move so badly, but he doesn’t. He just watches Jaskier settle back in his skin, overwhelmed with the smell of spice and lemon.</p>\n<p>Jaskier lets out a little laugh, shaking his head. “So polite, giving me time,” he mutters, a lopsided grin on his mouth. “My polite, sweet, pretty witcher.” He raises Geralt’s hand to his mouth and presses a kiss to the back of it. Geralt doesn’t think anyone’s ever kissed him there before. “You’ve been so polite, so good. But you can touch me, you know? I won’t break.” His grin turns sly. “Of course, if you <em>want</em> to just lie there and take it, that’s fine too. But you can touch me. You don’t have to be so careful.”</p>\n<p>Geralt’s eyes are too wide, his breath coming in too short, but he can’t make it stop. All of his interactions with humans are careful. They have to be. Because they look at his eyes, and they don’t see pretty. They see a monster’s eyes in a man’s face, and the best he can hope for is when people look at him they see <em>not human, but human enough</em>, and so rarely does he get even that.</p>\n<p>He yanks Jaskier down and rolls them over, so Jaskier’s on his back with his legs spread, Geralt on him, in him, and braces his arms on either side of Jaskier’s head, completely surrounding him, boxing him in. Humans hate that.</p>\n<p>Jaskier’s smiling and all Geralt can smell is lemons.</p>\n<p>“Okay?” he asks, more quietly than he means to, but unable to make himself be any louder.</p>\n<p>“Darling,” he says, droll and wicked something from his dreams and nightmares both, “<em>fuck me</em>.”</p>\n<p>Geralt’s snapping his hips into him before he can think not to. Jaskier’s already came, but he moans and wraps his legs around Geralt’s waist anyway. He locks his wrists together behind Geralt’s neck, pulling him in even closer, until Jaskier can kiss him and gasp into his mouth.</p>\n<p>He comes inside Jaskier, fucking into him with the last few desperate thrusts as he mouths at the side of his jaw, panting. He slows, turning his head just enough kiss Jaskier properly, something in him going soft and liquid at the satisfied hum in his mouth. Geralt pulls out of him carefully then falls onto the bed next to him, more exhausted than he can remember being in a long time.</p>\n<p>Jaskier turns so they’re both on their sides, face to face with barely any space between them. It seems more intimate, somehow, than when Geralt had been inside of him. Jaskier reaches out, cupping his jaw and pressing his thumb against Geralt’s bottom lip, just like he had before. “Good?” he asks, lips curled up in the corners.</p>\n<p>“Good,” he says, eyes heavy.</p>\n<p>Jaskier’s face is so soft and fond that Geralt thinks it can’t be directed at him, even though it’s just the two of them here. He pulls himself closer, “Come on, Geralt, it looks like you need it.”</p>\n<p>Geralt doesn’t know what he’s talking about, but follows the direction of Jaskier’s hands and is only confused when he finds himself half sprawled over Jaskier, his head on his chest and his leg tangled between Jaskier’s.</p>\n<p>Jaskier rubs a hand up and down his back, soothing and electrifying at the same time. He presses a kiss to the top of Geralt’s head. “Get some sleep, my polite, sweet, pretty witcher.”</p>\n<p>He snorts, but feels nearly boneless already, too heavy on top of Jaskier, but he’s not complaining or pushing Geralt aside. There’s some reason he shouldn’t be doing this, he knows, but he can’t think of it. This is most of what he really wants anyway, more than sex he just wants to be able to touch and be close to someone without them flinching.</p>\n<p>Jaskier’s heartbeat is steady and he smells like contentment, the gentle tugging as he runs his hands through Geralt’s hair not distracting enough to keep him from sighing and giving in to the lull of sleep.</p>\n<p align=\"center\">~</p>\n<p>When Geralt wakes up, it’s hours later and he’s alone. He can’t bring himself to be that disappointed however, because the bed is still warm from Jaskier’s body. He must have just left. Maybe that’s even what woke him up. He worries for a moment that he’s overstayed by falling asleep, but dismisses it as soon as he has it. This is a whorehouse. If they’d needed the room, they would have kicked him out of it.</p>\n<p>He reaches up to run a hand through his hair, then pauses, running a cautious palm over the top of his head.</p>\n<p>There’s a small mirror in the room when he faces it he can’t help the short bark of laughter. His hair is braided back, a neat fishtail braid that doesn’t look too terrible or out of place on him, so he doesn’t bother to undo it. He likes the image of it anyway, not the braid necessarily, but of Jaskier carefully plaiting his hair together as he slept. It’s a quiet, sweet image.</p>\n<p>Then he looks down and he feels neither quiet nor sweet.</p>\n<p>On the place where his hip and his waist meet is a deep, black bruise the exact shape of Jaskier’s mouth. He presses his thumb into it, feeling a dull, easily ignored ache at the pressure. Jaskier must have sucked this into him while he was sleeping. It’ll last maybe another hour.</p>\n<p>Geralt tries to think of when he’d felt comfortable enough to sleep that deeply, to the point where he didn’t wake up to someone braiding his hair or mouthing at his hip, and honestly can’t remember.</p>\n<p>Maybe it wasn’t about comfort.</p>\n<p>Maybe it’s that it was Jaskier, who’d been bright and happy and hadn’t been afraid for a second, and that’s why Geralt hadn’t woken up.</p>\n<p>He presses his thumb into the bruise again and can’t help his smile.</p>\n<p align=\"center\">~</p>\n<p>The thing about griffins is that their night vision is shit. Which means they don’t hunt at night, which means Geralt ends up fighting and beheading it in the middle of the day.</p>\n<p>His vision is nearly as good at night as it is in the day. He prefers fighting monsters at night when he’s in the city, because then he can deliver the head at night, rather than having to walk through loud, crowded streets with it. This time is worse than usual, his potions still coursing through his veins so his skin even paler than normal and his eyes a dark black when he delivers the griffin’s head to the alderman. He gives Geralt the second half of his payment without argument, but the thick sent of spoiled milk means that Geralt can only bring himself to accept with a tight nod. The dirt and blood clinging to him probably isn’t helping.</p>\n<p>People are always at least nervous around him, but as he walks through the city back to the tavern, the only thing he can smell is rotting milk as everyone cringes away from him. It’s so cloying and overpowering that he can’t help the scowl carving its way into his face, and he knows it doesn’t exactly help, but he can’t force his face into anything else with that rancid smell filling his nose.</p>\n<p>Then there’s hint of sharp lemon cutting through the rest of the smells and he breathes in to get more of it, something familiar about the scent just under it that he can’t quite put his finger on.</p>\n<p>“Geralt!”</p>\n<p>Fuck.</p>\n<p>He doesn’t run away, because that would be ridiculous, but he wants to. Of course the person he wants to least see him like this is the person that finds him in the middle of busy street. When has his luck ever run any other direction? He glances around, but there’s nowhere to hide, not when Jaskier has already seen him. He hates this. Jaskier might have been foolish enough to not be afraid of him with how he was at the whorehouse, clean and weaponless, but like this, filthy with his swords and armor and his eyes still bleeding black, Jaskier’s scent is sure to shift from sharp lemon to sour milk.</p>\n<p>Jaskier dodges around people to get to him, a lute over his shoulder and wearing bright, fancy clothes that make him look smaller than he is, that give him the appearance of being trimmer by downplaying the strength and size of his thighs and arms. He stops in front of him, eyes wide as he looks him over. “Wow.”</p>\n<p>Geralt braces himself for it, tells himself that this is how humans always react, and just because it’s Jaskier, just because it’s a whore he fucked, doesn’t mean anything different. Thousands of humans have looked at him and felt fear. Its what always happens and it doesn’t mean anything.</p>\n<p>But Jaskier just tilts his head to the side and reaches out a hand. Geralt flinches, but doesn’t move away, because he’s an idiot. Jaskier has to notice the movement but pretends not to, stepping even closer until he can cup the side of Geralt’s dirty face and press his thumb against his bottom lip. “Are you hurt?”</p>\n<p>He has no idea what’s happening. He doesn’t want to shake his head in case it makes Jaskier takes his hand away, so he just says, “No,” while doing his best to move his lips as little as possible.</p>\n<p>“Good,” he says, “then I don’t have to feel guilty about how delicious you look right now. I miss the gold in your eyes, but I really must say,” he looks him over again, deliberately, “this is all quite a look.”</p>\n<p>His eyes aren’t gold, that makes them sound – pretty. They’re yellow, sallow yellow, like a monster’s, yellow like sickness. And they’re black now, something more like a nightmare than a monster. He takes a deep breath, wondering if perhaps he was poisoned without noticing it and this is all some sort of hallucination, but that just means he inhales lemon and under that the spiciness of arousal.</p>\n<p>Jaskier really is attracted to him right now.</p>\n<p>He doesn’t know how to respond to any of this.</p>\n<p>A grin curls into the corner of Jaskier’s mouth. “If I didn’t have somewhere to be, I’d ask you follow me into a dark alley. But Shani already gave me shit for having to heal my throat, so I don’t think she’d appreciate having to deal with whatever’s left of me after Essi eviscerates me for being late.”</p>\n<p>His heart is steady, his grin easy. If he’s lying, he’s doing a very good job of it.</p>\n<p>He shifts his hand back so he’s holding onto the back of Geralt’s neck, and usually Geralt wouldn’t tolerate that at all, but Jaskier is still so close and smells so good. “You’ve still got my braid in. I suppose my love bite is gone?”</p>\n<p>It had faded by the time he’d gotten back to his room and pushed his pants down to check. He hadn’t felt disappointed, because that would be ridiculous, but – he’d have like it, if it’d still been there. “Yeah.”</p>\n<p>“Pity,” Jaskier says, “but I suppose that means I’ll just have to give you a new one.” Before Geralt can do more than blink at the implications of that, Jaskier is using his hand on the back of his neck to pull his closer, pushing himself up that extra inch so he’s tall enough to press his mouth’s to Geralt’s.</p>\n<p>Geralt kisses back automatically but doesn’t grab onto him, mindful of Jaskier’s clean, fancy clothes and not wanting to dirty them. Jaskier is kissing him in the middle of the crowded street of Oxenfurt while the sun is still high in the sky, is kissing him while he’s dirty and the effects of his potion are making him look even less human than usual, is kissing him at his most terrifying, but he still only smells of lemons and spice.</p>\n<p>They pull apart and Geralt mutters, “You’re mad,” against his mouth before he can think not to.</p>\n<p>Jaskier laughs, the sound nearly as bright as his eyes, and Geralt smiles without meaning to. “You know, Geralt, you’re not the first person to say that to me.” He gives him a quick kiss on the side of his mouth, then grins at him as he continues towards whatever it is he can’t be late to. He shouts over his shoulder, “Bye, pretty witcher! Take a bath!”</p>\n<p>Geralt doesn’t laugh at the he looks of incredulous horror that everyone is directing towards Jaskier, but it’s near thing.</p>\n<p align=\"center\">~</p>\n<p>His coin purse is heavy. He’s heard rumors of work in Posada, but nothing concrete, so there’s no reason to rush from Oxenfurt. Ignoring that he hates the whole city except for whorehouses. Except for one whore in particular.</p>\n<p>He’s not naïve. He knows that Jaskier’s friendliness isn’t real, that it’s part of what he’s selling, part of what his customers are paying for. Geralt knows that. But he also knows that Jaskier’s arousal and his lack of fear <em>are</em> real. That’s rare enough all on its own, valuable enough all its own, that he barely cares about the rest of it being a lie.</p>\n<p>Jaskier doesn’t really like him, probably kissed him in front of the whole town just because he thought it’s be a way to get a paying customer to return, to get Geralt to come see him one more time.</p>\n<p>He’s right.</p>\n<p>Geralt goes back to the whorehouse. He takes a bath, because he had been disgusting, but doesn’t bother to try and soften himself like he usually would, keeps his armor on and his swords strapped across his back. Jaskier knows what he is, has seen him looking far worse just this morning.</p>\n<p>The madame raises an eyebrow when she sees him and for some reason she seems amused, of all things, which isn’t the reaction he usually gets. “Is Jaskier available?” he asks bluntly. If he’s not – well, Geralt had been willing to wait before, when he hadn’t even known what he was waiting for. He’s perfectly willing to wait now.</p>\n<p>Her eyes widen and she throws her head back and cackles. “Mariel!” she snaps, and the same girl who he’d seen before enters from a back room. “The witcher wants to know if Jaskier is <em>available</em>.”</p>\n<p>Marial raises a hand to hide a smile, and there’s clearly some joke that Geralt isn’t in on. He shoves down his spike of irritation. “Is that a yes or no?”</p>\n<p>“Master Witcher,” the madame says, and the sour smell of fear has gentled into wariness, tempered even further be her amusement. “Jaskier is a beloved patron of our establishment, not employed by it.”</p>\n<p>He stares.</p>\n<p>“You came in as he was leaving,” Mariel explains. “I was the one intended for you, before Jaskier saw you, and well. Who was I to argue?”</p>\n<p>There’s some sort of reasonable response to this, he’s sure, he just can’t imagine what it would be.</p>\n<p>“He plays at Rosemary and Thyme quite often, if you’re looking for him,” she continues. “Otherwise you can find him at Oxenfurt.”</p>\n<p>“Oxenfurt,” he repeats, sure that he’s heard her wrong while knowing that he hasn’t. It’s the most prestigious university on the continent.</p>\n<p>The smell of amusement almost but not quite overpowers the wariness. Her face doesn’t show it beyond a slight twitch of the corners of her mouth. “Do you need directions?”</p>\n<p>He shakes his head and barely remembers to incline his head to both of them before stepping outside. He tilts his head into the cool night breeze, hoping it’ll help him make sense of all this. It explains Jaskier’s pretty silk clothes, at least, if nothing else. He shouldn’t press it, shouldn’t pursue it, should go back to the inn and get a good night’s sleep before leaving early tomorrow morning.</p>\n<p>That would be the smart thing to do, anyway. So of course he ends up outside the tavern Mariel had told him, and he can hear singing, a deep rich male voice twining with a lighter, feminine one.</p>\n<p>He steps inside, keeping to the back with his hood up. The way a fond smile instantly finds it’s way to his lips without his permission is all the reason he needs to slip back out unnoticed, but he doesn’t.</p>\n<p>Jaskier is singing and playing his lute while a pretty blonde woman sings next to him. It’s an old song, one Geralt has heard many times before, but never sung quite so well. They dance around the stage, the occupants of the tavern clapping and egging them on, apparently familiar both with them and the song. The finish, bow, and collapse into the nearest table to loud applause. A barmaid drops two tankards of ale in front of them and they clink them together before sipping even as another performer takes the stage.</p>\n<p>Geralt moves closer before he can think better of it, picking up on their conversation even from clear across the tavern.</p>\n<p>“You’re sure you won’t join me, Essi? We’re brilliant together,” Jaskier wheedles.</p>\n<p>She snorts. “On your insane plan to travel the continent? No, thank you, I’ll take my cushy job at Redania’s court. Before you say it, yes, I know it’s only backup vocals, but that’s how everyone starts. You’d be smart to join me, or take up Professor Kusia’s offer to be his aide.”</p>\n<p>“Poetry is a fine meal but I can’t live on it alone,” he says, words coming out as a scoff. “I’m not interested in wasting away in these halls writing sonnets, no matter how flattering Kusia’s opinion is of my talent. I need to see the world, Essi! What will I do, write about these city streets and broken hearts forever?”</p>\n<p>“If your other option is as a traveling bard, then yes,” she says, derisive. “You know that only the really famous ones bother with that, when they can count on positions and coin wherever they go. You’ll go hungry.” She’s not scolding anymore, if anything her words are tinged with concern.</p>\n<p>“A traveling bard is how all the best ones start,” Jaskier argues. “Just because I’m educated doesn’t mean I can turn my back on the traditional path of our people. I’m going to see the whole world and sing of its every corner. No court will be able to hold me except for the court of the wide open sky.”</p>\n<p>She laughs, shaking her head. “Well, when the court of the wide open sky puts no bread in your belly, feel free to come to whatever court I’m at. I’ll feed you and you can tell me of the world while I count your ribs.”</p>\n<p>Jaskier huffs, but he’s still smiling at her.</p>\n<p>Geralt is finally close enough for them to notice. Essi’s face pales and she grips her tankard so tightly her knuckles go white, the spoiled milk scent of her fear hitting immediately. Jaskier frowns then follow’s Essi’s gaze, those brilliant blue eyes landing on his own. “Geralt!” he cries, pushing his chair back to get to his feet.</p>\n<p>“That’s Geralt?” Essi hisses.</p>\n<p>Jaskier doesn’t answer her, too busy smiling at him, and then Geralt can’t smell fear, Essi’s or anyone else’s, instead he’s surrounded by the scent of lemons. “Did you hear us? We’re rather brilliant, aren’t we?”</p>\n<p>“Hm,” he says, because they were very good. “Can I talk to you?”</p>\n<p>“We’re talking now, aren’t we?” Jaskier asks, teasing, as he steps even closer, his eyes dropping to Geralt’s lips for a moment before focusing on his eyes once more.</p>\n<p>Would Jaskier really kiss him here? In front of his friend, in front of all these people whose good opinion he values, in a place he frequents? Surely not, that’d be ridicu-</p>\n<p>Jaskier’s soft lips are on his own, his hands curled into the straps of his armor, and Geralt gives a soft huff of incredulous laughter that Jaskier uses to deepen their kiss, licking into his mouth and biting his bottom lip. Geralt kisses back, because if Jaskier is going to be brave and reckless enough as to kiss him, it seems like the least Geralt can do is kiss him back. He pulls back after a moment, more than aware of all the eyes on them even if Jaskier isn’t. “This,” he says, “is not talking.”</p>\n<p>Jaskier pouts, his lips red and slick. Geralt only raises an eyebrow and does not kiss him again. “Oh, alright. We’ll talk outside, yeah? I assume you don’t want to do it while everyone’s staring at us.”</p>\n<p>Maybe he’s not oblivious, then. Just stupidly brave.</p>\n<p>“Jaskier!” Essi shouts. “He’s – you know what he is! You can’t be serious?”</p>\n<p>“As the grave,” he says cheerfully, picking up his lute and slinging it over his shoulder. “Have a good night, Essi. I’m planning to.”</p>\n<p>She’s pale and furious, worry coming off her in waves, but Jaskier doesn’t look back as he grabs Geralt’s hand and leads them out of the loud tavern and away from the hustle and bustle of the main road, until they’re walking down one of the side streets still lit by the soft glow of open shops but not quite so covered in people. Jaskier is still holding his hand. “Jaskier,” he says, when it becomes clear that Jaskier isn’t going to say anything, seemingly content to wander through the city humming under his breath with their hands intertwined.</p>\n<p>“Sorry about Essi,” he says. “She means well and she’d warm up to you quite quickly, I think. She just doesn’t handle being surprised well. I did tell her that you were a witcher, though, so it’s her own fault for not believing me.”</p>\n<p>The idea of Jaskier talking about him to his friends does something strange to the center of his chest, but he ignores it for now. “You’re not a whore.”</p>\n<p>Jaskier pauses, turning to face him, his eyebrows pressed together. “Uh, no.”</p>\n<p>“I thought you were one,” he says.</p>\n<p>“Why would you think,” he starts, then falls silent, clearly running their first meeting over in his mind. “Okay, well, I can see why you would think that, actually, but no, I’m not. Why? Do you have something against whores? Bit hypocritical of you, if you ask me.”</p>\n<p>He rolls his eyes. “No. Whores fuck you for coin.”</p>\n<p>Jaskier blinks then raises an eyebrow. “Well, yes. That is their job, I believe, given my understanding of their profession.”</p>\n<p>“You’re not a whore,” he repeats.</p>\n<p>“Yes, Geralt, we have already established that,” he rolls his eyes, but then he says, “Oh,” and Geralt knows he understands. He raises their clasped hands and presses a kiss to Geralt’s knuckle, and it’s so small, such a little thing, but Geralt can’t keep his breath from hitching anyway. “You’re just so beautiful. I couldn’t lose my chance to touch you. Then you had to be so sweet, so polite, so <em>nice</em>.” He gives a soft laugh, shaking his head. “You’re really quite devastating, Geralt.”</p>\n<p>His chest feels tight, his throat burning with all the things he doesn’t know how to say, so instead he kisses Jaskier again, as gently as he knows how.</p>\n<p>Jaskier kisses back, not gently at all, and Geralt laughs again. “My room’s this way,” he says, “if you want.”</p>\n<p>“Darling,” Jaskier says, using his free hand to cup Geralt’s cheek and press his thumb against his bottom lip, “there’s nothing about you that I don’t want.”</p>\n<p align=\"center\">~</p>\n<p>Geralt leaves for Posada the next morning. His hair is braided back and there’s a fading love bite on his hip.</p>\n<p>Jaskier strums his lute at his side, chatting excitedly of the adventures they’ll have and the songs he’ll sing, his eyes a perfect, brilliant blue in the rising sun.</p>\n<p>Geralt smiles at him and breathes in, the scent of lemons heavy on the back of his tongue.</p>"
}