{
  "id": "2594684",
  "url": "https://archiveofourown.org/works/2594684?view_full_work=true",
  "author": [
    "xylodemon"
  ],
  "title": "Unknown Quantities",
  "rating": "Explicit",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Supernatural"
  ],
  "relationships": [
    "Castiel/Dean Winchester"
  ],
  "characters": [
    "Dean Winchester",
    "Castiel"
  ],
  "additional_tags": [
    "Future Fic",
    "Getting Together",
    "Didn't Know They Were Dating",
    "Human Castiel",
    "Bottom Dean",
    "Angst and Humor",
    "First Time",
    "Podfic Available"
  ],
  "language": "English",
  "series": "",
  "published": "2014-11-10",
  "completed": null,
  "words": "8,570",
  "chapters": "1/1",
  "comments": "441",
  "kudos": "17,837",
  "bookmarks": "3,212",
  "hits": "195,819",
  "summary": "<p>No one ever tells Dean anything.</p>\n<p>(or: Dean Winchester and the not-relationship crisis of 2014)</p>",
  "notes": "<p>Spoilers for 10x04.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>",
  "text": "<p>Cas kisses like he's desperate for it, all tongue and teeth, one hand knotted in Dean's hair and the other twisted in the front of Dean's shirt. He crowds Dean back against a tree, and he makes a low, urgent noise deep in his throat; his thigh starts nudging between Dean's, slow pressure, and it's so unexpected that Dean wastes the first ten seconds of it standing there like a complete doof. Then he moans and pulls Cas closer — because it's Cas, and Dean has wanted this longer than he cares to admit, and Cas is tugging on his hair in just the right way — but then his brain reboots and catches up with his dick and he tries to pull away because — well. <i>Because.</i></p>\n<p>\"Be quiet,\" Cas says, rough. \"Just let me — let me.\"</p>\n<p>And Dean does, even though it's a terrible idea — not the <i>worst</i> idea either of them has ever had but easily in the top twenty-five or thirty. Dean understands the needy, jittery adrenaline spike that comes with a good fight — it's one of the reasons he used to hit the bars the minute he'd washed the blood and dirt from his hands and face — but Cas is still pretty new to this whole human thing, and he has only worked a few jobs without having everything buried under his grace. Dean shouldn't kiss the skin below Cas' ear, and he shouldn't let his teeth catch on the cord of Cas' neck, but Cas is hard against his hip and mouthing up the line of his jaw and it's a <i>just this once</i> kind of night. They're in the boondocks of Iowa, and it's the middle of the night, and Sam is a town and a half over, shoveling cemetery mud back into Linus Wynham's grave. </p>\n<p>Not even the stars are watching; the sky is empty and black above their heads, heavier along the horizon where clouds are threatening rain.</p>\n<p>+</p>\n<p>(Like most things in Dean's life, it happens accidentally and because of a bad hunt.</p>\n<p>It's one of <i>those</i> jobs, the kind that starts going sideways the minute they roll into town. It turns out the county boneyard was moved sixty-three years ago, and the local legends say the reinternment crew had been a little sloppy with the headstones, so there's no telling if Sam is even digging up the right corpse. Dean and Cas get lost looking for the empty field where Linus Wynham murdered his wife; they waste an hour searching the wrong place, and their flashlights die as soon as they find the right one, and they get made by the ghost while Dean is rifling through his bag for spare batteries, except that the ghost is actually a rabid, foaming-at-the-mouth poltergeist. Cas squeezes off one good shot, but the poltergeist just snarls and tosses him into a thicket for his trouble. After that it decides to use Dean as a piñata, and he gets batted around until Sam finally strikes gold and the bastard flames out in his face with a rush of heat and ash.</p>\n<p>Cas scrambles to his feet looking wide-eyed and white around the mouth. He reaches for Dean's face, and Dean automatically braces himself for the familiar, lightning-burst of grace, and then there's a slow, suspended moment where Cas remembers he can't do that anymore and something horrible and hot crawls up into Dean's throat because Cas looks like he might puke.</p>\n<p>He starts to say it's okay, but Cas grabs him by the jaw before he can get the words out, and then Cas is kissing him like something out of the dreams he likes to pretend he doesn't have.)</p>\n<p>+</p>\n<p>The third time his cell rings, Dean pulls away from Cas just enough to fish it out of his pocket. Cas doesn't let him get far; he digs his fingers into Dean's hip and presses his mouth to the hollow of Dean's throat.</p>\n<p>\"Hey, Sammy.\"</p>\n<p>\"Are you guys all right? I was getting worried.\"</p>\n<p>\"Yeah,\" Dean says, swallowing the kind of noise Sam doesn't need to hear. \"We were just — I dropped my phone, and it's dark as hell out here. Any trouble over there?\"</p>\n<p>\"No. Did Wynham's wife show?\"</p>\n<p>\"Nope. Either snuffing him cut her loose, or the spooky shit out here was all him in the first place.\"</p>\n<p>\"Whatever. I'll take it,\" Sam says, sighing into the phone. \"You need me to head over there?\"</p>\n<p>Dean says, \"No, we're good,\" then hangs up, because Cas' fingers are skimming over his belt, and he'd like to explore that development without his baby brother's voice in his ear.</p>\n<p>+</p>\n<p>They don't talk about it in the car. The field is only fifteen minutes outside of town, but Cas knocks out before they hit the highway, his head lolled at an awkward angle and the passenger window fogging with his breaths.</p>\n<p>They don't talk about it at the motel, either. They only have one room, because Dean's latest stolen credit card is close to the breaking point, and Sam is already there when they get back, recently showered and channel-surfing as he works on his second beer.</p>\n<p>They almost talk about it in the bathroom, while Cas is helping Dean clean the gash he got when the poltergeist threw him into a tree stump. It's on the back of his shoulder, low enough that he can't see it without a mirror and throbbing in a way he can feel straight down to his elbow. Cas' hand lingers at the curve of Dean's neck, his fingers hesitating against Dean's skin a little too long, and Dean catches Cas' wrist and runs his thumb over the human thrum of Cas' pulse. For a split-second, Dean worries he'll have to explain <i>just this once</i> to a guy he has been in love with for years, but Sam rescues him by bustling in with a towel full of ice for the purple-red bruise blooming on Cas' cheek, and since the motel is a piece of shit, the bathroom has a maximum occupancy of one. </p>\n<p>\"That needs stitches,\" Sam observes.</p>\n<p>\"I told him as much,\" Cas says, sounding weirdly uptight and irritated for someone who got a handjob less that thirty minutes ago. He'd come with his hot, flushed face hidden against Dean's neck and his mouth open and wet against Dean's skin. Dean curls his hand into a fist so he doesn't pull Cas closer, palm the curve of Cas' hip. </p>\n<p>Sam pokes at Dean's shoulder; Dean hisses and slaps his hand away. \"Knock if off.\"</p>\n<p>\"Now who needs a slice of crybaby pie?\"</p>\n<p>\"Hey, if you wanna be a smartass, I can have Cas patch me up,\" Dean says, but Cas is already gone. Somehow, he slipped between Sam's gigantic body and the sink without knocking Dean off the toilet or pushing Sam into Dean's lap.</p>\n<p>Sam only puts five or six stitches in him, which means a butterfly bandage would've done the trick, but the three fingers of whiskey Sam makes him drink dulls both the ache in his shoulder and the anxious, I-fucked-up feeling knotted underneath his ribs. He still doesn't want to talk about it — although he probably could now without losing his shit — but Cas has fallen asleep again by the time Sam is done fussing, sprawled diagonally across one of the beds because it's Dean's turn on the fold-out couch, still half-dressed and with his face smushed into the pillows and his icepack slowly making a wet spot on the pink and orange bedspread.</p>\n<p>+</p>\n<p>\"Dude, are you all right?\" Sam asks. They're near the Nebraska line, following US 80 as it skirts toward Omaha. \"You've been kind of — I don't know. Quiet.\"</p>\n<p>Dean glances in the rearview mirror; Cas is tailing them in the Continental, closer that is probably safe. He's driving with his elbow out the window, and he's wearing Dean's brown and yellow flannel because no one ever remembers to take him shopping.</p>\n<p>\"I'm good,\" Dean replies, then one-hands Iron Maiden's <i>Best of the Beast</i> out of the glove box and into the tape-deck before Sam can say anything else.</p>\n<p>+</p>\n<p>The weird part is that it isn't weird at all.</p>\n<p>Back at the bunker, they bump elbows and shoulders in the garage and the library and the laundry room, but Cas never tenses or looks over. When Dean cooks, Cas wanders in and out of the kitchen to get more coffee or bring in the dirty dishes Sam stashes everywhere, but he never lingers and rarely says more than a few words. Dean catches Cas watching him a few times, but Cas has always had a staring problem. It's probably just a leftover angel thing, one of the many ways his abrupt return to earth has made him a little socially awkward.</p>\n<p>Thursday is their designated TV night, assuming they're actually home to enjoy it; the next time it rolls around, Sam pops <i>The Walking Dead</i> into the laptop and Cas sits in his usual spot and hogs the popcorn while having his usual wrong opinions about Daryl Dixon.</p>\n<p>\"I'm simply saying it wouldn't surprise me if he left the group again. He has done it before.\"</p>\n<p>\"You can't hold that against him,\" Dean says, waving the remote. \"He thought he had to 'cause Merle was his brother.\"</p>\n<p>\"Merle was an asshole,\" Cas says, and Sam chokes on his beer, and Cas spills the popcorn everywhere as he makes himself comfortable. He folds his legs underneath his body, making the couch creak and nudging his bent knee into Dean's thigh, and it's all just incredibly normal.</p>\n<p>Cas must have gotten it out of his system that night. He probably hasn't thought about it since, how Dean had shuddered all over when Cas bit at the corner of his jaw, or the embarrassing noises Dean had made when he came.</p>\n<p>+</p>\n<p>Sam says, \"So get this,\" over breakfast, and an hour later they're on the road and headed for Elkins, West Virginia.</p>\n<p>It's raining a little in Lebanon, the air thin and crisp and the clouds slowly scuddering east. Dean decides to go up through St. Joseph; it's fifty miles longer, but Elkins is a two-day haul either way, and US 36 bypasses the clusterfucks of Kansas City and St. Louis. Living on the road with Hannah for a couple of months made Cas into a pretty decent driver, but he hates city traffic, and he has a tendency to tailgate, and he never fucking merges until the very last second.</p>\n<p>\"So,\" Dean says, clearing his throat, \"a haunted construction site?\"</p>\n<p>Sam shrugs. \"Sounds like it.\"</p>\n<p>\"That's kinda weird.\"</p>\n<p>\"Yeah, it is. But we've definitely done weirder.\"</p>\n<p>\"Yeah,\" Dean agrees, glancing in the rearview mirror. \"I guess.\"</p>\n<p>They stop for the night in Mattoon, Illinois, and they end up with one room again, this time because it's the only vacancy in town. Cas takes the couch, because the fold-out is a twin and Sam wouldn't fit on it with the help of a shoehorn, and Dean lies awake half the night listening to Cas snore.</p>\n<p>+</p>\n<p>Elkins only has one motel and it's way out on the edge of town, close to the main drag but hidden behind a Biggerson's like a dirty secret. It's really a motor court, the kind of place with individual bungalows instead of rooms. Each one comes with an aluminum-roofed carport, and Cas backs the Continental into his like the wheel man on a bank job. The bungalows themselves look like gingerbread houses, if the frosting on gingerbread houses peeled in the sun like paint.</p>\n<p>It's still pretty early when they roll into town, so Sam decides they should try and get some work done before dinner; he hits the Hall of Records, and Cas heads for the police station, and Dean drives six miles up US 219 to the construction site. It's still more or less a dirt lot, but the sign says it's going to be a Gas &amp; Sip, and that makes Dean think of Cas in a blue vest and with his hair slicked down. Dean had hated that, seeing Cas so buttoned up and perfectly combed.</p>\n<p>\"Well, I was coming out of the john,\" the foreman says, jerking his head toward the row of faded yellow porta-potties to Dean's left, \"and I suddenly felt cold. My face, and all up and down my arms.\"</p>\n<p>\"Cold,\" Dean repeats flatly. He normally doesn't look cold spots in the mouth, but it's November in northern West Virginia. \"Anything else?\"</p>\n<p>\"Yeah. About a week back, all our tools went missing.\"</p>\n<p>\"Tools.\" If Dean drove eleven hundred miles for bad weather and petty theft, he's going to kill Sam with his bare hands. \"Did anyone see anything?\"</p>\n<p>\"I didn't, but I — ask Paul about it,\" the foreman says, waving at a tall and skinny black guy smoking a cigarette next to a stack of cement bags. \"He saw — well, he saw <i>something</i>.\"</p>\n<p>Paul drops his cigarette and crushes it under his heel, tipping his hard hat up as Dean approaches. \"Yeah?\"</p>\n<p>\"Hey,\" Dean says, flashing his badge. \"The foreman said you might've seen who stole the tools.\"</p>\n<p>\"Sonofabitch,\" Paul mutters. \"When I reported it, he accused me of being drunk on the job. Now he wants me to tell it to the feds.\" He hesitates for a few seconds, then shrugs and points at a picnic table in the shadow of the lumber pile. \"I was over there, me and a couple other guys. It was lunchtime. When I looked up, I saw someone walking around, out where we'd just been digging.\"</p>\n<p>\"What did he look like?\"</p>\n<p>\"About your height, but thinner. Very pale. And his clothes were funny — last century stuff.\" Shaking his head, Paul digs another cigarette out of his pocket and lights it with a bright blue Bic. \"I shouted at him, 'cause we'd dug pretty deep that day — you know, for the gas tanks — but the fucker just disappeared.\"</p>\n<p>\"Disappeared?\" Dean asks slowly. \"Like he ran away, or —\"</p>\n<p>\"No, no. He <i>disappeared</i>,\" Paul says, flapping his hands. \"Into thin air. I saw him again, though. Just before quitting time.\" He points his cigarette at the woods butting the eastern edge of the construction site. \"He was there about a half hour, just moving in and out of the trees.\"</p>\n<p>+</p>\n<p>Dean has never liked wearing a suit, but he really hates wearing this suit in particular. The pants are scratchy, and the jacket is too tight across the shoulders, and he's pretty sure his shirt collar is trying to wring his neck. He starts pulling at his tie while he's still fumbling with his motel key, and the room is stuffy as hell in spite of the cold, damp weather, so he strips down to his boxers on his way to the bathroom.</p>\n<p>He's only in there long enough to piss and slap some water on his face and pull on a pair of jeans, but when he comes out he finds Cas sitting on the couch. Cas has also ditched his suit and is apparently fresh out of the shower; he has wet hair and bare feet, and he is holding a greasy sack of what smells like cheeseburgers. He must've really paid attention to Sam's lock-picking lessons, because Dean hadn't heard a fucking thing.</p>\n<p>The air conditioning kicks on with a thud and a dull hum, and a guilty expression slides across Cas' face. \"Sorry. It's very warm in here. I thought —\"</p>\n<p>\"Don't worry about it. I was gonna turn it on anyway.\" Dean stands there for a minute, shirtless and uncomfortable, watching as Cas stuffs french fries into his mouth. Then, he remembers that Sam had dropped Cas at the police station on his way to the Hall of Records. \"Wait, did — did you <i>walk</i> here?\"</p>\n<p>\"It was only a few blocks,\" Cas says, shrugging.</p>\n<p>\"Dude, you could've called.\"</p>\n<p>\"I didn't want to disturb you. Besides, I — I think I enjoy a little exercise.\"</p>\n<p>\"Jesus Christ,\" Dean says, rubbing his hand over his face. \"You're spending way too much time with Sam.\"</p>\n<p>Cas shrugs again and unwraps a cheeseburger, the foil and wax paper crinkling against his fingers. The air conditioner makes a clanking sound, and a car coughs to life in the motel parking lot, and Dean snatches a t-shirt out of his bag because he feels raw and open and exposed. Which is ridiculous; Cas has seen Dean worse than shirtless. He pulled Dean out of hell, and he fought with Dean in purgatory, and he helped Sam with the cure when Dean was a demon, and a week ago he jacked Dean off in an empty field in Iowa, pressed soft kisses to Dean's throat as Dean shivered and came all over his hand.</p>\n<p>\"What did the police say?\" Dean asks, jerking the t-shirt over his head. </p>\n<p>Cas takes a bite of his cheeseburger, then says, \"The contractor recently filed a police report regarding some missing tools,\" with his mouth full. \"The police found them the next day in the wooded area east of the construction site.\"</p>\n<p>\"East,\" Dean says slowly. That Paul guy had seen something in the same place. \"Go on.\"</p>\n<p>\"They have no direct proof, but they suspect a group of... tree-kissers who opposed the Gas &amp; Sip's zoning permit for ecological reasons.\"</p>\n<p>\"Tree-huggers, Cas. Tree-huggers.\" Dean kicks his fed shoes closer to the bed so Sam won't trip over them later and complain about it for a month, then sits down on the couch. It's really a loveseat, and that puts him closer to Cas than is probably good for his sanity, but the food smells delicious. \"Anything for me in there?\"</p>\n<p>Cas smiles and passes him the bag. \"At the bottom. Bacon, avocado, and extra cheese.\"</p>\n<p>\"Sweet. Anything else?\"</p>\n<p>\"And fries.\"</p>\n<p>\"No — I mean, the police. Did the police give you anything else?\"</p>\n<p>\"Oh,\" Cas says, nodding and chewing at the same time. \"A car skidded off the highway just yards from the construction site, shortly after they broke ground. The driver claimed he swerved to avoid a man standing in his path. Apparently, he was dressed strangely. The man,\" he clarifies, \"not the driver.\"</p>\n<p>\"Huh,\" Dean says. His burger is fucking fantastic. \"Sounds like a haunting. The guy I talked to at the construction site — the thing he described was definitely a ghost.\"</p>\n<p>Cas hums in agreement and shifts until he's sitting sideways on the couch, one leg pretzeled on the seat and the other sprawled out, angled so that his foot nudges against Dean's. He stretches his arm across the back of the couch, and his fingers bump Dean's collar, then brush up into Dean's hair, and Dean shivers a little. His eyes slide closed.</p>\n<p>\"Cas,\" Dean says quietly, because <i>just this twice</i> is a lot trickier than <i>just this once</i>. Casual sex has basically been the story of Dean's life, but he doesn't think he can do it this time, not with Cas, not when — </p>\n<p>A key rattles in the lock, and Cas sighs softly and pulls away. The door swings open and Sam walks in with his suit jacket over his arm and the kind of expression on his face that comes from spending four and a half hours at the Hall of Records.</p>\n<p>\"Hey, guys,\" he says. \"What's going on?\"</p>\n<p>\"Nothing,\" Dean replies, just as Cas says, \"Dean believes we're dealing with a ghost.\"</p>\n<p>\"We are.\" Sam drops his suit jacket on his bed and hands Dean a wrinkled piece of paper. \"And I think I know who it is.\"</p>\n<p>The paper is a shitty photocopy of an even shittier map. \"What the fuck am I looking at?\"</p>\n<p>\"It's a plat map,\" Cas says.</p>\n<p>Sam nods. \"Yeah, from the 1890s.\" He sits on the foot of his bed, which creaks like its dying, and he makes grabby-hands at the burger bag until Cas tosses it over. \"The Gas &amp; Sip is being built on land that used to belong to a Horace Wilson. He died in 1924.\"</p>\n<p>\"Let me guess — murdered?\" Dean asks.</p>\n<p>\"Stabbed twenty-seven times in the chest and abdomen. No one was ever charged. Everyone in town hated him, so the visiting magistrate didn't dig too hard.\"</p>\n<p>\"And he's just been asleep all this time?\"</p>\n<p>\"Not entirely,\" Cas says, narrowing his eyes. He pulls a notepad from his back pocket and quickly flips through it. \"I think — here it is. The policeman I spoke with mentioned several reports of voices and strange noises in the woods. Nothing was ever found, so the complaints were dismissed as pranks. That was likely him, as well.\"</p>\n<p>\"Okay,\" Dean says thoughtfully. \"So — what? Dying messy leaves this guy a little restless, and construction on the old homestead makes him go full-tilt?\"</p>\n<p>Sam pops a french fry into his mouth. \"Works for me.\"</p>\n<p>\"Burial site?\"</p>\n<p>\"I couldn't find an official death certificate,\" Sam says, shaking his head, \"but I read something that said he was Catholic. The churchyard on the south side of town is probably a safe bet.\"</p>\n<p>+</p>\n<p>Second verse, same as the first: once again, Sam pulls the graveyard shift, and once again, Dean and Cas get stuck trudging through the creepy woods in the middle of the night. Dean really needs to start paying attention during the 'division of labor' portion of their three-man hunts.</p>\n<p>\"Over here,\" Cas says, somewhere off to Dean's right.</p>\n<p>Dean waves his flashlight in the general direction of Cas' voice, then points it at the ground. If he trips over another fallen log, he's going to stab something on principle. \"What is it?\"</p>\n<p>\"A structure of some sort.\"</p>\n<p>It is, if the definition of 'structure' is 'about twenty rotten boards, a few of them almost upright.' The Gas &amp; Sip is being built where Wilson's house once stood, so this wreck had probably been a stable or a barn in a past life, or maybe a large shed.</p>\n<p>\"Better check it out,\" Dean mutters, shining his flashlight through what might've been the doorway and cautiously peering inside. Half an hour ago, Sam had called to say he'd found Wilson's grave in the churchyard and was working on it, but there could be something in here keeping Wilson earthbound.</p>\n<p>Cas leans in close to Dean's back and aims his flashlight over Dean's shoulder. His bag clanks loudly as it jostles between his hip and Dean's ass, and he sighs. \"I'm not sure we needed this many guns. It's just a ghost.\"</p>\n<p>\"Hey, the last time we thought it was just a ghost, it turned out to be a poltergeist and I was picking wood chips out of my shoulder for days.\"</p>\n<p>\"That wound had no splinters. I specifically checked.\"</p>\n<p>Dean blinks at him. \"Dude.\" Two months at the bunker has really helped Cas in the sarcasm department; these days, he gets it about sixty-five percent of the time, but the other thirty-five percent tends to go so far over his head it launches itself into outer space. \"I was joking.\"</p>\n<p>\"I don't find you being injured funny.\"</p>\n<p>That makes something shift inside Dean's chest, and it doesn't help that Cas is literally breathing down his neck, so he gives the shed another look. He sees a few rusty tools that are probably old enough to have been Wilson's, and also a handful of newer things — a moldy sleeping bag, a busted Coleman lantern — the kind of stuff that suggests someone had used this as a squat before the roof finally caved in.</p>\n<p>Shrugging, Dean turns back to Cas and says, \"I don't think there's anything here,\" just as something pale and horrible materializes over Cas' shoulder. Dean shouts, \"Get down,\" and reaches out to shove Cas away, but the ghost is quicker, and Cas goes flying sideways before Dean can level his shotgun.</p>\n<p>Dean shoots and reloads and shoots and reloads, his gut churning every time he glances at where Cas is sprawled in the dirt. Eventually, Cas rolls over and heaves himself upright enough to start firing as well; between the two of them, they manage to herd Wilson inside the shed and keep him pinned there until he finally screams and bursts into flames. As soon as the fireworks start, Dean drops his shotgun and runs over to Cas. Cas is lying in the dirt again, staring up at the purple-black sky, and Dean crouches over him, his heart thudding in his chest.</p>\n<p>\"Cas,\" he says, and he knows he shouldn't touch, but he can't stop himself from sliding his hand up to Cas' jaw and rubbing his thumb at the corner of Cas' mouth. \"You all right?\"</p>\n<p>\"I'm fine.\" Cas smiles a little and hooks his fingers in the collar of Dean's shirt. \"Landing here knocked the wind out of me. I was dizzy for a moment, but it seems to have passed.\"</p>\n<p>Dean glances around at the darkness; if he remembers right, the car is only a hundred yards away, south and west. \"Come on, let's get you up, and —\"</p>\n<p>\"No,\" Cas says, and then, \"Wait.\" He yanks on Dean's shirt, hard, and then they're kissing, sloppy and desperate and wet, and Dean can't make himself pull away.</p>\n<p>+</p>\n<p>They end up in the front of the Impala, Cas sitting in the passenger seat and Dean straddling his lap. There isn't really enough room, even with the door open and one of Cas' feet dragging in the dirt — Dean's ass keeps bumping the dashboard and Cas' knee is jammed against the radio — but Cas is moaning straight into Dean's mouth, soft and low, and he won't let go of Dean long enough for them to scramble into the back. He rolls his hips up until his dick is rubbing against Dean's, and he dips his hand underneath Dean's shirt, flattening his palm at the small of Dean's back, then sliding it up to the sweaty stretch between Dean's shoulderblades. He digs his nails in there when Dean sucks on his tongue, and he shivers when Dean's teeth catch on the well of his lip.</p>\n<p>He starts tugging on Dean's belt, but Dean is too close already, so close that he's shaking with it, and he catches Cas' hand and holds it there, selfishly, giving himself something solid to rub against. Cas just murmurs, \"Yes, yes,\" against Dean's mouth and noses at the corner of Dean's jaw, then says, \"I want to see it, please,\" and Dean comes in his jeans like a teenager, his eyes closed and Cas biting kisses along the side of his neck.</p>\n<p>Dean shouldn't make this any worse than it already is, but he wants it — Jesus fucking Christ, he wants it — so he slides out of Cas' lap, and he tugs on Cas' knee until Cas turns sideways with his long legs sprawling out of the car, and he kneels in the dirt and sucks Cas' dick into his mouth. Cas gasps and jerks his hips and curls his fingers into Dean's hair, and he runs his other hand up Dean's jaw and over Dean's cheek, traces the stretch of Dean's lips with the tips of his fingers. Dean looks up as he pulls back to roll his tongue over the head, and he finds Cas watching him, his eyes wide and a slow flush burning up his neck and into his face; he shudders when Dean sucks him back down, and he says Dean's name over and over when he comes.</p>\n<p>+</p>\n<p>The trip back to the bunker is a nightmare: two days of Cas driving in a separate car and sleeping in a separate room and pointedly acting like nothing happened whenever they stop for food or fuel. </p>\n<p>On the first afternoon they grab lunch at a truckstop in central Ohio. The place is packed so they sit at the counter; Cas takes the stool on the other side of Sam, and they strike up a conversation about Aramaic translations that makes zero sense to Dean right from the jump. Whatever they're talking about, Sam gets so into it that he waves his hands and spills his coffee on the counter, and as they're leaving he decides to ride in the Continental until their next stop.</p>\n<p>Dean puts <i>Houses of the Holy</i> in the tape-deck and turns the volume up so high the Impala's ancient speakers start to buzz. The car still smells faintly of sex, and Dean has a hickey below his ear, barely hidden by the fold of his collar.</p>\n<p>+</p>\n<p>The bunker is big enough that the three of them can knock around for hours without getting in each others hair; Dean figures he can stretch that to a couple of days if he plans things just right. He knows that's either cowardly or pathetic, or maybe even both, but he also knows there are things that can't be fixed or changed, and his default plan for that kind of shit has always been drinking too much and ignoring it until it goes away.</p>\n<p>Mostly, he listens to music, and he catches up on his sleep, and he pokes around the internet for a cakewalk case he can spin as a solo gig, and he tries not to think about the way Cas looks when he comes, or the way Cas' fingers feel pulling at his hair. Fucking around with Cas had been a disaster waiting to happen; he'd known that going in, but he'd done it anyway, probably because he has been in love with Cas so long a part of him was willing to take what he could get.</p>\n<p>To Sam's credit, a full seventy-two hours passes before his sasquatch footsteps begin pausing in front of Dean's door. Dean gives it another five, then shows his face a few times so Sam doesn't start asking questions he doesn't want to answer. He doesn't see Cas anywhere, which leaves him both irritated and relieved. It also makes him think the coast is clear — at least clear enough for a pit stop in the kitchen. </p>\n<p>Spaghetti would be quicker and easier, but chili always tastes better; Dean's recipe is based on what he remembers of his mom's. He puts the beans in the pot, and he measures out all the pepper and chili powder, and just as he's about to open the ground beef, Cas comes up behind him on quiet feet. He peers at the stove over Dean's shoulder, humming like he's some kind of food critic and not so new to having taste buds that he still gets excited by cornflakes, then leans in to Dean a little and lets his hand flutter over Dean's hip.</p>\n<p>\"Can I help?\"</p>\n<p>He smells like old books and the Ivory soap in the bunker's shower; Dean says, \"Yeah,\" in a voice that sticks in his throat and passes Cas an onion and a knife. \"Small pieces, and try to get them even.\"</p>\n<p>Cas sets the onion on the cutting board and taps it with the knife two or three times, then lays the knife down on the counter and snakes his arm around Dean's waist and pulls him in for a kiss. He doesn't waste any time, just pushes his tongue into Dean's mouth and slides his hand to the hollow of Dean's throat, stroking his fingers over the place that makes Dean shiver and gasp.</p>\n<p>\"Don't,\" Dean says, pulling back as much as Cas' arms and the counter will allow. \"We can't.\"</p>\n<p>\"Why not? Your brother is in the storage basement, looking for a book.\"</p>\n<p>Dean just stares at him for a moment — at his bright, gorgeous eyes, the line of his jaw.</p>\n<p>\"I keep thinking about it,\" Cas says, trailing his fingers over Dean's lips, and Dean can stop himself from opening up a little, wetting the tips of them with his tongue. \"You looked so beautiful when you —\"</p>\n<p>\"Okay, okay,\" Dean says quickly, because if Cas starts talking dirty he will lose what's left of his mind. \"Okay.\"</p>\n<p>They kiss right there, leaning against the counter between the fridge and the stove, just slow hands and soft mouths, shifting against each other until they're both half-hard and breathless. Dean can't keep his hands out of Cas' hair, and the noises Cas makes are positively filthy; Cas gets his thigh between Dean's and curves his hand over Dean's ass, and Dean pulls back a little, ready to tell Cas they should take this to a bed, because he would like that, would like to do this at least once while both of them are lying down and naked, but he gets interrupted by the beans boiling over with a hiss.</p>\n<p>\"Fuck,\" he snaps, shoving the pot onto a cold burner. \"Sonofabitch.\"</p>\n<p>\"Are you burned?\"</p>\n<p>\"No, it's just — fuck.\" The stove is a mess, and the beans are overcooked, and Cas — <i>Cas</i>. \"I just cleaned in here.\"</p>\n<p>Cas grabs a towel, and then the loose tile in the hallway squeaks, and then Sam is in the doorway, asking, \"Dude, what is that smell?\"</p>\n<p>+</p>\n<p>Two days later, Cas blows Dean in the laundry room.</p>\n<p>There is no preamble to it; Cas just pushes Dean back against the huge, industrial dryer, then sinks to his knees and unzips Dean's jeans and sucks Dean's dick into his mouth before Dean is really even hard. It's clumsy and perfect — the wet drag of his lips, the slow curl of his tongue, the spit-slick twist of his hand around the base. The dryer rattles and hums against Dean's back, and Cas' throat flutters every time he takes Dean in too deep, and Dean comes embarrassingly fast, his thighs shaking as heat twists and coils in his gut.</p>\n<p>He drags Cas upstairs to return the favor, because the floor in the laundry room is concrete and Dean's knees are too old for that shit. Cas' bed is older and narrower than Dean's, noiser, and it groans and creaks when they climb onto it, but Dean finally gets Cas naked, and he finally gets to do all the things he has wanted to do. He sucks a trail of bruises up the inside of Cas' thigh, and he presses kisses to the jut of Cas' hip, and he teases his thumb over the skin behind Cas' balls. Cas is nearly crawling out of his skin by the time Dean finally runs his tongue over the head of his dick; he claws at the sheets and arches off the bed and his foot skims down Dean's side, almost possessive.</p>\n<p>Afterward, Dean walks across the wall to his own room, and Cas doesn't ask him to stay.</p>\n<p>+</p>\n<p>Dean wakes up to a sullen headache and a sour mouth and vague plans to stay in bed until dinnertime tomorrow, but that gets derailed by the job about four hours in because the job is a god damn pain in the ass. </p>\n<p>Cas finds an internet thing about a bloodless body in northern New Mexico, but Sam is already busy chasing down some lore for Krissy's crew. Those kids are hunting something straight out of Islamic mythology, so Sam has books and folders and translation dictionaries spread over every flat surface in the library by noon, and he keeps making nerdy-sounding phone calls to the Comparative Religions professor at KSU. Dean and Cas end up stuck in Dean's room, sitting shoulder to shoulder on the bed with Dean's dinosaur of a laptop balanced between their laps. Firefox crashes before they even get started, and Dean can't find the search history thingie, so he types 'bloodless body new mexico' into Google and hopes for the best.</p>\n<p>\"There,\" Cas says. He points at the first link on the screen, a week-old article from the <i>Portales News-Tribune</i>. \"I think that's it.\"</p>\n<p>\"You think?\"</p>\n<p>\"Yes. Look — <i>Woman's Bloodless Body Found Dumped in Desert.</i>\"</p>\n<p>Dean scans the article, but it doesn't really tell him anything he hadn't already figured out from the headline; it had been written just a few hours after the body was found, so the reporter hadn't had much to go on. A link at the bottom of the page leads to a follow-up published two days later, but as far as a possible job goes it isn't much better. It spends four paragraphs rehashing the first one, then asks anyone one who knows anything to come forward because the local authorities are stumped. Sighing, Dean opens a new tab.</p>\n<p>Cas leans in a little; the back of his hand bumps Dean's thigh and stays there. \"What are you doing?\"</p>\n<p>\"Looking for anything similar in the area.\"</p>\n<p>\"Wait — here, I have it,\" Cas says, grabbing his notepad from the nightstand. \"That's what I was trying to do when the computer stopped working.\"</p>\n<p>\"Great,\" Dean says. He closes the laptop and sets it aside. \"Let's hear it.\"</p>\n<p>\"Six weeks ago, a man's body was found in Oasis State Park. Two months before that, a woman's body was found a few miles outside of Clovis. Both were drained of blood.\"</p>\n<p>Dean sighs again and rubs the back of his neck. \"Yeah, that's probably something.\"</p>\n<p>\"Bloodless victims means vampires or chupacabras.\"</p>\n<p>\"Right,\" Dean says slowly. His hip bumps against Cas' as he shifts on the bed. \"I'm thinking chupacabra.\"</p>\n<p>\"Because of the location?\"</p>\n<p>\"Well — yeah, that. But also the kill rate. Three bodies in four months is pretty slow for vampires. Even a small nest needs about twice that.\"</p>\n<p>\"It could be alone.\"</p>\n<p>\"It could be, yeah, but they almost never are.\"</p>\n<p>Cas accepts this with a nod, and Dean expects him to grab his stuff and go now that they've hashed it all out, but he just lays his notepad on the nightstand and settles in, making a soft, contented noise as he leans back against the headboard. He is warm against Dean's side, and he smells like the coffee he has been drinking; Dean tips his head onto Cas's shoulder before he realizes what he's doing, but Cas lets him, so he presses his mouth to the skin behind Cas' ear.</p>\n<p>+</p>\n<p>As it turns out, Sam Winchester is a dirty traitor.</p>\n<p>\"I'm sorry,\" he says, looming in Dean's bedroom doorway like a sasquatch and not sounding sorry at all. To add insult to injury, he's wearing the yellow and blue shirt Dean hates. \"I already told Krissy I'd head up there and help them out.\"</p>\n<p>\"Dude, we have a case.\"</p>\n<p>\"Yeah — a case that doesn't need three guys. Cas says it's a chupacabra.\"</p>\n<p>\"Cas <i>thinks</i> it's a chupacabra. It could be vampires.\"</p>\n<p>Sam snorts. \"Three bodies in four months isn't vampires. It's a chupacabra, and chupacabras are amateur hour. You and Cas will knock it out in a couple of days.\"</p>\n<p>Dean scrubs a hand through his hair; the chupacabra really isn't what he's worried about right now. \"Sammy —\"</p>\n<p>\"Look, Krissy's crew — they're just kids, and they're in way over their heads. They need help. Garth would probably saddle up again if I asked, but I'm not sure —\"</p>\n<p>\"All right, all right,\" Dean says, waving him off. \"Whatever, go. But you're not taking Baby.\"</p>\n<p>Sam goes, his gigantic clown feet creaking all the way down the hall, and Dean wastes another hour packing and unpacking and repacking his bag. He realizes at some point that he's using all the same stuff, just folding things differently or moving them around, so he finally zips it closed and shouts for Cas to hurry and stomps down to the garage.</p>\n<p>\"Did your brother steal my car?\" Cas asks, frowning at the space where the Continental should be.</p>\n<p>Dean slams the Impala's trunk. \"No. It isn't stealing when it's family.\"</p>\n<p>+</p>\n<p>Portales is six hundred miles southwest of Lebanon, and it's a pretty easy drive once they make it past the stop-and-go shit through Dodge City. They stop for lunch in the Oklahoma panhandle and still roll into town in under eight hours. Dean pulls into the first decent-looking motel he sees near US 70, and he asks for a double out of habit, and because — well. <i>Because.</i></p>\n<p>The room is kind of small for a double, the kitchenette crowded up against the beds, and it's done up like a southwestern trading post, all braided rugs and unfinished wood furniture. There's a potted cactus on the table and an old horse blanket hanging over the back of the couch. Cas dumps his stuff on the bed by the door, and then flops down beside it like he plans to take a nap, so Dean strips down for a shower, leaving his clothes in a heap on the bathroom rug.</p>\n<p>Cas joins him just as he's about to get out. They grind together until the water starts to run cold, everything wet and slick and perfect — perfect until they get out and dry off and Cas falls asleep in his own bed.</p>\n<p>+</p>\n<p>The next day, Dean spends three hours at the police station, an hour at the coroner's office, and two hours poking around a bloody patch of sand in the middle of the desert. He gets a sunburn on his nose, and he sweats through the collar of his stupid fed shirt, and when he gets back to the motel he finds Cas sprawled on the couch, eating Chinese food straight from the container and drinking his third beer.</p>\n<p>\"Please tell me you've got something,\" Dean growls. He slams the door, but it only makes him feel about four percent better.</p>\n<p>Cas sets his food down and sits up a little straighter. \"I take it your day was a blast?\"</p>\n<p>\"You mean bust,\" Dean says, tugging on his tie, \"and yeah, it was.\" He shrugs off his sweaty jacket, drops it on the bed, and starts rolling up his sleeves. \"I got a look at the police report, but it didn't have anything good — no weird paw-prints, no funny smells, nothing like that.\"</p>\n<p>\"What about the body?\"</p>\n<p>Dean grunts in frustration and grabs a beer from the fridge. \"She was out there a long time. If something did stick a straw in her, the coyotes did a good job of covering it up.\"</p>\n<p>\"Come here,\" Cas says, patting the place beside him on the couch. \"I got moo shu pork and those little eggrolls you like.\"</p>\n<p>Dean drains his beer and snags another, then moves over to the couch, kicking off his uncomfortable fed shoes as he sits. Cas passes him a steaming carton and a pair of chopsticks, and he strokes his hand up the center of Dean's back, brushing his fingers up into Dean's hair. Dean can't stop himself from leaning into it, and he can't swallow the noise that catches in the back of his throat.</p>\n<p>Once the tension has drained from Dean's shoulders, and once he is about halfway through his moo shu pork, Cas asks, \"Will it make you feel better if I say my day was not a... bust?\" with his mouth against the back of Dean's neck.</p>\n<p>\"Yes.\"</p>\n<p>Cas hides another kiss behind Dean's ear, then says, \"I spoke with several people today. Three claimed to have seen a strange creature on their property.\"</p>\n<p>\"All right,\" Dean says tiredly. \"Let me guess — large, ugly, hairless dogs?\"</p>\n<p>\"Large and ugly, yes, but nothing like dogs. The creatures they described had glowing eyes and humanish faces. They hunched over when they walked, but moved on two legs.\"</p>\n<p>Dean chokes on his beer. \"Seriously?\"</p>\n<p>\"Yes. And all three live close to where the body was found.\"</p>\n<p>+</p>\n<p>Chupacabras are stupid, all teeth and hunger and animal instincts, but they're fast as hell.</p>\n<p>Dean and Cas find the thing's burrow about a mile from where it left the body, and they manage to flush it out, but it darts between them like lightning and disappears into the night. An hour later they track it down again, and this time it scrambles over some rocks too steep for Dean or Cas to climb. The third time, they corner it in some poor bastard's tool shed; it spits and snarls and tries to make a break for it, and Cas clips it right between the eyes.</p>\n<p>+</p>\n<p>And then. And <i>then</i>.</p>\n<p>+</p>\n<p>(The thing is, Dean doesn't have a lot of experience with guys.</p>\n<p>He just couldn't — he <i>couldn't</i>. His sexuality wasn't a conversation he could have with his dad, and then his dad died, but it wasn't a conversation he was sure he could have with Sam, either. By the time he realized Sam wouldn't care, he'd just come back from hell and spend most days feeling like a raw nerve, too exposed to talk about anything serious, and then there came a point where if felt like Sam already knew, which meant there really wasn't anything left to discuss.</p>\n<p>So Dean would pick up guys sometimes, but he would be kind of furtive and shady about it out of habit, and that meant hooking up in the back of his car or in the alley behind the bar, and that meant hands and mouths. He got fucked just enough to know that he likes it, but he never learned how to ask for it, always waited for the other guy to bring it up.</p>\n<p>Not that Cas actually brings it up. He just rubs his thumb over Dean's hole and then smiles at the way Dean shivers.)</p>\n<p>+</p>\n<p>Cas spends what feels like forever opening him up, using his fingers and then his mouth and then both, every movement steady and slow, refusing to be rushed. He bites the inside of Dean's thigh when Dean curses and arches off the bed, and he mouths at the base of Dean's dick when Dean finally gives in and begs. Dean finally comes from it, shaking through an orgasm he can feel everywhere, unable to breathe.</p>\n<p>He rolls over once his legs will cooperate, and Cas slides up his body, pushing inside him with the filthiest noise Dean has ever heard. They can't quite find a rhythm at first — Cas' knee keeps slipping on the sheet, and Dean's thighs still feel like water — but Cas digs his fingers into Dean's hips, and he presses his mouth to the curve of Dean's neck, and then it's easy, perfect. The headboard bangs against the wall, and Dean gasps and pulls at the sheets, and Cas kisses the back of Dean's neck when he comes.</p>\n<p>+</p>\n<p>When Dean wakes up in the morning, Cas is snoring into his shoulder.</p>\n<p>They grab breakfast at a Denny's in Portales and lunch at a greasy spoon just over the Kansas line in Liberal, and both times Cas tangles their feet together under the table. </p>\n<p>He spends the entire drive with his hand resting on Dean's thigh.</p>\n<p>+</p>\n<p>The problem with playing house on vacation is that at some point the vacation ends. And, if Dean had had any illusions about the <i>playing</i> part — well. Sam is sitting in the library when they get back to the bunker, looking tired and a little like he got his ass kicked up in Illinois, and Cas heads for his room without running his hand up Dean's arm or nosing at Dean's jaw until he gets a kiss. </p>\n<p>That night, Dean sleeps alone.</p>\n<p>The next night, Cas sneaks into his room about eleven, but he is gone by morning. </p>\n<p>And so it goes.</p>\n<p>+</p>\n<p>Nine days later — four of which Dean spends alone — Sam walks into the storage basement while Dean and Cas are making out against a stack of boxes marked 'cursed.' </p>\n<p>He drops the book he was holding, and he says, \"Shit, sorry — sorry.\" He quickly turns to leave, but he rams his shoulder on the door-frame on his way out, and he stops to hiss under his breath and rub it, and then he looks over at Dean and Cas again, and by that point the window for pretending he hadn't seen anything had passed.</p>\n<p>They all stand there for a minute, staring at the floor and the walls so they don't have to look at each other. Then Sam clears his throat, and Cas clears his throat, and Dean finally snaps and says, \"Look, Sammy, I'm a little busy right now.\"</p>\n<p>Sam deflates like he was waiting to be dismissed, which — oh. He probably thought they would want to talk about it. Dean most definitely <i>does not</i> want to talk about it, but Cas is still there, so it looks like he'll have to anyway.</p>\n<p>\"I'm sorry,\" Cas says quietly, before Dean can even get started. \"I know you didn't want Sam to know.\"</p>\n<p>Dean blinks at him. \"What?\"</p>\n<p>\"I know you didn't want Sam to know,\" Cas says again. Slower, like he's talking to a child. \"About — about us.\"</p>\n<p>\"No, I — what? I don't care if Sam knows.\" Dean just stares at him for a couple of seconds, then rubs his hand over his face; Cas isn't making any fucking sense. \"And there is no <i>us</i>.\"</p>\n<p>\"There most certainly is.\" His eyes narrow, and a hot flush of color burns up his jaw and into his cheeks, and — Jesus Christ, he is <i>gorgeous</i> when he's angry. Dean has known this for years, but it was easier to ignore before — well. <i>Before</i>.</p>\n<p>He catches Cas' hand, and he runs his thumb over Cas' knuckles, even though Cas looks a split-second from punching him in the jaw. \"Hey,\" he says, soft. \"Let's start over. Tell me why you thought I didn't want Sam to know.\"</p>\n<p>\"That first night, you — he called, and you told him we were delayed because you'd dropped your phone in the grass.\"</p>\n<p>\"Okay, yeah,\" Dean admits, reaching for Cas' other hand because he still looks furious. \"I wasn't going to tell him over the phone. Not when I didn't know — I wasn't sure what you — um.\"</p>\n<p>\"You thought I just wanted sex.\"</p>\n<p>Which — yeah. It sounds <i>horrible</i> when he says it like that. \"Maybe.\"</p>\n<p>\"Dean Winchester, you are —\"</p>\n<p>\"I know, I'm sorry.\"</p>\n<p>Cas cuts off so quickly his tongue clicks against his teeth. His eyes narrow again, and Dean feels a sickly flood of heat crowd up underneath his jaw. He might actually puke. He thought he couldn't have it, and it turns out he did have it, and he <i>still</i> found a way to screw it all up.</p>\n<p>\"I have loved you a long time,\" Cas says finally, and Dean really is going to puke, he can already feel the pain in his gut, \"but I waited, because I know you can be wary of — of feelings.\"</p>\n<p>\"Cas —\"</p>\n<p>\"But that poltergeist — I thought I lost you. I wasn't going to wait anymore. And now you tell me you thought I —\"</p>\n<p>\"I didn't know.\" The bunker's basements are usually cool, but sweat is beading at the back of Dean's neck. \"You kept creeping out of my room, and you — Jesus, just come here,\" he says, pulling Cas close. They are the stupidest people alive. \"I — um. I love you too. You know that, right?\"</p>\n<p>Cas smiles. \"I do now.\"</p>\n<p>+</p>\n<p>Dean finds Sam in the library, frowning at a book on werewolf physiology. His ridiculous hair is tucked behind his ears. Dean clears his throat and Sam looks up at him, and they stare at each for a minute, long enough for things to feel awkward again, and Dean briefly considers putting this off, but — but.</p>\n<p>\"I just — um. I wanted to tell you that Cas and I are — you know. Together. Like <i>together</i> together.</p>\n<p>\"Dude,\" Sam says, reaching for his beer. \"Duh.\"</p>"
}