{
  "id": "26041309",
  "url": "https://archiveofourown.org/works/26041309?view_full_work=true",
  "author": [
    "inkinmyheartandonthepage"
  ],
  "title": "We Forgot To Tell Peter",
  "rating": "General Audiences",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings",
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "Marvel Cinematic Universe",
    "The Avengers (Marvel Movies)"
  ],
  "relationships": [
    "Peter Parker & Tony Stark",
    "Pepper Potts/Tony Stark"
  ],
  "characters": [
    "Peter Parker",
    "Tony Stark",
    "Pepper Potts",
    "May Parker (Spider-Man)",
    "Happy Hogan",
    "James \"Rhodey\" Rhodes",
    "Carol Danvers",
    "T'Challa (Marvel)",
    "Steve Rogers",
    "Natasha Romanov (Marvel)",
    "Bruce Banner",
    "Stephen Strange",
    "Wong (Marvel)",
    "Ned Leeds",
    "Michelle Jones",
    "Morgan Stark (Marvel Cinematic Universe)",
    "Clint Barton"
  ],
  "additional_tags": [
    "Avengers: Endgame (Movie) Spoilers",
    "Post-Avengers: Endgame (Movie)",
    "Post-Endgame",
    "Not Avengers: Endgame (Movie) Compliant",
    "Tony Stark Lives",
    "Tony Stark Has A Heart",
    "Tony Stark Needs a Hug",
    "Tony Stark Acting as Peter Parker's Parental Figure",
    "BAMF Tony Stark",
    "Peter Parker Needs a Hug",
    "Precious Peter Parker",
    "Homeless Peter Parker",
    "Peter thinks Tony is dead",
    "Everybody Lives",
    "Avengers screw up",
    "Illnesses",
    "Sick Peter Parker",
    "Peter Parker Whump",
    "Peter Parker is a Mess",
    "Hurt Peter Parker",
    "Worried Tony Stark",
    "Worried Avengers",
    "Worried May Parker (Spider-Man)",
    "Awesome Carol Danvers",
    "Wakanda (Marvel)",
    "Fix-It of Sorts",
    "Nobody is Dead",
    "Alternate Universe - Everyone Lives/Nobody Dies"
  ],
  "language": "English",
  "series": "Part 1 of We Forgot Peter",
  "published": "2020-08-22",
  "completed": "2022-05-24",
  "words": "6,940",
  "chapters": "2/2",
  "comments": "260",
  "kudos": "11,210",
  "bookmarks": "1,000",
  "hits": "136,123",
  "summary": "<p>In the chaos of Tony snapping the gauntlet, rushing him to the nearest hospital and the reality of having saved the universe, the Avengers forgot to actually tell Peter that Tony had survived. Now he's missing and nobody can find him to tell him that Tony survived.</p>",
  "notes": "<p>Hi guys! </p>\n<p>I hope everyone is staying safe in these crazy times. I know that a lot of people are stuck at home so I hope this brings a little joy to you all. Keep up the social distancing and remember to take care of one another. This won't last forever so just hang in there. </p>\n<p>I'm going to make this a mini series so keep an eye out for more to come - if you have any prompts where \"they forget to tell Peter something\" feel free to shoot me a message and I can write something up :) </p>\n<p>My apologies for any mistakes and I hope you enjoy.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>Massive thank you to the Irondad Creator Awards for putting everything together and all the hard work that you have done! Thank you so much for giving us creators a chance! </p>\n<p>Huge thank you to everyone who voted for this series! I never expected it to turn out the way it did! A year later and it's still going and will be returning soon! Thank you all so much for you love and support!</p>\n<p>Happy reading and stay safe x</p>",
  "text": "<p> </p>\n<p> </p>\n<p>Peter’s ears were ringing as he stumbled over the debris, eyes searching the battlefield frantically. His heart plummeted in his stomach as he finally found who he was looking for. He took a few jerky steps forward, trembling hand reaching out towards Tony Stark. The elder man’s face was ashen, the heavy damage to his face making Peter’s stomach roll uncomfortably. His mentor was propped up against some debris, chest barely rising and falling, gaze vacant.</p>\n<p> </p>\n<p>“Mr –“ Peter could barely get the words out, blood tainted saliva filling his mouth and making him choke.</p>\n<p> </p>\n<p>Before Peter could even try again to call out again, Tony was obscured from his view. Peter hesitated, something akin to a whimper falling from his lips, eyes darting around the group that surrounded the man. He recognised them all, even beneath all the filth, dirt and blood they were all covered in. How could he not recognise Pepper Potts or Col. Rhodes? To not know who Captain America, Thor, Hawkeye, Black Widow and The Hulk were? (Though admittedly the Hulk looked a little different from the pictures Peter had seen).</p>\n<p> </p>\n<p>Peter swayed on the spot when he saw Mr Strange (“<em>Doctor Strange,” “Oh, we’re using made up names.”</em>) strode towards the group, red cloak swaying with each purposeful step. The group parted for the man, Peter only managing to see the back of Pepper’s head, before they converged around Tony once again, blocking him from every angle.  </p>\n<p> </p>\n<p>Peter wanted to take another step towards the group, but his feet remained rooted on the ground. He tried to listen, but there was too much ringing in his ears that he couldn’t make out what they were saying in the distance between them.</p>\n<p> </p>\n<p>Then bright orange sparks were filling the air, a clear, sterile room on the other side of the portal too bright for the darkened battlefield. Then the group was rushing through and the portal closed leaving nothing but empty space.</p>\n<p> </p>\n<p>Peter stumbled, mouth opening and closing uselessly as he stared at the empty space where Tony had been.</p>\n<p> </p>\n<p>“Where,” Peter croaked out, his voice horrible and rough. “Where did they go?”</p>\n<p> </p>\n<p>“No idea, kid.”</p>\n<p> </p>\n<p>Peter turned at the voice on his left to find Quill (or was it Star Lord? Peter couldn’t remember which one it was) standing not too far from him. Quill wasn’t looking at him, instead his gaze trained on a green woman who stood next to a blue woman a few feet away.</p>\n<p> </p>\n<p>“I am Groot.”</p>\n<p> </p>\n<p>“I dunno, he looked pretty dead to me.”</p>\n<p> </p>\n<p>Peter stared at the tree and racoon that had spoken, his mind processing nothing other than the fact that Tony Stark was <em>dead</em>. His knees buckled and he sunk into the dirt beneath him, breath hitching in his chest as he stared blankly ahead. The ringing in his ear grew louder as his mind tumbled over the same thought over and over again.</p>\n<p> </p>\n<p>\n<em>Tony was dead. Tony was dead. Tony was dead. </em>\n</p>\n<p>\n<em> </em>\n</p>\n<p>“Hey Peter Parker.”</p>\n<p> </p>\n<p>Peter blinked, registering the fact that a woman was crouching down in front of him. She was familiar and Peter was sure that at some point she had been glowing. Her smile was soft, and patient. He wondered how long the woman had been trying to get his attention.  </p>\n<p> </p>\n<p>“Hi,” Peter whispered.</p>\n<p> </p>\n<p>“Are you hurt?” she asked.</p>\n<p> </p>\n<p>“I’m fine,” Peter said automatically, blinking once. “I heal fast.”</p>\n<p> </p>\n<p>“That’s pretty handy,” she smiled, her eyes flickering over his face.</p>\n<p> </p>\n<p>“You were glowing,” Peter spoke but the words didn’t feel like they were coming from him. “That was awesome.”</p>\n<p> </p>\n<p>She winked at him and Peter wanted to ask how she had done that, but he couldn’t bring himself to ask. Tony was dead.</p>\n<p> </p>\n<p>“ – art moving out. The area isn’t that safe. Are you okay to move?”</p>\n<p> </p>\n<p>Peter forced himself to focus on the woman before him, to process the words that she was saying. “Sure.”</p>\n<p> </p>\n<p>It took an embarrassing long time for him to register that she was holding her hand out to him to take. He finally lifted his arm, hand trembling and placed it in her hand. She squeezed his hand gently before she was pulling him to his feet. They felt like lead, exhaustion sinking into his bones making his knees buckle again. He was kept upright though before he could face plant into the dirt.</p>\n<p> </p>\n<p>“M’fine,” Peter mumbled as the woman cupped his elbow to keep him steady.</p>\n<p> </p>\n<p>“You got it,” she encouraged as she led him over to a small group that was huddling together.</p>\n<p> </p>\n<p>He recognised nobody and knew that he should feel the familiar prick of his senses giving him off a low warning but there was nothing. It had abandoned Peter the moment Tony died.  </p>\n<p> </p>\n<p>“One more, Wong.”</p>\n<p> </p>\n<p>“Fine,” Wong grumbled. He waved his arms in a wide circle and more orange sparks filled the air, opening another portal. The group converged forward and Peter was moved along with them by a strong, firm hand on his back.</p>\n<p> </p>\n<p>He didn’t recognise the room. It large, spanning further than Peter had the energy to absorb. There were too many people, too much movement for him to take in the intricate details and beauty of the room. Their voices, tears and hurt all bled together until all Peter could hear was ringing.</p>\n<p> </p>\n<p>He wasn’t aware that he had been moving until he was blinking at the small cot he was pushed down onto. It took him a moment to comprehend that the room was full of them, most of the cots already claimed by those being tended too with medical supplies.</p>\n<p> </p>\n<p>“Where are we?” Peter asked.</p>\n<p> </p>\n<p>“I’m told we are in Wakanda,” the woman said, gently lifting Peter feet until she manoeuvred him until he was lying down. “They are letting us recover here.”</p>\n<p> </p>\n<p>“Oh, that’s nice of them,” Peter blinked. A blanket was draped over him and Peter wanted to feel embarrassed for being tucked in like a toddler, but he couldn’t feel anything. He just allowed himself to be moved in any way that she wanted.  “What’s your name?”</p>\n<p> </p>\n<p>“Carol Danvers.”</p>\n<p> </p>\n<p>“Thank you, Carol Danvers.”</p>\n<p> </p>\n<p>“You’re welcome Peter Parker,” Carol smiled soft and kind “Get some rest. Use that magical healing of yours.” And making sure he was completely covered by the blanket; she turned and made her way through the cluster of people leaving Peter all alone.</p>\n<p> </p>\n<p>Peter stared at the ceiling, blinking slowly at the crack his gaze latched onto. He listened to the ringing in his ears, eyes tracing the crack over and over again with the constant loop of <em>Tony’s dead</em> playing in his mind.</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>Exhaustion had won out and Peter woke up to his stomach rumbling the smell of fresh food close by. He blinked at the wall, body uncurling from where he had naturally curled up in his sleep. His body ached as he stretched but there were no broken bones that prevented him from sitting up.  He scrubbed at his eyes as they stuck together and wondered how long he had been asleep for.</p>\n<p> </p>\n<p>“Hello.”</p>\n<p> </p>\n<p>Peter turned at the voice and saw a man crouching down beside his cot, holding a tray of food. He was dressed in a way that Peter wasn’t used to seeing and it took him a moment to remember that he had been taken to Wakanda.</p>\n<p> </p>\n<p>“Hi,” Peter murmured back.</p>\n<p> </p>\n<p>“What is your name?” the man asked.</p>\n<p> </p>\n<p>“Peter. What’s yours?”</p>\n<p> </p>\n<p>Something flickered in the man’s eyes and he smiled warmly at Peter. “I’m T’Challa. Here, I have brought you some breakfast. Eat and when you are done, we will get you a shower.”</p>\n<p> </p>\n<p>Peter blinked at the King, taking the tray that was pushed into his hands. “Uh – I – thank you –“</p>\n<p> </p>\n<p>“Eat, Peter,” T’Challa rose from his crouch.  </p>\n<p> </p>\n<p>Peter did as he was told, eating automatically but not tasting a thing. It was a shame because it looked delicious and in any other circumstances, he would have been in awe that he was eating food that <em>the </em>Black Panther had personally given him.</p>\n<p> </p>\n<p>But Tony was dead, and he had taken a part of Peter’s soul with him.</p>\n<p> </p>\n<p>When his tray was finished, T’Challa returned, taking it from his limp hands and tucking it under his arm.</p>\n<p> </p>\n<p>“Would you like to take a shower now?” the king asked.</p>\n<p> </p>\n<p>“Yes please,” Peter said, not really knowing what else to say. He untangled himself from the blanket, folding it once, twice, three times and then a fourth, before laying it gently on the bed.</p>\n<p> </p>\n<p>“Follow me,” T’Challa said and Peter fell into step with the King.</p>\n<p> </p>\n<p>Peter didn’t remember much of the walk to the bathroom, his mind stuck and skipping like a broken record; <em>Tony’s dead, Tony’s dead, Tony’s dead</em>. His jaw did drop as he took in probably the most beautiful bathroom he had ever seen. He feared touching anything, sure that he would cover it in filth. Everything was so pristine and so <em>grand </em>that it made Peter’s home look a cardboard box in comparison. A sudden ache blossomed in his chest that had tears pricking at the back of his eyes and he flared his nostrils to keep them from falling.</p>\n<p> </p>\n<p>“Take all the time you need,” T’Challa said. “If you need anything, there will be a guard outside the doors. Just ask them.”</p>\n<p> </p>\n<p>“Thank you,” Peter whispered, voice cracking.</p>\n<p> </p>\n<p>T’Challa smiled, kind enough not to say anything about Peter being nearly in tears and left the bathroom, the large oak doors falling closed behind him. Peter crossed the room and locked the doors before he looked in the large glass mirror.</p>\n<p> </p>\n<p>He stared at his reflection, not quite believing that it was him. He was pale underneath all the dirt and blood and his eyes had dark circles underneath them. His hair was mattered with gunk and he looked younger than he felt.</p>\n<p> </p>\n<p>Dropping his gaze, Peter turned his back on the mirror and disengaged the suit, the armour falling to a heap on the floor. His first suit sat firmly against his body and was cleaner than the Iron Spider suit but not completely unscathed. He tapped the spider emblem on his chest, the suit fluttering as it billowed out and slid down his body. He pulled off his boxers, leaving everything in a heap before stepping into the shower.</p>\n<p> </p>\n<p>He shivered as he stepped under the warm spray of the water, dunking his head underneath and simply stood there. The water rushed through his ears, drowning out the ringing and thundered against his ears drums until it was the only thing he could think or feel. The water ran a mixture of brown and red until Peter remembered that he had to wash himself. His hair needed four washes, the shampoo giving his curls a tropical scent. The soap smelled like lemongrass as he rubbed it over every inch of his skin, over and over again until the rhythm nearly had him falling asleep standing up.</p>\n<p> </p>\n<p>The water never ran cold, but Peter did eventually switch it off, leaving him standing their dripping until a full body shiver had him reaching for a fluffy towel and drying himself. Fresh clothes had been left for him and he pulled on the fitted jeans, plain black t-shirt and navy coloured hoodie. There were even a pair of shoes that were a little big but wearable.</p>\n<p> </p>\n<p>Peter scanned the room, eyes catching the bin that was tucked in the corner. Peter took out the lining (thankful that it was empty) and piled his suits inside before tying it up. He hung his towel over the edge of the shower and looked about the bathroom. He was sure what he was supposed to do now.</p>\n<p> </p>\n<p>May would know what to do.</p>\n<p> </p>\n<p>Picking up the bag, Peter made his way out the bathroom and into the hall. He started walking in a direction, hoping that it was the right way. He scanned the halls as people flittered by, nobody really stopping to look at him. He hoped to see Carol but couldn’t see the familiar blonde. He did however see Wong up ahead and then he was jogging up to the man before he knew what he was doing.</p>\n<p> </p>\n<p>“Can you take me home?” Peter gasped as soon as he close enough.</p>\n<p> </p>\n<p>Wong turned to raise an eyebrow at him. “Do I look like a taxi service to you?”</p>\n<p> </p>\n<p>“Please,” Peter begged. “I have to go home. I have to – my Aunt – I need to see her.”</p>\n<p> </p>\n<p>Wong stared at him for a beat before rolling his eyes. “You’re lucky I’m already heading out. What’s the address?”</p>\n<p> </p>\n<p>“15th Street, Queens, New York City, New York,” Peter rattled off.</p>\n<p> </p>\n<p>Wong nodded and Peter watched as orange sparks filled the hallway until Peter building grew larger and larger before his eyes. Without hesitation Peter was stepping through, onto the familiar street.</p>\n<p> </p>\n<p>The street was busy, and nobody appeared to be fazed by a teenage boy stepping out of thin air. People were embracing one another, dancing in the streets as music blared from all directions. The joy and relief in the air was palpable but Peter couldn’t feel it. How could he when Tony was gone.</p>\n<p> </p>\n<p>“You good kid? I have to get back to the Sanctum,” Wong said.</p>\n<p> </p>\n<p>“Yes. Thank you,” Peter nodded and then the orange sparks were gone, and Peter was wholly surrounded by Queens.</p>\n<p> </p>\n<p>Heartbeat galloping in his chest, Peter ran into the building, forgoing the elevator to rush up the stairs two at a time until he was bursting out onto the seventh floor and sprinting to his door. He patted his pockets for his keys before remembering they were in his backpack which was somewhere hidden in New York that he had webbed to a brick wall five years ago.</p>\n<p> </p>\n<p>The breath was knocked out of Peter chest at the thought and he pounded on the door, choking out “May! Aunt May!”</p>\n<p> </p>\n<p>He heard movement on the other side of the door, and he choked on a sob as the dead bolt was turned and the door was opening.</p>\n<p> </p>\n<p>“Aunt May I – I – you’re not – who are you?” Peter stammered, stumbling back as he took in the woman who was defiantly not his aunt.</p>\n<p> </p>\n<p>She looked younger than May did, peering at him cautiously as she half hid herself behind the door. “I’m Kate. This is my apartment.”</p>\n<p> </p>\n<p>“What?” Peter said stupidly. “I live here. This is my house.”</p>\n<p> </p>\n<p>Something flickered across the girls face until she was looking at him with such pity that Peter could practically taste it. “You were dusted, huh?”</p>\n<p><br>“Where’s my Aunt?”</p>\n<p> </p>\n<p>“I don’t know, I took over the rent three and a half years ago,” Kate hesitated, biting her lip before adding. “The woman, your aunt, moved out. She hadn’t been dusted.”</p>\n<p> </p>\n<p>Peter opened his mouth, but nothing came out. May had moved? She had left their apartment, packed up all their things and just gone? Peter tried to think where she would have gone but his mind couldn’t get passed the fact that May had left.</p>\n<p> </p>\n<p>“Sorry kid,” Kate said. “You should try the Displacement Centres their setting up at all the schools.”</p>\n<p> </p>\n<p>Peter nodded dumbly and didn’t care when Kate slowly shut the door on him, the dead bolt sliding back into place. He turned and walked numbly to the stairs. His body jolted with each lethargic step he took until he was crossing the lobby and stepping out onto the street where the celebrations continued.</p>\n<p> </p>\n<p>Peter started walking, no destination in mind because there was no destination. May had packed up, left and could be anywhere. He had no money, no way of contacting her or if she still even had the same number to contact her with. Tony was dead, gone, unreachable.</p>\n<p> </p>\n<p>Peter wished he had never woken up on Titan.</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>“What do you mean you don’t know where he is?” Tony growled, glaring at the group that stood around his bed.</p>\n<p> </p>\n<p>Tony had woken up in an unfamiliar bed, left side numb with a sleeping Morgan on his chest and Pepper’s beautiful (and slightly wet) smiling face hovering over him.</p>\n<p> </p>\n<p>“Hey sleepy head,” Pepper greeted him, voice soft and warm, hand gently carding through his hair. “Glad to see you finally joining us.”</p>\n<p> </p>\n<p>“Wha’d I miss?” Tony slurred, right arm tightening around Morgan, hugging her closer. His little girl hadn’t woken up, simply snuggled deeper into his neck.</p>\n<p> </p>\n<p>“Three weeks,” Pepper pressed a kiss to his temple. “Not bad considering your left arm is gone and you look like you lost a battle with a hacksaw.”</p>\n<p> </p>\n<p>Tony glanced down at his left side, vision tilting for just a second before the heavily bandaged stump that had once been his left arm came into view. “Huh, look at that.” He rolled his head back to Pepper and smiled at her. “Didn’t like that one that much anyway.”</p>\n<p> </p>\n<p>Pepper laughed, more tears spilling out of her eyes before she was hugging Tony around the neck tightly, squishing Morgan between the two of them and whispering, “Me either.”</p>\n<p> </p>\n<p>It took him another couple of days to stay awake for more than ten minutes at a time and for him to realise that through the constant visits from the team, Peter had yet to see him. Three weeks was far too long for him not to be holding his kid in his arms. (<em>“Wouldn’t it be one arm now that you lost your other one?” “Your daughter makes a good point” “Yeah, well just wait until I build myself a better arm.”</em>)</p>\n<p> </p>\n<p>“Alright guys, where’s my kid? Is he okay? He’s not hurt, is he?” Tony tried to get himself up out of bed only to be pushed back by Pepper’s firm hand.</p>\n<p> </p>\n<p>Happy had taken Morgan out to get some breakfast to, in Morgan’s words, leave them to their boring grown up talk.</p>\n<p> </p>\n<p>“Calm down, Tony, he’s probably catching up with his friends,” Pepper scolded before turning to the group that was keeping Tony company. “You called him, right? Told him that Tony was awake?”</p>\n<p> </p>\n<p>Both Tony and Pepper watched as Natasha, Bruce and Steve all shared a pointed look with one another.</p>\n<p> </p>\n<p>“Tell me you called Peter,” Tony voice was clipped as he stared at the three.</p>\n<p> </p>\n<p>“We can’t,” Bruce answered Tony. “He doesn’t have a phone.”</p>\n<p> </p>\n<p>“Then go and pick him up from where he’s been staying,” Tony growled, eyes flicking between the three of them.</p>\n<p> </p>\n<p>“We don’t know where he is,” Bruce said hesitantly.</p>\n<p> </p>\n<p>Pepper stood up and glared at the three Avengers. “What do you mean you don’t know where he is?”</p>\n<p> </p>\n<p>“After the battle Carol took him to Wakanda with the others to get treated,” Natasha explained, her expression not as closed off as it had once been as Tony could see the guilt on her face. “T’Challa said that he was fine. That he was eating, and he took Peter to have a shower, but the kid never came to see him again. We learned that Wong had taken Peter to his old apartment in Queens.”</p>\n<p> </p>\n<p>“May doesn’t live there anymore,” Tony sucked in a deep breath, good hand clenching the rail of his bed. “Hasn’t been there for over three years.”</p>\n<p> </p>\n<p>“Happy told us,” Steve shifted his weight, watching Tony carefully. “Tony, we went looking for him. The girl who lived there said he came by, but she had sent him to the Displacement Centres that were being set up.  We tried them, but we don’t know where he’s gone.”</p>\n<p> </p>\n<p>“When did you start looking for him?” Tony demanded.</p>\n<p> </p>\n<p>“Last week,” Natasha admitted after a long pause of silence.</p>\n<p> </p>\n<p>“He’s been on his own for three weeks?” Pepper gasped, hand coming to her mouth and she shared a horrified look with Tony.</p>\n<p> </p>\n<p>“With the clean-up, the press wanting to know what happened, everyone being un-dusted, wondering if you were going to make it,” Steve listed. “We forgot about Peter. We assumed he was still in Wakanda and didn’t think-”</p>\n<p> </p>\n<p>“Are you telling me that I invented time travel to get my kid back, and you <em>fucking lost him?!</em>” Tony exploded.</p>\n<p> </p>\n<p>Everyone flinched.</p>\n<p> </p>\n<p>“Where is Rhodey?” Tony snapped, looking around the room as if he expected the man to suddenly appear.</p>\n<p> </p>\n<p>“He’s out looking for Peter now,” Bruce said. “He got called back to work while you were unconscious. He thought Peter was still in Wakanda under T’Challa’s care.”</p>\n<p> </p>\n<p>Tony scrubbed at his face, wincing as his hand brushed over the still sensitive scars. “Have you called his Aunt? Told her what’s going on?”</p>\n<p> </p>\n<p>“Happy did,” Natasha answered. “As soon as he found out. He said May’s trying to get a flight back into the States, but the flights have been fully booked. She’s hoping to be here by Monday.”</p>\n<p> </p>\n<p>“Did you try tracking his suit?” Pepper asked, pulling out her phone and switching it on. The phone chimed as it loaded up and so was buzzing with frequent messages coming through. She ignored them all, looking at the only ones from May Parker.</p>\n<p> </p>\n<p>“We did,” Bruce said. “We think it was damaged in the battle and we haven’t been able to a location.”</p>\n<p> </p>\n<p>“Right,” Tony winced as he pulled the IV out of his arm, ignoring the <em>‘TONY!’ </em>that got him.</p>\n<p> </p>\n<p>“Tony,” Steve stepped forward, halting Tony’s attempt to get out of bed. “You’re still healing. We have everyone focusing on Peter. We will find him, but you have to stay here.”</p>\n<p> </p>\n<p>“Rogers, you let me get out of this <em>fucking </em>bed right now. My kid is missing. You <em>forgot </em>about him. Move.” Tony growled.</p>\n<p> </p>\n<p>“You shouldn’t be standing,” Steve pressed, face pinched with stress.</p>\n<p> </p>\n<p>“Then get me a wheelchair,” Tony snapped. “<em>Fucking hell Rogers,</em> I need my kid.”</p>\n<p> </p>\n<p>Steve clenched his jaw, lips pressed tightly together before he stepped across the room and wheeled the chair that sat in the corner over to Tony. “You have to stay in the chair.”</p>\n<p> </p>\n<p>Tony levelled him with a glare as he swung his legs out of the bed.</p>\n<p> </p>\n<p>“Tony, I think you are forgetting something,” Pepper said.</p>\n<p><br>“What?” Tony turned to look over his good shoulder, wincing as the scars on his neck pulled.</p>\n<p> </p>\n<p>“You’re in a hospital gown,” Pepper smirked, eyes pointedly gazing him up and down.</p>\n<p> </p>\n<p>“I’ve been seen out in weirder outfits,” Tony grunted, turning to face forward again. He continued to edge himself closer to the edge of the bed, his feet nearly touching the floor.  </p>\n<p> </p>\n<p>“I can already feel Peter’s embarrassment for when he learns you went out looking for him in a hospital gown that tied up at the back,” Pepper mused.</p>\n<p> </p>\n<p>Tony paused for a beat before letting his feet touch the ground. His legs wobbled dangerously, and he ignored the way Steve looked as if he was about to lunge for him and strap him back on to the bed. He grunted as he shifted his weight and all but fell into the wheelchair. He gritted his teeth against the new wave of pain that radiated up his side and looked to his wife.</p>\n<p> </p>\n<p>“First stop, Pep, the hotel to get me some less Peter embarrassing clothes,” Tony huffed. “Then we go find our kid.”</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>“Happy, please tell me you have found Peter,” were the first words May Parker said to the Asset Manager as she stepped out customs.</p>\n<p> </p>\n<p>“Not yet,” Happy said gravelly, taking her suitcase from her hand. He placed a steady but gentle hand on her back, propelling her forward. “We’re going to find him though. Tony’s got everyone looking for him.”</p>\n<p> </p>\n<p>“Can’t he track the suit?” May asked. “Tony promised me that he put everything in that suit. That he would <em>always</em> be able to find Peter in it.”</p>\n<p> </p>\n<p>“He did,” Happy assured her, weaving them through the large groups of people milling about the airport. “But with the last battle, we think it go damaged so it’s offline.”</p>\n<p> </p>\n<p>They made it outside where Happy’s car was waiting right out front. While he placed her suitcase in the boot, May slipped into the passenger seat, buckling herself up. As soon as Happy was in the car and pulling into traffic she turned as much as she could in her seat to face him.</p>\n<p> </p>\n<p>“Just run through everything you’ve done so far again, please,” May said, the small wrinkles around her eyes creasing. “You contacted his friends?”</p>\n<p> </p>\n<p>Happy nodded, briefly glancing at May before looking back at the road. “We contacted Ned. He hasn’t seen or heard from Peter. He said his family had moved so Peter doesn’t know where to find him. We contacted MJ too, but she hasn’t heard from him either. They both promised to keep an eye out for him.”</p>\n<p> </p>\n<p>“What about Spider-Man?” May asked, looking at her phone. “I’ve been looking at all the news reports, but nobody has mentioned him.”</p>\n<p> </p>\n<p>“That’s because there haven’t been any sightings of him,” Happy said.</p>\n<p> </p>\n<p>“But Peter loves being Spider-Man,” May looked back to Happy. “He wouldn’t just give that up.”</p>\n<p> </p>\n<p>“We’re not sure,” Happy gripped the steering wheel tightly. “Boss says that Karen is still active.”</p>\n<p> </p>\n<p>“What? Karen, his AI?” May asked.</p>\n<p> </p>\n<p>“FRIDAY has been able to communicate with her but she’s not sure where Peter is or if he is injured,” Happy explained. “He hasn’t put on the suit since he left Wakanda.”</p>\n<p> </p>\n<p>“That was over three weeks ago!” May all but yelled. She leaned back heavily in her chair, the familiar string of tears filling her eyes.</p>\n<p> </p>\n<p>She thought that she would never see her baby again. When Peter had been dusted those five years ago, she had nearly broken. Pepper had been the one to call her, to share the news that Tony and Peter had gone to space but only Tony had returned. She had refused to speak to Tony. He had promised to keep her baby safe only for him to turn to ash on a planet she had no idea existed.</p>\n<p> </p>\n<p>Until one day Tony turned up on her doorstep, Peter’s Midtown sweater in his hands and told her that he and Pepper were expecting a baby and promptly burst into tears. Having never seen Tony Stark cry, May had automatically let him into the apartment and led him to the couch. They had spent the day talking out their grief, sharing stories, laughing, crying before they somehow became friends.</p>\n<p> </p>\n<p>They kept in touch, May even going over to the Lake House once a month to hang out until a year later May’s mother fell ill. May had packed up the apartment, putting most of it into storage before moving back to Italy but still kept in contact with the Stark family. The minute she realised that those who had been dusted were returning, she knew Tony had figured it out and started making plans to get home to Peter.</p>\n<p> </p>\n<p>“We’re going to find him, May,” Happy said. “Tony didn’t invent time travel just to lose Peter now.”</p>\n<p> </p>\n<p>May blinked. “Tony invented time travel?”</p>\n<p> </p>\n<p>Happy did his best to explain what had happened and by the time they reached the hotel, May was up to speed on everything that had gone down. He led May up to the top floor and to the suite that Tony, Pepper and Morgan were temporarily calling their home while they searched for Peter.</p>\n<p> </p>\n<p>“May,” Pepper greeted her as soon as she stepped into the room, pulling her into a tight hug. “Thank god you made it. How are you doing?”</p>\n<p> </p>\n<p>“Happy just explained time travel to me so I now have a headache,” May said.</p>\n<p> </p>\n<p>“I have just the pill for that,” Pepper said, taking her hand and leading her further into the room and towards the couch that was already occupied by Tony, Rhodey and the very recognizable Steve Rogers.</p>\n<p> </p>\n<p>May sat down, ignoring them for the moment and smiled at Morgan who was happily sprawled out on the floor, colouring by her father’s feet. When Pepper returned with two pills and a glass of water, May accepted them thankfully, swallowing down the pills and sculling the whole glass of water.</p>\n<p> </p>\n<p>“Thanks,” May gasped once she had finished, placing the glass on the coffee table. She wiped her mouth and finally turned her attention to Tony.</p>\n<p> </p>\n<p>He looked terrible. His left arm was noticeably missing and despite the glasses perched on his nose she could still see the scars that crawled up the side of face. He was pale, hair sticking up in all directions and was in a serious need of a shave.</p>\n<p> </p>\n<p>“Lost some weight I see,” May nodded at Tony.</p>\n<p> </p>\n<p>Tony’s lips quirked into a smile while Rhodey smothered a laugh behind his hand. She ignored the face of discomfort that Steve made, not too happy with the super solider who hadn’t been keeping an eye out on her nephew while Tony had been unconscious.</p>\n<p> </p>\n<p>“You look good too, May,” Tony said.</p>\n<p> </p>\n<p>“Please tell me you are close to finding Peter,” May begged. The silence that followed didn’t fill her with any confidence.</p>\n<p> </p>\n<p>“We’ve checked all the Displacement Centres in Queens and in the surrounding areas,” Rhodey said. “Nobody’s can verify that they have seen them because of the amount of traffic they are getting but we check every day.”</p>\n<p> </p>\n<p>“We’ve got his photo up at each centre with a number to call,” Tony said. “Just in case he sees them but nothing so far.”</p>\n<p> </p>\n<p>May sighed, head dropping into her hands. She took a few steadying breaths before she was clearing her throat and looking back up again. “Okay. He’s a fifteen-year-old with no money, no phone and with only the clothes on his back. Where would he go.”</p>\n<p> </p>\n<p>“He has to be getting food from somewhere,” Tony said. “We’ve checked the sandwich place he loves but the owner hasn’t seen him. He promised to call if he did show up.”</p>\n<p> </p>\n<p>“There are so many food drives around the city that he could be going to one of those,” Steve said. “We’ve been staking them out but no luck yet.”</p>\n<p> </p>\n<p>“Oh Peter,” May whispered to herself.</p>\n<p> </p>\n<p>“We’re going to find him,” Pepper said, arm coming around May’s shoulder to hug her tightly.</p>\n<p> </p>\n<p>“I just don’t understand why he didn’t come back,” May said, looking to Pepper. “If he knew I wasn’t there, why didn’t he come back to you or Tony? Why would he just disappear like this? This isn’t like him.”</p>\n<p> </p>\n<p>“Maybe he’s scared,” Morgan piped up from the floor.</p>\n<p> </p>\n<p>“What do you mean sweet pea?” Tony asked, gently smoothing his daughter’s hair back with his good arm.</p>\n<p> </p>\n<p>“I was a little scared when I saw Daddy at the hospital,” Morgan admitted. “And I wanted to hide but mummy said that even though daddy was ugly now it wasn’t anything to be afraid of.”</p>\n<p> </p>\n<p>“I didn’t not call you ugly,” Pepper told Tony, as he shot her a betrayed look.</p>\n<p> </p>\n<p>“I called you ugly,” Rhodey grinned. “But then, you’ve always been ugly.”</p>\n<p> </p>\n<p>“I am the best-looking man in this room,” Tony huffed and gave Rhodey’s braces a pointed look. “And the best-looking cripple.”</p>\n<p> </p>\n<p>“Sure you are, Tony Stank,” Rhodey hummed. “Whatever helps you sleep at night.”</p>\n<p> </p>\n<p>“The <em>point </em>is that Peter’s scared,” Pepper said. “May, are there any places that Peter would go to seek some comfort?”</p>\n<p> </p>\n<p>“To you,” May looked directly at Tony. “I don’t know why he hasn’t come to you.”</p>\n<p> </p>\n<p>“We’ll find him,” Tony swallowed thickly, looking older than May had ever seen him look. “I promise, we’ll find him.”</p>\n<p> </p>\n<p> </p>\n<p>Peter’s limbs protested as his body curled up tightly in an attempt to fight off the chill in the air. His stomach cramped and rebelled against the small portion of stale bread he had found behind the service station. It was the only thing he had eaten in the past two days, the only thing he had been able to find. People weren’t wasting food anymore and so scraps were hard to come by.</p>\n<p> </p>\n<p>He tried to eat at the food drives. By the time Peter managed to wake himself up and drag him to the drives, the lines were long, and he mostly missed out. When he did manage to get there early, the portions were small, and he was too hungry to think about rationing it. It just made him tired and weak.</p>\n<p> </p>\n<p>He slept a lot. After the first time someone stole his shoes during the night Peter tucked himself into high, tight corners under bridges so they couldn’t rob him of anything else. It worked at first, until he was so weak, he fell off into the water below and struggled to swim back to shore. He had managed to keep hold of his suits even though he couldn’t put them back on.</p>\n<p> </p>\n<p>Peter found new places to sleep but his senses were too loud, the city too much for him and so he had to leave. He walked as far as he could, his suit and a single piece of cardboard his only possessions. He walked until his feet bled and the sound of the city no longer could torture him. There was nothing left in the city for him anyway.</p>\n<p> </p>\n<p>He found a patch of dense trees and made himself a shelter. It wasn’t the greatest, but it mostly kept him dry and some of the wind out. When hunger overwhelmed him he found a service station not too far and that’s where he found his scraps of food. But it was getting harder and harder to walk, his feet sore and aching constantly.</p>\n<p> </p>\n<p>It didn’t matter. There was nobody left worry about Peter Parker.</p>\n<p> </p>\n<p>Ned had moved and Peter couldn’t find him, and he had no idea where MJ lived. He had no phone to communicate with either of them and one time he tried to use the library a fight had broken out just as he was entering and even though he had nothing to do with it, they hadn’t let him in.</p>\n<p> </p>\n<p>“Mr Parker?”</p>\n<p> </p>\n<p>Something tugged at his hood and Peter whined as the cold air bit as his exposed cheeks and ears.</p>\n<p> </p>\n<p>“Mr Parker, Peter, can you hear me?”</p>\n<p> </p>\n<p>The voice was familiar, but Peter was <em>so tired,</em> and he couldn’t focus on anything other than getting warm. He curled tighter around his suits in order to protect them. His spider-sense wasn’t going off but none of his powers seemed to be working lately.</p>\n<p> </p>\n<p>“Help me move him.”</p>\n<p> </p>\n<p>Something was laid over Peter and he whined pathetically in the back of his throat as he was rolled over and wrapped in something heavy and warm. Something brushed against his cheeks, gentle and soft. Peter didn’t try to struggle, couldn’t even if he wanted to which he didn’t.</p>\n<p> </p>\n<p>“We have to hurry.”</p>\n<p> </p>\n<p>Peter’s stomach swooped as he was suddenly lifted, and his head swam. He didn’t remember being moved, but when became aware he was lying on something much softer than his piece of cardboard.</p>\n<p> </p>\n<p>“Where was he?”</p>\n<p> </p>\n<p>“Outside the city.”</p>\n<p>\n<em> </em>\n</p>\n<p>“What are you giving him?”</p>\n<p>\n<em> </em>\n</p>\n<p>“He needs nutrients. He’s malnourished, starving and dehydrated.”</p>\n<p>\n<em> </em>\n</p>\n<p>Peter whined when something pricked his skin, but he didn’t even have the energy to squirm away. Something brushed his hair back from his face, soft and soothing and familiar. But it couldn’t be true because Peter didn’t have anyone familiar anymore. Everyone was gone.</p>\n<p> </p>\n<p>He must have spaced out again because he became aware of the ache in his feet and he flinched, legs kicking out weakly as sharp pain radiated up his arches.</p>\n<p> </p>\n<p>“It’s okay, Underoos. You’re okay. Shhhhh, I know it hurts but you’re going to be okay.”</p>\n<p> </p>\n<p>Peter whined, kicking out again as another sharp pain flared up his feet but something was smoothing back his hair. He rolled his head to the side, prying open his eyes. He blinked; his vision blurry as he tried to focus. Eventually the room came into focus and Peter was aware of a body right beside him.</p>\n<p> </p>\n<p>“Hey, you with us?”</p>\n<p> </p>\n<p>Peter stared at the man. The sharp angles of his face, the brown eyes full of worry were all hauntingly familiar. There were new scars on one side of his face and Peter whined at the sight.</p>\n<p> </p>\n<p>“M’ I dead too?” He whispered.</p>\n<p> </p>\n<p>“No Pete, you’re not dead. You’re going to be just fine,” Tony soothed.</p>\n<p> </p>\n<p>“Oh,” Peter let his eyes slip closed again. “Dreamin’.”</p>\n<p> </p>\n<p>“No, kiddo. I’m here. Can you open your eyes for me again,” Tony pleaded.</p>\n<p> </p>\n<p>Peter didn’t want to, didn’t want to open his eyes again and see that Tony wasn’t there but his voice had sounded so sad that Peter pried them open once again. He blinked in shock to see that Tony was still there, face closer than before.</p>\n<p> </p>\n<p>“M’ dreaming. S’not real. You’re dead,” Peter mumbled.</p>\n<p> </p>\n<p>Tony’s face creased as he frowned. “No kid, I’m not dead. I’m right here. You’re not dreaming. I promise you.”</p>\n<p><br>“S’raccoon said you were dead,” Peter blinked.</p>\n<p> </p>\n<p>“What – Rocket,” Tony’s lips pursed into a thin line. “I’ll kill that rodent.” Tony sighed heavily and cupped Peter’s face. “I promise you kid, that I am alive. I’m right here and I’m not going anywhere.”</p>\n<p> </p>\n<p>Peter leaned into the touch, a tear rolling down his cheek. “Tony?”</p>\n<p> </p>\n<p>“Yeah kiddo, it’s me,” Tony soothed, his voice soft and fatherly like.</p>\n<p> </p>\n<p>“Hurts,” Peter mumbled.</p>\n<p> </p>\n<p>“I know. I’m taking care of it. You can go back to sleep,” Tony said.</p>\n<p> </p>\n<p>Peter’s eyes slipped closed willingly and he hummed in the back of his throat, drifting off once again.</p>\n<p> </p>\n<p> </p>\n<p>Tony felt the moment Peter drifted back off to sleep and he gently wiped the tear away from Peter’s cheek. His kid was in desperate need of a shower; hair oily and littered with dirt and he was pretty sure the kid had lice.</p>\n<p> </p>\n<p>“His healing factor has started again,” Strange said, voice low in the room.</p>\n<p> </p>\n<p>Tony looked towards the end of the large hotel bed where Strange was re-wrapping Peter’s feet in bandages. Around the bed IV lines had been set up to get Peter’s nutrients back up and to get him re-hydrated. The curtains of the room had been drawn shut, blocking out the streetlights. Pepper, Morgan and May were asleep in the opposite bedroom across the suite, Tony deciding to keep watch over Peter for the night.</p>\n<p> </p>\n<p>“Thank god,” Tony sighed.</p>\n<p> </p>\n<p>Along with the dehydration and starvation, Peter’s feet had been cut up badly and were infected. Strange had said that Peter’s healing factor was working overtime to keep him alive and if they hadn’t found him when they did, he most likely would have succumbed to the infection.</p>\n<p> </p>\n<p>“How’s your shoulder?” Strange asked, finishing with Peter’s bandages.</p>\n<p> </p>\n<p>“Fine,” Tony grunted. He was propped up against the headboard with a mountain of pillows and Peter tucked up against his good side. He was in a bit of pain but that didn’t matter because Peter as safe and back by his side. He would worry about himself when Peter was well again.</p>\n<p> </p>\n<p>“My apologies for not being here sooner,” Strange said, causing Tony to look up at the uncharacteristic words.</p>\n<p> </p>\n<p>“You had to return the stones,” Tony waved him off. “It’s not your fault.”</p>\n<p> </p>\n<p>“Still,” Strange pursed his lips. “I would have waited if I had known that his Aunt wasn’t there. Wong assured me he had gotten home safely.”</p>\n<p> </p>\n<p>“I more worried that the fact my kid thought I was dead,” Tony growled. “That nobody thought to keep him close. <em>They knew </em>I did this because of Peter and they left him on that battlefield by himself!”</p>\n<p> </p>\n<p>Strange had been the break they had been looking for. Two days after May arrived and several more useless searches, Strange had portaled into their hotel room in order to take a look of Tony’s arm and to assure them that the stones had been returned to their original times.</p>\n<p> </p>\n<p>“You,” Tony had pointed with his good arm. “You can find Peter.”</p>\n<p> </p>\n<p>“Mr. Parker is missing?” Strange had frowned, eyes flickering to each of them as he took in the tension in the room.</p>\n<p> </p>\n<p>“For over three weeks,” Tony had growled. “Track him. Use your witchcraft and find my kid.”</p>\n<p> </p>\n<p>“Give me ten minutes,” and Strange had portaled right back out of the room. True to the sorcerer’s word, he returned ten minutes later with Peter swaddled in his red cloak. There had been a flurry over movement as Strange started barking orders, and they hurried to turn down one of the beds and Peter was laid down.</p>\n<p> </p>\n<p>Tony had nearly keeled over at the sight of his kid, only Rhodey’s strong grip around him keeping him upright. Peter had looked better on the battlefield. The clothes he wore were filthy and stunk up the room, but it was the sight of his very visible ribs and sunken cheek bones that had Tony’s stomach rolling at the sight.</p>\n<p> </p>\n<p>May hadn’t been much better, promptly bursting into tears at the sight of her nephew while Steve and Natasha had followed Strange’s orders to get him settled while he opened a portal into a medical facility, grabbing everything he would need.</p>\n<p> </p>\n<p>“Get some rest, Strange,” Tony said, looking at the Sorcerer. “You’ve earned it.”</p>\n<p> </p>\n<p>Strange nodded. “I’ll return in the morning. When he wakes, I would like him to try something solid. The sooner we can the faster we can get him into a shower.”</p>\n<p> </p>\n<p>Tony snorted quietly and couldn’t help but agree. His kid was rank, but that didn’t stop Tony from pressing a kiss to his forehead and hugging his son closer. It would be a long time before he let his kid back out of his sight.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>\n<img src=\"https://64.media.tumblr.com/6ffeaa614cdd2f9215154c3ce930ccd2/467e6f36845dcbcb-ba/s400x600/d5322e0a864d45a6a61de6f8e5ff6c48a085710f.jpg\" alt width=\"400\" height=\"566\">\n</p>"
}