{
  "id": "26071870",
  "url": "https://archiveofourown.org/works/26071870?view_full_work=true",
  "author": [
    "so_shhy"
  ],
  "title": "And the world's alright with me",
  "rating": "Explicit",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "陈情令 | The Untamed (TV)",
    "魔道祖师 - 墨香铜臭 | Módào Zǔshī - Mòxiāng Tóngxiù"
  ],
  "relationships": [
    "Lan Zhan | Lan Wangji/Wei Ying | Wei Wuxian"
  ],
  "characters": [],
  "additional_tags": [
    "Self-Indulgent",
    "Fluff",
    "Alpha/Beta/Omega Dynamics",
    "but like ABO lite",
    "there is no worldbuilding here",
    "it's just an excuse for",
    "Mpreg",
    "Unplanned Pregnancy",
    "Getting Together",
    "Did I already say self-indulgent?",
    "I feel like that needs to be emphasised",
    "brief instance of vomiting",
    "Alternate Universe - Modern Setting",
    "Mutual Pining"
  ],
  "language": "English",
  "series": "",
  "published": "2020-08-23",
  "completed": null,
  "words": "12,862",
  "chapters": "1/1",
  "comments": "345",
  "kudos": "12,122",
  "bookmarks": "2,444",
  "hits": "87,962",
  "summary": "<p>Wei Ying has been feeling like a grey, wrung-out, mildewed dishrag for a week when Lan Zhan slopes in from a trip to the store looking blank-faced and awkward and sets a pregnancy test down on the kitchen counter.</p>",
  "notes": "<p>So I had a stressful week and I got through it by churning out thousands of words of the most self-indulgent fluffy ABO mpreg imaginable. I was going to never let it see the light of day, but then I was like, hey, Wei Wuxian had no shame and nothing bad ever happened to him... ;D</p>\n<p>To my friends from outside of the internet: I am glad I came out to y'all as a fanfic writer. I'm even glad you guys know my AO3 name. But do me a favour and click on a different story. THIS ONE IS NOT FOR YOU.</p>",
  "text": "<p>Wei Ying has been feeling like a grey, wrung-out, mildewed dishrag for a week when Lan Zhan slopes in from a trip to the store looking blank-faced and awkward and sets a pregnancy test down on the kitchen counter.</p>\n<p>“Huh?” says Wei Ying. Then, “<em>What?</em> No!”</p>\n<p>“It is six weeks since your heat,” says Lan Zhan. “You spent it with an alpha.”</p>\n<p>“Yeah, with <em>you</em>,” Wei Ying says, somewhat petulantly because Lan Zhan has always seemed embarrassed about their arrangement, and that kind of thing stings a little bit. “And you’re on birth control. And <em>I’m</em> on birth control, so there’s no fucking way.”</p>\n<p>“No birth control is one hundred percent effective,” says Lan Zhan, and then he does that lethal manoeuvre where his eyes go all serious and soft and says, “Please.”</p>\n<p>Wei Ying has no defence against that look. So he goes into the bathroom and pees on a stick, and waits impatiently for two minutes because this whole thing is completely pointless. Then he looks at the result and frowns. He compares it to the picture on the box, and frowns again, and feels the prickle of sweat at his armpits. He sticks his head out of the bathroom door.</p>\n<p>“Can you go get me a different one?”</p>\n<p>Wordlessly, Lan Zhan hands over two more little boxes of different brands.</p>\n<p>“Oh. You were pretty sure about this, huh,” says Wei Ying, perfectly steady despite the bubbling hysteria in his gut.</p>\n<p>“Mn.”</p>\n<p>“Want to share with the class?”</p>\n<p>Lan Zhan’s ears go pink. “Your scent,” he says.</p>\n<p>“Bullshit.”</p>\n<p>“It’s… subtle.”</p>\n<p>So to add to the weirdness of the situation, apparently Lan Zhan has a pregnancy-related super-nose, even though nobody is supposed to be able to tell until like, month four. Wei Ying really wishes he could double down on his call of bullshit, but test number one seems to support the evidence. He looks at tests two and three, and realises he doesn’t have enough piss in him right now for them to be helpful.</p>\n<p>“I’m gonna drink some water,” he says. So he does that, and then sits down on the couch and leans up against Lan Zhan while they watch Say Yes to the Dress, and they don’t talk about how Lan Zhan accidentally maybe knocked him up.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>Tests two and three agree with test one. Wei Ying is quite literally fucked.</p>\n<p>“Okay,” he says, “what the hell do we do now?”</p>\n<p>Lan Zhan looks him dead in the eye and says, “Whatever Wei Ying wishes.”</p>\n<p>Wei Ying is very tempted to smack him in the mouth, because that is Not Helpful. What Wei Ying wishes is to not be in this situation in the first place. What Wei Ying wishes is to not be stuck with the bitter irony, that this – <em>this</em>, not the heats when he was in college and stupid and careless and Jiang Cheng bawled him out and told him what was going to happen – is how he earns himself a visit to the abortion clinic. </p>\n<p>“I want you to make me an appointment to get rid of it,” he says. “I have to go throw up.”</p>\n<p>He doesn’t. He’s queasy but he doesn’t puke, he just kneels in front of the toilet for long enough that Lan Zhan will have everything covered, and he can emerge and just ask <em>when, where, will you drive me?</em></p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>He’s always wanted babies. As a teen, he was secretly stoked to present as an omega because it meant he’d be able to have them on his own, even if he didn’t find the mate and the normal life that seemed so far off and implausible. But that was then. Now, having a kid on his own, with no mate, no support, would make the life he’s building for himself totally fall apart. As a junior engineer – the company’s <em>best</em> junior engineer – he earns enough that, with Lan Zhan pitching in just a bit more than his fair share of the rent, he can afford to enjoy a decent life and even save some money. But he couldn’t fit a baby in their apartment, even if Lan Zhan would put up with having one around. He’d have to move into some barely affordable shithole, and he wouldn’t have a hope in hell of paying for daycare, so he’d get fired for smuggling his baby into the office, and he’d be back to living on the streets, fighting stray dogs for scraps.</p>\n<p>There’s a bean-sized embryo developing inside him right this minute, determinedly dividing and differentiating its cells into something that might have Lan Zhan’s serious little face, or his own smile, and he <em>wants</em> it, and he can’t have it.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>It’s early enough that they can just give him a prescription. At least Lan Zhan’s super-nose saved him from the surgical procedure. It’s still going to be shitty, according to the nice omega nurse’s description of the side-effects, but it could’ve been much worse.</p>\n<p>They fill the script at the pharmacy on the way home. As soon as they get through their front door Wei Ying pours himself a glass of water, but before he can pop open the little blister pack with the first pill the nausea rises again and he has to dive for the kitchen sink, no time to make it to the bathroom. Lan Zhan rubs his back while he pukes, and helps him to the couch afterwards and tucks him under a blanket, and goes back to the kitchen to clear up the mess Wei Ying made. Wei Ying lies there, shaky and limp, and doesn’t think about anything at all.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>“Wei Ying,” Lan Zhan says three days later. He’s holding the unpopped blister pack.</p>\n<p>Wei Ying wordlessly holds out his hand for it.</p>\n<p>Lan Zhan hesitates. “You don’t have to take them.”</p>\n<p>It’s such a patently stupid comment that it gets Wei Ying up off the couch to snatch the pack out of his hand and march over to fill another glass of water. He slams into his room, sets the pills and the water on the nightstand, and gets into bed. It’s seven thirty.</p>\n<p>At nine thirty there’s a tap on the door. Lan Zhan ghosts in, dressed in his perfect white pyjamas, hair braided for sleep. He waits just inside, until Wei Ying makes a little noise that he doesn’t want to be a sob but probably is. Then Lan Zhan comes over, pulls the covers back and slides in next to him. Wei Ying is still fully clothed, jeans and hoodie separating their bodies, but Lan Zhan pulls him close, and – <em>oh</em> – his scent fills the air. During Wei Ying’s heats that scent is molten pleasure, but the rest of the time it’s like a herb garden under the summer sun, fresh and fragrant. For a while he doesn’t say anything, just holds Wei Ying’s trembling body in his arms. Then, sounding shy and uncertain in a way that isn’t like him at all, he says, “I’m in a position to support a child financially. If you want. I could. I would support you. I would help. I would like to be a parent, even if…”</p>\n<p>\n<em>Even if it’s with you.</em>\n</p>\n<p>The answer should be an immediate no. Lan Zhan has always been too kind, too considerate. Kind enough to be a steadfast friend when they ended up at the same college, despite all the shit Wei Ying put him through in high school. Kind enough to agree to room together after they graduated, even though it was always going to be an unequal arrangement. Kind enough to say yes when Wei Ying moaned that solo heats were so terrible, and <em>your perfect alpha dick is right in the next room, Lan Zhan, do you know how hard that is to deal with?</em></p>\n<p>Look where that got them.</p>\n<p>He should say no, but he doesn’t. The next day Lan Zhan takes the pills back to the pharmacy to be disposed of and makes another appointment at the omega health clinic.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>“Soooooo,” Wei Ying tells his siblings at the safe distance of video chat, “I have news.”</p>\n<p>“What did you do now?” says Jiang Cheng, in a tone that would make Wei Ying pout and complain in any other situation. In this one, though? Yeah, what <em>did</em> he do now?</p>\n<p>“I got myself knocked up,” he says. “I’m gonna have Lan Zhan’s baby.”</p>\n<p>Jiang Cheng is so astonished that there are several seconds of dead silence before he explodes, but when he does, it’s epic.</p>\n<p>After the yelling is over, Wei Ying tells Lan Zhan, “My sister sends hugs. I think my brother is buying flights so he can come out here to murder you.”</p>\n<p>“Hm,” says Lan Zhan.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>Lan Zhan doesn’t have much family and most of what he does have is on the elderly and judgemental end of the spectrum, particularly Uncle Qiren who had his heart surgically removed and replaced with the Lan family rulebook. Lan Huan makes up for a lot of that by being the sort of supportive, loving, dedicated big brother that doesn’t usually exist outside of TV. So it’s a shock to Wei Ying that he takes the news <em>worse</em> than Jiang Cheng did.</p>\n<p>He doesn’t yell, of course. He doesn’t say anything disapproving. He offers to help in any way he can with a gentle smile on his face and a devastating worry and sadness shining in his liquid Lan eyes.</p>\n<p>“Congratulations, Wei Ying,” he says as they drink the last of their drinks in the fancy tea shop Lan Zhan picked for the conversation. “I hope this makes you happy.”</p>\n<p><em>You’re destroying my brother’s life, you little prick,</em> he doesn’t say. <em>Get your filthy claws out of him, you’re not fit to touch the ground he walks on. </em>And he doesn’t say, <em>Didi, don’t worry, I’ll rescue you from this terrible situation, </em>either.</p>\n<p>Instead, he says to Lan Zhan, “Let’s you and me meet again after work tomorrow,” which is basically the same thing.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p align=\"center\"> </p>\n<p>Lan Zhan returns from their meeting looking mulish and irritable and carrying an oversized box of the doughnuts Wei Ying has been craving all day.</p>\n<p>“Brother says we must talk,” he says, and sulks off into the kitchen to make tea.</p>\n<p> “Uh. Talk?” says Wei Ying worriedly. “About what?”</p>\n<p>“Expectations,” calls Lan Zhan, barely raising his voice to carry over the sound of the faucet.</p>\n<p> And… okay, Wei Ying has to admit that’s the kind of thing a sensible big brother would suggest. It’s very grownup-sounding. Wei Ying is twenty-four and objects to having to do anything grownup-sounding, but he is also less than seven months away from being a father so he’s going to have to suck it up.</p>\n<p>Lan Zhan brings him tea and a doughnut (on a plate, with a napkin) and then he sits there like a deep mountain pool reflecting the sky, beautiful and quiet and not talking about expectations.</p>\n<p>Wei Ying sighs. “So, what did your brother mean exactly? We did talk about… some stuff.”</p>\n<p>They had, in that Wei Ying had said things like, “<em>You’d be okay with us still living together?” </em>and, <em>“You’ll be able to cover the bills and food and stuff if I can’t work for a while?”</em> and, <em>“You’re not allowed to change your mind, Lan Zhan, I’m fucking serious. You have to be sure,”</em> and Lan Zhan had hummed his assent to all of it.</p>\n<p>“He said…” Lan Zhan begins, and sips his tea, which means he’s kind of unsettled and needs time to think. “Will I have the right to see my child?”</p>\n<p>“You’re going to be <em>living</em> with your child.”</p>\n<p>“Later. If we no longer live together. Will I…”</p>\n<p>“What the fuck?” says Wei Ying. He wants to go punch Lan Huan for putting that look on Lan Zhan’s face, and kind of wants to punch himself for being enough of an uncommunicative dumbass that it <em>could</em> be put there. “Of course you will. It’s your baby too.”</p>\n<p>“We are unmated. You have no obligation to put my name on the birth certificate.”</p>\n<p>“Well I’m going to! Unless you don’t want me to?”</p>\n<p>“I want you to.”</p>\n<p>“Okay,” says Wei Ying, and finds his voice is shaking a little. “I’m not cheating my kid out of the chance of having you as a dad. It’ll be ours. Equal partners.”</p>\n<p>Lan Zhan’s mouth softens into a slight curve. “I would like that,” he says. Then he takes a steadying breath and says, “Also…”</p>\n<p>“Oh god. What?”</p>\n<p>“Seeing other people.”</p>\n<p>Wei Ying’s stomach does a sideways triple flip.</p>\n<p>“Wei Ying?” says Lan Zhan, looking at him with intense concern.</p>\n<p>“I just feel a bit...”</p>\n<p>Lan Zhan whisks the remainder of the doughnut out of sight and fetches the bag of ginger candies instead. Wei Ying sucks on one, taking careful, shallow breaths through his nose, until the nausea subsides.</p>\n<p>“Okay,” he says, plastering on a smile. “I’m good. What were we talking about?”</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>Of course he’s thought about it.</p>\n<p>Lan Zhan is his best friend, tied with his sister for his favourite person in the world, and an alpha, and gorgeous. Wei Ying is only human. Of course he’s thought about it.</p>\n<p>But. Lan Zhan is his <em>best friend</em>, and Wei Ying had come close to fucking that up with the “<em>Hey, can I sit on your dick?</em>” request. And also, it would never work out between them. Lan Zhan puts up with Wei Ying’s antics as a friend, but he’s certainly not the kind of person who would <em>date</em> a hyperactive loudmouth with authority issues and a habit of waking up after a night out with half his clothes missing and fuzzy memories of extremely regrettable decisions. Equally, Wei Ying is not the type to date a fuddy-duddy who goes to bed at nine and thinks that playing the guqin alone in his room is as exciting as a hobby needs to be.</p>\n<p>Come to think of it, they’re so different that they have no business raising a child together. Perhaps Wei Ying should have thought about <em>that.</em></p>\n<p> </p>\n<p align=\"center\">***</p>\n<p align=\"center\"> </p>\n<p>It’s weird how normal life is. Wei Ying goes to work every day and doesn’t drink coffee, meets up with friends and doesn’t drink alcohol, and spends most of his time hanging out with Lan Zhan.</p>\n<p>They’re not telling anyone but their siblings yet. Wei Ying is not good at keeping his mouth shut most of the time but he’s feeling weirdly private about this. Protective, like it’s his secret to be nurtured. So he develops a range of entertaining lies – “I’m giving up alcohol for New Year! Did I ever tell you how my family celebrate New Year in May?” – and mostly gets away with it.</p>\n<p>Nie Huaisang, who’s been Wei Ying’s desk buddy for nearly a year, isn’t buying it, but neither is he buying Wei Ying being pregnant so he’s basically just really confused.</p>\n<p>“I don’t get it,” he says. “You can’t be. Why would you be? Babies are terrible!”</p>\n<p>Wei Ying laughs himself silly. “A-Sang, I’m not pregnant,” he says. “It’s a social experiment. I’m dropping subtle hints and seeing who jumps to conclusions about how irresponsible I am.”</p>\n<p>“Your jokes are too complicated for me,” Nie Huaisang pouts, which is rich coming from someone whose intricate gossip empire spans every engineering firm in the city. Wei Ying wants to place bets on when Nie Huaisang will actually figure it out and how he’ll react, but the only person he has to bet with is Lan Zhan and that’s no fun at all.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>After another month, Wei Ying stops feeling like he wants to sleep half the time and hurl the other half.  Instead, the nesting hormones kick in like crazy.</p>\n<p>He manages to suppress the instincts that tell him to go into Lan Zhan’s room and rub his scent glands over every single thing Lan Zhan owns, though he does find himself wandering in occasionally and just standing in the middle of the room, letting his presence stamp itself in the air. He also manages to suppress the instincts that tell him that the only comfortable spot in the apartment is in Lan Zhan’s lap, and that Lan Zhan should be spending the evenings running a comb through his hair.</p>\n<p>He doesn’t try to suppress the baby-related ones. “I want to decorate the baby’s room,” he says. “We need to get a place with a baby’s room.” And then he stays up until four in the morning making sketches of bunny-filled meadows for a mural, until Lan Zhan gets up to go to the bathroom and catches him at it and gets all disapproving about sensible bedtimes.</p>\n<p>Wei Ying also blames the omega hormones for the fact that Lan Zhan being mad at him is equivalent to the apocalypse. He can’t sleep, lies in bed feeling like something Lan Zhan would scrape off his shoe in disgust. The next morning he stumbles out of his room with his eyes red and swollen from crying. Lan Zhan takes one look and turns pale and apologises solidly for about half an hour. It’s a mess.</p>\n<p>Lan Zhan makes up for it by finding them a gorgeous three bedroom apartment with a terrace which he <em>buys</em> because his family is even more fucking loaded than Wei Ying realised and his uncle (still living in blissful ignorance) is all like, <em>oh, a property investment? Good idea, here’s the cash</em>.</p>\n<p>It’s much more than Wei Ying deserves. Much more than he ever thought he’d have. And though it’s Lan Zhan’s apartment, not his, Lan Zhan chose it with him in mind. Maybe it’s another hormone thing, but Wei Ying has an urge to make it a home for <em>them.</em></p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>There are so many books to read.</p>\n<p>Baby psychology is fascinating. While Lan Zhan reads all the stuff about caring for a pregnant omega, pros and cons of different birthing strategies and establishing a routine for a newborn, Wei Ying reads about the developing brain, neural connections, how his baby will perceive and reason and learn.</p>\n<p>“Did you know that early on, babies process language and music like they’re the same thing?” he tells Lan Zhan. “Hey, do you think if we only played to the baby instead of talking to it, it would learn to speak music?”</p>\n<p>“That is nonsensical,” says Lan Zhan from behind his mountain of books. “And our baby is not a science project.”</p>\n<p>“It seems a waste not to use it to test a few theories. One of the main problems in advancing child psychology is that most experiments would be unethical. But, like, if it’s <em>our</em> kid…”</p>\n<p>“Wei Ying,” sighs Lan Zhan. And then he says, “We should start looking at the local preschools.”</p>\n<p>“We’ve got <em>months</em> before we need to do that.”</p>\n<p> “We do not. There are waiting lists. And I’m emailing you a list of omega birthing classes. Let me know which you would prefer.”</p>\n<p>“It doesn’t seem fair that I have to go back to school for this,” Wei Ying complains. “You’ll come with me though, right?”</p>\n<p>He doesn’t want to be the only omega without an alpha there. But he feels weird about it too. Lan Zhan won’t want to spread their business around, he probably won’t tell anyone they aren’t mated. But everyone is going to look at Lan Zhan and think Wei Ying bagged the best alpha on the planet, and that makes him… uncomfortable.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>Jiang Yanli flies across the country to be there for the first big scan.</p>\n<p>“A-Ying, your scent!” she says, delighted, pressing her face into his neck and breathing him in.</p>\n<p>He doesn’t have much of a bump yet. Even in his summer t-shirts he just looks like he’s put on a bit of weight. But he has been catching people at work taking a subtly deeper sniff on occasion, and a few days earlier a brisk silver-haired alpha with grandpa vibes had offered him a seat on the bus.</p>\n<p>It’s so great having her there. She cooks for him, and helps him search for baby furniture, and squeals with him over tiny onesies. She is super nice to Lan Zhan too, which is actually slightly upsetting, because the converse is not true, in that Lan Huan is still treating the whole thing like he’s holding his brother’s hand and murmuring comfort while walking him to the gallows. Not that he’s rude to Wei Ying, but he’s not <em>nice.</em> He’s not the warm, friendly presence he has always been before. He still clearly thinks the whole thing is a gigantic mistake.</p>\n<p>But if one older sibling is not on board, the other one is making up for it in spades. She’s a rock at the scan. Wei Ying is nervous as fuck and he’s not sure he’s allowed to hold Lan Zhan’s hand, so he clings to hers the whole time. She and Lan Zhan sit side by side on the guest chairs, and after the ultrasound technician says the baby is healthy she kisses Wei Ying’s cheeks and strokes his hair and has tissues ready for him.</p>\n<p>Lan Zhan stares at the screen looking awed and painfully young.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>“I think we should name him Mochi,” says Wei Ying, shoving a last bite of celebratory ice cream into his mouth.</p>\n<p>His sister laughs at him over her own dessert. “I forbid you from giving him a joke name. That poor child will have enough to put up with.”</p>\n<p>“I think we should name him Yuan,” says Lan Zhan.</p>\n<p>Huh. Wei Ying had figured on irritating Lan Zhan with a bunch of terrible suggestions and arguing about a bunch of others, and not really making any decision until after the baby was born.</p>\n<p>“Which Yuan?” he asks.</p>\n<p>Lan Zhan takes his hand and traces the character on his palm. Wei Ying twitches, half laughing. “That tickles.”</p>\n<p>“Sorry.”</p>\n<p>He looks at his hand where the invisible character still burns. It’s fitting. Yuan for sincerity, because he’ll be Lan Zhan’s son. Yuan for wishing, because Wei Ying wanted him so badly, <em>wants </em>him so badly, will do stupid, reckless things to keep him.</p>\n<p>“Lan Yuan,” he says, trying it out.</p>\n<p>Lan Zhan blinks at him, looking momentarily stunned. “<em>Wei</em> Yuan,” he says.</p>\n<p>Wei Ying’s cheeks heat. “Wei Yuan,” he repeats. “I like it.”</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>Jiang Yanli leaves and Wei Ying is bereft, partly because he misses her and partly because he no longer has a distraction from an ever-increasing problem.</p>\n<p>He’s read a lot of articles about increased libido in the second trimester. Most of them say, not in so many words, that he should take advantage, because pregnant sex is likely to feel awesome. Wei Ying can see that – he’s sensitive everywhere, even trailing his fingers over his nipples gets him hot and bothered and the thought of Lan Zhan’s mouth on them is overwhelming. But most of the articles assume he has a partner, not just a model-gorgeous roommate he’s not allowed to touch, and none of them provide helpful hints on how to handle it when Lan Zhan, while chopping veggies for stir fry, slips a slice of carrot between his soft pink lips and hums in pleasure at the taste.</p>\n<p>Wei Ying is jerking off like he’s going through puberty all over again, and it isn’t even close to what he needs.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>He kept the secret for longer than he expected to, but after the 18-week scan Wei Ying bites the bullet and tells his manager he’s pregnant – which also means he might as well stop fucking with the rest of his office-mates. Nie Huaisang wails, “I don’t understand,” for a solid minute before he gets around to offering congratulations. Wei Ying’s other friends are baffled but accepting, in a <em>rather you than me </em>kind of way.</p>\n<p>Lan Zhan also decides it’s time to come clean with his uncle. Lan Qiren avoids Wei Ying wherever possible, so they could probably have got all the way to the birth without him noticing, but apparently that’s not on the table.</p>\n<p>“Uncle is very disappointed in me,” says Lan Zhan, when he gets back from the conversation Wei Ying is incredibly glad not to have been part of. He doesn’t look sad about it. He looks more like a quiet version of a righteous, vengeful god, keen for some smiting.</p>\n<p>“How did he take it?” says Wei Ying. “What did you tell him?”</p>\n<p>“I told him that we are having a child together. And that we are not mated, nor do we plan to be.”</p>\n<p>“Oh,” says Wei Ying. He swallows. “I mean, he must have been pleased about that last part, right? At least he doesn’t have to put up with me as a son-in-law.”</p>\n<p>“He was not pleased about any of it,” says Lan Zhan.</p>\n<p>“Is he going to… uh, take the apartment away or something?”</p>\n<p>“The apartment is mine. I negotiated the terms of the arrangement with this situation in mind.”</p>\n<p>Wei Ying barks an astonished laugh, because wow, that’s kind of cutthroat. Lan Zhan talked his uncle into straight-up <em>giving </em>him a ridiculously expensive apartment, knowing full well that he was about to piss the man off enough that he’d snatch it back again if he possibly could? A thousand points for forward planning, negative one million for being a dutiful nephew, and it’s very sexy that Lan Zhan doesn’t seem to give a shit about the latter.</p>\n<p><em>Very</em> sexy, goddammit.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>They move into Lan Zhan’s new apartment. <em>Our home</em>, Wei Ying’s troublesome hormones insist. <em>Our family home.</em></p>\n<p>He’s forbidden from helping, so he sits and watches Lan Zhan’s biceps flex as he moves box after box and tries not to come in his pants.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>Things come to a head – heh – when they’re watching a movie together on a random Monday night. Wei Ying is wiped, because he still gets more tired than usual. Every work day drags, and also he’d snapped at Ruby from payroll for trying to touch his ever-growing bump and then felt like a shit for doing it for the rest of the day.</p>\n<p>He’s wiped, but he has Lan Zhan’s fresh, warm scent all around him. He had to drape the blanket carefully over his lap before the intro sequence was even finished, and now he’s so hard that he’s squirming in his seat.</p>\n<p>“Wei Ying,” say Lan Zhan, and when Wei Ying dares to glance sideways he finds Lan Zhan’s gaze laser focused on him, heated but also somehow lost, uncertain and vulnerable. Lan Zhan’s hand comes to rest over his heart, then strokes down over the swell of his belly, and Wei Ying chokes out a moan, desperate.</p>\n<p>“<em>Please</em>.”</p>\n<p>“Wei Ying,” says Lan Zhan, his voice rumbling low in his chest, and then he’s slipping down off the couch with liquid grace, pushing Wei Ying’s legs apart and going to his knees between them. “Do you want me to suck you?” he says.</p>\n<p>Wei Ying can’t manage a coherent response, but he can manage to frantically work his horrible pregnancy jeans out of the way, and then thread his fingers into Lan Zhan’s hair and pull him down onto his cock.</p>\n<p>It’s electric. It’s <em>fast</em>, hits like a train all through him. He comes within minutes, pinching his own nipples, Lan Zhan’s fingers moving roughly inside him, fucking up into Lan Zhan’s hot mouth, crying out in glorious relief. It’s so good, Lan Zhan smells <em>so good</em>, and he can barely catch his breath after, sobs and gasps until his body stops trembling with aftershocks and turns syrupy-sweet and heavy.</p>\n<p>He’s drifting away. Vaguely he’s aware that Lan Zhan didn’t get off and he doesn’t want to be that guy but he’s so warm and so tired and everything feels amazing. He feels Lan Zhan cleaning him up and pulling him close. It’s nice to be held. It’s so good to rest his head on Lan Zhan’s shoulder and sigh into his neck and breathe him in. The world blurs into disjointed fragments, then into dreams.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>Apparently they’re having sex now. At least, Wei Ying is. He’s getting off, getting sucked and fingered and jerked off whenever he wanders up to Lan Zhan and whines that he’s horny. When he tries to reciprocate, however, Lan Zhan gives him a look of gentle reproof and murmurs, “No need.”</p>\n<p>So, Lan Zhan is doing him a favour. Wei Ying shouldn’t be surprised. This whole thing is Lan Zhan doing him a gigantic favour, giving him the chance to have a baby when there’s no practical way he could manage it on his own. When Lan Zhan has already turned his life upside down, what’s a few blow jobs more or less? And if he doesn’t want Wei Ying to touch him, Wei Ying is just going to have to respect that.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>“Your brother hates me,” says Wei Ying, after they get back from a truly awkward brunch. “The legitimate contender for the title of the world’s nicest human being straight up hates me.”</p>\n<p>It sucks. The times he’s felt like a shitty friend, like he’s dragging Lan Zhan into trouble, dragging him down, there’s always been the comfort that Lan Huan, inexplicably, is glad Wei Ying is in his little brother’s life. Now that’s all changed. The one person who has Lan Zhan’s best interests completely at heart wants Wei Ying gone.</p>\n<p>“He doesn’t hate you,” says Lan Zhan.</p>\n<p>“Every time I touched you he looked like he wanted to drop-kick me into the river,” Wei Ying says. “He hates me, Lan Zhan, he’s not being fucking subtle about it.” All the pregnancy hormones get him upset over the smallest things these days, but he thinks he’d be pretty devastated even at his most resilient. There’s nothing to do but have a good cry and maybe a nap and hope that when it’s over he feels less like someone’s dug out his insides with a spade. “I’m going to lie down,” he says.</p>\n<p>“Wei Ying—”</p>\n<p>“I’m fine. I don’t care what he thinks of me. I’m growing a person in here, I’m tired,” says Wei Ying, and bolts for his room.</p>\n<p>He muffles his sobs against the pillow, cries until he’s damp and horribly dehydrated and somehow still desperately needs to pee. Which means he has to leave his goddamn room and it’s going to be obvious to Lan Zhan that he’s been bawling his eyes out.</p>\n<p>Whatever. It was probably obvious anyway.</p>\n<p>But Lan Zhan isn’t out in the lounge, or in the kitchen. He’s in his room, talking to someone, and he’s angry. It’s not the chilly contempt he usually projects when someone has pissed him off. It’s raw and bleeding and hurt.</p>\n<p><em>Shit</em>, Wei Ying thinks, and presses his ear to the door.</p>\n<p>“You were rude. You were hostile. It’s unacceptable. I will not have you upsetting him. You may think my choices are unwise, but they are <em>mine. </em>Not his.”</p>\n<p>\n<em>Oh, shit.</em>\n</p>\n<p>The Lan brothers don’t fight. Wei Ying has never so much as heard Lan Zhan speak sharply to his brother before. This is unknown territory, but he knows that if this whole situation ends up coming between the two of them he will never, ever forgive himself.</p>\n<p>There’s a pause, before Lan Zhan’s voice snaps out again.</p>\n<p>“Of course he noticed!”</p>\n<p>More silence, broken by the slight scuff of bare feet as Lan Zhan paces.</p>\n<p>“That is not funny, brother.”</p>\n<p>Another pause. Then Lan Zhan’s breath gives a watery hitch, halfway to a laugh. “Alright,” he says, “it is a little funny. But in most things he is very observant. Please. Please be kind.”</p>\n<p>His voice is soft again. Like nothing is permanently broken.</p>\n<p>“Brother,” Lan Zhan begins, and then is cut off by something Wei Ying can’t hear. After a few moments, gently, he says, “Thank you. I’m sorry too.”</p>\n<p>Wei Ying breathes a sigh of relief, and then his bladder twinges. He stops eavesdropping, out of necessity more than morality. When he pauses by Lan Zhan’s door again on the way back to his room, water in hand and honestly ready for a nap, Lan Zhan is talking about baby things. Wei Ying can hear the smile in his voice when he says <em>A-Yuan</em>.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>“I need your cock, Lan Zhan. I need it in me. Want to feel you in me.”</p>\n<p>It’s not the first time. He’s blurted it out before in the heat of things and Lan Zhan has always ignored it, but it’s never felt so urgent, so necessary. He writhes on Lan Zhan’s fingers, fucking himself back onto them, forward into his mouth, and it’s good but it’s not enough, he needs the hot length of Lan Zhan inside him, the weight of Lan Zhan’s body pressing him down.</p>\n<p>“Nng, ah, I want your cock, I want you to fuck me.<em> More</em>. Please, please, please.” He’s sobbing with it, begging, shameless. “I need you, I want you inside me, I want to feel you.” Tugging frantically at Lan Zhan’s shoulders. “Come here, come up here, put it <em>in</em> me.”</p>\n<p>Lan Zhan makes a throbbing growl that Wei Ying didn’t know he <em>could </em>make, and then he’s climbing on top, fumbling between them to get his cock out, awkward and clumsy until he sinks in with one smooth push and proceeds to <em>go the fuck to town</em>.</p>\n<p>Wei Ying makes a noise of mingled bliss and shock. He feels out of his body, floating on pleasure, barely connected to the physical sensation of Lan Zhan pounding into him. Distantly he can hear the noises he’s making, and hear Lan Zhan groaning his name. Closer, more real, is the feel Lan Zhan’s flushed skin under his fingertips as he cradles that beautiful, intent face in his hands, matches the rock of their bodies to curve forward so their mouths brush together.</p>\n<p>He comes like that, with Lan Zhan’s mouth on his and Lan Zhan’s cock thrusting into him at a frantic pace, vibrating all through him, and everything is oversensitive, almost painful but he doesn’t care and Lan Zhan doesn’t stop. <em>No manners</em>, Wei Ying thinks even as the pleasure starts its long, slow build to a second peak. He comes again, jerking his own cock and whining, when Lan Zhan’s pace finally falters and he moans his release into Wei Ying’s neck.</p>\n<p>It’s a while before Wei Ying rouses himself enough to give Lan Zhan a shove. “Heavy,” he complains.</p>\n<p>Lan Zhan peels his eyes open, and his face goes worried. He rolls to one side and sits up, which wasn’t the intended outcome at all. Wei Ying goes after him, gathering him close, trying to smooth the frown away with careful fingers.</p>\n<p>“Was I too rough?” asks Lan Zhan in a very small voice.</p>\n<p>“Nonono, you were good, sweetheart,” Wei Ying babbles. He drops kisses everywhere on Lan Zhan’s face and neck and even the sweaty collar of his shirt. “You were so good, you fucked me so good, holy shit.”</p>\n<p>Lan Zhan makes a noise of relief like he was really, honestly worried he broke Wei Ying with his dick, which – it’s big, but it’s not <em>that</em> big, Wei Ying has solid evidence that he can handle getting fucked by it for two days straight. Lan Zhan isn’t usually so uncontrolled, even though the previous times they’ve always had Wei Ying’s heat scent to spur him on, but it’s a change Wei Ying is not going to complain about.</p>\n<p>He kisses Lan Zhan a bit more, and they hang out and cuddle for a while, and then Wei Ying complains that he’s sticky until Lan Zhan picks him up bodily and carries him into the shower.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>They don’t talk about it. They probably should talk about it. But what’s Wei Ying going to say? <em>I’m glad you’re getting off too now, but can you please go back to just blowing me so I don’t accidentally fall in love with you</em>?</p>\n<p>Lan Zhan didn’t sign up for that kind of bullshit.</p>\n<p>Still, Wei Ying thinks about it more than he used to.</p>\n<p>Lan Zhan is his best friend and they’re having a baby together, and they’re also having a lot of sex. He can’t help but think about it.</p>\n<p>He’ll always be a hyperactive loudmouth with authority issues, but he’s going to have someone small and helpless depending on him very soon, and that means he’s going to learn a bit of diplomacy if it kills him. And he’s still going to make bad decisions, but with a baby at home he’s much less likely to be wasted while doing it. Maybe he has the chance to grow into someone who wouldn’t be a completely ridiculous prospect for a responsible person like Lan Zhan.</p>\n<p>And Lan Zhan will always be a fuddy-duddy who goes to bed at nine, but it’s actually pretty nice to be around someone who wants nothing more than to make a healthy meal and play the guqin and maybe have some spectacular sex. Add to that the fact that Lan Zhan is obviously going to be a patient, loving, wonderful father, and it’s not Wei Ying’s fault that his emotions are getting… a little confused.</p>\n<p align=\"center\"> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>Wei Ying’s birthday is Halloween. It’s the one night of the year he has absolute authority to drag Lan Zhan out with him and make him stay out past his bedtime. Lan Zhan has always submitted to it with good grace.</p>\n<p>He goes overboard with the costume. Full-on Morticia Addams, complete with a three-legged baby onesie on a pair of knitting needles. The makeup alone takes him nearly an hour, careful contouring and blood-red lips and epic eye shadow, and the dress is <em>killer</em>. He looks great.</p>\n<p>Lan Zhan is his Gomez, of course. Wei Ying puts him in the purple velvet smoking jacket outfit from the movie, ties up his hair so it looks slicked-back, and paints a moustache on him. The effect is hilarious. Scorching hot, because it’s Lan Zhan, but mostly hilarious.</p>\n<p>The party is a good time, even if he can’t drink. There’s a chunk where everyone’s trying to teach Lan Zhan quotes from the movies, and Wei Ying doesn’t think Lan Zhan is going to be into it at all… but then he just goes for it, murmurs, “Cara mia,” into Wei Ying’s ear and kisses his wrist and up along his arm, all the way to his mouth while everyone cheers.</p>\n<p>So Wei Ying has a great night. And then it’s over. He wakes up the next morning twenty-five years old, nearly seven months pregnant, and unlikely to get another real night out in a very long time.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>The first trimester had its moments. The second ended up being kind of a blast. By the middle of the third, Wei Ying is officially no longer having fun.</p>\n<p>He’s huge. He can’t find a way to sit that doesn’t press A-Yuan against his internal organs. His back aches all the time, and he has to pee every two minutes. A-Yuan’s constantly kicking or getting tiny, adorable fits of hiccups that keep them both awake all night.</p>\n<p>As November turns into December, they have a run of grey, foggy weather. The mural in A-Yuan’s room is half-finished, and Wei Ying can’t look at all the little blank, blocked-in bunnies without wanting to cry.</p>\n<p>It’s not ready. The crib is bought, the stroller is waiting, there are little onesies in the drawers and a changing mat set out, but the mural isn’t ready.</p>\n<p>“You have time,” says Lan Zhan, when he finds Wei Ying sitting helplessly on the floor in the middle of the room, paints untouched in front of him. “You don’t have to do it today.”</p>\n<p>“I want to get it done.”</p>\n<p>“Can I help?”</p>\n<p>“<em>No</em>,” Wei Ying snaps. “I don’t need your help for everything. Just – fuck off and leave me to it.”</p>\n<p>Lan Zhan goes. Wei Ying sits there feeling sick and useless and achy, until A-Yuan kicks him hard in the kidney.</p>\n<p>“Fucking <em>ow</em>,” says Wei Ying, and then starts to laugh because that was pretty much exactly what he needed. “Okay, okay, I hear you. I’m doing it.” He squeezes paint out of the tube, shuffles himself and his unwieldy belly into place, and starts work. One rabbit. He’ll focus on one, and that will be better than nothing.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>There’s a month to go. Then two weeks. Then it’s any day now. Wei Ying is off work, with nothing to do except call his sister and complain about how uncomfortable he is. He even calls Jiang Cheng, who tells him it’s all his own fault and he should suck it up, and then asks how soon after the baby’s born he’s allowed to visit.</p>\n<p>The backache gets really bad. Wei Ying can’t sleep. He gets up, one hand on the wall to steady himself, and goes to knock on Lan Zhan’s door. “Something’s happening,” he says. “I think. I don’t know. I think?”</p>\n<p>Lan Zhan comes out and sits with him, and things progress until Wei Ying is actually pretty sure, his body squeezing itself painfully into a new configuration for what’s coming. So they call the hospital, and the midwife tells them it’s time to come in.</p>\n<p>Wei Ying hangs up the phone and turns to Lan Zhan. “Tell me I’ve got this,” he says.</p>\n<p>“You’ve got this,” says Lan Zhan, and he pulls Wei Ying close, warm with alpha scent, and kisses his mouth.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>It doesn’t hurt the way he thought it would. Not a helpless kind of pain. It’s the pain of working insanely hard, pain like he’s carrying the whole world on his back and taking a step forward, and another, and another, not stopping because if he does he’ll be crushed. The pain of knowing there’s a marathon to run, and he’s given it everything and the finish line is still miles away. It’s pain that he grits his teeth through and sets aside and gets the fuck on with things. He’s never felt so focused in his life.</p>\n<p>There are people around him, nurses and doctors and Lan Zhan holding his hand, but he’s not really aware of them. It’s him and his body and A-Yuan. Bringing his baby into the world is the hardest thing he’s ever faced, but the birthing classes knew what they were talking about. He knows what to expect, he knows what he has to do.</p>\n<p><em>I can</em>, he thinks. <em>I can</em>. And he does.</p>\n<p>He screams through the last of it, and then he’s panting with shock at the crazy feeling of something so huge slithering out of his body. There’s a cry and Wei Ying can’t sit up, can’t reach out, but he babbles, “Where is he? Where is he? Give him to me,” and they place a tiny, flailing, puffy, perfect baby into his arms.</p>\n<p>Wei Ying stares down at him, and he thinks, <em>yes</em>.</p>\n<p>He spends an eternity admiring each tiny fingernail, each soft eyelash, the little wrinkles of skin at elbow and knee. Finally, he thinks to glance up to the person who’s been there with him the whole time.</p>\n<p>Lan Zhan looks like someone hit him with a brick. His cheeks are wet.</p>\n<p>“He’s amazing, isn’t he?” says Wei Ying.</p>\n<p>Lan Zhan nods. “You’re both amazing,” he says.</p>\n<p>Honestly, Wei Ying agrees. He feels pretty badass.</p>\n<p>He’s not quite done with labour, but he can do the whole placenta thing with A-Yuan cuddled up against him, mouthing sleepily at his nipples, tiny baby reflexes trying to figure out how to suckle. And then it really is over, and he’s moved to a comfy, quiet room where he can sleep if he wants to, if he can bear to put A-Yuan down and close his eyes.</p>\n<p>“Can I hold him?” says Lan Zhan, all hopeful and quiet, and that’s when Wei Ying realises that he’s been a total baby-hog this entire time. He doesn’t think he could bear to give A-Yuan to anyone else, but it’s okay to let Lan Zhan take him. Lan Zhan is uncertain at first, but when A-Yuan settles against him he sighs out a whole world of tension. He cradles Wei Ying’s baby like the most precious thing imaginable. Poor A-Yuan’s fast asleep, exhausted by the scant first hours of his life. Wei Ying knows how he feels. He’s more tired than he ever remembers being, but he lies there and watches while the minutes tick by and Lan Zhan whispers words of welcome to their son.</p>\n<p>“Lan Zhan?” he says, in the dreamlike unreality of their little room.</p>\n<p>“Wei Ying?”</p>\n<p>“I love you,” he says. “I’m in love with you.”</p>\n<p>There’s a pause. Wei Ying blinks drowsily, and finds Lan Zhan staring at him with an expression so still that, to Wei Ying’s semi-focused brain, it’s like there’s nobody living behind his eyes.</p>\n<p>“You’re tired,” says Lan Zhan.</p>\n<p>“Mm,” says Wei Ying, and drifts off to sleep.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p align=\"center\"> </p>\n<p>In the morning, he wishes he didn’t remember. But he does, with far more clarity than he’d felt at the time. He remembers saying it, and he remembers the out Lan Zhan gave him, the tacit request to pretend it didn’t happen.</p>\n<p>It’s probably for the best. He’s just confused, his hormones have been heightened for months with an alpha in close proximity. He’s feeling things that aren’t real.</p>\n<p>Anyway, he’s got A-Yuan, and that’s what matters.</p>\n<p align=\"center\"> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>They go home. They show A-Yuan the mural and watch his little face screw up as his eyes completely fail to focus. They put him in his crib for all of ten seconds before Wei Ying snatches him up again. They take him into Wei Ying’s room, but it seems really impractical, because Wei Ying needs to crash and he needs Lan Zhan to take point. So they all three of them get settled in Lan Zhan’s room instead.</p>\n<p>Wei Ying is tired and sore and bleeding, and he wants to just pass out for a week but instead the rest of the day is a blurred mess of fragments of sleep, in-between feeding A-Yuan, or changing him, or soothing him, or just obsessively watching him breathe. The night is the same. As is the next day, and the next, and by that point he’s teetering on the edge of some kind of precipice.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>Wei Ying has very mixed feelings about Lan Huan, but they’re stumbling around in a sea of disgusting laundry and takeout containers, one of them holding A-Yuan, the other one trying to hunt down a onesie that isn’t covered in fluids, or take the used diapers to the trash, or eat dry cereal out of the box, but mostly just staring at the wall in a sleep-deprived haze. When Lan Zhan suggests, pitifully, “My brother could help,” all Wei Ying can manage to say is “Oh God yes.”</p>\n<p>So Lan Huan comes over and cooks and cleans and tidies, as is the way of his people. He sets a million loads of laundry running while holding A-Yuan nestled in the crook of his arm, because he’s a superhuman multitasker. (“He has slept more than five hours in the past seventy-two, unlike either of us,” Lan Zhan says, and then faceplants into the pillow.) He’s only there for a day, but it’s the day they need. Suddenly everything is no longer terrible. Suddenly they have energy. Suddenly Wei Ying remembers how awesome his son is, and goes from semi-breakdown to being ridiculously, joyously content.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>Jiang Cheng is pissy because Lan Huan got to see the baby first, just by dint of not living a thousand miles away, and has already proven his worth in the uncle department by being there when they needed him. The result is Jiang Cheng being aggressively attentive to Wei Ying’s needs. It’s bizarre and hilarious and Wei Ying is intrigued to see how far he can push it. Further than he thought, as it turns out. “Brush my teeth for me, A-Cheng, my arms are too tired,” is apparently Jiang Cheng’s limit.</p>\n<p>The other limit is when Wei Ying, after some circumspect experimentation, manages to figure out how to press on the taut, swollen area around his nipples in just the right way that he can, when Jiang Cheng leans down to pass A-Yuan back to him, catch his brother full in the face with a jet of milk.</p>\n<p>A-Yuan almost gets dropped, Jiang Cheng threatens to break Wei Ying’s legs, and Lan Zhan gives them both a look of livid fury and snatches A-Yuan away. Fortunately Jiang Yanli is there to smooth things over. She has a lot of practice at apologising for her brothers.</p>\n<p>As a side-effect, Wei Ying discovers that he can handle having Lan Zhan mad at him again.  The pregnancy hormones are wearing off.</p>\n<p>Maybe soon he’ll stop feeling like he’s in love with more than just his son.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>They get two weeks of charmed life. Then Lan Zhan has to go back to work.</p>\n<p>He’s miserable about it. He lingers by the front door in a cloud of distress scents, like he’s battling against every instinct he has.</p>\n<p>“You’ll be late,” says Wei Ying.</p>\n<p>Lan Zhan opens his mouth to say something, but then he snaps it shut again, makes a frustrated noise through his teeth, and frog-marches himself out of the door.</p>\n<p>Wei Ying’s not really keen to be left alone, but at least he has plans. The health visitor is coming by, and then he and A-Yuan will take an experimental trip out in the stroller, just around the block so he can figure out if he can handle getting out of the house on his own. And then A-Yuan will nap, hopefully, and Wei Ying will collapse and die for a little bit.</p>\n<p>That’s the general idea. But once he’s actually alone, their bright apartment becomes a grim, chilly prison. The health visitor, when she arrives, is awful simply because she isn’t Lan Zhan. She’s kind enough, and she weighs and measures A-Yuan with gentle hands and pronounces him healthy, and checks over Wei Ying and pronounces him healthy too, but there’s a slight frown on her face. “You know, it’s really not recommended for your mate to leave you this soon,” she says. And then she catches his eye, and glances at his file, and apologises. “The scent,” she says sheepishly. “I just assumed. I’m sorry. I’ll make a note.”</p>\n<p>Wei Ying wants to scream.</p>\n<p>When she leaves, he finds he has three texts from Lan Zhan asking if he’s okay. He sends back something soothing, because he’s fine. He’s fine. He is.</p>\n<p>They don’t manage to get out of the house. Poor A-Yuan cries like he knows something is wrong. By the time he finally falls asleep, Wei Ying is only able to lie down with him and have a little crying fit of his own.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>Lan Zhan gets home two hours earlier than expected. Wei Ying is in the middle of his millionth circuit of the room, helplessly bouncing his wailing baby, when Lan Zhan slams through the door and sweeps them both into his arms.</p>\n<p>“Wei Ying,” he breathes. “A-Yuan.”</p>\n<p>“Oh, thank god,” says Wei Ying.</p>\n<p>They don’t separate even to manoeuvre to the couch. They shuffle there mid-hug, and Wei Ying settles into Lan Zhan’s lap. A-Yuan finally stops crying. Wei Ying strips his gross milk-stained t-shirt off to let him feed. Lan Zhan wraps all around him, as though worried he’ll get cold.</p>\n<p>“Let’s never do that again,” says Wei Ying, with more than a little bitterness, because they’re going to do it again tomorrow.</p>\n<p>Lan Zhan shifts under him. “If we were mated I would be eligible to work from home,” he says.</p>\n<p>“Yeah, it sucks.” Wei Ying burrows his head against Lan Zhan’s shoulder in a sulk. And then he catches the tone and says, “Wait, what?”</p>\n<p>“I will lie,” says Lan Zhan. “If I have your permission, I will tell my manager that the situation has changed.”</p>\n<p>“You’ll <em>lie</em>?”</p>\n<p>“Mm.”</p>\n<p>“Seriously? You?”</p>\n<p>“Wei Ying, do not ask me to leave you again,” says Lan Zhan, like he’s close to tears, and wow, his day must have been even worse than theirs.</p>\n<p>“What about when they figure out it’s not true?”</p>\n<p>“I will explain my reasons and hope that my value to the company outweighs the deception. If it does not, I will find another job.”</p>\n<p>“That’s crazy,” says Wei Ying. “Fuck. Do it, go for it.”</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>Of course Lan Zhan had been perfectly ready to die on his hill of righteousness and demand that his uncle be the first to reach out, but it wouldn’t have been fair to A-Yuan. Lan Qiren might be chilly and inflexible but he’s the only grandparent-type figure their child is ever going to have. They’ve already lost three sets of parents between them. So Wei Ying insists, even though he gives about even odds that it’s all going to go to hell.</p>\n<p>“Welcome, uncle,” says Lan Zhan with icy politeness.</p>\n<p>“A-Zhan,” Lan Qiren says, not quite as frostily, and then he gives Wei Ying the faintest of nods before his eyes zero in on the baby. His fingers twitch.</p>\n<p>Wei Ying wants to laugh, it’s so easy.</p>\n<p>“This is A-Yuan,” he says. “Would you like to hold him?”</p>\n<p>He still doesn’t get more than a nod. He doesn’t get a smile, or a friendly word. But he does get the gratification of seeing how the old man melts when Lan Zhan takes the baby and passes him over.</p>\n<p>“He’s beautiful. He looks like you, A-Zhan,” says Lan Qiren.</p>\n<p>Wei Ying manages not to chime in with, “Yeah, it turns out I guessed right about who the father is!” because Lan Zhan starts radiating a quiet sort of satisfaction and he doesn’t want to ruin it.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p align=\"center\"> </p>\n<p>He keeps waiting for the other shoe to drop. For the last of the mess of hormones to finally flush themselves out of his body, and for his heart to discover that really, Lan Zhan is just his best friend who has done him an amazing list of favours.</p>\n<p>But time stretches on, and he thinks about it more and more. He thinks about how it might be if they actually were mates. He thinks of Lan Zhan’s arms around him for <em>him, </em>not because they’re new parents and their instincts are going nuts.</p>\n<p>He thinks of saying, “I’m in love with you.”</p>\n<p>Then he thinks of Lan Zhan’s face going still and blank, and he keeps his mouth shut.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>A-Yuan is perfect, of course, but he doesn’t do a whole lot for the first weeks of his life. He waves his hands around, he wriggles and blinks, he yells his little heart out if he’s not happy, but it’s hard to know what he’s reacting to. Wei Ying coos at him and makes faces, but can’t tell if he actually likes it. He sings to him when he cries, but can’t say if it’s that or just time that eventually calms him down.</p>\n<p>And then there’s a moment when Lan Zhan finally has the time and energy to sit down at his guqin. At the first notes, A-Yuan goes still in Wei Ying’s arms, eyes wide. Then he starts grasping with his tiny fingers as though he could somehow reach out and bring the music closer.</p>\n<p>“Oh my god,” says Wei Ying.</p>\n<p>Lan Zhan stops playing, concerned. A-Yuan freezes, and then his little face crumples and he <em>screams.</em></p>\n<p>“Don’t stop!” says Wei Ying. “He likes it. Shh, it’s okay, A-Yuan, Papa’s going to play for you.”</p>\n<p>Lan Zhan obediently sets his hands back on the strings. A-Yuan quiets instantly, returning to his rapt attention, and Wei Ying carries him over so they can sit close by the instrument.</p>\n<p>“Do you think he remembers?” he said. “He must have heard it while he was inside me.”</p>\n<p>“Maybe,” says Lan Zhan, and plays a beautiful, rippling run of notes that makes A-Yuan wriggle, lips shaping around little formless noises of his own.</p>\n<p>“Hey, you know what I told you about babies’ brains and music?”</p>\n<p>“He’s not a science experiment, Wei Ying.”</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>“So,” says Joe, one of the other omegas at the baby yoga group Wei Ying joined to stop himself going stir-crazy, “the <em>gorgeous </em>alpha who just dropped you off... that’s Lan Zhan?”</p>\n<p>“Mm,” says Wei Ying noncommittally, while raising A-Yuan’s legs in the air and making a silly face. New parents are so bored they turn into worse gossips than Nie Huaisang. About three minutes into his first class, everyone knew he was unmated and living with his baby-daddy.</p>\n<p>“What’s wrong with him?” says Joe, who Wei Ying is starting to no longer like. “Is he a pervert? Why haven’t you let him bite you?”</p>\n<p>“Because I’m chaste and virginal and nice omegas don’t do that.”</p>\n<p>“You have a <em>baby</em>.”</p>\n<p>“Immaculate conception,” says Wei Ying. He coos at A-Yuan, “Who’s a beautiful second coming of Christ? You are!”</p>\n<p>Joe, who has a fancy crucifix tattoo, picks up his kid from the mat and moves away.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>They move Lan Zhan’s home office stuff into Wei Ying’s room. Why not? It’s not like Wei Ying is using it for anything except storing his clothes. And then, because it’s inconvenient to walk in on Lan Zhan’s conference calls when he needs a shirt that doesn’t have spit-up on, they move the clothes into Lan Zhan’s room too.</p>\n<p>Sometimes, in the middle of the night, Wei Ying lies listening to A-Yuan’s snuffling snores, and has to reach out and touch a perfect, chubby, baby-soft cheek. They keep the bassinet on his side of the bed, close enough that he barely has to shift in Lan Zhan’s arms to do it.</p>\n<p>He can’t imagine moving back into the room that was once his own. He’s beginning to feel like they <em>are</em> mated, in everything but the bite.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>It happens when they ask Lan Huan to take A-Yuan out for a walk.</p>\n<p>It’s the first time A-Yuan has been away from both of them. They plan for twenty minutes; five minutes to the park, ten minutes of hanging around, and then home again, provided A-Yuan doesn’t wake up hungry and crying, in which case Lan Huan is under strict instructions to bring him straight back to be fed. Wei Ying is feeling very cool about it until the door closes with his baby <em>on the other side of it,</em> and then he has to fight off the urge to sprint down the street and wrestle the stroller out of Lan Huan’s hands.</p>\n<p>“Fuck,” he says, and turns to Lan Zhan for a hug.</p>\n<p>“Mm,” Lan Zhan agrees, all twitchy and unsettled.</p>\n<p>They hold each other, finding what comfort and reassurance they can. Lan Zhan is warm and solid, and his fresh, sun-warmed scent begins to seep out from behind the overlay of tension. It’s good. Wei Ying tilts his head to share a smile, and Lan Zhan leans in and kisses him.</p>\n<p>Wei Ying jerks back.</p>\n<p>They stare at each other.</p>\n<p>Wei Ying gives the most awkward laugh ever heard in this universe. “Shit,” he says. And then he bolts into A-Yuan’s room.</p>\n<p>He stands there, one hand pressed against his chest, the other braced on the changing table to keep his knees from buckling.</p>\n<p>They kiss all the time, affectionate pecks on the cheek or the forehead or even the lips, but it had been more than a peck. It was a <em>kiss</em>, the kind of kiss they haven’t had since Wei Ying got too pregnant and grouchy to be interested in sex. It was a makeout kiss. And it turns out, that’s a big problem. Because Wei Ying has made out with Lan Zhan a hundred times before, and it’s never felt like having his heart torn out of his body and dragged over broken glass.</p>\n<p>He can’t let Lan Zhan kiss him. He can’t do that to himself. A-Yuan needs his heart unbroken.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>Wei Ying slopes back out into the lounge.</p>\n<p>“Uh,” he says. “Sorry.”</p>\n<p>“My fault,” says Lan Zhan. “Wei Ying, I overstepped. I forgot myself. It will not happen again.”</p>\n<p>“No, it’s fine. It was nothing. I just… I don’t think we should do that anymore.”</p>\n<p>“Of course.”</p>\n<p>It’s so awkward He’s such an idiot.</p>\n<p>He sits on the couch and waits, watching the closed front door. He wants A-Yuan. He wants his baby in his arms. Lan Zhan comes to sit with him, not close, not touching. Silent.</p>\n<p>It takes <em>forever. </em>But finally the buzzer rings. As soon as the stroller is through the door, Wei Ying is crouching to get A-Yuan out. “He’s hungry,” he says, which is ridiculous because A-Yuan is still fast asleep. “I’m going to take him. You two – you should hang out. Have some bro time.” And once again, he bolts.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>After three days of fake smiles and avoidance, Wei Ying decides he has to get it out in the open. Not because honesty is the moral choice – Lan Zhan already knows, he heard it and shut it down on the night A-Yuan was born – but because what he’s doing, living so close to Lan Zhan and pretending he isn’t affected by it, is going to kill him in the long term.</p>\n<p>Lan Zhan is the person whose help and advice he needs in a crisis, and this is definitely a crisis.</p>\n<p>He waits until A-Yuan is napping, eased into sleep with a guqin lullaby, and then he asks if they can talk. He sits them both down on the couch, a respectable distance apart, and takes a deep breath.</p>\n<p>“So I’m in love with you,” he says. “And I know that’s a problem. But we need to figure out how to fix it.”</p>\n<p>Lan Zhan’s face does something… strange.</p>\n<p>“You are not,” he says.</p>\n<p>Wei Ying blinks. “I am,” he says. “I love you. It’s driving me crazy.”</p>\n<p>“Wei Ying. It’s hormones. And A-Yuan.”</p>\n<p>Wei Ying shakes his head, laughing painfully. “It’s really not. I pretty much adore you. I <em>want</em> you. All the time. Believe me.”</p>\n<p>Lan Zhan looks at him with that awful stillness, that nothingness behind his eyes. Deathly, horrible. “How can I?” he says. And after another moment he drops his head, hiding his face in his hands.</p>\n<p>“Sweetheart,” says Wei Ying helplessly. “Lan Zhan. Is it so terrible? I’m not asking you for anything. I won’t get in the way when you find someone you want to be with. And A-Yuan is ours. Equal partners. That won’t ever change. I just need to find a way to manage where I don’t tear myself apart pretending.” He waits for some kind of response, but Lan Zhan is a fall of glossy hair, a taut curve of shoulder and back. Unmoving. “Lan Zhan? Please, can we just talk about it?”</p>\n<p>“I have loved you for years. I can’t bear to hear this and have it not be true.”</p>\n<p>Wei Ying’s mind goes blank. He stares, dumbfounded.</p>\n<p>“You are my world,” says Lan Zhan. He raises his head. In his still face, his eyes burn. “You and A-Yuan. I would give you everything I am. But don’t – don’t ask me to believe you. You have just given birth to my child. Your emotions will be unsettled for a while, but they will go back to what they were before. You never wanted me in that way. Just – friendship and heats. I can give you that, but don’t make me believe…”</p>\n<p>“Shit,” says Wei Ying. Everything is turning upside down around him. He can’t process it, there’s too much. He reaches out, wraps both his hands around one of Lan Zhan’s sturdy forearms and holds on. “Listen to me. I love you. I do, I love you, I swear.”</p>\n<p>“Wei Ying, <em>please.”</em></p>\n<p>It sounds like anguish. Like all the pain he’s been feeling, but magnified. How much pain has he caused this man who has asked nothing from him and given him everything? No wonder Lan Huan hates him. Step by step, and each one might have been designed specifically to torture. <em>Be my friend. Live with me. Satisfy me. Have a child with me.</em> He should never have asked. Would never have asked, if he’d known.</p>\n<p>He is loved. Lan Zhan loves him. It’s wonderful and appalling. “Years? All this time? Why didn’t you tell me?”</p>\n<p>“I should have,” says Lan Zhan, and his expression cracks. He hides his face again. “But you would have left me.”</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>“I’m too little for this,” says Wei Ying. “I’m only three years old. I can’t handle it.”</p>\n<p>Jiang Yanli, on the other end of the video call, presses her lips together in sympathy. ”You poor boys,” she says. “A-Ying, do you need me to fly out there?”</p>\n<p>Wei Ying pouts. He wants her to. But it’s a long trip, and it hasn’t even been a month since her last visit. There are valid reasons to drag someone across the country, but <em>‘I really need a hug’</em> isn’t one of them.</p>\n<p>“I need a way to convince him,” says Wei Ying. “He doesn’t believe me. It’s so fucking stupid.” He winces and drops an apologetic kiss on A-Yuan’s head. “Sorry. Daddy will try to stop swearing, but right now Papa‘s driving him to it.”</p>\n<p>“You have been sending him some mixed messages,” says Jiang Yanli.</p>\n<p>“I’m being clear <em>now</em>,” says Wei Ying. “I literally couldn’t be any clearer. He doesn’t want to hear it, he just goes all – fragile and sad, and I can’t do that to him. I can’t keep saying it. And god, Jiejie, you should see the way he looks at me, now he’s not trying to hide it...”</p>\n<p>If Lan Zhan had ever looked at him like that before, Wei Ying would not only have known, he’d have fallen for him on the spot.</p>\n<p>“I love him so much. And I want to strangle him and I want to punch myself,” says Wei Ying.</p>\n<p>She chuckles gently. “Maybe just give him some time before you try violence.”</p>\n<p>“I’m terrible at waiting.” He sniffles and wipes his eyes with his fingers, then his sleeve. A-Yuan, jostled, gives a whimper of protest. Wei Ying winces again, rocks him. “Shh, it’s okay,” he murmurs, but nope. Nope, Daddy fucked up. A-Yuan blinks his eyes open and starts wailing like a banshee<em>.</em> “Shit. I gotta go. Talk to you later.”</p>\n<p>“Give A-Yuan a kiss from me,” says Jiang Yanli. “And tell Lan Zhan he can always call me if he wants to talk.”</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>It sucks, having someone think he’s an irrational, hormone-driven mess who doesn’t know his own feelings. It especially sucks because for the past few months he <em>has</em> been an irrational, hormone-driven mess and he <em>didn’t </em>know his own feelings. But he knows them now.</p>\n<p>He’s always been drawn to Lan Zhan. He’s been building inevitably towards love from the very beginning. His pregnancy just moved him a little faster along a path he’d already been walking for years.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>A-Yuan gets sick.</p>\n<p>It’s nothing serious, as it turns out. But because he’s so small, so new, the risks are higher and the paediatrician is cautious. They spend two nights in the hospital. A-Yuan cries, weak and incessant, suffering, and there’s nothing Wei Ying can do except be there, hold him, and hold Lan Zhan’s hand to get through it. Lan Zhan is a rock. He asks all the right questions, he exudes calm. He makes it bearable.</p>\n<p>When they’re finally allowed to go home, they load A-Yuan’s car seat into Lan Huan’s car and both cram into the back seat alongside it. As the car pulls out into the traffic, Lan Zhan leans his forehead against Wei Ying’s shoulder and shudders with relief. Wei Ying whispers, “I love you,” and never even considers that he shouldn’t.</p>\n<p>At home, they curl around one another on the couch. A-Yuan rests on Wei Ying’s chest, and Lan Zhan’s hand makes a blanket for his tiny body. They can both feel him breathing.</p>\n<p>“Do you think I can find a way to put him back inside me?” says Wei Ying. “He could grow up in there for another year or so. Nice and safe.”</p>\n<p>“Mm,” says Lan Zhan. He sounds approving, but after a pause he adds, “I would miss seeing his face.”</p>\n<p>“We could install a window in my belly.”</p>\n<p>“Okay.”</p>\n<p>“Okay,” says Wei Ying. “I’ll get right on that.”</p>\n<p>That night, the careful distance Lan Zhan has been maintaining vanishes. They’re too raw, too tired. Wei Ying has no energy to pander to Lan Zhan’s reservations and Lan Zhan, it seems, has no energy to put up protections around his own heart. So they kiss gently in the dark and fall asleep together, one of Wei Ying’s hands resting in the bassinet, and Lan Zhan’s hand cradling his elbow, making Wei Ying’s arm an extension of his own.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>Wei Ying is done with Lan Zhan’s issues. He’s had enough.</p>\n<p>“I know you don’t like me,” he tells Lan Huan, “and I get it. But I need your help.”</p>\n<p>He’s probably got about thirty minutes to get this done. Then Lan Zhan’s going to call and ask, over the sound of outraged shrieking, if he would please come home <em>now</em> because A-Yuan has decided that bottles are not acceptable today.</p>\n<p>Lan Huan tilts his head. He has a very assessing gaze. Gentle, but keen. He doesn’t miss much. “I like you, Wei Ying,” he says. “There’s a lot to like about you.”</p>\n<p>Wei Ying wags a finger. “They say Lans don’t lie, but your diplomacy is pure bullshit.”</p>\n<p>“I don’t like the way you use my brother,” Lan Huan admits.</p>\n<p>“Yeah, I’m not crazy about that either. I didn’t mean to!” says Wei Ying, frustrated. “I didn’t know. And I don’t want to do that anymore. I love him. I want to be his mate. He’s told you that, right?”</p>\n<p>“He told me that you said it.”</p>\n<p>“I mean it. And I need him to accept it and stop waiting for the day I come to my senses and walk away. It’s not going to happen. He won’t listen to me, but he listens to you.” He’s pacing, talking with his hands – something he’s barely able to do anymore, because there’s usually a baby in them.</p>\n<p>“Why should I believe you, if he doesn’t?” says Lan Huan.</p>\n<p>“Because you can think about it rationally. Because I haven’t spent years accidentally fucking up your emotions.”</p>\n<p>There’s that assessing look again. Wei Ying fidgets under it. Lans are so rigid, so keen to pass judgement. But Lan Huan is by far the most easy-going and flexible of the ones Wei Ying has met, and eventually he gives a slow nod.</p>\n<p>“I’ll make tea,” he says, “and you can make your case.”</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>He waits afterwards. He waits a week. It’s a stressful week, because they’re trying to figure whether it will be possible to put A-Yuan into daycare. A-Yuan is eleven weeks old, and they’re still paranoid over him getting sick again, and Lan Zhan still hates being away from him for more than an hour or two at a time, is still determined to work from home as long as he can get away with it – but also, Wei Ying is going to go crazy with boredom if he doesn’t get to go back to work soon. Part time. From home, if he has to. He needs to be doing something, creating things, using his mind.</p>\n<p>“Try humming again,” he says, crossing his arms over his chest. He has his wrap on, holding absorbent pads over his little swollen breast nubs, because A-Yuan crying makes him leak like a faucet and it’s really gross.</p>\n<p>“I have <em>tried</em> humming,” says Lan Zhan tightly. He picks up the second nipple, the one Wei Ying has carefully pierced extra holes in, dips the tip in milk and swaps it out. “You need to not be here.”</p>\n<p>“Just give him to me for a bit. I’ll get him started, then we can switch him to the bottle.”</p>\n<p>“Wei Ying.”</p>\n<p>“It’s a strategy,” says Wei Ying defensively.</p>\n<p>“An unsuccessful one, every time. Go into the bedroom.”</p>\n<p>Wei Ying scowls, but he does it. He lies on his belly on the bed and listens to Lan Zhan’s coaxing and A-Yuan’s protests and grumbles and finally, silence. He sneaks back out. Lan Zhan, who has A-Yuan snuggled in his arms sucking away at the bottle, lowers his eyebrows and mouths <em>piss</em> <em>off</em>. It’s adorable.</p>\n<p>Wei Ying goes to lie down again, and this time the quiet lulls him. He wakes to find Lan Zhan setting A-Yuan down in the bassinet beside him, sated and fast asleep. Lan Zhan crawls onto the bed with him and they lie side by side, staring up at the ceiling.</p>\n<p>“Six months,” says Lan Zhan out of nowhere.</p>\n<p>“Huh?”</p>\n<p>“Six months. If you still feel the same way.”</p>\n<p>Wei Ying sits up, bouncing a little. His heart is hammering, his chest bubbling with excitement, because this is the closest he’s got, the best sign that there’s hope. But still, come <em>on</em>. “Six months?” he says, and then winces and lowers his voice. “Six months? Seriously? Why?  I’m not going to change my mind!”</p>\n<p>“Prove it.”</p>\n<p>“But… six <em>months</em>, Lan Zhan!”</p>\n<p>“I waited for you.”</p>\n<p>“Oh my god,” says Wei Ying. “You manipulative son of a bitch. How am I supposed to say no to that?” He bounces again, in a little creak of bedsprings, and muses, absently scratching his nose as he thinks. “Six months from when A-Yuan was born,” he counters.</p>\n<p>“Hmm.”</p>\n<p>Wei Ying beams. “His six month birthday.”</p>\n<p>“I did not say yes.”</p>\n<p>He didn’t say no either. Wei Ying pounces on him and presses kisses to his forehead and cheeks.</p>\n<p>Lan Zhan pushes him off. “Wei Ying! Six months means <em>not yet</em>.”</p>\n<p>“That wasn’t couple-type kissing. That was just because you’re the cutest.”</p>\n<p>“You’ll wake A-Yuan,” says Lan Zhan, thoroughly exasperated.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>It isn’t six months. There’s no finish line to cross. Instead, it’s a gradual thing. Lan Zhan still flinches to hear ‘I love you,’ but he starts to say it. His body language subtly shifts sometimes, when they’re out, his shoulders square and he positions himself at Wei Ying’s shoulder when Wei Ying chats to a cashier in the grocery store or stops to speak to another parent in the park. There’s still not much in their lives that isn’t about A-Yuan, but they start him in daycare three mornings a week and that means Lan Zhan can take an early lunchbreak and they can eat together and talk – and talking sometimes means flirting, a low simmer of heat between them. Then there’s the evening when they’re watching mindless TV and Lan Zhan shifts his arm so his wrist lies against Wei Ying's neck, his scent-gland pressed against the point where a mating bite would be. Wei Ying goes hot all over, forgets how tired he is, overwhelmed by the need to bare himself under Lan Zhan, throat exposed… but he doesn’t, he can’t, <em>not yet</em>.</p>\n<p>It happens again, and this time Lan Zhan slides his hand down into Wei Ying’s lap.</p>\n<p>It happens again, and Lan Zhan climbs on top of him, presses into him and, with no ceremony whatsoever, bites down.</p>\n<p>“You asshole,” says Wei Ying afterwards, blissed out and laughing with pure happiness. “Not even flowers, Lan Zhan? Not even dinner?” His neck is stinging and tingling, spreading warmth through every part of him.</p>\n<p>Lan Zhan rumbles satisfaction deep in his chest. “Felt like the time,” he says.</p>\n<p>“It’s <em>been</em> time,” says Wei Ying, and grabs his hand, guiding it back down between his legs to start on round two. Except that’s when A-Yuan’s unmistakeable <em>I’m hungry </em>cry emanates from the bedroom. “<em>Fuck</em>. Is there milk in the fridge? You have to do it, I can’t feed him with your come dripping out of me.”</p>\n<p>They peel apart. Lan Zhan, after a perfunctory clean-up, goes to feed the baby. Wei Ying takes a little more time, but he doesn’t shower, doesn’t want to wash away the scent of it just yet. Then he goes into the bedroom, where Lan Zhan is propped against the pillows, cradling A-Yuan. He goes to sit with them, and A-Yuan looks up at him and abandons sucking to beam and coo and giggle. Wei Ying beams back, makes faces at him, and murmurs, “Oh my god, why? Why is he so awake, he’s going to be up for fucking hours.”</p>\n<p>“Don’t swear in front of him.”</p>\n<p>“Yes, alpha,” says Wei Ying sweetly, and when Lan Zhan turns an utterly incredulous face to him he cracks up.</p>\n<p>“<em>No</em>,” says Lan Zhan.</p>\n<p>“You bit me,” says Wei Ying, sticking out his tongue. “You’ve got to deal with me.”</p>\n<p>Lan Zhan smiles. “Forever,” he says, and wraps his arm around Wei Ying, pulling him close.</p>"
}