{
  "id": "26146237",
  "url": "https://archiveofourown.org/works/26146237?view_full_work=true",
  "author": [
    "graveltotempo"
  ],
  "title": "here we go again",
  "rating": "Not Rated",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen",
    "M/M"
  ],
  "fandoms": [
    "Marvel Cinematic Universe",
    "The Avengers (Marvel Movies)",
    "Spider-Man (Tom Holland Movies)"
  ],
  "relationships": [
    "Peter Parker & Tony Stark",
    "Peter Parker & Avengers Team"
  ],
  "characters": [
    "Peter Parker",
    "Ned Leeds",
    "Michelle Jones",
    "Flash Thompson",
    "Tony Stark",
    "Pepper Potts",
    "Loki (Marvel)",
    "Stephen Strange",
    "James \"Bucky\" Barnes",
    "James \"Rhodey\" Rhodes",
    "Thor (Marvel)",
    "Carol Danvers",
    "Hope Van Dyne",
    "Harley Keener",
    "SI Team",
    "Original Female Character(s)",
    "Original Male Character(s)",
    "Midtown (Ensemble)",
    "Friday (Marvel)",
    "Vision (Marvel)",
    "Matt Murdock",
    "SI Employees"
  ],
  "additional_tags": [
    "Precious Peter Parker",
    "Tony Stark Acting as Peter Parker's Parental Figure",
    "Tony Stark Acting as Harley Keener's Parental Figure",
    "Vision is Tony's child",
    "James \"Rhodey\" Rhodes & Tony Stark Friendship",
    "Civil War Team Iron Man",
    "Post-Captain America: Civil War (Movie)",
    "New Avengers",
    "not team Cap friendly",
    "Not Steve Rogers Friendly",
    "im Still Salty",
    "Flash Thompson Being A Jerk",
    "and a bully",
    "The Avengers Are Good Bros",
    "Peter Parker's Field Trip to Stark Industries",
    "Friday is the best",
    "moderated for my peace of mind",
    "cause i know team cap ppl can be very annoying",
    "Crack",
    "Fluff and Crack",
    "Crack Treated Seriously",
    "BAMF Stark Industries",
    "Stark Industries"
  ],
  "language": "English",
  "series": "",
  "published": "2020-08-27",
  "completed": null,
  "words": "13,565",
  "chapters": "1/1",
  "comments": "154",
  "kudos": "9,041",
  "bookmarks": "2,018",
  "hits": "79,692",
  "summary": "<p>\"According to Dante and a lot of Christians there are nine circles of hell: limbo, lust, gluttony, greed, anger, heresy, violence, fraud and treachery.</p>\n<p>Peter Parker was pretty sure he had now ended up in the secret tenth circle of hell, the one created specifically for him: embarrassment.</p>\n<p>Because what other possible explanation would there be for his terminal case of foot in the mouth disease? What other way to excuse the fact that he always ended up saying the wrong thing at the wrong time?</p>\n<p>Why else would he be going on a school trip to Stark Tower?\"</p>\n<p align=\"center\"><strong>or</strong>:</p>\n<p>\n<span>Tale as old time: Peter Parker's science class goes on a school trip to Stark Industries. </span>\n</p>\n<p>\n<span>It goes as well as you'd expect.</span>\n</p>",
  "notes": "<p>i wanted to give this trope as a try for my very first work in the marvel fandom eheh<br>also team cap vade retra, i am not mean to them, but I am NOT nice either. there is no real romantic relationship, but there is a hint of ironstrange, frostiron and winteriron at the end eheh</p>\n<p>also i have never worked in an office so im pulling shit out of my ass</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>peter at the end when they were talking ship: tbh im more of a pepperony stan myself</p>",
  "text": "<p>\n<span>According to Dante and a lot of Christians there are nine circles of hell: limbo, lust, gluttony, greed, anger, heresy, violence, fraud and treachery.</span>\n</p>\n<p>\n<span>Peter Parker was pretty sure he had now ended up in the secret tenth circle of hell, the one created specifically for him: <em>embarrassment</em>.</span>\n</p>\n<p>\n<span>Because what other possible explanation would there be for his terminal case of foot in the mouth disease? What other way to excuse the fact that he always ended up saying the wrong thing at the wrong time?</span>\n</p>\n<p>\n<em>\n<span>Why </span>\n</em>\n<span>else would he be going on a school trip to Stark Tower?</span>\n</p>\n<p>\n<span>As the school bus finally stopped in one of the parking lot behind the tower, Peter couldn’t help the groan that escaped him. He wondered, distractedly, if calling in sick right now would help him or further ruin him, since May was at work and his other contact in case of sickness or danger was Tony himself.</span>\n</p>\n<p>\n<span>He nearly tripped down the stairs when Flash knocked into him as they stepped off the bus, an ugly sneer on his face. </span>\n</p>\n<p>\n<span>“Hey, Parker, how does it feel knowing that your lie is about to catch up with you?”</span>\n</p>\n<p>\n<span>Ned, bless his heart, immediately jumped to defend him. “Peter is not lying!”</span>\n</p>\n<p>\n<span>“I can’t believe you </span>\n<em>\n<span>actually </span>\n</em>\n<span>believe that Parker interns here with Tony Stark himself. Cause if you do, you’re more pathetic than he is.” Flash turned his eye on Peter once more. “Everyone knows that Mr Stark does </span>\n<em>\n<span>not </span>\n</em>\n<span>do interns. At least you could have lied and said Ms Potts. She at least </span>\n<em>\n<span>does </span>\n</em>\n<span>have an intern.”</span>\n</p>\n<p>\n<span>Peter knew he was talking about Harley and couldn’t help grimacing at the thought of - his step brother? fake brother? Neither of them were Tony’s kids, not really, but at the same time they </span>\n<em>\n<span>kind </span>\n</em>\n<span>of were - the other. Don’t misunderstand him, Peter absolutely adored Harley. It was nice having another teenager that understood him, could keep up with him in terms of science, knew his secret, liked Tony as much as he did and spoke his language.</span>\n</p>\n<p>\n<span>But it was actually Harley’s fault that they were there.</span>\n</p>\n<p>\n<span>Stark Tower had very few schools they invited to visit every year, and Midtown High was not popular </span>\n<span>enough </span>\n<span>to have been selected. But as Pepper’s secretary/PA/intern, Harley had a lot of freedom and decisions he was able to make for the company, and this was one of those.</span>\n</p>\n<p>\n<span>When Peter had found out and sub-sequentially chased him around and threatened to web him to the ceiling, Harley had told him that he had done it for Peter, to give him a chance to show up all the annoying bullies in his school by showing how a ‘nerd’ was actually cooler than all of them together.</span>\n</p>\n<p>\n<span>And that was sweet, of course. But </span>\n<em>\n<span>still</span>\n</em>\n<span>! Peter would have to walk around his second home with his classmates and risk being embarrassed by the other residents who all loved him and acted like he was their shared little brother. Hadn’t he suffered enough?</span>\n</p>\n<p>\n<span>On top of that, if Flash was stupid enough to act up in Tony’s own home under FRIDAY’s watchful gaze, Peter worried for his life. He was man enough to admit that he was everyone’s favourite and both the SI employees and the few Avengers who might be around would </span>\n<em>\n<span>kill </span>\n</em>\n<span>for him.</span>\n</p>\n<p>\n<span>They stopped once inside the tower and Peter decided to hang back a little, hoping the gaggle of other student around could hide him from where Ms ‘call-me-Noel’ Stevenson and Mr. ‘call-me-Theo’ Reunald were manning the security desk.</span>\n</p>\n<p>\n<span>“Hello Midtown High!” called a woman at the very front of the crowd, standing next to their teachers. Thankfully for Peter, it wasn’t anyone he recognised. “My name is Elena Spike, and today I will be your guide as we go through Stark Tower. </span>\n</p>\n<p>\n<span>“I am sure your teachers have already given you, along with the NDAs you’ve signed, a packet containing what you will be doing throughout the day, but to rehash. The morning will be divided between going through the lower level facilities. You will receive small explanations behind everything Stark Industries works with and have a chance to speak and question our various sectors: Legal, Communications, Security, PR and some other sub sectors. Then the CEO, Miss Virginia ‘Pepper’ Potts will speak to you guys, and talk about her own experience going from an intern, to working in Legal, becoming Dr Stark’s PA and then CEO.</span>\n</p>\n<p>\n<span>“After that you will be left for lunch for an hour, before going to the two sectors I’m sure most of you are interested in: the science labs and then R&amp;D. You will spend a while there with the others before finally going into a free lab and conducting an experiment lead by our senior staff.”</span>\n</p>\n<p>\n<span>Mutters of excitement rose around him and Peter sighed. He was curious though, that Aminah - he assumed it was her, she was the other senior staff aside from Tony -  had agreed to do an experiment with a bunch of teenagers. She liked him well enough, but that was mostly because he came with a stamp of approval from Tony and did his more… ambitious experiments, in <strike>Tony's</strike> his own lab, which meant she wasn’t liable for anything going wrong. She wasn’t a children/teenagers person.</span>\n</p>\n<p>\n<span>Elena continued, “And then, at the end of the day, there might be a surprise. I don’t know what it is, though, as it hasn’t been specified on my packet either.</span>\n</p>\n<p>\n<span>“As you all know, the Tower is several stories high, and therefore has a system of clearance to make sure no one ends up somewhere they are not supposed to be. Badges are being provided to you now,” as she spoke, their teachers started moving, handing them the different badges around, “and they have your name on it. Please do not lose the badges, as they are the only thing granting you access to elevators and any doors you might need to use.</span>\n</p>\n<p>\n<span>“Remember you have already signed NDAs before coming here, and if you break them in any way you </span>\n<em>\n<span>will </span>\n</em>\n<span>get sued.” Her smile had disappeared, a stern expression taking its place. “<em>Stark Industries</em> is one of the front runners in many sectors all around the world. We take industrial espionage very seriously, and we don’t want any ‘accidents’. You are here because your school has agreed that you are trustworthy and you’ve agreed to be mindful of the experiments and activities you’ll be seeing all around,” She smiled again, showing way too many teeth. “Let’s try to avoid meeting Legal from the other side, okay? Any question?”</span>\n</p>\n<p>\n<span>Oh, Pepper </span>\n<em>\n<span>must </span>\n</em>\n<span>have hired. </span>\n</p>\n<p>\n<span>Despite the slightly uncomfortable air that rose from the woman’s words, one of the students - Harriet - raised her hand. “Will we be able to see the Avengers around?”</span>\n</p>\n<p>\n<span>“As I’m sure you all know, the Avengers Initiative has relocated to the Avengers Compound,” answered Elena. “Which means that most of them reside there or at their own places. Some of them might be around for one reason or another, but I must ask you to avoid approaching them. They live stressful lives and the last thing they need is anyone crowding them or jumping them with questions. If we do run into any of them and they approach you, please be mindful and polite. I’m sure you’ll make sure?” Her last question was for Mr. Harrington, who promptly nodded, sending a scathing look to the class.</span>\n</p>\n<p>\n<span>Despite what Elena thought, the chances of the Avengers being around was, unfortunately, very high.</span>\n</p>\n<p align=\"center\">\n<span>+++</span>\n</p>\n<p>\n<em>\n<span>“Hey, Peter,” said Tony, the week before, taking a seat at the new Cafeteria built in the Compound.</span>\n</em>\n</p>\n<p>\n<em>\n<span>Because the Avengers were busy people - Thor was King in New Asgard, Tony and Hope were running companies, Dr. Strange was Master of the New York Sanctum, Matt was still a lawyer…- it was hard finding time for everyone to hang out.</span>\n</em>\n</p>\n<p>\n<em>\n<span>According to Tony (and Rhodey) one of the hang ups of the previous version of the Avengers was the fact that they hadn’t come together organically; first they had been forced to fight without knowing each other, then in an effort to ‘build healthy relationships’ ,they were forced into mandatory movie nights that didn’t respect Tony, Rhodey and sometimes Bruce’s other commitments.</span>\n</em>\n</p>\n<p>\n<em>\n<span>Because of that, Carol had issued an invite for brunch together every Saturday morning, a date and time she had found was free for almost everyone, at one point or another. The brunches weren’t mandatory, but it was one of the few times everyone was free and could, come together. Even Peter - reserve Avenger was still an Avenger! - was able to attend.</span>\n</em>\n</p>\n<p>\n<em>\n<span>(the success was expected: turns out that when you don’t force people to come to you under pain of Disapproving Looks and pointed remarks, people end up </span>\n</em>\n<span>wanting </span>\n<em>\n<span>to come. Who knew?)</span>\n</em>\n</p>\n<p>\n<em>\n<span>Peter had looked up from his plate, smiling. “Hi, Mr Stark. What’s up?”</span>\n</em>\n</p>\n<p>\n<em>\n<span>His smile wavered at the very wide smirk on Tony’s face. The fact that even him calling him Mr Stark hadn’t curved his enthusiasm was suspicious. Unless…</span>\n</em>\n</p>\n<p>\n<em>\n<span>No, he couldn’t. Right?</span>\n</em>\n</p>\n<p>\n<em>\n<span>His horror was apparently very apparent on his face, and Tony’s grin grew, as he pulled out a paper from his suit pocket. “You forgot your field trip slip in Happy’s car,” he sing sang, laughing when Peter let out the most wounded of noises.</span>\n</em>\n</p>\n<p>\n<em>\n<span>“Field trip?” questioned Loki, sitting down with his own plate next to Tony. “You’re going to… a field?”</span>\n</em>\n</p>\n<p>\n<em>\n<span>“No,” Tony laughed again when Peter groaned again, “Petey-Pie and his little school friends are heading to my tower next week to visit.”</span>\n</em>\n</p>\n<p>\n<em>\n<span>The effect was immediate. The rest of the Avengers and Avenger's Friends (trademark pending) stopped in the middle of their conversations, identical looks of delight on their faces. Even Carol was straight up grinning, even if she tried to hide behind her coffee mug.</span>\n</em>\n</p>\n<p>\n<em>\n<span>Darcy didn’t even pretend. “Is that so, Parker? That sounds like fun!”</span>\n</em>\n</p>\n<p>\n<em>\n<span>Peter narrowed his eyes at her, shaking a finger in her face. “It’s a </span>\n</em>\n<span>Stark Industries</span>\n<em>\n<span> trip, not an Avengers trip. You’re not allowed to get involved.”</span>\n</em>\n</p>\n<p>\n<em>\n<span>“Sure,” immediately agreed <strike>Bucky</strike> James. Then, “Hey, remember when you used your spider fluid to stick those magnets to my arm?” he asked, innocently.</span>\n</em>\n</p>\n<p>\n<em>\n<span>Peter hit his head on the desk again, ignoring the team’s loud laughter around him.</span>\n</em>\n</p>\n<p align=\"center\">\n<span>+++</span>\n</p>\n<p>\n<span>“Is there a reason our badges are different from yours? And will we be able to take this home after?” asked Sarah, and Peter turned his attention back on what was going on.</span>\n</p>\n<p>\n<span>Elena smiled. “Oh, good question. We have a colour system for all of our badges and each colour shows a different clearance level. As an intern in Legal, my badge is blue, and I can use it any time necessary. It grants me access to every SI floor, but I cannot go past them to the residential floors, or to any other sectors floors. </span>\n</p>\n<p>\n<span>“Your badges are grey and they are the second to lowest levels, guests and tour groups. You’ll have access to the bathrooms, the elevator, the common area where you’ll have your lunch, and the lower levels. Don’t worry, I’ll be the one opening most of the doors anyway. </span>\n</p>\n<p>\n<span>“Those badges activate when you scan them here,” she pointed to a scanner, “and will automatically deactivate when you scan them again once you leave. You can keep them, of course, but they won’t work again.”</span>\n</p>\n<p>\n<span>“What is the highest clearance?” asked someone else.</span>\n</p>\n<p>\n<span>“Purple, Silver and Gold have, from what I know, access to most levels. Purple is for the Avengers,” and everyone made excited noises at that, “But they aren’t allowed on SI’s levels or in the penthouse unless invited. Silver is for the people living in the penthouse, and they too don’t have access to SI’s levels. Gold is for Dr Stark, Ms Potts, and the two interns who work with them, which is total access.”</span>\n</p>\n<p>\n<span>“And is it true that one of Dr Stark’s intern is a teenage boy?” asked Flash, sending Peter a mocking glare.</span>\n</p>\n<p>\n<span>Elena shrugged slightly. “I work mostly under Ms Potts; Dr Stark is the head of R&amp;D, they would be able to tell you about it. Are you interested in joining the team? Because Dr Stark picks them himself, you won’t be able to just hand him a resume.”</span>\n</p>\n<p>\n<em>\n<span>You won’t be able to hand him anything</span>\n</em>\n<span>, mused Peter, rolling his eyes at the way Flash shot him a victorious look, like he had proved anything. </span>\n</p>\n<p>\n<span>“Now, is Mr. Parker here?” questioned Elena all of sudden, and Peter snapped back to attention, ignoring how everyone - including security - was looking at him in surprise.</span>\n</p>\n<p>\n<span>“Uhm, yes?”</span>\n</p>\n<p>\n<span>The woman found him, and shot him a smile. “I’ve been told you can use your own badge? Mr. Keener wrote down here that it would be wasteful giving you a new one when you already have your usual.”</span>\n</p>\n<p>\n<em>\n<span>Fucking Harley,</span>\n</em>\n<span> though Peter, ignoring his growing blush and nodding slightly. “Yeah, I have mine.”</span>\n</p>\n<p>\n<span>Flash narrowed his eyes at him, but again Elena interrupted. “Alright, let’s get through, guys.”</span>\n</p>\n<p>\n<span>She passed her badge over the reader and many jumped up when FRIDAY spoke, “<em>Elena Spike, Legal, clearance level: blue. Welcome, Ms Spike</em>.”</span>\n</p>\n<p>\n<span>MJ is the first to recover, looking vaguely interested. “Who’s that.”</span>\n</p>\n<p>\n<span>Elena smirked. “FRIDAY?”</span>\n</p>\n<p>\n<span>“<em>Hello, Midtown High</em>,” continued FRIDAY’s voice. “<em>My name is FRIDAY and I am an Artificial Sentience - or Artificial Intelligence - created by Dr Stark. I operate across the entire Tower, so if at any times you find yourself lost, just state my name and your query and I’ll do my best to answer. I will facilitate your visit today at the best of my abilities</em>.”</span>\n</p>\n<p>\n<span>FRIDAY’s voice was particularly robotic today, and Peter felt a little bad about her having to hide her humanness just because people might misunderstand or fear her.</span>\n</p>\n<p>\n<span>“Shall we continue?”</span>\n</p>\n<p>\n<span>At Elena’s call, the rest of the students moved forward, Flash of course forcing himself to the front.</span>\n</p>\n<p>\n<span>“<em>Flash Thompson, Midtown High, clearance level: grey. Welcome, Mr Thompson,</em>” called out FRIDAY, and even Flash couldn’t help fawn about how cool it was.</span>\n</p>\n<p>\n<span> One by one everyone went through, the teachers the only ones standing at the back of the group, with the last students.</span>\n</p>\n<p>\n<span>Then it was Peter’s turn.</span>\n</p>\n<p>\n<span>“<em>Peter Parker, clearance level: gold. Hey, Peter! How are you? Would you like me to alert-</em>”</span>\n</p>\n<p>\n<span>“Hey FRIDAY,” quickly answered Peter, ignoring the shocked looks of everyone except for Ned and MJ. “No, I’m fine. School trip, remember?”</span>\n</p>\n<p>\n<span>“<em>Very well. Have fun!</em>” she said, her voice less robotic and much more mischievous, like she knew something he didn’t.</span>\n</p>\n<p>\n<span>And knowing FRIDAY, she most likely did.</span>\n</p>\n<p>\n<span>As they separated in smaller groups to ride the elevators, he felt rough hands on him immediately. “What the fuck, Parker? Did you hack Stark’s AI? You realise how much trouble you’re in-”</span>\n</p>\n<p>\n<span>“Eugene,” interrupted MJ, crossing her arms together. “Are you calling Dr Stark stupid and incompetent enough that a teenager can hack his AI - in his own tower, mind you - or are you finally admitting that Peter is a genius?”</span>\n</p>\n<p>\n<span>Flash sputtered, heat raising on his cheeks, and Peter sighed, freeing himself of the hands. “I told you, man. I’m an intern, here.”</span>\n</p>\n<p>\n<span>The other’s said something unflattering about him under his breath, but then the elevator stopped and they all climbed in, in different groups.</span>\n</p>\n<p>\n<span>By the time they had reached the new floor and spilled out of the elevator, Peter had figured out his plan of attack. Hang at the back, keep his head down and hope for the best. To be honest, even though he had clearance for everywhere in the Tower, he rarely ever spent time anywhere that wasn’t with the R&amp;D people, Tony's lab, the Avengers’ floors or the Penthouse. That didn’t mean, however, that most of the SI teams didn’t know him already.</span>\n</p>\n<p>\n<span>Which meant that the moment they walked into Legal, Ms. Pyatt rounded on him immediately. “Oh, Parker, hey! Are you busy, or do you think you can run up and get these to Potts? I haven’t seen Keener yet -”</span>\n</p>\n<p>\n<span>Before he could reply, however, Elena intervened, laughing slightly. “Blair, Mr. Parker is here on a school trip today, he’s not on payroll.”</span>\n</p>\n<p>\n<span>The woman finally seemed to notice the rest of the students, and gave Peter a little embarrassed grin. “Oh god, I’m sorry, Pete! I didn’t even realise.”</span>\n</p>\n<p>\n<span>“It’s fine, Ms Pyatt,” he said, blushing a little. “If it’s any help, Harley isn’t here today.”</span>\n</p>\n<p>\n<span>“That brat,” sighed the older woman, shaking her head. “Sorry again!” she said, quickly walking away.</span>\n</p>\n<p>\n<span>As Elena started talking again, Flash slithered next to him again, smirking. “So that’s what your ‘great interning job’ is? Getting people documents and coffee? No wonder you have all clearance,” he mocked, clearly very pleased with himself. </span>\n</p>\n<p>\n<span>Peter didn’t deign him with an answer. </span>\n</p>\n<p>\n<span>The thing was… Peter could </span>\n<em>\n<span>easily </span>\n</em>\n<span>fuck Flash’s whole world. All he had to do was ask Tony to pick him up from school one day. Or show up with an Avenger in tow to an event.</span>\n</p>\n<p>\n<span>But the other side of the coin would be admitting to the Avengers and his family that he was getting harassed at school, even though he had a lot more strength than everyone who attended with him. And that was just bad vibes all around.</span>\n</p>\n<p>\n<span>He didn’t want them to think he was being bullied and intervene. Because they would freak out, and freak out <em>bad</em>. Even though most of the New Avenger had been picked on and had had a hard time growing up - Tony and Bruce as teen geniuses, Rhodey as a black student in a white field, Carol being one of the first women in the Air Force, Stephen grew up poor, Loki was disliked by Thor’s warrior friends because of his magic, Bucky grew up in the depression and was forcibly drafted in the war… the most well adjusted of them was </span>\n<em>\n<span>Vision</span>\n</em>\n<span>. Enough said  - they would </span>\n<em>\n<span>freak </span>\n</em>\n<span>if they heard someone had looked at him wrong.</span>\n</p>\n<p>\n<span>(Like when Tony had told them about the fight in Germany and how Captain America had thrown a jet bridge on him. Tony had gotten an earful about dragging Peter in that fight, and Carol and Bucky had promised themselves that when the Rogues came out of their super secret hiding place cough Wakanda cough they would kick Roger’s ass)</span>\n</p>\n<p>\n<span>It wasn't worth it, and at least, better it be Peter, who could take it, than someone else.</span>\n</p>\n<p>\n<span>So he mostly stayed at the back for the rest of the morning, paying little attention and waving whenever someone recognised him.</span>\n</p>\n<p>\n<span>“God, I’m starving,” said Ned from next to him, as they left the PR floor and headed to one of the small auditoriums on the 21st floor.</span>\n</p>\n<p>\n<span>“We just have the presentation with Ms Potts now, right?” questioned MJ, checking the schedule. “Good. She seems really cool.”</span>\n</p>\n<p>\n<span>“Oh she is,” admitted Peter, always a fan of praising Pepper. “She is the only one who legitimately scares me in this whole Tower. Because if Pep- Ms Potts hates you, </span>\n<em>\n<span>everyone </span>\n</em>\n<span>hates you. It’s like she’s the initiation test for everyone who works at a high enough level in the Tower.”</span>\n</p>\n<p>\n<span>The girl looked amused and disbelieving. “Seriously?”</span>\n</p>\n<p>\n<span>“Legal has a shrine dedicated to her that they pray to before every case, just like R&amp;D offers a sacrifice of green smoothies and donuts to a To- Dr Stark inspired robot every time they start an experiment,” he confided, grinning as her amusement grew.</span>\n</p>\n<p>\n<span>“This place is so weird. I see why you are so comfortable around here, now.”</span>\n</p>\n<p>\n<span>Peter made to complain about the, frankly, unfounded accusation when his phone vibrated in his pocket.</span>\n</p>\n<p>\n<span>He pulled it out and stayed slightly back, reading the text.</span>\n</p>\n<p>\n<b>here comes dat boy (oh shit, whaddup): </b>\n<span>pete pls tell me u can see this text</span>\n</p>\n<p>\n<b>here comes dat boy (oh shit, whaddup): </b>\n<span>come on</span>\n</p>\n<p>\n<b>here comes dat boy (oh shit, whaddup): </b>\n<span>come on come on</span>\n</p>\n<p>\n<b>here comes dat boy (oh shit, whaddup): </b>\n<span>come on come on come on</span>\n</p>\n<p>\n<b>my name is peter with a b: </b>\n<span>when did you hack me and change my name</span>\n</p>\n<p>\n<b>here comes dat boy (oh shit, whaddup): </b>\n<span>peter!!!!! thank god, do me a favour</span>\n</p>\n<p>\n<b>my name is peter with a b</b>\n<span>: no</span>\n</p>\n<p>\n<b>here comes dat boy (oh shit, whaddup):</b>\n<span> u need to tell pep i need the documents for the japanese merger. i have everything EXCEPT tony’s signature</span>\n</p>\n<p>\n<b>my name is peter with a b</b>\n<span>: what</span>\n</p>\n<p>\n<b>my name is peter with a b</b>\n<span>: tony signed the other day i’m pretty sure</span>\n</p>\n<p>\n<b>here comes dat boy (oh shit, whaddup):</b>\n<span> i didn’t get it and i have the meeting in like half an h o u r and peppers not answering g me, peter, spiderling, DUDE</span>\n</p>\n<p>\n<b>my name is peter with a b</b>\n<span>: chill omg, i’ll ask her</span>\n</p>\n<p>\n<b>here comes dat boy (oh shit, whaddup): </b>\n<span>u’re literally the loml, omg thank you. remember japan merger, document alpha gamma 124 a, b, c &amp; d!!!!!!!!!!!!</span>\n</p>\n<p>\n<span>Peter put his phone back into his pocket and settled in the free chair behind MJ and next to Ned, and considered how to play it. Pepper’s talk was going to last around an hour, and Harley clearly needed the documents before that.</span>\n</p>\n<p>\n<span>And as much as Harley’s suffering brought nothing but joy to Peter’s cold heart… he was too nice to cause potential real life trouble to the boy or Tony and Pepper’s company. </span>\n</p>\n<p>\n<span>So he waited until Pepper walked into the room, dressed to the nines in a beautiful pressed pink suit and black louboutins, then immediately raised his hand, ignoring Elena’s ‘Can I help, Mr Parker?’.</span>\n</p>\n<p>\n<span>Pepper, upon hearing his name from the woman, turned around, immediately smiling when she saw Peter. “Peter! I didn’t know your school was the one coming!” She made a face. “Harley?”</span>\n</p>\n<p>\n<span>“Harley,” agreed Peter, rolling his eyes and ignoring his classmates, teachers and Elena’s staring. “Anyway, Ms Potts-”</span>\n</p>\n<p>\n<span>“Since when do you call me </span>\n<em>\n<span>that</span>\n</em>\n<span>?”</span>\n</p>\n<p>\n<span>He grimaced. “Pepper. Harley just texted me about the meeting he has in like 20 minutes? For the merger? He’s been trying to get a hold of you, he’s missing some of the signed forms.”</span>\n</p>\n<p>\n<span>Pepper frowned, beckoning him. “Tony’s?”</span>\n</p>\n<p>\n<span>“Yeah,” he answered, pulling out his phone as he approached her. “But I know for a fact Tony has already signed those, he made me scan them specifically for the meeting? He sent them down to Legal to make a record of.”</span>\n</p>\n<p>\n<span>The red haired woman opened her laptop, going immediately in CEO mode. “Has Harley called Tony?”</span>\n</p>\n<p>\n<span>Peter nodded. “Yeah, but he hasn’t gotten an answer either. FRIDAY says he’s in the ‘shop.” When the woman’s frown grew, Peter motioned to her laptop. “He made me scan them, so I should have a copy. The first lesson you taught me was make a copy, a copy of that and a copy of </span>\n<em>\n<span>that</span>\n</em>\n<span>,” he reminded her, smiling a little, and forcing himself to ignore their shocked audience.</span>\n</p>\n<p>\n<span>Pepper immediately relaxed. “Thank god I have you, Peter,” she sighed, handing him the small computer. “Have at it.”</span>\n</p>\n<p>\n<span>Peter sat behind the desk, keeping his gaze focused on the task at hand.</span>\n</p>\n<p>\n<span>To be honest, at the beginning, his internship had not really involved any legal mumbo jumbo. It just involved helping Tony in the workshop with their suits and sometimes following him in the R&amp;D labs when the man was too busy to stay and help him one on one.</span>\n</p>\n<p>\n<span>Then Tony had started asking him for his opinions and advice on various other experiments and suddenly the rest of the R&amp;D team was following script, wanting to hear from a ‘fresh perspective’. And since he was shadowing the Head of R&amp;D and helping with patented work, soon he had forms and stuff to fill. Technically he was </span>\n<em>\n<span>not </span>\n</em>\n<span>Tony’s PA, but he was with the man often enough that at least Pepper and Harley sent him stuff instead of sending it to Tony, and now there he was.</span>\n</p>\n<p>\n<span>“Found it!” he announced a few moments later, opening up Harley’s e-mail. “Would you like me to CC is to you, too?”</span>\n</p>\n<p>\n<span>“Yes please,” agreed Pepper, coming to look at the screen next to him. “Have you checked-”</span>\n</p>\n<p>\n<span>“Yes.”</span>\n</p>\n<p>\n<span>“And the last one-”</span>\n</p>\n<p>\n<span>“Yup.”</span>\n</p>\n<p>\n<span>“Single or double?”</span>\n</p>\n<p>\n<span>“Double, and Harl has the empty one.” He finished typing a general email for Harley and cocked his head to the side. “Do you want a recording, transcript or his minutes of the meeting?”</span>\n</p>\n<p>\n<span>Pepper thought about it for a second, then shrugged. “Minutes.”</span>\n</p>\n<p>\n<span>“Typed or-”</span>\n</p>\n<p>\n<span>“Oh, typed for sure. And then tell him to send me everything once he’s finished with everything, and CC it to Pyatt in Legal, Tony, you and Murdock.”</span>\n</p>\n<p>\n<span>Peter stopped tapping, looking at the woman in confusion. “Murdock? Matt?”</span>\n</p>\n<p>\n<span>“Yes,” she said, appearing a little amused at his question.</span>\n</p>\n<p>\n<span>The brunet’s confusion didn’t dissipate. “Is he consulting?”</span>\n</p>\n<p>\n<span>“Not officially, hasn’t signed anything.”</span>\n</p>\n<p>\n<span>Peter kept staring at her. “Isn’t it a conflict of interest? Shouldn’t Legal make him sign some sort of NDA, first. I mean, I respect him immensely and I trust him with my life, but don’t you want to cover your bases? Isn’t it a risk you should avoid, especially if someone in his office sees it?”</span>\n</p>\n<p>\n<span>He was vaguely aware of Elena and Mr Harrington gasping at the blunt question, but he knew Pepper - and Tony - preferred people questioning them at every turn (within reason) to yes men who couldn’t think for themselves.</span>\n</p>\n<p>\n<span>As expected, Pepper beamed. “Normally, that would be the case. But the product we’re pushing for is something Murdock helped with, by testing it before. I want him to be aware of the cost, the productivity rate, the usage doses, so that he can-”</span>\n</p>\n<p>\n<span>“Give us an honest review as a customer and someone who can be biased against us,” he agreed, fingers flying over the keyboard again. “Makes sense.”</span>\n</p>\n<p>\n<span>He finally sent off the e-mail, cheeks blossoming in a blush at the shocked expressions of everyone around him. He knew that - although he hadn’t cornered him - Mr Harrington had doubted him about the internship, but it was still embarrassing to see how impressed his teacher was of him.</span>\n</p>\n<p>\n<span>“Thank you, Pete, go take a seat,” finally said the CEO, turning her attention to the students once more. “The behaviour you’ve just seen from Peter? That is one of secrets of the trade, one of the reasons someone as young as me was able to go from ‘the redhead in Legal’ to the CEO of one of the biggest companies in the world. My name is Virginia Potts, and, on behalf of Stark Industries, I’d like to welcome you again to Stark Tower.”</span>\n</p>\n<p>\n<span>“That was so </span>\n<em>\n<span>cool</span>\n</em>\n<span>,” immediately whispered Ned, once Peter was sat next to him again.</span>\n</p>\n<p>\n<span>Part of Peter was still a little embarrassed at the open attention, but another was proud of finally being able to show what working with Tony and Pepper had taught him. “Yeah?”</span>\n</p>\n<p>\n<span>MJ momentarily turned to him. “You were cool, Loser.”</span>\n</p>\n<p>\n<span>Peter beamed.</span>\n</p>\n<p>\n<span>The cafeteria in the Tower was not somewhere Peter enjoyed spending time in. At the beginning it was such a vicious attack on his senses that Peter had nearly had a panic attack when he stepped in the first time.</span>\n</p>\n<p>\n<span>When Tony had found out, he had first apologised profusely (even though he had nothing to apologise for) and then built a frequence in the walls; it was a small humming noise that Peter could focus on when he felt his sense being attacked, and worked like a charm in keeping the nausea at bay.</span>\n</p>\n<p>\n<span>Still, Peter preferred eating out in the various shops around the tower, or even in one of the residential floors.</span>\n</p>\n<p>\n<span>The lunches were free for everyone on the field trip, and within moments everyone was already lined up, waiting to be served. </span>\n</p>\n<p>\n<span>Peter made to follow when a sudden voice called out his name and made his eye twitch.</span>\n</p>\n<p>\n<span>“Peter, </span>\n<em>\n<span>sweetheart</span>\n</em>\n<span>!” crowed James Buchanan “Bucky” Barnes, opening the door and marching inside.</span>\n</p>\n<p>\n<span>Peter sighed, turned around and then nearly cried.</span>\n</p>\n<p>\n<span>Because the fearsome Winter Soldier, longest held POW, the Fist of Hydra and accomplished and untraceable assassin was walking across the cafeteria in a frilly pink apron with the words ‘</span>\n<em>\n<span>the fucker in charge of feeding you fuckers</span>\n</em>\n<span>’ neatly printed on in silver, hair in a manbun, a bunny water bottle and an iron man lunch box in his hands. </span>\n</p>\n<p>\n<span>He even had the </span>\n<em>\n<span>audacity</span>\n</em>\n<span> of pretending to be embarrassed at the sight of his friend. “Oh, your little friends are here? How lovely!”</span>\n</p>\n<p>\n<span>His classmates were just staring at James in utter confusion, since the metal arm screamed Winter Soldier but the rest of the ensemble was more ‘frazzled soccer mom’. </span>\n</p>\n<p>\n<span>“You </span>\n<em>\n<span>asshole</span>\n</em>\n<span>,” he hissed, once the man stopped in front of him with an smile.</span>\n</p>\n<p>\n<span>“Oh my baby, don’t make me come after you with soap, now!” he chided. Then he handed him the bottle and the food. “Come now, you forgot your lunch this morning.” He turned to Ned and Sarah who were standing next to them watching in shock. “You shoulda seen him this morning! All in a rush to come school, came downstairs looking like a disgruntled little kitten-”</span>\n</p>\n<p>\n<span>“Thank you James, bye James!” nearly shouted Peter, snatching the items from his hands and pushing himself and the man away from the line. “You shouldn’t have!”</span>\n</p>\n<p>\n<span>James let himself be pushed, still grinning at Peter. “I wanted to.”</span>\n</p>\n<p>\n<span>Peter let his eyes narrow once they got to the door. “You </span>\n<em>\n<span>really </span>\n</em>\n<span>shouldn’t have.”</span>\n</p>\n<p>\n<span>The fake smile dropped for a shit eating grin. “I </span>\n<em>\n<span>really </span>\n</em>\n<span>wanted to.”</span>\n</p>\n<p>\n<span>The teen sighed, pushing him out of the door and shouting “Prick!”, after him.</span>\n</p>\n<p>\n<span>“Ass!” came the prompt reply before the door closed.</span>\n</p>\n<p>\n<span>Then the teen dropped to his seat, cheeks red beyond measure. And when he opened the lunch box, he tried very valiantly to find </span>\n<em>\n<span>one </span>\n</em>\n<span>reason not to stab himself in the eye at the sight of almost child sized cutlery and a somewhat well assembled spiderman </span>\n<a href=\"https://ivinuvunk.files.wordpress.com/2013/04/image6.jpg\" rel=\"nofollow\">\n<span>bento</span>\n</a>\n<span>. </span>\n</p>\n<p>\n<span>He ignored the chatter from his classmates (“</span>\n<em>\n<span>Was that </span>\n</em>\n<span>the </span>\n<em>\n<span>Winter Soldier?” “The Winter Soldier knows Peter Parker?!” “He did say he did an internship here, recall?” “Yeah but I thought like Flash that he was faking!” “I told you that the driver that picks Peter up sometimes was familiar!”)</span>\n</em>\n<span> grabbing some cutlery from the side.</span>\n</p>\n<p>\n<span>Before he could return to his seat, Flash stopped in front of him, glaring daggers at Peter. “How the </span>\n<em>\n<span>fuck </span>\n</em>\n<span>do you know the Winter Soldier?! Did he save you from something?”</span>\n</p>\n<p>\n<span>Peter was honestly growing tired of the man’s pestering. “I told you, I’m Mr Stark’s intern. I work with him a lot, so I see the Avengers pretty often, I even help repair their gear.”</span>\n</p>\n<p>\n<span>The bully scoffed. “I’ll admit that you might work here in Stark Tower and that Ms Potts clearly knows you, but there is no way </span>\n<em>\n<span>you </span>\n</em>\n<span>work with the Avengers. Admit it, he saved you from falling on your ass at some point and you guys became… friendly.” </span>\n</p>\n<p>\n<span>It was fascinating, honestly, seeing a guy as smart as Flash hating the truth in front of him so much that he created a new delusion that he decided to buy into instead. </span>\n</p>\n<p>\n<span>“You’re ridiculous,” he told him, side stepping him and shrugging him off when the man tried to grab him again.</span>\n</p>\n<p>\n<span>“You’re a fraud, Parker!”</span>\n</p>\n<p>\n<span>MJ had found herself a seat next to Peter, and she shook her head as the brunet slipped in his own. “He doesn’t give up, does he?”</span>\n</p>\n<p>\n<span>Peter nodded, starting on his lunch (</span>\n<em>\n<span>What? James might be an utter ass, but he was a good damn cook</span>\n</em>\n<span>). Then he looked at her curiously. “You believed me from the beginning. Even when we weren’t that close.”</span>\n</p>\n<p>\n<span>MJ stabbed her salad with a shrug. “I observe. I watch everyone and I see things. You might hide things, but you don’t lie. Not real lies.”</span>\n</p>\n<p>\n<span>The boy smiled, cheeks pinking, as Ned jumped next to him with his own lunch. “Dude, holy shit! The Winter Soldier brought you lunch! What the hell is your life, even, Peter? That was so cool, and you two were basically bantering like friends! Are you two close? Wait, you said that the Princess that definitely </span>\n<em>\n<span>didn’t </span>\n</em>\n<span>harbor him in her country before Mr Stark pushed for his pardon showed you the schematics for his arm, do you help fix it?”</span>\n</p>\n<p>\n<span>“Not yet,” said Peter with a sigh. “But To- Mr Stark lets me come in the workshop and he lets me help with the fixing because both James and Winter like me well enough. Well, they like Mr Stark too, but he’s too much of-”</span>\n</p>\n<p>\n<span>The door opened again, and a very familiar scent of baked goods filled in the air.</span>\n</p>\n<p>\n<span>He heard the gasps from everyone around him and immediately pointed an accusing finger at the two people walking inside.</span>\n</p>\n<p>\n<span>“Hey, Pete,” grinned Rhodey, winking at the boy and stopping next to him. “What a surprise seeing you here!”</span>\n</p>\n<p>\n<span>“Really, Uncle Jim?” he questioned, narrowing his eyes at the man. Then he pointed at the man behind him. “I can’t believe <em>you</em>.”</span>\n</p>\n<p>\n<span>Loki didn’t look impressed, handing him a phone. “I was on the You Tube and I lost the video I was looking at. But I wasn’t logged in, so I can no longer find it. I will allow you to help me.”</span>\n</p>\n<p>\n<span>“What an honor,” said Peter, then eyed the two tupperwares in Rhodey’s hands distrustful. “What’s in that?”</span>\n</p>\n<p>\n<span>“Why, I am so glad you asked!” immediately said Rhodey, because despite what many might say, James Rhodes was a little shit and was less an enabler and more an active part in Tony’s disasters. “See, I just happened to be baking-”</span>\n</p>\n<p>\n<span>“Really.”</span>\n</p>\n<p>\n<span>“Hush, little brat. I was just baking for the Science team, but there was an accident in one of the labs - before you ask, yes, Goff - and it’s being decontaminated. Which means I have loads of cookies and no one to give it to, so I thought, ‘Hey, Peter is coming here with his class isn’t he? I’m sure they’d love some </span>\n<em>\n<span>War Machine </span>\n</em>\n<span>cookies made my moi!’.” He turned to the class. “Isn’t that right?”</span>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>Yes!” “Holy shit, War Machine looked at me!” “Thank you so much, Colonel Rhodes!”</span>\n</em>\n</p>\n<p>\n<span>The man turned his smug grin back on Peter, and the teen just rolled his eyes. He couldn’t prove it, but he really wouldn’t put it past his uncle to be the reason of the botched experiment - even though Tom Goff had an history of blowing shit up </span>\n<em>\n<span>all the time</span>\n</em>\n<span>. </span>\n</p>\n<p>\n<span>Loki took one of tupperwares from Rhodey’s hands and sat down next to Ned, who promptly squealed in shock. The green eyed mage quirked an amused eyebrow. “Well, hello, Midgard child.”</span>\n</p>\n<p>\n<span>“That’s my friend, Ned,” explained Peter, trying to find the video Loki had ‘lost’. “And this is MJ.”</span>\n</p>\n<p>\n<span>Loki’s eyes turned immediately on MJ. “Oh, </span>\n<em>\n<span>this </span>\n</em>\n<span>is MJ? Hello, MJ and Ned.”</span>\n</p>\n<p>\n<span>Peter didn’t look up from the phone but still kicked at Loki’s shin, hard. To his credit, Loki’s face didn’t even change, even though Peter packed a kick that was more painful than most humans.</span>\n</p>\n<p>\n<span>MJ turned to Loki, tilting her head to the side. “Peter speaks of me?”</span>\n</p>\n<p>\n<span>The brunet kicked Loki again, and the god just shrugged. “Mostly to Anthony. We are interested in weird and bizzare, and you, according to the dear one, are plenty weird and bizzare.”</span>\n</p>\n<p>\n<span>If Peter expected MJ to be annoyed by the words, he was disappointed. The girl actually blushed a little, sending Peter a smile. “Oh? </span>\n<em>\n<span>Thank </span>\n</em>\n<span>you.”</span>\n</p>\n<p>\n<span>Peter gave her a little smile back. “Uh… yeah. Eh. No problem.” When Loki’s grin widened, he clicked the link he found and handed the phone back to the man. “Here’s your video. Now you can go.”</span>\n</p>\n<p>\n<span>“The youth, nowadays,” he sniffed, even as he stood up. Rhodey was waving at the rest of the student, an empty tupperwear in his hands.</span>\n</p>\n<p>\n<span>Peter glared at his sort-of-uncle. “What about me? Where are my cookies?”</span>\n</p>\n<p>\n<span>Loki snapped his fingers together, and even MJ was impressed when three cookies appeared in front of the trio. Then of course he had to ruin it by pressing a kiss on Peter’s head. “See you later, dear one. And thank you.”</span>\n</p>\n<p>\n<span>“Hey!”</span>\n</p>\n<p>\n<span>“Yes,” agreed Rhodey, smacking a kiss on the boy’s forehead when he was distracted, and laughing at his disgruntled expression. “Bye bye, Peanut!”</span>\n</p>\n<p>\n<span>“I hate you!” he shouted back.</span>\n</p>\n<p>\n<span>Neither of them turned around, Rhodey calling out a, “However shall I go on now?”, as they left.</span>\n</p>\n<p>\n<span>Unappeased, Peter blocked out his classmates again, biting into the cookie.</span>\n</p>\n<p>\n<span>At least it was good.</span>\n</p>\n<p>\n<span>After lunch, they went around some of the Science labs, but it was quicker than before.</span>\n</p>\n<p>\n<span>“Do you think we’ll see Bruce Banner?” asked Ned, elbowing Peter in the stomach. “He’s like… one of my heroes, I really want to meet him one day.”</span>\n</p>\n<p>\n<span>His best friend shrugged. “I have honestly 0 idea. He has labs here, but he mostly spends time at the Avenger’s Compound, because it’s easier for Thor to go to the Compound than it is to come here.”</span>\n</p>\n<p>\n<span>The whole Thor/Bruce situation was particularly amusing to Peter. In a way, it made sense: the two strongest Avengers - or, better, two of the strongest Avengers. But it also, really didn’t; Bruce was a man of piece and quiet, whereas Thor had grown up with </span>\n<em>\n<span>Loki. </span>\n</em>\n<span>In </span>\n<em>\n<span>Asgard</span>\n</em>\n<span>. He </span>\n<em>\n<span>thrived </span>\n</em>\n<span>in chaos, and screaming and fighting.</span>\n</p>\n<p>\n<span>Peter wondered if Hulk liked Thor in the way Bruce liked Thor. Because Hulk was, technically, Bruce Banner’s alter ego, right? How did people with Dissociative Identity Disorder deal with relationships? Was it ethical to date only one part of someone? And what about people with personalities that were younger? </span>\n</p>\n<p>\n<span>“Alright,” called Elena, clapping her hands to get their attention. “Unfortunately we cannot access the chemistry lab because of an accident,” </span>\n<em>\n<span>Tom</span>\n</em>\n<span>, “so we will head to the R&amp;D main lab instead.</span>\n</p>\n<p>\n<span>“I know I’ve already told you guys to keep your phones to yourselves and all, but I must remind you yet again. </span>\n<em>\n<span>Stark Industries </span>\n</em>\n<span>is, nowadays known for how advanced our technologies are. So, when you enter this lab, you must abide by the rules of the room. Hands to yourself, ask before touching anything, and </span>\n<em>\n<span>listen </span>\n</em>\n<span>to the interns and scientists around.</span>\n</p>\n<p>\n<span>“Everyone knows that R&amp;D are Dr Stark’s favourite children,” the students laughed a little at the joke that wasn't quite a joke. “And they’ve learned a lot from him; this means that they don’t give second chances, if you’re distracting or creating trouble you </span>\n<em>\n<span>will be </span>\n</em>\n<span>kicked out. They have an absolute 0 tolerance attitude in there.” When she saw the worried expression on the students - and even Mr Harrington’s - faces, she softened her tone a little. “As long as you listen to what’s being said, there shouldn’t be any problems.”</span>\n</p>\n<p>\n<span>Even Flash was quiet as they all walked inside the third main lab where five other scientists were already present. The main lab was where most of the SI stuff took place. Anything pertaining the Avengers - both before and after Accords - took place in Tony’s lab. The man had actually cleared out a lab for Peter, but he still felt somewhat uncomfortable working alone, and since he didn’t look annoyed at Peter working in the room with him more often than not, Peter spent most of his time there.</span>\n</p>\n<p>\n<span>That didn’t mean that he didn’t spend time with the R&amp;D people, though.</span>\n</p>\n<p>\n<span>“Peter!” called out a tall hispanic man, grinning brightly when he spotted him at the back of the group. “The hell you doing here? Tony lending you to us for the day?”</span>\n</p>\n<p>\n<span>The teen ignored the loud whispers of ‘</span>\n<em>\n<span>even they know Peter’</span>\n</em>\n<span> and ‘</span>\n<em>\n<span>oh my god, Tony Stark actually works with Peter?!’</span>\n</em>\n<span> and smiled, a little uncomfortable. “No, Leo, this is my class. School trip?”</span>\n</p>\n<p>\n<span>A red headed girl next to him blinked at Peter. “Holy shit, I forgot you’re a kid. Hey, you didn’t hear anything about the BEDG (Bachelor Extraordinaire Drinking Game), right? You didin’t sign up?”</span>\n</p>\n<p>\n<span>Now it was Peter staring at them suspiciously. “What’s the BEDG?”</span>\n</p>\n<p>\n<span>“What? Uh? Who said that?” questioned the red head immediately, fluttering her lashes.</span>\n</p>\n<p>\n<span>Elena cleared her throat a little, and all scientist turned their attention back on the rest of the students - who were watching Peter like he was someone they had never seen before. </span>\n</p>\n<p>\n<span>A tall Muslim woman stood taller, smiling slightly uncomfortably at the students. “Well, hello Midtown High?” At the teacher’s nod, she continued. “My name is Dr Aminah Towfeek and I’m one of the lead scientists in my division. I have worked in the company for about 6 years now, straight out of university.” The students looked at her in awe, and her smile became less rigid. “I know, when I got the a call like a week after filling my application I genuinely thought I was being punked. </span>\n</p>\n<p>\n<span>“Anyway, these are my collagues: Dr Leo Andes, who had been working here for a whooping 13 years - one of the few to survive the purge of ‘08,” the man who had been talking to Peter earlier waved, “Ms Jen Rolland, a 3 years intern who’s working on her doctorate and has a spot open right here when she graduates,” the red headed girl waved, smiling brightly, “Mr Olliver McVeith, 7 years working here, has been my mentor since I started and who I wouldn’t have survived without,” a short man with glasses and dark hair snorted at her presentation, “and Dr Amanda Ngozie, only been here for 2 years but has been rising to the top at an amazing rate.”, the last scientist, a dark skinned woman grinned, sending Aminah a kiss. </span>\n</p>\n<p>\n<span>Aminah sent a kiss back and turned her attention back towards the students. “The lead and senior scientists all have their own labs and workshop spaces; however, the main labs are places where teams can come and work together on projects without having to go from lab to lab.”</span>\n</p>\n<p>\n<span>Then she continued with an history of the R&amp;D department, letting Leo take over the parts she wasn’t sure about, and allowing the rest to chime in when they saw fit.</span>\n</p>\n<p>\n<span>“You will have a chance to ask questions but,” and here Aminah smiled, a sinister smile that had Peter narrowing her eyes at her in suspicion. “It’s time we tell you a few rules about being in the lab. And, here at R&amp;D, we have a little tradition-”</span>\n</p>\n<p>\n<span>Peter groaned, slapping a hand over his face loudly enough that some of the students turned to frown at him. Aminah, who had caught his dismay, smiled like a shark. “Oh, I see our little one has figured out what’s going on. Great! You see, our tradition is, the last person who has been hired is always in charge of explaining the rules to our new hires. And since Amanda was the one who explained to Mini Boss over there…” she trailed off, and turned to Mr Harrington. “Would that be all right?”</span>\n</p>\n<p>\n<span>The teacher - treason and betrayal - immediately nodded, something akin pride on his face as he regarded Peter again. “Sure! Go ahead, Peter!”</span>\n</p>\n<p>\n<span>It was mostly the thought of making one of his favourite teachers proud - even though they didn’t believe him fully, at the beginning - that finally convinced Peter to push one feet after the other forward until he was standing between Leo and Aminah.</span>\n</p>\n<p>\n<span>His classmates were looking at him with wide eyes, and Peter breathed a couple of times to settle his nerves before starting to talk.</span>\n</p>\n<p>\n<span>Once he started, it was easy. The rules - aptly named ‘<em>R</em></span>\n<em>\n<span>espectable Conduct To Avoid The Ire Of Legal and PR’</span>\n</em>\n<span> - were stuck and laminated on the walls of every lab, and after hearing them shouted at one scientist or another during the 13 months he had been interning with Mr Stark, they were unforgettable.</span>\n</p>\n<p>\n<span>But when he finished, Amanda was grinning at him, a dangerous twinkle in her eyes (</span>\n<em>\n<span>Tony could say that scientists were all very eccentric by nature all he wanted, but he had a terrible habit of getting people who were batshit crazy working with him</span>\n</em>\n<span>). </span>\n</p>\n<p>\n<span>“Actually, there is one new rule,” she continued, winking at him, “that we added </span>\n<em>\n<span>specifically </span>\n</em>\n<span>because of you.”</span>\n</p>\n<p>\n<span>Flash jumped on it like a shark smelling blood. “Peter caused trouble, uh?”</span>\n</p>\n<p>\n<span>The woman, missing the sarcasm, snorted. “Of course! If he didn’t cause trouble, he couldn’t be here! After all, all of our rules are literally responses to someone, pardon my language, fucking up.” Flash’s mouth turned like he tasted something bitter, and Amanda continued, oblivious. “The rule is: </span>\n<em>\n<span>‘Never bring something from another lab without telling </span>\n</em>\n<b>\n<em>everyone </em>\n</b>\n<em>\n<span>that you’ve done so and explaining to them what you brought</span>\n</em>\n<span>’.”</span>\n</p>\n<p>\n<span>“Oh!” gasped Peter, flushing a little, while Amanda snorted.</span>\n</p>\n<p>\n<span>“Right, ‘oh’,” she turned back to the curios high schoolers. “You see, about three months ago, our dear Peter here, was working with Dr Stark and Spiderman on Spiderman’s webshooters,” she explained, ignoring the gasps at the name dropping. “And then there was a whole thing involving squid ink and a cleaning bot - but anyway, Peter came to borrow one of our old schematics to cross reference with his own work. Unbeknown to us, Peter had brought with him the web fluid he was still working with and just dropped it on the table and promptly forgot about it for like an hour.</span>\n</p>\n<p>\n<span>“The thing about us scientists, especially here in R&amp;D, is that we have absolutely 0 self preservation instincts. If we see something new and weird in the lab, we </span>\n<em>\n<span>will </span>\n</em>\n<span>poke and touch until it goes <em>boom</em>. If you put a red button with a big ‘do not touch’ sign on it but no explanation as to what is gonna happen if you </span>\n<em>\n<span>do </span>\n</em>\n<span>touch it in here… we’re gonna touch it.” Aminah, Leo, Oliver and Jen all nodded very solemnly, like she was quoting the bible or something. “Which meant that, when Peter realised he had forgotten the web fluid almost an hour later and showed up? It was </span>\n<em>\n<span>everywhere</span>\n</em>\n<span>. My hands were stuck together, Aminah’s head scarf was stuck on the wall, Leo was basically one with his table, some scientists that aren’t here today were stuck together… it was a mess.”</span>\n</p>\n<p>\n<span>Peter, who had been embarrassed at the beginning, managed a small smirk. “I have blackmail material to last a lifetime,” he joked.</span>\n</p>\n<p>\n<span>Amanda smirked back. “Hey, FRIDAY, do you remember Fire Eyebrowgate -”</span>\n</p>\n<p>\n<span>“Nevermind, I love you Amanda and you’re the best person ever and I would </span>\n<em>\n<span>never </span>\n</em>\n<span>blackmail you!” he rushed to say, smacking a hand on the older girl’s mouth. See? Scientists were all deranged and </span>\n<em>\n<span>evil</span>\n</em>\n<span>.</span>\n</p>\n<p>\n<span>“Now that we are done with the rules,” said Jen, shifting the attention onto herself. “I’m sure you must be wondering what we’re gonna be doing here. We will be diving in six different groups, and each group will be working on an easy and already started project. According to your teacher you’re all the best of the best, so I’m sure you’re going to breeze through it, especially since you’re Peter’s classmates.” The compliment made the teen blush again - seriously, he was starting to worry that his cheeks were never going to return their normal colour again - and he kept his eyes on his shoes. “It’s exactly 24 students here today, right? Now, each of you grab a table.”</span>\n</p>\n<p>\n<span>MJ, Ned and him immediately grabbed one of the tables, Ned and Peter high fiving at the opportunity to work together. Then promptly grimacing when Flash decided to sit next to them.</span>\n</p>\n<p>\n<span>MJ gave him a look and shook her head, while Ned glared. “Seriously?”</span>\n</p>\n<p>\n<span>Flash ignored him, his attention on Peter. “Fine. You have an Internship at <em>Stark Industries</em>. We get it. That doesn’t make you special, Penis, nor does it make you smarter than me. You’re just-”</span>\n</p>\n<p>\n<span>“In front of you,” said Aminah, and everyone’s attention was on her again. “Is the description of the experiment you’ll be conducting. Each of us will work with one group, but the experiment will all be you.”</span>\n</p>\n<p>\n<span>Mr Harrington frowned, checking the tables. “Uh, sorry Doctor Towfeek, but there are six tables and five of you. How will you -”</span>\n</p>\n<p>\n<span>“I’m sorry, am I late?” drawled a voice, and Peter found himself rolling his eyes even as everyone around him gasped and shrieked in shock.</span>\n</p>\n<p>\n<span>Black three piece suit, blood red tie, orange tinted sunglasses and shoes that costed probably as much as the bus that drove them there, Tony Fucking Stark swaggered inside the lab.</span>\n</p>\n<p>\n<span>Even though he had known him for about 13 months, even Peter was aware that the Tony Stark Post Afghanistan but Pre Avengers was a very different man from the Tony Stark Post Avengers - aka the Tony Stark he met. </span>\n</p>\n<p>\n<span>It had taken a while for him to finally meet Tony Fucking Stark. The Tony Stark who hacked governments in court and successfully privatised world peace had returned in stages after the Accords were ratified and fixed up, and it took a while for people to realise he was back. It took him kicking Thaddeus ‘Thunderbolt’ Ross in prison and basically taking over the Accords discussion for people to see him and be beside themselves with joy and happiness.</span>\n</p>\n<p>\n<span>The reaction was surprising to no one except Tony himself. It took Christine Evenheart making a piece in which she said that finally Tony had ‘stopped being a doormat and cleaning after people who thought themselves too good to explain themselves to the media and the world’ for him to realise that Tony Fucking Stark was not another way of saying ‘Merchant of Death’; and so, he had embraced it.</span>\n</p>\n<p>\n<span>However, Tony Fucking Stark had one terrible flaw.</span>\n</p>\n<p>\n<span>He was a dramatic bitch.</span>\n</p>\n<p>\n<span>He stopped in the middle of the room and then pulled off his sunglasses, eyeing the classroom with a single raised brow. “There are a lot of children, here, Aminah.”</span>\n</p>\n<p>\n<span>The lead scientist rolled her eyes a little, but played along. “School trip. Midtown High.”</span>\n</p>\n<p>\n<span>Tony smiled at Aminah as Mr Harrington moved forward. “It’s a pleasure to meet you, Dr Stark. I’m Mr Harrington, and I wanted to thank-”</span>\n</p>\n<p>\n<span>“Oh, you’re Mr Harrington!” stopped him Tony, smiling and extending his hand. “Peter told me you’re one of the reasons why he loves science and robotics so much. You ‘inspired’ him, or something.”</span>\n</p>\n<p>\n<span>The teacher looked like those words were going to make him cry, and the brunet swiftly let go of his hand.</span>\n</p>\n<p>\n<span>Tony looked around again until he found Peter - who was half hidden under the table, desperately whispering at FRIDAY to open fire because Tony was a </span>\n<em>\n<span>threat</span>\n</em>\n<span> to Peter - and smirked. “Oh, I see. It’s Peter’s People and his Tiny Friends. I guess I’ll go help them.”</span>\n</p>\n<p>\n<span>Peter could hear Betty and other students complaining about how </span>\n<em>\n<span>lucky </span>\n</em>\n<span>Peter was, and wanted more than anything to switch with her. But he knew Tony would simply follow him to the other group and that wasn’t worth the humiliation.</span>\n</p>\n<p>\n<span>“Hello, Pete-Pie. Whatcha making?” asked Tony, dropping on the seat next to him and patting his head.</span>\n</p>\n<p>\n<span>“A light tracking bot,” immediately answered Flash, staring at the man with wide eyes. “Hello, Mr Dr Stark sir, my name is-”</span>\n</p>\n<p>\n<span>“That’s boring,” cut him off Tony, barely sparing a glance at Flash’s hand, too busy watching the schematics. He put down his Starkphone and pulled up a projection, “Let’s do something fun.”</span>\n</p>\n<p>\n<span>“Tony no,” immediately said Peter, taking the phone from the man and ignoring Flash and Ned’s gasps. “Whenever you say that something explodes.”</span>\n</p>\n<p>\n<span>Tony’s eyes were twinkling with the same mischief Amanda’s were earlier. “Exactly, what’s more fun than something going boom?”</span>\n</p>\n<p>\n<span>“Having eyebrows,” answered Peter, very seriously. Fire Eyebrowgate was still a touchy subject. “We’re gonna do the light bot thing.”</span>\n</p>\n<p>\n<span>The older man pouted, crossing his arms together. “You’re no fun, kid. I was going to teach you how to detonate a bomb with nothing but a pencil-”</span>\n</p>\n<p>\n<span>“I’ll call Pepper,” threatened the boy, and immediately Tony glared at him.</span>\n</p>\n<p>\n<span>“Harley would indulge me,” he grumbled.</span>\n</p>\n<p>\n<span>“Harley is a sociopath,” counter-argued Peter, a raised brow.</span>\n</p>\n<p>\n<span>“The true mark of a scientist,” added MJ, already working on the robot.</span>\n</p>\n<p>\n<span>Tony’s eyes glinted. “Oh I like you. Are you MJ? Please be MJ.”</span>\n</p>\n<p>\n<span>The girl glanced at Peter, then nodded. “Yeah. Nice to meet you, Dr Stark.”</span>\n</p>\n<p>\n<span>“And I’m Fl-”</span>\n</p>\n<p>\n<span>“It’s my pleasure, MJ,” answered Tony, smiling and pointedly ignoring the ‘subtle’ nudges Peter was giving him. “Hey, did you know that once Peter-”</span>\n</p>\n<p>\n<span>“I changed my mind, let’s do whatever you wanted to do, Mr Stark! This is so boring!”</span>\n</p>\n<p>\n<span>Tony grinned.</span>\n</p>\n<p>\n<span>The <em>sociopath</em>.</span>\n</p>\n<p>\n<span>An hour and three small scale explosions later - Jen’s group had managed to explode a water based robot, which ??? - Tony and Elena were guiding the class outside again.</span>\n</p>\n<p>\n<span>Even though he had joked about making them defuse a bomb, Tony had ended up making them work on one of the various prosthetic projects he had going on. It was something simple, connecting fingers to the palm and making sure the could still move after being connected, and it shouldn’t have exploded; but Flash had taken it upon himself to improve the finger he was working on.</span>\n</p>\n<p>\n<span>See, the thing with Flash was that he was smart. He was very smart, easily top 5 in their class and top 10 in the school; but most of the time his competitiveness won over any intelligence and common sense he had.</span>\n</p>\n<p>\n<span>He wanted to prove that he could improve the fingers so bad that he forgot that there were </span>\n<em>\n<span>four other fingers </span>\n</em>\n<span>that the others were working on. Result? When all fingers were attached and the device was turned on for a test, the connection between that finger and the rest of the hand got corrupted, making it explode.</span>\n</p>\n<p>\n<span>Tony hadn’t been too upset by it, at least. </span>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>I know what you were trying to do, but. Improving stuff has to be done during theory or during early testing; you can’t improve something without telling other people what you’re doing because then you end up with one good thing trying to work in a subpar environment, and then, usually, the good thing crashes and gets ruined more easily. Remember that, all right?</span>\n</em>\n<span>”</span>\n</p>\n<p>\n<span>Flash had looked like he had been given a gold bar or some candy, and had beamed, immensely happy.</span>\n</p>\n<p>\n<span>Peter had been happy for him, thinking that now, with those words in his heart, Flash would turn a new leaf and become some sort of new person.</span>\n</p>\n<p>\n<span>Of course that wasn’t the case.</span>\n</p>\n<p>\n<span>“See, Parker?” whispered Flash, walking side by side with him. “You’re not special or anything, you’re just lucky. But now that Mr Stark has seen that you’re not the only smart kid around and that I’m smarter, he’s going to drop you and pick me instead. Everyone knows Tony Stark only likes the best of the best.”</span>\n</p>\n<p>\n<span>It stung a little, even though Peter knew better. “You do realise that you improving that finger meant you </span>\n<em>\n<span>failed </span>\n</em>\n<span>the experiment?”</span>\n</p>\n<p>\n<span>The other teen bristled, glaring. “He gave me feedback </span>\n<em>\n<span>personally</span>\n</em>\n<span>. All he did was mock you; he didn’t even check what </span>\n<em>\n<span>you </span>\n</em>\n<span>were doing, instead he kept his attention on me the most!”</span>\n</p>\n<p>\n<span>Peter raised a patented Tony Stark (trademark pending) level eyebrow. “You do realise that him having to check your work over and over is… </span>\n<em>\n<span>not</span>\n</em>\n<span> a good thing? It means that you need more attention than everyone else and -”</span>\n</p>\n<p>\n<span>Before he could even finish his sentence, Peter tripped forward, a hard shove sending him on the floor, head hitting the cool tiles of the hallway, </span>\n<em>\n<span>hard</span>\n</em>\n<span>.</span>\n</p>\n<p>\n<span>“Oh shit, Peter!” called Ned, while the teen grimaced in pain.</span>\n</p>\n<p>\n<span>Enhancing, he had learned, didn’t mean pain didn’t hurt. It meant pain stopped earlier, but hurt still hurt.</span>\n</p>\n<p>\n<span>“Peter!” came Tony’s voice, and almost immediately he felt the older man kneeling beside him and helping pulling him up. “Kid, are you okay? What happened?”</span>\n</p>\n<p>\n<span>Peter sat back up, tongue going over his split lip. At least nothing else was broken, he thought, eyes passing over a slightly pale and nervous looking Flash before he sighed. “I tripped.”</span>\n</p>\n<p>\n<span>Tony’s eyes were confused. “</span>\n<em>\n<span>You</span>\n</em>\n<span>? Tripped?”</span>\n</p>\n<p>\n<span>“Peter, are you okay?” called Mr Harrington, moving closer.</span>\n</p>\n<p>\n<span>Tony’s eyes met Peter’s and then the older man turned to Elena. “Right, everyone just follow Elena to wherever you’re going next, Peter and I will catch up.”</span>\n</p>\n<p>\n<span>Once everyone was gone, Tony turned his eyes to Peter. “Now, what the hell happen? You don’t just </span>\n<em>\n<span>trip </span>\n</em>\n<span>in the hallway.”</span>\n</p>\n<p>\n<span>The younger boy tried to avoid his eyes, fighting to find something anything to say -</span>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>The student by the name Flash Thompson, put a foot in front of Peter and then shoved him down while they were walking,</span>\n</em>\n<span>” came FRIDAY’s voice suddenly and holy </span>\n<em>\n<span>shit</span>\n</em>\n<span>, Peter had forgotten that FRIDAY was everywhere in the tower. “</span>\n<em>\n<span>May I add, this is after mocking him about the Internship throughout the day, calling him names and being very rude to Mini Boss. He even dared to say that he is smarter than Peter and that you, Boss, saw that today and would replace him. This speaks of a behaviour that is not unusual, since the students Ned and Michelle kept telling him to cut it out.</span>\n</em>\n<span>”</span>\n</p>\n<p>\n<span>Absolute silence.</span>\n</p>\n<p>\n<span>Peter run his tongue over his bloody lip, eyes downcast and refusing to make eye contact with Tony for about a full minute.</span>\n</p>\n<p>\n<span>Then the older man spoke. “Peter,” he said, voice very controlled that still made the teen flinch. “Are you being bullied by this… Flash person?”</span>\n</p>\n<p>\n<span>He swallowed. “Not really, I can take it and it’s not-”</span>\n</p>\n<p>\n<span>“Peter.” Tony’s tone was sharp, and Peter’s mouth closed automatically. “Is he harassing and/or bullying you. No excuses. Yes or no.”</span>\n</p>\n<p>\n<span>Peter wanted to lie so bad, but if there was </span>\n<em>\n<span>one </span>\n</em>\n<span>thing he had learned about Tony is that he did </span>\n<em>\n<span>not </span>\n</em>\n<span>tolerate liars. “... Yes.”</span>\n</p>\n<p>\n<span>A few more beats of silence.</span>\n</p>\n<p>\n<span>“Why didn’t you tell me?” It was the almost broken tone of voice that had Peter looking up. And immediately he wished he didn’t.</span>\n</p>\n<p>\n<span>Tony looked… not sad, not disappointed. But… </span>\n<em>\n<span>hurt</span>\n</em>\n<span>.</span>\n</p>\n<p>\n<span>“I know I’m just me and I’m not like your Aunt May or anything, but I would have helped you, kid. I know what it’s like to be too smart for your own good and stuck around people who just </span>\n<em>\n<span>don’t </span>\n</em>\n<span>understand you and decide that that’s basis to judge you. I wouldn’t have made fun of you or -”</span>\n</p>\n<p>\n<span>“God, no!” interrupted him Peter, putting both hands on his shoulders. “It’s not that I didn’t trust you or something! I haven’t even told Aunt May, the only people who know are the ones who go to school with me.” He ran a hand through his hair, a little frustrated. “It has nothing to do with you and everything to do with me. Flash… Flash is my responsibility. I have powers, I am stronger than the people in my school. As long as Flash keeps his attention on me, he’s not going after people who can’t take him and-”</span>\n</p>\n<p>\n<span>“Hell, no,” said Tony, eyes now alight again. Would Peter be a terrible person if he said he missed the hurt puppy look? “Peter Benjamin Parker, you’re not about to pull a ‘with great powers comes great responsibility’ about being </span>\n<em>\n<span>bullied</span>\n</em>\n<span>! I know you’re smarter than that!”</span>\n</p>\n<p>\n<span>“But dad-” He blanched at his own words, but Tony didn’t seem to notice. </span>\n</p>\n<p>\n<span>“Don’t ‘but dad’ me-” or maybe he did. “Uh. Did you. Did you just. Call me.”</span>\n</p>\n<p>\n<span>“No?”</span>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>Yes he did, Boss. Mini Boss called you ‘dad’. Shall I add this to your ‘Peter and Harley being my children yet again’ compilation?”</span>\n</em>\n</p>\n<p>\n<span>“WHAT.”</span>\n</p>\n<p>\n<span>Tony put a hand on his face. “Seriously, FRI?”</span>\n</p>\n<p>\n<span>Peter stared at him with wide eyes. “You think of me and Harley as your kids?” He was very much aware of the fact that Harley called Tony ‘Mechanic’, ‘Tony’ and ‘Dad’ without rule or thought, but he hadn’t realised that-</span>\n</p>\n<p>\n<span>Tony raised a brow - and here was the expression Peter had been trying to emulate earlier. “You think of me as you dad/father figure?”</span>\n</p>\n<p>\n<span>And well? Peter wasn’t going to lie, especially if there was the littlest chance Tony would let him get away with calling him ‘dad’ sometimes. “Yes.”</span>\n</p>\n<p>\n<span>Tony hid a smile as he stood up, pulling Peter along with him. “Good. Now let’s go before your teacher gets worried.”</span>\n</p>\n<p> </p>\n<p>\n<span>By the time they made it in one of the empty conference room, Peter was more or less sure Tony had forgotten about the Flash thing. He hoped. </span>\n</p>\n<p>\n<span>The rest of his class was sitting in a semicircle, talking to each other, and he ignored the jealous expressions some of the students were sporting when he walked in and rushed to the spot between Ned and MJ. He could feel Tony watching him as he did so, but the billionaire quickly looked away when Peter turned back to him.</span>\n</p>\n<p>\n<span>Instead he clapped his hands together - as if he hadn’t had everyone’s attention on him the </span>\n<em>\n<span>second </span>\n</em>\n<span>he walked into the room. “Alright! The surprise Ms Spike has spoken about this morning is a special Q&amp;A session.” He allowed the students to shriek in joy for a few seconds, before snapping his fingers together. “Just allow me to get some coffee and then we’ll get right into it. However,” and his voice went a little colder and his eyes settled exactly on Flash. “Remember that my AI is here. FRIDAY is </span>\n<em>\n<span>always </span>\n</em>\n<span>here, and she sees </span>\n<em>\n<span>and </span>\n</em>\n<span>hears </span>\n<em>\n<span>everything</span>\n</em>\n<span>. She doesn’t like bullies.”</span>\n</p>\n<p>\n<span>Flash paled considerably at the words, and Peter felt all his hopes that Tony had forgotten about Flash going out the window.</span>\n</p>\n<p>\n<span>“Was it just me or did it look like Dr Stark was lowkey threatening Flash?” whisper shouted Ned in his ear, as Mr Harrington approached Flash to speak to him.</span>\n</p>\n<p>\n<span>Peter rubbed a hand over his face. “Mr Stark has never done anything lowkey in his life,” he muttered, shaking his head slightly.</span>\n</p>\n<p>\n<span>“Hey, FRIDAY,” suddenly asked one of the students. “Does being an Artificial Intelligence mean that you know everything?”</span>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>No</span>\n</em>\n<span>,” answered the AI, still sounding robotic. “<em>I have an… awareness of most thing. But that awareness does not automatically mean I have an understanding of such thing. However, I am a learning AI, and Boss teaches me everything I need to know about humans and people</em>.”</span>\n</p>\n<p>\n<span>“What does that mean?” asked Betty.</span>\n</p>\n<p>\n<span>Peter found himself answering without thinking. “Ask her any mathematical question and she’ll give you the right answer each time. Give her a social situation and she wouldn’t be able to reason what went wrong or how to avoid it without being given several data that shows correct and proper conduct.”</span>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>Exactly, Mini Boss,</span>\n</em>\n<span>” agreed FRIDAY. “</span>\n<em>\n<span>For example, I know the concept of bullying and what it means. But unless I was given examples and explanations of what bullying could include, I wouldn’t be able to recognise it.” </span>\n</em>\n<span>A pause. “</span>\n<em>\n<span>Thankfully, I was given such and I </span>\n</em>\n<span>am </span>\n<em>\n<span>able to recognise it.”</span>\n</em>\n</p>\n<p>\n<span>Peter rolled his eyes a little, while Sebastian asked. “Why do you call Peter ‘Mini Boss’?”</span>\n</p>\n<p>\n<span>“That’s because Peter is basically Tony’s mini me,” answered a voice, and the entire class lost their shit when members of the <strike>New</strike> Avengers walked in. </span>\n</p>\n<p>\n<span>Even though they were all in civilian clothing, they cut a pretty powerful image. Peter had been there as most of them joined the ranks of the Avengers and he still was awed by them at times.</span>\n</p>\n<p>\n<span>They put down their chairs in a straight line opposite from the students before sitting down, Tony the last one to walk in with two chairs. He winked at the students. “What? Didn’t I say we were going to have a Q&amp;A?”</span>\n</p>\n<p>\n<span>When the chatter and shouts and “</span>\n<em>\n<span>oh my god, oh my god, oh my god</span>\n</em>\n<span>”, stopped, they started.</span>\n</p>\n<p>\n<span>“Hello Midtown, my name is Major Carol Danvers, I go by Captain Marvel and I am the co-leader of the Avengers.” Greeted the first woman, looking mildly surprised when the majority of the girls whistled and clapped in delight.</span>\n</p>\n<p>\n<span>“Hello again,” called Rhodes, smiling at Peter first and then the rest. “I am Colonel James “Jim” Rhodes. AKA War Machine - </span>\n<em>\n<span>not Iron Patriot</span>\n</em>\n<span>.” he added with a faux severe expression, earning some laughter from the students.</span>\n</p>\n<p>\n<span>“You may know me as famous neurosurgeon Doctor Stephen Strange,” greeted Stephen, giving them a nod. “Now I also am referred to as the Sorcerer Supreme and Master of the Mystic Arts.” Peter was quite sure the majority of the students did </span>\n<em>\n<span>not </span>\n</em>\n<span>know who he was, but they all pretended to anyway.</span>\n</p>\n<p>\n<span>“Hi,” called a dark haired woman. “My name is Hope Van Dyne, the Wasp and CEO of Pym. Nice to meet you.” MJ actually perked up at that, looking at the woman with almost stars in her eyes.</span>\n</p>\n<p>\n<span>“Loki Friggadottir.” The students stared, waiting expectantly. Loki raised a brow. “What more could you want?”</span>\n</p>\n<p>\n<span>“Brother,” chided Thor, before sitting straighter as he took in the class. “Greetings, Midgard children! I am Thor Odison, King of Asgard, God of Thunder, Brother of Loki and Avenger, one of Midgard’s Mightiest Heroes.” </span>\n</p>\n<p>\n<span>In the same exact tone, “And I am James Buchanan Barnes, Winter Soldier, reformed deadly assassin, cook extraordinaire and dastardly handsome.” Thor pouted at him, but James just grinned.</span>\n</p>\n<p>\n<span>“I am The Vision,” said the synthezoid next to him, with a polite smile. “Or, as Peter insists I present myself as, first name </span>\n<em>\n<span>The</span>\n</em>\n<span>, surname <em>Vision</em>.” Even MJ snorted at this, and Vision smiled at Peter, looking quite pleased with himself.</span>\n</p>\n<p>\n<span>Tony just pulled off his sunglasses. “You know who I am,” he said, and of course he got the loudest screams. After all there might be gods, aliens and enhanced around them but they were a science school; Tony Stark (and Bruce Banner) would always be their heroes. “As I - and Elena - have said before,” he continued, once they calmed down, “This surprise was conditional and reliant on your good behaviour during this trip. And, for the most part, you guys have all behaved pretty well.”</span>\n</p>\n<p>\n<span>Peter was expecting it, and was kind of aware that Tony would have told the rest of the Avengers what happened. Still, it was shocking when Loki, glared at Flash. “I might have an… </span>\n<em>\n<span>interesting </span>\n</em>\n<span>personality, but even I do not like bullies.”</span>\n</p>\n<p>\n<span>“It is most dishonourable,” added Thor, also scowling at him. “Picking on someone because they cannot defend themselves.”</span>\n</p>\n<p>\n<span>“Mr Harrington,” said Hope, turning to the teacher instead. “Both I and Tony are aware of what it’s like to be unable to truly reprimand a child because of fear of what the child’s powerful father’s reaction, and because of that we have agreed to match, both of us, whatever amount Mr Thompson is offering the school, out of our own pockets.”</span>\n</p>\n<p>\n<span>“I have also taken the liberty of sending the school footage of Mr Thompson Jr’s behaviour throughout this school trip against,” Tony’s eye went on Peter for a fraction of a second, “one of your students. FRIDAY has a </span>\n<em>\n<span>lot </span>\n</em>\n<span>of recording of his behaviour, some behaviour that you as a teacher should have noticed, but oh well.” The man cringed a little at the words, while Tony continued, implacable. “Of course, I will arrange a video conference with the principal and the father, to make sure that this behaviour is properly handled. But meanwhile,”</span>\n</p>\n<p>\n<span>Happy walked into the room, eyes immediately going on Flash, who honestly looked about to faint.</span>\n</p>\n<p>\n<span>“This is my head of security, who is going to escort Mr Thompson off my personal property and wait there for a guardian to come pick him up. And Mr Thompson,” Flash turned his terrified gaze on Tony, who’s face was now hard as stone. “It is not very heroic of me to threaten a child, so I will abstain from doing so. However. If I hear or find out that you have continued to harass Peter or any other student, I </span>\n<em>\n<span>will </span>\n</em>\n<span>make sure to have your name blacklisted from any university worth it’s name and any STEM related workplace. Your father might have pull, but you don’t mess with my ki- my intern or bully anyone else and get away with it, not if I can help it. Am I clear?”</span>\n</p>\n<p>\n<span>Flash nodded fear oozing from him and for a second Peter actually felt sorry for him. And even though he’d </span>\n<em>\n<span>never </span>\n</em>\n<span>tell Tony that, he was glad he had been found out. He could take care of himself, and he wasn’t a snitch, but knowing that Tony had his back - the </span>\n<em>\n<span>Avengers </span>\n</em>\n<span>had his back - was… nice. </span>\n</p>\n<p>\n<span>The atmosphere was a little tense after Happy, Flash and Ms Mortia - she was so small, Peter had genuinely forgotten Mr Harrington wasn’t the only teacher with them - walked out, but Thor smiled broadly at the students. “Well? Do you have any questions for us?”</span>\n</p>\n<p>\n<span>Almost every hand snapped up immediately.</span>\n</p>\n<p>\n<span>Elena selected the first student. </span>\n</p>\n<p>\n<span>“Hi, I’m Mark and my question is for The Vision!” The android seemed surprised at receiving the first question, and nodded. “No disrespect but uh… what are you?”</span>\n</p>\n<p>\n<span>Vision smiled, seemingly amused by the question. “Depends. Physically? I am a synthezoid who's body was created by a friend of Drs Stark and Banner, and my consciousness is a joint collaboration of the two doctors and Tony’s previous AI. I was given life, so to speak, thanks to Thor’s lightning.” He didn’t mention the mind stone since, NDA or not, it was not something they needed to know. “So to speak, I am a synthezoid with the same understanding of humanity that FRIDAY has, though I feel more emotion than she does.</span>\n</p>\n<p>\n<span>“Legally? According to my birth certificate I am the son of Tony Stark.” </span>\n</p>\n<p>\n<span>Tony smirked at the reaction that got. “To be honest, Bruce should be Vision’s other dad, but he ran out on us when Vision was just an infant.” He patted the android’s shoulder. “Poor little The Vision Edwin Stark-Banner.”</span>\n</p>\n<p>\n<span>Vision looked vaguely amused. “I have a middle name?”</span>\n</p>\n<p>\n<span>“Several, but we don’t want to go through all of them now, babyboy.”</span>\n</p>\n<p>\n<span>Idly, Peter wondered if that meant that he could refer to Vision as his step brother in his mind.</span>\n</p>\n<p>\n<span>Elena called up Betty, and the girl stood up. “Hi, my name is Betty. My question is for Ms Van Dyne and Ms Danvers. Before you guys came along, the original Avengers layup had 5 men and one woman. Then Dr Banner took a leave, and one woman and three men were added. But now, we are finally seeing some more women in the field, finally, though the two of you are the main female members. How does it feel knowing that you’re inspiring a new generation of young women, and is dealing with so many men all the time complicated?”</span>\n</p>\n<p>\n<span>Hope actually smiled at the question. “Wow, didn’t expect to go right into the heavy,” she laughed. “But for the first part. Before I was an Avenger, I was a chairwoman in a a big company. Like here at Stark Tower, Pym Technologies also offered plenty of school trip and I often had young women telling me that I was their role model, so I’ll tell you what I told them.</span>\n</p>\n<p>\n<span>“I am what you make of me. And if what you make of me is a good person, then it’s all thanks to you. Doing what’s right for right’s sake is the best you can do. I like that I can inspire young women everywhere to be heroes and joining STEM related subjects, but don’t do it because you think I’m cool. Do it because you want to do it. Do it because you think it’s the right thing to do.”</span>\n</p>\n<p>\n<span>“I agree with Hope,” added Carol, smiling at Betty. “Looking at it now, there still are not enough women working in the Air Force, but knowing that in some way I will be helping or inspiring more into joining? It’s a splendid feeling.</span>\n</p>\n<p>\n<span>“And about the second half of the question… no, it’s not that complicated. Luckily for us, the majority of these strapping men around us have grown up with strong female figures in their lives. Actually there is a whole club inside the Avengers called ‘Daddy Issues Club’,” she joked.</span>\n</p>\n<p>\n<span>“I’m the leader,” immediately said Tony, earning a couple of laughs.</span>\n</p>\n<p>\n<span>Carol rolled her eyes. “Honestly, when we were deciding who should be the leader of the Avengers, everyone immediately looked at me and Jim like it was the most obvious answer ever. I was expecting Tony - as an original Avenger - to step up, and he was instead the one to propose either me or Jim take the reign. The Avengers like to, as Peter says, ‘drink their respect women juice daily’.”</span>\n</p>\n<p>\n<span>Hope grinned. “Between me, Carol and the other ladies, keeping up with these dudes and Loki is easy.”</span>\n</p>\n<p>\n<span>Betty frowned. “And Loki?”</span>\n</p>\n<p>\n<span>Loki shrugged. “Anthony has informed me that the term here on Earth is genderfluid?”</span>\n</p>\n<p>\n<span>“Oh my god, like me!” squealed Taylor before they could stop themselves, and then blushed.</span>\n</p>\n<p>\n<span>Loki didn’t look bothered by the interruption, and smiled faintly. “Fantastic. The Avengers are people - and gods - just like you,” he said, for once no hint of sarcasm.</span>\n</p>\n<p>\n<span>Taylor smiled brightly at him.</span>\n</p>\n<p>\n<span>“Hi, I’m Hamza. My question is for Dr Strange. How do you, as a man of science, deal with being a sorcerer? Or did you believe in magic from the beginning?”</span>\n</p>\n<p>\n<span>“Don’t say a word!” snapped Stephen, before Tony could even open his mouth. The inventor pouted. </span>\n</p>\n<p>\n<span>Then he turned his attention on the student. “It was very hard. After my accident, though, I was desperate enough to try anything, and that’s how I found myself in the whole wizard business.</span>\n</p>\n<p>\n<span>“I did </span>\n<em>\n<span>not </span>\n</em>\n<span>believe in magic and at the beginning, it looked hopeless. I had some nascent magical abilities in me, but because of my utter belief in the laws of physics and science, I was unable to reach and use them. It took my teacher stranding me on Mt. Everest for me to figure out magic itself.”</span>\n</p>\n<p>\n<span>Peter mostly tuned out as each of them got serious - “</span>\n<em>\n<span>Colonel Rhodes, how does it feel to be now the only black official Avenger</span>\n</em>\n<span>?”, “</span>\n<em>\n<span>Dr Stark and Ms Van Dyne how do you juggle your work at SI and Pym Technologies with your work as an Avenger?</span>\n</em>\n<span>” and “</span>\n<em>\n<span>To Vision, Colonel Rhodes and Dr Stark, were the Accords the only reason behind the split of the Avengers?</span>\n</em>\n<span>” - or funny - “</span>\n<em>\n<span>Mr Thor, what is your favourite food on Earth?</span>\n</em>\n<span>”, “</span>\n<em>\n<span>Mr Barnes, how do you feel about the claims that Rasputin has you beat as Russia’s deadliest love machine?</span>\n</em>\n<span>” and “</span>\n<em>\n<span>Mr Loki, what is the funniest prank you’ve pulled on an Avenger</span>\n</em>\n<span>?” - questions.</span>\n</p>\n<p>\n<span>He did notice when Tony grinned and slipped out of the room, but his attention was promptly taken when Zara asked, “Have you guys read Harry Potter, and if so, what houses are you in?”</span>\n</p>\n<p>\n<span>Loki and James immediately nodded, smiling. “We read it together, yes. Me and James have a book club to better our understanding of your society. Thor doesn’t join in because he can’t read.”</span>\n</p>\n<p>\n<span>“Hey!”</span>\n</p>\n<p>\n<span>“I made a point of not reading the books the growing up,” explained Stephen, shrugging. “And now that Tony does nothing but call me Potter all the time, I simply refuse to read it.”</span>\n</p>\n<p>\n<span>“Don’t worry,” said Loki, “I’ve sorted all of you. Carol, Spiderman and Thor are Griffyndors. Rhodes, Anthony and Vision are Ravenclaws. Barnes and Hope are Hufflepuffs. Stephen and I are Slytherins.”</span>\n</p>\n<p>\n<span>“There is a joke waiting to be said about the two witches being Slytherins,” mused James, grinning when the sorcerers glared at him and said, in chorus, </span>\n</p>\n<p>\n<span>“I’m not a witch!” before scowling at each other.</span>\n</p>\n<p>\n<span>“See? Witchcraft.”</span>\n</p>\n<p>\n<span>Elena pointed another raised hand. </span>\n</p>\n<p>\n<span>“I’m Isaac, and my question is, among you guys, what ship is more popular? Ironstrange, Winteriron or Frostiron?”</span>\n</p>\n<p>\n<span>“Oh my god,” choked Peter, while the Avengers - except Hope and Vision - stared at Isaac uncomprehending.</span>\n</p>\n<p>\n<span>“Pardon me?” finally asked Rhodes, confused.</span>\n</p>\n<p>\n<span>Isaac shrugged. “You know, ship. Relation</span>\n<em>\n<span>ship</span>\n</em>\n<span>.” Then he finally realised their expression. “Oh, you don’t know?”</span>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>Allow me,” </span>\n</em>\n<span>interrupted FRIDAY, her voice sounding almost normal and giddy. “</span>\n<em>\n<span>Me and Vision have actually discussed this before, as it’s a phenomena we didn’t fully understand. But humans, especially the newest ones, have the habit of watching a dynamic between two people, and, if they enjoy it, decide to ‘ship’ it. Which means they like/think the two people are in a relationship and write stories - called fanfiction - about said couples or throuples,” </span>\n</em>\n<span>and here Peter died, with FRIDAY talking about fanfiction, good </span>\n<em>\n<span>god</span>\n</em>\n<span>, “</span>\n<em>\n<span>Boss is one of the people with the most fanfiction written about him, and there are several pairings for him; the most popular are, currently, IronStrange, WinterIron and FrostIron. Which are the pairings of Boss and Dr Strange, Boss and Mr Barnes and Boss and Mr Loki. It is a most fascinating topic. I find myself a big fan of Boss and Mr Barnes.”</span>\n</em>\n</p>\n<p>\n<span>“Oh my god?!” let out Peter, staring at one of the cameras in shock.</span>\n</p>\n<p>\n<span>Vision spoke up. “Actually, I find that Dr Strange and Mr Stark are very well matched, actually.”</span>\n</p>\n<p>\n<span>Thor was, of course, the first to get back to his senses. “Well, there are many tales of my brother’s prowess and conquests! I believe him and friend Tony would make the most charming of couples.”</span>\n</p>\n<p>\n<span>“Hold on!” interrupted Rhodes, giving the three very pallid men a suspicious look. “Why are those three the most popular candidates as… suitors for </span>\n<em>\n<span>my little brother</span>\n</em>\n<span>?”</span>\n</p>\n<p>\n<span>“Well,” started Isaac, “Mr Barnes and Dr Stark are popular because they are the ‘Casanova of the past’ and the ‘Don Juan of the future’. Plus there are so many clips online of Mr Barnes glaring and acting like a possessive boyfriend every time someone gets too close to Dr Stark.” James kept staring at the ceiling, absolutely refusing to make eye contact with Rhodes.</span>\n</p>\n<p>\n<span>“And Mr Loki, he and Dr Stark are the ‘prince of Asgard’ and the ‘prince of Earth’. They look like rich boyfriends everytime they get papped together, they wear matching clothing all the time and more than once they have been seen holding hands.”</span>\n</p>\n<p>\n<span>Loki’s cheeks were a little red as he inspected his nails.</span>\n</p>\n<p>\n<span>“And Dr Strange and Dr Stark are magic vs science. There are so many videos of the two of them arguing/flirting on their ‘dates’, and they do so even in the few battles that people managed to record. Plus, there is that video from like 2007 of them making out at a gala-”</span>\n</p>\n<p>\n<span>“WHAT?!” Chorused James, Loki and Rhodes.</span>\n</p>\n<p>\n<span>Stephen raised both hands up. “2007! We were both different people back then!”</span>\n</p>\n<p>\n<span>“What I’m hearing,” said Rhodey, glaring at him before scowling at the other two. “Is that you’re trying to pull something with my Tony? My baby brother?”</span>\n</p>\n<p>\n<span>“I don’t know,” said Hope, smirking. “I think Loki and Tony would be cute together, actually. He’s the only one who gets to call him ‘Anthony’, and he lets him get away with hugging and touching him all the time like a sappy touch starved fool in love.”</span>\n</p>\n<p>\n<span>“Hope!”</span>\n</p>\n<p>\n<span>“Thread carefully, Van Dyne.”</span>\n</p>\n<p>\n<span>“No way,” said Carol shaking her head. “Barnes and him are always calling each other bullshit like ‘doll’, ‘snowflake’, ‘darling’, ‘honey’... that’s real sap shit.”</span>\n</p>\n<p>\n<span>“He calls </span>\n<em>\n<span>me </span>\n</em>\n<span>honeybear, that means </span>\n<em>\n<span>nothing</span>\n</em>\n<span>!”</span>\n</p>\n<p>\n<span>“But no one riles him up like Dr Strange does,” said Harley all of a sudden, because of course Harley would choose that moment to walk in, snickering at the looks of betrayal Loki and James sent him. “And the cloak likes him too.”</span>\n</p>\n<p>\n<span>“The cloak likes who?” questioned Tony, as he walked in with, “Look here children, I’ve brought my lovely Brucie-Bear!”</span>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>Oh my god its Dr Banner!” “It’s the Hulk!” “I’m gonna pass out, it’s my idol!” “Holy shit, Dr Robert Bruce Banner!”</span>\n</em>\n</p>\n<p>\n<span>And then Thor stood up pouting and pointing a finger at Tony. “That’s not fair, friend Tony, you already have </span>\n<em>\n<span>three </span>\n</em>\n<span>suitors! Relinquish my lover at once?!”</span>\n</p>\n<p>\n<span>“I have what?” </span>\n</p>\n<p>\n<span>“Your </span>\n<em>\n<span>what</span>\n</em>\n<span>.”</span>\n</p>\n<p>\n<span>Peter just shook his head as Tony and Thor prepared to argue over Bruce who was kind of overwhelmed and enthused by the student’s warm reaction to him, and James, Loki and Stephen argued about who would make a better boyfriend to Tony, while Carol tried to stop Rhodey from going after them while Hope and Vision just look around themselves, very amused by the chaos.</span>\n</p>\n<p>\n<span>It could have gone worse.</span>\n</p>\n<p>\n<span>“Hey, who wants to hear a funny story about Peter?” asked Harley, eyes sparkling.</span>\n</p>\n<p>\n<span>Or not.</span>\n</p>"
}