{
  "id": "26163019",
  "url": "https://archiveofourown.org/works/26163019?view_full_work=true",
  "author": [
    "boba_lu"
  ],
  "title": "trust is a dangerous game",
  "rating": "Not Rated",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [],
  "fandoms": [
    "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
  ],
  "relationships": [
    "Midoriya Izuku & Todoroki Shouto",
    "Midoriya Izuku & Shinsou Hitoshi",
    "Midoriya Izuku & Everyone",
    "Bakugou Katsuki & Midoriya Izuku",
    "Midoriya Izuku & Uraraka Ochako",
    "Iida Tenya & Midoriya Izuku",
    "Midoriya Izuku & Yamada Hizashi | Present Mic",
    "Aizawa Shouta | Eraserhead & Midoriya Izuku",
    "Midoriya Izuku & Yagi Toshinori | All Might"
  ],
  "characters": [
    "Midoriya Izuku",
    "Yamada Hizashi | Present Mic",
    "Aizawa Shouta | Eraserhead",
    "Shinsou Hitoshi",
    "Todoroki Shouto",
    "Bakugou Katsuki",
    "Asui Tsuyu",
    "Ashido Mina",
    "Kirishima Eijirou",
    "Kaminari Denki",
    "Sero Hanta",
    "Uraraka Ochako",
    "Iida Tenya",
    "Tsukauchi Naomasa",
    "Yagi Toshinori | All Might",
    "Nedzu (My Hero Academia)",
    "Kayama Nemuri | Midnight",
    "Sasaki Mirai | Sir Nighteye",
    "Police Officers (Characters)"
  ],
  "additional_tags": [
    "Midoriya Izuku Needs A Hug",
    "Angst",
    "Angst and Feels",
    "Angst and Hurt/Comfort",
    "Angst with a Happy Ending",
    "Protective Shinsou Hitoshi",
    "Midoriya Izuku & Shinsou Hitoshi Friendship",
    "Shinsou Hitoshi is a Good Friend",
    "Midoriya Izuku & Todoroki Shouto Friendship",
    "Protective Todoroki Shouto",
    "Todoroki Shouto is a Good Friend",
    "Midoriya Izuku Has Trust Issues",
    "Trust Issues",
    "Emotional Hurt/Comfort",
    "Hurt",
    "Hurt/Comfort",
    "False Accusations",
    "Yagi Toshinori | All Might is a Bad Teacher",
    "Yagi Toshinori | All Might Being an Asshole",
    "Guilt",
    "Regret",
    "Everyone Needs A Hug",
    "Protective Yamada Hizashi | Present Mic",
    "Parental Yamada Hizashi | Present Mic",
    "Angry Present Mic",
    "U.A. fucked up",
    "Especially Aizawa",
    "Guilty Aizawa Shouta | Eraserhead",
    "Class 1-A isn't good in this",
    "Guilty Class 1-A",
    "It's still gonna be a happy ending don't worry",
    "But first comes lots of angst",
    "All Might ain't the shit in this sry",
    "We stan Dadmic here",
    "Yamada Hizashi | Present Mic beating everyone's ass",
    "Suspected Traitor Midoriya Izuku",
    "Falsely accused Midoriya Izuku",
    "Traitor Midoriya Izuku",
    "Except that he isn't",
    "Everyone just really fucked up",
    "Izuku's notebooks need more attention",
    "Additional Tags to Be Added",
    "Sad Midoriya Izuku",
    "Hurt Midoriya Izuku",
    "Depressed Midoriya Izuku"
  ],
  "language": "English",
  "series": "Part 1 of Broken trust and shattered heart",
  "published": "2020-08-28",
  "completed": "2020-09-10",
  "words": "15,412",
  "chapters": "3/3",
  "comments": "436",
  "kudos": "9,140",
  "bookmarks": "1,091",
  "hits": "120,444",
  "summary": "<p>He had noticed how everyone changed.</p>\n<p>And it had all begun with his lost notebook.</p>\n<p>One day he was still fine, laughing with his friends and raising his hand during every lesson, the next he was alone and scared of speaking up.<br>The teachers glared at him, his friends avoided him, and the only ones seemingly unaffected by whatever happened were Present Mic, Shinsou, Todoroki and Asui.</p>\n<p>Then he was suddenly sitting in an interrogation room, with his previously lost notebook laying in front of him. </p>\n<p> </p>\n<p>What the hell was going on?</p>",
  "notes": "<p>So I saw a lot of suspected traitor Izuku fics and decided to add my take on it :)</p>\n<p>Enjoy the sweet angst! &lt;3</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">notes</a>.)\n</p>\n<p>✨chapter one rewritten on 04/08/2021✨</p>\n<p>Here goes part two!!</p>\n<p>If ya thought there's gonna be less angst in this, well.... I might have to dissapoint y'all :))</p>\n<p>Still, hope you enjoy! ^^</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>Come scream @ me in the comments ^^</p>\n<p>See you in a week, featuring Class 1-A finding out! Stay safe &lt;3</p>\n<p> </p>\n<p>✨chapter two rewritten on 16/08/2021✨</p>\n<p>Third part of this story finally out!</p>\n<p>Class 1-A will finally find out as well, though I'll be writing about different students individually in the third part of the series!</p>\n<p>Hope you enjoy! &lt;3</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>Y'all so All Might who?<br>I only know Ass Might xD</p>\n<p>I will be posting the second part of the series later today, where we'll find out everything from Bakugou's perspective!</p>\n<p>Hope you'll stick around and thank you so much for everyone who reads this! 👁️3👁️</p>\n<p> </p>\n<p> </p>\n<p>✨chapter three rewritten on 17/08/2021✨</p>\n<p>So how did'ya like it?</p>\n<p>The next chapter's gonna be out in a week, so see y'all then!</p>\n<p>✨✨Stay safe &lt;3✨✨</p>",
  "text": "<p>\"What do you use these notebooks for?\" </p>\n<p> </p>\n<p>The officer's eyes were cold and hard as stone as they pierced his eyes like an arrow. </p>\n<p> </p>\n<p>Maybe even right through them and into his very heart, leaving a gaping hole of nothing but blackness.</p>\n<p> </p>\n<p>Emptiness.</p>\n<p> </p>\n<p>... and numbness. </p>\n<p> </p>\n<p>With wide eyes and growing horror, his gaze fell onto the figures behind the glass pane, the faint outline of his reflection blocking the clear view of the people behind it. </p>\n<p> </p>\n<p>But they were all far too familiar to him. </p>\n<p> </p>\n<p>He could have recognized them anywhere, even if it was pitch black in the room. </p>\n<p> </p>\n<p><strong>A̶i̶z̶a̶w̶a̶-s̶e̶n̶s̶e̶i̶</strong> Eraserhead was there and a few other pro heroes and teachers at U.A, including Nedzu. </p>\n<p> </p>\n<p>And Sir Nighteye. </p>\n<p> </p>\n<p>... and... All Might...</p>\n<p> </p>\n<p>\n<strong>...o̶f̶ c̶o̶u̶r̶s̶e̶ h̶e̶'d̶ b̶e̶ h̶e̶r̶e̶ w̶h̶a̶t̶ h̶a̶d̶ h̶e̶ e̶x̶p̶e̶c̶t̶e̶—</strong>\n</p>\n<p> </p>\n<p>'<em>Oh</em>', he thought bitterly.</p>\n<p> </p>\n<p>'<em>U.A. was supposed to be different... I was a fool to think anything would change.'</em></p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>The last two weeks have been strange, to say the least.</p>\n<p> </p>\n<p>As he should have known, and as many problems in his life, everything started with his notebook. </p>\n<p> </p>\n<p>Specifically him forgetting his newest one in the classroom. </p>\n<p> </p>\n<p>'<em>So stupid..</em>.', he thought. '...<em>that all it had taken was <strong>h̶i̶s̶</strong> <strong>n̶o̶t̶e̶b̶o̶o̶k̶</strong> that thing, that stupid little thing.' </em></p>\n<p>It shouldn't have been a big deal, really, because even if someone found it, his name was written on it and the person could give it back. </p>\n<p>Besides, those notebooks weren't a big deal at all, he wasn't hiding anything in them. Everyone knew his obsession with heroes and that he absolutely adored analyzing them, though the answer as to why he loved that hobby so much he always left unanswered. </p>\n<p> </p>\n<p>Not that he didn't trust his friends, because he did! It took a lot of time and effort, but he could safely say that he trusted them with his life now, and yet the whole topic surrounding his quirkless past was still something he kept under wraps. </p>\n<p> </p>\n<p>And those notebooks were a <em>big</em> part of it. </p>\n<p> </p>\n<p>They weren't just a hobby, they were also a coping mechanism to calm his mind, focus and not feel completely useless to society. </p>\n<p>It was the only thing that made him feel smart in middle school when the teachers continously faked his grades, and the children laughed about it. </p>\n<p> </p>\n<p>\n<em>At least they couldn't fake the notebooks and amount of effort he put in them. </em>\n</p>\n<p> </p>\n<p>He was able to get Shinsou to open up to him thanks to them, after Izuku proposed different ways he could use his quirk and convinced him repeatedly that the quirk he had was so useful for underground work. </p>\n<p> </p>\n<p>Todoroki had come to him, too. After the Hosu incident, both of them had come a lot closer and hung out in his room. That day, the green haired boy had pulled out his notebook and asked him questions about both sides of his quirk, proposing different ways to improve his weak points and fighting style. <em>((...and created a draft with the title <strong>Eat shit Endeavor</strong>, a compilation of evidences, stats and graphs that not only proved he was not worthy of being the number two hero but could also get him stripped of his title ;D yk, for later purposes )) </em></p>\n<p> </p>\n<p>So yeah, technically, he had nothing to worry about.</p>\n<p> </p>\n<p>It was fine.</p>\n<p> </p>\n<p>... but then the next day, the book was gone.</p>\n<p> </p>\n<p>He had come to class in the morning, sitting down on his usual spot behind Kacchan and chattered away with Uraraka, who had greeted him after coming in moments later.</p>\n<p> </p>\n<p>Then he remembered the notebook.</p>\n<p> </p>\n<p>Izuku had subtly glanced around his table, then asked Uraraka if she had seen it, but the girl had shaken her head.</p>\n<p>He vaguely heard Bakugou muttering '<em>stupid nerd, always loosing his shit</em>', but didn't pay it any mind, instead opting to ask his other friends, who also denied having seen it.</p>\n<p> </p>\n<p>Weird.</p>\n<p> </p>\n<p>But there wasn't much to worry about, Izuku had thought. After all, maybe a teacher had grabbed it and would give it back later.</p>\n<p> </p>\n<p>\n<em>[Come to think of it, maybe he could voice some of the ideas written there out loud during their next training session, especially because there were a few new techniques he wanted to try out with Kirishima, Urakaka and Shinsou... ] </em>\n</p>\n<p> </p>\n<p> </p>\n<p>... Then homeroom started.</p>\n<p> </p>\n<p>It was all good, until Aizawa's eyes fell on Midoriya, and the temperature in the room seemed to have dropped several degrees. No one except Izuku himself had noticed, because where everyone had gotten the ususal tired looks, he was greeted with the stone-cold, piercing glare Izuku remembered being directed at the League of Villains during various instances. </p>\n<p> </p>\n<p>\n<em>... Did he... Do something wrong...? </em>\n</p>\n<p> </p>\n<p>The underground hero's eyes had lingered on him a while more, looking him up and down as if searching for something, before he abruptly turned away from the green haired boy and started the lesson with a quick roll call before getting to the actual topic. </p>\n<p> </p>\n<p>Again, the teacher had hesitated when calling his name, and when he did say it, it sounded distant and cold, wrong. </p>\n<p> </p>\n<p>Something was wrong, he concluded, but shrugged it off as the man simply having a bad day. It was no surprise he would show it on Midoriya of all people, after all, it was clear that he was his least favorite student, if the name '<em>Problem Child</em>' was anything to go by.</p>\n<p> </p>\n<p>But even so, Izuku didn't pay the weird behavior any more attention and focused on going on with the day.</p>\n<p> </p>\n<p> </p>\n<p>... only to discover that it wasn't only Eraserhead who was behaving weirdly.</p>\n<p> </p>\n<p>In fact, except for Present Mic, everyone's expression seemed to have grown cold and calculating upon seeing him.</p>\n<p>Even All Might, <em>All Might</em>, the man he got his quirk from, his mentor, seemed a bit more different than usual. He was distant, movements stiff and words monotone as he explained the exercise they'd be doing today.</p>\n<p> </p>\n<p>Present Mic was the only \"<em>normal</em>\" one, which put Izuku's mind a little bit at ease.</p>\n<p>He was just as loud as he normally was, his expression was just as bright as every other day and he called Midoriya '<em>Little Listener</em>' just like all the other times.</p>\n<p> </p>\n<p>But if he was still on good terms with Midoriya, what was wrong with everyone else?</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>The next day, he had needed to use the bathroom for a moment during Midnight's class. </p>\n<p> </p>\n<p>The heroine — <em>clearly hesitant and distrustfully eyeing him up and down</em> — excused him. </p>\n<p> </p>\n<p>On the way to the bathroom, he wracked his head about what could have happened for everything to change so suddenly.</p>\n<p> </p>\n<p>\n<em>Had they found out about him being quirkless before U.A.?</em>\n</p>\n<p> </p>\n<p>\n<em>Had he subconsciously done something to make everyone angry?</em>\n</p>\n<p> </p>\n<p>\n<em>Or maybe they finally realised what a waste of time he actually was?</em>\n</p>\n<p> </p>\n<p>Because the looks he was getting, they were the same ones he got from his old teachers in elementary and middle school. It made him extremely uncomfortable, because he had hoped U.A. would be different.</p>\n<p> </p>\n<p>In U.A., everyone had cared about him, had encouraged him and supported him from the start.... <em>o̶r̶ s̶o̶ h̶e̶ t̶h̶o̶u̶g̶h̶t̶</em>... </p>\n<p> </p>\n<p>From the very first day at the hero school, to the Sport's Festival, to the Hosu Incident, Bakugou's kidnapping, the Provisional License Exam and Eri's rescue, nobody had ever, EVER, behaved that way.</p>\n<p> </p>\n<p>And his notebook was still nowhere to be found, too.</p>\n<p> </p>\n<p>He had to have been gone for no more than fifteen minutes, but when he came back to class, his breath caught in his throat at the sight.</p>\n<p> </p>\n<p>Standing in the classroom was Eraserhead, seemingly just having finished saying something [maybe to the heroine who was holding a stack of paper in her hands that wasn't there before], and the whole class whipped around to stare at him with wide, suspecting eyes the moment he opened the door. </p>\n<p> </p>\n<p>What the hell was going on?</p>\n<p> </p>\n<p>Kacchan seemed angry and disbelieving, Uraraka and Iida were looking lost, and the rest of the class was eyeing him with those same cold and hard eyes as all the teachers. Guarded, his mind inquired. Suspecting. </p>\n<p> </p>\n<p>But why? </p>\n<p> </p>\n<p>The only ones not affected, though looking angered were Asui, Todoroki and Shinsou. <em>( a weird look on their faces, since they weren't the type to get angry easily.) </em></p>\n<p> </p>\n<p>As fast as he could, he dashed towards his seat and sat down, looking at the table to save himself from those looks.</p>\n<p> </p>\n<p>Eraserhead left and Midnight continued her lesson, but every once in a while, someone of his classmates would glance at him before drastically turning away when Midoriya looked at them, as if afraid of him glancing back at them. </p>\n<p> </p>\n<p>What was happening?!</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Things only seemed to have gotten worse after that. A week after it all started, the teachers were going extra hard on him, the second week, almost all of his classmates had started avoiding him, and by the time the third week came around, even Uraraka and Iida had distanced themselves from him.</p>\n<p> </p>\n<p>It devastated him to no end.</p>\n<p> </p>\n<p>Was he really that disgusting to be around?</p>\n<p> </p>\n<p>He thought he had finally made friends after attending U.A., but somehow, he was still a useless, disgusting, weird Deku to be around.</p>\n<p> </p>\n<p>Kirishima had stopped calling him Midori-bro.</p>\n<p> </p>\n<p>Kaminari had stopped slinging a hand over his shoulder in a friendly manner when the other wasn't expecting it.</p>\n<p> </p>\n<p>Mina stopped talking to him all together.</p>\n<p> </p>\n<p>Yaoyorouzu was always observing him with watchful and analytic eyes, as if searching for a flaw in his... whatever it was they started avoiding him because of. </p>\n<p> </p>\n<p>Uraraka wasn't smiling around him anymore.</p>\n<p> </p>\n<p>And Iida, though he tried not to show it, would shift away from him when he got too close.</p>\n<p> </p>\n<p>And there were other things too. </p>\n<p> </p>\n<p>He hadn't even heard his real name from them for all this time now. </p>\n<p> </p>\n<p>It was always Deku. </p>\n<p> </p>\n<p>It sounded sour, impersonal, just Deku, as if they were strangers, nothing more. </p>\n<p> </p>\n<p>When Izuku had started writing in his new analysis notebook, the other one still nowhere to be found, the whole class seemed to shift uncomfortably in their seats. There were eyes on him, frigid and unforgiving, and slowly, the boy had put down the pen, not missing how everyone seemed to relax at that. </p>\n<p> </p>\n<p>\n<em>Were they scared of his notebooks? </em>\n</p>\n<p> </p>\n<p>But that was ridiculous... They knew what was in them, what he wrote about, why did they look like that? </p>\n<p> </p>\n<p>The next thing everyone had started to get creeped out about was the muttering.</p>\n<p> </p>\n<p>It was during class, where he started muttering again, only to have gotten shut up by Kaminari, who glared his way.</p>\n<p> </p>\n<p>His mouth and mind always ran faster than his hands, that's why he needed to sort and voice his thoughts out loud, to actually remember everything he needed for his analysis and schoolwork. </p>\n<p> </p>\n<p>And now, in the span of a few weeks, they all made him think it was freakish and weird, that he should be ashamed of it. </p>\n<p> </p>\n<p>It wouldn't have bothered him were it his classmates from middle school, but those were his friends, or well, former friends... and it hurt, to see them look repelled at even his voice. </p>\n<p> </p>\n<p>\n<em>Why did it not bother them before, then? </em>\n</p>\n<p> </p>\n<p>With every passing day, it seemed that the whole school had turned against him, as if he was some kind of villain that they needed to get rid of.</p>\n<p> </p>\n<p>But he didn't understand.</p>\n<p> </p>\n<p>He risked his life, broke his bones for every single one of the people he considered friends, only to have them turn their backs on him?</p>\n<p> </p>\n<p>All Might, out of all people, treated him like an enemy, for God's sake!</p>\n<p> </p>\n<p>He wouldn't answer his calls, refused to meet up with the other, and started failing him in hero class. </p>\n<p> </p>\n<p>The same went for the rest of the staff.</p>\n<p> </p>\n<p>He studied and studied, but somehow failed every test or barely passed and everytime they worked in pairs during the hero exercises, it was always Midoriya, useless Deku, who would get the role of the villain and nobody would be willing to pair up with him.</p>\n<p> </p>\n<p>Except for Todoroki, Tsuyu and Shinsou.</p>\n<p> </p>\n<p>The three of them were the only ones who were still willing to be friends with him. Whatever was going on, they knew about it, but still decided to be with him.</p>\n<p>He could have asked them what was going on, but right now, them willingly choosing to stay with him was more than he could have asked for, and he was wanted to treasure that.</p>\n<p> </p>\n<p>And if they didn't tell him themselves, it could mean they were threatened to keep quiet about it. </p>\n<p> </p>\n<p>Kacchan was also one of the only people who didn't change. Still as loud and brash as ever, but after their fight at Ground Beta, they were starting to sort things out. Right now though, it seemed that he was ready to explode at everything and everyone, especially at the teachers.</p>\n<p>Maybe it also had something to do with why everyone was being so weird.</p>\n<p>Then again, if everyone was acting so hostile towards him, why wasn't Bakugou?</p>\n<p>Sure, they had talked a bit about their feelings at Ground Beta, but their issues weren't resolved yet. So why...</p>\n<p> </p>\n<p>The green haired boy sighed.</p>\n<p> </p>\n<p>The only person within U.A.'s staff who was still incredibly kind to him was Present Mic. His eyes were warm and kind, he answered every question Izuku asked carefully and even explained small detail about his quirk that most likely counted as classified. And yet he trusted Izuku enough to tell him... </p>\n<p> </p>\n<p>Yamada had actually seemed interested when the green haired boy showed him his notebook entry, amazed by the length of the analysis and amount of information he didn't even know was noticeable to the people around. </p>\n<p> </p>\n<p>Today though... Today was different. English was their last lesson, followed by lunch, and Hizashi was looking strangely sad and angry at the same time. No, scratch that, he was definitely seething.</p>\n<p>Izuku tried shrugging it off, but his stomach was churning at the thought of the last teacher who had been kind to him, suddenly changing like everyone else. </p>\n<p> </p>\n<p><em>Was it just a play-pretend?</em> </p>\n<p> </p>\n<p>\n<em>Did he not care about him after all?</em>\n</p>\n<p> </p>\n<p>\n<em>Was it really just an act? </em>\n</p>\n<p> </p>\n<p>Five minutes before the lesson ended, Present Mic spoke up. </p>\n<p> </p>\n<p>\"Hey Little Listener, could you please see me after class?\"</p>\n<p> </p>\n<p>Midoriya's face fell. '<em>Don't be like that... You should have expected this...</em>'</p>\n<p> </p>\n<p>Nodding mutely, the green haired boy felt himself panic, standing up stiffly and walking towards the teacher's desk. A small, secure pat on his shoulder and Shinsou opened his mouth.</p>\n<p> </p>\n<p>\"We'll be waiting for you to eat lunch together, 'Zuku, okay?\"</p>\n<p> </p>\n<p>Then they were gone as well and Midoriya was left alone with the blonde haired man.</p>\n<p>He expected to get scolded, shouted at or even punched. Maybe told that he would get expelled. </p>\n<p> </p>\n<p>Closing his eyes in expectation, he never thought that two arms would pull him into his chest and hold him there.</p>\n<p> </p>\n<p>Huh... </p>\n<p> </p>\n<p>The embrace was warm and secure, and slowly, Izuku felt himself relax into the teacher's hold and return the hug.</p>\n<p> </p>\n<p> </p>\n<p>\"Izuku listen\", Yamada began and the boy's eyes grew wide after hearing his given name from the mouth of a teacher.</p>\n<p> </p>\n<p>\"I need you to listen carefully, little listener\", Yamada began and squeezed his student's shoulders from where he had gripped them tightly. </p>\n<p> </p>\n<p>\"I can't even begin to say how sorry I am, for everything and on behalf of everyone's behavior. I'm sorry , I'm really sorry, and I'm so sorry for what's going to happen. I wanted to tell you, I really wanted to, but if I did...\" he trailed off and shook his head in both fury and dejection. </p>\n<p> </p>\n<p>The words \"<em>the consequences would be grave</em>\" were left hanging in the air, but there was no need in saying them out loud, for Izuku understood them clearly. </p>\n<p> </p>\n<p>But... why? </p>\n<p> </p>\n<p>What could be this bad that even Present Mic himself was afraid? </p>\n<p> </p>\n<p>\"I'm sorry, little one, so sorry...\" </p>\n<p> </p>\n<p> </p>\n<p>The door flew open with a loud bang, making the green haired boy flinch and whirl around, only to see several police officers storming in and advancing towards him whilst screaming to stand still. </p>\n<p> </p>\n<p>He was completely helpless as they handcuffed and pulled him harshly towards the door again, holding back the blonde teacher who wanted to come with them. </p>\n<p> </p>\n<p>What was going on? </p>\n<p> </p>\n<p>Why was this happening? </p>\n<p> </p>\n<p>What did he do wrong?? </p>\n<p> </p>\n<p>Outside of the classroom, he saw the teachers look at him with enraged expressions on their faces. Some of his classmates were also there. Kirishima, Ashido, Shoji, Sero... They were all gazing at him as if he were some shit stain on the ground, a worthless Deku whose existence needed to get evaporated. </p>\n<p>But that's all he ever was to them, right? </p>\n<p>All those smiles and promises were fake, all of them were fake.</p>\n<p> </p>\n<p>He started panicking, motions frantic as he looked around in hopes of getting help from one of the students or teachers around him. The police officer's grip was painfully hard, tightening even more when he tried jerking his hands away, and the green haired boy winced. </p>\n<p> </p>\n<p>\"IZUKU!!\" He heard his name being shouted in the distance and looked up fast enough to catch a glimpse of purple and half white half red advancing towards him. </p>\n<p> </p>\n<p>'<em>Hitoshi, Shoto!!</em>', his mind screamed, body already trying to scramble out of the officer's way and towards his two friends. </p>\n<p> </p>\n<p>But he was too late, and before he could let out a single sound, he was forced head first into the police car.</p>\n<p> </p>\n<p>'<em>Just like a criminal</em>', the green haired boy thought in disbelief, as the door closed and they drove off. He wanted to ask so badly what they were doing to him, why he was being handled like a criminal, a villain, but thought better than that. </p>\n<p> </p>\n<p>It's just like in middle school. </p>\n<p> </p>\n<p>You speak up, you make everything worse. </p>\n<p> </p>\n<p>And so they took off, Midoriya feeling smaller and more a Deku than ever before. </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>As they stopped in front of the police station, he was roughly grabbed by his shoulders, pressing on an old scar that still stung occasionally, and dragged inside. </p>\n<p> </p>\n<p>What he saw there made the last bit of light in his eyes die. </p>\n<p> </p>\n<p>Eraserhead was there, along with All Might, Sir Nighteye and Principal Nedzu. </p>\n<p>Beside them stood at least ten police officers, all looking furious, and it was all directed at him. </p>\n<p> </p>\n<p>\"Ai-Aizawa-sensei, what's go-going on?\" Midoriya stuttered out helplessly, but his homeroom teacher refused to even acknowledge the question, only glaring at him with a look that he couldn't quite place. </p>\n<p> </p>\n<p>He was brought inside a room, which was completely empty, save for the table in the middle, and a chair on either side. Izuku was forcefully dragged to the seat where he could see the door and the glass pane, his handcuffed hands getting chained to the chair. </p>\n<p> </p>\n<p>Realization struck him with cold terror as a chill went down his spine. </p>\n<p> </p>\n<p>This was an interrogation room. </p>\n<p> </p>\n<p>He was being interrogated... But why?</p>\n<p> </p>\n<p>It were approximately ten minutes later that the door swung open and the green haired boy flinched out of fear of what would happen next.</p>\n<p>The police officer stopped beside the chair and pushed it away, opting to stand as he slammed a book onto the table. </p>\n<p> </p>\n<p>\"What do you use these notebooks for?\"</p>\n<p> </p>\n<p>Looking down, Izuku realised that this was his analysis notebook he lost some time ago. He blinked a few times before looking at the officer with incomprehending eyes. </p>\n<p> </p>\n<p>He didn't understand...</p>\n<p> </p>\n<p>\n<em>Why were they asking him that?</em>\n</p>\n<p> </p>\n<p>Izuku tried to answer as best as he could through his confusion, but that proved to be the wrong thing to do, because the man slammed his hands onto the table and screamed. </p>\n<p> </p>\n<p>\"DO NOT LIE TO ME!\" </p>\n<p> </p>\n<p>The officer's eyes were bright with unchecked anger and hard as stone, and all Izuku could do was stare with wide eyes and growing horror behind the glass, looking directly at his homeroom teacher, silently pleading for him to do something. </p>\n<p>But when he refused to look at the boy, only clenching his eyes shut and turning his head away, Midoriya felt tears gather in the corner of his eyes. </p>\n<p> </p>\n<p>And when he looked at everyone else, they only glared at him or looked away as well. </p>\n<p> </p>\n<p>\"What do you use these notebooks for?\" </p>\n<p> </p>\n<p>The policemen asked again. </p>\n<p> </p>\n<p>\"Have you ever given anyone those notebooks with the purpose of hurting someone?\" </p>\n<p> </p>\n<p>\"Since when were you associated with the league of villains?\" </p>\n<p> </p>\n<p>\"Do you sell any of that analysis to the League of Villains?\" </p>\n<p> </p>\n<p>And '<em>Oh</em>', he thought bitterly. '<em>So that's what they mean....' </em></p>\n<p> </p>\n<p>'<em>U.A. was supposed to be different... I was a fool to think anything would change</em>.'</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>For the next two hours, the police officer continued barking questions at him, shouting and slamming and screaming even louder, not even caring when Izuku broke down completely, sobbing quietly whilst giving the same reply over and over again.</p>\n<p> </p>\n<p>But nobody believed him.</p>\n<p> </p>\n<p>By the time the third hour came around, he was in an almost catatonic state.</p>\n<p>Emotionless, unmoving and completely silent, staring at the table that still contained his notebook.</p>\n<p>Tears were still slipping from his eyes, but he wasn't answering anymore. </p>\n<p> </p>\n<p>He completely disassociated.</p>\n<p> </p>\n<p>When the police officer left and detective Tsukauchi came in, the damage that had already been done was beyond repair.</p>\n<p> </p>\n<p>The man entered and took careful steps to come closer, eyes scanning the boy up and down before settling on his blank face. </p>\n<p> </p>\n<p>This was no villain or traitor. </p>\n<p> </p>\n<p>This was a child that's been broken, accused of something he wasn't, and failed in every way possible.</p>\n<p> </p>\n<p>Sitting down on the chair, Tsukauchi sighed before pulling out the sheets with all the questions he needed to ask the boy, every fiber of his body wanting to go against it. </p>\n<p> </p>\n<p>But he knew it needed to be done. </p>\n<p> </p>\n<p>He was neither heartless nor cruel, but still bound to the same rules and laws the police was. </p>\n<p> </p>\n<p>And if the majority wanted to interrogate Midoriya, any objection was useless. </p>\n<p> </p>\n<p>And still... </p>\n<p> </p>\n<p>This boy had risked his life, broke his bones, shattered them and ended up in the hospital more times than he could count, all for the sake of his \"<em>friends</em>\" and teachers, only to get accused of something so ridiculous? </p>\n<p> </p>\n<p>He was a stellar student, kind, forgiving, selfless and had a pure heart of gold.</p>\n<p> </p>\n<p>\n<em>This was really who they thought was the traitor? </em>\n</p>\n<p> </p>\n<p><em>Come on, couldn't they have done at least a little bit better in their choice?</em> </p>\n<p> </p>\n<p>\n<em>Like seriously, and why the fuck didn't All Might defend him?! He was his successor, his \"boy\" and yet the \"<strong>Symbol-of-peace</strong>\" <strong>my ass</strong> was standing in front of the room as well, looking almost unbothered by the tumult going on here. </em>\n</p>\n<p> </p>\n<p>All Might was his friend, a very close one at that, but <em>what the fuck was he thinking?! </em></p>\n<p> </p>\n<p>This precious boy isn't, wasn't, had never and could never, would never be a traitor. </p>\n<p> </p>\n<p>And besides... After what happened at the USJ...</p>\n<p> </p>\n<p>If he would have been the traitor, that villain with the warp gate quirk, Kurogiri would have known which kid to teleport into which section.</p>\n<p> </p>\n<p>But they were divided into those different regions randomly, because they didn't know anything about the kids. </p>\n<p> </p>\n<p>Which meant that there could not have been any help from inside U.A., especially not a first year who had not even known all names of his classmates at that time yet. </p>\n<p> </p>\n<p>'<em>They all fucked up</em>', Tsukauchi thought. '<em>I wonder how they plan on making this right.'</em></p>\n<p> </p>\n<p>When he wrapped up the interrogation, unchained the boy and left the room to talk to Eraserhead and everyone else, Izuku still sat on the chair.</p>\n<p>His mind was a dark void and he couldn't think about anything except what happened. </p>\n<p> </p>\n<p>They thought he was a traitor...</p>\n<p>After everything he did for them... </p>\n<p>They thought he was a villain...</p>\n<p> </p>\n<p>There were noises outside the interrogation room, but Izuku couldn't care less. Slowly, as if on autopilot, he stood up, grabbed his notebook and opened the door.</p>\n<p>The voices were even louder, he clearly heard them talking, but strangely couldn't make out a single word. Until...</p>\n<p> </p>\n<p>\"IZUKU!\"</p>\n<p> </p>\n<p>The voices abruptly stopped and it was as if  reality crashed down on him, because he suddenly became aware of how his eyes were still leaking tears, how his heart was aching and how he was trembling all over.</p>\n<p>His vision was blurry, but he could make out two boys coming towards him...</p>\n<p>\"Hi-Hitoshi... Shouto...\" he whispered, before his knees buckled, and just before he crashed onto the floor, two strong arms wrapped around his body and pulled him into a broad chest.</p>\n<p>He inhaled deeply and smelled lavender.</p>\n<p>'<em>Hitoshi</em>...'</p>\n<p> </p>\n<p>Both boys sank to the floor, and another hand came to rest on his back, making circle motions to calm him down.</p>\n<p> </p>\n<p>At the state of the boy, Shinsou and Todoroki were outraged. How could their teachers have done something like that?!</p>\n<p> </p>\n<p>Weren't they supposed to be trusted?</p>\n<p> </p>\n<p>How could they have hurt their friend in such a cruel and heartless way?</p>\n<p> </p>\n<p>Izuku continued sobbing into the purple haired boy's shoulder for a while, before he simply...stopped.</p>\n<p> </p>\n<p>He didn't have any tears left to cry.</p>\n<p> </p>\n<p>'<em>How could they have done that... After all I did for them...',</em> </p>\n<p> </p>\n<p>After a while Midoriya tried standing up on wobbly feet, Todoroki and Shinsou steadying him.</p>\n<p> </p>\n<p>He heard another voice speak up.</p>\n<p>\"M-Midori-\"</p>\n<p> </p>\n<p>\"Don't touch him!\" Hitoshi screamed.</p>\n<p> </p>\n<p>\"Don't any of you <strong>dare</strong> come any closer to him!\"</p>\n<p> </p>\n<p>Aizawa, and Sir Nighteye halted in their tracks at the look of pure hate the two boys were giving them. </p>\n<p>Aizawa still tried taking a step forward. \"Listen-\"</p>\n<p> </p>\n<p>In less than a second, the floor was covered in ice and all the police officers and teachers were stuck in it.</p>\n<p>\"If any of you ever dare come any closer to him, you'll see who real villains are.\"</p>\n<p> </p>\n<p>Todoroki leveled them with a glare colder than his ice, hostile and unforgiving, before the kids turned on their heels and started walking away towards the entrance of the police station, leaving everyone else behind.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Outside, the trio walked towards a white car. </p>\n<p>The front door of it opened and Present Mic came out.</p>\n<p>\"Hey, hey, how is he feeling?\" the blonde haired man asked Shinsou and Todoroki once he saw the unresponsive state Midoriya was in. Those blank eyes and stiff posture... It scared him to no end to see one of his brightest students like that. </p>\n<p> </p>\n<p>Shinsou and Todoroki merely shook their heads, but otherwise remained silent. </p>\n<p> </p>\n<p>With a pained sigh, Yamada led the trio towards the car, Todoroki sitting in the passenger seat, while Hitoshi and Izuku remained in the back seats. </p>\n<p>Starting the car, they drove off back towards U.A. and to the dorms. </p>\n<p> </p>\n<p>\"H-Hitoshi...?\" Midoriya stuttered out somewhere during the ride. Instantly, the mind quirk user's attention was on him and he squeezed the boy's hand. </p>\n<p>\"Izuku, how are you feeling?\" </p>\n<p> </p>\n<p>The greenette's gaze drifted away as his mind kept replaying what happened. </p>\n<p>\"They... They think... I'm not...\" </p>\n<p> </p>\n<p>Putting his arms around him, Shinsou squeezed Izuku comfortingly whilst carding a hand through the forest green locks. </p>\n<p>\"It's okay Izuku... I know... It's going to be okay...\" </p>\n<p> </p>\n<p>'<em>Hopefully</em>...', he silently added in his head. </p>\n<p> </p>\n<p>Occasional hiccups were the only thing that could be heard in the car as they came closer to the school, and by the time the car stopped right in front of it, it was completely silent. </p>\n<p> </p>\n<p>Carefully so as not to scare the green haired boy, Hitoshi took his hand and climbed out of the car, not letting go even when they came to stand in front of Heights Alliance. Todoroki was standing on the other side of Midoriya, and Present Mic already said goodbye to the three of them, promising to visit later. </p>\n<p> </p>\n<p>\"Are you ready?\" Shouto quietly asked, squeezing his friend's hand reassuringly when the other hesitated. </p>\n<p>\"We'll go straight to your room, okay?\" Hitoshi promised and pushed open the door. </p>\n<p> </p>\n<p>Their steps were silent, but not intentionally so. Either way, nobody noticed them at first. </p>\n<p> </p>\n<p>Tsuyu was the first one. </p>\n<p>\"Midoriya-chan, Shinsou-chan, Todoroki-chan, how are you?\" </p>\n<p> </p>\n<p>Shouto and Hitoshi shrugged and glanced at Midoriya, who hasn't budged even after being addressed. But after Todoroki motioned with his head upstairs, she stood up and made her way over to the males, and together they continued their way upstairs towards Izuku's room. </p>\n<p> </p>\n<p>\"Hey guys! What's up?\" Ashido asked as she came around the corner, Kirishima, Sero and Kaminari with her. </p>\n<p> </p>\n<p>Todoroki almost punched his classmates at the question. </p>\n<p>\n<em>How dare they ask something like that after what they did? </em>\n</p>\n<p>They group was casting nervous glances at Midoriya, clearly not aware that he was innocent. </p>\n<p>The half white half red haired teen was just about to retort something, when Shinsou unexpectedly spoke up. </p>\n<p> </p>\n<p>\"Good. And you?\" </p>\n<p> </p>\n<p>\"Oh, we're\" - before Mina could continue, her eyes glazed over and her face went completely slack. </p>\n<p>\"Leave\", Hitoshi commanded, her friends watching helplessly as she turned on her heels and walked into the direction from which she came from. </p>\n<p>\"Hey man, no need to be so-\" </p>\n<p> </p>\n<p>\"What rude? Why shouldn't I, after what you did?\" Shinsou's eyes narrowed, glinting dangerously at Kaminari and his other two friends. </p>\n<p>\"Listen, what should-\" Kirishima was the next one to fall under the purple haired teen's control, and just like Mina, Shinsou commanded the red haired teen to leave. </p>\n<p> </p>\n<p>This left Sero and Kaminari alone with Hitoshi and Todoroki. </p>\n<p>Tsuyu already went ahead with Midoriya and brought him to his room. </p>\n<p> </p>\n<p>\"What the hell is up with you guys?! Just because you can't come to terms with the fact that Midoriya is the traitor doesn't mean you can use your quirk on our friend!\" </p>\n<p> </p>\n<p>\"Midoriya is not the traitor\", Shouto calmly told them, but his eyes were burning with anger. \"Now I suggest you leave right now, or my face won't be the only one with a scar on it anymore.\"</p>\n<p> </p>\n<p>Scoffing in disbelief, Kaminari and Sero left but not before turning back to them one last time. </p>\n<p>\" Don't come crying to us when you find out Midoriya really is the traitor. \"</p>\n<p> </p>\n<p>\" We won't\", Shouto spoke without hesitation. </p>\n<p> </p>\n<p>\"Because he isn't. It's quite sad to think that people he loved and cherished are turning their backs on him because of some stupid rumor, isn't it?\" Hitoshi retorted, eyes flashing in cold amusement. </p>\n<p> </p>\n<p>\"But it was Aizawa-sensei who told us, and besides, everyone else thinks that as well! Don't you think it's strange how he always analyses our quirks and writes their weaknesses down? Or maybe that all that bone - breaking is for keeping up his good boy act?! \"</p>\n<p> </p>\n<p>\" Sure, whatever you say \", Shinsou chuckled humorlessly and turned around, walking away. </p>\n<p> </p>\n<p>The blonde and black haired boy both also went to go back to where Kirishima and Ashido were, but Todoroki stopped them. </p>\n<p> </p>\n<p>\" One thing, Kaminari, Sero\", he said, turning around and smiling coldly, which seemed so wrong on the other's face.</p>\n<p> </p>\n<p>\"Don't regret it when Midoriya won't ever trust you again.\"</p>\n<p> </p>\n<p>And with that he turned around and left, not once looking back. </p>\n<p> </p>\n<p> </p>\n<p>Aizawa prided himself in being exceptionally observant. </p>\n<p> </p>\n<p>During his younger years, some kids liked tormenting him after school, behind the building where no one saw, and to be sure none of them followed him on his way home, Shouta always tried keeping an eye out for them and dissappear before they had the chance to corner him. </p>\n<p> </p>\n<p>It had gradually morphed into a habit, an incredibly helpful one, might he add, especially for underground work where stealth and awareness of surroundings extremely mattered. </p>\n<p> </p>\n<p>Changes in the atmosphere, approaching presences, shifts in behavior, underlying character traits, signs of lies and deceive and possible fears, phobias and weaknesses. </p>\n<p> </p>\n<p>He noticed everything. </p>\n<p> </p>\n<p><em>Especially</em> when it came to his new class, full of energetic kids. They had potential, and Shouta made sure to keep an eye on anything that could help him assist them in becoming good heroes. </p>\n<p>What better way to do that than by figuring out their habits and strength, as well as possible disadvantages caused by the nature of their quirk?</p>\n<p> </p>\n<p>Whenever something was up with one of them, he knew right away. </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>... and then he saw Midoriya's notebook and suddenly, he didn't know shit.</p>\n<p> </p>\n<p>Essentially, he wasn't one to look through his student's stuff, because everyone was allowed some privacy and it really hadn't been any of Aizawa's business what they were doing in their free time, he was only there to provide help with hero studies after all. </p>\n<p> </p>\n<p>\n<em>(That, of course, a blatant lie, he felt more like a babysitter or caretaker rather than a teacher taking care of his students..) </em>\n</p>\n<p> </p>\n<p>But then there'd been the title of this notebook, and his interest had been caught. </p>\n<p> </p>\n<p align=\"center\">\n<strong>\"Hero Analysis Notebook for the Future N° 15\"</strong>\n</p>\n<p> </p>\n<p>Wait... <em>Number 15?</em></p>\n<p> </p>\n<p>\n<em>Did he have more of those books? </em>\n</p>\n<p> </p>\n<p>Least to say, he knew Midoriya was a little bit of a... weird kid. He was bright, there was no doubt, and selfless and kindhearted but also never listened to anything authorities told him. </p>\n<p>Shouta didn't mean to sound offensive, he knew nothing about the kid's past and didn't want to force him to talk, but whatever it was must have been at least the tiniest bit messed up. </p>\n<p> </p>\n<p>And when he looked at the notebook, and realized that it was Midoriya's, <em>aka. problem child's</em>, he couldn't help but take a small look at what could be hidden inside. </p>\n<p> </p>\n<p>His face morphed from curiosity to shock, then horror. </p>\n<p> </p>\n<p>As he looked through the notes, turning each page and skimming over the information provided on those, where different hero's quirks were broken down into different sections, such as strengths, weaknesses, advantages, disadvantages, weak points, how to best take them down, and how to improve the weak points, he almost felt sick. </p>\n<p> </p>\n<p><em>This</em> was what he was doing?! </p>\n<p> </p>\n<p>And oh god, there even were pages about his own classmates, friends, and various methods on how their quirk worked and so much more. </p>\n<p> </p>\n<p>This was... a <em>child</em> had supposedly written this? </p>\n<p> </p>\n<p>Dear god what did he <em>do</em> with all this information?! </p>\n<p> </p>\n<p>He wasn't even sure trained analysts were able to provide a spectrum this bright on their opponents and all various tactics to disable them. </p>\n<p> </p>\n<p>Midoriya... <em>problem child</em>... This was <em>his student</em>, but <em>what the hell? </em></p>\n<p> </p>\n<p>He turned the next page to come face to face with the smiling face of Uraraka in her hero costume, and as he read through the information, he didn't see a student analyzing their friend's and teacher's quirks to help them, he saw a dangerously intelligent person potentially selling that information to villains.</p>\n<p> </p>\n<p>\n<em>How had he not seen it before?</em>\n</p>\n<p> </p>\n<p>\n<em>How could he let something like this slip from under his watchful eyes? </em>\n</p>\n<p> </p>\n<p>He'd mentioned before, Midoriya was a strange kid, and as much as he wanted to believe that all this bravery and hero-like behavior was genuine... what if it wasn't? </p>\n<p> </p>\n<p>\n<em>What if it was all a facade to make everyone trust him? </em>\n</p>\n<p> </p>\n<p>He always helped and helped and gave and gave and gave and—</p>\n<p> </p>\n<p><em>How could he have been so stupid?</em>!</p>\n<p> </p>\n<p>The first time they had a teachers' conference about there being a traitor in this school, Aizawa had wanted to deny it, because all of his students, whom he hadn't expelled, had potential to become great heroes. <em>((Let's not talk about Mineta though, because what the fuck was he thinking when letting this person pass?)) </em></p>\n<p> </p>\n<p>For God's sake, he had almost expelled Midoriya on his first day but didn't, because he deemed him worthy of being able to accomplish more and master bis quirk properly. </p>\n<p> </p>\n<p>And now that he thought about it, wasn't it a bit suspicious that this kid has had so little control over their own quirk? </p>\n<p> </p>\n<p>'<em>I should have expelled him...</em>', Aizawa bitterly thought.</p>\n<p> </p>\n<p>But then again...maybe he was wrong and Midoriya wasn't the traitor.... </p>\n<p> </p>\n<p><em>No</em>, the logically thinking part of his brain told him. </p>\n<p> </p>\n<p>Whatever Midoriya was hiding, he should bring this case to Nedzu and discuss everything. </p>\n<p>Either way, Izuku's chances of not being the traitor were slim, considering all this... evidence. </p>\n<p> </p>\n<p>But he wouldn't judge yet, not until Nedzu told his opinion at least. </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>\"Are you sure we should just assume it's him without even having any clues?\" Yamada carefully asked. </p>\n<p> </p>\n<p>As much as he loved his bright husband, Aizawa was so close to just shaking some sense into the man. He was blinded by his fondness for Midoriya, that much was obvious.</p>\n<p> </p>\n<p>Even All Might, who had a suspiciously good relationship with the green haired boy, agreed that he could be the traitor without a second thought. </p>\n<p> </p>\n<p>\"Nobody had a heart of gold, everyone hides bad secrets. I guess this is the boy's secret.\" </p>\n<p> </p>\n<p>Nedzu nodded. \"I understand your hesitancy to believe what we are saying, Yamada-kun, but please consider it. This information is... should be more than simply classified, so how did he get hold of all this? And all things considered, I am quite concerned with what I read in this notebook, no matter his intentions with this.\"</p>\n<p> </p>\n<p>\"And besides...\" the principal trailed off, an unreadable expression on his face as he tucked his paws under his chin, seemingly in thought. </p>\n<p>\"What is it Nedzu-san?\" Aizawa asked, watching as said mammal shook his head slowly. </p>\n<p>\"There'd been a hero who debuted not too long ago, her name was Black Lotus. She was killed during her second mission last week.\"</p>\n<p> </p>\n<p>He remembered, it had been a huge thing after all, broadcasted all over the news in Japan. A young heroine with a promising quirk dies at the hands of three villains. </p>\n<p> </p>\n<p>But how did that fit in with what they talked about just now?</p>\n<p> </p>\n<p>\"In Midoriya-kun's notebook, he analyzed this lady's quirk, and seeing as he wrote the date when finishing the given entry, it has come to my attention that the entry was finished on Wendesday, which was...\" </p>\n<p> </p>\n<p>\"...two days before she died\", Shouta whispered in horror. </p>\n<p> </p>\n<p>That couldn't have been a coincidence, it was just...<em>too convenient. </em></p>\n<p> </p>\n<p>A pro hero debuted on Wednesday, with a big boom that would have made sure to skyrocket her popularity and probably even ensured her a place in the top twenty newcomer heroes, simply from the fact that at the right moment, there had been a villain with the right type of quirk, at the right place. Black Lotus' quirk had been meant for rescue work, naturally, since what it did was envelope people up to in a 50 m radius in a huge, shield-like black lotus. It looked like glass, the type you'd see on tinted car windows, but it was able to withstand even massive chunks of debris.</p>\n<p> </p>\n<p>Surprisingly, there had been an incredibly destructive villain on the loose, who made more than just a few buildings fall. But thanks to Black Lotus, all citizens survived, unharmed and well. </p>\n<p>She had been able to show everyone the best way her quirk could be used, and by the time she had reached her limit, the villain had long been apprehended and everyone was bought to safety. </p>\n<p> </p>\n<p>Then two days later she suddenly died during a fight with another villain, who had completely overpowered her and broke through the shield, even causing difficulties to other heroes that arrived at the scene and additionally killing over about eighty people. </p>\n<p> </p>\n<p>A disaster. </p>\n<p> </p>\n<p>... So What other explanation was there, other than someone having given information about her quirk to villains? </p>\n<p> </p>\n<p>Midoriya did an entry on her on the same day she debuted... </p>\n<p> </p>\n<p>It made too much sense... </p>\n<p> </p>\n<p>The whole situation with Midoriya was just <em>too damn convenient... </em></p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Nedzu continued after that. </p>\n<p> </p>\n<p>\"I skimmed through this notebook before calling you. It has All Might's quirk broken down completely on more than ten pages, explaining every little detail, including his injury, how it affected him, his weaknesses, fighting style, everything. This analysis goes far beyond just quirk studies, even if All Might would have told the boy about everything. Midoriya-kun searches for possible weaknesses everywhere, even going as far as personality-wise to make sure everything could be used against them.\"</p>\n<p> </p>\n<p>\"B-But\", Present Mic tried to argue, and Eraserhead was sure his hair started flowing at some point because one glance at him and Yamada shut up, though the look on his face clearly told Shouta that he didn't believe them. </p>\n<p> </p>\n<p>\"Yamada-kun, I want you to understand\", Nedzu sighed. \" This boy has analyzed the former number one hero's quirk in such detail I wouldn't even have been able to. Half of the information is based off of different websites with links to those sites and by the looks of it, they were more than a year old. Midoriya wrote down the date when he finished this analysis, which was roughly a few days before the entrance exam.\"</p>\n<p> </p>\n<p>Midnight and Snipe stiffened at the implication. </p>\n<p>\" And on the second day of the new school year, the League of Villains attacked USJ with the goal of killing All Might. This couldn't have been done without them knowing in detail how his fight with All For One affected him and what his exact time limit would be.\"</p>\n<p> </p>\n<p>\"It makes sense\", Midnight chimed in. \"When the heroes arrived at the scene and the League of Villains left, All Might was in need of Cementoss making a barrier so that no one would see him in his weak form. They came to USJ knowing that his public form wouldn't hold for much longer.\" </p>\n<p> </p>\n<p>At that, Aizawa's glare only intensified as he looked at the notebook that was in his hands. USJ has brought some lasting damage to him as well, with Shigaraki almost killing him and the Noumu having beaten him into the ground, it was why the thought of one if his student helping cause all of that made Aizawa seethe. </p>\n<p> </p>\n<p>\"Fuck this all!\" Hizashi shouted as he slammed his fists onto the table of the conference room, making Shouta look at him with wide eyes. Never had he seen his husband look anything even remotely close to how he looked right now. </p>\n<p> </p>\n<p>His eyes were glowing in fury, his face was scrunched up in anger he had never seen on the man before and his whole body was shaking. </p>\n<p>\"This boy, this child, is the purest and kindest soul I have ever had the pleasure of having as a student. He is bright, optimistic, hardworking and selfless, and you want to tell me he is supposed to be the infamous traitor?!\" </p>\n<p> </p>\n<p>\"Zashi listen-\" Aizawa tried but was immediately cut off. </p>\n<p> </p>\n<p>\"BULLSHIT!\" </p>\n<p> </p>\n<p>Everyone in the room, even Nedzu and All Might flinched at that. Yamada promptly walked up to the door before turning his head one last time and leveling them with a hard glare to the ground. </p>\n<p> </p>\n<p>\"I will not tolerate you thinking like that about him, colleagues, principal, or whatever! I'm going to tell him what you think and he'll prove to yo—\" </p>\n<p> </p>\n<p>\"Yamada-kun\", Nedzu  interrupted sternly, having gained his composure after the unexpected outburst. </p>\n<p> </p>\n<p>\"I understand that it is hard to believe... and I hope it will not come to this... but you are aware that if you tell Midoriya about this, it will be counted as aiding a possible suspect, and thus, will have your license revoked...\" </p>\n<p> </p>\n<p>The blond haired man stared at Nedzu in disbelief. </p>\n<p>\" Are you <em>threatening</em> me?\"</p>\n<p> </p>\n<p>\" No no, of course not, I wouldn't <em>dare</em> do something like that... but you understand that given the circumstances... your behavior will seem, how do I say... <strong><em>suspicious</em></strong>, and we wouldn't want to cause unnecessary trouble for U.A., wouldn't we?\" </p>\n<p> </p>\n<p>Yamada chuckled coldly and Eraserhead felt a shiver run down his spine at the behavior. </p>\n<p>\" Fine, Nedzu-san, have it your way. But don't come running back to him when the truth will come to light. \"</p>\n<p> </p>\n<p>He eyed all of them, turned to Aizawa and when their eyes met, it seemed as if the blonde man stared straight through the black haired male's soul, and not just at him.</p>\n<p> </p>\n<p>He abruptly turned around and slammed the door, leaving Aizawa and everyone else alone.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>The next day, when Midoriya came into class, Aizawa glared at the boy, observing his behavior, what he did, anything that could help in finding out if he was the traitor, but nothing seemed out of the ordinary.</p>\n<p> </p>\n<p>'<em>Of course</em>', the black haired male thought.'<em>If he really is the traitor, he should be good at hiding the traits that would give it away. And this boy is damn good at keeping everything to himself.'</em></p>\n<p> </p>\n<p>Aizawa thought the whole evening about how to get any clues on the case, pacing back and forth in his and Present Mic's apartment.</p>\n<p>His husband hadn't been home since the conference, most likely staying somewhere nobody would look for him. </p>\n<p> </p>\n<p>They hadn't even talked after yesterday... </p>\n<p> </p>\n<p>Truth to be told, he did understand why Yamada would refuse to believe Nedzu and everyone else. Midoriya looked like an optimistic, bright and selfless kid, therefore it wasn't such a wonder Hizashi had taken a liking to him. </p>\n<p>They were pretty similar in character. </p>\n<p> </p>\n<p>But he had to <em>understand</em>. </p>\n<p> </p>\n<p>As much as he didn't like the idea of this one kid being a villain, they had to include all options and outcomes. </p>\n<p> </p>\n<p>And if it meant suspecting and arresting Midoriya, then they would do so. </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>The next few weeks were hard. </p>\n<p> </p>\n<p>Not just physically, but emotionally as well. </p>\n<p> </p>\n<p>Aizawa tried to stay strong, but whenever they would see each other at school, Present Mic would completely ignore him and walk right past the black haired man. </p>\n<p>He hasn't come home even once, hasn't answered any of his texts and calls and wouldn't even as much as smile at the staff. </p>\n<p> </p>\n<p>Not to mention the additional stress surrounding the topic of when to arrest the boy and how. </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>... Midoriya was a whole other case. </p>\n<p> </p>\n<p>While Aizawa informed the class of the staff's suspicion, and he himself remained cold and indifferent to all of Midoriya's kind behavior, he noticed some changes after the first week. </p>\n<p> </p>\n<p>The first thing were the looks. </p>\n<p> </p>\n<p>Izuku had looked at him sometimes during the lesson, or when they would accidently see each other in the hallways, and always, always did the green haired boy look at him with big, helpless and sad eyes, before averting his gaze immediately and looking at the floor, or table, depending on the situation. </p>\n<p> </p>\n<p>And when the second week came by, he stopped looking at him altogether. </p>\n<p>It shouldn't have affected him the way it did, because Midoriya was most likely the traitor, he didn't deserve any kindness, but when he compared Midoriya before he found the notebook and the whole dilemma began - <em>sitting proudly and happy in his seat</em> - with the boy he saw in class now - <em>hunched in on himself, eyes glued to his desk, posture tense as if awaiting a blow</em> - he couldn't believe this was the same person. </p>\n<p> </p>\n<p> </p>\n<p>And it shouldn't have affected him. </p>\n<p> </p>\n<p>But he felt his heart ache. </p>\n<p> </p>\n<p>The longer he observed Midoriya, the more he noticed all the changes that happened in the weeks now. </p>\n<p> </p>\n<p>Whenever he saw him, his notebook was nowhere to be seen. </p>\n<p> </p>\n<p>His classmates also said that they haven't seen that book for a long time now. </p>\n<p> </p>\n<p>He stopped mumbling too. </p>\n<p> </p>\n<p>By now, hearing Izuku mumbling during class while teaching had become natural, Aizawa would even go as far as to say that he could actually relax to it. He never really listened into what the boy was mumbling, but it just... </p>\n<p> </p>\n<p>It was there. Since their first day. </p>\n<p> </p>\n<p>. </p>\n<p> </p>\n<p>. </p>\n<p> </p>\n<p>. </p>\n<p> </p>\n<p>And then it wasn't. </p>\n<p> </p>\n<p>The only sound that could be heard was the clock ticking, nothing else, an unnerving silence filling the room. </p>\n<p> </p>\n<p>At first he looked completely dumbfounded, about to turn around to face his class and ask them where the boy was, but then he saw him in his seat. </p>\n<p> </p>\n<p>He was looking down on his desk, pen hovering over the paper but not actually writing anything. His posture was tense, looking ready to flee at any moment and his mouth most certainly wasn't forming a storm of muttered words. </p>\n<p> </p>\n<p>It was weird, and different, but he had shrugged it off, thinking it was a onetime thing, that tomorrow it would go back to the way it used to be. </p>\n<p> </p>\n<p>But then it didn't. </p>\n<p> </p>\n<p>After that day, he simply... stopped. </p>\n<p> </p>\n<p>He started questioning himself, 'What if Midoriya isn't the traitor?' </p>\n<p> </p>\n<p>Because despite the convenience of the situation, the evidence and the fact that all of it fit together like a puzzle, he had never seen or heard him do or say anything that would be a cause for suspicion. Of course the whole point of being a traitor is to be able to slip on a mask of innocence, but not even Midoriya could be able to act this good.... could he? </p>\n<p> </p>\n<p>The cause of this thought sprouting in his head was Midoriya's conversation with Present Mic that he overheard. </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>\n<em>\"Oh, uhm, Yamada-san! D-Do you have a little bit of time right now?\" Aizawa immediately stopped and hid around the corner as he recognized the voice. </em>\n</p>\n<p> </p>\n<p>\n<em>\"Sure thing, little listener! What's up?\" Present Mic cheerfully retorted. </em>\n</p>\n<p> </p>\n<p>\n<em>\"O-Oh uhm, it's just...\" He heard a zipping sound, maybe a bagpack being opened, then some shuffling, and then the zip being closed again. </em>\n</p>\n<p> </p>\n<p>\n<em>\"I have an entry on you in my hero analysis notebook, a new one I added because I put some additional notes to the original ones and w-well... I wanted to ask if you could, maybe, look through them and tell me what you think?\" </em>\n</p>\n<p> </p>\n<p>\n<em>Aizawa froze. </em>\n</p>\n<p> </p>\n<p>\n<em>Weren't those notebooks supposed to be classified information? Why did he want to show it to a teacher? </em>\n</p>\n<p> </p>\n<p>\n<em>\" Sure thing little listener! I heard you have quite the talent in analyzing!\" he heard Hizashi's voice , but Shouta already stepped away and went to inform Nedzu of what he heard. </em>\n</p>\n<p> </p>\n<p>Why would he...? </p>\n<p> </p>\n<p>Had he been wrong after all...? </p>\n<p> </p>\n<p>Going to Nedzu didn't change anything in the end. </p>\n<p> </p>\n<p>'<em>He could have shown it in hopes of Yamada-kun correcting and adding even more details, which would give the League of Villains an even bigger advantage, given that all this information had come from an original source</em>', the principal had said, and <em>shit, that made sense too. </em></p>\n<p>For all they knew, it could have also been incomplete, so as not to raise any suspicion about the amount of details. </p>\n<p> </p>\n<p>Aizawa was conflicted, wasn't so sure about that anymore, but didn't try to stop them. </p>\n<p> </p>\n<p>Now that he thought about it, he should have...</p>\n<p> </p>\n<p>The third week came around quickly and Nedzu had planned to take Midoriya to interrogate him after his lesson with Hizashi, much to the blonde's dismay. </p>\n<p> </p>\n<p>He had protested against it, saying he would never let the boy be taken as long as he was there, but he couldn't do anything against the principal. </p>\n<p> </p>\n<p>Aizawa had a bad feeling about it. </p>\n<p> </p>\n<p>All Might was already at the police station too, Nedzu and Sir Nighteye as well. </p>\n<p>\"I told you choosing this boy was a mistake\", he heard the former sidekick say in a cold voice, but he payed little attention to what they were talking about. </p>\n<p>Instead he was focusing on what would happen in a bit. </p>\n<p>Midoriya was going to be brought here, interrogated and most likely, as Nedzu said, locked in a cell where it would get revealed that he was, indeed, the traitor. </p>\n<p> </p>\n<p>But he wasn't so sure anymore, and it made him nervous. </p>\n<p> </p>\n<p>If they were wrong about their suspicion, the outcome... would be catastrophic. </p>\n<p> </p>\n<p>His initial panic and anger and fear had passed after some time, when observing the changes in Midoriya's behavior, his habits, posture, gestures and the way he acted around others, and by no means, did that look like a possible traitor. </p>\n<p> </p>\n<p>Midoriya's notebook had been with him during the whole time, and when rereading it again to try and see how exactly they had come to the conclusion that he was the traitor based on a single notebook, but he couldn't. </p>\n<p> </p>\n<p>The book was detailed, yes. </p>\n<p> </p>\n<p>He had a whole lot of information in it, yes. </p>\n<p> </p>\n<p>A horrific amount of possible weaknesses were described in them, <em>yes</em>. </p>\n<p> </p>\n<p>But then again... There were just as many ways to avoid those weaknesses written there. </p>\n<p> </p>\n<p> </p>\n<p>Eraserhead read and re-read the book again and again, trying to see what everyone, including him in the beginning, saw so dangerous, but he <em>couldn't</em>. </p>\n<p> </p>\n<p>He saw immense potential in the boy as an analyst and strategist, with how detailed those notes were. </p>\n<p> </p>\n<p>But it was too late to turn back now. </p>\n<p>There was still a chance he might be the traitor, and Nedzu seemed to believe that fullheartedly. </p>\n<p> </p>\n<p>So he let it be. </p>\n<p> </p>\n<p>It was quiet for some time, everyone waiting with baited breath for the police officers to arrive with the green haired boy, and when they finally did, it was a total chaos. </p>\n<p> </p>\n<p>The boy wasn't given a chance to look around, he was bluntly forced to sit on the chair in the interrogation room and then the door was closed, leaving him with a police officer. </p>\n<p> </p>\n<p>He wanted to look, wanted to see if there would be some changes in the boy's behavior, if he would admit to being the traitor or not but... He couldn't. </p>\n<p> </p>\n<p>He felt his students eyes on him through the glass, and all he did was clench his own shut and look away. </p>\n<p> </p>\n<p>He didn't think he could handle the boy's expression. </p>\n<p> </p>\n<p>And then the eyes dissappeared. </p>\n<p>Aizawa looked up slowly and saw the boy looking at the table with tears in his eyes as the officer began the interrogation, screaming questions at him without giving Midoriya a chance to reply. </p>\n<p> </p>\n<p>It wasn't pleasant to watch at all. </p>\n<p> </p>\n<p>The screaming went on for about two hours, with Midoriya breaking down into heart wrenching sobs and crying whilst still denying everything, then suddenly stopped moving or doing anything, appearing almost as if catatonic. </p>\n<p>The only indication that the boy was still conscious where the tears streaming down his dull eyes and the subconscious answers he gave, still denying everything. </p>\n<p> </p>\n<p>\"This-This is getting us nowhere!\" Shouta finally spoke up, trying to get the screaming to stop.</p>\n<p> </p>\n<p>At that exact moment, he saw Tsukauchi enter the police station, looking absolutely furious. </p>\n<p>The underground hero gulped, and only now did Nedzu and everyone else noticed the arrival of the detective.</p>\n<p> </p>\n<p>Fuck, how could they have forgotten about the detective who had a literal truth quirk?! </p>\n<p> </p>\n<p>\"Tsukauchi-kun-\" Nedzu turned to look at the man but was promptly cut off. </p>\n<p> </p>\n<p>\"What is this?\" his voice was stone cold, it was impossible to make out what he was thinking, but it definitely wasn't anything pleasing. </p>\n<p> </p>\n<p>Just as All Might stepped forward, trying to explain himself, Naomasa opened his mouth again. </p>\n<p>\"You don't have the right to lock this child in here without his parents agreeing to this, do you understand? You didn't have a single right to let him get interrogated for-\" he checked his wristwatch,\"two hours.\"</p>\n<p> </p>\n<p>Sir Nighteye turned to the detective. </p>\n<p> </p>\n<p>\"No, you keep your mouth shut! I am the specialist here, with a truth quirk, who knows how all this works, not you!\" </p>\n<p> </p>\n<p>He came closer and stood directly in front of Toshinori, glaring at him with all his might, but the words were meant for everyone in this room here. </p>\n<p> </p>\n<p>\" If Yamada hadn't called me, would you have even thought of calling me instead of screaming answers out of him? He is a child, for god's sake! You do not have the right to treat him as you would treat a criminal, a real villain!\" </p>\n<p> </p>\n<p>He sighed and turned to the door, about to open it.\" I do not know all the details, but I do know that if you have damaged this child in any way by this bullshit you caused, I will personally hand over all information I know about all of you to the League of Villains. And did you forget about who exactly Midoriya-kun is? Specifically, who he is to Eri? \"</p>\n<p> </p>\n<p>\" She will be seething once she finds out what professional heroes did to the person who risked his life to save her, the person who was <em>her</em> hero. \"</p>\n<p> </p>\n<p>And then he was inside the room, having kicked out the police officer who had still been screaming at the boy. </p>\n<p> </p>\n<p>Aizawa felt his stomach drop. </p>\n<p> </p>\n<p>Seeing Tsukauchi like this...he couldn't say much except that he believed him wholeheartedly. </p>\n<p> </p>\n<p> </p>\n<p>But why was the man so sure the boy wasn't a traitor? Hadn't he considered the possibility? </p>\n<p> </p>\n<p>Shouta watched the man ask Izuku the same questions but calmer and more composed, a kindness in his voice that hadn't been there before. </p>\n<p> </p>\n<p>And then, they were finished. </p>\n<p> </p>\n<p>Just like that. </p>\n<p> </p>\n<p>Aizawa blinked and Tsukauchi was standing in front of him. Lips pressed together in a thin line and eyes glowing with restrained fury. </p>\n<p> </p>\n<p>\"I hope you are happy with what you've done\", he said and handed Aizawa the paper containing the crosses the detective made for every true answer. </p>\n<p> </p>\n<p>As he skimmed over the paper, all breath left his lungs and his eyes widened. </p>\n<p>'<em>Oh my god</em>', he thought as he realised what the detective meant. </p>\n<p> </p>\n<p>\" Aizawa-kun, what is it?\" Nedzu asked beside him, and all he did was hand over the papers, completely numb to his surroundings. </p>\n<p> </p>\n<p>\"We were wrong.\" </p>\n<p> </p>\n<p>Sinking to his knees, Aizawa grabbed a fistful of his hair and clenched his eyes shut. </p>\n<p>'<em>What have I done.... What have I done to my student...'</em></p>\n<p> </p>\n<p>He heard Nedzu talk, the police officer, Sir Nighteye and All Might were also saying something, but he couldn't make out any coherent words, the voices in his own head too loud. </p>\n<p> </p>\n<p>\"IZUKU!\"</p>\n<p> </p>\n<p>Looking up in shock, Shouta saw Shinsou and Todoroki come closer to them, a panicked expression on both their faces. </p>\n<p>He realised with a start that Izuku left the interrogation room and was standing with his head down, shaking slightly. </p>\n<p> </p>\n<p>Then his knees buckled and Aizawa made a move to reach out to the boy, to support his weight, do anything to to make this right. </p>\n<p> </p>\n<p>Shinsou and Todoroki reached him before he himself did. </p>\n<p> </p>\n<p>Aizawa knew there was no making this right. He failed his student, plain and simple. He failed him in all the possible ways he could fail a child and there was no sugarcoating it. </p>\n<p> </p>\n<p>Watching with a pained expression on his face as the purple haired teen wrapped his arms around Izuku before both sank to the floor, Todoroki following down with a hand on the green haired boy's back. </p>\n<p> </p>\n<p>Eraserhead heard the boy sob into his friend's shoulder, hands itching to do something to make it stop - <em>he had already caused Midoriya enough tears</em>-, before he just... stopped. </p>\n<p> </p>\n<p>It was completely abrupt, because all of a sudden, the tears stopped and what remained were the trembles in his body. </p>\n<p> </p>\n<p>'<em>He most likely doesn't have any tears left to cry...</em>', the black haired male realised bitterly, thinking back to how he had broken down in that room. They really fucked up. </p>\n<p> </p>\n<p>They fucked up beyond words.... Gulping to get the knot in his throat to lessen, he remembered his husband's words, saying not to regret it now. </p>\n<p> </p>\n<p>Oh how he wished he could have turned back time to make everything right again. </p>\n<p> </p>\n<p>Then they wouldn't be here, they would be in class, Midoriya's mumbling accompanying Aizawa's own words, no tension in the atmosphere whatsoever. </p>\n<p> </p>\n<p>And <em>oh shit</em>. </p>\n<p> </p>\n<p>The class. </p>\n<p> </p>\n<p>'<em>Fuuuuck</em>', Aizawa ruffled his hair and almost let out a scream when he thought about it. </p>\n<p> </p>\n<p>How would his class react to him not being the traitor? </p>\n<p>He had seen how distant they'd become with Midoriya, if anything, they would feel worse than dirt upon realising that blindly trusting their teachers led to something as devastating as that. </p>\n<p> </p>\n<p>When he heard shuffling, Shouta watched as Hitoshi and Izuku rose to their feet, ready to leave. </p>\n<p> </p>\n<p>He couldn't. </p>\n<p> </p>\n<p>They couldn't leave. </p>\n<p> </p>\n<p>He had to tell the boy sorry, it wasn't going to fix anything, but he had to know that Aizawa regretted it, he regretted it so fucking much. </p>\n<p> </p>\n<p>Taking a step forward, Aizawa reached out with his hand. \"M-Midori-\" </p>\n<p> </p>\n<p>\"DON'T TOUCH HIM!\" Hitoshi screamed.</p>\n<p> </p>\n<p>\"Don't any of you dare come any closer to him!\"</p>\n<p> </p>\n<p>Immediately ceasing his movements, Aizawa flinched back at the looks of pure hatred he received. </p>\n<p>Realising that he had not only lost the trust of his green haired student, but also the purple haired boy and half hot half cold quirk user, Shouta tried talking to them.</p>\n<p> </p>\n<p>\"Listen-\"</p>\n<p> </p>\n<p>In less than a second, the floor was covered in ice and all the police officers and teachers were stuck in it.</p>\n<p>\"If any of you ever dare come any closer to him, you'll see who real villains are.\"</p>\n<p> </p>\n<p>Todoroki leveled them with a glare colder than his ice, hostile and unforgiving, before the kids turned on their heels and started walking away towards the entrance of the police station. </p>\n<p> </p>\n<p>Amd Aizawa could do nothing more but watch them go, his feet stuck in the ice, hands itching run after the green haired boy and pull him into a hug, apologizing for every way he had failed the boy. </p>\n<p>'<em>Oh god, what have I done... What have I done...' </em></p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Walking towards the teacher's lounge felt like walking towards death itself, his heart cold and heavy, the guilt and shame of what he'd done weighing him down. </p>\n<p> </p>\n<p>He was an idiot, an egoistic asshole who disregarded the trust his student had in him just because of a notebook. </p>\n<p> </p>\n<p>A notebook that showed a young boy, who was terrified of his friends and teachers dying, analyzing quirks and writing possible improvements. </p>\n<p> </p>\n<p>\n<em>Why couldn't he have thought before acting so brash? </em>\n</p>\n<p> </p>\n<p>\n<em>Why couldn't he have put aside his suspicion for the sake of giving Izuku a reason to trust him?! </em>\n</p>\n<p> </p>\n<p>Aizawa choked a sob, not bothering to wipe the tears streaming down his face as he saw the teacher's lounge come into view. </p>\n<p> </p>\n<p>\n<em>Why couldn't he have been the teacher Izuku deserved? Instead of cherishing the boy's trust, he obliterated all of the pieces he shattered in the first place.</em>\n</p>\n<p> </p>\n<p>He was never going to trust again. </p>\n<p> </p>\n<p> </p>\n<p>He won't ever feel safe again at U.A. </p>\n<p> </p>\n<p> </p>\n<p>He won't ever bother him with a problem, just because he'd think Aizawa couldn't listen. </p>\n<p> </p>\n<p> </p>\n<p>\n<em>He would never feel safe around his classmates again. </em>\n</p>\n<p> </p>\n<p>...</p>\n<p> </p>\n<p>\n<em>What have I done indeed... </em>\n</p>\n<p> </p>\n<p>It was quiet in the hallway, reminding Aizawa of the quiet before the storm as he stood directly in front of the teacher's lounge. </p>\n<p>He looked horrible no doubt, but he could care less. </p>\n<p> </p>\n<p>He had failed his student. </p>\n<p> </p>\n<p>He had failed a child. </p>\n<p> </p>\n<p>\n<em>He had failed, failed in every way possible, failed with no hope left to repair what he'd done, failed so—</em>\n</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>He pushed open the door and entered, feeling all eyes immediately turn to him. </p>\n<p> </p>\n<p>\"Shouta! How did it go?\" Midnight was the first to speak up, wondering if the boy had been arrested yet. </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>But then she looked closer at her friend's appearance. Disheveled hair, tear tracks on his cheeks, eyes glued to the floor, and she knew right away that something bad had happened. </p>\n<p> </p>\n<p>\" Aizawa, what happened?\" Cementoss asked worriedly, everyone else shuffling closer too. </p>\n<p> </p>\n<p>The black haired male sighed and and looked up with regretful and pained black eyes trained on every single one of them. </p>\n<p> </p>\n<p>\"Midoriya is innocent, he's not the traitor.\"</p>\n<p> </p>\n<p> </p>\n<p>. </p>\n<p> </p>\n<p>. </p>\n<p> </p>\n<p>. </p>\n<p> </p>\n<p> </p>\n<p>Every and all noise ceased in the room. </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>It got so quiet you could hear a pin drop, everyone frozen in their places. </p>\n<p> </p>\n<p>The news delivered were like a bomb being dropped, and everyone was sure they didn't hear right. </p>\n<p> </p>\n<p>\"S-Sorry Shouta, come ag-again?\"Midnight mumbled, face rapidly draining of any color as she stumbled back at the words. </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>\" Midoriya.... we failed him. He's not U.A.'s traitor. \"</p>\n<p> </p>\n<p> </p>\n<p>It was completely quiet in the teacher's lounge.</p>\n<p>Everyone was frozen in place as if catatonic upon hearing Aizawa repeat himself.</p>\n<p> </p>\n<p>The silence was only broken by the sound of someone choke on a sob, and even that was abruptly interrupted by the door being slammed open.</p>\n<p> </p>\n<p>Aizawa was afraid to turn around, he was terrified of seeing the person's expression, because without knowing who actually just threw open the door, he knew it was his husband.</p>\n<p> </p>\n<p>And he was proven right, when Midnight painfully stiffened when she saw the person behind him, and everyone else in the room tensed as well, as if expecting the blonde hero to explode on them and go haywire.</p>\n<p> </p>\n<p>With his rather loud personality and repeated conflict because of his unwavering trust in Midoriya, Shouta wouldn't have been surprised if Yamada started shouting at them, activating his quirk on purpose just so the words would be painfully clearer to understand. </p>\n<p> </p>\n<p>Stillness was what they were met with instead.</p>\n<p> </p>\n<p>Slowly, afraid of looking, Aizawa dared cast a glance at Yamada, but the moment he did, flinched back as if burned.</p>\n<p> </p>\n<p>Because the man's expression was blank, <em>horrifyingly blank</em>, and his eyes were two cold chips of ice, piercing right through his heart.</p>\n<p> </p>\n<p>He looked like a soulless doll. </p>\n<p> </p>\n<p>'<em>What heart</em>', he heard himself question in the back of his head. '<em>If I managed to interrogate and accuse my student of something he wasn't, I truly am a heartless asshole</em>.'</p>\n<p> </p>\n<p>Every single person in the room was expecting something to happen, waiting for any kind of reaction, but nothing came. </p>\n<p> </p>\n<p>Those two dead eyes merely casted a glance at the people in the room, before turning away and paying them no further mind. </p>\n<p> </p>\n<p>Somehow, that felt worse than it'd have if Yamada actually leveled them to the ground with a nasty glare. Or better yet, six feet underground.</p>\n<p> </p>\n<p>Everyone watched mutely as Hizashi's ghostly quiet form seemingly floated over to his desk, grabbing his bag and returning towards the door. </p>\n<p> </p>\n<p>It was only then, right when he was about to leave, that Yamada finally spoke up. </p>\n<p> </p>\n<p>And then Aizawa wished he had just left quietly without even acknowledging any of them any further. </p>\n<p> </p>\n<p>\"I hope you rot in hell\", was all they heard before walking out, the words muttered with a voice matching his lifeless appearance, the door falling shut on it's own. </p>\n<p> </p>\n<p>Everyone had flinched at the words, hard, and it took a long while before Midnight cleared her throat. </p>\n<p>\"He-.... He's not the...traitor....?\" </p>\n<p> </p>\n<p>She was still in denial of the revelation. </p>\n<p> </p>\n<p>Just like many others, she had adored Izuku, seeing as he was such a kind and attentive boy, but then she heard the possibility of him being the traitor and, it made so much sense to her at the time, she regarded her student as nothing more than a threat. Kayama didn't even think to question herself, or look, really look at Midoriya and the way he had changed in the past weeks. </p>\n<p> </p>\n<p>And now she heard her friend, one of her longest and closest friends, getting across the message that '<em>Bitch, you fucked up</em>' in a kindly wrapped package called '<em>he's innocent'.</em></p>\n<p> </p>\n<p>She couldn't come to terms with this. </p>\n<p> </p>\n<p>She failed her student, not only in the responsibly and care like way, but in the usual business teacher student way. </p>\n<p>The thought of him being the traitor and the abject horror she felt at the time were enough to fail her best student. </p>\n<p>She had given him zero points in the assignment for god's sake! </p>\n<p>She had failed him in the test and look where that got her. </p>\n<p> </p>\n<p>Everyone else felt that way too, especially the heroes that had direct contact to Midoriya in terms of teaching his class. </p>\n<p> </p>\n<p>\"What now?\" </p>\n<p> </p>\n<p>It was Ectoplasm who asked. </p>\n<p> </p>\n<p>But Aizawa could do nothing more than merely shake his head. </p>\n<p> </p>\n<p>\"I don't know\", he whispered, and that was the full truth. </p>\n<p> </p>\n<p>He didn't know. </p>\n<p> </p>\n<p>He truly didn't know how to make this right.</p>\n<p> </p>\n<p>Everyone lowered their gaze, and no more words followed. </p>\n<p> </p>\n<p>. </p>\n<p> </p>\n<p>. </p>\n<p> </p>\n<p>Then suddenly, he heard fast footsteps coming the teacher lounge's way, and the door was thrown open a second time. </p>\n<p> </p>\n<p>Only that it wasn't another teacher or hero.</p>\n<p> </p>\n<p>It was Mirio. </p>\n<p> </p>\n<p>\"Aizawa-san, I'm so sorry for intruding, but I couldn't find anyone willing to explain to me for the last three hours why Midoriya-kun was dragged into a police car by a bunch of officers?! \"</p>\n<p> </p>\n<p>. </p>\n<p> </p>\n<p>. </p>\n<p> </p>\n<p>. </p>\n<p> </p>\n<p>...shit. </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Sir Nighteye, Nedzu and All Might were sitting in one of the rooms the police had offered them, not speaking a word. </p>\n<p> </p>\n<p>Both Mirai and Nedzu had guilt ridden expressions on their faces, but strangely enough, All Might didn't really seem affected by it.</p>\n<p> </p>\n<p>\"I'm giving up my hero license\", Sir Nighteye suddenly said, having taken off his glasses to rub his eyes just a few moments prior. </p>\n<p> </p>\n<p>\"Mirai-kun-\" </p>\n<p> </p>\n<p>\"Don't!\", he raised his voice, but instantly calmed himself and sighed tiredly. </p>\n<p>\"I was supposed to see he was innocent, I've had him under my wing for some time after all, and even if we started at the wrong foot, even I couldn't deny that he had what it took to become a good hero. Especially after he saved my life, I should have put more trust in him, not let everyone's suspicion cloud my mind .\" </p>\n<p> </p>\n<p>Even Nedzu couldn't say anything against that. He personally knew the boy had gotten his quirk from All Might, knew the lengths the boy would go to to save his friends, and yet when holding the notebook in his hands, carefully turning each page, his fear of the detailed descriptions causing his vision to tunnel. </p>\n<p> </p>\n<p>All Might had told him that he had told Midoriya about the origin of his quirk that time when the sludge villain attacked, which had been roughly ten months before the entrance exam. </p>\n<p> </p>\n<p>But Midoriya's notes on Toshinori's quirk were at least a year old, which was before he ever met the man, and that led to him thinking that he was incredibly smart, incredibly skilled in analyzing, and <em>incredibly dangerous. </em></p>\n<p> </p>\n<p>The additional notes and the whole entry itself had been finished way after the two met, but those little parts weren't as important as the actual analysis. And blinded by fear for his students, he had jumped to conclusions.</p>\n<p> </p>\n<p>Conclusions he didn't know how to make right again. </p>\n<p> </p>\n<p>And on top of that, there was the incident with Black Lotus, which he still couldn't explain, but to blame it on someone who could have helped the young deceased hero strengthen her weaknesses was foolish.</p>\n<p> </p>\n<p>In order to try and save a school, he had failed a student in all ways possible, had betrayed his trust and completely obliterated the meaning of what made a good principal. </p>\n<p> </p>\n<p>Casting a careful glance sideways, Nedzu wondered if All Might felt worse than he himself did. </p>\n<p> </p>\n<p>He probably did. </p>\n<p> </p>\n<p>Well, theoretically he should, but the look in his eyes seemed to imply otherwise, and the principal couldn't understand why. </p>\n<p> </p>\n<p>Wasn't Midoriya important to him? </p>\n<p> </p>\n<p>And yet right now, it didn't seem like it. </p>\n<p> </p>\n<p>Toshinori was calm, sitting with his gaze on the wall opposite to them, looking as if he didn't have a single care in the world and couldn't be bothered by the fact that he had suspected his own protégé.</p>\n<p> </p>\n<p>\"Toshinori-kun, aren't you... worried? About what will happen now?\" </p>\n<p> </p>\n<p>All Might didn't give any reaction to that, still looking strangely at peace, as if he didn't understand the consequences of his actions.</p>\n<p> </p>\n<p>Then he slowly turned his head to Nedzu. </p>\n<p> </p>\n<p>\"Why?\", he asked. \"What happened has happened, and if Midoriya isn't the traitor then he's not. We have done what was necessary after all, he doesn't have a reason to be upset about it.\"</p>\n<p> </p>\n<p>\"But All Might\", Mirai interjected, shocked at what he was hearing. \"Midoriya is your successor, how can you not feel guilty about suspecting him?\"</p>\n<p> </p>\n<p>Yagi's gaze drifted to his former sidekick's, making the other flinch back a little at the almost bored expression on his face. \" I'm afraid I fail to see what is so grave about that. It is <em>because</em> he is my successor that it doesn't matter.\"</p>\n<p> </p>\n<p>\"How can you say that?!\" Sir Nighteye shouted, anger and disbelief seeping into his voice. \"We are talking about Midoriya, your boy, your protégé, your—\" </p>\n<p> </p>\n<p>\"That's right\", the former number one hero interjected. \"He's my protégé, nothing more nothing less. I have seen potential in him as the next wielder of One for All, I don't care about him as a person.\"</p>\n<p> </p>\n<p>Sasaki and Nedzu felt as if they'd been dropped into cold water.</p>\n<p> </p>\n<p>... what? </p>\n<p> </p>\n<p>He didn't... care?</p>\n<p> </p>\n<p>\"Then why did you give your quirk to him and not Mirio?\" Sir Nighteye asked weakly, mortified at the man's words. </p>\n<p> </p>\n<p>He remembered the smile on his face when talking to Izuku, remembered those green eyes full of admiration and gratefulness staring back at him and laughing warmly. He remembered All Might storming into the hospital to see the other, asking if his boy was alright. </p>\n<p> </p>\n<p>And now he suddenly <em>didn't care</em> anymore? </p>\n<p> </p>\n<p>Had his worry even been real? </p>\n<p> </p>\n<p>Have his smiles been genuine?</p>\n<p> </p>\n<p>Sir Nighteye knew that his first impression towards Izuku had been anything but pleasant, but after the huge chaos surrounding Overhaul, he had seen that the boy a heart of gold. </p>\n<p> </p>\n<p>And still, that hadn't been enough to defend Midoriya from the avcusation of him being a traitor, worse yet, Sasaki agreed with them after seeing the notebook. </p>\n<p> </p>\n<p>And now that it was proven he was innocent, Mirai felt more like a failure than ever before. </p>\n<p> </p>\n<p>And hearing All Might, the hero he had so much respect of, talk about Midoriya as if it was okay to force him into a police car with handcuffs and interrogate him for about three hours, did not only fuel his anger at the other man, but his guilt too. </p>\n<p> </p>\n<p>Midoriya... didn't deserve any of that. </p>\n<p> </p>\n<p><em>They really... only caused more damage than did good to protect the rest of the students</em>.. </p>\n<p> </p>\n<p>\"I had assumed you already knew, both of you. Since my quirk would cause my successor to break their bones, it was better to choose a boy I don't know instead of your intern.\" </p>\n<p> </p>\n<p>Sasaki felt sick.</p>\n<p> </p>\n<p>Taking a shuddering breath, he clenched the fabric of his pants tightly between his fists. </p>\n<p> </p>\n<p>\" What about your behavior then? \", he whispered.\" What about your worry and your smiles and fear of something happening to him?\"</p>\n<p> </p>\n<p>\" That kid looks at me like I hung the stars. I needed someone to inherit One for All so it wouldn't lose its power, and as long as I keep my public appearance up around him, he'll do as I say. \"</p>\n<p> </p>\n<p>Sir Nighteye inhaled sharply, blinking his tears away and abruptly stood up, leaving the room without another word. </p>\n<p> </p>\n<p>The mammal sighed and lowered his gaze to the floor, moving to stand up as well. </p>\n<p> </p>\n<p>He was disappointed. </p>\n<p> </p>\n<p>For all that he should have been able to predict this outcome, what had just been said shocked even him. He was a genius, had an abnormally high IQ, and yet he felt like an utter fool. He would have never expected... </p>\n<p> </p>\n<p>\" As much as I respected you, Toshinori-kun, I am questioning your ability to teach my students if you think of Midoriya as nothing more but a puppet to play with as you'd like.\" </p>\n<p> </p>\n<p>With those words he left as well, leaving All Might alone in the room. </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Aizawa sighed as he observed the room. After Togata barged into the teacher's lounge like he did and asked that question, the underground hero had taken him into an empty classroom to explain everything. </p>\n<p> </p>\n<p>Mirio's expression was ranged from worry and anxiousness to anger, and Aizawa knew that if he told him everything now, it would be the last time the third year ever looked at him with respect. </p>\n<p> </p>\n<p>But the damage has been done and to take the first step into making everything right, he had to face the wrath of Midoriya's senpai. </p>\n<p> </p>\n<p>\"Aizawa-san, please, can you tell me what happened? I texted him about a hundred times but he hasn't even answered to any messages yet and nobody else was willing to say anything.\" </p>\n<p> </p>\n<p>Shouta looked down and rubbed his face with his hand. </p>\n<p> </p>\n<p>\"Mirio... What happened was a horrible mistake everyone, including me, made.\" </p>\n<p> </p>\n<p>\"W-What do you mean?\" he asked, not really following what the teacher was saying. </p>\n<p> </p>\n<p>A mistake?</p>\n<p> </p>\n<p>A <em>mistake</em> that included getting Midoriya handcuffed? </p>\n<p> </p>\n<p>Was he...handcuffed by mistake? </p>\n<p> </p>\n<p>But that was ridiculous! And in front of the whole school on top of that! </p>\n<p> </p>\n<p>So maybe he had been mistaken for someone? </p>\n<p> </p>\n<p>\"It was supposed to be a secret due to our... uncertainty on that matter, and only the teachers and Midoriya's class have been informed of our suspicion.\" </p>\n<p> </p>\n<p>\"What suspicion?\" Mirio asked, expression darkening a bit. Aizawa was talking around the bush, and it didn't take an idiot to see that he was guilty. </p>\n<p> </p>\n<p>\"... we weren't really sure about it, but after all the villain attacks on my class this year, there had been suspicions of a traitor being in U.A...\" </p>\n<p> </p>\n<p>Togata didn't need any more words to understand where this was going, and with growing horror he pieced everything together.\" No... \"</p>\n<p> </p>\n<p>He desperately hoped that it wasn't what he thought it was, but when Aizawa shut his eyes, he knew.\" I found one of Midoriya's notebooks about hero analysis, which were incredibly detailed, and-\" </p>\n<p> </p>\n<p>\"—you jumped to conclusions\", the blonde third year murmured. </p>\n<p> </p>\n<p>Aizawa could do no more than hang his head in shame. \"We did.\" </p>\n<p> </p>\n<p>\"And what about sir? Or All Might?\" Togata suddenly remembered, knowing for sure that those two must have tried defending his friend. Furthermore, how stupid and blind must those have been who believed <em>Izuku</em> was the traitor?! He was such a precious child, had a heart of gold, and selfless wasn't enough to describe his actions. He was a real hero, so why... </p>\n<p> </p>\n<p>Aizawa paled. </p>\n<p> </p>\n<p>Fuck. </p>\n<p> </p>\n<p>He forgot how close Sir Nighteye and Mirio were, and All Might... he must have known that him and Izuku were close... </p>\n<p> </p>\n<p>What was he supposed to say now? </p>\n<p> </p>\n<p> </p>\n<p>... apparently nothing, because the silence he gave in response was enough, and yet... Mirio couldn't believe that Sir would believe such bullshit. </p>\n<p>The man had seen how heroic and selfless Izuku was, hell, the boy had played a major part in the Shie Haissaki raid, even was the one to completely destroy Overhaul, and after all he'd done... </p>\n<p> </p>\n<p>His heart went out to his kouhai. </p>\n<p>No doubt did the whole case take a big toll on him. Mirio himself didn't know how he'd be able to live with the fact that people he was supposed to trust back stabbed him like that. </p>\n<p> </p>\n<p>'<em>No wonder he wasn't answering me...' </em></p>\n<p> </p>\n<p>After this, the only thing he could do was be there for the green haired boy and hope that everything would turn out alright... </p>\n<p> </p>\n<p>Exhaling shakily, Mirio turned on his heels and made his way over to the door.</p>\n<p> </p>\n<p>\"I...didn't expect U.A. to be like that, sir. And I didn't expect a highly respected person in Midoriya's eyes, such as yourself, to be blinded by whatever it was that made everyone jump to this conclusion. You of all people should have known that he would never do such a thing.\"</p>\n<p> </p>\n<p>Then he was gone and Aizawa was left alone yet again. </p>\n<p> </p>\n<p>'<em>Highly respected in Midoriya's eyes... '</em></p>\n<p> </p>\n<p>His eyes watered.</p>\n<p> </p>\n<p>\"<em>Shit</em>...\"</p>\n<p> </p>\n<p>Mirio's words were like a punch in the gut. </p>\n<p> </p>\n<p>He had known that the two of them had become good friends, and even if the third year's reaction was more than justified, he couldn't help but wonder... if Mirio, who hadn't known about any of this, reacted in such way, then what would his class say, who had shunned him after the teachers told them of their suspicion?</p>\n<p> </p>\n<p>He didn't want to know. </p>\n<p> </p>\n<p>He pulled out his phone anyway and texted Iida. </p>\n<p> </p>\n<p> </p>\n<p align=\"right\"><strong>Aizawa</strong>:</p>\n<p align=\"right\">Tell everyone to gather in 1-A's classroom</p>\n<p> </p>\n<p>He was about to send the message, but remembered Shinsou and Todoroki, and their reaction when they both came to the police station. No doubt where they with Izuku now, and since the two where the only ones, along with Tsuyu, who hadn't distanced themselves from him, it would be better if they stayed with the green haired boy. After all, they would already be in the known about the outcome. </p>\n<p> </p>\n<p> </p>\n<p align=\"right\"><strong>Aizawa</strong> :</p>\n<p align=\"right\">Except for Midoriya, Todoroki, Asui and Shinsou</p>\n<p> </p>\n<p> </p>\n<p><em>'...</em>' </p>\n<p> </p>\n<p align=\"right\"><strong>Aizawa</strong>:</p>\n<p align=\"right\">Please</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Mostly everyone from Class 1-A was gathered in the common room when Iida got a message from their homeroom teacher.</p>\n<p> </p>\n<p>\"Everyone, Aizawa-sensei told me to gather everyone in our classroom, so please bring Bakugou, Shouji and Aoyama and proceed to follow our teacher's instructions.\"</p>\n<p> </p>\n<p>\"Did he say why?\" Ashido questioned, having just come from the kitchen with a cup of juice in her hand.</p>\n<p>The blue head shook his head, and Yaomomo spoke up.</p>\n<p>\"Midoriya has been brought into the interrogation room, no? Maybe it's news about what happened?\"</p>\n<p> </p>\n<p>\"Do you think he'll get arrested?\" Hagakure spoke up, but Kirishima shook his head, an unusual expression of guilt on his face. </p>\n<p> </p>\n<p>\"I saw him earlier with Todoroki and Shinsou, they went upstairs.\"</p>\n<p> </p>\n<p>\"Hm, I guess we'll find out about what's going on in a bit anyway\", Kaminari commented, standing next to Sero as the two already made their way to the front door. However, Uraraka's question made them pause. </p>\n<p> </p>\n<p>\"Guys... What if Deku's not the traitor? Do you think he'd be upstairs if he was the traitor? \" she questioned, having a bad feeling about everything. </p>\n<p> </p>\n<p>After the teachers told them about the possibility of him being the traitor, she didn't want to believe it at first. Iida and her both thought it was ridiculous, but when she herself got a glimpse of the notebook he was writing in, she was overcome by fearby the entry on her. </p>\n<p>A whole page was dedicated to the fact that people needed to break her hands if they want her quirk to be disabled and that she could only use her quirk with her hands. </p>\n<p>It had terrified her to the point where she also started believing that maybe he was a traitor, that maybe he sold that information to villains. </p>\n<p> </p>\n<p>But now she had her doubts again, and even if the bigger part of her brain told her that she shouldn't trust him so easily, she couldn't help but include the possibility of Midoriya being innocent. </p>\n<p> </p>\n<p>But if he was....she couldn't dare even think of what would happen. </p>\n<p> </p>\n<p>\"Don't be stupid Uraraka!\" Mina exclaimed loudly, though there was something akin to nervousness in her tone. </p>\n<p>\"Everyone thought so, even the principal himself! And I don't think that our teachers would be wrong about something like that\", she added the last part, thoroughly convinced that if pro heroes believed it, she had to believe too. </p>\n<p> </p>\n<p>\"Let's just go guys\", Kirishima dragged down a furious Bakugou, who had become even more hostile towards everyone, especially Kirishima, over the past weeks. </p>\n<p>\"Come on Bakubro just calm down!\" </p>\n<p> </p>\n<p>\"Shut the fuck up you extra!\", he snarled and ripped his arm from the red head's hold, being the first one to leave through the door towards the school. </p>\n<p> </p>\n<p>Kirishima couldn't blame him...he would have acted the same way in Bakugou's place. </p>\n<p> </p>\n<p>Everyone else followed suite, but the feeling of uneasiness only grew the closer they got. </p>\n<p> </p>\n<p>When everyone sat down on their respective seats, they noticed the absence of three of their classmates. </p>\n<p> </p>\n<p>\"Has anyone seen Shinsou, Asui and Todoroki? Why didn't anyone call them too?\" Yaomomo questioned, pointing to the three empty seats. </p>\n<p> </p>\n<p>\"My apologies, Aizawa stated that Shinsou, Asui and Todoroki were not to be included in this meeting\", Iida answered, and right at this moment, their homeroom teacher entered the room. </p>\n<p> </p>\n<p>The atmosphere got heavy and suffocating, and nobody commented on how Aizawa looked worse than they'd ever seen him. They could clearly see that he'd been crying, and he looked like he'd aged about seven years in just a day, feeling that a small wind could knock him down. </p>\n<p> </p>\n<p>\"Thank you for calling everyone on such short notice\", Shouta sent a nod Iida's way, who only bowed his head and said that it was his duty as the class president. </p>\n<p> </p>\n<p>\"Pardon, but why are we here Monsieur Aizawa? And why aren't Shinsou-kun, Asui-chan and Todoroki-kun here too?\" Aoyama asked in confusion, and only got a sigh in response. </p>\n<p>That was when everyone noticed the extent of how <em>wrong</em> everything seemed. </p>\n<p>Aizawa sounded utterly defeated, ashamed even, and they didn't know why. </p>\n<p>\" Shinsou and Todoroki are with Midoriya at the moment\", he finally answered, but couldn't bring himself to lift his head, afraid of seeing their reaction to the news he's going to drop in a few moments. </p>\n<p> </p>\n<p>\"Wasn't Midoriya arrested?\" Kouda asked what everyone had been thinking. Even after Kirishima said he'd seen him back at the dorms, they thought that he got arrested quietly so no one would see. </p>\n<p>Maybe that was why they were called here.. </p>\n<p> </p>\n<p>\"Class\", the black haired male exhaled shakily. \"Midoriya... is not the traitor.\" </p>\n<p> </p>\n<p>Silence. </p>\n<p> </p>\n<p>It was as if everyone had stopped breathing altogether, and he was sure that he could hear the sound of a fly in the room. </p>\n<p> </p>\n<p>At least until a small explosion rang through the whole classroom. </p>\n<p> </p>\n<p>\"What a revelation\", Bakugou gritted his teeth, hands forming small explosions in his fury. </p>\n<p>He abruptly stood up, ignoring Iida's weak attempt at getting him to sit down, but his voice was quiet and hesitant, like he knew he had no right to say anything. </p>\n<p> </p>\n<p>\"Bakugou!\" Sero made a move to stand up and hold the other back from leaving, but the spiky haired boy whirled around and let out more sparks from his palms. </p>\n<p>\"Shut the fuck up! I told you, didn't I? That stupid Deku was too much of a soft crybaby to do anything!\" </p>\n<p>He turned and glared at everyone with his bright red eyes, which seemed to be glowing from the sheer anger he felt.</p>\n<p>\"And you, Shitty hair!\" Katsuki whirled around to glare at Eijirou coldly. \"I expected more of you, fucking coward!\" he scoffed and waltzed out the door, slamming it close with so much force, everyone wondered how the door hadn't broken down. </p>\n<p> </p>\n<p>But mostly, no one reacted to the blonde's outburst, too lost in their own thoughts. </p>\n<p> </p>\n<p>Uraraka was crying, as well as Ashido and Kirishima. </p>\n<p> </p>\n<p>Jiro, Kaminari and Momo were looking at their tables in horror, the realiy of what they'd done sinking in. </p>\n<p> </p>\n<p>\"Wh-What do you m-mean, sensei?\" Mina asked in between hiccups. \"Everyone was so sure about this, h-how...?\"</p>\n<p> </p>\n<p>She remembered Shinsou's and Todoroki's words from before, and couldn't help but let out even more sobs, hanging her head in shame and devastation.</p>\n<p> </p>\n<p>Midoriya was one of the friends she had cherished the most, yet they all started treating him as if he were diseased just because of what? Some teacher's words?</p>\n<p>She didn't even know what kind of notes Midoriya had been writing, and just because their teachers said there was a possibility, they immediately took that as a '<em>he is the traitor, be careful'. </em></p>\n<p> </p>\n<p> </p>\n<p>Kirishima knew very well that there wasn't any making this right. He was a failure, and as Bakugou said, a coward for not having stepped up to help Midoriya. </p>\n<p>From the start, he knew that Izuku couldn't be the traitor, because Bakugou was Midoribro's childhood friend, and Bakugou didn't believe Aizawa-sensei. </p>\n<p>He had wanted to cry out, scream at everyone to stop labeling him as a traitor, just because of someone's suspicion but... </p>\n<p> </p>\n<p>He realized that even his best friend Kaminari, as well as Mina and Sero believed Aizawa. That was the point where he chose to be a coward, and pretend he believed in those rumors. </p>\n<p> </p>\n<p>From that day where their homeroom teacher had said that, Kaminari and the others started treating Bakugou like an enemy as well. They would say that his quirk seemed to have melted his brain, or that maybe Bakugou was a villain as well, with how he behaved. </p>\n<p> </p>\n<p align=\"center\">\"<em>You're with us bro, right? We know what's right, and that explodo boy can go to hell!\" </em></p>\n<p> </p>\n<p>That was what they'd asked him. And just like the coward he was, Kirishima had grinned amd said that yeah, of course he was with them, while his heart was breaking. </p>\n<p> </p>\n<p>And Bakugou was right. </p>\n<p> </p>\n<p>He'd expected himself to have more pride as well. He also thought that he respected himself more, because wasn't he the one always shouting about manliness and friendship? </p>\n<p> </p>\n<p>But the way Bakugou said it. The fact that he expected more of him. He, Bakugou, who Kirishima had been trying to befriend since the first day. </p>\n<p>And after the revelation, now that it was out that Midoriya wasn't the traitor, he knew he could never look at himself with respect again. </p>\n<p>He could never stand tall and proud knowing that he did something like that. </p>\n<p> </p>\n<p>He could only hope he'd get  the chance to prove himself worthy of the green haired boy's friendship again. </p>\n<p> </p>\n<p>Glancing over at Uraraka and Iida, the red haired male couldn't help but grimace and feel his heart break even more, because the two had been one of the boy's best friends. And the expression on both their faces were downright miserable. </p>\n<p> </p>\n<p> </p>\n<p>Iida and Uraraka felt like failures as human beings and friends. </p>\n<p>Aizawa said Midoriya was innocent, which meant that every single instance where they had avoided him, or kept their eyes on him out of fear and suspicion had been nothing more than a mistake. </p>\n<p> </p>\n<p>As the class president, Iida was devastated. </p>\n<p>He'd had his doubt since the teachers told them about it, and he didn't want to believe that Midoriya was the traitor. </p>\n<p>But seeing as his whole life had been involved with trusting teachers and authority figures, he didn't think that Aizawa and everyone else could be wrong about that. </p>\n<p> </p>\n<p>And even if he would like to selfishly blame it on the teachers for making such a grave mistake, he couldn't, because he knew he was in the same boat as everyone else. </p>\n<p> </p>\n<p>After all, no one had forced him to distance himself from his friend, it had been of his own volition that he chose to do so. </p>\n<p>\"Iida-kun... We're such horrible people!\" Uraraka whispered in between sobs as she didn't even bother wiping away her tears.</p>\n<p>Apparently, she had been Izuku's first friend. </p>\n<p>He had trusted her so much, and she took that trust and ripped it to pieces by backstabbing him, instead of just asking about her entry in the notebook as she should have done. </p>\n<p> </p>\n<p>\"What's going to happen now, sensei?\" Kaminari quietly asked, wiping his own tears with his sleeves. </p>\n<p> </p>\n<p>\"I don't know, Kaminari\", Shouta told them for about the third time this day.</p>\n<p> </p>\n<p>Apologizing wouldn't be enough, but what should they do indeed... </p>\n<p> </p>\n<p>He really had to talk to Hizashi about this. </p>\n<p>The man hated him for sure, but he didn't know how to go on without his husband. </p>\n<p> </p>\n<p>\"I understand that this is very shocking right now, and you'll be excused from classes tomorrow, seeing as the staff will also take a break\", he explained and dismissed the class, heading straight out of the door without looking back. </p>\n<p> </p>\n<p>He knew that right now, he couldn't help his class, not when his own thoughts were in such disarray.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Inside of the classroom, everyone had reverted back to silence and was sitting in their seats with their heads down. </p>\n<p> </p>\n<p>How could they have failed so bad? </p>\n<p> </p>\n<p>Todoroki and Shinsou, as well as Asui and Bakugou ALL told them not to jump to conclusions, and to hear that from someone like Bakugou, it must have meant something. </p>\n<p> </p>\n<p>He knew Midoriya the longest and the best, despite their history together and if even he himself was saying that Midoriya was innocent, then it must have meant something. </p>\n<p> </p>\n<p>But they all decided to ignore that and still accuse their classmate and friend of something he wasn't. </p>\n<p> </p>\n<p> </p>\n<p>\"Guys\", Mina started. \"How are we going to make this right?\" </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>But nobody knew the answer. </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>They didn't know if they ever would. </p>\n<p> </p>\n<p> </p>\n<p> </p>"
}