{
  "id": "2623211",
  "url": "https://archiveofourown.org/works/2623211?view_full_work=true",
  "author": [
    "dawnstruck"
  ],
  "title": "Killing It",
  "rating": "Mature",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen",
    "M/M"
  ],
  "fandoms": [
    "Naruto"
  ],
  "relationships": [
    "Uchiha Sasuke/Uzumaki Naruto"
  ],
  "characters": [
    "Hatake Kakashi"
  ],
  "additional_tags": [
    "Humor",
    "mild crack",
    "Mild Angst",
    "Kakashi POV",
    "Ino and Hinata are fan girls",
    "Chapter 698 Spoilers",
    "中文翻译 | Translation in Chinese"
  ],
  "language": "English",
  "series": "",
  "published": "2014-11-16",
  "completed": null,
  "words": "9,169",
  "chapters": "1/1",
  "comments": "262",
  "kudos": "9,729",
  "bookmarks": "2,446",
  "hits": "77,838",
  "summary": "<p>A year after Jiraiya's death, a new Icha Icha volume gets published. Self-declared Number One Fan, Hatake Kakashi, grows suspicious, but keeps buying them anyway.</p>",
  "notes": "<p>This was totally not what I was planning to write. Because I wanted to focus on my essays or some more angst plot bunnies, but instead this was born today. And I like it that way.</p>\n<p>Edit: chikaraaa has taken the time to translate this into Chinese and you can read it here: http://chikaraa.lofter.com/post/1dcea402_b490d11</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>So, gay porn, huh? Yeah, don't know why anyone would read that either.</p>\n<p>Come follow me on <a href=\"https://dawnstruck.tumblr.com/\" rel=\"nofollow\">tumblr!</a></p>",
  "text": "<p>\n<span> </span>\n</p>\n<p align=\"center\">\n<span>“Writing fiction is … an endless and always defeated effort</span>\n</p>\n<p align=\"center\">\n<span>to capture some quantity of life without killing it.”</span>\n</p>\n<p align=\"center\">\n<span>Rose Wilder Lane</span>\n</p>\n<p>\n<span>Kakashi was aware that Minato-sensei only ever read the Icha Icha series so Jiraiya-dono would not be disappointed.</span>\n</p>\n<p>\n<span>In fact, Kakashi himself picked up that first random volume out of a mixture of extreme boredom, emotional trauma over losing his entire team one by one, and hoping for some sort of spiritual connection to his dead mentor.</span>\n</p>\n<p>\n<span>He had found the books among Minato-sensei's belongings, after Sandaime-sama had already sorted through them and picked out certain things to set aside, either because they were too valuable or too dangerous, or because he wished to preserve them as a keepsake for Minato and Kushina's son, once he was old enough to know the full story.</span>\n</p>\n<p>\n<span>Kakashi was told to keep whatever he liked, Minato would have wanted it that way. Considering that, as Jiraya's former sensei, Sarutobi-sama already owned his own set of the Icha Icha series, Kakashi found himself with a dozen well-read books.</span>\n</p>\n<p>\n<span>At first Kakashi told himself that reading them felt cathartic, made him feel closer to the people he had lost, just like talking to the Memorial did on his good days. Mostly he kept them for the stories that had never been written by Jiraiya-dono, but that were scribbled in the margins, etched into the pages.</span>\n</p>\n<p>\n<span>There, a splatter of soy sauce because Minato-sensei had often read while eating. A bend corner, a tiny rip, proof that the book had not always been handled with care. A sticky note used as a bookmark with a shopping list scribbled on it. A smiley face and leery 'Let's try this' next to the description of a more unusual sex scene.</span>\n</p>\n<p>\n<span>It took Kakashi a while to figure out that </span>\n<em>\n<span>that </span>\n</em>\n<span>had actually been written by Kushina and that she had subsequently used a pink marker to underline everything she wanted to try out. Sometimes that included fighting styles or ramen recipes mentioned within the plot, but was mostly limited to some </span>\n<em>\n<span>other</span>\n</em>\n<span> expertise.</span>\n</p>\n<p>\n<span>In the beginning, the realization that, out of the two of them, Kushina had definitely been the bigger Icha Icha fan had made Kakashi chuckle. Then the unbidden images of sensei and his wife actually doing any of the stuff Kushina wanted to try had made him blush.</span>\n</p>\n<p>\n<span>But after a while, Kakashi had started to enjoy the novels themselves. For all their violence and explicitness, the stories were engaging and rather philosophic, the language always tiptoeing that line between being brutally to the point and almost too flowery.</span>\n</p>\n<p>\n<span>Kakashi had never thought he'd be one for poetry, but then again he'd never thought he'd be reading erotica as a form of mourning.</span>\n</p>\n<p>\n<span>After half a year, he'd read all of Minato-sensei's book twice and had actually set up an extra shelf in his apartment to store them, the picture frame holding the photograph of his gennin team right in the middle.</span>\n</p>\n<p>\n<span>He'd thought about starting a third read-through when he noticed the poster in the window of the corner bookshop, bright orange letters declaring the long awaited arrival of the latest Icha Icha volume.</span>\n</p>\n<p>\n<span>Kakashi had bought it at once, just as he had with every following story. Minato-sensei had never read any of these, but he still felt the same connection. From that day forth, he was rarely seen without one of the paperbacks in his hand.</span>\n</p>\n<p>\n<span>Like his mask, they served as a barrier between him and the world. People underestimated a man who was constantly reading porn in public. But more than a just a shield, the books were his anchor, making him keep a hold of his past and his humanity.</span>\n</p>\n<p>\n<span>Furthermore, Jiraiya-dono was a filthy pervert and by now Kakashi wasn't far behind.</span>\n</p>\n<p>\n<span>But Jiraiya had been dead for almost a year now, and Kakashi felt strangely uprooted. He thought time would have healed his wounds by now, but instead the knowledge that there would be no more Icha Icha to revive fond memories had been like a punch to the gut.</span>\n</p>\n<p>\n<span>Yet there were other things to worry about, Akatsuki and war mostly, and so he simply started re-reading all his favorites.</span>\n</p>\n<p>\n<span>That was until now, when he was slouching down the street at a leisured pace and suddenly a voice called out for him.</span>\n</p>\n<p>\n<span>“Hatake-san!” The man sounded out of breath, and it took Kakashi a moment to pinpoint him before he turned around and saw actually saw the person, coming face to face with the elderly keeper of his favored bookshop.</span>\n</p>\n<p>\n<span>“Uemura-san,” Kakashi inclined his head, not quite a bow, but still a sign of respect. Uemura was always polite and friendly, and Kakashi had known him for sixteen years at this point. But for months now, he no longer had had a reason to go to the shop on a regular basis.</span>\n</p>\n<p>\n<span>“I just got the delivery,” Uemura said, catching his bearings again, though the run had obviously exhausted him. “And when I saw you passing by I thought you might want to know.”</span>\n</p>\n<p>\n<span>“Know what?” Kakashi asked, cocking his visible eyebrow.</span>\n</p>\n<p>\n<span>“It just hit the shelves,” Uemura replied, smiling broadly. “The new volume of Icha Icha.”</span>\n</p>\n<p>\n<span> </span>\n</p>\n<p> </p>\n<p>\n<span>Kakashi sat on his rooftop, soaking in the sun and skeptically staring down at the orange book in his hands.</span>\n</p>\n<p>\n<em>\n<span>Icha Icha Violence,</span>\n</em>\n<span> it read in the familiar font. </span>\n<em>\n<span>A Tale of Two Brothers.</span>\n</em>\n</p>\n<p>\n<span>There was, of course, a possibility that Jiraiya had already finished the manuscript before his death and that it was only being published now. However, it was far more likely, that the publishers had found some idiot to continue the series in order to rob people of their money.</span>\n</p>\n<p>\n<span>After all, </span>\n<em>\n<span>Icha Icha </span>\n</em>\n<span>had a huge fan base and Jiraiya-dono had been writing under an alias. Simply replacing him without telling anyone must've been an easy solution.</span>\n</p>\n<p>\n<span>But still, Kakashi felt the need to give it a try. Either to find out whether it was the real deal after all, or just so he could fuel his righteous anger.</span>\n</p>\n<p>\n<span>With some trepidation, he opened the first page and began reading.</span>\n</p>\n<p>\n<span> </span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Once upon a time, there were two brothers.</span>\n</em>\n</p>\n<p>\n<em>\n<span>They did not share blood or name, but they were of the same age and were brought up under the same roof, the same sun, the same beliefs.</span>\n</em>\n</p>\n<p>\n<em>\n<span>Both orphans, they had been given to a monastery to be raised by the monks and serve the gods.</span>\n</em>\n</p>\n<p>\n<em>\n<span>One of the boys, Satoru, was studious, obedient and quick to learn, but there was an arrogance to him that no one was able to rid him off, neither with praise nor with punishment.</span>\n</em>\n</p>\n<p>\n<em>\n<span>The other one, Noboyuki, oft did his best to complete his tasks as well as Satoru always did, but he was clumsy and easily distracted, though he meant no harm by it, so the monks were lenient with him, if exasperated.</span>\n</em>\n</p>\n<p>\n<em>\n<span>So then those boys were children, both with their flaws, as all humans have, whether it be the pious or the depraved. The monks taught them that they were a family, all the men in the monastery, and even more so, all the beings in the world, and that to harm one another was the most foolish crime. For if you hurt one of your own, you only hurt yourself.</span>\n</em>\n</p>\n<p>\n<em>\n<span>Despite all these teachings, Satoru and Noboyuki grew up thinking of each other as the closest of brothers, even if they never told anyone, not even each other.</span>\n</em>\n</p>\n<p>\n<em>\n<span>But what was worse was that, only a few years later, the two would grow into men that had hurt each other so often that each cruel word and every hard fist not only sliced into their brother's heart, but into their own as well.</span>\n</em>\n</p>\n<p>\n<span> </span>\n</p>\n<p> </p>\n<p>\n<span>It took Kakashi most of the evening to finish the whole book. He had not meant to read it so quickly, but he had been curious and the story had been engaging.</span>\n</p>\n<p>\n<span>The style of writing had been similar to Jiraiya-dono's, and he couldn't quite pinpoint whether it had been actually written by him, so he had kept reading to see whether at some point there would be a more or less obvious cut where a less skilled author had continued writing.</span>\n</p>\n<p>\n<span>But that never happened. The plot had been concise yet complex, the prose beautiful without going overboard.</span>\n</p>\n<p>\n<span>It had to have been written by Jiraiya, possibly his last work ever, and Kakashi had gone to sleep with the book on his nightstand and a melancholy smile on his face.</span>\n</p>\n<p>\n<span> </span>\n</p>\n<p> </p>\n<p>\n<span>Three months later, there was another one.</span>\n</p>\n<p>\n<span>Kakashi had spotted it in the shopping window all by himself and bought it immediately, though this time he was even more suspicious. Surely, even a prolific writer such as Jiraiya wouldn't have had several finished manuscripts lying around just like that?</span>\n</p>\n<p>\n<span>This time it was a version of </span>\n<em>\n<span>Icha Icha Paradise</span>\n</em>\n<span> and Kakashi deemed himself knowledgeable enough to recognize whether a sex scene had been written by Jiraiya or by some ripoff. He had a two day mission ahead of him, and all throughout he kept anticipating his return in order to start reading.</span>\n</p>\n<p>\n<span>The title, </span>\n<em>\n<span>A Deal with the Daitengu,</span>\n</em>\n<span> certainly hinted at a more fairy tale-like story, something Jiraiya had never favored before.</span>\n</p>\n<p>\n<span>After the mission, Kakashi handed in his report and then puffed away in a cloud of smoke before anyone could ask why he was in such a hurry.</span>\n</p>\n<p>\n<span> </span>\n</p>\n<p>\n<em>\n<span>Natsumi grew up a farmer's daughter, with the shadow of the mountain on her face and the stories of the Tengu that lived on it in her ear.</span>\n</em>\n</p>\n<p>\n<em>\n<span>Unlike the other children in the village, she had never felt intimidated by the frightening tales the old women told, and unlike Chieko-sama, the kindly miko, she never felt the need to make appeasing sacrifices either.</span>\n</em>\n</p>\n<p>\n<em>\n<span>Instead Natsumi spent her youth working to help her father maintain the farm, for his failing health had been taking its toll over the past few years.</span>\n</em>\n</p>\n<p>\n<em>\n<span>Natsumi had never been a great beauty, and the hard work had made her lean and wiry, callouses on her hands and feet, her skin sunburned and scarred from minor injuries. So to her it came as a surprise when, one day, the chief's son asked for her hand in marriage.</span>\n</em>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>Your father is old and weak,” Kichiro told her bluntly. “You would do well to accept my offer.”</span>\n</em>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>Never would I marry someone such as you,” she replied for he was proud and spoiled. As children, they had often quarreled and Natsumi had always won. Marrying him would feel like surrender. For a little while he might treat her like a prize and then as a possession.</span>\n</em>\n</p>\n<p>\n<em>\n<span>Natsumi was many things, but not docile and meek. She would not warm anyone's bed and bear their children in exchange for a roof over her head.</span>\n</em>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>You're worthless then and foolish,” Kichiro spat at her. “For your father will not live to see the next spring and then you will be all alone and poorer still. And then the Tengu will come for you!”</span>\n</em>\n</p>\n<p>\n<em>\n<span>Or I will come for the Tengu, Natsumi thought to herself, a half-formed idea in her head.</span>\n</em>\n</p>\n<p>\n<em>\n<span>For Tengu were smart creatures, fearsome, too, and strong.</span>\n</em>\n</p>\n<p>\n<span> </span>\n</p>\n<p> </p>\n<p>\n<span>Kakashi's eyes were glued to the pages.</span>\n</p>\n<p>\n<span>Greedily, he read all about how Natsumi said goodbye to her father and set out to climb the mountain in order to find the dangerous Tengu. How he almost killed her, on a whim, but how she fought back and yelled and railed and demanded he take her as an apprentice. How he relented, intrigued, and took her into his lair. How he promised to teach her how to breathe fire, but asked for a kiss in return. And how for every lesson he asked for a little more, the smell of her hair, the soft skin on the insides of her wrists, till she had grown strong and he had tasted every bit of her.</span>\n</p>\n<p>\n<span>By the end of winter, he had fallen in love with her and she with him, but he let her go to return to her father.</span>\n</p>\n<p>\n<span>Natsumi had made her way down the mountain and back into the village, only to find that her father had already passed away, taken by sickness just a few weeks ago. Once more the chief's son had offered to marry her out of pity, but she had lashed out and nearly killed him, and the other villagers chased her away in fear.</span>\n</p>\n<p>\n<span>Without a home to call her own, she had meant to return to the Tengu, only to find that a horrible blizzard had consumed the mountain. Yet she fought her way through, nearly dying in the attempt, but never giving up.</span>\n</p>\n<p>\n<span>When they finally found each other again, it turned out that the storm had been caused by the Tengu himself, the turmoil of his emotions escaping into the outside world, a living proof of the regret he felt at letting her go without a word.</span>\n</p>\n<p>\n<span>And then she had known, known that he loved her like never anyone had loved before, and from that day on she never left again.</span>\n</p>\n<p>\n<span>The children of the surrounding villages still grew up in the shadow of the mountain, with the fearsome tale of the Summer Child and her Tengu lover in their ears.</span>\n</p>\n<p>\n<span> </span>\n</p>\n<p> </p>\n<p>\n<span>Days later, Kakashi was still thinking about the book when he went to meet Gai for lunch. He was already late, of course, but was given an additional excuse when he was waylaid by Yamanaka Ino.</span>\n</p>\n<p>\n<span>“Kakashi-sensei,” the girl sidled up to him, a slightly manic expression in her eyes. “I have to talk to you.”</span>\n</p>\n<p>\n<span>Kakashi was already fearing for the worst, but hoped it didn't show. “Mah, Ino, what can I do for you?”</span>\n</p>\n<p>\n<span>She stepped closer, uncomfortably close even, and grabbed a hold of his flak jacket, giving him a searching look.</span>\n</p>\n<p>\n<span>“Pleeease tell me you've read the latest </span>\n<em>\n<span>Icha Icha</span>\n</em>\n<span>,” she begged, and his eyes widened. </span>\n</p>\n<p>\n<span>“Uh, why?”</span>\n</p>\n<p>\n<span>“Because, apart from Hinata-chan, you're the only one I know who also reads them. But she's on a mission and I needed someone to talk to,” Ino said quickly, all in one breath.</span>\n</p>\n<p>\n<span>Kakashi was still a bit flabbergasted that Hyuuga Hinata of all people would be reading </span>\n<em>\n<span>Icha Icha,</span>\n</em>\n<span> but then Ino was already placing the back of her hand against her forehead, leaning against him in a mock faint.</span>\n</p>\n<p>\n<span>“Oh, the drama,” she sighed. “The tears. The exquisitely filthy love scenes.”</span>\n</p>\n<p>\n<span>“They were exquisite,” Kakashi agreed. “True</span>\n<em>\n<span> Icha Icha</span>\n</em>\n<span> fashion.”</span>\n</p>\n<p>\n<span>Ino gave him a look, blue eyes narrowing. “So you've had your suspicions, too?”</span>\n</p>\n<p>\n<span>“About what?”</span>\n</p>\n<p>\n<span>“That it was great, but that it can't possibly have been written by Jiraiya-sama,” Ino pointed out because, at least within the walls of Konoha, the Sannin's exploits in erotica were something of an open secret. </span>\n</p>\n<p>\n<span>“Tell you what, though-” and she leaned closer as if to whisper a secret. “I'm pretty certain the new author lives in Konoha as well.”</span>\n</p>\n<p>\n<span>“Ah, why would you think that?” Kakashi asked, somewhat surprised at this revelation.</span>\n</p>\n<p>\n<span>“Because the address for fan mail is still the same box at the post office,” Ino explained. “But Hinata-chan got a reply to her last lette0,r and it was stamped and sent just a few days later, from that very office.”</span>\n</p>\n<p>\n<span>Considering that Ino's father worked in Intel, it was probably no surprise that his daughter had inherited his combination skills.</span>\n</p>\n<p>\n<span>“You should write a letter, too,” she told him now. “Maybe if you get a reply, you can figure out who that mysterious person is. Because if they are as good as giving oral as at writing it, I think I might want to meet them.”</span>\n</p>\n<p>\n<span>She winked at him and then was gone.</span>\n</p>\n<p>\n<span>Kakashi stared a little. Teenage girls were scary. Porn-reading teenage kunoichi were much much worse.</span>\n</p>\n<p>\n<span> </span>\n</p>\n<p> </p>\n<p>\n<span>He found out just how scary they were when a few weeks later he found himself in Uemura's shop, standing in front of the table that displayed the latest volume.</span>\n</p>\n<p>\n<em>\n<span>After popular demand! </span>\n</em>\n<span>A sign read in the same font that was always used on the book covers, </span>\n<em>\n<span>Get ready for – ICHA ICHA YAOI!</span>\n</em>\n</p>\n<p>\n<span>A small booklet informed the costumers that after the 'obvious sexual tension between Satoru and Nobuyuki in </span>\n<em>\n<span>A Tale of Two Brothers</span>\n</em>\n<span>' many fans had demanded that the author finally write a gay love story.</span>\n</p>\n<p>\n<span>Jiraiya had been known to include lesbians or threesome and even foursomes in his books, but the boy on boy action had been fleeting at best. This was probably the final proof that someone else had taken over Jiraiya-dono's legacy.</span>\n</p>\n<p>\n<span>After the last two volumes, Kakashi couldn't find it in himself to hold a grudge. They just had been too good.</span>\n</p>\n<p>\n<span>He looked down at the book in his hand and gave a sigh, before turning toward the checkout. In for a penny, in for a pound, after all.</span>\n</p>\n<p>\n<span>“Would you like a bag with that?” Uemura asked politely, having witnessed Kakashi's inner battle.</span>\n</p>\n<p>\n<span>“It's alright,” Kakashi answered, drudging up the energy for a smile from somewhere. “I'll just start reading on my way home.”</span>\n</p>\n<p> </p>\n<p>\n<span> </span>\n</p>\n<p>\n<span>Considering that he read porn in public, most people wouldn't even blink when he started reading gay porn as well. Most people probably wouldn't even look closely enough to notice.</span>\n</p>\n<p>\n<span>Just his luck that he managed to run into Hyuuga Hinata.</span>\n</p>\n<p>\n<span>She gave him a little smile in greeting, but then her gaze passed over the book cover, reading the title, and immediately she turned bright red. Belatedly, Kakashi remembered Ino mentioning Hinata being a fan as well. Had she been one of the people demanding some boy loving? Kakashi deemed it better not to ask.</span>\n</p>\n<p>\n<span>“Ah, Kakashi-sensei,” she stammered, fiddling with her hair a little. “Which page are you on?”</span>\n</p>\n<p>\n<span>Not so shy after all, huh, he thought to himself, but just smiled in reply. “I basically just started.”</span>\n</p>\n<p>\n<span>“Oh,” she gave a little nod before whispering. “Page 44 is where it gets really good.”</span>\n</p>\n<p>\n<span>She was gone so quickly that even with the Sharingan he wouldn't have been able to keep track of her.</span>\n</p>\n<p>\n<span> </span>\n</p>\n<p> </p>\n<p>\n<span>“</span>\n<em>\n<span>I cannot keep meeting you like this,” Yuu hissed, even as he pulled the young lord back into the shadows with him.</span>\n</em>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>Has your father commented on your disappearances again?” Akihiko asked, his eyes wide and worried.</span>\n</em>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>Yes,” Yuu bit out forcefully, and it wasn't a lie, but not the whole truth either. The general was growing suspicious of his son's increasingly strange behavior, but that was not the reason for Yuu's discontent.</span>\n</em>\n</p>\n<p>\n<em>\n<span>The knowledge that all he and Akihiko would ever have was shadows, was darkness, was stolen kisses when there were no eyes or ears to witness their love was eating at him like a feral beast tearing him apart from the insides. When they had first started their tryst, he had been scared to death of anyone ever finding out, had insisted on their secrecy, but by now all he wanted to do was to shout it out for all the world to hear.</span>\n</em>\n</p>\n<p>\n<span>How can they not see,</span>\n<em>\n<span> he wondered, as he started tearing at Akihiko's clothes. Luckily, he was only wearing a few layers with a kosode the color of autumn leaves on top, instead of a more formal outfit that one needed the help of servants to fit into again.</span>\n</em>\n</p>\n<p>\n<span>How can they not see how I look at you when we are at court? Can they not see in my eyes what I feel in my heart with every breath I take?</span>\n</p>\n<p>\n<em>\n<span>When finally he reached naked skin, he kissed a hot trail down from Akihiko's neck along his chest and belly, sinking to his knees and nipping at his hipbone.</span>\n</em>\n</p>\n<p>\n<em>\n<span>Above him, Akihiko whispered his name, but Yuu's mouth was too busy to reply. When he swallowed him down, he lacked his usual finesse, skill replaced by hunger. Akihiko had been visiting another court, gone for three weeks only, but with Yuu soon having to accompany his father on a campaign he did not yet know when they would be reunited again.</span>\n</em>\n</p>\n<p>\n<span>If I die, no one will ever know whom you are shedding tears for </span>\n<em>\n<span>, Yuu thought, even as his tongue sought to bring pleasure to his lover, his friend, his lord. </span>\n</em>\n<span>Will you shed tears for me? Will you mourn my passing, or just marry one of the white-faced girls your courtiers present you? Will I be to you as the color of the autumn leaves, fondly remembered, but disregarded in favor of the beauty of Sakura petals?</span>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>Yuu,” Akihiko moaned, his voice unsteady, tugging at Yuu's dark hair to pull him back. “Please, not yet.”</span>\n</em>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>I wish only to fulfill your needs, Akihiko-sama,” Yuu replied, still on his knees and his tone spiteful. He had added the title as a coarse reminder of their hopeless situation and Akihiko flinched, but slowly he joined Yuu on the floor.</span>\n</em>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>My need,” he said, tentative and shaking, but eager and excited as well, “Is for you to take me.”</span>\n</em>\n</p>\n<p>\n<em>\n<span>Yuu's breath hitched. Until now, it had always been him submitting, as befit his lower status. Then again, their affair went against all rules of court – what difference made it now? They would just write their own laws instead.</span>\n</em>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>Yes,” Yuu agreed, feeling himself harden even more at the thought of pressing Akihiko against the dark wood of the floor, just with the weight of his body, with a thrust of his hips and the wetness of his mouth.</span>\n</em>\n</p>\n<p>\n<em>\n<span>Even if he died tomorrow, even if they never saw each other again, if they never had a life together beyond these few precious summer months, they would still treasure the knowledge of having loved with abandon, without shame or hesitation in front of each other.</span>\n</em>\n</p>\n<p>\n<em>\n<span>Yuu never said any of that. Instead he pushed Akihiko down without any of the gentleness the other had always bestowed upon him.</span>\n</em>\n</p>\n<p>\n<em>\n<span>He didn't say, </span>\n</em>\n<span>I love you more than my heart knows how without overflowing. </span>\n<em>\n<span>He just put his mouth next to Akihiko's ear and growled, “I will fuck you so hard you will never forget me.”</span>\n</em>\n</p>\n<p>\n<span> </span>\n</p>\n<p> </p>\n<p>\n<span>Kakashi's mouth was dry as he read, but he barely even noticed it. How Yuu's father was killed during the campaign, Yuu himself taken prisoner along with two-hundred other men, spending harsh winter weeks as hostages until finally they were released into freedom after the ransom had been paid. And Yuu, still grief-stricken and traumatized, had returned home, wishing for his lover's embrace, only to find that Akihiko had offered himself in exchange for the captured army. So Yuu came up with a foolish plan, a suicide mission really, to invade the enemy camp and try to free the daimyo's son.</span>\n</p>\n<p>\n<span>Kakashi was so caught up in the story that he resurfaced with a start when he finally reached the final page.</span>\n</p>\n<p>\n<em>\n<span>Icha Icha Yaoi: Autumn Leaves will be continued in Icha Icha Yaoi: Spring Blossoms! Stay tuned for the next volume!</span>\n</em>\n</p>\n<p>\n<span>He almost chucked the book against the wall, but refrained, grabbing a hold of himself. Maybe he should seek out Ino. After this time he needed someone to talk to as well.</span>\n</p>\n<p>\n<span> </span>\n</p>\n<p> </p>\n<p>\n<span>It never quite came to any of that. There was an invasion and a war and a battle to the death and a goddess and Sasuke returning, and Kakashi was made into Hokage and suddenly reading porn in public was frowned upon because it 'left a bad impression on the people'.</span>\n</p>\n<p>\n<span>Uemura's shop was luckily still holding up, but Kakashi quickly found out that</span>\n<em>\n<span> Spring Blossoms</span>\n</em>\n<span> had not yet been published. It was curious because before that there had only been about four months between the volumes. Then again, if Ino's suspicion had been right and the anonymous author truly lived in Konoha they might've gotten caught up in the battle as well. Maybe they had even died.</span>\n</p>\n<p>\n<span>Kakashi dreaded that thought. There was no way they would find another replacement quite as good as that.</span>\n</p>\n<p>\n<span>“Hokage-sama,” Umino Iruka entered the office, giving a deep bow. During the past weeks, the chuunin had proved of immeasurable worth, especially since Kakashi couldn't be arsed to keep track of his paperwork. </span>\n</p>\n<p>\n<span>However, Iruka always seemed to know everything, probably because of his work at the Academy and at the mission desk. He knew about whose sister was pregnant and who had just gotten released from the hospital. He also always knew where Kakashi had misplaced some important document and at which point people should just fucking leave, lest their new Hokage killed everyone.</span>\n</p>\n<p>\n<span>Kakashi himself wondered how Iruka even found time to take on a third job and act as self-appointed secretary. Self-appointed because Kakashi had definitely not employed him. The man had just showed up one day and gotten shit done, so Kakashi had let him stay. A decision he had not yet come to regret.</span>\n</p>\n<p>\n<span>“Please, just keep calling me Kakashi,” he insisted, rubbing his temple. He had taken to temple-rubbing. This job was killing him.</span>\n</p>\n<p>\n<span>Iruka only smiled. “You looked like you could use a break.”</span>\n</p>\n<p>\n<span>And he placed a tray of iced tea onto the overladen desk.</span>\n</p>\n<p>\n<span>“Thank you,” Kakashi said gratefully, immediately taking up the cup and pulling down his mask. Another thing he had come to trust Iruka with.</span>\n</p>\n<p>\n<span>“Ah, and another thing.” Iruka scratched his cheek in mild embarrassment. “This might be a bit straightforward and inappropriate, but...”</span>\n</p>\n<p>\n<span>And he placed a stack of loosely bound pages next to the tray.</span>\n</p>\n<p>\n<span>“What's that?” Kakashi frowned because, if it was only more stuff that needed to be signed, Iruka had no reason to blush.</span>\n</p>\n<p>\n<span>“Um, a present. From a friend.” Iruka looked somewhat shifty. “He thought you might enjoy it.”</span>\n</p>\n<p>\n<span>“Alright,” Kakashi said with a dubious frown, but Iruka only grinned a little and excused himself. Slightly curious now, Kakashi pulled the papers closer to him.</span>\n</p>\n<p>\n<span>He stared a little when he realized that it was an unedited manuscript.</span>\n</p>\n<p>\n<em>\n<span>Icha – Spring Blossoms, </span>\n</em>\n<span>it read simply. Reverently, Kakashi turned the first page. To his surprise, it held a dedication, something that neither Jiraiya nor the new author had ever included before.</span>\n</p>\n<p>\n<em>\n<span>For those who never stop fighting. For those who never give up hope. For those who keep on loving.</span>\n</em>\n</p>\n<p>\n<span>Any doubts about whether the author had been involved in the war were erased in that moment.</span>\n</p>\n<p>\n<span>There was something special about reading the unedited version of a novel. It felt raw and emotional. More honest. There were notes in the margins and tea stains on the paper. With a lump in his throat, Kakashi was reminded of reading his very first Icha Icha, hoping to find traces of Minato-sensei between the ink.</span>\n</p>\n<p>\n<span>There were places where words had been crossed out, rewritten and crossed out again. Sentences that didn't quite seem to end, as if the author or the characters were caught in a delirium. The whole story felt dirtier, grittier. The sex scenes were rough and the violence gory. It fit the general plot of the story, but Kakashi couldn't help but wonder whether it was because the author had now experienced an actual war in real life.</span>\n</p>\n<p>\n<span>Akihiko's willingness to sacrifice himself, not just for his lover but for the good of his people left a bitter taste in his mouth, while Yuu's unerring determination to be reunited with his love was verging on obsession, insanity.</span>\n</p>\n<p>\n<span> </span>\n</p>\n<p> </p>\n<p>\n<span>“</span>\n<em>\n<span>You are dying,” Akihiko cried, and there was no beauty in his tears. He had matured in the past few months, growing old too quickly in the way that only happened during war and winter. They had lost the innocence of summer when they were still pulling each other into dark corners of the castle to whisper secrets, lovesick and drunk on their kisses.</span>\n</em>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>Anything,” Yuu breathed, reaching up to cup the wet-hot cheek with his bloodied hand, “Anything to taste your lips again.”</span>\n</em>\n</p>\n<p>\n<em>\n<span>And they were surrounded by the courtiers and the women from which Akihiko was supposed to choose a wife at some point. And the daimyo was still pale and frozen from watching as his son had almost been murdered in front of them all. But in that moment, none of if mattered.</span>\n</em>\n</p>\n<p>\n<em>\n<span>With the last of his strength, Yuu managed to pull Akihiko down towards him. It was not the most passionate kiss they had ever shared, but it would be their final one and that thought drove Yuu to push everything he felt into it, all his fears, his desperation, his hopes. Every smile that had been stolen from his lips during the past months.</span>\n</em>\n</p>\n<p>\n<em>\n<span>He could not hear whether there were gasps from those around them or scandalized chattering. There was nothing now, only the two of them, finally together, finally true.</span>\n</em>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>Think of me,” Yuu told him. “Think of me when the leaves turn golden.”</span>\n</em>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>I will always think of you,” Akihiko promised. “I will think of you when the Sakura petals fall and when the snow claims the land. I will think of you because you will be there to remind me.”</span>\n</em>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>No.” Yuu shook his head, just a tiny motion, but big enough to forfeit every right he had ever held over Akihito's heart. “I will be your autumn, as you were my spring.”</span>\n</em>\n</p>\n<p>\n<em>\n<span>The last thing he heard was his lover's voice, begging him to stay.</span>\n</em>\n</p>\n<p>\n<span> </span>\n</p>\n<p> </p>\n<p>\n<span>For a long moment, Kakashi just sat in his chair and stared.</span>\n</p>\n<p>\n<em>\n<span>Icha Icha</span>\n</em>\n<span> never had a tragic ending. It wasn't always exactly happy, but nothing was ever left unresolved. It never left him feeling this bereft.</span>\n</p>\n<p>\n<span>This couldn't be the ending. This couldn't be published. Something had to be done.</span>\n</p>\n<p>\n<span>He had to talk to the author. If they were a friend of Iruka, then they had to be in Konoha. Kakashi could write fan mail, of course, but firstly, big fat no! And secondly, that would take too long. He had to get through to the author before the manuscript could be sent to the publishers.</span>\n</p>\n<p>\n<span>Maybe he could ask Iruka for the information, but the man hadn't looked like he wanted to divulge the identity of his friend. For a second, Kakashi entertained the idea that perhaps Iruka was the author himself, but there was no way the chuunin could maintain a fourth job as a writer of historical gay porn. As amusing as that thought was.</span>\n</p>\n<p>\n<span>But maybe someone who used to be close to Jiraiya would know who would have gotten permission to continue the series. So five minutes later, Kakashi found himself in the hospital, looking at Tsunade-sama.</span>\n</p>\n<p>\n<span>“For the last time, Kakashi,” she gritted out, an angry vein pulsating on her forehead. “I am retired, and I don't want the bloody job back. I like being a medic. I didn't like being a Hokage. It gave me more wrinkles than I can cover up. You got your mask, but do you have any idea about how much chakra it costs me to uphold mine?!”</span>\n</p>\n<p>\n<span>“That's not what I'm here for,” Kakashi pointed out, and she crossed her arms in front of her ample chest.</span>\n</p>\n<p>\n<span>“This is the fourth time you've been here this week. And it's only Tuesday,” she reminded him. “Take a guess why I don't believe you.”</span>\n</p>\n<p>\n<span>“I just have an inquiry,” Kakashi explained, trying not to feel insulted. “Regarding Jiraiya-dono's last will.”</span>\n</p>\n<p>\n<span>Immediately, Tsunade's demeanor changed.</span>\n</p>\n<p>\n<span>“What is there to know?” she asked, gruffly, but more to hide the lingering pain. “He left some stuff to me, but most of it went to the brat.”</span>\n</p>\n<p>\n<span>“I thought so.” Kakashi nodded. “But there is another thing. Not a material possession, but... the copyright to the Icha Icha books.”</span>\n</p>\n<p>\n<span>“In a way, that is a material possession.” Tsunade pursed her lips. “Apart from the fees for the publishers and everything, all the money from every copy still being sold goes directly to Naruto's bank account, as far as I know.”</span>\n</p>\n<p>\n<span>“I see.“ Kakashi frowned slightly at the revelation. “But the thing is... there are new books being published under Jiraiya-dono's former alias. I have suspicion to believe that the new author is, in fact, a Konoha shinobi.”</span>\n</p>\n<p>\n<span>At that, Tsunade's eyebrows shot up. “It that so? Well, I don't know who they might be or why you would need to talk to them, but I guess Naruto might have an idea. He did handle most of Jiraiya's affairs, considering he was his student in all matters.”</span>\n</p>\n<p>\n<span>“In that case, I will talk to him.” Kakashi politely inclined his head. “Thank you, Tsunade-sama.”</span>\n</p>\n<p>\n<span>“Always glad to help,” she answered. “As long as it's got nothing to do with paper work, cooking or becoming Hokage again. But if you ever have a life-threatening injury, I'm your woman.”</span>\n</p>\n<p>\n<span>“If any life-threatening injury ever leaves me coherent enough, I'll do my best to remember that.” And with those parting words he left through the window.</span>\n</p>\n<p>\n<span> </span>\n</p>\n<p> </p>\n<p>\n<span>Since, at the moment, there weren't exactly many buildings left in Konoha, and Kakashi had placed Sasuke under temporary house arrest, Naruto had taken it upon himself to offer his friend shelter and accept him into his own home.</span>\n</p>\n<p>\n<span>That was before Naruto had found out that his building had been completely destroyed in the invasion, meaning he had to find a new apartment himself before he could go around taking in strays.</span>\n</p>\n<p>\n<span>As it was, Naruto and Sasuke had apparently decided on a shared living space together and were now coexisting as roommates. Considering that just a few weeks ago they had fought a battle to the death and that even on the best of their gennin days they weren't exactly civil with each other, Kakashi had to admit that it was a definite improvement.</span>\n</p>\n<p>\n<span>He didn't quite know how they managed to strangle each other on a daily basis and subsequently have their neighbors complaining about the noise, but maybe Iruka just never let any of that reach him in his office. Iruka was a very efficient secretary. A secretary that brought him exclusive gay porn. Where had his life gone wrong again?</span>\n</p>\n<p>\n<span>Anyway, so since Kakashi had been kept busy signing treaties and rebuilding an entire village, he hadn't had the time yet to properly visit his former gennin at home. It still didn't feel awkward to just drop in through the window. After all, his title was good for anything then at least for the fact that as Hokage he could whatever the hell he wanted. Including breaking and entering.</span>\n</p>\n<p>\n<span>“Kaka-sensei?” Naruto frowned when he found him in the living room. “You know we have a doorbell.”</span>\n</p>\n<p>\n<span>“Too easy,” Kakashi told him. “And just because the war is over, doesn't mean you shouldn't keep on your toes.”</span>\n</p>\n<p>\n<span>“Sure, sure.” Naruto nodded his head absent-mindedly, shuffling over to the kitchen area. “You want something to drink?”</span>\n</p>\n<p>\n<span>“Tea, if you have any,” Kakashi replied. With Sasuke in the house, there was probably a reduced rate of food poisoning.</span>\n</p>\n<p>\n<span>“So, any particular reason why you're here?” Naruto asked, busying himself with boiling the water. “I mean, not that I'm not happy to see you outside of the tower for once, but you're not exactly the type to come by for a friendly chat.”</span>\n</p>\n<p>\n<span>“True,” Kakashi admitted, but then just found himself watching his student a little.</span>\n</p>\n<p>\n<span>Naruto was no longer a child, he realized. Ridiculous, really, as he himself had been fighting in a war when he was ten years younger, but there was something more mature about Naruto. It couldn't have been the fighting and all the losses. Naruto had stayed his eccentric, boisterous self all thought the hardships of his life.</span>\n</p>\n<p>\n<span>But now, wearing a comfortable black t-shirt that was just a little too tight for him in the shoulders, enhancing his strong back and lean body, he seemed very grown up. His hands were steady, no unnecessary movements, no running his mouth, just taking two cups from the shelf and pouring the tea.</span>\n</p>\n<p>\n<span>He wasn't so much like Minato then or Kushina or even Obito, and with some contrition Kakashi realized that he had constantly been comparing the boy to other people, trying to measure his worth. Now, maybe the first time, he viewed Naruto as his own person.</span>\n</p>\n<p>\n<span>Kakashi didn't delude himself into thinking that it was thanks to him. He had been a crappy teacher, after all, and would make a crappy Hokage as well. But if Naruto had managed to thrive despite all that, then maybe Konoha would, too.</span>\n</p>\n<p>\n<span>“I wanted to talk to you about a delicate matter,” Kakashi began to answer the previous question, but Naruto just rubbed a hand over his face.</span>\n</p>\n<p>\n<span>“Is this about the council wanting to lock Sasuke up again?” he asked tiredly. “Because I swear, if they try that shit even one more time, I'll-”</span>\n</p>\n<p>\n<span>“It's not about that,” Kakashi cut him off. “I think they've backed up for now. It's got nothing to do with Sasuke, but with Jiraiya-dono.”</span>\n</p>\n<p>\n<span>Much like Tsunade, Naruto tried to hide his grief behind a growl. “What's with Ero Sennin?”</span>\n</p>\n<p>\n<span>“Ah, you see...” Kakashi peered down into his cup. “Today I was given a present. And Tsunade-sama hinted that maybe you might know who sent it.”</span>\n</p>\n<p>\n<span>Surprisingly, a big grin split Naruto's face in half then, and he leaned back in his chair.</span>\n</p>\n<p>\n<span>“Is that so?” he asked, and Kakashi took it all back, because that was a preteen prankster right there, unchanged and incorrigible.</span>\n</p>\n<p>\n<span>“...Yes.” Kakashi gave a small nod. “I was very grateful for the gift. But I have to admit that I did not enjoy the ending.”</span>\n</p>\n<p>\n<span>“What?” Naruto quickly leaned forward again, hands slamming on the table. “What's that supposed to mean? It was an awesome ending!”</span>\n</p>\n<p>\n<span>“So you've read it?”</span>\n</p>\n<p>\n<span>“Oh, of course I have.” Naruto relaxed again, smile back in place. “It's an important business investment, after all.”</span>\n</p>\n<p>\n<span>“You know the author, then?” Kakashi asked hopefully. “Is there any chance I might be able to talk to them?”</span>\n</p>\n<p>\n<span>Naruto crossed his arms. “First tell what there wasn't to like about it.”</span>\n</p>\n<p>\n<span>“Well, where to start,” Kakashi sighed, tilting his head back and ignoring Naruto's incredulous stare. “It was well written, as before, of course. The pacing was great, the character's actions convincing. But that ending. After two books, after all that pain and the suffering... the protagonist just dies? Ripped from his lover's arms in the moment of truth. That's heartless. That's cruel.”</span>\n</p>\n<p>\n<span>“But it's a real ending,” Naruto insisted. “None of that sappiness that always gets in the way of the story's message.”</span>\n</p>\n<p>\n<span>“The message is that true love always prevails,” Kakashi pointed out. “But the ending destroys it.”</span>\n</p>\n<p>\n<span>“Pff.” Naruto turned his nose up. “What would you know about true love? Or about story writing?”</span>\n</p>\n<p>\n<span>“I've read all of Jiraiya-dono's works,” Kakashi said through gritted his teeth. “Several times, in fact. Just because he occasionally let you proof-read-”</span>\n</p>\n<p>\n<span>“Proof-read?” Naruto let out a disbelieving laugh, but then his smile turned sly. “So I guess you haven't figured it out yet?”</span>\n</p>\n<p>\n<span>“Figured what out?”</span>\n</p>\n<p>\n<span>“I don't simply hold the copyright for Icha Icha,” Naruto revealed. “I am the new author.”</span>\n</p>\n<p>\n<span>Kakashi just stared</span>\n</p>\n<p>\n<span>No way, he thought. There was no way that his excitable, loud-mouthed student could have possibly written such stunning prose. Not when he used to fail written exams and hand in illegible mission reports.</span>\n</p>\n<p>\n<span>But at the same time the wheels in his head started turning.</span>\n</p>\n<p>\n<span>Satoru and Nobuyuki in </span>\n<em>\n<span>A Tale of Two Brothers</span>\n</em>\n<span>, growing up as orphans and finding a friend in each other, still caught in a circle of rivalry and misunderstandings, always fighting, always crossing the line. So much unresolved sexual tension that the fans demanded</span>\n<em>\n<span> Icha Icha Yaoi.</span>\n</em>\n</p>\n<p>\n<span>Natsumi's fighting spirit in </span>\n<em>\n<span>A Deal with the Daitengu</span>\n</em>\n<span>, never giving up, proving the whole village wrong, finding love and acceptance in an unexpected place, in the arms of a powerful but standoffish mountain spirit.</span>\n</p>\n<p>\n<span>And finally, </span>\n<em>\n<span>Autumn Leaves </span>\n</em>\n<span>and </span>\n<em>\n<span>Spring Blossoms.</span>\n</em>\n<span> Yuu, the son of a strict general, and Akihito, the next daimyo. A secret affair that no one would approve of, always missing each other by minutes, always making sacrifices for what they think is the best course of action. A terrible love story, two young men torn apart by strife and tragedy.</span>\n</p>\n<p>\n<span>“Naruto,” Kakashi said slowly, insistently. “I know this isn't really any of my business, and I don't want to interfere with your muse or anything like that. But while you were writing these books...”</span>\n</p>\n<p>\n<span>He trailed off and took a deep breath, steeling himself. “Did it occur to you that maybe you were channeling your feelings for Sasuke?”</span>\n</p>\n<p>\n<span>Naruto only blinked at him. “Huh? What do you mean?”</span>\n</p>\n<p>\n<span>“You've been writing love stories about people who closely resemble you and Sasuke,” Kakashi elaborated. “Does that ring any bells?”</span>\n</p>\n<p>\n<span>“Oh, yeah,” Naruto rubbed the back of his head and laughed. “Sakura-chan commented on that as well.”</span>\n</p>\n<p>\n<span>“Sakura knows you're writing</span>\n<em>\n<span> Icha Icha</span>\n</em>\n<span>?” Kakashi gaped, thankful that it wasn't quite as obvious with his mask. What had his students been up to while he was busy reading porn? Apparently, writing that porn. Hm.</span>\n</p>\n<p>\n<span>“I needed a proof-reader, after all.” Naruto gave a serious nod. “And she gets a kick out of reading the manuscripts while Ino-chan is still wondering when the next volume will be out.”</span>\n</p>\n<p>\n<span>“Naruto.” Kakashi resisted the urge to push up his headband in to make his soul-deep stare more effective. “You've been writing gay porn. About yourself and your best friend. Do you see where I'm going with this?”</span>\n</p>\n<p>\n<span>In that moment, a key was turned in the lock of the entrance door and someone entered the apartment. Obviously, it had to be Sasuke. There went that conclusion to their conversation then. Kakashi would have to have a heart-to-heart with Naruto some other time.</span>\n</p>\n<p>\n<span>“I'm home,” Sasuke called out, taking off his shoes by the door, and it struck Kakashi as strange that the boy who had been fighting so hard to run away and stay away would so easily speak of home.</span>\n</p>\n<p>\n<span>“Welcome back,” Naruto answered with a smile and he was positively glowing. Yup, Kakashi really needed to talk to him about emotional boundaries. In fact, he probably should have done that years ago. Oh well, better late than never.</span>\n</p>\n<p>\n<span>“Kakashi-sensei,” Sasuke acknowledged with a nod, and it was still a bit weird to see him so pleasant and polite, so Kakashi only nodded in return.</span>\n</p>\n<p>\n<span>“I brought groceries,” Sasuke told Naruto, already setting down the bags on the counter and starting to put everything into the cupboards and the fridge. “Sashimi tonight?”</span>\n</p>\n<p>\n<span>“Sounds great,” Naruto agreed. “The tea is still hot. You want some?”</span>\n</p>\n<p>\n<span>Sasuke made an affirmative noise and pulled another cup from the shelf, then he stepped up next to Naruto and started pouring himself some tea. Unlike Naruto, he still had some trouble with his prosthesis, so his right hand shook a little and some of the tea spilled over.</span>\n</p>\n<p>\n<span>“I got it,” Naruto said quickly, grabbing a napkin and wiping the hot liquid away.</span>\n</p>\n<p>\n<span>“Thanks,” Sasuke said, picking up his cup and taking a sip, before leaning down to press a soft kiss to the corner of Naruto's mouth.</span>\n</p>\n<p>\n<span>Kakashi felt like someone had just kicked him off the window sill. He was free-falling and could only prepare himself for the painful impact. It never came. Sasuke went back to drinking his tea and sorting through the shopping, while Naruto was smiling like everything was perfectly in order.</span>\n</p>\n<p>\n<span>Kakashi was tempted to do a release seal and yell 'kai', just to be on the safe side, but that did seem a little overboard.</span>\n</p>\n<p>\n<span>“Did I miss something?” he asked slowly, and the words felt strange in his mouth because he had never missed anything before.</span>\n</p>\n<p>\n<span>“Oh, yeah, about that,” Naruto remembered their previous topic and then twisted in his chair to look at Sasuke. “Did you know? Sensei thought I was writing porn because I wanted to date you.”</span>\n</p>\n<p>\n<span>“You were writing porn because you wanted to date me,” Sasuke pointed out in a bland voice.</span>\n</p>\n<p>\n<span>“Yeah, but he missed the part where we've already gotten together ages ago.”</span>\n</p>\n<p>\n<span>“Ages,” Kakashi repeated. “Sasuke's only been back for little over three months.”</span>\n</p>\n<p>\n<span>“As I said,” Naruto nodded emphatically. “Ages. Like... we would have been making out on the battlefield if the blood loss hadn't made us so woozy.”</span>\n</p>\n<p>\n<span>“He's exaggerating,” Sasuke said for Kakashi's benefit. “We only started fucking once Sakura released us from the hospital.”</span>\n</p>\n<p>\n<span>“I think that was too much for him,” Naruto mused, tilting his head at Kakashi's vacant expression.</span>\n</p>\n<p>\n<span>“It's his own fault,” Sasuke huffed. “He's the Hokage, how could he miss the signs? This is a one-room apartment. You're wearing one of my shirts. And everyone knew. Tsunade knew. Hyuuga Hizashi knew. Ibiki knew.”</span>\n</p>\n<p>\n<span>He shuddered, probably remembering his invasive interrogation sessions with the man.</span>\n</p>\n<p>\n<span>“Maybe he missed it </span>\n<em>\n<span>because </span>\n</em>\n<span>he is Hokage,” Naruto conceded. “I mean, he has been pretty busy.”</span>\n</p>\n<p>\n<span>“But... how?” Kakashi couldn't believe any of this and he needed answers. “How did you get from being Jiraiya's apprentice to writing these stories? There's... It's just not possible.”</span>\n</p>\n<p>\n<span>“Well.” Naruto had a thoughtful look on his face. “It started when Ero Sennin made me proof-read all of his manuscripts and I first thought it was stupid. Because I didn't want to read his dirty fantasies, and also I was never much of a reader. I was always too slow and never knew all the kanji.”</span>\n</p>\n<p>\n<span>He looked fretful for a moment, probably thinking of his academy days and how his lack in reading skills had also affected his learning.</span>\n</p>\n<p>\n<span>“But then Ero Sennin started teaching me. About how simple, but stunning poetry can be. How a story works, foreshadowing and climax and all that. And slowly he started asking for my opinion more and more. A character's development or why I thought the plot didn't quite work out.”</span>\n</p>\n<p>\n<span>Naruto's gaze grew dark then and distant, “When he... When he died... he left me all of this stuff. His writing utensils and notebooks. And the copyright for </span>\n<em>\n<span>Icha Icha.</span>\n</em>\n<span> I never planned to use it, of course.”</span>\n</p>\n<p>\n<span>A little laugh escaped him, as if he couldn't quite believe it himself, “When I first started writing myself, I did it to feel closer to him. I thought maybe it would still teach me some more stuff. And it did because at first my writing was shit.”</span>\n</p>\n<p>\n<span>He ran a fingertip over the rim of his teacup, reminiscing fondly. “The characters' motivations felt empty, the plot fell apart halfway through. I needed something I could relate to myself. And that's how I ended up with </span>\n<em>\n<span>A Tale of Two Brothers</span>\n</em>\n<span>.”</span>\n</p>\n<p>\n<span>He bit his lower lip, looking bashful. “It was... sort of the point where I realized that maybe I didn't just think of Sasuke as a rival and a friend. But I... didn't dare take it there. It was too much and too soon. That's why I wrote </span>\n<em>\n<span>A Deal with the Daitengu.</span>\n</em>\n<span> I thought it wouldn't feel as weird if it was a guy and a girl. Even if one of them was a demon.”</span>\n</p>\n<p>\n<span>Sasuke had stepped closer again and placed his good hand on Naruto's shoulder, and Naruto leaned his head to the side so that his cheek was brushing the knuckles.</span>\n</p>\n<p>\n<span>“But then I got fan mail.” Naruto's eyes screwed shut in a big grin. “I'd never gotten anything but bills before, and suddenly there were all these people writing me. Hinata-chan and Ino-chan and so many strangers, asking for a love story between two guys because Satoru and Nobuyuki had never pulled their heads out off their asses. That's when I knew.”</span>\n</p>\n<p>\n<span>“So you wrote</span>\n<em>\n<span> Autumn Leaves,</span>\n</em>\n<span>” Kakashi concluded. “But why the hell would you let it end like that in </span>\n<em>\n<span>Spring Blossoms</span>\n</em>\n<span> when you've actually managed to get together in real life?”</span>\n</p>\n<p>\n<span>“Nah, Kaka-sensei,” Naruto said with a pout a pout. “I'd sound like a total sap. I wanted some edge to it.”</span>\n</p>\n<p>\n<span>“No,” Kakashi said and Naruto blinked.</span>\n</p>\n<p>\n<span>“What?”</span>\n</p>\n<p>\n<span>“No,” Kakashi repeated. “I refuse to accept that as an answer. I refuse that the story finished like that.”</span>\n</p>\n<p>\n<span>“I... It's my story.” Naruto pointed out. “You can't force me.”</span>\n</p>\n<p>\n<span>“I can,” Kakashi replied darkly, standing up from his chair in an imperious manner. “As your Hokage I order you to change the ending of this book.”</span>\n</p>\n<p>\n<span>“What?” Naruto nearly fell to the floor, only held there by Sasuke's calming hand. “That's not fair.”</span>\n</p>\n<p>\n<span>“I'd be very careful now, boy,” Kakashi told him, widening his eyes in warning, though he knew it wouldn’t quite have the same effect without the Sharingan. “Because I am the one who gets to decide about my successor. And at this rate it won't be you.”</span>\n</p>\n<p>\n<span>And he left, using the door this time, just so he could slam it on his way out.</span>\n</p>\n<p>\n<span> </span>\n</p>\n<p> </p>\n<p>\n<span>Little over a month later, Kakashi found a wrapped present on his desk, a sticky note attached to it.</span>\n</p>\n<p>\n<em>\n<span>Won't hit the shops for another two weeks,</span>\n</em>\n<span> it read with a smiley face. </span>\n<em>\n<span>You're welcome.</span>\n</em>\n</p>\n<p>\n<span>Slowly, Kakashi removed the paper wrapping, uncovering the orange hardcover underneath.</span>\n</p>\n<p>\n<em>\n<span>Icha Icha Yaoi: Spring Blossoms.</span>\n</em>\n<span> The edited version, the final version. This would make or break Naruto's future career.</span>\n</p>\n<p>\n<span>“Iruka,” Kakashi called and a moment later the door opened. Was the man ever actually at the Academy or in the mission room nowadays? Kakashi probably would have to ask at some point.</span>\n</p>\n<p>\n<span>“Yes, Hokage-sama?” Iruka asked.</span>\n</p>\n<p>\n<span>“It turns out that I'm quite busy for the day,” Kakashi told him. “Cancel all my meetings.”</span>\n</p>\n<p>\n<span>“Already did that,” Iruka smiled. “Naruto warned me about your enthusiasm regarding his latest project.”</span>\n</p>\n<p>\n<span>“Thank you,” Kakashi eyes were already back on the book. “Dismissed.”</span>\n</p>\n<p>\n<span>He didn't even hear the door close, starting on the very first page, intending to read the whole thing again and pick out all the subtle changes between the manuscript and the polished version.</span>\n</p>\n<p>\n<span>There already was an addition to the dedication.</span>\n</p>\n<p>\n<em>\n<span>For those who never stop fighting. For those who never give up hope. For those who keep on loving. - From the bottom of my heart, I thank you for giving me my happy ending.</span>\n</em>\n</p>\n<p>\n<span>Kakashi's throat did definitely not close up at that. Instead he just kept on reading, the morning sun streaming in through the window, steadily gaining in warmth and brightness. It was spring now and soon the cherry trees would start blossoming. A symbol for young love and new beginnings. Maybe it was fitting that the publishing of the sequel had been delayed so.</span>\n</p>\n<p>\n<span> </span>\n</p>\n<p> </p>\n<p>\n<span>“</span>\n<em>\n<span>I will always think of you,” Akihiko promised. “I will think of you when the Sakura petals fall and when the snow claims the land. I will think of you because you will be there to remind me.”</span>\n</em>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>No,” Yuu shook his head, just a tiny motion, but big enough to forfeit every right he ever held over Akihito's heart. “I will be your autumn, as you were my spring.”</span>\n</em>\n</p>\n<p>\n<em>\n<span>The last thing he heard was his lover's voice, begging him to stay.</span>\n</em>\n</p>\n<p>\n<span> </span>\n</p>\n<p>\n<em>\n<span>Epilogue</span>\n</em>\n</p>\n<p>\n<em>\n<span>Yuu blinked awake to the morning sun streaming through the shoji windows, bathing the quiet room in a golden hue. It reminded him of the autumn light then, when he and Akihito had wandered the castle ground, trying to find patches were no one could see them, where they could brush fingers and steal kisses and no one would have to know.</span>\n</em>\n</p>\n<p>\n<em>\n<span>It looked a lot like that but it felt different because his body was heavy and numb, safe for the left side of his belly which was on fire.</span>\n</em>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>You are awake,” Akihito noticed and his usually bright voice was subdued. For a moment Yuu wondered why, and he turned his head, straining to see, but his sight was still blurred from unconsciousness. But then Akihito stepped closer, kneeling down next to his futon, allowing Yuu to see his face more clearly.</span>\n</em>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>Do not move,” Akihito warned. “The wound the dagger left might still kill you.”</span>\n</em>\n</p>\n<p>\n<span>He must have been crying,</span>\n<em>\n<span> Yuu realized, seeing the reddened eyes and swollen cheeks. </span>\n</em>\n<span>And for a long time, too.</span>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>You've shed tears for me,” Yuu whispered, his own voice rough, but a smile on his lips.</span>\n</em>\n</p>\n<p>\n<em>\n<span>The look Akihito sent him was sharp with surprise. “Of course I have. Did you think me so cold that I would not fear for your life?”</span>\n</em>\n</p>\n<p>\n<em>\n<span>Blissfully, Yuu shook his head, remembering how once he had been kneeling on his floor in this very room, wondering whether the future daimyo would ever mourn his passing.</span>\n</em>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>Why are you smiling then?” Akihito demanded, though a smile of his own was stealing over his face.</span>\n</em>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>Just laughing at my past self,” Yuu replied. “And how he could have ever doubted your love.”</span>\n</em>\n</p>\n<p>\n<em>\n<span>At that, Akihito's smile decided to stay, growing more confident.</span>\n</em>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>My love for you is unending,” he promised. “Not fragile as the cherry blossoms or fleeting as the autumn leaves. But strong and steady as a tree’s roots in the earth. No fire can burn it and no storm overturn. I am yours as you are mine.”</span>\n</em>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>But what of the court?” Yuu asked in sudden agitation, remembering their display of affection for all to see. His body tensed and pain shot through him, quick and cutting.</span>\n</em>\n</p>\n<p>\n<em>\n<span>Akihito only placed a soothing hand on his chest.</span>\n</em>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>It turns out,” he said with an amused twitch to the corner of his lips, “That my father holds the savior of his son in high esteem. Neither of us is to be punished. Instead, he wishes to... indulge our dallying.”</span>\n</em>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>It's not dallying,” Yuu insisted before his gaze turned coy. “But I do wish to indulge.”</span>\n</em>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>You are wounded,” Akihito admonished.</span>\n</em>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>Yet I have suspected for a while that your hands have a healing touch,” Yuu teased. “I nearly died saving you. For my troubles, I deserve a reward. So give me a kiss before I have to steal one.”</span>\n</em>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>You needn't ever steal from me,” Akihito replied, leaning down to whisper against his lips. “Only ask.”</span>\n</em>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>Kiss me,” Yuu asked then. And Akihito did.</span>\n</em>\n</p>\n<p>\n<span> </span>\n</p>\n<p> </p>\n<p>\n<span>And that was an ending even Kakashi could live with.</span>\n</p>\n<p>\n<span> </span>\n</p>\n<p>\n<span> </span>\n</p>\n<p>\n<strong>Coda</strong>\n</p>\n<p>\n<span>\"Wait.\" Naruto paused in the middle of unbuttoning his pants. \"Does Kaka-sensei know he's been reading explicit details about our sex life?\"</span>\n</p>\n<p>\n<span>\"No, but I'll give you a blowjob when you mention it during the next Kage Summit,\" Sasuke promised, pushing Naruto's hands aside to undo the pants himself.</span>\n</p>\n<p>\n<span>Naruto frowned. \"You'll do that anyway. Like, right now.\"</span>\n</p>\n<p>\n<span>\"No, I mean, I'll give you a blowjob right there during the Summit,\" Sasuke corrected and Naruto's eyes widened.</span>\n</p>\n<p>\n<span>\"Oh my God,\" he said. \"I just had the most amazing idea for my new book.\"</span>\n</p>\n<p>\n<span>\"Yeah?\" Sasuke grinned up at him and licked his lips. \"Glad to be of help.\"</span>\n</p>\n<p>\n<span>After that, there was no more talking.</span>\n</p>\n<p>\n<span> </span>\n</p>\n<p> </p>"
}