{
  "id": "26638507",
  "url": "https://archiveofourown.org/works/26638507?view_full_work=true",
  "author": [
    "jonghyunslisterine"
  ],
  "title": "rough hands",
  "rating": "Mature",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "방탄소년단 | Bangtan Boys | BTS"
  ],
  "relationships": [
    "Jeon Jungkook/Park Jimin"
  ],
  "characters": [
    "Park Jimin (BTS)",
    "Jeon Jungkook",
    "Kim Taehyung | V",
    "Min Yoongi | Suga",
    "Kim Namjoon | RM",
    "Jung Hoseok | J-Hope",
    "Kim Seokjin | Jin"
  ],
  "additional_tags": [
    "Alpha/Beta/Omega Dynamics",
    "Alternate Universe - Werewolf",
    "Mating Cycles/In Heat",
    "Mild Sexual Content",
    "Hurt/Comfort",
    "Pack Dynamics",
    "Scenting",
    "Angst with a Happy Ending",
    "Threats of Rape/Non-Con",
    "Implied/Referenced Rape/Non-con",
    "Sexual Harassment",
    "Attempted Sexual Assault",
    "Jealousy",
    "Violence",
    "Blood and Injury",
    "Wet Dream",
    "Minor Character Death",
    "Killing",
    "Suicidal Thoughts"
  ],
  "language": "English",
  "series": "Part 1 of all my bones are dust",
  "published": "2020-09-25",
  "completed": null,
  "words": "31,694",
  "chapters": "1/1",
  "comments": "618",
  "kudos": "10,515",
  "bookmarks": "3,304",
  "hits": "122,660",
  "summary": "<p>when jimin's pack is attacked by an enemy clan, he finds himself on the run with the rogue alpha his pack had taken prisoner just days before.</p>",
  "notes": "<p>the ranking system among the rogues was inspired by afro samurai!! thank u very much to alice and nav for your help with this, could not have made it without you ;;____;;</p>\n<p>check out <a href=\"https://babybimge.tumblr.com/post/639301428251426816/ahhhhh-i-have-been-rereading-jonghyunslisterines\" rel=\"nofollow\">this incredible art</a> for the fic by babybimge!!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>before u ask i AM writing a sequel to this already u__u no clue when if ever it will be done but it exists!</p>\n<p> </p>\n<p>\n<a href=\"https://twitter.com/ahegaojimin/\" rel=\"nofollow\">twitter</a>\n</p>",
  "text": "<p>They catch the rogue on the morning of the first snow. </p>\n<p>Jimin’s drawing sap with a handful of other omegas when his cousin runs to tell them the news. The day is cold and gloomy; Jimin had woken up with the scent of the soon-to-fall snow in his nostrils. Still, when the first flakes touch his skin and melt, he glances up at the sky in surprise. The clouds are thick, dark, and foreboding, and Jimin takes stock of the instinctual discomfort in his chest when Sana finds them. </p>\n<p>“It took three alphas to bring him in,” she tells them, eyes alight with a mix of fear and excitement. “His wolf is <em> huge </em>.”</p>\n<p>The discomfort flutters, intensifies, and Jimin feels afraid. </p>\n<p>“What did he do?” Taehyung asks, nearly knocking over a bucket in his curiosity. </p>\n<p>Her voice lowers, and they lean closer to hear. “Scent-marked part of our territory.”</p>\n<p>Jimin gasps along with the rest of them. Their territory is clearly marked; the rogue should not have set foot on it, let alone dared to make his mark. Though rogues have their own code of honor, their own set of rules, it’s unspoken that packs and rogues don’t mix. </p>\n<p>“Did you see it?” Jimin asks, his heartbeat picking up speed. “His wolf.”</p>\n<p>“I saw them drag him in. They have him chained up in the paddock for now.” She’s a little breathless, and Jimin thinks her gaze holds more excitement than fear. “He’s a Gray Wolf alpha, prettiest fur I’ve ever seen. White all down his belly.”</p>\n<p>“What about the goats?” Mina asks, brow furrowing. </p>\n<p>“They’ve been herded to the opposite side; there’s enough room. Alpha Yoongi is keeping watch.”</p>\n<p>“Well, what are we waiting for?” Taehyung exclaims. “Let’s go!”</p>\n<p>The others are in quick agreement, gathering up their buckets, but the fear stirs in Jimin’s belly like a living thing. He has more reason than any to fear rogues; the capture breeds no curiosity for him. He doesn’t have the luxury of feeling excited. </p>\n<p>“We should finish collecting the sap,” he says, and the others glance back at him.</p>\n<p>“We have more than enough,” Tzuyu insists. “Come on, Jiminie.”</p>\n<p>They’re already moving on without him. Wind stirs through the trees with a howl, pushing his fur-lined hood against his head. The snow is already collecting on the ground around him. He swallows harshly and follows. </p>\n<p>The camp is in a frenzy when they arrive. Jimin spies his mother and others setting up a canopy of animal pelts over the fire to protect it. They’ve already begun preparing seats for the elders in anticipation of the meeting. The pack will have to convene to decide the rogue’s fate together. </p>\n<p>Sensing his fear, Taehyung reaches back and takes Jimin’s hand in his, the warmth of his skin seeping into Jimin’s like a comfort. A small crowd of people have already gathered by the paddock, whispering among themselves. They push their way to the front, and Jimin’s breath catches in his throat. </p>\n<p>The rogue has shifted back to his human form, and Jimin doesn’t want to imagine what his wolf looks like when he’s threatening enough like this. He is defenseless in every way; chained firmly to the paddock, naked, snow collecting in his dark hair. But he looks like he could break his way out easily. He kneels in the dirt with his head held high, his muscles corded and sinewy, strength in every part of his body. Scars cover his body - on his thick arms, across his chest and abdomen, one on his jaw. A bracelet of what looks like a string of canines dangles from his wrist, looped twice, with a red bead in the midst of all the teeth. </p>\n<p>He seems impervious to his audience. His gaze is fixed firmly on Yoongi, who paces on the other end of the paddock, keeping the goats at bay. Yoongi does not look back, but Jimin knows him well enough to pick up on the tension in his body. He’s on guard. </p>\n<p>The crowd parts, the murmuring quiets, and Jimin is jerked from his reverie. The Pack Alpha stops at the edge of the paddock, staring at the rogue. </p>\n<p>“Omega Jimin,” he calls, and Jimin’s blood freezes in his veins. “Fetch furs for the rogue.”</p>\n<p>Everyone’s looking at him; Jimin feels like melting into the ground. </p>\n<p>“I can do it,” Taehyung offers immediately, squeezing Jimin’s hand, but Dakho turns around and meets Jimin’s eyes. His are unyielding as always. </p>\n<p>“I asked Omega Jimin.”</p>\n<p>“Yes, Alpha,” Jimin murmurs, ducking his head and walking quickly to the tent where they have been building up their stores for the winter. He has long since stopped railing at the unfairness of the Pack Alpha’s treatment. He finds it easier to give in. </p>\n<p>Jimin opens a trunk full of furs and digs out the largest pelt. It has not yet been shaped into a coat, but it will be enough to keep the rogue warm for now. When he returns to the paddock, he pushes open the swinging gate and steps inside. Yoongi nods to him. He can see the way Yoongi tenses more visibly now, abandoning his pacing in favor of turning his body toward the rogue, ready to jump in if Jimin needs him. </p>\n<p>“Father,” a voice calls, and Jimin looks over. Seungcheol comes to a stop by the Pack Alpha’s side. “Let me do it.”</p>\n<p>“Omega Jimin will do it.” Pack Alpha Dakho’s voice is firm, and Jimin doesn’t know why Seungcheol even bothered. He looks like he wants to argue, but he turns his gaze on Jimin instead. </p>\n<p>Jimin looks away. </p>\n<p>The rogue has finally torn his gaze away from Yoongi to look at Jimin now, his nostrils flaring as he picks up on Jimin’s scent. His gaze is heavy, but Jimin walks toward him with steady steps. They have him chained under the covered part of the canopy, but still the snow has blown to settle on his hair and skin. Jimin can see a glittering flake suspended on the end of his lashes.</p>\n<p>Jimin kneels, his breath catching when the rogue’s musky scent hits him, strong cloves and cinnamon. Jimin has never encountered a scent so potent, so raw, so <em> alpha </em> that he finds himself briefly unable to move. In the pack, their scents are mixed with each other’s; Jimin knows his own is always muddled by Taehyung’s and Sana’s and his mother’s, given the frequent scenting. But the rogue smells of no one but himself, unrestrained, heady. Jimin’s omega wants to submit on instinct.</p>\n<p>He fights it back, swallowing harshly, breathing through his mouth. His hands tremble, but he reaches to drape the pelt around him. He flinches when the rogue lets out a breath that tickles his skin, and the rogue notices. Jimin wonders if he imagines the way the tension leaves the rogue’s body, the way he makes himself a little smaller. </p>\n<p>Jimin’s heartbeat picks up. He holds his breath, secures the pelt, then stands. When he turns away, he clutches the fur of his own coat to hide the way his hands shake as he walks out of the paddock. He can breathe again.</p>\n<p>“Thank you, Omega Jimin,” says Dakho, and Jimin nods. </p>\n<p>He avoids Seungcheol, though he can feel his attention. He bypasses the crowd and finds his mother, setting to work on the canopy, and he finally lets himself breathe again. The rogue’s scent is still strong in his nostrils. His mother gives him a look full of worry, but he forces a smile for her. </p>\n<p>Taehyung’s father has begun to light the incense, and the elders are making their way to the fire. Elder Man holds her hand out, and Jimin takes her arm and helps her take a seat on a pile of cushions set out of her. </p>\n<p>“Do not be so afraid,” she tells him quietly, patting his hand in comfort.</p>\n<p>“I am not afraid.”</p>\n<p>“I may be old, but my nose still works,” she says wryly, and this time his smile isn’t forced. </p>\n<p>Jimin stands on the outskirts, not quite covered by the canopy, where the snow catches in the fur lining his hood. The entire pack has gathered, even the pups, hovering on the edges, watching with wide eyes or lobbing snowballs at each other when their parents look elsewhere. </p>\n<p>Jimin’s earliest memory is of the tribe convening under the embroidered canopy. He hadn’t hovered at the edges then; he had sat by the fire with his mother, the stern gaze of the elders fixed on him. They had made the decision to banish his father that day. He was too young to remember much, but he remembers little things: the way the fire had been too hot, and how sweat had beaded on his temples. The way he had been picking at a thread on his mother’s shirt until she swatted his hand away. </p>\n<p>“Bring him,” says Elder Yang, and two other alphas join Yoongi in the paddock to move the rogue. </p>\n<p>He doesn’t fight them off, letting them lead him over and sit him by the fire. </p>\n<p>“Untie him.”</p>\n<p>Jimin starts, surprised that they would dare. The alphas look surprised, too, exchanging glances. But no one questions the elders, so they untie him. The rogue moves to tighten the pelt around his body. He remains kneeling, resting his hands on his knees as he faces the elders. </p>\n<p>“The Choi Pack convenes to discuss the fate of a trespassing rogue,” says Elder Yang, her voice ringing throughout the clearing. Taehyung finds his way to Jimin’s side, brushing their shoulders together. “We would have your name.”</p>\n<p>“Jungkook,” answers the rogue. His voice is strong; it betrays no wariness or regret. </p>\n<p>“First, there is the matter of you trespassing on our territory. Alphas Yoongi, Hoseok, and Namjoon found you within the borders of our land. You proceeded to attack them when they approached you. Explain yourself.”</p>\n<p>“I was caught in an altercation with another rogue,” says Jungkook. “In my haste to escape, I crossed into your territory without realizing it.”</p>\n<p>“And the scent-marking? What drove you to mark another pack’s territory?”</p>\n<p>“I had to piss.”</p>\n<p>No one dares to laugh, but Jimin sees more than one person clapping a hand over their mouth to stop themselves. His own fear is driven briefly away in favor of amusement, but he sobers quickly enough. </p>\n<p>“It would be wise to check your arrogance,” says Elder Man, “given the situation you’re in.”</p>\n<p>Jimin sees the way Jungkook’s jaw tightens. </p>\n<p>“I mean you no harm,” he says stiffly. “Let me be on my way, and you will never see my face again.”</p>\n<p>“You have seen enough of our territory to be of harm to us. There are many who would like to have that knowledge.” Elder Nam clears his throat, addressing the pack instead. “The pack will make its decision as one. Having heard the rogue’s side, we will now consider our options. At dawn, we will meet again.”</p>\n<p>“The rogue will be given a place to sleep and food to eat,” Alpha Dakho decides. “Omega Mina and Beta Seokjin, prepare a place for the rogue to rest. Omega Jimin will take charge of his meals.”</p>\n<p>Jimin winces. Of course. </p>\n<p>Mina and Seokjin disperse to do their task, and Jimin breaks away to do his own. He heads toward the tent he shares with his mother, Sana, and his aunt and uncle. Just before he lifts the flap to enter, a voice at his back stops him. </p>\n<p>“Jimin.”</p>\n<p>Naturally, it belongs to Seungcheol. Jimin turns to face him, trying not to look as stiff as he feels. “Yes, Alpha Seungcheol?”</p>\n<p>“There is no need to call me that. I have told you before.”</p>\n<p>Jimin grinds his teeth together. “Did you need something?”</p>\n<p>“I wanted to apologize for my father’s behavior,” he says, and some of the bitterness in Jimin’s heart eases. “It’s not fair of him to treat you the way he is. I will accompany you to deliver the rogue’s meals.”</p>\n<p>The bitterness returns as soon as it fades. “That will not be necessary.”</p>\n<p>“Let me protect you,” Seungcheol’s voice is assured, his handsome face framed by his snowy hood. He wears the pelt of a bear, another mark of his prowess. No one else of their generation has yet to kill a bear. Seungcheol’s father killed one in his youth, and two of the elders as well. They say Jimin’s father had the pelt of a bear. “It is the least I can do to account for my father’s unfair attention.”</p>\n<p>Jimin sighs. He can tell he won’t be able to sway Seungcheol easily. It’s only because of him that his father pays Jimin any attention at all. The Pack Alpha had been kind to Jimin as a child, until they grew up and Seungcheol made his intentions clear. It seemed that Jimin’s alpha-less life was only pitiable until it came to the question of mating his son. Then it became a disgrace. </p>\n<p>Jimin liked Seungcheol well enough, but now he wants nothing to do with him. He can’t bear the way the rest of the pack looks at him. Seungcheol had told him it did not matter, that they were only jealous, but Jimin knows there’s more to it than that. They don’t think he’s worthy. </p>\n<p>“Alright,” Jimin agrees reluctantly. “Please wait while I prepare the meal.”</p>\n<p>Seungcheol nods, and Jimin ducks inside his tent. He starts a fire and boils tea with goat’s milk, then prepares a plate of dried meat with herbed vegetables. Their pack takes meals together, but every tent has a small store of food just in case. He places the bowl of tea and plate of food on a painted tray then leaves the tent.</p>\n<p>Seungcheol falls into step beside him. Jimin tries to pretend he doesn’t feel the stares of the other pack members. His presence feels even more unnecessary when Jimin finds three alphas keeping guard around the storage tent, which they seem to have converted into a place for the rogue to sleep. </p>\n<p>Seungcheol lifts the flap, letting Jimin through, and waits there with it raised. The stores have been cleared out, leaving bedding in the middle of the room and a bowl for washing in the corner. Jungkook sits on the bedding now, arms wrapped loosely around his knees. Someone has found him clothes, but he still wears the pelt around his shoulders. He looks up at Jimin’s entrance, nostrils flaring like before. He can’t have been inside the tent for long, but already his scent fills it, and Jimin finds it even more difficult to bear in the close proximity. </p>\n<p>“Dinner,” Jimin says, struggling to get his voice out, crouching to place the tray carefully before him. His mind feels hazy. </p>\n<p>Jungkook looks down at it, then back up. “Thank you,” he says, voice low. </p>\n<p>The alphas of Jimin’s pack are tough as nails, and so are the omegas; it is not an easy life they live. But Jungkook is something else, something beyond the rest of them. He is battle-hardened. </p>\n<p>Jimin nods, Adam’s apple jumping as he swallows, and leaves. </p>\n<p align=\"center\">❄</p>\n<p>The morning brings with it snow that falls hard and heavy, and news far more pressing than a trespassing rogue. </p>\n<p>The tribe does not convene to decide Jungkook’s fate; the elders spend it in conversation with the Pack Alpha instead. Jimin brings Jungkook a breakfast of tea and sweet bread, Seungcheol hovering over his shoulder, and again Jungkook thanks him in his low voice. Later, when he’s tending to the goats with Sana, he learns of what has happened. </p>\n<p>Their pack’s territory lies not far from that of the Yoo Clan, who are known for being particularly vicious. No man’s land acts as a buffer between the two packs, but for years the Yoo Clan has tried their hardest to encroach upon their territory. On their nightly patrol, some of the alphas from Jimin’s pack discovered the Yoo Clan had scent-marked their territory halfway into the no-man’s land. </p>\n<p>Their actions are a bid for war. Jimin’s pack is mostly peaceful, tending to stay out of disputes, but something like this cannot be ignored. </p>\n<p>“Do you think it is related?” Jimin asks, checking one of the goat’s hooves for rot. Jungkook could be spying. “The rogue, I mean.”</p>\n<p>Sana shrugs. “Could be. They do say packs hire rogues out for things like this.”</p>\n<p>Jimin hums, moving on to the next goat.</p>\n<p>“You have been giving the rogue meals. What is he like?”</p>\n<p>“I haven’t spoken to him much.”</p>\n<p>“No?” Sana glances up, eyes glittering with surprise. Jimin frowns at her. “Why not?”</p>\n<p>“Why would I? He is dangerous.”</p>\n<p>“Well, yes, but are you not curious?”</p>\n<p>Jimin pauses in his task, frown deepening. “Curious?”</p>\n<p>“About your father.”</p>\n<p>She hesitates right after she speaks, belatedly realizing that maybe she should not have brought up Jimin’s father after all. Jimin returns to checking the hooves, but he feels unsettled. </p>\n<p>“No,” he mumbles. “I suppose I did not think to ask.”</p>\n<p>She doesn’t tell him he should, but he knows she’s thinking it. They finish their work in silence and join his mother to begin mending blankets. Naturally, Jimin can’t get Sana’s words out of his head. </p>\n<p>When Jimin’s father was banished, he would have had no other choice but to become a rogue. Packs don’t take in cast-offs. Werewolf packs of the north have dwindled over time; there are few of them left, and even less of them are packless. Unless Jimin’s father had left the north entirely, the chance that Jungkook has run into him over the years is very high. They say the rogues have some sort of ranking system, and that they seek each other out often. </p>\n<p>But there’s no reason to ask, not really. Jimin’s father is the reason he’s so frightened of Jungkook to begin with. </p>\n<p>Later, while Jimin prepares a nighttime meal for Jungkook, his mother asks him to be careful. </p>\n<p>“They live a very different life than us,” she tells him quietly, bent over her weaving. “One full of violence.”</p>\n<p>Jimin thinks of the scars on Jungkook’s body. It must have been suited to his father, then, a life full of violence. Jimin remembers very little of his father; he was far too young when he was banished. Most of what he knows is hearsay. His mother told him enough to tide him over, back when he first presented and felt like an adult. He was cruel. He hurt her. The pack could not let it continue. </p>\n<p>From the others, he’s caught snippets of other stories - his father used to catch squirrels and burn them alive; as a young man, his father used to beg for war. His father used to disappear overnight and return with the scent of omegas from other packs clinging to his skin, even after he mated Jimin’s mother. In all his years, Jimin has never heard a good story about his father. </p>\n<p>“I am glad Seungcheol has been accompanying you,” she continues. “Be sure not to go without him.”</p>\n<p>“There are three alphas guarding him,” Jimin mutters. “Even if Seungcheol is not there, it does not matter.”</p>\n<p>His mother sighs. She’s long since given up on arguing with him about Seungcheol. </p>\n<p>Jimin delivers Jungkook his meal, and after Jungkook thanks him, Jimin hesitates. He stares at the jagged scar that stretches from Jungkook’s wrist to his elbow and considers asking him. He wonders what he would even say. <em> Excuse me, do you know my father? I do not know anything about him except that he was horrible </em>. </p>\n<p>He can feel the weight of Jungkook’s gaze and glances back up. Jungkook’s head is tilted expectantly, one eyebrow raised, long hair falling to frame his face. He’s waiting. Jimin clears his throat and leaves. There’s little he can say with Seungcheol hovering over his shoulder, anyway. </p>\n<p>That night, Jimin lies awake by his mother’s side, restless. He can hear her soft breaths in sleep, the gentle snores of his uncle on the other end of the tent. Outside, the light fall of snow continues. He has to ask. It will haunt him forever if he doesn’t, just like his father’s presence has haunted him for as long as he can remember. </p>\n<p>Jimin wakes well before dawn. </p>\n<p>He prepares Jungkook’s breakfast while his mother and Sana sleep on; his aunt and uncle are already awake and about, accustomed to being early risers. Leaving the tent so early, before light breaks through the clouds, feels oddly surreal. The snow has stopped, but the ground is thick with it. He wades through it, shivering, to Jungkook’s tent. No one is awake save for a few people here and there. </p>\n<p>He pauses outside Jungkook’s tent and wonders if he’s even awake. But then he hears him move, so he announces his presence and lifts the flap. </p>\n<p>Jungkook is wrapped in furs, shivering even harder than Jimin. The storage tent is built without smoke flaps, so he can’t build a fire. Jimin frowns, feeling abruptly guilty. </p>\n<p>“Do you need more furs?” he asks. </p>\n<p>Jungkook looks surprised that he’s being spoken to. His gaze shifts behind Jimin, as if looking for someone, then back to him. “No.”</p>\n<p>Jimin nods and sets the tray before him. </p>\n<p>“Thank you,” Jungkook says, as always. </p>\n<p>Unlike always, Jimin kneels before him, hands clenched into fists in his coat as he quells his nervousness. He never lingers for more than a moment, and now that he’s sitting here, Jungkook’s scent overwhelms him. The powerful cloves and cinnamon fill Jimin’s lungs until he finds it hard to breathe. His head swims. “I have a question.”</p>\n<p>Jungkook’s guarded eyes flicker. He drapes an arm over his knee. “Where is your intended? Not an early riser?”</p>\n<p>A flush rises to Jimin’s cheeks. “He is not my intended. And that’s none of your business.”</p>\n<p>“I have a feeling whatever you are about to ask me is none of your business, either.”</p>\n<p>“You don’t know that.”</p>\n<p>“Do I not?” His tone is arrogant, the tilt of his head more so. Jimin regrets coming here, regrets asking. Regrets pitying him. </p>\n<p>“I haven’t asked.”</p>\n<p>“Ask, then.”</p>\n<p>Jimin swallows, throat dry. “Out there, did you - did you know an alpha by the name of Park? He would be about the Pack Alpha’s age.”</p>\n<p>Jungkook’s expression is impassive. “We do not have family names <em> out there </em>.”</p>\n<p>Something about the way he says it feels like mockery. Jimin’s face grows hotter. Of course they have no use for family names. He feels like a fool. He knows nothing about rogues, yet here he is, acting like he does. </p>\n<p>“Kangdae was his name. He has been packless since the Great Blizzard.” </p>\n<p>Jungkook is silent for so long that Jimin fears he won’t answer after all. “I knew him,” he finally says. </p>\n<p>Jimin’s heart stutters, then swells into his throat. “Knew?”</p>\n<p>“He is dead.” </p>\n<p>Jungkook’s blunt about it, but Jimin feels very little sadness at the thought. His father has been dead to him his whole life. “How long?”</p>\n<p>“Two winters.”</p>\n<p>“What did - what did you know about him?”</p>\n<p>“He was the number one,” Jungkook says, and Jimin’s breath catches. </p>\n<p>His knowledge of the ranking system is lacking, but he does know that in order to increase rank, one must kill the rank that precedes yours. The First Rank is the most coveted; kill the number one, and the killer will take their place. It’s a life of constant danger. </p>\n<p>“He was killed for his rank?”</p>\n<p>“Of course.” Jungkook leans back. He no longer shivers. He gazes at Jimin through lidded eyes, and something about the way he looks at him feels dangerous. Like a predator looking at its prey. Jimin is not used to being prey. He’s a wolf, after all. “He was your father,” he discerns, and Jimin finds himself nodding. </p>\n<p>“I did not know him.” </p>\n<p>He clears his throat, abruptly uncomfortable. He shouldn’t be here. It shouldn’t matter that his father is dead, that his father was number one. His father is barely even his father. Can someone be family if they only share your blood? If you cannot remember their face?</p>\n<p>Rubbing his palms against his coat, Jimin stands. “I will take my leave. Thank you for telling me what you know.”</p>\n<p>In lieu of a response, Jungkook watches him with that same, lidded gaze. Lifting the flap, Jimin pauses, glancing back. </p>\n<p>“What is your rank?” he asks out of pure curiosity, not really expecting a response. </p>\n<p>The corner of Jungkook’s mouth lifts up. It’s not a smile - not really.</p>\n<p>“First.”</p>\n<p align=\"center\">❄</p>\n<p>Jimin feels sick. </p>\n<p>The air is cold, but still the fire in their tent feels like too much, and he writhes away from it, sweat dripping down his skin. His shirt clings uncomfortably to his neck, and it feels tight, choking him. </p>\n<p>“It can’t be your heat.” His mother presses a worried hand against his forehead. “It isn’t your time.”</p>\n<p>“You must have caught a fever.” Sana’s already brewing an herbal tea for him. </p>\n<p>Jimin strips off his blanket, breath coming quick and heavy. His body feels like it’s on fire, but all he can think about is Jungkook. Number one. His father’s killer. He hasn’t told his mother yet, of course, hasn’t told anyone, and the secret feels like it’s suffocating him. He should have known, should have guessed it. The red bead on his bracelet has the number one etched into it. But Jimin had only noticed in a passing way. </p>\n<p>“Hurts,” he mumbles, clutching his belly. </p>\n<p>“Did you eat something bad?” His mother frowns. “You do smell a little like heat, maybe it has come early?”</p>\n<p>“Why would it?” Sana says. “Jimin is always so regular.”</p>\n<p>Jimin wipes a droplet of sweat from his eye and wonders the same thing. He hasn’t had an early heat since the first two years after he presented, when he was irregular anyway. But if it isn’t a heat, it’s a fever, and that alternative feels worse. Last winter, they had lost two to fever. </p>\n<p>He rolls over, clutching his belly, and hears someone outside shout. They ignore it, but then there’s another, and another, until the commotion outside grows and they all shift in confusion. Jimin sits up, and his mother stands. </p>\n<p>“What’s happening?” Sana breathes, and Jimin can see his own fear reflected in her eyes. </p>\n<p>The flap of their tent lifts, and Taehyung’s standing there, eyes wide, chest heaving. “The Yoo Clan. They’re attacking. We have to go.”</p>\n<p>They’re all moving before he can finish speaking. </p>\n<p>His mother snatches up the emergency bag she keeps in case of such a situation, and Jimin stumbles to his feet and wraps his furs around himself. Sana is already dressed, and she drops to her knees to help him put on his boots before grabbing his hand and leading him behind her. </p>\n<p>“Alpha Dakho says we take the pups and go,” Taehyung says as they follow him out.</p>\n<p>The camp is chaos. Someone’s stamping out the fire, and others are scrambling to save whatever of their possessions they can transport. At the edge of camp, Jimin sees Yoongi and Hoseok and Namjoon stripping off their clothes before shifting into their wolf forms and running off into the woods. </p>\n<p>Jimin follows Sana to where Seokjin and his father are herding a few of the pups away. “Follow the river,” he tells them, and they all take a few pups in hand and start to run. </p>\n<p>The adrenaline outdoes the fear; Jimin moves and feels nothing but urgency. He has one pup on his hip and another at his heels, and he can see his mother ahead of him and hear Taehyung’s voice behind him. The river will be cold, but it’ll mask their scents. Their footprints are clear in the snow, but towards the back, Jimin can see Seokjin and Tzuyu following with a brush, clearing away their prints as they move.</p>\n<p>Their pack had been attacked once, when his mother was pregnant with him. Six alphas died, and one omega was taken, never to be heard from again. He’s heard the story many times; even now, they tell it around the fire, a sobering tale of what danger lies out there. The constant threat of danger makes the pack essential. Stay with the pack, and maybe you’ll survive. </p>\n<p>They reach the river before long, and Jimin struggles to breathe, chest heaving from exertion. He sets the pup down, and she runs to join her father. Everyone sets to work covering themselves with mud and water, masking their scents, sticking close to the banks of the river where their prints will be washed away before long. </p>\n<p>“More,” Taehyung tells him. “I can still smell you.”</p>\n<p>Jimin reaches for more mud. Taehyung frowns, leaning in, and sniffs at his neck. </p>\n<p>“Jimin,” he says. “Are you in heat?”</p>\n<p>The pain in his belly intensifies, a reminder. He grows aware again of how hot his body is despite the cold air. As if on cue, he leaks a gush of slick. Taehyung’s nose wrinkles. </p>\n<p>“You are,” he says, surprised at first and then afraid. Jimin sees the way his expression changes. </p>\n<p>The scent of a heat cannot be masked. </p>\n<p>Jimin can lather himself in as much mud as he wants - can douse himself in the river, even, but his scent will carry. His hands fall to his sides. He looks around, at the pups sitting in the mud, at Mina, who has started crying now that the adrenaline has settled. He looks at his mother. </p>\n<p>“I have to go.”</p>\n<p>“Jimin, no - ” Taehyung’s voice rises in a cry, but Jimin’s already backing away. </p>\n<p>He cannot put the rest of them in danger. </p>\n<p>“Jimin, please - ”</p>\n<p>Jimin turns away and begins to run. </p>\n<p align=\"center\">❄</p>\n<p>It hurts too much to move. Jimin lies at the base of a tree, arms wrapped tightly around himself, using every last bit of strength to keep from whimpering. Not that it matters; they’ll smell him long before they hear him. He’s drenched with sweat, his discarded furs lying at his feet, though logically he knows he must wear them. He might feel hot, but the freezing air will still hurt his body. </p>\n<p>But he has begun to move past the point of logic. </p>\n<p>In his 24 winters of life, Jimin has never once felt so helpless. </p>\n<p>It won’t take long for the Yoo Clan to find him. They will rape him if they do; he knows that. He wonders if maybe it would be easier to kill himself. But he can barely lift an arm, the weakness taking hold, and so even that choice has been taken from him. </p>\n<p>His nose twitches, and he breathes in the familiar scent of cloves and cinnamon. His body registers <em> alpha </em>, and he whimpers, head lifting up on instinct. </p>\n<p>“Shit.” </p>\n<p>Jungkook stares down at him with a troubled frown, his nose wrinkled. He must have escaped during the chaos. </p>\n<p>Part of Jimin wants to lean toward him, reach out for him, beg for him. But enough lucidity remains for him to recoil. “No,” he rasps. “Don’t touch me.”</p>\n<p>Jungkook takes a step back. He looks away, then he looks back down at Jimin. His frown deepens. He takes another step away, and Jimin’s eyes drift shut. It’s better if Jungkook leaves. Jimin can’t trust him any more than the Yoo Clan. </p>\n<p>He hears twigs snap beneath heavy feet and opens his eyes. </p>\n<p>Jungkook’s wolf is as large as Sana had said - he’s as beautiful, too. The white of his neck and belly is pristine, glowing in the afternoon light, the gray on top just as sleek. His eyes glitter, and he stands powerful and massive, and Jimin’s afraid. The bracelet of canines has been unlooped, large enough to remain around the front leg of his wolf. </p>\n<p>Then Jungkook crouches, presenting his back for Jimin, and Jimin’s breath hitches. </p>\n<p>He wants him to come. </p>\n<p>Jimin can’t tell if he is being saved or taken into something even worse. He shakes his head and pulls back. </p>\n<p>Jungkook growls, low and menacing. He drops the clothes in his mouth and his massive jaw and glinting teeth come for Jimin instead. Before Jimin can cry out, Jungkook’s teeth snag on the back of his shirt and lift him bodily, tossing him onto his back like a rag doll. Jimin scrabbles for purchase, grabbing onto Jungkook’s thick, soft fur before he falls. </p>\n<p>Jungkook picks the wad of clothing back up, then he starts to run. </p>\n<p>Jimin holds on with all his strength, jostled back and forth as Jungkook weaves through the land. At first, he’s afraid, considers letting go, but he has no doubt that Jungkook would stop and come back for him - and he might break a few bones in the process. Then he begins to go in and out of consciousness, his body exhausting itself to sleep, jerking awake here and there when the path grows rougher. </p>\n<p>He isn’t lucid enough to keep track of how long they travel. When Jungkook finally comes to a stop, the terrain is rocky, snow-covered cliffs rising above them. He finds them a small cave, brushing snow out of the mouth with his snout, and deposits Jimin in the back, well away from the reach of the wind that blows snow inside. Jungkook rubs himself on every corner of the cave, his cinnamon and cloves growing stronger and stronger until a low whine starts in the back of Jimin’s throat. </p>\n<p>Jungkook shifts back into his human form, slipping into his clothes before the cold can hurt him. Then he turns back to face him, and Jimin’s whine grows full-blown. He’s leaking so much slick now that his thighs slide together. </p>\n<p>“Alpha,” he slurs, lashes fluttering, reaching for him. </p>\n<p>Jungkook ignores him. He picks his fur pelt off the ground and approaches, crouching by Jimin’s side and wrapping it around him. Jimin whimpers at the proximity, Jungkook’s heady scent filling his lungs. </p>\n<p>“Alpha, please.” He pushes himself up, nosing his way to Jungkook’s scent gland, but he’s promptly stopped by Jungkook’s firm grip on the back of his neck. He falls limp with a quiet whine. </p>\n<p>“No,” Jungkook says sternly, and Jimin wilts, his eyes filling with tears. Jungkook pushes him down and Jimin rests on the fur as if it’s bedding, sobbing quietly. </p>\n<p>“Hurts,” he sniffs, rubbing his nose into the pelt for Jungkook’s scent. Jungkook moves away, and Jimin chokes out another sob, feeling unwanted and unworthy. </p>\n<p>Jungkook leaves the cave and some of the intensity of his scent eases. Jimin turns over onto his belly, hips pushing against the furs for the much-needed pressure on his cock. He’s using whatever last willpower he has to restrain from doing any more than that when Jungkook returns, arms laden with firewood. Jimin calls out to him, feeling weak and pathetic, but Jungkook sets to building the fire. His jaw is tight, and he doesn’t look over at Jimin once. </p>\n<p>“Please, alpha,” Jimin whines, the tears in his eyes a mix of need, shame, and hurt. “N - need you.”</p>\n<p>When the fire has been built up to a comfortable height, Jungkook leaves the cave again. This time he does not return. </p>\n<p>Jimin loses the last of his strength while he waits and spends the rest of the time rutting against the furs. By the evening, he has slipped fully into the heat headspace, and he holds very little awareness for what happens over the next few days. He’s lucid for bits and pieces of it. He knows he dreams about Jungkook fucking him hard and fast into the rough cave floor, knot swelling inside him until he screams; he knows he tells Jungkook about it, too, but he gets ignored again. </p>\n<p>Jimin’s mind works only as far as Jungkook’s scent and his own need. Jimin thinks Jungkook walks in on him with three fingers up his ass at one point, and he isn’t delirious enough when it happens to avoid the burst of humiliation. He knows Jungkook spends too much time outside the cave, but during one of his lucid stretches, he realizes it begins snowing again, and after that Jungkook stays inside with him. It’s harder when he is there. During a break in his heat, Jungkook forces him to eat, but it comes back while he tries to eat and he ends up in Jungkook’s lap, begging, promising. Jungkook holds him firm - he thinks he makes him finish eating the radish, too - and then deposits him back on his makeshift furs. </p>\n<p>It stops snowing, and Jungkook returns to staying outside of the cave. Sometimes Jimin notices new things in the cave: another bedroll, an extra bowl and cup for meals. Jungkook is caring for him in the best way he can, but Jimin’s omega suffers through the worst heat he has ever had. His hormones rage from Jungkook’s proximity, from the strength, the rawness of his scent. Bearing his heat is so much harder when there is an alpha right next to him who could make the pain go away. </p>\n<p>In his old pack, unmated omegas spent their heats in a special tent set at a small distance from the main encampment. Their omega family members would come to care for them, bringing them food and filling tubs of water for them to bathe in. The betas would stand guard. It was the same for unmated alphas and their ruts. There was never any proximity to alphas during heats or omegas during ruts; the pain was far easier to bear when you smelled no alphas nearby. You knew you were alone. </p>\n<p>But Jimin is not alone. Jungkook’s scent fills his lungs until he’s delirious with it, until his mind is a haze of desperation and desire. By the third day of his heat, he loses his last shred of sense, and after that everything is a blur. </p>\n<p align=\"center\">❄</p>\n<p>When Jimin wakes, he feels his lucidity returning to him, and with it his sense of his surroundings. He’s being carried, surrounded by Jungkook’s heady scent, and the air is cold against his skin. Jungkook’s pelt is wrapped around him, and it embarrasses him to feel how <em> wet </em> he is - covered in cum and slick and drool and tears. The dampness only makes him colder. He shivers, curling into the warmth of Jungkook’s chest on instinct. </p>\n<p>If Jungkook registers his waking, he doesn’t show it. </p>\n<p>Jimin hears the rushing of the river, smells the fresh water sharp in his nostrils. Jungkook sets him down by the bank with a bar of soap at his side. Jimin catches the implication. The water is cold, so he works quickly, stripping off his clothes and leaving them on the ground before hopping into the water to wash himself. While he bathes, Jungkook takes his clothes and scrubs them clean on a makeshift washboard fashioned from smoothed down sticks. </p>\n<p>The embarrassment sits hot in Jimin’s belly. As if the past few days of begging were not terrible enough, now Jungkook is washing the cum and slick out of his clothes. He can’t remember the last time he felt so humiliated - perhaps the day Seungcheol had announced his desire to court Jimin in front of everyone, and Jimin had felt the way everyone looked at him. </p>\n<p>His clothes will take time to dry, so Jimin shifts into his wolf form and follows Jungkook back to the cave with them bundled in his jaws. The strong scent of his heat lingers in the cave and feeds the humiliation further. He lays the clothes out by the fire to dry and curls up in a corner, watching Jungkook with wary eyes. </p>\n<p>Jungkook doesn’t seem bothered. He leaves the cave and returns dragging the pelt of a bear, at the sight of which Jimin whines. </p>\n<p>“You left your furs behind,” is all Jungkook says, and Jimin is left watching with wide eyes as he begins to work with the pelt. </p>\n<p>In his pack, a gift of furs would mean a courtship. Jimin isn’t fool enough to think Jungkook’s courting him, but still - the implication is heavy. Jungkook must know it is. </p>\n<p>When his clothes have dried enough to be bearable, Jimin shifts back and dresses. He goes to sit by the fire, across from where Jungkook still works on the bear, with stiff shoulders and a set jaw. </p>\n<p>“Where did you get the pelt?”</p>\n<p>“I killed it. I was saving it in a place not far from here while it tanned.”</p>\n<p>Jimin nods. “I have to return to my pack.”</p>\n<p>Jungkook doesn’t spare him a glance. He works with efficiency, and Jimin wonders how many bears he has felled over his lifetime. “Your pack is most likely dead by now. If not dead, taken.”</p>\n<p>Jimin’s heart stops full in his chest. It stutters back to a start, but his breath doesn’t come with it. “You do not know that.”</p>\n<p>“Your pack is small, your alphas weak. I know it.”</p>\n<p>Jimin’s hands curl into fists. “Why did you not leave me there to die with my weak pack then?”</p>\n<p>Jungkook pauses briefly, glancing up at him. His eyes are hard. “You think they would have killed you, an omega in heat?” </p>\n<p>Jimin’s face flames hot with shame and fear. He knows Jungkook is right; he saved his life. Still, Jimin has to find his family. They can’t be dead; he refuses to believe it. Some of them must have made it out. If there is even just one member of his pack left alive, he would die trying to find them. </p>\n<p>“Thank you for saving me,” Jimin says stiffly. “I owe you a debt. But I must return to my pack.”</p>\n<p>Jimin stands, and Jungkook sets down the pelt with a deliberate gesture. He wipes his hands on a rag, and he stands, too. Jimin registers the way Jungkook towers over him, power in every inch of his body, and tries not to shrink back. </p>\n<p>“I cannot let you leave.”</p>\n<p>Jimin clenches his fists tighter to hide the way they tremble. “You can’t keep me against my will.”</p>\n<p>“You want to go back out there, reeking of heat?” He tosses the rag away with a sharp gesture. Jimin follows the line of his arm with a harsh swallow, noting the way his corded muscles pop. “Be my guest. But you carry my scent now, too.”</p>\n<p>His words are true enough. The pelt that Jungkook had wrapped around his body for three days carries his scent heavily, and after Jimin spent another two in it, their scents have inevitably mixed.</p>\n<p>“And?” Jimin demands. </p>\n<p>“I will not let your foolishness lead my enemies straight to me. You’re stuck with me whether you like it or not.”</p>\n<p>“I am not afraid of you.”</p>\n<p>Jungkook takes a step forward, then another, and the sound of them is heavy, echoing throughout the small cave. Jimin swallows, forces himself to stay still, to not back down, even as Jungkook stops just inches from him, his scent filling the air between them until it’s unbearable. </p>\n<p>“I killed your father like it was nothing.” His voice is low, but it fills the air like a shout. “And he was number one, a king among the packless.” He fists a hand in Jimin’s hair, tugging his head to the side, baring his neck forcibly. Jimin’s knees quake. He swallows back tears. Jungkook leans in, hovering over his scent gland. “I can smell your fear.”</p>\n<p>Jimin wills his body to move. He pulls away, and Jungkook lets him go easily. </p>\n<p>“I’m number one now,” Jungkook says, voice hard. “You would do well to be afraid.”</p>\n<p align=\"center\">❄</p>\n<p>That night, curled up in the furthest corner of the cave, still wrapped in the pelts that smell of Jungkook, Jimin cries. </p>\n<p>He cries for his lost family, for his destroyed pack, because he knows that even if they live, things will never be the same again. Some of them must have died - even Jimin is not fool enough to doubt that. They would have killed the alphas first. He wonders who lies among the dead tonight, if it is Yoongi - good, kind Yoongi, who had cared for Jimin in his quiet way since they were children. Or Seungcheol, who Jimin had liked until Seungcheol fell in love, Seungcheol who had been good enough to want Jimin even despite his tainted background. He wonders if the Pack Alpha had survived, and finds that the thought of his death fills him with an unbearable sadness despite their turbulent relationship. </p>\n<p>He doesn’t want to think about what might have happened to the omegas, or to the children. </p>\n<p>Jimin cries for himself, too, because he is lost and afraid and the man he has no choice but to depend on is the killer of his father. Jimin doesn’t feel strong enough to bear the weight of the sadness that sits on his shoulders. </p>\n<p>He wonders how long he will last before he crumbles. </p>\n<p align=\"center\">❄</p>\n<p>On the day Jungkook finishes Jimin’s coat, a foreign scent rides the wind. </p>\n<p>The coat is thick and warm, the clean fur sitting soft and smooth, black as night. Jimin dons it with a mixture of awe and bitterness. Donning a coat made by an alpha for the first time carries a great deal of weight in his pack. When he was young, he had always imagined what it would be like to be courted, to have an alpha painstakingly craft a coat by hand that was just for him. He had imagined how it would feel to put it on for the first time. </p>\n<p>When Seungcheol began courting him and Jimin quickly learned what the pack really thought of him, most of those dreams faded away. Still, he finds it hard to wear the coat made by Jungkook, knowing he will never have that. </p>\n<p>He’s outside picking sticks for firewood with Jungkook a few feet away doing the same when they smell it - something unfamiliar, drifting down with the wind. They stiffen, and Jungkook barks, “Back inside.”</p>\n<p>Jimin doesn’t think to argue. He runs back into the cave, heart thudding in his chest. The foreign scents grow stronger - alphas, maybe three or four of them, all rogues. They don’t carry the telltale mix of scents that comes from those with a pack. Jimin retreats to the back corner of the cave, hunting around for something he can use as a weapon. He weighs a hefty rock in his hand and holds onto it. </p>\n<p>He hears Jungkook call, “Step closer and I’ll treat it as a breach of my territory.”</p>\n<p>“Come now,” responds another voice. “We only want to talk.”</p>\n<p>A growl, the snap of teeth. “One more step.”</p>\n<p>Jungkook’s warning isn’t heeded; Jimin hears two bodies slam together, hears the skid of paws on dirt. His heart thuds frantically in his chest, and he moves until his back hits the cave wall. A shadow falls across the floor; an alpha stands in the entryway, large and hulking, a glint in his eyes. </p>\n<p>Jimin lifts the rock in warning. “Don’t come near me.”</p>\n<p>The alpha sniffs the air in interest and takes a step forward. “He’s gone and kidnapped a pack omega? That’s low, even for him.”</p>\n<p>“I’m warning you. Stay away from me.”</p>\n<p>The alpha moves quickly. Jimin anticipates it; he strips off his clothes just as the alpha does, shifting form to meet him in a clash halfway into the cave. The alpha’s wolf is bigger, of course, and like Jungkook, he is a battle-hardened rogue. Jimin can hold his own, has to, but he never really learned how to fight. </p>\n<p>Jimin lands a nasty gash on the alpha’s hind leg, but in the end the rogue overpowers him and drags him from the cave with his teeth in his neck. The alpha tosses him into the fray, pinning him down, and a high-pitched whine builds in the back of Jimin’s throat. Jungkook is taking on the two other alphas by himself, and he’s vicious - glinting teeth and wide jaw, quick paws and powerful hind legs. </p>\n<p>Jungkook growls at the sight of Jimin, flinging one of the wolves off him and diving for the one holding Jimin down. Another sinks her teeth into Jungkook’s leg, dragging him back, but Jungkook is persistent, tearing himself away and slamming into the alpha holding Jimin down. </p>\n<p>Jimin squirms away, leaping to his feet and skidding in the way of the wolf who tries to follow Jungkook. He swipes at his muzzle, leaving a nasty gash in his wake, and jumps onto the wolf before he can gather his bearings. The other comes for him, but then Jungkook is in their way, his teeth sinking into the alpha’s neck. He tears her throat out in a spray of blood. </p>\n<p>Jimin recoils, seeing that the wolf who had held Jimin down is dead, too. Only one remains. Jungkook bares his bloodied teeth, but the last wolf is already running away. Jimin sinks to the ground, ears flat on his head in a gesture of submission. Jungkook pads toward him, shaking off the blood, and noses at Jimin’s head. Jimin whines, and Jungkook huffs. He laps at the wound in Jimin’s neck where the alpha had sunk his teeth, his tongue rough and warm. </p>\n<p>Then he moves away, padding back to the cave, shifting on the way. </p>\n<p>“We have to move,” he calls over his shoulder. “More will come.”</p>\n<p>Jimin rises and follows. </p>\n<p align=\"center\">❄</p>\n<p>Every step they travel takes them farther away from Jimin’s pack land, but Jimin argues no further. After their encounter with the rogues, the last thing he wants to do is enter the wild smelling of Jungkook. He will not survive.</p>\n<p>They stop only at night, when they fix a meal together and catch a few hours of sleep. Jungkook sleeps far less than Jimin does; he wakes throughout the night to keep watch, and he never asks Jimin to take a turn. Jimin is so on edge that he wakes whenever he feels Jungkook stir, anyway. </p>\n<p>When the meat Jungkook had gathered during Jimin’s heat runs out, he begins to hunt for them again. He hesitates at leaving Jimin alone, and at first, they go together. But there are things to take care of at camp, and it isn’t efficient for both of them to hunt each night. Rather than send Jimin off alone, Jungkook starts to leave him, scent marking their camp thoroughly and never straying too far. Jimin is afraid when he’s alone. </p>\n<p>Then he starts to feel restless.</p>\n<p>For a wolf raised in a pack, breaking from those bonds is almost physically painful. Jimin misses his pack desperately. He knows it would be foolish to leave, that there are other rogues out there, but he begins to feel like the risk is worth it. He can’t live as Jungkook’s prisoner forever. One day, he will have to go home.</p>\n<p>And if he dies in the process, then it is what the goddess of the moon has woven for him. </p>\n<p>So Jimin plans, quietly. He knows he can find his way by the stars and the moss, though he is still in unfamiliar territory, and it won’t be easy. He hides dry food in the lining of his coat, and he pays close attention to where they are and how Jungkook decides where they go next. And at last the time comes, one dusky evening when Jungkook says he will be gone hunting for longer than usual.</p>\n<p>“Prey is scarce here,” he tells him. “Still, I won’t go far. If I smell anything, I will return.”</p>\n<p>Jimin nods and sets to prepping some herbs and tending to the fire. </p>\n<p>Jungkook leaves, and Jimin waits, and waits, and waits. Then he fetches the hidden snow brush he had made from wood and sage, rubs the herbs all over his body to disguise his scent, and begins to run.</p>\n<p>He brushes snow over his tracks as he moves, restraining himself from running too fast lest he disturb the ground in a way that cannot be concealed. He uses the stars to guide him north. </p>\n<p>He travels for little under an hour when he begins to pick up on the scent of another wolf. He clamps down on his fear, not wanting his own scent to spike, and sheds his clothes quickly. Shifting into his wolf form, he uses his heightened senses to take stock of his surroundings. It’s a rogue, an alpha, and Jimin can’t hold the fear back any longer. </p>\n<p>He takes his clothes in his mouth, hackles rising as he surveys the woods around him. The snow glitters in the light of the moon, and he hears the rustle of a smaller animal in the distance. A branch snaps. A whine builds in the back of Jimin’s throat; he backs away, crouching close to the ground, ready to flee but afraid that will only inspire the rogue to give chase. </p>\n<p>Then his nose picks up on another, far more familiar scent: cinnamon and clove.</p>\n<p>Jimin turns around and runs. </p>\n<p>He hears a growl, the snap of teeth, and the skid of paws in the snow. Jimin’s heart thuds hard, his panting loud and harsh in the quiet of the nighttime woods. He’s small and fast, has always been known for his speed, but it isn’t enough. He can feel the heat of the body behind him, feel the snow spraying against his legs as the distance between them closes. Teeth snap at his hind legs and he pushes himself harder, runs faster - </p>\n<p>Jungkook leaps, and his teeth sink into Jimin’s neck. </p>\n<p>Jimin flops to the side, trying to throw him off, but Jungkook is stronger and far bigger than him. Jimin spins, skidding in the snow, and Jungkook drags him back by the neck, pinning him down with his full weight. His struggles are useless, and Jimin gives in, a low growl coming from him as he lies there, ears flicking in frustration. </p>\n<p>Jungkook’s teeth snap by his ear and he yips. Jimin knows what he means. He wriggles until Jungkook lets him go enough for him to shift back into his human form. He reaches for his coat, tugging it over his body to protect him from the snow. Jungkook shifts, too, but he has no clothes to reach for. He doesn’t look like he cares. He crouches in the snow, jaw set in anger. </p>\n<p>“Did you set out to die tonight?”</p>\n<p>Jimin turns his face away from him, burying his hands in his coat. </p>\n<p>“Do you not understand?” His voice is as harsh a growl while human as it was wolf. “They will kill you.”</p>\n<p>“Then let me die!” Jimin bursts. He is shivering, but his body feels aflame. “I would rather die than be packless.”</p>\n<p>Jungkook stares at him for a long moment, his dark eyes glittering. Then he rises, snatching Jimin’s clothes off the ground. “Come,” he says, wrapping his hand around Jimin’s nape and pulling him to his feet. “They are coming for us. We must move.”</p>\n<p>Jimin hates his wolf for the way it submits instinctually to Jungkook’s grip, falling limp in his hold. He wraps the coat tighter around himself, trembling, and lets Jungkook lead him back to the camp. </p>\n<p align=\"center\">❄</p>\n<p>Jimin comes down with a fever. </p>\n<p>He writhes in the night, first wracked with chills and then drenched in sweat. Jungkook wakes him in the middle of the night, when he has returned to violent shivers, and forces him to shed his heavy coat and blanket. Jimin protests, trembling in the cold, but the lucid part of him knows they must bring the fever down.</p>\n<p>“Are all pack wolves so weak?” Jungkook asks, bringing him a cup of white willow bark tea. “One night in the snow, and already you’ve taken ill.”</p>\n<p>Jimin ignores him. He drinks the tea, begins to sweat, and falls into a fitful sleep. The next time he wakes, Jungkook sits by his side, pressing a cold, wet rag to his forehead. </p>\n<p>“Why are you doing this?” Jimin slurs. “Why does it matter to you if I die?”</p>\n<p>Jungkook looks away, dark hair falling in his eyes, and Jimin thinks he won’t answer and the confused turmoil in his chest will never ease. Then Jungkook looks back and says, “I killed your father. I owe you a debt.”</p>\n<p>It is an answer that Jimin can understand - one that he can make peace with. The spilling of blood always requires a sacrifice in return. Jungkook must have spilled the blood of many; his debts must be countless. The opportunity to relieve one of them must not come often. The turmoil eases, and Jimin sleeps once more. </p>\n<p>He’s lucky that he is young and strong; his fever breaks in only a day. It leaves him feeling weak and disoriented, but Jungkook is restless to keep moving, especially after smelling the rogues. He has food for Jimin to regain his strength when he next wakes, and Jimin eats quietly, furs wrapped tightly around himself, while Jungkook prepares for them to leave.</p>\n<p>“If my pack is dead like you think,” Jimin says, “then you should let me die, too. I would release you from your debt.”</p>\n<p>For a moment, Jungkook doesn’t look at him, his jaw tightening. Then abruptly he sits on a stump across from where Jimin eats and looks him dead in the eye.</p>\n<p>“There is a place at a three days’ run from here. It is a safe space for rogues, of sorts. There are rules, and blood cannot be spilled.” Jungkook pauses, as if considering his words. “If there is any news of your pack, we will hear it there.”</p>\n<p>Jimin blinks, afraid to hope. “Will you take me there?”</p>\n<p>Jungkook nods. “I will take you. And if the news is as I suspect, then you will have to accept your new fate.”</p>\n<p>Jimin nods, eager. </p>\n<p>“But I will warn you,” Jungkook says, voice hard, “that after you are seen with me there, you will never be safe again.”</p>\n<p>Jimin swallows. It’s worth it. “I understand.”</p>\n<p align=\"center\">❄</p>\n<p>They reach the encampment after three days of travel, just as Jungkook anticipated. His tensions rise the nearer they grow, and on the third day, he refuses to stop even for a moment. When Jimin grows too weary to continue, he tells him to shift and slings his human body onto his back, carrying him the rest of the way. For seven leagues in every direction encircling the rogue encampment, no blood can be spilled. Only once they are within its boundaries does Jungkook relax at last. </p>\n<p>They stop for a much-needed meal, and then they continue on. Jimin begins to pick up on a medley of scents as they near: meat cooking, savory vegetables, the scent of numerous rogue alphas and omegas both. After days without the scent of others, the sudden assault is almost too much for him. He has to bury his nose into his furs for comfort. </p>\n<p>The noises grow clearer the nearer they get, too, clinking dishes and the braying of animals and distant voices. Jimin finds himself shrinking into Jungkook’s side on instinct. Jungkook isn’t as tense as before, but he still looks wary, taking up more space as he walks, his scent flaring in defensiveness. The bracelet around his wrist feels almost like a brand, and Jimin finds himself wishing that he didn’t have it. </p>\n<p>Jungkook, given how little he speaks, doesn’t bother explaining how the camp works or where he is walking to with such purpose. Jimin soaks it in with wide eyes. The tents are far more temporary than those of Jimin’s pack, clearly made to be dismantled easily and often. There are more people than he expected, too, alphas and omegas and even a few betas. He catches two other people with ranking bracelets, a number 10 and a number 19. Jimin wonders how many ranks are required to wear the bracelets. He wonders if that means Jungkook killed 19 people to wear his own. </p>\n<p>Jimin isn’t the only one staring. The others stare back, turning their noses in his direction, perhaps still smelling the remnants of his pack on him. But mostly they stare at Jungkook and the red number one on his wrist. He does not look back. He walks like he cannot feel the stares at all. </p>\n<p>Jungkook stops before a tent that looks far more durable than the others, made of animal pelts like those of Jimin’s pack. He announces his presence outside, voice loud and clear. “Jungkook, Alpha, First Rank.”</p>\n<p>For a moment, no one answers. Then - </p>\n<p>“And who is with you, Jungkook of the First Rank?”</p>\n<p>The voice crackles with age. Jungkook looks at Jimin, and Jimin clears his throat. “Park Jimin, Omega, of the Choi Pack.”</p>\n<p>“Enter.”</p>\n<p>Jungkook holds open the flap and nods for Jimin to enter first. Jimin ducks inside, his boots sinking into plush carpet, and finds a woman sitting on a pile of cushions before them. She is as ancient as she sounds, her face lined with age, a long plait of silver hair falling into her lap. Her scent is so marred with age that Jimin can’t tell if she is an alpha, omega, or beta. He waits in the entrance while Jungkook steps up next to him, letting the flap close behind him, the only light left streaming in from the open smoke flaps.</p>\n<p>“Remove your shoes and sit.”</p>\n<p>They leave their boots by the door and fold themselves on cushions opposite her. She turns her head toward Jimin. Her eyes are cloudy.</p>\n<p>“You are the first pack omega to enter our encampment.”</p>\n<p>Unsure of how to respond, Jimin inclines his head in respect. She doesn’t seem to expect an answer. </p>\n<p>“For what purpose do you seek refuge here?”</p>\n<p>Jungkook answers, “We seek news regarding the Choi Pack.”</p>\n<p>“For how many days and nights will you be here?”</p>\n<p>“No more than four,” Jungkook says, “although we may only be here for one.”</p>\n<p>“We have one empty tent. Will you take it?”</p>\n<p>“Yes, Elder Kim.”</p>\n<p>“Remember that no blood will be spilled within our boundaries. Break the rule, and you will be killed.”</p>\n<p>Jimin’s heart stutters in his chest. </p>\n<p>“We understand,” Jungkook says.</p>\n<p>“The pack omega must speak for himself.”</p>\n<p>“I understand,” Jimin echoes, and his voice comes out weaker than he intends. </p>\n<p>“Then we welcome you.”</p>\n<p>It’s a dismissal, and Jungkook rises, slipping back into his shoes. Jimin follows him out, blinking against the sun, and finds a group of alphas hovering around the tent, waiting for them. The one at the forefront eyes Jungkook’s bracelet with a frightening sort of hunger. </p>\n<p>“Look at that,” he says, licking his lips. “Number one, right here in front of us.”</p>\n<p>He bows in mockery, and someone laughs. The alpha standing next to him looks Jimin up and down in a way that makes him cringe. </p>\n<p>“And with a pack omega, too,” she says. “That’s low, even for you, Number One.”</p>\n<p>Jungkook doesn’t even bother answering them. He growls, low and threatening, baring his teeth. Then he puts a hand on the back of Jimin’s neck, grip light but firm, and steers him along ahead of him. The warning is clear: Jimin is Jungkook’s. The alphas part and let them pass, but Jimin can feel their stares like they are tangible. </p>\n<p>Jungkook’s hand is rough and calloused against Jimin’s bare skin. The nape is a sensitive place, especially for an omega. His knees feel a little weak. He fights to keep them from buckling and hopes Jungkook hasn’t picked up on the change in his scent. For a moment, Jimin’s omega fools itself into thinking he really is Jungkook’s. </p>\n<p>Jungkook only lets him go when they stop before the empty tent, marked with a green cloth. He removes it and enters first. Jimin had been worried it would smell like strangers, but the tent only smells like herbs. Jungkook puts his things down and begins to scent it almost immediately, brushing his shoulders along the parameter. </p>\n<p>Jimin doesn’t quite know what to do. He still feels unsettled, by the foreign scents and the alphas’ attention and Jungkook’s hand, rough on his neck. He sits down heavily in the middle of the tent. Jungkook finishes and sits across from him. </p>\n<p>“Things are different here,” he says. “It would be best if you do not leave my side.”</p>\n<p>Jimin nods. After the encounter with the alphas, the last thing he wants to do is go off on his own. </p>\n<p>“They hold communal meals here on some nights. I would rather we find our own food, but meals are the best place to find information.”</p>\n<p>Jimin nods. “Then we’ll go.”</p>\n<p>Jungkook fidgets, looking like he wants to say something. Jimin waits, and finally - </p>\n<p>“I need to check if someone is here. But I don’t want to leave you alone.”</p>\n<p>“I will come with you.”</p>\n<p>He tightens his furs and stands, stepping outside with Jungkook at his heels. Jungkook steers him toward the other tents, and they walk past while Jungkook peers closely at each. He stops at a tent with a red and gold cloth tucked into the flap.</p>\n<p>“Hold on,” he says, stepping up to announce himself before ducking his head inside. </p>\n<p>Jimin waits, nose twitching, peering curiously at a pair of rogue omegas tending to a fire outside a nearby tent. There aren’t nearly as many rogue omegas as there are alphas; alphas tend to be banished more frequently, and when packs are forced into others, the omegas are usually kept. </p>\n<p>An alpha scent hits Jimin’s nose, and his hackles rise at the potency of it just as someone yips right by his ear. </p>\n<p>He jumps, spinning around and stumbling, and he feels arms around his waist, hears laughter by his ear. His scent spikes with fear. The alpha has a bracelet with a row of canines and a number 10. </p>\n<p>“Let me go.” Jimin pushes at his chest, but it’s like hitting a wall of stone, and he just keeps laughing. </p>\n<p>“Pretty little omega,” he croons, wicked gaze flickering all over Jimin’s face. “You scare so easily.”</p>\n<p>Jungkook’s scent overwhelms him, accompanied by a low, vicious snarl. Jungkook fists a hand in the back of Jimin’s coat and yanks him bodily from the alpha’s arms. Jimin stumbles back, wrapping protective arms around himself. Jungkook is still snarling, a sound that grows deeper, coming from his chest, as he gets right up in the alpha’s face. </p>\n<p>His scent is deep and musky and Jimin finds his own spiking in response, his knees weak again. Jungkook and the alpha growl in each other’s faces, fists clenched, chests puffed. Jungkook fakes forward like he’s going to strike, and the alpha flinches back. It’s won. Jungkook snaps his teeth once for good measure then turns back to Jimin. The alpha slinks off, fury and humiliation seeping off him. </p>\n<p>“Take your furs off,” Jungkook snaps. Jimin blinks at him, confused, but Jungkook is still angry and impatient, and he insists, “Take them off.”</p>\n<p>Jimin does, and Jungkook removes his own and thrusts them at Jimin. He snatches Jimin’s from his hand. </p>\n<p>“Put them on.” His mouth is tight, and Jimin doesn’t dare stall. He slips into Jungkook’s furs, feels like he is swimming in them, but the scent is what really gets to him. It’s heady, and his belly clenches. He has to fight the instinct to bury his nose in them. </p>\n<p>Jungkook puts his hand back on Jimin’s nape and marches them to their tent. Jimin’s skin feels hot, his heart ready to beat right out of his chest, and he prays to the moon that he won’t do something humiliating like begin to leak slick. </p>\n<p>“Your scent,” Jungkook’s muttering, more to himself than anything, “‘s too much. Don’t smell enough like me.”</p>\n<p>When they return to the tent, Jungkook immediately begins to scent Jimin’s furs, rubbing them right against his neck. Jimin retreats to a corner and tries to breathe through his mouth, but it doesn’t help. He can taste Jungkook’s scent on his tongue.</p>\n<p>“Did he hurt you?” Jungkook demands after a moment. Some of the rawness of his scent has mellowed out, and the wild haze in his eyes has calmed. </p>\n<p>Jimin shakes his head. “No. Thank you.”</p>\n<p>“Don’t thank me,” he mutters. “Shouldn’t have let you out of my sight. Here.” He tosses the freshly scented furs at him. “Trade back.”</p>\n<p>Jimin shrugs out of Jungkook’s coat and takes a welcome breath of air before he has to put his own back on and drown in Jungkook’s scent all over again. </p>\n<p align=\"center\">❄</p>\n<p>Dinner is busy. </p>\n<p>In Jimin’s pack, meals had been a very structured affair. They showed up on time or nothing; the adults ate first, then the children. They stood in line and everyone’s portions were given according to age and need. Then everyone sat around the fire and ate together, often accompanied by a story or a song.</p>\n<p>This is not like that.</p>\n<p>This is everyone clamoring to get at two massive pots by the fire, doling what they want into their own dishes; Jimin sees steel pots and painted pottery and even an old piece of cloth. It makes sense, he supposes; you can only have so much structure among a group of strangers. </p>\n<p>The crowd makes Jimin nervous, and he hovers by Jungkook’s side. Some of the alphas they pass growl in Jimin’s direction, one of them going so far as to rub his scent gland, despite the way Jungkook snarls back every time. Jungkook is agitated, a hand firmly on the small of Jimin’s back, gaze flickering over the mob around the pots when they stop a little ways away. Jimin sees the dilemma: Jungkook doesn’t want to take Jimin into the crowd, but if they wait too long, they might not get anything to eat at all. </p>\n<p>“I’ll wait on that stump,” Jimin suggests, gesturing to the stump of a long-forgotten oak. “You go.”</p>\n<p>Jungkook looks conflicted. He chews on his lip, then finally says, “I won’t take my eyes off you.”</p>\n<p>Jimin nods and waves him off. He goes over to perch on the stump, wrapping his arms around his knees. He can already feel eyes on him, though he doesn’t dare look back. He doesn’t understand what it is about this place. Jimin knows he is pretty, that his scent is sweet and attractive - he has used those facts to his advantage before. But that doesn’t explain the relentlessness of the attention he has been receiving. </p>\n<p>A heavy pair of boots comes into Jimin’s vision. “Hello,” comes the voice above him. Jimin looks up. The alpha is smiling and handsome. “Is it true you are a pack omega?”</p>\n<p>Jimin’s scent spikes, and the alpha holds his palms out. </p>\n<p>“I just want to talk. It isn’t often you see someone with a pack around here.” He lowers his voice and makes a show of glancing around himself. “Did he bring you by force? Because if so, my tent has extra room - ”</p>\n<p>Jimin smells Jungkook before he sees him, raw and intense.</p>\n<p>“Piss off,” he growls, right behind the other alpha, who spins around.</p>\n<p>“We were just talking.”</p>\n<p>Jungkook snarls, lips curling around his teeth, and the alpha shrugs and walks off. </p>\n<p>“Fucking ridiculous,” Jungkook mutters, folding himself onto the ground next to Jimin. He hands him the bowl that contains markedly more food. “I will have to drown you in my scent.”</p>\n<p>Jimin flushes. His omega wants to curl toward Jungkook, and the rest of him wants to curl away in embarrassment. “I don’t understand,” he mumbles. “Why won’t they leave me alone?”</p>\n<p>Jungkook is glaring at him, agitated again, and Jimin thinks he can tell now that he isn’t upset <em> with </em> him necessarily. He takes a bite of his food, and Jungkook relaxes almost immediately, turning his attention to his own food. </p>\n<p>“I mean, there are other omegas here,” Jimin points out. Being an omega, Jimin has definitely been on the receiving end of unwanted alpha attention many times before. But it has never happened with the intensity and frequency that it seems to be happening here. Things were far more controlled in his pack. </p>\n<p>“Yes, but you are from a pack.”</p>\n<p>“I still don’t understand,” he admits. </p>\n<p>To his surprise, Jungkook looks almost embarrassed. He sniffs and avoids Jimin’s gaze. “Pack mating, uh, works different.”</p>\n<p>Jimin frowns, not following.</p>\n<p>“You spend your ruts and heats alone until you are mated, yes?”</p>\n<p>“Oh.” Jimin’s cheeks flame with sudden heat as he understands. “<em> Oh </em>.” They’re after him because he is a virgin. </p>\n<p>An uncomfortable silence follows. </p>\n<p>“It isn’t like that for everyone,” Jimin grumbles. He knows of packs much less strict than his; not everyone spends their cycles in isolation. </p>\n<p>“But it is for you.”</p>\n<p>Jimin’s cheeks flame hotter. “How do you know?” he demands. </p>\n<p>Jungkook looks at him like he’s stupid. “Your scent.”</p>\n<p>Jimin really does curl into himself this time, squirming with embarrassment. “I don’t like this conversation.”</p>\n<p>“You asked,” Jungkook huffs. He transfers some of the food from his bowl into Jimin’s, as if to say, <em> eat more, talk less </em>. </p>\n<p>“Did you hear anything about my pack?”</p>\n<p>Jungkook nods. His lips twist. “They have been absorbed by the Yoo Clan.”</p>\n<p>Jimin’s stomach rolls with nausea. He sets his bowl down, no longer hungry. He knows what that means. He can tell by the tightness in Jungkook’s jaw that he knows, too. His mother, and Sana, and Taehyung, and all the people he loves - Jimin turns away, fighting the urge to dry heave. </p>\n<p>But they’re alive. He holds onto that fact with desperate certainty. They’re alive.</p>\n<p>“There is a rumor,” Jungkook starts, “that the Yoo Clan’s Alpha has put out a bounty on your intended.”</p>\n<p>Seungcheol made it out, then. Jimin’s heart clenches. If he made it out, there’s a chance that some of the others did, too. There’s a chance that he will go back for them. Whatever Jimin’s qualms with Seungcheol are, he could never doubt his love for the pack. He would die for them. “He is not my intended,” Jimin mumbles, because he finds it easier to focus on that than anything else. </p>\n<p>Jungkook doesn’t look like he believes him. “So, what now?”</p>\n<p>And that is the question. What now? Jimin doesn’t know. Returning to join his pack as part of the Yoo Clan would be foolish. He certainly cannot rescue his loved ones on his own. And what’s the alternative - for Jimin to remain packless? </p>\n<p>“I do not know,” Jimin says. </p>\n<p>He expects Jungkook to scoff at him, but he only nods. “Sleep on it,” he says. “We have time to stay here.”</p>\n<p>He pushes Jimin’s bowl back at him, insistent, and Jimin takes a bite that tastes like lead in his mouth. He looks out at the crowd, which has started to thin out, and wonders if this will be his life now. Jungkook won’t protect him forever. Jimin doesn’t want to be alone - can’t be. He thrives on the presence of others. </p>\n<p>He would die alone.</p>\n<p>There’s an alpha staring at him, leering. Jimin catches his gaze by accident. He looks away quickly, afraid, and finds Jungkook looking at him. </p>\n<p>“You don’t have to be afraid. If they try to hurt you, I’ll kill them.”</p>\n<p>It’s matter-of-fact. Still, Jimin feels warm, flushed, can’t quite meet Jungkook’s eyes. He casts his gaze downward. The intensity of Jungkook’s gaze on him drives away the discomfort of the stranger’s. “You can’t spill blood here,” he mumbles.</p>\n<p>“I’ll drag them out of the boundaries and kill them there.”</p>\n<p>The bracelet of canines on his wrist clacks, as if a reminder. Jimin believes him. He would do it.</p>\n<p>Jungkook’s glaring at the alpha now. He glares at him until he looks away, then he shifts his body so that he’s blocking Jimin from view. </p>\n<p>“Let’s go back to the tent,” Jimin says softly. “I’m tired.”</p>\n<p>Jungkook nods. He takes both their bowls and rises, letting Jimin lead the way so he can follow with a watchful eye. Just before they enter the tent, Jimin catches a whiff of a scent that feels vaguely familiar: sandalwood and a hint of pine. Jimin frowns, entering the tent with Jungkook, and wonders why the scent feels so familiar. Jungkook sets their food down and begins to unroll their bedrolls. </p>\n<p>Normally, they sleep across the fire from each other, but today Jungkook places their bedrolls side-by-side. He pauses when he feels Jimin watching, looking up from where he crouches. “It would be better,” he starts, “if I slept by you here.”</p>\n<p>The strike of fear comes with Jungkook’s implication. He nods, slipping out of his furs and sitting atop his bedroll. These tents aren’t built to hold fires, and it’s cold, but not enough that he can’t bear it. Jungkook remains crouched, looking agitated again, like he wants to say something but doesn’t know how.</p>\n<p>“What is it?” Jimin presses, and Jungkook looks almost startled at being caught. </p>\n<p>“I, uh - ” He clears his throat. “Can you finish your food?”</p>\n<p>Jimin stares at him. “Finish my food?”</p>\n<p>Jungkook nods roughly, looking away. Jimin blinks. The realization dawns on him slowly. It’s obvious, looking back on the events of the day - and the days before, too, if Jimin thinks hard enough. Jungkook’s alpha is treating Jimin as his own.</p>\n<p>Jimin’s cheeks feel hot again. He scoots over to reach for his bowl and starts to finish it off. Jungkook relaxes, stripping his own furs off and settling down. He watches Jimin eat, though Jimin can tell he’s trying not to be too obvious about it. When Jimin’s done, Jungkook lets out a satisfied rumble and takes the bowl from him. He sets it aside and lies down. Jimin does the same, though he feels a little awkward about it, given that he’s shoulder-to-shoulder with Jungkook. </p>\n<p>“I should - ” Jungkook starts, hesitating. “I should hold you. Just in case.”</p>\n<p>Jimin frowns at the roof of the tent. His stomach rolls at the thought of Jungkook’s fear being so great that he thinks someone might come into their tent and snatch Jimin away while he sleeps, so great that he feels like he needs to hold him through the night for safety.</p>\n<p>“I’m not trying to be underhanded,” Jungkook adds, and he sounds genuinely concerned that Jimin might think that’s the case.</p>\n<p>“I know,” Jimin mumbles, and he does. Jungkook doesn’t seem like the type. He turns onto his side, back to Jungkook, and says, “Go ahead.”</p>\n<p>The way Jungkook wraps an arm around Jimin’s waist is tentative. Then his grip grows firmer, his chest pressing against Jimin’s back. Jimin can feel his nose in his hair. He tries to relax in his hold, knows there’s no use being tense, but Jungkook’s scent is strong and overwhelming as always, and a shiver runs up his spine unbidden. He wonders, briefly, if Jungkook’s ever as affected by his scent as he is by Jungkook’s. </p>\n<p>“Goodnight,” Jimin whispers, and Jungkook’s silent. He thinks he isn’t going to answer, but then - </p>\n<p>“Goodnight.” The word is a soft rumble through his chest, and Jimin can feel it against his body. </p>\n<p align=\"center\">❄</p>\n<p>Jimin wakes violently. Someone’s calling his name.</p>\n<p>“Park Jimin!” he hears, echoing outside the tent. “Jimin, where are you?”</p>\n<p>Jungkook’s still wrapped tightly around him. Jimin shifts, and his grip only tightens, a low rumble coming from his chest. </p>\n<p>“Park Jimin!”</p>\n<p>Jimin knows that voice. And, as he begins to realize, he knows that scent he’d caught last night, too. Of course he knows that scent. Jimin pushes at Jungkook’s arm, but it’s like trying to move stone. </p>\n<p>“Jungkook,” he hisses. “Wake up.”</p>\n<p>Jungkook’s eyes fly open, a growl beginning to form in his throat, eyes flickering around them as he searches for a threat. Jimin uses the opportunity to shove him off, leaping to his feet and dashing from the tent. He’d slept in his boots and coat, cold as it was, and he holds his furs tight around himself now as he runs through the camp, following the scent of sandalwood and pine. The cold cuts into the skin of his face as he runs, feels like knives in his head, but Jimin doesn’t slow down. He ducks past a crew of alphas who growl after him, their scents spiking in interest. </p>\n<p>Then he sees him: standing in the middle of a pair of tents, hands cupped around his mouth, is a face Jimin had almost begun to think he would never see again. </p>\n<p>“Alpha Yoongi!” he cries, launching himself at him. </p>\n<p>Yoongi melts with relief, clutching at Jimin’s furs as Jimin clutches at his, nosing under his jaw to lightly scent him. Jimin breathes in the familiar scent of Yoongi, of his pack, and blinks back tears. </p>\n<p>“I knew I caught your scent,” Yoongi says, a comforting rumble in his chest. Jimin pulls back to look at him, the tears welling up despite his best efforts to quell them. “I thought we’d lost you.”</p>\n<p>“I thought I’d lost you, too.”</p>\n<p>“Why do you smell like that?” Yoongi asks, nosing once more at Jimin’s neck to confirm. </p>\n<p>Jimin is in the midst of trying to figure out how to explain when Yoongi looks behind him and begins to snarl. </p>\n<p>“You,” he snaps, letting Jimin go and surging forward with intent. </p>\n<p>Jimin spins around and sees Jungkook, who’s instantly on the defense. </p>\n<p>“You took him,” Yoongi growls, and goes to fist a hand in Jungkook’s collar. </p>\n<p>Jungkook doesn’t bother trying to defend himself. He grabs Yoongi’s wrist before he can touch him and twists. Yoongi goes for his neck with his free hand, and then it’s a full-out brawl. Jimin backs away, a whine of distress building in the back of his throat. He knows better than to get in the middle of an alpha fight, though; they need to follow through. He just hopes neither of them are foolish enough to draw blood. </p>\n<p>Despite his distress, Jimin can’t help the way his omega reacts to the fight, given how closely tied it is to him. His knees feel weak and his mind hazy, his own scent responding with interest. He finds his gaze caught on the corded muscles of Jungkook’s forearms, the tendons that tighten in his neck. Yoongi is no easy opponent either, quick and smart, the type who doesn’t hesitate to fight dirty. </p>\n<p>But Jungkook lives a far different life than any pack alpha, and Jimin can see who’s going to win. </p>\n<p>“Is this a fight for your hand?” comes a voice beside Jimin. It’s the alpha from mealtime, the one who had offered Jimin a place in his tent. “Should I join the fray?”</p>\n<p>Jimin moves away. There are other alphas watching the fight, too, feeding off the energy, but they’re all focused on Jungkook and Yoongi, not on him. He turns his back on him, sending a message, but the alpha reaches out and takes his hand. Jimin freezes, heart thudding painfully hard in his chest. He wants to twist his hand out of his grip, but no one’s watching them. It would be easy for things to escalate. </p>\n<p>Then Jungkook and Yoongi are by his side, fight forgotten, their instinctual anger turned on the alpha. Jungkook rips the stranger’s hand away by the wrist, hard enough that Jimin thinks he might hear a bone snap. Yoongi growls at him, posturing, and the alpha hisses in response. </p>\n<p>“Jimin!” someone calls. “Alpha Yoongi!”</p>\n<p>Seungcheol and Namjoon are running toward them. Jimin has no time to register the joy and relief at seeing them alive because they’re picking up on a threat to their pack, on Yoongi’s anger, and turning on the alpha. </p>\n<p>“Enough.”</p>\n<p>Elder Kim’s voice is not a shout, but it carries. Silence falls. She stands outside her tent, leaning on a walking stick, there to intervene now that what was just a fight between two alphas has potentially turned into something greater. Jimin’s pack pulls back, and the alpha spins on his heel and shoves away through the crowd. </p>\n<p>Then Elder Kim turns her cloudy gaze on Jimin, and his heart skips a beat. “If you keep causing trouble, Omega, your welcome will be rescinded.”</p>\n<p>She turns around and walks back into her tent. </p>\n<p>Jimin bristles, hackles rising. It isn’t his fault every alpha in the damn camp thinks only with their knot. But he has other concerns to address, so he swallows his anger and turns to the others. </p>\n<p>“He saved me,” Jimin blurts, because they’re all still glaring at each other, and Jimin has to get in the way of it before it turns into instinct again. “Jungkook. He saved me.”</p>\n<p>Namjoon is the first one to come to his senses. He frowns at Jimin, though his eyes are still locked on Jungkook. “Explain.”</p>\n<p>“I was in heat. I left the others so I wouldn’t draw attention to them. He found me and kept me safe. He brought me here so I could look for you.”</p>\n<p>Namjoon begins to relax. Seungcheol and Yoongi still look doubtful, but their postures ease enough to no longer come off as threats. </p>\n<p>“Then we owe you a debt,” Seungcheol says, albeit stiffly.</p>\n<p>Jungkook shakes his head, looking uncomfortable with the thought of it. “It was Jimin I owed a debt to. I was only fulfilling my duty.”</p>\n<p>“You must tell me what has happened,” Jimin says. “How have you come to be here? Where is everyone else?”</p>\n<p>Namjoon nods. “We will talk. Come - we’ve set up camp not far from here.”</p>\n<p>Jungkook takes a step back. “I will return to the tent, Jimin, and leave you in their hands.”</p>\n<p>Jimin’s omega feels discontented. Still, it’s the most logical response, so he nods. Jungkook gives him one last look before he turns around and walks off. </p>\n<p>“Come,” Seungcheol says, and Jimin follows.</p>\n<p>They’ve set up their own camp away from the hustle and bustle of the main one. Hoseok is waiting there, and he greets Jimin with a joyous howl, scenting him far more thoroughly than Yoongi had dared. Hoseok has never been shy with affection. </p>\n<p>“Why do you smell like a rogue alpha?” His nose twitches, a flicker of concern passing over his gaze. </p>\n<p>“Your story first,” Jimin insists. “I want to know what happened. My mother - Aunt Kyungri - “</p>\n<p>He’s beginning to grow distressed again. Yoongi steers him toward a log by the fire and sits him down, and the rest of them crowd around. Seungcheol is the first to begin.</p>\n<p>“We were outnumbered,” he says. “Unprepared. We didn’t stand a chance.”</p>\n<p>That’s a difficult thing for an alpha to admit, but Seungcheol does it with grace and a hint of sorrow. </p>\n<p>“Some of the omegas managed to escape with the children, but they caught most of them in the end. Dragged them back to camp, where they had the rest of us. They killed my father. They would have killed me, too, but Namjoon pulled me from my rage and found a way for us to escape. We were able to get to Hoseok and Yoongi, too.”</p>\n<p>It can’t have been easy, running away when all their instincts would have been screaming at them to protect their pack. But it was the smarter decision in the long run. Had they stayed, they would have been killed undoubtedly. All four of them are far too high-ranking to simply banish. </p>\n<p>“We’re rogues now,” Seungcheol acknowledges. “It took us time to learn, but we found our way here eventually.”</p>\n<p>“I’m sorry,” Jimin murmurs, sadness weighing on his heart. He had known Alpha Dakho since he was a child. Admired and respected him up until Seungcheol’s courting changed things. “About your father.”</p>\n<p>He nods. The ensuing silence is heavy. Their Pack Alpha had his flaws, but mostly he had been well-liked. </p>\n<p>“Who else did we lose?” The words are difficult to get out, but Jimin knows he must ask.</p>\n<p>It’s a list longer than Jimin wants to hear - mostly alphas, two of the elders, one of their omegas. Jimin grows dizzier with grief as each name is spoken. He wonders how he will bear such a weight. His eyes fill with tears, and Namjoon rests a heavy hand on his shoulder. The four of them have been carrying this weight for so long already. </p>\n<p>None of his family’s names are spoken, nor Taehyung’s, and he’s ashamed of the relief he feels when they finish the names.</p>\n<p>“There are more alive than dead,” Yoongi says, a quiet reassurance. </p>\n<p>Seungcheol sighs long and low. “Your turn, Jimin. Omega Taehyung had told us you ran to save them. You were very brave.”</p>\n<p>The lump in Jimin’s throat hurts. He doesn’t feel brave.</p>\n<p>“We assumed you had been taken by someone else when they never brought you back with them.”</p>\n<p>“Jungkook took me,” Jimin says. “But only to save me. I wanted to go back and find you when it was over, but he wouldn’t let me. It would have been dangerous. I didn’t - I didn’t quite understand at first. But now that I’m here, seeing what his rank really means, I think I understand.”</p>\n<p>“What debt did he speak of?” Yoongi asks, brow furrowed.</p>\n<p>Jimin swallows. “He killed my father. For his rank.”</p>\n<p>The four of them are stunned into silence. Everyone knows the story of Jimin’s father, of course. </p>\n<p>“His bracelet,” Namjoon discerns.  “He’s number one? Your father was number one?”</p>\n<p>Jimin nods.</p>\n<p>They all exchange a glance full of conflicting emotions. Jimin feels uncomfortable again. It’s hard enough thinking of his father on his own, worse with others involved. He doesn’t want to be seen. </p>\n<p>“The rogue we caught?” Hoseok clarifies, having not seen Jungkook with the others. “He’s the one you’ve been with?”</p>\n<p>“He’s here,” Yoongi mutters. “Almost ripped his throat out when I saw him.”</p>\n<p>Hoseok looks like he wants to do just that, grinding his teeth together. He stands abruptly. “You must be tired, Jimin. I’ll brew you some tea.”</p>\n<p>Namjoon follows to help, and Yoongi drifts off with some excuse. Jimin knows what they’re doing. Only Seungcheol remains; he shifts to sit by Jimin’s side. </p>\n<p>“These aren’t your furs,” he murmurs, gaze traveling down Jimin’s bear coat. </p>\n<p>“I lost them.”</p>\n<p>“Did he make these for you?”</p>\n<p>Jimin gives a jerky nod in response. Seungcheol’s tone is neutral, but still Jimin feels a cloying sense of guilt. He has no reason to; he had never accepted Seungcheol’s intention. They were never promised to each other, and everything Jimin has been through with Jungkook was purely out of necessity. </p>\n<p>Still, it makes him feel strange. Uncomfortable. </p>\n<p>“He doesn’t know what it means,” Jimin mumbles. “I just needed furs.”</p>\n<p>“I’m glad he kept you safe,” Seungcheol says gently. “Whatever he says, it’s true that we owe him a debt.”</p>\n<p>“I really am sorry about your father. I can’t imagine your pain.”</p>\n<p>Seungcheol stares at his hands, a bitter twist to his mouth. “He was a good father to me.”</p>\n<p>“You’re Pack Alpha now.”</p>\n<p>The laugh he gives him is humorless. “There’s no pack to be the Alpha of.”</p>\n<p>It chokes him again - the sadness. Jimin looks away, off at the empty plains, still save for the occasional breeze, and feels it drowning him. There is a part of him that feels like nothing will ever be the same again. </p>\n<p>“But we’re going to try,” Seungcheol says abruptly, steel in his voice. “We’re going to free our pack.”</p>\n<p>Jimin glances at him, eyes wide.</p>\n<p>“We’ve been planning,” he confirms. “We won’t let them suffer for much longer. We’ll find a safe place for you, Jimin, and then we will carry it out.”</p>\n<p>Jimin’s shaking his head before Seungcheol can finish speaking. “I will help,” he insists. “There are only four of you. You can use one more wolf. You can’t expect me to sit back while our families are in danger when I’m perfectly capable.”</p>\n<p>Seungcheol’s frowning at him. “I don’t like the idea of you in danger.”</p>\n<p>“I’ve <em> been </em> in danger. Our pack is in danger. You need all the help you can get. You know I’m right.”</p>\n<p>Seungcheol can, perhaps, see the fire in Jimin’s eyes. He doesn’t look happy about it, but he says, “We’ll discuss it with the others, then.”</p>\n<p>Jimin’s fists are clenched in his lap without his realizing. He relaxes them, staring at the crescent-shaped marks in his palms. </p>\n<p>“My feelings haven’t changed,” Seungcheol says, and Jimin tenses once more. “I know this isn’t the best time, and I don’t expect anything. But I just wanted you to know.”</p>\n<p>A bitter part of Jimin supposes that he should feel lucky. The Pack Alpha wants him despite the fact that he’s possibly been tainted by a rogue. The Pack Alpha wants him to know that it doesn’t matter that he’s just spent the past moon wrapped in another alpha’s furs, that he wants him anyway. </p>\n<p>Jimin stands, the bitterness spreading. “I’m going to help Hoseok with the tea.”</p>\n<p>Seungcheol doesn’t try to stop him. </p>\n<p align=\"center\">❄</p>\n<p>Jungkook is there at mealtime. </p>\n<p>He doesn’t have any food. He’s sitting on the same stump Jimin had sat on before, across the fire from where Jimin sits with Hoseok while the others fetch their food. Jimin can feel him staring; he had thought, at first, that it was another alpha’s unwanted attention. But then he had looked up and caught Jungkook’s gaze, dark and intense, his skin glowing in the firelight, and a shiver had run up his spine. </p>\n<p>Part of him wonders if Jungkook had come just to see him. </p>\n<p>Jimin looks down at his feet, but he can still feel Jungkook’s gaze like it’s tangible. A flush climbs its way up his neck. </p>\n<p>“Seungcheol’s going to be disappointed,” Hoseok says, low and amused. Jimin glances at him, surprised, but of course only Hoseok can joke at a time like this. </p>\n<p>“Over what?” Jimin mutters, scuffing at the ground with his boot. </p>\n<p>“First time I’ve ever seen you give an alpha the time of day.”</p>\n<p>“I’m not giving him the time of day.”</p>\n<p>“You look seconds from baring your neck.”</p>\n<p>Jimin flushes harder, smacking Hoseok’s arm. “You’re not supposed to tease me like that. That’s Taehyung’s job. And anyway, I’m giving you the time of the day, aren’t I? You’re an alpha.”</p>\n<p>Hoseok snorts. “Not the same, sweetheart. And no offense, but that’s disgusting. I think I helped your mother change your diapers.”</p>\n<p>“You were in diapers when I was in diapers!” Jimin splutters. </p>\n<p>“Don’t wanna know what you’re talking about,” Yoongi grumbles, stopping in front of them. He shoves a very full bowl into Jimin’s hands, one that Jimin recognizes as Yoongi’s own craftsmanship. He must have made it recently. </p>\n<p>“Where’s mine?” Hoseok demands. </p>\n<p>“Get your own.” Yoongi plops down in front of Jimin, effectively blocking Jungkook from view. Jimin doesn’t know if he’s relieved or disappointed. “What the fuck is wrong with this place? I had to threaten at least three alphas on the way who wouldn’t stop staring at you, Jimin.”</p>\n<p>Jimin winces. “You’re telling me.”</p>\n<p>“Sorry. Of course you know already.” Yoongi nudges Jimin with his knee until Jimin starts to eat. “No one's tried to hurt you, have they?\"</p>\n<p>\"Jungkook took care of me,\" Jimin mumbles, staring down at his bowl of food as if that will drown everything else out. He can't wait to leave this place. He's beginning to have nightmares about the alphas, hears their growls permeate his brain when he least expects it.</p>\n<p>\"Do you think he's going to leave?\" Hoseok asks. \"Now that you've found us.\"</p>\n<p>Jimin can't think of any reason why he would stay. \"Yes. I should - I should tell him he can go. Shouldn't I?\"</p>\n<p>Hoseok's gaze is kind. \"Most likely.\"</p>\n<p>\"Eat first,\" Yoongi warns; he can tell Jimin is about to get up right then.</p>\n<p>Jimin forces himself to finish his food. Then he wipes his suddenly clammy hands on his trousers and crosses past the fire to meet Jungkook. Jungkook watches him approach; he only blinks when Jimin stops before him. Now that he's here, he doesn't quite know what to say.</p>\n<p>\"How are you?\" he tries.</p>\n<p>The corner of Jungkook's mouth turns up. Jimin can't tell if the amusement is mocking or genuine. It's hard to tell with him. \"Well. And you?\"</p>\n<p>\"Well,\" Jimin echoes. \"We're - we're going to try to free our pack.\"</p>\n<p>The amusement is now most definitely bitter. Jungkook's gaze travels over to Hoseok and Yoongi, where Seungcheol and Namjoon have now joined them. \"Good luck with that.\"</p>\n<p>Jimin feels a pang of frustration. \"You can leave now, if you want.\"</p>\n<p>His gaze drifts back over to Jimin. It's difficult to read. He nods. \"I'll be leaving tonight.\"</p>\n<p>Jimin isn't prepared for the way his omega reacts. His chest clenches, breath quickening, and he can feel the way his scent turns sour. He tries to swallow down the upset whine that builds in the back of his throat, tries to reason with his wolf, but his omega is instinct only. There's no reason involved.</p>\n<p>\"I wish you safe travels,\" Jimin says softly, then turns on his heel and runs back to his pack before Jungkook can pick up on the change in his scent.</p>\n<p align=\"center\">❄</p>\n<p>Jimin’s omega feels lost, empty, and rejected.</p>\n<p>He’s not your alpha, Jimin tells himself over and over, but it doesn’t make a difference. His omega has gotten used to thinking that he is. Jimin sits at the edge of their little camp and watches the main one in the distance, as if he’ll be able to make out Jungkook’s figure when he leaves. He doesn’t, of course. It’s too hard to tell. </p>\n<p>Eventually, he tries to sleep. It eludes him. He wants so badly to rest, but his omega is whining softly inside him, lonely and forgotten. Tossing restlessly, Jimin finally decides the pressure on his bladder is too insistent to ignore and he’s tired of lying there sleepless. </p>\n<p>“Going to take a leak,” he tells Hoseok, who is awake and on watch. Hoseok waves him off. </p>\n<p>Jimin takes cover further away, under the trees where no one can see him. Not that he thinks any of his packmates would look, but he’s always been a little shy. He relieves himself quickly and when he’s done, he stands and turns around to return back to camp.</p>\n<p>Then the scent of an unfamiliar alpha hits him, and Jimin tenses. The back of his neck prickles, and his mouth goes dry. </p>\n<p>“Finally got you alone,” the alpha says, his voice a low rasp, and Jimin turns around slowly, his belly in knots. </p>\n<p>“I’m not alone,” he says, his eyes frantically moving in search of something to defend himself with. But his brain isn’t working fast enough through the fear, the instinctual cowering of his omega, and he sees nothing. He can’t run, either. The alpha will only be driven to give chase, and Jimin will most definitely be caught then. </p>\n<p>He opens his mouth and shouts, “Help!”</p>\n<p>“Try that again,” the alpha growls, then he’s moving and Jimin’s stumbling back, tripping over a root and falling flat on his ass. </p>\n<p>He’s immobilized with terror, the alpha drawing nearer, so afraid that he doesn’t register Jungkook’s scent at all until he’s already there, yanking the alpha back and flinging him to the ground with a growl so threatening Jimin breaks out into a cold sweat. </p>\n<p>“I’ll fucking kill you,” Jungkook spits, kicking the alpha in the ribs with a sickening crack. It isn’t enough to keep him down, though, and the alpha leaps to his feet and springs back, crouching defensively. </p>\n<p>Jimin can see the rage in Jungkook’s eyes, can smell it on him, and knows he means his threat. He isn’t lucid. He’s half-shifting in his fury, teeth elongating, his body growing large, fingers stretching into claws. Jimin knows it’s useless to ask him to stop when he’s already so far gone. But if Jungkook spills the alpha’s blood, he’ll be killed for it. </p>\n<p>Jimin does the only thing he can think of doing. He pushes himself to his feet and launches himself at Jungkook’s chest, burying his nose in his neck, clutching fistfuls of his shirt in his hands. </p>\n<p>“Alpha, please,” he begs, feeling Jungkook stiffen beneath him, “Don’t.”</p>\n<p>He rubs his nose and cheek against Jungkook’s scent gland, breathing in the thick, cloying cinnamon and clove until his head starts swimming. His scent fills Jimin’s lungs until he feels like he’s drowning, his omega preening with satisfaction, belly tight and knees weak. He holds himself up with a desperate grip in Jungkook’s shirt. He can feel Jungkook begin to go limp, his hard chest softening, the tension in his shoulders leaving slowly. Jungkook’s arms wind around his waist, a low rumble starting in his chest. </p>\n<p>Then his grip tightens and his head dips down so he can nose under Jimin’s jaw. The way he holds Jimin is protective, and his scent is so strong, so heady, that Jimin finds himself melting into him. </p>\n<p>“What the hell’s going on?”</p>\n<p>Jimin recognizes Hoseok’s voice right away. It brings him back to his senses, and he pulls back. His pack is there; the alpha is slinking away into the woods. Jungkook growls quietly when Jimin moves, tugging him back against his chest, unwilling to let go. Jimin puts a warning hand on Jungkook’s chest, but Jungkook’s glaring at his pack, and his hold doesn’t loosen. </p>\n<p>Jimin gestures at the space in the trees where the alpha had disappeared. “He tried to attack me.” He’s surprised to find the way his voice trembles. The adrenaline hasn’t worn off yet, and he hadn’t realized how afraid he was. “Jungkook came just in time.”</p>\n<p>“Fuck,” Hoseok mutters, looking murderous. “I’m so sorry, Jimin. I wasn’t fast enough.”</p>\n<p>Jimin tries tentatively to pull away again, but Jungkook hasn’t calmed down enough to let him go. </p>\n<p>“Hey,” Seungcheol bites. “Let him go.”</p>\n<p>Jimin can feel Jungkook tensing against him again, registering a threat, and hurries to say, “No, it’s okay.” He turns in Jungkook’s hold to look at him. His eyes are hazy, lips curled in a snarl. “Jungkook,” he says gently. He raises a hand and rests it lightly on Jungkook’s neck, just under his scent gland. “I’m fine. Let me go.”</p>\n<p>Jungkook’s reluctant, eyes still glazed over, but his grip loosens enough for Jimin to pull away. With the distance, his expression grows clearer, his alpha relaxing its control on him. But the anger hasn’t quite faded, and he turns on the others right away. </p>\n<p>“What were you thinking, letting him go alone?” he snaps. “If I hadn’t been here - ” He breaks off, teeth clenching. “I left him thinking he’d be safe with his pack. It hasn’t even been a day.”</p>\n<p>Seungcheol bristles, hands clenching into fists, and their scents are spiking all over again. Jimin’s hands are trembling, too, his legs wobbly and weak. He’s tired. He’s afraid. The adrenaline is wearing off, and he knows that when it does, the terror of what had happened will truly begin to settle in. </p>\n<p>“Stop,” Yoongi growls, shoving Seungcheol back from where he had begun to posture. “This isn’t the time to fight like knotheads. Think about how Jimin’s feeling.”</p>\n<p>They both glance at him, the fire fading into guilt. </p>\n<p>“I’m so sorry,” Hoseok says, again. “It’s my fault. I let you go alone.”</p>\n<p>“Are you all right, Jimin?” Namjoon asks gently. </p>\n<p>Jimin’s eyes drift briefly shut. He shakes his head. </p>\n<p>Jungkook’s hand encloses around his wrist. “Come on,” he says, nearly a growl. “You need food. Something warm to drink.”</p>\n<p>Everyone’s tensing again, and Jimin’s tired. He doesn’t want to be around all the tension anymore. He nods. “It’s all right,” he tells his pack. “I want to go with him.”</p>\n<p>He lets Jungkook lead him away before anyone can protest. He’s shaky, and he grips Jungkook’s arm tight as he walks, afraid his legs might give out on him. He doesn’t take him back to the main camp; he must have given up his tent already, and anyway, Jimin wouldn’t want to go back in the middle of all those alphas once more. Jungkook leads him a ways away, collecting firewood as he walks, until they find a quiet spot. He sits Jimin down on a log and sets to building the fire, working quietly and efficiently. </p>\n<p>Jimin presses his hands between his legs in a vain effort to stop the trembling. His heartbeat hasn’t slowed down, even now, and his breath still comes quick like he’s being chased. He’s beginning to feel dizzy. </p>\n<p>“I found this while I was in the woods,” Jungkook says, removing a handful of radishes from his pack. He sits by Jimin and hands him one, watching him intently until he takes his first bite. The radish is flavorful, settles his stomach, and Jimin finishes one quickly. Before he takes his last bite, Jungkook’s there again with another, encouraging him to take it. He does. By the time he’s done, the dizziness has lessened, and Jungkook’s bringing him a cup of something steaming hot. </p>\n<p>“Elder Kim let me leave with some milk from her goats,” he says, and Jimin’s mouth waters at the sweet scent. </p>\n<p>He takes the first welcome sip, and the trembling in his hands begins to slow down. Jimin hadn’t taken his furs into the woods with him when he’d left camp, and Jungkook removes his own now, draping them over Jimin’s shoulders. It isn’t terribly cold tonight, but the warmth is comforting. He fusses over him briefly: tightens the collar of the coat, drapes its hem over his legs. </p>\n<p>“I’m sorry,” Jungkook says, and Jimin glances at him, startled. “I thought of my anger before I thought of you.”</p>\n<p>Jimin’s heart clenches. He nods. </p>\n<p>“I don’t - ” Jungkook cuts himself off, looking frustrated. He doesn’t speak much; Jimin wonders if it’s difficult for him to find the way. He seems to find it far easier to act. “I don’t know how to be gentle.”</p>\n<p>Jimin blinks. There’s a warm flush creeping its way up his neck. “I appreciate everything you’ve done for me,” he says carefully.</p>\n<p>But Jungkook still looks frustrated. “You deserve to be treated gently.”</p>\n<p>Jimin’s flushing properly now. His gaze darts away from Jungkook’s, unable to hold it any longer. </p>\n<p>“Are you all right?” Jungkook asks. “Did he hurt you?”</p>\n<p>Jimin shakes his head. “No. Just scared me.”</p>\n<p>Jungkook nods. “You don’t have to be scared now. I’m here.”</p>\n<p>Jimin finishes his milk and wraps his arms around his knees. He can’t quite chase the flush away. “I thought you had left camp already.”</p>\n<p>“I did,” he acknowledges. “And when I was leaving I thought I saw him sniffing around your camp. But you had your pack, and I didn’t think - I didn’t think he’d try anything. So I left.”</p>\n<p>“But then you came back,” Jimin whispers, beginning to understand. “For me.”</p>\n<p>Jungkook won’t look at him, glaring at the fire instead, kicking his toe aimlessly into the dirt. “I had to make sure you were safe.”</p>\n<p>“I’m glad you came back,” Jimin murmurs, twisting his hands together. “Are you going to leave again?”</p>\n<p>Jungkook looks at him, his eyes dark and unreadable. It’s a silly question. Of course he will. What reason would he have to stay? Jungkook remains silent for so long that Jimin is ready to backtrack, to brush himself off. But then he asks, “Do you want me to stay?”</p>\n<p>Jimin flushes, swallowing harshly. They aren’t even going to stay here forever. They’ll be leaving soon, setting out on the journey to rescue their pack, something that might end a complete failure. But Jimin doesn’t want him to leave. He wants him to stay. </p>\n<p>“Will you - will you help us?” Jimin dares to ask. “Free our pack from the Yoo Clan.”</p>\n<p>Jungkook’s eyes are unreadable. “There is nothing at stake for me.”</p>\n<p>“I know,” Jimin whispers. “But you’re the First Rank. You’re powerful. You said so yourself, my pack won’t stand a chance. But with you, maybe we would. You could help us. We could - we could find a way to repay you, to make it worthwhile.”</p>\n<p>“I don’t think your pack alphas would be very happy with my interference.”</p>\n<p>“They know we need all the help we can get. They’d be fools not to recognize how strong you are. You could make a world of difference for us.”</p>\n<p>Jungkook’s lips twist, bitter. “They were my pack,” he admits. “The Yoo Clan.”</p>\n<p>Jimin’s eyes widen, breath catching. He had wondered all this time who Jungkook had been before he became a rogue. “What happened?”</p>\n<p>It must be difficult to remember, but when Jungkook recounts it, his voice is hard and cold. “The Pack Alpha wanted my omega mother for himself. My alpha mother opposed him, so he banished her, along with my sister and me. My mother died at the hands of a pair of rogues who wanted our furs. My sister and I were alone after that, until she died of fever. Then I was on my own.”</p>\n<p>“How old were you?” Jimin whispers. There’s in a lump in his throat that makes it hard to speak. </p>\n<p>“I was eight when I was banished.”</p>\n<p>“And - and your omega mother?”</p>\n<p>Jungkook shrugs one shoulder. “Still there, for all I know. The Pack Alpha’s mate.”</p>\n<p>Jimin blinks through the tears, turning his face away so Jungkook doesn’t see them. Jungkook was just a child, alone in a world full of violence. Somehow he had gone from eight years old and alone to the man Jimin sees now, the number one rogue, someone who has fought and killed countless to maintain his rank. </p>\n<p>“I am sorry,” Jimin says, voice rough. </p>\n<p>Jungkook shrugs again. “I remember little of it.”</p>\n<p>But Jimin can tell he doesn’t mean it. He can see the memories in Jungkook’s eyes even now. They’re quiet for a time, watching the fire, and Jimin marvels that this might be the most they have spoken at one time since they met. He doesn’t want to stop. He wants to take advantage of this newfound openness. </p>\n<p>“Did you know my father before you killed him?”</p>\n<p>Jungkook scoffs quietly. “Everyone knew him. He was First Rank.”</p>\n<p>“You know what I mean.”</p>\n<p>Jungkook peers at him carefully, as if trying to assess how much he should reveal. “He was terrible.”</p>\n<p>This time it’s Jimin’s turn to scoff. “I already know that. You don’t have to spare my feelings. I’m only curious.”</p>\n<p>“Well,” Jungkook considers. “He was a good fighter, well-known. He killed a lot of people to become number one.”</p>\n<p>“Did you not?”</p>\n<p>“I didn’t intend to take the rank,” he admits. “I killed your father because he was terrorizing some young rogues, barely old enough to no longer be called pups. It was only after he was dead that I realized what I’d done to myself.”</p>\n<p> “It must be hard,” Jimin murmurs. “Having a target on your back.”</p>\n<p>Jungkook just shrugs.</p>\n<p>“Is it always like that?” Jimin ventures. “Like that day we were attacked at the cave.” He can still see vividly in his mind’s eye the sight of Jungkook tearing those wolves’ throats out. </p>\n<p>“Always,” Jungkook affirms. “They never give up.”</p>\n<p>Jimin can’t imagine living a life like that, under constant threat. He wonders if Jungkook could ever give it up - abandon his bracelet and disappear. But they would know, he thinks, that Jungkook is the number one, even without the bracelet. By now everyone must know. </p>\n<p>“I’ll help you,” Jungkook says, after a moment. Jimin’s head turns sharply toward him, brows rising. “I owe you a debt, after all.”</p>\n<p>Jimin’s mouth is dry. “Yes,” he says. “I suppose you do.”</p>\n<p>The corner of Jungkook’s mouth lifts up. “Good luck telling your pack.”</p>\n<p align=\"center\">❄</p>\n<p>Predictably, they aren’t happy. </p>\n<p>The concerns are the obvious ones: they don’t know him, they can’t trust him, he has no reason to help them, they have little to repay him with. Jimin counters back with everything he knows they can’t argue against: he’s the First Rank, they need all the help they can get, he’s familiar with the Yoo Clan, he really does have something at stake here even if he says he doesn’t. They need him. </p>\n<p>In the end, they would be fools to refuse, and so they don’t.</p>\n<p>The tensions are high as they sit in their little camp, discussing the next step. Jimin sits midway between Jungkook and his pack, hoping to mediate, to keep things from escalating. </p>\n<p>“They were using their paddock as a makeshift jail last I saw,” Namjoon’s saying. “If we can find a way to get around the back undetected, we can free any alphas kept there. Then they can fight alongside us.”</p>\n<p>“We can create a distraction,” Hoseok agrees. </p>\n<p>Jungkook’s been carving meticulously at a small chunk of wood with his pocketknife since they began the discussion. Jimin thinks it’s a defensive thing, trying to look busy. Now he stops, looking up with a frown. “Aren’t you going to invoke the Pack Alpha rites?”</p>\n<p>Jimin and the others frown back at him. “The what?” Yoongi asks. </p>\n<p>“That’s how the Yoo Clan works. Challenge the Pack Alpha to a fight and the winner becomes the new Pack Alpha.”</p>\n<p>Yoongi scoffs in disbelief. “No. They do that?”</p>\n<p>“You were really planning on rescuing your pack by overpowering theirs?” Jungkook scoffs back. “You won’t stand a chance.”</p>\n<p>They’re all bristling already, and Jimin winces. Not for the first time, he wishes Jungkook had a little more tact. </p>\n<p>“I thought you only needed us to get you in there.” Jungkook’s words are directed toward Seungcheol now. “Then you’d invoke the Pack Alpha rites. You’re Pack Alpha, aren’t you?”</p>\n<p>He almost sounds disdainful. Jimin can see Seungcheol’s hands clench into fists at his sides. </p>\n<p>“We didn’t know,” Jimin cuts in before anyone can respond. “Our pack doesn’t work like that. Pack Alpha is lineage only.”</p>\n<p>“Well, that’s your best bet,” Jungkook says decisively. “Since you wanted my input.”</p>\n<p>“You don’t have to do it,” Namjoon interjects, ever the sensible one. “We know very little about the Yoo Clan’s Alpha. We can’t guarantee a win.”</p>\n<p>“And yet,” Yoongi muses, “A one-on-one fight might save us a great deal of bloodshed.”</p>\n<p>“And it might ensure the Yoo Clan’s cooperation, too,” Hoseok adds. </p>\n<p>Jimin watches Seungcheol’s jaw clench, his eyes fixed on the ground. His heart clenches in sympathy. Ever since they were children, Seungcheol has always strove to do the right thing, to be the best for his pack. Jimin already knows what he’ll choose before he’s spoken. It’s hardly much of a choice at all. </p>\n<p>“I’ll do it,” he says, and his bitter gaze fixes on Jungkook. “If it’s the best bet, after all.”</p>\n<p>There’s a moment of silence as the weight of his words settle. None of them are happy with the choice. But they can’t deny that it seems like the most logical one. </p>\n<p>“Then all we have to do is get there,” Yoongi says, tossing another stick into the fire. “And we already know exactly where to go.”</p>\n<p>Namjoon nods. “We can leave at dawn.”</p>\n<p>“There is another thing to consider,” Jungkook interjects. “They’ll be waiting for me when we leave the boundaries of the safe space. Jimin will be a target, too.”</p>\n<p>Hoseok frowns. “Should we separate?”</p>\n<p>“I’m not leaving Jimin with you.”</p>\n<p>“And I’m not leaving him with you,” Seungcheol bites back. </p>\n<p>“Stop it,” Jimin huffs. “Don’t I ever get a say in anything?”</p>\n<p>They both look appropriately shame-faced.</p>\n<p>“I have a better idea,” Namjoon says, and his expression is distant like it gets when he’s busy plotting. His gaze centers, and he nods, affirming it. “Yes. I think I know exactly what to do.”</p>\n<p align=\"center\">❄</p>\n<p>The rogue encampment has travelling wares here and there, and Hoseok barters for two outfits. Jimin and Jungkook shed their own clothing for the new ones after thoroughly disguising their scents, rubbing an herbal paste over their scent glands. Jimin is loathe to do it, but he rubs his beautiful bear furs against the bark of a pine tree as gently as he can until his and Jungkook’s scents fade from it. Jungkook does the same with his own furs. Jimin’s pack disguises their scents, too, and they prepare to leave. </p>\n<p>They don’t disassemble their camp, leaving remnants of it there, as if they’re set to return. They take only what they need and use the cover of night to slip through the camp lands unnoticed. The last part of the plan is up to Yoongi, who has always been small and quick, the perfect choice. He leaves them, exiting the boundaries of the safe land, to find animals to drape Jimin and Jungkook’s thoroughly scented clothes over. </p>\n<p>It won’t be easy, slinging a shirt over the antlers of a deer, but Yoongi gets it done. When they hear him jogging through the woods toward them, waving in affirmation, they pick up their things and begin to run in the opposite direction. </p>\n<p>It isn’t the most meticulous of distractions, but it’ll have to do. If they can throw any waiting rogues off their trail for even a little while, they can cover some distance unscathed. Though it’s slower, they remain in their human forms, knowing their scents will be less potent that way. The snow has begun to melt, and so they find it easier to hide their tracks as they move. </p>\n<p>Only when dawn breaks do they stop to rest, carefully inspecting the clearing they stop in before they dare to settle. Yoongi, Jungkook, and Hoseok leave to hunt; Seungcheol and Namjoon stay back with Jimin to start a fire and gather herbs. They fill their canteens with cold water from the nearby river. </p>\n<p>Jimin’s sitting with Namjoon while Seungcheol sets water to boil over the fire when the others return. He’s showing Namjoon how to braid catmint into a bracelet, which Namjoon is hopelessly struggling at. Jimin doesn’t realize how big he’s smiling until Hoseok passes by, ruffling his hair, and comments on it. </p>\n<p>“There’s the Jimin I know,” he says fondly. “What a pretty smile.”</p>\n<p>Jimin flushes, embarrassed. Jungkook’s staring at him. He looks almost surprised. Jimin supposes he hasn’t had much reason to smile freely since they met. He looks away, feeling shy, and Jungkook joins the others to prepare their dinner. </p>\n<p>While they wait for the stew to cook, Namjoon draws a map in a patch of snow of what the Yoo Clan lands might look like now that they’ve taken over the Choi Pack. “They’ll have extended westward,” Namjoon says, outlining the areas he adds. “But like we’ve discussed, it’ll be better if we approach them from the east. The terrain is easier there.”</p>\n<p>He sketches their route through the snow, from where they are now to the eastern border of the Yoo Clan. Jungkook’s frowning down at it, eyebrows furrowed, and Jimin peers at him curiously.</p>\n<p>“What’s wrong?” he asks quietly, and Jungkook glances at him. The others are looking at him now, too. </p>\n<p>“You’re planning on crossing the river here?” he asks, pointing at a part of Namjoon’s map. </p>\n<p>Namjoon nods. “There’s a bridge there. Do you know it?”</p>\n<p>“There’s a better way,” Jungkook says. Namjoon hands him the stick, and Jungkook traces another path off to the side. “This way’s faster.”</p>\n<p>“But it passes through Sun Pack lands,” Yoongi points out. </p>\n<p>“It’s the very edge of their lands. They’re a weak pack, small and isolated. They rarely send patrols out that far.”</p>\n<p>“We’re a big group,” Seungcheol says. “Any pack would deem us a threat.”</p>\n<p>“Crossing the bridge is dangerous and obvious,” Jungkook objects. “We are bound to run into a threat if we travel that way. It’s slower, too.”</p>\n<p>“I don’t feel comfortable passing through another pack’s lands.”</p>\n<p>They’re beginning to frown at each other, and Jimin can sense a fight coming. “Let’s have a vote,” he interjects. “Majority wins. It’s only fair.”</p>\n<p>They both back down, nodding, although Jimin can tell it’s begrudging. Hoseok calls out a quick vote, and crossing the river wins by a large margin. Only Hoseok votes for Jungkook’s route. Even Jimin doesn’t feel like it’s the best idea to encroach upon another pack’s lands, not when there are six of them and mostly alphas. They can’t afford to invite any extra problems when they already have so many. </p>\n<p>Jungkook isn’t happy about it, but he accepts it gracefully and doesn’t bring up the route again. They set out early the next morning towards the river crossing. Though their situation is certainly still tense, Jimin feels lighter, more comfortable now that he’s traveling with his pack again. They’re together, and Jungkook’s here, and they’re going to see their pack again.</p>\n<p>But of course, good things never do last. </p>\n<p>They aren’t far from the bridge when they begin to pick up on the scents of at least three rogues, maybe four. Jungkook grows immediately tense. He stalks closer to Jimin, jaw set tight. “We have to move faster,” he tells them. “Get across that bridge. I’ll hold them off.”</p>\n<p>“Not alone,” Jimin insists, but Jungkook doesn’t get the chance to answer - they’re cut off by the telltale snap of a tree branch. They’re close. </p>\n<p>“Go,” he hisses, and they all begin to run. </p>\n<p>The river moves fast, filled up from the snowmelt off the banks, and the bridge that dangles over it is rickety and weak. They don’t have time to be afraid. Yoongi volunteers to go first to test it and make sure there’s no one waiting on the other side. Jimin watches him cross with his heart in his throat, feeling the fear freeze his limbs just at the sight of his small figure and the rushing water below him. </p>\n<p>As soon as he steps onto land, a snarling wolf charges from the woods right for him. Yoongi doesn’t have time to worry about his clothes and shifts immediately, shredding them to pieces, meeting the wolf with a growl they hear even over the river. </p>\n<p>“Shit,” Seungcheol hisses, bolting across the bridge to join him without a hint of hesitation. Namjoon is quick to follow, stripping his clothes off as he runs. </p>\n<p>“There are more coming,” Jungkook warns. </p>\n<p>“Better to get across and join them there than be stuck here,” Hoseok says. He steps onto the bridge and begins to follow. </p>\n<p>“Go,” Jungkook insists, and Jimin follows.</p>\n<p>The bridge is as rickety as it looks. It sways as they walk along it, and Jimin clutches the ropes tightly, willing himself not to look down. Hoseok seems to be having a hard time before him. He focuses on putting one foot in front of the other. Ahead of them, Seungcheol, Namjoon, and Yoongi are locked in conflict with two wolves. </p>\n<p>Jimin looks over his shoulder. Jungkook’s standing on the riverbank, pulling off his clothes; there’s rustling in the trees. He brings his wrist up to his mouth and unloops his bracelet with his teeth. Then he shifts, standing before the bridge like a sentinel.</p>\n<p>There’s a wicked growl, and Jimin’s head snaps forward just in time to see a wolf launch itself right onto the bridge. The bridge sways violently, and Jimin clutches the ropes so tightly his hands burn, his feet slipping on the wood. Hoseok shifts to meet the other wolf, the scraps of his clothing falling into the water below.</p>\n<p>The wood creaks beneath Jimin’s feet. If he shifts to join them, the bridge will fall. It’s already in danger of carrying too much weight, and he peers frantically back toward the riverbank. Jungkook’s pinning a wolf down, teeth in its neck, and there’s another one coming from the trees to meet them. </p>\n<p>The bridge is rocking fiercely. Jimin has to get off, or Hoseok will go down with the wolf he’s fighting. He turns around and walks back toward Jungkook. Each step feels impossible, and at a particularly violent sway, he nearly loses his footing and slips between the ropes. He holds on with his heart thudding hard in his chest, then dares to take a step and continue on. </p>\n<p>He hears something snap, and then he’s falling. </p>\n<p>He cries out, grabbing onto the ropes with all his strength as the bridge falls. It’s still staked on his side of the riverbank, and he’s swung into the cliff face, cheek scraping against rock. His grip remains strong, and he braces his feet against the rock. For a moment, he can do nothing but breathe hard through the terror. Then he looks over his shoulder. Hoseok must have jumped just in time; he’s scrambling for footing on the opposite bank. Yoongi’s teeth sink into his scruff and tug him onto land. </p>\n<p>The other wolf is gone to the water below them. </p>\n<p>Jimin takes a deep, shuddering breath and begins to climb. He uses what’s left of the bridge and the cliff face for hand and footholds, climbing up carefully, the adrenaline giving him an extra burst of strength despite his trembling muscles. He’s nearly to the top when one of the rogues leans over the side, teeth snapping inches from his face. </p>\n<p>Jimin doesn’t allow himself to be startled; he is sure to lose his grip and fall if he does. He keeps his grip firm and doesn’t flinch, staring at the wolf’s row of nasty teeth, the spit that sprays into his face. He hears Jungkook growl, and the wolf’s being dragged back. Jimin continues to climb. </p>\n<p>When he tugs himself over the side and collapses onto the riverbank, the two rogues lie dead. Jungkook’s panting, but he noses at Jimin’s head, only pulling away when Jimin confirms that he’s alright. Jungkook shifts back into his human form, tugging his clothes back on quickly. </p>\n<p>“There are more coming,” he’s saying. “We have to go.”</p>\n<p>Jimin looks across the riverbank. The others are licking their wounds. Finding another place to cross will waste far too much time. He turns to Jungkook, who’s looping his bracelet back around his wrist. He’s injured, blood dripping down his arm. </p>\n<p>“Can we still take your way?” Jimin asks, and Jungkook nods. He turns back to the riverbank and cups his hands around his mouth to call, “We’ll meet you there!”</p>\n<p>They don’t wait to see what the others’ reaction will be. “Let’s go,” Jungkook says, urgent, and they head back into the woods. </p>\n<p align=\"center\">❄</p>\n<p>Jungkook’s injured in more than one place, but the most pressing area of concern is his forearm. The nasty gash that stretches along it is bleeding freely, and Jimin fears that it might invite infection if blood loss isn’t risk enough. His uncle, Sana’s father, is their pack’s main healer, and Jimin and Sana had often helped him in his work. Jimin knows what to do, but that doesn’t stop the way his stomach rolls when he lifts Jungkook’s sleeve to examine the damage. </p>\n<p>“You don’t have to,” Jungkook’s saying, perhaps picking up on the distress in his scent. “I can do it myself.”</p>\n<p>Jimin just shoots him a look. Binding an arm one-handed is far too difficult. He crouches before Jungkook and upends his canteen of water over the gash, cleaning it out, blood turning the water pink as it disperses into the grass around them. Jungkook had filled Jimin's pack with some materials in case of injury during their stay in the rogue encampment, and Jimin finds enough rags to make do. He wipes it clean, murmuring an apology when Jungkook tenses, and binds the wound carefully and tightly, trying to restrict the blood flow. </p>\n<p>He settles back, breathing through his mouth, the scent of blood making him nauseous. He looks up, and Jungkook’s looking down, his gaze unreadable. There’s blood on his temple and the corner of his mouth, too. Jimin reaches up and dabs at it carefully with the edge of his sleeve. Jungkook’s gaze stays fixed on his. </p>\n<p>“Thank you,” he finally says.</p>\n<p>“Does it hurt?” Jimin asks tentatively.</p>\n<p>Jungkook shrugs one shoulder. He reaches out and takes Jimin’s wrists in his hands, his grip gentle, turning his palms face up. “Don’t forget about yourself.”</p>\n<p>Jimin’s hands are scratched up from the fall. He frowns at them, having barely noticed. “It doesn’t matter.”</p>\n<p>“It does.”</p>\n<p>He takes what’s left of the water and pours it slowly over Jimin’s hands, one after the other. They aren’t actively bleeding anymore, and once they’re clean, they only look like a myriad of scratches. Still, Jungkook brings Jimin’s palms up to his lips and blows gently, drying them. Jimin’s face feels hot. He looks away, shy, until Jungkook lets him go. </p>\n<p>“Will we continue on?” Jimin asks, still flushing too hard to look at him. </p>\n<p>“We’ll go the way I know,” Jungkook affirms. “I’ll get you there. Think your intended would have my head if I didn’t.”</p>\n<p>Jimin flushes harder, more anger than shyness this time. He turns his glare back on Jungkook. “He isn’t my intended. I’ve told you a hundred times.”</p>\n<p>Jungkook’s gaze flickers over his face, searching. “Then what is he?”</p>\n<p>Jimin frowns. He winds his arms around his knees, looking down at the grass beneath his feet, stained red with their blood. “He tried to court me. I rejected his first gift. He still has hopes. That’s all.”</p>\n<p>Jungkook’s brows raise in surprise. “You refused his courting gift?”</p>\n<p>Jimin can’t begrudge him the amazement in his tone. It’s rare enough. Receiving courting gifts from an alpha is a mild enough thing that most omegas accept them even if they have no intentions of accepting the alpha. Omegas, at least in Jimin’s pack, can receive gifts from as many alphas as they want without promising anything to any of them. It doesn’t mean much.</p>\n<p>“I wasn’t interested. I didn’t want to lead him on.”</p>\n<p>“I would have thought it was an honor,” Jungkook says, “to be courted by the Pack Alpha’s son.”</p>\n<p>“It wasn’t like that for me.” Jimin can’t keep the bitterness from his tone.</p>\n<p>“Then what was it like?”</p>\n<p>He doesn’t know why the words spill out, but when he starts, he finds that he can’t stop. No one in the pack had ever bothered to ask him how he felt. His mother had disapproved of the way he pulled away from Seungcheol. Even Sana hadn’t understood. Taehyung had been kinder than the rest, but Jimin doesn’t think he really understood, either. </p>\n<p>“We grew up together,” Jimin says. “And when he started showing interest, everyone started looking at me differently. We aren’t high up in the pack, my mother and I. We aren’t thought much of.”</p>\n<p>“Because of your father.”</p>\n<p>Jimin nods. “I didn’t - I didn’t realize how lowly they thought of us until he started trying to court me. Before, they’d been kind enough. They shared their food with us. The Pack Alpha used to play with me when I was younger. My aunt and uncle let us share their tent. But then suddenly everywhere I went they would say things. About how I’d ensnared poor Seungcheol. How I was trying to climb the ranks. How kind Seungcheol was to even look at me.”</p>\n<p>He digs the toe of his boot into the soil, anger getting the better of him. </p>\n<p>“One of the elders called me a slut when he thought I wasn’t listening. The Pack Alpha started treating me like a troublemaker, always giving me the meanest tasks. So when Seungcheol tried to give me the earrings, I didn’t take them. I told him I didn’t want them.”</p>\n<p>He looks up at Jungkook, whose gaze is steady but unreadable again. “I wasn’t trying to be ambitious. I didn’t want them to think I was.”</p>\n<p>The words that come out of Jungkook’s mouth shock Jimin into silence. “You’re allowed to be happy.”</p>\n<p>Jimin blinks up at him. </p>\n<p>“You don’t have to squander your happiness because they’re choosing to misunderstand you.”</p>\n<p>His throat feels abruptly tight. His eyes burn. He looks away, swallowing harshly. </p>\n<p>“I’m sorry,” Jungkook says. “I will no longer bring him up.”</p>\n<p>Jimin gives a small, quick nod. He doesn’t trust himself to speak. </p>\n<p>“Come,” Jungkook says, standing up and offering Jimin his hand. “We should keep moving.”</p>\n<p>Jimin takes the proffered hand and rises. </p>\n<p align=\"center\">❄</p>\n<p>Travelling with Jungkook is easier than it was the first time - more comfortable. They’re short on supplies, left with Jimin’s bag only, but they make do, moving quickly and carefully through Jungkook’s alternative route. He believes they’ll catch up with the others before long, that they might even make it to Yoo Clan lands before them. The further they get from the rogue encampment, the less tense Jungkook grows. He leaves Jimin alone in the camp to hunt and wash like they used to do before, and Jimin feels no more than a cautionary fear when he’s left alone. </p>\n<p>He even dares to walk to the river himself one afternoon; the weather is warmer than it has been, and he’s eager to bathe, his hair matted with grease and dirt. Jungkook had left camp without mentioning where he was headed, so when Jimin begins to pick up on his scent, he’s surprised. He finds him seated on a rock by the river, bare-chested, scrubbing dirt from his shirt. Jimin pauses just by the trees, a flush rising up his neck. </p>\n<p>He’s seen Jungkook naked many times before; wolves aren’t shy about their nudity, given how often they shift forms. But something about this feels different. He finds his gaze drawn down Jungkook’s strong chest, to the droplets of water collecting in the divots of his abdomen. The gash on his arm is beginning to heal, and Jimin can tell it’ll soon join the other scars on his body. Embarrassed, he averts his gaze and approaches the riverbank. </p>\n<p>He can feel Jungkook looking at him. “I didn’t know you were here,” Jimin admits. Jungkook doesn’t say anything, just goes on washing his shirt. </p>\n<p>When Jimin doesn’t move, Jungkook says, “You can bathe. I’m not stopping you.”</p>\n<p>“Don’t look,” Jimin says, cheeks flaming red, his voice almost a whine. </p>\n<p>He catches Jungkook’s mouth tilt up in amusement before he turns his back on Jimin. “I’m not looking,” he promises. </p>\n<p>Jimin strips out of his clothes and sets them on a rock, along with the rag he’ll use to dry himself. He takes the bar of soap along with him, wading into the water and shivering at the chill. He walks deep enough that he can duck his head under the water and come back up with only his head and neck visible. </p>\n<p>“Okay,” he says. “You can look.”</p>\n<p>Jungkook turns back to the water and continues his washing. Jimin feels like a hypocrite for the way he can’t help but look at him, can’t help but admire the corded strength of his muscles and the way his chest tapers off into a trim waist. Jungkook catches him staring, and Jimin looks away quickly, face red all over again. </p>\n<p>“What?” Jungkook says, amused, and Jimin shakes his head. He rubs the soap between his palms and focuses on lathering it into his hair, trying to pretend Jungkook isn’t sitting just a few feet away. </p>\n<p>He ducks under the water to rinse his head off a few times, shaking like a puppy when he rises. The water is cold, but it feels nice on his skin, refreshing. “Look away,” Jimin demands again, and Jungkook obediently pauses to turn around. </p>\n<p>Jimin rises out of the water enough to wash the rest of his body. Then he wades out of the water, shivering violently, and snatches up the rag he uses to dry himself. He works as quickly as he can, painfully aware of his own nakedness in relation to Jungkook’s proximity. Still a little wet, he tugs on his clothes and tells Jungkook he’s done. </p>\n<p>Jungkook turns back around, and Jimin crouches by the water to soap off his hands and wash them. He places the bar on a rock to dry with the rag, shaking his wet hands off into the water. </p>\n<p>“Hey,” Jungkook says. “Watch where you’re splashing.”</p>\n<p>Jimin shoots him a sideways glance. In a sudden burst of mischief, he dips a hand into the water and flings a spray of water in Jungkook’s direction. Jungkook splutters in surprise, setting his wet shirt down and shivering slightly. Jimin finds himself grinning. He catches the exact moment Jungkook decides to retaliate: the surprise fades to resolve, and his shoulders tense. Jimin holds his hands up but Jungkook’s quicker, splashing water in his direction, soaking him from face to chest. Jimin squeaks, reaching toward the water to return an even larger splash his way. </p>\n<p>Jungkook growls, faking off the rock as if he’s going to pounce, and Jimin shrieks, scrambling back so quickly he falls flat on his ass. He bursts into giggles, tugging his wet shirt away from his chest. Jungkook rises off the rock and Jimin stares up at him as he approaches, eyes wide, wondering if he’s going to try to retaliate again. But Jungkook only crouches before him and takes the rag off the rock. He reaches out and ruffles Jimin’s hair with it, drying his scalp, scratching behind his ears. </p>\n<p>“You’re going to catch a cold,” he warns, and the look in his eyes is impossibly gentle. Jimin flushes, casting his gaze down. Jungkook rubs at his nape through the rag, and the weight of his hands on his neck has Jimin feeling content and satisfied. His omega can’t help the way he responds on instinct, head beginning to tilt to the side, eyes drooping shut happily. </p>\n<p>When he realizes he’s about to bare his neck, he forces his head straight with an embarrassed whine. Jungkook’s eyes crinkle. He looks pleased at Jimin’s reaction. </p>\n<p>“Go dry off by the fire,” he suggests, and Jimin scrambles off back to camp, too embarrassed to stay any longer anyway. </p>\n<p align=\"center\">❄</p>\n<p>Jimin’s dreaming. </p>\n<p>A part of him is aware that he’s dreaming, that nothing he’s seeing is real. The rest of him is so deeply immersed in the dream that it cannot begin to think of waking into a world where it isn’t reality. </p>\n<p>He’s whimpering, in the dream, facedown against the ground, a hand on his nape with a grip harsh enough to bruise. Jungkook’s scent, cloves and cinnamon, is strong and heady around him, has him drooling with desire, eyes rolling back into his head. In the dream, he’s full, body jolting from rhythmic thrusts, his cock rubbing raw and sore against the ground. But he’s barely thinking about his cock. He’s only thinking about the fullness, about how <em> right </em> it feels to have Jungkook inside him. He feels claimed and wanted and satisfied. He can hear Jungkook’s voice by his ear, whispering praise and belonging, feel his fingers rubbing against his scent gland. </p>\n<p>When he wakes up, awareness comes to him slowly. It’s still night, the creeping tendrils of dawn just barely peeking through the trees. Jimin feels strange, his belly tight, and he realizes he’s moving. His hips are rocking back against something hard, and he’s wet, so wet he can smell himself, his arousal mixed in with the overwhelming strength of Jungkook’s cloves and cinnamon. </p>\n<p>Jimin whines, then freezes, eyes widening in shock. </p>\n<p>It had grown far colder in the night. They must have been drawn to each other by the fire. Jungkook’s arms are tight around his waist, holding him back against him, his nose pressed against his nape. The hardness against his ass is Jungkook’s hard cock, and he really is wet, leaking slick right onto both of their pants. Jimin shoves a fist in his mouth to hold back the mortified whine building in the back of his throat. </p>\n<p>He senses Jungkook begin to wake. A low growl rumbles through Jungkook’s chest, his grip tightening. Then Jimin feels the rough, wet drag of his tongue as he licks right over his scent gland. Jimin whines, sudden and pitchy, leaking another gush of slick. </p>\n<p>Jungkook pulls away, abruptly, and Jimin nearly cries out at the loss of his warmth, his omega shrinking in dissatisfaction. Jimin turns onto his back and finds Jungkook hovering over him, teeth bared in a snarl, his eyes dark, flickering in the firelight. There’s a damp spot of slick on Jungkook’s pants, right near the crotch. Jungkook reaches down to run his fingers through it, bringing them up to his nose, breathing in deep. Then he rubs his fingers against his own scent gland, growling lowly. </p>\n<p>Jimin’s hard and overwhelmed, so his reaction is purely instinctual. He spreads his knees apart and drops his head to the side, baring his scent gland, offering himself up for the taking. </p>\n<p>Jungkook growls, and Jimin shudders, leaking more slick, back arching the slightest bit off the ground. He opens his mouth to breathe a plea but then Jungkook’s pulling away, halfway across the camp, chest heaving. He can see Jungkook squeeze his eyes shut and breathe through his mouth. Jimin’s omega wilts and he curls into himself, sobbing softly, rejected and empty. </p>\n<p>Jungkook turns around and leaves the camp. </p>\n<p>Jimin winds himself into a ball, fully crying now, his omega hurting in a way that’s bitter and forlorn. Waking up in the midst of his instincts had meant he’d given his mind up fully to his omega, and so the rejection hurts even more. There’s no rationality involved. Jimin’s omega thinks he’s been rejected by his alpha. </p>\n<p>It takes him a while to calm down, to pull back from his instinctual side and regain his own senses. He sits up slowly, scrubbing at the tears, sniffling quietly. The rational part of him begins to return. Jungkook had probably done the best thing by removing himself. They were both half-asleep, barely thinking. Maybe it wouldn’t have been the best to follow through. </p>\n<p>And yet, part of Jimin feels satisfied with what could have happened. He wouldn’t have regretted it. He knows he wouldn’t have. </p>\n<p>He’d wanted him. </p>\n<p>Jimin changes into his only spare pair of pants, flushing with humiliation when he peels the slick-covered ones away from him and shoves them deep into his pack. Jungkook may very well have gone to the river, and he doesn’t want to risk running into him there. He can wash his pants later. </p>\n<p>Then he sits by the fire and waits. </p>\n<p>When Jungkook returns, his scent is markedly more subdued. He hovers by the edges of their camp, like he’s afraid to get too close, watching Jimin carefully. Jimin watches him back. Slowly, Jungkook approaches the fire, sitting a fair distance from Jimin. </p>\n<p>“I’m sorry,” he says, after a long, tense moment. “I should have pulled away faster.”</p>\n<p>Jimin blinks, his omega building another whine of dissatisfaction. He holds it at bay with effort. “I didn’t want you to pull away,” he admits. </p>\n<p>Jungkook nods. He would have sensed it. “You were unhappy.”</p>\n<p>Jimin nods back. </p>\n<p>“I’m sorry,” Jungkook says, again. “You don’t - you don’t know what I am. I am not suitable for you.”</p>\n<p>Jimin feels wrong, his chest tight. He frowns, resisting the urge to scoot closer to him, to feel his warmth against his side. “Why would you say that?”</p>\n<p>“You deserve someone better. Someone softer.”</p>\n<p>Jimin’s hands clench into fists at his side. “Wouldn’t you provide for me?” he demands. </p>\n<p>Jungkook’s mouth twists, bitter. “I would.”</p>\n<p>“Wouldn’t you protect me?”</p>\n<p>“I would,” Jungkook acknowledges. </p>\n<p>“And wouldn’t you take care of me?”</p>\n<p>“I would.”</p>\n<p>“And isn’t that all I need?” Jimin insists. “You are a good alpha. I would be lucky to have you.”</p>\n<p>Jungkook looks like his words do nothing but pain him. He stares down at the ground, brow furrowed. “I am not soft or gentle or kind. You deserve someone who would treat you gently. Someone who would bring you warmth and safety. I’m - I’m not that. My hands are rough, Jimin.”</p>\n<p>Jimin no longer resists the urge. He stands and walks to Jungkook, sitting on the ground right by his side, their thighs pressed together. He takes one of Jungkook’s hands in his and presses his warm palm against his cheek, leaning into it. </p>\n<p>“They feel soft to me,” he says, and Jungkook’s eyes fly up to meet his. </p>\n<p>He presses his forehead tentatively against Jimin’s, thumb stroking his cheekbone, and lets his eyes drift shut. Jimin brushes their noses together. “You keep me safe,” he murmurs, and Jungkook’s hand trembles. </p>\n<p>They sit there for a long time, breathing each other in. </p>\n<p>Later that day, when they’ve made camp for the night again, Jungkook disappears for long enough that Jimin begins to worry. Then he returns holding a necklace made of the bright red seed of a bean bush. He holds it out, the look on his face almost shy, and says formally, “I would like for you to consider me.”</p>\n<p>Jimin blushes, his heart leaping in his chest. He steps forward until their toes touch. “Put it on?”</p>\n<p>Jungkook slips it over his head, fingers brushing his neck lightly as he adjusts it. He steps back to look at Jimin, and his chest puffs with pride. </p>\n<p>Jimin has trouble sleeping that night. He plays with the necklace, admiring the pretty red of the seeds, and weighs the significance of his very first courting gift in his heart.</p>\n<p align=\"center\">❄</p>\n<p>They continue onward, and everything is fine save for the fact that Jungkook makes Jimin feel unbearably shy. He finds himself blushing more often than not, patting his cheeks to calm down the heat when he’s alone. If Jungkook stares at him for too long, he starts to squirm, fidgety under the intensity of his gaze. Sometimes, when he tries to say something, he just ends up stammering. </p>\n<p>It doesn’t help that Jimin’s shyness seems to please Jungkook. He seems almost proud when he can catch Jimin off guard, make him blush by standing just a little too close or staring for a heartbeat too long. On the second day of travel, Jungkook brings Jimin another courting gift: a small whittling of a swan. Jimin tucks it into his pocket and takes it out every now and then to look at it by the light of the fire. </p>\n<p>The tentative trust that is blooming between them feels right to Jimin’s omega, like what he’s been wanting all along. But the human part of him worries. Jungkook is packless; he has a target on his back. When they free Jimin’s pack, what will happen next? Jimin can’t imagine Jungkook choosing to stay. </p>\n<p>But those are worries for later, and Jimin tries not to let them fester.</p>\n<p>When they grow near to Yoo Clan lands, both of them grow tense. “Their borders must have changed since I was a child,” Jungkook tells him. “But from what your pack said, the eastern border should be the same.”</p>\n<p>“Do you know your way around it?” Jimin asks.</p>\n<p>“Well enough to manage.”</p>\n<p>“We should wait for them there,” Jimin says, “if they aren’t there already.”</p>\n<p>Jungkook nods. “We’ll keep moving up and down the border until we meet them.”</p>\n<p>They had planned on breaching the Yoo Clan from its eastern border, so Jimin believes his pack will meet them there when they make it. As Jungkook expected, it seems like they have arrived faster, and there is no hint of Jimin’s pack alphas in sight. </p>\n<p>They pace along the border, far enough away from it that they’ll be concealed from any patrols, and make camp in a secluded area for the night. </p>\n<p>“Unless they ran into trouble, they’ll be here by tomorrow,” Jungkook says, as if he can sense Jimin’s growing anxiety. “I’ll hunt and return. I won’t go far.”</p>\n<p>Jimin nods, crouching by the fire to tend to it as Jungkook slips into the woods. Jungkook isn’t gone long. Jimin’s still staring into the flickering flames when he hears his return, and he starts, realizing he hadn’t even gotten started on prepping their beds. Jungkook doesn’t seem to mind. He carries a pair of birds to the fire and sets them down, then crouches next to Jimin. He’s holding a small yellow flower in his hand. </p>\n<p>“Is that for me?” Jimin asks shyly. </p>\n<p>“Can I?” He looks to Jimin’s hair, and Jimin nods.</p>\n<p>Jungkook reaches out and carefully weaves the stem of the flower between strands of Jimin’s hair. Jimin flushes at the proximity, staring at Jungkook’s forearm instead of his face, resisting the urge to squirm. </p>\n<p>“How does it look?” he dares to ask when Jungkook pulls away.</p>\n<p>“Pretty,” Jungkook murmurs, and Jimin really does squirm. </p>\n<p>They cook their dinner together and eat in comfortable silence. Jimin sets up their beds, side-by-side; they don’t bother spacing themselves out anymore. “Goodnight,” Jimin whispers, curling up into his furs, and he hears Jungkook’s quiet rumble in response. </p>\n<p align=\"center\">❄</p>\n<p>Jimin wakes before Jungkook does, a rare thing. He rubs his eyes and tends to the fire, running a hand through his ruffled hair as he gathers his bearings. The flower’s still in his hair; it falls out into his fingers, and he tucks it safely into his pocket. Jimin had seen mint growing not far from their camp while they were pacing the border the day before. It would be nice to have some tea. Jungkook always does so much for him; Jimin would like to do something in return. </p>\n<p>He slips away from camp, following his nose, and trods quietly through the woods until he finds what he’s looking for. The mint grows plentiful, and Jimin kneels in the dirt to gather as much as he can hold. </p>\n<p>Drowning in the fresh scent of the herb, Jimin doesn’t notice the scent of a stranger until there’s already a hand over his mouth. </p>\n<p align=\"center\">❄</p>\n<p>They drag him through the woods, his legs scraping against the ground, his coat snagging in fallen branches. Jimin thrashes, but one of them bites the back of his neck until he submits. They drag him right to the main encampment; Jimin immediately notices the way it feels different, wrong. It smells strongly of distress. The sour, rancid scent seeps into everything around him. He wonders how they can stand it. </p>\n<p>He’s deposited right in the center of the camp, where he struggles to sit and takes stock of his surroundings. Their tents look far more temporary than the ones in Jimin’s pack, not too different from those of the rogue encampment. The alphas he sees here and there are big, mean, and they all wear necklaces of many-colored beads. He doesn’t see any omegas. Off behind one of the tents, Jimin sees Dokyeom, an alpha from his own pack, chopping firewood. Horror dawns upon Jimin when he sees the way Dokyeom’s leg is twisted at an unnatural angle - broken, healed wrong. He holds all his weight on his good leg. Another alpha stands at his shoulder, watching him. </p>\n<p>“Pack Alpha!” one of the wolves who had taken Jimin shouts. “We’ve brought you a gift.”</p>\n<p>The flap of the tent directly across the fire lifts. Jimin quakes, scrambling back on his hands, but a harsh grip on the back of his neck stops him. The alpha who emerges stands tall and thick. He wears more beads than any of the others; they drip down to his navel. The furs of a mountain lion cover his shoulders. He’s left the head intact, and it drapes over his arm, glassy eyes seeing nothing. His gaze lands on Jimin, and Jimin trembles so hard his teeth clatter together. </p>\n<p>This is the man Seungcheol will have to defeat. </p>\n<p>Jimin hates the way he begins to lose hope. </p>\n<p>They had underestimated the Yoo Clan. Jungkook had been right to doubt them; they didn’t know what they were getting themselves into. They had planned on marching into the camp like it would be easy. Jimin has heard of the Yoo Clan’s strength; of course he has. He grew up with the horror stories told around the fire. But he had never really imagined anything like this. </p>\n<p>The Pack Alpha approaches them, booted steps heavy against the dirt. He stops just before Jimin’s quivering form and reaches down to fist a hand in his collar. He lifts him up easily, like he’s a child, and Jimin’s left dangling in the air before him, throat seizing up from pressure. </p>\n<p>“A scrawny gift,” he notes, gaze roaming over Jimin’s body. “Just another mouth to feed.”</p>\n<p>“He’s pretty enough,” tries one of the wolves who had brought him. Jimin focuses on breathing shallowly, his legs kicking in the air on instinct. </p>\n<p>“This won’t erase what you did earlier, if that’s what you were hoping,” the Pack Alpha growls. He lets Jimin go. Jimin drops to the ground with a thud, knees hitting the ground painfully hard. He chokes out a quiet sob, clutching his throat. “We’ll see if anyone wants him, or we’ll leave him out in the woods for the vultures.”</p>\n<p>That’s it. He turns away from him, and the other wolves leave him, too. Jimin can’t move. He feels like his limbs are all locked up beneath him. They hadn’t known it would be like this. How could they have known?</p>\n<p>“Come on,” says a voice, and there’s a strong hand gripping his bicep. </p>\n<p>Jimin looks up, and the woman looking down at him uses the distraction to drag him to his feet. He feels like he’s lost all his strength, but she’s strong enough for the both of them. She’s older, around his mother’s age, and she wears no beads - only a pair of long, painted earrings. He can tell she’s an omega, though her scent is faded, bitter like the rest of the camp. </p>\n<p>“Up, up,” she insists, and he puts his weight on his legs. “I can’t carry you, pup.”</p>\n<p>Jimin follows her, her hand still tightly gripping his arm, as if she’s afraid he’ll collapse if she lets go. She walks him to one of the larger tents, pulling him inside after her. His eyes take a moment to adjust to the dim light. </p>\n<p>“Jimin!” </p>\n<p>The shout is followed promptly by the weight of someone’s body slamming into his, knocking him to the ground. Jimin knows that scent, deep, earthy sage. He’d know it anywhere. </p>\n<p>“Taehyung!” he sobs, clutching him back with all his strength, like he can make up for missed time with the force of his embrace. </p>\n<p>“Jimin, Jimin,” his mother’s saying, and Taehyung lets him go only so she can hold him, encasing his face in her gentle hands. She’s crying, and Jimin feels himself begin to cry with her, his gaze flickering over her lined face, barely believing it’s real. “My son. You’re alive.”</p>\n<p>Jimin holds the two of them for an impossibly long moment, rubbing his nose against both of their scent glands in turn, the tears overflowing like a waterfall. He’s babbling questions as he scents them, his words tripping over each other as they tumble from his mouth. “Are you okay? Are you hurt? Where’s Sana? Aunt Kyungri? Have they hurt you?”</p>\n<p>“Slow down, pup,” his mother’s saying. “Sana’s gone - she and Mina ran, they made it out, went for help - </p>\n<p>Taehyung has questions of his own. “Where did you go after you ran? What have you been doing? Why did you come back?”</p>\n<p>“I met the others, Seungcheol and Yoongi and - and the rogue, he helped me, found me - ”</p>\n<p>It’s the voice of the omega woman with the painted earrings who interrupts their frantic reunion. “There will be time for stories later,” she says, her voice gentle but firm. She crouches next to them, and Taehyung and Jimin’s mother back away out of what looks like respect. She gives Jimin a mug of steaming milk, and he takes it gratefully, the warmth finally taking the tremble from his hands. “They will offer you up to whoever is interested tonight. Have you lain with someone before?”</p>\n<p>He shakes his head, eyes wide, the tremble returning as he begins to register the meaning of her question. She hands him a small bottle of oil. </p>\n<p>“Take this and prepare yourself first.”</p>\n<p>Jimin’s stomach rolls with nausea. He turns his frantic gaze on his mother and Taehyung. “Have they - have you - ”</p>\n<p>His mother rests a hand on his knee. “I’m too old,” she says. “They use me for work.”</p>\n<p>“The alpha who wants me is already mated,” Taehyung tells him. “So I’ve been able to hold him off. I work, too.”</p>\n<p>“And the others?”</p>\n<p>Taehyung and his mother exchange a glance, and Jimin doesn’t need to hear anymore. He shakes his head, turning to the omega woman, feeling like his insides are shriveling to dust. “I can’t - I don’t - ”</p>\n<p>“I’m sorry,” she says quietly. He wonders how many omegas she has had to help this way before. “You might not be chosen by anyone. But it is better for you to be prepared.”</p>\n<p>“Please,” he breathes, tears blurring his vision. “Please, help me.”</p>\n<p>The curve of her mouth is bitter. “I could not even help myself. I can do no more than this, pup.”</p>\n<p>“This is Iseul,” Taehyung says softly. “The Pack Omega.”</p>\n<p>Jimin stares at her. His eyes widen as realization begins to dawn. He should have realized it earlier; all the signs were there. “Jungkook’s mother.”</p>\n<p>She reels at his words as if struck. For a long, tense moment, she just stares at him, as if she cannot come up with the questions to even ask. Finally, she blinks herself back to reality and says, “You know my son?”</p>\n<p>Jimin nods, suddenly desperate. “He’s here. He’s here, he will come - he told me about you - ”</p>\n<p>Her eyes are swimming. “He lives,” she breathes. </p>\n<p>“He lives,” Jimin confirms. </p>\n<p>“And my daughter? My alpha?”</p>\n<p>Jimin is loathe to be the one to break the news, but he shakes his head gently. “There is only Jungkook.”</p>\n<p>The raw sound of pain that comes from her hurts just to hear. She looks away, pressing a hand to her mouth, and squeezes her eyes shut. Then suddenly, she turns back to him, fire in her gaze. “He cannot come,” she insists. “He cannot come here. The Alpha will kill him.”</p>\n<p>Jimin’s smile is wry. “Jungkook is not so easy to kill.”</p>\n<p>Someone outside calls her name. She closes her eyes briefly, as if steeling herself, then rises. “I must go. I will return as soon as I can. We must - we must find a way to save my son.”</p>\n<p>She leaves them, and Jimin draws in a shuddering breath. Everything is happening too quickly, and he’s overwhelmed, left unable to process. He can’t do anything but plunge forward and wait for the feelings to catch up to him when he can breathe again. </p>\n<p>His mother and Taehyung draw him into a corner of the tent, where their bedrolls are set up side-by-side. He sees now that the tent is too full for its size; there are bedrolls in rows around the perimeter. A few other omegas linger across the tent, watching him warily. Everyone looks underfed. The Yoo Clan must have overestimated themselves when they decided to absorb an entire pack into their own. They clearly don’t have the resources for it. </p>\n<p>“Where’s Aunt Kyungri?” Jimin asks quietly. </p>\n<p>“She’ll be doing the washing by the river,” his mother says. “She’s all right. We are all doing the best we can.”</p>\n<p>“When did Sana and Mina run?”</p>\n<p>“Not long after we were brought here,” Taehyung tells him. “They promised to find help, but it’s been so long. I just hope they’re alive.”</p>\n<p>“You said you saw Seungcheol? Yoongi?” his mother presses, and he nods eagerly.</p>\n<p>“And Hoseok and Namjoon. They’re alive, they’re well. They have a plan.”</p>\n<p>Taehyung and his mother exchange another glance, and it isn’t a hopeful one. Jimin doesn’t blame them. Mere minutes on Yoo Clan land has shredded so much of Jimin’s hope away. He can’t imagine what months of this have done to them.</p>\n<p>“How did you survive?” Taehyung asks. “And the rogue? You mentioned the rogue?”</p>\n<p>Jimin tells them the story, softly and abridged, explaining Jungkook and the rogue encampment and everything Jungkook had done for him. “This was his pack before he was banished.”</p>\n<p>“And the Pack Omega is his mother,” Taehyung discerns. “Does that mean - the Alpha - ”</p>\n<p>Jimin shakes his head. “The Pack Alpha banished Jungkook’s alpha mother and took her by force.”</p>\n<p>Jimin’s mother nods. “I had gleaned something of the sort from our conversations.”</p>\n<p>“There’s something else,” Jimin dares. He takes his mother’s hand between his own, acutely aware of how fragile it feels to him. “Jungkook, he’s First Rank. The rogue he killed to take the ranking was my father.”</p>\n<p>Taehyung swears under his breath. His mother’s eyes widen. Her grip tightens in his, and he strokes the back of her knuckles for comfort. She stares at him for a long moment, unable to find the words. Then her gaze hardens.</p>\n<p>“Good,” she says, and Jimin feels like a chapter of their lives has finally closed. His mother can have peace at last; he knows the threat of his father had loomed over her head even after his banishment. He has only ever remembered her afraid. </p>\n<p>“Do you want more milk?” Taehyung presses. “I could make you tea. We don’t have much, but - ”</p>\n<p>Jimin shakes his head, reaching out his free hand to take one of Taehyung’s. “Please don’t worry about me. I’m so happy you’re alive.”</p>\n<p>And he is. The fear of the upcoming trials sits in his bones, but Jimin knows with utmost certainty that Jungkook will come for him. He has no doubt in his heart. Jungkook will come, and if he is right, Seungcheol and the others will be here today, too. They will find a way, together, to end this suffering. </p>\n<p>He glances at the other omegas in the tent and scoots closer, lowering his voice. “Seungcheol plans to challenge the Pack Alpha for the title. He thinks if he wins, he can fix this.”</p>\n<p>Taehyung squeezes Jimin’s hand tight and hisses, “He <em> can’t </em> . He doesn’t know what Ilsung is like. He’ll <em> die </em>.”</p>\n<p>Jimin’s throat clogs, and his eyes well with tears. “He might,” he agrees, blinking them back with a shuddering breath. “But he’s going to do this for us. And - and if he does, we might have a chance to run.”</p>\n<p>“What are you suggesting?” his mother murmurs.</p>\n<p>“Whatever the outcome of the fight is, we must use the opportunity to leave. They’ll be arriving tonight. We can use the time to prepare, pack a bag, do what we can. In - in all the chaos, we can take who we can and run.”</p>\n<p>They stare at him, the weight of his words settling visibly on their shoulders. </p>\n<p>“We cannot let his sacrifice be in vain,” Jimin murmurs. “Whatever the outcome may be.”</p>\n<p>“Everyone will come to watch the fight.” Jimin can tell by the firmness of Taehyung’s voice that he’s already won him over. “They keep Dokyeom, Jihoon, and a few of the other alphas and betas locked up in the paddock. They won’t be guarded as carefully during the fight.”</p>\n<p>Jimin’s already nodding. “We’ll free them first.”</p>\n<p>“We’ll warn as many of the other omegas as we can.”</p>\n<p>He looks to his mother, searching for her approval. Her mouth is twisted in worry and doubt. “I already had a bag made,” she finally says, lifting the edge of her bedroll to reveal the strap underneath. “Just in case.”</p>\n<p>Jimin finds it in him to smile. He squeezes their hands in his. “No matter what happens,” he promises them, “We will find a way.”</p>\n<p align=\"center\">❄</p>\n<p>The sound of commotion comes quicker than they expect. He hears shouts, growls, the snapping of teeth. The thud of skin against skin. Jimin can smell him: heady clove and cinnamon laced with rancid distress, with despair. On feet that move of their own accord, Jimin leaves the omega tent, feeling like he’s waiting to tip over the edge of a precipice. </p>\n<p>There are three alphas holding Jungkook down, and still he fights, claws out, teeth bared. His eyes are dark, and the closer Jimin gets, the more bitterness he picks up on in Jungkook’s scent. </p>\n<p>“Jungkook,” he says, and Jungkook’s struggling ceases, his head snapping over to look at him. </p>\n<p>“Jimin,” he growls, and Jimin takes another step forward only to be stopped by a sharp tug to the back of his hood. </p>\n<p>He stumbles back, looks behind him and trembles to see the Pack Alpha, his hand firmly holding Jimin in place. Jimin’s knees wobble, and the look he turns back on Jungkook is full of fear. </p>\n<p>“What is this?” the Pack Alpha asks, his voice a low rumble, and Jimin swallows harshly. </p>\n<p>“Let him go,” Jungkook growls, and the Pack Alpha’s grip tightens. </p>\n<p>“He belongs to us now, pup. You have no claim.”</p>\n<p>“He doesn’t belong to anybody,” Jungkook spits. “Let him go.”</p>\n<p>“Chain him up in the paddock,” the Pack Alpha orders. “If he continues to struggle, we might have to put him down.”</p>\n<p>Jimin’s eyes widen. “No - ”</p>\n<p>“Alpha of the Yoo Clan,” Jungkook says, his voice hard and formal, and Jimin’s heart slows with dread. “I challenge you for your rank.”</p>\n<p>Jimin’s heart stops. “Jungkook, no!” he cries, but Jungkook’s gaze is locked firmly on the Pack Alpha’s. </p>\n<p>The Pack Alpha lets out a barking laugh. “What’s this? A challenge?”</p>\n<p>“Do you accept?”</p>\n<p>“You don’t know what you’re doing, pup. Don’t be a fool.”</p>\n<p>“Do you accept?” Jungkook shouts, the veins in his neck throbbing with fury. </p>\n<p>The Pack Alpha’s voice hardens. “I accept.”</p>\n<p align=\"center\">❄</p>\n<p>As Taehyung anticipated, everyone comes to watch the fight.</p>\n<p>Jimin has gone through his whole life feeling like he stands on the edge of a precipice looking down into nothing. Behind him are the echoes of distant fears: his father, the harsh winters, the Yoo Clan, Seungcheol, loneliness. The past months have brought a host of new fears to pile on behind him. Each one pushes, and he wobbles, staring at the vast nothingness below him. He wobbles, but then he stands steady again. </p>\n<p>He doesn’t know if he can hold his balance through this. </p>\n<p>He stands beside his mother, feeling fear in a way he has never quite felt it before. He watches Jungkook stand tall on one side of the clearing, removing his furs and tossing them aside. Across him, Ilsung does the same. He removes his beaded necklaces, one-by-one, and hands them to Iseul, who stands behind him with a blank face.</p>\n<p>To be reunited with her son only to lose him again - Jimin can't fathom her pain.</p>\n<p>Ilsung and Jungkook are taking off their shirts and shoes, putting them aside for someone to carry away, leaving them in just their trousers - bare and vulnerable. Two betas carry wooden drums decorated with ropes to either side of the circle; the others make room for them. They begin a rhythm that thrums in Jimin’s chest, like a second heartbeat. </p>\n<p>“The Yoo Clan bears witness!” Ilsung shouts, turning and raising his arms before the crowd. “I have been challenged for my rank.”</p>\n<p>Someone howls. </p>\n<p>“Watch me put this pup in his place.”</p>\n<p>More howling, like a chorus, as Ilsung beats his fists against his bare chest. Jimin trembles, and his mother takes his hand in hers, squeezing tight. Jungkook is unfazed, stalking the other end of the circle with his jaw set tight and his gaze calculating. Jimin has faith in him; he does. He’s seen Jungkook fight. No matter how powerful Ilsung may be, how frightening, Jungkook is still the number one. The bracelet of teeth clacking together on his wrist reminds him of that. Jimin remembers how frightening Jungkook had been to him the first time they met, and considers that Ilsung only seems more frightening now because Jungkook doesn’t scare him anymore. </p>\n<p>Jungkook’s going to win. Jimin has to believe it. </p>\n<p>“This won’t be long,” a beta standing not far from Jimin says, amusement in her voice. Jimin bristles, nearly snapping his teeth at her before his mother squeezes his hand in warning. </p>\n<p>Jungkook turns his head, peering at the crowd until his gaze meets Jimin’s. He nods once, and Jimin presses a hand to his heart in response. Then Jungkook turns back to Ilsung, and Jimin can see the shift in his demeanor - everything grows tense, hard, and ready. </p>\n<p>“Begin,” one of the elders calls.</p>\n<p>Nothing happens at first. Ilsung and Jungkook circle each other, and every now and then Ilsung throws out a vicious snarl. Jungkook isn’t intimidated. Jimin swallows harshly, his stomach sick with anticipation. In the end, it’s Jungkook who strikes first. When he lunges, Jimin’s heart lurches and he nearly vomits right there, his entire body jolting in surprise. Ilsung dodges easily, ducking back and away, and Jungkook resumes circling him. </p>\n<p>It doesn’t seem to faze him that his lunge is so easily dodged. Jimin wonders if he’s just trying to get a sense for how Ilsung moves. His theory seems to hold; Jungkook strikes a few more times, and Ilsung avoids him each time. By the third time, Ilsung is laughing. </p>\n<p>“Are you going to best me like this, pup?”</p>\n<p>Jungkook doesn’t bother with an answer. The arrogant tilt of his head is enough. </p>\n<p>Jimin holds his breath. The next time Jungkook strikes, he doesn't stop. He advances upon Ilsung with a flurry of blows, limbs moving in sharp, controlled ways. Jimin's coiled taught like a string, pressing against his mother's side for comfort, feeling like his muscles tense further with every step Jungkook takes. He moves quickly and aggressively, has Ilsung hard-pressed to block and dodge each blow. The control he has over his movements is stunning, honed by years and years of experience.</p>\n<p>But Ilsung is powerful, too, and his brute strength will be an obstacle all on its own. Jungkook keeps up the pressure, forcing him toward the edge of the circle, until Ilsung’s leg darts out and wraps around Jungkook’s. Jimin inhales a sharp breath when Jungkook goes down, squeezing his mother’s hand so hard it must hurt. But Jungkook is quick to roll as he lands, vaulting himself back onto his feet before Ilsung can pin him. Jimin lets out a shuddering exhale. </p>\n<p>They’re crouched, watching each other, and Jimin’s insides are squeezed tight with anticipation.</p>\n<p>“Come on, pup,” Ilsung goads. “You won’t keep your omega like this.”</p>\n<p>Jungkook’s face doesn’t even flicker. He remains calculating, but this time it’s Ilsung who strikes first, tired of waiting - he launches himself at Jungkook’s midriff, clearly intent on throwing him, but Jungkook plants his feet on the ground and pushes back. For a moment, they are both still. If it weren’t for the way their veins pop and their skin turns red from exertion, it wouldn’t look like they were expending any effort at all, just holding each other. </p>\n<p>Then Ilsung shifts the momentum, his leg locking around Jungkook’s once more. This time, he succeeds in bringing him down. </p>\n<p>Jimin doesn’t realize he’s let out a pained whimper until his mother shushes him, stroking his arm in comfort. They’re on the ground now and all Jimin can think about is how big Ilsung is, how strong, and how if Jungkook dies, he doesn’t know what he’ll do with himself. </p>\n<p>“I’m going,” Taehyung whispers, hardly a breath in his ear, and Jimin startles. He remembers they had a plan, that during the fight they were meant to set their escape in motion. Faced with Jungkook, though, Jimin had forgotten everything. </p>\n<p>“I have to stay,” Jimin whispers, and Taehyung nods. He presses his forehead briefly against Jimin’s, and then he slips away from the crowd, quiet as a mouse. </p>\n<p>Ilsung’s fist meets Jungkook’s face before Jungkook rolls away, spitting out a glob of blood into the dirt. Jimin’s chest aches, and he finds he can’t breathe. Ilsung’s on him again and Jungkook knees him in the stomach, but Ilsung lands a succession of nasty blows on his sides, keeping him in place. Jungkook writhes, somehow twisting his way out from underneath Ilsung, but Ilsung follows, pinning him onto his stomach, hand on the back of his neck. </p>\n<p>“No,” Jimin whispers, and his eyes are burning and his skin is burning, too. Jungkook can’t die. He can’t. </p>\n<p>Ilsung presses his knee into the small of Jungkook’s back, grinding his face into the dirt. Beneath him, Jungkook’s twisting, trying to find a way out. He spits out more blood. Jimin’s legs feel weak; he doesn’t know how much longer he can hold himself up. Some of the crowd is cheering on their Pack Alpha, calling for him to finish it, but some of them are silent. Jimin can’t tear his gaze away from Jungkook and Ilsung long enough to check, but he knows their faces won’t show the joy of the others. Many of them will hate Ilsung - he knows that intrinsically. Jimin isn’t the only one who wants Jungkook to win. </p>\n<p>Jungkook gets an arm free and rams his elbow back into Ilsung’s face. It shatters his nose, blood dripping down into his mouth, and he hisses, letting go of Jungkook on instinct. Jungkook shoves back and turns the tables, pinning Ilsung down instead, and Jimin’s eyes fill with tears of relief. But Ilsung manages to wrap his legs around Jungkook’s waist, bucking him off - Jungkook stays strong long enough to land a rain of blows on Ilsung’s already bloody face before he’s shoved away. Ilsung rolls onto his feet faster than Jungkook can and kicks his side so hard Jimin can hear the bone crack - Jimin shudders, horror turning his veins to ice. </p>\n<p>Jungkook scrambles onto his feet before Ilsung can land another blow, clutching his side, blood dripping from the corners of his mouth. His face is growing pale, sweat matting his hair to his forehead, and Jimin can see the way his body has begun to tremble. </p>\n<p>“Come on,” Jimin breathes. “Jungkook, come on.”</p>\n<p>He expects Jungkook to stay back, to recuperate, but he launches himself at Ilsung with twice the fury as before, putting pressure on Ilsung like he had at the very start of the fight. He isn’t the only one who’s tired - Ilsung’s movements are slower than before. Jungkook is smart, pressing him while he still can, looking for a way to land a blow that will hurt. </p>\n<p>The grass is uprooted by the speed of their fight, leaving sprays of dirt, and Jimin can see blood mixing into the ground. The beat of the drum is far slower than the frantic pace of his heart, but he can still feel it thrumming through his veins. </p>\n<p>“Finish him!” someone shouts, and Jimin doesn’t need to wonder who they mean. </p>\n<p>His mother’s voice comes urgent by his ear. “They’re here.”</p>\n<p>No one is looking at him, but Jimin refrains from turning suddenly anyway, afraid of drawing attention. At the edge of camp, he sees Yoongi dragging an unconscious alpha into the woods - one of the few guards they had left to watch the perimeter during the fight. Through the trees, he catches a glimpse of Namjoon, and with him, Sana and Mina. His eyes widen. They’re here. </p>\n<p>Jimin turns back to the fight just in time to watch Ilsung lift Jungkook bodily into the air and slam him onto the ground. His heart stops, and he can’t help it this time - he cries out, taking a step forward. Ilsung follows Jungkook to the ground, hitting him wherever he can reach, and the assault is too fast and too hard for Jungkook to have the chance to gather himself. He holds his arms up to protect his face and Ilsung goes for his chest, his ribs instead, hitting him where he’s already hurt. </p>\n<p>Jungkook’s arms go limp, falling to his sides, and Jimin sees his eyes flutter - he’s fighting to keep them open. </p>\n<p>Jimin’s pack is here. Even if Jungkook loses, there is hope - they will find a way out of this. But Jimin understands acutely that he doesn’t want to escape without Jungkook by his side. He won’t leave this place without him. Jungkook can’t die. Jimin won’t let him. </p>\n<p>But there’s blood pooling on the ground around him and Jungkook’s body is going lax. </p>\n<p>“Jungkook!” </p>\n<p>Jimin tears his arm from his mother’s grasp and falls to his knees just inside the circle, five feet from where Jungkook lies bleeding in the dirt, Ilsung’s fists meeting his head. Around them, some of the pack have begun to stomp on the ground, chanting Ilsung’s name. They think the end is near. He hears his mother call for him, but it sounds muffled, distant. Everything does. There is only this: Jungkook, Ilsung, and Jimin, doomed to watch. </p>\n<p>“Jungkook, get up!” Jimin shouts, his voice clear and firm. He doesn’t know if Jungkook can hear him anymore, but he tries, anyway. “You are Jungkook of the First Rank, a king among the packless! They are nothing compared to you!” </p>\n<p>Jungkook’s hand twitches. </p>\n<p>“Get up!” Jimin cries. “Show them who you are! Show them what number one means!”</p>\n<p>Ilsung is laughing at him. </p>\n<p>“Get up, Jungkook!”</p>\n<p>Jungkook twitches, and then his hand is flying up to seize Ilsung’s throat, squeezing tight. Ilsung’s hands fly to tear Jungkook’s off and Jungkook surges upward, finally free from his relentless punches. Ilsung’s nails tear at the skin of Jungkook’s arm but he doesn’t let go, and Ilsung’s face begins to turn purple. Jungkook drags him down, arm locking tight around his neck, and slams the fist of his free hand into Ilsung’s face. </p>\n<p>“This is for my family!” he shouts, and then he grabs Ilsung’s hair and twists his arm. </p>\n<p>The snap of bone echoes across the clearing. </p>\n<p>The drums stop, and the crowd grows silent. Jungkook lets Ilsung’s limp body fall to the ground and he stands, his entire body trembling. But he stands tall nonetheless, baring his bloodied teeth at the pack. </p>\n<p>“Ilsung,” he spits, “is dead.”</p>\n<p>Someone steps forward from the crowd - an old man with white hair and beads down to his navel. “Our new Pack Alpha,” he says, voice carrying despite his age. </p>\n<p>There is a beat of silence, and then - </p>\n<p>“Alpha! Alpha! Alpha!” </p>\n<p>The pack’s voices rise as one. </p>\n<p>Two more elders come forward to drag Ilsung’s body away. It’s only then that Jungkook’s body gives up on him. He falls, hitting the ground with a painful-sounding thud. Jimin scrambles to his feet and runs, falling beside him, cradling his head in his lap. </p>\n<p>“Jungkook,” he mumbles through his tears, but Jungkook is already unconscious. He’s alive, and Ilsung is dead. “You did it.”</p>\n<p>“Healers!” someone calls, and Jimin sees Sana’s father and another beta break away from the crowd to come toward him. Jimin’s arms tighten instinctively around Jungkook. </p>\n<p>Iseul is at his side, hand on his shoulder. “Let him go,” she says gently. “They will help him mend, and he must rest. All you can do for him now is let him go. When he wakes, you can join his side.”</p>\n<p>Jimin understands, but he doesn’t want to let Jungkook go. Not after all that. It takes him a moment to gather himself, gently placing Jungkook’s head on the ground and moving back. The healers administer what they can there, before they have members of the pack begin to lift him and carefully carry him toward another tent. Jimin watches them go. His hands are shaking, Jungkook’s blood wet on his fingers. Iseul remains by his side, and when he hears her sigh, he looks over. </p>\n<p>Her expression is one of yearning. It is indescribable, and Jimin’s heart clenches. </p>\n<p>“My son,” she whispers, her gaze locked on the tent where Jungkook lies. “My son.”</p>\n<p align=\"center\">❄</p>\n<p>Jimin hovers outside the infirmary tent. He doesn’t know why he feels so afraid. Everything’s alright now; he should feel relieved. But fear doesn’t quite work like that. During the fight, Jimin had been too afraid to feel anything but adrenaline. It’s catching up to him now that the threat has passed. </p>\n<p>He works up the courage to reach for the tent flap, but it rises before he can touch it. Seungcheol steps out, not looking as surprised to see Jimin as Jimin feels to see him. He inclines his head in greeting, and Jimin dips his in return. After Jungkook was taken away, Seungcheol and the others had succeeded in freeing the prisoners from their pack. It had resulted in more fighting, the Yoo pack not willing to back down just because their alpha was dead, until the elders had stepped in. They had called for an end to the fighting until their new pack alpha woke and made his decision.</p>\n<p>Since then, all has been quiet as Jungkook heals.</p>\n<p>“I was visiting Jungkook,” Seungcheol explains, and Jimin blinks at him, still surprised. “Are you going to do the same?”</p>\n<p>Jimin nods. </p>\n<p>“It looks bad,” Seungcheol says gently. “But he’ll be alright.”</p>\n<p>Jimin nods again. “I’m glad you made it here safely.”</p>\n<p>“I’m glad you did, too.” He looks like he wants to say something more, so Jimin waits. He shuffles his feet, then says, “Your heart is set on him?”</p>\n<p>Jimin swallows. He only hesitates out of concern for Seungcheol’s reaction, but otherwise he knows exactly what his answer is. “It is.”</p>\n<p>Seungcheol nods. “I’ll step back, then. I wish you happiness.”</p>\n<p>Jimin blinks, even more surprised than before. Alphas don’t tend to back down just because an omega shows interest in another alpha. They see their courting to the end; it’s fair game until the omega has a mating mark. </p>\n<p>“Thank you,” Jimin says. “I - you’ve always been kind to me, even when others weren’t. It meant a lot.”</p>\n<p>Seungcheol smiles. It’s laced with sadness, but even at the end, Seungcheol remains kind. “And thank you for always turning me down so kindly.”</p>\n<p>“I wish you happiness, too. I hope you will find someone worthy of your love.”</p>\n<p>Seungcheol looks doubtful, but he nods. He steps back, opens his mouth as if to say something more, then stops himself. He turns away, leaving Jimin standing alone in front of the infirmary. </p>\n<p>Taking a deep breath, Jimin lifts the flap of the tent and slips inside. The Yoo Clan healer nods to him. She’s tending to a child with a nasty cough, but other than them, the tent is empty. Save for Jungkook. Jimin swallows harshly, moving through the tent, glancing at each bedroll as he passes. They’re separated by curtains held up by stakes. When he nears the last bedroll, he picks up on Jungkook’s scent and pauses, hovering behind the curtain. </p>\n<p>He hesitates for too long. “Jimin,” Jungkook rasps, and Jimin peeks his head around the curtain. </p>\n<p>To put it mildly, Jungkook looks terrible.</p>\n<p>His torso is bandaged all the way up to his chest. The bandages wrap around his left shoulder and cover his entire arm. His face is swollen and bruised, one eye completely shut, and his mouth is scabbed and swollen. One of his legs is in a splint. The healer must have dressed him recently, but already some of the bandages are blooming red. When he breathes, the sound is wet. </p>\n<p>Jimin presses a trembling hand to his mouth to stop the sob that threatens to come out. He steps past the curtain and sinks to his knees beside Jungkook’s bedroll, gaze flickering frantically over his battered body. He hates crying in front of people, but when the tears spring to his eyes, he doesn’t even have it in him to feel embarrassed. </p>\n<p>“Why did you do that?” Jimin wails, the tears spilling freely from his eyes now. His hands hover over Jungkook’s body, afraid to touch him but needing to comfort all the same. “Why would you do something so stupid?”</p>\n<p>Jungkook stares at him through his one good eye, though good is a relative term - it’s half-lidded from the swelling, too. “‘S alright,” he rasps. “Looks worse than it is.”</p>\n<p>“Liar,” Jimin sobs. “Who told you to fight him? Why would you do that?”</p>\n<p>The corner of Jungkook’s mouth twitches, and even all battered he manages to look amused in that way of his. “I guess I had something at stake, after all.”</p>\n<p>Jimin wipes his tears away with a fist, sniffing. “Did you see her yet? Your mother?”</p>\n<p>“She came to see me. We didn’t talk much, but it was - ” His eye drifts shut, and he sighs. The sound of it is painful, and Jimin winces. “It was nice.”</p>\n<p>“I’m glad.” Jimin settles on taking his hand between his own gently, though his fingers are bandaged, too. He thinks they must be broken. </p>\n<p>“‘S alright,” Jungkook says, again. “Not gonna break if you touch me.”</p>\n<p>“That’s because everything’s broken already,” Jimin huffs, fighting the urge to burst into tears again. </p>\n<p>Jungkook grins as best as he can with his face all swollen. He pats the bedroll by his side. “Come lie with me.”</p>\n<p>Jimin peers at him dubiously, not wanting to injure him further, but he closes his eye and waits, lifting his good arm up. Tentatively, Jimin lies down next to him, only allowing the barest brush of their bodies. But Jungkook puts his arm around him and pulls him closer. Jimin lightly rests his head on Jungkook’s uninjured shoulder. </p>\n<p>“Why would you do that?” Jimin whispers, lump in his throat again. “I thought - I thought I was going to lose you.”</p>\n<p>“I thought so, too,” Jungkook admits. “Then I heard your voice.”</p>\n<p>“You heard that?” He hadn’t been sure his voice would reach through to Jungkook, not when there was so much noise, not when Jungkook was so far gone. </p>\n<p>“You pulled me out.”</p>\n<p>Jimin rests a light hand on Jungkook’s bandaged stomach, brushing against it softly. “You’re Pack Alpha now.”</p>\n<p>Jungkook winces. “Don’t remind me.”</p>\n<p>“Should have thought about that before you did something so stupid.”</p>\n<p>“I would do the same thing again in a heartbeat,” he says seriously. </p>\n<p>Jimin doesn’t have the words to answer that, so he doesn’t. He breathes in Jungkook’s scent and reminds himself, over and over, that Jungkook is alive. That they made it.</p>\n<p>“I’m thinking about finding a way to abdicate,” Jungkook murmurs. “I spoke to Seungcheol about it just before you came.”</p>\n<p>“I saw him walking out.”</p>\n<p>“He came to thank me. And to tell me that he would pose no challenge to my leadership.”</p>\n<p>“But you don’t want this.”</p>\n<p>“I’m not made for it,” he agrees. “I don’t even know what it’s like to live among others.” His hand comes up to play with a strand of Jimin’s hair, twirling it between his fingers. “He would be much better at it than me.”</p>\n<p>“I think you would be a good leader if you tried,” Jimin says honestly, and Jungkook smiles. </p>\n<p>“I don’t know about that.”</p>\n<p>Jimin puts a hand in his pocket in search of the whittling Jungkook had given him; he holds it often for comfort, and he wants to show Jungkook that he still has it. Instead, his fingers brush something else, and he laughs quietly in surprise.</p>\n<p>“What?” Jungkook asks. </p>\n<p>Jimin pulls out the flower Jungkook had placed it in his hair the night before he was taken. It’s dried now. He holds it up for Jungkook to see. “I still have it.”</p>\n<p>Jungkook smiles, too. “All this time I’ve been lying here. Been thinking about what your next courting gifts should be.”</p>\n<p>Jimin huffs. “You shouldn’t be thinking about that.”</p>\n<p>“Think I’ll make you a blanket. Want you to be warm.”</p>\n<p>“Jungkook,” Jimin says, almost a whine. </p>\n<p>“Might scent it, too.”</p>\n<p>“Jungkook!”</p>\n<p>“And some new furs. Yours have seen a little too much. Maybe a tiger’s.”</p>\n<p>“If you go anywhere near a tiger, I will kill you myself.”</p>\n<p>“That so?” Jungkook cracks an eye, and it twinkles with laughter.  </p>\n<p>“You’re terrible,” Jimin mumbles, and Jungkook’s fingers stroke lazily through his hair. He’s beginning to feel choked up again, overwhelmed. “Thank you. For everything. You’ve done so much for me.”</p>\n<p>“Don’t need to thank me. Only done what I should have.”</p>\n<p>“You’ve done much more than that.”</p>\n<p>“No,” Jungkook objects. “Only what I should. Protect you, provide for you, take care of you.”</p>\n<p>“I told you,” Jimin whispers. “I told you I’d be lucky to have an alpha like you.”</p>\n<p>“I’m lucky, too. Lucky you even looked at me.” He takes in a breath that sounds painful, and Jimin frowns, wondering if he should be speaking so much at all. “When I first saw you, I - you’re so pretty. Alluring. And your scent - ”</p>\n<p>Jimin’s blushing too hard. He presses a hand against his cheek to calm down the heat, but it’s useless. </p>\n<p>“Vanilla, amber, so - so inviting. Felt like I was under a spell. Couldn’t get it out of my nose.”</p>\n<p>Jimin remembers his own reaction to Jungkook’s scent, the way it had made him dizzy, how it had overwhelmed him with its strength. “I think your scent put me in an early heat,” he blurts, then whines in embarrassment. “I wasn’t going to tell you that.”</p>\n<p>“That wasn’t your time?” He sounds surprised.</p>\n<p>“No. I was early.”</p>\n<p>“And you think - ”</p>\n<p>Jimin nods against his shoulder, too shy to speak. Jungkook’s quiet, his fingers still moving in Jimin’s hair.</p>\n<p>“Maybe,” he says quietly, “this was meant to be.”</p>\n<p>“Yes,” Jimin breathes, and this time he doesn’t hold back the tears that threaten to slip from his eyes. “Are you - are you going to stay?”</p>\n<p>Jungkook’s quiet. Then - </p>\n<p>“Do you want me to stay?”</p>\n<p>It’s an echo of a question he had asked before, back when Jimin had only been able to provide an excuse as an answer, a reason to keep him around. He doesn’t need an excuse anymore. </p>\n<p>“Yes,” he says, and Jungkook hums softly. </p>\n<p>“Then I’ll stay.”<br>\n<br>\n</p>"
}