{
  "id": "2673572",
  "url": "https://archiveofourown.org/works/2673572?view_full_work=true",
  "author": [
    "jsea",
    "marguerite_26"
  ],
  "title": "Knot if You Don't Knock",
  "rating": "Explicit",
  "archive_warnings": [
    "Underage"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Teen Wolf (TV)"
  ],
  "relationships": [
    "Derek Hale/Stiles Stilinski"
  ],
  "characters": [
    "Derek Hale",
    "Stiles Stilinski",
    "Sheriff Stilinski",
    "Talia Hale",
    "Scott McCall",
    "Cora Hale"
  ],
  "additional_tags": [
    "Alpha/Beta/Omega Dynamics",
    "Alpha Derek",
    "Omega Stiles Stilinski",
    "Alternate Universe - High School",
    "Minor Violence",
    "Knotting",
    "Mates",
    "Jock Derek",
    "Lacrosse Player Derek",
    "Courtship",
    "Full Shift Werewolves",
    "Scent Marking",
    "Sharing Clothes",
    "Awkward Flirting",
    "Alive Hale Family",
    "Werewolf Courting",
    "Werewolf Mates",
    "Panic Attacks",
    "Possessive Behavior",
    "Mating",
    "Mating Cycles/In Heat"
  ],
  "language": "English",
  "series": "",
  "published": "2014-11-28",
  "completed": null,
  "words": "13,737",
  "chapters": "1/1",
  "comments": "160",
  "kudos": "19,390",
  "bookmarks": "4,211",
  "hits": "329,429",
  "summary": "<p>Stiles never expects to present as an omega -- that's something that happens to people like Greenberg, not him. He is so wrong.</p>\n<p>His life only gets stranger when Derek Hale mistakenly bursts through the door of his exam room during a doctor’s appointment. What happens next is a complicated series of events, including freshly baked cookies, book-carrying and surprise heats.</p>",
  "notes": "<p>Hope you like this, katerina_black! It was a lot of fun to write.<br>Thanks to Piscaria, for the beta.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>You can find Maggie on tumblr at <a href=\"https://www.tumblr.com/blog/marguerite26\" rel=\"nofollow\">marguerite26</a> and jsea on Twitter at @jsea215</p>",
  "text": "<p>Stiles hates this. He hates doctors. He hates puberty and he hates <i>so much</i> that he woke up this morning with slick between his thighs. </p>\n<p>He knows it happens. Hell, he’d had the misfortune of being there when Greenberg had suddenly presented during the middle of their econ class last year; the cocktail of omega pheromones had almost caused an uproar. Who knew economics could be so arousing? But then again, you expected that kind of thing to happen to Greenberg. </p>\n<p>Stiles, on the other hand? He was a nobody in Beacon Hills, low man on the social totem pole. That weird kid with a name no one could pronounce, and a dad who was responsible for breaking up all the best parties. So wasn't his life shit enough without having to deal with being an <i>omega</i> as well? </p>\n<p>But he had. Presented that is. Fuck his life. </p>\n<p>Which is why he's in Dr. Talia Hale's office on a Friday after school, stripping down as he waits for a physical.</p>\n<p>He pulls off his shirt first, tossing it carelessly onto the floor, before setting to work on his pants and boxers. He curses when they catch around his ankles, the cuffs of his skinny jeans unable to make it past his shoes. And okay, those should have definitely come off first, but if he was a little on the distracted side today who could blame him? </p>\n<p>He's still fumbling with the laces of his chucks and mostly naked, when the door to his exam room suddenly bangs open. </p>\n<p>\"Mom, I need tooooo--\" </p>\n<p>Stiles whips around, promptly falling on his bare ass. Standing at the door is Stiles' worst nightmare. Or rather, his number one fantasy: Derek Hale -- which makes this moment his worst nightmare: Derek Hale seeing him falling ungracefully to the floor, with his pants around his ankles. </p>\n<p>It's worse than his worst nightmare. </p>\n<p>Derek's staring at him, wide-eyed, his cheeks staining red, but he's not looking away. \"What are you doing?\" he says, his voice a little raspy. </p>\n<p>“Me? What are <i>you</i> doing?\" Stiles aims for accusatory, because words are his first line of defense. He pulls his knees to his chest to try and hold on to at least some of his shredded dignity. </p>\n<p>\"I thought my mom--\"</p>\n<p>\"This is a doctor's office! You don't just <i>open doors</i>. Oh my God.\"</p>\n<p>Derek's face goes a deeper shade of red, but he still doesn't have the courtesy to turn away. There's no apology either, and he doesn't appear to be leaving anytime soon. His mouth is open, like he’s panting. </p>\n<p>Stiles gapes back at him, trying to figure out if he can reach his discarded t-shirt without exposing himself even more. Otherwise, they could be stuck like this forever. </p>\n<p>\"Derek Hale!\" Talia Hale storms into the examination room like a hurricane and a chill slithers down Stiles’ spine at the fury in her voice. \"What on earth to do you think you’re doing?\"</p>\n<p>\"Uncle Peter told me you were waiting for me in room two.\"</p>\n<p>\"Get out,\" Dr. Hale snaps, pushing Derek out the door. \"I'll deal with you <i>and</i> Peter later.\" </p>\n<p>Stiles still feels Derek's eyes on him even after Dr. Hale shuts the door in his face.</p>\n<p>It’s all Peter's fault, Derek’s pretty sure. His uncle was <i>never</i> helpful, so when he’d just shrugged and told Derek that his mom was waiting for him in exam room two, he should have known. Known that his uncle was fucking with him. Or, well, who even knew why his uncle did half the things that he did.</p>\n<p>Peter hadn’t even tried to hide his full-bellied laugh when Derek had fled from his mother’s wrath, jogging-- waddling really-- awkwardly through the waiting area and past where his uncle was spinning lazily around in one of the chairs behind the receptionist’s desk. </p>\n<p>Any other time, and he might have confronted his uncle at that point, except…</p>\n<p>Derek moans when he finally, <i>finally</i>, collapses into his bed. His whole body feels shaky, and even lying down does nothing to help with livewire ache that’s making it hard to breathe and causing sweat to bead up on his forehead.</p>\n<p>He doesn’t even hesitate to skim his pants down over his hips, arching his back and pressing his shoulders into his disheveled bed to do it. </p>\n<p>Taking this slow is not option. His hand wraps immediately around his cock and he hisses at the sensation. It feels different. Everything feels different, like every stroke, every skin on skin produced friction is a brand new experience. </p>\n<p>Jerking off has <i>never</i> felt like this before. His entire body is strung tight like a guitar string and he needs to be played. He spits into his palm and pumps recklessly. He can feel where he needs it the most. There's no denying what's happening with his dick; with every down stroke the heel of his hand grazes his knot. </p>\n<p>He hisses at the tendrils of pleasure from the contact with this new addition to his body. He has a <i>knot</i>. He's an alpha. After all this time, he finally presented as an alpha, popping his first knot after his eighteenth birthday. It's too much to take in with his instincts gone wild, his body morphing into something unfamiliar.</p>\n<p>There's a prickle of warning at the back of his neck. His control is not just slipping, it's almost non-existent.</p>\n<p>Only he knows, instinctively, the most important component in this act is missing. His hand might get him off this time, but his knot is swelling, throbbing for something so much better. His mind provides the visual easily. That perfect ripe ass, the thin body, bent over and ready to be mounted. It takes nothing to dig up the memory of what triggered him, each glorious detail bursting in technicolor behind his eyes. </p>\n<p>His wrist burns as he works his cock, and his brain whirs in a million directions as he tries to think of how he would take Stiles, the obnoxious kid who’s always been on the edge of his consciousness, if he was given the chance. He can't decide between face to face so they could kiss through each exhalation of breath, a slow fuck side by side as their bodies tangled together for hours, or hard and wild like animals after a run in the woods. Maybe Stiles would ride him, hovering over Derek and grinning wickedly as he teased and teased and-- Derek moans, his hand working faster-- teased. </p>\n<p>His grip's tight around the swollen bulb at the base of his dick and he cries out, desperate and aching to be locked inside Stiles' perfect ass. His orgasm steals from him like thunder, rocking him until he's shaken to the core. </p>\n<p>Shattered, he lies in bed. His mind blanks but for the restless itch that even the best orgasm of his life was unable to relieve. He reaches out to the empty sheets beside him, needing so much more...</p>\n<p>Derek feels like he’s been hit with a bus when he wakes up the next morning. </p>\n<p>He’s sore and oversensitive, and even the rasp of his still slightly damp sheets against his skin is uncomfortable. He groans and nuzzles his face into his pillow, unconsciously looking for… something. </p>\n<p>He wishes for the hundredth time in the last twelve hours, that he’d been able to scent Stiles back in that exam room yesterday. Wishes he’d paid more attention, and managed to pick up more than an initial hit of sugar and a sense of <i>right</i>, before he’d gotten overwhelmed by the surge of his hormones. </p>\n<p>He grunts, and rolls out of bed before he can talk himself out of it. Or get hard again. God. His dick gives an optimistic twitch that has him grimacing and jogging in place for a minute to try to redirect the surge of blood; he hasn’t worked himself over this much since he learned what his dick was for in the first place. Although this is sort of the same thing, isn’t it? Except now, instead of the novelty of a surprise boner, it’s a surprise knot.</p>\n<p>Because of Stiles.</p>\n<p>Who he’s known for years. Sort of. Although, after the prank Stiles had pulled on Coach last semester, pretty much everyone knew who he was now too. </p>\n<p>It had been like getting struck by lightning when Derek had opened that door yesterday though. The sight of Stiles, sprawled on the floor and smelling like <i>mine</i> and <i>perfect</i>, had practically bowled him over with its intensity. Probably the only reason he hadn’t face planted into Stiles’ neck and <i>bitten him</i>. </p>\n<p>Someone pounding on his door pulls Derek out of his thoughts. “Wakey, wakey,” Cora yells through his door, and then a second later she adds, “It’s almost noon, jerkface, and I can hear you brooding in there. Or jerking off, but if that’s what you’re doing, then gross. And I don’t want to know about it.”</p>\n<p>Derek hates her for being a morning person and he rolls his eyes, but he’s already up and he knows from experience that she’ll just keep annoying him until he emerges from his room. At least she’s not as bad as Laura, who is thankfully still in New York. She’d always been a little too uncanny in her ability to pick up on what was going on with him. He really doesn’t need to make his life any more uncomfortable than it already is. </p>\n<p>He showers quickly, scrubbing his body efficiently under the cold water, before finally dressing and starting to make his way downstairs, glad that the house mostly seems quiet, with the exception of Cora puttering around. </p>\n<p>He skips down the stairs, and then pauses at the threshold of the kitchen, suddenly hit with paralyzing indecision. He’s showered, but he has absolutely no idea what to do with himself otherwise. Jerking off, to the point of it being almost painful, had done nothing to touch the crazy buzzing under his skin.</p>\n<p>Finally in the kitchen, Derek moves on auto pilot. He absently starts sorting through the kitchen cupboards, his brain catching on Stiles’ name over and over again like a broken record. Except, instead of being overtly sexual, his instincts start to take a worrisome turn for the stupidly besotted. </p>\n<p>He wonders if he can get Stiles’ phone number and call him. To apologize for yesterday, obviously. He thinks Danny knows him? Maybe? </p>\n<p>Or maybe he could burn all his favorite songs on a CD and leave it in the seat of that ridiculous Jeep that Stiles drives… and okay there’s no valid excuse for that one, so maybe not. </p>\n<p>“What the hell are you doing?”</p>\n<p>Derek blinks, his brain stuttering to a halt, and he sets down the bag of flour he was in the process of pulling out of the pantry.</p>\n<p>“What?”</p>\n<p>Cora raises an unimpressed eyebrow and jerks her chin in the direction of the other ingredients Derek had already managed to pull out of the pantry and spread out on the counter. </p>\n<p>Derek follows her gaze, shrugs, and then proceeds to ignore her. He heads over to grab the eggs out of the fridge and sets them down next to the bag of chocolate chips. “Making cookies,” he says blandly, although he refuses to meet her increasingly incredulous stare.</p>\n<p>“But why? And since when do you bake?” She looks for all the world like an actual wolf on the scent of some particularly juicy prey. Actually, she looks uncannily like their mother. </p>\n<p>Derek falters, unsure how to respond to her. He buys some time by bending over and digging a large mixing bowl out of the island cabinet, hoping that the action will hide his blush as well. If Cora notices him blushing, he’s doomed. </p>\n<p>“Oh my God!” </p>\n<p>And shit. Too late. Derek stands with a wince as Cora slaps a hand down on the counter, shaking the egg carton precariously close to the edge. \"You are baking for <i>Paige</i>. You’re actually gonna grow a pair and finally ask her to homecoming, aren’t you? God. Could you be any more cliche?” She grabs his mixing bowl and mimes an upchuck into it. “Captain of the lacrosse team mooning over the captain of the cheerleaders? Excuse me while I gag.\" </p>\n<p>\"Gross!\" Derek yanks the bowl out of her hands, and doesn't bother to correct her. Rumors about him and Paige have been circulating since he was a freshman. Now it's convenient, though. The last thing he needs is for Cora to find out Derek's popped a knot for one of <i>her</i> classmates. \"Get the fuck out or I'm not giving you one.\"</p>\n<p>\"Fine, fine.\" Cora lets him shove her out of the kitchen, fighting just him enough to make it look like she's trying to stay. Derek is under no illusions that she's letting him off easy. \"But I want three.\"</p>\n<p>\"Pig,\" he shouts after her. Annoyed that he's expected to share <i>Stiles' cookies</i>, Derek shakes it off and gets to work.</p>\n<p>He makes a double batch.</p>\n<p>The sugary, chocolatey smell of the cookies is still thick and pleasing when Derek carries them out to his car the next morning. He’s just getting ready to slide behind the wheel when Peter’s Lexus pulls up the drive and parks next to him. When Peter gets out, his eyes light up at the sight of Derek and the cookies, and he bursts out laughing. </p>\n<p>\"Shut up,\" Derek snaps, even though Peter hasn’t actually said anything yet. He unconsciously twists his body in a vain attempt to hide his plate of cookies from his uncle’s sight. </p>\n<p>\"Oh, no.\" Peter's grin is somewhere between charming and smug. \"This is too precious. Is my little beta nephew chasing after Beacon Hills' newest omega? If I’d known that my prank the other day would result in...” Peter trails off, and there’s something both teasing and cruel in the curl of his lips. He gestures vaguely at Derek. “<i>This</i>, well, actually I probably would have done it anyway.”</p>\n<p>\"Fuck you. I don't know what you're talking about,\" Derek says, voice a warning growl.</p>\n<p>He can just make out Peter’s, “tks tsk” as he slams the door of the Camaro hard enough to make the windows rattle. He curses Peter for that too. </p>\n<p>The words <i>Beacon Hills’ newest omega</i> haunt him all that way into town. Fuck.</p>\n<p>John blinks when he opens the door to a young man standing on his porch, an aluminum foil covered plate settled in his outstretched arms like an offering.</p>\n<p>“Can I help you?” he asks kindly, and immediately assumes this must be one of his new neighbors, the son probably. He’d seen the moving trucks a few days ago, although he can’t help but be a little impressed that they’d managed to unpack enough to already have a usable kitchen.</p>\n<p>The kid thrusts his arms out even further, and sort of glares down at the plate. “Cookies,” he mumbles.</p>\n<p>John chuckles, but takes the plate nonetheless, wondering if he can get away with hiding it before Stiles wakes up. It’s only about 10am on a Sunday, so he figures he’s still got a couple of hours. </p>\n<p>And speaking of his son. “For Stiles,” the kid mumbles, still glaring at nothing.</p>\n<p>“Excuse me?” John frowns, wondering how his new neighbors know his son already. Or why the cookies would be for Stiles specifically. </p>\n<p>John tilts his head, studying the kid more carefully. Something about him is familiar, but it’s not until the kid ducks his head, shuffling his feet like words are actually painful, that John finally recognizes him. </p>\n<p>\"You a Hale, son?\" </p>\n<p>Not that he needs the confirmation that comes in the form of a half shrug, half nod. He can definitely see the resemblance to Talia, now that he’s paying attention. He racks his brain, and finally asks, \"Derek, isn't it?\"</p>\n<p>\"Yeah,\" Derek mumbles, not meeting his eyes. \"So give those to Stiles, okay?\" He turns sharply on his heels, and then hightails it down the driveway to a Camaro parked out front. </p>\n<p>John is left standing at the open door, cookies in hand, listening to the sound of tires squealing around the corner. </p>\n<p>He’s not entirely sure what just happened.</p>\n<p>\"Well, shit.\"</p>\n<p>\"Hello?\"</p>\n<p>\"Is this Talia Hale?\"</p>\n<p>\"Yes, it is.\"</p>\n<p>\"This is Sheriff Stilinski. I think we need to have a little talk.\"</p>\n<p>Derek's lying on his bed, <i>lounging</i> in a half-panic, half-bliss stupor. Stiles is an omega; he can barely process it. Maybe if Derek had already been an alpha when he walked into the exam room, he might have known immediately. Instead, Derek had cluelessly baked a newly presented omega <i>cookies</i>.</p>\n<p>The sheriff's face when he realized what Derek was doing on his doorstep was enough to tell him just how unwelcome those baked goods were. But it felt so <i>right</i> to bake them, so <i>right</i> to have them accepted. Derek can't find it inside himself to regret anything.</p>\n<p>His new alpha instincts settle at the thought that he’d provided for… he’s not exactly sure what Stiles is to him, or why he’s so fixated. Still, the satisfaction he feels is very real, and calm floods through his core like he's done <i>well</i>. </p>\n<p>His contentment is disrupted at the sturdiness of the knock on his door. It's the sort of Parent Knock that isn't going to accept being ignored. </p>\n<p>\"Come in,\" he shouts, grateful he hadn't locked it, also that he has his pants done up. He schools his expression, even though his mom always sees right through him.</p>\n<p>\"Derek.\" </p>\n<p>One look at his mom's face as she pushes the door open and he knows that she knows. \"Shit.\"</p>\n<p>\"Help me to understand why I just got a call from the <i>extremely concerned</i> sheriff of Beacon Hills about some chocolate chip cookies.\"</p>\n<p>\"I…\" Derek winces, words failing him. <i>Extremely concerned</i> sounded very much like a direct quote and that didn't bode well. </p>\n<p>His mom sighs. It's the deep, resigned sort that she usually reserves for Laura. \"Derek,\" she says, softly this time as she sits on his bed. \"Sometimes betas can be attracted to omegas. It's rare in our society, but it's not unheard of.\"</p>\n<p>Derek picks at a loose thread in his jeans, not able to meet her eye. Maybe it's better for her to think…</p>\n<p>\"You don't need to change who you are, or mimic alpha behaviour to get an omega's attention.\" His mom has always hated when he denies eye contact when they talk, and she's not having it now. She takes his chin in hand and lifts until he sees her eyes flash red. \"In fact, it important you don't. Be proud of being a beta.\"</p>\n<p>No matter how mortifying, he can't lie to his alpha, to his mom, and he finds himself blurting out, \"Ipoppedaknot.\"</p>\n<p>It's not often he's seen his mom off kilter. It's a pity he can't enjoy the way her face goes slack in shock as she says, \"Pardon me?\"</p>\n<p>\"I saw him and I… My dick…\" He chokes, ashamed he said <i>dick</i> in front of his mom, but any better way to explain this has flown from his mind. He clears his throat and tries to think of a simpler explanation. \"I'm not a beta, mom. I presented as an alpha on Friday afternoon.\"</p>\n<p>\"Because of Stiles,\" she says, her face going pale. </p>\n<p>Derek doesn't need to confirm it. She's already out the door.</p>\n<p>\"Hello?\"</p>\n<p>\"Sheriff?\"</p>\n<p>\"Yes, ma'am.\"</p>\n<p>\"I think you might want to sit down for this.\"</p>\n<p>Stiles is in the middle of an essay on the crankiness of Richard III, when this dad walks in with a plate of cookies. He slams it down on the edge of Stiles’ desk and says, \"Explain.\"</p>\n<p>“They look like cookies?” Stiles says uncertainly. He can’t quite figure out what’s got his dad all worked up; the displeasure rolling off of him makes Stiles fidget uncomfortably. Makes him want to bare his neck and submit.</p>\n<p>His dad glares and says, “Cookies delivered by Derek Hale. Who has apparently now presented as an alpha. He <i>baked them.</i> For you.”</p>\n<p>“Oh,” Stiles blinks and his mouth drops open in shock. He sits back in his chair and tries to wrap his brain around what his dad is saying. Because okay, there had definitely been a moment with Derek back in the doctor’s office, but fuck if he knows what it means. Or the cookies for that matter. Derek is two years and another whole stratosphere of popularity ahead of him; honestly, he hadn’t even realized Derek even knew who he was. </p>\n<p>“Yeah. Oh. I don’t like it. You’re too young for...” his dad waves his hand vaguely and mutters, \"cookies.\" He sighs, like he's resigned and adds, “Just, oh hell Stiles, just be careful, okay? You’re an omega now, and I don’t want you to get hurt by some newly presented, hormone driven alpha who doesn’t know what the hell to do with himself.”</p>\n<p>“I will. Promise,” Stiles agrees absently, mostly meaning it, because what is he <i>supposed</i> to say?</p>\n<p>His dad looks dubious, but finally leaves, sending one final glare at the plate of cookies like he's debating whether or not he’s willing to leave Stiles alone in a room with them. It would all be comical, if Stiles wasn't so preoccupied. His brain keeps catching on the image of Derek, inexplicably wearing a bright pink apron, making the sugary little confections that now sit innocently on the corner of his desk. </p>\n<p>The cookies might as well be a bowl of forbidden fruit for all that they mock Stiles. The scent of them calls to him, chocolate and sugar and whatever other magically seducing ingredient Derek had added. Stiles casts a guilty look over his shoulder to make sure his dad is gone, and then slowly pushes aside his essay notes. He leans forward so that he's level with the flat plain of his desk, resting his chin on his fist only inches away from the plate. </p>\n<p>They look soft and chewy, just how he likes. He wonders if Derek pulled them out of the oven a minute early because he knows that trick, or if he’d just been impatient for them to be done. The best cookies are always slightly undercooked.</p>\n<p>Stiles licks his lips, mouth watering at the thought of Derek popping one in his mouth to check that they were good enough, too-hot chocolate burning his lips and tongue as he gasped around the burst of sweet heat.</p>\n<p>Squirming, Stiles adjusts himself in his jeans. When did he get hard? Possibly somewhere around the moment his dad had said Derek Hale brought him cookies, and that Derek Hale was apparently an alpha. Somewhere in those two-point-three seconds, Stiles' dick decided chocolate chip cookies were the most erotic of all foods. </p>\n<p>He finally gives in and snags one. He was right. It's soft in his hand, just holding together enough to keep its shape, and he knows it's going to be the perfect cookie before he even puts it to his lips. </p>\n<p>It is. He’s feels no shame over the moan he lets out as the chocolate burst onto his tongue, bitter and sweet, perfectly balanced. He's unbuttoning his jeans before his brain can even process what he's doing. </p>\n<p>Research is his thing, and he's done plenty on alpha/omega mating rituals, but it all seemed like a bit of a joke. The whole idea of alphas providing for omegas, doting on them, obsessing over them… it all seemed a gross exaggeration, something to fuel romcoms and steamy paperbacks. </p>\n<p>But there is nothing <i>fake</i> about the taste of this cookie. Or the flare of want in his chest as he thinks of what this gift represents. He's only been an omega for a couple of days now but he understands intimately what this means. Assuming Derek knows Stiles is an omega, for Derek Hale to deliver these to his house as a recently presented alpha -- he is being courted. </p>\n<p>Not just romantically, either. Food, not flowers. Food means he wants Stiles cared for and <i>healthy</i>. Derek Hale wants his body prepared for the exertion of a heat. </p>\n<p><i>Oh fuck.</i> Stiles' hand dips into his boxers. He's wet behind his balls. He can feel it there, the watery-slick of pre-heat. Stiles is in no way ready to explore that part of himself yet. Instead, he focuses on savouring another cookie while he palms his dick. </p>\n<p>His ass clenches, empty and needy. First heats don't come until months after first presenting, so Stiles knows he's safe to enjoy this little tease. His body's changing, growing fully into a mature omega, but he isn't there yet. Maybe a mature omega wouldn't eat the first plate of cookies put in front of him, and feel <i>this</i>, but Stiles shrugs off any guilt.</p>\n<p>Once he's gorged himself enough that his belly's full and his head is spinning with a sugar rush, he gets up and locks his door. He's pretty sure his dad would freak out if he caught him right now, but there's no power on earth that would be able to stop him from getting off <i>thoroughly</i>. </p>\n<p>He strips quickly, licking the last of the chocolate smears from his hands before lying back on his bed. He spreads his legs wide, letting the cool air prickle against the ripeness of his ass until his entire body is covered in goosebumps.</p>\n<p>Derek Hale, captain of the lacrosse team, already on the radar of college scouts, the hottest, most desired senior of Beacon Hills High, finally popped his knot. </p>\n<p>Stiles grips the base of his own dick, imaging how gorgeous Derek's must look, how <i>right</i> it would feel in Stiles' hand. How perfectly it would fill him up. His body tenses, ass pulsing out a wet spot onto the sheet below him. His fist pumps his cock, messy with precome and sweat. </p>\n<p>He thinks back to Friday.</p>\n<p>Derek's face was so flushed as he stood in the exam room, his eyes wide and mouth open as he stared at Stiles bent in two, fighting with his shoelaces in the seconds before he fell over. He remembers Derek's stunned panic, his white knuckled grip on the doorknob and slight tremor of his body. </p>\n<p>The realization hits him, bringing him right to the edge. \"Oh, God.\" </p>\n<p>He'd witnessed Derek popping his first knot. </p>\n<p>\"Oh my God.\"</p>\n<p>He'd caused it. </p>\n<p>He arches off the bed, heels digging into the sweat-damp sheets as his orgasm crashes over him. He collapses on the bed, dragging in few ragged breaths as he looks over at the empty plate on his desk. </p>\n<p>His dad is going to kill him.</p>\n<p>When Derek arrives at school on Monday, it's like his perception's gone wonky. The halls feel too big, too long. Sounds echo like they hadn't before. Scents are magnified a hundred times over. Every detail is in such sharp focus that it's surreal. He’d been so overwhelmed and shocked by the knot suddenly flaring up at the base of his dick on Friday, that he hadn’t really had the presence of mind to pay attention to the changes to his senses.</p>\n<p>It leaves him with a headache. </p>\n<p>That is until one particular scent stands out. He’s drawn to it instantly, and he knows where it will lead. His hi-def turns to tunnel vision.</p>\n<p>He stalks forward, ignoring Cora saying his name, the hands of his friends tapping his shoulder in greeting -- he's focused entirely on the plaid covered shoulders leaning up against a locker at the end of the hallway. Derek unwinds his scarf as he makes his way to Stiles without really realizing he’s doing it. While Stiles' scent is overwhelmingly <i>good</i>, it’s not quite right. It’s not mixed with his own. Yet. </p>\n<p>He's heard of this happening. It's the stuff of omega-centric movies. Alpha's going overboard with gestures and possessiveness. It's ridiculous, or he'd always thought so.</p>\n<p>Only now he's standing in front of Stiles with his scarf held out in offering. He spares a warning growl for the alpha standing by his omega’s side, but otherwise ignores him. He’s so caught up in riding the high of adrenaline and hormones, that he just <i>knows</i> this other alpha is no competition to him. </p>\n<p>There's a pregnant moment where the hallway goes quiet. All eyes fall to them. Stiles straightens up from where he’s been slouching against the lockers, and his cheeks turn a blotchy pink from his jawline all the way down his neck, like a rash. </p>\n<p>Nothing happens for long enough that whispers start to pick up, the volume rising with Derek's anxiety. </p>\n<p>Then Stiles, looking as surprised as anyone, steps forward and ducks his head for the scarf to be wrapped around him. The whispers pick up like a gust of wind before a storm, like the weather has changed from one heartbeat to the next. </p>\n<p>Derek tries to ignore it. He takes his time winding the scarf around Stiles' neck until his omega is surrounded by Derek's scent. Something settles, warm and content in his chest, better than the satisfaction he’d felt at seeing a dozen perfectly baked cookies piled onto the plate, ready for delivery. Without a word, he turns and walks away. </p>\n<p>It's only after he hears the sputtered, \"What the hell just happened?\" that he realizes that maybe there were supposed to be words exchanged. Maybe he should have introduced himself, at least? Gotten a phone number? </p>\n<p>But Derek wasn't meant to be an alpha, so no one's ever told him how this is supposed to go.</p>\n<p>He keeps walking away, cheeks burning, every eye in the hallway turned towards him, because who the hell is he kidding? The awkwardness of the entire fucking situation is all him.</p>\n<p>Stiles is confused. Aroused and confused, as he stares after Derek’s retreating back. The scarf around his neck is warm and smells <i>good</i>, but it doesn’t exactly do anything to help clear the jumble of emotions, instincts, and hormones making his head spin.</p>\n<p>He knows, after god knows how many hours worth of research the night before, that it's possible for latent alpha genes to manifest unexpectedly in the last stages of puberty. But it's rare. Like really rare. And knowing that? Well, it does absolutely nothing to explain Derek’s fixation on <i>him</i> of all people.</p>\n<p>Of course, there’s a limit to the amount of self-conscious incredulity it’s possible to feel with Derek Hale's scarf wrapped warmly around his neck. If he’d had any doubt about the whole courting thing, they’ve pretty much just died a swift and painful death. </p>\n<p>Despite Derek being an absolute jerk about it.</p>\n<p>“What the hell,” Stiles mutters, more to himself than anything. </p>\n<p>Scott obviously hears him though, and his voice is strangely gruff when he says, “I dunno, man, but I don’t like it.”</p>\n<p>Stiles turns to look at his best friend and then blinks, surprised to see Scott’s eyes flaring red around the edges.</p>\n<p>“Hey buddy.” Stiles hesitantly waves his hands in Scott’s face, and just like that Scott’s eyes clear and the fangs that had been descending withdraw back into his mouth. Scott blanches. </p>\n<p>“Crap. Stiles, I’m…”</p>\n<p>But Stiles has already backed a step away from him, his hands coming up to grip at the edges of Derek’s scarf despite himself. It’s weird, because it’s barely a scrap of fabric, but it makes him feel safe anyways. Not that Scott would never hurt him, but he’s also obviously being affected by Stiles’ new cocktail of pheromones as well.</p>\n<p>“It’s okay,” Stiles says, voice tight and stressed. He winces at the hurt look that passes over Scott’s face, and reaches out to pat him on the shoulder, only to abort mid motion because the thought of adding another alpha’s scent to his own makes him feel vaguely nauseous. “Um, sorry. I’m a little confused right now.”</p>\n<p>Scott huffs and gives him a wry look, but some of his hurt dissipates. “It’s okay. I get it. Sort of. I mean...pretty sure Derek being an asshole is just Derek being an asshole, and not because he’s an alpha? But I mean, I remember when I presented last year. Everything was all…” Scott trails off, and Stiles recognizes his patented <i>I’m thinking about Kira</i> look. </p>\n<p>It’s eerily similar to the way Derek had just looked at him. </p>\n<p>“Yeah,” Stiles agrees, smiling at the all too familiar look. “Come on, We should get to class.”</p>\n<p>Scott grins back. “Want me to carry your books for you?” he asks, and then his grin turns into a chagrined smile when Stiles shuffles his feet in discomfort. Scott scratches awkwardly at the back of his head. “Or, you know, not.”</p>\n<p>Stiles rolls his eyes at the puppy-eyed apology Scott immediately attempts to project at him, because best friend telepathy is totally a thing. “Dude,” Stiles says, all that’s necessary to accept it.</p>\n<p>All well between them again, they turn and make their way down the hallway. The students crowding in the halls part around them as they start to head in the direction Derek had disappeared, whispers kicking up as they pass. It’s almost more than Stiles can bear. He’s never had any issues with having attention on him, hell, he’s put a lot of effort into getting it, in the past, but this feels different. The eyes on him feel invasive and wrong, like a physical presence, and Stiles is sweating by the time Scott finally herds him into their English class. </p>\n<p>“You okay?” Scott asks, looking concerned, as they collapse into their seats. “You’re looking a little flushed.”</p>\n<p>“Yep. Yes. Just fine.” Stiles smiles in what he hopes is a convincing manner. He tries to lighten the mood, and Scott’s concern, by saying, “Hey, Jackson totally booked it to get out of my way back there, didn’t he?”</p>\n<p>“Totally,” Scott says. “That was awesome.”</p>\n<p>The thought of Derek’s claim being strong enough to even run Jackson off makes Stiles feel a little better. </p>\n<p>As the bell rings, signaling the start of class, Stiles' brains immediately tunes their teacher out, instead fixating back on Derek, and the intensity of his eyes as he’d wrapped the scarf around Stiles' neck. He flushes at the memory, and his blood runs hot under his skin, even as his brain struggles to reconcile that with the utter asshole Derek had been in not actually saying a single damn word to him.</p>\n<p>Still. Stiles turns his face into the scarf and inhales deeply. Derek’s scent is thick and musky, and it settles him.</p>\n<p>\"No,\" his dad says the minute he walks in the door after school. </p>\n<p>The scarf is off in three seconds flat, his dad uncurling it from his neck with a scowl and a nose twitch, a weird reversal of the moment when Derek had put it <i>on</i> him. It's tossed onto the coat rack no one ever uses, and Stiles stares at where it hangs listlessly. It looks like it's been put in the corner for misbehaving. He thinks, maybe, his dad wishes he could hang Stiles safely away on a coat rack too. But he's pretty sure there are laws against that.</p>\n<p>Stiles is still eyeing the scarf with a kind of longing that prompts his dad to stand between him and the article of winter warmth like he's breaking up a couple of drunks performing an act of public indecency. </p>\n<p>\"To your room,\" he says to Stiles, his arms crossed. \"And that… <i>thing</i>... stays right there while I make another phone call.\"</p>\n<p>Stiles sighs dejectedly but clomps up the stairs to the pile of homework that he knows is waiting for him. It’s a poor consolation.</p>\n<p>The next morning the scarf is nowhere to be found; Stiles feels naked without it, like he’s walking out the door without his phone or his wallet. He plays it cool though, because it seems like a good idea to stay under his dad’s radar for the moment. </p>\n<p>When he finally pulls up to the school twenty minutes later, Derek is idling around his assigned parking spot, hands stuffed into the pockets of his leather jacket. \"My dad took it,\" Stiles explains as he climbs out of his Jeep, his hands automatically reaching up to rub at the back of his neck like he’s hoping to find the scarf there anyways. </p>\n<p>Absently, Stiles thinks it’s funny that those are the first words they've exchanged since all this started. Everything is communicated in actions between them, looks and gestures. The intent is clear, and instincts… man… he never knew instincts could make everything so simple.</p>\n<p>And it is simple. </p>\n<p>Simple to lean into Derek's hand as he brushes his cheek. </p>\n<p>Simple to accept the leather jacket that Derek gracefully pulls off and slips over Stiles' shoulders.</p>\n<p>They walk down the halls together, their shoulders brushing. It’s nothing like when Stiles had walked down this same hallways with Scott yesterday either. It’s like they’re in a bubble, everything weirdly hushed as the throngs of students flow around them. </p>\n<p>When they reach his locker, Stiles flushes in pleasure when Derek grabs the heavy pile of books from his arms. He stands there looking for all the world like some sort of Byronic hero, patiently waiting to escort him to his next class.</p>\n<p>It makes something clench, tight and low, inside of his belly.</p>\n<p>His dad doesn't bother with a phone call this time. He turns a little red, grabs the collar of Derek’s jacket and gets in the car.</p>\n<p>Derek opens the door to find Stiles' dad standing there with a murderous look on his face and Derek's jacket in his hand. </p>\n<p>\"We need to have a talk, son,” the sheriff says, before proceeding to lead Derek into his own home. They find Derek’s mom sitting at the table with a mug of tea in her hands as a casserole bakes in the oven. “Ah, Talia. Just the person I was hoping to find.”</p>\n<p>They sit in the Hale kitchen, the sheriff, Derek and his mom. Derek tries to pay attention but his eyes keep glazing over, too overwhelmed by the scent coming off his jacket. It smells like old sweat and the cologne he likes, but that’s layered over with something sweeter and sharper. It’s an entirely new combination that’s all <i>him and Stiles</i>, and it’s better than anything he’s ever smelled before. </p>\n<p>Besides, none of what the sheriff is saying is new to Derek. <i>Stiles is too young. Derek is moving too fast. It’s not appropriate</i>. The words wash over him as Derek sprawls in his chair thinking about Stiles, occasionally rolling his eyes just for show, but otherwise contemplating how he can be more discreet with his courting. </p>\n<p>The thought of having to hide the intensity of his feelings for Stiles grates inside of him and makes him irritable. He gets even more so when his mom prompts a gruff, “yes, I understand,” from him a few minutes later, when they tell him he’s to stay away from Stiles from here on out. </p>\n<p>Of course, understanding and agreeing aren’t the same thing. Which is why he feels absolutely no guilt the next day as he waits for Stiles in the parking lot again. He’s sitting in his car this time because it’s pouring down rain, but he consoles himself by the fact that he’s wearing his jacket again, snagged from his mom’s office on his way out the door. </p>\n<p>He can’t help the impulse to keep turning his face into the collar and breathing deeply.</p>\n<p>It’s barely a minute later that Derek sits up straighter in his seat and grabs for the extra large umbrella he’d stolen from Cora’s car. His hands are on the door handle so he can get out and rush to Stiles' side, ready to protect him from the rain, when he stops abruptly and sits back again. </p>\n<p>Stiles isn’t the only person in the Jeep, and the other alpha Derek had noticed only in passing the other day get out of the car too. He jogs around from the passenger side and meets Stiles by the hood of the car to share his own umbrella, and Derek can only watch in frustration as another alpha steals his thunder. </p>\n<p>It’s like Derek is frozen. There’s a treacherous little voice in his head that tells him that he’s not needed. That Stiles has another alpha to look after him.</p>\n<p>For the first time since Derek stumbled into his mom’s exam room, Derek begins to question his instincts. He wonders if maybe he has misread Stiles’ interest in return.</p>\n<p>It's been three days since Derek's forced himself to keep his distance from Stiles. </p>\n<p>There is nothing easy about it, and it only gets harder as the week drags on. It has taken all of Derek's control to get through each day, watching another alpha-- Scott, he now knows-- hover around his omega. His shoulder had brushed Stiles' seven times during lunch on Wednesday, and Derek had needed to drive home to change out of jeans that had suddenly developed the unfortunate problem of being full of claw-mark shaped holes. </p>\n<p>Stiles approaching him on Thursday, scent muddled from all the other students milling around them in the hallway, had only made him more irritable. He feels a vague flush of embarrassment as he remembers mumbling excuses about having homework, or lacrosse practice or… honestly, Derek doesn’t even remember what he’d said before fleeing, never having so much as made eye contact.</p>\n<p>He deals with the jumble of pain and uncertainty by throwing himself into lacrosse practice. The mindless pain and fatigue from endless drills is the only thing that can help him to temporarily forget the uncertain look Stiles had given him from beneath his lashes, before walking away.</p>\n<p>Coach had been thrilled at least, and when Friday arrives Derek is ready for the big game, hyped up with unspent, restless energy. </p>\n<p>Spotting Stiles in the stands only heightens his need to destroy the other team. Ironically, this barbaric drive to be physically superior is on level with baking cookies in proving worth. Derek doesn't try to understand. </p>\n<p>All he knows is that Stiles' eyes are on him. Not on Scott who is at his side, talking with the kitsune who is always around them. It feels like the first time in forever that Stiles is focused solely on Derek. Even after Coach calls the team into a huddle, Derek can feel his omega's eyes on his like a palpable thing. </p>\n<p>He's sweated through his uniform before he's set foot on the field. The game is a blur of bodies falling around him, the pain of each hit is stolen by the surge of adrenaline coursing through him. </p>\n<p>Derek's never felt so alive as after his first goal of the night, and he looks to the stands and finds Stiles on his feet, cheering. All the insecurities of the last few days melt away and he fist pumps, jumping into the air and pointing to Stiles, <i>for you</i>. Stiles beams in response, screaming out something Derek can't hear. But it doesn't matter.</p>\n<p>Scott might have held Stiles' attention for a few days, but right now Stiles only has eyes for him. Nothing can take that away from Derek. There's almost a physical force pulling him off the field and into the stands to claim what's his. It takes a conscious effort to go back into position and finish the game.</p>\n<p>When the whistle finally blows, the scoreboard indisputable evidence of Derek's worth as a mate, Derek stalks off the field with single-minded focus. Ignoring the congratulations and celebrations breaking out around him, he dumps his gear into his locker, not caring of the stink or the mess he'll find there on Monday. He showers quickly, knowing Stiles is waiting for him.</p>\n<p>Hair still dripping, clothes clinging to his damp skin, he makes his way back onto the field. Cora is waiting for him, and she hugs him before talking about everyone heading out for burgers. </p>\n<p>Derek barely hears her, too distracted. He shakes his head and hands her his lacrosse bag, his gaze focused on where Scott is in deep in conversation with the kitsune. Stiles' spot is empty. Derek closes his eyes and inhales, easily picking up the scent that's teased him through the halls, haunted him between class and in his dreams. Tonight, he lets himself follow it. </p>\n<p>He finds Stiles under the bleachers, leaning against a support beam, ankles crossed and a lazy smile spreading across his face. It's so much a picture of forced-casualness that Derek almost laughs.</p>\n<p>\"Hi,\" Stiles says, his cheeks flushed and distracting.</p>\n<p>Derek steps in close, and his trembling fingers find Stiles' belt loops with a mix of stupidity, bravery and lust. He pulls Stiles forward until their chests collide, too wild with the high of the night to be tentative. \"Hi,” he says, voice rough.</p>\n<p>For a moment, Derek is overwhelmed by the bitter note of another alpha on Stiles’ clothes, the sharpness of it pulling him out of the moment. The mixed signals confuse him, making his brain and instincts go haywire.</p>\n<p>And then Stiles leans in even further, baring his throat so that Derek can press his face into the tender skin there and breathe deeply. The gesture settles him, but more than that, the fact that the scent there is all Stiles, clean and sweet and untouched. </p>\n<p>They stay like that for a moment, and then Stiles cups his jaw and guides Derek up, stopping when their lips are only bare inches from each other and they’re sharing the same breath. </p>\n<p>\"I was afraid.” Stiles admits softly, pausing to pull away so that he can look up at Derek from beneath his lashes. He looks uncertain when he continues, “I thought maybe you’d gotten bored. That you didn’t want me anymore.\"</p>\n<p>\"Never,” Derek says, quick and decisive. He feels laid bare with that one word, like it’s a promise.</p>\n<p>“Good,” Stiles says, leaning closer. His voice is soft and slightly teasing when he whispers, “I missed you,” into the space between them.</p>\n<p>Derek’s only response is to lean forward across that remaining distance, and finally claim Stiles’ mouth in a searing kiss. It's a sloppy, reckless thing, born of too long denying themselves, both of them giving and taking in equal measure. </p>\n<p>Derek is desperate to put his hands all over Stiles, to erase the scent of anyone else, even as his mouth stakes a claim in the form of a deep purple bruise on Stiles' neck. Stiles' fingers tangle in his hair, first holding him in place as Derek lavishes attention on his throat, and then guiding him back up into a another kiss.</p>\n<p>They should be slowing down, giving each other space to calm down. They're nearly in public, only steps away from anyone seeing them. They are both too young for something this intense, but Stiles' skin is on fire beneath Derek's hands. His scent has turned sweet, God, so sweet and rich like the entire lacrosse field is filled with nothing but the proof of his omega's need.</p>\n<p>He pins Stiles against the beam, catching his legs as Stiles jumps and straddles him. They both exhale, like all the air's been stolen from their lungs as their bodies crash together in all the right spots. They are both hard, and short, jabbing thrusts creates the best friction. There is no stopping them now, Derek realizes.</p>\n<p>When his hands go to Stiles' ass, hoisting him a little higher, he finds his jeans wet and soaked through with slick. Any sanity he had left leaves him. They rock together, frantic and off-rhythm, young and far, far too desperate for this to be graceful. It's just a messy, uncoordinated, perfect race to get off. </p>\n<p>And it feels like it takes no time at all before Stiles is shattering in his arms, whimpering through the intensity of his orgasm and the space between them gets hotter and wetter. Derek's follows helpless after another dozen jerks of his hips like he's trying to rub the fresh come scent of Stiles onto his own jean-covered groin.</p>\n<p>Derek breathes deeply, trying to slow his rabbiting heart, as he lets Stiles down on shaky legs. He keeps him wrapped protectively in his arms. Stiles feels so exposed with the scent of his come and his slick hanging heavily in the air for anyone to <i>know</i>, to try to steal. </p>\n<p>He squeezes tighter, wishing he could whisk Stiles away somewhere safe. But the parking lot feels miles away and there are still voices and heartbeats between there and here. Guilt eats like acid at Derek's stomach. He should never have let them become this vulnerable in public.</p>\n<p>Derek growls in warning the instant footsteps approach.</p>\n<p>\"Stiles?\" A voice shouts from around the corner. \"You down here?\"</p>\n<p>The scent of rival alpha fills Derek's nostrils and he shoves Stiles behind him, ignoring Stiles' protests that, 'it's just Scott.'</p>\n<p>For nearly a week that scent has triggered jealousy in Derek, and it's too ingrained now to be rational, not after the intimacy Stiles just allowed them. Their bond is still too fragile. </p>\n<p>The world's colors mute, sound and smell all shift in an instant. His growls grow louder, more fierce. He snaps his jowl at the other alpha. His clothes are tangled in a heap around his four legs and he can barely process that he's managed his first transformation into a full wolf before Scott steps into view.</p>\n<p>The other alpha's gotten too close. </p>\n<p>His omega needs protection; Derek pounces and his mouth fills with blood. </p>\n<p>The next instant he's shoved off, his omega screaming words Derek can't process. But he understands the rage in his fists. He understands the fear in his eyes. And the smell of salty tears that his omega sheds as he kneels beside the other alpha. </p>\n<p>He understands that his omega has made his choice. </p>\n<p>There are people gathered now, drawn by the shouts. Phones are held up in every hand, capturing Stiles' rejection of him.</p>\n<p>Derek runs.</p>\n<p>Stiles holds Scott's hand the entire ambulance ride. </p>\n<p>Scott tries to smile. \"It's not that bad.\"</p>\n<p>\"I'm covered in blood, Scott.\" Stiles' voice cracks as he waves his hand at his shirt. \"Your blood is <i>all over me</i>. That's not okay. So far from okay that--\"</p>\n<p>\"I'm fine, Stiles.\" Scott squeezes his hand, giving him a weak grin. His face it too pale to be convincing. \"I should have been more careful. I didn't realize you two were… you know.\"</p>\n<p>Stiles wipes the sweat from his palms, acutely aware of the tacky come in his pants and wet in the seat of his pants. </p>\n<p>\"Any way, can you crack open a window?\" he asks the EMT. His damp hair tickles as it curls around his ears. </p>\n<p>The EMT glares at him, his cheeks flushed when he looks at Stiles. \"Trust me, I wish I could.\"</p>\n<p>\"Oh god,\" Stiles says, burying his face in his hands, too mortified to care that they are stained with Scott's dried blood. </p>\n<p>The ambulance lurches to a halt as they arrive at the hospital. The doors fly open and the next few moments are chaos. Melissa's there, and a fresh flood of guilt washes over Stiles. It should be cooler now that he's outside the ambulance, but it's not. Everything is impossibly warm and he's drenched in sweat. His lungs burn as he tries to remember how to breathe.</p>\n<p>\"Stiles, can you hear me?\" </p>\n<p>It's not Melissa, she's already disappeared through the swinging doors with Scott's gurney. But the woman's voice is soft and calm. </p>\n<p>\"Stiles?\" She's stroking his arm. It feels nice. \"Can you count with me?\"</p>\n<p>The floor's cold against his cheek. It feels nice to. He tries to breathe. </p>\n<p>\"Scott's fine, Stiles. You're going to be fine.\" </p>\n<p>His lungs expand with each inhale but he's still breathing too quick, too shallow. He focuses on the woman's voice. On the cool hand on the back of his neck. </p>\n<p>He blinks up at her, then frowns when he finds her vaguely familiar but not enough to place.</p>\n<p>\"Stiles, do you remember me? I'm Dr. Talia Hale.\" Her eyes are soft, looking at him like a mother and not a patient. Her fingers curl in a tight hold of the scruff of his neck and it's grounding. \"Cora called me.\"</p>\n<p>\"Derek.\" His mind flashes through the last half hour: the people with camera phones capturing the attack. The shouts to call the police, to call an ambulance. Flashing lights and people shouting. Scott bleeding in his arms and the wolf no where in sight. \"He… we... \"</p>\n<p>\"It's okay. We have some idea what happened.\" Her expression is soft as she looks down at Stiles. Her hand brushes the hair from his forehead and Stiles closes his eyes to accept the comfort offered, even if he doesn't deserve it. \"Shh. It's okay.\"</p>\n<p>\"But Scott--\"</p>\n<p>\"Scott is going to be fine.\" She pauses, tilts her head like her attention is elsewhere. Then she says, \"He's already healing and more worried about you than about himself.\"</p>\n<p>\"And Derek? I didn't even know he could shift into a full wolf.\"</p>\n<p>\"Trauma or extreme emotions sometimes trigger that unexpectedly in alphas. He's probably as surprised as the rest of us.\"</p>\n<p>\"He just… left me.\"</p>\n<p>\"Derek's had a rough week. And I'm afraid I haven't given him the support he’s needed. I'm sure he's overwhelmed, and I’m sorry for that. But your father is looking for him now and I’m sure everything will be fine. \"</p>\n<p>\"Looking for him, as in, to arrest him?\"</p>\n<p>Talia smiles softly at him and shakes her head. Her eyes are shockingly similar to Derek’s and it calms Stiles down before he can manage to go into a full blown panic. \"No one is getting arrested, Stiles. Now, I need to get you back to your house. It's not right for you to be here.\"</p>\n<p>\"I'm okay, really.\" The words sound forced, even to his own ears.</p>\n<p>\"Stiles, I'm driving you home. That's where you need to be right now. The first time and this early, I know it's an emotional roller coaster for you.\" She gives him a reassuring smile, and then she’s handing him a pair of clean scrubs and directing him to a bathroom. \"Go get changed. You'll feel better.\"</p>\n<p>Stiles can't figure out what she means, his head's too fogged. Getting cleaned up and out of his filthy jeans is an improvement, but all he wants is a shower and bed. He wonders if they still have that old fan in the attic. It'd feel nice right now. His skin's itchy and tight. He feels <i>wrong</i>. There's an ache in his chest for how badly he misses Derek.</p>\n<p>\"You guys were right,\" he says as he finds her waiting for him a few minutes later. \"You and my dad? We should have listened. Derek and I should have stayed away from each other. Look what happened.\" </p>\n<p>\"Oh, Stiles.\" Talia gives him a sad smile, shaking her head. \"We couldn't have been more wrong.\" As if to punctuate her words, she pulls something from what Stiles recognizes as Derek's lacrosse bag. \"This should help.\" </p>\n<p>Stiles blinks at the leather jacket, not quite processing what’s happening. He accepts it mutely, pulling it around his shoulders gratefully when Talia hands it to him. The second she steps back he loses focus again, and it’s all Stiles can do to put one foot in front of the other as she shepherds him out of the hospital. </p>\n<p>\"Sheriff?\" Talia says as they’re walking across the parking lot, and it takes Stiles a second of looking blankly around for his dad, before he realizes that she’s talking on the phone. Her next words startle him out of his daze though. \"You should probably know that Stiles has gone into an early heat.\"</p>\n<p>\"What?\" Stiles mimes at her, jerking to a halt. </p>\n<p>Talia smiles reassuringly at him and puts a hand on his shoulder, gently guiding him forward again until they’re both settled into her car. </p>\n<p>As she continues to speak softly to his dad, Stiles sits in the passenger seat and fidgets, hot and confused and self conscious, until finally Talia says, \"Alright, Sheriff, we're on our way.” She then turns the car on with the press of a button, and instantly there’s the slightly staticky sound of her phone coming through over the car’s speakers. \"Can you put Derek on the line now?\"</p>\n<p>Derek runs. </p>\n<p>The taste of blood is thick and cloying in his mouth as he crashes headlong into the woods that surround the school, then down sidewalks and roads with street names that are jumbled beyond recognition. It’s only pure instinct that guides him down one road over another. </p>\n<p>Everything is shades of gray, and all he knows is the sensation of having done wrong, of having hurt his mate. </p>\n<p>He’s panting when he finally stops, his tongue lolling out of his mouth and his chest and legs trembling with the effort and intensity of his run. He creeps forward cautiously, low to the ground, until he’s at the front porch of a small but well maintained house. The part of his mind that is still human thinks that it’s familiar, but the part of him that is all wolf at the moment only cares about one thing. </p>\n<p>There’s a pair of mud covered shoes sitting by the front door and Derek sticks his nose into one of them, before pulling back quickly on a sneeze. He nudges the shoes with one large black paw, and then with a mournful whine finally curls around them, resting his snout between his front paws.</p>\n<p>Every few minutes he musters the energy to whimper softly, until he finally dozes off.</p>\n<p>He’s woken up sometime later by a sigh that doesn’t come from him. It sounds resigned to his confused mind, and it takes some effort for him to untangle the gruff syllables that follow it. Finally, he picks out the words, “Oh hell, kid.”</p>\n<p>Driving around looking for the inept alpha who was attempting to court his son, his <i>underage and newly presented omega</i> son, was not how John had been expecting to spend his evening.</p>\n<p>It doesn’t help that he’s been driving around for about twenty minutes now, and he’s no closer to figuring out where the hell to even look.</p>\n<p>Not like he could do anything other than try. </p>\n<p>His first instinct when he’d been told of the fight at the school had been to rush out of the sheriff's station and get in his car, ready to head directly to the school. The only thing that had stopped him had been Talia’s name flashing up at him from the screen of his cell phone.</p>\n<p>She’d told him in her no-nonsense way that she had everything under control, and was going to meet Stiles and Scott at the hospital. She would do everything in her power as one of Beacon Hill’s most respected doctors, to make sure everything was taken care of.</p>\n<p>Only, her son had shifted into a wolf and… well. It would have taken a stronger man than John to turn down her request to find her son, especially with the way her voice had gone soft and slightly pleading. Derek was her only son.</p>\n<p>John is relieved when he finally gets a rather unusual break in the form of old Mrs. Simmons, his own next door neighbor, calling him to ask if he knew about the very large dog sleeping on his front porch. And did she want him to call animal control?</p>\n<p>“No. It’s fine, Brenda,” he said. “Thanks for letting me know.”</p>\n<p>He decisively presses of the ‘End Call’ button, because he knows from experience that, the second she gets a breath, he’ll never be able to hang up on her. That done, he turns his cruiser back in the direction of his own house. </p>\n<p>And sure enough, there’s a huge black wolf sleeping on his front porch...curled around a pair of shoes? They look like the sneakers Stiles had worn a few weeks ago on an ill-advised attempt at hiking-- he and Scott hadn’t even been gone for half an hour, before they’d given up and trudged back in defeat to play video games. </p>\n<p>“Oh hell, kid,” he says after he reaches the stairs to the porch. He thinks maybe Derek is sleeping, although fitfully if the little whining sighs he makes every few seconds are anything to go by. </p>\n<p>He is not cut out for this.</p>\n<p>He kneels down next to the wolf and purses his lips when he realizes that Derek is awake. His kaleidoscope eyes are open, locked on John’s face, although Derek still has his head resting on the ground.</p>\n<p>“What am I going to do with you?” John sighs as he unlocks the front door and holds it open with his body. He motions with one hand, urging Derek wearily inside. “Come on, pup.” </p>\n<p>At first Derek doesn’t move, but then all of a sudden he hops up in a flurry of motion and creeps slowly forward, looking for all the world like he’s tiptoeing as he sidles past John. Once he’s inside however, it’s a whole different story.</p>\n<p>Derek’s ears twitch and his nose tilts up. He gives a little yip and then he’s off, picking up momentum as he trots up the stairs before John can process what’s going on.</p>\n<p>He sighs and follows the wolf upstairs. Derek has already disappeared, but he doesn’t need to see him to know exactly where to find him.</p>\n<p>Derek is curled up on Stiles’ bed, head tucked over one of his back legs. His tail is draped half over his muzzle and his eyes are clenched closed with all the stubbornness of someone settling in for the long haul. </p>\n<p>John sits on the edge of the bed, pretending he doesn’t notice when one of Derek’s eyes cracks open to look up at him, before snapping closed again a second later.</p>\n<p>“Your mom told me what happened,” he says. “Scott’s gonna be fine. Stiles, too.”</p>\n<p>Derek whimpers at the mention of Stiles’ name.</p>\n<p>“You know son, this would go a lot better if you could actually talk to me.”</p>\n<p>When Derek’s only response is to curl tighter into himself, John sighs. “Crap, I don’t know how to do this,” he admits. He has a hard enough time dealing with his own son sometimes, that adding an emotionally fragile alpha on top of that is pushing him to his limits.</p>\n<p>John laughs a little wryly, and turns to look directly at Derek again, who is unable to snap his eyes closed in time. John holds his gaze as he says, “Am I right in assuming that this thing with you and Stiles isn’t going away?”</p>\n<p>Derek finally lifts his head, uncurling a little. He gives a soft little muted howl that sounds so heartbroken that even John can’t keep his heart from clenching, because he recognizes that sound.</p>\n<p>It resonates with the part of his soul that still cries out for Claudia every day, that feels empty and incomplete without her. “Shit,” he says, finally understanding what he’s been missing all along. “He’s your mate, isn’t he?”</p>\n<p>“Yeah.” </p>\n<p>John snaps his head up and takes Derek in, where he’s uncurling very human limbs to sit against the headboard of Stiles’ bed. He draws his legs up self consciously to hide himself, looking completely miserable. </p>\n<p>“But he didn’t chose me. He...we…” Derek’s face flames, and he doesn’t need to elaborate for John to get the idea. Talia had mentioned <i>that</i> too. “And I thought that we were good. But then that other alpha showed up, and Stiles defended him and…”</p>\n<p>“Other alpha? Scott?\"</p>\n<p>Derek nods his head once, decisively. He hasn’t met John’s eyes since he shifted back. Still, actual words are progress. “I’ve seen him with Stiles all week. Stiles smelled like him.”</p>\n<p>“Ah.” And okay now things are starting to make a lot of sense. His son is an idiot. But then again, maybe John is too.</p>\n<p>He hadn’t realized. Hadn’t understood that Derek was anything other than a hormone driven alpha chasing after his omega son. </p>\n<p>He looks at Derek now, takes in the way he hugs his knees, and the slouch of his thick shoulders. “I was wrong,” he says. </p>\n<p>Derek snaps his head up and finally meets his gaze. He looks confused. “I don’t…” </p>\n<p>“I was wrong to try to keep you and Stiles apart. I thought you were just trying put a notch on your belt. Try out the whole kno… thing. Sex thing.” He grimaces. “But, hell son. You two deserve each other. And, you know. I was wrong.”</p>\n<p>Derek furrows his brows. </p>\n<p>“As for Scott. Well, first of all you’re an idiot. Scott is just his friend and he’s already courting Kira.”</p>\n<p>Derek blinks.</p>\n<p>“But that aside, I think we’ve done wrong by you. Your mom and I have been so caught up in trying to protect Stiles that maybe we forgot to worry about you too. You’re old to have presented, unusually so. There’s a lot you just….wouldn’t know.“ He rubs at the back of his neck before continuing. “I know how scary and intense all this must be. So, you know. I’m here for you. Man to man, alpha to alpha.”</p>\n<p>“Thank you,” Derek says hoarsely. He looks a little overwhelmed, and John’s heart clenches again. He remembers that Derek’s dad hasn’t been around since he was a little kid, and sure Talia is an alpha too, but he’s thinks about how often he feels inadequate for Stiles sometimes. He’s not Claudia, and there are some gaps he can never fill. He clears his throat to shake off the thought. </p>\n<p>“Now. Lets get you some clothes.”</p>\n<p>Derek is drained, emotionally and physically. He feels numb, but he’s settled too, his mind blank and finally free from the crippling self-doubt that’s been haunting him for the last few days.</p>\n<p>He knows Scott is not a threat to him. He realizes that he probably always knew it, he’d just been so overwhelmed by everything. Scared too. It was about as common for mated pairs to find each other so young, as it was for alphas to present as late in puberty as he had. </p>\n<p>He’s just pulling on the thin BHPD t-shirt the sheriff had lent him-- because Stiles’ clothes were obviously too small-- when the man himself raps once on the door before opening it. He’s got a cell phone pressed between his ear and his shoulder and he’s frowning.</p>\n<p>“Your mom's on the phone.”</p>\n<p>Derek takes the offered cell, listening intently as his mom explains, \"Derek, I have you on speaker phone. Stiles and I are on our way to you now. There's something you should know, though.\"</p>\n<p>\"Stiles and I are mates,” Derek guesses. </p>\n<p>Even over the phone, Derek is able to pick up the rhythm of Stiles’ heart as it kicks up, pounding in the aftermath of the declaration. He grips the phone tighter like that would get him closer to the one person he needs to see <i>right now</i>.</p>\n<p>\"Yes,” his mom agrees sympathetically, “and I'm sorry I didn't recognize it earlier. I should know my own son better than that.\"</p>\n<p>\"'S’okay, Mom.\"</p>\n<p>\"Derek, it's more than that though. A mated pair shouldn't be kept apart so early into the bond for a lot of reasons. I know the stress of the last few days hasn’t been easy on either of you emotionally, but there have also been some physiological consequences. Your ability to fully transform, for instance. </p>\n<p>When his mom doesn’t immediately continue speaking, Derek asks, “And for Stiles?” </p>\n<p>“His heat has been triggered early.\"</p>\n<p>Derek lets out a low whine, the sound more wolf than human. His claws extend, and his hold of the phone fails. He eyes the window, debating bolting through it to meet them halfway.</p>\n<p>\"Derek!\" His mother's voice booms from where he's dropped the phone on the floor. The command in her voice stops him. \"We are on our way there. Don't do anything stupid.\" </p>\n<p>\"Derek?\" Stiles' voice is low and tinny compared to his mother's, but each syllable is like a punch to his gut.</p>\n<p>Derek's eyes widen as he stares at the phone. \"Yeah?\" he says, voice hoarse.</p>\n<p>\"I'll see you soon.\" </p>\n<p>\"Hurry.” Derek cradles the phone tenderly for a long moment, even after the line has gone dead. He sits heavily back down on the edge of Stiles’ bed as he waits. </p>\n<p>It's only five minutes or so from ending the call before Stiles is hovering at the threshold of the door, like he’s not sure he’s allowed in his own room. Derek’s heart skips a beat when he spots the leather jacket Stiles is wearing over a set of blue scrubs.</p>\n<p>Noticing his gaze, Stiles tugs at the collar. “I had blood on my clothes,” he admits. \"Cora gave your mom your lacrosse bag, and this was in there. I can take it off if you want me to?”</p>\n<p>\"No! No, it's… I like you wearing it.\" They both find the carpet interesting for a long moment. Derek can hear the front door close, and he knows they're alone.</p>\n<p>At a loss for what else to say, he asks, \"Is Scott alright?\" The sheriff had told him already, but he needs to hear it from Stiles.</p>\n<p>\"He's fine,\" Stiles says, rocking on his heels, hands shoved in the jacket pockets. \"He'll be okay.\"</p>\n<p>\"Sorry about...\"</p>\n<p>\"Yeah,\" Stiles interrupts when Derek falters. </p>\n<p>This is so much harder than Derek thought it would be. \"I didn't mean to hurt him. Or shift. Everything is so confusing right now, and I just want to…”</p>\n<p>“I know,” Stiles agrees softly, taking a tentative step toward Derek.</p>\n<p>Derek smiles tentatively at Stiles and takes his own step closer. For the first time it feels like his words come easily to him. “Knowing why I feel like this helps. It’s not just because you’re an omega and I’m an alpha. It's <i>you</i>. You are <i>my</i> omega. The way I feel…\" Derek trails off, not because he doesn’t know what to say, but because his stomach twists at the implications of what he’s about to admit. \"It means I'll never feel like this for anyone else.\"</p>\n<p>\"Oh.\" Stiles' mouth drops open and Derek thinks maybe he's gone too far with his confession but Stiles' face softens, and he finally closes the rest of the distance between them. \"Yeah. <i>Same.</i> That's pretty awesome, when you think about it.\"</p>\n<p>\"Yeah.\" Derek's hands find their way to Stiles' jaw, stroking until they move to the back of his neck. His skin is hot, almost too hot to touch. He's just thinking <i>my mate's in heat</i>, when Stiles moans, ducking his head and bowing in clear submission.</p>\n<p>Derek's chest rumbles in pleasure at the sight. \"Mine.\"</p>\n<p>He pulls Stiles forward and their mouths crash together, hot and needy. Like under the bleachers, they are wild and reckless in their touches. But as they both realize this isn't forbidden any more, the kiss gentles. </p>\n<p>Stiles nips at Derek's lip, suckling geedily to keep them connected. As soon as he lets go, he says, \"Will you spend my heat with me?\"</p>\n<p>Derek grins, giddy with adrenaline, and he lifts Stiles by the waist. Stiles' arms and legs wrap around his body, clinging as Derek walks to the bed. They fall in a thump and squeak of springs, Derek catching himself on his elbows so he doesn't land too heavily on Stiles. </p>\n<p>\"This one,\" Derek says, kissing along Stiles' jaw. \"The next. Every one you'll let me.\"</p>\n<p>\"Thank fuck.\"</p>\n<p>They kiss for what feels like hours, learning each other’s mouths, tasting each other and savoring being able to take their time. </p>\n<p>Stiles is content to lie beneath Derek, but he can’t help the way his hips start hitching up in rhythmic little bursts, looking for more friction. His whole body feels alive, and he moans when Derek indulges him, urging Stiles to spread his legs so that he can settle between them. The new position only inflames Stiles more and he grasps desperately at Derek’s shoulders, at the same time bringing his legs up to hook his feet around the backs of Derek’s thighs.</p>\n<p>They rock together, both of them driven by the increased friction, and when Derek reaches down to skim his hands up beneath Stiles’ shirt, and Stiles loses it. The skin on skin contact is more than he can bear; Stiles feels his blood turn molten. His thoughts fly out of his head and in that moment all he can think about is his desperation for <i>more</i>. </p>\n<p>His ass clenches, empty and open, and suddenly the scent of his own slick creeps thick and cloying into the air. </p>\n<p>“Off,” Stiles mutters. His strength has utterly left him, and all he can do is push weakly at Derek’s shoulders. </p>\n<p>Derek must still have some remnants of control though, or else his desire to please Stiles is simply too strong, because he immediately rolls away, sprawling on the bed next him for a second. He immediately lurches forward again to help when he notices Stiles struggling with his clothes, though. </p>\n<p>Derek strips away the last piece of Stiles's clothing like he's unveiling a masterpiece, and then he stops and just <i>stares</i>. </p>\n<p>Stiles is exposed, every inch of him revealed; yearning blazes in Derek's eye, and the scrutiny he's under makes Stiles feel like something precious on display.</p>\n<p>\"You're making me self-conscious,” Stiles says softly. He starts to draw his knees up towards his chest a little, but stops when Derek presses a reverent hand to his hip. </p>\n<p>He soothes his hand downward, stroking along Stiles’ flank like he’s trying to take the measure of him. \"You're beautiful.\"</p>\n<p>Stiles snorts. \"Now you're making it worse,” he says, but he relaxes anyway, body going pliant. </p>\n<p>\"Better?\" Derek asks as he quickly strips off his own borrowed clothes.</p>\n<p>Derek is broad shouldered, with perfect abs and bulging biceps. He’s everything his tight Henleys ever promised. Stiles closes the distance between them, reaching out and trailing his fingers from Derek's clavicle to his nipples. He circles the little nubs, his touches feather light, until Derek's lets out a sound so beautifully raw that it makes Stiles shudder. </p>\n<p>He tilts his body towards Derek's, and they both hiss in unison when they finally come together. It’s not enough, though. Stiles wants-- craves-- to finally be claimed by his mate. </p>\n<p>His slick is dripping down his thighs now, messing his sheets. He flips to his elbows and knees, face pressed into his pillow, ass in the air so that Derek can see what he’s doing to him. </p>\n<p>And he must, because the sound that Derek lets loose is rumbling and on the verge of being inhuman. Stiles has to peek over his shoulder to check that Derek hasn't shifted. He's <i>almost</i> disappointed to see very human, very pink cheeks. </p>\n<p>\"So you can turn into a wolf now?\" Stiles teases breathily. His heart trips as he remembers the way Derek had looked as a wolf, huge and majestic. \"That’s pretty hot. Scary as fuck. But hot.\"</p>\n<p>\"Shut up, Stiles,\" Derek growls. His smile is as sharp as a real wolf’s.</p>\n<p>\"Make me.\" Stiles tries to twist free from his position, and then he laughs in delight when Derek pounces, pinning him easily. </p>\n<p>Derek’s mouth presses to his nape, his breath hot like a warning. Stiles bucks his hips back against the hardness of Derek’s dick. “Do it.” </p>\n<p>Derek doesn’t need any prompting. He bites down hard and Stiles cries out, arching his back at the intense pleasure pain of it. His eyes roll back into his head, overwhelmed. He’s barely aware as Derek's moves downwards, following the line of his spine with a series of nips and open mouthed kisses. </p>\n<p>He doesn't stop when he reaches the dip in Stiles' lower back either, but settles himself between Stiles’ legs, nudging him to spread wider. </p>\n<p>\"Oh God,\" Stiles cries out with the first touch of Derek's mouth on his ass. </p>\n<p>Derek hums, sending vibrations from his lips right over Stiles' swollen, ripe entrance. \"You taste...\" Derek breaks off, swiping his tongue slowly from his balls to his hole. \"You taste amazing.\"</p>\n<p>\"Fuck.\" Stiles pushes back, needing more, grateful that Derek doesn't make him wait.</p>\n<p>Derek clutches at Stiles' hips to stop the squirming, and places an open mouth kiss right over his hole. Stiles has to clutch at a pillow to try and anchor himself, to try to stay still. </p>\n<p>An impossible task, because he's so fucking sensitive. Derek's stubble sends bolts of pleasure through him like his nerves are made of livewires. The actual sensation of Derek's tongue as it presses inside of him, though, fighting to get deeper with quick jabs right where Stiles needs, <i>that’s</i> like being struck by lightning. </p>\n<p>Stiles is helpless to do anything but weather the storm of pleasure rocking him with every new angle Derek tries. His cock aches where it's trapped against the sheets, and he whimpers at the sensation.</p>\n<p>His cries only increase in pitch when Derek pulls him up, relieving the pressure of his cock but reminding him how empty his is, which is worse. Derek manipulates him easily, like he’s little more than a rag doll, until he'd presenting again. His stubble-red ass is raised high in the air, his hole exposed and slick, and so desperately needy. </p>\n<p>He knows what's coming next. \"Yes,\" he cries out, offering everything to Derek without a second thought. He's so ready, his body is alight with need, his hips jerky and restless as he waits for Derek to line up. \"Come on. Fuck me.”</p>\n<p>\"I've never,\" Derek starts to say, but the sentence cuts off as the tip of his cock rubs Stiles' slick, puffy opening. Whatever inexperience he was going to complain about seems to escape his mind as he pokes at Stiles again, this time with more confidence but less accuracy.</p>\n<p>Stiles presses his forehead into the sheets, fighting to keep his breathing even as he waits and needs, his back arching just that little bit more in invitation. </p>\n<p>Derek's lips brush the arch of his back like an apology. The next try, he goes slower. Stiles feels the weight shift on the bed as Derek improves his position, and then Derek's fat cock lines up <i>just right</i>. </p>\n<p>Stiles mouth drops open on a silent scream as the head slips in, the stretch of it burning in all the best ways. The bed shakes as Derek rocks himself deeper, sliding and filling Stiles up like he's needed since the first taste of those damn cookies. </p>\n<p>His body accepts the intrusion like he was made for it, and Derek’s cock slides inside like a puzzle piece slotting into place. Everything goes still and breathless with anticipation when Derek’s balls finally slap against his, both of them fighting to adjust to the intensity of finally being joined. </p>\n<p>Hot breath dampens his back where Derek's curled around him. \"God, Stiles,\" he says, hissing through the Ss like it's painful to be still, but he's too afraid to move. </p>\n<p>Stiles makes the decision for him, snapping his hips back eagerly and delighting in Derek’s bitten-off cry. </p>\n<p>\"Christ,\" Derek gasps. </p>\n<p>Stiles sets a fast pace, working in jerky little movements until Derek takes control, using his weight and a tight hold on Stiles' hip to slow him down. The long, even thrusts allow Derek to sink deeply, and Stiles doesn’t complain. <i>Can’t</i>. Not when he's already seeing stars.</p>\n<p>He floats, weightless, as Derek drags his cock in and out, punching gasps and cries from his throat with each thrust. Stiles’ heat is rising to a fever pitch, and he squeezes his eyes shut; he’s only dimly aware of the sheets shredding, of his headboard cracking, as Derek makes broken noises above him. The rush of pleasure from the mating is reaches it’s climax, and Derek’s thrusts have become shallow and almost brutal. </p>\n<p>\"Fuck. That's... \" Stiles gasps, his ass clenching around the unmistakable thickening of Derek's cock. \"Oh my God.\"</p>\n<p>Derek's teeth catch on his shoulder. \"Keep still,\" he says, the low rumble of alpha command in his voice. </p>\n<p>Stiles breathes, finding it simple to let his body go limp despite the building pressure at his rim. </p>\n<p>\"That's good,\" Derek praises, kissing the words into Stiles' skin. \"You're doing so well. You feel so perfect, Stiles.\"</p>\n<p>The words are a balm, washing over Stiles until contentment fills him. They're mated, and Stiles <i>feels it</i>. He feels it in the way Derek's teeth mark his shoulder, the way he's being held like he's precious, the way he’s filled, locked together in the most vulnerable and intimate way two people can be.</p>\n<p>Tears sting his eyes, and it might be too much, except Derek's hand wraps around his cock, just the right distraction. The pleasure of it eases some of the discomfort Stiles feels from the knot stretching him so wide and open, and he finally finds the courage to arch his back, testing the limits of the tie. He can’t help but feel giddy with power as Derek hisses in response, his hold of Stiles’ hip going bruisingly tight. </p>\n<p>Karma’s a bitch though, and the movement presses the knot firmly against his prostate and Stiles chokes out his own cry of pleasure. And then he’s done, his orgasm ripping from him, everything finally too much. He shatters. Come paints the sheets below him, covers the hand that Derek is using to coax the last spurts from his cock. </p>\n<p>A few minutes later, when Stiles can finally manage to get actual words out, he croaks, \"I think you broke my dick.\" </p>\n<p>\"I think that's my line.\" Derek huffs and carefully maneuvers them to lie side by side, until his knot goes down. </p>\n<p>Stiles lazily slaps Derek’s bicep, and then he laughs. “That's what you get for not knocking on exam room doors.”</p>\n<p>“I don’t mind.” Derek lays his head against Stiles’ shoulder and grins. “I really don’t mind.”</p>"
}