{
  "id": "27111868",
  "url": "https://archiveofourown.org/works/27111868?view_full_work=true",
  "author": [
    "favspacetwink",
    "moonlumie"
  ],
  "title": "laid bare",
  "rating": "Explicit",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Haikyuu!!"
  ],
  "relationships": [
    "Miya Atsumu/Sakusa Kiyoomi"
  ],
  "characters": [
    "Miya Atsumu",
    "Sakusa Kiyoomi",
    "Miya Osamu",
    "Suna Rintarou",
    "Komori Motoya"
  ],
  "additional_tags": [
    "BDSM",
    "Orgasm Delay/Denial",
    "Breathplay",
    "Sounding",
    "Bondage",
    "Edgeplay",
    "Masochism",
    "Butt Plugs"
  ],
  "language": "English",
  "series": "Part 5 of Terminal Curiosity",
  "published": "2020-10-19",
  "completed": null,
  "words": "11,683",
  "chapters": "1/1",
  "comments": "429",
  "kudos": "13,644",
  "bookmarks": "686",
  "hits": "313,203",
  "summary": "<p>“Mmm,” Sakusa hums, then straightens up. “Oh, there was one thing I forgot to set out.”</p>\n<p>Atsumu clutches his towel as Sakusa walks over to his dresser and crouches down to find something in the bottom drawer. When he turns around, he’s clutching a large plug. Atsumu thinks about trying to make it an hour with that inside him and feels the color drain from his face.</p>\n<p>“Omi, that’s <em>mean.”</em></p>\n<p>Sakusa laughs quietly. “You like me mean.”</p>",
  "notes": "<p>hope you guys enjoy this installment :)</p>\n<p>ps there’s technically no safe way to do breathplay so we removed the safe sane and consensual tag to be, well, safe</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>;D</p>\n<p>let us know what you thought in the comments below! thanks for reading!</p>",
  "text": "<p>Miya Atsumu is not a quitter.</p>\n<p>He’s <em> not. </em></p>\n<p>Even so, his eyes widen as Sakusa opens up the black leather case. He doesn’t want to back out now—he’s already all bound up, strapped into an elaborate leather harness that pulls his knees up to his chest, thighs buckled to his sides, hands cuffed to the back of his neck and body completely exposed for whatever Sakusa wants to do to him—but Atsumu has to admit that he’s kind of thinking about it when he sees the metal rods.</p>\n<p>The metal rods that Sakusa’s about to put in his <em> dick.  </em></p>\n<p>“Anyone ever tell ya yer a sadist, Omi-kun?”</p>\n<p>Sakusa snorts, eyes raking over Atsumu’s bound form. “Once or twice. Lucky for you, huh?”</p>\n<p>Atsumu blushes to the roots of his hair when Sakusa’s eyes linger on his cock, stiff with excitement even as thrills of fear race through him. He really must be fucked in the head.</p>\n<p> </p>\n<p>“O-oh—oh god, <em> Omi, </em> I—fuck—I <em> can’t—” </em></p>\n<p>“Sure you can,” Sakusa says, pushing the sound deeper. </p>\n<p>Atsumu can only watch in horrified fascination as it disappears inside him, excess lube squeezing out and collecting around his slit. The smooth tip of the sound feels so foreign in such an unfamiliar part of him that it’s actually a little painful, pinpoint discomfort moving slowly up and down <em> inside </em> his cock. It adds an extra layer of helplessness Atsumu has never experienced before.</p>\n<p>It’s <em> mortifying </em> how much he likes it.</p>\n<p>Atsumu moans in shock when Sakusa holds his cock upright with one gloved hand and lets go of the sound with the other, both of them watching as gravity pulls the slim metal rod down, <em> down </em> , touching Atsumu in places he didn’t know he <em> could </em>be touched. It only stops once the bulbous cap at the end of the sound settles snugly against him. Atsumu’s mouth drops open and he watches in disbelief when Sakusa squeezes him and gives him a few slick strokes with his dick stuffed full.</p>\n<p>“See, you took the whole thing,” Sakusa murmurs, dispassionate eyes flitting up to Atsumu’s face for just a moment before focusing back on his cock. “Just swallowed it all up.”</p>\n<p>“<em>Uuhngh,” </em>Atsumu groans, toes curling as the uncomfortable feeling morphs into confusing pleasure.</p>\n<p>He throws his head back—as much as the harness allows him to—and cries out hoarsely when Sakusa begins gradually pulling the sound out. Atsumu’s hips twitch and buck, chest heaving as he grapples with a sensation close to <em> coming, </em>syrupy-slow but frustratingly unsatisfying. </p>\n<p>“Stay still,” Sakusa tells him. “You can do that for me, right, Atsumu?”</p>\n<p>Atsumu’s not sure. He wants to, but his body’s not exactly obeying his brain right now. He shivers and nods, trying his hardest not to move as Sakusa gently sinks the sound back inside.</p>\n<p>“Mm, good boy.”</p>\n<p><em> Fuck. </em>Goosebumps break out on Atsumu’s skin and he bites his lip, letting the praise wash over him as Sakusa gives his cock a couple more strokes. Flames are stirring in his gut and it’s taking everything he has to keep his hips still. When Atsumu can’t look away any longer, he glances down to see Sakusa’s intense gaze trained on his face; after Atsumu blinks, Sakusa’s back to concentrating on his dick, and he wonders if he imagined it.</p>\n<p>God, he hopes he didn’t. Atsumu loves having Sakusa’s eyes on him. He wonders if Sakusa’s going to jerk off on him again; his dick honest-to-god twitches in Sakusa’s hand just thinking about it.</p>\n<p>Then all his thoughts fly out of his head when Sakusa starts fucking him with the sound.</p>\n<p>“Fuckfuckfuck,” Atsumu slurs, eyes wide as he just about hyperventilates watching it. Sakusa isn’t moving it fast or hard, it just—the way it <em>feels—</em> <em>“Shit, </em>I—<em>Omi—”</em></p>\n<p>Sakusa makes a low noise. “Yeah? You like it?”</p>\n<p>Atsumu’s face flushes hot and he shakes his head, too embarrassed to admit it.</p>\n<p>Sakusa laughs. “You and I both know that wasn’t really a question.”</p>\n<p>He presses his thumb to the underside of Atsumu’s dick, and on the next drag out Atsumu <em> screams </em>at what the added pressure does to the movement of the sound. The sensation isn’t ambiguous anymore, it’s definitely pain, and Atsumu—Atsumu wants more of it—</p>\n<p>He whimpers when Sakusa lets up on the pressure before pushing the sound back inside. It slides in deep again, all the way to the hilt; Sakusa places a finger on the tip of the sound to keep it in place, then starts to rock it gently back and forth.</p>\n<p>Atsumu’s eyes bulge and he makes a noise he’s never made before. The sound’s touching him so deep it feels like it’s rubbing his prostate. He chokes on his own breath and tugs on his restraints, only managing to dig the cuffs into his wrists and thighs as he squirms at the deep pressure. No matter how he tries to move, he can’t get away from it.</p>\n<p>He’s never felt anything like this before and it’s starting to scare him.</p>\n<p>“I thought I told you to stay still,” Sakusa says.</p>\n<p>Atsumu groans, fire and adrenaline dancing through his veins. He feels like he did during their very first scene together, like he’s not going to make it through this, like it’s all he can do to stay conscious. Every time Sakusa moves the sound it makes Atsumu’s gut twist up like he’s about to come; he can’t even tell if he’s actually close or if his body’s just confused.</p>\n<p>“Fuu<em>uuck </em>, Omi, I—”</p>\n<p>He howls when Sakusa draws the sound all the way out, thighs quivering from the addicting discomfort. Atsumu’s dick feels a little sore inside, probably from the way the sound was rubbing his urethra, but he’s able to unclench his jaw now that it’s out. He feels like he can breathe again. <em> Fuck, </em>that was intense. </p>\n<p>Sakusa stares at him with heated eyes as he sets the metal rod down on a clean washcloth, then wraps both gloved hands around Atsumu’s dick, stroking him up and down and gathering up the excess lube from the tip. Atsumu moans as Sakusa works him, shoulders cramping as he tugs at his wrist cuffs. He thinks about how it felt to have Sakusa’s hand around him with the sound inside and his head spins with horror as he realizes that he misses it. </p>\n<p>\n<em> Shlick, shlick, shlick. </em>\n</p>\n<p>“Oh god—ungh, <em> haah </em>—”</p>\n<p>He doesn’t—his lungs are freezing up—now that he knows what it feels like he wonders if he’ll ever be able to forget—</p>\n<p>“Good,” Sakusa murmurs, swiping his thumb over the leaking head of Atsumu’s cock. “You’re doing so well, Atsumu.”</p>\n<p>He takes both hands away and strips off his gloves as Atsumu watches with foggy confusion. </p>\n<p>“Omi?”</p>\n<p>“Shh, it’s okay. I’m not going anywhere.” Sakusa pulls on a fresh pair of gloves and opens a new little packet of lube. “And neither are you. I think you can take more.”</p>\n<p>He picks up a new sound from the black leather case.</p>\n<p>A bigger one.</p>\n<p>Atsumu’s eyes go wide and panic seizes him as Sakusa dips the tip of the sound in the lube. It’s thicker than the last one; it makes his stomach drop looking at it, and he’s not sure if it’s in a good way. Dread starts to overpower his excitement and curiosity—he can’t get away—</p>\n<p>“No, I can’t, I—<em>I—” </em></p>\n<p>Sakusa laughs, the sound echoing inside Atsumu’s head as he brings the metal rod toward his dick, stiff and vulnerable. </p>\n<p>“You always say that, but then you always—”</p>\n<p>\n<em> “Yellow.” </em>\n</p>\n<p>The word falls from Atsumu’s lips before he’s even aware he made the decision. Sakusa sits back on his heels immediately, setting the sound down and stripping off his gloves. </p>\n<p>The sight makes Atsumu realize exactly what he just said.</p>\n<p>Part of him wants to take it back even as the rest of him sags in relief. He’s been so fixated on being <em> good, </em>on showing Sakusa he can take it, that he never considered how it would feel if he actually wanted to back out or slow down. </p>\n<p>“Talk to me, Atsumu. What do you need?”</p>\n<p>Sakusa’s voice is calm but firm, almost… kind. Atsumu settles imperceptibly inside his own head.</p>\n<p>“I, um. I just...” he swallows, glancing toward where he knows the thicker sound is waiting on the cloth. Among all the confusing sensations and prickling pain, he actually did enjoy the first one, but... “I need a minute…”</p>\n<p>“That’s perfectly okay. Do you want to stop?” Sakusa asks. Atsumu’s throat tightens. “It’s alright if you do. You won’t disappoint me at all if you want to say red. I have plenty of other things I’d like to do if this isn’t getting you where I want you to be...”</p>\n<p>Sakusa is clearly giving him an out, but Atsumu appreciates that he seems to be maintaining at least a thread of the scene. It soothes the spike of anxiety, the shadow of failure that tried to rise up in Atsumu’s chest as soon as he pressed pause. This is why they use stoplights, just like Sakusa taught him; Atsumu can stop this if he wants to, but he doesn’t <em> have to, </em> even if he needs a minute.</p>\n<p>“Atsumu? I need you to answer me,” Sakusa prompts when Atsumu takes a second to respond. “Do you want to stop?”</p>\n<p>Atsumu shakes his head. It’s the truth, once he gives himself a second to really think about it.</p>\n<p>“Okay,” Sakusa says again. He reaches for a glass of water perched on the bedside table. “Here, take a sip.”</p>\n<p>The way Atsumu is bound restricts him from leaning up very much, but water sounds like a very good idea right now. He only struggles to crane his neck toward the glass for a second before Sakusa’s sliding a hand under his shoulders and helping him sit semi-upright as he brings the glass to his lips. </p>\n<p>Atsumu takes one sip, then another. His mouth is dry and the water feels good on his tongue.</p>\n<p>“Don’t drink too much too fast,” Sakusa says.</p>\n<p>Atsumu hums in agreement and pulls away after a few more sips, relaxing his abs and letting Sakusa lower him the rest of the way down. Sakusa’s hand lingers for a fraction of a moment in Atsumu’s hair as he draws it away before he leans back on his heels, setting the glass of water back on the nightstand.</p>\n<p>“Better?”</p>\n<p>“Mhmm,” Atsumu sighs, relaxing into the bed. He doesn’t expect the feeling of <em> safety </em> that washes over him now that he’s had a minute to calm down.</p>\n<p>He also doesn’t expect the way Sakusa leans back in and cups the side of his face, dark eyes intense as his thumb strokes over Atsumu’s cheek. Atsumu barely suppresses a squeak, belly swooping as Sakusa squints at him. </p>\n<p>“Atsumu.”</p>\n<p>“Y-yeah?”</p>\n<p>“I’m never going to do anything you don’t want,” Sakusa murmurs. </p>\n<p>On the surface, it seems like an obvious statement. Atsumu sure <em> hopes </em>Sakusa would never do anything Atsumu didn’t want. That should go without saying. </p>\n<p>Then he thinks about it a little more and feels his face heat. Sakusa’s done some pretty fucked-up stuff to him the past couple months, and Atsumu…</p>\n<p>\n<em> Atsumu has wanted every second of it. </em>\n</p>\n<p>The embarrassment just makes him harder. He turns his face into his bicep and breathes in, out, in, out. He <em> wanted </em> to be edged until he was a shaking, babbling mess. He <em> wanted </em> to be hit with a riding crop until he forgot his own name. He <em> wanted </em>to be blindfolded and have burning hot wax poured all over him while he screamed into a gag.</p>\n<p>And now, he wants… he wants Sakusa to use the bigger sound and play with his dick inside and out until he’s begging to come.</p>\n<p>“Omi.”</p>\n<p>“Mmm?”</p>\n<p>Atsumu swallows, glancing at Sakusa out of the corner of his eye. “Keep goin’.”</p>\n<p>“Are you sure?” Sakusa asks, with one raised brow. </p>\n<p>Atsumu nods.</p>\n<p>Sakusa squints at him again, but this time Atsumu’s pretty sure it’s a smile. “Okay. I take it you’re feeling better?”</p>\n<p>Atsumu nods, watching as Sakusa grabs a fresh pair of gloves and pulls them on while he shifts back into position between Atsumu’s thighs. He remembers a time when having Sakusa between his spread legs like this embarrassed him; now it just feels natural.</p>\n<p>Sakusa picks up the bigger sound, the one he was about to use before Atsumu needed to press pause. “Do you know what this means?”</p>\n<p>“What?”</p>\n<p>“From now on, every time you say ‘green,’ I know I can trust you. That means I can go even further, Atsumu.”</p>\n<p>He squeezes lube onto the thicker rod like he didn’t just send butterflies reeling in Atsumu’s stomach. He was honestly a little worried that Sakusa would be annoyed with him for interrupting the scene, but it sounds like Sakusa is <em> pleased. </em></p>\n<p>Atsumu gasps when Sakusa takes hold of him again, grasping the tip of his cock with one gloved hand and holding it upright as he positions the thicker sound right over the slit.</p>\n<p>“Color?”</p>\n<p>Atsumu sucks in a breath, thinking about what Sakusa just told him. Not only does he want this, he’s <em> leaking </em>for it. His blush, already burning his face, starts to spread down his chest, to the point where Atsumu himself can see it. </p>\n<p>\n<em> “Green.” </em>\n</p>\n<p>“Good boy.” </p>\n<p>Sakusa starts to guide the sound inside and Atsumu wails.</p>\n<p> </p>\n<p>Onigiri Miya is lively for a restaurant with a closed sign in the window. There aren’t even that many people inside, but a half dozen tipsy professional athletes and their former athlete friends take up a lot of space. </p>\n<p>“Atsumu, are you really still pouting?” </p>\n<p>“I’m not poutin’!”</p>\n<p>Atsumu is pouting, just a little, where he stands behind the counter with Osamu, making rice ball after rice ball. There’s never more than three on the bar at a time before they’re grabbed and gobbled up by the pack of monster generation volleyball players from EJP Raijin and the MSBY Black Jackals. Atsumu thinks he’s probably made fifty by now, but keeps his mouth shut knowing the hell Osamu would give him for remarking on such a small number from his perspective. </p>\n<p>“You lost <em> one game</em>,” Suna says, sitting across the bar from the twins. “The Jackals have been leapfrogging the Adlers all year for first place in the league and you’re still whining?”</p>\n<p>Suna doesn’t get it; the dogfight for first is the <em> point. </em> Atsumu grinds his teeth as he resists checking the Adlers score online again. They were up on the Green Rockets last time he checked and, if they win their game tonight, they’ll take first place again. Sure, nobody expected any team to challenge the Adlers during the off season, especially after Romero signed with them. A lot of folks thought that pretty much locked them in, not just as first in the league, but also expected them to basically waltz through the Emperor's Cup. </p>\n<p>Then the Jackals added Sakusa to their already solid, young roster, which analysts thought made the Jackals likely to challenge for top three—and then they debuted Hinata Shoyo and started shattering expectations. A wry smile crosses Atsumu’s face as he spies the orange-haired dark horse sitting at a table in the corner with Inunaki and Raijin’s back-up libero, just behind a table that holds Bokuto, Washio, and Akaashi, who came down for the weekend for the game. </p>\n<p>“<em> Anyway </em>,” Osamu interrupts before Atsumu can defend himself. “Are ya still seein’ Fuyuki-chan?”</p>\n<p>“Why are you even askin’? His story had like twelve pictures of her just yesterday,” Atsumu says and then winces as he reaches into a new bowl of rice that’s still a bit too hot for his unweathered fingers. </p>\n<p>“It’s true. You do post way too many photos on instagram of you two,” Osamu backs him up, nodding in acknowledgement as Raijin’s Komori grabs a pair of beers from the flat at the counter and then heads back to his and Sakusa’s table. </p>\n<p>“I didn’t see you complaining when I posted pictures of your rice balls,” Suna narrows his eyes, “She’s a model. She has to make sure she has a lot of visibility and stuff.”</p>\n<p>“<em>Model</em>,” Atsumu teases.</p>\n<p>“<em>Influencer</em>,” Osamu continues. “Anyway, how are things goin’ with your <em> model </em> girlfriend?”</p>\n<p>Suna crosses his arms over his chest.</p>\n<p>“You know this is why I don’t miss you guys that much,” he says and the twins snicker. “It’s going <em> fine. </em>Anyway, enough about my dating life since apparently you already know eveyrthing. What about you two?”</p>\n<p>Osamu shrugs, “Haven’t really been seein’ anyone. It’s been so busy with the restaurant and tryin’ to open a location in Tokyo.”</p>\n<p>“I haven’t been datin' either,” Atsumu says, technically not lying, and then glares back at Osamu who is side-eying him for a shoddy nori wrap.</p>\n<p><em> If ya want me to keep helping, ya better keep yer mouth shut </em> , he says with his eyes, and Osamu rolls his own as if to say a simple <em> whatever </em> as he pulls the plate of fresh onigiri towards him and takes over wrapping duties. </p>\n<p>“Bullshit,” Suna says, not privy to the silent twin conversation; Atsumu looks back at him. “You’re always dating.”</p>\n<p>“What? I’ve been busy, too!” Atsumu says. </p>\n<p>Suddenly, two sets of eyes are turned on him, dripping with suspicion. Atsumu’s shoulders come up, preemptively defensive because now Osamu’s attention is captured as well. This doesn’t bode well. </p>\n<p>“Being busy has literally never stopped ya once in your life from at least… talkin’ to someone,” Osamu says with narrowing eyes. </p>\n<p>Damn Suna for drawing attention to this. They’d been functioning fine under the don’t ask don’t tell that Osamu’s been begging for since Atsumu first got caught behind the gymnasium kissing a classmate after middle school graduation. But now Osamu smells a rat and Suna knows it, too.</p>\n<p>“Yeah, Atsumu. Why haven’t you been dating?”</p>\n<p>Atsumu opens his mouth, suddenly feeling like he’s trapped behind enemy lines. Osamu doesn’t even let Atsumu answer. His gaze is now somewhere between confused and intrigued. </p>\n<p>“Nah, that’s not it. He hasn’t <em> not </em> been datin’. He’d pro’bly talk about that <em> more </em> than he constantly talks about dating. He hasn’t said anythin’ all season,” Osamu says, verbally processing.</p>\n<p>“That’s a good point,” Suna muses, egging Osamu on, the bastard.</p>\n<p>“So he’s lyin’, which means it’s someone he doesn’t want people ta know about,” Osamu continues, curiosity mounting in his tone, and for some reason Atsumu is stunned stupid. He should have prepared for this. “But he has almost no shame, so it’d have to be pretty crazy, even for him.”</p>\n<p>“So what’s crazy for Atsumu?” Suna asks, looking like the cat that got the cream. </p>\n<p>Atsumu scoffs, finally mobilizing. Just brush it off. He turns back to the bowl of rice and starts putting a scoop of filling into a new shell of an onigiri. </p>\n<p>“I ain’t gonna sit here and listen to yer <em> slander </em>,” Atsumu bluffs. He pushes on, ignoring that they clearly aren’t taking the bait yet. He begins to press the rice into a less than perfect triangle. </p>\n<p>“Oh shit<em>,</em>” Osamu says and then looks over at Suna. “He’s datin’ a teammate.”</p>\n<p>Suna’s eyes go wide and Atsumu sputters, barely holding back the panic that would fully expose him. Instead he hisses, “Listen, Sherlock, I’m not <em> datin’ </em>nobody!”</p>\n<p>Osamu raises a brow, “So you’re just <em> seein’ </em> a teammate.”</p>\n<p>Shit, Atsumu fucked up. Wrong element to focus on. Oh well, deny until you die.</p>\n<p>“Don’t be stupid,” Atsumu grouses, but it’s weak enough that Osamu isn’t convinced for even a second—he knows. </p>\n<p><em> “Me </em> don’t be stupid? Yer the stupid one,” Osamu says and then an expression of pure judgment clouds his face. “Uhg, please tell me you’re not bangin’ yer captain.”</p>\n<p>“Like I said, I’m not bangin’ no one!” Atsumu says, stomping off to get a new bowl of rice from the cookers in the back.</p>\n<p>It’s technically true… by some specific standards, on paper. </p>\n<p>“Wait, Atsumu, don’t go. I want to know who it is!”</p>\n<p>“As long as it’s not his captain and he’s not gonna get his contract terminated I don’t care,” Osamu says resolutely. </p>\n<p>“Uhg, <em> fine, </em>” Suna whines.</p>\n<p>“Don’t worry, you’ll get the gossip when it inevitably blows up in his face,” Osamu says.</p>\n<p>Atsumu hates them.</p>\n<p> </p>\n<p>“So how’s Obasan?” Motoya asks as he drains the last of his beer and then bites into the last rice ball on their table.</p>\n<p>“She’s fine, last I heard,” Kiyoomi says. “I haven’t heard much from her since she moved. Mostly just public health articles.” </p>\n<p>Motoya hums, “Well, you’ll get to see everyone at the New Years Eve party.”</p>\n<p>“Joy,” Kiyoomi deadpans. </p>\n<p>Motoya snickers and then stands up. “Hold on, gonna grab another beer. You want one?” </p>\n<p>Sakusa shrugs; he’s only had one so far. He pulls an alcohol wipe out of his bag as Motoya wanders over to the counter. </p>\n<p>Motoya is chuckling when he comes back.</p>\n<p>“What?” Sakusa asks as he takes the can from Motoya and begins to meticulously wipe the aluminum down with the alcohol wipe. </p>\n<p>“Oh nothing, they’re just chirping Suna for his insta model girlfriend,” Motoya says, plopping down in his seat again. “Speaking of, something seems different about you. Plus, two whole beers? Are you seeing someone?”</p>\n<p>Kiyoomi freezes, fingers still on the tab of his sanitized can, for only a fraction of a second.</p>\n<p>“You’re mistaken,” Kiyoomi says. “You know how I feel about dating.”</p>\n<p>“Look, now that Kinsuke-niisan and Masumi-neesan are married, don’t you think your parents have probably laid off the pedigreed matchmaking?” Motoya says. </p>\n<p>There are few people who understand the stupid intricacies of Kiyoomi’s family dynamics, though Motoya is the closest considering his father is Kiyoomi’s mother’s brother. But even though the Komori family runs in the same affluent circles, Kiyoomi’s family is much more entrenched in bullshit traditions. </p>\n<p>“Even if they did, I still have my own reasons. I don’t understand how you all are comfortable putting in so much effort with other people when your next contract could take you to a team in Europe or South America,” Kiyoomi muses, watching the people walking down the sidewalk outside. “I just don’t see the point right now.” </p>\n<p>“I don’t know, Kiyoomi-kun. Love? Companionship? Sex?” Motoya teases.</p>\n<p>Kiyoomi just rolls his eyes. </p>\n<p>He’s found many more efficient and enjoyable ways to fulfil his base human needs without coordinating long distance relationships or trying to move a partner across the country or globe. Who needs love when you can make grown men cry and then thank you for it? He casts a quick glance towards Atsumu and can’t help the sly smile that touches his lips. </p>\n<p>“I’m going to grab some more rice balls,” Kiyoomi says, sliding on his mask instead of acquiescing to answer a question to which Motoya already knows the answer. </p>\n<p>Kiyoomi heads towards the counter but is beaten there by Bokuto, who scoops up the five onigiri currently available. Oblivious, he bounces back towards his table to place three on Akaashi’s plate, at least deigning to give Washio one. He smacks a kiss on the top of Akaashi’s head as he goes to sit down, then realizes he accidentally got some rice in Akaashi’s hair and goes to pick it out. </p>\n<p>Kiyoomi makes a mildly disgusted face. He’s distracted by a laugh from Atsumu, who definitely caught the whole scene, including his reaction. </p>\n<p>“Sorry, Omi-Omi. <em> Keiji is hungry~, </em>” he imitates their ever-passionate teammate. “Jus’ hold on a second and I’ll make ya some.” </p>\n<p>Atsumu is now alone behind the counter. Kiyoomi can hear Suna and Osamu chatting about the kitchen set-up in the back. He leans forward on his elbows a little.</p>\n<p>“You washed your hands, right?” Kiyoomi wants to hear verbal confirmation.</p>\n<p>“Yes, m’not an animal, Omi-kun,” he says, flicking a piece of rice at him. </p>\n<p>Kiyoomi shrugs unapologetically, a little at a loss for what to do just standing at the counter watching Atsumu form onigiri. He’s better at it than Kiyoomi expected. He supposes Osamu’s interest didn’t come out of nowhere; Atsumu did mention that they did a lot of their own cooking as kids. </p>\n<p>“Are you free on Friday after morning practice?” Kiyoomi finds himself asking, to fill the silence.</p>\n<p>Atsumu’s shoulders twitch. He quickly looks over his shoulder before tilting his head back to think, hands still working rice into a rounded triangle. </p>\n<p>“Got a couple errands to run but I could come to yers after, prob’ly by mid-afternoon?”</p>\n<p>Kiyoomi nods in affirmation, suppressing any smirk in response to the blush dusting Atsumu’s cheeks, betraying his indifference.</p>\n<p>They’re quiet for another few seconds as Atsumu plates a trio of onigiri and sets them up on the bar for Kiyoomi, who takes them with a muffled thank you.</p>\n<p>“No problem. See ya Friday, then,” Atsumu says, giving Kiyoomi an exaggerated wink and a sleazy smile.</p>\n<p>Kiyoomi blinks. “We have practice tomorrow morning. Idiot.”</p>\n<p>Atsumu curses and Kiyoomi ignores him, heading back toward Motoya and taking his seat at the table. His cousin is scrolling through his phone now. </p>\n<p>“Listen, Kiyoomi-kun. I know this guy who just moved to Osaka. He designs athletic apparel and happens to be hot as hell,” Motoya says, showing Kiyoomi a picture of a conventionally attractive man with dyed blue hair. “Are you <em> sure </em> you don’t want me to give him your number?”</p>\n<p>\n<em> Would he try to cry my name through a gag as I push a frozen plug up his ass? Would he whine prettily and submit to having a metal rod shoved in his urethra while bound into the rough shape of a pretzel? </em>\n</p>\n<p>Kiyoomi doubts it. He pulls his mask down and takes a bite out of one of his newly acquired rice balls. His brow furrows at the taste and he looks down in confusion. Nestled into the center of the clean, white rice, previously hidden by the nori wrap, there are at least three umeboshi, instead of the usual single pickled plum. </p>\n<p>Against his will, Kiyoomi’s head turns towards the counter. Suna and Osamu have returned to the counter and Atsumu seems to be squabbling with them. He doesn’t see the way Kiyoomi stares, just for a second. Does Atsumu know that Kiyoomi has a particular preference for umeboshi, and that’s why he…? </p>\n<p>No, it has to be a coincidence. </p>\n<p>“Kiyoomi-kun?”</p>\n<p>He whips his head back around, trying to track back to Motoya’s question. Right, he asked if he could give Kiyoomi’s phone number out to some fashion designer. Kiyoomi’s nose wrinkles.</p>\n<p>“No. Really, no thank you.”</p>\n<p>He takes another bite of rice and umeboshi. </p>\n<p> </p>\n<p>Atsumu rushes through his errands after practice and weights. By mid-afternoon he’s swinging through the store to grab some pre-packaged curries for dinner and heading to Sakusa’s. </p>\n<p>To: <b>Omi-Omi </b><br>\n&gt;&gt; Omw</p>\n<p>From: <b>Omi-Omi</b> <b><br>\n</b>&gt;&gt; I’ll leave the front door unlocked </p>\n<p>It’s oddly casual at this point, parking in the visitor spot, plugging in the front door code, and riding the elevator up the floors of Sakusa’s fancy apartment building. He pushes open the door without knocking and announces himself as he takes his shoes off and lines them up by the wall. </p>\n<p>Atsumu comes around the corner to find Sakusa on his laptop at the dining room table with few pieces of mail stacked up off to the side. He’s wearing a pair of narrow reading glasses and Atsumu has to literally bite his tongue not to make a hot teacher joke. He wouldn’t hold back if they’d already played today, but he’s not willing to risk getting kicked out before the good stuff.</p>\n<p>“I grabbed some stuff for dinner later if you didn’t have something planned,” Atsumu says, holding up the grocery bag. </p>\n<p>Sakusa glances up, and once again Atsumu swallows down a ‘<em>I wanted to talk to you about my grades, Sakusa-sensei.’   </em></p>\n<p>“Thanks. You can put it on the top shelf of the refrigerator,” Sakusa says. “Do you want a cup of tea or anything before you shower?”</p>\n<p>“Actually, yeah,” Atsumu says as he heads to the kitchen to put the curries away. “I had to rush around to a couple of different places and traffic sucked. Tea sounds relaxing.”</p>\n<p>It’s strange that Atsumu doesn’t exactly feel embarrassed to be talking about needing a minute and a cup of tea to get mentally prepared for Sakusa to torture him in some way or another. This is all pretty routine by now. Atsumu has the prior knowledge that, even though he’s excited, rushing into a scene now will make it harder than usual to get out of his own head. He knows it’ll be better if he takes a minute to wind down. </p>\n<p>Sakusa gets up and makes tea as Atsumu heads back into the dining room and takes a seat. He flips open his phone to instagram and only jumps a little when Sakusa sets a mug down on the table. Atsumu drinks his tea, makes shady comments on all his friends’ photos, and Sakusa finishes up paying bills or whatever he’s doing on his laptop. By the time the cup is drained, Atsumu’s head feels quieter and the thrum of nervous energy has risen under his skin. </p>\n<p>He takes a deep breath and stands up, “Ok, I’m going to go hop in the shower.” </p>\n<p>Sakusa takes his glasses off and Atsumu fights the urge to boo.</p>\n<p>“Alright. Meet me in the bedroom when you’re finished,” Sakusa says. </p>\n<p>Atsumu gives him a two finger salute and heads off to get cleaned up. </p>\n<p>When he’s finished, Atsumu heads down the hall to Sakusa’s room. An uncomfortable wave of apprehension rolls over Atsumu when he walks through the doorway and doesn’t find any new and exciting toys waiting for him. In fact, nothing is set up at all; Atsumu spends a split-second wondering if Sakusa has gotten tired of him before he spots the bottle of lube and box of gloves sitting on the bedside table and something in his chest unclenches.</p>\n<p>The door to the bathroom opens before Atsumu can think any more of it. Sakusa’s wearing a white button-down today with his usual black slacks, rolling up his sleeves as he exits in a cloud of steam and the scent of his body wash fills the bedroom.</p>\n<p>“You look surprised,” is the first thing Sakusa says to him.</p>\n<p>Atsumu’s cheeks heat. “Just wonderin’ if yer goin’ for secrecy again.” He gestures to the empty bed. </p>\n<p>Sakusa squints at him. Atsumu likes to think that he’s become somewhat of an expert on Sakusa’s expressions considering half of his face is hidden behind a mask almost all the time. This particular brand of squinting usually goes along with a smirk.</p>\n<p>“Why, because I haven’t set anything out?”</p>\n<p>Atsumu nods.</p>\n<p>Sakusa chuckles and walks over to the bed. “I’m not tying you up tonight, Atsumu.”</p>\n<p>“Wh-what?”</p>\n<p>“We’ve been doing this for several months now,” Sakusa says, taking a pair of black gloves from the box. He turns to look at Atsumu and raises an eyebrow. “I trust you to hold yourself still for me.”</p>\n<p>Atsumu’s mouth runs dry. “There’s no way I’ll be able t—”</p>\n<p>“Remember the first time I edged you?” Sakusa interrupts him. Atsumu nods. “You could barely go for twenty minutes.”</p>\n<p>“Excuse <em> me, </em>Omi-kun, I c’n last a lot longer than that now,” Atsumu snaps, with all the elegance of a man slamming his foot into a bear trap.</p>\n<p>It’s true, though, even if that wasn’t the smartest thing to say aloud. Edging is one of the most common ways they play, and Atsumu’s been able to hold out longer and longer as he’s gotten more used to it. The orgasms have become stronger too, so much so that whenever Atsumu finally does come he always wishes he’d been able to wait even more. Last time they did it he was able to last for 45 minutes and he nearly blacked out when he came.</p>\n<p>“I know you can. And you certainly don’t need six-point restraints now, either,” Sakusa says. “I think you’re ready to try for an hour.”</p>\n<p>“An <em> hour?” </em> Atsumu’s voice does <em> not </em>crack. </p>\n<p>Sakusa pulls his second glove on with a <em> snap </em>of stretchy nitrile. “What, you don’t think you can do it?”</p>\n<p>Atsumu glares at him. Sometimes he forgets how much of an asshole Sakusa is. “Fuck off, ‘course I can.”</p>\n<p>“Mmm,” Sakusa hums, then straightens up. “Oh, there was <em> one </em>thing I forgot to set out.”</p>\n<p>Atsumu clutches his towel as Sakusa walks over to his dresser and crouches down to find something in the bottom drawer. When he turns around, he’s clutching a large plug. Atsumu thinks about trying to make it an hour with that inside him and feels the color drain from his face.</p>\n<p>“Omi, that’s <em> mean.” </em></p>\n<p>Sakusa laughs quietly. “You like me mean.”</p>\n<p>Fuck. He’s right, but like hell Atsumu’s going to tell him that. He glares at the floor, then jolts when Sakusa hooks a finger under his chin and tips his head up to meet his eyes.</p>\n<p>“Go and bend over the bed, Atsumu,” he murmurs. “I’ll start the clock now, since I know you can come just from getting fingered.”</p>\n<p>Atsumu’s eyes widen and he wrenches his gaze away from Sakusa’s, color returning furiously to his cheeks as he trembles with a wretched combination of humiliation and arousal. “Fine.”</p>\n<p>He stalks over to the bed and drops his towel, glancing over his shoulder and shivering when he sees Sakusa watching him intently. It’s even more humiliating to bend over like this but for some horrible reason it makes Atsumu’s dick twitch where it’s filling up against his thigh. He stares at the familiar pattern of Sakusa’s quilt and waits, tension building in his back and shoulders as he braces himself on his elbows.</p>\n<p>Atsumu jumps when he feels Sakusa’s gloved hand slide down his back, thumb rubbing at the divots of his spine. He hears the pump of the lube bottle and tenses even more in anticipation.</p>\n<p>“Relax,” Sakusa whispers.</p>\n<p>How the fuck is Atsumu supposed to do that when he knows what the next hour holds? He tries to do as Sakusa says, though, and spreads his legs a little wider as he exhales slowly.</p>\n<p>The first touch of Sakusa’s slick fingers forces a small noise from his throat. Sakusa shushes him and strokes over his lower back with his dry hand. Atsumu tightens his grip on the quilt, trying desperately to keep the rest of his body relaxed as Sakusa circles his hole slowly, getting him wet.</p>\n<p>Then Sakusa finally slides one finger inside, twisting it on the way out and pushing back in with two. Atsumu groans and widens his stance further, shameless, biting his lip as Sakusa thrusts in and out in a slow rhythm.</p>\n<p>“I wonder if I could edge you for an hour without touching your dick at all,” Sakusa says. Atsumu moans and buries his face in the quilt. “I probably could. Maybe we can try that another time.”</p>\n<p>“<em> No </em>…” Atsumu whines, cock jumping traitorously at the thought.</p>\n<p>Sakusa’s free hand leaves his back to come cracking down on his ass, hard. Atsumu jumps, clenching down on Sakusa’s fingers and barely suppressing a yelp. It had been taking Atsumu a second to slip into his usual headspace without the ritual act of being restrained, but the sudden sting on his skin sure gets him there in a hurry. </p>\n<p>“Are you telling me what to do?”</p>\n<p>Atsumu shakes his head furiously, heart racing as pain throbs underneath his skin. <em> Fuck. </em></p>\n<p>Sakusa makes an amused sound. “That’s what I thought.”</p>\n<p><em> You like me mean. </em> Atsumu shuts his eyes tight and tries to stay calm, tries to keep his breathing even and slow his heart rate. He <em> hates </em>that Sakusa is right, hates even more that Sakusa knows it, too.</p>\n<p>Sakusa squeezes in a third finger with a little squelching noise, Atsumu’s gut twisting with heat at the slight pain from the stretch. He alternates between spreading and curling his fingers, sending Atsumu up onto his toes at one point when he presses firmly against his prostate.</p>\n<p>“Nnngh,” Atsumu groans, starting to rock back into Sakusa’s thrusts. “Oh <em> god…” </em></p>\n<p><em> Smack! </em>Sakusa’s hand comes down on his ass again. “Don’t move.”</p>\n<p>Atsumu grunts and tries his best to hold still. Part of him wants to disobey just so Sakusa will hit him again. Those wicked fingers are relentless, probing and pressing deep inside as Atsumu’s knees wobble.</p>\n<p>Then Sakusa pulls out and Atsumu can’t quite suppress the noise he makes at the loss.</p>\n<p>Sakusa makes a derisive noise. “You’re about to get an <em> hour </em> of this, Atsumu. Don’t be greedy.”</p>\n<p>Atsumu feels the blunt press of the plug at his entrance before he can reply. He shifts on his feet, cock swaying between his legs as he bites his lip in anticipation. </p>\n<p>“Omi… ungh, <em> fuck-” </em></p>\n<p>“Shh, there you go,” Sakusa murmurs, wiggling the base of the plug where it now sits snug between Atsumu’s cheeks. Atsumu moans as it moves inside him, heavy and thick; he barely bites down a yelp when Sakusa reaches around and swipes his fingers over the head of his cock. “Oh, you’re dripping.”</p>\n<p>Atsumu lets his head drop to the bed, reminding himself at all times to stay motionless even as Sakusa starts up a rhythm, gripping tight as he works Atsumu’s dick in his hand. It’s much harder to stay calm when a portion of Atsumu’s thoughts have to be devoted to keeping still; when he’s tied up, he doesn’t have to think about that at all. It’s not something he has to worry about.</p>\n<p>Now, though, so much of his effort is going toward controlling his body’s <em> movements </em> that there’s a lot less effort to spend on controlling his body’s <em> reactions. </em>Atsumu can’t stop the heat that builds and builds between his legs, burning hotter every time he has to force himself not to hump into Sakusa’s slick grip. The plug makes everything worse, hard and unyielding when he clenches involuntarily around it.</p>\n<p>With Sakusa behind him like this, jerking him off and teasing his prostate with the plug every time he wiggles it with his fingers, Atsumu can almost imagine what it would be like if he… if they…</p>\n<p>Oh <em> god. </em>Fuck, would Atsumu even be able to stay standing? He tightens his grip on the quilt and moans, shaking with the effort of holding still. He glances up at the clock, then realizes he doesn’t know when they started. It has to have been at least ten minutes, if not more.</p>\n<p>“Omi… O-Omi…”</p>\n<p>“Hmm?”</p>\n<p>Atsumu’s mouth drops open and he groans when Sakusa starts to rock the heel of his hand against the plug. “I’m… <em> fuck… </em>how long…”</p>\n<p>“I told you already, Atsumu. I want you to hold it for an hour today.”</p>\n<p><em> “Unnnh, </em>no, I—how long’s’it b’n…” Atsumu’s already starting to slur. He can’t help it. </p>\n<p>Sakusa twists his wrist just right and Atsumu’s eyes roll back. “Oh. It’s been about three minutes, I think. Maybe four.”</p>\n<p>\n<em> “Ohgodfuck—” </em>\n</p>\n<p>“Shh.” Sakusa rubs his thumb right underneath the crown and Atsumu’s hips tremble from how badly he wants to shove them back. “Oh, you are <em> easy </em>today. Are you going to be good and tell me when you’re close?”</p>\n<p>Atsumu is helpless to do anything but nod.</p>\n<p>It can’t be more than another few minutes before Sakusa’s got him perilously close to the edge. Atsumu’s teeth are sunk so hard into his bottom lip he thinks he tastes blood; he briefly contemplates staying quiet and letting Sakusa push him right off that delicious cliff. Whatever punishment Sakusa dreams up afterward will just be a bonus, because Atsumu’s wires are apparently crossed like that.</p>\n<p>But his overwhelming desire to be <em> good, </em>to leave Sakusa impressed enough to shower him with praise, to stay in Sakusa’s thoughts afterward and be the best goddamn sub he’s ever had—</p>\n<p>“Omi,” Atsumu gasps. A warning.</p>\n<p>Sakusa makes a noise of acknowledgement, but the hand on Atsumu’s dick doesn’t stop moving, slipping over him sloppy and wet. Atsumu’s eyes pop open and he grunts, grabbing fistfuls of the quilt as he tries to hold back.</p>\n<p>“Close—<em> pleasem’close—” </em></p>\n<p>Sakusa hums happily and lets go, leaving Atsumu a breath away from orgasm. He keens, nearly tipping over all by himself as his body ripples around the plug, spasming with his denied release. Sakusa rubs over Atsumu’s hip with his clean hand and makes another happy noise as Atsumu’s knees threaten to buckle inwards.</p>\n<p>“Breathe… good.” Atsumu glances up at the clock and moans sadly when he realizes that only seven minutes have passed since they started. “Now get up on the bed when you’re able to move again.”</p>\n<p>He takes a moment to make sure his body’s calmed down before crawling onto the bed, looking over his shoulder when Sakusa doesn’t say anything else only to find himself paralyzed by a dark, heated gaze as Sakusa strips off his gloves.</p>\n<p>“I’m going to sit against the headboard,” Sakusa says, adjusting his rolled-up sleeves as he gets onto the bed. Atsumu sits back on his heels, blushing all the way to the tips of his ears at the way his dick is standing up straight, begging for attention. “You can lean back against me.”</p>\n<p>Atsumu gulps. They’ve sat like this a couple times before—Atsumu’s back against Sakusa’s chest, legs spread—and each time the feeling of Sakusa’s dick pressing against the small of his back has left Atsumu’s head spinning. He gets a brief, bizarre urge to cover himself, followed by an even more bizarre urge to climb into Sakusa’s lap <em> facing him, </em>to lean down and—</p>\n<p>“Come here.” Sakusa’s voice snaps Atsumu out of his daydream.</p>\n<p>He’s—fuck, he’s patting his lap, looking at Atsumu expectantly, oblivious to what’s going on in Atsumu’s head. Atsumu takes a deep breath and makes his way over, turning around and shimmying back against him as he hisses at what that does to the plug inside him.</p>\n<p>“M’not a dog, ya know.”</p>\n<p>“Oh?” Sakusa sounds amused. “But you come when you’re told.”</p>\n<p>Atsumu’s face flames and he feels his heartbeat pulse in his dick. Shit, he walked right into that one. He crosses his arms over his chest, digging his nails into his own skin as Sakusa reaches over to the nightstand and grabs another pair of gloves.</p>\n<p>“I want you to keep your hands at your sides for this,” Sakusa murmurs, pulling on the gloves before reaching back for a few pumps of lube. “It doesn’t matter exactly where, as long as you stay still. Just don’t interfere with what I’m doing and don’t try to cover yourself.”</p>\n<p>“O-okay,” Atsumu stammers.</p>\n<p>It takes considerable effort for him to move his hands away from his chest, leaving himself completely exposed as he tries to relax his shoulders and let his arms settle at his sides. Then Sakusa reaches underneath his arms as he gets ready to start and Atsumu is forced to readjust his hands. </p>\n<p>He nearly snatches them away when they land on Sakusa’s thighs, firm and strong underneath the expensive fabric of his slacks, but Sakusa doesn’t react beyond a sharp intake of breath. He doesn’t make any effort to move Atsumu’s hands, either.</p>\n<p>Then Sakusa takes hold of his cock with both hands and Atsumu stops worrying about the position of his own.</p>\n<p>\n<em> “Omi…” </em>\n</p>\n<p>“Mmm.” Sakusa drops one hand down to play with his balls, getting them sticky as he jerks him slow and steady. “There you go, Atsumu. Relax a little more.”</p>\n<p>How the fuck is Atsumu supposed to do that? He grunts and rolls his shoulders, trying to let all of his muscles loosen further, trying to keep his grip on Sakusa’s thighs loose even when Sakusa circles a thumb around the slit at the head of his cock. Fuck. Fuck fuck <em> fuck. </em>This is so much more difficult than being restrained.</p>\n<p>Concentration split once more, Atsumu finds himself approaching the edge all too soon. He moans and tips his head back onto Sakusa’s shoulder, trying his very best to hold off, but Sakusa catches on and grips him tighter, twisting both wrists as he works him faster. Atsumu’s hands twitch on Sakusa’s thighs, toes curling.</p>\n<p>“Fuuuck…” Atsumu’s knees turn inward and he has to fight to keep his legs open. “Oh <em> god.” </em></p>\n<p>Sakusa hums. “Are you close?”</p>\n<p>Atsumu doesn’t want him to stop. He’s not at that knife’s edge yet, the one that makes him shiver all over as his brain goes fuzzy. “Not… yet…”</p>\n<p>“You are such a masochist,” Sakusa chuckles, mask brushing the shell of his ear. “I’m lucky you’re not disobedient often, you know. It would be hard to come up with many punishments you wouldn’t enjoy.”</p>\n<p>His words hit Atsumu hard, body throbbing around the plug as his cock twitches in Sakusa’s hands, approaching the point of no return.</p>\n<p>“Shit—<em>Omi, </em>I—m’gonna—”</p>\n<p>Sakusa takes his hands away.</p>\n<p>Atsumu cries out, needy, the toy inside him once again nearly pushing him right over the edge. His unrestrained hands dart between his legs on instinct but Sakusa catches his wrists like he’s expecting it. Atsumu gasps and fights against the urge to struggle.</p>\n<p>“Fuck—sorry, sorry—”</p>\n<p>“It’s okay,” Sakusa murmurs, gently lowering Atsumu’s hands back to his thighs. “It’s a new level of control, I know. You’re still learning.”</p>\n<p>Atsumu’s dick is pulsing in time with his heart as he tries to steady his breathing. “I’ll do better, Omi, I promise…”</p>\n<p>“Shh, I know you will... so good for me.”</p>\n<p>Atsumu moans at the praise, squirming as Sakusa’s hands skate up his front to play with his nipples, pinching and pulling as Atsumu digs his heels into the bed. </p>\n<p>He can—<em> fuck— </em> he can do this. A quick glance at the clock shows that it’s been twelve minutes since they started. Almost a quarter of the way there and Sakusa’s only brought him to the edge twice. <em> Atsumu can do this. </em></p>\n<p> </p>\n<p>Atsumu can’t do this.</p>\n<p>His knuckles are white where he’s clinging to Sakusa’s thighs, afraid if he lets go he won’t be able to stop from touching himself. </p>\n<p>“Please… <em> please…” </em></p>\n<p>“Fifteen more minutes, Atsumu,” Sakusa murmurs, one hand drifting down to tug on his swollen balls. “You’re almost there.”</p>\n<p>Atsumu sobs. <em> “Uuunnnghh…” </em></p>\n<p>There’s no way he’s going to make it. His cock is impossibly hard, so dark with blood it’s bordering on purple, glossy with lube and the nearly steady stream of precome that’s leaking out of the fat tip. His balls are tight, sore with denied release, and his hole keeps squeezing around the toy inside him. It feels like all of the blood in Atsumu’s body has settled between his legs, leaving him dizzy and lightheaded.</p>\n<p>He doesn’t feel like he’s fully under—holding himself still requires too much willpower for his mind to be able to completely slip away—but he feels drunk, a few tears slipping down his cheeks. Edging has never been this intense before.</p>\n<p>He clutches Sakusa’s thighs even tighter when Sakusa rubs the palm of his hand over the head. <em> “Nnnnh— </em>Omi—”</p>\n<p>Sakusa takes that for the warning that it is and removes his hands. Atsumu wails at the absence of his touch, head dropping back on Sakusa’s shoulder as tears stream down his face. Looking at himself—at what Sakusa’s done to him—would just make it harder to hold back. </p>\n<p>“Good boy,” Sakusa murmurs.</p>\n<p>Atsumu bites his lip and whines. His hips jerk away when Sakusa runs one teasing finger down his shaft, maddeningly light; he ends up pushing his ass back into the cradle of Sakusa’s hips, moaning when he feels how hard Sakusa is. Atsumu thinks about how good that would feel inside him and his hole clenches down involuntarily on the plug, back arching as he rubs mindlessly against Sakusa’s stiff length. </p>\n<p>It feels like the most natural thing in the world to him, so he doesn’t think anything of it until he hears Sakusa’s sharp intake of breath and notices that Sakusa’s hands have paused in their movements. </p>\n<p>Atsumu feels like he’s resurfacing from a pool as he realizes what he’s doing and who he’s doing it with. He stops moving completely and tries to remember how to formulate a sentence, blinking the tears out of his eyes.</p>\n<p>“Omi, I—shit, m’sorry—”</p>\n<p>“Shh,” Sakusa shushes him, rubbing over his thighs. “It’s alright, Atsumu. You can keep going.”</p>\n<p>Just like that, Atsumu feels himself slipping back into his comfortable headspace. He makes a noise that is absolutely not a whimper and tries to remember why grinding on Sakusa was a bad idea in the first place.</p>\n<p>“You can move however you want,” Sakusa continues, hooking his chin over Atsumu’s shoulder. Atsumu’s breath freezes in his chest. “Just let me play, and don’t touch yourself.”</p>\n<p>“Oh god,” Atsumu groans, plunging back into the place where nothing matters except for him and Sakusa, where nothing exists outside of the four walls of Sakusa’s bedroom. </p>\n<p>He braces himself on Sakusa’s thighs and rocks back, pushing his ass right up against Sakusa’s cock. Sakusa makes a low noise and puts his hands back where Atsumu wants them, fingers slipping over Atsumu’s tortured cock as he lets Atsumu grind on him. He keeps his chin on Atsumu’s shoulder, peering down the length of his body like it’s his due. Atsumu loves it.</p>\n<p><em> Fuck, </em>he wants that cock inside him.</p>\n<p>“You’re so close to making it,” Sakusa murmurs. “I know you can do it, Atsumu. You’ve been so good for me.”</p>\n<p>Atsumu sobs, a single tear sliding down one of the tracks on his cheek. “M’good?” </p>\n<p>He shudders as Sakusa wraps a hand around him and strokes him more firmly.</p>\n<p><em> “So </em>good. Once we get to an hour, I’ll make you come however you want.”</p>\n<p>Atsumu moans loudly. He wants to come on Sakusa’s <em> dick. </em>The idea won’t leave his head, clinging stubbornly as Atsumu tries to imagine this ending any other way than Sakusa fucking him into the mattress.</p>\n<p>\n<em> “Close—” </em>\n</p>\n<p>Now that they’ve almost reached an hour and he knows he’ll be able to come soon, Atsumu’s starting to relish each denial. He moans when Sakusa takes his hands away, moans at the release trapped in his pelvis with nowhere to go, moans at the soreness in his balls.</p>\n<p>More tears slip from Atsumu’s eyes and he groans from deep in his chest when Sakusa begins pinching his nipples once more, keeping him close to the edge. Atsumu’s limbs are starting to feel heavy; it’s getting easier to keep still, like resting limp against Sakusa’s chest and letting his dom play to his heart’s content is exactly where he’s supposed to be.</p>\n<p>If only he was sitting on Sakusa’s cock while they were doing this.</p>\n<p>“Omiii…”</p>\n<p>\n<em> Fuck me. Want me. Use me. Please, please fuck me. </em>\n</p>\n<p>“Look at you,” Sakusa murmurs, rolling his nipples between cruel fingers. “We only have a few minutes. Can you give me one more?”</p>\n<p>Right now, Atsumu would give Sakusa <em> anything </em>. He nods quickly, rolling his hips and savoring the little noise he pulls from Sakusa’s lips. His movements are shoving the plug against his prostate, rhythmic and teasing—it’s good but it’s not deep enough, he wants—he wishes Sakusa would—</p>\n<p>Just one touch of his horribly sensitive cock is nearly enough to make Atsumu come. He cries out hoarsely and tenses up all over as he braces himself against the tide of orgasm, tries to hold on a little longer.</p>\n<p>“Breathe,” Sakusa whispers.</p>\n<p>\n<em> “Can’t…” </em>\n</p>\n<p>If Atsumu relaxes any of his muscles, including his diaphragm, he’s afraid he might not be able to stop himself from coming.</p>\n<p>“Hmm.” Sakusa keeps one hand on his cock, but brings the other up to rest at the base of his throat. “Are you sure you can’t?”</p>\n<p>Atsumu shakes his head. His eyes fly open and he digs his nails into Sakusa’s thighs when the hand circles his neck<em> . </em>Sakusa still hasn’t let up on his cock, but for the moment Atsumu’s attention is diverted.</p>\n<p>Then Sakusa tightens his grip on Atsumu’s throat. “What about now?”</p>\n<p>When Atsumu can’t help but gasp, he realizes that he <em> can </em>still breathe, even though it’s difficult. Sakusa’s fingers are pressing more into the sides of his neck, not the front, and it’s… it’s…</p>\n<p>It’s making his head even fuzzier. Atsumu blinks. He might be going a little cross-eyed.</p>\n<p>“Omi…”</p>\n<p>“Mm. If you can speak, you can breathe,” Sakusa says, and squeezes him even tighter.</p>\n<p><em> “Mngh—” </em> Atsumu squirms, chest heaving as he sucks in any air he can, trying to clear his head. His ears are ringing, nearly blocking out the wet sounds of Sakusa’s hand slipping over the head of his cock. He can feel his heartbeat pulsing against Sakusa’s fingers from how hard they’re pressing into his neck. “Ohh— <em> hah, g’na—” </em></p>\n<p>Sakusa lets go of his dick, but not his throat. Atsumu’s howl is muted, partially caught in his lungs as he squirms and curls his toes into the quilt, hands twitching as he tries desperately not to reach for himself. Then Sakusa relaxes the grip little by little and Atsumu’s eyes widen as oxygen slowly returns to his brain. It’s a <em> rush— </em>if this feeling had hit him all at once it would have sent him over the edge. Atsumu shivers and whines before the thought seizes him.</p>\n<p><em> The edge. </em>Sakusa had asked for one more. Atsumu just gave it to him. Does that mean…</p>\n<p>“You did it, Atsumu.”</p>\n<p>Sakusa’s voice is proud, yet strained. Atsumu’s eyes prickle. New tears start to spill down half-dry tracks; he’s overwhelmed. He also realizes he hasn’t quite stopped grinding back against the firm bulge in Sakusa’s slacks, and he doesn’t <em> want </em> to stop. After everything Sakusa’s given him, Atsumu’s throat clogs up with the desperate desire to ask for <em> more </em>. </p>\n<p>\n<em> Fuck me. </em>\n</p>\n<p>“You gave me so much, Atsumu,” Sakusa continues, rubbing over Atsumu’s sweaty thighs. “How do you want to come?”</p>\n<p>It’s too much. His dick hurts and his skin feels like it’s about to split apart with the desire saturating his body. A sob cracks from Atsumu’s bitten lips. He can’t think—he doesn’t want to—he just wants Sakusa—</p>\n<p>There’s movement behind him and Atsumu whines brokenly as Sakusa slides out from behind him. Gloved hands lay him back against the pillows; then there’s a bare palm against his cheek, fingers tilting his face upwards. </p>\n<p>“Open your eyes,” Sakusa says, and Atsumu does. His image swims into view, black hair, black mask... deep, deep black eyes. “You earned this, Atsumu. You did so good. Tell me how you want to come, you can do it.”</p>\n<p>If Sakusa hadn’t just spent an hour making Atsumu’s brain melt out of his ears, Atsumu would have the self-restraint not to say what he says next. But Atsumu has been stripped down so deeply there’s nothing that could hold in the truth when Sakusa asks for it. </p>\n<p>“Atsumu?”</p>\n<p>He presses his cheek into Sakusa’s palm, eyelids so heavy, but open for him. Atsumu’s unfocused, clouded gaze trained right up at him. The slurred words slip out, not to be taken back.</p>\n<p>“Inside me—wanna come with’ya inside me, <em> Omi </em>...”</p>\n<p> </p>\n<p>\n<em> Inside me. </em>\n</p>\n<p>Kiyoomi is stunned.</p>\n<p>Well, part of him is. The other part knows they’ve been building toward this for months, even if Kiyoomi doesn’t want to admit it. Knows that everything has been progressing toward one inevitable conclusion: Kiyoomi painfully hard in his slacks and braced over a debauched Atsumu who’s begging to be fucked.</p>\n<p>His golden eyes are glistening with tears, so open and trusting it takes Kiyoomi’s breath away. His cheek is warm against Kiyoomi’s bare palm; Kiyoomi took his gloves off to be considerate, so he wouldn’t smear leftover lube on Atsumu’s face, but now it means that every touch is skin-on-skin, his nerve endings blistering at the contact. He’s losing the battle with the desire coursing through his body.</p>\n<p>\n<em> “Please…” </em>\n</p>\n<p>Kiyoomi blinks. </p>\n<p>His eyes slide down to Atsumu’s mouth, red and wet and open as he pants desperately. He wonders if he’ll ever get tired of reducing Miya Atsumu to <em> this.  </em></p>\n<p>He thumbs over Atsumu’s bottom lip and Atsumu moans, closing his lips around Kiyoomi’s bare thumb and sucking gently.</p>\n<p>The last tether of Kiyoomi’s restraint snaps.</p>\n<p>He tugs his mask down and nearly lunges for the man beneath him, pulling his thumb out of Atsumu’s mouth and pressing their lips together. </p>\n<p>Atsumu’s mouth is soft, wet and lax, lips parting in a surprised gasp that Kiyoomi takes advantage of by pressing his tongue inside. Atsumu moans, the sound vibrating in Kiyoomi’s head over the slick noises of their lips meeting, then wraps his arms around Kiyoomi’s back before yanking them away a second later like he’s been burned.</p>\n<p>Kiyoomi pulls back reluctantly to check on him, lips already tingling. </p>\n<p>“Sorry,” Atsumu gasps, eyes locked on Kiyoomi’s mouth as he twists the quilt in both fists. “Forgot I<em>—</em>wasn’t s’posed’ta touch…”</p>\n<p>Kiyoomi already misses the feeling of Atsumu’s lips on his own. He dips down to kiss him again while he considers Atsumu’s strangely considerate statement. How much <em> does </em>he want Atsumu to touch him? Usually Kiyoomi doesn’t enjoy or allow much contact from subs, but his body didn’t bristle at all when Atsumu clung to him a second ago.</p>\n<p>He ultimately decides to allow it for now but keep Atsumu on a short leash, desperately trying to hold onto any semblance of control. </p>\n<p>“You can touch my back and hips, but if I tell you to stop, put your hands over your head right away, okay?” Kiyoomi rasps. </p>\n<p>Atsumu’s eyes widen and he nods, hands coming to hover over Kiyoomi’s sides like he’s still not sure if he’s allowed. Kiyoomi reaches up to take his mask off completely, unlooping it from his ears and throwing it to the side before he leans in for another kiss and climbs over to cover Atsumu’s body completely with his own. He twists his fingers into Atsumu’s hair tightly, tilting his head back as he licks into Atsumu’s mouth and feels hands slide up his back, kneading at the fabric of his shirt before curling over his shoulder blades.</p>\n<p>The kiss is embarrassingly frantic, especially when Kiyoomi lowers some of his weight down and gets a little shock of pleasure as his dick presses against Atsumu’s through the barrier of his clothing. Atsumu gasps and squirms, trying to wriggle away, but there’s nowhere for him to go.</p>\n<p>“Not yet… <em> not yet…” </em> he keeps mumbling against Kiyoomi’s lips. “Please not yet…”</p>\n<p>Kiyoomi grinds down just to push him and shudders at the way he whines, at the delicious pressure between his legs. Atsumu has been edged for an hour, edged to the point of <em> tears, </em> but he <em> still </em> wants to wait until he can come on Kiyoomi’s cock. </p>\n<p>He’s never been with anyone like Atsumu. It’s making parts of Kiyoomi’s brain shut down one by one until all that’s left is instinct, base and feral.</p>\n<p>Kiyoomi swears against Atsumu’s lips and sits up, feverishly undoing his pants. Atsumu’s still reaching out for him, needy and wrecked, cock drooling onto his belly. </p>\n<p>“Fuck, look at you,” Kiyoomi mutters.</p>\n<p>He frees his dick, core pulsing with heat as he strokes himself. He feels manic. Atsumu’s eyes slide down his body and widen, mouth dropping open a little.</p>\n<p>\n<em> “Omi.” </em>\n</p>\n<p>Kiyoomi leans down to nip at his throat before reaching over to the bedside table to fish around for a condom. He isn’t in the practice of having unanticipated sexual partners, but he always keeps some just in case. He finds one towards the back after nearly knocking his lamp off the table.</p>\n<p>He rears back and rips the foil packet open without preamble, feeling like he’s in a dream as he slides it down his cock. He breathes harshly as he gazes down the fucked-up look on Atsumu’s face. He’s a mess, a <em> wreck </em> , and Kiyoomi did this to him. It’s <em> obscene.  </em></p>\n<p>Sitting back on his heels, it’s easy to push one of Atsumu’s thighs up towards his chest and grip the base of the plug, pulling it out in one smooth movement. Atsumu shouts, spine contorting, and then whines low and forlorn as he drops his head back against the bed. </p>\n<p>“Omi… <em> please…” </em></p>\n<p>That’s it. That’s <em> it.</em> Kiyoomi curses, rocks forward onto his knees to line himself up with a shaking hand, and <em> thrusts </em> deep into Atsumu’s body<em>. </em> </p>\n<p>Kiyoomi fills him up with one powerful snap of his hips, slapping against his spanked-pink ass when he bottoms out, and Atsumu <em> screams</em>. </p>\n<p>Fuck, it feels so good to have tight heat around his cock like this after so long without. Kiyoomi can’t believe he waited this long. He draws back and thrusts in again, leaning down to catch Atsumu’s bottom lip in his teeth as Atsumu arches up and moans into his mouth. </p>\n<p>Kiyoomi pushes forward, bending Atsumu’s lower half upward so he can kiss him more comfortably, his leg hooked into the crook of Sakusa’s elbow. The angle leaves Atsumu exposed, unable to even move his own hips<em>—</em>he just has to take it. To let Kiyoomi take everything from him, leaving only ecstasy in his wake <em> .  </em></p>\n<p>And Kiyoomi <em> takes, </em>pleasure ripping up and down his spine from every grunt, every groan. He goes to take Atsumu’s pleasure too, wrapping his free hand around his abused cock.  </p>\n<p>“No, no, no<em>—</em>”</p>\n<p>“What?” Kiyoomi pants, catching Atsumu’s lip between his teeth as a wicked smile steals unbidden onto his face. “You don’t want me touching you? I thought you wanted to come with me inside you.”</p>\n<p>The words, with a well-timed thrust of Kiyoomi’s hips, drive a guttural sound from Atsumu’s throat. He shakes his head, whole body shuddering when Kiyoomi grinds his cock deep. Kiyoomi darts briefly into his mouth, smiling when Atsumu sucks weakly on his tongue, then pulls back just to watch Atsumu chase his lips. He feels completely drunk on power. </p>\n<p>“Then what is it?” </p>\n<p>“Wanna<em>—</em>want’ya ta… first…”</p>\n<p><em> Shit. </em> Kiyoomi has to bite his own lip to stop a moan from ripping loose deep inside his chest. </p>\n<p>“You want me to come first, Atsumu? Is that it? You want to make me come?”</p>\n<p>Atsumu nods, eyelids fluttering. “Fr’you…”</p>\n<p>Kiyoomi does groan this time, into the line of Atsumu’s jaw as his lips glide over his skin. What a good sub.</p>\n<p>“That’s right. All for me. Just want to be my little fucktoy, don’t you?” Kiyoomi whispers into Atsumu’s ear, clenching his teeth as Atsumu’s body pulses around him in response to his words. “But I want to feel you, Atsumu. I want to feel you go over the edge I’ve been dangling you from. I want to watch you fall. Can you do that for me, Atsumu?”</p>\n<p><em> “Omi-i-i,” </em> Atsumu sobs, and that’s enough of an answer for Kiyoomi to start moving his hand, firm strokes of his dick matching the movements of his hips. </p>\n<p>He doesn’t hold back, not when Atsumu’s sounds take on that panicked note they always do when he’s about to go over at the end of an edging session, betraying a wave of oncoming pleasure so powerful it must be terrifying. Arms tighten around Kiyoomi’s back even as he forces some distance between them so that he can <em> see </em>, so he can watch. </p>\n<p>Kiyoomi keeps his eyes open even as his own pleasure mounts, clocking every delicious little change in Atsumu’s expression. He gasps when one of Atsumu’s hands, by accident or otherwise, slides high enough that Kiyoomi can feel the pads of his fingers pressed against the nape of his neck, as if Atsumu would literally fall without holding on to him. Atsumu’s other hand drifts away from Kiyoomi’s back and ends up clenched in the quilt above his head, like he’s bracing himself uselessly against the onslaught. Kiyoomi waits and keeps moving, desperate and overcome, until he feels Atsumu’s cock get impossibly harder in his hand. </p>\n<p>Then he hovers, just over his face, and commands, <em> “Come, Atsumu. </em>Come for me, now.”</p>\n<p>The sound that Atsumu makes and the way his body ripples around Kiyoomi’s dick is going to haunt his dreams. Atsumu comes, the high angle of his hips splashing white all the way up to his chin as he spills and spills. Even from Kiyoomi’s point of view it feels like it goes on forever as he fucks Atsumu through it, feeling him rhythmically clench around him. </p>\n<p>“Shit,<em> shit</em>,” Kiyoomi breathes, suddenly hurdling over the edge. He presses his forehead to Atsumu’s as he shoots into the condom, and time seems to freeze for a moment as overwhelming heat washes through his body. </p>\n<p>When Kiyoomi comes back to himself, the first thing he thinks is <em> I didn’t plan for that to happen </em>. The second thing that comes to mind is that he needs to make sure Atsumu’s alright, even though he’s becoming increasingly aware of the sweat between his clothes and skin, how some of Atsumu’s come has smeared across his shirt. He holds back a face as he quickly ties the condom off, disposes of it, and checks in on Atsumu.</p>\n<p>His eyes are nearly closed, but not completely, and the slit of them that’s visible looks blown out and unfocused. It seems like the end of their session may have put him under. </p>\n<p>“Atsumu,” Kiyoomi whispers, pushing his hair back. All he gets is a hum in response as Atsumu’s eyes close fully, a smile breaking out on his face. It makes a smile bloom on Kiyoomi’s lips as well. “You did amazingly. That was so good, Atsumu.”</p>\n<p>Kiyoomi wipes him down with a wipe pulled from the bedside table, not wanting to leave even to get a washcloth. He turns Atsumu onto his side and grabs the blanket to tuck it around him, then rubs a hand up and down from Atsumu’s shoulder to his hip through the fabric. Still, it’s only a few moments before Atsumu starts to shiver. </p>\n<p>Kiyoomi hums. It’s not rare for a sub to have trouble thermoregulating after a long, intense scene. </p>\n<p>“Atsumu, can you hear me,” Kiyoomi asks, only to be met with the thinnest of slits of foggy hazel. “You look a little cold. Let's get you into a bath.”</p>\n<p>Atsumu tries to work with him as Kiyoomi attempts to get him up, but he nearly pitches right off the bed, which brings another half grin to Kiyoomi’s face. He’s really out of it. It’s… kind of endearing. </p>\n<p>With a mental shrug and a thank you to his weight training routine, Kiyoomi solves their problem by scooping Atsumu up, blanket and all. It’s not easy, lifting over 80 kilograms of professional athlete, but Kiyoomi manages with an arm under his knees and one around his shoulders, a modified bridal carry.</p>\n<p>Atsumu slurs something that sounds like <em> woah Omi </em>, and Kiyoomi walks them towards the bathroom with a good natured, “Don’t get used to this…”</p>\n<p> </p>\n<p>Atsumu doesn’t remember anything with much clarity before the fourth set of the Kanagawa match. He vaguely remembers Sakusa carrying him into the bathroom and sitting him down on the shower stool to rinse him off before putting him into a hot bath. He remembers Sakusa showering as Atsumu soaked a few feet away, content as could be. </p>\n<p>Things got a little clearer when Sakusa got him up, dressed, and led him down the hallway to the couch, but then it faded out again for a while. Safe on the sofa, wrapped in fleece, with the sounds of volleyball in the background, Atsumu happily went back to drifting. </p>\n<p>Oddly the first thing that’s clear is a single serve whistle at the start of the fourth. Atsumu feels more like himself. He’s fully aware of Sakusa on the other end of the couch, scrolling through his phone between plays. </p>\n<p>A slow, menacing smile blooms across Atsumu’s face as he stares at Sakusa. Sakusa, who kissed him. Sakusa, who <em> fucked </em> him. </p>\n<p>After a second Sakusa glances up and his brow flattens as he notices the expression on Atsumu’s face. </p>\n<p>“So, you’re back,” he says. “How are you feeling.”</p>\n<p>The grin grows even wider as Atsumu realizes Sakusa is going to play this off like a tomcat that just fell off a wall, pretending everyone didn’t see and that he has nothing to be embarrassed about. And fall he did. No matter what Sakusa tries to play off now, Atsumu knows that he didn’t go into that scene planning to fuck Atsumu. Sure, Atsumu asked him to… but he followed through, <em> enthusiastically.  </em></p>\n<p>“I’m feeling <em> great</em>, Omi-Omi,” Atsumu says and Sakusa just rolls his eyes and pushes himself up off the couch. </p>\n<p>“Are you hungry? I'll warm up the curries.”</p>\n<p>“Thanks, <em> Omi-kun</em>,” Atsumu drawls, smirking up at Sakusa as he walks by. </p>\n<p>It earns him half the fleece blanket flipped over his head, but Atsumu considers Sakusa not trying to straight up suffocate him for that as a sign of affection, so. He giggles as he pushes it down, following Sakusa to the kitchen with his eyes. </p>\n<p>“How are <em> you </em> feelin’?” Atsumu asks, lounging against the cushions. </p>\n<p>“Fine, thanks,” he says, hilariously dismissive, as he opens up the fridge. “I was actually thinking... you should re-do your list. You had a lot of things marked as unsure or curious… things we both now know you <em> deeply </em> enjoy. It would be helpful going forward for you to fill out a new version, now that you’re more… experienced.”</p>\n<p>Atsumu flushes at the dark heat in Sakusa’s eyes. He knows it was an extremely successful pivot away from Atsumu’s smug teasing, but it’s more than that, too. It’s a sign, from Sakusa to Atsumu, that there’s more to come. If he had any fear that having sex would make Sakusa distance himself, it disappears at those simple words. This is just the beginning.</p>\n<p>Atsumu swallows.</p>\n<p>“Yeah. Yes… sounds good, Omi-kun.”</p>"
}