{
  "id": "27669757",
  "url": "https://archiveofourown.org/works/27669757?view_full_work=true",
  "author": [
    "envysparkler"
  ],
  "title": "miss me?",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "Batman - All Media Types"
  ],
  "relationships": [
    "Tim Drake & Jason Todd",
    "Dick Grayson & Jason Todd",
    "Jason Todd & Bruce Wayne"
  ],
  "characters": [
    "Jason Todd",
    "Tim Drake",
    "Dick Grayson",
    "Bruce Wayne",
    "Alfred Pennyworth"
  ],
  "additional_tags": [
    "Hurt/Comfort",
    "Emotional Hurt/Comfort",
    "Hallucinations",
    "Grief/Mourning",
    "everyone thinks Jason is a hallucination",
    "Jason is very concerned for his family's sanity",
    "Accidental Brother Acquisition",
    "Titans Tower au"
  ],
  "language": "English",
  "series": "",
  "published": "2020-11-22",
  "completed": null,
  "words": "6,010",
  "chapters": "1/1",
  "comments": "738",
  "kudos": "19,645",
  "bookmarks": "4,968",
  "hits": "167,760",
  "summary": "<p>Jason’s plan to observe his family’s reactions to his resurrection…does not go as intended.</p>",
  "notes": "<p>Reminder that the author has never touched a Batman comic in her life.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>Tim's POV of Jason telling him to go to bed. [<a href=\"https://archiveofourown.org/works/29792421/chapters/77421038\" rel=\"nofollow\">Batcellanea ch48</a>.]</p>\n<p>Missing fear toxin scene. [<a href=\"https://archiveofourown.org/works/29792421/chapters/75910220\" rel=\"nofollow\">Batcellanea ch13.</a>]</p>\n<p>Tim: Wait a minute, how did you get in my bedroom?<br>Dick: Wait, you were actually following me on patrol?<br>Bruce, putting the pieces together: .....You're the Red Hood, aren't you. [<a href=\"https://archiveofourown.org/works/29792421/chapters/77421164\" rel=\"nofollow\">Batcellanea ch49</a>.]</p>\n<p>[All <a href=\"https://archiveofourown.org/works/27669757\" rel=\"nofollow\">miss me?</a> Batcellanea shorts in chronological order: <a href=\"https://archiveofourown.org/works/29792421/chapters/77421038\" rel=\"nofollow\">48</a> — <a href=\"https://archiveofourown.org/works/29792421/chapters/75910220\" rel=\"nofollow\">13</a> — <a href=\"https://archiveofourown.org/works/29792421/chapters/77421164\" rel=\"nofollow\">49</a>.]</p>",
  "text": "<p> </p>\n<p>Jason had been mulling over revealing himself mid-fight, dramatically whipping off his helmet with a hateful sneer, or revealing himself at the end, when he slammed a heavy boot into broken fingers to let his narrowed eyes be the last thing his replacement saw, but he’d eventually decided to bare his face from the start.</p>\n<p> </p>\n<p>Come out swinging like a vengeful wraith and watch as the kid shit himself in terror.</p>\n<p> </p>\n<p>Jason stepped out of the shadows with a deliberate scuff of his boots and leaned against the wall, waiting.  He knew that the darkness turned his eyes into a poisonous shade of green, and judging by Timothy Drake’s wide, wide eyes, the effect was as frightening as he’d intended.</p>\n<p> </p>\n<p>“Jason,” the kid breathed out.  The wide eyes made him look…young.  Especially since he was out of uniform, dressed in light exercise wear for an insomnia-triggered midnight workout.</p>\n<p> </p>\n<p>Jason had a whole plan.  A speech with words as sharp as knives, every one carefully calculated to <em>hurt</em>, to poison with hate and fury and <em>how-dare-you-take-what’s-mine</em>.  He opened his mouth to deliver it, and—</p>\n<p> </p>\n<p>The kid said his name with something approaching awe.  Reverence.  The hate that Jason usually carried in a broken shard of his heart was suddenly nowhere to be found.</p>\n<p> </p>\n<p>“Timothy Jackson Drake,” Jason started slowly.  The kid didn’t look surprised to hear his name.  He hadn’t made a single move to approach Jason or call for backup or in any way question the presence of a stranger in what was supposed to be a fortified base.  He was frozen in place, his face stuck somewhere between hope and heartbreak.</p>\n<p> </p>\n<p>The kid almost swayed when he was finally forced to blink.</p>\n<p> </p>\n<p>“You should get some sleep,” Jason said automatically.  The kid frowned.  Jason’s mouth was suddenly dry—where the <em>hell</em> had that come from?—and he edged a step back.</p>\n<p> </p>\n<p>The kid blinked again, slow and sticky, and Jason took the opportunity to duck back into the shadows.</p>\n<p> </p>\n<p> </p>\n<p>Okay, so that hadn’t gone according to plan.  And yeah, Jason had fled like he was a twelve-year-old clutching a tire iron, but in his defense, it was a bit difficult to be intimidating after nagging someone to go to sleep.</p>\n<p> </p>\n<p>Jason knew that from personal experience.</p>\n<p> </p>\n<p>But hopefully the kid was sleep-deprived enough to dismiss the whole thing as some strange waking dream and Jason had the chance to try again.  This time, he was aiming for the post-battle adrenaline crash—the team would be on their last legs, the Replacement would be exhausted, and he could add the tinge of helplessness to the beat-down he was going to deliver.</p>\n<p> </p>\n<p>Jason shifted in his perch on the rooftop, watching as the Replacement forced five of the alien-robot things into an alley before deploying an EMP as they twittered and shrieked.  The kid turned back to the main fight as soon as the creatures started crumpling, unaware that the EMP hadn’t been as effective as he’d planned and that the creatures were raising their weapons and—</p>\n<p> </p>\n<p>“Behind you!” Jason shouted instinctively, and Robin whirled around, registering the weapons and firing another EMP.  The creatures finally crumpled to the ground.</p>\n<p> </p>\n<p>Robin raised his head and stared straight at Jason.</p>\n<p> </p>\n<p>Jason was frozen to the spot, unable to move, as the kid stared up at him—“Robin!” one of his teammates called, and the kid finally turned away.</p>\n<p> </p>\n<p>Jason let out a breath and buried his head in his hands.</p>\n<p> </p>\n<p>This was not working out.</p>\n<p> </p>\n<p> </p>\n<p>This time, Jason had the perfect plan.  A foolproof way to both bypass his apparently instinctive reaction to the sight of a Robin in trouble, and his Alfred-trained response to dark circles.  He’d just catch the kid while he was sleeping, and finally be able to deliver his hateful speech without undercutting his message by telling the kid to eat his vegetables or something.</p>\n<p> </p>\n<p>Jason had never had this problem before.  He’d killed lots of people without the urge to make sure they were drinking eight glasses of water and not substituting caffeine for liquids.  This was just another thing to add to the Replacement’s long list of crimes.</p>\n<p> </p>\n<p>The security at the Tower was just as laughable as the last time, and the door swung open soundlessly when Jason nudged it and—</p>\n<p> </p>\n<p>“Are you fucking kidding me?”</p>\n<p> </p>\n<p>Tim startled up like he’d been shocked, head snapping away from his laptop to squint blearily at the intruder in his room.</p>\n<p> </p>\n<p>“Jason?” he asked hoarsely, but Jason cut him off, furious.</p>\n<p> </p>\n<p>“You have a concussion!” he seethed, because he’d watched their fight against the Mindless Army of the Month and Tim had definitely slammed into a wall head-first.</p>\n<p> </p>\n<p>“I don’t—”</p>\n<p> </p>\n<p>“You are supposed to be <em>sleeping</em>!”</p>\n<p> </p>\n<p>“I just had some work—”</p>\n<p> </p>\n<p>“No,” Jason snapped, “I don’t care how much work you have.  I don’t care how critical it is.  You are getting into bed <em>right now</em>.”</p>\n<p> </p>\n<p>Tim blinked at him, slow and confused.  He reached out a hand towards Jason but hesitated halfway, fingers curling before the hand slowly withdrew.</p>\n<p> </p>\n<p>“Did the meaning of the word <em>now</em> change since you last heard it, Replacement?” Jason snarled.</p>\n<p> </p>\n<p>Tim flinched back at that, pinching the bridge of his nose and exhaling heavily.  “Didn’t think I hit my head hard enough for hallucinations,” the kid mumbled under his breath, but he slowly dragged himself out of the chair, closing the laptop before flopping on top of his bed.</p>\n<p> </p>\n<p>Jason drew the line at finding the kid a blanket.  He was <em>not</em> tucking him in bed.</p>\n<p> </p>\n<p>“Jason,” the kid said quietly, half-muffled by his pillow.  Jason edged around the room until he was in Tim’s field of view, a sliver of blue visible between mostly closed lids.  “I just wanted to make you proud,” he said, voice cracking to something painfully raw.</p>\n<p> </p>\n<p>It took Jason a full five minutes after the kid’s breathing evened out before he could unfreeze and <em>leave</em>.</p>\n<p> </p>\n<p> </p>\n<p>All the stories about the Pit’s side effects aside, Jason was not actually insane.  Once was incidence, but three times was definitely a fucking pattern, and the pattern was telling him that he wouldn’t be able to go after the Replacement.</p>\n<p> </p>\n<p>Which, okay, Jason could admit that his reasoning for beating up a fifteen-year-old was not all there, and Tim couldn’t really be blamed for taking Jason’s place.  What kid wouldn’t jump at the chance to be Robin?  Jason certainly hadn’t said no.</p>\n<p> </p>\n<p>No.  It wasn’t Tim’s fault.  It was the fault of the guy who’d handed over the suit like the last kid hadn’t <em>died in it</em>, and the fault of the ever-smiling, obnoxiously cheerful asshole that had spent every second making sure Jason knew exactly who he was being compared against and how far he was falling short.</p>\n<p> </p>\n<p>And then the Golden Boy had turned around and mentored Tim like he never had a complex over a different kid wearing Robin colors.</p>\n<p> </p>\n<p>Jason was flexible.  He could adapt his plans.  He could shove his growing, seething, green-laced fury over to a different target, and take a drive to Bludhaven, and track down an apartment address—and gawk, because he thought <em>Gotham</em> was a shithole—and sneak past a pitiful shock-trap on the windowsill, and be leaning against the counter when Dick stumbled in for breakfast.</p>\n<p> </p>\n<p>Dick stopped short on the threshold.  Jason smirked—he’d ditched the body armor and weapons for casual clothes, intending to see how many buttons he could push before Dick gave him the fight he wanted.</p>\n<p> </p>\n<p>“There are…two of you,” Dick said, his gaze flitting between Jason and the empty counter to his right.</p>\n<p> </p>\n<p>Jason was abruptly concerned for the state of Dick’s liver.</p>\n<p> </p>\n<p>“Okay,” Dick shrugged, shuffling towards the far cabinet, “What cereal would you like?”</p>\n<p> </p>\n<p>Jason stared blankly at him.</p>\n<p> </p>\n<p>Dick reappeared with two boxes of cereal.  “And you?” he asked, staring straight at Jason.</p>\n<p> </p>\n<p>“Cheerios,” Jason’s mouth replied.  Jason’s brain was still trying to understand what was going on.</p>\n<p> </p>\n<p>“Of course,” Dick’s face split into a sad smile.  Jason stared silently as Dick walked around the kitchen, careful not to get too close to him or a space near the stove he was avoiding, getting out bowls and milk.</p>\n<p> </p>\n<p>He set the table for three people, dumping in his frosty, over-sugared concoction in one bowl, and leaving plain Cheerios in the other two.</p>\n<p> </p>\n<p>There was a growing pit in Jason’s stomach and it was threatening to undermine the stability of everything he’d built his plans around.</p>\n<p> </p>\n<p>Dick finished his cereal in silence, staring at the two untouched bowls, gaze moving between Jason and the empty spot.  When he was done, he took all three bowls to the sink, dumping out the now soggy cereal down the drain and—</p>\n<p> </p>\n<p>His knees buckled and Jason nearly lunged to catch him before he stopped himself.  Dick was kneeling on the floor, forehead pressed against the counter as he shook, tears dripping down his face as hitched sobs were drowned out by the sound of the water running.</p>\n<p> </p>\n<p>“Jaybird,” Dick whispered brokenly, “I’m so sorry.”</p>\n<p> </p>\n<p>Jason backed away.  He wasn’t supposed to see this.  He wasn’t supposed to be here.  He nearly tripped into a wall in his haste to leave.</p>\n<p> </p>\n<p> </p>\n<p>Jason tried to tell himself that he was stalking Dick around the city for information—not that the guy seemed to really notice, ignoring Jason every time he caught sight of him—but the excuse stretched painfully thin by the time Nightwing suited up.</p>\n<p> </p>\n<p>Jason hadn’t really thought much of Batman being a lone defender in a city full of criminals, but Batman was <em>Batman</em>.  He was larger than life, and he’d been that way for as long as Jason could remember.</p>\n<p> </p>\n<p>Nightwing, on the other hand, was painfully overworked and exhausted and seemed to be just one step above punching bag for Bludhaven’s thugs.  The quips were landing flat, the flips weren’t as showy as Jason remembered, and Jason nearly freaked out the first time a criminal levelled a gun at Nightwing’s undefended back.</p>\n<p> </p>\n<p>Jason was caught between two options—reveal himself or let Nightwing get shot—and his panicking mind snatched at the first alternate option it saw.  Jason nailed the criminal in the face with a stray stone.</p>\n<p> </p>\n<p>The criminal yelped, Nightwing turned around, escrima flashing, and the criminal went down soon after.</p>\n<p> </p>\n<p>Jason collected a small pile of pebbles.  By the time Nightwing dropped back on the roof of his apartment building, it was down to two pieces of broken glass and half a brick, and Jason’s blood pressure was through the roof.</p>\n<p> </p>\n<p>“You’re an idiot,” Jason couldn’t stop himself from hissing as Nightwing headed for the fire escape, “You nearly got yourself killed <em>ten times over</em>, you stupid bird, you need someone to watch your back before you—”</p>\n<p> </p>\n<p>“Isn’t that you’re here for, Jay?” Nightwing laughed.  The sound was airy, and Jason didn’t like it.</p>\n<p> </p>\n<p>“I’m—” Jason cut himself off.  <em>I’m dead</em>.  Only he wasn’t.  Dick just thought he was.  Thought he was a hallucination, because he clearly had them quite often.</p>\n<p> </p>\n<p>“I know, Little Wing,” Dick’s face split into something too sad to be called a smile, “I’m sorry.”</p>\n<p> </p>\n<p>Jason stayed on the roof as Dick went back to his apartment.</p>\n<p> </p>\n<p>There had been days when all he wanted from his so-called older brother was an apology.  Some kind of proof that he wasn’t perfect, that he wasn’t the golden hero everyone compared Jason to.  Something that admitted he made mistakes too.</p>\n<p> </p>\n<p>And now it felt hollow and sour.</p>\n<p> </p>\n<p> </p>\n<p>Unfortunately, this time Jason’s stone attack had startled the thug into actually firing and Nightwing made a pained yelp as he dove for cover.  Before Jason could take out his gun and empty it into the thug that had dared to attack his brother, green surging up in fury, Nightwing leapt out again, electricity crackling.</p>\n<p> </p>\n<p>Nightwing managed to stay upright as he tied the criminal up and left him behind for the police, beginning to limp as he aimed his grapple.  He made a sound like a strangled scream when he landed on the roof, staggering and nearly crumpling before he caught ahold of a vent.</p>\n<p> </p>\n<p>“Go home,” Jason said, not caring that his tone was edging close to begging, “Wing, you’ve been hit, <em>go home</em>.”</p>\n<p> </p>\n<p>“This city needs me, Jaybird,” Nightwing said, not even looking at him as he made his way to the edge of the roof.</p>\n<p> </p>\n<p>“And how much good will you be when you’re <em>dead</em>?” Jason snarled, and the bitterness wasn’t only aimed at Dick.</p>\n<p> </p>\n<p>Nightwing flinched.  “I’m sorry, Little Wing,” he said softly, “I’m so, so sorry for failing you.  I should’ve been there, I should’ve—”</p>\n<p> </p>\n<p>“So you throw yourself in front of every bullet in this city in the hopes that it’ll bring me back?” Jason asked, his rage burning, “Or in the hopes that you’ll join me?”</p>\n<p> </p>\n<p>Nightwing stared out over the grimy expanse of the city, the one he’d made his own, striking out from Batman’s shadow and turning into a feared vigilante in his own right.</p>\n<p> </p>\n<p>“Sometimes it feels like I’m drowning,” he said softly, “Like I’m sinking in weightless water.”  He turned and stared straight at Jason, “And you’re always there.  I don’t know if you’re pulling me up or forcing me down, Jaybird.”  His face twisted before easing out into a smile, “But I can’t bring myself to let you go.”</p>\n<p> </p>\n<p>Something thrummed inside Jason’s heart, the twelve-year-old looking at his older, taller, glitteringly perfect older brother and wanting his approval, his attention, that beaming smile turned on him.</p>\n<p> </p>\n<p>“Poetic,” Jason snapped and Dick laughed.  “Go home before you bleed out.”</p>\n<p> </p>\n<p>“I wish I could hug you,” Dick said, lost and alone and <em>broken</em> and Jason wavered.  All he had to do was take a step forward and raise his arms and he could give Dick a hug.  Letting the older boy think he was a hallucination was not worth Dick’s sanity, it didn’t matter how many of Jason’s plans had been ruined, he’d never be able to attack Dick now and—</p>\n<p> </p>\n<p>But there was still one person left.  Still one name on the list, the one person who was the cause of all this.</p>\n<p> </p>\n<p>Dick gave him a soft smile and turned to go home.</p>\n<p> </p>\n<p>Jason followed him back, making sure he didn’t get into any further trouble and hovering until Dick had finished his stitches and bandaged up the wound and passed out on the bed before he left, easing out the window and locking it behind him.</p>\n<p> </p>\n<p>It was time to head to Gotham.</p>\n<p> </p>\n<p> </p>\n<p>Talia had once told him it wasn’t healthy to keep his anger bottled up.  That the Pit fed on emotion and the more suppressed anger he had, the more frustration built up, the more fury seethed inside of him.  Jason had taken her advice to heart, and killed each one of his teachers when they pissed him off.</p>\n<p> </p>\n<p>The streets of Gotham were hazed in green when he swung through them, the drumbeat of <em>make-him-pay</em> in tune with his heartbeat, fury pulsing out and searching desperately for a target.  He had his armor and guns, but he left the helmet behind.</p>\n<p> </p>\n<p>He wanted Batman to see his face.  He wanted him to <em>see</em> what the worst case scenario was, what happened when he failed his partners.</p>\n<p> </p>\n<p>Jason had died and Batman had done <em>nothing</em>.</p>\n<p> </p>\n<p>Had replaced Jason with another kid, a younger kid, like the Joker hadn’t broken half the bones in his body before blowing him up, like that wasn’t enough of a warning that Robin should’ve died too.</p>\n<p> </p>\n<p>And before he’d ever replaced Jason, he’d replaced Dick, who was all alone in a city that wanted to eat him alive, falling apart piece by piece.  Batman was a brooder, but Dick <em>wasn’t</em>, Dick needed conversation and friends and happiness and Batman had just abandoned him in a city that was worse than Gotham.</p>\n<p> </p>\n<p>The point of the no-killing rule was that death was permanent.  The point of no killing was that death <em>meant</em> <em>something</em>.  And Jason’s death had changed nothing.</p>\n<p> </p>\n<p>But the grave hadn’t kept Jason, and he was going to beat the lesson into Batman’s head.  Or he was going to kill the man trying.</p>\n<p> </p>\n<p>It wasn’t difficult to find him.  The green hissed when it caught sight of a patch of sky darker than the night behind it, the pointed cowl framed against shadows.  Jason eased up to the rooftop with the silence that Batman had trained into him and the League perfected.</p>\n<p> </p>\n<p>Batman realized he was there when he was still ten feet away.  He twisted, the dark cowl staring straight at him.  Jason froze—his guns were still holstered and he couldn’t draw them before Batman lunged at him.</p>\n<p> </p>\n<p>But Batman didn’t lunge at him.  “Jay?” he said—in a voice that wasn’t Batman, that was <em>Bruce</em>.</p>\n<p> </p>\n<p>Jason couldn’t move.  He had—he hated Batman, hated what the man’s crusade had done to the city, hated that he’d gotten fired and then replaced from being Robin, hated every one of the man’s stupid rules and his stupid cape and his stupid no-killing ideal.</p>\n<p> </p>\n<p>But Bruce was—Bruce was—the green didn’t know what to do with Bruce.</p>\n<p> </p>\n<p>There were tears prickling at the corner of Jason’s eyes and it <em>wasn’t fair—</em></p>\n<p> </p>\n<p>Batman crouched down on the roof, sitting on the edge but still staring at Jason.  What little was visible of his face was lined and worn.  He looked <em>old</em>, and it was startling—when Jason had been growing up, Bruce Wayne had always been timeless, and Batman even more so.</p>\n<p> </p>\n<p>“Hey, old man,” Jason said softly.  Batman rocked back, like the words were daggers, and dropped his head, bringing one gauntleted hand up to rub at his face.</p>\n<p> </p>\n<p>Jason crept closer, and closer, and when Batman didn’t even twitch, he slowly crouched to take a seat next to him, letting his legs dangle in empty air.</p>\n<p> </p>\n<p>He could do it now.  Batman—Batman didn’t think it was actually him, and Jason could shoot him right now and watch realization shatter into pain.</p>\n<p> </p>\n<p>“I saw that chili dog stand that you love,” Bruce said quietly, “I—I’m sorry, Jay.  I—I wish—what I wouldn’t give to see you eating one of those again.”</p>\n<p> </p>\n<p>He couldn’t do it now.  He should’ve set up a sniper position on the next roof.  He—he couldn’t—he couldn’t look into Bruce’s face and plunge the dagger into his heart.</p>\n<p> </p>\n<p>Jason stood up abruptly.  Bruce stared at him—one gauntleted hand twitched and balled into a fist and Jason stumbled back before Bruce could reach out and see that he was really there.</p>\n<p> </p>\n<p>“You need to check on Dick,” Jason said flatly, “He’s falling apart.”</p>\n<p> </p>\n<p>“Okay,” Bruce said, gaze fixed on him like he couldn’t look away, “Okay, Jay.  Anything you want.”</p>\n<p> </p>\n<p>Jason froze.  <em>Anything you want</em>.</p>\n<p> </p>\n<p>“Kill him,” Jason croaked out, before he lost his nerve, “Kill the Joker.”</p>\n<p> </p>\n<p>If Bruce—if Batman just <em>did </em>it, if he ended the man who’d <em>killed his son</em>, if Jason could be absolutely sure he’d never run into a maniacal clown ever again, never hear the laughter that still haunted his dreams, the whistling of the crowbar—the <em>fire—</em></p>\n<p> </p>\n<p>Batman drooped, and turned away.</p>\n<p> </p>\n<p>Jason stared at him, green washing over him so quickly that the world took a sickly hue between one blink and the next.</p>\n<p> </p>\n<p>“I can’t believe I ever expected anything else,” Jason said coldly, and twisted on his heel to stalk away.</p>\n<p> </p>\n<p>A dagger to the heart wasn’t good enough.  It was too easy.  Too simple.  Too…random.  If Batman was more concerned with the lives of his Rogues than the lives of his partners, well.  It was clear what Jason had to become.</p>\n<p> </p>\n<p> </p>\n<p>The Red Hood rose to prominence among the Gotham’s underworld startlingly fast.  Some people called him a ghost because of his eerie propensity to disappear into thin air.  Even the Bats couldn’t catch him—he moved one step ahead of them at all times, like he knew how they worked and what they’d do next.</p>\n<p> </p>\n<p>Of course, a good chunk of those disappearing acts was Jason removing the armor and helmet whenever anyone got too close, exchanging the crime lord Red Hood for the hallucination of Jason Todd.  It was an effective disguise, as long as he stayed away from the security cameras.</p>\n<p> </p>\n<p>He’d already broken into the Cave to write himself a back door to delete any suspicious footage from the servers.  Bruce had stopped dead in his tracks when he found him standing in front of a glass case holding a familiar, ragged uniform.</p>\n<p> </p>\n<p>Displaying the gruesome trophy of his death.</p>\n<p> </p>\n<p>“A good soldier,” Jason said out loud, resisting the urge to shatter the case into a hundred pieces.  He turned to stare at Bruce, “Guess now I know what you really thought of me.”</p>\n<p> </p>\n<p>Bruce swallowed, his expression painful.  “You know that’s not what it means,” he said softly.</p>\n<p> </p>\n<p>“Do I?” Jason challenged, “I thought I was your <em>son</em>!”  Bruce flinched back and Jason forced his voice down to avoid startling the bats.  “Just another soldier in your pointless crusade,” Jason said dully, “You replaced me easily enough.”</p>\n<p> </p>\n<p>“Jason, I didn’t—”</p>\n<p> </p>\n<p>“Save it, <em>Dad</em>,” Jason sneered, and had the vicious satisfaction of seeing Bruce’s face crack, “If you really cared, the Joker would be dead.”</p>\n<p> </p>\n<p>“Please,” Bruce said, his voice breaking, “Jason, <em>please—</em>”</p>\n<p> </p>\n<p>“Funny,” Jason said quietly, “That’s how I begged, when I screamed for you to save me.”</p>\n<p> </p>\n<p>Bruce buried his face in his hands.</p>\n<p> </p>\n<p>Jason stalked out.</p>\n<p> </p>\n<p> </p>\n<p>The Red Hood, the Rogue Batman couldn’t catch.  And Jason Todd, the very visible reminder of all his failures.  Batman was cracking and Jason applied more pressure on the fault lines.</p>\n<p> </p>\n<p>The last piece of his plan fell into place when he learned that Alfred had taken a few days off.  It gave access to the last place he needed to complete his assault on Batman’s sanity.</p>\n<p> </p>\n<p>His room was exactly as he’d left it—not just his books on his shelves and his clothes in the closet, but literally <em>exactly</em> as he’d left it, down to the homework on his desk—which was creepy, but gave an added layer of surrealism to his appearance.</p>\n<p> </p>\n<p>He left the door open, reclined back to stare at the ceiling, and waited.</p>\n<p> </p>\n<p>Bruce stopped in the doorway.  “Jason?” he asked, his voice hesitant.</p>\n<p> </p>\n<p>Jason tilted his head to look at him, “Morning.”</p>\n<p> </p>\n<p>Bruce opened his mouth, scanned both ends of the hallway, and closed it before shuffling out of view.</p>\n<p> </p>\n<p>Jason grinned.</p>\n<p> </p>\n<p> </p>\n<p>“Still haven’t checked up on Dick,” Jason noted, leaning against a gargoyle as Batman watched a building across the street.</p>\n<p> </p>\n<p>Batman’s slight tension was the only indication that he’d heard Jason.</p>\n<p> </p>\n<p>“What, is he not one of your good little soldiers?” Jason asked, “Or do you not care if you get another Robin killed?”</p>\n<p> </p>\n<p>Gauntleted hands curled into fists.</p>\n<p> </p>\n<p>“Well, I guess you never cared about any of us,” Jason hummed, “Not Dick, not Tim, and certainly not me—”</p>\n<p> </p>\n<p>“If I check on Dick,” Batman growled, “Will you <em>go away</em>?”</p>\n<p> </p>\n<p>“Maybe,” Jason drawled, smirking.  Batman made a low, angry, inarticulate sound.</p>\n<p> </p>\n<p>“Why won’t you leave me alone?” Batman asked, his voice perilously close to cracking back to Bruce.</p>\n<p> </p>\n<p>Jason stared at him.  “You’re the detective,” Jason said softly, “You figure it out.”</p>\n<p> </p>\n<p> </p>\n<p>Jason planned a quiet night for the Red Hood, making the most of Batman’s patrol for uninterrupted access to the Cave.  His old logins still worked, and Batman and Robin weren’t expected back for hours.  It was time to get a better look at everything that had happened over the past three years from a slightly less biased source than the League of Assassins.</p>\n<p> </p>\n<p>Jason chose the first file out of morbid curiosity—everything had hurt so much that the events had mostly just blurred together in his head, and an outside perspective would certainly be…interesting.</p>\n<p> </p>\n<p>An autopsy report.  Jason winced at the number of injuries and clicked to the next document.  A report of the trip from the moment Batman had caught up to him, the details laid out without any emotion.</p>\n<p> </p>\n<p>Jason bared his teeth.  He didn’t want Batman’s <em>assessments</em>, he wanted the unfiltered truth.  Jason switched to the cowl footage.</p>\n<p> </p>\n<p>“<em>Robin!  Robin!  No, no, NO!  Robin, please…Jay, please, you can’t—you can’t be—no, Robin, please wake up, Jay please, Jason, </em>please<em>!</em>”</p>\n<p> </p>\n<p>Jason closed the file, his heart hammering.</p>\n<p> </p>\n<p>He opened the next file, dated a couple of days later.  Clearly Batman had wasted no time in going back on patrol.</p>\n<p> </p>\n<p>It was a quiet night, no major deals going down, a simple patrol, just a couple muggings—and Batman was beating the living shit out of one of those muggers.</p>\n<p> </p>\n<p>“<em>Why?</em>” Batman shouted, “<em>Why do you deserve mercy when he got none?  Why do you deserve to live when he died?  WHY?!</em>”</p>\n<p> </p>\n<p>Jason clicked the file closed with trembling fingers as a sickening crunch came through the video.</p>\n<p> </p>\n<p>That—that was just the first few days.  Jason hadn’t seen any of that aggression when he showed up, so it was just temporary.  A momentary surge in frustration due to the loss of a soldier.  That was it.  That had to be it.</p>\n<p> </p>\n<p>A week later, three teenagers cowering back from the pointed cowl.  A month later, Jason wasn’t even sure if the thug Batman dropped was even still breathing.  Three months later, Batman nearly paralyzed a man when he was a little too slow in catching him after he threw him off a building.  Six months later—six months later, there was a kid sneaking around the rafters of a warehouse dressed in Jason’s old suit.</p>\n<p> </p>\n<p>“<em>No</em>,” Batman growled, and Jason could hear the cracks in his tone, “<em>No, not again, please no—</em>”</p>\n<p> </p>\n<p>Jason nearly exited out of the computer in his haste to close the files.  He stared into the darkness of the Cave, a lump growing in his throat. </p>\n<p> </p>\n<p>No.  It wasn’t—he didn’t—he was—Batman had—</p>\n<p> </p>\n<p>The Joker was still alive.  No matter what Batman had done, no matter how badly he went after the common criminals on Gotham’s streets, the Clown Prince of Crime was <em>still alive</em>.</p>\n<p> </p>\n<p>Jason turned back to the computer, his jaw set and eyes burning, and typed in a search command.</p>\n<p> </p>\n<p>The first file was dated a month or so after his death and Jason opened the footage to a baffling scene—someone had lost their marbles enough to declare the Joker as their ambassador?  <em>Superman</em> was playing bodyguard?  Batman was—</p>\n<p> </p>\n<p>“<em>I won’t let you kill him.</em>”</p>\n<p> </p>\n<p>Something clenched in Jason’s heart.</p>\n<p> </p>\n<p>The next video—a ballroom in chaos, people screaming, a helicopter in the air, that <em>laughter—</em></p>\n<p> </p>\n<p>It was possible that Jason didn’t think this all the way through.</p>\n<p> </p>\n<p>“<em>Batman, stop!  Batman!  Batman!</em>”</p>\n<p> </p>\n<p>Jason fumbled for the keyboard as he kept his hands clapped over his ears, cackles ringing out around him, he could hear metal scraping against the ground and whistling through the air and <em>he wouldn’t stop laughing—</em></p>\n<p> </p>\n<p>The view from the cowl abruptly jerked, the helicopter falling to the water, white face paint a bright blot against the metal.  It hit dark waves and sank below them, twisted metal disappearing out of sight.</p>\n<p> </p>\n<p>“<em>You could’ve saved him.</em>”</p>\n<p> </p>\n<p>One low, hoarse growl.  “<em>No</em>.”</p>\n<p> </p>\n<p>The video ended and the screen went dark.  Jason slowly uncurled his hands from his ears and his fingers wavered over the keyboard.</p>\n<p> </p>\n<p>He dragged the cursor back to the start of the video, and hovered over play.</p>\n<p> </p>\n<p>HA—ha—HA—ha—HA—ha—<em>“Which hurts more?”—</em>ha—HA—ha—HA—<em>“A or B?”—</em>ha—HA—<em>“Forehand or backhand?”—</em>HA—<em>it hurt, it hurt so much, he was screaming, the door was locked—</em>ha—tick—HA—tock—ha—tick—HA—tock—</p>\n<p> </p>\n<p>\n<em>00:00.</em>\n</p>\n<p> </p>\n<p>“Bruce,” Jason whispered, squeezing his eyes shut and shoving away from the computer.  He took heaving, ragged breaths but it wasn’t enough, he hadn’t prepared to hear that—that—that—</p>\n<p> </p>\n<p>He was fifteen years old again, and all he wanted was his <em>dad</em> and—and Batman hadn’t saved him.</p>\n<p> </p>\n<p>So why did Jason always go running back to him?</p>\n<p> </p>\n<p>The Batmobile roared into the Cave, four hours too early, and Jason snapped his head up.  The Batcomputer was still open to past files, he wasn’t ready to face Batman and Robin, especially not with Joker’s laughter ringing in his ears and his fury slipping out of reach.  He stood there, frozen in the center of the Cave, as the Batmobile’s doors opened.</p>\n<p> </p>\n<p>Robin hopped out first, and he didn’t spare a single glance for Jason, instead moving to the other door.  The minute he opened it, a dark shape spilled out and Robin nearly staggered under his weight.</p>\n<p> </p>\n<p>Jason unfroze.</p>\n<p> </p>\n<p>“Batman,” Robin said, clearly struggling, “B, we’re in the Cave, B, come on—”</p>\n<p> </p>\n<p>“No,” Batman snarled, “No, I need to get to him, no, let me go, <em>let me go</em>!”</p>\n<p> </p>\n<p>“B, you got hit with fear toxin,” Robin said, wavering and dropping to one knee with a curse.  Jason was at his side, and hefted up Batman’s other arm, not saying a word.</p>\n<p> </p>\n<p>Robin stared at him for a long moment, eyes wide.  “Jason?” he asked tremulously.</p>\n<p> </p>\n<p>“He’s in trouble,” Batman hissed and Robin shook his head, swallowing and forcing himself upright.  Between the two of them, they managed to get Batman to one of the cots on the medbay.  Jason stepped back quickly as Tim tore off his mask and stared at Jason again.</p>\n<p> </p>\n<p>“I need to save him, he’s in trouble, I need to <em>go—</em>”</p>\n<p> </p>\n<p>Tim pressed a shaky hand to his comm.  “Nightwing,” he said, squeezing his eyes shut, “We need an assist.  Crane’s out of Arkham.  We both got hit—latest antidote’s not working.”</p>\n<p> </p>\n<p>“<em>Jason</em>!” Bruce screamed and Jason jolted.  Batman levered up from the bed, trapped in the same nightmare that always played out behind Jason’s eyes.</p>\n<p> </p>\n<p>Batman hadn’t saved him.</p>\n<p> </p>\n<p>But Jason—Jason was still <em>here</em>.</p>\n<p> </p>\n<p>“Jason,” Bruce said, broken and soft, and Jason moved.  He tugged Bruce’s cowl off and glanced over at Tim—the kid had curled up in a chair, hands pressed over his ears and face buried into his knees, trembling faintly—before catching one of Bruce’s waving hands in his own.</p>\n<p> </p>\n<p>“Jason, no, please wake up, <em>please—</em>”</p>\n<p> </p>\n<p>“I’m here,” Jason said hoarsely, forcing Bruce to meet his gaze, “Bruce, I’m right here, I’m here, I promise I’m here.”</p>\n<p> </p>\n<p>Bruce choked on a sob and Jason clutched his hand tighter, unable to stop his expression from twisting.  “I swear,” he said, ragged, “I’m <em>right here</em>.”</p>\n<p> </p>\n<p>Tim was shaking, tears leaking from closed eyes, and Bruce let out a low, mournful sound.</p>\n<p> </p>\n<p>Jason waited with them for half an hour, stretching the edge of Nightwing’s earliest possible arrival, before he untangled his hand from Bruce’s grip and straightened up.</p>\n<p> </p>\n<p>He closed down the files he was viewing, rerouted the footage of his visit, and wiped the evidence of his access.  And then he went upstairs.</p>\n<p> </p>\n<p> </p>\n<p>He stared at the ceiling of his childhood bedroom.</p>\n<p> </p>\n<p>Untouched.  Cleaned.  Like it was just waiting for him to come home.</p>\n<p> </p>\n<p>But he couldn’t come home.  Or could he?  Everything had seemed so obvious in the beginning, crystal clear with edges cut by green.</p>\n<p> </p>\n<p>\n<em>“You remain unavenged.”</em>\n</p>\n<p> </p>\n<p>Which meant they didn’t care.  That he meant nothing to him.  That they had never missed him, not even for a second.</p>\n<p> </p>\n<p>That—</p>\n<p> </p>\n<p>But that wasn’t true.</p>\n<p> </p>\n<p>They didn’t kill the Joker.</p>\n<p> </p>\n<p>How could they not kill the Joker and still mourn his death?</p>\n<p> </p>\n<p>How could they care if his murderer was still drawing breath?</p>\n<p> </p>\n<p><em>How</em>?</p>\n<p> </p>\n<p>The green had no answer.  The anger wasn’t the simple, cold burning fury of revenge and righteousness, it was the vicious tangle of frustration and hurt and it didn’t have a target.</p>\n<p> </p>\n<p>Jason threw his arm off and stared back at the ceiling.</p>\n<p> </p>\n<p>They missed the fifteen-year-old kid that slept in this room.</p>\n<p> </p>\n<p>They missed <em>Robin</em>.</p>\n<p> </p>\n<p>The Red Hood was a poor compensation for what they’d lost.  A trained killer, a temperamental crime lord, everything that Batman had dreaded he’d become.  They didn’t miss him.  They <em>didn’t</em>.</p>\n<p> </p>\n<p>It was getting really hard to convince himself of that.</p>\n<p> </p>\n<p> </p>\n<p>Jason took a seat at the table and stretched his legs out, leaning back and getting comfortable.</p>\n<p> </p>\n<p>The first one through the door was Bruce.  He hesitated a full second when he caught sight of Jason, but then he rubbed at his eyes and took his normal seat at the head of the table.  Dick was next, and he didn’t even spare Jason a second glance before slumping in the seat across from him.  Tim came in last, his gaze skittering over Bruce and Dick before pausing on Jason.  He went still for a long, stretching moment, but crept in to take his seat before either of the other two noticed his preoccupation.</p>\n<p> </p>\n<p>Jason didn’t even try to hide his smile, but he kept his mouth shut.  This would certainly be an interesting breakfast.</p>\n<p> </p>\n<p>Bruce took the track of completely ignoring him, ducking his head behind the newspaper.  Dick gave him an answering smile as he curled up in his chair.  Tim was squinting at him like he wasn’t sure whether he should go get more coffee or cut back entirely.</p>\n<p> </p>\n<p>And then Alfred walked in, and the tray in his hands fell to the floor with a loud clatter.  “Master Jason?” he sucked in a sharp breath, eyes going wide.</p>\n<p> </p>\n<p>Jason grinned at him, “Hey, Alfie.”</p>\n<p> </p>\n<p>The breakfast table immediately erupted into a clamor.  Dick leapt out of his chair, face pale, Bruce’s eyes were already narrowing, and Tim—</p>\n<p> </p>\n<p>Tim reached a hand out, his eyes desperately hopeful, and Jason leaned across the table before the kid chickened out.</p>\n<p> </p>\n<p>He caught Tim’s hand and laced his fingers with the kid’s.  Tim stared at him like—like he’d seen a dead boy come to life, and Jason couldn’t see anything else because a heavy weight slammed into him nearly hard enough to send his chair tipping back.</p>\n<p> </p>\n<p>“Jaybird,” Dick choked, his arms strangling tight around Jason, “Jaybird, you’re <em>here</em>.  You’re alive.  You’re—”</p>\n<p> </p>\n<p>“I’m here, Dickiebird,” Jason murmured, wrapping his arms around his older brother.  Dick dissolved into sobs and Jason awkwardly patted his head, trying to ignore the prickling in his own eyes.</p>\n<p> </p>\n<p>“Little Wing,” Dick wailed and something fractured inside Jason’s heart.  He buried his face in Dick’s hair before he did something stupid.</p>\n<p> </p>\n<p>“<em>How</em>?”</p>\n<p> </p>\n<p>Jason lifted his gaze.  Bruce’s face had gone completely bloodless—everyone else in the kitchen was standing, shocked and stunned and speechless.</p>\n<p> </p>\n<p>“It’s a long story,” Jason said hoarsely, “It—” digging out of his own grave as panic clawed at his throat, fragments of Gotham’s streets, <em>green</em>, the blinding fury, the rage he could still feel churning inside of him, blunted but not tamed, waiting for the opportunity to strike—</p>\n<p> </p>\n<p>A hand cupped his cheek, large and gentle.  “It’s okay,” Bruce said, brushing a thumb over his cheekbone.  He was—he was <em>crying</em>.  “It’s okay.  Jason, you’re home.”</p>\n<p> </p>\n<p>Bruce crouched so fast that Jason almost thought he’d collapsed, pressing his forehead to Jason’s as he squeezed his eyes shut.</p>\n<p> </p>\n<p>“You’re <em>alive,</em>” Bruce choked out, “Jay-lad, you’re here.”</p>\n<p> </p>\n<p>Jason pressed back, taking a deep, shuddering breath.  “Dad,” he murmured, and he couldn’t hold back the tears anymore.</p>\n<p> </p>\n<p>Tim was frozen on the other side of the table, eyes wide and watery, and Alfred had a handkerchief pressed to his face.  “Master Jason,” he said, his voice choked up, “I can’t believe—when did you—”</p>\n<p> </p>\n<p>“You told me to make sure I was coming back, remember?” Jason asked him, his voice cracking, “I know I’m a few years late, but—”</p>\n<p> </p>\n<p>“No,” Alfred cut him off, tears streaming down his face, “You’re home, and nothing else matters.”</p>\n<p> </p>\n<p>There was a lump swelling in Jason’s throat and he was surrounded by family and the room was getting blurry around him and—</p>\n<p> </p>\n<p>\n<em>Did you miss me?</em>\n</p>\n<p> </p>\n<p>And they said <em>yes</em>.</p>\n<p> </p>\n<p> </p>"
}