{
  "id": "27707812",
  "url": "https://archiveofourown.org/works/27707812?view_full_work=true",
  "author": [
    "OldeShoestrings"
  ],
  "title": "Nubivagant",
  "rating": "Not Rated",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "原神 | Genshin Impact (Video Game)"
  ],
  "relationships": [
    "Tartaglia | Childe/Zhongli (Genshin Impact)"
  ],
  "characters": [
    "Zhongli (Genshin Impact)",
    "Childe (Genshin Impact)",
    "Fatui Harbingers (Genshin Impact) - Character",
    "Tsaritsa (Genshin Impact)"
  ],
  "additional_tags": [
    "Idiots in Love",
    "Soft Childe",
    "Financially Poor Zhongli (Genshin Impact)",
    "Childe is a Panicked Gay",
    "Falling In Love",
    "Tea Shop",
    "Childe loses his mind every time Zhongli smiles"
  ],
  "language": "English",
  "series": "Part 2 of Olde's Vault",
  "published": "2020-11-25",
  "completed": null,
  "words": "5,515",
  "chapters": "1/1",
  "comments": "238",
  "kudos": "6,496",
  "bookmarks": "1,017",
  "hits": "56,648",
  "summary": "<p>The one where Zhongli is no longer an Archon and he decides to come with Childe to Snezhnaya. </p>\n<p><em>Just because</em>, Zhongli says.</p>\n<p>Childe is still furious with the former Archon for deceiving him. Yet Childe still spoils Zhongli senselessly. Still treats him tenderly.</p>\n<p>And Childe doesn't understand why.</p>",
  "notes": "<p>\n<em>(Important A/N: Not an English speaker and this isn't beta)</em>\n</p>",
  "text": "<p>--</p>\n<p>\"Childe?\"</p>\n<p>He stopped.</p>\n<p>\"Take me with you,\" Zhongli requested.</p>\n<p>Childe turned around to study the former Archon intensely.</p>\n<p>Instead of his usual intricate and regal attire, Zhongli was wearing a simple loose shirt with dark trousers. He was smiling and his smile was soft and tender, not fully expecting anything.</p>\n<p>It adorned Zhongli's face so easily now that Childe had to take a moment before he could look away. </p>\n<p>No matter how furious he was at Zhongli, the harbinger couldn't deny that Zhongli's beauty was as delicate and pure as always.</p>\n<p>\"Take you where?\" Childe inquired. He refused to admit his breaths stuttered in his throat. </p>\n<p>Childe took a careful peek at the other man under his bangs.</p>\n<p>Zhongli's smile grew bigger. Brighter. Kinder. </p>\n<p>Childe's heart ached.</p>\n<p>\"To Snezhnaya. Let me come with you to Snezhnaya.\"</p>\n<p>Childe blinked. Zhongli waited patiently. </p>\n<p>The former Archon hummed a bit. His fingers thrummed against his long sleeves. His hair was a bit messy and his cheeks were flushed like ripe fruits. His eyes swirled with a little tug of endless joy.</p>\n<p>Zhongli looked <em>free.</em></p>\n<p>\"...why?\" Childe asked instead, knowing full well he could have just cruelly rejected Zhongli's abrupt request.</p>\n<p>Zhongli put his index finger under his chin, thinking, taking his time as if he refused to give Childe a fabricated answer.</p>\n<p>Zhongli's eyes found Childe's once more.</p>\n<p>\"Just <em>because,</em>\" was all Zhongli said. A little hint of teasing under his tone. His eyes twinkled.</p>\n<p>Childe huffed fondly.</p>\n<p>\n<em>... fondly?</em>\n</p>\n<p>The harbinger cleared his throat almost too loudly. He wouldn't accept the offer, of course. Childe would tell Zhongli just that.</p>\n<p>He would make sure his voice was harsher and higher than usual, make sure the anger vibrate in his voice as he continued prolonging his contemptuous remarks at the former Archon. </p>\n<p>He was deceived and used by Zhongli. Someone Childe dearly considered a friend.</p>\n<p>The eleventh harbinger would decline Zhongli's request so brutally and ferociously until he felt nothing but the unbridled satisfaction coiled in his chest.</p>\n<p>Childe would make the former Archon remember the ache forever.</p>\n<p>Childe smirked, looked at the other in the eye, and opened his mouth.</p>\n<p>--</p>\n<p>\"Childe, will you not enjoy the sight with me?\"</p>\n<p>Childe scrunched his nose. He leaned his chest on the railings, hiding his face in his arms. The ship swayed, undulating delicately by the waves. </p>\n<p>He refused to look at Zhongli. Still brooding after he'd reluctantly made his decision to take Zhongli with him to Snezhnaya.</p>\n<p>What would Tsaritsa say to this? Bringing a former Archon with him to her cold, white-coated continent. To her domain that she possessively ruled.</p>\n<p>Childe sighed.</p>\n<p>Well, at least, on the bright side, he wasn't on the same ship with Signora. </p>\n<p>\"Childe?\" Zhongli called out again.</p>\n<p>Childe exhaled. \"What?\" He asked, voice exasperated. Childe didn't look at him.</p>\n<p>He heard Zhongli approaching. Then Childe felt the ever-familiar warmth beside him, blistering like molten gold.</p>\n<p>\"The sight. It's quite lovely,\" Zhongli said. His tone was light, taking no offense in Childe's blasé mood in dealing with him.</p>\n<p>Childe scoffed. \"There's nothing to see here but the waves and the clouds.\"</p>\n<p>\"Indeed.\" There was a <em>smile</em> in that voice. Childe still refused to look at the man.</p>\n<p>\"They're still beautiful to look at. The waves. The clouds. They change shapes. Never repeating the same forms. It's quite remarkable,\" Zhongli drawled. </p>\n<p>Finally, Childe looked at the former Archon. His lips puckered downward. The insults were raw on his tongue, loose cannons, and Childe desperately wanted to hurl them at Zhongli.</p>\n<p>But.</p>\n<p>His sky blue eyes landed on Zhongli and Childe's breaths clogged behind his tongue as always. </p>\n<p>Zhongli was smiling. Again. Staring at Childe as if he was expecting Childe to offer him fireworks and little secrets tucked away in his chest. Like Childe was worth all the time in the world.</p>\n<p><em>Always.</em> Zhongli would always look at him like that.</p>\n<p>Childe's bottom lip quivered a bit. His heart twisted. He stared overhead. </p>\n<p>The view was tremendously vibrant. It hurt his eyes. But looking at Zhongli hurt even more.</p>\n<p>\"Childe?\"</p>\n<p>\"You used me,\" he accused.</p>\n<p>\"...I did,\" Zhongli muttered. He hummed a lullaby Childe had never heard of before. His head was resting against Childe's shoulder. The long bronze hair tickled at his ear.</p>\n<p>Zhongli's fingers touched Childe's gloved hand, playing with the leather, and tapping his fingers playfully on Childe's knuckle. </p>\n<p>The harbinger's throat burned.</p>\n<p>\"Fight me,\" Childe requested petulantly.</p>\n<p>Zhongli chuckled. \"I'm sorry but I have to decline. If we fight on this ship, we might injure other people. Or worse, we sink the ship.\"</p>\n<p>Childe rolled his eyes.</p>\n<p>The calm lasted for quite a long time.</p>\n<p>Childe slotted his fingers together with Zhongli's. The other returned the gesture tenderly.</p>\n<p>They said nothing else.</p>\n<p>--</p>\n<p>Zhongli exhaled loudly, transfixed by the small fog rolling from his mouth. He repeated this action several more times until he was completely satisfied with the result.</p>\n<p>Like a child, Zhongli poked at the slowly dissipating fog until it completely dissolved.</p>\n<p>Childe chuckled. He sat on the nearby bench. The snow climbed to his heels. He flicked his nose and didn't tremble from the cold.</p>\n<p>Childe grew up here. This was his home.</p>\n<p>And Childe wore the harsh element like his second skin.</p>\n<p>\"Remarkable…\" Zhongli whispered in awe. A fascination meant only for him to hear. Childe heard it loud and clear regardless.</p>\n<p>Zhongli was walking on the snow with his long boots, gloved hands reaching out towards the orange-and-blue sky, and poking at the falling flakes. </p>\n<p>His long hair was fashioned into a bun, hidden under the gray wool cap.</p>\n<p>Zhongli twirled around once. Twice. Cheeks flushed and nose red. Zhongli's lips curved like a bow as he smiled and appreciated the white canvas, painting the world with his hasty steps on the snow.</p>\n<p>Childe reclined on the bench, memorizing the picture into his memory. Stashing it away like it was the most precious treasure in the world.</p>\n<p>It was. He didn't dare to deny it.</p>\n<p>\"I've forgotten the coldness of snow on my skin,\" Zhongli confessed. \"It's been so long... I used to avoid wintertime.\"</p>\n<p>Childe's smile reached his eyes. </p>\n<p>\"Lucky for you, the snow here is constant. So enjoy it, I guess. Just don't catch frostbite,\" he joked. Slowly, Childe's brows narrowed. \"Can you even get frostbite?\"</p>\n<p>Zhongli blinked at him. \"Now? I'm not sure. Perhaps. I'm no longer an Archon.\"</p>\n<p>\"Let's not… try to find out about it, okay?\"</p>\n<p>Zhongli nodded. His focus went back to the snow. Lost behind the white curtain once more.</p>\n<p>Strange. Childe was still angry with the other man for his deceptions and yet. </p>\n<p>And <em>yet</em>.</p>\n<p>Childe sighed. He stood, dusting the wintry specks from his lap. He trudged towards Zhongli and in seconds, he took the other's hands in his.</p>\n<p>\"Childe?\" Zhongli stared at him, curious.</p>\n<p>Childe grinned. \"Let's fight.\"</p>\n<p>Zhongli gave him a disapproval glance. \"Now?\"</p>\n<p>\"Why not? There are only two of us in the garden.\"</p>\n<p>\"But the snow--\"</p>\n<p>\"--will be fine. Come on.\" </p>\n<p>Zhongli opened his mouth. Possibly to protest.</p>\n<p>Childe didn't wait for an answer as he pulled Zhongli closer, chest to chest. His one hand went around Zhongli's waist while the other gripped Zhongli's palm gently.</p>\n<p>\"What--\"</p>\n<p>Zhongli didn't get to finish his question when Childe quickly twirled him under his arm playfully, spinning Zhongli around on the snow, swaying together clumsily; Childe's laughter muffled Zhongli's yelps.</p>\n<p>Eventually, Zhongli tried to keep up but Childe knew his steps were messy and he didn't follow any tempo. Just a movement uncoordinated. And so Zhongli struggled a bit but he didn't complain, smiling the whole time.</p>\n<p>Childe took a closer look at Zhongli's eyes. Stars were living inside them and Childe mapped all the celestial clouds of dust and tucked them away to be cherished forever. </p>\n<p>Their noses touched and Zhongli let out a small chuckle.</p>\n<p>Childe's chest felt full.</p>\n<p>--</p>\n<p>Zhongli stayed at Childe's second home. </p>\n<p>It was for personal use. In case he wished to be alone or to run away from the loudness of the world.</p>\n<p>It was a small apartment, tucked away amidst the other tall imposing buildings. A luxurious place, cozy and clean and simple with barely anything to decorate the place except for all the vital necessities Childe needed.</p>\n<p>It was a quiet place. Enough to house one person. Cold and barren. </p>\n<p>Just how Childe preferred it.</p>\n<p>Then Zhongli came in and he ruined everything. All the trinkets he bought in Snezhnaya filled the floor, stacked against the walls, on the kitchen counters.</p>\n<p>Books and scrolls clattered. Red lanterns and small ancient vases, gemstones, and world maps scattered about.</p>\n<p>All bought with Childe's mora.</p>\n<p>The fireplace was lit all the time now whenever Zhongli was home, warming the whole room.</p>\n<p>Zhongli also left his dirty clothes on the floor, and the dishes were left unwashed.</p>\n<p>Childe looked at the mess and sighed. This was why he needed to make a daily visit.</p>\n<p>\"Zhongli!\"</p>\n<p>\"Wh-- oh? Childe, welcome home.\"</p>\n<p>Childe stopped, taken aback. But the shock was only temporary.</p>\n<p>He resumed glaring at the other. No heat in his eyes.</p>\n<p>\"What did I tell you about keeping this place clean? </p>\n<p>Zhongli blinked slowly at him. He put the book he was reading in his lap to observe his surroundings. The former Archon flushed, looking ashamed.</p>\n<p>Good.</p>\n<p>Childe gestured at the sink with his chin. \"Come. You'll help me wash the dishes.\"</p>\n<p>Zhongli nodded, staring longingly at the book before he bookmarked it and placed it gently on the nearby table.</p>\n<p>\"Here, put this apron first,\" Childe offered him the pink cloth. Its strings were hanging loosely.</p>\n<p>\"Ah, but we're not preparing any cuisine, Childe. It's unnecessary to use this protective garment.\"</p>\n<p>Chile huffed. \"Just use it. You're going to dirty yourself just from cleaning the dishes. I know you.\"</p>\n<p>Zhongli studied him for a moment. Eventually, he smiled. \"Very well then. As you wish.\"</p>\n<p>Zhongli donned the apron and Childe helped him tie the cloth around himself. Zhongli was quiet as he let Childe work. </p>\n<p>When the harbinger was done, Zhongli turned around to mutter a small thank you. Their faces were close. Breaths mingled together. </p>\n<p>Childe swallowed.</p>\n<p>Zhongli pulled his hair into a bun and fastened them with a hairpin, his gaze never left Childe.</p>\n<p>Ocean blue eyes wandered to the exposed neck and collarbone. Childe felt a bit terrible for ogling. </p>\n<p>\"I'm ready,\" Zhongli proclaimed calmly.</p>\n<p>Despite himself, Childe grinned. \"Okay. We're going to do this nice and slow. No rushing like last time--\"</p>\n<p>\"You were the one who was rushing.\"</p>\n<p>Well. Yes. Because Zhongli was <em>so close</em> to him back then, Childe couldn't breathe. His words knotted and his heart leaped from his breastbone and his hands trembled. </p>\n<p>Childe thought he was dying but no--... it was Zhongli's fault for standing so close to him.</p>\n<p>Childe quickly gained his momentum. He gave the other a sharp smile. \"This time is different. Count on it.\"</p>\n<p>This time was no different. </p>\n<p>They stood side by side before the sink.</p>\n<p>Zhongli was close and Childe was suffocating. His heart was all over the place; on the ground, in the air, floating all around him, pulsing violently. There were incessant flutters in his belly. </p>\n<p>He didn't understand why.</p>\n<p>Childe stole a peek at Zhongli. The former Archon wasn't looking at him. Until Zhongli finally did, giving him a sweet bashful smile.</p>\n<p>Childe felt like dying. </p>\n<p>\n<em>What is wrong with me?</em>\n</p>\n<p>--</p>\n<p>Zhongli was summoned by Tsaritsa.</p>\n<p><em>Zhongli was summoned by Tsaritsa</em> and the idiot just entered Zapolyarny Palace without waiting for the eleventh harbinger.</p>\n<p>\n<em>(Why didn't it ever occur to him before that Tsaritsa might want to see the former Geo Archon? Was he that distracted by Zhongli?)</em>\n</p>\n<p>Childe was preoccupied, fulfilling his assigned duty in his Archon's name when he was notified by a smug-looking Dottore.</p>\n<p>\n<em>'Rex Lapis is lovely to look at. Do you think he'd make beautiful sounds as well under my masterful hands?'</em>\n</p>\n<p>Childe had elbowed the man in the face then. Hard. Dottore returned the gesture good-naturedly. They both left with a swollen mark on their jaws. <em>Bastard</em>.</p>\n<p>Now, Childe was running towards the palace. Footsteps hastened, hands curled into fists, fear twisted his heart, and his thoughts billowed like dark ashes. </p>\n<p>\n<em>Zhongli Zhongli Zhongli. Please be safe.</em>\n</p>\n<p>He entered the monstrous entrance, ignoring all eyes on him as he dashed towards Tsaritsa's throne chamber. No one tried to stop him. No one would dare.</p>\n<p>Childe would cut them swiftly if they even dared to attempt. </p>\n<p>His breaths became labored. Each step was accompanied by a snarl, a desperate huff. Childe didn't even spare Signora an obligatory glare when he passed her.</p>\n<p>If there was even a single scratch on Zhongli then Childe would--</p>\n<p>He stopped. </p>\n<p>He would… what? He would do… what?</p>\n<p>Childe inhaled. Exhaled. </p>\n<p>There was a sound coming from the Tsaritsa's throne chamber. He was close.</p>\n<p>Childe resumed running. He could collect his thoughts later. </p>\n<p>\"Tartaglia,\" one of the guards called out to him, \"Tsaritsa hasn't summoned you. You are not permitted entry--\"</p>\n<p>Childe pushed the twin silver doors open quickly but quietly. Just in case.</p>\n<p>\"--mayhap you're correct, old friend.\"</p>\n<p>\"But? I hear <em>but</em> somewhere in that tone, Morax. You disagree.\"</p>\n<p>A soft chuckle. \"Snezhnayan cuisine is quite interesting, I won't deny it, but Liyuen cuisine appeals to my taste more. Surely, you're not trying to--\"</p>\n<p>More long, intricate opinions were shared, followed by gentle laughter.</p>\n<p>Childe blinked. \"Wh-- what's going on?\"</p>\n<p>Two pairs of eyes landed on Childe. He stood awkwardly at the foot of low glass stairs.</p>\n<p>Zhongli looked surprised to see him. A small porcelain cup was held carefully in his hands. Tsaritsa mirrored Zhongli, sitting across him, one leg on her knee. </p>\n<p>A round crystal table between them. A set of tea was served neatly, distributed with Snezhnayan traditional biscuits.</p>\n<p>She gave Childe a long bland stare.</p>\n<p>\"Tartaglia, what is the meaning of this? I did not summon you,\" Tsaritsa's voice boomed coldly in the icy room.</p>\n<p>\"At ease, Tsaritsa. I'm sure Childe has his reasons.\"</p>\n<p>Tsaritsa scoffed. \"Very well. For you, dear friend, I shall show my unruly harbinger leniency. Just this once.\"</p>\n<p>\"Uhh,\" Childe said stupidly.</p>\n<p>Zhongli smiled sweetly at him. Childe cleared his throat, blinking rapidly. Unable to look at Zhongli. His cheeks reddened a bit.</p>\n<p>Tsaritsa raised a brow at her harbinger. Her calculative eyes slowly went to Zhongli then to Childe. She sipped her tea courteously.</p>\n<p>She held the porcelain cup the same way Zhongli did and Childe suddenly had a nagging inkling that the former Geo Archon had taken his precious time to patiently guide Tsaritsa on how to properly hold a teacup.</p>\n<p>The way a Liyuen would.</p>\n<p>Childe didn't know how to process the information. He was more surprised Tsaritsa had allowed Zhongli to be close enough to impart another one of his silly teachings if Childe's suspicion was correct.</p>\n<p>A beat. </p>\n<p>And then Tsaritsa sighed. \"I see. A courtship then?\"</p>\n<p>\"What?\" Childe questioned. Zhongli… flushed.</p>\n<p>Tsaritsa sighed louder. </p>\n<p>\"I shall allow it. However, should my little Tartaglia affronts you in any manner, be it physically or verbally, send him my way, Morax, and I shall deal with this boy swiftly.\"</p>\n<p>\"An unnecessary offer, Tsaritsa. Childe would never hurt me,\" Zhongli informed confidently.</p>\n<p>\"What,\" Childe questioned again. He was like a whale stranded on the shore at the very moment.</p>\n<p>He received a fleeting cold glare from Tsaritsa before he was dismissed with a flick of her wrist.</p>\n<p>\"I'll see you at home, Childe,\" Zhongli intoned.</p>\n<p>\n<em>What?</em>\n</p>\n<p>--</p>\n<p>\"Tsaritsa gave the order to steal Barbatos' gnosis.\"</p>\n<p>Zhongli nodded solemnly. \"So she did.\"</p>\n<p>Childe waited. Zhongli took his time before answering.</p>\n<p>\"Your Archon does not owe me an apology. That is between her and Barbatos. However, I've given her approximately one month to make amends with Barbatos. For what she's stolen, she's expected to pay Barbatos with an equivalent boon.\"</p>\n<p>Childe quirked a brow. \"And if Tsaritsa fails?\"</p>\n<p>Zhongli smiled. \"All Archons can be replaced.\"</p>\n<p>--</p>\n<p>\"Childe?\"</p>\n<p>\"Hmm?\"</p>\n<p>\"I wish to open a tea shop.\"</p>\n<p>Childe choked on his drink. He coughed once. Twice. Until he finally looked at a concerned Zhongli.</p>\n<p>\"Are you all--\"</p>\n<p>\"You want to <em>what?</em>\"</p>\n<p>\"Oh. I wish to start a business. A tea store, if you would. With your blessing, of course.\"</p>\n<p>\"With my mora, you mean.\"</p>\n<p>Zhongli nodded sagely. \"That, too.\"</p>\n<p>Childe shook his head frantically. \"No. Absolutely not.\"</p>\n<p>--</p>\n<p>\"Liyuen theme fits this tea shop quite perfectly.\"</p>\n<p>\"Uh-huh.\"</p>\n<p>\"I thank you, Childe, for your continuous assistance.\"</p>\n<p>Childe massaged his temple. Fortunately, he only needed three weeks to prepare everything; all the contracts were signed and payment made.</p>\n<p>He was offered a two-story building, stationed near a frozen lake, secluded from the much busier location. From the inside, the view from the glass window was breathtaking. Serene.</p>\n<p>Zhongli was holding a small red lantern in his hand. The faint flame was lit, swaying helplessly as Zhongli protected it from the shy sneaky breeze with his other hand.</p>\n<p>\"Childe, can you lift me? I wish to hang this lantern on the windowsill.\"</p>\n<p>Childe shrugged. \"Sure. Whatever you want.\"</p>\n<p>Zhongli gave him a heartfelt smile. \"Thank you.\"</p>\n<p>Childe's heart somersaulted. <em>That damn smile.</em></p>\n<p>He bent one leg on the floor, waiting for Zhongli. His heart wouldn't stop beating. It gnawed at his ribcage, begging to be let loose.</p>\n<p>Zhongli went to his side, putting one arm around Childe's shoulder, his back touching Childe's hips before the harbinger raised Zhongli carefully and tenderly from the floor. </p>\n<p>His hands around Zhongli's hips and lower back were steadfast and protective, securing the former Archon to his side. </p>\n<p>Zhongli reached upward, hanging the lantern on its intended location, taking his time. It oscillated. Later on, the faint light would dim.</p>\n<p>The glow of the tiny lantern reflected on Zhongli's face and like a wispy candlelit in the dark, it floodlighted the tiniest smile on Zhongli's lips. </p>\n<p>Childe watched. Eyes fixed on the man in his arms. His grip tightened.</p>\n<p>Zhongli looked down at Childe.</p>\n<p>Zhongli's smile grew so joyously radiant as he put both of his hands on Childe's shoulders to steady himself, trusting Childe impeccably not to drop him.</p>\n<p>And Childe wouldn't let go of him. Never. He'd never allow anything in this world to ever hurt Zhongli no matter what--</p>\n<p>Childe blinked. </p>\n<p>His breaths stuttered.</p>\n<p>\n<em>Shit. I'm in love with the smartest idiot alive.</em>\n</p>\n<p>--</p>\n<p>Zhongli installed an oak bookshelf in his tea shop. He stacked all the books he brought from Liyue on the shelf until there was no space left.</p>\n<p>Zhongli hanged more scrolls on the walls. Liyuen idioms were imprinted on them. He decorated the archway with flowers, and sometimes Childe would catch a faint whisper of 'glaze lilies' under Zhongli's breath every time he glanced at the decorative petals.</p>\n<p>Of course, they weren't glaze lilies. This was not Liyue. Almost nothing could blossom in Snezhnaya's cruel climate.</p>\n<p>But somehow Zhongli pretended he was looking at something that was not there, be somewhere he was not, and Childe left him be.</p>\n<p>--</p>\n<p>\"Will you return to Liyue again?\"</p>\n<p>\"Certainly. Not for now. But one day.\"</p>\n<p>\"I will come with you,\" Childe offered.</p>\n<p>Zhongli's eyes brightened. \"Yes, I'd like that very much.\"</p>\n<p>--</p>\n<p>The next time Childe visited the tea shop, it was almost dark. It was freezing but Childe remained unsubdued by the relentless element.</p>\n<p>He saw the light from the shop aglow from the distance. The smile on his face was unprompted. He quickened his steps.</p>\n<p>Already, he imagined Zhongli there, waiting for Childe in that adorable apron of his because he knew Childe would only ever visit when it was five minutes to closing time. </p>\n<p>It may be selfish but Childe always preferred the quiet serene air when there was no one else but only the two of them in the shop.</p>\n<p>Zhongli was a dragon once. Now, he was a treasure and Childe was the greedy interloper that wanted to keep Zhongli all to himself.</p>\n<p>Childe pushed the door open the moment he arrived, a huge grin on his lips. An affectionate greeting on his tongue.</p>\n<p>It slipped away instantly once he noted the group of people sitting around a beautifully crafted jade table.</p>\n<p>All eyes found him.</p>\n<p>Childe's glare was icy and ferocious. </p>\n<p>\"My <em>my.</em> What a frightening look you have there, Tartaglia,\" Pantalone crooned.</p>\n<p>Signora scoffed, lifting the porcelain to her lips, taking her precious time sipping the tea.</p>\n<p>Pulcinella and Dottore said nothing as they struggled with the chopsticks, hissing and cursing under their breaths as their food kept slipping away from them.</p>\n<p>\n<em>Hah. Served these vermins right.</em>\n</p>\n<p>Scaramouche sneered, eyes twinkling spitefully as he stared at Childe. \"Rex Lapis is out of your league, you dried worm. Better tell him I have the bigger dick. Maybe he'd fall into my arms instead, huh?\"</p>\n<p>Childe snarled. </p>\n<p>Sandrone and Capitano laughed. Pedrelino was already out cold, bottles of Baijiu piled around them. Whatever. At least, Childe had one less rat to deal with.</p>\n<p>\"What do you know about dicks, shitassmouse, when you measure yours with a bean?\" Childe retaliated darkly.</p>\n<p>\"<em>Oh,</em>\" Capitano smirked at the small man.</p>\n<p>Signora hissed distastefully. \"Disgusting. All of you speak like peasants.\"</p>\n<p>Scaramouche blinked. Then the anger in his face flared like a flame--</p>\n<p>\"Oh, welcome, Childe,\" Zhongli said when he emerged from the kitchen. His hair was always tied in a bun, fastened by a pink flower hairpin, and he wore simple attire along with his favorite apron. He rarely wore thick garments if he could help it.</p>\n<p>Childe wondered if the man even felt the cold. </p>\n<p>Zhongli was holding a small tray of honey biscuits before he politely served the sweet course to his customers. His warm eyes lingered on Childe.</p>\n<p>There was no one else here but Zhongli and the eleven harbingers.</p>\n<p>The mood quickly changed. Even Scaramouche kept his vile tongue behind his teeth.</p>\n<p>These people were being civil to Zhongli possibly because he had Tsaritsa's favor.</p>\n<p>No matter. Childe still needed to be careful. He never trusted his fellow Fatui harbingers.</p>\n<p>Signora gave Zhongli a respectful nod as she easily picked the biscuit and took a bite.</p>\n<p>\"Hmm, not too sweet but quite soft on the tongue,\" she said. \"I like it.\"</p>\n<p>Sandrone tsk-ed. \"Pretentious bitch,\" they muttered under their breath. Dottore snorted.</p>\n<p>Signora paid them no mind.</p>\n<p>Zhongli smiled graciously at her. \"Thank you. It took a while to perfect them.\"</p>\n<p>Again, she gave him a nod.</p>\n<p>Childe fisted his hands. Zhongli shouldn't be smiling like that to anyone but <em>him</em>.</p>\n<p>Pantalone gave him a look. \"Sit, Tartaglia. Mister Zhongli has graciously made all of these delightful sweets and served us fine tea and yet you gaped like a fool from the door.\"</p>\n<p>Childe opened his mouth. No words came out.</p>\n<p>\"Please be kinder to Childe. I'm sure he's had quite a difficult day, as well,\" Zhongli softly interrupted.</p>\n<p>Pantalone seemed surprised by the former Archon's intervention and Childe was ready to leap to Zhongli's side should the despicable man tried to do anything--</p>\n<p>\"Understood. Do forgive my misdeed, Rex Lapis,\" Pantalone apologized kindly. <em>Too kindly</em>. So unlike Pantalone. He took Zhongli's hand in his and kissed the knuckle gently. Zhongli frowned as he took his hand from the man's caging grip.</p>\n<p>Pantalone wordlessly sent Childe a side-glance, looking so disgustingly smug.</p>\n<p>\n<em>...these people are here because they want to fuck with me.</em>\n</p>\n<p>But no. No bloodbath. At least not in Zhongli's precious tea shop. </p>\n<p>So Childe begrudgingly took his seat next to a passed-out Pedrelino and suffered quietly. </p>\n<p>That was until Zhongli went to his side and offered him a cute honey biscuit.</p>\n<p>\"Here, have a taste,\" Zhongli said, holding the sweet between his thumb and index finger.</p>\n<p>Childe stammered but did what was asked of him. He obediently took one bite of the biscuit. It melted on his tongue and the taste of sweetness exploded in his mouth. It was good. Just like everything Zhongli made.</p>\n<p>\"It's really good,\" Childe offered earnestly, tucking a loose bronze strand behind the other man's ear.</p>\n<p>Zhongli beamed at him. He returned to the kitchen to prepare more tea.</p>\n<p>All the harbingers were staring at Childe. Except for the still half-dead Pedrelino. He hoped Pedrelino choke on their saliva and die.</p>\n<p>\"...whore,\" Signora said to no one in particular.</p>\n<p>Childe sent her an obligatory glare.</p>\n<p>\"Takes one to know one,\" Scaramouche supplied happily. Capitano snorted.</p>\n<p>Signora froze his ear.</p>\n<p>Dottore looked so eager to cut Scaramouche's frozen ear open.</p>\n<p>Pulcinella breathed out in annoyance.</p>\n<p>Childe just wanted to be alone with Zhongli.</p>\n<p>--</p>\n<p>\"Welcome home, Childe.\"</p>\n<p>\n<em>Welcome home</em>\n</p>\n<p>Childe had to hide his grin. It was such a simple thing to say and yet it was the simplicity of it that made Childe truly happy. </p>\n<p>His heart soared. He felt like a fool. But why did it matter? Everyone in love was a fool. And Childe was fine with it.</p>\n<p>\"Yeah. I'm home,\" he replied.</p>\n<p>Zhongli put the newly bought trinket away and went to the front door, receiving Childe with a warm gaze.</p>\n<p>\"You don't visit me as much anymore.\"</p>\n<p>\"I have duties I must attend to, you know? Can't keep spoiling you. Besides, you might get tired from seeing me all the time,\" Childe jest.</p>\n<p>Zhongli shook his head. \"Never. I love looking at you, Childe.\"</p>\n<p>The harbinger could only stare helplessly at the other. Zhongli would be the death of him.</p>\n<p>He was about to enter when Zhongli tapped at his chest, pointing at Childe's boots. </p>\n<p>\"We've had a long conversation about this before. Boots off. No shoes allowed in this abode.\"</p>\n<p>Childe smirked. \"Whatever you say, <em>lyubimy.</em>\"</p>\n<p>Zhongli slanted his head but he offered no questions as he followed Childe into the living room.</p>\n<p>\"Stay here for the night, Childe,\" Zhongli asked him once Childe was done with his dinner. Zhongli was getting better at cooking, which he was glad for. </p>\n<p>Childe hummed. He crossed his legs on the floor cushion, resting his elbow on the low dining table. \"Again? The couch isn't too comfortable. And I keep forgetting to buy an extra mattress.\"</p>\n<p>Zhongli shook his head. \"You can use the bed.\"</p>\n<p>Childe arched a brow. \"Then where will you be sleeping?\"</p>\n<p>Zhongli smiled shyly. \"Beside you, of course.\"</p>\n<p>Childe swallowed. \"No. Bad idea.\"</p>\n<p>\"Why?\"</p>\n<p><em>Why,</em> he asked mindlessly when he sat across Childe, donning nothing but a long white blouse that reached only to his knees. His hair was loose, cascading. A curtain of molten gold behind him.</p>\n<p>Childe couldn't even tell if the man was wearing anything underneath. Didn't Zhongli feel cold? It was always snowing in Snezhnaya.</p>\n<p>Still.</p>\n<p>Sometimes it felt as if Zhongli was trying to <em>seduce</em> him.</p>\n<p><em>No</em>. Childe refused to share a bed with Zhongli when his thoughts swirled with the desire to have all of Zhongli to himself.</p>\n<p>\"Childe,\" Zhongli tried again, \"Please?\"</p>\n<p>Childe's chest tightened by the small voice. It was such an oddity to hear it from anyone around him, let alone from Zhongli. </p>\n<p>Zhongli, who had lived for thousands of years, untouched by time for so long, lived and lived and lived, and yet here he was, pleading, for something so simple.</p>\n<p>\"All right. Okay.\" Childe relented eventually. Anything to erase that crestfallen look from his face. </p>\n<p>Zhongli smiled and Childe felt whole again.</p>\n<p>--</p>\n<p>The bed was small. But it was big enough for the two of them.</p>\n<p>Childe laughed when Zhongli told him tales of his youth. Of his once-rebellious nature. Of Guizhong, his dearest friend. Of Barbatos being as free will as he was prone to enacting troubles. Before the war. Before losses. </p>\n<p>They snuggled closer. Limbs tangled under the sheet. Childe's heartbeats went haywire.</p>\n<p>\n<em>So close.</em>\n</p>\n<p>Zhongli looked at Childe in the eye. He smiled.</p>\n<p>He was always smiling. Childe loved that the most about Zhongli now. Would die to keep that bright look on Zhongli's face forever. </p>\n<p>Free of burdens now. Without duties forced upon him, drowning him.</p>\n<p>\"I'm sorry,\" Zhongli whispered suddenly. Childe brought him closer to his chest, inhaling the familiar scent from his beloved.</p>\n<p>\"It's fine.\" He didn't know what Zhongli was apologizing for but Childe had forgiven him a long time ago. The anger had faded away, as well, waned in time by Zhongli's ever-precious smile.</p>\n<p>\"I love you,\" Zhongli uttered suddenly.</p>\n<p>Childe gave the other a long stare. \"Urgh… like… love like… that?\"</p>\n<p>The corners of Zhongli's lips puckered upward. \"Like what, Childe?\"</p>\n<p>\"Like… you know? Like--\" Childe flailed his hands haphazardly in front of Zhongli.</p>\n<p>The former Archon chuckled. He seemed to understand what Childe was trying to say, which was good because words were nothing but a jumbled mess in his chest right now.</p>\n<p>Or maybe because there was nothing else in Childe's chest right now because the joy was pouring out from his skin, heating his cheeks and thundering his heart until Childe let out nothing but incoherent noises from his mouth.</p>\n<p>A harbinger, reduced to a lovesick fool.</p>\n<p>Being in love was so ridiculous.</p>\n<p>\"Yes, Childe. Like this--\" Zhongli waved his hands aimlessly, too, just to tease Childe. The harbinger pouted. <em>Pouted</em>. Him, pouting!</p>\n<p>\"Jerk,\" Childe said and kissed Zhongli on the lips. Zhongli laughed into the kiss. His hands were on Zhongli's cheeks, brushing the skin. Zhongli's fingers gripped Childe's shirt, slanting his face to allow Childe to savor everything that was readily given.</p>\n<p>They deepened the kiss and mortars of stars exploded in Childe's chest until they became fireflies. </p>\n<p>When they parted, Childe breathed the words on Zhongli's lips. \"I love you, too.\"</p>\n<p>--</p>\n<p>\"You should meet my family.\"</p>\n<p>\"Certainly. I'd love to meet my future relatives,\" Zhongli said with a straight face.</p>\n<p>Childe guffawed. \"Not so fast, <em>lyubimy</em>. I haven't picked the rings, yet. Or in your case: chopsticks. Thought I wouldn't catch the meaning behind that gesture, huh? I tried to figure out whether you were aware of the meaning behind your gift or not.\"</p>\n<p>And Zhongli? Zhongli's mouth turned up into a pleased grin. Childe rolled his eyes. Of course, Zhongli was aware. </p>\n<p>Maybe Zhongli was chasing him all this time. Childe was the only one who didn't look back.</p>\n<p>\"You still keep the chopsticks?\"</p>\n<p>\"Of course. It cost me a hefty amount of mora,\" Childe teased.</p>\n<p>He offered his lover his hand and Zhongli eagerly took it, letting Childe tuck him in his arms, wasting a few moments together until it was finally time for Zhongli to open his tea shop and for Childe to serve his Archon.</p>\n<p>For now, they were together. Light spilled in a flood from Zhongli's eyes and Childe's tapped their foreheads together.</p>\n<p>Their hearts were friends, lovers, and soulmates that had warmed each other through many winters together.</p>\n<p>--</p>\n<p>Zhongli had lived in Snezhnaya with him nearly a year now and Childe sincerely believed nothing could surprise him anymore. Not if it involved Zhongli.</p>\n<p>Yet, here Childe was, coming into a sudden halt once he entered the tea shop.</p>\n<p>His whole family was there.</p>\n<p>\"Ajax!\" His mother called out, unmindful of the other customers, \"Ajax, you foolish boy! Why didn't you tell me your boyfriend is so very beautiful!\" She admonished him. </p>\n<p>\"I'm with mom. Look at him. <em>Tsaritsa</em>, Zhongli, what's your secret behind this smooth skin?\" Childe's older sister inquired as she pinched Zhongli's reddened cheek.</p>\n<p>His lover merely gave Childe an apologetic glance, trapped between Childe's parents and older sister as they bombarded him with questions; looking, for the very first time, utterly lost on what to do.</p>\n<p>Childe's older brother took a sip of his tea, deliberately looking Childe in the eye. And then he gave Childe a thumbs up with a stoic expression and said nothing else.</p>\n<p>Childe's younger siblings just stared at Zhongli in awe. </p>\n<p>The other customers silently stared at the harbinger.</p>\n<p>Childe only gave them an awkward smile in return.</p>\n<p>\"Now, Ajax, sit down and tell me what's this about engagement and chopsticks,\" Childe's father stated.</p>\n<p>Childe exhaled. Loudly. Wow. Okay. Where to start.</p>\n<p>--</p>\n<p>They held the wedding in Liyue a year later. A small gathering with only family members and closest friends invited.</p>\n<p>It wasn't a surprise Xiao was there. So was Barbatos. Zhongli had wanted both of them to be there.</p>\n<p>\n<em>(\"Are you happy?\" Xiao asked.</em>\n</p>\n<p>\n<em>\"Very,\" Zhongli answered softly. </em>\n</p>\n<p>\n<em>\"I see. I shall guard your joy with all of my might. As always,\" Xiao vowed.)</em>\n</p>\n<p>Like his husband, Zhongli wore a red Tang suit. His long hair was tied neatly, swishing in the wind as he twirled together with Childe.</p>\n<p>They were laughing, dancing artlessly, no directions to guide them but they kept drawing each other closer and closer till there was no space in-between them.</p>\n<p>Childe's heart kicked in, restarted, and the joy overflowed from his mouth each time he kissed his husband chastely.</p>\n<p>\"Husband,\" Zhongli said. A playful glint in his eyes.</p>\n<p>\"Husband,\" Childe responded with a grin.</p>\n<p>Childe would hold on to the privilege of loving Zhongli until the end of time. Until his life was no more.</p>\n<p>In the sunlight, Zhongli was smiling.</p>\n<p>--</p>"
}