{
  "id": "27723368",
  "url": "https://archiveofourown.org/works/27723368?view_full_work=true",
  "author": [
    "ShanaStoryteller"
  ],
  "title": "By Any Other Name",
  "rating": "Not Rated",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "陈情令 | The Untamed (TV)",
    "魔道祖师 - 墨香铜臭 | Módào Zǔshī - Mòxiāng Tóngxiù"
  ],
  "relationships": [
    "Lan Zhan | Lan Wangji/Wei Ying | Wei Wuxian",
    "Jiang Cheng | Jiang Wanyin & Wei Ying | Wei Wuxian"
  ],
  "characters": [
    "Wei Ying | Wei Wuxian",
    "Lan Zhan | Lan Wangji",
    "Jiang Cheng | Jiang Wanyin",
    "Jin Ling | Jin Rulan",
    "Lan Yuan | Lan Sizhui",
    "Lan Huan | Lan Xichen",
    "Lan Jingyi"
  ],
  "additional_tags": [
    "Mix of CQL and MDZS",
    "Identity Porn",
    "Wei Wuxian has an atypical relationship with gender",
    "tfw you're using a secret identity on top of your secret identity",
    "and get cock blocked from your true love because everyone thinks you're engaged to your brother",
    "tfw you were convinced you could only ever love one person and fall in love with somone else",
    "and angst about it",
    "because you don't know that actually they're the same person",
    "now somebody told me you had a girlfriend",
    "who looked like a boyfriend that I had in february of last year",
    "would have been the title but it's too damn long"
  ],
  "language": "English",
  "series": "",
  "published": "2020-11-26",
  "completed": "2020-12-27",
  "words": "31,828",
  "chapters": "4/4",
  "comments": "1,795",
  "kudos": "16,858",
  "bookmarks": "6,396",
  "hits": "199,220",
  "summary": "<p>Wei Wuxian wakes up in Mo Xuanyu's body and heads straight for Lotus Pier. Wu Yingtai is the newest member of the Jiang Clan and rumored to be the future wife of Jiang Wanyin. </p>\n<p>Lan Wangji is not in love with her.</p>",
  "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>title is from romeo and juliet. \"What's in a name? That which we call a rose by any other name would smell as sweet.\"</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">more notes</a>.)\n</p>\n<p>next time wei wuxian and jin ling run into the other juniors and lan wangji in yi city!</p>\n<p>i hope you liked it!</p>\n<p>feel free to follow/harass me at: shanastoryteller.tumblr.com</p>\n<p>yi city took longer than i thought it would, so we have one more chapter</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>sizhui's subconscious: that's your parent!! that's!! your! PARENT!!! and one time he left and didn't come back for thirteen years so you shouldn't let him do that again</p>\n<p>meanwhile lan xichen is seriously considering picking up a drinking habit</p>\n<p>next time, jiang cheng and wei wuxian as wu yingtai attend the cultivation conference in jin tower!</p>\n<p>i hope you liked it! feel free to follow / harass me at: shanastoryteller.tumblr.com</p>\n<p>i know i've said it before but i really mean it this time: one more chapter</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>nie \"i cause problems not solutions\" huaisang: oh no it seems mo xuanyu's ritual failed. guess i'll have to devise some sort of equally chaotic way to expose jin guangyao<br>wei \"gender is a side dish not a main course\" wuxian: huaisang you ignorant slut</p>\n<p>anyway nhs clocks wwx in mxy's body pretending to be wyt like the second he sees him and is like. well. whatever happens happens </p>\n<p>pour one out for wen ning, eternally cursed to have a front row seat to wangxian nonsense</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">notes</a>.)\n</p>\n<p>is it even a party if jin ling doesn't stab an uncle?? i think not</p>\n<p>was that supposed to be a serious moment? yes. but if all you could think of was that very funny scene in the punisher where pretty much the same thing happens - me too tbh</p>\n<p>the jiang disciples all try and do shocked pikachu face when wwx's identity is reveled but they're not very good at it. everyone knew. he openly carried chenqing on lotus pier and jc wouldn't tolerate this level of bullshit from anyone less than family. </p>\n<p>lwj has accepted that loving wwx means also loving his undead best friend and jc. the latter is a lot harder for him to deal with, but he's getting there. slowly. </p>\n<p>lwj is very busy spending time with the love of his life and their son and learning not to hate jc, so he can't act as sect leader or be chief cultivator. this means lxc doesn't get to go in seclusion, but considering lwj was whipped 33 times and forced into three years of seclusion as punishment and then went around being a perfect lan for the next decade anyway, i'd say his debt to his clan is paid with interest. </p>\n<p>nhs didn't even manipulate lxc into killing jgy this time, so lxc does have him to lean on. the next time they're all in one place wwx is like i know it was you bitch. and nhs is just like oohhh hohohoho what on earth are you talking about?? no one would ever believe you. glad you're back from the dead, which i definitely didn't have anything to do with, but if i did, you're welcome and exposing my secrets would be a terrible thank you, so keep that in mind</p>\n<p>anyway, that's the end!! obviously this ended up being WAY longer than i anticipated, and thank you so much for all your kind messages for keeping me motivated! i hope you like the ending!!</p>\n<p>feel free to follow / harass me at: shanastoryteller.tumblr.com</p>",
  "text": "<p>Wei Wuxian wakes up in a body that isn’t his that has four curse marks on his arm in a place he doesn’t know. His thoughts are shaky and fractured. He looks at the array he’s woken up in and the notes scattered around and understands that whoever did this acted too soon, that they should have waited a couple more months if they wanted the celestial alignment to be perfect, but they didn’t, and now he’s panicking and confused and he doesn’t think, only feels. There's a thrumming in his chest that almost feels like a golden core, then doesn't, back to emptiness, and the sensation of it leaving over and over again is going to drive him mad if he's not already.</p>\n<p>He breaks out of the miserable little room with ease and runs without thinking of the direction, all his emotions too close to the surface, like they wouldn’t have been if this Mo Xuanyu had just waited a little longer.</p>\n<p>This is how he finds himself sneaking into Lotus Pier, stumbling to the main hall, freezing and dirty and not totally sure how he made the journey, and not coming back to his body until there are fingers around his wrist and his brother’s furious eyes are glaring at him. “Who are you? What the hell are you doing here?”</p>\n<p>They’re alone, almost, a teenager in Jin colors standing to the side with his sword drawn, but Wei Wuxian can’t focus on that now. “Jiang Cheng,” he says, voice cracking. “I don’t understand what’s happened. I don’t know why I’m here, I,” he wilts, pressing his head to Jiang Cheng’s shoulder, and for some reason he lets him. “I wasn’t supposed to come back and everything <em>hurts</em>.” Not physically, although he’s not doing great there either, but deeper, in his bones and his chest.</p>\n<p>There’s a moment of silence, then, “Wei Wuxian?”</p>\n<p>“Don’t pull your blow this time,” he begs. “It hurts so much, didi, just make it stop.”</p>\n<p>“Wei Wuxian,” he says again, and there’s the anger, but it’s not alone, mixed with grief and outrage and a tenderness that he never thought he’d hear again, “you came home.”</p>\n<p>He really can’t be blamed for passing out then.</p>\n<p align=\"center\">~</p>\n<p>Jin Ling has heard a lot of terrible things about Wei Wuxian, has watched his uncle torture and rage against every demonic cultivator he’s come across, so he’s unprepared for his uncle’s reaction to the real thing.</p>\n<p>He’s even more unprepared for the discovery that Wei Wuxian’s golden core is now in Uncle’s chest, but at least he’s not alone in that. It all comes out after that, when Wei Wuxian wakes up and Uncle confronts him about his lack of golden core, and the whole truth comes tumbling out of his mouth, his eyes so wide and his body trembling like he’s not even sure of what he’s saying, and then he passes out again, and –</p>\n<p>And it makes it very hard to hate him, is the thing, especially when he wakes up again and is more settled and horribly embarrassed and smiles at Jin Ling like he’s the most precious thing in the world even when calling him a brat. Uncle and Wei Wuxian have several more arguments behind closed doors after that, and slowly the tension Uncle has always carried around starts to ease, and, well.</p>\n<p>Jin Ling likes him, this other uncle he’s been taught to hate, who’s not what anyone thought he’d be or like the stories he’s been told, now that he can see how Uncle loves him so much even when he tries to hide it behind rage, now that he sees Wei Wuxian can read Uncle easily, like no one but Jin Ling has seemed to ever be able to do.</p>\n<p align=\"center\">~</p>\n<p>The problem, Jiang Cheng decides one week after Wei Wuxian’s return, is that they’re hiding two different people. Wei Wuxian, obviously, who is in another person’s body and so should be able to keep his identity a secret easily enough unless he does something stupid. But they’re also hiding Mo Xuanyu, who ran away from his family and who people will certainly notice and recognize.</p>\n<p>He digs out a chest of A-jie’s things, stuff she hadn’t taken to Jin Tower because she knew she wouldn’t be able to use them. He’d never been able to get rid of them, and figures that this will cover all the things that get tangled in his throat whenever he tries speak them out loud.</p>\n<p>He drops the chest in front of Wei Wuxian and says, “Here. This should work.”</p>\n<p align=\"center\">~</p>\n<p>Wei Wuxian has four curse marks and a soul that isn’t settling quite right into his body, which is an uncomfortable experience, and a golden core that keeps disappearing, which is a horrifying one. It's there, most of the time now, except for when it's not. Personally, he’s never much cared for his body, or the things associated it, which Jiang Cheng knows and is probably why he’d suggested disguising him as a woman. If he were like Jiang Cheng, or Jin Ling, or most people, that would be a problem, or grating, or stressful, or whatever. But Wei Wuxian is Wei Wuxian, and that’s true whether he’s wearing a dress or called a boy or a girl or answers to Lady or Master, so he’s not much bothered about it either way. He’d never expected his apathy about his body to be tested to the point where he’s literally in another person’s body and he’s not pleased about it. He also doesn’t love answering to a name not his own, but Jiang Cheng calls him A-Ying, which helps.</p>\n<p>He wants his body to be <em>his</em>, not someone else’s. He hopes this body will feel more like it belongs to him once they figure out how to get his soul settled.</p>\n<p>Nothing in the Jiang library is any use. In spite of containing the largest library on demonic cultivation, which Jiang Cheng keeps under lock and key and only three people know about. Apparently he confiscates any books the demonic cultivators he captures have on them, but it’s all utterly useless since it’s all just derivative of his own work.</p>\n<p>He founded demonic cultivation in three months and no one else has had an original thought in thirteen years. “Although,” he tells Jiang Cheng, “I suppose the good ones are the ones you don’t catch.”</p>\n<p>“What a cheery thought. Shut up,” Jiang Cheng says, absently feeding spiritual energy into him while frowning at a scroll.</p>\n<p>They have to figure something out. Mo Xuanyu’s body wasn’t particularly strong, especially compared to his last one, but it certainly shouldn’t be as weak as this. But things aren’t <em>settling</em> properly, probably because the ritual was done about two months too early. Which means the optimal time to fix, it will be then, which is only a couple weeks away from now, and he’s no closer to figuring out how. “We should try the Gusu Lan library. I actually figured out most of the theory in their library while I was supposed to be working on lines.”</p>\n<p>“I don’t want you near the Lans,” Jiang Cheng says bluntly.</p>\n<p>Wei Wuxian thinks of Lan Zhan without meaning to. He knows that Lan Zhan hated him in the end, and the beginning, but that there was a middle bit there where he thinks they did alright.</p>\n<p>He misses him. He wants to see him. Maybe this is the only way he’ll be able to see him, wearing a face that doesn’t seem to be quite his own, under the disguise of a lady from the Yu mountains and not as himself.</p>\n<p>“If we’re going to figure this out, I don’t think we have a choice,” he says honestly.</p>\n<p>His brother scowls but, for once, doesn’t argue.</p>\n<p align=\"center\">~</p>\n<p>Lan Xichen has heard rumors that Jiang Wanyin has been courting a young lady, some new addition to the Jiang clan from the same place his mother was from, but since that goes against mostly everything he knows of Jiang Wanyin, he dismissed it. After granting Jiang Wanyin’s request to come to Cloud Recesses to make use of the Lan library for a research project and to iron our several details for the upcoming cultivation conference, he decides that may have been a mistake. Jiang Wanyin doesn’t show up alone.</p>\n<p>Not that Lan Xichen had expected him to show up alone, exactly, since he’s a sect leader here on official business, and that always involved some sort of retinue, but it’s who he shows up with, exactly.</p>\n<p>There is a young woman. She walks at his side, as if they’re equals, her voice low and raspy but bright. She has dark brown wavy hair that she wears mostly down, only two strands on either side pulled back from her face, no ribbon in her hair although there’s one around her throat. Her robes seem familiar to him, although he can’t place why. She’s too skinny, which isn’t an aesthetic observation so much as a medical one and she has her hand on Jiang Wanyin’s arm as they climb. He doesn’t think it’s a coincidence that Jin Ling is walking directly behind her, his brow furrowed. Should she slip and fall, he’ll be able to catch her easily.</p>\n<p>Her chatter stutters to a stop when they get closer and her dark grey eyes meet his squarely. “Zewu Jun,” Jiang Wanyin says, giving him a slight bow that the woman echoes. It’s telling that the disciples and Jin Ling don’t bow until she does. “Thank you for your hospitality.”</p>\n<p>“And your library!” the woman pipes up, a large grin stretching across her mouth.</p>\n<p>“Can’t we at least get the introductions out of the way before you embarrass me?” Jiang Wanyin snaps harshly.</p>\n<p>Lan Xichen startles but the woman just laughs. “You just make it so easy, A-Cheng!” He hasn’t heard anyone call Jiang Wanyin that since his sister’s death. Before he can formulate any sort of response to this, she bows to him again and says, “I am Wu Yingtai. It’s a pleasure to meet you, Zewu Jun. Thank you for your hospitality.”</p>\n<p>“It’s no problem,” he says, but he’s distracted enough that his mouth is speaking mostly on its own. He recognizes her robes.</p>\n<p>They’re Jiang Yanli’s. Jiang Wanyin has given his beloved sister’s clothes to this woman.</p>\n<p>Maybe he <em>is</em> courting her.</p>\n<p align=\"center\">~</p>\n<p>Lan Wangji knows that Jiang Wanyin is here with some of the Jiang disciples. That he’s here on actual business and so that one of his disciples can make use of the Lan library, all proper and acceptable, but it still makes him burn. He elects to take his meals at home rather than the deal with that, which he can get away with doing for everything but dinner.</p>\n<p>His mind is on the upcoming meal which is why he doesn’t notice someone running by and then running into him. They bounce off his side and he reaches out automatically, his arm curling around a concerningly slim waist to keep them from falling to ground. “Oh shit, I’m sorry,” says an unfamiliar voice with a familiar cadence that leaves his whole body cold and makes his arm tighten without his permission. He looks down and equally shocked grey eyes stare up at him. “Lan – um, I mean, Hanguang Jun, I was just, um. Hello.”</p>\n<p>He abruptly realizes that this is entirely improper. He’s holding her against his chest. He lets go of her and takes several steps back. “Hello. I apologize.”</p>\n<p>“What?” Her nose scrunches up and there’s a deep ache in his chest. “That was totally all my fault, don’t apologize. You saved me from tripping and getting mud all over me! Although maybe that would be an improvement on the ink, A-Cheng is going to give me such a bitchy look about this, which, whatever, I’ll be able to get it out later.”</p>\n<p>He looks at her less closely, mentally stepping back so he’s not getting lost in details that may be similar but are not the same. It’s a disservice to pretend otherwise. She does indeed have ink staining her hands and her sleeves, and drops of it across the bottom of her robes, somehow. Her clothes are a pale lavender and there’s a silver lotus bell in her belt. “You’re with the Jiang.”</p>\n<p>“Hm? Oh yeah, of course, me and Jiang Cheng are friends.” There is something in the way she says that, like it’s not a lie but not the whole truth, but he’s entirely uninterested in Jiang Wanyin’s business so he doesn’t care.</p>\n<p>“There is no running in Cloud Recesses,” he says instead.</p>\n<p>She blinks at him then bursts out laughing, a bigger sound than it seems like could come from her small body. “Ah, Hanguang Jun, my apologies. Shall I copy the rules a hundred times to make up for this grand transgression? I was only trying not to be late to dinner. I lose track of time when I’m researching.”</p>\n<p>This woman is strange. She’s not inappropriate, exactly but she’s far too familiar with him. Not technically crossing any boundaries, but people do not talk at him like this, warm and joking. No one has spoken like this to him in thirteen years and abruptly he hates her with a ferocity he knows is unfair and misplaced, but he doesn’t have anywhere else to put it. “Excuse me,” he says, cold and too brusque, moving past her and not offering to walk her to the dining hall like he would have if she were anyone else, if she had not committed the grand and unknowable offence of reminding him a little bit too much of Wei Ying when he hadn’t been prepared for it.</p>\n<p>He will simply avoid her. It won’t be difficult, surely.</p>\n<p>Except, perhaps it will. She arrives several minutes after him, her hair a disarray and her face pale, but instead of going to sit with the other Jiang disciples at the lower tables, she drops in the empty seat between Jiang Wanyin and Jin Ling. “Sorry, sorry! You don’t have to yell at me, I already know the lecture. Look, I’m not late, am I, Zewu Jun?”</p>\n<p>Jiang Wanyin’s mouth thins into a sharp line, but he says nothing, while Jin Ling bites on the inside of his cheek to keep from laughing.</p>\n<p>“You are not, Lady Wu,” Xichen says, formal but with a lilt to his voice that mean he’s genuinely amused.</p>\n<p>“If you’re letting me paw through your books, you have to call me Wu Yingtai,” she scolds, and her breath is still coming too quickly. It should have evened out by now, and her face is still pale rather than flush. Lan Wangji feels guilt squirm uncomfortably in his stomach. She is not in good health and had not been truly discourteous to him. He should have escorted her here.</p>\n<p>She turns to him. It seems as if his rudeness is going to have consequences, but now that only seems fair. She’s not some random Jiang disciple, is clearly of some import to be seated with them at Jiang Wanyin’s side, and he’s quite sure his failing is about to be pointed out in front of everyone.</p>\n<p>But instead she only smiles at him, teasing and warm, and says, “See, Hanguang Jun? You didn’t have to run to make it on time. Don’t you that know running is forbidden in Cloud Recesses?”</p>\n<p>His lips part in surprise. She should be angry at his rudeness, but instead she’s teasing him.</p>\n<p>Jiang Wanyin pinches the bridge of his nose and grinds his teeth together. “A-Ying, <em>please</em>.”</p>\n<p>The bell sounds for the beginning of the meal and she whispers, “No talking during meals, A-Cheng,” before picking up her chopsticks.</p>\n<p>Jiang Wanyin is furious while Jin Ling is delighted.</p>\n<p>Lan Wangji faces forward and does his best not to notice her. He feels his brother and uncle’s gaze on him, and doesn’t want to know what’s there, so he does his best to ignore that as well.</p>\n<p>He’s partially successful.</p>\n<p>Wu Yingtai leans over to put several pieces of her meal onto Jin Ling’s plate, who glares before leaning over and scooping half his rice into her bowl in retaliation. The bowl isn’t meant to hold one and half servings of rice, so it makes a bit of a mess, but Wu Yingtai only looks fond.</p>\n<p>She eats her food slowly, but not in a way that lends itself to elegance or manners. Her lips twitch into an almost grimace several times and Lan Wangji wonders if anyone thought to tell her of the food here. Even eating slowly, she puts her chopsticks down before everyone else.</p>\n<p>“A-Ying, you have to eat,” Jiang Wanyin says, speaking low enough that his voice doesn’t carry further than their table. Uncle twitches, but it’s an important enough sentiment that he doesn’t interrupt. Lan Wangji remembers how slight she had felt against him and, against his wishes, finds himself agreeing with Jiang Wanyin.</p>\n<p>She smiles and shakes her head, pressing a finger to her lips to remind him of the rule.</p>\n<p>“Aunt Ying,” Jin Ling says, and Xichen and Uncle raise their eyebrows in unison, “what’s wrong? You ate when we were in Lotus Pier.”</p>\n<p>She looks around at them and her shoulders slump. Her face is vaguely apologetic when she whispers, “Ah, it’s just hard to, well, this bo- my body doesn’t like to eat food that doesn’t … taste good.” She glances at his brother and says, “Sorry Zewu Jun.”</p>\n<p>Jiang Wanyin’s face goes thunderous. He silently does what she’d done for Jin Ling, moving food from his plate to hers. It takes Lan Wangji a moment to realize that Jiang Wanyin is seeing what food is missing ftom her plate, what she’d found palatable enough to eat, and giving her his own portions. Jin Ling seems to figure it out a beat later, because he begins doing the same. Wu Yingtai begins waving her hands over her plate to dissuade them, but they simply move around her, and she gives in.</p>\n<p>She buries her face in her hands, face red, but her smile covers half her face when she lowers them.</p>\n<p>It takes Lan Wangji another moment to realize he’s staring. He pointedly looks down at his own plate and doesn’t look up again until the meal ends.</p>\n<p align=\"center\">~</p>\n<p>“You need to leave Lan Wangji alone,” Jiang Cheng snaps, pacing in Wei Wuxian’s rooms. Wei Wuxian almost points out that, considering how late it is, this is really only going to fuel the rumors that Wu Yingtai and Jiang Cheng are courting, but since he’s not even sure if his brother has heard those rumors, decides to let it lie.</p>\n<p>Wei Wuxian sighs, stripping off the day’s robes so he can work on getting all the stains out. “I know, I know, I didn’t – it’s just automatic!” He pauses. “Do you really think he still hates me?”</p>\n<p>Jiang Cheng is quiet for a long time, enough that Wei Wuxian is almost nervous. “I don’t think he hates you,” he says finally. “His actions of the past thirteen years don’t really match up with that of a man who hated you. But I can’t read him, not really. I’ve never been able to. I don’t want to have to fight the whole Lan clan, A-Ying.”</p>\n<p>Wei Wuxian hides a smile. Sometimes, Jiang Cheng pretends to slip up and calls him A-Ying when they’re alone together.</p>\n<p>He’s going to call him on it any day now, as soon as it stops making his chest feel so warm.</p>\n<p align=\"center\">~</p>\n<p>The Jiang have been here a week the first time Sizhui meets Lady Wu outside of a formal setting.</p>\n<p>He and Jingyi are sitting under a tree, working on a night hunt proposal, when there’s a crash, someone saying, “Oh, fuck,” from nowhere, and then a young woman literally falling out of the sky onto their laps.</p>\n<p>Jingyi gets kicked in the stomach but Sizhui ends up with her back against his chest, her hair over his shoulder. “Are you alright?”</p>\n<p>Lady Wu blinks up at him, leaves in her hair, talisman paper crumpled in her fist and a brush tucked behind her ear. “I’ve got to stop meeting Lans like this.”</p>\n<p>“Do you fall out of a lot trees?” Jingyi wheezes, rubbing his stomach and glaring.</p>\n<p>“Oh, all the time,” she says cheerfully. “It turns out I don’t have the upper body strength I used to, so it’s really the only way to get down.” She lifts an arm as if to demonstrate and Sizhui is alarmed to realize it’s shaking. “You’d think it would have been getting up that would do it, since that’s objectively harder, but I suppose that’s the thing about limits, huh? Sometimes it’s not the hard stuff that trips you up.”</p>\n<p>Jingyi stares. “Why were you up in the tree in the first place?”</p>\n<p>“Just needed a place to think, really,” she says. “It’s so hard to find a quiet place to think in this place!”</p>\n<p>It takes a couple seconds of staring to notice her twitching lips. “You’re joking,” he decides.</p>\n<p>She laughs and stuffs the talisman paper in her robe. “I am joking. Thank you very much for being here! I’m grateful to you for cushioning my fall. A-Cheng and A-Ling would have thrown a fit if I’d broken something.”</p>\n<p>Sizhui contemplates having to tell Sect Leader Jiang that his … whatever Lady Wu is had been injured and says, “I’m grateful too.”</p>\n<p>Lady Wu snorts and pokes his shoulder. “He’s not that scary, I promise, he’s really a big softie.”</p>\n<p>By silent, mutual agreement, he and Jingyi don’t respond to that because there’s no response they could give that wouldn’t break some sort of rule. “Let us take you to the healers, just in case,” Sizhui says.</p>\n<p>Since she’s lying on top of him, Sizhui feels how she tenses at that suggestion. “Ah, thank you, but I’m fine, really. We don’t need to go making a fuss. What are you kids working on? Maybe I can help.”</p>\n<p>“Are you a cultivator?” Jingyi asks. Sizhui should probably scold him, but he wants to know too.</p>\n<p>She hums and makes a face, finally shifting off of them to lean against the tree trunk. “Of a sort. I used to be stronger. If you want to get up and fight, I won’t last very long.”</p>\n<p>“We don’t want to fight you,” Sizhui says hastily. “We’re doing night hunt proposals for Master Lan.”</p>\n<p>“Theoretical or actual?” she asks, leaning forward in interest. “Punishment or reward?”</p>\n<p>“Theoretical and punishment,” Jingyi sighs. “Master Lan thought we were too reckless on the last night hunt.”</p>\n<p>“We <em>were </em>too reckless on the last night hunt,” Sizhui corrects. When his father had gotten the report, his eyes had pinched briefly like only happened when he was worried and then he’d had Sizhui take his meal in the Jingshi rather than with the other disciples.</p>\n<p>Lady Wu smiles, tilting her head back. There are dark bruises under her eyes. “Yes, Lans are a notoriously reckless sort. Tell me about this night hunt. Both the real one and the theoretical one. I like the implication of being too reckless, it means there’s an acceptable amount of recklessness.”</p>\n<p>“Well it is a night hunt,” Jingyi says in what he probably thinks is a reasonable tone before launching into the story.</p>\n<p>Lady Wu is a good audience. She follows along and never looks bored, asking questions that show she’s really listening. She’s clever too, her insights strange and sideways and brilliant, nothing Sizhui would have thought of even though they make total sense. He can tell Jingyi agrees, his eyes wide as Lady Wu sketches out the ideal array for their theoretical night hunt, not just showing them but explaining the theory behind each bit of it as she draws it, not a reference book in sight.</p>\n<p>He’s not sure it matters that Lady Wu can’t fight with a sword. It seems like she has half the world’s cultivation knowledge at her fingertips.</p>\n<p>The sun is starting to dip below the trees by the time they run out of paper and Lady Wu seems just as disappointed as they are that they can’t continue. “Dinner’s soon,” Sizhui says. “We’ll walk you to the dining hall.”</p>\n<p>“You miss one meal,” she gripes, but obligingly gets to her feet. She seems fine now, but Sizhui can’t get the memory of her shaking out of his head, so he offers her his arm anyway. She smiles, crooked and small but, he thinks, real, and says, “You Lans are so sweet,” before taking his arm.</p>\n<p>He smiles when she leans into him, continuing to trade talisman ideas back and forth with Jingyi. He can’t explain it, but something about Lady Wu almost feels familiar. Safe, even, like how he feels around his father.  </p>\n<p align=\"center\">~</p>\n<p>Lan Wangji enters the library, sees Wu Yingtai pulling books off the shelves, and resolves to come back later. Just as he turns to leave, she jumps to try and grab a book slightly out of her reach, but manages to unbalance the whole shelf just enough that it tips forward.</p>\n<p>The image of her small, frail body crushed underneath the heavy bookshelf flashes through his mind and he’s moving without thinking, but he’s too late.</p>\n<p>By the time he’s there, reaching out a hand to steady the bookshelf, she’s drawn a quick talisman in the air and flicked it forward, freezing the shelf in place, half fallen.</p>\n<p>She blinks, looking up at him, surprised to suddenly find him by her side but not startled. “Hanguang Jun, are you alright?” She follows his hand, sees it hovering right in front of the talisman, and she’s grinning at him, brighter than the sun. “Aw, were you coming to help me? So kind!”</p>\n<p>“You have an impressive knowledge of talismans,” he says instead of addressing that, carefully moving the bookshelf back into its former position.</p>\n<p>“Well, I prefer not to be completely useless,” she says, and her tone is still light but something about it makes him flinch. “Talismans aren’t dependent on a strong golden core, just your memory and imagination.”</p>\n<p>Sometimes whole hours pass without him thinking of Wei Ying, but usually not much more than that. He doesn’t understand why thinking of Wei Ying while looking at this woman hurts the way it does, like jabbing a bruise rather than merely pressing on it. He endured thirty three lashes, he can handle this.</p>\n<p>He took his own lack of control out on her once. He will not do so again.</p>\n<p>“I see,” he says.</p>\n<p>She steps closer to him, until they’re nearly chest to chest, and its a struggle not to put distance between them once more. He should, he knows, but something about the way she’s looking at him feels like a challenge.</p>\n<p>He does not rise to bait easily, but for some reason he doesn’t want her to see him falter. “Ah, Hanguang Jun is so tall,” she whines, curling her hair around her finger and pouting her lower lip, a look that is not altogether displeasing but would be utterly distasteful if she wasn’t clearly two seconds away from laughing at herself. “Won’t you stay and help me pick books off tall shelves? I’m so little, Hanguang Jun, I need a big strong man to help me.”</p>\n<p>The way she’s biting her lower lip almost hard enough to draw blood ruins even the illusion of seriousness. “I will retrieve Sect Leader Jiang for you.”</p>\n<p>“Lan – Hanguang Jun!” she gasps. It’s the second time she’s slipped up on his title. He would not mind if she called him Lan Wangji, especially when she insists that he call her Wu Yingtai, but it feels like a form of surrender to tell her that. “You would leave me here all alone? What if another bookshelf tries to kill me?”</p>\n<p>“They don’t attack unless provoked,” he says blandly.</p>\n<p>He’s completely unprepared for the bright peal of laughter that elicits from her and he feels his face softening without his permission. Not many people are willing to laugh at him, not like this, genuinely rather than as an attempt to manipulate him.</p>\n<p>“You’re so funny Hanguang Jun,” she gasps, wiping tears from her eyes. “You really won’t stay and help me?”</p>\n<p>He did make her walk to the dining hall alone when they met and she’s clearly capable of hurting herself if left alone in the library. “Very well.”</p>\n<p>Wu Yingtai’s smile does something to the space underneath his breastbone.</p>\n<p>He wishes it didn’t.</p>\n<p align=\"center\">~</p>\n<p>Lan Xichen doesn’t know if wants to laugh or cry or simply lay his head on his desk and pretend none of it is happening. The last approach seems the most appealing, but it’s the one that Uncle has taken, which means it’s probably off the table for him.</p>\n<p>Wangji doesn’t seem to have figured it out yet, but for the first time in a long time someone has gotten under his skin. It would be delightful news, a welcome relief from thirteen years of heavy grief, if not for one thing.</p>\n<p>The woman that has caught his brother’s attention is Jiang Wanyin’s fiancé.</p>\n<p>No one has said that, of course, no official announcements have been made and no one has caught them doing anything inappropriate. But at this point an official announcement seems almost superfluous.</p>\n<p>Jiang Wanyin gives her the food off his plate. They spend long hours alone together. The Jiang disciples treat her with the utmost respect despite her not holding a specific position within the clan or even being powerful enough to carry a sword. Jin Ling refers to her as his <em>aunt</em>. If that weren’t enough, seeing them together more than does it. Jiang Wanyin has never met a positive emotion he couldn’t express through harsh, loud criticism, sure to scare off anyone but his nephew, but she only laughs at him and pats his arm, darting out of the way when threatens to strangle her.</p>\n<p>They love each other, clearly and obviously, and Lan Xichen believes in different circumstances he would be capable of being pleased for Jiang Wanyin’s happiness.</p>\n<p>But Wu Yingtai has caught more than just Jiang Wanyin’s attention.</p>\n<p>Wangji keeps looking at her, keeps spending time with her, and it may seem like such small things to people who do not know him, but Lan Xichen knows him.</p>\n<p>There is no way for this to end well.</p>\n<p>Jiang Wanyin knows of the time Wangji spends with Wu Yingtai because she, to her credit, does nothing to hide it. Jiang Wanyin goes stormy and furious, as he always does around Wangji, but Lan Xichen doesn’t believe Jiang Wanyin has figured out that Wangji feels anything but polite courtesy for Wu Yingtai.</p>\n<p>If he had, Lan Xichen imagines that all of Cloud Recesses would have heard of it.</p>\n<p>When a request for aid comes in for Mo Village, it seems a perfect thing to send his brother and the juniors on, so they can at least spend one dinner where without Wangji’s attention straying to Wu Yingtai every few minutes.</p>\n<p align=\"center\">~</p>\n<p>Wei Wuxian considers it a bit of good luck that Lan Zhan and the nosiest of the juniors get sent off on a night hunt just when they need to attempt an array powered by demonic cultivation in the middle of Cloud Recesses.</p>\n<p>“Are you sure this is going to work?” Jin Ling asks. “It looks like a mess.”</p>\n<p>“A-Ling!” Jiang Cheng snaps, then looks down at the array that Wei Wuxian is busy drawing in his own blood, and says, “He does have a point.”</p>\n<p>“Who’s the expert here?” he demands, leaning back to survey his handiwork. “Honestly, I get no respect around here.”</p>\n<p>“Oh, respected elder brother,” Jiang Cheng intones, “what the fuck is this?”</p>\n<p>He snorts, but just says, “It should fix what Mo Xuanyu did,\" rather than getting into a technical explanation that neither of them could follow. Well, Jiang Cheng could, maybe, but it would either confuse or frighten Jin Ling, so he doesn't bother.</p>\n<p>“Will it make you less sick?” Jin Ling asks, not quite able to hide his worry under his scowl.</p>\n<p>He pokes him hard in the cheek and he doesn’t even try and break his hand. He really is worried. “Yes. This body isn’t exactly strong on its own, but it’ll be better, after.” He’s made it stronger these past couple months, it’s just that it’s impossible to tell thanks to the botched demonic cultivation soul transfer.</p>\n<p>He makes his brother and nephew stand at the edge of the room, checks that the moon is the perfect position in the sky, and activates the array.</p>\n<p>Three of his four curse marks disappear, something he can tell isn’t related to the array at all, but he doesn’t have the time to worry about it.</p>\n<p align=\"center\">~</p>\n<p>In between the events of Mo Manor and the Dancing Fairy statue, Lan Wangji has almost entirely forgotten that the Jiangs are leaving today, has almost forgotten about Wu Yingtai’s presence in the Cloud Recesses.</p>\n<p>He’s rudely reminded of it when he rushes to the Mingshi just in time to see his son violently shoved out of the doors along with a half dozen other disciples, all of them nearly barreling into Jin Ling and Wu Yingtai.</p>\n<p>He’s already rushing forward, but the doors have started to close. Wu Yingtai reaches for Sizhui then narrows her eyes and pulls back. She draws a talisman in the air with quick, precise movements, shoving her hand forward and causing the doors to freeze in place. It’s the same one she’d used in the library.</p>\n<p>She jumps into the Mingshi and his heart jumps to his throat. If a dozen disciples and his uncle aren’t enough to subdue the ghost sword, then Wu Yingtai, with her weak golden core and poor health, stand no chance at all.</p>\n<p>“Aunt Ying!” Jin Ling screams, reaching for his sword.</p>\n<p>“Get your uncle,” she commands, no trace of softness or teasing in her voice.</p>\n<p>She dispels the freezing talisman. “Do not,” he starts, but then it’s too late, the door slamming shut just as he sees the ghost sword heading for her back. There’s a bitten off scream that must be Wu Yingtai and his hands are on the door, ready to shove it open by force, but then there’s a fission of energy around the Mingshi and the wood burns beneath his hands, forcing him back.</p>\n<p>He looks at the red welts on his palms in disbelief. This isn’t the ghost sword. This is Wu Yingtai. She’s just locked herself inside with the malevolent sword spirit. He tries to break through her barrier and fails, no matter how he tries to shatter it. He’d probably be impressed if he had the room underneath the thrum of panic in his veins. It’s not that it’s powerful, it’s that it’s complicated, which means he can’t brute force his way through it. He tries to focus on the thrum of the barrier around the Mingshi, looking for a weak spot, but none makes themselves obvious.</p>\n<p>“Out of the way!” He looks up and Jiang Wanyin is beside him, scowling and furious and scared underneath all of that. “Stop that, it’s not a barrier, that won’t work.”</p>\n<p>He steps back, having it bite his tongue to keep from contradicting him.</p>\n<p>Some of that mush show on his face because he snorts even as he drags his fingers through the air in what looks like a nonsense pattern. “It’s not a barrier, it’s a lock. It needs a key.” Jiang Wanyin flicks the nonsense talisman forward and it dissolves. When he shoves the door open, nothing stops him.</p>\n<p>They both step inside, hands on their swords. Wu Yingtai is standing between Uncle and the ghost sword, her hands bloody, talisman paper fluttering around the floor, and her grey eyes burning. “Zidian!” she shouts, a talisman held between her fingers.</p>\n<p>Jiang Wanyin doesn’t need to be told twice. The purple whips arcs out in front of them with a crackle of power as she sends the talisman forward, both their actions perfectly in time so Zidian strikes the ghost sword just as the talisman touches it. There’s a bright flash of light and when it fades the pressure of resentment energy lifts from the air, making it suddenly easier to breathe,  and leaves the ghost sword floating gently in the middle of the room, docile for the moment.</p>\n<p>“A-Ying, what the fuck?” Jiang Wanyin demands.</p>\n<p>She grins and there’s blood on her teeth. “What, was I supposed to let the kids handle it? They’re babies, A-Cheng, come on.”</p>\n<p>He rolls his eyes and any response he’d have to that is cut off by Jin Ling running to her. She lifts her arm just in time to catch him against her side, letting him bury his face into her shoulder. “Aunt Ying! Don’t do that!”</p>\n<p>“Ah, sorry A-Ling, I didn’t mean to scare you,” she says, rubbing a soothing hand down his back.</p>\n<p>He pushes her away and rubs at his eyes. “Who said I was scared? I wasn’t.”</p>\n<p>She looks to Jiang Wanyin and they share a warm, exasperated glance. “Of course not, A-Ling.”</p>\n<p>Uncle is finally getting to his feet, a disciple on either side, and Lan Wangji should go to him but he can’t bring himself to move, can barely make himself breathe. He feels as if he’s holding onto his control by his fingertips and he’s afraid any sudden movements will cause it to snap.</p>\n<p>The junior disciples are filling the room. Sizhui and Jingyi don’t maintain a respectful distance, instead rushing towards Wu Yingtai in a way that’s not dissimilar to Jin Ling. “Lady Wu, are you alright?” Sizhui asks, his face creased in concern.</p>\n<p>“You should think before you act!” Jingyi shouts, breaking eight clan rules about propriety at once. “What if something had happened to you?”</p>\n<p>They know her. Somehow in her past two weeks in Cloud Recesses, Wu Yingtai has found time to become familiar with his son and Jingyi, to the point where they feel comfortable enough approach her instead of politely hanging back. That isn’t necessarily unusual for Jingyi but is for Sizhui.</p>\n<p>“I’ve told you to call me my name,” she scolds gently, folding her sleeve over her bloody hands so she can reach forward and wipe away the blood at the corner of Sizhui’s mouth. “I’m fine boys, really, there’s no need to cause a fuss.”</p>\n<p>He doesn’t think of it really, but one moment he’s breathing carefully through his nose and the next his hand is wrapped around the wrist of the hand that she’s not using to clean his son’s face.</p>\n<p>“Lan Wangji!” Jiang Wanyin snaps, Zidian sparking up his arm. “Get away from her!”</p>\n<p>“It’s alright, A-Cheng,” she says absently, meeting his gaze without a hint of fear but plenty of concern. “Is everything alright, Hanguang Jun?”</p>\n<p>He lifts her hand up between them. There’s a thick cut across her palm that’s still sluggishly bleeding. Had she grasped the sword by the blade? Was that the cry of pain he’d heard from her? Foolish. “You should not have interfered. It was not your place.”</p>\n<p>She rolls her eyes, obstinate and arrogant and not <em>listening</em>. “Look, I don’t mean to get involved in clan business or whatever, but I wasn’t just going stand there and watch! I’m weak, Hanguang Jun, not useless.”</p>\n<p>“Yeah, so weak,” Jingyi mutters sarcastically, glancing at the ghost sword. Sizhui elbows him without looking at him.</p>\n<p>Wu Yingtai absently tucks a strand of Sizhui’s hair behind his ear, coming dangerously close to touching his forehead ribbon. His son doesn’t even flinch, though Jingyi does. She turns to face him fully, putting her other wounded hand on top of his. She’s still bleeding, making a mess of both of them, but it’s like she doesn’t even notice. “Come on, relax, it’s not a big deal. I was just trying to help.”</p>\n<p>He tightens his grip, too firm, enough that he knows he’ll leave behind bruises in the shape of his fingers on her skin. His rage isn’t justified. The blood pounding in his ears and the fury under his skin is out of proportion to her actions. He hasn’t been this angry since – since –</p>\n<p>She stumbles as he yanks his hands back, turning and walking out of the Mingshi, walking away from her.</p>\n<p>“Hanguang Jun!” she calls out, but he doesn’t pause and he doesn’t look back.</p>\n<p>Of all his faults, Lan Wangji has never considered disloyalty to be among them.</p>\n<p align=\"center\">~</p>\n<p>“She saved my life,” Uncle says to him as they watch the Jiangs leave Cloud Recesses. Wu Yingtai leaves as she came, walking by Jiang Wanyin’s side, although the cheeriness in her voice doesn’t ring as totally genuine. Wangji had refused to leave the Jingshi to bid their guests goodbye and Wu Yingtai had sulked, begging to be allowed to go and apologize, which Lan Xichen had been forced to refuse.</p>\n<p>Jiang Wanyin had been furious at Wangji’s slight against Wu Yingtai in a way he’d never truly gotten worked up about Wangji’s disrespect when it was directed at himself.</p>\n<p>“Her insights into the ghost sword’s origins were impressive,” he says. A weak cultivator she may be, but her wider knowledge of cultivation and her talisman skills more than made up for it. Between that and her cheerful temperament, she’ll surely make an excellent wife to Jiang Wanyin.</p>\n<p>He dreads receiving that invitation. The whole main Lan family will be expected to attend something as high profile as a sect leader’s wedding and it will be difficult to explain Wangji’s absence.</p>\n<p>“He likes her,” he says helplessly. Wangji enjoys the company of so few people that even that would be remarkable, but this is something he hadn’t thought he’d ever see again, something he hasn’t seen even a hint of in the past thirteen years.</p>\n<p>But it’s there again, like Wangji is fifteen years old again and just discovering what want is. It’s desire and protectiveness and affection too overwhelming to be anything but painful.</p>\n<p>Sizhui likes her too. It’s <em>almost</em> perfect.</p>\n<p>Uncle’s lips press together. “She is not his to like.”</p>\n<p>Lan Xichen has no response to that, because of course Uncle is right. Wu Yingtai is obviously if not publicly engaged to Jiang Wanyin. There’s nothing to be done about it.</p>\n<p>Maybe she and Wangji can at least be friends, one day.</p>\n<p align=\"center\">~</p>\n<p>Wei Wuxian gives into the urge to look behind him back up the steps to Cloud Recesses. He knows it’s dangerous, that there are too many things about him that threaten to give his true identity away, that clearly Lan Zhan despises him as much as ever, but he can’t help it.</p>\n<p>He hopes he sees Lan Zhan again soon.</p>\n<p>Jiang Cheng is worried.</p>\n<p>The good news is that Wei Wuxian’s ritual managed to fix whatever Mo Xuanyu had gotten wrong so he’s more firmly settled in his body, so Mo Xuanyu's core is finally stable if weak, and he's stronger than he was and steadily gaining weight, the bruises under his eyes finally fading.</p>\n<p>The bad news is there’s still one curse mark across his arm.</p>\n<p>“I don’t know what this kid’s deal was,” Wei Wuxian says moodily, slumped over the table in his rooms as they work their way through the third bottle of wine. His brother’s tolerance isn’t quite what it was in his previous body, but it’s not far off either. “Couldn’t he have left some clear instructions? Here’s a hit list, thanks so much.”</p>\n<p>“You didn’t even end up killing them,” he points out. Lan Xichen had told them the events behind the ghost sword, which had explained the three missing curse marks but just made the whole thing even more baffling. “If this kid was a good enough demonic cultivator to summon you, he probably could have killed his family on his own too.”</p>\n<p>Wei Wuxian snorts. “Well, it’s not like he did a perfect job of the whole summoning me part.”</p>\n<p>“No, he did that part fine. It was the binding part that tripped him up, and it’s certainly more than I could do.” He had no interest in demonic cultivation, now or ever, but he’d been fourth in their classes at Cloud Recesses, right behind Jin Zixuan. He wasn’t an idiot.</p>\n<p>His brother nods grudgingly, pulling his leg to his chest so he can rest his chin on his knee. “What if the fourth mark is for a good person? His family seems as if they were terrible, I might have been killed them and not felt too bad about it, but what if he didn’t have a good reason for the last one? I’m not sure I’d be able to undo the curse mark without it killing me anyway.”</p>\n<p>“One problem at a time,” he says sharply then takes a long sip of wine.</p>\n<p>Thirteen years ago he’s acted thoughtlessly and sent his brother tumbling over a cliff, killing when he’d only meant to injure.</p>\n<p>If the fourth mark is for someone Wei Wuxian can’t bring himself to kill, Jiang Cheng will do it for him.</p>\n<p>He’d killed his brother once. He’d killed Wei Wuxian after A-jie had died to save him, dishonoring her sacrifice. What sin could be worse than that? Whose life could be more precious than that of his brother who their sister had died for?</p>\n<p>What wouldn’t he be willing to do in order to ensure one of his worst mistakes remains undone?</p>\n<p>Very little.</p>\n<p align=\"center\">~</p>\n<p>Jin Ling can’t decide if he’s glad that Wei Wuxian is accompanying him on the night hunt or if he’s annoyed by it. “I’m not a baby, you know,” he mutters. He’s thirteen, and a good cultivator. He’d more than old enough to go on night hunts on his own, especially ones like these. It’s probably a poltergeist if it’s anything.</p>\n<p>Wei Wuxian hums, flipping a dagger absently over and under his hand. His new golden core isn’t strong enough for him to wield a sword and he can’t carry his flute around outside of Lotus Pier, so he’s taken to carrying daggers. He’d claimed not to have fought with them often, but from what Jin Ling has seen of his spars it didn’t look that way. “I wasn’t night hunting alone at your age, A-Ling. Besides, I need to take a break from researching before I go mad. You wouldn’t deny your poor uncle a bit of break, would you?”</p>\n<p>Jin Ling ignores the question to say, “You were with Uncle, it’s different.”</p>\n<p>He slides the dagger back into his sleeves, tighter against his wrist than his normal billowy ones just in case they came across trouble. He claimed that he didn’t like large sleeves getting in the way when he was fighting, but he still had his hair mostly down, and Jin Ling thought that had to be worse. Wei Wuxian said he was too impatient for any of the complicated feminine styles, but personally Jin Ling thinks that extra couple minutes would have been worth it just to get the hair out of his way. “Your grandfather followed us on all those hunts, actually. He didn’t tell us until we were older, obviously, we would have been pissed if we knew at the time. But he hid and watched us, just in case we needed help. I’m just doing it out in the open. I prefer not to sneak, I’m not all that good at it.”</p>\n<p>That’s a lie, but Jin Ling doesn’t focus on that. Sometimes he feels like he’s learned more about his family these past couple months than in the past thirteen years. Wei Wuxian talks casually and frequently of people Uncle only mentions when he's desperately sad or drunk or some combination thereof. It’s nice to hear about people in a way that isn’t so heavy, to just know something about his grandfather without feeling like the information is being handed to him covered in blood. “Well if he didn’t interfere, then you shouldn’t either.”</p>\n<p>He smiles at him, warm and fond. Jin Ling is used to reading Uncle’s affections in hundred different ways, but it’s nice that Wei Wuxian’s is so easy, so obvious and plentiful. “I won’t, A-Ling. Unless something goes terribly wrong, it’ll be like I’m not even here.”</p>\n<p>Yeah, right. He swallows anymore complaints, because Uncle <em>has</em> been worried over how much Wei Wuxian has up late researching and what little he’s found, so it’s probably worth the trouble of keeping Fairy at home and letting Wei Wuxian tag along if it gives him a break. He’s probably, possibly more useful than Fairy on a night hunt anyway. “Whatever, Uncle Ying.”</p>\n<p align=\"center\">~</p>\n<p>Sizhui is the highest ranked disciple here which means he can’t panic. He has to be calm and clear headed and he has to get them out of here. But the fog is thick and there’s something in the sky and now the Ouyang disciples are looking at him, thick faced but obviously afraid, and he doesn’t know how to tell them that he doesn’t know what to do.</p>\n<p>The ominous tapping isn’t around anymore, at least. He thinks that’s a good thing.</p>\n<p>“Breathe,” Jingyi mutters out of the corner of his mouth, quietly enough that no one else hears him. Jingyi can be quiet when he wants to be, which is almost never. “We’re just lost, it’s okay.”</p>\n<p>He presses his lips together. He can’t unsay something, after all, and he doesn’t want to argue about this. He doesn’t <em>have</em> to be strong for Jingyi in the way he does for the other disciples, but that doesn’t change that he wants to be.</p>\n<p>When they come across two figures in the mist he draws his sword and viciously stuffs down his fear. Then a familiar voice calls out, “Are those Lans I see or ghosts? It’s hard to tell in all this mist.”</p>\n<p>His knees nearly go weak with relief. Wu Yingtai is here, Jin Ling at her side with his hand on his sword and an uncertain scowl hovering around his mouth. She’s dressed similar to how she was at Cloud Recesses, her hair down and a thick purple ribbon around her throat, but her robes are sturdier and darker, a richer purple than the pale lavender she’d worn, and the sleeves are trim against her wrists.</p>\n<p>“Lady Wu!” Jingyi says, slipping back into formality in his surprise. “What are you doing here?”</p>\n<p>“You first,” she says cheerfully but in a way that leaves no room for argument. Sizhui fills her in as quickly as he can while trying not to self examine too much.</p>\n<p>It makes sense for him to be relieved that she’s here. She’s older than them and knows far more about cultivation than they do and is quite good at talismans. But true as that may be, she’s not a strong cultivator, and the way her mere presence has softened the edges of his fear makes no sense at all.</p>\n<p>She frowns, tapping her bottom lip, her eyes far away. “Aunt Ying?” Jin Ling asks.</p>\n<p>“Strange,” she says, but if she’s worried, she doesn’t look it. “It’s easy for us all to get lost in this mist. We should stick together.”</p>\n<p>The idea that they wouldn’t stay together, that Wu Yingtai wouldn’t stay and help them, hadn’t even occurred to him. It should have, she’s a Jiang disciple and under no obligation to assist a Lan or Ouyang night hunt, but it hadn’t. Maybe that doesn’t mean anything. Clearly his trust hadn’t been misplaced, after all.</p>\n<p>They’re quiet as they walk, all of them tense but her. She walks as if this is any other stroll through a town, even though it’s empty and everything’s closed and thick mist is everywhere.</p>\n<p>“Look!” Ouyang Zizhen shouts, already drawing his sword.</p>\n<p>They all turn and Sizhui feels the bottom of his stomach drop out.</p>\n<p>Two dozen fierce corpses are stumbling towards them. That’s too many. They’d each have to fight multiple fierce corpses at once, in this mist, where they can as easily hurt an ally as they can an enemy. Everyone frantically pulls for their swords anyway, because they’re certainly not going to die without a fight, but Wu Yingtai raises a lazy hand and says, “Hold.”</p>\n<p>They pause, waiting. He wonders if they would all have as easily obeyed any senior that found them, or if it was something special about Wu Yingtai that got such easy obedience. He’s inclined to say it's the latter, but he thinks he might be biased.</p>\n<p>She sketches a talisman in the air, one Sizhui doesn’t recognize, then snaps her fingers. The talisman dissolves and the fierce corpses freeze in place. He only has a moment for the relief to sweep through him before they break through whatever spell she’s cast and start moving again. “Ah,” she says. “That’s unfortunate.”</p>\n<p>“Aunt Ying,” Jin Ling says, clearly not as quietly as he intends, “can you-”</p>\n<p>“Not here,” she says, cutting him off. Jin Ling scowls but nods even though she’s not looking at him, still watching the slowly approaching corpses. She pulls out a sheaf of talisman paper from her robe and leans over, casually slicing her finger on Ouyang Zizhen’s blade before he can pull it away from her. “I’ll just have to get close to them instead, I suppose.”</p>\n<p>“That’s a terrible idea,” Jingyi says flatly. “Let us-”</p>\n<p>“What? Hack at them with your swords?” She’s teasing them. Surely things can’t be that dire if she’s teasing them. “Their flesh is already dead. What do you think your steel will do?”</p>\n<p>That doesn’t sound quite right. “We have cultivation blades. Surely the spiritual energy will destroy them?”</p>\n<p>“Spiritual energy does break them down, eventually,” she allows, eyeing the rapidly approaching fierce corpses with what he feels like might not be the appropriate amount of concern. “But it would take a concentrated strike to do more than irritate them. Frankly, no one here has the power for that kind of approach.” She looks over her talismans with a critical eye. Seemingly satisfied, she sticks her bleeding finger in her mouth then reaches out to poke Jin Ling in the forehead with it. “Stay here. If I die, run.”</p>\n<p>Jin Ling’s eyes widen in alarm. Sizhui can feels his doing the same. “Aunt Ying!”</p>\n<p>“I’m not going to die, relax,” she says, laughing as she heads <em>towards</em> the angry mob of fierce corpses. “So serious!”</p>\n<p>“Should we stop her?” Jingyi asks anxiously. “She’s not even carrying a sword!”</p>\n<p>“She knows what she’s doing, shut up,” Jin Ling snaps, but he’s gripping his sword hard enough that his knuckles have turned white.</p>\n<p>Sizhui doesn’t want to stand there doing nothing. Wu Yingtai’s movements are confident and unflinching, but he can’t help but remember the way her hands had shaken after she’d fallen from the tree.</p>\n<p>When she gets close, she casts the same talisman as before and when she snaps her fingers the fierce corpses come to a halt. It hadn’t lasted long last time and it doesn’t look like she expects it to last this time either. She quickly darts between the corpses, slapping talismans onto them and then getting out of range. As one they take a shuddering, flinching movement and Sizhui is certain that it hasn’t worked, that Wu Yingtai’s plan has failed and they’re going to have to come up with something else.</p>\n<p>Then she smiles and snaps her fingers once more. The fierce corpses turn on each other, as if they no longer see them all standing there. They descend on each other with a savagery that turns his stomach, dead flesh falling to the ground in handfuls while those who’d had tools start slicing through their fellow fierce corpses blindly.</p>\n<p>Jingyi swallows. “I thought you said steel wouldn’t work against them?”</p>\n<p>“Did I?” she asks cheerfully. It’s hard to tell in the mist, but he thinks maybe she’s paler than she was before. Talismans rely more on construction than power to make them work, but he doesn’t think whatever she just did could have been easy. If it had been, everyone would be doing it, and he’s never even heard of talismans that can be used against fierce corpses. “Probably I just meant that steel wouldn’t do much good if the wielder is dead before they can make use of it.”</p>\n<p>She’s standing in front of them again, smiling and perfectly relaxed, and Sizhui doesn’t even register that something is wrong until Wu Yingtai’s back is to them, two daggers he hadn’t seen her carrying crossed in front of her to halt the blade of the sword inches from her face. She’s <em>fast</em>. He’s still processing it when the masked man who’d attacked her ducks backwards, which means he’s barely paying any attention when he hears the strong chords of a zither. A bolt of concentrated spiritual energy lands in front of them, obliterating the last of the fierce corpses and pushing the masked man away from them.</p>\n<p>Sizhui recognizes his father’s spiritual energy and doesn’t slump down in relief, but only because it would be undignified.</p>\n<p>“Hanguang Jun!” Wu Yingtai calls out gleefully, waving her daggers in greeting.</p>\n<p>“What? Really?” Jingyi asks excitedly, turning his head frantically. The rest of the disciples do the same, as if it will make A-die appear out of thin air.</p>\n<p>They can’t see him through the mist. But Wu Yingtai knows he’s there anyway, able to pick up on his presence through his spiritual energy alone when even the other Lan disciples hadn’t been able to.</p>\n<p>Strange.</p>\n<p>He doesn’t have much time to think on it before A-die lands in front of them. Jingyi is coughing and a terrible scent enters his nose, but Sizhui is having a hard time focusing on that. Instead he meets his father’s gaze evenly, hoping he doesn’t look as out of sorts as he feels. This night hunt has gone so sideways, not even just poorly, but weird, and he’s eager for it to be over.</p>\n<p>The question in A-die’s eyes is obvious so he shakes his head and says, “No one’s hurt. Lady Wu protected us.”</p>\n<p>“So formal? You’ll break my heart,” she says, but instead of coming out as a whine it’s almost absentminded. She’s looking over A-die’s shoulder and she says, “I’ll countdown for you, hmm, Hanguang Jun?” Sizhui has no idea what she’s talking about. “Three… two… two and a half… one!”</p>\n<p>A-die swings in place, sword first, neatly deflecting a blow from the masked man. The force of it sends him to the other side of the street.</p>\n<p>How had she done that? Sizhui hadn’t even been able to see the masked man. Had A-die really listened to her or had he also sensed something that Sizhui couldn’t?</p>\n<p>“You take care of him, I’ll take care of the kids, yeah?” she offers.</p>\n<p>A-die’s eyes glance over them, lingering on Jingyi who’s struggling to stay upright. “It’s–”</p>\n<p>“Poison, I know.” There’s a wave of shocked cries and Jingyi’s fingers dig into his wrist. “If you want to take the kids, I suppose I can fight that guy, but I don’t think I’ll last long.”</p>\n<p>A-die shakes his head. “I should not have attacked them. You had the situation handled.”</p>\n<p>Wu Yingtai flushes, maybe. It’s hard to tell with all the mist. “It’s fine, it’s fine, how could you know? It’s an easy enough fix. You do your thing, I’ll do mine.”</p>\n<p>“Hm,” A-die says, then inclines his head slightly more than Sizhui has seen him to do anyone outside of a conference or official meeting. “Thank you, Wu Yingtai.”</p>\n<p>He turns and goes after the masked man before she can reply. She’s definitely blushing now.</p>\n<p>“Aunt Ying,” Jin Ling hisses.</p>\n<p>“Right! Right, let’s go, we have to go,” she says, making shooing motions with her hands, which is possibly a more threatening gesture than she thought it’d be since she’s still holding the daggers.</p>\n<p align=\"center\">~</p>\n<p>Wei Wuxian is worried things have gotten slightly out of hand, although he’s less worried than he was before Lan Zhan showed up. Even if he did accidentally give some of the kids corpse sickness, but Wei Wuxian can cure that easily enough. He would have had a much harder time fighting the masked man out there without resorting to some very obvious demonic cultivation.</p>\n<p>Jin Ling loudly complains about making the congee, but he knows it’s just because he’s scared, so he doesn’t bother to scold him all that much for it. There will be time for lectures on manners when they get out of this mess. Preferably from someone who isn’t him, since there’s no way Jin Ling will take him seriously. He knows him too well for that.</p>\n<p>Maybe he could get Lan Zhan to do it. He’s always had a good face for scolding.</p>\n<p>The almost dead ghost girl doesn’t seem to fit in with the rest of this town. There’s something <em>wrong </em>here, more than the obvious, and it’s bothering him that he can’t put his finger on it. The kids are cured and no one’s hurt and he knows they should just wait for Lan Zhan to finish fighting the masked guy – another piece of this already odd puzzle that doesn’t fit quite right – but as the minutes tick by his restlessness sours into worry.  </p>\n<p>“Stay here,” he orders the kids. “I’m going to check on something. Don’t do anything until I get back.” He pauses. “If something walks through that door that’s not me or Hanguang Jun, strike first and ask questions later.”</p>\n<p>“Some<em>thing</em>?” Jingyi squawks indignantly.</p>\n<p>He doesn’t answer him, closing the door behind him and resisting the urge to put up some protection talismans. He wasn’t that much older than they are when he fought in a war, after all.</p>\n<p>That makes him want to go back there and cover them in protection talismans, actually. These kids have probably never even killed another human being, not one that wasn’t cursed or possessed or dead already.</p>\n<p>He wants to keep it that way, if he can.</p>\n<p>It doesn’t take him long to find Lan Zhan, but when he does, fury licks up his bones, like he’s on the battlefield once more. He wonders if this is a nightmare, but he thinks if were, it would hurt more.</p>\n<p>Lan Zhan is fighting three to one. The masked man, and Xue Yang, who should be dead but isn’t, and the fierce corpse of Song Lan, who isn’t alive but should be. Lan Zhan is holding his own, but it’s a struggle. If something doesn’t tip the fight in his favor soon, they’re going to be in trouble.</p>\n<p>He reaches for his quiankun pouch, where Chenqing lies waiting, but he hesitates. He can’t. If Lan Zhan sees him with Chenqing, he’ll know, but he doesn’t have anything else. He <em>could</em> do it through whistling, but that’s almost as much of a tell as using Chenqing. It’s not like there are exactly a lot of people who could manage musical cultivation with just their voices, especially not up against demonic energies.</p>\n<p>Of course if it comes down to his secrets or Lan Zhan’s life, it’s no choice at all, but there has to be something else, some other solution to this than –</p>\n<p>Oh.</p>\n<p>The Lans. He has a whole bunch of little Lans back there.</p>\n<p>He runs, even though he shouldn’t, even though he’ll be even more useless if he gets corpse poisoning, but this is important. Every moment he wastes is another moment where Lan Zhan could get hurt. He bursts back into the room, chest heaving, and demands, “Who brough an instrument?”</p>\n<p>“What?” Ouyang Zizhen’s face scrunches in confusion, which would be funny in different circumstances.</p>\n<p>“Instruments. A xiao would be preferred, but I’ll take literally anything.” A dizi would be excellent, but he’s pretty sure it’s considered too lowborn for the Lan elders. “Except a zither.” He may be a genius, but he’s still a mortal man. Trying to make thirty four strings obey him on the fly is asking a little much of himself. Then again, if it’s his only option, he’ll manage.</p>\n<p>“None of us have progressed enough to be allowed to take our instruments on night hunts,” says one of the Lan disciples, and he bites back a frustrated scream. That’s probably a logical thing to regulate when they’re not in the middle of a war, but it’s really inconvenient for him right now.</p>\n<p>Jingyi elbows Sizhui in the side, who winces as he edges away from him, but says, “I have.”</p>\n<p>There’s an embarrassed flush across his cheeks. Wei Wuxian would pinch them if he had the time. “What do you have?”</p>\n<p>He reaches into his quinkun bag and pulls out a guqin. Not a xiao, but it only has seven strings. He can work with that.</p>\n<p>Wei Wuxian moves to grab it, but hesitates. He can feel from here that it’s not quite a first class spiritual tool, like Lan Zhan’s zither or his dizi, but it’s close. “Can I? It’s important.”</p>\n<p>There’s a wave of horrified reactions from the other Lans, but he ignores them. It’s not their opinion that matters right now. Sizhui’s nod is firm, but he looks uncertain. “If it’ll let you.”</p>\n<p>He lifts it into his hands. There’s a current of warmth between his palms, but no pain, and the strings each pluck themselves as if in greeting. “Thank you. Stay here.”</p>\n<p align=\"center\">~</p>\n<p>Lan Wangji is almost impressed at how so much has gone wrong so quickly. He’d been fighting the masked man fine on his own, but then assistance had come in the shape of what he’d thought was Xiao Xingchen, blinded but no less deadly for his lack of sight. But then he’d started talking about needing help with a soul, saying he needed a demonic cultivator’s help, which had been strange and unsettling enough all on its own.</p>\n<p>Then he’d asked for Wei Ying and Lan Wangji had known that this was not Xiao Xingchen. He’d come across the man, once, years before. Xiao Xingchen had mourned Wei Ying, his martial nephew. He’d squeezed Lan Wangji’s hands with a sympathy that had been so warm it stung, the only person who’d ever looked at him and both recognized his grief and hadn’t pitied him for it. That man would not mock him for his grief by demanding he hand over Wei Ying, as if that were even <em>possible. </em></p>\n<p>He’d attacked, not a killing blow. If he was wrong, he’d apologize appropriately. But he hadn’t been. The person in front of him had peeled off Xiao Xingchen’s face like a second skin, dropping it to the ground, and then he’d had Xue Yang in front of him.</p>\n<p>Then Song Lan and the masked man had appeared, and he doesn’t understand how all these pieces fit together, isn’t sure what exactly is happening, but he doesn’t have the time to worry about it. He should have killed the masked man when he had the chance, but he’d been more interested in beating him into submission so he could interrogate him, and that had been a mistake. The masked man wasn’t a danger to him, but now that Xue Yang and Song Lan are here, Lan Wangji has to consider the idea that this is a fight that he could lose.</p>\n<p>He dismisses the thought as soon as he has it. If he falls here, then others will be in danger. His son is here. The other juniors are here. Wu Yingtai is here. If he dies here, then they’ll surely follow, and that’s unacceptable.</p>\n<p>The first notes are so faint that he barely registers them. Then Song Lan stumbles, allowing him just enough room to cut him across both thighs.</p>\n<p>Lan Wangji’s senses widen and he realizes there’s music being played, energy trembling through the air. He can’t afford to panic but his heart is in his throat as he ducks underneath Xue Yang’s swing. Only one of the juniors has clearance to bring their instrument out of Cloud Recesses. He doesn’t know where Sizhui could have learned this composition, the notes almost familiar but not quite like anything taught in the standard curriculum, but mostly he wants him as far away from this fight as possible.</p>\n<p>He turns, but instead of his son, Wu Yingtai is on her knees with Sizhui’s guqin in front of her. That’s something he’ll have to hear about later, if there is a later. Even Jingyi doesn’t touch his son’s guqin these days, enough of his spiritual energy having settled into the instrument to make it inappropriate. She’s far enough away not to be in immediate danger, but still too close to comfort. Her playing is shaky, her fingers clearly unused to the instrument as they stumble across the strings, but that doesn’t mean it’s ineffective. He’s never heard Rest played this <em>aggressively </em>before.</p>\n<p>The music slams into Song Lan, who’s face twists into something between confusion and pain. His movements slow to a stutter, his limbs moving jerkily as if they’re no longer under his control and it’s easy for Lan Wangji to move the battle away from him. He doesn’t follow, still caught in whatever Wu Yingtai has done to him. Rest isn’t supposed to work like this, and now that he’s listening he realizes it’s not <em>exactly</em> Rest, although its very close. Lan Wangji manages a slash across the masked man’s chest that would have been a killing blow if he had moved a hair’s breath slower. As it is, red blood blooms across his chest, his grip on his sword faltering. He cocks his head to the side then disappears into the effects of a transportation talisman.</p>\n<p>Just like that, the fight is once more in his favor. Xue Yang is back by Song Lan, but for some reason he’s staring at Wu Yingtai with a look Lan Wangji can’t explain and doesn’t like. “<em>You!</em>” he hisses, darting forward sword first.</p>\n<p>Wu Yingtai blanches, but her focus is still on Song Lan and her playing doesn’t falter even as Xue Yang raises his sword above his head.</p>\n<p>She’ll die. Xue Yang is going to sever her head from her body and she’ll be dead, her blood staining his son’s guqin. Lan Wangji moves faster than he ever has, putting himself between them, and raises his sword to stab it through Xue Yang’s chest, piercing his heart. Xue Yang dies with a snarl on his lips and surprise in eyes.</p>\n<p>Wu Yingtai is screaming. He means to turn, to assure her that everything is going to be okay, but he can’t move and then her skinny arm is around his waist, slowly easing him to ground, for some reason.</p>\n<p>He tilts his head, looking down to see a sword sticking out of his stomach. “Ah,” he says, and it comes out breathier than he’d intended, a gasp more than a word.</p>\n<p>“What the <em>fuck</em> was that?” Wu Yingtai demands, kicking Xue Yang’s corpse away from them and using her free hand to yank Bichen out of his chest. She doesn’t clean his sword before sliding it back in its scabbard, but he supposes that it doesn’t really matter anymore. Her hand is frantic against his back, then soothing as it rubs in a slow circle. “Okay, well it didn’t go through you, so there’s that at least.”</p>\n<p>“Are you hurt?” he asks, breathing through the pain.</p>\n<p>She pauses in trying to push him down on the ground. “Am <em>I</em> hurt? Are you fucking with me right now?”</p>\n<p>“No.” Song Lan is still a threat, and she’s stopped playing, so he could come over and attack her at any moment. If he’s going to die, he wants to die knowing that everyone is safe.</p>\n<p>He tries to force himself to his feet and she lets out a sound that he thinks might count as a snarl. She grabs his shoulders and shoves him down onto his back, the move jostling him enough that the pain which had seemed distant is suddenly very present, forcing out a low grown that he clenches his teeth together in an attempt to suppress.</p>\n<p>“Oh, what was that?” she asks snippily. “Can you repeat it for me?”</p>\n<p>In other circumstances, he’d wouldn’t allow himself this, but the pain has rubbed his control raw. He can’t quite stop his mouth from pulling into a smile. Most people would be panicked in this situation, he thinks. She’s mostly angry.</p>\n<p>Anger looks good on her.</p>\n<p>She stares at him for a moment, mouth open, before muttering, “You’re so weird.” Her hands are gentle as they press around his stomach. He breathes in and out carefully, attempting to let the pain pass through him. He turns his head, trying to figure out where Song Lan is, but she’s blocking most of his view. “This could be worse, I think.”</p>\n<p>He raises an eyebrow.</p>\n<p>“Shut up,” she scowls. “I have some medical training, okay, I had this friend who – well, it doesn’t matter.”</p>\n<p>“Don’t let him see,” he says. He reaches up to grab her hand, ignoring the slickness of his blood covering it. “Please.”</p>\n<p>She lets him hold her hand, her eyebrows pushed together. “Let who see what?”</p>\n<p>“Don’t let Sizhui see me die,” he says. It’s getting harder to talk, but he thinks that comes out clearly.</p>\n<p>If she was angry before, she’s furious now. He thinks her grip on his hand would be painful if he had the capacity to feel pain anywhere besides his stomach. “Who the fuck said you were allowed to die?”</p>\n<p>“You cannot remain here. The masked man is still here, as well as the fierce corpses. I cannot move with a sword in my stomach and as soon as you remove it I will bleed out,” he says. He has a strong golden core but even he can’t out heal blood loss. “Either leave me here or finish it quickly and get the juniors to safety. One of the men wore the face of another, so you must trust no one, as they could be someone else. You can come back for my body when it’s safe.”</p>\n<p>It’s the only thing they can do. He tries not to think of his uncle, of his brother, of his son who’s not quite fully grown.</p>\n<p>He’ll get to see Wei Ying soon. There’s that, at least. Perhaps dying is not so terrible if it means he gets to see Wei Ying again. He’ll be able to tell him about their son.</p>\n<p>Wu Yingtai pulls out a piece of talisman paper, using his blood on her hands to sketch a design into. He hopes it’s something that will kill him quickly.</p>\n<p>“When this is over,” she says fiercely, “I’m going to kick your ass.”</p>\n<p>She reaches up to grip the handle of the sword and yanks it out in one hard, smooth motion. His vision goes black and he feels her slapping the talisman against his wound, then there’s a painful heat and the sizzling of flesh.</p>\n<p>He’s too unprepared to muffle the scream that rips itself from his throat. Her hand is cool against his cheek and then it all goes black.</p>\n<p align=\"center\">~</p>\n<p>He should have just used Chenqing. At least then Lan Zhan would have known not to get in the way, would have known that Wei Wuxian could be deadly enough with seven strings that he didn’t need to stupidly take a sword to the gut.</p>\n<p>Wei Wuxian can’t leave Lan Zhan here alone, bloody and unconscious and still faintly smoking, but he told the kids not to leave. He sends a paperman to Jin Ling, trusting his impulsive nephew to follow it and for everyone else to be too responsible to let a thirteen year old go running off on his own.</p>\n<p>He hadn’t pulled his left hand back quickly enough from the talisman and it aches, the skin red and tender. He’ll still be able to play with it if he has to, but it’s not going to be pleasant.</p>\n<p>Song Lan is still standing there, unmoving, and he’s itching to investigate, to figure out what the hell is going on with everyone in this town, but Lan Zhan comes first. His face is slack now, at least, which is better than the pained grimace. It’s like being back in the Xuanwu’s cave when they were kids, except he thinks they’re in a slightly better position this time around.</p>\n<p>Or maybe not. He doesn’t just have an injured Lan Zhan to take care of, he has a couple dozen juniors to protect from someone who’s injured but still alive and, going by what Lan Zhan said, has the ability to change faces.</p>\n<p>The juniors come storming around the corner. Everyone but Jin Ling stops short at the sight of them, the Lans gaping at the sight of Lan Zhan.</p>\n<p>Jin Ling doesn’t give a shit, bless him. “Aunt Ying!” He falls onto his knees next to him and grabs his arm, tugging on it in a way that makes him wince, but Jin Ling’s so freaked out that he can’t bring himself to scold him for it.</p>\n<p>“I’m okay,” he says soothingly, reaching out to pat his shoulder. “Good job on following the paperman, that’s what I wanted you to do.”</p>\n<p>There’s a wet, choked gasp from next to him and he turns to see Sizhui standing there, eyes wet and mouth trembling.</p>\n<p>“Oh, sweetheart, no,” he says, wrapping his burned and throbbing hand around Sizhui’s forearm. “He’s alive, and we’re going to keep him that way, okay?”</p>\n<p>“He’s,” Sizhui starts, then stops, dropping down on his other side. He reaches for Lan Zhan’s hand, finding his pulse with shaking fingers. He swallows and bows his head, pressing the back of Lan Zhan’s hand against his forehead and knocking his ribbon out of place, not that he seems to notice. He stays like that for a moment, taking two slow breaths, then carefully lowers Lan Zhan’s hand back to the ground. When Sizhui turns to him, there’s an earnest determination there that pulls a smile from Wei Wuxian, despite everything. “What should we do?”</p>\n<p>The other juniors surround them, the Lans too pale at the sight of Lan Zhan but all of them equally resolute.</p>\n<p>Wei Wuxian loves these kids.</p>\n<p>“Find a cart, we can’t carry him without aggravating his wound. Be quick, and careful, one of the men he was fighting got away. Ignore Song Lan – that fierce corpse over there – we don’t have the time to deal with him now.” He doesn’t want to outright kill him if he doesn’t have to. He wants answers first. “If you see someone, anyone, send up a flare and I’ll come to you. Understand?”</p>\n<p>“Yes!” Two Lans and one of the Ouyang disciples go off in search of a cart.</p>\n<p>First a cart, then an inn where he might be able to actually protect them, and then they’ll have to send out messages for help.</p>\n<p>He swallows, letting his gaze drop to Lan Zhan, to his ruined robes and hair and the shallow rise and fall of his chest.</p>\n<p>Lan Zhan just has to keep breathing. Wei Wuxian will do the rest.</p>\n<p align=\"center\">~</p>\n<p>He wakes up in an incredible amount of pain, but considering he hadn’t expected to wake up at all, it seems a petty complaint.</p>\n<p>He’s partially upright, leaning against a wall, and Wu Yingtai’s arms are around him and her hair is in his face. She leans back, tugging on something that causes his breath to hitch in pain, and then she’s looking at him. “Oh no, I was hoping you’d sleep through this,” she sighs. “I can’t imagine it’s comfortable.”</p>\n<p>He blinks, taking stock of their surroundings. They’re in a room, likely rented. He’s shirtless and pressed against her as she winds bandages around his torso and, even considering the circumstances, he can’t stop the flush of heat along his ears. She’s so close, closer than she’s been since the first time they met, when he’d held her body against his to keep her from falling.</p>\n<p>He opens his mouth but she presses her fingers against his lips, shocking him into silence. Her skin is soft and he has clamp down on the impulse to bite her. “Everyone’s okay, you’re the only one stupid enough to get hurt. I put up wards and as soon as I’m done with you, I’ll go out and keep watch. Sizhui and Jingyi are out there right now, but I told them to yell for me if anything happens.”</p>\n<p>It’s harder than it should be to turn his head towards her, pulling away from her touch so he can speak. He thinks possibly the decision backfired, because now her fingers are pressing into his cheek and he’s looking straight at her, their faces far too close. He’d been prepared to die and join Wei Ying and instead he’d woken up in Wu Yingtai’s arms. The shame is at war with exhaustion, with how she’d protected the juniors and come looking for him, with how she’d saved his life and is here now, smiling at him while trying to keep him alive. This would be easier if she were less … if she were just <em>less</em> than this.</p>\n<p>He thinks Wei Ying would have liked her.</p>\n<p>“I’ll keep watch,” he says, bracing himself against the wall to get to his feet. He can feel his golden core already at work at healing the wound and she and the juniors need a break.</p>\n<p>“Over my dead body,” she says cheerfully then slaps a talisman against his chest.</p>\n<p>The last thing he feels before being pulled into unconsciousness is her hand coming up to cradle the back of his head as it tips back, narrowly preventing him from smacking it into the wall.</p>\n<p align=\"center\">~</p>\n<p>When the Jin messenger butterfly lands on his desk, Lan Xichen thinks it’s from A-Yao. But the message has Sizhui’s seal and is written by Wu Yingtai.</p>\n<p>He barely has the presence of mind to inform his uncle before summoning four senior disciples and stepping onto his sword. They’re safe enough for now. Wu Yingtai is intelligent and has a couple dozen skilled juniors at her disposal. She’ll set up some sort of rotating guard duty, she won’t leave their backs open. He’s sure they’ll be fine.</p>\n<p>They have to be fine.</p>\n<p>The journey should take twelve hours by sword. They make it there in ten and it’s the middle of the night when they land in front of what could generously be called an inn. Lan Xichen tries not to resent the speed of the senior disciples. He would have gotten here faster on his own, but this isn’t the type of situation he should enter alone, no matter how much he wants to be by Wangji’s side.</p>\n<p>The innkeeper takes one look at them and points up the stairs with a trembling hand. “They’re up there. Be careful.”</p>\n<p>He <em>wants</em> to go rushing up the stairs but he pauses. That’s not the reaction he expected. “What do you mean, my lady?”</p>\n<p>She flinches, looking down. “That woman – we – they already paid. She said they’d clean the walls before they left.”</p>\n<p>None of that makes sense but it does shove his heart up that couple extra inches into his throat. There’s no use standing here trying to guess what she means. They’ll just have to see for themselves.</p>\n<p>Lan Xichen goes up the stairs first but stops abruptly when he gets to the top. No wonder the innkeeper had been terrified.</p>\n<p>The hallway is narrow and short with only three rooms on each side. Talismans line the wall along with talisman markings directly on the wall and floor, drawn in a substance that’s glistening a little too brightly in the candlelight to be ink. He can feel the fission of power from here, almost like heatwave that’s just out of reach. These are powerful wards. He thinks they might even be more powerful than the ones that encircle Cloud Recesses.</p>\n<p>Wu Yingtai is kneeling in the center of the hallway, just behind the barrier line. There are deep bruises under her eyes and her robes are covered in dark stains. She has one hand poised over a stack of talismans and the other above a swirling talisman line along the wall. All of her fingers have barely healed cuts across them.</p>\n<p>Her grey eyes are stone. It sends a chill down his spine.</p>\n<p>Perhaps he should have expected this. Perhaps it was foolish of them to think Jiang Wanyin, the son of the Violet Spider, would be content with a woman who’s merely beautiful and clever. Perhaps they should have known that she’d also be deadly.</p>\n<p>He’d assumed she’d use the disciples to keep them safe. Perhaps that was foolish too, to think that the woman who’d sealed herself in with the ghost sword would allow children to protect her, would hide behind them instead of placing herself in front of them.</p>\n<p>“Zewu Jun,” she says, her voice absent any trace of the warmth he’d become accustomed to hearing. “Apologies for the precaution, but it seems as if we’re avoiding a man who can take others’ faces for his own.” She doesn’t wait for him to respond to that, instead raising her voice and calling out, “Sizhui!”</p>\n<p>The door closest to her slides open and his nephew steps out. His clothes are rumbled and the skin around his eyes is pulled tight, but he’s whole and unharmed and it becomes that much easier to breathe. Sizhui’s face slackens in relief when he sees him, but he only takes half a step towards him before freezing and tensing once more. “Zewu Jun,” he says respectfully. “What did my father give me for my tenth birthday?”</p>\n<p>“Your guqin,” he answers, but instead of relaxing his nephew tenses even more. He shakes his head and Wu Yingtai’s hand twitches toward the incomplete line of the talisman. He assumes he doesn’t want to know what happens when she completes it. “Sizhui, he did, right in front of,” all of us, he thinks but doesn’t finish. There were too many witnesses, it was too easily known for that to an acceptable question to confirm he’s not an imposter. He wasn’t there for this part but he knows it’s true. “He gave you spiritually charged strings from his own guqin.” It was the type of gift that would only be acceptable between family and had happened when they were alone in the Jingshi. He’d only found out later.</p>\n<p>Sizhui’s shoulders slump and he rests a hand on Wu Yingtai’s arm. “It’s him.”</p>\n<p>She finally takes her cold eyes off him to look at Sizhui. He doesn’t flinch from her gaze and she nods once, dropping her arms. She sketches out a talisman in the air too quickly for him to follow and flicks it forward. The hum of power disappears from the air and she slumps forward with a groan, rubbing her forehead.</p>\n<p>Lan Xichen expects Sizhui to rush for him, but instead he drops down next to Wu Yingtai and wraps an arm around her shoulders, tilting her so she’s leaning against his chest. “Are you okay? Will you sleep now? You should have let us keep watch!” He turns his head and shouts, “Jin Ling!”</p>\n<p>That sounds as if Wu Yingtai, with her thin frame and weak golden core, has been sitting there refusing to rest and poised to strike since they arrived at the inn the day before.</p>\n<p>She reaches up to pat his arm. “I’m fine, I’m fine. Don’t make such a fuss.” Her voice is back to being warm but he doesn’t think he’ll ever quite forget the way she’d looked at him at first, as if his death were a foregone conclusion and she just hadn’t yet decided how best to go about it.</p>\n<p>She’s too young to have fought in the war, but the way she’d looked at him had almost seemed familiar, had almost seemed like something he’d once seen on the battlefield.</p>\n<p>All the doors open, the juniors pouring out into the hallway. They step aside for Jin Ling, who’s scowling at he holds out his hands. “Come on, Aunt Ying. Backup is here and you need a nap.” He’s trying to tease but he’s too worried for it to come out properly.</p>\n<p>She presses her lips together then looks up at Lan Xichen, a question in the tilt of her head. He nods. “We’ll keep guard.”</p>\n<p>“Hm,” she mutters. She sketches out another talisman, flicking it against the wall. He flinches at the burst of flame as all the paper talismans turn to ash and the blood is scorched off the wall, ensuring that neither him nor his senior disciples will have the chance to study whatever it is she’d done. She places her hands in Jin Ling’s, and no matter how formidable she is, she’s still too thin, although perhaps less so than when he saw her last. Jin Ling doesn’t even struggle to pull her to her feet.</p>\n<p>“Hanguang Jun first, then I’ll sleep,” she says. Jin Ling rolls his eyes but doesn’t argue, although he does keep a firm hold of her arm. Sizhui pushes open the door to the room he’d been in and Lan Xichen swallows before stepping inside.</p>\n<p>Wangji is lying on his back, stripped to just in his pants, his hair undone but his forehead ribbon still in place. The tight bandages around his torso are clearly from his robes, but he immediately focuses on the talisman on the center of his chest. He doesn’t recognize it, but before he can snap at her, Wu Yingtai says, “The asshole tries to stand up and keep watch, what was I supposed to do? Dealing with him finally gave me sympathy for – for my own doctors.”</p>\n<p>He notices her stumble over her words, but can’t bring himself to care about it. He only has eyes for his brother.</p>\n<p>“Sizhui,” Wu Yingtai says. His nephew nods and leans over to press his hands against Wangji’s shoulders. She yanks off the talisman and Wangji's eyes fly open. He tries to push himself up, but Sizhui keeps him flat on his back. “Ah, Hanguang Jun, are you always this bad at listening? Don’t move!”</p>\n<p>He stills, turning his head in their direction. Wangji’s eyes meet his but he passes over him to focus on her. “Wu Yingtai. You need to rest.”</p>\n<p>“As the person who didn’t get stabbed, I don’t have to do anything,” she says. She steps away from Jin Ling to sit next to him on the bed and Sizhui lets go of Wangji. She flattens her hands against the bandages across Lan Zhan’s stomach, carefully watching his face. He only raises an eyebrow at her and she hums before picking up his wrist, pressing her fingers against his pulse. Lan Xichen can’t quite believe Wangji is letting this happen, is letting her touch him like this and not even flinching away from it. She sighs, adjusting her grip so she’s holding his wrist but not letting go of it and Wangji doesn’t try and make her. “Ah, Hanguang Jun, your golden core is so strong! You’ll probably be alright to fly home in the morning.”</p>\n<p>“Thanks to you,” he says quietly.</p>\n<p>Wu Yingtai flushes and Lan Xichen feels his heart sink. This can’t be happening.</p>\n<p>“None of that! You saved me first, after all, even if it was a really dumb thing to do.” She gently puts Wangji’s hand on his chest, giving his wrist a light squeeze before pushing herself to her feet.</p>\n<p>She sways and both Wangji and Sizhui reach out to steady her, but Jin Ling wraps an arm around her waist and glares at them. “Come on, Aunt Ying.”</p>\n<p>Does that glare seem worse than before? More possessive? Does Jin Ling know that Wangji is in love with his uncle’s fiancé? Lan Xichen can’t tell.</p>\n<p>He waits for the door to shut behind them to reach out and grasp his brother’s shoulder, his tongue thick in his mouth as he tries to think of what to say.</p>\n<p>“Mm,” Wangji says, reaching up to cover his hand with his own. “I know.”</p>\n<p>His breath leaves him in a rush, the fear and adrenaline of the past twelve hours leaving him exhausted. “I’m glad you’re okay.”</p>\n<p>Whatever it is that needs to be said doesn’t need to be said tonight. For tonight he can sit with his brother and his nephew and just be grateful that he didn’t lose either of them.</p>\n<p>That he has Wu Yingtai to thank for that is too complicated of a feeling for tonight, so he sets it aside until morning.</p>\n<p>If only she weren’t engaged to Jiang Wanyin.</p>\n<p align=\"center\">~</p>\n<p>Sizhui doesn’t want to leave.</p>\n<p>The Lans are escorting the Ouyang disciples home, just in case, but Wu Yingtai and Jin Ling aren’t coming with them, and it’s not <em>fair</em>.</p>\n<p>“Shouldn’t we wait until Sect Leader Jiang gets here?” he asks as they’re all gathered in front of the inn. They’re supposed to be saying goodbye but he – it just seems wrong, is all. Wu Yingtai looks better after getting a couple hours of sleep and changing into clean robes, but surely that’s not enough to recover from all she’d done? What if the masked man comes back and she has to face him alone?</p>\n<p>Wu Yingtai laughs and reaches out to smooth the line between his eyebrows. He sees his uncle startle out of the corner of his eye but can’t bring himself to be embarrassed. He wants to lean into her touch and has to hide the harsh sting of disappointment when she pulls her hand away. “Don’t worry so much, Sizhui. Yunmeng is further away than Gusu, he’ll be here soon, and Hanguang Jun needs to see an actual healer.”</p>\n<p>His father is frowning and Jingyi is practically vibrating. Ouyang Zizhen wrings his hands together as he asks, “Are you sure you’re feeling okay? You used a lot of blood.”  </p>\n<p>At least he’s not the only one worried about her.</p>\n<p>“I’m <em>fine</em>,” she insists. “Go on, I’m sure I’ll see you again. You’ll be attending the cultivation conference in Lanling next month with your father, won’t you?”</p>\n<p>“Yeah,” Ouyang Zizhen says glumly before he brightens. “Oh, will you be there?”</p>\n<p>Jin Ling crosses his arms over his chest. “Of course she’ll be there. What kind of question is that?”</p>\n<p>Sizhui doesn’t normally attend the cultivation conferences. He wonders if his father will mind if he goes to this one.</p>\n<p>She rolls her eyes and then bows to them, kicking Jin Ling in the shin until he does the same. “Thank you, all of you. We wouldn’t have made it out with you.”</p>\n<p>They bow in return, A-die deeper than their positions demand, but she had saved his life.</p>\n<p>“We wouldn’t have made it out without you!” Jingyi protests.</p>\n<p>She’s laughing as she straightens. “We saved each other, how about that? I think it makes us even.”</p>\n<p>A-die hums then says, “Thank you, Wu Yingtai.”</p>\n<p>“What did I just say, Hanguang Jun?” she demands, putting her hands on her hips.</p>\n<p>“Lan Wangji,” he corrects, his eyes warmer than Sizhui can remember them being in, well, maybe ever. He doesn’t think his father has ever requested someone be <em>less </em>formal with him before.</p>\n<p>Wu Yingtai’s mouth hangs open for a moment before she’s giving him a blazing grin, one that puts all her former smiles to shame. “Alright, Lan Wangji. If you insist.”</p>\n<p>“You’ll really be okay?” he asks and doesn’t realize how tight his voice sounds until everyone’s turning to look at him. “I just – it’s not that I don’t think you’re,” he pauses, face burning. “I’ll see you again?”</p>\n<p>Her grin softens and she steps forward. He doesn’t realize he’s being pulled into a hug until her arms are around him and his face is pressed into her shoulder. He clings to her, probably too tightly, but she doesn’t pull away, only holds him all the tighter. “Such a sweet boy! Of course you’ll see me again, stop worrying. I can take care of myself, all right? Take care of Lan Wangji for me until then, clearly he can’t do it himself.”</p>\n<p>His laugh is too watery, but she doesn’t call him on it, just pinches his cheek when he steps back. It should irritate him, being treated like a little kid, but instead it just makes him smile.</p>\n<p>“Uncle!” Jin Ling shouts and then they’re all looking up to the sky.</p>\n<p>Sect Leader Jiang descends on his sword, glower clearly visible.</p>\n<p>Wu Yingtai tenses, reaching into her sleeve, but then he lands, Zidian sparking up his arm in irritation, and he shouts, “What the hell is going on? What the fuck kind of message was that?”</p>\n<p>She relaxes again and says, “Oh good, it’s you. Unless they killed you and stole your face and managed to convince Zidian to listen to a new master, but that last part seems really unlikely.”</p>\n<p>His face scrunches. “What the fuck are you talking about?” He grabs Jin Ling and yanks him over to his side, shaking him. “Did you do something stupid? Are you hurt?”</p>\n<p>Jin Ling sighs, not even resisting the manhandling. He reminds Sizhui of a kitten being picked up by the scruff of its neck by its mother. “No, Uncle.”</p>\n<p>Wu Yingtai is laughing as she walks over to them, putting her hand on Sect Leader Jiang’s arm. “A-Cheng, come on, he did a great job! I’ll tell you all about it on our way to Yi City.”</p>\n<p>“Why are we going to Yi City?” he demands, frowning. “What about you, are you hurt?” He lets go of Jin Ling to tilt Wu Yingtai’s face back. “You look like shit.”</p>\n<p>“Thanks,” she says dryly before smirking. “I’m fine, but I nearly got my head cut off. Luckily Lan Wangji was there to save me.”</p>\n<p>“Lan Wangji, huh?” he mutters darkly. Sizhui sees his uncle flinch and he can’t think of why. It’s not like he’s intimidated by Sect Leader Jiang, even when he’s angry.</p>\n<p>She nods very seriously. “He saved my <em>life</em>, A-Cheng.”</p>\n<p>Sect Leader Jiang presses his lips together then turns to A-die and bows. “Thank you for protecting A-Ying, Hanguang Jun.”</p>\n<p>His father blinks then inclines his head.</p>\n<p>Wu Yingtai cackles, hanging off Sect Leader Jiang’s arm and elbowing him in the side. “Wow, I didn’t think you’d actually do it! So diplomatic.”</p>\n<p>“I take it back, he should have let you die,” he says, but he’s not looking at them anymore, instead frowning down at her in a way that doesn’t really look angry.</p>\n<p>“Too late!” She waves at them. “Bye Lans and Ouyangs! Don’t get into any more trouble without me!” She winks at them the grabs Sect Leader Jiang’s hand, trying and failing to drag him down the street. “A-Cheng, let’s go! Weird stuff was happening and I want to figure it out, come on!”</p>\n<p>Sect Leader Jiang doesn’t budge an inch for a moment before sighing and shaking Wu Yingtai off, although he does start walking down the street.</p>\n<p>“It was really weird,” Jin Ling says, nudging himself forward so he’s walking between her and Sect Leader Jiang.</p>\n<p>Sizhui turns around to step onto his sword, trying to convince himself that the feeling in his chest isn’t jealousy.</p>\n<p>He doesn’t do a very good job of it.</p>\n<p>They’re nearly at Jin Tower and Lan Wangji knows his brother is going say something before he opens his mouth. He’s been sending him sidelong glances the whole way to Lanling, so it’s hardly been subtle, and Sizhui and Jingyi have dropped back far enough that they shouldn’t be able to overhear them.</p>\n<p>“Wangji,” he starts.</p>\n<p>He waits, but Xichen says nothing further. “Brother,” he sighs, “it’s fine. I am used to wanting what I cannot have.”</p>\n<p>The skin around his brother’s eyes tightens and Xichen reaches out to grasp his forearm, a quick touch that Lan Wangji barely has the time to feel before it’s gone.</p>\n<p>Wei Ying was never his to begin with, even if he’d thought that maybe they could belong to one another one day, it hadn’t mattered. He’d died. Lan Wangji had wanted and not had Wei Ying since he was fifteen, longing and grief and regret making themselves a home in his chest.</p>\n<p>This is familiar, but simpler too. He will always love Wei Ying. He will never move on from the love of his life. The idea is preposterous.</p>\n<p>However. Wu Yingtai has a shrieking laugh and clever eyes and he thinks that he could love her too, given the chance. He thinks that perhaps he already does, that perhaps he fell for her like he fell for Wei Ying. Instantaneously, the moment she smiled at him in the middle of Cloud Recesses, too close and not close enough.  </p>\n<p>She is not his to love, like just Wei Ying wasn’t his to love. But this ache is sweeter. He may feel how he feels about Jiang Wanyin, but he clearly loves Wu Yingtai, just as clearly as she loves him. Getting to watch her live a full and happy life with another man will not hurt him the way Xichen is worried about.</p>\n<p>It will be a privilege.</p>\n<p>He’d give anything for Wei Ying to still be alive, to be able to see him happy and in love, even if it wasn’t with him. The idea of Wei Ying alive in the world is aching and sharp against his sternum. To have attended his wedding, to be able to meet his children, to sit across from him at a cultivation conference and see his smile – it would mean everything to him, to have that with Wei Ying.</p>\n<p>How can he feel any less for Wu Yingtai? He will live off her happiness with Jiang Wanyin as if he’s surviving of inedia, making a grand meal out of nothing he can consume, and it will be enough.</p>\n<p align=\"center\">~</p>\n<p>Jiang Cheng cannot <em>believe</em> he let himself get talked into this. Wei Wuxian would have been one thing, but even Jin Ling had begged him to help. He could deny one of them but both was a trial even for him. Not that Jin Ling had stuck around to deal with the consequences. He’s going to have to have a conversation with Jin Guangyao about absconding with their nephew when Jiang Cheng is trying to teach him a lesson.</p>\n<p>“He’s making good progress,” Wei Wuxian tells Song Lan as he’s crouched over Xiao Xingchen’s corpse, which is currently covered in specialized lure talismans. “Hopefully by the time we get back he’ll be finished gathering, but I really don’t know. I can’t guarantee anything. I’m kind of making this up as I go.”</p>\n<p>“I know,” Song Lan says quietly with his newly repaired tongue courtesy of Wei Wuxian. “It’s enough that you’re trying. Thank you.”</p>\n<p>It’s a good thing that Jiang Cheng has a thirteen year long history of not allowing anyone in Wei Wuxian’s room. A-Qing had been hard enough to explain to everyone and she’s actually alive. Song Lan at least seems <em>mostly</em> alive.</p>\n<p>Xiao Xingchen, on the other hand.</p>\n<p>“What do you mean making it up?” Jiang Cheng grumbles. “Haven’t you done this before?”</p>\n<p>Wei Wuxian pulls a face. “No, how many times do I have to tell you? Wen Ning wasn’t actually dead, just <em>mostly</em> dead. All I had to do was make his body something that could hold onto his soul. This is the <em>opposite</em> and much harder.” Skepticism is a strange look on his brother’s face and Jiang Cheng doesn’t like it. “Xue Yang, the absolute creep, has done a very good job of repairing and preserving Xiao Xingchen’s body, but now I’ve got to try and lure the remainder his spiritual cognition into one place and then get it to stick to his body. Honestly, it’s closer to proper necromancy than anything else I’ve done.”</p>\n<p>The idea that everything else his brother has done somehow doesn’t count as proper necromancy really doesn’t do anything to comfort him. “Great. Come on, can we go now? We can’t be late and we’re going to be if we don’t leave <em>now</em>.”</p>\n<p>Song Lan’s lips almost twitch into a smile before settling back into a smooth line. Jiang Cheng wishes he could blame it on a lack of fine motor control with his partially dead body, but he knows that his inability to smile is directly linked to Xiao Xingchen. Although he had made a passable attempt at it when faced with A-Qing, the girl who tried to save Xiao Xingchen, who tried to save the juniors in Yi City.</p>\n<p>“Right, right, yes, we can go,” Wei Wuxian says, drawing a couple more talismans in the air before giving a satisfied nod and clapping Song Lan on the shoulder.</p>\n<p>They’re almost to the dock where the rest of the disciples are gathered when Jiang Cheng reaches out and grabs Wei Wuxian’s wrist. “Wait.”</p>\n<p>His brother stops, frowning as he turns to face him. “A-Cheng?”</p>\n<p>He almost doesn’t do it, because he knows his brother well enough that this will hurt at least as much as it helps, but he’s not sure what else to do. “We’re walking into a situation where we don’t have all the information.” Nie Mingjue’s headless body and Xue Yang and a ghost sword and Wei Wuxian’s resurrection are all connected and have to make some sort of sense, but they haven’t been able to figure out how or why. The only thing they’re sure of is someone is playing with them.</p>\n<p>“It’s okay, I’ll protect you,” Wei Wuxian says, only half mocking. </p>\n<p>That’s what he’s afraid of.</p>\n<p>“Your golden core isn’t strong enough to use a sword, everyone will know who you are soon as you use Chenqing, and your daggers don’t do you much good until someone is too close to you,” he says. “Whoever is behind all this will probably be there. No one who isn’t part of the world of cultivation politics would even know enough to orchestrate this, never mind do it.”</p>\n<p>“A-Cheng,” Wei Wuxian says, soft and not even a little mocking, “it’ll be fine. I’ll be fine.”</p>\n<p>He swallows. He doesn’t have to do this. It’s not like he’s planning to let Wei Wuxian go running off into danger on his own anyway. He could accept his brother’s word and not push.</p>\n<p>He hadn’t pushed before and by the time he’d tried to hold onto his brother he was already out of reach.</p>\n<p>“Give me your hand,” he says. Wei Wuxian raises an eyebrow but holds out his hand. Jiang Cheng grabs his wrist with one hand and presses their palms together with the other.</p>\n<p>Wei Wuxian flinches and tries to pull back, but Jiang Cheng doesn’t let him. Zidian comes to life, slithering from his hand to wrap around Wei Wuxian’s. “No, I don’t want – you can’t! Your mother wouldn’t-”</p>\n<p>“My mother is dead,” he says bluntly, ignoring the sharp ache with years of long practice. “I’ve been Zidian’s master for over fifteen years and I want you as safe as I can make you. You can give it back to me after we leave.” Zidian is curled around Wei Wuxian’s hand and Jiang Cheng lets go, moving his hands to press against his brother’s back, where the scars from his mother’s whipping had been in his previous body. “Zidian hasn’t been Madame Yu’s spiritual tool in a long time. It’s mine. It won’t hurt you. It will obey you. You don’t have to be afraid of it.”</p>\n<p>Wei Wuxian looks down at Zidian for a long moment then swallows before looking up at him. His eyes are bright and Jiang Cheng resists the urge to look away, to let his temper snap just so he has a reason to change the subject. “Are you sure?”</p>\n<p>“Of course I’m sure!” He scowls. “Who else? You and Jin Ling are all the family I have. Zidian wouldn’t betray me by letting either of you come to harm. You’ll be able to wield it as easily as our nephew can.”</p>\n<p>“Oh.” Wei Wuxian looks down at Zidian, flexing his hand, then he beams as throws himself forward, clinging to him and shouting, “Oh, A-Cheng, you do care!”</p>\n<p>The trade off for having his brother back is, unfortunately, having to deal with him.</p>\n<p align=\"center\">~</p>\n<p>Lan Xichen is bowing to Jin Guangyao when Jingyi hisses, “Look, look, there she is!”</p>\n<p>Wangji stiffens but doesn’t turn around. Jin Guangyao tilts his head to the side and Lan Xichen huffs a laugh. “Wu Yingtai,” he murmurs.</p>\n<p>His face clears, the skin around his temples twitching like he’d roll his eyes if they were alone. “Oh, good, I’ll finally get to meet her. A-Ling is quite taken with her as well.”</p>\n<p>“Oh, Lans!” a familiar voice calls out excitedly and Lan Xichen doesn’t bother to hide his smile. “Lan Wangji, Lan Wangji, are you ignoring me? What shameful behavior from the notorious Hanguang Jun!”</p>\n<p>Lan Xichen turns, which means the rest of them are able to as well. Wu Yingtai is wearing new purple silk robes embroidered with silver lotuses, her hair in its customary style of mostly loose around her as she waves at them. There is, however, a silver ornament in her hair that Lan Xichen vaguely remembers Jiang Yanli wearing during her stay in Cloud Recesses. Jiang Wanyin sighs deeply, shooting her an irritated glance, but the retinue of Jiang disciples behind them are biting their cheeks to keep from laughing.</p>\n<p>They finish the climb up the steps, and Wu Yingtai is pink cheeked but not winded, and its such a contrast to the way she’d struggled to climb the steps to Cloud Recesses just a few months ago. Whatever her health problems may have been, it’s clear they’re improving. She’s not as frighteningly skinny as she used to be either.</p>\n<p>Sizhui is the one to break away, which Lan Xichen hadn’t been expecting. He crosses the space between them but freezes when he gets in front of them, like he hadn’t even realized he was moving in the first place. Jiang Wanyin raises an eyebrow but Wu Yingtai laughs, easily folding Sizhui into her arms. “My sweet boy coming to greet me properly! Making up for your father’s poor manners, I see.”</p>\n<p>“Wu Yingtai,” Sizhui says, embarrassment turning his ears red, but he doesn’t pull away from her. “It’s good to see you again.”</p>\n<p>“I’m glad you’re here! Even if it’s all going to be frightfully dull, I’m afraid, these things always are. You’ll have to keep my company.”</p>\n<p>Sizhui pulls back to look at her face and whatever he finds there causes him to beam. “I would love to.”</p>\n<p>She smiles and curls an arm around his shoulders, steering him back over to them. Jingyi is shifting his weight in a way that’s not quite bouncing on the balls of his feet. “Wu Yingtai! You’re here!”</p>\n<p>“I’m here,” she says agreeably, but her smile is warm. It warms even further when her eyes land on his brother. “Lan Wangji, are you ignoring me?”</p>\n<p>“How could I?” he asks, perfectly polite, nothing in his voice or face to show he’s being anything but completely sincere.</p>\n<p>Wu Yingtai scowls and points at him. “Lan Wangji, are you saying I’m loud? That I’m improper? That I lack decorum?”</p>\n<p>“I did not say that,” he says. His voice doesn’t fluctuate at all. It doesn’t dip into something more familiar or raise into a mocking tone.</p>\n<p>She laughs at him, eyes sparkling. “I’m going to remember that, Lan Wangji.”</p>\n<p>“A-Ying,” Jiang Wanyin says. He sounds exasperated, but not angry. Lan Xichen doesn’t understand. Even if he can’t tell that Wangji is flirting with Wu Yingtai, surely he can tell that she’s flirting with Wangji, and yet he doesn’t shout or yank her away. He’s glaring, but that’s a rather mild reaction from him, all things considered, and hardly means anything at all.</p>\n<p>“Oh, right, right, sorry!” She squeezes Sizhui’s shoulder and then lets go to walk with Jiang Wanyin to stand in front of Jin Guangyao. Wu Yingtai bows just seconds behind Jiang Wanyin, so close together that he can’t be certain that it was even on purpose. Maybe she meant to bow at the same time as him, even. The Jiang disciples wait a beat before following suit, mirroring their sect leader and Wu Yingtai.</p>\n<p>“Sect Leader Jin,” Jiang Wanyin says formally, “thank you for the invitation.”</p>\n<p>There’s an uncharacteristic moment of silence, then Jin Guangyao says, “Ah, yes, I – yes, of course. Be welcome.”</p>\n<p>There’s an odd, strangled note to Jin Guangyao’s voice that Lan Xichen doesn’t think he’s heard before, even during the war, and he looks at him in alarm. He’s too pale, staring at Wu Yingtai with wide eyes. Lan Xichen follows his gaze to her face, and doesn’t see anything remarkable, but then his gaze dips a little lower to her outstretched hands and he sees what Jin Guangyao must have.</p>\n<p>The motion of bowing has pulled her sleeves up past her wrists. On her right hand is Zidian.</p>\n<p>He stares, for a moment so surprised he can do nothing else. Jiang Wanyin has made no official announcement, but perhaps he feels as if he doesn’t need to. At this point, it would only be insulting. How could anyone look at Wu Yingtai and doubt her position?</p>\n<p>She’s wearing new robes of silk with the Jiang colors and symbol, she has Jiang Yanli’s ornament in her hair, and she has Jiang Wanyin’s spiritual tool on her wrist. Jin Ling has been the only other person to wield it since Yu Ziyuan’s death, except now it’s on Wu Yingtai’s hand. Zidian is a first class spiritual took, not a piece of jewelry. While Lan Xichen would not hesitate to hand over Liebing to Wangji if he had need of it, it’s not something he would do casually. If it had belonged to his mother, he’d be even more reluctant to let others handle it.</p>\n<p>Yet there Zidian is, on Wu Yingtai’s hand as if it’s always been there, as if it means nothing at all, when of course it means everything.</p>\n<p>Lan Xichen supposes it won’t be long until they’re referring to Wu Yingtai as Madame Jiang.</p>\n<p>“Thank you,” Jiang Wanyin says after a moment, looking at Jin Guangyao strangely. The Jiang head inside. Jingyi and Sizhui take a step after them, intending to follow, before they remember that they can’t enter the main hall until after he and Wangji do.</p>\n<p>He looks towards his brother, but he remains as serene as ever. Whatever his feelings he may be having about Wu Yingtai wearing Jiang Wanyin’s spiritual tool, he’s pushing them down enough that even Lan Xichen can’t read them.</p>\n<p align=\"center\">~</p>\n<p>“That was weird, right?” Wei Wuxian mutters, walking close enough to Jiang Cheng that their sleeves brush against each other.</p>\n<p>“No, shut up,” he says automatically before scowling and admitting, “A little bit, yeah. But it’s impossible for him to know it’s you, and if he’d recognized you as Mo Xuanyu, he would have done something more than look a little surprised.”</p>\n<p>That’s true enough. “Maybe he was caught off guard by my beauty.”</p>\n<p>“He’s married to someone much prettier than you,” Jiang Cheng retorts.</p>\n<p>“Prettier than <em>me?</em>” he demands, laying a hand across his chest. “Impossible!”</p>\n<p>Jiang Cheng rolls his eyes, but anything he has to say to that off is cut off by his favorite nephew yelling, “Aunt Ying!”</p>\n<p>He grins as he turns, arms already open to catch his nephew against his chest. “A-Ling! Have you been good? Did anything interesting happen?”</p>\n<p>“No,” he says and doesn’t clarify which question he’s answering. He lowers his voice to ask, “Is everything okay back home?”</p>\n<p>It warms him that Jin Ling calls Lotus Pier home even though he’s the Jin sect heir. “As well as can be expected, although no real change yet,” he says, knowing that he’s really asking after Xiao Xingchen.</p>\n<p>Jin Ling pulls a face but just nods.</p>\n<p>“A-Ling, who’s this?”</p>\n<p>Wei Wuxian turns to see a beautiful woman in golden robes so elaborate that she has to be the sect leader’s wife. “Aunt Su,” Jin Ling says, “this is Aunt Ying.”</p>\n<p>Her face clears and she inclines her head. “Ah, the infamous Wu Yingtai. I’ve heard so much about you from my nephew.”</p>\n<p>“It’s all lies,” Wei Wuxian says confidently.</p>\n<p>Jiang Cheng pinches the bridge of his nose while Jin Ling sighs.  “A-Ying. Please.”</p>\n<p>“Sect Leader Jiang,” Qin Su says formally, which is <em>weird</em> because they share a nephew. Then again Jiang Cheng’s… everything doesn’t really invite closeness. “It’s nice to see you attending these conferences with someone else.”</p>\n<p>She sounds sincere, but Jiang Cheng’s face clouds over anyway. “Well, you better get used to it,” he snaps, “A-Ying isn’t going anywhere.”</p>\n<p>“A-Cheng,” Wei Wuxian starts, sighing, but Jiang Cheng just glares at her before going off to harass someone on the other side of the hall, dragging a sighing Jin Ling along with him. He <em>isn’t </em>going anywhere, and he’s hardly going to give up his chance to help lead the Jiang like he’d wanted to and couldn’t in his previous life, but no one outside of the clan is going to understand that little temper tantrum. He turns back to Qin Su and offers her a shallow bow, “Please, excuse us.”</p>\n<p>“Of course,” she says, and instead of being offended there’s a fond smile in the corner of her mouth. “It’s good to see he’s found someone like you.”</p>\n<p>Oh no, she thinks that – well, fuck. “It’s not like that.”</p>\n<p>Qin Su gives her a tolerant, sisterly glance that makes Wei Wuxian want to die. “I understand. It wasn’t like that between A-Yao and I either. I’d love to introduce you around.”</p>\n<p>“It’s really not,” he starts, and really doesn’t know where to go from there without mentioning that Jiang Cheng is his brother, so he changes tracks and says, “Thank you, that’s really nice of you, but I actually already promised my company to someone else.” He looks around the room and luckily Sizhui is already staring at him, a look on his face that Wei Wuxian doesn’t understand and doesn’t have the time to categorize.</p>\n<p>He waves him over and Sizhui appears with gratifying quickness, Jingyi hot on his heels. “Wu Yingtai?” Sizhui asks, stepping so close to him that Wei Wuxian has to lean back to get enough space between them to take his arm.</p>\n<p>“I promised we’d keep each other company,” he says to Qin Su.</p>\n<p>She appears perplexed, but her smile remains entirely genuine. “Of course. We’ll speak later.”</p>\n<p>“Looking forward to it,” he says, which is a complete lie, although he keeps his fake smile in place until her back’s turned.</p>\n<p>It’s a miracle that anyone makes it through these in one piece, either physically or emotionally.</p>\n<p>He uses the hand that’s not holding on to Sizhui to reach out and tug on Jingyi’s hair. “How’d you get roped into attending? Usually only the senior disciples are forced to attend this crap, unless Zewu Jun is getting creative with his punishments.”</p>\n<p>“I volunteered,” he says, ducking away from her hands. “Shouldn’t you be rubbing elbows with the sect leaders with Sect Leader Jiang?”</p>\n<p>His shudder isn’t exaggerated in the slightest. “A-Cheng is fine. I’ll interfere if he draws Sandu, otherwise he’s on his own. Why don’t you introduce me to everyone here who isn’t the worst? Ouyang Zizhen is supposed to around here somewhere, isn’t he?”</p>\n<p>Sizhui smiles up at him, so sweet and warm that he has to resist the strange urge to pinch his cheeks.</p>\n<p align=\"center\">~</p>\n<p>Lan Wangji keeps half his attention on Wu Yingtai without really meaning to. He sees Qin Su approach her and is far from surprised. The three major sect leaders have remained unmarried for over a decade, so she’s probably eager to make friends with the future wife of a sect leader, especially when that sect leader is Jiang Wanyin. The Jin and the Jiang are close allies less because they genuinely like or respect each other but because of Jin Ling. Qin Su likely sees it as her and Wu Yingtai’s duty to deepen that connection and foresees Wu Yingtai being the same kind of wife to Jiang Wanyin that she is to Jin Guangyao.</p>\n<p>He doubts that’s going to come to pass.</p>\n<p>Wu Yingtai avoids everyone of import the whole night, instead spending most of her time with the juniors except for the few times that Jiang Wanyin looks genuinely furious, and then she slips away just long enough to say something foolish and ridiculous, shifting everyone’s attention off of Jiang Wanyin and onto her. They’re horrified but Jiang Wanyin’s scowl softens to something that Lan Wangji thinks might count as fond.</p>\n<p>He notices Nie Huaisang’s eyes on her for most of the night, an uncharacteristic intensity to his gaze as he glances at her over his fan, and Lan Wangji can’t help the curl of amusement in his chest. Possibly he’s just curious about Jiang Wanyin’s fiancé, since they used to be friends. Possibly he finds Wu Yingtai just as compelling as Lan Wangji does.</p>\n<p>The night is coming to a close by the time he finds himself across from her once more. He and Xichen are discussing the schedule for tomorrow, the official start of the conference, when a laughing Wu Yingtai is dragged over to them by a delighted Jingyi and mortified Jin Ling. Sizhui’s mouth is pressed together in a tight line, an expression that Lan Wangji recognizes from his own face. He’s trying to appear angry but he’s just amused. Ouyang Zizhen is holding his head in his hands and it’s actually a fairly impressive to display of cultivation that he’s able to navigate around the hall with his eyes covered.</p>\n<p>“Aunt Ying is in time out,” Jin Ling declares, his face red. “I can’t believe you said that!”</p>\n<p>“If they’re going to ask rude questions, then they’re going to get rude answers,” she says carelessly. Her smile is bright and unrepentant and at once reminds him of Wei Ying and is still entirely herself that he feels as if his heart is being carved out of his chest. He still has to push down the urge to smile back at her. “Zewu Jun, Lan Wangji, it seems as if you have no choice but to entertain me, as I’m currently being held hostage.”</p>\n<p>“It’s quite a terrible situation you’ve found yourself in,” Xichen says gravely, his lips curled up in the corners.</p>\n<p>“Zizhen!” Sect Leader Ouyang shouts, making a spectacle of himself as he stomps his way over to them, grabbing everyone’s attention. “Stop bothering everyone!”</p>\n<p>Ouyang Zizhen drops his hands and hides behind Wu Yingtai, who just rolls her eyes. “I’m not!”</p>\n<p>“He’s really not,” Wu Yingtai says. “We met at that night hunt in Yi City, I’m sure you heard about it? You must be so proud of him, your son is very impressive.”</p>\n<p>Lan Wangji is pretty sure that mostly what Ouyang Zizhen did was follow Wu Yingtai’s directions without screaming, but considering how many of the juniors hadn’t managed to do that, perhaps it is an impressive feat.</p>\n<p>Jiang Wanyin is staring at them from across the room, a scowl that almost looks concerned on his face. He abandons his conversation to head their way, which is unfortunate and confusing. Sect Leader Ouyang is hardly a threat to Wu Yingtai.</p>\n<p>“Lady Wu,” Sect Leader Ouyang gruffly, inclining his head. “Thank you for your assistance on that night hunt. I’m told I would be down a son and several disciples if you hadn’t been there.”</p>\n<p>She waves a hand dismissively, as if she’d hardly done anything at all. “Oh, I really didn’t-”</p>\n<p>“Do it for praise,” Jiang Wanyin interrupts as he stops at her side, standing closer to her than he has anyone else all night. “A-Ying was of course fulfilling her duty as a senior disciple of the Jiang.”</p>\n<p>Ah. Jiang Wanyin wants to ensure that her graciousness doesn’t give Sect Leader Ouyang the impression that the Jiang aren’t keeping score, because Jiang Wanyin very much is.</p>\n<p>“Senior disciple,” Sect Leader Ouyang repeats, his gaze briefly dipping to down to where Zidian is on Wu Yingtai’s hand. “Right. Well, clearly you’re good with children, if even my dishonorable son will listen to you. You’ll make a good mother to your own gaggle of kids. I can barely handle the one!”</p>\n<p>Lan Wangji sees Wu Yingtai blush properly for the first time since he’s known her and he thinks he forgets to breathe. Her voice is wistful when she says, “Do you really think so? Three’s a good number, I think, so at least that many. A-Ling could use some cousins.” </p>\n<p>Jiang Wanyin rolls his eyes, but there’s something soft and fond in his face. Their children will be a force of nature, he thinks, with Jiang Wanyin’s temper and Wu Yingtai’s fearlessness.</p>\n<p>“And what do you think of that, Sect Leader Jiang?” Sect Leader Ouyang asks, a teasing lilt to his voice. “How many do you want?”</p>\n<p>Jiang Wanyin blinks, genuinely taken aback. “What? None. Jin Ling was enough for me.”</p>\n<p>There’s a long, awkward beat of silence, while they all stare at him and Jin Ling slowly turns red. Lan Wangji doesn’t understand. Jiang Wanyin needs heirs, and his fiancé clearly wants to have children, why would he put his clan at risk like that? Why would he deny her?</p>\n<p>He can’t quite help the curl of resentment. Wu Yingtai wants to have children with him. Why wouldn’t he want such a thing?</p>\n<p>“Jiang Wanyin!” Sect Leader Ouyang shouts. “How can you treat your fiancé so cruelly?” Lan Wangji can’t believe he’s being forced to agree with Sect Leader Ouyang. “Lady Wu will surely leave you if you refuse to give her children!”</p>\n<p>Wu Yingtai immediately covers her face with her hands, Jiang Wanyin turns an unhealthy shade of grey, and Jin Ling scrunches up his nose and says, “Gross.”</p>\n<p>Jiang Wanyin takes a deep breath. “You – how dare you – why would you–”</p>\n<p>“You can’t neglect your marital duties!” Sect Leader Ouyang says authoritatively. “My wife becomes quite cross if I’m neglectful! It’s an important aspect of a healthy marriage.”</p>\n<p>Ouyang Zizhen makes a strangled sound then echoes Jin Ling, “<em>Gross</em>.”</p>\n<p>“I AM NOT ENGAGED TO A-YING!” Jiang Cheng roars, facing rapidly going from grey to red. “THERE WILL BE NO MARITAL DUTIES!” He reaches for his sword, seemingly barely restraining himself from unsheathing it. The rest of the hall has gone quiet, everyone’s attention on them.</p>\n<p>Wu Yingtai’s shoulders are shaking, her face still covered. Is she crying? Has Jiang Wanyin’s denial of their relationship moved her to tears?</p>\n<p>“Really, Sect Leader Jiang, just because you haven’t made a formal announcement doesn’t mean the rest of us can’t tell,” Sect Leader Ouyang chides. “You’re both so obvious.”</p>\n<p>“I am not nor will I ever be engaged to Wu Yingtai!” he shouts. “That’s disgusting! Spew any more filth and I’ll cut out your tongue!”</p>\n<p>Wu Yingtai lifts her head, and there are tears down her cheeks, which makes Lan Wangji cold, but then he sees that there’s also a grin stretching across her face.</p>\n<p>She’s laughing. She’s laughing so hard she’s crying, only able to stay upright because of the grip an alarmed Sizhui has on her elbow. “A-Cheng,” she gasps, “don’t – don’t you want to make and h-honest woman out of me?”</p>\n<p>“Shut up!” he says furiously. “As if anyone could! Who would want to marry you?”</p>\n<p>Lan Wangji sees Xichen turn to him out of the corner of his eye and for the first time in his life considers the merits of fratricide.  </p>\n<p>Wu Yingtai is still having trouble getting her words out between her giggles, but she turns to Sect Leader Ouyang and says, “A-Cheng and I are dear friends, but we’re not involved.”</p>\n<p>“But,” he blinks. “You – you sit on the Lotus Throne. You wear his sister’s clothes and jewelry. You lead the disciples. You’re carrying Zidian. You are more than a dear friend. How do you explain that?”</p>\n<p>“She’s my <em>heir</em>,” Jiang Wanyin snaps, still so appalled at all of this, although now he’s edged past being flushed with embarrassment to being green around the edges. It can’t be healthy for him to turn so many different colors so quickly.</p>\n<p>Wu Yingtai startles. “I am?”</p>\n<p>A Jiang disciple slaps a hand over her face in the crowd while several more let out exasperated sighs. Lan Wangji might be able to find humor in that at another time, but for now he’s barely able to process it, still so focused on what’s happening in front of them. It can’t be. She and Jiang Wanyin are engaged. Everyone knows. They’re so obvious with each other.</p>\n<p>“What else would you be?” he asks, something about him a challenge and a warning, which Lang Wangji doesn’t understand at all.</p>\n<p>“Ah,” she says, “right, good point. I guess I didn’t really think about it? But there you go, I’m A-Cheng’s heir, not his fiancé.”</p>\n<p>Jiang Wanyin makes a retching noise and says, “I refuse to discuss this anymore,” before turning on his heel and walking away.</p>\n<p>“Uncle, wait,” Jin Ling calls out plaintively, scurrying after him. “Don’t leave me with them!”</p>\n<p>“A-Ling!” Wu Yingtai shouts, but he doesn’t even glance back at her, and it sets her off on a new round of giggles.</p>\n<p>Sect Leader Ouyang throws her look that’s faintly alarmed and bows at all of them before dragging his son away in the opposite direction that Jiang Wanyin and Jin Ling had gone.</p>\n<p>When she settles, she has an arm around Sizhui’s shoulders, her hair ribbon having come loose in the commotion so it’s all a wavy mess. “That was fantastic. Did you see his face?”</p>\n<p>Lan Wangji can’t make his own face work properly, all of it too numb to force a smile or proper words to come out of his mouth.</p>\n<p>“You’re truly not engaged to Sect Leader Jiang?” Xichen asks. Lan Wangji refuses to turn to see his brother’s expression.</p>\n<p>She blinks, genuinely taken aback. “Zewu Jun! I didn’t know that you’d heard those rumors. Doesn’t your clan have a rule against gossiping?” Her lips thin as she presses them together and Lan Wangji would be alarmed if he couldn’t tell she was doing it to suppress her laughter. “Did you think we were engaged when we were at Cloud Recesses? We spent so much time alone together! Didn’t you think it was terribly scandalous?”</p>\n<p>“It wasn’t my place to judge,” Xichen says diplomatically, which of course means yes, he did.</p>\n<p>“Such a gentleman,” she says, still teasing. “A-Cheng is very dear to me, but no, we’re not engaged. Nor am I engaged to anyone else! Rumors are such nasty things.”</p>\n<p>“Do you want to be?” Sizhui asks, looking up at her with wide eyes.</p>\n<p>Betrayed by his own son. He’s finally starting to get the appeal of entering seclusion.</p>\n<p>She tilts her head to the side, considering. “I never really thought about it, I suppose. I wasn’t just messing with Sect Leader Ouyang, I do want children again, so a spouse seems like they’d help with that sort of thing. But I suppose that’s up to A-Cheng. Since I’m his heir, my marriage is his problem.”</p>\n<p>“Again?” Lan Wangji speaks without thinking and regrets it as soon as the words leave his lips. There’s no good answer to the question.</p>\n<p>“Again what?” Wu Yingtai asks.</p>\n<p>He means to change the subject, but Jingyi says, “You said have children <em>again</em>. Are you already married? Do you have kids now? Where are they?” He looks around, like kids will appear out of nowhere, coming to run and cling to her skirts.</p>\n<p>Lan Wangji watches her face, sees the way her smile almost slips before stretching wider than it was before and how her eyes focus on something they can’t see, and he knows that look. He’d seen it on Wei Ying’s face so many times as he hid his hurt under his smile. He hates being the reason for it on Wu Yingtai’s face as much as he’d hated being the reason for it on Wei Ying’s. “Had, I suppose. Just the one. He was nearly four when – well, it doesn’t matter.” Jingyi is horrified, his face scrunched up like he’s about to start crying, and Wu Yingtai’s soft laughter sounds entirely genuine as she reaches out to smooth the line between his eyebrows. “None of that, okay? It’s in the past now. I wasn’t ever married, it wasn’t like that. He was just mine.”</p>\n<p>Xichen opens his make to say something, something sympathetic and appropriate that will hopefully do something about the hollowness in the center of his chest, but Sizhui says, “I’m sorry, Wu Yingtai. That’s terrible.”</p>\n<p>She reaches out to pinch Sizhui’s cheeks, her whole body language relaxing into something a little less fraught. “You remind me of him, you know? You’re sweet, just like he was. I like to think if he’d been able to grow up, he would have grown into a young man just like you.”</p>\n<p>Sizhui flushes even as his eyes darken, as if her grief is his own, and as usual a flood of fondness for his son fills all the empty spaces inside of him.</p>\n<p> “I wouldn’t trade it for anything,” she says, and her pain has softened, replaced by a tender sort of longing. “Not a single, terrible moment of any of it. Those terrible moments are far too precious to me.”</p>\n<p>“Some things,” he says, and he can’t stop himself from speaking for some reason, the memory of Wei Ying on a rooftop with two jars of Emperor’s Smile hanging from his fist sitting beneath his tongue, “are worth losing if that’s the price to pay for having them.”</p>\n<p>Wu Yingtai’s eyebrows rise and her mouth parts before curving into a smile. Her grey eyes are warm as they look into his and for a moment he forgets he’s standing in front of his brother and his son, he forgets that he’s in the middle of the Jin banquet hall, and all that exists is Wu Yingtai looking at him, is her seeing him.</p>\n<p>“Yes,” she says, the only person in the world in this moment, “exactly.”</p>\n<p align=\"center\">~</p>\n<p>Jiang Cheng may not be the most observant person in the world, but it’s not like he’s managed the past thirteen years being a sect leader by being totally oblivious. Besides, it doesn’t take much to notice if he’s going to be so obvious about it.</p>\n<p>“Maybe we shouldn’t have left her with them,” Jin Ling says, squinting. “Did you see Hanguang Jun’s face while you were yelling? You know, he was acting weird with her in Yi City too. Are you going to do something about that?”</p>\n<p>If even <em>Jin Ling</em> has noticed, then clearly something has to be done about it.</p>\n<p>It also means that perhaps he and Wei Wuxian have to reexamine several things that happened during the war, but that’s for later tonight, when they’re alone.</p>\n<p>But regardless of where or if it goes anywhere, there’s something that should be made clear.</p>\n<p>He waits for Lan Xichen to be alone before coming to stand next to him, eyebrow raised. “Sect Leader Jiang,” he greets, but there’s tension around his eyes that shows he’s already expecting the conversation they’re about to have.</p>\n<p>“Sect Leader Lan,” he says. He considers for half a moment approaching this tactfully but decides against it. If they wanted to be proper about this, Lan Wangji shouldn’t have looked at his brother like that. “Wu Yingtai is a treasured member of my clan. She’s going to <em>remain </em>a treasured member of my clan.”</p>\n<p>He’s pretty sure the second he tells Wei Wuxian that Lan Wangji is interested in him and actually gets the idiot to <em>believe </em>it, he’ll insist on coming clean. Jiang Cheng wants these boundaries made clear before that happens. He just got his brother back and he’s not giving him up to Lan Wangji. Either because Lan Wangji is just terrible about expressing his feelings and <em>also</em> liked Wei Wuxian before his resurrection or because he hates him and wants him dead. He’s not willing to lose his brother again, either through death or marriage.</p>\n<p>Lan Xichen doesn’t do him the disservice of pretending to misunderstand, at least. “She did say that her marriage would be up to your discretion.” Jiang Cheng just raises an eyebrow, waiting. Lan Xichen sighs. “This is, of course, all theoretical. How would you feel about Wangji marrying into your clan?”</p>\n<p>He doesn’t gape but it’s a near thing. This isn’t really how he thought this conversation would go. He was honestly expecting them to mutually agree to allow their brothers to living in sin since neither of them would be willing to give them up. “You’re not serious. He’s the Second Jade of Lan.”</p>\n<p>“He’s my brother,” Lan Xichen says quietly, looking right at him with a grief that Jiang Cheng hadn’t expected and doesn’t know what to do with. “He hasn’t been happy in thirteen years. I think that he could be, with her. Once I put something else before my brother’s happiness and I regret it every day. I won’t make the same mistake twice.”</p>\n<p>“Thirteen years,” Jiang Cheng echoes. That almost sounds like – but surely if Lan Wangji had cared <em>that much </em>he would have said something –</p>\n<p>Lan Xichen’s lips twist into a rueful grimace. He visibly hesitates for a moment, then says, “This is not the first time I’ve contemplated the idea of Wangji joining the Jiang clan. Under different circumstances, I believe we would have had this discussion already.”</p>\n<p>They can’t be having the conversation that he thinks they’re having. “I thought Lan Wangji hated my brother.”</p>\n<p>He startles, then says, “It’s been a long time since I’ve heard you refer to Wei Wuxian as your brother.” Fuck. “No, of course not. Wangji never hated him. Far from it.”</p>\n<p>Unbelievable. Of course it would be asking too much for Lan Wangji to have ever communicated that in any sort of obvious way. Wei Wuxian may be an idiot, but he’s pretty sure his brother would have noticed a love confession.</p>\n<p>Jiang Cheng is saved from having to come up with some sort of response to this nonsense by Qin Su storming into the banquet hall, an older woman trailing behind her with her eyes lowered. “Jin Guangyao!” she shouts, her voice pitched to fill the room even as it trembles. Everyone falls instantly silent. “You <em>knew</em> I was Jin Guangshan’s daughter and you married me anyway?”</p>\n<p>Lan Xichen’s eyes widen. Jiang Cheng frowns and pinches the skin of his wrist. If he’s in the middle of a dream right now, that would explain several things.</p>\n<p>The doors burst open. A scarred woman stumbles into the banquet hall and announces, “I was there the night Sect Leader Jin killed his father!”</p>\n<p>“Darling, please,” Jin Guangyao starts, but is cut off by a dark figure bursting in through the window and heading straight for Qin Su.</p>\n<p>It’s, somehow, impossibly, Wen Ning.</p>\n<p>“Oh, I see,” Jiang Cheng says, reaching for Sandu. “This is a nightmare.”</p>\n<p align=\"center\">~</p>\n<p>By the time Lan Wangji has wrapped his hand around Bichen, Wu Yingtai has rushed to stand in front of Qin Su, once more using herself as a shield and putting herself in harms way. He gets the impression that if he plans to stick around her then this is something he’s going to have learn to anticipate.</p>\n<p>He intends to get in front of her, to put a stop to Wen Ning, but Wu Yingtai pulls her arm back and Zidian sparks up her wrist then unfurls behind her. She arcs it forward, the purple crackling whip coming down in front of her and then snapping forward off of her wrist. For a moment Lan Wangji worries that she’s lost control of it but then it hits Wen Ning in the center of the chest, the whip wrapping around his torso and restraining him in place.</p>\n<p>Wu Yingtai doesn’t look away from the paralyzed Wen Ning as she gestures to a group of the Jiang disciples and orders, “Protect Qin Su.”</p>\n<p>They don’t hesitate, two Jiang cultivators surrounding Qin Su, hands on their swords, but Lan Wangji isn’t focused on them.</p>\n<p>“It’s all right,” Wu Yingtai says, addressing the banquet hall as she takes confident steps forward. “I’ll handle this.”</p>\n<p>Lan Wangji risks a glance around. The Jiang disciples have pushed themselves to the front, acting as a loose barrier to keep everyone back and away. He wonders if they knew to do that or if Wu Yingtai gave them some sort of signal that he missed.</p>\n<p>He slowly steps closer. Her gaze briefly flickers towards him, but she doesn’t tell him to stop. Instead she’s focused back on Wen Ning. He expects her to reach for her daggers, for her talismans, but instead she steps so close to Wen Ning that there’s barely any distance between them.</p>\n<p>“It’s alright,” she says, low enough that her words are clearly meant for the fierce corpse she has restrained rather than all the people around her. She places one of her hands on his shoulder, using it for balance as she goes to her tip toes and carefully reaches into Wen Ning’s hair. She runs her fingers across the back of his scalp, and then her hand comes to a stop and a complicated look crosses her face. “It’s okay, I’ve seen this before. It’s okay, you’re going to be okay.”</p>\n<p>She yanks and a thick, bloody needle falls from the back of Wen Ning’s head. He snarls, jerking away from her, his barred mouth coming dangerously close to her neck.</p>\n<p>Wu Yingtai doesn’t flinch, just removes her hand from his shoulder to cup his jaw, her thumb making soothing stroking motions against his cheek. “I know, I know. This sucks, huh? But its going to be okay. I’m going to make it okay.”</p>\n<p>She pulls out another large, bloody needle, almost more like a spike, but Lan Wangji barely notices it clatter to the ground. He’s seen this before. Looking at her now, he’s back in the Burial Mounds, Sizhui in his arms as Wei Ying performs a miracle while he’s useless and his throat is closed in fear as Wei Ying shows a tenderness to a fierce corpse that Lan Wangji has never seen before or since.</p>\n<p>Until now.</p>\n<p>A third, final needle falls to the ground and Wu Yingtai pats Wen Ning’s chest, saying, “There, lets give that a few hours for the effects to wear off, yeah? It’ll be – uh, yeah, Lan Wangji?”</p>\n<p>Once again he hadn’t intended to move, but here he is, Wu Yingtai’s wrist in his hand, both of them so close to Wen Ning and so far away from everyone else. She confused again, and its like being back in the Mingshi again, except this time he knows why he’s holding onto her, why he can’t let her go.</p>\n<p>It’s impossible. It’s <em>impossible</em>.</p>\n<p>It’s the only thing that makes sense.</p>\n<p>“Wei Ying,” he breathes, soft enough that no one else can hear him.</p>\n<p>She flinches.</p>\n<p>He tugs her forward, so she’s pressed against him like that day she ran into him, and curls his other arm around her waist. He lowers his head so he can speak directly into her ear. “Wei Ying.”</p>\n<p>She breathes out, shuddering in his arms, then mutters, “Lan Zhan. Not here.”  </p>\n<p>He turns his face to bury it in Wei Ying’s hair, attempting to hide his smile from everyone else.</p>\n<p>Explanations can come later. For now, Wei Ying is alive, and in his arms, and that’s enough.</p>\n<p>Lan Xichen takes a moment in the middle of everything happening to be grateful that he and Jiang Wanyin had discussed the situation already.</p>\n<p>His reserved, proper little brother is curled around Wu Yingtai, his face pressed into her hair. He thinks they’re speaking, but he can’t hear what they’re saying, can only see the possessive way Wangji’s arm is pressed against Wu Yingtai’s waist.</p>\n<p>Wangji lifts his head and for a moment Lan Xichen is certain that Jiang Wanyin is correct and this is some kind of dream or hallucination. He’s smiling. His brother is <em>smiling</em>.</p>\n<p>Wu Yingtai looks up at him and seems to get caught in that same smile that’s stopped Lan Xichen cold. They stare at each other for a long moment, and there’s some yelling between Qin Su and the newly arrived woman and Jin Guangyao, and people are turning to that since it’s apparently more interesting than the neutralized fierce corpse, but Lan Xichen can’t look away. Wu Yingtai’s face turns  bright red and her mouth drops open. She licks her bottom lip and Wangji’s eyes dip briefly to watch her mouth. Jiang Wanyin makes an outraged noise at his side.</p>\n<p>“You,” Wu Yingtai starts, then blinks several times. She reaches out a hand, almost touching his brother’s cheek, but doesn’t.</p>\n<p>“Mn,” he hums, then tilts his cheek so it rests in her palm.</p>\n<p>She turns an even deeper shade of red and then shifts to hide her face in Wangji’s chest, a change that his brother seems more than fine with, if the way his smile twitches at the corner of his mouth is any indication.</p>\n<p>Lan Xichen doesn’t know if he’s ever seen Wangji smile quite like this. Surely it’s worth losing him to the Jiang if it keeps that look on his face.</p>\n<p>Then several of the things Jin Guangyao is being accused of sink in and he snaps his head around, thrusting himself into the fray.</p>\n<p>It can’t be true.</p>\n<p>Can it?</p>\n<p align=\"center\">~</p>\n<p>The Jiang disciples aren’t letting anyone pass, keeping up the honor guard even as people converge around Sect Leader Jin. Jingyi is tugging at his sleeve in a way that would be irritating from anyone else, but Sizhui knows how fidgety Jingyi gets when he’s nervous.</p>\n<p>He walks up the nearest Jiang disciple, opening his mouth to give some sort of explanation as to why they should let him through, but he doesn’t need one. She steps aside for him easily and raises an eyebrow at Jingyi but sees the way he’s clutching to Sizhui’s sleeve and lets them both pass.</p>\n<p>Maybe it’s because they know he’s Hanguang Jun’s son. Maybe its because they’ve seen him spend most of the night with Wu Yingtai. Whatever the reason, he’s grateful for it. He knows accusations of incest and patricide should probably be the more pressing concern, but there are plenty of important, powerful people here, his uncle among them. They’ll figure it out and all he wants to do is find his father and his – and find Wu Yingtai.</p>\n<p>He stops short in front of them, wary of the fierce corpse, but Wu Yingtai brightens when she sees him and says soothingly, “It’s alright, there’s no need to look like that! Everything’s fine.” She steps away from A-die, flinging out her hand so Zidian slithers from around the fierce corpse to settle back around her wrist.</p>\n<p>Jingyi takes in a loud, startled breath as if he’s about to yell, but the fierce corpse doesn’t move, just continues standing there with a strangely blank look on his face. He still inches halfway in front of Sizhui anyway, hand half raised in the direction of his sword even though he’s clearly terrified, and sometimes Sizhui loves his best friend so much it threatens to suffocate him.</p>\n<p>He nudges his elbow into Jingyi’s side and moves to stand beside him. “Wu Yingtai, what’s going on?”</p>\n<p>She taps her bottom lip, looking toward where everyone is converged, where Qin Su and the other woman are speaking that’s mingled with an awful lot of yelling. “I have no idea, but I bet Nie Mingjue’s head is around here somewhere.”</p>\n<p>What.</p>\n<p>Sizhui turns to A-die, in case that makes any sort of sense to him, but he just looks to Wu Yingtai and raises an eyebrow. He remembers how he’d looked before, smiling with her in his arms, and Sizhui hopes that’s something that doesn’t have a logical, sensible explanation, he hopes his father just did it because he wanted to and Wu Yingtai let him for the same reason. But, unfortunately, they have more important things to worry about.</p>\n<p>“Oh, we found his headless body in Yi City,” she says, like that’s some sort of acceptable explanation. “Someone is clearly pulling some strings with this whole mess and Nie Mingjue is involved, somehow, so I bet his missing head is around here. I think it’s connected to the ghost sword too.”</p>\n<p>“Hm,” A-die looks at the fierce corpse. “We cannot leave him behind to go looking. He’s in no state to defend himself.”</p>\n<p>Wu Yingtai’s eyes widen and then she’s beaming, tugging on A-die’s sleeve in a way that reminds him of Jingyi. “Of course we can’t! I could have a couple disciples look after him but I don’t want him to wake up with me gone again.” Another use of the word again that makes no sense, but Sizhui elbows Jingyi in the side before he can question it. “I could speed up the process, maybe? Otherwise it could take a few hours. But he should be able to come back to himself at his own pace!”</p>\n<p>A-die nods, but says, “Do you think it will be less jarring for him for his awareness to come back slowly rather than all at once, considering?”</p>\n<p>She looks around at the chaos they’re surrounded by and grimaces. “Okay, good point.”</p>\n<p>Sizhui doesn’t understand what they’re talking about. Awareness? Back to himself? This is a fierce corpse. They don’t have any awareness! By the uneasy way Jingyi is shifting his weight next to him, he’s thinking the same thing.</p>\n<p>Wu Yingtai motions them away then pulls a blank slip of talisman paper from her sleeve and one of her daggers, pricking her finger to draw out a complicated design that Sizhui quickly loses the ability to follow.</p>\n<p>Then she slaps it against the fierce corpses forehead and takes a couple hasty steps back.</p>\n<p align=\"center\">~</p>\n<p>Lan Zhan doesn’t hate him!</p>\n<p>Wei Wuxian knows there’s a lot going on right now, and that really shouldn’t be the most important bit, but his mind keeps wandering back to it. When he’d pulled back, Lan Zhan had looked happy, even though he knew who he really was, had looked happy <em>because </em>he’d known who he really was!</p>\n<p>Maybe thirteen years had been long enough to mellow Lan Zhan out about some of the things Wei Wuxian had thought he’d hated about him. Maybe he should have guessed that, actually. The kids use his lures. Someone had to teach them.</p>\n<p>The only thing that could possibly be more important is standing in front of him, is Wen Ning, who’s as alive as he was before and not a pile of ash somewhere like he’d been told. It’s good, but it hurts too, an ache in his chest that he can’t do anything about. Wen Ning, like Jiang Cheng, like Jin Ling, has spent the past thirteen years without him, and Wei Wuxian hates that. But there’s nothing he can do about it now.</p>\n<p>Wen Ning’s face spasms and his fingers spread wide. This would be easier if Wei Wuxian could take out Chenqing and guide him out of this, but he’s pretty sure there’s no level of Jin scandal which would keep people from noticing that.</p>\n<p>He stills and Wei Wuxian takes a half step closer, ignoring the way Lan Zhan’s hand twitches in his direction even as it sends a thrill up his spine. “A-Ning,” he croons, just like Wen Qing used to call him, and then wonders if he shouldn’t have done that. He’s just gotten used to it, in this body with this identity, gotten used to being affectionate with the people he cares about.</p>\n<p>Wen Ning’s head snaps towards him, eyes bright and aware even as his eyebrows push together. That awareness is enough and Wei Wuxian closes the distance between them, holding Wen Ning’s hands between his own. They’re cold, of course, but he doesn’t let that bother him. Wen Ning’s a lot taller than him now and Wei Wuxian has to tilt his head back to look at him. He stares at him for a long time, long enough that the pitch of the yelling rises and falls several times before his lips quirk up at the corners and Wen Ning says, “You’ve changed.”</p>\n<p>“You haven’t!” he laughs, the relief making him giddy. Wen Ning recognizes him, of course, always. He goes on his tip toes and gives him a hug, partly just because he wants to, but also so he can whisper into his ear, “I’m going by Wu Yingtai. A-Cheng and Lan Zhan know.”</p>\n<p>He feels Wen Ning nod, a barely there motion. He steps back and doesn’t have the time to be relieved before Jingyi shouts, “Hey! Back off! Are you her husband? Because I’m pretty sure you being dead means you’re not actually married anymore!”</p>\n<p>Wei Wuxian slaps a hand over his face. “Jingyi!” Sizhui yelps.</p>\n<p>“Hm,” Wen Ning hums. “Is he yours?”</p>\n<p>It takes Wei Wuxian a minute to realize that Wen Ning is talking to him and he drops his hand to glare at him. “Hey! I wasn’t that bad!”</p>\n<p>Both Lan Zhan and Wen Ning’s pointed silences are really unnecessary.</p>\n<p>“I don’t suppose you’ve seen Nie Mingjue’s head around?” he asks, trying to get them back on track. “Also, what happened to you? I thought you were dead!” Both Sizhui and Jingyi raise an eyebrow at the same time. “More dead. Really dead. He knows what I mean, you two be quiet.”</p>\n<p>The humor drains from Wen Ning’s face, some of his old anxiety making an appearance as he wrings his hands together. “Ying-jie,” okay, clearly there’s still some humor buried in there, “it’s Jin Guangyao and Su She.”</p>\n<p>Wei Wuxian stares, then prompts, “What about them? What did they do? Something about Qin Su being his sister and him maybe killing Jin Guangshan? Honestly, I’m not too concerned about the latter, it couldn’t have happened to a nicer guy, and the former is – well, gross, but I’m happy to leave figuring out what to do about that to the other clans and not get involved in it at all, for once.” Of course, Jiang Cheng is going to have an opinion, and actually, shit, this is going to affect Jin Ling, so he supposes he cares a little bit.</p>\n<p>He scans the room for his nephew and find him at Jiang Cheng’s side, so he turns back to Wen Ning, confident that there’s no safer place he could be.</p>\n<p>“No,” he says, raising a hand to his forehead. “I haven’t been – aware – really, while they’ve been using me,” they all flinch at that, “but I think maybe your talisman did something. Nothing bad!” he hastens to add at whatever he sees in Wei Wuxian’s face. “But I remember some of it. Maybe a lot of it? And Jin Guangyao and Su She are there are a lot.”</p>\n<p>Sizhui looks around then says, “Sect Leader Su is gone.”</p>\n<p>They all startle at that, everyone looking around the room, but Sizhui is right. Su She isn’t here. This is the biggest scandal since – well, since Wei Wuxian was the one causing scandals. Why would he leave? What possible reason could he have to leave?</p>\n<p>“If he’s sneaking around with a head somewhere, I’m going to feel so smug about this,” Wei Wuxian says, pulling a stack of papermen out of his sleeve. He sets a dozen of them to life and commands, “Find Su She.”</p>\n<p>They flutter away and Wei Wuxian rubs his chin, considering. They have some time, probably, unless Su She is just outside the door lurking like a creep, which Wei Wuxian wouldn’t exactly put past him.</p>\n<p>He reaches out, turning Wen Ning around and making a disproving sound. “A-Ning, really, your hair is a mess.” Wen Ning raises a hand like he’s going to do something about it and Wei Wuxian smacks it down, reaching out to finger comb his hair into some semblance of order. What he wants to do is cling to Wen Ning a little bit and find out exactly who’s responsible for hurting him these past thirteen years and then remind those people <em>exactly</em> why he’d been giving the title of the Yiling Patriarch. But that is, of course, a spectacularly bad idea, so he doesn’t do that, and instead contents himself with this. He pulls the ribbon out his own hair, which really isn’t doing him any good anyway, and slips Shije’s ornament into his sleeve. “Ah, A-Ning, can you, I don’t know, squat or something? You’re so tall!”</p>\n<p>Wen Ning makes a breathy sort of sound that he thinks counts as laugh and then drops onto one knee. Wei Wuxian quickly pulls his hair in the half bun that he’d favored before the Burial Mounds. He stands back up and smiles down at him. “Now Ying-jie’s hair is a mess.”</p>\n<p>“When isn’t it?” he says dismissively. “Now, once we find Su She-”</p>\n<p>“Let me,” Lan Zhan interrupts, and Wei Wuxian has no idea what he’s talking about until he steps behind him and gathers his hair in his hands. “You shouldn’t leave it loose like this. It’s not proper.”</p>\n<p>He means to make a joke about how he barely keeps it up as is and he’s not exactly known for being proper, but the words die in his throat. Lan Zhan is warm and close and knows exactly who he is but is here anyway. He pulls his hair up into a high tail, just like he wore during his first life, and Lan Zhan’s fingers scrape against his scalp as he smooths it out. Jingyi chokes and Sizhui says, voice higher than it was before, “Um, A-die, are you-”</p>\n<p>“Yes,” Lan Zhan says calmly, tying off his hair then stepping back.</p>\n<p>Wei Wuxian doesn’t understand their reactions until he does, until he looks at Lan Zhan and sees his bare forehead. His mouth drops open and he raises a hand to run careful fingers over the ribbon holding his hair up, his fingers brushing across the plated cloud secured right in the center.</p>\n<p>Lan Zhan’s forehead ribbon is in his hair.</p>\n<p>“Lan Zhan,” he breathes, using his familiar name without thinking. Jingyi squeaks while Sizhui’s eyes light up, but he’s mostly focusing on Lan Zhan, who just looks – <em>satisfied</em>, as if his name on Wei Wuxian’s lips and his ribbon in his hair is all he’s ever wanted.</p>\n<p>But that can’t be right.</p>\n<p>Can it?</p>\n<p>He really wishes they weren’t in the middle of several crises right now.</p>\n<p>One of the papermen flutter back into the room, tugging on his collar, sufficiently distracting him from everything else. For a moment. He and Lan Zhan really need to talk, or something, when this is all sorted out.</p>\n<p>“Oh, good, he’s found him.” Wei Wuxian wants to go running out after him now, who knows what he could be doing, but he’s pretty sure if he does that his brother will kill him and he’ll mean it this time. He motions two of the Jiang disciples over, who peel away immediately. “Here, follow this. Apprehend Su She and bring him back here, but be careful, he might be up to something. Don’t do anything stupid, just wait for me if it looks dangerous. I’m going to speak to A-Cheng and then I’ll be right behind you.”</p>\n<p>They nod and the paperman goes sailing down the hall, leading them out of the main hall.</p>\n<p>“A-Ying,” Lan Zhan murmurs, adopting the name Jiang Cheng calls him rather than using a name that doesn’t really belong to him. He is <em>not</em> having any emotions about that. They don’t have time for that right now.</p>\n<p>“I’ll be quick, and they’re fine, I trained them myself,” he says. It was a lifetime ago, of course, but it doesn’t matter. “Just stay here for a second, I’ll be right back and then we can go.”</p>\n<p>Lan Zhan frowns but nods and Wei Wuxian heads towards the center of the fray.</p>\n<p align=\"center\">~</p>\n<p>It happens because of an accident.</p>\n<p>Jiang Cheng sees Wei Wuxian pushing his way through the crowd, Lan Wangji’s headband in his hair for some reason, but it’s hard to keep his attention on him while Jin Guangyao become paler and more restless in the center of their circle. Qin Su is towering over him despite her small stature, incandescent in her rage, and Sisi stands at her side, less overpowering but no less righteous. It’s not like he’d even go so far as to say he and Jin Guangyao are friends, but they do share a nephew, and if Jin Guangyao had been distant when it came to raising Jin Ling, he’d at least been there. He’d let Jiang Cheng raise Jin Ling at Lotus Pier over protests that it wasn’t proper for an heir to one sect to be raise in another.</p>\n<p>However, the sick feeling in his stomach is telling him that was less about what was best about Jin Ling, less about letting his mother’s family have a claim to him, and more about finding a loosened relationship between Jin Ling and Lanling to be advantageous rather than something to avoid.</p>\n<p>Jiang Cheng wants to send Jin Ling away, he doesn’t want him to have to hear all these terrible things about the man he’s called uncle, but where could Jiang Cheng send him? Clearly Jin Tower isn’t as safe as he thought it was and his own disciples have their hands full.</p>\n<p>Wei Wuxian is nearly to their side when someone shouts and moves forward, jostling Wei Wuxian and shoving him into the center of the crowd. He regains his balance quickly, shooting the man who’d shoved him an irritated glance.</p>\n<p>Jin Guangyao moves so quickly that Jiang Cheng barely has the time to realize what’s happening and he wastes precious seconds reaching for Zidian before remembering it’s currently wrapped around his brother’s wrist, and he’s too late. Jin Guangyao stands behind Wei Wuxian, his sword held to his throat. “I know you have something to do with this,” he hisses.</p>\n<p>“Aunt Ying!” Jin Ling cries out and Jiang Cheng grabs the back of his nephew’s robes, yanking him back when he tries to run towards them.</p>\n<p>Wei Wuxian is surprised for barely a moment before his expression settles into irritation. Jiang Cheng glares through his fear, ignoring the way his heart is beating too fast. His brother meets his gaze squarely, not a hint of fear there, but that’s not as reassuring as he thinks it is.</p>\n<p>Wei Wuxian has never been afraid of the things that terrified Jiang Cheng, after all.</p>\n<p align=\"center\">~</p>\n<p>Lan Xichen had believed that the situation couldn’t get any worse, but its clear that it has. Jin Guangyao has his sword pressed against Wu Yintai’s throat, enough that it’s broken skin, if only barely. Additionally, in the ten minutes since he’s left his brother’s side, it appears that he’s proposed, if his ribbon in Wu Yingtai’s hair is any indication.</p>\n<p>Jin Guangyao is holding a sword to throat of the woman Wangji loves.</p>\n<p>He barely survived losing Wei Wuxian, and now there’s no child to give his brother a will to live. He doesn’t know what losing Wu Yingtai would to do Wangji. He doesn’t want to find out.</p>\n<p>“Brother,” Wangji says, voice low, at his side when he hadn’t been a moment ago. Sizhui and Jingyi are right behind him, the terror they’re failing to hide twisting his stomach into knots. Wen Ning doesn’t appear to be in the room anymore, which is concerning, but he honestly doesn’t have it in him to care just now.</p>\n<p>“A-Yao, what are you doing?” Qin Su demands. “Haven’t you caused enough trouble? Unhand Lady Wu this instant!”</p>\n<p>“Who are you to command me?” Jin Guangyao laughs, short and bitter. “You’d be nothing without me!”</p>\n<p>Lan Xichen flinches, but Qin Su only curls her lip back into a snarl. “Without you, I’d still have been Jin Guangshan’s child, apparently. Something we have in common.” There’s another round of disgusted muttering around them, but Lan Xichen only has eyes for the way Jin Guangyao’s sword digs a little bit deeper into Wu Yingtai’s skin. She still doesn’t flinch.</p>\n<p>To think when he’d first seen her, he’d thought she was a delicate as glass. This woman is made of steel.</p>\n<p>“I know who you are,” Jin Guangyao snarls, and it takes him a moment to realize he’s talking to Wu Yingtai rather than Qin Su. Wangji tenses at his side while Jiang Wanyin’s face goes blank. Jin Ling goes even paler than he had been and Lan Xichen finds enough room to be confused underneath everything else he’s feeling.</p>\n<p>Wu Yingtai rolls her eyes. “Do you, Sect Leader Jin?”</p>\n<p>“Your name isn’t Wu Yingtai,” he hisses. “You’re Mo Xuanyu!”</p>\n<p>There’s a moment of perfect stillness as everyone’s confusion becomes nearly a physical thing. Mo Xuanyu? Jin Guangshan’s mad bastard son?</p>\n<p>Wu Yingtai breaks it by throwing her head back and laughing, the sound big enough to fill the whole banquet hall. It makes the sword slide against her neck, deepening the wound, but it also cuts off the ribbon wrapped around her neck. It slides to the ground, revealing a telling bump at in the center of her throat.</p>\n<p>“I,” she says, her voice low and amused somehow reminding him of when he saw her kneeling in the inn hallway surrounded by talismans, “am not Mo Xuanyu.”</p>\n<p>She flicks her wrist up and Zidian comes to life, wrapping around Jin Guangyao’s sword, and Wu Yingtai yanks it away from her, spinning out of Jin Guangyao’s grip in the same motion. Zidian curls back onto her wrist as Jin Guangyao raises his sword and she reaches into her sleeve. Maybe for her dagger, maybe for a talisman, but it’s not going to be enough. Jin Guangyao isn’t the best swordsman, but he doesn’t have to be, not when he’s so close. A dagger or talisman won’t be able to stop his blade and she’s going to die.</p>\n<p>Several people move at once, he and Wangji and Jiang Wanyin, but none of them get there first, none of them get there in time.</p>\n<p>Jin Ling does.</p>\n<p>Jin Ling, who excels at archery, who’s always been at his best when he’s had a target to hit. He hasn’t moved from his place at the edge of the crowd, but his hand is outstretched and empty.</p>\n<p>His sword is sticking out of Jin Guangyao’s chest, having flown through the air with the force of Jin Ling’s throw and landed precisely where he’d aimed it.</p>\n<p>Lan Xichen raises his gaze a little higher. He sees Jin Guangyao’s sword has been stopped above Wu Yingtai’s head. She’s holding a dizi. It’s black, with red markings, a cheerful red lotus charm on the end, and it’s managed to stop a cultivator’s spiritual blade mid swing rather than shattering underneath it.</p>\n<p>It’s Chenqing.</p>\n<p>She’s holding Chenqing.</p>\n<p>She’d said that she wasn’t Mo Xuanyu. That doesn’t mean that she’s Wu Yingtai.</p>\n<p>“A-Ling!” She shoves Jin Guangyao back, not even waiting to watch him crumple to the ground. Jin Ling is pale and shaking and everyone else is frozen.</p>\n<p>She pulls Jin Ling into her arms and he goes easily, hiding his face in her shoulder and using it to muffle his sobs. “I didn’t – I wasn’t trying – I’m sorry, I’m sorry, I didn’t mean it, I just couldn’t let him hurt you, Aunt Ying I didn’t mean it–”</p>\n<p>“I know,” she says soothingly, rubbing a hand up and down his back. “It’s alright A-Ling, it’s okay, you’re okay and I’m okay.”</p>\n<p>Lan Xichen doesn’t realize he’s moved until he’s already kneeling next to Jin Guangyao, his robes ruined by all the blood. He takes his friend’s hand, feeling numb, because even if it’s true, even it’s all true, there’s so many other things that have been true too.</p>\n<p>“I didn’t mean to kill him,” Jin Ling sobs, so loud, the only sound in the banquet hall besides Jin Guangyao’s labored breathing. “I’m sorry! Aunt Su, I’m sorry.”</p>\n<p>“A-Ling, it’s alright,” Qin Su says soothingly as she walks to her husband’s side. “You didn’t kill him.” Her hand wraps around the hilt of Jin Ling’s sword and Jin Guangyao closes his eyes even as Lan Xichen takes in a breath to say something, to stop her, but Jin Guangyao’s hand covers his and he doesn’t. “I did.”</p>\n<p>Qin Su yanks the sword out of Jin Guanyao’s chest only to plunge it back into his neck.</p>\n<p>She doesn’t look at husband, at her brother, as he dies, instead looking around the room with her spine straight and sure. Lan Xichen can’t look away.</p>\n<p>He doesn’t let go of Jin Guangyao’s hand even as it goes limp, even as his pulse speeds up, flutters, then disappears entirely.</p>\n<p align=\"center\">~</p>\n<p>Wei Wuxian is mostly focused on his crying nephew, on Jiang Cheng hovering anxiously over him, on the way Lan Zhan’s eyes haven’t left him during this whole mess. There’s also a burning sensation on his arm that he’s only felt three times before, and it’s not like he’s going to push his sleeves back to check, but he’s pretty sure Jin Guanyao’s death has gotten rid of his last remaining curse mark.</p>\n<p>But the rest of him is focused on Qin Su. He really hadn’t been expecting that.</p>\n<p>She swallows and tilts her chin up. “Death would have been the sentence for the least of his crimes. Do any disagree?”</p>\n<p>Nie Huaisang pokes his head out through the crowd, fanning himself aggressively. “Whatever you say, Sect Leader Jin!”</p>\n<p>She startles for the first time, her eyebrows rising. “Excuse me?”</p>\n<p>“Well, you’re entitled to the position twice over, aren’t you?” he asks, half hiding behind his fan. “As Jin Guanyao’s wife and Jin Guangshan’s remaining child. Unless Jin Ling wants to claim it, of course. He’ll still be the heir after Qin Su takes the position, I think? Right?”</p>\n<p>Wei Wuxian looks down at his nephew, who shakes his head, still refusing to leave the safety of his arms. He doesn’t look at Nie Huaisang, but he wants to, several things falling into place in his head. It’s crazy. There’s no way he’d be able to prove it. But remembers how clever Nie Huaisang had been when they were kids, and how well he’d hid that cleverness. <em>Someone</em> has to be pulling on all these strings.</p>\n<p>“No,” Jiang Cheng says, pulling him back to the here and now, and his relief mirrored in his brother’s face. Fourteen is far too young to be clan leader, even under less traumatic circumstances, and maybe <em>technically</em> it should go to him anyway, but if Qin Su is willing to take the position, the Jiang will support it happily.</p>\n<p>“Lady Wu! Lady Wu!” The crowd parts, and the two disciples he’d sent after Su She dart through. He’s concerned up until he sees Wen Ning behind them, holding a gagged and restrained Su She in one hand and Nie Mingjue’s head in the other. “Is everything alright?”</p>\n<p>They both see Jin Guangyao’s corpse at the same and turn to him with equally accusing expressions. It’s completely inappropriate, but Wei Wuxian has to bite the inside of his cheek to keep from laughing.</p>\n<p>“It’s the Ghost General!” Sect Leader Yao screams, which is echoed by more people, and really, he’d appreciate it if everyone could get a grip for two seconds.</p>\n<p>Wei Wuxian blinks, turning to him. “Uh, yeah? Are you just noticing that? He was here earlier!” He turns back to Wen Ning, then concedes, “I guess he did look more generically fierce corpse like before I combed his hair.”</p>\n<p>“What’s wrong with you?” Sect Leader Yao shouts. “It can’t be controlled by anyone but the Yiling Patriarch! It could kill us all!”</p>\n<p>His face must be doing something, because Jiang Cheng steps forward to take their nephew into his arms, freeing Wei Wuxian to turn to Sect Leader Yao. He’s still holding Chenqing and he twirls it in his hand, like he had so often during the war. “First of all, Wen Ning is not an <em>it</em>. Second of all, if you need the Yiling Patriarch here to make you feel safe, well,” he shrugs, pulling his lips back into a grin that he’s been told isn’t comforting at all.</p>\n<p>Sect Leader Yao’s eyes catch on Chenqing and he takes several stumbling steps back, paling. “It’s – you’re–”</p>\n<p>“Wei Ying,” Lan Zhan says, exasperated.</p>\n<p>A couple of them had definitely noticed the flute anyway. “Ah, Lan Zhan, don’t look at me like that! Sect Leader Yao is scared of A-Ning, I’m trying to reassure him.” No one’s screaming, at least. He hopes it’s because of shock and not because they don’t find him intimidating anymore. How disappointing! Who knew all it would take to not be considered a legitimate threat would be wearing his sister’s clothes? He should have tried that during the war. “Now, give me Nie Mingjue’s head and someone take Su She’s gag off. We’re getting to the bottom of all this once and for all.”</p>\n<p>Nie Huaisang’s face is mostly covered by his fan, but Wei Wuxian has gotten up to too much mischief with him in his youth to miss the satisfaction lurking in the corners of his eyes. Interesting.</p>\n<p align=\"center\">~</p>\n<p>Sizhui is having a really weird day.</p>\n<p>Jingyi’s hand is fisted in his sleeve, wrinkling it and causing his collar to be tugged slightly to one side, but he can’t bring himself to pull away. It’s comforting, grounding, and he thinks he needs that right now. A-die isn’t exactly hovering over Wu Yingtai – Wei Wuxian – but he’s pretty close.</p>\n<p>Wei Wuxian performs Empathy on Nie Mingjue’s head, which Sizhui would have sworn was impossible if he wasn’t seeing it done in front of him. Wei Wuxian weaves another tale of treachery and murder and then they interrogate Su She who confesses to even more, and it’s a lot, for today, and Jin Ling keeps crying, stopping and starting again several times through everything. He’s doing it silently now, but that’s somehow worse. Wei Wuxian notices every time and reaches over to wipe his tears away with his – her? Jin Ling keeps saying both Uncle Ying and Aunt Ying but Sect Leader Jiang had referred to Wei Wuxian as his brother, so his, maybe – sleeve, even when he’s not looking at him. It’s a really terrible thing to be jealous over, so Sizhui shoves it down and does his best to ignore it.</p>\n<p>It’s all very dramatic and interesting, but instead of any of that, his attention keeps wandering to Chenqing. Wei Wuxian is still holding it in his hands and there are little indents along one end. For some reason it makes Sizhui’s jaw ache whenever he looks at it, and the Ghost General should be a terrifying sight, but there’s something almost – if Sizhui had seen him on the street somewhere, he might have thought they’d met somewhere before.</p>\n<p>He doesn’t really understand anything that’s happening. Not the whole Jin Guangyao murder conspiracy – that’s being laid out rather nearly in front of everyone – but the rest of it.</p>\n<p>Wu Yingtai is Wei Wuxian. The Yiling Patriarch. But Sizhui doesn’t feel afraid or disgusted or any of that. How could he? Wu Yingtai had saved their lives and never been anything but friendly and helpful and kind. Which meant that Wei Wuxian had saved their lives and never been anything but friendly and helpful and kind. A-die’s forehead ribbon is still in his hair and A-die seems content to leave it there. He’d been genuinely surprised when Sect Leader Jiang had said that he and Wu Yingtai weren’t engaged, which means sometime between then and now, he’d figured out that Wu Yingtai is Wei Wuxian.</p>\n<p>He thinks it was before A-die gave him his forehead ribbon. He hopes it was, anyway.</p>\n<p>The night finally starts to end. Su She is taken to the cells underneath Jin Tower, Jin Guangyao’s body is lifted away to be prepared for whatever last rites are given to traitors and murderers. Qin Su directs everything with a brisk efficiency that Sizhui doesn’t remember seeing from her before, but it’s hardly like he’s been paying attention.</p>\n<p>Uncle doesn’t look like he’s doing well, pale with his hands clenched tightly behind his back. Qin Su hardly seems phased by her husband’s death, but considering she’d dealt the killing blow, even if it had only been to alleviate Jin Ling’s guilt, he supposes she wouldn’t. Maybe she’ll mourn later, in private, when her fury ebbs. Or, considering what Jin Guangyao had done to her and their son, maybe she won’t.</p>\n<p>Everyone is emptying out of the banquet hall when he and Jingyi make it back over to A-die and Wei Wuxian.</p>\n<p>Jin Ling is exhausted, leaning fully against Sect Leader Jiang’s side in a way that he’d be embarrassed about normally. Sect Leader Jiang is holding his sword for him. He hadn’t wanted to touch it after Qin Su had tried to hand it back to him, and Sizhui knows that’s not something that can last, but understandably no one seems interested in pushing it tonight. A-die only looks away from Wei Wuxian to send concerned glances to Uncle, but it never lasts more than a second before his gaze is pulled back to Wei Wuxian once more.</p>\n<p>Wei Wuxian notices him first, a huge grin immediately overtaking the bottom half of his face. “Sizhui, there you are! I know I said these things were boring, but wow, this sure showed me, huh?” He reaches out a hand toward him, then freezes, something uncertain coming over his face as he almost but no quiet touches him.</p>\n<p>Sizhui doesn’t want that. He understands it even less then when he thought he was Wu Yingtai, but Wei Wuxian still makes him feel safe, still feels familiar. He steps closer, tucking himself against Wei Wuxian’s side and pulling his arm over his shoulders like he’s wanted to do for hours, and says, “I’m glad you’re okay. I was scared, earlier.”</p>\n<p>Wei Wuxian softens and reached out to pinch his cheek. For a moment he’s very small and gets the embarrassing urge to cling to his leg, like he hasn’t done since he was very small, and even then he’d only done it to A-die. “No need to be scared! I’ve been in far worse situations than that.” He frowns, because that’s not a good thing, but Wei Wuxian rubs his thumb between his eyebrows until his forehead relaxes. “Really, I’m fine.”</p>\n<p>“Wei Ying,” A-die says abruptly, staring at them with a strange expression on his face. “I have to tell you something.”</p>\n<p>Wei Wuxian blinks. “Okay, Lan Zhan. What is it?”</p>\n<p>A-die opens his mouth, then closes it again, pressing his lips together.</p>\n<p>Sect Leader Jiang rolls his eyes and says, “Alright, you have fun with that. A-Ling and I are going to bed. A-Ying, you better be in your bed when I wake up tomorrow or so help me.”</p>\n<p>Wei Wuxian blinks. “Where else would I be?”</p>\n<p>Sect Leader Jiang goes red and Jin Ling’s lips twitch into something that might be a smile. But it drops just as quickly. “Uncle,” he whines, “I don’t want to go bed.”</p>\n<p>“You’re sleeping in my rooms,” Sect Leader Jiang says, which seems like the sort of thing that would invite another argument, except Jin Ling relaxes and gives a relieved nod. “And when we go home to Lotus Pier, you’re coming with us. Aunt Su doesn’t need you getting underfoot while she’s cleaning all this up.”</p>\n<p>The words sound harsh but for some reason they pull a real smile out of Jin Ling.</p>\n<p>Wei Wuxian squeezes Sizhui’s shoulder then lets go of him to step in front of Jin Ling, taking both his hands in his own and bending just enough to look him in the eye. “Thank you for saving me, A-Ling. I love you.”</p>\n<p>He flushes, but mumbles, “Love you too.”</p>\n<p>Wei Wuxian and Sect Leader Jiang exchange a fond glance then Wei Wuxian shoos them away, “Alright, go, get some sleep.”</p>\n<p>Sect Leader Jiang glares at A-die for a moment before steering Jin Ling down the hall towards where the Jiang are staying.</p>\n<p>Uncle lays a hand on Jingyi’s shoulder, “Come on, we should be getting some sleep too.”</p>\n<p>Jingyi ignores Uncle, reaching out to grab Sizhui’s wrist. His eyes are wide and he tilts his head to the side, waiting, and Sizhui’s hit with another wave affection for his best friend. He knows if he gives Jingyi any indication that he’s not okay with this, that he wants him to stay, he’ll tell their clan leader to shove it and take any punishment that results from it. “It’s okay,” he says, twisting his hand in Jingyi’s grip so they’re hold each other’s forearms. “Go ahead.”</p>\n<p>Jingyi stares at him for a long moment, clearly looking for any indication he isn’t being totally honest, but he mustn’t find any because he nods and squeezes his arm before letting go. He turns to Wei Wuxian and punches him in the shoulder. “You need to be more careful! Just because you’re the Yiling Patriarch doesn’t mean you can be so reckless! Demonic cultivation can’t put your head back on your neck!” He pauses, frowning. “Right?”</p>\n<p>Wei Wuxian laughs, reaching out to tug on the end of Jingyi’s ponytail, who yelps and jumps away from him, glaring. “Right! Thank you, Jingyi. I’ll keep that in mind.”</p>\n<p>Jingyi scowls then falls into step next to Uncle as they walk out of the banquet hall, giving him a suspicious glance. “Maybe we should stop by the kitchens first. You’re kind of pale, Sect Leader Lan.”</p>\n<p>“Jingyi,” Uncle sighs, but the warmth and exasperation tinging his voice is more emotion than he’s showed in the hours since Jin Guanyao’s death.</p>\n<p>Wen Ning rubs the back of his neck and says, “I’ll, um, be on the roof, I suppose? Just call if you need me, Ying-jie.”</p>\n<p>Wei Wuxian frowns. “You can stay in my room, A-Ning, you hardly need to spend the night on the roof.” Both Wen Ning and A-die raise an eyebrow at that, which makes no sense until Wei Wuxian says, “Oh, be quiet, it was different when I did it.”</p>\n<p>“Actually,” A-die says, cutting off what sounds like the beginnings of a familiar argument, “Wen Qionglin may accompany us. This concerns him as well.”</p>\n<p>Wen Ning and Wei Wuxian share a baffled glance, but he only says, “All right, Lan Zhan.”</p>\n<p>A-die nods then turns and walks down the hall. After a moment they all follow. Sizhui studies the tense line of his father’s shoulders, trying to figure out the cause, and coming up with nothing. There’d been plenty of horrible things that had happened tonight, but none that could quite explain A-die’s behavior.</p>\n<p>He leads them to his room, shutting the door behind them and staying with his back to them for a long moment. Then he turns around and smooths hand hands down his robes, a nervous gesture that Sizhui’s never seen from him. “Lan Zhan?” Wei Wuxian prompts, a frown on his face that says this is strange to him too.</p>\n<p>“The child you mentioned earlier,” A-die says, looking at the space over their shoulders. “The one that was yours.”</p>\n<p>Wei Wuxian’s face creases in pain again, but then he says, “A-Yuan.”</p>\n<p>“Yes?” Sizhui says, surprise and warmth unfurling in his chest. Wei Wuxian is familiar with A-die and Sizhui wants him to be familiar with him too.</p>\n<p>Wei Wuxian blinks, turning to him. “What?”</p>\n<p>“Yes,” he repeats, uncertain. “You said my name.”</p>\n<p>“A-Yuan,” Wen Ning whispers, and he shouldn’t be okay with a fierce corpse referring to him like that, with the Ghost General using his birth name, but he is, for some reason. It sounds right in his mouth even though Sizhui can’t explain it.</p>\n<p>Wei Wuxian reaches out, grabbing his hand with a bruising grip, but Sizhui doesn’t pull away. He’s looking him in the face even as he says, “Lan Zhan, don’t – you can’t – is he really?”</p>\n<p>“Sizhui,” A-die says gently, “I told you I found you on a battlefield, and that’s true. But I did not tell you which one.”</p>\n<p>Wei Wuxian doesn’t let go of his hand, but he does reach up a trembling hand to cup his face, running his thumb over his cheek. “My little radish. You’ve grown.”</p>\n<p>He’s small again, suddenly, and the sun is bright and dirt is being piled on top of him while people laugh, and a gentle voice is telling him that it will help him grow, and the voice is different but the warmth is the same. He covers Wei Wuxian’s hand with his own and his voice comes out thick when he says, “You planted me.”</p>\n<p>“I wanted you to grow up big and strong,” he says, and he’s smiling, but he’s crying too. “That’s all I wanted, more than anything else, and you – look at you! As sweet and strong and perfect as I could have hoped.”</p>\n<p>“He was already perfect when I got him,” A-die says quietly. “Because of you. He got it from you, Wei Ying.”</p>\n<p>Wei Wuxian takes a deep breath then turns and looks to Wen Ning, so Sizhui does too, and his face is scrunched like he’d be crying if he could. “Wen Ning, look! It’s our A-Yuan, all grown up.”</p>\n<p>There’s more memories, faded and fuzzy, but Wen Ning looks the same and it’s a little bit easier to make the connections. He remembers cold hands balancing him carefully on his hip and someone spoon feeding him soup. “Uncle Ning?”</p>\n<p>Wei Wuxian steps away, which is terrible, but then Wen Ning is there, pulling him into a careful hug, gentle and light like he’s convinced Sizhui is going to push him away, so he throws his arms around Wen Ning’s neck and holds on extra tight. Wen Ning’s shoulders are shaking, but his grip becomes a little firmer.</p>\n<p>“Lan Zhan,” Wei Wuxian says, “You saved him. You saved A-Yuan, and raised him, and – thank you.”</p>\n<p>“Of course I did,” A-die says. “He was your son. He was the only part of you I had left. I couldn’t save you, but I could save your son.”</p>\n<p>“Our son,” Wei Wuxian corrects gently. Sizhui wouldn’t have said that anything in his life was <em>wrong</em> before this, but now it feels right, something settling inside him that he hadn’t even known was out of place. “Are you saying – Lan Zhan that really sounds like – I don’t want to assume–”</p>\n<p>Wen Ning lets go of him so he can cover his face with his hands and Sizhui would laugh if he wasn’t worried about ruining the moment.</p>\n<p>“Wei Ying,” A-die sighs. “You’re wearing my ribbon. I want you to <em>keep</em> wearing it. If that’s what you want.”</p>\n<p>“A-Ning,” Wei Wuxian says, and then there’s a cold hand covering his eyes.</p>\n<p>Sizhui laughs and when several moments later when Wen Ning cautiously lowers his hand, Wei Wuxian is in A-die’s arms, looking up at him with a soft eyed adoration, a look that A-die is returning. Their lips look a little bruised, which Sizhui is going to do his best not to think about, because gross.</p>\n<p>Wei Wuxian’s face crumples and Sizhui barely has the time to be worried before he says, “Lan Zhan, I can’t leave the Jiang, especially with everything that just happened. I need to stay at Lotus Pier with A-Cheng and A-Ling. I can’t leave.”</p>\n<p>“I’m not asking you to,” A-die says. “I’ve regretted not staying at your side for thirteen years. I wanted to follow you then, and didn’t. Let me do it now.”</p>\n<p>His mouth drops open. “Do you mean it, Lan Zhan? Really?”</p>\n<p>“Really,” he says. “If joining the Jiang means I get to keep you, then I’ll do it gladly. You don’t need to come to Cloud Recesses. I will go to Lotus Pier.”</p>\n<p>Wei Wuxian tugs him down again, but he only kisses A-die’s bare forehead, where his ribbon would be if it wasn’t in Wei Wuxian’s hair. Then he looks to Sizhui, a question in his eyes that it seems like he can’t bring himself to say out loud.</p>\n<p>Sizhui doesn’t even need to think about it.</p>\n<p>He crosses the distance between them, tugging Wen Ning along with him. “Of course,” he says. “I just got you back, I’m not giving you up. Besides,” he adds brazenly, “I was yours first, Xian-ge.” Wei Wuxian’s face lights up, but Sizhui frowns, because that’s not quite right. “Baba,” he amends, which is better, then “A-niang,” which is just as good.</p>\n<p>“Yes,” Baba says, looking around all of them with bright eyes, him and A-die and Uncle Ning. “You’ll all come to Lotus Pier, and A-Cheng and A-Ling will be there, and I’ll have all my family in one place for once.”</p>\n<p>A-die leans down and then Uncle Ning covers his eyes again as A-niang pushing himself up on his tip toes and Sizhui groans, but doesn’t mind, really.</p>\n<p>He’s going to have to figure out some sort of way to get on Sect Leader Jiang’s good side. He’ll have to ask if calling him uncle will help or not.</p>\n<p>If Jingyi isn’t given an open invitation to visit Lotus Pier, which will now contain almost all of his favorite people, there will never again be peace in Cloud Recesses.</p>"
}