{
  "id": "27735484",
  "url": "https://archiveofourown.org/works/27735484?view_full_work=true",
  "author": [
    "TheRainbowElectric"
  ],
  "title": "Not Nothing",
  "rating": "Not Rated",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "All For The Game - Nora Sakavic"
  ],
  "relationships": [
    "Neil Josten/Andrew Minyard"
  ],
  "characters": [
    "Neil Josten",
    "Andrew Minyard",
    "Nicky Hemmick",
    "Aaron Minyard",
    "Kevin Day",
    "Renee Walker (All For The Game)"
  ],
  "additional_tags": [
    "content warnings for all the canon-typical trauma",
    "5 Things",
    "Post-Canon",
    "Developing Relationship",
    "andrew's pov",
    "Neil learning how to be people",
    "Fluff and Angst",
    "Emotional Hurt/Comfort",
    "Angst with a Happy Ending",
    "please do not copy"
  ],
  "language": "English",
  "series": "",
  "published": "2020-12-09",
  "completed": null,
  "words": "23,148",
  "chapters": "1/1",
  "comments": "506",
  "kudos": "11,666",
  "bookmarks": "3,166",
  "hits": "94,622",
  "summary": "<p>“Have you considered the possibility that Neil has chosen you, but believes you have not chosen him?” Renee says. \"Have you ever explicitly told him what you want?”</p>\n<p>“Neil knows what I want,” Andrew snaps. This is not <em>Andrew’s</em> fault.</p>\n<p>“How do you know?”</p>\n<p>Because Neil <em>always</em> knows. He is as fluent in Andrew’s micro-expressions as he is in German and French. He knows which head tilts mean “go on” and which ones mean “shut up.” Without ever asking, he learned what it meant to see Andrew wearing double layers of long sleeves, or taking multiple showers in a day, and learned to hand Andrew the car keys.</p>\n<p>That has always been the most terrifying thing about Neil — his patience to wait, watch, listen, learn. The prospect that if Neil were given enough time, there would be no part of Andrew that was just <em>Andrew’s</em> anymore.</p>\n<p>“He has to know,” Andrew says. </p>\n<p>“Does he?” Renee says. “Have you ever known Neil to assume that he is wanted?”</p>\n<p>Five times Neil tells someone that he and Andrew aren’t dating, and one time Andrew uses his words to set the record straight.</p>",
  "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a>.)</p>\n<p>Thank you thank you thank you to my beloved beta, sevenimpossiblethings, for bearing with all my explanations of the tire fire that is AFTG canon, and editing this story anyway :)</p>\n<p>Come hang out with me on <a href=\"https://agreatperhaps12.tumblr.com\" rel=\"nofollow\">Tumblr</a> &lt;3</p>",
  "text": "<p>\n<strong>1</strong>\n</p>\n<p>The first time it happens, Andrew assumes Neil is just fucking around.</p>\n<p>Neil’s chin is propped in his hands while he studies a drink menu with the kind of intensity that tells Andrew he is just past tipsy. Andrew stands with his back to the bar, surveying the technicolor silhouettes of the crowd, because Neil will not stand with his back to the club without someone watching his six.</p>\n<p>“Memorized that yet,” Andrew says, because Neil has been deliberating for nearly ten minutes. Sober Neil will drink whatever is poured for him, neat, no questions. Drunk Neil is more amenable to beverages that stain his tongue bright colors and make his lips taste like sour Skittles.</p>\n<p>Neil gives Andrew a sarcastic smile and shifts his weight to press their shoulders together. Andrew allows it. Part of the job description for babysitting Drunk Neil.</p>\n<p>Andrew sips his one and only drink for the night — ritual, more than alcohol, to deaden the buzz under his skin that inevitably arises when surrounded by so many half-lit faces and loose, wandering bodies. The whiskey is a slow smolder down his throat, and Andrew turns back in time to catch Neil watching his swallow with interest. Andrew allows himself a moment to enjoy Neil's attention before he nudges Neil and jerks his chin at the menu. “Order.”</p>\n<p>“I don’t know what I want.” Neil returns to his task with the closest thing to a pout that Andrew has ever seen on his face.</p>\n<p>Neil is full of new expressions while drunk. Some more annoying than others, but all as close to unguarded as Neil Josten ever gets. Right there and only for Andrew to memorize. It almost makes being sober — which Andrew must be, for Neil to allow himself to drink in any public setting, ever — worth it. That, and the knowledge that Neil now owes him one. Andrew mulls over the ways he could spend his favor while continuing to scan the club.</p>\n<p>He is on particular lookout for a couple of people he caught making interested eyes at Neil tonight. Andrew expected it; Neil finally caved and allowed Allison to cut his hair this week, so his startling blue eyes are back on full display. The azure shirt Andrew picked out probably does not hurt, either.</p>\n<p>The redhead down the bar who keeps flicking shy glances in Neil’s direction certainly does not seem to think so. Andrew intercepts one of her sidelong looks and fixes her with a cyanide stare until she blushes and averts her eyes.</p>\n<p>Andrew is not <em>jealous</em>. Neil still does not swing for anyone but him. That is not arrogance; it is a conclusion based on thorough assessment of all available evidence. But Neil — when outside the familiar territory of an Exy court — shrinks from strangers’ attention like a vampire from sunlight. Andrew is not about to let some ill-conceived flirt ruin his good mood.</p>\n<p>“Any day now, Neil,” Andrew says, itching to get back to their booth, where he might be less tempted to order a second drink.</p>\n<p>“I’m <em>thinking</em>.”</p>\n<p>“Don’t hurt yourself.” Andrew swirls what remains of his spirit around the bottom of the glass. “Just ask Roland to make something you’ll like.”</p>\n<p>Neil pulls a face, and Andrew feels the corner of his mouth twitch, despite himself. Hardly anyone is immune to Roland’s stupid, cocky swagger, but Neil is aggressively one of them. It remains unclear to Andrew whether Neil dislikes Roland on the principle that Roland is the closest thing Andrew has to an ex, or whether Neil has not forgiven the handcuff incident. Either way, Andrew takes great pleasure in observing Neil’s pettiness and Roland’s futile attempts to win his favor.</p>\n<p>As though summoned by the sheer power of Neil’s legendary bad luck, Roland is the next available bartender at their end of the counter. He greets Neil with a broad grin and a, “Pick your poison yet?”</p>\n<p>Neil takes one last, lingering glance at the menu before shoving it across the counter in defeat. “Make me something good.”</p>\n<p>“Ooh, a little bespoke bartending.” Roland cracks his knuckles. “Any preferences?”</p>\n<p>“Strong,” Andrew says, because this is the last time tonight he stands at the bar for fifteen minutes straight. Neil stretches Andrew’s patience beyond almost anyone else, but Andrew’s temper is only so elastic.</p>\n<p>Roland grins. “On it. What about you?”</p>\n<p>Andrew’s eyes snag on a nearby flock of sorority sisters as they down a round of vodka shots in sync. He imagines that heat, like swallowing a lit match, burning behind his own sternum. Saliva fills his mouth, but he bites the inside of his cheek. He made a deal. He downs the rest of his drink and places his empty glass before Roland. “A Coke.”</p>\n<p>“And?”</p>\n<p>“Nothing.”</p>\n<p>Roland frowns. “What?”</p>\n<p>Andrew swipes his glass across the counter, making Roland lunge to keep it from sliding off. He of all people should remember how Andrew feels about repeating himself.</p>\n<p>“Okay, okay, got it. Coke for you,” Roland says, and prepares Andrew a glass of soda. “This is a first. You sick or something?”</p>\n<p>Andrew considers telling him yes and coughing in his face. But Roland is more pleasantly useful to Andrew when they are on good terms, so Andrew says, “Designated driver.”</p>\n<p>Roland affects an irritating expression of elaborate surprise. His eyes bounce from Andrew to Neil and back again, smile creeping back onto his face. “Wow, look at you, blondie,” he says. “Being a good boyfriend.”</p>\n<p>Andrew is about to tell Roland exactly where he can shove his patronizing attitude, but Neil cuts in with, “<em>Don’t</em> call him that.”</p>\n<p>Roland blinks. Andrew blinks.</p>\n<p>“…Blondie?” Roland says.</p>\n<p>“<em>Boyfriend</em>,” Neil says. “I’m not his boyfriend.”</p>\n<p>If Andrew were the kind of person to indulge in facial expressions, he might be wearing one a lot like Roland’s right now: eyebrows raised, lips parted in silent surprise. As it is, Andrew inhales sharply at the hard kick of his heart, but the sound is swallowed by the noise of the club. When Roland’s eyes cut back over to him, Andrew’s face is studiously blank.</p>\n<p>“Oh, I thought — shit, man, I’m sorry.” Roland tries on a sheepish smile under Neil’s narrowed gaze. “I keep putting my foot in my mouth around you, don’t I?”</p>\n<p>“Yeah,” Neil says, without forgiveness.</p>\n<p>After an awkward pause, Roland says, “Right, uh, about that drink,” and quickly fucks off to make Neil’s cocktail, affording Andrew a moment to figure out what the hell just happened.</p>\n<p>Technically, Neil is not Andrew’s boyfriend. They have never applied a label to this… <em>thing</em> between them, and Andrew has always been comfortable in that liminal space. \"<em>Boyfriend</em>\" would be an awkward fit for him and Neil — too loose in some ways, too constrictive in others.</p>\n<p>Yet, Neil is not <em>not</em> Andrew’s boyfriend, either. And Neil is the one always waxing on about how <em>“it’s always yes with you”</em> and “<em>I’m not going anywhere</em>.” His sharp rebuke now <em>means</em> something, and Andrew takes it like a knife between the ribs. The knife twists when Neil turns back to Andrew, appearing nothing but happy and relaxed, as though what he said was neither surprising nor important.</p>\n<p><em>This is what you get</em>, sneers a quiet, watchful voice from the back of Andrew’s mind.</p>\n<p>Andrew chokes off that inner voice and focuses on maintaining his placid expression. But Neil must spot a hairline fracture in Andrew’s composure, because his brow pinches. “Something wrong?”</p>\n<p><em>You tell me</em>.</p>\n<p>To investigate, Andrew brushes the backs of his fingers against Neil’s under the bar. “Yes or no?”</p>\n<p>Neil’s expression shifts from perplexed to pleased, and he nods. Andrew links their hands together and swipes his thumb across the familiar texture of scar tissue along Neil’s knuckles. The ridges of knife slices and unnatural plastic smoothness of burns. A hand that could not be mistaken for anyone else’s in the dark.</p>\n<p>Neil’s exhale brushes Andrew’s neck as Neil shuffles closer, tipping his forehead to rest against Andrew’s temple. It is more openly affectionate than Sober Neil would typically be, but by all other accounts entirely normal, except —</p>\n<p>“What was that,” Andrew says, in his most carefully indifferent voice.</p>\n<p>“What?” Neil says, pulling back to look Andrew in the eye.</p>\n<p>“With Roland.”</p>\n<p>“Oh.” Neil sneers. “Too harsh?”</p>\n<p>As if he does not know that the only thing Andrew enjoys more than being rude to people who annoy him is watching Neil be rude to people who annoy him.</p>\n<p>“Neil,” Andrew says, a traitorous strain sneaking into his voice, because \"<em>not his boyfriend</em>\" is rattling around, horribly loud inside Andrew’s head.</p>\n<p>Neil’s smirk twists into something more rueful, sending another jolt through Andrew’s stomach. Andrew grits his teeth, but then Neil says, “I hate when he acts like he knows you,” completely snapping the tight coil of tension inside Andrew.</p>\n<p>“...What.”</p>\n<p>“‘Wow, look at Andrew, being a good boyfriend,’” Neil says in a mocking tone that sounds nothing like Roland, making clumsy air quotes with his free hand. “As if you could only <em>possibly</em> do something nice out of some sense of obligation.” Neil snorts. “He can go fuck himself.”</p>\n<p>Andrew stares at Neil. At his curled lip. At the tight draw of his shoulders. At the surly side-eye he aims down the bar. Andrew processes the fact that \"<em>not his boyfriend</em>\" was a middle finger to Roland, not to Andrew.</p>\n<p>He rewinds the interaction in his mind and replays it in slow motion, viewed from this new angle. Neil’s inflection, his expression. \"<em>Not his boyfriend</em>.\" To fuck with Roland.</p>\n<p>Andrew hates himself for the rush of cold relief that floods his stomach.</p>\n<p>Roland reappears behind the counter to present a supremely unimpressed Neil with his custom drink. “A Roland Shoemaker original,” he says proudly.</p>\n<p>“Does it have a name?” Neil says, as if he could name even five standard mixed drinks off the top of his head.</p>\n<p>“Nope,” Roland says. “One-of-a-kind. You could call it the Neil Josten.” He gives Neil a flattering wink.</p>\n<p>Neil does not look flattered.</p>\n<p>Roland sighs. “It’s mostly Fireball. You’ll like it, I promise.”</p>\n<p>Neil takes a dubious sniff and then sips his beverage. He wrinkles his nose. Andrew takes that to mean the drink is stiff, as requested.</p>\n<p>“Well?” Roland says.</p>\n<p>“It’s fine,” Neil says, and takes a longer sip.</p>\n<p>Roland looks ready to hang that two-star review on his home refrigerator.</p>\n<p>“But is it better than any of the house cocktails?” Neil muses, aiming a sly look at Andrew. “Maybe I should have another look at the menu — ”</p>\n<p>“I will gut you,” Andrew promises.</p>\n<p>“You won’t,” Neil says, with obnoxious confidence. “Then Jack would be promoted to starting striker. Imagine how unbearable he’d be then.”</p>\n<p>“Perfect excuse to gut him, too.”</p>\n<p>“Kevin wouldn’t like that.”</p>\n<p>“Fuck Kevin.”</p>\n<p>“Would you?” Neil says, with something horrifyingly close to genuine intrigue.</p>\n<p>Andrew plants a hand on Neil’s cheek to turn his face away. “Go sit down.”</p>\n<p>Neil peels Andrew’s hand off with a laugh. “I have to pay for my drink,” he says, and fumbles for the wad of bills he carries at all times. Despite his newly minted status as a Real Person, Neil Josten still refuses to register for a credit card or use the savings account Wymack forced him to set up in May.</p>\n<p>“I said <em>sit</em>,” Andrew says, smacking Neil’s hand away from his pocket and shoving him in the direction of their booth.</p>\n<p>Neil, for once in his goddamn life, does as he is told.</p>\n<p>Andrew wipes a hand down his face and turns back to the bar, regretting for the twelfth time tonight his agreement not to drink. “You can put that on Nicky’s tab,” Andrew tells Roland, who is watching Neil’s retreating form with a keen eye. Andrew considers slashing Roland’s tires on their way out.</p>\n<p>“Is that really not official yet?” Roland says, waving a forefinger between Neil’s back and Andrew’s chest.</p>\n<p>“Is that really any of your business?”</p>\n<p>“It could be,” Roland says archly.</p>\n<p>Definitely slashing his tires.</p>\n<p>“Not if you want to live to see twenty-five,” Andrew says, but Roland just smiles.</p>\n<p>The problem with spending time around other people, Andrew has found, is that those who can tolerate Andrew’s company for longer than five minutes tend to build up the kind of emotional scar tissue that makes cutting remarks less effective.</p>\n<p>Andrew decides that he is ignoring Roland, effective immediately, and imagines the satisfying sink-punch of a blade puncturing rubber all the way back to their booth.</p>\n<p>The only Fox left at the table with Neil is Aaron, who slides out with a scowl as soon as Andrew slides in. Andrew bids him a middle finger’s farewell, which Neil mimics. Roland’s signature Neil Josten drink is already half-empty on the table in front of its namesake. Andrew can smell the other half on Neil’s breath. Especially when Neil leans in to practically shout over the music, “Yes or no?”</p>\n<p>Andrew makes a mental note to put ASL on their languages-to-learn list after Russian and nods. Despite Neil’s utter lack of context clues, Andrew knows what he wants. As expected, Neil’s hand finds Andrew’s under the table again and he scoots closer to lay his head on Andrew’s shoulder. After a moment, Andrew rests his cheek in Neil’s hair and feels Neil unwind against him. Soft and settled and for once taking no pains to scout the club for threats.</p>\n<p>Neil only ever drops his guard this far while drunk — which is entirely the point. Neil told Andrew as much, the morning after he allowed Nicky to get him really, thoroughly trashed for the first time, while curled up in a miserable ball against the toilet.</p>\n<p>\n<em>“I’m going to die.”</em>\n</p>\n<p>\n<em>“You will not.”</em>\n</p>\n<p>\n<em>“How would you know?”</em>\n</p>\n<p>\n<em>“Because how anticlimactic would it be,” Andrew said, “if this were how you died. Think about it.”</em>\n</p>\n<p>\n<em>Neil did. At least, Andrew assumed Neil was thinking, until it turned out he was really just working himself up to puke again. </em>\n</p>\n<p>\n<em>When he was finished, Andrew wiped Neil’s mouth with a paper towel before Neil could wipe it on the sleeve of Andrew’s stolen hoodie.</em>\n</p>\n<p><em>“Give me a truth,” Andrew said, because it was his turn in their game of swapping honesties. “What changed your mind?” For all Neil drank, these days, he did not get </em>drunk<em>. </em></p>\n<p>\n<em>There was a long pause, during which Andrew wondered whether the next thing out of Neil’s mouth would be an answer or more vomit. </em>\n</p>\n<p>\n<em>“I wanted to know what it would be like,” Neil said at length, “to not be able to worry about watching my back or looking for exits or — or anything, for once. And I knew I could, because you would be there. I’m always safe with you.” </em>\n</p>\n<p><em>It was right up there with “</em>not if it means losing you<em>” and “</em>I want to go back for you.<em>” The kind of thing Andrew knew by the way Neil curled into him in bed or sought out Andrew’s eyes in a crowd, but was still unsettling to hear aloud. Nothing had prepared Andrew for the intoxicating power and awful helplessness of being Neil’s — whatever Andrew was, to Neil. </em></p>\n<p>\n<em>“Don’t get used to it,” was all Andrew could say.</em>\n</p>\n<p>\n<em>“I never will,” Neil said.</em>\n</p>\n<p>And fuck, if Andrew doesn’t know he will never get used to it, either — the easy way he can hook his ankle around Neil’s and feel Neil hide a smile in his shoulder. Comfortable closeness is still such a foreign sensation that Andrew cannot quite settle into it.</p>\n<p>At the same time, this feels like the only natural order of things: Neil and Andrew alone together, backs to the wall, Neil trusting Andrew to guard against the world. Here, it is easier to see \"<em>not his boyfriend\"</em> as the casual fuck-you to Roland that it was. Easier for Andrew to believe that Neil covets the nameless thing between them just as much as he does.</p>\n<p>By the time Neil does the honors of slashing Roland’s tires on the way out of Eden’s Twilight, Andrew has all but put the incident behind him.</p>\n<p> </p>\n<p> </p>\n<p>\n<strong>2</strong>\n</p>\n<p>The second time it happens, Andrew again assumes Neil is fucking around.</p>\n<p>Andrew maintains that this is a valid go-to assumption, where Neil Josten is concerned, as Neil does a great many things just to be difficult. Clog toilets with expensive attire, for instance. Shit talk Exy stars with notoriously rabid fans on national television. Politely suggest, <em>again</em> on national television, that the Exy-founding idol of said rabid fans should resign from coaching in shame.</p>\n<p>And that is just off the top of Andrew’s head.</p>\n<p>Conservatively, ten percent of everything Neil has ever done was fueled only by pure, high-octane spite. And when it comes to Aaron, that figure is something more like ninety percent.</p>\n<p>It happens like this.</p>\n<p>Andrew and Neil are watching Exy, because Neil stole the remote and Andrew is not in the mood to wrest it back. Andrew sits on the couch, Neil on the floor, cheek pillowed on Andrew’s knee.</p>\n<p>This has become their default position when they are both having bad days — a compromise between Neil’s need for closeness and Andrew’s need for space. Some days, Andrew combs a hand through Neil’s hair. Today, though, the thought of someone else’s hair tangled between Andrew’s fingers is unbearable. Ever since Andrew woke at five a.m. in a rigid, sweaty tremble, his whole body has felt as hypersensitive as the sticky skin of his forearms when he peels off his armbands at night.</p>\n<p>Andrew has gotten better, he thinks, at not making a bad day worse by hating himself for having the bad day in the first place. But returning from errands to find Neil in the suite's common room, pale and twitchy, and rejecting Neil’s request for a hand, a hug, anything — Andrew did hate himself a little for that. And then hated Neil for putting him in that position. And then agreed to watch TV because the mindless distraction might halt his mental spiral before it drilled too deep.</p>\n<p>Andrew actively hates both himself and Neil all over again when he glances down and catches Neil picking at his scars. If Neil were in his usual spot at Andrew’s side, Andrew could smack Neil’s hands apart. As they are, Andrew can only nudge Neil’s head with his knee. “Stop.”</p>\n<p>“I’m not doing it on purpose,” Neil snaps, shoving his hands under his thighs and glaring off to the side.</p>\n<p>Andrew knows he isn’t. That’s the problem.</p>\n<p>Andrew has not figured out whether this is a new anxious tic, or an old one exacerbated by Neil’s new expanses of exposed scar tissue. But Neil scratches and bites at the marks Lola left on him like they're still scabs, as though he could peel the scars off to uncover smooth skin underneath. It is a disgusting habit, and Andrew is tired of donating all his Band-Aids and Neosporin to Neil’s fraying nerves.</p>\n<p>Another day, Andrew would hold Neil’s hands still with his own.</p>\n<p>It is good to remind himself that there will be other days.</p>\n<p>Neil turns his face into Andrew’s knee and hooks a hand around Andrew’s ankle. Neil is not having a panic attack, exactly, but he is a master of the silent implosion. It is only a matter of time before he is back to picking at himself. Andrew considers purchasing a pair of gloves to make Neil wear, like a dog in a cone, or investing in a set of fidget spinners. For now, though —</p>\n<p>“Move,” Andrew says, jostling Neil with his knee again to make him sit up.</p>\n<p>Neil leans forward to let Andrew off the couch, looking confused and a little hurt, like he thinks Andrew is about to leave him alone. Idiot.</p>\n<p>“Where are you going?”</p>\n<p>Andrew does not answer, because he wants Neil to <em>sit still</em> until he gets back, and anticipation is one of the few ways to hold Neil’s attention. Predictably, Neil cranes his neck to watch Andrew disappear into Aaron and Nicky’s room, where Andrew retrieves the Rubik’s cube from the junk drawer in Aaron’s beside table. Back in the sitting room, Andrew chucks the Rubik’s cube at Neil, who plucks it from the air with irritating ease.</p>\n<p>“What am I supposed to do with this?”</p>\n<p>“Oh, Neil,” Andrew sighs, reclaiming his place on the couch. “I refuse to believe that you grew up so far off the grid that you don't even know what a Rubik’s cube is.”</p>\n<p>“I’m watching the game,” Neil says, and tosses the Rubik’s cube into Andrew’s lap. “You do it.”</p>\n<p>“You were giving yourself new scar tissue,” Andrew corrects, dropping the Rubik’s cube to the floor beside Neil, “and I already know how.”</p>\n<p>“Really.”</p>\n<p>Andrew knows when he is being baited, but he also knows the quickest way to end this conversation. He holds out his hand, and Neil places the Rubik’s cube in his waiting palm. Andrew turns the toy over to assess its current state and starts twisting panels.</p>\n<p>He looked up a YouTube tutorial on how to solve the puzzle the same afternoon Aaron brought it home, to piss him off. Andrew has never forgotten the solution, and Aaron has never figured it out — or that Andrew cheated. If they didn’t share the same face, Andrew would swear he and Aaron were not related.</p>\n<p>A few minutes later, Andrew holds the solved puzzle up long enough to commit Neil’s expression of surprised admiration to his mental library of favorite Neil faces. Then he mixes the Rubik’s cube up again and drops it into Neil’s lap. “Your turn.”</p>\n<p>“What will you give me for it?” Neil says, forever difficult.</p>\n<p>Andrew sighs. He considers. “One movie night.”</p>\n<p>Neil’s eyebrows shoot up. “Seriously?”</p>\n<p>Andrew looks at him seriously.</p>\n<p>“We’re watching ‘80s rom-coms this week,” Neil warns.</p>\n<p>Andrew is aware. Nicky spent their last drive back from Columbia explaining in great detail the film curriculum he planned for their summer movie nights to improve Neil’s nearly nonexistent knowledge of popular culture.</p>\n<p>Andrew has not, actually, detested the few team movie nights he has attended under duress. If he must spend time with the Foxes, two hours during which they are all focused on something else and no one tries to talk to Andrew is practically ideal. But Neil still labors under the impression that Andrew loathes them, which makes them valuable bargaining chips.</p>\n<p>“What are you watching next?” Andrew says.</p>\n<p>“I think it’s called <em>The Breakfast Club</em>?” Neil looks dubious. Then he hitches on a smirk. “After that, it’s <em>Ten Things I Hate About You</em>. That sounds more <em>on-brand</em> for you.”</p>\n<p>The slang sounds as clunky as a Russian phrase coming from Neil, who is clearly spending too much time around Allison. Andrew plants a hand on the side of Neil’s smirking face to turn it away. He feels Neil snicker under his palm.</p>\n<p>“Is that a yes?” Neil says.</p>\n<p>“To <em>The Breakfast Club</em>,” Andrew says. “And show some damn respect. That is a classic.”</p>\n<p>“You’ve seen it?”</p>\n<p>Andrew has lived with Nicky for over three years. He has seen all of them. Not entirely against his will, but Andrew will take his fondness for the colorful theater of <em>Clueless</em> to his grave.</p>\n<p>“You see us as you want to see us, in the simplest terms, and the most convenient definitions,” Andrew deadpans, and watches the reference sail right over Neil’s head. “<em>Yes</em>, Neil. Do we have a deal?”</p>\n<p>Neil responds by turning back around to face the TV and setting into the puzzle. Andrew rests a hand on the top of Neil’s head for as long a moment as he can bear before swiping the remote off the floor and switching the channel to <em>Antiques Roadshow</em>.</p>\n<p>It is a rerun of a 2001 episode Andrew knows well. The roadshow client nods politely as the appraiser explains the history of his Navajo blanket. In a few minutes, he will learn the blanket is worth half a million dollars.</p>\n<p>“I don’t get why you like this show,” Neil says. “You’re never going to be able to use any of this information.”</p>\n<p>Bee would probably have a few things to say about why Andrew derives pleasure from a show about overlooked and abandoned secondhand items getting appraised for small fortunes. But not everything is about trauma.</p>\n<p>“Some people like knowing things for the sake of knowing them, Neil.”</p>\n<p>“I know things.”</p>\n<p>“Things that are not about Exy.”</p>\n<p>“Yeah.”</p>\n<p>Yeah, Neil knows things. Things like how long it takes to bleed out from gunshot wounds to different parts of the body. Not things like the odd historical facts Andrew collects and neatly arranges on the shelves of his memory like Bee’s glass knick-knacks.</p>\n<p>“Well, if you shut up and listen, you might learn a few new things,” Andrew says, and turns up the volume.</p>\n<p>Neil shuts up, but Andrew doubts he is listening. Andrew can see him chewing his cheek and making one rookie mistake after another, screwing the Rubik’s cube up worse than Andrew originally scrambled it. Neil occasionally emits soft grumbles of frustration, but otherwise works quietly. He does not pick at his scars.</p>\n<p>Andrew cruises through six <em>Antiques Roadshow</em> reruns and Neil succeeds in piecing together the green side of the Rubik’s cube before Nicky and Aaron upset the fragile peace of the living room.</p>\n<p>“Honey, we’re home,” Nicky sing-songs as he bangs open the door.</p>\n<p>Neil flinches badly enough to drop the Rubik’s cube. Andrew puts a hand on the back of his neck and glares at Nicky, who is too busy kicking off shoes and dropping bags to notice.</p>\n<p>“Are you watching that antiques show?” Aaron says, raising an eyebrow far too judgmentally for all the hours of reality TV bullshit he binges with Katelyn.</p>\n<p>“Trying to,” Andrew says pointedly.</p>\n<p>“But… there’s an Exy game on,” Nicky says. He leans around the couch to peer at Neil, as if checking it really is him on the floor.</p>\n<p>“Neil is busy,” Andrew says.</p>\n<p>“Is that my Rubik’s cube?” Aaron says.</p>\n<p>“Dunno,” Neil says absently, working on the red side now, at the expense of completely fucking up the green. “Andrew found it.”</p>\n<p>Aaron snatches the Rubik’s cube out of Neil’s hands.</p>\n<p>“Hey!” Neil says.</p>\n<p>“You messed up all my progress,” Aaron snaps.</p>\n<p>“What progress,” Andrew says.</p>\n<p>Aaron rounds on him. “You can’t just steal my shit and give it to your boyfriend.”</p>\n<p>“Good thing I’m not his boyfriend, then,” Neil sneers, and yanks the Rubik’s cube out of Aaron’s hand.</p>\n<p>Andrew knows — he <em>knows</em> this is Neil’s knee-jerk response to contradict anything out of Aaron’s mouth. A throwaway comment that should have no effect on Andrew. But that logic does not preempt the bolt of electric tension that shoots through Andrew’s limbs, undoing all the work of his progressive muscle relaxation exercises today.</p>\n<p>Fucking — <em>fuck</em>.</p>\n<p>Andrew inhales, exhales. It is a bad day. This response is not proportional. Andrew opens and closes his fists. He is capable of controlling his reaction. If there is one thing Andrew is good at, it is packing undesired emotions into boxes and putting them away, in a back corner of his brain, to unpack with Bee later or ignore entirely. But it is easier to do alone.</p>\n<p>Andrew extricates himself from the couch while Neil and Aaron continue to bicker over the goddamn Rubik’s cube and allows the door to slam on Nicky’s call after him.</p>\n<p>Up on the roof, the air is heavy with humidity. A low ceiling of black clouds threatens thunder. The concrete beneath Andrew’s bare feet is damp from the afternoon shower, so Andrew removes his sweatshirt to make a seat for himself before sitting at the roof’s edge. He lights a cigarette and looks down at the slick pavement below, gleaming like a blade in the streetlamp light.</p>\n<p>Three cigarettes later, just as it starts to rain, Andrew hears the door open behind him. No footsteps follow.</p>\n<p>Andrew considers telling Neil no. He is not particularly keen on company, even — or perhaps especially — Neil’s. But he is calm enough now that Neil’s presence will not actively pose a problem, and Neil is wading through the end of his own bad day. Better to keep him here, where Andrew can see him, than to wonder whether Neil is off finding or making trouble on his own.</p>\n<p>“Yes,” Andrew says, just loud enough for Neil to hear him over the soft applause of rain against the roof.</p>\n<p>Moments later, Neil is beside Andrew, just plopping down on the wet cement like a goddamn — whatever. Honestly? Whatever. Andrew cannot summon the energy for indignation over Neil’s utter inattention to the most basic of bodily comforts.</p>\n<p>Neil hooks his hands over the edge of the roof and kicks his feet restlessly, throwing Andrew sideways glances. He is clearly not certain of his place here, despite Andrew’s yes. Andrew sighs and offers Neil a cigarette. Neil accepts the peace offering and cups a hand over the end to protect the flame of Andrew’s lighter from the drizzle as he lights it. Andrew takes the opportunity to inspect the dark hollows beneath Neil’s eyes, thrown into sharper contrast by the small orange glow of the flame.</p>\n<p>Neil has been off for a few days. Eating and sleeping even less than usual. Clinging to Andrew’s sleeves and sticking his hands in Andrew’s sweatshirt pockets, the way he only does when he is too anxiously itchy for comfort to wait for a yes-or-no on skin contact. Something brought all this to a head this afternoon, although Andrew does not know what. His mental calendar of Neil’s past traumas is blank for today.</p>\n<p>Andrew does not ask. The rest of the team is constantly wheedling Neil to <em>talk about it</em> on days like this, but Andrew knows better. He knows how hard Neil works to stay grounded as <em>Neil</em> on days like this. Pestering him with questions about Nathaniel Wesninski will not help.</p>\n<p>So Andrew sits and smokes and waits. His shirt is nearly soaked through by the time Neil says, “Sorry we interrupted your show.”</p>\n<p>Andrew contemplates setting the record straight on what made him leave, but decides against it. Neil did not mean anything by his comment, and Andrew should not have thought anything of it. Tomorrow, Andrew <em>will</em> think nothing of it. Probably. This is merely the side effect of a bad day. It means nothing and it does not matter.</p>\n<p>Things that do matter: Neil’s hunched shoulders, the restless knock of his heels against the side of the building, and the new red scratches across the back of his hands. Andrew does not feel guilty about leaving Neil alone inside; he did what had to be done. But he is with Neil now.</p>\n<p>“Forget it,” Andrew says, replacing the stub of Neil’s first cigarette with a second. “If you must talk, talk about something else.”</p>\n<p>He watches how Neil’s cheeks hollow on the inhale, how he arches his neck to breathe smoke into the sky. After the exhale, Neil keeps his head tilted back, apparently unbothered by the rain hitting his face. He looks contemplative, and Andrew wonders whether Neil will tell him what is wrong with today.</p>\n<p>Instead, Neil says, “This is my favorite kind of weather.”</p>\n<p>Andrew wipes a raindrop out of his eye. “You have shit taste in weather,” he says.</p>\n<p>Neil blows an amused exhale through his nose. “Not <em>this</em>, exactly,” he says, waving his cigarette carelessly through the drizzle. He points to the distance, where the first flashes of lightning are pummeling through the fat, purple clouds. “Summer thunderstorms.”</p>\n<p>This information does not seem to beg a response, so Andrew does not give it one.</p>\n<p>“When I was little, I used to be afraid of lightning,” Neil says, which does get Andrew’s full attention. Not the words, but the tone. Neil’s childhood left him precious little to feel <em>nostalgic </em>about, but Neil’s voice now sounds almost wistful.</p>\n<p>Andrew <em>hmm</em>s to indicate that Neil should continue.</p>\n<p>“My mom told me that lightning wasn’t scary, it was cool, because it was created by superheroes fighting up in the sky.”</p>\n<p>It is the first quasi-normal thing Neil has ever told Andrew about his mother. To be frank, Andrew is shocked that Mary Hatford did not simply try to beat the fear of thunderstorms out of Neil, the way she tried to beat so much else out of him.</p>\n<p>Andrew has vivid, viscerally satisfying daydreams about giving Neil’s mother the same sendoff he gave his own.</p>\n<p>“Sounds like you were an especially gullible child,” Andrew says. “Hard to imagine, given your current borderline-psychotic levels of paranoia.”</p>\n<p>Neil grins. “Give me a break. I was like, five.”</p>\n<p>Andrew thinks about all the childish naiveté <em>he</em> had dispelled by the tender age of five, and cannot suppress a sneer. “Mommy’s little lie worked, didn’t it?”</p>\n<p>Neil does not see the ugly expression on Andrew’s face. He is staring out at the dark campus, distant and considering. “I can’t remember.” He shrugs and shoves his damp hair out of his face, all traces of reverie gone. “Maybe I just learned there were more important things to be afraid of.”</p>\n<p>Neil rubs his hand absently against the shoulder marked with the outline of a hot iron. Andrew knows the scar well. He has dragged his lips over it and felt Neil’s shuddery breath beneath him.</p>\n<p>Andrew’s life is not short on horrors. He does not need Neil’s compounding his own. But he would be lying if he said it did not help, sometimes, to be reminded that he and Neil are fucked up in equal if opposite ways.</p>\n<p>“Nightmare?” Andrew guesses, inclining his head toward Neil’s shoulder.</p>\n<p>Neil shakes his head. “Guy in front of me in the lunch line smelled like the detergent my mom used for laundry that day.” He snorts. “How stupid is that?”</p>\n<p>Andrew, who knows well what it is like to get yanked back in time by the scent of a very specific cleaning solution, says, “It is not stupid.”</p>\n<p>The self-deprecating smile slides off Neil’s face. “Yeah.”</p>\n<p>They smoke in silence for several minutes before Neil says, “What about you? Nightmare?”</p>\n<p>Neil must know that it was. He knows what it means to wake up alone, with Andrew back in his own bed. But Andrew recognizes the question for its invitation, if Andrew wants to talk.</p>\n<p>Andrew does not want to talk. But he does nod, to at least nominally answer Neil’s question. This is how it works. Truths for truths.</p>\n<p>The rain continues apace. “Want to go for a drive?” Neil says.</p>\n<p>“Where?”</p>\n<p>The answer Andrew expects is “<em>wherever</em>.” The answer he gets is, “The dollar store.”</p>\n<p>“What.”</p>\n<p>“Aaron took his Rubik’s cube back and locked himself in his room.”</p>\n<p>Andrew is surrounded by children.</p>\n<p>“Are you telling me that at — ” Andrew checks his phone. “ — nine-thirty on a Sunday night, we need to find a Dollar General to buy you a new Rubik’s cube.”</p>\n<p>“Yes,” Neil says.</p>\n<p>“At nine-thirty,” Andrew repeats, “on a Sunday night.”</p>\n<p>“I’ll run to the store myself if you don’t want to go,” Neil says.</p>\n<p>Andrew might let him, if he did not know Neil means “<em>run</em>” literally. He sighs. “Let’s go,” he says, stubs out his cigarette, and stands. Neil follows. “You really can hyper-fixate on anything, can’t you? Junkie.”</p>\n<p>Neil scrunches up his face. “I don’t care about the Rubik’s cube.” To Andrew’s arched eyebrow, “Beyond shoving it in Aaron’s face when I solve it, I mean. But you can’t call some eighties teen movie ‘<em>a classic</em>’ and then expect me to watch it without you.”</p>\n<p>A complicated tangle of emotion knots up in Andrew’s chest as he looks at Neil — the only person who might respect the sanctity of a deal as much as Andrew does. He is struck with the urge to yank Neil in by his shirt for a bruising kiss. Andrew does not do this, because they are not kissing-in-the-rain kinds of people, and today is not a kissing kind of day. But he imagines it.</p>\n<p>“Staring,” Neil says, smug.</p>\n<p>Andrew reaches out to dig his thumb into the dimple on Neil’s left cheek. “One hundred and thirteen.”</p>\n<p>Neil grins wider, the way he always does when Andrew is being a dick. Not the way Roland would smile, like he thought Andrew was being a tease, or playing hard to get. Neil smiles like he takes comfort in the consistency of Andrew’s attitude. It is a strange acceptance that, like most things about Neil, Andrew did not ask for and does not know how to handle — yet wants to hold as long as he can. One careless \"<em>not his boyfriend\" </em>is nothing in the face of that ridiculous smile.</p>\n<p>Andrew is not in the business of <em>hoping</em> for much, but when Neil looks like this, Andrew can almost believe that, for once, he might be allowed to keep a good thing.</p>\n<p> </p>\n<p> </p>\n<p>\n<strong>3</strong>\n</p>\n<p>Andrew should have known that no optimistic thought would go unpunished.</p>\n<p>Once is an anomaly, twice a coincidence, thrice a pattern. And the third time, there is no ambiguity about whether Neil is fucking around.</p>\n<p>The funny thing — well, not <em>funny</em>, but the thing that would definitely have sent Andrew into a fit of manic laughter, if he were still on his meds — is that the blow lands right after the most ostensibly <em>together</em> thing Andrew and Neil have ever done.</p>\n<p>For the Fourth of July long weekend, they finally make good on Neil’s desire to go someplace for the sake of going, doubling Neil’s specified three-hour radius on a trip to Colonial Williamsburg and Busch Gardens. A sufficiently long and touristy journey that by the time they return, Neil will no longer be able to say he has never been on a summer vacation.</p>\n<p>The night before they leave, Neil is about his usual business of keeping Andrew awake after the lights are out. “I’m excited,” Neil murmurs into the dark. “Are you?”</p>\n<p>“Ecstatic,” Andrew deadpans, even though there is a not-unpleasant tug behind his sternum that could be construed as excitement. Andrew has a lot of these kinds of feelings around Neil: small buds of emotion, like new leaves poking through a bed of ash. Andrew tries not to examine them too carefully without Bee’s expertise on hand.</p>\n<p>“That’s good,” Neil says, which should be the end of that — except that Neil’s slow, uncertain tone tells Andrew it is not. Andrew is lying flat on his back, eyes closed, but he can feel Neil’s gaze burning into the side of his face.</p>\n<p>Andrew waits what he considers to be a very generous ten seconds for Neil to say what he needs to say. When Neil does not, Andrew succumbs to a sigh and turns on his side.</p>\n<p>Neil is, as usual, curled up in as close to a fetal position as he can get with Andrew taking up half his bed. Andrew watches Neil twist the strings of his hoodie — <em>Andrew’s </em>hoodie — between his fingers. After a space, Neil says, “Three days is a long time.”</p>\n<p>This is an absurd statement, coming from someone who spent most of his childhood on one extended road trip from hell. But Andrew keeps his mouth shut, because it is clear where Neil is headed with this, and the sooner he gets there the sooner Andrew sleeps.</p>\n<p>Neil pulls the sleeves of Andrew’s sweatshirt down over his knuckles. “You sure you’re not gonna get sick of me?” He’s smirking, but his posture is bowstring tight.</p>\n<p>It is not the first time that Neil has said something to this effect. For someone who has fought so long and so hard to survive, Neil sure has a lot of second, third, and fourth thoughts about whether he is worth keeping around — in any other capacity than being a world-class striker, that is.</p>\n<p>If Andrew were someone else, he would say that Neil is the only person in the world whose company he would even consider subjecting himself to for seventy-two hours straight. But, being only himself, all Andrew can do is lay his hand out on the mattress between them, palm up. Neil’s grip is immediate and desperately tight. Andrew brings Neil’s knuckles up to his lips. “I cannot possibly get any sicker of you than I already am,” he promises.</p>\n<p>It is enough to coax a genuine smile out of Neil. It is also, more importantly, true. For all Neil’s irritating and sometimes infuriating qualities, Andrew’s — ugh — <em>feelings</em> about Neil have only trended toward more intrigued and more attached ever since the day they met, defying all explanation and Andrew’s best efforts to the contrary.</p>\n<p>Of course, there are moments on their holiday weekend that put that trend to the test. Prime among them is Neil’s insistence on wearing a fanny pack.</p>\n<p>Andrew understands that indulging in frivolous tourism is all part of the exotic, normal-person experience that Neil is seeking. Which is why Andrew is prepared to suffer through three sweaty days surrounded by noisy children and high-strung parents, slogging through long lines and conversations with employees who refuse to break character. All this, Andrew will abide for the sake of giving Neil Josten one goddamn pleasant memory that does not involve Exy.</p>\n<p>What Andrew cannot abide is Neil becoming the kind of normal person who wears a fanny pack.</p>\n<p>“I’m wearing it ironically,” Neil says as he buckles the bright orange atrocity around his waist. “Am I using that word right?”</p>\n<p>“No,” Andrew says.</p>\n<p>Neil wears the fanny pack anyway, using it to tote his flip phone and a cheap digital camera he bought for the trip. Despite Nicky’s continued lobbying for Neil to buy a smartphone, Neil refuses on the grounds that “<em>iPhones spy on people</em>.” And while Andrew finds most of Neil’s holdover habits from pre-Fox life somewhere on the spectrum from unnecessary to unhealthy, this is one point where he will concede that Neil is probably on to something.</p>\n<p>Colonial Williamsburg is, essentially, pleasant. Neil leaves with a snow globe, a pack of Stroopwafels, and a horrific sunburn. Busch Gardens has bigger crowds, which is decidedly less pleasant. Neil handles crowds poorly, especially since Binghamton. He hugs close to Andrew’s shoulder whenever they pass particularly large packs of people. As they stand in line for Neil’s first roller coaster, which Andrew will not be riding, Neil practically tries to hide behind Andrew while side-eyeing a nearby knot of loud school kids.</p>\n<p>“Relax, Neil,” Andrew says, already tired of this hovering, because it is only ten in the morning and already over ninety degrees and Andrew needs space to <em>breathe</em>. “None of those fifth graders is going to shank you for the front seat.”</p>\n<p>“You don’t know that,” Neil says darkly. “The last fifth grader I met was Riko Moriyama.”</p>\n<p>There are too many absurd premises in that statement for Andrew to unpack and sort out now, especially when he can feel the midmorning sun burning the back of his neck and the beginnings of a headache stabbing his right eye. “You trust me to protect you from the fucking yakuza, but not a pack of school children?” Andrew says.</p>\n<p>Neil, either completely missing or completely ignoring Andrew’s deep sarcasm, looks slightly mollified.</p>\n<p>Andrew spends the day eating ice cream and watching Neil chase adrenaline highs on increasingly tall rides. He spends the evening eating Neil’s Stroopwafels and watching Neil flip through his photos. Neil is an astonishingly horrible photographer. Most of his photos — of rides, random strangers, the fucking <em>sky </em>— are crooked or blurry or both. Neither Andrew nor Neil is in any of them.</p>\n<p>Andrew wonders whether Neil is doing that on purpose — leaving the camera devoid of any clues about its owner, in case it gets lost or stolen — or whether Neil truly does not understand the purpose of vacation photos. Maybe, to him, snapping over-saturated shots of the parking lot is more about the normal-person theater of taking photos than actually documenting shared memories.</p>\n<p>Ultimately, it does not matter to Andrew either way. What are eidetic memories for.</p>\n<p>The queen-size bed crammed into their tiny motel room is nice. The sheets are scratchy and the pillows are flat, but there is much more space to be together without being on top of each other than in a twin bed. This is especially important when their tiny motel room AC turns out to be broken.</p>\n<p>(This was Andrew’s fault for trusting Neil to make their reservations; apparently, despite the small fortune stashed under his bed at home, it did not occur to Neil to book anything nicer than a Super 8. Having witnessed the horror that is Neil’s wardrobe, Andrew should have guessed that life on the run left Neil frugal to a fault in all ways, but. Lessons learned.)</p>\n<p>By midnight, Andrew and Neil have shifted from sitting shoulder-to-shoulder against the headboard to lying face-to-face, and are locked in a silent game of chicken over who is going to turn out the light. Andrew suspects this means they will fall asleep with it on, but he does not mind. Sleeping with the light on is a gone but not forgotten childhood habit.</p>\n<p>Neil doesn’t look as though he particularly minds, either. He is blinking heavily, and his hand is more lying atop Andrew’s than actually holding it. With the fucked-up side of his face buried in his pillow and his shower-damp hair falling into his face, Neil looks young — much younger in this loose, happy, relaxed state than he did when Andrew found him last year. Loose, happy, relaxed, in spite of everything that has happened since last year.</p>\n<p>Loose, happy, relaxed here with Andrew.</p>\n<p>“Give me a truth,” Neil says. “Did you have fun this weekend?”</p>\n<p>As usual, the simple yes-or-no question has no simple yes-or-no answer. Andrew does not experience <em>fun</em> the way he thinks most people do — the way sheer delight brought a savage grin to Neil’s face as he ran from ride to ride across the park today. All Andrew’s most recent recollections of that kind of pleasure were episodes of medication-induced glee. He could go his whole life without feeling like that again.</p>\n<p>What Andrew <em>did</em> feel this weekend was the security of having Neil with him, somewhere safe. Relief that Neil does seem humanly capable of finding some kind of happiness beyond the confines of an Exy court. Satisfaction that Andrew was the one to give him that. Contentment to lie in a mediocre motel bed and watch Neil fall asleep.</p>\n<p>All that, Andrew thinks, amounts to a “Yes.”</p>\n<p>Neil’s fingers lace into Andrew’s, his face overtaken by a smile that gives Andrew an unnamed emotion that seems too big for his body.</p>\n<p>“Me too,” Neil says. “Coulda done without the crowds, though.”</p>\n<p>“Really,” Andrew says, with particular care to keep his voice level, because the big feeling refuses to recede. “This is brand new information.”</p>\n<p>Neil’s smile wanes. “Sorry. Was I too much?”</p>\n<p><em>You are always too much</em>. “No,” Andrew says, and raises his free hand to Neil’s cheek. After Neil’s nod of assent, Andrew cups the side of his face and uses his thumb to smooth back the hair at Neil’s temple.</p>\n<p>Neil’s eyes slip shut. He clutches Andrew’s hand tighter and scoots closer until their foreheads touch. Andrew slides his hand to the back of Neil’s neck and squeezes to wring a soft, happy noise out of Neil.</p>\n<p>Neil is ridiculously easy to please with small affections. Andrew did not need the revelation of Neil’s entire tragic backstory in Baltimore to know that Neil had rarely, if ever, been handled with care. And it is insane that the first person permitted to touch Neil like this should be Andrew. But here Andrew is, being trusted to protect Neil — not by standing between Neil and something else, but just by being close and careful. Andrew wants to earn that trust, the way Neil has slowly been earning Andrew’s.</p>\n<p><em>Wanting</em>, in Andrew’s experience, is a dangerous, often painful, almost always unrewarding thing. Wanting Neil was one of the worst ideas Andrew ever had. But as Neil tucks his head under Andrew’s chin and allows Andrew to bury his nose in Neil’s hair, Andrew is starting to think he might just get away with it.</p>\n<p>The other shoe drops when they return to campus on Monday night.</p>\n<p>The rest of the Foxes, save the freshmen, have apparently spent the Fourth drinking, throwing a rained-out barbecue in Andrew’s living room, and drinking some more. There is an Exy game playing in the background of their loud conversations, but only Kevin is paying the least bit of attention.</p>\n<p>Nicky and Matt hail their arrival with happy whoops that make Neil flinch. Andrew returns their greetings with a dead stare and nudges Neil toward the open spot beside Renee before Nicky can navigate the minefield of paper plates and beer cans on the floor to cage Neil into a hug.</p>\n<p>“Welcome home,” Renee says with a gentle smile as Neil sinks onto the couch. “Good weekend?”</p>\n<p>“Yeah,” Neil says. “I took a bunch of photos. Wanna see?”</p>\n<p>Andrew suspects this is more of Neil going through the motions of normal post-vacation behavior, but he does not comment, because (1) why interrupt the blue-moon rarity of Neil volunteering information about his life, and (2) Renee is the probably only person in the world who would not judge Neil’s abysmal photography skills.</p>\n<p>Andrew carries Neil’s bag and his own into their room and deposits them by the bed. He is considering simply shutting his door and trying to fall asleep despite the noise when Nicky’s voice catches his attention.</p>\n<p>“Hey, Neil. Now that you’re back, settle a bet for us, would you?”</p>\n<p>Something about Nicky’s coy tone kindles Andrew's suspicion. He returns to the doorway and leans against it, arms crossed.</p>\n<p>Neil, cheap camera on his lap and wary expression on his face, has the entire room’s attention. “Okay,” he says.</p>\n<p>“When did you and Andrew get together?” Nicky says. “Not just hooking up, but like, <em>together</em> together.”</p>\n<p>Andrew feels the whole room lean forward. Everyone must have something in the pool on this one. Everyone who can, anyway. And even though Andrew is not among them, he finds himself curious about Neil’s answer.</p>\n<p>As far as Andrew is concerned, he could not have made it more official with Neil than performing the grand romantic gesture of shattering Riko Moriyama’s wrist on live television. He might as well have proposed to Neil on ESPN, for fuck’s sake. The whole affair would have been horribly embarrassing, if it had not been so satisfying or so necessary.</p>\n<p>But Neil was the one who called “<em>not nothing</em>” weeks before Andrew stopped arguing against it, so his date might be slightly —</p>\n<p>“We’re not together.”</p>\n<p>Nicky scoffs. “C’mon, if I wanted a bullshit answer, I would’ve asked him.” He jerks his chin in Andrew’s direction, but Andrew does not react. Cannot react. He might be permanently calcified in this exact position against the doorframe.</p>\n<p>“I’m not bullshitting you,” Neil says.</p>\n<p>“Right,” Nicky says, stretching out the word with disbelief. “Just two bros, chilling in a one-bed motel room, zero feet apart ‘cause they’re not gay.”</p>\n<p>Neil makes the same face Matt does whenever the cousins start speaking German. “What?”</p>\n<p>Nicky looks to Matt for support. Matt shrugs and says, “Dunno why you’re looking at me. I’ve never pried an honest answer out of that kid.”</p>\n<p>“I’m telling the truth,” Neil says, tone inching toward anger.</p>\n<p>“Sure you are, babe,” Allison says.</p>\n<p>“I <em>am</em>,” Neil says, definitely angry now.</p>\n<p>The Foxes obviously don’t believe him. But Neil — Neil obviously believes every word he’s saying.</p>\n<p>Andrew can hardly breathe around the noxious feeling simmering under his skin, roiling in his chest, rising like bile in his throat. He needs to get out. He needs to get out <em>now</em>.</p>\n<p>But he can’t. Not without drawing attention. He can already feel Renee’s eyes on him. Andrew hates her for that. Hates Nicky for his question. Hates Neil for his answer. Hates all of them for being in his fucking home right now, forcing Andrew to contain all this ugliness neatly inside himself.</p>\n<p>It is Neil, ironically, who gives Andrew his out.</p>\n<p>“Think whatever you want, I’m telling the truth,” he grumbles, and shrugs out from under the hand that Renee tries to lay on his shoulder as he heads for the door — without looking at Andrew. “I’m going to the court.”</p>\n<p>Kevin, despite his current BAC, perks up like a dog who’s heard the word “<em>walk</em>.” But he only makes it to a brief standing position before swaying back onto the couch. By the time he figures out what he wants to shout at Neil about practicing footwork, the suite door has already slammed shut.</p>\n<p>“…Too far?” Matt asks the oddly quiet room left in Neil’s wake.</p>\n<p>“All’s fair in love and gambling,” Nicky says, despite the somewhat guilty look he aims at the door. “I want my two hundred. Erik’s birthday is coming up.”</p>\n<p>Matt raises an eyebrow at Andrew. “I don’t suppose you’re going to be any more forthcoming on this?”</p>\n<p>No, Andrew doesn’t suppose he is. But he swallows a retort, because if Andrew opens his mouth right now, he’ll — what? Yell? Be sick? Cry?</p>\n<p>Andrew has not cried since Cass. Funny how this betrayal feels so much like that. Funny how Andrew always expected it, but somehow also didn’t.</p>\n<p>Without answering Matt or looking at anyone else, Andrew exits the suite as if to follow Neil. But instead of taking the elevator down to catch him in the lobby, Andrew takes the stairs up to the roof, where he strides straight to the edge and leans forward just enough to send a cascade of adrenaline through his stomach. He stumbles back with a knifelike inhale and, sufficiently shocked back to clarity, sinks to his knees to breathe through the aftermath.</p>\n<p>He hasn’t needed to do that in a while. But it works like a charm — like screaming into a pillow, stepping under a cold shower, or opening a seam along his wrist — to relieve some of the toxicity inside him, if only temporarily. Once Andrew gets a cigarette lit in his shaking hands, he lies back on the roof and waits for nicotine calm to permeate his body.</p>\n<p>The door opens. Andrew closes his eyes and is about to tell Neil <em>no</em> when Renee’s voice says, “It’s me.”</p>\n<p>Andrew opens his eyes and tips his head back to study Renee’s upside-down outline in the doorway. He always suspected Renee knew about the roof and was just allowing Andrew to keep it for himself.</p>\n<p>When Andrew does not immediately tell her to fuck off, Renee comes to lie beside him.</p>\n<p>“Shouldn’t you be babysitting?” Andrew says, privately relieved that he has his voice back.</p>\n<p>“Aaron has mostly sobered up,” Renee says pleasantly. “I trust he will not allow anyone to do anything too foolish in my absence.” In his peripheral vision, Andrew sees Renee turn her head to look at him. “But I can go back downstairs, if you like.”</p>\n<p>Andrew knows she will. Renee never pushes. Not like Neil, with his fucking “<em>I’m not a pipe dream</em>” and “<em>I want to come back for you</em>.” Like any of that ever mattered, when “<em>we’re not together</em>.”</p>\n<p>“You can stay,” Andrew says.</p>\n<p>“Thank you.” Renee crosses one ankle over the other, pillows her head on one hand, and ushers in a silence.</p>\n<p>Andrew knows it won’t last. But Renee grants him the span of two cigarettes, and Andrew is well on his way back to numbness, before she says, “Would you like to talk about it?”</p>\n<p>“Do I ever?”</p>\n<p>“No,” she says, and politely leaves the “<em>but sometimes you do anyway</em>” unsaid.</p>\n<p>The thing about apathy is that it takes <em>work</em>. Andrew has put a lot of goddamn time and care into feeling as little as possible. Survival skills take <em>practice</em>. But sometimes, especially when it comes to a feeling as untenable as the one Andrew is trying to wrangle now, affecting apathy is too exhausting. And sometimes — <em>sometimes </em>— talking to Renee helps. She usually ends up doing most of the talking anyway.</p>\n<p>“Neil,” Andrew says, and inhales smoke to suffocate a vengeful upsurge of the bad feeling.</p>\n<p>“His answer to Nicky’s question.”</p>\n<p>“Yes.”</p>\n<p>“You were surprised,” Renee guesses.</p>\n<p>Andrew clenches and unclenches a fist. “I should not have been.”</p>\n<p>“Why not?”</p>\n<p>Andrew tries not to let the question irritate him into leaving. He sighs, sits up, and stamps out his cigarette on the concrete between them. For all their similar history, “There are some things I cannot make you understand.”</p>\n<p>“Why not?” Renee says again. It is the kind of gentle antagonism that Andrew usually only has to endure in sessions with Bee, and it strains Andrew’s brittle patience.</p>\n<p>“Because you were eventually <em>chosen</em>.”</p>\n<p>Renee does not react to the venom of Andrew’s accusation. She looks thoughtful for a moment. “Have you considered the possibility that Neil <em>has</em> chosen you, but he believes you have not chosen him?”</p>\n<p>Andrew does not have the words to answer that. Even if he did, he is not sure he would trust himself to speak.</p>\n<p>“What I mean is,” Renee says, “have you and Neil ever explicitly discussed the nature of your relationship? Have you told him what you want?”</p>\n<p>“Neil knows what I want,” Andrew snaps. This is not <em>Andrew’s</em> fault.</p>\n<p>“How do you know?”</p>\n<p>Because Neil <em>always</em> knows. He is as fluent in Andrew’s micro-expressions as he is in German and French. He understands which head tilts mean “<em>go on”</em> and which ones mean “<em>shut up</em>.” Without ever asking, he has learned what it means to see Andrew wearing double layers of long sleeves, or taking multiple showers in the same day, and knows to hand Andrew the keys to the Maserati.</p>\n<p>That has always been the most terrifying thing about Neil — his patience to wait, watch, listen, learn. The prospect that if Neil were given enough time, there would be no part of Andrew that was just <em>Andrew’s</em> anymore.</p>\n<p>“He has to know,” Andrew says.</p>\n<p>“Does he?” Renee says. “Have you ever known Neil to assume that he is wanted?”</p>\n<p>No, but Andrew has not said “<em>this is nothing</em>” since before Baltimore. Even then, it was obvious that Neil did not buy it. Neil has a state-of-the-art bullshit detector. (Not, as Neil likes to claim, because he was raised by criminals, but by virtue of being such a relentless bullshitter himself.) Of course Neil saw through Andrew’s guise of disinterest, even in the spring.</p>\n<p>Since then, there have been movies in bed. Midnight drives to nowhere. Literal long walks on the fucking beach. Neil cannot possibly believe that he and Andrew are just fuck buddies — not least because the vast majority of their non-platonic interactions would, to Andrew’s chagrin, qualify as <em>cuddling</em>.</p>\n<p>Andrew could fuck somebody and honestly call it nothing. He could not regularly coax Neil down from panic attacks, share Neil’s clothing just because it is lying around, or promise to guard Neil’s life with his own and have it mean nothing. That is not sentimentality. That is just logic. And not even Neil, for all his social ineptitudes, could be blind to it.</p>\n<p>“He has to know,” Andrew repeats.</p>\n<p>Renee, endlessly agreeable, nods and leaves it alone.</p>\n<p>They stay on the roof for nearly an hour, but by the time Andrew returns to the suite, Neil is still not back. The rest of the remaining Foxes are passed out across furniture and the floor.</p>\n<p>Andrew contemplates what to do about Neil as the hot water of his shower bites into his back. He thought he was prepared for this inevitable loss. But Andrew realizes now that he only ever braced for the possibilities of Neil leaving or being taken away. He was not ready to navigate a weird middle ground where Neil stayed and appeared to want Andrew, but not as much — not enough for how Andrew wanted him. This is completely unexpected territory. Andrew needs time and space to plot his next move.</p>\n<p>He gets neither. Andrew has just changed into sleepwear and climbed into his bed when Neil returns from the court, shirtless and sweaty from the jog home — looking better than he has any right to, when Andrew is so angry at him.</p>\n<p>Seriously, fuck everything about today.</p>\n<p>“You are a mess,” Andrew says.</p>\n<p>“What else is new,” Neil quips.</p>\n<p>“You walking around half-naked, apparently,” Andrew says, staunchly ignoring the tug of desire low in his belly.</p>\n<p>Neil has the decency to look abashed. “Oh, yeah. It’s still almost ninety degrees out there, and campus was dead, so.” He rubs the back of his neck, looking doubtful now. “I didn’t think anyone saw, but — ”</p>\n<p>“I am sure that if anyone did, they were more shocked by the sight of a man jogging at midnight than the appearance of your bare torso,” Andrew says. Which is not strictly true, because Neil’s bare torso is a pretty shocking sight to behold, and Andrew has seen some pretty shocking shit in his life. But even amid his bitterness and anger, Andrew has zero tolerance for the goddamn self-loathing look that Neil gets whenever he talks about his body.</p>\n<p>“Go shower, junkie,” Andrew says, to spare both of them the further torture of dwelling on Neil’s shirtlessness.</p>\n<p>Neil goes, and comes back ten minutes later wearing a pair of offensively orange sweatpants and one of Andrew’s t-shirts. Andrew averts his eyes before he can have an emotion about it. He hears Neil crawl into his own bed and wriggle around to get settled before he says, “Yes or no?”</p>\n<p>Andrew cuts his eyes over to Neil, looking soft and sleepy, and Andrew is <em>tempted</em>. It requires every iota of his self-control to say, “No.”</p>\n<p>Normally, this is where Neil would shrug and wish Andrew good night, because he knows how to take a no. Neil always knows.</p>\n<p>Now, though, Neil’s smile slips, and his brow furrows. “Are you okay?”</p>\n<p>He does not preface it with <em>“give me a truth,</em>” so technically, Andrew is not beholden to honesty — if he is beholden to anything with Neil, anymore. If he ever was, beyond his original oath to keep Neil alive.</p>\n<p>“Yes,” Andrew lies.</p>\n<p>“Liar,” Neil says, because he knows better, and right now Andrew isn’t sure which one of them he resents more for letting that happen.</p>\n<p>“Takes one to know one,” Andrew says, because maybe by falling back on the childish retorts he used to keep Neil at arm’s length last year, he can reclaim some of that safe distance.</p>\n<p>“Yup,” Neil says, and waits. When Andrew says nothing, Neil says, quieter, “Is it about us?”</p>\n<p>Since there seems no point denying it now, Andrew lies back and looks at the ceiling. “Yes.”</p>\n<p>Neil goes very, very quiet now, and Andrew finds himself holding his breath to hear if Neil is breathing. At length, Neil says, “About what Nicky said.”</p>\n<p>In a manner of speaking. “Yes.”</p>\n<p>Neil is eerily still for another several seconds, then sits up. “That’s bullshit,” he says fiercely. “If you’re mad about that, take it up with Nicky. <em>I</em> haven’t been going around telling people we’re together. I wouldn’t do that to you, and you should know better than to think I would.”</p>\n<p>Andrew stares at the vicious loyalty on Neil’s face. He knows that expression well. He committed it to memory, the first time Neil snapped at Allison to quit calling Andrew a monster. And again when Jack wondered aloud how Andrew stayed on the team when he made so little effort. And again when another thoughtless freshman asked about Aaron’s trial.</p>\n<p>This is Neil’s protective face. Neil believes he is guarding Andrew from people thinking they are together. Guarding Andrew’s say in the matter, as though Neil doesn’t have one at all.</p>\n<p>Andrew hates when Renee is right, especially about things Andrew should have figured out for himself. Because it was <em>right there</em>, if Andrew had only been looking: In the way Neil said “<em>it’s fine if you hate me</em>” right before their first kiss. In Neil subjecting himself to torture to keep his father’s men away from the Foxes. In the fretful twitching of Neil’s hands as he knelt on a grimy hotel room floor and asked for Andrew’s permission to stay, like he did not know that the entire time he was missing, Andrew felt as though something soft and sensitive and vital had been gouged out of him.</p>\n<p>Suddenly, Andrew needs Neil close. “Come here,” he says, and extends an arm when Neil hesitates. Neil slides out of his bed and into Andrew’s, leaving the usual space between them. Andrew presses a hand to his own chest to demonstrate his intent, ignoring his wildly thumping heart, and says, “Yes or no?”</p>\n<p>Neil nods once, quick and jerky, and crawls into Andrew’s arms. Andrew rolls onto his back to pull Neil on top of him and tucks the comforter around Neil’s shoulders. Neil’s head rests against Andrew’s chest and his fingers curl into Andrew’s shirt. Andrew keeps one arm looped around Neil’s waist and tangles the fingers of his other hand into Neil’s hair. Neil gives a full-body shudder and presses closer.</p>\n<p>Andrew never imagined that someone else’s weight on top of him could be tolerable, let alone comfortable. But with Neil, it is  — nice. The layers of clothing help. But mostly, it is the fact that with Neil, Andrew is holding on, rather than being held down.</p>\n<p>“I haven’t told anyone anything,” Neil mutters against Andrew’s collarbone, quiet but defiant.</p>\n<p>“I know,” Andrew says. He should have known, because Neil is not used to being chosen, either. Neil is used to caring about things that will never care about him back: A mother who treated him as nothing more than an object to hoard. A sport that will cost him his life if he fails to perform. Andrew, who told him point-blank that he was nothing and they were nothing.</p>\n<p>Sure, Neil knew better than “<em>this is nothing</em>,” but he never made any assumptions about what the <em>something</em> was. And it was Andrew's mistake for assuming otherwise, when he knows that Neil Josten is as good as vapor — flighty and elusive and always taking up exactly as much space as he is allowed.</p>\n<p>“Truth,” Neil demands, shifting to prop his chin on Andrew’s sternum to look him in the eye. “Are we okay?”</p>\n<p>No, Andrew is beginning to see exactly how not okay they are. But Andrew considers himself something of an expert in the field of solving Neil Josten-related problems. “We will be,” he says. “Now sleep, junkie.” Andrew needs time and silence to think.</p>\n<p> </p>\n<p> </p>\n<p>\n<strong>4</strong>\n</p>\n<p>Andrew knows how someone like Nicky would recommend solving his problem. Not because Andrew has ever sought Nicky’s counsel a day in his life, but because he has been on the receiving end of so much unsolicited advice from his cousin over the years that Nicky’s obnoxiously encouraging voice enters Andrew’s mind, unbidden: “<em>Just ask him out!</em>”</p>\n<p>That plan, based on the false premise that Andrew is capable of asking for things, is so absurd that Andrew is annoyed that Nicky would even hypothetically suggest it.</p>\n<p>With Neil, Andrew has never had to <em>ask</em>. Andrew demands his share of yes-or-no’s, but primarily for things Neil is practically guaranteed to give: To make out with Neil in the back of the Maserati. To run his hands over Neil’s slick skin in the shower. To loop an arm around Neil’s waist and press his nose against the soft skin behind Neil’s ear in bed.</p>\n<p>Andrew will never stop asking. But, Neil being the touch-hungry wreck that he is, these things are basically gimmes.</p>\n<p>For the big things — the moments when Andrew has not been able to easily guess Neil’s response in advance — Andrew has never had to ask. He has merely had to broadcast his intentions clearly and wait for Neil to catch on. (Andrew still cannot believe he ever had to be as clear as “<em>doesn’t mean I wouldn’t blow you</em>,” but Neil can be slow on the uptake.)</p>\n<p>Andrew decides to employ the same strategy here. And what clearer way to signal “<em>we are dating</em>” than to take Neil on a date.</p>\n<p>They have never been on a date. Like using the word \"<em>boyfriend</em>,\" going on a date has always seemed... unnaturally normal for the likes of them. Besides, listening to someone recount most of his life story to FBI agents renders small talk over appetizers somewhat superfluous, if you ask Andrew.</p>\n<p>But if this is what it takes to get it through Neil’s thick fucking skull that he and Andrew are together, then this is what Andrew will do.</p>\n<p>“I want to go someplace,” Andrew tells Neil, the Saturday afternoon after they return from Virginia. Andrew is smoking out the bedroom window while Neil works on his new five-by-five Rubik’s cube.</p>\n<p>“Go someplace?” Neil says, twisting one side of the Rubik’s cube, considering, and twisting it back. “Where? And why?”</p>\n<p>Neil thinks it’s cute to throw Andrew’s own words back in his face. It is not.</p>\n<p>“Out. For dinner.”</p>\n<p>Neil checks the time on his shitty flip phone. “Now?”</p>\n<p>“No, dumbass. At dinnertime.”</p>\n<p>“Okay, where?”</p>\n<p>“Wherever you want.”</p>\n<p>“I don’t care.”</p>\n<p>Neil never does — not for team lunches, not for Nicky’s newly reinstated family dinners, not for late-night takeout with Andrew on the couch. But Neil eats the most when they order from Rasika, and kissing Neil after he’s put away a cartoon of pork vindaloo is like kissing fire, so Andrew says, “Indian.”</p>\n<p>Despite his claimed indifference, Neil looks pleased. “Seven?”</p>\n<p>“Seven,” Andrew agrees.</p>\n<p>“Cool,” Neil says. “It’s a date.”</p>\n<p>Andrew’s stomach flips. “Yes,” he says significantly, “it is.”</p>\n<p>“Cool,” Neil says, with no indication he has caught Andrew’s meaning.</p>\n<p>Andrew sighs and stands.</p>\n<p>“Where are you going?” Neil says.</p>\n<p>“Shopping.”</p>\n<p>Normally, Andrew would send Nicky on an errand like this, but Andrew does not care to explain Neil’s sudden need for new clothing.</p>\n<p>“Why?”</p>\n<p>“Because you own nothing close to dress-casual.”</p>\n<p>“Since when do we need to dress for curbside pickup?”</p>\n<p>“Since we’re not taking it to go.”</p>\n<p>Neil looks surprised. “Oh.”</p>\n<p>“Problem?”</p>\n<p>“No.” Neil rakes a hand through his hair. “I just haven’t been to a restaurant nicer than Sweetie’s in…”</p>\n<p>Neil’s expression goes darkly distant in a way that Andrew has come to associate with Nathaniel Wesninski. Andrew nudges Neil’s hands to remind him of the Rubik’s cube.</p>\n<p>Neil flips one side of the puzzle back and forth absently. “How long will you be gone?”</p>\n<p>“An hour. Maybe two.”</p>\n<p>“I’ll go for a run now, then.”</p>\n<p>“Neil.”</p>\n<p>“What?” Neil says. Like the real-feel outside is not nearly 105 right now.</p>\n<p>Andrew pinches the bridge of his nose, debates whether this is a debate worth having, and decides not. “Take a fucking water bottle.”</p>\n<p>“I will.”</p>\n<p>“And stay on Perimeter Road.” Neil is prone to nearly giving himself heat stroke by running further than intended. At least if he is running in a circle, there is only so far he can get from air conditioning.</p>\n<p>“Sure,” Neil says, even though he will almost certainly forget as soon as he is outside. Neil seems to enter some sort of meditative state when he runs.</p>\n<p>(He doesn’t even <em>listen</em> to anything. And people call Andrew a psychopath.)</p>\n<p>“Don’t die,” Andrew says. That is really all he is asking for, here.</p>\n<p>Neil rolls his eyes. “I promise not to die before you get back.”</p>\n<p>That promise does not mean much, coming from someone who has actively courted death on so many occasions, but Andrew lets it go.</p>\n<p>Neil does not die before Andrew gets back. He does look good in the clothes Andrew brings.</p>\n<p>Left to his own devices, Neil still dresses like a vagabond. But he has at least stopped protesting whenever Andrew shoves a new shopping bag into his hands. He trusts Andrew to choose things that will cover most of his scars, which is Neil’s only real stipulation when it comes to his attire.</p>\n<p>But Andrew can tell Neil likes wearing what he picks out. At Eden’s Twilight, Neil’s posture is a little more relaxed. Shoulders pulled a little further back. A little less like he is trying to disappear.</p>\n<p>Neil adopts the same casual, more confident stance now as he eyes his new blazer in the bedroom mirror, which Andrew recently rehung on a hook too short for Neil to make eye contact with his reflection. (This was not as big a favor as Neil made it out to be, since the lost inches have inconvenienced only Kevin. Win-win.)</p>\n<p>“Thank you,” Neil says, and Andrew has to look away from his intensely grateful expression.</p>\n<p>Andrew is starting to hate “<em>thank you</em>” from Neil as much as he hates “<em>please</em>” from anyone else.</p>\n<p>“Come on,” Andrew says. “We’re going to be late.”</p>\n<p>“You made a reservation?”</p>\n<p>“That is what civilized people do,” Andrew says. Civilized people. Normal people. Who do this very normal thing that he and Neil are about to do. Andrew tugs at the stiff collar of his shirt. The things he does for Neil fucking Josten.</p>\n<p>“We’ve never done this before,” Neil says on the elevator ride downstairs.</p>\n<p>“Astute,” Andrew says.</p>\n<p>“What’s the occasion?”</p>\n<p>“Impulse.”</p>\n<p>Neil, of all people, cannot argue with that.</p>\n<p>In the parking lot, Andrew opens the passenger door for Neil. Neil looks from the open door to Andrew. “Am I driving?”</p>\n<p>Andrew will never forgive himself for getting involved with someone so oblivious. “No. Get in.”</p>\n<p>Neil gets in.</p>\n<p>They listen to a Russian language CD on the drive, because Neil cues it up out of habit and Andrew cannot think of a good reason to turn it off. It gives him time to think, anyway.</p>\n<p>Andrew feels none of the nervousness or excitement he supposes other people feel on first dates. Maybe he would, if he and Neil were two very different people undertaking this rite of passage under very different circumstances. Maybe he would, if Andrew were at all convinced Neil had a fucking clue what was going on.</p>\n<p>Andrew makes his next attempt to clarify matters on their way into the restaurant, letting his pinky catch on Neil’s to request his hand. Neil gives it without hesitation, but his expression is bemused. They do not hold hands in public — or even much around Fox Tower, because Nicky is a sentimental dipshit without the survival instincts to control his cooing. Andrew responds to Neil’s raised eyebrows with a challenging eyebrow of his own. Neil grins and squeezes Andrew’s hand twice in quick succession.</p>\n<p>Another perk of calling the restaurant ahead: specifically requesting that one table set into the bay window beside the door. When a corner booth that allows both of them to sit with their backs to the wall is not an option, a nearby exit is the next best thing.</p>\n<p>As the waitress pours their water, Neil eyes the tablecloth, the candle, the small arrangement of succulents on the windowsill. “This is weird,” he says as soon as the waitress leaves.</p>\n<p>“Bad weird?”</p>\n<p>“No.” Neil plucks at the cuffs of his crisp new shirt. “Just weird. I feel like a dog wearing glasses.”</p>\n<p>That is, Andrew thinks, exactly what this feels like. “That’s stupid,” he says. “The winter banquet is way fancier.”</p>\n<p>“Yeah, but that’s for Exy.”</p>\n<p>“Always about Exy, with you.”</p>\n<p>“You brought it up.”</p>\n<p>“Tell me something good,” Andrew says, to preempt further Exy-related conversation.</p>\n<p>This is a new part of their bartering system. Neil undoubtedly has many more deep, dark secrets than he revealed to the FBI, but Andrew is not interested in trading for them. At least, not right now. He knows enough. He also knows that Neil will reveal the most important things of his own accord, in the car on a bad day, or in the dark after a nightmare.</p>\n<p>The shiny new facts about Neil that Andrew collects now are the memories that would not otherwise come up in conversation. Neil lived dozens of lives between Baltimore and Millport, and Andrew knows that not <em>every</em> moment of that eight-year period was spent in a car chase. Andrew wants to know what else Neil was doing the rest of the time.</p>\n<p>This summer, Andrew has met several of Neil’s past selves. He knows Victor’s favorite gelato shop in Milan. John’s running route along the Charles River. Daniel’s fondness for the cramped third-floor room he and his mother rented in the saltbox house on the coast of Maine. These trivial facts simultaneously make Neil seem more tangible and more elusive than ever.</p>\n<p>Andrew waits to see what Neil will offer up tonight, as Neil’s eyes pan thoughtfully around the restaurant, across the table, out the window, and finally come to rest on the succulents. Something about their delicate geometry must jog his memory, because Neil says, “Have I told you about the bonsai artist who rented the apartment below ours in Raleigh?”</p>\n<p>He has not. And so Neil describes for Andrew the jungle of miniaturized trees crammed into Mr. Kimura’s tiny apartment, which Neil explored while cat-sitting.</p>\n<p>“Your mother,” Andrew says dubiously, “let you enter a stranger’s apartment alone.”</p>\n<p>“Only while he wasn’t there,” Neil says. “I think she hoped it would make me shut up about adopting a cat of our own.”</p>\n<p>“<em>Neil</em>,” Andrew says, exasperated at the sheer incongruence of him — how he manages to be the most thoughtless overthinker Andrew has ever met. “Not even you could have thought that was a good idea.”</p>\n<p>“No,” Neil admits. “But it would’ve been nice to have a friend.”</p>\n<p>That does something strange and unwelcome to Andrew’s stomach, and he is grateful for the waitress’s interruption to take their orders.</p>\n<p>Once they are alone again, Neil knocks Andrew’s ankle with his own. “Your turn. Good thing, go.”</p>\n<p>“Pick a number,” Andrew says. For all his perfect recall, Andrew has more difficulty pulling up good memories on demand. Specificity helps. Neil knows which numbers to avoid.</p>\n<p>“Seven,” Neil says.</p>\n<p>Andrew opens his mental file on Home No. 7 and flips through: A gravel road and bunk beds. Basketball hoop over the garage and his foster brother’s sour body odor. Breakfast for dinner and shouting downstairs after lights out. Andrew was almost relieved when they sent him away for —</p>\n<p>“Camp,” Andrew says.</p>\n<p>“What kind of camp?”</p>\n<p>“Boy Scouts.”</p>\n<p>Neil is shocked and delighted. “<em>You</em> were a Boy Scout?”</p>\n<p>“Briefly.”</p>\n<p>“You’re joking.”</p>\n<p>“When have I ever.”</p>\n<p>Neil slumps back in his seat, acclimating to this new information. “All right, what was so great about Boy Scout camp?”</p>\n<p>The best thing about being at Boy Scout camp was not being somewhere else. It was fine, Andrew supposed, learning celestial navigation and fire-starting and other so-called survival skills. Not that any of those ever mattered, where Andrew’s own survival was concerned. Where the real danger was Andrew’s desire to unzip himself from his own filthy skin.</p>\n<p>“That’s where I learned to use knives,” Andrew says, surprising himself with the memory. He has not thought about that in a long time.</p>\n<p>“For hunting?”</p>\n<p>“In theory. In practice, mostly wood-carving.”</p>\n<p>“I’ve never seen you whittle.”</p>\n<p>“I don’t.”</p>\n<p>“Why not?”</p>\n<p>Andrew shrugs. There was an inflection point, when knives became weapons rather than instruments, and that is all they have ever been since.</p>\n<p>“But you remember how,” Neil says.</p>\n<p>“Obviously.”</p>\n<p>“Could you teach me?”</p>\n<p>“Why?”</p>\n<p>“Because I’m running out of Rubik’s cubes.”</p>\n<p>So Neil thinks. He hasn’t seen the Rubik’s tetrahedron Andrew is waiting to drop on him as soon as he finishes the five-by-five.</p>\n<p>“And it would be fun,” Neil adds.</p>\n<p>“Would it.” Andrew cannot fathom what he might have done to give Neil the impression he would make a good, let alone fun teacher.</p>\n<p>“More fun than lessons with Lola,” Neil says.</p>\n<p>The joke lands incorrectly. Painfully.</p>\n<p>“More fun than lessons with the predatory pseudo-aunt who tortured you,” Andrew says. “I’m flattered.”</p>\n<p>Neil winces. “Sorry. I didn’t mean it like that.”</p>\n<p>Andrew knows he didn’t. And of all the things Andrew does not want to do on their first date, fighting with Neil and thinking about Lola Malcolm are both high on the list. Andrew sighs. “What would you teach me in return for whittling?”</p>\n<p>A smart-aleck smile spreads across Neil’s face. “Well, there are a few Raven drills — ”</p>\n<p>“Neil.” The door is right there. Andrew <em>will </em>leave.</p>\n<p>Neil keeps grinning, immensely pleased with himself. “Okay, okay. Um. I could teach you some French.”</p>\n<p>“Why would I want to learn French,” Andrew says, “when Kevin knows French.” That was the whole point of Russian.</p>\n<p>“We don’t have to <em>tell </em>Kevin that you know French,” Neil says, his smile gone devious now.</p>\n<p>Only the arrival of their food prevents Andrew from grabbing Neil by his fancy new collar and dragging him across the table for a kiss.</p>\n<p>The evening is shockingly normal, by first date standards. Exchanging childhood stories, check. Swapping hobbies, done. Future plans, made. By the time they are waiting for the check, Andrew is almost ready to chalk the night up as a win.</p>\n<p>That’s when the girl approaches — a short brunette with a PSU sweater that Andrew recognizes from the tutoring center. She looks wary, which Andrew approves of, but eager, which he does not. She offers a tentative smile to Andrew’s blank stare before directing her attention to Neil.</p>\n<p>Neil must have seen her coming the second Andrew did, but he does not acknowledge the stranger until she is standing over their table, unavoidable. Neil’s foot finds Andrew’s under the table.</p>\n<p>And here is another incongruence of Neil Josten: how he gives no ground to reporters or FBI agents, yet shrinks from fellow students like they might throw heavy, perhaps sharp objects at him. After a few days of being assaulted with congratulations over championships, Neil holed up in Fox Tower and refused to leave for anything but exams until the rest of the student body was gone for the summer.</p>\n<p>“Hi,” the girl says, dialing her smile up to full brightness for Neil, whose foot digs painfully into Andrew’s. Andrew kicks it off and presses his own foot over Neil’s.</p>\n<p>“Hi,” Neil says.</p>\n<p>Andrew says nothing, but the girl is not looking at him anyway.</p>\n<p>“You’re Neil Josten, right?” she says.</p>\n<p>Neil frowns. “Yeah.”</p>\n<p>“I’m Marta.”</p>\n<p>“Okay.”</p>\n<p>Marta blinks, wrong-footed, but forges on. “Congratulations on spring championships.”</p>\n<p>“Thanks.”</p>\n<p>“You had an amazing season.”</p>\n<p>“Thanks.”</p>\n<p>“High bar to set for yourself, freshman year.”</p>\n<p>Neil’s frown deepens. “I didn’t do it alone.”</p>\n<p>“Oh, I didn’t mean to imply you had,” Marta says, eyes going wide. “Only that you play really well for a freshman.”</p>\n<p>“Oh,” Neil says, clearly not sure whether to feel complimented or insulted.</p>\n<p>Andrew heard about some girl’s ill-fated attempt to flirt with Neil last winter, but he has never gotten to witness the glorious catastrophe of it in-person. It would be amusing, if the interruption were not so unwelcome.</p>\n<p>“Your switch to backliner in the second half of the final match was incredible,” Marta says, a little desperately now — and finally Neil shows some slight interest in the conversation.</p>\n<p>“That was Andrew’s idea,” he says, on the verge of a smile.</p>\n<p>Which finally gets Marta to acknowledge Andrew. “That was really clever,” she says. “Using Neil’s speed as a weapon for defense.”</p>\n<p>“Do you play?” Neil says, his mildly interested tone souring what was left of Andrew’s mildly good mood.</p>\n<p>Marta blushes and runs a hand through her hair. “No. Actually, my friend had to coach me on what to say before I came over.” She laughs, light and gently self-deprecating.</p>\n<p>Neil, who would not recognize flirtation if it cracked him in the ribs with an Exy racquet, looks baffled. “Why?”</p>\n<p>Marta’s blush deepens. “Well, I didn’t want to make a fool of myself.” She tucks her hair behind her ears. “My brothers played little league, but your final was the first match I’d seen in a while.”</p>\n<p>“Oh,” Neil says, and Andrew watches him mentally file Marta away among the majority of PSU that never gave a damn about their small, scrappy Exy team until it defeated the Ravens.</p>\n<p>“Maybe you could teach me about it sometime,” Marta says. “Over drinks? We were going to go over to Blackjack after dinner, if you want to join.”</p>\n<p>Andrew stiffens. Neil’s eyes cut over to him briefly before returning to Marta. “We’re kind of in the middle of something,” Neil says.</p>\n<p>“You could meet us there,” Marta suggests.</p>\n<p>“No thanks,” Neil says. “I don’t drink.”</p>\n<p>“Some other time, then? We could meet for coffee or — ”</p>\n<p>“He said <em>no</em>,” Andrew says, and startles when Neil’s fingers catch his own. Andrew looks down and realizes he had been reaching for his armband. He and Neil stare at each other for a moment, until Marta claps her hands over her mouth.</p>\n<p>“Oh my god,” she says, staring at their linked fingers and turning redder than ever. “I am <em>so</em> sorry. I didn’t realize.”</p>\n<p>“Realize what?” Neil says.</p>\n<p>Andrew could kill him.</p>\n<p>Marta, looking like she regrets every life choice that ever led her to this table, says, “That you’re together?” </p>\n<p>“We’re not together,” Neil says.</p>\n<p>Even though Andrew expected them, the words still hit like ice water. He pulls his hand out of Neil’s and crosses his arms.</p>\n<p>“Okay,” Marta says slowly. “So, just to clarify, you’re not going out with him, but you don’t want to go out with me, either.”</p>\n<p>“Right,” Neil says, looking immensely relieved that they are all finally on the same page.</p>\n<p>Andrew is definitely going to kill him.</p>\n<p>“Right,” Marta echoes. “Well. Um. This has been more humiliating than I could have possibly imagined, so I’m just going to...” She turns on her heel for a hasty retreat without finishing her sentence.</p>\n<p>Neil watches her go with a perturbed expression, leaving Andrew to collect the bill from their waitress. Andrew pays it in cash so they can leave immediately.</p>\n<p>“You didn’t have to do that,” Neil says on the way back to the car. He gestures to Andrew’s armbands. “That wasn’t some guy at Eden’s Twilight trying to stick his hands down my pants.”</p>\n<p>Andrew knows the difference. That is why Marta, unlike the handsy clubber, is going home with all her fingers intact. Andrew also knows better than to ignore someone ignoring a “<em>no</em>.”</p>\n<p>“I can look out for myself,” Neil says.</p>\n<p>“I have yet to see any evidence of that.”</p>\n<p>Neil smirks. “Because you’re always looking out for me.”</p>\n<p>“Someone has to,” Andrew says.</p>\n<p>Neil goes quiet for a suspiciously long moment. When Andrew looks over, he catches Neil wearing a contented smile. It is so different from the sharp grin of satisfaction he wears after pulling off a play on the court. Smaller and softer in a way that does not quite fit his face. The sight of it touches Andrew like a feather-light brush against his skin — a sensation that demands to be scratched or slapped away.</p>\n<p>“Shut up with that look,” Andrew says.</p>\n<p>“You like it.”</p>\n<p>“I hate it.” At the very least, Andrew should not be forced to look at it right after watching someone else ask Neil out and Neil hitting him with another “<em>we’re not together</em>.”</p>\n<p>“Just like you hate the rest of me,” Neil says, apparently set on being annoying.</p>\n<p>“Just like I hate the rest of you,” Andrew confirms.</p>\n<p>Neil’s smile widens.</p>\n<p>“You are impossible.” Andrew clicks the unlock button on his key fob as they turn down the street where the Maserati is parked. “That girl has no idea the bullet she just dodged.”</p>\n<p>Neil snorts. “Right? Can you imagine what it would be like to date me?”</p>\n<p>“Oh, I don’t know, Neil,” Andrew sighs. “What <em>would</em> that be like.”</p>\n<p>“Terrible,” Neil says, with sky-is-blue certainty. “I don’t know why anyone would ask me out.”</p>\n<p>“Must be your pretty face,” Andrew says, which is closer to a real compliment than he means to give.</p>\n<p>Neil scoffs. “Sure.”</p>\n<p>Andrew stops in front of the car to study Neil. “You disagree?”</p>\n<p>Neil cocks his head to the side, like he’s unsure whether Andrew is messing with him. “Uh, yeah? Despite my best efforts, I have actually looked in a mirror.”</p>\n<p>“And?”</p>\n<p>Neil gives a stiff, defensive shrug. “I guess I was probably fine to look at before.”</p>\n<p>“Before Lola.”</p>\n<p>Neil shrugs again and rubs a hand over the mottled skin of his cheek. \"I know the scars can’t be pleasant to look at.”</p>\n<p>Neil is right. They are not pleasant to look at. Neil’s scars are a constant reminder of the gutting realization that Neil was taken. A constant invitation to imagine Neil, alone and scared and in pain.</p>\n<p>Neil’s scars are fucking awful, but for none of the cosmetic reasons that Neil apparently imagines. It is not a lie when Andrew says, “You look fine.”</p>\n<p>“Sure,” Neil says. His wan smirk is so <em>not Neil</em> that Andrew wants to slap it off his face.</p>\n<p>“Ask for a truth, if you don’t believe me.\"</p>\n<p>Neil hesitates. “I don’t think you’re lying,” he says. “<em>You</em> might think I look fine.”</p>\n<p>“What the fuck does <em>that</em> mean.”</p>\n<p>“I mean you were the only one who saw my face right after Lola melted half of it off,” Neil says, and Andrew violently shoves down the memory of soft tissue peeling back with bandages, exposing the delicate ooze. “Of course this looks better than that,” Neil says, with a flippant gesture at his face, “no matter how ugly it — ”</p>\n<p>“Shut up,” Andrew says, chest tight with the furious, coiled need to <em>do something</em>. “Just — shut up. Yes or no?”</p>\n<p>Neil barely has time for a startled nod before Andrew shoves his back up against the Maserati.</p>\n<p>Their first kiss was rough. Vicious. It was Andrew flashing poison-bright colors in a warning that Neil, of course, completely ignored. They have not kissed quite like that since. They do not often kiss with anger. They do kiss with urgency. Andrew kisses Neil urgently now, swallowing the soft “<em>mph</em>” that Neil makes on impact.</p>\n<p>Andrew holds Neil’s face tightly between his hands, tracing his thumb along the periphery of scar tissue where Neil regains sensation. Neil emits a small, needy noise, his hands grasping at the hem of Andrew’s jacket. Andrew takes Neil’s wrist to guide his hand to Andrew’s hip. “Only here,” he murmurs into Neil’s mouth. Neil gives a quick nod. Andrew bites at his bottom lip to elicit another pretty noise and a shiver before covering Neil’s mouth with his own again.</p>\n<p>Kissing Neil has always been a fluorescent thrill. But the touch is more electric, every nerve in Andrew’s body aglow, when he kisses Neil to <em>tell</em> Neil something. Andrew cups the left side of Neil’s face in one hand and wraps the other around the nape of Neil’s neck. He tangles his fingers in Neil’s hair and tightens his grip, savoring Neil’s soft gasp and <em>willing</em> him to understand.</p>\n<p>When Andrew pulls back, hot and humming, he shifts his hands to press his thumbs under the juncture of Neil’s jaw, against his pulse. A heavy thump beneath the pads of Andrew’s fingers — irrefutable evidence that Neil Josten is right here, real and alive, in Andrew’s hands. With kiss-swollen lips and flushed cheeks, breathing heavily and blinking at Andrew with that ridiculously open expression that overthrows Andrew every time.</p>\n<p>If there were ever a moment for Andrew to force the words out — explain to Neil exactly what he is to Andrew, how real and alive it makes Andrew feel to hold Neil’s heartbeat in his hands — this would be it. Standing in this dim side street that smells like damp fast-food and stale cigarettes, close enough to feel Neil’s exhales and practically high on potential energy.</p>\n<p>But the right words, if they exist, are somewhere unknown, deep inside Andrew, unreachable. Instead, Andrew says, “Never say shit like that about yourself ever again.”</p>\n<p>The post-kiss glaze in Neil’s eyes has cleared, and he stares at Andrew longer than Andrew would normally allow, before leaning in for one more quick kiss. “Okay,” Neil says, and steps around Andrew to get in the passenger side.</p>\n<p>For tonight, Andrew will let that be enough.</p>\n<p> </p>\n<p> </p>\n<p>\n<strong>5</strong>\n</p>\n<p>In the wake of the disastrous sort-of-date, Andrew allows himself one week to regroup before plotting his next move. In that time, Neil manages to get sick.</p>\n<p>Andrew’s first thought is, who gets sick in the middle of July.</p>\n<p>The second is, of course <em>Neil</em> would get sick in the middle of July, because Neil has never met a norm he did not immediately tell to go fuck itself.</p>\n<p>And the third is, it is actually more surprising that Neil has gone this long without getting sick. Even during the summer, Neil’s meal and sleep schedules are absolute garbage. He hangs back after practice most days to work one-on-one with various freshmen and keeps up his night practices with Kevin — usually with another freshman in tow.</p>\n<p>Friday night, Neil brings Aisha to the court to teach her a few backliner drills of his own invention, while Kevin supervises and Andrew pretends not to watch from the stands. Neil keeps interrupting himself mid-sentence to cough, and he is not quite as quick on his feet as usual when he demonstrates a series of complicated footwork for Aisha. The freshman appears mildly concerned, but not enough to dare suggest they take a break. Kevin and Neil, meanwhile, appear to notice nothing.</p>\n<p>And why should they, Andrew thinks, after all the Raven practices they have both endured black and blue. But, like most problems that go unnoticed by Neil and Kevin’s single shared brain cell, this one is obvious to anyone with a modicum of self-preservation.</p>\n<p>“You’re getting sick,” Andrew says, after he is awoken on Saturday morning by Neil having a tremendous coughing fit over the side of the bed.</p>\n<p>“I’m fine,” Neil says, and Andrew considers shoving him the rest of the way off. “Probably just allergies.”</p>\n<p>“Since when do you have allergies.”</p>\n<p>Neil, a coward, does not respond.</p>\n<p>“You are sick,” Andrew says on Saturday night, flicking one of Neil’s many used tissues at him across the table.</p>\n<p>“No, I’m not,” Neil says, through thick congestion.</p>\n<p>Fine, Andrew thinks. Let him suffer.</p>\n<p>“Are you done pretending that you’re not sick,” Andrew says, when he picks Neil up from the side of the road on Sunday afternoon.</p>\n<p>Andrew’s aimless drive off campus was interrupted by a phone call from Nicky, reporting that a few soccer players had seen someone sitting on the curb on their way back to Fox Tower and assumed it was “<em>that crazy striker who’s always running</em>.”</p>\n<p>Maybe if Andrew tells Neil that his insane exercise routine has rendered him recognizable to strangers — even while sitting with his head between his knees, <em>christ,</em> Neil — then he will exercise some self-control.</p>\n<p>“’m not sick,” Neil says, sliding into the passenger seat and slumping back with his eyes shut. “Just got dizzy for a second.”</p>\n<p>Andrew lightly smacks Neil’s cheek to make him open his eyes and drink from a water bottle. While Neil is distracted, Andrew holds one hand against his forehead, but it is impossible to tell whether Neil’s temperature is a consequence of fever or sitting outside in hundred-degree heat.</p>\n<p>Andrew pulls a shirt from the bag of Exy gear in his backseat to wipe Neil’s sweat off his hand. “You should have called.”</p>\n<p>Neil drains the entire water bottle and wipes his mouth on the sweat-drenched collar of his shirt. Andrew pushes his own spare shirt into Neil’s hand. Neil wipes his face with it. “Didn't want to bother you,” Neil says.</p>\n<p>“You always bother me.”</p>\n<p>Neil smiles weakly and accepts the second bottle of water that Andrew drops in his lap. “I know,” he says. “But I was fine.”</p>\n<p>Last summer, Andrew would have mistaken that for a lie — or at the very least, false bravado. But Andrew knows now that after outrunning armed pursuers on a broken ankle, jogging with a summer cold <em>is</em> Neil’s definition of fine. Neil could suffer any illness or injury and keep going because he has always had to, and he has no clue how to stop now that he can.</p>\n<p>“One thirty-six,” Andrew intones. But it is possible that Neil, once again leaned back with his eyes closed, is already asleep.</p>\n<p>When they cross the threshold of the suite ten minutes later, Andrew nudges Neil toward the couch. “Sit.”</p>\n<p>The sound of Andrew’s voice summons a fretful Nicky out of his bedroom. “<em>Neil</em>,” he says, making a beeline for Neil with outstretched hands — but stopping up short when Neil, still groggy from his brief nap in the car, flinches. Hurt flashes briefly across Nicky’s face, but he masks it quickly with concern. “Are you okay?”</p>\n<p>“I’m fine,” Neil says, drawing his shoulders up against the attention.</p>\n<p>“He almost fainted,” Andrew says, which earns a gasp from Nicky and a glare from Neil, which Andrew ignores. If Neil does not want to worry people, he should not go around almost fainting. “I said <em>sit</em>.”</p>\n<p>“I need to shower,” Neil says.</p>\n<p>“You need to eat.”</p>\n<p>“I ate before running.”</p>\n<p>“Really. When.”</p>\n<p>Neil is silent, either struggling to remember the honest answer or making up a lie.</p>\n<p>“<em>Neil</em>,” Nicky says again, with cloying pity.</p>\n<p>“I’m <em>fine</em>,” Neil says, a sentiment immediately undercut by a wet, raspy hacking fit.</p>\n<p>When Neil emerges from his elbow, Andrew says, “If you’re not sitting on the couch when I come back with soup, I’ll tell Boyd you’re sick.” Andrew usually finds the upperclassmen’s self-appointed roles as Neil’s overbearing older siblings tiresome, but they can be useful. “You want another one of those around?” Andrew adds, pointing at Nicky’s literal hand-wringing.</p>\n<p>Neil glares, but he sits.</p>\n<p>Andrew turns to Nicky. “Make sure he stays.”</p>\n<p>“On it!” Nicky says with a grin, flinging himself onto the couch beside Neil and crossing his ankles over Neil’s lap.</p>\n<p>Nicky keeps Neil trapped there until he has suffered through an entire bowl of chicken noodle soup, grumbling intermittently about how very <em>fine</em> he is while Andrew and Nicky ignore him. Andrew has an Exy game cued up when Neil returns from his shower to lure him back to the couch, but Andrew gets to change the channel back to Animal Planet less than five minutes later when Neil passes out, head tipped back and breathing loudly through his mouth.</p>\n<p>Nicky lifts a hand toward Neil’s shoulder, but stops at Andrew’s sharp, “Don’t.”</p>\n<p>“He’s going to get a stiff neck, if he sleeps like that,” Nicky says.</p>\n<p>“And you are going to get a black eye, if you wake him up.”</p>\n<p>“God, you guys are the same person.”</p>\n<p>“How dare you.”</p>\n<p>In truth, Andrew is more likely to hit Nicky than Neil is, if he wakes Neil up. Neil is more prone to fear than violence when he wakes up somewhere unexpected.</p>\n<p>Andrew digs a blanket out from behind his beanbag chair and throws it at Nicky. “Tell Aaron and Kevin to be quiet when they get home.”</p>\n<p>Nicky obediently drapes the blanket over Neil and texts the others while Andrew returns Neil’s bowl to the kitchen sink and retrieves a thermometer from the medicine cabinet.</p>\n<p>Neil sleeps straight through three hour-long wildlife documentaries, during which Aaron and Kevin collect Nicky for dinner and Andrew takes Nicky’s spot on the couch. In the middle of a special on lion pride dynamics, Andrew finally feels Neil stir — first with a few small twitches and soft noises, then with a violent jerk as he sits bolt upright.</p>\n<p>“Neil.”</p>\n<p>Neil whips his head around at the sound of Andrew’s voice. His wild eyes land on Andrew’s face, and Andrew sees the moment that recognition enters them. Neil’s shoulders drop and he unclenches his fists from the blanket on his lap. He releases a shaky exhale and slumps back, digging the heels of his hands into his eyes. “What time’sit?”</p>\n<p>“Almost eight.”</p>\n<p>“Shit,” Neil says from behind his hands, voice rough with sleep and a likely sore throat. “Didn’t mean to sleep that long.”</p>\n<p>“Sick people need sleep.”</p>\n<p>“I’m not sick.”</p>\n<p>Sometimes, Andrew regrets commenting on Neil’s idiocy so often, because the words seem to have lost some of their punch when he says, “You’re an idiot.”</p>\n<p>Neil, apparently with no defense against the truth, says nothing. He tips his head forward to massage the back of his neck.</p>\n<p>“Go lie down,” Andrew says.</p>\n<p>Neil scoffs. “I just slept for three hours.”</p>\n<p>“Like I said, sick people need sleep.”</p>\n<p>“Like <em>I</em> said, I’m not sick.”</p>\n<p>Andrew holds out the thermometer. “Prove it.”</p>\n<p>Neil raises an eyebrow. “And if I don’t have a fever, you’ll leave me alone?”</p>\n<p>“Sure,” says Andrew, who can practically feel the fever radiating off Neil.</p>\n<p>Neil sticks the thermometer under his tongue with a defiant “<em>just you wait</em>” expression.</p>\n<p>Andrew waits to be proven right. He is, ten seconds later, by the thermometer’s readout of 101.7.</p>\n<p>“That’s like, barely a fever,” Neil says, scowling down at the thermometer screen.</p>\n<p>“For someone who knows how to suture wounds and reset bones, you sure do lack a fundamental understanding of human health,” Andrew says.</p>\n<p>“It’s <em>fine</em>,” Neil grumbles. “I don’t even feel that sick.”</p>\n<p>Andrew’s irritation flares. Neil has so many <em>vastly complicated</em> problems, tangled up in mafia politics and the federal investigations thereof. A head cold? Not fucking complicated. If only all of Neil’s problems had solutions as simple as orange juice and Advil.</p>\n<p>“Fine, don’t rest,” Andrew says. “Never get better. See how useful you are to the Foxes when you can’t run a full practice without passing out.”</p>\n<p>Neil flinches, and Andrew might have regretted saying that, if it were not so effective. He watches Neil chew his lip and roll the fabric of the blanket between agitated fingers, not meeting Andrew’s eyes.</p>\n<p>“Fine,” Neil says at length. “I’ll go to bed. But I’m not going to be able to fall asleep again.”</p>\n<p>“Count backward from a million for all I care,” Andrew says. “Just do it lying down.”</p>\n<p>Neil goes.</p>\n<p>Like most arguments with Neil, the satisfaction of winning this one is short-lived. Andrew is on his way back from a CVS run for cold medicine and Kleenex when his phone rings.</p>\n<p>“Neil is at the court,” Nicky says.</p>\n<p>It is fortunate that Andrew is sitting at a red light, as he has to close his eyes to contain his anger. “You let him go?”</p>\n<p>“No!” Nicky says. “No, I swear. He was gone when we got home. We assumed he was with you, but Mica just texted. Apparently, Neil made him drive them to the court early for night practice. Mica thinks there’s something wrong with Neil.”</p>\n<p>Andrew pulls an illegal U-turn at the light to head back toward the court. “I’ll get him.”</p>\n<p>“Thanks,” Nicky says. “Also, Kevin wanted me to make sure to tell you that he didn’t put Neil up to — ”</p>\n<p>Andrew hangs up. Kevin is as much at fault for getting Neil hooked on night practices as Andrew is for his imprudent “<em>see how useful you are</em>” comment.</p>\n<p>Outside the Foxhole Court, Andrew parks beside Mica’s unassuming Honda. If Neil drafted the new goalkeeper for tonight’s practice, that means he is more interested in taking shots than teaching.</p>\n<p>“<em>See how useful you are</em>.” Andrew should have known a comment like that would drive Neil here. </p>\n<p>Andrew grabs his bag from the backseat and goes inside.</p>\n<p>He enters the stands near the Home goal, where Mica is busy deflecting balls fired by Neil from the first-court line. Neil’s shots are sloppy, and Mica bats away nearly a quarter of them — probably the freshman’s first indication that something was wrong. Whatever Renee claims about the kid having promise, Andrew can count the number of shots Mica has blocked from Neil during normal practices on one hand.</p>\n<p>Andrew watches as Neil takes two dozen stationary shots, apparently not up to the task of a running start. Nor does Neil chase after any of the rebounds from Mica’s saves, as he usually does to keep the round going as long as possible. Neil stumbles back from almost every swing, and his trembling hand drops the thirtieth ball back into the bucket a couple of times before he successfully loads it into his racquet. Yet Neil continues his merciless barrage on the goal.</p>\n<p>Neil Josten is ravenous for Exy. That feral hunger was what first caught Andrew’s interest. For Andrew, aspiration was such an old, impossible ache that the hollowness barely registered anymore. But here was Neil Nobody Josten, a ruin of ambition. Neil did not want Exy the way Kevin did — like Exy was a stolen family heirloom he was entitled to reclaim. Neil needed Exy like a starving man needed a meal — a desire so strong that even Andrew thought he could feel the pangs of <em>wanting</em> again. He knows it had a similar effect on the rest of the Foxes. There is no other explanation for their astronomical rise this season.</p>\n<p>Andrew does not believe there is anything unique about Exy. In some alternate universe, Neil is kicking ass on a roller derby track or hockey rink. Andrew imagines that Neil’s obsession would still be a team sport, given how terrified Neil is of his own potential for violence, and how much comfort he takes in the sanctioned aggression of the court. But all Neil ever needed to survive was an impossibility to chase, and Exy happened to be the one right in front of him.</p>\n<p>Sometimes, it is fascinating to watch Neil manufacture almost religious meaning from an activity so inherently, cyclically pointless. Other times — right now, for instance — it is just exhausting.</p>\n<p>When Neil has emptied the entire bucket of balls at his feet, he leans heavily on his racquet to catch his breath. There are huge sweat patches beneath his armpits, and his inhales rattle. Neil, usually so preternaturally aware of his surroundings, does not seem to have noticed Andrew’s arrival.</p>\n<p>“Let’s go again,” Neil tells Mica, dragging a forearm across his forehead.</p>\n<p>“Are you sure?” Mica clutches his racquet to his chest with both hands. “Maybe you should— ”</p>\n<p>“Maybe you should watch the upper-left corner,” Neil says, using his racquet to round up the balls closest to his feet, “so I don’t land another twelve shots there next time.”</p>\n<p>Andrew retreats to the locker room to put on his padding.</p>\n<p>Andrew has never cared about Exy. He could not love the sport any more than Neil could love I-95 or Route 66 or any of the other roads he took away from his father. Until Neil, Exy was just the thing Andrew rode from hour to hour, day to day, away from the bad things behind him.</p>\n<p>With Neil, though, Exy is also a useful language to speak when Andrew cannot find the right words, or Neil will not listen.</p>\n<p>After tightening his gloves and lodging his helmet under his arm, Andrew returns to the court, where Neil and Mica have nearly finished collecting the balls. Andrew lets the court door slam behind him to get their attention.</p>\n<p>“Andrew,” Mica says, looking, for the first time ever, relieved to see Andrew coming.</p>\n<p>“Shut up,” Andrew says — the most succinct of all the choice words he has for the moron who drove Neil here when he looks like this.</p>\n<p>Neil is downright sallow under the fluorescent lights. “What are you doing here?” he says, eying Andrew’s protective gear warily.</p>\n<p>“What are <em>you</em> doing here?” Andrew says, jabbing Neil’s chest with his racquet.</p>\n<p>Neil sways dangerously for a second before catching himself and batting Andrew’s racquet away irritably. “What I do every night. Practice.”</p>\n<p>“Practice,” Andrew scoffs. “Is that what you call landing thirty-five of fifty shots on a freshman? I’d call that an embarrassment.”</p>\n<p>In Andrew’s peripheral vision, Mica takes a step back.</p>\n<p>Neil’s irritation evolves into anger. “Fuck you,” he says. “I’m having an off night.”</p>\n<p>“Gee. Wonder why that might be.”</p>\n<p>Neil rolls his eyes. “Did you seriously come all the way down here just to lecture me?”</p>\n<p>“No. I came to make a deal.”</p>\n<p>Neil’s eyes widen marginally, then narrow. “What?”</p>\n<p>“If you can get a single ball in that bucket past me,” Andrew says, “I’ll shut up about you being sick.”</p>\n<p>Neil is incredulous. “A single point. Are you serious?”</p>\n<p>“Deadly.”</p>\n<p>Neil looks simultaneously suspicious and offended. “I’m not the same dumb kid who threw his arm out last summer,” he says coolly.</p>\n<p>No, he is not. But he still has not stopped leaning on his racquet for support.</p>\n<p>“Yes or no, Neil?”</p>\n<p>Andrew can read the answer in the set of Neil’s jaw before he opens his mouth.</p>\n<p>“Get in the goal.”</p>\n<p>Mica does not have to be told to scram. In front of the Home goal, Andrew rolls out his neck and shakes out his arms before putting on his helmet and planting his feet in a ready position. While Andrew is confident that he can close out a goal against a feverish, exhausted Neil, it is true that Neil’s power and precision have both improved orders of magnitude over the last year. Shutting him out, even in this state, will require effort.</p>\n<p>Neil stands on the first-court line with a ball in his racquet, waiting for Andrew to signal readiness. “Any day now, Neil,” Andrew drawls, just to ruffle him.</p>\n<p>Neil’s first shot goes wide left, and Andrew savors the crack it makes against his racquet before it flies to the other side of the court. “You can do better than that,” Andrew says, as he sends the second ball Neil hurls at him straight back over Neil’s head.</p>\n<p>Neil rains shots down on Andrew with reckless vengeance, and Andrew slams ball after ball away from the goal as hard as he can. Normally, Andrew aims for Neil’s ankles to make him dance a little, but Neil is unsteady on his feet as he is. Even from this distance, among the squeak of sneakers and clatter of Andrew's racquet, Andrew can hear Neil’s labored breathing.</p>\n<p>Andrew deflects a dozen shots, then another dozen. Neil fumbles the twenty-eighth ball so badly he has to stumble after it before loading it into his racquet and lobbing it at Andrew, who knocks it aside with ease. Neil does not stop. He never knows how to stop.</p>\n<p>“<em>Typical of a jock</em>,” Andrew had thought, during that first practice. Andrew had seen and smashed Exy balls into the knees of plenty like him before. But Andrew had misunderstood. It was not ego that drove Neil, but pure id — a raw, lizard-brain desperation that was much harder to beat out of a person than dumb jock pride.</p>\n<p>So much has changed since then. And yet this faceoff ends exactly the same, with Neil crumpled on the court floor.</p>\n<p>Neil has just slipped ball thirty-four into the net of his racquet when he suddenly clutches his forehead. Andrew watches as Neil lists sideways and his legs give out under him.</p>\n<p>Andrew is across the court and on his knees in front of Neil in seconds, yanking off his helmet and gloves. He rests a grounding hand on the back of Neil’s neck and uses the other to push the sweaty hair out of his eyes. “Easy,” he murmurs, barely audible over Neil’s rasping breath. “Easy, Neil.”</p>\n<p>Andrew’s head snaps up at the sound of the court door opening. Mica rushes forward with a bottle of water in his outstretched hand. Andrew takes it and holds it in front of Neil’s face until his eyes focus. “Drink.”</p>\n<p>Neil takes the bottle in shaking hands and closes his eyes while he sips. Andrew drops the hand on Neil’s neck to his back to rub gentle circles between his shoulder blades.</p>\n<p>“You haven’t made an ass of yourself like this since our first practice,” Andrew says.</p>\n<p>In between gulps of water, Neil gives a wet scoff. “Only because I’m sick.”</p>\n<p>“So he finally admits it.”</p>\n<p>“Fuck off.”</p>\n<p>Andrew hums mildly, more content to indulge Neil’s temper now that he has won. Andrew glances up to catch Mica watching the rhythmic motion of Andrew’s hand on Neil’s back.</p>\n<p>“You can go now,” Andrew says.</p>\n<p>Mica jumps and blushes. “Right! Uh, I’ll just.” He jabs a thumb over his shoulder. “Feel better, Neil.”</p>\n<p>Neil, busy chugging water, lifts a hand in feeble farewell.</p>\n<p>Once they are alone, Andrew smooths the hair back at Neil’s temple and cups his cheek in one hand. “You are a mess.”</p>\n<p>Neil makes a cyclic gesture with his free hand to fill in his part of the call-and-response while he drinks. When he has emptied the bottle and caught his breath, Neil tips his head forward to rest on Andrew’s shoulder. “Is this okay?” he says.</p>\n<p>Andrew shifts to sit down, so that Neil can rest more completely on his chest, practically in Andrew’s lap. “Is <em>this</em> okay?”</p>\n<p>The sweaty, overheated bundle in Andrew’s lap nods and tucks his sweaty, overheated face into Andrew’s neck. At this rate they are both going to have to shower. “Can we stay here for a minute?” Neil says.</p>\n<p>“We’re staying here until you can walk back to the car,” Andrew says.</p>\n<p>“Fair.” Neil settles himself more deeply in Andrew’s arms and sighs.</p>\n<p>Silence falls. Andrew wonders whether Neil has fallen asleep on top of him, until Neil murmurs, “I hate this.”</p>\n<p>Andrew waits for an elaboration.</p>\n<p>“It’s pathetic,” Neil says. “This is nothing. I’ve driven a getaway car after getting shot — <em>twice</em>.”</p>\n<p>From someone else, it would sound like a brag. (God knows Neil has such a number and variety of near-death experiences to his name that he might as well have been collecting them like Boy Scout badges.) But in Neil’s tired voice, it is just a statement of fact. The precedent that Neil’s life has set for him, as to what qualifies as <em>fine</em>.</p>\n<p>“You know the difference between you getting sick and you getting shot?” Andrew says.</p>\n<p>“This isn’t life-threatening?” Neil guesses, which is true — but not a real answer, in Neil’s sarcastic, self-loathing voice, so Andrew pinches his side for it.</p>\n<p>“After you got shot, you didn’t stick your finger in the bullet wound to fuck it up with infection,” Andrew says. “You stitched it up and waited for it to heal.”</p>\n<p>Andrew can feel Neil chewing the inside of his cheek against his shoulder.</p>\n<p>“Refusing to rest when you are ill is irresponsible. Doing things that actively make your condition worse is idiotic,” Andrew continues. “You cannot make your problems go away by ignoring them.”</p>\n<p>“Did Bee tell you that,” Neil says dryly.</p>\n<p>“Yes,” Andrew says, well past his patience for Neil acting like therapy is no better than palm-reading.</p>\n<p>Neil balls his fingers into fists and tucks them under his chin. Andrew sighs and rests his cheek on the top of Neil’s head for the satisfaction of feeling Neil curl tighter against him.</p>\n<p>“Getting sick wasn’t really… an option, when we were running,” Neil says.</p>\n<p>“Getting sick is not a choice,” Andrew says. “And you are not running anymore.”</p>\n<p>“No...” Neil says.</p>\n<p>“But?”</p>\n<p>Neil blows out a breath that tickles Andrew’s neck. “But being able to power through bodily harm is too useful a skill to lose.”</p>\n<p>“Ignoring your health is not a skill,” Andrew says. “It is a coping mechanism that you developed when your only responsibility was outrunning hitmen. You have new responsibilities now.” <em>To the Moriyamas. To the Foxes.</em> <em>To me</em>.</p>\n<p>Neil considers. “Okay,” he says. “I’ll try to be better about the whole.” He makes a vague flapping gesture. “Health. Thing.”</p>\n<p>“So reassuring.”</p>\n<p>“Sorry,” Neil says, with a huff that could be frustration or amusement or both. “I don’t really know what to say. No one else has ever cared this much.”</p>\n<p>“Who said I care.”</p>\n<p>“You cared enough to practice,” Neil says, definitely amused now. “I can’t wait to tell Kevin.”</p>\n<p>“This was not practice,” Andrew says. “This was proving a point.”</p>\n<p>“By practicing.”</p>\n<p>“By kicking your ass until you were literally incapable of argument.”</p>\n<p>“So that you could lecture me about self-care,” Neil says, lifting his head from Andrew’s shoulder to give him a checkmate grin. “Because <em>you</em> care.”</p>\n<p>“You could have gotten the same lecture from Nicky,” Andrew says.</p>\n<p>Neil rolls his eyes. “No, I couldn’t.”</p>\n<p>Andrew arches an eyebrow.</p>\n<p>“Nicky wants to take care of me,” Neil says, nose wrinkled at the thought of Nicky’s particularly claustrophobic brand of affection. “You — make me want to take care of myself.”</p>\n<p>Andrew would rather Neil’s face were still pressed against his neck, so he could process that statement in private. But Neil has only two settings: horribly abstruse and horribly direct. And right now he is staring at Andrew with the unsettlingly open expression that only Neil has ever turned on Andrew. The one that makes Andrew think he might be worth a damn.</p>\n<p><em>Me too</em>, Andrew thinks. <em>Say it.</em> <em>You make me want that, too.</em></p>\n<p>Before he can force the thought into words, Neil says, “Thank you. For caring, even when I’m being a dick about it. I’m still not used to having — ” Andrew inhales “ — friends.”</p>\n<p>Andrew exhales. It is not as direct as “<em>we are not together</em>,” but the privacy of the moment seems to give this statement more weight than the others. Andrew waits for the flash of <em>shock-betrayal-anger</em> he has come to expect after Neil’s casual rejections, but this time it does not arrive. Andrew is just very, very tired.</p>\n<p>He tilts his head back and syncs his breaths to the lazy twirl of a ceiling fan among the rafters above the court. Again, he thinks, this is the moment. Here is your opening. Say it.</p>\n<p>Andrew’s stomach tightens, the way it would every summer afternoon when he was nine, and he climbed to the top of the high dive at the neighborhood pool to force himself to jump.</p>\n<p>Confronting the <em>not nothing</em> between them should not feel like the threat of free-fall. Not after all the intimate, ugly parts they have revealed to one another. Not after Neil has allowed Andrew to trace scars he has never let anyone see, and Andrew has let Neil touch him in places he has never voluntarily felt anyone else’s hands. Not after sharing kisses and the same pillow and a couple life-threatening experiences.</p>\n<p>Saying what is the clearest truth that Andrew has ever known should not be this difficult.</p>\n<p><em>Say it</em>.</p>\n<p>“I would not do this for anyone else,” Andrew says, which is both less and more than he means to give away.</p>\n<p>Neil swallows, wearing what Andrew has come to think of as his “<em>thank you, you were amazing</em>” face. After a moment, Neil puts his hand on Andrew’s shoulder and tilts his head — a nonverbal yes-or-no that is more sign language than body language, at this point.</p>\n<p>Andrew’s yes is a kiss dropped onto Neil’s forehead. “You’re not getting <em>me</em> sick,” Andrew says in response to Neil’s pout. “Consider that your motivation to get better.”</p>\n<p>“I hate you.”</p>\n<p>“That’s my line.”</p>\n<p>Neil shrugs, unrepentant.</p>\n<p>Andrew shifts to relieve some of their weight from his fallen-asleep left buttock. “Where are we, re: you standing up,” he says.</p>\n<p>“I can,” Neil says, nosing at Andrew’s cheek. “Do I have to?”</p>\n<p>“I can’t see why you wouldn’t.”</p>\n<p>“I just want to stay for a few more minutes,” Neil says, tucking his face back under Andrew’s chin. “Is that all right?”</p>\n<p>Andrew tightens his arms around Neil. “For you? Anything,” he says, aiming for sarcastic, but not quite hitting the mark.</p>\n<p> </p>\n<p> </p>\n<p>\n<strong>+1</strong>\n</p>\n<p>Andrew is going to say something.</p>\n<p>As much he loathes the prospect, it cannot possibly be any worse than continuing the tedious dance that he and Neil have been locked in for weeks. Renee was right. Gestures and intimations are not enough. Andrew has to say something.</p>\n<p>The first time he tries, they are sitting on the roof at dusk. Andrew rubs his eyes and looks up from the Russian phrasebook that he is barely able to read by the fading light of the purple sky. Beside him, Neil is absolutely mangling the block of wood from which he is supposed to be chiseling a chess pawn. Beside Neil’s knee is the pawn Andrew carved earlier — example and challenge all in one. Neil’s brow and lips are pinched with the aggressive attention he turns on all his problems, and as Andrew watches him, a strangely warm, buoyant sensation wells up inside his chest.</p>\n<p>Without really meaning to, Andrew says, “Hey.”</p>\n<p>Neil looks up. “Hey,” he says, and for once, Andrew wishes Neil would look at him with anything less than complete, undivided attention, because Andrew has no idea what to say next.</p>\n<p>“<em>Stop telling people we are not together when we obviously are</em>” would be most direct. But Andrew is not going to <em>tell</em> Neil what they are. Whatever Neil says about “<em>it’s always a yes with you</em>,” Andrew stands by “<em>until it’s a no</em>.” Andrew will respect the possibility, however minor, that Neil wants something different.</p>\n<p>Which requires formulating a question. Andrew considers cashing in for a truth. But “<em>What are we?</em>” would be a useless thing to ask, since Andrew already knows that whatever Neil <em>thinks</em> is the correct answer, is too close to platonic. “<em>What do you want us to be?</em>” might work, if Andrew did not half-expect Neil to say something like “<em>whatever you want us to be</em>.”</p>\n<p>Seriously, fuck Andrew’s big mouth for opening before he had a goddamn plan. Now he is left staring at Neil, paralyzed by indecision, while Neil stares back, expectant but not impatient, like he is totally content just to sit here and have Andrew’s attention, which is — distracting. Andrew can’t think like this.</p>\n<p>“Staring,” Andrew mutters, and flicks Neil on the forehead.</p>\n<p>Neil pleasantly bats Andrew’s hand away and returns to his wood block.</p>\n<p>Of course, as soon as Neil looks away, Andrew realizes what he should have said was, “<em>I want to be together, yes or no?</em>”</p>\n<p>So easy, so <em>simple</em>. So manageable.</p>\n<p>But the moment has passed.</p>\n<p>Next time, Andrew thinks. Next time, he will ask.</p>\n<p>There are a lot of next times: Like in the kitchen the following afternoon, while Neil is sitting on the counter with Andrew standing between his legs, and Neil uses his shoulder to scratch an itch on his nose to avoid unhooking his arms from around Andrew’s neck. Or at practice a few days later, when Neil cracks a perfectly aimed ball off the back of Kevin’s helmet to interrupt his lecture about Andrew slacking off.</p>\n<p>“<em>I want to be together, yes or no?</em>”</p>\n<p>Andrew could say it. He has mentally rehearsed it enough times. But none of these moments, when the question has presented itself in Andrew’s mind, has seemed right. The question is important. The circumstances should match.</p>\n<p>Andrew is <em>not</em>, to be clear, asking for circumstances as dire as those surrounding Neil’s “<em>thank you, you were amazing</em>.” But Andrew refuses to raise a question so important over something as banal as Neil requesting Tabasco sauce for Andrew’s mashed potatoes while Andrew is washing his hands in the restaurant bathroom. (Shut up, Nicky, it’s delicious.)</p>\n<p>Realistically, Andrew knows that the actual right moment was after their last match against the Ravens, when Andrew stopped actively arguing against Neil’s insistence that there was something between them. Which means that if Andrew is going to uphold his personal policy of No Regrets, he is going to need a runner-up moment that is almost as good.</p>\n<p>At first, it seems like Andrew might have time to wait for his moment to arrive. July folds into August, and life at Palmetto continues apace. Practices happen. Evenings slide away on the roof with Neil. Non-athletes start to arrive on campus, and Andrew’s books for the new semester start to arrive in the mail. Neil has not hit Andrew with a “<em>we are not together</em>” in weeks and Andrew’s life is all, essentially, fine.</p>\n<p>This grace period abruptly ends one evening over a family dinner — which Andrew has conceded to attending on a weekly basis, because resistance causes Nicky to spend more than a dinner’s worth of time pestering Andrew to come.</p>\n<p>Tonight, Nicky and Aaron are discussing the team’s new wagers on whether Mica will ask Renee to the fall banquet.</p>\n<p>“You’re crazy to bet against him,” Aaron tells Nicky. “You’ve seen his face whenever Wymack sends Renee to work one-on-one with him in goal.”</p>\n<p>“He’s just overjoyed that Wymack isn’t sending Andrew instead,” Nicky says, throwing Andrew a wink. Andrew throws a piece of broccoli at him. “Hey! Manners. Who raised you?”</p>\n<p>“You?” Andrew retorts — and then, because Nicky looks so touched he might cry, quickly says, “You idiots are betting on the wrong thing. Renee is not going to let the baby freshman embarrass himself. The real question is who she will ask to the banquet before he can ask her.”</p>\n<p>Aaron and Nicky consider this. Kevin, as usual, is spending the meal watching Exy on his phone under the table.</p>\n<p>“Allison?” Aaron suggests.</p>\n<p>“You obviously don’t follow Allison on Instagram,” Nicky says. “She’s probably already asked that football player she’s been hanging out with all summer.”</p>\n<p>“Moreau, then,” Aaron says.</p>\n<p>“You obviously don’t follow Jeremy Knox on Instagram,” Nicky says. “Even if he doesn’t take Jean himself, there’s no way he’s letting Jean farther than arm’s length away with the Ravens in the same room.”</p>\n<p>Aaron scratches his jaw. “What other single people do we know?”</p>\n<p>“Maybe someone from her church?” Nicky says.</p>\n<p>“Why doesn’t she just take Andrew?” Neil says.</p>\n<p>Andrew’s brain record-scratches. So does everyone else’s, judging by the way all eyes turn on Neil. Even Kevin glances up from his phone to look at Neil like, “<em>Are you stupid?</em>”</p>\n<p>“Why would she go with Andrew?” Nicky says, slow and confused.</p>\n<p>“Because she always goes with Andrew,” Neil says, equally slow and confused.</p>\n<p>“Uh, yeah,” Nicky says, “until <em>you</em>.”</p>\n<p>Neil frowns. “I only took her last year because Andrew was at Easthaven.”</p>\n<p>“No, I meant,” Nicky says, and Andrew can already see exactly how this exchange is going to play out — the horrible inevitability of it, like an impending car crash. “Andrew’s obviously going to go to the banquet with you.”</p>\n<p>“Why would he go with me?” Neil says.</p>\n<p>“Because you’re his boyfriend?” Nicky says.</p>\n<p>“I’m not his — ”</p>\n<p>“Shut up,” Andrew says. “Everyone shut up.” He forces himself to uncurl his fingers from around his table knife and drops it onto his plate with a clatter. <em>Fuck</em>. He was going to do this on his own terms. He had a <em>plan</em>.</p>\n<p>Well. When has anything in Andrew’s life ever gone according to plan.</p>\n<p>“Everyone get out. Not you,” Andrew adds, planting a hand on Neil’s shoulder to prevent him rising from his chair.</p>\n<p>“Or <em>you</em> could leave,” Aaron says sourly.</p>\n<p>“No, no, we’ll go,” Nicky says, eying the knife inches from Andrew’s hand. He stands up hastily, tugging on Aaron’s sleeve. “Let’s give these two some privacy.”</p>\n<p>“I’m not done eating,” Aaron grouches.</p>\n<p>Nicky steals Aaron’s plate and carries it to the door. “Problem solved. Kevin?”</p>\n<p>Kevin leaves his plate but takes his phone.</p>\n<p>“Drama queens,” Aaron mutters, shoving his chair back loudly and snatching his plate back from Nicky on their way out.</p>\n<p>The door closes.</p>\n<p>There is a silence, during which Andrew attempts to collect his thoughts and Neil watches him guardedly.</p>\n<p>“Are you going to tell me why you’re mad at me?” Neil says after a space.</p>\n<p>“I’m not mad at you,” Andrew snaps, because he isn’t angry at Neil, exactly. He knew to expect this of Neil. Andrew is angry because he had an idea of how this was going to go, and a fight about the fucking fall banquet was not part of the script.</p>\n<p>Neil raises a skeptical eyebrow.</p>\n<p>Andrew unclenches his jaw, unclenches his fists, and turns in his chair to face Neil directly. “I am not going to the fall banquet with Renee,” he bites out.</p>\n<p>“Okay?” Neil says. “No one is making you. It was just an idea.”</p>\n<p>Andrew inhales deeply through his nose. “I am not going to the fall banquet with Renee, because I’m going with you. If you want.”</p>\n<p>Neil’s expression is temporarily frozen in surprise, until the corner of his mouth quirks up, sending an intense swoop through Andrew’s stomach. “Really?” he says.</p>\n<p>“Yes, Neil,” Andrew says, trying for exasperation and finding it difficult, on account of all the swooping. “Yes or no?”</p>\n<p>“Yes, obviously.” For the first time ever, Neil looks pleased at the prospect of an Exy banquet. He reaches for Andrew’s hand with raised eyebrows. Andrew gives it to him. Neil laces their fingers together. “Of course I want to go with you.”</p>\n<p>Andrew cannot think of any response that does not give away far more than he has already, except a terse, “Good.”</p>\n<p>Neil must read something more on Andrew’s face, though, because his smile slants into a smirk and he says, “You should have just said so.”</p>\n<p>It rankles.</p>\n<p>“You should not have assumed I would go with Renee,” Andrew says coolly.</p>\n<p>Neil looks guilty. “Sorry. I just thought since you always go together — ”</p>\n<p>“<em>This</em> clearly changes things,” Andrew says, furiously ignoring the irony of the situation as he waves a finger between their chests.</p>\n<p>Neil’s lips part around a silent “<em>oh</em>,” before he says, “I didn’t realize <em>this</em> factored into it.”</p>\n<p>“You didn’t think the fact that we were dating would factor into whether I go on dates with other people,” Andrew snipes.</p>\n<p>“We’re — ” Neil swallows, gaping at Andrew. “We’re — what?”</p>\n<p>Andrew’s fingers tighten around Neil’s. No. He is <em>asking</em>, not telling.</p>\n<p>He makes himself take a fucking breath and say, “I want us to be together. Yes or no?”</p>\n<p>Neil blinks at him slowly. “You want us to be…”</p>\n<p>“Together. Dating. Boyfriends,” Andrew says, impatient for an answer to relieve the terrible anticipation that has strung his whole body taut. “Yes or no?”</p>\n<p>Neil seems to struggle to make his voice work for another long second, before he gets out an emphatic, “<em>Yes</em> — Andrew, yes,” and his face splits into a wide grin that sets off firecrackers inside Andrew. “Can I kiss you?”</p>\n<p>Andrew nods.</p>\n<p>He expects something hurried, hungry. But Neil’s lips are slow and gentle against Andrew’s, in the rare kind of careful kiss that leaves Andrew feeling — unfurled.</p>\n<p>When Neil draws back, he does not go far. He rests his forehead against Andrew’s, and inhales Andrew’s uneven exhale. Andrew grounds himself with the sensation of Neil’s hair between his fingers, because the strong wind of exhilaration running through his body could just about carry him away.</p>\n<p>“Give me a truth,” Neil murmurs. “What changed?”</p>\n<p>Andrew’s fingers tighten marginally in Neil’s hair. “Changed.”</p>\n<p>Neil pulls back just far enough to look Andrew in the eye. “What changed your mind about wanting to be together,” he explains. “Dating. Boyfriends.”</p>\n<p>Andrew runs his thumb once, twice, three times across the soft skin just behind Neil’s ear. “Nothing.”</p>\n<p>“Nothing,” Neil echoes. “You always wanted — ”</p>\n<p>“Yes.”</p>\n<p>Neil processes this. “What changed your mind about telling me?”</p>\n<p>Andrew has hardly told Neil anything now. He has not told Neil how settling it is to walk into a room and orient himself relative to Neil. How sharing the court with Neil is like standing beside a bonfire after being cold for a very, very long time. How Andrew’s neural circuitry lights up like a pinball machine when he has Neil soft and happy and pliant beneath him, in a way that Neil never is anywhere else.</p>\n<p>How Andrew was so certain for so long that he would eventually crush this thing between them, or it would crush him — but now, he is not so sure.</p>\n<p>How there are so many truer truths for Andrew to give Neil than “<em>dating</em>” or “<em>boyfriends</em>,” but he needs these placeholders to keep Neil here, until Andrew can tell him the other things. How Andrew, against all reason and past precedent, wants to tell Neil the other things.</p>\n<p>“I thought I could make it obvious,” Andrew says, lifting their hands sardonically — because Andrew may be ready to tell Neil the other things someday, but today is not that day. And because this conversation is already so far afield of Andrew’s comfort zone that it seems necessary to bring them back toward familiar territory. “But clearly, I overestimated your ability to put two-and-two together.”</p>\n<p>Andrew expects the fond eye roll that is Neil’s response to most of Andrew’s insults. What he gets instead is Neil pulling his hand out of Andrew’s and sitting back in his chair, arms folded and gaze sharp enough to pare Andrew down to the bone.</p>\n<p>“What made you think that after everything, I would make any assumptions about what you want?” Neil says, and Andrew —</p>\n<p>Andrew has no good response.</p>\n<p>Because on the one hand, Neil makes a fair point. Neil told Andrew in the spring that he would never cross a line without invitation, and he never has. The night they returned from Virginia was a stark reminder of Neil’s stubborn refusal to imagine them as anything more than exactly what Andrew said.</p>\n<p>On the other, Neil’s unrelenting commitment to Andrew’s consent is still so unexpected that Andrew does not know how to plan for it. For weeks, Andrew was operating under the assumption that, given enough circumstantial evidence, Neil would eventually draw his own conclusions about what Andrew wanted, absolving Andrew of any need to confess.</p>\n<p>On some level, Andrew always counted on the idea that, eventually, Neil would reach his limit for waiting for Andrew’s permission for everything. To believe otherwise would be — well. A pipedream.</p>\n<p>Yet here Neil sits, again, waiting for Andrew’s answer.</p>\n<p>“You are impossible,” Andrew marvels — simultaneously settled and unsettled by this further confirmation that none of Andrew’s long-held rules of engagement apply with Neil. Andrew leans forward in his chair and says, “This was never nothing.”</p>\n<p>Neil probably has a right to feel smug — vindicated, even. But his expression remains serious as he says, “Say that again.”</p>\n<p>“You know how I feel about repeating myself,” Andrew says, because saying it even once set off some kind of riot in his stomach.</p>\n<p>“You know how I need things spelled out for me,” Neil says.</p>\n<p>Well, Andrew thinks. Some things bear repeating, for Neil.</p>\n<p>Andrew hooks a hand around the back of Neil’s neck and takes a moment to memorize the solemn intent in Neil’s shocking blue eyes. “This,” he says, “was never nothing.” And underscores the point with a gentle tug to invite Neil to close the space between them.</p>\n<p>Andrew did not anticipate how much better a kiss could be with the sweet, crystalline certainty that Neil wants this just as much, and in the same way that Andrew does — and that Neil knows exactly how much Andrew wants it, too.</p>\n<p>For a long time, Andrew thought of his attachment to Neil as an unstable equilibrium, as inevitably short-lived as a knife’s edge balance. But the way he and Neil come together, Neil’s lips on Andrew’s, Neil’s hair between his fingers, Neil’s warmth so close it could be Andrew’s own — <em>this</em> is starting to feel like the inevitability.</p>\n<p>“So, boyfriend, huh,” Neil says, breathless, when they break apart.</p>\n<p>Andrew drops one last ghost of a kiss on the corner of Neil’s mouth. “Is that a question, or an observation.”</p>\n<p>“Both?” Neil says. “Do you — ” His throat clicks on a swallow. “Do you like it?” The cautious hope in Neil’s voice sinks a sharp hook behind Andrew’s heart and <em>yanks</em>.</p>\n<p>Andrew tests out the word “<em>boyfriend</em>” in his mind and is surprised at how… <em>fine</em> it is. Like Neil laying on Andrew’s chest in bed — holding on, rather than behind held down.</p>\n<p>“It is the truth,” Andrew says. At least, it is the closest a single word can get.</p>\n<p>“And we both know how you feel about truths,” Neil says.</p>\n<p>“Yes,” Andrew agrees, and Neil cracks a smile. Ah, there is some of the self-satisfaction Andrew expected earlier.</p>\n<p>“Boyfriend,” Neil says, and Andrew will never, ever tell Neil how much more he likes the word coming out of Neil’s mouth, or Neil will never shut up about it. “I like it.”</p>\n<p>“Good.”</p>\n<p>“You know, if I start calling you my boyfriend, people are going to know,” Neil says, eyes dancing.</p>\n<p>“That’s the idea.”</p>\n<p>“They’re going to know you <em>care</em>,” Neil says, looking positively smug about it. “About <em>me</em>. More than other people.”</p>\n<p>“I care about very few people,” Andrew says. “That’s not that impressive.”</p>\n<p>“Wow. Romantic.”</p>\n<p>“That’s me.”</p>\n<p>“Should we be? More romantic,” Neil adds, in response to Andrew’s quirked eyebrow. “Like, should we try — going on a date? Or something?”</p>\n<p>“Wow. Romantic.”</p>\n<p>“That’s me,” Neil quips. “Seriously.”</p>\n<p>“Seriously? Do you want to go on a date?”</p>\n<p>“I asked you first.”</p>\n<p>“But it’s my turn to claim a truth,” Andrew says. “Pay up.”</p>\n<p>Neil huffs, but he does not actually look bothered. “I think… I think, yeah, that could be nice,” he says, just this side of shy. “If you want to.”</p>\n<p>“Sure,” Andrew says. “How about a candlelit dinner at your favorite restaurant. Rasika, Saturday at seven?”</p>\n<p>Neil raises his eyebrows. “Wow, you really had that one on the tip of your — Wait.”</p>\n<p>It is deeply satisfying to watch shocked realization bloom across Neil’s face.</p>\n<p>“Did we — ” Neil says.</p>\n<p>“Yes,” Andrew says.</p>\n<p>“But that was like, a month ago,” Neil says, expression caught between wonder and horror.</p>\n<p>“Like I said, your deductive reasoning skills leave a lot to be desired.”</p>\n<p>Neil considers this. Slowly, his smirk returns full-force. “You’ve been trying to convince me that we’re dating for a month.”</p>\n<p>Andrew refuses to answer that, but his silence sort of speaks for itself.</p>\n<p>“You must <em>really</em> like me,” Neil says, delighted in his accusation.</p>\n<p>“Smug is not a good look on you,” Andrew says.</p>\n<p>“You like it,” Neil teases.</p>\n<p>Andrew almost — <em>almost</em> — tells Neil that he hates it. But just for the shock value, he says, “Yes, I do.”</p>\n<p>Neil’s jaw drop is well worth the admission.</p>\n<p>Andrew dons a smirk of his own as he hooks a finger in the collar of Neil’s shirt to pull him closer. “Yes or no?” he says, and at Neil’s nod, Andrew closes the space between them.</p>"
}