{
  "id": "27812527",
  "url": "https://archiveofourown.org/works/27812527?view_full_work=true",
  "author": [
    "metisket"
  ],
  "title": "The One-Body Problem",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen",
    "M/M"
  ],
  "fandoms": [
    "陈情令 | The Untamed (TV)"
  ],
  "relationships": [
    "Lan Jingyi & Wei Ying | Wei Wuxian",
    "Lan Zhan | Lan Wangji/Wei Ying | Wei Wuxian",
    "Lan Jingyi & Lan Yuan | Lan Sizhui"
  ],
  "characters": [
    "Lan Jingyi",
    "Wei Ying | Wei Wuxian",
    "Lan Yuan | Lan Sizhui",
    "Lan Huan | Lan Xichen",
    "Lan Zhan | Lan Wangji",
    "Nie Huaisang",
    "Jin Ling | Jin Rulan",
    "Lan Jingyi's Parents"
  ],
  "additional_tags": [
    "fun times with possession",
    "wei wuxian has done a lot of terrible things but surely he doesn't deserve this",
    "lan xichen is just a ball of stress wrapped in attractive robes",
    "is it more",
    "Possession",
    "or - Freeform",
    "Cohabitation",
    "Jury's still out",
    "in the sense that sizhui is the jury",
    "and he's laughing too hard to decide",
    "warnings for wei wuxian's mental state in general",
    "(he thinks he's fine obviously)"
  ],
  "language": "English",
  "series": "",
  "published": "2020-12-01",
  "completed": "2020-12-09",
  "words": "28,689",
  "chapters": "2/2",
  "comments": "1,661",
  "kudos": "16,317",
  "bookmarks": "7,053",
  "hits": "138,589",
  "summary": "<p>The good news is that Lan Jingyi has found a mentor, friend, and constant companion through the difficulties in life.</p>\n<p>The bad news is that that’s because he’s been accidentally possessed by the Yiling Patriarch.</p>",
  "notes": "<p>Yes, I absolutely gave the chattiest character in this series open access to the secrets of one of the least communicative characters in this series, and I don’t even feel bad about it.</p>\n<p>...It's good for him, anyway.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>1) How long is it going to take Jingyi and Wei Wuxian to get used to the idea that other people can hear them when they talk now? Too long, that’s how long.</p>\n<p>2) NHS’s job just became a lot more complicated in ways he really wasn’t expecting. He’ll make it work, though.</p>\n<p>3) If the state of possession had persisted, eventually LWJ would have figured it out because Jingyi would have used a blatantly Yiling Patriarch-inspired talisman on a night hunt. FORTUNATELY IT DIDN’T COME TO THAT.</p>",
  "text": "<p>Lan Jingyi is prepared to admit that this whole, stupid mess is his own fault. He’s even prepared to admit it repentantly and before a whole gaggle of Lan elders if it means he gets to live until tomorrow.</p>\n<p>He’s not holding out a whole lot of hope for that, though.</p>\n<p>It all started when he was sent to investigate some weird rumors in Yiling. Any of the sects can hunt there, since it’s considered cursed and no one’s official responsibility (and wow, the locals <i>hate </i>that). In practice, though, it’s mostly left up to Gusu Lan and Yunmeng Jiang—the other sects don’t even pretend to care.</p>\n<p>Which means the locals are <i>really nice</i> to cultivators from Gusu Lan and Yunmeng Jiang. They were especially great to Jingyi, and gave him discounts on stuff and extra food with every meal with a kind of intense, panicked look in their eyes. It maybe got to him a little? They were just so nice, and so freaked out, and they treated him like an actual immortal. So even though this was just supposed to be an information gathering trip, he, uh. He did more than that.</p>\n<p>The weird rumors were about suspicious-looking people coming and going from the Burial Mounds. They wore black and red, didn’t seem to carry swords, and were always hauling around big old bags of who knew what. They’d been around for like a month, but they wouldn’t talk to anybody in town, so nobody knew more than that. Basically, Jingyi hadn’t learned much beyond what was in the original letter requesting help. It was disappointing, sure, but if he’d been smart, he’d have taken that information, gone straight back to Gusu, and reported it. The thing was…that would’ve meant he’d come to town, eaten free food, bothered everyone with his questions, and not even learned anything new. He couldn’t handle that. So instead, he went to the Burial Mounds to check things out himself. He did this alone, by himself, without telling anyone. Like a <i>moron</i>.</p>\n<p>The good news is, he’s learned new things. The bad news is, what he’s learned is that the Burial Mounds are full of creepy demonic cultivators who worship the Yiling Patriarch, and are currently planning to sacrifice Jingyi to resurrect him. Or something. Jingyi is a little unclear on the details, mainly because it’s hard to think around the head injury. A head injury he has because a bunch of deranged demonic cultivators got the jump on him without hardly trying. If he lives through this, Sizhui is going to kill him, but not before Hanguang-jun is Disappointed at him. Ugh.</p>\n<p>The creeps have him tied down on top of a blood-stained array and are chanting and throwing talismans at him, and he hates everything about this. He never agreed to be a human sacrifice, and it seems like his opinion should count, here.</p>\n<p>The magic rises, resentful energy getting thicker and thicker until it chokes him. At first he thinks it’s lack of air that’s making him see a red glow, but no—the array is actually glowing. And then, because all of that wasn’t freaky enough, his body starts to feel like it’s <i>burning</i>, like his <i>organs are on fire</i>. Are they going to burn him from the inside out?! Wow, all of his teachers are going to be completely unsurprised that this was the way he died, especially Lan Qiren.</p>\n<p>But just at the point where it was about to become unbearable, the pain abruptly stops. Then, after a long, frozen moment, something slams into Jingyi—not physically, not exactly mentally, but like some other—oh help—<i>soul</i> or something just wedged itself in next to his own. Is this the <i>Yiling Patriarch</i>? Is he <i>sharing a body</i> with the Yiling Patriarch?! Wasn’t he supposed to die? Are these demonic cultivators inept as well as creepy?</p>\n<p><i>Oh, come on</i>, says a tired voice in his head. <i>What the hell is this?</i></p>\n<p>Well, that’s exactly what Jingyi would like to know. He’d just like it better if he wasn’t agreeing with the <i>voice in his head</i> about it.</p>\n<p>The voice in his head that, it has to be said, does not seem very scary, or at all what Jingyi would’ve expected from the Yiling Patriarch. He’d have guessed the Yiling Patriarch would be enraged and resentful and frothing-at-the-mouth psychotic, but this guy seems mostly just…done. Did the creeps snag the wrong ghost on top of everything else?</p>\n<p>The creeps collectively take this moment to prostrate themselves on the ground. The boss one says, “Oh, Great Yiling Patriarch, most Powerful of Demonic Cultivators, Founder of our Demonic Order, we welcome your Glorious Return to the Land of the Living, and hope you will accept our Humble Offering of This Body.”</p>\n<p>Jingyi cannot believe he got human sacrificed by people this ridiculous.</p>\n<p><i>Body?</i> mutters the voice. <i>What body?</i></p>\n<p><i>Oh, I like that</i>, Jingyi thinks loudly back at it, indignant. <i>Just elbow your way in here with me and then don’t even notice I exist. Rude</i>.</p>\n<p><i>Am I</i> possessing <i>somebody?</i> the voice demands, reassuringly horrified.</p>\n<p><i>To be fair, it’s not your fault</i>, Jingyi explains, gracious in the face of the ghost being freaked about it, too. <i>They think you’re the Yiling Patriarch, so they grabbed you and shoved you inside me</i>. He considers. <i>Okay, that sounded dirtier than I meant it to</i>.</p>\n<p><i>…How old are you?</i> the voice asks suspiciously.</p>\n<p><i>Seventeen. Why?<br>\n</i><br>\nOh, wow, yeah. <i>There’s</i> the rage he was expecting from the Yiling Patriarch. (But seriously, <i>is</i> this guy the Yiling Patriarch? Because that’s rage on Jingyi’s behalf, which doesn’t seem very…Yiling Patriarch-y.)</p>\n<p><i>I’m gonna take over for a minute, okay, kid?</i> says the man who may or may not be the evilest cultivator in modern history.</p>\n<p><i>Go for it</i>, says Jingyi, because it’s not like he can stop the guy, or like he makes good choices when he’s in charge of his body, anyway. He may be getting a little fatalistic about things.</p>\n<p>It’s weird, not being in control of his own body. It’s like being submerged in a pool of black jelly, and all he can catch from the outside world are flashes of emotion and the occasional image. Both of which he could frankly do without, because it’s all very disturbing and kinda gross, and he’s more convinced by the second that he really <i>is</i> being possessed by the Yiling Patriarch. Who is apparently surprisingly chill until you piss him off.</p>\n<p>And man, the creeps sure did piss him off. Seems like they wanted him to take over the world with them, bathing in the blood of virgins and whatever? Anyway, he’s not having any. Emphatically.</p>\n<p>Lan Jingyi is starting to suspect that some of the things he’s heard about the Yiling Patriarch were bullshit.</p>\n<p>After an indeterminate, floating period of time, Jingyi is abruptly dragged out of the jelly pool and rudely shoved back into possession of his body.</p>\n<p>“Whoa,” he yelps, almost falling over.</p>\n<p>Almost falling over a corpse, in fact. Because there are corpses. Just. Everywhere. Corpses who died in interestingly varied and definitely upsetting ways.</p>\n<p>On the bright side, Jingyi is no longer tied up in an evil array, and it looks like he’s not going to die today. Also a bright side: none of these creeps will cause anyone problems ever again.</p>\n<p>Downside: the guy still stuck in his head with him is<i> definitely</i> the Yiling Patriarch.</p>\n<p><i>I was such a quiet dead person</i>, Jingyi’s unwilling brain-guest is muttering irritably. <i>I didn’t cause any trouble. I don’t deserve this! Ugh, I was better off dead</i>.</p>\n<p>So…apparently suicidal ghosts are a thing, which is depressing to know. But at least the guy’s not murderously enraged anymore—he’s back to just being tired and done, and, under that, horrifyingly sad and lonely.</p>\n<p><i>Did history class lie to me about you?</i> Jingyi demands.</p>\n<p>The Yiling Patriarch laughs bitterly. <i>Well, everybody lied about me when I was alive. I don’t see why they’d stop after I died</i>.</p>\n<p>This is all very upsetting. <i>What’s being dead like?</i> Jingyi asks, saving his brooding over being lied to in history class for later. Because how many people can you ask about the afterlife? Jingyi can’t waste this opportunity.</p>\n<p><i>I…don’t remember, really</i>, the Yiling Patriarch says, thoughtful, tired, a little worried. <i>I don’t know where I was</i>.</p>\n<p>Okay, so now the Yiling Patriarch sounds like Sizhui does when he’s about to start crying, which means no more talking about the afterlife today. <i>Huh. Weird. Will it hurt you if I get exorcized?</i></p>\n<p><i>Does it matter?</i> asks the freaking Yiling Patriarch, who is turning out to be an emotional mess in a totally different way than Jingyi would’ve expected.</p>\n<p><i>Yes</i>, Jingyi informs him, annoyed. <i>Yes, because you </i>saved my life, <i>so I don’t want to hurt you. You weird man</i>.</p>\n<p>The Yiling Patriarch laughs again, honestly cheering up. <i>I don’t know!</i> he says brightly. <i>I’ve never been exorcized from someone before!</i></p>\n<p>“<i>Wow</i>, I don’t want to have to explain this to Hanguang-jun,” Jingyi mutters, threading his unsteady way through the messy corpses and toward the road out, trying not to think too hard about his current reality.</p>\n<p>…<i>Lan Zhan?</i> asks the ghost, in tones/emotions of obvious sorrow and longing.</p>\n<p>Yeah, history class lied about the Yiling Patriarch a<i> lot</i>.</p>\n<p><i>Hanguang-jun let you call him Lan Zhan?</i> Jingyi asks, trying to hide his feelings about this topic and not sure he’s succeeding.</p>\n<p><i>He did</i>, the ghost says wistfully. <i>And he called me Wei Ying</i>.</p>\n<p>Jingyi immediately hears Hanguang-jun’s voice saying <i>Wei Ying</i> over and over with an unbelievable amount of emotion, everything from infuriated frustration to…love? That’s gotta be love, right? And then there’s a flash, a memory in Jingyi’s mind that doesn’t belong to him—falling backward off a cliff, one arm flung upward, reaching toward…toward Hanguang-jun, who’s screaming, “Wei Ying!” with a more agonized expression than Jingyi could ever have imagined that face was capable of. And that’s Sect Leader Jiang, standing behind Hanguang-jun with a bloody sword and looking weirdly conflicted. So this is <i>then</i>.</p>\n<p>This is Wei Wuxian’s death, and what he remembers most is looking up at that beloved face (Hanguang-jun’s face!), and feeling regret, sorrow, and a painful, despairing resolve. <i>This is the best way, Lan Zhan. The only way.</i></p>\n<p>The memory abruptly cuts off. <i>Well</i>, says Wei Wuxian, <i>I’m going to take a nap</i>.</p>\n<p><i>What—?!<br>\n</i><br>\nBut there’s nothing, a sudden absence in Jingyi’s mind. It feels more weird than it should, given that it’s the state he’d always existed in until an hour ago.</p>\n<p>So, this is great. Jingyi’s being unwillingly possessed by the surprisingly sad and nice (if incredibly dangerous) Yiling Patriarch, who secretly used to be, what? Hanguang-jun’s boyfriend or something?</p>\n<p>Jingyi is never believing a goddamn thing any adult tells him about the war ever again. Depending on how the next few days go, he may not believe anything adults tell him about <i>anything</i> ever again. He can’t wait to complain to Sizhui about this.</p>\n<p>* * *</p>\n<p>Wei Wuxian stays eerily absent for the rest of the day, which is probably just as well, because when Jingyi gets back to town, everybody sees his bloody mess of a self and freaks the hell out, which Wei Wuxian might not handle well. Anyway, Jingyi has to explain himself to what feels like half the town while a doctor doctors him and yells at him for being an idiot. (Jingyi’s parents are doctors, so this is weirdly soothing.) Everybody’s delighted that the demonic cultivators are dead, at least. They’d be less delighted if they knew Jingyi is currently sharing a body with one, but he carefully doesn’t tell them that—he pretends the demonic cultivators blew <i>themselves</i> up.</p>\n<p>They’re definitely not happy about the new bunch of pissed off corpses in the Burial Mounds. Jingyi promises he’ll send somebody fully trained to deal with that, but the townspeople seem dubious. So there’s one more thing to worry about. </p>\n<p>By the time the interrogation ends, Jingyi’s exhausted. He collapses onto the bed at the inn (where he’s staying for free!), and falls near-instantly asleep. And still without a peep from his ghost.</p>\n<p>But then the asshole turns out to be a <i>morning person</i>.</p>\n<p>Jingyi hates morning people. Oh, sure, he can get up at five—that’s just habit. But he can’t be <i>pleased</i> to be awake at five, or, really, within an hour of when he gets up, no matter what time that happens to be.</p>\n<p>Wei Wuxian whines interminably about waking up at five, and is respectably groggy and unhappy for the first five minutes or so, but then he has the nerve to become completely alert and chipper swiftly thereafter. He is especially insufferable about the way everyone in town beams at or frets over Jingyi. He <i>actually coos</i> about how cute it is. The Yiling Patriarch is truly evil.</p>\n<p>* * *</p>\n<p>They experiment with their new, messed up existence once they’re on the road. Turns out they can feel each other’s strong emotions unless they’re actively working on hiding them—and that’s not a long-term fix because it wears out your brain-muscles or something. So, emotions: they’re sharing them now. Great.</p>\n<p>Memories only blip over if they’re deliberately shown off or else really strong, which might be a problem, because it seems like the Yiling Patriarch gets a lot of…out of control memories? Like he gets reminded of one thing, and then a whole awful scene plays out, rumbling along unstoppably like a runaway cart down a steep hill, knocking over important parts of the scenery on the way. So that’s fun.</p>\n<p>As for stray thoughts, they don’t seem to cross over much unless they’re really <i>loud</i> stray thoughts. Imagined up images also don’t transfer well. But they can deliberately talk at each other with no real effort.</p>\n<p>When Jingyi sleeps, so does the Yiling Patriarch, because apparently they really are sharing Jingyi’s brain in some weird way. That freaks the Yiling Patriarch out, but Jingyi’s not unreasonably tired or headachy or anything, so he decides not to be bothered.</p>\n<p>The Yiling Patriarch can also do that “nap” thing, where he blips out totally for a while—though he has to be awake to do it, which seems weird. He says it’s like he’s hiding in a cabinet in Jingyi’s mind. Jingyi didn’t know he had cabinets in his mind. He’s learning all sorts of stuff lately.</p>\n<p>…Theoretically he could shove the Yiling Patriarch into the cabinet himself, but he thinks that thought very quietly, and doesn’t plan to do it ever. So far the Yiling Patriarch’s been a very pleasant brain guest. Unless he loses it and goes on an unprovoked murder rampage, Jingyi has no intention of sending him to brain prison.</p>\n<p>All things considered, it could be much worse. Like, what if the Yiling Patriarch really was the way he’s painted in class? Man, Jingyi’s body would be a puppet and he’d just be floating in jelly forever.</p>\n<p>There are even some advantages! Jingyi gets free history lessons, for one thing. No way is he gonna get possessed by a war hero/post-war villain without taking the opportunity to interrogate the guy about his life in general and the Sunshot Campaign in particular. It’s a lot more fun than actual history class, not least because it’s impossible for the person in your head to lie to you. (Well, he <i>can</i> lie, but Jingyi can always tell when he’s doing it, because they’re sharing emotions. Though the idiot will keep trying despite that, and holy crap, he sure lies to <i>himself</i> a lot.) It turns out that when you can see memories of what actually went on, complete with the thoughts and emotions of somebody who was there, the whole story is a hundred times cooler. And the Sunshot Campaign was pretty damn cool to begin with, so this is awesome.</p>\n<p>Though free history class has its downsides, too. Firstly, the Sunshot Campaign may have been cool, but it was also <i>super</i> fucked-up. Way more than Jingyi understood, mainly because Jingyi has lived a life so soft it never occurred to him how soft it was. He’s seen a lot of human corpses since he started going on night hunts, sure, and he thought that made him tough, but…he’s never made any of his own. He’s never had a living person try to kill him, either.</p>\n<p>Wei Wuxian has killed <i>so</i> many people. So many. And he only feels bad about a handful of them, because the rest were actively trying to kill him at the time, often for no damn reason at all. Jingyi now has lots of uncomfortable, ice-cold memories of looking a person in the eye, deciding the world would be better off without them, and making it so.</p>\n<p>He’s not handling it well.</p>\n<p>Another problem is that the Yiling Patriarch seriously can’t be bothered to remember anything or anyone unimportant to him, which makes his value as a historical source kind of erratic. Wei Wuxian’s memory is an interesting and complicated thing, actually, and worrying in a lot of ways. Like, he remembers music—<i>so much</i> music, and a ton of poetry, too. But he doesn’t remember where he learned it, usually. It’s like the music just appeared in his mind, full of emotion and note-perfect, but without context. He memorizes whole books, but has erased entire sects from his mind. Huge spans of time in his life seem to be just…gone, and it’s freaky. He remembers a ton of scars and injuries his body had, but he can’t remember how he got maybe half of them. That said, he remembers crimes against his loved ones in disturbing detail—perpetrators, dates, locations. His memory for food is troublingly complete, too (Jingyi guesses starving will do that to you). And it goes on like that. Patchy. Veering between scary precise and worryingly vague.</p>\n<p>When it comes to people, Wei Wuxian seems to remember every-damn-body from Lotus Pier, all the way from Sect Leaders past and present to some random guy in town who he used to steal lotus seeds from. He remembers a ton about them, too—their hopes and dreams, kids and home renovations. It’s the same with the Wens he rescued, even though he kind of held himself apart from most of them. But the other sects? Eh. If he remembers the sect at all, he only remembers a handful of people from it. It can be hilarious sometimes, like in the memory where one of the vague, person-shaped yellow blobs indicating Random Jin Cultivator #5 called Jin Zixuan his cousin, and Jingyi realized—that was Jin Zixun. Jin Zixun, who history class called a great enemy of the Yiling Patriarch, a thorn in his side, a nemesis so terrible that the Yiling Patriarch had cursed him to be rid of him—but here’s the truth: the Yiling Patriarch can’t even remember what Jin Zixun fucking looked like, and thought of him as an annoyance on par with a biting insect. He definitely could not have been bothered to curse him. </p>\n<p>Wei Wuxian <i>does</i> remember people he considered legitimately dangerous (like Xue Yang and, troublingly, Jin Guangshan), apparently out of self-preservation. But with Jin Guangshan, it’s almost like his brain resents having to remember the guy? He’s definitely labeled the former Chief Cultivator “Annoying Mustache” in his head. Anytime he thinks of him, it’s as Annoying Mustache (Jin Guangshan). The name’s an afterthought. The facial hair is always the clearest thing in any given memory. (Personally Jingyi thinks the goatee was more annoying than the mustache, but whatever.) Also, he’s determined to believe that Jin Guangshan had a big old potbelly. He didn’t? Jingyi saw the guy once before he died, and he’s almost totally sure there was no potbelly. But that’s how Wei Wuxian remembers him—swaggering into rooms, belly first.</p>\n<p>Bottom line, Jingyi suddenly has access to a ton of reasonably accurate and intermittently detailed war stories, which is very cool, if deeply upsetting. Unfortunately, everything he’s learned means that he officially no longer trusts adults. Any adults.</p>\n<p>…Except Hanguang-jun, who’s always been angrily silent on the whole topic of the Yiling Patriarch, and who also, looking back on it, definitely taught his students to be skeptical of every single thing they’re told. To ask for the reasons behind every rule. To get second opinions on everything. And wow, Jingyi can <i>see why</i>.</p>\n<p><i>So they were seriously just kids and farmers and old people? </i>Jingyi demands, horrified. <i>Who the Jins were slowly murdering?</i></p>\n<p><i>You got it, kiddo</i>, Wei Wuxian agrees, remembering up an image of the settlement in the Burial Mounds—weirdly cheerful, considering where it is and what it looked like when Jingyi last saw it. He’d have paid more attention if he’d known.</p>\n<p>But yeah, it’s mostly grannies and grandpas, old aunts and uncles, and at least one <i>little kid</i>. Very obviously civilians. Not what you’d call an army. This is so messed up.</p>\n<p><i>Who’s the kid?</i> he asks, mostly to distract himself from the sense of generalized horror and betrayal.</p>\n<p><i>A-Yuan?</i> Wei Wuxian replies with brittle cheerfulness, then remembers up a series of stupidly cute scenes with this kid, including one of him sitting in Hanguang-jun’s lap (? ???) in an inn or something. And again—not looking much like the bitter enemies they were made out to be, Jingyi thinks angrily, feeling Memory Wei Wuxian’s helpless fondness for the man holding the child he thinks of as his own. And that’s not even talking about Hanguang-jun’s expression, which is the softest thing Jingyi’s ever seen. Who knew Hanguang-jun’s face could even <i>do</i> that?</p>\n<p>…Okay, actually he sometimes looks at Sizhui like that, but Sizhui is the <i>only one</i>.</p>\n<p>And then the kid in the memory turns to Wei Wuxian and momentarily stops grinning, momentarily looks grave and serious, holding up his toy butterfly for inspection. And that’s. That <i>is</i> Sizhui. Oh hell, that is <i>definitely baby Sizhui</i>. What the <i>fuck</i>. He looks just like he did when they were first put into classes together. It took him years to really smile, and even more to laugh—which is why Jingyi didn’t recognize him smiling. At the time, he never thought about why a kid wouldn’t smile—he was just a kid himself. But yeah, your whole family getting slaughtered would do it.</p>\n<p>Lan Sizhui. Lan <i>Yuan</i>, Hanguang-jun’s <i>adopted son</i>, what the shit has Jingyi tripped over now?!</p>\n<p><i>If he’d lived, he’d be about your age</i>, says the Yiling Patriarch quietly, a well of rage and grief opening like an abyss beneath the words.</p>\n<p>And Jingyi can’t do this. He can’t let the guy suffer like this, even if he <i>is</i> the Yiling Patriarch. But he can’t rat out Sizhui either; what kind of friend would do that? He doesn’t even know what Sizhui remembers, if anything. And if he did remember, would he want the <i>Yiling Patriarch</i> to know? Probably not. Or. Maybe not? Admittedly, that’s becoming less clear by the second. But the point is, it’s not Jingyi’s place to decide. So.</p>\n<p><i>I know him</i>, he says instead, remembering an image of Sizhui in class when they were kids, looking attentive and serious and super-cute, in tiny Lan robes with a Lan headband. <i>Hanguang-jun adopted him, but I didn’t know where he came from. No one does, and no one asks—there were plenty of orphans to go around back then, you know? So he’s just Hanguang-jun’s adopted son, one of the most talented junior disciples. He’s happy in the Cloud Recesses—happier than I am, even. Everybody likes him</i>.</p>\n<p>And that makes Wei Wuxian so shocked and relieved, thrilled and <i>grateful</i> that Jingyi kind of wants to cry.</p>\n<p><i>Lan Zhan</i>, Wei Wuxian thinks with careful reverence. <i>Lan Zhan, you saved A-Yuan</i>.</p>\n<p>A flash of an image—Hanguang-jun standing in the middle of a crowd with Sizhui clinging to his leg and staring up at him, crying, while Hanguang-jun looks hilariously, unbelievably terrified and at a loss. And Wei Wuxian, watching them, feeling so much amusement and affection and desperate, hopeless love.</p>\n<p>Jingyi, meanwhile, feels like a creep, even though he didn’t ask to eavesdrop on this and there’s nothing he can do about it. But these emotions are distinctly <i>not for him</i>, and he <i>does not</i> want to know.</p>\n<p>Also, hey. <i>So</i> many lies about the Sunshot Campaign and the Yiling Patriarch. The whole story of the main players is nothing but a tapestry of lies! What else is a lie? If the villains were secretly nice, were the heroes secretly evil? Are there secret identities involved? This is exactly like the kind of play Jingyi finds annoying, and he’s so done with it. But it’s reality, so it’s not done with him.</p>\n<p>* * *</p>\n<p>Horrible revelations aside, Jingyi would actually call the possessed trip back to Gusu pretty fun if not for one thing: the nightmares. Because Wei Wuxian has a <i>lot</i> of nightmares, many of them recurring, like his mind wants to make extra sure he’ll be tortured enough. And he shares those nightmares.</p>\n<p>The poor guy does his best to keep bad stuff to himself when they’re awake—Jingyi usually only gets an accidental memory here and there related to something he asked. But when they’re asleep? Ugh. It seems really unfair that ghosts get nightmares. Worse yet, a whole lot of Wei Wuxian’s nightmares are just mashups of his worst memories, which Jingyi knows because they can’t block anything from each other when they first wake up. Which they do, like. Every couple of hours on the bad nights.</p>\n<p>After a week of this, they’re both so tired they’re barely functioning, and everything is funny in a weird, morbid way. For example: Jingyi is finding the fact that he’s on the verge of a breakdown over <i>somebody else’s</i> awful life pretty hilarious. He hasn’t cried this much since he was a <i>baby</i>. But he is a baby when it comes to this level of trauma. Trauma baby.</p>\n<p>Yeah, that didn’t even make sense.</p>\n<p><i>Is this what being drunk is like?</i> Jingyi asks, dazed.</p>\n<p><i>Yes</i>, Wei Wuxian agrees. <i>Gods, I wish I could get drunk</i>.</p>\n<p><i>I thought you said we’re basically drunk anyway</i>, Jingyi points out.</p>\n<p><i>This is not the time to make me logically defend my arguments, kid</i>, Wei Wuxian mutters.</p>\n<p><i>What’s your least favorite one?</i> Jingyi wants to know.</p>\n<p>\n<i>Least favorite what?</i>\n</p>\n<p><i>Nightmare.<br>\n</i><br>\n<i>Wow, you seriously just asked me that</i>, Wei Wuxian laughs.</p>\n<p><i>I’m not thinking straight, also your nightmares are my nightmares right now</i>, Jingyi complains. <i>My least favorite one is the one where you get dropped in the Burial Mounds, but instead of eating the corpses, the corpses eat you. I hate that one so much</i>.</p>\n<p>(Actually, that’s his second least favorite, but he has just enough brain left to keep from admitting to his actual least favorite. Which is the one where Wei Wuxian rips out his golden core with his own hands and feeds it to his brother, only for his brother to choke and cough blood and die, like Wei Wuxian’s core was poison. That one’s <i>great</i>.)</p>\n<p>Wei Wuxian goes silent for a long time, and then Jingyi gets a memory—of the nightmare where he’s torturing Wen Chao to death, but then Wen Chao throws back his hood and it’s been Jiang Yanli the whole time. Jingyi is such an asshole for bringing this up.</p>\n<p><i>Oh man, you’re right</i>, he says, because what else can he say at this point. <i>That one fucking sucks</i>.</p>\n<p>Wei Wuxian laughs a little hysterically.</p>\n<p>Honestly, by now Jingyi’s feeling like the whole Yiling Patriarch meltdown was a model of restraint. It would’ve been even if all the stories had been true, which they’re not. But if all that shit had happened to Jingyi? Hell yeah, he’d have run to the Burial Mounds and raised a zombie army.</p>\n<p>Which is, again, a thing that Wei Wuxian only sort of kind of did. Mostly he ran to the Burial Mounds and made a freaking farm. And they killed him for it anyway.</p>\n<p>Jingyi would really like to have a good scream about how unfair it all is with Hanguang-jun, who he feels would totally get him on this, but he can’t do that without explaining himself. And he can’t explain himself, because that would be cruel to Hanguang-jun. Being possessed is the worst. Wait, no—<i>war</i> is the worst, and apparently people are the worst. Being possessed is just annoying. Thanks for the perspective, Wei Wuxian.</p>\n<p>Jingyi is coming to appreciate his parents more every day. He’s so glad they’re doctors who stayed the fuck away from the fighting pretty much the whole Sunshot Campaign, and thus remained, like. Alive and mentally stable. When he was a kid, he used to think it was boring that they didn’t have any good war stories, but now that he’s sharing headspace with the guy who has <i>all</i> the best war stories…</p>\n<p>Yeah, he was a very dumb kid. He gets that now. He was wrong; his parents were right. He’ll have to tell them so. Without in any way explaining how he knows, because they would <i>freak</i>.</p>\n<p>…Well, his mom would probably laugh, actually, once she figured out that the Yiling Patriarch isn’t so bad. But his dad would <i>definitely</i> freak.</p>\n<p>He hopes he makes it to the Cloud Recesses before he has some kind of Yiling Patriarch-induced qi deviation. That would be stupid.</p>\n<p>* * *</p>\n<p>It’s a close-run thing, but they do make it back to the Cloud Recesses before either of them is irrevocably physically or psychologically harmed. Probably.</p>\n<p>And Jingyi’s luck blessedly takes this time to kick in and work for him, because the first person he sees after he drops off his stuff and cleans up, but before he goes to make his report, is Sizhui.</p>\n<p>“Sizhui,” Jingyi gasps, grabbing Sizhui’s forearms with overwhelming relief. Sizhui is a sane, reasonable person. He’ll know what to do with someone who’s been accidentally possessed by the ghost of a friendly but damaged mass-murderer.</p>\n<p>“Jingyi?” Sizhui asks, clutching back and looking startled and concerned. “Are you okay?”</p>\n<p>“No, I’m an idiot,” Jingyi explains. He’s proud he hasn’t burst into tears yet. “Also everyone’s lied to us about the Sunshot Campaign our whole lives. Also I’m a little bit possessed right now.”</p>\n<p>Sizhui blinks slowly. “Possessed by someone from the Sunshot Campaign?”</p>\n<p><i>Wow, I like this kid</i>, Wei Wuxian decides, feeling pleased and affectionate, and <i>of course he does</i>, because this is his son. Not that he recognizes that. It’s nice to know, though—that Wei Wuxian would like Sizhui even if he weren’t his son. Between that and his tragic adoration of Hanguang-jun, Jingyi is going to have to admit that the Yiling Patriarch has great taste in people.</p>\n<p>Jingyi takes a deep breath, because there’s no way to make this sound good. “It’s…okay, first, it’s not his fault. Possessing isn’t even the right word—he didn’t sign up to be in here any more than I signed up to be possessed. It was some creeps. Nobody asked the creeps to be creepy, but they just creeped along, doing their creepy thing anyway.”</p>\n<p><i>You’re a mess, kid</i>, points out the annoyingly fond murderer in his head. The <i>enormous mess</i> of a murderer in his head. What nerve.</p>\n<p>“So you like the ghost possessing you,” Sizhui says encouragingly.</p>\n<p>“I really do,” Jingyi admits, trying not to worry about the burst of bewildered disbelief from the back of his mind. “But the thing is…the thing is…he’s. KindoftheYilingPatriarch.” <i>And also your</i> dad, Jingyi wails to himself in a carefully private corner of his mind.</p>\n<p>Sizhui’s eyebrows climb and his mouth drops open. And that’s without hearing about the dad thing.</p>\n<p>“I know!” Jingyi cries. “I know it sounds bad! But he’s really…I mean, he’s seriously scary, that part is true. At least, he is when you make him mad. Like, he murdered the crap out of all the creeps who did this to us. But that was to protect me? And oh my god, Sizhui, I can feel a lot of his emotions, and he is totally in love with Hanguang-jun. It’s so weird.”</p>\n<p><i>I am not in love with Lan Zhan!</i> cries Wei Wuxian, shocked. And again with the lying to himself. Unbelievable.</p>\n<p><i>Uh, yes you are, you absolute dumbass</i>, replies Jingyi, equally shocked. <i>You are</i> so <i>in love with him. You trust him more than you trust yourself! You were so happy he was the last thing you saw when you died! You once saw the back of his neck when you were teenagers and thought about biting it for the next week!<br>\n</i><br>\n<i>How do you know that?!<br>\n</i><br>\n<i>Your memories bleed over when you’re really into them, I told you!</i> Jingyi snaps impatiently. <i>Anyway, shut up and accept it: you’re over the moon for him. I can’t believe you</i>.</p>\n<p>“Are you…talking to him?” Sizhui asks cautiously, still holding tight to Jingyi’s arms like he’s afraid Jingyi might disappear if he lets go.</p>\n<p>“He’s trying to tell me he isn’t in love with Hanguang-jun, but that’s because he’s dumb. He’s <i>so</i> in love. He’s more in love than I knew people could even be.”</p>\n<p><i>I am not</i>, Wei Wuxian mutters sullenly. Jingyi ignores him with all his heart.</p>\n<p>“I don’t know what to <i>do</i>, Sizhui!” he wails. “I swear this is history’s most awkward possession!”</p>\n<p>“We have to tell Hanguang-jun,” Sizhui decides, clearly stressed.</p>\n<p>“Tell him what?” Jingyi hisses. “That his dead boyfriend is sharing my body and I want to exorcize him? I can’t do that to him!”</p>\n<p><i>I’m not his boyfriend!</i> insists Jingyi’s resident idiot.</p>\n<p><i>You are the most emotionally unaware person I’ve ever met, and I grew up with</i> Lans!</p>\n<p><i>Oh, ouch, that was just cruel. Also you’ve clearly never met Jiang Cheng</i>.</p>\n<p>In fact, Jingyi <i>has</i> met Sect Leader Jiang, and he can see Wei Wuxian’s point. But he’s not admitting it. Also Wei Wuxian should definitely feel less fond of the guy who sort of killed him. What a weirdo.</p>\n<p>“You’re right,” Sizhui agrees fretfully, though it takes Jingyi a second to remember what he’s agreeing with. “…Zewu-jun?”</p>\n<p>“Hm.” <i>How do you feel about Zewu-jun?</i> he asks Wei Wuxian.</p>\n<p><i>Uh, I don’t know. He’s like Lan Zhan but smilier and less amazing?<br>\n</i><br>\nWow, yes, definitely sounds like somebody who isn’t in love. The Yiling Patriarch is a moron.</p>\n<p>“He seems okay with that,” Jingyi tells Sizhui, who looks relieved that they can involve an adult.</p>\n<p>“He’s in the library,” Sizhui says, because he almost always knows where his father and uncle are. But then he would, wouldn’t he? After all, whether he consciously remembers it or not, his pre-Cloud Recesses life involved him losing track of family members and those family members getting horribly murdered, over and over.</p>\n<p>For once Jingyi could do with understanding his best friend a little less well.</p>\n<p>* * *</p>\n<p>“Wei Wuxian is <i>possessing</i> you?” Zewu-jun demands, eyebrows climbing.</p>\n<p>“Yes. But I mean—he didn’t <i>mean</i> to,” Jingyi insists, already disappointed that this isn’t going smoother. “It was some creeps in the Burial Mounds. And I know I shouldn’t have been in the Burial Mounds—I wrote a report and everything—and I’ll accept punishment for that, but. Can I. Get exorcized first? Also please don’t tell Hanguang-jun about this.”</p>\n<p>“Why should I not tell Wangji?” Zewu-jun asks suspiciously. Jingyi’s never had Zewu-jun being suspicious of him before, but apparently that’s what happens when you get possessed by an infamous demonic cultivator.</p>\n<p>“Because…because, okay, the Yiling Patriarch is so, so in love with Hanguang-jun—”</p>\n<p><i>Ugh, I can’t believe you’re babbling this nonsense to</i> Zewu-jun, <i>you’re so embarrassing</i>—</p>\n<p>“And I don’t know if it goes both ways? But if it does, isn’t it just…cruel? To tell him that I’ve got the Yiling Patriarch in my head, but he can’t, I can’t, I mean. He’s still dead, Zewu-jun! It’s too sad.”</p>\n<p>Zewu-jun looks shocked. “In love with Wangji?”</p>\n<p><i>No</i>, snaps Wei Wuxian.</p>\n<p>“<i>Yes</i>,” insists Jingyi. “He says he’s not, but I can feel his emotions, the big idiot, and he definitely is. And he’s so <i>sad</i>, Zewu-jun! He misses so many people all the time, and he can’t talk to any of them because most of them are dead, the ones who aren’t basically all hate him, and also he’s a ghost stuck in my head. I’m too young for this much sadness! And don’t get me started on the nightmares, because I’m starting to have nightmares about his nightmares! I haven’t slept more than two hours in a row for three days!”</p>\n<p>Sizhui puts a comforting hand on Jingyi’s shoulder because he’s the best, and Wei Wuxian says, <i>I’m sorry, kid. I’d block it from you if I could</i>.</p>\n<p><i>I know you would</i>, Jingyi thinks back, and tries not to worry about how weird it is that he really believes that. <i>It’s not your fault, and anyway, I’m only getting the echoes of it. Don’t feel bad about me, too. That would be ridiculous</i>.</p>\n<p>Wei Wuxian seems dubious, which is typical.</p>\n<p>When Jingyi starts paying attention to things outside his head again, he notices that Zewu-jun looks seriously troubled and kinda guilty. What’s that about?</p>\n<p>“What happened to the people who captured you in the Burial Mounds?” Zewu-jun asks, holding on to professionalism and not getting sidetracked into a discussion of his little brother’s tragic love life. This must be why people say he’s so wise.</p>\n<p>“Uhh…” Okay, this is gonna sound incriminating. “They’re…not around anymore.”</p>\n<p>Zewu-jun sighs deeply. “Wei Wuxian took over your body and killed them, then.”</p>\n<p>“You don’t have to say it like <i>that</i>,” Jingyi insists. “He was saving my life! And he asked permission before he took over my body! To save my life!”</p>\n<p>“Is he ordering you to say that?” Zewu-jun asks, still with the suspicion.</p>\n<p>“He’s been begging me not to say a single thing I’ve said so far, actually.” Jingyi hesitates. “Well, that was true at first. Now he’s just kind of crying from embarrassment in the back of my head.”</p>\n<p>Zewu-jun’s mouth does a weird thing like he doesn’t know whether to laugh or scream.</p>\n<p>“Anyway, he’s a giant mess who can’t admit to his own emotions and has all the self-esteem of seaweed,” Jingyi explains, ignoring Sizhui’s judgmental sigh. “They sure don’t teach you <i>that</i> about the Yiling Patriarch.”</p>\n<p><i>Hey, seaweed might have great self-esteem. You don’t know</i>.</p>\n<p>Jingyi wonders if you can perform an exorcism on yourself by banging your head against a wall for a while.</p>\n<p>“If you wouldn’t mind, Jingyi,” Zewu-jun says cautiously, “I would like to speak with him directly. Only if this would not trouble you.”</p>\n<p>It wouldn’t. It would, on the other hand, trouble Wei Wuxian, who is freaking the hell out at the very idea. “He doesn’t want to talk to you. He’s scared of you.”</p>\n<p>Wei Wuxian shrieks in mortification, but he doesn’t get to have an opinion. Jingyi’s seen the highlight scenes from the man’s life now, and half of his problems would never have happened if he’d told the truth about anything, ever, to anyone. So they’re doing this Jingyi’s way.</p>\n<p>Zewu-jun has a very impressive arched eyebrow of doom. Who knew? “Wei-gongzi has never been afraid of me. And even if he were, I would never harm him while he’s in your body.”</p>\n<p>“Oh, he’s not scared of you physically, or psychically, or whatever he’s got going on right now. He’s scared of you emotionally. He thinks you’re going to yell at him about how he’s a monster and a heretic and a bad influence on Hanguang-jun. He thinks you hate him, and that makes him want to die. Mostly because he agrees with you.” Jingyi considers the horrified babbling in the back of his mind. “He wants me to tell you that he wants to die right now, but it’s because children are the worst.”</p>\n<p>Jingyi’s always been proud of being the worst child, actually. Not that it’s a particular challenge with the Gusu Lan. Only Sizhui is even close to his level, and he doesn’t count because he never, ever gets caught. Do you really deserve the title of bad child if all the adults still believe you’re an angel? Jingyi thinks not.</p>\n<p>“I think he’s forgotten he’s already dead,” Jingyi observes to the room in general, determined to maintain his title. “Anyway, maybe you can talk to him later. When he’s freaking out less.”</p>\n<p>And maybe Jingyi should tone it down a little, because Sizhui is starting to look horrified. But he can’t help it. He’s punchy.</p>\n<p>“…I only wanted to ask if he recognized the ritual that caused him to possess you,” Zewu-jun says carefully, rolling with the madness like the badass he is.</p>\n<p>Jingyi shrugs and asks. “He says no,” he relays. “He says it’s too creepy for his blood and he doesn’t know where they got it. He did check it over to see if he could figure out how to undo it, but it was all pretty weird to him. He’s thinking it’s got a Wen Ruohan flavor, but he’d need more time to study it to be sure.”</p>\n<p>Zewu-jun frowns, puzzled. “I would have thought this sort of cultivation was precisely his area of interest.”</p>\n<p>Wow, that was a surprisingly unsubtle burn from Zewu-jun. Jingyi rolls his eyes in exasperation, mentally agreeing with his brain guest’s indignant protests. “Look, he never got up to unwilling human sacrifice.” Though, okay, he may have looked into <i>willing</i> human sacrifice a little. Of course, ‘willing human sacrifice’ is just another way to describe Wei Wuxian’s entire life, so no one should be surprised. “He only tried demonic cultivation in the first place because there was a war on, he got dumped in the Burial Mounds by jerk-off Wens, and he didn’t have a golden core. It wasn’t because he <i>loved evil</i>.”</p>\n<p>You could hear a pin drop in the room.</p>\n<p><i>Wow, I hate you so much</i>, says Wei Wuxian, almost wondering.</p>\n<p>“He <i>what</i>?” demands Zewu-jun, actually raising his actual voice. For once!</p>\n<p>“Which part?” Jingyi asks, baffled.</p>\n<p>“He didn’t have a golden core?!”</p>\n<p>Oh shit. Jingyi figured that was just one more of those Yiling Patriarch lies, not that it was honestly something nobody knew. This is the problem with random-memory history lessons—they’re very incomplete. Also, holy crap, Jingyi was so much more right than he knew about Wei Wuxian causing himself problems by never telling the truth.</p>\n<p><i>Did you seriously not tell </i>anybody<i> you didn’t have a golden core?</i> Jingyi demands. <i>How was </i>that<i> a good idea? They must’ve thought you were being shady for fun! How can you be so much smarter than me and so much dumber than me at the same time?!<br>\n</i><br>\n<i>I couldn’t tell Jiang Cheng—he’d never forgive himself</i>—</p>\n<p>Okay, that part Jingyi knew about, and while he may have a brand new sympathy and understanding for Hanguang-jun’s implacable hatred of Sect Leader Jiang, he gets it in theory. If he’d ever hacked out part of his soul and given it to Sizhui, he definitely wouldn’t want Sizhui to know about it, because that’s enough to fuck a person up for life. Which is just one of the many reasons Jingyi would <i>never do that</i>. But okay.</p>\n<p><i>I get that</i>, he agrees reluctantly. <i>But there was a guy running around crushing people’s cores all over the place. You could’ve just lied and said he did it. Why didn’t you?<br>\n</i><br>\n<i>They wouldn’t have let me fight</i>.</p>\n<p>Oh…yeah, that’s true. They totally wouldn’t have. <i>Okay. Why didn’t you tell anybody </i>after<i> the war, then?</i></p>\n<p>There’s a long silence, and then the breath of a sad whisper, <i>My sister would’ve been upset</i>.</p>\n<p>The Yiling Patriarch, everyone. Dumb as a kitten who won’t come in out of the rain.</p>\n<p><i>I heard that</i>, Wei Wuxian complains, wounded.</p>\n<p>Jingyi rolls his eyes and faces Sizhui and Zewu-jun, who are clearly horrified. “Yeah, he lost his golden core. He didn’t tell anybody about it because he figured nobody’d let him fight if they knew, and he’s probably right. But then <i>after</i> the war he didn’t tell anybody because—get this—he <i>didn’t want to upset his sister</i>.”</p>\n<p>Zewu-jun gives a long sigh and lets his head fall forward like all his neck muscles just gave out. Jingyi understands him completely. Sizhui, meanwhile, seems appalled to learn that this much stupidity exists in the universe. And he doesn’t even know it’s his dad who’s this stupid. That might actually break him.</p>\n<p>“He didn’t consider that his sister might be upset that he was practicing demonic cultivation? And refusing to tell her why?” Sizhui asks hesitantly, like he doesn’t want to believe this could possibly be true.</p>\n<p>“Okay, here’s the thing,” Jingyi says a little louder than usual, pointlessly raising his voice to talk over Wei Wuxian’s feeble attempts at self-defense. (He’s yammering something about politics now, but come on, that was obviously an afterthought to all the <i>stupid</i>.) “I meant it about the self-esteem of seaweed. He really, honestly thinks he’s trash, and that almost anybody’s life is worth more than his.” That silences Wei Wuxian. Ugh, Jingyi hopes he’s not causing disharmony in his own brain right now. “So…I mean, he’s not actually an idiot. He’s a genius. He <i>knows</i> people worry about him, but he doesn’t…get it? At all? Like he doesn’t get how it can even be possible. So he makes stupid decisions because he’s trying not to hurt anybody, but he can’t wrap his head around the idea that the best way to do that is to not hurt himself.” Jingyi blames the parents. All four of them. (Because what kind of rogue cultivator doesn’t make plans for a night hunt going wrong? Doesn’t leave their kid with anyone to contact if they don’t come back? Night hunts go wrong <i>all the time</i>. Unimpressed, biological parents.)</p>\n<p>Wei Wuxian seems more offended and confused than hurt or angry, so that’s a relief.</p>\n<p>Meanwhile, Sizhui looks deeply sad, and Zewu-jun’s got that guilty face going on again. What does <i>he</i> think he did to Wei Wuxian? Because Wei Wuxian feels pretty good about him. (Not that that means much. Wei Wuxian isn’t even mad at Sect Leader Jiang.) It’s true that Jingyi’s living in a disturbing new reality where he’s suspicious of adults in general, but he’s respected Zewu-jun all his life. He really hopes Zewu-jun isn’t about to fuck that up for him.</p>\n<p>“Lan Jingyi,” Zewu-jun says softly and politely. “Please allow me to speak with Wei-gongzi. I will not accuse him of anything. Given the circumstances, I can hardly condemn him for his use of demonic cultivation.”</p>\n<p><i>Bullshit</i>, says Wei Wuxian, incredulous.</p>\n<p>Jingyi pictures him saying that to Zewu-jun’s face, and tries not to laugh. “Okay. If he’s okay with it. I mean…I don’t think I can wrestle him out if he doesn’t want to go.”</p>\n<p><i>I’ll go</i>, Wei Wuxian mutters unhappily. <i>Lans. So stubborn</i>.</p>\n<p>And then Jingyi’s floating in jelly again. Which is fine at first, but gets very boring very quickly. Is this what Wei Wuxian does all day? Just…jelly-floats? But he always seems to know what Jingyi’s up to. How is that fair? Jingyi isn’t being allowed to eavesdrop at all!</p>\n<p>Though he can at least follow what Wei Wuxian’s feeling, which is a whole lot of shock, guilt, painful sympathy, and wistfulness, so like. They’re definitely talking about Hanguang-jun out there. Come to think of it, Jingyi’s probably happier not knowing the details. He knows too much about that particular tragic love story as it is.</p>\n<p>When he finally gets rudely shoved back in charge of his body, he notices that Zewu-jun looks grim and sad, but not angry. And Wei Wuxian is feeling many things, but he’s not actively upset. They had a good talk, then?</p>\n<p>Jingyi will never know, because Wei Wuxian only shares fun stuff and horrifying flashbacks, and it looks like Sizhui got kicked out at some point for privacy. But…yeah, he’s okay with that. Sad love stories are sad.</p>\n<p><i>You good?</i> Jingyi asks while Zewu-jun goes out to call Sizhui back in.</p>\n<p><i>I’m fine</i>, Wei Wuxian says lightly, and he even seems to believe it. Which makes Jingyi wonder how exactly the idiot defines “fine,” because he feels like he’s about to cry.</p>\n<p><i>You’re wrong, but nice try</i>, Jingyi informs him, figuring this is as good an opportunity as any for this grown-ass ghost to start learning what emotions are.</p>\n<p>“Wei-gongzi has agreed to an exorcism,” Zewu-jun explains when he comes back with Sizhui.</p>\n<p><i>They’re kicking you out already?</i> Jingyi asks, weirdly sad about it.</p>\n<p><i>What, you got attached to me that quickly?</i> Wei Wuxian asks, laughing like he can’t believe it.</p>\n<p><i>Maybe! What’s wrong with that?!<br>\n</i><br>\nWei Wuxian laughs harder because he’s a jerk. He’s a jerk, and Jingyi is going to miss him anyway. Jingyi is going to miss <i>being possessed</i>, this is ridiculous.</p>\n<p>Zewu-jun explains the exorcism plan to everybody. It seems like a good plan. Since Wei Wuxian isn’t remotely hostile and doesn’t even seem to know <i>how</i> to feel excessive attachment, it’s a gentle exorcism, meant to do the possessing spirit no harm. It should be easy on Jingyi, too, which is nice. He doesn’t love being put in the middle of an array again so soon, though. The last time turned out…badly.</p>\n<p>He tries to distract himself by hoping that maybe Wei Wuxian will hang around and haunt them for a while, afterward. That’d be fun. Seriously unlikely (again, lack of excessive attachment), but fun.</p>\n<p>Except the exorcism doesn’t work. It very much, absolutely does not work. In fact, if Jingyi had to guess, he would say this is probably what it would feel like if someone reached into your chest with spectral fingers and tried to yank your still-beating heart out through your ribcage.</p>\n<p>The good news is, he passes out from the agony pretty quickly.</p>\n<p>* * *</p>\n<p>When Jingyi comes to, he’s in his own room and his own bed, and better-rested than he has been for a week. He actually lets himself believe, for a second, that the whole Yiling Patriarch thing was just a weird extended nightmare. That he feels sort of spiritually flayed because of a night hunt gone wrong or something.</p>\n<p><i>Let’s never do that again</i>, says the Yiling Patriarch haunting his brain, sounding as fragile as Jingyi feels.</p>\n<p>Oh, well. It was a fun delusion while it lasted.</p>\n<p><i>What the fuck happened?</i> Jingyi demands.</p>\n<p><i>I think…I should have worried more about the technical details of that ritual sacrifice</i>, Wei Wuxian concedes.</p>\n<p><i>How did it feel for you?</i> Jingyi asks. <i>Because for me it felt like my soul was getting ripped out.<br>\n</i><br>\n<i>Well, it seems like I’m somehow tied to your golden core, so…that’s pretty much what was happening! We’re lucky Zewu-jun pays attention</i>.</p>\n<p>Because if he hadn’t paid attention, he would’ve ripped out the Yiling Patriarch <i>and</i> Jingyi’s golden core, and then Jingyi would’ve had to turn to demonic cultivation himself. So the whole thing would’ve been a big waste of time, basically.</p>\n<p>And then he realizes Wei Wuxian never answered his question, because of course he didn’t. <i>How did it feel for you?</i> he repeats stubbornly.</p>\n<p>Long pause. Jingyi’s about to ask again when Wei Wuxian says, very quietly, <i>Like I was being unmade</i>.</p>\n<p><i>Wow, yeah, we are</i> never <i>doing that again</i>, Jingyi insists, panicked, and Wei Wuxian laughs because he’s weird.</p>\n<p>Jingyi gives up on making Wei Wuxian act like a rational person and instead looks around for some clue as to what’s going on. And finds Sizhui, collapsed asleep by the side of Jingyi’s bed. Despite the fact that Sizhui’s bed is like…right there. Across the room. Why is Sizhui like this?</p>\n<p>Jingyi pokes him obnoxiously on the top of his head until he wakes up, because stupid behavior begets stupid behavior. Jingyi chooses not to think about the fact that Wei Wuxian agrees with him on that.</p>\n<p>Sizhui groggily slaps at Jingyi’s hand, complaining. This goes on for a while before Sizhui remembers what’s happening, at which point he sits bolt upright, cries, “Jingyi!” then jumps up and goes running out the door. Very dramatic.</p>\n<p><i>Running is forbidden in the Cloud Recesses</i>, Wei Wuxian points out smugly.</p>\n<p>Right, he was a student here. Jingyi’s not sure how the Cloud Recesses survived long enough for the Wens to burn it down, because after six months of Wei Wuxian, it seems like it should’ve been ashes already.</p>\n<p>In no time at all, Sizhui’s back, wide-eyed and frantic, dragging Zewu-jun behind him. <i>Literally</i> dragging him. That’s how you know Sizhui’s not dealing well—when he reverts to acting like he’s five.</p>\n<p>Zewu-jun doesn’t seem to be doing great either, come to that. He looks pale and utterly freaked, actually, which is probably the scariest thing that’s happened today.</p>\n<p>“I’m so sorry, Jingyi,” is the first thing he says.</p>\n<p>“You don’t need to feel bad just because the Burial Mounds creeps were creepier than we thought, Zewu-jun.” He pauses to listen to Wei Wuxian. “Wei Wuxian wants to thank you for paying such close attention, because otherwise he and I would both have suffered terribly. So please don’t feel guilty.”</p>\n<p>Who even knew Wei Wuxian knew how to be polite.</p>\n<p>Zewu-jun just closes his eyes, pained.</p>\n<p><i>Lans</i>, Wei Wuxian sighs, exasperated. <i>Really so stubborn. All of you!<br>\n</i><br>\n<i>I’m a treasure</i>, Jingyi informs him.</p>\n<p>Wei Wuxian laughs. <i>Yeah, you are</i>.</p>\n<p>Jingyi beams. Then he looks at Zewu-jun, who’s given up looking agonized in favor of looking puzzled. “Just talking to my ghost,” Jingyi explains. “He agrees that I’m a treasure.”</p>\n<p>Sizhui looks relieved that Jingyi’s acting like himself, and even Zewu-jun manages a tiny smile. “Ah. Good. Well…thank you both for your understanding. We will continue to look into an exorcism that won’t…”</p>\n<p><i>Rip your soul right out of your body</i>, Jingyi thinks, but politely doesn’t say. Wei Wuxian snickers because his polite hours are over, apparently.</p>\n<p>“For the nightmares,” Zewu-jun continues once he’s got a grip. “There are various songs that might help with that. We’ll test one out every night before you sleep and find the most effective. I suspect Wei Wuxian’s natural tendency toward nightmares is being exacerbated by your…shared brain problem. So that will be the first priority. Making this livable for both of you.”</p>\n<p>Sizhui looks eager to help, so Jingyi nods at him and Zewu-jun both, trying to ignore Wei Wuxian’s shock at being included in Zewu-jun’s worry. Wei Wuxian is a disaster.</p>\n<p><i>Livable, ehhh?</i> Jingyi thinks at him, taking pity.</p>\n<p>It takes him a minute because he keeps forgetting he’s dead. Then he goes, <i>Ehhhhhh?</i> back with delight and enthusiasm. Makes sense that the Yiling Patriarch would have a pitch black sense of humor.</p>\n<p>“The next step will be, as I said, finding a better exorcism,” Zewu-jun goes on. “With your permission, I would like to consult with my uncle on this.”</p>\n<p><i>Noooo</i>, Wei Wuxian wails. <i>Not Lan Qiren! He’ll squash me like a bug!<br>\n</i><br>\n<i>You don’t like Uncle?</i> Jingyi asks, surprised.</p>\n<p><i>Well, he sure as hell doesn’t like me</i>, Wei Wuxian mutters, and like…that’s true. Jingyi’s heard about the Yiling Patriarch from Lan Qiren in history class, and yikes, it feels personal. Though Lan Qiren never outright lied, at least. He just has a very different take on the Yiling Patriarch than Jingyi, probably because he doesn’t know him as well. He sees a loathsome heretic where Jingyi sees a self-destructive goofball.</p>\n<p>Okay, <i>murderous</i>, self-destructive goofball. But only when provoked!</p>\n<p><i>Wait</i>, says Wei Wuxian, <i>you call him Uncle? Seriously?</i></p>\n<p><i>Yeah?</i> Jingyi doesn’t understand the problem. <i>I mean, not when we’re out in the world, or whatever. But if we’re in Gusu, he doesn’t mind</i>.</p>\n<p>This concept is apparently outside Wei Wuxian’s frame of reference.</p>\n<p><i>He likes me</i>, Jingyi carries on, entertained. <i>I say all the things he can’t say because he’s too adult and important</i>.</p>\n<p>Wei Wuxian seems to feel this is somehow unfair.</p>\n<p>“Consensus?” Zewu-jun asks, amused.</p>\n<p>“Wei Wuxian thinks Uncle will squash him like a bug,” Jingyi relays, ignoring Wei Wuxian’s horrified screeching. Sooner or later, Wei Wuxian will learn what communicating actually means. Jingyi has to believe that.</p>\n<p>“Yes, well. I think we will not be causing my uncle unnecessary stress by telling him who, exactly, is possessing you,” Zewu-jun says, proving once again why he’s the coolest Lan.</p>\n<p>…Okay, no, Hanguang-jun is still the coolest Lan. But Zewu-jun is so close. So close.</p>\n<p>“Then we’re fine with it,” Jingyi tells him.</p>\n<p>Zewu-jun nods, smiles at everyone, instructs Sizhui to play Jingyi some brain-soothing song Jingyi’s never heard of, and then wanders off, probably to freak out in private. Jingyi worries about him sometimes.</p>\n<p>Meanwhile, Sizhui worries about everyone always, and is currently sending fretful looks alternately at the door Zewu-jun disappeared out of and at Jingyi.</p>\n<p>“Did they tell you what went wrong?” Jingyi asks.</p>\n<p>“Mm…they said the Yiling Patriarch is attached to your golden core, and so in attempting to remove him…Jingyi, you screamed <i>so much</i>. You screamed like you were dying. I thought you were <i>dying!</i> I thought you were going to die right in front of me, and there was nothing I could—you were just—” And then he’s too choked up with tears to say any more.</p>\n<p><i>Oh shit</i>, says the ever-helpful Yiling Patriarch.</p>\n<p>Jingyi crawls out of bed to join Sizhui on the floor and fling his arms around him. Sizhui hugs back like he’s drowning and Jingyi is the only driftwood in sight. “I’m alive,” Jingyi says. “And even if we’d done the whole exorcism, I wouldn’t have died, okay? You wouldn’t have had to watch me die. I would’ve had no golden core, and that would’ve seriously, seriously sucked, but I still would’ve <i>been</i> here. Right?”</p>\n<p>Sizhui nods against his shoulder, still crying. Sizhui always cries quietly, muffling what little noise he makes like he’s terrified of being caught. It’s always been upsetting, and it’s worse now.</p>\n<p>“And Zewu-jun is freaked out forever,” Jingyi continues desperately, “so he’ll be <i>super</i> careful about trying anything again. Maybe he never will! Maybe I’ll just have a brain friend all my life, and it’ll be the awkwardest thing in the world!”</p>\n<p><i>Absolutely the most awkward</i>, Wei Wuxian agrees ungraciously.</p>\n<p>Sizhui nods again, seemingly a bit soothed, but still sniffling.</p>\n<p>“And you’re gonna play brain-calming songs for me and Wei Wuxian when we need to sleep—which is not now, we just woke up. What time is it, even?”</p>\n<p>“Three in the afternoon,” Sizhui answers in a wavering, unsteady little voice.</p>\n<p>“Hah! Zewu-jun wanted to send us back to sleep in the middle of the afternoon. But yeah, eventually you’ll play us to sleep, and then we’ll get to sleep without nightmares, and that’ll be because of you. So don’t cry, okay? You’re freaking out the Yiling Patriarch.”</p>\n<p><i>It’s true</i>, Wei Wuxian thinks earnestly.</p>\n<p>Sizhui laughs. “Okay,” he says, voice only wobbling slightly. Sizhui is the best.</p>\n<p>Meanwhile, it’s a damn good thing Jingyi’s parents are doing a six-month medical tour of the smaller sects right now, because if they’d been here to see this, Zewu-jun would be dead. It wouldn’t be fair, but there it is. Jingyi’s mother is a vengeful mother.</p>\n<p>* * *</p>\n<p>It takes two incredibly boring weeks before Zewu-jun, Lan Qiren, and Sizhui all agree to let Jingyi out on a night hunt again. The first week, he doesn’t argue. Who knows what that soul-ripping weirdness even did to him? Anyway, he’s still recovering from sleep deprivation, so yeah, he’ll happily take a break.</p>\n<p>But then another week passes, and Jingyi feels fine. Wei Wuxian also feels fine, for a dead guy. Jingyi’s bored. Wei Wuxian is also bored, which is a much more serious problem. And they won’t. Let them. Leave. Gusu. They won’t even let them leave the Cloud Recesses! Jingyi is losing his mind, and Wei Wuxian is losing <i>his</i> mind inside <i>Jingyi’s</i> mind, and yeah. Jingyi’s had enough, and he’s making it everyone’s problem.</p>\n<p>Except Sizhui’s, because Sizhui is impervious to Jingyi’s tantrums. He even thinks the whole possession thing is hilarious now that he’s confident Jingyi isn’t going to die of it. Sizhui has a sick sense of humor. Probably because he grew up on a pile of corpses. Like. That’d turn anybody strange.</p>\n<p>In the end, it only takes two dedicated days of being a whiny pain in the ass before Zewu-jun agrees to let Jingyi go on a night hunt. Jingyi is delighted and Wei Wuxian is impressed. Sizhui is indulgent, but everyone knows that’s only on the condition that he also goes on the night hunt. Sizhui has politely but immovably glued himself to Jingyi’s side since the exorcism-gone-wrong, and nobody’s dumb enough to argue with him about it.</p>\n<p>Zewu-jun is still being a little overprotective, though, because he’s decided that Jingyi can only go on a night hunt if Hanguang-jun is leading it, which means they have to wait for Hanguang-jun to come home. Still, at least there’s something specific to wait for. And besides, Hanguang-jun is worth waiting for—he’s a badass, and night hunts with him are the best.</p>\n<p>Well…normally they’re the best. This time, though, Jingyi’s going to have to spend the whole trip worrying about the emotional state of the lovelorn ghost in his head. The ghost who hasn’t seen Hanguang-jun since…oh wow, since he <i>died</i>.</p>\n<p>It’s going to be super awkward, Jingyi just knows it.</p>\n<p>* * *</p>\n<p>It actually isn’t as awkward as Jingyi expected. Well, not at first.</p>\n<p>It only takes Hanguang-jun a week and a half to come home, and he doesn’t believe in sitting around, so they leave for the night hunt two days after that. Which means Jingyi and Wei Wuxian don’t actually get to see him until he meets up with everyone at the gate that morning.</p>\n<p>Much to Jingyi’s amazement, Wei Wuxian doesn’t freak at the sight of Hanguang-jun. He <i>does</i> go dead silent, though, almost like when he’s “napping,” and then stays silent for ages. They make it the entire two day trip to the town with the haunting before he says anything at all, or emotes above a dull background vibe. So it’s not awkward, but it is freaky. It’s a downright relief to finally hear Wei Wuxian’s voice at the end of day two.</p>\n<p><i>How long has he been like this?</i> he asks quietly.</p>\n<p><i>Hanguang-jun?</i> Jingyi replies, confused.</p>\n<p><i>Yes.<br>\n</i><br>\n<i>Like what? This is just…him. This is normal</i>.</p>\n<p>Or, okay, apparently it’s <i>not</i> normal, because Wei Wuxian just got <i>very, very sad</i>. And now he’s showing Jingyi a bunch of memories.</p>\n<p>Hanguang-jun chasing him around the rooftops of the Cloud Recesses. Being hilariously bitchy at him about rule-breaking. Fretting about his health. Freaking about porn. Sassing Jins. <i>Singing</i>. Being all cute with baby Sizhui. Being <i>super pissed</i> at Wens. Looking up at a bunch of falling flower petals, content and pleased.</p>\n<p>And seeing all that, and then looking at current Hanguang-jun…it’s like he’s turned into a washed-out ghost of himself. Jingyi always thought he was super calm, but maybe it’s more like he’s miserable. And…angry.</p>\n<p>Does this mean Hanguang-jun has been pissed off and depressed Jingyi’s <i>entire life</i>? Like sure, that was awful, how Wei Wuxian died. It would definitely mess a person up. But it’s been <i>years</i>. It’s been most of Jingyi’s life! The man just doesn’t let shit go, does he?</p>\n<p><i>He does not</i>, Wei Wuxian agrees, fond and sad.</p>\n<p>Wild. And terrible, too. Jingyi always thought Hanguang-jun seemed like a different person around Sizhui, and he is. He’s the old version of himself. Which means Sizhui isn’t so much the only one who makes Hanguang-jun happy as he is the only one who makes him feel <i>normal</i>. This is so upsetting. Jingyi hates this love story.</p>\n<p>He’d expected to spend the whole night hunt worrying about Wei Wuxian, but no, it’s Hanguang-jun who’s the problem. Jingyi keeps comparing current behavior to past behavior and then fretting and wringing his hands. It doesn’t help that Wei Wuxian is doing the exact same thing.</p>\n<p>It also doesn’t help that the night hunt turns out to be the world’s most boring haunting. The ghost is seriously just a lady who was worried that no one would take care of her ducks after she died. They’re not domesticated ducks or anything—they’re wild lake ducks. She’d throw them bread sometimes. They are not going to miss her, though it takes a stupidly long time to convince her of that.</p>\n<p>But the downright silliness of it means there’s nothing to distract Jingyi from the real crisis, which is this: is Hanguang-jun planning to be this tragic version of himself <i>forever</i>?</p>\n<p><i>Do something!</i> Wei Wuxian demands, which is easy for him to say. What can Jingyi do? He’s not anybody special to Hanguang-jun.</p>\n<p><i>Make him give you a weird look!</i> Wei Wuxian orders.</p>\n<p><i>…There’s so much that’s wrong with you.<br>\n</i><br>\n<i>Look, it’s better than nothing!<br>\n</i><br>\nAnd that’s why it’s Wei Wuxian’s fault when Jingyi sidles up to Hanguang-jun on their way home from the night hunt and asks the first random question that comes to mind.</p>\n<p>“Hanguang-jun? Did Jin Guangshan have a potbelly?”</p>\n<p>Yep, that’s a blatant facial expression. A flabbergasted one. Jingyi has <i>succeeded</i>—and he’s also made Wei Wuxian laugh his spectral ass off (mostly in relief), which is good.</p>\n<p>“…He did not,” Hanguang-jun says eventually, staring at Jingyi.</p>\n<p>“I didn’t think so. Thank you, Hanguang-jun!” Jingyi says, retreating back to the rest of the disciples and mercifully sparing Hanguang-jun his confusing presence. He firmly ignores Sizhui’s incredulous side-eye.</p>\n<p><i>Wait, yes he did,</i> Wei Wuxian insists, side-tracked. <i>I remember him with a potbelly!<br>\n</i><br>\n<i>I know you do, that’s why I had to ask, you weirdo</i>, Jingyi snaps. <i>Even when you remember people, you remember them</i> weird!</p>\n<p><i>I remember what matters</i>, Wei Wuxian informs him.</p>\n<p>It’s true from a certain point of view. Jingyi’s not going to think about it too hard because he’s cried enough about Wei Wuxian already.</p>\n<p>* * *</p>\n<p>Possessed life continues pretty quietly. Lan Qiren and Zewu-jun don’t make any real progress in fixing the…is it rude to call him a problem? Wei Wuxian isn’t a problem, but possession is a problem, so Jingyi’s calling it a problem. Anyway, Jingyi’s no closer to being exorcized.</p>\n<p>But now that Zewu-jun and Sizhui have found them a good song (apparently it’s a combination of brain-soothing and spirit-soothing, which makes sense), they can sleep. Well, most of the time, anyway. They’re down to hideous nightmares once every two weeks or so, and that’s nothing. Life is beautiful once it includes sleep. Anything else, Jingyi’s prepared to live with. Even the awful, secondhand memories.</p>\n<p>After another month, even Sizhui starts easing up on his overprotectiveness, and Jingyi gets put back on the regular Junior roster for night hunts. He’s super excited about it right up until he realizes who’s heading the next one. It’s Lan Yanfeng, and that’s so unfair. A brutal turnaround, too, coming on the heels of Hanguang-jun, who is awesome even while chronically sad.</p>\n<p>Lan Yanfeng, on the other hand, is a petty, smug little tyrant who isn’t half as talented as he thinks he is. He has a problem with everyone better than him and Sizhui in particular, and that makes Jingyi murderous. There are a bunch of rules about how wrong it is to loathe someone with every fiber of your being, but Jingyi takes one look at Lan Yanfeng and forgets them all.</p>\n<p><i>Want me to kill him and make it look like an accident?</i> asks Wei Wuxian with casual, bloodthirsty interest. It’s…well, it’s nice that he likes Sizhui. But still.</p>\n<p><i>No</i>, Jingyi insists. <i>No murder in the Cloud Recesses.<br>\n</i><br>\n<i>We’re not in the Cloud Recesses</i>, Wei Wuxian points out.</p>\n<p><i>No murder of allies!<br>\n</i><br>\n<i>Is he really an ally, though? He has a face like he’d stab you in the back given half a chance. I’m serious, it wouldn’t be hard to get rid of him.<br>\n</i><br>\n<i>I need you to be a little less Yiling Patriarch right now</i>, Jingyi snaps impatiently.</p>\n<p>Long, uncomfortable silence. Then, just when Jingyi’s starting to worry he’s actually pissed Wei Wuxian off, he hears, …<i>Light maiming? Or you could beat him up yourself and blame it on me. Zewu-jun would believe you!</i></p>\n<p>Jingyi muffles a scream into his sleeve, attracting an alarmed look from Sizhui.</p>\n<p>He starts to think he should’ve let Wei Wuxian do a little light maiming, though, when they get to town and Lan Yanfeng immediately sends Sizhui off to arrange rooms and food, while the rest of them go to deal with the problem. He is <i>that</i> worried about Sizhui being better than him in front of people.</p>\n<p><i>Pathetic but not dangerous</i>, Wei Wuxian observes thoughtfully. <i>At least he’s not trying to shove Sizhui into danger alone and get him killed</i>.</p>\n<p>Which makes Jingyi suspect that people who didn’t like teenaged Wei Wuxian <i>did</i> shove him into danger and try to get him killed, so now he’s enraged on behalf of Sizhui <i>and</i> Wei Wuxian.</p>\n<p>And then, just to add to how much fun this trip is, they no sooner find the problem—yaoguai, specifically a herd of weird, nightmarish, skeletal deer, which, what the fuck—than Lan Yanfeng manages to get his stupid ass flung into a tree by undead deer antlers. It knocks him out, so now there are just a bunch of juniors. All alone. With monster deer. And since Lan Yanfeng ditched Sizhui in town, Jingyi is the most senior disciple here, which means he’s in charge, which is why everyone is looking at him. He is not ready for this level of responsibility. Also, if Sizhui were here, he’d have taken out half the monster deer already.</p>\n<p>Basically, if a monster deer eats Lan Yanfeng, it’s no more than he deserves.</p>\n<p><i>How do we fight them?!</i> Jingyi demands of the famous cultivator living in his head.</p>\n<p><i>I dunno</i>, says Wei Wuxian. <i>Shoot ‘em, I guess. I wouldn’t get too close if I were you. Which…I kind of am, right now, so be careful. Seriously, undead deer? Weird</i>.</p>\n<p>Wei Wuxian is useless. Still, Jingyi pulls out his bow and tells everyone to stay far away from the deer and shoot at them, because he’ll take whatever limited advice he gets. And shooting them <i>does</i> seem to work. But not well enough.</p>\n<p><i>You’re holding your arms wrong</i>, says Jingyi’s suddenly helpful mass murderer.</p>\n<p><i>You do it, then</i>, Jingyi snaps, angry, stressed, and in no mood.</p>\n<p><i>You said it, kid</i>, says Wei Wuxian with a laugh, and then he just…</p>\n<p>It really does feel like getting cheerfully elbowed out of the way. Only it’s getting elbowed out of control of his own body and into black jelly instead. Jingyi’s life is so weird.</p>\n<p><i>Pay attention</i>, Wei Wuxian orders firmly. </p>\n<p>And Jingyi does. Because he can, for a change. Seems like Wei Wuxian was really trying to block him out during the whole…murder thing. And the Zewu-jun talk, too. But now Jingyi can see, and he can even feel his body a little—he can feel it move into a different position (elbow up, shoulders open, wider stance), and then release an arrow.</p>\n<p>And it’s perfect. Hits the monster deer thing right in the eye. Just that easily, Wei Wuxian takes out another one. Then another one after that, and they’re officially not outnumbered anymore.</p>\n<p><i>Let me try!</i> Jingyi says, excited, and Wei Wuxian laughs and lets Jingyi haul himself back into control of his body.</p>\n<p>They mess around like that for the rest of the hunt, taking out undead deer like professionals and impressing the hell out of the rest of the juniors, and it’s—Jingyi is improving like crazy, because learning-by-possession is seriously effective. He gets that he can’t exactly go to Hanguang-jun and recommend it as a training method, but he <i>wishes</i> he could. All the words in the world are no substitute for having someone just do it for you until you work out how to do it yourself. Wild.</p>\n<p>Also, hey, Wei Wuxian is a badass. Obviously Jingyi knew that—Wei Wuxian is famously (infamously?) a badass. But somehow feeling the guy shoot, watching him hit every target like magic…it’s something else again. And a much nicer display of awesomeness than, say, coming to after a short interval to find all your kidnappers gruesomely murdered. (Not that that wasn’t appreciated at the time. It’s just that it was more freaky than badass.)</p>\n<p>Once the deer are all dead (…more dead), they pile their bodies up in a clearing and burn them. That done, Jingyi instructs Lan Xuanhui to take Lan Yanfeng back to town, get him medical care, and try to find the inn Sizhui booked for them. She agrees. Jingyi…wasn’t expecting her to grab Lan Yanfeng by the neck of his robes and drag him to town, but he’s not gonna say anything about it, either. (Wei Wuxian is laughing himself metaphorically sick.)</p>\n<p>Jingyi takes the rest of the disciples to report their success to the townspeople, who are pretty excited not to have skeletal deer lurking in their woods anymore (fair). After that, they finally get to troop back to the inn for dinner and washing up, which is great and relaxing. But then the fun is over, because their Senior fucked up, and that means they’ve all got to write up a report for this. A <i>long</i> report, because yaoguai don’t come from nowhere. Gusu Lan needs to have the whole story so they can do a follow-up.</p>\n<p>Wei Wuxian is not helpful when it comes to writing reports. Wei Wuxian is the opposite of helpful.</p>\n<p>At least Sizhui keeps Jingyi company during report hell, but normally Sizhui would be writing his own report and pointing out things Jingyi missed, and this time he can’t, because <i>certain assholes</i> kept him away from the hunt.</p>\n<p>Said asshole is supposed to make a full recovery. Which. Good. For him.</p>\n<p>Still, despite Lan Yanfeng’s best efforts, the absence of Sizhui, and even the awful report, it was a fun hunt overall. Busy, too, which is why it’s only when Jingyi’s getting ready for bed that it sinks in that he just…casually, repeatedly let the Yiling Patriarch take over his body today, with every expectation that the guy would give it back without argument. And he was <i>right</i> about that.</p>\n<p>The Yiling Patriarch, who helps him and protects him and teaches him to fight better. The Yiling Patriarch, who Jingyi trusts absolutely.</p>\n<p><i>Good night, Senior Wei</i>, he thinks firmly, and falls asleep with a smile on his face, refusing to address Senior Wei’s alarmed bafflement.</p>\n<p>* * *</p>\n<p>Not much is said in response to everyone’s reports from that night hunt. On the other hand, Lan Yanfeng doesn’t lead any more night hunts. In <i>fact</i>, Lan Yanfeng has suddenly been deemed of critical importance to the library preservation project. Which means, in practice, that he’s copying out important texts all day every day. The Lan have been very careful with their library since the time they almost lost it. No one would describe this task as punishment. At least, not to Lan Yanfeng’s face.</p>\n<p><i>Zewu-jun is a little bit evil, huh?</i> Senior Wei asks, obviously delighted.</p>\n<p>Unfortunately, Senior Wei’s enthusiasm about Lan Yanfeng’s fate only carries him so far, and within a few days he’s back to being bored. So bored. Bored beyond either his or Jingyi’s capacity to deal with it.</p>\n<p>Jingyi starts letting him take over the body every other evening so he can invent stuff. Probably there are a lot of people who would disagree with this decision, but fortunately none of those people know about it.</p>\n<p>“He’s a genius,” Jingyi tells Sizhui a week into this arrangement, while Senior Wei is “napping” (or, more likely, coming up with more deranged, revolutionary cultivation ideas in private).</p>\n<p>“People do say that,” Sizhui agrees. “It’s why we use his talismans. And his compasses of evil. And his—”</p>\n<p>“No, it’s—I mean, I <i>knew</i> he was a genius, but it’s different when it’s happening in your own head and you’re <i>watching</i> it happen. It’s like watching a really good artist. You can see every line they paint, and it seems so simple, but you know you’d never be able to do it yourself. Not in a million years. You know?”</p>\n<p>“No.” Sizhui looks kind of jealous. Which he should be, really, because he has way more right to Senior Wei-related insights than Jingyi does. On the other hand, the nightmares would definitely hit him harder.</p>\n<p>Well, Jingyi can’t do anything about it either way. Life sucks and is unfair, and this is not news. “Do you want to come watch him work?” Jingyi asks, figuring it’s a decent compromise. “You can watch from outside his head and I can watch from inside his head, and neither of us will have a goddamn idea what he’s up to.”</p>\n<p>Sizhui beams.</p>\n<p>And so it is that Sizhui joins them in the library for Senior Wei’s next inventing evening. It’s even more fun than usual, because Sizhui isn’t shy about asking questions. Jingyi was afraid to interrupt Senior Wei’s flow, but apparently Sizhui doesn’t give a fuck. And he’s right, because Senior Wei seems to thrive on distractions. Unless he’s gone really deep into inventing, in which case he doesn’t even hear Sizhui, so it doesn’t matter.</p>\n<p>Within a month, the lunatic’s invented three new talismans. <i>Three</i>. They don’t do anything too splashy—one keeps food cool, one cleans clothes, and the last one makes a sort of self-sticking bandage for injuries. Not glamorous, but they make life <i>so much easier</i>.</p>\n<p>Senior Wei doesn’t get why Jingyi and Sizhui are so excited about them. He seems convinced that somebody’s already come up with talismans like this and just hasn’t bothered to share them because they’re boring. Apparently he’s totally unaware that normal people could fund years of a pretty expensive lifestyle off the sales of just one of these talismans.</p>\n<p>Jingyi enjoys taking the talismans one by one to Zewu-jun and just…admiring the face that happens. Zewu-jun is normally almost as unreadable as Hanguang-jun, if in a smilier way, but this? It’s getting to him.</p>\n<p>* * *</p>\n<p>Five months after Jingyi gets possessed, his parents come home from their trip. Everyone who knows about the possession agrees that Jingyi should not tell his parents about it.</p>\n<p>His mom figures it out in under ten minutes.</p>\n<p>First it’s, “What’s wrong with you?” Then it’s, “You seem distracted, Jingyi. And you keep smiling at nothing. What’s going on with you?” And then, inevitably, it’s, “Are you possessed? You’re possessed, aren’t you! Does Zewu-jun know about this?!”</p>\n<p><i>Your mother is amazing, Jingyi</i>, Senior Wei says, clearly in awe.</p>\n<p>In the end, Jingyi has to admit to everything. Well, he admits that he got caught by demonic cultivators and ended up with a ghost attached to his golden core. He doesn’t tell them who the ghost is, because he’s not up to the hours of soothing he’d have to do afterward.</p>\n<p>Dad is appalled, as predicted. Also as predicted, Mom finds the whole thing hilarious once she’s convinced that the ghost is nice, didn’t possess Jingyi on purpose, and is not hurting him. She and Sizhui have a very similar sense of humor, come to think of it.</p>\n<p>“Well, let me talk to your ghost, then,” Mom says, as if this is the only reasonable next step.</p>\n<p>“What?” Jingyi yelps.</p>\n<p>“There’s a strange man hanging around in my son’s head, Jingyi,” Mom explains patiently. “Of course I want to speak to him.”</p>\n<p>“But Uncle and Zewu-jun have both talked to him already. Sizhui even talked to him! He’s fine!”</p>\n<p>“Why don’t you want us to meet your ghost friend, Jingyi?” Dad asks suspiciously.</p>\n<p><i>Okay!</i> Senior Wei cuts in. <i>Let me talk to your parents, I guess. Although I honestly don’t know whether that’ll make them feel better or worse.<br>\n</i><br>\n<i>Worse</i>, Jingyi predicts gloomily. “You can’t ask him what his name is,” he insists.</p>\n<p>“…Why?”</p>\n<p>Jingyi is doing nothing to make Dad less suspicious, he sees. “Because you’ll have a whole bunch of ideas about who he is if you know his name, but I’ve seen his memories, and I know you’ll be wrong. So…please don’t ask. Just talk to him.”</p>\n<p>Dad scowls. Mom wipes a fake tear away and murmurs, “My baby, all grown up and bossing me.”</p>\n<p>Jingyi loves his parents dearly, but also he hates them so much sometimes.</p>\n<p>Senior Wei, meanwhile, is delighted and baffled by this entire conversation. Jingyi’s not surprised. He’s pretty sure Senior Wei has never even seen a functioning family up close before. <i>Go for it</i>, Jingyi tells him, resigned.</p>\n<p>Senior Wei’s hesitant this time—it’s not so much being elbowed into the jelly as it is being gently guided into the jelly. And then Senior Wei bows inappropriately low and says, “This one apologizes for being a burden to your son.”</p>\n<p><i>Stop that!</i> Jingyi demands. <i>Don’t be weird!</i></p>\n<p>Senior Wei ignores him.</p>\n<p>“My, so polite,” Mom says, sounding sarcastic. Dad gives an approving hum, though, so that’s something. “But no need to stand on such ceremony. After all, you’re very close with our son, intentionally or otherwise.”</p>\n<p>Senior Wei sits up, and wow, he feels <i>hideously</i> uncomfortable.</p>\n<p><i>Mom is not Madam Yu</i>, Jingyi says worriedly. <i>She’s pretty much nothing like Madam Yu, Senior Wei. She’s kinda like Sizhui, actually.</i><br>\n<br>\n<i>I’m not possessing Sizhui’s son</i>, Senior Wei points out, not calming down at all.</p>\n<p>“Are you a cultivator?” Mom asks while Dad studies Jingyi’s face with a disturbed expression. (What does it look like when Senior Wei is using Jingyi’s face, anyway? It must be so creepy.)</p>\n<p>“I was,” Senior Wei allows.</p>\n<p>“Were you Gusu Lan?” Mom asks, not asking his name, but definitely sneaking all around it.</p>\n<p>“Yunmeng Jiang,” Senior Wei admits. Jingyi wonders if that was a good idea.</p>\n<p>“Hm,” says Dad. “I hope you’re not filling Jingyi’s head with those things Yunmeng Jiang likes to call sword forms.”</p>\n<p>And there it is.</p>\n<p>“…You have a problem with our sword forms?” It’s like Senior Wei doesn’t know whether to crack up or be outraged.</p>\n<p>Dad makes a face. “Sloppy.”</p>\n<p>“Unpredictable,” counters Senior Wei.</p>\n<p>“Yes, yes,” Dad sighs. “And running at the enemy naked would be unpredictable too, but that doesn’t mean it’s a good idea.”</p>\n<p>Dad is a doctor who has never once fought in a battle. Does Dad remember that?</p>\n<p>“<i>Have</i> you been teaching our son sword forms?” Mom cuts in brightly.</p>\n<p>“I’ve only been training him in Lan forms, I promise,” Senior Wei swears, grinning and clapping a dramatic hand over his heart. (Well. Jingyi’s heart.) Apparently he’s forgotten about being formal. “But I don’t know them well, so mostly I’ve stuck to archery and a little bit of talisman work.”</p>\n<p><i>Show them your new talismans</i>, Jingyi tells him.</p>\n<p>Senior Wei shrugs and does. Mom and Dad are just as impressed as they ought to be, and by the time the three of them are done analyzing the finer points of use for the talismans, it’s ten minutes to curfew and Jingyi just about has time to say goodbye.</p>\n<p>When they’re all in the Cloud Recesses, Jingyi has tea with his parents once a week. Nothing about that changes now except that Senior Wei comes too. By the third visit, Senior Wei and Mom have bonded over talismans and how boring Cloud Recesses food is, and Senior Wei and Dad have bonded over talking shit about every other sect’s sword forms, and twice as much shit about the Jin.</p>\n<p>After that, Dad starts collecting books on famous swords for Senior Wei to borrow, and Mom starts making food for him. Which is weird, because they’ve only got Jingyi’s body. Like, Mom’s given them one portion, but half of it is normal and half of it is so spicy Jingyi’s tongue is still burning when he’s back in control of the body.</p>\n<p>Senior Wei is now officially Jingyi’s weird uncle. It’s fine.</p>\n<p>It’s been six whole months, and they are <i>still</i> making no progress on Jingyi’s exorcism. Zewu-jun isn’t sleeping enough and Uncle is starting to pull out his own beard.</p>\n<p>Jingyi, meanwhile, feels bad about how little he cares about being exorcized. But…it’s just like having a roommate who never goes out? It’s not ideal, but it’s not awful. He and Senior Wei try to give each other as much space as they can, and they trade off the body every once in a while so Senior Wei can, like, stretch his legs. They’re used to it. They’re over it.</p>\n<p>Nobody else is, though. Well, nobody except Jingyi’s parents, who accepted Senior Wei into the family with alarming speed, and Sizhui, who seems pleased he’s gained two friends for the price of one. (Senior Wei and Sizhui get on like a house on fire, which kind of kills Jingyi.)</p>\n<p>The only downsides, as far as Jingyi’s concerned, are the occasional horrible memories (though Senior Wei is either getting better at hiding them or isn’t feeling them as intensely), the occasional horrible nightmare (very rare now that Sizhui plays for them before bed), and the way Senior Wei is an awful, enabling bad influence.</p>\n<p>That last thing is the reason Jingyi is copying out Conduct for what has to be the twentieth time this month. Senior Wei missed Emperor’s Smile, so Jingyi let him have the body to go drink some. Under the circumstances, Uncle wasn’t willing to accept <i>My ghost made me do it</i> as an excuse.</p>\n<p><i>This is all your fault</i>, Jingyi thinks resentfully.</p>\n<p><i>Is it?</i> Senior Wei replies idly, so busy planning out some kind of resentful energy purifying talisman that he’s barely listening. <i>Because you didn’t take much persuading.<br></i><br><i>Okay, maybe not, but I would never have come up with it on my own!<br></i><br><i>Hmm. Sizhui’s told me stories, you know</i>.</p>\n<p>Sizhui is a traitor.</p>\n<p><i>I honestly don’t understand how someone like you survives with all these rules, anyway</i>, Senior Wei goes on, focusing on the conversation for the first time.</p>\n<p><i>There are too many rules to obey</i>, Jingyi explains. <i>Too many for anybody to obey. I don’t think the Lan elders thought that through, because what the Lan rules actually teach you is how to not get caught. Also how to pick which rules are worth breaking. And you screwed up both of those things for me, just saying</i>.</p>\n<p>Long silence. And then Senior Wei says, in a thoughtful tone, <i>I guess no one ever told Lan Zhan that</i>.</p>\n<p>Jingyi hesitates. The thing is, he also used to believe that Hanguang-jun obeyed all the rules. Or, well, definitely the important ones. But he’s gotten a horrifying amount of perspective on Hanguang-jun lately, and he’s starting to think that what he took for obedience was actually just broken-hearted apathy.</p>\n<p>Also it sometimes seems like the elders are kind of…afraid of Hanguang-jun. Jingyi cannot imagine them ever questioning or criticizing a single thing he does. That means Hanguang-jun is totally self-policed, and could maybe be breaking all kinds of rules? It’s hard to picture—Jingyi’s never <i>seen</i> him break a rule. Still, it’s not like they’re always together or anything.</p>\n<p>Jingyi decides not to touch on any of that today. Or possibly ever. <i>Sizhui’s the best at it, </i>he says instead.</p>\n<p><i>The best at the rules?<br></i><br><i>The best at not getting caught. I swear he breaks more rules than anybody, but he </i>never<i> gets caught, Senior Wei. It’s kind of annoying.<br></i><br><i>Sizhui?</i> Senior Wei asks, shocked. <i>Our Sizhui?<br></i><br><i>Yeah</i>, Jingyi confirms. <i>Secret rebel against stupid rules</i>.</p>\n<p>Senior Wei laughs, delighted. He must’ve been a great parent for Sizhui, back when. In case Jingyi needed more sad thoughts to brood over.</p>\n<p>Not that Hanguang-jun is bad! He’s an awesome parent. And, come to think of it, Sizhui’s entire everything is yet more proof that Hanguang-jun doesn’t give a shit about rules. Firstly, Sizhui’s a Wen, and not just any Wen, but the <i>Yiling Patriarch’s</i> kid, which…yeah, that’s not allowed. Secondly, he does whatever the fuck he thinks is right, and if that happens to coincide with rules, it’s a pleasant bonus. Sizhui only remembers one parental figure, and he worships that parental figure. If Hanguang-jun had ever once indicated to him that the rules were more important than his personal moral compass, Sizhui would not engage in half the fuckery he engages in.</p>\n<p>…Is Hanguang-jun also a secret, sneaky rebel?</p>\n<p>There has to be some kind of upper limit to the number of personal crises the Yiling Patriarch can cause Jingyi, right? Because this is getting ridiculous.</p>\n<p><i>Sizhui is a good, kind child, and definitely smarter than that rock you base your lives on</i>, Senior Wei is insisting.</p>\n<p><i>Of course he is</i>, Jingyi agrees easily. <i>He’s the best person in the Cloud Recesses. And he’s also an asshole, which is why I like him. Think how boring he’d be if he were just…</i>good <i>all the time. We would not hang out</i>.</p>\n<p>Senior Wei considers this. <i>True</i>, he eventually decides. <i>He actually reminds me of Wen Ning</i>.</p>\n<p><i>The Ghost General?</i> Jingyi asks incredulously. (Although he shouldn’t be incredulous, because haha! The Ghost General was totally Sizhui’s uncle or cousin or something, wasn’t he? This is <i>insane</i>.)</p>\n<p><i>Yes</i>, Senior Wei agrees absently. <i>Wen Ning was a good, kind, gentle person. But he still drugged an entire building full of his relatives because he didn’t think what they were doing was morally correct</i>. A flash of Lotus Pier, blood-soaked and covered in corpses, some of them <i>children</i>—and a young man in Wen red, babbling in panic at Senior Wei about saving Jiang Wanyin.</p>\n<p>…<i>Whoa</i>, says Jingyi, so confused he doesn’t even know where to start asking questions.</p>\n<p><i>Right?</i> Senior Wei replies wistfully. <i>Wen Ning was the best</i>. A parade of memories of Wen Ning doing objectively adorable things, both before and after he got zombified. Jingyi is actually angry he can’t meet this guy. He’s even angrier that Sizhui can’t.</p>\n<p><i>And Jins are the worst, huh?</i> Jingyi mutters bitterly.</p>\n<p>And then, predictably in retrospect, Jingyi gets treated to a whole, long memory of the nightmare night when Senior Wei and Wen Qing found Wen Ning’s mostly-dead body in a Jin prison camp. Apparently Senior Wei’s been trying really hard to keep this memory from Jingyi, which is so, so appreciated. Jingyi’s incredibly sorry he messed that up for both of them with his stupid comments. Like, he’s gotten bits and pieces of that night in nightmares, but he never knew, before, how much of it was real. Too much, it turns out.</p>\n<p>Wow, it’s like every time he thinks he can’t hate adults more? Senior Wei gives him new reasons to hate them more. And now he’s never going to be able to look at a Jin robe again without thinking of Wen Qing in the rain screaming her little brother’s name in agony. That’s not going to make life awkward at all.</p>\n<p>“Jingyi?” calls Sizhui, who’s come to collect him from the library for dinner. “Why are you crying?!”</p>\n<p>“Senior Wei’s life is <i>upsetting</i>,” he says, sobbing and not even feeling bad about it, because seriously—<i>so upsetting</i>. And Sizhui’s life is upsetting, too, and he doesn’t even <i>know</i> it, which shouldn’t make it worse but somehow does.</p>\n<p>* * *</p>\n<p>Jingyi’s still brooding about Senior Wei’s sad existence weeks later when he’s on gate duty, which is one of the world’s most boring jobs and doesn’t offer many distractions. (Though more distractions at the moment than usual: Nie Huaisang is visiting, and he can apparently only stand to be in the Cloud Recesses for twenty-four hours max before darting off to town for some vice or other. He’s been entertaining Jingyi and Senior Wei with his comings and goings all week.)</p>\n<p>Knowing about Senior Wei’s sad story would be bad enough on its own, but it also comes with a boatload of guilt, because it means Jingyi knows more than he should about a ton of other people, too. Jingyi’s not used to this kind of problem—a having too much information and not sharing it problem. Normally he just says what he thinks when he thinks it, and deals with the consequences. Now, though, he not only has secrets, but they’re secrets that don’t belong to him, which means the consequences of talking about them wouldn’t be <i>his</i> consequences. He has no idea what to do with that, and it’s a disaster.</p>\n<p>The first secret burning a hole in Jingyi’s pocket is Sizhui being Senior Wei’s kid. At first, Jingyi didn’t want to tell Senior Wei because he didn’t trust, well, the Yiling Patriarch. That time is long gone. Now he doesn’t want to tell because they hang out with Sizhui pretty much every day, and if Senior Wei knew who Sizhui was, that would be like constantly rubbing his face in what he can’t have. Wouldn’t it? Senior Wei knows A-Yuan survived and is a happy Lan disciple, and Jingyi is pretty sure that’s enough. And that more would be too much. Maybe. Maybe not. But the thing is, once he says something, he can’t unsay it, so he’s paralyzed with indecision, sitting on the whole problem like a chicken on an egg.</p>\n<p>Similarly, Jingyi’s not telling Sizhui his dead dad is around, not when Sizhui’s just going to lose him again the second Jingyi gets exorcized. Same reason Hanguang-jun doesn’t get to find out about Jingyi’s ghost—though that choice, at least, isn’t just Jingyi’s. It’s Senior Wei’s, too. Jingyi’s decided not to ask him why, because the answer will definitely be depressing.</p>\n<p>Is Jingyi confident about these choices? Not even a little. Jingyi is not temperamentally suited to be making big emotional decisions, but here and now, he’s the only one who can. It sucks.</p>\n<p>And the last secret, one of the worst decisions of all, is about Jin Ling.</p>\n<p>Jingyi has only met Jin Ling twice, and didn’t particularly care for him either time. But here’s the thing: Jingyi is currently in possession of hundreds of happy memories about Jin Ling’s parents (especially his mother) that Jin Ling will never have, and that is…unspeakably unfair, is what it is. It’s bad enough with Sizhui, who’s a friend, but how would Jin Ling feel, knowing that some asshole stranger remembers his parents when he can’t?</p>\n<p>(Further on the list of things upsetting Jingyi: Jin Ling’s courtesy name is Rulan. Senior Wei named him. Senior Wei named him after <i>Hanguang-jun</i>. It’s just a never-ending parade of tragedy and missed opportunities, and Jingyi can’t handle it. He had a sheltered childhood, okay? He <i>wasn’t prepared</i>.)</p>\n<p>Anyway, Jingyi can’t tell Jin Ling about Senior Wei. Out of sheer self-preservation, he can’t. That said, he’s got to do <i>something</i> about Jin Ling’s deal, because what he’s learned from sharing brain space with the Yiling Patriarch is that said Yiling Patriarch would never, ever have killed Jin Ling’s parents. Yeah, he thinks he lost control, and maybe he did? But he has those nightmares about a second flute, and Jingyi’s inclined to believe them, even if Senior Wei thinks it was just a hallucination. (To be fair, he was hallucinating kind of a lot back then.)</p>\n<p>But it’s just easier to believe someone would set Senior Wei up than it is to believe he’d lose control of his cultivation. Senior Wei worried about his cultivation all the time—he spent a huge amount of energy trying to keep it in check. But politics? Yeah, he didn’t give a single fuck about that. In fact, he went around alienating everybody with power in the cultivation world like it was his <i>job</i>. Nie Mingjue, who was Chifeng-zun, who was the actual general in charge of the war, once asked a totally reasonable question about why Senior Wei took a hard left into shady cultivation for no apparent reason, and Senior Wei told him to go piss up a rope.</p>\n<p>Senior Wei was barely older than Jingyi back then. He was messed up to begin with, and then he lost his golden core and got basically tortured for three months, so it’s no surprise that he made a huge number of stupid-ass decisions. It’s not really his fault, but…</p>\n<p>Well, he made himself an enormous target pretty much on purpose. And that would’ve been his prerogative if he’d just kept that target on himself, but no. Instead, he ran off with a bunch of people who <i>also</i> had targets on them, so their two targets combined into one bigger target, and he <i>still</i> didn’t make any effort to patch up his public image. Worse—he deliberately cut all the helpful ties he did have.</p>\n<p>Basically, if somebody wanted to frame Senior Wei, they could’ve used the frame Senior Wei built around himself with his own two hands. He gift-wrapped himself. If there’s a point at which political stupidity becomes criminal, Senior Wei blew right past it, and it got practically everybody he ever promised to protect killed.</p>\n<p>(Jingyi is keeping these thoughts buried very, very deep down. Firstly, because there’s no point in sharing them—Senior Wei is dead, so he can’t mess up like that again. Being dead means never having to learn from your mistakes. Secondly, because Jingyi knows he would’ve fucked everything up just as badly, if differently, if it’d been him in Senior Wei’s place. And finally, because the last thing Senior Wei’s fragile sanity needs is him knowing Jingyi blames him a little for getting his favorite people killed. But wow. <i>Wow</i>, Senior Wei. At least he’s a great cautionary tale.)</p>\n<p>Anyway, bottom line: if somebody set Senior Wei up, which would’ve been incredibly easy, it means somebody other than Senior Wei killed Jin Ling’s parents. And that somebody is probably still alive.</p>\n<p>Which may just mean that Jin Ling is on borrowed time.</p>\n<p>…Yeah, no. Jingyi’s not figuring this one out alone. This is wholesale murder conspiracy stuff. It’s not personal at all, and that means he can totally cry to Sizhui about it. He can cry to <i>Zewu-jun</i> about it, even if that’ll make Senior Wei throw a tantrum.</p>\n<p><i>Cry to Nie Huaisang about it</i>, Senior Wei suggests after Jingyi fills him in on the Jin Ling-related brooding. <i>He’s a schemer</i>.</p>\n<p>This is weird advice from a guy who’s been very serious, grim, and determined on the subject of Jin Ling’s safety up to now.</p>\n<p>…<i>Nie Huaisang?</i> Jingyi asks hesitantly. <i>Head-Shaker Nie Huaisang? The guy who responds to every single question with, “I don’t know, I don’t know anything”? </i>That <i>Nie Huaisang?</i></p>\n<p>Senior Wei laughs for a long time, warm and fond. <i>Nie-xiong is one of the smartest people I know</i>, he insists. <i>He’s a ball of nerves, he hates responsibility, and he’s not great at fighting, but he’s</i> sharp, <i>especially about people. He may be pretending not to know anything, but he is pretending. Go ahead, ask him—see if he’ll slip up a little because you’re young</i>.</p>\n<p>Huh. Senior Wei thinks the Head-Shaker has been fucking with everybody for a decade, and if anybody would recognize that kind of thing, it’d be Senior Wei. That’s…Jingyi is actually not as surprised by that as he should be. Sect Leader Nie gravitates like a little moon toward anybody talking shit at every single public event, which is the sign of a gossip, a shit-stirrer, or a schemer, right?</p>\n<p>So Jingyi waits until he’s relieved from guard duty and hunts down Sect Leader Nie. It’s not hard, because Senior Wei seems to know all of the man’s possible hiding spots. Because they were friends who went to school together here.</p>\n<p>Jingyi’s trying not to think about it.</p>\n<p>They find him in the third place they look. Sect Leader Nie is sitting on the rocks overlooking the stream closest to the visiting disciples’ quarters, which makes Senior Wei feel all wistful for some reason.</p>\n<p>As for Sect Leader Nie, he’s looking very…sad and exhausted? He definitely never looks like that when he thinks somebody’s watching. Is Jingyi going to have to start worrying about him, too? The Sunshot generation is so stressful.</p>\n<p>“Sir?” he says quietly, politely ignoring the way Sect Leader Nie jumps and almost flails his way right into the water. “Sorry to bother you. I just had a question. About, um. Politics?”</p>\n<p>“…You’re asking me about politics?” Sect Leader Nie asks incredulously, rebalancing himself on his rock, pulling his fan out of his belt, and abruptly looking convincingly airheaded and Head-Shaker-like. “<i>Me?</i>”</p>\n<p>Senior Wei laughs, and Jingyi smiles. Jingyi totally would have bought this act if Senior Wei weren’t in his head, and he’s impressed. Sizhui is his best friend—he’s very used to people with lying faces, and still, he would’ve fallen for this. He thinks Sect Leader Nie may just be a shit-stirrer <i>and</i> a schemer. “Yes, sir. I know somebody who went to school with you here, and he claims you can help. I don’t know, Sect Leader Nie. He’s a weird guy.”</p>\n<p>Sect Leader Nie peers curiously over his fan. “And who is this friend of yours?”</p>\n<p>“He said he wanted to remain nameless,” Jingyi explains. “And then he cackled.” He is, in fact, cackling right now. He’s not as funny as he thinks he is.</p>\n<p>Sect Leader Nie’s eyes narrow slightly. “…Do you know how to play Inquiry?”</p>\n<p>Jingyi blinks. Non-Lans do not usually know about Inquiry. Then again, the Nie brothers have always been close with Zewu-jun, so. “No? My friend Sizhui does, though.”</p>\n<p>“Hm,” says Sect Leader Nie, closing his fan gently and tapping it against his lips. “You know some interesting people.”</p>\n<p><i>He thinks you’re talking to dead me</i>, Senior Wei explains. <i>And I mean…he’s not wrong. Tell him that fan is a cheap knockoff compared to his favorite one.<br></i><br><i>I am </i>not <i>telling him that</i>, Jingyi hisses, appalled. It’s a lie, anyway. That fan probably costs more than Jingyi’s life.</p>\n<p>“Well, since we apparently have an acquaintance in common,” Sect Leader Nie says, smiling and fanning himself idly. “I’ll do my best to answer your question. But I really don’t know anything about politics.”</p>\n<p><i>Such a bullshit artist</i>, Senior Wei says fondly. <i>Be very general, because there’s no way he’ll answer a detailed, real-life question right now. Look at that face. He knows nothing </i>professionally<i>, and he’s not gonna fuck that up for you</i>.</p>\n<p>Jingyi resists the urge to roll his eyes, but follows the advice. When this is over, he is totally crying to Zewu-jun about the Jin Ling problem. With <i>names</i> and <i>details</i>.</p>\n<p>“Okay, so. I think…one of my friends might be in trouble? Like. A lot of people around him have dropped dead. Most of the adults in his life, actually. And his parents’ deaths got blamed on this one guy, but then that guy also conveniently dropped dead. I guess I’m asking how you can tell if there’s a massive conspiracy around your friend. Like, how much should I be worried about him? And how would you figure out who set that up, if somebody actually did?”</p>\n<p>Sect Leader Nie gazes at Jingyi over his fan, looking confused and worried and not at all like someone with insight into politics.</p>\n<p>“Well,” he murmurs eventually, “this is probably not very good advice—you should really be asking your seniors about this kind of thing, you know—but if I had to <i>guess</i>…I’d say that when you find a series of events that appear connected, but have no obvious instigator, the first thing to ask yourself is who benefits.”</p>\n<p>“Who…benefits?”</p>\n<p>“Mm, I think so. Say some people die, others are disgraced, a few more weakened—the first place you look for suspects is in the group that ends on top. Not that that’s a guarantee. Opportunists aren’t necessarily instigators, and some instigators don’t do a good job of taking advantage of the chaos they created. Still, it’s a good place to start. I would think.”</p>\n<p>“…So the whole Head-Shaker thing really is bullshit, huh?” Jingyi says, one shit-stirrer to another.</p>\n<p>Sect Leader Nie flaps his fan around in a panic that might even be real. “I don’t know what you mean! It’s just something I read in a book, and probably not even good advice! You shouldn’t have asked me!”</p>\n<p>Senior Wei is laughing again. Of course he is. He’s part of their shit-stirring club, too.</p>\n<p>Jingyi has one more question, and he probably shouldn’t ask it, but Sect Leader Nie used to be Senior Wei’s friend and already thinks Jingyi is talking to his ghost. He’s asking. “Do you think somebody took down Se—the Yiling Patriarch on purpose?”</p>\n<p>Sect Leader Nie goes very still, then snaps his fan closed and smiles at Jingyi with all the warmth and sincerity of a shark. “Oh, I really don’t know,” he says. “I don’t know anything. It was nice to meet you, Lan Jingyi.”</p>\n<p>He stands up and starts to walk away, but pauses. “If you speak with my friend again,” he says quietly, seriously, not turning around, “tell him…that I’m grateful to him. For teaching me how to fish.”</p>\n<p>And then he’s gone.</p>\n<p><i>Well</i>, says Senior Wei after a while. <i>Good news, Jingyi! We don’t have to worry about Jin Ling after all, because I’m pretty sure Nie Huaisang figured everything out. I think he thinks there is a bad guy, and he’s probably going to kill the bad guy for us. Because that sure looked…how did his brother die, again?<br></i><br><i>Qi deviation.<br></i><br><i>Hm. I wonder if Nie-xiong agrees</i>, Senior Wei murmurs. <i>I wonder if he thinks the same guy got me </i>and <i>his brother? Because he wouldn’t get that upset over just me. I feel like if somebody took out his brother, though, that somebody is a dead man walking</i>.</p>\n<p><i>Since when is Sect Leader Nie</i> terrifying? Jingyi demands.</p>\n<p><i>He’s usually not</i>, Senior Wei says thoughtfully. <i>But you know, I always thought he could be, if you pushed him hard enough. And if somebody killed his brother and made it look like qi deviation? If that’s not a push, I don’t know what is</i>.</p>\n<p>That…makes sense, actually.</p>\n<p><i>Wait</i>, Jingyi says after a second. <i>How did he know my name?!</i></p>\n<p>Senior Wei just laughs unhelpfully.</p>\n<p>* * *</p>\n<p>Since there’s an actual, living adult dealing with the evil conspiracies in the cultivation world, Jingyi’s decided to ignore all that for now and just live his life. Mess around with Sizhui and Senior Wei. Have tea with the parents. Go on night hunts. Practice the regular way. Practice while possessed.</p>\n<p>Possessed practicing is secretly his favorite—he’s learning by deranged leaps and bounds. It’s so fun. There’s no <i>lift your arm like this, bend your knees like that</i>. There’s not even any manhandling into the right position, which you’d think would be good enough, but somehow isn’t.</p>\n<p>Nope, it’s just his body magically doing the right thing until he learns to imitate it. He has never had this much fun learning anything, ever, in his life.</p>\n<p>“Jingyi, your improvement is remarkable,” Uncle says one day, maybe eight months post-possession. He sounds proud, which is nice, but also confused, which is insulting.</p>\n<p><i>It turns out that being possessed is just an advanced form of cheating</i>, Jingyi thinks but does not say. He thinks it loud enough for brain guests to hear, though, because Senior Wei laughs.</p>\n<p>It’s a shame that it’s Jingyi’s favorite pastime that causes his next personal crisis.</p>\n<p>It’s just that, after the whole monster deer fiasco, he decided to work hard on archery. Work hard with a side of Senior Wei cheating, so by now he’s really damn good at archery.</p>\n<p>He’s so good he’s managed to beat Sizhui.</p>\n<p>“Jingyi,” Sizhui says, beaming and delighted, “that was amazing! You’ve improved so much.”</p>\n<p>He just…he just kicked Sizhui’s ass at archery. This isn’t right. Like, sure, under normal circumstances, it’d be cool to kick Sizhui’s ass for once, but not if it’s because Sizhui’s <i>dad</i> taught him how.</p>\n<p><i>Hey, I’m a pretty good teacher</i>, Senior Wei says, pleased with himself. Because he doesn’t <i>know</i>. He doesn’t know he just taught some random kid to beat his own son at archery. His son, who’s related to <i>Wen Ning</i>, who was <i>so fucking good</i> at archery.</p>\n<p>Jingyi is a thieving bastard traitor.</p>\n<p>…<i>Why are you having a meltdown over being good at archery, kiddo?</i> Senior Wei asks worriedly.</p>\n<p>“Jingyi?” Sizhui asks, equally worried, grabbing his arm. “What’s wrong?”</p>\n<p>Jingyi is not just a traitor, he’s a traitor to two of the best people in the world.</p>\n<p>“Senior Wei is going to take over my body and teach you,” Jingyi decides. It’s the only way he’ll be able to live with himself.</p>\n<p><i>What?<br></i><br>“What?! Jingyi!”</p>\n<p>“You don’t hang out enough!” Jingyi insists, because he really can’t, he <i>can’t</i> take this from Sizhui. It’s bad enough as it is.</p>\n<p><i>What is going on with you?</i> Senior Wei asks with deep suspicion, sounding disturbingly like Jingyi’s mom.</p>\n<p><i>I can’t have you making me better at archery than Sizhui, but I’m not telling you why</i>, Jingyi belligerently fails to explain. <i>Make him better than me again or I will freak the hell out</i>.</p>\n<p><i>And here you’re always telling me</i> I’m <i>a mess</i>, Senior Wei murmurs, more troubled than amused. <i>Okay, Jingyi. If that’s what you want. Into the jelly with you!</i></p>\n<p>They spend the rest of the day with Senior Wei in charge and Jingyi eavesdropping and adding helpful commentary. By the end of the day, Sizhui’s back to being a little bit better than Jingyi. It’s a relief.</p>\n<p>Both Sizhui and Senior Wei spend the next week fretting about Jingyi whenever they think he’s not paying attention, which is…not great. But it’s better than being a traitor thief.</p>\n<p>* * *</p>\n<p>Despite the incredible amount of bullshit Senior Wei’s been through, he’s a surprisingly cheerful person. He’s like Sizhui that way—they’d both be justified in being miserable and bitter at the whole damn world (Jingyi sure would be if he’d lived either of their lives), but instead, they’re weirdly upbeat.</p>\n<p>…Most of the time.</p>\n<p>Sometimes, though, Senior Wei has low days. He’s not mad at everyone like Jingyi would be, and he’s not like Sizhui on a bad day, either—Sizhui spends his bad days restless and freaked out about hypothetical disaster scenarios. With Senior Wei, it’s like he just wants to lay on the ground and sleep for a thousand years. He actively daydreams about his bones turning to mulch and flowers growing out of them. When he’s not doing that, he’s busy brooding about his failures and all his favorite dead people and the fact that he’ll never talk to Hanguang-jun again, and like. He’s clearly not okay.</p>\n<p>And today’s worse than most. Jingyi thinks it must be the anniversary of something, but if it is, Senior Wei hasn’t mentioned it, and Jingyi’s definitely not going to ask. He’s got enough horrifying Senior Wei memories floating around in his head as it is.</p>\n<p><i>He’s gone again?</i> Senior Wei asks dully.</p>\n<p>He means Hanguang-jun. He pretty much always means Hanguang-jun.</p>\n<p><i>He spends about half of his time out on night hunts, or else just looking for trouble</i>, Jingyi explains. <i>He wasn’t like that when you knew him? I thought that was how he got his name.<br></i><br><i>There was a war</i>, Senior Wei explains in an inflectionless monotone that isn’t like him at all. <i>Trouble came to us</i>.</p>\n<p>Okay, yeah, that makes sense. <i>Oh. Well, he travels a lot now, but the rest of the time, he helps train us. Though I guess he usually takes us traveling with him. We see a lot of him, but not in the Cloud Recesses. I hadn’t thought about that</i>.</p>\n<p>Now that he is thinking about it, it’s kind of weird. As is the way Hanguang-jun almost never goes to cultivation conferences or banquets or any other kind of formal gathering where he might be trapped in an enclosed space with non-Lan cultivators.</p>\n<p>It’s totally because Hanguang-jun is super-pissed at every single sect about the way Senior Wei died, isn’t it? It definitely is. Jingyi’s not sure whether mentioning that to Senior Wei would help or hurt. He’s guessing hurt.</p>\n<p><i>He always loved Gusu</i>, Senior Wei says unhappily. <i>He was always trying to drag me back here to fix me. And now he’s not even here himself</i>.</p>\n<p>Jingyi has no idea what to say to this. He tries, <i>Fix you?<br></i><br><i>Oh yeah, he thought he could music the demonic cultivation out of me or something</i>, Senior Wei says dismissively, with a cruel edge that could be aimed at Hanguang-jun or himself or both of them. <i>Get my evil ass under control.<br></i><br><i>…That doesn’t sound like him, Senior Wei</i>.</p>\n<p><i>Maybe not him now. But him then?</i> Senior Wei shows Jingyi a slew of memories of Hanguang-jun lecturing him about demonic cultivation and ordering him back to Gusu. Attacking him. Shouting at him in an angry panic. God, everything Senior Wei was doing must’ve seemed like total insanity to him. Because Senior Wei wouldn’t explain anything!</p>\n<p><i>So he was freaking out</i>, Jingyi concludes. <i>Pretty sure he was trying to save your life</i>.</p>\n<p>Senior Wei laughs, but it’s an ugly sound. <i>Maybe you’re right.</i> <i>Ah, Lan Zhan. So good. But if that was what he wanted, he was too late. They say no one who’s thrown into the Burial Mounds makes it out alive, and it’s true. It just took me and the Wens a little longer than usual.<br></i><br><i>Well, Si—Wen Yuan made it out</i>, Jingyi snaps, scared and mad about it. <i>So that’s bullshit</i>.</p>\n<p>Senior Wei’s mood lifts, just a little. <i>That’s right</i>, he says. <i>That’s right! A-Yuan is alive. I guess even the Burial Mounds are no match for Hanguang-jun if he decides to save you.</i></p>\n<p>Jingyi cannot reach into his own brain and hit someone, but he really wishes he could. <i>Maybe it’s more if someone will</i> let <i>Hanguang-jun save them</i>.</p>\n<p>Senior Wei sighs. <i>Don’t be mad at me, Jingyi, </i>he mutters<i>. I’m not having a great day</i>.</p>\n<p>Obviously not, but that doesn’t mean Jingyi is going to sit here and let him brood himself into a meltdown.</p>\n<p><i>This isn’t a meltdown, you big baby</i>, Senior Wei complains, tired. <i>This is just normal being sad.<br></i><br><i>It’s really not</i>, Jingyi informs him.</p>\n<p><i>It is for me</i>, Senior Wei corrects with self-directed contempt. <i>Another gift from the Burial Mounds</i>.</p>\n<p>Which means Senior Wei feels like this regularly, and has for years. It’s not even weird for him. That’s…very fucking unfair, actually, because Jingyi hasn’t felt this much sadness for more than about ten minutes in his whole life. Even Senior Wei’s previous bad days were nothing like this. Which is good in the sense that it means this doesn’t happen to Senior Wei all the time, but <i>still</i>.</p>\n<p>…<i>Do you want to go visit the rabbits?</i> Jingyi asks tentatively. <i>You can have the body and pet the rabbits</i>.</p>\n<p>Senior Wei sighs again, tired but fond. <i>You’re a good kid, Jingyi</i>, he says, making Jingyi feel even more obscurely guilty. <i>Yeah, sure. Let’s pet the rabbits</i>.</p>\n<p>They go pet the rabbits. It seems to make Senior Wei feel a little bit better after an hour or so, but it’s a whole damn week before he’s anything close to normal.</p>\n<p>Jingyi’s going to make Sizhui do research and see if there’s music that can help with stuff like this, because…well. If they can help, they ought to, basically.</p>\n<p>* * *</p>\n<p>The circumstances of the Sad Attack get Jingyi thinking about Senior Wei’s relationship with Hanguang-jun again, which is a fruitless waste of time, but Jingyi just can’t let it go. Why the hell doesn’t the man understand that he’s in love with Hanguang-jun? Except that sometimes it seems like he <i>does</i> understand, but he doesn’t want to. It’s like when he’s trying to lie himself into believing he’s fine. And that makes <i>no sense</i>.</p>\n<p>Jingyi decides to leave that problem for a while, though, figuring he’s blurted out more than his fair share of opinions about Senior Wei’s life lately. Besides, the odds of getting a reasonable reaction out of him improve by the day, since Sizhui did research like the good student he is, and is now playing them <i>two</i> brain- and spirit-calming songs every night, which seem to be helping.</p>\n<p>Basically, Sizhui is the best person in the entire Cloud Recesses. Possibly in the world. (And the Jins would kill him in a second if they ever figured out who he is. That keeps occurring to Jingyi, usually in the dead of night when he’s trying to sleep.)</p>\n<p>So a month of study, relaxing, night hunts, and healing music goes by, and Jingyi manages not to worry too much about Senior Wei’s love story. But then Hanguang-jun comes home for a week, bringing it all up again, and now feels like as good a time as any to pursue it. It’s technically none of Jingyi’s business, sure, but the curiosity is killing him. And, well, it feels unfair on Hanguang-jun that Senior Wei hasn’t even <i>noticed</i> falling in love with him.</p>\n<p>With this in mind, Jingyi picks a time in the library when he’s pretty sure they’ll be alone, and sets out to have a rational (if nosy) talk about feelings with Senior Wei.</p>\n<p>He should know better by now.</p>\n<p><i>What do you </i>mean<i>, how do I know you love him?</i> Jingyi demands ten frustrating minutes in. <i>I know because you swoon every time you think about him—which is </i>always<i>, by the way—and you swoon twice as hard every time you see him! That’s how!<br></i><br><i>I’m not swooning</i>, Senior Wei insists defensively, apparently under the mistaken impression that this is the truth. <i>He’s just…it’s just that he’s my favorite person. Sizhui is</i> your <i>favorite person, and you don’t see me accusing you of being in love with him</i>.</p>\n<p>Jingyi sighs and, in desperation, shows the emotions he has when Sizhui walks into a room to the freaking Yiling Patriarch.</p>\n<p>Happiness. Ease. Excitement if it’s been a long time. The urge to be close. A desire to check on his health and general cheerfulness.</p>\n<p>Then he loudly remembers what Senior Wei feels like when Hanguang-jun walks into a room, which is all of that but more intensely, with a side of <i>I’ll die if he doesn’t look at me</i> and an only slightly buried desire to peel him out of his clothes and lick him. Among other things. So many other things. (That’s right: Jingyi is never going to be able to look Hanguang-jun in the eye <i>ever again</i>.)</p>\n<p>It feels like he’s showing pictures of a dog and a tiger to a small child. Yes, small child, they are both furry creatures with tails, but they are nonetheless <i>very different creatures</i>.</p>\n<p><i>Maybe I’m just a needier person than you are</i>, suggests Senior Wei, and Jingyi groans in despair and lets his head fall to the desk with a thud.</p>\n<p>And why is he trying, anyway? What does it prove? Senior Wei is <i>dead</i>. This love story is already a tragedy, and nothing Jingyi does can change that now. Even if it does seem like more of a tragedy that half of the love story doesn’t realize he’s in one.</p>\n<p><i>Jingyi</i>, says Senior Wei, and there it is. He’s sad again. Jingyi made him sad. <i>I can’t be in love with Lan Zhan</i>.</p>\n<p><i>Why not?</i> Jingyi asks, dreading the answer.</p>\n<p><i>Because…from the second I lost my golden core, it was impossible. Before that, he was the first person who ever—we were equals. He understood me, and I understood him. We matched each other. It was something I’d never had before, and it was amazing. And then it was gone. We were equals, and then we weren’t. And a relationship like that…no. I couldn’t, and neither could he. Even if I’d told him everything, even if he’d trusted me—he’s such a strong cultivator. He would’ve lived a long, healthy life, and I would’ve died horribly and young. I </i>did<i> die horribly and young. We couldn’t have been in love, Jingyi. That would’ve ruined both of us</i>.</p>\n<p>Oh, it’s worse than Jingyi thought, so much worse. Senior Wei is in denial on <i>purpose</i>, to keep what’s left of his <i>sanity</i>, and Jingyi’s been standing here throwing rocks at the glass house he lives in. Meanwhile, Hanguang-jun is definitely in love with Senior Wei, and it <i>did</i> ruin him, and pointing that out to Senior Wei would be just. Super not helpful.</p>\n<p><i>I’m sorry</i>, Jingyi says, trying not to cry.</p>\n<p><i>What are you sorry for?</i> Senior Wei asks, brightening up through sheer force of will. <i>You don’t even have a love life to be sad about.<br></i><br><i>Hey!</i></p>\n<p>The conversation gets sidetracked into a brutal discussion of Jingyi’s lack of game, but whatever, it’s still less awful than talking about Senior Wei’s ongoing tragedy of an existence.</p>\n<p>Jingyi takes them out to steal a snack and pet the rabbits, anyway. They require food and rabbits.</p>\n<p>* * *</p>\n<p>Jingyi wakes up one day in the summer and realizes it’s been ten months to the day since he got possessed. He shares this thought with Senior Wei, who’s as weirded out by it as Jingyi is.</p>\n<p>Because they’re more than just used to it, now. It hasn’t even been a year, and already the idea of not sharing his every third thought with Senior Wei and having a running commentary on his life choices is…scary.</p>\n<p>Zewu-jun hasn’t given up, though. He’s been having monthly chats about possession with Jingyi and Senior Wei this whole time, for all the good it does. Still, it’s fun to see so much of him. Jingyi isn’t Sizhui—he’s never spent this much time with his sect leader before. It’s a nice thing, to know that you like your sect leader as a person, on top of just respecting him.</p>\n<p>After Jingyi chats with Zewu-jun, Senior Wei chats with him, too, and he lets Jingyi listen in now, which Zewu-jun…probably doesn’t realize, but oh well. At first they just frantically brainstormed about exorcisms, but as time’s gone by, they’ve drifted more and more toward bullshitting about weird cultivation stuff and worrying about Hanguang-jun’s happiness together. It’s cute. They’d be such good in-laws if Senior Wei weren’t, well. Dead.</p>\n<p>Jingyi never tells Zewu-jun that he sort of likes being possessed, because that would horrify the poor man. But it’s true.</p>\n<p><i>You think that now</i>, Senior Wei says with a mental smirk. <i>But someday you’ll fall in love with someone, and you won’t want me looking over your shoulder then. You can’t even handle it when I catch you—<br></i><br><i>SHUT UP,</i> Jingyi shrieks, desperate not to think about how that sentence was going to end. <i>I hope you’d have the decency to hide in the brain cabinet if I fall in love!</i></p>\n<p><i>Hm…maybe</i>, snickers Senior Wei.</p>\n<p><i>Senior Wei!<br></i><br>Senior Wei just cackles at him.</p>\n<p>Okay, so the rest of Jingyi’s life is going to be agonizingly embarrassing. Fine. Great.</p>\n<p>He’s still pretty sure it’s worth it.</p>\n<p>* * *</p>\n<p>At the very end of summer, there’s a cultivation conference in Lanling. Jingyi talks his way into going and then panics as soon as he succeeds.</p>\n<p><i>I thought we were letting Nie Huaisang handle my nephew’s safety</i>, says Senior Wei. And then, after a pause, <i>Wow, let’s pretend I never said that</i>.</p>\n<p>Jingyi rolls his eyes. <i>Even if we do let him handle Jin Ling’s safety, he can’t do anything about Jin Ling’s happiness. That’s </i>your<i> job. Well, ours, now, since you’re freeloading in my head or whatever.<br></i><br><i>Freeloading, I like that</i>, Senior Wei says indignantly, like Jingyi can’t feel how amused he is. <i>I’ve given you so much valuable instruction! Who’s the real freeloader?<br></i><br>He has a point, but Jingyi doesn’t have to admit it.</p>\n<p>Zewu-jun is the one who takes them to the cultivation conference, since obviously Hanguang-jun wouldn’t be caught dead there—he hates cultivation conferences in general, but he hates Lanling special. (Jingyi informs Senior Wei of this, and Senior Wei responds by showing off a bunch of memories of Hanguang-jun sitting silently and alone at any number of social occasions with a face like he’s actually being tortured. It’s amazing.)</p>\n<p>In the end, the only people who go are Zewu-jun, Jingyi, Sizhui, and six of the baby juniors who’ve never left Gusu before for anything but night hunts. Possibly because talking with Senior Wei all the time has made Zewu-jun kinda suspicious of the Jins. Anyway, Koi Tower is going to blow the baby juniors’ minds.</p>\n<p>And maybe it does, but Jingyi doesn’t get to appreciate it, because the first thing they see at Koi Tower is Jin Ling’s dog, and the first thing Senior Wei does is freak the hell out. Once that’s happened, Jingyi can’t pay attention to anything else.</p>\n<p>It’s weird, but he and Senior Wei have never gotten close to a dog before. There aren’t any in the Cloud Recesses, obviously, and in Caiyi, or on the road, or during night hunts, there’ve only been a couple dogs here and there, far away. Jingyi didn’t even notice that Senior Wei was bothered.</p>\n<p>But Fairy comes right up to them, as she does to all people she’s vaguely familiar with, and gives them a sniff. Because she’s just as nosy and high-handed as her owner, basically.</p>\n<p>Senior Wei promptly treats Jingyi to a <i>whole parade</i> of hideous memories, and <i>wow</i>. Sure, dogs show up in the nightmares, but only in situations where anybody would be scared of a dog. Jingyi didn’t realize it was a <i>thing</i> with Senior Wei. But oh boy, he knows now, and he knows why.</p>\n<p>Dogs chasing baby Wei Ying through the streets of Yiling. Baby Wei Ying desperately clubbing at the head of a dog that had hold of his calf and was shaking it, refusing to let go. Baby Wei Ying stumbling across the half-eaten body of another street kid he vaguely knew. Baby Wei Ying watching a dog walk down the street with a skeletal, human arm in its mouth.</p>\n<p>And yeah, the half-eaten kid was probably dead before the dogs got there—dogs are scavengers more than hunters. Also, given what Jingyi knows about the Burial Mounds, the person the arm belonged to was almost definitely already a skeleton by the time the dog found it. But still. <i>Still</i>.</p>\n<p>Jingyi flinches away from Fairy before he knows what he’s doing.</p>\n<p>Did…did Senior Wei just give Jingyi a brand new phobia? <i>Did he?</i> Is that a thing?! Can you just pass around phobias like that?!</p>\n<p>Fairy marches closer because she’s also as insensitive as her owner. Jingyi cringes back behind Sizhui. He can’t help it.</p>\n<p>This is <i>bullshit</i>. He is training himself out of this. He refuses to live like this. It’s not even his trauma! It’s ridiculous.</p>\n<p>…Just knowing dogs can <i>do</i> that, though…</p>\n<p>No! He refuses to be afraid of dogs for the rest of his life. Humans can sure be monsters, too, but he doesn’t cower away from all of <i>them</i>, does he? He does not!</p>\n<p>“Jingyi?” Sizhui asks, clearly worried about why his best friend has suddenly decided to be terrified of a fluffy, spoiled, fat dog.</p>\n<p>“Senior Wei is very afraid of dogs,” Jingyi explains in a whisper. “He has a lot of good reasons to be afraid of them, and now I know those reasons, and I can’t unknow them. I’m going to have to train myself out of being scared of dogs, Sizhui. I hate everything.”</p>\n<p>“…Is he okay?” Sizhui whispers back, worried. Sizhui’s the best.</p>\n<p>“He’s locked in the brain cabinet, so probably not. But at least he doesn’t know the dog is still here.”</p>\n<p>Sizhui nods and obligingly shoos Fairy away, but the damage is done.</p>\n<p>Well, Jingyi <i>thought</i> the damage was done, but actually Senior Wei comes out of the brain cabinet before they’ve even made it to their rooms, full of brittle cheer, faintly embarrassed, acting like nothing happened. Makes sense, really. If Senior Wei couldn’t bounce back fast from horrible nightmare shit and at least convincingly pretend to be fine, he’d never have gotten anything done.</p>\n<p>That night, there’s a welcoming dinner. It’s…fine. The food’s good, there are dancers, it’s all very pretty. Zewu-jun is scarily polite to everyone, the Chief Cultivator wanders around creepily knowing everyone’s name, Nie Huaisang has mild hysterics whenever anyone asks him a serious question. It’s a cultivation conference. Whatever.</p>\n<p>It would be better if Jingyi could stop himself from staring guiltily at Jin Ling, who looks like he’s only having a slightly better time at this dinner than Hanguang-jun would be. And of course Senior Wei feels guilty about Jin Ling, too, so Jingyi’s guilt is feeding Senior Wei’s guilt and it’s a problem. Jingyi should really just stop staring at Jin Ling, but what he actually does is stare so much that Sizhui has to elbow him for being rude.</p>\n<p>“Sen—my ghost knew Jin Ling’s parents,” Jingyi explains in a whisper.</p>\n<p>Sizhui’s eyes go wide. “Oh. Of course he would. I…why didn’t I think about that?”</p>\n<p>“I think about it all the time, and I feel like <i>crap</i>, Sizhui. And he feels even more like crap.”</p>\n<p>Sizhui’s smiles his helpful, determined smile. “I’ll get you some time alone with Jin Ling.”</p>\n<p>Jingyi nods gratefully. Sizhui understands the value of learning about family. Of course he does, because he’d kill to know more about his own family. Jingyi, meanwhile, knows a ton of stuff about Sizhui’s family, but can’t figure out a way to tell him without explaining Senior Wei. Ugh, he’s going to have to set aside time to rethink all his decisions for the five hundredth time.</p>\n<p>He would like to go back to not knowing anything. He misses not knowing anything.</p>\n<p>* * *</p>\n<p>It takes Sizhui less than a day to maneuver Jingyi and Jin Ling into a hallway in Koi Tower alone together.</p>\n<p><i>Sizhui is scary</i>, Senior Wei murmurs proudly. And he is correct.</p>\n<p><i>Okay</i>, Jingyi says, psyching himself up. <i>We’re here. We can do this. We are talking to Jin Ling</i>.</p>\n<p><i>Jin Ling has probably been raised to believe I’m the evilest bastard that ever lived and also I murdered his parents</i>, Senior Wei points out, not for the first time.</p>\n<p><i>Yeah, well, we’re going to pull a Sizhui and tell the technical truth while secretly lying our asses off.<br></i><br><i>Sounds fun</i>, Senior Wei allows, amused.</p>\n<p>Jingyi squares his shoulders and marches over to Jin Ling for what is sure to be one of the most uncomfortable conversations of his life.</p>\n<p>The first part goes okay, though, because Jin Ling is so obviously bewildered by Jingyi approaching him. He looks a weird mix of hopeful and suspicious, like a puppy who wants a friend but expects a kick.</p>\n<p>This talk hasn’t even started, and already Jingyi feels like a terrible person.</p>\n<p>Suspicious but apparently brave (or stupid), Jin Ling agrees to go to a private courtyard alone with Jingyi. It’s a pretty courtyard. It’s got a lotus pond, which instantly drops Senior Wei into the depths of nostalgia and grief and despair, so that’s. Fun.</p>\n<p>“Right,” Jingyi says once they’re sitting in a reasonably isolated location. “I’m possessed.”</p>\n<p>“…Uh, okay?” Jin Ling frowns. “Tell your sect leader, not me.”</p>\n<p>Jingyi is making a mess of this already. “No, that’s not—he’s a nice ghost, there are complications—that’s not the point! The point is, we share memories sometimes. Which means I have a lot of memories about…people…that I have no right to. So I’m trying to, I don’t know. Make it fair.”</p>\n<p>Jin Ling is outright scowling now, which is at least a normal Jin Ling expression, and easier to handle than the earlier hopeful/scared look. “And? What’s it got to do with me?”</p>\n<p>“My ghost—he was Yunmeng Jiang.” Ugh, and <i>that</i> makes Senior Wei sad, too. “He fought in the Sunshot Campaign. He…he knew your parents really well. Especially your mom—who was <i>awesome</i>, by the way. So, I’m saying, just. If you have any questions about them. Or. Any stories or anything you want to know? I can ask him, and pass along what he knows. Things your uncles might not know, or might be too sad to tell you, or whatever.” He’d like to let Senior Wei talk to Jin Ling directly, but he also feels like Senior Wei would find a way to fuck that up, either by getting found out or by not being willing to tell enough stories.</p>\n<p>“…My mom was awesome?” Jin Ling asks hesitantly after a very long time, promptly breaking Senior Wei’s heart and Jingyi’s as well.</p>\n<p>“Yes,” Jingyi confirms. “The <i>most</i> awesome. She—okay, there’s no point repeating stuff. What have people already told you about her?”</p>\n<p>Jin Ling still looks hesitant and suspicious, which is so fair. “…That she was kind, and patient. She made really good soup. She wasn’t a very good cultivator.”</p>\n<p>Jingyi waits. And waits. And <i>seriously?</i> “That’s <i>it?</i> That’s all they told you?!”</p>\n<p>Jin Ling scowls belligerently. “So what if it is?!”</p>\n<p><i>Oh, Jiang Cheng</i>, Senior Wei sighs, disappointed but not surprised.</p>\n<p>“It’s just…your mom, she was…so she <i>was</i> super sweet, and patient—that’s true. And yeah, she wasn’t great at cultivating, but who cares? She didn’t <i>need</i> to be. She was the only remotely sane person in her whole family, and so damn brave, and like…Sect Leader Jiang is your uncle. You know what he’s like. Your mom? Could get him to do anything. Man, she played him like a qin. She could calm him down or piss him off or make him apologize or whatever. And he wasn’t the only one, either. It’s lucky she decided to use her power for good and not evil, because holy shit. And! When somebody came at her family? She came for their <i>lives</i>. It was <i>amazing</i>. Also she spent the whole Sunshot Campaign right next to the battlefield, holding the wounded down, cleaning them up, patching their injuries, and telling them to pull their shit together and stop screaming. But in the nicest way possible.”</p>\n<p>Jin Ling’s mouth is hanging open. Jingyi hopes that’s out of shocked pride.</p>\n<p><i>It had better be</i>, Senior Wei mutters darkly.</p>\n<p>Jin Ling takes a while to say anything, apparently processing this new information, opening and closing his mouth, swallowing, looking away, trying again. And what he finally manages, in a wobbly, tiny voice, is, “Was…was the soup real? Did your ghost ever have it?”</p>\n<p><i>It was the best soup in the </i>world, Senior Wei insists, and if a bodiless ghost could be crying, he would be crying. Jingyi’s eyes sting in sympathy.</p>\n<p>Sizhui’s had the famous soup, too, come to think of it. Jingyi has a ton of memories of Jiang Yanli, and Sizhui’s had her famous soup, but her kid has nothing of her at all. And a lot of what Jingyi knows about her, he can’t say, because these are Senior Wei’s memories, so he’s a huge part of most of them…but Jin Ling thinks Senior Wei killed his parents. This is so fucked up.</p>\n<p>“The soup was real, and my ghost says it was the best damn soup he ever had,” Jingyi confirms, definitely not crying at all.</p>\n<p>Jin Ling, who is definitely not crying either, sniffles and wipes his eyes and says, “What was my uncle like? When he was a kid? I can’t…I can’t even…he doesn’t seem like he was <i>ever</i> a kid.”</p>\n<p><i>What? He’s the world’s biggest baby!</i> Senior Wei announces. <i>A bossy baby</i>.</p>\n<p>Jingyi firmly ignores him. Even though he’s…not wrong. “Okay, weird but true—Sect Leader Jiang? Was once a goofy kid with a sense of humor. About <i>himself</i>, even. He was mad about everything even back then, yeah, but in a goofy way.”</p>\n<p>“You’re <i>lying</i>,” Jin Ling informs him, eyes wide.</p>\n<p>“I <i>swear</i> I’m not. Look, it freaks me out too, but I have <i>actual memories</i> of him in the Cloud Recesses, like, getting drunk with Nie Huaisang and being bad at flirting and petting bunnies with your mom.”</p>\n<p>“Bunnies,” Jin Ling repeats blankly.</p>\n<p>“Could I make that up?”</p>\n<p><i>Even dead I’m ruining Jiang Cheng’s reputation</i>, Senior Wei reflects with enormous satisfaction.</p>\n<p>Jingyi mentally exchanges a smirk with Senior Wei, and proceeds to tell Jin Ling as many embarrassing-but-fun stories about Sect Leader Jiang as Senior Wei can think up. That done, Jingyi requests stories about Jin Ling’s dad that do not also involve Jin Ling’s dad getting punched. This proves more of a challenge for Senior Wei, but he manages it eventually.</p>\n<p>“Okay, he’s got like…one story? About your dad,” Jingyi says, while Jin Ling stares at him eagerly, an actual smile on his face. (It’s weirdly sweet? Jingyi doesn’t know how to feel about finding anything about Jin Ling sweet.) “I feel like he <i>must</i> have more, but he’s…let’s not get into it. But I’m pretty sure you’ve already heard this one. From when they were in Qishan, and they were supposed to be getting indoctrinated?”</p>\n<p>Jin Ling shakes his head, wide-eyed. “Nobody tells me anything. Holy crap, they tell me <i>nothing</i>.”</p>\n<p>“I’m starting to get that. It’s so weird. Okay! So this was right before the war—it actually helped kick off the war. Sect Leader Jiang and your dad and Hanguang-jun and a bunch of other people—all the heirs and top disciples, basically—were ordered to go to Qishan for indoctrination with the Wen, and the Wen demanded everybody’s swords.” He looks down at Jin Ling’s sword and his eyes widen.</p>\n<p>Jin Ling clings to it and bites his lip.</p>\n<p>“…Yeah. <i>That</i> sword. So they came to take everybody’s swords, and most people just gave them up because, you know, they were outnumbered and surrounded. They were hostages, really. But your dad? He was like, ‘Hey, go fuck yourselves.’”</p>\n<p>“He did <i>not</i> say that,” Jin Ling insists.</p>\n<p>“Okay, not in those words. But it’s sure what he meant. He was ready to start some shit right there, and with seriously scary people who were pretending to be Jin allies at the time. It was dumb, but it was badass, too. He had to get talked down.” Jingyi wishes Senior Wei remembered the person who talked him down better. She’s just a yellow Jin blur, marked friendly. So. A member of the Lanling Jin Sect who Senior Wei actually liked, which you’d think would be pretty damn memorable, but no. He can’t remember her name or her face. He’s such a weird guy.</p>\n<p>And it’s irritating right now, because if that lady’s still alive, Jin Ling should talk to her, because she seemed like she knew his dad really well. Jingyi’s guessing she’s the same friendly female Jin blob who was involved in the Stupid Wartime Soup Drama.</p>\n<p><i>Mianmian</i>, Senior Wei announces helpfully.</p>\n<p><i>Soup lady was called Mianmian?</i> Jingyi asks, delighted. Maybe he can direct Jin Ling toward this person after all. <i>What was her real name?<br></i><br><i>She wouldn’t tell me.<br></i><br>Jingyi can’t even blame her.<i> Was she the same person who talked Jin Zixuan down in Qishan?<br></i><br><i>…Maybe?</i></p>\n<p>Jingyi takes it back: Senior Wei is useless. Now he’s gonna have to ask Hanguang-jun if he knows Mianmian’s real name, and it’s going to be so awkward.</p>\n<p>(Also, Jingyi is <i>never</i> telling Jin Ling about the Stupid Wartime Soup Drama. It made everyone involved except Mianmian and Hanguang-jun look like morons.</p>\n<p><i>Harsh but fair</i>, mutters Senior Wei.)</p>\n<p>“Are you saying my dad was dumb?” Jin Ling demands, cutting into Jingyi’s spiraling thoughts about Soup Drama.</p>\n<p>“Yes,” Jingyi confirms, “but also badass. Seriously, just—brave and honest and cool. On his good days.” On his bad days, he stood around and let his evil relatives pull evil shit and said nothing. But that was clearly a weakness he only had with family. If his family had been less awful, that loyalty would’ve been a strength, so Jingyi doesn’t know how much to judge him for it.</p>\n<p>Senior Wei doesn’t judge him for it, but that’s only because Senior Wei will never actually, honestly forgive Jin Zixuan for making Jiang Yanli cry, the end. Nothing else matters.</p>\n<p>“And his bad days?” Jin Ling asks suspiciously.</p>\n<p>Jingyi shrugs. “Everybody has bad days. Your dad never did anything evil, even on his worst days. And he got cooler every year. If he was still alive now, I’m pretty sure he’d be awesome.”</p>\n<p>Jin Ling seems unsatisfied with this, but lets it go. Jingyi waits for further questions.</p>\n<p>Jin Ling does have a further question. And it’s a doozy. “You didn’t…mention…Wei Wuxian.”</p>\n<p>“I thought you’d be weird about it,” Jingyi says frankly, while the aforementioned Wei Wuxian panics in the back of his mind.</p>\n<p>“What’s <i>that</i> supposed to mean?”</p>\n<p>“It means you’ve definitely heard all kinds of awful stuff about Wei Wuxian and how he was a vicious traitor or whatever, but when my ghost knew him? Everybody liked him. Even your dad sort of liked him. Your mom and your uncle loved him. It wasn’t blind love, either—Wei Wuxian kept getting his stupid ass maimed defending people. Like, he would <i>bodily</i> throw himself between them and danger and end up covered in his own blood half the time. I can’t say how he got from that to being the evil Yiling Patriarch, but…something seems weird there. Anyway, it means there’s not a single story I can tell you about him that you’re going to like hearing.”</p>\n<p>‘<i>Kept getting his stupid ass maimed</i>,’ Senior Wei repeats with shaky, exaggerated offense. <i>Such disrespect for your teacher, Jingyi. It was always the best choice at the time!<br></i><br><i>The best choice for a guy who thinks he’s a human lighting rod, sure</i>, Jingyi agrees. <i>For a genius, you’re a big, fat idiot, Senior Wei</i>.</p>\n<p><i>You’re the rudest child I know.<br></i><br><i>Really? Because we’ve been talking to Jin Ling for ages.<br></i><br><i>…Don’t talk about my nephew like that</i>, he says. But he’s smiling on the inside, so it doesn’t count.</p>\n<p>Speaking of Jin Ling, he’s turning kinda purple with repressed rage. It’s interesting.</p>\n<p>“You asked,” Jingyi points out.</p>\n<p>“It’s <i>worse</i> if they loved him!” Jin Ling shouts, losing all of the little chill he’d possessed. “I know they loved him! They had him name me! And then he <i>killed</i> my <i>parents</i>, even though they loved him, that’s—that’s—!”</p>\n<p>Yeeeah, Senior Wei is officially not okay right now.</p>\n<p>“Right. Sure,” Jingyi cuts in, aware that this is going to be taken badly but unable to stop himself. “If he actually <i>did</i> kill your parents.”</p>\n<p>“<i>Everyone</i> says he killed my parents!”</p>\n<p>“I get that, but. Look, Jin Ling, if my ghost’s memories have taught me anything, it’s that people lie about <i>so many things</i>, and are dead wrong about even more. And it gets worse when it comes to the Sunshot Campaign and the Wens.”</p>\n<p>“My uncle wouldn’t lie to me about the <i>murder</i> of my <i>parents</i>,” Jin Ling hisses, getting all aggressive and grabbing at his sword.</p>\n<p><i>I told you</i>, says Senior Wei, sad and exhausted and cold.</p>\n<p><i>This is only our first talk</i>, Jingyi points out. <i>Give me a few years to work on him.<br></i><br><i>Wow</i>, says Senior Wei. <i>Sure you’re not a Jiang?</i></p>\n<p>“He wouldn’t <i>lie</i>,” Jingyi agrees with Jin Ling. “My ghost agrees, too. But your uncle says a lot of shit he doesn’t mean when he’s mad, for one thing, and for another thing—does he even know for sure what happened? Or is he going off what people told him? Because I have <i>seen</i> parts of the Sunshot Campaign, and like…I’m not getting into it today, but <i>so many lies</i>. Or at least bad information. Either way, don’t blindly trust what people tell you about any of that. It’s way more messed up than we thought.”</p>\n<p>“Yeah? How?” Jin Ling demands with a sneer.</p>\n<p>“Well, for one thing, Sect Leader Jiang was our age when he took over his sect and fought in the war. He was a <i>kid</i>. Wei Wuxian was one year older than him. Your dad was only a couple years older than that. Even Chifeng-zun and Zewu-jun were only barely not kids. There were <i>no actual adults</i> in charge of the Sunshot Campaign because they all got killed or injured early on. How fucked up is that? It was just a bunch of messed up kids whose parents were basically all dead fighting a guy who was halfway to immortal.”</p>\n<p>Jin Ling is staring with his mouth open, knocked back from his outrage. Jingyi sympathizes. He had pretty much the same reaction. “There’s more, but you wouldn’t believe me about it. Why would you? You barely know me.”</p>\n<p>“You don’t know that. I <i>might</i> believe you,” says Jin Ling, scowling.</p>\n<p>Jingyi frowns back. “You wouldn’t. Could we do Empathy?”</p>\n<p><i>What the hell, Jingyi?!</i> Senior Wei cries. <i>What happened to our plan to do a cute dance around the truth like Sizhui?!</i></p>\n<p>Jin Ling, meanwhile, is staring in horrified fascination. “There is something <i>wrong</i> with you,” he declares eventually, sounding almost impressed.</p>\n<p>Jingyi scowls at both of them. He was just trying to help. “Okay, you don’t have to agree with each other so hard.”</p>\n<p>“Hah! Even your <i>ghost</i> thinks you’re a moron,” Jin Ling points out, looking smug. He’s such a spoiled little princess. Why is Jingyi even doing this for him?</p>\n<p>“Well, whatever. If you won’t try Empathy, I can give you a list of people who fought in the war, and you can ask them personally. People who don’t have political reasons to lie, unlike…all of your Jin relatives. And people who aren’t ridiculously personally messed up by everything, unlike Sect Leader Jiang. Just random people who were around. How about that?”</p>\n<p>“…Whatever,” Jin Ling says unhelpfully.</p>\n<p>“I can’t tell if you’re buying any of this or not,” Jingyi admits.</p>\n<p>“I believe that <i>you</i> believe it,” Jin Ling says in a superior tone with an arrogant little chin tilt.</p>\n<p><i>His father used to do that</i> exact same thing, Senior Wei gasps, equal parts horrified and guilty.</p>\n<p>“So you think I’m crazy,” Jingyi replies indignantly, ignoring Senior Wei’s mess of emotions.</p>\n<p>“You did tell me not to blindly trust people.” Jin Ling smirks at him. Jin Ling needs a punch in the face in the worst way.</p>\n<p>“Great, you can learn,” Jingyi says, standing up. “It’s been fun. I’ll send you a list of people to talk to. Try not to be too much of an asshole to them about it.”</p>\n<p>“Hey!”</p>\n<p>“And if you have more questions about your mom, or whatever, you can. Send me a letter, I guess. And I’ll ask my ghost.”</p>\n<p>Jin Ling gets a very awkward look and turns away. “Whatever,” he says again, but softly.</p>\n<p><i>He’s such a baby Jiang Cheng</i>, Senior Wei coos, ridiculously fond.</p>\n<p>Jingyi flees before Senior Wei’s emotions can swing around any more wildly than they already have. It seems unhealthy.</p>\n<p>* * *</p>\n<p>Jingyi and Senior Wei’s first anniversary of being brain roommates happens in early fall. They decide they should celebrate, so they pack up Sizhui, some food, and spare greens from the kitchens, and go to hang out with the rabbits after training is over. (Any and all suggestions by Senior Wei concerning Emperor’s Smile are shot down.)</p>\n<p>Sizhui clearly thinks they’re weird for celebrating a possession, but he’s too polite to say so. With his mouth, that is. The asshole has no problem judging them with his entire face.</p>\n<p>“It’s an <i>anniversary</i>,” Jingyi informs him severely.</p>\n<p>Sizhui gives a polite smile. Polite, and yet still somehow full of judgment.</p>\n<p><i>Sizhui is the best child</i>, Senior Wei whispers, weepy with pride. It horrifies Jingyi to think he’d be even worse if he knew Sizhui was his kid. If it’s possible for him to be worse.</p>\n<p>Anyway, despite both Sizhui and Senior Wei insisting on being themselves, it’s a really fun afternoon. Many rabbits are fed and cuddled. Jingyi and Senior Wei swap out who’s in charge of the body so they can both talk to Sizhui. Senior Wei comes so, so close to making Sizhui admit that he incited a screaming fight between two of his least favorite disciples on purpose.</p>\n<p>It’s in the midst of that stand-off—Sizhui aggressively smiling, Senior Wei wheedling, Jingyi laughing at them both—that something goes wrong. Scary wrong. But by the time Jingyi works out what it is he’s feeling, it’s too late. Or maybe it was always too late.</p>\n<p>It’s nothing like Zewu-jun’s exorcism. It doesn’t hurt, it just feels like…something is unravelling inside him. It would almost be a good feeling if it weren’t so incredibly frightening. Jingyi has gotten used to Senior Wei. Okay, he loves Senior Wei, he’s happy having him around always, and he definitely doesn’t want to lose him. He hardly knows who he is without him at this point.</p>\n<p>But it’s not his decision any more than gaining Senior Wei in the first place was. And so the unravelling continues, on and on, and then an uncomfortable stretching feeling starts to take its place. <i>Being unmade</i>, Jingyi thinks, and panics.</p>\n<p><i>What is this?</i> he demands in a mental scream.</p>\n<p>And Senior Wei says, <i>I’m sorry, Jingyi. And thank you</i>.</p>\n<p>Then there’s an awful, internal snap, Jingyi is abruptly in charge of the body again, and Senior Wei is gone. The silence is sudden and terrifying, and there will never be anything but silence, ever again. Because Senior Wei is <i>gone</i>. Just like that, with no warning, no fight, no chance to bargain or argue. Just gone.</p>\n<p>Jingyi curls into a ball and screams, much to Sizhui’s horror and confusion.</p>\n<p>* * *</p>\n<p>One month later, the Lan disciples are sent out to handle a complaint at a place called Mo Village. Zewu-jun lets Jingyi go despite the fact that everybody thinks he’s mentally unstable these days.</p>\n<p>Well, okay, his parents don’t think that, and neither do Zewu-jun or Uncle or Sizhui, but that’s because they all know he’s in mourning, which is not something he can explain to anyone else. In fact, all of them except Uncle are in mourning, too. </p>\n<p>Zewu-jun says the loss is worse for Jingyi, though, because Senior Wei was with him always. That first week, Jingyi must’ve asked Senior Wei’s opinion or made a joke at him or anticipated a reaction from him hundreds of times, and every time there was silence instead of Senior Wei, it was like losing him all over again.</p>\n<p>Watching Sizhui miss Senior Wei is making everything more painful, too, because Jingyi’s complicated feelings about not telling him who Senior Wei was to him are worse than ever. It means that for the very first time, Sizhui can’t help him, and it’s Jingyi’s own fault.</p>\n<p>It’s a relief to be sent on a night hunt—a welcome distraction. Or at least it is at first, but then they arrive in town, and, well. It starts going wrong pretty much right away, when Jingyi gets into a shouting match in a tea house with a guy who’s telling bullshit Yiling Patriarch lies. Jingyi eventually loses the thread of his argument and just bursts into tears in front of everyone, and a loudly apologizing Sizhui has to hurry him out of the building. So that’s both humiliating and infuriating.</p>\n<p>Things don’t really get better from there, either.</p>\n<p>Half an hour after entering Mo Manor, Jingyi is maybe struggling a little bit against the urge to just walk away and let everyone in the place die. He knows that’s a horrible thought that everyone from Lan Qiren to Senior Wei would scold him for, and he’s not going to <i>act</i> on it, but he’s definitely feeling it. Sizhui can tell, too. He’s been throwing Jingyi disappointed looks like knives since the Mo parents started talking.</p>\n<p>Still, so far Jingyi’s favorite person in this family is the weirdo currently clinging to a pillar and loudly dumping the family’s dirty laundry all over the floor. What does that say?</p>\n<p>Jingyi’s delighted to escape into the courtyard to set up the lure flags, but of course this goes wrong, too, because the weirdo meanders over and joins them. He may be Jingyi’s favorite Mo, but that doesn’t mean Jingyi wants him wandering around touching all their stuff. If he didn’t know better, he’d say Mo Xuanyu wasn’t crazy at all, just willfully irritating.</p>\n<p>Then, too, he’s definitely got an…<i>interest</i> in Sizhui. Which would be a lot worse if it were a creepy interest, but at least it doesn’t seem to be that. It’s more like he recognizes Sizhui, and likes him. But where would he recognize him from?</p>\n<p>Come to think of it, Sizhui is being funny about Mo Xuanyu, too. Keeps looking at him and frowning, puzzled. Maybe they did meet before? If this guy used to be with the Jin, then…</p>\n<p>Jingyi watches the guy grab a lure flag and maybe threatens him a little—insincerely!—but Sizhui feels the need to step in and smooth things over, because he doesn’t like conflict unless he’s the source of it.</p>\n<p>Jingyi is about to jump in and argue his case, but—stops. Because Mo Xuanyu is being a brat, but he’s also…looking over the lure flag? This is strangely familiar all of a sudden. Jingyi spent a whole year with Wei Wuxian in his head, and he knows what it feels like when he’s being fucked with by a good-natured weirdo. It feels <i>just like this</i>. Because Mo Xuanyu sure knows a suspicious amount about lure flags—he’s tracing over the lines section by section in a logical order. He’s checking them. He’s <i>testing</i> the juniors right now, isn’t he? Just like—</p>\n<p>But it doesn’t have to mean anything, and Jingyi shouldn’t get his hopes up. Mo Xuanyu trained to be a cultivator too. Maybe this actually <i>is</i> Mo Xuanyu, and he’s just playing crazy to screw with his awful family. Who could blame him?</p>\n<p>Jingyi must have some kind of look on his face, because Sizhui steps closer with a careful, “Jingyi?”</p>\n<p>And <i>Mo Xuanyu’s</i> head snaps up, and he stares at Jingyi in shock. He would, too. For all that they brain cohabitated for a year, they’ve never actually seen each other. Jingyi really only looks in mirrors when he’s getting dressed for the day, and Senior Wei always politely hid in the brain cabinet when Jingyi was getting dressed. He couldn’t have known what Jingyi looked like.</p>\n<p>“Are you <i>kidding</i> me?” Jingyi yells, near-hysterical with relief. “Did you actually get pulled out of my body and shoved into somebody else’s? How do you have the <i>worst luck in the world</i>, Senior Wei?” </p>\n<p>“Senior Wei?” Sizhui murmurs, eyes widening in shock and joy. “<i>Our</i> Senior Wei?”</p>\n<p>Senior Wei drops the lure flag, jumps to his feet, and beams at them, and oh wow, he has a <i>great</i> smile. No wonder Hanguang-jun used to make that face whenever Senior Wei smiled happily. “My children!” he cries. “You’ve grown!”</p>\n<p>“We have <i>not</i> grown, it’s only been a month, you, you, you…”</p>\n<p>Jingyi abruptly decides this conversation is a waste of time and just goes running toward Senior Wei instead, hitting him with a thump and flinging his arms around him. Senior Wei freezes up for a second, and Jingyi almost lets him go because the last thing he wants is to upset him—but then Senior Wei hugs back. He hugs <i>back</i>, because he has a <i>body</i>, this is <i>amazing</i>.</p>\n<p>Jingyi recognizes that he’s not showing much interest in what Mo Xuanyu’s deal is right now, but he just doesn’t have the capacity to care in the face of Senior Wei having a body. Maybe Mo Xuanyu is jelly-floating. Whatever, Jingyi will apologize later.</p>\n<p>“…What is going on?” asks Lan Xuanhui, who, to be fair, is right to be confused.</p>\n<p>“Ah, well, this is a family friend of Jingyi’s,” Sizhui explains, striking out for a believable lie like a champ. “We were under the impression that he’d died, which is why Jingyi’s been so sad lately, but apparently he was…undercover…instead? We should try not to draw too much attention to him. Or say his real name too loudly.”</p>\n<p>Oh, good point. It is not a great idea to run around bellowing the name Wei at this time. This time being a time riddled with weird curses and resentful energy. It may be a common name, but it’s not common enough in view of evil magic crap.</p>\n<p>“Sizhui is the most devious Lan alive,” Senior Wei whispers to Jingyi. Jingyi can only nod agreement.</p>\n<p>“But Jingyi said…he was pulled out of his body…?” Lan Xuanhui persists, insisting on paying too much attention for anyone’s good. This is what happens when Hanguang-jun trains people.</p>\n<p>“We really shouldn’t ask too many questions,” Sizhui informs her with a smile as calm and unreachable as the moon.</p>\n<p>“He’s learned way too much from Lan Zhan, hasn’t he?” Senior Wei murmurs, amused.</p>\n<p>In fact, Sizhui takes after <i>both</i> of his fathers way too much. That’s why he’s terrifying. But this particular move comes straight from Zewu-jun, actually.</p>\n<p>“I was going to tell him who I was,” Senior Wei continues, “but I couldn’t think of a way to get him alone without sounding…very…”</p>\n<p>“Insane and sketch as hell?” Jingyi suggests.</p>\n<p>“Exactly.”</p>\n<p>“About that—how did you end up in that body, anyway? Are you possessing Mo Xuanyu? Are you pretending to be Mo Xuanyu? How does this even work?”</p>\n<p>“This <i>is</i> Mo Xuanyu’s body—barely-there golden core and all, which is new and different—but oddly I still look like me. Necromancy, so strange! Mo Xuanyu sacrificed himself so that I could take bloody revenge on his enemies, you see. I was the scariest demon he could think of, Jingyi. I’m not sure whether to be proud or offended.”</p>\n<p>Jingyi tears up a little. “You have a body of your own? And a golden core?”</p>\n<p>Senior Wei hugs him tighter. “I do.”</p>\n<p>“Then…Hanguang-jun…you can…Senior Wei! Hanguang-jun!”</p>\n<p>“Okay, I can tell you’re very excited about my prospects, and that’s…I’ll be honest, it’s kind of weird, Jingyi. Stop.”</p>\n<p>“Stop! Stop hell! I should call him right now—”</p>\n<p>“Haha, do <i>not</i>—”</p>\n<p>“And what is it with you and wackos who love human sacrifice?”</p>\n<p>“I don’t know,” Senior Wei complains, but when he gently pushes Jingyi away, the better to inspect his face, he looks happy. And maybe a little relieved that they’re not talking about Hanguang-jun anymore, though he’s a fool if he thinks Jingyi is letting that go. “Maybe I should let it be known I don’t approve of that sort of thing. Put up advertisements? Leave bloodstained notes?”</p>\n<p>“Hey, or here’s a wild idea—try to <i>stay alive</i> this time!”</p>\n<p>Senior Wei laughs merrily, like that’s just the funniest thing he’s ever heard. Jingyi probably shouldn’t punch him—out of both respect for him and fear for his health—but it sure is tempting.</p>\n<p>“At least poor Mo Xuanyu had the decency to sacrifice himself rather than someone else. And he even apologized to me! Definitely the most respectful human sacrifice I’ve been involved in.”</p>\n<p>Wei Wuxian, standing in a semi-public space, blathering about his repeated personal experience with human sacrifice. This is how the Yiling Patriarch ended up with such an awful reputation. “So who do you have to kill?” Jingyi asks, resigned. “What happens if you don’t kill them?”</p>\n<p>“I’m not sure who yet,” Senior Wei explains, releasing Jingyi altogether, which…Jingyi realizes he can’t cling to the man all night, but he’d <i>like</i> to. Anyway, Senior Wei pulls up his sleeve, and there are four scary, deep gouges in his arm. “Four people, though,” he says, serious, “or these never heal, and…there would eventually be further unpleasant consequences. So far my guess is the Mo husband, wife, and son, for a start. Maybe number four’s here too, maybe not.”</p>\n<p>“…Further unpleasant consequences?” Senior Wei’s life is a nightmare.</p>\n<p>“Number four could be a Jin,” Senior Wei mutters, looking at his mutilated arm and frowning. Also totally ignoring Jingyi. “He did live with them for a while. And, I mean. <i>Jins</i>.”</p>\n<p>You’d really think that, having gone to all this trouble, Mo Xuanyu could have done Senior Wei the courtesy of leaving him a hitlist. But by all accounts the guy wasn’t thinking with his best brain. Well, he couldn’t have been, could he? He ritually sacrificed <i>himself</i>. Not a sign of a balanced mind.</p>\n<p>Jingyi gets briefly sidetracked by the sure knowledge that when Senior Wei thinks of the Jin Sect, he pictures Jin Guangshan’s facial hair and imaginary potbelly, Jin Zixuan, Jin Ling, Jin Guangyao, and a bunch of faceless yellow blobs. And now the first two are dead, so it’s just all faceless yellow blobs, Jin Ling, and Jin Guangyao. Even if Mo Xuanyu <i>had</i> left a hitlist with a Jin on it, odds are that Senior Wei would have looked at the name and pictured a yellow blob. He is the world’s most ridiculous mass murderer.</p>\n<p>“And if you do kill everybody you’re supposed to kill?” Jingyi asks, deciding for the hundredth time to stop worrying about Senior Wei’s memory thing.</p>\n<p>“Then this body’s all mine, and I can do what I want with it,” Senior Wei explains, holding his arms out to the side and displaying his brand new body with a bemused smile. A smile like…he’s not totally sure he wants a body. Or to be alive at all.</p>\n<p>Well, that’s not allowed.</p>\n<p>“Great,” Jingyi says firmly. “So back to Hanguang-jun! Now you can tell him you’re in love with him. You’re alive, you have a golden core—your love story just went from hideously tragic to weird-but-cute. Congratulations. Go for it.”</p>\n<p>Senior Wei looks exasperated, like he isn’t the most exasperating person in the world. “Jingyi.”</p>\n<p>“No, just shut up and do it, Senior Wei! I’m not letting you ruin this for me! Your old reasons are stupid now, and I know you don’t think so, but he totally loves you too—”</p>\n<p>“<i>Jingyi</i>,” Sizhui hisses in horror, trying to bodily block Senior Wei and Jingyi from the sight of the other (openly staring) disciples, which isn’t working because he’s a tiny person.</p>\n<p>A tiny person who’s tiny because he didn’t eat enough in the Burial Mounds, and oh wow, Jingyi can tell Sizhui about <i>that</i> now, too. Having Senior Wei alive is fantastic.</p>\n<p>But they can talk about that later. Right now they’ve got to catch some kind of malevolent spirit, but preferably not before it kills the Mo family for Senior Wei. Jingyi’s life is intensely weird.</p>\n<p>It all works out perfectly, though. Well, it got kind of hairy in the middle, and if Jingyi and Sizhui hadn’t known Senior Wei, they probably would have run screaming for Hanguang-jun. But they do know Senior Wei, so they just left it to him—and yeah, he fixed everything up and calmed down the evil sword right after most of the Mo family died. It would’ve been nice if he hadn’t felt the need to control a few corpses in the process, but he’s the Yiling Patriarch, and there’s only so much normal you can expect from him. And creepy though his methods are, they’re effective.</p>\n<p>Once the screaming’s died down, the sword’s contained, and the dead have gone back to acting dead, Senior Wei proudly shows off his arm to Jingyi. There’s only one wound left. That’s good, anyway, even if the situation as a whole is ridiculous.</p>\n<p>Unfortunately, Jingyi and Sizhui are the most senior disciples on this one, so they have to organize cleaning up the mess and patching up everybody’s injuries. They also have to firmly explain absolutely nothing about Senior Wei, divert every one of Lan Xuanhui’s increasingly agitated questions, and definitely not have hysterics until everybody else is bandaged, basically calm, and heading back to the inn.</p>\n<p>At that point, Jingyi decides he’s allowed to seize Sizhui and Senior Wei and drag them to a quiet corner for a long overdue chat.</p>\n<p>“So there’s a thing you two should know, but I didn’t tell you before because it was too sad. But now Senior Wei’s alive! So it’s not sad anymore,” Jingyi tells them, clinging to their sleeves like they might try to escape. “Senior Wei, remember how I told you about, you know. Lan Yuan?”</p>\n<p>Senior Wei nods, confused, but not as confused as Sizhui.</p>\n<p>“Yeah,” Jingyi says. “Lan Yuan. Courtesy name Sizhui.”</p>\n<p>Senior Wei turns to stare at Sizhui in dawning delight. (But not that much surprise, Jingyi notes. Seems like Senior Wei had had his suspicions.)</p>\n<p>Jingyi nods and turns to Sizhui. “Sizhui, you know how it freaks you out that you can’t remember anything from when you were little?” Jingyi asks, trying not to freak out about Sizhui’s suddenly chalk-pale face. “That’s because…uh. It’s. The Burial Mounds were rough, I guess? But not as bad as the stuff that came before them. Um, you just, your life sucked as a kid. It makes sense that you’d forget.”</p>\n<p>“…I…” Sizhui sways slightly, and Senior Wei reaches out to prop him up, staring at him in wonder.</p>\n<p>But then he turns to Jingyi, frowning in a rare moment of open seriousness. “Don’t say anything else—you shouldn’t have said that much. Let him remember in his own time. Don’t confuse him.”</p>\n<p>Sizhui’s staring at Senior Wei’s face now, bewildered. “…Did you plant me in the dirt with the radishes?”</p>\n<p>And Senior Wei beams at Sizhui, bright as life. Jingyi wonders what that feels like from the inside. He’s a little sad that he can’t know. “<i>Yes</i>,” Senior Wei declares proudly. “To make you grow faster.”</p>\n<p>“Okay,” Sizhui mutters, sounding dazed. “I thought that was a weird dream.”</p>\n<p>“Senior Wei is weirder than <i>any</i> of my weird dreams,” Jingyi commiserates. And then he wanders off to look busy elsewhere, because Sizhui and Senior Wei deserve a minute to themselves after having had Jingyi eavesdropping on their every conversation for a year. It’s pretty fantastic that Senior Wei can have conversations with people now and Jingyi doesn’t even have to know it’s happening.</p>\n<p>Okay, and maybe a <i>tiny</i> bit lonely, but mostly fantastic. Nonstop Senior Wei was a lot. It was a hell of a lot better than no Senior Wei at all, but Senior Wei in moderation is definitely going to be best. Eventually. Jingyi’s not used to it yet, though, and he only makes it like ten steps away from Senior Wei before he’s fighting the urge to run right back and cling to him again to make sure he doesn’t disappear.</p>\n<p>…Oh, hey. Hanguang-jun is going to be <i>way</i> worse than Jingyi about the whole clinging to Senior Wei thing, because he got ditched for so much longer. He’s gonna be super weird about Senior Wei for <i>years</i>, isn’t he? The other disciples are gonna freak.</p>\n<p>Speaking of Hanguang-jun, Jingyi decides now is a good time to send a signal for him.</p>\n<p>He sends the signal, watches it go up, and then turns to check on Senior Wei, who is…just so predictable, honestly.</p>\n<p>“Sit on him, Sizhui!” Jingyi orders. “He’s trying to escape!”</p>\n<p>Sizhui stares at Jingyi, panicked and flustered. He’s probably trying to make sense of his entire life, and really no one should be making demands of him right now. But even so, he goes ahead and hurls himself to the ground and clings to Senior Wei’s leg like he did when he was a kid.</p>\n<p>Senior Wei looks like he just got punched in the chest with Feelings. Sizhui looks appalled at himself, but he’s not letting go. Jingyi will take it. They’re even parked in a shadowy corner, so hopefully Jingyi will get a chance to explain himself before Hanguang-jun notices them.</p>\n<p>And then it’s too late to worry about any of that, because Hanguang-jun’s arrived. He’s arrived, and he’s confused. Jingyi has to admit Mo Manor seems very put together—not the kind of situation you emergency call in Hanguang-jun for.</p>\n<p>“It’s not a ghost emergency,” Jingyi explains. “It’s a personal emergency.”</p>\n<p>Hanguang-jun instantly goes from looking cool, confident, and in control to looking like he might fly into a rage and stab whatever’s making his juniors sad. He and Senior Wei really <i>are</i> soulmates.</p>\n<p>“It’s nothing awful!” Jingyi explains hastily. “I mean, we did find an evil sword, but we got that under control. With help. So we definitely need you to take care of the sword, but it’s not why we called you. Uh. Remember how I’ve been super weird for the last year?”</p>\n<p>Hanguang-jun gives him a look. Is he implying that Jingyi is always weird? Because it feels like he’s implying that. And when Jingyi is trying to fix his broken love life, too! So ungrateful.</p>\n<p>“I’ve been possessed for an entire year,” he clarifies, reproachful.</p>\n<p>Hanguang-jun gives a tiny, baffled frown.</p>\n<p>“I couldn’t tell you because it would’ve made you sad. I told Zewu-jun, though! I wasn’t just wandering around possessed not telling anybody.”</p>\n<p>“Sad?” Hanguang-jun murmurs, puzzled. “You weren’t exorcized?”</p>\n<p>“Uh, no. There were these creepy people with this creepy human-sacrificing ritual, and they caught me and tried to kill me with it—they’re all dead now!” he adds hastily, because Hanguang-jun is looking homicidal again. “And it didn’t work right, anyway. Instead of dying, I just ended up with a ghost tied to my golden core. He couldn’t go unless my golden core went with him. Or we thought that, anyway. But it turns out that all it took was even more creepy human sacrifice that nobody asked for. Anyway, he was a really nice ghost, and he’s got his own body now. So, uh. It won’t, you know. Break your heart to know about him anymore.”</p>\n<p>“Who?” Hanguang-jun asks, looking eager and a little desperate, because he’s not <i>stupid</i>, unlike certain demonic cultivators Jingyi knows.</p>\n<p>Jingyi doesn’t even have to answer, because Sizhui is the best son, and takes this moment to shove Senior Wei out into the courtyard.</p>\n<p>Senior Wei almost faceplants right there, which would have been <i>magic</i>, but he manages to pull it together after a few stupid hops, and looks up at Hanguang-jun with the awkwardest fucking smile the world has ever seen. “Hey, Lan Zhan,” he says, sounding like he is fifteen years old.</p>\n<p>“…Wei Ying,” says Hanguang-jun, sounding like…like the love of his life just came back from the dead and smiled at him, actually. He marches forward and grabs Senior Wei by the arm, looking more stunned and happy and alive than Jingyi’s ever seen him, even in memories. Senior Wei immediately clings back.</p>\n<p>And then they just…they just <i>stand there</i>. Just staring at each other, unspeakably soft looks on their faces. They are literally standing in a moonlit courtyard gazing lovingly at each other right now, because that’s apparently a thing that happens in real life when Senior Wei is involved. Wow. This needs music, like a play.</p>\n<p>And here’s Sizhui, with an instrument.</p>\n<p>“Play them a dramatic love theme, Sizhui,” Jingyi demands.</p>\n<p>“Shut up, Jingyi,” Sizhui and Senior Wei say in perfect harmony, while Hanguang-jun frowns at him, looking weirdly offended.</p>\n<p>Jingyi beams. He loves happy endings.</p>"
}