{
  "id": "2788202",
  "url": "https://archiveofourown.org/works/2788202?view_full_work=true",
  "author": [
    "zoeeemin"
  ],
  "title": "The Pink Envelope",
  "rating": "Not Rated",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "방탄소년단 | Bangtan Boys | BTS"
  ],
  "relationships": [
    "Min Yoongi | Suga/Park Jimin"
  ],
  "characters": [
    "Min Yoongi | Suga",
    "Park Jimin",
    "Kim Namjoon | Rap Monster",
    "Kim Taehyung | V",
    "Jung Hoseok | J-Hope",
    "Jeon Jeongguk | Jungkook",
    "Kim Seokjin | Jin"
  ],
  "additional_tags": [],
  "language": "English",
  "series": "",
  "published": "2014-12-17",
  "completed": null,
  "words": "12,016",
  "chapters": "1/1",
  "comments": "252",
  "kudos": "7,678",
  "bookmarks": "1,264",
  "hits": "81,349",
  "summary": "<p>Yoonmin | G | 12,014w</p>\n<p>to a prompt I received on tumblr<br>\"Oh shit, sorry I got the wrong locker\" When Jimin is sending love letters to his crush via locker but fails because it is Yoongi's locker.</p>\n<p>au where 6 of them are highschool students (Jin has already graduated)... and Jungkook is also in highschool with the rest of them (please don't ask me why I just want him to be there hahahaha)</p>",
  "notes": "<p>How did it even stretch to 12,000 words?????? 0_0</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>If you did really read this fic from beginning to end please know that I love you &lt;3</p>\n<p>This is my first attempt at writing something beyond 6K<br>and although I wish it could have been better<br>I think I have learnt quite a bit from writing this...</p>\n<p>Comments are always greatly appreciated :) :) :)</p>\n<p>*ps: shout out to Elisha &amp; Aleks for reading my draft when it was around 6-7K hahah... and special thanks to Elisha since I used her idea for nutjob!Tae's confession... and MAJOR THANKS for Elisha for being super supportive whenever I write something ;A;;</p>",
  "text": "<p> </p>\n<p> Yoongi almost missed it – the pink envelope that slips out of his locker - and the poor thing would have met the sole of his sneaker if it was not for Hoseok’s sharp eyes.</p>\n<p>“What are you waiting for? Open it!” Hoseok nudges eagerly, eyeing the suspicious object like he would snatch it if he has to wait for another minute.</p>\n<p>Yoongi rolls his eyes at Hoseok’s excitement, although he understands why. There have been more than enough pink envelopes flowing out of Jin’s locker and flooding the floor for them to know the most likely implication of finding one in theirs. Although it has never crossed Yoongi’s mind that he would be at the receiving end – ever – to be very honest.</p>\n<p>But Yoongi’s inquisitive friend won’t stop hovering over his shoulder, so he rips open the envelop (“Ouch! Hyung! It’s someone’s heart right there!\") and scans through the content. His eyes narrow as they pass through \"...melts like the snow on the first day of spring\", and \"if there was a class about your smile I wouldn't mind staying back for extra lessons\". By the time they reach the hand-drawn smiling heart wearing a pair of wings, coloured with pink highlighter, Yoongi has to glance over to exchange a look with Hoseok.</p>\n<p>“Did I just get confessed to by a 10-year-old?”</p>\n<p> </p>\n<p> </p>\n<p>“I’m not believing it until I see it.”</p>\n<p>“It’s true.” Hoseok hums gleefully, holding up the envelope and Namjoon’s jaw goes slack.</p>\n<p>“Ya, that’s mine-“ Yoongi protests lazily, as his supposed-to-be-private letter undergoes yet another round of inspection.</p>\n<p>“No way!” Namjoon exclaims.</p>\n<p>And Hoseok extends his palm “Yes way! So fork it up!”</p>\n<p>Namjoon grumbles as he fishes out his wallet.</p>\n<p>“Wait a minute… Did you guys make a bet on me or something?”</p>\n<p>“Yeah” Hoseok does his ridiculous signature dance, waving his winnings obnoxiously just inches away from Yoongi's nose “on whether you would ever get a pink envelope before you graduate.”</p>\n<p>“And you asshole didn’t think that I would?” Yoongi flicks his fries at Namjoon.</p>\n<p>“Hey,\" Namjoon shrugs, shoving the fries into his mouth in the process. Gross. \"you would have agreed with me!”</p>\n<p>Yoongi glares, muttering something along the line of “annoying brat”.</p>\n<p>But as much as it hurts Yoongi’s ego to admit it, Namjoon was probably right. The older boy is so socially unmotivated that he barely talks to anyone else outside his current circle of close friends. And when he actually opens his mouth, he is too snarky to be remotely likeable, well, at least in most people’s eyes. He knows that his chance of being the most popular kid in school is next to non-existent, but for Namjoon to point that out, and to actually put his weekly allowance on the line to prove how much he strongly believes that, that was just rude.</p>\n<p>“Anyway, the important question is, you’re gonna go, right, hyung?” Hoseok interrupts.</p>\n<p>The burger pauses mid-air on its way to Yoongi’s agape mouth.</p>\n<p>“Yeah, hyung, you should. I mean. Can’t afford to be choosy. You’re getting pretty old.” Namjoon says as he sneaks another fries out of Yoongi's plate, earning himself a smack on the head.</p>\n<p> </p>\n<p> </p>\n<p>In his defence, Yoongi did not plan to go at first. It was all because of his friends’ suddenly acting like they were best pals of the unknown sender - Hoseok’s worrying out loud about him (“What if he waits for five hours?”), and Namjoon’s constant nagging about Yoongi’s being heartless (“Look at this smudged spot he was probably crying when he wrote this letter”).</p>\n<p>And no, he’s coming not because he is interested, not even in the slightest, because he totally didn’t re-read that letter five times, trying to find out any little details that could tell him more about the person who claimed that Yoongi's smile “brightened up” his day, any hints beside the name ‘Park Jimin’ cutely signed off below the awkward “<strike>yours sinc yours with lov</strike> cheers”. At most, he's just curious, probably.</p>\n<p>However, the more he goes over letter, the more everything seems to be veiled in a cloud of unbelievability.</p>\n<p dir=\"ltr\">Yoongi: I swear to god I will rip all your heads off if this a prank</p>\n<p dir=\"ltr\">Hoseok: Hahaha… are you nervous, hyung?</p>\n<p dir=\"ltr\">Jin: Please. Be nice. Don’t scare the child away.</p>\n<p dir=\"ltr\">And Namjoon sends him a smooching emoticon.</p>\n<p>Yoongi rolls his eyes so hard they almost touch the back of his skull.</p>\n<p> </p>\n<p> </p>\n<p>But here he is, walking towards the abandoned basketball court at the back of the school, trying to ignore the fingers fidgeting in his pockets. His heart beats a little faster when he spots a short guy with puffy black hair pacing across the court, who is apparently too nervous to notice Yoongi coming close, and the latter has to clear his throat to get attention.</p>\n<p>“Uhm… hey…” His greeting is met with clear brown eyes that stare curiously at him. And round cheeks. Heck, this kid could really pass as a 10-year-old “Are you Park Jimin?”</p>\n<p>“Yes….?”</p>\n<p>“Did you drop this letter in my locker?” Jimin widens his eyes at the envelope that materializes in Yoongi’s hand, before he jolts, hand coming up to cover his mouth. Yoongi’s stomach twists uncomfortably.</p>\n<p>“I’m… I’m sorry… is your locker number 07-04?\"</p>\n<p>“No, mine is 07-03. 07-04 is my friend’s, Jung Hoseok’s –“</p>\n<p>Jimin looks like he is about to faint, and suddenly it all clicks in Yoongi's mind. And something is weighing down in his chest, something feels a lot like disappointment.</p>\n<p>“Oh shit” Jimin grimaces, his lips pressed into a thin line and hands fisted up by his side “I’m so sorry... I… I must… have gotten the wrong… locker…”</p>\n<p>“Oh...”</p>\n<p>“I’m so sorry… the letter was meant for… someone else…” Jimin scratches his head with an intensity that could pull all of his hair off. His face is now as red as a tomato and he is refusing to look at anything else but his shoes.</p>\n<p>Yoongi silently curses at whoever thought it was fun to put a socially inept guy like him in such an awkward situation, as if it wasn’t bad enough that the whole world, including himself, thought that he actually caught someone’s attention. Yoongi feels a little stupid, especially when he imagines how much enjoyment Namjoon and Hoseok will-</p>\n<p>“Wait, was it meant for Hoseok? Is your crush Jung Hoseok?” Yoongi didn’t think Jimin’s face could get any redder but apparently it could, and Jimin looks like he was planning to dig a hole in the ground to bury himself in “Do you… want me to tell him?”</p>\n<p>“NO” Jimin jumps, waving his small hands “no no no… please don’t. No. Just. Don’t tell him. Ever. I can’t…”</p>\n<p>“Are you sure? I mean, I’m his friend-“</p>\n<p>“I’m sure.” Jimin nods fervently, his hair bouncing on his head. “Please just don’t tell him. I shouldn’t have written that letter in the first place. And now this embarrassing situation happened.” Jimin glances at his toes again “I’m sorry…”</p>\n<p>Jimin has this little sad pout on his face as he blinked at the ground, and it makes Yoongi wish he was Jung Hoseok .</p>\n<p>“Please promise you won’t tell him!”</p>\n<p>“I won’t.”</p>\n<p> </p>\n<p> </p>\n<p>It’s probably the promise Yoongi made with Jimin, or maybe it’s just Yoongi not wanting to see the satisfactory smirk on Namjoon face that makes him decide not to tell the truth.</p>\n<p>“He didn’t show?\" Hoseok sighs, not catching the way Yoongi is eyeing him weirdly \"He probably felt too shy to meet you in the end.”</p>\n<p>“Or” Namjoon butts in “Yoongi hyung gave a merciless rejection and made him cry. Now hyung is simply too guilty to admit it.”</p>\n<p>“Yet the cold-hearted me received a pink envelope while you haven't” Yoongi chuckles and Namjoon grumbles - \"Fine\". Yoongi’s conscience tugs a little at the lie but hey, technically, someone did put a love letter in his locker.</p>\n<p>“Anyway” Hoseok slings his arm over Yoongi’s shoulder “This means Yoongi hyung is not a hopeless loner after all. I mean, who knows, our hyung may get attached by the end of this year.\"</p>\n<p>Yoongi gives Hoseok a dead stare and the latter replies with his 1,000 watt smile, one that Jimin compared to nothing less than the sun in his letter. The kid is probably somewhere giggling, blushing as he catches a glimpse of Hoseok's grin and going about the rest of the day daydreaming that the smile was for him. Who knows, probably Hoseok's laughing like an idiot can make the kid feel better about confessing to the wrong guy.</p>\n<p>The thought makes Yoongi smile a little.</p>\n<p> </p>\n<p> </p>\n<p>***</p>\n<p> </p>\n<p> </p>\n<p>It's funny the way your mind does crazy tricks to your eyes and ears. For some obscure reasons, Park Jimin seems to appear everywhere around Yoongi since their first meeting. His bouncy puffy hair can be easily spotted among the kids crowding the hallway; his puppy brown eyes drill holes on Yoongi's back, or more likely - Hoseok's, and then dart away quickly as the elder boys turn around. And his laugh - the unique high-pitched cackles that should have annoyed the heck out of Yoongi at 7 in the morning; but instead, the lively sound only brings to his mind the shy kid with small hands fidgeting at the hem of his shirt and round cheeks blushing pink under the bright sunlight.</p>\n<p>Or maybe Jimin has been crowding around Yoongi all this while, to stay near Hoseok, to get his crush’s attention even, but Yoongi only notices the kid's presence now.</p>\n<p>Not that Yoongi really minds. Jimin keeps his distance, and it kind of amuses Yoongi the way Jimin panics whenever their eyes meet.</p>\n<p>Yoongi almost forgets all about it, until, one day, the pink envelope slips out of his bag, sandwiched between his revision notes, and lands undramatically in the middle of his table. Yoongi picks it up, and realizes it feels somewhat wrong to be holding on to something that is not exactly his.</p>\n<p>Yoongi reckons he should return it to the sender the next time he meets Park Jimin, which turns out to be two days later.</p>\n<p> </p>\n<p> </p>\n<p>It's a Thursday afternoon, and by default, Yoongi is dribbling ball and shooting baskets in the old basketball court, alone, because this particular hobby of Yoongi's is not shared, and because his friends call him insane for doing any kind of physical activities under the burning sun.</p>\n<p>The familiar puffy hair peeks out on top of the rusty old gate when Yoongi is leaning against the pole to take a breather.</p>\n<p>\"Park Jimin?\"</p>\n<p>The kid steps out of his hiding place, with two bottles of cold drinks in his hands and a smile stretching on his lips.</p>\n<p>They sit on the dirty spectator seats, basking in the dimming light of early evening and letting the rustling sound of nature’s conversation fill the silence between them.</p>\n<p>“I didn’t tell him” Yoongi finally speaks up “if that’s what you’re worrying.”</p>\n<p>“I didn’t think that you would.” Jimin shakes his head “But thank you” Jimin glances at Yoongi, before adding “hyung.”</p>\n<p>Yoongi likes how that sounds. For no apparent reasons.</p>\n<p>“You seriously are not considering confessing to him?”</p>\n<p>“Uhm… I don’t think I will.” Jimin blinks at his hands, small, chubby fingers tracing the lines on the bottle cap and Yoongi is not sure why he is paying them so much attention “I think Hoseok hyung is out of my league.”</p>\n<p>That is the stupidest thing Yoongi has ever heard anyone say about Hoseok, or about relationships in general. But he is probably the least qualified person in the whole world to be making any statements regarding matters of the heart and who can date who.</p>\n<p>“Uh” is all he can mutter, and the monosyllabic response seems to upset Jimin or some sort because his baby cheeks just deflate. “What?”</p>\n<p>“Usually people will say comforting things like ‘No, he is not out of your league’ or something like that.”</p>\n<p>“But he is.” The three words turn Jimin's face into a flattened balloon “I’m joking.”</p>\n<p>Yoongi expects the younger boy to scowl at his poor sense of humor, like what most people do. But Jimin just heaves a sigh of relief. And then giggles, a little.</p>\n<p>Strange. But Yoongi likes the sound of that too.</p>\n<p>“Uhm, hyung, can I ask… if Hoseok hyung is, like, interested in anyone right now?”</p>\n<p>“Oh, is that why you brought me this drink?” Yoongi shakes the empty bottle in his hand “Buying yourself a spy?”</p>\n<p>“No… Not entirely…” Jimin blushes, and it makes Yoongi chuckle. This kid is a frigging open book and Yoongi thinks he may know everything just from reading the introduction.</p>\n<p>“Well, from what I know, there’s no one.”</p>\n<p>“Really?” Jimin’s voice is now an octave higher and there is an extra sparkle in his eyes. He really can’t be even more obvious even if he tries.</p>\n<p>“And how does that make a difference if you’re not gonna make a move?” Yoongi squints, and Jimin's mouth falls open.</p>\n<p>Yoongi wishes he could just tell Jimin to gather all his courage and confess, because chances are Hoseok is way too nice to tell him straight away even if he is not interested; or to forget about his crush altogether if all he plans to do is keeping quiet. But Yoongi finds himself drawing circles in the dirt with the tip of his shoes, keeping the words to himself. He barely knows Jimin, but somehow he doesn't really want to give shitty suggestions that may make the kid cry. Contrary to the common belief, Yoongi can be nice. Sometimes. Especially when the object of his kindness is a round-cheeked puffy-haired toddler.</p>\n<p> </p>\n<p> </p>\n<p>It turns out that Yoongi and Jimin stay in the same part of the city, the part whose name so foreign to even the native's tongue that Yoongi has to repeat a few times whenever someone asks, the part that is half-an-hour of standing in a bus so packed you can't even fall, and another half-an-hour of a-vacant-seat-finally away from their school.</p>\n<p>\"I thought you looked familiar.\" Yoongi comments, after both of them manage to squeeze through the crowd to sit down at the back of the bus \"Not many people stay here normally.\"</p>\n<p>\"Nobody stays here.\" Jimin nods \"Unless they are not from Seoul, and not rich enough to afford an apartment elsewhere.\"</p>\n<p>\"You're from Busan?\"</p>\n<p>\"Yes\" Jimin grins all the happiness in the world. \"Hyung?\"</p>\n<p>\"Daegu\" And Yoongi finds it easy to match it with his own.</p>\n<p>It's strangely comfortable, sitting shoulder-to-shoulder and chatting. Jimin is easy to talk to, like that friendly classmate at the beginning of a new school year, who sits with you at lunch and lends you their erasers when you have yet to remembered the unfamiliar faces. Yet at the same time, underneath the bubbly facade, Yoongi can almost see the kid drafting his words in his mind, can almost tell the nervousness in his laughs. Jimin is the kind that is genuinely loving and easily trusting and sweet but at the same time worrying too much, and he would rather crack a cold joke and laugh at himself than endure awkward silence. He is clumsy with words, asks a lot and smiles even more, making Yoongi wonder if the kid was born naturally happy and excited about everything.</p>\n<p>Yoongi also wonders if Hoseok would like him.</p>\n<p>He doesn't really pay this much attention to people, but Jimin with his being kinda cute without even trying is hard to ignore, and especially when he is Hoseok's potential boyfriend. Although their hypothetical relationship is unlikely to happen any time soon.</p>\n<p>When they get off the bus at their stop, Jimin sways on the ball of his feet and looks at Yoongi with an unsure, half-expectant look in his eyes. Yoongi sighs before unbelievable words start rolling out on his tongues.</p>\n<p>\"Do you want to go to school together tomorrow?\"</p>\n<p>\"Yes!\" Jimin literally jumps, beaming \"I mean, sure, if you don't mind... hyung...\"</p>\n<p>\"But I usually take the earliest bus to avoid the crowd, and sleep, so-\"</p>\n<p>\"It’s okay! I can wake up early!\" Jimin says eagerly, still half bouncing on his feet, very much like a hyper puppy and it takes Yoongi all of his resistance to not reach out and pet Jimin’s head.</p>\n<p>Yoongi shakes his instead and clicks his tongue amusedly \"Are you that desperate for a friend?\"</p>\n<p>\"See you tomorrow hyung!\" The puppy shouts and runs away, still waving, before Yoongi has a chance to rethink his offer.</p>\n<p>Not until the kid's blue backpack disappears into the rush hour crowd that Yoongi realizes the pink envelope still lies safely in his bag.</p>\n<p>\"See you tomorrow.\" Yoongi mumbles to noone.</p>\n<p> </p>\n<p> </p>\n<p>The next morning Yoongi sleeps through hundreds of alarms and takes around ten years to peel himself off from the warm comfort of his bed. When his eyes can finally stay open long enough for his brain to register the blinking digits on his watch, Yoongi thinks he may have kept someone waiting for half an hour. A normal rational person would have boarded the first bus that arrives. But if Park Jimin is anything like the Park Jimin Yoongi spent one hour talking to the day before, he is probably still there at the stop, waiting, pacing impatiently, and possibly cursing Yoongi under his irritated breaths.</p>\n<p>It turns out that Yoongi was wrong. Jimin is neither grumbling nor punching holes into the air. Instead, when the elder boy arrives, the kid is slouching on the plastic chair, chin resting on the huge backpack snugly hugged in his arms, forehead and cheek pressing against the glass panel holding the out-dated ramyun advertisement; his eyes shut close and mouth slightly open. Yoongi has to hold back his chuckle when he comes near enough to hear the soft snores. Deciding not to interrupt the kid's sleep, he sits down on the next chair, tapping his foot quietly to the buzzing sound of a city stirring awake, and to the rhythm of Jimin's slow breathing. It’s five minutes later, and five minutes before the next bus arrives, when the first ray of sunlight starts bouncing on Jimin’s eyelids and the younger boy’s eyes blink open.</p>\n<p>“Hyung… you’re here?” Jimin rubs his eyes with the back of his hand, half-yawning. There’s a red circle on his cheek where he leans against the hard panel, and in his mind Yoongi acknowledges how adorable that looks before he can stop himself.</p>\n<p>Yoongi thought about apologize for showing up late, especially when he was the one who suggested them to meet early, but seeing Jimin wipe his drool of his mouth in panic, he kinda forgets what he planned to say, and the words coming out of his mouth end up sounding slightly different “Are you an idiot? Why are you still waiting here?”</p>\n<p>“I thought you would come soon, so I decided to just wait for you and so we can catch the next bus together. But I fell asleep.” Jimin giggles. His eyes to crescents and Yoongi finds himself lost for words.</p>\n<p>“Your phone?”</p>\n<p>“Huh…?”</p>\n<p>“Give me your phone!”</p>\n<p>Jimin hesitantly drops his phone in Yoongi’s open palm, stares curiously as Yoongi punches something in and throws it back.</p>\n<p>“I put my number in there” Yoongi scratches his head “so, please, next time, if I falls into a pit on my way and doesn’t show up, just drops me a text and leaves, instead of sleeping here and getting kidnapped.”</p>\n<p>“Thanks, hyung.” Jimin smiles as if he has just been given a free-pass to all the exams in high school, and Yoongi, again, finds the kid’s cheerfulness baffling.</p>\n<p>“Don’t you have friends?” Yoongi raises a judging eyebrow, but his tone is less mocking than he intended it to be.</p>\n<p>“I do” Jimin huffs, as he slides his arm under the straps of his backpack “I just don’t have that many choices for bus companions” and Jimin dodges Yoongi’s kick with yet another grin as they climb up the steps to their morning ride.</p>\n<p> </p>\n<p> </p>\n<p>The trip to school feels surprisingly shorter, although Yoongi cannot recall half of the things Jimin was chattering away about on the bus by the time they reach the school gate. It's possibly because Jimin is distracting, the way he tends to pout a little when he talks, plump lips rounding the vowels and pursing at the consonants, and coupled with the conspicuous satoori in his voice, Yoongi can't help being sidetracked from the stories. Or maybe it's because his sluggish brain can't seem to keep up with the amazingly animated boy, way too energetic for someone who fell asleep and drooled on his bag mere minutes ago, but Yoongi can’t complain about the way Jimin's adorable brightness rubs off on him, or rather, he doesn't quite want to.</p>\n<p>\"Hey, hey!\" Yoongi watches as the ball of energy bounces on his feet, waving at someone in the crowd.</p>\n<p>\"Hey, Jiminie!\"</p>\n<p>Two guys make their way towards them, one with a grin as huge as Hoseok's and the other with big brown eyes that remind Yoongi of a bunny, or maybe a chipmunk. Yoongi was ready to flee the scene -it's way too early for any kind of social interactions, but Jimin seems eager to introduce him.</p>\n<p>\"Hyung, here are my friends, Taehyung\" the grinning guy gives a 90 degree bow with a half-yelling \"NICE TO MEET YOU\" that makes Yoongi fall back one step \"and that is Jungkook\" the bunny just gives a quiet shy nod, thankfully, because his weak heart may not be able to handle another loud greeting.</p>\n<p>Both of them are half a head taller than Yoongi (Kids these day!), and  Yoongi quickly decides that Jimin is his favorite, solely for the fact that he is the only one shorter.</p>\n<p>“And this is…” Taehyung stares intensely at Yoongi.</p>\n<p>“Err… I don’t know...” Jimin tilts his head and taps his chin with his finger “what’s your name again, hyung?”</p>\n<p>“Brat!” Yoongi punches Jimin’s arm, and his assault leaves Jimin but laughing satisfactorily.</p>\n<p>The bell rings before Yoongi manages to come up with a retort and the fluffy black hair hops its way away into the hallway, Jimin’s giggles are still resounding in Yoongi's sleepy head.</p>\n<p> </p>\n<p>Classes are expectedly boring. Yoongi stares invisible holes into his teacher’s forehead as she rambles on for another hour about theories and formulas that half the class don’t care about, even though they are “absolutely important”, double-underlined, white chalk standing starkly against the black board. On his left, Hoseok is already fast asleep, drooling all over his notebook - the only time of the day when he is not acting like a hyperactive goofball. Right in front of the sleeping beauty, Namjoon is tapping away on his Nintendo, hidden under his desk, clicking sounds conveniently covered by someone’s annoying foot tapping, yet the kid still occasionally raises his hand to answer questions, as if he has been following the lesson all along. Lucky brat! If only Yoongi was born with a high-performance central nervous system too, he would have been able to catch up with his academic pursuit after his appendicitis and avoided having to retake his junior year. Then again, if he hadn’t, he probably wouldn’t have met either Hoseok or Namjoon. And although the two little shits deserve to be thrown into the traffic sometimes, he can’t really imagine his last two years of high school without them.</p>\n<p>Yoongi is considering joining Hoseok in dreamland when his phone buzzes.</p>\n<p>It’s a photo of that rectangular-grinned boy he met in the morning, sporting a ridiculous lop-sided orange wig, wearing thick-rimmed glasses and blood red lipstick, posing in some sort of way that shows off his “bosoms”, which are obviously made of crumpled paper balls. Before Yoongi figures out the many things that are happening in the photo, his phone buzzes again and now a woman appears behind Taehyung, looking undeniably pissed off, holding a thick ruler in her hand.</p>\n<p>Buzz. The boy glances behind.</p>\n<p>Buzz. He runs and trips on the way back to his seat, his left boob falling out. </p>\n<p>Yoongi snorts. The whole class is now looking at him. Mrs Kim gives him a disapproving huff.</p>\n<p>“Sorry” Yoongi mumbles. Namjoon throws him a confused frown before turning back to his game.</p>\n<p> </p>\n<p>Yoongi: I've just snorted out loud in class</p>\n<p>Yoongi: can you kids please not disrupt my education</p>\n<p>And Jimin sends him a sticker of a laughing cat.</p>\n<p> </p>\n<p> </p>\n<p>It becomes regular. They become regular, riding the bus to school, riding the bus back. Sometimes they talk all the way; sometimes they catch up on their sleep. One time they miss their stop and walk for fifteen minutes home, because Jimin doesn’t bring enough cash to make the return trip and Yoongi spends his last note getting a tiny cup of tteokbokki that Jimin steals half of. And Thursday afternoon is always basketball, or as how Yoongi prefers to call it - \"Yoongi owning Jimin's ass session\", unless the latter freaks out about a test happening the next day and refuses to leave the library until Yoongi comes knocking on the glass door, gesturing that it’s time they went home.</p>\n<p>“What subject is it tomorrow?”</p>\n<p>“Chemistry. It’s next week.” Jimin groans “And I still can’t remember the five oxidation states of Magnesium-”</p>\n<p>“You mean Manganese.”</p>\n<p>“Kill me now, hyung. Help me. Stop this suffering.” Jimin whines, fake sobbing into his small hands.</p>\n<p>It makes Yoongi laughs, lips stretching ear to ear, warmth reverberating in his chest, and Yoongi reaches up to ruffle Jimin’s hair before he is even aware that he’s been wanting to do it.</p>\n<p>“You’ll be fine. I mean, with your brain I don’t think you’ll get A, but you’ll… possibly pass.”</p>\n<p>Jimin pouts. “Remind me to never ask you for encouragement again.”</p>\n<p> </p>\n<p> </p>\n<p>Yoongi: hey</p>\n<p>Yoongi: do you still have your chemistry notes?</p>\n<p>Namjoon: hyung do I look like I need notes to study for exams?</p>\n<p>Yoongi: brat</p>\n<p>Yoongi: k bye</p>\n<p>Namjoon: why are you studying chemistry anyway…?</p>\n<p>Namjoon: hyung?</p>\n<p>Namjoon: hey</p>\n<p>Namjoon waits forever for a reply because Yoongi abandons their conversation to dig through his pile of dust-covered textbooks and files, hoping that he hasn't thrown out his things from the past years. It’s never his default state but Yoongi can be nice. Sometimes. Especially when the object of his kindness plead to be saved from suffering, with puffy cheeks and an almost-adorable pout.</p>\n<p> </p>\n<p>“Are these Chemistry notes?” Jimin gasps at the stack of paper that has just landed in his hands.</p>\n<p>“No, they are my paintings. Of course they are Chemistry notes you idiot!”</p>\n<p>“Is… is this… Hoseok hyung’s…?” Jimin squints at the scribbling and tilts his head, as if that was supposed to help him see better.</p>\n<p>“They are mine” Yoongi deadpans at the younger boy and Jimin sulks “Give it back if you don’t-”</p>\n<p>“NO, I WANT IT!” Jimin presses the papers to his chest and turns his back towards Yoongi, shielding the notes in case they will be taken back. “Thank you so much hyung!” and comes the familiar giggles.</p>\n<p>Yoongi doesn’t think that he feels hurt, but his lungs constrict in an odd way.</p>\n<p>“When did you like Hoseok anyway?”</p>\n<p>If there was a switch to turn Jimin into a human-faced tomato, Yoongi must have pressed it. Jimin zips open his bag and slips the notes neatly inside, taking a little too long to smooth out the dog-eared corners.</p>\n<p>“I guess… after the club fair at the beginning of the year… when Hoseok hyung did that freestyle dancing in front of everyone. He was just, I mean, I have never seen someone dance so well before.”</p>\n<p>“Why don’t you join the dance club?”</p>\n<p>“I can’t, I don’t dance.”</p>\n<p>“Well. That’s too bad” Yoongi tugs his hands into his pockets. “I guess it doesn’t matter that they are having audition next Thursday then.”</p>\n<p>From the corner of his eyes, Yoongi catches the twinkle in Jimin’s. But the kid bites down on his lower lip, fingers inspecting the hem of his shirt and a little frown of uncertainty etches itself between his brows. Yoongi can tell Jimin needs that little push from Yoongi, as usual, except for this time, he is not completely sure he wants to help.</p>\n<p>\"Just do it\" Yoongi says eventually, turning to face Jimin and Jimin turns towards his voice until their eyes meet. \"Sign up for the audition. Even if it's not for Hoseok. Do it for yourself! You watch dance videos all the times, so why don't you give it a try? And I know the people there. You'll like them.\"</p>\n<p>For a moment, Jimin stays quiet, thinking, probably, blinking at a point on Yoongi’s face and something within Yoongi squirms under the impossible weight of Jimin's gaze. He hears his own words echoing in his head. It doesn’t have to be about Hoseok. It doesn’t mean that they will end up together. It’s just Jimin’s trying out something that he likes. So there is no reason for the tightness in his chest.</p>\n<p>\"Thanks hyung\" Jimin flashes a shy smile, and Yoongi mirrors it with his own.</p>\n<p> </p>\n<p> </p>\n<p>Next Thursday the weather is hell. The court is scorching hot, the air feels thick and suffocating, sweats drip from Yoongi’s face and boil off the concrete.  After half an hour, his eyes sting too much for Yoongi to focus on shooting the basket, so he sits down in the shade and checks his phone – there is still no reply after his \"Don’t trip over yourself” and the hesitant \"Good luck\" that followed. Yoongi ends up lying down on the bench, stretching his tired limbs and throwing a hand over his forehead. The sun is more forgiving on Yoongi’s face now that its sunlight is filtered through the leaves of the old oak tree. A rare breeze flirts through the thin branches, stirring up the dirt on the court and Yoongi finds his mind drifting back to that lethargic afternoon, when Jimin folded himself over the railing, balancing and swaying along an unrecognizable tune he was humming to himself, while Yoongi, half-sitting, half-lying on the spectator seat, traced the faint outline of the summer clouds with his eyes and counted the days since they had any rain.</p>\n<p>“Hyung… what is your plan after high school? Are you going back to Daegu?”</p>\n<p>The question surprised Yoongi. Not because of the idea itself, since that thought was something he had traded sleeping hours to gnaw on, to spit out his answer until there is not a single trace of doubt. He was taken aback because it came from Jimin, the kid whose spirit always seems to be five feet above the ground.</p>\n<p>If it was someone else, Yoongi would have lied and said he hadn’t thought much about his future, or that his aspiration was just like the rest of the highschoolers in his class. But it was Jimin and the non-judgemental tone of his voice, the genuine admiration for even the littlest things, Jimin and his wearing emotions on his sleeves that made Yoongi feel guilty for not reciprocating with the truest thoughts in his mind. At the same time, it was also the Jimin that he knew barely a few weeks ago and Yoongi didn’t want to pour his heart out and scare him away, Yoongi really didn’t. The words teetered on his lips half a second too long and the moment passed.</p>\n<p>“I don’t know”</p>\n<p>“Oh…” Jimin jumped off the flight of stairs and squatted down next to Yoongi, his tiny self carving its spot in the elder boy's personal space. Jimin is always too close but part of Yoongi has grown to like it. “It’s okay hyung. I think you will succeed whatever you do.”</p>\n<p>Jimin grinned, eyes squinting, holding up his chubby thumbs.</p>\n<p>Yoongi cringed his nose in disbelief- and yet he knew Jimin didn’t fake it just to be polite, because he could tell that the younger boy meant the words he said, that he treated Yoongi with faith and confidence he had yet to learn to give himself. But why - he doesn't know. Yoongi thought he got Park Jimin all figured out, but one word and he found himself fumbling through the pages of his analysis wondering what he had missed.</p>\n<p>Jimin was still grinning. Until his smile got too blindingly bright and Yoongi squeezed his eyes shut.</p>\n<p> </p>\n<p>“Woohoo~ Yoongi hyung~”</p>\n<p>Yoongi thinks he hears something. His foggy mind refuses to let his eyes open. But something cold touches his cheek and he jolts awake. A mob of puffy black hair realizes in his sight.</p>\n<p>“Hyung!!! I am in! I got through the audition!” Jimin hops on the spot, half-shouting.</p>\n<p>“I see they lowered the standard this year.” Yoongi chuckles mid-yawn.</p>\n<p>But Jimin is too ecstatic for his excitement to be dampened by Yoongi’s sour humour “Thank you hyung!” he shouts again, before throwing his arms around Yoongi, and the latter turns into stone upon the contact.</p>\n<p>Hugging is a social convention that Yoongi doesn’t get, something Hoseok has learnt the hard way not to pull one on his hyung, unless he has a death wish. But here Yoongi is, squished awkwardly in Jimin’s arms, and he is not sure how to react. It takes him five seconds, only until Jimin’s sweat starts to slip onto his skin, to shove Jimin away.</p>\n<p>“Gross. You are drenching wet.” Yoongi frowns as he examines the stain on his own uniform.</p>\n<p>Jimin is still grinning “Oh, Taehyung and Jungkook got through too! We will be joining official trainings next month.”</p>\n<p>“And so, to repay me for my precious advice, you want to treat me to dinner?”</p>\n<p>“No” Jimin sticks out his tongue “But I brought you drinks.”</p>\n<p>“Cheapskate” Yoongi huffs, feigning disappointment, but grabs the drink from Jimin’s hand anyway. Jimin got his favourite drink, of course.</p>\n<p>At some point, Yoongi thinks he ruffles Jimin hair and mutters “Congrats”. But he may have been hallucinating. It is a really hot afternoon anyway.</p>\n<p> </p>\n<p> </p>\n<p>***</p>\n<p> </p>\n<p> </p>\n<p>The Coffee’s Prince café is a small, quiet place, 3 bus-stop and ten-minute of walking from school, selling killer waffles that make your mouth water with just their tantalizing fragrance. But Yoongi’s group frequent it mostly because Jin works part-time there, and the eldest boy is easily pestered into giving them an obscene amount of discount whenever they drop by. They got back their English tests last Friday, so Hoseok suggested to go out and celebrate the fact that none of them failed, as well as to give Namjoon a chance to treat them for scoring full mark and making the rest look like sitting ducks in their teacher’s eyes. Again.</p>\n<p>Yoongi’s phone buzzes. Jimin sends him yet another photo of a stray cat he finds on his way to the grocery store, a ginger one, rather “sassy” and “obnoxiously picky” according to Jimin’s description. His phone buzzes again. The cat runs away with a fish in her mouth. Jimin sends him a crying sticker – “She used me for my food and she abandoned me.”</p>\n<p>Yoongi laughs.</p>\n<p>“Oh my god” Hoseok gasps “who are you and what did you do to our Yoongi hyung?”</p>\n<p>“What?”</p>\n<p>“Yeah” Namjoon nods in agreement “Min Yoongi checking his phone every minute and grinning mysteriously at the screen. Are you alright?”</p>\n<p>“Am I not allowed to laugh when someone sends me something funny?”</p>\n<p>“When do you ever find anything funny?” Namjoon snickers.</p>\n<p>Yoongi is about to comment that it is because of the group's notably poor sense of humour, when Jin flops down in the last chair at their table.</p>\n<p>“Just finished my shift.” Jin takes a sip out of Hoseok’s glass “So what are you guys talking about?”</p>\n<p>“We are suspecting that there is a guy in Yoongi hyung’s life.”</p>\n<p>“So you guys noticed too, huh?”</p>\n<p>“What do you mean “noticed”? There is no one to notice.” Yoongi protests. He doesn’t mean to hide. Because there is <em>nothing</em> to hide. It’s just rather inconvenient to tell his friends about Jimin, when all of them think that there is something more than friendship. And especially even more inconvenient when the suspect’s actual love interest is Hoseok and not him.</p>\n<p>“Poor pink-envelope guy…” Namjoon sighs dramatically into his palm.</p>\n<p>“But yay for mysterious kakaotalk guy!” Hoseok says, raising his glass.</p>\n<p>If only they knew those are the same person.</p>\n<p>“Yay for Yoongi’s first relationship!” Jin joins in.</p>\n<p>Yoongi stares at his friends incredulously as they start clinking their glasses and saying cheers. Why is he friend with these idiots?</p>\n<p>“Jokes aside” Jin puts his glass down and turns to Yoongi “I like how he makes you smile.”</p>\n<p>“He doesn't” Yoongi grumbles “I smile on my own accord”.</p>\n<p>“So, there’s a ‘he’!” Namjoon snaps his fingers.</p>\n<p>“There’s no- ugrhhh”</p>\n<p>Everyone starts laughing and Yoongi buries his burning face in his palms.</p>\n<p> </p>\n<p> </p>\n<p>The fact that Jimin and his friends have become members of the dance club, where Hoseok is the president, means that they are now in the same social circle and end up having lunch together in the cafeteria quite often. Jimin tends to stare sometimes and Yoongi has to nudge him under the table to remind him to stop. But Hoseok seems too fond of the new addition to their group, making a habit of throwing his arms over Taehyung’s shoulder and ruffling Jungkook’s hair, to notice any different kind of friendliness. Hoseok has also developed a special liking for Jimin’s cheeks, poking and pinching them every time they meet. When he eventually lets go, the poor boy’s face is bright red and Yoongi can’t tell if it is because of Hoseok’s violent form of affection or Jimin’s blushing at their contact.</p>\n<p>“Ouch… that hurts, hyung…” Jimin rubs at the redness on his face.</p>\n<p>“Yeah, Hoseok, I think your teasing is getting too much.” Yoongi says.</p>\n<p>“But I can’t help it” Hoseok cups Jimin’s face in his hands again “Jimin-ie is so cute. Don’t you find him cute too, hyung?”</p>\n<p>Yoongi replies with a lie.</p>\n<p> </p>\n<p>Jimin still texts Yoongi into the night, as if they didn’t spend the entire trip home talking. But Yoongi can’t help thinking about Hoseok’s pinching Jimin’s cheeks, about Hoseok’s arm around Jimin’s waist, about Jimin’s glancing and blushing at Hoseok’s smile, about himself noticing it all and so he hastily tells Jimin that he wants to sleep, before lying face down on his bed and letting his head sink into the pillow, waiting for the voices questioning him about the funny feelings squirming in his stomach to be muffled out.</p>\n<p> </p>\n<p> </p>\n<p>***</p>\n<p> </p>\n<p> </p>\n<p>The end of year exam passes painfully with endless complaints and countless curses. In the process of mindlessly diving into the painful course of education and fighting it with all their might, or in some cases, just giving up altogether, the six boys find their high school lives settling around each other (seven if the college student Jin is to be counted). But somewhere between asking Jimin to save him a seat in the library, and being forced to give the younger boy a morning call on the days of their exams, Yoongi’s feelings become unsettling. He starts thinking and smiling and sighing about things that don’t matter, like how Jimin rests his head on his bony shoulder when he falls asleep on the way to school, how Jimin musses up his hair in frustration whenever Chemistry homework is involved, how Jimin likes to hug Yoongi and snuggles up for no reasons and complains that his hyung is too thin, and how Yoongi always ends up taking a second too long to push him away. He starts to like the way his name sounds with a faint Busan accent. He knows when Jimin text is coming and sometimes he opens his phone even before the notification buzzes and it scares him. Everything scares him, in fact. Because those things shouldn’t matter. Because it is uncanny for Min Yoongi to grow fond of someone so quickly. Because the pink enveloping resting against his pencil cup was meant for someone else.</p>\n<p> </p>\n<p>Jimin: goodnight hyung~</p>\n<p>Jimin: pleaseeeee wake me up at 5.30 tomorrow hyung~</p>\n<p>Yoongi: have you ever heard of an alarm?</p>\n<p>Jimin: but I prefer your scowling voice</p>\n<p>Jimin: ㅋㅋㅋㅋㅋ</p>\n<p> </p>\n<p>Yoongi replies with a threatening cat with glaring eyes, and a sleeping one with “ZZZ” written on top of its head, before flopping face-down into his pillow again.</p>\n<p> </p>\n<p> </p>\n<p>Apparently Yoongi is not the only one growing a heart problem because Hoseok finds a pink envelope in his locker one day and Yoongi feels as if his feet were melting into the floor at the sight of it. Until Hoseok opens the letter and there lies a handwriting that he doesn't recognize. But Hoseok tugs the paper away before Yoongi manages to read past the first paragraph.</p>\n<p>“Hyung, please don’t tell anyone!”</p>\n<p>“Why?” Yoong eyes Hoseok “Do you know the person?”</p>\n<p>“I think I do.” Hoseok scratches his head “And I am going to meet him this Saturday. So please, don’t tell anyone yet!”</p>\n<p>The first thing – the first person, to be accurate - that comes to Yoongi’s mind is Jimin, and that he should be worried, for some reasons. But Jimin probably doesn’t know, and what he doesn’t know won’t hurt him right?</p>\n<p>But apparently Yoongi was wrong about Jimin's not knowing, because on Saturday he spots the puffy mob of black hair behind the tall gate leading to the old basketball court. So Yoongi sneaks into the bush next to the crouching eavesdropper.</p>\n<p>“What are you doing?” Yoongi whispers.</p>\n<p>Jimin jumps, almost yelping out loud, and stares back at Yoongi incredulously.</p>\n<p>“Hyung what are you doing here?”</p>\n<p>“I am asking you the same thing”</p>\n<p>“Shhhh-”</p>\n<p>The sound of footsteps turns Yoongi’s attention back to the empty court, where two boys suddenly come into view.</p>\n<p> </p>\n<p>\"Kim Taehyung!\"</p>\n<p>\"JUNG HOSEOK HYUNG!\" Taehyung's yelling is so loud that it makes meeting in such a secret place rather pointless.</p>\n<p>\"So, you, uhm, wrote me that letter\" Hoseok says, and Jimin tenses next to Yoongi.</p>\n<p>\"AISHITERU\" Taehyung shouts again, borderline threatening.</p>\n<p>\"What...\"</p>\n<p>\"WO AI NI HAO MA\"</p>\n<p>\"Taehyung please-\" Hoseok inches closer.</p>\n<p>But Taehyung doesn't seem to have finished his traumatizing mating calls \"JE TE AIME\" he shouts, and before Hoseok can even react, begins to sing in an incredibly low husky voice \"Loveeeee me tender, love me sweet, never let me goooo\"</p>\n<p>Yoongi can't see his face right now but he bets it must look like a mixture of shock and horror, because it feels as if he was being forced to watch a poorly written romantic comedy, starring two of the weirdest friends he has, one of whom is now belting out an Elvis Presley classic, and the other looks like he is considering a hundred and one ways in his head to stop the former from making loud noises.</p>\n<p>Hoseok moves quickly. His hands come up to hold either side of Taehyung's face, and then Hoseok presses their lips against each other's. That shuts Taehyung up, and squeezes out a soft whimper from Jimin at the same time.</p>\n<p> </p>\n<p>In Yoongi's head he is doing something really dramatic, very much akin to the sappy series Jin forces on him, like grabbing Jimin by the wrist and dragging the younger boy out of there, or turning Jimin by his shoulder so his face is buried in Yoongi's chest (although the little difference in their heights does not really allow the second scenario to happen).  But in real life, there is solid lead anchoring his limbs down to the ground. Only when Hoseok pulls back from a breathless Taehyung five seconds later does Yoongi manage to mumble a soft \"Let's go\" to Jimin, and the both of them scurry away, five seconds too late.</p>\n<p>Jimin follows Yoongi without a question, without any words as a matter of fact, and Yoongi has to look back every other minute to make sure that the heartbroken boy does not just flop down to a random corner to mope. Jimin's eyes look a little vacant, his soft cheeks drooping and Yoongi is not used to that. So instead of leading them both to the bus stop, he walks in a different direction.</p>\n<p>\"Where are we, hyung?\" Jimin asks, scanning the unfamiliar green door as Yoongi slides in the key and clicks the lock open.</p>\n<p>\"My secret place\" Yoongi smiles as he pushes the door open.</p>\n<p>The tiny room is the same as how it looked the last time Yoongi was there to record his latest track, which was before the frenzy mess of exams began; his stack of scribbled lyrics still lie scattered on the dusty desk, the faint coffee stain is still visible next to the mouse.</p>\n<p>\"Welcome to the producing cum recording studio cum school radio station, a.k.a your hyung's secret hiding place when class gets too boring.\" Yoongi drops his sling bag on the chair and turns to Jimin, who is still looking around in great caution and awe \"In other words, tell anyone about this room and you're dead meat.\"</p>\n<p>Jimin nods docilely before he inches closer to look at rows of buttons and knobs lining up in front of him, lips mumbling out their labels. Yoongi leaves the younger boy to himself and flips the various switches on the wall in one swift familiar motion. The place slowly stirs alive.</p>\n<p>The desktop flashes the start-up screen. Yoongi quickly types in \"vj_suga\" under account, followed by a string of asterisks under password.</p>\n<p>\"Hyung, you are VJ Suga?\" Jimin gasps.</p>\n<p>\"Yeah\"</p>\n<p>\"So you are the one in charge of the Friday music program?\"</p>\n<p>\"Yeah, that’s me.\" Yoongi bends over to grabs a box from underneath the table \"Nobody is interested in using this room since the multimedia club closed down. So I asked for access to all these expensive equipment, which otherwise would just be lying here and collecting dust\" Yoongi explains as he open the box to reveal his treasured Maschine, pliant and waiting under his fingers \"the school agreed, with a condition that I had to be responsible for the school radio channel, which wasn't a bad deal at all since I basically just have to play some music and helps them make announcements, sometimes.\"</p>\n<p>Jimin quietly settles down next to Yoongi, curiously staring as the latter unwinds all the complicated wires and plugs into the strange-looking device.</p>\n<p>\"This is a Maschine. Half paid for with my own money, the other half with my amazing persuasion skills. I use it to produce music.\"</p>\n<p>\"You produce music?\"</p>\n<p>Yoongi passes Jimin the right side of his earpiece as he double clicks a folder named \"mixtapes\".</p>\n<p>And so the afternoon passes without their talking about the elephant in the room. Yoongi shows Jimin his various records, tells him about the various functions of his Maschine, lets him listen to his songs and read his lyrics. Yoongi has never talked so much before but he can’t stop. He feels as if he would open a floodgate if he doesn’t keep going. He can deal with a distracted Jimin whose smiles don’t quite reach his eyes as much as usual. But he doubts if he can provide a shoulder soft enough if Jimin cries.</p>\n<p>“Hyung” Jimin speaks as they pack up their things “is this what you want to do when you grow up?”</p>\n<p>Yoongi chuckles a little at “grow up”. Jimin can be really cute even when he’s not really trying. “Yeah, I guess.”</p>\n<p> </p>\n<p> </p>\n<p>Jimin does not talk much on the bus and Yoongi runs out of stories. So they just sit next to each other until the unusual silence becomes too suffocating for Yoongi.</p>\n<p>\"If you need to cry-\"</p>\n<p>\"I told Taehyung to confess, hyung. Do you think I am stupid?\"</p>\n<p>Yoongi stares at Jimin's watery eyes and he thinks he sees an idiot, a kind idiot who puts his friend before himself, an idiot who probably needs a warm hug and a reassuring squeeze of hand. Except for he probably wants all of that from someone else, not the guy sitting next to him, who is clueless around a Jimin that is not his usual hyper kitten self, who has been secretly crossing his fingers hoping that Jimin doesn't cry.</p>\n<p>\"Yeah. You are. Very.\" Yoongi sighs.</p>\n<p>Jimin blinks at Yoongi, and the latter can tell that the kid can pick up the softness in his voice. Jimin smiles sadly, lips pressed thin and curved up.  Their conversation is left at that. And despite having acknowledged Jimin's idiocy verbally, Yoongi hopes the younger boy is smart enough to know that Yoongi would have smoothed his hand down Jimin's back if he could.</p>\n<p>When they get off the bus, Jimin says \"Thank you so much, Yoongi hyung...\" And he smiles, with visible strain on his cheeks, but his eyes turn crescent anyway and Yoongi finally feels a rush of oxygen back into his lungs.</p>\n<p>\"Fine\" he stretches out his arms, feigning an annoyed look \"Here. A hug. I am giving you since you probably need one.\"</p>\n<p>Jimin drops his jaw and rounds his eyes. But before Yoongi feels stupid enough to withdraw his arms and stop waiting, Jimin steps in and presses himself against Yoongi.</p>\n<p>The younger boy leans his forehead against Yoongi's shoulder blade, his arms hanging lifelessly along his side instead of crushing Yoongi's ribcage. So Yoongi takes over Jimin’s usual role and snakes his arms around Jimin. God, does Jimin feel tiny in his hug. And warm. And Jimin smells like summer afternoon with green grass and floating dandelions. Like something Yoongi would love to hold close in his palm for a while.</p>\n<p>\"....ank you\"</p>\n<p>\"What's that?\"</p>\n<p>\"Thank you, hyung.\"</p>\n<p>Yoongi smiles \"If you tell anyone about this I am gonna murder you.\"</p>\n<p>Jimin giggles against Yoongi’s chest and the elder boy finds it easy to breathe again.</p>\n<p> </p>\n<p>The next morning, Jimin texts Yoongi that he is not going to school. Yoongi asks if he is that heartbroken about Hoseok and Jimin sends him a selfie of himself wrapped in thick blanket like a cocoon, with puffy eyes and tissue paper stick up his red nose. Yoongi says \"wow I hug you once and you fall sick do you hate me that much?\", to which Jimin replies \"ㅋㅋㅋㅋ\", tells Yoongi he is getting back to sleep, wishes Yoongi a good day in school and not missing him too much.</p>\n<p>Missing Jimin? Yoongi sniggers at his screen before slotting it back to his pocket. The day passes with insufferable boredom.</p>\n<p> </p>\n<p>On the way home, Yoongi finds a white stray cat licking his paws on a chair at the bus stop. The obnoxious creature doesn't even flinch when Yoongi approaches with phone in his hand. When it hears the shutter , the cat glances at Yoongi with a barely interested look in his eyes. \"For Jimin\" Yoongi explains as he opens Kakaotalk, and, as if the cat understood, it turns back to its daily cleaning routine. Jimin goes \"awwwwwwwwww\" and also sends a sniffing emoticon. The kid is probably still sick.</p>\n<p>And it suddenly dawns on Yoongi that he did indeed just take photo of a cat and send to Jimin. And while it’s partially because he hopes the blurry photo of a startled feline makes Jimin feel better. But it's also because now every darn kitten somehow reminds him of Park Jimin.</p>\n<p>\"What has Park Jimin done to me?\" Yoongi turns to sigh at his apathetic conversation partner.</p>\n<p>The animal glances at him one last time before hopping off the chair to do whatever a cat does when its relaxing afternoon is disturbed by a smitten teenager. Rude, Yoongi thinks, Jimin would at least have waved and smiled.</p>\n<p> </p>\n<p> </p>\n<p>Hoseok and Taehyung become official, grossly couply and touchy and greasy. But Yoongi hasn’t been paying much attention to them, or the endless complaints from Namjoon about feeling like gagging up his lunch because of the couples’ public display of affection – he is too busy holding his breath and watching as Jimin carves even a deeper space in Yoongi’s life. The kid probably clings to Yoongi even more now because he’s subconsciously trying to get away from seeing his crush and his best friend together. Yoongi’s probably just an excuse but he lets himself be okay with that.</p>\n<p>Jimin asks to come to the studio when Yoongi works sometimes, and despite complaining that the younger boy is an unwanted distraction, Yoongi always says yes. When he is there, Jimin either lies on the couch and plays with his phone until he falls asleep, or simply sits quietly next to Yoongi and watches the latter adjusting beats and rewriting verses for a few hours. Sometimes he leaves the studio and comes back with two bottles of drinks. Sometimes Yoongi lets him choose the first track to be played on the radio next Friday. Other times Jimin tries to write his own lyrics, about his burning hatred for Chemistry, about the stray cat that rejects his affection, about tteokbokki that gives him burning stomachache and Yoongi laughs so hard it has him in stitches. There is one time Jimin writes about wanting to be better, about giving all that he has but it doesn’t seem to be enough, about being trapped in the same place and feeling his knees buckle under his weight. Yoongi still says that it sucks, but he tugs the piece of paper away between the pages of his notebook.</p>\n<p>“How can you not find it boring watching me in the studio?” Yoongi asks as he locks up the room.</p>\n<p>“I don’t know” Jimin smiles sweetly “You just look so cool. And whenever you are there, you just have this look in your eyes. It doesn't make sense, but it's when you seem most focused, but also most at ease. And happiest too.”</p>\n<p>“And that’s cool?”</p>\n<p>“Coolest!” Jimin grins, brighter than all the summer suns combined, and holds his two chubby thumbs up.</p>\n<p>Yoongi throws one arm over Jimin’s neck and pulls him closer, to ruffle the kid's puffy hair, and to hide the warmth spreading on his cheeks.</p>\n<p> </p>\n<p> </p>\n<p>“So…” Jin says as he sits down opposite Yoongi, placing their coffees neatly in the middle of the table. Warm white choc cappuccino for himself and iced Americano for Yoongi. Sometimes Jin jokes saying how Yoongi is as sweet and warm as his favourite drink.</p>\n<p>“So… what?” Yoongi gives his cup a small swirl before taking a sip.</p>\n<p>“You, and Jimin.”</p>\n<p>Yoongi should have known Jin’s complaining about the younger neglecting him was just an excuse for this conversation to happen. “What about me and Jimin?”</p>\n<p>“Don’t frown at me!” Jin sighs “You know what I am talking about.”</p>\n<p>Yoongi wishes he could come up with something, a reason, a story, a lie, anything that would not be rendered futile by the fact that Jin and Yoongi have known each other for technically their whole lives and Jin knows him better than he knows himself sometimes. But he knows better to even try. Besides, from all the times the whole group hangs out at the café and Jin shoots him a meaningful look from behind the counter, Yoongi knows too well that they are going to have this talk sooner or later.</p>\n<p>“Fine. I have a little crush. No big deal.”</p>\n<p>“What” Jin half screams “Min Yoongi’s having a crush and it’s not a big deal?”</p>\n<p>“Hyung do I look like a Kpop star?” Yoongi throws his hands up in frustration “Why is everyone so worked up about my love life?”</p>\n<p>“I think we all are because you don’t seem like you’re capable of liking anyone more than us most of the time.” Jin says and Yoongi can’t tell if the elder boy is serious “But anyway, tell me. Everything.”</p>\n<p>“There’s nothing to tell you about.”</p>\n<p>“Why? Shouldn’t you guys be together by now?”</p>\n<p>“No. We aren’t. And I am counting on the summer break to make these feelings go away.”</p>\n<p>“Huh?” Jin puts his cup down a little too loudly “You’re not gonna confess to him?”</p>\n<p>That thought passes briefly in Yoongi’s mind, and he is reminded of the afternoon when they first met, and of that heavy feeling in chest when Jimin told Yoongi that the words packed in the pink envelope weren’t written for him.</p>\n<p>“Jimin likes someone else.”</p>\n<p>Jin stares at Yoongi. His mouth open but no words are coming out. After ten seconds of turning into a still frame, Jin shakes his head. “You have no idea”</p>\n<p>“About what?”</p>\n<p>“Never mind” Jin smiles, blowing softly on the foam on his cup before taking a large sip. And Yoongi would have pressed Jin to spill whatever he has on his mind, if it wasn’t for the fact that he just really wants to the let the topic go.</p>\n<p> </p>\n<p> </p>\n<p>***</p>\n<p> </p>\n<p> </p>\n<p>The last month of the semester goes by almost in a blur. They get back their results and any disappointment is quickly replaced by the excitement for the special end-of-year school trip. The whole group signs up the moment they know this year’s destination is Jeju island. Well, everyone excluding Yoongi and Jimin anyway. Yoongi is neither that excited about travelling nor eager to spend money on what he deems to be non-lasting intangible benefits; while the younger boy has already planned to go home to see his family since months ago.</p>\n<p>“Jimin, I will bring back sashimi for you!” Taehyung yells, sticking his head out of the bus’ window.</p>\n<p>“You do realize he’s going back to Busan right?” Namjoon turns around after stuffing his backpack underneath his seat.</p>\n<p>“Oh right!”</p>\n<p>“It’s okay. You guys don’t have to buy us anything. Enjoy yourself. Take care of Jungkook.”</p>\n<p>“I’m not a toddler hyung!” Jungkook yells, although he’s nowhere to be found. The kid is probably playing on his iPad. The rest starts laughing at his upset reaction.</p>\n<p>The bunch is just as noisy as always, and it’s so odd but Yoongi thinks he already starts to miss them. The kids will be back in a week, and when they’re back, Namjoon and Yoongi will definitely spend half of their holiday hanging at Jin’s place, or finding a job if they're lucky, the other half going for hiphop concerts with their saved up money. Jungkook will be attending the vocal course his parents signed him up for. Hoseok and Taehyung will be doing whatever the couple is up to, which Yoongi would rather not know about. And Jimin, Jimin won’t be around until the next semester starts. Until then, the whole group won’t be able to meet up again.</p>\n<p>Yoongi reluctantly waves as the bus slowly moves away.</p>\n<p>“What are you going to do for the next two days?”</p>\n<p>“I’ll probably be packing for my trip home. How about you hyung?” Jimin looks at Yoongi. A breeze blows up his fluffy bang and his cute brown eyes blink at the irritation. Yoongi’s words fall off his lips and he ends up just staring, counting the lashes around Jimin’s eyes. Another blink and suddenly Yoongi realizes there’s a faint pink growing on Jimin’s cheeks. He quickly looks away.</p>\n<p>“I don’t know.” Yoongi coughs, tugging his hands into his pockets and unsaid words back at the bottom of this throat.</p>\n<p> </p>\n<p> </p>\n<p>The thing about summer is that you wish for free time for the whole year and now when you suddenly have too much on your hands you are not sure what to do with it. You end up missing people whose faces you thought you have grown sick of from meeting every day. Yoongi can finally sleeps in but he dreams about dragging himself out of bed early, about his daily bus rides and his little companion. So much for hoping that the summer heat will dry his silly infatuation away.</p>\n<p> </p>\n<p>Jimin: hyung!</p>\n<p>Jimin: hyung nim!</p>\n<p>Yoongi: who’s this?</p>\n<p>Yoongi: sorry I didn’t save your number</p>\n<p>Jimin: your favourite dongsaeng Park Jimin (&gt;_&lt;)</p>\n<p>Yoongi: you wish</p>\n<p>Jimin: I’m going home tomorrow so let’s meet up hyung!</p>\n<p> </p>\n<p>Jimin sends him an emoticon of a cat blowing kisses. Yoongi rolls flat onto his stomach and sinks his face into his pillow. He’d deny if you asked but there is a huge grin stretching across his face.</p>\n<p> </p>\n<p>Jimin shows up in a green-striped shirt two sizes too big and a pair of overall, as if he ever needed to look any more adorable than he already does. Yoongi dons a red hoodie and a pair of faded jeans. The most summer-like pieces of clothing he managed to dig out of his closet.</p>\n<p>Neither of them has actually planned what to do, so they end up going to random places, an old arcade, a nameless CD shop, a bookstore, a café that smells like cinnamon buns, a quiet park. They feed themselves street food whenever their stomachs grumble and stop in shops when their legs get tired. Jimin coerces Yoongi into taking countless selfies together, despite the latter reiterating that there is really no need to keep a record of their climbing up an escalator. The kid even snaps some candid shots of Yoongi, claiming that it’s so rare that Yoongi looks this ‘cute’. Yoongi threatens Jimin to never let another soul see those photos if he wishes to keep his life.</p>\n<p>As Yoongi looks at Jimin squatting down on the pavement to pet the third stray cat that they meet, he tries to hush down the nagging voice at the back of his head that keeps insisting they are on a “date”, playing out a strange melody to the thumping in his chest, and urging Yoongi to take a leap and reach out for Jimin’s hand. The kitten purrs as he rubs his head against Jimin’s palm and Jimin giggles. The sweet sound bursts into millions speckles of brilliant sunlight and summer breezes and young hearts eager to fall in love and Yoongi begins to think maybe he’s a little infatuated, in a way he doesn’t even completely believe himself.</p>\n<p> </p>\n<p>As night dawns they somehow make their way to the Han River. The twinkling lights of buildings and department stores swim idly in the dark silky liquid that flows in its own quiet rhythm. Yoongi has never noticed before but it’s calm and beautiful. Then again, things tend to appear a little more endearing when Jimin’s around.</p>\n<p>Jimin is sitting on the bench, swinging his feet and humming his favourite tune, when Yoongi comes back with two cones of vanilla soft serve. Jimin takes a tentative lick, and another one, and then a greedy bite that makes him flinch from the coldness. His nose brushes against the dessert and a little white dot sticks on the tip of his nose. Yoongi quickly takes out his phone and snaps a photo. It turns out blurry because he is laughing so hard his hand is shaking and his cheeks hurt. Jimin grumbles at his mocking hyung. But the gleeful grin is back to his face as he finishes his sweet treat.</p>\n<p>“Hyung, can I tell you a secret?”</p>\n<p>“Hmm?” Yoongi stuffs the last bit of the cone into his mouth, and winces a little as the dessert freezes on his tongue.</p>\n<p>“I’ve never had ice cream before.” Jimin giggles.</p>\n<p>“Are you serious?”</p>\n<p>“Yeah. I couldn’t really afford it when I was still in Busan.”</p>\n<p>And Yoongi says, in one quick breath, before he can think it over and stop himself “I’d buy all the ice cream in the world for you.”</p>\n<p>Yoongi’s heart stops when his mind finally catches up with the words come running out of his lips, when he fully understands the gravity that pulls and stretches each word, each syllable. Yoongi swallows. Everything pauses. The air stills around the both of them.</p>\n<p>Jimin blinks. He is looking at Yoongi, but not quite in the same way. He looks as if he is knocking on a door, asking to come in, to turn every corner of Yoongi’s secret inside out because he just has a peek through the window. He looks as if he’s curious but at the same time hesitant to know. He looks like a million and one reasons for the fluttery feelings in Yoongi’s chest. There is a tinge of pink on Jimin’s face and Yoongi just can’t tear his eyes away. He wants to make himself believe that he has just said the stupidest thing, and that the best thing to do is to throw himself into the river. But Yoongi looks at Jimin, at round eyes that are still on Yoongi, at small, nervous fingers curling up in Jimin’s lap, at the blush that is spreading to Jimin’s ears and down Jimin’s neck and he thinks about the words Jin said to him, about something that he did not know, that he should have known.</p>\n<p> </p>\n<p>Yoongi feels something bubbling in the bottom of his stomach and crawling up his spine.</p>\n<p> </p>\n<p>“Jimin” Yoongi breathes. A whirlwind in his chest. And Jimin doesn’t answer. He just blinks back quietly. “I…”</p>\n<p>Yoongi can’t say it. The remnants of the soft serve feel sticky on his fingers and he can’t say it. The wind is blowing Jimin’s fluffy hair and he can’t say it. The night is ticking away and yet he still can't. The words stuck in his throat.</p>\n<p>Jimin sees the hesitation in Yoongi’s eyes and he looks away, down to his hand. He looks – upset. Please, don’t– Yoongi thinks before he takes a deep breath.</p>\n<p>“Park Jimin, I like you.” He says it, and Jimin turns back to look at him now, eyes widened. And he wants to continue and says that he knows Jimin is interested in someone else and it’s fine and he just wishes that his unrequited feelings do not change anything between them, but his vocal cord is in knot again, because Jimin is looking at him with an expression that makes his stomach turn and flip. Jimin’s little eyes twinkle, his soft cheeks are so pink, his plump lips parted and god, does Yoongi want to just lean in and kiss Jimin.</p>\n<p>So Yoongi risks it and lets the pull get him a little closer. Jimin still looks at him, but he is holding his breath. Does Jimin want Yoongi to kiss him? He hopes that Jimin does. He really hopes so. Because the kid is wearing that waiting look and it just makes not kissing him a hundred times harder. Yoongi's hand comes up to palm at Jimin’s cheek. Jimin’s skin feels so smooth and tender. And warm. Perhaps from the blush that is now consuming his face.</p>\n<p>And then Yoongi stops thinking, stops telling himself that he has just confessed, stops wondering if Jimin’s still sitting here next to him on the bench means that he’s okay, that they’re okay. His brain just shuts down all together when he closes the gap between them, pressing their lips together, light and fleeting.</p>\n<p>Jimin tastes like the ice cream they just had and a whole lot sweeter. Yoongi thinks he likes it. A lot. Because he has never felt this content, elated, ecstatic , and yet afraid, before.</p>\n<p>Yoongi pulls the two of them together one more time. Just the same touch of lips but now Jimin is leaning into his hand and his lips are no longer trembling. And Yoongi feels Jimin's hands slowly travel across his lap to pull gently at the hem of Yoongi's hoodie. Yoongi wonders how he manages to not combust right then and there on the bench.</p>\n<p> </p>\n<p>That night Yoongi walks Jimin home and they don't really talk. Jimin is still unable to meet Yoongi's eyes and Yoongi can't bring himself to say anymore stupid things like \"so I guess you like me too\" or \"hey so are we like boyfriends now\". They just walk alongside each other and Yoongi prays the sound of leaves rustling is loud enough to cover the loud beating underneath his ribcage. His heart has gone frantic because of Jimin before, but this is different, this is new, and Yoongi doesn't quite know how to deal with it.</p>\n<p>\"Uhm... thank you for walking me home, hyung.\" Jimin scratches his head, while intensely examining his shoes and Yoongi can't help but think about how familiar it feels.</p>\n<p>\"Enjoy your trip.\" Yoongi smiles, tugging his hands into his pocket and trying to not look too awkward.</p>\n<p>\"See you later, hyung\" Jimin smiles , before rushing into the building and flies up the stairs.</p>\n<p>Yoongi stands, aimlessly and disoriented, outside Jimin's place for a few minutes. He wishes he had said something else, something more, because it has just dawned on him that they won't be seeing each other for more than one month.</p>\n<p>Yoongi sighs. A cat somewhere lets out an empathetic \"meow\".</p>\n<p> </p>\n<p> </p>\n<p>They end up talking almost every night throughout their summer break. Yoongi is happy, and he doesn't really want to rush into defining whatever situation they are in, as long as he gets to hear Jimin whining and giggling and chirping away about whatever he did in the day. Jimin asks him if he has made any new songs, and Yoongi says he has been busy working part time with Namjoon so he doesn't have much time to write lately. Jimin \"uhms\" knowingly before demanding to be the first to hear the elder boy's new song, to which Yoongi just chuckles and asks Jimin to continue dreaming.</p>\n<p>Because Jimin will be the last to know that a certain smile has been taken Yoongi’s lyrics by storm lately.</p>\n<p>One week before coming back to Seoul, Jimin sends Yoongi a text saying “I miss you hyung”, followed by a blushing cat, which reaches the intended recipient when Yoongi is already fast asleep. But the next morning, Yoongi checks his phone while he’s brushing his teeth and ends up dripping foam over his pijama from grinning too hard. His incessant smiling condition persists throughout the day, even when he meets up with Jin, Namjoon and Hoseok for lunch, causing the other three to eye him suspiciously.</p>\n<p>Of course Jin confronts Yoongi when the latter places the dirty plates into the kitchen sink.</p>\n<p>“So, I guess, things work out for you guys?”</p>\n<p>“You could have just said that you think he likes me too.”</p>\n<p>Jin laughs “What’s the fun in that?” as he puts on his pink apron.</p>\n<p>Yoongi decides that he is not going to tell Jin that they kissed weeks ago.</p>\n<p> </p>\n<p> </p>\n<p>*** </p>\n<p> </p>\n<p> </p>\n<p>Almost no one looks forward to school resuming, Hoseok grumbles that he has barely repaid his sleep debt, Taehyung complains that he still has one more anime series to go, while Namjoon did not even have a chance to spend the money he saved up from his part time job. Jungkook has grown even taller over the summer, much to Yoongi’s dismay.</p>\n<p>And Jimin. Jimin is just the same, all smiley and round cheeks and fluffy hair, although his skin caught a little honey tan. He greets everyone with bone-crushing hugs and crescent-eyed grins. </p>\n<p>Jimin is the same but when he looks at Yoongi there is a different shine in his eyes that doesn’t go unnoticed. And his smile. His giggles. Yoongi starts to pick out the little things that are reserved for him. Yoongi would be lying if he said the new discovery doesn’t send his heart to the heavens.</p>\n<p>“I’m so glad today is over” Hoseok yawns as he dumps his new stack of notes into his locker “I can’t believe it’s just the first day.”</p>\n<p>“Yeah, Economics felt like fore-“ Yoongi pauses mid-sentence because he notices an item lying at the bottom of his locker. He picks up the pink envelope.</p>\n<p>“Wow” Hoseok appears next to him again “Hot shot! Another secret admirer?”</p>\n<p>Yoongi tears open the letter and it takes him one second to recognize the handwriting.</p>\n<p> </p>\n<p>Here he is again, walking towards the old basketball court with hands tugged in his pocket. The puffy hair turns around when he says “hey”.</p>\n<p>“I hope you got it right this time” Yoongi smiles.</p>\n<p> </p>\n<p>And Jimin giggles.</p>"
}