{
  "id": "29040453",
  "url": "https://archiveofourown.org/works/29040453?view_full_work=true",
  "author": [
    "BelleAmant"
  ],
  "title": "Assignment: Personality Swap (Now Without Grapes!)",
  "rating": "Not Rated",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [],
  "fandoms": [
    "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
  ],
  "relationships": [
    "Aizawa Shouta | Eraserhead & Midoriya Izuku",
    "Aizawa Shouta | Eraserhead & Class 1-A",
    "Class 1-A & Midoriya Izuku",
    "hints of",
    "Midoriya Izuku/Todoroki Shouto"
  ],
  "characters": [
    "Aizawa Shouta | Eraserhead",
    "Midoriya Izuku",
    "Shinsou Hitoshi",
    "Todoroki Shouto",
    "Class 1-A (My Hero Academia)",
    "Yamada Hizashi | Present Mic",
    "Yagi Toshinori | All Might"
  ],
  "additional_tags": [
    "Personality Swap AU",
    "Actor Midoriya Izuku",
    "Fluff and Crack",
    "Happy six months!!",
    "Mineta Minoru is Expelled from U.A. High School",
    "Shinsou Hitoshi is in Class 1-A"
  ],
  "language": "English",
  "series": "Part 14 of Personality Swap AU",
  "published": "2021-01-28",
  "completed": null,
  "words": "6,447",
  "chapters": "1/1",
  "comments": "300",
  "kudos": "12,887",
  "bookmarks": "542",
  "hits": "119,507",
  "summary": "<p>Since Hitoshi Shinsou was not in 1-A for the classwide personality swap assignment, Aizawa decides to give his students another chance.</p>\n<p>As expected, chaos ensues.</p>",
  "notes": "<p>Happy six months, everyone! I'm so glad that you all have stuck around for so long, and I've enjoyed writing these fics for you! Enjoy- this one is the new longest in the series, I believe, just for you!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>I hope you liked it! Let me know what you thought in the comments below, and leave any suggestions for the future as well! Until next time! &lt;3</p>\n<p> </p>\n<p>(Also: thank you for your support, I've been screaming since I woke up because I apparently have 1000 user subscribers??? Whoever you are, *merci beaucoup*, I'm probably going to cry happy tears in class!)</p>\n<p> </p>\n<p>Oh, and for the record, here is who everyone was:<br>Aoyama is Yaoyorozu<br>Ashido is Ojirou<br>Asui is Todoroki<br>Iida is Ashido<br>Uraraka is Midoriya<br>Ojirou is Jirou<br>Kaminari is Iida<br>Kirishima is Tokoyami<br>Kouda is Satou<br>Satou is Sero<br>Shouji is Asui<br>Jirou is Kirishima<br>Sero is Shouji<br>Tokoyami is Uraraka<br>Todoroki is Kaminari<br>Hagakure is Kouda<br>Bakugou is Aoyama<br>Midoriya is Shinsou<br>Shinsou is Bakugou<br>Yaoyorozu is Hagakure</p>",
  "text": "<p>“Before you go,” Aizawa says, and his students all look to him with confusion. “I am going to assign each of you a classmate of yours. Tomorrow, you will all do a classwide swap, just like you did a few weeks ago.”</p>\n<p>“Why?” Hagakure asks, and Aizawa sighs. </p>\n<p>“For two reasons. First of all, Shinsou has yet to do it, and I want to know where his baseline is for acting. This will also serve as a chance to see how much the rest of you have improved, and if you will be able to fix your mistakes from last time. Any questions?”</p>\n<p>“Are you sure we should be doing this tomorrow?” Iida asks. “Last time, we had an entire weekend to prepare!”</p>\n<p>“Midoriya has consistently done well with less preparation time,” Aizawa states in response. “He usually does not receive his next assignment until class has been over for hours. You are getting your assignment right now.”</p>\n<p>No one can really fight that statement, and so they keep silent as they shuffle forwards, each taking their respective paper from their teacher before shuffling out. Midoriya walks up last, looks Aizawa in the eyes, and smiles.</p>\n<p>And Aizawa grins back.</p>\n<p>Waiting by the exit, Todoroki looks to Shinsou and whispers, “And Midoriya tries to deny the connection.”</p>\n<p>Shinsou snorts, disrupting the moment, and Midoriya takes his paper before rushing off, a farewell falling off of his lips as he tugs the two boys after him. </p>\n<p>The day has gone well, and the fun has only just begun.</p>\n<p>Well...fun for some. For those like Midoriya, who is notably calm and carefree as he enters the dorms, confident in his ability to perform tomorrow morning. Others, like Uraraka and Shinsou, clearly have ideas in mind, showing in their wild grins. Then there are those who simply appear content, either because they have hoped for a second chance to redeem themselves, or merely because they are not <em> opposed </em> to a new round of swapping, which includes those like Kouda and Ojirou.</p>\n<p>But for the rest?</p>\n<p>Well, the stress is apparent, the dorms alive with frantic action as the students of 1-A move through the common room, coming in and out with no apparent direction in mind.</p>\n<p>It’s not until Satou nearly knocks Midoriya straight over that the green-haired boy looks around and asks, “What’s the matter? Are you guys okay?”</p>\n<p>“Mon ami, do we <em> look </em> okay?” Aoyama asks, sparkling angrily as he gestures to the rest of their peers. </p>\n<p>“I…” Midoriya blinks slowly. “Is this a trick question?”</p>\n<p>Aoyama huffs dramatically, then shakes his head. “To answer your question, mon copain, we are stressed about tomorrow.”</p>\n<p>“Tomorrow?” Midoriya asks, and Iida clears his throat.</p>\n<p>“The personality swap assignment.”</p>\n<p>“Oh.” Nodding, Midoriya says, “That makes sense. It can be stressful when you’re first planning, yeah?”</p>\n<p>“Especially when we have to outdo you,” Kaminari mutters, and Midoriya furrows his eyebrows.</p>\n<p>“Aizawa never said that you have to outdo me,” Midoriya notes, and Shinsou snorts.</p>\n<p>“He didn’t, but that doesn’t mean they aren’t going to try.” Nudging the boy, Shinsou adds, “You’ve been impressing and terrorizing everyone for a few weeks now, of <em> course </em> we’re going to try to match and surpass that level.”</p>\n<p>“That’s the Plus Ultra way!” Ashido chimes in. “And I don’t know about everyone else, but I’m going to make sure my uniform matches!”</p>\n<p>“So you’re a guy,” Midoriya notes automatically, and Ashido pauses.</p>\n<p>“What?”</p>\n<p>“If your uniform has to change, doesn’t that mean you’re a guy?” Tilting his head, Midoriya murmurs, “Or you’re Jirou, as she’s the only one who chose a vest instead of the usual blazer. But you paused like you were surprised, and not perplexed, so you’re most likely a guy. And since I know Aizawa likely assigned-”</p>\n<p>“Midoriya,” Todoroki says, and Midoriya glances up. “You’re going to reveal who everyone is before we even start.”</p>\n<p>“Oh! Sorry, guys! I’m just going to go, ah, figure out my plan for tomorrow!” Just like that, Midoriya races off, leaving the rest of 1-A to watch with shocked expressions.</p>\n<p>“Did...did he really figure out who we all are already?” Hagakure asks, and is met with a series of nods.</p>\n<p>“He knows too much,” Shinsou mutters. “We’re not going to outdo him.”</p>\n<p>“No, we aren’t,” Kaminari says sadly, and then, “but we sure can try!”</p>\n<p>And just like that, chaos resumes.</p>\n<p>Day turns into night, and night turns to day, and so Tuesday shall begin.</p>\n<p>-----</p>\n<p>And so Tuesday begins, a little wonky, a little weird, a little unusual in a way that 1-A considers routine, if only to a higher level. And Tuesday begins not with 1-A awaiting Midoriya’s arrival, not like how the past days have started time and time again, but with each student’s arrival being worth noting.</p>\n<p>And the first to arrive is Denki Kaminari, twenty-eight minutes before the bell. Externally, the boy is calm and collected, heading to his desk with his head held high and his arms straight. The picture of a perfect student, Kaminari slides into his seat without so much as a sigh, careful to be quiet as he spots Aizawa’s sleeping form. </p>\n<p>Internally, however, Kaminari is already stressing out, knowing that he was just a <em> bit </em> too late to be up to Iida’s standards. The bar feels much higher than it was, just a couple of weeks before. After losing points for breaking character as Shouji, Kaminari just wants to do well on this assignment so that he doesn’t have to see another ‘C’ in his future. But Kaminari had wanted to accessorize a little, and <em> knew </em> he had some fake glasses laying around his room from a spontaneous purchase that he made a few months ago, and so he had to tear apart his room to find the things.</p>\n<p>And he did, making him look quite good, in his own opinion, but it means he didn’t arrive at the perfect ‘thirty minutes before the bell’ mark that Iida seems to strive for. So Kaminari sits at his desk, a little stressed, a little worried, but sure that he’ll be able to make it through the day without <em> too </em> much of an issue.</p>\n<p>He’s practically a professional, anyways! After all, the boy <em> is </em> dressed up for the occasion, with fake prescription glasses resting on his face, and Kaminari has a feeling that he’ll stand out.</p>\n<p>He is proven wrong immediately, because four minutes later, Yuuga Aoyama walks in.</p>\n<p>And he’s wearing a skirt. </p>\n<p>Aoyama smiles when he sees Kaminari, normal walk gaining a bit of a strut as he moves further into the room, allowing the skirt to sway around him and pulling attention to the kneehigh socks that the blond has donned. “Good morning,” Aoyama greets, his smile a little too coy for the gentle tone that he uses. Clearly eager for the day, Aoyama makes no delay as he perches himself on his seat, clasping his hands on the desk and waiting patiently for the next arrival.</p>\n<p>And he does not have to wait long, for Tooru Hagakure walks in four minutes after Aoyama, her invisible form more defined thanks to the pants that she has put on, replacing her usual skirt. If one could see her face, they’d know that Hagakure opened her mouth, ready to greet her friends, before shutting it softly and waving instead. But no one <em> can </em> see her face, and so the wave does not appear to be anything but that, a wave, and not a near mistake. </p>\n<p>Relieved, Hagakure takes her seat, just as Eijirou Kirishima enters the room. The redhead’s uniform is the same, but his hair is oddly shaped. His usual spikes are missing, instead replaced by ones that stick out at the back of his head, the top simply slicked back, as if he’s trying to imitate a bird’s look.</p>\n<p>Kirishima offers a single, solemn nod to his peers, and then takes his seat. The other three look at him, perhaps trying to decide if he is who they assume, only to look at two minutes later.</p>\n<p>Because Katsuki Bakugou has arrived.</p>\n<p>Unlike the others, Bakugou hasn’t touched his hair. Perhaps because he tuned everyone out the night before, when they sat in the common room and tried coming up with ways to live up to the expectations that came with a second round of assignments- especially after multiple weeks of Midoriya stepping up to the bar and leaping over it without failure-, or perhaps because he simply did not care. Either way, the only notable change for the spiky-haired blond is the properly done tie around his neck, and the way that he seems to...shimmer?</p>\n<p>No, the four who are already in class are correct, because Bakugou seems to have glitter on him. Not much, just the faintest sprinkling here and there, enough to catch the light and keep attention on him.</p>\n<p>From his spot, Aoyama gasps, eyes lighting up as he stares at Bakugou. “Mon-” Clearing his throat, Aoyama looks down, then back up. Expression softer, he says, “You are quite sparkly today. Where did you get the glitter from?”</p>\n<p>“It’s just my natural charm,” Bakugou grits out, teeth clenched and making his smile look far too hostile.</p>\n<p>Aoyama looks as if he wants to argue, or perhaps to ask again, but then the time hits sixteen minutes before class, and Kouji Kouda walks into the room. Smiling kindly, the boy takes a seat at his desk, pulling out his notebook and pencils before grabbing one last book and flipping it open. It appears to be one about the history of bread.</p>\n<p>The other five decide to leave Kouda to his book, instead looking for ways to occupy themselves, or simply watching the other students as they arrive.</p>\n<p>A minute ticks by, and Rikidou Satou walks in, a wide, beaming grin on his face as he enters, easygoing as he takes his seat. Sero walks in right after him, his character immediately given away by the face mask that he’s donned. </p>\n<p>One more minute, and three students enter, all at once. First to be noted is Mezo Shouji, who gives little more than a nod in greeting before sitting at his desk, looking calm and complacent as he goes. Kyouka Jirou is next, and she greets the class with a wide smile and a loud, “Morning, everyone! Who’s ready for the day?” that everyone does their best to respond to in character. The last of the minute is Mina Ashido, who keeps a calm, small smile on her face as she offers a pleasant, “Hello.”</p>\n<p>Two minutes pass, and Momo Yaoyorozu is the next to arrive. She walks in with a pep in her step and a quick, “Hi, everybody!” that seems livelier than usual. Her wave is wide and sweeping, a far difference from her normal, polite wave. She makes her way to her desk, movements far more exaggerated than expected as she takes her spot.</p>\n<p>Another two minutes pass, and then Hitoshi Shinsou is the one to enter the room. He’s scowling, which isn’t <em> quite </em> unusual, given the boy’s natural resting face, but it’s deeper and filled with more intent than usual. His tie is missing, forgone completely, and the boy clenches his fists when the others look at him for more than five seconds.</p>\n<p>“The fuck do you want?” Shinsou snaps, and half of the class hastily looks away, as if on instinct or conditioned, when he flexes his hands. </p>\n<p>“That’s what I thought,” Shinsou mutters, and then he storms over to his desk, kicking his feet onto the top with an air of superiority. Fearful of his glare, the students of 1-A are happy enough when Mashirao Ojirou arrives not two minutes later, offering a nonchalant wave before taking his own spot.</p>\n<p>Tenya Iida arrives next, when there are only seven minutes before class, looking unhappy with this truth despite the smile plastered on his face. He walks as if he’s trying to be looser, but his gait is too stiff, giving him a loping strut that has heads turning away, in fear of laughing and breaking character.</p>\n<p>It is much easier, therefore, to look to Fumikage Tokoyami a minute later, when the bird-headed boy walks in with pink dusted on his cheeks, noticeable upon the black feathers. Tokoyami quirks up his beak, smiling as brightly as he can, before letting his expression drop back into its usual one as he takes his spot.</p>\n<p>Ochako Uraraka is the next to arrive, with five minutes before the bell. Her outfit is changed, much like many of her peers, with pants replacing her usual skirt and her tie an utter disaster- if it can even be considered a tie, anymore, with how strangled it appears to be. A sunshine-filled smile is on her face, although it’s not fully clear if that’s her own or for her acting.</p>\n<p>Tsuyu Asui follows in right after, also wearing pants, and her face is blank until she looks at Uraraka. Then, and only then, does she gain the slightest change in expression, lips quirking up into a gentle grin as she follows the brunette without hesitation.</p>\n<p>The nineteenth student to enter the room is Shouto Todoroki, who comes into the room three minutes before the bell. His appearance isn’t altered in any way, and all he offers is a simple, “Yo,” before turning and making his way to his desk. Confused, and perhaps a little disappointed by the lackluster introduction, everyone keeps their eyes on the door, knowing exactly who the final student is that has yet to arrive.</p>\n<p>Finally, just before the bell rings, it is Izuku Midoriya who enters the room. His tie is well done, but it’s the only thing that seems to be cleaned up compared to his usual, everyday appearance. His hair is even messier than usual, somehow, seeming to stand up on its own, and bags are under his eyes, a testament to a seemingly long night.</p>\n<p>‘<em> I thought Midoriya was prepared for today? </em>’ Most of 1-A thinks, except for the few who understand. </p>\n<p>But most do not understand, and so they wait to see who Midoriya will kick out of their spot. Because <em> surely </em> Midoriya will, considering that he did so the last time, right?</p>\n<p>He does not, instead sighing as he drops into his own desk, slumping in on himself before straightening up, tired eyes blinking at the chalkboard.</p>\n<p>And so the day begins, the stage set, the characters out, and the curtains drawn as Aizawa stands up.</p>\n<p>‘<em> Break a leg, </em> ’ Midoriya thinks wryly. ‘ <em> Let’s just hope it’s not my own. </em>’</p>\n<p>-----</p>\n<p>And so the day goes on, full of fulfilled and failed expectations, humor and fear intertwined as the class of 1-A acts as one another. The entrances, once again, left a clear impression on one another, but the day becomes much, much more, and by the end, everyone from 1-A has a favorite part to remember.</p>\n<p>For Sero, it would have to be Yamada-sensei’s reaction.</p>\n<p>Because he had expected something else entirely.</p>\n<p>-----</p>\n<p>It should be known that Hizashi Yamada is not foolish, nor is he oblivious. When he saw the students of 1-A walking out of the school with slips of papers in their hands the day before, he immediately knew what would occur. There had only been one other time that they had exited the building in such a fashion, after all...and that was the Friday before the personality swap that started Midoriya and Aizawa’s reign of chaos. </p>\n<p>So he’s not surprised, come Tuesday, to see his students dressed differently, and acting as one another instead of as themselves. </p>\n<p>What is surprising, however? </p>\n<p>Midoriya.</p>\n<p>Because Midoriya has surpassed everyone’s expectations every single day, with each and every performance that he offered. Yamada will never forget the first day, when he ended up swearing Aizawa out over the assignment, scared about the swaps, and why the sunshine child was cursing him out. Midoriya has consistently risen above and beyond, surprising and bewildering his teachers and peers.</p>\n<p>Today, though...today, Midoriya just looks tired.</p>\n<p>Yamada does not understand it, the way that Midoriya sinks into his chair, eyes drooping as much as he tries to keep them open. And he can see, too, the way that the boy’s peers watch him with a familiar sense of concern. Side glances are sent Midoriya’s ways, gazes that linger for too long, betraying their worries. Very few seem to refrain from sending him these looks, and surprisingly, it’s Todoroki and Shinsou who seem the calmest about Midoriya’s unusual demeanor.</p>\n<p>When Yamada ends the day’s lecture, and Midoriya’s only reaction is to set his pencil down and stare blankly at the board, the Voice Hero decides to try getting to the bottom of it. And so the blond excuses himself from the classroom, shutting the door softly behind him.</p>\n<p>Out in the hall, Yamada keeps his voice carefully calm as he dials a familiar number, lifting his phone to his ear and waiting for the device to stop ringing.</p>\n<p>And it does, Shouta Aizawa picking up without much hesitation, asking, “What is it?”</p>\n<p>“Is the sprout okay?” Yamada asks, and he’s greeted with silence.</p>\n<p>“What do you mean?” Aizawa asks after a moment, and Yamada can’t help but pace as he talks, his free hand fiddling with the headphones resting around his neck for the moment.</p>\n<p>“He’s really...quiet, today. Tired. He’s got eyebags, which he hasn’t had since he impersonated <em> you </em>. He’s only, like, half responsive, and looks like he’s going to pass out at any moment. Do you know if he had a nightmare, or something?”</p>\n<p>“Why would I know that?” Aizawa asks, and Yamada scoffs.</p>\n<p>“Because you’re basically his dad? Shouta, I’m all for the little listener acting like a mini you and picking up your habits, even if it’s <em> terrifying </em> sometimes, but he doesn’t deserve to be so fatigued! Heck, the only one I’ve seen look so tired before is- oh.”</p>\n<p>“Yep,” Aizawa mutters, amusement leaking through the phone, and Yamada pouts.</p>\n<p>“He’s acting,” Yamada realizes. “Damn, he’s good.”</p>\n<p>“Yep.” </p>\n<p>The phone hangs up, and Yamada wonders if he should laugh or cry.</p>\n<p>Maybe both? Yeah, both sounds good.</p>\n<p>-----</p>\n<p>Lunch is chaotic, as it tends to be. The students of 1-A are ‘plus ultra’ in many ways, after all, and the student body of Yuuei has learned to give them their space, much like they have learned to give students like Mei Hatsume solitude when she has a manic grin on her face.</p>\n<p>But when the personality swap assignments started, the chaos of lunch had calmed the slightest bit. With Midoriya, one of the ‘twin stars’ of 1-A, consistently absent from his group widely known as the Dekusquad, the cafeteria was a smidge quieter, a touch more serene. Still chaotic, of course, because Yuuei doesn’t simply revolve around 1-A, as much as they like to keep tabs on the class, but a bit less...over the top, so to speak.</p>\n<p>But today is different, because Midoriya isn’t impersonating a teacher. No, he is impersonating one of his peers, which means that he is in the cafeteria.</p>\n<p>Add in the fact that the <em> rest </em> of 1-A is acting?</p>\n<p>Well, it makes sense that lunch is anything but normal. </p>\n<p>It’s odd, too, because it’s clear that even 1-A does not know how to go about their day. Students migrate to their normal tables, only to pause as they realize that their friend groups aren’t the same as the people they are for the day. Sure, the students of 1-A all get along with each other, but some bonds are better than others. And so the rest of Yuuei gets to watch with amusement as the infamous first years slowly find their tables.</p>\n<p>Except for the few who seem to be confident, who set their stuff down without any doubt, as if there was no reason <em> to </em> double check their placements. Students like Kouda, who was assigned someone in his normal friend group, and as such only shifted one spot to the left. Students like Uraraka and Shinsou, who send each other a look before heading to different tables.</p>\n<p>Students like Midoriya, who moves easily, dropping his tray at his usual table before dropping himself into a seat, offering a single nod to Uraraka, who smiles brightly back.</p>\n<p>But those are the few, and the rest move with even the slightest hints of hesitation. Aoyama and Yaoyorozu stare at each other for a few moments before slowly moving to Yaoyorozu’s normal table, Bakugou scowls before storming over to Kouda’s table, dragging Kirishima behind him. Sero follows them, smile faltering ever so slightly as he glances around, as if unsure that he’s <em> actually </em> following the right people. Whether it’s because he’s not certain who they are impersonating, or whether they are the usual people that his assignment sits with remains unclear, but his wariness is far from hidden. </p>\n<p>Ashido stands in the middle of the cafeteria for a minute straight before gasping, smiling with delight as she realizes that she, too, can sit at Kouda’s table. For a moment, the girl breaks character, all but running to catch up with her friends- only remembering herself halfway through, where she forces herself to walk with a calmness that she doesn’t quite feel. </p>\n<p>Most are able to stay in character, though, as they finally move to their proper places. Ojirou is calm as he sits across from Aoyama, and so is Hagakure when she joins the table that Kouda and the majority of the Bakusquad inhabit. Asui takes a spot next to Uraraka with a small smile, and Iida sits at Shinsou’s table with the most carefree grin that he can offer. Shouji heads to Midoriya’s table as Satou heads to Shinsou’s, and Jirou only pauses for a moment before following Satou. </p>\n<p>Tokoyami and Kaminari take the final spots at Midoriya’s table, and that is what stops Todoroki in his tracks, the boy having automatically walked in the direction of his usual table. A conflicted expression covers the boy’s face, as minor as the look is, and then the boy sighs and heads to Shinsou’s table instead.</p>\n<p>In the end, it takes 1-A roughly five minutes for all of their members to sit down, and it’s a surprisingly amusing five minutes. More amusing is how some groups struggle to interact, while others seem to meld together pretty well. </p>\n<p>But not much else happens, and so lunch goes on, only a little more chaotic than usual. </p>\n<p>-----</p>\n<p>After the oddity that is lunch comes the time for heroics, and the students of 1-A are eager enough to get back into training. Midoriya, too, seems to be eager, the tired slowness of the morning easing away, leaving him more alert. The students of 1-A are grateful, even those who know the truth.</p>\n<p>It is always odd, after all, to see such an energetic student so <em> drained </em>.</p>\n<p>Toshinori Yagi enters the room, smiling brightly as he does so. </p>\n<p>\"Good afternoon, 1-A!\" Yagi greets, voice gentle yet booming as he asks, \"Who's ready for another day of training?\"</p>\n<p>A few whoops and cheers fill the air, along with a sigh of, \"<em> Finally </em>,\" from Midoriya, earning the boy a few glances. But Midoriya pays them no mind, eyes only trained on the retired hero, and so the looks go away, moving to focus on the blond man.</p>\n<p>\"Today, we will be doing a game of capture the flag! More information will be given upon reaching the training grounds, so let's go!\"</p>\n<p>The reaction is immediate, twenty students getting up and grabbing their cases- their own cases, for that fact, because everyone is quick to grab their own before Midoriya even reaches the shelves. </p>\n<p>Not that Midoriya seems to mind, simply grabbing his normal case before trailing behind the group, gait lanky and easygoing as he follows their lead.</p>\n<p>“So,” Todoroki says, expression blank as he speaks. “Capture the flag?”</p>\n<p>“It will most definitely be interesting!” Iida states with an arm chop, and then, more informally, “And it sounds fun!”</p>\n<p>“It’s just a shame that we’re stuck wearing these costumes,” Kaminari murmurs, pulling on his usual gear. “Armor is more my style, don’t you think?”</p>\n<p>“As if,” Bakugou scoffs with a glare. “If anything, <em> I </em> am the one who would look best in armor.”</p>\n<p>Aoyama glares at the two blonds, but, wisely, chooses to keep his mouth shut. </p>\n<p>“Well, at least I have my costume,” Midoriya drawls. “Unlike you all.” </p>\n<p>“No you don’t,” Satou points out, and the other boys turn to agree, only to blink in surprise as Midoriya opens his case.</p>\n<p>Because there’s a basic, dark jumpsuit sitting within the case, just like Shinsou’s.</p>\n<p>“How?” Shinsou chokes out, and then flips open his own suitcase, only to be filled with another round of confusion. </p>\n<p>His hero costume is <em> still in the case </em>.</p>\n<p>But...how? That’s all the boys of 1-A want to know- after all, Shinsou’s costume was made by the support students, a project for them thanks to the boy’s late arrival into the Heroics Course.</p>\n<p>Shaking their heads, the boys of 1-A decide that this is a question better left unasked, not wanting to know just how far Midoriya’s ability to act and commitment to his bits is. </p>\n<p>\"I'm not giving you my capture weapon,\" Shinsou mutters as he grabs his costume out of its case, and Midoriya grins sharply.</p>\n<p>\"Why would I need an item of yours?\" Midoriya asks, pulling off his uniform shirt and revealing a torso covered in white bandages. One hand grabbing the material, his wrist flicks, and the fabric unwraps, the capture weapon activating and unwinding from his midsection, pooling into his hands. \"I have my own, after all.\"</p>\n<p>The locker room falls silent, but Midoriya pays it no mind, getting dressed and winding the weapon around his neck before slipping out of the room.</p>\n<p>Only then does someone speak, and it's Todoroki who breaks the silence.</p>\n<p>\"I think I just short-circuited,\" Todoroki murmurs, and then he, too, disappears.</p>\n<p>The rest of the boys follow shortly after, and the girls arrive quickly, and so Yagi begins to give out instructions.</p>\n<p>“For this, we will be following the basic rules of capture the flag. Each team has a flag, which they must plant in their ‘safe zone’. Your goal is to defend your flag and gather as many others as you can. The game will go on until time runs out, or a team manages to steal all four flags. If you get tapped by someone outside of your safe zone while in their domain, you will be ‘jailed’ by them until a partner of yours can free you.”</p>\n<p>“What if we run into <em> them </em>, but they don’t touch us?” Midoriya asks, and Yagi hums.</p>\n<p>“That is allowed! And Quirk use, of course, is also allowed- so long as you do not hurt your peers. Excessive force will get you benched, and a dangerous injury will award the opponent your flag- and cost your grade. Got it?”</p>\n<p>A round of nods prove that the class understands.</p>\n<p>“There will be four teams of five,” Yagi announces. “You may make these teams as you wish, but do not fight over it. You have five minutes, go.”</p>\n<p>As expected, there is immediate chaos. Because for some, there is the struggle of trying to figure out whether or not the teams should focus on the Quirks of the actors, or the people they are pretending to be. Quickly, however, they all remember that the latter is more important for their grade, and race to find their ‘usual’ teammates.</p>\n<p>And so, after a moment of panic, four teams are created. The first consists of Aoyama, Ojirou, Kaminari, Yaoyorozu, and Kirishima. The second group has Bakugou, Hagakure, Kouda, Sero, and Ashido. Then comes the third group, with Shinsou, Iida, Todoroki, Jirou, and Satou. And the fourth team is, of course, Midoriya, Tokoyami, Shouji, Asui, and Uraraka. </p>\n<p>This, of course, means that when the game begins, chaos immediately ensues.</p>\n<p>Because, as it turns out, it is significantly harder than expected to play a game of capture the flag while trying to act- and perhaps even <em> fight </em>- like a completely different person. Which leads to some...interesting events.</p>\n<p>Which occur all at once, causing pure madness.</p>\n<p>The class, in their defense, manage to last two minutes before everything becomes far too much. Students work together, all four groups do their best to act as a cohesive unit.</p>\n<p>But then Hagakure picks up a bug, looks at Aoyama, and shouts, “Eat bugs, bitch!” </p>\n<p>And throws the bug right on the blond’s face.</p>\n<p>“Chienne!” Aoyama shrieks, activating his naval laser in his panic and blasting himself back to his team, where he knocks right into Yaoyorozu. </p>\n<p>Truly, it is no wonder that things begin to go downhill. </p>\n<p>“You can’t call them that!” Jirou shouts as she races over to Aoyama’s group. “That’s so un<em> manly </em>!” </p>\n<p>As if emphasizing the word, Jirou throws herself forward, headbutting Ojirou in the stomach and causing him to fall down. She then pulls herself up, reaching out for their nearby flag.</p>\n<p>Only to hear a scream that makes her whip her head around, because the scream came from <em> her </em> team.</p>\n<p>“Our flag!” Iida shouts, racing after a Tokoyami who cackles madly, clutching the flag to his chest like it’s his greatest possession.</p>\n<p>“I’m going to do my best!” Tokoyami crows, and Dark Shadow whoops along with him before turning around and sucker punching Iida, knocking the boy over.</p>\n<p>“Fuck!” Jirou shouts. “Wasn’t Todo- er, fuck, <em> Kaminari </em> supposed to be on defense? Where is he?”</p>\n<p>Todoroki is, in fact, in jail, having wandered over to Midoriya’s side to talk with him. He doesn’t seem upset, smiling gently as he talks to Midoriya.</p>\n<p>“I saw this meme online,” Todoroki is saying. “It was about...roads, I believe?”</p>\n<p>“Road work ahead?” Midoriya responds, and Todoroki perks up.</p>\n<p>“I sure hope it does.”</p>\n<p>Locking eyes with Todoroki, Midoriya murmurs, “If any of my opponents arrive, do your best to stop them. Don’t let your teammates- or anyone else- touch you.”</p>\n<p>Todoroki nods, and Midoriya looks away, now grinning wildly as he searches for any approaching targets.</p>\n<p>Meanwhile, Jirou seems to finally understand what went wrong, and sighs as she gets up. “He’s so lovestruck,” Jirou mutters. “I guess it’s up to <em> me </em>.”</p>\n<p>“Ah, no,” Ojirou says calmly, tapping Jirou on the arm. “You’re captured.”</p>\n<p>“Fuck,” Jirou mutters. “I can’t believe you’ve done this, <em> bro </em>.”</p>\n<p>“What a mad banquet of darkness,” Kirishima agrees with the most stoic expression he can muster, and Jirou struggles to hold back her snort.</p>\n<p>On the other side of the field, Bakugou screams as Uraraka smacks him, taking away his gravity. Asui works quickly, throwing the boy up into the air with her tongue. The blond tries to shoot himself back down with his explosions- but with his weight decreased, he ends up using <em> far </em> too much firepower, sending himself crashing into the earth.</p>\n<p>“Sorry, <em> Aoyama </em>!” Uraraka cries as she darts past Kouda, who yelps and begins to pursue her. “But I kind of need this!”</p>\n<p>Asui and Uraraka, now equipped with Bakugou’s team’s flag, sprint away from the two defenders, now having to face the rapidly approaching Sero and Ashido.</p>\n<p>Only for Shouji to appear, lifting Ashido from the ground and throwing her across the field, before doing the same to Uraraka once she passes over Bakugou’s flag, chucking her in the direction of the only remaining team that holds a flag. </p>\n<p>Which is where Shinsou is, the boy racing towards the team. Whether this is to claim their flag, or simply to reclaim his teammate, is unclear, but the purple-haired boy is heading straight for them. </p>\n<p>So when Uraraka lands right in their path, snatching up their flag before sprinting over to an awaiting Dark Shadow, Shinsou is left baffled.</p>\n<p>And in a flash, it’s all over. Uraraka lands on the ground, tossing the final flag to Midoriya, who has three others placed gently on their pole. The greenet happily ties the fourth above the rest, dancing around patches of ice that Todoroki had created to defend Midoriya from the other teams, and Yagi calls for the match to end.</p>\n<p>But before Yagi can speak, there is a scream. One full of rage.</p>\n<p>\"Deku!\" Shinsou shouts, hands curling into fists as he storms over to Uraraka. \"You got in my fucking way! You <em> planned </em> that, didn't you?!\"</p>\n<p>\"Kacchan!\" Uraraka cries out. \"I didn't! I-\"</p>\n<p>\"Just shut up, you damned nerd!\" Shinsou interrupts, glaring at the brunette, before shifting his gaze to lock eyes with the fiery blond of 1-A. \"My goddamn <em> superiority complex </em> means you're wrong, no matter what, because there's no <em> way </em> I could ever make a mistake.\"</p>\n<p>\"What?!\" Bakugou shouts, breaking character to storm at Shinsou, polite expression disappearing in an instant. \"I don't sound like-\"</p>\n<p>He moves to lunge at the purple-haired boy, only for Midoriya to intervene pressing his hand against the blond's chest.</p>\n<p>\"Hey,\" Midoriya says, and Bakugou scowls.</p>\n<p>\"What the fuck do you want, De-\"</p>\n<p>\"Shut the <em> fuck </em> up,\" Midoriya cuts Bakugou off, gaze fierce as he stares the blond down. </p>\n<p>And Bakugou listens.</p>\n<p>Truthfully, nobody can tell if it's because he's playing along with Midoriya’s acting, or if he did it instinctively, silenced by the force that is Midoriya’s swearing mixed with his determined expression. </p>\n<p>Individually, they assume that it is the latter, because Midoriya is not one to swear with such heat in his tone, such fire in his eyes.</p>\n<p>And so no is surprised, not truly, when Bakugou shuts his mouth.</p>\n<p>Nor when he backs away, eyes vacant as he goes.</p>\n<p>No, they just go back to training, and the day goes on.</p>\n<p>-----</p>\n<p>The day ends yet again, and the students of 1-A seem to let out a collective sigh of relief, happy enough to be themselves once more. They leave the room quickly, exiting as soon as Aizawa hands over their grades for the assignment.</p>\n<p>Now walking back to the dorms, Shinsou admits, “Yeah, Uraraka and I figured each other out last night.”</p>\n<p>“How?” Midoriya asks, and Uraraka snorts.</p>\n<p>“Shinsou caught me struggling to try tying my tie like you do. I must have spent twenty minutes just trying to tie it as awfully as you!”</p>\n<p>“Uraraka!” Midoriya cries out, but when his friends start laughing, he joins in easily. </p>\n<p>“I’m just surprised that it took people so long to figure out that you were impersonating me,” Shinsou admits. </p>\n<p>“I didn’t get it until lunch,” Kaminari admits from behind them. “And that’s only because I sat with him.”</p>\n<p>“You probably didn’t hear it,” Jirou adds, just as Iida opens the door for the dorms. “But when Yamada-sensei went out in the hall, he was calling Aizawa-sensei.”</p>\n<p>“Why?” Midoriya asks, and Jirou snorts.</p>\n<p>“He didn’t realize you were acting,” the girl reveals, and Midoriya blinks in surprise. “He just thought that you were exhausted, and that you couldn’t be bothered today. I think he would’ve called you back to ask if you were okay if he hadn’t figured it out.”</p>\n<p>“Oh,” Midoriya says, ever so wisely, and Jirou snorts again. </p>\n<p>“I’ve got to ask,” Kirishima calls after Midoriya as the green-haired boy heads into the kitchen, grabbing himself some water. “How <em> did </em> you look so exhausted? Those eyebags are super realistic, dude!”</p>\n<p>“Oh! These?” Pointing to his eyebags, Midoriya smiles brightly. “I didn’t sleep!”</p>\n<p>“Like...at all?” Sero asks, and Midoriya nods.</p>\n<p>“Yep! I figured the best way to prepare would be to stay up the entire night- it gave me a chance to get ahead in some of my studies, too!</p>\n<p>“That...probably isn’t healthy,” Asui points out, and Midoriya laughs.</p>\n<p>“Probably not! But I did the same thing for Aizawa-sensei, too! It’s really fun once you’ve got enough caffeine to get through the day!”</p>\n<p>“Maybe it’s best if you come sit down,” Uraraka says, and Midoriya agrees easily enough, taking a seat next to Todoroki, who stiffens up in surprise before smiling. </p>\n<p>Once Midoriya gets comfortable, and the rest of the Dekusquad take their own spots on the couches, conversation continues, slipping away from his acting to talk about the others that they had seen. </p>\n<p>But when Aizawa walks into the common room, the students can’t help but look up, curious.</p>\n<p>“Aizawa-sensei,” Iida greets, already standing up. “Did you need something?”</p>\n<p>“Two things,” Aizawa agrees. “First, Midoriya.”</p>\n<p>“Yes?” Midoriya perks up, and Aizawa offers a slight smile.</p>\n<p>“Just wanted to let you know that you won’t have an assignment for a few days. Take a break, kid.” </p>\n<p>“You look ready to pass out,” Shinsou teases, and Midoriya beams.</p>\n<p>“We match!” The greenet agrees easily, causing Shinsou to snort. “But what’s the second thing, sensei?”</p>\n<p>“Right.” Letting out a sigh, Aizawa asks, “Why is Nemuri asking me for pants and skirts?”</p>\n<p>“Oh!” Uraraka exclaims, hopping up. “I’ll go get those! Be right back!” And with that, she dashes off, racing to the elevator.</p>\n<p>Aizawa blinks, then looks to Midoriya. “Explain.”</p>\n<p>“Kayama-sensei let the girls, and Aoyama, borrow the clothes needed for today’s assignment,” Midoriya explains easily. “It was likely Yaoyorozu or Hagakure, or maybe Aoyama, who remembered that Kayama-sensei teaches a unit on makeup and disguises, and spread the news so that those who preferred to could change up their uniform.”</p>\n<p>“Why haven’t you done that?” Aizawa asks. “Instead of buying an entire wardrobe.”</p>\n<p>“Well, that’s simple!” Midoriya laughs. “Sensei, she would never have <em> half </em> of the stuff I’ve had to wear. I think Kayama-sensei would resign before <em> ever </em> keeping a jurtleneck in her classroom.”</p>\n<p>“Say jurtleneck again and I’m disowning you,” Aizawa threatens, and Midoriya nods before freezing, mouth dropping open.</p>\n<p>“You’ll <em> what </em>?!”</p>\n<p>And that’s how Tuesday ends, with Midoriya’s friends laughing at his surprised reaction, and plenty of joy to go around.</p>\n<p>Yes, the day has been chaotic, but it has been good.</p>\n<p>(And whatever comes next will be much the same…)</p>\n<p>-----</p>\n<p>\n<em> (And somewhere, sometime, later that night, the boy with green hair and a golden heart will receive a message, one that offers a new assignment. One that is for Friday, one that is new and different and intriguing in its own way. And the text will advise Midoriya to bring it up, when he sees the principal tomorrow, for their weekly meeting. To plan, to discuss.) </em>\n</p>\n<p>\n<em> (A text is sent, a message delivered, an eager, albeit surprised, response coming in return.) </em>\n</p>\n<p>\n<em> (A whole new world is opened, and the future will be far more than before.) </em>\n</p>\n<p>\n<em> (As is the nature of a Plus Ultra school, no?) </em>\n</p>\n<p>\n<em> (Oh, how they will weep.) </em>\n</p>"
}