{
  "id": "29104074",
  "url": "https://archiveofourown.org/works/29104074?view_full_work=true",
  "author": [
    "vilsoo"
  ],
  "title": "Play",
  "rating": "Mature",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "F/M"
  ],
  "fandoms": [
    "呪術廻戦 | Jujutsu Kaisen (Manga)",
    "呪術廻戦 | Jujutsu Kaisen (Anime)",
    "Nanami Kento stans"
  ],
  "relationships": [
    "Nanami Kento/Reader",
    "Nanami Kento/You"
  ],
  "characters": [
    "Nanami Kento",
    "Reader",
    "Gojo Satoru",
    "Fushiguro Toji",
    "Getou Suguru",
    "Choso"
  ],
  "additional_tags": [
    "Rough Sex",
    "Alternate Universe - Jujutsu Kaisen Fusion",
    "Top Nanami Kento",
    "Explicit Sexual Content",
    "Submission",
    "Overstimulation",
    "Romance",
    "Multiple Sex Positions",
    "Hot Sex",
    "Sweet/Hot",
    "Face-Fucking",
    "Breeding",
    "Office Blow Jobs",
    "Fingerfucking",
    "One Shot",
    "Sadism",
    "Plot What Plot/Porn Without Plot",
    "Train Sex",
    "Gangbang"
  ],
  "language": "English",
  "series": "",
  "published": "2021-02-01",
  "completed": "2022-03-01",
  "words": "20,981",
  "chapters": "10/10",
  "comments": "261",
  "kudos": "10,908",
  "bookmarks": "1,984",
  "hits": "619,443",
  "summary": "<p>a Nanami Kento x fem!Reader one-shot fic.</p>",
  "notes": "<p>i do not owe the characters of Jujutsu Kaisen, all rights go to Gege Akutami.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">notes</a>.)\n</p>\n<p>follow my socials for more updates and fics from me!</p>\n<p>twt: P01SEUNS (with a zero)<br>tumblr: poiseuns<br>wattpad: poiseuns</p>\n<p>cw// rough office sex, degradation, overstimulation</p>\n<p>reminder that H/T means hair type. short hair, long hair, braided hair, curly hair, straight hair, or any type of hair regarding your race :)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>thank you for reading!</p>\n<p>follow my socials for more updates and fics from me!</p>\n<p>twt: P01SEUNS (with a zero)<br>tumblr: poiseuns<br>wattpad: poiseuns</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>follow my socials for more updates and fics from me!</p>\n<p>twt: P01SEUNS (with a zero)<br>tumblr: poiseuns<br>wattpad: poiseuns</p>\n<p>// subtle exhibitionism?? idk</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">more notes</a>.)\n</p>\n<p>this is like 2,600+ words lmfao</p>\n<p>follow my socials for more updates and fics from me!</p>\n<p>twt: P01SEUNS (with a zero)<br>tumblr: poiseuns<br>wattpad: poiseuns</p>\n<p>exhibitionism + subtle food play + oral sex + soft sex outdoors + breeding kink</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">more notes</a>.)\n</p>\n<p>happy valentines day ! &lt;33</p>\n<p>follow my socials for more updates and fics from me!</p>\n<p>twt: P01SEUNS (with a zero)<br>tumblr: poiseuns<br>wattpad: poiseuns</p>\n<p>// subtle obsession + blood kink + sadistic nanami + submission + light bondage + degradation</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">more notes</a>.)\n</p>\n<p>follow my socials for more updates and fics from me!</p>\n<p>twt: P01SEUNS (with a zero)<br>tumblr: poiseuns<br>wattpad: poiseuns</p>\n<p>cw: 🚂/gangbang, cuckolding, degrading, slapping, double penetration, size kink, choking, mind break, overstimulation</p>\n<p>this was deleted for various reasons, but i've decided to post it back here again since it's my birthday today!! can y'all believe its the 1 year anniversary of this fic lmao</p>\n<p>// sloppy to rough drunk sex + alcohol consumption + intoxication //</p>\n<p>nanami wears his glasses in the first half of this chapter.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_8_endnotes\">more notes</a>.)\n</p>\n<p>yes, this was inspired by Fifty Shades. i literally have the novel LMFAO</p>\n<p>- removed Y/N from ALL chapters<br>- revised a couple of chapters</p>\n<p>SCREAMING 100k+ READS ON AO3????? who the fuck is out here sharing my shit 😭 jkjk guys i'm literally so fucking,,, wow omg. you guys are literally the best. wow. ily guys. so fucking much. like wow.</p>\n<p>also hello to my new readers and followers!!! thank you guys for supporting my story!!! i've seen a lot of people outside of wattpad and ao3 support and share my story like on tiktok and twitter. i've seen multiple tiktoks about it and damn i... i really wasn't expecting my shit to blow up like KDJSHSJ i cant handle fame 😭</p>\n<p>follow my socials!</p>\n<p>twitter- P01SEUNS (with a zero)<br>tumblr- poiseuns</p>\n<p>// infidelity + posession + subtle stalking + rough sex + cum swallowing </p>\n<p>**i changed the name lolol</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_9_endnotes\">more notes</a>.)\n</p>\n<p>ib; DEM0NlCS on twt</p>\n<p>sorry for not updating in awhile! chapter 9 was supposed to release last friday but i procrastinated like shit for this chapter,,, this is why it’s hella short</p>\n<p>**IMPORTANT** </p>\n<p>I AM FINALLY POSTING MORE ONE<br>SHOTS ON MY TUMBLR!! the following stories will not be available on wattpad or ao3:</p>\n<p>COMING SOON:</p>\n<p>- Special Treatment | Doctor!Nanami x Reader </p>\n<p>- Midnight Encounter | Toji x Reader</p>\n<p>- Silk Sheets | Gojo x Reader</p>\n<p>- Under the Rain | Getou x Reader</p>\n<p>and more one shots of characters from different anime (like aot &amp; sniper mask from high rise invasion) will be coming soon!</p>\n<p> <br>if you'd like to read the summaries of my future tumblr one shots, you can read them on my twitter! </p>\n<p>follow my socials:</p>\n<p>tumblr: poiseuns<br>twitter: P01SEUNS (with a zero)</p>\n<p>// rope bondage + slapping + orgasm denial + breeding kink (once again) + rough sex + after care :D //</p>\n<p>alright since u guys voted for this one on twitter i have provided. enjoy</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_10_endnotes\">more notes</a>.)\n</p>\n<p>the Play series is now complete. i hope u enjoyed this!!</p>\n<p>yes, this is actually the last and final chapter of Play. this is why i waited after april first to publish. to be honest, writing one-shots only gets so repetitive to me. i prefer making an actual series with a real story behind it. and good lord i'm never writing a one-shot fic on ao3 ever again.</p>\n<p>even though Play has ended, that doesn't mean i'm gonna stop writing for you guys. it would mean so so so so so much to me if you support my other stories coming up soon, maybe in late april or may.</p>\n<p>i believe you all saw this on my last update that all my one-shots will only be on tumblr. speaking of tumblr, Special Treatment (a Doctor!Nanami x Fem!Reader fic) is already published!</p>\n<p>real quick, thank you all so much. really. the support i've been receiving on twitter, tiktok, tumblr, literally everywhere is insane and i love you all so much. i'm so grateful that Play ended on a very good note. i'm also extremely grateful for you guys. i'm happy, as a fic writer, that i was able to fulfill your standards and expectations. i apologize to my male readers tho 😭 i have never written a male reader fic, but i will try my best to write one if i can.</p>\n<p>much love,<br>jes &lt;3</p>",
  "text": "<p> </p>\n<p>   </p>\n<p>   The warmth of the shower flourishes through your skin, hot and ample, like a soothing cascade. It was all you needed after a long day of work. However, there is one more thing that could help fulfill your needs immediately. . .<br>\n<br>\n</p>\n<p>   <em>Nanami</em>. At first you saw him as a reserved man with an indifferent attitude, aloof and stoic of every situation. Sometimes he'd be blunt. Sometimes he'd be easily irritated. But with you, the day you two met, it was nothing but sweet words and roses. You'd pass by in his mind like a fleeting dandelion fluff, something that relieves him from all the stress as a Jujutsu Sorcerer.<br>\n<br>\n</p>\n<p>  And from there, the two of you became a couple, living together for just a few months. You smile as you remember the intimate moments you shared with him, roaming your hands around your body the way he did during those special nights. Your hand makes its way to your neck, then to your cheek. It's the anticipation building up— you wanted to be with him again so badly. Right here. Right now.<br>\n<br>\n</p>\n<p>   <em>\"When you come home from work and the door to the bathroom is slightly open, that's when you can come in by surprise,</em>\" you explain to Nanami two days ago. <br>\n<br>\n</p>\n<p>   <em>\"So. . . I can just walk right in the shower with you already in there?\"</em><br>\n<br>\n</p>\n<p>\n<em>   \"Yeah. Anytime. Only when it's slightly open.\"</em><br>\n<br>\n</p>\n<p>\n<em>   \"Hm. Interesting. . .\"</em><br>\n<br>\n</p>\n<p><em>   </em>Just as you planned, and right on time, you can hear the door to the bathroom open. You checked from the corner of your eye just to make sure it was Nanami and not anyone else. It was him for sure. Your lover in his usual, broad formal attire and signature glasses.<br>\n<br>\n</p>\n<p>   You still face away from him, pretending that you never heard him and proceeded to shower regularly. You can feel Nanami's eyes trace over your body, your skin. . . The anticipation started to crawl down your spine, unable to predict his next moves of whether he'd join you or just watch you. <br>\n<br>\n</p>\n<p>   A few moments later, you suddenly feel a certain presence from your back. Nanami was standing behind you, his hands slithering to your waist from behind where he held you. You gasp as if you were surprised by how quiet and fast he came in, but inside, you were very delighted. Maybe he could sense that. You were in his arms, safe and warm.<br>\n<br>\n</p>\n<p>   \"Nanami. . .\" you muttered, tilting your head back to see his face.<br>\n<br>\n</p>\n<p>   You can feel him. Not just his smooth, mysterious hands roaming on your wet body, but his cock pressing hard against your ass. Your heartbeat accelerated like you were almost terrified of his presence. You were throbbing down there for him to make a move on you, to use you the way he wanted to.<br>\n<br>\n</p>\n<p>   Nanami's right hand makes its way from your waist, to your breast, and to your neck, perfectly wrapped around it. He arches your neck farther to plant a sweet kiss on your lips-- a kiss so sweet and intimate that you melted inside. Nanami's straw blonde hair becomes one with his face as the water drapes over his bone structure. <br>\n<br>\n</p>\n<p>   He kisses the droplets on your lips, smiling in between. Instead of detracting from the intensity, the kiss drove the both of you crazy. Bound together in a kiss so tender that electrified every nerve in your body. <br>\n<br>\n</p>\n<p>   Nanami finds access between your legs with his knee. You find yourself slowly grinding on it, gasping between every kiss. Raw intensity, breathing fast, your heart rates accelerating. You wanted nothing more than this, to lean on his chest and kiss you from behind as the warm water runs down your bodies. It was a beautiful moment for the two of you.<br>\n<br>\n</p>\n<p>   \"I miss you,\" he whispers, kissing behind your ear gently. \"I miss you so much.\"<br>\n<br>\n</p>\n<p>   You feel his hands trace your figure, your skin smooth and slippery from rinsing off your body wash before he came inside. You turn around and kissed him once more. \"I missed you, too,\" you chuckled, throwing your arms around his neck.<br>\n<br>\n</p>\n<p>   Your lips met with his once again, but more urgently then as before. Nanami's tongue flutters against yours as if he could never get enough of you. This time, you make your way down past his chest and onto the base of his cock, stroking it. You leave small kisses on his chin, to his neck, and finally down on your knees where you look up into his eyes.<br>\n<br>\n</p>\n<p>   Nanami bites the bottom of his lip as you tease him by kissing the tip of his fine cock. The warm water was still beating down, adding onto the sensation. You could tell he was a bit frustrated with you teasing him for your pure enjoyment and that he needed your mouth on his cock badly. You immediately grant his wish and smirked.<br>\n<br>\n</p>\n<p>   You shove your mouth down on his length, filling it to your tonsils. You bob your head at a certain pace, watching him from above throw his head back and pant heavily. Your mouth waters more at the sensation of wanting his cock so badly, lubricating your lips in support of your journey up and down his shaft. <br>\n<br>\n</p>\n<p>   Nanami's soft groans turned you on. As you pulled away at certain times, a thin string of cum would hang at the tip of your tongue that you stick out in front of him. He loved when you did that to him and wanted to see much more. You allowed him to grab your head and face fuck you fast, sending you in a bliss. And after awhile, he'd let you take control of relishing his cock.<br>\n<br>\n</p>\n<p>   \"God, you're such a good girl,\" he mutters softly, praising you. \"Stand up for me.\"<br>\n<br>\n</p>\n<p>   As you slowly make your way up, your legs almost gave out from being on your knees. Nanami grabs your body and pulls you up from slipping just in case. Your body is facing away from him again. You find your hands laid on the fancy tiled wall of the shower. <br>\n<br>\n</p>\n<p>   Pushed against the wall, Nanami had access to your every need. He slipped his arm around your left thigh and raised your leg. From there, he slowly inserted himself in you, emitting a gasp out of you. You can feel his breath against the back of your neck, planting a small gentle kiss.<br>\n<br>\n</p>\n<p>   \"F— fuck,\" you sighed out. The water rolled over your clit, which started to throb for more and more of him.<br>\n<br>\n</p>\n<p>   After a few seconds, Nanami started thrusting. His thrusts were so deep and heavily focused that it made you tremble a little. However, your body was being held by him, so there's no way that you'd slip or fall away from him. Your hands ball into a fist, unable to grip onto something. <br>\n<br>\n</p>\n<p>   A wave of pleasure travels through your body, emitting moans and screams that echoed throughout the bathroom. Nanami's panting and tiny groans sent shivers down your spine. You roll your eyes back and grin as your thoughts clouded with the sensation of Nanami pounding you roughly against the wall. All of it was so mind blowing. <br>\n<br>\n</p>\n<p>   \"Fuck. Look at how beautiful you look when you take my cock like this.\"<br>\n<br>\n</p>\n<p>   You give a shattered moan in response. Nanami was enjoying being this close to you, hearing your heavy sighs and quivering moans. It was the most glorious Nanami could hear— raw, intense, and beautiful noises of pleasure as he fucked you hard. All of your limbs were shuddering against his chest. You were so close. You can feel it build in your walls. <br>\n<br>\n</p>\n<p>   \"Shit!\" you cried out. Your legs were completely quaking as you felt your pussy squeeze to an orgasm. <br>\n<br>\n</p>\n<p>   Nanami pulls out from you, panting heavily. You turn around and form a weak, yet genuine smile of satisfaction at him. He also had a little smile plastered on his face, sparkling in awe of your orgasm. It satisfied him as well.<br>\n<br>\n</p>\n<p>   He grabs your chin and peppered another alluring kiss on you. \"We should continue this at the bedroom. We used so much water today.\"<br>\n<br>\n</p>\n<p>   Your eyes open slowly as you met his gaze and beamed. Nanami's expression was soft at this time. It made you feel much safer, especially being embraced with his brawny arms once again.<br>\n<br>\n</p>\n<p>   You turn off the shower yourself and scoffed. \"You're probably right. But hey, it was still fun.\"</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p> </p>\n<p> </p>\n<p>   Nanami sulked in his chair like he was in a state of decomposition. Sleeplessness was apart of the job anyways. At least nine hours a day working, making money, going home, sleeping, and repeat. He started to think back to his youthful years of when he became a Jujutsu Sorcerer with his best friend Haibara.<br>\n<br>\n</p>\n<p>   Nanami grunted, withdrawing away from the thought. He threw his head back on the edge of his seat and stared plainly at the ceiling. He needed something to relieve his stress <em>badly</em>. Something that can distract him, something that can bring him a tiny bit of satisfaction. . .<br>\n<br>\n</p>\n<p>   Suddenly, Nanami's gaze averts to <em>you </em>as you passed by. You were on your way back from grabbing lunch downtown, walking gracefully down the aisle with a water bottle. His eyes follow your figure until you turn towards his direction, startling him. He quickly glances back down at his work, avoiding contact. <br>\n<br>\n</p>\n<p>   Nanami watches you subtly from the corner of his eye where you left the water bottle for the coworker a few monitors away from him. You were having a nice conversation with them and picked up a stack of files. You were still making your way down the aisle of monitors Nanami was in. He relaxed for a bit and sighed.<br>\n<br>\n</p>\n<p><em>   Why am I staring at her? That's just weird, </em>he thinks to himself.<br>\n<br>\n</p>\n<p>   Nanami clenched his jaw as he feels your presence nearby. When he looked at you a few moments ago, he <em>really</em> looked at you. Something radiated from within your appearance to him. Something so irresistible. Something he <em>desired</em>. Overthinking it drove him crazy, which frustrated him even more. <br>\n<br>\n</p>\n<p>   \"Hey, Nanami?\"<br>\n<br>\n</p>\n<p>   His ears rang at the sweet, bubbly tone of your voice, distracting him from his thoughts. He spun around in his chair to face you, leaning all the way back with his elbows on the armrests. Nanami's face was still the same after working with him this whole <br>\ntime— very nonchalant and platonic. You didn't have a problem with that, however.<br>\n<br>\n</p>\n<p>   \"These are for you,\" you continued, showing a tiny smile as you passed the first two stacks of files for him. <br>\n<br>\n</p>\n<p>   Nanami looked down upon them, flipping through the pages and sighed. \"Thanks, I guess.\"<br>\n<br>\n</p>\n<p>   \"Yeah, I'm sorry,\" you chuckled. \"Are you okay, though? You look like you haven't. . . slept.\"<br>\n<br>\n</p>\n<p>   Nanami watches the other salaryman that you encountered before head out with his stuff. It was just the two of you alone. He looked down at his lap and pursed his lips. \"Yeah. That's exactly it,\" he replied.<br>\n<br>\n</p>\n<p>   You stare into Nanami's face, almost caught off guard by how stunning this man really is. At work, you've only seen him passing by for other errands across the building or sitting at his usual desk all day. Sometimes you'd wonder about him, sometimes you'd never think about him like he was invisible. But really, he was just a regular employee like you that only thought about making money.<br>\n<br>\n</p>\n<p>   \"What?\" he suddenly asks, shooting a glance at you. The baritone of his deep, luxurious voice reverberated through your bones, turning you on. <br>\n<br>\n</p>\n<p>   He made you curious. Curious enough to approach closer to him, looking down at him in the somewhat sexy position he's sitting in right now. Nanami's neck arched, his gaze trailing up your figure as if he was studying you, too, finally getting the chance to see your full face.<br>\n<br>\n</p>\n<p>   \"Nanami. . . You're stressed, aren't you?\"<br>\n<br>\n</p>\n<p>   Nanami's lips were parted, completely robbed of speech by your radiant beauty. You soothed him. You mesmerized him. He hasn't felt this captivated in forever, especially with an elegant, formal woman like you. However, he forced himself to dismiss these feelings. Nanami's eyes attach at the floor again as he processed your words.<br>\n<br>\n</p>\n<p>   \"Something like that.\"<br>\n<br>\n</p>\n<p>   You tilt your head at him. Nanami sensed your curiousity inside. He felt overwhelmed by the confounding amount of attention he's receiving from you. Though he secretly liked it, he still forced himself to set those feelings aside.<br>\n<br>\n</p>\n<p><em>   </em>All of a sudden, you slowly get on your knees in front of him, stripping off your coat. You pull back your [H/T] hair away from your face. Nanami's heart raced when he <em>immediately </em>knew what you were thinking. He sat there, robbed of speech, aroused by the way you progressed things.<br>\n<br>\n</p>\n<p>   \"Is it okay if I. . . help you relieve the stress like <em>this</em>?\" <br>\n<br>\n</p>\n<p>   Your hands were on his thighs as you gazed up to him with a smirk. Your voice became honeyed with sweet, pure seduction— enough to turn Nanami on that he had no idea how to reply. He suddenly grew hard, the bulge forming right through his slacks that satisfied you. <br>\n<br>\n</p>\n<p>   \"Under the desk,\" he ordered. <br>\n<br>\n</p>\n<p>   You oblige, on your knees under his desk where he trapped you. Nanami takes your chin and cranes your neck up to see your face again. You were feeling excited— the risk of getting caught was what made you throb inside, especially with Nanami's dark business tuxedo that appealed to his dominance. It amused you.<br>\n<br>\n</p>\n<p>   \"What are you waiting for, hm? Take my cock out.\"<br>\n<br>\n</p>\n<p>   Your hands run through his thighs and up to his belt, undoing it along with his zipper. You pulled down everything that was in your way, revealing his cock that sprung free. Nanami felt your soft warm breaths flow over his shaft as you exhaled. You wrap your lips around Nanami's cock, taking your tongue and swirling around the tip, using his precum for lubricant. <br>\n<br>\n</p>\n<p>   His cock hit the back of your throat as you slobbered all over it. With your right hand stroking it, your left hand made its way to your panties where you rubbed your own folds, overstimulating yourself. <br>\n<br>\n</p>\n<p>   Moans emitting from you were vibrating through Nanami's body that it made him groan. \"God, you're that desperate, huh?\" <br>\n<br>\n</p>\n<p>   He takes your head and held it right where it felt good to him the most. You almost gagged, but somehow enjoyed it. Nanami then pulls your head away a few moments later where you coughed a little. As you collect your breath, he lets you take his cock on your own. He grunted from the head of his dick being rubbed on your tonsils. <br>\n<br>\n</p>\n<p>   <em>Finally, pleasure. . . </em>Nanami held onto your hair as you toyed with your heated pussy and sucked him off at the same time. You found yourself fondling with your own breasts under your sweater. As Nanami watched you, he thought about how an elegant woman like you in the workplace could be such a messy little slut. <br>\n<br>\n</p>\n<p>   \"Fuck,\" he grunted. The salaryman looks around one more time to see if anybody was in the room or approaching the room. So far, nobody came or passed by. He took the chance to stand up from his seat and rocked against you, fucking your mouth this time.<br>\n<br>\n</p>\n<p>   You hold onto his hips as a leverage, pulling him deeper into your throat. Nanami takes his cock out and slapped it repeatedly against your face, the juices rubbing all over your skin. He grabs onto the hair from your scalp and forces you to look up at him again.<br>\n<br>\n</p>\n<p>   \"Look at you. Such a filthy little whore.\" <br>\n<br>\n</p>\n<p>   With your tongue sticking out, Nanami harshly spit on your face, his saliva landing on the corner of your lips. Before you could even process it, he shoved his cock back in your throat again, thrusting roughly into your mouth. He fucked your face, sending you into pure bliss. <br>\n<br>\n</p>\n<p>   As Nanami was near his orgasm, he pulled his cock again from your mouth. He didn't want to fill you just yet. With the both of you enjoying this, he decided to take control of the situation. If you were going to help \"relieve\" his stress, he might as well play along and bite back. There was still a bit of frustration boiling in Nanami from earlier when you distracted him, leading him to impure thoughts. He's gotta get rid of it somehow.<br>\n<br>\n</p>\n<p>   \"Meet me in your office,\" he says bluntly, zipping back up his slacks and doing his belt. He left you there under the desk, watching as he heads down the hall where you worked at.<br>\n<br>\n</p>\n<p>   You take your time to catch your breath. You pull out the hand mirror from your pocket to check up on your face. Under the sunlight, your face revitalized to a glossy look from Nanami's cum. You were an absolute mess, especially with your subtle eyeliner. <br>\n<br>\n</p>\n<p>   However, you didn't really care. You finally fulfilled your fantasy of giving oral under the desk at work. And Nanami was fine, too— a handsome, stern man with straw blonde hair in his crisp business suit. Most men you knew in the workplace were like automatons of the modern workplace, measured and valued only for their productivity. But Nanami wasn't like them. He was a total enigma. <br>\n<br>\n</p>\n<p>   A man that belonged, a man almost like the others. . . but not quite. Just like you.<br>\n<br>\n</p>\n<p>   <em>Fuck, it was so big, </em>you thought to yourself, covering your mouth from wheezing in excitement. <br>\n<br>\n</p>\n<p>   You pick up your coat on the floor and dust it off. You didn't want to keep Nanami waiting. And you definitely didn't want to draw attention to the both of you. You stand up and smoothed out your skirt, heading down the hall with the anticipation crawling on your skin.<br>\n<br>\n</p>\n<p>   You head inside your office, closing the door behind. Nanami was leaning against your desk, his hands placed onto the edges, staring deeply at you. \"That took awhile,\" he says. <br>\n<br>\n</p>\n<p>   \"Sorry to keep you waiting.\" You face down at the ground as you feel your cheeks burn from subtle embarrassment. <br>\n<br>\n</p>\n<p>   Nanami pushes himself off the desk and makes his way to you. Your body freezes as he placed his hand on your neck, this time more gentle. His body was so close where you could smell his aroma; charcoal flames and cinnamon. It captivated you as if it was a drug. <br>\n<br>\n</p>\n<p>   \"Do you feel empty?\" he asks.<br>\n<br>\n</p>\n<p>   \"Huh. . .?\"<br>\n<br>\n</p>\n<p>   Nanami makes his way around you. Your lips were parted open, peculiar of his actions that drove you crazy. And his sultry, comforting voice that mesmerized you, like a song that you couldn't stop playing. . . <br>\n<br>\n</p>\n<p>   His hands were on your waist from behind, feeling the stunning silhouette of your figure. \"I asked you. . . if you feel empty,\" he muttered in your ears, causing you to shiver.<br>\n<br>\n</p>\n<p>   \"You and me. We're kind of the same,\" the blonde salaryman continued. \"You constantly search for something to pleasure you because working here drains you physically and mentally. I've always thought about that for awhile.\"<br>\n<br>\n</p>\n<p>   \"Well, yeah. . .\"<br>\n<br>\n</p>\n<p>   Nanami inched closer to your neck, breathing softly. \"Maybe I should reward you.\"<br>\n<br>\n</p>\n<p>   Your lips begin to quiver from how sensational his warm voice felt against your neck. Your neck was craned back, where Nanami held onto. His hands were big and veiny it overwhelmed you. \"You were so desperate for things to escalate from there, am I right?\" he smirked.<br>\n<br>\n</p>\n<p>   Suddenly, Nanami's right hand moved from your waist to your thighs, almost exciting you. He gripped harder on your neck, sensing that you were easily distracted from his tease. \"You were taking my cock so well. Then you decided to touch yourself. You desperate little slut. . . fingering your cunt like that.\"<br>\n<br>\n</p>\n<p>   Nanami's words were like ecstasy to you it made you chuckle. He realized that degrading you was just pure enjoyment added on for you, like the cherry on top. Your back was arched against his chest, slowly grinding on his crotch. With your tiny skirt pulled up, he teased your folds.<br>\n<br>\n</p>\n<p>   You give a sigh. “Please, just. . .\"<br>\n<br>\n</p>\n<p>   Nanami placed a small kiss on your neck, where you tilted it for more access. Then he suddenly grabs your neck, almost startling you, and pulls you for an urgent kiss. Nanami drove his tongue inside your mouth, setting off a shattering moan. <br>\n<br>\n</p>\n<p>   You were a complete mess. Your skirt was pulled up, your coat on the floor, and your white dress shirt unbuttoned to where your breasts stuck out. Nanami slowly pulled away and cupped your face. \"This will be my reward for you,\" he mutters.<br>\n<br>\n</p>\n<p>\n<em>   \"   . . .Let me ruin you.\"</em><br>\n<br>\n</p>\n<p>   And from there, things escalated. As your tongue clashed with his, emitting small moans and Nanami stripping his blazer off, you found yourself standing against your desk. He forces you to turn around again, his thumb rubbing on your sweet spot.<br>\n<br>\n</p>\n<p>   \"You're fucking soaked, huh?\" he chuckles. \"So needy. Allow me.\"<br>\n<br>\n</p>\n<p>   You give a nod. Nanami moves aside your laced panties, too lazy to take it off or slide it down, and proceeds to slip two fingers in. Your walls clenched around it, throwing your head back on his shoulder. He hovers his free hand over your mouth, muffling your moans as he moved. <br>\n<br>\n</p>\n<p>   The speed of his fingers inside you building was staggering. Completely mind-blowing. Your body felt like it was on fire it sent your knees weak. If he stopped, you'd cry. Cry, and beg. Beg for more of him. Beg for him to shatter you. Ruin you, just like he said.<br>\n<br>\n</p>\n<p>   \"Such a desperate whore,\" he pouted. \"You want my cock in you already?\"<br>\n<br>\n</p>\n<p>   \"Y— yes!\" you screamed. \"Please. . !”<br>\n<br>\n</p>\n<p>   Nanami smiled. He forced you over your desk, your back arched and ass sticking out for him. To him you looked perfect— a tiny skirt on you, white knee socks, and just radiant beauty. Your eyeliner was ruined from earlier and your eyes watering from the overstimulation Nanami gave. <br>\n<br>\n</p>\n<p>   He pulled his cock out again, slowly sliding it in. Your eyes roll back from how incredible he felt inside you that it made you grin widely. Thick, long, stretching you to your limit. Your knees fell weak again. Nanami holds onto your waist as he thrusted ruthlessly inside you, making you scream and shriek. Your breasts were pressed against the smooth surface as well.<br>\n<br>\n</p>\n<p>   Tiny grunts escaped out of Nanami as he felt your walls engulfing his throbbing cock. \"You feel so good, all for me, huh?\" he panted out. \"Look at how pathetic you are. So beautiful.\"<br>\n<br>\n</p>\n<p>   Your pussy pulsates, making Nanami's cock twitch. The both of you were so close. As you were nearing your orgasms, he immediately slipped out and finished you off with his fingers again. You began to convulse as you scream into your orgasm. Nanami allowed you to turn around and look up to him, panting heavily. You collapsed on the desk as you felt your pussy drip with cum. Your legs began to tremble.<br>\n<br>\n</p>\n<p>   Nanami hovers above you. He studied you again, this time his gaze much softer than last time. He lets out his load on your stomach, grunting heavily against your ears. You couldn't help but run your fingers through his hair. After finishing, he pressed his lips onto yours for another heated kiss. <br>\n<br>\n</p>\n<p>   \"You feel satisfied now?\" he whispers.<br>\n<br>\n</p>\n<p>   You sighed, this time cupping his face. \"I should be asking <em>you</em> that. Do <em>you</em> feel satisfied, Nanami?\"<br>\n<br>\n</p>\n<p>   The two of you locked eyes. Nanami's pupils were slowly dilating, causing your heart to skip a beat. The more he stared into you, the more he slowly fell for you. . .<br>\n<br>\n</p>\n<p>   Nanami kisses your forehead and smirked. \"I <em>am</em>,\" he replies. \"All because of you.\"</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>   Outside the tinted window comes the night sky, exhibiting the dazzling pearls of bright stars. The midnight aura captivates you, like a soft whisper into your heart. It was a moment that felt perfect; the sentimental, romatic type of perfect.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>   Tonight you were on a date with Nanami at a drive-in cinema. Inside his car, the situation was insanely intimate, yet cozy. Nanami's arms were wrapped around you while you straddled on his lap. The air grew thick with tenderness, making you feel safe and warm against his chest. What drove you even crazier was his rich and sweet Burberry black cologne scent. Could this man get any hotter?</p>\n<p> </p>\n<p>   \"<em>Harold, it's Bateman. Patrick Bateman. You're my lawyer and so I think you should know— I've killed a lot of people</em>,\" says the movie on the large screen.</p>\n<p> </p>\n<p>   You cradle onto Nanami's lap, feeling his tongue press against your lips, where you gladly allowed him to delve inside. It was a slow, yet sloppy kiss; every few seconds you'd separate with quick and shaky breaths. Your fingers run through his soft blonde locks and onto his nape.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>Nanami adjusted the seat a little lower. You rub yourself against his crotch on purpose, making him smirk. A few moments later you pull away, revealing a thin line of saliva stretching in between. Just staring at him made your heart almost falter— he looked so beautiful under this lighting.</p>\n<p> </p>\n<p>   Meanwhile, Nanami's hands follow the curves of your body and onto your ass. You inched closer to his face where you couldn't see much of his face except for his lips. \"Nice skirt,\" he whispers, smirking.</p>\n<p> </p>\n<p>   \"You said that like twenty times today,\" you giggled. \"Do you like it that much?\"</p>\n<p> </p>\n<p>   Nanami suddenly reaches under your skirt and grabs onto your ass with his cold hands, making you gasp in surprise. Your heartbeat accelerates, for you were nervous for the things that were about to go down.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>As you got ready earlier, you planned to not wear anything under your skirt except for your underwear. Grinding against his crotch while kissing stimulated your walls, making you feel aroused and excited.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>\"I love it.\" Nanami mutters, his mouth trailing along your jaw until he hovered above your lips.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>\". . . <em>And I can't wait to fuck you in it</em>.\"</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>Immediately, and desperately, your lips cling onto his again. You kissed him so many times today that your lips almost felt sore. Nanami felt the same, but he wasn't a quitter. As you lost yourself in the moment, your hands come upon the zipper of his trousers. Everything felt so rushed, so quick. It sent wild tremors to your nerves, where you poised with expectation.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>Nanami pulled his pants down to his thighs, where his hard cock rubbed against your folds. In between kisses, your moans and breath became staggered. The sensation of his cock filling your walls were all you needed to be right now. You pulled your skirt up and moved aside your underwear. Then, you mounted yourself on him slowly, allowing him to slide it in.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>His cock pulses through your silky walls, causing you to throw your head back from the stimulation. Your thighs subtly tremble from how wide and deep he is inside you. Nanami pulls you closer to him and places your forehead on his. \"Are you okay?\" he whispers.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>You give a nod. \"We've done it before, remember? But. . . not this position. . .\"</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>\"I know.\" Nanami's hands went back on your ass, spreading it for you as you began to rock your hips. The edges of your skirt caress his sweater and naked thighs. Your walls envelop his cock, causing Nanami to pant heavily. He held onto your ass as you swirl your hips, thrusting yourself onto him.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>   Your eyes shut tightly as you were riding him, feeling the mind-blowing pleasure rush through your blood. Your mouth was wide open and your eyebrows furrowed. Nanami runs his hands through your chest and onto your bouncing breasts that stuck out over your tank top. \"Fuck! Oh my god!\" you moaned. \"Na— Nanami!\"</p>\n<p> </p>\n<p>   With your hands thrown around his neck, you initiate another heated kiss. This time, Nanami began to thrust inside you, plundering your walls with such great speed it completely shattered you. Then, he grabs onto your neck as his tempo increased greatly. His cock began to ache. \"<em>Fuck</em>, oh god,\" he grunted. \"Come on, beautiful. I wanna hear more of you.”</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>“Shit! A— ah! Fuck, <em>Nanami</em>!”<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>  Hearing his own name from you like this made his stomach flutter. Every whimper, every scream, every movement. . . the more he hit the right spots, the more glorious sounds came out of you. As your neck was hovering over his lips, he took the chance to suck on your skin.</p>\n<p> </p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>And from there, where you felt your pussy pulsate around his cock, your orgasm came in clutch, completely draining you physically. Nanami slid himself out of you as his cum dripped on the hem of your skirt. You collapse on his chest, breathing heavily.</p>\n<p> </p>\n<p>   \"<em>There are no more barriers to cross. All I have in common with the uncontrollable, and the insane, the vicious, and the evil. . . All the mayhem I have caused and my utter indifference toward it. . . I have now surpassed</em>,\" the movie on the large screen narrated.</p>\n<p> </p>\n<p>   Nanami held you again in his arms like you were cuddling with him. Your body, tired and drained, felt warmth. After awhile, he planting small kisses on the top of your head, making you smile.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>“Round 2. . .?” you suddenly ask, smirking.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>“Damn— already?”</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>“No. . . I meant in the morning. . .”</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>Nanami gazed down at your face, his expression softening every time he laid his eyes on you. He wiped the remaining tear residue on your cheek from earlier with his thumb and cupped your face.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>“If you’re able to handle it,” he winked.</p>\n<p> </p>\n<p> </p>\n<p>   </p>\n<p>   Every time you reach up to grab something from the cupboards, your right shoulder feels heavy, as if something was pushing you down. It didn't seem to bother you when you first experienced it last week. However, as the days went by and the pressure on your shoulder remained, it was enough to become an annoyance.</p>\n<p> </p>\n<p>   Nanami invited you over to make dinner with him at his place tonight. He thought it'd be nice to bond with you again after a month of being overseas for some business trip. Because of his kindness, you couldn't refuse his offer. In fact, you wanted to see him too.<br>\n<br>\n</p>\n<p>   Nanami was just somebody you worked alongside with before he quit being a salaryman. After hearing about this, you respected his decision and wished him well. Nowadays at the workplace, you felt tired and lonely deep down. Sometimes you wished Nanami stayed. Sometimes you wished that the two of you became closer outside of work.<br>\n<br>\n</p>\n<p><br>\n<em>   I hope I can rebuild that opportunity tonight, </em>you thought to yourself as you walked to his doorway.<br>\n<br>\n</p>\n<p><br>\n   You rung the doorbell and sighed. When Nanami finally opens the door, you found yourself holding your breath from his presence. He looked effortlessly captivating as usual, even from the last time you saw him. His fine blonde hair, his muscular upper body. . . he had an appearance, overall, that makes you stop at your tracks and just admire him. <br>\n<br>\n</p>\n<p>   Before Nanami was about to greet you, his eyes suddenly widen at something <em>on</em> you. <br>\n<br>\n</p>\n<p>   A small grotesque cursed spirit was sitting on your shoulder, which he knew you were very unaware of. He remained calm by feigning his expression to a subtle, presentable smile for you.<br>\n<br>\n</p>\n<p><em>   I can't let her know about that, </em>Nanami thought. <em>Just act normal for now.</em><br>\n<br>\n</p>\n<p>   \"Hey,\" you greeted. \"May I come in, or. . .?\"<br>\n<br>\n</p>\n<p>   \"Oh,\" Nanami scoffs, caught off guard. \"Yeah, sure. Sorry about that.\"<br>\n<br>\n</p>\n<p>   As you walked in, the coziness of his house felt so welcoming to you as your first time. It was a simple modern house; minimalistic, visually pleasing, and expensive. The khaki colored walls and simplistic paintings added a sense of warmth among the interior. This was <em>exactly</em> the type of environment you pictured Nanami to live in.<br>\n<br>\n</p>\n<p>   \"This way,\" he says. <br>\n<br>\n</p>\n<p>   You follow him to his wide kitchen and leaned against the counter. Everything was so clean and spotless as you looked around. The kitchen was sleek and monochrome, giving an iridescent sheen that easily draws to the eye.<br>\n<br>\n</p>\n<p>   You cleared your throat. \"So. . . How've you been so far?\" <br>\n<br>\n</p>\n<p>   You watched as Nanami slipped out a bottle of champagne from the wine rack. \"I'm doing fine,\" he replies with a warm smile. \"How are you, though? You doing okay?\"<br>\n<br>\n</p>\n<p>   You sighed down at the floor, not realizing you were holding onto your right shoulder and subtly massaging it. \"Yeah, thanks for asking.\"<br>\n<br>\n</p>\n<p>   Nanami notices your movement from the corner of his eye. He forced himself to shake the thought away before he could proceed. \"Champagne?\" he suddenly offered.<br>\n<br>\n</p>\n<p>   \"Yes please, thank you.\"<br>\n<br>\n</p>\n<p>   Nanami hands over the glass of pinot noir flavored champagne to you. He watches as you take a small sip the same time as he did. You set the wine glass on the sleek counter after and sighed. <br>\n<br>\n</p>\n<p>   \"Hey, uh. . .\" <br>\n<br>\n</p>\n<p>   You look up from the floor, realizing that you haven't made that much eye contact with him. \"Yes. . ?\"<br>\n<br>\n</p>\n<p>   \"Is your shoulder feeling alright?\"<br>\n<br>\n</p>\n<p>   Nanami inched a bit closer to you, where you craned your neck just to look up at him. You place your hand on your right shoulder and chuckled. \"No, not really. . . You noticed?\"<br>\n<br>\n</p>\n<p>   He nodded as placed his wine glass down to roll up the sleeves of his dark blue dress shirt. \"I can help you with that if you'd like.\"<br>\n<br>\n</p>\n<p>   Nanami's deep voice made your heart flutter. Its tones were so pleasing and rich, almost a bit husky, but smooth and calm enough to enlighten somebody. \"I'd like that,\" you say, smiling up at him. \"What are you gonna do, though?\"<br>\n<br>\n</p>\n<p>   \"Just a short massage on your shoulders. Are you okay with that?\"<br>\n<br>\n</p>\n<p>   \"I mean, if you're good at it,\" you chuckled. <br>\n<br>\n</p>\n<p>  You turn your back on Nanami and straightened your posture. The cursed spirit sitting on your shoulder wasn't as big, but enough to irritate him. He gave it a menacing glare as he raised his hand and sliced the air, disintegrating the curse.<br>\n<br>\n</p>\n<p>   You felt the air hit onto the back of your neck, causing you to shudder. You frowned. \"What did you just do—?\"<br>\n<br>\n</p>\n<p>   Your words were caught off when Nanami draped his hands onto your shoulders firmly to distract you from the thought. \"Hm? Did you say something?\" <br>\n<br>\n</p>\n<p>   Nanami's movements somehow soothed you, as if the pressure from before finally disappeared. You feel him press the tips of his fingers and thumbs onto your trapezius, rolling the muscles up to your collarbones with such gentle, consistent pressure. You continue onto your thought from earlier. \"Sorry. . . it was nothing,\" you muttered.<br>\n<br>\n</p>\n<p>   \"That's alright,\" he chuckled softly. \"You feel any better now?\"<br>\n<br>\n</p>\n<p>   \"Yeah. Thank you for this, Nanami.\"<br>\n<br>\n</p>\n<p>   The rhythm he was going was enough to refresh your mind. Nanami inched closer to massage your shoulder blades, lowering his hands steadily. <br>\n<br>\n</p>\n<p>   \"By the way, do you know what we should make for tonight?\" you asked as your eyes roamed around the kitchen.<br>\n<br>\n</p>\n<p>   Nanami hummed. \"I've always wanted to try tumeric salmon. How about that?\"<br>\n<br>\n</p>\n<p>   \"Sounds good. . .\" <br>\n<br>\n</p>\n<p>   You shut your eyes, suddenly thinking about how the two of you interacted at the work place.<br>\n<br>\n</p>\n<p>   There were times when he'd bump into you by accident, where a startled \"sorry\" would gush out his lips as he passed by you. There were times when you'd reach over to grab the door, your hand would graze against his. The dynamic between you two grew when you started talking to him and realizing that he was the most respectful man out of everybody else.<br>\n<br>\n</p>\n<p>   But deep down, something stirred in your stomach everytime you thought about him. His consideration and emotional warmth for you was enough to make your heart ache. It was such an unusual feeling to you, as if something sparked in your body. Something that lit up, like the way how Nanami's eyes did when he saw you for the first time.<br>\n<br>\n</p>\n<p>   As Nanami proceeded to massage you, his eyes softens at your stunning figure, the soft tones and gleaming skin that would enlighten his days. There were no thoughts, no focus. . . Only the desire for you. The pain of holding back for too long was enough to sting him inside.<br>\n<br>\n</p>\n<p>   And you felt the same damn way.<br>\n<br>\n</p>\n<p>   Nanami sighed, refraining from his thoughts. \"Alright. I think I'm done. If your shoulder still hurts just let me know.\"<br>\n<br>\n</p>\n<p>   The moment he let go of your shoulders, you felt an instant relief. The weight was finally gone and it no longer irritated you. \"Holy shit,\" you scoffed. \"My shoulder feels way better now.\"<br>\n<br>\n</p>\n<p>   As you turn around to face him, your heart nearly leaped when you saw his face up close again, making your cheeks tint a light red. Nanami's gaze fixated onto your face, then to your lips. His pupils began to dilate. You feel your own body tightening from holding your breath, wondering what he was thinking about. <br>\n<br>\n</p>\n<p>  His scent was so intoxicating, like expensive mahogany wood with undertones of sage. A thrilling shiver coursed over you as he pulled your body closer to him by your waist. Then, in that very fine moment, holding onto his face, Nanami kisses you tenderly. <br>\n<br>\n</p>\n<p>   You kissed back, tasting the champagne from his lips. Your body melts onto his from his sensational touches. It was a desperate, messy kiss with fervent urgency, like you needed him right here and right now. You pulled him closer to you with his collar, undoing the buttons as your breaths mingled in between kisses. <br>\n<br>\n</p>\n<p>   You hoisted yourself onto the edge of counter top from behind, feeling Nanami's hands roam from your neck and to your waist, then to your thighs. The swift gradation of intensity was enough to make you gasp for air, like a sense of helplessness and desperation rushed in. A moment the both of you have been dying for, where nothing else in the world mattered, was right at your fingertips.<br>\n<br>\n</p>\n<p>   \"<em>Nanami</em>,\" you sighed out. \"Please. . .\"<br>\n<br>\n</p>\n<p>   You take his hand, guiding it from your waist and onto the seam of your pleated skirt. You couldn't find the right words to say to him. However, the soft desperate breaths against his jawline were enough to tell him. You wrapped your legs around his hips, bringing him closer.<br>\n<br>\n</p>\n<p>   \"Are you sure?\" His nose nudged against yours, where he stared down at your body. <br>\n<br>\n</p>\n<p>   \"Dinner can wait. . .\"<br>\n<br>\n</p>\n<p>   Nanami takes your chin with his left hand and kisses you, slipping his tongue in your mouth. It drove you crazy, where the urge was stronger than any drug or the champagne you both drank. His right hand lurks under your skirt, slipping his finger around the waistband of your laced underwear. You pull up your skirt and helped him slip it off onto your knees.<br>\n<br>\n</p>\n<p>   His fingers were against your folds, making you feel warm down there. You spread your thighs farther, unhooking your ankles from around his hips. Nanami pulls away from the kiss, grazing his lips onto the soft spot behind your ear. As you bucked your hips forward, he slid his fingers inside. <br>\n<br>\n</p>\n<p>   You feel yourself tingle from his steady pace inside your tight walls. Nanami's digits were thrusting in and out, where lewd sounds echoed among the kitchen. You hear him spew profanities against your ear, enough to throw your head back and moan. <br>\n<br>\n</p>\n<p>   Your folds began to glisten. You were so close. Your breaths became heavy and your body grew hot as Nanami grabbed onto the back of your neck to hold your head. \"Keep your head up for me. I want to see you,\" he says.<br>\n<br>\n</p>\n<p>   It wasn't until a phone call from Nanami's back pocket disrupts the moment. However, it was his obligation to answer any phone call that comes his way, especially for emergencies. <br>\n<br>\n</p>\n<p>   Nanami sighed in exasperation. \"I forgot I was supposed to receive a phone call today from my colleague. Just. . . sit back for awhile, okay?\"<br>\n<br>\n</p>\n<p>   You looked down at your lap where Nanami's right hand rested on your inner thigh. Your clit was still throbbing, and after being edged like that it drove you insane. You managed to stay cool about it, though.<br>\n<br>\n</p>\n<p>   \"Hello?\" Nanami answers. Suddenly, his expression feigned to a nonchalant, displeasing look as he heard the voice from the other line.<br>\n<br>\n</p>\n<p>   \"<em>Nanami! I'm so surprised you answered! Ijichi told me to call you for him. I'll tell you exactly what he said, so please don't hang up on me this time!</em>\"<br>\n<br>\n</p>\n<p>   \"Ugh. Hurry up, Gojo. I'm busy right now,\" Nanami grunted.<br>\n<br>\n</p>\n<p>   As Gojo from the other line spoke through the phone, Nanami's hand travels back onto the outer layers of your clit, almost frightening you. Your gaze drifts to his face where you found him smirking down at the ground, pretending to listen, while he finger fucks your cunt.<br>\n<br>\n</p>\n<p>   You put your hands over your mouth, muffling your moans as Nanami pushed his fingers inside you. The more he went faster, the more it dampened around his fingers. You tried so hard not to scream from the heat pulsing through your blood. It was driving you completely insane.<br>\n<br>\n</p>\n<p>   \"Oh really?\" he responds to the phone. \"Good for you, Gojo. I hope Itadori finds out soon enough.\"<br>\n<br>\n</p>\n<p>   His fingers thrusted rhythmically inside you. You feel your legs begin to stiffen as moans escape through your lips, satisfying Nanami. Your walls clench tightly as you're brought to your climax, making you pant heavily. From there, you fall back onto the kitchen counter as you catch your breath.<br>\n<br>\n</p>\n<p>   Nanami still held the phone, gazing down at your body laid out on his counter. He took the three fingers he used on you and hovered it over your mouth. You stick your tongue out and wrapped your lips around it, tasting yourself. He watched as you sucked on his digits, the intensity growing on his face.<br>\n<br>\n</p>\n<p>   \"How's he doing anyways? Everything going on okay?\"<br>\n<br>\n</p>\n<p>   Nanami was on your right side of the counter, very close to the edge where you can see his bulge. You take your hands and undo his garments, startling him. He slips his fingers out your mouth, where a thin line of saliva draped over your lips from the tip of your tongue. You looked up at his eyes and grinned in amusement.<br>\n<br>\n</p>\n<p>  He watches as you pull his cock out, giving him a small tease with your hands at his shaft. You offer your mouth for him again, letting him shove his length at the heat of your throat. Nanami sighed and grabbed onto your breasts. You put your hand on top of his and smiled.<br>\n<br>\n</p>\n<p>   \"<em>Hoy, Nanami! Are you tired of me already? I'm not even halfway done!\" </em>Gojo complained.<br>\n<br>\n</p>\n<p>   Nanami felt a tight sensation somewhere in your throat, where he purposefully held himself at, almost making you choke. Struggling for breath was what turned him on even more. He then proceeds to pull out, letting you gasp for breath, but it wasn't enough. He made you feel good, now it was your turn to make <em>him</em> feel good. Overall, you enjoyed gagging on his cock.<br>\n<br>\n</p>\n<p>  After a few moments of him fucking you in the throat, he pulls out, where more lines of saliva and lubrication drape onto your chin. You stare up at the ceiling to catch your breath again as Nanami moved to the side of the counter where your cunt stood out to him.<br>\n<br>\n</p>\n<p>   \"Sorry, Gojo. Go ahead and continue on.\"<br>\n<br>\n</p>\n<p>   You give him a nod, allowing him to insert his length slowly. A moan emitted from your mouth, quickly muffled again by your hand. Your back arches from the sensation of Nanami's cock inside you. It was tormenting, though, to not be able to scream like before. <br>\n<br>\n</p>\n<p>   Your leg rested on his shoulder as he pounded into you, making you whine. The more you made noise, the more proceeded to go rough, holding onto your neck. Your hips follow his movement, slowly grinding on his throbbing cock. You completely lost control of all your senses— right here on his kitchen counter.<br>\n<br>\n</p>\n<p>   <em>\". . . and that's basically it!\" </em>Gojo exclaimed over the phone. <em>\"Don't forget next Saturday, okay? Bye bestie!\"</em><br>\n<br>\n</p>\n<p><em>  </em>The moment he hung up, Nanami hovered above you, plastering your mouth with a sweet kiss. You moan softly between each kiss, running your fingers through his blonde hair. His thrusts slowed to a steady tempo. Nanami never left his eyes off of you, nudging his nose against yours again and feeling only <em>you</em>.<br>\n<br>\n</p>\n<p>   \"Not being vocal tonight, huh?\" he smirked. \"You can scream all you want now, sweetheart.\"<br>\n<br>\n</p>\n<p>   Loud moans escape your mouth as Nanami's cock plundered inside you, causing you to throw your head back. You hear his groans against your ear, completely turning you on. Soft kisses, hair pulling, and grabbing. . . it was enough to make you go wild. It was enough to make your body spark with desire.<br>\n<br>\n</p>\n<p>   \"<em>Thank you again, </em><em>Nanami. . .</em>\"</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>  The golden rays of the sun coats over your body, providing warmth like a sweet embrace.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>   As the wind blew, the surrounding grass moved in steady waves, softly rustling. It was a vast meadow full of lush hills, bountiful trees and nurturing flowers. Nearby was the pond, where the blue waters meet among the edge of the grass.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>   You smile down at your lap where Nanami laid his head on to nap. The locks of his straw blonde hair intertwined with your fingertips as you run through his scalp smoothly. His arms were folded and his face relaxed as he felt your touches.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>Today you were on a picnic date at a meadow faraway from the city. Scattered throughout the blanket were plates of fruit, sandwiches, pastries, and loaves of bread that Nanami bought. Wine glasses were kept on a small wooden board along with the bottle of champagne. The air was sweet and the weather was beautiful. It was romantic as well.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>As Nanami breathed softly below you, you pick up the grass nearby and sprinkled it on his face. A giggle came out your mouth while he frowned. \"What are you doing?\" he chuckles.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>\"Checking to see if you were awake,\" you reply, brushing his hair.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>You reach over to take another sip of your wine. Nanami watches your neck as you swallow, then drifts his gaze to your lips. The way how you hold the spout against your plump lips, consuming the cherry wine. It mesmerized him.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>You sat on your legs shifted to one side, one hand firmly on the blanket and the other elegantly holding your wine. You had on a silky white mini dress with long puffed sleeves that revealed your cleavage. Nanami sat up from your lap and grunted. \"Well, I'm awake now.\"</p>\n<p> </p>\n<p>   You set your wine back on the wooden board and picked up a chocolate covered strawberry. \"Here,\" you offered, hovering the tip over his mouth.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>Nanami takes a bite off the strawberry and smiled. \"Thanks.\"</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>You take another strawberry for yourself from the plate, slowly wrapping your lips around it as you devoured the sweet taste of chocolate and freshness. He watches your lips again, the same way how you took a sip of your wine earlier. Pinpricks of electricity spark when you met his eyes, where the conceal of desire finally starts to unveil.</p>\n<p> </p>\n<p>   \"You have some chocolate on you,\" Nanami suddenly says.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>   \"Where?\"</p>\n<p> </p>\n<p>   Nanami's hand reaches over to hold your face, his thumb slowly making its way to the bottom of your lip. He then holds onto your chin, craning your neck higher to gaze down at you. His face was inches away from yours, enough to make your body react with nervousness by his coaxing touch.</p>\n<p> </p>\n<p>   \"On your lips,\" he mutters. \"I'll clean it off for you if you'd like.\"</p>\n<p> </p>\n<p>  A shiver ripples through your veins from his voice— his deep, soothing voice that allures you every time. You tilt your head against his palm and inclined your lips closer to his.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>\"I'd like that a lot,\" you replied.</p>\n<p> </p>\n<p>   Nanami pressed his lips onto yours, kissing you gently and tasting the sweet chocolate he cleaned off. Then gradually, from just one soft kiss, the surge of intensity rushed through your body. His hands made its way to your waist, kissing you harder that you fell on the blanket.</p>\n<p> </p>\n<p>   His lips were as soft as the petals of a rose, enough to become so addicting that you craved for more. All you could think of in the moment was him, and only him— on this vast field of soft grasses and the flowing pond nearby, the two of you become one. You cling onto Nanami like he was the only solid thing in your hazy, drunk world, robbing you of breath every second.</p>\n<p> </p>\n<p>   His tongue slips into your mouth, gentle but demanding, where your body instantly dissolves into his. His presence alone felt wonderful to feel on top of your body. It drove you completely crazy— crazy enough to moan and gasp for air in between kisses.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>\"<em>May I go down on you?</em>\" Nanami whispers in your ear.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>Your heart thumped at the question. Deep down, you wanted him. You were aching for him. You let out a \"yes\" along with a shy nod, lifting the seam of your dress up for him. You feel Nanami kiss your breasts, then trailed his lips slowly to your stomach. The anticipation swirled in your body when he got between your thighs and pulled down your underwear.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>The moment his tongue coated your folds, you shuddered. You throw your head back and stared at the sky, sighing as Nanami swirled his tongue among your sex. His skillful tongue paced in rhythm, where your legs twined around his head. Moans escape out of your mouth from the mind blowing sensation.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>You began to buck your hips and tighten your thighs. Nanami forcefully spread your legs farther apart, glancing up at you with a smirk. \"Don't close them yet, sweetheart. I want to see you cum on my tongue.\"</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>You feel his strength increasing as he continued to plunder you in his mouth, melting your resistance. You had no choice but to grip onto the picnic blanket and ball your fists. Nanami drove his tongue deeper, loving the glorious sounds that came out your mouth.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>In that moment, you're brought to the brink of your climax. You feel your legs begin to stiffen around Nanami, allowing him to slow down to look up at you. Your face was glowing as you panted for air.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>Nanami climbed over you, planting another sweet kiss on your lips. \"Fuck,\" you sighed out. \"Nanami, please...”</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>\"Use your words,\" he mutters. \"Tell me what you want.\"</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>You couldn't find the right words to say, for your thoughts were jumbled. Your body sparked with desire for him again. Nanami sucked on the bottom of your lips, softly groaning.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>\"I. . . I want you,\" you whispered. \"R— right here. Right now.\"</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">  </span>\"Such a needy girl,\" he chuckled. \"All ready for me to ruin you, hm?\"</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>Nanami held your waist, turning you over to the side where you faced the pond. As he undid his undergarments, he laid behind you on his side. His hands slither underneath your knee, propping it up for access as he slowly slid his cock in your entrance.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>You feel Nanami hold onto your breasts, breathing heavily on your neck as he thrusted. Your back arches from the sensation of his cock, shutting your eyes as whimpers and screams escape your lips. He kisses your cheek, your neck, and the back of your shoulders as his pace increased.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>\"You look so cute getting fucked like this,\" he says.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>Profanities spewed from your mouth as you grabbed on the blanket. Your body reacted with the affection Nanami gave, caressing and absorbing every part of him that fulfilled you. The soft “I love you”s, the mixture between tender and rough that sent you over the edge, and the whining that falls from your lips as he thrusted.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>A few moments later after switching positions, the cascade of the sun brought your naked body into Nanami’s full view, mesmerizing him. You straddled on top of him, throwing your head back as you rocked your hips on his cock. The vivid sunlight moors on your skin, making you look heavenly in his eyes. You were his angel, after all.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>Then he hovered above you, pumping into your cunt with full hard thrusts. The frosting of the cupcakes spread on your breasts, where Nanami licked them away slowly. Every sensitive point in your body sparked with pleasure, drawing to another orgasm. Nanami kisses your ear, remembering how he whispered sweet nothings the whole time that sent tingles down your spine.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>“<em>Just look at how good you’re taking me right now.</em>”</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>“<em>You’re mine.</em>”</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>“<em>Does this feel good?</em>”</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>“<em>I wanna hear you.</em>”</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>And in that final moment, where your body began to grow exhausted, Nanami spurted his cum inside your walls. Your thighs quivered along with your body as he slowly pulled out. His warm fluids draped your outer folds, slick and moist like your upper body. Your hair was in a big mess as well.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>It was getting dark. You and Nanami were too exhausted to drive back home. The two of you laid on the ground, catching your breath. The leftover food was packed and everything was ready to go.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>“Should we just sleep in the car?” you suggested.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>Nanami yawned. “Sure, why not.”</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>That night, you slept on Nanami’s chest in the backseat. He ran his fingers through your hair this time, studying your beauty as you slept. The radiant moonlight, the twinkling stars. . . it all seemed that nature had blessed you today.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">  </span>“So pretty. . .” he whispered, fluttering his eyes before he drifted to sleep.</p>\n<p> </p>\n<p> </p>\n<p dir=\"ltr\"> </p>\n<p dir=\"ltr\">   The fresh scarlet blood from your wounds coated onto your white button up blouse and black skirt. It trickled down from your face and from your nostrils, which you smeared onto your lips. However, you didn't care much about your rugged attire. You were too enervated to clean off the blood.</p>\n<p> </p>\n<p>   At the casino you and Nanami visited, two semi-grade 1 cursed spirits emerged, leaving the both of you to handle them. The mission was successful, however, the fight turned bloody. Thankfully, there were no fatalities and everybody escaped as the two of you worked together to exorcise the cursed spirits. After handling the mission, the both of you head inside a random hotel room to soothe your wounds. Nanami's dark suit was tainted in blood as well as his face.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>   You leaned against the wall, clutching onto the side of your stomach. Your chest heaved rhythmically, up and down, where the thumping beat of your heart rushed in your head. It took awhile for the pain to finally subside, stabilizing your body and gaining your physical energy back. Your gaze drifts to Nanami across from you trying to catch his breath. His blonde hair fell over his eyes as he faced the ground, gripping onto his biceps.</p>\n<p> </p>\n<p>   \"You alright?\" you asked.</p>\n<p> </p>\n<p>   Nanami rubs the back of his neck and sighed. \"Nothing major. You?\"</p>\n<p> </p>\n<p>   \"Nah. . . I'm fine.\"</p>\n<p> </p>\n<p>   You throw your head back onto the wall and folded your arms. Nanami has been your partner at Jujutsu Tech for awhile, working hand in hand during missions as successful grade 1 sorcerers. The relationship between you and him have been kept strictly professional under the working environment. However, the other day, Gojo confronted you about something he noticed about him.</p>\n<p> </p>\n<p>   \"<em>I've seen the way he looks at you</em>,\" he smirked. \"<em>Damn. If only somebody like him looked at me the way he looks at you</em>.\"</p>\n<p> </p>\n<p>   \"<em>Huh?</em>\" you frowned.</p>\n<p> </p>\n<p>   \"<em>Oh don't play dumb now— even Itadori and the others noticed! You and Nanami working together but sadly can't admit your feelings because of the strict policies from the higher-ups. That's tragic</em>. . .\"</p>\n<p> </p>\n<p>   You refrain from your thoughts after hearing the flick of a match nearby. Your gaze falls on Nanami again, who was lighting up a cigarette perched on his lips. One hand fumbled in his pockets, the other holding the cigarette between his fingers.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>   You watched him inhale that grey stench, studying his sharp features flourishing with his blood. \"Really? Inside the hotel room?\"</p>\n<p> </p>\n<p>   The wisps of the smoke he exhaled twirled to a silver-blue. \"I'm upset,\" he replies.</p>\n<p> </p>\n<p>   \"Hm? Why's that?\"</p>\n<p> </p>\n<p>   Nanami eyes attach onto yours, the tension of gazing into his dark eyes sent your body into ice. He clutched his fist, holding onto the silk red tie he wrapped around his knuckles from earlier. On that same wrist revealed his expensive watch.</p>\n<p> </p>\n<p>   \"We had to go overtime for this shit,\" he sighed. \"You should already know by now I hate that.\"</p>\n<p> </p>\n<p>    \"Well damn,\" you scoffed, standing up straight from the wall. \"I wasn't even paying attention to the time.\"</p>\n<p> </p>\n<p>   Blood was soaking onto your sleeves from the large cut on your arm. \"Not surprised,\" he said, watching the fabrics of your blouse seeping into a dark red. \"You know you're still bleeding, right?\"</p>\n<p> </p>\n<p>   \"Oh I know that,\" you roll your eyes as you checked your arm. \"You're still bleeding too. After being injured you decide to smoke?\"</p>\n<p> </p>\n<p>   \"Yeah,\" he answered bluntly. \"Too lazy to walk to the balcony outside.\"</p>\n<p> </p>\n<p>   You push yourself off the wall, drawing near to him with a half smile. Slick blood dribbled from the sharp cut on his cheek, unbothered to even clean it off. No matter how rough he looks, you always found him attractive from the depth of his eyes to the gentle expressions he gives. Being covered in blood while smoking a cigarette has never looked this sexy to you.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   N</span>anami's eyes suddenly slide over to you. There has never been a single person in existence like you that elevated confidence and deviousness into a form of art as a Jujutsu sorcerer. It intrigues him every time he watches you, scheming intellectual plans and possessing brilliant skills during missions.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>   He clenches his jaw, the muscles of his cheekbones tightening like he had a bunch of thoughts. Thoughts specifically about you. It drove him crazy; that push and pull feeling of longing to be near you, to finally have you. The pure torture of never admitting his feelings infused with his boost of cursed energy from going overtime earlier. It was like an adrenaline rush assorting with stress.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>   He felt frustrated.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>   You sigh down at the ground. \"What should we do in the meantime?\"</p>\n<p> </p>\n<p>   Nanami walked over to the wooden counter, smudging the fiery tip of the cigarette into the ashtray to burn it out. \"Not sure,\" he replies calmly, slowly slipping his blazer off.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>   \"Maybe we should rest,\" you insisted. You leaned against the wall again where Nanami stood nearby and sighed.</p>\n<p> </p>\n<p>  Silence fills the atmosphere. Everything felt too intense to make a move. Nanami hesitated for a bit, wondering his eyes among the dimmed hotel room and back to you. Your eyes were shut as you breathed quietly in a relaxed state.</p>\n<p> </p>\n<p>   There grew those erratic thoughts again. The sight of you covered in splattered blood crawls under Nanami's skin as he stood before you. His expression feigned to nonchalance as he continued to trace over your figure, flawless and gleaming. In his life of robbed youth, Nanami has never felt this way about someone. A mixture of lust and intimacy, also known as his condemned desire.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>   <em>She's beautiful</em>, he thought to himself. <em>Always has been. And will always be.</em></p>\n<p> </p>\n<p>   \"Hey,\" he mutters under his breath, inching closer to your face.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>   \"Yes—?\"</p>\n<p> </p>\n<p>   Before you could fully open your eyes, you feel Nanami's lips clash onto yours. You didn't<span class=\"Apple-converted-space\">  </span>protest. You didn't want him to stop. Your body fueled with heat, enough to excite you. You gladly continue the kiss, rewarding him with a slight moan as he enters your mouth with his tongue.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>   After pulling away for a moment, your face was filled with astonishment. \"Oh my,\" you swooned, your voice honeyed with seduction. \"I thought you wanted to keep things professional between us, Nanami. . .\"</p>\n<p> </p>\n<p>   \"Fuck that,\" he grumbled under his breath, unwrapping the silk tie from his knuckles.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>  \"You know, I've always wondered how you'd be in bed during overtime. It's a weird confession, but. . . it's worth asking right now,\" you chuckled.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>   Nanami's lips curled to a sly smirk, his body pressed against yours. \"You've been waiting for this moment, huh.\"</p>\n<p> </p>\n<p>   \"Maybe. . .\" your face inches closer to his with the right look of heat in your eyes. \"And what about you, hm?\"</p>\n<p> </p>\n<p>   \"Oh trust me,\" he muttered against your ear. \"You'll just have to wait and see.\"</p>\n<p> </p>\n<p>   \"What if I wanna see it now?\" you provoked, smirking.</p>\n<p> </p>\n<p>   \"You better be careful what you're asking for.\"</p>\n<p> </p>\n<p>   He swiftly takes your wrists, bounding them together above your head with just his right hand. Your mouths indulge with devouring kisses, laced with a tiny bit of your blood. You were lost in his devouring, intoxicating kisses, hauling for breaths every few seconds.</p>\n<p> </p>\n<p>   Nanami grabs onto your blouse, forcing the buttons open to your breasts. He releases your wrists, this time setting it behind your back. He takes his silk red tie and tied your hands together.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>You were completely stunned by his movements. It made you grin widely, wanting to push onto his radiating dominant side and frustrate him more. Nanami immediately sensed your arousal. He forced his knee between your legs and held your chin up to him.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>\"Before I proceed,\" he mutters, \"what are your limits? Tell me now.\"</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>\"The whole point of this was to go beyond <em>your</em> limit,\" you teased. \"Therefore, I don't have any right now. I want you to go all out on me tonight.\"</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>\"You dirty fucking girl,\" Nanami smirked.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>\"This is also because I screwed with your money on purpose back at the casino. Just letting you know to piss you off even more.\"</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>You gasped as Nanami grabbed a fistful of your hair, sending a ravenous sensation burning in your body. He leaned against your ears, undoing his own belt on his other hand.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>\"My money is not the only thing getting screwed tonight, sweetheart,\" he whispers. \"Get on your fucking knees for me.\"</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>You obeyed and lowered your subtly trembling body between Nanami's legs, craving for his taste. You gladly open your mouth as you allow him to slide his wide length down your throat.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>Nanami's leather belt was clutched in his hands. He took one end and slid it across your neck, gripping tightly onto both ends as if they were reins. He hauled your head back and forth on his cock and thrusted his hips from a slow to rough pace. Grunts of pleasure slip out his mouth.</p>\n<p> </p>\n<p>   After pushing your head down with the belt, he pulled away allowing you to catch your breath. You coughed, your tongue sticking out with Nanami's precum that dripped down your chin.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>   \"Does that feel good? You want more?\" he teases, rubbing his cock on your lips.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>   You nodded, etched in fiery desire. \"Yes. . . please. . .\" you mumbled, your mouth too exhausted to speak the right words.</p>\n<p> </p>\n<p>   Nanami thrusted ruthlessly in your mouth. You savored his cock with your warm tongue, rolling your eyes back as he slammed the back of your throat. His grunts get shorter, rougher, more demanding.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>He loved seeing you choke on his cock. He loved seeing you submissive towards him. He loved the lewd sounds mashed in with your moans. After several rounds of harshly slamming his cock in your throat, you grew into a haze. He released the last time, allowing you to gasp desperately for air. Long trails of his slick cum and your drool hang off your mouth and your chin.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>“Such a perfect little slut,” he teased. “You look so helpless.”</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>You couldn’t reply, for you were trying to catch your breath. Your eyelids felt heavy and your thighs trembled. Nanami felt that overbearing sadistic feeling wash over him— the sight of you embracing your inner whore, your real form to him during work.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>And you looked good as hell doing it, especially draped in the blood that has already dried out on your skin and clothes by now.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>“What happened? Not talking to me anymore?”</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>“N— Nanami. . .” you uttered weakly.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>He squats down in front of you, placing another kiss on your lips. It was a sweet kiss this time, almost an expression of gratitude. He then helps you stand up in front of him this time and face the bed.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>Nanami pulls your skirt down and grabbed your throat from behind. He held around you, roaming his hands to your leaking clit. You spread your legs for him on purpose, grinding against his cock that earned a tighter grip from him on your neck.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>“You want this cock in you already?” he coaxed as he rubbed his fingers against your glistening folds. “God, just look at how soaked you are right now.”</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>Moans slip through your mouth as a mindless response, too busy feeling his digits flicker incredibly in your silk walls. “Fuck!” you cried out. “Yes! I want your— <em>oh, my god!</em>”</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>Your head arches to Nanami’s shoulder as you continue to writhe in the overstimulation. It amused him with how your body reacted to his slick fingers, where every ounce of desire for him became lucid through your body language. It was like he had the power to ruin you completely.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>He granted your wish, shoving your head down on the bed with your ass sticking out for him. Your wrists were still bound behind you as well. Before you could even cum on his fingers, Nanami teased your folds again but with his cock.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>“Such a dirty little whore you are,” he smirked, slowly stroking himself. “Beg for my cock, [Y/N]. Beg for it.”<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>“I want. . .” you sighed out. “I want your cock inside me. . .”</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>“Again.”</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>“<em>I want your cock inside me, Nanami</em>. . .”</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>At that moment your persistence was gone. Nanami gladly slid in, penetrating your folds. Hands clutching onto your hips, he slammed himself against your ass, making him throw his head back and grunt.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>You let out high-pitched little shrieks combined with the heat of your breath puffing desperately as Nanami probed inside you. The exquisite torture of every inch of him made your heart race. His control snapped, leaving you vulnerable before him.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">  </span>Moments later, after switching positions to missionary, your hips stutter at the sensation of his throbbing cock. Your wrists were still bound, this time above your head.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>It was nice enough of him to provide a pillow in support of your back. The loud squelching of your body echoes in Nanami’s ears. His eyes gaze down at your naked body, where cuts and dried blood tinted your skin.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>You grinned at him again, feeling satisfied of his cock coveting your throbbing walls recklessly. Nanami’s hand travels from your thighs to your face, painting your body with fresh blood like a stream. You suck on his thumb as you stared into his eyes.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">  </span>Your body has been used to capacity. Your vision slurred. Your face and body reddened, almost twitching from every bit of Nanami’s touches. He has never seen such a beautiful sight of wrecking you to the maximum.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>He slowed down to a satisfactory stop, looking at your exhausted body covered in drool, sweat, and the crimson marks. You lost the feeling in your legs and your shivering body, almost sending you to black out. Your thoughts and words muddled, leaving only the pure thought of his ravishing cock violating your guts like hell.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>Nanami sits on the bed beside you, realizing you already passed out. “How cute,” he smiled, gently untying his tie off your wrists.</p>\n<p> </p>\n<p><span class=\"Apple-converted-space\">   </span>The next thing you knew, you were asleep next to Nanami, your arm draped around his waist. His hands settle at the base of your spine, pulling you closer.</p>\n<p> </p>\n<p>——————————</p>\n<p> </p>\n<p>\n<strong>BONUS SCENE LMFAOO</strong>\n</p>\n<p> </p>\n<p dir=\"ltr\">   “What the hell is taking Nanami and [Y/N] so long?” Ijichi complained. “They already took care of the cursed spirit, where could they possibly be? They’re not answering their phones!”</p>\n<p> </p>\n<p>   “I’ll go find them,” said Gojo. “Maybe they’re at the connecting hotel hiding somewhere.”</p>\n<p> </p>\n<p>   As Gojo left the car, he smirked down at the ground, trying to hide his laughter in.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>  <em>If I’m right, Itadori owes me 50</em>, he thought to himself.</p>\n<p> </p>\n<p>   Since all hotel guests and visitors evacuated, there was one door that was locked on the third floor. As he was about to knock, his eyes widened at certain sounds coming from inside.</p>\n<p> </p>\n<p>   Gojo stood outside the door, smiling widely in horror. His body froze after hearing the gushing sounds of somebody giving head. He was mortified.</p>\n<p>\n<em> </em>\n</p>\n<p><em>  Holy fucking shit!</em> he scoffed, grinning widely. <em>[Y/N], you lucky bitch!</em></p>\n<p> </p>\n<p>   He leaned his ear against the door, remaining as quiet as be can be without wheezing. As he heard the lewd sounds and moans of pleasure, Gojo couldn’t stop smiling.</p>\n<p> </p>\n<p>   <em>Damn, I wish that was me as fuck right now. I fucking wish that was me. She’s giving that gawk gawk 3000! Lucky ass bitch.</em></p>\n<p> </p>\n<p>   Gojo backed away from the door and retreated to the lobby, far away as possible to call Ijichi. “Hey. Nanami and [Y/N] left on their own. They’re fine now. Don’t worry about them.”</p>\n<p> </p>\n<p>   “Oh thank goodness,” Ijichi replied in relief. “Got me stressing over nothing.”</p>\n<p> </p>\n<p>   Gojo ends the call and sighed down at the floor. <em>Itadori owes me big time,</em> he smirked.</p>\n<p> </p>\n<p> </p>\n<p>\n<em>\"Happy birthday, sweetheart.\" </em>\n</p>\n<p>Nanami's words were the first thing you heard before you woke up from your afternoon nap. You rubbed your eyes and searched the room for the presence of a tall man in blond hair. Sadly, he was nowhere to be seen. All that was left was an elegant box-shaped gift nearby.</p>\n<p><em>Ooh</em>, you mused at the gift. It was one of those fancy boxes that open magnetically when you lift the latch, which was tied back with silk ribbon. Your curiosity fed onto you, and since it was your birthday, there was no harm in opening it. You sit on your legs and untied the fine ribbon, then proceeded to open the latch of the sleek plastic box. You were greeted with peach-colored tissue paper draped over something black. You unfold it, revealing the lace of a black lingerie set that made your eyes glitter. You clamp over your mouth as your face lit up from excitement and appreciation.</p>\n<p><em>It's so fucking pretty,</em> you thought as you held it out in front of you.<em> Does Nanami want me to wear this for him?</em></p>\n<p>A moment later, after you slipped off your clothes and tried on Nanami's gift, you couldn't help but take pictures of yourself in the mirror. The sheer black thigh highs with adjustable garters straps hooked on, the strappy detailing, the way how the sheer fine lace complements the curves of your body— it was a provocative, yet stunning set. And it was just your size.</p>\n<p>You take one last picture of yourself in the mirror and grinned. It's fascinating how Nanami paid attention to everything about you and decided to spoil you like this. He never failed to surprise you.</p>\n<p>Meanwhile, Nanami was downstairs on his laptop at the kitchen table, not wanting to disturb your beauty sleep. Today was a special day for meant for you only, but unfortunately he was working. He multi-tasked and searched for places to visit just for the two of you.</p>\n<p>Suddenly the doorbell rang. Nanami grunted and dragged himself out of the chair to walk to the door. The moment he opened it, he was greeted by two familiar faces. He scrunched his face in confusion as confetti was thrown into his hair.</p>\n<p>\"Happy birthday!\" Gojo exclaimed, his arm wrapped around his best friend Getou. When they both opened their eyes from grinning widely, their mouths drop open in bewilderment.</p>\n<p>\"Oh shit,\" Getou uttered. Both of their bodies were completely frozen at the doorway. \"You're not—\"</p>\n<p>\"I told you to wait for me,\" said another irritated voice approaching the door. \"Now you wasted the confetti.\"</p>\n<p>\"Choso? You actually came!\" Gojo exulted, turning his head back at a man with two messy buns tied back wearing a leather jacket, cuffed jeans, and Doc Martens.</p>\n<p>\"What the hell are you guys doing here?\" Nanami asked bluntly, folding his arms nonchalantly.</p>\n<p>\"Did you seriously forget? We're here because it's your girl's birthday today! Have you checked the group chat?\" Gojo bickered, adjusting his round sunglasses.</p>\n<p>\"Groupchat? Oh, the one that you constantly spammed in?\" Nanami recalled.</p>\n<p>\"Yeah, that one,\" Getou sighed. \"Did you mute it? I don't blame you if you did, but you should've at least known we were coming over today.\"</p>\n<p>Nanami opens his phone, turning off the <em> do not disturb </em> option. \"Sorry guys. I've been working.\"</p>\n<p>\"Of course you were,\" Gojo groaned, rolling his eyes. \"You were in charge of inviting the female guests that she was close to since you have their info. Now she's stuck celebrating it with a small group of men.\"</p>\n<p>\"I mean, that's not bad,\" Choso shrugged. \"She can still celebrate with all of us since we're close with her. I don't see the problem.\"</p>\n<p>\"You're right,\" Getou reassures. \"How about we throw a surprise party for her here.”</p>\n<p>\"Good idea!\" Gojo exclaimed bubbly. \"Nanami, is it okay for us to do that for her? You can join us if you'd like.\"</p>\n<p>Nanami stared down at the ground and sighed. He'd feel bad if he declined the offer. The sudden dedication of making your birthday extra special sparked a little bit of hope inside. Maybe he can make it up to you with the help of Getou, Gojo, and Choso.</p>\n<p>\"<em>The hell are y'all doing here?\"</em> another approaching voice said, this time more gravelly and husky.</p>\n<p>\n<span>\"Toji?\" Nanami rose a brow. \"I thought you were coming in tomorrow.\"</span>\n</p>\n<p>\n<span>Everyone turned around at a tall, buff man with dark hair and a scar at the edge of his lips. Toji gave a small smile as he stood behind Choso with his hands in the pockets of his oversized sweater. \"Change of schedule and I lost my phone. I couldn't reach you so I had to pass by. What's going on?\"</span>\n</p>\n<p>\n<span>\"Surprise birthday party,\" Choso replied.</span>\n</p>\n<p>\n<span>\"Oh, how fun. It's your girl's birthday today, correct?\"</span>\n</p>\n<p>\n<span>\"All of you. . . just come inside,\" Nanami sighed.</span>\n</p>\n<p>\n<span>\"Finally! We've been standing out here for so fucking long,\" Gojo exasperated, leading the crowd of men inside the house where Nanami shut the door behind.</span>\n</p>\n<p>\n<span>\"So. Tell me the plan.\"</span>\n</p>\n<p>\n<span>As you were getting ready from refreshing yourself after your nap, you overheard some low voices from downstairs. After a moment, the voices parted and it was dead silent. You glanced at your closet for a cardigan, dragging it from the hangar and throwing it on as you leave the room.</span>\n</p>\n<p>\n<span>You feel the chill in your blood surge as you crept down the stairs. The cold and tense silence made your heart almost falter when you reached the living room. The lights were off, but the sunlight peeling through the closed wooden blinds were enough to tell you that Nanami was nowhere to be found.</span>\n</p>\n<p>\n<span>\"Nanami?\" you muttered softly, eyes wondering for his figure.</span>\n</p>\n<p>\n<span>Right as you approach the center of the living room where the couches were, the lights suddenly turned on. Your body froze as you feel a pair of hands drape on your shoulders from behind, bringing the synapses of your brain completely still. Three familiar men popped out from behind the couch. Another man popped out from behind the pillar.</span>\n</p>\n<p>\n<span>\"<em>Surprise! Happy birthd—</em>\"</span>\n</p>\n<p>\n<span>The moment their eyes landed on you and your attire, they were at a loss of words. Your jaw slacked open as you couldn't find a way to process everything going on. It made your face burn, grinning in embarrassment. It didn't take long for them to realize as well.</span>\n</p>\n<p>\n<em>\n<span>This cannot be real</span>\n</em>\n<span>, you panicked inside. </span>\n<em>\n<span>No fucking way this is happening right now.</span>\n</em>\n</p>\n<p>\n<span>A man with white hair and round sunglasses that you recognized as Gojo stood up and cleared his throat obnoxiously. \"Well, </span>\n<em>\n<span>damn</span>\n</em>\n<span>.\"</span>\n</p>\n<p>\n<span>You turned around, noticing Nanami was the one that held onto your shoulders. \"What— what's going on?\" you asked, the palms of your hand beginning to feel clammy.</span>\n</p>\n<p>\n<span>Nanami's eyes grew wide and held his breath as you face him. You feel his eyes tracing up and down at the lingerie set you were wearing and your bare skin that easily fed into his feral desires.</span>\n</p>\n<p>\n<span>\"Talk about a surprise,\" said a dark haired man with an oversized sweater who you recall as Toji. He walked towards you two with his hands in his pockets and gave a sly smirk.</span>\n</p>\n<p>\n<span>\"Right?” Nanami mused, gazing down at your body. His husky, warm voice gave an inviting tone that made your spine almost shiver.</span>\n</p>\n<p>\n<span>The rest of the men circled around you. You feel the beat of your heart pound rapidly as if there was no way to escape this. You inhaled deeply and breathed out calmly. \"You guys all planned a surprise birthday party for me?\"</span>\n</p>\n<p>\n<span>\"Well, it was mainly me,\" said Gojo, narrowing his eyes at you as if he wanted to see more of what was under that lingerie set. \"We just weren't expecting you to come in looking like </span>\n<em>\n<span>that</span>\n</em>\n<span>. . </span>\n<em>\n<span>.</span>\n</em>\n<span>\"</span>\n</p>\n<p>\n<span>\"And this was </span>\n<em>\n<span>my</span>\n</em>\n<span> gift for you,\" Nanami smirked, his hands tracing onto your waist. \"You look stunning in that, don't you guys agree?\"</span>\n</p>\n<p>\n<span>\"Oh yeah,\" a man with two messy buns tied back mused, who you remember as Choso. He loved the tincture of laced lingerie on anyone, almost like a potion of provocation that aroused his fantasies.</span>\n</p>\n<p>\n<span>\"She does, huh.\" Another man with dark hair tied to a singular bun teased, known as Getou. It completely caught him off guard when he saw your enticing attire, especially when you weren't expecting guests to arrive at your house.</span>\n</p>\n<p>\n<span>You were caught in the overwhelming moment. It entertained you inside; that feeling of being the center of attention within a group. Especially a group of </span>\n<em>\n<span>men</span>\n</em>\n<span>. It made you almost feel heated down there, feeling Nanami's hands roaming from behind and shutting your eyes as he pulled off your cardigan for the rest of the men to see.</span>\n</p>\n<p>\n<span>He grabs your chin, seeing your face in pure bliss from the arousing atmosphere that made him smirk. \"Like the idea of my friends seeing your body? You like having all the attention on you?\"</span>\n</p>\n<p>\n<span>You reply with a subtle nod, too bashful to admit but at the same time you've been </span>\n<em>\n<span>dreaming</span>\n</em>\n<span> of a fantasy like this to occur at least once in your life.</span>\n</p>\n<p>\n<span>\"Well today's a special day for you, birthday girl. We're gonna give you </span>\n<em>\n<span>exactly </span>\n</em>\n<span>what you want.\"</span>\n</p>\n<p>\n<span>Before you know it, you faltered down onto your knees, watching the men take off jackets and shirts and undo the zippers of their pants. Nanami closes in on you first with his cock, where you gladly allow him to slide in your throat. You raised both of your hands up, finding the grip of two more travel through your palms. Not too tight, not too loose, but enough to not make the men feel uncomfortable.</span>\n</p>\n<p>\n<span>All eyes were on you as they switched positions of who's taking your throat and who's receiving the hand jobs. You find yourself staring up into Gojo with half lidded eyes, gliding up and down with your warm tongue. Soft groans reverberated through your ears from the others.</span>\n</p>\n<p>\n<span>\"Wow, who knew the birthday girl could be such a cute little slut,\" Gojo teases, followed by Getou and Toji chuckling.</span>\n</p>\n<p>\n<span>The circle separates when Nanami kneels down, traveling his hands to your wet slit that made him grin in satisfaction. He pulled aside your laced panties and let his thick fingers delve in your walls. You feel it curling inside as he began to fill your sweet cunt with his thrusts.</span>\n</p>\n<p>\n<span>\"Oh— <em>fuck</em></span>\n<span><em>!</em>\" Your moan gets cut off when Choso slid into your mouth this time, rocking his hips and allowing Nanami to grab a fistful of your hair while playing with your cunt. The overstimulation made you feel completely helpless under their touch.</span>\n</p>\n<p>\n<span>Nanami feels your walls clench around his fingers. The group of men watch thoroughly of your blissful reactions, how you barely got a chance to breathe before taking a new cock in your mouth and pumping your hands.</span>\n</p>\n<p>\n<span>\"Gonna. . . gonna cum,\" you panted.</span>\n</p>\n<p>\n<span>Nanami shook your head on purpose from his tight grip pulling on your scalp, waking you up. \"Then cum. Cum as many times as you want today.\"</span>\n</p>\n<p>\n<span>You were brought to your orgasm immediately, the moans that slipped through your mouth made Toji's cock twitch in your mouth. He pulled away, letting you gasp for air again. \"You look pretty, birthday whore. Cumming on Kento's fingers like that.\"</span>\n</p>\n<p>\n<span>\"Get her on the couch,\" said Gojo.</span>\n</p>\n<p>\n<span>Getou takes your hazy body, setting you on your side where he entered slowly. Gojo angled his hips to your mouth, biting his bottom lip as your throat delves into his cock again.</span>\n</p>\n<p>\n<span>\"Fuck,\" Getou grunted, slapping your ass. \"This feels good, am I right, birthday slut?\"</span>\n</p>\n<p>\n<span>You moan on Gojo's cock as a reply, the hot skin from your mouth engulfing him traveling in and out your throat. \"Fuck yeah she feels good,\" he praised. \"You take cock so good. Nanami is for sure of that.\"</span>\n</p>\n<p>\n<span>All the praises you received so far felt tantalizing. It broke your brain completely, where all you could think of was being filled and overstimulated, making your body feel hot and end up dampening yourself.</span>\n</p>\n<p>\n<em>\n<span>Cock. . . cock. . . so much fucking cock, </span>\n</em>\n<span>you echoed in your head.</span>\n</p>\n<p>\n<span>Getou pulled out, taking his hands to encircle your dampened cunt allowing you to cum. Whimpers and shrieks were echoing through the living room walls as you approached an orgasm for the second time. Your thighs began to tremble. However, you knew you were far from done. There's still a long line of men waiting to fill you.</span>\n</p>\n<p>\n<span>Gojo laid on the couch this time, taking your hips and setting your pussy down slowly on his cock. The both of you grunt, eyes filled with desire as your walls clamped around him. You press onto his bare chest, feeling him thrusting at the sensational spots.</span>\n</p>\n<p>\n<span>Suddenly, Getou brushed his cock around your ass, immediately arousing you. This was a situation you were slightly terrified of— taking </span>\n<em>\n<span>two </span>\n</em>\n<span>cocks at the same time. Would it hurt? No, you've been fucked in the ass before, but would the embrace of </span>\n<em>\n<span>two </span>\n</em>\n<span>cocks inside you sting?</span>\n</p>\n<p>\n<span>Getou proceeded to slide in, holding onto breasts as you yelped from the shiver of pleasure. The two men gradually rocked harder, ramming your walls that sent you clenching down on both of them. Before you know it, Nanami took your head to face him again, while the other two, Choso and Toji, were in reach with your hands.</span>\n</p>\n<p>\n<em>\n<span>Oh my god, so much fucking cock. It feels so fucking good.</span>\n</em>\n</p>\n<p>\n<span>As you were pushed over the edge, your orgasm hitting onto you, Nanami pulls away to hold your chin up and stared at your ecstatic expression. Watching you getting fucked by someone else was something he never expected to turn him on. Perhaps it's time he revealed his cuckolding kink.</span>\n</p>\n<p>\n<span>You throw your head back as you came on Gojo's and Getou's cock, feeling yourself began to pulsate. \"Wow,\" Nanami whispered as he watched, pulling you to a heated kiss. \"You're an absolute mess right now, darling.\"</span>\n</p>\n<p>\n<span>The two of them leave you laying on the couch, almost drenched in sweat. Before you know it, Toji stood in front of you, robbing you of breath. His ripped, buff body was enough to make your nerves tremble at his presence.</span>\n</p>\n<p>\n<span>Your head was hung out at the edge of the couch. His cock right in your face, urging you to stick your tongue out for him and take his length as deep as possible.</span>\n</p>\n<p>\n<span>\"Enjoying your birthday so far?\" he smirked. \"You still want more?\"</span>\n</p>\n<p>\n<span>You nodded, desperate breaths and wheezes puff out your mouth. Toji granted your desire, sliding his entire, thick length that bulged through your throat. He plunged his cock at a slow rhythm, holding onto your head as the protruding print on the outside of your throat turned him on.</span>\n</p>\n<p>\n<span>\"Fuck, that's so cool,\" he grunted, eyes never leaving your throat. \"You take cock very well. Need a whore like you someday— </span>\n<em>\n<span>fuck</span>\n</em>\n<span>.\"</span>\n</p>\n<p>\n<span>Hot tears streamed from your eyes as you nearly suffocated. He slid out before he could come, pulling you to your feet this time where your back was against his chest. \"You're smaller than me. It won't be a struggle to carry you.\"</span>\n</p>\n<p>\n<span>\"Carry. . . me. . .?\" you mumbled weakly, sniffling.</span>\n</p>\n<p>\n<span>You were caught off guard as Toji slithers to your thighs and lifted your legs up including your whole body. He feels you shake uncontrollably when your glistening folds meet the tip of his huge dick. Toji uses his hands to maneuver your body slowly as you take in his mind blowing size.</span>\n</p>\n<p>\n<span>\"Fuck!\" you cried out, throwing your head back on his shoulders. Choso took the opportunity of your available pussy to insert himself inside you, once again welcomed by the tormenting overstimulation.</span>\n</p>\n<p>\n<span>You were sandwiched between the two dark haired men, filling your holes and stuffing you harshly. Your forehead was pressed against Choso's as Toji bit onto the back of your neck, softly groaning.</span>\n</p>\n<p>\n<span>\"God, you're fucking good,\" Toji groaned. \"Who's birthday is it again? Because it feels like mine.\"</span>\n</p>\n<p>\n<span>\"You look so good in this,\" complemented Choso as he traced his hands over the lace of your lingerie set. \"I wish you the best birthday, sweetheart.\"</span>\n</p>\n<p>\n<span>\"Th— thank you,\" you uttered. \"Fuck, oh my god. . . I'm gonna cum again. . .\"</span>\n</p>\n<p>\n<span>\"Fucking cum,\" ordered Toji. \"This will be our present for you.\"</span>\n</p>\n<p>\n<span>You clench your teeth, furrowing your eyebrows as your cunt pulsed recklessly from another orgasm that sent you shaking again. \"All yours now Kento,\" says Choso as he dropped your fatigued, worn out body on the couch again.</span>\n</p>\n<p>\n<span>You were brought to your knees, your back pressed against Nanami as he slipped into your pussy again. You gave a shambled reaction from the torture of pleasure and pain that your cunt felt again. Barely enough time to let you rest. \"Almost done, sweetheart,\" says Nanami as he kisses you sloppily.</span>\n</p>\n<p>\n<span>He pulled your arms back as his cock plunged in your worn out, used cunt. You lost the feeling of stability in your entire body, only the sensation of </span>\n<em>\n<span>cock</span>\n</em>\n<span>. It broke your mind. That was what you craved for. It was pure euphoria, rapturing you in a burning enticement that you were bound in.</span>\n</p>\n<p>\n<span>Nanami releases your arms and grabs onto the hair from your scalp. You bite onto the pillows of the couch, your body rocking back and forth on him and moistening the pillow with your drool. You started twitching at some places.</span>\n</p>\n<p>\n<span>You enjoyed it. You enjoyed it all. The mind-wrecking, the overstimulation, the praises and subtle degrading that was inflicted on your birthday. Like always, Nanami never failed to surprise you. Spoiling you was what he did best— whether it'd be gifts, money, showers of love, or the hot nights where he'd come home from work stressed and needed to relieve it.</span>\n</p>\n<p>\n<span>After awhile, your body laid back on the couch where Nanami penetrated your cunt deeply from the access of your spread out legs. There was something about how the garter of your sheer thigh highs gripping tightly onto your thighs aroused him. From there, he filled you with his warm cum, watching the thick liquid dribble down your folds and leaking to the couch. It was a lot to make you feel full.</span>\n</p>\n<p>\n<span>You couldn't remember much after that right when you passed out.</span>\n</p>\n<p> </p>\n<p> </p>\n<p>   \"You've played pool before, right?\"</p>\n<p> </p>\n<p>   Your gaze falls on the male with blonde parted hair, attached to his movements as he chalked the tip of the wooden cue with a tiny cube. The sleeves of his blue dress shirt rolled up, the buttons halfway undone— his physique, overall, was just so prominent to you.<br>\n<br>\n</p>\n<p> </p>\n<p>   \"Yeah, a few times,\" you lied. You knew the rules and how to strike the cue ball to score a pocket, but it was only once in a lifetime you ever played.<br>\n<br>\n</p>\n<p> </p>\n<p>   You approach the end of the billiards table where the cue ball stood across from you on the baulk line. Nestled in the triangular ball rack were the multicolored stripes and solids a few inches away, the apex aligned with the cue ball.<br>\n<br>\n</p>\n<p> </p>\n<p>   As you stared into the green velvet, a sudden memory from awhile back clicked in your brain. \"Remember when you used to send me iMessage games when you got bored at work?\"<br>\n<br>\n</p>\n<p> </p>\n<p>    \"Oh yeah,\" Nanami's expression turns soft from recalling it, adjusting his glasses. \"I'd always win.\"<br>\n<br>\n</p>\n<p> </p>\n<p>   \"Nah, that's a lie,\" you teased. \"<em>I'm</em> the one that always won. Especially on 8 ball.\"<br>\n<br>\n</p>\n<p> </p>\n<p>   \"Hm. If you say so,\" he scoffed, walking back to your side. \"Maybe we can test that theory out by playing one round.\"<br>\n<br>\n</p>\n<p> </p>\n<p>   \"Alright. Should we make a bet to spice things up?\"<br>\n<br>\n</p>\n<p> </p>\n<p>   \"Wasn't exactly thinking of a bet,\" he says as he rubbed his chin. \"But we could spice things up by turning it into a drinking game.\"<br>\n<br>\n</p>\n<p> </p>\n<p>   \"Ooh.\" You ruminated on Nanami's idea, the thought of it alone giving you a thrill. \"I'd like that.\"<br>\n<br>\n</p>\n<p> </p>\n<p>   \"Sounds good. Shall we play, then?\"<br>\n<br>\n</p>\n<p> </p>\n<p>   Your lips curl to a smirk of approval, grabbing your cue that stood against the table and chalked it. You were alone with him in this secluded billiards room and bar. The tension in the air was so brittle. Whatever move you made, whatever comes out your lips, he'd be the only one to witness it.<br>\n<br>\n</p>\n<p> </p>\n<p>   Nanami stood on the opposite end to slip off the ball rack, gesturing for you to break. You pursed your lips, the cue sliding between your index finger and the knuckles of your middle finger from your non-dominant hand. With the thick end of the cue gripped comfortably in your dominant hand, you lowered yourself down, narrowing your eyes at the cue ball.<br>\n<br>\n</p>\n<p> </p>\n<p>   The male's hands stood in his pockets impassively, drawing his eyes onto you in your concentrated state. You were bent over, your back arching, and your self-confidence radiating. His mouth twists to a small smirk in amusement.</p>\n<p> </p>\n<p><br>\n   As your cue's approach to the cue ball accelerated gradually, the stroke felt comfortable enough for you to finally strike. You collected great momentum and proceeded to hit it, watching it thrash with the nestled balls that scattered on the baize. The satisfying clacks and clinks from the phenolic resin material echoed in your brain.<br>\n<br>\n</p>\n<p> </p>\n<p>   Nanami's eyebrows rose, impressed of your breaking as an amateur. \"Wow. You got a red solid in the side pocket.\"<br>\n<br>\n</p>\n<p> </p>\n<p>   \"Side pocket, huh,\" you smirked. The triumph in you rose, encouraging you more.<br>\n<br>\n</p>\n<p> </p>\n<p>   Nanami placed two shot glasses on the side rails and poured one ounce of bourbon that he found from the bar in each glass. \"If you miss, you have to take a shot. Whoever gets drunk first is the loser.\"<br>\n<br>\n</p>\n<p> </p>\n<p>   You proceeded around the table where Nanami stood, averting your gaze to the cue ball near a green solid; the closest to a corner pocket. You maintained the angle you estimated, finding yourself slowly bending over in front of him.<br>\n<br>\n</p>\n<p> </p>\n<p>   You held in your laughter, trying not to give him the wrong idea. But truth is, you <em>wanted</em> him to think what you were thinking. You <em>wanted </em>him to feel how you're feeling in this very moment. He was mere inches away from you; being so close with him sent the blood in your body ablaze and he hasn't even touched you yet.<br>\n<br>\n</p>\n<p> </p>\n<p>   Your posture attempts to loosen within his aura. You were desperate to find that stride from earlier and be in control again, but you easily give in.<br>\n<br>\n</p>\n<p> </p>\n<p>   \"I know what you're trying to do,\" he whispers, sliding his hands out of his pockets.<br>\n<br>\n</p>\n<p> </p>\n<p>   \"Oh? I'm just trying to decide my next shot,\" you lied again.</p>\n<p> </p>\n<p><br>\n   \"Then hurry the hell up.\" His expression remained nonchalant, unable to see his eyes from the sheen in his glasses.<br>\n<br>\n</p>\n<p> </p>\n<p>   You sighed in discontent, not really surprised by his impatient, aloof manner. You knew that he didn't really mean it so you shrugged it off. Proceeding with a swift, clean stroke on the cue ball, you watch as the green solid successfully lands in the pocket.<br>\n<br>\n</p>\n<p> </p>\n<p>   After awhile, you managed to get a purple and yellow solid in. It was totally unexpected, especially from how long ago you played. Nanami watches impressively, not only at how well you play, but your form— constantly leaning over the table, stretching your body right in front of him. It was enough to muse him.<br>\n<br>\n</p>\n<p> </p>\n<p>   As you aimed for the blue solid next, you suddenly miss, watching it hit the rims of the pocket but not rolling inside. \"Well shit,\" you muttered, straightening your posture.<br>\n<br>\n</p>\n<p> </p>\n<p>   \"Drink up,\" Nanami smirks, handing over the shot glass.<br>\n<br>\n</p>\n<p> </p>\n<p>   You hold the glass to your lips, arching your neck back as you swallow the strong notes of vanilla, flourishing down your throat. It was sweeter than the other wines you drank, the tastes more flavorful and composite.<br>\n<br>\n</p>\n<p> </p>\n<p>   This time you watch Nanami as he lowered down across the table, targeting the green striped ball. In the blink of an eye, his forceful strike sent the target straight into the corner pocket at a briskly speed. It was impossible to catch a glimpse of that striped ball rolling on the baize. It all felt so quick, so intimidating, so mind blowing.<br>\n<br>\n</p>\n<p> </p>\n<p>   \"Damn,\" you scoffed.<br>\n<br>\n</p>\n<p> </p>\n<p>   \"Sorry. Did that scare you?\" he says, adjusting his glasses again.<br>\n<br>\n</p>\n<p> </p>\n<p>   <em>Yes. That was so fucking hot.</em><br>\n<br>\n</p>\n<p> </p>\n<p><em>   </em>\". . . Nah,\" you replied, setting your shot glass down. \"That looked really cool though.\"<br>\n<br>\n</p>\n<p> </p>\n<p>   He leans across again, hitting the orange stripe. It all went by fast as he constantly wandered to other ends of the billiards table, bending over to aim. You were stunned by how he managed to get four of the target balls but missed the purple stripe.<br>\n<br>\n</p>\n<p> </p>\n<p>   \"Now we're finally even,\" you say.<br>\n<br>\n</p>\n<p> </p>\n<p>   Nanami takes a shot and smirked down at the floor. \"We'll see about that.\"<br>\n<br>\n</p>\n<p> </p>\n<p>   Time passes by. You've got two in, then followed by another miss. Nanami scored two in as well with the 8 ball remaining that he somehow missed. So far, the both of you have taken two shots. As you were down to your last ball, the 8 ball, your mood suddenly relaxes.<br>\n<br>\n</p>\n<p> </p>\n<p>   \"Which pocket are you going for?\" Nanami asks.<br>\n<br>\n</p>\n<p> </p>\n<p>   \"The top right.\" For some reason, you felt a rush of happiness. It was refreshing to experience something delightful like this. But that sudden happiness faded when the cue ball made its way in a pocket after scoring the 8 ball. Your heart dropped and your body sulked in bewilderment.</p>\n<p>  </p>\n<p><br>\n   Nanami inhaled sharply after witnessing your fatal loss, folding his arms. \"Well. . . that sucks.\"<br>\n<br>\n</p>\n<p> </p>\n<p>   You reach over to pour yourself another shot. You were desperate to find that brief happiness you encountered earlier, thinking that the bourbon was already starting to hit. \"I guess this is another round for me,\" you say, eyes starting to squint.<br>\n<br>\n</p>\n<p> </p>\n<p>   Nanami leaned against the table in front of you. \"You don't have to, you know.\"<br>\n<br>\n</p>\n<p> </p>\n<p>   \"<em>But I want to</em>,\" you cooed, slanting your head at him coquettishly. \"Drink with me, Kento. <em>Please?</em>\"<br>\n<br>\n</p>\n<p> </p>\n<p>   He slips off his glasses this time, the sight of finally seeing his remarkable features immersing you to a vulnerable state. He had a strong effect on you, probably stronger than the bourbon, that drove you to the brink. You arch your neck again as you consumed your third round.<br>\n<br>\n</p>\n<p> </p>\n<p>   \"Three shots and you're drunk already?\" Nanami coaxed, captivated by your tipsy behavior. \"Damn. Wish that'd happen to me. I'd save so much money.\"<br>\n<br>\n</p>\n<p> </p>\n<p>   You hoist yourself on the table beside him and swung your legs back and forth off the edge. Everything in your atmosphere became less inclined and more hazy as you were enchanted with sudden confidence.</p>\n<p> </p>\n<p> </p>\n<p>   \"Kento. You look so good,” you complement, your speech beginning to slur. “Has anyone told you that?”<br>\n<br>\n</p>\n<p> </p>\n<p>   Nanami stood up, his bold presence giving a slight tug in your stomach as he draws closer to you. You look at him with heated eyes, lips parted like an invitation. \"Alright. That's enough for you tonight,\" he mutters. \"Give me the bottle.\"<br>\n<br>\n</p>\n<p> </p>\n<p>   \"Aw,\" you pout. \"What if I don't want to give it to you?\"<br>\n<br>\n</p>\n<p> </p>\n<p>   \"Then that would be a very bad choice.\"<br>\n<br>\n</p>\n<p> </p>\n<p>   You feel the heat rising in your cheeks as he inched closer. Nanami's hands made its way to your thighs, making your pulse beat rapidly. It felt so fervent to you, the way how he held onto your body. It was soft and gentle, almost like a sweet caress.<br>\n<br>\n</p>\n<p> </p>\n<p>   \"You don't wanna make bad choices, do you?\" His warm lips were near your jawline from tilting his head, the soft mutters making you shiver. You were unsure if it was the alcohol or Nanami himself sending your nerves shuddering.<br>\n<br>\n</p>\n<p> </p>\n<p>   \"Fine,\" you whispered. \"I'll give it to you. . .\"<br>\n<br>\n</p>\n<p> </p>\n<p>   \". . . if you kiss me.\"<br>\n<br>\n</p>\n<p> </p>\n<p>   Nanami's cold thumb slips on the bottom of your lip, cupping your face. \"Where would you like for me to kiss you?\"<br>\n<br>\n</p>\n<p> </p>\n<p>   \"Here.\" You leaned your lips closer to his face, waiting for him to reply. His expression changes from the gleaming lust in your eyes. He takes your chin to crane it higher, noticing how easily the alcohol consumed you.<br>\n<br>\n</p>\n<p> </p>\n<p>   After dwelling for so long, he loses his patience with you. His lips finally press onto yours, where you can taste the sweetness of the wine. Your body began to vibrate, condensed in the tender moment laced with a rush of positive emotions. It was like the primitive side of your brain was in charge, but it was the worst choice for it to take course of your actions.<br>\n<br>\n</p>\n<p> </p>\n<p>   The kiss turns sloppy. You couldn't think. You utterly lost yourself, falling onto the table and setting the bottle down. Your fingers tangled in Nanami's hair, pressing yourself further to his chest as he hovers above you. He uses his tongue to part your lips, exhaling every few seconds.<br>\n<br>\n</p>\n<p> </p>\n<p>   Nanami tugged on the fabrics of your top. You slip it off, the sudden chill hitting on your skin. \"Can I kiss you here?\" he whispers to your neck this time.<br>\n<br>\n</p>\n<p> </p>\n<p>   \"Yes. . .\"<br>\n<br>\n</p>\n<p> </p>\n<p>   You sway your head back and sighed. His tongue left wet trails to your bare chest this time, the goosebumps tingling on your skin. \"And here?\"<br>\n<br>\n</p>\n<p> </p>\n<p>   \"Yes,\" you say again, this time more desperate.<br>\n<br>\n</p>\n<p> </p>\n<p>   The urgency for him led to slipping off your undergarments in a haste manner. Your clothes puddled on the floor along with Nanami's top. You were astonished by the muscular tones of his body, brushing your fingertips down his abs. He takes your hands, intertwining his fingers with yours.<br>\n<br>\n</p>\n<p> </p>\n<p>   You say his name once again. Caught in the tender moment, face-to-face, skin-to-skin, the lingering looks of temptation. The wine has already intoxicated you and you gladly let it. You've thought about a moment with him like this, especially when sober.<br>\n<br>\n</p>\n<p> </p>\n<p>   You knew you weren't going to regret this.</p>\n<p> </p>\n<p><br>\n   Nanami pins your hands down on the baize, planting another kiss as he slides in. Fingers locked with his, your grip falls tighter on him as if you had nothing else to hold on to. It was a strange, wild feeling to embrace while being drunk.<br>\n<br>\n</p>\n<p> </p>\n<p>   His ears were against your lips, hearing the swelling sighs and faltering moans. Nanami heaves himself, cupping onto your breasts. Your body bounces back and forth on the table, clenching down on his cock. Every thrust made you wail, the series of agonizing screams, profanities and rising vowels slip from your mouth from all the sensitive spots he managed to hit.</p>\n<p> </p>\n<p>  <br>\n   It terrified you, really. How was he able to do that? What's his technique?<br>\n<br>\n</p>\n<p> </p>\n<p>   Nanami pushed himself off your chest, pinning your hands above your head. His eyes focus on everything— from your face, to your breasts, and to your sweet cunt that already had you dripping. Your eyes started fluttering and your forehead glistened with beads of sweat. It's like you were already on edge.<br>\n<br>\n</p>\n<p> </p>\n<p>   The next thing you knew a few moments later, you found yourself leaning over the table again. Your back arched greatly from rocking on his cock for the second time, letting him hold onto your hips. It made your walls quiver, the way he absorbed you completely until you felt your orgasm building again.<br>\n<br>\n</p>\n<p> </p>\n<p>   His movements never slowed and it drove you crazy. Full, hard thrusts, your breasts bouncing, and your legs quavering from every fraction of his cock. Nanami grunts, gripping onto your ass and pounding into you harder that you thought the damn table was going to shamble— just like you.<br>\n<br>\n</p>\n<p> </p>\n<p>   And so you did. Brought to your shambling orgasm, your legs give up on you as well as your senses. Nanami panted heavily, zipping back up his slacks after turning you into a wild mess. You managed to climb on the pool table and collapse. There was no other place to lie down on except for the baize.<br>\n<br>\n</p>\n<p> </p>\n<p>   Nanami sighed down at your exasperated body. \"Looks like I'm the one driving you home tonight.\"</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>   Somebody else had their eyes on you the whole night.</p>\n<p> </p>\n<p>   He's been sitting there for several minutes, legs crossed and movements so furtive that easily blends in the crowd. He watches you discreetly a few seats away, the gleam in your eyes crawling under his skin.</p>\n<p> </p>\n<p>   You were alone tonight. You were desperate for a getaway place, somewhere far away. You went with your instinct that drove you to this place. A bar; but it wasn't just any type of bar that you'd visit briefly and never come back. This place was so special to you that you never took your boyfriend here.</p>\n<p> </p>\n<p>   All you wanted was a fine drink for the night. The ambience of the bar was pleasant just like the last time you came. But there was a strange feeling crawling down your spine, sending your heartbeat to a halt from time to time. No matter what move you made, whether it'd be to take a sip or scroll through your phone, a lurking presence weighed down on you.</p>\n<p> </p>\n<p>   You searched around cautiously of your surroundings. Nothing seemed suspicious to you, but that daunting, paranoid feeling of being watched remained. What could you expect of coming alone to a bar late at night? Nothing sweeter than being anxious of your environment, no matter the place.</p>\n<p> </p>\n<p>   As you take one last sip for the night, narrowing your eyes down at the counter, your body remains still as a familiar presence encountered from behind. That irreverent fear flared in your eyes and stirred in your stomach as <em>he</em> approaches.</p>\n<p> </p>\n<p>   This is why the bar was so special to you. This is the place where you met him for the first time two years ago.</p>\n<p> </p>\n<p>   You look down at your lap, refusing to make proper contact. Beside you stood a man with neat blond hair, a strong chiselled jawline and deep, dark eyes. You feel your face grow hot from the circling panic that rushed into your brain. You knew that presence. You knew that effect. His aroma, his voice— everything that can easily trace back to him.</p>\n<p> </p>\n<p>   The man slanted his head at you, his lips curving to a rather satisfied smirk. \"You always know your way back to me, don't you?\"</p>\n<p> </p>\n<p> </p>\n<p>   You stood in front of a wide mirror, hands propped on the marble counter with a fancy bowl sink. The warm red lighting glowed brightly onto your skin, creating an exotic aura that strangely soothed your mind. It felt like surging through fine cherry mist. This was the restroom upstairs that people barely used.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>   Nanami stood against the tiled wall behind you, hands clutched in his pockets as he gazed into your reflection. You couldn't find the right words to say. Perhaps there wasn't much to say at all, studying his facial expressions like he immediately knew everything that was going on with you.</p>\n<p> </p>\n<p>   \"Why did you follow me here?\" you asked bluntly.</p>\n<p> </p>\n<p>   His head craned higher the moment he heard your voice, wanting to see more of your face on the mirror. \"Why did you come back to this place?\" he demurred.</p>\n<p> </p>\n<p>   \"I asked first.\"</p>\n<p> </p>\n<p>   \"Because I wanted to,\" he immediately replies without any thought. \"Now answer my question.\"</p>\n<p> </p>\n<p>   Your mouth shifts to the side. \"I wanted a drink,\" you managed to say. \"And for nostalgia, I guess.\"</p>\n<p> </p>\n<p>   \"Liar.\"</p>\n<p> </p>\n<p>   You swallowed the lump in your throat, sulking in silence once again. Nanami is one of the bartenders here— the one that served you the first time you came two years ago. Little did you know that you were slowly falling for him, coming back for a drink every Friday night just to see him again.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>    \"It's about your shitty boyfriend, isn't it?\"</p>\n<p> </p>\n<p>   You didn't reply. Nanami pushes himself off the wall, ambling across the herringbone floor to where you stood. He was behind you, the fear and anticipation taking over in your chest as he inched closer.</p>\n<p> </p>\n<p>   Nanami's jaw clenched as he pictured you with another man. Though he's seen you with him occasionally, it aches him excruciatingly from how bad you wanted that man instead of him. All those times you've been falling for him, when in reality he destroyed you. He robbed you of your self-worth. He toyed with your feelings like they were nothing.</p>\n<p> </p>\n<p>   Sure, he was very loving and affectionate to you the first few months, but that chivalry is now gone. Seeing you with another man— a shitty man, rather— made Nanami's blood boil.</p>\n<p> </p>\n<p>   \". . .Yes,\" you confided. The guilty weight on your shoulder felt lighter when you finally confessed.</p>\n<p> </p>\n<p>   A cunning thought registered in his brain, satisfied by your honest reply. \"Poor dear,\" he consoled, tilting his head. \"Keeping a man that doesn't know how to treat you well.\"</p>\n<p> </p>\n<p>   You feel your pulse pounding as his breath hits the back of your ear. He dared not to touch you, leaving the initiative to you only. It was a tormenting battle to face— you had your instincts shouting at you to make a move, but your body kept faltering. You knew everything about this was wrong. You knew the consequences of passing by here.</p>\n<p> </p>\n<p>   But yet, everything that was wrong about this has never felt this good to you.</p>\n<p> </p>\n<p>   \"Wouldn't you like to forget about that man?\" he taunted, the husk in his voice filling your ears. \"That piece of shit that can't even make you feel good?\"<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>   There was nothing more tortuous than being plagued with guilt and desire tonight. However, that guilt already left long ago during the way here. Acknowledging the future scenarios, you already knew what was bound to happen tonight; a one-sided affair. After being neglected so long by that man, it wouldn't mean anything to him.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>   He wouldn't have to know. Hell, he wouldn't even care if he found out.</p>\n<p> </p>\n<p>   So you surrendered to your desires. The desire for at least one man to care about you, the desire for someone who can return those feelings. You curve your neck back on his shoulder, his soft breaths hitting onto your skin that made you shudder.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>   Nanami sensed how touch starved you are, finding it pathetic that your boyfriend had to carry you on like this for months. His hands slipped out his pockets and held onto yours, guiding you to your thighs like a slow, sweet caress. You turn to face him, your lips near his jawline.</p>\n<p> </p>\n<p>   \"Yes,\" you whispered tenderly. \"That's why I came. To forget about him.\"</p>\n<p> </p>\n<p>     A sigh releases from your mouth as Nanami's hand grazes your collar bones, the other stroking your thigh. Your body starts to heat up, unable to fight the arousal stirring. His lips kiss your head, trailing down to your neck where you slant it to the side. You grip onto his hands tighter. Nanami instantly knew what you wanted.</p>\n<p> </p>\n<p>   He takes your chin, leaning closer to grant you a warm kiss. You returned the kiss in a desperate manner, conveying how much you've missed him. You didn't bother turning around. Instead, you arched your back, pressing your ass against him. His hands continued to roam on your skin— one holding your neck and one slipping under your top to fondle your breasts.</p>\n<p> </p>\n<p>   The traces of your body was something Nanami never forgot. He'll never forget the places that writhe you the most, and he definitely didn't forget the way how you screamed. Kissing him again felt like coming back home; it was a place where you felt like you belonged.</p>\n<p> </p>\n<p>   You discard your clothes onto the floor, leaving only your top. Nanami undoes his belt and takes his cock, sliding it on the folds of your sopping pussy. He then locks your hands behind your back with his left arm, hugging them in place while the other cups your face.</p>\n<p> </p>\n<p>   \"He doesn't touch you the way I do, right? Or, does he even bother to touch you at all?\"</p>\n<p> </p>\n<p>   You shake your head, sighing from the way he teased you with his cock. \"Were you jealous during those times?\"</p>\n<p> </p>\n<p>   \"Maybe,\" he replies, tracing your thighs. \"Why, did you enjoy making me jealous?\"</p>\n<p> </p>\n<p>   \"Maybe,\" you grinned, mimicking the coy from his earlier response.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>   Nanami kisses you again from behind, feeling your head collapse onto his shoulder as his fully erect cock went inside you. No matter how many times he's fucked you, especially from how long ago it's been, the sensation of him filling you will forever feel blissful.</p>\n<p> </p>\n<p>   Nanami thrusts into your cunt relentlessly, humming on your neck while hearing your cries and moans. You slowly open your eyes, watching your helpless body being pounded from behind on the mirror. The sound of smacking and shattered moans fill the entire restroom. Thankfully, nobody could hear it from the loud bass of the song playing downstairs.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>   He watches you in the mirror as well. Analyzing from how loud you were and how you tightened around him, it was the look of losing your cohesion. Nobody has ever made you feel this way in a long time and it amused him how he was the only one who could do it.</p>\n<p> </p>\n<p>  To gain a bit of stability, you found yourself clinging onto the edge of the counter once his hands moved to your hips. The more he slammed inside your walls, increasing his pace, the more you grew hazy. The thrill of it felt like ecstasy flaring in your veins.<span class=\"Apple-converted-space\"> </span></p>\n<p> </p>\n<p>   \"Like I said. . . Nobody knows you the way I do.\"</p>\n<p> </p>\n<p>   You replied with a moan, staring at him through the mirror with crazed lust. Before you know it, his hands clamp over your mouth. He can feel you were near your orgasm by the contorted expression on your face. The more he thrusted, the more you were sent on the edge.</p>\n<p> </p>\n<p>   In that moment, you lean on his chest again as you were brought to your climax, your moans muffled by his hands that were barely heard from the music. Nanami halted his movements, his cock beginning to stir where he pulled out. You lowered yourself to your knees this time and stuck your tongue out for him.</p>\n<p> </p>\n<p>   Nanami takes your face, looking up at him with heated eyes as he stroked his cock on your tongue. Your pussy kept throbbing from your earlier orgasm, panting heavily along with his groans. His breath hastens as his warm cum releases onto your tongue. You kiss the tip one last time, smirking up at him as you swallow.</p>\n<p> </p>\n<p>   \"This brings me back, don't you think?\" he chuckles, holding onto your chin.</p>\n<p> </p>\n<p>  \"I guess it does,\" you admit. The memories of your Summer fling with Nanami lingered in the back of your head.</p>\n<p> </p>\n<p>   After tonight, you had no idea how you were going to face your boyfriend. The guilt heaved in your chest again after thinking about him, especially the tenderness he provided before he turned into an asshole. But it doesn't matter anymore. He couldn't care less about your whereabouts.</p>\n<p> </p>\n<p>   Maybe Nanami was right. There wasn't any<span class=\"Apple-converted-space\"> </span>man out there who knew you better. . .</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>   A suffocating grip from the taut ropes bites onto your skin, restraining you from any movements.<br><br></p>\n<p>   You were bound on your knees, wrists tied behind you and the cool air surrounding your skin. There was rope wrapped around your thighs and calves, nearly tied together to keep you from standing or spreading them open.<br><br></p>\n<p>    Outside, the neon and golden glows of the cityscape pealed through the wide window, illuminating your features. But just like the rest of this office camouflaged in darkness, your eyes were covered by a silk tie used as your blindfold.<br><br></p>\n<p>   <em>Impatience. </em>The dreadful feeling lurks in your bones like wildfire as you awaited for Nanami to come back. You were excited, feeling the covet coaxing in your blood. But idling too long killed you slowly.<br><br></p>\n<p>   It was amazing, really— what that man could do with rope, suspending you like fine artwork.<br><br></p>\n<p>   Your head slightly turns at the creaking sound of the door opening. The subtle movements of your body comes to a stop and you held your breath when you hear his footsteps. You were itching to see his face, touching you boldly in places that send you in ecstasy. You've yearned for this fantasy long enough. But you knew it wouldn't be this easy.<br><br></p>\n<p>   Nanami's gaze flickered to your body as he walked in and made his way to you near the bed. \"Hm. Look what we have here,\" he says sardonically. \"Is this toy mine to play with?\"<br><br></p>\n<p>\n<em>   Play. . .</em>\n<br>\n<br>\n</p>\n<p>   A shiver crawls down your spine from the rich, dark tone of his voice nearby. He takes a couple of steps towards you and slants his head as he observes you indifferently.<br><br></p>\n<p>   Your chest thrummed when you felt his presence nearby. Nanami kept his hands in his pockets, not wanting to touch you just yet. That's what killed you inside. It felt like a hard block of ice settling within your rib cage that shattered you. He was testing your resistance— that's what's been going on. Not one finger of his hovered over your body and it made you ache.<br><br></p>\n<p>   Nanami's expression remained nonchalant. \"You've been ignoring me all day. I know you were doing that on purpose.\"<br><br></p>\n<p>   You didn't reply. He moved closer, the fabrics of his top shifting, taking both of his hands to the back of your head. He untied your blindfold and let it slide down to your thighs. You felt a hint of light hit on your eyelids, fluttering them open to Nanami, imposing in a black tie, standing tall in front of you.<br><br></p>\n<p>   Nanami took your chin and elevated it higher. You were automatically delirious under his touch and he could see that transparent aching through your eyes.<br><br></p>\n<p>   \"I'll admit. I'm a bit pissed off about what you did,\" he says, his jaw clenching tightly. \"You just <em>want</em> me to release my frustrations out on you, am I right?\"<br><br></p>\n<p>   You nodded reluctantly and swallowed. \"I'm sorry. . .\"<br><br></p>\n<p>   \"Are you really?\" he rose a brow.<br><br></p>\n<p>   The regret finally seeped in you considering the prospect. Willingly ignoring Nanami for the whole day just to piss him off all lead to this. Looking up at him, his eyes deemed unreadable to you, but so tantalizing as they took you in. It was as if there was hunger in gaze, drinking the sight of you like redolent spice.<br><br></p>\n<p>  \"Hm. Looks like you're not.\" Nanami shoved his hands back in his pockets, the sides of his thumbs leaning on the surface of his belt. His head tilted slightly, narrowing his eyes like he was thinking hard about something.<br><br></p>\n<p>   \"For the first time, I don't know where to start off with you,\" he finally says. \"Part of me wants to fuck you right now and the other part of me wants to ruin that pretty mascara of yours with my dick. How about that?\"<br><br></p>\n<p>   Your breath hitched at the last sentence. It immediately turned you on, feeling your pussy clenching. \"<em>Please</em>,\" you whispered, drilling your eyes onto his. You ached again. No words, no thoughts, just your feral desire of him to ruin you.<br><br></p>\n<p>   Nanami's mouth curved to a cocky smirk. \"So eager to give yourself to me tonight, aren't you?\"<br><br></p>\n<p>   You pressed your lips together as the lower half of his body was inches away from your face, waiting for him to unbuckle his belt and unzip his slacks. His erection tented through, hinting his excitement that you felt as well, stirring in your core. Furtive lubing wasn't that much of a problem for you anyways.<br><br></p>\n<p>   \"I won't be holding myself back tonight just so you know,\" he says, grabbing your head up high.<br><br></p>\n<p>\n<em>   \"Remember the safe word.\"</em>\n<br>\n<br>\n</p>\n<p><em>   </em>You give a subtle nod before widening your mouth open for Nanami to shove his cock in. He was already filling the hallow in your throat, where all you relied on was breathing for air through your nose. It was hard not being able to use your hands for support, but feeling his cock twitch in your mouth and hearing his shallow breath made you think otherwise.<br><br></p>\n<p>   A deep groan comes out of Nanami, watching you voraciously taking his cock. Nothing felt better than his cock mercilessly filling you, receding, then filling you again where your head began to throb from the pace.<br><br></p>\n<p>   His cum started leaking out of your mouth like string, dripping to your thighs and on your breasts. Your face was already drenched in sweat and the residue of his cum glistened all over your face.<br><br></p>\n<p>   After one final, aggressive thrust, you gasped for air. Your head dropped down and panted rhythmically to catch your breath. Nanami's hand meets your face once again, raising your head higher to see your exhausted expression. Half-lidded eyes and cum hanging out of your mouth.<br><br></p>\n<p>   With your legs spread open, he kneeled down and took the chance to slide his fingers in your throbbing cunt without warning. You can draw the feel of his fingers thrusting hilt deep, immediately clenching around him. Your body lights up with fever. An orgasm was drawing near for you, right on the spot.<br><br></p>\n<p>   It wasn't until he pulls his fingers out and slapped on your clit. The pummeling strength of him left and the sensation spiraling in your core faded. Your face contorted in frustration and whined at him when he stood up. \"Thought you could cum on my fingers?\" he chuckles. \"That's too fucking bad. I'm not letting you.\"<br><br></p>\n<p>   He lowered himself, this time near the bight of the rope tied on your thighs. \"I'll be untying you for now. But this time you'll be on the bed, tied up in another position. Stay still for me.\"<br><br></p>\n<p> </p>\n<p>\n<br>\n<br>\n</p>\n<p>   It was fascinating how Nanami mastered this form of art.<br><br></p>\n<p>   Double column ties. They were tight enough to render your body and leave chiseled indents at the brine of your skin. Your back was against the pillows while your wrists were tied up above your head. Your ankles and thighs were bound together this time, legs bent and spread open. The position was enough to maximize your exposure.<br><br></p>\n<p>   \"Is this better?\" he breathed out. \"Love getting tied up and fucked hard like this?\"<br><br></p>\n<p>   Your body rocked back and forth on the bed, breasts bouncing and your head buried under your arms from the simulation. His cock rapidly penetrates your slippery walls from the lube, making your muscles clench around him. It was enough to ignite the fire burning in your skin, swelling with sighs and faltering with tears.<br><br></p>\n<p>   In that moment, you were tormented with pleasure and pain. The ropes biting onto your flesh, Nanami slapping your breasts and thighs. He took possession over you, marking you on your neck and chest with his mouth.<br><br></p>\n<p>   You were almost driven to your brink, clenching your teeth tightly and stretching your body from squirming. You begged and cried to come, but Nanami refused.<br><br></p>\n<p>   \"Hold it again,\" he ordered, sliding his cock out. \"I didn't give you permission to yet.\"<br><br></p>\n<p>   You whined loudly when your climax had to thrash down and your stomach dropped. Nanami lightly slaps your face and grabs your throat, hovering above you as he rammed his cock forcefully in you. The pace was unbelievably fast it made you shudder violently under his touch, the ropes tugging at your wrist when you jolted them upwards in surprise.<br><br></p>\n<p>   Nothing sweeter than the lewd sounds of flesh, the bed creaking rhythmically with Nanami's pace and your glorious cries. You couldn't stop squirming and your hands held tightly to the thick ropes like a pole.<br><br></p>\n<p>   \"<em>Fuck</em>,\" Nanami grunted. \"You feel so fucking good. Think you deserve to come now?\"<br><br></p>\n<p>   You pleaded loudly for his permission to do so, where he leaned down to reward you with a heated kiss and held your hand. Nanami's pace slowed for a bit when your orgasm washes over you, his cock pulsating with cum inside. The both of you were left breathless and sweaty.<br><br></p>\n<p>   Nanami releases out of you, the warm fluids slowly oozing out of your cunt. He takes his cock and slides the fluid over his tip, rubbing your folds, and proceeds to fill you with his cock once again.<br><br></p>\n<p>   \"Not letting any of it spill out,\" he smirked.<br><br></p>\n<p>   You threw your head back. \"Feels good,\" you sighed out, encircling your hips in sync with his gradual pace.<br><br></p>\n<p>   Nanami's whole body was drenched in sweat. In his grip he held onto your waist, holding down on your body while he thrusted cautiously and slowly this time. He leaned down to your neck, planting a kiss on the deep marks he gave. \"I don't want either of us to forget this night.\"<br><br></p>\n<p>   You arched up against him, replying with nothing but a sweet kiss. Feeling the heat of his body on yours, sighing out your name, it felt like nothing else in the world mattered. The pacing between sessions went from rough to soft, back to rough, and then soft.<br><br></p>\n<p>   Moments later, you were riding slowly on Nanami's cock, where he sat up on the edge of the bed and held your hips. He was watching you through the body mirror nearby, your bare ass maneuvering up and down at a slow pace. You weren't tied up this time. The rope laid astray on the bed. However, his tie was wrapped around your neck, grabbing on the end to guide your pace and tug at your throat.<br><br></p>\n<p>   \"That's it, good girl,\" he sighed against your ear. \"I love you riding on my cock like this.\"<br><br></p>\n<p>   You smiled down at him, gliding your hands from the back of his neck to the soft locks of his blond hair that you messed up. Another orgasm was rising in you, and you humped faster on his cock. Nanami suddenly grabbed your throat, abandoning the tie and decided to ram into your pussy faster. You lost control of yourself, throwing your head back and furrowed your eyebrows while you whined.<br><br></p>\n<p>   Nanami slaps your face and breasts, the permeating sting on your skin turning you on greatly. You grabbed on his hair as he fully sinks into you with your climax erupting. He was hitting<em> </em>your tight spot in your guts once again with raw thrusts. For awhile you froze, gaining a bit of momentum to heave your hips up slightly for him. His cock was draped in cum along with your cunt, sustaining the spasms in your tight velvet walls until it slowed down.<br><br></p>\n<p>   You exhaled sharply. \"Holy shit.\"<br><br></p>\n<p>   Nanami's thumb stroked the side of your mouth, caressing your face tenderly. \"Are you okay?\"<br><br></p>\n<p>   You give a nod, overlapping your hands with his. \"Never felt better,\" you replied with a smile.<br><br></p>\n<p> </p>\n<p><b></b>   You just came out from the bathroom and walked back to Nanami who sat up on the bed. He smiles weakly at you, waiting for you to cradle in his chest. The covers felt cool underneath including the bedsheet.<br><br></p>\n<p>   For a moment, it was quiet. As you lay on his chest, you could hear the sound of his steadily beating heart. Feeling his thumb stroking your shoulder and holding you felt soothing. You could get your mind off things easily thanks to him.<br><br></p>\n<p>   \"You were good today,\" he mutters, kissing your forehead.<br><br></p>\n<p>   \"So were you,\" you smiled, the palm of your hand laying out on his bare chest.<br><br></p>\n<p>   Nanami noticed the deep rope marks on your thighs. \"Oh shit. Did I tie it too tight for you?\"<br><br></p>\n<p>   \"No, no,\" you demurred. \"It was perfect. Just as always.\"<br><br></p>\n<p>   Nanami intertwined his fingers with yours, taking your hand to his lips and kissed your knuckles. \"I didn't wanna hurt you tonight,\" you hear him say. \"<em>Please </em>don't ever ignore me like that again. I was worried.\"<br><br></p>\n<p>   \"I won't,\" you murmured, this time sincere.<br><br></p>\n<p>   \"Is your body hurting anywhere? Tell me.\"<br><br></p>\n<p>   \"Well. . . I feel sore in my legs, mostly.\"<br><br></p>\n<p>   Nanami hummed. \"Let's just rest then. I didn't get to see you at all today.\"<br><br></p>\n<p>   You slant your head against his chest, drifting your gaze out the wide window with the view of the cityscape. It was like staring at a serenade of stars, vast constellations, lights blinking and the dark sky blanketing above. You felt paralyzed in Nanami's warmth. Nothing, and you mean nothing— in this world could ever compare to the safe feeling of being engulfed in his arms, coating you in sweetness.<br><br></p>\n<p>   \"Nanami?\" you whispered.<br><br></p>\n<p>   \"Hm?\"<br><br></p>\n<p>\n<em>   \"I wanna play in the morning.\"</em>\n</p>\n<p> </p>\n<p> </p>"
}