{
  "id": "29197716",
  "url": "https://archiveofourown.org/works/29197716?view_full_work=true",
  "author": [
    "OldeShoestrings"
  ],
  "title": "There's a Garden in Your Hair",
  "rating": "Not Rated",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "原神 | Genshin Impact (Video Game)"
  ],
  "relationships": [
    "Tartaglia | Childe/Zhongli (Genshin Impact)"
  ],
  "characters": [
    "Tartaglia | Childe (Genshin Impact)",
    "Zhongli (Genshin Impact)",
    "Xiao (Genshin Impact)",
    "Bonanus (Genshin Impact)",
    "Bosacius (Genshin Impact)",
    "Indarias (Genshin Impact)",
    "Menogias (Genshin Impact)",
    "La Signora (Genshin Impact)"
  ],
  "additional_tags": [
    "Alternate Universe - Modern Setting",
    "Love at First Sight",
    "Tartaglia | Childe Being an Idiot (Genshin Impact)",
    "Zhongli Being an Idiot (Genshin Impact)",
    "The yakshas are little kids",
    "Pining",
    "Zhongli and his yaksha babies",
    "Fluff",
    "Kid Fic",
    "Childe thinks Zhongli is the prettiest man alive",
    "Mute Zhongli"
  ],
  "language": "English",
  "series": "Part 9 of Olde's Vault",
  "published": "2021-02-04",
  "completed": null,
  "words": "7,566",
  "chapters": "1/1",
  "comments": "439",
  "kudos": "9,176",
  "bookmarks": "1,452",
  "hits": "62,413",
  "summary": "<p>The one where Childe is a florist, his boss can barely stand him, and his most loyal customers are five little children who keep buying flowers for their father.</p>\n<p>Then he meets the children's father. </p>\n<p>And for Childe, it's very much love at first sight.</p>",
  "notes": "<p>\n<em>(Important A/N: Not an English speaker and this isn't beta)</em>\n</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>",
  "text": "<p>--</p>\n<p>When Childe enters the shop, the bells above the door chime and the smell of lavender wafts gently in the air. The tune of blues floats throughout the shop. The strings of guitar strum once, twice, and Childe can't help but hum along with the tempo.</p>\n<p>He can hear the shuffle of footsteps from the backroom. Signora must have heard his arrival but as always, she ignores him. </p>\n<p>Unless she has something to complain about, Signora barely starts a conversation with him if she can help it.</p>\n<p>At least she pays well. </p>\n<p>Aside from the continuous music, the flower shop can be so deafeningly quiet without the presence of its rare customers.</p>\n<p>Childe puts his bags away, dons the blue apron, and ties his hair into a small ponytail before he straightens his narwhal hair clip.</p>\n<p>He looks at the marigolds on the oak desk. A snipping tool is placed beside the flowers.</p>\n<p>Signora's way of telling <em>get to work</em>. Childe grins. It's eleven am. They won't be having customers anytime soon.</p>\n<p>\"Right away, boss,\" Childe mutters to himself. A skip in his steps as he begins to work.</p>\n<p>The melody stops. A new song loops in and Chile laughs when the acoustic version of Signora's favorite song starts playing.</p>\n<p>\"Childe!\" Signora's voice comes from the storeroom. \"Get to work and stop slacking,\" she warns hotly. An embarrassment coils in her voice. </p>\n<p>The lyrics <em>'oh, girls, they wanna have fun'</em> continues to roll in the shop.</p>\n<p>Childe only laughs harder. </p>\n<p>Moments pass. New songs are playing. <em>Music is important</em>, Signora says. <em>It keeps the flowers happy</em>, she huffs with a flick of her platinum hair.</p>\n<p>Childe doesn't know whether to disagree or not. As long as he gets paid, why does it matter?</p>\n<p>The bells chime again. <em>A customer.</em> Childe quickly puts the small snipping tool and the flowers away. He faces the door. A fabricated smile is on his face - only for the smile to drop a second later. </p>\n<p>Childe blinks. There's no one there at the entrance. Huh.</p>\n<p>\"<em>Nǐ hǎo,</em>\" A squeaky little voice mutters. </p>\n<p>Childe slowly looks down, bemused, once he finds a little boy peering up at him. He looks uncomfortable. Anxious. He fiddles with his fingers.</p>\n<p>\"Hello,\" Childe replies softly. The boy seems to be alone. Through the glass door, he can't see any adults waiting for the kid outside.</p>\n<p>\"Mister Orange, you work here?\" The little boy asks. He's so young. Childe suspects the boy must be around five or six years old. </p>\n<p>Childe is suddenly reminded of his younger siblings.</p>\n<p>\"Yep! I'm the owner of this small flower shop,\" Childe spreads his arms cheekily.</p>\n<p>\"He's not!\" Comes Signora's voice.</p>\n<p>\"Just ignore her,\" Childe says playfully. He kneels in front of the boy, trying to appear as harmless as possible. The kid backs a few steps away, hesitant. </p>\n<p>\"Do you need anything?\" Childe asks kindly.</p>\n<p>The little boy pouts. He hides his hands behind his back as if he's trying to stash away an innocent little secret.</p>\n<p>\"You…\" the boy begins slowly, \"You sell flowers, right?\"</p>\n<p>Childe nods. \"Yep, as long as you can pay, we're fully committed to offering you our pretty flowers,\" Childe half-jokes.</p>\n<p>The boy probably takes Childe's joke to his heart. His eyes wilts, downcast, and his lips tremble. A telltale of incoming tears. </p>\n<p>\n<em>Oh, shit.</em>\n</p>\n<p>\"Hey hey, it's fine. You come here to buy some flowers, right? Why don't you tell me what you want and I'll get them for you, okay?\" Childe pats the boy's head gently. A smile on his face.</p>\n<p>It calms the boy down. Albeit, only a little bit.</p>\n<p>\"What's your name?\"</p>\n<p>\"...Xiao.\"</p>\n<p>\"Okay, Xiao. I'm here to help you. I promise,\" Childe soothes again.</p>\n<p>Xiao blinks at him. \"Promise?\"</p>\n<p>\"Promise.\" Childe winks. \"Now, come on.\" Childe stands up and offers his hand for the boy to take. Xiao readily accepts it.</p>\n<p>Chile hoists the boy up and settles him down on a nearby stool. Xiao curiously blinks at Childe with a pair of large innocent eyes.</p>\n<p>\"Okay, what do you have in mind?\" Childe asks again now that the atmosphere is lighter.</p>\n<p>But as always, Xiao takes his words too seriously. The boy ponders. His eyebrows wrinkle. His hand is on his chin. The sight is rather adorable and Childe almost chuckles at it.</p>\n<p>\"I want to buy something pretty for bàba. Something that can make him smile!\" Xiao declares. Instantly bold at the mention of his father.</p>\n<p>Childe nods. \"Sure. We can do that. Do you have anything you want to add? Something that your father likes?\"</p>\n<p>Xiao blinks again. Surprised by the question.</p>\n<p>\"Bàba likes blue. Because he likes notus... noctu...noctul...\" Xiao pouts, having difficulty pronouncing the word. \"Nocitlus jade!\" the little boy says confidently.</p>\n<p>\"It's Noctilucous jade,\" Childe corrects kindly, ruffling Xiao's hair. \"And what a coincidence. I like blue, too.\" </p>\n<p>The boy lets out a muffled giggle. Then his smile diminishes. \"But, mister Orange, I don't have mora with me…\"</p>\n<p>\n<em>What?</em>\n</p>\n<p>Childe narrows his eyes, thinking. He casts a look at the door to the backroom, where Signora is probably listing down for stocks they need to order. </p>\n<p>He looks back at Xiao. The boy refuses to meet his eyes. Childe hates seeing kids sad.</p>\n<p>\"All right. How about this, I'll cover the payment--\"</p>\n<p>Xiao's eyes widen.</p>\n<p>\"--since it's your first time here. A special offer. How 'bout it?\" </p>\n<p>Xiao nods. A shy smile is on his lips.</p>\n<p>\"But for now, you must keep this between us. If my boss found out about this, I'd be in big trouble,\" Childe whispers. </p>\n<p>Xiao tilts his head. \"I thought you said you're the owner, mister Orange.\"</p>\n<p>\"Well. A second boss,\" Childe finishes lamely. </p>\n<p>Xiao lets out an adorable little, \"Mmkay.\" Accepting Childe's pitiful attempt to preserve his honor.</p>\n<p>Signora won't fire him. He's the only one that can stand her and Childe hates being in the same room with Signora.</p>\n<p>But she's going to complain though. <em>Oh, she's going to complain for weeks if she finds out.</em></p>\n<p>\"So, a secret between us, okay?\"</p>\n<p>\"Okay,\" Xiao assures back quietly. Determined. His gaze goes to Childe's narwhal hair clip. Then back to Childe's face again. </p>\n<p>\"Good. It's a deal.\" Childe grins. \"Now… something that can make your father smile, huh? Maybe I've got just the thing. Wait here.\"</p>\n<p>Childe circles the shop, expertly choosing the flowers and staring at the petals; contemplating the colors. His brows pucker before he puts some of the flowers back or mixes them to create different combinations, looking for the one that fits his idea.</p>\n<p>Childe takes his time while Xiao waits, humming to himself.</p>\n<p>Once Childe has everything he needs, the florist cuts the stems and arranges the flowers neatly. He tucks them into a cotton paper, carefully wraps the bundle, and ties a blue ribbon around the bouquet.</p>\n<p>\"Here we go. Flowers for your father.\" Childe hands the fresh bouquet to Xiao. Coreopsises, crocuses, and pink hyacinths.</p>\n<p>Childe makes sure the flowers are in a proper size for the little boy to carry them easily.</p>\n<p>Xiao gingerly takes the bouquet and tucks it to his chest like it's the most prized treasure. Maybe it is for the boy. Childe smiles at the precious sight.</p>\n<p>\"Will you be okay on your way back?\"</p>\n<p>\"Yep. It's not too far. Don't worry. Thank you, mister Orange.\"</p>\n<p>\"Maybe I can accompany you?\" Childe questions, worried for the boy.</p>\n<p>Xiao shakes his head. \"It's okay. Thank you very much.\"</p>\n<p>Childe helps him get down from the stool. Xiao bows at the waist. He gives Childe a lingering smile before he runs towards the exit eagerly. </p>\n<p>The bells make a noise and the music continues playing. </p>\n<p>When he turns around, Childe sees Signora peeking from the slightly ajar door. Her eyes are sharp. </p>\n<p>Childe stands still. </p>\n<p>\"I saw that,\" is all Signora says.</p>\n<p>\n<em>Ah, fuck.</em>\n</p>\n<p>--</p>\n<p>Several days after that, a slow song accompanies Childe in the flower shop. </p>\n<p>Signora is absent. Thank god. She's been relentlessly accusing him of being too soft to their customers.</p>\n<p>It's not as if she must drag the issue on and on. Childe has already paid for the flowers with his mora.</p>\n<p>But <em>no</em>. Signora is vengeful and she makes sure her icy words are properly emphasized every time she reprimands him.</p>\n<p>Oh well. </p>\n<p>Now--</p>\n<p>The small bells above the door toll. Childe quickly looks at the front door. His eyes narrow when he spots no one there. </p>\n<p>\"Mister Orange is here!\"</p>\n<p>\"Xiao, wait!\"</p>\n<p>\"Hurry, Menogias!\"</p>\n<p>Childe peers down. Two children are running excitedly towards him. <em>Wow, there's more of them.</em></p>\n<p>\"Mister Orange, it's me again,\" Xiao states brightly. Childe's lips twitch in obvious mirth. Then his eyes trail to the new kid next to Xiao, whose eyes are wide in wonder. </p>\n<p>\"And this is?\"</p>\n<p>\"Menogias! We're siblings.\" Xiao puffs proudly. Childe laughs. He bends down to tousle the kids' hair. Menogias is surprised by Childe's action but makes no move to stop him. Xiao just smiles. </p>\n<p>\"Mister Orange, bàba liked the flowers! He smiled!\" Xiao shares eagerly. </p>\n<p>Menogias hurriedly adds, \"Uh-huh. Bàba was happy to get the flowers. So can we please have more flowers again, mister Orange?\"</p>\n<p>Two pairs of bright eyes are looking at him imploringly, lips pucker and tiny hands form into fists. The children can't stay still. Especially Menogias. The child is almost hopping. They look so close in age. Childe wonders who's older.</p>\n<p>\"Well… do you bring mora with you?\"</p>\n<p>The kids deflate. <em>Oh no.</em></p>\n<p>\"Oh, sorry, mister Orange. We forgot…\" Menogias gloomily says. There's a hiccup in the kid's voice. <em>Oh, please no. Don't cry.</em> Even Xiao looks close to crying.</p>\n<p>\"Okay okay. No big deal. I can pay for the flowers again,\" Childe quickly responds.</p>\n<p>His words don't instantly cheer the children up but at least they don't look like they're going to start pouring water from their eyes. Childe can't deal with sad kids. </p>\n<p>It's bad for his heart. </p>\n<p>\"Oh, thank you again, mister Orange,\" Xiao shyly answers. </p>\n<p>\"Thank you,\" Menogias mimics sweetly.</p>\n<p>Childe can only smile. \"No problem. Now, let me fetch the flowers, okay?\"</p>\n<p>Minutes later, Menogias pipes up. \"Why does the radio play sad music?\"</p>\n<p>Childe snorts while he wraps the bouquet steadily. \"It's not sad. It's jazz. And the song is for the flowers you see? So they'll always be happy and stay healthy.\"</p>\n<p>Xiao blinks. His head tilts at the new information. Childe hums along with the song. Menogias joins in, although a tad out of tune. It's rather silly but precious silliness nonetheless.</p>\n<p>\"Bàba used to sing his favorite songs. He can't do that anymore. Now he's just sad. He doesn't show it to us though,\" Xiao quietly explains.</p>\n<p>\"But we know he's sad,\" Menogias mumbles, just as dejected as Xiao.</p>\n<p>Childe is quiet. He doesn't… know what to say. It's not as if he's ever met the children's father so he has very little input to give the kids. He's only an outsider.</p>\n<p>Instead, Childe adds two yellow tulips into the bouquet along with the other flowers, wraps them, and offers the gift to Menogias.</p>\n<p>The little kid takes it and smiles kindly at Childe. \"Thank you, mister Orange. We'll pay for the flowers when we have mora, okay?\"</p>\n<p>\"Sure,\" Childe assures them. The children leave. The music plays on and on.</p>\n<p>Childe picks his wallet and drops a sufficient amount of mora in the cash register.</p>\n<p>--</p>\n<p>\n<em>Wow, there's more of them!</em>\n</p>\n<p>\"<em>Nǐ hǎo,</em>\" the little newcomer utters quietly, hiding behind Xiao and Menogias, and peeking at Childe shyly.</p>\n<p>Xiao and Menogias beam at Childe. But Xiao makes the effort to pull his, possibly, another sibling to the front to be introduced to Childe.</p>\n<p>\"This is Bosacius,\" Xiao says. \"Bobo is really smart!\"</p>\n<p>Menogias' face twists. \"Bàba still had to help Bosacius with potty yesterday! I'm smarter than Bobo! I helped bàba cook eggs today!\"</p>\n<p>Bosacius gasps. \"No, you meanie! I am smarter than you! Bàba said so!\"</p>\n<p>\"Liar! Bàba said we're all smart the same way!\" Xiao stomps his foot to the ground, crossing his arms. </p>\n<p>\"Poof it!\" Menogias cries out.</p>\n<p>\"It's <em>prove it</em>, dummy!\" Bosacius replies loudly. </p>\n<p>\"You both are dummies!\" Xiao adds just because he can.</p>\n<p>The children bicker. Plump cheeks are puffing. They're so close to sobbing.</p>\n<p>Childe winces. Time to play the peacemaker.</p>\n<p>\"You want to buy flowers for your father again, right?\"</p>\n<p>The children stop. They quickly look up at him. Wide eyes glow in anticipation. They nod.</p>\n<p>\"How about this? I'm going to pick some of the flowers from the shelf over there--” Childe points at the mentioned shelf, where vases of flowers are situated neatly, “--and put them here so you kids can choose which flowers to get for your father, okay? No more than four types of flowers so the bouquet won't be too heavy for you to carry.\"</p>\n<p>Also, it seems like he's the one paying again today.</p>\n<p>All the three kids bob their heads at Childe again with a large smile on their lips.</p>\n<p>Very well then. </p>\n<p>Many minutes later, despite the flow of the gentle music, the children begin to argue again when none of them can come to an agreement on which flowers to give to their father.</p>\n<p>Childe sits on the stool, running his hand through his hair, exasperated.</p>\n<p>In the end, he has to pick the flowers, cover everything up, and send the children away with a bundle of flowers in their short arms.</p>\n<p>They give him a genuine <em>thank you</em> before they skip away together happily.</p>\n<p>\"See you again, mister Orange!\" Bosacius waves at him one last time.</p>\n<p>Despite everything, Childe chuckles and waves back.</p>\n<p>Time to pay for another bouquet again.</p>\n<p>--</p>\n<p>It's lightly raining when Childe spots a man pacing back and forth on the walkway outside.</p>\n<p>Childe can't get a clear view of the man but he seems to be looking around as if he's searching for something.</p>\n<p>Childe peeks at the sky. It's not pitched black but the raindrops look like it won't be stopping anytime soon and the man is not holding any umbrella.</p>\n<p>Childe sighs. He picks up a nearby umbrella and heads towards the exit. </p>\n<p>The florist opens the door, the music fades, and the pitter-patter of the rain touches Childe's back for a moment. He ignores it.</p>\n<p>The man's face is turned away, glancing at anywhere but Childe. He doesn't notice the florist's presence.</p>\n<p>Childe opens the umbrella with a simple push and offers it out. </p>\n<p>\"Here, you're going to soak yourself.\"</p>\n<p>The man turns around, eyes wide. Childe's words die on his tongue.</p>\n<p>Oh, no. <em>Oh, no. He's pretty.</em></p>\n<p>The man hesitantly stares at the umbrella before he carefully takes it; unsure of the generosity that's being shown to him.</p>\n<p>The man opens his mouth, hesitates. No words come out. He closes his mouth before he smiles kindly at Childe, giving him a slow nod.</p>\n<p>The man's eyes seem to glow under the weather. Bright amber shines warmly. A whole summer lives in his eyes. <em>If I poke those eyes, would fireflies pour out?</em></p>\n<p>Childe stares and stares at the other, profoundly entranced, until the pretty man bows and walks away. Seemingly still searching for something.</p>\n<p>The back of Childe's shirt is a bit wet. But it doesn't matter. His mood is better for the whole day.</p>\n<p>Even Signora's glares can't dampen his spirit.</p>\n<p>--</p>\n<p>\n<em>There's more of them!</em>\n</p>\n<p>This one blinks slowly, taking in the surroundings before the kid turns around to glare at Childe, palms on the tiny waist. An attempt at trying to appear bold.</p>\n<p>Xiao, Bosacius, and Menogias skip towards Childe before they come to a complete halt in front of him. </p>\n<p>\"Mister Orange, we're here again!\"</p>\n<p>Childe laughs. \"I can see that. And you brought a new one, too.\" He stares at the glaring adorable kid.</p>\n<p>\"It's Indarias! Inda, come here and say hi to mister Orange,\" Menogias beckons.</p>\n<p>Despite the glare, Indarias huffs and quickly sprints towards Childe. The kid slips and almost falls but Childe is quick to grab the tiny body and straighten Indarias carefully.</p>\n<p>The kid looks up at Childe and begrudgingly thanks him.</p>\n<p>Childe grins. \"You're welcome.\"</p>\n<p>\"Hmph.\" Indarias dramatically turns away.</p>\n<p>Xiao pouts. \"Be nice, Inda! Mister Orange gives us pretty flowers all the time! Bàba would be sad if you're being mean.\"</p>\n<p>Somehow Xiao's words manage to click something within the pouty kid. Indarias' glare wilts, casting a pitiful glance to the floor.</p>\n<p>\"Sorry,\" Indarias mumbles. Xiao smiles. Menogias and Bosacius are pointing at the many flowers in the vases, ignoring their other siblings.</p>\n<p>\"It's fine. Just be nice, okay?\" Xiao holds Indarias' hand. </p>\n<p>They smile at each other for a moment before Menogias and Bosacius join in and the kids begin to circle one another, laughing and throwing silly jokes. </p>\n<p>All these kids look so close in age and it makes Childe curious. </p>\n<p>\"No mora again today?\"</p>\n<p>\"Nope!\" Surprisingly, it's Indarias that happily answers Childe.</p>\n<p>\"Sorry,\" Xiao mumbles.</p>\n<p>Childe chuckles lightly. \"It's okay. Let's just get the flowers, yeah?\"</p>\n<p>\"Okay!\" The kids chirp together.</p>\n<p>Not long after, Signora comes in. </p>\n<p><em>Uh-oh</em>, Childe thinks. But his boss just narrows her eyes. She looks at the kids who look back at her. Signora glances at Childe.</p>\n<p>\"You're paying,\" she orders.</p>\n<p>Childe shrugs. \"Obviously.\"</p>\n<p>Signora is evidently irritated. Yet, she takes a seat on a stool next to Childe and helps him decorate the bouquet.</p>\n<p>The children surround her, tiptoeing as they watch Signora work her magic fingers on the flowers diligently.</p>\n<p>\"Whoa… you're better than mister Orange!\" Menogias says in awe. </p>\n<p>\"I know,\" Signora proudly responds. She flicks her hair. \"And you may call me Signora.\"</p>\n<p>\"Seenoh!\" Bosacius repeats merrily.</p>\n<p>\"Close enough.\" Signora sighs.</p>\n<p>Childe snickers. He looks down when he feels someone pulling at his sleeve. Indarias is there smiling kindly at him.</p>\n<p>\"I’m sorry for being mean before. And I l-Iike your hair clip,\" Indarias mumbles timidly. </p>\n<p>\"Why, thank you. Narwhal is my favorite animal.\" Childe taps his tiny hair clip.</p>\n<p>Indarias gives him a toothy smile. \"Mine, too.\"</p>\n<p>\"So, why are these brats calling you mister Orange?\" Signora interrupts.</p>\n<p>Childe grins. \"It's definitely because of my pretty hair.\"</p>\n<p>\"Your hair is the color of a rotten salted egg,\" Signora says <em>sweetly</em>.</p>\n<p>Childe glares at her. </p>\n<p>The music changes. It's another one of Signora's favorites. She sings along quietly and the kids messily join her. Signora lets them be even though they get the lyrics wrong.</p>\n<p>However, Signora steps on Childe's shoe when he tries to sing the song, too.</p>\n<p>\"Bitch,\" Childe says.</p>\n<p>\"Ass,\" Signora says.</p>\n<p>\"Bad words!\" Bosacius accuses haughtily.</p>\n<p>\n<em>Oops.</em>\n</p>\n<p>--</p>\n<p>\n<em>Another one! Wow.</em>\n</p>\n<p>\"<em>Nǐ hǎo,</em>\" the kid says politely.</p>\n<p>\"Hello,\" Childe replies.</p>\n<p>\"I'm Bonanus.\"</p>\n<p>\"Hello, Bonanus, I'm--\"</p>\n<p>\"Mister Orange! Can you pick the flowers that say we love bàba lots and lots?\" Menogias asks as the kid runs towards Childe. </p>\n<p>Xiao stands behind Menogias, the rest of his siblings tail him. Bonanus stares at Childe with puppy eyes. </p>\n<p>Xiao seems to notice what his sibling is doing and the boy shamelessly copies the puppy-eyed look. The rest of the children eagerly wait for Childe's response.</p>\n<p>\n<em>These kids don't play fair. I can't ever say no to them.</em>\n</p>\n<p>\"You know I'll always help you, right?\"</p>\n<p>They nod adorably. Childe just wants to pinch those squishy cheeks. Oh, well. Time to prepare the flowers.</p>\n<p>\"Thank you, mister Orange,\" Bonanus kindly says.</p>\n<p>\"No mora again today?\" He teases. The children shake their heads. </p>\n<p>\"Sorry, we forgot…\" Xiao mumbles. Childe can only snort fondly. </p>\n<p>The children sit on the stools while Childe works his magic. Flowers to show a lot of love, huh? Childe can think of a few flowers he can weave together.</p>\n<p>He hums while tending to the flowers, plucking the ones he requires. He notices how Xiao and Menogias are humming correctly to the song. Childe realizes that some of the kids have visited the shop several times to remember the songs by now. </p>\n<p>He looks at them and asks the question he's been meaning to ask for a while.</p>\n<p>\"Your father knows you guys keep coming here?\"</p>\n<p>All of them shake their heads. <em>I suspected as much.</em></p>\n<p>\"It needs to be a secret! We only come here when bàba is at work! Keqing is our babysitter but sometimes she's busy writing her weird stories. So we slip out when she's not watching. She won't notice we're gone when she's writing,\" Xiao cheerily says, shaking his tiny legs back and forth.</p>\n<p>\n<em>Wow, what a terrible babysitter.</em>\n</p>\n<p>\"We're all duct-taped,\" Bonanus suddenly pipes in.</p>\n<p>\n<em>What?</em>\n</p>\n<p>\"Adopted!\" Bosacius corrects.</p>\n<p>Bonanus flushes. </p>\n<p>Adopted. That explains why all of them are so close in age. </p>\n<p>\"Bàba took us in. He always keeps us safe and happy. So now we want to do the same for him.\" Indarias notices how Xiao sways his legs and promptly copies the boy. </p>\n<p>\"Bàba can't talk anymore. He got into a car accountant,\" Bonanus says.</p>\n<p>\"Car accident!\" Bosacius corrects again. Bonanus scowls. </p>\n<p>\"There's a big ouchie on bàba's neck. He doesn't like it when people look at it...\" Menogias mutters. </p>\n<p>Oh. Childe blinks. His fingers hover in the air. <em>Oh, that's why.</em> Sometimes, the length the children are willing to go to make their parents happy can be quite extraordinary.</p>\n<p>\"Bàba is sad because he lost his voice. But he tries to hide it from us. And we don't like it when he's sad.\"</p>\n<p>\n<em>Sharp kids.</em>\n</p>\n<p>\"When… uh, when did he get into an accident?\" Childe questions.</p>\n<p>\"Hmm,\" Xiao ponders, finger tapping his chin. \"Dunno. Not long ago. It was raining when Keqing took us to the hospital to visit bàba.\"</p>\n<p>\"No mother?\" Childe asks abruptly. He winces, hoping the question isn't too sensitive. <em>Think before you speak, Ajax.</em></p>\n<p>Xiao shakes his head. \"Bàba is like a mother, too. He's more than enough for us.\"</p>\n<p>Childe's chest warms at those words. Imagine being loved so fiercely by your children.</p>\n<p>He wraps the flowers properly but not before adding a few goldenrods into the bouquet. He uses a blue ribbon to add the finishing touch.</p>\n<p>He hands the bouquet to the children.</p>\n<p>\"Be careful out there, okay?\"</p>\n<p>They nod. \"Okay. Thank you, mister Orange!\"</p>\n<p>They skip away together.</p>\n<p>Childe watches the kids leave. His heart is both light and heavy.</p>\n<p>The music changes. It echoes and on and on.</p>\n<p>--</p>\n<p>The pretty man is back.</p>\n<p>Childe watches him through the glass door.</p>\n<p>This time, instead of loitering about, he stands in front of the flower shop. He stares at the sign on the eaves before pushing the door open. He carries with him a familiar umbrella.</p>\n<p>Childe swallows. He stands from behind the cash register and makes his way towards the pretty man.</p>\n<p>Those ochre eyes burn brighter under the dimmed lights. The music player stops, shuffles, and plays a new song.</p>\n<p>He smiles at Childe and Childe thinks <em>ah shit, I'm fucked</em>.</p>\n<p>\"Welcome.\" Childe wants to pat himself in the back for not stuttering. </p>\n<p>The pretty man nods. He stares at the umbrella in his hand before he gives it to Childe. </p>\n<p>\"Oh.\" Childe blinks. \"Yeah, ah, my umbrella. Yeah. I know.\" Childe inwardly groans. That's so pathetic. <em>He's</em> pathetic.</p>\n<p>The man's smile grows. His eyes look kind, gentle. Childe wants to touch them. He really wants to make sure if fireflies live within those amber sparks. </p>\n<p>Childe takes the umbrella. It slips from his hand and falls to the floor.</p>\n<p>...wow. embarrassing. Childe is going to drown himself tonight.</p>\n<p>Unfortunately, both of them bend down to pick up the umbrella at the same time. Their foreheads collide with a loud thump.</p>\n<p>\"Ow,\" Childe hisses, massaging the crown of his head. His thumb touches his narwhal hair clip. Childe hears a muffled noise, like a rumble from a chest. The florist looks up to stare at the man.</p>\n<p>There's barely any sound coming from the other man but his eyes shimmer and his lips stretch into a large smile as if there's laughter clinging to his lips. </p>\n<p>He holds his forehead, as well. </p>\n<p>His cheeks puff, red like fruits. His long ponytail sways when he moves and like a tender song, the expression on his face changes easily. Sunshine spills everywhere.</p>\n<p>Childe has never seen anything more beautiful in his life. </p>\n<p>He doesn't believe in love at first sight or <em>falling in love easily.</em></p>\n<p>But at this very moment, Childe knows he's completely screwed.</p>\n<p>\n<em>I'm in big trouble.</em>\n</p>\n<p>The man looks at Childe up and down like he’s found a big secret.</p>\n<p>Once he's returned the umbrella, the pretty man leaves.</p>\n<p>The warmth from his fingers stays on Childe's skin.</p>\n<p>--</p>\n<p>Days later, Signora enters the shop. She finds Childe half-sprawled on the oak table.</p>\n<p>\"What is wrong with you?\" Signora asks coldly.</p>\n<p>Childe sobs into his arms. Body slacks. Flowers surround him.</p>\n<p>\"Signora, I'm fucked. I'm dead. I'm ruined,\" Childe cries. </p>\n<p>\"Whatever. Just don't get snots all over my flowers. And present yourself properly. What if our customers come in and see you like this?\" </p>\n<p>\"I'm in love,\" Childe cries louder.</p>\n<p>Signora only huffs, disinterested. \"As I said, don't get snots all over my flowers,\" she orders.</p>\n<p>Signora goes to the music player and plays an upbeat, ridiculously happy song.</p>\n<p>Childe hates her.</p>\n<p>--</p>\n<p>The children are there again. There's no new sibling in sight this time so Childe concludes that there are only five of them. </p>\n<p>But they're not alone. Xiao and Menogias are pulling along an adult with them as they enter the shop. </p>\n<p>The rest of the kids are happily running into the shop, carefully passing by the familiar man as not to run into him.</p>\n<p>Childe blinks. Oh. </p>\n<p>\"You're the father,\" Childe whispers. His eyes fall on the pretty man with pretty eyes and a pretty smile. </p>\n<p>The man glances up at Childe and he nods graciously at the florist.</p>\n<p>\"Mister Orange, we brought bàba this time! He caught us sneaking,\" Xiao says with a smile, still holding his father's hand. And for someone whose big secret is exposed, Xiao seems happy about it. </p>\n<p>Menogias lets go of the pretty man's hand and curls closer to him, seemingly content just being close to their father.</p>\n<p>The pretty man gently pulls his other hand from Xiao's tiny hold. </p>\n<p>The man then does a hand sign and his children stare at him intently. Whatever the man has informed his children, they merely pout in response.</p>\n<p>The pretty man makes a gesture as if he's trying to stifle a laugh.</p>\n<p>\"We were gonna pay back mister Orange, bàba! But we don't have mora!\" Xiao defends himself. </p>\n<p>Childe tries to hide his smile.</p>\n<p>The man signs something again. Xiao gasps and Bonanus laughs. </p>\n<p>\"That's what I told them, bàba!\" Bonanus laughs some more.</p>\n<p>Childe is lost but the atmosphere is light. Tender. So he stays quiet, watching the interaction.</p>\n<p>Chile has a big family. And his older siblings have married and so Childe has several nephews and nieces. </p>\n<p>Whenever he spends time with his family, laughter and joy accompany them. It's a large family, living in an equally large home. Strong and steady. So very bright.</p>\n<p>But when Childe looks at Xiao's family, it seems a little bit broken but the affection is firm; infinite, and soft. And their father is the core of that affection, holding everyone together.</p>\n<p>It's a precious sight. </p>\n<p>Childe keeps staring until the man looks at Childe again. He smiles and Childe's heart curls.</p>\n<p>The man talks through his smiles and his eyes.</p>\n<p>He fishes for something in his pocket. A small device. He types on it before he shows the screen to Childe.</p>\n<p>\n<em>'I'm Zhongli. It's good to finally meet my mysterious florist. I've been looking all over you.'</em>\n</p>\n<p>Childe glances at Zhongli. The other is beaming at him.</p>\n<p><em>Zhongli.</em> Childe tastes the name on his mouth, liking how the syllables fit on his tongue. </p>\n<p>\"Zhongli,\" Childe mutters. \"Zhongli,\" he says again. His tone is reverent. His eyes are soft. </p>\n<p>The children are looking at him strangely. Especially Xiao.</p>\n<p>\"Nice to meet you then, Zhongli. I'm Ajax but I prefer to be referred to as Childe.\" Childe's lips quirk. </p>\n<p>Zhongli nods at him. He pulls for something again. This time, he plucks for his wallet and Childe instantly knows what Zhongli is planning to do.</p>\n<p>\"Zhongli,\" Childe begins, \"You don't have to pay for the flowers. It's fine.\"</p>\n<p>Zhongli shakes his head, gesturing for Childe to wait. He opens his wallet slowly, stops, and stares oddly at the object in his hands. </p>\n<p>\"Oh, bàba, you forget your mora again?\" Indarias asks casually.</p>\n<p>And Zhongli? Zhongli flushes so prettily. The red hue reaches the tips of his ears and Childe wants nothing else but to peck those adorable ears.</p>\n<p>Childe is <em>definitely</em> going to die.</p>\n<p>--</p>\n<p>Zhongli invites Childe to their residence to join them for dinner as payment instead despite Childe's incessant assurances that Zhongli doesn't owe him anything.</p>\n<p>Zhongli <em>insists</em>. His children <em>insist</em>. Childe is outnumbered.</p>\n<p>So here he is, in front of the door, standing anxiously while he fixes the collar of his shirt and makes sure his narwhal hair clip is properly clasped. </p>\n<p>In his other hand, Childe is holding a bouquet of neatly wrapped white camellias and gardenias.</p>\n<p>He tries not to overdress but Childe wants to impress Zhongli so bad and yet at the same time he thinks <em>what if I'm too forward? What if I'm being obnoxious?</em> </p>\n<p>This is ridiculous. Childe has had crushes in the past but this is the first time where he's genuinely invested in trying to impress someone that he barely even knows.</p>\n<p>Childe clears his throat. He's about to press the bell when someone opens the door. </p>\n<p>It's Zhongli. And oh fuck, he’s beautiful with his long hair loose.</p>\n<p>The man blinks at him, smiles, and opens the door wide for Childe to enter.</p>\n<p>Behind Zhongli, Menogias grins. \"See, bàba? I told you! I heard mister Orange coming,\" Menogias excitedly chirps. </p>\n<p>Zhongli ruffles his kid's hair. Menogias runs into the living room. Childe gets in and Zhongli softly shuts the door behind him.</p>\n<p>\n<em>'Shall we?'</em>\n</p>\n<p>Zhongli asks with his device.</p>\n<p>Childe's eyes soften. He gives Zhongli the bouquet. The man seems surprised by the gesture before he gingerly takes it from Childe and tucks it close to his chest. </p>\n<p>Zhongli inhales the flowers once, the white petals touch his skin, as he admires the bouquet fondly.</p>\n<p><em>'Thank you'</em>, Zhongli types. </p>\n<p>Childe gives Zhongli's hand a fleeting touch. Neither pressing nor grazing, just a brief pat.</p>\n<p>Like before, the heat from Zhongli's skin stays on Childe's hand.</p>\n<p>--</p>\n<p>Somehow, a friendship blooms between Childe and Zhongli. They exchange numbers after the first dinner. </p>\n<p>Afterward, Zhongli continues to invite him until it becomes a weekly ritual for Childe to have dinner with Zhongli and his children every Sunday. </p>\n<p>It helps that the children still come to visit Childe whenever they can, still buying flowers for their father. Except, this time, Zhongli has prepared mora for his children to spend.</p>\n<p>It's not necessary but Childe appreciates it regardless.</p>\n<p>However, the best gift is when Zhongli comes to visit and he just sits there, listening to Childe talk, letting the songs from the music player encase the precious moment.</p>\n<p>--</p>\n<p>Weeks pass. They text each other whenever they can. </p>\n<p>Childe learns that Zhongli is a history professor. Although mute, Zhongli loves his job and so he learns to adapt despite the unavoidable complications. </p>\n<p>He also shows aversion to seafood but exhibits a boundless fascination for antiques and other various collectibles.</p>\n<p>Zhongli learns that Childe has a ridiculously large family, his family’s wealth comes from old money, and that Childe has a degree in biotechnology. </p>\n<p>\"Being a florist is just a hobby. I'll aim for a bigger job later when I've had enough of a quiet life,\" Childe says smoothly. Zhongli only blinks at him, amazed. Childe smirks.</p>\n<p>\"I'm smarter and durable than I look, you know?\" Childe teases.</p>\n<p>Zhongli only ruffles Childe's hair in response, careful to avoid his favorite hair clip.</p>\n<p><em>'I know'</em>, Zhongli types.</p>\n<p>--</p>\n<p>Months pass.</p>\n<p>Childe is at Zhongli's place. It's already late but Childe makes no motion to leave just yet. </p>\n<p>They huddle on the sofa together. Childe, Zhongli, and the children.</p>\n<p>Xiao and Menogias are leaning against Childe's side, snoring. Comfortable. </p>\n<p>Next to Childe, Zhongli sits close to him, brushing Bonanus' hair as the child sleeps on Zhongli's lap while Bosacius and Indarias sleep on the farthest side of the sofa, limbs stack on top of one another with Childe’s jacket covering their tiny bodies.</p>\n<p>There's a muffled sound coming from the television but no one is paying attention anymore.</p>\n<p>Zhongli's eyes are fond, imbued with monumental affection as he gazes at his sons and daughters. And Childe is transfixed by Zhongli's love. He keeps looking at the other man. Utterly besotted like the idiot he is.</p>\n<p>Zhongli must have felt Childe's stare. He turns around to look at Childe and the florist blushes, embarrassed at being caught staring.</p>\n<p>Zhongli hides a grin behind his fist. Childe's eyes twitch at that.</p>\n<p>\"Hey, come on, stop teasing me.\" Childe pouts, poking Zhongli's cheek. Xiao stirs. Okay, less rough movement. Childe gently places his hand on Xiao's hair, running his fingers through the soft locks to lull Xiao back to slumber.</p>\n<p>The little boy mumbles quietly. After a moment, Xiao nuzzles his cheek against’s Childe’s arm and slowly goes back to sleep.</p>\n<p>\"That was a close one, huh?\" he whispers to Zhongli. Blue eyes twinkle. It takes a moment for Childe to realize that Zhongli has been watching him the whole time. When Childe finally catches him staring, Zhongli's eyes widen before he hastily throws his gaze away, flushing.</p>\n<p>\n<em>What was that about?</em>\n</p>\n<p>A gentle tune flows from the screen. Outside, it's starting to rain. Inside, the warmth lingers in the air. It touches the whole room.</p>\n<p>Zhongli taps his shoulder. Childe quickly looks at him.</p>\n<p><em>'It's late. Why don't you sleep here for the night? There's a guest room you can use.'</em> Childe reads the words on the device.</p>\n<p>He ponders for a moment before Childe finally nods. Zhongli smiles. He closes his eyes and rests his head on Childe's shoulder. <em>Just a little bit longer</em>, his gesticulation says.</p>\n<p>Their shoulders bump and Childe thinks himself stupid but he can't stop chasing after Zhongli.</p>\n<p>He's hopeless.</p>\n<p>--</p>\n<p>More months pass.</p>\n<p>Childe buys Zhongli a gift. A jade hairpin. He slips it gently in Zhongli's hair and when Childe backs away, Zhongli is looking at him - his eyes are clear, bright. </p>\n<p>Zhongli runs his thumbs under Childe's lower lip like he's trying to feel the curve of Childe's smile on his skin. Like Childe is not the only one who's in love with someone's smile.</p>\n<p>Childe reaches out to touch the stray locks on Zhongli's face, tucking them behind his ear. His heart is loud. A wave after another wave of endearment. It’s almost choking.</p>\n<p>\n<em>I’m really really in big trouble now.</em>\n</p>\n<p>Childe grins. \"Your hair is messy.\" Childe removes his hand, brushes the tips of his fingers along Zhongli's cheek, and his heart almost explodes when Zhongli leans a little bit closer into his palm.</p>\n<p>The other gives Childe a strange look.</p>\n<p>Childe quickly pulls his hand away, clearing his throat. \"You know, one of these days I'm going to plant a whole garden of flowers in your hair if you continue to be adorable like that,\" Childe teases helplessly.</p>\n<p>Zhongli bites his lower lip as if he's trying to muffle a peal of laborious laughter but that's impossible now. He's never going to hear Zhongli's voice but that's fine. Childe loves Zhongli as he is with his whole heart. Even the scar he's afraid to show to Childe. </p>\n<p>Childe wants to be tender to Zhongli for as long as he lives. He wants to keep him safe, keep him happy.</p>\n<p>Silly thoughts. Zhongli is more than capable of taking care of himself.</p>\n<p>Still, Childe is a hopeless idiot and he's very, very, very much in love with Zhongli and there's nothing wrong with wanting to give the person you love the entire world. </p>\n<p>Even the whole damn universe if Zhongli so much asks for it.</p>\n<p>Who says he can't do it?</p>\n<p>--</p>\n<p>Things go on and on like that. Time passes, music changes, Childe's heart grows.</p>\n<p>Zhongli's presence is constant in Childe's life.</p>\n<p>--</p>\n<p>\"I can’t believe you haven't confessed to him yet. I’m so sick of watching you mope like a beaten puppy.\" Signora sneers.</p>\n<p>\"He's out of my league,\" Childe deadpans.</p>\n<p>\"Everyone's out of your league. Just ask him out,\" Signora says plainly.</p>\n<p>\"Are you trying to make me feel better or worse? I can't really tell.\"</p>\n<p>\"Oh, Childe. An attempt to cheer you up? Why I'd never stoop so low.\"</p>\n<p>\"Bitch.\"</p>\n<p>\"Ass.\"</p>\n<p>--</p>\n<p>It's snowing outside. </p>\n<p>Childe can't believe Signora still wants him to open the store in this kind of weather. There are barely any people outside. </p>\n<p>Everyone's probably at their homes, drinking hot cocoa and covering themselves in a thick blanket. </p>\n<p>Childe's the only one here who has to suffer alone. Unfair. Childe pats his narwhal hair clip dramatically to ease his torment.</p>\n<p>Who the hell wants to buy flowers in this cruel weather anyway? An idiot, that's who.</p>\n<p>The bells chime. Zhongli comes in abruptly.</p>\n<p><em>'I want to buy flowers,'</em> he types. Zhongli smiles at Childe. </p>\n<p>Childe coos inwardly. That's adorable.</p>\n<p>Zhongli's cheeks and nose are red. Even the tips of his ears are flushed from the cold. Tucked in his overly thick scarf and fluffy brown long coat, Zhongli looks smaller than usual. Childe wants nothing else but to kiss the man silly.</p>\n<p>\"Okay then. Flowers.\" Childe hums, indulging Zhongli's wish. \"Any specifics?\"</p>\n<p>Zhongli taps his finger on his chin. Childe chuckles. Zhongli's children inherit so many of their father's habits. </p>\n<p>Zhongli types in. <em>'Salvia. Aster. Camellia, pink. Tulip, red. Tulip, yellow. Chrysanthemum, red. One of each. Cut the stems short. No wrapper. Please and thank you, Childe.'</em></p>\n<p>An odd request. But it's Zhongli and Zhongli has always been an odd one and Childe loves him regardless of it. </p>\n<p>The florist smiles. He takes Zhongli's hand in his and pecks the knuckle tenderly. \"Got it. Your wish is my command.\" Childe winks, saluting playfully with two fingers.</p>\n<p>Zhongli only beams softly. He waits. </p>\n<p>Childe cuts the stems and arranges the flowers. He hums to the song. Across him, Zhongli leans on the desk as he observes Childe working; content to simply watch the florist.</p>\n<p>The music changes. It plays another song. The lyrics echo - <em>I think I've figured it out, finally found the reason why I keep you around</em> and it repeats and repeats until Childe unconsciously sings along to the lyrics; eyes still on the flowers in his hands, head bobbing.</p>\n<p>Once he's done, Childe glances up to see Zhongli regarding him intently. A rare spark of mischief lit up in his eyes.</p>\n<p>\"What?\" Childe gives him a bewildered blink. </p>\n<p>Zhongli beckons Childe to him. The florist puts down the snipping tool before he goes to Zhongli's side, curious. </p>\n<p>Zhongli removes his shoes with ease and Childe sputters, flailing his arms aimlessly. \"Zhongli, what are you doing? Keep your shoes on!\"</p>\n<p>Zhongli only grins. He tugs Childe closer to him. Even more closer now as Zhongli steps barefooted on Childe's shoes and Childe can't help but laugh. </p>\n<p>They're so close. Childe can smell the scent of strawberry from Zhongli. </p>\n<p>\"What are you planning now? What's your evil masterplan?\" Childe prods playfully. </p>\n<p>Zhongli guides one of Childe's hands to his waist before Zhongli settles his hand on Childe's shoulder. Then Zhongli offers his other hand. Childe doesn't hesitate to take it. </p>\n<p>They slot their fingers together. One by one. Skin touches. Noses bump. And breaths mingle. Their eyes find each other. Aspectabund.</p>\n<p>Childe refuses to allow even a gap between them. He greedily embraces Zhongli closer to him. <em>Dance with me.</em></p>\n<p>The song flows. A tune that walks upon the air. The lyrics float. A promise in their ears. </p>\n<p>Childe moves and Zhongli follows. They dance together, move as one, in sync. Childe turns and turns and Zhongli clings and lets Childe guide him along. Where Childe goes, Zhongli follows. His gaze never falters from Childe. </p>\n<p>Childe playfully spins the other under his arm before he catches Zhongli's waist and they resume their dance once more; his bare feet delicately pressing on Childe’s shoes. Childe laughs, heart soars at the silliness of it all, at the affection he feels for Zhongli.</p>\n<p>Zhongli tucks his face on Childe's shoulder when he can’t contain his joy anymore; it spills from his eyes, pours from his skin. Light and free as if Zhongli wants to imprint the shape of Childe’s smile in his soul.</p>\n<p>Childe takes what he can as he's drowned by Zhongli's scent. </p>\n<p>Gold. White. Multicolored everywhere. The flowers guide them as they dance in the flower shop. Amber and molten blue. Their steps remain the same and the rhythm doesn't get faster or slower. </p>\n<p>Just the two of them, trapped in this bubble of time.</p>\n<p>When the song ends, their dance ends. But Childe doesn't let go of Zhongli. Instead, he scoops Zhongli into his arms easily - Zhongli makes a startled muted noise - and settles the man down on the corner of the desk. </p>\n<p>Zhongli tries to hide his face under his fluffy scar, his ears red. Childe doesn't let Zhongli hide away from him. </p>\n<p>He gently tips Zhongli's chin up with his fingers. Their eyes meet and Childe slides between Zhongli's thighs, putting his hands on Zhongli's knees as he looks at the other. </p>\n<p>Zhongli only tilts his head, waiting - giving Childe the privilege to do as he pleases. </p>\n<p>Childe wants to take it.</p>\n<p>\"Tell me what you're thinking,\" Childe says softly. Zhongli seems to hesitate but a moment later, he pulls out a familiar device and begins to type something. Then he shows it to Childe, still just as hesitant.</p>\n<p>\n<em>'I want to kiss you. I've imagined kissing you before and even now I want to kiss you still, Childe.'</em>\n</p>\n<p>Childe smiles. He brushes his thumb along Zhongli's jaws. \"Oh, okay. Good.\"</p>\n<p>Zhongli blinks, astonished by his words and it makes Childe's chest ache. He wants to cherish Zhongli all the more.</p>\n<p>\n<em>'Truly?'</em>\n</p>\n<p>\"Yes. Now you don't need to imagine it anymore. You can kiss me for real this time,\" Childe assures him. Zhongli can kiss him as many times as he wants.</p>\n<p>Zhongli's eyes soften as he looks at the device in his hand before he puts it away. He turns around and picks all the flowers strewn on the desk. The ones Childe has cut for him.</p>\n<p>He tucks the salvia into Childe's hair. Childe quiets down, curious.</p>\n<p>Zhongli slips the aster and the pink camellia into Childe's hair as well. The red tulip follows, then the yellow tulip, and finally the red chrysanthemum. All the flowers form into a small flower crown. The petals flutter in Childe's hair. </p>\n<p>\n<em>I love you. I think of you. I love your smile.</em>\n</p>\n<p>Zhongli cups Childe's cheeks and leans down to kiss him. <em>Finally</em>. The touch is shy, ghosting only. Unsure.</p>\n<p>Childe's heart clenches at that. He surges forward to return the kiss lightly. Childe wraps his arms around Zhongli's waist as he brings him closer until Childe is sure nothing in this world can take Zhongli away from him. </p>\n<p>His lips taste of honeyed tea, of something that's purely <em>Zhongli</em>, and Childe <em>wants</em> so badly. </p>\n<p>\"Me, too,\" he whispers adoringly once they part. Childe kisses Zhongli's forehead. Takes both of Zhongli's hands in his and kisses the knuckles again and again. \"I love you, too,” he confesses.</p>\n<p>Zhongli rewards Childe with that precious smile of his.</p>\n<p>Childe is not letting go of this man ever.</p>\n<p>He's going to marry the fuck out of Zhongli.</p>\n<p>--</p>\n<p>\"Mister Orange, did you kiss bàba?\" Menogias asks.</p>\n<p>Childe grins. \"I did. Many times.\"</p>\n<p>The children gasp. Especially Xiao. Then the little boy pulls out his favorite dragon fluff toy and wields it like a sword.</p>\n<p>The rest of his siblings mimic Xiao's movement, raising their own favorite fluff toys. </p>\n<p>Childe squints, sensing the danger he's in. He rolls from the couch and grabs one of the futons and lifts it like a shield.</p>\n<p>\"You can't just kiss bàba! You have to defeat us first before you get to kiss bàba!\" Xiao declares boldly.</p>\n<p>\"Yeah!\" Indarias and Bosacius cry out.</p>\n<p>Bonanus glares at Childe, looking absolutely betrayed. \"You tractor!\" Bonanus angrily yells.</p>\n<p>\"It's traitor!\" Bosacius corrects.</p>\n<p>\"I gave you kids those flowers and this is how you repay me?\" Childe whines.</p>\n<p>\"That's different! Bàba is more important than all the flowers! Prepare, mister Orange, we're gonna take your narwhal hair clip away!\" </p>\n<p>Xiao lets out an adorable battle cry as he rushes onward. Xiao’s brothers and sisters jump from the sofa and follow after their youngest brother.</p>\n<p>\"Okay, kids, there's no need to be-- ow! Ack! Hey, this is bullying!\" Childe cries out as the children gang up on him and start beating him up with their fluff toys. </p>\n<p>\"Zhongli, your kids! They-- ow! Help!\" Childe miserably begs as the onslaught persists.</p>\n<p>In the kitchen, Zhongli ignores his children and his boyfriend's antics as he happily continues preparing dinner. Their home is loud and warm and it will stay loud and warm for a long, long time.</p>\n<p>--</p>"
}