{
  "id": "29204748",
  "url": "https://archiveofourown.org/works/29204748?view_full_work=true",
  "author": [
    "pqrker"
  ],
  "title": "percy jackson and the scrutiny of his coworkers",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "F/M",
    "Gen"
  ],
  "fandoms": [
    "Percy Jackson and the Olympians & Related Fandoms - All Media Types"
  ],
  "relationships": [
    "Annabeth Chase/Percy Jackson",
    "Percy Jackson & Original Character(s)"
  ],
  "characters": [
    "Percy Jackson",
    "Annabeth Chase (Percy Jackson)",
    "Original Characters"
  ],
  "additional_tags": [
    "POV Outsider",
    "my mom made me write this",
    "I wish I was kidding",
    "Marine Biology",
    "Marine Biologist Percy Jackson",
    "Camp Half-Blood (Percy Jackson)",
    "Camp Jupiter (Percy Jackson)",
    "New Rome (Percy Jackson)",
    "Minor Annabeth Chase/Percy Jackson",
    "Percy Jackson is a Dork",
    "Adult Percy Jackson",
    "do i know what im doing?",
    "No I dont",
    "Percy Jackson References",
    "percy has been banned from every seaworld on earth",
    "i have no idea how marine biology labs work",
    "im bullshitting through this entire thing",
    "percy spins the beads on his necklace because i do the same thing",
    "Percy Jackson is a Mess",
    "percy jackson is a bad liar",
    "gratuitous barbie in a mermaid tale references"
  ],
  "language": "English",
  "series": "",
  "published": "2021-02-04",
  "completed": "2022-06-07",
  "words": "6,405",
  "chapters": "6/6",
  "comments": "627",
  "kudos": "11,136",
  "bookmarks": "2,318",
  "hits": "95,051",
  "summary": "<p>Jim turned back to the tank and looked at Marcie the seal, who was now staring at the spot his coworker had been standing just moments before with that same strange look of reverence in her eyes.</p>\n<p>Percy Jackson truly was the oddest person Jim Elpool had ever worked with.</p>\n<p>or</p>\n<p>5 times percy's coworkers were confounded by his fish magic, plus 1 time they try to figure it out</p>\n<p>Melody stared through the tank’s slightly fogged glass and into the water, admittedly a little in awe.</p>\n<p>They had walked in on their coworker playing with the small blue shark some 30 minutes ago in his goggles and wetsuit, that ballpoint pen he was weirdly attached to still somehow in his pocket even as he swam around under the water. His old beaded necklace floated loosely around his neck.</p>\n<p>The strangest thing?</p>\n<p>He didn’t have an oxygen tank on.</p>\n<p>Ciara had spent her whole life learning about animals in her spare time. Ever since she was a child, she would pour over her National Geographic magazines and read until her eyes were swimming with scientific names, fun facts, and any other tidbit of knowledge she could get her hands on. She knew their diets, their habitats, their behaviors. </p>\n<p>She knew which animals were friendly, which ones were aggressive, which ones were just curious, and which ones were scared.</p>\n<p>But she had never seen one seem so starstruck.</p>\n<p>“New Rome University is a private university in New Rome, California, founded in the late 1600s, graduation rate 100%... acceptance rate .5%?” He read off the screen, his face scrunching up in confusion towards the end of the sentence.</p>\n<p>Melody leaned over his shoulder and raised an eyebrow, “That’s oddly specific, isn’t it?”</p>\n<p>“Very. Where even is New Rome? I’ve never heard of the town either.”</p>\n<p>Melody hummed in agreement and Marcus typed something new in.</p>\n<p>The duo blinked in surprise when the results loaded.</p>\n<p>“It’s… blank.”</p>\n<p>Waves.</p>\n<p>Normally, Elaine Rudolph absolutely adored them. Crashing down gently on the sand, making calming noises and leaving soft seafoam in their wake. She truly loved them.</p>\n<p>Right now, however, as she was being tossed around and trapped beneath them, she did not.</p>\n<p>or</p>\n<p>percy seems to be immune to waves. no matter how rough or unforgiving they were, they just seemed to break around him</p>\n<p>Everyone blinked at Melody.</p>\n<p>“Alright, I rescind my earlier statement. We’re gossiping about Percy while he’s gone, and it is totally moral and okay because he’s fucking weird. Agreed?” Marcus announced, throwing his hands up in exasperation.</p>\n<p>Everyone around the table nodded with varying degrees of enthusiasm. Truth be told, nobody really knew much about Percy, other than his spooky ability to seemingly telepathically communicate with animals and his love for his wife. Everybody was at least a little bit curious.</p>\n<p>or</p>\n<p>while percy is out, his coworkers compare notes on his suspicious actions</p>",
  "notes": "<p>word count: 850<br>howdy, my name is parkington but you can call me parker, and i'm the author of this fic. i am so sorry for the dumbassery i am about to inflict upon you<br>also, the entire pool area description is based off the memorial university of newfoundland's seal facility so if it's inaccurate then blame them</p>\n<p>(chapter based off that one tumblr post)</p>\n<p>word count: 721<br>i have no fucking clue how marine biology labs are set up so please bear with me here</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>melody is so fun to write,, i love them so much</p>\n<p>word count: 1,026<br>i wrote and edited this in 2 hours lateat night so i'm sorry if it sucks<br>chapter title from that one tumblr post about centipedes</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>i miss gene who is french fries and is also critically acclaimed</p>\n<p>word count: 1,046<br>for legal reasons the title is a joke (fr pay attention in class or you'll be sitting alone in your room writing fanfiction for a series that's 15 years old)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">more notes</a>.)\n</p>\n<p>most of writing this chapter was spent feverently googling colleges with good marine biology courses</p>\n<p>EDIT: unfortunately, my digital communications teacher, whom marcus was named after, has passed away as the result of a fatal car accident. thank you, mr. coyner. you were a good man and a great teacher. may his soul rest in peace.</p>\n<p>TRIGGER WARNING: this chapter features a character being held underwater by turbulence and mentions of drowning. nobody dies, but if you are sensitive to this subject, please do not read.</p>\n<p>word count: 1,070</p>\n<p>sorry i forgot to update for uh *checks watch* nearly 3 months. oops.<br>but! next chapter is the final chapter! and then i'll be writing a spinoff oneshot that a reader suggested!<br>this entire plot came from one 30 second clip of footage from a shark documentary i was watching a while ago lmao</p>\n<p>anyways i listened to marina an unhealthy amount of times while writing this</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">more notes</a>.)\n</p>\n<p>spoiler alert: percy's \"\" explanation \"\" was just a lot more vague and awkward lies</p>\n<p>[word count: 1,680]</p>\n<p>*enters with a bad powerpoint animation almost a year later wearing shutter shades and drinking a slurpee* hello</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">more notes</a>.)\n</p>\n<p>the end!</p>\n<p>yeah this isn't my favorite chapter lmao,,, but it does its job so i can't complain!!!<br>(and yes ciara and elaine are def dating)</p>\n<p>moving on, this fic has been published for *checks watch* 487 days? and some of you guys have been here for every single one of em!!! yall get good noodle stars mwah<br>a lot of yall also came from that tiktok rec from last june and i love yall so much too!! i love everybody who's ever commented, gave kudos, read a chapter or two, or even just chuckled at the tags and moved on!!</p>\n<p>as per tradition, i leave you with my <a href=\"https://open.spotify.com/playlist/7FuMcfJiYdp2BZBswXoGtI\" rel=\"nofollow\">percy jackson playlist</a> (there's also a playlist for the first 13 cabins as well as a few other characters if you feel like digging around my account) and bid you ado.</p>\n<p>my name is parkington, please call me parker, and i, the very un-noble author, have officially shut the door on this work. that's all, folks.</p>",
  "text": "<p>A series of pitiful chirps and trills echoed around the area, coupled with the sound of softly splashing water from the pool at the far end of the deck. </p>\n<p> </p>\n<p>A man stood at the side of the pool, watching the young harbor seal swim idly in circles, its cries continuing as it spiralled. His lips were pressed into a thin line and dark brown eyebrows knit together in confusion as he stared on at the animal.</p>\n<p> </p>\n<p>The seal had been crying by itself for the past two days and very rarely stopping. Whether it be a few sad wimpers or the full blown sob-fest that was going on now, it always seemed to be crying in some way. It cheered up a little whenever one of the staff would come by to feed it or check up on its injuries, but it was very upset the rest of the time.</p>\n<p> </p>\n<p>Jim’s research team had various theories as to what was making it so sad, but none of them had really been able to prove or disprove what they thought thus far.</p>\n<p> </p>\n<p>There was only one person Jim could really think of that would be able to calm it down, but he had no idea where he was or how he would even be able to figure out what was going on-</p>\n<p> </p>\n<p>A distant set of footsteps from behind startled him and stole his attention away from the seal and his own thoughts. He turned his back to the pool and saw the side profile of a familiarly exhausted and brooding face with sea green eyes and a mop of messy black hair passing by the main building's open back door.</p>\n<p> </p>\n<p>Bingo.</p>\n<p> </p>\n<p>“Oy, Jackson! Care to help me with something?”</p>\n<p> </p>\n<p>If anyone on planet Earth could figure out what was wrong with the poor seal, it would be none other than Percy Jackson. Jim had only known the team’s biologist a short while, but the guy was incredible when it came to animal's emotions. As long as it was from under the sea, he could tell you anything and everything about it.</p>\n<p> </p>\n<p>It almost scared Jim how accurate he was sometimes, but he was afraid he would sound a little crazy if he ever admitted to it. </p>\n<p> </p>\n<p>Percy jogged over to Jim, although his focus seemed to be more on the seal behind him than the person he was supposed to be helping. His brows were furrowed and he had a small frown, like he already knew something was wrong. </p>\n<p> </p>\n<p>Jim chalked it up to Percy just being smart enough to know that that a seal crying nonstop was, in fact, not good, although he could never really be sure with him.</p>\n<p> </p>\n<p>“What’s up? Is there something wrong with Marcie?” Percy asked, his concern very evident in his voice.</p>\n<p> </p>\n<p>Jim opened his mouth to respond, but hesitated. “Marcie?”</p>\n<p> </p>\n<p>Percy nodded his head towards the seal, who’s crying and circling had stopped and was now staring at him, looking rather awestruck for a seal.</p>\n<p> </p>\n<p>“That’s the seal. Is she okay?” He asked again.</p>\n<p> </p>\n<p>Jim blinked lamely. Apparently Percy also had a thing for naming animals before anyone else could. Go figure.</p>\n<p> </p>\n<p>“Well, she stopped right as you came over, but she’s been crying ever since we rescued her. I know you’ve kinda got a sixth sense when it comes to animals, so I was hoping you could figure out what’s been making her so upset.”  He said slowly.</p>\n<p> </p>\n<p>Percy nodded and stepped a little closer to the pool and stared at the seal for maybe 3 seconds before coming to an apparent conclusion. </p>\n<p> </p>\n<p>“She’s lonely.”</p>\n<p> </p>\n<p>“What? But you didn’t even-”</p>\n<p> </p>\n<p>“I said she’s lonely, Jim.” Percy repeated resolutely, as if that explained everything. </p>\n<p> </p>\n<p>Jim just stared at him.</p>\n<p> </p>\n<p>“She had a little seal boyfriend or something back home, and she misses him and her friends. She was on her way to lunch with her sister when she got hurt and we picked her up. Probably.” Percy deadpanned.</p>\n<p> </p>\n<p>Jim was confused, to say the least. He knew Percy was smart. He knew Percy was amazing with animals. He also knew that it was physically impossible for Percy to be able to figure out what the seal was feeling that instantaneously. However, Jim didn’t get to point all this out before the man beside him turned and walked back towards the building he had come from.</p>\n<p> </p>\n<p>“I’ve gotta go finish looking over Elaine’s coral photos with her, but let me know if Marcie has any other problems. And maybe see if she’ll get along with one of the other seals, unless you’re a fan of her twenty four-seven crying.” Percy called over his shoulder.</p>\n<p> </p>\n<p>“Um,” Jim said eloquently, “Are you sure?”</p>\n<p> </p>\n<p>“Yep,” Percy replied brightly, popping the P before disappearing back into the building.</p>\n<p> </p>\n<p>Jim turned back to the tank and looked at Marcie the seal, who was now staring at the spot his coworker had been standing just moments before with that same strange look of reverence in her eyes.</p>\n<p> </p>\n<p>Percy Jackson truly was the oddest person Jim Elpool had ever worked with.</p>\n<p> </p>\n<p>Melody Hargrove considered themself a rather smart person.</p>\n<p> </p>\n<p>They were the head researcher at a New York City marine biology lab, got their masters in oceanography and biology at Duke University a year ahead of time, and did it with flying colors, mind you. They were logical and to the point, always there with an explanation or an idea for something. If they didn’t know the answer to a question, they would turn up the next day with encyclopedic knowledge on the topic, the result of long nights tunnel visioning on Wikipedia articles. </p>\n<p> </p>\n<p>The point is, they knew a lot of things. One of those things was how long the average person could hold their breath while underwater. About a minute and a half, maybe two minutes, depending on the person. The world record was for 24 minutes and 3 seconds. No one had ever surpassed it.</p>\n<p> </p>\n<p>To be honest, Melody didn’t think anyone <em> could </em>surpass it. At least not without causing serious lung issues.</p>\n<p> </p>\n<p>So how the hell had Jackson been under there so long?</p>\n<p> </p>\n<p>Melody stared through the tank’s slightly fogged glass and into the water, admittedly a little in awe.</p>\n<p> </p>\n<p>They had walked in on their coworker playing with the small blue shark some 30 minutes ago in his goggles and wetsuit, that ballpoint pen he was weirdly attached to still somehow in his pocket even as he swam around under the water. His old beaded necklace floated loosely around his neck.</p>\n<p> </p>\n<p>The strangest thing?</p>\n<p> </p>\n<p>He didn’t have an oxygen tank on.</p>\n<p> </p>\n<p>So maybe Percy was a little weird. Melody knew that, as did everyone else at the lab. He could figure out what was up with an animal in a split second and could name them even faster. Hell, he would even make up elaborate backstories for them. Sometimes he’d come into work with long scratches up and down his body while stuffing something that looked like lemon bars into his mouth, muttering angrily in a language that sounded vaguely Greek. Nobody had figured that one out yet.</p>\n<p> </p>\n<p>But that weirdness didn’t explain his sudden gaining of mermaid powers, or whatever else was going on here. </p>\n<p> </p>\n<p>Actually, what <em> was </em> going on here?</p>\n<p> </p>\n<p>Snapping back to reality, Melody strode forward and tapped their nail against the glass of the tank.</p>\n<p> </p>\n<p>Percy whipped around to face them, startling the shark he had been animatedly playing with as a few bubbles escaped his mouth.</p>\n<p> </p>\n<p>Melody gave him the universal <em> what the hell? </em>sign with their hands and motioned for him to come back up to the surface.</p>\n<p> </p>\n<p>Percy gave a gentle pat to the shark like it was a puppy, and turned and swam up to the top of the tank.</p>\n<p> </p>\n<p>The second he broke the water’s surface, Melody was standing over him despite their drastic height difference, an incredulous look on their face.</p>\n<p> </p>\n<p>“Hey! Merliah Summers! How the fuck did you <em> do </em>that?” Melody exclaimed, offering a hand to help him out.</p>\n<p> </p>\n<p>Percy blinked. “Did you just make a Barbie movie reference?”</p>\n<p> </p>\n<p>“Did you just understand it?”</p>\n<p> </p>\n<p>“Of course I did, I’m not uncultured. Mermaid Tale is a great movie.”</p>\n<p> </p>\n<p>“Good. Now answer me.”</p>\n<p> </p>\n<p>Percy hoisted himself out of the water and rolled one of the beads on his necklace between his thumb and his index finger, which Melody assumed was a nervous habit.</p>\n<p> </p>\n<p>“I… don’t know what you’re talking about.”</p>\n<p> </p>\n<p>Or a lying tell.</p>\n<p> </p>\n<p>Melody raised an eyebrow. “You know, the whole ‘staying underwater for 45 minutes with no oxygen mask’ thing? I’m pretty sure you’re smart enough to know that’s not normal.”</p>\n<p> </p>\n<p>Percy dropped his necklace. It was definitely a lying tell. “Right. That.”</p>\n<p> </p>\n<p>“Well?”</p>\n<p> </p>\n<p>“Well, uh, the thing is, I was coming up for air every 2 minutes or so, so I wasn’t actually- um, yeah. I was breathing. Air. No big deal.” He stammered out.</p>\n<p> </p>\n<p>Melody sighed inwardly. They could tell their coworker was definitely lying and was not going to give up the truth easily, but they saw no reason for him to be making up a story about how he had managed to stay underwater without drowning. Was he just embarrassed about his unusually strong lungs or something?</p>\n<p> </p>\n<p>“Yeah, alright, fine. Just let me know the next time you decide to act like a mermaid, fishboy, so I can accurately time it.” They teased.</p>\n<p> </p>\n<p>Percy’s face broke into a sly grin. “Will do.”</p>\n<p> </p>\n<p>In her several years as a diver for a New York City marine biology center, Ciara Mera had never seen animals interact in such a way as they did with Percy Jackson.</p>\n<p> </p>\n<p>They were always so oddly playful. A few of the more childish and bubbly animals acted like they had just seen their idol when he came to check on them. The ones who seemed to have made it their personal mission to make every worker at the lab’s life hell treated him with a sort of begrudging respect. </p>\n<p> </p>\n<p>But never, ever, ever did they get aggressive with him. </p>\n<p> </p>\n<p>She expected that accidentless streak to end within the next few minutes.</p>\n<p> </p>\n<p>Ciara had seen the whitetip shark approaching her coworker, who was currently bobbing around calmly in the waves, and immediately went into a mixture of fight or flight and being incredibly thrilled at seeing what they had come here for so close to them.</p>\n<p> </p>\n<p>“Percy! Whitetip incoming! Doesn’t look too happy either!” </p>\n<p> </p>\n<p>Given their reputation for being less than welcoming to anybody invading their terf, one might think that the reaction to being told a whitetip shark, the very species suspected to play the biggest part in the feeding frenzy of the <em> USS Indianapolis </em> , was swimming closer and closer to you would be to swim away, or get to the boat, or scream, or even swim towards it in the hopes of getting a closer look, even if that’s an absolutely horrible idea. Maybe even make a joke about <em> Jaws </em>on your way out of the water.</p>\n<p> </p>\n<p>But Percy simply turned his head in her direction, smiled, gave Ciara a thumbs up, and held completely still.</p>\n<p> </p>\n<p>That was not a normal reaction. At all.</p>\n<p> </p>\n<p>Her previous excitement was now completely replaced with the wonderful feelings of sheer panic and confusion at his incredible nonchalance over being approached by a very, very aggressive shark.</p>\n<p> </p>\n<p>“Percy! Did you hear me? You gotta get out of-- oh <em> shit </em>.” Ciara’s shout thinned out into a weak gasp.</p>\n<p> </p>\n<p>Ciara had spent her whole life learning about animals in her spare time. Ever since she was a child, she would pour over her National Geographic magazines and read until her eyes were swimming with scientific names, fun facts, and any other tidbit of knowledge she could get her hands on. She knew their diets, their habitats, their behaviors. </p>\n<p> </p>\n<p>She knew which animals were friendly, which ones were aggressive, which ones were just curious, and which ones were scared.</p>\n<p> </p>\n<p>But she had never seen one seem so <em> starstruck </em>.</p>\n<p> </p>\n<p>The shark was circling, circling, circling. But never getting closer. It’s mouth was just slightly ajar, like it was gaping at Percy somehow and for some reason. It’s beady black eyes looked as wide as they could possibly be.</p>\n<p> </p>\n<p>Percy just giggled quietly like he saw absolutely nothing wrong or dangerous with the situation he was currently in.</p>\n<p> </p>\n<p>“Hey, little guy. How ya doing?” He asked calmly, rotating every so often to keep his eyes on the shark.</p>\n<p> </p>\n<p>Ciara would hardly classify the shark as a ‘little guy’. White tips were definitely a rather small breed of shark, but it was still almost as long as some of her coworkers were tall. </p>\n<p> </p>\n<p>The shark inched forward, getting closer and closer to where Percy was floating peacefully, a fact he either didn’t care about or was blissfully unaware of. Ciara wasn’t really sure whether she was hoping for the latter or the former.</p>\n<p> </p>\n<p>“What are you doing so far away from the pal--the, uh, bottom? Doesn’t dad need you for something?” He asked as casually as one could ask a shark that was circling you like an awestruck vulture.</p>\n<p> </p>\n<p>Ciara had no idea what he meant by that. As far as she knew, his stepdad was an English teacher at some local high school and his biological father was a fisherman he only saw a few times a year. </p>\n<p> </p>\n<p>Whatever he meant, she was not too peachy keen on watching him get eaten because he thought a shark was friends with his dad.</p>\n<p> </p>\n<p>“Percy! Dr. Jackson! You gotta get back to the boat, like right now! That thing is getting way too close for comfort!” Ciara yelled over the waves.</p>\n<p> </p>\n<p>Her words had either been drowned out by the soft roar of the waves or were just being completely ignored by her coworker. Either way, he took no notice of her warnings.</p>\n<p> </p>\n<p>Well. That left her with two options. Option one, swim forward to help her coworker and risk getting attacked, or option two, leave him for the animals. </p>\n<p> </p>\n<p>Observing the current scene, every man for himself was beginning to seem very appealing. But part of her brain reminded her that abandoning your coworker in the vast Pacific ocean solely because you got freaked out by a shark swimming in circles was probably a wee bit cruel and also possibly incriminating.</p>\n<p> </p>\n<p>‘<em> Ah, what the hell, </em>’ Ciara thought bitterly. Biting her lip, she slowly paddled forward, desperately trying to ignore all the blaring alarm bells going off in her head.</p>\n<p> </p>\n<p>She guessed Percy had finally spotted her out of the corner of his eye, because he jerked his head in her direction and frantically stuck a hand out.</p>\n<p> </p>\n<p>“Nonono, wait!” He sputtered. “He’s very easily startled around other people and he usually doesn’t come so close to the surface, you're gonna scare the poor baby.”</p>\n<p> </p>\n<p>Ciara froze in her tracks and blinked slowly. “Dude. <em> He </em> should be the one scaring <em> you </em>.”</p>\n<p> </p>\n<p>Percy looked very startled by that notion for some reason. “Oh. Um. Yeah.”</p>\n<p> </p>\n<p>Percy muttered something under his breath in a language she couldn’t quite identify, and whispered something to the shark in a very tender voice before petting it like it was a dog. Almost immediately, the shark darted away from the duo and towards the bottom of the ocean. Ciara stared at the spot it had been in with wide eyes and furrowed brows. Her brain was wracked with questions she couldn't even begin to make up a reason for.</p>\n<p> </p>\n<p>“So,” She began slowly, shifting her attention to Percy, “Feel like explaining why you were treating an apex predator like a puppy?”</p>\n<p> </p>\n<p>“No way, UMA is <em> totally </em>the best college!”</p>\n<p> </p>\n<p>“Fuck off, Duke is the best one and you know it!”</p>\n<p> </p>\n<p>Marcus scrunched up his nose in fake disgust at the mention of his coworker’s former university.</p>\n<p> </p>\n<p>“If we’re rating this based on how much debt you’ll be in after you graduate, then yeah, Duke wins.”</p>\n<p> </p>\n<p>Melody opened their mouth to protest, but shut it with a look of frustration and annoyance. “...At least you said Duke wins.”</p>\n<p> </p>\n<p>“Hm, no. I’m pretty sure UMA is the best college anyone in our team went to.” </p>\n<p> </p>\n<p>Melody scoffed and rolled their eyes. “How would you know? You have to at least rate them all before you can definitively say that!”</p>\n<p> </p>\n<p>Marcus considered this for a moment before grabbing a dry erase marker off his desk and walking up to the whiteboard in the front of the room. Writing his coworkers’ names in an alphabetical list in sloppy handwriting, he turned back to Melody with a mischievous glint in his eye.</p>\n<p> </p>\n<p>“<em> Only </em>to prove that UMA is the best.”</p>\n<p> </p>\n<p>Melody grinned broadly and walked up to join Marcus. “You’re on.”</p>\n<p> </p>\n<p>“Ciara went to Hawaii Pacific, which I’d give about a 8/10, plus a bonus point for a great view.”</p>\n<p> </p>\n<p>“Yeah, I’d agree with that.” Marcus said, writing an 8 next to Ciara’s name.</p>\n<p> </p>\n<p>“I know Elaine went to Oregon state, so she gets an automatic 10/10.” Marcus declared, writing his score on the whiteboard in huge letters.</p>\n<p> </p>\n<p>“What?! You can’t just give her full credit for going to your home state!” Melody protested. </p>\n<p> </p>\n<p>“I can and I will!” Marcus said with a devilish smirk.</p>\n<p> </p>\n<p>Melody pressed their tongue against the inside of their cheek. “Best I’ll give is a 6/10.”</p>\n<p> </p>\n<p>“Are you saying that just to spite me?” </p>\n<p> </p>\n<p>“Absolutely.”</p>\n<p> </p>\n<p>“I’m writing a 7.5 to spite you back.”</p>\n<p> </p>\n<p>“I would tell you to go fuck yourself but that’s fair.”</p>\n<p> </p>\n<p>Marcus gave his best vindictive smile before turning back to the whiteboard.</p>\n<p> </p>\n<p>“Jim went to Cornell, but if I’m being honest I hardly know anything about that place other than the fact that it’s nearby.” He admitted.</p>\n<p> </p>\n<p>“Honestly? I’m just impressed he managed to find a place where you can study marine veterinary without going nuts. He should get a 10/10 for that alone.”</p>\n<p> </p>\n<p>Marcus shrugged and wrote a 10 across from Jim’s name. “Can’t argue with what you don’t know anything about.”</p>\n<p> </p>\n<p>Melody hummed in agreement, before noticing the next name on the list and snatching the marker from Marcus’s hand.</p>\n<p> </p>\n<p>“Hey! It’s my turn to rank my school!”</p>\n<p> </p>\n<p>“Ah, ah, ah!” Melody wagged their pointer finger in Marcus’s face, “That is exactly why you don’t get to score yourself. I am obviously the most unbiased option, so I get to pick your score.”</p>\n<p> </p>\n<p>Before Marcus had the chance to respond, Melody drew a massive 0 next to Marcus’s name.</p>\n<p> </p>\n<p>“I’m right and you know it, Vickers.” Melody deadpanned.</p>\n<p> </p>\n<p>“Oh, two can play at that game, <em> Hargrove </em>.” </p>\n<p> </p>\n<p>Grabbing another marker, Marcus drew 2 zeros in Melody’s space.</p>\n<p> </p>\n<p>Their ranking system quickly dissolved into a game of “who can write more zeros on the other person’s name?” that involved a lot more yelling and carefully timed insults and jabs than it probably should have, especially from two grown adult scientists. </p>\n<p> </p>\n<p>About a hundred quickly scribbled zeros and a countless amount of bad jokes later Marcus shouted, “Ah, shit, I got a 0 on Percy’s name,”</p>\n<p> </p>\n<p>“Oh, right, the game. Forgot about that.” Melody said.</p>\n<p> </p>\n<p>“Wait a sec,” Melody’s face scrunched up in thought, “Where did Percy even <em> go </em>to college?”</p>\n<p> </p>\n<p>Marcus paused in the middle of writing another zero under Melody’s name to think. “Some place around San Francisco I think? New Greece? New Italy? I know it was named after a country somewhere in Europe.”</p>\n<p> </p>\n<p>“New France?”</p>\n<p> </p>\n<p>“No, I think it started with an R.”</p>\n<p> </p>\n<p>“New Russia?”</p>\n<p> </p>\n<p>“Probably not.”</p>\n<p> </p>\n<p>“New Raleigh?”</p>\n<p> </p>\n<p>“That’s a city in North Carolina, not a country.”</p>\n<p> </p>\n<p>“Oh, right. What about New Rome?”</p>\n<p> </p>\n<p>Marcus snapped his fingers. “Yeah! That’s it!”</p>\n<p> </p>\n<p>Melody pursed their lips, “I’ve never even heard of it.”</p>\n<p> </p>\n<p>Marcus abandoned his spot at the whiteboard and walked back to desk, opening his laptop.</p>\n<p> </p>\n<p>“I hadn’t heard of it until I saw Percy’s doctorate either, so I guess it’s a pretty small place. I think he said his wife went there with him too.” He mumbled, typing something in. </p>\n<p> </p>\n<p>“New Rome University is a private university in New Rome, California, founded in the late 1600s, graduation rate 100%... acceptance rate .5%?” He read off the screen, his face scrunching up in confusion towards the end of the sentence.</p>\n<p> </p>\n<p>Melody leaned over his shoulder and raised an eyebrow, “That’s oddly specific, isn’t it?”<br><br>“Very. Where even is New Rome? I’ve never heard of the town either.”</p>\n<p> </p>\n<p>Melody hummed in agreement and Marcus typed something new in.</p>\n<p> </p>\n<p>The duo blinked in surprise when the results loaded.</p>\n<p> </p>\n<p>“It’s… blank.”</p>\n<p> </p>\n<p>“That’s, uh, that’s odd. Do you think there’s something wrong with my computer or something?”</p>\n<p> </p>\n<p>“I dunno, you’re the technician of the team, you’d be the one to know.”</p>\n<p> </p>\n<p>Marcus frowned. “Try looking it up on your phone. My laptop might need to be looked at.”</p>\n<p> </p>\n<p>Melody pulled out their phone and searched for the same thing. “There <em> is </em>a place called New Rome, buut it’s a tiny unincorporated town in Ohio that has no college at all.” </p>\n<p> </p>\n<p> Marcus pursed his lips. “...You think he falsified his school records and doctorate?”</p>\n<p> </p>\n<p>“In any other case I would say yeah, but this is <em> Percy Jackson </em>we’re talking about. If he didn’t go to college to learn everything he knows, then he learned it because he’s a fucking mermaid or something. There is no way in hell he just waltzed in and has been bullshitting the whole time. New Rome was probably just shut down or something.”</p>\n<p> </p>\n<p>“But it would still have things come up on Google, it wouldn’t just vanish off the face of the Earth!”</p>\n<p> </p>\n<p>Melody shook their head. “I don’t know what to tell you, dude. You know Percy’s always got weird stuff going on, maybe it’s some niche online course or whatever.”</p>\n<p> </p>\n<p>Marcus made an unconvinced hum, but shut his laptop anyway.</p>\n<p> </p>\n<p>“Guess Percy’s gonna get the lowest score on the school chart then, huh?”</p>\n<p> </p>\n<p>\n<span>Waves.</span>\n</p>\n<p> </p>\n<p>\n<span>Normally, Elaine Rudolph absolutely adored them. Crashing down gently on the sand, making calming noises and leaving soft seafoam in their wake, making the ocean that beautiful blue-green color. She truly loved them.</span>\n</p>\n<p> </p>\n<p>\n<span>Right now, however, as she was being tossed around and trapped beneath them, she did not.</span>\n</p>\n<p> </p>\n<p>\n<span>Elaine, like any good marine ecologist, knew full well that waves were not always the gentle giants most people liked to think of them as. They could be soft and lovely at some times, but dangerous and unforgiving at others. She was being harshly reminded of that in this moment. </span>\n</p>\n<p> </p>\n<p>\n<span>While on a research trip on the other side of the coast, she and Percy had been sent to check and see if the rocky shores of the beach the team would be going to were safe to dock at, none of them realizing just how rough the water was at the moment. </span>\n</p>\n<p> </p>\n<p>\n<span>Once she was in a spot a few feet before her feet could touch the sand, Percy just a little ahead of her to the left, she was swept under one particularly large wave. Her lifejacket was securely and properly fastened, but that didn’t really help when she was being held underwater. She tossed and turned, hoping her hopeless thrashing would keep her afloat long enough to catch a breath to no avail.</span>\n</p>\n<p> </p>\n<p>\n<span>‘</span>\n<em>\n<span>Alright, Lainey, calm down, think: what do you do when you’re trapped under a wave?</span>\n</em>\n<span>’ She searched through the depths of her memory for a solution, trying to ignore the part of her brain that was screaming in terror.</span>\n</p>\n<p> </p>\n<p>\n<span>She remembered reading something a while back about finding an air pocket to hide in and waiting for help to arrive, but that wasn’t going to do her much good while she was attempting to swim to shore in a space where any caves were much further away than land. Plus, the longest she had to wait was as long as she could hold her breath. Definitely not enough time for search and rescue or whatever to come and get her.</span>\n</p>\n<p> </p>\n<p>\n<span>The other and currently more helpful thing was to not exhaust yourself. Right. Thrashing blindly against the waves would not allow her to overpower the ocean, that’s one battle she knew she couldn’t win even if she tried.</span>\n</p>\n<p> </p>\n<p>\n<span>‘</span>\n<em>\n<span>Okay, what else do you have to do? You can’t stay under here forever.</span>\n</em>\n<span>’ She reminded herself.</span>\n</p>\n<p> </p>\n<p>\n<span>She had been underwater for just long enough that her breath was starting to run out, and she was beginning to realize just how badly she needed </span>\n<em>\n<span>out</span>\n</em>\n<span>.</span>\n</p>\n<p> </p>\n<p>\n<span>The saltwater stung her nostrils and eyes, and her cheeks felt strained from keeping a breath in this long. Her lungs felt like they were about to burst, and the only thing on her mind was getting air. If she could get just one gulp, she would have a little longer to figure out how to get out of the wave.</span>\n</p>\n<p> </p>\n<p>\n<span>Against her better judgement, Elaine swam straight towards the surface as fast as she could without regard for whether or not another wave was incoming, or if the one that had just broken over top of her was still strong enough to keep her under.</span>\n</p>\n<p> </p>\n<p>\n<span>She barely had a chance to gasp for another breath before she was pulled under yet again. Just before she disappeared beneath the waves, she caught sight of a familiar head of messy black hair floating some 20 feet away from her.</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Ugh</span>\n</em>\n<span>, she hoped Percy was doing better than she was right now. He was probably the best swimmer of the group, which was one of the reasons he had been chosen to go, but even staying above water for those few fleeting seconds was like trying to straddle a horse that was still running. He probably wasn’t having a good time either right now.</span>\n</p>\n<p> </p>\n<p>\n<span>Elaine glanced up at the waves crashing above her. She’d be lying if she said she wasn’t panicking, but it seemed like the sea had begun to slowly calm down, which calmed her nerves the tiniest bit.</span>\n</p>\n<p> </p>\n<p>\n<span>She pushed herself down to the sandy ocean floor, bracing herself to swim back up to the surface one more time. She and Percy could swim back to the boat, and they could figure out if and where to dock once they were both no longer in mortal peril. Easy peasy. Hopefully.</span>\n</p>\n<p> </p>\n<p>\n<span>Just before she could push off the ground, Elaine felt water churning gently behind her and hands grasping under her shoulders, pulling her above water.</span>\n</p>\n<p> </p>\n<p>\n<span>Speak of the devil.</span>\n</p>\n<p> </p>\n<p>\n<span>Elaine and Percy breached the surface, Elaine coughing and taking a much needed breath of fresh air while Percy seemed entirely unbothered by the waves crashing and pounding around him. Literally, </span>\n<em>\n<span>around </span>\n</em>\n<span>him. The waves were parting around his shoulders.</span>\n</p>\n<p> </p>\n<p>\n<span>“Are you okay?” He asked.</span>\n</p>\n<p> </p>\n<p>\n<span>“Yeah, thanks for grabbing me.” Elaine said, voice hoarse from coughing.</span>\n</p>\n<p> </p>\n<p>\n<span>Percy gave a casual smile, like nothing big had just gone down at all. “No problem.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Not that I’m complaining, because I seriously am grateful for you saving me, but how were you not getting tossed around down there? I was hardly clinging to life.” Elaine asked with a dry chuckle. “You’re hardly even being pushed around right now, too.”</span>\n</p>\n<p> </p>\n<p>\n<span>Suddenly, Percy’s whole calm demeanor shifted to awkwardness. “Uh, where I was floating was pretty calm.”</span>\n</p>\n<p> </p>\n<p>\n<span>All Elaine could do was blink, confused. “You’re kidding.”</span>\n</p>\n<p> </p>\n<p><span>“Nope.” He </span><em><span>eep</span></em><span>ed</span> <span>out.</span></p>\n<p> </p>\n<p>\n<span> “This entire half of the beach was practically shaking with the force of the waves! There’s no possible way that one little section was completely unaffected!”</span>\n</p>\n<p> </p>\n<p>\n<span>Percy paled ever so slightly, and suddenly every single wave calmed. They went from pounding on the sand like drums to thrumming gently, washing slowly along the beach, as if they had always been that way.</span>\n</p>\n<p> </p>\n<p>\n<span>“...Guess I don’t know what to tell you then.” He managed.</span>\n</p>\n<p> </p>\n<p>\n<span>Elaine hardly had time to open her mouth to respond before Percy glanced around almost comically quickly and shouted out “Oh would you look at that! The waves stopped! Let’s go back to the boat as soon as possible to avoid getting slammed to the bottom of the ocean again!” far louder than necessary.</span>\n</p>\n<p> </p>\n<p>\n<span>Elaine wasn’t into getting flattened into a pancake, so she pushed aside the weird response and followed Percy back to the boat.</span>\n</p>\n<p>\n<br>\n<span>He was gonna have </span>\n<em>\n<span>so </span>\n</em>\n<span>much explaining to do once they got back to the main building.</span>\n</p>\n<p> </p>\n<p>\n<span>A takeout box was slammed onto the table, followed by Melody slumping into the seat in front of it. \"That's it, Percy is officially the weirdest person I have ever met.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Elaine's calm expression slipped into a frown. \"Don't you think it a bit rude to talk about him behind his back the moment he's gone?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Under normal circumstances I would agree with you, but he's out on an injury.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Elaine took a sip of her water. Marcus quirked an eyebrow, and Jim and Ciara just stared at Melody. </span>\n</p>\n<p> </p>\n<p>\n<span>\"Uh, Mels, you know that doesn't make it better, right?\" Marcus asked tentatively.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yeah, but do you know how he got that injury in the first place?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"...No?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"He got in a swordfight, and the other dude landed a hit.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Elaine choked on her water in surprise and Ciara’s eyes widened to the size of dinner plates, while the two boys blanched at their tired looking coworker.</span>\n</p>\n<p> </p>\n<p>\n<span>“What the hell do you mean</span>\n<em>\n<span> he got in a swordfight</span>\n</em>\n<span>?!”</span>\n</p>\n<p> </p>\n<p>\n<span>“I figured he just sprained his wrist or something!”</span>\n</p>\n<p> </p>\n<p>\n<span>“Percy knows how to use a sword?!”</span>\n</p>\n<p> </p>\n<p>\n<span>“Percy </span>\n<em>\n<span>owns </span>\n</em>\n<span>a sword?!” Were all among the things shouted in horror/confusion at this information.</span>\n</p>\n<p> </p>\n<p>\n<span>Melody threw their hands up in exasperation. “Yeah! That’s what I thought too! His wife was the one to let me know, and apparently, he wasn’t even taking lessons or anything, like a vaguely normal person. This guy just fucking chellenged him to a duel, and Percy accepted.”</span>\n</p>\n<p> </p>\n<p>\n<span>Ciara leaned in, narrowing her eyes the slightest bit. “So, how does one go about getting in a swordfight, and losing?”</span>\n</p>\n<p> </p>\n<p>\n<span>Melody just laughed. “Oh, he didn’t lose. His wife told me his opponent got a slash in and Percy shut it down real fast. No idea how it started, though. She made it sound like this was a regular occurrence. Or at least regular enough that it was just a minor inconvenience to the both of them. She said he just needed stitches, but was making him chill for a day or so anyways so he didn’t pull them.”</span>\n</p>\n<p> </p>\n<p>\n<span>Everyone blinked at Melody.</span>\n</p>\n<p> </p>\n<p>\n<span>“Alright, I rescind my earlier statement. We’re gossiping about Percy while he’s gone, and it is totally moral and okay because he’s fucking weird. Agreed?” Marcus announced, throwing his hands up in exasperation.</span>\n</p>\n<p> </p>\n<p>\n<span>Everyone around the table nodded with varying degrees of enthusiasm. Truth be told, nobody really knew much about Percy, other than his spooky ability to seemingly telepathically communicate with animals and his love for his wife. Everybody was at least a </span>\n<em>\n<span>little</span>\n</em>\n<span> bit curious.</span>\n</p>\n<p> </p>\n<p>\n<span>“You said his wife called in for him and told you? And acted like it was normal? Like, not even the least bit… I don’t know, upset? Concerned? Angry?” Elaine prodded.</span>\n</p>\n<p> </p>\n<p>\n<span>“I’d be mad as hell if my man got in a swordfight more than once. Can’t picture she’d be pleased about it.” Marcus added.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yeah, she was irritated. Kept muttering in Greek or something like it.\" Melody agreed.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Wait, his wife speaks ancient Greek too? I thought that was just Percy being... Percy, I guess. Didn't realize it was a family thing.\" Jim spoke up.</span>\n</p>\n<p> </p>\n<p>\n<span>Ciara blinked lamely. \"That's ancient Greek he's been speaking? The language only spoken by overly pretentious academics and wannabe gods?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Melody snorted. \"Well, he's certainly not pretentious and would likely vomit if you dared imply he was anything even resembling an academic, but knowing what little I do about Percy, I wouldn't put him being an actual ancient god outside the realm of possibility.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Half of the table had a look of blank confusion on their faces, whilst the others looked like every thought they've ever had was just realized before their very eyes. There were more than a few excited squeals from Elaine and Marcus.</span>\n</p>\n<p> </p>\n<p>\n<span>\"I have no idea what you're talking about.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Come on!\" Melody threw their hands up in the air. \"Me, Lainey and Marcus cannot seriously be the only ones to have noticed his... shit.\"</span>\n</p>\n<p> </p>\n<p>\n<span>They audibly struggled for the right word to accurately describe it, but the point came across clear as day;. Percy Jackson is not normal.</span>\n</p>\n<p> </p>\n<p>\n<span>Possibly not human.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Alright, well... I'm going to preface this by saying I </span>\n<em>\n<span>don't</span>\n</em>\n<span> think our coworker is a god in disguise or anything, for legal reasons if anything, but I </span>\n<em>\n<span>am</span>\n</em>\n<span> curious as to why you think so.\" Jim said carefully.</span>\n</p>\n<p> </p>\n<p>\n<span>Melody huffed out a breathless laugh and tilted back in their chair, staring at the ceiling in amusement.</span>\n</p>\n<p> </p>\n<p>\n<span>\"You guys know what the world record for longest breath ever held is? 24 minutes and 3 seconds. 3 guesses how long I watched Percy stay underwater with no oxygen tank for.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"...24 minutes and </span>\n<em>\n<span>4</span>\n</em>\n<span> seconds, perhaps?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"45 minutes. At least.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Jesus fucking christ.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Melody nodded emphatically as Jim stared in awe.</span>\n</p>\n<p> </p>\n<p>\n<span>\"I wish I could say you're wrong, but that is not the weirdest thing I've ever seen him do. He can speak ancient Greek and ignore basic human lung anatomy, so, what, he's like Poseidon 2.0 or something? Neptune’s second coming? His full name </span>\n<em>\n<span>is </span>\n</em>\n<span>Perseus.\" Ciara cut in.</span>\n</p>\n<p> </p>\n<p>\n<span>Elaine scoffed lightly. \"Uh, no. Percy's a little funky, I'll give you that easy peasy, but he's got it out too much for Greek mythology to actually, y’know, be part of it.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"How do you mean?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I tried giving him a book about Greek mythology for his birthday and a month later I saw he had stuck a label that said 'dictionary of shit that tries to kill me' over the title.\" Marcus added, sounding a little bummed.</span>\n</p>\n<p> </p>\n<p>\n<span>Elaine signaled at Marcus as if his addition was explanation enough. It was. “Is that how a Greek god would react to being given a book about themself? That’s a rhetorical question, and the answer is no. They’re all narcissists.”</span>\n</p>\n<p> </p>\n<p>\n<span>Melody pursed their lips and scrunched their brows, the way they did when they were putting the mental puzzle blocks together, getting ready to verbally decimate you in one way or another like it was nothing. Marcus was intimately familiar with that look.He hated that look. He feared that look more than he feared the cold, inevitable embrace of death.</span>\n</p>\n<p> </p>\n<p>\n<span>“So,” They began slowly, “What you’re saying is, though Percy may not be a god, he may be another oceanic mythological creature? And I’m guessing you have one in mind?”</span>\n</p>\n<p> </p>\n<p>\n<span>Elaine slammed a fist down hard on the table, looking at Melody with the intensity of a thousand burning suns blazing in her eyes. “</span>\n<em>\n<span>Yes</span>\n</em>\n<span>, yes I am, and yes I do.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Alright, shoot.” Jim leaned forward. Interest successfully piqued.</span>\n</p>\n<p> </p>\n<p>\n<span>“Okay, hear me out: he’s a selkie. One of the seal people.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Pffft, </span>\n<em>\n<span>what</span>\n</em>\n<span>. This is clearly, like, an </span>\n<em>\n<span>H2O: Just Add Water</span>\n</em>\n<span> situation.” Marcus snorted.</span>\n</p>\n<p> </p>\n<p>\n<span>Elaine furiously shook her hands at him.</span>\n</p>\n<p> </p>\n<p>\n<span>“No! Shut! We’re doing mine!” Ciara giggled a little unflatteringly at this. “So, a selkie’s whole deal is that when they're wearing their skins, they’re a regular ol’ seal. Nothing you would lose your mind over. But, once they reach land, and they remove their seal skins, they become absolutely beautiful people. Like, physically irresistible to normal humans.”</span>\n</p>\n<p> </p>\n<p>\n<span>Ciara snorted once more. “You trying to put the moves on Percy, there, our sweet and innocent Lainey?”</span>\n</p>\n<p> </p>\n<p>\n<span>She gasped and clutched at her collarbone in fake shock. “Why, I would never disrespect our happily married coworker like that! …But yeah, I 100% am. Sorry, Ciara.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Yeah, yeah, Percy makes Chris Evans look like Wario’s before picture, we all know that, moving on?” Marcus interjected.</span>\n</p>\n<p> </p>\n<p>\n<span>“Right, yes, moving on- there’s a long running track record in folklore of selkies getting their seal skins stolen by asshole humans, and being trapped on land forever. However, they never lose their special connection to the sea, no matter how long they’re forced to stay human. Like they love the ocean, and it loves them back.” She finished dramatically.</span>\n</p>\n<p> </p>\n<p>\n<span>Jim hummed thoughtfully, considering the theory that his coworker was secretly a magical undersea like the man of science he was. “I mean, I still think it’s a bogus theory, but it lines up with that whole seal thing from February I told you guys about.”</span>\n</p>\n<p> </p>\n<p>\n<span>Marcus blew a quiet raspberry. “I still think it’s a </span>\n<em>\n<span>Just Add Water</span>\n</em>\n<span> type deal, but points for storytelling.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Percy is literally our most experienced diver and I guarantee you he’s never grown a tail on a single one of those dives.”</span>\n</p>\n<p> </p>\n<p>\n<span>“</span>\n<em>\n<span>Or has he?</span>\n</em>\n<span>”</span>\n</p>\n<p> </p>\n<p>\n<span>Melody threw their head back and groaned. “No, somebody stop Marcus before he goes into full conspiracy theorist mode, we won’t live to tell the tale. Plus, I’ve already figured it out. Probably.”</span>\n</p>\n<p> </p>\n<p>\n<span>Jim politely smacked a hand over Marcus’s mouth much to the latter’s dismay, and casually signaled for Melody to go on.</span>\n</p>\n<p> </p>\n<p>\n<span>“It’s a </span>\n<em>\n<span>Mermaid Tale</span>\n</em>\n<span> situation, minus the mermaids. Percy does not become a mermaid once he hits the water, as Mr. Vickers previously suggested, but rather he is the offspring of a mermaid, or something similar. I’m not quite sure about that part as of now. However, while he did not inherit his parent’s aquatic physical traits, as is evidenced by his lack of fins and gills, he did gain their abilities. This would explain his status as the designated sea creature whisperer, as well as his capability to stay underwater for extended amounts of time with little to no oxygen.” Melody explained with utmost confidence, which is the appropriate level of confidence for someone postulating that their friend and coworker secretly had fish genes.</span>\n</p>\n<p> </p>\n<p>\n<span>The rest of the table went silent. Marcus looked positively floored. Ciara and Elaine were deep in complentation. Jim looked so confuddled his hand slipped from Marcus’s mouth and moved to rub his own chin. Finally free from his fingered prison, Marcus let out a sharp, impressed whistle.</span>\n</p>\n<p> </p>\n<p>\n<span>“Damn, Mels. Just… damn.” He said, leaning back in his chair.</span>\n</p>\n<p> </p>\n<p>\n<span>Ciara cleared her throat. “That’s detailed. Truly. You’ve got decent reasoning, and you make an excellent point-”</span>\n</p>\n<p> </p>\n<p>\n<span>“Thank you, I try.”</span>\n</p>\n<p> </p>\n<p>\n<span>“-But I’m still on board with Elaine’s theory.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Fuck each and every one of you.”</span>\n</p>"
}