{
  "id": "29308788",
  "url": "https://archiveofourown.org/works/29308788?view_full_work=true",
  "author": [
    "BelleAmant"
  ],
  "title": "Catching Up (Happenings)",
  "rating": "Not Rated",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [],
  "fandoms": [
    "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
  ],
  "relationships": [
    "Aizawa Shouta | Eraserhead & Midoriya Izuku",
    "Class 1-A & Midoriya Izuku",
    "Midoriya Izuku & Toogata Mirio",
    "Midoriya Izuku & Todoroki Shouto",
    "Aizawa Shouta | Eraserhead & Class 1-A"
  ],
  "characters": [
    "Aizawa Shouta | Eraserhead",
    "Midoriya Izuku",
    "Todoroki Shouto",
    "Shinsou Hitoshi",
    "Class 1-A (My Hero Academia)",
    "Toogata Mirio",
    "Hadou Nejire",
    "Amajiki Tamaki",
    "Yaoyorozu Momo",
    "Uraraka Ochako",
    "Tokoyami Fumikage",
    "Bakugou Katsuki"
  ],
  "additional_tags": [
    "Personality Swap AU",
    "Actor Midoriya Izuku",
    "BAMF Midoriya Izuku",
    "No Actual Acting",
    "Catching up to canon",
    "It's better to just",
    "read this one",
    "its my birthday ill post what i want",
    "sorry - Freeform",
    "Smart Midoriya Izuku",
    "Partial Quirk Reveal"
  ],
  "language": "English",
  "series": "Part 16 of Personality Swap AU",
  "published": "2021-02-09",
  "completed": null,
  "words": "5,153",
  "chapters": "1/1",
  "comments": "225",
  "kudos": "12,200",
  "bookmarks": "479",
  "hits": "119,407",
  "summary": "<p>It's a sunny Saturday morning, and the students of 1-A are wondering why they've been called into class.</p>\n<p> </p>\n<p>Or: What do you get when you meet the big three, have Izuku Midoriya reveal his 'late bloomer' status to some of his peers, and work on the Aldera case?<br>Just over 5,000 words, apparently!</p>",
  "notes": "<p>It's my birthday (let's go, 18!!!), so to celebrate, I offer you....another update! This one will begin bringing us back into the canon verse- because I didn't forget about it, I've just been needing some set up! <br>I hope you enjoy it! &lt;3</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>What did you think? Let me know in the comments, along with any other suggestions!</p>\n<p>Until next time! &lt;3</p>",
  "text": "<p>\n<span>It’s a sunny Saturday morning, and the students of 1-A are sitting in their classroom, wondering what today’s lesson will be about.</span>\n</p>\n<p>\n<span>It’s not often, for them, to be called into classes on a Saturday, after all. Even with the dorms being implemented, Yuuei understands that their students need time to </span>\n<em>\n<span>rest</span>\n</em>\n<span>, to recover and take the time to study and to relax on their own pacing and volition, and so Saturday lessons are infrequent at best, and quite honestly rather rare.</span>\n</p>\n<p>\n<span>So to be called in for a class? Well, it just means that something special is occurring.</span>\n</p>\n<p>\n<span>And it isn’t related to Izuku Midoriya’s acting, surprisingly enough, because the green-haired boy is as confused and curious as the rest, talking with Shouto Todoroki and Hitoshi Shinsou as they try to guess what may be about to occur.</span>\n</p>\n<p>\n<span>\"Maybe Aizawa-sensei has come up with a new lesson, and didn't want to interfere with his previous plans?\" Midoriya suggests.</span>\n</p>\n<p>\n<span>\"Or it's something related to your acting?\" Shinsou counters, to which Midoriya shakes his head.</span>\n</p>\n<p>\n<span>\"It can't be- sensei always tells me when he has something planned for me for the assignments.\"</span>\n</p>\n<p>\n<span>\"And you're still responding to Midoriya,\" Todoroki murmurs, almost to himself. \"So we know you're not acting.\"</span>\n</p>\n<p>\n<span>\"I'm not, no,\" Midoriya agrees, and those who hear the confirmation feel just a touch better, knowing that Midoriya’s chaos is contained for at least one more day.</span>\n</p>\n<p>\n<span>\"Maybe Aizawa wants to give us a </span>\n<em>\n<span>talk</span>\n</em>\n<span>,\" Todoroki guesses, to which Midoriya frowns, tilting his head.</span>\n</p>\n<p>\n<span>\"What would he be talking to us about?\" Midoriya asks, and then lights up. \"Oh! I know!\"</span>\n</p>\n<p>\n<span>\"You do?\" Shinsou and Todoroki ask in sync, one decidedly more nervous than the other when Midoriya nods his head.</span>\n</p>\n<p>\n<span>\"Yeah! It must be something to do with our provisional licenses- we've had them for a while, after all, yet haven't used them. Maybe there's a new kind of internship that we're going to do?\"</span>\n</p>\n<p>\n<span>\"There is,\" Aizawa says, entering the room with a timing so perfect that many of his students cannot help but startle. \"And that's exactly what we're going to talk about.\"</span>\n</p>\n<p>\n<span>The room falls silent, twenty gazes set on their teachers, curious and eager. Even the three who do not hold their provisional licenses- Todoroki, Bakugou, and Shinsou- show interest, wanting to know more. Aizawa nods approvingly at their silence, then turns his head, sweeping his eyes over the room.</span>\n</p>\n<p>\n<span>\"After the Sports Festival,\" Aizawa begins, \"you all went to intern with a hero of your choice. You were able to learn through observance, but you were not allowed to act due to your lack of licenses.\"</span>\n</p>\n<p>\n<span>\"Which is stupid,\" Todoroki mutters softly, while Midoriya and Iida do their best to not make eye contact with their teacher, one holding in laughter, the other, oblivious to Todoroki’s comment, holding back shame.</span>\n</p>\n<p>\n<span>\"Now that you are equipped with the necessary licenses,\" Aizawa says, unaware of or perhaps simply too tired to care about Todoroki’s comment, \"you are able to return to internships. This time, you are now able to partake in work-studies.\"</span>\n</p>\n<p>\n<span>\"But how much of a difference can it make?\" Kaminari asks. \"I mean, we've already dealt with villains before, won't we get the experience through the League attacking us?\"</span>\n</p>\n<p>\n<span>\"Or Midori could just keep acting as villains!\" Ashido pipes up. \"He's </span>\n<em>\n<span>terrifying </span>\n</em>\n<span>when he’s trying to be mean.\"</span>\n</p>\n<p>\n<span>\"And probably a better fighter than most villains we'll encounter,\" Sero admits.</span>\n</p>\n<p>\n<span>\"Midoriya may be good,\" Aizawa agrees easily, because he's not blind to the success of the boy he considers his own son, \"but work-studies are an experience that you all need to go through. But if you don't want to take </span>\n<em>\n<span>my</span>\n</em>\n<span> word for it, take theirs.\"</span>\n</p>\n<p>\n<span>And the door slams open.</span>\n</p>\n<p>\n<span>Three figures walk in, one after the other. First comes a blond, with happy eyes and a matching grin that makes him seem like a ray of sunshine himself. Behind him is a girl with long, blue hair and a swaying gait, hands clasped together and tucked behind her back as she glances around, eyes flitting through the room nonstop. Third is a boy with dark purple hair and elvish ears, with shoulders hunched and head tucked.</span>\n</p>\n<p>\n<span>\"Class,\" Aizawa says. \"Meet Mirio Togata, Nejire Hado, and Tamaki Amajiki...the Big Three of Yuuei.\"</span>\n</p>\n<p>\n<span>The title is inspiring, even if the students have no clue what it means.</span>\n</p>\n<p>\n<span>\"These three are considered the strongest students of Yuuei, stronger than some pros, even,\" Aizawa explains, and then says, \"Go.\"</span>\n</p>\n<p>\n<span>\"Hey hey!\" Hado greets, hands unclasping to wave cheerfully. \"It's nice to meet you! We're here to talk about work-studies- right?\" Quickly, her gaze flips to focus on Aizawa, who nods with a sigh.</span>\n</p>\n<p>\n<span>\"Perfect! So, work-studies may </span>\n<em>\n<span>sound</span>\n</em>\n<span> boring, based on name alone- and who named them, anyways?\"</span>\n</p>\n<p>\n<span>The class blinks in surprise. Are they supposed to know? Her perplexed expression makes it seem this way, and so Iida raises his hand in hopes of helping his upperclassman.</span>\n</p>\n<p>\n<span>\"It was likely one of the teachers,\" Iida explains dutifully, one arm stiffly chopping through the air. \"And they-\"</span>\n</p>\n<p>\n<span>\"That makes sense!\" Hado agrees, cutting the blue-haired boy off. \"You're really smart, huh? Is it because you have glasses? Do you </span>\n<em>\n<span>need </span>\n</em>\n<span>glasses, or is it just an aesthetic choice? I can't see glasses being as effective as contacts on the field, they must break a lot.\"</span>\n</p>\n<p>\n<span>Iida sputters, arm chopping wildly. \"My glasses are-\"</span>\n</p>\n<p>\n<span>\"And you!\" Hado chirps, leaning over the podium to point at Shouji. \"Your mask is neat, but why do you wear it?\"</span>\n</p>\n<p>\n<span>\"I wear it because-\" Shouji starts to explain, only to be cut off as well.</span>\n</p>\n<p>\n<span>Time and time again, Hado switches from person to person, questions leaving her lips quicker than anyone can answer. From Uraraka's ever-present blush to how much gel Kirishima uses in a day, no one is safe from her inquiries.</span>\n</p>\n<p>\n<span>\"And you!\" Hado chirps, pointing at Midoriya. \"You're the actor, right?\" Midoriya nods, and Hado hums. \"So is it true? That you're the secret 'love child' of-\"</span>\n</p>\n<p>\n<span>\"Hado,\" Aizawa cuts in, ending her sentence midway. \"Stop questioning the students. Someone else, explain.\"</span>\n</p>\n<p>\n<span>“Fine! Amajiki, you’re up!” Hado commands, turning around to face the purple-haired boy.</span>\n</p>\n<p>\n<span>Who is currently shaking as he faces the wall, head slammed against the chalkboard.</span>\n</p>\n<p>\n<span>“I can’t do this,” Amajiki murmurs. “No matter what I do...they’re too </span>\n<em>\n<span>much</span>\n</em>\n<span>.”</span>\n</p>\n<p>\n<span>A soft ‘oh, </span>\n<em>\n<span>mood</span>\n</em>\n<span>’ can be heard from Shinsou, but the rest of the class simply watches on as Togata jumps forward, slamming his hands on the podium.</span>\n</p>\n<p>\n<span>“Right!” Togata says. “Guess it’s up to me, yeah? Say it with me if you know the answer: life is going to be...?”</span>\n</p>\n<p>\n<span>Silence.</span>\n</p>\n<p>\n<span>“Grim!” Togata cheers. “But that’s alright, because that’s what Yuuei trains us for! And what’s a good way to prepare?”</span>\n</p>\n<p>\n<span>More silence, and Togata slams his hands on the podium again.</span>\n</p>\n<p>\n<span>“Work-studies! But you guys don’t seem to be the talking type, huh? Or maybe it’s just this q-and-a that you’re not fond of. Either way, I know how to prove my point: fight me! All of you against one of me, yeah?”</span>\n</p>\n<p>\n<span>And this time, he gets a response, in the form of one loud, collective, “</span>\n<em>\n<span>Yeah!</span>\n</em>\n<span>”</span>\n</p>\n<p>\n<span>And so it begins.</span>\n</p>\n<p>\n<span>Oh kami, it begins.</span>\n</p>\n<p>\n<span>-----</span>\n</p>\n<p>\n<span>Shouta Aizawa has an idea of what to expect the moment that Togata challenges his students to a fight. </span>\n</p>\n<p>\n<span>He knows, for one, that there is a fifty, perhaps as high as seventy, percent chance that Todoroki will decline to fight. Not because the boy does not </span>\n<em>\n<span>want</span>\n</em>\n<span> to fight, of course, but because he will not feel that he has the right.</span>\n</p>\n<p>\n<span>Not when the boy failed to pass the Provisional Licensing Exam.</span>\n</p>\n<p>\n<span>And, yes, that was not so long ago, and yet was not so recent, and so perhaps Shouta should feel as if it’s more likely that the dual-toned student should have accepted his failure and seen this opportunity as a chance to test his current skills, with or without a license, but Shouta </span>\n<em>\n<span>knows</span>\n</em>\n<span> his students.</span>\n</p>\n<p>\n<span>And so he is not surprised when Todoroki does as expected, standing off to the side, instead encouraging Midoriya to do his best before leaning against the wall, calm and silent as he tends to be, when he is not flustered by the sight of the aforementioned boy. </span>\n</p>\n<p>\n<span>And with Todoroki declining, it only makes sense that Bakugou does the same, letting out a huff and slamming his back into the wall more than leaning against it, hands clenching with the urge to do his best, but not wanting to somehow look bad compared to the only other one to fail the exam.</span>\n</p>\n<p>\n<span>Finally there is Shinsou who declines to partake in the activity, another variable that Shouta had accounted for. Shinsou, after all, is still new, </span>\n<em>\n<span>very</span>\n</em>\n<span> new, and wasn’t even given the </span>\n<em>\n<span>chance</span>\n</em>\n<span> to take the exam. </span>\n</p>\n<p>\n<span>No, Shinsou will be joining Bakugou and Todoroki, when they take their additional, remedial lessons. Afterwards, all three will have the chance to prove themselves yet again.</span>\n</p>\n<p>\n<span>But for now, Shouta watches as three of his students move away from the rest, out of the way and acting as an audience, each focused on different people.</span>\n</p>\n<p>\n<span>Or, perhaps not, as Todoroki and Shinsou seem to be speaking, gesturing in the same direction. Bakugou, meanwhile, keeps his eyes trained a completely different way.</span>\n</p>\n<p>\n<span>Shouta knows what the central focus is.</span>\n</p>\n<p>\n<span>They have the right idea, to be quite honest.</span>\n</p>\n<p>\n<span>Shouta lets his eyes trail back, gaze flitting over the seventeen students of his own that oppose Togata. Togata, too, seems to be sizing them up, calculating, analyzing.</span>\n</p>\n<p>\n<span>He’s looking for the weak spots, no doubt finding them.</span>\n</p>\n<p>\n<span>And Shouta knows that he will take out the majority in the first minute alone, and most will be down in the next. Togata will be fast, and he will be fierce.</span>\n</p>\n<p>\n<span>Yet not perfect.</span>\n</p>\n<p>\n<span>Because while Shouta has a clue...Togata does not.</span>\n</p>\n<p>\n<span>And that makes it all the more satisfying, watching everything play it.</span>\n</p>\n<p>\n<span>In another world, perhaps, this fight would have finished in less than three minutes. Togata is quick, smart, and a heavy hitter. His training with Sir Nighteye turned him from the smallest of threats to the most dangerous person to oppose, and Togata clearly knows this, confidence in his movements as he sinks into the floor, only to pop back out, taking down one of Shouta’s students in the blink of an eye.</span>\n</p>\n<p>\n<span>But the fight does not end in three minutes, and for one reason alone.</span>\n</p>\n<p>\n<span>Izuku Midoriya. The lone remaining fighter.</span>\n</p>\n<p>\n<span>In some other world, Midoriya would have had a fighting chance, Shouta will give him that. The boy is bright, analytical, and Togata does have his tells, signs that show his plans. Midoriya would catch on, at least somewhat.</span>\n</p>\n<p>\n<span>But in </span>\n<em>\n<span>this</span>\n</em>\n<span> world?</span>\n</p>\n<p>\n<span>In this world, Midoriya has so much more. Because Izuku Midoriya has impersonated a multitude of people over the past three weeks, including their fighting styles.</span>\n</p>\n<p>\n<span>So when Togata sinks into the ground, trying to surprise his opponent?</span>\n</p>\n<p>\n<span>His kid does the exact same thing, switching up his way of fighting, and the entire match with it.</span>\n</p>\n<p>\n<span>It's a bizarre amalgamation of styles, the way Midoriya jumps from one way of moving to the next, switching as if it's as easy as breathing, as natural as flexing a limb. When Togata first gets close, Midoriya aims a brutal punch, a familiar shout of some American state falling from a perfect smile. But then, when Togata melds into the ground, Midoriya takes to the sky, pinballing himself against the walls, grinning gleefully, more wildly, much like Gran Torino.</span>\n</p>\n<p>\n<span>And it's impossible to miss how Togata came up, expecting to find a first year, only for Midoriya to shoot himself back down, a human bullet crackling green lightning. And he even begins to make an impact, greenet colliding with blond until the third year throws himself out of the way, effectively avoiding half of the blow.</span>\n</p>\n<p>\n<span>But Midoriya isn’t stopped, or swayed, and when Togata turns around, the boy has taken on a far-ranged style, imitating Snipe as his expression changes, eyes more serious, gaze steadier as he lifts his hand, flicking his fingers and sending a blast of air the blond's way. It does not hit. </span>\n</p>\n<p>\n<span>But it forces Togata away, where the blond cannot reach him from.</span>\n</p>\n<p>\n<span>And this is how the match goes, on and on, with Midoriya taking to the walls or forcing Togata back until ten minutes have passed, and finally, Shouta has to call, \"Alright, that's a draw.\"</span>\n</p>\n<p>\n<span>Because really, neither boy would have stopped, and it was just a waiting game to see who cracked first.</span>\n</p>\n<p>\n<span>(And for some odd reason, Shouta doesn’t think that his Problem Child would be the one to break. He's seen how far Midoriya will go, after all, to prove a point.)</span>\n</p>\n<p>\n<span>(It's as terrifying as it is impressive, and so Shouta is fine with ending the match as it is. This way, at least, neither will have to face an unstoppable enemy in a battle of persistence and power. Not anymore.)</span>\n</p>\n<p>\n<span>Neither seem too upset over the sudden halt, luckily enough, both boys smiling at one another, Midoriya lowering his hand, Togata dropping his pose and returning to a more casual position.</span>\n</p>\n<p>\n<span>\"You're really impressive!\" Togata compliments. \"I think Sir would really like you!\"</span>\n</p>\n<p>\n<span>\"</span>\n<em>\n<span>Sir</span>\n</em>\n<span>?\" Midoriya asks, and then, awe in his words, \"You mean Sir </span>\n<em>\n<span>Nighteye</span>\n</em>\n<span>?!\"</span>\n</p>\n<p>\n<span>\"The very one,\" Togata agrees, and Midoriya gapes openly as the third year turns, facing the rest of Shouta’s class, who are finally rising. \"Work-studies are the main reason I was able to take you all down so quickly! My mentor worked me to the bone, but it's hard work like that that helps you get to the top!\"</span>\n</p>\n<p>\n<span>Shouta watches his students, seeing how the idea wins them over. Work-studies seem much more promising, now that they've had a taste of the power difference. </span>\n</p>\n<p>\n<span>Now that they have a goal to surpass, a strength to reach and make their own.</span>\n</p>\n<p>\n<span>\"We'll be on our way now,” Togata says, picking up his shirt and pulling it on. “You guys keep aiming for the sky, and go beyond! Alright?”</span>\n</p>\n<p>\n<span>“Alright!” Midoriya chirps, and his peers agree quickly, chiming in with their own agreements. Togata laughs, and then he leaves, Hado and Amajiki following behind.</span>\n</p>\n<p>\n<span>The Big Three exit the gym, and Shouta uses the time to turn to his students, saying, “Experience is one of the greatest assets that you can have, and the things that you learn will depend on who you choose to work with. Think about who you want to be as a hero, and what you need to learn. Work-studies will affect your future; it’s up to you to make the right decisions. You’re dismissed.”</span>\n</p>\n<p>\n<span>And as his students leave the room, Shouta knows that his students will heed his advice.</span>\n</p>\n<p>\n<span>It’s in their </span>\n<em>\n<span>Plus Ultra</span>\n</em>\n<span> nature, after all.</span>\n</p>\n<p>\n<span>(And as his students return to their dorms, Shouta will work on something else.</span>\n</p>\n<p>\n<span>Tsukauchi should have arrived on campus by now, after all.)</span>\n</p>\n<p>\n<span>-----</span>\n</p>\n<p>\n<span>As their homeroom teacher goes to Nedzu’s office, ready to speak with a familiar detective and the sadistic creature himself about burning down a school and dancing in its ashes, the students of 1-A head into the dorms, happy that the day is done, even as it only just begins. </span>\n</p>\n<p>\n<span>Some, like Yuuga Aoyama, immediately head back to their rooms, murmuring about beauty rest before slipping away. Others, however, continue on with the day, up with the sun and ready for the day. Eijirou Kirishima races to grab a water bottle, mentioning something about gym time with 1-B’s Tetsutetsu Tetsutetsu before heading right back out, and Tenya Iida leaves not much longer, ready to go for a run now that he is free from class. </span>\n</p>\n<p>\n<span>And then there are those who simply remain in the common room, or stray only so far as the kitchen, content to stay in the presence of their peers even if only a while longer. This is how Izuku Midoriya, Hitoshi Shinsou, Shouto Todoroki, Ochako Uraraka, Momo Yaoyorozu, Tsuyu Asui, and Fumikage Tokoyami remain, lounging on couches as those like Rikidou Satou, Kouji Kouda, and Mezou Shouji head into the kitchen. Ten students within the orbit of one another, happy as they are.</span>\n</p>\n<p>\n<span>Silence does not last long, of course, with Shinsou being the one to break the silence to ask, “So, you guys excited for your work-studies?”</span>\n</p>\n<p>\n<span>“Yeah!” Midoriya agrees. “I mean, I’m not sure </span>\n<em>\n<span>who</span>\n</em>\n<span> I’ll go with, I doubt Gran Torino would take me back...if he’s even allowed to train me anymore…but I should be able to find someone!”</span>\n</p>\n<p>\n<span>“Why can’t Gran Torino train you anymore?” Uraraka asks, head tilting, and Midoriya laughs nervously.</span>\n</p>\n<p>\n<span>“Oh! Uh, that’s because of the whole Hosu incident.”</span>\n</p>\n<p>\n<span>“Right! When Stain got to you, yeah?” Uraraka guesses, and Midoriya nods.</span>\n</p>\n<p>\n<span>“Yeah! And because I likely can’t go back to him, I need to find a new hero to accept me.” </span>\n</p>\n<p>\n<span>“Didn’t Togata say that his mentor would like you, kero?” Asui asks, and Midoriya lights up.</span>\n</p>\n<p>\n<span>“Right! Sir Nighteye, All Might’s only sidekick that he ever had! They were a perfect duo of brains and brawns, and Sir-”</span>\n</p>\n<p>\n<span>“You know a lot about him, huh?” Shinsou murmurs, and Midoriya nods excitedly.</span>\n</p>\n<p>\n<span>“Sir Nighteye was an inspiration of mine as a kid, although I admittedly didn’t know </span>\n<em>\n<span>much</span>\n</em>\n<span> about him...kind of like Aizawa-sensei, actually!”</span>\n</p>\n<p>\n<span>“Sir Nighteye and Aizawa were your inspirations?” Tokoyami asks. “I would have presumed that it was All Might.”</span>\n</p>\n<p>\n<span>“All Might was my favorite hero,” Midoriya agrees easily. “And he’s always been someone to admire. But I…” One hand reaching up to rub at his neck, Midoriya admits, “I was a late bloomer. Like...really late.”</span>\n</p>\n<p>\n<span>“How late is </span>\n<em>\n<span>really late</span>\n</em>\n<span>?” Todoroki asks, and Midoriya chuckles, although he’s noticeably tenser than he was just seconds ago.</span>\n</p>\n<p>\n<span>“Try the Entrance Exam?”</span>\n</p>\n<p>\n<span>“The Entrance Exam,” Tokoyami repeats, and Midoriya nods, gaze drifting down to the floor.</span>\n</p>\n<p>\n<span>“Yeah! I don’t know who was the most surprised when that happened- me, perhaps? When I realized I’d gotten a Quirk?”</span>\n</p>\n<p>\n<span>“You mean you went into the exam, thinking that you were Quirkless?” Yaoyorozu asks. “That’s…”</span>\n</p>\n<p>\n<span>“Foolish?” Midoriya asks, shoulders hunching. “I know. I was running around blind, it was...disheartening.”</span>\n</p>\n<p>\n<span>“I was going to say admirable, actually,” Yaoyorozu corrects gently, and Midoriya lifts his head.</span>\n</p>\n<p>\n<span>“Really?”</span>\n</p>\n<p>\n<span>“Yeah!” Uraraka pipes up. “Deku, you ran to save me </span>\n<em>\n<span>despite </span>\n</em>\n<span>thinking you were Quirkless! Everyone else ran the other way- even Iida!” </span>\n</p>\n<p>\n<span>“That’s the heart of a hero in the making, right there,” Asui adds. “But then...what </span>\n<em>\n<span>was</span>\n</em>\n<span> your plan, for heroics? If your inspirations were those like Sir Nighteye and Aizawa-sensei, but your idol was All Might.”</span>\n</p>\n<p>\n<span>“Well,” Midoriya shrugs, casting a quick look at his friends before staring back down at the floor. “I always </span>\n<em>\n<span>wanted</span>\n</em>\n<span> to be a hero like All Might. I wanted to inspire people, to make them feel safe. But I just- I knew that wasn’t a viable option, you know? I was Quirkless, that’s what we all knew.”</span>\n</p>\n<p>\n<span>“So you looked into the Underground side,” Yaoyorozu states, and Midoriya nods.</span>\n</p>\n<p>\n<span>“I did.” Smiling wistfully, Midoriya explains, “It’s why I got into analysis. Eraserhead used his capture scarf to help when his Quirk did nothing. Nighteye was able to predict whatever an opponent did, even when without his Quirk.The best Underground heroes all focused on brain over brawn...so that’s what I did. I didn’t </span>\n<em>\n<span>have</span>\n</em>\n<span> a Quirk that could level buildings with a punch, so I prioritized speed.”</span>\n</p>\n<p>\n<span>“What changed?” Asui asks, and Midoriya snorts.</span>\n</p>\n<p>\n<span>“As it turns out, building muscle was what I needed. My Quirk had a prerequisite, one we never knew of. If I had used my Quirk before training for the Entrance Exam...well, the doctors say my limbs may have come right off.”</span>\n</p>\n<p>\n<span>Instantly, his peers hiss in sympathy, Todoroki’s hand clenching instinctually from his spot beside Midoriya. The green-haired boy, however, just shrugs, although his smile seems less radiant than normal, more somber, more solemn.</span>\n</p>\n<p>\n<span>As if he’s remembering a time he’d rather not.</span>\n</p>\n<p>\n<span>His peers notice, of course, seeing the way his eyes dim, and this is why Uraraka cannot help but pipe up, saying, “Well, I’m glad you made it as you are! It would have been cool to see you acting like a mini-Aizawa, though!”</span>\n</p>\n<p>\n<span>“Doesn’t he already?” Shinsou asks, but then, looking at Midoriya, “I...I’m really impressed, though. My Quirk already caused me issues, but having </span>\n<em>\n<span>none</span>\n</em>\n<span>?” Whistling, Shinsou shakes his head. “Goddamn, Mido, I don’t know how you did it.”</span>\n</p>\n<p>\n<span>“The darkness within you is little, and the sun prevails strongly and with great persistence,” Tokoyami agrees, and Midoriya blushes, flustered by the way his peers agree.</span>\n</p>\n<p>\n<span>“Guys! It’s- it’s nothing special, really! I’m just glad to be here, Quirk or no Quirk.”</span>\n</p>\n<p>\n<span>“And you’d be here either way,” Asui says easily. “Quirk or no Quirk, kero.”</span>\n</p>\n<p>\n<span>“Aizawa probably would have claimed you as his son even faster,” Shinsou agrees teasingly, but his smile is sincere all the while, and Midoriya can’t help but tear up.</span>\n</p>\n<p>\n<span>“I...you guys think I could have made it, even as a Quirkless hero?” Midoriya asks, and is met with immediate nods, no hesitation to be seen.</span>\n</p>\n<p>\n<span>“Midoriya,” Todoroki murmurs, and Midoriya looks his way. “You would have been </span>\n<em>\n<span>unstoppable</span>\n</em>\n<span>, just as you are now.”</span>\n</p>\n<p>\n<span>And Midoriya?</span>\n</p>\n<p>\n<span>Well, Midoriya is a simple soul, and so when confronted with an abundance and kindness over his past Quirklessness- an abundance he never received as a child?</span>\n</p>\n<p>\n<span>Well, tears are shed.</span>\n</p>\n<p>\n<span>But with them come the brightest of smiles, and the knowledge that the future will be just as great.</span>\n</p>\n<p>\n<span>And right now? Right now, this is </span>\n<em>\n<span>more</span>\n</em>\n<span> than enough.</span>\n</p>\n<p>\n<span>-----</span>\n</p>\n<p>\n<span>Katsuki Bakugou lets out a sigh as his peers move past his spot, unaware of him as he stands behind the corner. Another day, perhaps, they would have noticed him, would have caught his presence.</span>\n</p>\n<p>\n<span>But today? Today, Katsuki watches as Deku walks out of the building, six of the other extras joining him. Ponytail, Frogface, Roundface, Mindfucker, Birdbrain, and Half-and-Half follow him easily, the seven talking about things to do, places to go.</span>\n</p>\n<p>\n<span>“I kind of want ice cream, you know?” Roundface asks, and then, “Do you think Aizawa-sensei will let us head out?”</span>\n</p>\n<p>\n<span>“If Mido is the one to ask, yeah,” Shinsou agrees, earning a startled laugh and flustered denial from Deku.</span>\n</p>\n<p>\n<span>As if he’s </span>\n<em>\n<span>still</span>\n</em>\n<span> not used to it, despite this being, what? The end of three fucking weeks of assignments? Three weeks of Hobo-sensei giving him special privileges for the sake of his acting, to the point that he let Deku </span>\n<em>\n<span>expel</span>\n</em>\n<span> someone, and he still doesn’t get it?</span>\n</p>\n<p>\n<span>‘</span>\n<em>\n<span>Whose fault is that?</span>\n</em>\n<span>’ His mind asks, and Katsuki doesn’t want to think about the answer.</span>\n</p>\n<p>\n<span>But that’s the fucking problem, isn’t it?</span>\n</p>\n<p>\n<span>Isn’t it?!</span>\n</p>\n<p>\n<span>It is. And Katsuki knows this. Kami, does he know this.</span>\n</p>\n<p>\n<span>It’s been shoved in his face enough to make it </span>\n<em>\n<span>plenty </span>\n</em>\n<span>clear, after all. These past few weeks haven’t just been a chance for Deku to be lifted higher, after all.</span>\n</p>\n<p>\n<span>No, they’ve been a chance for Katsuki to be ripped to shreds, to have his flaws shown to light, glaringly bright to the point that Katsuki can’t block it out, can’t ignore the truth.</span>\n</p>\n<p>\n<span>Can’t ignore that he’s not who he thought he was. </span>\n</p>\n<p>\n<span>That Katsuki isn’t the perfect person that he thought that he was.</span>\n</p>\n<p>\n<span>And it’s not just about how Katsuki views himself, is it? No, it’s how others see him, too...</span>\n</p>\n<p>\n<em>\n<span>“Look at that, the nerd has a mouth on him! And here I thought that was beat out of you </span>\n</em>\n<span>years</span>\n<em>\n<span> ago!”</span>\n</em>\n</p>\n<p>\n<span>Sharp glares, biting remarks. Deku’s words were a clear reference, a time Katsuki had never thought to look back on with anything other than apathy.</span>\n</p>\n<p>\n<em>\n<span>“Watch where you’re going, worthless freak. Can’t a useless thing like you even walk right? Or is that too difficult?”</span>\n</em>\n</p>\n<p>\n<em>\n<span>“Like you can ever be a hero! You can’t even think without the words falling out of your head! Heroes aren’t creeps, Deku!”</span>\n</em>\n</p>\n<p>\n<span>Words from his very own mouth, shown through a screen, by his teacher and principal.</span>\n</p>\n<p>\n<em>\n<span>“Take a swan dive off of the roof, and pray for a Quirk in the next life.”</span>\n</em>\n</p>\n<p>\n<span>Katsuki can’t forget how his teacher glared, his chambered anger rising more and more, clear and </span>\n<em>\n<span>cold</span>\n</em>\n<span> as black, but then red, eyes peered down on him. How the rat never looked once at the screen, always training those beady eyes on him.</span>\n</p>\n<p>\n<span>Dissecting him. Finding every single flaw.</span>\n</p>\n<p>\n<em>\n<span>“The fuck do you want?” Mindfucker shouted.</span>\n</em>\n</p>\n<p>\n<span>And the class flinched. Looked away. </span>\n</p>\n<p>\n<span>They were </span>\n<em>\n<span>afraid</span>\n</em>\n<span>.</span>\n</p>\n<p>\n<em>\n<span>“Just shut up, you damned nerd! My goddamn </span>\n</em>\n<span>superiority complex</span>\n<em>\n<span> means you’re wrong, no matter what, because there’s no </span>\n</em>\n<span>way</span>\n<em>\n<span> I could ever make a mistake.”</span>\n</em>\n</p>\n<p>\n<span>No one had spoken against the statement, no one had disagreed. Roundface had played along, Deku had stopped him from interfering.</span>\n</p>\n<p>\n<span>Nothing else had happened.</span>\n</p>\n<p>\n<span>Is that really how they all see him? As a villain? As nothing more than someone crass, and cruel, with no regards for anyone who isn’t himself?</span>\n</p>\n<p>\n<span>(What does it say, that his peers were </span>\n<em>\n<span>afraid</span>\n</em>\n<span> when Deku acted as him? That Mindfucker only saw him as someone who screamed and insulted others?)</span>\n</p>\n<p>\n<span>(What does it mean, that Katsuki can’t even </span>\n<em>\n<span>blame</span>\n</em>\n<span> them?)</span>\n</p>\n<p>\n<span>Katsuki doesn’t know. He doesn’t fucking know, and that pisses him off. He doesn’t </span>\n<em>\n<span>like</span>\n</em>\n<span> not knowing things, not understanding. He doesn’t like being the only one out of the loop.</span>\n</p>\n<p>\n<span>But that’s where he is, so out of bounds that he can’t see the lines, realizing that the ones he saw were nothing but illusions long shattered. </span>\n</p>\n<p>\n<span>Katsuki isn’t the best of the best, he’s learned this well. He’s known this since the first day, since the quirk test that revealed so much to him- Deku’s given Quirk, the fact that others had better, brighter, more practical powers than him, that he </span>\n<em>\n<span>wasn’t</span>\n</em>\n<span> the top dog- in such a short frame of time.</span>\n</p>\n<p>\n<span>But now?</span>\n</p>\n<p>\n<span>Now, Katsuki thinks he’s worse than he thought.</span>\n</p>\n<p>\n<span>And maybe...just maybe, Deku was more than Katsuki assumed.</span>\n</p>\n<p>\n<span>Even before All Might’s Quirk, if what the extras say are true.</span>\n</p>\n<p>\n<span>God damnit. God </span>\n<em>\n<span>damnit</span>\n</em>\n<span>.</span>\n</p>\n<p>\n<span>Katsuki is going to have to book extra sessions with the Hound, isn’t he?</span>\n</p>\n<p>\n<span>Whatever. Whatever it takes, to reach the top.</span>\n</p>\n<p>\n<span>(To be more than the faux-</span>\n<em>\n<span>villain</span>\n</em>\n<span> that he’s made himself out to be, that he’s made himself along the way.)</span>\n</p>\n<p>\n<span>(He won’t lose. Not ever.)</span>\n</p>\n<p>\n<span>(Not like </span>\n<em>\n<span>this</span>\n</em>\n<span>.)</span>\n</p>\n<p>\n<span>-----</span>\n</p>\n<p>\n<span>Shouta sighs as he leans back, feeling more exhausted than normal as he watches Tsukauchi organize his papers, putting them back into their proper folders with a special sort of care that comes with a case like this. Beside him, Nedzu looks as if he’s alive with energy, paws vibrating and ears twitching as he stares at the wall, as if he’s calculating the answer to an equation that only he can see.</span>\n</p>\n<p>\n<span>Finding a way to solve this mess, to fix the variables and line them up so that events can begin to cancel out.</span>\n</p>\n<p>\n<span>And, thankfully, it seems that they’ve almost finished the first part, the first formula plugged in correctly.</span>\n</p>\n<p>\n<span>But Shouta is too tired, to keep thinking in nonsensical, illogical mathematical terms, and so he lets his thoughts slip away, focusing on other things. </span>\n</p>\n<p>\n<span>(He knows, after all, that he will only grow angrier, if he has to think of what that goddamn school did to his </span>\n<em>\n<span>son</span>\n</em>\n<span> for one moment longer.)</span>\n</p>\n<p>\n<span>So Shouta hums, and he lets his eyes shut, chin tucking into his capture weapon as he tries to find something else to think about.</span>\n</p>\n<p>\n<span>A knock on the door interrupts this attempt, and Shouta blinks.</span>\n</p>\n<p>\n<span>Who would even know to look here, after all? </span>\n</p>\n<p>\n<span>“Come on in!” Nedzu chirps, unconcerned by the oddity of someone knowing exactly where they are, when they’re hidden away in one of the numerous conference rooms located around Yuuei, but then the door is being pushed open and Shouta loses any of the apprehension that had caused his shoulders to tense and hands to rise, curling into the fabric around his neck.</span>\n</p>\n<p>\n<span>“Ah, sensei?” Midoriya calls out, clearly nervous, hands a little shaky, smile wobbling a bit too much even as it shines. Shouta can’t help but stand, moving automatically, coming closer to the kid. </span>\n</p>\n<p>\n<span>“Yeah, kid?” He’s been crying, Shouta notes, seeing the red in the boy’s eyes, the faint trails that haven’t fully disappeared. “What do you need?”</span>\n</p>\n<p>\n<span>“We, uh,” Midoriya starts, and the use of ‘we’ is what makes Shouta aware of the six other students that linger nearby, clearly waiting for their friend. “We were wondering if we could go out for a bit? Off campus?” The words are all questions; it’s clear that Midoriya is shaken by something, to be so worried with Aizawa again.</span>\n</p>\n<p>\n<span>He hasn’t been this nervous in a while. Not since...since the confrontation, the talk that started this all.</span>\n</p>\n<p>\n<span>(Shouta wonders what the kid was talking about, that his friends look ready to pick him up, should he fall, emotionally or physically.)</span>\n</p>\n<p>\n<span>(He has a feeling that he knows, though.)</span>\n</p>\n<p>\n<span>“Where to?” Shouta asks, and Midoriya seems to grow more confident with the lack of immediate rejection, shoulders losing their hunched, timid curve as he says, “Uraraka was in the mood for ice cream, and we thought that sounded nice! We would only be a few hours, sensei.”</span>\n</p>\n<p>\n<span>“Just a few hours?” Shouta repeats, and Midoriya nods quickly. “Alright. Just make sure you don’t run into any villains. Got it, Problem Child?”</span>\n</p>\n<p>\n<span>Midoriya flushes red, but he nods enthusiastically nonetheless. “Of course! We’ll be back soon!”</span>\n</p>\n<p>\n<span>“Let me know when you do,” Shouta instructs. “Or else I’ll send Yamada to act as a beacon. He’ll happily shout across the city to locate you.”</span>\n</p>\n<p>\n<span>“Really?!” Midoriya asks, far too enthusiastically for something that was </span>\n<em>\n<span>meant</span>\n</em>\n<span> to be a threat, and Shouta has to hold back the fond sigh that fills his chest.</span>\n</p>\n<p>\n<span>“Go get your ice cream,” Shouta says instead, and then, looking at the others. “Don’t let him find trouble, got it?”</span>\n</p>\n<p>\n<span>“Right!” Uraraka says quickly, and Shouta nods once before turning, reaching out and moving to shut the door.</span>\n</p>\n<p>\n<span>And he doesn’t miss the way that Todoroki can’t help but murmur, “He’s like an overprotective dad.”</span>\n</p>\n<p>\n<span>Nor does he miss the flustered reaction from Midoriya, one that doesn’t actually act as a denial, not at all.</span>\n</p>\n<p>\n<span>No, he does not.</span>\n</p>\n<p>\n<span>But Shouta says nothing, content to smile into the fabric around his neck, and call it good.</span>\n</p>\n<p>\n<span>Yes, things are good.</span>\n</p>\n<p>\n<span>(But not for Aldera. No, they will </span>\n<em>\n<span>burn</span>\n</em>\n<span>.)</span>\n</p>\n<p>\n<strike>\n<span>(Much like his son did.)</span>\n</strike>\n</p>"
}