{
  "id": "29327376",
  "url": "https://archiveofourown.org/works/29327376?view_full_work=true",
  "author": [
    "ladyofsnails"
  ],
  "title": "penny for your thoughts",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
  ],
  "relationships": [
    "Bakugou Katsuki/Midoriya Izuku"
  ],
  "characters": [
    "Midoriya Izuku",
    "Bakugou Katsuki",
    "Uraraka Ochako",
    "Todoroki Shouto",
    "Ashido Mina"
  ],
  "additional_tags": [
    "Inside jokes",
    "Childhood Friends",
    "Friends to Lovers",
    "Fluff",
    "Tooth-Rotting Fluff",
    "First Kiss",
    "uuh idk it was just another cute oneshot",
    "that I got carried away with",
    "because i dont know when to stop",
    "Love Confessions",
    "Kinda",
    "Crushes"
  ],
  "language": "English",
  "series": "Part 4 of snail has bkdk brainrot",
  "published": "2021-02-10",
  "completed": null,
  "words": "7,632",
  "chapters": "1/1",
  "comments": "381",
  "kudos": "14,130",
  "bookmarks": "2,722",
  "hits": "97,454",
  "summary": "<p>For the next few years, that’s how it went. Izuku and Katsuki would give each other the penny at random times, and the receiver always had to say whatever they were thinking out loud. </p>\n<p>No matter the thought, no matter the time or place, the boys staunchly refused to lie about their thoughts. It was always the truth. Because that’s the way it went.</p>",
  "notes": "<p>okay! so, I know penny for your thoughts is not a Japanese phrase nor are there pennies in Japan but uh...yeah this was just for cute fun </p>\n<p>anyways thanks for clicking i hope you enjoy!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>thank you sm for reading! kudos and comments are much appreciated :D</p>\n<p>ps can you believe john cena ships bkdk and stans deku?? we really do keep winning huh</p>\n<p>tumblr: <a href=\"https://lady-of-snails.tumblr.com/\" rel=\"nofollow\">@lady-of-snails</a><br>twitter: <a href=\"https://twitter.com/ladyofsnails\" rel=\"nofollow\">@ladyofsnails</a></p>",
  "text": "<p>It started on a warm summer afternoon, when Izuku and Katsuki were five years old, lying side by side in the shade of a ginkgo tree in their favorite park. The midday sun filtered through the green leaves above them as the rustled softly in the slight breeze, casting a dappled light on all below them. Izuku squinted up through the green to catch a glimpse of sparse clouds in the bright blue sky, trying to make out a shape. Katsuki counted the leaves he saw on each branch above him, wishing their mothers would have let them get ice cream. </p>\n<p>“Kacchan?” </p>\n<p>“What?”</p>\n<p>“Have you ever heard someone say…’a penny for your thoughts’?”</p>\n<p>“Of course I have.” </p>\n<p>“What does it mean?”</p>\n<p>Katsuki sat up and glared down at his friend. “Stupid Deku. It means you want a penny for someone’s thoughts, obviously.”</p>\n<p>Izuku frowned up at him. “Like, a real penny?” </p>\n<p>“Duh!” Katsuki threw a leaf at Izuku’s face, and he giggled and sent it back into the air with a puff. </p>\n<p>“So, if I give you penny, you have to tell me your thoughts?” </p>\n<p>Katsuki rummaged a hand through his tiny pockets and grabbed a spare coin, then held it up above Izuku’s face. “Yes.” He dropped the penny, and it landed on Izuku’s nose and slid onto his freckled cheek. “Now tell me what you’re thinking,” he ordered. </p>\n<p>Izuku grabbed the penny of his cheek and sat up, beaming. “I was thinking that Kacchan is so smart!” </p>\n<p>“Of course I am! What a dumb thought, stupid Deku.” </p>\n<p>Izuku held the penny back out to him. “Here, now you tell me yours.” </p>\n<p>“You can’t give that to me!” Katsuki protested.</p>\n<p>“Why not?” </p>\n<p>“I just gave it to you!” </p>\n<p>Izuku shrugged and kept holding out the penny for Katsuki to take. “That means it’s mine. So now, I give it to you for <em>your</em> thoughts.” </p>\n<p>Katsuki huffed and snatched the penny out of Izuku’s outstretched hand. “Deku’s a dummy, he’s lucky has me around to tell him stuff.” </p>\n<p>Izuku still smiled brightly. “I am lucky to have you, Kacchan!” </p>\n<p>“Whatever, Deku.”</p>\n<p> </p>\n<p>For the next few years, that’s how it went. Izuku and Katsuki would give each other the penny at random times, and the receiver always had to say whatever they were thinking out loud. Katsuki gave Izuku the penny while they were buying candy, and Izuku said he wished Katsuki would share more. Izuku gave Katsuki the penny while they were being chewed out for getting the floor all muddy, and Katsuki was forced to tell his mother he thought she was being stupid – that one earned Katsuki a day of room isolation and Izuku a wrestling match. Katsuki gave Izuku the penny in the middle of recess, making Izuku tell the whole class that he had an underwear wedgie, blushing furiously as Katsuki cackled. </p>\n<p>No matter the thought, no matter the time or place, the boys staunchly refused to lie about their thoughts. It was always the truth. Because that’s the way it went. </p>\n<p> </p>\n<p>Sometime around sixth grade, Katsuki didn’t give the penny back to Izuku. The last time he’d tossed it to Katsuki, Katsuki had snatched it from the air, pocketed it, glared at Izuku, and told him that he was “tired of stupid Deku following him around like a useless puppy who thought he could do something.” He kept it all of middle school and through their first year at UA, by which time Izuku had given up on ever getting it back. He assumed Katsuki threw the penny away, or spent it, or forgot about it. </p>\n<p>What he didn’t expect was to hear a familiar, rough voice call “Deku” as he did his homework at a common room table, and look up to see a small bronze coin flying at his face, barely reacting fast enough to catch it. He opened his hand and held it flat in front of him, staring at the old, rusty penny resting on his scarred palm. When he looked up, Katsuki was watching him expectantly, with one eyebrow quirked up. </p>\n<p>“Uh…” Izuku started, then cleared his throat nervously. “I can’t believe I forgot the negative sign for the third problem in a row.” </p>\n<p>Katsuki scoffed. “Idiot.” He shoved his hands into his sweatpants pockets and turned around, walking away like he hadn’t just done that for the first time in half a decade. Izuku couldn’t help a small grin as he slipped the penny in his own pocket and got back to his math. It was definitely the same penny as all those years ago. Katsuki had kept it. </p>\n<p> </p>\n<p>Izuku gave the penny back the next time they were alone, thinking that Katsuki might not play along in front of their classmates. That happened to be when they were both on dish duty for the night, and Izuku tossed the penny at Katsuki after he dried his hands on a towel. Katsuki caught it easily, then met Izuku’s eyes. </p>\n<p>“Stupid fucking extras never do the dishes right, and they know Deku and I are the only ones who don’t leave soap suds behind.” </p>\n<p>Izuku smiled. “Guess that’s why we get this job the most.” </p>\n<p>“Assholes,” Katsuki grumbled, then stalked out of the kitchen as Izuku giggled behind him. </p>\n<p> </p>\n<p>Katsuki threw the penny to Izuku as they sat on the ground and leaned up against the wall of the school after a common pre-sunset sparring match. Izuku caught it, then took a swig from his water bottle before answering. </p>\n<p>“Kacchan’s got really good moves lately,” he said, “and he keeps being so inventive with them. I need to analyze both of us better if I want to surpass him.” </p>\n<p>Katsuki rolled his eyes. “Never going to fucking happen, nerd.” </p>\n<p>“Just you wait,” Izuku shot back, leaning further into the wall and watching the colors of the sun bleed into night above silhouetted trees. Katsuki must have been just as worn out, because he didn’t respond. When Izuku turned to look at him, his expression was unreadable, so Izuku dropped the penny back on his lap. </p>\n<p>Katsuki glared at it for a second, then put it in his pocket. He focused on the trees, not meeting Izuku’s eyes. “Deku’s an idiot if he thinks he couldn’t be just as good as I am.” </p>\n<p>Izuku blinked at him in surprise as Katsuki continued to not look at him, then broke into a grin. “Thanks, Kacchan!” Katsuki just grumbled and chugged his water. </p>\n<p>“’S a good idea to analyze yourself, Deku,” Katsuki said eventually, startling Izuku a bit. “You can’t get better just stalking other people with your creepy notebooks.” </p>\n<p>“I’m not stalking!”</p>\n<p>“You aboso-fucking-lutley are.” </p>\n<p> </p>\n<p>The next penny transfer was right after breakfast, when Izuku was talking with Todoroki and Uraraka about an assignment that was due that day. Katsuki came right up next to them and threw the penny at him, then stood there, waiting for him to answer. Apparently, Katsuki didn’t care who saw them play this.</p>\n<p>“I wonder if I could finish my worksheet in homeroom before Midnight-sensei collects it,” Izuku admitted, sighing. </p>\n<p>“Why the hell didn’t you finish it last night?” Katsuki snapped. </p>\n<p>“Stayed up too late training.” </p>\n<p>Katsuki scowled at him. “Idiot.” </p>\n<p>“Sorry, Kacchan.” </p>\n<p>Katsuki just huffed and left, while Todoroki and Uraraka stared at Izuku, confused. </p>\n<p>“What was that?” Uraraka asked. </p>\n<p>Izuku waved a hand. “Nothing.” He doesn’t know why he didn’t explain, but he didn’t. Maybe a small part of him liked the feeling of having an inside joke or game between just him and Katsuki. </p>\n<p> </p>\n<p>He decided the do the same thing Katsuki had done, walking up to his lunch table as Katsuki sat, tucked in the corner of the booth and watched his chattering friends with a bored expression. </p>\n<p>“Kacchan,” he called, making the other boy look up before tossing him the coin.</p>\n<p>Katsuki caught it with one hand and swallowed whatever food he was eating. “I need to ask Deku for Aunty Inko’s curry recipe. Lunch Rush’s stuff is a little off and I can never get it right on my own.” </p>\n<p>Izuku grinned at him. “My mom does make the best stuff, doesn’t she? I’ll text her later.” Katsuki barely acknowledged his response, turning back to his bowl of curry and ignoring all his friends who had stopped talking and started staring at the two of them. Izuku just shrugged and left, stifling a giggle as he heard Katsuki’s friends burst into questions. He couldn’t hold back when he heard Katsuki start yelling at them, though. </p>\n<p>Later that evening, he copied the recipe his mom happily sent him in a text message to Katsuki. The response was “fucking finally”, which made him smile again. He let Katsuki know that his mother wanted a picture whenever he made it. Katsuki said he’d send one. </p>\n<p> </p>\n<p>The next day after quirk training at Gym Gamma, Katsuki returned the penny. Izuku was so deep in thought he didn’t notice Katsuki come up to him until his hand was lifted up and the penny was pressed into his gloved palm. </p>\n<p>“Oh!” he squeaked, looking up. “Kacchan’s got such good balance in the air when he’s using his blasts to fly, I wonder how long that took to master and if I could factor the methods into my fighting.” </p>\n<p>“You already have Float, why the fuck do you need balance for flight?” </p>\n<p>“Balance is important for everything, Kacchan,” Izuku said, smiling. “Learning that balance from a young age in order to fly is probably how you can move so fast! Your reflexes are top notch, and you’re not gonna fall over.”</p>\n<p>Katsuki scratched his chin, pinching his brows together. “I guess.” He broke into his competitive grin that recently seemed to make Izuku’s heart flutter. “Just another thing you gotta catch up with, nerd.” </p>\n<p>“I plan on it, Kacchan.” </p>\n<p> </p>\n<p>They continued like this for months. </p>\n<p>“Kirishima’s smart enough to pull this off, he’s just gotta get his head out of his ass and focus.” (“Aw, thanks Bakubro!” “I said you need to fucking focus, Shitty Hair.”)</p>\n<p>“If I make a lot of miso soup right now, I can store it in the fridge and have breakfast for the next few days.” (“You are so fucking boring, Deku.” “I’m hungry!”)</p>\n<p>“Learning these dates are so fucking useless. Pro heroes don’t need to know shit about pre-quirk era politics.” (Izuku responded with a 2-minute lecture on the importance of history before Katsuki threw a handful of pens at him). </p>\n<p>“Aizawa-sensei reminds me of a sleepy cat. So does Shinso.” (“…Why does that make sense?”)</p>\n<p>“I wonder if Dunce Face would bounce if I shoved him down the stairs.” (That was said right next to Kaminari himself). </p>\n<p>“Kacchan still looks so cool when he uses his quirk, especially flying around.” (“Shut up, nerd.”)</p>\n<p>“I need to get my shit together, Deku almost beat with me that stupid fake-out.” (“I did?” “I still won, idiot.”)</p>\n<p>“I really wish Midnight-sensei would get rid of the whip in a classroom setting at the very least.” (“I hate to agree with you, but same.”)</p>\n<p> </p>\n<p>It was all going great. Izuku was elated to have this kind of thing back. And Katsuki seemed to enjoy it too, some thoughts coaxing a small smile out of him or leading to enjoyable conversations between them. But then, something horrible happened. </p>\n<p>The day began normal, no dark omens pointing Izuku to the mess he was going to get into later. The divine powers had failed him on that end. Instead of the flock of omen birds that should’ve appeared to lock him in his room the whole day, he went about his morning without a care, wondering what he’d learn in class today and whether or not he’d done those problems correctly. </p>\n<p>All day at school, he chatted with his friends and took diligent notes. Eventually, the day ended, he finished his homework, and it was finally time to spar with Katsuki like he did every day. All Might wasn’t coming because of a teacher meeting, and that was fine and normal, which is to say that if that was God’s attempt at a warning, it did <em>not</em> work. Izuku arrived at the area in front of the gyms, dressed in workout gear and raring to go. </p>\n<p>Absolutely everything was normal, right up until their final match that ended with Katsuki on top of him as he lay on his back, pinning him to the ground. They were both panting hard, sweaty even in the cool late fall air. Katsuki’s cheeks were flushed pink from exertion, the color only deepened by the pink and orange melting together in the slowly darkening sky. The light from the setting sun glinted off his triumphant, confident grin and sparkling vermillion eyes. </p>\n<p>His strikingly, insanely gorgeous eyes.</p>\n<p>Izuku felt his face go up in flame, far hotter than before, but he couldn’t look away from the glittering pools of ruby red, like he was sinking into them. </p>\n<p>And then, to his mounting horror, a small coin dropped onto his chest as Katsuki’s feral grin turned to a demanded question, one eyebrow raised. </p>\n<p>Izuku contemplated lying. He really did. But he couldn’t bring himself to do that, not after so many years. It would feel like breaking a promise, even though they never promised out loud. So instead, he took a deep breath, grabbed the penny off his chest, and pushed Katsuki to the side, sitting up and keeping his eyes locked on the ground. </p>\n<p>“Kacchanhasreallyprettyeyes,” he blurted as fast as he could, scrambling to his feet and snagging of his water bottle before bolting from the scene, face burning and heart racing. </p>\n<p>By the time he reached the dorms, he felt like his heart was going to burst out of his chest, and he quickly made his way up to his room, mumbling little hellos to his classmates but keeping his head down. When he finally made it, he kicked the door shut behind him and flopped face-first onto his bed, burying his face in a pillow. </p>\n<p>He couldn’t get that image of Katsuki’s face out of his head. Especially those eyes. Gah, what was wrong with him? First, why did he think that? And second, why did he get so flustered and run away like he’d been set on fire when he told Katsuki? He could’ve tried to play it off as an objective observation, because that’s all it was: The objective observation that Katsuki’s eyes looked like dazzling jewels.</p>\n<p>He groaned into his pillow with feeling, wishing he could just fall through the ground like Mirio-senpai and never return. He was never leaving his room again. </p>\n<p> </p>\n<p>Izuku eventually did have to leave his room an hour later, thanks to his rumbling stomach. He tried to sneak into the kitchen without being seen, but of course, Uraraka noticed and cornered him. </p>\n<p>“Deku, is something wrong?” </p>\n<p>“What? No! Why would anything be wrong?” Izuku said, a little too fast. “Just getting some dinner before I go back to studying! Man, school is hard, right?” He forced a laugh, realizing he sounded insane and trying to calm down. </p>\n<p>Uraraka frowned at him deeply. “When you came back from sparring, you didn’t have Bakugou with you. Did something happen? Did he do something?” </p>\n<p>Izuku’s eyes went wide and he waved his hands around. “No! No, Kacchan didn’t do anything.” </p>\n<p>“Why the fuck are you talking about me?” </p>\n<p>Izuku squeaked in surprise as Katsuki came up behind Uraraka, looking almost bored with thumbs hooked in his pants pockets. He met Izuku’s eyes and stared him down with the striking crimson, corner of his lips twitching up in the slightest of smirks. He was doing this on purpose, wasn’t he? </p>\n<p>Izuku quickly broke the eye contact and stared to the side of Katsuki’s shoulders. </p>\n<p>“No reason, Kacchan!” He turned around to focus on getting some food together, and thankfully, neither Uraraka nor Katsuki bothered him anymore. He finished eating and ran back up to his room, slumping onto his bed and holding the rusted penny above his face, twisting it between his fingers. </p>\n<p>He was feeling very conflicted. On one hand, if he gave the penny back, then Katsuki would have another chance to catch him having those random heart-fluttering thoughts. On the other hand, if he never gave it back, he’d ruin whatever they’d been starting to build these past months. They’d been repairing their friendship ever since Ground Beta in first year, but the penny felt like a new level of rebuilding. Less tentative and deep, more about a real, happy friendship like the one they used to have. The one where they were comfortable around each other and talked about anything and everything. The one where they had silly inside jokes and funny games with a penny.</p>\n<p>Izuku sighed, closing his fist around the coin and dropping his hand onto the pillow. He had to give it back. Maybe he could find a chance to embarrass Katsuki, though, as a bit of payback. </p>\n<p> </p>\n<p>He found his moment almost a week later during a gym class. Instead of quirk training, they were focusing on building up physical strength and endurance with different exercises. Izuku had just finished his tenth set of weight repetitions when he caught Katsuki staring from his seat on the bench press a few feet away. He had a very weird look on his face, so Izuku figured he was lost in thought. </p>\n<p>As quickly as he could, Izuku fished the penny out of his gym shorts and tossed it at Katsuki. Katsuki jolted and clapped the penny between his palms, frowning at it. That was a good sign for something embarrassing. </p>\n<p>Then, out of nowhere, Katsuki shrugged and his frown turned into a smirk. He pocketed the coin and leaned back on the bench, propping himself up with his arms and looking relaxed. He tilted his head slightly, meeting Izuku’s eyes. Izuku suddenly felt very nervous and warm. </p>\n<p>“I wonder just how much Deku could lift with those arms of his.” </p>\n<p>A flaming blush slammed into Izuku’s cheeks as he felt his eyes go wide, heart fluttering wildly. Why did he say it like that? Katsuki was still watching him with slightly hooded eyes and a smirk, one eyebrow just barely raised. </p>\n<p>“I-uh…” Izuku stuttered. “I don’t-I’ve never really…never really tried to max out so I-I don’t know, exactly, how much I, uh…” He felt like his face was melting off now. And Katsuki was <em>still staring at him</em>. What was going on? “I mean I’ve lifted All Might before,” he blurted nervously. </p>\n<p>Katsuki raised his eyebrow all the way, frowning slightly. “Anyone could lift him, Deku, the man is a fuckin’ skeleton.” </p>\n<p>“I meant in his big guy form,” Izuku clarified, face still burning. Katsuki blinked at him in surprise, and if Izuku was not mistaken, his eyes went slightly wider. </p>\n<p>“Oh.” </p>\n<p>Oh? <em>Oh</em>? What was that supposed to mean? </p>\n<p>“Yup,” Izuku responded awkwardly, rubbing the back of his neck. He was sweating way too much. Gross. “So…I guess that would be a few hundred kilos.” </p>\n<p>“Yeah, probably,” Katsuki said, sounding slightly hoarse. Huh? Then, Katsuki shook his head a bit and cleared his throat. “I bet I could fucking do that too, nerd.” </p>\n<p>Izuku smiled at him, glad for the normal Katsuki again. “We should ask All Might next time we see him. You have to prove it.” </p>\n<p>“I’ll prove it when you prove it, Deku,” Katsuki said coolly, pushing himself off the bench. </p>\n<p>“Are you saying you don’t think I could do it?” </p>\n<p>“Are <em>you</em> saying you don’t think <em>I</em> could do it?”</p>\n<p>“I’ll believe it when I see it, Kacchan.”</p>\n<p>“Fuck you.”</p>\n<p> </p>\n<p>After that day, the nature of the penny swapping shifted a bit. Instead of tossing the coin to Katsuki at any random moment, Izuku found himself waiting for the times he saw Katsuki looking at <em>him</em>. And what’s weirder, Katsuki seemed to be doing the same thing. This change meant that now, almost all thoughts they shared were about each other.</p>\n<p>Izuku had no idea what to think about it all, and he had no name for what he <em>felt</em> about it all. There were too many feelings to name, really. Though, flustered was probably up there near the top of the list. Especially when Katsuki kept <em>complimenting him</em>. </p>\n<p>Because, sure, Izuku had been forced to voice some thoughts that were a little not-normal (i.e., “Kacchan looks like a supermodel”, which was one of the most embarrassing moments of his life, as he was forced to say it right before sparring Katsuki in front of their class. He lost.), but most of the stuff Izuku thought about Katsuki was stuff he’d been saying proudly since they were kids. But <em>Katsuki</em>, complimenting <em>him</em>? That didn’t happen. Or, on the rare occasions it did happen, it was always something objective and focused on his fighting or quirk improvement. It was a curt nod and a “good work, Deku”. Maybe a tiny smile if it was a really big accomplishment and Izuku got lucky. What it was <em>not</em> was something like “Deku’s improved suit design looks even better on him than before”. </p>\n<p>Because what the hell did <em>that</em> mean?</p>\n<p>Just thinking about all the things Katsuki had said the past few weeks made Izuku’s cheeks go warm, and he was sure he was blushing profusely, so he pulled up the hood of his costume to cover his face. It didn’t help that Katsuki was standing right next to him as they both watched their classmates go through a rescue simulation exercise on the screens. He did his best to focus on the footage of Tokoyami and Uraraka working to dig fake civilians out from under rubble without collapsing the building. Suddenly, he felt someone watching him. When he turned, Katsuki was glaring at him and frowning. </p>\n<p>“What?” Izuku asked nervously. </p>\n<p>Katsuki huffed and reached over to yank on one the ears of his hood. “I hate this stupid hood.” </p>\n<p>“Hey,” Izuku whined, readjusting the mask. “My mom thinks it’s cool.” As soon as he said it, he wanted to take it back. That was way to dorky to say. </p>\n<p>Katsuki still looked disgruntled. “You’re cuter without it.” </p>\n<p>Izuku train of thought comes to a screeching halt. His eyes go wide. Did he hear that right? What the heck? Did Katsuki just say he was cute? </p>\n<p>Izuku ran back through the last few seconds in his head and discovered that yes, Katsuki did just say that and no, Izuku had not given him the penny beforehand. Izuku didn’t even have the penny right now. Katsuki just said it. He’d thought it and then he’d said it of his own volition. </p>\n<p>\n<em>Why?</em>\n</p>\n<p>Did he mean it? Maybe Katsuki was just messing with him. He couldn’t have meant that. Right? No one would call Izuku cute. He was totally plain. He knew that. Especially next to Katsuki, of all people. Yeah, Katsuki calling him cute was definitely a joke. Teasing. It was a weird tease, but may-</p>\n<p>“Oh my God, Deku, stop it,” Katsuki snapped, making Izuku jolt and realize he had slipped into mumbling. </p>\n<p>“Sorry,” he squeaked, shying away from Katsuki a bit. Katsuki frowned at him again, but instead of the previous judgment, he looked almost concerned. </p>\n<p>“I wasn’t joking,” Katsuki said out of nowhere. Okay, well, it wasn’t out of nowhere, but it still always shocked Izuku that Katsuki could understand any of his rambling mumbles. Katsuki was probably the only one that could. </p>\n<p>And then what Katsuki actually said fully catches up to him. </p>\n<p>“What?” he squeaked again. </p>\n<p>Katsuki met his eyes, then cleared his throat and looked away. “I mean…I won’t, uh, say it again if you don’t…want me to.” </p>\n<p>It is utterly humiliating how fast Izuku jolts up and says, a bit too loudly, “No!” Katsuki turns back to look at him, brows raised. Izuku feels his face heat up dramatically under the red stare and the weight of what he just said. How was he supposed to say that he like it when Katsuki complimented him? Did he like it? He kinda definitely did.</p>\n<p>Katsuki squinted at him, then, seemingly out of nowhere, the penny was between Katsuki’s fingers as he held it up and presented it to Izuku. </p>\n<p>Izuku’s heart beat wildly in his chest as he took the coin and dropped it in one of the pouches on his costume. He couldn’t bring himself to meet Katsuki’s eyes anymore, so he looked back at the screens, where Uraraka and Tokoyami looked almost finished. </p>\n<p>“It’s…uh…nice when Kacchan compliments me,” he finally manages, barely loud enough for anyone to hear. His shoulders are up by his ears by now, and he’s sure his face is bright, strawberry red under his hood. He was too scared to look and see whatever expression Katsuki has on. </p>\n<p>“Bakugou! Ashido! You’re up!” Aizawa-sensei calls before Katsuki or Izuku say anything more. </p>\n<p>Izuku finally starts to turn, thinking he should at least wish Katsuki good luck to not be weird, but suddenly feels another tug on his hood as it’s pulled all the way down. Katsuki let go of the ears, grinning that grin that he has whenever he wins something. A million butterflies fluttered in Izuku’s stomach as his heart skipped a few beats. </p>\n<p>“Guess I’ll have to keep doing it then, nerd,” Katsuki said cockily, taking a few steps backwards towards the exit while keeping his eyes on Izuku before turning around and walking out, leaving Izuku a melted puddle of confusion and feelings on the floor. When Uraraka comes in with Tokoyami, he’s forced to pull himself together enough to form the words “nice job” but not enough for Uraraka to miss how he’s acting. </p>\n<p>“Did something happen?” </p>\n<p>“Uh.” Is all Izuku can manage, mind still racing with echoes of words and images of Katsuki’s grin.</p>\n<p>“Deku? You okay?” </p>\n<p>“Yup,” Izuku said, trying to muster up a normal smile. His eyes keep drifting to the door that Katsuki left out of. Suddenly, Uraraka waves a hand in front of his face, making him physically startle, blinking a few times to bring himself out of his head. Gah, what was wrong with him? “Yes?” </p>\n<p>Uraraka frowns and squints at him. “Deku, seriously, are you okay? You’ve been weird lately.”</p>\n<p>“I have?” Izuku asked, though he was sure he had been. </p>\n<p>“Yeah…I feel like it has something to do with Bakugou.” </p>\n<p>Izuku feels his face heat up against his will. His body is betraying him. “What? Kacchan?” he said, far too high-pitched. “What does he have to do with anything?” Uraraka gives him a <em>look</em>, and he smiles at her nervously. “So!” he said before she could confront him further. “Tell me about the simulation! You don’t work with Tokoyami a lot, right? How did it go? I bet your quirks work well together for a rescue operation!” </p>\n<p>Uraraka kept looking at him for a second, obviously hesitant to let it go, but she eventually smiled at him. “It was great! And you’re right, out quirks did work well together.” </p>\n<p> </p>\n<p>After <em>that</em>, things changed even more. Katsuki was complimenting Izuku almost as much as Izuku complimented Katsuki, even without the penny. And even when they weren’t sparring or something. Izuku still got flustered every time it happened, but he was starting to get better at hiding it. He was also getting more confident in his own compliments and shared thoughts, because, hey, if Katsuki was going to say he thought Izuku’s messy hair was cute, then he could say he thought Katsuki’s different smiles were awesome. </p>\n<p>Izuku didn’t know what any of it meant, though. He and Katsuki were friends as well as rivals, and he could say that with confidence now, but was this something you did with a friend? It wasn’t something you did with a rival, he guessed. Whatever it all was, Izuku didn’t want it to end. Even all the weird, fluttery butterflies and melty-ness. </p>\n<p>“Oi, Deku,” Katsuki said from across the table where they were both finishing up an assignment after evening sparring. “Pick up the couch.” </p>\n<p>Izuku frowned at him. “Really?” That was another new thing. Ever since Izuku said he could lift All Might, Katsuki and Izuku had been daring each other to pick different things up to see if they could. The heavier, the better. Izuku had to admit, he liked this game more than a bit. Katsuki was easily stronger than most of their class and had the muscles to show it. </p>\n<p>“Are you saying you can’t?” Katsuki challenged with a smirk, resting his chin on his palm. </p>\n<p>Izuku met his smirk with the new confidence he’d been building. “Are you sure you don’t just want to watch me lift it?” It slips out before he can even think it all the way, but he bites his tongue to stop himself from taking it back. Katsuki’s eyes widen a bit, and his hand drops down as he sits up straighter, mouth open but not saying anything. </p>\n<p>“Shut the-why would I-” Katsuki splutters, and holy crap what is going on. “Stop fucking stalling, Deku,” Katsuki eventually snaps. His cheeks are tinted pink, and the confidence in Izuku’s chest overflows. </p>\n<p>He smiles and shrugs his shoulder. “Sure, Kacchan.” He pushed himself up from his seat and made his way to the nearest couch, where Ashido and Hagakure were lounging around and chatting. “Excuse me!” he announced, getting the girl’s attention. “Kacchan wants me to prove I can pick up this couch. I don’t want to lift you up if you don’t want me to.” </p>\n<p>“Could you do it with us on it?” Hagakure asked. </p>\n<p>“Yeah,” Izuku answered coolly, not used to the feeling but basking in it anyways. Ashido’s black and yellow eyes went wide and sparkled as she grinned and pulled her legs up on the couch. </p>\n<p>“Do it!” she cried excitedly. </p>\n<p>“Yeah!” Hagakure agreed. </p>\n<p>“Okay, then! Please hold on, I don’t want you to fall.” Izuku rolled his shoulders back to ready himself before bending his knees, slipping his arms under the couch, and lifting it up with a grunt. The girls shrieked with laughter as he stood up fully, leaning back slightly to tilt the couch up so he could keep it balanced. After a moment like that, he took a deep breath and hefted upwards, lifting the above his head so he could turn to beam at Katsuki. “That good enough for you, Kacchan?” </p>\n<p>Katsuki blinked at him like he hadn’t been listening, then rolled his eyes. “Fine, you got me.” Izuku smiled wider and slowly lowered the couch to the ground, setting it down gently as he panted. </p>\n<p>“Oh my God!” Ashido squealed, leaning over the side of the couch towards Katsuki. “Bakugou is <em>blushing</em>~!” </p>\n<p>Katsuki jolted to his feet and slammed his fist down on the table, glaring menacingly. “What?” Now that Ashido mentioned it, Izuku did see a flush of red on his cheeks. Huh?</p>\n<p>“Kacchan, are you okay?” Izuku asked, concerned. Maybe he was sick? Suddenly, Ashido and Hagakure started cackling as Katsuki just gaped at him, looking somewhere between angry and incredulous. </p>\n<p>What kind of reactions were…those…wait. Realization slowly dawned on him. Was Katsuki actually blushing? Because he picked up a couch? But why? He patted his pocket for the penny, only to remember that Katsuki had it. </p>\n<p>Katsuki glared at him, noticing what he was doing. “No way, Deku.” </p>\n<p>Izuku frowned, his confidence beginning to wilt. Why would Katsuki start hiding things again now? What did he do? “Sorry.” </p>\n<p>Katsuki glare softened a bit, then he glanced back and forth between Izuku and the still laughing girls, seeming agitated. “Wait, no-gah, fuck this,” he swore, groaning in exasperation. Suddenly, he made a b-line for Izuku and grabbed him by the wrist, dragging him away from the couch. “C’mon, Deku.” </p>\n<p>Izuku squeaked in surprise and followed Katsuki out of the dorms as the girls laughed and shouted things after them, but he didn’t hear what because he was too focused on what Katsuki was doing and the spiral of worry in his head. Was Katsuki mad at him for something? Did the girls tease him too far? Did <em>Izuku</em> tease him too far? He was only joking about the wanting-to-watch thing, because why would Katsuki want to see that? Then again, he did blush, but that was just a fluke or something. Why else would he blush? Maybe he wasn’t even blushing. </p>\n<p>“Deku,” Katsuki deadpans, snapping Izuku out of his mumbles and making him come to screeching stop right in front of Katsuki. He quickly takes a few steps back, then realizes Katsuki pulled him to the edge of the forested area behind the dorms. </p>\n<p>Okay, so this was a private conversation. That could go numerous different ways. One of them could be a fight, but that hadn’t happened in long while. Maybe Katsuki wanted to spar? He seemed agitated, and Izuku knew sparring was his preferred way to let off steam – as opposed to yelling and blowing things up, which he would usually do if not presented with the first option. He could’ve just asked to spar if he wanted to, though, instead of-</p>\n<p>“Deku!” Katsuki yelled. “I’m not gonna fight you! Shit, is that what you think of me?”</p>\n<p>All Izuku can do is stare at him because…well, yes, that’s the impression Katsuki had given off the past 17 years of their lives. </p>\n<p>Katsuki’s angry look melts off his face, replaced by something akin to defeat or resignation. It was a very strange, wrong look on his face, and made Izuku worried. </p>\n<p>“Of course it is, it’s what I deserve,” Katsuki sighed. What? “No, Deku, I did not drag you out here to start a fight or something. I did that because I needed to get us away from those annoying-ass squealing idiots.” </p>\n<p>“Ashido and Hagakure?”</p>\n<p>“Yeah, them.” </p>\n<p>“I don’t…they were just teasing, you know. Me too. I know you weren’t…uh…” Izuku trailed off, unsure exactly what he knew Katsuki wasn’t. </p>\n<p>“No, Deku-” Katsuki cuts himself off with another groan, raking his hands through his pretty ash-blonde hair. “Fuck, I don’t…” </p>\n<p>Izuku frowned. He’d rarely seen Katsuki this unsure. Whatever he was trying to say had to have been weighing on his mind for a long time. </p>\n<p>Katsuki had always been a man of action, meaning he happened to struggle a lot with words. Usually, he chose to forgo any attempt to voice whatever he was thinking and said it with his actions instead, and Izuku was able to understand – or at least eventually coax enough words out of him to piece it together. But this felt different. It felt like Katsuki really <em>wanted</em> to say what he was thinking but just couldn’t bring himself to. And he didn’t want to use his normal solution for that problem. </p>\n<p>Izuku could work with that. </p>\n<p>He held out his palm expectantly, and Katsuki stared down at it, confused. After a beat, Katsuki produced the penny from his pockets and dropped it onto Izuku’s palm. </p>\n<p>“I wish Kacchan would say whatever’s on his mind since it seems to stress him out so much,” Izuku said. “I don’t like seeing him like this, I want him to be happy.” Katsuki looked at him with and unreadable expression, and Izuku pushed the penny back into his friend’s hand. Then, he waited. He would always wait as long as Katsuki needed. </p>\n<p>After a minute of silence and the two of them just staring at each other, Katsuki finally spoke. His voice was far softer and quieter than normal, yet there wasn’t a drop of uncertainty in the faint roughness. </p>\n<p>“Deku is probably the only person in the entire world who’d be dumb and amazing enough to put up with me this long. I want to kiss him.” </p>\n<p>Izuku felt himself start to melt under the unwavering gaze of Katsuki’s crimson red eyes as a wobbly smile spread across his lips. Was this real? Katsuki really just said that?</p>\n<p>Katsuki slowly lifted his hand and pressed the penny into his scarred palm. Izuku was hardly able to formulate a thought right then, let alone any words, but he manages one: “Okay.”</p>\n<p>It’s like time skips over a second or two, and he’s suddenly leaning up slightly and Katsuki leans down presses their lips together. Katsuki’s lips are soft and he tastes faintly of wasabi, a hint of spice that makes Izuku’s lips tingle, but he enjoys it all the more because it’s Katsuki. He feels Katsuki’s hands running through his hair and he responds by hugging Katsuki’s waist and pulling him close. The warm penny was still enclosed in the fist he had pressed against the back of Katsuki’s shirt. </p>\n<p>When they pull away a few drawn out moments later, Katsuki’s hands move from his hair and he rests his arms over Izuku’s shoulders, staring down at him with a look so soft and foreign that Izuku takes a second to remember what breathing is. </p>\n<p>And then what exactly just happened slams into him like a bullet train at full speed, and the anxiety starts building in his chest with the nervous blush that spread across his cheeks and ears. But, to his surprise and slight horror, the anxiety bubbles up and fizzes out in giddy, insane giggles. </p>\n<p>Katsuki looked baffled. “What the hell, Deku?” </p>\n<p>As the Izuku in his head is screaming at him to calm down because he is very much ruining the moment, all he can do outside his head is giggle even more and press his forehead down onto Katsuki’s shoulder, trying to pull himself together. Crap, he is really bad at this. Why can’t he stop laughing? </p>\n<p>Katsuki’s hands are placed on the back of his head again. He likes the way they feel in his hair. “Deku? Why the fuck are you laughing?” </p>\n<p>Izuku giggles so hard he snorts, pressing his nose into Katsuki’s shoulder to muffle the sound. Holy crap, he’s <em>giddy</em>. Is this what being drunk feels like? </p>\n<p>“You kissed me!” he eventually manages through another giggle. He hugs Katsuki closer by the waist. </p>\n<p>“It felt mutual to me, nerd.” Katsuki ruffled his hair, making Izuku laugh again and look up at him. He’s so pretty with his silly confusion mixed with a smile, and Izuku can’t help but lean in to smack their lips together again, only for a second. Katsuki looked shocked and Izuku beamed at him. </p>\n<p>“You taste spicy, Kacchan,” is all he can think to say. He is so, so bad at this but Katsuki is smiling again so he must be doing something right. </p>\n<p>“Yeah, well you taste like salt. From all that junky shit you eat.” </p>\n<p>“Darn it. I need to eat something sugary.” </p>\n<p>Katsuki raised and eyebrow. “Why?”</p>\n<p>“Because,” Izuku said, leaning in to bonk their noses together like it’s the most natural things in the world, “then we’re sweet and spicy.” </p>\n<p>“It’s supposed to be sweet and salty, dummy,” Katsuki says, but his cheeks are flushed just as pink as Izuku’s. Izuku blinks at him, then shrugs. </p>\n<p>“Then I guess I have to kiss you enough to make <em>you</em> the salty one, <em>then</em> go eat something sweet.” He enjoys the way Katsuki melted into him a little as he pressed their lips together once more, glad he’s not the only one. He feels like if he lets go of Katsuki’s waist he’s going dissolve into the grass. </p>\n<p>“Asshole,” Katsuki grumbled when they part, “why do I have to be the salty one?”</p>\n<p>Izuku laughed a little. “I think even you know that, Kacchan.” </p>\n<p>“I can be sweet,” Katsuki said, in a similar way to when he says, ‘I can win this’, like it’s a challenge he’s facing head-on. It’s adorable, and Izuku thinks he’s dying because of it. </p>\n<p>“As I’ve learned!” he chirped, squeezing Katsuki’s waist again. “What was it you said? Deku’s amazing?”</p>\n<p>“I think you’re paraphrasing a bit there,” Katsuki said, tilting his head. </p>\n<p>Izuku finally unlatches his arms from around Katsuki’s waist to quickly drop the penny in his pocket and cup Katsuki’s cheeks in his hands, squishing them together a bit. “Kacchan thinks I’m amazing~!” he sang, beaming as his heart fluttered happily in his chest. “Say it.” </p>\n<p>Katsuki huffs at him, then rolls his eyes and pries Izuku’s hands off his face. He interlaces their fingers and meets Izuku’s eyes with a tiny, almost dopey smile that’s barely even there. “Deku sugoi.” </p>\n<p>Izuku squeaks in surprise because he hardly expected Katsuki to actually say it, and feels like he might start crying. </p>\n<p>“If you cry right now, Deku, I swear-” But Izuku doesn’t hear the rest of Katsuki’s threat, because he sweeps him into another kiss. He squeezes Katsuki’s hands that are in his own, and Katsuki squeezes back before they part. This feels like a lot of kisses before you even have a single date with somebody, but who is Izuku to say anything at all about romance. Wait, would they go on dates? </p>\n<p>“Kacchan?” </p>\n<p>“Yeah?” </p>\n<p>“Are we…” Izuku trailed off nervously. He feels so stupid asking this, but he has to know. “Are we…dating now?” </p>\n<p>Katsuki snorts. “Well, I think I’d have to take you on an actual date for that first. Which was my original plan.” </p>\n<p>Izuku blinks up at him in surprise. “Your plan?” </p>\n<p>Katsuki blushes again. It’s adorable and amazing when he does that. “Yeah, my fucking plan. How else was I supposed to get anywhere with this?” </p>\n<p>“You had a plan…to date me?” Izuku asked, not believing a word of it. “What was the plan?” </p>\n<p>Katsuki looks almost flustered. Izuku could get used to this. “I fucking…I had a different thing going where I’d ask you to lunch or something but then Raccoon Eyes and the Invisible chick got all…you know, and I made a split second change to confess you out here because I thought you’d figure it out on your own if I didn’t.” Izuku is already shocked out of his mind, but Katsuki keeps going. “Anyways, I was being a weak bitch until you, of course, figured out exactly what to do.”</p>\n<p>“What?” Izuku squeaked. Katsuki had a plan to ask him out. Not only had Katsuki been wanting to do that for long enough to make a plan, but he also made a plan as if it was a battle. Of course he did! He was just as much of a nerd as Izuku was. Always had been. </p>\n<p>“You know me too well, Deku,” Katsuki said, but he didn’t sound mad about that all. </p>\n<p>Izuku couldn’t stop an silly, happy grin. “I also know you’re not one to drop a plan halfway through, Kacchan. Where’s my date? And the confession? Did you write it out beforehand?” </p>\n<p>Katsuki glares at him. “So what if I did?” </p>\n<p>“Ah! Nerd!” Izuku squeals, letting go of Katsuki’s hands and latching around his torso again. </p>\n<p>“Don’t make fun of me!” Katsuki protested. “I didn’t want to fuck up!’ </p>\n<p>“I’m not making fun, Kacchan,” Izuku assured him. “Who would I be to do that?”</p>\n<p>“What do you mean?” </p>\n<p>It’s Izuku turn to blush. “Okay, I may or may not have twelve different notes to you drafted in one of my notebooks.” </p>\n<p>“What?” </p>\n<p>Izuku buried his face in Katsuki’s chest and groaned, embarrassed beyond belief. He’d been writing notes addressed to Katsuki on and off since the start of first year, but the crush notes only started near the end. He hadn’t even recognized them as crush notes until just then, nor had he ever planned to send them or tell Katsuki about them at all. </p>\n<p>“You know what, nerd?” Katsuki said, grabbing Izuku’s cheeks to tilt his head up. “I’ll read you mine when you read me yours. All twelve of ‘em.” </p>\n<p>“Not fair!” </p>\n<p>Katsuki smirked and squished his cheeks together. “Totally fair.”</p>\n<p>Izuku smiled, squishing his face even more against Katsuki’s palms and crinkling up his nose. “Fine, Kacchan, be careful what you ask for. I’m gonna make you listen to me read every single notebook I have on you. From when we were 6 onwards. That’s over ten years’ worth.” </p>\n<p>“Jokes on you, Deku, I’d love to hear ten years’ worth of you rambling about me. Music to my ears.” Katsuki is full on grinning now, so Izuku’s original plan may have backfired but this new outcome is totally welcome. He’s so pretty when he smiles like that. Or ever. Actually, he’s pretty all the time. And for some reason he likes Izuku. Izuku would be an idiot to question it and chance ruining this, so he tries his best not to. </p>\n<p>“You’re so full of yourself,” he teased, sticking his tongue out. Katsuki moves his hands from Izuku’s cheeks back up to his hair, which he seems to have an affinity for. </p>\n<p>“For good reason,” Katsuki shoots back with a cocky smirk. “Now, you were right, I do have to finish at least part of my plan, even though I’m backing up a few steps.” Izuku stifled a giggle and Katsuki glared at him, then cleared his throat. “Deku, you should go to lunch with me sometime. As a date.” </p>\n<p>“I <em>should</em>?” Izuku repeated, grinning. “Not really giving me a choice, huh?” </p>\n<p>“If you said no, I’d probably die, so I tried not to give you that option.” </p>\n<p>Izuku can’t stop the giggles now, and leans in to smack another quick kiss to Katsuki’s soft lips. “Don’t worry, Kacchan, the answer is yes.” </p>\n<p>“Thank fuck.”</p>\n<p>Izuku’s giggling is uncontrollable now, and he can’t stop, even as Katsuki pulls him into another kiss.</p>"
}