{
  "id": "29419434",
  "url": "https://archiveofourown.org/works/29419434?view_full_work=true",
  "author": [
    "mysterycyclone"
  ],
  "title": "Worst Summer Vacation",
  "rating": "Not Rated",
  "archive_warnings": [
    "Graphic Depictions Of Violence"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "Marvel Cinematic Universe",
    "The Avengers (Marvel Movies)",
    "Spider-Man (Tom Holland Movies)"
  ],
  "relationships": [
    "Peter Parker & Tony Stark",
    "Peter Parker & Steve Rogers",
    "James \"Bucky\" Barnes & Peter Parker"
  ],
  "characters": [
    "Peter Parker",
    "Steve Rogers",
    "James \"Bucky\" Barnes",
    "Tony Stark"
  ],
  "additional_tags": [
    "Peter Parker Whump",
    "Peter Parker is a Little Shit",
    "Peter Parker Needs a Hug",
    "Protective Steve Rogers",
    "Protective Bucky Barnes",
    "Hydra (Marvel)",
    "Post-Spider-Man: Homecoming",
    "Tony Stark Acting as Peter Parker's Parental Figure",
    "(somewhat literally)",
    "Kidnapped Peter Parker",
    "Imprisonment"
  ],
  "language": "English",
  "series": "",
  "published": "2021-02-14",
  "completed": "2021-02-16",
  "words": "14,240",
  "chapters": "3/3",
  "comments": "504",
  "kudos": "21,180",
  "bookmarks": "5,128",
  "hits": "139,023",
  "summary": "<p>The last thing he remembers is leaving school. It was a half day, as he’d finished his exams early, texted May about staying over at Ned’s place, sent another text to MJ and then a twitch of his spider senses--</p>\n<p>Then a pinch at his neck, like a bee sting, but deeper. Darkness. Then here.</p>\n<p>Huh. Kidnapped. That’s new. If he was less emotionally dead from finals and sleep deprivation, he’d probably have a stronger and much more appropriate reaction to that.</p>\n<p>At least he's got Captain America and the Winter Soldier to keep him company.</p>",
  "notes": "<p>Trigger warning for torture.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>Fun facts:<br>-The only google search for this fic was \"controversial baseball opinions.\"<br>-This delayed any actual progress made on the fic by an hour.<br>-This was supposed to be a one-shot.</p>",
  "text": "<p>Peter wakes gradually. The floor beneath him is freezing cement, his head is absolutely throbbing with pain, and his hands and fingers are stiff and numb from restraints that have recently been removed. He rolls to one side, blinks at the blank cement wall in front of himself, then rolls over some more and flops onto his back with a grunt. The ceiling is just as bleak; smooth cement with bare fluorescent lights bolted to it.</p>\n<p>He frowns at it. The last thing he remembers is leaving school. It was a half day, as he’d finished his exams early, texted May about staying over at Ned’s place, sent another text to MJ (gif war using gifs only from 90s rom coms; he’s on the losing side of it so far), and then a twitch of his spider senses--</p>\n<p>Then a pinch at his neck, like a bee sting, but deeper. Darkness. Then here.</p>\n<p>Huh. Kidnapped. That’s new. If he was less emotionally dead from finals and sleep deprivation, he’d probably have a stronger and much more appropriate reaction to that.</p>\n<p>Peter sighs, pushing himself up onto his feet and brushing dust off himself. When he finally looks up, he realizes he’s not alone. He’s in a cell between two others, lined by thick steel bars just wide enough to allow him to peer into the other cells. </p>\n<p>On his right is the Winter Soldier, missing his metal arm, sitting on the ground and watching Peter closely. His jaw is clenched, and there’s blatant concern in his eyes when he meets Peter’s gaze. He’s wearing regular clothes; jeans and a plain t-shirt, and they both look relatively fresh. So he’s probably a recent arrival, too. </p>\n<p>Peter blinks at him, then turns to his left. The cell on his right has an occupant as well: Steve Rogers, Captain America himself, is chained to the wall of his cell. His hands are trapped inside manacles and suspended above his head. He looks much the same as the Winter Soldier. Clean, healthy, and very, very confused as to why Peter's here. Which makes three of them, to be honest.</p>\n<p>Okay, three cells, three prisoners. What about the rest of the place?</p>\n<p>Peter looks around the ceiling, tracing out the lines of cords leading to each camera. He squints up at the lights, the speakers mounted in the corners of the ceiling, the bland metal desk with a phone on top tucked in the corner, and the thick steel door leading out of the cell area, committing each to memory.</p>\n<p>He does this for two reasons: one, it's a practical use of his time. He might be able to figure out a way to hijack the security system or at least sabotage it. Admittedly, that's a pretty big 'if' at the moment, but hey, he might strike gold. At this point, the universe kind of owes him.</p>\n<p>Two, it'll keep him from looking at Captain America and the Winter Soldier, who are both still staring at him. Peter is a socially awkward disaster at the best of times; he's not that eager to embarrass himself in front of his childhood hero and a world class assassin yet. They’ll have plenty of time for that later when he can’t keep his mouth shut around whoever kidnapped him.</p>\n<p>Unfortunately, the first reason ends up sabotaging the second: Captain America's restraints are tied directly to the security system itself. He grips the bars separating their cells and peers at the restraints. Wires trace the outline of the massive manacles suspending his arms in the air. Peter has a sneaking suspicion that breaking those connections might release whatever the glass vials he can see peeking out of the air vents are holding. Crude, but admittedly effective. </p>\n<p>Peter grips the bars leading into Captain America's cell (still avoiding his eyes) and tests them, using just a <em>bit</em> of his strength. He isn't surprised when they don't move in the least, but he is a tiny bit disappointed. All of the bars surrounding the three cells look to be the same, which means they're meant to keep in people just as strong as Peter. </p>\n<p>That's not a good sign.</p>\n<p>Well, Captain America being strung up like a turkey is also a bad sign but whatever. This is probably like a regular Tuesday for the guy. Peter’s still on the <em>new</em> side of being a hero, and this is definitely the first time he’s been kidnapped, so he’s allowed to be a little anxious about it.</p>\n<p>The door swings open and an average looking man in a dark trenchcoat steps into the room. There’s absolutely nothing special about the guy. He's almost offensively bland. Middle aged, brown hair with a receding hairline and flat brown eyes. If it wasn’t for his current circumstances, Peter wouldn’t even give him a second look.</p>\n<p>Right now, however, he has Peter’s full attention.</p>\n<p>\"Find something interesting about your new accommodations?\" the man in the trenchcoat says, his words tinted with an almost stereotypical German accent. And not a recent accent; this German sounds <em>slightly</em> out of date and forced.</p>\n<p>Which confirms one of Peter’s suspicions, at least.</p>\n<p>\"A few things, yeah,\" Peter replies, turning to face him, shoving his hands into his pockets. \"Well, they all add up to one thing, really. So I’ve noticed <em>one</em> interesting thing in your prison.\"</p>\n<p>\"Do tell.\"</p>\n<p>\"You're broke,\" Peter says simply. </p>\n<p>The man quirks an eyebrow at him. \"You were able to guess that just from being put into one of my cells?\"</p>\n<p>\"It's pretty obvious if you stop to look,\" Peter replies with an easygoing shrug, watching the man closely. \"This whole security system is a ramshackle DIY kit. I'm guessing most of your budget went to the cells and the chains holding back Cap? Which is probably fair. I’d be pretty scared of him too, if I were you. You know, given your history.\"</p>\n<p>That earns him a narrow eyed look from the man. </p>\n<p>\"So I can also guess that being in Hydra isn't exactly lucrative these days,\" Peter adds, half to himself while he looks over the security system again. The wires branching off to the lock on Cap’s cell door look weak. If he gets close enough to them, he might be able to short them out and open the door. \"Which, again, I'm probably not going to cry over. Also whoever wired this room should be fired, that’s the sloppiest cable management I’ve ever seen.\"</p>\n<p>A long moment of silence follows Peter’s words, and then the man smirks at him, triumphant, his eyes glittering. \"You know, I was unsure about your identity until now, but your little demonstration just made my life much easier. Thank you for confirming it.\"</p>\n<p>Peter feels himself go cold. He frowns, facing the Hydra agent. \"My identity?\"</p>\n<p>\"Oh, yes. Your father is fond of being as annoying as humanly possible when put in these situations, too,\" the man replies. He ignores Peter's dumbstruck expression to focus on the other two prisoners. \"Captain Rogers, Sergeant Barnes, say hello to Peter Parker, Tony Stark's son.\"</p>\n<p><em>What.</em> </p>\n<p>Captain America and the Winter Soldier's heads snap towards Peter again. He ignores them, staring at the man in the trenchcoat, who grins at him smugly.</p>\n<p>\"I think you're a little off target, pal. I'm just an intern for Mr. Stark,” Peter says.</p>\n<p>In answer, the man turns on a holoprojector on the table. An image of the Compound appears, Peter and Tony walking side by side. Tony looks completely relaxed, with one arm casually slung across Peter's shoulders. He's making some grand gesture with the other arm and Peter is grinning up at him like a starstruck idiot.</p>\n<p>Peter pauses for a beat. \"Okay, so that looks a <em>little</em> suspect but--\"</p>\n<p>The Hydra agent presses a button and several more images cycle through. Tony giving Peter keys to one of his precious cars for his driver's license test. Tony walking down a snowy sidewalk, deeply immersed in a phone call while Peter winds up to throw a snowball the size of a grapefruit at the back of his head. Tony laughing uproariously at Peter as he flinches back from a pigeon pooping on his shoulder.</p>\n<p>The Hydra agent shuts off the holographic projector and quirks a brow at Peter.</p>\n<p>\"First of all, that's <em>very</em> creepy,\" Peter says. \"Also, why did you keep that last one?\"</p>\n<p>\"It amused me,\" the man replies smugly.</p>\n<p>Great. The eugenicists find him <em>amusing.</em> Also they seem to be very dumb. \"And you've kidnapped a sixteen year old because why? Come on, man, summer <em>just </em>started.\"</p>\n<p>\"I have a use for you,\" the agent replies. \"Well, a potential use for you. It depends on your blood test.\"</p>\n<p>\"Wait, you took my <em>blood</em>?\" Peter asks. He rolls up the sleeve of his hoodie and finds a thin trickle of dried blood along the inside of his elbow. </p>\n<p>\"Yes, obviously,” the man says, exasperated. “We also kidnapped you. Why are you more offended by losing a vial of blood than you are for being <em>kidnapped</em>?\"</p>\n<p>\"Dude. You don't just steal people's blood.\"</p>\n<p>“We are <em>Hydra,</em>” the man retorts, partially in disbelief. “We stole you from the steps of your school, and brought you across the country---”</p>\n<p>He stops suddenly. </p>\n<p>Peter tilts his head, smiling innocently. “So, I’m still in the US, which makes sense. Smuggling people out of the country is pretty expensive and we've already established you're under a budget. And across the country. I’m guessing the desert? Probably New Mexico or Arizona, definitely an underground bunker judging by the sound of the vents. How close am I? Oh, maybe California! I’ve always wanted to visit Disneyland.”</p>\n<p>He gets nothing but a scathing look in reply, and Peter’s grin grows cheeky.</p>\n<p>Okay, maybe he <em>has</em> been spending too much time with Tony.</p>\n<p>Whatever.</p>\n<p>The Hydra man turns his back to them, going back to his desk. Captain America is watching Peter closely with an expression caught somewhere between guilt and extreme concern. The Winter Soldier watches him from the corner of his eye, jaw clenched. Peter begins to worry he’s upset some kind of power balance here; his snark might cost both of these guys something. Food, water, maybe something else.</p>\n<p>Although, from everything he’s heard, Hydra also has no issue with beating the snot out of a mouthy teenager, too. He decides to dial back the quips. A bit. He should be focusing on how to get out of this mess anyway.</p>\n<p>He sneaks a look over at Captain America and is partially relieved to see he's now staring daggers at the back of the Hydra agent's head. If looks could kill, the agent would be a smoldering pile of ash right now.</p>\n<p>A bakelite phone on the small desk rings suddenly, and the man in the trenchcoat grabs it and presses it to his ear, his back facing the three prisoners. Peter can’t make out what’s being said; too muffled. That doesn’t seem to ring true for Captain America, who strains to hear the phone conversation. He looks disturbed by what he’s hearing.</p>\n<p>The man in the trenchcoat sighs, sets the phone down and turns to face Peter. He scowls at him. \"You are dying.\"</p>\n<p>Peter stares at the man, blank faced. Usually they <em>threaten</em> death. Things like 'I <em>will</em> kill you.' or 'you <em>will</em> die for that!' and other melodramatic nonsense. Hearing it in the present tense is weird. And inaccurate, as far as Peter knows.</p>\n<p>“Uh, no, I’m not?” Peter replies. He’s so confused that his tone becomes utterly unconvincing. </p>\n<p>\"We tested your blood. There are traces of radiation in it. Cancer treatment.\" The Hydra agent sneers. \"And judging by what my people have found, the treatment is failing.\"</p>\n<p>Peter stares at the man blankly until realization hits. They found his spider mutation and assumed it was cancer. This changes things. First, it paints Hydra pathologists in a <em>very</em> poor light. Second, it gives Peter a chance to set their expectations on his ability to escape low enough that they'll definitely slip up.</p>\n<p>Fuck yeah, cancer.</p>\n<p>He can <em>feel<strong> </strong></em>Captain America and the Winter Soldier staring at him, horrorstruck. He ignores them both. They might see the lie painted right across his face.</p>\n<p>\"What is your prognosis?”</p>\n<p>\"What?\" Peter asks, </p>\n<p>\"How long do you have to live?\" the man asks, annoyed.</p>\n<p>\"Um, it’s terminal. There's nothing they can do for it,\" Peter says warily. Technically true; his spider powers aren't going to just <em>disappear. </em>He is terminally half spider. \"We're at the 'play it by ear' stage, according to T--dad.\"</p>\n<p>That feels weird to say out loud. God, hopefully he doesn’t have to repeat it or make a habit of it. He doesn’t know who would flee the room first if he ever said it to Tony. Peter would lob himself out of the nearest window if he accidentally said it during their weekly dinner and he’s pretty sure Tony would do the same from an opposite window, if only to avoid the awkwardness.</p>\n<p>Pepper’s face would probably be priceless, though.</p>\n<p>The Hydra man scoffs. \"Four weeks or less, then. This will complicate things.\"</p>\n<p>He gives Peter one last scathing look before leaving the cell area, and Peter finds himself feeling more than a little offended over it. The man found out a kid has cancer and acts like it's inconveniencing <em>him?</em> What a dick.</p>\n<p>Well, okay, he <em>doesn't </em>have cancer but the point still stands.</p>\n<p>An awkward silence follows. Captain America and the Winter Soldier continue to stare at him, and he fidgets uncomfortably.</p>\n<p>\"Uh. Hi, Captain America. Sergeant Barnes,\" Peter says.</p>\n<p>\"Hey,\" the Winter Soldier replies, clearly just as socially awkward as Peter. \"You might as well call us by our real names, kid. Bucky and Steve.\"</p>\n<p>“Oh. In any other context, I would absolutely lose my mind over this and ask for, like, autographs or something,” Peter says absently. </p>\n<p>The room falls into awkward silence.</p>\n<p>\"Why didn't Tony tell us about you?\" Steve asks quietly.</p>\n<p>How the hell does he answer that? Peter is quiet for a moment, gathering his thoughts.\n\"We only met the day he went to Germany,\" Peter finally says, feeling very strange lying to Captain America like this. He can't risk telling the truth; this room is definitely bugged for sound. Like it or not, he’s all in on this lie. \"He pretty much jumped on a plane after we first met. And then I didn't see him after that because of Rhodey's surgeries. Happy looked after me when he could, but he was pretty busy, so I just kind of....didn't see him for awhile?\"</p>\n<p>Of all possible reactions Peter expects from that, he was <em>not</em> prepared for the look of crushing guilt on Bucky's face, nor the heartbroken one on Steve's. For the life of him, he can't figure out why they look so upset.</p>\n<p>\"I mean, he made up for it later? It was kind of a rocky start, I guess. It happens. And that was awhile ago anyway, so whatever,” Peter rambles, mostly to himself. After a few moments of intensely awkward silence, he clears his throat and looks at the two men. “So, uh, how did you two end up here?”</p>\n<p>“That’s not important at the moment,” Bucky says. “You should focus on yourself.”</p>\n<p>“Bucky’s right,” Steve says with a sigh. “Just settle in. Wait for the others to find us.”</p>\n<p>That’s as sound a plan as any, given that they’re all trapped in cages specifically meant to nullify their strength. Peter sits down on the cement floor, half hugging a knee to his chest. “Why do you think they grabbed me? I’m not that important.”</p>\n<p>“If you weren’t important, they would have killed you,” Bucky says dryly. </p>\n<p>\"Oh. Comforting.\"</p>\n<p>Bucky presses on. \"They want something from you. Whatever it is, don’t give it to them. Hold out as long as you can.”</p>\n<p>That’s terrifying. “Wow. Thanks for the tips.”</p>\n<p>“Just wait. Settle in. And don’t antagonize them,” Bucky says. “All right?”</p>\n<p>“Yeah. Alright.”</p>\n<p align=\"center\">\n<strong>* * *</strong>\n</p>\n<p>Days pass. Food comes in once a day. Well, ‘food’ of some description. It’s not good, whatever it is, but Peter’s hungry enough to devour the tasteless glop. The guards feed Steve by hand. They shove Bucky’s tray through the bars, staying as far out of his reach as they possibly can.</p>\n<p>Peter can handle bad food. He can even handle the strangely silent guards and cold cells. That’s not the worst part of this whole ordeal.</p>\n<p>It’s the <em>boredom</em>. There’s nothing to <em>do</em>. Nothing to talk about, not without risking blowing his cover, such as it is. Hydra doesn’t actually know Peter is Spiderman, and the longer Peter can keep that quiet, the better. Peter has to stop himself from crawling the walls out of boredom for very similar reasons. Literally. He got frighteningly close to doing it once before he caught himself.</p>\n<p><em>God</em>, he doesn’t do well when told to still and be quiet. He never has. Cap and Bucky seem capable of it (as well as having conversations entirely through Significant Looks between each other; weird), and neither have said anything since the day Peter arrived. Nothing at all. It’s eerie.</p>\n<p>One day, he just can’t help it. The silence is dragging on him, making him restless, and if he has to endure another second of it, he might just scream. “Hey, Cap?”</p>\n<p>Steve looks up at him, tilting his head slightly. There’s a certain strain to his eyes whenever he looks at Peter that hasn't left expression since they met.</p>\n<p>“Can I ask you a question?” Peter asks.</p>\n<p>“I think you’ve just asked me two of them,” Steve says, smiling wryly. It’s weak and more of a grimace than anything else, but it’s there. “But sure, go ahead.”</p>\n<p>“How did you survive doing that PSA on puberty?” Peter asks bluntly. “I mean, that had to be absolutely mortifying. Do you know how many people who had very confusing sex dreams about you throwing condoms at them after that?”</p>\n<p>“Nevermind, I’m not answering any more questions,” Steve answers immediately and with more than a touch of panic.</p>\n<p>“Aw.”</p>\n<p>“Please tell me you didn’t tell your old man about that,” Steve says after a few moments. At Peter’s answering shit eating grin, he sighs. “Of course you did.”</p>\n<p>Bucky chuckles quietly in the background. “Kid, please tell me those are online somewhere.”</p>\n<p>“Youtube,” Peter answers. “This auto-tune channel I watch made a contest for the best remix. I think all of the submissions are on Spotify.”</p>\n<p>“Got any favorites?” Bucky asks.</p>\n<p>“Remind me and I’ll send you the Best Of playlist.”</p>\n<p>“Do <em>not</em> send that to Sam,” Steve cuts in. </p>\n<p>“No promises,” Bucky responds, smirking.</p>\n<p>Steve sighs in defeat and shoots Peter an exasperated, but friendly look. \"Alright, kid, I've got a question for you.\"</p>\n<p>\"Uh, sure. Hit me,\" Peter says, curious as to what </p>\n<p>Steve nods to his shirt--one of his few sports shirts--with a slight grin. \"Think the Mets will make the World Series this year?\"</p>\n<p>Peter grins.</p>\n<p>What follows is a shockingly vibrant conversation about baseball. A conversation wherein Peter learns Captain America, Steve Rogers, is <em>wrong about baseball.</em></p>\n<p>“No, you’re wrong,” Peter says. “You’re--listen, that rule is there for a reason--”</p>\n<p>“The game is better without it,” Steve retorts. “The rule should be thrown out.”</p>\n<p>“I can’t believe I’m hearing this. Captain America doesn’t believe in <em>rules.</em>”</p>\n<p>“The designated hitter rule shouldn't exist,” Steve insists.</p>\n<p>“Kid, you have no idea how many laws Steve breaks on a weekly basis,” Bucky adds. His head is tilted back and his eyes are closed. Peter had thought he was asleep. \"Rules are a suggestion at best.\"</p>\n<p>\"Part of me respects that, but I will fight you over your very wrong opinions about baseball when we get out of here,\" Peter says.</p>\n<p>Steve chuckles. \"Tell you what, when this is all over, I'll take you to a ball game. You can explain it there.\"</p>\n<p>\"Deal.\"</p>\n<p align=\"center\"><strong>* * *</strong>\n</p>\n<p>More time passes. Long enough that the lack of food is starting to catch up with Peter. Steve and Bucky look as healthy and strong as the day they came in. Peter, meanwhile, can feel his ribs under his skin, and has watched his wrists and arms gradually shrink by the day. </p>\n<p> Tony theorized Peter’s metabolism would level out when he hits his twenties, but until then, he’ll need half as much food as anyone else just to make it through the day. That’s food he frankly isn’t going to get in this place. </p>\n<p>This doesn’t go unnoticed by either of the supersoldiers. That stressed, guilty expression on Steve’s face grows deeper by the day, and Bucky isn’t much better about hiding his concern. There’s still the occasional talk about baseball or where the best bagel in New York can be found (Steve maintains the place near his apartment in Brooklyn is the best, and Peter vehemently disagrees with that; Bucky’s opinion is that they both need to calm down about bagels), but there’s a strain to their banter now. Every day that passes without a visit from their captor is one where the tension builds.</p>\n<p>One day, it breaks. The average looking Hydra agent returns, slipping through the steel door leading out into the complex one day with the bored impatience of a bureaucrat falling behind schedule. He sets a small box down on the desk, beside the phone, and looks over the prisoners. His gaze pauses on Peter, and his expression darkens. </p>\n<p>\"You are losing weight,\" the Hydra agent says irritably.</p>\n<p>\"You could try feeding me more?\" Peter suggests. “Just a thought.”</p>\n<p>\"I'm not wasting food on a dying child. Not until you prove your worth to me.”</p>\n<p>“Honestly, do you even listen to yourself sometimes? I feel like some therapy to explore that lack of empathy might do you some good--”</p>\n<p>“Be quiet or I will tear out your tongue,\" the man says irritably. </p>\n<p>Okay, fair enough.</p>\n<p>The man opens the box and starts to rummage around inside of it, pulling out the odd piece here and there. After a few minutes, it becomes clear that he’s setting up a small hologram projector on the desk, right beside that bright red phone.</p>\n<p>\"It occurs to me, Peter, that we have not been properly introduced. I am Victor,\" the man says while finishing up with the projector. \"And by the end of this, you and I are going to be as old friends.\"</p>\n<p>\"I wouldn't bet on it,\" Peter replies. \"You're offensively bland.\"</p>\n<p>Victor pauses in his task to aim a flat, unamused stare his way. Peter matches his stare easily. Finally Victor chuckles, shaking his head. </p>\n<p>\"I hope you keep that stubborn streak for awhile. It will make our time together that much more interesting.\" He clicks on the holoprojector and an image of Tony appears. Beaten, bloody, and blatantly terrified.</p>\n<p>It takes Peter a moment to realize that this Tony is younger. The Tony he knows has threads of silver just now appearing at his temples and among his goatee; this Tony, despite the dirt, cuts, and bruises, is visibly younger. There’s a date in the corner; <em>2008.</em> A decade ago, but Tony looks younger by twice that amount.</p>\n<p>“This is a video taken of Tony Stark while he was held prisoner, shortly before he built his first suit. I want you to study this closely. We’ll discuss it at length tomorrow.”</p>\n<p>He’s handcuffed to a chair, thick cables lead from a car battery and connect to the arc reactor in his chest. The battery sparks whenever Tony’s head is forced into a tub of water. Judging by the way he jerks painfully, plenty of that shock hits Tony and his fragile arc reactor when he’s under water.</p>\n<p>Peter feels himself growing nauseous and turns away from it. He can’t escape the sound, however. Eventually, the sound ends, the projector’s image collapses, and the room falls silent. </p>\n<p>“Your father sustained two weeks of torture before he broke. I am interested to see if you will last half as long,\" Victor says idly, tucking away the holoprojector before heading for the door. “Sleep well, Mr. Parker.”</p>\n<p>Torture is mostly mental--Peter can’t remember who told him that, whether it was Rhodey, Tony, or Happy--but he does remember that much. Physical pain can only go so far; it’s the threat of the knife, not the actual cuts, that hurts the most. </p>\n<p>Peter’s feeling pretty fucking threatened right now.</p>\n<p>He doesn't feel like eating much that night.</p>\n<p>True to his word, Victor shows up the next day with a number of guards. They start to rearrange the room, moving the desk, bringing in a chair with heavy metal cuffs attached to the arm rests, adding a tub of water,</p>\n<p>\"You want me to cooperate so you have an easier time torturing me to death? Your negotiation skills need some work, buddy.\"</p>\n<p>“If I wanted you dead, I wouldn’t say anything. I have a use in mind for you, but I need your cooperation first. I want your spirit broken, not your mind,” Victor says. “For that, I need you alive.”</p>\n<p>“Huh,” Peter says, frowning at him. “So, you aren’t going to kill me.”</p>\n<p>“No, I’m not,” Victor replies. “But you’d be surprised what you can live through. Guard, bring him over to me.”</p>\n<p>He tenses, readying himself for a quick attack. The moment they open that cell, he’s going to fly through it and--</p>\n<p>The guard approaches the door, aims something between the cells, and fires. Two needlepoints land on Peter’s chest. What follows is a flash of pain so overwhelming that Peter crumples to the ground and twitches, muttering a half coherent curse. A <em>taser.</em> God, that’s just so unnecessary.</p>\n<p>The guard gives him one more jolt, opens the door, and then wrestles Peter up and over to the metal chair. He slams Peter’s twitching arms into place on the chair and secures them against the arms of the chair with heavy metal restraints before backing away and taking up his post near the door. Victor pays no attention to these proceedings at all; Steve and Bucky grow increasingly tense with each passing second.</p>\n<p>Peter sits in the chair, still shivering from the taser’s aftershocks, idly testing the restraints. They’re made of the same material as the cell bars. He’s sitting next to the desk, where a tub of water sits. Beside it, knives. Beside those, another taser.</p>\n<p>This is starting to get a bit concerning.</p>\n<p>“It’s a shame we didn’t learn of you sooner,” Victor says idly. “But also a blessing, in a way. There are even odds that we would have stolen you or had you killed by the Soldier, and I think that would have been a waste. Isn’t that funny, Soldier? You were destined to meet this young man no matter what. Either by the end of a knife or in a cell.”</p>\n<p>Victor turns to smirk at Bucky. The look he gets in return is nothing short of flat hatred; Bucky’s eyes glitter coldly, and his fist is clenched tightly. Victor rolls his eyes, turns to face Peter again, and sighs.</p>\n<p>“I’m afraid he doesn’t like me very much anymore,” Victor says, as if confiding some great secret. “For awhile there, we were very close. Not friends, but close.”</p>\n<p>He taps one of the knives. “You and I, little Stark, will become just as close.”</p>\n<p><em>NOPE.</em> “Uh. No. Hard pass. Why are you even doing this? What the hell do you need <em>my</em> cooperation for?”</p>\n<p>“You work in your father’s laboratory, yes?</p>\n<p>“More of a lab assistant-slash-indepent-researcher, really.”</p>\n<p>“You know how he builds his suits. You’ve helped him fix them, working alongside him inside his lab.”</p>\n<p>Ah. “I just hold the fire extinguisher with DUM-E when he works on his suits. I’ve never--I don’t have anything to do with his suits beyond that.”</p>\n<p>“But you’ve seen him work on them. Build them from nothing,” Victor insists. “I want you to build me one.”</p>\n<p>“Literally impossible,” Peter retorts. “I mean that in every sense of the word.”</p>\n<p>\"I find that difficult to believe.\"</p>\n<p>\"I'm not Tony Stark.\"</p>\n<p>\"You're his son.”</p>\n<p>“That means nothing.”</p>\n<p>“On the contrary, I think it means a great deal,” Victor replies. “We have a spy in his service. We’ve seen how he treats you, how he speaks of you, and more to the point, we’ve seen <em>you </em>at work. In this case, the apple does not fall far from the tree.”</p>\n<p>He taps the hologram projector on the desk. An image of Peter appears. He’s in one of the secondary labs at the Compound, elbow deep in one of Tony’s older suits, frowning in concentration. The angle of the image is bad, and it’s blurry as hell. Peter isn’t sure how to explain that the reason he was messing with Tony’s suit is because he’d dropped his phone inside of it and was trying to fish it out before Tony noticed.</p>\n<p>He’s far more disturbed by <em>how</em> Hydra’s been getting these images at all. There must be a spy at the Compound. Someone who’s slipped past Happy’s protocols and FRIDAY’s monitoring. <em>That</em> disturbs him. Tony and Pepper stay at the Compound often. So does Rhodey. If they can get close enough to get a picture of Peter, alone, in a lab requiring a ridiculous amount of security clearance, then outright assassination isn’t outside the realm of possibility.</p>\n<p>“I can see on your face that you realize you’ve been caught in a lie. One day, you will learn to stop lying to me,” Victor says casually. He smirks, and picks up the knife, holding it loosely in his hand. “It may be a painful lesson for you, but I am a patient man.”</p>\n<p>\"Seriously, if you get any closer with that thing, I'll break your nose,\" Peter warns, tensing in the chair.</p>\n<p>Victor scoffs, standing up and moving closer to Peter, knife held at the ready. \"With both of your arms secured? You'll forgive me if I don't find your threat--\"</p>\n<p>Peter lunges forward, chair and all, and slams his forehead across the bridge of Victor's nose. There's a very gross sounding <em>crunch </em>and muffled scream from Victor that becomes worse when Peter takes full advantage of his momentum to slam the man against the desk. Another <em>crack</em> follows, though Peter isn't sure what he broke this time. He's too busy grasping at the keys on Victor's belt.</p>\n<p>He's just managed to grab them when the room is flooded with guards. Two grab Peter, chair and all, and fling him away from Victor. He skids across the ground and bumps against Bucky's cell door with a quiet <em>oof.</em></p>\n<p>The guards pull Victor up on his feet. Blood is pouring from the man's nose, and judging by his breathing and the way he's holding himself, he's nursing broken or bruised ribs. He stares at Peter, insulted and infuriated.</p>\n<p>Peter shrugs up at him from the floor, palms up. \"I mean, I did warn you, pal.\"</p>\n<p>\"Grab him,\" Victor orders.</p>\n<p>The guards start to get close, then pause, glancing above Peter's head. Peter frowns, then turns to look behind himself. The reason for the guards's concern becomes very clear.</p>\n<p>Bucky is standing at his cell door, fist clenched, staring down the guards. He practically radiates protective fury. Peter is well within reach of Bucky, and any guard that gets too close will likely be pulling back a bloody stump for a hand if they try to grab him.</p>\n<p>There's a brief standoff before Victor sighs.</p>\n<p>“If you don’t let them close, I’ll have them shoot him instead,” Victor snaps. “Back away from your door. Immediately.”</p>\n<p>Bucky glowers at Victor. When the guards raise their weapons and take aim at Peter’s head, however, he takes three slow steps back into his cell. He maintains eye contact with Victor the entire time. Once he’s far enough away, the guards swoop in and grab Peter, chair and all, and haul him inside his own cell. They drop the chair in the center of the cell and look to Victor for orders.</p>\n<p>\"Beat him,\" Victor says as he leaves the room. \"Make sure the other two watch.\"</p>\n<p>That's less than ideal.</p>\n<p>\"Wow. <em>Someone's </em>a sore loser,\" Peter blurts out. “No need to get petty just because you lost a fight against a terminally ill kid with both arms tied behind his back.”</p>\n<p>The guards leap into their given task quickly. Peter's ordeal starts in the chair and ends with him flat on the ground. There's a lot to be said about Hydra's rank and file soldiers. Peter decides that their most annoying trait by far is their absolute loyalty and the mindless way they follow orders.</p>\n<p>They beat him. Punches, kicks, the works. </p>\n<p>The thing of it is, this is nothing compared to what Peter's gone through before. The warehouse hurt worse. The fight with Vulture on the plane afterward hurt a hell a lot more than that. He's had a few nights on patrol that come close and they by far outrank his current beating.</p>\n<p>All in all, it isn't that bad, basically. </p>\n<p>(And if he says that a few more times, he might even believe it.)</p>\n<p>Still, he can't help one last parting shot as the biggest goon draws back his foot for one last kick.</p>\n<p>\"Let me guess, you were picked last for kickball and developed a complex over it?\"</p>\n<p>He has enough time to wonder if that was entirely wise before catching said boot to the head. It knocks him across his cell, and he lands against the bars that separate his cell from Bucky’s.</p>\n<p>Darkness follows.</p>\n<p align=\"center\">\n<strong>* * *</strong>\n</p>\n<p>Waking up takes awhile. His body itches all over; a telltale sign that his powers have kicked in and started to heal him. Judging by how deep and annoying the itch is, it's not entirely working at full capacity. He shifts, groans, and tries to move. He doesn’t get very far before a hand gently grips his shoulder and presses him back against the floor.</p>\n<p>“Pete?” Steve asks. His tone is desperate, near panicked. “Hey, don’t try to move too much. Bucky’s checking for broken bones.”</p>\n<p>Peter makes a very intelligent <em>urghksh</em> noise and drops his head back down. The room has a distinctly <em>tilted</em> quality to it and his ears are ringing. They really hadn’t pulled any punches on him during that beating, and Peter wonders if he was meant to survive it at all. Would the fact that he’s healing raise suspicions?</p>\n<p>Is it worth it to keep up the charade at this point?</p>\n<p>Bucky ends his prodding with a relieved sigh. “No broken bones. You’re either lucky or made of rubber, kid.”</p>\n<p>“Let’s call it the latter,” Peter says, lurching up from the ground to lean against the wall. Bucky steadies him. “This has definitely not been a lucky month so far.”</p>\n<p>Bucky sighs. “Yeah, tell me about it.”</p>\n<p>Peter is quiet for a long moment. He looks over at Bucky and says, “This is just the start, isn’t it?”</p>\n<p>\nBucky meets his gaze, and there’s no shortage of guilt and sadness in his eyes. “Yes. They won’t stop until they get what they want from you.”</p>\n<p>“Figures,” Peter mumbles, leaning back against the wall and closing his eyes. “Guess I’ll just have to be an annoying asshole until they give up.”</p>\n<p>Bucky chuckles quietly. “Where’ve I heard that sentiment before?”</p>\n<p>Steve says nothing.</p>\n<p align=\"center\">\n<strong>* * *</strong>\n</p>\n<p>Victor returns two days later with a new approach.</p>\n<p>The funny thing about waterboarding is this: it doesn’t actually <em>work</em> on Peter. After that little issue in the Hudson a couple of years ago, Tony insisted he learn to swim properly at the Compound. And Peter did. He's actually not terrible at it; he can hold his breath for a frankly concerning amount of time. He once held it for twenty minutes and nearly threw Rhodey into a panic.</p>\n<p>So it plays out like this, over a period of seven days:</p>\n<p>Peter is dragged out of his cell, put into the chair, and placed near the desk with the red bakelite phone while Victor fills a shallow tub full of water.</p>\n<p>(God he hates that phone.)</p>\n<p>Peter starts spouting off nonsense to distract Victor. Or annoy him. Anything and everything to show him how <em>little</em> control he has over Peter, how much Peter isn’t impressed by his dog and pony show. It works nine times out of ten; Victor isn’t willing to go all out on Peter, and Peter isn’t going to give him an inch if he can help it.</p>\n<p>“Honestly, you could just let me take a shower--” Breathe in, hold, dunk. Held in place for thirty seconds. Pulled up, release breath. Speak. “--and that’d be much less strenuous on you than this. I can feel your arm shaking, man. You should look into a workout routine. Please tell me this water is clean, by the way.”</p>\n<p>Victor, sporting a newly crooked nose, two black eyes, and waning patience, finally uses a taser on him on the seventh day. <em>That</em> gets him to shut up. For a few minutes.</p>\n<p>\"How does your father deal with this back talk?\"</p>\n<p>\"Usually he sighs, does the 'dad point’ at me, and all but begs me to use my common sense,\" Peter manages, still shaking off the taser. His eyeballs are tingling. That’s annoying.</p>\n<p>\"Does that work.”</p>\n<p>\"Honestly, no. He's started giving up on it.”</p>\n<p>\"I never thought I would find myself sympathizing with Tony Stark, and yet I feel as though I should send him a sympathy card when I send him your corpse.\"</p>\n<p>Peter scoffs. He’s stopped shaking now, and it lets him speak clearly. Confidently. \"Yeah, sure, pal. That's not happening.\"</p>\n<p>\"You sound so sure,\" Victor says dryly.</p>\n<p>“Here’s the thing,” Peter says, dropping the snark from his tone completely. “He <em>will</em> find me. It might take him awhile, but he’ll come for me. He always does. If you let me go right now, I might be able to convince him to not kill you. For your sake, it’d be best if you did that.”</p>\n<p>Victor stares at him and laughs. He grips Peter’s hair and dunks his head under the water. This time Peter fights him every step of the way, falling just short of being too obvious about his strength.</p>\n<p>When the guards toss him into his cell, Peter coughs and crawls over to his designated sleeping spot--the far corner of his cell where the bars separate his and Bucky’s. Bucky reaches through the bars and helps him settle in. The ease with which he can move Peter is disturbing, and Peter wonders how much of his strength he’s lost to starvation. </p>\n<p>Bucky keeps a hand on his shoulder. “Get some rest, Pete.”</p>\n<p>“Yeah. Yeah, I got it,” Peter mumbles, already half asleep. There’s a low tingle in his chest from his healing factor; some water must’ve gotten into his lungs at some point. Hopefully it clears out of his system before it makes him truly sick. That’d just be his luck.</p>\n<p>He’s asleep in seconds.</p>\n<p align=\"center\">\n<strong>* * *</strong>\n</p>\n<p>Another week passes. This one floats by in fits and spurts; Peter sleeps more often than not, at turns feverish and freezing. The lack of food, the stress, and the constant strain on his healing factor leave him with no other choice. He needs to gain and retain energy somehow, and right now the only reliable way to do that is by sleeping. More than once he wakes up to find the back of Bucky’s hand pressed to his forehead.</p>\n<p>Still, nightmares creep in. Of the warehouse. Of Vulture. And of Victor, the bland man with a knife. Others are of Tony, trapped in a cave, tortured, and scared. Peter knows exactly what he went through now, and it haunts him how much Tony went through.</p>\n<p>On one particularly bad night, someone grips his shoulder and squeezes. “Kid. You’re all right. I’ve got you. You’re safe.”</p>\n<p>He wakes just long enough to recognize Bucky, and almost immediately starts to drift off to sleep again. He’s caught somewhere between awareness and sleep, still awake enough to hear.</p>\n<p>“Is he all right?” Steve asks, hushed and anxious.</p>\n<p>“His fever broke,” Bucky answers, pitching his voice low. “He won’t last much longer like this. They’re going to kill him if this keeps up.”</p>\n<p>A heavy silence follows that.</p>\n<p>“What can we do?” Steve asks.</p>\n<p>“I don’t know,” Bucky replies. He sounds tired. “I don’t know.”</p>\n<p align=\"center\">\n<strong>* * *</strong>\n</p>\n<p>Bucky wakes him up whenever their one meal of the day comes in. Peter only whines about it every time he does it. Bucky remains unmoved by his whining, and also looks like he hasn’t lost sleep at all despite clearly getting even less than Peter. Peter huffs, sitting up one day and rubbing his eyes.</p>\n<p>“Grab your tray and eat, kid,” Bucky says, nodding to the tray resting at his feet. Peter sighs, and leans forward to grab it with more than a little effort. That’s mildly terrifying.</p>\n<p>Peter frowns at the tray. “This is more than they usually give me.”</p>\n<p>“Because it has my food, too,” Bucky says. “Eat. Then rest.”</p>\n<p>“Bucky, I can’t eat your--” Peter trails off at the stern look he gets in return, and sighs again. “Yeah, yeah, fine. Thanks.”</p>\n<p>“Right answer,” Bucky says, lightly ruffling Peter’s hair.</p>\n<p>Peter rolls his eyes, but grins slightly. With Bucky’s portion, he feels full for the first time since he was kidnapped. And he sleeps easier as well.</p>\n<p>He isn’t surprised when Bucky continues to wake him up to a double ration every day after that.</p>\n<p>He’s also incredibly grateful.</p>\n<p align=\"center\">\n<strong>* * *</strong>\n</p>\n<p>Victor visits three days after Bucky starts giving Peter his food. He enters quietly, without ceremony. His nose is still bandaged, but the black eyes have started to fade just a bit. That’s a shame. Peter might have to do a repeat performance.</p>\n<p>Victor eyes him closely. “I don’t suppose you’ve changed your mind about cooperating with me?”</p>\n<p>“Have you considered letting me go?”</p>\n<p>“Obviously not.”</p>\n<p>“Then you’ve already got your answer,” Peter replies, closing his eyes and tilting his head back against the back wall of the cell. He’s been regaining his strength over the past few days, though you wouldn’t know it when you looked at him.</p>\n<p>Victor chuckles. \"The cancer is eating away at you as we speak, and still you defy me. In other circumstances, I would find your defiance amusing. Perhaps admirable.\"</p>\n<p>“I’m gonna go ahead and say that being <em>admired</em> by some Hydra torturer isn’t high on my bucket list, pal.”</p>\n<p>“No, but perhaps a cure for your illness might change your mind?” Victor asks, his tone smug and gentle.</p>\n<p>Peter opens one of his eyes and looks at Victor.</p>\n<p>“I thought that might get your attention,” Victor says, grinning. He presses a button on the desk and guards file in, carrying boxes that they set around the room. “Thanks to some rather <em>generous</em> donations from Captain America and the Soldier, we’ve created a serum to cure you of your illness and, perhaps, make you as strong as the Soldier.”</p>\n<p>As he’s speaking, the guards begin to build a machine. It looks like some kind of metal sarcophagus; all steel, iron, and a tinted window looking inside. Something about it is unspeakably creepy. Steve looks like he's seen a ghost; his face has gone pale, and his whole body is tensed, looking between Peter and the machine.</p>\n<p>\"I see the good Captain has already put two and two together,\" Victor says. \"My little friend, this is the machine your grandfather used to turn Steve Rogers into Captain America. He was smaller, weaker, and more sickly than you.\"</p>\n<p>Peter frowns at the metal pod. Two guards open it up. There's a hard metal bed inside. And dozens of syringe needles glittering in the dark.</p>\n<p>\"Today, we are going to see if we can repeat history,” Victor says. He nods to two of the nearest guards and they walk towards Peter’s cell.</p>\n<p>“<em>Absolutely</em> not. You’re not--”</p>\n<p>Another taser cuts him off. They haul him out of the cell and into the pod without ceremony, slamming the door shut on Peter within seconds. Peter stiffens, his breath caught in his chest. This is just like the warehouse. It’s too small, too closed in, too <em>dark</em>--</p>\n<p>“Do try to control your heart rate, Mr. Parker. You’re embarrassing yourself,” Victor calls out. “Turn it on!”</p>\n<p>The machine spools up with an ominous hum, rattling the pod. The first syringe plunges into his arm. Dozens of others follow in gradual procession. A strange heat follows. And after that, the agony. The pain is beyond comprehension. Beyond description. If this is what Steve Rogers did to become Captain America, then he got ripped off. Nothing is worth this. <em>Nothing</em>.</p>\n<p>Peter can hear screaming. It takes him a long time to realize it's coming from himself.</p>\n<p>\"Open the pod!\" Victor yells out.</p>\n<p>The doors open.</p>\n<p>Peter comes out of the steel pod half mad, and completely overwhelmed by his senses. There’s too much light, too much noise, too many <em>people</em>--</p>\n<p>People who mean to do him harm.</p>\n<p>His spider senses, hovering at a low hum for most of the pod, skyrocket into high alarm, cutting through pain, and kicking in his fight or flight. </p>\n<p>He chooses fight.</p>\n<p>It’s all clumsy instinct when he fights, and he does it half blind, but he can feel and hear the <em>crunch</em> of a broken nose under one fist, a shattered jaw beneath the other, and a dislocated knee beneath one of his feet. It’s enough to send the three men closest to him sprawling across the ground, crying out in pain and shock, giving him room to move.</p>\n<p>He sees Bucky’s cell and sprints for it, crossing the room much faster than a non-enhanced human should. He doesn’t care about his cover anymore. He stopped caring inside the pod. He skids to a stop at the door, grips the bars and <em>pulls.</em> </p>\n<p>They shift, bending underneath the immense pressure he’s placing on them. The metal screeches, twisting out of place. He can hear more men flooding into the room, hear them shouting, and drawing close---</p>\n<p>An arm shoots out between the bars near Peter’s head and the man closest to him goes down in a boneless heap. Even caged and left with one arm, Bucky Barnes is more than capable of protecting an ally. The rest of the guards wisely jump back, clearly at odds of what to do, and just as wary of getting close to Peter than they are of Bucky himself.</p>\n<p>That works for him. Peter pulls at the bars. The serum, whatever it is, is starting to fail. He can feel the strength in his arms start to flag.</p>\n<p>“Enough,” Victor says to his right.</p>\n<p>Peter looks over at him and freezes. Victor is standing inside Steve’s cell, pressing the barrel of a rifle against Steve’s temple. </p>\n<p>“Peter--” Steve starts. He freezes when Victor flicks the safety off the rifle.</p>\n<p>Victor keeps the gun pressed against Steve’s head. “Return to your cell, Mr. Parker. Hands in the air, please.”</p>\n<p>Peter hesitates, eyeing the distance between himself and Steve’s cell. If he times this just right--\n</p>\n<p>“You’re not fast enough,” Victor says. “You could reach me in seconds, but I’ll have blown his head off by the time you get here. Is that something you want on your conscience? Captain America’s death, all to get some petty revenge on the man who made you great?”</p>\n<p>“You didn’t make me great,” Peter hisses. He lets go of the door to Bucky’s cell and backs away from it, bumping into the end of one of the guard’s rifles. He huffs, slowly raises his hands and walks back into his cell, maintaining eye contact with Victor the whole time. </p>\n<p>“On the contrary, I think I did,” Victor says smugly. He lowers the rifle </p>\n<p>“Fuck yourself.”</p>\n<p>“Language,” Victor replies. That one word is enough to draw a wince out of Steve. “I think we can call this a success. We’ve successfully recreated a serum. You survived a quarter dose just fine.”</p>\n<p>\"You can't use that serum on anyone else,\" Peter says. \"It will kill them.\"</p>\n<p>\"As it killed you? No, I have my proof. Look at you. The syringe marks are healing already,” Victor replies. He steps out of Steve’s cell and hands the rifle over to a waiting guard. “But it seems short lived for you.”</p>\n<p>The calculating look he aims at Peter sends a chill down his spine. For once, Peter has nothing to say to that.</p>\n<p>“Rest well, Mr. Parker. I’ll see you tomorrow.”</p>\n<p align=\"center\">\n<strong>* * *</strong>\n</p>\n<p>Victor returns the next day. The guards start the machine, wrestle Peter out of the cell, and shove him towards the pod. Peter slams his feet down and forces his supergrip to latch onto the floor in front of the open pod. The guards strain against him, pulling with all of their strength. His flagging strength betrays him then, and his feet skid forward a few inches.</p>\n<p>He’s at the edge of the pod when he breaks. His panic outweighs his bravery; he cannot possibly go inside that pod again. Never again. “Fine! Fine, I’ll do it! I’ll make you a suit.”</p>\n<p>Victor smirks. “I knew you’d see reason eventually, Mr. Parker.” To the guards he says, “Take him back to his cell. I don’t believe we’ll need to give him his treatment again ”</p>\n<p>The guards toss him back into the cell with as much ceremony as they used to yank him out of it moments before. They slam the cell door shut and stand back as Victor moves to stand in front of Peter’s cell.</p>\n<p>“I suppose congratulations are in order,” Victor says idly, clasping his hands behind his back. “You lasted one day longer than your father. Stark men are made of iron indeed.”</p>\n<p>Peter scowls at him, but says nothing. And that feels like a loss as well. </p>\n<p>Victor smirks and leaves.</p>\n<p>He ignores both Steve and Bucky and focuses only on getting his breathing back under control. A hand reaches through the bars beside him and rests on his shoulder.</p>\n<p>\"Easy, Peter,\" Bucky says quietly. \"Focus on me. Breathe with me, all right?\"</p>\n<p>\"I---yeah. Yeah. Sorry.\"</p>\n<p>\"You haven't done anything to apologize for,\" Bucky replies. He emphasizes his point with a gentle squeeze of Peter's shoulder. \"How do you feel?\"</p>\n<p>\"Tingly. Steve, you were an idiot to get inside that pod and someone needs to go back in time and slap Howard Stark through a wall.\"</p>\n<p>“Yeah, no argument there,” Steve says tonelessly.</p>\n<p>The shame hits him then, full and complete. “He’s going to--if I don’t build him something--”</p>\n<p>“Do what you need to survive,” Bucky says quietly. “No one can blame you for this.”</p>\n<p>Peter isn’t so sure of that.</p>\n<p>They move him out of the cells after that. He’s treated as a spoiled prince: his cell--and it is a cell, despite everything else about it--is a small apartment suite with books, DVDs, comics, the works. The fact that there aren’t any doorknobs on the inside of his little apartment suite is the only giveaway that it’s a prison.</p>\n<p>Well, the lack of internet is proof of that alone. And it's a shame, too. If he had access to a computer network, he could find a way to ping Ned's phone or FRIDAY's network.</p>\n<p>One benefit to being a Hydra stooge is this: food. The fridge is absolutely stocked, top to bottom. Peter raids it four times that first night and eats until he’s stuffed. A part of him feels guilty; Bucky and Steve are somewhere close by, eating tasteless glop, and he’s demolishing a triple stacked club sandwich. A larger part of himself recognizes that he can’t help them escape if he’s starved to nothing, and he certainly can’t figure out an escape plan on an empty stomach. So he eats. And feels guilty about it.</p>\n<p>Once he’s cleared half the fridge, he cleans his dishes, shuffles into the bathroom to take the longest and objectively best shower of his <em>life</em>, dresses into clean clothes (the only thing available is a smaller version of the uniform the guards wear; ugh), and then flops face first into the queen sized bed, sinking into the mattress with a sigh.</p>\n<p>He lays there, relaxing, and starts to drift off to sleep.</p>\n<p>It doesn’t work.</p>\n<p>The clock on his nightstand ticks off the minutes and hours, and Peter becomes increasingly frustrated, flopping across the bed restlessly. He can't sleep. He's full, he's safe, and he has a bed; he's objectively better off here than he was in the cells. But he <em>can't sleep.</em> Eventually, he figures out why:</p>\n<p>Bucky and Steve aren't nearby. Even while trapped, while tortured, starved, and left in the cold, he felt <em>safe</em> with them nearby. There’s no Steve to bicker with, no Bucky to look after him. He’s completely on his own, and that makes all the difference in the world. He’s only got himself to rely on, and he’s the only one who can help Steve and Bucky escape. He has to assume the Avengers--Tony included--haven’t figured out where they are yet.</p>\n<p>Peter lays in bed and thinks. He comes up with three possible plans.</p>\n<p>Contact the Avengers. If he can find a computer with a connection to the outside internet, that would be utterly child’s play to accomplish. A simple ping to FRIDAY will solve every problem he currently has. The problem is that Hydra most likely <em>won’t</em> give him access to anything with that capability; they aren’t complete idiots, unfortunately.</p>\n<p>Plan number two: cause a breakout directly. He would have to nullify or delay the security system before he gets close to the cells again. That may be trickier than it seems; the system is so hackneyed that it might circle around to brilliant. But if Peter plays his cards right, he could pull it off. He just needs to play up the ‘recovering terminally ill and horrifically nerdy child’ act around the guards and Victor long enough that they drop their guard. The only downside is how much time this will take.</p>\n<p>Plan number three is as outlandish as they come: build a machine that can get him out of here safely. It’s a pipe dream, based on a conversation he, Tony, and Rhodey had in the lab at the Compound one late night a few months ago. It’s <em>possible</em>. At least, the math all three of them scribbled across the holoscreen came out right. If he gets the right parts, maybe.</p>\n<p>He discards the idea. Plan two is the best. He has time.</p>\n<p>A decision made, sleep comes to him at last. It’s a restless sort of sleep, but it’s better than nothing.</p>\n<p align=\"center\">\n<strong>* * *</strong>\n</p>\n<p>The next day, Victor steps into the apartment and motions for Peter to follow. He’s unarmed, and looks both bored and assured of Peter’s compliance. That rankles Peter, and it annoys him further when Victor <em>smirks</em> as Peter falls in behind him. They walk down a long, bland corridor towards a heavy steel door guarded by two men armed with rifles. One of the guards salutes Victor while the other opens the door for them to enter inside. Peter hesitates at the threshold until one of the guards reaches for the taser on his belt. </p>\n<p>The room is cold, lined with work tables and machinery, and heavy tools meant for forging, cutting, and designing metal pieces. Tools line the shelves and tables, gleaming beneath the harsh bright light inside the room. </p>\n<p>Victor turns to face him. “Welcome to your new workshop. You will work here, under close supervision of the guards, until dinner time, and then you’ll be returned to your rooms. Work well and without complaint, and you’ll be rewarded. Fail to work, and I’ll lock you in the pod. Are we clear?”</p>\n<p>Peter glares at him, but drops his eyes. “Yes.”</p>\n<p>Victor’s smug grin is evident in his voice. “Good.”</p>\n<p align=\"center\">\n<strong>* * *</strong>\n</p>\n<p>Peter’s life enters a strange holding pattern after that. He wakes up at six, showers, eats, waits to be escorted into the lab where he works late in the night and is escorted back to his apartment to eat dinner and sleep. Days pass, but he doesn’t keep track; his sleep is still spotty, his mind is running full bore day and night while he plots an escape, and the prolonged stress of playing the part of a cowed genius adds up to a warped sense of time. He regains weight (and the muscle, thank god), but dark bags hang beneath his eyes. As it turns out, working out an escape plan right under the noses of a bunch of fanatics is extremely stressful and difficult.</p>\n<p>Most of the Hydra guards leave him alone while he works. They watch him like hawks, of course, and he has no doubt that they’re reporting his every move to Victor, but they stay out of the way. They also don’t look terribly bright, which is a bonus. </p>\n<p>The same, unfortunately, cannot be said about Victor, who performs spot checks of the lab and wanders, touching tools, beakers, and half finished pieces of armor as he pleases. It’s a subtle show of power, and it drives Peter up a wall much more efficiently than his clumsy (but effective) attempts at torture.</p>\n<p>“What is this? Glue?” Victor asks, picking up a beaker of web fluid.</p>\n<p>Peter thinks fast.</p>\n<p>“Something like that. You shouldn't touch it without gloves, though,\" Peter says, hurrying over to grab it from him. \"It can carry an electric charge, and once it’s set, it’s much more flexible and durable than regular wires. In this state, it's basically super glue.”</p>\n<p> Victor glances over at the suit spread across the center table. It’s half finished; the chest piece, colored black-red and bearing Hydra’s insignia below the red glow of its power source, has trails of cables and wires leading to steel black boots and a single gauntlet.</p>\n<p>“But the suit still has wires?” he asks, frowning.</p>\n<p>Peter shrugs, trying to keep his tone casual. “This stuff is a backup system. Wires are the most efficient way to power the suit, but this will work if a wire shorts out or breaks. At the very least, it’ll keep whoever’s wearing it from being crushed to death by the weight of the suit or falling out of the sky. Which is probably important, since it’s hard to use these things.”</p>\n<p>“Is it? Your father makes it look easy.”</p>\n<p>“He also trains for six hours every day,” Peter adds. “Balance is important. Core strength is a must. Spacial awareness, too. You need all three to even pilot it, and that doesn’t guarantee you’ll pilot it <em>well.</em>”</p>\n<p>In fact, given the flaws Peter is deliberately placing in the suit, there’s <em>no</em> guarantee that the suit will be functional. <em>He</em> could do it because of his own abilities, but a regular Hydra grunt? That’s highly doubtful. At best, it’ll be a man-sized prison cell for whoever gets inside, unless they’ve been granted super strength, that is.</p>\n<p>“Hm. Something to consider when I choose a pilot,” Victor says. He throws a contemplative look Peter’s way, and Peter’s spider senses kick up to a low whine. “I have a couple of people in mind, personally.”</p>\n<p>“Uh, like who?” Peter asks, wary of the sharp eyed look from the Hydra agent.</p>\n<p>Victor only smiles in response. “I believe you’ve already met him. “</p>\n<p>Peter freezes for a moment. It’s either Bucky (likely), Steve (significantly less likely), or himself (terrifying). “Uh.”</p>\n<p>“We’ll discuss it further when the suit is closer to completion,” Victor says. He glances around the lab and pauses, looking over the massive machine Peter built to test out escape plan number three. “What is this?”</p>\n<p>Peter clears his throat. \"That's to test the suit. I want to stress test the parts I build before I commit them to the main suit.”</p>\n<p>Victor hums, eyeing the machine for a moment before nodding and moving on. “Carry on, Mr. Parker. “I’ll leave you to your work.”</p>\n<p>Peter rolls his eyes behind the man’s back, turning back to his work. He hears Victor cross the room and stop next to the guard stationed at the door. It’s quite a distance away; his hearing is sharp enough to hear their conversation as though they were right next to him.</p>\n<p>“Keep an eye on him,” Victor says to guard. “I doubt he’ll be any real trouble, but he must be kept content until his indoctrination can begin properly.”</p>\n<p>“Yes, sir,” the guard says, just as quietly. “Do you really think he’ll be able to withstand it?”</p>\n<p>“He survived the first exposure to the serum just fine, and it made him amenable to our current demands. Two more rounds and we’ll have scoured that attitude from him easily, I think.”</p>\n<p>“And he’ll agree to enter the pod again?” the guard asks doubtfully. </p>\n<p>“To save the life of his dear friend Bucky? And Captain America? Of course he would. What child would want that on their conscience?” Victor chuckles. “No, he’s soft. He’ll go. And <em>then</em> we will make him strong. Make sure he stays healthy until he finishes the suit.”</p>\n<p>“Yes, sir,” the guard replies.</p>\n<p>Victor nods and leaves.</p>\n<p>Peter drums his fingers across the work table in front of himself and thinks. His escape attempt has just been moved up by several notches.</p>\n<p align=\"center\">\n<strong>* * *</strong>\n</p>\n<p>Days crawl by. Peter learns that the base is, in fact, an underground facility somewhere in the Arizona badlands. Bucky and Steve’s cells are in the center of the base, and Peter’s lab is only four floors above it. He moves onto everything else: the guard patrol routes. He checks and rechecks the security system (just as cheap and shabby as he expected, really), and through it all, he plans. Constantly. </p>\n<p>He barely sleeps, eats mindlessly, and does his work. The suit grows, and even the machine in the far corner of the lab sees more than its fair share of work. No one has questioned it. It’s Peter’s last resort, frankly.</p>\n<p>Two weeks after he begins building the suit, he makes his move.</p>\n<p align=\"center\">\n<strong>* * *</strong>\n</p>\n<p>“The guards tell me that you’ve been cooperative. Helpful, even,” Victor says one day during his walkthrough. “And I’d like to take a moment to congratulate you for your good behavior while I supervise your work.”</p>\n<p>Victor smiles at him the way a teacher would at an exceptional pupil, and Peter deeply considers flinging a chair straight into the smug asshole’s face. Instead, he turns back to his work, letting Victor watch as he fiddles with the half complete suit.</p>\n<p>\"So, I don't get it. Why so much hate for my dad?\" Peter asks. \"Shouldn't you be focused on Captain America?\"</p>\n<p>\"We already have him. And since he is here, he is no longer a concern.\"</p>\n<p>\"The Black Widow?\"</p>\n<p>\"We can handle her.\"</p>\n<p>\"Dude, you could barely handle me.\"</p>\n<p>Victor scoffs, dismissing Peter's words with an annoyed handwave. \"We had to be gentle with you. If your mind shattered, you would become useless to us. And there's no use for the useless in Hydra.\"</p>\n<p>\"Right, yeah, sounds like something you guys would say,\" Peter says, wrestling with the wrist launcher connected to the suit. \"Hey, could you look at this? I think something's stuck in the rocket barrel, but I can't see it at this angle.\"</p>\n<p>Victor quirks a brow, but dutifully leans down to look down the barrel of the launcher. \"I don't see anything.\"</p>\n<p>Peter triggers the launcher. A massive web bomb launches out of the suit and hits Victor. He's sent flying across the room, landing roughly against the wall, smothered by web fluid. Only his nose and mouth are free of the stuff.</p>\n<p>Peter stares at the guy. \"Oh my god. I can't believe that <em>worked.</em> I should've done that days ago.\"</p>\n<p>The guard behind him, shocked, starts to raise his rifle. Peter spins around and webs him to the wall. He tests his webshooter and huffs. That was all of the fluid he had available. Great.</p>\n<p>“You idiot child--” Victor hisses.</p>\n<p>Another glob of webbing hits Victor’s mouth, muffling his words. Guess he had some left after all. </p>\n<p>He tosses it aside and grabs the suit, pulling it on after scraping off the Hydra symbol on the suit. He’s not wearing <em>anything</em> with that damn symbol on it. Ever. It’s still only a chest piece, boots, and the single gauntlet, but it’ll do. A quick kick turns the boots thrusters on and pushes him into the air. He flails, takes a second to catch his ‘balance’ and loops the room. </p>\n<p>Good enough.</p>\n<p>There are a <em>lot</em> of guards around, and he doesn’t have time to track down the one guard with keys to the cells right now. Having the suit means he can avoid catching a bullet with his face, which is the optimal way to avoid most bullets, in his personal experience.</p>\n<p>He just has to pretend to be Iron Man for a few minutes.</p>\n<p align=\"center\">\n<strong>* * *</strong>\n</p>\n<p>He makes it halfway to the cells, winding through them when the alarms sound off. Three quarters of the way there, the PA system clicks on.</p>\n<p>“<em>Alert-Alert-Alert. Abandon post! Alert-Alert-Alert. Neurotoxin release in thirty minutes!”</em></p>\n<p>Peter sighs. Of <em>course</em> they filled this place with deadly neurotoxin. The lab is air tight, at least, so Victor and the guard won’t die, but judging by the pounding feet in an adjacent hall moving <em>away </em>from the cells, no one’s given a thought to Captain America or Bucky.</p>\n<p>Unfortunately, the same cannot be said for him. A shout from a corridor to his left and a sudden spike of his senses alert him to three guards charging down the hall with rifles held at the ready. They fire, and it’s only his reflexes and the rocket boots that save him from getting shot. Peter pushes more fuel into rockets, zipping down the hall and around the corner before they can catch up and try again. He hears them shout after him furiously, but he’s out of their sight and range in seconds, and within range of the door leading towards the cells.</p>\n<p>Peter crashes into the room with all the subtlety of a flaming brick. His half suit sputters, the thrusters flickering out on his feet, and he lands somewhat gracelessly, staggering forwards a few steps before catching his balance again. He stares at Bucky and Steve, catching his breath for a moment.</p>\n<p>\"Oh my god, they are <em>so</em> mad right now,\" Peter blurts out. \"Hang on, I'm getting you guys out of here. We have about ten minutes before their security system kicks in--by the way, it’s still the worst system I’ve ever seen--and floods this place with neurotoxin.”</p>\n<p>Bucky and Steve stare at him. Bucky looks relieved to his core. Steve has a disbelieving half smile on his face, at once proud, fond, and exasperated. </p>\n<p>\"You promised you'd build them a suit. You just didn't mention who the suit would be for,\" Steve says, the smile growing into a grin.</p>\n<p>\"Hey, it's not my fault they didn't get it in writing,\" Peter says. “Pepper always says to check the fine print for a reason, you know.”</p>\n<p>He aims a repulsor at Bucky's cell, charges it until he can feel the heat sear his palm, and blasts it. The lock disintegrates in a flash of light, and Bucky shoves the door open. He visibly relaxes when he's outside of his cell.</p>\n<p>Peter repeats the repulsor blast on Steve's cell door and then dashes inside it. He kicks on the boot thrusters to push himself up a few inches so he can reach the manacle locks. He could've wall crawled, but he likes the novelty of the suit; it won't last much longer, so he might as well enjoy it while he can. </p>\n<p>The keys pop open the manacles easily. Steve is free in seconds, just in time for Peter's foot thrusters to fail altogether. Peter lets out a small yelp and drops to the ground, landing hard with a wince. </p>\n<p>\"What's wrong?\" Steve asks, shaking out his arms.</p>\n<p>\"Ran out of power,\" Peter says, tossing off the gloves and boots. \"I used <em>really</em> terrible batteries in case Hydra actually tried to use the suit. It was only meant to last ten minutes. Guess that time is up.\"</p>\n<p>\"Clever,\" Steve says, rubbing his wrists. \"Do you know a way out?\"</p>\n<p>\"Totally. Just go straight down the main hallway and take the elevator. We have thirty minutes until neurotoxin floods this whole place. We’ll get out in half that time.\"</p>\n<p>“I’ll lead the way,” Steve says.</p>\n<p>Bucky nods. “If anyone gets close, Pete, you leave them to us. Got it?”</p>\n<p>Peter nods, turns, and leads them back out into the hall.</p>\n<p align=\"center\">\n<strong>* * *</strong>\n</p>\n<p>They flee down the hall and up towards the surface. It’s smooth sailing for the most part; Hydra’s people are far more interested in saving their own hides than confronting two supersoldiers and teenager. The lack of opposition has Peter on edge, however. It’s too easy. This was all too easy--</p>\n<p>“<em>Prisoner escape detected,</em>” the PA nearest to them says, approximately ten minutes after the three of them fled the cells. “<em>Security lockdown in section 14-A to commence immediately.</em>”</p>\n<p>Thick bars slam down between Peter and the two supersoldiers. He barely scrambles back in time to avoid being crushed by them. </p>\n<p>Steve stares at them, grips them, and tries to pull them apart. They don't budge at all; they're made of the same material that the cells were. And without Hydra's serum--or proper rest and food--Peter lacks the strength to pull them apart. He wouldn't have the time for it anyway.</p>\n<p>\"Cap, Bucky, you have to go,\" Peter says. </p>\n<p>\"We aren't leaving you behind!\" Steve snaps back. He tries the bars again and--somehow--manages to start pulling them apart. It’s slow going, and it’s clear that he can’t keep up that kind of pressure for long. His hands slip off the bars and he slams a fist against them. “God<em>dammit</em>, not when we’re so close--”</p>\n<p>\"If you stay you'll die!\" Peter counters. His voice shakes as he says it, thrown by Steve’s fury. </p>\n<p>Around them, the countdown continues. The neurotoxin will flood this part of the complex soon. Peter wracks his brain, pacing along the bars for a few seconds. He can fix this. There’s always something--</p>\n<p>Except there isn’t. Not this time. This is the only way out. He can hear all of the main corridors lock down around them. He wouldn’t have had time to reach them anyway, but he’s beginning to get the distinct feeling he might very well be boned.</p>\n<p>Well, except for one thing. It’s a long shot, but...</p>\n<p>“Peter--” Steve starts. He stutters to a stop when Peter shoves his arm through the bars, holding out a small device with blue LED blinking on top of it.</p>\n<p>\"Take this,” Peter says. “It's a tracker. I know another way out, but you need to carry this so I can find you.\"</p>\n<p>Steve takes it, watching the blue light gradually turn on and off. \"You'll be right behind us?\"</p>\n<p>\"Yes. I promise, okay? <em>Please </em>go.\"</p>\n<p>Steve hesitates for another moment before sighing and pocketing the tracker. Bucky watches him, his expression dark and sad. </p>\n<p>\"That tracker's strong enough for you to follow underground?” Bucky asks. “Where cell phones can't reach?\"</p>\n<p>\"Yes,\" Peter lies. </p>\n<p>He sees right through it, of course. Bucky closes his eyes behind Steve, clenching his fist. </p>\n<p>\"Good old Stark tech,\" Steve says with a slight grin. \"Catch you on the other side, Pete.\"</p>\n<p>\"See you soon, Cap. You owe me a ball game.\"</p>\n<p>Steve nods, turns, and runs down the hall. Bucky hesitates, casts one last heartbroken look at Peter, and then turns to follow Steve.</p>\n<p>Peter waits until they're out of sight before he turns around and sprints back towards the laboratory. </p>\n<p align=\"center\">\n<strong>* * *</strong>\n</p>\n<p><em>“Alert-Alert-Alert.</em> <em>Neurotoxin release in five minutes.”</em></p>\n<p>“God, shut up,” Peter mutters, slamming the door shut behind himself and sealing it. </p>\n<p>He sprints for the machine in the far corner, skidding to a stop and tapping in a quick series of codes to unlock it. It whirrs to life, humming quietly, and gradually spins the hoops that run along its surface. Peter checks a screen built into the side of it. The tracker is on the surface, near the entrance and, best of all, isn't currently moving. That's important.</p>\n<p>He locks onto the device in Steve’s hand, starts up the machine, and quietly prays to whoever may be listening to not screw him over for once in his life. The machine locks onto the device in seconds, and the tunnel spools up. A blue-black portal tears itself open inside the tunnel, sucking in the air inside the lab with a disconcerting roar.</p>\n<p>Peter takes one look at it and has three thoughts:</p>\n<p>\n<em>Holy shit, Rhodey’s calculations were right!</em>\n</p>\n<p>And</p>\n<p><em>Ohmigod,</em> <em>that’s so cool.</em></p>\n<p>And</p>\n<p>\n<em>If this doesn’t work, pieces of me are gonna be splattered across most of the west coast.</em>\n</p>\n<p>He dives through it.</p>\n<p align=\"center\">\n<strong>* * *</strong>\n</p>\n<p>Peter pops into existence eight feet in the air, utterly fails to right himself in time, and lands in the arms of a <em>very</em> shocked Steve Rogers. He stares up at Steve, looks around at the gathered group--all Avengers (mostly Rogue Avengers; Black Widow, Falcon, Hawkeye for some reason), all outfitted for war--standing near a quinjet parked nearby and blinks.</p>\n<p>And then the realization hits, and with it, unbridled joy.</p>\n<p>\"Oh my god! It worked! I can't believe that worked!\" Peter says, giddy from both his escape and revelation. He's barely aware of Steve setting him down on his own two feet, keeping a steadying hand on Peter's shoulder. Peter leans into his hand, still a bit dizzy and off kilter from his brief trip through the teleporter. He looks up at Steve, beaming. Steve returns his stare, shocked and relieved. \"Cap! <em>I just invented teleportation and it actually worked and didn’t scatter me across the atmosphere.</em> Which was, like, <em>pretty</em> likely to happen? Oh my god. I teleported. I cannot <em>wait</em> to show--\"</p>\n<p>\n<em>\"Peter!\"</em>\n</p>\n<p>Oh. He knows that voice. </p>\n<p>Peter looks up, snapping out of his joyous rambling. He's vaguely aware of Steve pulling his hand away just as Tony Stark drops from the sky to grip Peter's shoulders. His helmet rolls back and disappears, and Peter finds himself face to face with a haggard looking Tony. There’s a distinct sense of <em>panic</em> coming from the man. He looks Peter over for a moment, his expression shifting from shock, to horror, and the terrified relief he's only ever seen on the faces of parents when he's guided their lost children over to them while on patrol.</p>\n<p>And then his eyes focus on Peter's, and relief turns to despair when he sees both how thin Peter's become, the dark circles rimming his eyes, and the half healed marks of torture that cross his face. </p>\n<p>\"Oh, god, kid,\" Tony says weakly, before yanking him into a tight, protective hug right there in front of all of the Avengers.</p>\n<p>Peter freezes for a moment, his mind going into a full blown blue screen, before he returns the hug. He clings to Tony, tucks his head against his shoulder, and stays there for a long time. Tony reaches up and cups the back of his head, holding him more securely to his chest.</p>\n<p>That almost undoes Peter completely. Suddenly, the weight of everything that’s happened seems to crash down on him, and his shoulders slump. He clings to Tony, weak, and surprised to find himself fighting back tears.</p>\n<p>\"Uh, hey. I think I'd like to go home now, please,\" he mumbles after a few moments. His voice hitches on <em>please</em> and he clears his throat.</p>\n<p>He can feel Tony nod. \"Straight home. And you aren't leaving my sight after that.”</p>\n<p>\"That sounds mildly unreasonable.\"</p>\n<p>\"Deal with it,\" Tony replies, finally letting go of the hug. He keeps a firm hand on Peter's shoulder. \"You're going to get on the quinjet and rest. Sam, there's a special IV bag in the med cabinet with Peter's name on it. Hook it up <em>immediately</em>.\"</p>\n<p>Sam frowns, puzzled, but nods. \"I'll get everything ready.\"</p>\n<p>\"What? I don't need--\" Peter starts, swaying on his feet.</p>\n<p>\"You do,” Tony replies, steadying him easily.</p>\n<p>\"But Hydra’s still in there and I know the layout of the base! I'm not going to just sit here while you go off and--\"</p>\n<p>\"You are.\"</p>\n<p>\"Tony--\" Peter starts, true annoyance finally cutting through.</p>\n<p>Tony faces him again and pulls out the infamous <em>dad point</em>, index finger pressed to Peter’s sternum, a stern look on his face. Beneath it is barely concealed terror. \"Listen, my first and only concern right now is <em>you.</em> I can't focus on catching these bastards if I know you're in danger, and you’re in no shape to be out of bed, let alone going into a battlefield, and you know it. So you will <em>stay here and rest.</em> Let Sam hook you up to the IV and let Clint take care of you until Rhodey and I get back with the others. Got it?\"</p>\n<p>Peter sets his jaw, ready to argue--</p>\n<p>\"Kid. Listen to him,\" Bucky says quietly. \"You’ve been fighting long enough. Let your old man handle the rest.\"</p>\n<p>Peter looks over to Bucky and is shocked to find himself the subject of scrutiny from all the other Avengers. Clint looks mildly shocked and heartbroken, Natasha frowns at him as if he’s a puzzle to be solved, but with no small amount of concern, and the narrow eyed look Sam aims his way from inside the ‘jet is just as worried. Rhodey looks as relieved as Tony, and just as concerned.</p>\n<p>Tony looks even more shocked at Bucky's input--and the look he casts towards the man is venomously suspicious. His tone, however, doesn't change.</p>\n<p>\"See? Even the war criminal agrees.” He turns to Bucky. “Stay away from my kid, by the way.\"</p>\n<p>\"Hey, he saved my life in there like three times, back off,\" Peter protests weakly. Dammit, if he wasn't so <em>tired</em>. He huffs out a breath, shoulders slumping. \"If you don't come back--\"</p>\n<p>\"He'll come back, Pete,\" Rhodey says, squeezing his shoulder. \"He’s not exactly going in there alone. Me, Nat, Cap, and Sam can handle the rest.\"</p>\n<p>\"I'll be back before you know it,” Tony promises. He's still watching Bucky suspiciously, but there's less outright hostility now; it’s still wary, but it’s an improvement. “Literally. You’re probably going to pass out the moment you lay down.”</p>\n<p>He definitely is. “Am not.” </p>\n<p>To Peter’s horror, his tone comes out borderline <em>petulant</em>. Tony smirks at him. “If you were feeling fine, you’d be giving me a lot more hell than that, and we both know it.”</p>\n<p>Peter sighs, rubbing his eyes. “Fine. Just, be safe. Those guys were pretty weirdly obsessed with hurting you.”</p>\n<p>\"Yeah, that became pretty obvious the moment you turned up missing.\" Tony’s expression softens just a bit and he adds. “I’ll be fine. <em>Please</em> go lay down.”</p>\n<p>Peter finally nods. “Yeah. Yeah, fine.”</p>\n<p>When he turns to leave, he can hear the others murmur amongst themselves. Steve speaks quietly to Natasha and Rhodey, laying out a plan of attack. He can hear Tony chip in every now and then with his own comments. He can’t hear their words very clearly over the quinjet’s engines, and he’s not sure he wants to hear them.</p>\n<p>“Over here, Peter,” Sam says, waving him over to a cot bolted to the wall and floor near the cockpit. </p>\n<p>Peter walks over and lays down with a heavy sigh. The adrenaline crash is starting to settle in, and he feels shaky all over. Sam sets up the IV just as the weight of the past month sets in on him and reaches down for Peter’s arm. Peter goes stiff the moment Sam grabs his arm, and Sam pulls his hand back slowly.</p>\n<p>\"Easy,\" he says, kneeling down beside Peter's gurney. \"I just need to get the needle in. You’ll barely feel it, promise.\"</p>\n<p>\"I---yeah. Yeah, just be quick. They--they used a lot of--\" Peter trails off.</p>\n<p>Sam's expression doesn't change; it's still friendly and calm, but his eyes shift just slightly. They darken with fury and heartbreak for just a moment. \"I get it. Honestly, I'm not good with these either. As long as you don't pass out like Clint did during our last blood donation drive, you'll be fine.\"</p>\n<p>\"Hey, I swore you to secrecy on that,\" Clint calls back from the cockpit. </p>\n<p>“That deal ended when you stole my sandwich during the last team training,” Sam retorts. He looks at Peter. “Best sandwich in the city, and this guy walks up and takes half like it’s his.”</p>\n<p>\"Bird bros share everything, including food.\"</p>\n<p>\"You threw a knife at me when I tried to get a cup of coffee from the pot you made.\"</p>\n<p>\"Brid bros share everything except coffee,\" Clint amends.</p>\n<p>Peter chuckles weakly--and barely feels the IV needle slide home. He has the belated realization that Sam and Clint had just put on an act for his benefit before the medicine--a concoction meant solely to help boost his healing factor--hits him. He sighs, laying back on the cot, half aware of Sam clapping his shoulder and stepping away to talk with Bucky. He settles into the cot--it’s stiff and uncomfortable, but he’s <em>safe</em> now, so he should be able to sleep. Right?</p>\n<p>Wrong. He keeps jumping awake, tense and ready to defend himself. Clint leans back to aim a worried look his way after the third time it happens and Peter rubs his eyes in frustration.</p>\n<p>\"Hey, uh, Bucky?\" Peter calls out.</p>\n<p>Bucky looks up from his conversation with Sam, tense, worried. It would be funny in any other situation, but his sudden rapt attention makes Peter reconsider. </p>\n<p>\"Uh, nevermind.\"</p>\n<p>Bucky tilts his head. He claps Sam's shoulder and walks over to sit on the floor beside Peter's gurney.</p>\n<p>\"Get some rest, kid,\" Bucky says.</p>\n<p>Peter’s relief is immediate and almost overwhelming. \"Uh, thanks. I know this is probably dumb--\"</p>\n<p>\"It isn't. I'll keep watch. You're safe.\"</p>\n<p>Peter isn't sure how to thank him for that. Instead, he simply drifts off to sleep.</p>\n<p align=\"center\">\n<strong>* * *</strong>\n</p>\n<p>He stirs awake sometime later. The quinjet is in motion, flying smoothly. Two men are speaking quietly to one another near his bed.</p>\n<p>\"I saw the video of--of what happened. What they did to him,\" Tony says haltingly. There's a broken kind of horror to his voice; a weary sadness that hadn't been there before. \"You protected him. Thank you.\"</p>\n<p>\"You have one hell of a kid there, Stark,\" Bucky says quietly. \"He never gave them an inch. They never broke him. I think he'll be okay, after awhile.\"</p>\n<p>\"He will. But only because you and Cap were there for him.\" Tony goes quiet and then scoffs quietly. \"Ross was the one who worked with them. I've got a lot of phone calls to make when we get back to the Compound. You and Cap should stay there and recover until everything's taken care of.\"</p>\n<p>\"I'd like that,\" Bucky says. </p>\n<p>\"I hope you know you're going to be followed around by the kid from now on, too.\"</p>\n<p>“He’s not the first mouthy punk to trail after me. I can handle it.” Bucky pauses, clearly mulling something over. “Hydra didn’t give him any treatment for his cancer. At least, none that I saw. Is he--”</p>\n<p>“His what,” Tony asks, completely thrown.</p>\n<p>Peter drifts back to sleep. </p>\n<p align=\"center\">\n<strong>* * *</strong>\n</p>\n<p>\n<em>One Month Later:</em>\n</p>\n<p>\n\"Let's go, bug kid,\" Bucky calls out, shrugging on a coat to hide his arm. There’s a distant crash in answer, and Bucky rolls his eyes.</p>\n<p>\"Where are you three going?\" Natasha asks.</p>\n<p>\"Baseball game,\" Steve says, putting on his hat.</p>\n<p>“He’s got us going to a damn Mets game,” Bucky grumbles. “Kid! Come on!”</p>\n<p>“I’m coming, I’m coming!” Peter clambers down the hall, shrugging on a jacket. He shoots a web towards Sam’s sandwich and yanks half of it into his hand, biting into it as he skids to a stop near Steve and Bucky.</p>\n<p>“God, that’s disgusting,” Sam mutters. </p>\n<p>Peter starts to talk around the bacon he’s chewing on, absolutely hyped beyond all reason. “You guys ready?”</p>\n<p>“Don’t talk with your mouth full,” Bucky says, clapping his shoulder and gently nudging him towards the door. “Let’s go. And you’re not gonna get me to wear that Mets hat, so quit askin’.”</p>\n<p>“We’ll see about that,” Peter says smugly, waving at Tony and Sam before walking out of the door. Bucky rolls his eyes, mutters something dark under his breath, and follows him.</p>\n<p>Steve, amused, turns to Tony. “We’ll be back in time for dinner.”</p>\n<p>\"Don't cause any international incidents and keep an eye on the kid. He goes feral at baseball games. You might think I’m joking, but I am absolutely not.\"</p>\n<p>“I’m <em>spirited,</em>” Peter says from the hallway.</p>\n<p>“Feral,” Tony calls back dryly. He looks back at Steve. “Take care of him for me.”</p>\n<p>Steve smiles, easy and friendly. “Always, Tony.”</p>"
}