{
  "id": "29913105",
  "url": "https://archiveofourown.org/works/29913105?view_full_work=true",
  "author": [
    "MollyPollyKinz"
  ],
  "title": "Peeps",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "Dream SMP"
  ],
  "relationships": [
    "Wilbur Soot & Technoblade & TommyInnit & Phil Watson",
    "Toby Smith | Tubbo & TommyInnit"
  ],
  "characters": [
    "TommyInnit (Video Blogging RPF)",
    "Phil Watson (Video Blogging RPF)",
    "Technoblade (Video Blogging RPF)",
    "Wilbur Soot",
    "Toby Smith | Tubbo"
  ],
  "additional_tags": [
    "Fluff",
    "Wings",
    "Hybrids",
    "chick imprinting",
    "Cuddles",
    "so many cuddles",
    "everybody wants to cuddle with tommy",
    "Bullying",
    "Light Angst",
    "Hurt/Comfort",
    "The characters of this fic does not reflect the author's opinions of the CCs"
  ],
  "language": "English",
  "series": "Part 1 of Fluffy Peep-verse",
  "published": "2021-03-08",
  "completed": "2021-05-16",
  "words": "7,976",
  "chapters": "3/3",
  "comments": "554",
  "kudos": "9,912",
  "bookmarks": "1,331",
  "hits": "80,393",
  "summary": "<p>“You’re imprinting,” Phil said, rubbing Tommy’s shoulder comfortingly, “Sometimes this happens when bird hybrids first get their wings in.”</p>\n<p>“What does that even mean?” Tommy moaned, leaning further into Phil’s warmth.</p>\n<p>Phil chuckled. “It basically means that you are going to be following me or another bird hybrid around all day, and you won’t stop peeping like that unless you have physical contact with that person.”</p>\n<p> </p>\n<p>Or, the fic in which Tommy peeps like a baby chick, gets lots of cuddles, and has really fluffy wings</p>\n<p>Mr. Nook looked up and smiled when he saw Tommy snuggled up against Technoblade. All of the other students looked up from their tests as well, and Tommy resisted the temptation to hide his face in Technoblade’s sweater. As it was, Technoblade wrapped one of his pink wings around him protectively.</p>\n<p>“Hey, Tommy,” Mr. Nook said kindly, “You got your wings in recently?”</p>\n<p>Tommy forced himself to speak. “Yeah,” he said, “Pretty pog, yeah?”</p>\n<p>After two months, it's finally here. </p>\n<p>Tommy gets cuddles with dadza and wilbur. </p>\n<p>And everybody gets toothrotting fluff.</p>",
  "notes": "<p>So I'm sure you've all heard about Wilbur turning out to be terrible. If you haven't, maybe look into it. Well, between him and Dream, I'm putting this disclaimer in all my fics. These characters are not the CCs, nor do they reflect my opinion on them. Either separate the two or don't read the fic. Thank you &lt;3</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>I succumbed. You get another chapter. This is the last chapter so please don't ask for more. &lt;3</p>\n<p>I BET YOU THOUGHT THAT WAS THE LAST OF ME HUH</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>I know i said last time that it was the last time. </p>\n<p>But this time it really is the last time. </p>\n<p>Sorry &lt;3</p>\n<p>Thank you for reading, I hope you enjoyed, and please be nice in the comments. &lt;3</p>\n<p>I hope you enjoyed, please be nice in the comments, and thanks for reading!</p>\n<p>lakghdlakghs <a href=\"https://www.instagram.com/p/CMRGwOeFRAu/?utm_source=ig_web_copy_link\" rel=\"nofollow\">fanart</a></p>",
  "text": "<p>Tommy thought that the worst part about have no wings was the process of growing them in. How could it not be? That had hurt worse than hell.</p>\n<p>So, of course, when Tommy woke up the next morning with an unfamiliar weight on his back, he thought the worst was over. The pain was done; now Tommy could wait for his feathers to grow in and learn to fly and have the time of his life.</p>\n<p>But of course, things couldn’t go to plan.</p>\n<p>Because after Tommy sat up from his lying position in the bed, the first sound that came out of him was series of embarrassing peeps. <em>Peeps. </em>He was <em>peeping.</em></p>\n<p>Phil, who was sleeping in a chair next Tommy’s bed, woke up instantly, instantly hovering over Tommy.</p>\n<p>“Tommy, are you alright, mate?”</p>\n<p>Tommy nodded, horrified that his peeping intensified. “<em>Dad,” </em>he moaned, peeping loudly, “It won’t <em>stop.”</em></p>\n<p>Phil wrapped his arms around Tommy, causing Tommy’s head to be rested against his chest. His wings wrapped around Tommy like a protective curtain.</p>\n<p>And the peeping stopped.</p>\n<p>Relief washed over Tommy, and he pulled away from Phil, who seemed reluctant to let him go.</p>\n<p>“Thanks,” Tommy muttered, his face hot with embarrassment as he finally wrestled himself free of Phil’s embrace.</p>\n<p>“No pro—”</p>\n<p>Phil was interrupted by another loud peep. Tommy smacked his hands over his mouth in horror.</p>\n<p>“Oh no,” Phil said, looking like he had finally realized something, “Um, Tommy, mate, you might want to lean against me again.”</p>\n<p>Tommy was too mortified by the peeping that was now streaming out of his mouth to even argue as he rested his head back against Phil’s shoulder.</p>\n<p>And, just like that, the peeping stopped again.</p>\n<p>The dots were beginning to connect inside his mind, and Tommy was <em>not </em>okay with the implications.</p>\n<p>“You’re imprinting,” Phil said, rubbing Tommy’s shoulder comfortingly, “Sometimes this happens when bird hybrids first get their wings in.”</p>\n<p>“What does that even mean?” Tommy moaned, leaning further into Phil’s warmth.</p>\n<p>Phil chuckled. “It basically means that you are going to be following me or another bird hybrid around all day, and you won’t stop peeping like that unless you have physical contact with that person.”</p>\n<p>“<em>No,” </em>Tommy said in horror, instantly pushing himself away from Phil, “I refuse. I will not—”</p>\n<p>More <em>damn </em>peeping.</p>\n<p>“Nope,” Phil said, instantly wrapping his arm around Tommy’s shoulders, “You don’t exactly get a say in this.”</p>\n<p>“I’m going to have to hold someone’s hand <em>all day?” </em>Tommy moaned.</p>\n<p>Phil hummed and nodded. “Pretty much. It might be for more than one day, who knows really.”</p>\n<p>Tommy swore. His reputation was going to be burnt to the dust by the time this was over. Wilbur was never going to let him live this down. <em>Technoblade </em>was probably never going to let him live this down. He was just going to be sad and lonely and known as <em>clingy </em>for the rest of his life.</p>\n<p>\n<em>A little part of him was secretly glad that he had an excuse to be closer to people.</em>\n</p>\n<p>Tommy quickly squashed that part of him down. He was going to be in <em>disgrace </em>before the day was through.</p>\n<p>“My life is over.” Tommy put his head in his hands. “Just kill me now.”</p>\n<p>“Oh, it won’t be <em>that</em> bad,” Phil said, “Besides, you rarely let me hug you anymore. This is the perfect excuse.”</p>\n<p>Tommy glared at Phil.</p>\n<p>“You are being incredibly clingy right now,” he informed his father, clutching onto Phil’s shirt.</p>\n<p>Phil nodded. “M-hm, okay. Are you hungry? I can get you breakfast.”</p>\n<p>Tommy sighed and nodded reluctantly. Maybe, if he could just subtly hold onto Phil the entire time, Wilbur and Techno wouldn’t even notice anything was awry, and his reputation would be spared.</p>\n<p>“Let’s go,” Tommy sighed.</p>\n<p>Tommy pulled himself out of bed, Phil’s arm still firmly wrapped around his shoulders. They made it to the kitchen before Tommy’s masterful plan went awry.</p>\n<p>“Awww!” Wilbur exclaimed almost the instant Tommy set foot into the kitchen, “Techno, look how fluffy his wings are! They’re like baby wings!”</p>\n<p>Techno looked up from the book he was reading and sighed. “Yes, they are very fluffy.” He returned to his book.</p>\n<p>At least Tommy wouldn’t have to worry about <em>Techno </em>teasing him. This was good, because it seemed that he would have to uphold every defense when it came to Wilbur.</p>\n<p>“Okay,” Phil said, squeezing Tommy’s shoulder, “Why don’t you sit at the table? I’ll be right back.”</p>\n<p>Phil took his hand off of Tommy’s shoulder, and Tommy panicked as he felt a peep rise up from his chest. Instantly, he grabbed Phil’s shirt and stuffed his face into the back of Phil’s shoulder. The peep died down.</p>\n<p>“Awwww,” Wilbur said again, “Are you feeling clingy today, Tommy?”</p>\n<p>Tommy flipped him off. “Phil’s the clingy one,” he snapped.</p>\n<p>“Tommy, I can’t make breakfast with you hanging off of me,” Phil said patiently, “I’m sure Wilbur would be willing—”</p>\n<p>“No way,” Tommy said immediately, turning his head so that he could get a proper view of Wil.</p>\n<p>As he expected, Wil’s wings were perking up sinisterly. “Willing to what?” he asked, “I’m more than willing to let you cuddle with me, Toms, if that’s what you need.”</p>\n<p>Tommy’s face grew uncomfortably hot. “I don’t need to be <em>cuddled,” </em>he snarled, forcing himself let go of Phil. Phil’s wings twitched reluctantly.</p>\n<p>Tommy forced himself to walk toward the table, but he was hardly two steps in before he started peeping <em>loudly.</em></p>\n<p>“Oh my god,” Wilbur breathed, grinning wildly, “You’re like a baby chick or something.”</p>\n<p>Tommy backed away from Wilbur and clutched back onto Phil’s arm, silencing the peeps. “<em>Dad,</em> Wilbur’s bullying me.”</p>\n<p>Phil laughed. “Wil, take Tommy please.”</p>\n<p>“Gladly,” Wilbur said, walking toward Tommy like he used too when he threatened tickling.</p>\n<p>Tommy glared at Phil. “Traitor.”</p>\n<p>Phil looked entirely unapologetic as Wilbur wrapped his arms around Tommy and dragged him off of Phil. Tommy swore loudly, but he was horrified to find himself melting in Wilbur’s embrace.</p>\n<p>“This is the best day of my life,” Wilbur said, dragging Tommy over to the kitchen table, “Techno, please take a picture of this.”</p>\n<p>Techno hummed as he pulled his phone out of his pocket. “Well, I can’t deny myself some good blackmail,” he said, snapping a picture of Tommy snuggling into Wilbur.</p>\n<p>“I hate you,” Tommy muttered, “I hate all of you so much.”</p>\n<p>“We know,” Wilbur said, resting his chin on top of Tommy’s head. He sat down at the table, having it so that Tommy was basically cuddling in his lap.</p>\n<p>“You’re so damn clingy.”</p>\n<p>“You keep telling yourself that,” Techno said, returning to his book.</p>\n<p>Phil finally made them their breakfast, and Tommy forced himself out of Wilbur’s lap so that he could eat with <em>some </em>semblance of dignity.</p>\n<p>Except that Tommy was still peeping, and he was leaning both Phil and Wilbur’s direction.</p>\n<p>Damn these stupid instincts.</p>\n<p>Just to oppose them, Tommy scooted his chair toward Techno, resting his head against his shoulder. Techno let out a startled grunt, and Wilbur blinked offendedly. Tommy flipped him off.</p>\n<p>“Betrayal,” Wilbur moaned dramatically, “I have been betrayed! No snuggles with me, no more close proximity with adorable fluffy chick wings.”</p>\n<p>“Ha, I am now the favorite sibling,” Techno said, “Take that, nerd.”</p>\n<p>“Says the person reading a book at the dinner table,” Tommy muttered.</p>\n<p>“Hush, child cuddling deeper into me because of hybrid instincts,” Techno said, “you know not of what you speak.”</p>\n<p>Tommy hated that Techno was correct. Tommy <em>was </em>cuddling deeper into him. He was warm, okay? It was better than peeping like a desperate baby bird at any rate.</p>\n<p>“I’ll have you know that I’m the smartest person here,” Tommy remarked, “You are just jealous of my pure genius.”</p>\n<p>Techno snorted, his wings fluffing slightly. “Well, I guess you don’t need me, then,” he said, getting out of his chair and away from Tommy, leaving Tommy cold again.</p>\n<p>“Hey!” Tommy exclaimed indignantly as he started peeping downright <em>aggressively, </em>“Come—” <em>Peep. “</em>—back, <em>jerk!”</em></p>\n<p>“It’s okay, Toms,” Wilbur said, “You can lean against me.”</p>\n<p>Tommy rolled his eyes, and instantly returned to Phil’s side. Wilbur let out another betrayed noise. Phil wrapped one of his wings around Tommy protectively.</p>\n<p>“Um… I hate to be the bearer of bad news,” Techno said, “but today’s a school day, and I have an important history test, and you have work, Phil, so…”</p>\n<p>Tommy moaned. “I am not going to school like this,” he said instantly.</p>\n<p>Phil looked over to Wilbur. “Would you be willing to stay with him?”</p>\n<p>Wilbur shook his head. “I’m helping with theater after school.”</p>\n<p>“What am I supposed to do, then?” Tommy snapped, “Will I just be alone in the house, peeping like a pitiful lost bird.”</p>\n<p>“You do sound a little pitiful when you peep like that,” Wilbur said. Tommy glared.</p>\n<p>“Wil,” Phil sighed, “Stop teasing your brother.”</p>\n<p>Wilbur sniffed. “Maybe,” he said, “If he’d cuddle with me.”</p>\n<p>Tommy snuggled deeper into Phil. “You,” he announced, “are terrible.”</p>\n<p>“I am an opportunist,” Wilbur corrected, “And this is what I call a <em>golden </em>opportunity.”</p>\n<p>“No,” Tommy said, “I hate you. I am following Techno to school. And you are going to be all alone and very sad, Wilbur, and I will be like, ‘you shouldn’t have teased me then, should you?’ And you’ll be sad forever.”</p>\n<p>“Wow,” Techno snorted, “He’s got you there.” He began packing his backpack. “Also, Tommy can’t follow me. I literally just said I have a test. I’m pretty sure my teacher isn’t going to be happy with a freshman tagging along.”</p>\n<p>“Well your teacher can screw off,” Tommy said, making grabby hands toward Techno.</p>\n<p>Techno sighed, walking over to Tommy. Tommy removed himself from Phil and latched onto him.</p>\n<p>“I have acquired a child,” Techno said in deadpan, “If you’re going to school, you need to put on some actual clothes.”</p>\n<p>Tommy wrapped his arms around Techno more tightly, but he had a point. Tommy was still wearing some trashy pajamas. “Fine,” he muttered into Techno’s soft wings.</p>\n<p>“That involves letting go of me.”</p>\n<p>“Escort me to my bedroom first, jerk.”</p>\n<p>“I am not your horse,” Techno said, even as he started walking toward the stairs, “I can’t believe this is my life now.”</p>\n<p>“We can trade, Techno!” Wilbur shouted after him, “I’ll take Tommy, and you can take cuddle deprived life.”</p>\n<p>“Hmmm, no,” Techno said, “I think I shall keep this child. He is mine now.”</p>\n<p>Tragically, they reached Tommy’s bedroom, and Tommy had to let go of Techno so that he could change. Tommy’s peeping got louder, faster, and all the more aggressive as he quickly searched for new clothes and fought to pull his shirt over his fluffy new wings. The peeping honestly almost felt like a bad case of the hiccups, although slightly less painful and all the more annoying.</p>\n<p>As soon as he was dressed, Tommy dashed out of his room, desperate to stop the peeping, desperate to feel the warmth of someone else’s body.</p>\n<p>He crashed into Wilbur, and he couldn’t even care that Wilbur had somehow managed to trick him.</p>\n<p>“This is terrible,” Tommy informed Wilbur as he snuggled closer to Wilbur, “This is so damn terrible.”</p>\n<p>“This is still the best day of my life,” Wilbur said simply, like it was perfectly normal for one’s teenage brother to be cursed with nonstop peeping unless he was hugging someone, “This is wonderful. I cannot wait to tell Schlatt—”</p>\n<p>“If you tell any of your friends about this,” Tommy said, his voice dangerous, “Nobody will find your body.”</p>\n<p>“I’m so scared,” Wilbur said, sounding completely unconcerned.</p>\n<p>Eventually, they all piled into the car, Pihl driving and Tommy sandwiched in between Techno and Wilbur in the back seat. Normally, the three of them would be scrambling for shotgun, but for some reason, Techno and Wilbur both wanted to snuggle with Tommy now that he was vulnerable and crap.</p>\n<p>Tommy thought it was very rude.</p>\n<p>But he wouldn’t deny that it was very warm and comfortable so he decided not to complain <em>too much.</em></p>\n<p>“I hate you both,” he muttered as Phil pulled the car to the front of the school.</p>\n<p>“Have a good day boys!” Phil called out as the three of them stumbled out of the car like some conga-line, “Also, you have my note for the teachers, right Tommy?”</p>\n<p>Tommy nodded, reaching into his pocket to feel the note that said something along the lines of: <em>my son’s hybrid instincts cause every other bird hybrid around him to be very clingy.</em></p>\n<p>They got into the school building before the faced a bit of a problem.</p>\n<p>“Okay, so this is where we have to part ways,” Techno said, “So, Tommy, do you want to go with <em>Wilbur, </em>who you’ve already technically sworn off, or do you want to go with <em>me, </em>who is superior in every other way?”</p>\n<p>Wilbur let out an offended snort. “I thought you said you have a history test?” he demanded, “Wouldn’t <em>I </em>be the better choice?”</p>\n<p>“Guys…” Tommy began.</p>\n<p>“My test isn’t until the afternoon,” Techno pointed out, “And besides, I’m sure Tommy could be quiet—”</p>\n<p>“When has Tommy ever been quiet?”</p>\n<p>Tommy was growing increasingly uncomfortable over being argued over like some sort of prize. Then, as if bathed in holy light, Tommy saw his salvation walking into the entrance.</p>\n<p>As Techno and Wilbur continued to argue, Tommy broke free from both of them, immediately bursting into loud peeps. Tommy covered his mouth (even though that had been proven to do nothing helpful), and dashed toward his salvation.</p>\n<p>Tubbo looked at Tommy in surprise, his wings flaring. “Tommy? What are you—”</p>\n<p>Tommy crashed into Tubbo, quickly wrapping an arm around his shoulder like he was greeting an old friend.</p>\n<p>“Big T,” he huffed, “You have to save me.”</p>\n<p>“Okay…?” Tubbo began, still looking confused out of his mind, “Why…” A grin formed on his face. “Are you snuggling into me?”</p>\n<p>“You always were a clingy one, Tubbo,” Tommy grumbled, “And I’ll have you know that my hybrid instincts are forcing me to do this completely against my will.”</p>\n<p>“Oh,” Tubbo said, nodding, “You must have the imprinting thing that happens sometimes when the wings grow in. Speaking of which, nice wings! They look very fluffy.”</p>\n<p>Tommy rolled his eyes. “Don’t you get started,” he groaned, “Wilbur cannot stop talking about how fluffy they are.”</p>\n<p>Tubbo started walking to class, and Tommy followed, ignoring Techno and Wilbur’s betrayed looks.</p>\n<p>Tubbo gave Tommy a weird look. “Um… Tommy, our homerooms are different.”</p>\n<p>“It doesn’t matter,” Tommy muttered, “Dad gave me a note. I can just hand it to teachers and they will understand that I have been cursed with disruptive peeping noises if I let go of anyone.”</p>\n<p>Tubbo’s eyes widened. “Can I hear?”</p>\n<p>Tommy scowled. “Absolutely not.”</p>\n<p>\n<em>He did end up hearing, when Tubbo needed to go the bathroom and Tommy had to let go of him, Tommy let out a huge stream of peeps that caused the entire hall to stare at him.</em>\n</p>\n<p> </p>\n<p>Tubbo, tragically, had to leave for a doctor’s appointment after lunch.</p>\n<p>Which left Tommy alone, peeping pitifully as he walked down the hallway to his next class.</p>\n<p>Remember when they tell you not to walk alone on the streets at night? Yeah, the same applied for high-school, especially if your fresh, fluffy wings and high-pitched peeping made you sound like a baby bird.</p>\n<p>And listen, he tried, he <em>really did </em>try to ignore the juniors’ bullying jeers as he walked by, but it was really freaking hard when they <em>actively tripped</em> Tommy, causing him to stumble to the ground and let out a series of far more frantic peeps.</p>\n<p>“Pathetic,” one of the bullies laughed, “Quit acting like a baby!”</p>\n<p>Tommy scowled, jumping to his feet. “It’s not like—” <em>Peep. </em>“—I can—” <em>Peep </em>“—control it—” <em>Peep, peep. </em>“—morons.”</p>\n<p>The bullies, which were a group of three, <em>howled </em>with laughter. “He looks like a tomato!” cried out one, wiping away tears of laughter.</p>\n<p>Tommy rolled his eyes, trying to ignore the way his fresh wings rose up defensively.</p>\n<p>“Yeah—” <em>Peep. </em>“—yeah—” <em>Peep, peep. </em>“—<em>real</em> original.”</p>\n<p>“This is amazing,” said the one who seemed to be the ‘head-bully’ if that was even a thing, “What do you reckon will get him to do it more?”</p>\n<p>“Distress, maybe?” one suggested, “He’s doing it more than before.”</p>\n<p>Tommy clapped his hand over his mouth instinctively, trying to repress the steady stream of peeping coming out of his mouth. Logically, he knew the best thing to do for himself was to run. But he was a big man. He wasn’t about to run home crying over a few bullies.</p>\n<p>Okay, so maybe after the first punch, Tommy should’ve run instead of punching back, especially when the junior was twice his size and wasn’t adjusting to life with a fresh weight on his back. In Tommy’s defense, what else did one expect?</p>\n<p>The bullies got about two punches in, causing Tommy to let out <em>very </em>loud and <em>extra </em>pitiful peeps, when someone rested a hand on Tommy’s shoulder. Tommy’s peeps quieted down almost instantly.</p>\n<p>“What do you idiots think you’re doing?” Technoblade said, wrapping his arm fully around Tommy’s shoulders.</p>\n<p>Tommy leaned into Technoblade’s side, grinning at the bullies. They were so <em>screwed</em>.</p>\n<p>From the way they looked like they were cowering from Technoblade with fear in their eyes, they knew it too.</p>\n<p>Technoblade spread his wings out, making him look incredibly intimidating. “Give me one good reason why I shouldn’t <em>beat you to the ground</em> for attacking my little brother?”</p>\n<p>Tommy almost laughed at the raw horror on his attackers faces. Served them right.</p>\n<p>Still… Technoblade did have that history test, and it would be a shame for him to be sent to the principal’s office on Tommy’s behalf.</p>\n<p>“Eh, it’s okay, big man,” Tommy said, snuggling deeper into Techno’s warmth, “It didn’t hurt that much—” Actually, Tommy’s face was still throbbing from where they hit him. “—I’m sure they’ve learned their lesson.”</p>\n<p>Technoblade let out a deep breath through his nose. “Fine,” he said through gritted teeth, he pointed at the three boys threateningly, “But I <em>will </em>be reporting you three to the teachers.”</p>\n<p>And with that, Technoblade spun around and led Tommy down the hall. Once they were a safe distance away, Technoblade gently grabbed Tommy by the shoulders and turned him around so that Tommy was properly facing him.</p>\n<p>“Are you alright?” Technoblade asked, sounding strangely protective, “It’s bruising, do you need an ice-pack for that? Do you need me to call Phil? Wilbur?”</p>\n<p>Tommy raised his eyebrows, a little bit surprised, if he was being honest. “I’m fine, Techno,” he said, “Let’s just get to your class, you have that test, right?”</p>\n<p>“You’re more important than some dumb history test,” Techno said gruffly, “But if you’re sure you’re alright, then I’ll let it go.”</p>\n<p>Tommy nodded. “I’m fine,” he repeated, “Now can I lean against you again? Or are you not done inspecting every inch of me?”</p>\n<p>Technoblade let out a small chuckle, wrapping his arm around Tommy and allowing Tommy to burrow deeper into his side. They continued walking down the nearly empty halls. The final bell had rung a few minutes before.</p>\n<p>“Thanks, by the way,” Tommy murmured, “I could’ve handled it, but it’s nice to finally stop the damn peeping for once.”</p>\n<p>“Yeah sure,” Techno said casually, “It was no problem. But where’s your friend, Tubbo, was it? The one you ditched us for?”</p>\n<p>Tommy laughed loudly at the memory.</p>\n<p>“Yeah, he had to go to a doctor’s appointment,” Tommy said, “So that didn’t work out, did it?”</p>\n<p>“Next time, get me or Wilbur, okay?”</p>\n<p>Tommy nodded. Getting mercilessly mocked wasn’t actually something he wished to re-experience. “Wilbur’s going to be so mad when he hears about this,” he sniggered.</p>\n<p>Techno grinned. “What a loser.”</p>\n<p>Techno stopped in front of a door, probably the one to his classroom. “Alright, this is my classroom, so try not to be too loud, okay? I wouldn’t be surprised if they haven’t already started testing.”</p>\n<p>Tommy nodded, and Techno opened the door and entered. Inside, students were already scribbling on a sheet of paper on their desks.</p>\n<p>“Technoblade,” the teacher—Mr. Nook, Tommy instantly recognized his green hair—said almost instantly, not looking up from whatever paper he was looking down at, “You are late.”</p>\n<p>“Sorry,” Technoblade grunted, “I had to rescue my brother from some bullies, looked to be juniors.”</p>\n<p>Mr. Nook looked up and smiled when he saw Tommy snuggled up against Technoblade. All of the other students looked up from their tests as well, and Tommy resisted the temptation to hide his face in Technoblade’s sweater. As it was, Technoblade wrapped one of his pink wings around him protectively.</p>\n<p>“Hey, Tommy,” Mr. Nook said kindly, “You got your wings in recently?”</p>\n<p>Tommy forced himself to speak. “Yeah,” he said, “Pretty pog, yeah?”</p>\n<p>“Do you need ice for those bruises?” Mr. Nook asked, his brow furrowing in concern.</p>\n<p>Tommy sighed defeatedly. If he was going to be constantly asked that, he might as well just succumb before it becomes too aggravating.</p>\n<p>“Yes please,” he said, wrapping another arm around Techno without even thinking about it.</p>\n<p>“He’s imprinting,” Techno explained, “Can’t stop peeping unless someone’s hugging him.”</p>\n<p>Mr. Nook nodded understandingly. “Alright,” he said, “You can pull up a chair next to your desk for Tommy, and then get started on your test. I’ll go get some ice.”</p>\n<p>They did exactly that, and Tommy scooted his chair next to Techno’s as much as possible before leaning sleepily against Techno’s form. Techno wrapped his wing around him again, which really did not help with Tommy’s sleepy mood.</p>\n<p>It also did not improve either of their reputations.</p>\n<p>“Wow, Techno’s a big softy inside, huh?” a senior whispered from the desk in front of Techno, “Who would’ve thought?”</p>\n<p>Techno huffed. “Oh, shut up, Dream,” he muttered, “You have no idea what you’re talking about.”</p>\n<p>“Yeah, sure,” Dream muttered, returning to his test with an eye-roll.</p>\n<p>Tommy sniggered.</p>\n<p>“You’re ruining my reputation,” Techno muttered under his breath as he circled the answer on his test.</p>\n<p>“Got to drag someone down with me,” Tommy replied, smirking.</p>\n<p>Mr. Nook returned with a tower wrapped around some ice, stopping all potential conversation.</p>\n<p> </p>\n<p>Wilbur was appropriately outraged by the time he realized that he had missed out on school cuddling.</p>\n<p>“I thought you were with Tubbo?!” he demanded as they climbed into the car, “How did <em>Techno</em> end up stealing you?”</p>\n<p>“Simple really,” Techno said as he buckled his seat-belt with a click, “I am the cooler sibling.”</p>\n<p>Wilbur gaped, his eyes darting back and forth between Tommy and Techno. “You are <em>not </em>the cooler sibling,” he stated, “Tommy, I’m the cooler sibling. Tell me I’m the cooler sibling.”</p>\n<p>Allowing himself to be comfortably sandwiched between both Techno and Wil, Tommy hummed as if pondering the statement. “Well…”</p>\n<p>“<em>Phil,” </em>Wilbur moaned as Phil started driving again, “Phil, Tommy and Techno are bullying me.”</p>\n<p>Phil grinned. “Aw, come on, Wil,” he said, “We all know that you are the coolest sibling.”</p>\n<p>Wilbur straightened. “Thank you,” he said, gesturing at Phil gratefully. He turned to Tommy and Techno. “You see—”</p>\n<p>“Tied with Techno, of course,” Phil added.</p>\n<p>Tommy cackled.</p>\n<p>“<em>Tied?” </em>both Techno and Wilbur demanded at the same time.</p>\n<p>“Jinx,” Tommy said before they could get the word in, “Ha, now you both cannot speak unless someone says your name.”</p>\n<p>“Hey Techno,” Phil said immediately, “How did your history test go?”</p>\n<p>Tommy let out an indignant squawk as Techno smirked. Wilbur pouted, burrowing his face into Tommy’s hair.</p>\n<p>“It was good,” Techno said, “I even had Tommy snuggling up against me this whole time, so that was pretty nice.”</p>\n<p>Wilbur wrapped both of his arms around Tommy in retaliation.</p>\n<p>“And who about you, Wil?” Phil asked, “Did you have a good day at school?”</p>\n<p>“No,” Wilbur sulked, “I am very sad and alone and neglected because Tommy decided to snuggle with <em>Techno </em>but not with me.”</p>\n<p>“You are snuggling with me right now,” Tommy pointed out, “So…”</p>\n<p>“Also Tommy’s face is bruised,” Wilbur said, “And I am worried.”</p>\n<p>“What?” Phil asked, his voice slightly sharper than before, “Toms, mate, what happened?”</p>\n<p>Tommy huffed. “Just a couple of bullies,” he said, trying to sound casual, “Thought my peeping was funny or something like that. Techno scared him off.”</p>\n<p>“Where are they?” Wilbur demanded, hugging Tommy so close that his head was basically resting against Wilbur’s chest, “I will hunt them down and make them beg for mercy.”</p>\n<p>“It’s not that big of a deal,” Tommy muttered.</p>\n<p>“Yeah, it kinda was,” Technoblade said, “Don’t worry, dad, I told my teacher about them; he said he’d deal with it.”</p>\n<p>Wilbur snorted. “Yeah, like that’s going to work.”</p>\n<p>“Mr. Nook’s not like the rest,” Tommy said, “He got me an icepack and didn’t demand to see the note.”</p>\n<p>The other teachers had demanded to see the note, probably thinking that this was a silly excuse Tommy had come up with to skip on his own classes.</p>\n<p>“Well, that’s good to hear,” Phil said.</p>\n<p> </p>\n<p>All was well until Tommy had to go to bed.</p>\n<p>“You can sleep with me if you want, mate,” Phil said as he led Tommy to his bedroom with his hands around Tommy’s shoulders.</p>\n<p>Tommy scowled, shaking his head firmly. “No,” he said, “I am a big man; I can sleep by myself.”</p>\n<p>“Okay,” Phil said, sounding reluctant.</p>\n<p>“Okay,” Tommy agreed, staring at the door to his bedroom, “This is it. I will not see you until morning.”</p>\n<p>“Toms.” Phil squeezed his shoulder gently. “If you’re not feeling up to it, nobody will judge you for sleeping with me or one of your brothers for the night.”</p>\n<p>“You’re so clingy,” Tommy grumbled, “I’m <em>fine. </em>You guys have been smothering me all day. I need some alone time.”</p>\n<p>They continued standing there, Tommy making no move to remove himself from Phil’s arm.</p>\n<p>“Do you want me to do it?” Phil asked gently.</p>\n<p>Tommy sighed, completely humiliated. “Yes, please.”</p>\n<p>Phil nodded and slowly let go of Tommy’s shoulder. As soon as the contact was completely severed, Tommy felt a chill in his body, and a series of peeps started coming out.</p>\n<p>“Tommy, are you sure?”</p>\n<p>“I’m sure!” Tommy shouted, yanking his door open, dashing into his room, and slamming the door closed behind him.</p>\n<p>The peeps were getting louder now, and Tommy sunk to the ground, trying not to feel absolutely miserable as his peeps got more and more desperate.</p>\n<p>He was fine. Everything was fine. Tommy was going to crawl into bed and sleep like a normal hybrid. Then, he would pop out of the bed the next morning completely peep free.</p>\n<p>With a sigh, Tommy burrowed himself into his bed and prayed that the peeping would quiet down for the rest of the occupants of the house.</p>\n<p>It didn’t.</p>\n<p>Tommy lasted about one hour. Or, to be more accurate, Wilbur, Techno, and Phil lasted for one hour. Tommy was not planning on leaving his bedroom, regardless of how loud his peeping got or how little sleep he received.</p>\n<p>Wilbur, Techno, and Phil did not seem to agree with him on that point, as Tommy heard the door crack open after an hour of hoping his peeping would <em>shut the hell up.</em></p>\n<p>“Tommy?” Wilbur whispered, “Are you alright in there?”</p>\n<p>“Can we come in?” Phil asked.</p>\n<p>“We’re getting worried,” Techno finished.</p>\n<p>Tommy groaned dramatically, trying to ignore the way his peeping somehow managed to get <em>more </em>desperate at the entrance of his family.</p>\n<p>“I’m—” <em>Peep, peep, peep. “—fine—” Peep, Peep, Peep, Peep. </em>“—damnit.”</p>\n<p>“Hate to break it to you,” Techno said dryly, “But peeping like you are crying for your parents does not exactly sound <em>fine</em>.”</p>\n<p>“Besides, I don’t think any of us are going to get any sleep like this,” Wilbur said lightheartedly, “Why don’t we have a family movie night?”</p>\n<p>It was one o’clock in the morning.</p>\n<p>“Wilbur’s got a point,” Phil said gently, “What do you say, mate?”</p>\n<p>Tommy succumbed, practically <em>leaping </em>out of his bed and sprinting into Phil, wrapping his arms tightly around him. Phil let out a startled “umph” before returning Tommy’s embrace.</p>\n<p>The peeping in the back of his throat died out, and Tommy felt warm again.</p>\n<p>They all returned to the living room, where Tommy became the center of a cuddle pile. Phil made hot-chocolate and popcorn, and they played <em>Up</em>. Come on, this was Tommy they were talking about.</p>\n<p>“Love you guys,” Tommy muttered sleepily.</p>\n<p>His statement was received with various “awwws” and “you toos” and hair ruffles.</p>\n<p>Tommy fell asleep about twenty-minutes into the movie, safely snuggled up against his family, his <em>flock</em>.</p>\n<p>Tommy had hoped that things would return to normal the next morning.</p>\n<p>This, unfortunately, was not the case.</p>\n<p>He woke up with his face resting comfortably against his father’s chest, and Tommy took a moment to just keep his eyes closed, relaxing into the warmth of his dad. It felt good.</p>\n<p>He kind of wanted this moment to last forever.</p>\n<p>Unfortunately, Tommy heard bustling in the kitchen, and he knew that it would only be a matter of time before he was forced awake for breakfast and schoolwork.</p>\n<p>“Is he still asleep?” Wilbur asked from the kitchen, “I could get a turn with him, you know—”</p>\n<p>“Don’t be greedy, Wil,” Technoblade said to the sound of clinking glasses.</p>\n<p>Wilbur made a scoffing sound. “That’s easier for you to say,” he snapped, “You got to keep him for the entire day. <em>I, </em>on the other hand—”</p>\n<p>“Boys,” Phil said calmly, his chest vibrating against Tommy’s ear as he spoke, “Don’t argue while your brother is sleeping.”</p>\n<p>Phil brought a hand around Tommy’s shoulders, and Tommy never felt safer in his life.</p>\n<p>Tommy rested to the sound of the table being set for a little longer, trying not to nestle himself deeper into Phil’s warmth as Phil began gently stroking his down feathers.</p>\n<p>“Toms,” Phil whispered, nudging Tommy’s shoulder slightly, “Toms, it’s time to wake up.”</p>\n<p>Tommy reluctantly opened his eyes, making a grumbling sound and blinking at the sudden light.</p>\n<p>Phil laughed. “I know, I know,” he said, “But you have to wake up now. Breakfast.”</p>\n<p>Sitting up, Tommy tried not to look to disappointed at leaving Phil’s wonderful warmth. He was a big man. He didn’t need to cling to his dad like some sort of baby.</p>\n<p>“How are you feeling?” Technoblade asked from the kitchen.</p>\n<p>Tommy gave Techno a tired thumbs up. “I’m good,” he said tiredly, “Absolutely—” He yawned. “—fantastic.”</p>\n<p>“That’s good to hear, mate,” Phil said. He squeezed Tommy’s shoulders one last time before letting go and standing up from his position on the couch, and it felt as though something had doused Tommy into ice-cold water. “How’s the peep—”</p>\n<p>Tommy let out a series of peeps, and he resisted the urge to scream into the oblivion.</p>\n<p>Tommy felt his face grow warm, and he tried to swallow down the peeping sound as he considered just melting into the floor and ceasing to exist. He thought he’d be <em>done </em>with this peeping business by now.</p>\n<p>Phil smiled and wrapped his arm around Tommy’s shoulder, and Tommy melted in the touch, relieved to hear the stupid sound go away.</p>\n<p>“Guess not, huh?” he asked.</p>\n<p>Tommy scowled, stuffing his hands into his pockets in a last-ditch effort to maintain his dignity.</p>\n<p>“I thought they’d be <em>done </em>by now.”</p>\n<p>“Sorry, mate,” Phil said, looking like he was trying to sound sympathetic but was really trying to resist the urge not to laugh, which Tommy found incredibly insulting, “It’s probably going to last for a few more days.”</p>\n<p>Tommy groaned as Phil led him to the kitchen. “But <em>Phil…”</em></p>\n<p>“Well, I, for one,” Wilbur said, “Don’t see a problem with this.”</p>\n<p>Tommy glared at Wilbur, who was looking way too pleased with himself. “You wouldn’t,” he muttered.</p>\n<p>“After all,” Wilbur continued, going on as if he hadn’t heard Tommy as he poured himself some orange juice, “There was a horrible unbalance of power yesterday.”</p>\n<p>“Yeah?” Techno asked as he began eating his cereal, “And what was that?”</p>\n<p>Wilbur gave Technoblade a withering glare. “You kept Tommy all to yourself,” he said, “And I think it’s time for some pay-back.”</p>\n<p>First of all, this sounded like a crappy plot for a cartoon episode. Second of all, what the heck was going on.</p>\n<p>“Wait a moment,” Tommy interrupted, grateful that Phil hadn’t taken his hand off Tommy’s shoulder as they sat in the seats adjacent to each other, “Do I get a say in any of this?”</p>\n<p>Wilbur and Techno both looked at Tommy and said in unison, “No.”</p>\n<p>Tommy squawked indignantly.</p>\n<p>Wilbur and Techno continued arguing. “Wilbur, it’s not my fault that you didn’t cease the moment like I did,” Technoblade said, “Besides, Tommy chose me—”</p>\n<p>“He chose Tubbo,” Wilbur snapped back, “At best, that makes you his second choice.”</p>\n<p>Techno grinned. “Does that mean you were his third?”</p>\n<p>Wilbur let out a growling sound, scooping up some of his cereal with his spoon and moving the utensil into a catapult position.</p>\n<p>“Take that back,” he whispered.</p>\n<p>Techno only grinned all the wider, leaning back in his chair. “Do your worst.”</p>\n<p>Tommy could practically hear the epic theme music playing in the background as Wilbur closed one eye to take aim.</p>\n<p>“Nope, not doing that,” Phil interrupted, snatching the spoon out of Wilbur’s hands before Wilbur could do anything to stop him.</p>\n<p>Wilbur let out a whining sound. “But <em>Phil—”</em></p>\n<p>“We are not starting a food fight at the breakfast table,” Phil said firmly, “That’s final.”</p>\n<p>Both Wilbur and Techno sulked, and Wilbur had to get up to grab a new spoon so that he could finish his breakfast.</p>\n<p>After that, it was a relatively peaceful breakfast.</p>\n<p>“Okay,” Phil said, placing his spoon down with a clink when they were done, “It’s up to you, Tommy. Do you want to go with Wilbur or Techno? Or do you want to come to work with me?”</p>\n<p>Tommy’s jaw dropped. “I can go to work with you?” he asked, “That’s allowed?”</p>\n<p>Phil nodded. “I called the office yesterday,” he said, “They said as long as you weren’t too much of a distraction, it was fine for you to go.”</p>\n<p>That was actually an incredibly tempting offer. Especially when Wilbur seemed to think that Tommy was some sort of prize, and Technoblade… well, Technoblade already had his turn with cuddling Tommy. Not to mention, he didn’t actually want to get anyone in trouble with the teachers again.</p>\n<p>“Um, yeah,” Tommy said, “Let’s do that.”</p>\n<p>Wilbur let out a dramatic cry to the ceiling. “Betrayal,” he moaned, “Why must you do this to me? What have I ever done to you? All I want are my Tommy cuddles, and I am rejected at every turn.”</p>\n<p>Technoblade laughed. “Haha, take that nerd.”</p>\n<p>Tommy sighed with exasperation.</p>\n<p>Phil escorted Tommy back upstairs, and Tommy hurriedly got ready for his day, trying to get it done as quickly as possible before the peeps became a loud battle cry, because that was really the last thing he needed.</p>\n<p>When he was done brushing his teeth, he burst out of the bathroom and slammed himself into Phil, wrapping his arms tightly around him.</p>\n<p>Phil returned the embrace. “You ready to go, buddy?”</p>\n<p>Tommy nodded, too pleased that he stopped the peeping and got a hug to be embarrassed about it. He’d be more embarrassed later when he had to follow Phil around in his office and hope that Phil’s coworkers wouldn’t decide to laugh at him.</p>\n<p>The car ride, unfortunately, was somewhat tricky.</p>\n<p>At first, it was fine. Tommy was wedged in between Techno and Wil as they both played tug-a-war with who got to hug Tommy the longest in the car, which really just ended with Tommy being the insides of a human sandwich.</p>\n<p>It was pretty nice, though, so Tommy wasn’t complaining.</p>\n<p>The issue, unfortunately, arose when Wilbur and Technoblade got <em>out </em>of the car so that they could go to school.</p>\n<p>The peeping started back up almost instantly.</p>\n<p>“Uh—” <em>Peep. </em>“—Phil—” <em>Peep. </em>“—problem.”</p>\n<p>As Tommy wrapped his arms around himself in an attempt to cease the peeping, Phil quickly glanced back at Tommy as he drove out of the parking lot and grimaced.</p>\n<p>“I didn’t think about,” he said, “Do you think you can reach my shoulders from there, or do you need to climb over to the front seat?”</p>\n<p>Tommy unwound his arms around himself, still peeping annoyingly, and he reached over the front seat to grab onto Phil’s shoulders. It was mildly uncomfortable, and it didn’t feel quite as good as it might to get a hug or arms around his shoulders, but it got the peeping to die down, so there was that.</p>\n<p>The rest of the car ride was done in that awkward position, and Tommy couldn’t be more relieved when they finally made it to Phil’s office building.</p>\n<p>“Alright,” Phil said as he parked the car, “Let’s go.”</p>\n<p>Tommy forced himself to let go of Phil, unbuckle his seatbelt, and hurry out of the vehicle. Now that he was in a public area, the loudness of his peeping seemed all the more obvious, and he was immensely relieved when Phil got out of the car, allowing Tommy to press himself up against his side.</p>\n<p>Phil placed his arm around Tommy’s shoulders again and wrapped a wing protectively around him.</p>\n<p>“You ready?” Phil asked.</p>\n<p>Tommy nodded. “As long as your coworkers don’t laugh at me,” he grumbled.</p>\n<p>Phil chuckled. “Not on my watch.”</p>\n<p>And with that, they headed inside.</p>\n<p>The lady at the front desk didn’t comment on Phil bringing a teenager into the office. As a matter of fact, most people didn’t even seem to care. They made it safely to Phil’s cubicle without any incident.</p>\n<p>Phil pulled a chair next to his own, and Tommy flopped into it, instinctually spinning it around.</p>\n<p>Then his peeping started back up, so he had to scooch the chair close to Phil’s so that Tommy could rest his face against Phil’s shoulder. Phil moved his wing so that it was covering both Tommy and his chair from onlookers, and it was pretty nice.</p>\n<p>Tommy watched contentedly as Phil began to type away on his computer, writing words that Tommy could barely understand. He didn’t really care that much about Phil’s job, to be honest, but the office was nice and quiet, and Phil was letting Tommy snuggle as close to him as possible from a separate chair, and the sound of Phil’s fingers against the keyboard was immensely satisfying.</p>\n<p>Tommy’s eyelids drooped a little bit, and he fell into a doze.</p>\n<p>The next thing Tommy knew, Phil was shaking his shoulder again. Tommy jolted awake, glancing at the clock on Phil’s computer screen.</p>\n<p>How was it already noon?</p>\n<p>“What?” Tommy asked in confusion, “What happened?”</p>\n<p>“You feel asleep, mate,” Phil said quietly, smiling at Tommy’s confusion, “Did you have a nice nap?”</p>\n<p>Tommy blushed. “Uh, yeah,” he said.</p>\n<p>“Are you hungry?” Phil asked, “We can grab some lunch at the cafeteria.”</p>\n<p>Tommy was, in fact, hungry, so they marched down to the cafeteria, Tommy’s body half-hidden by the embrace of Phil’s wings. Tommy didn’t mind too much, though. Sometimes someone would give Phil a strange look, and Phil would simply say “imprinting” before their face cleared, and they made some understanding remark.</p>\n<p>Phil got Tommy a pizza and can of coke at the cafeteria, and they returned to the cubicle to eat.</p>\n<p>“I hope you’re not too bored,” Phil said as Tommy leaned against Phil, taking a bite out of his delicious pizza, “Just watching me work.”</p>\n<p>Tommy shook his head. “It’s nice,” he said, “Better than the peeping, at any rate.”</p>\n<p>Phil chuckled. “Fair enough.”</p>\n<p>Tommy did, in fact, pull out his phone for the reminder of the afternoon, still keeping his face against Phil’s shoulder as Phil continued to work.</p>\n<p>Eventually, Phil and Tommy left to pick Techno up from school. Wilbur had theatre after school, which Tommy was under the impression was supposed to happen yesterday, but he supposed it must’ve been moved.</p>\n<p>As soon as Techno got into the car, Tommy launched on top of him, relieved to not have to be in that awkward shoulder holding position anymore.</p>\n<p>“Wow,” Techno said, “Are you sure I’m not the favorite sibling? I mean, with that sort of welcoming committee—”</p>\n<p>“Shut up,” Tommy muttered, his voice muffled since his face was in Techno’s shirt, “This is just a necessary evil.”</p>\n<p>“Alright,” Techno said skeptically, moving further into the car and buckling his seatbelt, “If you say so.”</p>\n<p>Tommy moved his face so that he’d no longer be speaking into Techno’s shirt. “I do say so,” he said resolutely.</p>\n<p> </p>\n<p>When they got home, the next few hours was spent with Tommy going back and forth between cuddling Techno and cuddling Phil, which would’ve been embarrassing if Tommy just wasn’t so used to it by now.</p>\n<p>Besides, Tommy wasn’t about to deny that the cuddling didn’t feel good. Because it actually felt very good. Amazingly good. Spectacularly good.</p>\n<p>And then Wilbur burst through the doors, his entire body radiating an intense energy that Tommy couldn’t begin to decipher if it was rage or excitement or pure evil.</p>\n<p>“It’s my turn now,” he said. He got down on one knee in front of Tommy and Techno, who was doing his homework on the couch, “Tommy, please, I beseech thee, let me have a turn to cuddle you. I never get to cuddle you, and I want a turn to carry you around on my back or something, <em>please</em>, I will do <em>anything—”</em></p>\n<p>Tommy grinned. “Anything?” he asked.</p>\n<p>Wilbur nodded, his brown curls bouncing up and down frantically. “Anything.”</p>\n<p>And that’s how Wilbur found himself handing over his fluffiest yellow sweater over to Tommy, a look of resignation on his face.</p>\n<p>“I can’t believe you convinced me to do this,” he said grimly, watching as Tommy eagerly put the thing over his head.</p>\n<p>“It’s—” <em>Peep. “—</em>warm<em>,” </em>Tommy protested, practically drowning in the amazingly too large size of the thing, his hands not even peeking out from the sleeves.</p>\n<p>Wilbur sighed. “You better not stain that, it’s my favorite,” he said.</p>\n<p>Tommy nodded impatiently. “Okay—” <em>Peep, peep. </em>“—okay. Can we get on with the hugging or have you changed your mind?”</p>\n<p>A look of pure panic came across Wilbur’s face, and he quickly launched onto Tommy before Tommy could get another peep out.</p>\n<p>“Please, do not abandon me,” he pleaded, “Finally, I get to hug my little brother without Techno stealing you, I cannot miss this moment.”</p>\n<p>Tommy let out a startled laugh from within Wilbur’s arms.</p>\n<p>“You were really desperate, huh?”</p>\n<p>Wilbur sighed dramatically. “I will carry this secret to the grave,” he said, “But you give the best hugs.”</p>\n<p>Tommy felt his entire body grow warm at that, and he resisted the urge to sink further into the fluffy sweater to hide how red his face probably was.</p>\n<p>“I do <em>not,” </em>he protested.</p>\n<p>Wilbur nodded, leading Tommy to sit on Wilbur’s bed. “You do,” he said, “Undoubtedly.”</p>\n<p>“I’m not even hugging you back,” Tommy pointed out as Wilbur opened up his laptop and pulled up Netflix. “I’m literally just leaning against you while you have your arm wrapped around my shoulders.”</p>\n<p>“That is not the point,” Wilbur said, “It’s a big brother thing, you wouldn’t understand.”</p>\n<p>Tommy snorted. “Sounds more like a you thing than a big brother thing.” </p>\n<p>“Shut up, Tommy.”</p>\n<p>Tommy cackled.</p>\n<p> </p>\n<p>The next morning, the peeping actually stopped.</p>\n<p>Tommy tried not to be too disappointed about it as he trudged around the kitchen, completely hug free. He should be happy. He should be the happiest person in the world. Finally, he was free from being tethered to another human being. Finally, he could go about his normal life.</p>\n<p>Phil walked into the kitchen and gave Tommy a quick hug, ruffling his hair. “The peeping stopped?” Phil asked heading to the pantry.</p>\n<p>“Yeah,” Tommy said, hoping he didn’t sound like he was sulking, since that would be stupid.</p>\n<p>“Are you relieved?”</p>\n<p>“Definitely,” Tommy muttered, hugging himself slightly.</p>\n<p>Wilbur and Techno walked into the room next, and Techno raised his eyebrows upon seeing Tommy not latched onto Phil.</p>\n<p>“Oh, so it’s done now,” Wilbur said, “Well, that was early.”</p>\n<p>Techno shrugged, moving to the table and opening up his book. “These things happen.”</p>\n<p>A lump rose to Tommy’s throat, and he quickly moved to swallow it down.</p>\n<p>The peeping was done. He couldn’t expect his family members to randomly hug him now. That wasn’t how it worked.</p>\n<p>The rest of the day had a sort of gloom to it, even though Tommy tried to hide it. He laughed about the peeping to Tubbo, saying that he was relieved that it was finally done.</p>\n<p>When Phil picked them up, Techno was sitting in the front seat, and the middle seat left a gap that felt like a gaping chasm between Tommy and Wilbur.</p>\n<p>It wasn’t until Tommy was halfway through his homework that he finally cracked, slamming his forehead against the table.</p>\n<p>“What’s wrong?” Wilbur asked from the couch, looking up from his phone.</p>\n<p>“Nothing,” Tommy muttered, not picking his head back up, “I’m fine.”</p>\n<p>“Yeah, that was convincing,” Techno said, having marched downstairs for whatever reason, “seriously, what’s bothering you?”</p>\n<p>Tommy swallowed down the lump that had returned to his throat.</p>\n<p>“I just… I didn’t hate the last couple of days as much as I might have made it seem.”</p>\n<p>There was a silence as Wilbur and Techno digested the words, and Tommy already felt the heat creeping back up to his cheeks. Oh god, they were going to think he was so childish now. Why did he say that?</p>\n<p>“Oh,” Wilbur said simply, “Tommy, you can hug us whenever you want.”</p>\n<p>Tommy shot up, staring at Wilbur in shock.</p>\n<p>“Yeah,” Techno said, shrugging, “I mean, I know we don’t mind, and Phil definitely won’t mind.”</p>\n<p>“Really?” Tommy asked, “You won’t… I don’t know… find that annoying?”</p>\n<p>“Well, obviously there’s a time and a place,” Wilbur said, “But right now, at home, I don’t see a problem with it.”</p>\n<p>Tommy looked away. “Yeah, well…”</p>\n<p>“Oh for goodness sakes,” Techno said, his voice lined with exasperation as he marched toward Tommy and grabbed him by the shoulder, pulling him into a hug.</p>\n<p>Tommy stiffened before melting into the sudden embrace.</p>\n<p>“See?” Techno asked, “It’s that easy.”</p>\n<p>Wilbur shot up from the couch, dashing over so that he could hug Tommy as well.</p>\n<p>“And remember?” Wilbur asked, “You’re the best at hugging.”</p>\n<p>“Wow, I’m standing right here,” Techno said dryly.</p>\n<p>“Shut up, Techno,” Wilbur said, burying his face into Tommy’s hair.</p>\n<p>Tommy smiled, relieve flooding his chest. “Thanks guys.”</p>\n<p>“Wait, there’s only three out of four,” Techno said, “That’s disgraceful. Phil! Phil! We need you!”</p>\n<p>“What is it?!” Phil’s voice came from downstairs, and it was soon accompanied by loud footsteps.</p>\n<p>“We need you for a cuddle pile!” Wilbur informed him.</p>\n<p>Phil appeared, and his concerned frown turned into a smile as he saw the group hug that Tommy was stuck in.</p>\n<p>“Oh, I see,” he said understandingly. He joined the hug, wrapping both of his wings protectively around all of them. “You don’t need the peeping as an excuse to get hugs, Tommy.”</p>\n<p>Tommy smiled, barely able to see between his three family members hugging him.</p>\n<p>“You’re all very clingy,” he informed them, “I think you might have the peeping problem now.”</p>\n<p>They laughed, and Tommy smiled.</p>"
}