{
  "id": "30014547",
  "url": "https://archiveofourown.org/works/30014547?view_full_work=true",
  "author": [
    "Monkeygirl77"
  ],
  "title": "The Little Bird",
  "rating": "Not Rated",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [],
  "fandoms": [
    "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
  ],
  "relationships": [
    "Midoriya Izuku & Takami Keigo | Hawks",
    "Midoriya Izuku & Shigaraki Tomura | Shimura Tenko"
  ],
  "characters": [
    "Midoriya Izuku",
    "Takami Keigo | Hawks",
    "Shigaraki Tomura | Shimura Tenko",
    "Yagi Toshinori | All Might",
    "Aizawa Shouta | Eraserhead",
    "Nedzu (My Hero Academia)",
    "Kayama Nemuri | Midnight",
    "Yamada Hizashi | Present Mic",
    "Inui Ryou | Hound Dog",
    "Class 1-A (My Hero Academia)"
  ],
  "additional_tags": [
    "Cute Midoriya Izuku",
    "Aged Down Midoriya Izuku",
    "he's a baby",
    "Izuku is five years old",
    "Everyone else is still the same",
    "Dead Midoriya Inko",
    "Protective Bakugou Katsuki",
    "Soft Bakugou Katsuki",
    "Winged Midoriya Izuku",
    "Midoriya Izuku Has a Quirk",
    "Parental Takami Keigo | Hawks",
    "Good Parent Takami Keigo | Hawks",
    "Protective Takami Keigo | Hawks",
    "Yagi Toshinori | All Might Bashing",
    "Yagi Toshinori | All Might Being an Idiot",
    "Protective Shigaraki Tomura | Shimura Tenko",
    "Soft Shigaraki Tomura | Shimura Tenko",
    "Older Sibling Shigaraki Tomura | Shimura Tenko",
    "Shigaraki: attacking USJ",
    "Izuku: Hi!",
    "Shigaraki: reexamines his life choices",
    "Izuku: giggles",
    "Shigaraki: screw sensei I need this little bird child in my life",
    "Everyone Loves Izuku",
    "Teacher Takami Keigo | Hawks",
    "Izuku's along for the ride",
    "He's not far from Hawks side",
    "Update: End Of Chapter Notes"
  ],
  "language": "English",
  "series": "Part 1 of Papa Bird & NestlingPart 1 of Winged Izuku",
  "published": "2021-03-13",
  "completed": null,
  "words": "6,753",
  "chapters": "1/1",
  "comments": "78",
  "kudos": "7,744",
  "bookmarks": "1,027",
  "hits": "85,290",
  "summary": "<p>Closing his eyes, he asks mommy for good luck, opens his wings, and jumps—“Woah, baby bird.” He yelps as he snatched up mid air and immediately curls up. “Hey, it’s okay, I’m not gonna hurt you.” Slowly, he peeks, taking note of the arms curled around him, and the ground, something of which he is not standing on, before he looks up, and smiles when Hawks smiles. “Gotta learn to fly before you jump, baby bird.”</p>",
  "notes": "",
  "text": "<p>Izuku’s quirk showed itself when he was four and a half, nearly five, literally <em>showed</em> itself. In the form of wings, large white speckled wings, it was a horrible experience of which he would never wish on another human soul, appendages tearing through his back, the only thing worse then having appendages tearing through your back is having it done alone, Izuku’s mother had passed away shortly before his manifestation, car accident, and Izuku had been so terrified of the people in suits that he fled, he ran, he ran as fast as his little legs could carry him, until he found a place to hide.</p>\n<p>A hole in an old building, falling apart around him, but still somewhat whole, he found a small section with a small covering of the roof over it, and set up shop.</p>\n<p>He slowly piled together different soft materials he could find, discarded blankets and hoodies, he found a pillow once, he made himself a little nest from old blankets and lost hoodies, and his single pillow, and slept contentedly, as contentedly as a winged four year old could sleep.</p>\n<p>Izuku, being an intelligent four year old, collected little metal pieces from Dagobah beach to sell for scrap to earn a few yen to buy himself food, he cut holes in the too big hoodies to accommodate his wings when he decided to go out. People would watch him walk passed, with his small white speckled wings and oversized hoodies, but never stopped him, for which he was grateful.</p>\n<p>He had a calendar, and he decided, one afternoon as he ate from a cup of ramen, that he’d learn to fly when he turned five.</p>\n<p align=\"center\">…</p>\n<p>“Happy birthday, Izu.” The small newly aged five year old whispers to himself in his nest of blankets and hoodies, a small cupcake resting on a notebook, a single candle flickering in the darkness of the disappearing sun beyond the horizon, the cupcake had been a bit much, he’d had a tough time deciding between the cupcake and a cup of noodles, but it was his birthday, and he wanted something good for his birthday, so he went without the noodles in favor of the cupcake. “I miss you mommy. I’m five today. I love you mommy.”</p>\n<p>Izuku blows the candle out with a small puff, and smiles, carefully pulling it out from the top of the treat, setting it aside, outside of his nest, and peeled the paper off, taking a bite of the sweet cake, he giggles when icing sticks to his nose and tries to lick it off for a minute before wiping it up with a finger and licking it off from there. He eats his cupcake slowly, wanting to savor it, not wanting to eat it too fast and not enjoy it.</p>\n<p>When he’s finished, he licks his fingers clean, rubs his hands on the front of the oversized hoodie he’s wearing, and slowly curls up, reaching for his pillow, curling his wings around him for some warmth, and settles down.</p>\n<p align=\"center\">…</p>\n<p>He awakes the next morning, early, but not too early, the sun’s been up longer then him, and yawns, stretching his arms and wings out wide, rubbing at his eyes as he looks around his corner, leaning over the edge of his next for the small pocket sized photo tucked safely in his shoe, and smiles down at it. “Hi mommy.” He rubs at his eyes when a small tear splashes down on the picture. “I’m gonna try and fly today. Wish me luck mommy.”</p>\n<p>Scurrying out of his nest, he sets the small photo down on the windowsill and tugs his hoodie off, exchanging the Gang Orca hoodie for a Hawks hoodie, he figured it was good luck, because Hawks had wings and he could fly, and he had wings and he was going to fly too. Carefully stuffing his feet in his sneakers, he ties them, and reaches for his photo, tucking it in the hoodie pocket, he pulls the hood up, and carefully makes his way out of his little hidey hole home.</p>\n<p>He wanders through the crowd, wings tucked in close, so people don’t touch them, the hood of his too big Hawks hoodie shielding him from prying eyes, and he weaves his way through the crowd towards the park, lots of open space to try flying like he told mommy he was going to do.</p>\n<p>The park was nearly empty, a few kids were playing on the swings, but other than that, it was deserted.</p>\n<p>The small winged boy isn’t really sure how to start or what to do, and stands next to the slide in contemplation, looking around the park.</p>\n<p>He could swing really high and jump off and try.</p>\n<p>He could climb to the top of the jungle gym and jump off and try.</p>\n<p>Izuku taps his lip thoughtfully, before shrugging, pulling his picture out to press a quick good luck kiss to it, he tucks it back in his pocket, and carefully climbs up the jungle gym, he finds, as he stands at the top, wind blowing through his feathers, that its much higher then he thought it was, and he stares down at the ground that seems <em>soo</em> far away.</p>\n<p>Closing his eyes, he asks mommy for good luck, opens his wings, and jumps—“Woah, baby bird.” He yelps as he snatched up mid air and immediately curls up. “Hey, it’s okay, I’m not gonna hurt you.” Slowly, he peeks, taking note of the arms curled around him, and the ground, something of which he is not standing on, before he looks up, and smiles when Hawks smiles. “Gotta learn to fly before you jump, baby bird.”</p>\n<p>Izuku smiles brightly and waves a small hand at the winged hero. “Hi!”</p>\n<p>Hawks chuckles softly. “Hi.” He slowly lowers them to the ground but noticeably doesn’t put the small winged child down. “What’s your name?”</p>\n<p>“I’m Izuku!” He holds up a hand proudly, with all five fingers, and grins. “I’m five!”</p>\n<p>“Well, Izuku, it’s nice to meet you, I’m Keigo, I’m twenty-two.” He bounces the boy lightly. “So, you’re trying to fly for the first time?”</p>\n<p>Izuku nods slightly. “Yea, I told mommy I was gonna do it, but I don’t know how.”</p>\n<p>“Your mom’s here?” The hero looks around. “Where is she?”</p>\n<p>The small greenette leans back to fish into the pocket of his overly large Hawks hoodie for his small photo and shows it to the man. “Here!”</p>\n<p>Keigo takes one look at the photo and takes the proclamation that comes with it, and his heart <em>drops, </em>it doesn’t take a genius to figure out how to put those pieces together. He doesn’t let the sadness seep through though, he keeps it to himself, and smiles at the photo. “She’s really pretty.”</p>\n<p>“Isn’t she!” Izuku pulls the old worn photo around and smiles at it. “I love mommy.”</p>\n<p>“I’m sure she loves you too, Izuku, you look just like her.” A small sad silence settles over them and he takes a moment to figure out how to break it. “I’ll teach you how to fly.”</p>\n<p>The child’s face lights up, and he stuffs his photo back into his hoodie pocket and curls his small hands over his shoulders. “Really!”</p>\n<p>He smiles at the child’s exuberance. “Really!” The blonde leans over to set the small boy on his feet. “Okay, do what I do, okay?”</p>\n<p>Izuku nods firmly, the look of pure determination that overcomes his babyface is utterly adorable, and he resists the urge to take a picture of it with great difficulty. “Okay!” He bites his lip, opening his wings in the same fashion the man does, and sweeps them downwards in the same fashion, yelping when he lifts himself from the ground. “Good Izuku, now, keep beating your wings in a sweeping motion.” The hero lifts himself just a bit higher and holds his hands out. “Fly up to me, baby bird.”</p>\n<p>The five year old nods slightly, and practices for a moment, before kicking off the ground, sweeping his wings like he was told to, it’s shaky, but he meets the outstretched hands, smiling when they curl around his middle and snag him up. “You did it, baby bird!”</p>\n<p>“I did it! I did it!” Izuku claps excitedly and jumps forward, hugging his arms around the pro’s neck tightly, pressing their cheeks together. “Thank you, big bird!”</p>\n<p>He smiles, hugging the little fledgling closer. “Your mom is so proud of you, baby bird.”</p>\n<p>The little bird falls silent for a moment and sniffles softly. “I miss mommy.”</p>\n<p>“I know, baby bird.” Keigo curls a hand around the back of the boy’s head, curling his wings around them, squeezing him closer. “She misses you too.”</p>\n<p>Izuku pulls back, tears make his green eyes shimmer. “Mommy told me to stay with Auntie ‘Suki and Kacchan and said she’d be right back, she had to go to the store, and then a long time passed, and these guys in blue suits came and said mommy had been in an accident and Auntie ‘Suki started crying and Kacchan got angry when the guys said they were gonna take me away and Auntie ‘Suki started yellin’ and Kacchan took me to his window and pushed it open and told me to run ‘cause he didn’t want me to get a mean new mommy and daddy so I climbed out and ran and hid from the guys in blue suits so they couldn’t take me away to a mean new mommy and daddy.”</p>\n<p>“Baby bird,” he choses his words very carefully. “Do you have a new mom and dad; do they know you’re here?”</p>\n<p>“Nope.” The greenette chirps and shakes his head, patting the pocket of his hoodie. “It’s just me and mommy.”</p>\n<p>“So,” Keigo tilts his head. “You’re on your own?”</p>\n<p>Izuku shakes his head. “No, mommy’s here too.”</p>\n<p>“Right, it’s just you and your mom,” the winged man asks. “No one else?”</p>\n<p>“Nope.” He chirps again. “Just me and mommy.”</p>\n<p>Concern fills him for the little baby bird at the implications of that statement. “We’re friends, right?”</p>\n<p>“Yea!” Izuku smiles and nods. “We are a…..what’s it called…umm….a….”</p>\n<p>“Flock?”</p>\n<p>“Yea!” Izuku nods again. “You got wings and I got wings and birds have wings and more then one bird is a flock and there’s two of us and we’re like birds and that means we’re a flock!”</p>\n<p>He smiles at him. “We sure are. Can you show big bird where you and mommy live?”</p>\n<p>The little winged boy nods lightly. “Yep!”</p>\n<p>Keigo nods and lands, setting the child on his feet, smiling at the feeling of little fingers curling around his. “Lead the way, baby bird.”</p>\n<p align=\"center\">…</p>\n<p>“This is my window, and this is my table, and this is my cup, and this is my nest!” His heart breaks at the accommodations the excitable child has as he shows him everything, he looks down when the small child holds a book up to him. “And, this is my bird book, I like it, ‘cause I like birds, Kacchan used to say that it was silly because I was like a bird and I liked birds and Auntie ‘Suki showed me what bird I was like!”</p>\n<p>“Oh, yea?” He squats down and smiles at him. “Which bird are you?”</p>\n<p>Izuku smiles a big smile. “I’m like a snow owl, cause my wings are white with black dots, and a snow owl has white wings with black dots.” The five year old opens his bird book and flips through the pages until he finds the one he’s looking for, pointing at a bird, a red-tailed hawk. “This is you! ‘Cause your name is Hawks and you have red wings and this one is a hawk, and it has red wings.”</p>\n<p>“You’re really smart, baby bird.” Keigo taps the picture of the hawk. “That’s my bird, alright.” He looks around the small little home made up in a corner with a lone awning of a roof, and points at the mound of old blankets and lost hoodies. “This is your nest?”</p>\n<p>The bright child nods happily, closing his bird book and hugging it to his chest, and pokes the mound with his foot. “Yea! I made it all on my own! I made it outta lost stuff!” He turns and gives him the most serious look he’s ever seen on a five year old’s face. “I didn’ steal any of it! I found it all!”</p>\n<p>“Hey,” he holds up his hands in surrender. “I didn’t think you did, and I most certainly didn’t say so.” He hums deeply, he can’t in good conscience leave a <em>five year old</em> out here on his own, legally, as a hero, he’s obligated to take him in, he’s technically a runaway, but the little bird has already been through so much, and he was adorable, and they were apparently a flock, as the child had proclaimed, and he didn’t really <em>want</em> to give up his new baby bird. “I have a nest.”</p>\n<p>Bright green eyes meet his. “You do!”</p>\n<p>“I do, it’s a <em>big</em> nest!” He spreads his arms and wings. “<em>This</em> big!”</p>\n<p>“<em>That</em> big!” The five year old leans against his knees. “That’s <em>really</em> big, big bird!”</p>\n<p>“Well, I’m a big bird, I need a big nest, don’t I?”</p>\n<p>Izuku tilts his head and thinks, his thinking face is adorable, if he could, he’d take a picture. “I guess that makes sense.”</p>\n<p>Keigo smiles at him. “Wanna come see <em>my</em> nest, I mean, you showed me <em>yours</em>, can I show you <em>mine</em>?”</p>\n<p>“Can I!” The little bird bounces slightly. “I wanna see your nest!”</p>\n<p>“Sure, you can,” the child shrieks when he stands, scooping him up with him, cradling him in his arms. “You can try out my nest and tell me which one you like better.”</p>\n<p>The winged child nods. “Okay!”</p>\n<p align=\"center\">…</p>\n<p>Keigo’s not really sure how he’d left his apartment with the intention of getting some fast food, probably KFC, he likes fried chicken, fucking sue him, and ended up returning with no food, and a small five year old winged child, feathers and curls damp from a bath, wearing one of his old t-shirts.</p>\n<p>He’s learned not to question fate.</p>\n<p>“This is <em>my</em> nest.” He waves a hand at the large pit filled with pillows and blankets, the small boy standing at his side, the fingers of his right hand curled in the leg of his pajama pants. “I told you it was big, didn’t I?”</p>\n<p>“It’s <em>really</em> big!” Izuku grins up at him. “But, you’re a big bird, so you need a big nest.”</p>\n<p>“That’s what I said, too.” He leans over and scoops the boy up under the arms. “Try it out.” And tosses him into the mess of pillows and blankets.</p>\n<p>Izuku shrieks, as he’s thrown forward, kicking his legs and waving his arms, giggling brightly when he lands on a large soft pillow, and rights himself.</p>\n<p>The hero smiles at his giggles and drops down himself, grunting softly when he lands, he flops over and just sprawls out, spreading his arms and wings out wide, closes his eyes, and just lays there. Listening to the soft giggles, it’s heartwarming, his apartment had always been so <em>quiet</em>, he likes the soft giggling. He doesn’t move when he feels a small body climb up on top of him, a light weight laying on his chest, and smiles when a finger pokes his cheek, opening his eyes to meet the baby bird’s.</p>\n<p>He giggles down at him. “I like you, big bird, and I like your nest too.”</p>\n<p>“Aww, you like me?” Izuku giggles and nods, Keigo smiles at him, curling his arms and wings around them as he rolls them over, resting on his elbows above the small child. “Well, I like you too, baby bird.” He leans in closer and they stare at each other, until Izuku licks his nose and giggles again, as he makes a face and leans back. “You little…” The winged child squeals brightly when he tickles his sides and squirms, pushing at his chest as much as he can, and he chuckles. “Say you’re sorry, baby bird.”</p>\n<p>“S—Sohohohorry! S—S—Sohohohorry, bihihihig bihihihird!”</p>\n<p>He stops, after another minute, because the kid’s bright laughter is adorable, and leans in to lick his nose lightly in revenge. “Hungry?”</p>\n<p>Izuku nods. “Yea!”</p>\n<p>“Me too,” he rolls off the five year old and sits up, raising his arms when the boy follows, and climbs up to sit in his lap, lowering his arms to curl around him. “What’re hungry for?”</p>\n<p>“I dunno.” The greenette shrugs. “Can we have something other then noodles though because I eat noodles all the time.”</p>\n<p>“Yea, sure, we can have something other then noodles.” The blonde nods lightly, hugging the small boy close. “I really want some chicken, have you ever had chicken before?”</p>\n<p>Izuku nods and tilts his head back to look up at him. “Yea, I like chicken nuggets!”</p>\n<p>“Oh, baby bird, you’re gonna fit right in!” He smiles when the boy giggles when he uses his wings to lift himself to his feet, taking him up with him, and settles him on his hip as he steps out of their nest. “Let me get my phone and we can order some.” Keigo leans forward when they’re close enough to the island to scoop up his phone, and one handedly, he opens the doordash app, and leans back against the counter as he scrolls through the restaurant list for his favorite chicken place. Izuku curls his arm over his shoulder and leans in closer to watch him scroll down the list as he chews on his fingers, until he finds it, and selects it, then scrolls through the menu. He himself wants hot wings and adds nuggets to the cart for the fledgling. “Want some fries?”</p>\n<p>The small boy nods, and his curls brush against his cheek when he leans in closer to watch him tap things he wants, he confirms their order, and turns to the boy resting on his hip, Izuku smiles at him around his fingers, and he returns his smile, leaning in to peck his nose, before turning to set his phone back on the island. “Now, we just wait.”</p>\n<p>The tot pulls his fingers out of his mouth. “Thanks for bringing me, big bird!”</p>\n<p>“You’re welcome, baby bird.” Keigo turns back to the white winged boy. “How would you feel about staying here, I got enough room, and I’m kind of attached to my baby bird.”</p>\n<p>“I can <em>stay</em>?”</p>\n<p>He nods. “If you want to, I can find you another home if want, but if you wanna stay here, I’d like that.”</p>\n<p>“I wanna stay!” Izuku smiles widely. “We’re a flock! I gots to stay!”</p>\n<p>“That’s what I thought too!”</p>\n<p align=\"center\">…</p>\n<p>They practice flying at the park for a month before the real fun begins, chasing each other above the city, it’s mainly him who chases the fledgling, but it makes his baby bird happy, and he’ll try his damned hardest to do anything that makes his little baby bird happy.</p>\n<p>Keigo drops low, watching the little owl pause midair, looking around curiously, and rockets himself forward with one hard beat of his wings, catching the little bird by surprise. Izuku shrieks and squeals when he tickles his belly, bringing them to hover in the air, and he holds him out, smiling as the little bird spreads his white speckled wings wide. “Caught you, baby bird!”</p>\n<p>“Papa, you’re a cheater!” Izuku cries out in a fit of giggles. “You cheated!”</p>\n<p>He chuckles softly. “How do you cheat in tag?”</p>\n<p>“I dunno, but you did!”</p>\n<p>The five year old flaps his wings and pulls out of his grip, leaning forward, until they’re face to face, and licks his nose, giggling as he darts away when he yells playfully, and makes chase again. He follows the little bird to the balcony of their penthouse apartment, Izuku lands roughly, stumbling as he runs through the doors, and he lands behind him, continuing the chase, and swoops the five year old up before he can reach the safety of the nest, the safe zone, and he shrieks as he’s tossed up, flapping his wings to keep himself airborne.</p>\n<p>The hero stares up at him. “You know the rules, mister, no flying in the apartment.” Keigo catches the fledgling when he tucks his wings in and drops, pulling him in close. “Did you have fun?”</p>\n<p>Izuku giggles and nods, rubbing at the scruff on his chin. “Like flyin’ with you, papa!”</p>\n<p>He shrieks softly when he tries to bite his fingers. “I like flying with you too, baby bird.”</p>\n<p align=\"center\">…</p>\n<p>Izuku hides in papa bird’s shoulder as they approach the big building, he’s not <em>scared</em>, he’s <em>not</em>, he just <em>wants</em> to hide in papa bird’s shoulder, that’s <em>all</em>. The fingers of his right hand curled in the back of the man’s shirt, the fingers of his left hand in his mouth, watching the big kids walk passed them silently.</p>\n<p>Papa bird opens a door, and walks up some stairs, the door closing behind them, the room is dark, not too dark, he can still see, and there’s big tv’s on the front wall, and chairs, some of them are empty, and he perks up slightly when he sees people, heroes, like papa bird.</p>\n<p>“Aw, Takami,” both man and child turn at the call of a woman, Izuku thinks she’s pretty, and she waves at him, he doesn’t wave back, but he does smile at her around his fingers. “Is this your mysterious baby bird?”</p>\n<p>“Yea, this is him.” He turns when papa bird turns, smiling when he kisses him on the nose lightly, before turning back to the woman. “Izuku, this is Kayama, she’s Midnight, you remember me telling you about her, right?”</p>\n<p>“Mhmm.” The tyke nods. “She puts people to sleep.”</p>\n<p>“Aww, Takami, you told him about me!”</p>\n<p>Izuku pulls his fingers out of his mouth and waves at her. “You’re really pretty, Ms. Midnight!”</p>\n<p>“Awww, baby bird!” Midnight coos softly. “Call me Auntie Nemuri!”</p>\n<p>“Okay Auntie Nemuri!”</p>\n<p>“Oh, we’ve got a little little listener joining us today!” The little winged boy turns in the direction of the new voice, at another blonde man, who smiles and waves at him. “You can call me Uncle Hizashi, little bird.”</p>\n<p>“Okay!”</p>\n<p>Izuku looks over when Keigo pokes his belly. “You remember who I said he was, don’t you?”</p>\n<p>He nods. “Present Mic!”</p>\n<p>“Awwww!” The voice hero gushes. “He knows me!”</p>\n<p>“A small problem child is among us?” Izuku turns to see a dark haired man in black clothes with a large grey scarf, and smiles, waving at him over papa bird’s shoulder, the man smiles lightly and waves back. “You can call me Uncle Shouta.”</p>\n<p>“Okay, Uncle Shouta!”</p>\n<p>“If it isn’t Hawks and his mysterious baby bird.”</p>\n<p>The winged boy smiles and waves at the stoat in the big chair. “Hi, Uncle Nedzu!”</p>\n<p>“Hello, little Takami, it’s a pleasure to see you again.”</p>\n<p>He giggles and nods, fingers returning to his mouth. “You too!”</p>\n<p>“Why is there a child here?” A sickly looking blonde man inquires as he enter’s and everyone turns to look at him. “Is that truly a good idea, children have a habit of chattering, he might reveal sensitive materiel.”</p>\n<p>Keigo curls a wing around his kid protectively. “He’s my son, All Might.”</p>\n<p>All Might nods. “Wouldn’t it have been best to have someone watch over him instead of bringing him here?”</p>\n<p>“I’m not leaving my son in the care of strangers.” He shakes his head firmly, his wing twitching when little fingers curl in his feathers, and pushes it back slightly so green eyes can peer out from behind it. “He goes where I go. Very few people know about him, for his safety, and I’m not allowing someone who might go blabbing about him watch over him.”</p>\n<p>“Perhaps,” All Might starts. “He could have been left with another hero.”</p>\n<p>“No,” the winged hero shakes his head. “Nishiya was busy with his new sidekicks and Rumi is on a mission. He’s staying, get over it.” He looks at his baby bird and smiles when he sticks his tongue out at the number one hero and blows a raspberry. “Yea, you tell’em, baby bird.”</p>\n<p>Midnight laughs softly, giving the baby bird a thumbs up when Hawks turns to claim his seat between Nedzu and Eraserhead, settling the boy on his lap and giving him his phone to entertain himself with, Izuku is a godsend, he does not require to <em>be</em> entertained, he is perfectly capable of entertaining himself, give him your phone, and he’ll be entertained for hours.</p>\n<p align=\"center\">…</p>\n<p>The first day of class is something, it truly is, he dresses himself in his hero costume, as was the way, and because he thinks he’s hilarious, he dresses Izuku in a Hawks t-shirt and a pair of pants, the owlet wanted to go barefoot, so he said what the heck, and let him go barefoot.</p>\n<p>At every opportunity, All Might took the time to tell him how it was a bad idea to have a child with them, and at every opportunity, he kindly told him to shut up and his kid would blow a raspberry at him.</p>\n<p>“I AM ENTERING THROUGH THE DOOR LIKE A NORMAL PERSON!”</p>\n<p>Izuku giggles when he groans, and immediately curls a small hand around his mouth when he turns to glare at him playfully, following after the older hero into class 1-As homeroom. The students perk up at the sight of a small winged boy sitting on the number three hero’s arm chewing on his fingers, the greenette surveys them all. The girls coo softly when he ducks into the winged hero’s shoulder.</p>\n<p>Hawks groans again, and glares at the boy once more when he giggles again, causing the girls to coo and aw, but he’s smiling when he turns back around. “All Might, normal people don’t announce themselves when they enter a room.” The greenette smacks a small hand over his mouth and giggles softly and the room smiles at the sound of it. “Okay, everyone, we’re your heroics teachers, put on your hero costumes and meet us down in Beta three, you’ve got ten minutes.” He turns out of the room, heading for the simulation joint, and smiles down at the small child, tickling his belly lightly, making him giggle again. “You like seeing me suffer don’t you, baby bird?” The small child giggles and leans up to kiss his cheek. “Aww, baby bird, I forgive you.”</p>\n<p>All Might’s following after them, he can hear him, but chooses to ignore him.</p>\n<p>Entering the viewing room for the mock city, Izuku stretches, stretching his arms and wings wide, and yawns, flopping forward against his shoulder, ah, naptime.</p>\n<p align=\"center\">…</p>\n<p>Izuku quickly comes to the conclusion that All Might is just like the men in blue suits who wanted to take him away when he introduces him to two men in black suits.</p>\n<p>“Takami, these nice gentlemen are going to watch over you today while your father works.”</p>\n<p>Now, he may only be five years old, but he’s a very good judge of character, and he knows, that the way the two men in black suits are watching him makes them bad people.</p>\n<p>“Another kid with an avian quirk.”</p>\n<p>The other man nods sharply. “I wonder what he’s able to do.”</p>\n<p>The man next to him nods too. “He could be another success story, like our first avian quirked kid.”</p>\n<p>Izuku knows, at the very first word, that he wants two of two things, one, to be very far away from them, and two, papa. He screams when one of the two mean men in black suits reaches out for him, jumping backwards, wings flaring in what is intended to be a threatening manner, but the one man steps forward, and snags his arm when he’s close enough, and he screams again when he doesn’t let go, a sob tearing from his chest when he’s pulled forward, and the other man grabs his other arm, nodding at the number one hero. “Thank you, All Might, we’ll most certainly provide him with supervision.”</p>\n<p>He struggles, flapping his wings wildly, tearing and tugging at his arms, dragging his heels, screaming and sobbing in terror as the two men drag him down the hall.</p>\n<p>And, then it happens, the temperature in the hall drops drastically, it starts <em>snowing</em> in the hallway, and the two men let go and shake their hands, their palms frostbitten, he knows what it looks like, he’s been frost bitten before.</p>\n<p>They snarl at him and reach out with their other hands.</p>\n<p>“It’s always a pleasure to have any representatives from the Hero Commission visiting U.A.” He’s never been more relieved to hear Uncle Nedzu’s voice. “But, it is standard protocol for guests to be brought to my office before given access to the rest of the school.”</p>\n<p>In the men’s surprise at being caught, Izuku darts around, running for the legs of the nearest person, and sobs when Uncle Ryo picks him up, whispering soothingly, letting him curl around him as best as he can, arms, legs, and wings.</p>\n<p>The man with red hair in a black suit regards the stoat cautiously. “He’s not a student, Nedzu.”</p>\n<p>“No,” Nedzu shakes his head. “You’re correct, his is not, but he is the child of one of my teachers, and therefore has the same protection.” His gaze sharpens. “You are not permitted to take anyone off my campus without my expressed permission, that was the agreement made between myself and the president, and I happen to know you did not discuss his removal with myself <em>or</em> her before attempting to take him.” The stoat presses his paws together. “I’d hate to think what might happen if word were to get out that two Commission representatives were going to kidnap <em>another</em> child.” The Commission had taken a heavy strike from the public and Japanese Government when word got out about what had been done to the current number three hero, <em>kidnapped </em>at such a young age, tortured, brutally trained, treated less then human.  Nedzu had a sort of kinship with the winged hero, he too know what brutal abuse felt like, it was one of few things they had in common. “And, nevertheless, the child of the hero who was the cause of such heavy restrictions imposed by the Japanese Government, they gave one chance at redemption before they did some restaffing and delivered persecution for such heinous treatment, I do wonder how they would feel about you attempting to kidnap the child of their favored hero.”</p>\n<p>The dark haired an in a black suit glares down at the principle. “Are you threatening the Commission?”</p>\n<p>He waves a paw dismissively. “Heaven’s no, I’m merely inquiring, no one would have to be none the wiser of this current predicament we find ourselves in, if you leave my campus and refrain from attempting to have contact with young Takami again.” He crosses his paws again. “After all, you both wouldn’t want to be the reason the Commission is rebuilt, your President loses her job and faces criminal charges, would you?”</p>\n<p>The two Commission representatives exchange looks and nod firmly, turning to make their leave, noticeably, <em>empty handed</em>, their dress shoes crunch over the snow accumulating under foot as the disappear around the corner.</p>\n<p>Nedzu turns to the owlet crying into Hound Dog’s shoulder. “Young Takami, it is alright, do you think you could make it stop snowing, I wouldn’t want anyone to slip on the snow and hurt themselves.”</p>\n<p>The small winged boy curls around the larger hero tightly, but the snow does stop falling, and the stoat nods, thought intrigued by the boys quirk and what exactly it entailed, he knew now was not the right time to inquire about it, the priority in this situation was getting the frightened child with an otherwise unknown quirk back to his father.</p>\n<p>“Come, Ryo, it is imperative we return him to Hawks before any more unintended quirk usage occurs.” He nods, turning in time with the stoat, and together they make their way down the snowy hall, snow crunching underfoot, a cleaning bot would be sent to clean up the mess.</p>\n<p>They find them on the training field, overseeing the students battling each other, and both heroes turn at the sound of the child’s cries.</p>\n<p>All Might and Hawks frown for very different reasons.</p>\n<p>The winged hero reaches out for his young son. “Baby bird, what’s wrong, you were napping in the staff lounge, I was coming back after class.”</p>\n<p>Izuku curls around the hero, sobbing into his shoulder, curling his wings around himself as best as he could. Hawks rubs his back soothingly and looks up at the two who’d brought his extremely distraught son to him sharply. “What happened, he was down for his nap, he should still <em>be</em> napping.”</p>\n<p>Nedzu presses his paws together. “Someone,” his gaze briefly flickers to All Might before returning to the other. “Called in representatives from the Commission.”</p>\n<p>“They <em>what!”</em> He bounces the five year old lightly in an attempt to calm him down, and it works, slowly but surely. “<em>Who!”</em></p>\n<p>All Might clears his throat and they turn to him. “I did. I thought they should be made aware of the child’s predicament.”</p>\n<p>Hawks glowers at him over the silent child in his arms. “You <em>what</em>! What <em>predicament</em>!”</p>\n<p>“He should not be here.” The other blonde nods in assurance. “It is unsafe. He should be looked after elsewhere.”</p>\n<p>“So, you would have taken my son from me without my knowledge?” He snarls lowly. “You would have been complacent in him being kidnapped?”</p>\n<p>“They wouldn’t have kept him.”</p>\n<p>“They kept <em>me</em>!”</p>\n<p>“Wait,” they all turn at the young voice that calls out, the blonde teen with the explosion quirk, and he’s glaring at the number one hero. “You almost let the bird boy be kidnapped?”</p>\n<p>Izuku sniffles and turns around to see, rubbing at his nose with the back of his right hand, his other curled tightly in the collar of papa bird’s coat. “K—Kacchan?”</p>\n<p>Bakugo Katsuki nods. “Hey, bird boy, it’s good to see you again, safe and sound.”</p>\n<p>The winged child giggles softly. “Missed you.”</p>\n<p>“I missed you too.” The normally gruff and brash teen’s tone is surprisingly gentle and soft. “You should come over and see mom and dad, they’d be really happy to see you, they’ve been worried about you all this time.”</p>\n<p>Izuku nods and looks up at the hero holding him. “Can we go see Auntie ‘Suki and Uncle ‘Saru, papa?”</p>\n<p>Hawks smiles down at him and nods, nuzzling their cheeks together. “Of course, we can.”</p>\n<p>The blonde teen nods. “I’ll tell my mom and dad and get back to you.”</p>\n<p>The hero turns and nods at the teen. “Of course, thanks.”</p>\n<p>“Yea.” He glares at All Might before he turns to return to the class.</p>\n<p>“Hawks, a word?” The winged man turns back to the principle, perched on Hound Dog’s shoulder. “Young Izuku’s quirk may be more then a simple avian mutation. He made it snow in the hallway and gave the two representatives frostbite from mere touch.”</p>\n<p>“Really?” Hawks turns to smile at the small child, tickling his belly lightly, making him giggle brightly, a far cry from his sobbing minutes ago. “Is my little owlet a powerful little thing?” Izuku squeals softly when he turns to try and get away and fingers tickle his side instead. “We’re gonna have to look into this, aren’t we, little snow bird?”</p>\n<p>“Papa! Papa!” The winged child cries between fits of bright bubbly laughter. “Stop! Tickles! Stop!”</p>\n<p>“I’ll stop,” he brushes their noses together and smiles when the little trouble maker licks his nose. “But you’re gonna get it later for licking my nose, you little brat.”</p>\n<p align=\"center\">…</p>\n<p>Izuku knows he’s going to be in big trouble, when papa tells him to go hide when the villains attack the USJ, and he flies over their heads to the blue haired man taunting Uncle Shouta, and lands just beside him, making the man jump in surprise, clearly not expecting a five year old winged child to just appear.</p>\n<p>“Hi!” He waves up at the man. “I’m Izuku! I’m five! What’s your name?”</p>\n<p>Red eyes watch him for a long time, and he smiles, waving again, before the man slowly smiles, and squats to be on his level. “Hello, little bird, I’m Tomura, I’m twenty.”</p>\n<p>The little child bounces slightly and points at his hair. “I like your hair! Blue is my favorite color!”</p>\n<p>“Thanks, Izuku,” Tomura ruffles his curls with a gloved hand. “I like your hair too, my favorite color’s green.”</p>\n<p>He leans forward against the man’s knees. “Why are you so mad?”</p>\n<p>“I’m not mad.” The man shakes his head. “I’m just doing as I was told to.”</p>\n<p>“Then,” Izuku tilts his head and his wings flutter curiously. “Why are you hurtin’ everyone if you’re not mad? You were told to hurt people? Why? Do you wanna hurt people? Are you gonna hurt me too?”</p>\n<p>“I—I—” Tomura stutters, for the first time in his life, he’s stumped, and by a small winged five year old boy no less. “I’m not going to hurt you.”</p>\n<p>“Why not?”</p>\n<p>The man tilts his head slightly. “I—I don’t want to hurt kids.”</p>\n<p>The greenette tilts his head to the other side. “But aren’t the others just kids too, I mean, they’re big kids, but aren’t big kids still kids too? Why are you doing something you don’t want to do? That doesn’t sound right. You shouldn’t be forced to do something you don’t want to do. People who make you do things you don’t want to do are meanies and I like you and I don’t think you should listen to meanies because meanies hurt you and I don’t want you to get hurt.”</p>\n<p>“I—I—” Tomura did <em>not</em> plan for this, for a small winged child to tell him, one, that he liked him, two, that he shouldn’t have to do something he didn’t want to do, and three, if he didn’t want to hurt kids then he shouldn’t be hurting the hero brats because they’re still kids, albeit, in the little birds words, big kids. He did not plan for this turn of events. “I never thought of that.”</p>\n<p>Izuku giggles, and by god, it’s the most adorable thing he’s ever heard in his entire lifetime, and he does what he usually does to people he really likes, leans up on the man’s knees, and licks his nose.</p>\n<p>His new friend laughs softly, and he shrieks when he’s scooped up into the blue haired man’s arms, as he rises. “You’re right, little bird, I shouldn’t hurt kids if I don’t want to.”</p>\n<p>He’s tickling the little bird’s belly lightly, just to make him giggle again, because his giggles are adorable and he needs them in his life now that he’s heard them, when Kurogiri warps in behind them. “Shigaraki, what is your plan?”</p>\n<p>“Send the others back, Kurogiri.” Tomura smiles down at the giggling child. “I’m not hurting kids.”</p>\n<p>“Are you sure, Shigaraki?”</p>\n<p>The blue haired man nods. “I’m sure, take the Nomu too, I don’t want it around the little bird, you can return.”</p>\n<p>“Of course,” the warper does as he’s told and warps their entourage away with the Nomu. “What about you?”</p>\n<p>Izuku giggles and finally catches his hand before he can tickle his belly again. “I’m staying with the little bird.”</p>\n<p align=\"center\">…</p>\n<p>The little owlet sniffles softly as he walks out of papa’s room, rubbing his bottom lightly, and rubs at his nose with the back of his hand, then his eyes with his fists, and returns to rubbing his bottom.</p>\n<p>He supposes it was deserved, he <em>did</em> ignore what papa told him to do, he knew he’d be in big trouble when they got home, but he hadn’t thought of <em>that</em>.</p>\n<p>Izuku hops down into their nest and plops himself down on the lap of the man resting inside, he supposes it’s worth it, he got a new big brother out of it, after all.</p>\n<p>“Baby bird, you better not be pouting when I join you guys in the nest.” He giggles at papa’s warning and ducks into Tomura’s arm. “That’s better.”</p>\n<p> </p>"
}