{
  "id": "30231513",
  "url": "https://archiveofourown.org/works/30231513?view_full_work=true",
  "author": [
    "dancewiththewaves (orphan_account)"
  ],
  "title": "that's it, it's split (it won't recover)",
  "rating": "Mature",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "Video Blogging RPF",
    "Minecraft (Video Game)"
  ],
  "relationships": [
    "Technoblade & TommyInnit (Video Blogging RPF)",
    "TommyInnit & Phil Watson (Video Blogging RPF)",
    "Ranboo & TommyInnit (Video Blogging RPF)"
  ],
  "characters": [
    "TommyInnit (Video Blogging RPF)",
    "Ranboo (Video Blogging RPF)",
    "Technoblade (Video Blogging RPF)",
    "Phil Watson (Video Blogging RPF)",
    "Sam | Awesamdude (Video Blogging RPF)",
    "Clay | Dream (Video Blogging RPF)"
  ],
  "additional_tags": [
    "Suicide Attempt",
    "Suicide",
    "Angst",
    "Hurt/Comfort",
    "tommy dies a lot",
    "dw he gets better",
    "he sorta gets addicted to being dead",
    "this one is sad guys",
    "Proceed with caution",
    "Hopeful Ending",
    "Bittersweet Ending"
  ],
  "language": "English",
  "series": "Part 3 of Writing 'bout block mens",
  "published": "2021-03-24",
  "completed": null,
  "words": "6,979",
  "chapters": "1/1",
  "comments": "442",
  "kudos": "10,524",
  "bookmarks": "2,298",
  "hits": "103,033",
  "summary": "<p>Tommy has always been the fighter.</p>\n<p>He has never been the fought for, and he knows it, with every whisper Tubbo directs at Ranboo, with every glance thrown his way- Tommy <em>knows</em>, the way he wishes he didn't, that they think he's dead.</p>\n<p>If they're so convinced he's still dead, maybe the one good thing left he can do for them is die.</p>\n<p>---</p>\n<p>Or, Tommy gets addicted to being dead and thinks that nobody cares about him. The people who very much do try to pull him back from the brink before Dream can't resurrect him anymore.</p>",
  "notes": "<p>I was up at 4am writing the angstiest thing I've ever put on paper. There is a trigger warning on this entire fic, guys: Tommy kills himself a lot and it's spoken about pretty openly. If that doesn't jimmy with your jams, please exit stage left and there will be Extension and Godling that are both far fluffier.</p>\n<p>Y'all have been warned.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>Uh- my hands slipped?</p>\n<p>I'm going to keep this as a one-shot for now, I might add to it some day? But for now, it's just gonna be this.</p>",
  "text": "<p>\n<span>\"...does he make you happy?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Tubbo was hanging off Ranboo's arm when Tommy had asked. Supposedly, he was only </span>\n<em>\n<span>dead </span>\n</em>\n<span>for two days. Two days. Tubbo shares a glance with Ranboo at the question, a look Tommy can't quite decipher. Two days ago, he could've.</span>\n</p>\n<p> </p>\n<p>\n<span>\"He does, he does.\" Tubbo hums uncertainly. Tommy watches the sun glint off the ring Tubbo wears around his finger- in two days, Tubbo had married Ranboo and adopted Michael, and to be quite frank, Tommy feels real replaced about it all.</span>\n</p>\n<p> </p>\n<p>\n<span>Two days- it felt like two months to Tommy. It was two days to Tubbo, but he still looks at Tommy like he's expecting to see through him. He and Ranboo walk on glass around him, toes catching the shards, trying to pretend that they don't think he's dead. If they think he's dead, does that make him dead?</span>\n</p>\n<p> </p>\n<p>\n<span>\"Good, good,\" Tommy echoes. He tugs the white strand of hair in front of his eyes absently. There is a large, gaping hole in his chest- something that feels abyssal and black and never ending. It sucks every bit of happiness Tommy has in him out, pulling it away like ice applied to a fever. \"I'm just gonna uhh- go now boys. Big man shit to do, you know how it is.\" The words sound weak, even to him.</span>\n</p>\n<p> </p>\n<p>\n<span>His hands curl around nothing but he can still feel the black sludge of the void sinking deeper into him, Wilbur's crazed ramblings heavy in his ears.</span>\n</p>\n<p> </p>\n<p>\n<span>Tubbo nods briefly, eyes already pulling away to where Michael is prancing in a field of flowers. Every so often, the zombie piglin pulls some petals up and scatters them around, squealing with excitement. Tubbo leaves to his son's side.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Take care of him, yeah?\" Tommy raises one hand. He doesn't bother making eye contact with Ranboo- before, he might've. But it wasn't worth the energy now. He traces the edges of Ranboo's frown with his eyes as the hybrid struggles to answer. Tommy knows the feeling.</span>\n</p>\n<p> </p>\n<p>\n<span>\"You'll still be around to make sure I am,\" Struggling for words often feels like drowning in air. Choking, spluttering. Tommy has torn Tubbo's bandana off his neck- it has been gone for a while, now -so Dream's handprint is still stark on his skin. He knows Ranboo is staring. \"Right?\" The question is weak and Tommy knows what Ranboo's </span>\n<em>\n<span>really</span>\n</em>\n<span> asking.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Take care of him.\" Tommy drops his hand and turns away. The white bobs in front of his eyes and he knows when Ranboo stutters, almost takes a step forward. Maybe he would have tried to help two days ago.</span>\n</p>\n<p> </p>\n<p>\n<span>But Ranboo has the backbone of a chocolate éclair, so he just goes back to his son. Back to Tubbo. Tommy doesn't bother looking over his shoulder to see if Ranboo bends down to whisper in Tubbo's ear, to express everything Tommy has not said. And </span>\n<em>\n<span>oh,</span>\n</em>\n<span> wouldn't it be a lovely dream for Tubbo to stand and shout, to take notice, to drag Tommy by the arms into Puffy's office and force him to spill. To guard Tommy's bedroom door when the nightmares come for him every night, to make sure he eats when he forgets, to wear his red bandana like a source of pride instead of the shame it has become.</span>\n</p>\n<p> </p>\n<p>\n<span>But there are no footsteps, no yells, no bruising grip on his forearms- and Tommy knows.</span>\n</p>\n<p> </p>\n<p>\n<span>He is always the fighter.</span>\n</p>\n<p> </p>\n<p>\n<span>Never the fought </span>\n<em>\n<span>for</span>\n</em>\n<span>.</span>\n</p>\n<p> </p>\n<p>\n<span>He unties the green bandana around his wrist, curls his fingers into the fabric for the last time. He lets it go and doesn't watch it drift away to settle into the dust. To Tubbo, Tommy is already dead. Gone, buried, a problem he is no longer responsible for. Tommy doesn't blame him, and by the </span>\n<em>\n<span>gods</span>\n</em>\n<span>, does he want to die.</span>\n</p>\n<p> </p>\n<p>\n<span>Maybe not die.</span>\n</p>\n<p> </p>\n<p>\n<span>Just not exist. Stop existing for enough time for all the hurt to stop. But even if he did die, would the few seconds of peace be worth it? Wilbur would come to him again, waiting for him to snap, with his cards and his chips and the mental game of russian roulette already loaded in his chamber. Dream would resurrect him and he'd go back to the cell.</span>\n</p>\n<p> </p>\n<p>\n<span>Maybe it would be worth it.</span>\n</p>\n<p> </p>\n<p>\n<span>When Tommy gets home that night, he spends hours staring at the allium preserved carefully in his hidden chest.</span>\n</p>\n<p> </p>\n<p>\n<span>When the moon has hit its peak, staring soundlessly onto their grounds, Tommy flicks a flint and steel and remembers the sound of explosives.</span>\n</p>\n<p> </p>\n<p>\n<span>Being resurrected healed his ears, apparently. There is no longer a muffle and they have not bled since.</span>\n</p>\n<p> </p>\n<p>\n<span>He throws the allium into the fire and wishes he could burn up just as prettily.</span>\n</p>\n<p> </p>\n<p>\n<span>---</span>\n</p>\n<p> </p>\n<p>\n<span>He finds himself in the Nether three days later. Ranboo had come knocking once, a smile on his lips and bread in his hands, and Tommy had entertained his presence for a few hours before it all became too much. As soon as Ranboo had left, Tommy had fled.</span>\n</p>\n<p> </p>\n<p>\n<span>The lava bubbles under his feet.</span>\n</p>\n<p> </p>\n<p>\n<span>It had always called to him when he was in exile, a sickening croon of molten rock. </span>\n<em>\n<span>How easy it would be</span>\n</em>\n<span>- it would whisper, </span>\n<em>\n<span>How amazing it would be to be free.</span>\n</em>\n<span> Tommy knows the price for listening now.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Tommy?\"</span>\n</p>\n<p> </p>\n<p>\n<span>It's Technoblade. He looks like he's doing well- has a new outfit. He matches with Philza. They look rather lame, if Tommy's being honest, all dark colours and ender motifs. Ranboo had worn a similar symbol on his cloak, but it really didn't seem important now. So they made themselves a new group- funny, how hypocritical it was. Always preaching about how government is evil, but anarchy is a type of governance, isn't it. Tommy thinks it's funny, how they force their beliefs onto others. </span>\n<em>\n<span>I'm a person too!</span>\n</em>\n<span> Technoblade had screamed, like the government wasn't made of people either.</span>\n</p>\n<p> </p>\n<p>\n<span>\"See mate, I </span>\n<em>\n<span>told</span>\n</em>\n<span> Ranboo he wasn't dead,\" Philza dismissively adjusts his bucket hat. Tommy looks back at the lava. \"Too stubborn to die.\" Philza sounds upset, now. A bubble pops. \"What are you doing here, anyway?\"</span>\n</p>\n<p> </p>\n<p>\n<span>It takes Tommy a few minutes to realize Philza's question is directed at him. He just shrugs. Another bubble pops and Tommy wonders how hot lava really would be against his skin. Maybe he should find out.</span>\n</p>\n<p> </p>\n<p>\n<span>There's a </span>\n<em>\n<span>whoop</span>\n</em>\n<span>, a pant of heavier breath, and Tommy sees purple sparkles drifting at the corner of his vision. He's not sure why Ranboo's here again, exactly, but whatever. As long as he doesn't try to talk to Tommy, then-</span>\n</p>\n<p> </p>\n<p>\n<span>\"Tommy.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Of course.</span>\n</p>\n<p> </p>\n<p>\n<span>Ranboo puts a hand on his shoulder and Tommy can feel his claws dig into his skin. Maybe those claws would be sharp enough to slit his throat if they tried hard enough. Ranboo is shaking and Tommy doesn't understand why. Perhaps he was disoriented from the temperature difference. Tommy knows Tubbo gets like that. Or, he used to. Two days ago.</span>\n</p>\n<p> </p>\n<p>\n<span>Maybe that's another thing that's changed.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Tommy, why don't we come away from the ledge?\" Ranboo is shaking harder.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Whu- Ranboo, we don't associate with </span>\n<em>\n<span>traitors</span>\n</em>\n<span>,\" Technoblade's biting drawl makes Ranboo jolt against Tommy's shoulder. The claws press in harder and Tommy wishes they would just cut down. \"Besides, it's not as if he's going to jump, or-\" Technoblade abruptly cuts himself off. Tommy can't hear Philza messing with his hat anymore.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Tommy, </span>\n<em>\n<span>please</span>\n</em>\n<span>,\" Ranboo sounds scared. Tommy doesn't really understand why. After all, Dream would wrap his strings back around his neck and pull him back, willing or otherwise. He's too </span>\n<em>\n<span>fun</span>\n</em>\n<span> to let die. \"We can- we can go pick flowers, or mine, or </span>\n<em>\n<span>something</span>\n</em>\n<span>!\" Are toys less fun if they stop fighting back?</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mate?\" Philza sounds closer.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Dream would bring me back anyway,\" Tommy traces the edge of the netherrack with his index finger. Ranboo flinches again and this time, the claws press hard enough to cut. Ranboo jolts his hand back like he's been burned, a small slice of red at the tips of his nails. \"So it doesn't matter.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"It matters,\" Ranboo whispers. Tommy meets his eyes this time- maybe if he makes him uncomfortable enough, Ranboo will do the job for him and just </span>\n<em>\n<span>push </span>\n</em>\n<span>him. \"It matters.\" He just repeats himself. Tommy thinks he sounds like a broken record, a disc spinning over and over, stuck on the same misplaced slice. Broken.</span>\n</p>\n<p> </p>\n<p>\n<span>Tommy flicks his eyes over to Philza. The man has stepped forward, wings raised like he's ready to fly into action. He looks startled, scared, sad. It's a waste of time. He wouldn't be fast enough to catch him if he chooses to fall, but somehow, when he opens his mouth and tells Philza of that fact, the man looks less </span>\n<em>\n<span>reassured </span>\n</em>\n<span>and more </span>\n<em>\n<span>terrified</span>\n</em>\n<span>. Seems Tommy can't even comfort people properly. He stares back into the lava.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Tommy,\" Ranboo is at his side, holding a hand out. It's not the bloodstained one. \"C'mon, please? For me- for Tubbo?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Tubbo thinks I'm dead.\" Tommy hums. He takes Ranboo's hand anyway and lets the enderman hybrid hoist him up. Ranboo is still shaking when he wraps an arm around Tommy's shoulders and guides him towards the path, towards where Technoblade is still staring at Tommy like he's grown a second head. Philza looks scared.</span>\n</p>\n<p> </p>\n<p>\n<span>\"But you're-\" Ranboo glances at Technoblade. \"You're not dead, you're right here.\"</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Let's be the bad guys, Tommy.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>\"Am I?\" Tommy watches another bubble pop. Ranboo shudders and holds him a little closer. How unfortunate for him, but Ranboo would learn soon enough. Misery follows Tommy like blood follows Technoblade. He'd learn and he'd leave. He's rather foolish and Tommy is sure that Tubbo has warned Ranboo, but like all the others Tommy has hurt before him, he has to get burned first.</span>\n</p>\n<p> </p>\n<p>\n<span>\"You are.\" Ranboo tries to sound confident, but his voice wavers.</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Me and you were never good for that server.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>\"Okay.\" Tommy supposes that if they're going to play the lying game, he might as well give it his all.</span>\n</p>\n<p> </p>\n<p><em><span>Everything that's gone wrong has been down to us.</span></em> <em><span>It lies at our footsteps.</span></em></p>\n<p> </p>\n<p>\n<span>The next day, when Ranboo has left, Tommy returns to the Nether.</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>I genuinely, genuinely think, that if it weren't for me and you dying, this server would be in shambles.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>He sits back down on the ledge.</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>I know- I know what I'm like. That's the issue.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>\"Isn't it always?\" Tommy whispers to the lava bubbles.</span>\n</p>\n<p> </p>\n<p>\n<b>TommyInnit tried to swim in lava.</b>\n</p>\n<p> </p>\n<p>\n<span>---</span>\n</p>\n<p> </p>\n<p>\n<span>Tommy wakes up in the prison cell. Dream is staring at him, the same mask over the same face. He tilts his head, like he's observing a particularly interesting specimen. A new facet to an old toy. Tommy wonders if he passes.</span>\n</p>\n<p> </p>\n<p>\n<span>He'd spent the time in the void asleep like Schlatt was the first go around. Wilbur had been there, again, tried to rope Tommy into more talking and card games, but he had let the words slip like water from open hands and fallen into the deepest pits of </span>\n<em>\n<span>nothing</span>\n</em>\n<span> he could.</span>\n</p>\n<p> </p>\n<p>\n<span>He closes his eyes again.</span>\n</p>\n<p> </p>\n<p>\n<span>\"You're alive, Tommy.\" Dream says.</span>\n</p>\n<p> </p>\n<p>\n<span>With a shudder, the netherite block comes up and the lava bubbles some more as the bridge is revealed. Sam is standing at the edge of it, his four hooves clipping nervously as he stares Tommy down. Ranboo is beside him and he is wringing his hands together. He has new tear scars trailing down his face. Tommy wonders why.</span>\n</p>\n<p> </p>\n<p>\n<span>\"A pity.\" Tommy mumbles. Dream stares at him and Tommy obediently meets Sam halfway to the bridge. Sam gathers him up into his arms. The centaur still smells like a mix of gunpowder and redstone dust, his trident tucked into the sheath across his back. His fur tickles Tommy's face as Sam whispers assurances, </span>\n<em>\n<span>oh god you're alive</span>\n</em>\n<span>s and </span>\n<em>\n<span>what even happened</span>\n</em>\n<span>s and one </span>\n<em>\n<span>did someone push you</span>\n</em>\n<span>-</span>\n</p>\n<p> </p>\n<p>\n<span>For it to be a canon death, it has to have meaning behind it.</span>\n</p>\n<p> </p>\n<p>\n<span>Tommy notices the moment Ranboo follows his gaze over Sam's shoulder, to where the lava is popping soothingly. Ranboo jolts again, like he's the one who's been burned. Like the lava is bad, like the lava is not a friend.</span>\n</p>\n<p> </p>\n<p>\n<span>Tommy had been dead before his mind could process the pain. It'd been quite peaceful, really. But he remembers the last time he had tried to comfort someone on that and remembers how they had reacted. For once, Tommy decides to keep his mouth shut.</span>\n</p>\n<p> </p>\n<p>\n<span>When he doesn't answer, Sam swings Tommy up onto his back like he's a small child. Tommy leans forward and lets his weight rest on Sam's back as the centaur carefully steps forward. He knows Dream is still watching his back, but every time he tries to turn his head to look back at the lava bubbles, Ranboo gets in his way.</span>\n</p>\n<p> </p>\n<p>\n<span>He tries to smile.</span>\n</p>\n<p> </p>\n<p>\n<span>Tommy knows he's lying.</span>\n</p>\n<p> </p>\n<p>\n<span>---</span>\n</p>\n<p> </p>\n<p>\n<span>\"Mate?\" It's a softer whisper this time, quieter and a little more subdued than the last time Tommy had heard it, this close to an edge. The wind whistles through his hair as he teeters over the cliff. His heels are planted in the dirt, but his toes wiggle free over open air. The fall is enough to kill him and if he could just step forward, just a bit-</span>\n</p>\n<p> </p>\n<p>\n<span>A rustle of feathers and Phil's hand is balled in his hoodie. Ranboo had given it to him- it's rather large on him and the sleeves had to be rolled four times before Tommy's hands would poke through, but Tommy likes how long it hangs anyway. He thinks that before, he would slap people with the ends. He's still sort of tempted to do it anyway.</span>\n</p>\n<p> </p>\n<p>\n<span>Tommy is pretty sure it's just Philza this time, because as subtle as Technoblade likes to think he is, Tommy can hear the jewelry jangle every time he flicks his ears from a mile away.</span>\n</p>\n<p> </p>\n<p>\n<span>He turns his head. Philza looks scared again, his eyes wide and his eyebrows furrowed so hard it almost looks painful.</span>\n</p>\n<p> </p>\n<p>\n<span>\"You had to be resurrected again,\" Philza murmurs. He manhandles Tommy into a sitting position, but places himself between Tommy and the edge of the cliff face. \"Did-did someone push you? Into the lava?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Tommy picks at the blades of grass.</span>\n</p>\n<p> </p>\n<p>\n<span>\"We can't help you if you don't tell us who it was, mate.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Hm. A dandelion.</span>\n</p>\n<p> </p>\n<p>\n<span>\"I promise we're not- well, we're not still mad. We'd help you. You know that, right?\"</span>\n</p>\n<p> </p>\n<p>\n<span>The ground rumbles under his feet. Tommy plucks the dandelion. He picked this spot for a reason, after all.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Tommy-\"</span>\n</p>\n<p> </p>\n<p>\n<span>Philza finally seems to notice that the cliff edge is crumbling under him. He goes to jump to his feet, goes to grab Tommy, but Tommy is faster.</span>\n</p>\n<p> </p>\n<p>\n<span>He's always been faster.</span>\n</p>\n<p> </p>\n<p>\n<span>He's spent much of his life fighting for his life, taking on opponents stronger than he was. Many people underestimated him, under the guise of </span>\n<em>\n<span>child</span>\n</em>\n<span>, Wilbur was the one who wielded him into their last ditch </span>\n<em>\n<span>soldier.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Tommy breaks Philza's hold and flips, carrying his momentum in his throw to send Philza flying onto safe ground. The man lands in a heap of cloth and feathers, his wings bristling-</span>\n</p>\n<p> </p>\n<p>\n<span>Tommy meets his eyes, so wide he can hardly see the blue, just in time for the cliff to finally break under his feet. Tommy falls backwards to the earth below and knows that he's already hit a terminal velocity.</span>\n</p>\n<p> </p>\n<p>\n<span>He hits the ground before Philza has even launched himself off the cliff in a last ditch attempt to catch him.</span>\n</p>\n<p> </p>\n<p>\n<span>Dying this way is a lot more painful, he thinks, as Philza cradles his bloodsoaked head and asks him to hold on.</span>\n</p>\n<p> </p>\n<p>\n<span>Hold on to what?</span>\n</p>\n<p> </p>\n<p>\n<span>Tommy drifts off.</span>\n</p>\n<p> </p>\n<p>\n<b>TommyInnit hit the ground too hard.</b>\n</p>\n<p> </p>\n<p>\n<span>---</span>\n</p>\n<p> </p>\n<p>\n<span>\"Y'know, I'm starting to think you </span>\n<em>\n<span>like </span>\n</em>\n<span>this whole 'being dead' thing,\" Dream's voice, for the third time, breaks him out of the void. Tommy can still taste the whiskey Mexican Dream had given him in the back of his throat, can still smell the cigar smoke from Wilbur's newest bad habit. Schlatt was still asleep and Tommy had wanted to join him, but in the end, Mexican Dream did enough poking for Tommy to join their card game. He lost. \"I mean, the first time, maybe not your fault. They seem to think you were pushed into the lava-\" Dream waves his hands around as he talks and Tommy thinks it's quite distracting. \"And well, you've made a lot of enemies so not too surprising there. But the second time, you </span>\n<em>\n<span>saved </span>\n</em>\n<span>Philza. From falling.\" Dream levels him with a Look and Tommy isn't quite sure how he can pull it off with the mask still on. \"A man with wings.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Tommy shrugs. He hears the telltale clicking of Sam's machines going, and he steps out of the cell, past the netherite barrier. It comes up and Dream stays on his side of the room. He stares some more.</span>\n</p>\n<p> </p>\n<p>\n<span>\"You weren't supposed to like being dead.\" He says. The blackstone drips.</span>\n</p>\n<p> </p>\n<p>\n<span>\"I don't.\" Tommy watches the lava lower, fun little pops exploding at his feet. He could tip over, could just jump now. Maybe he'd get a few more minutes of </span>\n<em>\n<span>peace</span>\n</em>\n<span> if he did.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Then why do you keep killing yourself?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Tommy shrugs again and Dream growls behind his mask. \"I like the quiet.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"The quiet? You're killing yourself for some </span>\n<em>\n<span>quiet</span>\n</em>\n<span>?\" The bridge is finally in view. Sam is standing there again, but he has three people flanking him. Tommy doesn't need to get closer to see who they are. \"Why not just- I dunno, build a house away from the main SMP then? You'd get some quiet.\" If Tommy didn't know any better, he'd say Dream almost sounds </span>\n<em>\n<span>scared.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Tommy taps his chest. He lets his eyes wash over Dream, watches as the man startles and stills at how grey they've gone. Tommy is pale, almost translucent- he can trace and count his veins. His eyes are so light they're almost gone, and he really does think it's a little funny how he looks more </span>\n<em>\n<span>alive </span>\n</em>\n<span>when he's </span>\n<em>\n<span>dead.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>\"I like the quiet.\" He repeats. The bridge is completely there again and Tommy stumbles like a newborn calf across it. He's not being careful, and he sees the moment Philza realizes it.</span>\n</p>\n<p> </p>\n<p>\n<span>The man leaves Techno, Sam, and Ranboo at the mouth of the bridge and comes to steady Tommy's arm.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Careful, mate,\" Philza says. His mouth is drawn in a tight line and his eyes are hard. Tommy wonders how many days it's been this time. \"Wouldn't want you falling.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Of course not.\" Tommy laughs but Philza does not join in. The man keeps his grip the entire way across the lava, dragging Tommy to where Sam is standing. The centaur is gripping and ungripping his trident, staring down at Tommy with something complicated swirling in his eyes. Ranboo is beside him, wringing his hands again. He has new tear marks- maybe something happened to Michael?</span>\n</p>\n<p> </p>\n<p>\n<span>\"Did something happen to Michael?\" Tommy asks and Ranboo pauses.</span>\n</p>\n<p> </p>\n<p>\n<span>\"No,\" he says. The ridges where he should have eyebrows have drawn together. \"Why do you ask?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"You have new scars under your eyes.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"...I was crying.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"I can see that,\" Tommy resists the urge to poke the scars because obviously, Ranboo is just not getting it. Philza's hold tightens as his body tenses. Tommy would love to get a read on Technoblade, but the man has his face hidden behind his boar mask, as impassive as ever. He thinks it's angry, though- angry is always a good guess when it comes to Technoblade. \"Why?\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Why? You-\" Ranboo splutters, choking on air again. \"You died!\"</span>\n</p>\n<p> </p>\n<p>\n<span>Tommy tilts his head. Ranboo breathes a little heavier, staring between Philza and Tommy. He starts wringing his hands again and tears gather in his eyes. Tommy frowns- he's going to get more scars like that.</span>\n</p>\n<p> </p>\n<p>\n<span>\"You died.\" Ranboo whispers.</span>\n</p>\n<p> </p>\n<p>\n<span>Tommy still doesn't get it, but Technoblade puts a hand on Ranboo's shoulder and the waterworks stop. He supposes that's good enough, then. Sam is silent as he unlocks all the mechanisms out of the prison, traps disengaging and finally spitting them out at the entrance. The sun is bright in Tommy's eyes, too bright, and he's about to stare directly at it to see if he'll get any kind of eye damage- it'll just get fixed when he gets resurrected again, anyway. But there's a shadow over his head, and Philza's dumb bucket hat is sliding over his forehead. Tommy peers over the brim to stare at the older man, whose wings are puffed up like he's being attacked.</span>\n</p>\n<p> </p>\n<p>\n<span>He looks stressed. Maybe he should go speak to Puffy.</span>\n</p>\n<p> </p>\n<p>\n<span>\"You're going to be living with Techno and I from now on,\" Philza says. Tommy blinks at him- how strange, that Technoblade would want him in his house. Maybe he's planning on killing him? Tommy's never been decapitated before. \"Is there anything you need from your house? Anything you want to bring with us?\"</span>\n</p>\n<p> </p>\n<p>\n<span>Tommy hums. He thinks of the shattered compass shoved into a corner, the green bandana that Ranboo had returned and that he hadn't touched, the burnt ashes of an allium still littering the floor around his bed.</span>\n</p>\n<p> </p>\n<p>\n<span>\"No.\" He says. Technoblade flings his head away like he's been stabbed, and something dark and full of grief - the same look he gets when he thinks about Wilbur - is crossing Philza's face.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Okay, that's okay mate,\" Philza mumbles. He presses a hand into Tommy's back and leads him to Carl, who is tied to a nearby post and gently grazing. The horse looks up as they approach and blows his nostrils out at Tommy. \"That's okay. You'll be okay.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Tommy absolutely would be okay if they would let him die and let him </span>\n<em>\n<span>stay </span>\n</em>\n<span>dead. He doesn't say that though, doesn't think it wise with Sam still staring holes through his shirt and Philza's hand on his back. Technoblade unties Carl and launches himself up the saddle with a grunt. His hand reaches down - maybe he'll strangle Tommy? Quite personal, Tommy has to admit - and he lifts Tommy like he weighs nothing, plopping Tommy in front of him and making Tommy lean back against his chest. Carl snorts from under him and Philza shakes out his wings.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Ranboo, you're good to teleport?\" Philza asks and Ranboo nods. His purple sparkles flash with his magic. Philza nods and turns to Technoblade and Tommy. Technoblade is warm against Tommy's back, he's always run hot like a furnace. Some days, living with Techno in exile, Tommy had wanted to curl up against the man and just bask in the warmth. He's still confused, really, but he guesses he'll take it. AliveInnit would have appreciated the opportunity. He sits still without protest, closing his eyes and letting Philza's bucket hat shift over his head.</span>\n</p>\n<p> </p>\n<p>\n<span>Sometime along the journey, Tommy falls asleep to Carl's rocking under him and Technoblade's steady chest keeping him upright.</span>\n</p>\n<p> </p>\n<p>\n<span>That night, a new tenet is written into the Syndicate's code, in Technoblade's elegant, flowing script. It is witnessed and signed by Ranboo and Philza, despite Niki's vocal objections, and Technoblade is convinced it will be enough to finally sway Puffy onto their side.</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Protect Tommy.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>---</span>\n</p>\n<p> </p>\n<p>\n<span>They are strange, here.</span>\n</p>\n<p> </p>\n<p>\n<span>Niki has her own house here and she avoids him like the plague. Tommy isn't sure why, he's not been eating much and he has no weapons. She could kill him anytime she wants, she's just hesitating. He's not sure why she's hesitating when she was so eager before.</span>\n</p>\n<p> </p>\n<p>\n<span>Maybe it's a Dream-ism. Maybe she only likes toys that fight back.</span>\n</p>\n<p> </p>\n<p>\n<span>It is Technoblade and Philza that confuse him the most. Ranboo, at least, he is used to being strange. But the others?</span>\n</p>\n<p> </p>\n<p>\n<span>Philza routinely wakes him up every morning. Gently shakes him awake and offers breakfast, even if Tommy doesn't eat it. He makes Tommy go outside every day, even if he just sits on the ground, and he puts locks on all the drawers with knives. Tommy can pick locks though, so he's not really sure why Philza bothers with that. He even has his own bedroom, here, but it is right across the hall from Technoblade's and Tommy at least understands </span>\n<em>\n<span>that </span>\n</em>\n<span>decision. Any move Tommy makes, Technoblade will hear. They don't trust him and Tommy knows why. He betrayed them, after all. Maybe he would go after them in their sleep, just to see if Technoblade would finally wet the blade of his axe on Tommy's neck, but that would take so much energy. Even with Philza's prodding, Tommy doesn't have the energy to get up most days. Sometimes Philza even has to carry him downstairs.</span>\n</p>\n<p> </p>\n<p>\n<span>Technoblade is even stranger.</span>\n</p>\n<p> </p>\n<p>\n<span>If Philza is the mark of Tommy's mornings, Technoblade is the mark of his evenings. Technoblade makes dinner. It's usually potatoes, but all food Tommy eats tastes like ash. He'd stopped eating after seeing how aggravated it had made Technoblade, but instead of snapping and killing him like he </span>\n<em>\n<span>wanted</span>\n</em>\n<span>, Technoblade had just switched to honest begging. It wigged Tommy out so badly that even if he skips breakfast and lunch, he always eats dinner. After dinner, Technoblade takes the plates and washes them. Tommy tries to help and Technoblade will gruffly tell him to sit down. Then, Tommy will get dragged over to the fireplace and Technoblade will spend the next forty-five minutes brushing and braiding Tommy's hair. It's not very long, just enough to pull into a puffy ponytail, but Technoblade braids small little pieces and hides them in the rest of his hair. He never touches the white- it has grown, from when Tommy woke up the first time in the prison. It used to be a few strands, it grew to a piece. It is now an entire chunk of hair, hanging over his left eye. Blindingly white, a reminder of how many times Tommy has cheated death.</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Cheated</span>\n</em>\n<span>, Tommy huffs a small laugh as Technoblade's fingers card through his hair. </span>\n<em>\n<span>As though I had wanted to be alive.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>After the hair brushing session, Technoblade forces Tommy to bed. Hovers, fluffs his pillows, tucks his blankets in, and then settles into a rocking chair beside Tommy's bed and pulls out a book of Greek mythology. AliveInnit would have mocked Technoblade for getting old, for having a rocking chair, for how his glasses are held together by nothing but tape. He would have fought the coddling, even if he was ill. Tommy just sits there and lets it happen, and he sees Technoblade's mood dampen every time Tommy does not rake him over the coals. Every night, Technoblade reads him a story from the book.</span>\n</p>\n<p> </p>\n<p>\n<span>It is never about Theseus.</span>\n</p>\n<p> </p>\n<p>\n<span>---</span>\n</p>\n<p> </p>\n<p>\n<span>“Tommy!”</span>\n</p>\n<p> </p>\n<p>\n<span>It’s Niki. He’d really thought he hadn’t been spotted when he left the house, but he supposes that it only makes sense that she had followed him. Had probably been told to, to make sure he wasn’t gathering weapons. Tommy doesn’t think he could do so anyway, it would take so much effort.</span>\n</p>\n<p> </p>\n<p>\n<span>“Creeper!” Niki is flinging herself towards him when she realizes he’s not moving and he can see the blonde roots peeking out from the pink dye. He wonders when she’d dyed it, but he thinks it’s a good colour on her. A hiss, he can smell the gunpowder, and he doesn’t even bother turning his head to see the creeper flash white as smoke wafts off its body in warning. A warning Tommy does not heed, and it goes off.</span>\n</p>\n<p> </p>\n<p>\n<span>He comes to a few moments later, ringing hard in his ears, as he lays prone in the snow. Niki is crying- how strange, Tommy was pretty sure that she wanted him dead. Is she just upset she didn’t get the chance to kill him? Maybe, when Dream brings him back, she’ll have another shot. Her mouth is open, her throat is working, it looks like she’s yelling something, but the explosion has killed Tommy’s hearing, and he can’t make the words she’s shouting out.</span>\n</p>\n<p> </p>\n<p>\n<span>This is much more painful, Tommy thinks, even compared to falling off the cliff. At least that time, he’d hit his head hard enough that it was all fuzzy, and he’d gotten to drift off in Philza’s arms. A mimic of the comfort Tommy does not deserve. The explosions remind him of things, of being alone on the beach with TnT planted in the ground - </span>\n<em>\n<span>put your things in the hole, Tommy </span>\n</em>\n<span>- but it takes too much energy to try and bring them up.</span>\n</p>\n<p> </p>\n<p>\n<span>He knows he’s injured. Technoblade is suddenly in front of him, mask missing and his hair unbraided. He kneels in the snow, digging through the bag at his side, and he’s bringing out healing potion after healing potion with shaking fingers. Tommy doesn’t understand why. He’s too far gone, they won’t do anything, and even then- healing Tommy would just be a waste of time, wouldn’t it?</span>\n</p>\n<p> </p>\n<p>\n<span>He thinks his arm has been broken from where he landed after the explosion, but he still struggles to raise it. Technoblade and Niki freeze as he touches her hair with shaking fingers. Tommy opens his mouth and tries to tell her that he likes the colour, but he can’t hear himself, he’s not sure if he got the words out right.</span>\n</p>\n<p> </p>\n<p>\n<span>Niki is crying harder.</span>\n</p>\n<p> </p>\n<p>\n<b>TommyInnit was blown up by creeper.</b>\n</p>\n<p> </p>\n<p>\n<span>---</span>\n</p>\n<p> </p>\n<p>\n<span>“-can’t keep doing this,” there’s a hand in his hair this time. “He </span>\n<em>\n<span>wants</span>\n</em>\n<span> to be dead, too many more times of this and his soul is going to be so stuck to the afterlife that there’s nothing I can do.”</span>\n</p>\n<p> </p>\n<p>\n<span>Tommy’s cheek is pressed to the blackstone and he can feel the lava at his back. It’s warm in the way that the void never is, warm like Wilbur’s hug wasn’t. He’d been greeted, that time, stepping into the void. Schlatt was still asleep, but Mexican Dream was markedly quiet and he’d left Tommy alone with Wilbur. Wilbur had asked him what he thought he was doing, and Tommy had just tipped his head back and slept in his brother’s arms.</span>\n</p>\n<p> </p>\n<p>\n<span>“He wants to be dead,” oh, that one sounded like Technoblade. What was he doing here? His voice sounds shaky, as shaky as Technoblade ever got. If Tommy didn’t know any better, he would have thought it almost sounded scared. But Technoblade didn’t get- oh, maybe he wanted his own turn at Tommy? It was soothing, at least, to know that there was a limit to how many times Dream could bring him back. He could make sure everyone who wanted one would get a turn, and then he could finally go back. Be at </span>\n<em>\n<span>peace</span>\n</em>\n<span>. Tommy felt dead enough already, the black hole in his chest somehow getting larger. He felt so numb, so unbearably numb. “How many more times can he be resurrected?”</span>\n</p>\n<p> </p>\n<p>\n<span>The hand paused in his hair. It was familiar, of course- in days during exile when Tommy was being particularly good, Dream would sit with him and pet his hair just like this. Absently, Tommy wonders how big the white patch grew while he was dead.</span>\n</p>\n<p> </p>\n<p>\n<span>“...two, </span>\n<em>\n<span>maybe </span>\n</em>\n<span>three times.” Dream finally says. Only two? That would give Niki and Technoblade their vengeance. If he lasted for three, maybe he could have Jack kill him. Or he could go back to the lava- dying to the lava was by far the most pleasant thus far.</span>\n</p>\n<p> </p>\n<p>\n<span>“I hate to say it,” oh, Sam’s here too. “But if this happens again, I think we’re going to have to lock him up in the Vault. I’ll build a separate cell-”</span>\n</p>\n<p> </p>\n<p>\n<span>“We aren’t locking him up for being </span>\n<em>\n<span>suicidal,</span>\n</em>\n<span> Sam!” Philza sounds angry. Tommy shifts on the blackstone and Dream’s hand brushes through his bangs to check if he’s awake. Tommy keeps his breaths even and steady, trying to fake it even if he knows the consequences for lying to Dream. Dream’s taken so many of his lives - it’s quite funny, really - what was one more?</span>\n</p>\n<p> </p>\n<p>\n<span>“Do you have a better idea? We might lose him </span>\n<em>\n<span>forever</span>\n</em>\n<span> if we don’t!” Sam argues back just as hotly. “I can make the cell with padded walls, keep the barrier up between him and the lava. It’ll be more like a </span>\n<em>\n<span>room</span>\n</em>\n<span> than a </span>\n<em>\n<span>cell</span>\n</em>\n<span>, but we can keep constant surveillance and make sure he doesn’t try to hurt himself.”</span>\n</p>\n<p> </p>\n<p>\n<span>“I don’t like this any more than you do, Phil,” Ranboo’s here again? Tommy’s not sure it’s a great idea to leave Ranboo in here with Dream- but he has more important things to eavesdrop on. He’s sure he could goad any visitors into finishing the job when he dies again - Dream always said he was far too annoying, he knows he’s capable of at least this - and then he could finally rest. Forever. “But Sam’s right- we wouldn’t have another choice. He can make it… harm proof.” Ranboo just sounds sad again and Tommy twitches.</span>\n</p>\n<p> </p>\n<p>\n<span>“He’s awake.” Dream’s voice is dry and sharp, likely picking up on Tommy’s change in breathing pattern. He opens in his eyes. He’s on the floor, like he thought, and the netherite barrier is up, leaving him and Dream stuck in the cell. The machines whirl and Sam twirls his trident, shoving the expertly sharpened blades under Dream’s chin. The man puts his hands up and Tommy almost misses the hand in his hair. But he supposes that when he dies, he can have Wilbur pet him as much as he wants, so he supposes it doesn’t matter much. </span>\n</p>\n<p> </p>\n<p>\n<span>The netherite barrier comes down and Sam flicks his eyes at Tommy. He doesn’t think he has the strength to get up - his arms feel like jello - so he’s rather relieved when someone else pulls him up. He’s tucked between a sharp jawline and a furry cape, and Tommy blinks at Technoblade holding him so gently. He would have thought that-</span>\n</p>\n<p> </p>\n<p>\n<span>He almost expected those hands to wrap around his throat.</span>\n</p>\n<p> </p>\n<p>\n<span>“Up we go,” Technoblade murmurs. Tommy can feel the rumbles from the hybrid’s throat as Technoblade turns on his heel, cape swirling behind them as he starts walking back across the lava bridge. The machines whirl again as Tommy assumes the barrier is brought back up, and he makes quick eye contact with Philza. Ranboo is beside him, tail flicking in aggravation. “How are you feeling?”</span>\n</p>\n<p> </p>\n<p>\n<span>Tommy doesn’t know why Technoblade’s asking how he’s feeling. Why does he care?</span>\n</p>\n<p> </p>\n<p>\n<span>“He cares, Tommy. We all care,” Ranboo, the stupid face-reading bastard is stepping forwards, gently laying a clawed hand on Tommy’s cheek. He doesn’t have the energy to turn his head and look back up at Ranboo, but the hybrid tilts his chin so he can see the sincerity in Ranboo’s eyes. Technoblade stutters when Ranboo speaks, a pause, like he hadn’t expected it. It’s a lie. It has to be- nobody cares about Tommy beyond wanting him </span>\n<em>\n<span>gone</span>\n</em>\n<span>. “We don’t want you dead. </span>\n<em>\n<span>Nobody</span>\n</em>\n<span> wants you dead, we want you alive-” Ranboo’s crying again. Tommy tries to reach a hand out, tries to wipe the tears away before they burn more scars down Ranboo’s cheeks, but his muscles fail him and his arm falls before he can get there. Ranboo cries harder and there’s a terrible sizzling as the tears fall down his cheeks. “We want you alive and smiling and laughing- </span>\n<em>\n<span>I</span>\n</em>\n<span> want you to be playing pranks and pissing people off, and not doing this,” Ranboo takes both his hands, staring at him with desperation. The numbness threatens to overwhelm him. “</span>\n<em>\n<span>Please</span>\n</em>\n<span>, Tommy.” Ranboo is far too good to beg. Tommy tries to tell him, but his eyes are drifting closed before he can put the words together.</span>\n</p>\n<p> </p>\n<p>\n<span>Tears drip onto his face- he didn’t think Ranboo was that close to him-</span>\n</p>\n<p> </p>\n<p>\n<span>“</span>\n<em>\n<span>Fuck.</span>\n</em>\n<span>” Technoblade says, He sounds so choked up, like he’s-</span>\n</p>\n<p> </p>\n<p>\n<span>Technoblade’s tears hit Tommy’s cheeks and roll down his jaw, like the man is crying because Tommy can’t. </span>\n<em>\n<span>Oh</span>\n</em>\n<span>, Tommy thinks. </span>\n<em>\n<span>Oh.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Maybe he can make an effort to stay away from lava pools.</span>\n</p>\n<p> </p>\n<p>\n<span>“We love you, mate,” Philza kisses his forehead as he goes off to sleep- a real sleep, not the sleep that’s filled with Wilbur and nothing but black emptiness. Sometimes Tommy thinks a piece of the void got caught in his ribcage, eating away at his emotions until there was nothing left. “We do.”</span>\n</p>\n<p> </p>\n<p>\n<span>Maybe he can stay away from cliffs, too.</span>\n</p>\n<p> </p>\n<p>\n<span>---</span>\n</p>\n<p> </p>\n<p>\n<span>“I’m sorry, Tommy.” Niki is sitting across Techno’s table from him. His feet don’t quite touch the floor, so he dangles them, kicks them absently against the wood. There is a hot chocolate in his hands, too much whip cream at the top. Phil had insisted on it, said his hot chocolate wasn’t complete without it. Niki has some tea, something fruity and herbal that Tommy hadn’t been listening to when she’d asked for it.</span>\n</p>\n<p> </p>\n<p>\n<span>“For what?” Tommy tilts his head and licks the whip cream moustache off his top lip.</span>\n</p>\n<p> </p>\n<p>\n<span>“For trying to kill you.” Niki levels him with a careful look, tapping her fingers against her mug. There’s steam rising from the top, and Tommy thinks she might burn her hands if she keeps them there. Techno is puttering around the kitchen, trying to pretend that he’s busy so that he can listen in. They’ve been very vigilant since Tommy has come back from the prison for the- Tommy can’t remember how many times he’s died. He’s lost count. There’s an alarm on all the windows and doors now, and Phil had sat him down when he woke up from his first sleep and given him a new list of rules. Tommy is not allowed to have sharp things or rope. Tommy is not allowed outside without someone with him. Tommy is not allowed to lock the door in the bathroom. Unspoken, Tommy is not allowed </span>\n<em>\n<span>anywhere </span>\n</em>\n<span>without someone with him: but he’s mostly just being stalked, it isn’t an official rule. Techno is a constant, hovering presence behind him. He still reads him stories every night, and sometimes when the nightmares get loud, Tommy will find Techno outside his door in the morning, sword and shield in hand. A silent guardian, keeping his room safe.</span>\n</p>\n<p> </p>\n<p>\n<span>Tommy has less nightmares now.</span>\n</p>\n<p> </p>\n<p>\n<span>“I want to die, you’d really be doing a favour.” Tommy waves his hand dismissively and represses a sigh when Niki flinches. She is staring at him again, in the weird look that Ranboo gets sometimes: a mix of horror and apprehension, of grief and undying sadness. Tommy doesn’t quite understand why he gets that look so often, but Ranboo tells him every day that it’s because they all love him and they want him to stay alive. He knows that if he tries to argue, Ranboo just gets really sad and really fast, so Tommy keeps his arguments to a minimum when Ranboo comes around.</span>\n</p>\n<p> </p>\n<p>\n<span>“No, no I wouldn’t,” Niki sighs and drops her gaze down to her tea. Techno isn’t even </span>\n<em>\n<span>pretending</span>\n</em>\n<span> to be busy anymore, he’s just hovering in the doorway and staring at them. “I blamed all of my problems on you. I was so angry- I just wanted someone to take it out on, and for some reason, I picked </span>\n<em>\n<span>you</span>\n</em>\n<span>. I never considered that-” Niki is crying. Tommy doesn’t like it when she cries. “I never considered that you had lost </span>\n<em>\n<span>just as much</span>\n</em>\n<span>, more, than I did.” Niki puts her hand on top of the one Tommy has laid on the table. She squeezes it gently as she stares at him. She’s redyed her hair and Tommy can’t see the blonde roots anymore. “Please don’t go.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Okay.” Tommy says back. She relaxes, but she keeps her hand there. Tommy drinks his hot chocolate as Techno brings a chair up behind him, a brush in his hands. Tommy leans back at his prompting, letting Techno softly twirl small pieces of hair into little braids. The entire front of Tommy’s hair is white now.</span>\n</p>\n<p> </p>\n<p>\n<span>Maybe he can make an effort to stay away from creepers.</span>\n</p>\n<p> </p>\n<p>\n<span>---</span>\n</p>\n<p> </p>\n<p>\n<span>Tommy watches the sunset with Techno’s arm wrapped around his shoulders. They have Cat playing in the jukebox- after much prodding, Ranboo had finally gotten Tommy to admit he missed the disc, and he had quickly brought all of Tommy’s belongings back to Techno’s house.</span>\n</p>\n<p> </p>\n<p>\n<span>He supposes it’s his house too, now. He’d tried to argue his way into going back, by himself, but Techno had locked the front door and added a new rule to Tommy’s List of Rules: </span>\n<em>\n<span>no moving out</span>\n</em>\n<span>. Phil had smacked Techno upside the head for that one and had been about to explain to Tommy that yes, they wanted him around and no, he wasn’t a burden: when Tommy had laughed for the first time since he’d died. Phil and Techno had stared at him like he’d grown another head, but they’d joined in soon enough. That night, Techno got Tommy to help him set up a glitter bomb in Phil’s sock drawer.</span>\n</p>\n<p> </p>\n<p>\n<span>The sunset really is pretty tonight.</span>\n</p>\n<p> </p>\n<p>\n<span>Tommy doesn’t like to speak much anymore, but the others don’t mind. Techno is teaching him sign for the days his mouth feels glued shut. Tommy hums Cat’s melody and leans against Techno’s arm. Some days, he is still sure that they all still want him dead; they just want the moment to feel </span>\n<em>\n<span>better</span>\n</em>\n<span> if Tommy hurts more when he goes, but-</span>\n</p>\n<p> </p>\n<p>\n<span>Techno is steady beside him and he’s wearing one of Phil’s many long coats. Ranboo and Tubbo are pressed against his legs, one of Tommy’s hands in Tubbo’s hair. Tubbo is wearing the red bandana.</span>\n</p>\n<p> </p>\n<p>\n<span>The birds chirp, and Tommy feels a little less numb.</span>\n</p>"
}