{
  "id": "30246252",
  "url": "https://archiveofourown.org/works/30246252?view_full_work=true",
  "author": [
    "BelleAmant"
  ],
  "title": "Same Raid, Different Stakes",
  "rating": "Not Rated",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [],
  "fandoms": [
    "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
  ],
  "relationships": [
    "Aizawa Shouta | Eraserhead & Midoriya Izuku",
    "Midoriya Izuku & Sasaki Mirai | Sir Nighteye",
    "Midoriya Izuku & Toogata Mirio",
    "Class 1-A & Midoriya Izuku"
  ],
  "characters": [
    "Aizawa Shouta | Eraserhead",
    "Midoriya Izuku",
    "Sasaki Mirai | Sir Nighteye",
    "Toogata Mirio",
    "Takagi Ken | Rock Lock",
    "Toyomitsu Taishirou | Fat Gum",
    "Amajiki Tamaki",
    "Hadou Nejire",
    "Kirishima Eijirou",
    "Uraraka Ochako",
    "Asui Tsuyu",
    "Class 1-A (My Hero Academia)"
  ],
  "additional_tags": [
    "Personality Swap AU",
    "Actor Midoriya Izuku",
    "Alternate Universe - Canon Divergence",
    "(I probably needed that tag by now)",
    "The raid but like",
    "on the reverse of Trigger",
    "Sasaki Mirai isn't a Complete Jackass",
    "no beta we die like",
    "Well - Freeform",
    "not sir nighteye i guess",
    "is that a spoiler???",
    "only if you havent read Deck the Halls",
    "ok ill shut up here's the fic",
    "oh but wait",
    "we always need",
    "Parental Aizawa Shouta | Eraserhead",
    "and",
    "BAMF Midoriya Izuku"
  ],
  "language": "English",
  "series": "Part 19 of Personality Swap AU",
  "published": "2021-03-24",
  "completed": null,
  "words": "5,610",
  "chapters": "1/1",
  "comments": "347",
  "kudos": "12,648",
  "bookmarks": "497",
  "hits": "106,951",
  "summary": "<p>It's time for a raid.<br>A really, really anticlimactic raid.<br>But hey! We get Mirai redemption, and some acting.</p>",
  "notes": "<p>If the summary sucks, sorry. I'm in chem right now and I can't let my teacher know I'm ignoring the lecture to write fanfiction.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>What did you think? Leave thoughts, comments, and suggestions for the future!<br>Until next time! &lt;3</p>",
  "text": "<p>\n<span>It's on a normal Tuesday afternoon that the story known best as life progresses onwards, Shouta Aizawa calling for Izuku Midoriya to stay behind in a way that's </span>\n<em>\n<span>far</span>\n</em>\n<span> too familiar for the liking of class 1-A, leading to the rest of the students' quick departure from the room, fearful of whatever chaos will ensue.</span>\n</p>\n<p>\n<span>But chaos will not ensue, because Aizawa has not called Midoriya back to talk about a new assignment.</span>\n</p>\n<p>\n<span>Or, rather, not a personality swapping one.</span>\n</p>\n<p>\n<span>\"I've been requested to help on a case,\" Aizawa states, hopping straight to the point of the discussion, leaving no room for error or forgotten details. \"Normally, I'd bring you along automatically, but this case works heavily with Sir Nighteye and his agency. Considering your encounter with him, I wanted to ask: do you want to work on the case with me, or stay away?\"</span>\n</p>\n<p>\n<span>And for some, this might have been a question to ponder for some time. For others, the answer may have clearly been to stay away, unwilling and unwanting to work with someone who had tried to tell them to give up their </span>\n<em>\n<span>Quirk</span>\n</em>\n<span> to another student, as if it was </span>\n<em>\n<span>okay</span>\n</em>\n<span> to demand that someone give up an entire part of themselves just like that.</span>\n</p>\n<p>\n<span>But Midoriya is not like some, and he is also not like the others. No, he is simply Midoriya, for all that nothing about him is simple, and his goal in life is clear- to help as many people as possible as best as he can, and to do so with a smile.</span>\n</p>\n<p>\n<span>And if that means working with Sir Nighteye? </span>\n</p>\n<p>\n<span>So be it.</span>\n</p>\n<p>\n<span>(Besides, Aizawa has made it plenty clear to Midoriya, that the man’s words are nothing to be worried over.)</span>\n</p>\n<p>\n<span>\"I'll join you!\" Midoriya says, and Aizawa nods, unsurprised by the response.</span>\n</p>\n<p>\n<span>\"Alright. Let me know if you need to back out- I won't hold it against you.\" Not when Midoriya is so young, still, just a boy who has been hurt far too many times for Aizawa to feel comfortable not giving his kid an out, should he need it. \"But if that's your decision, grab your things, and we'll head out.\"</span>\n</p>\n<p>\n<span>Midoriya nods, turning around and grabbing his backpack before looking back up to Aizawa, who pauses for a moment before deciding, \"Grab your notebooks, too.\"</span>\n</p>\n<p>\n<span>Midoriya does, and then they're off.</span>\n</p>\n<p>\n<span>And the day truly begins, on a simple Tuesday afternoon.</span>\n</p>\n<p>\n<span>-----</span>\n</p>\n<p>\n<span>When Mirai Sasaki saw the members of the Shie Hassaikai out and about at a much more frequent rate than usual, he knew that something was amiss.</span>\n</p>\n<p>\n<span>They were usually more cautious, he knows. The Yakuza group is known for its stealth, for its abilities to hide in the shadows and pull their strings from there. So to see multiple of them at the sight tome, spotted in several differing locations throughout the city?</span>\n</p>\n<p>\n<span>Mirai knows that something must be wrong.</span>\n</p>\n<p>\n<span>And when Mirai manages to bump into one of those members, getting the chance to activate his Quirk and see where he will go?</span>\n</p>\n<p>\n<span>Well, like a proper businessman, Mirai sets up a meeting.</span>\n</p>\n<p>\n<span>It's not hard, knowing who to request. Fat Gum and his mentees have had a run in with some members, and Fat Gum claimed to have new information, so they'll be useful. Ryukyu and her interns have also had a run in with some members, so they may have some insight. Other heroes, such as Rock Lock, have also been working on the Shie Hassaikai case, so it makes no sense to do anything but include them- more manpower is never a downside.</span>\n</p>\n<p>\n<span>Then there are those who Mirai requests, knowing just how invaluable they could be for the case. The police, for the sake of legalities and obtaining a search warrant, and Eraserhead, for his Erasure Quirk that will no doubt help in the fight against Overhaul.</span>\n</p>\n<p>\n<span>Yes, Mirai knows exactly who he requests, and who will come. All of the pieces are played out just as he set them.</span>\n</p>\n<p>\n<span>And then Izuku Midoriya comes in by Eraserhead's side, shuffling the puzzle into a mess once more.</span>\n</p>\n<p>\n<span>Which doesn't quite make sense. Midoriya is </span>\n<em>\n<span>Miruko's</span>\n</em>\n<span> intern, is he not? Mirai has seen the video, he remembers it well. Eraserhead is Midoriya’s teacher, Mirai is certain of that, but that is not a reason for Midoriya to have tagged along.</span>\n</p>\n<p>\n<span>But the other first years seem less surprised by his arrival, and neither do the third years. No, they are simply excited.</span>\n</p>\n<p>\n<span>\"Midoriya!\" The red-haired boy, Kirishima cheers, already racing over to the boy's side. \"You're here, too?\"</span>\n</p>\n<p>\n<span>\"Of course he is!\" The gravity wielding girl, Uraraka chides, also approaching Midoriya. \"Aizawa wouldn't just leave Deku!\"</span>\n</p>\n<p>\n<span>The final first year, Asui, just sighs, stating, \"Well, now we're definitely going to fight a villain if Midoriya is here.\"</span>\n</p>\n<p>\n<span>\"Hey!\" Midoriya starts to protest, but then Eraserhead cuts him off, saying, \"We ran into two villains on the way here because you 'thought you heard something', Problem Child. Asui is likely correct in her assumption.\"</span>\n</p>\n<p>\n<span>\"Hey!\" Midoriya cries out again, face red. \"It's true, but you shouldn't </span>\n<em>\n<span>say</span>\n</em>\n<span> it.\"</span>\n</p>\n<p>\n<span>\"My apologies,\" Eraserhead deadpans. \"I'll have Mic scream it through the city next time.\"</span>\n</p>\n<p>\n<span>The boy sputters, saying something that sounds like, \"Why is that your go-to reaction?!\", but Mirai cannot be sure.</span>\n</p>\n<p>\n<span>He can, however, see the clear bond between Eraserhead and Midoriya, and he cannot help but wonder if his assumption about Midoriya working with Miruko being just that- an assumption.</span>\n</p>\n<p>\n<span>But then Mirio heads over to Midoriya, and he is willing to ask what Mirai wants an answer to, smiling as he says, \"Midoriya! I didn't think I'd get to work with you, but I guess life has other plans! You're interning under Aizawa?\"</span>\n</p>\n<p>\n<span>\"Yeah!\" Midoriya responds. \"It's been fun so far!\"</span>\n</p>\n<p>\n<span>Midoriya misses the horrified looks that Mirio's friends, Hado and Amajiki, give, but Mirai does not, and a part of him wants to question if Mirio was correct in his statement not long ago, his claim that Midoriya truly </span>\n<em>\n<span>is</span>\n</em>\n<span> Eraserhead's favorite.</span>\n</p>\n<p>\n<span>But there is stuff to be done, and so Mirai shoves his own opinions and thoughts out of his mind. Now is the time for facts.</span>\n</p>\n<p>\n<span>There is a raid to plan.</span>\n</p>\n<p>\n<span>-----</span>\n</p>\n<p>\n<span>The room quiets the moment that Mirai Sasaki stands, one hand raised as if calling for attention. He gets it, but any satisfaction this may bring him is unapparent, unshown by his expression.</span>\n</p>\n<p>\n<span>\"Good afternoon,\" Sasaki greets. \"All of you are here today because you have either been involved in the case revolving around the Yakuza group known as the Shie Hassaikai, or have been requested to join for our upcoming mission.\"</span>\n</p>\n<p>\n<span>\"As most of you are probably aware, the Shie Hassaikai has been out and about much more frequently than usual these last few days. Sightings have gone up from once every week or so to multiple times a day, in different parts of the city simultaneously. The reason for this change is not yet known, but the best assumptions are that they are looking for new material, new men, or a new place to hide.\"</span>\n</p>\n<p>\n<span>A map shows up on the wall behind Sasaki, red dots marking where the members have been spotted. There doesn't appear to be any rhyme or reason to it, other than, perhaps, covering as much ground as humanly possible.</span>\n</p>\n<p>\n<span>\"The only one we have not seen,\" Sasaki starts, and here the man clicks on a remote, showing the masked face of the leader of the Shie Hassaikai, \"is Kai Chisaki, best known as Overhaul.\"</span>\n</p>\n<p>\n<span>There is silence, the room simply staring at the man's face, taking him in.</span>\n</p>\n<p>\n<span>And then there is a snort, and a soft, confused, \"What?\"</span>\n</p>\n<p>\n<span>Heads turn, focusing on the source of the noises, centering on two people. Shouta Aizawa and Izuku Midoriya stare at the picture, then look at one another.</span>\n</p>\n<p>\n<span>\"I- that was a </span>\n<em>\n<span>Yakuza boss</span>\n</em>\n<span>?\" Midoriya asks, voice raising with every word, and Aizawa snorts again.</span>\n</p>\n<p>\n<span>\"That sounds about right for you, Problem Child.\"</span>\n</p>\n<p>\n<span>\"Yakuza bosses- his kid- she- she wasn't his </span>\n<em>\n<span>kid</span>\n</em>\n<span> oh kami I'm going to find him and-\"</span>\n</p>\n<p>\n<span>\"No,\" Aizawa cuts in. \"That's illegal.\"</span>\n</p>\n<p>\n<span>\"Is it, though?\"</span>\n</p>\n<p>\n<span>\"Yes.\"</span>\n</p>\n<p>\n<span>\"Nedzu will probably back me up.\"</span>\n</p>\n<p>\n<span>Sasaki blinks at the response; Aizawa simply sighs. \"Nedzu would back you up on total world domination if you asked him to. You're </span>\n<em>\n<span>not</span>\n</em>\n<span> beating him up </span>\n<em>\n<span>again</span>\n</em>\n<span>, Problem Child.\"</span>\n</p>\n<p>\n<span>\"Is something the matter?\" Sasaki finally asks, cutting in, and Aizawa grins, more than willing to show his amusement.</span>\n</p>\n<p>\n<span>\"No, nothing. But you should know Overhaul won't be a problem anymore.\"</span>\n</p>\n<p>\n<span>\"And why is that?\" Sasaki asks, and that grin only widens.</span>\n</p>\n<p>\n<span>\"Midoriya and I took him down last week.\"</span>\n</p>\n<p>\n<span>Silence fills the room once more, as all of the inhabitants of the room process what the Erasure hero has just informed them of.</span>\n</p>\n<p>\n<span>And then, there is chaos, voices overlapping quickly.</span>\n</p>\n<p>\n<span>\"You two took down a </span>\n<em>\n<span>Yakuza boss</span>\n</em>\n<span>?\" Togata asks.</span>\n</p>\n<p>\n<span>\"Deku! That's so cool!\" Uraraka cheers.</span>\n</p>\n<p>\n<span>\"So manly!\" Kirishima cries, and Asui nods along, her normally blank face looking impressed for once.</span>\n</p>\n<p>\n<span>\"Your intern assisted you with a capture like that?\" Fat Gum asks, then whistles. \"Good job, guys!\"</span>\n</p>\n<p>\n<span>\"Oh, he didn't assist me,\" Aizawa says, grin turning into what one may call that of a shit-eating variety, especially as Midoriya’s face begins to darken, turning scarlet. \"As the reports will show, it was Provisional Hero Deku who took down Overhaul. </span>\n<em>\n<span>I</span>\n</em>\n<span> was the assistant.\"</span>\n</p>\n<p>\n<span>The silence is almost deafening, but it's short, quick and to the point before Rock Lock cuts in.</span>\n</p>\n<p>\n<span>\"You mean to tell me,\" the man starts, looking at Midoriya with a skeptical gaze, \"that </span>\n<em>\n<span>that</span>\n</em>\n<span> kid, that tiny little first year, took down a villain as strong as </span>\n<em>\n<span>Overhaul</span>\n</em>\n<span>?\" He snorts, shaking his head. \"I'm sorry, I just have my doubts. How'd the story </span>\n<em>\n<span>really</span>\n</em>\n<span> go?\"</span>\n</p>\n<p>\n<span>Midoriya blinks, looking at Aizawa, who motions for him to explain. Face still somewhat red, Midoriya recounts the experience. \"Aizawa-sensei and I were on a patrol, when a little girl ran into me. She showed signs of abuse, and when a man in a bird mask came to retrieve her, she asked me not to let her go back. I wasn't going to, of course! Then Aizawa warned me that the man was a villain, so I took him down after handing Eri off to him.\"</span>\n</p>\n<p>\n<span>\"Eri?\" Sasaki asks, and Midoriya nods.</span>\n</p>\n<p>\n<span>\"The girl.\"</span>\n</p>\n<p>\n<span>\"Alright, say we believe you,\" Rock Lock says, rolling his eyes. \"How'd you manage to touch him and not die? Did you even know how to deal with his Quirk?\"</span>\n</p>\n<p>\n<span>\"Why would I deal with his Quirk?\" Midoriya asks. \"My mentor is </span>\n<em>\n<span>Eraserhead</span>\n</em>\n<span>.\"</span>\n</p>\n<p>\n<span>\"But you can't possibly have avoided his sights </span>\n<em>\n<span>and</span>\n</em>\n<span> taken down a Quirk-erased Overhaul,\" Sasaki realizes, and Midoriya nods.</span>\n</p>\n<p>\n<span>\"I didn't!\"</span>\n</p>\n<p>\n<span>\"The only Quirk used was mine,\" Aizawa says, looking quite content with the shock everyone else is showing. \"Midoriya took Overhaul down completely Quirkless.\"</span>\n</p>\n<p>\n<span>Rock Lock sits down, surprised. He doesn't say anything else.</span>\n</p>\n<p>\n<span>Fat Gum does, however, asking, \"You said he had a daughter?\"</span>\n</p>\n<p>\n<span>\"She's not actually his daughter,\" Midoriya bites out. \"She's a young girl with an untrained Quirk, we've been calling it Rewind. It seems to rewind things to their previous molecular state- why are you pale?\"</span>\n</p>\n<p>\n<span>\"The Quirk bullets,\" Amajiki whispers, face turning green, and Sasaki drops his remote.</span>\n</p>\n<p>\n<span>\"The bullets? What do you mean?\" Midoriya asks, and Sasaki clears his throat.</span>\n</p>\n<p>\n<span>\"Recently, the Shie Hassaikai has been spreading rumors of making bullets that can erase one's Quirk indefinitely.\"</span>\n</p>\n<p>\n<span>\"Amajiki got shot with a temporary one, and we managed to pick up another that had been meant for Kirishima, but couldn't get through his skin,\" Fat Gum pipes up. \"Upon inspection, however…\"</span>\n</p>\n<p>\n<span>\"There's human DNA in the bullet,\" Sasaki finishes, and Midoriya’s face drops.</span>\n</p>\n<p>\n<span>\"So </span>\n<em>\n<span>this</span>\n</em>\n<span> is why Kacchan condones violence,\" Midoriya whispers, earning quite a few worried looks.</span>\n</p>\n<p>\n<span>\"That's illegal.\"</span>\n</p>\n<p>\n<span>\"So is using a little girl to make weapons!\"</span>\n</p>\n<p>\n<span>\"It is,\" Sasaki agrees, and Midoriya’s gaze snaps to him. \"Along with all of their other actions. Thanks to the increased activity of the remaining members- no doubt, now, their attempt to find the boss and girl that you removed from the equation- I was able to use my Quirk to find out where the Shie Hassaikai has their base located.\"</span>\n</p>\n<p>\n<span>The map changes, a larger dot appearing.</span>\n</p>\n<p>\n<span>\"The raid is on Friday morning. Officer, a warrant would likely be best for this case. Heroes, clear your schedules if you can, and report if you have to back out for whatever reason. Any questions?\"</span>\n</p>\n<p>\n<span>There are none. They're dismissed, and head their separate ways. Midoriya, for his part, follows Aizawa out of the room, heading out of the building to return to Yuuei. The trip is silent, mostly, except for one moment.</span>\n</p>\n<p>\n<span>\"Eri is already safe, and Overhaul is detained, both thanks to you,\" Aizawa reminds his student, still looking straight ahead as he walks. \"You have done more than enough. You </span>\n<em>\n<span>do not</span>\n</em>\n<span> have to go on this raid if you feel uncomfortable.\"</span>\n</p>\n<p>\n<span>\"Sensei,\" Midoriya says, and Aizawa glances back to see the fiery determination that he's quite familiar with. \"I can do this.\"</span>\n</p>\n<p>\n<span>\"I figured,\" Aizawa says, then offers a lazy smile. \"I'll be backing you all the way, Problem Child.\"</span>\n</p>\n<p>\n<span>It's the truth, and they both know it.</span>\n</p>\n<p>\n<span>-----</span>\n</p>\n<p>\n<span>It’s eight-thirty in the morning when the raid begins. The sun is out, the sky is clear, and Mirio Togata has one goal in his mind- taking down the people who used a </span>\n<em>\n<span>child</span>\n</em>\n<span> to create their weapons.</span>\n</p>\n<p>\n<span>It’s chaos, from the beginning, but perhaps that’s to be expected. Their leader has disappeared, after all, and it’s clear that they don’t know that Overhaul has been detained- by the green-haired boy standing beside him, no less.</span>\n</p>\n<p>\n<span>But the raid begins, and it begins with a bang, a large man slamming open the door and lunging for the nearest person. Ryukyu and her interns have it handled, though, so Mirio wastes no time, sprinting into the building immediately, pros before and behind him, Midoriya still by his side. </span>\n</p>\n<p>\n<span>Next comes some common thugs, but the police handle them. They’re strong, and can deal with the members that aren’t quite willing to use their Quirks, or perhaps don’t have Quirks that </span>\n<em>\n<span>can</span>\n</em>\n<span> be used. Details aren’t always important, not during fights like these.</span>\n</p>\n<p>\n<span>Sir is quick to instruct them on where to go, but issues arrive when Midoriya and his friend, Kirishima, try to break through a wall. </span>\n</p>\n<p>\n<span>Because walls aren’t supposed to move, but this one does.</span>\n</p>\n<p>\n<span>“It’s the director, Irinaka!” A hero, Rock Lock, shouts, and Mirio grimaces, watching the walls</span>\n</p>\n<p>\n<span>distort. It’ll be impossible for the group to quickly traverse through the space, not with how quickly it changes…</span>\n</p>\n<p>\n<span>But Mirio is made for these sorts of environments, his Quirk the perfect solution to their problems.</span>\n</p>\n<p>\n<span>“I’ll go on ahead!” Mirio promises, and Midoriya frowns.</span>\n</p>\n<p>\n<span>“Not alone,” Midoriya says. “You’re strong, but they’re dangerous.\"</span>\n</p>\n<p>\n<span>\"But what if someone escapes?\" Mirio refutes, to which Midoriya glares with him, with a gaze that looks just like Aizawa's.</span>\n</p>\n<p>\n<span>\"Then the others grab them. The place is surrounded, and those remaining aren't very stealthy. It's hard to miss a guy in a massive bird mask, after all.\" Tilting his head, Midoriya points out. \"Right now, they have no leader, and no one to protect. Their source of instruction and bullets is gone, and they're left without a head to think with. They're running around blind- it's better for us to </span>\n<em>\n<span>not</span>\n</em>\n<span> do the same.\"</span>\n</p>\n<p>\n<span>Mirio can admit, Midoriya has a point, so he nods his head and says, \"Alright! Come on then, let's get a move on!\" </span>\n</p>\n<p>\n<span>Midoriya nods, and Mirio wastes no time, already racing ahead. For a moment, he hears further argument behind him, his mentor and the others debating whether to split up so some more can follow Mirio, or stay together to try taking down foes more easily. </span>\n</p>\n<p>\n<span>And then Mirio hears the sound of a capture weapon unreeling, and everyone goes silent. Footsteps pound, and Mirio glances over to see Midoriya carrying Aizawa effortlessly, his own capture weapon partially unwrapped as he pulls the man along.</span>\n</p>\n<p>\n<span>\"Huh?\" Mirio lets out, and Midoriya grins widely as Aizawa speaks.</span>\n</p>\n<p>\n<span>\"The rest are going to catch up in a moment. We're the front lines.\"</span>\n</p>\n<p>\n<span>\"But your Quirk-\"</span>\n</p>\n<p>\n<span>\"Is useful if we find the source of the walls shifting,\" Midoriya cuts in. \"Sensei can take them down in an instant, just tell me where I need to break through.\"</span>\n</p>\n<p>\n<span>\"Right!\" Mirio smiles, flashing a thumbs up, and then he does what he can do best, phasing through the wall and smiling at the empty halls behind it before holding his breath, hopping right back through to Midoriya. </span>\n</p>\n<p>\n<span>“There’s a hall straight ahead, just break right on through!”</span>\n</p>\n<p>\n<span>“Got it!” Letting Aizawa down, Midoriya crackles green before lunging forward, breaking through the wall with a single kick. “Let’s go!”</span>\n</p>\n<p>\n<span>Aizawa follows quicker than Mirio, likely used to the boy’s quick decisions after mentoring his own student. Mirio can keep up, though, and that’s exactly what he does.</span>\n</p>\n<p>\n<span>It’s a simple pattern, repetitive, but adrenaline keeps everything vivid and exciting as they break through wall after wall. Kirishima and Sir catch up after the third, explaining that the others have been ambushed by a few others.</span>\n</p>\n<p>\n<span>“They’ll have it covered!” Kirishima assures. “We’re pretty sure there’s only a few guys left ahead!”</span>\n</p>\n<p>\n<span>And there are, indeed, but it’s not one of the bullets, nor one of the heads, that they run into next.</span>\n</p>\n<p>\n<span>Nor do they come from ahead.</span>\n</p>\n<p>\n<span>Mirio doesn’t realize what’s happening, not at first, when the walls shift, shutting them in from behind. The others are on alert instantly, Midoriya and Aizawa quickly turning, each one facing in a different direction.</span>\n</p>\n<p>\n<span>Covering each other's back, Mirio realizes, but then there’s a thud, and Rock Lock is running in through a gap, a broken hole in the wall.</span>\n</p>\n<p>\n<span>“Finally caught up,” Rock Lock breathes out, like it’s a joke. “They nearly had us back there, but I’ve got to hand it to you trainees- your friends are rather fierce.”</span>\n</p>\n<p>\n<span>Mirio smiles, but then he sees Midoriya’s frown. </span>\n</p>\n<p>\n<span>“There’s only one,” Midoriya mutters, and that’s enough for Aizawa to straighten, flashing his Quirk and sending his capture weapon at their ally.</span>\n</p>\n<p>\n<span>Except...he’s not an ally at all. </span>\n</p>\n<p>\n<span>No, to Mirio’s surprise, the man starts to drip away, an odd, gray liquid slipping down his body, revealing a girl with messy blond hair and manic wide eyes.</span>\n</p>\n<p>\n<span>“Toga!” Midoriya shouts, and the girl, Toga, grins.</span>\n</p>\n<p>\n<span>“You remember me!” Toga cheers, and then she’s lunging towards Midoriya, as if unaffected by the capture weapon. Aizawa reacts, trying to pull the girl his way, away from his student, and Mirio begins to shout a warning when Toga embraces the motion, jumping up and whipping out a knife that she aims at the man.</span>\n</p>\n<p>\n<span>But Midoriya is faster. Quick as lightning, Midoriya leaps, pulling a knife out of his own belt and using it to knock Toga’s out of her hand. The girl stumbles, eyes blown even wider as she watches Midoriya stand, guarding his teacher.</span>\n</p>\n<p>\n<span>“Deku,” Aizawa mutters. “How about a new assignment?”</span>\n</p>\n<p>\n<span>And just like that, Midoriya changes, his stance becoming looser, his grip readjusting around the hilt of his knife.</span>\n</p>\n<p>\n<span>“Say,” Midoriya murmurs, eyes narrowing with an odd sort of fascination. “I wonder how much the color red suits you.”</span>\n</p>\n<p>\n<span>Toga’s face darkens, cheeks coloring, and she gasps before cutting herself out of Aizawa’s weapon with a second knife and lunging at Midoriya. </span>\n</p>\n<p>\n<span>But Midoriya is different, now, ducking and rolling with the motions, no sign of fear on his face, just a smile of his own as he moves with ease. And Aizawa doesn’t seem quite as worried, either, one hand on the weapon, but his eyes simply track the fight as if it’s nothing but an act.</span>\n</p>\n<p>\n<span>An...</span>\n<em>\n<span>act</span>\n</em>\n<span>.</span>\n</p>\n<p>\n<span>Mirio lights up, watching as Midoriya moves, dodging the knife that Toga slashes at him before spinning around with a fluid grace that the boy doesn’t normally have, a far cry from his usual movements that leaves Mirio in awe. Effortlessly, the boy ducks under her hit, swinging up before swinging his own blade down, sending Toga to the floor, unconscious from the hit from the hilt of his blade.</span>\n</p>\n<p>\n<span>And then the show is over, Midoriya standing upright. “She’s out,” Midoriya states. “Is anyone else coming this way?”</span>\n</p>\n<p>\n<span>“Fatgum will be here as soon as he can,” Kirishima assures. “He’s probably just stopped by the wall.”</span>\n</p>\n<p>\n<span>“Oh?” Unsurprisingly, Midoriya’s reaction is to turn and kick the wall down, leaving an open path. “Kirishima, can you guard her until Fatgum arrives? We’ll keep going ahead.”</span>\n</p>\n<p>\n<span>“You got it!” Kirishima assures, and Midoriya nods before turning to Mirio.</span>\n</p>\n<p>\n<span>Right! There’s more to be done, and no time to be waiting!</span>\n</p>\n<p>\n<span>Mirio, Midoriya, Sir, and Aizawa continue on their path, with Mirio quickly checking through walls before Midoriya breaks the right one down. It only takes three more turns before they enter a large, broken room, where Aizawa immediately snaps his gaze up and activates his Quirk, and a man comes falling from the ceiling.</span>\n</p>\n<p>\n<span>He's unconscious upon impact.</span>\n</p>\n<p>\n<span>\"Irinaka,\" Sir states, and Midoriya is quick to bind the man up, incapacitating him should he wake before they're ready to take him. \"There should be two more, I believe.\"</span>\n</p>\n<p>\n<span>And indeed there are, the two melting out of the shadows the very next hall over. The first one, dressed in a white cloak and brown and gold mask, is dealt with with brutal efficiency, Midoriya taking the man in half the time it takes for Mirio to even advance towards the second.</span>\n</p>\n<p>\n<span>The moment the cloaked male hits the floor, the other pauses, looks over at Midoriya, and then back at Mirio.</span>\n</p>\n<p>\n<span>“That’s how they’re training you kids nowadays?” The man asks, then shakes his head. “No, no way, not dealing with that. Just arrest me, </span>\n<em>\n<span>please</span>\n</em>\n<span>.”</span>\n</p>\n<p>\n<span>Mirio blinks, then takes a pair of handcuffs from Aizawa, slapping them around the man’s wrist.</span>\n</p>\n<p>\n<span>“I...think that’s everyone?” Mirio says, and Midoriya beams with delight.</span>\n</p>\n<p>\n<span>“Good!” Midoriya chirps, as if he didn’t just toss a man to the floor in three seconds. </span>\n</p>\n<p>\n<span>Mirio can see why the second one surrendered. Midoriya is terrifying.</span>\n</p>\n<p>\n<span>Neat!</span>\n</p>\n<p>\n<span>Their opponents dealt with in a rather anticlimactic fashion, the four make their way back through the halls, helping anyone who needs it. They reach the entrance in no time at all, and Mirio smiles at the sight of Nejire standing over a collapsed villain, keeping a firm eye on him as the first year interns stand behind her, gazes sharp even if their bodies are weary. Ryukyu is keeping an eye on all three, still in her draconic form, and Mirio offers the hero a wave that she nods to in return.</span>\n</p>\n<p>\n<span>The brunette, Uraraka, perks up when she sees them. \"Deku!\" She cries. \"Kirishima was just telling me about what you did!\"</span>\n</p>\n<p>\n<span>Kirishima, for his part, is near Fat Gum, Tamaki elsewhere, perhaps getting treated for an injury.</span>\n</p>\n<p>\n<span>Mirio hopes he isn't too hurt.</span>\n</p>\n<p>\n<span>\"It was nothing,\" Midoriya is saying, a hand reaching up, running through his wild hair. \"I just-\"</span>\n</p>\n<p>\n<span>\"Behind you!\" Someone yells, and Mirio turns just in time to see Aizawa flashing his Quirk as Midoriya swings around, punching the thug that lunged at him without even activating his Quirk. The thug drops, and Midoriya blinks.</span>\n</p>\n<p>\n<span>\"I should have recorded that,\" Uraraka murmurs. \"I would have made so much off of Todoroki.\"</span>\n</p>\n<p>\n<span>Huh. Well, alright, then!</span>\n</p>\n<p>\n<span>Mirio glances around, watching as officers drag away the remaining villains, something warm filling his chest.</span>\n</p>\n<p>\n<span>It's pride. </span>\n</p>\n<p>\n<span>Looking at the heroes around him, of the now and training for the future, Mirio knows his pride is well-placed.</span>\n</p>\n<p>\n<span>The future is in great hands, and maybe it won't be quite as grim as Mirio always jokes it to be.</span>\n</p>\n<p>\n<span>No, Mirio thinks it will be something much, much brighter.</span>\n</p>\n<p>\n<span>-----</span>\n</p>\n<p>\n<span>Mirai watches Midoriya move throughout the deserted meeting room, searching for something. It must be important, with how the boy searches, careful yet quick, efficient with every sweep of his eye. He’s no longer in his costume, now dressed in his school uniform, but his case is in hand, so it can’t be that.</span>\n</p>\n<p>\n<span>Nevertheless, it clearly matters to the boy, the boy who Mirai has, admittedly, wronged.</span>\n</p>\n<p>\n<span>And so Mirai steps forward, clearing his throat.</span>\n</p>\n<p>\n<span>“What are you looking for?” Mirai asks, and Midoriya startles before stiffening, straightening up and looking Mirai in the eyes.</span>\n</p>\n<p>\n<span>The boy’s are guarded, however, and Mirai feels even worse, as if the clouds in the boy’s eyes are directly impacting Mirai’s mood.</span>\n</p>\n<p>\n<span>They are. </span>\n</p>\n<p>\n<span>“My notebook,” Midoriya explains, and then, softer, as if he’s not quite realizing he’s still speaking, “It’s odd, because I always put it in my bag when I’m not using it. It’s not smart to leave personal possessions out in the open where others can see them, especially when they’re important. I’ve lost too many notebooks to keep making that mistake...but I didn’t </span>\n<em>\n<span>have</span>\n</em>\n<span> my bag this morning, did I? No, so I wouldn’t have packed it away...and didn’t Aizawa ask to look at it to reference one of the pages? He did, so…”</span>\n</p>\n<p>\n<span>Abruptly, Midoriya’s mouth clamps shut, and his eyes widen before settling. “I was mumbling. Sorry.”</span>\n</p>\n<p>\n<span>“It’s fine,” Mirai says, and Midoriya gives him a quick glance before nodding slightly, resuming his search.</span>\n</p>\n<p>\n<span>Mirai joins in, glancing around the room, moving from his spot by the doorway to look underneath the table, and, oh.</span>\n</p>\n<p>\n<span>“Is this it?” Mirai asks, lifting a yellow notebook from one of the seats, and Midoriya perks up.</span>\n</p>\n<p>\n<span>“It is!”</span>\n</p>\n<p>\n<span>“Here.” Mirai hands over the notebook, seeing how the boy calms once it’s in his free hand, tucked up to his chest. It must truly be special, whatever he is taking notes on.</span>\n</p>\n<p>\n<span>“What is it about?” Mirai cannot help but ask, and Midoriya laughs sheepishly.</span>\n</p>\n<p>\n<span>“It’s just some analysis. I do it as a hobby.” Shrugging, Midoriya says, “It’s nothing very special, although Principal Nedzu has been helping me refine it.” </span>\n</p>\n<p>\n<span>Nothing special...but </span>\n<em>\n<span>Nedzu</span>\n</em>\n<span> is interested in it?</span>\n</p>\n<p>\n<span>That’s quite the contradiction. </span>\n</p>\n<p>\n<span>“If Nedzu has taken to helping you with it, it’s certainly something to be proud of,” Mirai states, and Midoriya looks at him strangely yet again.</span>\n</p>\n<p>\n<span>“Thank you,” he says, wary, cautious, and Mirai nods.</span>\n</p>\n<p>\n<span>“Of course.” Fixing his glasses, Mirai admits, “Strength is something anyone can gain, but a good head on one’s shoulder is a skill that should be exploited. It would have been an honor to mentor you, and I apologize for my own shortcomings upon our introduction.”</span>\n</p>\n<p>\n<span>Wariness is replaced by surprise, and Midoriya blinks at him before smiling. “Thank you,” he says again, but it’s much warmer now. “I...don’t think an adult has ever apologized. It’s not a problem, though. Well, it </span>\n<em>\n<span>did</span>\n</em>\n<span> hurt, admittedly, but….I don’t hold it against you.”</span>\n</p>\n<p>\n<span>Midoriya shrugs, readjusts the grip on his case, and says, “But, maybe next time, you should talk to Yagi instead of taking your grievances out on his successor?”</span>\n</p>\n<p>\n<span>There’s something about the way Midoriya says it, a bit of a grin on his lips and a spark in his eyes, that makes Mirai chuckle, nodding along. “Of course,” Mirai agrees. “I think it’s about time I pay him a visit, no?”</span>\n</p>\n<p>\n<span>“I think so, too,” Midoriya agrees. “It’s been a while.”</span>\n</p>\n<p>\n<span>“It has.” And without thinking, Mirai holds out his hand, still smiling, “It was a pleasure to have you on this raid. I look forward to seeing your progress in the future.”</span>\n</p>\n<p>\n<span>“I look forward to that progress, too,” Midoriya jokes as he tucks his notebook under his one arm, and then he takes the hand, shaking it before letting go, nodding his head as a farewell before walking to the door.</span>\n</p>\n<p>\n<span>But Mirai does not see him, but rather the future that will unfold, step by step, action by action, causing reactions he can not yet see with the purple glow that surrounds each movement. </span>\n</p>\n<p>\n<span>“For the record,” Mirai calls out to Midoriya’s retreating figure, “you’re going to be a great hero.”</span>\n</p>\n<p>\n<span>Midoriya pauses, one foot out of the door.</span>\n</p>\n<p>\n<span>And then he is turning around and smiling oh so softly, a hint of calm within the storm that he has become through his own determination.</span>\n</p>\n<p>\n<span>“I know,” he agrees, and then he is gone, off towards his future.</span>\n</p>\n<p>\n<span>And Mirai is content.</span>\n</p>\n<p>\n<span>-----</span>\n</p>\n<p>\n<span>Izuku Midoriya heads back to the dorms, steps light and easygoing as he heads back with Eijirou Kirishima, Ochako Uraraka, and Tsuyu Asui, much more at ease once he is within the walls of Yuuei. He’s glad, quite simply, that the raid has gone so well. It would have hurt, surely, if someone had been drastically injured, or worse, but Izuku doesn’t </span>\n<em>\n<span>have</span>\n</em>\n<span> to ponder about such a thing, doesn’t have to grieve over something so serious. </span>\n</p>\n<p>\n<span>No, Izuku just has to smile, because everyone is alright. The villains have been apprehended, Eri has been saved, and the heroes are alright, sans a few minor injuries.</span>\n</p>\n<p>\n<span>And so life is good, Izuku thinks, as he enters the dorms for 1-A. The week is over, and, other than the work Izuku needs to catch up on, Izuku has nothing to worry about. It’s been a good week, a nice one. </span>\n</p>\n<p>\n<span>But, entering the common room, Izuku begins to wonder if his peers can say the same. Because half of his peers are in the room, all looking rather despondent.</span>\n</p>\n<p>\n<span>“Did someone die, kero?” Asui asks, tilting her head, and everyone perks up at the noise.</span>\n</p>\n<p>\n<span>“You’re back!” Hagakure cheers, and the others join in, many hopping up from their spots to greet the four.</span>\n</p>\n<p>\n<span>“Are you guys okay?” Kaminari asks. “I know you guys left in the morning, why were you gone all day?”</span>\n</p>\n<p>\n<span>“Paperwork,” Kirishima explains as cheerfully as one can talk about such a subject, and Kaminari winces.</span>\n</p>\n<p>\n<span>“Yikes. You’ve been doing that all day?”</span>\n</p>\n<p>\n<span>“Not all day!” Uraraka admits. “Ryukyu took us to get food, actually!”</span>\n</p>\n<p>\n<span>“It was nice,” Asui agrees.</span>\n</p>\n<p>\n<span>“What about you?” Sero asks Izuku, grinning widely as he asks, “Did you and </span>\n<em>\n<span>Aizawa</span>\n</em>\n<span> go and grab a bite?”</span>\n</p>\n<p>\n<span>He says it jokingly, and Kaminari snorts at the idea, saying, “As if Aizawa would-”</span>\n</p>\n<p>\n<span>“We did, actually,” Izuku interrupts, if only to see how Kaminari’s jaw drops. “We grabbed some food before going to the hospital.”</span>\n</p>\n<p>\n<span>There’s silence, for an instant. But only a single instant, and then chaos erupts, his peers talking over one another in their excitement.</span>\n</p>\n<p>\n<span>“Why the </span>\n<em>\n<span>fuck</span>\n</em>\n<span> does Midoriya get to be Aizawa’s favorite?”</span>\n</p>\n<p>\n<span>“Todoroki might be onto something- Midoriya, </span>\n<em>\n<span>are</span>\n</em>\n<span> you Aizawa’s secret son?”</span>\n</p>\n<p>\n<span>“Wait, did you say you got food </span>\n<em>\n<span>before</span>\n</em>\n<span> going to the hospital? Which one of you was injured?”</span>\n</p>\n<p>\n<span>“It had to be Midoriya- Aizawa wouldn’t get more hurt than him.”</span>\n</p>\n<p>\n<span>“Aizawa </span>\n<em>\n<span>was</span>\n</em>\n<span> more hurt during the U.S.J. than Midoriya, though, and that’s when Midoriya broke his arms for fun.”</span>\n</p>\n<p>\n<span>“It wasn’t for </span>\n<em>\n<span>fun</span>\n</em>\n<span>!” Izuku cuts in, face red as he finally takes control of the conversation once more. “And I didn’t have any injuries today!”</span>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>Right</span>\n</em>\n<span>,” Shinsou drawls, and Izuku sputters.</span>\n</p>\n<p>\n<span>“He didn’t!” Kirishima defends. “Midoriya was really manly today- he was, like, tag teaming with Aizawa to take down villains!”</span>\n</p>\n<p>\n<span>“Yeah!” Uraraka agrees. “It was really impressive. At one point, I’m pretty sure Deku beat a villain while his Quirk was being erased!”</span>\n</p>\n<p>\n<span>“Really?” Shinsou asks, and when Izuku nods bashfully, he whistles. “Damn. Carry on, then. So Aizawa got fucked up and had to get medical care?”</span>\n</p>\n<p>\n<span>“No. He had a few stitches, but we actually went to visit someone else.”</span>\n</p>\n<p>\n<span>Instantly, his peers calm, tension leaving their shoulders, and Jirou states, “Maybe </span>\n<em>\n<span>start</span>\n</em>\n<span> with that, next time?”</span>\n</p>\n<p>\n<span>“Ah, right!” Letting out a laugh, Izuku asks, “So, what about you? How was class today?”</span>\n</p>\n<p>\n<span>Instantly, his peers all lose their smiles, faces becoming saddened once again.</span>\n</p>\n<p>\n<span>“I’ve never been so bored in my </span>\n<em>\n<span>life</span>\n</em>\n<span>,” Kaminari complains, dropping onto the floor, carrying on as if the impact didn’t hurt. “Midoriya, my man….you’ve, like, ruined normal school?”</span>\n</p>\n<p>\n<span>“I’m sorry?” Izuku apologizes awkwardly, and Ashido snorts, not moving from the couch that she sits on.</span>\n</p>\n<p>\n<span>“You should be! It’s too boring without you and Aizawa-sensei stirring up chaos nowadays!”</span>\n</p>\n<p>\n<span>“Even when you are not swapping your personality, your character is a beam within our darkness,” Tokoyami agrees sagely, to which Dark Shadow pops out, adding, “And Aizawa is fun!”</span>\n</p>\n<p>\n<span>“And I’m pretty sure Todoroki was ready to leave when he realized you weren’t showing up,” Jirou pipes up again, and Izuku blinks when Todoroki nods along seriously.</span>\n</p>\n<p>\n<span>“Life isn’t worth it without him,” Todoroki states, and Izuku blushes at the kind declaration.</span>\n</p>\n<p>\n<span>His friends are so sweet, aren’t they?</span>\n</p>\n<p>\n<span>“W-well,” Izuku says, face a bit warm at their words, “I can’t promise that I won’t miss a class again in the future, but...I’m here all weekend, if that helps?”</span>\n</p>\n<p>\n<span>“It does,” Todoroki agrees immediately, which, for some reason, causes his peers to laugh.</span>\n</p>\n<p>\n<span>And Izuku doesn’t quite get it, but he does get one thing.</span>\n</p>\n<p>\n<span>If there is a perfect world, Izuku is positive that he has found it.</span>\n</p>\n<p>\n<span>The future is bright, and Izuku can’t wait to see it, his classmates by his side.</span>\n</p>\n<p>\n<span>And he’ll keep going beyond, Plus Ultra style, because that’s the way he knows best, and always will. </span>\n</p>"
}