{
  "id": "31337819",
  "url": "https://archiveofourown.org/works/31337819?view_full_work=true",
  "author": [
    "RadPax"
  ],
  "title": "Secret Fan",
  "rating": "Mature",
  "archive_warnings": [
    "Graphic Depictions Of Violence"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
  ],
  "relationships": [
    "Bakugou Katsuki/Midoriya Izuku"
  ],
  "characters": [
    "Kirishima Eijirou",
    "Midoriya Izuku",
    "Midoriya Inko",
    "Bakugou Katsuki",
    "Kaminari Denki"
  ],
  "additional_tags": [
    "Quirkless Midoriya Izuku",
    "Pro Hero Bakugou Katsuki",
    "Twitch Streamer Izuku",
    "Slow Burn",
    "Secret Identity",
    "Mutual Pining",
    "Bakugou Katsuki is Bad at Feelings",
    "Bakugou Katsuki Swears A Lot",
    "Protective Bakugou Katsuki",
    "Cute Midoriya Izuku",
    "Alternate Universe - Canon Divergence",
    "Sugar Daddy Bakugou Katsuki",
    "He doesn't do it on purpose it just kinda happens",
    "Height Differences",
    "Fluff and Angst",
    "Kaminari Denki is a Dork",
    "Hurt/Comfort",
    "Angst and Hurt/Comfort",
    "tw: molestation",
    "tw: depression",
    "Midoriya Izuku Has PTSD",
    "Midoriya Izuku Has Panic Attacks",
    "Original Character(s)",
    "Streamer Midoriya Izuku"
  ],
  "language": "English",
  "series": "",
  "published": "2021-05-16",
  "completed": "2021-07-15",
  "words": "37,477",
  "chapters": "13/13",
  "comments": "664",
  "kudos": "10,125",
  "bookmarks": "2,145",
  "hits": "135,045",
  "summary": "<p>Bakugou Katsuki was now Japan's #1 Pro Hero, he just got off of work and was looking through twitch to find something to watch to keep himself awake for a few hours.<br>That is until he sees a cute guy with beautiful sea green hair, and emerald eyes talking about heroes.</p>\n<p>So what if Katsuki dropped the guy some money, and so what if he was accidentally developing a crush on the guy.<br>This was fine.<br>Its fine.<br>After all its not like the guy is gonna send Katsuki a message-<br>Oh no, is that a notification sound?</p>\n<p>AU Where Izuku is quirkless and a twitch streamer and Katsuki has to keep his identity as DynaMight hidden while the two slowly develop feelings for the other</p>\n<p>Clicking the stream his jaw hung he couldn’t believe what he was seeing. This fucker. Not only did he have that beautiful ocean green hair, but he has gorgeous long dark eyelashes, soft full pink lips, and freckles. Holy shit. The freckles! A beautiful plethora of constellations across his cheeks and down his neck. And wait, where are they on his arms too?! Each time the guy waved his arms around Katsuki could see some along his forearm, beautiful soft angel kisses all over. God fucking damnit.</p>\n<p>Katsuki’s hands hovered over his phone's keyboard. What the fuck do you say in this kinda situation? He was never good with feelings, let alone helping people with THEIR feelings.<br>But fuck.</p>\n<p>And one thing that kept pulling at him. “Maybe cause I’m qurikless?”</p>\n<p>—————-<br>KaboomKing: I don’t have a mic for my PC.<br>Deku: Oh heck. Really??<br>KaboomKing: Never needed one.<br>Deku: Aww… we could call on your phone?<br>—————-</p>\n<p>Fuck, he completely forgot about his phone!</p>\n<p>Maybe the shit mic quality would mask his voice? And if he wasn’t yelling and just talking calmly Deku might not even realize who he is. No, this could work. This could for sure work.</p>\n<p>With shaky hands, Katsuki typed out his message.</p>\n<p>“Fuck…” Katsuki groaned out, staring down at his phone. This has to be illegal to be this adorable. There no fucking way a human being could look like that and be allowed to walk down the street.</p>\n<p>“Ohhhhh~” Denki now had a cheshire grin. “So it's a boy!” </p>\n<p>That was not what he was expecting the other blonde to say. “What?!”</p>\n<p>“Y’know, it makes sense. You never were into girls back in high school. Its okay Kats, you know I’d never judge you for being gay.” Denki reached out, placing a hand onto Katsuki’s broad shoulder. </p>\n<p>Error, error. Katsuki has stopped working.</p>\n<p>WARNING: THIS CHAPTER COVERS TOPICS OF SEXUAL ASSAULT AND PHYSICAL ABUSE!<br>PLEASE BE WARNED BEFORE READING</p>\n<p>“Aw, my poor kitten. You look so upset. I’m sorry, but you were trying to get away and I just couldn’t have that.” The raven haired man said gently, pushing Izuku’s curls out of his face and brushing at his soft cheeks.”You’re far too cute for me to just let you go.”</p>\n<p>There was a sad reality before them both. They were both alone, but in different ways. Katsuki had chosen to be alone, and had chosen to push people away. while Izuku had been pushed away, he had no choice in this isolation. But in the end, both longed to be found, long to find someone else that could understand them in a way that no one in this society could. It was poetic, in some sad messed up way. Each wanting the other for different but all to similar reasons, two sides of the same coin.</p>\n<p>“Hey Kacchan, c-could you do something for me?” Izuku mumbled out, feeling his ears start to burn up.</p>\n<p>“Wassup nerd?”</p>\n<p>“Could you read to me until I fall asleep?”</p>\n<p>“K-Kacchan…?” Izuku could barely speak, fear spiked through his entire being. He felt sick.</p>\n<p>“Deku, I need you to breathe. You’re hyperventilating.”</p>\n<p>“K-Kacchan he found me! He knows who I am!” Izuku rasped out.</p>\n<p>DING DONG</p>\n<p>the doorbell? </p>\n<p>Izuku froze, staring at the entrance way to his apartment. Another ring, and Izuku slowly stood to walk towards the door. His body felt woozy, his vision going blurry as he made his way over.</p>\n<p>“Wh-who is it?”</p>\n<p>“So, what you’re saying is…” Katsuki could feel a toothy smile creepy across his sharp features. “I can beat this guy to a pulp.”</p>\n<p>A piece to this puzzle that life dared hand them and all this time they had been desperately trying to put together but never knowing where the final piece lay.</p>\n<p>It was here.</p>\n<p>The piece was found.</p>\n<p>“P-pretty? Me? I’m not a girl, Kacchan.”</p>\n<p>“Yeah no shit Sherlock. Men can be pretty. You’ve called me pretty before.”</p>\n<p>“Oh fuck-CRAP! No! Ugh!!!” </p>\n<p>Katsuki couldn’t help but laugh at that. “Izuku Midoriya! Was that a swear? My, what would your mother think!”</p>\n<p>“Shut up, your swearing has rubbed off on me!” </p>\n<p>“Me? Swearing? I don’t know what you mean! I’m an Angel! I never swear and I am always very very polite.” Katsuki coos, sarcasm dripping from his tone.</p>\n<p>“Hardy harr harr.” Deku huffs, but a smile clearly on his lips. “But, you’re right.”</p>\n<p>“About?”</p>\n<p>“You are very pretty.”</p>",
  "notes": "<p>Howdy howdy~! Hopefully you guys like what I have so far. Shout out to my friends Dani and Sal for proof reading this.<br>I've had this AU stuck in my head for a few weeks now and finally decided to actually write it.<br>Lemme know what you all think &lt;3</p>\n<p>Art is done by me, you can see more over on @RadPax on twitter or Rad_Pax on instagram~<br>I hope you all like what I have so far &lt;3 Lemme know if there's any mistakes &lt;3</p>\n<p>Hello hello~! New update in al its glory!<br>Art is done by me, you can see more over on @RadPax on twitter or Rad_Pax on instagram~<br>This has been a lot of fun to write so i hope you all enjoy it too uwu</p>\n<p>Hello my lovelies!!! Thank you all so much for your comments~! It means a lot to me. I haven't properly written a story in years, so having people like what I make absolutely warms my heart.<br>Hopefully the chapters are a good length. each one is about 3k each but it never feels like its enough.<br>Yet again I have left you all on a cliffhanger because I'm a monster :&gt;<br>Thank you to my wonderful friend Sal for proof reading this &lt;3<br>And again, you can find more of my art on twitter @RadPax and on instagram Rad_Pax</p>\n<p>Thank you to my lovely friend Sal and Tiny for reading over my fic and editing mistakes.<br>I love you guys!!</p>\n<p>Hopefully you guys like this chapter... it was difficult to write for many reasons. Fluff will return soon but with angsty.<br>&lt;3<br>fyi lemme know if there are any mistakes.<br>you can see more of my art on @radpax on twitter or rad_pax on IG</p>\n<p>Hey there! Sorry for the lack of updates! I had extremely bad carpal tunnel for a few weeks and could barely draw or write, plus a ton of back pain.<br>I got a new desk and chair and that's helped a lot! So more updates soon! I'll also be making ANOTHER BKDK fic so keep an eye out for that on my socials (twitter: @RadPax, instagram Rad_Pax)<br>Happy Pride Month btw!!! Thank you all for reading my story and liking it! It means SOOO much to me! Sorry last chapter was pretty intense, but I'll be tackling more on it and hopefully do it justice.<br>Fluffy continues now after all that angst. &lt;3</p>\n<p>oh hey a new chapter so soon? I was gonna wait a few days before posting it but eh.<br>I've had a pretty rough day and wanted to share this chapter really badly. Its my favorite that i've written so far so let me know what you think.</p>\n<p>Sorry for the late update! I recently had to move back in with my dad (posted about the whole situation on my twitter @radpax) and got pretty depressed due to the whole thing so had 0 motivation to write and 0 ideas for the next chapters.<br>But we're back!<br>Sorry this chapter is a little shorter but the next few will be a little longer. I try to have each chapter be around 3k each, but I felt like this was a good cut off to this particular chapter. Excited for the next ones! Things are really heating up now (pun intended)</p>\n<p>back so soon? Hi hello!<br>trying something new out with the art for the next few chapters. lemme know if you like it.<br>as always you can see more of my art over on @RadPax on twitter or rad_pax on IG<br>we're getting closer to the finish line i think!! exciting!<br>Let me know what you thought of this chapter! &lt;3<br>ALSO! At 30k words now!! WOO</p>\n<p>I'd like to thank you all for 1,000 kudos on this fic!! It means so much! I hope you all like it so far! Things are really starting to get intense now~! So excited!!<br>as always, art is by me and you can find more on twitter (@radpax) or instagram (rad_pax) <br>I'm also writing another fic so once that's posted i'll talk more about it on here and my twitter.</p>\n<p>Did I leave you guys in suspense? Hopefully this can make up for it. From how things are going now I think I only have a bit more to write and we'll be done! So let me know if you have anything you really wanna see or any questions that need answered!<br>I cannot thank you all enough for reading this and liking it. You guys are all wonderful and its been such a fun experience writing again! <br>Reminder you can follow me on twitter @RadPax or instagram Rad_Pax for more art, updates, ect.</p>\n<p>Happy Birthday Izuku!! This felt like the most sound ending tbh. I tried writing more and adding extra but this one just made sense.<br>Hopefully you all are satisfied with this ending~<br>Like I've said in the past, follow me on twitter (@RadPax) or twitter (Rad_Pax) for more art and when I'll post updates to my fics and new ones.<br>This has been a hell of a ride but this story is finally done.<br>To think I started this like, what? 2 months ago? And now we're here.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_13_endnotes\">more notes</a>.)\n</p>\n<p>Some answers to some questions I'm sure you all are wondering.</p>\n<p>Did katsuki explain they knew each other as kids?<br>Yes. I tried writing that scene over and over again but it clashed badly with this ending, but yes he did tell him.<br>and Izuku about melted from it. The piece was originally planned for that scene but like I said, everything I wrote just didn't seem good.</p>\n<p>Is Izuku still going to nursing school?<br>Yes~! He still dreams of being a nurse even if he's dating the top hero! He wants to save lives too!</p>\n<p>Is Izuku still streaming?<br>yep~ Though now from the safety of Katsuki's home ;) Aint no one getting in there</p>\n<p>What about inko????<br>Well, with Katsuki's money she's been able to get better care and is doing a lot better now.</p>\n<p>Is this really the ending??<br>Yeah. I didn't want to just keep writing for the hell of writing and end up getting writers block because I can't figure out where to go next.<br>I haven't written a big story like this in YEARS and there's nothing worst than writing yourself into a hole just cause you don't want to be done.<br>But don't worry~!<br>I have two fics in the works! One with Deku being trans and he owns a cafe where his old childhood bully wonders in (should be out by next week. waiting on a logo) and one about android Deku~! :&gt;<br>So please follow my twitter to get those post~</p>",
  "text": "<p>Katsuki sighed, slowly slipping off his boots as he entered his apartment. He had just worked a 16 hour shift and exhaustion was slowly starting to seep in. As the new Symbol Of Victory, Katuski had an extremely busy life, but one he was extremely thankful for. He had everything he could ask for though, something still felt like it was missing.</p>\n<p> </p>\n<p>The time was 5:32, and he knew if he fell asleep now he’d wake up at 2am and wouldn’t be able to get back to sleep. He needed to stay awake just a few hours longer to try and have some semblance of a sleep schedule.</p>\n<p> </p>\n<p>The blonde made his way into his kitchen and started cooking up dinner, hoping food might wake him up some. While cooking he opened his phone and began looking for something to watch and keep his exhausted brain stimulated.</p>\n<p> </p>\n<p>Katsuki was never one for streamers but he had hoped having something live might keep his brain more awake. Looking through Twitch however, nothing seemed interesting. That was until he saw it. Or rather him.</p>\n<p> </p>\n<p>The thumbnail showed a boy with wild viridian hair and matching bright eyes. He couldn’t see much of him from just the thumbnail alone but the guy sure had a hell of a look. Katsuki wondered if his hair color was naturally green or if he dyed it like Kirishima. But the thing that REALLY caught his attention was the title.</p>\n<p> </p>\n<p>PRO HERO DYNAMIGHT: VILLAIN FIGHT BREAKDOWN AND ANALYSIS!</p>\n<p> </p>\n<p>This dude was really doing a breakdown of his last battle on twitch? Really? Now this he HAD to see. </p>\n<p> </p>\n<p>Clicking the stream his jaw hung he couldn’t believe what he was seeing. This fucker. Not only did he have that beautiful ocean green hair, but he has gorgeous long dark eyelashes, soft full pink lips, and freckles. Holy shit. The freckles! A beautiful plethora of constellations across his cheeks and down his neck. And wait, where are they on his arms too?! Each time the guy waved his arms around Katsuki could see some along his forearm, beautiful soft angel kisses all over. God fucking damnit.</p>\n<p> </p>\n<p>The best way Katsuki could describe him was like a fae from some fantasy story he might have read as a kid. He looked ethereal and beautiful. Katsuki felt like he knew this guy from somewhere but also didn’t, it made his heart beat faster and his stomach do flips just looking at the guy. Like some weird connection he couldn't even explain.</p>\n<p> </p>\n<p>He was so distracted by how gorgeous the man was he didn’t even register he was talking.</p>\n<p> </p>\n<p>“As you can see here, during his fight DynaMight was attempting to try out some new types of explosions. His quirk is made from the sweat on his hands so I theorize that he’s been trying out new techniques since it’s winter and he can’t get as much sweat as he’d need for his other explosions he’d have during summer.” The freckled beauty remarks.</p>\n<p> </p>\n<p>Katsuki’s brain nearly short circuits. His voice was so soft and airy. Like a warm cup of cocoa after playing out in the snow. It was like if warm hugs had a sound. The blonde couldn’t believe his ears, there’s no way someone could look so adorable and have the sweetest voice as well. This was some absolute bullshit! He HAD to have some kinda flaw!</p>\n<p> </p>\n<p>Katsuki stared intensely at his phone as he listened to the greenette talk about his last battle, now even MORE impressed by how intelligent the guy was. He talked wildly with his arms, going off on long tirades about quirks and how they were used, every now and then giving praise to how amazing DynaMight was during his last battle.</p>\n<p> </p>\n<p>Katsuki had nearly forgotten about his food as he had gotten so sucked into the nerds' ramblings. Grabbing a bowl and scooping up some of the curry he had just made he wandered into his room and turned on his PC to sit and watch the stream from the comfort of his desk.</p>\n<p> </p>\n<p>As he loaded up the URL, he watched the chat from his phone. The guy was clearly pretty popular, and gathered quite a few “simps”, as Mina would call them. The chat was going a mile a minute, he’s honestly impressed the greenette could keep up. </p>\n<p> </p>\n<p>Each time there was a donation he would pause his ramblings to thank them then go back to rambling or answering questions in chat. </p>\n<p> </p>\n<p>Once the stream was loaded on his PC he noticed a few things when he scrolled down. It was a short introduction panel he couldn’t see on mobile.</p>\n<p> </p>\n<p>—————————————————-</p>\n<p>Hey there!! (ﾉ◕ヮ◕)ﾉ*:･ﾟ✧ my names Deku! Yep you read that right! ヽ(゜∇゜)ノ I’m a biiiiig fan of heroes, if you can’t tell. My favorites being DynaMight and All Might! </p>\n<p> </p>\n<p>ヽ(^◇^*)/ I’m actually quirkless myself, but I had big dreams as a kid to become a hero. Didn’t exactly work out but hey! Now I can talk to YOU guys about heroes! So it’s okay! </p>\n<p> </p>\n<p>I go to college so my schedule is a bit busy. I stream Mondays, Wednesday and Saturdays </p>\n<p>∩(︶▽︶)∩ so please come by! </p>\n<p> </p>\n<p>Deku | 22 | he/him | Quirkless | Cancer sign | This stream is a safe space for everyone! (◡‿◡✿) If you’re a bigot you will be banned</p>\n<p>————————————————————-</p>\n<p> </p>\n<p>Katsuki couldn’t help but chuckle at it all. The emojis alone were ridiculous, but the guy seriously went by Deku? There HAD to be a story behind this weird nickname and he was hoping to find out.</p>\n<p> </p>\n<p>Though, something did catch his attention even more than the weird nickname. The dude was quirkless? That was pretty rare in today’s world, and it looked like he was pretty loud and proud about it too. Having it put down twice on his little about section. </p>\n<p> </p>\n<p>Looking back to the stream, he kept seeing all the donations pooling in. Each time a big number would pop up Deku would get flustered and start sputtering out a thank you. Katsuki couldn’t help but think how awkward the freckled nerd acted was pretty cute. </p>\n<p> </p>\n<p>This sparked a dangerous idea in his head. </p>\n<p> </p>\n<p>—————</p>\n<p>Chat:</p>\n<p>MintyLove: Deku-Chan is soooo cute!! </p>\n<p>RainyDayz: dude is such a DynaMight simp LOL</p>\n<p>RagingPuppies: Deku how’s school going?</p>\n<p>KaboomKing Donated ¥100,000</p>\n<p>ShadowEons: HOLY SHIT</p>\n<p>MintyLove: WHAT</p>\n<p>ChaoticSandwhich: the fuck did I come back to</p>\n<p>OrangePeeledRice: DEKU HOLY SHIT LOOK</p>\n<p>KaboomKing: lol</p>\n<p>RagingPuppies: lol?!?!? You donate that then just say lol?!?!? </p>\n<p>KaboomKing: lol</p>\n<p>[mod] ManicDreams: DUDE WHAT?!</p>\n<p>——————</p>\n<p> </p>\n<p>Deku was yet on another rant when the notification popped up. He nearly bit his own tongue seeing the number flash before his eyes. </p>\n<p> </p>\n<p>“Wh- HUH?! E-Excuse me?! D-did you mean to donate that much?! That’s a lot of money!”</p>\n<p> </p>\n<p>Katsuki smirked from behind his monitor. Cute. This reaction was very cute. </p>\n<p> </p>\n<p>Deku’s face was bright red, and he kept wrapping his arms around his face to hide the blush. He looked so embarrassed and frazzled.</p>\n<p> </p>\n<p>—————</p>\n<p>Chat:</p>\n<p>[TOP DONOR] KaboomKing: Yep. Was the amount I meant to put in. </p>\n<p>ChaoticSandwhich: dude that’s INSANE!</p>\n<p>—————</p>\n<p> </p>\n<p>“I-“ The greenette takes a deep breath, trying to collect himself. “Wow, I cannot thank you enough! Holy cow! Thank you KaboomKing! You’re literally the nicest person. Holy crap, I just- I have no words.”</p>\n<p> </p>\n<p>Katsuki couldn’t help but flush at the praise he was getting. Sure he was used to praise, hell he got it pretty constantly. But for some reason this made him feel butterflies in his belly. Like his heart was leaping out of its chest with each word the beautiful freckled man spoke.</p>\n<p> </p>\n<p>Without even thinking, the blonde dropped 50 gifted subs and another ¥100,000. Fuck it.</p>\n<p> </p>\n<p>The minute the pop up came the chat was going absolutely ballistic and Deku looked like he was about to cry. Katsuki didn't even know it was possible for someone to get even redder and yet here we were</p>\n<p> </p>\n<p>“Oh!! Oh my God!! Are you for real? K-Kaboom you seriously don’t need to do this! You’re so sweet! Oh wow… I’m- I might cry?! Wait no I think I am crying?! I don’t have enough words. You’re the sweetest person. Oh gosh I hope you’re having a good day cause you seriously deserve it!!”</p>\n<p> </p>\n<p>The blonde sat back in his chair now having the biggest shit eating grin on his face. He was practically eating up the compliments thrown at him by this cutie. He felt like his own heart was racing from all the endorphins running through his body. Denki would probably say some dumb shit like “Thank you for the serotonin!” or whatever, which honestly felt fitting right now. Even if Katsuki hates to admit it.</p>\n<p> </p>\n<p>—————</p>\n<p>Chat:</p>\n<p>[TOP DONOR] KaboomKing: It’s nothing. Just felt like it</p>\n<p>MintyLove: Hh you just casually felt like dropping ¥200,000 and a ton of subs?!</p>\n<p>[TOP DONOR] KaboomKing: pretty much.</p>\n<p>MintyLove: Mmmmm! Sureeee, likely story.</p>\n<p>candycorn69: Dude is a simp like the rest of us. Can't blame him though. Deku is cute af</p>\n<p>CreepyKitten: I wish Deku was my boyfriend u-u </p>\n<p>Lovely1113: Ugh same. He’s so cute. I bet he’d make an amazing bf</p>\n<p>TonedBeans: I bet the guy is gay though, I mean look at how much he simps for DynaMight. None of us gals in chat got a chance with this hottie</p>\n<p>Crispy2489: guess that means I might be able to date Deku. Hahaha</p>\n<p>DekuIsMyLove178: I wonder what he looks like naked hehehehe…….</p>\n<p>TonedBeans: you’re speaking my language now!</p>\n<p>CreeptKitten: oh don’t be weird you guys :/</p>\n<p>[TOP DONOR] KaboomKing: Shut the fuck up</p>\n<p>Lovely1113: ohhhh someone’s angy. Touch a nerve rich boy?</p>\n<p>[TOP DONOR] KaboomKing: No. You all are just gross.</p>\n<p>—————-</p>\n<p> </p>\n<p>Right. Creeps were always online, and with someone as adorable as Deku then they’d come in droves. He watched as Deku’s face contorted slightly reading the chat, clearly annoyed at the nasty comments but didn’t say anything. Which honestly was a smart choice. Had it been Katsuki in that situation he’d start yelling at the chat about being freaks and how none of them are worthy to date him. Was probably best he didn’t dare try and stream.</p>\n<p> </p>\n<p>“I…” the greenette starts, snapping Katsuki out of his train of thought. “For real. Thank you so much. You’d not know how much that money means to me.” Deku smiles. It was a genuine smile. None of that fake crap Katsuki saw all too often with streamers. The guy was genuine and every word he meant felt honest.</p>\n<p> </p>\n<p>God, this guy was gonna make his wallet hurt if he kept this up. But fuck it was so word it.</p>\n<p> </p>\n<p>—-</p>\n<p> </p>\n<p>After another hour Deku had started his sign off for the stream. It was now 7:40, and Katuski honestly didn’t expect that he’d be here the entire time but the guy had a way with words. He could sit and listen to Deku talk about literally anything for hours.</p>\n<p> </p>\n<p>“Alright guys! It’s getting late and I need to get dinner and go study. Thank you all for hanging out with me tonight and an EXTRA big thank you to Kaboom for his donations! You're absolutely amazing! I hope you all have a good night too, and stay safe. I’ll see you all next stream. And don’t forget to join my Discord if you want regular updates or to chat with me! Deku~! OUT!”</p>\n<p> </p>\n<p>And with that the stream ended and Katsuki was left in silence. </p>\n<p> </p>\n<p>“Discord…?” Katsuki mumbled, scrolling back down to see Deku’s bio. </p>\n<p> </p>\n<p>It had all of his social media links, which Katuski was for sure going to look through later. And then there it was, the link to whatever the Hell this discord thing was.</p>\n<p> </p>\n<p>Katuski clicked on it and it immediately opened a second window. Ah, of course. He needed to sign up.</p>\n<p> </p>\n<p>After a few minutes he made his account, linked his twitch, got the desktop app for it as well, and he was all set to join whatever this weird app was.</p>\n<p> </p>\n<p>Deku’s Nerd Zone was the name of the server. Extremely fitting. </p>\n<p> </p>\n<p>With his account linked to his Twitch he saw his name was a unique color in the server as well. Must be some special thing for donors? He wasn’t sure. But what he was sure or was the ping sound he heard as he got a DM.</p>\n<p> </p>\n<p>“Who the fuck is messaging me? I just got this stupid account.”</p>\n<p> </p>\n<p>Annoyed, Katsuki clicked on the icon and then he saw it. There was no fucking way.</p>\n<p> </p>\n<p>—————</p>\n<p>Deku: (ﾉ◕ヮ◕)ﾉ*:･ﾟ✧ Hey! I’m assuming this is the same Kaboom from my stream?</p>\n<p>KaboomKing: Yep</p>\n<p>Deku: ヽ(゜∇゜)ノ wonderful! I just wanted to thank you again! I don’t really talk about this on stream cause it’s kinda a downer but my moms been sick lately so she can’t go to work as often. So I’ve been paying for her doctor bills and some of her rent, along with college and my own rent. So I’ve been pretty stressed out this month haha (o´ω｀o) so you hella saved me there!</p>\n<p>Deku: Sorry that’s kinda a downer. But idk, I thought you had the right to know where your money is going and another big thank you!! </p>\n<p>Deku: ôヮô I’m so shocked you gave so much too when it’s your first stream you’ve seen of mine! </p>\n<p>—————</p>\n<p> </p>\n<p>Katsuki stared at the message in complete and utter shock. His mom was sick? How sick? What was happening? Was it bad? And how the hell was this guy still so fucking sweet even now?! Was it wrong to ask? He should probably wait and ask another time, that seemed like a touchy subject.</p>\n<p> </p>\n<p>Katuski felt a lump in his throat, he had no idea how to even respond. He didn’t even expect the freckled boy to message him! He hadn’t thought any further if the two were to actually fucking talk! Fuck!!</p>\n<p> </p>\n<p>Calm down Katsuki. Calm down. He’s just a cute guy on the internet. No big deal. You’re fucking DynaMight!! Japan's number one hero! You can talk to a cute guy! It’s fine! This is fine!</p>\n<p> </p>\n<p>—————-</p>\n<p>Deku: Sorry I ramble a lot. You just seem like such a kind person, idk. Made it seem easy to talk to after what you did. Sorry if I’m assuming ┐(‘～`；)┌</p>\n<p>—————-</p>\n<p> </p>\n<p>This was not fine!!</p>\n<p> </p>\n<p>Why was he so sincere in everything he said? And absolutely adorable?! Fuck!</p>\n<p> </p>\n<p>—————</p>\n<p>KaboomKing : No it’s fine. I liked what you had to say about DynaMight and other shit.</p>\n<p>KaboomKing: just got off a 16 hour shift and your stream kinda helped perk me up after the shit I had to deal with today. It was one big fucking mess so your peppy little nerd ass was kinda just what I needed. Felt like you deserved a tip for helping keep me sane.</p>\n<p>—————-</p>\n<p> </p>\n<p>It wasn’t a lie. Katsuki had one hell of a day and all he wanted to do was crawl into bed and physically evaporate so he no longer had a physical form. Hero work was shit sometimes and exhausting. </p>\n<p> </p>\n<p>Seeing how excited those gorgeous ocean green eyes were as he talked about Katsuki made it all worth it though.</p>\n<p> </p>\n<p>—————-</p>\n<p>Deku:  Oh!!! Oh wow!! I’m honestly so glad I could make your night somehow! That’s such a big honor omg. (◕﹏◕✿) you’re gonna make me emotional again!</p>\n<p>Deku: I’m so sorry you had a bad day Kaboom (╥_╥) you seem like such a sweet person, you really don’t deserve that. </p>\n<p>Deku: I don’t usually talk to my viewers since a lot of them can get kinda weird. But I saw you in chat telling people to stop being creepy, and after all the kindness you gave me today I felt like I just HAD to talk to you! And then you joined my server so! Bam!!</p>\n<p>Deku: if you wanna vent about your day I’m all ears, honestly. It’s the least I can do for all the kindness you’ve offered.</p>\n<p>—————</p>\n<p> </p>\n<p>This guy! There’s no way someone this sweet could possibly exist. Dude was like if sugar was in human form. He was so damn sweet and genuine in everything he did and said. It made Katsuki’s stomach feel all kinds of weird.</p>\n<p> </p>\n<p>————-</p>\n<p>KaboomKing: Wow. Are you even real? There’s no fucking way someone as nice as you fucking exist. This some kinda act? Am I being pranked?</p>\n<p>Deku: fjjsjfjsjfjebajs oh!! Haha this is just how I am! I’m sorry fjejfjsjdhsjxmfk </p>\n<p>KaboomKing: You actually wanna hear me bitch about my day? Don’t you need to eat dinner?</p>\n<p>Deku: oh don’t worry! I ran of the conbini and got dinner (ノ・ω・)ノ</p>\n<p>KaboomKing: You… went to the conbini? You didn’t make dinner?</p>\n<p>Deku: I’m kinda a real bad cook, I’ll be honest. I try my best but I can only make basic stuff. So the conbini is the best answer most days. Plus I don’t eat too much anyways. </p>\n<p>KaboomKing; The fuck??? You should be eating better! Going to the damn conbini this late. That’s not only dangerous but you need a proper cooked meal you dickhead</p>\n<p>Deku: (◕︵◕) weeeeh Kacchan scary!</p>\n<p>KaboomKing: Kacchan???</p>\n<p>Deku: Thought it might be cute. Idk. You need some kinda nickname since Kaboom isn’t exactly a name. So I shortened it to Kacchan (ﾉ◕ヮ◕)ﾉ*:･ﾟ✧</p>\n<p>KaboomKing: That’s so dumb</p>\n<p>Deku: Awww… well I don’t gotta use it</p>\n<p>KaboomKing: Naw. Use it. I don’t fuckin care</p>\n<p>Deku: Kacchan it is then! (✿◠‿◠)</p>\n<p>—————-</p>\n<p> </p>\n<p>Katsuki’s face was burning up. Sure as a kid he has been called Kacchan but other kids, but reading it now as a grown adult? Given to him by some cute nerd? It felt so different. </p>\n<p> </p>\n<p>Some weird feeling rose in Katsuki, wanting to make the nerd proper meals, walk him to the store so he’d be safe, make sure he was healthy and fine.</p>\n<p> </p>\n<p>Fuck he was in deep.</p>\n<p> </p>\n<p>—————-</p>\n<p>Deku: So about your bad day, what exactly happened? I don’t mean to pry. </p>\n<p>KaboomKing: It’s fine. I work for a big company, and we gotta do a lot of physical shit along with paperwork. So I was busy doing a ton of labor intensive BS all day then once that was over and I thought I could finally go home and rest my sore muscles I got tossed a stupidly huge amount of paperwork.</p>\n<p>KaboomKing: It fucking felt endless. I was trapped there for 3 more hours just filling out stupid shit. And I know for a fact there’s gonna be more on my desk when I get there tomorrow. Because of fucking course there is.</p>\n<p>KaboomKing: So by the time I got home I wanted to physically melt into my bed and forget I existed</p>\n<p>Deku: Oh god. That sounds like an absolute nightmare to deal with!</p>\n<p>KaboomKing: yeah. It is. I got into this job and didn’t once think there’d be so much stupid paperwork. </p>\n<p>KaboomKing: it’s not that I can’t fuckin do it. Cause I can. I’m amazing! But sitting and doing that shit for hours when I could be using my time to be out in the field is some BS!</p>\n<p>Deku: So you prefer hands on work instead?</p>\n<p>KaboomKing: Damn right! I’m strong and can do more with my hands!</p>\n<p>Deku: hfjwjdjsj </p>\n<p>KaboomKing: What???</p>\n<p>Deku: Sorry! It’s laughing basically!</p>\n<p>KaboomKing: I know! But what are you laughing at??</p>\n<p>Deku: I don’t know, just something about that sentence made me giggle. It’s kinda cute in a funny way. Fienjfjwjrw</p>\n<p>—————-</p>\n<p> </p>\n<p>Cute…? Deku thought something he did was cute? Oh if Katsuki wasn’t blushing before he sure as hell was now!! Oh he was SO fucked!</p>\n<p> </p>\n<p>————-</p>\n<p>KaboomKing: Cute?</p>\n<p>Deku: Oh sorry!! That might be weird to you! </p>\n<p>Deku: (⊙﹏⊙✿) I didn’t mean it in a mean way! Or was trying to make this weird!</p>\n<p>KaboomKing: Nah, you’re fine. Just not use to people calling shit I do “cute”</p>\n<p>Deku: What do people usually say?</p>\n<p>KaboomKing: That I’m scary.</p>\n<p>Deku: Really…?</p>\n<p>KaboomKing: Yep. I’m 6’3, and constantly have a pissed off look on my face. I swear a lot and don’t usually care what people think of me. So people tend to be intimidated.</p>\n<p>Deku: hmmm…. Well, you seem perfectly nice to me. And very sweet. </p>\n<p>Deku: it’s not often that people yell at my twitch viewers to stop being creepy. Even my mods can be a little scared to do it haha</p>\n<p>KaboomKing: I have 0 energy for fuckheads </p>\n<p>Deku: That's quite the word!</p>\n<p>KaboomKing: I have a lot of 'em.</p>\n<p>Deku: I can tell~</p>\n<p>————</p>\n<p> </p>\n<p>What the fuck was happening? Was this flirting? No, there’s no way. No. This is just Deku being nice. Don’t read too into it. Just calm the fuck down Katsuki.</p>\n<p> </p>\n<p>With a deep inhale, Katsuki looked over at the clock, 9:23. It was getting late and Katsuki needed to sleep. He really enjoyed talking to this guy, which was rare for him. Most people pissed him off or were annoying. Even his best friend was someone he mostly put up with.</p>\n<p> </p>\n<p>—————</p>\n<p>KaboomKing: Yo, nerd ass. I need to get some sleep. Was actually nice talking to you. Most people honestly annoy me but you’re not too bad. Might poke your brain more on quirk stuff if you don’t hate that idea.</p>\n<p>Deku: (｡♥‿♥｡) Waaaah really?! That’d be amazing! Alright Kacchan, sleep well! Get lots of good sleep. You deserve it.</p>\n<p>KaboomKing: Night nerd</p>\n<p>—————-</p>\n<p> </p>\n<p>With that, Katsuki powered off this computer and moved to bed. This wasn’t at all how he thought his night was gonna go but here he was. </p>\n<p> </p>\n<p>All he could think about were those gorgeous viridian eyes and that soft tangle of hair. He wondered how many freckles the boy had. How long it’d take to count each individual one, watching Deku giggle as he got close to count. His cheeks red from embarrassment. Those long dark lashes fluttering each time he let out a giggle.</p>\n<p> </p>\n<p>Katsuki was in deep, but lucky for him. He was a good swimmer. </p>\n<p>Izuku Midoriya, your average quirkless 22 year old that attended college. He was a great student with a 4.0, he’d gained praise from all of his teachers for how bright his mind is. He was smart, analytical, and good at reading people.</p>\n<p> </p>\n<p>So tell him why some guy that he met in his stream made his brain turn to mush and his hands tremble at each message he sent. Who the hell was KaboomKing and why did he randomly decide to stop by his stream and drop so much money?!</p>\n<p> </p>\n<p>Izuku laid in bed, his mind going a mile a minute. He was so extremely grateful for what the stranger had done, and honestly couldn’t thank him enough. It was perfectly reasonable to DM someone that did something so generous. But what he wasn’t expecting was for the two to hit it off so easily. Kacchan swore a lot, sure. But he was funny and pretty easy to talk to all things considered. </p>\n<p> </p>\n<p>Izuku had always struggled to talk to people, most people tended to scare him or were just plain rude to him. Especially after finding out he was quirkless. Growing up wasn’t exactly easy because of it, but as an adult he’s tried to own it. Sure he couldn’t be a hero in the sense he wanted but he was pretty happy with his life now. He had grown an equally nerdy audience and they all accepted him for his quirklessness. And anytime someone came into chat to spout bigotry his audience was quick to shut it down.</p>\n<p> </p>\n<p>Izuku sighed, rolling around in his bed. He didn’t think his life was gonna turn out like this, but here he was. He was happy. Even if his dear mom was sick, she was slowly getting better and improving each day. Things were gonna be okay.</p>\n<p> </p>\n<p>Wrapping himself in his sheets, Izuku slowly closed his eyes to get some sleep.</p>\n<p> </p>\n<p>—————-<br>6:10am KaboomKing: Hey nerd ass, you up?<br>7:40am KaboomKing: I’m off to work, pray it's not another shit day.<br>8:22am KaboomKing: Damn bitch you sleep late.<br>9:15am KaboomKing: The fuck<br>10:34am Deku: Kacchan! Sorry! Haha! Ôヮô class doesn’t start until around 11am for me<br>10:35am Deku: Wow you woke up early!! (●⌒∇⌒●)<br>10:37am KaboomKing: Yeah, I go to the gym when I wake up. Less people there to annoy me.<br>10:39am Deku: Whoa!! （☉∀☉） You go to the gym that early? And after you wake up?!<br>10:42am KaboomKing: Duh. I gotta stay fit, dork ass. Not all of us are scrawny nerds.<br>—————-</p>\n<p> </p>\n<p>Izuku couldn’t help but feel his face heat up. He remembered from last night that Kacchan had mentioned being tall and having a physical job. But the guy was buff too? What did he even look like? Izuku couldn’t help but wonder who this mysterious man was.</p>\n<p>—————-<br>Deku: Excuse you! I’ll have you know I work out!<br>KaboomKing: Oh yeah? Doing what? Lifting pens for your nerd shit?<br>Deku: Ruuuuude! o(≧o≦)o I go to the gym a few times a week!<br>KaboomKing: A few times a week? Weak shit<br>Deku: Hey! I’m busy most days with school, streaming, and checking in on my mom ⋋_⋌<br>Deku: I only have so many hours in the day, we can’t all be you mister swol<br>KaboomKing: Alright, that got a laugh out of me.<br>KaboomKing: Fuck you.<br>Deku: (◡ω◡✿) one point to Deku, zero points to Kacchan<br>KaboomKing: Fuck you x2<br>Deku: ლ(╹ε╹ლ) You gonna fight me now?<br>KaboomKing: I’d absolutely destroy your nerd ass<br>Deku: Naw, I’d win. <b>◕3◕ </b> <b><br></b> KaboomKing: Hah?! I’ve SEEN you on stream. You’re so scrawny! How tall even are you?<br>Deku: (*~▽~) uhhhh<br>KaboomKing: uhhhh?<br>Deku: (´ー｀) um<br>KaboomKing: You gonna say? Or just keep me waiting?<br>Deku: 5’5…………<br>KaboomKing: You’re shitting me.<br>Deku: (ᅌᴗᅌ* )<br>KaboomKing: You’re so fucking short.<br>Deku: ಥ_ಥ I’m not! I’m just a little below average is all.<br>KaboomKing: Y’know what they call that right? Short.<br>Deku: Oh shut up, Mr. 6’3. Not all of us can be tall ☉▵☉凸<br>KaboomKing: What the fresh hell is that emoji even???<br>Deku: ☉▵☉凸  ☉▵☉凸   ☉▵☉凸<br>KaboomKing: Oh fuck off<br>Deku: No~ (◕‿-)<br>—————-</p>\n<p> </p>\n<p>Izuku couldn’t help but giggle as he typed to Kacchan in his DM’s. The stranger was pretty funny and had a rather short temper, which honestly only made Izuku laugh more. He didn’t have any fear talking to Kacchan since he was so playful, so the snarky angry comments just filled Izuku’s heart.</p>\n<p> </p>\n<p>He was usually so anxious around people and tended to keep to himself. But for some reason Kacchan helped him be more himself, open up some and even show off his sassy side.</p>\n<p> </p>\n<p>—————-</p>\n<p>Deku: Alright, Kacchan. I gotta go for a bit. My train is nearly at my stop.<br>KaboomKing: Wait<br>Deku: Huh?<br>KaboomKing: Did you eat breakfast?<br>—————-</p>\n<p> </p>\n<p>Izuku’s face started to heat up at that. Did… Did Kacchan care? Was he worried about Izuku?</p>\n<p> </p>\n<p>—————-<br>Deku: Uhhhh about that. Haha<br>KaboomKing: Are you shitting me right now Deku?!<br>Deku: Listennnnn<br>Deku: I was busy! And didn’t have time!<br>KaboomKing: Excuses<br>Deku: o(╥﹏╥)o Weeeeh Kacchan scary<br>KaboomKing: Kacchan gonna shove his foot up your ass if you don’t eat!<br>Deku: ┐(‘～`；)┌ I don’t even eat at this time thouuuugh. I always end up eating when I get home.<br>KaboomKing: Which is when…?<br>Deku: u-uhhh<br>Deku: Like 8pm<br>KabomKing: WHAT<br>Deku: Oh geez, my train is here. Man. I uhhh gotta go. Talk to you later Kacchan (●´ω｀●)<br>KaboomKing: FUCKER!!! NO!! GET BACK HERE!!<br>KaboomKing: Are you fucking telling me you eat ONCE a damn day?!<br>KaboomKing: DEKU I WEAR TO FUCKING GOD!<br>KaboomKing: I’m gonna fucking doordash you food or something what the FUCK!!<br>KaboomKing: When you get back you’re gonna have HELL to pay!!<br>Deku: ♥<br>KabomKing: YOU MOTHERFUCKER<br>—————-<br><br></p>\n<p>Katsuki ran his hands down his face, staring at his phone. Unbelievable! So his fears were correct, the nerd IS indeed terrible at taking care of himself. Now his next worry was if he was properly sleeping if he already didn’t eat well. He had noticed bags under his eyes when he was streaming but he didn’t pay too much mind to it, figuring maybe it was just discoloration or maybe that specific night he didn’t sleep.</p>\n<p> </p>\n<p>But now he was starting to wonder. After all, Deku did say he was extremely busy. Between school, streaming, checking in on his mother, and still making time to work out, the dudes schedule was ridiculous.</p>\n<p> </p>\n<p>His classes also went on pretty late, it got Katsuki wondering what the little nerd was studying for. What job did he want after college, what plans did he have for his future? And fuck why did Katsuki care so much?!</p>\n<p> </p>\n<p>Whatever. Those were questions for later. He needed to get back to work.</p>\n<p>-------</p>\n<p> </p>\n<p>Izuku tucked his phone into his pocket and made his way to class. He couldn’t help but smile at how much Kacchan seemed to care. They had only met yesterday but the guy seemed so kind to him, and he didn’t know why. He remembered how Kacchan had said other people found him scary, which only made his nickname cuter. He was imagining some buff 6’3 man with angry fiery eyes and a scowl on his face answering back to Kacchan. The thought alone made Izuku nearly burst out laughing, it was too precious.</p>\n<p> </p>\n<p>The man may have said he intimidated people, but all Izuku could see was a gentle giant. A gentle giant that swore a lot however. Like a wild wolf that could rip out your throat, but also liked belly rubs and was very protective. Izuku giggled at the thought.</p>\n<p> </p>\n<p>------</p>\n<p> </p>\n<p>Most of the day had gone by in utter boredom. Katsuki took down some low level villains and over all not much had happened. Which to most heroes would be a good thing, but for Katsuki it was absolute hell. And not only that but the cute green bean he had started talking to was busy in class doing who knows what, so he couldn’t even annoy him.</p>\n<p> </p>\n<p>Since yesterday his thought were filled by those stupid ocean green eyes, those dumb freckles that spread across his tanned cheeks, the way his hair bounced around while he talk, his-</p>\n<p> </p>\n<p>“Hey, DynaMight!” Katsuki was snapped out of his train of thought.</p>\n<p> </p>\n<p>“Shitty hair…” Katsuki growled.</p>\n<p> </p>\n<p>“Hey! Its Red Riot! C’mon man.” Kirishima sighed, though he didn’t look annoyed. Honestly, he rarely ever did. Dude was like sunshine if it was a person. “You looked distracted, you okay?”</p>\n<p> </p>\n<p>“Yep. Just bored out of my damn mind is all.” Katsuki grumbled as the two patrolled. Today was too damn slow for Katsuki’s liking. Hell at this rate he’d prefer to be home taking a nap or at the gym.</p>\n<p> </p>\n<p>“Well, a slow patrol is a good sign! Means there isn’t a lot of villain activity so civilians are safe.” Kirishima beamed, his brightness nearly blinding. God, fuck that guy.</p>\n<p> </p>\n<p>“Whatever.” Was all that Katsuki said, trying to keep his mind sharp. It was then that his phone started buzzing.</p>\n<p> </p>\n<p>Katsuki pulled his phone from his pocket and checked his messages. He was well aware he shouldn’t while on patrol, but he figured hey, fucking nothing is happening and he might have a message from that damn nerd.</p>\n<p> </p>\n<p>—————-<br>Deku: Alright alright, here. Happy?<br>Deku: [Attached is a picture of Katsudon]<br>Deku: [Attached is a selfie]</p>\n<p>\n<img src=\"https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/39877eee-ef02-4b06-83ae-f41eff3e7878/denmknm-faacc9bc-c949-4380-9ecd-11fd15b14700.png/v1/fill/w_702,h_1138,q_70,strp/selfie_2_by_rad_pax_denmknm-pre.jpg?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOjdlMGQxODg5ODIyNjQzNzNhNWYwZDQxNWVhMGQyNmUwIiwiaXNzIjoidXJuOmFwcDo3ZTBkMTg4OTgyMjY0MzczYTVmMGQ0MTVlYTBkMjZlMCIsIm9iaiI6W1t7ImhlaWdodCI6Ijw9MjA3NCIsInBhdGgiOiJcL2ZcLzM5ODc3ZWVlLWVmMDItNGIwNi04M2FlLWY0MWVmZjNlNzg3OFwvZGVubWtubS1mYWFjYzliYy1jOTQ5LTQzODAtOWVjZC0xMWZkMTViMTQ3MDAucG5nIiwid2lkdGgiOiI8PTEyODAifV1dLCJhdWQiOlsidXJuOnNlcnZpY2U6aW1hZ2Uub3BlcmF0aW9ucyJdfQ.yy7LCoIv6bBdPIYf1fjjqj71Ptnp7o8_0woncZs6UQo\" alt width=\"415\" height=\"673\">\n</p>\n<p>Deku: I’d usually study through lunch but because sooooomeone got upset…<br>Deku: I decided to actually get lunch this time.<br>—————-</p>\n<p> </p>\n<p>Katsuki stared at his phone for a few moments, looking at the photos that Deku had sent. He looked too damn cute. And now that Katsuki could get a close up picture of him instead of the shitty webcam Deku had been using he could see even MORE details.</p>\n<p> </p>\n<p>Deku had even more freckles than Katsuki had been able to see last night, his eyelashes were a mish mash of dark green and black, all of them extremely long. It made his already gigantic eyes much more pronounced on his face. Deku had a pretty andorgoynous face because of it. It made him honestly look like he had makeup on, but Katsuki figured it was all natural. Hell, makeup might just be overkill with how pretty he’d look. Oh no, now Katsuki’s mind was wondering…</p>\n<p> </p>\n<p>Katsuki’s heart was fluttering in his chest from the images. He was glad Deku took his threat- I mean words to heart and actually grabbed some food. The guy was too scrawny for his own good, and needed some meat on his bones.</p>\n<p> </p>\n<p>—————-</p>\n<p>KaboomKing: You got rice on your face, nerd ass.<br>Deku: (◕︵◕) Weeeh I didn’t even notice!<br>KaboomKing: That’s why you need me. Point out rice and other shit on your nerd face.<br>Deku: (●´ω｀●) Guess I’ll keep Kacchan around then~<br>KaboomKing: You guess? Tch.<br>Deku: ヾ(〃^∇^)ﾉ Not entirely sure yet. Maybe you’re secretly a serial killer! Dun dun dun!<br>KaboomKing: I wouldn’t waste my time on a nerd like you if I was<br>Deku: Saying I’m not worth killing? (◕︵◕)<br>KaboomKing: Nope<br>Deku: How cruel. Or kind? Hmmm….<br>KaboomKing: I’ll let you think on that one.<br>Deku: Wow, thanks.<br>Deku: How's work by the way?<br>KaboomKing: Boring as shit. Nothin’ is happening so I’m just wandering around with shitty hair.<br>Deku: Shitty hair???<br>KaboomKing: A co-worker of mine. I GUESS he’s my friend or whatever.<br>Deku: Why do you call him shitty hair???<br>KaboomKing: Cause his hair is shitty, you see.<br>Deku: Oh, of course of course. Makes sense.<br>KaboomKing: Yep. I’m a genius with nicknames. I know.<br>Deku: Oh truly. What a big brain you have Kacchan.<br>KaboomKing: The biggest.<br>Deku: So you’re saying you have a big head..?<br>KaboomKing: Oh fuck you.<br>Deku: ﾍ(￣▽￣*)ﾉ hehehehehe<br>Deku: I’m slowly painting a picture of how Kacchan might look.<br>Deku: Tall, muscular, and a giant head.<br>Deku: Very unique looking person.<br>KaboomKing: Fuck you x2!<br>KaboomKing: I’m fucking hot, I’ll have you know.<br>Deku: mmmmmm sure~~<br>KaboomKing: Your ass is grass, Deku!<br>Deku: Um! Actually my HAIR is grass.<br>KaboomKing: Alright, fuck you again. That actually made me laugh.<br>KaboomKing: And now shitty hair is wondering what the fuck I’m laughing at.<br>KaboomKing: I fucking hate you<br>Deku: ★~(◡‿◕✿) So you say~</p>\n<p>—————-</p>\n<p> </p>\n<p>Katsuki let out another soft chuckle, Kirishima squinting more at his friend. This was something entirely new for the redhead to witness. Was Katsuki seriously laughing at something? Not just his usually threatening laugh he did at villains, no. A genuine soft laugh.</p>\n<p> </p>\n<p>“S-so…:” Kirishima clears his throat. “Whatcha laughin’ at? Something funny on your phone?”</p>\n<p> </p>\n<p>That brought Katsuki back to reality. He angrily shoved his phone back into his pocket and shot daggers at the redhead. </p>\n<p> </p>\n<p>“It's none of your business shitty hair.” Katsuki growled.</p>\n<p> </p>\n<p>“Ah, sorry man. I just haven’t seen you so… well.” Kirishima tried to pick his words carefully. “Soft I guess?”<br><br>“Soft?!”<br><br>Clearly the wrong wording! Oh no! “Well, like. I only ever hear you laugh when you’re about to win a battle, or taunting your enemy.”</p>\n<p> </p>\n<p>“Hah?! I laugh at other shit too!”</p>\n<p> </p>\n<p>“Not from what I’ve heard!” Kirishima waves his arms in front of his face, the man looking nervous. “Sorry, I’m just a little shocked is all. Kinda curious what would make my friend look so gentle.”</p>\n<p> </p>\n<p>“Fuck off. I don’t look fuckin’ gentle or whatever the fuck it is you’re on about. Your brain really is just full of hair if you think I’m actin’ soft or gentle. Fuck off with that.”</p>\n<p> </p>\n<p>Kirishima lets out a soft laugh. “Alright, alright.” He clearly wasn't getting any answers this way. Might as well drop the issue for now.</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>Stretching out his back, Izuku was finally done for the day with class and he could go home and relax a bit before studying more. It was exhausting but it’d all be worth it. </p>\n<p> </p>\n<p>The greenette stood and gathered his things before heading to the bus station, but before he was even out the door he heard that familiar notification sound.</p>\n<p> </p>\n<p>—————-<br>KaboomKing: You done with class now?<br>Deku: Yep~! ★~(◠‿◕✿) Heading to the train now.<br>KaboomKing: By yourself?<br>Deku: Yeah, haha<br>KaboomKing: Why not get a friend to walk with you?? Kinda dangerous.<br>Deku: Oh<br>Deku: Well uhhh<br>Deku: See that’s the thing is uhh<br>Deku: I don’t really have any friends haha<br>KaboomKing: Hah…???<br>Deku: Like<br>Deku: I know people, but none of them are really my friends?<br>Deku: No one really talks to me outside of class.<br>KaboomKing: Fucking why???<br>Deku: Idk. Maybe cause I’m quirkless? Maybe cause I talk too much?<br>Deku: Maybe they just find me annoying, haha.<br>Deku: But like<br>Deku: Its fine!<br>Deku: I’m honestly pretty use to it so I don’t really mind.<br>KaboomKing is typing…..<br>KaboomKing is typing……..<br>—————-<br><br>Katsuki’s hands hovered over his phone's keyboard. What the fuck do you say in this kinda situation? He was never good with feelings, let alone helping people with THEIR feelings.<br>But fuck.</p>\n<p> </p>\n<p>And one thing that kept pulling at him. “Maybe cause I’m qurikless?”</p>\n<p> </p>\n<p>Was Deku bullied for being quirkless? Shit of course he was. Katsuki wasn’t an idiot. Back in school he used to pick on the very few quirkless kids he knew. He was pretty relentless about it too. The thought made Katsuki’s stomach turn, he imagined soft emeralds staring up at him. Tears running down soft freckled cheeks.<br><br>“Kacchan… Why are you being so mean?” The smaller boy would cry out, trying his best to seem tough.<br><br>“Quirkless Deku, can’t even protect himself!” The blonde would laugh, shoving the greenette to the ground.</p>\n<p> </p>\n<p>In another lifetime, another world, Katsuki would have been his bully. Would have treated the poor kid like shit. And he knew it. </p>\n<p> </p>\n<p>During his second year of high school Katsuki had started anger management and therapy to help with his emotional state. It did him a lot of good, even if the entire experience sucked. But he needed it. He needed to be told his behavior was shit and he needed to improve.</p>\n<p> </p>\n<p>And Katsuki was never one to half ass something, even if it was just therapy. And improve he did. He wasn’t perfect by any means, but he was a hell of a lot calmer now in his 20’s. He didn’t snap at people as much, he could calm down far easier. He wanted to be a better person than he was as a kid. </p>\n<p> </p>\n<p>Katsuki stared down at his phone, swallowing the lump in his throat and decided to ask a question he might regret.</p>\n<p> </p>\n<p>—————-<br>KaboomKing: Were you bullied as a kid for being quirkless?</p>\n<p>Deku is typing…….</p>\n<p>—————-</p>\n<p>—————-<br>KaboomKing: Were you bullied as a kid for being quirkless?</p>\n<p>Deku is typing…….<br>Deku is typing…….</p>\n<p>Deku: Yeah… haha<br>Deku: Actually, that’s where I got the nickname.<br>KaboomKing: Huh??<br>Deku: The name Deku. My actual name can be read like that, so uh…<br>Deku: A few kids started calling me Useless Deku<br>Deku: Since Deku means useless… haha<br>—————-</p>\n<p> </p>\n<p>Katsuki’s heart sank. Why the hell was this guy using Deku as a nickname when it was what his bullies used to call him? What the fuck was wrong with him?!</p>\n<p> </p>\n<p>—————-<br>KaboomKing: Why would you keep going by Deku then?<br>Deku: Well, I wanted to turn it into a positive.<br>Deku: Prove to them that I wasn’t useless or worthless.<br>Deku: A lot of the kids were pretty relentless. One in particular really hated me.<br>Deku: I used to carry around notebooks that I’d fill with analysis on quirks and heroes.<br>Deku: I’d spent most of my time writing in them.<br>Deku: One day some of the kids came by and threw one of them out the window.<br>Deku: One kid even told me to off myself.<br>Deku: It wasn’t exactly… easy…<br>Deku: But I’m in a lot better place now, and I’m okay with not having a quirk!<br>Deku: I found other ways I could help people, so it's fine now!<br>—————-<br><br>There was something about how Deku typed. Like he was lying to himself just to keep going. The greenette clearly wasn’t fine, and clearly still wanted to be a hero and have a quirk. Katsuki may be bad with emotions but he wasn’t stupid. Deku wanted something far beyond what he could have, and that alone broke Katsuki’s heart.</p>\n<p> </p>\n<p>Deku was so open and honest. But he also didn’t want others to feel bad or pity him. He wore his heart on his sleeves, but even then… He clearly kept a wall up for others. </p>\n<p> </p>\n<p>Katsuki couldn’t help but feel drawn to this man, like fate itself was pulling him closer and closer. He wanted to know more about the pretty green haired boy, he wanted to know his thoughts and feelings. He couldn’t explain it but something about him just beckoned him closer and closer.</p>\n<p> </p>\n<p>Without even properly thinking, Katsuki started to type.<br><br>—————-<br>KaboomKing: It's not fine.<br>Deku: Excuse me?<br>KaboomKing: You’re not fine with it. I can tell.<br>KaboomKing: Deku, its okay to be upset at this kinda shit.<br>KaboomKing: You don’t gotta act like it doesn’t suck.<br>KaboomKing: It's okay to not be okay.<br>—————-</p>\n<p> </p>\n<p>Izuku stared at his phone in absolute shock. For a second he was mad, he felt a little betrayed at Kacchan for saying something like that. But then he felt… almost relieved? Relieved that someone could see past his bullshit and understand something that even Izuku didn’t fully grasp about himself.</p>\n<p> </p>\n<p>Izuku rubbed at his eyes trying to get the tears to stop as he made his way to his train. No sense worrying strangers cause he was crying on the train, that’d just be rude. And probably a little weird.</p>\n<p> </p>\n<p>With a shaky breath, Izuku tried to gather his thoughts. What do you even say in this situation? “No I’m fine.” “Well duh its okay not to be okay.” “Shut up.” </p>\n<p> </p>\n<p>—————-<br>Deku: Yeah…</p>\n<p>Deku: I uh…<br>Deku: That easy to tell huh?<br>KaboomKing: You’re clearly very passionate about heroes.<br>KaboomKing: You’re allowed to be pissed off at the world, Deku<br>KaboomKing: Hell I know I would be<br>Deku: Yeah…<br>Deku: I use to try and test out different things to see if I could summon a quirk haha<br>Deku: I’d try to breathe fire (cause my dad can) or levitate things (cause my mom can)<br>Deku: I’d read up on how other people’s quirks appeared and would try doing what they did.<br>Deku: How lame is that? haha<br>KaboomKing: It's kinda cute.<br>—————-<br><br>Izuku nearly dropped his phone at that. Cute…? Cute?! He thought the dorky stuff he did as a kid was cute?! For real?!</p>\n<p> </p>\n<p>Izuku’s entire face was bright red as he stared down at his phone. He couldn’t believe what he’d just read. It was probably just some silly comment, don’t think too into it. You JUST met the guy and he’s just being polite. Calm DOWN Izuku!!</p>\n<p> </p>\n<p>—————-<br>Deku: I wouldn’t exactly call it “cute”, maybe pathetic.<br>KaboomKing: I’m imagining a young Deku with wild green hair everywhere, probably in some All Might t-shirt, running around trying to activate a quirk. Probably tripping on his own feet and getting skid marks everywhere.<br>Deku: That’s… Actually extremely accurate.<br>KaboomKing: Hah<br>Deku: Hah?<br>KaboomKing: It's just kinda cute to think about.<br>Deku: What about you? What were you like as a kid?<br>KaboomKing: I was a shithead.<br>KaboomKing: I bullied kids that didn’t deserve it, I was loud and too proud for my own good.<br>KaboomKing: Got to go through the joy of “gifted child burn out” in my teens.<br>Deku: You were a “gifted child”?<br>KaboomKing: Yep. Had perfect grades I barely had to work for, a pretty cool quirk I could show off, and everyone praised me for everything I did.<br>KaboomKing: Made me into a real shithead.<br>KaboomKing: Around high school I was forced into anger management and therapy for my shit behavior.<br>KaboomKing: Its not perfect per se, but I’m doing a lot better than I was as a kid.<br>Deku: You seem nice to me (ノ・ω・)ノ<br>KaboomKing: I’m nicer to you.<br>—————-<br><br>Oh God. There it is. Those words that make Izuku’s stomach do backflips inside of him. Nicer to me?! What does that even mean?!</p>\n<p> </p>\n<p>Izuku’s mind was going a million miles per hour, in his chaotic brain fog he nearly missed his stop and quickly ran out of the train. The cool winter air was a blessing from how embarrassed Izuku felt, his face now bright red. He didn’t even know much about Kacchan but every time they talked his stupid heart felt like it was going to explode.</p>\n<p> </p>\n<p>He never would have thought the nice donor he met yesterday in his stream would keep talking to him, let alone be so interesting and make Izuku’s heart flutter in his chest every time he got a notification.</p>\n<p> </p>\n<p>Just calm down Izuku. Don’t be stupid. Be rational. You barely know this guy so there’s no point in getting a crush on some stranger you just met. That’d just be dumb.</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>Izuku had finally made it to his apartment after a short 15 minute walk in the cold. It honestly did him some good to just breathe and calm down from his and Kacchans conversation. Izuku entered his apartment, and slowly took off his shoes and sat down his backpack.</p>\n<p> </p>\n<p>“I’m home.” The greenette called out to no one.</p>\n<p> </p>\n<p>He wasn’t sure why he did this. Maybe a habit from living with his mom? Maybe it just made him feel less alone? Who knows.</p>\n<p> </p>\n<p>Izuku opened up his phone to see he had a few missed messages from Kacchan, and noticed the poor guy seemed a little worried by the silence.<br><br>—————-<br>KaboomKing: You good?<br>KaboomKing: Did you get murdered or something..?<br>KaboomKing: Hello…?<br>Deku: Sorry! I was walking back home from the train, didn’t mean to worry you!<br>KaboomKing: Tch, I wasn’t worried.<br>Deku: yeaaaah, sure. (ΘεΘ)<br>KaboomKing: Anyways!<br>KaboomKing: You better not forget to eat dinner, idiot.</p>\n<p>—————-</p>\n<p> </p>\n<p>Izuku honestly hadn’t even thought about dinner. He was busy thinking about the assignments he needed to finish, plans for his next stream, and other work that desperately needed done.</p>\n<p> </p>\n<p>Izuku stared at the time. 8:35. It was already getting pretty late, but he could probably go to the conbini and pick up a simple dinner. Maybe just a few rice balls and coffee.<br><br>—————-<br>Deku: I honestly hadn’t even thought about dinner aaa<br>KaboomKing: Are you serious?!<br>Deku: Was thinking about homework I gotta do and stream stuff haha<br>KaboomKing: The fuck are you even studying at school??<br>Deku: Oh!<br>Deku: I’m gonna be a nurse (ﾉ◕ヮ◕)ﾉ*:･ﾟ✧<br>KaboomKing: A nurse?<br>Deku: Yeah! Since I’m quirkless I figured I could save lives another way (^▽^)</p>\n<p>—————-</p>\n<p> </p>\n<p>Katsuki was in the locker room of the HQ he worked at, now changing back into his civilian clothes. He stared down at his phone, picturing Deku in cute nurse scrubs. Wafting about the hospital to help those in need, bringing the brightest smile in the world to the sick.</p>\n<p> </p>\n<p>The thought brought a soft smile to Katsuki’s face. </p>\n<p> </p>\n<p>—————-<br>KaboomKing: So you’d get to wear dorky scrubs?<br>Deku: They’re not dorky!<br>Deku: Okay… They’re a little dorky…<br>KaboomKing: Extremely dorky.<br>Deku: But! I’d be helping people in my own way! And that’s what matters!<br>KaboomKing: Nerd</p>\n<p>—————-</p>\n<p> </p>\n<p>Izuku let out a soft chuckle at that. Yeah, Kacchan was right. He was indeed a nerd. But he was proud of his nerdiness!</p>\n<p> </p>\n<p>Now, back to the task at hand. Dinner. With a sigh, Izuku started putting back on his winter attire and shoes, then grabbing his phone to tell Kacchan he was indeed getting dinner.</p>\n<p> </p>\n<p>—————-<br>Deku: Brb, going to the conbini for dinner.<br>KaboomKing: Fucking what?<br>KaboomKing: Are you shitting me? You’re going back to the stupid conbini??<br>Deku: (ᅌᴗᅌ* ) y-yes…<br>KaboomKing: Its nearly 9pm!<br>Deku: I’ll be fine~<br>KaboomKing: You’re a 5’5 shrimp ass nerd. Someone could just pick you up and put you in their damn pocket.<br>Deku: What??<br>KaboomKing: Fuck it, I’ll just give you money to fucking order food.<br>Deku: Kacchan I’m okay, really! I do this all the time, and nothing bad has ever happened.<br>KaboomKing: Your Venmo. Hand it over.<br>Deku: Nooooo, you’ve given me enough money!!<br>KaboomKing: I’ll go through your twitch if I have to, nerd ass.<br>Deku: Hhhhhhh, fine…. Thank you Kacchan…<br>KaboomKing: No problem.<br>KaboomKing: I have one request however.<br>Deku: Huh?<br>KaboomKing: Take a picture once it arrives so I fucking know you’re eating dinner.<br>Deku: lol, okay Kacchan (*^ -^*)</p>\n<p>—————-</p>\n<p> </p>\n<p>After typing Kacchan his Venmo he gets a pretty instant notification, and oh GOD he nearly drops his phone. </p>\n<p> </p>\n<p>¥20,000 Sent From KaboomKing To Deku</p>\n<p> </p>\n<p>Izuku stared at his phone in complete and utter shock. That’s way too much! How much did he think food delivery cost?!</p>\n<p> </p>\n<p>—————-<br>Deku: Kacchan!!!<br>Deku: That’s way too much! I can’t accept this!<br>KaboomKing: Damn bitch that sucks, cause that's your money now.<br>Deku: Are you for real??<br>KaboomKing: As real as they get.<br>KaboomKing: Order some food, idiot.</p>\n<p>—————-</p>\n<p> </p>\n<p>With a short laugh, Izuku accepted his fate and ordered some food. To literally no one's surprise, he ordered Katsudon, his favorite.</p>\n<p> </p>\n<p>Once the food arrived, Izuku sat at his kitchen table, practically drooling over it. He pulled out his phone and took a picture of the food, then him taking a bite. Hopefully that would suffice for Kacchan.<br><br>—————-<br>Deku: It arrives!!<br>Deku: [Attached a picture of Katsudon]<br>Deku: SEE! Look I’m eating dinner (┛◉Д◉)┛彡┻━┻<br>Deku: [Attached a Selfie]</p>\n<p>\n<img src=\"https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/39877eee-ef02-4b06-83ae-f41eff3e7878/denmknv-2a0675e4-29c1-4b3f-874a-397ce3035878.png/v1/fill/w_702,h_1138,q_70,strp/selfie_1_by_rad_pax_denmknv-pre.jpg?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOjdlMGQxODg5ODIyNjQzNzNhNWYwZDQxNWVhMGQyNmUwIiwiaXNzIjoidXJuOmFwcDo3ZTBkMTg4OTgyMjY0MzczYTVmMGQ0MTVlYTBkMjZlMCIsIm9iaiI6W1t7ImhlaWdodCI6Ijw9MjA3NCIsInBhdGgiOiJcL2ZcLzM5ODc3ZWVlLWVmMDItNGIwNi04M2FlLWY0MWVmZjNlNzg3OFwvZGVubWtudi0yYTA2NzVlNC0yOWMxLTRiM2YtODc0YS0zOTdjZTMwMzU4NzgucG5nIiwid2lkdGgiOiI8PTEyODAifV1dLCJhdWQiOlsidXJuOnNlcnZpY2U6aW1hZ2Uub3BlcmF0aW9ucyJdfQ.HuzD3bX-nwqvsBVGMixQnbm_mkfZZgAIXjDVvbjF1Jc\" alt width=\"444\" height=\"720\">\n</p>\n<p>It was another selfie. Fuck. Katsuki’s face lit up like a Christmas tree on fire! And was that his own merch?? Fuck! Play it cool! Play it cool! Don’t let him know you’re excited he’s in your own merch.</p>\n<p> </p>\n<p>Fuck he looks so good in orange and black. He’s practically Halloween colors. Fuck. Katsuki was so FUCKED. He’d known this guy for barely 2 days and every time he saw him or talked to him his heart melted. How fucking dare Deku be this cute. Fuck him.</p>\n<p> </p>\n<p>—————-</p>\n<p>KaboomKing: Katsudon again??<br>Deku: It's my favorite!<br>KaboomKing: You need some fucking vegeatables or something, Jesus Christ!<br>Deku: It has… green onion on it….<br>KaboomKing: NOT GOOD ENOUGH!<br>Deku: (◕︵◕) But tasty…<br>KaboomKing: Fuck off with that. Your scrawny ass needs proper food.<br>Deku: o(╥﹏╥)o Weeeeh<br>KaboomKing: I’m gonna kick your ass, holy shit.<br>Deku: Well, there’s a lot of space to do so.<br>KaboomKing: …..<br>KaboomKing: Wh… What<br>Deku: (●´ω｀●) Nevermind</p>\n<p>—————-</p>\n<p> </p>\n<p>Katsuki smashed his head into his pillow at that last comment. This guy was going to be the fucking death of him. He just knew it.</p>\n<p> </p>\n<p>But GOD DAMN was it going to be a wonderful death.</p>\n<p> </p>\n<p>-------</p>\n<p> </p>\n<p>Izuku finished up his dinner and went to his room to study, still messaging Kacchan until he finally went to bed around 11pm. Izuku however stayed up until 3am trying to finish the rest of his homework and study for finals. Tomorrow he needed to stream, and he had ideas.</p>\n<p> </p>\n<p>But those had to wait until later once his brain had some sleep. Izuku crawled in bed, exhausted and sore from sitting at his desk. His bed wasn’t exactly the softest thing but it did its job. Izuku wrapped himself in his childhood All Might blanket and finally passed out, exhaustion taking hold.</p>\n<p> </p>\n<p>-------</p>\n<p> </p>\n<p>Waking up to the sound of his alarm blaring, Izuku sat up groggy and annoyed. It was 11:30am, Izuku usually let himself sleep in just a bit on his streaming days since he stayed up so late the night prior. He slowly rose out of bed and wandered into the kitchen for some much needed coffee. Checking his phone he saw a bunch of notifications from none other than Kacchan.</p>\n<p> </p>\n<p>—————-<br>6:02am KaboomKing: Hey shithead, you awake?<br>6:20am KaboomKing: I’ll take that as a no. Why the fuck do you wake up so late??<br>8:23am KaboomKing: Finished my workout, you up yet nerd ass?<br>8:40am KaboomKing: Deku &gt;:( Get a better sleep schedule!<br>—————-</p>\n<p> </p>\n<p>Izuku couldn’t help but laugh. An emoji?? This was the first time he’d seen Kacchan use one! How cute. Kacchan was being really cute.</p>\n<p> </p>\n<p>—————-</p>\n<p>10:20am KaboomKing: Shitty hair won’t stop asking who I’m messaging all day. Fuckin’ annoying. Dude needs to stay out of my shit.<br>10:50am KaboomKing: Is it illegal to murder your own friend for being a snooping piece of shit? Cause it's starting to feel deserved.<br>—————-</p>\n<p> </p>\n<p>Izuku snorted at the last message. Oh Kacchan, you dork. The freckled boy started up his coffee maker, and for once actually looked in the fridge to see if he had anything for breakfast. He had eggs and a few random things in there to make a half decent omelette. </p>\n<p> </p>\n<p>While he was preparing breakfast, Izuku grabbed his phone to shoot Kacchan message to hopefully help the man wanna murder his friend less.</p>\n<p> </p>\n<p>—————-<br>Deku: Well good morning to you~<br>KaboomKing: Fucking hell, you’re finally awake.<br>Deku: Someone seems needy. You’ve known me for 2 days lol<br>KaboomKing: Oh fuck off. You’re the least annoying person I talk to.<br>Deku: I have great news. I’m actually making breakfast for once.<br>KaboomKing: Deadass? Wow.<br>Deku: I know~! I’m preeeeetty cool.<br>KaboomKing: Alright nerd ass, dial it back.<br>Deku: Never~</p>\n<p>—————-</p>\n<p> </p>\n<p>Nearly 3 weeks had passed since the two started talking to each other. It was a constant and daily thing for the two to send each other memes, text late into the night, and of course every time Izuku streamed Katsuki was there to yet again throw money at him.</p>\n<p> </p>\n<p>He needed to maintain that Top Donor status. </p>\n<p> </p>\n<p>By now the chat knew who “Kacchan” was, and the others would tease him in chat. Katsuki didn’t pay them much mind though. He was too enraptured by the green beauty that could talk his ear off. </p>\n<p> </p>\n<p>Even if he was at work filling out paperwork, if he saw that notification he would grab his earbuds and start watching the stream. It was honestly amazing how quickly the man's voice could calm him down. He’d go from raging at paperwork and how stupid everything was, to having a soft smile on his face, his eyes gentle and endearing.</p>\n<p> </p>\n<p>He’d watch as Deku went on a long tirade about heroes, sometimes muttering to himself and stopping before apologizing to the audience. It was honestly one of the highlights of Katsuki’s week. </p>\n<p> </p>\n<p>The two felt inseparable at this point.</p>\n<p>This was all until one day, one of Katsuki’s biggest fears had finally happened. It was now over a month since the two had started talking, or rather, texting. See, no actual words had been shared between them. It was all text.</p>\n<p> </p>\n<p>One day, it seemed Deku wanted something a bit more than that. </p>\n<p> </p>\n<p>—————-</p>\n<p>Deku: Hey Kacchan~ (~￣▽￣)~<br>KaboomKing: What nerd<br>Deku: You wanna play Stardrew Valley together? We could voice chat and just hang out.<br>Deku: That is if you want to! I’m sure Stardew isn’t exactly your speed for games.<br>Deku: But we could just hang out and chat. Make a little farm together.<br>Deku: Honestly, I’m pretty curious how you sound haha.<br>Deku: We’ve been friends over a month and a half now but never voice chatted.<br>—————-</p>\n<p> </p>\n<p>Katsuki sat at his desk nervously twiddling his fingers. This was bad.</p>\n<p> </p>\n<p>Up until now he had kept his identity a complete secret, and Deku seemed pretty okay with it. He never pried into his life, which honestly Katsuki appreciated a lot. He was clearly curious but didn’t want to over step things.</p>\n<p> </p>\n<p>Katsuki actively wanted to voice chat with Deku however. But the issue now was his voice. He had such a recognizable voice that anyone with two brain cells could figure out who he was.</p>\n<p> </p>\n<p>Katsuki stared at his monitor trying to figure out what to even say. He wanted to hear Deku’s voice just talk to him, just say his own stupid nickname to him and not an audience.</p>\n<p> </p>\n<p>But on the other hand… What if he figured out who he actually was? Would that be so bad…? </p>\n<p> </p>\n<p>Fuck this was too much for Katsuki to think about.</p>\n<p> </p>\n<p>—————-<br>KaboomKing: I don’t have a mic for my PC.<br>Deku: Oh heck. Really??<br>KaboomKing: Never needed one.<br>Deku: Aww… we could call on your phone?<br>—————-</p>\n<p> </p>\n<p>Fuck, he completely forgot about his phone!</p>\n<p> </p>\n<p>Maybe the shit mic quality would mask his voice? And if he wasn’t yelling and just talking calmly Deku might not even realize who he is. No, this could work. This could for sure work.</p>\n<p> </p>\n<p>With shaky hands, Katsuki typed out his message.</p>\n<p> </p>\n<p>—————-</p>\n<p>KaboomKing: That might work…<br>KaboomKing: I need to buy and download this game though. Where the fuck do I get it??<br>Deku: Oh! On steam! I can just gift it to you. Hang on let me get the links to help you out~!<br>Deku: Its really fun! I promise! You can murder things in the game too so don’t worry!<br>KaboomKing: PFFFFT. Thank you for your consideration, Deku.<br>Deku: Any time~</p>\n<p>—————-</p>\n<p> </p>\n<p>After 30 frustrating minutes Katsuki had gotten a steam account, gotten the game, downloaded it and was ready to play whatever the fuck Deku had wanted him to get. Katsuki could honestly care less what the game was, he cared more about the fact he could hear the dumb nerds voice privately.</p>\n<p> </p>\n<p>The thought alone had his ears feeling warm. Just him and Deku in a call. Alone. Why the hell did this make him feel so flustered? It's just another guy he befriended online. Calm down Katsuki!</p>\n<p> </p>\n<p>With bated breath Katsuki stared at his phone, preparing for Deku to call him. His phone lit up with Deku’s icon on the screen and an accept or decline button.</p>\n<p> </p>\n<p>Nervously, Katsuki clicked accept. This was it. No going back now.</p>\n<p> </p>\n<p>“Kacchan?” Deku’s voice came through his earbuds.</p>\n<p> </p>\n<p>Oh no. Oh no.</p>\n<p>“Kacchan? You there?”</p>\n<p> </p>\n<p>Fuck. It was like liquid gold hearing that stupid nickname. It made Katsuki’s head spin, he felt his very soul leave his body as he heard this angel speak to him. He was gone, sent to another dimension. </p>\n<p> </p>\n<p>“Y-yeah.. Yeah I’m here.” Katsuki let out, his voice clearly shaky</p>\n<p> </p>\n<p>“Oh. Oh wow.”</p>\n<p> </p>\n<p>“What..?” Oh fuck. Its game over, he realized. Well, it was fun while it lasted. Time to throw himself into a river and sink to the bottom. Maybe he could move to another country? Change his name, get plastic surgery so no one knew who he was.</p>\n<p> </p>\n<p>“I just- oh wow. Sorry. Haha. I just wasn’t expecting your voice to be so…” Katsuki can hear Izuku moving around, probably talking with his hands again. Katsuki let out a soft chuckle at the thought, which he can only assume his phone picked up cause he heard Deku’s breath hitch.</p>\n<p> </p>\n<p>“So what?”</p>\n<p> </p>\n<p>“A-amazing? Wait no! Sorry that sounds weird! You just sound really, ahem. R-really cool is all. Y-your voice is way deeper than what I imagined in my head. O-oh geez, not that I was imagining it in a w-weird way either, maybe I should just stop talking!”</p>\n<p> </p>\n<p>“Heh… I can picture your arms flailing around while you talk.” Katsuki chuckled, leaning back in his chair to fold his arms. Okay maybe this was worth all the anxiety.</p>\n<p> </p>\n<p>“Y-yeah, kinda what I’m doing.” Deku sighs out.</p>\n<p> </p>\n<p>“I don’t think I’ve ever heard you stutter this much before.” The blonde hums, enjoying how nervous the other is.</p>\n<p> </p>\n<p>“S-sorry, just uh- t-trying to adjust to this. I-I wasn’t really e-expecting you to have a deep voice...”</p>\n<p> </p>\n<p>Katsuki lets out a snort. “Did you think I’d have a high pitch voice?”</p>\n<p> </p>\n<p>“N-no! I uh… Oh gosh, I d-don’t even know w-what I was expecting at th-this point.”</p>\n<p> </p>\n<p>“Mmmmm.” Katsuki lets out a soft hum at that. </p>\n<p> </p>\n<p>He hears another sound from Deku’s mic, though he isn’t sure what it is. He really wasn’t expecting Deku to be so nervous, actually Katsuki was the one he figured would be nervous and freaking out.</p>\n<p> </p>\n<p>Deku cleared his throat, clearly trying to gain some composure. “S-so! Did you m-make your character yet Kacchan?”</p>\n<p> </p>\n<p>“Not yet, was trying to figure that out.” The blonde groaned, now looking at the character screen. </p>\n<p> </p>\n<p>Would it be too on the nose if he made the character look like him? Maybe it’d be funny since Deku is such a DynaMight fan. </p>\n<p> </p>\n<p>It was just a bunch of pixels anyway, how could he possibly tell if he just made his avatar blonde? There’s tons of blonde people in this world. Yeah it’s fine.</p>\n<p> </p>\n<p>Finally making his avatar, Katsuki watched the dumb cutscene and was at his garbage farm. The entire time he was grumbling and nagging at the game to go faster, which garnered him soft cute giggles from Deku. </p>\n<p> </p>\n<p>“Alright now I have this shithole of a farm. Now what? Just wait around for you?”</p>\n<p> </p>\n<p>“Hang on, let me start up a co-op game.”</p>\n<p> </p>\n<p>After a few minutes the game was set up and the two were able to finally see each other in the pixelated world. </p>\n<p> </p>\n<p>Deku’s avatar had green hair and eyes, of fucking course, along with teal overalls. Katsuki knew it was just a bunch of pixels, but something about being this close, even in the digital world, made his butterflies fester in his gut. He could almost imagine being on a real farm with Deku, the two of them planting seeds and watching their crops grow together. He’d walk outside with a glass of ice tea as Deku stood and wiped the sweat from his brow.</p>\n<p> </p>\n<p>“You looked thirsty.” Katsuki would say, handing over the ice tea.</p>\n<p> </p>\n<p>“You know me so well, Kacchan.” Deku would laugh, taking the ice tea with a grateful expression.</p>\n<p> </p>\n<p>The two would lock eyes, emeralds meeting rubies. Nothing else in the world mattered. Just them and their little farm. </p>\n<p> </p>\n<p>“Kacchan! Your avatar looks cute! Wait are you blonde in real life?” Deku’s voice snapped Katsuki out of his daydream and back to reality.</p>\n<p> </p>\n<p>“What? Oh… yeah. I’m blonde.” Katsuki says, his tone awkward. Again hoping Deku won’t connect the dots.</p>\n<p> </p>\n<p>“Aw, that’s cute. Blonde hair is such a pretty color.” The greenette giggled.</p>\n<p> </p>\n<p>Katsuki’s breath was stolen from him in that very instant. His face started to heat up and his hands felt sweaty. <em>Shit don’t use your quirk you nervous idiot. Calm down!!</em> <em>It’s just a dumb compliment, don’t think too much about it!</em></p>\n<p> </p>\n<p>The blonde bit at his lower lip anxiously trying to think of a reply. “Well…” he began. “Green is also a pretty color.”</p>\n<p>\n<br>\n<br>\n</p>\n<p>Deku went silent. He could hear some kind of mumbling on the other end of the call, until Deku finally spoke up. “I-I uh. Ahem. Y-you think so?”</p>\n<p> </p>\n<p>Katsuki couldn’t help but smirk. The poor nerd was just as anxious, maybe more so. “Mmm… kinda reminds me of the ocean. That real fuckin’ specific green it has.” The blonde pauses.</p>\n<p> </p>\n<p>“When I was a kid my parents would take me to the beach, and I’d go to some of the darker areas to search for clams ‘n shit. I’d sit and watch the tides go in and out, and just watch. It was one of the few times I was actually calm as a child.”</p>\n<p> </p>\n<p>Silence yet again comes over the two. There’s a sound from the other end of the call that Katsuki can’t place, then Deku finallly speaks up.</p>\n<p> </p>\n<p>“Did you have a lonely childhood?”</p>\n<p> </p>\n<p>Out of all the things Katsuki could imagine Deku would say, it wasn’t that.</p>\n<p> </p>\n<p>“I-“ the blonde shifts uncomfortably in his chair. “Yeah I guess so. I didn’t really have any friends. But, I didn’t really want any either. People annoyed me. Hell even now I don’t really have many friends.”</p>\n<p> </p>\n<p>“Mmmm…” Deku hums. “I’m surprised you hang out with me then.” He lets out a soft laugh. “Most people find ME annoying.”</p>\n<p> </p>\n<p>Katsuki could hear the anxiety in Deku’s tone. He honestly felt bad, but it was the truth. Most people DID annoy him and he was ridiculously picky about friends. But something about Deku was different, almost special in a way. </p>\n<p> </p>\n<p>It made Katsuki want to protect him, keep him safe from the hurt the world dared to inflict upon him. He wanted to let him know just how special he was in his eyes and how wonderful and intelligent he was. How he deserved confidence and support for his ideas. </p>\n<p> </p>\n<p>Katsuki couldn’t even explain it to himself why he felt so connected to the greenette. But every time he saw those gorgeous emeralds, it was like the stars were speaking to him. Each consolation spreading across his beautiful tanned skin, the universe in his eyes lighting up with each word he spoke.</p>\n<p> </p>\n<p>It made Katsuki feel soft. Every time he saw Deku all he could think in his heart was “Home.”</p>\n<p> </p>\n<p>“I don’t find you annoying.” Katsuki said, in almost a whisper. “You’re interesting. You may be a nerd but your nerd brain has a lot of good ideas. I like hearing you talk…” Katsuki could feel his ears heating up again.  “I don’t know if that’s weird to say but… Fuck whatever.”</p>\n<p> </p>\n<p>There was a small almost gasp sound from the other end, then… Oh God was that sniffling?!</p>\n<p> </p>\n<p>“D-Deku…?” His tone was now worried. Maybe he overstepped? Maybe he said something wrong? Oh fuck.</p>\n<p> </p>\n<p>“Y-yeah I’m here. S-sorry. Just.” There was a deep inhale. “Sorry sorry! No one has ever said anything that nice to me haha. I guess I got a little emotional.”</p>\n<p> </p>\n<p>Katsuki was in utter shock. He wasn’t the best with words, he knew that. So if THAT was the nicest thing he’s ever heard, what the fuck had he been hearing up until now?</p>\n<p> </p>\n<p>“Well, it’s fucking true. You got a big ass nerd brain, but that nerd brain has some damn good ideas.” Katsuki grunted. He was well aware his voice was getting a bit louder now and he needed to calm downs. </p>\n<p> </p>\n<p>Tone down the DynaMighta bit and bring back the calmer Kacchan, idiot. Cant have Deku figuring out who you are!</p>\n<p> </p>\n<p>“Fuck anyone that says different. I-“ Katsuki brakes a deep breath. “I like talking to you… or whatever.”</p>\n<p> </p>\n<p>There’s a soft giggle from Deku. Ugh that laugh, like warm sweet honey. He could listen to it all day. It wasn’t fair how cute this guy was.</p>\n<p> </p>\n<p>“You are… quite the wordsmith Kacchan.”</p>\n<p> </p>\n<p>“What can I say, I’m great at everything I do.”</p>\n<p> </p>\n<p>Another laugh, this time muffled slightly. Deku was probably covering his mouth with his hand or sleeve. Fuck that was too cute. </p>\n<p> </p>\n<p>“Well, shall we play?” Deku chirps, his character running circles around Katsuki’s.</p>\n<p> </p>\n<p>“Oh, right. Yeah, let’s play this dumb game.” The blonde chuckles, making his character move back and forth.</p>\n<p> </p>\n<p>“So uh… how exactly do I play?”</p>\n<p> </p>\n<p>After 30 minutes Deku had fully taught Katsuki how to play, and the two started building up their little farm. Deku helped explain the mechanics while Katsuki would grumble and do the opposite or even wander off to do something else and be a stubborn ass.</p>\n<p> </p>\n<p>After 3 hours the two were finally gonna call it quits for the night as it was getting late and both needed rest.</p>\n<p> </p>\n<p>Katsuki’s heart felt warm, listening to that dweeb ramble for hours and the two chatted like they had been friends since forever.</p>\n<p> </p>\n<p>“Well…” The greenette mumbled anxiously. “It was amazing talking to you Kacchan. I hope y-you sleep well! N-night!”</p>\n<p> </p>\n<p>“Mmm. Night Deku.” Katsuki grunted before leaving the call. Honestly he didn’t want to. He could probably just fall asleep talking to the nerd.</p>\n<p> </p>\n<p>Stretching out his back and hearing a few satisfying pops, Katsuki moved to his bed to get some sleep. </p>\n<p> </p>\n<p>His dreams filled with beautiful ocean green hair and soft emerald eyes.</p>\n<p> </p>\n<p>——-</p>\n<p> </p>\n<p>Izuku was sitting at his desk in absolute shock. He has finally talked to Kacchan on voice call and it was NOT at all what he expected.</p>\n<p> </p>\n<p>Nothing could even mentally prepare him for what he was going to hear. The man's voice was like liquid gold, it was like the finest melted chocolate you could ever dare taste. Everything about it was rich and velvety.</p>\n<p> </p>\n<p>Izuku sat there with his face bright red, his hands still shaking. All he could think was <em> Oh God Kacchan has such a hot voice. Oh god he’s probably so attractive too!! Why the hell is he talking to a dork like me?! Oh God Oh Crap!! </em></p>\n<p> </p>\n<p>His heart was still pounding in his chest, he felt a little dizzy from all the endorphins rushing through his body. </p>\n<p> </p>\n<p>He was well aware this wasn’t a normal reaction, and especially towards a guy. It’s not like Izuku hadn’t questioned his sexuality a few times. Girls made him nervous and blush but sometimes in the boys locker room he’d start feeling embarrassed from how the other guys' bodies made his face flush.</p>\n<p> </p>\n<p>Honestly for the past few years Izuku had been so busy with school he didn’t get a chance to properly think about his sexuality. But he was pretty positive this was some kinda crush he was developing on this guy he met nearly two months ago.</p>\n<p> </p>\n<p>At first he had worried those feelings were just him overreacting to being sent so much money at once and feeling obligated. But now those emotions were turning into something else, something Izuku himself was trying to understand.</p>\n<p> </p>\n<p>Kacchan made his heart get caught in his throat, he made him get flush and nervous. He didn’t even know what the guy looked like but he was positive he had to be attractive. </p>\n<p> </p>\n<p>His mind started to try and piece together what the man might look like. He knew he was blonde, and he knew he was tall and muscular, and he knew he looked intimidating..</p>\n<p> </p>\n<p>Immediately DynaMight pops into Izuku's head and the greenette nearly screams. <em> No no no. It can’t be him. Try imagining a DIFFERENT blonde, Izuku!  </em></p>\n<p> </p>\n<p>Maybe he had short straight hair and blue eyes. Very piercing and intimidating. Deku tried to piece together any kind of face but it was difficult given the info he had.</p>\n<p> </p>\n<p>He was anxious to ask for a selfie since Kacchan seemed so private about his life. But to be fair, so was Izuku. Neither knew their real names, where they were born, hell Izuku didn’t even know the guy's age. He assumed early 20’s like himself by how he talked and now by his voice.</p>\n<p> </p>\n<p>He knew so much and yet so little about the mysterious Kacchan, and honestly it only pulled him in more.</p>\n<p> </p>\n<p>Every time he mentioned work or his childhood he was so fascinated. Izuku wanted to know more about the mysterious man that donated large sums of money.</p>\n<p> </p>\n<p>But he also didn’t want to scare him off or annoy him. It would be a slow battle to unravel the mystery that was Kacchan. And Izuku was absolutely thrilled to do so.</p>\n<p> </p>\n<p>———-</p>\n<p> </p>\n<p>The date was December 21st, only a few days until Christmas. Katsuki had now known Deku for nearly two months and had their first voice call a few days ago. Katsuki was absolutely over the moon.</p>\n<p> </p>\n<p>He didn’t think ever in his life that knowing someone could make him feel like this. Everyone he’d ever met made him either wanna deck them in the face or scream. But for some reason Deku was different. He made Katsuki laugh, made his heart feel warm, he couldn’t get the green haired boy with stars on his cheeks and a cosmos in his eyes, out of his mind.</p>\n<p> </p>\n<p>Even in his dreams he dreamt of the boy. His cute face flushed against his while he wrapped his arms around his slender frame. Kissing along his cheeks and down his neck, counting each and every freckle.</p>\n<p> </p>\n<p>Deku would shudder under his grasp, his eyes fluttering shut from the feeling. “K-Kacchan…” The greenette would breathe out, grasping at Katuski.</p>\n<p> </p>\n<p>Fuck. He was in deep. Way too deep. He didn’t even know the guy's real name, and a ton of information on the guy remained a mystery. But yet something about him just made him get pulled in even closer. Like the string of fate had connected them and pulled them in closer and closer. His hands reaching out for those gorgeous green curls that felt so familiar and yet so distant.</p>\n<p> </p>\n<p>PING!</p>\n<p> </p>\n<p>A notification went off on Katsuki’s phone, yanking him from his daydream. He was in the office today filling out more useless paperwork. His quirk was “too destructive” so he usually was left filling out paperwork on the buildings he’d accidentally damaged. He wasn’t entirely sure why that was HIS job when he's a hero. He was out there saving lives! And could be saving even more if he wasn’t stuck in this stupid office building!</p>\n<p> </p>\n<p>Grabbing his phone he clicked on the Twitch app and tuned into Deku’s stream. Looks like he was reacting to hero memes or something today. </p>\n<p> </p>\n<p>“Hey there my lovelies! Before I start stream I have two things to show you! I recently treated myself a bit since Christmas is around the corner, sooo~” the greenette reached behind his chair and grabbed for something before turning back to the camera.</p>\n<p> </p>\n<p>“First of all, you all have been complaining my headset is old and ugly. And you’re right. So I finally got myself a new pair!” </p>\n<p> </p>\n<p>From between his lap he pulled out a pair of black headphones with glowing teal rabbit ears on the top. He nestled them atop his fluffy green mound of hair and cupped his cheeks, a clear blush rushing over them. Katsuki’s breath hitched. Deku looked too damn cute for his own good. This shouldn’t be allowed. And clearly the chat agreed because everyone was going absolutely apeshit.</p>\n<p> </p>\n<p>——————</p>\n<p>Chat:</p>\n<p>DekusWifey: SOOO CUTE!! Yes Deku-Chan!!!</p>\n<p>Poppinrocks: that’s too cute oh my gosh!! Deku stop my heart!</p>\n<p>HoneyButterLover Donated 7,000 bits “Marry me Deku-channnn”</p>\n<p>StckyFingers70: lol he’s not gonna marry you, idiot.</p>\n<p>[TOP DONOR] KaboomKing: ew</p>\n<p>MintedChaser: oh shush Kacchan! You’re one to talk, Mr. Top Donor.</p>\n<p>DekusWifey: yeah besides! If He marries anyone it's gonna be ME!!!<br>[TOP DONOR] KaboomKing: stop being weird before you get banned, idiot.</p>\n<p>——————</p>\n<p> </p>\n<p>Stupid simps, always made the stream a bit less enjoyable. Luckily Deku ignored the weirdos in chat, in the beginning he would read the creepy messages aloud and start to get frazzled or anxious. But he’s pretty quickly learned to tune them out. He always paid special mind to ignore this “DekusWifey” person and a few of the others who didn’t seem to stop being creeps. It took all of Katsuki’s willpower not to tear them all a new asshoke. </p>\n<p> </p>\n<p>“Aren’t they the cutest?! But wait I have another thing to show you guys!” Deku was practically bouncing around in his seat with excitement. “I saw this at the mall and I couldn’t really pass it up. He was way too cute and soft not to get. Though the price tag was…. pretty ridiculous I’ll admit. But just- let me just show you guys.”</p>\n<p> </p>\n<p>Turning again he pulled out something from behind his desk. It was hard to tell at first, just a big mound of pale yellow. Then it hit Katsuki like a bullet train.</p>\n<p> </p>\n<p>“Tada!! Look!”</p>\n<p> </p>\n<p>His face began to heat up, the blonde now chewing at his bottom lip. Nothing could have mentally prepared him for what he was about to see.</p>\n<p> </p>\n<p>It was a big ass plushie of DynaMight. Katsuki specifically remembers getting this design sent to him and thinking it was stupid and didn’t fit his badass look, but his PR department said it’d be good to make more cutesy items for kids that are his fans. Clearly they never considered cute twinks who might be into his brand as well.</p>\n<p>\n<img src=\"https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/39877eee-ef02-4b06-83ae-f41eff3e7878/denmko1-989989af-e587-49e3-8801-bc84ea45ec73.png/v1/fill/w_1101,h_726,q_70,strp/plushie_by_rad_pax_denmko1-pre.jpg?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOjdlMGQxODg5ODIyNjQzNzNhNWYwZDQxNWVhMGQyNmUwIiwiaXNzIjoidXJuOmFwcDo3ZTBkMTg4OTgyMjY0MzczYTVmMGQ0MTVlYTBkMjZlMCIsIm9iaiI6W1t7ImhlaWdodCI6Ijw9ODQ0IiwicGF0aCI6IlwvZlwvMzk4NzdlZWUtZWYwMi00YjA2LTgzYWUtZjQxZWZmM2U3ODc4XC9kZW5ta28xLTk4OTk4OWFmLWU1ODctNDllMy04ODAxLWJjODRlYTQ1ZWM3My5wbmciLCJ3aWR0aCI6Ijw9MTI4MCJ9XV0sImF1ZCI6WyJ1cm46c2VydmljZTppbWFnZS5vcGVyYXRpb25zIl19.aOj7SZ43lrFad5csRpK4OW16ZlFEc3t-OYtL0IAZngk\" alt width=\"690\" height=\"455\">\n</p>\n<p>“Fuck…” Katsuki groaned out, staring down at his phone. It has to be illegal to be this adorable. There no fucking way a human being could look like that and be allowed to walk down the street. </p>\n<p> </p>\n<p>“Isn’t he the cutest? I wonder if the real DynaMight gives soft hugs like this little guy does.” Deku giggled, squeezing the giant plushie closer. “I haven’t been able to stop holding him around my apartment. I even slept cuddling him last night. Kinda… dorky I know, but he’s just so soft and cute!”</p>\n<p> </p>\n<p>Katsuki’s mind was going a mile a minute, did Deku really think he was cute? Or was he just gushing over the squishy plushie? He looked so happy holding onto the dumb doll it honestly made it all worth it to go through the nightmare of getting the thing made. And it might have made Katsuki a little jealous, but not that he would admit it.</p>\n<p> </p>\n<p>He was well aware that Deku had a lot of money troubles and from what he saw Deku owned 2 DynaMight shirts, one figure and now a plushie. A pretty sizable collection, but absolutely dwarfed compared to the All Might collection that Katsuki was very well aware of. Clearly, that needed to be fixed. </p>\n<p> </p>\n<p>And Katsuki had an idea on how.</p>\n<p> </p>\n<p>--------</p>\n<p> </p>\n<p>Izuku stretched out his back, it was another good stream. Thought the amount of creeps seemed to have been growing as of late. Izuku was gaining a bigger audience and while he was extremely grateful, he wasn’t used to people treating him the way people did online.</p>\n<p> </p>\n<p>All his life he was often scribed as “plain” or hell, even ugly. Izuku didn’t think he was bad looking by any means, but he didn’t exactly have a ton of confidence either due to being bullied for so long. So people complimenting him or demanding his attention like they did was an entirely new concept to the greenette.</p>\n<p> </p>\n<p>PING!<br><br>Speaking of wanting his attention.</p>\n<p> </p>\n<p>——————<br>KaboomKing: Hey loser, you got a P.O Box or something?<br>Deku: Yeah, but why?<br>KaboomKing: Why the fuck do you think? I’m gonna send you a Christmas present, nerd ass.<br>Deku: Wait what?? Noooo! You really don’t need to!<br>KaboomKing: I don’t NEED to do shit. Now gimme the address.<br>Deku: Should I get you something??? o(╥﹏╥)o<br>KaboomKing: Naw. Keep your dork money.<br>KaboomKing: You gotta open it on stream though. I wanna see your reaction.<br>KaboomKing: That can be my gift.<br>Deku: Deal! (づ｡◕‿‿◕｡)づ<br>——————<br><br>Izuku let out a soft chuckle. Of course Kacchan wanted to send him a gift, and of course the guy didn’t want any presents. He was probably rich from what Izuku could gather, so if he did want anything he could just buy it. He wasn’t entirely sure why some mysterious rich man wanted to even talk to him, but either way he was grateful. Kacchan was funny, nice, and gave him confidence when he needed it. Every conversation with the mysterious man made his heart swell.<br><br>They’d known each other for close to two months now, and he couldn’t help but feel oddly attached to him. Even if he didn’t know a ton about the other man, he just wanted to be around him.</p>\n<p> </p>\n<p>With shaky hands Izuku started to type. Maybe it was a stupid idea, maybe it was overstepping. But something in him needed this.</p>\n<p> </p>\n<p>——————<br>Deku: Hey Kacchan.<br>KaboomKing: What?<br>Deku: What are you doing for Christmas...?</p>\n<p>——————</p>\n<p>——————<br>Deku: Hey Kacchan.<br>KaboomKing: What?<br>Deku: What are you doing for Christmas...?<br>——————</p>\n<p> </p>\n<p>Katsuki stared down at his phone in absolute shock. What was he doing for Christmas? Well probably working if he knew his work schedule. But did Deku want to do something with him…? Maybe play games again? Hopefully not try and meet up cause Katsuki couldn’t handle that.</p>\n<p> </p>\n<p>——————<br>KaboomKing: Probably working. Why?<br>Deku: Oh…<br>Deku: I was hoping we could maybe do something.<br>Deku: Like, I dunno. Play a game or maybe try watching a dumb movie.<br>Deku: If you want!<br>Deku: You don’t need to!<br>Deku: Clearly you’re busy so it's fine!<br>Deku: What I mean is!!<br>Deku: Its entire up to you and-<br>——————<br><br>The typing continued, Katsuki pinched the bridge of his nose. Fuck it. He clicked the call button on his phone and waited.</p>\n<p> </p>\n<p>“H-hello Kacchan… Are you mad?”<br><br>“Mad? No, fuck head. You seemed like you were having a damn panic attack or some shit.”<br><br>“S-sorry… I guess I got anxious. I’ve uh, never had anyone around to do stuff with on Christmas. O-other than my mom that is.” </p>\n<p> </p>\n<p>Katsuki ran his hands down his face. Of course he was anxious, the guy had never really had friends up until now. To be fair, neither had Katsuki until recently. Most years he’d spend them with his parents or hell sometimes alone. But he preferred being alone, or at least that's what he told himself.</p>\n<p> </p>\n<p>“Deku.” Katsuki began, he heard almost a yelp on the other end of the line. “I’ll check my schedule nerdass. Stop freaking out, fuck.”<br><br>“R-really?! You mean it!!!?” Deku was practically vibrating.</p>\n<p> </p>\n<p>“Yeah. I gotta get back to work, I’ll text you.”<br><br>“O-okay Kacchan.” There was a pause. “Have a good rest of your day.”<br><br>Katsuki’s cheeks started to flush. “Yeah… Talk to you later, Deku.” The blonde said with a shaky breath. This was getting ridiculous.</p>\n<p> </p>\n<p>---------</p>\n<p> </p>\n<p>Izuku was standing at his P.O. Box, he remembered that Kacchan had wanted to send him something but he wasn’t sure what exactly. </p>\n<p> </p>\n<p>“Midoriya Izuku?” </p>\n<p> </p>\n<p>“Y-yes! That’s me!” Izuku stammered, walking up to the counter.</p>\n<p> </p>\n<p>“Careful, it’s a big one.” </p>\n<p> </p>\n<p>From behind the woman pulled out a large box and, nearly the size of Izuku’s entire torso. The thing was gigantic! </p>\n<p> </p>\n<p>“Th-thank you!” The greenette beamed, grabbing the box and leaving the post office. He could honestly barely carry the stupid thing it was so heavy. What on earth did Kacchan send him??</p>\n<p> </p>\n<p>—————-</p>\n<p>Deku: I got your package!</p>\n<p>Deku: [sent picture of the box]</p>\n<p>Deku: it’s hard to carry!</p>\n<p>KaboomKing: I’ll be honest, I forgot how small you are compared to me.</p>\n<p>Deku: huh?!?</p>\n<p>KaboomKing: it was easy to carry for me. Forgot you’re short and skinny as hell. </p>\n<p>Deku: rude!! ╚(•⌂•)╝</p>\n<p>KaboomKing: Just the truth.</p>\n<p>Deku: I’m hopping on the train now. Once I get home I’ll get ready for the stream   (●´ω｀●)</p>\n<p>KaboomKing: Cool</p>\n<p>KaboomKing: ヽ(^◇^*)/</p>\n<p>Deku: ARE YOU USING EMOJIS NOW?!?</p>\n<p>KaboomKing; FUCK OFF!! ヽ(ｏ`皿′ｏ)ﾉ</p>\n<p>Deku: Kacchan is cute (~￣▽￣)~</p>\n<p>KaboomKing: No, I’m hot. Get it right.</p>\n<p>Deku: Kacchan is hot ( ͡° ͜ʖ ͡°)</p>\n<p>KaboomKing: Ew I hate that one. Stop.</p>\n<p>Deku: ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°)</p>\n<p>——————</p>\n<p> </p>\n<p>Izuku let out a soft giggle as he boarded this train. He couldn’t believe he met someone like Kacchan not that long ago. He was always so kind to him and made him laugh. </p>\n<p> </p>\n<p>The two had made plans on the 24th to watch a few dumb Christmas movies together, and Kacchan even bought a simple mic set up so they could watch at his desk. He seemed pretty nervous about the thing, which only added to the cuteness. Kacchan was indeed cute. </p>\n<p> </p>\n<p>After a 30 minute train ride and a 15 minute walk, Izuku had made it home. It was one of his streaming days and he woke up early to go and get the package Kacchan had sent him. Usually he’d detest waking up so early but for Kacchan’s sake it was worth it.</p>\n<p> </p>\n<p>—————-</p>\n<p>Deku: Just got home! Gonna shower real quick then stream~</p>\n<p>KaboomKing: OK.</p>\n<p>—————</p>\n<p> </p>\n<p>The greenette took off his shoes and took a brisk shower to warm himself up from the freezing weather outside. He changed into a cute bunny hoodie his mother bought him a few years ago with a basic white T-shirt and black jeans. </p>\n<p> </p>\n<p>With a warm cup of tea in hand he was ready to start his stream. He put his new headphones on and clicked the “Go live” button.</p>\n<p> </p>\n<p>“Hello my lovelies! So! Kacchan recently sent me a package! Can you believe that?! So before I get into the rest of the stream I’m gonna open this here for you all to see!”</p>\n<p> </p>\n<p>————-</p>\n<p>Chat:</p>\n<p>EmoCrib: of course fucking “Kacchan” sent him stuff</p>\n<p>Looneybuns: Simp alert!</p>\n<p>MatchaBean: Awww that’s so cute of him!</p>\n<p>FlowerOHair: Deku you look so pretty today!</p>\n<p>CoinedFlip: I wonder what Mr. Money Bags sent oooooh~</p>\n<p>InkySquid Donated ¥1000 Show is the goods!</p>\n<p>BeanedBurrito Donated ¥5,000 Deku is so cute! Show us the box!</p>\n<p>————-</p>\n<p> </p>\n<p>Izuku couldn’t help but let out a soft laugh. “Thank you InkySquis for the donation and thank you BeanedBurrito for your donation as well! Okay! So onto the show!”</p>\n<p> </p>\n<p>Izuku cut open the box with a knife, the chat screaming at him to be careful the entire time. As he opened it he could already see hints of orange and black. Of course Kacchan sent him some DynaMight merch. He was well aware of Deku’s borderline crush on the Pro Hero, so it’d only make sense.</p>\n<p> </p>\n<p>Izuku finished cutting open the rest of the box and his eyes practically sparkled at what he saw.</p>\n<p> </p>\n<p>The greenette pulled out another plushie, this one looked extremely well made. It was his winter costume, and with each little detail added. It looked like even his tiny plush gauntlets could be taken off. How cute!</p>\n<p> </p>\n<p>There was also a DynaMight tank top and matching leggings. Work out clothes perhaps? A very large and cozy looking hoodie with the DynaMight logo plastered on it. Oh he was gonna wear this all the time now!</p>\n<p> </p>\n<p>Looking deeper there were a few more t-shirts, all seemed to be a bit oversized, which was perfectly fine for Izuku. He preferred bigger shirts anyways. A pair of DynaMight shorts as well, were these for girls…? They looked cozy for pajama bottoms atleast. </p>\n<p> </p>\n<p>And buried in it all were two figures. Izuku couldn’t even contain his excitement. These two alone had to be ¥10,000 each! Not to mention all of the other merch! Izuku could feel warm tears building up in his eyes, staring down at the wonderful gifts he had been given.</p>\n<p> </p>\n<p>“WAAAAH!! K-Kacchan! These are so amazing! How did you even get a hold of this stuff?! Holy… wow!”</p>\n<p> </p>\n<p>The greenette rubbed at his eyes, feeling a flush run its way along his freckled cheeks. “Wow this is the sweetest thing anyone’s ever done for me. I-I cannot thank you enough! Wow!”</p>\n<p> </p>\n<p>Izuku zipped off his current hoodie and replaced it with the black and orange DynaMight one, the sleeves flopping over his hands. It was too big for sure but he absolutely loved it. </p>\n<p> </p>\n<p>—————-</p>\n<p>Chat:</p>\n<p>[TOP DONOR] KaboomKing: Glad you like it.</p>\n<p>KindredFlame: Sugar Daddy Kacchan over here</p>\n<p>PinkNewt: some of that stuff isn’t even out yet! How’d you get it?!</p>\n<p>[TOP DONOR] KaboomKing: I know a guy </p>\n<p>PinkNewt: yeah sure. A “guy”</p>\n<p>LongingCupid89: man I wish I had a Kacchan in my life. Ugh</p>\n<p>Rampager682: Dude we ALL wish we had a Kacchan</p>\n<p>—————-</p>\n<p> </p>\n<p>Katsuki was stationed for another late night patrol, but that didn’t mean he wasn’t gonna check in on Deku’s stream when things got slow. Leaning against a wall the blonde had a gentle smile on his face, Katsuki didn’t need any fancy gift for the holidays, this was all he could have ever asked for. Watching the forested hair boy beam in excitement from something he had done for him.</p>\n<p> </p>\n<p>“Yoooo DynaMight! What’s got you smiling?” Crap. </p>\n<p> </p>\n<p>Denki had gone to scout a few of the nearby streets for any villain activity while Katsuki stayed back to “survey the area”, but really just watch Deku’s stream for a few minutes.</p>\n<p> </p>\n<p>“Nothing, dunceface.” Katsuki growled, shoving his phone back in his pocket. Of fucking course the electric hero had to come back right then and ruin it.</p>\n<p> </p>\n<p>“Awwww c’mon! You were totally on your phone just now! Show, c’mon!” the electric blonde bounced up and down, moving closer to Katsuki.<br><br>“Don’t test me Pikachu, I’ll fuckin’ kill you. It's none of your damn business.” Katsuki spat, glaring daggers towards his ‘friend’.<br><br>“Aww, don’t be like that. Were you texting a girl? Is she pretty?!” Denki was practically vibrating out of his skin.</p>\n<p> </p>\n<p>“I said it's none of your damn business.” The explosive blonde snapped, raising his hand to set off a few explosives.</p>\n<p> </p>\n<p>Denki, however, was unphased. He had been around the angry blonde for too many years to take any of his threats seriously anymore. “So it IS a girl! There’s no need to be shy~ Tell me about her!”<br><br>Even if Katsuki wanted to explain the situation, how the hell would he even begin? <em> “Oh I saw this cute guy streaming on Twitch and I might have donated a fuck ton of money the first night and now I talk to him every single fucking day, oh and the guy has no idea what my real identity is so I’m basically lying to my internet crush! So that’s SUPER awesome! Did I mention he’s a gigantic DynaMight fan?! Oh and the best part,  I don't even know if the dude is INTO guys so this crush is probably a wonderful one sided nightmare!” </em></p>\n<p> </p>\n<p>Katsuki pinched the bridge of his nose trying to calm himself down. He didn’t endure 3 years of therapy to be set off by his nosy ass friend. “It's not a girl.” Katsuki gritted out. Which was true, Deku is indeed not a girl. </p>\n<p> </p>\n<p>“Ohhhhh~” Denki now had a cheshire grin. “So it's a boy!” </p>\n<p> </p>\n<p>That was not what he was expecting the other blonde to say. “What?!”</p>\n<p> </p>\n<p>“Y’know, it makes sense. You never were into girls back in high school. Its okay Kats, you know I’d never judge you for being gay.” Denki reached out, placing a hand onto Katsuki’s broad shoulder. </p>\n<p> </p>\n<p>Error, error. Katsuki has stopped working. </p>\n<p> </p>\n<p>“I… Hah?!”</p>\n<p>“So tell me about him! Is he cute?” The electric blonde beamed, at this rate Katsuki couldn’t tell if he was being made fun of or if Denki was being genuine. </p>\n<p> </p>\n<p>“How in the fresh fuck do you even connect “Katsuki is on his phone” to “He must have a crush!”, Who the fuck does that?!” The short tempered hero retorted, again setting off a few explosives in his hands.</p>\n<p> </p>\n<p>“It's written all over your face! You looked like you were in looooove~”</p>\n<p> </p>\n<p>Alright, that’s it. Time to give up on being a hero because he might ACTUALLY kill Denki if he kept saying shit. Katsuki ran a gloved hand down his face, attempting to hold back his rage. “Fuck. Off.” Was all he could manage to hiss out without going into a full blow rage induced episode. </p>\n<p> </p>\n<p>Katsuki pushed past Denki and made his way towards the street. Maybe he’d be lucky and some dumb villains would appear so he could let off some steam.</p>\n<p> </p>\n<p>“Wait! Don’t leave without me!” Denki cried after, running towards his explosive friend.</p>\n<p> </p>\n<p>--------</p>\n<p> </p>\n<p>Izuku was practically BEAMING with excitement! He couldn’t believe Kacchan sent him so many kind and wonderful gifts! He didn’t know what he did to deserve such kindness but it made his heart warm and filled with so many new emotions.</p>\n<p> </p>\n<p>—————-<br>Deku: Kacchan!!<br>Deku: You’re literally the best!!!!<br>Deku: (ノ・ω・)ノ<br>KaboomKing: I know<br>Deku: I’m still vibrating from earlier!!!<br>Deku: How did you get any of this stuff?!<br>KaboomKing: I have my ways ★~(◡‿◡✿)<br>Deku: !! Emoji!<br>Deku: Kacchan is cute! (ﾉ◕ヮ◕)ﾉ*:･ﾟ✧<br>KaboomKing: Your nerdy ass is rubbing off on me<br>KaboomKing: Soon my friends might think I’m soft or some shit<br>Deku: Kacchan IS soft! (≧o≦)<br>KaboomKing: No, I’m a badass!<br>Deku: A cute badass? (●´ω｀●)<br>KaboomKing: I’m gonna kick your ass<br>Deku: That means you’d need to meet me irl~<br>KaboomKing: Don’t tempt me shortass<br>Deku: !! (ﾟヮﾟ) hehehe<br>—————-</p>\n<p> </p>\n<p>It was nearly 6pm now and Izuku still had the rest of the evening to kill after his stream. Tomorrow was the day they had their… actually what would it even be called? A date? No. Don’t be ridiculous Izuku. Kacchan is probably straight anyways.</p>\n<p> </p>\n<p>With a wistful sigh Izuku decided it. He was gonna make Kacchan proud and go to the gym! He always made fun of the greenette for being so scrawny, plus if he was gonna be a nurse he’d for sure need to put on more muscle. And totally not an excuse to try out his new DynaMight themed workout attire. Noooope.</p>\n<p> </p>\n<p>It was decided then!</p>\n<p> </p>\n<p>------------</p>\n<p> </p>\n<p>Walking into the gym the greenette wandered his way to the locker room to change. The freckled boy reached into his large yellow backpack and pulled out the gym clothes he had brought with, though now he didn’t even realize just how tight the leggings stuck to his body now that he had them on. Maybe he should have just worn his usual baggy shorts and graphic T…</p>\n<p> </p>\n<p>Well it was too late now, and he was already here. Nervously Izuku walked into the main area to start on his typical routinet. He wasn’t exactly good at a lot of it but he did give it his all. He wandered around the gym, trying a few different machines, though some he was still too weak to use.<br><br>—————-<br>Deku: Kacchan you’re gonna be so proud of me!<br>Deku: [sent a selfie]</p>\n<p>\n<img src=\"https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/39877eee-ef02-4b06-83ae-f41eff3e7878/denmkob-59424ab5-d35d-4cb9-93c0-a1273ec3a9d5.png/v1/fill/w_702,h_1138,q_70,strp/selfie_3_by_rad_pax_denmkob-pre.jpg?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOjdlMGQxODg5ODIyNjQzNzNhNWYwZDQxNWVhMGQyNmUwIiwiaXNzIjoidXJuOmFwcDo3ZTBkMTg4OTgyMjY0MzczYTVmMGQ0MTVlYTBkMjZlMCIsIm9iaiI6W1t7ImhlaWdodCI6Ijw9MjA3NCIsInBhdGgiOiJcL2ZcLzM5ODc3ZWVlLWVmMDItNGIwNi04M2FlLWY0MWVmZjNlNzg3OFwvZGVubWtvYi01OTQyNGFiNS1kMzVkLTRjYjktOTNjMC1hMTI3M2VjM2E5ZDUucG5nIiwid2lkdGgiOiI8PTEyODAifV1dLCJhdWQiOlsidXJuOnNlcnZpY2U6aW1hZ2Uub3BlcmF0aW9ucyJdfQ.3VGvJeiTq_Fcbvbzyk7Z1BrlHZaOvE7PTkehvl5whUQ\" alt width=\"493\" height=\"799\">\n</p>\n<p>Deku: Tadaaa! I’m at the gym!</p>\n<p>—————-</p>\n<p> </p>\n<p>Katsuki’s phone went off with the all too familiar sound. Reaching into his pocket and ignoring Denki and Eijiro’s inane screeching he opened up Deku’s DM’s, and it was at that very point he regretted it.</p>\n<p> </p>\n<p>Oh good God. There he was. Deku was in the merch he had sent him earlier today and he looked fucking GOOD. Katsuki wanted to smash his head into a wall just to stop the stampede of thoughts that cursed his mind.</p>\n<p> </p>\n<p>His face was bright red and he could feel sweat building on his brow. Calm down Katsuki, calm the fuck down! Don’t let Deku know that you’re having gay panic!</p>\n<p> </p>\n<p>—————-</p>\n<p>KaboomKing: Holy shit<br>KaboomKing: You’re actually taking care of yourself for once?<br>Deku: ヾ(＠＾▽＾＠)ﾉ yeh! Proud of me?<br>KaboomKing: Text me after you’ve actually worked out for an hour, then we’ll see.<br>Deku: Meanie! (ﾉಥ益ಥ）ﾉ ┻━┻<br>KaboomKing: That emoji is awful.<br>Deku: UwU<br>Deku: Off I go to get SWOL!!<br>KaboomKing: That’s a real funny mental imagine<br>Deku: ヽ(｀Д´)ﾉ GRRR<br>—————-</p>\n<p><br>Izuku let out a soft giggle and tucked his phone away and moved to the next machine.<br><br></p>\n<p>Izuku stepped onto a nearby treadmill and started at a slow pace before upping it to a brisk jog after a few moments once he’d adjusted. He had been going for nearly 15 minutes when someone stepped onto the one next to him. Izuku paid him no mind, opting to keep running.</p>\n<p> </p>\n<p>“Hey there cutie~” A voice next to him rang out.</p>\n<p> </p>\n<p>Izuku looked over and saw a man with raven colored hair and intense yellow eyes. He was taller than Izuku, though most men were to be fair. “Don’t think I’ve seen you ‘round here before.” The dark haired man purred out.</p>\n<p> </p>\n<p>“O-oh, w-well… I don’t r-really get to go t-to the gym o-often.” Izuku sputtered, averting his eyes back to the wall.</p>\n<p> </p>\n<p>“Really? Could have fooled me twice.” The man chuckled, giving Izuku a look down. </p>\n<p> </p>\n<p>This was bad. This entire situation felt bad. Alarm bells were blaring off in Izuku’s head to get out of this situation and go home. “O-oh. Um, th-thank you?” Izuku let out a soft laugh </p>\n<p> </p>\n<p>“So you from around here?” The stranger quipped, now having his treadmill at a slow walk.</p>\n<p> </p>\n<p>“Uh, no.” Don’t give him too much info Izuku, that's dangerous.<br><br>“Mmmmm.” The raven haired man purred. “And exactly where are you from cutie? You in college? You look young.”<br><br>“I- uh. Ahem. Oh crap is it really getting th-that late. S-sorry, but I really need to g-get going. M-my uh, b-boyfriend is gonna get worried.” Izuku turned off the machine and slowly began to walk towards the locker room.<br><br>“A boyfriend huh? Well what he won’t know won’t hurt ‘em, right sugar?” The larger man practically pinned Izuku to the machine, his pupils blown out as he watched the greenette tremble under him.<br><br></p>\n<p>“Oh he’s uh…” Izuku tried to think of any excuse, anything to get out of this situation. “H-he and I h-had plans. I r-really sh-should go. It was n-nice talking to you. B-but I really need to go!” Izuku shoves past the raven haired man and jogs towards the locker room.</p>\n<p> </p>\n<p>Breathing a sigh of relief he noticed the stranger hadn’t followed him in. As quickly as possible Izuku changed into his normal clothes, forgoing a shower and trying to get out of the gym as fast as possible.</p>\n<p> </p>\n<p>—————-<br>7:22pm Deku: Kacchan I’m scared….<br>7:22pm Deku: Some creepy guy kept talking to me.<br>7:23pm Deku: He almost didn’t let me leave.<br>7:23pm Deku: I’m leaving the gym now….<br>7:23pm Deku: I’ll text you when I get home.</p>\n<p>—————-</p>\n<p> </p>\n<p>Setting his phone in his pocket, Izuku made his way towards the front of the building. The sun had already started to set, and it was pretty dark out by now. Izuku started making his way to the train station before an all too familiar voice stopped him.</p>\n<p> </p>\n<p>“Hey there cutie~” </p>\n<p> </p>\n<p>-------</p>\n<p> </p>\n<p>Katsuki had just got done arresting a villain that attempted armed robbery on a small convenience store, their quirk absolutely no match for his own. His phone had gone off awhile ago but Katsuki had been so caught up in the robbery he didn’t have time to check.</p>\n<p> </p>\n<p>When the blonde turned on his phone he nearly dropped it seeing the last messages Deku had sent.</p>\n<p> </p>\n<p>—————-<br>7:22pm Deku: Kacchan I’m scared….<br>7:22pm Deku: Some creepy guy kept talking to me.<br>7:23pm Deku: He almost didn’t let me leave.<br>7:23pm Deku: I’m leaving the gym now….<br>7:23pm Deku: I’ll text you when I get home.</p>\n<p>—————-</p>\n<p> </p>\n<p>The time now was 8:47pm. Izuku would have had plenty of time to get home and text him. Anxiously Katsuki clicked the call button and waited for Deku to answer. Maybe he just fell asleep? Maybe he was cooking dinner? Calm down Katsuki, he’s probably fine.</p>\n<p> </p>\n<p>No answer. He tried again. No answer. And again. Still no answer.</p>\n<p> </p>\n<p>This was bad.</p>\n<p>Izuku froze, staring at the man before him. Slowly he began to back away, panic rising in his chest.In the moment Izuku struggled to say anything, only managing to say a pitiful \"Uh...\"</p>\n<p>“I don’t like being ignored.” The raven haired man growled, stepping closer to Izuku, a smirk darting across his angular features. “How about you and I go somewhere else, huh? Be a dear and follow me.”</p>\n<p>It was like his body was possessed by those words. Izuku found himself slowly beginning to follow the stranger, his legs practically moving on their own. Was this a quirk?? Fear collected deep into Izuku’s gut, betraying the answer he already knew. This was bad.</p>\n<p>Terrified, Izuku looked around for anyone to notice what was happening, begging for someone to help. His mind flitted to DynaMight swooping in and saving him from this terrible situation. Holding him in his strong muscular arms, blasting this freak away.</p>\n<p>“There you go, that’s my boy.” The creep purred, wrapping an arm around Izuku. </p>\n<p>He felt disgusted being touched by this stranger, desperately trying to push him away. Whilst his legs may have been moving on their own, Izuku discovered he sure as hell could still move his arms. He shoved at the taller man, trying with desperation to free himself with all the strength that he could muster. “Please stop!” Izuku begged, no longer holding back his voice.</p>\n<p>“Be a dear and stop hitting me.” The amber eyed man growled in retaliation, and instantly Izuku ceased struggling . Undeniably, this was his quirk in use. </p>\n<p>After maybe twenty minutes of walking, the two had made it down a dark alley, Izuku’s mind now filled with unimaginable fear. What was going to happen? Was this creep truly going to try to attempt THAT in this alley? </p>\n<p>A chorus of ‘No” overwhelmed all of Izuku’s thoughts. He had to get away, regardless of whether he had a Quirk or not, this was bad. </p>\n<p>“You’re so pretty, you know that? Your eyes remind me of the forest at night. Such a cute little face...” The taller man cooed. Such flattering words might have sounded romantic if they were by anyone else, yet Izuku wanted nothing more than to vomit in response.</p>\n<p>The taller man shoved Izuku up against the alley wall and attempted to kiss him, only for Izuku to bite at his lip harshly, blood splattering between the two.</p>\n<p>“Ohhh, this Kitty has claws! I love when they fight back!” The creep cackled, shoving Izuku down even harder. “C’mon kitten. Try and fight back. I dare you.”</p>\n<p>Izuku hissed and shoved his knee right into the taller man's groin as hard as he could, earning him a harsh groan of pain before the stranger released his deathly grip on Izuku long enough for him to get a head start and run. </p>\n<p>Right as he felt hopeful he could get away from this volatile man, he felt a tug on his arm, pulling him backwards. This can’t be happening!</p>\n<p>“Oh no no no, you’re not getting away that easy!” The man laughed as he pulled at the greenette harshly. </p>\n<p>Intense burning pain ran throughout Izuku’s body, his vision going blurry. Then he heard it, a sickening snap. The taller man had broken his arm.<br>Izuku let out a blood curdling scream as he writhed in pain. It was like molten lava had been poured over his arm as a horrific searing pain the viridian haired boy had never felt before consumed him. Everything began to go hazy.</p>\n<p>The stranger scoffed, pulling Izuku back to the wall. “Be a dear and stop screaming so much.”<br>The greenette stared down at his now mangled arm, blood dripping to the floor below him. Izuku didn’t stand a chance against him. His entire body was screaming, begging him to move and yet here he was frozen in fear. Just move dammit! Get out of there! But he couldn’t, no matter how hard he tried.</p>\n<p>“Aw, my poor kitten. You look so upset. I’m sorry, but you were trying to get away and I just couldn’t have that.” The raven haired man said gently, pushing Izuku’s curls out of his face and brushing at his soft cheeks.”You’re far too cute for me to just let you go.” </p>\n<p>“P-please, please just let me go.” Izuku cried, his eyes burning from the tears begging to escape his emerald eyes.</p>\n<p>“I don’t think so. Be a dear and let me have fun with you.” The man smiled, Izuku felt a shiver run down his spine as he peered into those awful yellow orbs. </p>\n<p>He again thought of DynaMight rushing in to save him from this situation. He thought about that gorgeous blonde hair, and how he probably smelt like burnt sugar. He’d blast this freak into the next century, then take him somewhere safe. Maybe the two would meet eyes and a blossoming romance could form between the two.</p>\n<p>Izuku kept his mind on that fantasy as a taller man before him did as he pleased, Izuku slowly losing consciousness from blood loss.</p>\n<p>Slowly everything went black.</p>\n<p>-----------</p>\n<p>Katsuki was a mess, an absolute panicked mess. He hadn’t heard from Deku in hours now. It was nearly 3 in the morning, but still no messages. He didn’t know Deku’s address,but he knew at least what city he was in from the P.O. Box. However, even by plane it was 3 hours from where Katsuki lived in Tokyo.</p>\n<p>Katsuki paced in his office, trying to think of what to do as panic and fear flowed throughout his entire body. A knock came at his door, pulling the blonde from his thoughts. “What?!” </p>\n<p>It was his closest friend, Eijiro. The redhead awkwardly shambles into the room, giving Katsuki a sympathetic look. “Hey man, got a call that you were still in the office and pacing around. What’s going on?”</p>\n<p>How could Katsuki even begin to explain? He ran a calloused hand through his ash blonde hair and sighed. “A uh-“ Katsuki paused, trying to find the right words. “A friend of mine hasn’t texted me in a few hours. He said some freak was chatting to him at the gym and suddenly he went quiet.”</p>\n<p>Eijiro gave Katsuki a confused look, processing just what the blonde had said. <br>“Holy shit.” was all that managed to come out.</p>\n<p>“Yeah…”</p>\n<p>“When did he last text you?”</p>\n<p>“7pm…” Katsuki mumbled. </p>\n<p>Eijiro gasped, now starting to understand his friend's panic.<br>“That’s… fuck, what nearly 8 hours?” </p>\n<p>“Yeah. He said he’d text me when he got home, but I haven’t gotten shit since then. I’ve called over and over again with no answer.” </p>\n<p>“Should… I mean, can we send out a missing person report? Maybe get someone to go check?” </p>\n<p>“I don’t know, I’m not even sure where he’s at. Hell, I don’t even know the guy's actual name.” Katsuki let out a weak laugh. Yeah, this situation was fucked.</p>\n<p>“You don’t know your own friend's first actual name?” Eirjiro asked, confusion in his voice.</p>\n<p>“It’s complicated. I’ll… I’ll explain later. Right now I just need to figure out if the guy is alive.” Katsuki was shaking now, visions of Deku’s body found dead in a gutter flashing before his eyes.</p>\n<p>“Hey hey hey, it’s okay Kats. We’ll find him. Give me any information you can and I’ll forward it so we can try and find him, okay?” Ever the ray of sunshine and hope, Eijiro clasped a hand onto Katsuki’s and gave him a bright smile.</p>\n<p>“Yeah. Yeah okay sure.”</p>\n<p>Katsuki gave a description of Deku and what information he could, and soon Eijiro was off to forward the intel. With luck, they might actually find him safe and sound. But those chances were slim.</p>\n<p>———</p>\n<p>Izuku regained consciousness, his body stiff and sore. He surveyed his surroundings and found that no one was around. He had been left in a dark dingy alley but could hardly remember how he got there. Izuku attempted to sit up but the worst pain he ever felt shot through his entire body. His arm and legs were broken. This was bad.</p>\n<p>What time was it even? How far was he from home? How was he gonna get help?</p>\n<p>All these thoughts raced through the greenettes mind as he lay motionless, scared and alone. He wished Kacchan was here to talk to him, help him through his panic, his calm husky voice giving him comfort.</p>\n<p>But he couldn’t have that. <br>He was alone. <br>No one was here to save him.</p>\n<p>Hot tears started to stream down Izuku’s face as he laid motionless. Desperately Izuku tried to piece back what exactly had happened to him but every time he tried, nausea crept over his entire being and he wanted to vomit.</p>\n<p>Maybe this was it. This was how he died. Sad and alone in a dark alleyway with broken limbs, probably getting infected. What a hell of a way to go out. A quirkless loser nobody cared about.</p>\n<p>With heavy eyes, Izuku started to feel his consciousness being taken from him again. Maybe sleep was a good idea. Yeah.</p>\n<p>-------------</p>\n<p>“Hey! I think I found something!” A voice called out, waking Izuku from his slumber. </p>\n<p>He could hear footsteps drawing close. With the last bit of energy that Izuku had he tried to call out. “H-hello? P-please help…” Was all he could muster. His throat felt dry and hoarse, probably from screaming. Every inch of him was on fire and all he wanted to do was sleep. But help was coming, or at least he hoped so.</p>\n<p>The footsteps came closer and closer, Izuku could barely make out who it was. A few figures stood before whim, clearly asking questions but Izuku couldn’t hear it in his haze.</p>\n<p>“He’s barely holding on. Get the EMT’s now!” One of the voices yelled, another person bending down to examine Izuku’s body.</p>\n<p>He felt a warm hand press against his face, tears yet again falling from his now red and exhausted eyes. </p>\n<p>“It’s okay now. You’re safe.” A voice hummed, and Izuku believed them.</p>\n<p>He was slipping back to the darkness, his eyelids feeling heavy again. </p>\n<p>“Thank you…” was all he could say before passing out.</p>\n<p>----------</p>\n<p>Izuku woke to the sound of machines beeping and the smell of disinfectant. <br>His entire body felt like he had just been hit by a freight train. Slowly, Izuku began to open his eyes and peered around, taking in his surroundings. A hospital?<br>Looking down Izuku noticed his arm and both legs were in casts, seemingly his left arm the only thing left alone. He should have been thankful, but all he felt was dread. Izuku clicked the nurse call light, hoping for some answers and perhaps he could get his phone back to text Kacchan and his mother what had happened.</p>\n<p>After a few moments a nurse came in, with the brightest smile Izuku had ever seen. She had adorable lilac hair and bright sky blue eyes, soft star freckles littered across her cute pale features. “Ah! You’re awake! That’s wonderful! How are you feeling?”</p>\n<p>“In a lot of pain.” Izuku admitted, giving a weak laugh. “Feels like I got hit by a train, honestly.”</p>\n<p>“I’ll get you some more pain meds, you poor thing… you had a lot of injuries! I looked over your sheet and goodness! Multiple fractures through your arm and legs, it took nearly 12 hours of surgery to fix you up!”</p>\n<p>12 hours…? How much time had Izuku lost? The freckled boy started to feel panic rise in him once again. “E-excuse me ma’am, but how long was I asleep?”</p>\n<p>“Oh let me see.” The lilac haired nurse hummed, looking over Izuku’s paperwork. “It says here you’ve been out cold for four days now. Goodness! Your body needed a lot of rest, huh?” The nurse beamed, still keeping her gentle smile. </p>\n<p>Four days?! Izuku had been out cold for four friggin days?! He was hyperventilating at this point, the kind nurse running to Izuku’s side to calm him down.</p>\n<p>“Hey now, hey! It’s okay honey. Shhh” The nurse's hair started sprouting small flowers and a calming smell of gooseberries and lilacs filled the room. Izuku started to instantly calm, his eyelids feeling heavy.</p>\n<p>“Now, there’s no sense in freaking out, okay honey? I’ll get you your pain meds. Some police officers are gonna come by to talk to you here soon and ask you some questions. Are you okay talking to them?”<br>Izuku gave a weak nod to the nurse, his mind feeling foggy but calm.</p>\n<p>“When they got me here, did they bring my bag? I’d like to have my phone please.” The viridian haired boy asked, his voice shaky from trying to keep conscious.</p>\n<p>“I think the police officers took it with your other things, but I’ll ask if you can have them back. Give me a moment, okay honey?” The nurse smiled kindly, her quirk letting out more of that wonderful gentle smell.</p>\n<p>The nurse went to get the greenette his medications, making sure to notify the officers as well as Izuku’s doctor that he had finally woken up.</p>\n<p>The freckled boy sat in the hospital bed, his emotions all over the place. His day had started out so amazing but ended in the worst way possible. All he wanted now was to curl up in bed, cuddle his giant DynaMight plushie, talk to Kacchan and cry. </p>\n<p>If he had been here for 4 days then not only did he miss Christmas but he missed his and Kacchan’s, er, “date” thing. This realization made the greenettes mood sour even more. Everything that could go wrong had gone wrong.</p>\n<p>--------</p>\n<p>After what felt like hours, two police officers walked into the room, both giving Izuku a gentle smile. “I see you’re finally awake, that’s wonderful. I’m Officer Tsukauchi, and I was assigned to your case. What exactly do you remember? Do you know your name?”</p>\n<p>“I’m… Midoriya Izuku. I remember―“ Izuku paused, nausea yet again coming back. Tears threatened to escape his eyes.</p>\n<p>“Take your time.” The taller man offered gently.</p>\n<p> “A-a man, with r-raven hair and yellow eyes. H-he um. He h-had some kind of quirk that made me follow his c-commands.” The greenette sobbed. It was all coming back now. “I t-tried to escape a-and he b-broke my arm. After that I-I blacked out I-I think…” Izuku felt sick. He wanted to forget it all. Burn those memories to the ground.</p>\n<p>“I see…” The Officer said, his voice sympathetic. “You’re lucky, three pro heroes found you in that alleyway and saved you.”</p>\n<p>Izuku blinked back tears, Three pro heroes came to save him? Everything was a blur, but he remembers voices talking to him. He remembers seeing faint figures but no idea who.</p>\n<p>“W-who may I ask found me?”</p>\n<p>“DynaMight, Red Riot and Chargebolt.” The Officer stated, now writing in his notes. “There apparently was some big dispatch going on to find someone marching your exact description and multiple pro heroes and officers were on the hunt.”</p>\n<p>Izuku stared at the man, his mind spinning. Did Kacchan call the police? He had to have, no one else knew he was missing and his last message to him was now days ago. Izuku’s heart started to flutter, feeling warm that his friend had cared so deeply about him and hell bent on getting him safe that even pro heroes were out looking.</p>\n<p>Then something hit him. DynaMight saved him. Fucking DynaMight had found his body in that alleyway and saved his life! Holy SHIT! Izuku was nearly over the moon, despite the undesirable circumstances. DynaMight did come and save him from that horrible situation! Sure, it wasn’t as he had envisioned but that didn’t matter. </p>\n<p>“C-can you please tell them thank you f-for me? Or anything?!” Izuku stammered, now sitting up in his bed.</p>\n<p>The officer stared at Izuku, looking panicked for the sudden movement. “Hey kid, calm down! Don’t move so suddenly!” </p>\n<p>“P-please… I just need them to know h-how grateful I am…” the freckled boy sobbed out. “I know it’s just their job, but if you could somehow pass on a message I’d be so grateful. Please.”</p>\n<p>Tsukauchi sighed, running a hand through his dark hair. “Just uh. Here. Write down what you want to say and I’ll see if I can pass it along.”</p>\n<p>Izuku practically beamed at that. With his left hand Izuku attempted to write out a message on the piece of paper the Officer had given him. It wasn’t perfect but he tried his best. The message was still legible in the end, which was all that mattered.</p>\n<p>“Alright, if that’s all then we’ll be going. If we have any more questions we’ll be in touch Oh and, here’s the personal belongings that you had on you when you were found.” Tsukauchi offered, sitting down Izuku’s big yellow bag on the bed before leaving. “Have a good day Mr. Midoriya.”</p>\n<p>Izuku stared at the walls dumbfounded. <br>Everything was terrible, he’d gone through such a disturbing and painful event, and yet he was giddy. He had truly been saved by his favorite hero and he couldn’t believe it. <br>Not only that but Kacchan had probably put out a notice for him to be found.<br>For once in his life he had a friend who cared about his well being, and was worried for him. Izuku had never had that kind of feeling before, and it made his heart warm at the thought.</p>\n<p>Reaching into his bag, Izuku pulled out his phone. Thanking all the Gods in the universe, it somehow still had some battery after 4 days. It was at 15% but that was enough.</p>\n<p>Izuku opened Discord and saw he had 15 missed messages from Kacchan and 20 missed calls. He couldn’t believe it. Kacchan really was worried for him!<br>Each message made Izuku’s heart sink, however.</p>\n<p>—————-<br>KaboomKing: Hey sorry work was busy, you home?<br>KaboomKing: I’m getting worried, dude. Please text me soon…<br>KaboomKing: Are you okay?<br>KaboomKing: Deku please be okay.<br>KaboomKing: Deku I’m scared, are you alive??<br>KaboomKing: Please god just reply!!<br>KaboomKing: I’m losing my fucking mind please call me or something so I know you’re okay!<br>KaboomKing: Deku this isn’t funny, please call me or something <br>KaboomKing: Deku please be alive<br>KaboomKing: I’m so worried……..<br>KaboomKing: Deku please come back….<br>KaboomKing: It’s been 6 hours now….<br>KaboomKing: I can’t stop thinking about your body somewhere dead on the streets and it’s eating me alive...<br>KaboomKing: I’m begging please just text me back!<br>KaboomKing: Deku….<br>——————-</p>\n<p>Izuku held his phone tight in his only good hand, tears trailing down his face. Kacchan cared for him. Kacchan was worried.</p>\n<p>Before he could even think, he called Kacchan.</p>\n<p>Ring. Ring. Ring.</p>\n<p>--------</p>\n<p>Katsuki was sitting in his apartment, it was his day off but he had been an anxious wreck ever since this entire situation started. He knew pieces of what had happened but the police were now handing the investigation so he wasn’t allowed much intel. </p>\n<p>All of a sudden this phone started ringing, that all too familiar ringtone. </p>\n<p>[Deku Is Calling…]</p>\n<p>Katsuki practically leaped for his phone to answer.</p>\n<p>“D-Deku?!”</p>\n<p>“Kacchan!” Deku cried out. “M-my phone is at 15% battery but I-I’m alive! I’m so sorry for worrying you!”</p>\n<p>Katsuki let out a low hiss. “Idiot… Don’t apologize for that. You’re safe and that’s what matters…”</p>\n<p>“Probably won’t be streaming for a while.” Deku laughs weakly. “That guy uh… broke my arm and both my legs.”</p>\n<p>Katsuki’s stomach dropped. He remembers seeing Deku’s small body covered in blood and bruises when he found him. The image of him haunted his dreams for the past few nights, but he had hoped it was all surface level. Katsuki wanted nothing more than to find the man who did this and kill him slowly and painfully. He felt a rage deep into his core that he had never felt before in his life.</p>\n<p>“I’ll be okay though! No need to worry about me now! I’m-“ there was a pause. “I assume it was who you contacted the police?” </p>\n<p>“Yeah. It was.” Katsuki could feel tears prickling at his eyes. He should be there. He should be there comforting Deku, making sure he’s okay and taken care of. Feeding him soup or whatever you do to help injured people.</p>\n<p>“Thank you Kacchan… you’re honestly the most amazing friend I’ve ever had. No one has ever cared for me like this…”</p>\n<p>That only made Katsuki’s heart sink deeper. Has he never had friends before? Literally no one?</p>\n<p>“Well…” The blonde pauses, thinking over his words. “I care for you ‘n shit. So get used to it, fucker.” </p>\n<p>There was a happy hum from the other end of the line. “I care for you too, Kacchan. You’re amazing.”</p>\n<p>Katsuki could feel the tips of his ears heating up at that. Fuck, he wanted to run to the hospital right now, give that loser a big hug and make everything better. </p>\n<p>“My phone’s at 5% battery… I gotta go, but I’ll talk to you later.”</p>\n<p>“Okay… keep me updated”</p>\n<p>“I will. Bye Kacchan.”</p>\n<p>“Bye, nerd.”</p>\n<p>Click. </p>\n<p>Katsuki stared at the ceiling, contemplating what to do. On one hand, if he revealed himself now he would be Deku’s hero. He saved him and he could finally go and see the nerd.</p>\n<p>On the other hand, the poor guy was an emotional wreck right now and adding to it that his favorite hero has been talking to him for nearly 2 months (and might be in love with him), could only add to the emotional distress he was going through.</p>\n<p>This was a mess. A gigantic mess that Katsuki wasn’t even sure how to handle.</p>\n<p>------------</p>\n<p>It has been a few days since Izuku had been at the hospital, and he was now being discharged. His legs and arm were doing better, a pro hero even came by to help the healing process. Recovery Girl is what they called her. She took off Izuku’s cast and examined his limbs, giving him a once over.</p>\n<p>“Your legs are fine thankfully.” Recover Girl began. “However, due to how your arm was broken there will now be scarring left over. Sadly even my quirk can’t fix that. Be careful with it, it’s gonna have some permanent damage after what you’ve been through.” </p>\n<p>“I recommend you get lots of rest at home and try to stay off your feet as best you can. We’re gonna send you off with crutches too so you don’t put too much pressure on them.”</p>\n<p>Izuku nodded, thankful he could finally go home. He was starting to feel a bit stir crazy being at the hospital for so long and being without his phone only drove Izuku more insane.</p>\n<p>“Thank you for everything you’ve done.” The ocean haired boy gave a shy smile, looking over his arm. He couldn’t believe one man had managed to do this, but he figured in a super human society anything was possible.</p>\n<p>Izuku packed up the rest of his things and slowly began his walk home, grabbing the crutches the nurse had offered him to make his way out of the hospital. Usually he’d opt to take the train home, but given his limited mobility he got an Uber and accepted the fees that came with it.<br>He’d rather spend the extra money than hurt his body more than necessary<br>.<br>Once home, Izuku immediately plugged in his phone and plopped on his bed.<br>Izuku had never been happier to lay on his own bed until now.<br>He was home and safe now.</p>\n<p>——————-<br>Deku: Guess who’s alive<br>Kacchan is typing……….<br>——————-</p>\n<p>Kacchan is typing?!</p>\n<p>——————-<br>Kacchan: Fucking hell, took you long enough. Are you okay now?<br>Deku: You changed your username to Kacchan??<br>Kacchan: Yeah. Thought it might make you happy or whatever….<br>Deku: It does. Thank you Kacchan<br>Deku: I’m okay, but uh<br>Kacchan: Uh?<br>Deku: How do I put this…<br>Deku: Might be better if I explain it through words instead of text.<br>Kacchan: Alright.</p>\n<p>——————-</p>\n<p> </p>\n<p>Katsuki was quick to call Deku, his fingers practically smashing the call button. He couldn't admit it but he’d missed hearing that nerd's voice, and with the lack of streams his longing only grew. </p>\n<p> </p>\n<p>“K-Kacchan?” Deku’s voice rang through, like a beautiful symphony that the forested man had conducted just for Katsuki. </p>\n<p> </p>\n<p>Katsuki took in a sharp breath, trying to still his nerves. “Hey nerd.” </p>\n<p> </p>\n<p>“Man, it's been awhile since I’ve talked to you. Well, not really I guess, but I don’t think I’ll ever get use to how you sound.” A nervous laugh came from the other end of the line.</p>\n<p> </p>\n<p>Katsuki couldn’t help but feel a blush run across his pale features. The same could be said for how Katsuki felt towards Deku’s soft gentle voice. Every time he heard the greenette speak, it was like electricity through his veins. A tidal wave of evergreen that he’d longed to hear, taking his breath away in the process. </p>\n<p> </p>\n<p>The best way he could describe Deku’s voice was like a home he’d never been to but knew it’s where he belonged. A warm afterglow of fire in the cold winter months that wrapped itself around Katsuki. A song he’d never heard but knew the lyrics to by heart. It was everything he’d longed for but knew he couldn’t have.</p>\n<p> </p>\n<p>“So, you gonna tell me what happened?” Katsuki barked out, getting a small whine from Deku.</p>\n<p> </p>\n<p>“Well…” There was a pause, Deku clearly thinking through his words. “The man who was harassing me at the gym, he uh.” Another pause as Deku took in a sharp breath. “He followed me outside, a-and uh. I think he had some kinda quirk that made you do what he said. S-so I followed him. Oh god, Kacchan I…” Deku sobbed out. “I should have been stronger!”</p>\n<p> </p>\n<p>Katsuki’s blood went cold, slowly piecing together what exactly had happened. “Deku… Oi! No! Deku, it's not your fault. Don’t blame yourself for this kinda shit.”</p>\n<p> </p>\n<p>“I tried to get away, a-and he grabbed me and broke my arm and legs. Everything started going black after that but… God, I feel so gross Kacchan. Crap, I’m sorry. This is a lot right? I shouldn’t be telling you all of this. You have enough to deal with.” He could hear Deku sobbing at this point, desperately wanting to hold onto the smaller man. Deku was drowning, deep beneath the surface, and Katsuki wanted nothing more than to be someone to grab onto. To pull him back up and allow him to breathe.</p>\n<p> </p>\n<p>“Oi!” Katsuki snapped, now feeling a rage boil beneath his skin. “Stop that shit! You didn’t cause any of that shit, and I sure as hell ain’t some weak shit that can’t handle hearing this. If I didn’t wanna know I wouldn’t have asked!” Katsuki was shaking, his palms sweating as he tried not to set off any small explosives. He could burn this entire complex down with the rage he felt boiling deep inside him. “Please…” His voice was low, nearly a whisper. “Please Deku, just let me… Let me listen. Its the least I can fuckin’ do.”</p>\n<p> </p>\n<p>There was a low exhale, Deku clearly trying to calm his nerves. “Thank you Kacchan… I needed that. After they took my cast off, they said uh… ahem, they said there’d be permanent damage. I have some pretty nasty scars now. Every time I look at them I kinda wanna vomit.” A soft, anxious laugh escaped Deku’s lips. “I’m still not sure why he picked me, or why he did what he did. The police are still working on my case but don’t have a lot of answers. But they think they might know why.”<br><br><em> Permanent damage? Christ how badly did this man fuck up Deku? When I find this man I’m gonna blow his fucking head off so hard it’d be sent to space. </em> Katsuki gritted his teeth, trying not to let his rage apparent in his voice else he scare Deku. “Why?” Was all he could manage out, his blunt nails digging into the palm of his hand, nearly making him bleed.</p>\n<p> </p>\n<p>“Seems he has a thing for hunting down quirkless people, I guess. Least that’s the current theory, since there’s other cases like mine. But each person is quirkless that’s been left like me.” Deku sighs, some rustling sounds on the end of the line that Katsuki can only assume is the freckled man running a hand through his mass of curls. “I guess I should count myself lucky, in a messed up way. A few were found dead.”</p>\n<p> </p>\n<p>That made Katsuki’s blood turn to ice. He couldn’t believe what he was hearing. Dead?! And Deku dared to think he was somehow lucky after this fucked up thing that had happened to him?! Katsuki wanted to shake the man, yell at him, tell him how he deserved better and that this wasn’t something he should be okay with. But he knew that would only make the situation worse, he knew that would just terrify the poor forested haired boy.</p>\n<p> </p>\n<p>“Are-... are you safe where you live?” The blonde gritted out, fear running rampant through his body.</p>\n<p> </p>\n<p>“I think so? The gym I go to is 30 minutes or more from where I live, so I doubt the guy could find me.” Deku said, sounding more relaxed now. “I guess the worst part is being alone through this all. Well, physically alone. I at least get to talk to you.” There was a somber tone to how Deku was speaking, clearly wanting to meet Katsuki in person. But could he risk that? Every fiber in his being SCREAMED to meet up with Deku, to finally see the man that made his heart swell and his skin feel like he’d been struck by electricity.</p>\n<p> </p>\n<p>He’d wondered how the smaller man sounded without the filter of a microphone, how his gentle laugh would seep deep into his skin and pull out every anxiety and fear with it. How those gorgeous emeralds would sparkle looking up to him and him alone, the crinkle of his eyes as he smiled, every inch of him pouring out love.</p>\n<p> </p>\n<p>Katsuki wanted that, but he didn’t think he deserved it. Not after who he was as a teen. Sure he’d gotten a lot better and been through years of therapy, but guilt remained heavy in his heart. He was no better than those bullies that pushed Deku down, who treated him like scum of the earth.</p>\n<p> </p>\n<p>And at the back of his mind, remained a strange confusing memory of green that he couldn’t seem to escape. Something that had drawn himself closer to the stranger he met that fateful day. Katsuki tried not to think about it too hard, but it kept pestering the back of his mind.</p>\n<p> </p>\n<p>“Yeah…” Katsuki grunted out. “I’ll make sure you aren’t alone.”</p>\n<p> </p>\n<p>“W-would… uh. Would it be weird if we talked longer? Like, if I went to bed and could s-still talk to y-you?” </p>\n<p> </p>\n<p>A blush crept along Katsuki’s cheeks, he moved his phone away from his face as he stared blankly at it. Did Deku want to fall asleep hearing Katsuki talk? </p>\n<p> </p>\n<p>“What’dya mean?”</p>\n<p> </p>\n<p>“O-oh well? Um, I was wondering if…” There was a long pause. “Never mind, forget it. Its dumb.” Another anxious laugh. Katsuki wasn’t having this.</p>\n<p> </p>\n<p>“Deku.” A small yelp from the other end of the line. “I can talk to you while you fall asleep.”</p>\n<p> </p>\n<p>There was silence, long enough silence that Katsuki was starting to worry Deku had hung up actually. Then, came the softest, gentlest tone that Katsuki had ever heard in his life. “Thank you Kacchan. You really get me, huh?”</p>\n<p> </p>\n<p>It was like diving into the cold ocean on a hot summer day, your body submerged under the endless abyss. Feeling lost but found all at the same time. Katsuki could instantly feel his body slump, his nerves allowing in the calmness that overcame him. That beautiful song he longed for.</p>\n<p> </p>\n<p>“Yeah.” Was all Katsuki could rasp out, the feeling of sinking deeper into this man's life slowly encompassing him. </p>\n<p> </p>\n<p>The two talked for a few more hours, Katsuki going into his kitchen eventually to start cooking dinner while Deku listened and giggled when Katsuki would swear at something in utter annoyance. It felt like this was how it was meant to be all along. Up until now Katsuki enjoyed the silence his life had brought, the moments where he was alone and could just allow the world to fade behind him.</p>\n<p> </p>\n<p>But now he couldn’t stand the quiet. Now he wanted to hear Deku’s soft voice, the way he could ramble about nothing, how warm his presence felt and how every inch of Katsuki's skin lit up like a forest fire. Every part of his body had started to long for the freckled boy that was starting to steal his heart nearly two months ago.</p>\n<p> </p>\n<p>Katsuki had never believed in love at first sight, but he was slowly starting to wonder about it.</p>\n<p> </p>\n<p>When night began to make its way in, Katsuki couldn’t help but look out his large window to see the sun set and stars creep their way across the sky. “Hey, Deku.” Katsuki hummed, hearing some shifting sounds from the other end.</p>\n<p> </p>\n<p>“Yes Kacchan?”</p>\n<p> </p>\n<p>“You by a window?” Katsuki ran a hand through his hair, wondering now if maybe this was a dumb idea.</p>\n<p> </p>\n<p>“Uh, no. Why?” Deku chirped out, now shifting from where he’d sat.</p>\n<p> </p>\n<p>“Go near one, nerd.”</p>\n<p> </p>\n<p>“W-why?”</p>\n<p> </p>\n<p>“Just do it!” Katsuki barked out, feeling the flush rise to his ears.</p>\n<p> </p>\n<p>“Okay, okay!” Deku laughed, scrambling to get to a nearby window. “Alright. I’m by a window.”</p>\n<p> </p>\n<p>“Okay…” There was a long pause before Katsuki spoke. “Anytime you feel alone, try and look up at the sky. Cause we’re always gonna be lookin’ under the same sky, the same stars, the same moon. Got it?” </p>\n<p>\n<img src=\"https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/39877eee-ef02-4b06-83ae-f41eff3e7878/dekrgbw-793275d2-5888-4dc8-b55c-2abf5432cb0d.png/v1/fill/w_1012,h_789,q_70,strp/hold_me_3_by_rad_pax_dekrgbw-pre.jpg?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOjdlMGQxODg5ODIyNjQzNzNhNWYwZDQxNWVhMGQyNmUwIiwiaXNzIjoidXJuOmFwcDo3ZTBkMTg4OTgyMjY0MzczYTVmMGQ0MTVlYTBkMjZlMCIsIm9iaiI6W1t7ImhlaWdodCI6Ijw9OTk4IiwicGF0aCI6IlwvZlwvMzk4NzdlZWUtZWYwMi00YjA2LTgzYWUtZjQxZWZmM2U3ODc4XC9kZWtyZ2J3LTc5MzI3NWQyLTU4ODgtNGRjOC1iNTVjLTJhYmY1NDMyY2IwZC5wbmciLCJ3aWR0aCI6Ijw9MTI4MCJ9XV0sImF1ZCI6WyJ1cm46c2VydmljZTppbWFnZS5vcGVyYXRpb25zIl19.JcxEnAxckmFspvHAEBn-Gtlr52dObrDByGypjJoO2Hs\" alt width=\"484\" height=\"377\">\n</p>\n<p>Silence came, Katsuki now feeling panicked he’d said something wrong, or even gone too far. The blonde started shifting from foot to foot, feeling embarrassed and awkward. Then, Deku finally spoke.</p>\n<p> </p>\n<p>“K-Kacchan…” His voice was shaky. “That… Wow. T-thank you.” He could hear the sob coming out of Deku’s throat, the way his words started to tremble into a mess before them.</p>\n<p>\n<img src=\"https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/39877eee-ef02-4b06-83ae-f41eff3e7878/dekrge0-a55481c1-9fd7-4984-8458-06c3583808cc.png/v1/fill/w_1147,h_697,q_70,strp/emerald_by_rad_pax_dekrge0-pre.jpg?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOjdlMGQxODg5ODIyNjQzNzNhNWYwZDQxNWVhMGQyNmUwIiwiaXNzIjoidXJuOmFwcDo3ZTBkMTg4OTgyMjY0MzczYTVmMGQ0MTVlYTBkMjZlMCIsIm9iaiI6W1t7ImhlaWdodCI6Ijw9Nzc4IiwicGF0aCI6IlwvZlwvMzk4NzdlZWUtZWYwMi00YjA2LTgzYWUtZjQxZWZmM2U3ODc4XC9kZWtyZ2UwLWE1NTQ4MWMxLTlmZDctNDk4NC04NDU4LTA2YzM1ODM4MDhjYy5wbmciLCJ3aWR0aCI6Ijw9MTI4MCJ9XV0sImF1ZCI6WyJ1cm46c2VydmljZTppbWFnZS5vcGVyYXRpb25zIl19.GmDrRUXyM2XByme6pXHghahHEFjjlGYEZnn-fCXUjPM\" alt width=\"604\" height=\"367\">\n</p>\n<p> </p>\n<p>There was a sad reality before them both. They were both alone, but in different ways. Katsuki had chosen to be alone, and had chosen to push people away. while Izuku had been pushed away, he had no choice in this isolation. But in the end, both longed to be found, long to find someone else that could understand them in a way that no one in this society could. It was poetic, in some sad messed up way. Each wanting the other for different but all to similar reasons, two sides of the same coin. </p>\n<p> </p>\n<p>When the sky had finally gone black and stars had crept along the endless abyss, the two remained. No words spoken, just comfortable in the other's silence. A comfort that neither were used to but both welcomed.</p>\n<p> </p>\n<p>“Mmm… Kacchan…” Deku finally spoke. “I’m really grateful to have you as a friend. I don’t really deserve your kindness but I’m very glad I have it.” </p>\n<p> </p>\n<p>Katsuki’s heart was pulled up into his throat, feeling each yank as Deku spoke. <em> No, It's me who’s undeserving. </em> Katsuki thought, pulling on the hem of his shirt. </p>\n<p> </p>\n<p>“You deserve better than what the world has given you.” Was all Katsuki could say. And it was true, spoken as though it was as obvious as the moon in the sky or the ground beneath their feet. Katsuki was many things, but he wasn’t a liar. Far from it in fact.</p>\n<p> </p>\n<p>“I-” There came another anxious laugh, one Katsuki hated to hear. “I don’t know about that Kacchan.”</p>\n<p> </p>\n<p>“I do.” Katsuki said plainly. Time and time again the world seemed to knock down Deku, and time and time again he would stand back up. But this time, Katsuki only hoped he could catch him once he fell.</p>\n<p> </p>\n<p>“You seem so sure of that.” Another laugh, but this time not full of anxiety. No, a genuine laugh.</p>\n<p> </p>\n<p>“I’m sure of everything I do.”</p>\n<p> </p>\n<p>A roar of laughter that pulled Katsuki’s heart came from the other end of the line, like a song that Katsuki had longed to hear. “You’re a very interesting person, Kacchan.”</p>\n<p> </p>\n<p>“What can I say? I’m one of a kind.” Katsuki beamed.</p>\n<p> </p>\n<p>“Y’know, I can’t help but believe you on that one.” There was some sound of movement then a soft ‘oof’ sound and finally soft rustling. “I’ve never met anyone like you, Kacchan. I’m honestly jealous of your confidence.”</p>\n<p> </p>\n<p>“Tch, ought to gain some confidence then nerd ass.”</p>\n<p> </p>\n<p>An adorable soft chuckle came from Deku, making Katsuki’s ears start to burn. “I’ll be sure to add that to the list of things to pick up from the store, how about that?”</p>\n<p> </p>\n<p>Katsuki couldn’t help but laugh, this little shithead. “Yeah? I’ll be sure to point it out at the market. Make sure you can’t miss it.”</p>\n<p> </p>\n<p>“Does that mean you’ll be taking me to the market, Kacchan~?” Deku practically purred, only making Katsuki’s face light up in flames. This. Little. Shithead.</p>\n<p> </p>\n<p>“Only to make sure you actually pick up groceries for once, maybe help your gangly ass build some mass.” A spark had been set, and Katsuki was oh too thrilled to set the match ablaze and watch this fire burn. He dared this challenge.</p>\n<p> </p>\n<p>“Ooooh, sure thing. And I’m so positive you’re the embodiment of manhood, huh?” Deku chuckled darkly, his voice dipping into a lower octave. This was bait, and Katsuki was ready to take it.</p>\n<p> </p>\n<p>“Damn straight I am! Over 6ft tall, with perfect muscular arms, a 6 pack, I’m great!” Katsuki boomed, letting his ego get to his head.</p>\n<p> </p>\n<p>“Prove it.” Was all Deku had to say.</p>\n<p> </p>\n<p>Katsuki’s brain nearly broke, feeling that threatening blush creep its way down his neck. There were many things the blonde loved, and a challenge was one of them. How dare this shitty nerd try and insinuate that he WASN’T what he said! Katsuki knew just how hot he was, though, this nerd clearly didn’t. And he couldn’t exactly send a selfie, showing his face would be an entire mess. But, you also didn’t need to show your face to show off how muscular you are.</p>\n<p> </p>\n<p>“Alright. Bet.” Katsuki smirked, those wolfish teeth visible now as he charged to his home gym. “Just don’t blame me when you realize how hot I am.”</p>\n<p> </p>\n<p>“Hmmm, don’t hold your breath, Kacchan.” Deku giggled.</p>\n<p> </p>\n<p>Positioning himself in front of his mirror, Katsuki made sure to align the camera so it wouldn’t show any of his face, then took the picture. He was sporting his usual black tank top and black sweatpants with a white line down the middle. For extra show he flexed out his left arm to show the muscles along his biceps, allowing the tight tank top to pull to his pecs and grip to his body. He’d have taken the damn thing off but knew he had some very obvious scars that a superfan would no doubt notice and pick up on. Alas, the abs were saved for another day.</p>\n<p> </p>\n<p>“Told ya.” Katsuki smirked, sending the picture over feeling every inch of pride in his body. </p>\n<p> </p>\n<p>There was silence, which sent fear through Katsuki’s mind. Did Deku figure it out? Did he figure out the truth? Fuck fuck fuck fuck! Katsuki’s mouth felt dry as he stared at his phone, unsure of what to say next-</p>\n<p> </p>\n<p>“Holy shit.” Wait, did Deku just swear? “I-I mean. Wow. Okay then.” Deku paused to clear his throat, trying to settle down his nerves. “I didn’t think you were serious, holy crap. What job do you have that you need a body like?!” Deku sputters for a second. “T-that?!” </p>\n<p> </p>\n<p>A booming laugh left Katsuki’s body as he wandered back into his living room. “So you like what you see, I take it?” At this point Katsuki wasn’t sure if he was just boosting his own ego or genuinely curious if Deku liked what he saw.</p>\n<p> </p>\n<p>“K-Kacchan! D-don’t make fun of me! Geez!”</p>\n<p> </p>\n<p>“Who said I was making fun of you?” The blonde practically purred, earning a small yelp from the end of the other line. <em> Cute. </em></p>\n<p> </p>\n<p>“Cause…” Deku paused, a loud sigh spilling from his lips. “Cause everyone makes fun of me for stuff like this.”<br><br>“Stuff like this?” Katsuki sat on his large black leather sofa, a brow cocked though at no one in particular.</p>\n<p> </p>\n<p>“Y’know, the whole…” A long nervous pause, ss Deku thinks on what to say next. “Not being straight, thing...” His voice was practically a whisper as he spoke. Each word wobbles and is softer than the last.</p>\n<p> </p>\n<p>Katsuki froze, his face turning 4 shades redder. Did he just hear that right? Did Deku seriously just confirm that he was into guys? “So, you…” Katsuki gulped, his hands feeling sweaty all of a sudden. “You’re into guys?”</p>\n<p> </p>\n<p>“Yeah, uh… sorry, is that an issue?” </p>\n<p> </p>\n<p>“No! No… Not at all.” The blonde cleared his throat, trying to carefully think of what to say. “I uh, I’m also ‘not straight’, as you put it.” Never in his entire life had Katsuki felt so completely and utterly small. He’d faced off against some of the baddest villains this world had seen, but in this very moment he felt unbelievably small. Maybe that was the power Deku had over him?</p>\n<p> </p>\n<p>“R-really? With how you talked I honestly figured you were extremely straight I’m gonna be honest.”</p>\n<p> </p>\n<p>“Hah?! Stereotypes much?!” Katsuki barked out, his face only growing redder by the second. “I’ll have you know I’m gay as hell! How the fuck did you think I was straight? Let alone Extremely Straight” Before Katsuki could stop the words, they had already spilled out and instantly he regretted it. Was it too late to move to another country and change his name?</p>\n<p> </p>\n<p>“The whole ‘macho man’ thing, I guess. And all the swearing. I’ll be honest, I’ve met very very few LGBT people so I kinda just assume everyone is straight.. Kinda embarrassing, huh?” Deku said meekly, which honestly only added to the cuteness.</p>\n<p> </p>\n<p>“You do realize you can be gay and swear a lot? And be, as you call it, a macho man.” Katsuki snickered.</p>\n<p> </p>\n<p>“Y-yeah! I know!” Deku gasped out. “I didn’t mean to! Sorry, I just… I don’t know.”</p>\n<p> </p>\n<p>“You said you’ve never met many LGBT people before, right?” Katsuki knew he was gonna regret asking this. He knew this was far too personal of a question to dare ask anyone.</p>\n<p> </p>\n<p>“Yeah, why?”</p>\n<p> </p>\n<p>“You ever dated a guy before?” Welp, the question was out now. And the regret was already seeping deep into his skin. </p>\n<p>“H-have I ever dated a guy? Is that what you said?” Izuku’s face was bright red at this point. Had he heard him correctly? That can’t be right?<br>“Yeah.” It was a simple reply, but it was laced in anxiety. Kacchan’s voice unnaturally quiet and unsure.</p>\n<p>“W-well, uh. I’m not sure if I’d consider it dating but I did hook up with a guy once. But that’s really it. Y-you?” Izuku was chewing on his bottom lip by this point, feeling the pressure of this entire conversation.</p>\n<p>He had somehow fallen for this mysterious man and he couldn’t even explain why or how. He didn’t know his real name, how he looked, or much about him in general. And yet he felt so instantly connected to him and wanted nothing more than to be closer to the stranger.</p>\n<p>“No, I’ve never dated before. Hell, I’ve never even kissed someone.” Kacchan made a short anxious laugh, which was rare for the man. He was always booming with confidence, but in this very instant he felt small and unsure of himself.</p>\n<p>“W-wait, really?! No, there’s no way.” Izuku giggled out, genuine shock laced in his voice. “You’re so… well you!”</p>\n<p>“Yeah well, most people annoy me. Back in high school girls would ask me out all the time, trying to ‘fix’ me or whatever the fuck. Annoyed the shit out of me. I had considered going out with a few guys but they were a distraction. Least that’s what I told myself. I needed to focus on schoolwork and being the best at it.”</p>\n<p>Izuku was floored, he couldn’t believe what he was hearing. Kacchan must have been extremely popular in school to have so many girls swooning for him, and to think he denied them all in favor of schoolwork. Back in school Izuku couldn’t even GET girls to talk to him, let alone any that wanted him. And guys? Hah, no way.</p>\n<p>“I- wow. Kacchan you’re amazing.” The forested haired boy laughed, feeling that familiar comfort wrap around him like a warm blanket. “How uh, how exactly did you know you were gay then? I-I mean, I’m sorry that sounds rude right? Ugh…”</p>\n<p>“It's a fair question, all things considered. I uh… Hmmm. Every time I thought about being with a girl I felt nothing. I figured it was just cause I was so focused on school to care, but the more I thought about it the more I started to wonder why it was. Then I’d look at guys and it felt so much different. I dunno… Something about being with a cute guy that was smaller than me, that I could wrap my arms around felt so much better. The term ‘boyfriend’ made me feel a certain kinda way that ‘girlfriend’ couldn’t. Kinda lame huh?”</p>\n<p>Izuku couldn’t believe what he was hearing. His entire face, neck, and even chest were bright red and burning. His heart was hammering in his chest like a drum, his hands starting to feel sweaty and shaky. His mind went 100 MPH with thoughts he couldn’t even stop.</p>\n<p>Big strong arms wrapped around his lithe frame, a hand pulling his face up to look into piercing eyes that could consume his entire being that he’d welcome. Safety in those big hands that could protect him from anything. </p>\n<p>“N-no, it's not lame. I uh, I felt the same way honestly. Something was nice about the idea of being another guy's boyfriend or heck, maybe his husband. I still like girls but, maybe I just have a preference for guys. But no one was really interested in me in high school or uh, even now.” A soft anxious laugh escaped Izuku’s lips.</p>\n<p>There was a soft grunt from Kacchan’s line that only increased the anxiety in Izuku’s gut. Maybe he said too much? Crap!</p>\n<p>“I think anyone who wouldn’t want you is dumb as hell.” His voice was soft, softer than Izuku was used to. Gentle like a current you just stepped into, cool and inviting against the blistering sun.</p>\n<p>Izuku stared down at his phone that sat upon his lap, his eyes fixed on the name and icon. He couldn’t believe what he was hearing. Was Kacchan serious? </p>\n<p>“I don’t know about that.” Izuku laughed out, his hand moving up to his lips to press on the bite marks he started to make.</p>\n<p>“That’s some bullshit! Deku, I’m gonna come beat your ass! Fuck, you don’t even see yourself how others see you, huh?” Kacchan screamed, a loud bang heard from the muffled mic.</p>\n<p>“S-see myself l-like others see me? What do you mean, Kacchan?”</p>\n<p>“Fucking hell.” A loud grumble, followed by some moving sounds, and even more grumbles. “You’re fucking cute, dickhead. You have a cute smile n’ shit. You’re also fuckin’ nice and make people smile all the damn time. Your entire audience is fuckin’ in love with your nerdass. I’m shocked you can’t fuckin’ see that shit.”</p>\n<p>Izuku sat there in absolute shock, running a hand through his tangled curls in astonishment. Did Kacchan seriously just call him cute?! “I- uh. Ahem. Wow that’s a lot. Holy crap. I’m sorry, I guess I just never had a lot of confidence. Got bullied a lot in school for how I look, as I’ve told you. It was either how I looked ‘too plain’ or ‘too girly’. I was pretty nervous to even try streaming, let alone show my face. But I figured if it went badly I could just stop, y’know? But it somehow worked out.”</p>\n<p>“You’re literally the least plain looking person I know, freckles.” Kacchan snorted a laugh, his anger seeming to diminish. “Green hair, green eyes, freckles everywhere? What the hell is plain about that? Sounds like the other kids were just jealous or some shit.”</p>\n<p>A soft cute laugh escaped Izuku’s lips as he listened to his far more explosive friend. “I don’t know about that, Kacchan. Not much to be jealous of. Poor, quirkless, single mom, not exactly something people want.”</p>\n<p>“Probably jealous of your good heart. You radiate warmth, even when you don’t try to.” Kacchan spoke, his words honest and cut right through Izuku. </p>\n<p>“What do you… What do you mean?” </p>\n<p>“You have this weirdly magnetic pull towards you. You have a kind heart, and it pisses me off. Your stupid smile is all encompasing, like the damn sun. People see that shit, Deku. But most people have their heads shoved up their ass so they can’t see it properly. You got something other people don’t, and they’re jealous of that kinda shit.”</p>\n<p>The world faded around Izuku as Kacchan spoke, he couldn’t believe what he was hearing. Was Kacchan right? Was he really like that? From what he knew, Kacchan never lied and spoke very matter of factly. </p>\n<p>“You’re too sweet to me…” Izuku mumbled out, wrapping his arms around his head to hide his embarrassment. “I don’t really deserve this kinda kindness, Kacchan.”</p>\n<p>“Like I said before. You deserve better than what the world has given you, Deku.” His words were gentle, calm and collected. Izuku couldn’t help but believe the man.</p>\n<p>“I- thank you Kacchan.” Was all Izuku could think to say. He wasn’t sure Kacchan was right, but he wasn’t not sure about what he’d said either.</p>\n<p>With a loud yawn Izuku curled up into bed more, exhaustion slowly taking hold of him. It’d been a long day, and felt even longer after he and Kacchan’s talk. Izuku wrapped himself up in his large comforter with a heavy sigh. </p>\n<p>“Gettin’ tired?” Kacchan asked, his voice low and gravely. </p>\n<p>“Yeah… It’s been a long day. Long week really.”</p>\n<p>“Yeah, I can’t even begin to imagine the hell you went through.” </p>\n<p>“Hey Kacchan, c-could you do something for me?” Izuku mumbled out, feeling his ears start to burn up.</p>\n<p>“Wassup nerd?”</p>\n<p>“Could you read to me until I fall asleep?”</p>\n<p>Kacchan was quiet for a moment, then came a shuffling sound and Kacchan clearing his throat. “It was many and many a year ago, In a kingdom by the sea, that a maiden there lived whom you may know by the name of Annabel Lee; And this maiden she lived with no other thought than to love and be loved by me.” </p>\n<p>Izuku could already feel his eyelids grow heavy at the beautiful tones of Kacchan’s voice. It was like a melody to his ears that he wished he could play on loop for all of eternity.</p>\n<p>“I was a child and she was a child, in this kingdom by the sea, but we loved with a love that was more than love— I and my Annabel Lee— With a love that the wingèd seraphs of Heaven coveted her and me. And this was the reason that, long ago, in this kingdom by the sea, a wind blew out of a cloud, chilling my beautiful Annabel Lee;”</p>\n<p>Izuku’s mind began to wander, picturing him and Kacchan by the sea. His forested green hair tousled by the ocean air, the smell of sea salt flaring his nostrils. A cold cloudy day, just he and Kacchan, alone together. Hand in hand as they walk along the water, feeling the cool breeze run through his body but never truly feeling cold so long as he was with Kacchan. His warmth would be enough for him.</p>\n<p>They would stare out into the endless nothing, watching the abyss below. Fearing nothing for they had each other, and needed no one else. They would be voyagers of their own paths, together hand in hand. </p>\n<p>Kacchan would smile down at him, pulling his face up closer so their lips may touch. The smell of campfire and smoke radiating off of the taller man. A burning flame that had caught Izuku nearly two months ago that he never wished to extinguish. </p>\n<p>In this kingdom by the sea, it was just them. Forever and endless.</p>\n<p>-------</p>\n<p>BEEP BEEP BEEP BEEP</p>\n<p>Izuku’s head shot up, scanning his room as he tried to figure out where the noise was coming from. The freckled boy glared at his alarm clock, clicking the snooze button as he slumped back in bed. It was 10am, and Izuku wasn’t ready for the day. </p>\n<p>Grabbing his phone he noticed that Kacchan had ended the call around 4am, probably when he’d woken up. Izuku couldn’t help but feel a pang in his heart at the sudden loss of Kacchan’s voice, but was well aware the man had a busy schedule.</p>\n<p>With a heavy sigh, Izuku got himself off his bed and wandered into his kitchen. Today was usually a streaming day but he didn’t think it’d be wise to try and talk to so many people given what had happened. As much of a workaholic Izuku was, he knew his own limits. Usually at least.</p>\n<p>Peering into his fridge, Izuku was quick to realize most of his food had either gone bad or there wasn’t enough to make jack diddly shit.</p>\n<p>With yet another heavy sigh, Izuku walked to his bathroom to start getting ready to head to the shops. Lucky for him it was only a 10 minute walk, which made him feel far less anxious. Once dressed, and an attempt to manage his mess of curls, Izuku was off, though nearly forgetting his crutches in the process. </p>\n<p>The weather was still pretty cold all things considered, but he couldn’t really complain. The forested boy almost liked the cold, it made his own home feel all the more cozy. Even if the central heating was garbage. </p>\n<p>Once he had made it to the store, Izuku went off to grab the basics. Eggs, meat, rice, ect and ect. It was in a particular isle that Izuku was attempting to grab an item off of a high shelf. Damn his shortness!!</p>\n<p>Izuku spotted a taller gentlemen, and with the worlds politest tone he spoke. “U-uh, excuse me. Could you perhaps grab th-the nori for me off th-the top shelf? Sorry.”</p>\n<p>---------</p>\n<p>There was no fucking way this was happening. First Katsuki is stationed in Deku’s fucking city, and then when he’s out trying to pick up shit for lunch of all the fucking people he could run into its DEKU?! NO!</p>\n<p>Lucky for Katsuki he was in his typical disguise, black medical mask, a black beanie to hide his intense spiky blonde hair, and even more black for his clothes. He stared down at the smaller man and oh fucking hell. Deku was so much smaller than him, and even when he had known this fact the impact wasn’t lessened. He was adorably small, with the brightest eyes the man had ever seen. And those curls, those gorgeous soft curls that Katsuki wanted to run his fingers through. </p>\n<p>God was clearly testing him, and it wasn’t fucking fair. Some might consider this moment romantic, a moment he can remove his mask and reveal himself. Show Deku that he was Kacchan all along and absolutely ravage the boy. Kiss his beautiful soft lips, leave bite marks all along his neck as the two intertwine and never let go.</p>\n<p>But no, Katsuki had to be a good boy and pretend this wasn’t happening. This was like something out of this worst damn nightmare.</p>\n<p>Katsuki only let out a small grunt, knowing full well if he spoke Deku would figure out who he was and this would be over even faster than he could imagine. Again, his worst nightmare.</p>\n<p>Reaching up, Katsuki grabbed the nori off the top shelf and handed it back to Deku. His hands shaking the entire time and his face showing clear signs of blush.</p>\n<p>“Oh goodness! Are you okay? You look flushed! Are you sick? Here, come with me. We can get you some water!” Deku smiled, and god fucking damnit that smile. It lit up the entire room, no the entire world. It was brighter than the sun. His gorgeous emerald eyes practically sparkling as they crinkled up.</p>\n<p>Katsuki felt like he was gonna faint, this was way too much. He needed to get out of there ASAP before Deku figured out who he was, or godforbid his sunshine like happiness makes him fall even MORE in love with the guy.</p>\n<p>Dramatically shaking his head, Katsuki stared at the smaller man with absolute panic in his eyes and made a break for the exit. Fuck getting lunch, he needed to get out of there and flee. Deku looked confused and honestly a little hurt at his sudden escape, but there was no time to worry about that.</p>\n<p>---------</p>\n<p>Izuku watched as the strange man in all black seemed to almost flee from him in a state of what he could only describe intense fear. Izuku couldn’t help but wonder if there was something terrifying about how he looked. He still had left over bruises from the event, and being on crutches couldn’t help his disposition.</p>\n<p>With a heavy heart, Izuku made his way to the check out line to buy his groceries and head home. Maybe Kacchan could have a laugh about the entire ordeal? Izuku made his way home and slowly put his groceries away before starting on breakfast.</p>\n<p>“Kacchan would probably be so proud of me! Making breakfast and actually getting new groceries instead of trying to eat spoiled meat! You’re really going up in the world, Izuku.” He laughed to himself, sitting down for his breakfast on the end table of his very small kitchen. “Thank you for the food!” Izuku called out to no one before clapping his hands together.</p>\n<p>——————-<br>Deku: Kacchan! You’d be so proud of me! I made breakfast and even went to the shops!<br>Deku: There was a guy at the market though and I think I scared him… o(╥﹏╥)o<br>Deku: I’m not even sure what I did but the poor guy looked terrified for some reason. (◕︵◕)<br>——————-</p>\n<p>Katsuki still hadn’t fully shaken off seeing Deku in person, and honestly felt a little wrong. He knew who Deku was, at least a lot about him. Meanwhile the forested haired man knew almost nothing about him. Was it even safe for Deku to know his real identity? It’d make him susceptible to villain attacks.</p>\n<p>And yet, there was an overbearing pain burning in his chest that clawed at his ribs to get out. He so desperately wanted to tell Deku who he was and see if they could maybe attempt a normal relationship. He got the confirmation that the other was into men, and he seemed frazzled looking at the picture Katsuki had sent. Could that mean the other felt the same? Katsuki had never dated before, and he was shit with feelings, but something in him screamed that it had to be true. </p>\n<p>Though, now with the rise of that apparent Quirkless Killer on the loose, it only added to the stress Katsuki felt to reveal himself to Deku. Maybe if he did he could take him to his home, keep him safe and away from those dangers. But on the other hand, this might paint an even bigger tarket on his back.</p>\n<p>Gripping at his hair, Katsuki let out an annoyed sigh. This was why he never bothered talking to people, the emotional turmoil sucked.</p>\n<p>PING</p>\n<p>Katsuki was brought out of his thoughts by that familiar sound. Reaching into his pocket the blonde pulled out his phone and thumbed through the notifications, a soft smile falling upon his lips. Thought maybe the turmoil was worth it after all.</p>\n<p>Izuku sat at his PC, staring at himself in the webcam. It has been two weeks now since he was let out from the hospital, and he was now able to get around without crutches finally. His limbs were fully healed, but his mind didn’t. Often at night Izuku would have panic attacks, needing to call Kacchan to help calm him down in fear someone was going to break into his apartment.</p>\n<p> </p>\n<p>With a heavy sigh Izuku clicked Go Live and waited for his viewers to pile in. Izuku couldn’t ignore them forever and sitting around doing nothing all day wasn’t good for him either.</p>\n<p> </p>\n<p>——————</p>\n<p>Chat:</p>\n<p>LooneyMoon: Deku is back!!</p>\n<p>Shamblam: Ahhh Deku-Chan!!</p>\n<p>CatInBlack: Deku we were so worried for you!</p>\n<p>——————</p>\n<p> </p>\n<p>Izuku let out a soft anxious laugh, trying to put on his best smile. “H-hey everyone! Sorry for being gone for so long. As you guys know, something pretty awful happened recently that left me in the hospital. The police are still trying to figure things out but they might have a lead!”</p>\n<p> </p>\n<p>—————</p>\n<p>Chat:</p>\n<p>CrispyCreams: Oh Deku baby what happened? You look exhausted :(</p>\n<p>LeoLion: Ahhh Deku!!! He returns!!</p>\n<p>DekusWifu: My baby :(</p>\n<p>[TOP DONOR] KaboomKing: Oh wow you’re actually live today.</p>\n<p>——————</p>\n<p> </p>\n<p>“Ahh, hey there Kacchan.” Izuku beamed, feeling a bit more at ease when he saw the familiar username pop up. “Yeah, I’m still pretty tired. But I missed talking to you all. The guy who assaulted me got me pretty good.” Izuku let out another nervous laugh, rolling up his sleeve to show off the scarring now littering his arm. “This arm got the brunt of it all as you can see. Sadly they couldn’t do anything about the scarring so this is permanent now. B-but it’s okay! I’m just thankful to be alive!” Izuku smiled, looking at his hand with a somber expression.</p>\n<p> </p>\n<p>“Oh! Another thing!” The greenette smiled, remembering a critical detail of that night. “According to the report none other than DynaMight came to save me! Can you believe that! Apparently he found me passed out in an alleyway and helped get me to the EMT! I’m sad I couldn’t thank him properly, but I’m sure he’s busy anyways, and gets a lot of mail anyways from fans…” </p>\n<p> </p>\n<p>The forested haired boy twiddled his fingers some, looking over the now crooked fingers. “I just hope he knows how much I appreciate him, yknow?”</p>\n<p> </p>\n<p>——————</p>\n<p>Chat:</p>\n<p>[TOP DONOR] KaboomKing: I’m sure he knows how thankful you are.</p>\n<p>BonesOfInk87: Yeah! Plus he got to carry your cute little self ;)</p>\n<p>BeansOfTruth: Okay don’t be weird.<br>Candy8223: I’m sure DynaMight knows :D He’s #1 for a reason! <br>PokePop: Maybe send him an email? He has an official site right?</p>\n<p>77867: Hey there cutie~</p>\n<p>——————-</p>\n<p> </p>\n<p>Izuku froze on the spot, staring at the newest message that popped up. His blood went cold, and his vision started to blur. It had been exactly what that man said to him that night. Panic was rising beneath Izuku’s skin and he didn’t know what to do. </p>\n<p> </p>\n<p><em> Just calm down Izuku, it’s just a coincidence. </em>The greenette thought to himself, feeling his palms grow sweaty. </p>\n<p> </p>\n<p>—————-</p>\n<p>Chat:</p>\n<p>77867: it’s a shame we had to cut that evening so short but I had places to be. I miss your cute little face though, kitten.</p>\n<p>KingDoom: Hey dude that’s not funny, what the fuck?!</p>\n<p>AgentOfChaos: Dude fuck off!! This isn’t funny!</p>\n<p>MermaidLover64: Can someone report this guy??</p>\n<p>[TOP DONOR] KaboomKing: Deku?? Hey are you okay?</p>\n<p>——————</p>\n<p> </p>\n<p>Izuku started to hyperventilate, his vision was going darker by the second. This couldn’t be happening! Not now! This meant the man who assaulted him KNEW who he was! Had he been stalking him? Did he know where he lived?! Did he-</p>\n<p> </p>\n<p>PING</p>\n<p> </p>\n<p>——————-</p>\n<p>Kacchan: Deku! Deku calm down!</p>\n<p>Kacchan: You’re okay!</p>\n<p>——————</p>\n<p> </p>\n<p>Izuku stared at the DM on his screen, his eyes brimming with tears that dared to leak out. </p>\n<p> </p>\n<p>\n<em> Kacchan… </em>\n</p>\n<p> </p>\n<p>With a shaky breath Izuku stared back at the chat, desperately trying to steel himself as he grabbed his mouse and clicked the ban button over the user. </p>\n<p> </p>\n<p>\n<em> It’s fine Izuku, you can just block the guy and move on. Calm down! </em>\n</p>\n<p> </p>\n<p>“W-well that was annoying, but anyways as I was saying-“</p>\n<p> </p>\n<p>—————</p>\n<p>Chat:</p>\n<p>77877: Now that’s now very nice of you Izuchan~ You should know better than to just block me.</p>\n<p>Memerbread: izuchan???</p>\n<p>LovelyInsideOut22: What the fuck?! He has multiple accounts?!</p>\n<p>DangerSense: Stalker alert!! Everyone report!!</p>\n<p>—————</p>\n<p> </p>\n<p>\n<em> No! No this can’t be happening! </em>\n</p>\n<p> </p>\n<p>Izuku was trembling in his seat, he didn’t know what to do. This was supposed to be a fun relaxing stream after being gone for so long!</p>\n<p> </p>\n<p>“P-please just to away…”</p>\n<p> </p>\n<p>——————</p>\n<p>Chat:</p>\n<p>77877: You’re so cute when you cry~</p>\n<p>[TOP DONOR] KaboomKing: You’ll regret saying that kinda shit here. I’m gonna bust your face in you fucking freak.</p>\n<p>77877: Oh. Izuchans little boy toy. Don’t worry, you can have him once I’m done. Though I can’t promise there will be many pieces left once I’m through.</p>\n<p>\n<b> <em>User 77877 has been banned</em> </b>\n</p>\n<p>77887: Geez, all these bans. Kitten you’re starting to annoy me.</p>\n<p>———————</p>\n<p> </p>\n<p>Katsuki couldn’t believe what he was seeing. Deku was trembling on stream while this freak was just toying with him! Katsuki had opened his IP tracker on his other monitor trying to figure out who this guy was, while still trying to pay attention to what was happening on stream.</p>\n<p> </p>\n<p>He wanted nothing more than to run over there to Deku and save him! Fucking explode this creep and be the hero Deku needed right now! Ugh! Fuck this!</p>\n<p> </p>\n<p>PING</p>\n<p> </p>\n<p>——————-</p>\n<p>Kacchan: Deku! Please just breathe! Call me if you need to!!!</p>\n<p>——————-</p>\n<p> </p>\n<p>Katsuki didn’t know what to do, he wasn’t exactly good at comforting people. He took courses on helping victims during tragedy but nothing could prepare him for this! His hands were shaking and small explosions kept getting set off by his own anxiety, this was the second mouse he had to plug in after he destroyed the first one when Creepy Fuck showed up.</p>\n<p> </p>\n<p>“God Fucking damnit! Who the fuck is this guy?!” Katsuki hissed, now going to grab his phone.</p>\n<p> </p>\n<p>Katsuki didn’t have many friends but the ones he did have he kept close and knew they were loyal. He had one particular friend in mind who might be able to help.</p>\n<p> </p>\n<p>“Bakubabe! You haven’t called in so long, whats up-“</p>\n<p> </p>\n<p>“Can it raccoon eyes, I need your help.” Katsuki spat, his entire body feeling like it was going to rupture with the rage he felt deep into his bones.</p>\n<p> </p>\n<p>“Oh, I sense someone is a bit maaaad~” Mina laughed.</p>\n<p> </p>\n<p>“Remember that case I was on? With the guy that got attacked by a lead to the Quirkless Killer?”</p>\n<p> </p>\n<p>“With the cutie with green hair?” Mina cooed back into the phone.</p>\n<p> </p>\n<p>Katsuki huffed, running a hand down his face. “Yeah. That one. Well the guy streams and it looks like the guy might also be his stalker.”</p>\n<p> </p>\n<p>“Wait… you found the cuties twitch? Kitty Kat this goes beyond just checking in on someone you have a case for. What’s going on? Isn’t this kinda work left to detectives?”</p>\n<p> </p>\n<p>“Fucking- ugh! I’ll explain later! I just need your fucking help! If you can’t do shit then I’ll go to dunce face!”</p>\n<p> </p>\n<p>“Geez okay, okay! Text me the link and I’ll see what I can do!” Mina groaned, clearly wanting more of the “tea” on the situation, as she calls it.</p>\n<p> </p>\n<p>“Sure.” Katsuki grunted before hanging up.</p>\n<p> </p>\n<p>In a flash he was texting her the link and any other information that might be helpful. As Katsuki moved back to his desk he watched Deku, who was still mostly frozen in his spot. His heart aches watching the poor man look so terrified, but Katsuki didn’t know what to do. </p>\n<p> </p>\n<p>That’s when an idea struck him.</p>\n<p> </p>\n<p>——————</p>\n<p> </p>\n<p>\n<b> <em>PING</em> </b>\n</p>\n<p> </p>\n<p>\n<b> <em>KACCHAN IS CALLING….</em> </b>\n</p>\n<p> </p>\n<p>Izuku snapped out of his daze when suddenly his phone started going off, that familiar ring from Discord. Kacchan was calling him?! On stream?! Nervously Izuku went to grab his phone, slowly clicking the accept button.</p>\n<p> </p>\n<p>“K-Kacchan…?” Izuku could barely speak, fear spiked through his entire being. He felt sick.</p>\n<p> </p>\n<p>“Deku, I need you to breathe. You’re hyperventilating.”</p>\n<p> </p>\n<p>“K-Kacchan he found me! He knows who I am!” Izuku rasped out.</p>\n<p> </p>\n<p>“It’s gonna be okay. I need you to keep streaming, someone I know is trying to trace his IP and find out who he is.” Katuski sounded calm and reassuring, even in his own state of panic. “It’s gonna be okay, Deku. I promise.”</p>\n<p> </p>\n<p>“B-but what if it isn’t…” Izuku wailed, tucking his knees into himself.</p>\n<p> </p>\n<p>The chat was going ballistic, everyone reporting the constant new accounts of the unknown user. New viewers flooded in to see what was happening and trying to help report or even making fun of Izuku. He just wanted to curl into a ball and cry. Shut off the stream and pretend this never happened.</p>\n<p> </p>\n<p>This was too much. When he started streaming he never thought THIS would become a reality!</p>\n<p> </p>\n<p>“Kacchan I’m so scared…”</p>\n<p> </p>\n<p>Izuku felt like his world was crumbling around him, slowly suffocating him as the very air he breathed was ripped from his lungs. Wrapped up in the claws of the beast that came for him that night, unable to escape.</p>\n<p> </p>\n<p>“Deku…” came Kacchan’s voice again. “I am here. I won’t let anything happen.”</p>\n<p> </p>\n<p>Like snow thawing on the first day of spring, a warmth ran through Izuku’s timid body. He was okay, he was going to be okay. Kacchan wouldn’t let anything happen to him. He just had to stay calm.</p>\n<p> </p>\n<p>“O-okay.”</p>\n<p> </p>\n<p>“Just keep streaming, okay? I’ll call you once I know more.”</p>\n<p> </p>\n<p>“O-okay K-Kacchan. Th-thank you.”</p>\n<p> </p>\n<p>“Call me if you need anything.” Katsuki said simply, but it was the best thing that Izuku had ever heard in that moment.</p>\n<p> </p>\n<p>“Mmmm….” </p>\n<p> </p>\n<p>Izuku hung up, and faced the beast before him. He wasn’t going to back down without a fight. Scared out of his mind and shaking like a leaf, Izuku stared into his camera, his eyes a burning forest fire he dared to set ablaze. </p>\n<p> </p>\n<p>\n<em> Come at me. </em>\n</p>\n<p>                                                                                                                 <img src=\"https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/39877eee-ef02-4b06-83ae-f41eff3e7878/demhy4b-2e0952e2-2698-4c6e-979d-a01638683005.png/v1/fill/w_680,h_1176,q_70,strp/fire_by_rad_pax_demhy4b-pre.jpg?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOjdlMGQxODg5ODIyNjQzNzNhNWYwZDQxNWVhMGQyNmUwIiwiaXNzIjoidXJuOmFwcDo3ZTBkMTg4OTgyMjY0MzczYTVmMGQ0MTVlYTBkMjZlMCIsIm9iaiI6W1t7ImhlaWdodCI6Ijw9MjIxNCIsInBhdGgiOiJcL2ZcLzM5ODc3ZWVlLWVmMDItNGIwNi04M2FlLWY0MWVmZjNlNzg3OFwvZGVtaHk0Yi0yZTA5NTJlMi0yNjk4LTRjNmUtOTc5ZC1hMDE2Mzg2ODMwMDUucG5nIiwid2lkdGgiOiI8PTEyODAifV1dLCJhdWQiOlsidXJuOnNlcnZpY2U6aW1hZ2Uub3BlcmF0aW9ucyJdfQ.NXSzDedM3WYnULf0s80yKwtftI_F90-2Zn8mwnlpVBo\" alt width=\"556\" height=\"962\"></p>\n<p>Mina had been sat at her desk for nearly an hour now trying to track down this guy that Kats had asked from her. It shouldn’t be this hard but the guy kept changing accounts and different IPs every couple of seconds. She felt exhausted, and just wanted some coffee but she knew she couldn’t leave to grab any.</p>\n<p>The boy before her had been talking the entire hour now, still trembling and trying to get his words out. But he was doing a decent job at keeping the stalker there and even entertaining Mina while he tried to track the man down.</p>\n<p> </p>\n<p>She was aware there was some kind of story with Kats and this Deku person, but today wasn’t the day to learn about it. Hopefully in the future once this freak is behind bars.</p>\n<p> </p>\n<p>With a loud huff, Mina sat up to crack her back and stretch some before getting back to work but was paused by someone entering her little office space.</p>\n<p> </p>\n<p>“Whoa! Hey I know that guy! He’s the one Bakugou was adamant about trying to find!”’ Kirishima wandered in, his usual big toothy smile on.</p>\n<p> </p>\n<p>“Oh, Kiri! Yeah he asked me to find some stalker on the guys stream. But the guy keeps changing accounts and it’s hard to track him. Ugh!!” The pink haired woman groaned, pulling at her fluffy locks.</p>\n<p> </p>\n<p>“Bakugou seems super invested in this little guy.” Kirishima smiled, watching the greenette ramble on about heroes. “He’s pretty cute actually, now that I see him without a bunch of bruises.”</p>\n<p> </p>\n<p>“He looked that bad huh?” Mina lamented, her eyes drawn back to the green haired man.</p>\n<p> </p>\n<p>“Yeah, the guy looked half dead when we found him. Heck, Bakugou looked like he just got told his parents were dead. Poor guy couldn’t stop shaking. He wanted to be at the hospital with him too but we all had to go fill out paperwork and he didn’t wanna terrify the green bean.”</p>\n<p> </p>\n<p>“So what’s the story, there?”</p>\n<p> </p>\n<p>“Eh, can’t really say. You know how he is, dude is private about everything.”</p>\n<p> </p>\n<p>“Ugh…!! But he tells <b>you </b>stuff! You’re his best friend!” Mina groaned, gripping at her hair again.</p>\n<p> </p>\n<p>“Sorry babe, I’m left in the dark too.” Kirishima laughed, patting Mina on the shoulder. “Maybe once you can track this guy down he’ll tell you the story as thanks.”</p>\n<p> </p>\n<p>That lit a fire under Mina that she didn’t know she needed. With her new motivation she went back to trying to figure out who the mysterious stalker was and maybe get their cranky friend a cute boyfriend in the process!</p>\n<p> </p>\n<p>———————</p>\n<p> </p>\n<p>Izuku had officially been streaming for 6 hours now. He felt exhausted, his throat was starting to hurt, and he was running out of topics to ramble about. His viewer count was great, but that seemed to be mostly because of people coming in to try and help report the stalker. But it’s not like he could just sit there and do nothing while Kacchan tries to figure out who the mystery stalker was.</p>\n<p> </p>\n<p>It was now 11:47, and Izuku had to be up for class tomorrow. He had no idea how much longer he had to keep this up to help find the stalker, but he felt exhausting creeping up each hour he kept steaming. </p>\n<p> </p>\n<p>Eventually though Izuku’s stomach began to growl, his face turned flushed with embarrassment. “Oh gosh! S-sorry about that! I haven’t had dinner yet since I’ve been streaming for so long.” Izuku let out a soft nervous laugh, running a hand through his hair.</p>\n<p> </p>\n<p>——————</p>\n<p>Chat</p>\n<p>77990: Aw my poor baby is hungry. Don’t worry I’ll fix that for you</p>\n<p>AlienQueen: Ew, stop being weird dude…</p>\n<p>[TOP DONOR] KaboomKing: Fuck off creep!</p>\n<p>BonesOfAsh53: This dude needs to seriously stop.</p>\n<p>\n<b> <em>User 77990 has been banned</em> </b>\n</p>\n<p>77991: Again with that? </p>\n<p>77991: Now now Kitten, you know I hate being ignored.</p>\n<p>\n<b> <em>User 77991 has been banned</em> </b>\n</p>\n<p>77992: Kitten, you’re starting to annoy me. Keep this up and I’ll have to do something drastic.</p>\n<p>——————</p>\n<p> </p>\n<p>Izuku was trembling again, unsure of what else this man could do. There’s no way he knew where he lived, right? He was safe, he was fine he was-</p>\n<p> </p>\n<p>DING DONG</p>\n<p> </p>\n<p>the doorbell? </p>\n<p> </p>\n<p>Izuku froze, staring at the entrance way to his apartment. Another ring, and Izuku slowly stood to walk towards the door. His body felt woozy, his vision going blurry as he made his way over.</p>\n<p> </p>\n<p>“Wh-who is it?” Izuku asked, getting on his tiptoes to peer out the peephole. It was a man in a red baseball cap with grey hair that had a few pastel pink stripes in it, his skin a nice olive shade.</p>\n<p> </p>\n<p>This wasn’t the man that Izuku had met that night. No, this was someone else.</p>\n<p> </p>\n<p>“Got a delivery for a uhh… Deku?” The man answered.</p>\n<p> </p>\n<p>Slowly Izuku unlocked the door, keeping his distance from the man. Least if he was attacked again he was on stream so they could see his face if Izuku simply ran back to his setup. The stranger gave an awkward smile before handing him the mysterious bag. It smelt amazing, whatever it was.</p>\n<p> </p>\n<p>“Just sign here, and I’ll be on my way.” The man huffed but Izuku did as he was told before closing the door and staring at the bag with a puzzled expression.</p>\n<p> </p>\n<p>He slowly wandered back to his desk, unsure of what to do now. Did Kacchan order him food? No he didn’t know his address, so that would only leave… </p>\n<p> </p>\n<p>Suddenly Izuku felt sick. That delicious food no longer smelt good but like bile, he wanted to vomit.</p>\n<p> </p>\n<p>——————</p>\n<p>Chat:</p>\n<p>77996: looks like my kitten got his food~</p>\n<p>AlienQueen: oh my god</p>\n<p>[TOP DONOR] KaboomKing: what the fuck?!</p>\n<p>——————</p>\n<p> </p>\n<p>Panic and fear. That’s the only feeling Katsuki could feel right now. That fucker had found Deku’s address and ordered him food! What kind of sick twisted game was this guy playing?!</p>\n<p> </p>\n<p>Katsuki was shaking with rage and fear, he didn’t know what to do. If he went and got Deku from his home for safety that’d only add problems but he couldn’t just leave him there either! This was dangerous!</p>\n<p> </p>\n<p>Katsuki quickly opened up Discord to message Deku, his hands trembling over the keys.</p>\n<p> </p>\n<p>—————-</p>\n<p>Kacchan: DO NOT EAT THAT!!!</p>\n<p>Kacchan: This is ridiculous! Just end stream now! Fuck it we’ll find this asshole another way! We need to get you somewhere safe!! Fuck this!!!</p>\n<p>—————</p>\n<p> </p>\n<p>Katsuki watched as Deku read the messages then quickly looked back to the camera. He gave a small awkward smile before telling everyone he needed to go. He looked like he was about to cry again, it broke Katsuki’s heart. </p>\n<p> </p>\n<p>Once the stream was over Katsuki grabbed his phone to call Deku, his heart racing the entire time.</p>\n<p> </p>\n<p>“K-Kacchan!” Deku wailed, his voice sounding raw. </p>\n<p> </p>\n<p>“Deku, we need to get you somewhere safe.”</p>\n<p> </p>\n<p>“I-I can’t stop shaking! K-Kacchan what do I do?!” </p>\n<p> </p>\n<p>Katsuki felt like his world was sinking in. This wasn’t what was supposed to happen. Everything was wrong and he needed to fix it!</p>\n<p> </p>\n<p>“Deku, I’m gonna get you a hotel far from where you’re at. I only know which city you’re in, so I’ll get a hotel outside of it. Can you get there? I’ll give you money for a taxi or something if you need.”</p>\n<p> </p>\n<p>“N-no… please you’ve spent too much money on me as is…”</p>\n<p> </p>\n<p>“Fuck if I care! Some psycho stalker is after you! I’m getting the fucking hotel.”</p>\n<p> </p>\n<p>“A-are you gonna be there…?” His voice was meek, anxiety laced in every word. “I don’t… I don’t wanna be alone…”</p>\n<p> </p>\n<p>Katsuki pondered that. Would now be a good time? It might make the situation worse. He wasn’t sure what to do anymore, all that mattered right now was getting Deku somewhere safe and far away.</p>\n<p> </p>\n<p>“I-…” he pauses. “I’m not sure Deku. Let me figure shit out.”</p>\n<p> </p>\n<p>“Okay… Th-thank you Kacchan…” the greenette mumbled, his words overshadowed by his sobs. </p>\n<p> </p>\n<p>It hurt to hear. He just wanted Deku to be safe. But the world was unkind to such a gentle soul. He truly did deserve better than what the world has given him. </p>\n<p> </p>\n<p>------------</p>\n<p> </p>\n<p>Izuku started packing up any belongings he needed into his big yellow bag, unsure of how long he’d be staying at the hotel. He felt anxious, even anxious of Kacchan. He didn’t know who he could trust but he needed to get out of his apartment NOW!</p>\n<p> </p>\n<p>His phone pinged, looking at the notification he put in the address and saw it was 40 minutes away. Hopefully enough distance from the stalker trying to get to him. With a sad sigh, Izuku grabbed his backpack and made his way outside to get into the taxi he had called earlier. </p>\n<p> </p>\n<p>All he really wanted to do right now was eat and sleep but he couldn’t even do that. Izuku tossed out the food in a nearby trash can outside then entered into the taxi waiting for him. He just wanted this night to be over.</p>\n<p> </p>\n<p>------------</p>\n<p> </p>\n<p>After 40 minutes and Izuku nearly falling asleep Izuku arrived at the hotel and holy cow was it nice! He felt under dressed to even be there! Nervously Izuku wandered in and walked up to the desk where a nicely dressed woman stood practically glaring daggers into him.</p>\n<p> </p>\n<p>“H-hello, I-I believe I have a reservation…?”</p>\n<p> </p>\n<p>“Name?”</p>\n<p> </p>\n<p>“Uh… D-Deku?” Izuku stuttered out meekly, unsure what he should be doing. </p>\n<p> </p>\n<p>“Mmmm… yes here you are.” The annoyed woman stated, then handed Izuku a key card. “Floor 15, room 408.”</p>\n<p> </p>\n<p>“Th-thank you.” Izuku rasped, grabbing the key and making a beeline to the elevator. </p>\n<p> </p>\n<p>PING</p>\n<p> </p>\n<p>\n<b>KACCHAN IS CALLING….</b>\n</p>\n<p> </p>\n<p>Izuku felt the familiar buzzing of his phone, pulling it out of his pocket, Deku answered the call.</p>\n<p> </p>\n<p>“K-Kacchan!”</p>\n<p> </p>\n<p>“Did you make it to the hotel?” He sounded like he was doing something, his voice was heavy and for some reason Kacchan kept making small grunts.</p>\n<p> </p>\n<p>“Yes! I-I mean yeah, I did. It’s super fancy… Kacchan you didn’t need to do this.”</p>\n<p> </p>\n<p>“Safer there. They monitor anyone and everyone who comes in. That freak won’t be able to get to you from your window either, since you’re gonna be so high up.”</p>\n<p> </p>\n<p>“I hope so…” he paused, taking in a shaky breath. “Kacchan I’m scared…”</p>\n<p> </p>\n<p>“I know…”</p>\n<p> </p>\n<p>“What if he finds m-me a-and…” he couldn’t even finish the sentence, his tears were already flowing from those gorgeous emeralds.</p>\n<p> </p>\n<p>“I won’t let that happen.” Kacchan said, the confidence he brought through his voice warmed Izuku. Like he somehow knew for a fact he could actually protect Izuku. What a silly thought. But it helped some.</p>\n<p> </p>\n<p>“I… I believe you Kacchan.” </p>\n<p> </p>\n<p>There was a pause, Kacchan not saying anything for a moment. Then he finally spoke, his voice stern but still trying to stay calm. “I’ll make sure you’re safe. Got it?”</p>\n<p> </p>\n<p>“G-got it.”</p>\n<p> </p>\n<p>Izuku exited the elevator feeling a new confidence he didn’t know he had. He had lit the match that started this fire, and he was going to watch it burn. A burning ember around him as he waited for the beast's next move. He wasn’t going down without a fight. He’d swallow the beast up in an inferno before he dared let it lay another finger on him again. He was a forest fire and he was going to burn. </p>\n<p>\n<span>\n<img src=\"https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/39877eee-ef02-4b06-83ae-f41eff3e7878/demhy4h-1fc9f8e8-3434-4a2b-ad2d-b26d2f315c97.png/v1/fill/w_688,h_1161,q_70,strp/ember_by_rad_pax_demhy4h-pre.jpg?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOjdlMGQxODg5ODIyNjQzNzNhNWYwZDQxNWVhMGQyNmUwIiwiaXNzIjoidXJuOmFwcDo3ZTBkMTg4OTgyMjY0MzczYTVmMGQ0MTVlYTBkMjZlMCIsIm9iaiI6W1t7ImhlaWdodCI6Ijw9MjE1OSIsInBhdGgiOiJcL2ZcLzM5ODc3ZWVlLWVmMDItNGIwNi04M2FlLWY0MWVmZjNlNzg3OFwvZGVtaHk0aC0xZmM5ZjhlOC0zNDM0LTRhMmItYWQyZC1iMjZkMmYzMTVjOTcucG5nIiwid2lkdGgiOiI8PTEyODAifV1dLCJhdWQiOlsidXJuOnNlcnZpY2U6aW1hZ2Uub3BlcmF0aW9ucyJdfQ.8Et-br96oSZbwiGjTAmtpMAm-jqMBCEURW6eL8gbl8Q\" alt width=\"447\" height=\"754\">\n</span>\n</p>\n<p> </p>\n<p>\n<span>Katsuki was a man out for blood. When he was first called in that night he had learned of Deku’s real name, an Izuku Midoriya. For days he couldn’t figure out what it was about the name that pulled at him until one evening his mother had called and he happened to ask if he ever knew a Midoriya growing up.</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“Midoriya? Suppose you were too young to remember. My friend Inko lived down the street from us when you were a brat. She had a kid you used to play with up until they moved when you were… I think around 7 or so? You two would always cry anytime we had to take the other home.” Mitsuki laughed, thinking back to the memories fondly. “He was such a shy and soft spoken kid, nothing like you.”</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“The son, what was his name?” Katsuki questioned, trying to recall said boy his mother was talking about.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“Oh, the boy? Izuku. So much like that mother of his. Very gentle and soft spoken, with this big green eyes. Last time I heard from Inko he was studying to become a nurse, I think. Such a sweet boy, didn’t deserve what happened to him.”</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Katsuki’s heart skipped a beat, staring down at his phone. “What happened to him…?”</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“Oh it was awful, they ended up moving away because of his fathers work. Well next thing they knew the man had got into an accident only a few years later and tragically passed away, then Inko was diagnosed with leukemia not long after. From what I hear she works part time to make ends meet while her son goes to school and does other work to pay for things when he can. Just terrible… According to Inko it was hard enough to get him into any university due to him being quirkless, let alone a nursing school. Apparently they prefer taking on students with healing quirks instead. Just one bad thing after another for the Midoriya’s…”</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“Is Mrs. Midoriya doing any better?” Katsuki asked, his voice caught in his throat. Had Deku really gone through so much? Had the world really been so cruel to such a kind and soft soul?</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“Last I heard she was on the up and up but I haven’t spoken to her in a few years now, so I don’t really know. I’d offer her number but it looks like the one I have doesn’t work anymore. I hope they’re okay, they were both such kind people. Wish I could get in contact with either just to know if they’re okay.” Mitsuki huffed. “Maybe you can use those Pro Hero contacts to find your dear ol’ mom, her university friend, eh brat? You and Izuchan can even catch up. Maybe his softness could rub off on you, make you less of a hellion.”</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“Don’t hold your breath, hag.” Katsuki spat, feeling the familiar venom in his tone.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“Figures. I raise you and this is the thanks I get! Can’t even come home for dinner anymore, ugh. Your poor father misses you.”</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“And you don’t?” </span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“Ehhhh, maybe just a bit.” Mitsuki hummed, the two paused before laughter erupted from the two blondes. “Lemme know when you can come visit though, I’ll make your favorite.”</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“Yeah, yeah.” Katsuki grunted. “Don’t get dead out there, mom.”</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“Same to you, Katsuki.”</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Katsuki couldn’t believe it. The two had known each other as children! It explained why he was so drawn to the man the first night he saw those beautiful emralds and why he couldn’t get the other out of his mind. For years he had felt like something- no, </span>\n<b>someone</b>\n<span> was missing from his life, and he was right! And now that he had finally gotten them back he wasn’t going to let them go again! </span>\n</p>\n<p> </p>\n<p>\n<span>Mina was still trying to figure out who exactly the stalker was, but she found a promising lead on a Mako Osamu. The man even matched the physical description that Deku had given the police once he had woken up, though sadly that wasn’t enough to arrest the guy. Not yet anyways.</span>\n</p>\n<p> </p>\n<p>\n<span>Mina noted that once the stream shut off it looked like Osamu was on the move and going in the direction of the hotel that Katsuki had sent Deku to. He hoped that Deku could remain safe while there, but he had a sickening feeling that something bad was about to happen. </span>\n</p>\n<p> </p>\n<p>\n<span>He was an hour out from the hotel now, having taken his company's private jet to get there sooner but nothing felt fast enough.</span>\n</p>\n<p> </p>\n<p>\n<span>“Deku… please be safe…”</span>\n</p>\n<p> </p>\n<p>\n<span>-----------</span>\n</p>\n<p> </p>\n<p>\n<span>Izuku sat in his hotel room unsure of what to do next. It had been nearly 20 minutes since Kacchan had replied to him and each minute he didn’t hear from the other only increased his anxiety. </span>\n</p>\n<p> </p>\n<p>\n<span>He had tried calling but he didn’t pick up for some reason, and Izuku was praying it wasn’t something bad. </span>\n</p>\n<p> </p>\n<p>\n<span>Then came a knock at his door. </span>\n</p>\n<p> </p>\n<p>\n<span>He hadn’t called for anyone? Unless… Could that be Kacchan? No there’s no way. If he was on his way he’d have told Izuku, right?</span>\n</p>\n<p> </p>\n<p>\n<span>Nervously Izuku stood and made his way to the door before looking out the peephole. There stood a man with raven hair and cat-like eyes. </span>\n</p>\n<p> </p>\n<p>\n<span>Izuku’s blood turned to ice.</span>\n</p>\n<p> </p>\n<p>\n<span>As quietly as he could, Izuku backed away from the door and pulled out his phone. He felt bile build up in his throat, and with trembling hands he began typing out his next message.</span>\n</p>\n<p> </p>\n<p>\n<span>———————</span>\n</p>\n<p>\n<span>Deku: Kacchan he’s here!!</span>\n</p>\n<p>\n<span>Deku: KACCHAN!</span>\n</p>\n<p>\n<span>———————</span>\n</p>\n<p> </p>\n<p>\n<span>Another knock came at the door, then that sickeningly sweet voice. “Oh Izuchan, I know you’re in there. Or should I say Deku? You seem to prefer that name. Why not come out willingly? I won’t even hurt you if you do, how’s about that?” The raven haired man cooed.</span>\n</p>\n<p> </p>\n<p>\n<span>Izuku didn’t dare make a noise, but he remembered this man's quirk. He used his voice similar to Control Freak, but he needed to say a specific line. So long as Izuku couldn’t hear it then he’d be fine, right?</span>\n</p>\n<p> </p>\n<p>\n<span>Thinking fast Izuku put in his ear buds just loud enough so the man's voice was muffled, hoping that would be all he needed to avoid being caught by his quirk a second time. He wasn’t going to get caught again! He wasn’t going down without a fight!</span>\n</p>\n<p> </p>\n<p>\n<b>BANG BANG</b>\n<span>\n<br>\n</span>\n<span>\n<br>\n</span>\n<span>“Izuchaaaan~!”</span>\n</p>\n<p> </p>\n<p>\n<span>---------------</span>\n</p>\n<p> </p>\n<p>\n<span>Katsuki stormed into the hotel, his eyes a burning inferno as he reached the hostess desk. “My room, where the fuck is it?!” The blonde spat.</span>\n</p>\n<p> </p>\n<p>\n<span>“N-name?” The young hostess asked, a frail brunette with big doe eyes that reminded Katsuki so much of those endless emeralds he had grown to love.</span>\n</p>\n<p> </p>\n<p>\n<span>“Katsuki fucking Bakugou. Room number. </span>\n<b>Now.</b>\n<span>” Katsuki snarled at the timid woman.</span>\n</p>\n<p> </p>\n<p>\n<span>“F-floor 15, room 408, sir.”</span>\n</p>\n<p> </p>\n<p>\n<span>Nabbing the keys, Katsuki stormed over to the elevator. He questioned booking it up the stairs but even 15 flights was a task for the pro-hero and he knew the elevator was faster. Even if he didn’t like the idea.</span>\n</p>\n<p> </p>\n<p>\n<span>PING</span>\n</p>\n<p> </p>\n<p>\n<span>Katsuki nearly threw his phone at the speed of which he went to grab it, going through his notifications in a frantic state.</span>\n</p>\n<p> </p>\n<p>\n<span>———————</span>\n</p>\n<p>\n<span>Deku: Kacchan he’s here!!</span>\n</p>\n<p>\n<span>Deku: KACCHAN!</span>\n</p>\n<p>\n<span>———————</span>\n</p>\n<p> </p>\n<p>\n<span>Katsuki’s eyes nearly popped out of his head, a bead of sweat dripping from his brow. That fucker was here! That piece of shit!! Katsuki nearly blew a hole into the elevator button trying to get the stupid thing to go faster, anxiety pooling deep into his gut. This couldn’t be happening! This shouldn’t be happening! Originally he was just going to keep tabs on the room and make sure nobody came by, but the fucker actually decided to show! </span>\n</p>\n<p> </p>\n<p>\n<span>Waiting exactly 2 seconds, Katsuki eventually just said “fuck it” and ran to the steps. He didn’t care anymore if this was or wasn’t a good idea, he didn’t give a shit. He was going to protect Deku if it was the last damn thing he did!</span>\n</p>\n<p> </p>\n<p>\n<span>———————</span>\n<span>\n<br>\n</span>\n<span>Kacchan: Don’t leave your room!!</span>\n<span>\n<br>\n</span>\n<span>Kacchan: Just stay where you are!</span>\n<span>\n<br>\n</span>\n<span>———————</span>\n</p>\n<p> </p>\n<p>\n<span>Katsuki bolted up all 15 flights of steps, his body running on pure adrenaline at this point. “Deku please just be safe…” The blonde swore to himself, after 10 excruciating minutes he finally broke through the door of floor 15. </span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“His name is Mako Osamu.” Mina begins, bringing up the man in question's report. “He’s 27 years old, and has only ever had a few minor misdemeanor charges through the years but overall a clear record. Guy works as a software engineer and according to his co-workers he’s a very quiet and well mannered man.”</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“Well mannered my ass. Dudes a freak with some quirkless fetish or some shit.” Katsuki spat.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“Possibly. We can’t say for sure this is our guy though. But he matches the description Midoriya- er, Deku, gave to the police.” Mina continued, staring back to the man's profile. “His quirk is the most interesting part of this though, and what actually caught my eye. It's similar to Shinsou’s, where he can control his target. But unlike Shinsou he doesn’t need the other to reply verbally, he just has to say a specific phrase for it to work. The target is also fully aware of what they’re doing but can’t stop it. Creepy...”</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Hearing this made Katsuki’s skin crawl. Had Deku had to endure that? Had he been fully aware of what was happening but helpless to stop? Katsuki’s blood began to boil. “So how do you stop it?”</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“Well, since he’s not a villain there’s no documentation on that. Only criminals get that kind of stuff filed away, but if I had to guess, if you can’t hear him then it just won’t work. That’s why I’ll be sending you off with these.” Mina smirked, pulling out a pair of noise cancelling earbuds. “I’ll also be notifying the hotel just in case this is our man and a fight breaks out.”</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“So, what you’re saying is…” Katsuki could feel a toothy smile creepy across his sharp features. “I can beat this guy to a pulp.”</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>---------------</span>\n</p>\n<p> </p>\n<p>\n<span>The world became muffled around Izuku as he stared at the door before him. He could still make out the sound of the beast aggressively banging on it even through the music drumming in his ears. With a shaky breath Izuku surveyed his surroundings. </span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>If I unplug the lamp then I'll have a heavy weapon I can hit the attacker with. I’ll need to be fast though, the second he realizes I have headphones in he’ll attempt to rip them out and force me to hear him. If I can manage to get behind him and hit the back of his neck hard enough it might just knock him out, but only if I manage to hit him in the right spot and hard enough. I don’t have any actual weapons on me though, so this might be my best bet…</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Once he’s knocked out I’ll break for the door and get help, calling the police while i head for the elevator- no steps! I can run down a few flights before going to another level to hide. Elevator is too risky if he wakes up and I can’t get in fast enough. </span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Just breathe Izuku, you’re gonna be fine. </span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>“Alright…” Izuku mumbled aloud and got into action.</span>\n</p>\n<p> </p>\n<p>\n<span>Unplugging the lamp, Izuku moved to the closet near the door then closed the bathroom. With luck, the stalker will assume he’s hiding in there and check there first and he’ll be able to get a sneak attack from behind. It was a long shot, but it was all he had.</span>\n</p>\n<p> </p>\n<p>\n<span>The greenette got into place, and waited, trying to calm his nerves that dared to bubble to the surface. Fear and panic had become a common feeling these past few weeks, but today he was going to face the beast that had caged him in his own mind and free himself along with. He didn’t know where Kacchan had gone but he prayed he was okay. Maybe if he was lucky Kacchan had contacted the police again.</span>\n</p>\n<p> </p>\n<p>\n<span>BANG</span>\n</p>\n<p> </p>\n<p>\n<span>BANG</span>\n</p>\n<p> </p>\n<p>\n<span>The beast was here.</span>\n</p>\n<p> </p>\n<p>\n<span>Izuku covered his mouth with a shaky hand, trying to still his breathing scared the man before he heard. The greenette would feel hot tears trickling down his freckled cheeks, his entire body trembling within the closet.</span>\n</p>\n<p> </p>\n<p>\n<span>He could hear muffled words as the man walked through the hotel room, clearly searching for him. Carefully, and as quietly as Izuku could manage with music still blasting in his ears, he opened the door to peer out and see where the beast had gone once he couldn’t hear any more sounds beyond the door. Right as he started to creek the door open it abruptly slammed open and there stood the beast before him. Those intense cat-like eyes peering down at him as he trembled. Fear.</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>No. Not again!</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Izuku charged! Using the lamp as a weapon to hit the stalker's head, he seemed almost amused of his fight, casually moving out of the way before Izuku could land a hit. He was saying something but Izuku couldn't make it out between the music blasting and his own heart beat thumping in his ears. Again Izuku swung, but nearly tripped over his own feet to avoid a hand attempting to slam him into the wall. </span>\n</p>\n<p> </p>\n<p>\n<span>The rage the greenette felt coiled down into his belly slowly outweighed the overwhelming fear that sunk deep below his skin. A flaming inferno that threatened to erupt. This man clearly knew what he was doing and this wasn’t the first time he had done this. He was a villain, and Izuku knew he wasn’t going to be his last victim. No, far from it.</span>\n</p>\n<p> </p>\n<p>\n<span>Before Izuku could think, a hand was shoved onto his face and his head met a wall with a heavy hit. Those awful sharp teeth smirking down at his trembling form. Izuku wasn’t a trained fighter, no, far from it. He was a nurse in training, here to help save lives! He was smart and analytical no doubt, but nothing could compare to real combat experience. He was outmatched.</span>\n</p>\n<p> </p>\n<p>\n<span>His muscles ached, the back of his head stung, and he could almost swear he felt blood starting to drip down to his neck. It was just like last time. He was helpless. </span>\n</p>\n<p> </p>\n<p>\n<span>The beast removed his earphones, still eyeing him up and down with an amused smirk. “Well, you tried, kitten. I’ll give you that. But sadly you and I are just on different playing fiel-” </span>\n</p>\n<p> </p>\n<p>\n<span>And then, an explosion.</span>\n</p>\n<p>\n<span>Katsuki stood in the doorway, watching as Deku’s face was nearly crushed. Before Katsuki could even think, his hands were steaming and a burning hot explosion was sent through his palms and right at the attacker.</span>\n</p>\n<p> </p>\n<p>\n<span>Deku’s body slumped to the ground as he rushed to the smaller man's side and held him steady. He looked shaken and confused, his mind still trying to catch up to what he had witnessed. Those gorgeous viridian peered up into Katsuki’s scarlette embers, a whirlwind of emotions flooded through Katsuki’s entire being. An intense burning inferno lit between the two as they scanned the other's features, like a pull deep in their hearts had been yanked out and connected them finally. A piece to this puzzle that life dared hand them and all this time they had been desperately trying to put together but never knowing where the final piece lay.</span>\n</p>\n<p> </p>\n<p>\n<span>It was here.</span>\n</p>\n<p> </p>\n<p>\n<span>The piece was found.</span>\n</p>\n<p> </p>\n<p>\n<span>But before they could lemette on this strange feeling, there was another issue at hand. Katsuki quickly snatched Deku up and hid his form behind his body, glaring down at the man before him. “Stay behind me and put these in.” Katsuki huffed, handing over the noise cancelling earbuds.</span>\n</p>\n<p> </p>\n<p>\n<span>The moment he spoke, Deku’s eyes grew to saucer plates, Katsuki’s deep raspy voice all too familiar to the other man by now. “K-Ka-” He began, though quickly cut off by Katsuki speaking again.</span>\n</p>\n<p> </p>\n<p>\n<span>“I’ll explain later. Earbuds. Now.” Katsuki hissed, turning his attention back to the man before him. “So, you got some freaky quirkless fetish, or you just prefer victims who can’t fight back with a quirk?” The blonde sneered, giving Osamu a feral grin.</span>\n</p>\n<p> </p>\n<p>\n<span>Osamu slowly roused from where he had been blasted, turning his eyes to face the hero before him. Most men would be terrified to see the number one hero facing him down, but Osamu wasn't like most men. He let out a breathy laugh, standing to his full height as his cat-like eyes stared daggers down at Katsuki. It all made sense now.</span>\n</p>\n<p> </p>\n<p>\n<span>Truth be told, Osamu was jealous. It started happening before he met Deku, you see. The attacks. He couldn’t really help himself, every time he saw an adorable quirkless person he just needed to devour them. And sure he’d gone too far, and even killed a few. But it was their fault for being so tempting to Osamu. He had never wanted to hurt them, really! But he got too rough with them and their cute little bodies.</span>\n</p>\n<p> </p>\n<p>\n<span>When he had found Deku’s stream he thought he could get his fix but at a safe distance. He wouldn’t need to hurt anyone else anymore and maybe even get the adorable greenette to notice him. That was until “Kacchan” showed up.</span>\n</p>\n<p> </p>\n<p>\n<b>He</b>\n<span> rolled into chat one day and dared to throw money around like it was nothing. Who gave him the right? Then the fucker kept showing up, giving more donations, getting closer and closer to </span>\n<b>his</b>\n<span> Deku. Did he think he was better than everyone else? That he deserved Deku’s time more? Osamu worked his ass off at his boring desk job, he did his best to obey the law, and the one good thing he had started to have going for himself was taken away by some-- some loud mouth pervert on the internet! Kacchan can pretend all he wants that he’s just doing this to be nice but Osamu knew how people were.</span>\n</p>\n<p> </p>\n<p>\n<span>So when he had figured out where Deku- or should he say, his little Izuchan lived, and he planned on making a visit. A romantic meet up at the gym! Like something out of one of a movie! They could meet up, fall in love, and forget stupid Kacchan in the past.</span>\n</p>\n<p> </p>\n<p>\n<span>But it didn’t go that way. No. Osamu was far too late and the bastard had already taken him.</span>\n<em>\n<span> “I- uh. Ahem. Oh crap is it really getting th-that late. S-sorry, but I really need to g-get going. M-my uh, b-boyfriend is gonna get worried.”</span>\n</em>\n<span> Those words echoed inside Osamu’s head after their encounter. He was going to make sure Deku never forgot about him for as long as he lived. </span>\n</p>\n<p> </p>\n<p>\n<span>He dared to hurt his heart like that, so Osamu would hurt his body in return. It’s only fair, right? Osamu was a good man, and he could have been such a good boyfriend to Izuchan, but just like all the others they tossed him to the side! They deserved the pain!</span>\n</p>\n<p> </p>\n<p>\n<span>With teeth like a wolf, snarled into a viscous grin Osamu peered down at the man before him. He knew that wild blonde hair and blood red eyes from anywhere. DynaMight. The number one pro hero in all of Japan, beloved and feared by many. The Symbol of Victory. And here he was, standing right in front of him, with eyes like an apocalypse. </span>\n</p>\n<p> </p>\n<p>\n<span>“So, the slut managed to hook the Number One hero. Izuchan, why don’t we just start over? Your beloved DynaMight is gonna leave you the second he finds another piece of ass to replace you. Come with me! No one else will ever love you like me!! He doesn’t love you!”</span>\n</p>\n<p> </p>\n<p>\n<span>Izuku was shaking like a leaf, his eyes wide and full of tears as he clung to Katsuki for dear life. Before Osamu could get another word out he put in the earbuds and accepted his fate into total quietness, just murmurs of the world around him. </span>\n</p>\n<p> </p>\n<p>\n<span>He didn’t even know what this man was trying to say. Love him? This wasn’t love! He had broken his legs, his arm! He had scars now from the assault and regular panic attacks every night! None of that was love, that was abuse! He might not know much about romance, but he wasn’t stupid, and he sure as hell knew better than whatever this psychopath was trying to sell him. </span>\n</p>\n<p> </p>\n<p>\n<span>Steam began to rise off of Katsuki’s palms again, a deep animalistic growl vibrating through his entire being. This was no longer a civilian, this was a full fledged villain. The Quirkless Killer. </span>\n</p>\n<p> </p>\n<p>\n<span>He had nearly gotten Deku a second time, but Katsuki was gonna make sure there wouldn’t be a third chance. Not now and not ever. In the time he had met Deku he had slowly begun to realize he fell for the boy with stars in his evergreen eyes and galaxies across his skin. Truly, it was the very night they met that his very heart was ripped from his chest that this gentle man now held. And in that time, Katsuki had learned not to hold onto the fear of this man’s gentle hands holding it like it was the most precious thing on Earth. He knew Deku would keep it safe, and cherish it always.</span>\n</p>\n<p> </p>\n<p>\n<span>It was that night that he darted light the match of their feelings, watching as the embers burned around them. He was terrified of this roaring flame that had begun to spread around them, a Hellfire that wouldn’t dare go down. And Katsuki was happy to watch it burn ablaze.</span>\n</p>\n<p> </p>\n<p>\n<span>He would fan this flame with his dying breath, letting it spread around them until nothing was left. This warm afterglow of heat that he dared call their romance wasn’t going to simply end, and not by some creep who tried to stand between them.</span>\n</p>\n<p> </p>\n<p>\n<span>Katsuki prepared himself, rearing back as Osamu ran at him, drawing a sharp blade from his back pocket. It was frustrating not being able to hear the world around them, even more so that he couldn’t comfort the man behind him with soothing words, but that would need to wait.</span>\n</p>\n<p> </p>\n<p>\n<span>With a harsh step to the right, Katsuki managed to block Izuku’s body from the attack as well as grab ahold of Osamu’s arm to force it into an uncomfortable angle and force him to drop the blade. Katsuki however, underestimated his opponent and the raven haired man grabbed the blade with his other hand, quickly getting a low blow on Katsuki’s thigh. Hissing in pain, Katsuki brought his leg up to knee Osamu in the ribs, only to be met with another sharp stab, this time in the side. Near the liver. Shit.</span>\n</p>\n<p> </p>\n<p>\n<span>Katsuki let off an explosion near the man's ears, loud enough to deafen him and char the skin around. Izuku was practically pinned against the wall behind the blonde as the two continued their battle, his mind a racing thunder.</span>\n</p>\n<p> </p>\n<p>\n<span>The knife was twisted deep into the blonde's body, an ear piercing scream escaping his lips as he attempted to escape. The pain surged up through his spine, making him feel woozy. </span>\n</p>\n<p> </p>\n<p>\n<span>This was bad.</span>\n</p>\n<p> </p>\n<p>\n<span>“Wait!” </span>\n</p>\n<p> </p>\n<p>\n<span>Osamu’s movement’s halted, looking into those gorgeous evergreens from behind the explosive man before him. </span>\n</p>\n<p> </p>\n<p>\n<span>“I’ll go with you. Please just… just stop hurting him!” Izuku wept, his eyes lined with red from all the tears he couldn’t seem to stop. “I’ll do anything you want, okay?”</span>\n</p>\n<p> </p>\n<p>\n<span>Osamu ripped the knife from Katsuki’s bleeding form, letting it drop to the ground with a clatter. He looked absolutely ecstatic to hear those words, like he had been waiting for years to finally hear them. “My Izuchan~! Of course! I’m going to make you so happy, I promise.” </span>\n</p>\n<p> </p>\n<p>\n<span>Shoving Katsuki’s form to the side with a force like a truck, Osamu made his way over to Izuku with a feral cheshire grin. With none of the intensity and fury that Izuku had just seen, Osamu gently ran his fingers along Izuku’s freckled cheeks and took in the sight before him. Warm blood smeared over Izuku, making his skin crawl, but he didn’t dare show it. However he instead opted for a nervous smile.</span>\n</p>\n<p> </p>\n<p>\n<span>Katsuki held onto his side, groaning in agony as he looked back up at the two men. This couldn’t be happening. “D-Deku… no…” Katsuki rasped out. His vision was slowly going dark as he bled out, feeling his warmth gush over his shaking hands. He came here to save Deku, not watch him be taken away!</span>\n</p>\n<p> </p>\n<p>\n<span>Izuku gave Katsuki a sad look, his eyes an endless ocean of emotions that Katsuki couldn’t yet decipher. He didn’t want this to be the last time he saw those gorgeous star-like eyes, he didn’t want this to be the last time he heard the man’s angelic voice that made warmth pool in his gut. This just couldn’t be it!</span>\n</p>\n<p> </p>\n<p>\n<span>“I-It’ll be al-alright.” Izuku managed, though he wasn’t sure if Katsuki could even hear him at this point. Izuku allowed the larger man to slowly lead him out, a firm hold placed around the back of his neck as the two excited the hotel room. The air was thick with anxiety around them.</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>After all, Heroes do what they must even if it costs them their life.</span>\n</em>\n<span> Izuku thought to himself. </span>\n<em>\n<span>And I want to be a hero.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>I am here, Kacchan.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“Now, be a dea-”</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Quick as a thunderstrike, Izuku pulled out a knife he had hid in his hoodie pocket he snagged off of Katsuki’s belt and plunged it straight into Osamu’s side, forcing the blade as deep as he possibly could. Thinking on his feet, Izuku shoved the taller man down to the floor, slamming his head down hard. He wasn’t a fighter, no, but he wasn’t useless either!</span>\n</p>\n<p> </p>\n<p>\n<span>Izuku plunged the knife deep into Osamu’s right arm between the shoulder and connective tissue. He made quick work of tearing apart the muscle fibers and damaging the area around, having noted that he was right handed and seemed to always go in with a strong right hook, similar to DynaMight but that’s where the similarities end. </span>\n</p>\n<p> </p>\n<p>\n<span>“You will not hurt me or anyone else again!” Izuku shouted, his voice a deep smoke that seethed from his lips. With a hard hit, Izuku smacked Osamu's face. Rage and fire coiling deep below his skin like a thunderstorm of emotions he had never felt before.</span>\n</p>\n<p> </p>\n<p>\n<span>Osamu didn’t even have the chance to fight back, his consciousness drifting by the final strike. Pain pooling deep into his being.</span>\n</p>\n<p> </p>\n<p>\n<span>“H-holy shit…” came a horse rasp from beside Izuku, looking over to meet those deep scarlett rubies he could never get out of his mind.</span>\n</p>\n<p> </p>\n<p>\n<span>“Kacchan!” Izuku wept, clambering off of the raven haired man and scooping up Katsuki into his trembling arms. “Kacchan are you okay!?” Izuku cried, burying his face into his wild ashen locks.</span>\n</p>\n<p> </p>\n<p>\n<span>“H-hey there freckles.” Katsuki hummed, looking up at Izuku like he was the sun itself. Blinding, beautiful, and all encompassing. </span>\n</p>\n<p> </p>\n<p>\n<span>“K-Kacchan we need to get y-you to the hospital! We need to-”</span>\n</p>\n<p> </p>\n<p>\n<span>“Help is on its way, don’t worry. Hhnng, fuck. Got me pretty good though.” Katsuki let out a low rumble of a laugh, feeling his vision get spottier by the second.</span>\n</p>\n<p> </p>\n<p>\n<span>Izuku looked stunning, the lights above like a halo around him as his gorgeous ocean eyes continued to weeb. His skin a constellation of freckles, small worried lines etched into his brow and under his eyes. His face told a deep and beautiful story that Katsuki wanted to hear about time and time again, listening to those angelic words woft into his ears.</span>\n</p>\n<p> </p>\n<p>\n<span>“You’re like an angel.” Katsuki hummed, before feeling his consciousness finally go.</span>\n</p>\n<p> </p>\n<p>\n<span>“Kacchan…? Kacchan!?”</span>\n</p>\n<p> </p>\n<p>\n<span>----------------------</span>\n</p>\n<p> </p>\n<p>\n<span>Slowly, Katsuki opened his eyes to the sound of machinery around him and a throbbing pain in his side. Beautiful viridian captured his gaze as Katsuki looked down to see the sleeping form of none other than Izuku Midoriya next to him. His mass of curls a mess from being half squished into the hospital bed, uncomfortably leaning his head only a few inches from Katsuki’s lap.</span>\n</p>\n<p> </p>\n<p>\n<span>Slowly and cautiously Katsuki ran a callused hand through Deku’s fluffy curls, feeling the soft hairs. He really did look like an angel like this.</span>\n</p>\n<p> </p>\n<p>\n<span>Deku’s long lashes started to fluffer, those gorgeous emeralds meeting his own rubies. Katsuki felt warmth coil in his gut and butterflies try to escape out through his throat. Suddenly his mouth felt very very dry, and he couldn’t even think of what to say. The two stared at each other like they were the first person they’d ever seen in their entire life.</span>\n</p>\n<p> </p>\n<p>\n<span>“K-Kacchan? Or, uh- should I say DynaMight? Y-you are Kacchan right? Or am I just being dumb, oh god I’m sorry I didn’t even ask if you’re feeling okay! I’m sorry-” Deku fumbled over his words, his arms starting to flail as he spoke.</span>\n</p>\n<p> </p>\n<p>\n<span>“Deku!” Katsuki cut in, his cheeks feeling warm at hearing his nickname in person. He was too cute for his own damn good.</span>\n</p>\n<p> </p>\n<p>\n<span>“Holy crap, so-” Deku took in a shaky breath, finally rising to sit up to his full height. “So y-you’re actually DynaMight? Why didn’t you say anything…? I guess you couldn’t huh?”</span>\n</p>\n<p> </p>\n<p>\n<span>Sheepishly, Katsuki looked away, feeling guilt eat away at him. “I wanted to, believe me. But I worried it might freak you out, or hell, put you in danger. Then the longer I waited I just- fuck. I started thinking and worrying more. Worried you’d get mad I lied or some shit. Didn’t wanna lose- y’know. This.” Katsuki averted his gaze, his hand motioning between the two. “Whatever </span>\n<em>\n<span>this </span>\n</em>\n<span>is.”</span>\n</p>\n<p> </p>\n<p>\n<span>Deku stared at him, his expansive forested eyes scanning Katsuki’s entire face. Then, something strange happened. He laughed. The softest, most adorable laugh that Katsuki had heard fluttered out of Deku. “You were scared I’d be MAD? At you!? Kacchan, you’re the last person I could ever get mad at. And let alone because you had to hide your identity from me. I’m just… Wow. I’ve been friends with DynaMight for months now! And you’ve had to sit through me gushing over well, you!” Deku snorted a laugh, his cheeks turning a brilliant red. “This doesn’t even feel real, holy crap.” </span>\n</p>\n<p> </p>\n<p>\n<span>“Yeah, yeah.” Katsuki waved off, feeling his own face start to burn. “Go ahead an’ fanboy ya damn nerd. It's not like I choose to tune in multiple times a week to hear your nerdass word vomit about how amazing I am ‘n shit.”</span>\n</p>\n<p> </p>\n<p>\n<span>Deku let out another laugh, this time warm and bubbly. Nothing like those awful nervous ones he had to listen to earlier. These were kind and soft, they tickled Katsuki’s ears in a way that no other sound could compare. “I just, wow. I can’t believe it.”</span>\n</p>\n<p> </p>\n<p>\n<span>Deku gave a soft, shy smile. Eyeing Katsuki as he bit his lip. Man had no right being so gorgeous, it was sinful.</span>\n</p>\n<p> </p>\n<p>\n<span>“Izuku Midoriya.” Finally came from Deku, nn outstretched hand near Katsuki’s. “That’s um, that’s my name.”</span>\n</p>\n<p> </p>\n<p>\n<span>Katsuki eyed at the hand before him, before giving a smug smile and clasping it into his own, noting just how much smaller it felt in his own massive one. “Katsuki Bakugou.”</span>\n</p>\n<p> </p>\n<p>\n<span>“It's a pleasure to finally meet you, Katsuki.” Deku beamed.</span>\n</p>\n<p>\n<br>\n<span>“Just stick to Kacchan, I like it better.”</span>\n<span>\n<br>\n</span>\n<span>\n<br>\n</span>\n<span>“O-okay.” Deku gave a soft smile, his cheeks turning a deeper shade of burgundy. “Kacchan.”</span>\n</p>\n<p>\n<span>It had been a few days now since Katsuki’s release from the hospital and he had been kept painfully busy filling out paperwork on the case as well as preparing for an interview as the person who “caught the Quirkless Killer” though in reality he knew it was he and Deku who did it together, but his publicist said it was safer if he simply said he was the only one. Keeps Deku out of the news so he doesn’t get more stalkers and helps Katsuki’s own reputation, though he couldn’t help but feel like it wasn’t his win to own, even if Deku said it was fine.  </span>\n</p>\n<p> </p>\n<p>\n<span>It felt like poetic justice having the Quirkless Killer be taken down by none other than a Quirkless person, however.</span>\n</p>\n<p> </p>\n<p>\n<span>“Kacchan it’s fine, really.” Deku laughed on the other end of the line. “It’s better for your reputation anyways. I’m not some vigilante, I’m a nurse in training.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Yeah but- ugh! Didn’t you want to be a hero? This could be a good thing for Quirkless people.” </span>\n</p>\n<p> </p>\n<p>\n<span>“Hmmm, maybe. At this point I’m just glad the guy is off the streets and far away from anyone that could get hurt by him.” Deku hummed into the phone. “Did they ever find out what his deal was?”</span>\n</p>\n<p> </p>\n<p>\n<span>“His deal?” Katuski huffed, entering his apartment and sitting down his groceries. </span>\n</p>\n<p> </p>\n<p>\n<span>“Yeah, like, his motive and stuff.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Oh, guy was just a freak. Had a fetish for Quirkless people or some shit, and kept hurting them. Said they deserved it or some creepy shit. He found your stream and I guess that made him stop for awhile until-“ Katsuki paused. Should he tell Deku this?</span>\n</p>\n<p> </p>\n<p>\n<span>“Until what?”</span>\n</p>\n<p> </p>\n<p>\n<span>“Uh, until I joined. I guess you giving me extra attention started to drive him over the edge. So, In some fucked up way I kinda caused this. Fuck…”</span>\n</p>\n<p> </p>\n<p>\n<span>“What!? Kacchan you didn’t cause this! It was entirely his fault not yours!” Deku rasped, his voice cracking slightly as he yelled. “You couldn’t have known this would have happened!”</span>\n</p>\n<p> </p>\n<p>\n<span>“Yeah well, I still feel bad. I was just trying to impress you or something I guess.” Before Katsuki could stop the words they had already left his mouth and his cheeks were burning. </span>\n<em>\n<span>Goddamnit Katsuki!</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>“I-Impress me?” Deku gasped. “Wh-why would you want to do that?”</span>\n</p>\n<p> </p>\n<p>\n<span>Katsuki looked up at the ceiling mouthing the word </span>\n<em>\n<span>fuck</span>\n</em>\n<span>, unsure of what to say next. He wasn’t exactly known for his dishonesty but he also wasn’t known for being the most emotionally open person either. </span>\n</p>\n<p> </p>\n<p>\n<span>Eating his own ego for once in his life, Katsuki finally spoke. “Thought you were pretty.” His ears felt like they were on fire, hell if he didn’t know any better he’d think steam was coming out.</span>\n</p>\n<p> </p>\n<p>\n<span>“P-pretty? Me? I’m not a girl, Kacchan.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Yeah no shit Sherlock. Men can be pretty. You’ve called </span>\n<b>me</b>\n<span> pretty before.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Oh fuck-CRAP! No! Ugh!!!” </span>\n</p>\n<p> </p>\n<p>\n<span>Katsuki couldn’t help but laugh at that. “Izuku Midoriya! Was that a swear? My, what would your mother think!”</span>\n</p>\n<p> </p>\n<p>\n<span>“Shut up, your swearing has rubbed off on me!” </span>\n</p>\n<p> </p>\n<p>\n<span>“Me? Swearing? I don’t know what you mean! I’m an Angel! I never swear and I am always very very polite.” Katsuki coos, sarcasm dripping from his tone.</span>\n</p>\n<p> </p>\n<p>\n<span>“Hardy harr harr.” Deku huffs, but a smile clearly on his lips. “But, you’re right.”</span>\n</p>\n<p> </p>\n<p>\n<span>“About?”</span>\n</p>\n<p> </p>\n<p>\n<span>“You are very pretty.”</span>\n</p>\n<p> </p>\n<p>\n<span>Katsuki almost felt dizzy at those words. He’d been told he was handsome, pretty, hot, just about everything under the sun by fans all around the world. But something about Izuku Midoriya, something about the words he spoke sent electricity through his spine and lit up his world like nothing else could. It was addictive just how this man made him feel. He wanted to kiss bruises into his gorgeous freckled skin, hold him in his strong arms and never let him go. Always keep him safe from a world that dare damage someone so soft and gentle.</span>\n</p>\n<p> </p>\n<p>\n<span>“Hey, Deku. Come by my place tomorrow.” </span>\n</p>\n<p> </p>\n<p>\n<span>There was a sharp intake of breath followed by a long pause. Then, the softest tone that Katsuki had ever heard in his entire life. “O-okay.”</span>\n</p>\n<p> </p>\n<p>\n<span>-------------------</span>\n</p>\n<p> </p>\n<p>\n<span>Izuku stood outside of the Number One Heroes apartment complex, his head was still reeling. Was he really here? Was this really happening? The nearly 3 hour train ride felt like a fever dream, and Kacchan texting him every few minutes to make sure he was okay, the man clearly still a nervous wreck from what happened to them both. Izuku still didn’t feel fully safe in his home and would jump at the slightest of sounds, so being around Kacchan sounded like a blessing.</span>\n</p>\n<p> </p>\n<p>\n<span>But in the same breath, a horrible curse. Kacchan wasn’t just anyone, but friggin DynaMight! His celebrity crush! And that’s what he thought it would remain, a celebrity crush! Now he was about to be face to face with the gorgeous man again and Izuku didn’t even know if his heart could handle it.</span>\n</p>\n<p> </p>\n<p>\n<span>Tentatively Izuku clicked the buzzer, waiting for the blonde to answer. </span>\n</p>\n<p> </p>\n<p>\n<span>“Yo.”</span>\n</p>\n<p> </p>\n<p>\n<span>“I-Its uh, me. Izuk-er, Deku.” Izuku huffed out a laugh, running a scarred hand through his unruly curls. </span>\n</p>\n<p> </p>\n<p>\n<span>There was silence, and eventually followed by a loud buzzing sound, the doors to the complex opened. Nervously Izuku entered, making his way to the room number that Kacchan had texted him prior. Before he could even knock the door swung open, causing a small yelp to escape from the greenette and making him stagger back against the wall. There before him stood Dynamight. He really was pretty, and tall, all muscle with a broad chest. His eyes were a beautiful deep burgundy, framed by short pale eyelashes. Izuku’s heart was stuck in his throat, his hands starting to sweat as his thoughts tried to catch up with him. </span>\n</p>\n<p> </p>\n<p>\n<span>“You gonna just stand there? Or you comin’ in?” Kacchan finally spoke, moving to the side to allow Izuku to enter.</span>\n</p>\n<p> </p>\n<p>\n<span>“O-oh right! Sorry!” Izuku blushed, making his way past Kacchan and into the man’s apartment. </span>\n</p>\n<p> </p>\n<p>\n<span>It was huge, it made Izuku’s apartment look like nothing more than a shoebox in comparison. It was extremely modern, with a simplistic look to it. Kacchan never seemed like the sort to like clutter anyways so it made sense. </span>\n</p>\n<p> </p>\n<p>\n<span>Leaning down, Izuku started taking off his red hightops, feeling Kacchan’s eyes leer on him. It was amazing being around the man after so long, but also terrifying. What was he suppose to say? </span>\n</p>\n<p> </p>\n<p>\n<span>“Ahem, um. D’you want any tea or coffee? Or water…?” Did Kacchan seem nervous? That was strange.</span>\n</p>\n<p> </p>\n<p>\n<span>“O-oh uh, maybe some tea. Tea would be nice, thank you.”</span>\n</p>\n<p> </p>\n<p>\n<span>With a grunt Kacchan set about making two cups of black tea, constantly having to dry his own hands due to nervous sweating. Couldn’t exactly hand over a cup of tea covered in nitroglycerin.</span>\n</p>\n<p> </p>\n<p>\n<span>“D’you like milk or sugar with it?” Kacchan hollered from over his shoulder as Izuku made his way into the kitchen. It was, just like the rest of the house, beautiful. </span>\n</p>\n<p> </p>\n<p>\n<span>Gorgeous marble countertops adorned with miscellaneous items, a dark wooden cutting board sat utop the counter as well as a knife block. Izuku had recalled Kacchan was a good cook, and was curious how his cooking tasted. Perhaps he could ask some time? Would that be weird?</span>\n</p>\n<p> </p>\n<p>\n<span>“Nerd, you’re mumbling. Sugar and milk, yes or no?”</span>\n</p>\n<p> </p>\n<p>\n<span>Izuku’s face flushed a brilliant bright red, his hands clasping over his mouth. “S-sorry! Yeah, sugar and milk please.”</span>\n</p>\n<p> </p>\n<p>\n<span>There was a beat of silence between the two before Kacchan spoke again, “And yeah, I can cook you something. If you want...” A clear deep red spreading across the blonde’s ears. Izuku couldn’t help but think it made him look cute.</span>\n</p>\n<p> </p>\n<p>\n<span>“I think I’d like that.”</span>\n</p>\n<p> </p>\n<p>\n<span>After the tea had been made, the two made their way into the living room and sat on Kacchan’s couch. A deep black leather, Izuku didn’t know much about interior design but everything looked expensive. Holding the warm cup up to his lips, the freckled man couldn’t help but notice the eyes scraping up and down his form. Katsuki’s eyes were deep and intense, reminding him of burning magma beneath the surface that Izuku didn’t know what to do with.</span>\n</p>\n<p> </p>\n<p>\n<span>“S-so, why did you invite me over?” Izuku finally spoke, taking a sip of the tea. It was delicious, though he wasn’t sure what the brand was. A delighted noise lept from Izuku’s soft pink lips as he took another rip. </span>\n</p>\n<p> </p>\n<p>\n<span>“Uh, well.” Again, that nervousness that Izuku wasn’t used to seeing. “Figured it was better to ask this in person, then over the phone.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Ask what?” </span>\n<em>\n<span>What on earth couldn’t be asked over the phone? Was it more about the case?</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Kacchan slowly sat down his drink, his face a deep burgundy similar to his eyes. “Dek- ahem. Izuku.” Hearing his first name from Kacchan’s deep gravelly voice was like electricity being shot through his system. A spark that trickled down his spine and met low and warm in his gut.. </span>\n</p>\n<p> </p>\n<p>\n<span>The next sentence out of Katsuki’s mouth, Izuku could never have predicted, let alone fathomed. “D’you wanna, maybe… Date?” A titlewave of emotions was sent flooring through Izuku like a punch to the gut. </span>\n</p>\n<p> </p>\n<p>\n<span>Had he heard that right? DynaMight, THE DynaMight wanted to date him?! Number One Pro Hero in all of Japan, rated Japan’s sexiest man alive, and the man that had saved his life twice?! He wanted to date him?!</span>\n</p>\n<p> </p>\n<p>\n<span>“You mumble like this all the fuckin’ time, nerd?” Kacchan spoke, his eyes focused and intent upon Izuku.</span>\n</p>\n<p> </p>\n<p>\n<span>“S-sorry! I just… wow. You want to date me!? Me!? Did I hear that right?” Izuku blabbered, feeling hot tears form in his brilliant evergreens.</span>\n</p>\n<p> </p>\n<p>\n<span>“I’ve never wanted anyone but you, Izuku.” Kacchan said plainly, as though it was a fact as simple as the sky being blue or the sun a star. </span>\n</p>\n<p> </p>\n<p>\n<span>Emeralds met rubies, forest meeting fire. A dance these two had been a part of since the day they met, each step in sync to the orchestra of their life. A song only the two of them could hear but they moved to like they had known it since the day they were born. Pulling and tugging them closer and closer. The string of fate tangling them, intertwining their very souls. Unable to escape the other in this life or any other.</span>\n</p>\n<p> </p>\n<p>\n<span> A thoughtful silence between the two, the air growing thick around them. Izuku swallowed his words, trying to think of what to say next. “A-are you sure?” He rasped out as though the air was ripped from his lungs.</span>\n</p>\n<p> </p>\n<p>\n<span>“Have been since the day we met.” Katsuki hummed, closing the distance. A large calloused hand running its way along Izuku’s cheek. “Since I saw those star-like eyes.”</span>\n</p>\n<p> </p>\n<p>\n<span>Izuku’s face felt like it was aflame, he couldn’t believe what he was hearing. Had Katsuki really felt this way all those months ago? Was this even real!?</span>\n</p>\n<p> </p>\n<p>\n<span>“So, what d’you say?”</span>\n</p>\n<p> </p>\n<p>\n<span>“The only person I want is you, Kacchan.” Izuku smiled softly up at the other, leaning into Katsuki’s space even more.</span>\n</p>\n<p> </p>\n<p>\n<span>“Then I’m yours.” Katsuki hums, their lips finally meeting.</span>\n</p>\n<p> </p>\n<p>\n<span>It felt like lightning, an explosion that punched Izuku right in the gut. Pure electricity through his veins as that gorgeous hot mouth opened up for him. Izuku wasn’t sure what he was doing, but Katsuki was quick to take the lead.</span>\n</p>\n<p> </p>\n<p>\n<span>Their bodies intertwined as Katsuki pulled Izuku lithe form firmly onto his lap to take in more of him. He was like a livewire, a beautiful dancing flame that Izuku wished to hold and cherish for the rest of his life and into every next one. </span>\n</p>\n<p> </p>\n<p>\n<span>Their bodies melted together, the puzzle finally completed after this entire time. Perfectly completing the other in this fantastical dance they had started unbeknownst to them.</span>\n</p>\n<p> </p>\n<p>\n<span>A simmering flame that never could go out so long as their souls remained entangled together.</span>\n</p>\n<p> </p>\n<p>\n<span>“Always- ah, always and forever, Kacchan.” Izuku groaned, allowing Katsuki to trail gentle kisses down his neck. “Always yours.”</span>\n</p>\n<p> </p>\n<p>\n<span>“I love you, Izuku. </span>\n<em>\n<span>Fuck.</span>\n</em>\n<span>” Katsuki mumbled, burying his head deep into Izuku’s shoulder. Holding him tightly, like if he dared let go the other might drift away and be lost forever. “I’m so unfathomably in love with you, and it's not even funny.”</span>\n</p>\n<p> </p>\n<p>\n<span>“I love you too, Kacchan.” Izuku hums, pulling Katsuki’s face up until they were at eye level. “I love you to the moon and beyond. For the first time in my life I feel happy. Truly and deeply happy, and it's all because of you.”</span>\n</p>\n<p> </p>\n<p>\n<span>Katsuki stared into those deep star-like emeralds, an evergreen forest deep with emotions. A past that Katsuki wished to know so much more about, a history he could only ever dream of knowing. He would kiss away all the hurt life had caused him, he would keep this man safe with his very dying breath. </span>\n</p>\n<p> </p>\n<p>\n<span>He had lost Izuku all those years ago, but never again. He was here, before him. Fate had given him a second chance and he was never going to let this man go. </span>\n</p>\n<p> </p>\n<p>\n<span>He was home, and home was the most gorgeous shade of green Katsuki had ever seen.</span>\n</p>\n<p> </p>\n<p>\n<span>\n<img src=\"https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/39877eee-ef02-4b06-83ae-f41eff3e7878/denck1w-b919c501-f48d-4741-a79e-6da0ddebbb18.png/v1/fill/w_1011,h_790,q_70,strp/babiesss_by_rad_pax_denck1w-pre.jpg?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOjdlMGQxODg5ODIyNjQzNzNhNWYwZDQxNWVhMGQyNmUwIiwiaXNzIjoidXJuOmFwcDo3ZTBkMTg4OTgyMjY0MzczYTVmMGQ0MTVlYTBkMjZlMCIsIm9iaiI6W1t7ImhlaWdodCI6Ijw9MTAwMSIsInBhdGgiOiJcL2ZcLzM5ODc3ZWVlLWVmMDItNGIwNi04M2FlLWY0MWVmZjNlNzg3OFwvZGVuY2sxdy1iOTE5YzUwMS1mNDhkLTQ3NDEtYTc5ZS02ZGEwZGRlYmJiMTgucG5nIiwid2lkdGgiOiI8PTEyODAifV1dLCJhdWQiOlsidXJuOnNlcnZpY2U6aW1hZ2Uub3BlcmF0aW9ucyJdfQ.nQPln1sPJy15gEo3eUCkZNQRGokSee8IS8yTRhmS5uI\" alt width=\"716\" height=\"559\">\n</span>\n</p>"
}