{
  "id": "31549007",
  "url": "https://archiveofourown.org/works/31549007?view_full_work=true",
  "author": [
    "sailingthenightsea"
  ],
  "title": "forwarding address",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [],
  "fandoms": [
    "Dream SMP"
  ],
  "relationships": [
    "Wilbur Soot & Technoblade & TommyInnit & Phil Watson"
  ],
  "characters": [
    "TommyInnit (Video Blogging RPF)",
    "Wilbur Soot",
    "Technoblade (Video Blogging RPF)",
    "Phil Watson (Video Blogging RPF)"
  ],
  "additional_tags": [
    "villain!sbi",
    "hero!tommy",
    "Wilbur Soot and Technoblade and TommyInnit are Siblings",
    "Adopted",
    "as usual",
    "TommyInnit Needs a Hug (Video Blogging RPF)",
    "And He Gets One!",
    "Superheroes",
    "Villain SBI",
    "Found Family",
    "Fluff",
    "heavy fluff yall",
    "slight description of injuries",
    "Hurt/Comfort",
    "Hurt TommyInnit (Video Blogging RPF)",
    "Protective Technoblade (Video Blogging RPF)",
    "Protective Wilbur Soot",
    "Protective Phil Watson (Video Blogging RPF)",
    "Alternate Universe - Superheroes/Superpowers"
  ],
  "language": "English",
  "series": "",
  "published": "2021-05-26",
  "completed": "2021-10-08",
  "words": "6,899",
  "chapters": "3/3",
  "comments": "418",
  "kudos": "9,319",
  "bookmarks": "1,441",
  "hits": "99,111",
  "summary": "<p>“Who did this to you?” the Blood God growls, low and dangerous. And anyone in their right mind would be afraid, would be shitting their pants, but Tommy just flicks his eyes to the floor and mumbles that it doesn’t matter.</p>\n<p>Echo hums softly, brushing his fingers gently over the bruises coloring Tommy’s cheek, stopping at the gash over his eyebrow before carding through his hair. Tommy doesn’t mean to lean into the touch, he knows these men are dangerous, are deadly, but he can’t help but feel safe, wrapped up in their brutal care.<br></p>\n<p>It’s pathetic, really, how quickly frustrated tears well up and spill over, how easily Tommy crumbles.</p>\n<p>The place where the villain holds his wrists burns and when he tugs, ever so gently, Tommy falls into him. Something in him aches and shatters and maybe, maybe heals, just slightly.</p>\n<p>“It’s okay, kid,” the Blood God murmurs into his hair as Tommy sobs. “You’re okay.”</p>\n<p>They were never going to be able to keep this up, not really. No matter how much they fought, no matter how secret they kept their identities, someone was always going to find the connection, exploit the weakness in the previously invulnerable armor.</p>\n<p>The Syndicate had a fourth—a too-skinny hero with a loud mouth and a distinct lack of self preservation instincts. No one wants to fuck with the Syndicate, with their expensive suits and high tech gear. Plenty of people are willing to fuck with Tommy though, Tommy in his ratty old red hoodie and ripped up jeans.</p>\n<p>And they try, they really do, but they have dangerous jobs and, well, there’s only so much they can do.</p>",
  "notes": "<p>literally just a “who did this to you?” adoption fic</p>\n<p>full fluff pls enjoy :]</p>\n<p>also pls excuse formatting i’m posting on my phone</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>surprise! you asked for the origin story and i'm delivering :]</p>\n<p>inspired by several old prompts from the-modern-typewriter on tumblr</p>\n<p>warnings: past child abuse, description of injuries</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>up next! tommy gets into some trouble...</p>\n<p>okay so it's only been like four months... that's not <em>that</em> bad right?</p>\n<p>right?</p>\n<p>anyway IT'S HERE!! THE FINAL CHAPTER!!!</p>\n<p>also the first two chapters have received some much needed edits (everyone say thank you misterghostfrog) so if you need a refresher, they should be much cleaner this go around :D</p>\n<p>as promised, here's trouble...</p>\n<p>(warnings: light to mild torture, references to dream, the usual)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>THANK YOU SO MUCH FOR READING</p>\n<p>I DO HOPE THAT LIVED UP TO EXPECTATIONS</p>\n<p>PLEASE REMEMBER TO COLLECT ALL PERSONAL ITEMS FROM YOUR SEAT, LEAVE A COMMENT, AND TELL YOUR FRIENDS</p>\n<p>i'm not joking i want 3k kudos. we can do that right? 500 more? totally feasible there are over 700 of you subscribed to this so if all of you send it to just one friend-</p>\n<p>no but seriously comments and bookmarks are very much appreciated and it's been absolutely lovely having you! :D</p>\n<p>if you enjoyed this fic, go check out my others! and if you want more from me, go ahead and hit the subscribe under my name while ur browsing &lt;3</p>\n<p>also i wanna thank <a href=\"https://archiveofourown.org/users/Misterghostfrog/pseuds/Misterghostfrog\" rel=\"nofollow\">misterghostfrog</a> for the editing help! go check out his fics, they're absolutely incredible and deserve the world!!</p>\n<p>i’ll come back and link it later i’m posting this when i should be getting food but follow me on twitter for more content @<a href=\"https://twitter.com/heartonstandby\" rel=\"nofollow\">heartonstandby</a></p>\n<p>comment to feed me since i’m missing breakfast for this. leave kudos to feed the birds &lt;3</p>\n<p>user sub for more family fluff! it's free and you can always-</p>\n<p> </p>\n<p>NEW! join <a href=\"https://discord.gg/nyZjtkJBGM\" rel=\"nofollow\">my discord</a> for extra secret content and faster update alerts!</p>",
  "text": "<p>They find him sometime between too late and too early in the same alley the last guy left him in. He’s taking a breather, thank you very much, slumped against a brick wall. He’s fine. Everything hurts, and he’s not really sure how long he’s been sitting there, but he’s not a child, he’s a hero, he’s <em> fine</em>.</p>\n<p>But when three of the most notorious villains in the city (state?<em> country</em>?), the three leaders of the widely feared Syndicate, kneel down around him, expressions softened with worry and sharpened with a rage Tommy knows is not directed at him, he can’t help but feel like a little kid. He can’t help but <em> want </em> to be held and protected and cared for.</p>\n<p>So when the man in the boar skull mask reaches out a hand, movements slow like he’s approaching a wounded animal, Tommy allows the coddling.</p>\n<p>He knows he’s a mess, but if he didn’t, he’d be able to tell by the way a spark lights a wildfire fury in the garnet red eyes tracking over his face as he tilts it up with gentle fingers under his chin.</p>\n<p>“Who did this to you?” the Blood God growls, low and dangerous. And anyone in their right mind would be afraid, would be shitting their pants, but Tommy just flicks his eyes to the floor and mumbles that it doesn’t matter.</p>\n<p>Echo hums softly, brushing his fingers gently over the bruises coloring Tommy’s cheek, stopping at the gash over his eyebrow before carding through his hair. Tommy doesn’t mean to lean into the touch, he knows these men are dangerous, are deadly, but he can’t help but feel safe, wrapped up in their brutal care.</p>\n<p>His chin is still held lightly by the Blade and Echo seems to find as much comfort in the rhythmic movement of his fingers through Tommy’s hair as Tommy does.</p>\n<p>“It matters,” the Angel says, soft and lilting, the beak of his mask angling down slightly as he tilts his head, tinted lenses reflecting Tommys face back at him, “It matters because no one gets to touch what’s ours.”</p>\n<p>“No one gets to touch <em> you</em>, Toms,” Echo vows and god knows Tommy should be afraid, but he isn’t, he <em> isn’t</em>, so he tells them the name and he knows it’s a death sentence.</p>\n<p>And he knows he should care more—he knows it should bother him <em> so much more</em>—because Tommy is a hero, Tommy is supposed to <em> save </em> people from the bad guys. He’s not supposed to get people killed, not even the bad ones. He’s certainly not supposed to lean into the bad guys’ touch or curl into their arms because he’s exhausted or send them on hunts after someone who hit him a little too hard.</p>\n<p>“Your ribs are broken, Tommy,” the Blade says softly, the sound of it rumbling against the ear Tommy has pressed to his chest, and <em> god </em> why are the villains always so careful with him? Why are they the first people in so, <em> so </em> long whose touch doesn’t <em> hurt</em>? “And while I don’t think you have a concussion, it looks like you hit your head <em> hard</em>, kid. That’s not ‘a little’.”</p>\n<p>“Not to mention how thin you are,” the Angel adds, only half directed at him now and dripping with genuine concern. “When’s the last proper meal you had?”</p>\n<p>At Tommy’s shrug, Echo’s hand pauses, only resuming in response to Tommy’s displeased whine. “Toms, darling,” he starts and Tommy sighs because nothing good happens when he starts with the pet names, “are your parents not feeding you?”</p>\n<p>Echo’s hand very deliberately does not falter as Tommy replies, but Tommy can <em> feel </em> the tension in the Blood God and the three exchange looks over his head that are almost loud enough he can hear them.</p>\n<p>“Don’t have parents <em> to </em> feed me, big man. I’m not a child, I don’t need anyone to take care of me.” He grumbles, but for the first time in a long time, Tommy doesn’t even try to cover the obvious lie. He thinks maybe he doesn’t have to, not here, not with these people he thinks of first when he thinks of ‘family’.</p>\n<p>The Angel makes a soft wounded sound and the Blood God rearranges him so he’s cradling him close to his chest when he stands. And Tommy, Tommy should fight, should be afraid of these men who have so much blood on their hands, but he can’t bring himself to care. Instead he presses closer to the Blade’s steady warmth, counting his heartbeat out, pretending this isn’t such a monumental betrayal made without hesitation.</p>\n<p>Instead, when Echo says, “Sleep, Toms, we’re going home,” Tommy trusts him, Tommy listens, drifting off in the safety of the Blood God’s arms.</p>\n<p> </p>\n<p align=\"center\">– ✧ –</p>\n<p> </p>\n<p>When he wakes up, there’s late afternoon light streaming in through unfamiliar blinds in an unfamiliar room. He should be afraid, but the pillow underneath his head rises and falls with soft, even breathing. He should be afraid, but there are familiar arms wrapped around him and he couldn’t feel safer if he tried.</p>\n<p>“Welcome to the world, kid,” the Blood God says from the doorway. Only when Tommy looks up, he freezes because he’s <em> not wearing his mask</em>.</p>\n<p>“Blade,” he starts, panicked, half tempted to cover his eyes like the man forgot he had a face that was linked to a secret identity and a hero in his spare bedroom (except there’s framed newspaper clippings of Tommy’s accomplishments hanging on the walls and the quilt is bright red and it looks like somebody’s room—no, it looks like <em> his </em> room and he’s not awake enough to process that yet, so he shelves it for now).</p>\n<p>But he’s interrupted by an amused, “Techno.”</p>\n<p>Tommy blinks. And then blinks again.</p>\n<p>“What?”</p>\n<p>“My name,” the Blade—<em>Techno</em>, apparently, says.</p>\n<p>This, of course, in no way stops Tommy’s panic. “Wh- You- What, no, man, you can’t just- just <em> tell me your name</em>!!”</p>\n<p>He gets a huff in response to his incredibly sound logic which just makes him even <em> more </em> concerned that it was Blade- Techno who had the head injury instead of him.</p>\n<p>“Why not? You’re in our house, you’ve got a room, you might as well know my name.”</p>\n<p>And, well, ha, okay, okay. So. Tommy has a room. In their house. Tommy knows the Blood God’s name, has seen- <em> is currently seein</em><em>g</em> the Blood God’s stupid <em> face</em>. He needs a minute. Just one minute to process without-</p>\n<p>“Wilbur,” says the sleepy voice behind him. “There. Now you know both our names.”</p>\n<p>Tommy whips his head around to stare incredulously at Echo- Wilbur now. “What the fuck?!”</p>\n<p>Echo’s mask, a pretty porcelain thing like something out of an opera or a masquerade, is gone too, leaving just- Wilbur. Soft, sleep rumpled Wilbur. The dark, glittering makeup that’s usually beneath his eyes is wiped clean as well and the only proof it was ever there rests in what clings told his lash line.</p>\n<p>Fucking hell. They’re both in pajamas. Two of the most feared villains in the- fuck, probably the whole goddamn world and they’re in <em> fucking pajamas</em>.</p>\n<p>Techno’s not even in <em> respectable </em> pajamas. His are sky blue fuzzy sleep pants decorated with cute little pig faces. Wilbur’s in normal sweatpants at least but his t-shirt is some obscure band no one has ever heard of. God, they’re fucking dorks. They’re the scariest fuckers Tommy’s ever seen, but they’re fucking dorks. And <em> massive </em> softies.</p>\n<p>“If you’re done freaking out,” Techno drawls, amusement clear in the dry tone, “Phil made pancakes. It’s like four in the afternoon, but he’s excited, so,” he gestures vaguely behind him, “food.”</p>\n<p>Tommy decides to freak out over the Angel of Death being named <em> Phil </em> later in favor of climbing off of Wilbur for pancakes.</p>\n<p>“Hi, mate,” the Angel of fucking Death greets, standing in the kitchen with an apron tied around his waist and flour on his hands. “Chocolate chip or blueberry?”</p>\n<p>“Okay what the <em> fuck</em>,” he asks laughing. “Did I die? Is this hell?”</p>\n<p>Wilbur scoffs loudly from behind him, ruffling his hair as he passes. “That’s so rude. I know Phil isn’t <em> that </em> great of a cook, but he’s not that bad.”</p>\n<p>“Good news, Tommy, Tech, you get more pancakes. Wilbur, you can starve.”</p>\n<p>And so breakfast goes on with only minor chaos. It’s the middle of the day, it’s a kitchen table of villains and a hero amongst them. Tommy allows it to happen, allows himself to get swept up in it all and pretends it won’t end soon.</p>\n<p>Only it doesn’t end. It doesn’t and doesn’t and doesn’t and then it’s three weeks later and Tommy’s helping Phil with dinner and can’t stop the question from spilling over his lips like a glass shattering in peaceful silence.</p>\n<p>“What’s going on?”</p>\n<p>Phil stops, briefly, to look over at him, confusion mixing with concern. “We’re making mac and cheese?” he answers but it lifts like a question because there’s a weight in the air now that Tommy put there and Phil doesn’t seem to know where it’s coming from.</p>\n<p>“No, I mean with everything—the room, the rides to school, the,” he cuts himself off, gesturing broadly at the rest of the house. “What’s- what’s going on, Phil, I don’t fuckin-.”</p>\n<p>Understanding blooms and then Phil softens impossibly, turning his whole body to face Tommy. “I’m sorry, I should’ve- Tommy, I want to adopt you.”</p>\n<p>And Tommy, fuck, Tommy didn’t expect that. He doesn’t- He-</p>\n<p>He sits down. On the floor. Phil laughs lightly and kneels in front of him, hands brushing away tears that Tommy didn’t know he was crying.</p>\n<p>“You alright, mate?”</p>\n<p>Tommy looks up at him. “You want- <em> me</em>,” he asks, eyes too wide, voice too small. “You- Me? A hero? A loud, annoying-“</p>\n<p>But Phil just tugs him into a hug, and presses a kiss against his hair. “Oh, Toms, of course we want you. <em> Of course </em> we do.”</p>\n<p>And they prove it, over and over again. They drive him to school every morning and pick him up every afternoon. Phil packs his lunch and leaves stupid little notes in it that Tommy pretends to find annoying. Wilbur plays his songs at Tommy’s request and never lets him go more than a few hours without a hug whether he likes it or not. And yeah, maybe he does. But he’s not gonna fucking say it, he’s got his pride after all.</p>\n<p>They don’t stop him being a hero, they don’t try to corrupt him or force him to their side. And Tommy doesn’t snoop through their drawers to find their blueprints and plans, only showing up when he hears the police radio mention the newest bank robbery.</p>\n<p>Tommy tries to stop them and they try to stop him stopping them both because that’s their jobs and they don’t need people realizing the connection. But when it does happen (and it does), the Syndicate saves their little golden hero with a viciousness anyone in their right mind would tremble at. Tommy, though, Tommy just steps over one of the bodies with a slight grimace as he’s led out of the newest warehouse to be bundled in a getaway car and taken home.</p>\n<p><em> Home</em>, Tommy thinks, smiling into his brother’s chest. <em> I’m finally home. </em></p>\n<p> </p>\n<p>Emergency lights paint the room a deadly sort of scarlet. Alarms blare loudly, signaling <em> get out</em>, signaling <em> run for your fucking lives</em>, but Tommy’s here, crouched behind a shelf, praying to every single god he can think of that he makes it home tonight.</p>\n<p>He could run, he <em> could</em>, but he doesn’t.</p>\n<p>Tommy’s a hero, he saves people. This is his job, he can’t be a coward, he can’t run just because it’s scary, just because he’s <em> alone</em>.</p>\n<p>Door hinges squeak somewhere in the dark and red, and Tommy’s limbs turn to stone, freezing him in place, like a deer in headlights.</p>\n<p><em> Oh shit</em>, he thinks, clear as a bell. <em> Oh shit, oh shit, oh shit. </em></p>\n<p>Someone’s in the room. Someone’s in the <em> fucking room oh god</em>-</p>\n<p>The footsteps are light, coming closer, coming right towards him. He takes a deep breath, silent but shaking like it’s gonna come apart.</p>\n<p>“You don’t have to fight me,” someone says and Tommy’s heart sinks to his goddamn toes.</p>\n<p>The Blood God, if you haven’t turned on the news in the past six years, is part of a trio of supervillains called the Syndicate. They are the most notorious criminals in the city- in the country really. Maybe in the world. The Blood God, in particular, is known for being ruthless and cruel. The Blade, some call him. He’s more weapon than man, people say.</p>\n<p>He’s also in the same room as Tommy, just meters away from where he’s hiding. Tommy, a <em> hero</em>, meant to stop him, <em> here </em> to stop him.</p>\n<p>“You could just run,” he offers, and Tommy wants to, god does he want to, but he is a <em> hero </em> and this is his <em> job</em>.</p>\n<p>“No,” Tommy says, all bravado and stupid, foolish bravery, “I can’t.”</p>\n<p>The footsteps go silent and Tommy invents a series of new, fun swears. Shame no one will ever learn them since he’s going to die here.</p>\n<p>“Why?”</p>\n<p>Tommy laughs, high and scared. He steps out of his hiding place, turning to face the villain. “Because I’m a hero.”</p>\n<p>“You’re a kid,” the Blade says, looking him up and down through the boar skull mask adorning his face.</p>\n<p>He’s bigger in real life, taller, but slim, not broad. His pink hair is tied in a long braid, save a few pieces that have come loose to frame his face. He’s wearing an expensive looking black suit with a crimson vest over a black shirt and tie. When he moves, Tommy notes, a little hysterically, that even the inside of his suit jacket matches the vest. Gold drips from every place possible, multiple hoops and chains adorn his ears and there are layers of thin ropes hanging from his neck, bangles from his wrists, and rings on his fingers. There’s a crown sitting lopsided on his head. He’s <em> gilded</em>, Tommy thinks, giddy on terror.</p>\n<p>“Seriously, how old are you? Ten?”</p>\n<p>Tommy glares, “I’m <em> fourteen</em>.”</p>\n<p>His answer sends the villain a step back, brings his hands up in a placating gesture. But Tommy doesn’t care. Tommy is a hero.</p>\n<p>He lunges. The Blood God catches his wrists.</p>\n<p>It’s pathetic, really, how quickly frustrated tears well up and spill over, how easily Tommy crumbles.</p>\n<p>The place where the villain holds his wrists <em> burns </em> and when he tugs, ever so gently, Tommy falls into him. Something in him aches and shatters and maybe, <em> maybe </em> heals, just slightly.</p>\n<p>“It’s okay, kid,” the Blood God murmurs into his hair as Tommy <em> sobs</em>. “You’re okay.”</p>\n<p> </p>\n<p align=\"center\">– ✧ –</p>\n<p> </p>\n<p>The bruises coloring Tommy’s ribs hurt with every breath he takes, but Dream says it’s good for him, the pain is <em> good</em>, it’ll help him learn how to push through. That’s why he never holds back when he spars with Tommy, he says, because the bad guys won’t. The bad guys <em> will </em> kill Tommy, but the Blood God had held him carefully, like Tommy was deserving of it. The Blood God had held him, let him cry and cry and cry, and then let him run.</p>\n<p>Dream taught Tommy how to be a hero, Dream trains him, Dream cares about him.</p>\n<p>But. <em> But</em>. But the Blade had held him. The Blade had-</p>\n<p>No, <em> no</em>. It was a trick, a trap, <em> something</em>. A game he was playing with Tommy to get him to lower his guard, to get information on- on the heroes. It was a trick, it had to be.</p>\n<p>It had to be because the man is in the middle of the chaos Tommy’s been sent to stop. He’s laughing, he’s got blood splattered on his mask.</p>\n<p>Only he’s not the only one there, in the eye of the storm. All three members of the Syndicate are involved, and Tommy, Tommy’s been sent to stop them. But his ribs hurt. His ribs hurt and his ankle is swollen and he doesn’t <em> want </em> to do this. He’s compromised. He’s outnumbered.</p>\n<p>He’s fucked, to put it lightly.</p>\n<p>But this is his job. This is what he was made for, so Tommy throws himself into the fight and the villains, they meet him halfway.</p>\n<p>Echo starts with overly exaggerated moves, all flourish, all for the show, but Tommy was taught to fight hard, to fight dirty, and the man quickly has to adjust to keep up with him.</p>\n<p>“<em>This </em> is your kid?” Echo calls over his shoulder, laughter and incredulity rich in his voice.</p>\n<p>Tommy growls, smoke curling up from his palms, twining lazily around his forearms, flames licking in their wake.</p>\n<p>The Blood God is somewhere behind him, fighting off police officers or- the fight turns and Tommy can see him. He’s fighting a- another bad guy. The man goes down and then someone aims a gun at <em> Tommy</em>, but he’s down too before Tommy can even move to hide.</p>\n<p>What the fuck.</p>\n<p>“I told you he was a hero,” the Blade shoots back, petty and lighthearted and everything Tommy has never experienced.</p>\n<p>Echo scoffs, “You also said he was <em> ten</em>.”</p>\n<p>What the <em> fuck</em>.</p>\n<p>Tommy sends a particularly vicious burst of flames his way. “I’m <em> fourteen</em>,” he spits, but then he moves wrong and his ribs protest sharply. He hisses and in a flash of movement Tommy can’t follow (and he bristles slightly at the thought of them holding back, going easy on him just because he’s <em> young</em>), Echo has his wrists held tight but gentle, not hard enough to bruise, not that it matters because the bruises are already there and Tommy winces at the painful reminder of Dream’s grip. Echo drops him like the touch burned (it did, for Tommy at least, it was kinder than Dream is, it was, it was-) the second he sees Tommy’s reaction.</p>\n<p>“You’re hurt,” he says, standing still in what Tommy now realizes is an empty room save the four, save the hero surrounded by villains.</p>\n<p>Tommy glares, he bites back a growl, flicking his eyes over three obscured faces. He can see Echo’s eyes at least, under the dark makeup surrounding them. They look concerned. They look <em> angry</em>.</p>\n<p>It feels like he’s backed into a corner, it feels like he’s some wild feral thing, just waiting to strike.</p>\n<p>“Training,” he spits because surely they’ll understand that. Surely they’ll understand that he’s not a <em> child</em>, he’s not something to be coddled. He’s a wildfire, he’s gasoline. He’s as strong as they are, as capable. He can take it.</p>\n<p>Only the anger in Echo’s eyes deepens as confusion slips away and understanding dawns. “<em>Training</em>?” he starts, poison lacing his sharp tone, but he’s interrupted by a hand on his shoulder as the Blood God passes him to kneel in front of Tommy.</p>\n<p>“Who’s your mentor?” he asks, his voice steady and dangerously calm, but Tommy shakes his head. He can’t give them this, he <em> won’t</em>. Not after everything Dream has done for him, not when he owes Dream his life so many times over.</p>\n<p>The Blade reaches out, and Tommy <em> bolts</em>.</p>\n<p>The bruises when he returns empty handed are a lesson he promises to heed.</p>\n<p> </p>\n<p align=\"center\">– ✧ –</p>\n<p> </p>\n<p>The encounters don’t stop. Dream says it’s a good thing, and starts sending him out on more missions to stop them. Dream says they can use him, let him get close to the trio, and then report back whatever he learns to help them take the Syndicate down.</p>\n<p>Dream says that Tommy just has to be strong, just has to be smart enough to trick the villains into trusting him.</p>\n<p>When Tommy swears that he can do this, he’s lying through his teeth, but Dream doesn’t seem to notice.</p>\n<p> </p>\n<p align=\"center\">– ✧ –</p>\n<p> </p>\n<p>“What are you doing here?” Echo asks and Tommy answers through gritted teeth,</p>\n<p>“I didn’t know where else to go.”</p>\n<p>His hands are shaking, pressed against the bullet wound in his side. Blood weeps through his fingers like a grieving lover, like there is a loss to be mourned, but it’s only Tommy. It’s only Tommy who was slow enough, stupid enough to get himself shot on a routine patrol by a kid more scared than he was.</p>\n<p>“Shit, you’re bleeding. How did you even get here?! This is a <em> secret base</em>-”</p>\n<p>God, he wishes the world would stop spinning so fast for just a <em> minute</em>, so he could think straight. As it is, he can’t seem to organize his words enough to get them out of his mouth. He manages to open it, but then the world tips sharply and somebody turns off all the lights.</p>\n<p>When he opens his eyes, Echo’s looking down at him, soft concern painted over his features. His suit jacket is pressed against Tommy’s middle.</p>\n<p>“Hey there,” he murmurs. “He’s awake.”</p>\n<p>Tommy’s fifteen and he finds himself in the midst of the most notorious villains in the world because they’re safer than going back to his mentor. Tommy’s fifteen and a hero and he’s hurt and scared and this is where he ran.</p>\n<p> </p>\n<p align=\"center\">– ✧ –</p>\n<p> </p>\n<p>Tommy’s going to be sick. He knew, he <em> knew </em> Dream had plans, knew that he would want more eventually, that the excuses wouldn’t work forever.</p>\n<p>“You’re going to call them,” Dream says again, “and ask for help.”</p>\n<p>“What if they don’t come?” Tommy tries.</p>\n<p>Dream smiles, cold and cruel. “You’ll make them. I’m sure you can come up with something to convince them. If you don’t,” he trails off, threat clear.</p>\n<p>And Tommy, he considers it, considers how bad it would be. It wouldn’t be the first punishment he’s taken for the Syndicate, but he- he’s <em> scared</em>.</p>\n<p>“Are you going to kill them?”</p>\n<p>Dream sighs. “They’re <em> villains</em>, Tommy.”</p>\n<p>“But,” he tries.</p>\n<p>“<em>Tommy</em>.” And Tommy’s mouth clicks shut. “Make the call.”</p>\n<p> </p>\n<p align=\"center\">– ✧ –</p>\n<p> </p>\n<p>“You weren’t supposed to come,” he chokes out, pathetic and childish and <em> terrified</em>. He shoves fruitlessly at the man’s chest. “You weren’t- <em> please</em>, you have to go.”</p>\n<p>The Angel goes to his knees in front of him, catching his wrists where he’s still fighting. “Tommy, Tommy, it’s okay, it’s alright. I know, I know.”</p>\n<p>“You have to go,” he pleads, begs, tears slipping down his cheeks. The Angel wipes them away, and fuck, Tommy’s not even wearing his <em> mask</em>, but then neither is the villain, blue eyes far more gentle than he deserves. “I’m sorry,” he says again and again, “I’m <em> sorry</em>.”</p>\n<p>He’s pulled into a hug and he breaks, shattering in the Angel’s careful hold. Tears stain green silk.</p>\n<p>“Breathe,” he soothes. “You did so well. It’s gonna be okay, Toms.” The Angel presses a kiss to his hair, murmuring, “I’m so proud of you.”</p>\n<p>When Dream comes, the Angel moves to keep Tommy behind him.</p>\n<p> </p>\n<p align=\"center\">– ✧ –</p>\n<p> </p>\n<p>It’s over a year later when Tommy finds himself sitting with his legs dangling over the edge of a fire escape as he watches the sun set.</p>\n<p>“Penny for your thoughts?”</p>\n<p>Wilbur plops down next to him, bumping their shoulders together. Tommy grins back at his brother.</p>\n<p>“Fuck you, no, my thoughts are worth <em> way </em> more than just a penny.”</p>\n<p>He laughs loud and bright, head thrown back, and Tommy feels pride burn like the sun in his chest. It’s golden and warm and Tommy could live in the moment forever.</p>\n<p>“You’re so right, Toms. I’ll be sure to rob a bank tomorrow, so next time I can afford to hear your wisdom.”</p>\n<p>Tommy splutters. “What- no, Wil, <em> no</em>. I have a maths test tomorrow, I can’t deal with a bank robbery!”</p>\n<p> </p>\n<p>In the end, Tommy thinks, it was inevitable.</p>\n<p>They were never going to be able to keep this up, not really. No matter how much they fought, no matter how secret they kept their identities, someone was always going to find the connection, exploit the weakness in the previously invulnerable armor.</p>\n<p>The Syndicate had a fourth—a too-skinny hero with a loud mouth and a distinct lack of self preservation instincts. No one wants to fuck with the Syndicate, with their expensive suits and high tech gear. Plenty of people are willing to fuck with Tommy though, Tommy in his ratty old red hoodie and ripped up jeans.</p>\n<p>(His trainers are new though and now he’s got a lightweight bulletproof vest on under the hoodie, courtesy of his very panicked family when they realized he was running around in nothing more than a cotton-polyester blend.)</p>\n<p>And they try, they really do, but they have dangerous jobs and, well, there’s only so much they can do.</p>\n<p> </p>\n<p align=\"center\">– ✧ –</p>\n<p> </p>\n<p>He should have known, really, that his night was gonna be shitty when the rain started. Ominous grey clouds have been hanging threateningly overhead all day, but it doesn’t break until about halfway through Tommy’s normal patrol. It goes from a light sprinkle to a straight fucking downpour in minutes and Tommy is soaked through before he can even think about ditching for the night and hopping on the first bus home.</p>\n<p>And then he should have known better than to follow the sound of crime into a dark alley especially considering that his powers don’t work in the rain, but he does anyway.</p>\n<p>“Hey, boys,” Tommy says brightly, causing the men to whip around to face him. “Lovely night for loitering in dark alleys, innit?”</p>\n<p>The men exchange looks, something predatory and pleased passing between them that makes Tommy’s stomach twist. “This him?” one of them asks, and the other two nod.</p>\n<p>A nervous laugh escapes him as he steps back. “Did you guys want an autograph? I left my pen at home, but-”</p>\n<p>A chill runs up his spine and he stops dead, dread pooling heavy and cold in his gut. Someone laughs, dark and cruel, behind him.</p>\n<p>\n<em> Fuck. </em>\n</p>\n<p>Tommy tries to light a spark, flames flickering out in the downpour. He’s fucked. He’s <em> so </em> fucked.</p>\n<p>He glances over his shoulder to find two more grunts blocking him in. Behind them, there’s a sixth guy in a suit, watching with something dark glinting in his eyes.</p>\n<p>“Five against one? Really?” Tommy laughs again, high and scared. “Hardly seems fair, men.”</p>\n<p>“Do you ever stop talking?” the one in the middle asks, grinning in a way that makes Tommy want to <em> run run run</em>.</p>\n<p>There’s no way out of this. He can’t even fight them.</p>\n<p>He grins, all false bravado. “Not really, no.”</p>\n<p>Someone grabs him and he slams an elbow back into their gut, knocking the breath out of the man and making him let go. His fire flares up when the second comes at him, but the flames hardly even touch the guy before the rain suffocates them.</p>\n<p>Hands close around his shoulders and he wrenches free, only to stumble forward into another one’s grasp. He jerks back again, but there are hands there too. Tommy screams, thrashing wildly, but then a cloth covers his mouth, smelling sharp like chemicals and he’s gasping before he can remember to hold his breath.</p>\n<p>The world swims.</p>\n<p>Tommy blinks, but when he tries to open his eyes again they’re heavy and his mouth is dry, his throat clicking when he swallows. He pries them open to find darkness again and it takes too many seconds for him to realize there’s a bag over his head. There are voices somewhere nearby, but not close enough to make out what’s being said.</p>\n<p>It doesn’t help that his head is swimming and he can’t understand how he ended up in an uncomfortable metal chair when he was in an alley just moments ago. He tries to move his hands, to reach up and pull the bag off his head, but there’s something holding them to the arms of the chair.</p>\n<p>The voices get closer and his pulse spikes when he hears the same laughter as before. A door opens to his left and he shakes his head, trying to bring himself out of the fog. He’s not safe here. He’s not safe. No one knows where he is and he’s tied down and they fucking <em> drugged him</em>.</p>\n<p>“He’s awake,” someone says and Tommy growls behind the fabric before it’s ripped off his head. He glares at the men, trying not to squint at the dim light or blink too rapidly as he clears his vision. Weakness is a death sentence here, so Tommy does everything he can to cling to the illusion of strength.</p>\n<p>The men are all grinning, sly cruel things that make anxiety prick under Tommy’s skin. His head has cleared and the pieces are falling into place in a way he really, <em> really </em> doesn’t like.</p>\n<p>There are metal cuffs holding his arms to the chair, and the realization hits him like a train that they prepared this, they went after him specifically and made sure they could hold him. The floor under the chair is concrete and the walls are cinder block—probably an abandoned warehouse then, stereotypical, but effective. One of the grunts is holding a bright red fire extinguisher and Tommy glares harder.</p>\n<p>“What do you fuckers want?” he spits, furious and hiding behind it.</p>\n<p>The man laughs again, and Tommy focuses his glare on him. Based on the cocky sureness of his stance and the ridiculous suit, he’s the one in charge. “Fiesty one, huh?” he asks, looking at his stupid friends who all snicker. “We’ll get to that, don’t worry. First, though, I thought we could get to know each other better.” He snaps his fingers like a bitch and another chair appears, and then Bitch Man is sitting with his legs crossed, staring down his nose at Tommy. Another grunt moves forward when he snaps again, but this guy is coming at Tommy and ignoring the warning sparking across the backs of his hands.</p>\n<p>“Don’t you fucking-” Tommy starts, but he’s ignored and then his mask is being pulled off, exposing his face, his identity to these people and he <em> clings </em> to his bravado, but terror is striking ice cold through him. “That’s so rude,” he says, praying that his voice doesn’t shake. “Boundaries and shit, man. Not even villains take off people’s fuckin masks.”</p>\n<p>The man just laughs, leaning back in his stupid chair, and grinning wide. “You’ve seen my face, kid, it only seems fair.” He leans forward again, cocking his head with sharp teeth. “Now that we’ve gotten more <em> personal</em>,” he says, “I’d like for you to tell us about the Syndicate.”</p>\n<p>Tommy goes cold. For the first time in a very long time, Tommy is breathlessly grateful that Dream trained him because he doesn’t react outwardly and he knows it. How many times had he stared down venomous green eyes and <em> lied </em> for these people?</p>\n<p>But what scares him, what <em> really </em> scares him is how these people know there’s a connection.</p>\n<p>He blinks, letting confusion bleed into his expression. “The what?”</p>\n<p>Bitch Man shakes his head, a little disappointed, and reaches into his jacket before setting a gun on his knee. “The Syndicate,” he repeats and Tommy swallows.</p>\n<p>“Right, the Syndicate. The, uh- well, it’s a villain group, innit? Not exactly very open to sharing. I’ve fought them a few times, but, really, it was less of a fight, more they batted me to the side ‘cause I wasn’t much of a threat. You’d probably do better reading the wikipedia page.”</p>\n<p>Bitch Man nods at a grunt who hands him a tablet. He taps at the screen for a moment before turning it around to face Tommy, who pales.</p>\n<p>It’s a video, CCTV probably given the mediocre quality and lack of sound, but it doesn’t need it to get the point across perfectly. On the screen is Tommy, pinned to a wall by a low tier criminal who had his hand around Tommy’s throat. The grip was unrelenting, no matter how hard Tommy fought to get free. He remembers that moment, remembers being panicked and desperate, trying to yell for help, but unable to take in a breath. And he remembers what happened next: Technoblade, in his full costume, tearing the guy off of Tommy and slamming his face into the opposite wall once, twice, three times before his skull gave and then a fourth that left brain matter on the bricks. He watches himself on the ground gasping for air and he watches as his brother <em> kneels </em> for him, in front of him, checking him over so, <em> so </em> gently, tenderly.</p>\n<p>Seeing it again makes his chest ache.</p>\n<p>The video stops. Tommy glares at the man, who just grins, pleased with the unfiltered reaction he finally got out of him. The confirmation of what he already knew.</p>\n<p>“That didn’t look much like batting you away, now, did it?” He passes the tablet off and leans in close enough that Tommy can smell the cigarettes on his breath. “So I’m gonna ask again: what do you know about the Syndicate?”</p>\n<p>Tommy spits in his face and when the back of a hand cracks across his own, he doesn’t even regret it. There’s blood in his mouth now, but no loose teeth, so he bares them, stained faintly crimson, and says, “Is that all you got, bitch?”</p>\n<p>“I’m a civil man,” he says, his voice carefully controlled rage. “But I always get what I want, kid. And <em> what I want </em> is information on your little <em> family</em>. You’re gonna tell me everything you know in the end, but it’s up to you how painful that’s gonna be, understand?”</p>\n<p>“I’m not telling you shit,” Tommy says and he laughs. “You think <em> you </em> scare me? I was trained by <em> Dream</em>.”</p>\n<p>Bitch Man leans in again, closer this time. “Whatever you <em> think </em> you know about pain,” he hisses, “is <em> nothing </em> compared to what I’m capable of.”</p>\n<p><em> Sure</em>, Tommy thinks, grinning with all the stupid cocky sureness of his hero persona. <em> You can try. </em></p>\n<p>And then Bitch Man is standing and pain cracks like lightning and the world tilts dangerously. The sound of the metal chair landing on the cement floor rings out through the empty room and drilling into Tommy’s pounding skull. Something wet trickles down his temple and he blinks away the spots in his vision to see Bitch Man standing over him and his fallen chair with the gun gripped in his hand from where he’d fucking pistol whipped Tommy. He’s dizzy like he has a concussion and he’s not sure what caused it—getting hit with the gun or falling wrong when the chair tipped.</p>\n<p>He glares, spits again, this time at Bitch Man’s shoes, and says, “Fuck you.”</p>\n<p>That’s when the first kick lands to his ribs and Tommy recognizes the steel toe a little more intimately than he would like. Who the <em> fuck </em> makes steel toe dress shoes? What the <em> fuck</em>.</p>\n<p>The blows land again and again as the man asks question after question that Tommy refuses to even fucking acknowledge. He won’t throw his family to the wolves, not with everything he owes them and not with the knowledge none of them would ever cash that in. He loves them and he trusts them and he <em> knows </em> that they would want him to do whatever it took to save himself, that they would do <em> whatever it took </em> to protect him.</p>\n<p>He could give these men everything, but he won’t. He won’t say a goddamn word because they wouldn’t if the roles were reversed and Tommy gives what he’s given. He is <em> loyal </em> and he <em> loves them</em>, so he laughs and feels the moment something in his chest <em> cracks </em> and he keeps his mouth shut.</p>\n<p>“What are their names?” the man asks, gripping Tommy’s hair in a fist and forcing him to meet his eyes. Tommy wheezes, grinning, blood covering the lower half of his face from where his nose had been broken and he’d bitten his tongue.</p>\n<p>“Bitch,” he says, tasting iron and reveling in the frustration in his eyes.</p>\n<p>And then the world explodes in a cacophony of sound, screams and gunfire ricocheting off the walls. Bitch Man drops Tommy’s head and he groans when it hits the unforgiving ground again, but he isn’t scared anymore, he isn’t because there’s yelling and it’s familiar in the way that means safety. He breathes, in and out, as deep as he can without too much protest from his ribs. He breathes and he waits for his family to finish cleaning up and take him home.</p>\n<p>Wilbur reaches him first, gentle fingers carding through his hair and a soft hurt noise escaping him as he looks over Tommy’s face. “Oh, sunshine, what did they do to you,” he murmurs and Tommy squeezes his eyes shut, tears slipping down his face for the first time that night.</p>\n<p>“Wil,” he pleads, and cool hands are on his cheeks, thumbs wiping away his tears. “<em>Wil</em>.”</p>\n<p>“You’re okay,” Wilbur soothes. “It’s alright, you’re okay, Toms. I’m so sorry we took so long.”</p>\n<p>“I didn’t, I didn’t tell them anything. I didn’t tell him <em> anything</em>.”</p>\n<p>And then Techno is there, snapping off the cuffs and carefully pulling Tommy up into his arms, holding him as tightly as he dared, before pulling back to check him over. Fury lights a fire in his eyes as he takes in the bruises on Tommy’s face and the blood drying all the way down his chin to the collar of his shirt, the plain white one they’d left him in after stripping off his gear somewhere between the alley and the warehouse. Techno growls and Wilbur hisses when he lifts the edge of it to find the red and purple mess already coloring his side.</p>\n<p>“You should’ve given them whatever they asked for, Tommy. Nothing was worth <em> this</em>.” There’s something a little desperate in Wilbur’s voice, and Tommy recognizes it from the other times they’ve had this conversation: <em> it’s not your job to protect us, so let us protect you</em>.</p>\n<p>But love goes both ways, and Tommy’s not <em> Dream</em>, he’s not going to <em> take </em> and never <em> give</em>.</p>\n<p>Except he doesn’t know how to say that in a way that won’t put that cold anger on their faces that means they’ve stopped listening to him with any real consideration and have switched into Wishing They Could Kill Dream Again mode. So he just shakes his head and says, “You would do it for me.”</p>\n<p>Wilbur laughs, wetly, exasperated, and presses a kiss to Tommy’s forehead. “That’s really sweet, but we definitely need to work on that.”</p>\n<p>“Can we work on never letting him get kidnapped again?” Techno grumbles.</p>\n<p>“We can start,” Phil says, something dark and furious in his voice, “by sending a message.” He tilts his head, watching with a dangerous sort of curiosity as Bitch Man starts to beg.</p>\n<p>He’s on his knees, shaking and powerless and so unlike the big bad who had everything under his control just moments before. Tommy doesn’t grin because he’s a <em> hero </em> and his family doesn’t need to be encouraged, but there’s satisfaction settling comfortably in his chest as he watches the man crumble.</p>\n<p>“You need me,” he says, words tripping over themselves to be heard. “You need me. To send a message, you need me alive. I’ll tell them, tell them that you claimed the little hero. That he’s not to be touched. I’ll, I’ll-”</p>\n<p>Philza lowers himself down to meet the man’s eyes. He’s grinning something dark and predatory. The man pales. “You’ll <em> what</em>?” he asks, mockery dripping heavy from his voice. “You’ll be <em> good</em>? You’ll roll over like a dog and <em> obey</em>?”</p>\n<p>The man nods, frantic, and, after a moment of consideration, Philza reaches into the man’s coat for his gun. As he stands, he checks the safety and that it’s loaded with practiced ease.</p>\n<p>“You were right,” he says and it’s almost, <em> almost </em> genuine. “I do need you to deliver a message.”</p>\n<p>Tommy doesn’t flinch when the final shot rings out and his eyes don’t linger on the body for more than the second it takes to see that he’s not breathing. Instead, his gaze lands on his father, on the way his face softens as he kneels in front of Tommy, fingers tracing the same pattern as Wilbur’s, running barely there over the scrapes and bruises before cupping his cheeks. He says Tommy’s name like a prayer, like something precious and good and holy, and he rests their foreheads together for a long moment before pulling carefully away.</p>\n<p>He breathes once, twice, and then he breaks, whining-pleading-begging, “<em>Dad</em>,” and Phil makes a choked off shattered sound as he pulls him into his chest. Tommy’s head slots perfectly under his chin like he was made to be there or Phil was made to hold him or they were all four carved from the same stone. Tommy shudders and <em> clings </em> and Phil <em> holds him</em>.</p>\n<p>Phil just holds him, and Tommy thinks, if he asked, Phil would hold him forever.</p>\n<p>“Let’s go home,” Phil says softly. And home is here, in arms that hold and protect and carry him, but home is a kitchen table, too, it is a couch that shouldn’t fit four, but does anyway. Home is warm milk and it’s chicken soup and it’s pancakes in the middle of the afternoon.</p>\n<p>They go home. Nothing changes and nothing is the same. It’s complicated and it’s difficult, but they go home. They are together and they always go home.</p>\n<p> </p>"
}