{
  "id": "31685906",
  "url": "https://archiveofourown.org/works/31685906?view_full_work=true",
  "author": [
    "Zyla_SweetBean"
  ],
  "title": "Awakening",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
  ],
  "relationships": [
    "Midoriya Izuku & Uraraka Ochako",
    "Midoriya Izuku & Yagi Toshinori | All Might",
    "Midoriya Izuku & Past One For All Users",
    "Aizawa Shouta | Eraserhead & Midoriya Izuku",
    "Aizawa Shouta | Eraserhead & Yagi Toshinori | All Might"
  ],
  "characters": [
    "Uraraka Ochako",
    "Midoriya Izuku",
    "Iida Tenya",
    "Yaoyorozu Momo",
    "Shinsou Hitoshi",
    "Aizawa Shouta | Eraserhead",
    "Yagi Toshinori | All Might",
    "Past One For All Users (My Hero Academia)"
  ],
  "additional_tags": [
    "Kidnapping",
    "Kidnapped Midoriya Izuku",
    "Human Trafficking",
    "quirk trafficking",
    "Cages",
    "Muzzles",
    "Scared Midoriya Izuku",
    "Scared Uraraka",
    "Tags sound worse then it actually is",
    "Quirk Shenanigans (My Hero Academia)",
    "Midoriya Izuku Has One for All Quirk",
    "One For All Quirk Haunted by Past One For All Users' Ghosts (My Hero Academia)",
    "Scary One for All Quirk",
    "for real though",
    "Do NOT mess with this quirk",
    "BAMF Midoriya Izuku",
    "Scary Midoriya Izuku",
    "Hive Mind One for All",
    "Non-Consensual Drug Use",
    "Sensei | All For One is Midoriya Hisashi",
    "not super relevant to the story",
    "(unless I continue)",
    "But I will go down with this theory",
    "Hurt Midoriya Izuku",
    "Angry Midoriya Izuku",
    "Midoriya Izuku Needs A Hug",
    "Uraraka Ochako Needs a Hug",
    "They all need a hug",
    "Shinsou Hitoshi Replaces Mineta Minoru",
    "Because this should have already happened in canon",
    "Parental Aizawa Shouta | Eraserhead",
    "Parental Yagi Toshinori | All Might",
    "Hurt/Comfort",
    "Angst with a Happy Ending",
    "Protective Aizawa Shouta | Eraserhead",
    "Tired Aizawa Shouta | Eraserhead",
    "Aizawa Shouta | Eraserhead is So Done"
  ],
  "language": "English",
  "series": "",
  "published": "2021-06-02",
  "completed": "2022-01-11",
  "words": "16,662",
  "chapters": "2/2",
  "comments": "471",
  "kudos": "15,208",
  "bookmarks": "3,700",
  "hits": "132,032",
  "summary": "<p>“Shall we start the bidding then?” He gestured grandly towards Izuku. “How much are you willing to pay to buy this one of a kind-”</p>\n<p>Without lifting its legs or showing much movement, Izuku twisted, until the whites of his eyes stared at them. “You think you can buy us,” he says, and everyone jolts. </p>\n<p>It wasn’t Izuku’s voice. It was deep and tonal, reminding Uraraka of that night when they stayed up playing with Jirio’s sound machines. They had played with the controls, distorting their voices. It had been funny then to hear such distorted voices. But now? Uraraka shivered. Izuku sounded ancient. Deadly.</p>\n<p>In which Aizawa deals with the fallout and regrets everything. More spooky Izuku!</p>",
  "notes": "<p>So you know that moment when a story idea hits you over the head and holds you hostage...</p>\n<p>Yeah, I stayed up way too late writing this and ignoring everything else I needed to do, but here it is</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>So uhhh, when I posted part 1 like forever ago, it was meant as a throw-away oneshot I just needed to get out of my head. I kinda doubted many people would read it, and so I was shocked by the reaction Awakening got. I mean I love spooky feral Ofa but apparently, y'all do too. So uh, thank you (๑&gt;ᴗ&lt;๑) </p>\n<p>School, life, and work got busy so I wasn't able to respond to all of your lovely comments but know that I did read them all and they were the main reason you got a second chapter. I hope you enjoy this as much as I enjoyed writing it! Spooky Izuku for the win!!! Ｏ(≧∇≦)Ｏ</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>When I first posted, I got a lot of requests for haunted Ofa fic recs. These were my original haunted Ofa fic recs plus a couple more. </p>\n<p>hello, nine by osamugiris<br>https://archiveofourown.org/works/33134971</p>\n<p>The Peculiarities of Izuku Midoriya by Katydid<br>https://archiveofourown.org/works/34937992</p>\n<p>Perchance to dream by Jackcatmeow<br>https://archiveofourown.org/works/30163998/chapters/74313570</p>\n<p>Bigger than your body by orkestrations<br>https://archiveofourown.org/collections/My_Hero_Academia_Haunted/works/29170860</p>\n<p>U.A. Unsolved by handcrusher (ameliafromafairytale)<br>https://archiveofourown.org/collections/My_Hero_Academia_Haunted/works/13253055</p>\n<p>Flashing Lights by BelleAmant<br>https://archiveofourown.org/collections/My_Hero_Academia_Haunted/works/27137225</p>\n<p>Long Night in the Valley by Marsalias<br>https://archiveofourown.org/works/28523097/chapters/69893037</p>\n<p>So, your quirk is haunted... by smallmightysmash<br>https://archiveofourown.org/collections/My_Hero_Academia_Haunted/works/29839995</p>\n<p>Quirk's Haunted by cassiopeia721<br>https://archiveofourown.org/collections/My_Hero_Academia_Haunted/works/26966131</p>\n<p>crystals by orkestrations<br>https://archiveofourown.org/works/31133249</p>\n<p>Some of these are more spooky while others are a lot more lighthearted but I loved them all! If you're still craving more haunted Ofa fics, I would totally recommend checking out the tag. I've been feasting on it regularly XD</p>\n<p> </p>\n<p>Thank you so much for reading!!! I would love to hear what you thought!</p>\n<p>Okay, I have wanted to write something like this FOREVER, because, I'm sorry, but Ofa sometimes seems underutilized both in canon and fanfic- like I need more sentient, rabid, haunted Ofa fics out there because I'm pretty sure I've read them all. (That said I've been really excited with the mangas current arc- I predicted it a while ago and just YES!)</p>\n<p>Hope you enjoyed and thanks for reading! &lt;3</p>",
  "text": "<p>Uraraka pressed her face against the bars of her cage, ignoring the scowl the guards sent her. One of them pointed his gun threateningly towards her, and she conceded, shrinking back into her confinement. </p>\n<p>Her arms ached from being forced behind her back, and her hands dripped in the thick gloves. Restrained and technically quirkless- the villains who grabbed them knew what they were doing. </p>\n<p>The smell of sweat and urine dominated her senses, and all around her, cages were filled with anxious, huddled bodies. They were waiting in the dark, waiting for it to begin. </p>\n<p>\"Welcome to the Auction!\" a voice roared into a microphone, the magnified sound echoing backstage. \"We've got some special items up for bidding tonight!\"</p>\n<p>Uraraka scowled, trying to channel her fear into anger. </p>\n<p>\"People,\" Izuku growled from the cage next to her. \"Not items, but people.\" Thick cuffs and straps locked his arms behind his back and pinned his arms to his torso. An angry, purple bruise was forming on his cheek, a testament to the damage he sustained fighting back against their kidnappers and enabling some of 1A to escape.</p>\n<p>He shuffled in the small cage, forced onto his knees. \"We have to escape,\" he whispered, \"either now or in transport. Once we get shipped off, it will be that much harder for the heroes to track us-\"</p>\n<p>A gun banged against Izuku's, rattling the bars and startling Uraraka. \"Shut up,\" a guard snapped. \"We'll gag you if we have to.\"</p>\n<p>Izuku glared back but shut his mouth, and Uraraka did likewise. They wouldn't be cowered, but they knew when to pick their fights. </p>\n<p>Instead, Uraka shuffled in her cage, trying and failing to find a more comfortable position. She sighed. At least UA wouldn't get in trouble for this villain attack, she thought ruefully. Although the fact that villains had managed to attack and capture five members of 1A during a Hero Commission Exam was worrying. </p>\n<p>The attack had been too well organized, separating class 1A from their teachers and systematically launching their attack. Not that 1A hadn't fought back as fiercely as fully licensed heroes, especially when considering the bruises and broken limbs they had wrecked upon their kidnappers. Izuku and Bakugou had been a terrifying duo of lightning and flame, pure power and destruction. </p>\n<p>She should be happier that only herself, Izuku, Iida, Shinsou, and Yaoyorozu had been captured. Most of 1A had escaped, and she knew their teachers, especially Aiawa and All Might, would be looking for them. </p>\n<p>And yet the dread she felt, curling in her stomach. The laughing of the crowd, the posturing of the auctioneer, the side glances of her friends, and the shiny sleekness of the guard's loaded guns- they only added to the growing anxiety. </p>\n<p>Something terrible was going to happen.</p>\n<p>She almost opened her mouth to warn Izuku but shut it instead. Of course, something terrible was going to happen, she thought. The whole situation was a disaster. </p>\n<p>But the thought didn't shake the dread, the warning that <em> something </em> was coming.</p>\n<p>\"And without further ado,\" the auctioneer cried. \"Let us begin. Please, bring out the first item for sale.\"</p>\n<p>The guards stalked forward, messing with the lock to a cage and pulling its occupant out. A young girl, not even in Middle School and wearing her gakuran, begged the guards to let her go. Tears streamed down her face as she tugged at her bindings and the guards dragging her. </p>\n<p>Within a moment, she was gone, out of the corridor and front stage where the auctioneer enthusiastically announced the first item.</p>\n<p>\"And here we have a young girl, ten years old. Not very strong but possesses an incredible telekinesis quirk capable of lifting up to 500 pounds and more if given the right treatment.\"</p>\n<p>The auctioneer crowed an ever-increasing number of yen to the crowd, riling the potential buyers and encouraging them to not let a fine specimen escape their grasp. </p>\n<p>\"SOLD!\" they cry went, and Uraraka slumped against the cage's bars. </p>\n<p>\"They just sold a human being,\" Izuku said, his face crinkling in rage, but Uraraka saw the tears streaming down his face. </p>\n<p>\"I know,\" she said, longing to reach through the bars and hug her friend. But the metal bars restraining her hands made it impossible. </p>\n<p>\"It'll be okay, though,\" Yaoyorozu said, her voice assured. \"The heroes will find us. Our teachers will find us.\" Her smile was wobbly, but her eyes shone with determination. \"And once they find us, they'll find the others, just like that girl.\"</p>\n<p>From his cage, Iida nodded. \"I have no doubt that Mr. Aizawa, All Might, and the rest of UA are looking for us.\"</p>\n<p>Although his face was muzzled, Shinsou nodded towards the guards and ran along, dramatic finger against his throat.</p>\n<p>Izuku chuckled weakly. \"You're right. They'll find us, but they'll also find the guards. And I won't envy them then.\"</p>\n<p>The others smiled, remembering times when they were forced to face off against their own teachers. It hadn't been easy, and their teachers had been going easy on them.</p>\n<p>Uraraka snorted to herself; there might not be any guards left afterward if their teachers had their way. </p>\n<p>\"It'll be okay,\" Iida declared, and Uraraka smiled softly in agreement.</p>\n<p>They wouldn't be abandoned. The heroes would come. </p>\n<p>And yet, one by one, the cages began to empty until only Uraraka, Izuku, Iida, Yaoyorozu, and Shinsou remained. </p>\n<p>\"Grab them all,\" A guard ordered, appearing from behind a curtain wall. \"They're being presented as a group.\"</p>\n<p>Uraraka stiffened, rotating her bound wrists. To the cage next to her, Izuku rolled onto the ball of his feet, and farther down, Iida, Yaoyorozu, and Shinsou braced themselves. They trusted that their teachers would find them, but they would also take any chance to escape. </p>\n<p>The guard sneered and flicked the safety off on his gun; instantly, everyone stiffened. \"Yeah, that right,\" he mocked the group, aiming the gun at each of them. \"We've been ordered to shoot whenever someone makes an attempt to escape.\"</p>\n<p>Uraraka paled, that threat might deter most, but Izuku willingly shattered his arm for a school festival. If he saw a chance, he would take it and potentially die. Judging by Izuku's feral smile, it was a risk he would be willing to take.\"</p>\n<p>\"Of course,\" the guard continued, \"We'll also shoot one of your friends too.\"</p>\n<p>Everyone froze, eyes darting to each other. \"That's despicable,\" Iida growled. </p>\n<p>The guard shrugged. \"We've dealt with hero students before. It's the only thing you self-sacrificial idiots will listen to. Everyone once in a while, someone chooses to test us, and we're forced to carry it out. Usually, they're so startled that we can recapture them no issue.\"</p>\n<p>Another guard spoke up, a cigarette hanging from his lips, the smoke curling upward. \"It's a pity to lose merch, but we always eliminate one of the least valuable pieces.\"</p>\n<p>The first guard smirked, \"Probably you, little lady,\" he said, pointing the gun at Uraraka, \"Or maybe the engine boy.\"</p>\n<p>Izuku growled, \"How dare you,\" his eyes dark and shadowed, but the green seemed to shine in the dark.</p>\n<p>The guard barked a laugh. \"Someone will have fun breaking you,\" he leered.</p>\n<p>A new head poked out from the curtains, \"Hurry up already,\" they barked, and the guards rolled their eyes. </p>\n<p>\"Fine, fine.\"</p>\n<p>Guards poured into the room, two lining up by each cage, as the doors were swung open and the hero students dragged out. </p>\n<p>For a brief moment, Uraraka considered trying to run, but then the barrel of a gun was pressed up against her skull, and she paused. Every one of her friends had a gun pointed at them, and Uraraka couldn't be the reason they were hurt. </p>\n<p>So she bowed her head and allowed the guards to push them out of the darkroom and through the thick, matted curtains. </p>\n<p>The light stabbed her eyes, and Uraraka blinked rapidly against the blinding spotlights, trying to adjust after being kept in darkness.</p>\n<p>They were herded towards the back of a stage facing a large audience. </p>\n<p>With some difficulty, she peered out towards the formless, dark crowd. Within the churning mass, she could see the glimmer of jewelry or a stretching arm. There was nothing substantial, nothing she could use as an advantage.</p>\n<p>\"Annnnd here we have the products you've all been waiting for. Procured only a day earlier right from underneath the commission's nose.\" He tapped his own nose, and the crowd laughed appreciatively. \"Five of the strongest students from UA's legendary class 1A. Let's give it up for them.\"</p>\n<p>The audience applauded raucously, some yelling crude comments that tinged Uraraka and Yaoyorozu's cheeks pink. </p>\n<p><em> We're about to be sold,</em> she thought in numb horror, the gravity of the situation beginning to dawn on her. </p>\n<p>\"Let's start with the bidding on the first good,\" the auctioneer called, swinging to face them. </p>\n<p>He looked so normal, Uraraka thought. Simple black suit and slicked back brown hair revealing two curling horns. His mouth was unusually long and spread in a sickening smile. \"Bring up the Yaoyorozu girl,\" he ordered. </p>\n<p>Yaoyorozu gasped as she was dragged towards the center stage, her eyes catching Uraraka's. Yaoyorozu's eyes watered, but she smiled weakly, trying to stay strong. </p>\n<p>The auctioneer beamed. \"Wonderful, wonderful,\" he said as the guards shoved Yaoyorozu onto her knees. \"Our first product is Momo Yaoyorozu, heir to the Yaoyorozu fortune, and Vice President of class 1A. She's beautiful,\" he said, running his fingers against her cheek, \"but also incredibly powerful. Her quirk, Creation, allows her to create anything you want.\"</p>\n<p>The audience hummed in appreciation, flashes of cameras assaulting Yaoyorozu's kneeling form.</p>\n<p>Next to Uraraka, Izuku was grinding his teeth, obviously struggling to restrain himself. Iida was biting his lip to stop himself from saying something he shouldn't.</p>\n<p>The auctioneer continued, oblivious to 1A's building anger. \"Of course,\" he said, \"with such a strong quirk, that just means a demonstration is in order.\" He bent down towards Yaoyorozu, smiling broadly. \"Let's see your quirk, darling.\"</p>\n<p>Yaoyorozu shook her head in defiance, scowling through her hanging black hair.</p>\n<p>The auctioneer sighed in exaggerated disappointment. </p>\n<p>\"Sometimes,\" he announced to the crowd, \"You purchase… uncooperative goods. It's been a problem plaguing our business for too long. And so with these quality items, we'd like to present one of our newest resources, a cocktail designed to bring the best out of your goods.\"</p>\n<p>He opened a wooden case, presenting a syringe gun and five canisters of fluid to the crowd.</p>\n<p>\"A mixture of trigger and several other illegal substances,\" he said with a smile. Turning to the guards, he ordered, \"Hold her tightly.\"</p>\n<p>Yaoyorozu struggled, pulling against the guards' hold, but all it took was one was one second and a sharp click against her neck from the syringe gun. </p>\n<p>The guards stepped away, releasing her arms. Yaoyorozu eyed them in barely restrained panic, and then she jolted as if she had been hit by Kaminari's electricity. </p>\n<p>Her muscles stiffened, and her neck grew tense as uncontrollable tremors shook her body. Biting back a moan, she hunched in on herself, hugging her cuffed hands to her chest. The tremors grew more violent until it seemed her body would shake apart. </p>\n<p>Then it stopped, and she slumped back, eyes glazed over and mouth hanging open. There was no recognition, no awareness in her eyes. And Uraraka choked back a sob seeing her friend like that. </p>\n<p>\"Ah, that's better, sweetheart,\" the auctioneer said, running his hand through Yaoyorozu's hair as she sat docile. \"Why don't you show off your quirk now? Make us something big.\" He hummed, rubbing his chin in mock thoughtfulness. \"What about a tank?\"</p>\n<p>\"No!\" Uraraka cried. \"That's too much, you'll- mph!\" A meaty hand slapped across her mouth, cutting off her words. </p>\n<p>But no one paid attention to them, everyones' eyes trained on the shimmering bulge forming on Yaoyorozu's back. A guttural groan forced itself past her too pale lips as her body mass fluctuated. Skin bulged out in grotesque lumps then flattened towards the side, making room as the green barrel of a tank rose from her back, signaling the beginning of the rest. </p>\n<p>Her body bloated more, making room for the tank's body and pressing her towards the ground. </p>\n<p>The crowd oohed in appreciation as the massive body of the tank emerged, rising from Yaoyorozu's skin. It paused for a moment, balancing on shimmering skin before thudding on the ground. </p>\n<p>\"Your new tank!\" the auctioneer announced with a wave of his hand, and the crowd roared its approval. </p>\n<p>But the members of 1A stared at Yaoyorozu. Her skin was flushed and dripping sweat. Trembles racked her body like an isolated earthquake wreaking havoc on their classmate.  </p>\n<p>Uraraka looked with teary eyes towards her friends, seeking some type of comfort, but not a single eye was dry. Shinsou looked sick, face turning green under his muzzle, while Iida kept opening and closing his mouth in mute horror.</p>\n<p>Izuku's mouth creased into a thin line, a hard look in his eyes. The face of a condemned man, of a villain sentenced to life in Tartarus. \"Monsters,\" he whispered.</p>\n<p>In front of them, the auctioneer laughed. \"Works wonderfully, does it not? Its unique makeup maximizes their quirk while sending them into a subconscious state. Making them both extremely powerful and suggestible to commands.\" He pet Yaoyorozu's hair again. \"With just a simple injection, you can awaken the perfect weapon.\"</p>\n<p>The auctioneer's teeth flashed, \"And now, after such an amazing demonstration. Why don't we start the bidding? If offered the right price, we'll even throw in the tank.\"</p>\n<p>Yells began as bids were placed on Uraraka's friend. She knew she should listen, scan the surroundings, try to find anything that would allow them to escape. But Uraraka couldn't tear her eyes away from Yaoyorozu.</p>\n<p>Although they were friends, Uraraka wouldn't say she was particularly close to Yaoyorozu. Her classmate seemed so proper and perfect, with her wealthy family and immaculate looks. Uraraka sometimes felt inferior, and even a smidge irritated with how oblivious Yaoyorozu was of her blessings. </p>\n<p>But Yaoyorozu was a good person and a good friend; she didn't deserve this. No one deserved this.</p>\n<p>Yaoyorozu's eyes looked vacant as if her soul had been plucked from her breast. As the calling bids grew higher and higher, her face never changed, resting in unknowing numbness. </p>\n<p>Finally, the bell sounded, and Yaoyorozu was dragged off stage, this time not restrained by the guards but carried. </p>\n<p>Uraraka's thoughts flashed back to the case. There were five vials, she realized. They were planning on injecting them all. Her stomach dropped. There was no way they could escape if they were drugged up.</p>\n<p>The others seemed to think the same, their eyes hardening. But no one tried to run. Unwilling to make a move and risk each other's lives. </p>\n<p>And yet, Uraraka thought, she desperately wanted to as one of her best friends, the boy who saved her at the entrance exam and who showed limitless determination, was dragged to centerstage. </p>\n<p>\"Midoriya,\" Iida whispered, a single tear trickling down his face. </p>\n<p>But Izuku stayed resolute, flashing his friends a brief but brilliant smile. <em> It's okay</em>, he seemed to say.  <em> It'll be okay. </em> </p>\n<p>Uraraka clung to that thought.<em>  It'll be okay, </em>  she told herself.  <em> It'll be okay. This is Deku. He's survived everything. He'll survive this.  </em></p>\n<p>The guards shoved him down onto his knees, Izuku barely managing not to trip over his bound legs. His shoulders were tense, and the bright spotlights highlighted the sweat trickling down Izuku's neck. </p>\n<p><em> He's scared</em>, she thought, <em>but he was trying to be brave for them. </em> </p>\n<p>She could barely see through her teary eyes as the syringe gun was pressed against Izuku's neck, and with a click, injected.</p>\n<p>For a couple of seconds, nothing happened, long enough for Uraraka to hope nothing would happen-</p>\n<p>Izuku jolted like he had been struck by a lightning bolt and <em><strong>screamed</strong>. </em></p>\n<p>Uraraka and the others jolted, struck by the sheer pain in Izuku's voice. It was agonizing and guttural, making their hairs stand on end and their body tensing. </p>\n<p>For all the pain Izuku had experienced, he had only screamed like that once before when Bakugou had been taken during the summer camp. </p>\n<p>The scream lengthened as Izuku's arched until it looked like it might break, and his skin turned a sickly green. Lightning crackled across his skin, and Izuku convulsed, throwing his head back. Head facing them, Uraraka watched Izuku's eyes roll back in his sockets until only white remained. </p>\n<p>\"Somethings wrong!\" she screamed, tugging at her guards, but they remained transfixed, watching the drug destroy her friend. </p>\n<p>His muscles swelled, bulging outward, and his veins pulsed a toxic green. The scream continued, growing more distorted and echoing, like a chorus of agony. </p>\n<p>Mist steamed off of his skin. Hissing in the air, spilling onto the stage and over the lip to the floor below. Thin trails of blood trickled from his nose and ears, leaving crimson streaks down his cheeks and neck.</p>\n<p>\"What's going on?! Someone yelled. \"I've never seen a reaction like this before.\"</p>\n<p>But no response could be heard as Izuku's scream crescendoed, and long inky appendages sprouted from his chest and legs, tearing through fabric. Their pointed ends sunk into the wooden stage, leaving splinters underneath. The guards stumbled back in a panic, as like mutated spider legs, the black tendrils lifted Izuku up off the ground, his bound legs swinging slightly in the air.</p>\n<p>The scream stopped- Izuku hanging midair, supported by his quirk, eyes white and unseeing, the sickly green lightning continuing to crackle around him.</p>\n<p>The room stilled. Not a breath heard.</p>\n<p>Despite Izuku's bound, motionless form- there was something about it that left the ancient human (the one existing long before quirks and anything else) cowering in fear. </p>\n<p><em> Do not move; </em>it seemed to whisper. <em>Move, and you die. </em></p>\n<p>The churning anxiety from before slammed into Uraraka. <em> Something is wrong,</em> it screamed, <em>something is very, very wrong. </em> </p>\n<p>\"What did you do?\" Iida whispered, breaking the dreadful silence. His voice grew in anger. \"What did you do to Midoriya!?\"</p>\n<p>No one responded, not even Izuku as he swayed like a hanged man at the gallows, spit dripping from his open mouth, body uplifted by what Uraraka now realized was blackwhip.</p>\n<p>The auctioneer chuckled, his relieved giggles growing louder and louder until he roared in laughter, the audience following nervously. </p>\n<p>\"Wow!\" he gasps, hands braced in his hair. \"We knew this one would be powerful, but this-\" he gestures toward Izuku's limp form. \"Is more than what I was expecting.\" He shakes his head, giving Izuku a rueful glance. \"Sorry, folks, for the scare. Sometimes even we get surprised. But we've wasted enough time. Let's get this auction going again. I think it's safe to say that this is a wholly unique specimen, unlike any we've ever had or seen.\"</p>\n<p>The crowd murmurs in agreement, shifting in their seats, and the auctioneer smiles.</p>\n<p>\"Shall we start the bidding then?\" He gestured grandly towards Izuku. \"How much are you willing to pay to buy this one of a kind-\"</p>\n<p>Without lifting its legs or showing much movement, Izuku twisted until the whites of his eyes stared at them. <em><strong>\"You think you can buy us,\"</strong></em>  he said, and everyone jolted. </p>\n<p>It wasn't Izuku's voice. It was deep and tonal, reminding Uraraka of that night when they stayed up playing with Jirio's sound machines. They had played with the controls, distorting their voices. It had been funny then to hear such distorted voices. But now? Uraraka shivered. Izuku sounded ancient. Deadly.</p>\n<p>\"What?\" the auctioneer asked with a laugh.</p>\n<p>\n<em>\n<strong>\"You think you can buy us?\"</strong>\n</em>\n</p>\n<p>Izuku's mouth didn't move, but the sounds resonated out of him, rippling through the air. </p>\n<p>The auctioneer sneered, \"Actually, I think-\"</p>\n<p>\n<em> <strong>\"You think you can steal us?\"</strong> </em>\n</p>\n<p>It was as if a crowd was speaking with Izuku, their individual tones overlapping each other but speaking in unison. </p>\n<p>One of the blank tendrils holding Izuku up lashed out, piercing through the auctioneer's arm in a spray of blood. </p>\n<p>The man fell to his knees, clutching his arm, screaming. \"Shoot him! Shoot him!\"</p>\n<p>Uraraka didn't even have time to react, to protect her friend, as black barrels lifted, and the auditorium echoed with the jarring sound of firing guns. </p>\n<p>Izuku didn't move from his position, but blackwhip flared, dozens of tendrils lashing out, slicing the bullets as they flew towards him, the bullet halves clattering to the ground. </p>\n<p>One of the guards holding Shinsou swore, \"Screw this,\" he said. His fists glowed red and warped into giant hammers that he raised above his head. \"Die already!\" he yelled, rearing back to strike. </p>\n<p>Unflinching, Izuku stared blankly as a black tendril snapped around the guard's ankle and lifted him up into the air. The man was pulled closer until he was inches away from Izuku's face. The lightning sizzled over Izuku's features, leaping off his curls and zapping the whimpering guard. </p>\n<p><em><strong>\"We will not be broken.\"</strong></em>  Izuku intoned, the echoing chorus speaking alongside. The mist began to pour off of his too pale skin. It rolled in waves across the stage, splashing onto the audience and lapping at Uraraka's legs. </p>\n<p>\n<em> <strong>\"We will not be bought.\"</strong> </em>\n</p>\n<p>The guard holding Uraraka hissed in her ear. \"What is that? What is that thing!?\"</p>\n<p>More tendrils of blackwhip sprouted from Izuku's body, whipping around in an angry snarl, like they did the day they first manifested.  </p>\n<p>The voices increased in volume, the individual tones drowning under the building rage and sorrow. <em><strong>\"We are they who have bled, and suffered, and died for peace.\"</strong></em></p>\n<p>Izuku turned to face the audience, the lightning rippling over him reaching a frantic speed.</p>\n<p>\n<em> <strong>\"We will not bow down to the likes of you. We will not be used.\"</strong> </em>\n</p>\n<p> Energy hummed around Izuku, revving up like an engine switching gears, and then released in a concussive wave of energy that roared in Uraraka's ears. The lights shattered, glass raining down on their heads, and Uraraka's body slammed into the guards restraining her and then into the backstage curtain. </p>\n<p>The railing creaked, and overhead she watched as the curtain trembled, then tumbled to the ground, crushing the air from Uraraka's chest under its layers of crimson velvet. </p>\n<p>The cloth pressed down, suffocating her under its weight. Uraraka's breath stuttered as each gasp seemed unable to bring in enough oxygen. </p>\n<p>Past the darkness of the curtain, Uraraka heard screams and the rattling of repeating gunshots. </p>\n<p><em> Izuku, </em>  Uraraka thought.  <em> I need to help Izuku. </em> </p>\n<p>She wiggled against the fabric, and underneath her, felt the guards who had been restraining her groan. </p>\n<p><em> Not good </em>, she thought, trying to squirm into a position where her fingertips could make contact. Her fingertips pressed into the cloth, and she heard the buzzing twinkle of her quirk activating.</p>\n<p><em> Yes! </em> She thought, bucking her body to push the curtain up. It was too heavy to lift entirely but enough to make room so that she could escape. </p>\n<p>Pushing herself free of the curtain, she choked on the thick smoke clogging the air. </p>\n<p>\"What?\" she gasped. The room was barely lit. Only a few lights survived Izuku's blast, but the smoke had rendered any visibility possible. </p>\n<p>But peering in, she could see green crackles of lightning and the flashing pops of gunfire. </p>\n<p>\"Deku!\" she yelled. \"Deku!\"</p>\n<p>But her friend didn't respond, so steeling herself, she plunged into the mist.  </p>\n<p>It was like when she once visited a haunted house, stumbling alone in the dark, waiting for the monsters to get her. The sounds of screaming and snapping of limbs echoed around her. Every few steps, it seemed like she was stumbling over a fallen body. </p>\n<p>Uraraka bit back a sob and pushed further into the mists. </p>\n<p>A body rushed past her, screaming profanities, but a single dark tendril struck through the fog, wrapping around the man's waist and flinging him away. </p>\n<p>\"Deku?\" Uraraka asked.</p>\n<p>And like a monster out of nightmares, her friend appeared. </p>\n<p>Limp and hanging like a corpse, yet radiating wrath and anger, Uraraka flinched under the weight of his aura. She was choking, drowning under the pain- bodies mutilated by an ever-smiling villain; family and friends torn to shreds; entire cities collapsing into rubble and dust. </p>\n<p>She was dying. She was going to die under this anger, this wrath, this pain. </p>\n<p>\"Deku,\" she whispered, for once understanding the terror villains felt when faced with her friend. \"Deku, please.\"</p>\n<p>She struggled to stay standing. This wasn't her monster, nor her fear. He was Izuku... he was Deku, her sweet, gentle, can-do rescuer, who had been by her side every step of UA.</p>\n<p>\"Come on. Deku. She said, taking a hesitant step forward. \"We have to go.\"</p>\n<p>The lightning cocooning Izuku increased in intensity, and blackwhip writhed around him. <em><strong>\"They have to pay.\"</strong></em>  </p>\n<p>Uraraka flinched at the distorted, unnatural nature of Izuku's voice, but she swallowed down her fear. </p>\n<p>\"You're a hero in training, not a judge or juror.\" She cried. \"We need your help!\"</p>\n<p>The flailing tendrils surrounding Izuku stilled, and Uraraka saw a glimmer of awareness return to Izuku's pale eyes. </p>\n<p>\"Please,\" Uraraka begged, \"You're my best friend. You know me. You saved me at the entrance exam, and then I saved you. We have late-night movie nights and caffeine-fueled study sessions. I know your favorite food is katsudon, and you like watching All Might clips on repeat when you're stressed.\" </p>\n<p>A trembling smile tugged at Uraraka's lips, and she reached out a hand, \"You've helped so many people. Please, right now. Help us.\"</p>\n<p>A single tendril snaked towards Uraraka, wrapping around her wrist. She braced herself to be flung, but the tendril merely nudged her on, like a child asking for a parent to lead the way. </p>\n<p>\"Thank you,\" Uraraka whispered as the cool tendril tightened slightly. </p>\n<p>Uraraka forged back to the stage, fighting through the mist blinding her eyes. The screams had stopped, now that Uraraka found Izuku, and she shoved what that meant out of her mind. </p>\n<p>Every few steps, she turned her head to peer through the mist and make sure that Izuku was there. And every time, Izuku's blank gaze and hanging mouth greeted her. </p>\n<p>But maneuvering the fog and the darkness proved impossible, Uraraka having gotten turned around as she hunted for Izuku. </p>\n<p>The cool tendril around her wrist tightened, tugging her in a different direction. </p>\n<p>\"What?\" she asked. </p>\n<p>But Izuku strode past her, the long blackwhip legs stepping across the floor and dragging her in its wake. </p>\n<p>Blackwhip slithered through the mist, probing the area and throwing downed bodies out of the way. A burst of power busted through metal doors, and they plunged into dark tunnels. </p>\n<p>New screams cried of children and teenagers, trapped and bound, waiting in cages to be shipped out. </p>\n<p>Izuku strode through them, black tendrils smashing through metal bars and wrapping around sobbing kids. </p>\n<p>A single tendril wrapped around every person, tugging them along through the dark and curling mist. </p>\n<p>Like an army following a general or a cloak swirling behind a king, the trafficked children followed Izuku, his probing tendrils feeling their way through the twisting tunnels. </p>\n<p>\"Uraraka!\" Iida yelled, fighting through the throngs to get to her. An unconscious Yaoyorozu laid in his arms, and Shinsou stood close beside him. Each of them was wrapped in a black tendril. \"What's going on! Why's blackwhip acting like this!\"</p>\n<p>\"I don't know,\" Uraraka admitted, watching Izuku's toxic green form as he collected child after child. \"But he seems to know what he's doing! We need to trust him.\"</p>\n<p>Iida's eyes narrowed as he glanced between her and Izuku, but both he and Shinsou nodded. </p>\n<p>\"Right,\" Iida said. \"We are members of 1A, and we stick together.\"</p>\n<p>Izuku's glowing form served as the only light in the dark tunnels, and the people clung to it. Desperate for the hope it brought. Izuku plunged forward, long blackwhip leading them upstairs before breaking through barred doors to an open waiting room. </p>\n<p>A single man stood there, gun held between shaking hands, a snarl on his lips. The auctioneer, no longer calm and collected, leveled the barrel of the weapon at Izuku.</p>\n<p>\"Stop right there if you don't want to lose your quirk.\" He snarled. \"They're hard to find, but I have one of the last quirk erasing bullets from Overhaul.\"</p>\n<p>Izuku stilled, and behind him, Uraraka felt the dark tendril tug her and everyone else closer behind his floating form. </p>\n<p>\"You types rely on your quirks; they're everything to you. I can take it. I can take it all from you. With one shot, one bullet! You destroyed my business, stole my goods! Who are you to stop me!\" the auctioneer spat. </p>\n<p><em><strong> \"Who… are… we?\"</strong></em>  Izuku asked. </p>\n<p>The tendrils holding him up slithered back into him, leaving his body floating free above the ground. His head tilted to the auctioneer, and his arms lifted from his side. </p>\n<p><em><strong>\"We are One for All.\"</strong></em>  The words resonated in the air, every syllable carrying a weight that rang in their ears and sunk into their bones. Every voice spoke in unison, the choir united in a singular purpose. </p>\n<p>\n<em> <strong>\"We are the generational quirk.\" </strong> </em>\n</p>\n<p>The air crackled and sizzled, ozone stinging in every nose and watering every eye. Izuku's aura pulsed, the sheer weight of his presence bearing down on Uraraka. She could hardly stand, barely breathe.</p>\n<p>Izuku's body burned brighter and brighter until staring at him was like staring into the sun. </p>\n<p>\n<strong> <em>\"We are that which cannot be stolen nor erased.\"</em> </strong>\n</p>\n<p>He floated closer to the auctioneer, the ground cracking as he passed over—the auctioneer back away, waving the gun threateningly.</p>\n<p>\n<em> <strong>\"We are the Scourge of the Underworld.\"</strong> </em>\n</p>\n<p>The gun cracked! But a single tendril plucked the bullet out of the air and ground it into dust. The auctioneer whimpered, falling to the ground, trying to scramble away.</p>\n<p><strong><em>\"We are the Defier of All for One!\"</em></strong>  the voices cried, angry and vengeful. </p>\n<p>Izuku paused, a solitary fist-raising back in the air, red and gold lines humming across the skiing. <em><strong>\"And we!\"</strong></em>  the voice cried, their individual tones mixing in perfect harmony. <em><strong>\"We are your undoing.\"</strong></em></p>\n<p><em> He's going to kill him, </em> Uraraka realized, and she lunged forward in a desperate \"No!\" as the fist descended-</p>\n<p>\"You're under arrest!\" voices cried as a wall exploded, blowing the auctioneer away from Izuku's oncoming fist. </p>\n<p>Dividing branches shot through the newly formed hole, latching around Izuku's body and flinging him out of the foyer and into the night sky.  </p>\n<p>\"No! Izuku!\" Uraraka screamed, scrambling to her feet and running after him. </p>\n<p>Heroes and police officers streamed through the hole, shouting out orders and calling for help, but Uraraka shoved through them all, stumbling out into the street where police cars and ambulances flashed, and sirens howled. </p>\n<p>\"Subdue it!\" she heard someone yell. </p>\n<p>\"Cuff it now!\" Another called. </p>\n<p>Izuku flailed amid attacking heroes, blackwhip flinging heroes off his back, and crushing police cars. Lightning burned whoever got too close as police officers crumpled to the ground cradling seared limbs. </p>\n<p>Kamui Woods leaped through the air around Izuku, sending outreaching branches to snare and attack, and Izuku spun out of the way, lashing out at a lunging police officer. </p>\n<p>Uraraka pushed her way into the fighting, trying to pull the heroes away. </p>\n<p>\"That's our friend!\" Iida yelled, leaping over a police car. \"Don't hurt him!\"</p>\n<p>The heroes shoved him away. \"Get back! It's too dangerous!\" He raised his fists. \"Deatharms will save you, but you need to get out!\"</p>\n<p>Shinsou sprinted towards them, and Aizawa followed close behind. His quirk activated, eyes turning crimson, and hair floating. </p>\n<p>Izuku's quirk flickered, the neon color of his skin fading and the lightning dissipating. </p>\n<p>He clutched his body. \"No,\" he whispered. Then his quirk flared back with increased intensity, <strong><em>\"NOOOO!\"</em></strong>  He screamed, energy rippling out and blasting all of the heroes away. </p>\n<p><em><strong>\"We will not be destroyed!\"</strong></em>  Izuku screamed, voice screaming in unison. Blackwhip flailed around him, preventing any heroes from getting closer. <strong><em>\"We will not be taken!\"</em></strong></p>\n<p>Aizawa clutched his scarf. Blinking and then reactivating his quirk with no success. He paled and turned to his students. \"What's going on?\" He demanded, grabbing Iida's shoulder. \"What happened?!\"</p>\n<p>Izuku writhed in midair, quirk crackling around like in the middle of a lightning storm. Uraraka shielded her eyes, cowering under the ferocity. </p>\n<p>\"It…\" the words seemed to choke in his throat, and for a moment, Uraraka heard Izuku's voice, devoid of the others. But then they came back, louder than before. <em><strong>\"IT HURTS!\"</strong></em></p>\n<p>\"Young Midoriya!\" A familiar voice called, as All Might, in his skinny form, bangs whipping in his face, sprinted towards them. \"Young Midoriya!\" he yelled again. </p>\n<p>Arms reached out to stop him, but he shouldered past them with a strength belied by his form. </p>\n<p>\"All Might!\" one called. </p>\n<p>\"It's too dangerous!\"</p>\n<p>Izuku froze in mid-air, his white eyes turning to All Might. </p>\n<p>The former number one hero choked, hand covering his mouth as tears streamed down his face. </p>\n<p>\"My boy,\" he whispered. Unafraid, he reached through the crackling storm and whipping tendrils to grasp Izuku by the shoulder. Izuku shuddered, body twitching and jerking. </p>\n<p>\"My boy,\" All Might whispered again, standing tall but calmly even as Izuku sparked overhead.\" I am here. It's okay now.\"</p>\n<p><em><strong>\"AllMighToshinoriEight!\"</strong></em>  the voices cried, and tears streamed down Izuku's face. </p>\n<p>\"That's right,\" All Might said, his voice soft. He tugged on Izuku's arm, pulling him out of the sky and into his arms. </p>\n<p>Lightning crackled around them, but All Might buried his face in Izuku's curls, unaware of the storm. </p>\n<p>\"My boy, my boy,\" he whispered, rocking back and forth. Blackwhip wrapped around All Might in return as the two sank to their knees. </p>\n<p>\"It hurts!\" Izuku whimpered, the lightning finally settling down. \"And I don't want to go. I don't want to be taken!\"</p>\n<p>All Might cradled Izuku closer, waving away the heroes who now crept closer. </p>\n<p>\"Shh, shh, I know, I know. Never again. I won't let them. It's okay now,\" he soothed, petting Izuku's hair, \"I am here now. You're safe.\"</p>\n<p>Tears trickled down Uraraka's face, and beside her, Iida sniffled, pushing his glasses away to rub at his eyes. Even Shinsou had misty eyes.</p>\n<p>A hand fell on Uraraka's shoulder, \"What happened?\" Aizawa breathed, his appearance disheveled and eyes wide as he watched Izuku.  </p>\n<p>\"I-\" Uraraka started as she tried for the right words. \"Something awoke.\" she finally said. \"And I don't know if it's going back to sleep.\"</p>\n<p>The hairs on the back of Aizawa's neck prickled as he watched All Might cradle a broken Midoriya. Aizawa had watched Midoiriya destroy his body in sporting events and villain attacks, but he had never seen his student look like this. </p>\n<p>Aizawa’s painfully self-conscious, caring, determined, student lay pale and trembling in All Might's arms. Midoriya’s eyes were glossed over and blank, and his quirk crackled with flashes of green lightning. Blackwhip twitched and spasmed, lashing out at any hero who dared step too close. But worst of all were the sobs, ripping themselves from Midoriya’s chest. </p>\n<p>Bile burned in the back of Aizawa’s throat, and he had to look away. </p>\n<p>He had tried to prepare himself before the raid for what he might see. But none of his mental preparations had survived the onslaught. </p>\n<p>Sirens screamed, and lights flashed as police barked orders into their walkie-talkies and heroes swarmed the office building hiding the quirk auction. Heroes ran out of the building holding crying children. Over the crackle of the nearest walkie-talkie, Aizawa could hear the confused reports of the responding police and found his gaze traveling back to his student. <em> What did you do, problem child?  </em></p>\n<p>Uraraka took a hesitant step towards Midoriya, and Aizawa instinctively released his capture weapon, letting the ends wrap around his students, tugging Uraraka, Shinsou, Iida, and Yaoyorozu close. He had his students back. He wasn't letting them go again. </p>\n<p>\"Let's go. We need to get you four to the hospital. U.A. has paramedics and ambulances waiting for you.\"</p>\n<p>Uraraka tugged on his scarf, resisting the pull over to the paramedics. \"Is Deku going to be okay?\"</p>\n<p>Aizawa resisted the urge to look back at his student. The one who was determined to break himself. The one <em> Eraserhead </em> had failed again. \"All Might is with him right now, and as soon as you four are looked at and under hero protection, I'll go check on Izuku's status.\"</p>\n<p>\"We can't leave him! They did something to him and Yaoyorozu. It made his quirk lash out and attack everyone.\" </p>\n<p>Yaoyorozu moaned in Iida's arms, her eyelids fluttering. Her fingers shook, one of her signs for quirk exhaustion. \"Yaoyorozu needs attention too,\" Iida whispered. His glasses were cracked, but tears shone underneath. </p>\n<p>\"But Izuku!\"</p>\n<p>\"You're being illogical.\" Uraraka flinched, and Aizawa took her distraction to pick up his pace, tugging on his scarf. \"You're injured and more likely to serve as a distraction. All Might won't leave Izuku. He'll be fine. Now <em> come </em>.\" </p>\n<p>After Kamino, Aizawa had promised himself as a teacher and hero that he would not allow his students to be taken again. Curse the Hero Commission for making him break his promise. </p>\n<p>Aizawa had felt his hackles raise the day the hero commission officials oozed their way into U.A. Aizawa had seen how Nezu greeted them, pleasant smile revealing a hint of canines and tail twitching. The principal had ushered the commission officials to his office, the door closing shut with finality. When they left, neither side looked particularly pleased. </p>\n<p>Still, less than 15 minutes later, Aizawa and Vlad had received an email from Nezu informing them that the commission was requiring the rising generation of heroes to take an additional series of tests to prove their capabilities. </p>\n<p>Beneath Aizawa's capture weapon, his jaw ticked. He knew the tests were a load of garbage back then and even more so now. It was the commission's typical power games, but <em> Aizawa's </em>students had gotten hurt this time. </p>\n<p>If Nezu didn't raze the commission for failing to protect U.A.'s students during their \"tests,\" then Aizawa would. </p>\n<p>His fingers twitched, tightening his hold on his capture weapon and thus his students. <em> Please be alright, Midoriya.  </em></p>\n<p> </p>\n<p> </p>\n<p>Entering the emergency room, Aizawa found it in chaos. </p>\n<p>Doctors barked orders as nurses pushed hospital beds with injured children to the required rooms. Farther up, a jam had occurred, people yelling for a bed to move while the hospital staff argued back. Aizawa grit his teeth, glancing down at Yaoyorozu, pale and shivering on the bed.</p>\n<p>This type of chaos was unacceptable. Shoving his way through, Aizawa saw Yagi's blonde hair bobbing as he argued with a doctor and the nurses trying to pull him away from Midoriya's bed. </p>\n<p>The boy tore at the monitors the nurses were trying to apply to him. His movements were erratic and panicked, his teeth gnashing at anyone who got close.</p>\n<p>\"You're causing him distress! You need to go.\" A person yelled at Yagi, ripping the retired hero away from his student. The hero gasped in pain, but Izuku screeched at the lost contact. The resonating tones of his voice hummed through the air, making the teeth in Aizawa's mouth shake and the hairs on his neck rise. </p>\n<p>The nurses and orderlies struggled to hold onto Aizawa's thrashing student. Midoriya fought with every ounce of energy, lightning crackling across his skin. Blackwhip rose from his skin like broken limbs, flopping and snapping at anyone who got too close. </p>\n<p>\n<strong>\"TOSHIEIGHTALLMIGHT!\" </strong>\n</p>\n<p>\"Young Midoriya, it's fine, you're okay. You're safe. They won't hurt you.\" Yagi cried, trying to comfort Midoriya as he was pulled farther away. </p>\n<p>Aizawa activated his quirk on instinct, his eyes burning red and his hair floating upwards. However, like back at the rescue site, his quirk did nothing to stop Midoriya. Instead, the room's temperature dropped rapidly, turning their breath into steam. Pressure gathered around his chest, his lungs struggling to work as the air became too thin. Workers clutched their hearts and throats, struggling to breathe. </p>\n<p>With a slow, terrifying purpose, Midoriya turned his head away from the people failing to restrain him and looked at Aizawa. His hollow, pale eyes caught Aizawa's gaze from across the beds. </p>\n<p>Students said Aizawa's glare was scary- the red glow, the boiling anger. He wondered if the terror Midoriya’'s look inspired in him was the same in his students. </p>\n<p>The boy looked into his soul and saw. </p>\n<p><strong>\"Blink,\"</strong> Izuku ordered, his voice resonating with high and low tones. </p>\n<p>And despite Aizawa's years of heroics (or maybe because of it), he blinked, letting his hair settle back across his shoulders. </p>\n<p>The orderlies and nurses shuddered, gulping in air and bracing themselves against the moving beds. Only Yagi was unaffected. The former number one hero evenly stepped towards Midoriya, hands raised in a non-threatening gesture. </p>\n<p>\"My boy, it's okay.\" Yagi cupped Izuku's cheek and turned Midoriya's face away from Aizawa. \"I won't leave you.\"</p>\n<p>One of the nurses opened his mouth to protest, but Aizawa cut him off. \"Are you stupid?! The boy has been traumatized and drugged. All Might is the only one keeping him calm. Let All Might stay with him. We don't know what those bastards gave him.\"</p>\n<p>The nurse gave him a dirty glare, but the rest moved away. Yagi mouthed a silent thank you to Aizawa before helping move Izuku onto a bed. Izuku clutched his hand the entire time, his wide, blank eyes staring upward at Yagi. Yet, Yagi seemed unconcerned, focusing entirely on Izuku and unaware of the orderlies' and nurses' trembling hands.</p>\n<p>As the nurses wheeled the boy out of the emergency room, an unnoticed pressure on Aizawa's shoulders lessened, and he relaxed with a sigh.</p>\n<p>Almost 6 hours later, Aizawa collapsed outside the nurses' station, bracing himself against the wall. Fumbling through his pocket, he grabbed his eye drops and squeezed the soothing liquid into his burning eyes.</p>\n<p>He was stretched to his limit: his feet ached from running from floor to floor to check up on each student, and his head throbbed from listening to police, doctors, and heroes, each desperately needing to tell him what they'd learned or what was happening. </p>\n<p>If he could, Aizawa would launch his cellphone out of the nearest window, if only to not hear it buzz again. But he couldn't. Despite it peeling away his remaining sanity, all the information was valuable and thus illogical to ignore.</p>\n<p>The center of his forehead pulsed, spreading sharp pain in thin lines towards the back of his head. He needed a nap or his sleeping bag, and he needed it days ago. The children had been missing for four days, and during that time, Aizawa had barely slept six hours. How could he? When once again, his students were in trouble. </p>\n<p>A loud ringtone buzzed, some snappy, popular pop song Present Mic had changed it to, and Aizawa hadn't found the energy to change yet. Squeezing his eyes closed, he answered the call. </p>\n<p>\"This is Eraserhead.\"</p>\n<p>Nezu's cheery voice grated in his eardrums. \"Ah, Aizawa, how are the students?\" </p>\n<p>\"Alive. Shinsou, Uraraka, and Iida are well enough, some scratches and bruises, but nothing they haven't gotten before. However, the doctors are going to keep them on under observation for the next 48 hours before releasing them back into U.A.'s custody.\"</p>\n<p>\"Their parents will be delighted to hear that, as will the rest of your students.\"</p>\n<p>Yes, Aizawa's \"hell class,\" as he had dubbed them after a late night and too many drinks. Those teenagers had gone through more trauma than most professional heroes. And instead of crumbling under pressure, his class had risen to the challenge, creating an ironclad bond. </p>\n<p>Part of him was honestly shocked they'd only spammed his phone with questions about their fellow students instead of breaking out of U.A. and storming the hospital. It helped that the biggest problem child wasn't there spurring them on. </p>\n<p>\"Well, it's not all good news. Yaoyorozu and Midoriya are both still out. The traffickers drugged them with something-\"</p>\n<p>Keyboard clacking. \"It was most likely a variant of trigger. According to the most recent police report, several cases of a previously unknown variant were discovered.\"</p>\n<p>Aizawa swore. \"Of course they did. Well, Yaoyorozu has been showing some of the overdose signs, but she seems better now. They had to put her on oxygen for a bit, gave her benzos, and now she's passed out with a saline drip.\" Sarcasm dripped into his voice. \"But I'm sure you've somehow already gotten ahold of her medical records.\"</p>\n<p>Aizawa swore he could see the rat's tail twitch with amusement. \"Yes, well, it's always nice to reconfirm information with another reliable source. But from what you've told me and what I've learned, it appears that Yaoyorozu will be able to make a complete recovery.\" Papers shuffled near the phone. \"Now, what about Mr. Midoriya?\"</p>\n<p>The hair's on Aizawas neck prickled with unease, and his free hand instinctively rose to his capture weapon. <em> Problem child, </em> he thought.</p>\n<p>\"I don't know much about Midoriya. Yagi told me he was with him, and I've been trying to coordinate everything else with the other students.\"</p>\n<p>\"I see.\"</p>\n<p>Aizawa's hand curled around his capture weapon. Midoriya's reaction had been disturbing. Aizawa had seen the boy's quirk act out in dangerous ways. The sound of the boy's bones snapping during the Sport's festival and blackwhip throwing him through metal pipes made frequent appearances in Aizawa's dreams. But in all of those situations, Midroiya had been cognizant. Not like with this. </p>\n<p>Aizawa's brow furrowed, and he had to fight back a swear. He should have checked up on Midoriya hours ago, Yagi or not. </p>\n<p>\"I'll check on him immediately. I'm sure Yagi could use a break from babysitting duty.\"</p>\n<p>\"I understand, but that said, do not forget to neglect yourself.\" </p>\n<p>\"The students are my top priority,\" he said stiffly, but when no response came, he added, \"I'll try to make time, sir.\"</p>\n<p>He went to end the call when Nezu's voice rang out again. \"And Aizawa? The hero commission has reached out to me offering their condolences for the tragedy that occurred.\"</p>\n<p>\"Their condolences?\" Aizawa hissed. His voice rose loud enough that several nurses peered over the desk, flashing concerned gazes in his direction. He waved them off. </p>\n<p>\"Yes. I believe they will try to visit your students to offer the same. As their instructor and current temporary guardian, you, of course, will want to be there.\" Nezu's words and tone were polite and even, but Aizawa had worked with the rat long enough to know what he wanted.</p>\n<p>\"Of course.\"</p>\n<p>\"Very good. I trust you understand. I'll reach back out later for your report.\"</p>\n<p>\"Yes, sir.\"</p>\n<p>Ending the call, Aizawa let his arms hang limply at his side before banging his head violently against the wall. </p>\n<p>The nurses jumped, and one brave nurse with a mutation that turned her skin a light blue with white dots hesitantly ventured over. \"Are you alright…\" She paused, and Aizawa knew she was taking in his unkempt appearance. But showing professional decorum, she asked, \"Is there any way I can help?\"</p>\n<p>\"Coffee.\" He rubbed his eyes again. \"Coffee and the room number for Midoriya Izuku.\"</p>\n<p> </p>\n<p> </p>\n<p>Aizawa didn't go to Midoriya's room first. Instead, he scrolled through the forwarded police reports and hero debriefings one of his police contacts had sent him. They were incomplete, information sporadic and confusing, but enough to paint an alarming image in Aizawa's mind. </p>\n<p>The trafficking group and all of the bidding villains had already been incapacitated by the time the heroes arrived. He flipped through images of unconscious villains, their clothing shredded in thin slices or their bones snapped in two. None of them were dead, but several were <em> very </em> close. Judging by the bullet holes in the walls and gashes on the floor, several of the villains had put up a fight; it just hadn't helped. </p>\n<p>The villains conscious blubbered and swore about a yokai summoned from the depths of hell or a nomu monster unleashed upon them. Discarding the yokai theory, Aizawa found it highly unlikely that Shigaraki or anyone of his ilk would have wasted a resource like a nomu on rescuing trafficked children. With their benefactor All for One incarcerated, they would be far more careful to not waste such a weapon.</p>\n<p>No… the answer to the defeat of the villain group was obvious. But no one wanted to admit it. </p>\n<p>\"Midoriya,\" Aizawa whispered like a swear, then chugged the scalding coffee the brave nurse had provided him with and stalked off to Midoriya's hospital room. </p>\n<p>When Aizawa entered Midoriya's room, he unsurprisingly found Yagi sitting at Izuku's bedside on a too short, metal stool that had to be killing the retired hero's body. Yet, Yagi sat utterly absorbed, his large hands wrapped around Izuku's, as his thumb rubbed soothing circles. The former symbol of peace looked utterly exhausted, his shoulds hunched and head bowed, keeping a silent watch over his student.</p>\n<p>Aizawa felt an urge to leave, that he was stepping in on something he ought not to. But he shook the feeling off, walking purposefully towards the bed. </p>\n<p>Yagi looked up, dark eyes ringed with bags. \"Aizawa,\" he croaked. \"How are the other students? Are they alright?\"</p>\n<p>\"The others are okay, but Yaoyorozu is in bad shape. The doctors are trying to help her through the detox, but it isn't pretty. Whatever they gave her and Izuku is seriously messed up. From what Nezu, the doctors, and everyone else has to say, it sounds like it's a suped-up form of trigger, but we won't know for certain until the lab results are back.\"</p>\n<p>Yagi slumped, a heavy sigh pulled out of him. \"What a mess.\"</p>\n<p>Aizawa grunted in agreement. \"The others want to see Izuku–\" which was an understatement considering how they'd practically clung to his legs begging him– \"but I told them later. From what the doctors told me, Midoriya has reacted in an odd way.\"</p>\n<p>\"Trigger does that sometimes.\"</p>\n<p>\"You don't have to tell me. I had some dealings with the Ideo trigger case years ago. It's psychotropic in nature, but,\" Aizawa gestured to Midoriya, \"I've never seen anyone react as he did.\" And that was an understatement considering the howling, destructive force of nature Midoriya had turned into. </p>\n<p>Yagi shifted, unwilling to meet Aizawa's eyes. </p>\n<p>Aizawa's eyes narrowed, and he stepped closer to Yagi. \"You wouldn't happen to know anything, would you?\" When Yagi stiffened, Aizawa knew he had something. \"You've always been closer to Midoriya. Even from the first day with the ball test, you were watching him. I haven't pried because it's not my business, and it didn't seem to harm anyone. But-\" Aizawa rested his hands on the bed's rails, fixing Yagi with his sternest look, \"if you know something, anything that could help us help Midoriya, I need to know.\"</p>\n<p>Yagi's eyes flashed towards Izuku, pale, sweaty, and asleep in the bed. Like this, the boy didn't look like a capable hero in training, but a hurt child, struggling for his life. Yagi's shoulders sagged, and his many years lay etched on the creases of his face. It was the heartbreak of a father. </p>\n<p>Aizawa pounced on the momentary weakness. \"He didn't sound like himself, wasn't acting like himself. It was like there's something else influencing him.\"</p>\n<p>Yagi winced. \"Trigger does that sometimes. I don't know what's going on.\"</p>\n<p>\"But you know something.\"</p>\n<p>\"I-\"</p>\n<p>Midoriya's shifted on the bed, and two heads whipped towards him. The boy shifted again, his sweaty brow furrowing in discomfort. Yagi sprang to his feet, placing a hand on Midoriya's shoulder. \"Young Midoriya, are you awake?\"</p>\n<p>Midoriya's eyes fluttered, giving Aizawa glimpses of bone white and then flashes of bright colors. Finally, the boy's eyes opened to their normal green as Midoriya hazily looked around the room before settling on Yagi.</p>\n<p>\"<strong>T</strong>t-\" Midoriya coughed weakly. <strong>\"To</strong>sh<strong>i</strong>no<strong>ri?</strong>\" His voice was hoarse and still had hints of the echoing undertones he had spoken with during the raid.</p>\n<p>\"I am here. It's okay now. You're safe.\" </p>\n<p>But Midoriya shifted in bed, tugging at the heart rate monitor and the saline drip. \"<strong>N</strong>o,\" he muttered. \"N<strong>o</strong>,<strong> no.</strong>\" His voice warped again, and a cold mist curled up off his body, its chill spreading through the room. </p>\n<p>\"Midoriya, it's alright. You're okay.\"</p>\n<p><strong>\"Eight,\"</strong> Midoriya said, his voice a chorus of different tones. <strong>\"Eight and nine, and one, two, three, four, five, six, seven we are.\"</strong></p>\n<p>Aizawa's hands shifted to his capture weapon, and he angled his body towards the door. This wasn't Midoriya. He didn't know if it was the drug or something else, but the hairs on his neck were rising, and his legs tensed in preparation to run from this<em> thing </em>that was his student. </p>\n<p>Midoriya sat up, sparks of green crackling over his skin as he ripped out the saline drip and heart monitor reader. The machine spasmed as Midoriya moved, the rate line continuing to pulse in screeching lines despite the missing connection. </p>\n<p>\"Young Midoriya, you need to sit down-\"</p>\n<p><strong>\"Where are they?\"</strong> Midoriya demanded, his eyes now sightlessly glazed over.<strong> \"Where are they?! They can't have US or THEM!\"</strong> His quirk sparked more angrily, flashing and popping around Yagi. Yet, to Yagi's credit, he stayed calm, speaking soothing words as he tried to guide Izuku to lay back down. </p>\n<p>But the worried flash of blue eyes he sent Aizawa was clear enough. <em> Get help. </em> </p>\n<p>Aizawa inched closer to the door, using his participation in ambushes to soften his steps and quiet his presence. <em> This is wrong, </em> he thought as Yagi tried to stop Midoriya from crawling over the bed's bars. <em> Very wrong.  </em></p>\n<p>A meter away from the door, he stretched his hand out, ready to open it and slip out for help when the door was flung open. </p>\n<p>All hell erupted. </p>\n<p>The intruder was a nurse, probably coming in to check on the patient who was showing readings for a corpse and not a threat. But the sound and emotion were enough to snap whatever thin line of calm Yagi had holding Midoriya. </p>\n<p>Midoriya's quirk flared, a ripple of energy exploding out from him, knocking over medical equipment, the chairs, bed, and even throwing Aizawa into the wall with a painful crunch, and making him lose consciousness for a couple of seconds. The taste of tile in his mouth and the feeling of something warm and sticky at the back of his head woke him up. Aizawa braced himself on the wall and stumbled to his feet, feeling blood sluggishly drip down his neck.</p>\n<p>Midoriya and Yagi were gone, and a gaping hole in the wall was evidence of their destructive exit. Jumping through the hole, he followed the screams and crashes. Farther down the hall, Izuku floated midair, tendrils of blackwhip throwing nurses and doctors out of the way and tugging Yagi along as if on a leash. </p>\n<p><strong>\"Where are they!?\"</strong> Midoriya screamed. The lights crackled with his words flashing from light to dark, and mist poured off of Midoriya's limbs. </p>\n<p>\"My boy!\" Yagi was yelling through the sound of destruction. \"It's alright! You have to calm down.\" </p>\n<p>Aizawa gripped his capture weapon and activated his quirk, his hair floating skyward, similar to Midoriya's hair. Like the last two times, Erasure did nothing, as Midoriya turned midair, a feral snarl across his face. There was no recognition in those glossy eyes or in the predatorial way he moved towards Aizawa. </p>\n<p>Aizawa staggered back. He'd gotten his student's attention off of the nurses, but now that it was on him, his mind blanked. During training, he'd seen how Midoriya's attacks obliterated concrete walls and steel buildings, much stronger things than Aizawa's flesh body held together by thin strands of anxiety, coffee, and duty. </p>\n<p>\"Midoriya!\" Aizawa barked, trying to channel his inner disapproving teacher. It was the voice he used when he was one outburst away from expelling his entire class. </p>\n<p>Midoriya floated closer. Dressed in the paper-thin hospital gown, Midoriya's arms and ankles were bare, revealing the blotchy purple scars on his arms and hands and the unnaturally pale color of his skin. </p>\n<p><strong>\"Where are they?\"</strong> Midoriya asked again. <strong>\"Do they have them? The ones who wanted to control us?\"</strong></p>\n<p>\"What are you talking about? Who is 'them'? The traffickers?\" </p>\n<p>But Midoriya didn't appear to hear Aizawa. His face twisted in unholy fury, his typically sweet smile twisted into a snarl. <strong>\"They tried to control us. They wanted us, like him. The one who started this all, who made us! But we will not let them!\"</strong></p>\n<p>Midoriya raised his arm, toxic green lightning covering the length of it. Yagi was yelling something, but Midoriya wasn't listening.<strong> \"We will not let him win. We want them!\"</strong></p>\n<p>\"Who is them!!?\"</p>\n<p>But Midoriya drew his arm further back, and Aizawa knew that he would release that destruction on him and the hospital, and in desperation, he yelled, \"Come on problem child!\" </p>\n<p>Midoriya blinked, his face momentarily flashing from god-like wrath to scared innocence and worry. \"<strong>M</strong>r. A<strong>iza</strong>wa?\"</p>\n<p>\"Yes! Yes, kid, it's me. Just calm down-\"</p>\n<p><strong>\"They hurt them!\"</strong> Heavy tears dripped down Midoriya's pale cheeks. <strong>\"The</strong>y hu<strong>rt the</strong>m, an<strong>d I le</strong>t them, an<strong>d I</strong> do<strong>n't</strong> kno<strong>w</strong> w<strong>he</strong>re th<strong>e</strong>y a<strong>re.\"</strong> His feet touched the ground, and Midoriya crumpled to his knees. Alone on the tile floor, the boy sobbed, his hands buried in his hair. \"I c<strong>an'</strong>t los<strong>e</strong> t<strong>he</strong>m.\"</p>\n<p> Hesitantly, Aizawa stepped closer, his posture low to the ground and his arms spread wide. \"Who Midoriy-\"</p>\n<p>But a shrill \"DEKU!\" interrupted his words. </p>\n<p>Uraraka, Iida, and Shinsou hurried through the hallways, leaping over fallen equipment and knocked-out medical personnel.</p>\n<p><em> Go away! </em> Aizawa wanted to yell. <em> It's not safe, and I can't let you get hurt again.  </em></p>\n<p>But his stupid, heroic students ran faster as Midoriya blinked dazedly. \"You're okay?\" Blackwhip flared out of him, snapping around Aizawa's students and flinging them towards him. To their credit, they didn't scream but let themselves get dragged closer until Uraraka, Iida, Shinsou, and Yagi were all pulled tight around Midoriya.</p>\n<p>\"Safe,\" Midoriya muttered. \"Safe, safe, they're safe. They're gone. He's not here. They're safe.\" He was slumped into himself, the crackle of his quirk gone. </p>\n<p>\"Yeah, Deku. We're safe. It's okay now.\" She cupped his cheek when Midoriya shook his head in fear. \"Yes, we're safe.\" She nudged Midoriya into Yagi's arms, letting the man wrap himself around the boy.</p>\n<p>Iida's eyes were misty. \"We're safe, Midoriya, thanks to you. You don't need to fight anymore.\"</p>\n<p>Shinsou nodded towards Aizawa. \"They're got heroes watching over us. Mr. Aizawa won't let anything happen to us.\"</p>\n<p>Something in Aizawa's chest shattered as Midoriya looked up at him with those once again normal, green eyes and relaxed. It was the look of a hurt, stray kitten when it saw your outstretched hand and knew it could trust you.</p>\n<p>The boy's quirk snuffled out, and Midoriya collapsed into Yagi's arms, surrounded by the \"them\" he had been looking for. </p>\n<p>Thankfully, with the other children around, Midoriya stayed calm when the nurses approached and pricked him with a needle. The sedative worked quickly, pulling Midoriya into sleep and sending him slumping against Yagi. </p>\n<p>The nurses, along with Yagi, helped transport Midoriya back to his room while Aizawa was left with his problematic students in the destroyed hallway. </p>\n<p>Iida threw himself into a 90-degree bow, apologizing profusely, \"I'm so sorry, Mr. Aizawa. I recognize that you asked us to stay in our hospital room, but as heroes-in-training, we could not in good consciousness leave our friend to suffer alone. Any hero would have heard his cry for help and responded.\"</p>\n<p>\"What he said,\" Shinsou added. </p>\n<p>Aizawa pinched the bridge of his nose and tried to even his breathing. Now was not the time to go ballistic or wrap his students up in seven layers of his capture weapon until they could hardly wiggle a toe. No… now was the time to remain calm. </p>\n<p>\"If you ever do something so reckless again-\" he struggled for an adequate threat. \"I will expel you.\"</p>\n<p>His students exchanged a look and schooled their features into contrite expressions. </p>\n<p>\"Yes, Mr. Aizawa,\" Uraraka said, her tone sweetly innocent. </p>\n<p>Aizawa swore internally, knowing that his students had no such intention of following his wishes. When had he gotten so soft? Typically a threat like that had his students trembling in fear. </p>\n<p>\"Go back to your rooms,\" he ordered, and Uraraka, Iida, and Shinsou promptly turned heel and slipped back to their rooms without complaint. That didn't mean Aizawa trusted them. He followed after to make sure they obeyed, giving each student a firm glare as they got back into bed. </p>\n<p>\"Stay,\" he ordered. But he knew it was useless. Hero students were like cats, you could try to order them all you wanted, but ultimately they did what they wanted to do. </p>\n<p>Aizawa lingered outside of Uraraka's room, watching the brunette pull the sheets back over and get settled on her pillow. </p>\n<p>\"Deku will be alright, won't he?\" she asked. </p>\n<p>Aizawa didn't respond immediately. \"I don't know.\"</p>\n<p>\"They gave the same drug to Yaoyorozu, you know. We watched.\" A shadow crossed over her face. \"But Deku didn't react like her. She became pliant and dazed. But Deku… it was like something woke up inside him.\"</p>\n<p>\"You mentioned that back at the raid site.\" </p>\n<p>Uraraka continued on, her eyes staring into some nightmarish scene they had been forced to live through. \"He was like an avenging angel. So angry. Angrier than I'd ever seen before. And I think a little scared. I actually wondered for a bit if he would kill them.\"</p>\n<p>Aizawa tried to feign nonchalance, crossing his arms and leaning against the door frame. This information was new and terrifying, but he couldn't let her know. \"But he didn't. Why not.\"</p>\n<p>\"I asked him not to. And it was like there was a war inside him over what to do, but he took my hand and led all the other captured children and me out.\" </p>\n<p>\"Were you scared?\"</p>\n<p>Uraraka's eyes narrowed, and her voice sharpened. \"Of course. Anyone would be. But I know Deku. Whatever happened to him, whatever woke up… he's still in there. He was the one who saved us. Don't let anyone tell you otherwise.\" </p>\n<p>In that instance, Aizawa could see the strong, confident hero Uraraka would someday be. Confident, calm, and fiercely protective of all. He nodded and turned away. </p>\n<p> </p>\n<p> </p>\n<p>The next 24 hours were calmer but no less busy. </p>\n<p>As 1A's teacher, he has field questions and requests from nagging, demanding sources with (what he considered) an admirable amount of tact considering his lack of sleep. </p>\n<p>Police, doctors, and heroes were constantly calling for Aizawa's attention, asking for information or giving briefings on the situation. Nezu had requested that the raid documents be written in a way that suggested a nomu had broken in and attacked the villains, sweeping the hero students' involvement under the rug (and, in this instance, piles of paperwork). </p>\n<p>Unfortunately, it was for the best. Midoriya hadn't woken up yet, and that type of outburst could cause concern from the higher-ups. As it was, the hero commission had found Aizawa's phone number and spammed it with test messages and phone calls demanding information and offering their paltry condolences. Aizawa hadn't bothered responding. They weren't worth the effort. </p>\n<p>More unpleasant were the visits from parents. Families that Aizawa had promised the safety of their children and failed. It didn't matter that the hero commission had ordered the training far away from U.A.'s borders or that the teachers hadn't been allowed to attend–these were Aizawa's students, and he'd failed them. No one had yelled at Aizawa, but every shed tear and sob of relief stabbed into his guilty heart. </p>\n<p>The reunions were brief. The reduced students and trafficked children's location was a secret kept from most heroes and police as an additional measure to protect them. So families were allowed enough time to hug their children, have a brief conversation, and then be ushered away. Nezu had promised that longer reunions would be possible once back at U.A., but it still seemed unfair. </p>\n<p>Thankfully, Aizawa's students were recovering well. Yaoyorozu was beginning to stir as the drugs left her system, and the doctors were confident that she would be recovered by the end of the week. It was the type of good news that left Aizawa's legs wobbling in relief. He hadn't lost a student. Not yet. </p>\n<p>But Midoriya… ever the problem child, was cause for concern. </p>\n<p>The doctors had been keeping him sedated, but the quirk outbursts hadn't stopped. Green lightning crackled over his skin at intervals, and sometimes the boy's lips would move in silent conversation. Even his room had been experiencing issues. The room remained chilly despite the thermostat being programmed to a high setting, and the light frequently flickered. </p>\n<p>Already, Midoriya had been moved to three different rooms, and yet the problem persisted. The doctors and nurses had begun whispering rumors about it when they thought no one could hear. Nothing hurtful yet, but it mirrored the unease everyone felt. </p>\n<p>Something was coming. Everyone could tell, even if they didn't know what. And it wasn't until a perfectly nondescript hero commission personnel stepped into the hospital that Aizawa recognized the source of his growing dread. </p>\n<p>Thankfully, Aizawa had been preparing and had requested that he be informed the moment a hero commission officer entered the hospital. However, even sprinting up the stairs and using his capture weapon to propel himself, he was unable to reach the official before he entered Midoriya's room. </p>\n<p>\"Excuse me,\" Aizawa called, trying to mask how out of breath he was. </p>\n<p>The official ignored him, walking over to Midoriya's bed, but Aizawa slammed a hand down on the official's shoulder. \"Excuse me,\" Aizawa said, \"But this room is off-limits.\"</p>\n<p>The official turned, his face flashing in irritation before schooling into one of pleasant neutrality. \"Oh, forgive me. I didn't expect my visit to be a problem. I'm on hero commission business. They've requested that I check in on the injured students.\"</p>\n<p>Aizawa grit his teeth. \"That may be, but as their teacher, I am responsible for their well-being, and you should have checked in with me before entering their rooms.\" </p>\n<p>\"My apologies,\" the commission official said, not sounding contrite at all. “I am Takahashi Akemi of the hero commission. I was placed in charge of investigating this incident, and I look forward to your cooperation.\"</p>\n<p>Aizawa narrowed his eyes, analyzing the official. Takahashi was one of the commission's photocopy officers, dressed in a simple business suit. His hair was perfectly combed, laying neatly over his forehead, and glasses sat perched on his nose. The only visible sign of a quirk was the pointed tips of his ears and the silver color of his tongue. At a glance, he didn't look like a threat, but the commission was not to be underestimated. </p>\n<p>Aizawa slowly moved his way around Takahashi to stand in front of Midoriya. The boy was still sedated as he continued to flush the drug out of his system, and unfortunately, this was one of the rare instances Yagi was gone, having left only an hour ago to swing by his apartment to refresh. It was up to Aizawa to hold off the commission. </p>\n<p>\"My students are not to be disturbed at this time. They are still healing from the attack during the commission's training and their subsequent kidnapping.\" </p>\n<p>\"Yes, it is unfortunate the number of incidents U.A. students have been in.\"</p>\n<p>Aizawa's jaw ticked, and he stuffed his hands in his pockets to hide the popping veins. \"If I remember correctly, this time they were injured and even captured while under commission authority. I assume that's why you're here, to offer your condolences and explain the commission's purpose behind the surprise training.\" </p>\n<p>Takahashi's silver tongue flickered. \"Yes, of course, it is unfortunate that villains were responsible for the hero students' injuries. Although it is more shocking that U.A.'s famous students were unable to protect themselves adequately. Perhaps the commission will need to look into U.A.'s teaching programs and teachers.\" </p>\n<p>But Takahashi wasn't done. \"You have sponsored student Yaoyorozu, who showed more promise than anyone in the class, as well as a second-generation hero Iida- yet with such strong beginnings, they managed to get captured so easily. Maybe they aren't as talented as people assumed. More than likely, though, you're just a bad teacher. With that being the case, it's more of a reason for the hero commission to step in.\"</p>\n<p>\"That's what that training was about? Recruitment?!\"</p>\n<p>The hero commission official opened up his briefcase, taking out a stack of papers. \"U.A. has maintained a monopoly over hero training for too long, and the training was an attempt to test the merit of their students. It is our duty to safely steer the next generation of heroes, and we believe that the commission can do so.\" He handed the papers to Aizawa, and Aizawa took them, holding them as if they were one of Bakugou's grenades. </p>\n<p>Aizawa flipped through the papers, his brow furrowing and his quirk activated instinctually. \"These are transfer forms. You're trying to take my students?!\"</p>\n<p>\"We're simply trying to give them the care they deserve. And quite frankly, I'm shocked. I would never have assumed the underground hero Eraserhead would be so protective. If that is the case, you should be thrilled by this opportunity we're granting them.\"</p>\n<p>Aizawa felt like the ground was shifting under his feet. He knew the commission had been planning something, but he hadn't expected this. \"You can't do that. Legally, you can't just take them,\" he snapped. </p>\n<p>\"We simply need their written consent. And after everything U.A. has submitted them to, why wouldn't they agree? We can offer them so much more.\"</p>\n<p>Behind Aizawa, Midoriya stirred, his brow twisting in pain. The boy shivered in his sleep, goosebumps rising and his breath twisting in a cold puff. Aizawa's eyes lingered on Midoriya's arms and hands, the jagged, pink scars from past breaks standing out against the white hospital sheets. A single tendril of blackwhip curled out from Midoriya's knuckles, snaking towards Aizawa as if in encouragement. </p>\n<p>But Aizawa didn't need any encouragement to oppose the hero commission. Every cell of Aizawa's body rebelled against the hero commission taking control of his students. Five of his students were in the hospital because of the commission, and yet they thought they could take Aizawa's students? He would rather sacrifice his eyes than see his students go with them. </p>\n<p>Takahashi, unaware of Aizawa's growing fury, continued on. \"We'd like to speak with Yaoyorozu, Iida, and potentially Uraraka right now, and we're planning on contacting 1A to speak with several more of your students. We won't take them all–some have displayed values or have… physical mutations that are less than desirable in heroics. Or…\" and Takahashi glanced at Midoriya, \"have injured themselves beyond use.\" </p>\n<p>The man blathered on, but his words rang in Aizawa's ears. </p>\n<p>\n<em> Less than desirable. </em>\n</p>\n<p>A cold chill ran across Aizawa's arms, and above him, the lights flickered, but he couldn't care less. The lack of sleep pressed on his eyes and nerves until the stress he had been trying to contain and channel towards protecting his children bubbled up. He had been willing to pretend at politeness before throwing the official out, but Takahashi had crossed the line. </p>\n<p>\"What did you say?\" </p>\n<p>The ice in his voice was enough to freeze Takahashi's speech. Takahashi's lips curled in irritation over being interrupted. \"Yes, did you have a question?\"</p>\n<p>Aizawa stepped towards the official, and the man, in pure idoticism, did not run away. \"What makes a hero?\" Aizawa asked, his voice dangerously soft and even. </p>\n<p> \"What? I don't have time to waste on this-\"</p>\n<p>\"What makes a hero?\"</p>\n<p>Takahashi's lips thinned. \"I would assume a U.A. hero such as yourself would know what makes a hero, but I suppose that is why the commission's services are in need. A hero has a strong quirk, good communication skills, willingness to accept orders, a winning personality, plenty of discipline and self-restraint, sharp intellect—all things that the hero commission is well equipped to teach U.A.'s students.\"</p>\n<p>\"Wrong.\" Aizawa snapped, allowing no corrections. \"Those are the attributes a good hero has, but they are not what makes a hero.\"</p>\n<p>\"Says the failed underground hero. What could you know about-\"</p>\n<p>Aizawa held up a hand silencing him and stepped forward until he loomed over the official. \"A true hero cares about others and tries to help them. That's all. It does not matter if they have what your commission considers <em> less than desirable traits </em> because, at the end of the day, a hero helps others. So how dare you—\" Aizawa quirk activated on instinct as his voice grew louder—\"insinuate that <em> my </em> students are not worthy of being heroes!\"</p>\n<p>The lights in the room flickered, shadows danced along the walls, and the chill had built to near-freezing levels, but Aizawa didn't care. He threw out his capture weapon, cinching the bindings tights around Takahashi's chest, and lifted him up into the air. Takahashi's feet dangled above the ground, fog lapping at his toes. The man was blustering, but Aizawa silenced him with a single glare. </p>\n<p>\"I heard your request, but I see I was mistaken in doing so.\" Aizawa flung Takahashi to the other side of the room and threw the transfer paperwork at him as well, the stack hitting the official in the face. \"Get out of my sight.\" Aizawa spat. \"I don't ever want to see you near my students again.\"</p>\n<p>\"How dare you!\" Takahashi yelled. \"I am a commission official, and I…\" his voice trailed off, his eyes widening. </p>\n<p>The back of Aizawa's neck prickled, and he turned around to see Midoriya sitting up in bed; green lightning crackled over his body, making his hair stand tall. His eyes, awful and blank and white, were fixed on Takahashi.</p>\n<p>\"Wh-what is that?!\" Takahashi gripped his paperwork. \"What is that!?\"</p>\n<p>Midoriya opened his mouth, and fog dripped out, dribbling onto the floor and creeping towards the official. <strong>\"Get out. Now.\"</strong></p>\n<p>The lights shattered in response, the glass spraying the two of them. Takahashi stumbled to the door, his face ghost white and his hands shaking. Tiny cuts from the glass splayed across his face. \"This isn't over,\" he warned, but his voice squeaked at the end, and he tripped over his feet in his haste to leave.</p>\n<p>Midoriya turned to Aizawa, blinked, and then collapsed back into his hospital bed like a puppet with its strings tossed as if he had never woken. </p>\n<p>Aizawa stood standing guard over Midoriya until Yagi returned, freshly showered in a new change of clothes. </p>\n<p>\"What happened?\" Yagi asked upon seeing Aizawa's face. </p>\n<p>\"Hero commission. And Midoriya.\" Aizawa grunted, already striding towards the door. \"Call me if you need anything. The lights shattered again, and the thermostat broke too. At this point, it's probably Midoriya's doing somehow, but I can't be bothered to deal with it.\"</p>\n<p>And before Yagi could say another word, Aizawa was out the door. </p>\n<p> </p>\n<p> </p>\n<p>\"Aizawa, I owe you an apology.\"</p>\n<p>From his resting place underneath Izuku's hospital bed. Aizawa looked up. Yagi stood towering above him, hands clamped together, a wide, earnest look in those shaded eyes. </p>\n<p>\"For what?\" Aizawa grunted. </p>\n<p>\"I… am not one to trust easily. In my line of work, those I trust too often end up hurt.\"</p>\n<p><em> We're in the same line of work, </em> Aizawa wanted to snap, but white, cloudy hair flashed in his memory, and he kept his mouth shut. Aizawa was guilty of the same, in his own way. He always tried to hold his students at a distance. Train them, yes. But a close relationship? No. He couldn't bear it if they ended up broken and dead, buried under the remains of a building.  </p>\n<p>When Aizawa didn't immediately snap at him, Yagi continued. \"I know it can be a problem sometimes, and I am working on it. But I believe for that reason, I've been hesitant about speaking about Midoriya. Not that I don't trust you!\" He hurriedly tried to explain. \"But my relationship with young Midoriya is different in a way, and it has caused me to be more….\"</p>\n<p>\"Parental?\" Aizawa drolled. </p>\n<p>The blood that rushed to Yagi's face turned him bright red, just like Midoriya when he got flustered. The former hero exploded into a hacking, bloody cough as he struggled for words. \"No, but, no. Our relationship isn't like that. Well, maybe but, he's a good boy, and he's grown so much, and I've only tried to mentor him as he should-\"</p>\n<p>\"You know, you're starting to pick up Midoriya's mumbling habit. Maybe Todorkoi's theory is right, and you actually are his father.\"</p>\n<p>The fountain of blood that erupted from Yagi's mouth would have sent any nurse running and Recovery Girl fuming mad. Still, Aizawa took pleasure in how flustered the former symbol of peace became, struggling to find a place to look that wasn't Aizawa or Midoriya.</p>\n<p>Finally, when it looked like Yagi was about to kneel over out of sheer embarrassment, Aizawa spoke back up. \"Relax, Yagi. No one is accusing you of anything. Though I'm assuming what you wanted to share with me isn't that your Midoriya's father?\"</p>\n<p>Yagi dabbed at his mouth with a handkerchief, his face still crimson. \"No, no, it wasn't. But I suppose that it does explain my….\"</p>\n<p>\"Tendencies to hover around Midoriya?\"</p>\n<p>\"...Yes.\"</p>\n<p>\"So, what is it?\"</p>\n<p>Yagi stared at Aizawa lying in his sleeping bag until Aizawa got the hint. He sighed, unzipping his bag and getting to his feet. \"Not wanting to do it here?\"</p>\n<p>Yagi glanced at the sleeping Izuku. \"I don't want to disturb him.\"</p>\n<p>\"He's been given enough drugs to knock you out in your prime. But fine, we can go elsewhere.\"</p>\n<p>Aizawa got to his feet, zipping back up his sleeping bag and tucking it under the hospital bed. </p>\n<p>Yagi stood over Izuku, his hands resting on Izuku’s. \"It should be his choice to tell you since it's his quirk now,\" Yagi whispered. His face pulled down in resignation. \"But I suppose you should know the truth behind young Midoriya's quirk… and my former quirk, but not here.\" Yagi gave Midoriya's arm a final, gentle squeeze. \"Let's step outside.\"</p>\n<p>Aizawa’s mind churned through potential meanings to Yagi's words as he followed Yagi to the door. Sidestepping the many machines attached to Midoriya, he almost missed the black blur darting past him. </p>\n<p>\"Yagi!\" he yelled in warning, but the black blur whipped around Yagi's forearm before either of them could react. </p>\n<p>The black strand tightened, tension leaving the strand taught from its anchor around Yagi's arm back to its source- sprouting from a still asleep Midoriya. </p>\n<p>\"Blackwhip?\" </p>\n<p>Yagi tried to peel the whip off his arm, but the black energy shifted in turn, creeping up Yagi's arm. </p>\n<p>\"Uh, Aizawa?\" Yagi asked as he futilely pulled at the strand. \"Can you…?\"</p>\n<p>\"I'm not erasing it, not after the last several times.\"</p>\n<p>Another whip streaked past, locking onto Yagi's leg. The retired hero coughed blood in surprise as the strands tightened, pulling Yagi back with stumbling steps to Izuku. Yagi fought valiantly, trying to peel the strands off but failing as he was tugged step by step back towards Izuku. </p>\n<p>Aizawa was unsure whether to smirk at Yagi's bafflement, bang his head against the wall, or shiver in terror. Regardless, Yagi was dragged back to Midoriya's bedside, where the boy lay asleep and oblivious to Yagi's growing embarrassment and panic. </p>\n<p>\"My boy,\" Yagi whispered, hands hovering over Midoriya's shoulder. \"You need to let go.\"</p>\n<p>The boy shuddered in his sleep, and green lightning crackled over his skin. Yagi gave an undignified yelp as he was yanked up over the bars of the hospital bed, right next to Midoriya. Yagi's face turned a bright red as he struggled onto his hands and knees, trying to crawl back off the hospital bed. But blackwhip tightened and dragged Yagi right back to laying at Midoriya's side. </p>\n<p>Aizawa buried his face in his capture scarf, trying to hide his amusement at Yagi's baffled face. </p>\n<p>\"I'm sorry, Aizawa,\" Yagi managed, \"I don't think he's going to let go.\"</p>\n<p>\"Obviously.\"</p>\n<p>The act itself was amusing. Watching Yagi struggle to escape only to resign himself to his fate as blackwhip tugged him back to Midoriya's side every time was an odd sort of entertainment. But the underlying implication was more unsettling. Midoriya was out and under the influence of a powerful drug, and yet his quirk was acting with enough consciousness to snag and drag Yagi back to Midoriya. </p>\n<p>Yagi adjusted himself on the bed, moving wires and monitors out of the way. Thankfully blackwhip allowed him to do so, tightening around Yagi's arm and side only after Yagi had braced several pillows behind his back. </p>\n<p>Yagi sighed, rubbing his neck. \"Alright, this wasn't what I intended, but it'll be fine. As I said, Aizawa, I owe you the truth.\" He hesitated. \"Midoriya's quirk is unique as he was not born with it. It is a sacred mantle that has been passed from generation to generation. I was the eighth holder. Midoriya is the ninth.\"</p>\n<p>\"He was calling you that before. Eight. As is in the eighth holder.\"</p>\n<p>Yagi nodded, \"Yes, I was the holder of One for All before passing it onto Midoriya.\" </p>\n<p><em> One for All. </em> Suspicion curled in Aizawa's gut, \"Similar to the villain at Kamino.\"</p>\n<p>\"It was created by him, but has been wielded as a weapon against him, the only quirk he cannot steal, that is destined to be his downfall. That is the truth I wish to share with you, Aizawa, the story behind the origins of One for All.\"</p>\n<p>Having declared his purpose, Yagi's hesitance evaporated, his nervous voice replaced with that of will and determination as he explained the story of two brothers and their eventual division. He described a conflict that had spanned centuries, a war, and a goal passed from hero to hero. Some of the past wielders Aizawa had heard of, others he had not, but all had died in the pursuit of stopping villainy. </p>\n<p>By the time Yagi explained how he had received the quirk, Aizawa had decided that no amount of sleep would help him feel better. Aizawa's head pulsed with every word falling from Yagi's mouth. </p>\n<p>He wished it was a lie. But there was no coming up with anything this crazy. </p>\n<p>A quirk passed down from generation to generation, preserved for the sole purpose of defeating that monster of a villain at Kamino ward. A quirk Midoriya now had. </p>\n<p>Aizawa rubbed his eyes, pressing his fingers hard against his eye sockets. \"Problem child with a problem quirk. I should give both of you detention for a year.\"</p>\n<p>Yagi spluttered but didn't deny Aizawa's words. </p>\n<p>It was impossible not to look at his student prone on the bed and trembling minutely. Midoriya's face was a sickening white, flesh sunken in around the bone. Every breath rattled in the boy's chest as if existing was a struggle. He looked so… fragile. And yet, if Yagi was to be believed, the boy held the greatest power in the last several centuries. </p>\n<p>Bitterness clung to Aizawa's tongue, and hot fury burned his throat. Even though Aizawa understood why Yagi didn't, Yagi should have told Aizawa long ago. Aizawa raced through his memories, looking for hints that could have revealed the truth sooner. He couldn't help but feel that he had failed his student. </p>\n<p>A thud sounded behind him, followed by a pained squeak and muffled protest.</p>\n<p>Aizawa shot to his feet, hands gripping his scarf. \"Stay with Midoriya,\" he ordered Yagi with his eyes. </p>\n<p>He flew towards the bathroom where the sound had originated, cursing himself. He was tired, and it was making him stupid and careless. He should have checked the location before making Yagi divulge such a secret. </p>\n<p>With a wood-cracking force, he kicked the bathroom door in, quirk already activated and scarf swirling around his neck. </p>\n<p>Inside, Uraraka, Iida, and Shinsou sat wide-eyed, staring up at their teacher with poorly concealed terror. </p>\n<p>Shinsou made the poor decision of attempting to speak first, \"Uh, hey Sensei, fancy seeing you here.\"</p>\n<p>Aizawa slammed his head against the doorframe. He banged it again for an extra measure before turning his full exhausted force on his students. \"What are you doing here?\"</p>\n<p>Iida dropped into a low bow, \"Apologies, sir. We were concerned about the welfare of Midoriya. We had simply meant to briefly check on him, but we had heard footsteps in the hallway and hid in the bathroom.\"</p>\n<p>\"You mean when I came in? That was two hours ago.\"</p>\n<p>\"You looked tired... well more than usual,\" snarked Shinsou. \"We didn't want to wake you up.\"</p>\n<p>\"How much of the conversation did you hear?\"</p>\n<p>The three students shuffled, glancing at each other in an obvious attempt to determine what to say. </p>\n<p>\"We heard all of it,\" Uraraka admitted. \"And we had planned on leaving once we realized it was more personal, but then we heard All Might mention One for All, and then we had to stay.\"</p>\n<p>Yagi coughed. \"One for All?\"</p>\n<p>\"We hadn't told you yet. It didn't seem appropriate, and we wanted to speak with Midroiya first, but we heard him say that name while at the auction.\"</p>\n<p>Aizawa raised his hand. \"Wait. Before you go any farther.\" Aizawa pulled out the spare chairs and stools in the room, organizing them in a circle around a bed. \"Sit,\" he grumbled, and his students hesitantly crept forward. \"Now, what do you mean you've heard this name before.\"</p>\n<p>\"It was after those deplorable villains drugged Midoriya, right before the heroes raided the building.\"</p>\n<p>\"You heard what Midoriya was like… right?\" Uraraka asked. </p>\n<p>Aizawa pressed his lips together. \"I've heard rumors. The villains at the auction were decimated. The police reports have called it a nomu attack. But from my understanding, it was Midoriya.\"</p>\n<p>\"It was,\" Uraraka confirmed. \"Yaoyorozu got drugged, and it was bad, but with Deku-\" she shuddered, \"it was scary. It was him, but it wasn't, and he was hanging there like he was dead. White skin, black veins, quirk activated, blank eyes. It was like how he freaked out in the hospital but worse.\"</p>\n<p>Yagi's hold on Midoriya tightened. The pro hero looked moments from marching down to the police station and beating up some villains. Aizawa would be lying if he didn't admit to feeling the same. </p>\n<p>\"I found him in the fog and managed to convince him to escape. We went through the tunnels underneath the stage. That's where we found Iida, Shinsou, Yaoyorozu, and all the other kidnapped children.\"</p>\n<p>\"So when did you hear the name One for All?\" Yagi asked. \"Who said it?\"</p>\n<p>\"Midoriya did,\" all three students said. </p>\n<p>\"Towards the end, the auction guy showed up. He was waving around his gun, threatening to take away Midoriya's quirk, and Midoriya went psycho on him. Midoriya said-\" Shinsou deepened his voice, taking on a spooky tone. \"We are One for All, the generational quirk. We won't be bought, taken, sold, I don't know, something along those lines.\"</p>\n<p>Iida chopped his hand. \"There was a pressure as he said those words. A weight of power and authority. We didn't intend to hide the truth, but we felt obligated to Midoriya to wait for him to wake up so we could ask.\"</p>\n<p>Aizawa squeezed the bridge of his nose. \"Next time, you tell me immediately.\" He turned towards Yagi. \"Has anything like this ever happened before, or do you have any idea what happened?\"</p>\n<p>\"Not to me, no.\" Yagi steepled his hands together. \"But, there's always been rumors of… shadows, vestiges….ghosts may be residing in the quirk. When I first received One for All, I swear I occasionally saw flashed out of the corner of my eyes but nothing more. However, One for All grows stronger with every generation…and with it, so do the vestiges.\"</p>\n<p>\"What does that mean, vestiges? Are we talking about ghosts?\" Shinsou raised an eyebrow. \"Is Midoriya haunted?\" </p>\n<p>\"Well, I mean, I wouldn't go that far as to-\"</p>\n<p>Aizawa cut in. \"Yes or no, All Might. Pick one.\"</p>\n<p>\"...Yes.\"</p>\n<p>Aizawa's head throbbed, and he pressed his eyes closed. \"I do not get paid enough for this,\" he grumbled. \"Okay, fine, whatever, it makes logical sense. It explains the temperature fluctuations and light flickering. Is Midoriya possessed? Do the past users' ghosts mean harm to him?\"</p>\n<p>\"No!\" Yagi yelled, the sudden increase in volume making the children flinch. Yagi winced and pulled Midoriya close. \"I'm sorry, no. They wouldn't. Midoriya's had visions of them in the past, and they've always offered to help. However, it's possible they've been unintentionally causing issues or at least contributing to Midoriya's outbursts. Do you remember the Blackwhip appearance?\"</p>\n<p>Aizawa scowled; of course, he did. He had finally thought the problem child would stop breaking his limbs only to destroy half the training area with an out-of-control quirk. </p>\n<p>Uraraka gasped. \"Wait, are you saying Blackwhip is the quirk of a past user?\"</p>\n<p>Aizawa's head shot towards Yagi. \"Is it?\"</p>\n<p>\"It is. And during one of his visions, he was informed he would gain several other quirks from the past users.\"</p>\n<p>Shinsou whistled. \"Haunted quirks.\" </p>\n<p>\"It would explain the other quirks we saw at the auction.\" Uraraka's voice cracked, but she rallied on. \"He was floating and dodging bullets and emitting smoke.\"</p>\n<p>\"Yes, those would align with three of the past users' quirks: float, danger sense, and smokescreen.\" </p>\n<p>Iida chopped a hand. \"Then the voices we keep hearing are those the past holders of One for All speaking through the quirk and thus Midoriya?\"</p>\n<p>\"I believe so. But like I said, I don't think they mean any harm.\" </p>\n<p>Aizawa snorted. The police officers and heroes Midoriya had batted out of the air would disagree. </p>\n<p>\"My guess is that the trigger mixture pulled them to the surface as a protective measure. As the drug runs its course, its influence appears to be lessening. I believe Midoriya should return to normal.\"</p>\n<p>\"So it's like really bad quirk trauma or PTSD.\"</p>\n<p>\"Is there anything we can do to help?\" Uraraka asked, leaning forward on her stool. The other students mimicked her body language. Even Shinsou, who typically hid behind a bored veneer, was engaged. </p>\n<p>Yagi placed a hand on Midoriya's head, carding through the curls. Even asleep, Midoriya twitched, leaning into the touch. \"Right now, just recover, and Midoriya will do likewise.\" At the students' scowl, Yagi smiled lightly, \"There will be plenty of opportunities to train with him and help in other ways after.\"</p>\n<p>Midoriya let out a puff of air, almost as if in agreement, and then slowly he stirred, his eyes fluttering. </p>\n<p>\"Wait, is he waking up?\" Uraraka gasped, scrambling off her stool to rush over to Midoriya, but Aizawa held out an arm, stopping her. </p>\n<p>\"Wait.\"</p>\n<p>The last several times Midoriya had woken up had been interesting, and Aizawa didn't want to risk any more of his students getting hurt. </p>\n<p>Yagi shifted on the bed the best he could, with blackwhip still pressing him close to Midoriya. \"My boy, are you alright? I am here, and it's safe.\"</p>\n<p>Midoriya moaned, \"All Might?\" His eyes opened, thankfully their normal emerald green. </p>\n<p>Aizawa swore he could see a glimmer of tears in the corner of Yagi's eyes. \"Yes, young Midoriya, I am here.\"</p>\n<p>Midoriya struggled to sit up, his head swiveling around the room. However, when his gaze landed on Aizawa, Midoriya blanched. \"Uh-oh, hi, Mr. Aizawa.\"</p>\n<p>\"Midoriya.\"</p>\n<p>Midoriya bit his lip, bowed his head, and then blurted, \"I'M SORRY FOR ATTACKING YOU!\"</p>\n<p>The abrupt volume had everyone pulling back in surprise. Midoriya lifted his head, eyes wide and nervous as if he were apologizing for some disturbance in class. </p>\n<p><em> This kid, </em> Aizawa thought. And a rare chuckle escaped his lips. Only this kid. He chuckled again, louder. Uraraka began laughing too, then Yagi and Iida and Shinsou until everyone was laughing except for Midoriya, whose eyes were growing even larger with every laugh. His consternated expression fueled the laughter until even he was pulled in. </p>\n<p>Aizawa's panicked relief fueled his laughter until he didn't know if he wanted to laugh, cry, hide, or sleep for a week. They were safe. Everyone was safe. </p>\n<p> </p>\n<p> </p>\n<p>Recovery wasn't perfect or super simple. Despite protests from Uraraka, Iida, and Shinsou, Midoriya and Yaoyorozu were both required to stay at the hospital for a week under observation. Yaoyorozu and Midoriya both suffered from lingering aftereffects brought on by the modified trigger. Their tongues were tinted a slight black that doctors claimed would fade with time, and they were paler and weaker than before. But with every passing day, more light returned to their eyes until they were finally allowed to return to U.A. </p>\n<p>1A erupted when they walked through the doors to the dorms. The excited screams made Aizawa's ears ring, and yet he suffered through it, observing the celebration from the corner of the main room, a faint smile hidden under the folds of his capture weapon.</p>\n<p>Yagi stood next to Aizawa, and his blue eyes shimmered with barely held in tears. \"They're alright,\" he said, \"they're back where they belong.\"</p>\n<p>\"And they won't be leaving campus anytime soon,\" Aizawa grumbled, but it lacked any bite. His relief at having all of his students was too great. </p>\n<p>He watched Midoriya interact with his peers. The boy was smiling sheepishly, rubbing the back of his neck. Since waking up, Midoriya hadn't shown any sign of… possession. His eyes stayed their normal green, and his voice had lost the layered undertones. But Aizawa doubted that Midoriya's quirk was back to normal. </p>\n<p>However, his proof didn't come until 3 weeks later. </p>\n<p>Aizawa stalked through the dorm's hallways, scowling to himself. The cameras had been fritzing out the past week, the screens devolving into static before switching back on. Which meant as the teacher on duty, he didn't know if his students were alright.</p>\n<p>It was purely rational to take time away from sleeping to check in on them. This was the worst class he'd ever had. Knowing them, anything could have happened. He needed to ensure they were safe. </p>\n<p>Softening his footsteps, he patrolled the hallways, his hand never leaving his capture weapon. However, as he turned the corner on the second floor, he stopped, noting the stream of smoke he had stepped into. Biting back a curse, Aizawa looked farther down the hallway.</p>\n<p>Midoriya hovered in the air, his pale skin illuminated by the green lightning flashing across his body. Tendrils of blackwhip poked out underneath his clothes, undulating in the air. Smoke dripped out of his skin, falling to the ground and spiraling around them. As Aizawa stepped closer, Midoriya turned, his shadow flickered, turning into nine shadows instead of one.</p>\n<p>Aizawa cleared his throat, making sure that his voice came out monotone and even. \"Midoriya. What are you doing?\"</p>\n<p>His number one problem student turned, his eyes wide and swirling with a rainbow of colors. <strong>\"Eraserhead.\"</strong> The layered tones rattled Aizawa's teeth and bones. Cold seeped out of Midoriya, turning Aizawa's breath into white puffs. </p>\n<p>Aizawa debated reaching for his phone. It was in his utility belt, inches away. And with it, he could call Yagi, who was the best at calming Midoriya down.</p>\n<p>Midoriya tilted his head. <strong>\"M</strong>r. Ai<strong>za</strong>w<strong>a?</strong> I<strong>s</strong> som<strong>ethi</strong>n<strong>g wr</strong>o<strong>n</strong>g<strong>?\"</strong> </p>\n<p>His student's voice fluctuated in and out, but Aizawa would recognize that nervous tone anywhere. It was the pitch Midoriya got when something worried him, and he was preparing to do something incredibly stupid to save someone. </p>\n<p>Aizawa decided against his phone. Instead, he crossed his arms, giving Midoriya his best unimpressed teacher look. \"It's curfew, Midoriya. What are you doing up?\"</p>\n<p>Despite floating a foot off the ground and sprouting tentacles like an eldritch horror, Midoriya wilted, his lip jutting out in a pout. <strong>\"We had to know they were alright.\"</strong></p>\n<p>\"Who, Midoriya?\" </p>\n<p>But his student turned midair, gliding down the hallway to Shinsou's door. A tendril gently grasped the doorknob, opening it up enough for Midoriya to poke ahead in and then out before floating down to the next door. </p>\n<p>Aizawa poked his head in. Shinsou sat on his bed, scrolling on his phone. \"Hi, Sensei? Following Midoriya on his route?\"</p>\n<p>\"His route?\"</p>\n<p>Shinsou nodded and rubbed at his pronounced eye bags. \"He does this every couple of nights. Scared me speechless the first time. He just comes in, all spooky-like, and then leaves.\" He stifled a yawn. \"Actually nice in a creepy way. You don't normally have ghosts on your side.\" He placed his phone down on the side table and slumped into bed. \"Night.\"</p>\n<p>Aizawa retreated and closed the door behind him. Midoriya was already several doors down, going through the same routine of peeking his head in and then leaving. Aizawa followed after, the smoke curling around his legs and lights flickering randomly in their wake. </p>\n<p>Every room was the same routine, opening the door, peeking in, and then leaving without a sound. Several students were even up, waving at Aizawa when he checked in as well. None of them were surprised to see Midoriya; instead, their faces were relaxed. Like seeing Midoriya (even like this) calmed them.</p>\n<p>Finally, after every room was visited, Midoriya stopped outside his dorm room, his feet still hanging inches above the ground. Lightning scattered across his skin, connecting freckles and scars like they were a constellation of scars. Midoriya turned, his eyes a galaxy of colors. <strong>\"We had to know they were alright.\"</strong></p>\n<p>Aizawa's chest tightened. \"I understand.\" He doubted that even if he taught for another 50 years, he would never have another class like 1A or another student like Midoriya. \"But I have to know, is this One for All or Midoriya.\" </p>\n<p>Midoriya chuckled, deep and high laughter mixing together. Throughout it all, his student's voice rang clear. <strong>\"I am Midoriya, and I am One for All. We are a legacy of duty and protection and love.\"</strong> </p>\n<p>A new voice took over as the others dropped away, and surrounding Midoriya, a pale figure shimmered. Long white hair covering an eye, a soft, knowing smile. Nothing unique or noteworthy, but the aura rippling from him let Aizawa know he was in the presence of someone extraordinary. </p>\n<p>The figure smiled. <strong>\"Thank you for protecting our ninth.\"</strong> Around him, seven other figures flickered into existence. All different shapes and sizes, but each wearing that same fiercely protective but infinitely gentle look. <strong>\"He's had a difficult journey getting here. But we've seen your efforts and appreciate them, please, continue to look after him.\" </strong></p>\n<p>An unexpected wetness filled Aizawa's eyes, and when he blinked it away, the figures were gone, and Midoriya was left standing on the ground, his eyes their normal shade of green. </p>\n<p>\"Mr. Aizawa?\" he asked. </p>\n<p>All the air left Aizawa's chest in a heaping breath and grabbed Midoriya, tucking his confused student against his chest. The boy stuttered confused questions, but Aizawa said nothing, giving the boy one final tight squeeze before letting go. </p>\n<p>Midoiyra gaped at him, and Aizawa hid a smile behind his capture weapon. \"Thank you, problem child.\"</p>"
}